{"url": "https://www.seventeen.com/celebrity/celebrity-couples/a20267394/shawn-mendes-hailey-baldwin-dating-relationship-timeline/", "text": "When it comes to Shawn Mendes and Hailey Baldwin, the history is complicated. Were they friends? Were they more than friends? And though Shawn more or less admitted they were, at one point, romantically involved, he still refuses to put a label their past relationship.\n\nWell, either way, they have history! Believe it or not, they started chatting on Twitter in 2013. Seems like forever ago, right? Here's a breakdown of their friendship/possible relationship throughout the years (even though Hailey is, of course, off the market at this point).\n\nMarch 8, 2019:\n\nIt's been awhile since we talked about Shawn and Hailey. Less than a year ago they were walking the Met Gala red carpet together and now, Hailey is married. It's unclear what their relationship looks like these days, but it seems like Shawn may still be thinking about his (maybe) ex.\n\nRecently, Hailey's hubby went on a weird spree of just posting pap pics of his wife on Instagram. And, well, Shawn engaged in the content by liking this pic:\n\nOf course, everyone noticed, especially one Hailey fan account. They posted the \"like\" on their page because it's, well, interesting, considering the two celebs' history. Well, apparently Justin found it a little less interesting because he commented on that fan account's picture.\n\n\"Their (sic) friends relax,\" he wrote. Grammatical error aside, I have to wonder why Justin felt the need to comment this. Obviously, Hailey and Shawn are just friends. I mean, she's married to you, Justin! Honestly, it makes me a little bit more suspicious about what's going on in this love triangle...\n\nNovember 26, 2018:\n\nAfter I wasted countless hours listening to \"Lost in Japan\" on repeat, wondering if it was about Shawn's relationship with Hailey/if there was a relationship at all, Shawn has finally answered the age-old question.\n\nYes, he and Hailey were more than friends.\n\nIn an interview with Rolling Stone, the singer admitted that there was some romance happening (I knew it), but said \"I don’t even wanna put a title on it. I think it was more of a zone of limbo.\"\n\nHe also shared that even though Hailey got engaged to Justin like a month after they took their situationship public, he's not bitter about it.\n\n\"I get it, you know. I texted Hailey, ‘Congratulations,’ and I really am happy for them. She’s still one of the f*cking coolest people ever — she’s not just a beautiful person visually, but she’s one of the most beautiful hearts I’ve ever met,\" he gushed.\n\nShawn then finishes the interview, saying cryptically: \"I think I’m an idiot to not, you know. . . . But you can’t control your heart.\"\n\nTO NOT WHAT? To night fight for Hailey? To not see that she was in love with Justin the entire time? UGH.\n\nAugust 28, 2018:\n\nShawn just opened up about Hailey and Justin's relationship together and it seems like there's no bad blood between them.\n\n\"It’s great to see two amazing people get together,\" he told Variety. \"If you know them both separately it does make a lot of sense — a little bit of yin and yang.\"\n\nHe even called Hailey, \"one of the most beautiful souls I’ve ever met.\"\n\nShawn also opened up about his current relationship status and said that everything is meant to be right now.\n\n\"I’m not currently dating anyone, but it’s not because I don’t have time — I don’t know if I’d be dating anyone if I was home in Pickering, either. It hasn’t stumbled across me, and I’m not chasing it,\" he said. \"Of course, seeing all those other artists and people in relationships, you think, 'Maybe it would be nice; who would be great for me?' And that’s when you realize: 'This is wrong. Let it be. I’m not supposed to be with anyone right now.'\"\n\n\n\nWhile he might not be looking for a relationship right now, we're still holding out hope that one of us will get lucky enough to date Shawn in the future.\n\nAugust 14, 2018:\n\n\n\nWhile they are likely never going to get together, it seems like Shawn and Hailey are back to being friends again after Shawn liked Hailey's recent Instagram pic. The photo just featured Hailey posing in a park.\n\nInstagram\n\nWe can only imagine what Justin might think, but hopefully everything is alright in this crazy and weird love triangle.\n\nJuly 27, 2018:\n\nEven though Shawn and Hailey are clearly over (if they ever were even together), apparently there is still some leftover drama. Justin Bieber's new song with DJ Khaled, Quavo and Chance the Rapper might be about Hailey and Shawn.\n\nJust listen to the lyrics: \"You stick out of the crowd, baby, it's a no-brainer,\" Justin sings. We can only assume that is about his gorgeous fiancée. But then it gets a little more shady. \"It ain't that hard to choose. Him or me, be for real, baby, it's a no-brainer.\" Hmm sounds like maybe at some point Hailey had to make a decision between the two men.\n\nOf course, we have no concrete evidence of this intense, dramatic love triangle, but hey, it's fun to imagine.\n\nJuly 18, 2018: While being interviewed for an Australian show called The Project TV, Shawn opened up about Hailey's recent engagement to Justin Bieber and his friendship with Hailey.\n\n\"I texted Hailey the day of, and I said congrats. That's what it is,\" he said. \"I think everybody wants there to be more — there's not.\"\n\nShawn was also asked to pick a favorite Justin, either Bieber or Canadian Prime Minister Trudeau. Shawn decided to go with Trudeau but said nothing but kind things about Bieber.\n\n\"I love Bieber and Trudeau. Bieber was a massive influence for me growing up,\" he said.\n\n\n\nLooks like Shawn is taking the news a lot better than we thought he would.\n\nJuly 8, 2018: Apparently, Hailey Baldwin and Justin Bieber are engaged?! I guess Shawn is out of the picture for good at this point.\n\nJune 19, 2018: According to US Weekly, Shawn opened up about Hailey's rumored relationship with her ex, Justin Bieber, during an interview with ETALK. As you would expect, Shawn had nothing but nice things to say.\n\n\"I think that’s awesome,\" he reportedly said on the Canadian entertainment show. \"I love them both. They’re both really awesome people. When I first started out, everybody was like, 'Oh, how do you feel about being compared to Justin?' I was like, 'What do you mean, how do I feel?' That’s the best thing anyone could say to me. He’s the man.\"\n\nJune 16, 2018: Slow your roll on the Hailey X Shawn ship because something is here to seriously throw a wrench into this cute AF alleged couple theory. After officially splitting from long-time on-and-off gf Selena Gomez in May, Justin is spotted hanging out with Hailey more and more. The two grab dinner at an Italian restaurant in NYC and they're seen boarding a private jet together. But all of this news comes to a head when Hailey and Justin are spotted MAKING OUT IN BROAD DAYLIGHT in Brooklyn. Not only are there pics, but there's a freaking video capturing their kissing session. Now, this isn't to say that Justin and Hailey are back together, or that Hailey isn't playing the field. But it does make you wonder how Shawn might feel about the whole thing.\n\nMay 27, 2018: Hailey also shut down relationship rumors in a recent interview with The Times UK. \"We hang out and he's super-lovely and a very, very nice young gentleman,\" she said. \"But I am single.\"\n\nShe continued, \"The dating pool is small. It's rare to find somebody that has the same ideas and morals as me. I have found people like that before, though, which is refreshing.\"\n\nSo now that both Shawn and Hailey have come forward with their own statements, guess it's finally time to retire the idea of them dating. But the question remains, if Shawn isn't dating Hailey, then who is this new song about?!\n\nMay 25, 2018: In an interview with E! News, Shawn confirmed once and for all that he's single. But what about the Met Gala?!\n\n\"The Met Ball was such an incredible experience for me. It was just overwhelming in the most incredible way. I was so lucky for my first time going there to be able to go with someone like Hailey because she's such a vet,\" he said.\n\n\n\nShawn continued, \"I really admire people like her because of how outgoing she is in such an overwhelming experience.\"\n\nIf you want to hear what else Shawn had to say about those relationship rumors, you can watch the full clip, below.\n\nMay 21, 2018: At the Billboard Music Awards, Shawn got really weird when asked about Hailey. He was asked about the Met Gala in an interview with Extra TV and the reporter said \"you guys are a gorgeous couple,\" then things got really awkward.\n\nHe responded with an uncomfortable \"ahh ok thank you.\" Watch at the 42 second mark to experience the cringe for yourself.\n\nMay 8, 2018: In an interview with W magazine, Shawn opened up about his first Met Gala, and naturally, he was asked about his date, Hailey Baldwin. But be warned, he didn't give the answer #Shailey fans might have hoped for.\n\n\n\n\"We’re really good friends,\" he said. \"It’s funny, she’s such a pro with this type of stuff. I want it to be amazing for her, so I’ve been trying for the past 24 hours to be really silly so that she stays on. I’m happy to walk with her—she’s amazing.\"\n\nSo, what's the deal here?! Was Shawn being coy about his relationship or are the two really just friends? Honestly, I don't know what to think anymore, but stay tuned for updates! In the meantime, please enjoy this GIF, which accurately demonstrates my feelings about Shailey's mixed messages.\n\nMay 7, 2018: Shawn and Hailey made their couple debut at the 2018 Met Gala, and they looked absolutely ah-mazing in Tommy Hilfiger! Also, who else is obsessed with Hailey's pink hair?\n\nGetty Images\n\nWhile they posed for photographers, Shawn tried fixing Hailey's dress. Naturally, the internet went wild over the super sweet moment.\n\nShortly after their debut, they both shared pics on their Insta feeds.\n\nShawn made four different posts, which you can see, below. Look how happy they are!\n\nAs you might have heard, they also attended an afterparty together. In Ruby Rose's Instagram stories, you can see Shawn, Hailey, Bella Hadid, and Kendall Jenner were all in the same party bus. But it gets better! If you play the next few videos with the volume up, you'll hear Hailey lip-syncing \"The Middle\" and Shawn jamming out to Childish Gambino's \"This is America.\" It was basically the ultimate carpool karaoke.\n\nOn Twitter, fans were quick to show their approval of Shawn's song selection. \"@ShawnMendes listening to #ThisIsAmerica WE STAN,\" one fan wrote.\n\n\n\nApril 22, 2018: TBS released Shawn and Odell Beckham Jr.'s Drop the Mic episode. In case you didn't know, Drop the Mic is a music competition that Hailey cohosts.\n\nThroughout the rap battle, Odell threw shade at Shawn's music and even commented on his love life. He said, \"With all of your songs, we know how it is, a girl looks you in the eyes, saying 'Let's just be friends.'\" At that point, Hailey's jaw dropped.\n\nOf course, you'll have to watch until the end to see who won!\n\n\n\nApril 10, 2018: In an interview with NRJ Norge, Shawn was asked about the Instagram picture of him and Hailey. He explained they took the pic when he appeared on her show Drop the Mic and claimed the two are just really good friends.\n\n\"She texted me and I was like, 'That's an awesome photo. I really wish I could post that without the internet exploding,' and she's like, 'I know. It'd be so nice, wouldn't it be?' and I was like, 'You know what? I'm just going to post it,'\" he said.\n\nApril 3, 2018: Shawn posted an Instagram picture with Hailey and fans went wild!\n\nMarch 11, 2018: At the 2018 iHeartRadio Music Awards, Access Hollywood asked Hailey if her date to the event was Shawn Mendes, and she said, \"He's not even here, so how could he be my date?\"\n\nShe then added, \"He's a friend of mine and we hang out, so I see why people obviously want to make assumptions. Any guy I hang out with people are like, 'Oh, she must be dating him or something's going on,' but I don't ever really feel like I have to explain myself. It's kind of my business and the other person's business. That's it.\"\n\nDecember 23, 2017: The Sun spotted Shawn and Hailey strolling around Toronto, Canada. The outlet shared photos of the two taking pics for fans and even stopping for a cuddly hug. TMZ also featured the PDA-filled pics, which you can see, below.\n\nDecember 20, 2017: Shawn and Hailey were caught PDA-ing at a Daniel Caesar's concert at The Danforth Music Hall in Toronto, Canada. They were spotted holding hands and cuddling. In one pic, you can see Hailey resting on Shawn's chest.\n\nNovember 16, 2017: According to E! News, Shawn and Hailey's friendship naturally grew into a steamy romance. \"It started out casual as they would run into each other at parties and hangout, but most recently it's become more serious,\" a source told the site. \"They are definitely dating and spend a lot of time together.\"\n\nThey later added, \"A few months ago they were sneaking out of public venues like Delilah while trying to not make a scene and now they have gone on private vacations to Europe. Their relationship has grown and they don't care if anyone sees them now.\"\n\n\n\nNovember 13, 2017: The Sun reported Shawn and Hailey were kissing at Rita Ora's MTV EMA Awards after-party in London. \"The place was packed with stars but Shawn only had eyes for Hailey,\" a source said. \"It clearly wasn’t a one-time thing. They looked like they were seriously into each other. It was a very exclusive bash and Shawn and Hailey were really enjoying themselves, spending ages French kissing.\"\n\nA Shawn Mendes fan account posted the pic, below.\n\nShawn with hailey baldwin and rita ora at the EMAS after party!!! pic.twitter.com/7f7XibR6rE — SM Updates (@MendesNotified) November 13, 2017\n\nNovember 1, 2017: A source told People that Hailey and Shawn spent some quality time at Kylie Jenner's Halloween party. \"He had his arm around Hailey and stayed by her side all night,\" the source said. But wait, there's more! Apparently, they didn't leave the party until 1a.m. AND they left holding hands!\n\nOctober 22, 2017: Shawn and Hailey tweeted \"craY\" at exactly 4:01 a.m.\n\ncraY — Shawn Mendes (@ShawnMendes) October 22, 2017\n\nNovember 3, 2013: According to a Twitter account called PopCrave, on October 9, 2013, Hailey reportedly tweeted, \"Hey Shawn Mendes, let's date so you can sing to me all day. I'm joking but not really..\" Although it's not clear whether Hailey really tweeted that, the tweet below is absolutely real. \"Just finding out now that @haileybaldwin tweeted at me !\" Shawn wrote in November 2013.\n\nJust finding out now that @haileybaldwin tweeted at me ! — Shawn Mendes (@ShawnMendes) November 3, 2013\n\nVictoria Rodriguez is a fellow at Seventeen.com. Follow her on Twitter and Instagram!", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2018-06-18-at-2-28-23-pm-1529346510.png?crop=1.00xw:0.939xh;0,0&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2018-06-18-at-2-28-23-pm-1529346510.png?crop=1.00xw:0.939xh;0,0&resize=1200:*", "keywords": [], "authors": ["Victoria Rodriguez", "Tamara Fuentes", "Entertainment Editor", "Tamara Fuentes Is The Entertainment Editor For Seventeen", "Covers Celebrity News", "Pop Culture", "Television", "Movies", "Music"], "canonical_link": "https://www.seventeen.com/celebrity/celebrity-couples/a20267394/shawn-mendes-hailey-baldwin-dating-relationship-timeline/", "title": "Shawn Mendes and Hailey Baldwin's Relationship Timeline", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Seventeen", "title": "Shawn Mendes Just Liked A Pic of Hailey Baldwin on Instagram and Justin Bieber’s Reaction is…Awkward", "description": "I can't look away.", "url": "https://www.seventeen.com/celebrity/celebrity-couples/a20267394/shawn-mendes-hailey-baldwin-dating-relationship-timeline/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2018-06-18-at-2-28-23-pm-1529346510.png?crop=1.00xw:0.939xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 112965278727107, "pages": 8028997215}, "article": {"publisher": "https://www.facebook.com/seventeen", "modified_time": "2019-03-08 03:29:36", "published_time": "2019-03-08 03:29:00", "section": "Celeb Couples", "opinion": "false"}, "twitter": {"site": "@seventeen", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2018-06-18-at-2-28-23-pm-1529346510.png?crop=1.00xw:0.939xh;0,0&resize=640:*"}, "google-site-verification": "uQMdsrh02fvs6lNVGcB04v0iEtK1MpGMQ3UF-Fy0RVI", "title": "Shawn Mendes and Hailey Baldwin's Relationship Timeline - Hailey and Shawn Dating History", "description": "Shawn Mendes and Hailey Baldwin made their couple debut at the 2018 Met Gala. Here's everything we know about their relationship, including all those dating rumors and when they really started dating.", "keywords": "shawn mendes, hailey baldwin, shawn mendes and hailey baldwin, shawn mendes and hailey baldwin relationship, hailey baldwin boyfriend, shawn mendes girlfriend, shawn mendes and hailey baldwin dating rumors", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2018-06-18-at-2-28-23-pm-1529346510.png?crop=0.475xw:0.888xh;0.00577xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebs & Entertainment,celebrity,celebrity-couples", "sailthru.date": "2019-03-08T15:29:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2018-06-18-at-2-28-23-pm-1529346510.png?crop=1.00xw:0.939xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2018-06-18-at-2-28-23-pm-1529346510.png?crop=0.475xw:0.888xh;0.00577xw,0", "sailthru.socialtitle": "Shawn Mendes Just Liked A Pic of Hailey Baldwin on Instagram and Justin Bieber’s Reaction is…Awkward", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1551986940.0, "source": "https://www.seventeen.com", "summary": ""}