{"url": "https://www.realitytea.com/2017/08/03/real-housewives-new-york-recap-make-make/", "text": "Much like the best house party you ever attended freshmen year, last night’s Real Housewives Of New York came replete with drunken makeout sessions, naked crying in the pool, and knifings. Yes – it was epic. And I may be fangirling out so hard that I have blinders on, but I’ll say it again: This Mexico trip is serving up some of the best Housewives moments in recent memory. It’s a rare gift, and we totally deserve it after suffering through the Tom and Luann D’Agostino [de Lesseps] wedding snooze fest for eight straight episodes!\n\nWe pick up with Sonja Morgan “therapizing” Ramona Singer by the pool. She wants Ramona to admit she’s not happy. Why? Because she’s not getting banged by Mario every night but some other chick is . Fresh off her 10 minute month sobriety, Sonja is feeling loose on tequila and truth. Bethenny Frankel thinks Sonja needs to back the eff off though, shockingly defending Ramona against Sonja’s drunken tirade. Ramona screams that she’s happy, but admits she misses having a man.\n\nSince tequila-Sonja can’t concentrate on any topic for more than three consecutive seconds, she leaves Ramona alone, moving on to seducing Luann. She wants her some Countess, and she wants it now! She also wants to see some t*tties, so Bethenny strips down to her Skinnygirl bones and gives the entire group a good flash as she jumps into the pool. Tinsley Mortimer croaks that she won’t be bearing her real and “not good” boobs for anyone. And neither will Carole Radziwill, even though she boasts having the best rack in the group!\n\nAs Luann attempts to keep more tequila from entering Sonja’s bloodstream, Sonja strips down next. Then Into the pool she goes, unshaved parts (according to Ramona) and all!\n\nRamona keeps her suit on, but does join naked Bethenny in the pool. Balancing on pool noodles, the two frenemies decide this is a good time for a heart to heart. Bethenny wants Ramona to cop to what happened. She thinks Ramona meant everything she said, and she just needs to admit it. “I’m just f**ked up,” cries Ramona, “I’m a miserable person. I’m so sorry I did what I did and that I hurt you.”\n\nShouting that this sh*t has to stop, Bethenny suddenly starts crying too. Ramona doesn’t have answers for her behavior, but sobs that she doesn’t want to be a bad person. Bethenny hugs her, telling her she doesn’t think she’s a genuinely bad person. She just doesn’t want this feud to continue. Both women confess they want happiness for each other, and they agree to put closure on the past and start anew. I don’t know whether to think, Yay! Or WTF? But either way, it’s good to move on from this mess. (How long will it last is anyone’s guess, though.) By the way, are we at all concerned that Bethenny was NAKED during the entirety of this Hallmark moment?\n\nMeanwhile, poor Dorinda Medley has been assigned a downgraded version of Snatch Guard. She is hereby named Official Snatch Dresser! Wrestling Sonja’s bikini back on while Sonja lays in a catatonic state is no easy feat, but apparently Dorinda has taken her power nap today. She somehow accomplishes the impossible, while Sonja barely registers where her nose is. She quite suddenly remembers where her lips are though, using them to slobber all over Bethenny once she exits the pool. “I looooooove you, Bethenny,” slurs Sonja, obviously ready for a 365-day nap.\n\nBut there will be no sleeping yet! For dinner is served. But when the ladies aren’t ready on time, Bethenny goes nuts rounding up the herd. There is one person NOT having this pushiness: SLURINDA! She’s baaaaaaaack! And she’s ready to throw down, all-consonants-and-no-vowels style. She rants at Bethenny about “Thish being vacaaashhhhhon!” and something that sounds like “Shoo shusht show up!” before going in with her trademark crazy arm swinging. The result: One self-inflicted one stab wound, from which Dorinda feels zero pain.\n\nIt seems Gangsta Do brought her palm down on her own steak knife, so Bethenny leads her to the kitchen to put ice on it while the camera crew laugh their a$$es off . Not even registering the bloody wound on her paw, Dorinda continues to read Bethenny. She likes “loose” Bethenny, not the chick who marches around barking orders at everyone. She doesn’t have to be superwoman! Bethenny’s like, meh. But when drunk Dorinda’s therapizing turns into ranting again, Bethenny barks back that she doesn’t need this sh*t right now. So, Do walks off in a huff and…straight off a cliff? Where is she going with that hand!?!? SECURITY!!!\n\nStill trying to make her lame (and in my opinion, 85% fake) storyline happen, Tinsley apologizes to Ramona for accusing her of planting the story about her in Page Six. Ramona doesn’t care. And neither does Mexico’s fireworks schedule, because just at the moment Tinsley attempts a tiny moment of drama, they ladies run outside to watch the show.\n\nBut wait – there’s more than fireworks going on out there! Dorinda’s apparently been here all along, gearing up for round two with Bethenny. She accosts her immediately, trying to land her barbs about Bethenny wanting to be a show-off, top dog, etcetera with the very limited command of language she has left. Recognizing Dorinda’s full-in-the-bag state, Bethenny tries to get her to stand down. But Dorinda is in full CLIIIIIP! mode. “Bethenny, you’re a mean b*tch,” she snipes, which Bethenny takes as the truth finally coming out – courtesy of tequila.\n\nBack inside, Dorinda continues to rail against Bethenny. Claiming she’s always stuck up for her in the past, Dorinda now thinks Bethenny is apparently the devil. She leaves the table again, muttering, “Do your sh*t” – which sounds more like, “Dooyorshhhhhh!” But we get the idea. And so does Bethenny, who mere hours ago made up with Ramona, only to find herself with a new enemy in her crosshairs.\n\nBut where did all of this anger come from? Bethenny wonders why these drunk b*tches are coming for her out of the blue? She claims to know her flaws, and admits that being too uptight and controlling are indeed problems for her. Carole and Tinsley try to comfort Bethenny, reminding her that Dorinda does always stick up for her. She’s just drunk. Ah, but the truth comes out when Dorinda drinks, doesn’t it? And this is why Bethenny is hurt. She thinks Dorinda owes her an apology.\n\nThe next morning, the yoga mats are laid out and Ramona is ready to get rid of her bad juju. Before that, she fills Luann in on her amends with Bethenny. Luann just laughs that it’s great news, “until you screw it up again!” When Dorinda and Bethenny come down to join the group, Dorinda tries to back her sh*t up from the night before. She thinks Bethenny is a good person, but she doesn’t always have to try to be perfect. “That’s it,” she bottom lines.\n\nBethenny goes into full stonewalling mode, not even replying to Dorinda about their beef. It’s the Berkshires move she pulled on Ramona, only aimed at another blonde. But when Dorinda says she thought they were better friends than this, Bethenny reminds her that she said much more the night before than she’s copping to now. “You have a very nasty side to you,” Bethenny tells Dorinda as she walks away. Maybe so – but dang, woman! Take a look in the mirror. Or at last season. (What do they say about people in glass villas?)\n\nIn an attempt to play peacemaker, Carole finds Dorinda in her room and talks to her about the Bethenny argument. Dorinda doesn’t think she was being nasty, but confesses she needs to work on reacting aggressively when she’s irritated. Outside at yoga, Bethenny processes the same argument with Luann and Ramona (oh, the irony!). It comes down to this: Bethenny felt attacked (which she was), and Dorinda felt annoyed by Bethenny’s control issues (which is understandable). But, true to Housewives form, how these women handle their issues from here on out will likely turn into a bigger sludge pile of drama than the initial fight itself.\n\nOutside, Sonja FaceTimes with Frenchie, showing off closeups of her scabby legs to keep things extra HAWT. Back home, Frenchie is likely monogramming his phony initials into Sonja’s oversized napkins and ordering bellinis from Connor.\n\nFinally ready to face one another, Dorinda and Bethenny sit down in the yard to talk. Dorinda apologizes for being nasty to Bethenny the night before. In tears, Bethenny admits she has issues too, and she’s working on them. They hug, getting past their stuff way faster than predicted. HOORAY!\n\nIt’s time for another excursion! Ramona, who thinks all Mexican men are named Pedro, is pushed helped into the van that will whisk Tinsley, Carole, and her away to a boat. Sonja thinks Tinsley on a boat “is an oxymoron,” b*tching about her houseguest as she, Dorinda, Luann, and Bethenny get spa treatments back at the villa. She thinks Tinsley shops too much, dates too much, and has too much hair.\n\nBut the boating crew isn’t drinking the same hater-ade. Ramona cheers Tinsley’s new romance with Scott, which is taking the new couple on a jaunt to Vegas soon. Tinsley also plans to throw a “Thank you and f**k you!” party for Sonja, the woman who’s been hosting/torturing her for the past few months. Sonja thinks this party business is a slap in the face. But she’ll definitely attend it with a brokedown tiara and tattered ballgown! Make no mistake.\n\nThe boating crew has fun watching Carole pretend to deep-sea fish, Ramona dance a weird jig on the deck, and whales frolic in the ocean. “I. Love. Seeing. Sea. Life.” woodenly reflects Ramona, who is mesmerized by the actual whale tales before her, rather than the ones poking out of her low-rise jeans circa 2008. Then Carole decides to bring back a purchased fish and claim she caught it, because she’s cool like that.\n\nAfter Carole hands over her 82-pound “catch” to the kitchen staff, Luann side-eyes the bloody spectacle before her. She doesn’t believe Carole’s story – but who cares! Let them eat fish!\n\nThe trip is nearly over, and Bethenny wonders what sh*t is about to go left next? She’s glad everyone is on good terms, that Dorinda is speaking in full sentence clauses again, and that Ramona’s face has almost regrown itself. At dinner, the ladies toast their vacation, which was overall a resounding success. Then Bethenny tempts fate by asking what everyone’s “rose” and “thorn” of the trip was.\n\nIt’s Tinsley’s turn to get her slur on, as she waxes poetic about being in the helicopter. “I didn’t give a shisht if I wash gonna die or not! I thought, this is f**king siiiiick!” Instead of laughing at Tinsley’s messiness, Luann decides to put her Countess panties back on and call Tins out about dropping the F-bomb in public. Because these ladies are generally so well mannered, Tins might bring their status down? Mmm hmm. Tinsley’s like, Well you live in West Palm not Palm Beach, so whaaaaaaaah! It’s basically a middle school fight about who’s parent-purchased jeans are designer and whose are from the Gap. And it’s just…dumb.\n\nBack to the rose and thorn game! In which I want Brett Michaels standing directly in back of Ramona playing his signature tune right now. She shares that her moment with Bethenny in the pool was her “rose,” and her “thorn” was Bethenny potentially icing her out of the tequila tasting. Next, I’d like Bon Jovi hovering over Luann with You Give Love A Bad Name as she claims “My rose is my husband!” Ugggghhh. Just when you think you got out of the Tom and Lu Cheez Whiz, they pull you back in!\n\nLiterally laughing in her face, the group jokes that they’re going to commit suicide if Luann talks about her damn marriage One. More. Freaking. Time. Luann, good-natured homegirl she is, laughs at herself, saying she’ll slit her own wrists instead. She didn’t understand the game! But she does understand one thing: How to be the best baller b*tch on this vacation. Even Bethenny can tip her Skinnygirl hardhat to that.\n\nTELL US: ARE YOU GLAD BETHENNY AND RAMONA MADE UP? WILL IT LAST? WAS DORINDA SPITTING TRUTH OR JUST DRUNK? WHAT DID YOU THINK OF THE MEXICO TRIP, OVERALL?\n\nPhoto Credit: Bravo", "images": ["https://cdn1-www.realitytea.com/assets/uploads/2020/04/rhony-sonja-236x140.jpg", "https://secure-au.imrworldwide.com/cgi-bin/m?ci=au-evolve&cg=0&cc=1&ts=noscript", "https://cdn3-www.realitytea.com/wp-content/themes/realitytea/images/svg/facebook-icon.svg", "https://cdn1-www.realitytea.com/assets/uploads/2018/06/logo_realitytea.svg", "https://cdn2-www.realitytea.com/wp-content/themes/realitytea/images/svg/rss-icon.svg", "https://cdn2-www.realitytea.com/wp-content/themes/realitytea/images/svg/logo-th.svg", "https://cdn1-www.realitytea.com/assets/uploads/2017/07/Bethenny-Frankel-Naked-Pool-Mexico-RHONY.jpg", "https://cdn2-www.realitytea.com/wp-content/themes/realitytea/images/svg/twitter-icon.svg", "https://cdn1-www.realitytea.com/wp-content/themes/realitytea/images/svg/pinterest-icon.svg", "https://cdn2-www.realitytea.com/assets/uploads/2017/08/Bethenny-Frankel-Ramona-Singer-Naked-Pool-Hugging-RHONY.jpg", "https://cdn1-www.realitytea.com/assets/uploads/2020/04/rhobh-garcelle-236x140.jpg", "https://cdn2-www.realitytea.com/assets/uploads/2020/03/NUP_189419_2687-e1585426776960-236x140.jpg", "https://cdn3-www.realitytea.com/assets/uploads/2017/07/Sonja-Morgan-Luann-DAgostino-Pitcher-Grab-Mexico-RHONY.jpg", "https://cdn2-www.realitytea.com/assets/uploads/2017/08/Bethenny-Frankel-Ramona-Singer-Naked-Pool-Noodles-RHONY.jpg", "https://cdn3-www.realitytea.com/assets/uploads/2017/08/Sonja-Morgan-Green-Bikini-Drunk-Mexico-RHONY.jpg", "https://cdn3-www.realitytea.com/assets/uploads/2017/07/Dorinda-Medley-Print-Dress-Arms-On-Table-Mexico-RHONY.jpg", "https://cdn2-www.realitytea.com/wp-content/themes/realitytea/images/svg/logo-stacked.svg", "https://cdn2-www.realitytea.com/assets/uploads/2020/04/IMG_8309-236x140.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6036161&cv=2.0&cj=1", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://cdn2-www.realitytea.com/assets/uploads/2017/08/Bethenny-Frankel-Ramona-Singer-Naked-Pool-Hugging-RHONY.jpg", "keywords": [], "authors": ["Erin Martin"], "canonical_link": "https://www.realitytea.com/2017/08/03/real-housewives-new-york-recap-make-make/", "title": "The Real Housewives Of New York Recap: Make Out, Make Up", "meta_data": {"viewport": "user-scalable=1.0,initial-scale=1.0,minimum-scale=1.0,maximum-scale=1.0", "description": "The Real Housewives Of New York Recap of the Mexico vacation. bethenny and ramona have it out. Bethenny skinnydips. Dorinda slurs.", "og": {"locale": "en_US", "type": "article", "title": "The Real Housewives Of New York Recap: Make Out, Make Up - Reality Tea", "description": "The Real Housewives Of New York Recap of the Mexico vacation. bethenny and ramona have it out. Bethenny skinnydips. Dorinda slurs.", "url": "https://www.realitytea.com/2017/08/03/real-housewives-new-york-recap-make-make/", "site_name": "Reality Tea", "updated_time": "2017-08-02T22:37:57-05:00", "image": {"identifier": "https://cdn2-www.realitytea.com/assets/uploads/2017/08/Bethenny-Frankel-Ramona-Singer-Naked-Pool-Hugging-RHONY.jpg", "secure_url": "https://cdn2-www.realitytea.com/assets/uploads/2017/08/Bethenny-Frankel-Ramona-Singer-Naked-Pool-Hugging-RHONY.jpg", "width": 750, "height": 383, "alt": "The Real Housewives Of New York Recap: Make Out, Make Up"}}, "article": {"tag": "Tinsley Mortimer", "section": "Real Housewives of New York", "published_time": "2017-08-03T07:00:45-05:00", "modified_time": "2017-08-02T22:37:57-05:00"}, "fb": {"app_id": 448899675149426}, "twitter": {"card": "summary_large_image", "description": "The Real Housewives Of New York Recap of the Mexico vacation. bethenny and ramona have it out. Bethenny skinnydips. Dorinda slurs.", "title": "The Real Housewives Of New York Recap: Make Out, Make Up - Reality Tea", "image": "https://cdn2-www.realitytea.com/assets/uploads/2017/08/Bethenny-Frankel-Ramona-Singer-Naked-Pool-Hugging-RHONY.jpg"}, "generator": "AMP for WP 0.9.98.14", "google-site-verification": "LBqyyLK8qWrqIWY868cC4RSBMNqyCO6IaDcvqmgonVc"}, "movies": [], "publish_date": 1501689600.0, "source": "https://www.realitytea.com", "summary": ""}