{"url": "https://ew.com/awards/2018/01/07/oprah-winfrey-golden-globes/", "text": "Oprah Winfrey brought the Golden Globes crowd to its feet with a powerful speech during Sunday’s ceremony while calling out sexual harassers around the world: “Their time is up.”\n\nWinfrey won the Cecil B. DeMille award for lifetime achievement at this year’s Golden Globes. During her speech, Winfrey recalled watching Sidney Poitier win at the Golden Globes for 1964’s Lilies of the Field and how it was the first time she saw a black man celebrated on television. “It’s not lost on me that at this moment, there are little girls watching as I become the first black woman to receive this award,” Winfrey said.\n\nMaking a plea for a free press, Winfrey said, “I want to say I value the press more than ever before as we try to navigate these complicated times. Which brings me to this: What I know for sure is that speaking your truth is the most powerful tool we all have. I’m especially proud and inspired by all the women who felt strong enough and empowered enough to speak up and share their personal stories.”\n\nMen and women at Sunday’s Golden Globes showed remarkable solidarity in protesting sexual harassment and sexual assault in Hollywood and the world at large, promoting the new Time’s Up initiative and also wearing black to express unity.\n\n“This year, we became the story. But it’s not just a story affecting the entertainment industry, it’s one that transcends any culture or workplace,” Winfrey said, before noting that sexual misconduct affects women and men in industries that stretch beyond Hollywood.\n\nWinfrey then pivoted her speech by telling the story of Recy Taylor, who was raped by a group of white men in Alabama in 1944.\n\n“Recy Taylor died 10 days ago. She lived too many years in a culture broken by brutally powerful men. Women were not believed,” Winfrey said, before adding to the abusive men, “their time is up.”\n\nWinfrey closed her speech with a call for unity: “I want all the girls watching to know a new day is on the horizon. And when that new day finally dawns, it will be because of a lot of magnificent women, many of whom are right here in this room tonight, and some pretty phenomenal men, fighting hard to make sure they are the leaders to take us to the time where nobody has to say ‘me too’ again.”\n\nTo donate to the Time’s Up Legal Defense Fund, which will provide subsidized legal support to women and men in all industries who have experienced sexual harassment, assault, or abuse in the workplace, visit its GoFundMe page. Learn more about Time’s Up, an organization of women in entertainment combating sexual harassment and inequality, on its website.\n\n“I want all of the girls watching here now to know, that a new day is on the horizon.” @Oprah accepts the 2018 Cecil B. de Mille award. #GoldenGlobes pic.twitter.com/hbquC1GBjm — Golden Globe Awards (@goldenglobes) January 8, 2018\n\nBackstage after her speech, Winfrey added of the Globes red carpet protest, where attendees wore all-black outfits to the ceremony, “I thought here is an opportunity for a powerful growth and how do we use this moment to elevate what is happening instead of continually victimize ourselves. And so I think wearing black in solidarity is one step. I think what Time’s Up is doing with legal defense fund is a major step. It was very important to all of us that it not just be about the women of Hollywood, but to extend to the women of the world because there isn’t a culture, a religion, a workplace, that hasn’t been effected by it. And one of the reasons I wanted to tell Recy Taylor’s story is because it’s been going on for a very long time. There are so many women who’ve endured so much and remained silent and kept going because there was no other recourse and now that we’ve all joined as one voice, I think it feels like empowerment to those women who’ve never had it.”\n\nFor years, Winfrey was known as the queen of the daytime talk show with The Oprah Winfrey Show, which ran for 25 seasons from September 8, 1986, to May 25, 2011, while also scoring lead roles in critically acclaimed movies — many of which she also produced. In 1985, she costarred in Steven Spielberg’s The Color Purple, a role for which she received a Golden Globe nomination. In 1998, she produced and starred in the movie adaptation of Toni Morrison’s Pulitzer Prize-winning novel, Beloved, and later in Lee Daniels’ The Butler and Ava DuVernay’s Selma. She is also the chairman and CEO of the cable network, OWN: Oprah Winfrey Network, and founder of O, The Oprah Magazine.\n\nWinfrey’s charitable endeavors include establishing The Oprah Winfrey Leadership Academy for Girls in South Africa to provide education for girls from disadvantaged backgrounds.\n\nThe philanthropist returns to the big screen in March 2018 with the upcoming Disney adaptation of Madeleine L’Engle’s sci-fi novel A Wrinkle in Time, in which she costars alongside Mindy Kaling and Reese Witherspoon.\n\nWinfrey is the first black woman to earn the Cecil B. DeMille award; she is the 15th women and the fourth black person among the previous 64 winners.\n\nSee the full list of winners from the 75th annual Golden Globes here.", "images": ["https://secure.gravatar.com/avatar/c94654c862ed2e07d803b3fe49b1e82a?s=300&d=blank&r=g", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F10%2Fcelebrity-binge.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F11%2Frolestout.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F01%2Fgettyimages-902753408.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F09%2Flennykravitz.jpg%3Fw%3D768"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F01%2Fgettyimages-902753408.jpg", "keywords": [], "authors": ["Ruth Kinane"], "canonical_link": "https://ew.com/golden-globes/2018/01/07/oprah-winfrey-golden-globes/", "title": "Oprah Winfrey calls out sexual harassers in powerful Globes speech: 'Their time is up'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Oprah Winfrey, Cecil B. DeMille Award, Golden Globes, Golden Globes 2018, 2018 Golden Globes, oprah golden globes, why is oprah famous, oprah quotes, oprah", "news_keywords": "Oprah Winfrey, Cecil B. DeMille Award, Golden Globes, Golden Globes 2018, 2018 Golden Globes, oprah golden globes, why is oprah famous, oprah quotes, oprah", "description": "Oprah Winfrey brought the Golden Globes crowd to its feet with a powerful speech during Sunday's ceremony while calling out…", "og": {"title": "Oprah Winfrey calls out sexual harassers in powerful Globes speech: 'Their time is up'", "type": "article", "site_name": "EW.com", "url": "https://ew.com/golden-globes/2018/01/07/oprah-winfrey-golden-globes/", "description": "Oprah Winfrey brought the Golden Globes crowd to its feet with a powerful speech during Sunday's ceremony while calling out…", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F01%2Fgettyimages-902753408.jpg", "width": 1200, "height": 630}}, "pinterest": {"url": "https://ew.com/golden-globes/2018/01/07/oprah-winfrey-golden-globes/", "description": "Oprah Winfrey brought the Golden Globes crowd to its feet with a powerful speech during Sunday's ceremony while calling out…", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F01%2Fgettyimages-902753408.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/golden-globes/2018/01/07/oprah-winfrey-golden-globes/", "title": "Oprah Winfrey calls out sexual harassers in powerful Globes speech: 'Their time is up'", "description": "Oprah Winfrey brought the Golden Globes crowd to its feet with a powerful speech during Sunday's ceremony while calling out…", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F01%2Fgettyimages-902753408.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}}, "movies": [], "publish_date": 1515254400.0, "source": "https://ew.com", "summary": ""}