{"url": "https://www.psychologytoday.com/us/blog/mind-in-the-machine/201712/analysis-trump-supporters-has-identified-5-key-traits", "text": "Source: Gage Skidmore/Creative Commons\n\nThe lightning-fast ascent and political invincibility of Donald Trump has left many experts baffled and wondering, “How did we get here?” Any accurate and sufficient answer to that question must not only focus on Trump himself, but also on his uniquely loyal supporters. Given their extreme devotion and unwavering admiration for their highly unpredictable and often inflammatory , some have turned to the field of psychology for scientific explanations based on precise quantitative data and established theoretical frameworks.\n\nAlthough analyses and studies by psychologists and neuroscientists have provided many thought-provoking explanations for his enduring support, the accounts of different experts often vary greatly, sometimes overlapping and other times conflicting. However insightful these critiques may be, it is apparent that more research and examination is needed to hone in on the exact psychological and social factors underlying this peculiar human behavior.\n\nIn a recent review paper published in the Journal of Social and Political Psychology, Psychologist and UC Santa Cruz professor Thomas Pettigrew argues that five major psychological phenomena can help explain this exceptional political event.\n\n1. Authoritarian Syndrome\n\nAuthoritarianism refers to the advocacy or enforcement of strict obedience to authority at the expense of personal freedom, and is commonly associated with a lack of concern for the opinions or needs of others. Authoritarian personality syndrome—a well-studied and globally-prevalent condition—is a state of mind that is characterized by belief in total and complete obedience to one’s authority. Those with the syndrome often display toward outgroup members, submissiveness to authority, resistance to new experiences, and a rigid hierarchical view of society. The syndrome is often triggered by , making it easy for leaders who exaggerate threat or fear monger to gain their allegiance.\n\nAlthough authoritarian personality is found among liberals, it is more common among the right-wing around the world. President Trump’s speeches, which are laced with absolutist terms like “losers” and “complete disasters,” are naturally appealing to those with the syndrome.\n\nWhile research showed that Republican voters in the U.S. scored higher than Democrats on measures of authoritarianism before Trump emerged on the political scene, a 2016 Politico survey found that high authoritarians greatly favored then-candidate Trump, which led to a correct prediction that he would win the election, despite the polls saying otherwise.\n\n2. Social dominance orientation\n\nSocial dominance orientation (SDO)—which is distinct but related to authoritarian personality syndrome—refers to people who have a preference for the societal hierarchy of groups, specifically with a structure in which the high-status groups have dominance over the low-status ones. Those with SDO are typically dominant, tough-minded, and driven by self-interest.\n\nIn Trump’s speeches, he appeals to those with SDO by repeatedly making a clear distinction between groups that have a generally higher status in society (White), and those groups that are typically thought of as belonging to a lower status (immigrants and minorities).\n\nA 2016 survey study of 406 American adults published this year in the journal Personality and Individual Differences found that those who scored high on both SDO and authoritarianism were those who intended to vote for Trump in the election.\n\n3.\n\nIt would be grossly unfair and inaccurate to say that every one of Trump’s supporters have prejudice against ethnic and religious minorities, but it would be equally inaccurate to say that many do not. It is a well-known fact that the Republican party, going at least as far back to Richard Nixon’s “southern strategy,” used strategies that appealed to bigotry, such as lacing speeches with “dog whistles”—code words that signaled prejudice toward minorities that were designed to be heard by racists but no one else.\n\nWhile the dog whistles of the past were more subtle, Trump’s are sometimes shockingly direct. There’s no denying that he routinely appeals to bigoted supporters when he calls Muslims “dangerous” and Mexican immigrants “rapists” and “murderers,” often in a blanketed fashion. Perhaps unsurprisingly, a new study has shown that support for Trump is correlated with a standard scale of modern racism.\n\n4. Intergroup contact\n\nIntergroup contact refers to contact with members of groups that are outside one’s own, which has been experimentally shown to reduce prejudice. As such, it’s important to note that there is growing evidence that Trump’s white supporters have experienced significantly less contact with minorities than other Americans. For example, a 2016 study found that “…the racial and ethnic isolation of Whites at the zip-code level is one of the strongest predictors of Trump support.” This correlation persisted while controlling for dozens of other variables. In agreement with this finding, the same researchers found that support for Trump increased with the voters’ physical distance from the Mexican border.\n\n5. Relative deprivation\n\nRelative deprivation refers to the experience of being deprived of something to which one believes they are entitled. It is the discontent felt when one compares their position in life to others who they feel are equal or inferior but have unfairly had more success than them.\n\nCommon explanations for Trump’s popularity among non-bigoted voters involve economics. There is no doubt that some Trump supporters are simply angry that American jobs are being lost to Mexico and China, which is certainly understandable, although these loyalists often ignore the fact that some of these careers are actually being lost due to the accelerating pace of automation.\n\nThese Trump supporters are experiencing relative deprivation, and are common among the swing states like Ohio, Michigan, and Pennsylvania. This kind of deprivation is specifically referred to as “relative,” as opposed to “absolute,” because the feeling is often based on a skewed perception of what one is entitled to. For example, an analysis conducted by FiveThirtyEight estimated that the median annual income of Trump supporters was $72,000.\n\nIf such data is accurate, the portrayal of most Trump supporters as “working class” citizens rebelling against Republican elites may be more myth than fact.\n\n\n\nThis article was originally published at Raw Story.", "images": ["https://cdn.psychologytoday.com/sites/default/files/styles/thumbnail_50x50/public/field_blog_entry_teaser_image/2020-04/_stokkete_shutterstock_102076192_sweet_tooth-144x144-191_0-381_381.jpg?itok=MTqiqljd", "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/2017-12/trump_supporters_gage_skidmore_alternet.png?itok=9Z9wegmK", "https://cdn.psychologytoday.com/sites/all/modules/custom/pt_social_media/img/icon-share-round-facebook-md.svg", "https://cdn.psychologytoday.com/sites/all/modules/custom/pt_social_media/img/icon-share-round-twitter-lg.svg", "https://www.psychologytoday.com/sites/all/themes/pt_brand/assets/logos/logo-twitter.svg", "https://cdn.psychologytoday.com/sites/all/modules/custom/pt_social_media/img/icon-share-round-facebook-lg.svg", "https://cdn.psychologytoday.com/sites/all/modules/custom/pt_social_media/img/icon-share-round-twitter-md.svg", "https://cdn.psychologytoday.com/sites/default/files/styles/thumbnail_75x75/public/field_blog_entry_teaser_image/2020-04/dogs-happiness-obey-144x144-178_271-348_348.jpg?itok=Ot6QR0S1", "https://cdn.psychologytoday.com/sites/default/files/styles/article-inline-half/public/field_blog_entry_images/2017-12/trump_supporters_gage_skidmore_alternet.png?itok=x_Kg_0lf", "https://cdn.psychologytoday.com/sites/default/files/styles/profile_bottom/public/field_user_blogger_photo/Bobby-Azarian.jpg?itok=h-qYq82Y", "https://www.psychologytoday.com/sites/all/themes/pt_brand/assets/logos/logo-instagram.svg", "https://www.psychologytoday.com/sites/all/themes/pt_brand/assets/icons/icon-check-circle-gray.svg", "https://cdn.psychologytoday.com/sites/all/modules/custom/pt_social_media/img/icon-share-round-email-md.svg", "https://cdn.psychologytoday.com/sites/all/modules/custom/pt_social_media/img/icon-share-chat-md.svg", "https://cdn.psychologytoday.com/sites/default/files/styles/thumbnail_50x50/public/field_blog_entry_teaser_image/2020-04/shutterstock_1674180070-144x144-196_0-668_667.jpg?itok=n0ZCI22m", "https://cdn.psychologytoday.com/sites/default/files/styles/thumbnail_50x50/public/field_blog_entry_teaser_image/2020-04/franziska2-144x144-0_0-575_576.jpg?itok=C9xrODyM", "https://cdn.psychologytoday.com/sites/default/files/styles/thumbnail_75x75/public/field_blog_entry_teaser_image/2020-04/24459153_s-144x144-197_0-564_565.jpg?itok=bnpzyXh2", "https://cdn.psychologytoday.com/sites/default/files/styles/thumbnail_50x50/public/field_blog_entry_teaser_image/2020-04/1248188-144x144-0_0-385_385.jpg?itok=5IiDMe_o", "https://cdn.psychologytoday.com/sites/default/files/styles/profile/public/field_user_blogger_photo/Bobby-Azarian.jpg?itok=2wAO01mx", "https://cdn.psychologytoday.com/sites/default/files/styles/thumbnail_75x75/public/field_blog_entry_teaser_image/2017-11/generous_by_josh_boot_unsplash_licensed_under_cc_by_2-144x144-979_0-3836_3840.0.jpg?itok=crTO7PRO", "https://cdn.psychologytoday.com/sites/default/files/styles/thumbnail_75x75/public/field_blog_entry_teaser_image/2020-04/woman-in-gray-tank-top-looking-serious-3812728-144x144-1180_0-5456_5461.jpg?itok=wUtK7_BA", "https://cdn.psychologytoday.com/sites/default/files/styles/thumbnail_75x75/public/field_blog_entry_images/2020-04/messyroom.jpg?itok=JxbObNBr", "https://cdn.psychologytoday.com/sites/all/modules/custom/pt_social_media/img/icon-share-round-email-lg.svg", "https://www.psychologytoday.com/sites/all/themes/pt_brand/assets/logos/logo-facebook.svg"], "top_img": "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/2017-12/trump_supporters_gage_skidmore_alternet.png?itok=9Z9wegmK", "keywords": [], "authors": [], "canonical_link": "https://www.psychologytoday.com/us/blog/mind-in-the-machine/201712/analysis-trump-supporters-has-identified-5-key-traits", "title": "An Analysis of Trump Supporters Has Identified 5 Key Traits", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "alexaVerifyID": "ruuD3Gzrr-EaY185APFbxF69Va4", "google-site-verification": "TW94BxD1361EMEu31uuXtY9b9OZtw-oTmSBh3hWhzis", "y_key": "0f29d521db0a2863", "msvalidate.01": "9AD6650A37790044983CFB6B27D77607", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Psych Today", "twitter": {"creator": "@PsychToday", "description": "A new report sheds light on the psychological basis for Trump's support.", "title": "An Analysis of Trump Supporters Has Identified 5 Key Traits", "site": "@PsychToday", "card": "summary_large_image", "image": "https://cdn.psychologytoday.com/sites/default/files/field_blog_entry_images/2017-12/trump_supporters_gage_skidmore_alternet.png"}, "og": {"title": "An Analysis of Trump Supporters Has Identified 5 Key Traits", "type": "website", "app_id": 220580041311284, "image": "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/2017-12/trump_supporters_gage_skidmore_alternet.png?itok=9Z9wegmK", "description": "A new report sheds light on the psychological basis for Trump's support.", "url": "https://www.psychologytoday.com/blog/mind-in-the-machine/201712/analysis-trump-supporters-has-identified-5-key-traits", "site_name": "Psychology Today"}, "fb": {"app_id": 220580041311284}, "description": "The president's backers share some consistent and troubling characteristics."}, "movies": [], "publish_date": null, "source": "https://www.psychologytoday.com", "summary": ""}