{"url": "globalnews.ca/news/4120293/justin-bieber-religion/", "text": "On Easter Sunday, Justin Bieber shared a message with fans, reminding them that the holiday “is not about a bunny,” and explaining how religion has made him feel “set free from bondage and shame.”\n\nBieber took to social media to write that, “Jesus has changed my life.”\n\n“Easter is not about a bunny,” Bieber wrote, “It’s a reminder that my Jesus died on the cross for my sins and then rose from the dead defeating death! I believe this happened and it changes everything!”\n\nREAD MORE: Justin Bieber’s paparazzi run-ins: Is the Canadian singer changing his tune?\n\n“I am set free from bondage and shame, I am a child of the most high God and he loves me exactly where I am, how I am, for who I am,” the Canadian pop star concluded.\n\nStory continues below advertisement\n\nBieber later shared a selfie of himself wearing a bunny mask, with the caption: “Remember when I said Easter isn’t about bunnies…. well I lied.”\n\nREAD MORE: Bill Hader, Jay Pharoah confirm Justin Bieber was ‘worst-behaved’ guest on ‘SNL’\n\nFor the last two years, the Sorry singer has attended services by the Hillsong Church, a global Pentecostal church that originated in Australia.\n\nStory continues below advertisement\n\nHillsong is known for its Christian rock style of music, tattooed leaders (like Carl Lentz) and the hipster duds they wear. Bieber isn’t the only young star to embrace Hillsong. Vanessa Hudgens is an attendee, as is the occasional Kardashian (Kourtney) and Baldwin (Hailey).\n\nBieber hasn’t been afraid to openly embrace his new-found faith. In October, he posted a tribute to his church leader Josh Mehl for the impact he has had on the singer’s life.\n\n“I have learned so much from you,” Bieber wrote at the time. “I’m a better man because of you. I’m a better friend because of you. You have been a true example of what Following Jesus looks like and I’m so grateful I get to walk through this life knowing you!”\n\nREAD MORE: Justin Bieber cancels remainder of Purpose World Tour\n\nHis message came in the wake of the backlash he received after he cancelled the last leg of his Purpose tour last summer.\n\nStory continues below advertisement\n\nBieber addressed the cancellations back in August, writing, “Me taking this time right now is me saying I want to be SUSTAINABLE..I want my career to be sustainable, but I also want my heart and soul to be sustainable. So I can be the man I want to be, the husband I eventually want to be and the father I want to be. This message is just an opportunity for you to know my heart, I’m not expecting anyone to understand, but I do want people to have an opportunity to know where I am coming from.”\n\nREAD MORE: Who is Carl Lentz? A closer look at Justin Bieber’s HillsongNYC pastor\n\nLentz, HillsongNYC pastor and Bieber’s pastor, Judah Smith, baptized the singer four years ago in the custom extra-long bathtub of basketball star Tyson Chandler after the singer declared at 2 a.m. one frigid New York night that he was ready. They couldn’t find a place to get it done until Lentz called his friend Chandler.\n\n“That man got out of bed. His wife, Kim, they opened up their house and we went in there and we just made it happen, and it was awesome,” Lentz said. “It was a credit to Justin for being so passionate and relentless in his pursuit that that night to him was a must. It wasn’t a maybe.”\n\nLentz has also revealed that Bieber lived with him for awhile.\n\nStory continues below advertisement\n\n“Yeah, there was a period where he just needed to get out of dodge, his regular life, and lived with us,” Lentz said of Bieber. “He’s got an amazing mom and dad but in this regard we thought maybe it would be cool for a little bit just to check out of the grind that you’re in as one of the biggest stars in the world and just be normal.”\n\nLast July, Bieber and Lentz attended the Hillsong Conference in Sydney, Australia. The pair discussed what they’d been doing at the conference.\n\n“We came over with some ideas, and I feel like God’s exceeded them,” Lentz said.\n\n“That’s a fact,” Bieber agreed.\n\nREAD MORE: Justin Bieber avoided ‘real damage’ by cancelling tour, John Mayer says\n\nBefore the pair ended the interview they left some “good words for anybody to encourage.”\n\n“God is able, we’ve seen that in our lives. This conference has reminded me of that,” Lentz said.\n\n“What would Jesus do,” Bieber said before he showed off his bracelet that read “W.W.J.D.”\n\nREAD MORE: Ariana Grande’s One Love Manchester concert: 13 incredible moments\n\nBieber also praised God extensively at the charity concert, One Love Manchester, to raise funds for the victims of the terror attack at Ariana Grande’s concert.\n\nStory continues below advertisement\n\n“God is good in the midst of the darkness. God is good in the midst of the evil. God is in the midst, no matter what is happening in the world, God is in the midst and he loves you and he is here for you,” he said on stage before performing acoustic versions of Love Yourself and Cold Water.\n\n—With files from the Associated Press", "images": ["https://shawglobalnews.files.wordpress.com/2016/07/katie_scott_img_8302-e1585682373283.png?w=136&h=136&crop=1", "https://s2.wp.com/wp-content/themes/vip/shaw-globalnews/assets/dist/images/shield.png", "https://s2.wp.com/wp-content/themes/vip/shaw-globalnews/assets/dist/images/alert-red.png", "https://s2.wp.com/wp-content/themes/vip/shaw-globalnews/assets/dist/images/shield-blue.png", "https://s2.wp.com/wp-content/themes/vip/shaw-globalnews/assets/dist/images/logo-corus.svg", "https://shawglobalnews.files.wordpress.com/2018/04/gettyimages-504235864.jpg?quality=70&strip=all&w=720", "https://sb.scorecardresearch.com/p?c1=2&c2=3005670&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://s2.wp.com/wp-content/themes/vip/shaw-globalnews/assets/dist/images/alert.png", "https://s2.wp.com/wp-content/themes/vip/shaw-globalnews/assets/dist/images/morty.svg", "https://s2.wp.com/wp-content/themes/vip/shaw-globalnews/assets/dist/images/logo-black.svg", "https://pixel.wp.com/b.gif?v=noscript", "https://shawglobalnews.files.wordpress.com/2018/04/gettyimages-504235864.jpg?quality=70&strip=all&w=720&h=379&crop=1", "https://s2.wp.com/wp-content/themes/vip/shaw-globalnews/assets/dist/images/logo-mobile.svg"], "top_img": "https://shawglobalnews.files.wordpress.com/2018/04/gettyimages-504235864.jpg?quality=70&strip=all&w=720&h=379&crop=1", "keywords": [], "authors": ["Katie Scott", "Global News", "Posted April"], "canonical_link": "http://globalnews.ca/news/4120293/justin-bieber-religion/", "title": "Justin Bieber says religion ‘set me free from bondage and shame’", "meta_data": {"theme-color": "#133F6F", "viewport": "width=device-width, initial-scale=1.0", "title": "Justin Bieber says religion ‘set me free from bondage and shame’  | Globalnews.ca", "description": "Justin Bieber took to social media to write that, \"Jesus has changed my life.\"", "keywords": "Justin Bieber, Bieber, bieber carl lentz, carl lentz, justin bieber 2018, justin bieber faith, Justin Bieber Instagram, justin bieber next album, justin bieber religion, justin bieber social media, justin bieber twitter, Entertainment", "news_keywords": "Justin Bieber, Bieber, bieber carl lentz, carl lentz, justin bieber 2018, justin bieber faith, Justin Bieber Instagram, justin bieber next album, justin bieber religion, justin bieber social media, justin bieber twitter, Entertainment", "article": {"tag": "Entertainment"}, "og": {"title": "Justin Bieber says religion ‘set me free from bondage and shame’", "description": "Justin Bieber took to social media to write that, \"Jesus has changed my life.\"", "type": "article", "url": "https://globalnews.ca/news/4120293/justin-bieber-religion/", "site_name": "Global News", "image": "https://shawglobalnews.files.wordpress.com/2018/04/gettyimages-504235864.jpg?quality=70&strip=all&w=720&h=379&crop=1"}, "twitter": {"title": "Justin Bieber says religion ‘set me free from bondage and shame’", "url": "https://globalnews.ca/news/4120293/justin-bieber-religion/", "description": "Justin Bieber took to social media to write that, \"Jesus has changed my life.\"", "card": "summary_large_image", "site": "@globalnews", "image": "https://shawglobalnews.files.wordpress.com/2018/04/gettyimages-504235864.jpg?quality=70&strip=all&w=720&h=379&crop=1"}, "fb": {"app_id": 318812448281278, "pages": 91251252807}, "ia": {"markup_url": "https://globalnews.ca/news/4120293/justin-bieber-religion/?ia_markup=1"}, "application-name": "Global News", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://globalnews.ca/feed/;icon-uri=https://secure.gravatar.com/blavatar/134ef81f5668dc78080f6bd19ca2310b?s=16"}, "movies": [], "publish_date": null, "source": "http://globalnews.ca", "summary": ""}