{"url": "https://teenkidsnews.com/tkn-news/travel/who-is-bts-everything-you-need-to-know-about-the-korean-pop-boy-band/", "text": "Katy Perry may be the most followed person on Twitter, but she’s not the most talked about.\n\nThat honor goes to K-pop band BTS, which Twitter revealed was not only the most tweeted-about artist in the U.S. in 2017, but the most tweeted-about celebrity on the planet this year. So who are the social-media all-stars, who can amass nearly 400,000 retweetsfor a mere 13-second clip of a band member sleeping? We explore the phenomenon behind the breakout group.\n\nWHO THEY ARE: BTS is a South Korean boy band consisting of seven members ages 20 to 25, whose stage names are RM, Jin, Suga, J-Hope, V, Jimin and Jungkook. After a series of lineup switches by management Big Hit Entertainment, the current iteration of the band was formed in 2013, when they released their first album, 2 Cool 4 Skool. Although their Korean name, “Bangtan Sonyeondan,” literally translates in English to “Bulletproof Boy Scouts,” they announced this summer that they were changing it to “Beyond the Scene,” as part of a shift to a more progressive, mature brand identity.\n\nWHERE YOU’VE HEARD THEM: In September, BTS became the first K-pop act in history to hit the top 10 of the Billboard 200 album chart, where their fifth EP, Love Yourself: Her, debuted at No. 7 with 31,000 equivalent album units, according to Nielsen Music. Their popularity continued to surge this fall, with candy-coated single DNA peaking at No. 67 on the Hot 100 singles chart in October, and performances of the EDM-tinged track on the American Music Awards and The Ellen DeGeneres Show last month. They’ve also collaborated with U.S. artists including The Chainsmokers (Best of Me), Steve Aoki and Desiigner (Mic Drop, whose remix debuted at No. 28 on the Hot 100 this month).\n\nWHY THEY’RE HUGE: The BTS ARMY, as they call themselves, is one of the mightiest fandoms in music right now, with factions in America and abroad running countless fan pages online, and snapping up tickets to their completely sold out world tour this year.\n\nBut why have they inspired such a feverish devotion? For starters, they’re filling a void left by another cobbled-together band of international heartthrobs, the U.K.’s One Direction, who split up in 2015 to pursue successful solo careers. Their good looks, goofy interviews and unguarded, relatable posts on their personal social media accounts are all fawned over incessantly, with each of the guys averaging roughly 2.5 million Instagram followers or more (with more than 20 million fans across their band’s official Twitter, Instagram and Facebook pages).\n\nAnd while their fan base does skew heavily toward young women — many of whom connect with other fans globally through the ARMY Amino app, and have lists of chants rehearsed for every concert — the band’s fusion of other genres such as rap and Moombahton into their music has helped broaden their appeal. Online music service Melon, for instance, found that male users in their 20s and 30s tended to listen to recent single Blood, Sweat and Tears more than female fans.\n\nPerhaps most crucially, they stand out from other K-pop bands because of their empowering messages for young people who feel like they’re outcasts and underdogs. Songs like Whalien 52 and The Last address mental illness and depression head on, while others such as Spine Breaker and Change featuring Wale take on consumerism, racism and politics.\n\n“They go a lot deeper than a lot of K-pop music,” says Jeff Benjamin, who writes about K-pop for Billboard. “I think that’s one of the main reasons BTS has been able to break out as big as (they have). They really try to make music that’s socially conscious.”\n\nWHAT’S NEXT: Guesting on On Air with Ryan Seacrest, BTS teased the possibility of releasing English-language versions of their hit songs.", "images": ["data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAANoAAACWAQMAAACCSQSPAAAAA1BMVEWurq51dlI4AAAAAXRSTlMmkutdmwAAABpJREFUWMPtwQENAAAAwiD7p7bHBwwAAAAg7RD+AAGXD7BoAAAAAElFTkSuQmCC", "https://teenkidsnews.com/wp-content/uploads/2017/04/tkn-2017-logo2-300x99.jpg", "https://teenkidsnews.com/wp-content/uploads/2017/04/tkn-2017-logo-300x99.jpg", "https://goodmomusic.net/wp-content/uploads/2015/07/DSCN0678.jpg", "https://teenkidsnews.com/wp-content/uploads/2018/03/bts.jpg", "https://images6.fanpop.com/image/photos/38500000/BTS-2nd-Anniversary-Real-Family-Picture-part-1-bts-38547448-2000-1429.jpg", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAGQAAABGAQMAAAAASKMqAAAAA1BMVEWurq51dlI4AAAAAXRSTlMmkutdmwAAABBJREFUKM9jGAWjYBQMKwAAA9QAAQWBn6cAAAAASUVORK5CYII="], "top_img": "https://teenkidsnews.com/wp-content/uploads/2018/03/bts.jpg", "keywords": [], "authors": [], "canonical_link": "https://teenkidsnews.com/tkn-news/travel/who-is-bts-everything-you-need-to-know-about-the-korean-pop-boy-band/", "title": "Who Is BTS? Everything You Need to Know About the Korean-Pop Boy Band", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "og": {"locale": "en_US", "type": "article", "title": "Who Is BTS? Everything You Need to Know About the Korean-Pop Boy Band", "description": "Katy Perry may be the most followed person on Twitter, but she's not the most talked about. That honor goes to K-pop band BTS, which Twitter revealed was not only the most tweeted-about artist in the U.S. in 2017, but the most tweeted-about celebrity on the planet this year. So who are the social-media all-stars, who can amass nearly 400,000 retweetsfor a mere 13-second clip of a band member sleeping? We explore the phenomenon behind the breakout group. WHO THEY ARE: BTS is a South Korean boy band consisting of seven members ages 20 to 25, whose stage names are RM, Jin, Suga, J-Hope, V, Jimin and Jungkook. After a series of lineup", "url": "https://teenkidsnews.com/tkn-news/travel/who-is-bts-everything-you-need-to-know-about-the-korean-pop-boy-band/", "site_name": "Teen Kids News", "updated_time": "2018-12-16T17:51:35+00:00", "image": "https://teenkidsnews.com/wp-content/uploads/2018/03/bts.jpg"}, "article": {"section": "Art+Culture", "published_time": "2018-12-16T10:36:26+00:00", "modified_time": "2018-12-16T17:51:35+00:00"}, "generator": "WordPress 4.9.4"}, "movies": ["https://www.youtube.com/embed/MPNuYaa111U?enablejsapi=1&feature=oembed&wmode=opaque&vq=hd720&&&", "https://www.youtube.com/embed/rD5gOtb8Xno?feature=oembed", "https://www.youtube.com/embed/UoPSzHQPwgA?feature=oembed"], "publish_date": 1544956586.0, "source": "https://teenkidsnews.com", "summary": ""}