{"url": "https://people.com/music/kanye-west-wears-make-america-great-again-hat/", "text": "Kanye West doesn’t care if his political leanings offend you.\n\nWhile the world could not stop talking about the “Power” rapper’s opinions, it was business as usual for the star.\n\nGet push notifications with news, features and more.\n\nThe musician, 40, strolled out his office in Calabasas, California, on Wednesday wearing a red “Make America Great Again” hat and his phone in hand after a full day of controversial tweets (over 80!), some of which declared his love for President Donald Trump.\n\nWest called Trump “my brother” in a series of tweets early Wednesday, writing, “You don’t have to agree with trump [sic] but the mob can’t make me not love him. We are both dragon energy. He is my brother. I love everyone. I don’t agree with everything anyone does. That’s what makes us individuals. And we have the right to independent thought.”\n\nImage zoom Kanye West steps out in a ‘Make America Great Again’ baseball cap BAHE / BACKGRID\n\nHe continued, “If your friend jumps off the bridge you don’t have to do the same. Ye being Ye is a fight for you to be you. For people in my life the idea of Trump is pretty much a 50 50 split but I don’t tell a Hillary supporter not to support Hillary I love Hillary too.”\n\nWest later tweeted a closeup photo of his MAGA hat signed by Trump with over 30 fire emojis, writing “my MAGA hat is signed.”\n\nA short while later, West said that he had spoken to his wife Kim Kardashian West about his previous tweets.\n\n“My wife just called me and she wanted me to make this clear to everyone,” he wrote. “I don’t agree with everything Trump does. I don’t agree 100% with anyone but myself.”\n\nTrump later responded to West, tweeting “Thank you Kanye, very cool!”\n\nA source told PEOPLE on Wednesday the rapper wasn’t concerned with people’s opinions on his political views.\n\n“He’s actually not as upset as you’d think about what’s being said,” a source close to West said. “He just thinks that no one gets his genius.”\n\n“He hated the word erratic, but he likes to say that genius is erratic,” the insider continues, referencing the term a different source close to West used to describe him. “You can’t be a genius if you’re not erratic in some way. So it’s not wrong, but he thinks it’s more than being erratic.”\n\nWest’s friend, John Legend, seemed to take issue with the rapper’s tweets supporting Trump. He shared a series of cryptic Twitter posts in which he spoke of oppression continuing in the country.\n\n“I love that great, brilliant artists have the power to imagine a better future. But artists can’t be blind to the truth,” he tweeted.\n\nRELATED: Kim Kardashian Defends Husband Kanye West’s Twitter Sprees: ‘He’s a Free Thinker’\n\n“The defining trait of Trump’s campaign and political profile was his embrace of white supremacy. He made it clear every time he spoke,” he added. “Some serious cognitive dissonance to ignore that for the other x% you might find appealing. I guess I agree with >1% of anyone’s thoughts though.”\n\nChance the Rapper also shared that he had spoken to West “two days ago” and adding that “he’s in a great space.”\n\nOn the subject of West’s support for Trump, the Grammy-winning rapper tweeted, “Black people don’t have to be democrats,” and “Next President gon be independent.”\n\nThis week, multiple sources told PEOPLE that West, 40, had cut off contact with several people in his inner circle, including his managers, lawyers and closest friends. The rapper confirmed he stopped working with a manager on Wednesday morning, tweeting, “I no longer have a manager. I can’t be managed.”\n\nWant to keep up on the latest from PEOPLE? Sign up for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\nRELATED VIDEO: Kanye West Has Had ‘Explosive’ Fights With Kris Jenner & Kim Kardashian Can’t ‘Control’ Him: Sources\n\nThe Keeping Up with the Kardashians star also addressed her husband’s tweets on Trump, writing, “When he spoke out about Trump… Most people (including myself) have very different feelings & opinions about this.”\n\n“But this is HIS opinion,” she continued. “I believe in people being able to have their own opinions, even if really different from mine.”\n\n“He never said he agrees with his politics,” she added.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1299&h=680&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkanye-west-maga-hat-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkanye-west-maga-hat-1.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1299&h=680&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkanye-west-maga-hat-1.jpg", "keywords": [], "authors": ["Alexia Fernandez"], "canonical_link": "https://people.com/music/kanye-west-wears-make-america-great-again-hat/", "title": "Kanye West Steps Out in a 'Make America Great Again' Cap Despite Backlash Over Pro-Trump Tweets", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Celebrities,Celebrities and Politics,Donald Trump,Kanye West,Music News,News,Politics", "news_keywords": "Celebrities,Celebrities and Politics,Donald Trump,Kanye West,Music News,News,Politics", "description": "Kanye West doesn't care if his political leanings offend you", "og": {"title": "Kanye West Steps Out in a 'Make America Great Again' Cap Despite Backlash Over Pro-Trump Tweets", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/music/kanye-west-wears-make-america-great-again-hat/", "description": "Kanye West doesn’t care if his political leanings offend you. While the world could not stop talking about the “Power” rapper’s opinions, it was business&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1299&h=680&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkanye-west-maga-hat-1.jpg", "width": 1299, "height": 680}}, "pinterest": {"url": "https://people.com/music/kanye-west-wears-make-america-great-again-hat/", "description": "Kanye West doesn't care if his political leanings offend you", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkanye-west-maga-hat-1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/music/kanye-west-wears-make-america-great-again-hat/", "title": "Kanye West Steps Out in a 'Make America Great Again' Cap Despite Backlash Over Pro-Trump Tweets", "description": "Kanye West doesn't care if his political leanings offend you", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1299&h=680&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkanye-west-maga-hat-1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}