{"url": "www.thefutoncritic.com/showatch/shameless/", "text": "[01/13/20 - 12:10 PM]\n\nShowtime(R) Announces 11th and Final Season of \"Shameless\" to Premiere This Summer\n\n\"I'm unbelievably thankful for all of the years of support from Gary Levine and everyone at Showtime that's allowed us to make 'Shameless,'\" said John Wells.\n\n\n\n\n\n[10/29/19 - 11:44 PM]\n\nDevelopment Update: Tuesday, October 29\n\nUpdates include: HBO nixes Naomi Watts-led \"Game of Thrones\" prequel series; AMC cancels \"Lodge 49\" after two seasons; and Sony Pictures Television moves forward with \"Dr. Oz\" spin-off.\n\n\n\n\n\n[10/01/19 - 11:52 PM]\n\nDevelopment Update: Tuesday, October 1\n\nUpdates include: ABC cancels summer drama \"Grand Hotel\"; Ava DuVernay to bring comic book series \"DMZ\" to HBO Max; and Winston Duke to lead \"Swagger\" for Apple TV+.\n\n\n\n\n\n[09/19/19 - 12:01 PM]\n\nShowtime(R) Programming Advisory\n\nThe network details various changes to its upcoming Sunday schedule.\n\n\n\n\n\n[09/16/19 - 11:45 PM]\n\nDevelopment Update: Monday, September 16\n\nUpdates include: \"Saturday Night Live\" parts ways with Shane Gillis; Netflix nixes \"No Good Nick\"; and Justin Theroux, Charlie Hunnam set as leads on new Apple TV+ series.\n\n\n\n\n\n[09/13/19 - 09:06 AM]\n\nVideo: Showtime(R) Releases New Trailer for \"Shameless\"\n\nPlus: the series will now return on Sunday, November 10 at 9:00/8:00c.\n\n\n\n\n\n[09/05/19 - 11:35 PM]\n\nDevelopment Update: Thursday, September 5\n\nUpdates include: Hulu shelves \"The Grisham Universe\"; Joseph Gordon-Levitt to lead \"Mr. Corman\" for Apple TV+; and Gary Sinise signs onto Netflix's \"13 Reasons Why.\"\n\n\n\n\n\n[08/09/19 - 11:23 PM]\n\nDevelopment Update: Friday, August 9\n\nUpdates include: Kether Donohue joins Darren Criss in Quibi's \"Royalties\"; Rachel Dratch, Anthony Alabi to recur on Showtime's \"Shameless\"; and Debra Jo Rupp to re-team with Kurtwood Smith on ABC's Nate Bargatze comedy pilot.\n\n\n\n\n\n[08/02/19 - 03:10 PM]\n\nShowtime Announces Fall Premiere Dates for Returning Hit Series \"Shameless,\" \"Kidding\" and \"Ray Donovan\"\n\n\"Shameless\" and \"Kidding\" are both due on November 3 with \"Ray Donovan\" returning November 17.\n\n\n\n\n\n[06/20/19 - 11:44 PM]\n\nDevelopment Update: Thursday, June 20\n\nUpdates include: John Wells inks massive overall deal to stay at Warner Bros. Television; HBO's \"Lovecraft Country\" casts trio; and Alex Cary sets up shop at Sony Pictures Television.\n\n\n\n\n\n[06/05/19 - 11:22 PM]\n\nDevelopment Update: Wednesday, June 5\n\nUpdates include: NBC eyes series based on Dan Brown's Robert Langdon character; Elizabeth Hurley cast as Morgan le Fay in \"Marvel's Runaways\" at Hulu; and Ivan Sergei to recur on FOX's \"BH90210.\"\n\n\n\n\n\n[04/11/19 - 11:33 PM]\n\nDevelopment Update: Thursday, April 11\n\nUpdates include: \"Love, Simon,\" \"The Sandlot\" both eyed as TV series for Disney+; Jake Gyllenhaal to star in limited series \"Lake Success\" at HBO; and Iain Glen cast as Bruce Wayne in DC Universe's \"Titans.\"\n\n\n\n\n\n[01/31/19 - 10:08 AM]\n\nShowtime Picks Up Another Season of Its Hit Series \"Shameless\"\n\nThe renewal will make \"Shameless\" the longest running series ever on Showtime.\n\n\n\n\n\n[10/08/18 - 11:31 PM]\n\nDevelopment Update: Monday, October 8\n\nUpdates include: The CW orders additional scripts for its freshman dramas; Jessica Biel to star in \"Limetown\" for Facebook Watch; and Cameron Monaghan announces exit from Showtime's \"Shameless.\"\n\n\n\n\n\n[09/11/18 - 11:22 PM]\n\nDevelopment Update: Tuesday, September 11\n\nUpdates include: Vincent D'Onofrio cast in Epix's \"Godfather of Harlem\"; Melanie Griffith among latest bound for Showtime's \"SMILF\"; and Shane West to recur on final season of FOX's \"Gotham.\"\n\n\n\n\n\n[08/30/18 - 11:48 PM]\n\nDevelopment Update: Thursday, August 30\n\nUpdates include: Emmy Rossum announces exit from Showtime's \"Shameless\"; Jennifer Esposito tapped for Amazon's \"The Boys\"; and Jimmi Simpson joins Sir Ben Kingsley-led \"Our Lady, LTD\" at Epix.\n\n\n\n\n\n[08/24/18 - 11:19 PM]\n\nDevelopment Update: Friday, August 24\n\nUpdates include: Suzy Nakamura cast in HBO's \"Avenue 5\"; Kirby Howell-Baptiste to recur on NBC's \"The Good Place\"; and Katey Sagal, Courteney Cox to both visit Showtime's \"Shameless.\"\n\n\n\n\n\n[08/23/18 - 11:41 PM]\n\nDevelopment Update: Thursday, August 23\n\nUpdates include: Apple orders Isaac Asimov's \"Foundation\" to series; Kenya Barris sells latest \"Bewitched\" reboot to ABC; and Freeform passes on \"Young & Hungry\" wrap-up movie.\n\n\n\n\n\n[08/06/18 - 05:05 PM]\n\nShowtime(R) Announces 14-Episode Order for Season Nine of \"Shameless\"\n\nThe first seven episodes will begin airing on Sunday, September 9, with a midseason finale on Sunday, October 21.\n\n\n\n\n\n[07/26/18 - 12:02 PM]\n\nVideo: Showtime(R) Releases the Official Trailer and Poster for Season Nine of the Network's No. 1 Comedy \"Shameless\"\n\nStarring William H. Macy and Emmy Rossum, \"Shameless\" is one of the network's longest-running and most successful series ever and attracts the youngest-skewing audience of any Showtime series.\n\n\n\n\n\n[06/22/18 - 11:40 PM]\n\nDevelopment Update: Friday, June 22\n\nUpdates include: ABC pulls \"The Proposal\" episode over allegations against its participant; Victor Williams joins \"Happy Together\" at CBS; and Nathalie Kelley not returning to The CW's \"Dynasty.\"\n\n\n\n\n\n[06/14/18 - 11:42 PM]\n\nDevelopment Update: Thursday, June 14\n\nUpdates include: \"Star Trek: Discovery\" makes another showrunner change; Leah Remini to star in multi-camera pilot for FOX; and Peter Outerbridge tapped for Netflix's \"V-Wars.\"\n\n\n\n\n\n[06/07/18 - 12:01 PM]\n\nShowtime(R) Announces Fall Comedy Premieres with the Launch of the New Season of \"Shameless\" and New Series \"Kidding\" on September 9\n\n\"Shameless\" season nine will feature the show's 100th episode in week four, and is currently in production in Los Angeles.\n\n\n\n\n\n[03/08/18 - 11:52 PM]\n\nDevelopment Update: Thursday, March 8\n\nUpdates include: TNT cancels \"The Librarians\"; Jessica Capshaw, Sarah Drew to depart ABC's \"Grey's Anatomy\"; and Dermot Mulroney set for \"Homecoming\" with Julia Roberts on Amazon.\n\n\n\n\n\n[12/28/17 - 11:03 AM]\n\nShowtime Releases Sunday's \"Shameless\" and \"SMILF\" Early\n\nBoth installments will be available tomorrow ahead of their on-air debut this Sunday, December 31\n\n\n\n\n\n[11/08/17 - 10:01 AM]\n\nShowtime(R) Picks Up a Ninth Season of Its Hit Series \"Shameless\"\n\nThe series returned this past Sunday with its highest-rated premiere since its third season and up 50 percent versus the season seven premiere.\n\n\n\n\n\n[10/04/17 - 11:00 AM]\n\nShowtime(R) Encourages Fans to Share Their \"Shameless\" Stache in Support of the Movember Foundation\n\nFor every fan photo posted during the month of November, Showtime and Warner Bros. Television will donate $20 to the Foundation, up to $40,000.\n\n\n\n\n\n[09/29/17 - 11:18 AM]\n\nShowtime(R) Releases Poster Art for \"Shameless\" and New Comedy \"SMILF\" Premiering Back-to-Back on Sunday, November 5 Starting at 9 PM ET/PT\n\nAdditionally, the network has released a new teaser highlighting the strong female leads in both series.\n\n\n\n\n\n[08/24/17 - 11:32 PM]\n\nDevelopment Update: Thursday, August 24\n\nUpdates include: Hamish Linklater joins TNT's \"Deadlier Than the Male\"; Hulu lands AwesomenessTV's \"All Night\"; and Gloria Calderon Kellett brings \"History of Them\" to CBS.\n\n\n\n\n\n[08/07/17 - 06:30 PM]\n\nShowtime(R) Announces Fall Comedy Slate, Sets Premiere Dates for New Season of \"Shameless\" and New Series \"White Famous\" and \"SMILF\"\n\nThe Jay Pharoah-led \"White Famous\" will kick things off on Sunday, October 15 at 10:00/9:00c.\n\n\n\n\n\n[07/13/17 - 10:21 AM]\n\nShowtime(R) Honored with 15 Emmy(R) Nominations\n\nWilliam H. Macy, Liev Schreiber and Mandy Patinkin all received nods.\n\n\n\n\n\n[06/22/17 - 11:22 PM]\n\nDevelopment Update: Thursday, June 22\n\nUpdates include: Freeform passes on \"Greek: The Reunion\" movie; Jessica Szohr to recur on Showtime's \"Shameless\"; and Jazmyn Simon cast in USA's \"Psych: The Movie.\"\n\n\n\n\n\n[01/29/17 - 07:28 PM]\n\nOutstanding Film and Television Performances Honored at the 23rd Annual Screen Actors Guild Awards(R)\n\n\"Stranger Things\" and \"Orange Is the New Black\" were honored as the best ensembles in drama and comedy, respectively.\n\n\n\n\n\n[12/19/16 - 09:06 AM]\n\nShowtime(R) Picks Up Eighth Season of Its Hit Series \"Shameless\"\n\nProduction on 12 new episodes will begin in 2017.\n\n\n\n\n\n[10/20/16 - 11:32 PM]\n\nDevelopment Update: Thursday, October 20\n\nUpdates include: Freeform pulls the plug on \"Guilt\"; Davis Foehl to bring \"Enemy of the State\" to small screen for ABC; and Necar Zadegan, Cameron Gellman tapped for TNT's \"Let the Right One In.\"\n\n\n\n\n\n[10/19/16 - 11:18 PM]\n\nDevelopment Update: Wednesday, October 19\n\nUpdates include: David Amann to run NBC's \"The Blacklist: Redemption\"; Laurie Holden bound for FX's \"The Americans\"; and Casey Wilson, June Diane Raphael team for project at Hulu.\n\n\n\n\n\n[10/06/16 - 11:44 PM]\n\nDevelopment Update: Thursday, October 6\n\nUpdates include: Jim Belushi signs onto Showtime's \"Mating\"; HBO locks in cast for \"Succession\" pilot; and David Shore brings \"The Good Doctor\" to ABC.\n\n\n\n\n\n[08/30/16 - 12:16 PM]\n\nVideo: Showtime(R) Releases Official Trailer and New Poster Art for \"Shameless\" Season Seven\n\nThe seventh season picks up a month after last season's finale, with the Gallaghers ready for another sizzling summer on the South Side of Chicago.\n\n\n\n\n\n[08/18/16 - 11:33 PM]\n\nDevelopment Update: Thursday, August 18\n\nUpdates include: Rob Thomas brings \"The Lost Boys\" to The CW; Ashley Rickards cast as The Top on \"The Flash\"; and Wil Traval tapped as Human Target for \"Arrow.\"\n\n\n\n\n\n[08/17/16 - 11:15 PM]\n\nDevelopment Update: Wednesday, August 17\n\nUpdates include: Amy Forsyth to lead season two of Syfy's \"Channel Zero\"; Billy Crudup to star opposite Naomi Watts in Netflix's \"Gypsy\"; and NBC to broadcast a pair of pilots in late night.\n\n\n\n\n\n[07/29/16 - 11:28 PM]\n\nDevelopment Update: Friday, July 29\n\nUpdates include: Adrianne Palicki, Scott Grimes cast in FOX's Seth MacFarlane project; Alan Ball books new series at HBO; and Daniel Franzese joins the cast of ABC's \"Conviction.\"\n\n\n\n\n\n[07/14/16 - 11:56 AM]\n\nShowtime(R) Honored with 22 Emmy(R) Nominations\n\nHighlights include five nominations for the hit summer series \"Ray Donovan\" and four nominations for the network's flagship series \"Homeland.\"\n\n\n\n\n\n[07/13/16 - 11:32 PM]\n\nDevelopment Update: Wednesday, July 13\n\nUpdates include: Renee Elise Goldsberry cast in Netflix's \"Altered Carbon\"; Eddie Cibrian tapped for \"Rosewood\" role; and Investigation Discovery renews \"Vanity Fair Confidential.\"\n\n\n\n\n\n[07/06/16 - 11:23 PM]\n\nDevelopment Update: Wednesday, July 6\n\nUpdates include: ABC axes \"Uncle Buck\" following summer run; Andre Royo to play Sammy Davis, Jr. on Showtime's \"Masters of Sex\"; and Emmy Rossum to go behind the camera on \"Shameless.\"\n\n\n\n\n\n[06/28/16 - 11:16 PM]\n\nDevelopment Update: Tuesday, June 28\n\nUpdates include: Rutlege Wood confirms cancellation of History's \"Top Gear\"; Tate Ellington to drop by Showtime's \"Shameless\"; and Ellie Reed is the latest cast in Netflix's \"Girlboss.\"\n\n\n\n\n\n[06/01/16 - 11:34 PM]\n\nDevelopment Update: Wednesday, June 1\n\nUpdates include: Ellen Pompeo set for return to \"Grey's Anatomy\"; Carly Pope to recur on USA's \"Suits\"; and \"The Americans,\" \"Shameless\" name new series regulars.\n\n\n\n\n\n[06/01/16 - 12:06 PM]\n\nShowtime(R) Announces Fall Premiere Dates for \"Shameless,\" \"Masters of Sex\" and \"The Affair\"\n\nThey'll be back on Sunday, October 2; Sunday, September 11; and Sunday, November 20; respectively.\n\n\n\n\n\n[03/23/16 - 11:30 PM]\n\nDevelopment Update: Wednesday, March 23\n\nUpdates include: Emma Stone, Jonah Hill to lead \"Maniac\" at Netflix; Enrique Murciano to get \"Broken\" by ABC; and \"Criminal Minds\" regular departs after 11 seasons.\n\n\n\n\n\n[01/12/16 - 05:14 PM]\n\nHit Showtime(R) Comedy Series \"Shameless\" Gets Seventh Season Pick-Up\n\nThe network's highest-rated comedy series received a 12-episode order, with production on season seven starting later this year.\n\n\n\n\n\n[01/11/16 - 11:25 AM]\n\nShowtime(R) Will Be Available to Over 70 Million Homes for a Free Preview Weekend Starting on Saturday, January 16\n\nSaid preview, which runs through Monday, January 18, coincides with the launch of new drama \"Billions\" this Sunday.\n\n\n\n\n\n[12/28/15 - 11:00 AM]\n\nShowtime(R) Samples the Highly-Anticipated Premieres of \"Billions\" and \"Shameless\" Early Across Multiple Platforms\n\nViewers will be able to sample the TV-14 rated versions of both premieres for free on YouTube, Facebook and SHO.com.\n\n\n\n\n\n[12/09/15 - 07:12 AM]\n\nNominations Announced for the 22nd Annual Screen Actors Guild Awards(R)\n\nThis year's event will be simulcast live on TNT and TBS on Saturday, January 30 at 8 p.m. (ET) / 5 p.m. (PT).\n\n\n\n\n\n[11/20/15 - 09:31 AM]\n\nVideo: Showtime(R) Releases Sixth Season Trailer for Its Top Comedy Series \"Shameless\"\n\nThis season, the Gallaghers are hitting a new groove as major changes attempt to pull the tight-knit clan apart.\n\n\n\n\n\n[10/26/15 - 11:28 PM]\n\nDevelopment Update: Monday, October 26\n\nUpdates include: FX cancels \"Married\" after two seasons; E! pulls the plug on \"Stewarts & Hamiltons\"; and TBS orders comedy pilot from Matt Fogel and Todd Strauss-Schulson.\n\n\n\n\n\n[10/22/15 - 02:03 PM]\n\nShowtime(R) Releases Season Six Key Art and First Teaser for Hit Comedy \"Shameless\"\n\nThis season, the Gallaghers are hitting a new groove as major changes attempt to pull the tight-knit clan apart.\n\n\n\n\n\n[10/01/15 - 11:36 PM]\n\nDevelopment Update: Thursday, October 1\n\nUpdates include: USA cancels summer drama \"Graceland\"; HBO in \"preliminary discussions\" for \"Watchmen\" TV series; and Left Bank Pictures developing a \"Strike Back\" feature film.\n\n\n\n\n\n[09/04/15 - 11:37 PM]\n\nDevelopment Update: Friday, September 4\n\nUpdates include: TBS pulls the plug on \"King of the Nerds\"; R.J. Cyler first to be cast in Showtime's \"I'm Dying Up Here\"; and Anabelle Acosta upped to series regular on ABC's \"Quantico.\"\n\n\n\n\n\n[08/18/15 - 11:38 PM]\n\nDevelopment Update: Tuesday, August 18\n\nUpdates include: Syfy pulls the plug on \"Haven\" after five seasons; Jennifer Schuur, Josh Reims exit \"The Catch\" at ABC; and Martin Short signs onto NBC's Maya Rudolph variety show.\n\n\n\n\n\n[06/02/15 - 02:30 PM]\n\nTV Land Inks Deal with Emmy(R)-Winning Producers John Wells and John Riggi for Warner Horizon Television Comedy Inspired by \"The Real Housewives of Beverly Hills\" Star Kyle Richards' Real Life\n\nThe untitled project centers on Bonnie Nolan, 40 years old with a beautiful home and three beautiful daughters to go with it.\n\n\n\n\n\n[05/14/15 - 11:09 AM]\n\nShowtime(R) Debuts 2015 Primetime Emmy(R) Campaign\n\nThe 2015 Emmy campaign will feature ads for the network's critically-acclaimed series including first-time contenders \"Penny Dreadful,\" \"HAPPYish\" and \"The Affair.\"\n\n\n\n\n\n[05/06/15 - 10:07 AM]\n\nThe Broadcast Television Journalists Association Announces Nominations for the 5th Annual Critics' Choice Television Awards\n\nSaid event will be broadcast live on A&E from the Beverly Hilton Hotel on Sunday, May 31 at 8:00/7:00c.\n\n\n\n\n\n[03/27/15 - 10:15 AM]\n\nShowtime(R) Offers a Sneak Preview of New Comedy Series \"HAPPYish\" After the Season Finale of \"Shameless\" on Sunday, April 5\n\nThe newcomer will then formally launch on Sunday, April 26 at 9:30/8:30c.\n\n\n\n\n\n[03/12/15 - 11:40 PM]\n\nDevelopment Update: Thursday, March 12\n\nUpdates include: Kristen Hager to lead \"The Adversaries\" at ABC; D.B. Woodside among the latest bound for FOX's \"Lucifer\"; and James Roday to star in ABC's \"The Brainy Bunch.\"\n\n\n\n\n\n[01/26/15 - 11:55 PM]\n\nDevelopment Update: Monday, January 26\n\nUpdates include: FOX in talks to develop an \"X-Men\" TV series; Millie Brady to lead Lifetime's \"The Clan of the Cave Bear\"; and \"Rush Hour\" among the latest wave of pilot pickups.\n\n\n\n\n\n[01/12/15 - 02:25 PM]\n\nHit Showtime Comedy Series \"Shameless\" Gets Sixth Season Pick-Up\n\nThe network's highest-rated comedy series received a 12-episode order, with production on season six starting later this year.\n\n\n\n\n\n[12/11/14 - 08:45 AM]\n\nCBS Corporation Achieves Golden Globe Award Nominations Triple Crown for Third Consecutive Year\n\nThe nominations for CBS Corporation are up from last year's 14.\n\n\n\n\n\n[12/11/14 - 07:12 AM]\n\nShowtime(R) Honored with Nine Golden Globe(R) Nominations, The Most Nominations in the Network's History\n\n\"The Affair\" is the only first year series to have a lead actor, lead actress and drama series nomination, and is tied for the most nominations for a television series this year with three noms.\n\n\n\n\n\n[12/11/14 - 05:38 AM]\n\nGolden Globe Nominations 2015\n\n\"Fargo\" leads all TV nods with five; followed by \"True Detective\" with four; and \"The Affair,\" \"The Good Wife,\" \"House of Cards,\" \"The Normal Heart,\" \"Olive Kitteridge\" and \"Orange Is the New Black\" with three each.\n\n\n\n\n\n[12/10/14 - 07:13 AM]\n\nShowtime(R) Honored with Five Screen Actors Guild Awards(R) Nominations\n\nClaire Danes, Edie Falco and William H. Macy all received nods for the work on their respective series.\n\n\n\n\n\n[12/10/14 - 06:12 AM]\n\nNominations Announced for the 21st Annual Screen Actors Guild Awards(R)\n\nThe 21st Annual Screen Actors Guild Awards(R) will be simulcast live nationally on TNT and TBS on Sunday, January 25 from the Los Angeles Shrine Exposition Center.\n\n\n\n\n\n[11/13/14 - 12:52 PM]\n\nShowtime(R) Debuts Season Five Poster Art for Its Hit Comedy Series \"Shameless\"\n\nWilliam H. Macy and Emmy Rossum return for a new season beginning Sunday, January 11 at 9:00/8:00c.\n\n\n\n\n\n[10/27/14 - 02:09 PM]\n\nShowtime 2014/2015 Winter Programming Overview\n\nAs previously announced, \"Shameless,\" \"House of Lies\" and \"Episodes\" will kick off 2015 with new seasons.\n\n\n\n\n\n[10/21/14 - 11:37 PM]\n\nDevelopment Update: Tuesday, October 21\n\nUpdates include: Christian Slater set as title role in USA's \"Mr. Robot\"; ABC to bring \"Bachelor Party\" to the small screen; and comedian Sebastian Maniscalco to star in potential half-hour for NBC.\n\n\n\n\n\n[09/24/14 - 11:29 PM]\n\nDevelopment Update: Wednesday, September 24\n\nUpdates include: NBC developing \"Real Genius\" as TV series; Zachary Levi to topline musical comedy \"Tuned\"; and John Rogers gets pilot production commitment for \"Endgame,\" also at NBC.\n\n\n\n\n\n[09/09/14 - 11:35 PM]\n\nDevelopment Update: Tuesday, September 9\n\nUpdates include: USA taps Rami Malek as lead in \"Mr. Robot\"; CBS developing Stephen King's \"The Things They Left Behind\" as drama; David Hudgins to play \"Game of Silence\" at NBC.\n\n\n\n\n\n[08/15/14 - 11:46 PM]\n\nDevelopment Update: Friday, August 15\n\nUpdates include: Eddie Izzard among the latest cast in PSN's \"Powers\"; Miranda Otto scores role on HBO's \"Westworld\"; and Bex Taylor-Klaus to succeed Amy Forsyth on MTV's \"Scream\" pilot.\n\n\n\n\n\n[07/10/14 - 10:27 AM]\n\nShowtime(R) Honored with 24 Emmy(R) Nominations\n\nThe pay channel received the most lead actor and actress series nominations of any broadcast or cable network this year with six nominations.\n\n\n\n\n\n[05/28/14 - 11:24 PM]\n\nDevelopment Update: Wednesday, May 28\n\nUpdates include: Hulu, Sony Pictures Television in talks for \"Community\" revival; Rob Morrow joins History's \"Texas Rising\"; and Steve Kazee to recur on Showtime's \"Shameless.\"\n\n\n\n\n\n[05/28/14 - 08:00 AM]\n\nThe Broadcast Television Journalists Association Announces Nominations for 4th Annual Critics' Choice Television Awards\n\nThis year's event will be broadcast live on The CW from the Beverly Hilton Hotel on Thursday, June 19 and hosted by actor/comedian Cedric the Entertainer.\n\n\n\n\n\n[05/22/14 - 08:38 AM]\n\nShowtime(R) Kicks Off 2014 Primetime Emmy(R) Campaign with Revamped FYC Site\n\nThe 2014 Emmy campaign will feature dedicated ads for the network's critically-acclaimed series including \"Homeland,\" \"Masters of Sex\" and \"Ray Donovan.\"\n\n\n\n\n\n[03/13/14 - 11:42 PM]\n\nDevelopment Update: Thursday, March 13\n\nUpdates include: Thomas Lennon to join Matthew Perry in CBS's \"The Odd Couple\"; John Cho lands male lead on ABC's \"Selfe\"; and Geoff Stults tapped for title role on CBS's \"Cuz-Bros.\"\n\n\n\n\n\n[02/20/14 - 11:43 PM]\n\nDevelopment Update: Thursday, February 20\n\nUpdates include: Elisha Cuthbert tapped as lead in NBC's \"One Big Happy\"; Morena Baccarin to star in ABC's \"Warriors\"; Krysten Ritter boards \"Mission Control\" at NBC.\n\n\n\n\n\n[02/12/14 - 11:31 PM]\n\nDevelopment Update: Wednesday, February 12\n\nUpdates include: Cristin Milioti is the first to board NBC's \"A to Z\"; FOX gives series order to Will Forte's \"Last Man on Earth\"; and Jonathan Ryland is NBC's \"Lifesaver.\"\n\n\n\n\n\n[02/04/14 - 11:28 PM]\n\nDevelopment Update: Tuesday, February 4\n\nUpdates include: Ryan Phillippe on track to lead ABC's \"Secrets & Lies\"; Linda Cardellini joins Netflix's KZK project; and Jake McDorman to star in ABC's \"My Thoughts Exactly.\"\n\n\n\n\n\n[11/08/13 - 02:26 PM]\n\nShowtime 2013/2014 Winter Programming Overview\n\nHighlights include the previously announced return of \"Shameless,\" \"House of Lies\" and \"Episodes\" on Sunday, January 12.\n\n\n\n\n\n[10/15/13 - 11:31 PM]\n\nDevelopment Update: Tuesday, October 15\n\nUpdates include: Zooey Deschanel to executive produce two potential comedies; Jenna Bans to pen ABC's \"Sea of Fire\"; and John Leguizamo returns to HBO with \"Ghetto Klown.\"\n\n\n\n\n\n[10/10/13 - 11:29 PM]\n\nDevelopment Update: Thursday, October 10\n\nUpdates include: The CW asks for three additional scripts from its fall dramas; ABC extends \"Shark Tank\" season to 24 episodes; and Tom Papa to get \"More Time with Family\" at CBS.\n\n\n\n\n\n[09/24/13 - 11:26 PM]\n\nDevelopment Update: Tuesday, September 24\n\nUpdates include: Bruno Heller to bring \"Gotham\" to FOX; Vanessa Redgrave cast in ABC's \"The Black Box\"; and NBC gives pilot order to \"The Odyssey.\"\n\n\n\n\n\n[07/30/13 - 01:41 PM]\n\nShowtime(R) Announces January 2014 Premiere Schedule\n\n\"Shameless,\" \"House of Lies\" and \"Episodes\" to all return Sunday, January 12 on the pay channel.\n\n\n\n\n\n[07/18/13 - 09:48 AM]\n\nShowtime(R) Makes History Honored with 32 Emmy(R) Nominations\n\nThe network is represented in all four lead actor and actress series categories with five actors nominated.\n\n\n\n\n\n[06/05/13 - 11:22 PM]\n\nDevelopment Update: Wednesday, June 5\n\nUpdates include: Jeff Astrof to run TBS's \"Ground Floor\"; Justin Chatwin to exit Showtime's \"Shameless\"; and Josh Stamberg won't return to Lifetime's \"Drop Dead Diva.\"\n\n\n\n\n\n[06/03/13 - 09:01 AM]\n\nGolden Globe(R) Nominee Dominic West to Headline \"The Affair\" on Showtime(R)\n\nWest will play \"a good husband, devoted father of four, and New York City high school teacher whose settled, comfortable world is about to implode when he meets a woman he thinks is his soul mate.\"\n\n\n\n\n\n[03/14/13 - 07:08 AM]\n\nTV One Presents World Television Premiere of Russ Parr's \"The Undershepherd\" Saturday, March 30, 8PM/ET\n\nIsaiah Washington, Lamman Rucker, Malinda Williams, Elise Neal, Vanessa Bell Calloway, Clifton Powell, Bill Cobb, Robinne Lee, Keith David and Louis Gossett, Jr. star.\n\n\n\n\n\n[03/07/13 - 11:29 AM]\n\nShowtime(R) Is Trending Now @SXSW(R)\n\nFestival highlights include a special, first-ever watch party of the highly-anticipated new drama series \"Ray Donovan.\"\n\n\n\n\n\n[02/08/13 - 09:57 AM]\n\nShowtime(R) Flirts with New Drama \"The Affair\" - Network Orders Pilot By Award-Winning Playwright Sarah Treem and Hagai Levi\n\nThe project is \"an intimate exploration of two marriages and an affair that disrupts them - with all of the complexities and consequences that result.\"\n\n\n\n\n\n[01/12/13 - 01:47 PM]\n\nShowtime(R) 2013 Original Series Premiere Slate\n\nHighlights include the early return of \"Dexter\" on Sunday, June 30 plus \"Homeland\" on Sunday, September 29.\n\n\n\n\n\n[12/19/12 - 11:38 AM]\n\nShowtime Anytime(R) Now Available with DirecTV\n\nThe service is also available now nationwide to AT&T U-verse, Cablevision's Optimum TV and Verizon FiOS customers.\n\n\n\n\n\n[12/14/12 - 11:01 PM]\n\nDevelopment Update: Friday, December 14\n\nUpdates include: HBO orders two comedy pilots; \"Zorro\" revival in the works at USA; and quartet heads to TNT's \"Legends.\"\n\n\n\n\n\n[10/02/12 - 11:03 PM]\n\nDevelopment Update: Tuesday, October 2\n\nUpdates include: Mike Vogel, Nestor Carbonell to visit A&E's \"Bates Motel\"; Jeffrey Nachmanoff lands \"Hostages\" pilot at CBS; and Drea de Matteo to star in Lifetime's \"Stalkers.\"\n\n\n\n\n\n[09/19/12 - 11:11 PM]\n\nDevelopment Update: Wednesday, September 19\n\nUpdates include: James Gandolfini to star in HBO's \"Criminal Justice\"; Netflix acquires Ricky Gervais-led \"Derek\"; and Rachel Boston joins Lifetime's \"Witches of East End.\"\n\n\n\n\n\n[09/12/12 - 11:01 AM]\n\nBravo Media Continues to Expand Scripted Development Slate with Five New Dramas\n\nHighlights include \"Heathers,\" a present day update of the cult classic 1980's film.\n\n\n\n\n\n[08/23/12 - 11:08 PM]\n\nDevelopment Update: Thursday, August 23\n\nUpdates include: FOX asks \"Bob's Burgers\" for six additional scripts; Malin Akerman cast as the mom in ABC's \"Suburgatory\"; and Thomas Middleditch boards NBC's \"The Office\" spin-off.\n\n\n\n\n\n[07/19/12 - 09:22 AM]\n\nShowtime(R) Honored With 22 Emmy(R) Nominations\n\nThe nine nominations for \"Homeland\" mark the most of any freshman series.\n\n\n\n\n\n[06/15/12 - 11:16 AM]\n\nShowtime(R) Kicks Off \"Best in Sho\" Free Preview Weekend Today Targeting Voters for 2012 Primetime Emmys(R)\n\nIn collaboration with Time Warner Cable and DirecTV, the network and its multiplex channels will be offered as a free preview and accessible to over 20 million homes.\n\n\n\n\n\n[05/23/12 - 10:23 AM]\n\nShowtime(R) Launches \"Best in Sho\" Free Preview Weekend Campaign Targeting Voters for 2012 Primetime Emmys(R)\n\nSaid preview will be accessible to over 20 million homes, in New York and Los Angeles through Time Warner Cable, and nationwide via DirecTV.\n\n\n\n\n\n[05/02/12 - 12:21 PM]\n\n\"Political Animals\" to Anchor USA Network Summer Lineup - Six-Hour Event Drama Premieres Sunday, July 15, at 10/9c\n\nPlus: Adrian Pasdar has been cast as President Paul Garcetti in the project.\n\n\n\n\n\n[04/13/12 - 03:22 PM]\n\nEllen Burstyn to Star Opposite Sigourney Weaver in USA's \"Political Animals\"\n\nCiaran Hinds, Carla Gugino, James Wolk, Sebastian Stan and Brittany Ishibashi also star in the project, due this summer.\n\n\n\n\n\n[03/09/12 - 11:22 AM]\n\nInterview: \"Shameless\" Executive Producer John Wells\n\nThe prolific writer/director chats about his Showtime series as well as TNT's \"Southland.\"\n\n\n\n\n\n[02/28/12 - 11:33 PM]\n\nDevelopment Update: Tuesday, February 28\n\nUpdates include: Josh Hopkins joins NBC's \"Ladyfriends\"; Missi Pyle to play mom on FOX's \"Prodigy/Bully\"; and Victor Garber is the first to board NBC's \"Notorious.\"\n\n\n\n\n\n[02/27/12 - 11:01 AM]\n\nLogo Announces Nominees For The 2012 \"NewNowNext Awards\"\n\nThe fifth annual event premieres Monday, April 9 at 10:00/9:00c on the cable channel.\n\n\n\n\n\n[02/17/12 - 11:11 PM]\n\nDevelopment Update: Friday, February 17\n\nUpdates include: Anthony LaPaglia to star in ABC's \"Americana\"; Donald Sutherland joins FOX's \"Living Loaded\"; and Ana Ortiz is the latest to ABC's \"Devious Maids.\"\n\n\n\n\n\n[02/16/12 - 10:45 PM]\n\nDevelopment Update: Thursday, February 16\n\nUpdates include: Kristin Kreuk to star in The CW's \"Beauty and the Beast\"; Colin Ferguson to be \"Like Father\" for FOX; and Malin Akerman, Jean Smart join \"The Smart One\" at ABC.\n\n\n\n\n\n[02/15/12 - 11:15 PM]\n\nDevelopment Update: Wednesday, February 15\n\nUpdates include: Terry O'Quinn joins ABC's \"666 Park Avenue\"; Ali Larter is FOX's \"The Asset\"; and Steven Pasquale to topline NBC's \"Do No Harm.\"\n\n\n\n\n\n[01/20/12 - 10:27 PM]\n\nDevelopment Update: Friday, January 20\n\nUpdates include: Kevin Nealon joins NBC's \"Isabel\"; \"666 Park Avenue\" lands pilot order at ABC; and Maggie Gyllenhaal, Rhys Ifans on track for HBO's \"The Corrections.\"\n\n\n\n\n\n[01/10/12 - 07:01 AM]\n\nShowtime(R) Announces the Network's Authentication Service \"Showtime Anytime(R)\" Is Now Available on the iPad(R)\n\nThe app gives subscribers the flexibility to watch more than 400 hours of the network's programming whenever and wherever they'd like to watch it.\n\n\n\n\n\n[12/21/11 - 01:46 PM]\n\nShowtime(R) Encourages Viewers to Participate in a 5-Day Walk of Shame-Less\n\nSix competing teams of three will take turns walking continuously on a treadmill for 12 straight hours over the course of five days in New York City from January 18 to 22.\n\n\n\n\n\n[12/16/11 - 11:13 PM]\n\nDevelopment Update: Friday, December 16\n\nUpdates include: Mariska Hargitay to produce NBC's \"American Dream\"; John Wells to bring \"Animal Kingdom\" to Showtime; and Allen Coulter to direct the Liev Schreiber-led pilot \"Ray Donovan.\"\n\n\n\n\n\n[11/04/11 - 11:03 PM]\n\nDevelopment Update: Friday, November 4\n\nUpdates include: Marc Buckland books two projects at NBC; Comedy Central orders \"My Mans\" presentation; and Lionsgate pitches animated \"Harold & Kumar\" series.\n\n\n\n\n\n[11/03/11 - 12:42 PM]\n\nBBC America's Dramaville Presents Award-Winning Conspiracy Thriller \"State of Play\" in December\n\nThe six-part series lead to the feature film version starring Russell Crowe, Ben Affleck and Helen Mirren.\n\n\n\n\n\n[10/28/11 - 11:10 PM]\n\nDevelopment Update: Friday, October 28\n\nUpdates include: Lisa Ling sells \"No. One Son\" to ABC; Dan Fogelman lands pilot order at the Alphabet; and Ryan Johnson joins the cast of USA's \"Fairly Legal.\"\n\n\n\n\n\n[10/17/11 - 10:39 PM]\n\nDevelopment Update: Monday, October 17\n\nUpdates include: Danielle Panabaker to star in ABC Family's \"Intercept\"; FOX eyes small screen take on \"Zombieland\"; and Marlon Wayans, Don Johnson each book new projects.\n\n\n\n\n\n[10/14/11 - 01:27 PM]\n\nShowtime: 2011-2012 Fall/Winter Programming Overview\n\nNewly announced premieres include \"Dave's Old Porn,\" featuring Dave Attell, Whitney Cummings, Chelsea Handler and Adam Carolla.\n\n\n\n\n\n[09/26/11 - 11:49 AM]\n\nShowtime Launches \"Showtime Social\" App for iPad\n\nThe app launches just in time for viewers to discuss and interact with tonight's season finales of \"Weeds\" and \"The Big C.\"\n\n\n\n\n\n[09/15/11 - 10:55 PM]\n\nDevelopment Update: Thursday, September 15\n\nUpdates include: \"Lying Game\" in, \"Chloe King\" out at ABC Family; FOX gives \"Bones\" four extra episodes; and Mark Gordon to bring a small screen take on \"Source Code\" to CBS.\n\n\n\n\n\n[09/12/11 - 01:21 PM]\n\nNBCUniversal Announces a Dynamic New Leadership Team to Head Its Newly Named Production Company -- Universal Television\n\nTracey Pakosta and Russell Rothberg will spearhead the studio's comedy and drama departments, respectively.\n\n\n\n\n\n[08/04/11 - 11:14 AM]\n\nNevins: \"House of Lies\" to Launch Sunday, January 8 Alongside New Seasons of \"Shameless,\" \"Californication\"\n\nPlus: the Showtime chief on \"Secret History of America,\" \"The Borgias,\" \"Dexter,\" \"United States of Tara,\" \"The Real L Word,\" \"Weeds\" and \"100 Bullets.\"\n\n\n\n\n\n[07/08/11 - 10:40 PM]\n\nDevelopment Update: Friday, July 8\n\nUpdates include: Charles Mesure joins ABC's \"Desperate Housewives\"; Lamorne Morris joins FOX's \"New Girl\"; and James Wolk to visit Showtime's \"Shameless.\"\n\n\n\n\n\n[07/06/11 - 11:03 PM]\n\nDevelopment Update: Wednesday, July 6\n\nUpdates include: A&E renews \"Breakout Kings\"; Russell T Davies plots return to Showtime; and Justin Deeley, Megalyn Echikunwoke set for The CW's \"90210.\"\n\n\n\n\n\n[02/14/11 - 10:42 PM]\n\nDevelopment Update: Monday, February 14\n\nUpdates include: Robert Taylor is \"Longmire\" for A&E; Jesse L. Martin, Saffron Burrows land pilots; and more directors sign on for this year's development crop.\n\n\n\n\n\n[01/26/11 - 02:17 PM]\n\n2010 Year in Review/2011 Year in Preview: Showtime\n\nA look at what's ahead on the cable channel, plus a recap of its 2010 ratings highlights.\n\n\n\n\n\n[12/16/10 - 09:06 AM]\n\nShowtime Free Preview Weekend Available to Over 60 Million Homes Starting Friday, January 7\n\nSaid stunt is timed with the January 9 premieres of \"Californication,\" \"Episodes\" and \"Shameless.\"\n\n\n\n\n\n[12/08/10 - 10:29 AM]\n\nShowtime Will Preview the First 20 Minutes of \"Shameless\" Immediately Following the Season Five Finale of \"Dexter\"\n\nThe newcomer will then premiere Sunday, January 9 at 10:00/9:00c.\n\n\n\n\n\n[10/28/10 - 08:29 PM]\n\nDevelopment Update: Thursday, October 28\n\nUpdates include: WE tv sets January premieres; Rob Schneider to topline potential CBS comedy; and \"Lost\" alums book \"Once Upon a Time\" at ABC.\n\n\n\n\n\n[10/25/10 - 07:25 PM]\n\nDevelopment Update: Monday, October 25\n\nUpdates include: ABC cancels \"The Whole Truth\"; MTV does same to \"The City\"; and Skyler Samuels to play \"Chloe King\" for ABC Family.\n\n\n\n\n\n[09/22/10 - 01:16 PM]\n\nBiggest Sunday Ever on Showtime! Shameless, Episodes & Californication to Premiere January 9th\n\n\"Californication\" and \"Episodes\" were originally set to bow that Monday.\n\n\n\n\n\n[08/31/10 - 09:08 AM]\n\nJoan Cusack Takes a Shine to Showtime's Shameless\n\nShe'll play Sheila, an agoraphobic Chicago housewife, a role originally played by Allison Janney in the pilot.\n\n\n\n\n\n[07/12/10 - 10:40 AM]\n\nShowtime Announces January Premiere Schedule - Shameless, Episodes & Californication Kick Off 2011\n\n\"Californation\" and \"Episodes\" are set for Monday nights with \"Shameless\" due on Sundays.\n\n\n\n\n\n[04/08/10 - 12:38 PM]\n\nShowtime Greenlights Shameless to Series\n\nWilliam H. Macy and Emmy Rossum star in the project, which guest stars Allison Janney.\n\n\n\n\n\n[04/08/10 - 12:07 AM]\n\nDevelopment Update: Thursday, April 8\n\nUpdates include: \"Enlightened,\" \"Shameless\" land series orders at HBO, Showtime; \"Jeopardy,\" \"Wheel of Fortune\" are good through 2013-14; and Francois Arnaud joins Showtime's \"The Borgias.\"\n\n\n\n\n\n[01/25/10 - 06:43 PM]\n\nDevelopment Update: Monday, January 25\n\nUpdates include: \"How I Met Your Mother\" gets sixth season; ABC, CBS add comedy pilots; and Joanna Garcia to topline Shana Goldberg-Meehan's comedy for ABC.\n\n\n\n\n\n[12/17/09 - 06:36 PM]\n\nDevelopment Update: Thursday, December 17\n\nUpdates include: The CW puts unaired \"Beautiful Life\" on YouTube; USA to bring \"The Freshman\" to the small screen; and Emmy Rossum, Allison Janney to be \"Shameless\" for Showtime.\n\n\n\n\n\n[11/03/09 - 06:05 PM]\n\nDevelopment Update: Tuesday, November 3\n\nUpdates include: Tom Papa to host NBC's \"Marriage Ref\"; David Tennant to star in \"Rex\" for NBC; and Mark Mylod to helm Showtime's \"Shameless\" import.\n\n\n\n\n\n[10/15/09 - 12:12 PM]\n\nWilliam H. Macy Is Shameless When It Comes to Showtime\n\nJohn Wells and Paul Abbott, the series' original creator, will also serve as executive producers of the pilot.\n\n\n\n", "images": ["http://www.thefutoncritic.com/images/global/letters-at-the-futon.gif", "http://www.thefutoncritic.com/images/shows/dexter.jpg", "http://www.thefutoncritic.com/images/myfuton-email.gif", "http://www.thefutoncritic.com/images/shows/shameless.jpg", "http://www.thefutoncritic.com/images/shows/elementary.jpg", "http://www.thefutoncritic.com/images/password.gif", "http://www.thefutoncritic.com/images/global/logo.gif", "http://www.thefutoncritic.com/images/shows/nurse_jackie.jpg", "http://www.thefutoncritic.com/images/shows/ray_donovan.jpg", "http://www.thefutoncritic.com/images/shows/game_of_thrones.jpg", "http://www.thefutoncritic.com/images/shows/big_bang_theory.jpg", "http://www.thefutoncritic.com/images/global/site-map.gif", "http://www.thefutoncritic.com/images/about-this-show.jpg", "http://www.thefutoncritic.com/images/add-myfuton.jpg", "http://www.thefutoncritic.com/images/shows/game.jpg", "http://www.thefutoncritic.com/images/header-showatch.jpg", "http://www.thefutoncritic.com/images/shows/nyccwd4.jpg", "http://www.thefutoncritic.com/images/shows/camelot.jpg", "http://www.thefutoncritic.com/images/shows/fringe.jpg", "http://www.thefutoncritic.com/images/shows/walking_dead.jpg", "http://www.thefutoncritic.com/images/favicon.ico", "http://www.thefutoncritic.com/images/shows/jersey_shore.jpg", "http://www.thefutoncritic.com/images/shows/house_of_lies.jpg", "http://www.thefutoncritic.com/images/global/contact-us-at.gif", "http://www.thefutoncritic.com/images/shows/homeland.jpg", "http://www.thefutoncritic.com/images/global/advertise-on-futon.gif", "http://www.thefutoncritic.com/images/global/privacy-policy.gif", "http://www.thefutoncritic.com/images/spacer.gif", "http://www.thefutoncritic.com/images/shows/white_queen.jpg", "http://www.thefutoncritic.com/images/global/bugblank.jpg", "http://www.thefutoncritic.com/images/shows/weeds.jpg", "http://www.thefutoncritic.com/images/shows/penny_dreadful.jpg"], "top_img": "http://www.thefutoncritic.com/images/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Shows A-Z - shameless on showtime", "meta_data": {"Description": "shameless on showtime – TheFutonCritic.com has shameless news, listings, dvds, episode guides and more for shameless", "Keywords": "shameless, showtime, news, listings, dvds, episode guides, time slot, status, renew, cancel"}, "movies": [], "publish_date": null, "source": "http://www.thefutoncritic.com", "summary": ""}