{"url": "http://reelhoney.com/why-i-finally-found-a-hero-in-eleven-from-stranger-things/", "text": "Detectives. The Upside Down. Eggos. For folks who enjoy Netflix originals or have an itch for sci-fi, any talk of Eggos these days will make them think of sci-fi television show Stranger Things. This supernatural drama became a fast fan-favourite in July 2016 when the first season was released on Netflix. The show centers on the disappearance of a young boy in Hawkins, Indiana in the 1980s, alongside the sudden appearance of an odd young girl who goes by the name of Eleven. The viewer is also offered a glimpse into the scientific research going on in the town at the time, including mysterious experiments concerned with paranormal activity and tests on human subjects.\n\nAmongst this confusion and eerie science, Eleven (played by Millie Bobby Brown) aids in understanding the turmoil in the town, as well as locating Will, the missing boy. Eleven becomes friends with the group of three boys closest to him and helps them with their search. Throughout the season, she leads the charge and emerges as the frontrunner and (dare I say) hero of the group.\n\nOne scene in particular sparks a particular sense of courageousness and is when Eleven first embodied a hero for me. In “Chapter Six: The Monster”, Mike and Dustin (two young boys), are corned by a couple of bullies, with one of them wielding a knife and threatening Mike. Mike is forced to jump off a steep cliff to escape. Miraculously, Eleven uses her paranormal abilities to save him by making him levitate. The surrounding boys are all stunned and the bullies run away. I was enchanted by this scene. In a desperate moment, this young girl is able to save the day. It is powerful on its own, but its strength is amplified by the general shortage of female heroes in pop culture.\n\nTo examine the impact of Eleven on someone like me who was born in the mid-1990s, it is useful to refer to some of the more popular shows from my childhood and preteen years.\n\nMany popular shows in the early-2000s consisted mostly of one of the two following scenarios. There may be a male lead or a male-dominated group, as with Hey Arnold!, Arthur, or Filmore, in which the young boy drives the plotline and usually comes in to save the day. Conversely, shows with a female lead or female-dominated group are few and far between for the younger crowd. Shows with female leads during this time included Lizzie McGuire and iCarly.\n\nAt first glance, a female-titled and -led show may be positive for viewers of all genders. Upon further examination, however, there are two main issues. Firstly, the rarity of these types of shows makes them often underappreciated novelties meant for girls, rather than shows that portray important, universal lessons with good humour that are valuable for everyone. Secondly, these shows often walk the line of reinforcing negative stereotypes about women and girls, and suggesting that femininity is a negative trait. An example of this can be found in Lizzie McGuire when Lizzie very reluctantly goes on a date with one of her male classmates, and meanwhile, Lizzie’s brother and father spend the episode discovering and restoring a Soap-Box derby racer – reinforcing set gender roles. Although shows like Lizzie McGuire cannot be perfect, it is difficult to accept that this is one of the few popular female-led shows of its time, leaving many young girls still in search of a hero reminiscent of themselves.\n\nFast-forward to 2016. As a 22-year-old, I finally found a hero in Eleven. Not only does she represent a hero to many young girls, but she also defies gender norms. She has short hair and isn’t afraid to get dirty, while also sometimes wearing a dress and being feminine. Her short hair is reminiscent of Charlize Theron’s in Mad Max: Fury Road, another instance of a lead character pairing femininity with strength and diverting from harmful gender roles. Moreover, Eleven is not just a positive role model for girls, but by presenting femininity alongside her bravery and heroic acts, she helps break down negative stereotypes equating femininity with weakness and docility.\n\nSeeing Eleven as a hero shows young girls that they are worthy and are capable of being heroes themselves. It is difficult to tell yourself that you can be powerful when you have never seen someone that looks like you in the role of a hero.\n\nMillie Bobby Brown’s performance in the first season of Stranger Things recently garnered her an Emmy nomination, one of 18 for the Netflix show. I hope that from the success of the show and its slew of Emmy nominations, other producers will recognize the power of a strong, young female lead in the role of hero.\n\nEleven’s existence as a strong female hero is a stepping-stone to representation of other groups that have not had such privilege to be represented in mainstream TV thus far. After a constant barrage of white, male, cisgender, heterosexual heroes, it is not enough to celebrate and call it quits with Eleven. The success surrounding Stranger Things will hopefully allow for more representation of children and adults with more intersecting identities of race, gender, and sexuality. This will foster inclusion and the empowerment of more marginalized groups.\n\nThe power of TV (and Netflix) cannot be underestimated in its reach and influence. I cannot wait to see how Stranger Things and other shows evolve to generate even more interesting heroes. Until then, I hope Millie Bobby Brown’s career will continue to bloom so that she can defy gender norms into her teens and beyond, though her portrayal of Eleven will always have a place in my heart.", "images": ["http://reelhoney.com/wp-content/uploads/2018/04/RH-2018.png", "http://reelhoney.com/wp-content/uploads/2019/05/Reel-Honey_Quicksand-360x240.jpg", "http://reelhoney.com/wp-content/uploads/2017/09/Stranger_Things_Eleven.jpg", "http://reelhoney.com/wp-content/uploads/2017/09/Paige-Conrad_avatar_1504571653-100x100.jpg", "http://reelhoney.com/wp-content/uploads/2019/05/Reel-Honey_Vita-and-Virginia-360x240.jpg", "http://reelhoney.com/wp-content/uploads/2016/12/reel-honey-logo-2.png", "http://reelhoney.com/wp-content/uploads/2018/12/Reel-Honey_Destroyer-360x240.jpg", "http://reelhoney.com/wp-content/uploads/2018/03/pinkabout.png", "http://reelhoney.com/wp-content/uploads/2018/06/Reel-Honey_Stranger-Things-2-360x240.jpg", "http://reelhoney.com/wp-content/uploads/2019/06/Reel-Honey_Street-Series-360x240.png", "http://reelhoney.com/wp-content/uploads/2018/03/A-Wrinkle-In-Time_Reel-Honey-260x170.jpg", "http://reelhoney.com/wp-content/uploads/2019/06/Reel-Honey_Joan-Holloway-360x240.jpg", "http://reelhoney.com/wp-content/uploads/2018/12/Reel-Honey_Collider-360x240.jpg", "http://reelhoney.com/wp-content/uploads/2019/05/Reel-Honey_Robin-Swicord-360x240.jpg", "http://assets.pinterest.com/images/pidgets/pinit_fg_en_rect_red_20.png", "http://reelhoney.com/wp-content/uploads/2018/11/Millicent_BFI-360x240.jpeg", "http://reelhoney.com/wp-content/uploads/2019/06/Reel-Honey_Moonstruck-360x240.jpg", "http://reelhoney.com/wp-content/uploads/2019/04/Reel-Honey_Gilmore-Girls-360x240.jpg", "http://reelhoney.com/wp-content/uploads/2017/09/Stranger_Things_Eleven-759x500.jpg", "http://reelhoney.com/wp-content/uploads/2018/03/purpcontact.png", "http://reelhoney.com/wp-content/uploads/2019/06/Reel-Honey_Paddington-360x240.jpg", "http://reelhoney.com/wp-content/uploads/2019/06/Reel-Honey_Booksmart-360x240.jpg", "http://reelhoney.com/wp-content/uploads/2019/05/Reel-Honey_Best-Friends-Forever-360x240.png", "http://reelhoney.com/wp-content/uploads/2019/04/Reel-Honey_Giant-Little-Ones-360x240.jpg", "http://reelhoney.com/wp-content/uploads/2017/07/Octavia_The_100-360x240.jpg", "http://reelhoney.com/wp-content/uploads/2017/09/Broadchurch_Sexual-Assault-360x240.jpg", "http://reelhoney.com/wp-content/uploads/2019/04/Reel-Honey_Jane-The-Virgin-360x240.jpg", "http://reelhoney.com/wp-content/uploads/2018/03/yellowsubmit.png", "http://reelhoney.com/wp-content/uploads/2018/03/Betty_Reel-Honey_Riverdale-260x170.jpeg", "http://reelhoney.com/wp-content/uploads/2018/03/Arkangel_Black-Mirror_Reel-Honey-260x170.jpg"], "top_img": "http://reelhoney.com/wp-content/uploads/2017/09/Stranger_Things_Eleven.jpg", "keywords": [], "authors": ["Paige Conrad Is Based In Halifax", "Nova Scotia. She Has A Passion For Intersectional Representation In Media", "Leadership", "Both On", "Off The Screen."], "canonical_link": "http://reelhoney.com/why-i-finally-found-a-hero-in-eleven-from-stranger-things/", "title": "Why I Finally Found a Hero in Eleven from ‘Stranger Things’ – Reel Honey", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "generator": "WordPress 5.0.3", "og": {"image": "http://reelhoney.com/wp-content/uploads/2017/09/Stranger_Things_Eleven.jpg"}, "msapplication-TileImage": "http://reelhoney.com/wp-content/uploads/2017/01/cropped-Screen-Shot-2017-01-19-at-5.16.16-PM-270x270.png"}, "movies": [], "publish_date": null, "source": "http://reelhoney.com", "summary": ""}