{"url": "http://toofab.com/2017/10/03/the-clowns-finally-unmasked-on-american-horror-story-cult-and-4-more-shockers/", "text": "Every week, TooFab's breaking down the moments from \"American Horror Story: Cult\" that really made us go \"WTF.\"\n\nIn a season that's already given us Chaz Bono cutting off his own hand, the return of Twisty the Clown and Billy Eichner's reaction to Evan Peters pleasuring himself, here are the 5 most shocking moments from Tuesday's new episode, \"Holes.\"\n\nThe Clowns Unmasked\n\nWhile many already assumed that Kai's group of crazies were the ones underneath the creepy clown masks, that fact was finally confirmed on Tuesday night. For the first time, fans watched as Kai (Peters), Harrison (Eichner), Beverly (Adina Porter), her cameraman RJ (James Morosini), Winter (Billie Lourd), Ivy (Alison Pill) and Detective Samuels (Colton Haynes) donned their costumes for a little mayhem. Gary (Bono) was also involved in planning the attack on Bob (more on that later), but was MIA during the murders. Maybe it was his night to close at the grocery store?\n\nThere was also a flashback showing Meadow (Leslie Grossman) joining the killing spree on the coffin victims, after designing the masks herself.\n\nWhy Ivy's In On It\n\nFX\n\nNot only did the episode confirm that Ivy is a member of the cult and a (somewhat reluctant) cold blooded killer, viewers also got some insight into why she's doing it.\n\n\"Radicals are the only people who ever got anything done. I'm ready. I hate this country, what it's become. I hate my fucking wife for letting it happen,\" she explained to Winter. \"The only thing I love right now is my son and I will do whatever it takes to make the world a better place for him, even if it means burning it all down.\"\n\nThat Jill Stein vote realllly rubbed her the wrong way, didn't it?\n\nAlly is starting to suspect something however, telling Dr. Rudy Vincent it seemed like Ivy was already \"prepared\" to abandon her.\n\nWhat About Bob's Gimp?\n\nFX\n\nThe most random moment of the night goes to Bob (Dermot Mulroney) shouting, \"I have a gimp in the attic!\"\n\nAfter the gang decided to kill Beverly's boss and air his murder on the news, they found a surprise on the upper level of his home: a man in a black leather hood, hanging from hooks by his nipples.\n\nSadly, both Bob and the gimp were brutally murdered, with Beverly delivering the death blow to her boss' head with an axe. She then got the footage shown during her broadcast, in a move that would never happen in real life.\n\nMeadow Spilled the Beans\n\nFX\n\nNicole Kidman-loving housewife Meadow Wilton re-emerged this week after disappearing two episodes ago in the middle of the night. It was Ally who found her at the bottom of a ditch in the Wilton's backyard while snooping across the street. Instead of helping her though, Ally left her there and tried calling the police instead.\n\nMeadow then literally popped up outside Ally's window and dropped a bomb on her: \"It's a cult Ally, a sick cult, and everyone's in it. My husband, the police, your babysitter, your wife!\"\n\nBefore Ally even had time to react, however, someone threw a bag over Meadow's head and snatched her.\n\nIf Meadow is trying to break free, the outlook doesn't look too good for her, as RJ was gruesomely offed this week with a nail gun for not being \"strong and vigilant\" like the rest of the team.\n\nThe Truth About Kai's Family\n\nFX\n\nBeverly and Kai played the pinky game together this week, but it was the reporter who seemed to be in control for once.\n\nIn an attempt to learn more about \"the man behind the mask,\" Beverly asked point blank about his family.\n\nVia flashbacks, viewers learned Kai and Winter's dad became a total jerk after a motorcycle left him in a wheelchair. He was vulgar, rude and accused his mother of sleeping around. One day, Mama Anderson got fed up and shot her husband, before killing herself.\n\nThe biggest family development, however, was learning that Dr. Vincent is actually Kai's older brother. It was the elder's idea to not report the deaths so they could keep collecting their mom's pension and father's disability. The two corpses are still in the house and Winter's totally OK with it too.\n\nSo far, Rudy's role in the cult is undefined, as viewers haven't seen him in any group meetings or murder sprees just yet.\n\nThe episode ended with Kai breaking down and Beverly smiling. Is she gaining control ... or is he just letting her think she is?\n\n\"American Horror Story: Cult\" airs Tuesdays on FX.", "images": ["https://toofab.akamaized.net/2017/10/03/ahs5-1.jpg", "https://ll-assets.tmz.com/www.tmz.com/main/default/cache/images/feedlogo2.v2014_05_09_134122.gif", "https://toofab.akamaized.net/2017/10/03/ahs4-1.jpg", "https://assets.toofab.com/toofab.com/main/default/img/toofab-logo-white.svg", "https://toofab.akamaized.net/2017/10/03/ahs3-1.jpg", "https://assets.toofab.com/toofab.com/main/default/img/skeleton.svg", "https://toofab.akamaized.net/2019/04/06/elite-daily-logo-1.png", "https://toofab.akamaized.net/2017/10/03/ahs1-1200x630.jpg", "https://ll-media.tmz.com/2013/04/26/partner-rsss-justjared-logo-cut-v2.gif", "https://ssl-cdn-media.tmz.com/2013/04/26/partner-rss-fox-b-w.png", "https://toofab.akamaized.net/2019/04/06/cdl-260x30-for-tmz3-1.png", "https://toofab.akamaized.net/2018/12/19/newsletter-logo-v2-1.png", "https://ll-media.tmz.com/2013/04/26/partner-rss-thestir-logo-cut-v2-1.png", "https://toofab.akamaized.net/2017/10/03/ahs2-1.jpg"], "top_img": "https://toofab.akamaized.net/2017/10/03/ahs1-1200x630.jpg", "keywords": [], "authors": ["Toofab Staff"], "canonical_link": "https://toofab.com/2017/10/03/the-clowns-finally-unmasked-on-american-horror-story-cult-and-4-more-shockers/", "title": "Killer Clowns Are Finally Unmasked on 'American Horror Story: Cult' and 4 More Shockers", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "twitter": {"toofab": 116547240, "card": "summary_large_image", "site": "@toofab", "title": "Killer Clowns Are Finally Unmasked on 'American Horror Story: Cult' and 4 More Shockers", "description": "Tuesday's new episode had everything: big revelations, a handful of gruesome murders and one surprise gimp.", "image": "https://toofab.akamaized.net/2017/10/03/ahs1-1200x630.jpg"}, "verify-v1": "Wtpd0N6FufoE2XqopQJoTjWV6Co/Mny9BTaswPJbPPA=", "msvalidate.01": "AFEB17971BCF30779AEA662782EF26F4", "y_key": "14cb04e4656b0c58", "description": "Tuesday's new episode had everything: big revelations, a handful of gruesome murders and one surprise gimp.", "robots": "index,follow", "referrer": "unsafe-url", "og": {"url": "https://toofab.com/2017/10/03/the-clowns-finally-unmasked-on-american-horror-story-cult-and-4-more-shockers/", "site_name": "toofab", "type": "article", "title": "Killer Clowns Are Finally Unmasked on 'American Horror Story: Cult' and 4 More Shockers", "description": "Tuesday's new episode had everything: big revelations, a handful of gruesome murders and one surprise gimp.", "image": "https://toofab.akamaized.net/2017/10/03/ahs1-480x360.jpg"}, "fb": {"app_id": 116046798441464, "pages": 324392354652}, "article": {"publisher": "https://www.facebook.com/TooFab"}}, "movies": [], "publish_date": 1506960000.0, "source": "http://toofab.com", "summary": ""}