{"url": "https://www.inquisitr.com/4336274/bachelorette-chad-johnson-sabotage-relationship-mother-death/", "text": "Bachelorette and Bachelor in Paradise star Chad Johnson finally opened up about why he thinks he sabotages his relationships with women and how big of a toll his mother’s death took on him.\n\nChad Johnson is still trying to cope with his mother’s death. The Bachelorette star lost his mother just six months before going on the show as a contestant. Chad was immediately one of the standout contestants on the season.\n\n“Yeah and they turned me into the bad guy.”\n\nThe Bachelor in Paradise star appeared in a sneak peek for an all-new episode of Famously Single with Dr. Darcy Sterling. Chad appeared to be in an unusually vulnerable state, discussing his personal issues with the therapist in front of the camera, E! News reported.\n\nThe Bachelorette “villain” opened up to Sterling about how his mother’s death is seemingly affecting his romantic relationships with women.\n\n“I come on these shows sometimes and people see me as this jerk who’s defensive or who, you know, kind of is standoffish. I don’t like letting new people in that easy because I don’t want to lose someone again like that.\n\nJohnson added that he knew that his mother was sick, but he felt like “a lot of people take too many chances of being too open too easily and I don’t really do that.”\n\nStaring contest. Pumpkin loses. A post shared by Chad Johnson (@realchadjohnson) on Jun 6, 2017 at 9:20pm PDT\n\n“Do you want to be in a relationship?” Dr. Darcy asked him.\n\nThe reality star admitted that he did actually want to be in a relationship, but he definitely recognizes that he self-sabotages in one way or another because he is “afraid of hurting them.”\n\nMay your skin be tanned and your meat intake be high. #BeachLife ➡️For diet & fitness plans RealChadJohnson.com A post shared by Chad Johnson (@realchadjohnson) on May 30, 2017 at 9:29am PDT\n\nJohnson also admitted in the preview clip for Famously Single that he had been afraid that he had “ruined his life” by appearing on The Bachelorette and Bachelor in Paradise.\n\nDr. Darcy Sterling explained to him that during his time there, they would be working on dating and relationship skills so he can learn to cope with his mother’s death and find someone he will be happy with.\n\nBoom. You are now pregnant. A post shared by Chad Johnson (@realchadjohnson) on Apr 7, 2017 at 2:23pm PDT\n\nDo you think Chad will find love on Famously Single?\n\nGot to meet @bravoandy today! See the interview tomorrow on @extratv! Also besure to checkout the new dating show #LoveConnection coming soon! A post shared by Chad Johnson (@realchadjohnson) on Mar 30, 2017 at 1:08pm PDT\n\nWill you tune in to watch the Bachelorette star Chad Johnson on Famously Single on E! Sunday night? Let us know what you think in the comments section below.\n\n[Featured Image by ABC]", "images": ["https://secure.gravatar.com/avatar/24774fc25d8eabdc10ed03eabe81d7f9?s=250&d=mm&r=g", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://cdn.inquisitr.com/wp-content/uploads/2017/06/chad-johnson-opens-up-about-relationships-on-famously-single.png", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png"], "top_img": "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Amanda Katherine"], "canonical_link": "https://www.inquisitr.com/4336274/bachelorette-chad-johnson-sabotage-relationship-mother-death/", "title": "‘Bachelorette’ Star Chad Johnson Reveals Why He Sabotages Relationships And The Toll His Mom’s Death Took", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}