{"url": "https://web.archive.org/web/20080619050133/http://www.democracynow.org:80/2008/6/18/ralph_nader_on_barack_obama_it", "text": "Democracy Now! has been selected as an Official Honoree at the 12th Annual Webby Awards in three categories: News , Political and Podcast .\n\nSami al-Haj is a free man today, after having been imprisoned by the U.S. military for more than six years. His crime: journalism. Targeting journalists, the Bush administration has engaged in direct assault, intimidation, imprisonment and information blackouts to limit the ability of journalists to do their jobs. The principal target these past seven years has been Al-Jazeera, the Arabic television network based in Doha, Qatar.\n\nA veteran of Army intelligence has shed new light on the military’s 2003 shelling of the Palestine Hotel, a Baghdad home to many journalists, including two who were killed by that attack.\n\nAs the U.S. presidential race continues, so does the arms race worldwide. People—civilians, children—are being killed and maimed, on a daily basis, by unexploded cluster bombs and land mines. Thousands of nuclear missiles remain at hair-trigger alert. The U.S. government rattles its saber at Iran, alleging a nuclear-weapons program, while at the same time offering enriched uranium to Saudi Arabia.\n\nI think the diversity of ideas, religions, and opinions in this country is our glory, is the strength of the U.S. And I think that’s why independent bookstores, which are the sanctuaries of that diversity of opinion, are just so important. They are our intellectual watering holes.\n\nDavid Iglesias is an evangelical, Hispanic Republican—yes, that one, the former U.S. attorney for New Mexico—and he has positive things to say about Barack Obama.\n\n“This way to better media,” read the floor sign directing people through a skyway to the Minneapolis Convention Center. Thousands of people gathered there for the fourth National Conference for Media Reform, hosted by freepress.net. They came from all walks of life and all ages to address a central crisis in our society: our broken media system. I was one of the invited speakers.\n\nRalph Nader on Barack Obama: “It is Quite Clear He is a Corporate Candidate from A to Z”\n\nIndependent presidential candidate Ralph Nader discusses his independent run for the White House, the media blackout of third party candidates, and his stance on the Iraq war, the military-industrial complex, the global food crisis, the Israeli-Palestinian conflict and more. [includes rush transcript]\n\nGuest:\n\nRalph Nader, Independent presidential candidate. He is a longtime consumer advocate and corporate critic.\n\nRush Transcript This transcript is available free of charge. However, donations help us provide closed captioning for the deaf and hard of hearing on our TV broadcast. Thank you for your generous contribution.\n\nDonate - $25, $50, $100, More... Related Links Ralph Nader's Campaign Site This transcript is available free of charge. However, donations help us provide closed captioning for the deaf and hard of hearing on our TV broadcast. Thank you for your generous contribution.\n\nAMY GOODMAN: As Barack Obama and John McCain trade barbs over issues ranging from Guantanamo and Iraq to Social Security and taxes, there is little in-depth analysis of their policy positions. There’s even less coverage of third party candidates.\n\nBack in February, Ralph Nader announced his third bid for the presidency on Tim Russert’s Meet the Press.\n\n\n\nRALPH NADER: One feels an obligation, Tim, to try to open the doorways; to try to get better ballot access; to respect dissent in America and the terms of third parties and independent candidates; to recognize historically the great issues have come in our history, against slavery, women rights to vote, and worker and farmer progressives, through little parties that never won any national election. Dissent is the mother of ascent. And in that context, I have decided to run for president.\n\nAMY GOODMAN: Tonight, Ralph Nader is holding a rally here in New York at Symphony Space. He joins us now in Washington, D.C., where actually the private funeral for Tim Russert is being held, as people are gathering at this hour.\n\n\n\nWelcome to Democracy Now!, Ralph.\n\n\n\nRALPH NADER: Good morning, Amy.\n\n\n\nAMY GOODMAN: It’s good to have you with us. First, your thoughts on Tim Russert. It was on his broadcast, on Meet the Press, in February, on February 24th, that you made your announcement of your presidential bid.\n\n\n\nRALPH NADER: Well, the last conversation I had with Tim Russert, maybe a month and a half ago, he told me how much he believed in intellectual tension on his program. He used that phrase, “intellectual tension.” I think that marked his willingness to have, other than the normal redundant Washington politicians on his show, although he had plenty of those, but I think why thousands of people lined up near the Washington Cathedral to pay their respects yesterday is because he had the human touch. He was the busiest mega-journalist in Washington; he ran the Washington office, he was on Meet the Press, he had a book review program on cable, he was on call by MSNBC and NBC all the time. And yet, no Washington journalist of his stature returned more calls to more people. So it wasn’t just an empty PR gesture on his part. I think he really was from South Buffalo.\n\n\n\nAMY GOODMAN: You don’t have much access to the corporate media. Why do you think that is?\n\n\n\nRALPH NADER: Well, I think the blackout has been exceptional in the last three, four months. Stephanopoulos was heard to say that the Tim Russert show was about the most publicity I would get for the whole campaign. And, of course, he hasn’t had me on, and Wolf Blitzer hasn’t had me on, and Bob Schieffer hasn’t had me on. It’s rather sad to see, because they get higher ratings, there’s more excitement—Tim Russert said he heard from people all over the world after my announcement on his show. And the networks, of course, have almost blacked out all third party independent candidates, except maybe Ron Paul.\n\n\n\nWhy is it? Well, if you look at our website, votenader.org, you’ll see why: because we have a shift of power agenda. We want to galvanize the citizenry. We want to get them involved in shaping the campaign in city after city by getting citizen coalitions together to invite these candidates as they go through the city to their own auditoriums to respond to their own agendas. And when we talk about aggressive crackdown on corporate crime, fraud and abuse, that’s on our table; it’s not on McCain/Obama’s table, not on the corporate media’s table to discuss, although the corporate media reports it every day.\n\n\n\nWe have a security speculation tax. $500 trillion in security derivatives are going to be traded this year. A tiny tax on those transactions would relieve the federal income tax up $100,000 on American workers. We have solar energy, instead of nuclear power. We have single-payer health insurance, which replaces the health insurance moguls and their enormous administrative and bureaucratic waste and their denial of doctor discretion and their “pay or die” policies in America, unlike all Western democracies.\n\n\n\nSo, you can see in many ways that we favor workers, and we favor consumers, and we favor small taxpayers, we favor the environment to the expense of corporate power. I mean, the issue here is centralized corporate power. And that’s why day after day, whether through demonstrations in front of toady government agencies and trade associations in Washington to campaigning with people and their controversies for justice all over the country, we have made our website, votenader.org, a very vivid, vivacious website for people who want to volunteer, who want to get engaged, who want to contribute money to our campaign. We take no commercial money or PACs, so we rely on individuals.\n\n\n\nSo, to sum it up, really, our campaign is to subordinate corporate power to the sovereignty of the people. Why is that a radical notion? Doesn’t the Constitution start with “We the people”?\n\n\n\nAnd speaking of the Constitution, we are strongly for the impeachment of Bush and Cheney. It’s never too late for impeachment or demanding a resignation, the way Nixon and Agnew had to resign, or after they leave office as fugitives from justice on January 21st, to invoke appropriate law to prosecute Bush and Cheney for their recidivist, criminal and anti-constitutional behavior day after day, from the criminal war in Iraq to systemic torture, to imprisoning people without charges, to wiretapping them without judicial approval, and to have signing statements that the American Bar Association has condemned, where Bush says, “I’ll sign these laws, 800 of them, but I’ll decide whether I’m going to obey them or not.”\n\n\n\nI think Chuck Hagel put it all in one sum statement, Amy, when he said a few weeks ago—he’s a Republican from Nebraska, Senator Chuck Hagel—he said, quote, “We tried a monarchy once. It didn’t work,” end-quote.\n\n\n\nAMY GOODMAN: What do think of Chuck Hagel as a vice-presidential running mate—yes, the Republican senator—for Barack Obama, one of the names that’s being bandied about?\n\n\n\nRALPH NADER: Well, he thinks for himself. And that’s about the best you can expect of a politician these days. Senator Jim Webb, Senator Chuck Hagel, they think for themselves. They’re not robotic minds. They’re not completely monetized minds. And they’re Vietnam veterans. So, in today’s politics, that puts them forward.\n\n\n\nAMY GOODMAN: Ralph Nader, on his first day as the Democrats’ presumptive nominee, Barack Obama traveled to Washington to address AIPAC, the American Israel Public Affairs Committee. This is some of what he had to say.\n\n\n\nSEN. BARACK OBAMA: Let me be clear. Israel’s security is sacrosanct. It is non-negotiable. The Palestinians need a state—the Palestinians need a state that is contiguous and cohesive and that allows them to prosper, but any agreement with the Palestinian people must preserve Israel’s identity as a Jewish state, with secure, recognized, defensible borders. And Jerusalem will remain the capital of Israel, and it must remain undivided.\n\nAMY GOODMAN: Obama later appeared to backtrack on his comments about the future status of Jerusalem as capital in a follow-up interview on CNN. He said it would be up to the Israelis and Palestinians to negotiate. Ralph Nader?\n\n\n\nRALPH NADER: Well, I think Barack Obama is in training to become panderer-in-chief. That was really a disgraceful speech. It didn’t further the peace process, the two-state solution favored by a majority of Jewish Americans, Arab Americans, a majority of Israeli and Palestinian people. He basically sided with the militaristic approach to occupying, repressing, colonizing, destroying the Palestinian people in the West Bank and Gaza. He hasn’t even spoken out against the international crime of the blockade of Gaza, one-and-a-half million people, from medicine or drinking water, fuel, electricity, food—lots of silent fatalities in Gaza because of that.\n\n\n\nBarack Obama really now has to be examined very carefully. He has worn out the word “change.” We now want to know what change is involved. And it’s quite clear that he is a corporate candidate from A to Z. In his voting record, he voted against reform of the Mining Act of 1872, which gives away our hard rock minerals. He voted for a terrible class-action restriction law that the corporations wanted him to vote for. He, in many ways, has disappointed people who had greater hopes for him. He’s voted for reauthorizing the PATRIOT Act. He refuses to even discuss—he’s vigorously against impeachment of Bush and Cheney. He won’t even support his colleague Senator Russ Feingold motion to censure the Bush administration for systemic repeated illegal wiretaps. He—you know, he’s letting the corporate-dominated city of Washington, the corporations who actually rule us now in Washington, determine his agenda. And that does not augur well.\n\n\n\nHe’s just appointed economic advisers right out of the Robert Rubin school of Citigroup and the University of Chicago. His Middle East advisers involve people who actually helped write his AIPAC speech. You know, it’s a sad thing to see, because he knows better, but he’s suppressing himself repeatedly until he becomes a different person, should he be elected president.\n\n\n\nAMY GOODMAN: We’re talking to Ralph Nader, independent presidential candidate, longtime consumer advocate. He has announced in the last months his third bid for the presidency. We’ll be back with him in a minute.\n\n\n\n[break]\n\n\n\nAMY GOODMAN: Our guest is Ralph Nader, Independent presidential candidate, holding a rally this evening at Symphony Space in New York. Ralph Nader, when we interviewed you when you set up your exploratory committee, you said that you would need, to run—you’d like to raise $10 million to have a viable campaign. How is your fundraising going? Have you reached that goal?\n\n\n\nRALPH NADER: Well, with matching funds, we’re moving in on $2 million, but the Federal Election Commission still doesn’t have a quorum. But we hope to pick up—more and more people now are contributing. We’ve gotten some major contributions from former Hillary Clinton supporters who are turned off the process. And more and more people are coming in at lower denominations—$10, $20, $50, $100—from around the country.\n\n\n\nAnd we’re looking for fundraisers. We’re looking for people to help us with media outreach, looking for computer experts. We want fifteen- and sixteen-year-olds to help us on YouTube with our effort to get the sixteen-year-old vote, which will help mature politically our teenagers who are often too wedded to video screens.\n\n\n\nWe’re trying to propose dramatic innovations, like votepact.org is proposing, to get over this problem where disenchanted Democrats vote for the Democrats because they can’t abide the Republicans, and disenchanted Republicans vote for the Republicans because they can’t abide the Democrats. And what Vote Pact does is it gives people—for example, a disenchanted Republican and a disenchanted Democrat get together, and they say, “Let’s vote for the Nader-Gonzalez ticket.” And that way, a third party has a chance, because we all know that if we don’t break up the two-party elected dictatorship, the duopoly, with instant run-off voting or public financing or ballot access reform, or binding none of the above, all of these can only be done through legislation by the two-parties who don’t want to change the system. So we’ve got to take it into our own hands.\n\n\n\nAMY GOODMAN: Ralph Nader, I wanted to play for you two clips, one of Barack Obama and one of McCain. This is Barack Obama speaking about Iran.\n\n\n\nSEN. BARACK OBAMA: We will also use all elements of American power to pressure Iran. I will do everything in my power to prevent Iran from obtaining a nuclear weapon. Everything in my power to prevent Iran from obtaining a nuclear weapon. Everything.\n\nAMY GOODMAN: On the campaign trail, John McCain accused Obama of being naive on Iran.\n\n\n\nSEN. JOHN McCAIN: My friends, they are developing nuclear weapons. Also what is totally unsatisfactory is that the Iranians are making, are manufacturing and shipping into Iraq the most lethal explosive devices that are killing young Americans. That’s not acceptable. And Senator Obama wants to sit down without any precondition across the table and negotiate with this individual. My friends, that’s not right, and that’s naive. And that shows a lack of experience and a lack of judgment.\n\nAMY GOODMAN: McCain’s position and then your assessment of Obama?\n\n\n\nRALPH NADER: Well, it recalls Michael Abramowitz in the Washington Post in March and New York Times reporters a few weeks later saying that if Obama or Clinton were elected president, the foreign and military policy would not be much different than the foreign and military policy of George Bush in his second term. And that illustrates that. The military-industrial complex and the politicians like Obama and McCain who support it—$700 billion, over half of the federal government’s operating expenditure now is the military budget—are desperately looking for enemies, desperately exaggerating enemies.\n\n\n\nIran has not invaded anybody in 250 years. Yet it’s obviously frightened. It’s surrounded by the US military west, south, east. It’s been labeled “Axis of Evil” by Bush, who invaded Iraq after he labeled them “Axis of Evil.” We have Special Forces, according to Sy Hersh, that go in and out of Iran. What are they going to do? They talk very belligerently nationally, but they’re really scared. I mean, we supported Saddam Hussein, logistically and with materiel, in invading Iran, which took a half a million Iranian lives. They remember the shooting down of their civilian airliner years ago.\n\n\n\nAMY GOODMAN: Well, let me ask you something, Ralph Nader. Who do you think would be more likely to bomb Iran, to attack Iran, or have a surrogate do it: John McCain or Barack Obama?\n\n\n\nRALPH NADER: I don’t know. I would like to say that McCain would be more likely. Bush is more likely, before he leaves office. The point is that we are exaggerating that threat instead of using diplomacy, number one. Number two, Iran does not have nuclear weapons; they’re nowhere near nuclear weapons, according to intelligence estimates. Number three, Israel has 250 nuclear weapons. Does Iran really want to commit suicide? And number four, two major national security experts in Israel have been reported as saying Iran is not a problem. So why are we beating the drums, and why is Obama falling for this kind of trap?\n\n\n\nAnd that’s a—you know, Matt Gonzalez, my running mate, wrote a 3,000-word evaluation of Obama, basically saying “count me out,” meaning him from supporting Obama. It’s on our website, votenader.org. But all this, Amy, reflects the non-engagement of the American people. What’s left for the American people to decide? They have to take the reins of their government. They have to become more engaged in this campaign. They have to demand that these candidates come to their cities and towns and listen to them and answer their questions, instead of these slick journeys that these campaigns involve with their advance people and their slogans through one town and state after the other.\n\n\n\nAMY GOODMAN: Let me ask you about Matt Rothschild, the editor of The Progressive’s piece that he wrote that’s called “Don’t Worry About Nader.” He said, “Hardly any of the tiny few who may vote for Nader would otherwise go to the Democrats in the fall, anyway. They’d vote for Cynthia McKinney or some other third party candidate, or they would write someone in, or they wouldn’t vote for anyone for president. Still, Nader serves as a reminder that the Democrats don’t automatically own the votes of those who disagree with the Republican agenda, and that Barack Obama is not as progressive as many of his supporters would hope.” That was Matt Rothschild, who was your co-treasurer, supported you in 2000 in your bid against Al Gore.\n\n\n\nRALPH NADER: And worked in our office as a newly minted graduate from Harvard. I think that’s ungracious of him. I think he should look at our website and see what the polls are showing. The most recent Associated Press poll has Nader-Gonzalez at six percent, without any national coverage, against McCain and Obama.\n\n\n\nBut I think his dilemma is what votepact.org is trying to resolve. I think he supports our agenda, but he goes for the least worst. And he’s very critical of the Democrats, but obviously he dislikes the Republicans more. This is a trap that millions of liberals and progressives have fallen into. That is, by going for the least worst, namely the Democratic nominee, they don’t make any demands on the Democratic nominee, because they’re so freaked out of the possibility the Republican may win; therefore, they’re not pulling Obama in the area of peace and justice and a carbon tax and—see?\n\n\n\nAMY GOODMAN: Well, let me ask you something. Are you, Ralph Nader, freaked out at the possibility that a Republican would win?\n\n\n\nRALPH NADER: Oh, yes, I am. And my critique of John McCain, as it was of George W. Bush, will be far more detailed and more excoriating and more grounded than the Democrats are willing to advance themselves. And so, you know, I said to Kerry, “Look at the critique that I’m making of Bush in 2004.” And he didn’t look very hard. He blurred his positions with Gore—with, rather, Bush, and therefore lost more votes than he should have, because he didn’t have a bright line on things like anti-corporate welfare, a crackdown on corporate crime against pensions and workers, etc., strong consumer protection, a carbon tax, etc.\n\n\n\nI mean, here’s an example. Gore just endorsed Obama. Gore is vigorously for a carbon tax, against his cap and trade manipulation. Is he going the pull Obama toward a carbon tax, or is he going to say, “Oh, Obama is not as bad as McCain. We’ve got to support Obama critically.” The corporations are pulling Obama every day, every day, twenty-four/seven, in their direction. If all these liberal groups with all their single issues are not pulling in the other direction, where do you think the Democratic Party and the nominee is going to go? Even if they’re elected, they won’t have any mandate. And we have to become very rigorous here. And I hope Matt Rothschild writes another editorial that reflects his intellect, rather than his desperation.\n\n\n\nAMY GOODMAN: Ralph Nader, you said in 2000 it doesn’t really matter whether Gore or Bush is president. Do you feel that way today?\n\n\n\nRALPH NADER: I didn’t say that. I said the similarities between Bush and Gore tower over the dwindling real differences that they’re willing to argue over. And, of course, my focus is not on some of the single issues. Obviously, Gore is better on Social Security, better on Medicare, better on gay, lesbian rights. Obviously in those areas, the Democrats have a much clearer position, better position, than the corporate Republicans. But in the gross area of corporate power and domination of every agency and department in our government, from the Department of Defense and Department of Labor, the Democrats are moving in the direction of the Republicans. It’s quite clear in terms of their voting record. There are exceptions, like Henry Waxman and Ted Kennedy, Ed Markey. But for the most part, these parties have moved very heavily into the grip, the iron grip of corporate power, corporate money, corporate ultimatums on globalization, for example, and above all, the distortion of the federal budget in the direction of corporate contracts, subsidies, handouts, giveaways, and the swelling of this enormous, corrupt, wasteful military budget that’s draining money.\n\n\n\nAMY GOODMAN: Ralph Nader, let me ask you a question. For those who want to vote for Barack Obama but are very discouraged about the lack of a strong stance that he has taken or laying out his position, for example, on withdrawal from Iraq, what do you think they should do?\n\n\n\nRALPH NADER: Just what votepact.org—they get together with a disenchanted Republican. So you have a disenchanted Democrat who feels he has to vote or she has to vote for the Democrats, because they don’t want Republican. You get a disenchanted Republican friend or neighbor who feels that they have to vote for Republicans; they don’t want to vote for the Democrats. And they both say they’re going to vote for Nader-Gonzalez.\n\n\n\nThere is a self-initiating process here that’s personal and political that people can do all over the country. Nobody can stop them. And we all know that every day at work, in neighborhoods and at play, the Republicans and Democrats, disenchanted with their parties, are meeting, and all they have to do—and they can actually vote absentee over—you know, while they’re having coffee, they can fill out the absentee so they can see that they’re being valid in their promises, and vote for Nader-Gonzalez.\n\n\n\nAMY GOODMAN: Your assessment of McCain and Obama’s plan to combat the global food crisis? And what is yours?\n\n\n\nRALPH NADER: Well, I would stop subsidizing corn ethanol, for one, which takes away millions of acres from wheat and barley and other edibles, soy. Obama is for subsidizing corn ethanol. Actually, McCain was fairly critical of it. I don’t know what his latest position is.\n\n\n\nNumber two, we’ve got to straighten out our food export situation. We import far too much food from China, which is contaminated. We’ve got to have much more food grown close to markets. For example, Massachusetts used to grow 80 percent of its tomatoes in 1948. Now, it imports 80 percent of its tomatoes from California, Mexico. There’s no reason for that. There’s plenty of land for vegetable growing, fruit growing near the metropolitan markets.\n\n\n\nAnd above all, we’ve got to have a foreign policy that makes us into a humanitarian superpower, that is, more agricultural cooperatives overseas, showing with our technology, appropriate technology, how to greatly increase crops and preservation of crops. 30 percent of food grown in the third world is lost due to rodents, fungus and insects. And we have a lot of knowledge on how to store food and preserve it so it isn’t lost and so people don’t starve and children don’t have distended bellies because of gross undernourishment. It’s an absolute crime against humanity.\n\n\n\nAMY GOODMAN: The Iraq war—your assessment of the Iraq war, from McCain’s comment, we’ll be there for a hundred years, Barack Obama not clear exactly how withdrawal would happen? And what would you do?\n\n\n\nRALPH NADER: Six-month corporate and military withdrawal from Iraq, during which we negotiate with the Kurds, Shiites and Sunnis for modest autonomy, which they worked out in the 1950s before the dictators took over. Under a unified Iraq, continue humanitarian aid, some peacekeepers from nearby Islamic countries, and UN-sponsored elections. That’s the way you knock the bottom out of the insurgency. That’s the way you get the authority figures, the tribal leaders and the religious leaders and others, who still have authority over millions of Iraqis, to get together, because the alternative is constant bloodshed and civil strife. So you give them a stake by using the only chip we have, which is to give back Iraq to the Iraqis, including their oil. Now that—otherwise, it’s constant, constant strife.\n\n\n\nYou saw that huge explosion in Iraq, in Baghdad, yesterday. The Pentagon doesn’t count Iraqi civilian tolls. They don’t even count officially US injuries unless they occur right in the middle of combat. So US injuries are triple what their official figure is. And all the press, including the liberal press and the indie press, still uses that figure of some 32,000 injured soldiers, when it’s triple that. I don’t understand why they follow that kind of Pentagon line. So that’s the way to deal with it.\n\n\n\nAMY GOODMAN: Ralph Nader, the issue of global warming?\n\n\n\nRALPH NADER: Global warming, solar power. Solar power is the closest thing to a universal solvent that we have. Wind power, solar thermal, solar photovoltaic, passive solar architecture, other forms—biofuels that are not corn ethanol—that’s the way to go. We’ve got to have a national mission of converting our economy and be an example for the world in solar energy. It’s four billion years of supply, Amy. And it’s decentralized, it’s environmentally benign, it makes us energy independent, and it replaces the Exxon Mobil-Peabody Coal-uranium complex. That’s what we’ve got to go for economic, political, health and safety, environmental reasons.\n\n\n\nAMY GOODMAN: The meteorologists talking “extreme weather,” those two words, but not “global warming”?\n\n\n\nRALPH NADER: Yes. Well, you know, the connection will be made more and more between extreme weather that’s occurring all over the world, the increase in water vapor, the effect of that. It’s amazing how some people who doubt global warming, I guess like Rush Limbaugh, want to wait until the ocean has overcome our literal landscapes, and I don’t know what more evidence they’re going to require. We’re having a lot of material on our votenader.org coming up on that subject, as well.\n\n\n\nAMY GOODMAN: Finally, healthcare—the difference between you, Obama and McCain, and Obama and McCain, on healthcare?\n\n\n\nRALPH NADER: As clear as could be. McCain and Obama have these cockamamie schemes that do not replace the health insurance companies. When Medicare came for the elderly in the mid-’60s, Medicare replaced the health insurance companies. We have a “pay or die” situation, which is disgraceful in this country. Whether for drugs or for healthcare, physicians have their hands tied, nurses have their hands tied.\n\n\n\nAs the California Nurses Association has so trumpeted, and so specifically, a single-payer system, which is full government insurance with free choice of doctor and hospital; with a reduction of these corporate bureaucratic costs, about $350 billion; with the replacement, because it’s only one single payer, of all these computerized billing frauds and abuses that are now about $220 billion—sources for all these figures—all that can be changed by single payer.\n\n\n\n18,000 people, according to the Institute of Medicine and the National Academy of Sciences, Amy, die every year in this country, because they cannot afford health insurance. Nobody dies in Canada, Belgium, Germany, France, Italy, the UK, because they can’t afford health insurance. This is a disgrace. And we must get rid of this inefficient, swollen, redundant, corrupt, “pay or die” so-called healthcare system and focus more on prevention and more on nutrition and more on exercise, but also more on letting doctors be doctors under quality control systems, not have their hands controlled by commercial clerks.\n\n\n\nAMY GOODMAN: Ralph Nader, we’re going to have to leave it there. You’ll be here in New York tonight, Symphony Space, 7:00—\n\n\n\nRALPH NADER: Yes.\n\n\n\nAMY GOODMAN: —for a rally. We will cover that. Thanks for joining us, independent presidential candidate, longtime consumer advocate and corporate critic.", "images": ["https://web.archive.org/web/20080619050133im_/http://www.democracynow.org/images/features/80/16180/jeremy_scahill.jpg", "https://web.archive.org/web/20080619050133im_/http://www.democracynow.org/images/features/75/16675/Moyers2Web.jpg", "https://web.archive.org/web/20080619050133im_/http://www.democracynow.org/images/nav/left_bar_bottom.png", "https://web.archive.org/web/20080619050133im_/http://www.democracynow.org/images/features/75/16075/GreenspanMTweb.jpg", "https://web.archive.org/web/20080619050133im_/http://www.democracynow.org/images/products/44/16044/coffenmugs.gif", "https://web.archive.org/web/20080619050133im_/http://www.democracynow.org/images/logos/pacifica-100x40.png", "https://web.archive.org/web/20080619050133im_/http://www.democracynow.org/images/features/45/16345/Election08.jpg", "https://web.archive.org/web/20080619050133im_/http://www.democracynow.org/images/nav/dn_logo.png", "https://web.archive.org/web/20080619050133im_/http://i4.democracynow.org/resources/thumbnails/57/157/Visit_DN_Store_.png", "https://web.archive.org/web/20080619050133im_/http://www.democracynow.org/images/features/74/16574/My-LaiWeb.jpg", "https://web.archive.org/web/20080619050133im_/http://www.democracynow.org/images/products/48/16048/t-shirt_mas.jpg", "https://web.archive.org/web/20080619050133im_/http://www.democracynow.org/images/nav/dn_logo_print.gif", "https://web.archive.org/web/20080619050133im_/http://www.democracynow.org/images/nav/right_bar_bottom.png", "https://web.archive.org/web/20080619050133im_/http://www.democracynow.org/images/nav/1pix.gif", "https://web.archive.org/web/20080619050133im_/http://i3.democracynow.org/resources/thumbnails/80/180/standing-up.png", "https://web.archive.org/web/20080619050133im_/http://www.democracynow.org/images/nav/donate.png", "https://web.archive.org/web/20080619050133im_/http://www.democracynow.org/images/nav/bring_dn_box.png", "https://web.archive.org/web/20080619050133im_/http://i2.democracynow.org/images/story/53/16753/NaderWeb1.jpg", "https://web.archive.org/web/20080619050133im_/http://www.democracynow.org/images/nav/left_bar_top.png", "https://web.archive.org/web/20080619050133im_/http://www.democracynow.org/images/nav/right_bar_top.png", "https://web.archive.org/web/20080619050133im_/http://www.democracynow.org/images/products/50/16050/bag_small.jpg", "https://web.archive.org/web/20080619050133im_/http://www.democracynow.org/images/features/25/16725/UtahPhillipsWeb.jpg", "https://web.archive.org/web/20080619050133im_/http://www.democracynow.org/images/features/65/15965/Jena7-10.jpg", "https://web.archive.org/web/20080619050133im_/http://www.democracynow.org/images/story/23/16523/TurnerWeb.jpg", "https://web.archive.org/web/20080619050133im_/http://www.democracynow.org/images/features/58/16058/Carterweb.jpg", "https://web.archive.org/web/20080619050133im_/http://i3.democracynow.org/images/nav/xml.png", "https://web.archive.org/web/20080619050133im_/http://www.democracynow.org/images/cc-by-nc-nd.png", "https://web.archive.org/web/20080619050133im_/http://www.democracynow.org/images/products/18/16118/Static_copy.jpg"], "top_img": "https://web.archive.org/web/20080619050133im_/http://i3.democracynow.org/resources/thumbnails/80/180/standing-up.png", "keywords": [], "authors": [], "canonical_link": "", "title": "Ralph Nader on Barack Obama: \"It is Quite Clear He is a Corporate Candidate from A to Z\"", "meta_data": {"description": "Independent presidential candidate Ralph Nader discusses his independent run for the White House, the media blackout of third party candidates, and his stance on the Iraq war, the military-industrial complex, the global food crisis, the Israeli-Palestinian conflict and more. [includes rush transcript]"}, "movies": [], "publish_date": 1213718400.0, "source": "https://web.archive.org", "summary": ""}