{"url": "www.inquisitr.com/4929733/is-amal-clooney-pregnant-fans-spot-maybe-baby-bump-in-new-pic/", "text": "A new picture of Amal Clooney set Instagram afire with speculation that the mother of two might be pregnant again.\n\nPopSugar posted the image on its Instagram account, and it featured actor George Clooney and his wife, Amal, a professor at Columbia, out and about in Sardinia, Italy. The pair had a date night on Monday at Il Marino di Puntaldia just two days before the first birthday of their twins, Alexander and Ella.\n\nHe’s clutching her hand, and she’s wearing a beautiful dragon print dress, while he wore a stylish blue polo shirt with striped pants. While the lovely couple always garners plenty of attention, one thing, in particular, stood out to fans in this picture. Followers quickly pointed out that Amal sported what might be a tiny baby bump in the image.\n\nInstagram user andreal_pez asked, “Is she pregnant again???” Of course, another fan had another possible explanation. A poster with the username carefullycuratedcloset said, “Does she look a bit preggers or [is] she just having one of THOSE days like the rest of us do??”\n\nIt would entirely be horrifying to see pictures of yourself after date night, and immediately see speculation of a possible pregnancy when the truth is you merely sported a food baby after some delicious food.\n\nLast fall, Amal, told the Hollywood Reporter that she doesn’t want to have any more children. She said, “I’m 39. I already had them quite late.” Now, she’s 40 and George is 57, and it doesn’t seem likely that they’ve changed their minds in the few months since last fall with two toddlers in their household even though she praised her husband as a great father — a fact that appeared to surprise him.\n\nPlus, there’s the fact that George didn’t even plan to have children. He said, “It had never been part of my DNA. We didn’t plan on it. We never talked about it until after we were married, which is funny. There was an assumption that we didn’t want them. And then, after the wedding, Amal and I were talking and we just felt we’d gotten very lucky, both of us, and we should share whatever good luck we’ve got. It would seem self-centered to just have that belong to us.”\n\nShortly after deciding to start a family, Amal reportedly got pregnant without the help of fertility drugs, and the couple’s twins came as a big surprise about one month early last June. Could Amal be pregnant again just one year later? Perhaps, but it seems unlikely. However, her dress at the royal wedding a few weeks ago did have some strategic pleating in the midsection.", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2018/06/George-Clooney-Amal-Clooney-Pregnant.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://secure.gravatar.com/avatar/42196c046e4a2503f7f937da1575ba1c?s=250&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Rachel Dillin"], "canonical_link": "https://www.inquisitr.com/4929733/is-amal-clooney-pregnant-fans-spot-maybe-baby-bump-in-new-pic/", "title": "Is Amal Clooney Pregnant? Fans Spot Maybe Baby Bump In New Pic", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}