{"url": "www.wonderwall.com/celebrity/blake-shelton-shopping-for-diamond-ring-for-gwen-stefani-proposing-on-valentines-day-is-made-up-3012461.article?photoId=1015358", "text": "A new story about Blake Shelton shopping for a $500K \"diamond ring\" for Gwen Stefani and proposing on Valentine's Day is made-up. The claim comes from the HollywoodLife, a site that has previously published fake news stories alleging they're already engaged, were getting engaged on Christmas, had a \"secret wedding,\" were eloping, and may \"never get married\" at all. The blog has also falsely reported a couple of times that Shelton and Stefani have split up.\n\n@gwenstefani / Instagram\n\nBasically, the outlet throws everything against the wall, hoping something will stick. And wedged inside its Jenga-like tower of lies, the site contends it's learned its supposed information from sources \"close\" to the couple. But based on how frequently off-base the blog is, it's clear many of these articles are just fabrications.\n\nOn the heels of Shelton, Stefani and her kids looking like a happy family at the Super Bowl, the aptly nicknamed HollywoodLies maintains Shelton is taking their \"relationship to the next step.\" The often discredited site asserts a \"source close\" to Shelton leaked that his \"team\" has gone to \"shop for jewelry\" for him. A so-called \"insider\" is quoted as saying, \"One of Blake's assistants was spotted visiting and shopping with a private jeweler in Beverly Hills this week.\" The questionable source adds that the diamond ring would be for a \"Valentine's Day proposal.\"\n\nNaturally, the habitually wrong outlet doesn't mention when Shelton's \"assistant\" supposedly went engagement ring shopping. And suspiciously, the blog doesn't seem to have the name of the (probably nonexistent) jeweler. It also bears noting that HollywoodLies would like its readers believe that for such an important and meaningful present, like an engagement ring, Shelton simply sent out an \"assistant\" and told him or her to pick out something nice for Stefani.\n\nIrrespective of how the article is missing key information and defies logic, Gossip Cop still fact-checked the repeatedly disproven site's story. Literally, no real insiders could confirm that Shelton sent an assistant off on an engagement ring run for Stefani. Additionally, we were told long ago that despite the blog's assertions, no one \"close\" to the singer is sharing personal details or inaccurate gossip about Shelton with HollywoodLies, including tales about him shopping for an engagement ring.\n\nAnd it should be clear from that site's own reporting that it does not have true insiders, as it has falsely maintained. Remember, this is the same outlet that Gossip Cop busted when it untruthfully claimed in the past that Shelton and Stefani were engaged. We also exposed the blog when it lied about Shelton proposing to Stefani on Christmas. It appears HollywoodLies is just going to run its proposal story tied to a number of holidays, events, and milestones, hoping one day they're right. And maybe they'll finally guess correctly, but it will have nothing to do with solid reporting or sources.\n\nMore on Gossip Cop:\n\n\"The Bachelor\" recap: Arie Luyendyk says au revoir to Krystal in Paris\n\nRobert Pattinson travels with a guitar, shotgun and pony in \"Damsel\" clip\n\nAngelina Jolie and Brad Pitt did NOT split over kids' education despite report", "images": ["http://www.wonderwall.com/cache/img/gossipcop_1520380848.png", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAX4AAAAyAQMAAABh+SIcAAAAA1BMVEXl5eX7Oj7PAAAAAXRSTlMAQObYZgAAABlJREFUeAHtwQEBAAAEACD/V3sBVNEMAIAECZIAAY3qJn4AAAAASUVORK5CYII=", "https://www.wonderwall.com/photos/2018/02/06/109-1015358-screen-shot-2017-11-15-at-7-1517945395.png?icq=74", "https://www.wonderwall.com/photos/2018/02/06/109-1015358-screen-shot-2017-11-15-at-7-1517945395.png?x=700&y=697&icq=74&sig=d113fa9355413468ba5434ce10b2f407", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAL0AAAAaAQAAAADKtWDLAAAAAnRSTlMAAHaTzTgAAAAOSURBVHgBYxgUYBSMAgACigABeXQ0YAAAAABJRU5ErkJggg=="], "top_img": "https://www.wonderwall.com/photos/2018/02/06/109-1015358-screen-shot-2017-11-15-at-7-1517945395.png?icq=74", "keywords": [], "authors": [], "canonical_link": "https://www.gossipcop.com/?p=825739", "title": "Blake Shelton Shopping For Diamond Ring For Gwen Stefani, Proposing On Valentine's Day Is Made-Up", "meta_data": {"description": "A new story about Blake Shelton shopping for a $500K \"diamond ring\" for Gwen Stefani and proposing on Valentine's Day is made-up...", "pubdate": "2018-02-06T11:29:00-08:00", "title": "Blake Shelton Shopping For Diamond Ring For Gwen Stefani, Proposing On Valentine's Day Is Made-Up", "og": {"image": {"identifier": "https://www.wonderwall.com/photos/2018/02/06/109-1015358-screen-shot-2017-11-15-at-7-1517945395.png?icq=74", "width": 632, "height": 630}, "title": "Blake Shelton Shopping For Diamond Ring For Gwen Stefani, Proposing On Valentine's Day Is Made-Up", "description": "A new story about Blake Shelton shopping for a $500K \"diamond ring\" for Gwen Stefani and proposing on Valentine's Day is made-up...", "type": "article", "site_name": "Wonderwall.com", "url": "https://www.wonderwall.com/celebrity/blake-shelton-shopping-for-diamond-ring-for-gwen-stefani-proposing-on-valentines-day-is-made-up-3012461.article"}, "article": {"published_time": "2018-02-06T11:29:00-08:00", "section": "Celebrity"}, "fb": {"app_id": 111376106992, "pages": 61348233862}, "twitter": {"site": "@Wonderwall", "card": "summary_large_image", "title": "Blake Shelton Shopping For Diamond Ring For Gwen Stefani, Proposing On Valentine's Day Is Made-Up", "description": "A new story about Blake Shelton shopping for a $500K \"diamond ring\" for Gwen Stefani and proposing on Valentine's Day is made-up...", "image": "https://www.wonderwall.com/photos/2018/02/06/109-1015358-screen-shot-2017-11-15-at-7-1517945395.png?icq=74"}, "viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0", "p": {"domain_verify": "6bd7ca8def87b619f395211fb9be7755"}, "msapplication-TileColor": "#fb1896", "msapplication-TileImage": "https://www.wonderwall.com/mstile-144x144.png", "theme-color": "#ededed"}, "movies": [], "publish_date": 1517945340.0, "source": "http://www.wonderwall.com", "summary": ""}