{"url": "https://en.wikiquote.org/wiki/National_Treasure_(film)", "text": "National Treasure is a 2004 film that follows Benjamin Franklin Gates, a man whose family has a history of searching for a near-limitless treasure, one his father (and just about everyone else) believes is a mystery. When he finally discovers a real clue, he must protect it, the treasure, and a precious national document from his former partner.\n\nThe greatest adventure history has ever revealed. taglines\n\nDialogue [ edit ]\n\n[In 1974 John Adams Gates tells the story of a mysterious treasure to a young Ben Gates] John Adams Gates: OK, here we go. It was 1832, on a night much like this. Charles Carroll was the last surviving signer of the Declaration of Independence. He was also a member of a secret society known as the Masons, and... he knew he was dying. He woke up his stable boy in the middle of the night and ordered him to take him to the White House to see Andrew Jackson because it was very urgent that he speak to the President. Ben Gates: Did he talk to him? John Adams Gates: No. He never got the chance. The President wasn't there that night, but Charles Carroll had a secret. So he took into his confidence the one person he could: my grandfather's grandfather, Thomas Gates. Ben Gates: What was his secret? John Adams Gates: A treasure! A treasure beyond all imagining. A treasure that had been fought over for centuries by tyrants, pharaohs, emperors, warlords. And every time it changed hands, it grew larger. And then, suddenly, [snaps his fingers] it vanished. It didn't reappear for more than a thousand years when knights from the First Crusade found hidden vaults beneath the Temple of Solomon. You see, the knights who found the vaults believed that the treasure was too great for any one man, not even a king. They brought the treasure back to Europe and took the name... the Knights Templar. Over the next century, they smuggled it out of Europe and formed a new brotherhood known as the Freemasons, in honor of the builders of the Great Temple. War followed. By the time of the American Revolution, the treasure had been hidden again. By then, the Masons came to include George Washington, Benjamin Franklin, Paul Revere. They knew they had to make sure the treasure would never fall into the hands of the British, so they devised a series of clues and maps to its location. Over time the clues were lost or forgotten, until only one remained. And that was the secret that Charles Carroll entrusted to young Thomas Gates. Charles Carroll: Charlotte. Ben Gates: Who's Charlotte? John Adams Gates: Oh, not even Mr. Carroll knew that. Now, look here, Ben. The Freemasons among our Founding Fathers left us clues [takes out one-dollar bill] like these. The unfinished pyramid, the all-seeing eye. Symbols of the Knights Templar, guardians of the treasure. They are speaking to us through these. Patrick Gates: You mean laughing at us. You know what that dollar represents: the entire Gates family fortune. Six generations of fools... chasing after fool's gold. John Adams Gates: It's not about the money, Patrick. It's never been about the money! Patrick Gates: Come on, son. Time to go. You can say your goodbyes.\n\n[Sadusky and Ben discuss the reward for finding the treasure] Agent Sadusky: Just like that? Ben: Just like that. Agent Sadusky: You know that you've just handed me your biggest bargaining chip. Ben: The Declaration of Independence is not a bargaining chip. Not to me. Agent Sadusky: Have a seat. So what's your offer? Ben: Oh, how about a bribe? Say, ten billion dollars? Agent Sadusky: I take it you found the treasure. Ben: It's about five stories beneath your shoes. Agent Sadusky: Hm. You know, the Templars and the Freemasons believed the treasure was too great for any one man to have, not even a king. That's why they went to such great lengths to keep it hidden. Ben: That's right. The Founding Fathers believed the same thing about government. I figure their solution will work for the treasure, too. Agent Sadusky: Give it to the people. Ben: Divide it amongst the Smithsonian, the Louvre, the Cairo Museum... there's thousands of years of world history down there, and it belongs to the world, and everybody in it. Agent Sadusky: [Admiringly] You really don't understand the concept of a bargaining chip. Ben: Here's what I want: Dr. Chase gets off completely clean; not even a little Post-It on her service record. Agent Sadusky: Okay. Ben: I want the credit for the find to go to the entire Gates family, with the assistance of Mr. Riley Poole. Agent Sadusky: And what about you? Ben: I'd really love not to go to prison. I can't even describe how much I would love not to go to prison. Saudusky: Someone's got to go to prison, Ben. Ben: Well, if you've got a helicopter, I think I can help with that.\n\nIan: [about the Declaration of Independence] We could borrow it. Ben: Steal it? I don't think so. Ian: Look, Ben... I understand your bitterness. I really do. You've spent your entire life searching for this treasure, only to have the respected historical community treat you and your family with mockery and contempt. You should be able to rub this treasure in their arrogant faces, and I want you to have the chance to do that. Ben: How? Ian: We all have our areas of expertise. You don't think mine are limited to writing checks, do you? In another life, I've arranged several operations of questionable legality. Shaw: I'd take his word for it if I was you. Ian: So don't worry. I'll make all the arrangements. Ben: No! Ian: I could really use your help here. Ben: Ian, I'm not going to let you steal the Declaration of Independence. Ian: Alright. From this point on, all you're going to be is a hindrance. [signals Shaw to ready a gun to which Ben nervously laughs] Riley: Hey! Ben: What are you going to do? Are you going to shoot me, Shaw? Well, you can't shoot me. There's more to the riddle; information you don't have, I do. I'm the only one who can solve it. Shaw: He's bluffing. Ben: We play poker together, Ian. You know I can't bluff. Ian: Tell me what I need, or I'll shoot your friend. [Shaw points his gun at Riley] Riley: Hey! Ian: Quiet, Riley. Your job's finished here. [Ben lights flare, Shaw turns his gun back to Ben and looks astonished along with Ian] Ben: Look where you're standing. All that gunpowder. You shoot me, I drop this, we all go up. Riley: Ben? Ian What happens when the flare burns down? [Ben looks questionably] You just tell me what I need to know. Ben: You need to know... If Shaw can catch. [throws the flare, Riley squints scared, Ian catches it before it hits gunpowder] Ian: Nice try, though. [coat sleeve catches on fire and drops flare on gunpowder]\n\nAbigail: You told my assistant that this was an urgent matter? Ben: Yes, ma'am. Well, I'm gonna get straight to the point. Someone's gonna steal the Declaration of Independence. Riley: It's true. Abigail: I think I'd better put you gentlemen in touch with the FBI... Ben: We've been to the FBI. Abigail: And...? Riley: They assured us that the Declaration cannot possibly be stolen. Abigail: They're right. Ben: My friend and I are less certain. However, if we were given the privilege of examining the document... [Abigail eyes him curiously] we would be able to tell you for certain if it were actually in any danger. Abigail: What do you think you're gonna find? Ben: We believe that there's an... encryption on the back. Abigail: An encryption, like a code? Ben: Yes, ma'am. Abigail: Of what? Ben: A... cartograph. Abigail: A map? Ben: Yes, ma'am. Abigail: A map of what? Ben: The location of... [clears throat] of hidden items, of historic and intrinsic value. Abigail: A treasure map? Riley: That's where we lost the FBI. Abigail: You're treasure hunters, aren't you? Ben: We're more like treasure protectors. Abigail: Mr. Brown, I have personally seen the back of the Declaration of Independence, and I promise you the only thing there is a notation that reads, \"Original Declaration of Independence\", dated... Ben: July 4, 1776, yes, ma'am. Abigail: But no map. Ben: It's invisible. Abigail: [sarcastically] Oh, right. Riley: And that's where we lost the Department of Homeland Security.\n\nRiley: If it's any consolation, you have me convinced. Ben: It's not. Riley: I was thinking, what if we go public, plaster the story all over the Internet? It's not like we have our reputations to worry about. Although, I don't think that's exactly gonna scare Ian away. Ben: A hundred and eighty years of searching, and I'm three feet away. Of all the ideas that became the United States, there's a line here that's at the heart of all the others: \"But when a long Train of Abuses and Usurpations, pursuing invariably the same Object, evinces a Design to reduce them under absolute Despotism, it is their Right, it is their Duty, to throw off such Government, and to provide new Guards for their future Security.\" People don't talk that way anymore. Riley: Beautiful, huh? No idea what you just said. Ben: It means, if there's something wrong, those who have the ability to take action have the responsibility to take action. I'm gonna steal it. Riley: What? Ben: I'm gonna steal the Declaration of Independence.\n\nRiley: OK Ben. Pay attention. I've brought you to the Library of Congress. Why? Because it's the biggest library in the world. Over twenty million books, and they're all saying the same exact thing: listen to Riley. What we have here is an entire layout of the Archives: sort of builder's blueprints. We've got construction manuals, phone lines, water, and sewage. It's all right here. [Riley continues in voiceover as the camera moves around the archives] Now, when the Declaration is on display, it is surrounded by guards...and video monitors... and little families from Iowa... and little kids on their eighth-grade field trip. And underneath an inch of bulletproof glass is an army of sensors and heat monitors that will go off if someone gets too close with a high fever. Now, when it's not on display, it is lowered into a four-foot-thick concrete, steel-plated vault that happens to be equipped with an electronic combination lock and biometric access-denial systems. Ben: You know, Thomas Edison tried and failed nearly 2,000 times to develop the carbonized cotton-thread filament for the incandescent light bulb. Riley: Edison? Ben: And when asked about it, he said \"I didn't fail; I found out 2,000 ways how not to make a light bulb,\" but he only needed one way to make it work. [sets down a book in front of Riley] The Preservation Room. Enjoy. Go ahead. Do you know what the preservation room is for? Riley: Delicious jams and jellies? Ben: No, that's where they clean, repair, and maintain all the documents and their storage housings when they are not on display or in the vault. Now, when the case needs work, they take it out of the vault and directly across the hall and into the Preservation Room. The best time for us or Ian to steal it would be during the gala this weekend, when the guards are distracted by the VIPs upstairs; but we'll make our way to the Preservation Room, where there is much less security. Riley: Well... uh... Ian... Preservation, hmm. Well, this might be possible. Ben: It might.\n\n[Abigail is freaking out, thinking that Ian has the Declaration] Ben: They don't have it. [Pulls the Declaration out to show her] See, now can you please stop shouting? Abigail: Give me that! Ben: You're still shouting. And it's really starting to annoy. You would do well, Dr. Chase, to be a bit more civilized in this instance. Abigail: If that's the real Declaration, what did they get? Ben: A souvenir. I thought it might be a good idea to have a duplicate, turns out I was right. Actually, I had to pay for the real one and the duplicate, so you owe me $35, plus tax. Riley: Genius. Abigail: Verdammt! Give me that! Ben: You know something? You're shouting again. Riley: I'm pretty sure she was swearing, too. Ben: Well, I probably deserved that.\n\nAbigail: What do you see? Ben: 2:22. Abigail: What time is it now? Clothing Store Clerk: Almost 3. Abigail: [sighs] We missed it. Riley: No, we didn't. We didn't miss it because... you don't know this? I know something about history that you don't know. Ben: I'd be very excited to learn about it, Riley. Riley: Hold on one second, let me just take in this moment. [takes a deep breath] This is cool. Is this how you feel all the time? Well, except now, of course-- Abigail: Riley! Riley: All right! What I know is that daylight savings weren't established until World War I. If it's 3 p.m. now that means that in 1776 it would be 2 p.m. Ben: Riley, you're a genius. Riley: Do you actually know who the first person to come up with the idea of daylight savings time was? Abigail and Ben: Benjamin Franklin. [Riley stomps his foot in disappointment]\n\nIan: Hello, Ben. How are you? Ben: Um, chained to a desk. Ian: Sorry to hear that. I want you to meet me on the flight deck of the USS Intrepid. You know where that is? Ben: New York. Ian: Meet me there at ten o'clock tomorrow morning. And bring those glasses you found at Independence Hall. Yeah, I know about the glasses. We can take a look at the Declaration, and then you can be on your way. Ben: And I'm supposed to believe that? Ian: I told you from the start, I only wanted to borrow it. You can have it. And the glasses. I'll even throw in the pipe from the Charlotte. Ben: I'll be there. Ian: And tell the FBI agents listening in on this call if they want the Declaration back, and not just a box of confetti, then you'll come alone.\n\n[Ian wants the next clue] Patrick Gates: It's part of Freemason teachings. In King Solomon's temple, there was a winding staircase. It signified the journey that had to be made to find the light of truth. The lantern is the clue. Ian: What does it mean? Ben: Boston. It's Boston. Patrick Gates: The Old North Church, where Thomas Newton hung a lantern in the steeple, to signal Paul Revere that the British were coming. One if by land, two if by sea. One lantern. Under the winding staircase of the steeple, that's where we have to look. Ian: Thank you. Patrick Gates: Hey, you have to take us with you. Ian: Why? So you can escape in Boston? Besides, with you out of the picture, there's less baggage to carry. Patrick Gates: What if we lied? Ian: Did you? Ben: What if there's another clue? Ian: Then I'll know right where to find you. See you, Ben.\n\nRiley: [After they find the treasure] They offered you ten percent, man. Ten percent. Ben: Tell you what- next time we find a treasure that redefines history for all mankind, you call the shots. Riley: What do you care? You got the girl. Enjoy your spoils while I sit on one percent. Half of one percent, actually. [Jumps into red Ferrari] Ben: [Looking at Ferrari] I'm sorry for your suffering, Riley.\n\nTaglines [ edit ]\n\nThe greatest adventure history has ever revealed.\n\nIn order to break the code, one man will have to break all the rules.", "images": ["https://en.wikiquote.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Wikipedia-logo-v2.svg/50px-Wikipedia-logo-v2.svg.png", "https://en.wikiquote.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikiquote.org/static/favicon/wikiquote.ico", "https://en.wikiquote.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://en.wikiquote.org/static/favicon/wikiquote.ico", "keywords": [], "authors": [], "canonical_link": "https://en.wikiquote.org/wiki/National_Treasure_(film)", "title": "National Treasure (film)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikiquote.org", "summary": ""}