{"url": "https://people.com/movies/sag-awards-2018-morgan-freeman-lily-tomlin-speech/", "text": "There was one question on everybody’s minds after Morgan Freeman gave his life achievement award speech at the 2018 Screen Actors Awards: Who was the mystery celebrity that the 80-year-old actor called out during his speech?\n\nAs Freeman began his acceptance speech on Sunday, he paused for a moment to abruptly call out another member of the audience. And while the actor didn’t elaborate on who he was talking about at the time, backstage he let reporters in on a little secret — it was Lily Tomlin!\n\nGet push notifications with news, features and more.\n\n“Yeah. That was Lily Tomlin,” he explained at the 2018 SAG Awards press room at The Shrine Auditorium in Los Angeles on Sunday. “She’s a wonder in herself and I’ve always loved her. I see her, I say hello.”\n\nTomlin was also the recipient of the SAG life achievement award at least year’s ceremony.\n\nBe sure to check out PEOPLE’s full SAG Awards coverage to get the latest news on Hollywood’s big night.\n\nShortly after walking onstage to begin his speech earlier that night, Freeman stopped and said, “Hey…I’m talking to you. Yeah, hey,” to a then-unidentified person in the audience.\n\n“Okay, well you just stand out to me, that’s all,” he added, before resuming his speech.\n\nImage zoom\n\nRELATED: Morgan Freeman & Rita Moreno Playfully Rib Each Other as He Accepts SAG Life Achievement Award\n\nFreeman received the life achievement award at the ceremony this year for his work in film, in addition to his humanitarian accomplishments. His Electric Company costar Rita Moreno, who is an EGOT winner, presented him the honor, which Freeman presented to her back in 2013.\n\n“Morgan is more than just an actor, producer humanitarian — this man is a national treasure,” Moreno, 86, said before the video montage dedicated to Freeman’s career.\n\nImage zoom Kevork Djansezian/Getty\n\nBefore taking the stage, Freeman was greeted with a standing ovation from the audience — and the cheers intensified, even more, when he headed to accept the honor.\n\n“Morgan, lift up your hat,” instructed Moreno, who wanted to make sure the audience was able to see his face.\n\n“You have no idea how long I’ve had to put with that,” Freeman joked before starting his speech.\n\nImage zoom\n\nTo donate to the Time’s Up Legal Defense Fund, which will provide subsidized legal support to women and men in all industries who have experienced sexual harassment, assault, or abuse in the workplace, visit its GoFundMe page. Learn more about Time’s Up, an organization of women in entertainment combating sexual harassment and inequality, on its website.\n\n“This is beyond an honor. This is a place in history,” he said, before adding, “Oh, and one more thing, I wasn’t going to do this. I’m going to tell you what’s wrong with this statue, it works from the back, from the front it’s gender specific. Maybe I started something.”\n\nAfter winning a statewide drama competition in Mississippi at age 12, Freeman went on to perform in small parts before serving in the U.S. Air Force, eventually graduating to film and television roles in his subsequent career in Hollywood, which has resulted in over $4.5 billion in cumulative worldwide ticket sales.\n\nRELATED VIDEO: Kristen Bell Talks Husband Dax Shepard’s “Unending Support” For SAG Hosting Duties\n\nIn addition to his work on screens big and small — namely in movies like Unforgiven, Million Dollar Baby, The Shawshank Redemption, Driving Miss Daisy, and Christopher Nolan’s Dark Knight trilogy — Freeman has embarked on several philanthropic ventures. In 1973, he co-founded the Frank Silvera Writers’ Workshop in support of black playwrights, and he continues to contribute to Artists for a New South Africa and the Campaign for Female Education.\n\nThe prestigious award has been given to esteemed members of the industry elite in the recent past, including Ernest Borgnine in 2010, Mary Tyler Moore in 2011, Dick Van Dyke in 2012, Moreno in 2013, Debbie Reynolds in 2014, and Carol Burnett in 2015. Lily Tomlin received the honor at last year’s ceremony.\n\nThe 24th annual Screen Actors Guild Awards was broadcast live from the Shrine Auditorium in Los Angeles on both TNT and TBS.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmorgan-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmorgan-freeman4.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Frita-moreno-morgan-freeman-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmorgan-freeman4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmorgan-freeman4.jpg", "keywords": [], "authors": ["Maria Pasquini", "Mariah Haas"], "canonical_link": "https://people.com/movies/sag-awards-2018-morgan-freeman-lily-tomlin-speech/", "title": "Who Was Morgan Freeman Calling Out During His SAG Life Achievement Award Speech?", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Awards Shows,Lily Tomlin,Morgan Freeman,Movie News,News,SAG Awards,Screen Actors Guild Awards", "news_keywords": "Awards Shows,Lily Tomlin,Morgan Freeman,Movie News,News,SAG Awards,Screen Actors Guild Awards", "description": "While Morgan Freeman didn’t elaborate on which celebrity he interrupted his acceptance speech to say hi to at the time, backstage he let reporters in on a little secret — it was Lily Tomlin", "og": {"title": "Who Was Morgan Freeman Calling Out During His SAG Life Achievement Award Speech?", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/movies/sag-awards-2018-morgan-freeman-lily-tomlin-speech/", "description": "There was one question on everybody’s minds after Morgan Freeman gave his life achievement award speech at the 2018 Screen Actors Awards: Who was the&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmorgan-freeman4.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/movies/sag-awards-2018-morgan-freeman-lily-tomlin-speech/", "description": "While Morgan Freeman didn’t elaborate on which celebrity he interrupted his acceptance speech to say hi to at the time, backstage he let reporters in on a little secret — it was Lily Tomlin", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmorgan-freeman4.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/movies/sag-awards-2018-morgan-freeman-lily-tomlin-speech/", "title": "Who Was Morgan Freeman Calling Out During His SAG Life Achievement Award Speech?", "description": "While Morgan Freeman didn’t elaborate on which celebrity he interrupted his acceptance speech to say hi to at the time, backstage he let reporters in on a little secret — it was Lily Tomlin", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmorgan-freeman4.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}