{"url": "en.wikipedia.org/wiki/Tyga", "text": "American rapper, singer, actor, and television personality from California\n\nMicheal Ray Stevenson[3] (born November 19, 1989), known by his stage name Tyga (a backronym for Thank you God always), is an American rapper, singer, songwriter, actor, and television personality.[4] After a number of independent releases, Tyga signed a recording contract with Young Money Entertainment, Cash Money Records and Republic Records in 2008. His major label debut Careless World: Rise of the Last King was released in 2011 and included the successful singles \"Rack City\", \"Faded\" featuring Lil Wayne, \"Far Away\" featuring Chris Richardson, \"Still Got It\" featuring Drake, and \"Make It Nasty\".\n\nAfter disagreements with Young Money, Tyga's fourth album The Gold Album: 18th Dynasty was released independently on June 23, 2015 and became his worst selling album to that point, selling just 5000 equivalent album units in its first week.[5]\n\nAfter a long period of poor sales and negative reviews from previous albums, his May 2018 single, \"Taste\" featuring Offset, peaked at number 8 on the Billboard Hot 100, being his first Top 40 single since \"Ayo\" with Chris Brown in 2015. That single would later serve as the lead single for his seventh album Legendary, which was eventually released in 2019.[6]\n\nEarly life\n\nMicheal Ray Stevenson was born in Compton, California, on November 19, 1989,[7] and raised there until he \"was about 11, 12,\" before moving to adjacent Gardena.[8] He is of Vietnamese and Jamaican descent.[9] His mother was born in Vietnam and has the maiden name Nguyen.[3] He grew up listening to Fabolous, Lil Wayne, Cam'ron and Eminem among many others.[10]\n\nOn December 3, 2012, debate arose concerning Tyga's upbringing. Tyga claimed to have been brought up in the low socioeconomic area of Compton, but in leaked footage from the unaired television show Bustas, he claimed he grew up in a \"well-to-do\" home in the Valley, where his parents drove a Range Rover. He also claimed that he attained his nickname from his mother calling him Tiger Woods.[11] There has been speculation that his claims on the show were satirical and not to be taken seriously. Tyga responded to the video's leak on Twitter: \"When u 14 an ambitious u don't give a fuk about anything. Scripted tv isn't that what we all live for.Hahahaha.\"[12]\n\nCareer\n\n2007–10: No Introduction and mixtapes\n\nStevenson's career began with him releasing a multitude of demo tapes and mixtapes. His 2007 debut mixtape, Young On Probation, garnered the attention of his debated cousin, Travie McCoy. Seeing talent in the young artist, McCoy offered him a record deal with the independent label DCD2 Records (known then as Decaydence Records). Stevenson also signed with G.E.D. (Getting Educated Daily) Inc. around the time, the same imprint that helped launch the career of fellow West Coast rapper Schoolboy Q, with whom he's worked with early in his career. Tyga also has a G.E.D. Inc tattoo above his right eyebrow.[13][14]\n\nNo Introduction, released on Decaydance Records on June 10, 2008, was Tyga's first independent album.[15] The album was supported by the single \"Coconut Juice\", featuring McCoy. One of the songs from this album, \"Diamond Life\", was used in the video games Need for Speed: Undercover and Madden NFL 2009, as well as in the 2009 movie Fighting.\n\nIn late 2008, Tyga signed an additional record deal with Lil Wayne's Young Money Entertainment, which was a subsidiary of Cash Money Records at the time. Tyga met Wayne at the 2008 VMA's, performing the remix of Fall Out Boy's \"This Ain't a Scene, It's an Arms Race\". He was first featured on the song \"Bedrock\" by Young Money soon after signing to the label. He soon released the mixtape Fan of a Fan with Chris Brown and producers DJ Ill Will and DJ Rockstar. It features other artists such as Bow Wow, Lil Wayne, and Kevin McCall featured in several tracks. Four tracks (\"Holla at Me\", \"G Shit\", \"No Bullshit\" and \"Deuces\") are also accompanied by music videos. The track \"Deuces\" was released as the lead single of the mixtape and reached #14 on the Billboard Hot 100 and number 1 on the Billboard Hot R&B/Hip-Hop Songs by August 26, 2010. The track has also been nominated for Best Rap/Sung Collaboration at the 53rd Grammy Awards.[16][17] The track, among others, was on the track list of Chris Brown's fourth studio album, F.A.M.E.. Tyga also told MTV in an interview that the mixtape's production took just short of a week.[18]\n\n2011–12: Careless World: Rise of the Last King\n\nCareless World: Rise of the Last King was his second studio album. The album was released on February 21, 2012 on Young Money Entertainment, Cash Money Records, and Universal Republic Records. Careless World: Rise of the Last King is a move to the rapping style he featured in the collaboration album We Are Young Money rather than the poppy dance element exemplified on his previous effort, No Introduction.[19] Tyga stated that the album shows he has grown up but still relates to the kids. In preparation for the album, Tyga released the mixtape #BitchImTheShit in December 2011.\n\nThe first official single, \"Far Away\", was released on May 17, 2011 and peaked at 86 on the Billboard Hot 100. The second official single, \"Still Got It\", was released on October 4, 2011 and peaked at 89 on the Billboard Hot 100. The third official single, \"Rack City\", was released on December 6, 2011. It was originally listed on Tyga's Well Done 2 mixtape, and was added to the album after it gained commercial success. It debuted at number 94 on the Billboard Hot 100, and has peaked at number 8 since then. The fourth official single, \"Faded\", was released on January 13, 2012. It peaked on the Hot 100 at #33.\n\nTyga's sixth single, \"Do My Dance\" which features 2 Chainz was released on October 2, 2012 and peaked at #79 on the Billboard Hot 100. He has released various mixtapes such as well-acclaimed #BitchImTheShit and Well Done 3.\n\nThat year Tyga also produced and co-directed (with Justice Young) a multi-AVN award-nominated crossover adult film, Rack City: The XXX Movie, which starred Skin Diamond, Jada Fire, Ice La Fox, Sophie Dee, Lexington Steele, Kristina Rose, London Keyes and Daisy Marie.[20][21] He also signed the soundtrack, which includes the hits \"Rack City\" and \"Faded\" together with several original songs, and he appeared in the film in a non-sex role.[20][22][23][24][25][26][27]\n\n2012–13: Hotel California\n\nTyga in 2013\n\nTyga's third studio album, Hotel California, was released on April 9, 2013. The first single, \"Dope\", was released on December 25. The song has a notable feature from rapper Rick Ross.[28] Before the single dropped Tyga released a nine-track mixtape under the name 187.[29] 187 the mixtape was released on November 30, 2012. It features remixes to songs such as 2 Chainz's \"I'm Different\", Meek Mill's \"Young & Gettin' It\" and GOOD Music's \"Clique\", among others and new material.[30] Tyga will also release a second Fan of a Fan mixtape with singer Chris Brown.[28] On episode three of Tyga's tour vlog Tyga confirmed four features on the upcoming album, including Rick Ross, Nicki Minaj, Chris Brown, and Wiz Khalifa.[31] Tyga performed at Harvard University's Yardfest in the Spring of 2013, despite opposition from critics who've signed a petition seeking to keep him away over what they call his \"violently misogynistic lyrics.\"[32] At this time, Tyga collaborated with singer Sabi on her song \"Cali Love\".[33]\n\nHotel California was released on April 9, 2013. The album featured guest appearances from Lil Wayne, Chris Brown, Rick Ross, 2 Chainz, Game, Wiz Khalifa, Future and Jadakiss. Along with production by Cool & Dre, David D.A. Doman, DJ Mustard, Detail, Mars of 1500 or Nothin', The Olympicks, and SAP among others. The album was supported by three official singles — \"Dope\" which features Rick Ross, \"For the Road\" featuring Chris Brown, and \"Show You\" featuring Future, along with the promotional single \"Molly\". The album was met with generally mixed reviews from music critics.[34] It also was less successful than his debut album commercially, debuting at number seven on the U.S. Billboard 200 with first-week sales of 54,000 copies in the United States.[35]\n\n2013–15: The Gold Album: 18th Dynasty\n\nOn August 27, 2013, Tyga released a new single with DJ Mustard, \"Throw It Up\". It was also revealed that he was working on two new mixtapes, Black Thought 3 and Well Done 4, as well as The Gold Album.[36] On October 21, 2013, Tyga premiered \"Wait for a Minute\" featuring Justin Bieber. It was released to iTunes the following day.[37] He then confirmed that an album would be released in early 2014. He also explained that the album would, be more \"way less commercial.\" He also said \"I felt like Hotel California was more commercial and I made more radio-type records. This album is straight rap.\"[38] Then on April 9, 2014 Tyga released a song called \"Hookah\" which features the rapper Young Thug.[39]\n\nOn May 1, 2014 Tyga made a tweet referring to Kanye West, Mike Dean, and his own producer Jess Jackson with a hash-tag The Gold Album. Kanye West is serving as the executive producer for the album, which is due for release on November 18, 2014.[40][41] Tyga was also featured on Chris Brown's single \"Loyal\", he was featured on the video version, the song since then peaked at number nine on the US Billboard Hot 100.[42] On May 28, 2014, Tyga released a new song entitled \"Real Deal\" via SoundCloud.[43] \"Real Deal\" was later released on iTunes on August 1, 2014.[44] On September 12, 2014 Tyga Announced via his instagram that his new single titled \"40 Mill\" which will be produced by Kanye West, Mike Dean, Dupri and his own producer Jess Jackson, artwork, The release date was not revealed though.[45] The album was set to have features from Justin Bieber, Young Thug, Kanye West, Chris Brown, and Drake. Tyga criticized Drake in an October 2014 interview, calling Drake \"fake\" and said that he did not like Nicki Minaj.[46] Tyga released the Kanye West produced 40 Mill on October 14, 2014; the media gave it positive feedback.\n\nOn October 21, 2014, Tyga lashed out on his record label Young Money Entertainment, reporting that his album was completed, but that his music was being \"held hostage\" by the label, who would not allow him to release it, and stated that he was considering leaking the album.[47] On December 4, 2014, Tyga made a tweet declaring his project, The Gold Album: 18th Dynasty would be released independently due to not being on good terms with label Cash Money Records.[48] In February 2015, Tyga released a collaborative album with Chris Brown, titled \"Fan of a Fan: The Album. Supported by the #21 peaking Billboard single \"Ayo\", the album peaked at #7 on the Billboard Hot 200 and featured guest appearances from 50 Cent, T.I., Pusha T, Wale, Ty Dolla Sign, Schoolboy Q, Boosie Badazz, and Fat Trel. On June 23, 2015, Tyga released The Gold Album for streaming exclusively on Spotify then later on Apple Music. The album became his worst selling album to date, selling roughly 2,000 units on its opening week.[49]\n\nHis reality show Kingin' with Tyga premiered on July 24, 2015, on MTV2.[50]\n\n2016–17: Signing to GOOD Music and BitchImTheShit2\n\nOn September 7, 2016, Kanye West announced that he had signed Tyga to his GOOD Music imprint, under the aegis of Def Jam Recordings.[51]\n\nOn July 17, 2017, it was announced that Tyga will join as a series regular in the third season of the VH1 slasher television series Scream. He starred in the role of Jamal Elliot.[52] The season premiered on July 8, 2019.[53]\n\nOn July 21, 2017, Tyga released his fifth studio album, BitchImTheShit2, the sequel to his 2011 mixtape #BitchImTheShit.\n\n2018–present: Kyoto, commercial resurgence and Legendary\n\nOn February 16, 2018, Tyga released his sixth studio album, Kyoto. The album was panned by critics and sold poorly, becoming his first album to fail to chart anywhere.[54][55][56]\n\nOn May 16, 2018, Tyga released the single \"Taste\" featuring Offset of Migos. The song was a hit, becoming one of the biggest songs of summer 2018 and peaking at number 8 on the US Billboard Hot 100. It marked Tyga's first entry on the Hot 100 in three years, since 2015's Ride Out, and is certified 4x platinum by the Recording Industry Association of America (RIAA).[57] The song is considered the catalyst for Tyga's return to the mainstream music spotlight after almost 5 years of poor sales and negative reviews, being considered his \"comeback\" record.[58][59][60]\n\nFollowing the success of Taste, Tyga released a number of other singles throughout the latter of 2018, beginning with \"Swish\", which was certified gold,[57] and later released Dip featuring Nicki Minaj, which was certified platinum.[57] He was also featured on Iggy Azalea’s gold single, \"Kream\".[57] Tyga's seventh album Legendary was released in June 2019.\n\nIn 2019, Tyga released the single \"Go Loko\" and stated, \"We wanted to do something different to kinda try to bring all Latins together\" and \"Even YG could tell you, he grew up around all Mexicans, so we really wanted to do something to give back to the culture.\"[61]\n\nPersonal life\n\nTyga met Blac Chyna on October 5, 2011, at The F.A.M.E Tour After Party with Chris Brown at King of Diamonds in Miami.[62][63] Blac Chyna became Tyga's leading lady in his \"Rack City\" music video.[64] They became an official couple on November 9, 2011 and posed for the cover of Urban Ink magazine in March 2012.[65] On October 16, 2012, their son King Cairo Stevenson was born;[66] and Tyga purchased a $6.5 million mansion in Calabasas, California for his new family.[67] Both parents sport tattoos of their son's name.[68] In December 2012, Blac Chyna confirmed that she and Tyga were engaged.[69] The couple split in 2014.[70]\n\nAfter months of speculation, Tyga finally confirmed his relationship with reality star Kylie Jenner. However, this relationship sparked controversy in the tabloids, because of the age difference, and they were reportedly dating since Jenner was 16. The legal age of consent in the state of California is 18.[71][72] Photos of him and Jenner first seen holding hands in Mexico went viral a few days after her 18th birthday.[73] The couple split in April 2017.[74]\n\nIn 2015, a nude photo of Tyga was leaked online. The photo was allegedly sent to transgender porn star Mia Isabella.[75]\n\nRobbery\n\nIn June 2008, Tyga was robbed of his jewelry by unknown assailants. A pair of diamond chains would end up in the hands of local rapper 40 Glocc, who showed them off in an online video.[76][77] Tyga would eventually admit to the robbery, but said 40 Glocc wasn't behind it. \"Some niggas seen me and ran up on me with a little burner... I guess 40 Glocc's peoples robbed the peoples that got me, and then hopped on YouTube, talking about they robbed me.\"[78]\n\nLegal issues\n\nIn late 2012, Tyga was sued by two women who appeared in the \"Make It Nasty\" video for $10 million each; they claimed he had shown their nipples without their consent. They were assured that this would be edited out and the unedited version would not be released, but Tyga proceeded to release a fully unedited version.[79] On September 21, 2013, another woman from the video sued Tyga for sexual battery, fraud, invasion of privacy, and infliction of emotional distress. She claims, like the two other women who have filed suit against him, that she was convinced to dance topless and assured her breasts would be edited out.[80]\n\nOn September 4, 2013, it was reported Tyga had been sued by Beverly Hills-based jeweler Jason for allegedly not paying for roughly $91,000 worth of jewelry. Jason claims that Tyga agreed to pay $28,275 for the jeweler's diamond pantheon watch in August 2012 and that he borrowed a $63,000 diamond Cuban link chain in December 2012 and never returned the item, so he sued Tyga for the cost of both pieces, plus late fees, which totaled up to $185,306.50 in damages, double the original total cost.[81] Tyga fell ill before the interrogation of this debt and was considered not able to proceed. He also did not bring the documents he was supposed to, however, he paid $100,000 of the $200,000 owed to his client.[82]\n\nIn June 2015, a judge ordered Tyga to pay an $80,000 settlement to a former landlord, who rented a home to the rapper in the city of Calabasas, California.[83] It was the second ruling in the case, following a judgement in May 2015, in which he was ordered to pay $90,000, though the debt was never paid.[84] In September 2015, the state of California placed a tax lien on Tyga for $19,000 in unpaid taxes.[85] On his birthday, he was given a lawsuit in 2016.[86]\n\nDiscography\n\nStudio albums\n\nCollaborative albums\n\nTours\n\nOpening act\n\nFilmography\n\nTelevision Year Title Role Notes 2019 Scream Jamal \"Jay\" Elliot Main role (Season 3)\n\nAwards and nominations", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Tyga_2013.jpg/150px-Tyga_2013.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Tyga_-_Openair_Frauenfeld_2019_02.jpg/220px-Tyga_-_Openair_Frauenfeld_2019_02.jpg", "http://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Tyga_-_Openair_Frauenfeld_2019_02.jpg/1200px-Tyga_-_Openair_Frauenfeld_2019_02.jpg", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Tyga_-_Openair_Frauenfeld_2019_02.jpg/1200px-Tyga_-_Openair_Frauenfeld_2019_02.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Tyga", "title": "Wikipedia", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.27", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Tyga_-_Openair_Frauenfeld_2019_02.jpg/1200px-Tyga_-_Openair_Frauenfeld_2019_02.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}