{"url": "https://en.wikipedia.org/wiki/Allison_Holker", "text": "Allison Renae Holker Boss (born February 6, 1988[1]) is an American dancer. Holker is credited with a wide variety of work in film, television, and concert tours. She is known from her appearances on the television dance competition So You Think You Can Dance, where she was a contestant in season 2 and an all-star in seasons 7–11 and 14.\n\nEarly life and education [ edit ]\n\nHolker was born in Anoka County, Minnesota, grew up in Orem, Utah, and graduated from Timpanogos High School in June 2006. Holker began her dance training at the age of nine when she enrolled as a student at The Dance Club in Orem. While there she began to specialize in contemporary, tap, ballet, and jazz, and performed in the opening and closing ceremonies of the 2002 Winter Olympics. Since then she has won numerous dance titles including her first National competition in Co DANCE in 2004 and as the National Senior Outstanding Dancer at the New York City Dance Alliance in 2005.\n\nCareer [ edit ]\n\nHolker performed with Earth, Wind and Fire at the opening and closing ceremonies at the Olympic Games in 2002, and in the Disney movies High School Musical and High School Musical 2. On television, she has been seen in various commercials and advanced to the Top 8 on the second season of So You Think You Can Dance, and danced in that season's SYTYCD nationwide tour. She performed with a show called \"Ballroom with a Twist,\" choreographed by Louis Van Amstel, and appeared with American Idol's Clay Aiken in his PBS special \"Tried and True\". Holker was featured in the \"Jar of Hearts\" music video by Christina Perri. In September/October 2011 Holker was one of Demi Lovato's backup-dancers. Holker has taught at different dance conventions and workshops across the country, also branching out into choreography.[2] Holker was a backup-dancer on The X Factor USA working together with Brian Friedman. On April 30, 2013, she performed a dance routine on Dancing with the Stars with Stephen \"tWitch\" Boss. They danced to Crystallize, which was being performed live by Lindsey Stirling.[3]\n\nDancing with the Stars [ edit ]\n\nIn August 2014, Holker was announced as one of the 12 professional dancers on the 19th season of Dancing with the Stars.[4] The announcement of Holker, a contemporary dancer, as a cast member was met with controversy due to her limited experience with dancing and teaching Latin Ballroom dance.[citation needed] She partnered with Mean Girls actor Jonathan Bennett.[5] The couple was eliminated on Week 6, finishing in 9th place. On February 11, 2015, Holker was partnered with R5 singer and actor Riker Lynch in the show's 20th season.[6] The couple made it to the finals and finished in second place. For season 21 she was paired with singer Andy Grammer.[7] They were eliminated on Week 8 and finished in 7th place. She didn't appear in season 22 due to pregnancy. Holker returned for season 23 and was partnered with singer-songwriter Kenneth \"Babyface\" Edmonds. The couple were eliminated on Week 4 and finished in 11th place.\n\nDancing with the Stars performances [ edit ]\n\nSeason average: 28.7\n\n1Score given by guest judge Kevin Hart in place of Goodman.\n\n2The American public scored the dance in place of Goodman with the averaged score being counted alongside the three other judges.\n\n3This week only, for \"Partner Switch-Up\" week, Bennett performed with Peta Murgatroyd instead of Holker. Holker performed with Antonio Sabàto, Jr.\n\n4Score given by guest judge Jessie J in place of Goodman.\n\n5Score given by guest judge Pitbull in place of Goodman.\n\nSeason average: 37.3\n\nSeason average: 23.88\n\n1 Score given by guest judge Alfonso Ribeiro.\n\n2 This week only, for \"Partner Switch-Up\" week, Grammer performed with Sharna Burgess instead of Holker. Holker performed with Hayes Grier.[8]\n\n3 Score given by guest judge Maksim Chmerkovskiy.\n\n4 Score given by guest judge Olivia Newton-John.\n\nWith celebrity partner: Babyface [ edit ]\n\nSeason average: 26.3\n\nPersonal life [ edit ]\n\nOn May 26, 2008, Holker had a daughter, Weslie Renae, with an ex-fiancé.[1]\n\nOn December 10, 2013, Holker and fellow So You Think You Can Dance all-star, Stephen \"tWitch\" Boss, were married at Villa San-Juliette Winery in Paso Robles, California, owned by So You Think You Can Dance producer and judge Nigel Lythgoe.[9]\n\nOn March 27, 2016, they welcomed a son, Maddox.[10][11] The couple announced they were expecting their second child together in May 2019, [12] and she gave birth to their daughter, Zaia, on November 6, 2019.[13]\n\nAwards [ edit ]\n\n2004, National Senior Performer of the Year from Company Dance\n\n2005, National Senior Outstanding Dancing for New York City Dance Alliance\n\n2007, National Senior Dancer of the Year\n\n2013, Primetime Emmy Award Nomination for Outstanding Choreography", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Allison_Holker", "title": "Allison Holker", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}