{"url": "https://www.thedailybeast.com/the-real-bling-ring-where-are-they-now", "text": "Sofia Coppola’s upcoming movie, Bling Ring, is based on a real group of teens and 20-something friends and acquaintances who began robbing the rich and famous in 2008. Over the course of the following year, they stole from Orlando Bloom, Audrina Patridge, Lindsay Lohan, Rachel Bilson, Brian Austin Green, and Megan Fox, and raided Paris Hilton’s house five (!) times (She helpfully left a key under the mat.)\n\nBefore they were busted, the group snagged $3 million in loot, including $2 million worth of jewelry from the Hilton fortune heiress, stole Rolex watches and Louis Vuitton luggage from Bloom, and essentially went shopping in Partridge’s designer-laden pad. All members of the crew have since seen their day in court. A few members of the real-life Bling Ring have had a more illustrious postscript than others.\n\nAlexis Neiers\n\nThough she wasn’t the ringleader or the brainchild behind the burgling posse, Neiers, by virtue of very bad/good timing, had already filmed a pilot for a reality show when she was busted, thus ensuring the E! program about her acting aspirations, Pretty Wild, would instead document the unfurling of her case in real time. In the Coppola film, a character based on her (named Nicki), is played by Emma Watson.\n\nSentence: Pled no contest to felony burglary charges involving actor Orlando Bloom’s house. Sentenced to 180 days in jail; served 30 days with three years probation and $600,000 restitution to Bloom.\n\nPostscript: The most public member of the Bling Ring, Neiers, now 21, documents her life on her blog and her Twitter account. While she’s currently living a happy life, it’s been a long road. She just gave birth to a baby girl, Harper, and is married to Evan Haines, whom she met while attending Alcoholics Anonymous meetings. But prior to that, she had been arrested for possession of black tar heroin, and was ordered to spend a year in residential rehab.\n\nSince cleaning up, she’s been vocal about her skepticism of Coppola’s movie. She wrote on her blog: “This obsession is what makes the Bling Ring so prevalent almost 5 years after the initial robbery took place and it is because, I believe, that a majority of society is just as sick as these teens were. We are obsessed, I believe because we want an inside look into the real life of these celebrities and we enjoy publicly scrutinizing people because they “sin” differently then we do. It is a method of distracting us from having to look at our own actions and sick behavioral patterns. The story of teens robing [sic] the homes of celebrities is artificial and has no real depth and substance and I can only hope that Ms. Coppola decides to shed light to this truth.”\n\nNick Prugo\n\nNick Prugo had apparently never watched an episode of Law & Order. If he had, he would know the golden rule of being interviewed by the police: ask for a lawyer and say nothing. But when the cops picked him up, a nervous and scared Prugo talked and talked and talked some more. Officer Brett Goodkin, the lead investigator, told Vanity Fair, “He confessed to crimes we didn’t even know he committed.” The former actor even went on the talk-show circuit, giving an interview to Good Morning America. And Prugo told Vanity Fair that one of the reasons they started robbing luxury vehicles was to fuel his then cocaine habit.\n\nSentence: Pleaded no contest to two counts of first-degree residential burglary involving break-ins at the homes of Lindsay Lohan and Audrina Patridge and sentenced to time served (365 days in jail).\n\nPostscript: Prugo was released from jail on April 15, just in time for the movie’s release. However, he seems to have learned his lesson about talking too much. When we reached him on Facebook, he amiably told us he couldn’t speak about the case at this time.\n\nJonathan Ajar, a.k.a. “Jonnie Dangerous”\n\nHe was depicted as the “fence”—or the person taxed with selling all the ill-gotten goods for cold, hard cash. But Ajar was technically not part of the D.A.’s official “Bling Ring” case and was charged separately. Then 27, he also had a prior record (including a conviction for attempting to sell cocaine), and had served 37 months in federal prison. Prior to getting busted, Dangerous promoted parties at trendy Hollywood hotspots like Les Deux, and lived large: selling, by his own admission, according to a Maxim magazine article, a pound of weed a week and moving coke, that is—when he wasn’t hanging with Playboy playmates and cruising around L.A. in a Lincoln Navigator. He dated another Bling Ringer, Courtney Leigh Ames, which is how he met the rest of the crew.\n\nSentence: Pleaded no contest to possession of cocaine for sale, possession of a firearm by a convicted felon, and one count of receiving stolen property from the Bling Ring haul. He was sentenced in 2010 to three years. He’s been out of the joint since March 2011.\n\nPostscript: According to his Instagram and Facebook feed, Ajar is still living large. His Instagram is filled with pictures of Louis Vuitton bling, stacks of cash, Chronic, and Cadillacs. Now a resident of Hawthorne, he’s been keeping busy: dining out on scrumptious meals at Mastro’s in Beverly Hills (hashtag: “livinglikerapperssaytheydo”); picking up a pair of Rolex watches from the jeweler; and partying late night with aspiring rapper Daimyo Johnson (caption: “Birthday party 4:20am got $60,000 racks in #don’tknowwhattimeitis Hahahahaha fucking partying…#rockstar”).\n\nWhen contacted by The Daily Beast on Facebook, Ajar wrote, “I know intimately everything that happened. If your main source is court docs and snitch statements, you have to understand most of that is not very credible. Also Det. Goodkin [Brett Goodkin] is under investigation now for multiple offenses, in regards to this case. Hopefully he will loose [sic] his job. He is the one that Sofia Coppola chose to be her source, honestly I laugh a little inside every time I here [sic] that.”\n\nHe ultimately declined to be interviewed.\n\nDiana Tamayo\n\nClass president at Indian Hills and voted by her high schoolmates as having the “Best Smile,” Tamayo didn’t have much smile about. She’d already been busted shoplifting with Rachel Lee, and would hang with Courtney Ames before joining in the Bling Ring’s fun. Her primary asset to the group was her size—she reportedly was small enough to crawl through dog doors to get inside the houses.\n\nSentence: Pled no contest to residential burglary for robbing Lohan. Sentenced to three years probation and 60 days of community service and time already served.\n\nPostscript: When reached by The Daily Beast via text on her cell phone, she wrote, “Hi, I have chosen not to talk to any media because I want that to be in my past. But I will say that my life has changed. I’ve found God and starting to get my career with fitness and nutrition going. Thank you, have a beautiful day.”\n\nRachel Jungeon Lee\n\nFingered by Prugo as the ringleader, Lee went to high school with Prugo at Indian Hills where she was voted “Best Dressed.” Subsequently portrayed in the media as the one who was most motivated to rob the houses, the daughter of two North Korean immigrants was painted by Prugo and the press as being obsessed with celebrity in general and reality stars in particular. Lee was reportedly enamored of the clothing and lifestyle of stars regularly seen on the In Touch Weekly magazine circuit. She had already had a prior history of theft—having been fined and put on probation when she and fellow future Bling Ringer Diane Tamayo were busted for shoplifting from Sephora. While the others were panicked during the robberies, Lee was depicted by Prugo as being cool, calm, and collected, and indicated that she even cherry-picked some art to decorate her apartment. (During one of the robberies, it was reported that she was so at ease that she took time to defecate in a bathroom belonging to one victim.) She was living in Las Vegas when the ring was broken up. A character based on Lee is played by Katie Chang in the movie.\n\nSentence: Plead no contest and sentenced to four years in state prison—the longest sentence of all—for robbing Patridge’s home. Served two years and was paroled on March 28, 2013.\n\nPostscript: Whereabouts unknown. In 2011, Wendy Feldman, the prison coach for Lee, told FOX411’s Pop Tarts column, “It has been a stressful two years waiting for her day in court, but Rachel has gotten lots of therapy, she’s gotten clean and sober and become much closer to her mom. She has taken full responsibility for her actions. Her attitude is that she is very much ready to go to prison and face the consequences.”\n\nCourtney Leigh Ames\n\nThe former girlfriend of Ajar, Ames was also friends with Roy Lopez, the other alleged “fence,” and buddies with Lee. During the trial, Ames grabbed headlines for her “duh” moment—wearing a necklace that apparently belonged to Lindsay Lohan to court, nabbing her another charge.\n\nSentence: Pled no contest to receiving a jacket stolen from Paris Hilton. Sentenced to three years probation and 60 days of community service. Like Tamayo and Lopez Jr., Ames got a light sentence when it was discovered that Brett Goodkin, an investigator in the case, had allegedly consulted on Coppola’s movie without getting clearance from his superiors. According to the Los Angeles Times, the judge said in court, “You should all write a thank-you letter to Goodkin, because his judgment is as poor as it gets. You can have a field day with his credibility during trial ... It’s a shame what he did. It’s harmful to the people’s case.”\n\nPostscript: Whereabouts unknown.\n\nRoy Lopez, Jr.\n\nRoped in by Courtney Ames with whom he worked at a restaurant in Calabasas, Lopez is the one who grabbed the most loot—a cool $2 million of Paris Hilton’s jewelry (all later returned). But when he couldn’t sell it, the group turned to Ajar, who supposedly had better connections.\n\nSentence: Pled no contest to receiving stolen property. Sentenced to three years probation and was given credit for the 100 days he had already served in jail.\n\nPostscript: Whereabouts unknown.", "images": ["https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1439,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1492784494/articles/2013/05/21/the-real-bling-ring-where-are-they-now/130520-blingring-tease_stjybi", "https://img.thedailybeast.com/image/upload/v1550872986/White2x_hcwpd6.png", "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1439,w_2560,x_0,y_0/dpr_1.5/c_limit,w_1044/fl_lossy,q_auto/v1492784494/articles/2013/05/21/the-real-bling-ring-where-are-they-now/130520-blingring-tease_stjybi", "https://img.thedailybeast.com/image/upload/c_fill,h_200,w_200,x_0,y_0/v1492189328/author/author-photo---tricia-romano.jpg", "https://img.thedailybeast.com/image/upload/v1549916286/logo_km2qs4.png"], "top_img": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1439,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1492784494/articles/2013/05/21/the-real-bling-ring-where-are-they-now/130520-blingring-tease_stjybi", "keywords": [], "authors": ["Tricia Romano"], "canonical_link": "https://www.thedailybeast.com/the-real-bling-ring-where-are-they-now", "title": "The Real Bling Ring: Where Are They Now?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "title": "The Real Bling Ring: Where Are They Now?", "keywords": "Burglary, Sofia Coppola", "og": {"title": "The Real Bling Ring: Where Are They Now?", "description": "Tricia Romano tracks down the members of the real-life Bling Ring, the basis for Sofia Coppola’s film.", "url": "https://www.thedailybeast.com/articles/2013/05/21/the-real-bling-ring-where-are-they-now", "site_name": "The Daily Beast", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1439,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1492784494/articles/2013/05/21/the-real-bling-ring-where-are-they-now/130520-blingring-tease_stjybi"}, "description": "Tricia Romano tracks down the members of the real-life Bling Ring, the basis for Sofia Coppola’s film.", "authors": "Tricia Romano", "wrap": "/content/dailybeast/entertainment", "article": {"section": "entertainment", "published_time": "2013-05-21T08:45:00.000Z", "author": "https://www.thedailybeast.com/authors/tricia-romano"}, "fb": {"app_id": 189930913679}, "twitter": {"card": "summary_large_image", "site": "@thedailybeast", "creator": "@tromano", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1439,w_2560,x_0,y_0/dpr_2.0/c_limit,w_600/f_jpg/fl_lossy,q_auto/v1492784494/articles/2013/05/21/the-real-bling-ring-where-are-they-now/130520-blingring-tease_stjybi"}, "sailthru.date": "2013-05-21T08:45:00.000Z", "sailthru.expire_date": "2013-06-04T08:45:00.000Z", "publicationDate": 201305210845, "parsely-page": "{\"author\":\"Tricia Romano\",\"link\":\"https://www.thedailybeast.com/the-real-bling-ring-where-are-they-now\",\"metadata\":{\"articleType\":\"article\",\"rubric\":\"Hollywood Stories\"},\"post_id\":\"articles/2013/05/21/the-real-bling-ring-where-are-they-now\",\"pub_date\":\"2013-05-21T08:45:00+00:00\",\"section\":\"Entertainment\",\"tags\":[\"Burglary\",\"Sofia Coppola\",\"typeArticle\"],\"title\":\"The Real Bling Ring: Where Are They Now?\",\"type\":\"post\"}"}, "movies": [], "publish_date": 1369125900.0, "source": "https://www.thedailybeast.com", "summary": ""}