{"url": "https://www.billboard.com/articles/news/bbma/8456969/2018-billboard-music-awards-moments-not-on-tv", "text": "BBMAS 31 Things You Didn't See on TV at the 2018 Billboard Music Awards\n\nBetween Janet Jackson's iconic performance, BTS turning up the volume with \"Fake Love\" and Kelly Clarkson's triple-threat hosting gig, did Sunday's action-packed Billboard Music Awards leave you wanting more? You've come to the right place, because the Billboard team was outside, inside, backstage and everywhere in between at Las Vegas' MGM Grand Garden Arena on Sunday night, and we couldn't possibly catch it all in just three hours of television.\n\nBelow, find all the many moments you didn't see on TV, from Taylor Swift colliding with BTS to Shawn Mendes representing for the \"Youth.\"\n\n2 p.m.: The red carpet officially opens, but the fans have been outside the MGM Grand Garden Arena for hours, breaking out in ear-piercing \"BTS!\" chants that can be heard for blocks down the Las Vegas Strip.\n\n3:20 p.m.: Dua Lipa greets Billboard host Keith Caulfield and the two chat about their first meeting, when Dua was a guest on the Billboard Pop Shop Podcast in February 2017, months before the release of her breakout single \"New Rules.\"\n\n3:26 p.m.: After Shawn Mendes finishes up chatting with Billboard, he runs into Dua Lipa on the red carpet and they share a huge hug.\n\n5:23 p.m.: Luis Fonsi is the first star to hit the Billboard portrait lounge backstage, after accepting the top Hot 100 song award for his megahit \"Despacito.\"\n\nWho guessed the special guest? #BBMAs A post shared by Billboard (@billboard) on May 20, 2018 at 5:28pm PDT\n\n5:46 p.m.: Khalid pops backstage to take a photo in the Billboard portrait lounge, minutes after his show-stopping \"Love Lies\" performance with Normani and after winning the first prize of the night, top new artist.\n\n6:38 p.m.: T.I. greets everyone he passes backstage after presenting top rap song to Post Malone and 21 Savage for \"Rock Star.\"\n\n6:49 p.m.: Post Malone and 21 Savage are all smiles taking backstage pics with their top rap song trophy.\n\n6:55 p.m.: The Chainsmokers and Khalid exchange congratulations for their BBMA wins backstage.\n\n6:58 p.m.: The Chainsmokers hand off their placeholder trophies to press room handlers after taking pics backstage and change them out for cocktails.\n\n6:59 p.m.: Shawn Mendes takes photos in the Billboard portrait studio wearing one of the YOUTH hooded sweatshirts worn by the Stoneman Douglas show choir onstage. Before that, Mendes and Khalid insisted that photographers wait for the full show choir to join them in the backstage photo room before taking any pics of the duo.\n\n7:02 p.m.: Everyone backstage turns their full attention to Janet Jackson's dance spectacle, as a hush comes over the chaotic room.\n\n7:10 p.m.: Taylor Swift sends the photo room into a frenzy when she comes backstage to take pics with her pair of new trophies.\n\n7:15 p.m.: Maren Morris shares a sweet backstage moment with her new husband Ryan Hurd after her confetti-drenched performance of \"The Middle\" with Zedd and Grey.\n\n7:18 p.m.: Morris hums along to Kesha's \"Good Old Days\" chorus backstage during the singer's T-Mobile Arena performance with Macklemore.\n\nWhat did you think of @MarenMorris’ performance of “The Middle” with Zedd and Grey? #BBMAs pic.twitter.com/uhflQvTavJ — billboard (@billboard) May 21, 2018\n\n8:19 p.m.: When Billboard's Keith Caulfield greets Salt-N-Pepa backstage with the opening line to \"Push It\" -- \"Salt-N-Pepa's here!\" -- they break into song, rapping the rest of the lyric.", "images": ["https://static.billboard.com/files/2020/04/Billie-Eilish-Where-Do-We-Go-World-Tour-Kick-Off-Miami-2020-billboard-1548-1587151378-compressed.jpg", "https://static.billboard.com/files/2020/03/radio-city-music-hall-covid19-2020-billboard-1500x845-1584562361-compressed.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://static.billboard.com/files/2020/04/miley-cyrus-april-2019-uu-billboard-z-1548-1585925327-compressed.jpg", "https://static.billboard.com/files/2020/03/7cover_Coronavirus_Touring_WEB-1585231399-220x286.jpg", "https://static.billboard.com/files/2020/03/GettyImages-1144319419-1583448877-compressed.jpg", "https://static.billboard.com/files/media/bts-the-chainsmokers-bbmas-roaming-show-2018-billboard-1548-1024x677.jpg", "https://static.billboard.com/files/media/2018-BBMAs-recirc.png", "https://www.billboard.com/assets/1586539892/images/Billboard-white.svg?c596412deda54d9a807d"], "top_img": "https://static.billboard.com/files/media/bts-the-chainsmokers-bbmas-roaming-show-2018-billboard-1548-1024x677.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.billboard.com/articles/news/bbma/8456969/2018-billboard-music-awards-moments-not-on-tv", "title": "31 Things You Didn't See on TV at the 2018 Billboard Music Awards", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2018-05-21T15:11:56-04:00", "published_time": "2018-05-20T23:29:55-04:00"}, "description": "Between Janet Jackson's iconic performance, BTS turning up the volume with \"Fake Love\" and Kelly Clarkson's triple-threat hosting gig, did Sunday's action-packed Billboard Music Awards leave you wanting more?", "og": {"description": "Between Janet Jackson's iconic performance, BTS turning up the volume with \"Fake Love\" and Kelly Clarkson's triple-threat hosting gig, did Sunday's action-packed Billboard Music Awards leave you wanting more?", "image": {"identifier": "https://static.billboard.com/files/media/bts-the-chainsmokers-bbmas-roaming-show-2018-billboard-1548-1024x677.jpg", "height": 677, "width": 1024}, "title": "Billboard Music Awards 2018: 31 Things You Didn't See on TV | Billboard", "type": "article", "url": "http://www.billboard.com/articles/news/bbma/8456969/2018-billboard-music-awards-moments-not-on-tv", "site_name": "Billboard"}, "title": "31 Things You Didn't See on TV at the 2018 Billboard Music Awards", "twitter": {"card": "summary_large_image", "description": "Between Janet Jackson's iconic performance, BTS turning up the volume with \"Fake Love\" and Kelly Clarkson's triple-threat hosting gig, did Sunday's action-packed Billboard Music Awards leave you wanting more?", "image": "https://static.billboard.com/files/media/bts-the-chainsmokers-bbmas-roaming-show-2018-billboard-1548-1024x677.jpg", "title": "31 Things You Didn't See on TV at the 2018 Billboard Music Awards", "site": "@billboard"}}, "movies": [], "publish_date": 1526873395.0, "source": "https://www.billboard.com", "summary": ""}