{"url": "https://www.ncaa.com/news/basketball-men/article/2018-10-26/tennessees-grant-williams-wins-march-madness-preseason", "text": "The player of the year race is as wide open as the sport has recently seen.\n\nWant to go with experience, a freshman, a player from a non-power league? You won’t be wrong — now. There are no poor answers within reason.\n\nBut we put forth our own 16-player bracket two weeks ago and asked fans to decide. The winner? Tennessee’s Grant Williams, who beat Indiana’s Juwan Morgan in the final vote.\n\nIn his sophomore campaign last season, Williams averaged 15.2 points, 6 rebounds, and 1.3 blocks, earning him SEC Player of the Year honors on a Tennessee team that went 26-9 overall and finished in first place in the conference with a 13-5 record.\n\nTennessee returns all five starters this season, and all six of its leading scorers, so Williams will have plenty of help as he tries to get Tennessee past the Sweet 16 for the first time since 2014.\n\nSixteen student-athletes qualified for our tournament of preseason player of the year candidates, seeded No. 1 through No. 16, in a four-round, single-elimination format. Voting was conducted on the @MarchMadness Twitter account and Instagram account beginning Monday, Oct. 15. The student-athlete with more fan votes in each matchup advanced to the next round.\n\nBelow are the results from each round of voting. Numbers at the end indicate vote percentage on Twitter:\n\nFinals results:\n\n(13) Grant Williams def. (15) Juwan Morgan (57-43)\n\nSemifinals results:\n\n(13) Grant Williams def. (1) Carsen Edwards (55-45)\n\n(15) Juwan Morgan def. (3) Ethan Happ (52-48)\n\nSecond round results:\n\n(1) Carsen Edwards def. (8) Caleb Martin (66-34)\n\n(13) Grant Williams def. (5) Luke Maye (54-46)\n\n(15) Juwan Morgan def. (7) Kyle Guy (56-44)\n\n(3) Ethan Happ def. (6) Dedric Lawson (54-46)\n\nFirst round results:\n\n(1) Carsen Edwards def. (16) Mike Daum (68-32)\n\n(15) Juwan Morgan def. (2) Zion Williamson (62-38)\n\n(3) Ethan Happ def. (14) Jordan Murphy (70-30)\n\n(13) Grant Williams def. (4) R.J. Barrett (66-34)\n\n(5) Luke Maye def. (12) Markus Howard (68-32)\n\n(6) Dedric Lawson def. (11) Shamorie Ponds (57-43)\n\n(7) Kyle Guy def. (10) Tyus Battle (53-47)\n\n(8) Caleb Martin def. (9) Rui Hachimura (54-46)\n\nHere are my 1-16 rankings:\n\nPreseason All-Americans (seed)\n\n(1) Carsen Edwards, Jr., G, Purdue: Should average nearly 20 points a game and be the reason the Boilermakers are in the mix in the Big Ten — making him a favorite for national player of the year.\n\n3-pointer by Carsen Edwards\n\n(2) Zion Williamson, Fr., F, Duke: Williamson is a physical specimen that will dominate his position and be must-see every time out.\n\n\n\n(3) Ethan Happ, Sr., F, Wisconsin: Happ has maximized everything out of his career and will lead the Badgers back to the NCAA tournament.\n\nRELATED: Preseason Power 36 rankings\n\n\n\n(4) R.J. Barrett, Fr., F, Duke: Barrett will provide a bookend to Williamson as the pair has the potential to average in the high teens every game.\n\n\n\n(5) Luke Maye, Sr., F, North Carolina: Few players in the country have improved as much as Maye has in his career. He is the anchor for a team that could make a play for the title.\n\nMORE: College basketball's 5 best returning scorers\n\n(6) Dedric Lawson, Jr., F, Kansas: The Memphis transfer could/should be the Big 12 player of the year and as a result be in contention for national honors, leading the Jayhawks to a possible top seed.\n\n(7) Kyle Guy, Jr., G, Virginia: Guy is determined to erase the memory of the UMBC loss by taking the Cavs back to the top of the ACC. Guy has become one of the more reliable shooters under Tony Bennett.\n\n(8) Caleb Martin, F, Sr., Nevada: Martin came back instead of staying in the NBA draft to join the most talented Wolf Pack roster ever. He has a chance to create a legacy with a trip to the Final Four.\n\n3-pointer by Caleb Martin\n\n(9) Rui Hachimura, Jr., F, Gonzaga: Hachimura has improved mightily in each season. He continues to embrace the role of being a go-to player on a roster that should make a run for the title.\n\n(10) Tyus Battle, G, Jr., Syracuse: Battle flirted with staying in the NBA draft but he returns to lead the Orange a few steps further than the Sweet 16 last season. His numbers climbed during the season and he should be one of the more consistent scorers in the ACC.\n\n(11) Shamarie Ponds, Jr., G, St. John’s: Ponds enters the season as one of the favorites for Big East player of the year. He is a must-watch guard who will have MSG rocking this season as the Red Storm rise toward an NCAA bid.\n\nMORE: How do the preseason top 25 fare in March Madness?\n\n(12) Markus Howard, Jr., G, Marquette: Howard put up 52 in a road game at Providence. He could be one of the top scorers in the country. He’ll battle with Ponds for Big East player of the year and lead the Golden Eagles back to the NCAAs.\n\nMarquette's Markus Howard talks with Andy Katz\n\n(13) Grant Williams, Jr., F, Tennessee: The SEC player of the year has a shot to go back-to-back as the best in the league with the top team in the conference. The Vols and Williams will compete for both throughout the season.\n\n(14) Jordan Murphy, Sr., F, Minnesota: Murphy is a double-double machine, averaging over 16 and 11 each night out. Expect those numbers to rise as will the Gophers’ win total toward an NCAA bid.\n\n(15) Juwan Morgan, Sr., F, Indiana: Morgan has a high-profile co-star in freshman Romeo Langford. But Morgan will hold his own as a possible Big Ten player of the year candidate and one of the reasons the Hoosiers will thrive.\n\nRELATED: Big Ten predictions, power rankings\n\n(16) Mike Daum, Sr., F, South Dakota State: The Jackrabbits could lead the country in scoring. He’s a likely lock to score at least 20 a game. And the Jackrabbits are due for a win in the NCAA tournament.", "images": ["https://www.ncaa.com", "https://www.ncaa.com/modules/custom/casablanca_social/modules/casablanca_social_hanger/img/social-facebook.svg", "https://www.ncaa.com/sites/default/files/public/styles/large_16x9/public-s3/images/2018-10-26/Grant-Williams.jpg?itok=BFBPmaUG", "https://www.ncaa.com/sites/default/files/public/video/thumbnails/legacy/2018/03/23/9CBF01A0-6F14-4F17-B10C-763AFA07DDE7_0-jpg-2008770.1280x720.jpg", "https://i.cdn.turner.com/cnn/.e/img/3.0/global/misc/logo_ad_choices_footer.png", "https://www.ncaa.com/modules/custom/casablanca_core/img/sportbanners/basketball-men.svg", "https://www.ncaa.com/sites/default/files/public/video/thumbnails/legacy/2018/03/24/B0141B9A-D0B8-4E95-AFB9-C3681A996E7B_0-jpg-2011886.1280x720.jpg", "https://www.ncaa.com/modules/custom/casablanca_social/modules/casablanca_social_hanger/img/social-twitter.svg"], "top_img": "https://www.ncaa.com/sites/default/files/public/styles/large_16x9/public-s3/images/2018-10-26/Grant-Williams.jpg?itok=BFBPmaUG", "keywords": [], "authors": [], "canonical_link": "https://www.ncaa.com/news/basketball-men/article/2018-10-26/tennessees-grant-williams-wins-march-madness-preseason", "title": "Tennessee's Grant Williams wins March Madness' Preseason Player of the Year", "meta_data": {"Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0", "description": "We started with 16 candidates, and in the final matchup, the fans chose Williams over Indiana's Juwan Morgan.", "title": "3-pointer by Caleb Martin | NCAA.com", "url": "https://www.ncaa.com/news/basketball-men/article/2018-10-26/tennessees-grant-williams-wins-march-madness-preseason", "image": "https://www.ncaa.com/sites/default/files/public/styles/large_16x9/public-s3/images/2018-10-26/Grant-Williams.jpg?itok=BFBPmaUG", "og": {"image": "https://www.ncaa.com/sites/default/files/public/styles/large_16x9/public-s3/images/2018-10-26/Grant-Williams.jpg?itok=BFBPmaUG", "title": "Tennessee's Grant Williams wins March Madness' Preseason Player of the Year", "description": "We started with 16 candidates, and in the final matchup, the fans chose Williams over Indiana's Juwan Morgan.", "url": "https://www.ncaa.com/news/basketball-men/article/2018-10-26/tennessees-grant-williams-wins-march-madness-preseason", "type": "article"}, "twitter": {"image": "https://www.ncaa.com/sites/default/files/public/styles/large_16x9/public-s3/images/2018-10-26/Grant-Williams.jpg?itok=BFBPmaUG", "title": "Tennessee's Grant Williams wins March Madness' Preseason Player of the Year", "description": "We started with 16 candidates, and in the final matchup, the fans chose Williams over Indiana's Juwan Morgan.", "url": "https://www.ncaa.com/news/basketball-men/article/2018-10-26/tennessees-grant-williams-wins-march-madness-preseason", "site": {"identifier": "@NCAA", "id": 31122496}, "card": "summary_large_image"}, "msapplication-TileColor": "#da532c", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1540483200.0, "source": "https://www.ncaa.com", "summary": ""}