{"url": "https://www.etonline.com/this-is-us-revelations-jacks-mystery-woman-miguel-and-rebeccas-romance-tess-secret-114281", "text": "It's time to celebrate Randall's favorite holiday!\n\nOn Tuesday's episode of This Is Us, titled \"Six Thanksgivings,\" the Pearsons' story spanned six different Thanksgiving dinners across several decades -- from the Vietnam War to the present day to various turkey meals from the past. While this year's family get-together at Randall's home was anything but traditional, we still learned quite a bit about our favorite TV family.\n\nSo what were the biggest revelations from the latest episode? Three major developments surfaced from the hour that may play into the rest of the season in a very meaningful way.\n\n1. The story behind Jack's mystery woman is revealed.\n\nNBC\n\nWe all presumed -- as did Kevin -- that the frayed photograph of Jack (Milo Ventimiglia) with the Vietnamese woman, who was wearing Jack's prized necklace, meant they had an intimate relationship of some sort. Did they forge something close to a friendship? Were they romantic? Did she have any relation to the mysterious \"her\" referenced in the distant future? It turns out, she was none of that. Instead, they were merely acquaintances. But how did an acquaintance make such an impact on Jack's life?\n\nDuring a makeshift Thanksgiving meal in Vietnam, Jack -- noticing the woman struggling with two heavy pails of water -- walks over to help her carry them to her shack, glaring at Nicky (Michael Angarano), who was in prime position to help, for not assisting her. A fellow soldier, who happened to have a camera in hand, snaps the picture that Kevin would receive decades later. At first, any theories suggesting any hint of romance between Jack and the woman were still in play.\n\nNoticing that she hasn't been catching any fish lately, Jack packs a turkey meal from the squad's leftovers for her and her family, and it's when he visits her home that he learns just how dire the condition of her son -- who had cut his foot on the barbwire fence -- is. After Nicky refuses to treat her (he later tells a story about a friend who trusted an older woman, only to die because she was an enemy informant), Jack furiously attempts to sterilize her son's infected cut. He successfully does so and as he is leaving, she gives him the necklace.\n\n2. The origins of Miguel and Rebecca's romance comes out.\n\nNBC\n\nWe learned last season that Miguel (Jon Huertas) and Rebecca (Mandy Moore) reconnected over Facebook, several years after Jack's death, but we never got a firm timeline. Tuesday's episode changed all that. During a conversation at the Thanksgiving dinner table with Miguel and his two grown children, he revealed -- after his son, who is a piece of work, had a snarky comeback about Miguel and Rebecca's marriage -- that they didn't become romantically involved until 10 years after Jack's death and after his ex, Shelly, remarried.\n\n\"First you steal my father from my mother and now you're trying to kill my brother-in-law,\" Miguel's son snarls. \"Sorry? Too soon.\" Oof.\n\n\"No, not too soon actually. After your mother and I split, I promised my best friend and myself that I would fight to keep you guys in my life and for a long time, I tried. I called every day, I sent Christmas gifts, I tried to plan things and I was lucky if I got an email back from you. So, after a while, I gave up,\" Miguel says. \"In heartbreak, 10 years after her husband and my best friend died, and your mother had remarried, Rebecca and I found each other and we filled a hole in each other's lives. You don't have to be happy for us but we're not going to apologize for being together. So take all the shots at me that you want to... But the one time a decade you see Rebecca, you show my wife some respect.\"\n\nPreach, Miguel, preach.\n\n3. Tess is hiding a big secret.\n\nNBC\n\nWith Randall, Beth, Annie and Deja out to serve a Thanksgiving meal to the less fortunate, Tess (Eris Baker) stays behind after saying she wasn't feeling very good. Turns out, she was experiencing her first period. After Toby (Chris Sullivan) accidentally walks in on her trying to figure out what to do about it, Kate (Chrissy Metz) shows her maternal side, teaching the older Pearson daughter what to do when that time of the month comes. But that turned out not to be the only thing Tess was going through.\n\nWhen Kate sweetly tells Tess that she can come to her for anything, that's when Tess shares a secret she hasn't told anyone. \"I know you have a mom, but if there's anything you ever want to talk to me about, any time. Pretty soon you're going to have your first kiss and your first boyfriend...,\" Kate says.\n\n\"Or... girlfriend,\" Tess says, catching Kate off guard. \"Or girlfriend,\" Kate replies. Later, when the two go downstairs to continue the Thanksgiving meal prep, Tess makes one request of her aunt: \"Don't tell mom and dad about... you know.\" \"I won't,\" Kate promises. \"But Tess, your parents are going to love you no matter what. So you should tell them.\" Will she -- and does it have anything to do with \"her\"?\n\nThis Is Us airs Tuesdays at 9 p.m. ET/PT on NBC.\n\nRELATED CONTENT:\n\nChrissy Metz Talks Kate's Challenging, But 'Relatable' 'This Is Us' Pregnancy Journey (Exclusive)\n\n'This Is Us' Newcomer Michael Angarano Warns Nicky's Death Is 'Tragic' (Exclusive)\n\n'This Is Us' Sneak Peek: Kevin Can't Stop Obsessing Over Jack's Mystery Woman (Exclusive)\n\n'This Is Us': How Mandy Moore's Joni Mitchell-Inspired Song Was Made This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRelated Gallery", "images": ["https://www.etonline.com/themes/custom/et/img/watch-now.png", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-11/tiu_main.jpg?h=1addfb6e&itok=eAzr-3m2", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-11/tiu_jack_miguel.jpg?itok=l6pz2BXO", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-11/tiu_tgiving_tess_kate.jpg?itok=JdRRSJur", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-11/tiu_tgiving_vietnam.jpg?itok=E8Q76qIc", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2018-11/tiu_main.jpg?h=1addfb6e&itok=MEdQCpiT", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2017-09/mandy_sterling_emmys.png?h=600ec1a0&itok=DOAHAFtB", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/rupauls_drag_race__E_1208_droop_sneak_1920x1080.jpg?h=70217200&itok=U94nGmuG", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/gettyimages-692085362.jpg?h=c673cd1c&itok=TnqSx9El"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-11/tiu_main.jpg?h=1addfb6e&itok=eAzr-3m2", "keywords": [], "authors": ["Philiana Ng"], "canonical_link": "https://www.etonline.com/this-is-us-revelations-jacks-mystery-woman-miguel-and-rebeccas-romance-tess-secret-114281", "title": "'This Is Us' Revelations: Jack's Mystery Woman, Miguel and Rebecca's Romance & Tess' Secret", "meta_data": {"article": {"opinion": "false"}, "title": "'This Is Us' Revelations: Jack's Mystery Woman, Miguel and Rebecca's Romance & Tess' Secret  | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/this-is-us-revelations-jacks-mystery-woman-miguel-and-rebeccas-romance-tess-secret-114281", "title": "'This Is Us' Revelations: Jack's Mystery Woman, Tess' Secret & More", "description": "The three biggest developments from Tuesday's Thanksgiving episode.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-11/tiu_main.jpg?h=1addfb6e&itok=eAzr-3m2", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "The three biggest developments from Tuesday's Thanksgiving episode.", "title": "'This Is Us' Revelations: Jack's Mystery Woman, Tess' Secret & More", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Philiana Ng‍", "url": "https://www.etonline.com/this-is-us-revelations-jacks-mystery-woman-miguel-and-rebeccas-romance-tess-secret-114281", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-11/tiu_main.jpg?h=1addfb6e&itok=eAzr-3m2"}, "description": "The three biggest developments from Tuesday's Thanksgiving episode.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "TV, News, This Is Us", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}