{"url": "https://www.dailyherald.com/entlife/20180122/memorable-moments-you-didnt-see-at-the-sag-awards", "text": "Memorable moments you didn't see at the SAG Awards\n\nJulie White, back row left, Kevin Dunn, Nelson Franklin, Gary Cole, Dan Bakkedahl, Sarah Sutherland, Clea Du Vall, Timothy Simons, Paul Scheer, Sam Richardson, Matt Walsh and Tony Hale, winners of the award for outstanding ensemble in a comedy series for \"Veep,\" pose in the press room at the 24th annual Screen Actors Guild Awards Sunday. Associated Press\n\nLupita Nyong'o, left, and Niecy Nash attend the 24th annual Screen Actors Guild Awards at the Shrine Auditorium & Expo Hall on Sunday. Associated Press\n\nSterling K. Brown, winner of the awards for outstanding performance by a male actor in a drama series for \"This Is Us\" and for outstanding performance by an ensemble in a drama series for \"This Is Us,\" plays with his awards in the press room at the 24th annual Screen Actors Guild Awards Sunday. Associated Press\n\nLOS ANGELES -- While actors are accustomed to being on camera, not every starry moment at the Screen Actors Guild Awards makes the screen. Here's a look at some of the celebrity exchanges that took place off-camera:\n\nAn emotional victory\n\nFirst, Sterling K. Brown was jumping for joy. Then he couldn't stop crying.\n\nBrown was a double winner at the Screen Actors Guild Awards Saturday, taking acting honors for his performance in \"This is Us\" and sharing in the show's ensemble award.\n\nBrown jumped up and down in the Shrine Auditorium ballroom when the NBC drama was announced as the ensemble winner, but by the time he came offstage after co-star Milo Ventimiglia's acceptance speech, he was in tears.\n\nBrown dabbed at his eyes with a tissue as his cast mates congratulated each other off-camera. At times he appeared to be sobbing.\n\nMeanwhile, co-star Chrissy Metz was singing a little ditty and dancing around.\n\nChris Sullivan, left, and Chrissy Metz pose with the award for outstanding performance by an ensemble in a drama series for \"This Is Us\" at the 24th annual Screen Actors Guild Awards at the Shrine Auditorium & Expo Hall on Sunday. - Associated Press\n\n\"We did it guys!\" she said. \"This is exciting! I'm excited!\"\n\nThe cast piled into an adjacent room where they claimed their actor statuettes, where 10-year-old Faithe Herman remarked, \"These weigh like 3,000 pounds.\"\n\nWhen Mandy Moore spotted Brown with his two trophies, she said, \"You could do bicep curls.\"\n\nBrown said backstage that he was especially moved by the cast award.\n\n\"My cast has been so generous in celebrating me and this wonderful journey that I've been on, and tonight we get a chance to celebrate each other,\" he said. \"So this is a dream... We were all waiting for them to say 'Handmaid's Tale,' but then they called our network television drama! The fact that we get a chance to come, and we won? This is a very special night.\"\n\nMoore added backstage that the vast cast is rarely on set together at once.\n\n\"We're never in one room,\" she said. \"That's what makes this all so much more special and celebratory.\"\n\nSympathy for Tonya\n\nAllison Janney revealed her secret for playing Tonya Harding's abusive mother in \"I, Tonya.\"\n\nAfter winning the Screen Actors Guild award for her performance in the film, the actress said that when she had to say cruel things to Harding's character, Janney would pretend she was saying them to herself.\n\n\"We all know our inner critics, our inner voices where we're the meanest to ourselves, and I would sometimes imagine me talking to myself when I had to say something to (co-star) Margot (Robbie),\" Janney said.\n\nA former figure skater herself, Janney said she related to LaVona Golden as she recalled her own parents waking up early to take her to the skating rink before school.\n\nAllison Janney picks up her award for outstanding performance by a female actor in a supporting role for \"I, Tonya\" at the 24th annual Screen Actors Guild Awards Sunday. - Associated Press\n\n\"The abuse part was not easy to understand ever,\" Janney said, \"but to see how normal it was in her life, that was just the way they reacted with each other.\"\n\nThe actress said being a part of \"I, Tonya\" made her sympathize with Harding in a way she hadn't before.\n\n\"I feel she did get a raw deal,\" Janney said.\n\n\"I just have a greater empathy for her, growing up with a mother like that... and in the figure skating community, not being embraced for who she was and not fitting in. I have real empathy for that,\" she continued. \"I think that's why it resonates right now is because of those themes of class: She was poor and they felt like she didn't fit in. She didn't represent the refined world of figure skating. I feel a lot for her, much more than I did so when that story first broke.\"\n\nSeat-fillers and pizza\n\nInside the Shrine Auditorium, where the SAG Awards are presented, a line of seat-fillers stood against a black curtain, waiting for their chance to sit with the stars.\n\nOne woman carried a copy of Vanity Fair to pass the time while she awaited her opportunity.\n\nThe tables of TV and movie casts were so packed into the ballroom, seat-fillers and waiters had to shimmy sideways to get through the throng.\n\nWhile commercials play during the telecast, dinner music plays in the ballroom. That's when the actors squeezed around to mingle. Frances McDormand hugged a whole group of people, Lupita Nyong'o posed for a selfie and Olivia Munn chatted to \"Veep\" star Tony Hale.\n\nAnd mysteriously, a dolly loaded up with about 30 pizzas passed through the ballroom and out into the hallway, leaving guests curious as to their destination.\n\nLove for Julia\n\nJulia Louis-Dreyfus was on the minds of the cast of \"Veep\" after their win for ensemble in a comedy series.\n\nTimothy Simons said Louis-Dreyfus has been in good spirits during her fight with cancer. \"She's incredible. She's uniquely able to combat something like this.\"\n\nTony Hale said she couldn't be more generous as a co-worker.\n\n\"She sets the tone and she has just set a tone for everybody where we're all part of a team,\" he said. \"Nobody's walking on eggshells ... She has no arrogance, no entitlement.\"\n\nShe's a really good cook, too, he said, especially key lime pie and chocolate chip cookies.\n\n\"We miss her greatly,\" he said. \"We wish she were here.\"\n\nHer cast mates said she couldn't be at the awards because she was doing a play in New York.\n\nParty time\n\nAt the after party of the SAG Awards, Robert De Niro held court on a couch in the center of the room and looked deep in conversation as machines billowed smoke around him and lights danced from the ceiling.\n\nOther stars treated the couches more like a dance floor. Allison Williams started grooving to \"The Weeknd's \"I Feel It,\" as her \"Get Out\" co-stars mingled. Mary J. Blige moved to \"No Church in the Wild\" by Kanye West and Jay-Z as she munched on a crab leg.\n\nThe cast from \"Orange is the New Black\" mixed with the mostly female cast of \"GLOW,\" spinning each other to Tina Turner's \"What's Love Got To Do With It\" and Michael Jackson's \"Rock With You,\" as they mouthed the words.\n\nRay Romano heartily shook Marc Maron's hand while comedian Sarah Silverman was seen chatting with Kenneth Parcell of \"30 Rock.\"\n\nMeanwhile Alison Brie stood shoulder-to-shoulder with husband Dave Franco, dancing and snacking the night away.\n\nYael Stone, who is pregnant, was perhaps enjoying the party a little less than her \"Orange is the New Black\" co-stars. She asked nearby strangers where the exit was, and was followed out by Taylor Schilling and Natasha Lyonne after they were overheard laughing at an inside joke.", "images": ["https://www.dailyherald.com/storyimage/DA/20180122/ENTLIFE/180129829/AR/0/AR-180129829.jpg&updated=201801220826&imageversion=Facebook&exactH=630&exactW=1200&exactfit=crop&noborder", "https://www.dailyherald.com/storyimage/DA/20180122/ENTLIFE/180129829/AR/0/AR-180129829.jpg&updated=201801220826&MaxW=900&maxH=900&noborder&Q=80", "https://www.dailyherald.com/storyimage/DA/20180122/ENTLIFE/180129829/EP/1/3/EP-180129829.jpg&updated=201801220826&MaxW=900&maxH=900&noborder&Q=80", "https://www.dailyherald.com/gfx/site/1x1.gif", "https://www.dailyherald.com/storyimage/DA/20180122/ENTLIFE/180129829/EP/1/4/EP-180129829.jpg&updated=201801220826&MaxW=900&maxH=900&noborder&Q=80"], "top_img": "https://www.dailyherald.com/storyimage/DA/20180122/ENTLIFE/180129829/AR/0/AR-180129829.jpg&updated=201801220826&imageversion=Facebook&exactH=630&exactW=1200&exactfit=crop&noborder", "keywords": [], "authors": ["Sandy Cohen"], "canonical_link": "https://www.dailyherald.com/entlife/20180122/memorable-moments-you-didnt-see-at-the-sag-awards", "title": "Memorable moments you didn't see at the SAG Awards", "meta_data": {"keywords": "Life & Entertainment, Movies, Television", "description": "While actors are accustomed to being on camera, not every starry moment at the Screen Actors Guild Awards makes the screen. Here's a look at some of the celebrity exchanges that took place off-camera.", "robots": "noarchive", "author": "Sandy Cohen", "twitter": {"card": "summary_large_image", "site": "@dailyherald", "url": "https://www.dailyherald.com/entlife/20180122/memorable-moments-you-didnt-see-at-the-sag-awards", "title": "Memorable moments you didn't see at the SAG Awards", "description": "While actors are accustomed to being on camera, not every starry moment at the Screen Actors Guild Awards makes the screen. Here's a look at some of the celebrity exchanges that took place off-camera.", "image": "https://www.dailyherald.com/storyimage/DA/20180122/ENTLIFE/180129829/AR/0/AR-180129829.jpg&updated=201801220826&imageversion=Facebook&exactH=630&exactW=1200&exactfit=crop&noborder", "account_id": 8960722}, "og": {"title": "Memorable moments you didn't see at the SAG Awards", "description": "While actors are accustomed to being on camera, not every starry moment at the Screen Actors Guild Awards makes the screen. Here's a look at some of the celebrity exchanges that took place off-camera.", "type": "article", "url": "https://www.dailyherald.com/entlife/20180122/memorable-moments-you-didnt-see-at-the-sag-awards", "image": "https://www.dailyherald.com/storyimage/DA/20180122/ENTLIFE/180129829/EP/1/4/EP-180129829.jpg&updated=201801220826&imageversion=Facebook&exactH=630&exactW=1200&exactfit=crop&noborder", "site_name": "Daily Herald"}, "article": {"publisher": "https://www.facebook.com/DailyHeraldFans", "published_time": "2018-01-22", "modified_time": "2018-01-22T12:26:00Z"}, "fb": {"app_id": 105603449548761}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1516550400.0, "source": "https://www.dailyherald.com", "summary": ""}