{"url": "www.thesun.co.uk/tvandshowbiz/3375378/kourtney-kardashian-boyfriend-younes-bendjima-children/", "text": "KOURTNEY Kardashian is the eldest of the Kardashian dynasty and a mother of three.\n\nHere is everything you need to know about her previous boyfriends and website Poosh...\n\n4 Kourtney Kardashian is the eldest of Kris Jenner's six children Credit: Getty Images - Getty\n\nHow old is Kourtney Kardashian?\n\nKourtney Mary Kardashian, 40, was born on April 18, 1979, and is the eldest daughter of Robert Kardashian and Kris Jenner.\n\nHer full siblings are Kim, Khloe and Rob - and she also has two half-sisters Kendall and Kylie Jenner from mum Kris's marriage to Caitlyn Jenner (previously known as Bruce).\n\nBefore hitting the big time with the family reality show, Kourtney studied Theatre Arts and Spanish at the University Of Arizona.\n\nKourtney first tasted TV fame in 2005 series Filthy Rich: Cattle Drive.\n\nJust two years later, a sex tape made by sister Kim and rapper Ray J was leaked, which led to family notoriety and reality show Keeping Up With The Kardashians.\n\nShe's since appeared on spin-off shows Kourtney & Khloe Take Miami, Kourtney & Kim Take New York and Kourtney & Khloe Take The Hamptons.\n\nIn 2017, Kourtney launched her first solo fashion line as part of a collaboration with the site PrettyLittleThing.\n\n4 Kourtney is close to younger sisters Kim and Khloe Credit: Getty - Contributor\n\nWhen did Kourtney Kardashian split from Younes Bendjima? Who is she dating now?\n\nKourtney split from her boyfriend Younes Bendjima (a boxer and model from Algeria) in August 2018 following an 18 month romance.\n\nThe pair made a rare appearance in public in May 2017 and reportedly started dating in October 2016.\n\nThey were first snapped together as they left a hotel in Paris in December 2016.\n\nKourtney previously had an on-off relationship with Scott Disick, the father of her three children, which spanned from 2006-2015 and involved three break-ups.\n\nHer ex is currently dating Sofia Richie, who she is now close to despite an alleged rocky start between them when the model first began seeing Scott.\n\nThe Keeping Up With The Kardashian star was believed to have romanced Justin Bieber in 2016.\n\nJustin appeared to confirm the rumours during an interview with The Bert Show that year.\n\nWhen asked about the beauty, he said: \"I'm being used, man. What can I say?\"\n\nIn September 2018 it was reported Kourtney had been dating social influencer and actor Luka Sabbat.\n\nThough it seems that the star is currently single.\n\n4 Kourtney launched her website, Poosh in April, 2019 Credit: Instagram\n\nWhat is Poosh, Kourtney Kardashian's website?\n\nThe brunette stunner launched her brand new lifestyle website in April, 2019 after weeks of teasing her social media followers.\n\nKourtney, who is often dubbed the 'healthy' Kardashian, writes much of the content on the site.\n\nAt times, she also ropes in her famous relatives, with a video interview between her and Kris Jenner on the page.\n\nHer website combines all things to do with health, life style, home and entertainment.\n\nAlso, she regularly uses it as a platform to plug some of the many products and services she uses.\n\n4 Kourtney pictured with Scott and his new girlfriend Sofia Credit: Instagram\n\nMORE KARDASHIAN NEWS 'awkward' Khloe jokes she needs to 'borrow some sperm' from ex Tristan for second baby 'THIS IS MY BABY' Khloe Kardashian is 'territorial' over True co-parenting with ex Tristan KEEP UP Kylie Jenner shuts down cruel troll who praised her ‘skinny’ 2017 body KID-DASHIANS Who are the Kardashian and Jenner grandkids? From North West to Stormi Webster KARN'T KEEP UP? Kardashian and Jenner baby names - what are the meanings behind the names? BUNKIN' BUDS Kylie Jenner gives a tour of Kris's Palm Springs home with six bed guest room\n\nHow many kids does Kourtney Kardashian have?\n\nKourtney has three children with her ex Scott Disick.\n\nThe couple split back in 2015 and despite numerous rumours, things are said to be firmly off between them.\n\nHowever, they amicably co-parent their three children Mason, 8, Penelope, 6, and Reign, 3.\n\nGet extra saving money tips with The Sun Vouchers including discounts and voucher codes for PrettyLittleThing and other Fashion line retailers.", "images": ["data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.2 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.5 1\"%3E%3C/svg%3E", "http://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i1.wp.com/www.thesun.co.uk/wp-content/uploads/2017/04/nintchdbpict000316319029-e1492760643184.jpg?crop=313px%2C31px%2C1352px%2C902px&resize=1200%2C800&ssl=1"], "top_img": "https://i1.wp.com/www.thesun.co.uk/wp-content/uploads/2017/04/nintchdbpict000316319029-e1492760643184.jpg?crop=313px%2C31px%2C1352px%2C902px&resize=1200%2C800&ssl=1", "keywords": [], "authors": ["Ellie Genower"], "canonical_link": "https://www.thesun.co.uk/tvandshowbiz/3375378/kourtney-kardashian-poosh-boyfriend/", "title": "How old is Kourtney Kardashian, does she have a boyfriend and what is Poosh?", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Get the lowdown on Kim's sis Kourtney Kardashian and her kids", "url": "https://www.thesun.co.uk/tvandshowbiz/3375378/kourtney-kardashian-poosh-boyfriend/", "description": "KOURTNEY Kardashian is the eldest of the Kardashian dynasty and a mother of three. Here is everything you need to know about her previous boyfriends and website Poosh… How old is Kourtney Kar…", "site_name": "The Sun", "image": {"identifier": "https://i1.wp.com/www.thesun.co.uk/wp-content/uploads/2017/04/nintchdbpict000316319029-e1492760643184.jpg?crop=313px%2C31px%2C1352px%2C902px&resize=1200%2C800&ssl=1", "width": 1200, "height": 800, "alt": "Kourtney"}, "locale": "en_GB"}, "article": {"published_time": "2019-07-31T10:18:23+00:00", "modified_time": "2020-02-28T12:53:20+00:00", "publisher": 161385360554578, "tag": "Kourtney Kardashian, Explainers, Keeping Up with the Kardashians", "author": "https://www.facebook.com/thesunshowbiz/"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "description": "KOURTNEY has been through her fair share of personal drama with her ex, Scott Disick but now she has a new website to focus on alongside her three adorable kids...", "keywords": "Kourtney Kardashian, Keeping Up With The Kardashians, boyfriend, Younes Bendjima, kourtney kardashian boyfriend, kourtney kardashian kids", "news_keywords": "Kourtney Kardashian, Keeping Up With The Kardashians, boyfriend, Younes Bendjima, kourtney kardashian boyfriend, kourtney kardashian kids", "twitter": {"text": {"title": "How old is Kourtney Kardashian, does she have a boyfriend and what is Poosh?"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "KEEPING UP", "headline": "Meet Kourtney Kardashian, Kim, Khloe and Rob's older sister", "image": {"medium": "https://i1.wp.com/www.thesun.co.uk/wp-content/uploads/2017/04/nintchdbpict000316319029-e1492760643184.jpg?crop=325px%2C33px%2C1432px%2C955px&resize=300%2C192&ssl=1", "large": "https://i1.wp.com/www.thesun.co.uk/wp-content/uploads/2017/04/nintchdbpict000316319029-e1492760643184.jpg?crop=325px%2C33px%2C1432px%2C955px&resize=620%2C413&ssl=1"}}, "parsely-post-id": 3375378, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1564568303.0, "source": "http://www.thesun.co.uk", "summary": ""}