{"url": "https://en.wikipedia.org/wiki/List_of_Girl_Meets_World_episodes", "text": "No.\n\noverall No. in\n\nseason Title [1][27] Directed by Written by Original air date [1][27] Prod.\n\ncode [3][1][28] U.S. viewers\n\n(millions)\n\n22 1 \"Girl Meets Gravity\" Rider Strong Randi Barnes May 11, 2015 ( ) 201 2.05[29]\n\nRiley, Maya, Lucas, and Farkle start their first day of the eighth grade at John Quincy Adams Middle School. After the girls startle their new teacher Mr. Martinez with their rudeness, he quits and Cory replaces him. Riley and Maya then decide to transfer classes, desiring to have a different teacher than Cory. They quickly discover that their new history teacher is very strict, and forces the girls to be separated against their wishes. They also notice that their new classmates are almost identical in both appearance and personalities to Riley, Maya, Farkle and Lucas. The girls later transfer back to Cory's classroom and restore normalcy. However, the girls are still restless, feeling like their parents are always \"circling\" around them like planets. Riley talks about the Sun, Earth and the Earth's orbit throughout the episode, and in the end, it is revealed Mrs. Svorski, the former owner of the bakery, has died and Riley was speaking at her funeral. Special guest stars: William Daniels as Mr. Feeny, Cloris Leachman as Mrs. Svorski Guest stars: Cheryl Texiera as Katy Hart, Delon de Metz as Mr. Martinez, Senta Moses as Alterna-Cory\n\n23 2 \"Girl Meets the New World\" Joel Zwick Teresa Kale May 12, 2015 ( ) 208 2.14[30]\n\nMaya begins to pressure Riley to find out what happened on her date with Lucas. Their classmates at school know that Riley and Lucas kissed, and begin pressuring the two to tell everyone if they are dating. Later on, Riley and Lucas confirm they are dating, telling Cory and Topanga about their kiss, which Cory is shocked about. Things become awkward, and even though Riley and Lucas have strong feelings for each other, they decide to break up and remain friends. Meanwhile, Maya and Farkle get \"engaged\" and then \"married\". Elsewhere, Topanga becomes frustrated while trying to teach Auggie's new friend that his name is Dewey, but he thinks his name is pronounced \"Doy\". Guest star: Cooper Friedman as Dewey\n\n24 3 \"Girl Meets the Secret of Life\" Rider Strong & Shiloh Strong Mark Blutman May 13, 2015 ( ) 202 2.60[31]\n\nOne of Lucas's friends from Texas, Zay Babineaux, transfers to John Adams, and alludes to the fact that Lucas acted quite differently back in Texas. This causes Riley significant distress, and she begins to worry that Lucas may not be the right boyfriend for her. After discovering Lucas was expelled from his previous school, a parallel discussion begins in which Cory asks his students what the secret of life is. To further the conversation for the next class, Cory assigns the students to wash a car together and claims by doing so, they will find the secret of life. A disagreement regarding Lucas's personality in Texas starts after the friends begin spraying each other with water. After they finish washing the car, Zay runs into a bully and Lucas attempts to help his friend out as Riley and Maya watch. Lucas threatens the bully away, and reveals to Riley that the reason he was expelled is because his temper got the best of him when Zay was in trouble. Through Cory's lesson, the friends then realize that whatever Lucas's personality was before he came to New York does not matter, as they have all changed him for the better. Guest stars: Amir Mitchell-Townes as Zay Babineaux, Shak Ghacha as Joey Ricciardella\n\n25 4 \"Girl Meets Pluto\" Joel Zwick Matthew Nelson May 14, 2015 ( ) 203 2.36[32]\n\nRiley is shocked when Maya tells her that Pluto is no longer considered a planet. Cory asks his students how they think they will be remembered in history, and he suggests creating a class time capsule. Cory then remembers the time capsule that he, Topanga, and Shawn buried fifteen years ago in Philadelphia, causing him to elatedly go out and buy shovels so they can dig it up. Maya and Riley go to Philadelphia with Cory, Topanga, and Shawn to dig up the time capsule in Mr. Feeny's yard. Shawn reveals his contribution to the time capsule was the contents of his ex-girlfriend Angela's purse, causing Maya to believe that Shawn does not actually love her mother as she had hoped. Shawn reassures her, telling Maya that he will always be there for her if she needs it. Later, the friends fill their own time capsule with various things that signify importance to them, including Riley's pluto ball, Farkle's orange turtleneck and Lucas's transfer slip. Maya asks her friends to leave so she can put in her contribution, which is a picture of Shawn and her mother together with her on her 14th birthday. Special guest star: William Daniels as Mr. Feeny Guest stars: Rider Strong as Shawn Hunter, Cheryl Texiera as Katy Hart Absent: August Maturo as Auggie Matthews\n\n26 5 \"Girl Meets Mr. Squirrels\" Rider Strong & Shiloh Strong Michael Jacobs May 15, 2015 ( ) 204 2.20[33]\n\nRiley and Maya get into a huge argument which threatens their friendship. The feud prompts Cory to call on his older brother Eric to mediate, recalling his people skills in settling a feud when they were in college. After Eric arrives at the Matthews' apartment, he listens to the girls, and Maya reveals a comment Lucas made about her height, which Riley decided to agree with rather than considering how hurtful the comment was to her friend. Eric is later a guest in Cory's class, and he gathers the students just outside the classroom, where Riley and Maya further discuss their problem. It turns out the other students, including Farkle, Lucas and Zay, are dealing with similar issues for their age. Eric shows them that what they are going through is normal, and they should be supportive of each other even with these issues. Guest stars: Will Friedle as Eric Matthews, Amir Mitchell-Townes as Zay Babineaux\n\n27 6 \"Girl Meets the Tell-Tale-Tot\" Ben Savage Teresa Kale June 5, 2015 ( ) 205 2.19[34]\n\nUncle Josh visits Cory and his family again, with great news about being accepted into NYU, to Maya's delight. There is a welcoming party for Josh at a friend's dormitory at the university, which Maya is determined to attend. It starts late at night, so Maya pretends to have a sleepover at Riley's with plans to sneak out. Though Riley knows it is wrong, she decides to accompany Maya, and the two devise a scheme so that Riley's parents are unaware that they are at this party. Auggie later unfoils the scheme, but keeps quiet. While Riley enjoys her first taste of college life, Maya regrets being there when she sees Josh speaking with other girls and realizes she is not in their league. Josh is startled to see Riley and Maya, and takes the two home after trying to set things straight regarding Maya's feelings for him. Riley ends up grounded for two weeks for sneaking out, and Auggie is grounded for one week, for not speaking up about his sister. Guest stars: Uriah Shelton as Joshua Matthews, Amir Mitchell-Townes as Zay Babineaux, Madison McLaughlin as Jasmine, Cynthy Wu as Charlotte, Tajh Bellow as Andrew Absent: Peyton Meyer as Lucas Friar Note: \"Tell-Tale-Tot\" is in reference to Edgar Allan Poe's story \"The Tell-Tale Heart\", which Cory teaches his class in this episode, with a large tater tot representing one's conscience.\n\n28 7 \"Girl Meets Rules\" Rider Strong & Shiloh Strong Randi Barnes June 12, 2015 ( ) 211 2.04[35]\n\nCory gives his entire class detention. While Cory is out of the classroom, the class splits into two separate groups, one led by Riley and the other by Maya. Rileytown represents order and structure; the quieter students stay with Riley in the classroom. Maya's group, which represents chaos and rebellion, walks out. Lucas and Farkle follow the rebels and join Mayaville. Each group eventually realizes how much they need the other group to balance things, and Riley and Maya similarly discover how much they need each other. Guest stars: Danny McNulty as Harley Keiner, Ava Kolker as Ava Morgenstern\n\n29 8 \"Girl Meets Hurricane\" William Russ Matthew Nelson June 19, 2015 ( ) 209 2.07[36]\n\nAfter giving Maya \"fatherly advice\" about her needing to dress differently, Shawn buys her a whole new wardrobe of clothes, as a gift from both him and Katy. This gives Maya hope that her mother and Shawn will grow closer. Maya holds on to that hope even when Shawn's old girlfriend Angela pays a visit. As the two catch up on their past, Angela and Shawn realize what they had for each other has prepared them for what is happening in their lives right now. Angela, already married for four years to a military man, looks to Shawn for advice on starting a family and asks him whether she will be a good mother. She also notices Maya and Katy, and wants Shawn to pursue a relationship with Katy. Later, Katy asks Shawn out on a date, and after receiving further advice from his late father Chet who appears to him for the big moment, Shawn accepts. Guest stars: Rider Strong as Shawn Hunter, Cheryl Texiera as Katy Hart, Trina McGee as Angela Moore, Blake Clark as Chet Hunter\n\n30 9 \"Girl Meets Mr. Squirrels Goes to Washington\" Rider Strong & Shiloh Strong Mark Blutman July 10, 2015 ( ) 210 2.09[37]\n\nCory's students argue that the election is not relevant to their generation because they are unable to vote or influence the events. Quickly after, Eric bursts into the classroom and announces he has been nominated to run for New York senator. Eric explains to the Matthews Family that a man came up to him and claimed he was the only person who could beat his opponent, Senator Graham, though he later discovers he was purposefully chosen by someone who works for his opponent to make Senator Graham look good. Eric decides to use his opponent's lack of empathy to his advantage, and bases his campaign speech on how he could make the election relevant to everyone, including children, rather than picking on the little guy. At the campaign speech, a man whom Eric met earlier at Topanga's reveals himself to be Tommy, a little boy that Eric fostered and considered adopting when he was in college. Due to his fantastic speech, Eric wins the election and attempts to become closer to Tommy once again. Guest stars: Will Friedle as Eric Matthews, Danny McNulty as Harley Keiner, Nicholas Hormann as Senator Graham, Lamont Thompson as Zachary T. Wolff, J.B. Gaynor as TJ Murphy Absent: August Maturo as Auggie Matthews\n\n31 10 \"Girl Meets the New Teacher\" Joel Zwick Michael Jacobs July 17, 2015 ( ) 212 2.37[38]\n\nWhen Riley's English teacher retires, a new teacher named Harper Burgess takes his place. She has an unconventional teaching style that inspires the students, especially Maya, but soon gets in trouble with Principal Yancy for using The Dark Knight Returns by Frank Miller as subject matter. When Cory stands up to defend this new teacher, his job is placed in jeopardy as well. Jonathan Turner is called in to see if she is worthy of being kept as a teacher. He mentions that he taught X-Men to his class, and in regard to To Kill a Mockingbird, mentions that her dad named her Harper Lee Burgess, after the author of the novel. Harper Burgess is kept on as a teacher at John Quincy Adams Middle School, and continues to use her unconventional teaching style to inspire students. Guest stars: Anthony Tyler Quinn as Mr. Turner, Tania Gunadi as Harper Burgess, Stuart Pankin as Principal Yancy\n\n32 11 \"Girl Meets Fish\" Michael A. Joseph David J. Jacobs & Michael Jacobs July 24, 2015 ( ) 121 2.19[39]\n\nWhen it is Riley's turn to take care of the class fish, she discovers it is dead. Auggie suspects foul play and investigates the matter. As Riley and Maya pay a visit to Phil's fish store for a replacement, the rest of the class is gathered at Riley's apartment for questioning. Farkle, the last to care for the fish, is the first in the hot seat and admits to replacing the fish several times, due to each one dying in separate mishaps. Maya and Lucas are then questioned, only to discover they too replaced the fish multiple times on their watch. In fact, each of the students replaced the fish during their turns to care for it. As for the fish Riley was to look after, it is revealed Auggie fed graham crackers to the fish right before it was handed to Riley, causing it to die. Though the case is solved, Auggie feels awful that he killed the fish, but Riley forgives him and allows him to care for its replacement. The entire class then visits Phil's fish store for a new class fish, and they hope it will live a long life with proper care. Also starring: Corey Fogelmanis as Farkle Guest stars: Ava Kolker as Ava, Hugh Dane as Phil Note: This episode was filmed during the first season, but was held back and later aired during the second season for Disney Channel's \"Whodunit?\" special event. Corey Fogelmanis is credited as \"also starring\" after the episode's opening sequence.\n\n33 12 \"Girl Meets Yearbook\" Rider Strong & Shiloh Strong Teresa Kale August 7, 2015 ( ) 214 2.33[40]\n\nWhen Riley and Farkle dislike what their school yearbook says about them, they decide to change their personalities because they believe students are making fun of their quirkiness. Farkle, who is unique enough to have his own category in the yearbook, transforms into a regular guy named Donnie Barnes. Riley becomes increasingly uncomfortable when she is voted the person who would be \"most likely to smile themselves to death.\" It is also learned that the entirety of their class views Maya and Lucas as boyfriend and girlfriend, despite the two being completely unaware of where the idea came from. Unable to deal with how other people view her, Riley assumes a morose alter-ego named Morosha M. Black. Riley's change deeply affects Maya, who in turn seeks to become her best friend and emulate her. Lucas is not pleased about these changes in his friends, who are letting what others say affect them, and he wants them to be themselves again. Cory's history lesson about Iceland and Greenland, and how people settled in Greenland because of its name, then perished, serves as a reminder to the class not to be misguided by what others say. Guest star: Cheryl Texiera as Katy Hart Absent: August Maturo as Auggie Matthews\n\n34 13 \"Girl Meets Semi-Formal\" Joel Zwick Will Friedle August 14, 2015 ( ) 216 2.20[41]\n\nRiley is forced to examine her relationship with Lucas when another boy named Charlie Gardner asks her to a big semi-formal dance. Charlie asks Riley on a date and seems like the perfect date to Riley, but Lucas assumes he and Riley were going together. Meanwhile, newly elected Senator Eric reunites with his old friend Jack Hunter when he comes to Eric, on behalf of a large corporation that wants to build a pipeline. Eric recognizes that Jack has lost his way, and tries to save his friend by showing him a simpler way of life, which leads to him meeting Riley at the semi-formal dance. Maya and Lucas dance together and share an awkward moment when Lucas denies that they are dancing, fumbling over his words, which Maya questions. Riley dances with Farkle and Charlie while still confused of her true feelings. Special guest star: Sheppard as themselves Guest stars: Will Friedle as Eric Matthews, Matthew Lawrence as Jack Hunter, Tanner Buchanan as Charlie Gardner, Phil Morris as Agent LaChance Absent: August Maturo as Auggie Matthews\n\n35 14 \"Girl Meets Creativity\" Rider Strong & Shiloh Strong Matthew Nelson August 21, 2015 ( ) 218 2.26[42]\n\nThe group learns that the school's art programs are being canceled due to budget cuts, and Lucas inspires the group to try and save art class, which Maya is passionate about. Though Maya is skeptical to step up against authority, she is eventually convinced with Riley's help to fight for what she believes in. With Cory's assistance, the girls reach out to Superintendent Turner, who says that he is not in favor of cutting arts either, but claims the school's budget is very limited. Still not satisfied with Turner's answer, Maya and her friends go to the school board meeting and show the board members how taking away the arts actually will affect students. After a creative demonstration by the five friends, the school board agrees to think differently about how important the arts are, while also making the promise that they will work out the budget cuts without cutting any art programs. Guest stars: Diana Maria Riva as Chairperson Sanchez, Anthony Tyler Quinn as Mr. Turner, Amir Mitchell-Townes as Zay Babineaux, Aisha Kabia as Ms. Kossal\n\n36 15 \"Girl Meets Farkle\"\n\n\"Girl Meets I Am Farkle\" Willie Garson Mark Blutman September 11, 2015 ( ) 217 1.85[43]\n\nResults of a school IQ test show Farkle to be a genius, and the Minkuses hold a party for their son at Topanga's. Isadora Smackle comes to the party and invites Farkle to transfer to Einstein Academy. Later, additional tests identify that Farkle may have Asperger's syndrome, a form of autism. Though in disbelief at first, Riley, Maya and Lucas help their friend understand the symptoms, one of which is a difficulty understanding love. Farkle tries to explore that by hanging out with Smackle, who shows compassion when he tells her he may have Asperger's. Smackle later decides to observe Farkle in Cory's class, and after Farkle confirms he does not have Asperger's, she feels uncomfortable but realizes he belongs around his friends rather than at Einstein Academy. Seeing how Smackle interacts with everyone, including how she feels being hugged, Riley and Maya deduce she has Asperger's, and Smackle tells them she was diagnosed with it at the age of five. Farkle shows the same compassion Smackle showed him after discovering this. Guest stars: Lee Norris as Minkus, Kristanna Loken as Jennifer Bassett Minkus, Cecilia Balagot as Smackle, Cyrina Fiallo as Ms. Oben Absent: August Maturo as Auggie Matthews\n\n37 16 \"Girl Meets Cory and Topanga\" Ben Savage Joshua Jacobs September 18, 2015 ( ) 220 2.42[44]\n\nRiley wonders how she will positively impact the world, and feels she will never be as \"perfect\" as her parents. In exploring this question, she and Maya talk to a nun at an orphanage and a clown at the circus, but Riley is reminded about being in her parents' shadow when she sees them contributing at those places. Maya suggests Riley tell some stories she remembers about her parents' young days, and the two see Cory and Topanga at their age. As Riley sees a little of both of her parents in her, and their quirks, she is reminded by the younger Topanga that she is unique. Guest stars: Ken Hudson Campbell as Jingles the Clown, Diona Reasonover as Sister Mary Beth\n\n38 17 \"Girl Meets Rileytown\" Michael A. Joseph Lauren Otero September 25, 2015 ( ) 223 2.62[45]\n\nMaya describes Riley's place of uniqueness as \"Rileytown\", but mere mention of that word causes Riley to become irate and call Maya a \"bully\". At the same time, the two girls and the rest of Cory's class learn how to resolve conflicts. With the Aaron Burr-Alexander Hamilton conflict as the class example, Riley decides to challenge Maya to a duel, and they carry it out at Topanga's, using ice cream as their weaponry. After Maya backs out, Riley ice-creams her. Maya becomes aware that something is wrong with Riley, and Farkle, recalling when he was bullied, thinks someone is bullying Riley. Maya talks to Riley and wants her to open up about what is going on. Riley explains that she is being bullied by someone sending her threatening text messages, and that the term \"Rileytown\" caused her to feel different and humiliated, causing her to take it out on Maya. Farkle, Lucas, and Zay come to talk to her as well, saying she can come to them if something is bothering her, which is further discussed in her father's class. The bully has been taking videos of Riley at school which include Riley giving herself \"award ceremonies\" every Friday, and threatens to send the rest of the school those videos. To confront her unseen bully, Riley shows she is not ashamed of her quirky personality by performing one of her award ceremonies in front of the whole school. The unseen bully realizes that she can no longer damage Riley's confidence and runs away. Guest star: Amir Mitchell-Townes as Zay Babineaux Absent: August Maturo as Auggie Matthews\n\n39 18 \"Girl Meets World of Terror 2\" Joel Zwick Jeff Menell October 2, 2015 ( ) 215 2.38[46]\n\nAuggie, along with Doy and Ava, narrates the \"Second Annual Scary Time Theater\" which highlights three separate Halloween tales. In the first segment, Riley and Maya both dress up as flapper girls per the suggestion of a ghost whom resides in the bay window. The ghost explains to Riley and Maya that she remains in the bay window because it used to be hers, and she wants the subsequent owners to enjoy the space as much as she did. Riley and Maya struggle to get the ghost out of the bay window, until the ghost mispronounces Doy's name and he lets out an ear-piercing scream, causing the ghost to leave the window. In the second segment, Riley and Maya inadvertently find the ghost again in a haunted house, and attempt to help her friend, Tessie, become friendly again. The girls are unable to help Tessie and run away in terror. Finally, Riley and Maya believe that Doy has turned them into cartoon characters, though they later discover it the ghost once again, using her magic to influence them. After one last time of watching the girls, the ghost finally decides that it is time to move on, because the girls appreciate the bay window's true power. Special guest stars: Ross Lynch as Austin Moon, Laura Marano as Ally Dawson Guest stars: Ava Kolker as Ava Morgenstern, Cooper Friedman as Doy, Brittany Ross as Ghost Absent: Peyton Meyer as Lucas Friar, Corey Fogelmanis as Farkle Minkus\n\n40 19 \"Girl Meets Rah Rah\" Joel Zwick Randi Barnes October 9, 2015 ( ) 222 3.31[47]\n\nAfter years of failing to make the cheerleading squad, Riley is determined to get on the squad this time, but Coach Kelly shows little faith in her and expects her to quit. Maya, Lucas, Farkle, and Zay attend the tryouts to support her, though even they have their doubts of her succeeding. Riley manages to get through the three days of tryouts, even with the mistakes and injuries, but when she is finally cut, she is faced with deciding whether to give up on cheerleading. While Cory worries about his daughter's desire to become a cheerleader, as her teacher, he encourages her to continue pursuing something she is passionate about. Despite Coach Kelly not placing her on the squad initially, Riley's spirit and persistence pay off. Guest stars: Perez Hilton as himself, Amir Mitchell-Townes as Zay Babineaux, Jennifer Hasty as Coach Kelly, Courtney Schwartz as Samantha, Savannah Winters as Jenkins, Jacqueline A. Benoit as Nurse\n\n41 20 \"Girl Meets Texas: Part 1\" Rider Strong & Shiloh Strong Michael Jacobs & Matthew Nelson October 16, 2015 ( ) 224 2.94[48]\n\nRiley and Maya learn that Lucas failed a sheep-riding contest years ago and mistakenly enter him in a bull-riding contest in Texas. When it is revealed how dangerous the event is, Riley tries to convince Lucas to go through with it. However, Maya is completely opposed to the idea and begs him not to participate. This results in Riley realizing Maya's true feelings for Lucas. Guest stars: M.C. Gainey as Pappy Joe, Amir Mitchell-Townes as Zay Babineaux, Tahmus Rounds as Cletis, Madison Mason as McCullough Absent: August Maturo as Auggie Matthews, Danielle Fishel as Topanga Matthews\n\n42 21 \"Girl Meets Texas: Part 2\" Rider Strong & Shiloh Strong Matthew Nelson & Michael Jacobs October 17, 2015 ( ) 225 2.88[49]\n\nThe group spends their first night out in Texas. Zay reunites with his old flame, Vanessa, thanks to Riley and Maya. Meanwhile, Riley begins to understand that Maya had stepped back for the sake of their friendship, and Riley tells Lucas about Maya's feelings. Lucas pressures Maya to say whether she likes him or not. She denies it, but as she does, Lucas surprises her by trying to kiss her, causing tension and confusion between the two about their true feelings for each other. Special guest stars: Maddie & Tae as themselves Guest stars: M.C. Gainey as Pappy Joe, Amir Mitchell-Townes as Zay Babineaux, Chandler Kinney as Vanessa Absent: Ben Savage as Cory Matthews, August Maturo as Auggie Matthews, Danielle Fishel as Topanga Matthews\n\n43 22 \"Girl Meets Texas: Part 3\" Ben Savage Michael Jacobs & Matthew Nelson October 18, 2015 ( ) 227 3.12[50]\n\nRiley has convinced herself that she and Lucas are like brother and sister, in order to give Maya a chance to understand how she really feels about him. Now, Maya and Lucas cannot communicate, mirroring Riley and Lucas' awkwardness when they were dating. Whilst Maya and Lucas are finding it difficult to take a step forward in their relationship until Maya resumes her teasing behavior, which makes Lucas happy. Riley is pursued by Charlie Gardner and she agrees to date him. In the end, Farkle helps Riley realize she still likes Lucas, and they share a long conversation at Topanga's which results in a hug. Guest stars: Amir Mitchell-Townes as Zay Babineaux, Tanner Buchanan as Charlie Gardner\n\n44 23 \"Girl Meets the Forgiveness Project\" Joel Zwick Matthew Nelson November 6, 2015 ( ) 221 2.51[51]\n\nWhen Cory comes up with the idea of a forgiveness project, everyone expresses their feelings on paper to someone they wish to forgive. Riley writes to Auggie and Lucas and Zay write to Farkle, while Maya decides to write to her father, Kermit, who appears at Topanga's after receiving Maya's letter. That comes as a shock to Katy, but Maya wants to give Kermit a chance to be part of her life again after he failed to be for the last nine years. As Maya and the rest of Cory's class miss the point of forgiveness, Cory explains to them that they need to give those they are forgiving an opportunity to show remorse for their wrongdoing before the assignment can even begin. Riley, Lucas, and Zay have little difficulty in forgiving, while Maya's situation is a different story. Kermit explains to her why he left her and her mother and started a different family. Maya understands what her father did and is no longer angry with him, but she cannot forgive him. She tearfully confesses to Cory she failed the assignment, but Cory says he did not expect her to reconcile with her father right away, if ever. Guest stars: Amir Mitchell-Townes as Zay Babineaux, Cheryl Texiera as Katy Hart, David Thomas Jenkins as Kermit, Carlos Antonio as Howie\n\n45 24 \"Girl Meets Belief\" Joel Zwick Jeff Menell November 13, 2015 ( ) 213 2.15[52]\n\nAfter Maya finds money just outside Cory's classroom, she wants to buy ice cream with it, but Riley tells her it is not her money. As they go into class, Cory has the class look at each other's beliefs; he assigns Riley and Maya to report about Thomas Jefferson, and Lucas and Farkle to report about Joan of Arc. The assignment creates tension among the four because of their differing beliefs, causing them to switch partners. Maya takes a brief break from Riley, because Riley pressures her to believe in something. While the four continue to work on the assignment and discuss their beliefs in Riley's bedroom, Cory gives them insight about why their beliefs are different, and tells them listening to others helps to form their beliefs. What the four learn about Jefferson and Joan of Arc also influences what they believe. Farkle realizes some things are not scientifically explained, such as his friendships for which he is grateful. Maya tries praying after discovering Riley believes in God, and gives back the money she found earlier. Riley and Lucas question why they need each other, since they are not challenged or learning from each other. Meanwhile, Auggie prays Mrs. Svorski is not alone in heaven by talking to her.\n\n46 25 \"Girl Meets the New Year\" Joel Zwick Mark Blutman December 4, 2015 ( ) 229 2.07[53]\n\nWhen Harper teaches about Jane Austen's Sense and Sensibility in English class, Riley and Maya soon realize their similarities to the novel's two main characters. Having seen the movie adaptation, Charlie shares with the class that a relationship must have both sense and sensibility to work. Riley is inspired by the novel to host a New Year's Eve party for all of her friends from school. Meanwhile, Farkle continues to be frustrated with Riley for not telling Lucas how she truly feels about him; Farkle gives her until midnight on New Year's Eve to do so, or he will. During his class, Cory teaches the importance of friendship and growth, and how without proper care, feelings can ruin them. At the party, Charlie and the group play a couples game, in which Maya and Lucas are partners. Riley, Maya, and Lucas become uncomfortable as the game progresses. Riley ends the game on her turn and brings everyone up to the roof, minutes before the new year begins. On the rooftop, Riley asks Farkle for more time to confess her true feelings, but he refuses as he does not want lies to cause further damage. Wanting to be with Riley at midnight, Charlie tries to show he cares about her. Riley tells him while that makes sense, a good relationship needs to have sensibility as well, leaving the two alone on separate sides of the roof. Maya, still confused about her feelings, tells Lucas that she wants to start off the new year being nice to him and that she is glad they will be together at midnight. He grins and says that makes up for everything. When the clock strikes midnight, Riley tries to escape just as Farkle yells out the truth, causing Maya and Lucas to be dismayed by the revelation. Everyone leaves except for Riley, Maya, and Lucas. The three sit alone on a bench, confused. Guest stars: Tania Gunadi as Harper Burgess, Tanner Buchanan as Charlie Gardner, Cecilia Balagot as Smackle\n\n47 26 \"Girl Meets STEM\" Rider Strong & Shiloh Strong Teresa Kale January 8, 2016 ( ) 219 1.62[54]\n\nFor the mid-term science experiment, Mr. Norton has Riley and her classmates examine a solution by placing a mystery marble into clear liquid, with one person of each boy-girl team dropping the marble and the other working out the scientific calculations. When Riley sees it is only the girls who are putting the marbles into the liquid and leaving the boys to do the science, she is offended and refuses to follow that trend. She gathers the girls into her bedroom to discuss why this is happening, and makes them realize they are not seeing their potential. She also confronts Farkle, her science experiment partner, about his perceived stereotyping of girls; he takes the blame and apologizes to Riley for not allowing her to pursue her interest in science. While the marble-liquid solution is simply sludge, there is a bigger picture to the experiment which Riley has already figured out. She presents her finding to Mr. Norton, who informs the class it is at their age that girls begin to lose interest in the STEM subjects. The rest of the class cannot see their partners due to the beaker of sludge in their way, but Riley and Farkle can see each other crystal clear, because they worked together equally to complete the science. Guest stars: Ava Kolker as Ava Morgenstern, Amir Mitchell-Townes as Zay Babineaux, Jeff Doucette as Mr. Norton\n\n48 27 \"Girl Meets Money\" Rider Strong & Shiloh Strong Teleplay by : Jeff Menell\n\nStory by : Aaron Jacobs & Jeff Menell January 22, 2016 ( ) 226 2.20[55]\n\nAs Cory teaches his class about the value of money, and Stuart makes a risky investment on new technology for Minkus International, Farkle becomes concerned about being poor. He quickly starts seeing there is greater value to his friendships and family than money and material things can give. Cory goes further into his money lesson by emphasizing there is a large part of the world that is less fortunate, revealing a greater \"secret of life\": kindness and charity toward others. Cory challenges the class to come up with ideas for using money to help those in need, but this prompts Farkle to leave class immediately and to talk to his father about their relationship and his company's purpose, saying he needs to do more for the rest of the world. Because of the heartfelt conversation, Stuart begins a charitable organization and looks to give away money for a charitable cause. With help from NBA owner Mark Cuban, Stuart, Cory and Topanga listen to Riley, Lucas, Maya and Farkle about how they would help the less fortunate. Ultimately, on Farkle's request, Stuart and Mark invest on Maya, who lives in need and appreciates all she has been given. Meanwhile, Auggie worries about his father when he does not receive his whole allowance, but learns the importance of Cory's contributions as a teacher, despite being paid less than Topanga. Guest stars: Mark Cuban as Mark Cuban, Lee Norris as Minkus\n\n49 28 \"Girl Meets Commonism\" Danielle Fishel Joshua Jacobs & Michael Jacobs February 12, 2016 ( ) 206 1.75[56]\n\nRiley and Lucas are two members on the school honor board, which is to decide a case involving Maya and Farkle. Riley, who finds out Maya cheated off Farkle on a test, wants them off the hook for the sake of their friendship, but Lucas disagrees, as does Cory, who oversees the honor board. When Cory's class learns about communism, Riley defends Maya's cheating as a form of sharing and feels there is nothing wrong with what she did. The girls and Farkle start embracing the ideals of communism, and disregard their individuality. As Maya and Farkle's fate is being determined by the honor board, Riley sides with them, and Topanga represents them, but it is revealed that Farkle was not the only one helping Maya to cheat, but Riley as well. After Cory hands back a test where everyone has received excellent scores, but Riley, Maya and Farkle end up with an \"average\" grade, the three realize the importance of being individuals. Meanwhile, Auggie is wondering what to do with his life, but things backfire when he decides to be a lawyer and defend Frankie, the class bully. Guest stars: Amir Mitchell-Townes as Zay Babineaux, Ava Kolker as Ava Morgenstern, Michelle Page as Mrs. Ducksberry, Sanai Victoria as Emma Weathersby\n\n50 29 \"Girl Meets the Bay Window\" Ben Savage Joshua Jacobs February 19, 2016 ( ) 228 1.70[57]\n\nWith high school around the corner, Riley decides to change her bedroom bay window and leave her childhood years behind, but Maya objects because of what the bay window has meant to both of them. She also feels reluctant to move on to this next phase of their lives. The girls reflect on when they first became friends, as well as when they first met Farkle, and the two talk to their younger selves about how much they have changed since. In the redecorated bay window, Riley and Maya see themselves as young adults preparing to move away, leaving the bay window behind as both the young and current versions of Riley and Maya watch. Guest stars: Mariah Buzolin as Adult Riley, Ruby Lewis as Adult Maya, Lindsey Lamer as Young Riley, Ivy George as Young Maya, Michael Wilder as Young Farkle Absent: August Maturo as Auggie Matthews\n\n51 30 \"Girl Meets Legacy\" Joel Zwick Randi Barnes March 11, 2016 ( ) 230 1.70[58]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/images/wikimedia-button.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_Girl_Meets_World_episodes", "title": "List of Girl Meets World episodes", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}