{"url": "https://people.com/tv/heather-locklear-allegedly-told-cops-their-kids-deserve-to-die-during-arrest/", "text": "The night 56-year-old actress Heather Locklear was arrested on suspicion of felony domestic battery and three counts of battery on a police officer, she told police her boyfriend Chris Heisser had “choked her” and “tried to kill” her.\n\nPEOPLE has obtained search warrant and Affidavit of Probable Cause documents prepared by Senior Deputy Sheriff Keith Hall — who used accounts by on-the-scene Sergeant Camo, deputies Nesgis and Alldredge, as well as body cam footage to investigate the incident on Feb. 25 at Locklear’s Thousand Oaks, California, home that lead to the Melrose Place actress’ arrest.\n\nGet push notifications with news, features and more.\n\nIn the documents, Hall wrote that “Locklear said the fight first started when [Heisser] lied to her and she threw a can of Red Bull at him.”\n\n“Locklear told Deputy Alldredge that [Heisser] had strangled her and that she was afraid he would kill her,” Hall said in the documents. “Locklear stated she did not lose consciousness, but was strangled for a long time and thought she might pass out.”\n\nHall wrote that Locklear told officers the alleged choking “stopped her from breathing.”\n\nImage zoom Heather Locklear Ventura County Sheriff's Department\n\nRELATED: Depression, Arrests and Rehab: Inside Heather Locklear’s Darkest Days\n\nHeisser — who previously dated Locklear in high school and began dating her again last year — told Deputy Nesgis, “‘I didn’t touch her, ‘ ” Hall recounted in his report.\n\n“Deputy Alldredge saw that [Heisser] was bleeding from the bridge of his nose and he had redness on his chest,” Hall wrote in the documents. “[Heisser] told Deputy Alldredge that in the bedroom, Locklear attacked [Heisser] while he was on the bed and he defended himself. He did not know how many times Locklear struck him. Locklear bit his face and described Locklear as being ‘all over’ him for the last 20-30 minutes acting ‘crazy,’ ‘angry,’ and ‘wild.’ ”\n\nImage zoom Heather Locklear and Chris Heisser Heather Locklear/Instagram\n\nDuring the course of the investigation, “Locklear exhibited combative, belligerent, and aggressive behavior toward deputies,” Hall wrote.\n\nHe called her behavior “agitated and uncooperative,” writing that, “Locklear grabbed Deputy Alldredge by the bicep and pulled on it while ordering him to get out of the house.”\n\nHall continued: “Locklear walked to her bedroom and began to close the door. Deputy Alldredge put his foot in the doorway to prevent her from closing it, and to continue the investigation. Heather attempted to push Deputy Alldredge out of the doorway, and screamed, ‘Get the f— out of my house!’ She battered Deputy Alldredge by kicking him in his shin in an attempt to get his foot out of the doorway. The source was strong enough to force Deputy Alldredge’s leg out of the doorway.”\n\n“Sergeant Camou asked Locklear to exit the bedroom several times before she complied,” Hall added in the documents. “She continued to yell and scream at the deputies to leave her house while pacing back and forth in a very aggressive manner. Locklear yelled profanities at the deputies and tried to physically push Sergeant Camou and Deputy Nesgis with her hands out of the house.”\n\nImage zoom Heather Locklear REX/Shutterstock\n\nEventually, Locklear was placed under arrest. “Sergeant Camou had to grab Locklear’s arms to restrain her,” Hall wrote. “Locklear continued to struggle and resist as Deputy Nesgis handcuffed her. Locklear was lying on her stomach handcuffed. As Deputy Nesgis rolled Heather on to her right side to stand her up, she kicked Sergeant Camou with her left foot. … Due to her combative behavior, deputies place a hobble around Locklear’s ankles to prevent her from kicking deputies.”\n\n“‘You f—— deserve your kids to die! You f—— deserve it!’ ” Hall said Locklear told Deputy Nesgis in the report. “‘And when you find yourself in that position, think of me!’ ”\n\n“‘I hope no one f——- burns your entire department down, your f—— police department,’ ” Hall claims Locklear told deputies, according to the report. “Get the f— off my property. Don’t ever come on it. All of you are not allowed … I will shoot you if you come on my property and take that as a threat and f—— put another count against me.’ ”\n\nIt was that threat to “shoot” officers that triggered the search warrant of her house. On Tuesday, police searched Locklear’s home for the firearm that is said to be allegedly registered in her name, but they didn’t find it.\n\nRELATED VIDEO: Heather Locklear’s Boyfriend Charged with a DUI Hours After Her Felony Domestic Battery Arrest\n\nHours after her arrest, Heisser was arrested for DUI. It is not clear if he has entered a plea.\n\nMeanwhile, since her arrest, Locklear has sought help for her battle with addiction. “Heather is in treatment for addiction,” a friend of the actress told PEOPLE. “Everyone hopes she gets well, that she gets better.”\n\n“Addiction is obviously a strong disease and as much as friends and family who love her and want her to get better and be happy, no one can do the work for her,” added the friend. “Hopefully she is getting the help she needs.”\n\nImage zoom Heather Locklear Paul Archuleta/FilmMagic\n\nLocklear has struggled with substance abuse in the past, and this isn’t her first time in treatment. In March 2008, her doctor called 911 reporting that she was suicidal, and that June, she sought help for psychological issues. She left the Arizona facility after four weeks.\n\nThat September, the actress was arrested on suspicion of driving under the influence in California and was formally charged in November 2008 with driving under the influence of drugs. The misdemeanor charge filed by the DA’s office specified that the drugs in question were “prescription medications.” She completed a 30-day in-patient rehab program. However, in January 2009, the case was dismissed.\n\nAnd in 2012, she was hospitalized after a 911 call was placed from her home, reportedly after she ingested a mixture of drugs and alcohol. After she was discharged, she went “under a doctor’s care” but did not head to in-patient rehab, a source told PEOPLE.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fheather-locklear1-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fheather-locklear1-1.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fheather-locklear-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fheather-locklear-boyfriend.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fheather-locklear-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fheather-locklear1-1.jpg", "keywords": [], "authors": ["Dave Quinn", "Maria Pasquini"], "canonical_link": "https://people.com/tv/heather-locklear-allegedly-told-cops-their-kids-deserve-to-die-during-arrest/", "title": "Heather Locklear Allegedly Told Cops Their Kids 'Deserve to Die' During Arrest", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Crime News,Heather Locklear,News,TV", "news_keywords": "Crime News,Heather Locklear,News,TV", "description": "Heather Locklear reportedly told police that on the night of her felony domestic battery arrest, her boyfriend had choked her and attempted to kill her", "og": {"title": "Heather Locklear Allegedly Told Cops Their Kids 'Deserve to Die' During Arrest", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/heather-locklear-allegedly-told-cops-their-kids-deserve-to-die-during-arrest/", "description": "The night 56-year-old actress&nbsp;Heather Locklear was arrested&nbsp;on suspicion of felony domestic battery and three counts of battery on a police officer, she told police her&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fheather-locklear1-1.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/heather-locklear-allegedly-told-cops-their-kids-deserve-to-die-during-arrest/", "description": "Heather Locklear reportedly told police that on the night of her felony domestic battery arrest, her boyfriend had choked her and attempted to kill her", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fheather-locklear1-1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/heather-locklear-allegedly-told-cops-their-kids-deserve-to-die-during-arrest/", "title": "Heather Locklear Allegedly Told Cops Their Kids 'Deserve to Die' During Arrest", "description": "Heather Locklear reportedly told police that on the night of her felony domestic battery arrest, her boyfriend had choked her and attempted to kill her", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fheather-locklear1-1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}