{"url": "us.pressfrom.com/news/entertainment/-144004-what-melanie-griffith-really-thinks-about-daughter-dakota-johnson-dating-chris-martin/", "text": "Texas student defends merit of Harvard acceptance after question from former state official A former Texas state official this week questioned a biracial California high school student's Harvard acceptance.Drake Johnson tweeted a photo of himself on Wednesday holding his Harvard acceptance letter and sporting the Ivy League university's sweatshirt, adding: \"It's official, I'm Harvard bound. What Melanie Griffith Really Thinks About Daughter Dakota Johnson Dating Chris Martin . The Working Girl star, 60, opened up about her daughter ’s romance with the Coldplay frontman on Thursday when asked if she gave the Fifty Shades of Grey star any dating advice when it came to Melanie Griffith 'Adores' Daughter Dakota 's Beau Chris Martin . The Working Girl star, 60, opened up about her daughter ’s romance with the Coldplay frontman on Thursday when asked if she gave the Fifty Shades of Grey star any dating advice when it came to her relationship with Martin .\n\n© John Salangsang/BFA/REX/Shutterstock Melanie Griffith Melanie Griffith is over the moon about her daughter Dakota Johnson‘s beau Chris Martin.\n\n\n\nThe Working Girl star, 60, opened up about her daughter’s romance with the Coldplay frontman on Thursday when asked if she gave the Fifty Shades of Grey star any dating advice when it came to her relationship with Martin.\n\n“I adore him!” Griffith said while at the Global Gift Foundation USA Women’s Empowerment Luncheon. “But she is very private about her life and I respect that.”\n\nJohnson and Martin sparked dating rumors after being spotted on a mid-October sushi date in Los Angeles.\n\nOff-duty Arkansas police officer killed inside his home\n\nAn Arkansas police officer was shot and killed inside his own home Saturday, officials said. Forrest City Police Officer Oliver Johnson, Jr. was inside his home just before 2 p.m. in West Memphis, Ark., when an unidentified person unleashed a spray of bullets at his home, FOX13 Memphis reported. Neighbors said there were children inside the home, including Johnson’s daughter. \"They hit the apartment. They hit the car. They hit the whole place up,\" one resident who witnessed the shooting told FOX13.Johnson died after being struck by a bullet.\n\nMelanie Griffith gushed over her daughter Dakota Johnson 's boyfriend, Chris Martin , on Thursday, May 10 — details. Us broke the news in December 2017 that Johnson , 28, and the Coldplay frontman, 41, are dating . “They’ve gotten to know each other really well and are very comfortable Melanie Griffith (L), pictured with Dakota Johnson , approves of Johnson 's relationship with Coldplay singer Chris Martin . She was first linked to Martin in October, with Us Weekly later reporting the pair were dating . \"They've gotten to know each other really well and are very comfortable with one another.\n\nThe two were “cozy, laughing and affectionate” a source said at the time, adding it was just the two of them enjoying dinner.\n\n© Provided by TIME Inc.\n\nThe spent time together earlier this year while in Malibu with a different source telling PEOPLE, “They had dinner with friends. They also hung out at Chris’ house and went for a beach walk. They didn’t see each other over the holidays and seem to be catching up now.”\n\nMartin and Johnson were later seen grabbing food and drinks at Soho House in Malibu, where they were snapped smiling and laughing together. An eyewitness told PEOPLE, “Chris and Dakota arrived together in Chris’ car. They met up with friends and had a fun night. They both seemed very happy. They were flirty, and also left the restaurant together.”\n\nInside Colton Haynes and Jeff Leatham’s Whirlwind 6-Month Marriage and Divorce\n\nAre Colton Haynes and Jeff Leatham Splitting Up After 6 Months of Marriage? Just six months after their wedding, things are not looking good for Colton Haynes and Jeff Leatham Colton Haynes and husband Jeff Leatham have broken up after six months of marriage. The Arrow star, 29, filed for divorce on Tuesday, citing irreconcilable differences. The pair tied the knot on Oct. 27, 2017, in a star-studded ceremony officiated by Kris Jenner at a Palm Springs hotel. The actor, who publicly came out as gay in early 2016, first revealed he was dating Leatham, 46, on Valentine’s Day 2017. Then one month later, the celebrity florist proposed while on vacation in Cabo San Lucas, Mexico. RELATED GALLERY: All the Photos from Colton Haynes & Jeff Leatham’s Star-Studded Wedding How They Met Shortly before the wedding, Haynes and Leatham told PEOPLE that they were actually set up by mutual friend Serena Williams years ago, but the scheduling of their first date never worked out. “At the time, I was in Vancouver shooting Arrow, and Jeff was still living permanently in Paris and hadn’t started living in Los Angeles,” Haynes said. “We were going to meet up for a date, but we ended up not being able to. And then years went by.” However, a chance run-in at a Paris airport led to what Leatham, at the time, called “love at first sight.\n\nDakota Johnson and Chris Martin 's dating history and relationship timeline - from meeting in October 2017 to the present day. \"It got to the point, last month, where a light seemed to flick on in both their heads and they realised they were pulling in completely opposite directions - so they decided to call it Approving: Melanie Griffith spoke about daughter Dakota Johnson 's romance with Chris Martin at a Women's Empowerment Luncheon on Thursday There have not been many pictures released of the pair together, but a source told Entertainment Tonight: 'They’ve been dating since early October and\n\nMore recently, the two attended Ellen DeGeneres’ 60th birthday party together in February. The pair were photographed holding hands as they caught up with Drew Barrymore outside of the bash.\n\nWhile love seems to be in the air for Johnson, it’s also strong with Griffith despite her separation from Antonio Banderas in December 2015.\n\nBanderas told People Now in April even though they were divorced, Griffith “is my family and I will love her until the day I die.”\n\nGriffith tells PEOPLE the feeling is mutual, saying, “I will always love him and he will always love me. We had a great 20 years together.”\n\nAs for how she’ll spend her Mother’s Day this weekend, the mother of three says, “With all the kids and my mom!” Her mother Tippi Hedren, who starred in the Alfred Hitchcock classics The Birds and Marnie, is 88.\n\nRelated video: Antonio Banderas' Heartfelt Words on Ex-Wife Melanie Griffith: 'I'll Love Her Until the Day I Die':", "images": ["http://us.pressfrom.com/upload/images/small/2020/04/14/21-year-old-upstate-man-sexually-assaulted-89-year-old-woman-before-killing-her-warrant-says__958326_.jpg", "https://static.pressfrom.info/upload/images/small/2020/04/10/chynna-rogers-died-of-accidental-drug-overdose-philadelphia-public-health-department-says__587685_.jpg", "http://us.pressfrom.com/upload/images/small/2020/04/16/how-to-track-your-coronavirus-stimulus-check-today-what-we-know-right-now__970162_.jpg", "http://us.pressfrom.com/upload/images/real/2018/05/11/melanie-griffith-standing-posing-for-the-camera__858672_.jpg?content=1", "http://pressfrom.info/upload/images/real/2018/05/11/what-melanie-griffith-really-thinks-about-daughter-dakota-johnson-dating-chris-martin__606640_.jpg", "https://static.pressfrom.info/upload/images/small/2020/04/07/khloe-kardashian-not-dating-i-may-never-date-again__218037_.jpg", "http://us.pressfrom.com/upload/images/small/2020/04/15/in-unprecedented-move-treasury-orders-trump-s-name-printed-on-stimulus-checks__714439_.jpg", "http://us.pressfrom.com/img/no_img/flip/no_img_340x220-3.jpg", "https://static.pressfrom.info/upload/images/small/2020/04/13/andrea-bocelli-performs-live-from-milan-cathedral-on-easter-sunday__961860_.jpg", "https://static.pressfrom.info/upload/images/small/2020/04/16/these-lgbtq-books-are-changing-the-literary-landscape-in-2020__508703_.jpg", "http://us.pressfrom.com/img/logo-pressfrom-1.png", "https://static.pressfrom.info/upload/images/small/2020/04/15/george-et-amal-clooney-le-cadeau-hors-de-prix-offert-a-leurs-jumeaux-ella-et-alexander__806438_.jpg", "http://us.pressfrom.com/img/default_news.jpg", "https://static.pressfrom.info/upload/images/real/2020/04/16/how-to-track-your-coronavirus-stimulus-check-now-heres-what-to-do__374934_.jpg", "http://us.pressfrom.com/upload/images/small/2020/04/15/reward-increased-in-1985-case-of-social-worker-dorothy-estep-found-in-dead-car-trunk__750058_.jpg", "https://static.pressfrom.info/upload/images/small/2020/04/11/debunking-the-weeks-tabloid-stories-april-10-2020__660785_.jpg", "https://static.pressfrom.info/upload/images/real/2020/04/13/andrea-bocelli-performs-live-from-milan-cathedral-on-easter-sunday__961860_.jpg", "https://static.pressfrom.info/upload/images/small/2020/04/16/celebrities-react-to-the-passing-of-brian-dennehy__845272_.jpg", "http://us.pressfrom.com/upload/images/real/2018/05/10/inside-colton-haynes-and-jeff-leatham-s-whirlwind-6-month-marriage-and-divorce__521639_.jpg", "http://us.pressfrom.com/upload/images/real/2020/04/14/gov-gavin-newsom-names-six-goals-that-must-be-met-to-lift-california-coronavirus-order__471291_.jpg", "http://us.pressfrom.com/upload/images/small/2020/04/15/direct-deposit-and-your-coronavirus-stimulus-payment-how-to-set-it-up-with-the-irs__450543_.jpg", "http://us.pressfrom.com/img/no_img/content/no_img_content_flip.jpg", "http://us.pressfrom.com/upload/images/real/2018/04/21/texas-student-defends-merit-of-harvard-acceptance-after-question-from-former-state-official__170303_.jpg", "https://static.pressfrom.info/upload/images/small/2020/04/11/producer-aaron-kaplan-accused-of-installing-camera-aimed-at-sister-in-law-s-closet__191973_.jpg", "http://us.pressfrom.com/upload/images/real/2018/04/29/off-duty-arkansas-police-officer-killed-inside-his-home__645186_.jpg", "http://us.pressfrom.com/upload/images/small/2020/04/15/it-was-a-regular-poker-game-among-8-friends-within-weeks-coronavirus-killed-3-and-infected-all__899051_.jpg"], "top_img": "http://pressfrom.info/upload/images/real/2018/05/11/what-melanie-griffith-really-thinks-about-daughter-dakota-johnson-dating-chris-martin__606640_.jpg", "keywords": [], "authors": [], "canonical_link": "http://pressfrom.info/news/entertainment/-144004-what-melanie-griffith-really-thinks-about-daughter-dakota-johnson-dating-chris-martin.html", "title": "Entertainment What Melanie Griffith Really Thinks About Daughter Dakota Johnson Dating Chris Martin", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "og": {"title": "What Melanie Griffith Really Thinks About Daughter Dakota Johnson Dating Chris Martin", "type": "article", "url": "http://pressfrom.info/news/entertainment/-144004-what-melanie-griffith-really-thinks-about-daughter-dakota-johnson-dating-chris-martin.html", "site_name": "PressFrom - US", "description": "Texas student defends merit of Harvard acceptance after question from former state official \n\n \n \t\n\n\nA former Texas state official this week questioned a biracial California high school student", "image": "http://pressfrom.info/upload/images/real/2018/05/11/what-melanie-griffith-really-thinks-about-daughter-dakota-johnson-dating-chris-martin__606640_.jpg"}, "description": "What Melanie Griffith Really Thinks About Daughter Dakota Johnson Dating Chris Martin : Texas student defends merit of Harvard acceptance after question from former state official..."}, "movies": [], "publish_date": null, "source": "http://us.pressfrom.com", "summary": ""}