{"url": "http://toofab.com/2017/05/12/inside-what-happens-at-the-abbey-party-ep-cast-on-who-actually-works-there-vanderpump-rules/", "text": "Reality dramas based on the staff at some of Los Angeles' hottest bars are a hit that no one can deny enjoying, and E! is joining the party with this weekend's premiere of \"What Happens at The Abbey.\"\n\nNestled in the center of arguably the hottest block of West Hollywood, The Abbey Bar and Restaurant is known for being a go-to spot for those who enjoy a night of fun alongside go-go boys and triple olive martinis. The world famous gay bar opened in 1991 and still reigns as one of the top nightlife locations in all of Los Angeles. \"What Happens at The Abbey\" follows the lives of 14 Abbey employees as they embark on careers in Hollywood beyond the bar.\n\nTooFab was invited to a cocktail party at The Abbey, where the stars of E's new show mingled and dished on why this show is so not a decaf version of \"Vanderpump Rules.\"\n\nAlmost all of the 250 + member staff of The Abbey auditioned to be part of the upcoming reality series, which executive producer Ray Giuliani said was discussed for the first time almost two years ago.\n\n\"The first conversations started two years ago. People had approached [owner] David Cooley many times over the years to do a show and he never felt the time was right.\"\n\n\"So we finally started to do it. We interviewed everybody at The Abbey that wanted to be on the show and figured out who our people were.\"\n\nThat cast includes gay, straight and lesbian Abbey employees who told TooFab what makes this bar THE place to hang out, and why their show is a lot less dramatic than \"Vanderpump Rules.\"\n\n“I think one thing for sure is that The Abbey is super fast paced and super funny,\" said Marissa Chykirda, [pictured below] the spunky long island hostess and newest member of The Abbey family. \"Yeah there’s drama – but people are really funny on this show. I think 'Vanderpump' in one sense is very melodramatic but this is fast paced, high intensity and really funny.\"\n\nNBC\n\nLisa Vanderpump's hit Bravo series is taped at SUR restaurant and lounge, which is just down the block from The Abbey. Though natural competition is something that can be expected, Giuliani told TooFab that the biggest different between the shows is that the E! series is set up with a cast of wannabe Hollywood stars.\n\n“I love Lisa and 'Vanderpump Rules.' Vanderpump as a show, you can't deny it's appeal,\" he said. \"What I think is different is that all of the people that work here have a Hollywood dream. When David hires people, he hires stars. The way he goes through his interview process is 'Who's the star? Who’s the next big one?'\"\n\nNBC\n\n\"I think that as well as the people here trying to figure out their sexual identity plays a big part in our show. The Abbey is a gay bar, and now there’s a lot of straight people who work here, who come here to party… and in this day and age that’s what happens, things start to mix and people start to figure out what they’re doing and it’s a judgment free zone,\" Guiliani told TooFab.\n\nOf course any reality show especially those set in or around a business raise questions of authenticity. So naturally one of the most notable questions that arose when the first trailer dropped for \"What Happens at The Abbey\" was \"do all the cast members actually work there?\"\n\nBut the cast at \"The Abbey\" told TooFab that claims that they don't all actually work at the bar are false.\n\nNBC\n\n\"There’s no way you’re coming in for every shift. The majority of people who come in come in after 9, they are already drunk so you see a few of the dancers and a bartender,\" said Billy Reilich, [pictured above] the studly Abbey employee who is most known as \"Nick the Gardner\" on \"The Ellen DeGeneres Show.\"\n\nAnd for people who think working at The Abbey is just like any ole bartending or serving gig, they may not realize that it takes special qualities to succeed at a popular Los Angeles hotspot. VIP Host Murray Swanby [pictured below] said it's all about bringing conversation and personality to each guest.\n\n\"A good VIP host has to be very social and very personable. You have to be able to hold a good conversation with somebody easily – that’s probably the most important thing. Our job is to meet everybody coming in the door and being able to carry on a conversation with them,\" Swanby told TooFab.\n\nNBC\n\n“I think the cool part about The Abbey is I think for people that watch E! is that you can come in, and you’re sitting next to a celebrity, doing shots and you rub elbows with celebrities here. They come here because they want to party, it’s the party they want to go to,\" said Guliani.\n\n“A gay neighborhood becomes a straight neighborhood; everybody mixes together because that’s where the world is. You don’t have to go a gay bar – everybody goes everywhere and that’s great. The Abbey is the world greatest gay bar, there’s no doubt about it… but it’s very accepting of everybody.”\n\n\"What Happens At The Abbey\" airs this Sunday at 10/9c on E!\n\nNBC\n\nView Photos NBC/Universal", "images": ["https://ll-assets.tmz.com/www.tmz.com/main/default/cache/images/feedlogo2.v2014_05_09_134122.gif", "https://toofab.akamaized.net/2017/05/10/abbey-main-1200x630.jpg", "https://assets.toofab.com/toofab.com/main/default/img/toofab-logo-white.svg", "https://ll-media.tmz.com/2013/04/26/partner-rss-thestir-logo-cut-v2-1.png", "https://assets.toofab.com/toofab.com/main/default/img/skeleton.svg", "https://toofab.akamaized.net/2017/05/10/abbey-inset-1.jpg", "https://toofab.akamaized.net/2019/04/06/elite-daily-logo-1.png", "https://toofab.akamaized.net/2017/05/10/abbey-inset2-810x610.jpg", "https://toofab.akamaized.net/2017/05/10/abbey-inset3-810x610.jpg", "https://ll-media.tmz.com/2013/04/26/partner-rsss-justjared-logo-cut-v2.gif", "https://ssl-cdn-media.tmz.com/2013/04/26/partner-rss-fox-b-w.png", "https://toofab.akamaized.net/2019/04/06/cdl-260x30-for-tmz3-1.png", "https://toofab.akamaized.net/2018/12/19/newsletter-logo-v2-1.png", "https://toofab.akamaized.net/2017/05/10/abbey-inset5-1.jpg", "https://toofab.akamaized.net/2017/05/10/abbey-inset4-810x610.jpg"], "top_img": "https://toofab.akamaized.net/2017/05/10/abbey-main-1200x630.jpg", "keywords": [], "authors": ["Toofab Staff"], "canonical_link": "https://toofab.com/2017/05/12/inside-what-happens-at-the-abbey-party-ep-cast-on-who-actually-works-there-vanderpump-rules/", "title": "Inside 'What Happens at the Abbey' Party: EP, Cast on Who Actually Works There, 'Vanderpump Rules' Comparisons", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "twitter": {"toofab": 116547240, "card": "summary_large_image", "site": "@toofab", "title": "Inside 'What Happens at the Abbey' Party: EP, Cast on Who Actually Works There, 'Vanderpump Rules' Comparisons", "description": "TooFab dishes with EP Ray Giuliani, Marissa Chykirda, Billy Reilich and Murray Swanby of E!'s new reality show.", "image": "https://toofab.akamaized.net/2017/05/10/abbey-main-1200x630.jpg"}, "verify-v1": "Wtpd0N6FufoE2XqopQJoTjWV6Co/Mny9BTaswPJbPPA=", "msvalidate.01": "AFEB17971BCF30779AEA662782EF26F4", "y_key": "14cb04e4656b0c58", "description": "TooFab dishes with EP Ray Giuliani, Marissa Chykirda, Billy Reilich and Murray Swanby of E!'s new reality show.", "robots": "index,follow", "referrer": "unsafe-url", "og": {"url": "https://toofab.com/2017/05/12/inside-what-happens-at-the-abbey-party-ep-cast-on-who-actually-works-there-vanderpump-rules/", "site_name": "toofab", "type": "article", "title": "Inside 'What Happens at the Abbey' Party: EP, Cast on Who Actually Works There, 'Vanderpump Rules' Comparisons", "description": "TooFab dishes with EP Ray Giuliani, Marissa Chykirda, Billy Reilich and Murray Swanby of E!'s new reality show.", "image": "https://toofab.akamaized.net/2017/05/10/abbey-main-480x360.jpg"}, "fb": {"app_id": 116046798441464, "pages": 324392354652}, "article": {"publisher": "https://www.facebook.com/TooFab"}}, "movies": ["https://www.youtube-nocookie.com/embed/KnxmyJLoywU", "https://www.youtube-nocookie.com/embed/wlqrFwwhMt8"], "publish_date": 1494518400.0, "source": "http://toofab.com", "summary": ""}