{"url": "www.harpersbazaar.com/culture/film-tv/a20677247/lifetime-prince-harry-meghan-markle-movie-recap/", "text": "With less than a week until Prince Harry weds Meghan Markle, Lifetime adapted the couple's love story into a film aptly titled Harry & Meghan: A Royal Romance.\n\nAiring last night, the movie depicted the relationship timeline of Harry and Meghan—from the factual public moments and milestones to the probably less accurate (and more dramatic) behind-the-scenes love story. While the movie did include real life events from Meghan and Harry's relationship (including their first blind date and whisking away to Botswana), there were also some...ahem...harder-to-believe plot-lines thrown in as well.\n\nThough the film's stars, Parisa Fitz-Henley [Meghan] and Murray Fraser [Harry], resembled their real-life counterparts pretty well, there were several scenes that you can bet almost certainly didn't occur—no matter how accurate the cast's resemblance was.\n\nBelow, we're breaking down the dramatic, very Lifetime-y moments of the movie that probably, absolutely, most definitely did not happen in real life.\n\n1) Harry and Meghan almost got attacked by a lion in Africa.\n\nOn a trip to Botswana around the 20th anniversary of Princess Diana's death, the couple is dramatically confronted by an angry lion when they run outside in the middle of the night after a fight. The near-death experience, of course, causes them to make up immediately. Honestly, I can't believe this whole scene isn't already a Taylor Swift song.\n\n2) Meghan tried to break up with Harry via FaceTime, only to have him surprise her on set of Suits at the SAME exact moment.\n\nOkay, first of all, you honestly can't expect me to believe that this woman tried to break up with AN ACTUAL PRINCE via FaceTime. That's just not how this game works. On top of that, the moment she decides to end things with him is the same moment he's knocking on the door of her Suits trailer for a surprise visit to Toronto? I'm going to need the receipts on this one.\n\n3) Meghan breaks up with Harry A SECOND TIME before dramatically running to stop his plane from taking off when she comes to her senses.\n\nIT'S ALL TEW MUCH. NOBODY BREAKS UP WITH A PRINCE THIS MANY TIMES. Spoiler alert: she of course gets to his plane on time and is somehow miraculously able to stop the private royal jet from taking off. All that was missing from this scene was a thunderstorm moment filmed in the pouring rain.\n\n4) The couple dressed up as a frog and Hillary Clinton for a Halloween party...\n\nWhile the two were secretly dating, Harry dressed up in a frog suit (get it, the frog becomes Prince Charming?) to go \"in disguise\" at a Halloween party. Meghan, meanwhile, dressed as Hillary Clinton (because all feminists must be HRC for Halloween), making for the most awkward couples costume of all time. While it's unclear if the Soho House party in question actually occurred, I'm giving Harry and Meghan the benefit of the doubt that they would choose better costumes if said party did go down.\n\nLifetime\n\n5) Kate Middleton's intense criticism and attitude toward Meghan Markle.\n\nFor whatever reason, Lifetime decided to portray the Duchess of Cambridge as a super snooty and cold character with plenty of criticism to dish out for Meghan. When William first tells Kate that Harry's dating an American girl (he actually reveals this by saying Harry \"Botswana-ed\" Meghan, a term that I'm willing to bet is not in William's vocabulary), Kate's response is, \"Oh no, they're so loud.\"\n\nWhile I'd be willing to overlook that slightly shady dig, later in the movie Kate tells Harry, \"If she’s your girl, she can’t have opinions\" before adding, \"She’s divorced, she’s American, she’s half-black….are you ready for this? Think of what we went through because I was a commoner.\"\n\nUm, I'm calling BS—I find it VERY hard to believe this was an exchange that ever took place. In fact, Kate and Meghan are reportedly pretty close now and have appeared at public events together alongside Prince William and Prince Harry. I'm sensing there was never any bad blood here...\n\nGetty Images\n\nWhat I would be here for, however, is a sequel movie depicting the friendship between Kate and Meghan following the royal wedding next weekend. Your move, Lifetime.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-a-royal-romance-movie-00-index-1525371262.jpg?crop=1xw:1xh;center,top&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-a-royal-romance-movie-00-index-1525371262.jpg?crop=1xw:1xh;center,top&resize=1200:*", "keywords": [], "authors": ["Lauren Alexis Fisher", "Market Editor", "Lauren Alexis Fisher Is Harper'S Bazaar.Com'S Market Editor."], "canonical_link": "https://www.harpersbazaar.com/culture/film-tv/a20677247/lifetime-prince-harry-meghan-markle-movie-recap/", "title": "The Scenes From Lifetime's 'Harry and Meghan' Movie That Probably Didn't Happen In Real Life", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#606060", "og": {"type": "article", "site_name": "Harper's BAZAAR", "title": "The Scenes From Lifetime's 'Harry and Meghan' Movie That Probably Didn't Happen In Real Life", "description": "Calling BS on these very Lifetime-y plot-lines from 'Harry & Meghan: A Royal Romance.'", "url": "https://www.harpersbazaar.com/culture/film-tv/a20677247/lifetime-prince-harry-meghan-markle-movie-recap/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-a-royal-romance-movie-00-index-1525371262.jpg?crop=1xw:1xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "modified_time": "2018-05-15 05:22:47", "published_time": "2018-05-14 02:08:00", "section": "Film, TV & Theatre", "opinion": "false"}, "twitter": {"site": "@harpersbazaarus", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-a-royal-romance-movie-00-index-1525371262.jpg?crop=1xw:1xh;center,top&resize=640:*"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "title": "Harry & Meghan: A Royal Romance Lifetime Movie Fact Check & Recap", "description": "A look at the harder-to-believe moments in Lifetime's movie about Prince Harry and Meghan Markle's relationship.", "keywords": "prince harry and meghan markle, prince harry meghan markle lifetime movie, harry and meghan a royal romance, lifetime harry and meghan movie, prince harry meghan markle relationship, harry and meghan movie", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-a-royal-romance-movie-00-index-1525371262.jpg?crop=0.5xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Culture,culture,film-tv", "sailthru.date": "2018-05-14T14:08:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-a-royal-romance-movie-00-index-1525371262.jpg?crop=1xw:1xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-a-royal-romance-movie-00-index-1525371262.jpg?crop=0.5xw:1xh;center,top", "sailthru.socialtitle": "The Scenes From Lifetime's 'Harry and Meghan' Movie That Probably Didn't Happen In Real Life", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1526234880.0, "source": "http://www.harpersbazaar.com", "summary": ""}