{"url": "http://theboot.com/2018-acm-awards-attendees-wearing-gold-pins-in-honor-of-route-91-victims/", "text": "During the 2018 ACM Awards on Sunday night (April 15), artist and country music industry members will be wearing gold pins with the numbers 851, 58 and 1. The initiative is a way to honor the victims of the Route 91 Harvest Festival shooting.\n\nIt's unclear where the gold pin initiative started, but each number carries its own significance: 851 is for the 851 people injured during the shooting on Oct. 1 at the 2017 Route 91 Harvest Festival in Las Vegas, Nev.; 58 is for the 58 people who were killed during the tragedy; and 1 represents unity.\n\n\"You are with us every single night in every single town,\" explains a card about the gold pin initiative. \"#FansFirst #VegasStrong\"\n\nFans can expect to see many 2018 ACM Awards attendees donning the gold pins, both on the red carpet and during the awards ceremony. Rising star Jillian Jacqueline writes on Instagram that she is \"proud\" to be part of the movement.\n\nRemembering the Victims of the Route 91 Harvest Festival Shooting\n\n\"We can’t go back in time, but we can move forward with resilience. and the healing power of music is going to prove itself again and again,\" Jacqueline writes. \"Life is a precious thing that goes by all too fast ... and when someone’s is taken from them too soon, i can only believe that it’s our responsibility to lift their memory up with love as much as we can.\"\n\nThe 2018 ACM Awards ceremony will include an onstage tribute to the victims of the Route 91 Harvest Festival shooting as well. The show's producers have indicated that the moment will open the awards show, and that they worked with Jason Aldean -- who was onstage at Route 91 when the shooting began -- to put the tribute together. During rehearsals for the ceremony, Aldean and Thomas Rhett visited with survivors of the shooting.\n\nThe 2018 ACM Awards are set to air live on CBS beginning at 8PM ET. Reba McEntire will be hosting the show.\n\nThe Boot will be staying up late covering the most buzzed-about winners, fashion and moments at the 2018 ACM Awards. Readers can watch along with us by checking back to TheBoot.com for the latest ACMs headlines, liking The Boot on Facebook and following The Boot on Twitter.\n\nSee Photos From 2018 ACM Awards Rehearsals", "images": ["https://townsquare.media/site/623/files/2017/10/route-91-harvest-festival-vigil-las-vegas-1.jpg?w=600&h=0&zc=1&s=0&a=t&q=89", "https://sb.scorecardresearch.com/p?c1=2&c2=6665296&cv=2.0&cj=1", "http://townsquare.media/site/623/files/2017/10/theboot-logo.png"], "top_img": "https://townsquare.media/site/623/files/2017/10/route-91-harvest-festival-vigil-las-vegas-1.jpg?w=600&h=0&zc=1&s=0&a=t&q=89", "keywords": [], "authors": ["Angela Stefano"], "canonical_link": "https://theboot.com/2018-acm-awards-attendees-wearing-gold-pins-in-honor-of-route-91-victims/", "title": "2018 ACM Awards Attendees Wearing Gold Pins in Honor of Route 91 Victims", "meta_data": {"instagram_profile": "theboot_dotcom", "description": "Artists and country music industry members will be wearing gold pins at the 2018 ACM Awards in honor of the victims of the Route 91 Harvest Festival shooting.", "keywords": "2018 acm awards pins, 2018 acm awards route 91 pins, 2018 acm awards gold pins, 2018 acm awards 851 pins, 2018 acm awards 58 pins, 2018 acm awards 1 pins, 2018 acm awards number pins", "fb": {"app_id": 151086041747752, "admins": 59877105906, "pages": 59877105906}, "og": {"title": "2018 ACM Awards Attendees Wearing Gold Pins in Honor of Route 91 Victims", "description": "Artists and country music industry members will be wearing gold pins at the 2018 ACM Awards in honor of the victims of the Route 91 Harvest Festival shooting.", "url": "https://theboot.com/2018-acm-awards-attendees-wearing-gold-pins-in-honor-of-route-91-victims/", "site_name": "The Boot", "type": "article", "image": "https://townsquare.media/site/623/files/2017/10/route-91-harvest-festival-vigil-las-vegas-1.jpg?w=600&h=0&zc=1&s=0&a=t&q=89"}, "twitter": {"card": "summary_large_image", "site": "@thebootdotcom"}, "sailthru.description": "Artists and country music industry members will be wearing gold pins at the 2018 ACM Awards in honor of the victims of the Route 91 Harvest Festival shooting.", "sailthru.date": "2018-04-15 23:45:52", "sailthru.title": "2018 ACM Awards Attendees Wearing Gold Pins in Honor of Route 91 Victims", "sailthru.tags": "tsmsite-theboot, tsmmarket-national, tsmtype-national, acm-awards, route-91-harvest-festival, acms, country-news", "sailthru.author": "astefano", "sailthru.image.full": "https://townsquare.media/site/623/files/2017/10/route-91-harvest-festival-vigil-las-vegas-1.jpg", "sailthru.image.thumb": "https://townsquare.media/site/623/files/2017/10/route-91-harvest-festival-vigil-las-vegas-1.jpg", "msvalidate.01": "38FB0DB5D97FA0CEE1853CB708082BF1", "google-site-verification": "43sWrlFmliAOb32082dqCQO4JAd-BH-caKisRgljqok", "viewport": "width=1286, initial-scale=1.0"}, "movies": [], "publish_date": 1523807152.0, "source": "http://theboot.com", "summary": ""}