{"url": "https://www.cbsnews.com/news/philadelphia-eagles-win-super-bowl-lii-nick-foles-mvp-2018/", "text": "The Philadelphia Eagles upset the New England Patriots 41-33 in Super Bowl LII Sunday night to grab the first Super Bowl crown in the team's history.\n\nPink sang the \"Star Spangled Banner\" before her favorite team, the Eagles, took the big stage on Super Bowl Sunday. Justin Timberlake headlined the Super Bowl halftime show and performed some of his hottest hits -- including a tribute to Prince.\n\nThe Patriots were 4-and-a-half point favorites to beat the Eagles on Sunday. If they'd won, they would have walked away with the franchise's sixth Super Bowl championship.\n\nPhilly fans celebrate after Eagles' Super Bowl win\n\nRead below the live updates as they happened night. All times Eastern Time unless otherwise noted.\n\nMonday, February 5\n\n1 a.m.: Swarms of fans rush Philly streets in celebration\n\nCBS Philadelphia reports thousands of fans have taken to the streets in Philadelphia to revel in their home team's win over the Patriots at Super Bowl LII.\n\nCBS Philly also reports that two light poles were damaged early Monday morning:\n\n. @GregArgosCBS3 reports two poles in Center City have been toppled during the #SuperBowl celebrations, leaving one seriously injured. https://t.co/oKESarSedm — CBS Philly (@CBSPhilly) February 5, 2018\n\n12:13 a.m.: NFL tweets a video of Super Bowl LII highlights\n\n12:04 a.m.: Eagles center Jason Kelce gets emotional\n\n\"I've officially accomplished the best thing in this sport with a group of guys that mean the world to me.\" An emotional Jason Kelce reflects on his journey in becoming a @SuperBowl champion. #FlyEaglesFly #SBLII pic.twitter.com/rJ3F075x9P — NFL (@NFL) February 5, 2018\n\nSunday, February 4\n\n11:20 p.m.: Philadelphia Mayor Jim Kenney releases statement about Eagles' victory\n\nFor so many who have called themselves Eagles fans for a generation, this is the day, the game, the season, and the team we've dreamed of. The 2017-18 Philadelphia Eagles are Super Bowl Champions, and they've brought tremendous joy to hundreds of thousands throughout the City and region. They consistently wowed us with their dynamic play and relentless pursuit of victory. Their \"Next Man Up\" mentality when injuries arose was inspiring to anyone who has ever faced a setback, as was their willingness to embrace the role of underdogs. They looked another storied football franchise in the eyes, and never blinked. So to every member of the Eagles, from owners Jeff and Tina Lurie, and Christina Weiss Lurie, to Howie Roseman and the entire front office staff, to Doug Pederson and his coaches, and to the players who won our hearts with their resilient and exciting play: thank you. You are champions, and your accomplishments will forever be part of the rich history of Philadelphia sports. To the fans: I have long felt that our City's professional and collegiate sports teams bring Philadelphians together, regardless of race, income, neighborhood or gender, and that was never more true than during the Eagles' brilliant season. We know you have waited years, some for decades, for the chance to crown your Birds as champs. I urge everyone to celebrate in a way that is safe and respectful to everyone from neighbors to strangers. Go forth and celebrate, but do so in a way that will make Philadelphia shine.\n\n10:37 p.m.: Philadelphia Eagles MVP\n\nEagles' quarterback Nick Foles named Most Valuable Player of the Super Bowl.\n\nNick Foles #9 of the Philadelphia Eagles celebrates after a 21-yard touchdown during the second quarter against the New England Patriots in Super Bowl LII at U.S. Bank Stadium on Sun., Feb. 4, 2018, in Minneapolis, Minn. Getty\n\nAnd check out this touching moment with Foles' daughter at the U.S. Bank Stadium following his team's win:\n\n10:34 p.m.: Eagles QB Nick Foles stats\n\nCourtesy of the NFL:\n\n10:30 p.m.: Fly Eagles Fly\n\nWhat an emotional night for the Philadelphia Eagles:\n\n10:26 p.m.: NFL tweets congratulatory messages for Eagles victory\n\n10:17 p.m.: Philadelphia Eagles win Super Bowl LII\n\n\n\nEagles, 41, Patriots 33. It was the first Super Bowl title for Philadelphia (16-3), which went from 7-9 last season to its first NFL crown since 1960.\n\n10:14 p.m.: Patriots 78 yards away from end zone\n\nThe clock is ticking in the fourth quarter ... with about 26 seconds left as the Eagles pull ahead.\n\n10:10 p.m.: Eagles score field goal\n\nEagles open their lead after a successful field goal. They are now ahead of the Patriots, 41-33. There is 1:05 left in the game.\n\n10:04 p.m.: Two-minute warning!\n\nEagles are leading Patriots 38-33\n\n10:02 p.m.: Fumble leads to Patriots' first turn over\n\nIt wasn't a pretty sight: a fumble cost the Patriots their first turn over with just about two minutes left in the fourth quarter.\n\nLook if you dare:\n\n9:59 p.m.: Eagles touchdown is complete\n\nOfficials rule Ertz was a runner and the call stands. Eagles now ahead of the Patriots, 38-33, with less than three minutes in the fourth quarter.\n\nHere's a replay:\n\n9:56 p.m.: Eagles score possible touchdown\n\nEagles tight end Zach Ertz completes a pass, but there's discussion whether he had control in the end zone. Officials are reviewing the play.\n\n9:51 p.m.: NFL tweets that there are nearly 68K fans in attendance\n\nBrian McCarthy of the NFL public relations team says that 67,612 fans were in attendance to watch Super Bowl LII Sunday night:\n\nWith 67,612 fans in attendance at #SB52, more than 4 million fans have attended Super Bowl games — Brian McCarthy (@NFLprguy) February 5, 2018\n\n9:45 p.m.: NFL tweets \"sideline cam\" of Gronk's catch\n\nAnd don't forget the Gronk spike at the end ...\n\n9:35 p.m.: Gronk leads Patriots to first lead of the game\n\nQB Brady passes Rob Gronkowski a throw for a touchdown, bringing the Patriots ahead of the Eagles, 33-32 -- after the extra score was a success in the fourth quarter.\n\nIf you missed it, here's a replay:\n\n9:25 p.m.: Field goal for Eagles\n\nEagles score three now leading 32-26.\n\n.@jake_elliott22's 42-yard FG is GOOD. The @Eagles extend their lead to 32-26. 14:09 left to the play in the @SuperBowl. #SBLII — NFL (@NFL) February 5, 2018\n\n9:24 p.m.: 4th quarter commences\n\nTom Brady has thrown for more than 400 yards for the second straight Super Bowl, and the New England Patriots are within three of the Philadelphia Eagles for the second time in the second half of the Super Bowl. Brady threw a 26-yard scoring pass to Chris Hogan, pushing him to 404 yards passing and getting the Patriots within 29-26 late in the third quarter. Brady set the Super Bowl record with 466 yards last year in Houston.\n\n9:22 p.m.: 3rd quarter scores\n\nAt the end of the third quarter, the Eagles lead Patriots 29-26.\n\n9:19 p.m.: 955 total yards so far this game\n\nNBC announcers said that a total of 955 yards have been run as of the third quarter.\n\nAnother stat: The all-time record for most passing yards in a Super Bowl was 466 (by Tom Brady!)\n\nEntering tonight, the all-time record for most passing yards in a #SuperBowl was 466. By Tom Brady. pic.twitter.com/ChMfKLf4VV — NFL (@NFL) February 5, 2018\n\n9:10 p.m.: Patriots' Hogan completes touchdown\n\n\n\nTom Brady throws a perfect pass to Chris Hogan for a touchdown. Eagles hold slight lead in third quarter 29-26.\n\n9:02 p.m.: The play stands, Eagles touchdown complete\n\nEagles now lead Patriots 29-19, after picking up the extra goal.\n\n8:58 p.m.: Eagles touchdown in 3rd quarter\n\nTwo officials confirmed the touchdown by running back Corey Clement, but the play is under review on whether he had control.\n\n8:54 p.m.: Super Bowl TV \"blackout\" due to \"brief equipment failure\"\n\nDead air time during the Super Bowl was because of a \"brief equipment failure that was quickly resolved,\" according to an NBC Sports spokesman Sunday. The program went black for about 20 seconds in the first half, but no game action or commercial time was missed, the spokesman said.\n\n8:45 p.m.: Patriots touchdown\n\nGronkowski catches a touchdown pass from Brady. The Eagles still lead 22-19.\n\n8:45 p.m.: NFL tweets timelapse of halftime show\n\nIn a rush? Watch below:\n\n8:41 p.m.: 2nd half commences\n\nThird quarter begins as the Eagles lead Patriots, 22 to 12.\n\n8:33 p.m.: Timberlake wraps up halftime show\n\nSinger finishes off his performance with \"Mirrors\" and \"Can't Stop the Feeling!\"\n\nJustin Timberlake performs during the Pepsi Super Bowl LII Halftime Show at U.S. Bank Stadium on Sun., Feb. 4, 2018, in Minneapolis. Getty\n\nWhat did you think?\n\nWhat did you think of @jtimberlake at halftime? #SuperBowl — CBS This Morning ❄️ (@CBSThisMorning) February 5, 2018\n\n8:28 p.m.: Timberlake sings tribute to Minnesota native Prince\n\nTimberlake sang \"I Would Die 4 U\" as an image of Prince was projected high above the crowd.\n\nCBS News' Jamie Yuccas snapped this image from the show:\n\nThere was also an image of the Minneapolis skyline blanketed in purple as a tribute to Prince.\n\nWhat a great view!\n\nFun to be on the field for halftime! pic.twitter.com/v0Gez3w9Kg — Jamie Yuccas (@jamieyuccas) February 5, 2018\n\n8:19 p.m.: Justin Timberlake kicks off halftime show\n\nNBC's Jimmy Fallon introduced singer Justin Timberlake who took the stage to perform hits like \"Filthy,\" \"Rock Your Body, \"SexyBack,\"My Love,\" \"Cry Me A River,\" \"Suit & Tie,\" Until The End Of Time.\"\n\nMost users on social media seem to enjoy the show, with some commenting though that the audio mix seemed off.\n\nJustin Timberlake performs during the Pepsi Super Bowl LII Halftime Show at U.S. Bank Stadium on Sun., Feb. 4, 2018, in Minneapolis, Minn. Getty\n\n8:15 p.m.: Preparations for Super Bowl Halftime show\n\nCBS News' Jamie Yuccas snaps a picture ahead of Justin Timberlake's performance.\n\n8 p.m.: Foles catches touchdown pass\n\nCompleting the play the Patriots couldn't, Nick Foles caught a touchdown pass from tight end Trey Burton on fourth down before the end of the second quarter. The gutsy play call puts the Eagles up 22-12.\n\n7:55 p.m.: Pats cut Eagles' lead with rushing TD\n\nWith momentum from the defense, Tom Brady and the Patriots drove up the field to set up James White's impressive 26-yard touchdown run. Eagles lead 15-12.\n\n— JC\n\n7:45 p.m.: Pats come up with major interception\n\nNick Foles threw the ball deep to Alshon Jeffrey, who couldn't keep control of the ball, and Duron Harmon came up with the interception. The play was Nick Foles' first turnover of the night.\n\n7:40 p.m.: Gostkowski hits 45-yard field goal\n\nTom Brady threw a 46-yard screen pass to Rex Burkhead, but the Eagle's defense holds Brady to a three and out, forcing the field goal attempt. Eagles lead 15-6.\n\n7:30 p.m.: Blount runs through defenders for a touchdown\n\nLeGarrette Blount ran through arm tackles and found himself in the end zone. The Eagles went for the 2-point conversation and failed. Eagles are up 15-3.\n\n7:20 p.m.: Cooks won't return after injury\n\nBrandon Cooks, one of Tom Brady's favorite receivers, was seen heading into the locker room with trainers after taking a big hit from Rodney McLeod. Cooks tried and failed to hurdle the defense back and got laid out. He lied motionless on the ground before exiting the game. He was later ruled out of the game.\n\n— JC\n\n7:12 p.m.: Gostkowski misses a field goal\n\nAfter a bad snap, Patriots kicker Stephen Gostkowski hits the upright on a missed field goal attempt. Eagles still up 9-3.\n\n— Justin Carissimo\n\n6:58 p.m.: Foles hits Jeffery for 34-yard touchdown\n\nNick Foles threw a 34-yard touchdown to Alshon Jeffery, giving the Eagles a 9-3 lead over the Patriots. However, the Eagles missed the extra point with a bad kick. There's 2:34 left in the first quarter.\n\n#Eagles lead 9-3 with 2:34 to go in the first quarter.#FlyEaglesFly — Philadelphia Eagles (@Eagles) February 5, 2018\n\n6:53 p.m.: Field goal success for Patriots\n\nPatriots are finally on the board with their first quarter score for a field goal. Game is tied up 3-3.\n\n6:41 p.m.: Field goal success for Eagles\n\nThe Philadelphia Eagles have settled for Jake Elliott's 25-yard field goal and a 3-0 lead over the New England Patriots on the opening drive of the Super Bowl.\n\nThe Eagles had a first down at the 5 after Corey Clement's 16-yard gain on a catch and run. But a penalty and two incomplete passes forced Philadelphia to settle for the field goal.\n\nThe Patriots will take over looking for their first points in the first quarter in eight Super Bowl appearances with quarterback Tom Brady.\n\nQuarterback Nick Foles had completions of 17 yards to Alshon Jeffery and 15 yards to Torrey Smith the play after Smith had a drop on second down.\n\n6:33 p.m.: No players seen kneeling during national anthem\n\nThere were no NFL players kneeling during Pink's performance of the \"Star Spangled Banner\" ahead of Super Bowl LII.\n\nNearly all of the Patriots stood in line with their right hands over their hearts.\n\n6:31 p.m.: Pats kick off\n\nPatriots give a line drive kick that begins Super Bowl LII.\n\n6:25 p.m.: Medal of Honor recipients honored, Pats win coin toss\n\nSixteen Medal of Honor recipients were on the field. One recipient from his service in World War II flipped the coin.\n\nThe New England Patriots have won the opening coin toss and have deferred to the second half.\n\nThe Philadelphia Eagles will start the game with the ball and hope to be the first team to score on the opening possession of the Super Bowl since Devin Hester returned the opening kickoff for a touchdown for Chicago against Indianapolis in the 2007 game.\n\n6:21 p.m.: Pink powers through the national anthem\n\n\n\nSinger Pink, despite having the flu, nailed the singing of the national anthem to kick off Super Bowl LII.\n\nSinger Pink sang \"The Star Spangled Banner\" before her favorite team, the Eagles, took on the Patriots. https://t.co/zYCA8Z5VvG pic.twitter.com/VNvNxTxoIr — CBS News (@CBSNews) February 4, 2018\n\n6:15 p.m.: Justin Timberlake won't use Prince hologram at Super Bowl\n\nSheila E. says Justin Timberlake reached out to her after she tweeted that Prince didn't want to be turned into a hologram and says she wants \"people to know there was no hologram.\" Her comments come after TMZ reported Saturday that Timberlake was set to use a hologram of Prince during his halftime know performance Sunday. But Sheila E. tells The Associated Press that Prince told her didn't want to be used as a hologram for religious reasons.\n\nTimberlake said he looked up to Prince and admired him during a press conference days ago in Minnesota. It was the same day the pop star held a listening party for his new album at Paisley Park.\n\nHolograms of A-list celebrities have appeared in recent years, from Tupac Shakur to Roy Orbison, whose hologram is set to go on a tour.\n\nIn an AP interview Saturday, Sting said he would not want to have his likeness portrayed in a hologram.\n\n\"I don't want to be hologrammed. I really don't. God knows who they will team me up with, you know. No. I'm going to write in my will that I am not to be hologrammed,\" he said.\n\n\"Roy wouldn't have even known about it,\" he added. \"How would he know?\"\n\n6:10 p.m.: Kelly Clarkson supports flu-stricken Pink\n\nKelly Clarkson says she's not worried about Pink nailing the national anthem at the Super Bowl despite having the flu.\n\nWhen asked if she would fill in for Pink if needed, Clarkson said, \"I don't think Pink will need anybody to fill in for her. Even Pink with the flu is still hands down one of the best vocalists of our generation.\"\n\nClarkson added: \"I would take Pink's voice on a flu day any day.\"\n\nWhat to expect at Super Bowl 52 when Pats face Eagles\n\nPink performed sick at a concert Friday in Minnesota and said it's easy to become under the weather when you're a mother of two children. Clarkson echoed her sentiments.\n\n\"Our babies are right in our face, like the saliva, the mucus membranes are all around us,\" she said. \"We both have toddlers and I mean, they're literally little petri dishes of disease walking, they just have everything. So we're sick sometimes.\"\n\nClarkson was one of the tailgate performances Sunday at Nomadic Live at The Armory. She said she enjoys performing for sports fans.\n\n\"The fun thing that you can always expect is it's never going to be a dead crowd because either A, they're drinking already or B, the energy of sports fans in general, they're just excited to be here (and) they're excited for their team,\" she said.\n\nThough Clarkson is a Dallas Cowboys fan, she said she's rooting for the Philadelphia Eagles over the New England Patriots.\n\n\"My nanny is a huge Eagles fan, so we're all Eagles today. And they're the underdog, right? So, you know, it's kind of cool,\" she said.\n\n6 p.m.: Trump brings up national anthem debate in Super Bowl LII message\n\nPresident Trump has once again called for football fans to stand during the playing of the National Anthem as a sign of support for the nation's troops.\n\nHe issued a statement from his Mar-a-Lago estate where he spent the weekend with first lady Melania Trump.\n\n\"As many Americans come together to watch the Super Bowl, Melania and I extend our greetings and appreciation for those who make occasions like this possible, particularly the brave men and women of our Armed Forces,\" Mr. Trump's statement read.\n\nTrump releases national anthem message ahead of Super Bowl\n\n5:55 p.m.: Protesters have been removed\n\nPolice in Minneapolis have removed protesters who locked themselves across a light-rail line near U.S. Bank Stadium, temporarily halting trains carrying fans to the Super Bowl.\n\nLive footage from the scene Sunday showed police working to unlock or cut locks the protesters had used at the stop near the University of Minnesota's West Bank station. That's about a half-mile from the stadium.\n\nThe footage showed protesters in zip ties waiting to board a bus to be carried from the scene.\n\nProtesters blocked the line shortly after 2 p.m., saying they were protesting police brutality as well as the light-rail line being turned over to Super Bowl fans for the day.\n\nMetro Transit was busing fans the rest of the way to the game.\n\n5:45 p.m.: Protesters shut off rail line serving Super Bowl\n\nA small group of activists protesting police brutality have shut down a light-rail line carrying fans to the Super Bowl in Minneapolis.\n\nAbout 30 activists walked onto the city's Green Line at the Stadium Village stop shortly after 2 p.m. Sunday, stopping trains in both directions.\n\nWATCH: Group of activists protesting police brutality shut down a light-rail line carrying fans to the Super Bowl in Minneapolis just hours before the game. https://t.co/dHvPLERXfc pic.twitter.com/v6QGdMczA0 — CBS News (@CBSNews) February 4, 2018\n\nThe line runs from downtown St. Paul to the heart of Minneapolis, and is a main way some fans are getting to the game between the New England Patriots and Philadelphia Eagles.\n\nChinyere Tutashinda, a spokeswoman for the activists, says some chained themselves along the track.\n\nMetro Transit spokesman Howie Padilla says the agency has contingency plans to get riders the rest of the way to U.S. Bank Stadium. He says he's confident they'll be there for kickoff.", "images": ["https://cbsnews2.cbsistatic.com/hub/i/r/2018/02/05/ef264706-d21f-4246-af38-8bcc6dfe855f/thumbnail/620x413/e113eae3f7a539e7449af6d44df4c2fa/gettyimages-914312466.jpg", "https://cbsnews1.cbsistatic.com/hub/i/r/2018/02/05/8c49e43a-ab3e-471a-a3f0-1381460f8097/thumbnail/1200x630/f47837b3a0651902c6d54b07e6c227c0/gettyimages-914311864.jpg", "https://cbsnews1.cbsistatic.com/hub/i/r/2018/02/05/30b860db-1cf8-4f42-805f-35454f8a569e/thumbnail/620x413g2/c19d12d960a1ded4e0c697460e14bbc6/gettyimages-914321866.jpg", "https://cbsnews2.cbsistatic.com/hub/i/r/2018/02/05/14e9d341-5821-42e3-920d-70eefc032b09/thumbnail/620x413/b7b2b20a96289cdeb500e8b68dd750e8/gettyimages-914319176.jpg", "https://cbsnews1.cbsistatic.com/hub/i/r/2019/11/19/186936ea-2db7-4a48-b750-74f38f653dc6/thumbnail/640x360/80fb8996993802606d5c971761bf5b42/newsletter-breakingnews.jpg"], "top_img": "https://cbsnews1.cbsistatic.com/hub/i/r/2018/02/05/8c49e43a-ab3e-471a-a3f0-1381460f8097/thumbnail/1200x630/f47837b3a0651902c6d54b07e6c227c0/gettyimages-914311864.jpg", "keywords": [], "authors": ["Peter Martinez"], "canonical_link": "https://www.cbsnews.com/news/philadelphia-eagles-win-super-bowl-lii-nick-foles-mvp-2018/", "title": "Super Bowl 2018: Eagles pull off stunning win over Patriots", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1, user-scalable=0", "robots": "index, follow", "description": "Philadelphia Eagles held off Tom Brady and New England Patriots, 41-33, for first Super Bowl title", "keywords": "super bowl lii, U.S. Bank Stadium, Brandon Cooks, minnesota, sports, Tom Brady, Super Bowl, U.S., new england patriots, Philadelphia Eagles, top stories, live updates, nick foles", "news_keywords": "super bowl lii, U.S. Bank Stadium, Brandon Cooks, minnesota, sports, Tom Brady, Super Bowl, U.S., new england patriots, Philadelphia Eagles, top stories, live updates, nick foles", "al": {"web": {"url": "https://www.cbsnews.com/news/philadelphia-eagles-win-super-bowl-lii-nick-foles-mvp-2018/"}, "ios": {"app_name": "CBS News", "app_store_id": 334256223, "url": "cbsnewsapp://cbsnews.com/news/philadelphia-eagles-win-super-bowl-lii-nick-foles-mvp-2018/"}, "android": {"app_name": "CBS News", "package": "com.treemolabs.apps.cbsnews"}}, "og": {"type": "article", "url": "https://www.cbsnews.com/news/philadelphia-eagles-win-super-bowl-lii-nick-foles-mvp-2018/", "title": "Super Bowl 2018: Eagles pull off stunning win over Patriots", "description": "Philadelphia Eagles held off Tom Brady and New England Patriots, 41-33, for first Super Bowl title", "image": {"identifier": "https://cbsnews1.cbsistatic.com/hub/i/r/2018/02/05/8c49e43a-ab3e-471a-a3f0-1381460f8097/thumbnail/1200x630/f47837b3a0651902c6d54b07e6c227c0/gettyimages-914311864.jpg", "width": 1200, "height": 630}, "video": {"url": "https://sportshq-mediapackage-fastly.cbsaavideo.com/out/v1/8c9954b696fc46d0ac5f3a224daf7dc0/index.m3u8", "secure_url": "https://sportshq-mediapackage-fastly.cbsaavideo.com/out/v1/8c9954b696fc46d0ac5f3a224daf7dc0/index.m3u8", "type": "application/x-mpegURL", "width": 1920, "height": 1080}}, "fb": {"app_id": 1536620209892267, "pages": 131459315949}, "article": {"publisher": "https://www.facebook.com/CBSNews", "content_tier": "free", "opinion": "false"}, "twitter": {"dnt": "on", "app": {"country": "US", "name": {"iphone": "CBS News", "ipad": "CBS News", "googleplay": "CBS News"}, "id": {"iphone": 334256223, "ipad": 334256223, "googleplay": "com.treemolabs.apps.cbsnews"}, "url": {"iphone": "cbsnewsapp://cbsnews.com/news/philadelphia-eagles-win-super-bowl-lii-nick-foles-mvp-2018/", "ipad": "cbsnewsapp://cbsnews.com/news/philadelphia-eagles-win-super-bowl-lii-nick-foles-mvp-2018/", "googleplay": "cbsnewsapp://cbsnews.com/news/philadelphia-eagles-win-super-bowl-lii-nick-foles-mvp-2018/"}}, "site": "@CBSNews", "title": "Super Bowl 2018: Eagles pull off stunning win over Patriots", "description": "Philadelphia Eagles held off Tom Brady and New England Patriots, 41-33, for first Super Bowl title", "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2018/02/05/8c49e43a-ab3e-471a-a3f0-1381460f8097/thumbnail/1200x630/f47837b3a0651902c6d54b07e6c227c0/gettyimages-914311864.jpg", "card": "summary_large_image"}, "theme-color": "#101010", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "CBS News", "apple-mobile-web-app-status-bar-style": "black"}, "movies": [], "publish_date": null, "source": "https://www.cbsnews.com", "summary": ""}