{"url": "www.inquisitr.com/3886471/no-katie-holmes-did-not-spend-20000-to-fix-teeth-star-confirms-signed-on-for-oceans-eight-cast/", "text": "Katie Holmes has been the subject of many headlines lately, not only for her wonderful onscreen work and her debut behind the camera for the film All We Had but also for rumors surrounding the supposed secret romance between she and actor Jamie Foxx. Most recently one outlandish claim was made about the star and her attempts to make some cosmetic adjustments for a steep price. As Gossip Cop notes, rumor had it that Holmes was set to pay $20,000 to fix her teeth. The gossip policing site shares the rumor that was spread by an unreliable tabloid.\n\n“According to the repeatedly discredited National Enquirer, the actress needs major dental work to fix her “‘twisted’ teeth. A so-called ‘source’ tells the outlet, ‘She grinds her teeth in her sleep, and they’re in bad shape.’ ‘Katie is so self-conscious she often smiles with her mouth closed,’ further contends the magazine’s clearly ill-informed insider, adding, ‘She wants something to smile about, and she’s willing to break the bank to get it!'”\n\nThe publication notes that a real source close to the star has stated that the rumor is absolutely false and that Holmes is in no way self-conscious of her smile, nor is she so concerned that she smiles with her mouth closed.\n\nAlthough this rumor has turned out to be a fabrication, the rumor regarding Jamie Foxx and Katie has been given new life since the two were spotted holding hands in Miami on New Year’s Eve. Apparently, they also spent the night together in a luxury room in the beachside party town. The pair has certainly done their best to keep the romance under wraps and have each individually stated to the press that they are merely friends. It appears as though it really is all a cover up to keep their relationship private and out of the spotlight.\n\nExclusive! Katie Holmes and Jamie Foxx celebrated New Year’s Eve together in Miami — all the details: https://t.co/Bji06zf5d7 pic.twitter.com/kFXevPIIoh — Us Weekly (@usweekly) January 5, 2017\n\nHowever, Katie is all about sharing in regards to her recent roles onscreen and behind the scenes as a new director. Holmes has enjoyed a successful run on the series Kennedys: After Camelot, in which she stars as Jackie Kennedy. She has also recently made her directorial debut and is set to direct one of the episodes for the next season of the Kennedy drama.\n\nThe latest interview with the star has uncovered the fact that Holmes is going to be a part of the Ocean’s Eight cast. TV3 shares about the stars set to have cameos in the film.\n\n“She joins a cast which already boasts Anne Hathaway, Sandra Bullock, Cate Blanchett, Rihanna, Helena Bonham Carter, and Mindy Kaling.”\n\nAlso, Matt Damon is set to reprise a role in the highly-anticipated film that is a part of a very successful franchise that includes the remake from 2001, Ocean’s Eleven and the two sequels that followed, Ocean’s Twelve and Ocean’s Thirteen. Entertainment Tonight notes the words of Damon about the upcoming film and cast.\n\n“I’m doing a little bit in the movie,” he revealed to ET. “I haven’t read it yet, but the cast is phenomenal and I’m excited to see what those women do with it. It’s going to be fun.”\n\nIt does sound as though it will be a sure hit with that incredible lineup and, based on the former films of the franchise, this installment will likely not disappoint fans. Katie Holmes has certainly spread her wings lately with the choices she has made in the world of entertainment, and it’s obvious that she has come a long way since her start as awkward Joey on the teen hit show Dawson’s Creek.\n\n[Feature Image by Frederick M. Brown/Getty Images]", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2017/01/Katie-Holmes-and-Jamie-Foxx-The-Real-Story-1.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://secure.gravatar.com/avatar/784fcf0a3514f31a582147119c01ff3d?s=250&d=mm&r=g", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Jessica Dafoe"], "canonical_link": "https://www.inquisitr.com/3886471/no-katie-holmes-did-not-spend-20000-to-fix-teeth-star-confirms-signed-on-for-oceans-eight-cast/", "title": "No, Katie Holmes Did Not Spend $20,000 To Fix Teeth, Star Confirms Signed On For ‘Ocean’s Eight’ Cast", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}