{"url": "medium.com/@allthebigtrees/how-to-perform-a-satanic-destruction-ritual-4c76baf0ea30", "text": "Photo by Levan TK (LA Weekly).\n\nI’ve come to learn that rituals are treated very similarly to masturbation in society. It’s something everyone does (whether they like to admit it or not), we’re told to be ashamed of their practice, but they both make us feel good. Rituals are a very personal thing, and seldom understood writ large. If you’re out with people and you tell them you did a ritual earlier that day, odds are you’ll be met with the same response as if you told them you jerked off that morning.\n\nWhat are rituals?\n\nThe truth is, that all of human life is made of rituals.\n\nMere mention of the word generally conjures images of occult symbols painted on the walls of decrepit basements, animal sacrifice, and strange chanting that reverberates off the walls of horror film scenery and news headlines to assault the American imagination. However, rituals are a universal feature of human cognitive function and social structure. It’s time we reevaluate what the meaning of a ritual is, and recognize the potential (dare I say) benefits of doing such things — specifically here the Destruction Ritual.\n\nRituals have a strange role in my life. Coming from an academic background in anthropology, the anthropological definition is engrained in my mind. The formal definition in that field is:\n\n“Rituals are actions with intentional symbolic meaning undertaken for a specific cultural purpose, such as a rite of passage from childhood to adulthood, and may reinforce broader community social bonds, as in a wedding. They are used to reinforce social bonds and structure.”\n\nTraditional Oriya Wedding Ceremony in India is a right-of-passage ritual practiced by those of the Hindu faith to ceremonialize the union between two people.\n\nCommunion is a Christian ritual in which bread and wine are consumed to symbolically represent the body and blood of Christ being consummated and taken into his worshippers.\n\nNew Year’s Eve ritual practiced by Americans in New York every year on January 31st at Midnight in which a giant ball is “dropped” from the top of Time Square and confetti is released to celebrate the arrival of another year.\n\nI’m also a chapter head for The Satanic Temple, so writing and performing rituals has become a foundational and therapeutic practice for me. For the last few years, I’ve found myself straddling a line between scientific objectivism and emotional catharsis with the subject.\n\nRituals are repeated human actions to fulfill, reinforce and maintain a part of the human function and experience. Brushing our teeth is a ritual created to tend to our dental health. Breakfast, lunch and dinner are daily rituals to tend to our caloric intake. Prayer before bed, meals or at church every Sunday is a ritual to tend to piety and relationship with God. Going to the gym is a ritual to tend to maintenance of our muscular and cardiovascular systems. But why don’t gym bags, toothbrushes and Eggo waffles send people running for the hills?\n\nThe media-driven Manson case heavily polluted the concept of rituals in America.\n\nThe media has heavily slandered the practice of rituals. The taboo has gone so far in the U.S. as to compelling hundreds of police departments nationally to create specific manuals for identifying Satanic rituals and effectively “busting” anyone caught doing them. This has had devastating side effects on our society (see The Satanic Panic of the 1980s & 1990s). Countless people who simply didn’t fit the mold of their community have been falsely accused of and imprisoned for horrible crimes ranging from rape to murder.\n\nWhat is The Satanic Temple?\n\nThe Satanic Temple is a religious and activist organization that was birthed from the idea that we are at a point in history where combating the status quo is an essential component of progression as individuals and as a society. In our view, Satan is a mascot for combating bigotry and detrimental authority. We see God and Satan as literary figures that have become so deeply engrained in our culture that much of our public policy and legislation is based upon their story.\n\nIn the infamous revolt of the angels, Satan (let’s refer to him as Lucifer the Angel, as he is called in the New Testament) was, of the angels created by God, said to be the most perfect, powerful, and intelligent. God essentially created these angels to be hit men — immediately sending them off on quests to murder people who challenged him. Lucifer identified this problem, rallied some of the other angels, and confronted God to challenge his authority. Most any Christian you talk to will see this as Lucifer being arrogant, but we see it as bravery. As a result of Lucifer’s revolt, he was cast out of heaven by God, where he then fell to Earth and bestowed the gift of knowledge to human kind (specifically to Eve in the Garden of Eden in Genesis). We see ourselves as aligning with a literary figure that is heavily misinterpreted, and undertaking the same mission. Since we don’t believe in the supernatural, the concept of a nontheistic but Satanic ritual seems like an oxymoron.\n\nWhat is the Destruction Ritual?\n\nI’ll preface by saying, it’s not for invoking Satan, but rather combating harmful power over us just as Lucifer the angel did in the Bible. The Destruction Ritual was born from a tradition I have done for many years with friends and loved ones on New Year’s Eve. We would gather around a fire with some scraps of paper, pens, and a few bottles of liquor. We would take turns writing things down on the pieces of paper, reading them aloud, throwing them into the fire and then taking a shot. It would start out with us drawing dicks or writing silly stuff, but as the night progressed and the bottles emptied, we found ourselves sobbing, hugging, and getting some really sticky shit off our chests.\n\nThen one year, we started bringing physical objects to destroy. Things that bore some kind of sentimental value we hung onto, but in reality just sat in a box in a closet somewhere and caused us negative emotions when we remembered they were there. We felt by hanging onto these objects, we were holding onto the hope of a failed relationship or the improvement of someone’s character, or a good memory we would cling to like this object was a life raft, but all it did was hurt us. My friend had a box of these creepy ceramic dogs her abusive grandfather gave her every year for her birthday. Another friend had an engagement ring from his ex fiancée that cheated in him. I had an antique children’s tambourine my ex gave me that I couldn’t let go of for some reason, as well as a bunch of photos and letters. We took turns smashing our objects with hammers, knives, and throwing the pieces into the fire. Afterwards, I felt a sense of empowerment I had never felt before, and an epiphany. The relationship was done, but I had let it still continue to hurt me by giving power to this stupid little plastic tambourine and a box of paper. By hanging onto them, I allowed the toxicity to seep into my everyday and gave something inanimate delusional purpose. We all cried, hugged, and stood around the fire silently watching the shards of our bad memories burn in the fire.\n\nThe Destruction Ritual serves this very purpose — destroying objects that we have given the power to hurt us. It’s a form of self love, as you are trusting that by destroying these stupid things, you will be stronger and lighter, so to speak, after doing it. So much of our culture revolves around material possessions. Our social status is assigned by what we have, our self worth is measured by what we have. We go into debt to buy cars and clothes and technology that pollutes the environment and will probably break and need to be replaced within two years anyway. In a way, you could stretch it and say the Destruction Ritual is your own petty way of combating the detrimental effects of capitalism. Whatever floats your boat.\n\nDestruction Ritual performed by The Satanic Temple in Los Angeles during the Satanic Mass of 2017.\n\nWe performed this ritual (which also involves an incantation) at our Satanic Mass in January of 2017. Wedding rings, old medication bottles, gifts from exes and a diary were among the things destroyed. As I was reciting it, I looked at the audience and saw a lot of crying faces. Our Arizona chapter also performed it over the summer and it yielded a similar effect. This thing sounds goofy, but trust me, it feels really, really good.\n\nSo gather some loved ones, or just grab a hammer and ride solo. Here is the how to for the Destruction Ritual.\n\nHow to perform the Destruction Ritual:\n\nStep One — Gather your object(s):\n\nPreference is given to something you’re holding onto that has a negative association to a person or memory or action. Maybe it’s something you hide so it’s not in sight everyday to cause you grief, but it’s there and you can’t let go of it. It could be a possession or gift from someone abusive or cruel, a piece of clothing from “the old you”, bank statements or receipts from a time you made a poor financial decision, a token of some kind of failure (relationship, friendship, or a personal failure). If something doesn’t immediately come to mind, you can improvise. Write angry things you want to get off your chest onto a piece of paper and put it in a glass bottle.\n\nStep Two — Find a good place to do it:\n\nIdeally somewhere outdoors, where it’s safe to get dirty and have sharp pieces of your freshly destroyed bad memories around. It’s best to place plastic or something underneath so cleanup is easy and damage to surrounding area is minimized. Objects can also be placed on a platter of some kind. Fireplace, bonfire or fire pit is a bonus.\n\nStep Three — Choose your weapon:\n\nDepending on the object(s) you are destroying, choose your weapon of destruction. Hammers, daggers, baseball bats, crowbars, mallets, and knives work well. It’s really up to you and the space available to you. Don’t forget safety — if you are destroying something shatterable like glass or ceramics, wear safety glasses and gloves.\n\nStep Four — Set the mood:\n\nLight some candles, pick some music (we recommend Author & Punisher as an official TST Destruction Ritual selection), and lay your object(s) and weapon(s) of choice out.\n\nStep Five — Recite the incantation:\n\n* The “Ave Satanas” are totally optional and up to you, the reciter. But they’re fun to yell.\n\nThese were things that I held in my hands\n\nThese were things that belonged to me\n\nThese were things that I held in my heart\n\nThese were things that have meaning to me\n\nThese things are not dead, because they never carried life\n\nBut I gave these things life, because they have carried me\n\nI gave these things my memories\n\nMy fear\n\nMy secrets\n\nMy tears\n\nMy blood\n\nMy devotion\n\nMy hate\n\nMy forgiveness\n\nMy pain\n\nMy pleasure\n\nMy love\n\nMy disdain\n\nI am the creator of life in these things\n\nFor without me, they would not be\n\nAnd people would seek to profit off what I give\n\nWith no mutual heart given back to me\n\nWe emancipate ourselves from this material slavery\n\nFor without my heart, these things would not be\n\n(Ave Satanas)\n\nWe liberate ourselves from this endless cycle\n\nOf voids filled with unnecessary greed\n\nI fill my voids with love and compassion\n\nI fill my voids with clarity\n\nI fill my void with the beauty that surrounds me\n\nI fill my voids with only that which propels me\n\n(Ave Satanas)\n\nTogether we raise our arms and unshackle ourselves from the control these things have over us\n\nTogether we raise our hammers and daggers, and with them pierce the heart of that control\n\nA power driven by addiction, attachment, consumption, and by a relentless hunger for excess\n\n(Ave Satanas)\n\nI DO NOT BELONG TO THESE THINGS\n\nTHESE THINGS BELONG TO ME\n\nI DO NOT BELONG TO THESE THINGS\n\nTHESE THINGS BELONG TO ME\n\nI DO NOT BELONG TO THESE THINGS\n\nTHESE THINGS BELONG TO ME\n\nI DO NOT BELONG TO THESE THINGS\n\nTHESE THINGS BELONG TO ME\n\nI DO NOT BELONG TO THESE THINGS\n\nTHESE THINGS BELONG TO ME\n\nI DO NOT BELONG TO THESE THINGS\n\nTHESE THINGS BELONG TO ME\n\nI DO NOT BELONG TO THESE THINGS\n\nTHESE THINGS BELONG TO ME\n\nI DO NOT BELONG TO THESE THINGS\n\nTHESE THINGS BELONG TO ME\n\nStep Six — Destroy your object(s):\n\nSelf-explanatory. Discard the pieces afterwards, there’s no point in holding on. Have at it, and be well. Ave Satanas, Hail Satan.", "images": ["https://miro.medium.com/max/60/1*C5ZTu_rL368LGBzXnLLR-Q.jpeg?q=20", "https://miro.medium.com/max/1200/1*C5ZTu_rL368LGBzXnLLR-Q.jpeg", "https://miro.medium.com/max/1128/1*3rEkuUxSDxK9G6MTOVaQ5Q.jpeg", "https://miro.medium.com/max/60/1*KCgPId_jaPl3zbyEFWvbFg.jpeg?q=20", "https://miro.medium.com/fit/c/96/96/0*kQXbEQjD8rCfsVt9.", "https://miro.medium.com/max/1500/1*UYhNeOYfLX23t1iMgXLPfA.jpeg", "https://miro.medium.com/max/750/1*VzDCjxrLerDVYLQbgXkmtA.jpeg", "https://miro.medium.com/max/40/1*3rEkuUxSDxK9G6MTOVaQ5Q.jpeg?q=20", "https://miro.medium.com/max/1500/1*VzDCjxrLerDVYLQbgXkmtA.jpeg", "https://miro.medium.com/max/60/1*VzDCjxrLerDVYLQbgXkmtA.jpeg?q=20", "https://miro.medium.com/max/2834/1*LgkeKHxByxIkCVr7bvDtQg.jpeg", "https://miro.medium.com/max/52/1*UYhNeOYfLX23t1iMgXLPfA.jpeg?q=20", "https://miro.medium.com/fit/c/160/160/0*kQXbEQjD8rCfsVt9.", "https://miro.medium.com/max/60/1*LgkeKHxByxIkCVr7bvDtQg.jpeg?q=20", "https://miro.medium.com/max/2000/1*KCgPId_jaPl3zbyEFWvbFg.jpeg"], "top_img": "https://miro.medium.com/max/750/1*VzDCjxrLerDVYLQbgXkmtA.jpeg", "keywords": [], "authors": ["Ali Kellog"], "canonical_link": "https://medium.com/@allthebigtrees/how-to-perform-a-satanic-destruction-ritual-4c76baf0ea30", "title": "How to perform a Satanic Destruction Ritual", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#000000", "twitter": {"app": {"name": {"iphone": "Medium"}, "id": {"iphone": 828256236}, "url": {"iphone": "medium://p/4c76baf0ea30"}}, "title": "How to perform a Satanic Destruction Ritual", "site": "@Medium", "description": "I’ve come to learn that rituals are treated very similarly to masturbation in society. It’s something everyone does (whether they like to…", "image": {"src": "https://miro.medium.com/max/750/1*VzDCjxrLerDVYLQbgXkmtA.jpeg"}, "card": "summary_large_image", "creator": "@allthebigtrees", "label1": "Reading time", "data1": "9 min read"}, "al": {"ios": {"app_name": "Medium", "app_store_id": 828256236, "url": "medium://p/4c76baf0ea30"}, "android": {"package": "com.medium.reader", "url": "medium://p/4c76baf0ea30", "app_name": "Medium"}, "web": {"url": "https://medium.com/@allthebigtrees/how-to-perform-a-satanic-destruction-ritual-4c76baf0ea30"}}, "fb": {"app_id": 542599432471018}, "og": {"site_name": "Medium", "type": "article", "title": "How to perform a Satanic Destruction Ritual", "description": "I’ve come to learn that rituals are treated very similarly to masturbation in society. It’s something everyone does (whether they like to…", "url": "https://medium.com/@allthebigtrees/how-to-perform-a-satanic-destruction-ritual-4c76baf0ea30", "image": "https://miro.medium.com/max/750/1*VzDCjxrLerDVYLQbgXkmtA.jpeg"}, "article": {"published_time": "2017-12-31T23:20:43.700Z", "author": "https://medium.com/@allthebigtrees"}, "title": "How to perform a Satanic Destruction Ritual - Ali Kellog - Medium", "description": "I’ve come to learn that rituals are treated very similarly to masturbation in society. It’s something everyone does (whether they like to admit it or not), we’re told to be ashamed of their practice…", "author": "Ali Kellog", "robots": "index,follow", "referrer": "unsafe-url", "parsely-post-id": "4c76baf0ea30"}, "movies": [], "publish_date": 1514762443.7, "source": "http://medium.com", "summary": ""}