{"url": "https://www.hollywoodreporter.com/live-feed/bates-motel-series-finale-explained-995754", "text": "[This story contains spoilers from the series finale of A&E's Bates Motel.]\n\nAfter five seasons, numerous deaths and a dark decent into madness, the world of A&E's Bates Motel came to a close Monday with an expected yet heartbreaking series finale.\n\nIn “The Cord,” the death toll continued to rise. Romero (Nestor Carbonell) fulfilled his death wish when he forced \"Norman\" (Freddie Highmore) to show him where he'd left Norma’s (Vera Farmiga) body. Only Norman — who was still \"Mother\" at that point — killed Romero as he was sobbing over Norma's corpse.\n\nBut before Romero breathed his last breath, he reminded Norman of his actions — that he was the one responsible for killing his beloved mother. As a result, “Mother” left Norman behind, saying he no longer needed her now that he knew everything. It was enough to send Norman into a lonely tailspin and revert his damaged mind all the way back to the time of the pilot, when he and Norma first traveled to White Pine Bay and opened their infamous motel.\n\nHoping against hope for everything to revert back to normal, Norman dragged his mother’s body to the motel and into the house and called his brother Dylan (Max Thieriot) to come over for dinner as though nothing had happened. In the end, Dylan knew that he was the only one left standing who cared about Norman’s well-being and opted not to call the authorities. Instead, Dylan attempted to bring Norman in himself.\n\nUnfortunately, the only thing Norman wanted in the end was to be reunited with his mother, even if it meant he had to die. So in a twisted suicide attempt, Norman rushed at a gun-wielding Dylan with a knife, forcing his brother to shoot and kill him.\n\n“Thank you,” Norman muttered as his last words as Dylan held his dying brother.\n\nTo break down the series finale and what went into crafting the ultimate ending, The Hollywood Reporter caught up with co-showrunners Cartlon Cuse and Kerry Ehrin.\n\nHow much of this was the ending you planned from the start? How much changed over the years?\n\nEhrin: We’d always thought of this as a love story. A very weird, warped, dark, love story. In the end, it felt like even if we were reuniting them in death that they had to be reunited. Even if it was lying next to each other in earth for all eternity. That was the driving destination emotionally. The Dylan story became part of that, and him being the one that ushers Norman out of the world felt fitting.\n\nCuse: We came to the idea later that Dylan would be the one to usher Norman out of the world at Norman’s bequest. But from when we first started talking about the show, we imagined a five-year journey that would end with Norman and Norma both dead. Ultimately, we felt their love story could just not succeed in this world.\n\nAre viewers meant to feel as though Norman wanted Dylan to kill him?\n\nCuse: He’s coming at Dylan with a knife; I mean, Dylan doesn’t have a choice.\n\nEhrin: He wants to be put out of his misery at that point. When Norman goes over to the sink and picks up the knife, you can see all these ideas playing in his head of what he’s supposed to do now that he’s been told that Norma is dead; she doesn’t exist, and he’s not going to get her back, and there’s no pretending your way out of this. It’s a beautiful performance, because you see all these things play through him. He doesn’t quite know what he’s doing when he picks up the knife and starts walking toward Dylan. He’s working it out as he’s walking.\n\nCuse: It’s always a bit of a double-edged sword to talk about stuff afterward. It’s fine for people to have their own interpretation of what happened at the end. Most of the audience will have that experience. It wasn’t intentionally ambiguous, but you can draw your own line and make a decision as to what degree Norman is egging him on and to what degree can Dylan stop himself. There was a certain messy, tragic quality to that final encounter that we love.\n\nEhrin: Messy tragedy has been our hallmark. We like to not over-define things. We like to throw it out there and wade around it.\n\nWere you going for an Of Mice and Men vibe?\n\nEhrin: Yes. That’s dead on. That was definitely an inspiration in early discussions. The idea of a mercy killing that was also heartbreaking.\n\nCuse: There’s a poignancy in Norman having a brief moment of clarity that gives him perspective. If you think of the distorted mental state Norman is in when he invites Dylan to come to dinner and has Norma kind of propped up on the table, there was a real poignancy in having Norman realize that all avenues were closed to him. He doesn’t want to go to a mental institution, he can’t exist in this world, he’s in a degrading mental state. There was no other solution for him.\n\nWhy didn’t Emma (Olivia Cooke) call the police when she knew Dylan was going into the house?\n\nEhrin: She actually did in one draft. It was an editing decision in post. Once you get Dylan into that house, you just wanted to stay with him and be with that and not cut away to something else.\n\nCuse: It’s fair in a situation like this that characters don’t always do the most logical thing. Obviously, if Emma calls the cops, it really mutes the conclusion that we felt was best for the show, and it felt fair and reasonable that in that moment she defers and doesn’t do it.\n\nOnce you introduced Marion Crane (Rihanna), were Norman’s days numbered?\n\nCuse: There were a couple of guiding principles. We absolutely did not want to end the show in the same way as Psycho. That would have been a profound disappointment and it would deflate the whole intention here, which was to take characters and some of the iconographic imagery from the movie and tell its own story. Our story had its own ending, and so we enjoyed the fun of crossing in and out of the mythology of Psycho at the end. Particularly when we cast Rihanna, we leaned into the fact that the audience would come to it with these very specific expectations based on the movie, and we wanted to flip their expectations on their ear. That was fun to do, but as far as the ending goes, we were never judging it against the ending in Psycho or felt an obligation to connect it to the ending of Psycho. Our obligation at the end was to hopefully have this tragic love story come to a satisfying ending. Sad can be satisfying. We knew it wouldn’t be happy, but we hoped it would be satisfying.\n\nPsycho aside, was there any point where you second-guessed your decision to kill Norman?\n\nEhrin: No. Certainly a part of you wants to somehow have everything turn out OK just because you love the characters. But this is closer to Wuthering Heights than Harvey. There’s an ending where Norman just walks off into the hills talking to his mother and the sun goes down and everyone’s happy. In my head, that kind of exists, but that wasn’t what we were delivering.\n\nWhen Norma leaves Norman following Romero’s death, does that close the door on his mental defense case in these murders?\n\nEhrin: Yes, because he’s alone. He doesn’t have that buffer anymore, and he can’t deal with it. It pushes him over the edge, and it leads him on this journey to recall the past and kind of redo it.\n\nHow did you come up with the idea to reincorporate the pilot into the episode?\n\nCuse: One of the things that’s always satisfying in finales is to remind audiences of the journey they’ve been on. There’s a resonance in rewarding an audience that has watched all 50 episodes of our show with a sense of that journey. Some of it arose from those feelings. It was also a way to make the love story feel epic. The thing that makes something epic is its existence across a large spread of time. We wanted to reconnect the audience to the fact that this love story and relationship was a lifelong journey.\n\nWhen did you decide that Dylan, Emma and their daughter would live in the sun?\n\nEhrin: That instinct first came at the end of the second season.\n\nCuse: We realized the show was heading in a very dark direction, and we felt it was important to have some ray of hope at the end of our narrative. It became clear that early that Dylan and Emma deserved to come out of this with a relatively happy ending.\n\nEhrin: There was something really interesting toward the end of the second season to have these two people who were both really outside of the Norma-Norman island and couldn’t get on it, that they would find each other and miraculously make their own world together. It made us happy to think about, and it became something that was fun to work toward in the writing. You do try to balance it — even on a purely selfish level for your own self. When you’re living inside of this stuff, it’s very dark, and it’s nice to have strands of hope to hold onto. That played out even in writing Norma and Norman, because you would constantly have to put yourself in denial about the ending. You wanted to always infuse them with hope that things would be better. That they were going to work out of it. It’s an interesting process to write that. It’s very emotionally and physically taxing…it's bizarre.\n\nWas there any talk of having that last shot be the daughter giving the camera a creepy Norman Bates-type smile, rather than ending it on a happier note?\n\nCuse: That will be the sequel.\n\nEhrin: We joked about that in the writers' room, that she would be like Baby Norma, but that she would be evil. But no. The kid is good, and Dylan and Emma are good.\n\nWhat did you think of the series finale of Bates Motel? Sound off in the comments below. Click here to read our finale postmortem with Freddie Highmore.\n\nTwitter: @amber_dowling", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2017/04/bm_510_290122017_cc_00141-h_2017.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/01/greg_berlanti_sharon_horgan_alex_kurtzman_and_dwayne_johnson_-_getty_-_h_2020.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/2017/04/bm_510_290122017_cc_00141-h_2017.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/03/mrs._america_-_publicity_still_1-_h_2020_.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/blogicon_livefeed-black2.png"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/04/bm_510_290122017_cc_00141-h_2017.jpg", "keywords": [], "authors": ["Amber Dowling", "Thrnews Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/live-feed/bates-motel-series-finale-explained-995754", "title": "'Bates Motel' Creators Break Down the Series Finale's \"Messy Tragedy\"", "meta_data": {"viewport": "width=device-width", "description": "“Their love story could just not succeed in this world,” showrunners Carlton Cuse and Kerry Ehrin tell THR.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/live-feed/bates-motel-series-finale-explained-995754", "domain": "https://www.hollywoodreporter.com/", "title": "'Bates Motel' Creators Break Down the Series Finale's \"Messy Tragedy\"", "description": "“Their love story could just not succeed in this world,” showrunners Carlton Cuse and Kerry Ehrin tell THR.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/04/bm_510_290122017_cc_00141-h_2017.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "'Bates Motel' Creators Break Down the Series Finale's \"Messy Tragedy\"", "description": "“Their love story could just not succeed in this world,” showrunners Carlton Cuse and Kerry Ehrin tell THR.", "url": "https://www.hollywoodreporter.com/live-feed/bates-motel-series-finale-explained-995754", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/04/bm_510_290122017_cc_00141-h_2017.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "'Bates Motel' Creators Break Down the Series Finale's \"Messy Tragedy\"", "sailthru.description": "“Their love story could just not succeed in this world,” showrunners Carlton Cuse and Kerry Ehrin tell THR.", "sailthru.author": "Amber Dowling", "sailthru.channel": "Live Feed", "sailthru.vertical": "Live Feed", "sailthru.date": "2017-04-24 20:06:00", "sailthru.tags": "Live Feed, Television, Carlton Cuse, Bates Motel"}, "movies": [], "publish_date": 1493035560.0, "source": "https://www.hollywoodreporter.com", "summary": ""}