{"url": "https://www.health.com/celebrities/erin-andrews", "text": "Image zoom James White\n\n\"I wanna be the female Michael Strahan,\" says Erin Andrews over lunch one sunny afternoon in Manhattan Beach, California. It’s off-season for her work as a sideline reporter for Fox’s NFL coverage, and she’s between days filming Dancing with the Stars, which she has been cohosting since 2014. Erin, 39, is determined to keep working double duty in sports and entertainment, just like Strahan, the NFL star turned sports analyst turned television host, who, she says, \"paved the way\" for her. On one hand, sports is Erin’s greatest passion. \"I’m a super-big tomboy,\" says the Florida native, dressed down in jeans, a summery plaid shirt, and white slip-on sneakers. But as a woman reporting on the field, she says, she’s conscious of the extra scrutiny she faces: \"Is she being too silly? Is she being too sexy? Does she really know the game?\" Dancing with the Stars allows her to let loose a bit. \"The balance for me,\" she says, \"is really important.\"\n\nIn fact, considering the public and private battles she’s had to overcome in the past few years, Erin’s life balance is more important than ever, too. After winning a terrifying stalking case in early 2016, she was diagnosed with cervical cancer, which she treated through surgeries this past fall. So now, as she finishes planning her wedding to NHL broadcaster and former player Jarret Stoll, she welcomes good stuff on the horizon: the wedding this summer and a brand-new puppy to get their future family started right.\n\nI heard Jarret has been doing a lot of the wedding planning, but what’s been your favorite part of your big-day prep?\n\nHe loves to plan a party—I mean, the guy even helped me with the freakin’ calligraphy the other day. What a gem. The dress part of the wedding I appreciate because we’re really going for it.\n\nIs there anything new on your healthy-eating list these days?\n\nI’ve really been obsessed with bone broth. I was in New York a couple of months ago, and this gentleman who was doing my hair had this gorgeous skin, and he’s like, \"I gotta tell you, I’m really obsessed with bone broth,\" and I’m like, \"Shut up.\" I just drank some before I came here, with turmeric, ginger, and carrots in it—it’s like a beverage you’re drinking with your meal.\n\nYou’ve talked about loving Orangetheory workouts. What do you do if you can’t get to the studio?\n\nI try to emulate the program with intervals on a treadmill. I’m a walker, not a runner, so I just do, like, 4.0 incline and 4.0 speed, and I’m on it for a minute. Then, for the next 30 minutes, I do 6.0 incline, 4.3 speed. Then for a minute, I go 8, and you go back and forth with your intervals. And then I try to do weights so I feel like I’m getting a full-body workout.\n\nRELATED: 5 Things to Know About Your First Orangetheory Class\n\nImage zoom\n\nErin's wearing (red one-piece above): Norma Kamali Gold Stud Super Low Back Mio ($605; normakamali.com). Green one-piece in top photo: Adriana Degreas Bonsai Green Gingko Swimsuit ($395; avenue32.com).\n\nWhat is your relationship with your body today, compared with when you were younger?\n\nI feel better. It’s crazy—back in the day, I would crush Chicken McNuggets and french fries, and that would be my meal. But I handled weight a little differently then: I didn’t have the muscle tone. Now I’m addicted to working out; it just makes me feel better. And my man can always tell when I’ve done a workout, because I’m like, \"Good mooorning!\" I try to say to people who hate working out, \"It sucks going. I’m always in a crappy mood when I go. But when I walk out, I’m like Céline Dion: My heart will go on!\"\n\nDoes Dancing with the Stars affect how you stay fit at all?\n\nNot really. I work with former professional athletes, and they’re really good at working out. Though when I first started sideline reporting, I gained the freshman 15—because guys like to eat. When we’re a table of 15, I’m the only female, and they’re ordering sliced sirloin for an appetizer, I’m like, \"Heck yeah, I’m having some of this.\" But then I’m like, \"Why are my pants not fitting?!\" I just love eating, and I like having a cocktail, and I like having a scoop of ice cream. I know it’s all about portion control, so if I’m going to eat, I’m going to work out.\n\nWhat’s always in your daily health routine?\n\nSunscreen. I grew up in Florida, and I absolutely fried my skin—I was the chick who was lying out on the driveway. Now I know I’m pale, but I don’t wanna look like I’m 75 years old next year! So I always make sure that I’m putting on SPF 45 every day. And by the way, melanoma is a big deal in my family—my grandfather died from it.\n\nRELATED: Erin Andrews Opens Up About Finding Her Calm After a Tough Year\n\nAnd cancer prevention has been a priority for you since your cervical cancer diagnosis. Did you make any lifestyle changes as a result?\n\nIf anything, it’s made me hypersensitive to other things to get checked for. And I remember one of the oncologists said to me when I was going back to work, \"It’s really important for you to get some sleep and not stress out.” And I’m like, \"Uhh...I’m in Green Bay on Sunday and on the ballroom floor Monday—stress and not sleeping is kind of the way of life.\" But I’m really trying to be better about taking deep breaths. I’m trying meditation.\n\nYou were diagnosed not long after you wrapped up your trial. What is up with life’s timing?\n\nMy dad was diagnosed with prostate cancer in 2009, when [the stalker videos] first came out—and then I got diagnosed right after my trial, so there’s a little part of me that does agree that stress does a lot to your body. I’m not saying it wasn’t in my body before, but that does kind of weigh on me. There’s no research saying stress brings this on, but come on, you’ve heard enough about how much your body reacts. [And there I was] trying to act like nothing was wrong with me at work.\n\nImage zoom\n\nErin's wearing: Evarae Seona Metal Detail Plunge One Piece in White/Gold ($299; evarae.com).\n\nWhy didn’t you tell anyone at work? What was your thinking behind keeping your diagnosis a secret?\n\nWorking with a bunch of men, I didn’t wanna be like, \"Sooo, they think I have cervical cancer,\" and they’d be like, \"Where’s your cervix?\" But I’d also come off this huge trial that was kind of the focus of the summer, and I don’t want to be the girl that always has the problems at the table—\"And now I have cancer!\" I also think that I didn’t want to believe it was that big a deal, so we kept it quiet. But the wait was horrible.\n\nHow did you get through it?\n\nI did my first surgery on a Tuesday because I had Dancing on Monday, and I was doing a sit-down interview on Friday in Green Bay, so I had to take a red-eye on Thursday. And literally an hour before I needed to be in the car, we got the call from my doctor that the margins were not clear and she was recommending a hysterectomy. I was having a meltdown on my couch. I’m screaming and crying, my parents were on the phone, my boyfriend was arguing with the doctor—and I wasn’t even engaged yet, we weren’t even talking about having kids yet! So we decided we’re going to an oncologist, see what they said, then make a decision who I was gonna go with. Then we made the decision to do another surgery—and then if that surgery didn’t work, we were probably dealing with, \"What’s the next step? Is it gonna be radiation? Am I gonna get a hysterectomy?\" It was awful. I got the news, I did the surgery, they had to cut more of my cervix out, and then I went to New York that weekend, and I did the game. At Dancing with the Stars that Monday, I was in my dressing room when the phone rang and [the doctor] said, \"You’re good. We got it.\" I was like, “Oh my God,” crying—while trying on a ballroom dress. The waiting was so hard.\n\nWhat helped you get through that tough time?\n\nJust talking to my friends. It teaches you a lot about who is willing to do anything and show up. We had a really crazy moment when we were going in for the second surgery. Our friend went into labor the night before my surgery, and she ended up being three floors down. After I was done, my boyfriend and I lay in her [hospital] room, and we were all laughing because my girlfriend just had a baby, so she was in a diaper; I had just had surgery, so I was in a diaper, and her baby was in a diaper. We were like, \"Babe, you’re the only one not in a diaper!\"\n\nImage zoom\n\nErin's wearing: Leah Shlaer The Colette Studded One-Piece ($255; leahshlaer.com).\n\nDid anything else beneficial come from that experience?\n\nIf anything, it was a huge step for my relationship with my boyfriend at the time. Because you don’t know if a guy is going to want to sit in with an oncologist and see, \"OK, so this is your cervix, and this is your uterus, and we are cutting out this part…\" We hadn’t even been discussing marriage. We hadn’t discussed babies! It really puts things on the fast track for you—because you have an oncologist saying to you, \"We highly recommend that you guys do your embryos right now, freeze them.\" I’m like, \"Hi, hon. I love you. I hope we’re spending our lives together.\" And he was amazing.\n\nSo what did you do? Did you end up freezing your embryos?\n\nI had actually frozen my eggs before all this a couple of years back, just because it was all the rage. But it definitely took a serious turn for us. I’m not young, we don’t know when we’re gonna have a baby, we don’t know if this is going to come back. One thing I love my future husband for is that our oncologist said the smart thing to do would be to have some insurance waiting—so we have frozen embryos because we’ve taken the steps. If we need ’em, we need ’em; and if we don’t, we don’t. We just wanna be smart. But it’s crazy, because these waiting rooms are packed!\n\nSo true! I’ve done IVF, too, and I found the minute you start talking about it, other women come out of the woodwork.\n\nWe have so many friends who have done it. And instead of being embarrassed about it, look at how incredible it is that we had an oncologist say to us, \"There is an option,” in case it comes back. And I’m really lucky, because I’ve had all his support through it. We don’t know what the future entails. We actually had to push this photo shoot because I was in the middle of [the IVF cycle]. I’m doing all these [IVF] shots and in these bathing suits, and I was like, \"Yay, look at my pin marks!\" [Pulls up her shirtsleeves to show the needle pricks and bruises on her arms]\n\nThat first shot, especially, is so horrible. Did you get used to it?\n\nI’d like to say I get used to it, but I’m in the bathroom, playing Walt Disney World Pandora to have something light on, and I stuck myself really hard one time and I nailed a blood vessel, and I started screaming! My man was in the other room watching Seinfeld, and I said, \"Dammit.\" He’s like, \"I love you!\" And I was like, \"Yeah, you better!\" We went from football to everything that happened to freezing embryos—mixing hormones and wedding planning.\n\nImage zoom James White\n\nErin's wearing: Solid & Striped The Tilda Top and Bottom ($88 each; solidandstriped.com).\n\nWhat do you and Jarret bond over most? Is it sports?\n\nNot really. As much as I am a sports fanatic, we are both very silly. He is a lot more patient and chilled out than I am. We both love the beach, and we’re getting a new dog—it’s our first child, so we’re very excited. He’s a golden retriever; we’re naming him Howard.\n\nYou’ve said it’s possible to mix a demanding career and kids. What does that mean to you?\n\nFor me, it’s having the career, having the family, and having the happiness. I grew up in the South. People were getting married at 21; I had my first major job at 21, and I was missing everybody’s weddings because I was doing football games and baseball games. I had never been to Europe until two years ago—I’ve gone to all the sports cities, but I’d never had a life for myself. I want to continue doing more, but it’s going to be shaped toward how I want to have this family and how I do want to have kids. I think it’s possible that I’ll be able to have a kid and be able to do this for a living. We’re just gonna have to figure out how.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2017%2F06%2Ferin-andrews-window-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2017%2F06%2Ferin-andrews-white-swimsuit-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=%5B1000%2C667%5D&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2017%2F06%2Ferin-andrews-tropical-halter-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2019%2F10%2Fgettyimages-597061819_0_0.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2019%2F12%2Fcardio-workout.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2015%2F09%2Fflu-prevention-cover-clean-contain-gettyimages-854418304-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2018%2F09%2Fgettyimages-487998567_0-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2017%2F06%2Ferin-andrews-tropical-halter-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2017%2F06%2Ferin-andrews-red-one-piece-swimsuit-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2017%2F11%2Fgettyimages-474951090_0-2000.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2067'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2016%2F07%2Fgettyimages-509858008-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2017%2F06%2Ferin-andrews-red-bikini-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2018%2F04%2Fgettyimages-837228380.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20133'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2019%2F09%2Flie-detector-gettyimages-200027158-001_copy-2000.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2019%2F03%2Fgettyimages-140347466-2000.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=%5B1000%2C667%5D&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2017%2F06%2Ferin-andrews-tropical-halter-2000.jpg", "keywords": [], "authors": ["Amy Spencer"], "canonical_link": "https://www.health.com/celebrities/erin-andrews", "title": "Erin Andrews on Her Cervical Cancer Scare and Roller Coaster Year: “I’m Really Lucky”", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "Erin Andrews opens up about how she got through a health scare, fought for her fertility, and knew she had the right guy by her side.", "og": {"title": "Erin Andrews on Her Cervical Cancer Scare and Roller Coaster Year: “I’m Really Lucky”", "type": "article", "site_name": "Health.com", "url": "https://www.health.com/celebrities/erin-andrews", "description": "Erin Andrews opens up about how she got through a health scare, fought for her fertility, and knew she had the right guy by her side.", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=%5B1000%2C667%5D&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2017%2F06%2Ferin-andrews-tropical-halter-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://www.health.com/celebrities/erin-andrews", "description": "Erin Andrews opens up about how she got through a health scare, fought for her fertility, and knew she had the right guy by her side.", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2017%2F06%2Ferin-andrews-tropical-halter-2000.jpg"}, "twitter": {"card": "summary", "url": "https://www.health.com/celebrities/erin-andrews", "title": "Erin Andrews on Her Cervical Cancer Scare and Roller Coaster Year: “I’m Really Lucky”", "description": "Erin Andrews opens up about how she got through a health scare, fought for her fertility, and knew she had the right guy by her side.", "site": "@goodhealth", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=%5B1000%2C667%5D&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2017%2F06%2Ferin-andrews-tropical-halter-2000.jpg"}, "fb": {"app_id": 165082593548215, "pages": 10053803772}, "article": {"opinion": "false"}}, "movies": [], "publish_date": null, "source": "https://www.health.com", "summary": ""}