{"url": "https://www.bustle.com/p/are-rachel-bryan-still-together-in-2018-the-bachelorette-pair-started-their-relationship-amongst-a-lot-of-drama-9201095", "text": "With new Bachelorette Becca Kufrin waiting in the wings to find her true love, former Bachelorette Rachel Lindsay is out of the spotlight — that’s probably just how she wants it. She chose Miami-based doctor Bryan Abasolo at the end of her season, and the two walked into the sunset together during the 2017 finale. But, as we know, relationships founded on The Bachelor and The Bachelorette can have, let’s say, short shelf lives. Bachelorette stars Rachel and Bryan still together in 2018?\n\nRachel took to television in 2017 with the dream of finding a man. And she found two! It came down to Bryan and Wisconsin-based personal trainer Peter Kraus. The finale was tough to watch, as Peter and Rachel seemed like a better match to many fans but Peter wasn’t convinced that he could be engaged after knowing someone for, like, six weeks (imagine that). That didn’t fly with Rachel, and the two had a really emotional breakup, one that Rachel thinks overshadowed the fact that she found longtime love with Bryan.\n\n“I wish you were able to really see more of Bryan. [The breakup with Peter] really did overshadow, I felt, a happy moment for us, like one of the best moments of my life,” Rachel told Us Weekly. “I’ve never been engaged before and neither has Bryan, and I felt like we were more on the defense about our relationship and having to explain more of it than rather it just showing … So I just wish you really got to see Bryan, and I hate that it took away from him.”\n\nAnd, for the record, Peter and Rachel do not talk. “For me, the reason there was so much emotion [in the finale] was because that was closure for me, that was it,” Rachel told Us Weekly. “And I really haven’t talked to him because I don’t have anything else to say. From what I hear, he’s doing well too.”\n\nPeter is doing well, and you know what? Rachel and Bryan are, too! The pair is still together, living in Dallas (Bryan relocated from Miami) and being just a regular, everyday Bachelor Nation couple. (They also still have Copper, Rachel’s dog, which is very important.)\n\nThe number-one question that a Bachelor couple gets after getting engaged on national television is, “When are you getting married?” At least Rachel and Bryan have an answer. As Bryan told ExtraTV, “We haven’t set anything yet. We definitely want to get married this year, and that’s the plan. 2018, it’s gonna happen.” He explained that even though Rachel “isn’t much of a planner,” the nuptials would happen soon, and they may even be on television. “We would definitely be open to a televised wedding. We, right now, we enjoy showing everybody how in love we are... and I think that would be the culmination of our love story, or the beginning of it,” Bryan said. “I think we would definitely enjoy doing it on national television.”\n\nI would also enjoy have a huge wedding paid for by ABC, so why not? In another interview with Us Weekly, Rachel said she needed a few things of the pair’s impending nuptials. “Good music. I’m very big on ‘I want everyone to have a good time and enjoy themselves.’ I know it’s like our day, but it’s about the people we love celebrating our day with us,” she said. “And I really want good flowers. I feel like flowers add character to the wedding, so that’s a must-have. No roses. We’re done. Those days are over.”\n\nNo roses is probably a good idea — she could go into muscle memory and just start handing them out. No matter if you were #TeamBryan or #TeamPeter going into Rachel’s finale, there’s no doubt — she and Bryan are still in love, and they don’t care who knows it.", "images": ["https://imgix.bustle.com/uploads/getty/2018/5/27/ef9e4ef0-cdde-4989-bae9-abc46d901172-getty-915942082.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/5/27/ef9e4ef0-cdde-4989-bae9-abc46d901172-getty-915942082.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/14/3320ea12-f35a-4f09-a1e8-3f26a77ed39a-getty-1206496569.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/3/20/c328eadf-9ae0-4257-99eb-e601f708c458-getty-916296824.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/9/dbe575a0-757f-431a-b1ff-26cca1927f4d-getty-1187976985.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2020/4/15/8feb9158-e1b8-420e-952c-a847f4994e90-getty-1187049088.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/5/27/ef9e4ef0-cdde-4989-bae9-abc46d901172-getty-915942082.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/are-rachel-bryan-still-together-in-2018-the-bachelorette-pair-started-their-relationship-amongst-a-lot-of-drama-9201095", "title": "Are Rachel & Bryan Still Together In 2018? 'The Bachelorette' Pair Started Their Relationship Amongst A Lot Of Drama", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/are-rachel-bryan-still-together-in-2018-the-bachelorette-pair-started-their-relationship-amongst-a-lot-of-drama-9201095", "type": "article", "title": "The One Rachel & Bryan Update You Need Before Becca's 'Bachelorette' Season Starts", "description": "With new Bachelorette Becca Kufrin waiting in the wings to find her true love, former Bachelorette Rachel Lindsay is out of the spotlight — that’s probably just how she wants it. She chose Miami-based doctor Bryan Abasolo at the end of her season,…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/5/27/ef9e4ef0-cdde-4989-bae9-abc46d901172-getty-915942082.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "With new Bachelorette Becca Kufrin waiting in the wings to find her true love, former Bachelorette Rachel Lindsay is out of the spotlight — that’s probably just how she wants it. She chose Miami-based doctor Bryan Abasolo at the end of her season,…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}