{"url": "https://en.wikipedia.org/wiki/Jeopardy!", "text": "\"Jeopardy\" redirects here. For other uses, see Jeopardy (disambiguation)\n\nAmerican television quiz show\n\nJeopardy! is an American television game show created by Merv Griffin. The show features a quiz competition in which contestants are presented with general knowledge clues in the form of answers, and must phrase their responses in the form of questions. The original daytime version debuted on NBC on March 30, 1964, and aired until January 3, 1975. A weekly nighttime syndicated edition aired from September 1974 to September 1975, and a revival, The All-New Jeopardy!, ran on NBC from October 1978 to March 1979. The current version, a daily syndicated show produced by Sony Pictures Television, premiered on September 10, 1984.\n\nBoth NBC versions and the weekly syndicated version were hosted by Art Fleming. Don Pardo served as announcer until 1975, and John Harlan announced for the 1978–1979 season. Since its inception, the daily syndicated version has featured Alex Trebek as host and Johnny Gilbert as announcer.\n\nWith over 8,000 episodes aired,[1] the daily syndicated version of Jeopardy! has won a record 33 Daytime Emmy Awards as well as a Peabody Award. In 2013, the program was ranked No. 45 on TV Guide's list of the 60 greatest shows in American television history. Jeopardy! has also gained a worldwide following with regional adaptations in many other countries. The daily syndicated series' 36th season premiered on September 9, 2019.[2]\n\nGameplay [ edit ]\n\nThree contestants each take their place behind a lectern, with the returning champion occupying the leftmost lectern (from the viewer's perspective). The contestants compete in a quiz game comprising three rounds: Jeopardy!, Double Jeopardy!, and Final Jeopardy! The material for the clues covers a wide variety of topics, including history and current events, the sciences, the arts, popular culture, literature, and languages. Category titles often feature puns, wordplay, or shared themes, and the host will regularly remind contestants of topics or place emphasis on category themes before the start of the round.\n\nAll clues in the show are presented as \"answers\", and responses must be phrased in the form of a question. For example, if a contestant were to select \"Presidents for $200\", the resulting clue could be \"This 'Father of Our Country' didn't really chop down a cherry tree\", to which the correct response would be \"Who is/was George Washington?\" (Contestants are free to phrase the response in the form of any question; the traditional phrasing of \"who is/are\" for people or \"what is/are\" for things or words is almost always used.) When the correct response is the name of a person, the surname is sufficient except in categories where the host explicitly states the full name is required or the surname is not sufficiently unambiguous.\n\nFirst two rounds [ edit ]\n\nJeopardy! game board since November 26, 2001, showing the dollar values used in the first round. Categories at the top of the board vary between each round and episode. The layout of thegame board since November 26, 2001, showing the dollar values used in the first round. Categories at the top of the board vary between each round and episode.\n\nThe Jeopardy! and Double Jeopardy! rounds each feature six categories, each of which contains five clues, which are ostensibly valued by difficulty. The dollar values of the clues increased over time. On the original Jeopardy! series, clue values in the first round ranged from $10 to $50. On The All-New Jeopardy!, they ranged from $25–$125. In the two pilots that led to the current series, the first kept the $25–$125 values for the Jeopardy! round, while the second doubled these to $50–$250. The current series' first round originally ranged from $100–$500 (doubled again from the second pilot), and was doubled to $200–$1,000 on November 26, 2001.[6]\n\nThe Jeopardy! round begins when the returning champion selects any position on the game board. The underlying clue is revealed and read aloud by the host, after which any contestant may ring-in using a hand-held signaling device. The first contestant to ring-in successfully is prompted to provide a response to the clue. If the contestant responds correctly, the clue's dollar value is added to the contestant's score, and they may select a new clue from the board. An incorrect response, or a failure to respond within five seconds, deducts the clue's value from the contestant's score and allows the other contestants the opportunity to ring in and respond. If the response is not technically incorrect but otherwise judged to be too vague to be deemed the correct response, the contestant is given additional time to provide a more specific response. Whenever none of the contestants ring in and respond correctly, the host gives the correct response and the \"last correct questioner\" chooses the next clue.[7]\n\nContestants are encouraged to select the clues in order from lowest to highest value, as the show's writers write the clues in each category to flow from one to the next, as is the case with game shows that ask questions in a linear string. Contestants are not required to do so unless the category requires clues to be taken in order; the \"Forrest Bounce\", a strategy in which contestants randomly pick clues to confuse opponents, has been used successfully by Arthur Chu and the strategy's namesake Chuck Forrest, despite Trebek noting that the strategy not only annoys him but staffers as well since it also disrupts the rhythm that develops when revealing the clues and increases the potential for error.[8] Another unorthodox strategy is to sweep through the highest values on the board first; if successful, this has several advantages: the player will have more money to wager on Daily Doubles, and other players will have to answer more questions correctly to earn the same amount of money. James Holzhauer, whose April–June 2019 winning streak included the ten highest single-day money totals in the show's history, regularly used this strategy, in conjunction with the Forrest Bounce and aggressive Daily Double wagering.[9]\n\nFrom the premiere of the original Jeopardy! until the end of the first season of the current syndicated series, contestants were allowed to ring in as soon as the clue was revealed. Since September 1985, contestants are required to wait until the clue is read before ringing in. To accommodate the rule change, lights were added to the game board (unseen by home viewers) to signify when it is permissible for contestants to signal; attempting to signal before the light goes on locks the contestant out for half of a second. The change was made to allow the home audience to play along with the show more easily and to keep an extremely fast contestant from potentially dominating the game. In pre-1985 episodes, a buzzer would sound when a contestant signaled; according to Trebek, the buzzer was eliminated because it was \"distracting to the viewers\" and sometimes presented a problem when contestants rang in while Trebek was still reading the clue. Contestants who are visually impaired or blind are given a card with the category names printed in Braille before each round begins, and an audible tone is played after the clue has been read aloud. The second round, Double Jeopardy!, features six new categories of clues. Clue values are doubled from the Jeopardy! round. The contestant with the least amount of money at the end of the Jeopardy! round makes the first selection in the Double Jeopardy! round;[7] if there is a tie, the tied contestant standing at the leftmost lectern (from the host's perspective) selects first.\n\nA \"Daily Double\" is hidden behind one clue in the Jeopardy! round, and two in Double Jeopardy! The name and inspiration were taken from a horse racing term. Daily Double clues with a sound or video component are known as \"Audio Daily Doubles\" and \"Video Daily Doubles\" respectively. Before the clue is revealed, the contestant who selects the Daily Double must declare a wager, from a minimum of $5 to a maximum of his/her entire score (known as a \"true Daily Double\") or the highest clue value available in the round, whichever is greater.[7][13] The contestant is given the exclusive right to answer the clue but must do so; a correct response adds the value of the wager to the contestant's score, while an incorrect response deducts it. Not answering the Daily Double also deducts the wager. Whether or not the contestant responds correctly, he or she chooses the next clue.[7] Daily Doubles are usually hidden behind higher-valued questions, and almost never on the top row (only eight of the over 11,000 Daily Doubles since November 2001, 0.07%, have been in that location).[14]\n\nDuring the Jeopardy! round, except in response to the Daily Double clue, contestants are not penalized for forgetting to phrase their response in the form of a question, although the host will remind contestants to watch their phrasing in future responses. In the Double Jeopardy! round and in the Daily Double in the Jeopardy! round, the phrasing rule is followed more strictly, with a response not phrased in the form of a question counting as wrong if it is not re-phrased before the host or judges make a ruling.[13]\n\nIf it is determined that a previous response was wrongly ruled to be correct or incorrect during the taping of an episode, the scores are adjusted at the first available opportunity (typically after the Jeopardy!, Double Jeopardy! rounds, the first break, or a Daily Double break). If it occurs after taping of an episode is completed, the affected contestant(s) are invited back to compete on a future show, complying with federal quiz show regulations.\n\nContestants who finish Double Jeopardy! with $0 or a negative score are automatically eliminated from the game at that point and awarded the third-place prize. On at least one episode hosted by Art Fleming, all three contestants finished Double Jeopardy! with $0 or less, and as a result, no Final Jeopardy! round was played. This rule is still in place for the Trebek version, although staff has suggested that it is not set in stone and that executive producer Harry Friedman may decide to display the clue for home viewers' play if such a situation were ever to occur.[17] During Celebrity Jeopardy! games, contestants with a $0 or negative score are given $1,000 for the Final Jeopardy! round.\n\nFinal Jeopardy! [ edit ]\n\nThe Final Jeopardy! round features a single clue. At the end of the Double Jeopardy! round, the host announces the Final Jeopardy! category and a commercial break follows. During the break, partitions are placed between the contestant lecterns, and each contestant makes a final wager; they may wager any amount of their earnings, but may not wager certain numbers with connotations that are deemed inappropriate (69, 666, and 1488 are among the forbidden wagers, though 13, 420, and 911 are allowed).[18] Contestants write their wagers using a light pen on an electronic display on their lectern. After the break, the Final Jeopardy! clue is revealed and read by the host. The contestants have 30 seconds to write their responses on the electronic display, while the show's iconic \"Think!\" music plays in the background. In the event that either the display or the pen malfunctions, contestants can use an index card and a marker to manually write their response and wager. Visually impaired or blind contestants use a Braille keyboard to type in a wager and response.\n\nIn the rare occurrences where there is only one contestant remaining, that contestant automatically wins unless (s)he wagers his or her entire score (which has never been attempted in such a situation) and loses. Otherwise, contestants' responses are revealed in order of their pre-Final Jeopardy! scores from lowest to highest. Players who are tied after Double Jeopardy! have their responses revealed from right to left from the viewer's perspective. As soon as the first correct response is revealed the host confirms it to be so, usually including some brief context, otherwise, the host only reveals the correct response with context after all responses are revealed to be incorrect. A correct response adds the amount of the contestant's wager to his/her score, while a miss, failure to respond, insufficiently specific response or failure to phrase the response as a question (even if correct) deducts it.[7] Misspelling is not penalized so long as the spelling does not affect the pronunciation of the word.[20]\n\nThe contestant with the highest score at the end of the round is that day's winner. If there is a tie for second place, consolation prizes are awarded based on the scores going into the Final Jeopardy! round. If all three contestants finish with $0, no one returns as champion for the next show, and based on scores going into the Final Jeopardy! round, the two contestants who were first and second will receive the second-place prize, and the contestant in third will receive the third-place prize.\n\nThe strategy for wagering in Final Jeopardy! has been studied. If the leader's score is more than twice the second place contestant's score, the leader can guarantee victory by making a sufficiently small wager.[21]:269 Otherwise, according to Jeopardy! College Champion Keith Williams, the leader will usually wager such that he or she will have a dollar more than twice the second place contestant's score, guaranteeing a win with a correct response.[22] Writing about Jeopardy! wagering in the 1990s, Gilbert and Hatcher said that \"most players wager aggressively\".[21]:269\n\nWinnings [ edit ]\n\nThe top scorer in each game is paid their winnings in cash and returns to play in the next match. In the case of a tie, all tying top scorers were paid their winnings. Non-winners receive consolation prizes instead of their winnings in the game. Since May 16, 2002, consolation prizes have been $2,000 for the second-place contestant(s) and $1,000 for the third-place contestant.[23] Since the show does not generally provide travel or lodging for contestants, cash consolation prizes offset these costs. The show pays for travel for returning champions and players invited back because of errors who must make multiple trips to Los Angeles. If a tournament travels (does not stay in Los Angeles) on the second week, the show pays for travel.\n\nDuring Art Fleming's hosting run, all three contestants received their winnings in cash (contestants who finished with a negative score were not required to pay) and parting gifts, usually an encyclopedia set. This was changed at the start of Trebek's hosting run to avoid the problem of contestants who would stop participating in the game, or avoid wagering in Final Jeopardy!, rather than risk losing the money they had already won; this also allowed the show to increase the clue values since only one contestant's score would have to be paid instead of three. From 1984 to 2002, non-winning contestants on the Trebek version received vacation packages and merchandise, which were donated by manufacturers as promotional consideration. Since 2004, a presenting sponsor has provided cash prizes to the losing contestants (As of 2019 , GEICO serves as the presenting sponsor of the consolation prizes, except for the Tournaments, which are sponsored by Consumer Cellular).\n\nReturning champions [ edit ]\n\nThe winner of each episode returns to compete against two new contestants on the next episode. Originally, a contestant who won five consecutive days retired undefeated and was guaranteed a spot in the Tournament of Champions; the five-day limit was eliminated at the beginning of season 20 on September 8, 2003.[27]\n\nSince November 2014,[28] ties for first place following Final Jeopardy! are broken with a tie-breaker clue, resulting in only a single champion being named, keeping their winnings, and returning to compete in the next show. The tied contestants are given the single clue, and the first contestant to buzz-in must give the correct question. A contestant cannot win by default if the opponent gives an incorrect question; that contestant must give a correct question to win the game. If neither player gives the correct question, another clue is given.[29] Previously, if two or all three contestants tied for first place, they were declared \"co-champions\", and each retained his or her winnings and (unless one was a five-time champion who retired prior to 2003) returned on the following episode. A tie occurred on the January 29, 2014, episode when Arthur Chu, leading at the end of Double Jeopardy!, wagered to tie challenger Carolyn Collins rather than winning; Chu followed Jeopardy! College Champion Keith Williams's advice to wager for the tie to increase the leader's chances of winning.[30][31] A three-way tie for first place has only occurred once on the Trebek version, on March 16, 2007, when Scott Weiss, Jamey Kirby, and Anders Martinson all ended the game with $16,000.[32] Until March 1, 2018,[28][33] no regular game had ended in a tie-breaker; however, numerous tournament games have ended with a tie-breaker clue.\n\nIf no contestant finishes Final Jeopardy! with a positive total, there is no winner. This has happened on several episodes,[34][35] most recently on January 18, 2016.[36] Three new contestants appear on the next episode. A triple zero has also occurred twice in tournament play (1991 Seniors and 2013 Teen), and also once in a Celebrity Week episode in 1998.[37] All consolation prize money (regular play, with two $2,000 prizes and one $1,000 prize, and celebrity play, prize money for charities) are based on standard rules (score after Double Jeopardy!). In tournament play, an additional high scoring non-winner will advance to the next round (but all three players with a zero score in that game are eligible for that position should the score for that non-winner be zero; all tie-breaker rules apply).\n\nA winner unable to return as champion because of a change in personal circumstances – for example, illness or a job offer – may be allowed to appear as a co-champion in a later episode.[38][39][40]\n\nTypically, the two challengers participate in a backstage draw to determine lectern positions. In all situations with three new contestants (most notably, unseeded tournaments in the first round), the draw will also determine who will take the champion's position and select first to start the game. (The player scoring the highest in the preceding round will be given the chance to select first in the semi-final and finals.)\n\nVariations for tournament play [ edit ]\n\nTournaments generally run for 10 consecutive episodes and feature 15 contestants. The first five episodes, the quarter-finals, feature three new contestants each day. Other than in the Tournament of Champions, the quarter-finals are unseeded and contestants participate in a random draw to determine playing order and lectern positions over the course of the five games. The Tournament of Champions is seeded based on total winnings in regular games to determine playing order and lectern positions, with the top five players occupying the champion's lectern for the quarter-final games.\n\nThe winners of the five quarter-final games and the four highest-scoring non-winners (\"wild cards\"), advance to the semi-finals, which run for three days. The semi-finals are seeded with the quarter-final winners being seeded 1–5 based on their quarter-final scores and the wild cards being seeded 6–9. The winners of the quarter-final games with the three highest scores occupy the champion's lectern for the semi-finals. The winners of the three semi-final games advance to play in a two-game final match, in which the scores from both games are combined to determine the overall standings. This format has been used since the first Tournament of Champions in 1985 and was devised by Trebek himself.\n\nTo prevent later contestants from playing to beat the earlier wild card scores instead of playing to win, contestants are \"completely isolated from the studio until it is their time to compete\".\n\nIf there is a tie for the final wild-card position, the non-winner that advances will be based on the same regulations as two contestants who tie for second; the tie-breaker is the contestant's score after the Double Jeopardy! round, and if further tied, the score after the Jeopardy! round determines the contestant who advances as the wild card.\n\nIf two or more contestants tie for the highest score (greater than zero) at the end of the match (first round, semi-final game, or end of a two-game final), the standard tiebreaker is used. However, if two or more contestants tie for the highest score at the end of the first game of a two-game final, no tiebreaker is played.\n\nIf none of the contestants in a quarter-final or semi-final game end with a positive score, no contestant automatically qualifies from that game, and an additional wild card contestant advances instead.[43] This occurred in the quarter-finals of the 1991 Seniors Tournament and the semi-finals of the 2013 Teen Tournament.[43]\n\nIn the finals, contestants who finish Double Jeopardy! with a $0 or negative score on either day do not play Final Jeopardy! that day. Their score for that leg is recorded as $0.\n\nConception and development [ edit ]\n\nIn a 1964 Associated Press profile released shortly before the original Jeopardy! series premiered, Merv Griffin offered the following account of how he created the quiz show:\n\nMy wife Julann just came up with the idea one day when we were in a plane bringing us back to New York City from Duluth. I was mulling over game show ideas, when she noted that there had not been a successful 'question and answer' game on the air since the quiz show scandals. Why not do a switch, and give the answers to the contestant and let them come up with the question? She fired a couple of answers to me: \"5,280\"—and the question of course was 'How many feet in a mile?'. Another was '79 Wistful Vista'; that was Fibber and Mollie McGee's address. I loved the idea, went straight to NBC with the idea, and they bought it without even looking at a pilot show.[44][45]\n\nGriffin's first conception of the game used a board comprising ten categories with ten clues each, but after finding that this board could not easily be shown on camera, he reduced it to two rounds of thirty clues each, with five clues in each of six categories. He originally intended the show to require grammatically correct phrasing (e.g., only accepting \"Who is ...\" for a person), but after finding that grammatical correction slowed the game down, he decided that the show should instead accept any correct response that was in question form. Griffin discarded his initial title for the show, What's the Question?, when skeptical network executive Ed Vane rejected his original concept of the game, claiming, \"It doesn't have enough jeopardies.\"\n\nJeopardy! was not the first game show to give contestants the answers and require the questions. That format had previously been used by the Gil Fates-hosted program CBS Television Quiz, which aired from July 1941 until May 1942.\n\nPersonnel [ edit ]\n\nHosts and announcers [ edit ]\n\nArt Fleming hosted the NBC and syndicated versions from 1964 to 1975, and again from 1978 to 1979. Alex Trebek has hosted the daily syndicated version since 1984.\n\nThe first three versions of the show were hosted by Art Fleming. Don Pardo served as announcer for the original NBC version and weekly syndicated version, but when NBC's revival The All-New Jeopardy! launched in 1978, Pardo's announcing duties were taken over by John Harlan.\n\nAlex Trebek has served as host of the daily syndicated version since it premiered in 1984, except when he switched places with Wheel of Fortune host Pat Sajak as an April Fool's joke on the episode aired April 1, 1997.[52]\n\nThe announcer introduces the challengers followed by the returning champion, stating the champion's total winnings thus far. The announcer then introduces the host. Throughout the show, the announcer provides voice-overs during lead-ins to and exits from a commercial break. Additional duties include announcing any consolation prizes offered and fee plugs for sponsors of the show. Prior to taping, the announcer handles warm-up duties, exciting the crowd prior to the commencement of taping. In the daily syndicated version's first pilot, from 1983, Jay Stewart served as the show's announcer, but Johnny Gilbert took over the role when that version was picked up as a series and has held it since then, although Sarah Whitcomb Foss of the show's Clue Crew has replaced him in selected taping sessions in recent years, as Gilbert has reduced his schedule because of his age. In episodes where Foss is the in-studio announcer, Gilbert's announcing of the contestants and host are added in post-production and is heard in the television broadcast.[53]\n\nOn a Fox News program in July 2018, Trebek said the odds of his retirement in 2020 were 50/50 \"and a little less\". He added that he might continue if he's \"not making too many mistakes\" but would make an \"intelligent decision\" as to when he should give up the emcee role.[54] In November 2018, it was announced that he had renewed his contract as host through 2022,[55] stating in January 2019 that the show's work schedule, consisting of 46 taping sessions each year, was still manageable for a man of his age.[56] On March 6, 2019, Trebek announced he had been diagnosed with stage IV pancreatic cancer. In a prepared video statement announcing his diagnosis, Trebek noted that his prognosis was poor but that he would aggressively fight the cancer in hopes of beating the odds and would continue hosting Jeopardy! for as long as he was able, joking that his contract obligated him to do so for three more years regardless of health.[57]\n\nClue Crew [ edit ]\n\nThe Jeopardy! Clue Crew, introduced on September 24, 2001, is a team of roving correspondents who appear in videos, recorded around the world, to narrate some clues.[58] Explaining why the Clue Crew was added to the show, executive producer Harry Friedman said, \"TV is a visual medium, and the more visual we can make our clues, the more we think it will enhance the experience for the viewer.\"[59]\n\nFollowing the initial announcement of auditions for the team, over 5,000 people applied for Clue Crew posts.[59] The original Clue Crew members were Cheryl Farrell, Jimmy McGuire, Sofia Lidskog, and Sarah Whitcomb.[58] Lidskog departed the Clue Crew in 2004 to become an anchor on the high school news program Channel One News, and a search was held to replace her in early 2005.[60] The winners were Jon Cannon and Kelly Miyahara, who formally joined the crew starting in season 22, which premiered on September 12, 2005.[61] Farrell continued to record clues for episodes aired as late as October 2008,[62] and Cannon continued to appear until July 2009.[63]\n\nThe Clue Crew has traveled to 280 cities worldwide, spanning all 50 of the United States and 44 other countries. In addition to appearing in Jeopardy! clue videos, the team's members also travel to meet fans of the show and future contestants. Occasionally, they visit schools to showcase the educational game Classroom Jeopardy![64] Miyahara also serves as announcer for the Sports Jeopardy! spin-off series.[65]\n\nProduction staff [ edit ]\n\nRobert Rubin served as the producer of the original Jeopardy! series for most of its run, and later became its executive producer.[66] Following Rubin's promotion, the line producer was Lynette Williams.[66]\n\nGriffin was the daily syndicated version's executive producer until his retirement in 2000. Trebek served as producer as well as host until 1987, when he began hosting NBC's Classic Concentration for the next four years. At that time, he handed producer duties to George Vosburgh, who had formerly produced The All-New Jeopardy!. In the 1997–1998 season, Vosburgh was succeeded as producer by Harry Friedman, Lisa Finneran, and Rocky Schmidt. Beginning in 1999, Friedman became executive producer,[68] and Gary Johnson became the show's new third producer. In the 2006–2007 season, Deb Dittmann and Brett Schneider became the producers, and Finneran, Schmidt, and Johnson were promoted to supervising producers.[66]\n\nThe original Jeopardy! series was directed at different times by Bob Hultgren, Eleanor Tarshis, and Jeff Goldstein.[66] Dick Schneider, who directed episodes of The All-New Jeopardy!, returned as director for the Trebek version's first eight seasons. From 1992 to 2018, the show was directed by Kevin McCarthy, who had previously served as associate director under Schneider. McCarthy announced his retirement after 26 years on June 26, 2018, and was succeeded as director by Clay Jacobsen.[69]\n\nAs of 2012, Jeopardy! employs nine writers and five researchers to create and assemble the categories and clues.[70] Billy Wisse and Michele Loud, both longtime staff members, are the editorial producer and editorial supervisor, respectively.[71] Previous writing and editorial supervisors have included Jules Minton, Terrence McDonnell, Harry Eisenberg, and Gary Johnson.[66] Trebek himself also contributes to writing clues and categories.[72]\n\nThe show's production designer is Naomi Slodki.[71] Previous art directors have included Henry Lickel, Dennis Roof, Bob Rang,[66] and Ed Flesh (who also designed sets for other game shows such as The $25,000 Pyramid, Name That Tune, and Wheel of Fortune).[74]\n\nIn August 2019, Mike Richards was announced as the successor to Harry Friedman as the executive producer of both Jeopardy! and its sister program, Wheel of Fortune. Friedman will retire after the 2019–20 season.[75]\n\nProduction [ edit ]\n\nThe daily syndicated version of Jeopardy! is produced by Sony Pictures Television (previously known as Columbia TriStar Television, the successor company to original producer Merv Griffin Enterprises).[76] The copyright holder is Jeopardy Productions, which, like SPT, operates as a subsidiary of Sony Pictures Entertainment.[77] The rights to distribute the program worldwide are owned by CBS Television Distribution, which absorbed original distributor King World Productions in 2007.[78]\n\nThe original Jeopardy! series was taped in Studio 6A at NBC Studios at 30 Rockefeller Plaza in New York City,[79] and The All-New Jeopardy! was taped in Studio 3 at NBC's Burbank Studios at 3000 West Alameda Avenue in Burbank, California. The Trebek version was initially taped at Metromedia Stage 7, KTTV, on Sunset Boulevard in Hollywood, but moved its production facilities to Hollywood Center Studios' Stage 9 in 1985. After the final shows of season 10 were recorded on February 15, 1994, the Jeopardy! production facilities were moved to Sony Pictures Studios' Stage 10 on Washington Boulevard in Culver City, California, where the show has been recorded ever since.\n\nFive episodes are taped each day, with two days of taping every other week.[81]\n\nSet [ edit ]\n\nVarious sets used by the syndicated version over the years. From top to bottom: 1984–85, 1985–91, 1991–96, 1996–2002, 2002–06, and 2009–13.\n\nVarious technological and aesthetic changes have been made to the Jeopardy! set over the years. The original game board was exposed from behind a curtain and featured clues printed on cardboard pull cards which were revealed as contestants selected them. The All-New Jeopardy!'s game board was exposed from behind double-slide panels and featured flipping panels with the dollar amount on one side and the clue on the other. When the Trebek version premiered in 1984, the game board used individual television monitors for each clue within categories. The original monitors were replaced with larger and sleeker ones in 1991. In 2006, these monitors were discarded in favor of a nearly seamless projection video wall,[83] which was replaced in 2009 with 36 high-definition flat-panel monitors manufactured by Sony Electronics.[84]\n\nFrom 1985 to 1997, the sets were designed to have a background color of blue for the Jeopardy! round and red for the Double Jeopardy! and Final Jeopardy! rounds. At the beginning of season 8 in 1991, a brand new set was introduced that resembled a grid. On the episode aired November 11, 1996, two months after the start of season 13, Jeopardy! introduced the first of several sets designed by Naomi Slodki, who intended the set to resemble \"the foyer of a very contemporary library, with wood and sandblasted glass and blue granite\".\n\nShortly after the start of season 19 in 2002, the show switched to yet another new set, which was given slight modifications when Jeopardy! and sister show Wheel of Fortune transitioned to high-definition broadcasting in 2006.[83] During this time, the show began to feature virtual tours of the set on its official web site.[87] The various HD improvements for Jeopardy! and Wheel represented a combined investment of approximately $4 million, 5,000 hours of labor, and 6 miles (9.7 km) of cable.[83] Both shows had been shot using HD cameras for several years before beginning to broadcast in HD. On standard-definition television broadcasts, the shows continue to be displayed with an aspect ratio of 4:3.\n\nIn 2009, Jeopardy! updated its set once again. The new set debuted with special episodes taped at the 42nd annual International CES technology trade show, hosted at the Las Vegas Convention Center in Winchester (Las Vegas Valley), Nevada, and became the primary set for Jeopardy! when the show began taping its 26th season, which premiered on September 14, 2009.[84] It was significantly remodeled when season 30 premiered in September 2013.[88]\n\nTheme music [ edit ]\n\nSince the debut of Jeopardy! in 1964, several songs and arrangements have served as the theme music for the show, most of which were composed by Griffin. The main theme for the original Jeopardy! series was \"Take Ten\",[89] composed by Griffin's wife Julann.[90] The All-New Jeopardy! opened with \"January, February, March\" and closed with \"Frisco Disco\", both of which were composed by Griffin himself.[91]\n\nThe best-known theme song on Jeopardy! is \"Think!\", originally composed by Griffin under the title \"A Time for Tony\", as a lullaby for his son.[92] \"Think!\" has always been used for the 30-second period in Final Jeopardy! when the contestants write down their responses, and since the syndicated version debuted in 1984, a rendition of that tune has been used as the main theme song. \"Think!\" has become so popular that it has been used in many different contexts, from sporting events to weddings. Griffin estimated that the use of \"Think!\" had earned him royalties of over $70 million throughout his lifetime.[95] \"Think!\" led Griffin to win the Broadcast Music, Inc. (BMI) President's Award in 2003,[96] and during GSN's 2009 Game Show Awards special, it was named \"Best Game Show Theme Song\".[97] In 1997, the main theme and Final Jeopardy! recordings of \"Think!\" were rearranged by Steve Kaplan, who served as the show's music director until his December 2003 death.[98] In 2008, Chris Bell Music and Sound Design overhauled the Jeopardy! music package for the show's 25th anniversary.[99]\n\nAudition process [ edit ]\n\nFor the original Jeopardy! series, prospective contestants called the show's office in New York to arrange an appointment and to preliminarily determine eligibility. They were briefed and auditioned together in groups of ten to thirty individuals, participating in both a written test and mock games. Individuals who were successful at the audition were invited to appear on the program within approximately six weeks.\n\nAuditioning for the current version of the show begins with a written exam, comprising fifty questions in total. This exam is administered online periodically, as well as being offered at regional contestant search events. Since season 15 (1998–99), the show has used a Winnebago recreational vehicle called the \"Jeopardy! Brain Bus\" to conduct regional events throughout the United States and Canada. Participants who correctly answer at least 35 out of 50 questions advance in the audition process and are invited to attend in-person group auditions throughout the country. At these auditions, a second written exam is administered, followed by a mock game and interviews. Those who are approved are notified at a later time and invited to appear on the show. Eligibility is limited to persons who have never been on the show, and have not been to an in-person audition in at least 18 months.[102]\n\nMany of the contestants who appear on the series, including a majority of Teen Tournament contestants and nearly half of all College Tournament contestants, appeared on quiz bowls during their time in high school. The National Academic Quiz Tournaments has been described by Ken Jennings as a de facto \"minor league\" for game shows such as Jeopardy![103]\n\nBroadcast history [ edit ]\n\nThe original Jeopardy! series premiered on NBC on March 30, 1964, and by the end of the 1960s was the second-highest-rated daytime game show, behind only The Hollywood Squares. The show was successful until 1974, when Lin Bolen, then NBC's Vice President of Daytime Programming, moved the show out of the noontime slot where it had been located for most of its run, as part of her effort to boost ratings among the 18–34 female demographic. After 2,753 episodes, the original Jeopardy! series ended on January 3, 1975; to compensate Griffin for its cancellation, NBC purchased Wheel of Fortune, another show that he had created, and premiered it the following Monday. A syndicated edition of Jeopardy!, distributed by Metromedia and featuring many contestants who were previously champions on the original series, aired in the primetime during the 1974–1975 season. The NBC daytime series was later revived as The All-New Jeopardy!, which premiered on October 2, 1978[108] and aired 108 episodes, ending on March 2, 1979;[109] this revival featured significant rule changes, such as progressive elimination of contestants over the course of the main game, and a Super Jeopardy! bonus round (based loosely on bingo) instead of Final Jeopardy!\n\nThe daily syndicated version debuted on September 10, 1984, and was launched in response to the success of the syndicated version of Wheel and the installation of electronic trivia games in pubs and bars. This version of the program has outlived 300 other game shows and become the second most popular game show in syndication (behind Wheel), averaging 25 million viewers per week. The show's most recent renewal, in October 2018, extends it through the 2022–23 season.[113]\n\nJeopardy! listed in yellow (the common Arabic-language version in light yellow) Countries with versions oflisted in yellow (the common Arabic-language version in light yellow)\n\nJeopardy! has spawned versions in many foreign countries throughout the world, including Canada, the United Kingdom, Germany, Sweden, Russia, Denmark, Israel, and Australia. The American syndicated version of Jeopardy! is also broadcast throughout the world, with international distribution rights handled by CBS Studios International.[115]\n\nThree spin-off versions of Jeopardy! have been created. Rock & Roll Jeopardy! debuted on VH1 in 1998 and ran until 2001; the show centered around post-1950s popular music trivia and was hosted by Jeff Probst. Jep!, which aired on GSN during the 1998–1999 season, was a special children's version hosted by Bob Bergen and featured various rule changes from the original version. Sports Jeopardy!, a sports-themed version hosted by Dan Patrick, premiered in 2014 on the Crackle digital service and eventually moved to the cable sports network NBCSN in 2016.[118]\n\nArchived episodes [ edit ]\n\nOnly a small number of episodes of the first three Jeopardy! versions survive. From the original NBC daytime version, archived episodes mostly consist of black-and-white kinescopes of the original color videotapes. Various episodes from 1967, 1971, 1973, and 1974 are listed among the holdings of the UCLA Film and Television Archive.[120] The 1964 \"test episode\", Episode No. 2,000 (from February 21, 1972, in color), and a June 1975 episode of the weekly syndicated edition exist at the Paley Center for Media.[121] The 1975 series finale, also in color and containing two short clips from the 1967 \"College Scholarship Tournament\" and Gene Shalit's appearance on an early version of Celebrity Jeopardy! also exists in its entirety. Incomplete paper records of the NBC-era games exist on microfilm at the Library of Congress. GSN holds The All-New Jeopardy!'s premiere and finale in broadcast quality, and aired the latter on December 31, 1999, as part of its \"Y2Play\" marathon.[109] The UCLA Archive holds a copy of a pilot taped for CBS in 1977,[120] and the premiere exists among the Paley Center's holdings.[121]\n\nGSN, which, like Jeopardy!, is an affiliate of Sony Pictures Television, has rerun ten seasons since the channel's launch in 1994. Copies of 43 Trebek-hosted syndicated Jeopardy! episodes aired between 1989 and 2004 have been collected by the UCLA Archive,[120] and the premiere and various other episodes are included in the Paley Center's collection.[121]\n\nReception [ edit ]\n\nAlex Trebek with the Peabody Award, 2012\n\nBy 1994, the press called Jeopardy! \"an American icon\".[122] It has won a record 33 Daytime Emmy Awards.[123] The show holds the record for the Daytime Emmy Award for Outstanding Game/Audience Participation Show, with fifteen awards won in that category.[70] Another five awards have been won by Trebek for Outstanding Game Show Host.[70] Twelve other awards were won by the show's directors and writers in the respective categories of Outstanding Direction for a Game/Audience Participation Show and Outstanding Special Class Writing before these categories were removed in 2006. On June 17, 2011, Trebek shared the Lifetime Achievement Award with Sajak at the 38th Annual Daytime Emmy Awards ceremony.[124] The following year, the show was honored with a Peabody Award for its role in encouraging, celebrating, and rewarding knowledge.[125]\n\nIn its April 17–23, 1993 issue, TV Guide named Jeopardy! the best game show of the 1970s as part of a celebration of its 40th anniversary.[126] In January 2001, the magazine ranked the show number 2 on its \"50 Greatest Game Shows\" list—second only to The Price Is Right.[127] It would later rank Jeopardy! number 45 on its list of the 60 Best TV Series of All Time, calling it \"habit-forming\" and saying that the program \"always makes [its viewers] feel smarter\".[128] Also in 2013, the show ranked number 1 on TV Guide's list of the 60 Greatest Game Shows.[129] In the summer of 2006, the show was ranked number 2 on GSN's list of the 50 Greatest Game Shows of All Time, second only to Match Game.[130]\n\nA hall of fame honoring Jeopardy! was added to the Sony Pictures Studios tour on September 20, 2011. It features the show's Emmy Awards as well as retired set pieces, classic merchandise, video clips, photographs, and other memorabilia related to Jeopardy!'s history.[131]\n\nIn 1989, Fleming expressed dissatisfaction with the daily syndicated Jeopardy! series in an essay published in Sports Illustrated. He confessed that he only watched the Trebek version infrequently, and then only for a handful of questions; and also criticized this new iteration mainly for its Hollywood setting. Fleming believed that, in contrast to New Yorkers who Fleming considered to be more intelligent and authentic, moving the show to Hollywood brought both an unrealistic glamour and a dumbing-down of the program that he disdained. He also disliked the decision to not award losing contestants their cash earnings (believing the parting gifts offered instead to be cheap) and expressed surprise that what he considered to be a parlor game had transformed into such a national phenomenon under Trebek.[132] In television interviews, Fleming expressed similar sentiments while also noting that he approved of Trebek's approach to hosting, that Fleming and Trebek were personal friends, and that despite the modern show's flaws it was still one of the best shows on television.[133][134]\n\nJeopardy!'s answer-and-question format has become widely entrenched: Fleming observed that other game shows would have contestants phrasing their answers in question form, leading hosts to remind them that they are not competing on Jeopardy!\n\n\n\n\n\nAwards [ edit ]\n\nTournaments and other events [ edit ]\n\nRegular events [ edit ]\n\nStarting in 1985, the show has held an annual Tournament of Champions featuring the top fifteen champions who have appeared on the show since the last tournament. The top prize awarded to the winner was originally valued at $100,000, and increased to $250,000 in 2003.[136] Other regular tournaments include the Teen Tournament, with a $100,000 top prize;[115] the College Championship, in which undergraduate students from American colleges and universities compete for a $100,000 top prize; and the Teachers Tournament, where educators compete for a $100,000 top prize.[137] Each tournament runs for ten consecutive episodes in a format devised by Trebek himself, consisting of five quarter-final games, three semi-finals, and a final consisting of two games with the scores totaled. Winners of the College Championship and Teachers Tournament are invited to participate in the Tournament of Champions.\n\nNon-tournament events held regularly on the show include Celebrity Jeopardy!, in which celebrities and other notable individuals compete for charitable organizations of their choice; and Kids Week, a special competition for school-age children aged 10 through 12.[139]\n\nSpecial events [ edit ]\n\nThree International Tournaments, held in 1996, 1997, and 2001, featured one-week competitions among champions from each of the international versions of Jeopardy!. Each of the countries that aired their own version of the show in those years could nominate a contestant. The format was identical to the semi-finals and finals of other Jeopardy! tournaments. In 1996 and 1997, the winner received $25,000; in 2001, the top prize was doubled to $50,000. The 1997 tournament was recorded in Stockholm on the set of the Swedish version of Jeopardy!, and is significant for being the first week of Jeopardy! episodes to be taped in a foreign country.\n\nThere have been a number of special tournaments featuring the greatest contestants in Jeopardy! history. The first of these \"all-time best\" tournaments, Super Jeopardy!, aired in the summer of 1990 on ABC, and featured 35 top contestants from the previous seasons of the Trebek version and one notable champion from the original Jeopardy! series competing for a top prize of $250,000. In 1993, that year's Tournament of Champions was followed by a Tenth Anniversary Tournament conducted over five episodes. In May 2002, to commemorate the Trebek version's 4,000th episode, the show invited fifteen champions to play for a $1 million prize in the Million Dollar Masters tournament, which took place at Radio City Music Hall in New York City. The Ultimate Tournament of Champions aired in 2005 and pitted 145 former Jeopardy! champions against each other, with two winners moving on to face Ken Jennings in a three-game final for $2,000,000, the largest prize in the show's history; overall, the tournament spanned 15 weeks and 76 episodes, starting on February 9 and ending on May 25.[142] In 2014, Jeopardy! commemorated the 30th anniversary of the Trebek version with a Battle of the Decades tournament, in which 15 champions apiece from the first, second, and third decades of Jeopardy!'s daily syndicated history competed for a grand prize of $1,000,000.[143] On November 18, 2019, it was announced that Jeopardy! would return to ABC for a primetime \"Greatest of All Time\" tournament beginning January 7, 2020, which would be played between Ken Jennings, Brad Rutter, and James Holzhauer. The event used a multi-night format, with each episode featuring a two-game match. The contestant with the higher cumulative money total across both games would be declared the winner of the match: the first to win three matches would receive a $1,000,000 prize.[144] The tournament concluded on January 14, 2020 after four matches, with Ken Jennings winning three matches to Holzhauer's one and Rutter's zero wins.[145]\n\nIn November 1998, Jeopardy! traveled to Boston to reassemble 12 past Teen Tournament contestants for a special Teen Reunion Tournament. In 2008, the 25th season began with reuniting 15 contestants from the first two Kids Weeks to compete in a special reunion tournament of their own.[146] During the next season (2009–2010), a special edition of Celebrity Jeopardy!, called the Million Dollar Celebrity Invitational, was played in which twenty-seven contestants from past celebrity episodes competed for a grand prize of $1,000,000 for charity; the grand prize was won by Michael McKean.[147]\n\nThe IBM Challenge aired February 14–16, 2011, and featured IBM's Watson computer facing off against Ken Jennings and Brad Rutter in a two-game match played over three shows.[148] This was the first man-vs.-machine competition in Jeopardy!'s history.[149] Watson won both the first game and the overall match to win the grand prize of $1 million, which IBM divided between two charities (World Vision International and World Community Grid).[150] Jennings, who won $300,000 for second place, and Rutter, who won the $200,000 third-place prize, both pledged to donate half of their winnings to charity.[151] The competition brought the show its highest ratings since the Ultimate Tournament of Champions.[152]\n\nIn 2019, The All-Star Games had six teams with three former champions each. Each team member played one of the three rounds in each game played. Rutter, David Madden and Larissa Kelly won the tournament.[153]\n\nRecord holders [ edit ]\n\nJeopardy!'s record for the longest winning streak is held by Ken Jennings, who competed on the show from June 2 through November 30, 2004, winning 74 matches before being defeated by Nancy Zerg in his 75th appearance. He amassed $2,522,700 over his 75 episodes, for an average of $33,636 per episode. At the time, he held the record as the highest money-winner ever on American game shows, and his winning streak increased the show's ratings and popularity to the point where it became TV's highest-rated syndicated program.[154] In addition to these winnings on the daily Jeopardy! series, Jennings returned for a number of Jeopardy! special tournaments, taking home the following (according to many sources): the second-place prize of $500,000 in the 2005 Jeopardy! Ultimate Tournament of Champions, the $300,000-second-place prize in the 2011 Jeopardy! IBM Challenge, the $123,600 second-place prize in the 2014 Jeopardy! Battle of the Decades, a $100,000 prize (one-third of the $300,000 second-place prize to his three-player team) in the 2019 Jeopardy! All-Star Games,[155] and the $1,000,000 first-place prize in the 2020 Jeopardy! The Greatest of All Time tournament. This brings his lifetime Jeopardy!-related winnings to $4,546,300. Including over $700,000 from non-Jeopardy! game shows, he currently is the highest winner in international game show history, with $5,247,015 in total.\n\nThe record holder for lifetime Jeopardy!-related winnings is Brad Rutter, who has won nearly $5.2 million in cash and prizes across five episodes of the regular series (when the rules stipulated that a contestant who won five consecutive days retired undefeated) and seven Jeopardy! tournaments and events (winning five of those specials, along with two third-place finishes).[156] Counting all prizes that he won, he has achieved a cumulative total of $5,127,846 in winnings, which included: the $55,102 prize over five regular episodes in 2000 (it also including the value of two cars also won, worth $42,150), the $100,000 first-place prize in the 2001 Jeopardy! Tournament of Champions,[157] the $1,000,000 first-place prize in the 2002 Jeopardy! Million Dollar Masters Tournament, the $2,000,000 first-place prize (plus $115,000 in preliminary rounds) in the 2005 Jeopardy! Ultimate Tournament of Champions,[158] the $200,000 third-place prize in the 2011 Jeopardy! IBM Challenge, the $1,030,600 first-place prize in the 2014 Jeopardy! Battle of the Decades, $333,334 (one-third of the $1,000,000 first-place prize, shared with his three-player team) in the 2019 Jeopardy! All-Star Games and a $250,000 prize in the 2020 Jeopardy! The Greatest of All Time tournament. Including a $100,000 prize from Million Dollar Mind Game, Rutter is now in second place with $5,227,846 in total, and is currently in 2nd place in total game show winnings, behind Jennings.\n\nBoth Brad Rutter and Ken Jennings have been the two biggest game show winners in international television history since 2005 thanks to Jeopardy!. Rutter passed Jennings for all-time game show winnings in 2005 when he defeated Jennings in the Ultimate Tournament of Champions final, Jennings regained the all-time game show record in 2008 after accumulating winnings in various non-Jeopardy! shows, then Rutter regained the all-time game show record in 2014 when he defeated Jennings in the Jeopardy! Battle of the Decades final, and extended his margin when he defeated captain-Jennings' team in the Jeopardy! All-Star Games. Jennings later regained the title in 2020 by winning the Jeopardy! The Greatest of All Time tournament. Having played each other in five different Jeopardy! special events, Rutter has three wins and two third-place finishes, while Jennings has one win and four second-place finishes.\n\nThe holder of the all-time record for single-day winnings on Jeopardy! is James Holzhauer. Holzhauer first surpassed the record of $77,000, held since 2010[159] by Roger Craig, when he earned $110,914 on the episode that aired on April 9, 2019.[160] Holzhauer pushed his own single-day record to $131,127 on the episode that aired April 17, 2019,[161] by amassing $71,114 over the episode's first two rounds, then successfully wagering an additional $60,013 in the Final Jeopardy! round. Holzhauer's total of 33 consecutive appearances is second place of all time in regular game play; when he departed the show, he held the top 16 spots for highest single-day regular-game winnings and is the only player to win $100,000 or more (achieved six different times) on a single-day in regular play.[162] On April 15, 2019, Holzhauer moved into second place for regular play Jeopardy! winnings (behind Jennings) and third place for all Jeopardy!-related winnings (behind Rutter and Jennings). On April 23, 2019, Holzhauer joined Rutter and Jennings as the third Jeopardy!-made millionaire. The next day, Holzhauer moved onto the top ten list for all-time American game show winnings at #10, joining Rutter (#1) and Jennings (#2) on that list. Holzhauer was defeated on the June 3, 2019 episode, finishing in second place.[163] His winnings on Jeopardy! totaled $2,464,216,[164] $58,484 behind Jennings' record.[163] Including over $58,000 from a 2014 appearance on The Chase,[165] with Holzhauer's $2.96 million from Jeopardy! (Including his Tournament of Champions and The Greatest of All Time prizes), he is #3 on the list of all-time American game show winnings.\n\nThe record-holder among female contestants on Jeopardy!, for regular series winnings and consecutive appearances, is Julia Collins, with a total of $429,100, earned in 21 episodes in 2014. Collins won $428,100 in her 20 games as champion, plus $1,000 for finishing third in her twenty-first game, won by Brian Loughnane.[166] Her streak of 20 wins and 21 consecutive games is third all-time, behind Jennings (75 consecutive games) and Holzhauer.[167][168] Collins has lifetime Jeopardy!-related winnings of $495,767, when including $50,000 for her third-place finish in the 2014 Tournament of Champions, and $16,667 in 2019's All-Star Games (one-third of the $50,000 awarded to Team Julia – herself, Ben Ingram, and Seth Wilson – when they were eliminated in the first round).\n\nThe all-time leading money winner among women is Larissa Kelly, with a total of $660,930; $222,597 in six regular-play games, $100,000 for second place in the 2009 Tournament of Champions, $5,000 in 2014's Battle of the Decades, and $333,333 (one-third of $1,000,000) as part of the winning Team Brad (herself, Brad Rutter, and David Madden) in 2019's All-Star Games.\n\nThe highest single-day winnings in a Celebrity Jeopardy! tournament was achieved by comedian Andy Richter during a first-round game of the 2009–2010 season's \"Million Dollar Celebrity Invitational\", in which he finished with $68,000 for his selected charity, the St. Jude Children's Research Hospital.[169]\n\nFour contestants on the Trebek version share the record for winning a game with the lowest amount possible, at $1. The first was U.S. Air Force Lieutenant Colonel Darryl Scott, on the episode that aired January 19, 1993;[170][171] the second was Benjamin Salisbury, on a Celebrity Jeopardy! episode that aired April 30, 1997;[172] the third was Brandi Chastain, on the Celebrity Jeopardy! episode that aired February 9, 2001;[173] and the fourth was U.S. Navy Lieutenant Manny Abell, on the episode that aired October 17, 2017.[171]\n\nOther media [ edit ]\n\nPortrayals and parodies [ edit ]\n\nJeopardy! has been featured in a number of films, television shows and books over the years, mostly with one or more characters participating as contestants, or viewing and interacting with the game show from their own homes.\n\nMerchandise [ edit ]\n\nOver the years, the Jeopardy! brand has been licensed for various products. From 1964 through 1976, with one release in 1982, Milton Bradley issued annual board games based on the original Fleming version. The Trebek version has been adapted into board games released by Pressman Toy Corporation, Tyco Toys, and Parker Brothers.[188] In addition, Jeopardy! has been adapted into a number of video games released on various consoles and handhelds spanning multiple hardware generations, starting with a Nintendo Entertainment System game released in 1987.[189] The show has also been adapted for personal computers (starting in 1987 with Apple II, Commodore 64, and DOS versions[190]), Facebook,[191] Twitter, Android, and the Roku Channel Store.[192]\n\nA DVD titled Jeopardy!: An Inside Look at America's Favorite Quiz Show, released by Sony Pictures Home Entertainment on November 8, 2005, features five memorable episodes of the Trebek version (the 1984 premiere, Jennings' final game, and the three-game finals of the Ultimate Tournament of Champions)[193] and three featurettes discussing the show's history and question selection process.[194] Other products featuring the Jeopardy! brand include a collectible watch, a series of daily desktop calendars, and various slot machine games for casinos and the Internet.\n\nInternet [ edit ]\n\nJeopardy!'s official website, active as early as 1998,[195] receives over 400,000 monthly visitors. The website features videos, photographs, and other information related to each week's contestants, as well as mini-sites promoting remote tapings and special tournaments. As the show changes its main title card and corresponding graphics with every passing season, the Jeopardy! website is re-skinned to reflect the changes, and the general content of the site (such as online tests and promotions, programming announcements, \"spotlight\" segments, photo galleries, and downloadable content) is regularly updated to align with producers' priorities for the show.[197] In its 2012 \"Readers Choice Awards\", About.com praised the official Jeopardy! website for featuring \"everything [visitors] need to know about the show, as well as some fun interactive elements\", and for having a humorous error page.[198]\n\nIn November 2009, Jeopardy! launched a viewer loyalty program called the \"Jeopardy! Premier Club\", which allowed home viewers to identify Final Jeopardy! categories from episodes for a chance to earn points, and play a weekly Jeopardy! game featuring categories and clues from the previous week's episodes. Every three months, contestants were selected randomly to advance to one of three quarterly online tournaments; after these tournaments were played, the three highest scoring contestants would play one final online tournament for the chance to win $5,000 and a trip to Los Angeles to attend a taping of Jeopardy![199] The Premier Club was discontinued by July 2011.[200]\n\nThere is an unofficial Jeopardy! fansite known as the \"J! Archive\", which transcribes games from throughout Jeopardy!'s daily syndicated history. In the archive, episodes are covered by Jeopardy!-style game boards with panels which, when hovered over with a mouse, reveal the correct response to their corresponding clues and the contestant who gave the correct response. The site makes use of a \"wagering calculator\" that helps potential contestants determine what amount is safest to bet during Final Jeopardy!, and an alternative scoring method called \"Coryat scoring\" that disregards wagering during Daily Doubles or Final Jeopardy! and gauges one's general strength at the game. The site's main founding archivist is Robert Knecht Schmidt, originally a student from Cleveland, Ohio when he started the site around 2003, and currently a patent attorney, and supported by a team of moderators.[201][202] Schmidt himself appeared as a Jeopardy! contestant in March 2010.[203] Most new shows are automatically added to the archive through both machine-assisted tools and a team of moderators, while older shows must be manually archived from old recordings. The J! Archive has been mentioned as a resource by past winners of the show, including Ken Jennings and David Madden, and the archive was used as part of the material to prepare IBM's Watson for its appearance on the show.[202] Before J! Archive, there was an earlier Jeopardy! fansite known as the \"Jeoparchive\", created by season 19 contestant Ronnie O'Rourke, who managed and updated the site until Jennings's run in 2004 made her disillusioned with the show.[201]\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Horace_Newcomb_and_Alex_Trebek_%287268398640%29_%28cropped%29.jpg/158px-Horace_Newcomb_and_Alex_Trebek_%287268398640%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Jeopardy%21_logo.png/250px-Jeopardy%21_logo.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/19px-Symbol_support_vote.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Jeopardy_World_Locations.svg/220px-Jeopardy_World_Locations.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Jeopardy_game_board.png/255px-Jeopardy_game_board.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Wiktionary-logo-en-v2.svg/40px-Wiktionary-logo-en-v2.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/3/38/Jeopardy%21_set_evolution_%28daily_syndication%29.jpg/250px-Jeopardy%21_set_evolution_%28daily_syndication%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Art_Fleming_in_1970.png/139px-Art_Fleming_in_1970.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Alex_Trebek_%287269139314%29.jpg/220px-Alex_Trebek_%287269139314%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Kelly_Miyahara.jpg/220px-Kelly_Miyahara.jpg"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jeopardy!", "title": "Jeopardy!", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}