{"url": "https://deadline.com/2018/07/chris-hardwick-returning-talking-dead-amc-sexual-harassment-allegations-1202433461/", "text": "Days after being absent from his annual duty as moderator for The Walking Dead panel at Comic-Con, Chris Hardwick has been given the green light by AMC to return to the air after allegations of sexual assault and emotional abuse by an ex-girlfriend.\n\n“Following a comprehensive assessment by AMC, working with Ivy Kagan Bierman of the firm Loeb & Loeb, who has considerable experience in this area, Chris Hardwick will return to AMC as the host of Talking Dead and Talking with Chris Hardwick,” the cabler said in a statement Wednesday. “We take these matters very seriously and given the information available to us after a very careful review, including interviews with numerous individuals, we believe returning Chris to work is the appropriate step.”\n\nWith AMC taking the stage at TCA on July 29, the timing is obviously somewhat directed to clearing the slate for the cabler so its annual Hall H session would not turn into a one-issue discussion.\n\nThe plan is for Hardwick to be back on Talking Dead for its August 12 premiere, right after the Season 4 mid-season debut of Fear The Walking Dead.\n\nFrequent Talking Dead participant and Hardwick’s SDCC panel replacement Yvette Nicole Brown will still front the previously set TWD Season 9 preview special August 5 and appear as a guest on Talking Dead the following week. No return date for Season 2 of Talking With Chris Hardwick has been set yet due to scheduling issues, I hear. All episodes are already in the can.\n\nDeadline revealed July 4 that Community actor Brown would be taking over Hardwick’s SDCC duties. A week later, AMC confirmed that Brown, who called Hardwick a “friend” in a Independence Day tweet, would be fronting the Season 9 preview special for the zombie-apocalypse series and the series’ much watched aftershow as an “interim host” — only half of which she is doing now.\n\nReps for Hardwick did not respond to request for comment on the move by AMC.\n\nAfter accusations by Hardwick’s ex Chloe Dykstra surfaced on June 15, AMC a day later pulled the Season 2 June 17 premiere of Talking with Chris Hardwick. At the time, the calber also said that The Wall host would not participate in Talking Dead for the immediate future, nor for the TWD or Doctor Who panels at SDCC he had already been set for.\n\nOn June 15, Hardwick strongly denied the allegations from Dykstra, which included sexual and emotional abuse.\n\n“These are very serious allegations and not to be taken lightly which is why I’ve taken the day to consider how to respond,” said Hardwick that night. “I was heartbroken to read Chloe’s post. Our three year relationship was not perfect—we were ultimately not a good match and argued—even shouted at each other—but I loved her, and did my best to uplift and support her as a partner and companion in any way and at no time did I sexually assault her.”\n\nThe adamant response from the longtime AMC host and Nerdist founder followed the detailed and harrowing first-person account that Dykstra wrote for Medium. The post never called out Hardwick by name, but the post by TV personality and Syfy’s Heroes of Cosplay castmember made it pretty clear whom she was talking about. With the duo having played out so much of their time together in the public and digital spotlight, there were details about the “mildly successful podcaster” who became “a powerhouse CEO of his own company, their age difference and more. The details were indicative of the now married Hardwick, who announced online his break-up with Dykstra in 2014.\n\nDeclaring on June 16 that they were assessing the allegations, NBC has not announced whether Hardwick will be back for more of The Wall later this year.", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=deadline.com&path=%2F2018%2F07%2Fchris-hardwick-returning-talking-dead-amc-sexual-harassment-allegations-1202433461%2F&ct=article&lob=deadline&loc=us&env=desktop&post_id=1202433461&comment_count=96", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pmcdeadline2.files.wordpress.com/2018/06/amc-talking-with-chris-hardwick.jpg?w=630"], "top_img": "https://pmcdeadline2.files.wordpress.com/2018/06/amc-talking-with-chris-hardwick.jpg?w=630", "keywords": [], "authors": ["Dominic Patten"], "canonical_link": "https://deadline.com/2018/07/chris-hardwick-returning-talking-dead-amc-sexual-harassment-allegations-1202433461/", "title": "AMC Clears Chris Hardwick To Return To ‘Talking Dead’ After Sexual Assault Claims", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Deadline", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "More than a month after Chris Hardwick was taken off air following sexual assault allegations, AMC is bringing him back.", "news_keywords": "AMC, Chris Hardwick, Harassment, Talking Dead, The Walking Dead, Yvette Nicole Brown", "apple-itunes-app": "app-id=533209613", "generator": "WordPress.com", "og": {"type": "article", "title": "AMC Clears Chris Hardwick To Return To ‘Talking Dead’ After Sexual Assault Claims", "url": "https://deadline.com/2018/07/chris-hardwick-returning-talking-dead-amc-sexual-harassment-allegations-1202433461/", "description": "Days after being absent from his annual duty as moderator for The Walking Dead panel at Comic-Con, Chris Hardwick has been given the green light by AMC to return to the air after allegations of sex…", "site_name": "Deadline", "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2018/06/amc-talking-with-chris-hardwick.jpg?w=630", "width": 630, "height": 423, "alt": "AMC Talking With Chris Hardwick"}, "locale": "en_US"}, "article": {"published_time": "2018-07-25T19:30:00+00:00", "modified_time": "2018-07-25T23:06:52+00:00"}, "twitter": {"site": "@Deadline", "text": {"title": "AMC Clears Chris Hardwick To Return To ‘Talking Dead’ After Sexual Assault Claims"}, "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2018/06/amc-talking-with-chris-hardwick.jpg?w=630", "alt": "AMC Talking With Chris Hardwick"}, "card": "summary_large_image", "creator": "@DeadlineDominic", "title": "AMC Clears Chris Hardwick To Return To ‘Talking Dead’ After Sexual Assault Claims", "description": "More than a month after Chris Hardwick was taken off air following sexual assault allegations, AMC is bringing him back."}, "author": "Dominic Patten", "content_type": "Article", "post_id": 1202433461, "title": "AMC Clears Chris Hardwick To Return To 'Talking Dead' After Sexual Assault Claims", "published_at": "2018-07-25 12:30:00", "image": "https://pmcdeadline2.files.wordpress.com/2018/06/amc-talking-with-chris-hardwick.jpg?w=296&h=166&crop=1", "comment_count": 96, "tags": "Yvette Nicole Brown", "topics": "TV", "body": "Days after being absent from his annual duty as moderator for The Walking Dead panel at Comic-Con, Chris Hardwick has been given the green light by AMC to return to the air after allegations of sexual assault and emotional abuse by an ex-girlfriend.\r\n\r\n\"Following a comprehensive assessment by AMC, working with Ivy Kagan Bierman of the firm Loeb & Loeb, who has considerable experience in this area, Chris Hardwick will return to AMC as the host of Talking Dead and Talking with Chris Hardwick,\" the cabler said in a statement Wednesday. \"We take these matters very seriously and given the information available to us after a very careful review, including interviews with numerous individuals, we believe returning Chris to work is the appropriate step.”\r\n\r\nWith AMC taking the stage at TCA on July 29, the timing is obviously somewhat directed to clearing the slate for the cabler so its annual Hall H session would not turn into a one-issue discussion.\r\n\r\nThe plan is for Hardwick to be back on Talking Dead for its August 12 premiere, right after the Season 4 mid-season debut of Fear The Walking Dead.\r\n\r\nFrequent Talking Dead participant and Hardwick’s SDCC panel replacement Yvette Nicole Brown will still front the previously set TWD Season 9 preview special August 5 and appear as a guest on Talking Dead the following week. No return date for Season 2 of Talking With Chris Hardwick has been set yet due to scheduling issues, I hear. All episodes are already in the can.\r\n\r\nDeadline revealed July 4 that Community actor Brown would be taking over Hardwick's SDCC duties. A week later, AMC confirmed that Brown, who called Hardwick a \"friend\" in a Independence Day tweet, would be fronting the Season 9 preview special for the zombie-apocalypse series and the series’ much watched aftershow as an \"interim host\" -- only half of which she is doing now.\r\n\r\nReps for Hardwick did not respond to request for comment on the move by AMC.\r\n\r\n\r\n\r\nAfter accusations by Hardwick's ex Chloe Dykstra surfaced on June 15, AMC a day later pulled the Season 2 June 17 premiere of Talking with Chris Hardwick. At the time, the calber also said that The Wall host would not participate in Talking Dead for the immediate future, nor for the TWD or Doctor Who panels at SDCC he had already been set for.\r\n\r\nOn June 15, Hardwick strongly denied the allegations from Dykstra, which included sexual and emotional abuse.\r\n\r\n“These are very serious allegations and not to be taken lightly which is why I’ve taken the day to consider how to respond,” said Hardwick that night. “I was heartbroken to read Chloe’s post. Our three year relationship was not perfect—we were ultimately not a good match and argued—even shouted at each other—but I loved her, and did my best to uplift and support her as a partner and companion in any way and at no time did I sexually assault her.”\r\n\r\nThe adamant response from the longtime AMC host and Nerdist founder followed the detailed and harrowing first-person account that Dykstra wrote for Medium. The post never called out Hardwick by name, but the post by TV personality and Syfy’s Heroes of Cosplay castmember made it pretty clear whom she was talking about. With the duo having played out so much of their time together in the public and digital spotlight, there were details about the “mildly successful podcaster” who became “a powerhouse CEO of his own company, their age difference and more. The details were indicative of the now married Hardwick, who announced online his break-up with Dykstra in 2014.\r\n\r\nDeclaring on June 16 that they were assessing the allegations, NBC has not announced whether Hardwick will be back for more of The Wall later this year.", "application-name": "Deadline", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Hollywood Entertainment Breaking News", "msapplication-task": "name=Subscribe;action-uri=https://deadline.com/feed/;icon-uri=https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!", "fb": {"page_id": 105558754896}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1532547000.0, "source": "https://deadline.com", "summary": ""}