{"url": "https://www.bustle.com/p/a-new-american-horror-story-season-8-cast-photo-includes-a-secret-friend-heres-who-it-could-be-9661499", "text": "American Horror Story has a knack for keeping details about the upcoming season tightly under wraps. (Remember when fans didn't even know the theme of Season 6 until the premiere aired?) But a new American Horror Story Season 8 cast photo, which Billy Eichner recently posted on his Instagram, proves that the series is taking that stealth to new (and spooky) heights.\n\nThe image features Eichner out to dinner with some of his Season 8 AHS castmates, which includes the likes of Kathy Bates, Sarah Paulson, Joan Collins, Cheyenne Jackson, Billie Lourd, Leslie Grossman and Adina Porter. However, the picture also blatantly blocks out one other mystery person, who Eichner calls a \"secret friend.\" Covered up by an animated ghost, it's impossible to identify who this other cast member could be. Is it a beloved alum returning to the franchise or someone brand new to the series? Considering Ryan Murphy revealed that the new season would showcase a Murder House and Coven crossover, fans can definitely expect to see plenty of familiar faces.\n\nWhen it comes to divulging any other details on the matter, Eichner has refused to say boo about it (get it?) apart from his cryptic caption: \"With (some of) this season’s @ahsfx cast at dinner a few weeks ago...and a secret friend...it’s gonna be a wild one! Can’t wait....\"\n\nEmma Roberts has already basically confirmed she'll be returning as Madison Montgomery, so it seems unlikely that Eichner would call her a \"secret\" friend, but there are plenty of other options out there for fans to look forward to. And since the show doesn't look like it'll be giving up the ghost any time soon, here are a few theories that'll get you even more excited for September.\n\nJessica Lange\n\nObviously, this would be a huge get for Murphy considering his former leading lady hasn't appeared on the series since her Season 4 departure, though she did star in Murphy's other series Feud. Murphy did state in a since-deleted tweet, reported by SyFy, that \"All the witches are being asked back,\" and who better to include in that category than Coven's most badass Supreme?\n\nConnie Britton\n\nBritton's portrayal of Murder House's Vivien Harmon was instantly iconic, and while the actress has appeared in several other of Murphy's projects (9-1-1 and The People v. O.J. Simpson: American Crime Story), she has yet to come back to the AHS world. Perhaps Eichner's photo indicates that's all about to change. Britton is no longer starring in 9-1-1, so her schedule may allow for it.\n\nDylan McDermott\n\nBy the same token, McDermott could also be returning to his old stomping grounds, having played pivotal roles in both Season 1 and Season 2 of AHS before disappearing from the franchise without a trace. This seems like the perfect time for his return.\n\nLea Michele\n\nMichele has always been a favorite of Murphy's ever since she starred as Rachel Berry in Glee. In fact, she went on to star in one of his other cult favorite horror shows, Scream Queens, yet she has never made an appearance on AHS itself. There's no time like the present to rectify that situation.\n\nAnjelica Huston\n\nBack in April, Murphy told The Hollywood Reporter that he was very \"interested\" in adding Huston to the AHS Season 8 roster. She'd be a perfect addition to the Coven portion of the story, given her past experience in playing the Grand High Witch in the '90s film The Witches (as seen above). Not to mention the fact that her brother Danny Huston has appeared on the show multiple times, even playing the Axeman in Coven. That has some serious sibling crossover potential.\n\nCher\n\nCher's son, Chaz Bono, has appeared in the last two seasons of American Horror Story. She even hung out with the cast of Cult last year backstage at her Las Vegas show. It certainly sounds like she could be game to join the cast herself if the opportunity presented itself. And it's not like she doesn't have any experience playing a witch.\n\nBette Midler\n\nBecause if Disney isn't going to give us the Hocus Pocus remake that we want, then this is the next best thing.\n\nWhoever this \"secret friend\" is, viewers should be ready to be given quite a fright when the full cast for American Horror Story Season 8 is revealed.", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/16/a0c20f01-67af-4bfe-ae91-db67a37e5b8a-getty-1142135670.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/16/060a47f5-6a46-41c6-b963-760894135871-getty-966471954.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/7/3/0580a760-377d-49a2-8ae6-800e363ddebe-something-new-cta-all-articles.png?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/7/3/bbbff295-5d6c-4c1d-a78c-52bb4d32ab0d-getty-454179774.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2018/7/3/bbbff295-5d6c-4c1d-a78c-52bb4d32ab0d-getty-454179774.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2020/4/14/01bda445-2df3-4d6f-8c95-7ffcaa3896ec-fauda3natil-3783.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/16/865096ff-97de-40b2-90b5-e50cac0c9e21-screen-shot-2020-04-16-at-22011-pm.png?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/7/3/bbbff295-5d6c-4c1d-a78c-52bb4d32ab0d-getty-454179774.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/a-new-american-horror-story-season-8-cast-photo-includes-a-secret-friend-heres-who-it-could-be-9661499", "title": "A New 'American Horror Story’ Season 8 Cast Photo Includes A “Secret Friend” & Here’s Who It Could Be", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/a-new-american-horror-story-season-8-cast-photo-includes-a-secret-friend-heres-who-it-could-be-9661499", "type": "article", "title": "'AHS' Season 8 Is Getting A \"Secret\" Cast Member & Here Are The Best Theories Of Who It Could Be", "description": "American Horror Story has a knack for keeping details about the upcoming season tightly under wraps. (Remember when fans didn't even know the theme of Season 6 until the premiere aired?) But a new American Horror Story Season 8 cast photo, which…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/7/3/bbbff295-5d6c-4c1d-a78c-52bb4d32ab0d-getty-454179774.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "American Horror Story has a knack for keeping details about the upcoming season tightly under wraps. (Remember when fans didn't even know the theme of Season 6 until the premiere aired?) But a new American Horror Story Season 8 cast photo, which…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}