{"url": "https://www.thisisinsider.com/mindy-kaling-responds-to-office-meme-twitter-2018-4", "text": "There is currently a meme making its rounds on social media that plays on the phrase, \"If you can't handle me at my worst, you don't deserve me at my best.\"\n\nA Twitter user recently used photos of Mindy Kaling for the meme, comparing a photo of her character from \"The Office\" to a recent photo of the actress on the red carpet.\n\nKaling caught wind of the tweet and responded in a hilarious way.\n\n\"I don't get this, I'm equally pretty in both.\"\n\nWhile some users thought the original meme implied colorism, because Kaling's skin looked lighter in the second photo, the \"Mindy Project\" star clarified that she was making a joke.\n\n\n\nTwitter users often forget that celebrities are real people who can see what they post — and some celebrities will even respond if they feel so inclined. Mindy Kaling did just that when she caught wind of a recent tweet that used photos of her as a meme.\n\nThe meme plays on the phrase, \"If you can't handle me at my worst, you don't deserve me at my best.\" Users insert two photos that resemble a \"before and after\" to imply growth or improvement.\n\nTwitter user and Daily O writer Ishita Yadav used a photo of Kaling's character from \"The Office,\" Kelly Kapoor, from an episode when she was miserable and exhausted from a diet cleanse. The second photo showed Kaling at a recent red carpet event.\n\n\"I don't get this, I'm equally pretty in both,\" Kaling responded.\n\nAlthough Kaling's tone seemed lighthearted, many people actually took issue with the original post for a perceived implication of colorism. In the first photo, Kaling's skin appears notably darker than in the second.\n\nWhen this issue was raised in response to Kaling's tweet, however, Yadav clarified that she was referring to the character's poor mental state in that episode rather than her appearance.\n\n\"I just wanted to say that the colorism accusations are ridiculous because that is not what I intended to imply through the meme,\" Yadav told INSIDER in an email. \"What the meme meant from my perspective was that in the first picture, Kelly was clearly going through a master cleanse-induced mental breakdown and in the second picture, Mindy looked put-together and happy.\"\n\nYadav, who identified herself as Indian and a person of color, explained that she didn't take skin tone into account when choosing photos for the meme. She simply wanted a photo of Kelly in that episode and a photo of Kaling looking happy.\n\n\"It was funny to me because I've been on the master cleanse and several similar diets and they always leave me feeling cranky and miserable, which in turn makes me become insufferable for everyone close to me,\" Yadav told INSIDER. \"So my point was — if you can't love me then, you don't deserve me when I'm looking and feeling my best.\"\n\nIn the episode, Kelly passes out because she isn't eating enough. NBC\n\nKaling also jumped in on Twitter to clarify that she had no qualms with the meme and was just trying to be funny with her response.\n\n\"Oh I was just making a joke,\" Kaling wrote. \"No issue from me!\"\n\nOf course, many users who reacted to the meme — both the original and Kaling's response — loved and related to the Kelly Kapoor reference.\n\nDespite her current reign as the third-highest paid television actress — with roles in two of 2018's most anticipated films, \"Oceans 8\" and \"A Wrinkle in Time\" — it's nice to see Kaling's comedic genius from \"The Office\" still resonating with fans.\n\nSign up here to get INSIDER's favorite stories straight to your inbox.", "images": ["https://i.insider.com/5ac7c5a4facba821008b45be?width=1200&format=jpeg", "https://static.businessinsider.com/image/5bd375adcd6f3842155a1a29", "https://www.thisisinsider.com/mindy-kaling-responds-to-office-meme-twitter-2018-4?width=600&format=jpeg&auto=webp", "https://i.insider.com/5ac7a2eefacba82f008b45a2?width=24&format=jpeg&auto=webp", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1 1'%3E%3C/svg%3E", "https://i.insider.com/5ac7a2eefacba82f008b45a2?width=600&format=jpeg&auto=webp", "https://i.insider.com/5ac7c5e0facba809548b45bf?width=600&format=jpeg&auto=webp"], "top_img": "https://i.insider.com/5ac7c5a4facba821008b45be?width=1200&format=jpeg", "keywords": [], "authors": ["Callie Ahlgrim"], "canonical_link": "https://www.insider.com/mindy-kaling-responds-to-office-meme-twitter-2018-4", "title": "Mindy Kaling responds to a meme mocking her character on 'The Office'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "Mindy Kaling reacts to a meme that implied she was ugly on 'The Office' — and you'd think Kelly Kapoor took over her account", "date": "2018-04-06", "news_keywords": "Mindy Kaling, The Office, memes, Social Media, Celebrities, Callie Ahlgrim", "description": "A Twitter user implied Mindy Kaling's character on \"The Office\" was ugly in a viral meme, and the actress didn't hesitate to clap back.", "author": "Callie Ahlgrim", "article": {"publisher": "insider", "content_tier": "free", "opinion": "false"}, "tbi-vertical": "Health", "og": {"title": "Mindy Kaling reacts to a meme that implied she was ugly on 'The Office' — and you'd think Kelly Kapoor took over her account", "description": "A Twitter user implied Mindy Kaling's character on \"The Office\" was ugly in a viral meme, and the actress didn't hesitate to clap back.", "type": "article", "url": "https://www.insider.com/mindy-kaling-responds-to-office-meme-twitter-2018-4", "image": "https://i.insider.com/5ac7c5a4facba821008b45be?width=1200&format=jpeg", "site_name": "Insider"}, "sailthru.title": "Mindy Kaling reacts to a meme that implied she was ugly on 'The Office' — and you'd think Kelly Kapoor took over her account", "sailthru.date": "2018-04-06", "sailthru.tags": "Mindy Kaling, The Office, memes, Social Media, Celebrities, Callie Ahlgrim", "sailthru.description": "A Twitter user implied Mindy Kaling's character on \"The Office\" was ugly in a viral meme, and the actress didn't hesitate to clap back.", "sailthru.author": "Callie Ahlgrim", "sailthru.verticals": "health, culture", "sailthru.image.full": "https://i.insider.com/5ac7c596facba81d008b45d3?width=1200&format=jpeg", "sailthru.image.thumb": "https://i.insider.com/5ac7c596facba81d008b45d3?width=160&format=jpeg", "twitter": {"card": "summary_large_image", "site": "@thisisinsider"}, "Insider": "Snapchat", "Mindy Kaling reacts to a meme that implied she was ugly on 'The Office' — and you'd think Kelly Kapoor took over her account": "The Fastest Way to Share a Moment!", "fb": {"pages": 1413475698959824}, "linkedin": {"owner": "mid:1d5f7b"}, "ii-ab-test": {"bi8-lazy-load": "control", "back-to-top": "control", "sticky-section-titles": "control", "post-breadcrumbs": "variant", "tabbed-homepage": "variant", "expanded-coverage-module": "variant", "subscribe-smallest-price": "variant"}, "viking-id": "5ac79996facba81f008b458b", "env": "prod", "msapplication-config": "//www.insider.com/public/assets/INSIDER/US/favicons/browserconfig.xml?12-31-19", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1522944000.0, "source": "https://www.thisisinsider.com", "summary": ""}