{"url": "https://www.latimes.com/entertainment/envelope/la-en-st-jessica-biel-20180620-story.html", "text": "Two years ago, Jessica Biel was raising her baby boy with husband Justin Timberlake in their Hollywood Hills home when the actress got hooked on a book. Universal Cable Productions sent her a thriller by German crime novelist Petra Hammesfahr, and once Biel started reading “The Sinner,” she couldn’t put it down. “Every time I thought I knew where the story was going, it surprised me,” she says. “I liked the book’s subversive quality. It was an impressive read.”\n\nThose subversive elements, embodied in the deeply damaged title character, proved irresistible to Biel. She explains, “I hadn’t worked on screen for a year, so I was ready to take the knife and let my guts spill out everywhere because I had all this creative energy that needed to be expelled. This was a leap into the darkest of the dark.”\n\nOn this day, the sun streaming into a penthouse at AKA Beverly Hills, where Biel, wearing a violet pantsuit with a cream coat draped over her shoulders, cheerfully details her deep dive into “The Sinner.” “It was exciting to play this unreliable character who lies out of self-preservation and because she’s afraid to expose parts of herself she believes are heinous and shameful.”\n\nA hit for USA Network last summer, the limited series earned Biel a Golden Globe best actress nomination for her nuanced portrayal of mom/wife/shattered soul Cora. The character’s psychotic break happens in the first episode. During a picnic by the lake with her husband and young son, Cora gets enraged by a loud song and abruptly stabs a stranger to death in a blood-spattered rage.\n\nAdvertisement\n\nWhy’d she do it?\n\nJessica Biel as Cora in USA Network’s “The Sinner.” (Brownie Harris / USA Network )\n\nSeeking answers, the eight-episode thriller gradually reveals Cora’s toxic backstory, contaminated with psychologically abusive parents, a sickly sister and predatory men in masks. “Other people can do whodunit really well,” Biel says. “We’re interested in the conceit of the ‘whydunit,’ so we peel, peel, peel away. It’s about the psychological peel.”\n\nBiel’s star turn in “The Sinner” represents a startling departure for the 36-year-old actress, first introduced to TV audiences as a minister’s wholesome teenage daughter in The WB’s long-running family drama “7th Heaven.” She later appeared in the 2003 horror reboot of “The Texas Chainsaw Massacre” followed by an eclectic mix of action flicks, rom-coms, guest roles and voiceover gigs.\n\nAdvertisement\n\nWith “The Sinner,” Biel broke new ground by probing a character she has almost nothing in common with. “Growing up totally normal, I had cool, loving parents, went to school. I worked professionally, which was a little bit unusual, but in terms of dynamic there’s nothing to really say except ‘Thumbs up.’ And I don’t want to play that! It’s boring! I want to find characters I’m terrified to portray.”\n\nMy entry point for Cora was partly that we’re both moms, so I had compassion for her in that way. Jessica Biel\n\nBiel did manage to identify with Cora in one regard. “My entry point for Cora was partly that we’re both moms, so I had compassion for her in that way,” she says. “But the attraction also had to do with the fact that Cora has so many layers. Putting together all this trauma and religious zealousness and abuse that I don’t know anything about, that really intrigued me as an actress.”\n\nCora’s fitfully remembered past includes a complicated relationship with her bossy younger sister Phoebe (Nadia Alexander), whose options are constrained because of a congenital heart defect. Incest ensues. Biel says, “That scene was odd to film and uncomfortable to watch. But Phoebe needs that physical release because she doesn’t feel that she’ll ever be touched or loved or caressed. Cora can’t say no. She did it out of love.”\n\nAdvertisement\n\nBeyond her contributions as an actress, Biel exercised considerable measure of creative control over “The Sinner” through her Iron Ocean Productions company. She and producing partner Michelle Purple enlisted show runner Derek Simonds (“The Astronaut Wives Club”) to create the series and personally pitched their concept to network execs. Biel, who continues as an executive producer for “The Sinner” Season 2, which will star Carrie Coon, liked being listened to.\n\n“It’s such a powerful feeling to have people look to you and say ‘What do you think?’ Actors often don’t have any input at all, but I’d been living with ‘The Sinner’ longer than almost anybody, so I had a point of view about the material. This show definitely felt like my baby.”\n\nWATCH: Video Q&A’s from this season’s hottest contenders »\n\ncalendar@latimes.com", "images": ["https://ca-times.brightspotcdn.com/b9/f5/1c9278c94a439e28f5150c679d6f/logo-full-black.svg", "https://ca-times.brightspotcdn.com/dims4/default/2a12cd6/2147483647/strip/true/crop/1024x576+0+0/resize/840x473!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F17%2Fdf%2Fa78a9ee2a259c4afa59b213e4e19%2Fla-1528487016-myf4i0u331-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/876f9a8/2147483647/strip/true/crop/2048x1154+0+0/resize/840x473!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff8%2Fd7%2F990d7caaede700ce2ac794c0ca09%2Fla-1529368098-imabh3jlch-snap-image", "https://ca-times.brightspotcdn.com/0e/c6/b86a8b4b43a793259deb28a32a56/latlogoinverse.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://ca-times.brightspotcdn.com/dims4/default/fd6ec13/2147483647/strip/true/crop/1024x538+0+19/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F17%2Fdf%2Fa78a9ee2a259c4afa59b213e4e19%2Fla-1528487016-myf4i0u331-snap-image"], "top_img": "https://ca-times.brightspotcdn.com/dims4/default/fd6ec13/2147483647/strip/true/crop/1024x538+0+19/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F17%2Fdf%2Fa78a9ee2a259c4afa59b213e4e19%2Fla-1528487016-myf4i0u331-snap-image", "keywords": [], "authors": [], "canonical_link": "https://www.latimes.com/entertainment/envelope/la-en-st-jessica-biel-20180620-story.html", "title": "With ‘The Sinner,’ Jessica Biel leaps ‘into the darkest of the dark’", "meta_data": {"og": {"title": "With 'The Sinner,' Jessica Biel leaps 'into the darkest of the dark'", "url": "https://www.latimes.com/entertainment/envelope/la-en-st-jessica-biel-20180620-story.html", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/fd6ec13/2147483647/strip/true/crop/1024x538+0+19/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F17%2Fdf%2Fa78a9ee2a259c4afa59b213e4e19%2Fla-1528487016-myf4i0u331-snap-image", "url": "https://ca-times.brightspotcdn.com/dims4/default/fd6ec13/2147483647/strip/true/crop/1024x538+0+19/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F17%2Fdf%2Fa78a9ee2a259c4afa59b213e4e19%2Fla-1528487016-myf4i0u331-snap-image", "width": 1200, "height": 630, "type": "image/jpeg", "alt": "la-1528487016-myf4i0u331-snap-image"}, "description": "Two years ago, Jessica Biel was raising her baby boy with husband Justin Timberlake in their Hollywood Hills home when the actress got hooked on a book.", "site_name": "Los Angeles Times", "type": "article"}, "article": {"content_tier": "metered", "published_time": "2018-06-20T12:00:00", "opinion": "false", "section": "Awards"}, "twitter": {"card": "summary_large_image", "description": "Two years ago, Jessica Biel was raising her baby boy with husband Justin Timberlake in their Hollywood Hills home when the actress got hooked on a book.", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/780f3a0/2147483647/strip/true/crop/1024x576+0+0/resize/1200x675!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F17%2Fdf%2Fa78a9ee2a259c4afa59b213e4e19%2Fla-1528487016-myf4i0u331-snap-image", "alt": "la-1528487016-myf4i0u331-snap-image"}, "site": "@latimes", "title": "With 'The Sinner,' Jessica Biel leaps 'into the darkest of the dark'"}, "fb": {"app_id": 119932621434123, "pages": 5863113009}, "viewport": "width=device-width, initial-scale=1, maximum-scale=5", "description": "In USA's 'The Sinner,' Jessica Biel portrays mom/wife/shattered soul Cora, who has a psychotic break in the first episode when she kills a stranger. The series peels back the layers of her life and psyche to find out why.", "keywords": "jessica biel, the sinner", "brightspot.contentId": "00000169-0cba-dbbe-a16f-4efa82fa0000", "brightspot.cached": "false"}, "movies": [], "publish_date": 1529424000.0, "source": "https://www.latimes.com", "summary": ""}