{"url": "https://joannavargas.com/natalia-dyers-facialist-shares-skincare-secrets/", "text": "Although traditionally, the term “anti-aging” has been used as a skincare term, modern science has shown it is inclusive all of the healthy habits that you need to engage in. Diet, exercise, good sleeping habits and a healthy skin care routine at home all play a part in making your skin look its best and therefore younger and more vibrant. We live in a society filled with specialized bits and pieces of information, making it very difficult for the public to connect the dots easily to an overall perfect program. In my opinion a lot of essential information gets lost or gets minimized because it is out of the scope of that study. For example Anyone who makes a habit of going to the gym, unfurling a yoga mat or hiking in the woods is privy to a secret known only to the physically active. Regular exercise also gives you healthier and glowing skin, the unmistakable reward of exercise. However, not having a skincare routine will limit the benefits you will get from exercising. It is good to have as much of an inclusive healthy lifestyle to get the full benefits of longevity, health and beauty. Below you will find a few healthy skincare habits that you can include as part of a healthy lifestyle. Natalia Dyer’s Facialist Shares a Bedtime Step You May Be Missing Source: E News By Alanah Joseph When it comes to red carpet beauty, skin is everything. Cue celebrity facialist Joanna Vargas, founder of the Joanna Vargas Salon and Skincare Collection. The skin-care pro’s salon is a refuge for Hollywood’s A-list, promising bright, hydrated skin prior to any event. For example, prior to the 2018 SAG Awards, Joanna prepped Natalia Dyer, Mandy Moore , Elisabeth Moss, Greta Gerwig, Zoe Kazan and Betty Giplin, using her new Supernova Facial, which includes an aqua peel, microcurrent, medical-grade collagen mask, cryotherapy and vitamin-spiked oxygen. Then, she completed a head-to-toe detox peel on each of the stars to ensure that any revealed skin would glisten. The salon offers the Supernova Facial and Full Body Detox to everyone-not just celebs. However, with the $375 facial and $300 peel, flawless skin requires an investment. Lucky for us, the sought-after skin-care expert revealed tips for getting red carpet ready from the comfort of your home. Check out her tips below! Exfoliate once a week during the winter, and twice a week during the summer. How often you exfoliate depends on your skin type and the season: “[During] Winter, you should exfoliate once a week since your skin is more sensitive,” she told E! News. “In summer, exfoliate twice a week. My favorite exfoliation is to use a product that has physical and chemical exfoliation properties. Something that has a bit of a scrub and something that has lactic.”\n\nSleep in your mask the night before a big event.\n\nI encourage my celebrity clients to sleep in my Exfoliating Mask the night before a red carpet event. It evens out pigment, takes down inflammation, and after a good night’s sleep in it, you wake up fresh faced like you’ve just had a facial!”\n\nEspecially if you have acne.\n\n“I have some actress clients who break out from nerves. It happens before every red carpet event, and this mask makes them flat enough that you can cover them with makeup.”\n\nIf you’re traveling, rehydrate your skin after you get off of the plane.\n\n“Extreme dryness is the most common issue, because my actresses travel so much and planes suck the life out of your skin,” she revealed. “I do a very gentle exfoliation and then do a series of masks to infuse the skin with hydration, omega-3 fatty acids and vitamins to make the skin come alive again.”\n\nRoll your way to radiant skin with a jade roller.\n\n“You can pop it into the fridge to cool it and it will help a lot to depuff and increase circulation.”\n\nNow, you’re ready for your red carpet debut!\n\nTo make your appointments in New York City please call 212.949.2350 or email us at [email protected]\n\nTo make your appointments for Los Angeles please call 310.424.5141 or email us at [email protected]\n\nHOW TO RESTORE DULL WINTER SKIN\n\n\n\nThe Joanna Vargas Exfoliating Mask is an enzymatic exfoliating mask that sweeps your skin clean for brilliance and glow.\n\nFormulated with kaolin clay to draw out impurities, lactic acid and fruit enzymes to gently exfoliate dead skin.\n\nWe use Galactoarabinan (a tongue twister of an ingredient but it is naturally derived from the Larch tree) to promote collagen and elastin production.\n\nAnother key feature is hyaluronic acid to bind lightweight moisture to your skin. Giving you the perfect finish, refreshed and healthy glowing skin.\n\nApply a thin layer to cleansed and dampened skin. Scrub gently for 1 minute. Then leave on as a mask for five minutes. Rinse thoroughly with tepid water. Paraben-free, sulfate-free, phthalate-free, and petrochemical-free. Nontoxic. Beauty\n\n]]> <", "images": ["https://joannavargas.com/wp-content/uploads/2018/02/ExfoliatingMagic.jpg", "https://joannavargas.com/wp-content/uploads/2012/02/shutterstock_106796417-460x292.jpg", "https://joannavargas.com/wp-content/themes/joannavargasco67/images/logo.svg", "https://joannavargas.com/wp-content/uploads/2018/02/Natalia-Dyer-683x1024.jpg", "https://www.facebook.com/tr?id=778257462241560&ev=PageView\n&noscript=1", "https://joannavargas.com/wp-content/themes/joannavargasco67/images/bg-item-post.jpg", "https://joannavargas.com/wp-content/uploads/2018/02/Natalia-Dyer.jpg", "https://joannavargas.com/wp-content/uploads/2019/02/jv-logo.svg"], "top_img": "https://joannavargas.com/wp-content/uploads/2018/02/Natalia-Dyer.jpg", "keywords": [], "authors": [], "canonical_link": "https://joannavargas.com/natalia-dyers-facialist-shares-skincare-secrets/", "title": "Natalia Dyer's Facialist Shares Skincare Secrets", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Natalia Dyer's Facialist Shares Skincare Secrets - Joanna Vargas", "url": "https://joannavargas.com/natalia-dyers-facialist-shares-skincare-secrets/", "site_name": "Joanna Vargas", "updated_time": "2020-03-18T14:31:59+00:00", "image": {"identifier": "https://joannavargas.com/wp-content/uploads/2018/02/Natalia-Dyer.jpg", "secure_url": "https://joannavargas.com/wp-content/uploads/2018/02/Natalia-Dyer.jpg", "width": 900, "height": 1350}}, "article": {"publisher": "https://www.facebook.com/search/top/?q=Joanna+Vargas", "tag": "Natalia Dyer", "section": "Celebrity Beauty Secrets", "published_time": "2018-02-10T12:27:55+00:00", "modified_time": "2020-03-18T14:31:59+00:00"}, "twitter": {"card": "summary_large_image", "title": "Natalia Dyer's Facialist Shares Skincare Secrets - Joanna Vargas", "site": "@JVSkinCare", "image": "https://joannavargas.com/wp-content/uploads/2018/02/Natalia-Dyer.jpg", "creator": "@JVSkinCare"}}, "movies": [], "publish_date": 1518265675.0, "source": "https://joannavargas.com", "summary": ""}