{"url": "https://brobible.com/entertainment/article/chris-cornell-daughter-letter-dad/", "text": "On May 18, 2017, Chris Cornell took his own life after performing at a show in Detroit. A little more than a month later, the rock legend is being remembered by his daughter Toni Cornell. The daughter of the Audioslave frontman penned an emotional and heartbreaking letter to her dad, who she called her “idol.” The touching letter shared some of her favorite moments spent with her father.\n\nThe letter speaks highly of the Soundgarden and Audioslave frontman who would often tell his 12-year-old daughter to “Don’t sit worrying peanut. Worry is a waste of time, I’m ok.”\n\nThe letter was posted to Cornell’s official Facebook page on Monday since she was missing him on Father’s Day.\n\n“Daddy,\n\nLet me start by saying how much I love you and how much you mean to me. You are my idol, someone I’ve always looked up to. You were always there for me. You pushed me forward every day, and you still do.\n\nWhenever I cry or feel like there’s no way I can go on, I hear your voice, ‘Don’t sit worrying peanut. Worry is a waste of time, I’m ok.’\n\nI always took what you said to heart. Probably because everything you said was so smart.\n\nEvery time you came home from tour you spent all your hours with us. No matter how tired you were, how many time zones you traveled, you were there for us.\n\nWhenever I was sick you would take care of me. You would cuddle with me, hug me, kiss me. You didn’t care about getting sick. You would stay up all night to make sure my fever went down. And if it didn’t, you would wake me up and give me my medicine. I would open my eyes, see you, and feel better.\n\nI have so many memories with you but one of my favorite ones was earlier this year when I was jetlagged and we watched ‘Purple Rain’. We were staying at the BHH and you came into my room when I was trying to find a movie to watch.\n\n‘How about Purple Rain?’ you said. I always trusted your judgement. I put it on and immediately fell in love! We then got to your favorite song, ‘The Beautiful Ones’.\n\n‘This song is so special it doesn’t even belong in a genre. When I was in my twenties, I saw this in the theatre and some guy started cracking up laughing at this scene and song. It got me really mad,’ you said.\n\nI fell in love with the song too and listened to it on repeat.\n\nOur special connection was always the arts. Poems, books, music, writing. We both have a unconditional love for it.\n\nWho’s going to introduce me to movies like ‘Purple Rain’ and songs like ‘The Beautiful Ones’ now? I’m hoping I will find some because you trained me so well.\n\nI know you are still here, and the warmth I feel beneath the cold, is you. YOU ARE THE BEST FATHER IN THE WHOLE WIDE WORLD. And I know, that if this wasn’t an accident, you’d still be cuddling with me watching ‘Purple Rain’.\n\nI love you and miss you so, Daddy. You deserve your own day to be celebrated because you are the best dad anyone could ever have. Happy Father’s Day!\n\nLove,\n\nYour Baby Toni”", "images": ["https://cdn.flipboard.com/badges/flipboard_srsw.png", "https://brobible.files.wordpress.com/2017/06/chris_cornell_daughter_letter.jpg?quality=90&w=650&h=433", "https://brobible.files.wordpress.com/2017/06/chris_cornell_daughter_letter.jpg?quality=90&w=650", "https://s0.wp.com/wp-content/themes/vip/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://pixel.wp.com/b.gif?v=noscript"], "top_img": "https://brobible.files.wordpress.com/2017/06/chris_cornell_daughter_letter.jpg?quality=90&w=650", "keywords": [], "authors": [], "canonical_link": "https://brobible.com/entertainment/article/chris-cornell-daughter-letter-dad/", "title": "Chris Cornell’s Daughter Pens Heartbreaking Letter To Her ‘Idol’ And Dad", "meta_data": {"Copyright": "2020 Horseneck Media, LLC", "viewport": "width=1100,maximum-scale=1.0", "twitter": {"widgets": {"csp": "on"}, "card": "summary_large_image", "site": "@BroBible", "creator": "@BroBible", "title": "Chris Cornell’s Daughter Pens Heartbreaking Letter To Her 'Idol' And Dad", "description": "Toni Cornell wrote an emotional letter to her deceased dad to share some of her fondest memories of the legendary Chris Cornell.", "image": "https://brobible.files.wordpress.com/2017/06/chris_cornell_daughter_letter.jpg?quality=90&w=650"}, "google-site-verification": "XNvivfLQQYJ8zJMtah5fFzfAr_cUFYDbYXtx6U5QXmo", "fb": {"pages": 108698394910, "app_id": 537702696375827}, "robots": "index,follow", "description": "Toni Cornell wrote an emotional letter to her deceased dad to share some of her fondest memories of the legendary Chris Cornell.", "keywords": "entertainment, audioslave, chris cornell, music, toni cornell", "apple-itunes-app": "app-id=1437314941, app-argument=brobible://url=brobible.com/entertainment/article/chris-cornell-daughter-letter-dad/", "og": {"title": "Chris Cornell’s Daughter Pens Heartbreaking Letter To Her 'Idol' And Dad", "url": "https://brobible.com/entertainment/article/chris-cornell-daughter-letter-dad/", "site_name": "BroBible", "type": "blog", "image": "https://brobible.files.wordpress.com/2017/06/chris_cornell_daughter_letter.jpg?quality=90&w=650"}, "article": {"publisher": "https://www.facebook.com/BroBible"}, "author": "BroBible", "generator": "WordPress.com", "application-name": "BroBible", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Sports. Culture. Stuff. - Est. 2009.", "msapplication-task": "name=Subscribe;action-uri=https://brobible.com/feed/;icon-uri=https://secure.gravatar.com/blavatar/9738be0d19c237f76fe6913e4392b20c?s=16"}, "movies": [], "publish_date": null, "source": "https://brobible.com", "summary": ""}