{"url": "http://www.politifact.com/truth-o-meter/promises/obameter/promise/525/introduce-comprehensive-immigration-bill-first-yea/", "text": "Immigration reform was a major component of President Barack Obama's campaign platform. He promised to secure the border, crack down on employers who hire undocumented immigrants, and provide a path to citizenship for undocumented immigrants.\n\n\n\nWhile watching ABC's This Week as part of our fact-checking partnership with the show, we learned of a promise that we hadn't heard before. During the campaign, then-candidate Obama was interviewed by Univision's Jorge Ramos, a prominent voice within the Latin American community. During that interview, Obama said he would pursue immigration reform aggressively. \"I cannot guarantee that it is going to be in the first 100 days,\" Obama said. \"But what I can guarantee is that we will have in the first year an immigration bill that I strongly support and that I'm promoting. And I want to move that forward as quickly as possible.\"\n\n\n\nWe checked our database of promises, and found that that while we did have promises from Obama on immigration reform, we missed this one with its specific deadline. So we're adding it, along with a rating.\n\n\n\nObama set a timetable for this promise, saying he would \"strongly support\" an immigration bill in his first year. But, well into his second year, no comprehensive immigration reform measure supported by Obama has been introduced in Congress.\n\n\n\nWe searched his speeches on VoteSmart.org and found numerous mentions of immigration reform. In April 2009, in response to a question about the one-year deadline, he said that he saw the \"process moving this first year.\" In June 2009, he assigned Secretary of Homeland Security Janet Napolitano to begin putting together a comprehensive immigration reform framework. Finally, in September 2009, he said that he anticipated \"that before the year is out we will have draft legislation, along with sponsors potentially in the House and the Senate who are ready to move this forward, and when we come back next year, that we should be in a position to start acting.\"\n\n\n\nAlas, the year came to an end with no Obama-endorsed bill in sight. On December 15, 2009, Democratic Rep. Luis Gutierrez introduced a bill of his own, but a spokesman for the Center for Immigration Studies said that Obama administration has not promoted or publicly supported Gutierrez's bill.\n\n\n\nOver the course of 2010, Obama continued to push for immigration reform in his speeches. He mentioned it in his State of the Union address and announced in March that Senators Charles Schumer, D-N.Y., and Lindsey Graham, R-S.C., finished working on a bipartisan framework \"to fix our broken immigration system.\" That was followed by a release of a 26-page immigration reform proposal in April, which the President called a \"a very important step.\"\n\n\n\nFinally, Obama reiterated his call for bipartisan reform in a major speech at American University on July 1, 2010. \"In recent days, the issue of immigration has become once more a source of fresh contention in our country, with the passage of a controversial law in Arizona and the heated reactions we\"ve seen across America. Some have rallied behind this new policy. Others have protested and launched boycotts of the state. And everywhere, people have expressed frustration with a system that seems fundamentally broken,\" said Obama.\n\n\n\nObama promised to strongly support a comprehensive immigration reform bill that would be introduced during his first year in office. As president, he has repeatedly called for reform and several immigration-related bills are pending in Congress. But we're well into the second year of Obama's presidency, and all that we've seen are proposals and frameworks, no actual bills. Unless the White House has a time machine that we don't know about, this is a Promise Broken.", "images": ["https://static.politifact.com/images/favicon.ico", "https://static.politifact.com/img/logo-footer.png", "http://www.facebook.com/tr?id=292850974235854&ev=PageView&noscript=1", "https://static.politifact.com/None"], "top_img": "https://static.politifact.com/images/favicon.ico", "keywords": [], "authors": ["August"], "canonical_link": "", "title": "The Obameter:", "meta_data": {"viewport": "width=device-width, initial-scale=1", "twitter": {"username": "PolitiFact", "card": "summary", "site": "PolitiFact", "description": "PolitiFact is a fact-checking website that rates the accuracy of claims by elected officials and others on its Truth-O-Meter."}}, "movies": [], "publish_date": null, "source": "http://www.politifact.com", "summary": ""}