{"url": "https://www.townandcountrymag.com/leisure/arts-and-culture/a10376156/big-little-lies-season-2/", "text": "Big Little Lies is officially returning for a second season this weekend on HBO. Here’s everything we know so far. Fair warning—spoilers ahead, if you haven't finished season 1. (What are you waiting for? .)\n\nSeason 2 will premiere on June 9.\n\n“It’s looking like June. I think June,” Kidman told Andy Cohen during CNN's New Year's Eve special, when he asked about the season's debut.\n\nAnd in February, HBO confirmed that news with an Instagram post:\n\nIn a new trailer released in April, announced the official date of the premiere. Big Little Lies will return on June 9.\n\nIt had been previously reported that new episodes would air sometime in 2019. \"It wouldn't be impossible to get on in 2018,\" HBO's president of programming, Casey Bloys, said.\n\nNeed a quick recap before diving back in to the story?\n\nFortunately, HBO just posted everything you need to know if one quick Instagram video. Watch it here:\n\nNicole Kidman just dropped a huge spoiler for season 2.\n\nDuring a panel at the Wing previewing season 2, Kidman revealed that despite his character seemingly having died in the first season of Big Little Lies (sorry for the spoiler!), Alexander Skarsgard is returning in some capacity for season 2.\n\n\"He was the most incredible acting partner, and then he came back for season 2…\" Kidman said before trying to back-peddle a bit. \"He has a little bit of a part in the sense of … the basis of … okay, I’ll be quiet. He didn’t abandon us. We’ll put it that way.\"\n\nTVline previously reported that Skarsgard was \"expected to return in some capacity.\" HBO also previously confirmed that viewers will see \"most\" of the main characters again in season two.\n\nGiven Kidman's comment, we'll likely see Skarsgard play his character, the abusive rapist Perry, in flashbacks, but speculate wildly with us for a moment.\n\nMaybe he'll come back to haunt the women of Monterey. Or, perhaps, Big Little Lies season two will add a convenient time-travel element, à la Outlander.\n\nOr maybe he isn't dead after all. As Skarsgard said at the Golden Globes, “I don’t even know if I’m really dead or not. I feel okay right now but we’ll see.\"\n\nHe told Digital Spy that he has \"read all the scripts\" for season two. And that it's \"very smart\" and \"very good.\"\n\nHe has also shared that he was on-set during filming, but can't disclose what he was doing there.\n\n\"I was on set, yes. I can’t disclose what I did on set,” Skarsgard said on the Tonight Show Starring Jimmy Fallon. \"Maybe, I was acting. I might have been just moral support. I might have just made coffee for the ladies. I might have helped Meryl Streep with her acting… Not help, but just give her little pointers, fine tune it a bit.”\n\nWatch the full interview below:\n\nThe first full trailer is finally here.\n\nThe clip shows a new costume party (one that appears to be '70s-themed), the Monterey five in a police line-up, a preview of Meryl Streep's role, and of course, Madeleine and Renata making their presence known at school.\n\nA new Instagram handle for the series just revealed photos from the season.\n\nFollow along at @biglittlelies.\n\nAll the women of Monterey are coming back.\n\nIn February of 2018, HBO confirmed that Shailene Woodley, Laura Dern, and Zoe Kravitz had signed new contracts for season two.\n\nPreviously, HBO had announced that Witherspoon and Nicole Kidman will return as both stars and executive producers of the series.\n\nWe are excited to announce that @RWitherspoon and Nicole Kidman will re-team to executive produce and star in the return of #BigLittleLies on HBO. pic.twitter.com/UtEG3GrJXN — HBO (@HBO) December 8, 2017\n\n\"I’m thrilled to be bringing back this talented team of artists,\" Witherspoon said in a statement. \"It gives us the opportunity to delve deeper into the lives of these intriguing and intricate Monterey families and bring more of their stories back to the audience who embraced and championed them.”\n\nAccording to The Hollywood Reporter, Witherspoon and Kidman will each receive a significant salary bump, and will make \"around $1 million an episode\" for season two. Co-stars Kravitz, Dern, and Woodley will reportedly get raises as well.\n\nDeadline also reports that Kathryn Newton (who plays Abigail), Robin Weigert (who plays Celeste's therapist, Dr. Amanda Reisman), Merrin Dungey (who plays Detective Adrienne Quinlan), and Sarah Sokolovic (who plays Tori Bachman) will all be returning as well.\n\n\n\nMeryl Streep will play Perry Wright's mother in this season.\n\nHBO confirmed on Twitter that the legendary Meryl Streep has been cast in Big Little Lies season two, joining the \"tribe of fierce #BigLittleLies women.\"\n\nAccording to the Hollywood Reporter. Streep's character arrives in Monterey searching for answers after Perry's apparent death at the end of season one.\n\n\"She deeply loved her son … as much as any mother can love her son,\" Big Little Lies author Liane Moriarty told The Daily Telegraph about the role. \"She had a slightly fraught relationship with her daughter-in-law, so it’s a very complicated, difficult time.\"\n\nPerhaps unsurprisingly, stars of the show are thrilled that Streep is joining the cast.\n\n\"We didn't think we'd get her,\" Kidman told ET during a show at New York Fashion Week. \"It really is her standing up and going, 'I support you as women, and I believe in you,\" Kidman said. “I think that's a big statement from her.\"\n\n\n\nKidman's co-star Laura Dern agrees. \"It's amazing! When I tell anyone in my life that Meryl Streep is joining us, it's incredible!\"\n\nThere will be some other new faces in the cast.\n\nAccording to Deadline, Alienist star Douglas Smith will play Corey Brockfield, \"an off-beat surfer, aspiring marine biologist and Jane's (Shailene Woodley) co-worker.\"\n\nThe publication also reports that Crystal Fox and Mo McRae have joined the cast in the roles of Elizabeth Howard and Michael Perkins, respectfully, and that actor Denis O’Hare will play Ira Farber.\n\nThe Night Of star Poorna Jagannathan, too, will be in season 2. According to Deadline, she will play a new character called Katie Richmond. At this point, it's unclear how she'll fit into the storyline.\n\nNicole Kidman also recently told Ellen that her kids appear in this season as extras. Listen to that conversation here:\n\nZoe Kravitz promises there will be \"a lot more of Bonnie in season two.\"\n\n\n\n\"There is a lot more of Bonnie in season two,\" the actress said in an interview with Refinery 29. \"It's kind of interesting the way it worked out. If there had only been one season, it would have been a bit of a bummer. It's interesting to have saved that for the second season, especially seeing what happens at the end of season one. Now [we're] revealing who she is, why she is the way she is, and why she did what she did. I don't think you will be disappointed.\"\n\nShe also told Rolling Stone, \"They’re not using her to tell someone else’s story ... She has her own story.\"\n\nShailene Woodley also says this season is going to be 'very emotional.'\n\n\"My character has a very different story line which is wonderful, but for many other people it goes deep,\" she told The Hollywood Reporter. \"It's going to be very emotional but at the same time still be comedic and have those light moments, but it doesn't shy away from the dirty,\" she said.\n\nFilming has wrapped on season two.\n\nNicole Kidman posted a sweet Instagram to mark the occasion.\n\n\"That’s a wrap on #BigLittleLies Season 2 filming! What a beautiful journey this has been with my Monterey 5 sisters and our passionate dedicated crew,\" she wrote. \"Thank you HBO for the amazing opportunity and thank you Andrea Arnold for being our fearless leader, and of course the one and only Meryl Streep for believing in us. I love you all. xx\"\n\n\n\nAnd Reese Witherspoon and Laura Dern quickly followed suit.\n\nThe cast have been posting photos from set all summer long. Here are a few of our favorites.\n\nIn mid-August, Reese Witherspoon shared an adorable video from on-set with her body double, Marilee. Watch the clip below:\n\nHere's the first picture of Meryl Streep on set:\n\nAnd here's an amazing picture of Reese chucking an ice cream cone at Meryl while filming:\n\nPhotos of the whole incident surfaced on Twitter, where user @mattybooz wrote, \"I am praying Reese pelts Meryl with that ice cream. #BigLittleLies.\" Witherspoon wrote back, \"Oh Matt! No need to pray. I got her !\"\n\nStars Laura Dern, Zoë Kravitz, and Shailene Woodley have also all shared Instagrams from set. See more behind-the-scenes photos here.\n\nSeason two will have a female director.\n\nAndrea Arnold will direct all seven episodes of the new season. \"We have an incredible new director who's British, Andrea Arnold, and it's really been a great experience to watch how she's taken what we all created in season one,\" Shailene Woodley said. \"She has implemented her own creative vision, while maintaining the same tone and emotions, and that’s been such a delight and so lovely to work with.\"\n\nReese Witherspoon also praised Arnold. “I’m beyond excited to be working with talented and acclaimed director Andrea Arnold who will be at the helm,\" she said. “Andrea’s unique storytelling style will be a welcome addition to the filmmaking team.\"\n\nIt will continue where season one left off.\n\nAccording to the Hollywood Reporter, \"Season two will explore the malignancy of lies, the durability of friendships, the fragility of marriage and, of course, the vicious ferocity of sound parenting. Relationships will fray, loyalties will erode … the potential for emotional and bodily injury shall loom.\"\n\nSome people are still hesitant about continuing the story.\n\nWhile the network is obviously keen to continue the success of a program that was both a fan favorite and an award-winner, there's a vocal group that believes season one of the show told the story of these troubled California women perfectly—continuing the series would only sully what made it so great in the first place.\n\nIn an interview with the Hollywood Reporter, writer David E. Kelley reveals that he initially thought a season two wasn't a great idea. \"We wrote it as a one-off and we ended it in a way that was very lyrical. But we ended on a lie. I get so protective of characters and series, too, that I don't want to damage them in any way, and I so loved how we ended year one and I thought, 'Let's just leave it at that,' he reveals.\n\nBut then he was convinced by the character Meryl Streep is playing that a second season could work.\n\n\"Liane [Moriarty, author of the novel Big Little Lies] wrote a novella of [new] stories, and most of them we're using,\" he shared. But the genius one was introducing this character who's being played by Meryl Streep. It's a delicious character and I felt bringing her in was both liberating and daunting. \"\n\nHere's how to watch Big Little Lies:\n\n\n\nSeason one is available to stream or buy on a number of sites, including HBO, Hulu, Amazon Video, and iTunes. Click here for more on how to re-watch season one and prepare for season two.", "images": ["https://hips.hearstapps.com/ell.h-cdn.co/assets/17/14/1024x512/landscape-1491232566-audrey-reese-bll.jpg?resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/5f20e7cc70c2fe6a108e4b13c4c1d3bbe0d4a82e06097a11cfba087baf8deae0-1557758094.jpg?crop=1.00xw:0.894xh;0,0&resize=1200:*", "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/13/1024x512/landscape-1491144685-screen-shot-2017-04-02-at-105002-am.png?resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/reese-witherspoon-big-little-lies-1491425493.jpg?crop=1.00xw:0.753xh;0,0.0758xh&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/5f20e7cc70c2fe6a108e4b13c4c1d3bbe0d4a82e06097a11cfba087baf8deae0-1557758094.jpg?crop=1.00xw:0.894xh;0,0&resize=1200:*", "keywords": [], "authors": ["Caroline Hallemann", "Senior Digital News Editor", "As The Senior Digital News Editor For Town", "Country", "Caroline Hallemann Covers Everything The British Royal Family To The Latest Episodes Of Outlander", "Killing Eve", "The Crown."], "canonical_link": "https://www.townandcountrymag.com/leisure/arts-and-culture/a10376156/big-little-lies-season-2/", "title": "'Big Little Lies' Season 2 News, Premiere Date & Cast", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#BE3E19", "og": {"type": "article", "site_name": "Town & Country", "title": "Big Little Lies Season 2 Premieres This Weekend", "description": "Here's what's next for the women of Monterey.", "url": "https://www.townandcountrymag.com/leisure/arts-and-culture/a10376156/big-little-lies-season-2/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/5f20e7cc70c2fe6a108e4b13c4c1d3bbe0d4a82e06097a11cfba087baf8deae0-1557758094.jpg?crop=1.00xw:0.894xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 526594570689062, "pages": 344794953432}, "article": {"publisher": "https://www.facebook.com/TownandCountryMagazine", "modified_time": "2019-10-22 05:05:29", "published_time": "2019-06-07 03:28:00", "section": "Arts & Culture", "opinion": "false"}, "twitter": {"site": "@TandCmag", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/5f20e7cc70c2fe6a108e4b13c4c1d3bbe0d4a82e06097a11cfba087baf8deae0-1557758094.jpg?crop=1.00xw:0.894xh;0,0&resize=640:*"}, "google-site-verification": "musQPiBADe3f4WpT4JNcg9uUChC3qnOhhPLSR4n1urM", "title": "'Big Little Lies' Season 2 News, Premiere Date & Cast - Latest Details On Reese Witherspoon's HBO Show", "description": "Meryl Streep is officially going to be in the second season for the hit HBO show, 'Big Little Lies'. Here's everything else you need to know, including when Big Little Lies starts again, which cast members will be in it, and more.", "keywords": "big little lies season 2, big little lies, big little lies season two, bll season 2, big little lies hbo, big little lies release date, big little lies season 2 news, big little lies season 2 release date, big little lies season 2, reese witherspoon hbo show, when does big little lies come back, when does big little lies start, meryl streep big little lies, meryl streep, who will meryl streep play in big little lies", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/5f20e7cc70c2fe6a108e4b13c4c1d3bbe0d4a82e06097a11cfba087baf8deae0-1557758094.jpg?crop=0.563xw:1.00xh;0.0994xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Leisure,leisure,arts-and-culture,hbo,reese witherspoon,nicole kidman", "sailthru.date": "2019-06-07T15:28:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/5f20e7cc70c2fe6a108e4b13c4c1d3bbe0d4a82e06097a11cfba087baf8deae0-1557758094.jpg?crop=1.00xw:0.894xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/5f20e7cc70c2fe6a108e4b13c4c1d3bbe0d4a82e06097a11cfba087baf8deae0-1557758094.jpg?crop=0.563xw:1.00xh;0.0994xw,0", "sailthru.socialtitle": "Big Little Lies Season 2 Premieres This Weekend", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1559849280.0, "source": "https://www.townandcountrymag.com", "summary": ""}