{"url": "https://people.com/tv/patrick-dempsey-kate-walsh-reunite/", "text": "Dr. Derek Shepherd is alive, well, and as McDreamy as ever.\n\nAt least, in Cigna‘s new TV Doctors of America ad campaign promoting preventative care and yearly check-ups to monitor blood pressure, cholesterol, blood sugar and body mass index.\n\nGet push notifications with news, features and more.\n\nPatrick Dempsey spoofs his character alongside other famous, fictional M.D.s Neil Patrick Harris (Doogie Howser), Donald Faison (Scrubs) and — surprise! — his Grey’s Anatomy ex-wife Kate Walsh.\n\n“Kate’s fun, and her comic timing is amazing,” Dempsey, who left Grey’s fans heartbroken when his charismatic neurosurgeon died in a car crash in season 11, tells PEOPLE of reuniting with the actress. “We were always playful on set anyway, and then we would get serious, but this was fun just to be playful and to make each other laugh.”\n\nImage zoom Vivian Zink/ABC via Getty\n\nDespite the spot’s cheeky tone, it conveys an important message about taking control of your own health, something Dempsey passionately advocates.\n\nIn 2008, the actor opened the Patrick Dempsey Center for Cancer Hope & Healing in Maine, offering a holistic approach to cancer education and support for those battling the disease and their families.\n\nThe center is dedicated to his mother, Amanda, who died in 2014 after a long battle with ovarian cancer.\n\nEvery year, he organizes the Dempsey Challenge, a cycling, running and walking fundraising event. (The 2017 iteration takes place in Lewiston, Maine, from Oct. 7-8.)\n\n“We’re closing in on 10 years soon,” Dempsey says. “It’s a very special experience I think for everyone who participates. Some people are doing it because they themselves have been diagnosed or a family member, they’ve lost someone. There’s an atmosphere and a feeling that is hard to put into words, where everyone is pulling together. There’s an openness, there’s a loving community, and we’re all rolling along on bikes. We have these wonderful moments with people that are very special, and I think so many people have been touched by cancer and how it affects them. It’s such a devastating disease.”\n\nWATCH: Patrick Dempsey on Life After Grey’s Anatomy\n\n“When we set out to start this, we had no idea that it would be as successful as it is,” he adds, “and that allows us to make sure that all of our services are free to the people who come through the door and we can give them the best quality of life and empower them and make them feel strong in whatever way we can.”\n\nDempsey is also returning to the small screen in EPIX’s 10-episode adaptation of Joël Dicker’s The Truth About the Harry Quebert Affair.\n\nTwo months into shooting, he’s acting out of his rom-com leading man comfort zone — and couldn’t be more thrilled, calling the set “sublime.”\n\n“Jean-Jacques Annaud is just one of the best directors I’ve ever worked with in my life, and the experience has been challenging and enjoyable,” Dempsey says. “The cast is extraordinary, and it’s a different character. It’s a much darker piece. It’s very much a romantic thriller, and it’s an opportunity to do something a little bit darker, a little bit edgier, and at the same time have romantic qualities to it that I think people that enjoyed Grey’s will hopefully enjoy. But it certainly will challenge the audience.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fpatrick-dempsey-kate-walsh.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fpatrick-dempsey-kate-walsh.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fpatrick-dempsey-kate-walsh.jpg", "keywords": [], "authors": ["Michele Corriston"], "canonical_link": "https://people.com/tv/patrick-dempsey-kate-walsh-reunite/", "title": "Patrick Dempsey Reunites with Kate Walsh for Cigna", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Health,Kate Walsh,News,Patrick Dempsey,TV", "news_keywords": "Health,Kate Walsh,News,Patrick Dempsey,TV", "description": "The Grey's Anatomy costars spoof their characters", "og": {"title": "Patrick Dempsey Reunites with Grey's Anatomy Wife Kate Walsh — for an Amazing Cause", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/patrick-dempsey-kate-walsh-reunite/", "description": "https://www.youtube.com/watch?v=fTW7EgoKpSE?version=3&amp;rel=1&amp;fs=1&amp;autohide=2&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;wmode=transparent Dr. Derek Shepherd is alive, well, and as McDreamy as ever. At least, in Cigna‘s new TV Doctors of America ad campaign promoting preventative&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fpatrick-dempsey-kate-walsh.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/patrick-dempsey-kate-walsh-reunite/", "description": "The Grey's Anatomy costars spoof their characters", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fpatrick-dempsey-kate-walsh.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/patrick-dempsey-kate-walsh-reunite/", "title": "Patrick Dempsey Reunites with Grey's Anatomy Wife Kate Walsh — for an Amazing Cause", "description": "The Grey's Anatomy costars spoof their characters", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fpatrick-dempsey-kate-walsh.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": ["https://www.youtube.com/embed/fTW7EgoKpSE"], "publish_date": null, "source": "https://people.com", "summary": ""}