{"url": "https://web.archive.org/web/20160805083656/http://girlsunlimited.org/hollywoods-creation-of-the-catfight/", "text": "Hollywood’s Creation of the “Catfight”\n\nHave you ever turned on the television and found yourself tuned into a “reality” show where two women are cursing each other out and look as though they are about to pounce? So have I, and, in my humble opinion, it’s not pretty. It feels like I am constantly seeing women in bikinis ripping each other’s hair out or the housewives of America gossiping and throwing drinks in each other’s faces.\n\nSince the early days of Hollywood, gossip about rivaling actresses has appeared on the covers of tabloids (those magazines you see in the supermarket checkout lines); however, in recent decades a new avenue for pinning women against one another has been tapped into: it’s what we wrongly call reality television. In many of the conflicts we see between women in Hollywood, most revolve around grabbing the attention of a man.\n\nA prime example of this is ABC’s The Bachelor. Here we have 25 scantily dressed women begging for a proposal from one man. These women are placed in a competition where the winner is most valued by her physical attractiveness to men. From the minute these women enter the door their power as individuals is taken away from them and the only thing that matters is male approval. Give me a break.\n\nIn MTV’s reality TV show, Laguna Beach, Lauren Conrad and Heidi Montag feuded over a fellow co-star. Their dramatic rivalry and gossiping behavior became the center of the show and the source of their new celebrity. Would you want to only be known for fighting and spreading rumors? I sure wouldn’t. Or how about reality TV shows that focus on creating drama between female friends? Producers and directors ask these women to exaggerate and gossip about one another for the sake of ratings. It’s sickening.\n\nThere are three things that we as viewers need to realize about reality television before we decide if we should watch\n\nFirst, we need to realize that these reality shows are totally bogus and that in “real reality” people don’t interact with one another in such hostile and dramatic ways. The fights and rivalries we see on these shows are structured. Story editors and segment producers are paid a lot of money to create drama between co-stars\n\nNext, we need to truly understand how these shows negatively represent and impact women. So let’s say that you know that reality TV is anything but real, but you still love those juicy stories? What we need to realize is how these shows negatively affect us as women and girls. What do you think a show like The Bachelor teaches little girls to value about themselves? What do you think it is teaching boys to value about women? By supporting shows that objectify women or portray them as backstabbing villains we are approving of the inequality of women.\n\nFinally, we need to realize what we as women and girls, 51% of the American population, can do to change the industry and promote women’s rights. By simply questioning and critically thinking about what we are watching we are taking a step towards women’s equality. If we come together and stop watching these reality shows their ratings will falter and they will go away. Together, we have the power to make the difference we wish to see in American culture.", "images": ["https://web.archive.org/web/20160805083656im_/http://girlsunlimited.org/wp-content/themes/girlsunlimited/images/lockicon.png", "https://web.archive.org/web/20160805083656im_/http://girlsunlimited.org/wp-content/themes/girlsunlimited/images/twitter.png", "https://web.archive.org/web/20160805083656im_/http://girlsunlimited.org/wp-content/themes/girlsunlimited/images/signupicon.png", "https://web.archive.org/web/20160805083656im_/http://girlsunlimited.org/hollywoods-creation-of-the-catfight/ http:/girlsunlimited.org/wp-content/uploads/2014/09/cropped-girls-screaming-at-each-other.jpg ", "https://web.archive.org/web/20160805083656im_/http://girlsunlimited.org/wp-content/themes/girlsunlimited/images/facebook.png", "https://web.archive.org/web/20160805083656im_/http://girlsunlimited.org/wp-content/themes/girlsunlimited/images/youtube.png", "https://web.archive.org/web/20160805083656im_/http://girlsunlimited.org/wp-content/themes/girlsunlimited/images/newsletter-icon.png", "https://web.archive.org/web/20160805083656im_/http://girlsunlimited.org/wp-content/themes/girlsunlimited/images/girlsunlimited-logo.png", "https://web.archive.org/web/20160805083656im_/http://girlsunlimited.org/wp-content/themes/girlsunlimited/favicon.ico"], "top_img": "https://web.archive.org/web/20160805083656im_/http://girlsunlimited.org/wp-content/themes/girlsunlimited/favicon.ico", "keywords": [], "authors": ["Laura Doherty"], "canonical_link": "https://web.archive.org/web/20160805083656/http://girlsunlimited.org/hollywoods-creation-of-the-catfight/", "title": "Hollywood’s Creation of the “Catfight”", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=1", "description": "Have you ever turned on the television and found yourself tuned into a “reality” show where two women are cursing each other out and look as though they are", "keywords": "catfight,girls,gossip,hollywood,hollywood and women,reality television,reality tv,rumors,women"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}