{"url": "https://www.tvguide.com/news/scandal-season-6-finale-postmortem-bellamy-young/", "text": "[WARNING: The following story contains spoilers about Thursday's Season 6 finale of Scandal. Read at your own risk.]\n\nMellie Grant (Bellamy Young) is officially the new president of the United States, but she's not the most powerful person in the world.\n\nScandal wrapped up Season 6 Thursday with one twist after another in the two-hour closer. No, Mama Pope (Khandi Alexander) did not assassinate Mellie on inauguration day 1) because Rowan (Joe Morton) shoots her in the shoulder before she could pull the trigger and 2) because she was actually going to kill VP Luna (Tessie Santiago)!\n\nWhy? Olivia (Kerry Washington) figures out that Luna was the one who orchestrated the assassination on Frankie Vargas — yup, her own husband! — because she didn't want to be stuck as first lady and believed that she, as a sympathetic widow, would be able to accomplish more than Frankie ever could've in office. Luna thinks she has a trump card, telling Liv that, like Jackie Kennedy, she's untouchable and Mellie needs her to carry out her agenda. But Liv just needs a couple hours to gladiate: With Jake's (Scott Foley) help — because they've both killed VPs (LOL) — she pressures Luna into taking pills that would simulate a heart attack and thus kill her. That way, her \"legacy\" will still be intact and no one will ever know she had her own hubby killed.\n\n\n\nABC's 2017-18 fall lineup: Everything you need to know\n\nStep 2 of Liv's plan involved her tricking Mellie into signing an executive order that would fund the reinstatement of B613, which Rowan had pushed Fitz (Tony Goldwyn) to do as his last act as POTUS. Fitz, for once, made a good decision for himself, nixed the order and headed off to Vermont, but not before a hot-and-heavy make-out sesh with Liv on the White House lawn. Now with Mellie's signature, B613 is back and Liv informs Rowan that she is going to run it.\n\nBut wait! That's not all. During a nightcap with Cyrus (Jeff Perry), Liv realizes this whole thing was actually Cyrus' doing, after he repeats the same language Luna used about Jackie Kennedy and such. This was definitely no slip of the tongue; Cyrus is too cunning for that. This also explains why Cyrus turned down Mellie's offer to be VP, paving the way for Luna to be on the ticket. Color Liv impressed, and she offers him VP. \"How does it feel to be the most powerful person in the world?\" Cyrus asks. \"It feels right,\" the white and now black hat-wearer replies.\n\nBut the new leader of the free world is still oblivious to all of this. How would Mellie react if and when she finds out? We caught up with Bellamy Young to discuss all those twists, what she'd like to see in the final season and why Quinn's (Katie Lowes) big news — she's pregnant with Charlie's (George Newbern) child (Lowes is pregnant IRL) — was her favorite part of the finale.\n\nWhat was your first reaction to the Luna twist and then the Cyrus twist?\n\nBellamy Young: Oh, my god! I never see anything coming. I watch and read like a fan. I'm never one step ahead of anything. So the Luna twist really knocked me. She had been written up to that point with such loyalty and such girl power and mutual support, so it was really a gut punch. And Tessie plays her so well, with so much heart and so much emotion. It was a real twist of the knife for her to turn like that, but I think a brilliant story point.\n\nWith Cyrus, gosh — I mean, Mellie has no idea about any of this. I can only react as a fan and say that never, never underestimate Cyrus. No one does Washington better than Cyrus and he will triumph by whatever means necessary and don't ever fool yourself into thinking he's out of the game.\n\nHe purposely outed himself. There's no way that was an accident.\n\nYoung: Oh, for sure. It's like a sociopath who leaves clues for the detective who's tracking him. When you are that good at what you do, whether it's for good or evil, you want people to appreciate your work. So I think in that moment he definitely wants Olivia to be aware of what he's done and, if not respect him, be in awe of his power and to never forget who he is as a person.\n\nShe totally does. She still wants him to be VP.\n\nYoung: Yeah! It's getting so interesting next year because Olivia is at such a moral crossroads. She has all power — power for good in the White House and dark power with B613. I think we're really going to have a season of Olivia finding out who she is and watching her wrestle with that true, deep existential morality. Our show has always been about what power does to you and whom you can trust and how to stay yourself or not, but to watch it all unfold internally in her and how the rest of us will get caught up in a storm of her gravitational pull is going to be very interesting. I think it was very wise of Cyrus — he sees all and it was very wise of him to see that moment in her and for him to remind her exactly who he is.\n\nBellamy Young, Scandal Photo: Richard Cartwright, ABC\n\n\n\n\n\nMellie is in the dark about everything right now. How do you think she's going to react to, first, Luna's death?\n\nYoung: I have no way of knowing anything ... but I can only imagine that Mellie will be absolutely shocked about Luna. ... It's been such a terrifying ordeal to go through an assassination attempt and to have a target on your back, and I think the human instinct is to want answers, so when someone gives you a plausible one, you cling to it. And if it comes from Olivia, Mellie still believes in Olivia. She still believes if you had a hard question, Olivia doesn't have the easy answer but the right answer. When Mellie loses herself a little bit, it's Olivia she turns to to remind herself who she is, so if Olivia tells her that Luna was at the bottom of this plot to assassinate her behind Peus, behind Mama Pope, behind everyone, I think Mellie will be too willing to believe it, and it will leave her jaw open for the sucker punch, which is Cyrus.\n\nDo you think Olivia will tell Mellie everything, including how she used her to fund B613?\n\nYoung: I don't know. I have no way of knowing what our writers will do. ... It's our last season, so they could do anything! I don't know at this point. I feel terrible, Joyce. [Laughs] I don't know what to say!\n\nI think you can answer this. Luna said she didn't want to feel trapped as first lady, which was something Mellie struggled with — feeling ornamental. Do you think Mellie would've sympathized with her had she found out about the scheme before Luna died?\n\nYoung: Certainly, certainly. I think in the quiet, private moments she and Luna had so much in common. Similarly to the talk she had with Jake's wife [Vanessa], when she said, \"Use your power, make your life, realize your opportunities and seize them,\" I think [a Luna and Mellie conversation] would've been along those lines. But again, that's very naïve because all along Luna was pulling the strings, puppet-ing everyone, so Mellie could've never had seen that.\n\n\n\nBut it's nice too to see an alternate reality of what Mellie could've been. She's always wanted more, but she's always wanted it in an above-board way. She's a pragmatist but also a romantic. She really believes in democracy. She can't imagine ... that people like Peus — powerful, rich, all-knowing entities that are shadows behind our American democracy — may affect the wheels. I think she very much believes in the people and the power of the people and doing things in the right order. There's an equal and opposite truth that Luna is a portrait of something she could've been but would never have become.\n\nMellie didn't hide the fact that she wanted the pomp and circumstance of the inauguration even though she might be killed, because she knew the moment was bigger than herself. How difficult or easy do you think that was for her to decide?\n\nYoung: I think she was very much on the fence. That's the thing. Those last moments leading up to the inauguration really burned away any frivolity she had. It was no longer a dream that was just for herself. It became a very sober reality of what the opportunity was and what was being asked of her. It became, as public office should be, a service, not something self-serving. So she knew if she lost her life, it was worth it for everyone to see a woman being inaugurated. She was willing to sacrifice herself for something much larger than herself. I'm hoping that sort of humility and mindfulness is something that follows her into her presidency.\n\nI liked the scene when Fitz told her what it felt like to be shot and that he wanted her to cancel the inauguration. He's the only person who can tell her from experience.\n\nYoung: Yeah, exactly. What I love so much about that scene is of all the people in the world, and particularly after all our years together on the show — we met Fitz and Mellie in the worst moment of their marriage and one of the worst moments of Mellie's life — they next year get to enjoy time on the balcony where they can remember the connection they had. They spent decades together as partners working toward a common dream and certainly co-parent, but there's really not been any stable footing. To think that a person who knows you better than anyone in the world is also the only person who knows exactly what you're going through, I mean that is a party of one. And if they really get to share that connection again and rely on each other like that, oooh! I look forward to that. I wish that's something next season incorporates.\n\nLast time we talked, you said your favorite scene involved Quinn. Was that her pregnancy announcement?\n\nYoung: Yeah! How great was that? I loved it so much. ... I have no idea what next season will be, I have no idea if we'll go backward in time or forward in time. What I can tell you is I love the way it's being handled and I love the opportunity that it gives Shonda [Rhimes] to talk about, of course, raising a baby and being a powerful woman and being the boss of your husband. There are such rich gender politics in the workplace stories that arrive from that very common situation. That's why it's dear to my heart. It's just so real and relevant and Quinn's the perfect person to carry it forward. And that it's happening with the symmetry in real life is cool as well. It makes it all the more sentimental.\n\nShe was the baby gladiator when the show started.\n\nYoung: She was the baby gladiator! That's true! I didn't think about that!\n\n\n\nScandal returns in the fall.", "images": ["https://tvguide1.cbsistatic.com/i/r/2017/05/18/1044d7f1-f81b-4a89-8db6-40fe93c40dc6/thumbnail/1300x867/7a406eee88c87ab330caeb25cc1c5dce/170518-news-scandal2.jpg", "https://tvguide1.cbsistatic.com/feed/1/694/thumbs/117722694_100x133.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/04/16/565eda06-3941-42fa-b7fc-d930aee08f41/crop/1380x1380+345+0/thumbnail/70x70/4b41f885e39268c832df50f93dcc84c5/pdcoa-1-news.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/06/27/3fad4b53-a36e-4293-b6ce-ccefad29ffcd/crop/810x449+0+0/thumbnail/240x133/cad5df011ab1dd8b351cd24feada7c86/190627-one-day-at-a-time-hpsm.jpg", "https://tvguide1.cbsistatic.com/i/r/2017/07/05/bc91406b-3a01-4435-aee9-43c1dbd39980/crop/1380x1380+345+0/thumbnail/70x70/c42dde18b65265a935b0ebab8df274fb/170705-news-broadchurch.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/02/12/d50dc4eb-048c-46a7-a10b-6612702aa280/crop/1380x1380+345+0/thumbnail/70x70/b946d714a340f58fc03a96538dca2b5b/200213-prodigal-son-superlatives.jpg", "https://tvguide1.cbsistatic.com/mediabin/showcards/celebs/a-b/thumbs/bellamy-young_sc_100x133.png", "https://tvguide1.cbsistatic.com/i/r/2020/04/05/e7406a34-3c0a-4bc9-a6c5-c78b9fc15206/crop/2070x1147+0+0/thumbnail/240x133/33366fa0427b5fbcd05d82d4d88bb082/stranger-things-reg.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/03/30/af5b983a-0607-4360-b289-d0abd98d9bd6/crop/450x450+180+0/thumbnail/70x70/7c04a71635e3f0d825c961f272e7572e/200330-tiger-king-hp.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://tvguide1.cbsistatic.com/mediabin/showcards/celebs/k-l/thumbs/kerry-washington2_sc_100x133.png", "https://tvguide1.cbsistatic.com/i/r/2019/12/01/96c48961-ca4f-4b28-b527-8671dead3c25/crop/450x450+180+0/thumbnail/70x70/845f18917d00275750e9fdf4fa575dea/yoda-hpsm.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/04/15/1ced518e-b4cf-4436-b8dc-4ba119b7d796/crop/1380x1380+345+0/thumbnail/70x70/b4262d63c01e8fee3fb0cb11249be109/200415-wwdits.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/04/15/82faad20-77d8-4a9e-822a-45cfbbd511a1/crop/2070x1147+0+0/thumbnail/240x133/824ebe929b742c271435470c8ce0eec8/200415-blackaf.jpg", "https://tvguide1.cbsistatic.com/i/r/2018/01/26/655ca22a-13c4-4792-9064-69485e432cb7/crop/450x450+180+0/thumbnail/70x70/7342b085915e1f180f5a9f27a6772d79/180125-schitts-creek-annie-murphy-hpsm.jpg", "https://tvguide1.cbsistatic.com/i/r/2018/04/13/345ae1e9-49f3-466b-b122-f444fa426c1c/crop/810x449+0+0/thumbnail/240x133/8f715235a1eb3c4f097109f6ce3d6a39/180413-kylechandlerfridaynightlights-hpsm.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/03/08/d0d677a3-6ae0-42a7-a3e0-97afef3f110e/crop/450x450+180+0/thumbnail/70x70/6ea81c93896c18de5e6a87a77328475b/snl-hpsm.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/01/12/ceb0da6a-93ad-49f7-938a-28d551bde55d/crop/450x450+180+0/thumbnail/70x70/0de32324bb3e93d698553f52955d65b3/sbtb-hpsm.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/03/20/34eef86e-4f48-4135-8b87-1958ef4a7d87/crop/450x450+180+0/thumbnail/70x70/6225df71d218139e69d9100bb5108d9a/onward-hpsm.jpg"], "top_img": "https://tvguide1.cbsistatic.com/i/r/2017/05/18/1044d7f1-f81b-4a89-8db6-40fe93c40dc6/thumbnail/1300x867/7a406eee88c87ab330caeb25cc1c5dce/170518-news-scandal2.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.tvguide.com/news/scandal-season-6-finale-postmortem-bellamy-young/", "title": "Scandal Season 6 Finale Postmortem: Bellamy Young on Luna, Cyrus Twists", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no", "apple-itunes-app": "app-id=333647776, affiliate-data=at=11l9QE, app-argument=https://www.tvguide.com/news/scandal-season-6-finale-postmortem-bellamy-young/", "fb": {"app_id": 63084645929}, "google-site-verification": "Od29UEFliEmsUY2XH0kfXxkTNucL0cv_rc0J_RPWXU4", "description": "Bellamy Young answers our burning questions after that twisty Season 6 finale.", "og": {"title": "Scandal's Bellamy Young on Those Two \"Gut-Punch\" Finale Twists | TV Guide", "type": "article", "url": "https://www.tvguide.com/news/scandal-season-6-finale-postmortem-bellamy-young/", "image": "https://tvguide1.cbsistatic.com/i/r/2017/05/18/1044d7f1-f81b-4a89-8db6-40fe93c40dc6/thumbnail/1300x867/7a406eee88c87ab330caeb25cc1c5dce/170518-news-scandal2.jpg", "description": "Did you see either of those coming?", "site_name": "TVGuide.com"}, "article": {"published_time": "2017-05-18T23:00:03-04:00", "tag": "Finale Preview"}, "twitter": {"card": "summary_large_image", "site": "@TVGuide", "title": "#Scandal's @BellamyYoung breaks down those \"gut-punch\" finale shockers | TV Guide", "description": "[WARNING: The following story contains spoilers about Thursday's Season 6 finale of Scandal. Read at your own risk.]Mellie Grant (Bellamy Young) is officially...", "creator": "@joyceeng61", "image": {"src": "https://tvguide1.cbsistatic.com/i/r/2017/05/18/1044d7f1-f81b-4a89-8db6-40fe93c40dc6/thumbnail/1300x867/7a406eee88c87ab330caeb25cc1c5dce/170518-news-scandal2.jpg"}}}, "movies": [], "publish_date": 1495162803.0, "source": "https://www.tvguide.com", "summary": ""}