{"url": "https://www.etonline.com/justin-timberlakes-love-story-with-jessica-biel-in-his-own-words-112696", "text": "Justin Timberlake is head over heels in love with his wife, Jessica Biel!\n\nIn his new book, Hindsight & All the Things I Can’t See in Front of Me, the 37-year-old singer shares stories about stealing golf carts, being pelted with bottles of pee and his days on The Mickey Mouse Club, but no one gets more love than Biel, whom he wed in 2012.\n\nThe couple met at a party and immediately hit it off, even dancing to Madonna’s “Lucky Star.”\n\n“When I met Jess, it was undeniable how beautiful she is. We were at a surprise party in Hollywood at a speakeasy kind of a bar, a private club, and we were standing around in a group of people,” he reveals in the book. “I made some sort of sarcastic comment, really dry. Nobody got it except her. She laughed, and I noticed, all of a sudden, and in the way where you wonder if a person’s like you, if they have a very dry, dark sense of humor too.”\n\nDespite all of that, Timberlake didn’t initially ask for her number because “it wasn’t the right time.”\n\n“I had to psych myself up,” Timberlake writes of preparing to ask her out. “I had to remind myself that I was me -- giving myself a pep talk, shadowboxing with myself, rubbing my own shoulders.”\n\nTimberlake, as it turns out, didn’t even make the next move! A mutual friend offered to bring Biel, 36, along to one of his shows, something that Timberlake graciously accepted.\n\n“Patience may not be my strong suit but, apparently, playing coy is,” he quips of the not-so-chance meeting.\n\nFrom there, Biel and her group of friends rode with Timberlake on a bus to his next show, during which time they “talked the whole way up” and were “joking around.”\n\nFollowing the bus ride, Timberlake finally asked her for her phone number and the two kept in touch, talking on the phone throughout the remainder of his tour.\n\n“We were both still seeing other people, keeping ourselves safe from getting hurt, from really putting ourselves out there,” Timberlake writes of that time period. “It took a bit for both of us to admit to ourselves that we were really, really into each other.”\n\nOnce they figured out their connection, though, they were inseparable. In order to see each other, both Timberlake and Biel traveled all around together in between their busy schedules.\n\n“We were going to different cities, having a ball, with room service and pay-per-view and great dinners. And Scrabble,” he writes. “We’ve had a lot of unforgettable times.”\n\nFor Timberlake, his admiration for his better half has only grown over time, first when they tied the knot -- “I knew I was getting married only one time in my life,” he writes -- and second, when they welcomed their 3-year-old son, Silas.\n\n“She’s become a huge influence on my life, and I have such admiration for her, especially seeing her as a mother now,” he praises. “But I had admiration for her before. She’s a very good writer. She’s a poet. She’s a tremendous actor. She’s funny. Very funny. And she’s one of the most patient people I’ve ever met.”\n\n“She changed me. She changed my life,” he gushes. “... She’s a different person from when I first met her, but she’s also the same. I’m sure she’d say the same thing about me. Ten years is a long time.”\n\nThat personal growth that Timberlake writes about keeps him happy, inspired and in awe of Biel.\n\n“I’ve watched my wife change. I’ve watched her body change. It’s a temple. It should be worshipped. It should be marveled at. I’m fascinated by her. She’s everything, man,” he writes. “She just constantly surprises me with who she is, and who she’s becoming, and I really hope I do the same for her. I’m excited to see what she’s going to do next. I wake up and roll over and look at her, and I’m inspired.”\n\nET caught up with Biel in April, where she gushed about her husband and the life they’ve built together.\n\n\"It's so easy to get out of touch with your partner, especially if you're over here in one part of the world, and they're over there in another part of the world. Very easily you can become strangers,\" she confessed at the time. \"So having his back and he having my back in every moment of our lives, even if it's the decision of what's for breakfast, you feel safe and you feel like you're not alone in the world. So it's very important for us.\"\n\n\"[Becoming parents] changed everything, because we're both in awe of each other,\" Biel added. \"In many moments, I will do something and feel it's a bit of a mom fail, and kind of look over at him. There's no judgment there, so it's a safe place that we've created for ourselves and our partnership.\"\n\nWatch the video below for some more revelations from Hindsight & All the Things I Can’t See in Front of Me:\n\nJustin Timberlake's Best Book Revelations This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRELATED CONTENT:\n\nJustin Timberlake's 'Hindsight': What He Says About Marriage, Fatherhood and 'Mickey Mouse Club'\n\nJustin Timberlake and Jessica Biel Make a Surprise Visit to LeBron James' I PROMISE School\n\nJessica Biel Gets Flirty With Raunchy Comment on Husband Justin Timberlake's Pic!\n\nRelated Gallery", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2018-12/megyn_kelly_gettyimages-1053390462_1280.jpg?h=c673cd1c&itok=GkyEoz-G", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2020-03/1280bluntjohn.jpg?h=d067a961&itok=eUNlvyAb", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-02/gettyimages-1188309777_copy.jpg?h=c673cd1c&itok=TUXJDh-j", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-09/jessica-biel-justin-timberlake-emmys-after-party-1280.jpg?h=c96d95be&itok=0VTLy00N"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-09/jessica-biel-justin-timberlake-emmys-after-party-1280.jpg?h=c96d95be&itok=0VTLy00N", "keywords": [], "authors": ["Paige Gawley"], "canonical_link": "https://www.etonline.com/justin-timberlakes-love-story-with-jessica-biel-in-his-own-words-112696", "title": "Justin Timberlake's Love Story With Jessica Biel, In His Own Words", "meta_data": {"article": {"opinion": "false"}, "title": "Justin Timberlake's Love Story With Jessica Biel, In His Own Words | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/justin-timberlakes-love-story-with-jessica-biel-in-his-own-words-112696", "title": "Justin Timberlake's Love Story With Jessica Biel, In His Own Words", "description": "\"I wake up and roll over and look at her, and I’m inspired.”", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-09/jessica-biel-justin-timberlake-emmys-after-party-1280.jpg?h=c96d95be&itok=0VTLy00N", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "\"I wake up and roll over and look at her, and I’m inspired.”", "title": "Justin Timberlake's Love Story With Jessica Biel, In His Own Words", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Paige Gawley‍", "url": "https://www.etonline.com/justin-timberlakes-love-story-with-jessica-biel-in-his-own-words-112696", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-09/jessica-biel-justin-timberlake-emmys-after-party-1280.jpg?h=c96d95be&itok=0VTLy00N"}, "description": "\"I wake up and roll over and look at her, and I’m inspired.”", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, Justin Timberlake, Jessica Biel, Couples", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}