{"url": "www.thehollywoodgossip.com/2017/05/sofia-vergara-and-joe-manganiello-defend-marriage-slam-haters-on/", "text": "Sofia Vergara and Joe Manganiello would like to make something very clear:\n\nNot only do they comprise a great looking couple, but they are doing just great as a couple as well.\n\nThanks for not even bothering to ask!\n\nThe latest issue of Star Magazine alleges that the Modern Family star was \"caught cheating in Rome\" and has been spotted on numerous occasions without her wedding ring on.\n\nThe cover also screams, in all capital letters, that the marriage between Vergera and Manganiello is \"OVER!\"\n\nIs it really, though?\n\nIn an angry Instagram post, Vergara blasted these infidelity claims, stating that the tabloid Photoshopped the image in which it detailed how her finger was lacking a ring.\n\n\"The editor of this magazine is an idiot,\" the actress wrote simply, going on and on as follows:\n\n\"If he is going to have my ring removed to create fake 'news,' he should have made sure that he removed from social media all the other pictures of that award night in Rome where I'm wearing it.\n\n\"By the way, that's my friend, the producer of the movie Bent, that I was shooting in Rome and who came to spend Easter at my home the week later.\n\n\"#Starmagazinebullies #goinventsh*itaboutyourmother.\"\n\nWait... a supermarket tabloid twisted a harmless photograph to make it appear scandalous?\n\nIt used Photoshop? It flat-out lied?\n\nWow. Tell us more.\n\nAnd that's exactly what Manganiello himself has done.\n\nThe former True Blood star has issued his own spirited post on Instagram, slamming this same cover story and expressing love for his wife.\n\n\"Big surprise everyone but Star created a fake story and then photo shopped my wife's engagement ring off of her finger in order to sell magazines,\" he wrote.\n\n\"They are run by malicious trash. Do the world a favor and don't buy their garbage.\"\n\nWe agree!\n\nJust visit The Hollywood Gossip instead!\n\nWe do not charge a thing to read our celebrity news stories and we (mostly) guarantee that they are never fake.\n\nThe 40-year-old actor was mostly known for his amazing body and handsome face prior to falling for Vergara.\n\nHe opened up in the April issue of Ocean Drive magazine about being a part of a famous twosome these days.\n\n\"I was never part of a celebrity couple before this, because I never wanted to go through the difficulty that can bring in terms of paparazzi and attention,\" he said at the time.\n\n\"The two of us knew that once it became public that we were together -- and we had conversations about how that would change a lot of thing.\n\n\"[Vergara] is the only woman on the planet that I was willing to go through all of that for, because she’s the greatest.\"\n\nEveryone together now: AWWWWWW!\n\nManganiello added that the attention hasn't harmed their relationship at all.\n\nQuite the opposite, in fact.\n\n\"All that pressure has just brought us closer together,\" he says.\n\n\"It’s not something that we welcome into our lives. We try to stay private.\n\n\"At the end of the day, it’s really nobody else’s business but ours. It’s just that I love her and she loves me and here we are. And there is a price for that when living in the public eye.”", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--j-Xa07Xa--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1493924105/sofia-vergara-and-joe-manganiello-are-attractive.jpg"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--j-Xa07Xa--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1493924105/sofia-vergara-and-joe-manganiello-are-attractive.jpg", "keywords": [], "authors": ["Hilton Hater"], "canonical_link": "https://www.thehollywoodgossip.com/2017/05/sofia-vergara-and-joe-manganiello-defend-marriage-slam-haters-on/", "title": "Sofia Vergara and Joe Manganiello Defend Marriage, SLAM Haters on Instagram", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2017/05/sofia-vergara-and-joe-manganiello-defend-marriage-slam-haters-on/", "title": "Sofia Vergara and Joe Manganiello Defend Marriage, SLAM Haters on Instagram", "description": "Sofia Vergara and Joe Manganiello have each shared angry posts on Instagram. They have fired back against allegations that their marriage is over.", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--pXUyrCKO--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1448247204/sofia-vergara-and-joe-manganiello-photo.jpg", "type": "image/jpeg", "width": 435, "height": 580}}, "article": {"published_time": "2017-05-05T10:26:50-04:00", "modified_time": "2017-05-05T10:26:10-04:00", "tag": "Joe Manganiello", "author": "Hilton Hater"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Sofia Vergara and Joe Manganiello Defend Marriage, SLAM Haters on Instagram", "description": "Sofia Vergara and Joe Manganiello have each shared angry posts on Instagram. They have fired back against allegations that their marriage is over.", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--j-Xa07Xa--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1493924105/sofia-vergara-and-joe-manganiello-are-attractive.jpg"}}, "description": "Sofia Vergara and Joe Manganiello have each shared angry posts on Instagram. They have fired back against allegations that their marriage..."}, "movies": [], "publish_date": 1493994410.0, "source": "http://www.thehollywoodgossip.com", "summary": ""}