{"url": "https://www.bustle.com/articles/81323-where-is-sam-from-clarissa-explains-it-all-today-sean-oneal-has-sort-of-fallen-off", "text": "It's a good time to be a '90s television fan, if only because the world has finally realized how much we miss our long-dead sitcoms. Full House is getting a spinoff series, Boy Meets World has a reincarnation in Disney Channel's Girl Meets World, and even the Magic School Bus is chugging back onto TV. So why not bring back Clarissa Explains It All? After all, the series launched Melissa Joan Hart's career AND provided us with endless hours of family-friendly entertainment, all told through the perspective of a savvy, colorfully dressed tween. We know where Hart is today — she's back polishing off yet another sitcom with Melissa & Joey and will probably make a plethora of ABC Family TV movies in the near future — but she's not the only person I want to keep track of post- Clarissa Explains It All . Whatever happened to Sam, aka actor Sean O'Neal?\n\nI always wanted a BFF like Sam, if only because his mode of transportation (a ladder into Clarissa's bedroom window) always seemed pretty rad. The actor who played him, O'Neal, was in his early teens while on the show, and now is a full-fledged adult. So what has O'Neal been up to in his post-Clarissa years? There's not much out there about O'Neal's later years, but here's what I could find.\n\nNoir\n\nIn 2001, O'Neal provided additional voices for an English dub of this anime series, as well as portraying the character Vint.\n\nRahXephon\n\nO'Neal also provided character voices for this anime series, which he worked on in 2002.\n\nDevelopment Hell\n\nO'Neal appeared as a background actor on this 2013 web series about a production company.\n\nToday\n\nThat's unfortunately all we know about O'Neal's post-Clarissa ventures in acting, but there are certain other things we do know about him. For example, we know that he is NOT the Senior Editor of The A.V. Club, though I'm sure it's been a struggle for the other Sean O'Neal to constantly explain to people that he was never on Clarissa Explains It All.\n\n(You can see why we'd all believe it, though.)\n\nScreencrush reported that when it was active, O'Neal's website said that after Clarissa Explains It All, \"he was approached to be the lead of a new boy band in Orlando in the vein of the Backstreet Boys and 'N Sync.\" It would appear that such a band never happened, because I'm pretty sure all of Sam's many fans would've gladly bought his album — and there's no record of it ever existing. Here's what appears to a recent photo of O'Neal, or at least, more recent than old Clarissa episodes.\n\nSo where'd you go, O'Neal? Are you secretly lying to the world and really ARE the Senior Editor of The A.V. Club? Have you gone into hiding because too many '90s girls want you to climb into their windows? Or are you just leading a perfectly happy, normal life somewhere out of the public eye? If you want to talk, feel free to drop me a line — or better yet, just climb in through the window.\n\nImages: Nickelodeon; The Anime Network (2); f**kyeahseanoneal/Tumblr", "images": ["https://imgix.bustle.com/rehost/2016/9/13/54af6708-b939-44e7-97ce-64954fb8077b.jpeg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/lovelace/uploads/26/7da1baa0-d5b5-0132-4618-0ebc4eccb42f.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/lovelace/uploads/26/436fab70-d5b5-0132-bfce-0a13eebe068d.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/rehost/2016/9/13/54af6708-b939-44e7-97ce-64954fb8077b.jpeg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/lovelace/uploads/26/a0e4e2b0-d5b6-0132-bfcf-0a13eebe068d.png?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/rehost/2016/9/13/54af6708-b939-44e7-97ce-64954fb8077b.jpeg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/articles/81323-where-is-sam-from-clarissa-explains-it-all-today-sean-oneal-has-sort-of-fallen-off", "title": "Where Is Sam From 'Clarissa Explains It All' Today? Sean O'Neal Has Sort Of Fallen Off The Map", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/articles/81323-where-is-sam-from-clarissa-explains-it-all-today-sean-oneal-has-sort-of-fallen-off", "type": "article", "title": "Where Is Sam From 'Clarissa Explains It All' Now?", "description": "It's a good time to be a '90s television fan, if only because the world has finally realized how much we miss our long-dead sitcoms. Full House is getting a spinoff series, Boy Meets World has a reincarnation in Disney Channel's Girl Meets World,…", "image": {"identifier": "https://imgix.bustle.com/rehost/2016/9/13/54af6708-b939-44e7-97ce-64954fb8077b.jpeg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "It's a good time to be a '90s television fan, if only because the world has finally realized how much we miss our long-dead sitcoms. Full House is getting a spinoff series, Boy Meets World has a reincarnation in Disney Channel's Girl Meets World,…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}