{"url": "https://www.drrichardzeff.com/skin-care/prp/", "text": "Injectables\n\nDr. Richard Zeff, our plastic surgeon, and Cindy Wrocklage (RN) have received advanced training in the field of non-surgical aesthetic treatments. Facial rejuvenation solutions such as cosmetic injectables can reduce signs of wrinkles and fine lines, enhance the contours of the lips, and add volume to facial features with beautiful results. Thanks to the addition of anesthetic to many of these products, we are now able to offer almost pain-free injections to patients who are interested in minimally-invasive injectable treatments as an alternative (or complement) to surgery.\n\nOur office was selected as one of a small number of exclusive practices qualified to offer JUVÉDERM VOLUMA, Allergan’s newest cosmetic injectable, approved by the FDA as a shaping filler that can last up to two years!\n\nPlease follow the links below for more information on the many cosmetic injectables we offer, and be sure to watch for our BOTOX Cosmetic and dermal filler specials!\n\nTo reduce the chances of bruising, it is wise to discontinue the use of any medications that may prolong bleeding, including aspirin and non-steroidal anti-inflammatories (NSAIDS) at least one week prior to any injections. We will go over all aspects of the procedure and address any concerns you may have during the initial consultation.\n\nFAQ : Injectable Fillers Q: What are some common side effects associated with injectable fillers?\n\nA: After treatment, there may be redness, swelling, bruising, bumps, or tenderness. This usually subsides within days. Q: How long do fillers last?\n\nA: Most injectable fillers last between 6 months and 1 year. JUVÉDERM VOLUMA can last up to 2 years.\n\nBrilliant Distinctions™\n\n\n\nBrilliant Distinctions is a rewards program offered through Allergan that allows you to earn points that are redeemable for dollars off your next BOTOX Cosmetic and/or JUVÉDERM XC treatment. When you come into our office for treatment, we can sign you up for the program. With Brilliant Distinctions, you can shop at a number of major online retailers who are involved in the program and earn points toward your next treatment. Click here to register!\n\nSchedule an Appointment\n\nJUVÉDERM Injectable Gel, BOTOX Cosmetic, and other cosmetic injectables are popular treatment alternatives to facial plastic surgery that can reduce and often eliminate the most visible signs of aging. For more information, or to schedule a consultation, please contact our practice today.", "images": ["https://www.drrichardzeff.com//wp-content/uploads/2014/06/dd3-skincare.jpg", "https://www.facebook.com/tr?id=629671093862193&ev=PageView&noscript=1", "https://www.drrichardzeff.com//wp-content/uploads/2014/06/dd3-breast.jpg", "https://www.drrichardzeff.com/wp-content/uploads/2014/06/injectables-thumb.jpg", "https://www.drrichardzeff.com/wp-content/themes/drz/images/2019-best-of-seacoast.png", "https://www.drrichardzeff.com/wp-content/themes/drz/images/special-offers.jpg", "https://www.drrichardzeff.com/favicon.ico", "https://www.drrichardzeff.com//wp-content/uploads/2014/06/dd3-body.jpg", "https://www.drrichardzeff.com//wp-content/uploads/2014/06/dd3-laser.jpg", "https://www.drrichardzeff.com/wp-content/themes/drz/images/finance-opts.jpg", "https://www.drrichardzeff.com/wp-content/themes/drz/images/masaps1-new.png", "https://www.drrichardzeff.com//wp-content/uploads/2014/06/dd3-injectables.jpg", "https://www.drrichardzeff.com/wp-content/themes/drz/images/social-i.png", "https://www.drrichardzeff.com/wp-content/themes/drz/images/skinceuticals.jpg", "https://www.drrichardzeff.com/wp-content/themes/drz/images/rm-sig.png", "https://www.drrichardzeff.com/wp-content/themes/drz/images/footer-decoration.png", "https://www.drrichardzeff.com/wp-content/uploads/2019/05/brilliant_distinctions1.png", "https://www.drrichardzeff.com/wp-content/themes/drz/images/request-consult.jpg", "https://www.drrichardzeff.com/wp-content/themes/drz/images/logo.jpg", "https://www.drrichardzeff.com/wp-content/themes/drz/images/social-fb.png", "https://www.drrichardzeff.com/wp-content/themes/drz/images/view-gallery.jpg", "https://www.drrichardzeff.com/wp-content/themes/drz/images/social-tw.png", "https://www.drrichardzeff.com/wp-content/themes/drz/images/social-google.png", "https://www.drrichardzeff.com//wp-content/uploads/2014/06/dd3-face.jpg", "https://www.drrichardzeff.com/wp-content/themes/drz/images/social-yt.png", "https://www.drrichardzeff.com/wp-content/themes/drz/images/asps1.png"], "top_img": "https://www.drrichardzeff.com/favicon.ico", "keywords": [], "authors": [], "canonical_link": "https://www.drrichardzeff.com/injectable-fillers/", "title": "Cosmetic Injectables Dermal Fillers New Hampshire Portsmouth, NH", "meta_data": {"viewport": "maximum-scale=1.0, user-scalable=0, width=device-width", "description": "Dermal Fillers and Injectables for our New Hampshire and New England area patients include BOTOX Cosmetic, Juvederm, Restylane, and more. Click here for details."}, "movies": [], "publish_date": null, "source": "https://www.drrichardzeff.com", "summary": ""}