{"url": "https://www.thisisinsider.com/khloe-kardashian-hiding-her-baby-bump-2018-1", "text": "Khloe Kardashian is expecting a baby in early April with boyfriend Tristan Thompson, but hid her pregnancy from the public for nearly six months.\n\nThe reality star recently took to her app to discuss her \"stealth secrets\" and reveal how she told Thompson about her pregnancy.\n\n\" I can't even believe I hid my bump for as long as I did.\"\n\n\n\nThe Kardashian family is known being open with fans, but Khloe Kardashian took a different approach during the first six months of her pregnancy. Rather than flaunt the news, she went to great lengths to hide her bump until making a pregnancy announcement via Instagram in December.\n\nThe \"Revenge Body\" creator recently took to her app to share some \"stealth secrets\" from her first two trimesters and tips for hiding a baby belly.\n\n\"I can't even believe I hid my bump for as long as I did,\" she wrote. \"It took a few styling sessions, serious strategy and a s---ton of courage, but it worked.\"\n\nKardashian revealed that she wore billowy coats and held strategically placed accessories, like purses in front of her stomach, when going out in public. She also noted that \"nothing is more distracting than a chic pattern\" and a cinched waist with a flared, A-line hem is perfect for \"hiding a small bulge.\"\n\n\"I went super girly for Kim's baby shower. Little did everyone know I'm expecting, too,\" she wrote. \"[My dress] flows loosely at the exact right spot.\"\n\n💜 Cherry Blossoms and Tea for baby number three 💜 #KKW A post shared by Khloé (@khloekardashian) on Nov 11, 2017 at 7:41pm PST Nov 11, 2017 at 7:41pm PST\n\nThe reality star addressed why she kept her pregnancy hidden for so long, saying that the worst part was keeping a \"major secret\" from her family.\n\n\"I'm with my sisters pretty much every single day, so it was hard to not be able to say why I was so sick or couldn't do certain things,\" she wrote. \"[Tristan and I] wanted to tell everybody at one time, which made things even more tricky — how do you get all those people together in one room?! — but it was so amazing when we finally did!\"\n\nWhen it came to the public, however, Kardashian did not think hiding her pregnancy was, \"as big of a deal.\"\n\n\"I believe there are certain things that need to be held private and for yourself,\" she wrote. \"It was beautiful to have something that was just ours.\"\n\nFor a family whose life has been filmed for over a decade, it's understandable why Kardashian would want to keep such a personal, intimate experience private for as long as possible. However, now that the \"Strong Looks Better Naked\" author is officially in her third trimester, her bump would probably be difficult to hide.\n\n❥ Officially 6 months ❥ A post shared by Khloé (@khloekardashian) on Jan 2, 2018 at 12:31pm PST Jan 2, 2018 at 12:31pm PST\n\nKardashian's boyfriend, NBA star Tristan Thompson, has been \"reassuring and confident about everything\" throughout the pregnancy, according to a separate post. In fact, Kardashian wrote that Thompson intuitively knew she was pregnant before she even took a test.\n\n\"I actually had to FaceTime him to tell him. I was nervous and he was so excited,\" Kardashian wrote. \"Of course, it's such a blessing and such an exciting thing — but I do believe your initial reaction is always nerves. I'm so blessed that Tristan has been beyond supportive!\"\n\nKardashian said having an excited partner to act as a support system is \"crucial,\" praising her boyfriend as an \"angel.\"\n\n❥ Mom and Dad ❥ A post shared by Khloé (@khloekardashian) on Jan 2, 2018 at 12:44pm PST Jan 2, 2018 at 12:44pm PST\n\n\"This process is trying — physically and mentally — but Tristan has made everything as easy and beautiful as it can be! More than I could have imagined,\" she wrote.\n\nFans of \"Keeping Up With the Kardashians\" will know that having a baby is a longstanding dream for the future mom, so it's heartwarming to know that she is enjoying both her pregnancy and relationship.\n\nSign up here to get INSIDER's favorite stories straight to your inbox.", "images": ["https://i.insider.com/5a61162df1e7e53a008b456c?width=1200&format=jpeg", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1 1'%3E%3C/svg%3E", "https://i.insider.com/5a60fdf455ac5621008b45a9?width=600&format=jpeg&auto=webp", "https://i.insider.com/5a60fdf455ac5621008b45a9?width=24&format=jpeg&auto=webp", "https://www.thisisinsider.com/khloe-kardashian-hiding-her-baby-bump-2018-1?width=600&format=jpeg&auto=webp"], "top_img": "https://i.insider.com/5a61162df1e7e53a008b456c?width=1200&format=jpeg", "keywords": [], "authors": ["Callie Ahlgrim"], "canonical_link": "https://www.insider.com/khloe-kardashian-hiding-her-baby-bump-2018-1", "title": "Khloe Kardashian shares the 'serious strategy' it took to hide her baby bump from the public", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "Khloe Kardashian shares the 'serious strategy' it took to hide her baby bump from the public", "date": "2018-01-18", "news_keywords": "Kardashians, Pregnancy, Style, Celebrities, Relationships, Health, Wellness, Culture, Callie Ahlgrim", "description": "Khloe Kardashian recently revealed details about the early months of pregnancy, her \"stealth secrets,\" and how she told boyfriend Tristan Thompson.", "author": "Callie Ahlgrim", "article": {"publisher": "insider", "content_tier": "free", "opinion": "false"}, "tbi-vertical": "Health", "og": {"title": "Khloe Kardashian shares the 'serious strategy' it took to hide her baby bump from the public", "description": "Khloe Kardashian recently revealed details about the early months of pregnancy, her \"stealth secrets,\" and how she told boyfriend Tristan Thompson.", "type": "article", "url": "https://www.insider.com/khloe-kardashian-hiding-her-baby-bump-2018-1", "image": "https://i.insider.com/5a61162df1e7e53a008b456c?width=1200&format=jpeg", "site_name": "Insider"}, "sailthru.title": "Khloe Kardashian shares the 'serious strategy' it took to hide her baby bump from the public", "sailthru.date": "2018-01-18", "sailthru.tags": "Kardashians, Pregnancy, Style, Celebrities, Relationships, Health, Wellness, Culture, Callie Ahlgrim", "sailthru.description": "Khloe Kardashian recently revealed details about the early months of pregnancy, her \"stealth secrets,\" and how she told boyfriend Tristan Thompson.", "sailthru.author": "Callie Ahlgrim", "sailthru.verticals": "health, culture", "sailthru.image.full": "https://i.insider.com/5a61161bba0b5d1e008b456e?width=1200&format=jpeg", "sailthru.image.thumb": "https://i.insider.com/5a61161bba0b5d1e008b456e?width=160&format=jpeg", "twitter": {"card": "summary_large_image", "site": "@thisisinsider"}, "Insider": "Snapchat", "Khloe Kardashian shares the 'serious strategy' it took to hide her baby bump from the public": "The Fastest Way to Share a Moment!", "fb": {"pages": 1413475698959824}, "linkedin": {"owner": "mid:1d5f7b"}, "ii-ab-test": {"bi8-lazy-load": 300, "back-to-top": "control", "sticky-section-titles": "control", "post-breadcrumbs": "variant", "tabbed-homepage": "variant", "expanded-coverage-module": "variant", "subscribe-smallest-price": "control"}, "viking-id": "5a6107d555ac56ec008b4767", "env": "prod", "msapplication-config": "//www.insider.com/public/assets/INSIDER/US/favicons/browserconfig.xml?12-31-19", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1516204800.0, "source": "https://www.thisisinsider.com", "summary": ""}