{"url": "https://www.cheatsheet.com/health-fitness/celebrity-couples-who-stayed-together-after-embarrassing-cheating-scandals.html/", "text": "Everyone loves a good celebrity gossip story, especially when it involves a cheating scandal. But it’s easy to forget that behind those tabloids and tweets are real people who are facing feelings of hurt and betrayal. We hear of celebrity couples who split all the time, some of them because one or both partners strayed.\n\nBut sometimes the couple stays together, moving past the infidelity. These public figures chose to stand by their men (or women) and move forward.\n\nBeyoncé and Jay-Z\n\nJay-Z and Beyonce pretty much aired out their own dirty laundry. | Win McNamee/Getty Images) Jay-Z and Beyonce pretty much aired out their own dirty laundry. | Win McNamee/Getty Images)\n\nJay-Z and Beyoncé have been together since 2002, forming one of the most iconic power couples of our time. But last year’s “Lemonade” album alluded to some serious infidelity on Jay-Z’s part, something that he eventually admitted to. Both of their latest albums include details disguised as song lyrics, but the two have stayed together.\n\nNext: This big-time basketball star carries a lifelong reminder of his cheating ways.\n\nMagic Johnson and Cookie Johnson\n\nMagic Johnson and his wife have been through the ringer. | Michael Buckner/Getty Images for Tom Ford Magic Johnson and his wife have been through the ringer. | Michael Buckner/Getty Images for Tom Ford\n\nIn 1991, Earvin “Magic” Johnson married Cookie … and just 45 days later, he was diagnosed with HIV. He was then faced with the grueling task with not only calling various women he’d slept with, but confessing to Cookie that he’d been unfaithful during their courtship. Cookie not only stood by him, she vowed to help him fight for his health — and she has.\n\nNext: Considering the way this relationship started, her husband’s infidelity wasn’t a huge surprise.\n\nTori Spelling and Dean McDermott\n\nSpelling had no idea her husband was cheating on her. | Michael Buckner/Getty Images for Chevrolet Volt Spelling had no idea her husband was cheating on her. | Michael Buckner/Getty Images for Chevrolet Volt\n\nTori and Dean were both married to other people when they met, but they soon left their spouses for each other, got married, and had four children. But a few years ago, Spelling got the shock of her life when she learned McDermott had been unfaithful to her. The two worked hard to rebuild their relationship, and now they’re stronger than ever — and they even welcomed a new baby into their lives.\n\nNext: This British celebrity was caught with his pants down.\n\nHugh Grant and Elizabeth Hurley\n\nThese two were together for over 13 years. | Vince Bucci/AFP/Getty Images These two were together for over 13 years. | Vince Bucci/AFP/Getty Images\n\nHugh Grant was in a long-term relationship with Elizabeth Hurley in 1995, when he was caught having oral sex with a prostitute in his car. Hurley stayed with him until 2000, when they split amicably after 13 years together. The two remain good friends to this day.\n\nNext: Marriage Boot Camp seemed to help this couple.\n\nKendra Wilkinson and Hank Baskett\n\nHank Baskett may have had a fling with a transgender model. | Jonathan Leibson/Getty Images Hank Baskett may have had a fling with a transgender model. | Jonathan Leibson/Getty Images\n\nIn June 2014, Kendra Wilkinson found out that her husband, Hank Baskett, had an inappropriate encounter with a transgender model. The couple went on Marriage Boot Camp together and now claim that their marriage is stronger than ever.\n\nNext: This affair nearly ended a presidency.\n\nBill and Hillary Clinton\n\nBill has had multiple affairs over the course of his marriage to Hillary. | Paul J. Richards/AFP/Getty Images Bill has had multiple affairs over the course of his marriage to Hillary. | Paul J. Richards/AFP/Getty Images\n\nHillary Clinton has learned of multiple affairs on Bill’s part over the course of their marriage, but none was quite as famous as the Monica Lewinsky scandal, which almost cost him the presidency. Hillary stood by Bill through it all, and they remain married to this day.\n\nNext: This late night talk show host beat his blackmailer with the truth.\n\nDavid Letterman and Regina Lasko\n\nDavid Letterman and his wife have been together for decades. | OLIVIER DOULIERY/AFP/Getty Images David Letterman and his wife have been together for decades. | OLIVIER DOULIERY/AFP/Getty Images\n\nLetterman and Lasko have been married since 2009, but they’ve been together decades longer — he waited 23 years to marry her. Several years ago, Letterman became the victim of extortion, when someone demanded $2 million from him and threatened to reveal that he’d slept with some of his staffers. Letterman beat the blackmailers by admitting the truth on national TV and asking for forgiveness from Lasko, who apparently was able to give it to him (they’re still married).\n\nNext: This rocker was eventually forgiven for his affair with a hair stylist.\n\nOzzy and Sharon Osbourne\n\nOzzy and Sharon Osbourne have both admitted to infidelity. | Bryan Steffy/Stringer/Getty Images Ozzy and Sharon Osbourne have both admitted to infidelity. | Bryan Steffy/Stringer/Getty Images\n\nOzzy Osborne left his first wife for Sharon in the early 80s, and they’ve been together ever since — but it hasn’t always been smooth sailing. While both have admitted to infidelities in the past, Sharon was devastated to learn that Ozzy recently had an affair with a hair stylist. She left him briefly, but the two soon reconciled and seem stronger than ever.\n\nNext: This couple is practically British royalty, despite the cheating rumor.\n\nDavid and Victoria Beckham\n\nDavid may have had an affair with the family’s personal assistant. | Anthony Harvey/Getty Images David may have had an affair with the family’s personal assistant. | Anthony Harvey/Getty Images\n\nIt’s hard to imagine David Beckham cheating on Victoria since the two seem to have such a loving, committed, and passionate relationship (their four children are proof). But in 2004, their personal assistant, Rebecca Loos, claimed she had a brief affair with David. While there was never any concrete evidence, a few photos of Beckham and Loos did surface, and Loos was fired from her job with the family. But David and Victoria stayed together through it all.\n\nNext: This basketball star’s slip cost him millions.\n\nKobe and Vanessa Bryant\n\nKobe Bryant was accused of some scandalous rape allegations. | Frank Micelotta/Getty Images Kobe Bryant was accused of some scandalous rape allegations. | Frank Micelotta/Getty Images\n\nIn 2003, Kobe Bryant was accused of rape by an employee of a hotel where he was staying. While he denied the rape charge, he did admit to consensual sex, much to the dismay of his young wife, Vanessa. Kobe bought Vanessa a $4 million apology ring, and although she did file for divorce in 2011, it was eventually called off. Kobe and Vanessa are still married and have two children.\n\nNext: This rapper doesn’t even deny cheating on his wife many times.\n\nSnoop Dogg and Shante Broadus\n\nSnoop and Shante almost went through a divorce in 2004. | Jason Merritt/Getty Images Snoop and Shante almost went through a divorce in 2004. | Jason Merritt/Getty Images\n\nSnoop and Shante tied the knot more than 20 years ago, but that didn’t stop Snoop from having numerous affairs. He has admitted to his indiscretions and seems to have stopped them, and although the couple filed for divorce in 2004, it was called off and they have stayed married.\n\nNext: There has never been proof that this famous husband strayed, but the rumors are strong.\n\nSarah Jessica Parker and Matthew Broderick\n\nThese two still remain together although accusations of Broderick’s affairs have been endless. | Neilson Barnard/Getty Images These two still remain together although accusations of Broderick’s affairs have been endless. | Neilson Barnard/Getty Images\n\nThis dynamic duo has been married since 1997, an eternity in Hollywood. But there have been multiple reports of Broderick’s infidelities, including a 25-year-old blond and a “stunning redhead.” Still, Sarah Jessica has stood by her man.\n\nNext: After the scandal surfaced, these young stars didn’t last long.\n\nRobert Pattinson and Kristen Stewart\n\nThese two could not figure out how to make it work. | Juan Naharro Gimenez/Getty Images These two could not figure out how to make it work. | Juan Naharro Gimenez/Getty Images\n\nThere was no denying that Kristen Stewart cheated on Robert Pattinson with her Snow White and the Huntsman director — there was photographic evidence. She tearfully apologized, and Pattinson forgave her. The two stayed together until shortly after the last Twilight movie was released.\n\nNext: Why do celebrities cheat so much?\n\nCelebrities and cheating\n\nCelebrities have a lot more options when it comes to who they can cheat with. | Frazer Harrison/Getty Images Celebrities have a lot more options when it comes to who they can cheat with. | Frazer Harrison/Getty Images\n\nIf you feel as if celebrities tend to cheat more than “average” couples, you’re not alone. Celebs have a “high mate value” due to their social status, finances, and better-than-average looks. The abundance of temptation and time spent away from their partners due to work projects can contribute to the frequency of the infidelities. Perhaps the rest of us are better off not being famous.\n\nNext: And finally … does it really matter?\n\nWhy do we care?\n\nSociety is obsessed with celebrity weddings. | Leon Neal/AFP/Getty Images Society is obsessed with celebrity weddings. | Leon Neal/AFP/Getty Images\n\nThere’s no doubt about it: As a society, we are fixated on celebrities. But don’t worry, this obsession might actually be good for us. According to Frank McAndrew, PhD, celebs may be the only “friends” we have in common with new acquaintances, thus providing a common interest and topic of conversations between people who otherwise might not have much to say. Keeping up with the Kardashians (and other celebs, politicians, and athletes) makes us more socially adept during our daily interactions.\n\nSo read about these celebrity cheating scandals guilt-free, knowing that you’re simply trying to improve your social skills.\n\nFollow The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2017/05/hankbaskettandkendrawilkinson-640x320.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/05/HughGrantElizabethHurley-640x320.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Beyonce-Jay-Z.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/09/Kevin-Hart-640x427.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/09/Sharon-and-Ozzy-Osbourne-640x418.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/06/tori-spelling-dean-mcdermott-640x431.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Beyonce-Jay-Z.jpg", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Magic-Johnson.jpg?x62514", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Snoop-Dogg.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/01/Sarah-Jessica-Parker-and-Matthew-Broderick-640x486.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/11/GettyImages-157652210-640x408.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Kobe-Bryant.jpg?x62514", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2017/12/David-Letterman.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2016/05/David-Beckham-and-Victoria-Beckham-Anthony-Harvey-Getty-Images-640x456.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/10/Robert-Pattinson-and-Kristen-Stewart-640x375.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2016/03/GettyImages-51667424-640x485.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2017/12/Beyonce-Jay-Z.jpg", "keywords": [], "authors": ["Jessica Wick"], "canonical_link": "https://www.cheatsheet.com/health-fitness/celebrity-couples-who-stayed-together-after-embarrassing-cheating-scandals.html/", "title": "Celebrity Couples Who Stayed Together After Embarrassing Cheating Scandals", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/health-fitness/celebrity-couples-who-stayed-together-after-embarrassing-cheating-scandals.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "Even when faced with embarrassing cheating rumors or all-out affairs, these celebrity couples stuck together.", "og": {"locale": "en_US", "type": "article", "title": "Celebrity Couples Who Stayed Together After Embarrassing Cheating Scandals", "description": "Even when faced with embarrassing cheating rumors or all-out affairs, these celebrity couples stuck together.", "url": "https://www.cheatsheet.com/health-fitness/celebrity-couples-who-stayed-together-after-embarrassing-cheating-scandals.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-06-14T18:11:04-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2017/12/Beyonce-Jay-Z.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2017/12/Beyonce-Jay-Z.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "relationship advice", "section": "Health & Fitness", "published_time": "2018-06-14T18:11:00-04:00", "modified_time": "2018-06-14T18:11:04-04:00"}, "twitter": {"card": "summary_large_image", "description": "Even when faced with embarrassing cheating rumors or all-out affairs, these celebrity couples stuck together.", "title": "Celebrity Couples Who Stayed Together After Embarrassing Cheating Scandals", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2017/12/Beyonce-Jay-Z.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1529014260.0, "source": "https://www.cheatsheet.com", "summary": ""}