{"url": "https://www.usanetwork.com/accordingtochrisley", "text": "About the show\n\nServing as the perfect nightcap for Chrisley fans, the new half-hour after show ACCORDING TO CHRISLEY will feature Todd tackling the truth about marriage, parenting, sex and relationships. With his tough love, sharp tongue and always humorous approach, Todd will interact with an audience, serving up quick-witted advice. Additionally, every episode will feature a member of the Chrisley family, as well as a celebrity guest. Confirmed guests include Ali Landry, Chris Jericho, Nicole Sullivan, Erika Girardi, Metta World Peace, Jason George, Christina Milian, Heather and Terry Dubrow and Carmen Electra.", "images": ["https://www.usanetwork.com/sites/usanetwork/files/2017/09/ATC_show_2560x1440_android_thumbnail2.jpg", "https://www.usanetwork.com/sites/usanetwork/themes/aurora_usa/images/ajax-loader.gif", "https://www.usanetwork.com/sites/usanetwork/modules/contrib/lazyloader/loader/loader-7.gif"], "top_img": "https://www.usanetwork.com/sites/usanetwork/files/2017/09/ATC_show_2560x1440_android_thumbnail2.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.usanetwork.com/accordingtochrisley", "title": "According To Chrisley TV Show - Watch Full Episodes", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no", "fb": {"app_id": 241079750077}, "description": "Todd Chrisley brings his unfiltered, unsolicited and hilarious point of view to late night with the According to Chrisley after show. Watch episodes.", "generator": "Drupal 7 (http://drupal.org)", "og": {"site_name": "USA Network", "type": "article", "title": "According To Chrisley TV Show - Watch Full Episodes | USA Network", "url": "https://www.usanetwork.com/accordingtochrisley", "description": "It's the perfect nightcap for Chrisley Knows Best fans! The new half-hour after show, According To Chrisley, features Todd Chrisley tackling the truth about marriage, parenting, sex and relationships. With his tough love, sharp tongue and always humorous approach, Todd will interact with the audience, serving up quick-witted advice and more. Every episode will feature a member of the Chrisley family, as well as a celebrity guest, including Ali Landry, Chris Jericho, Nicole Sullivan, Erika Girardi, Metta World Peace, Jason George, Christina Milian, Heather and Terry Dubrow and Carmen Electra.", "updated_time": "2020-02-25T13:32:09-05:00", "image": "https://www.usanetwork.com/sites/usanetwork/files/2017/09/ATC_show_2560x1440_android_thumbnail2.jpg"}, "twitter": {"site": "@USA_Network", "url": "https://www.usanetwork.com/accordingtochrisley", "title": "According To Chrisley", "description": "It's the perfect nightcap for Chrisley Knows Best fans! The new half-hour after show, According To Chrisley, features Todd Chrisley tackling the truth about marriage, parenting, sex and relationships. With his tough love, sharp tongue and always humorous approach, Todd will interact with the audience, serving up quick-witted advice and more."}, "article": {"published_time": "2017-08-04T15:48:49-04:00", "modified_time": "2020-02-25T13:32:09-05:00"}}, "movies": [], "publish_date": 1501876129.0, "source": "https://www.usanetwork.com", "summary": ""}