{"url": "https://www.bustle.com/p/new-details-about-jennifer-aniston-reese-witherspoons-tv-show-will-make-you-even-more-excited-to-see-it-13253355", "text": "Jennifer Aniston will be there for you when you need more info on her upcoming Apple TV show with Reese Witherspoon. In a recent interview, Aniston teased new details of her and Witherspoon's show which will tackle morning TV. And while Aniston didn't say too much about the series, she certainly said enough to get fans excited for what it could be.\n\nWhen talking with Entertainment Tonight on the red carpet for her upcoming Netflix movie Dumplin', Aniston was unsurprisingly tightlipped about the untitled Apple drama, which has already been picked up for two seasons. To be fair, she admitted that the experience of working with Witherspoon, who played her little sister on Friends, has left her rather speechless. Still, she managed to throw in a few intriguing adjectives about the show that will keep fans busy for a little while.\n\n\"I just keep pinching myself, from this to that I just don't know what to say,\" Aniston said about working on the series right after working with Witherspoon's old pal Dolly Parton on Dumplin'. \"We started shooting about a month ago and it has been just so much fun. It is hard, it is dense, but it is so fulfilling.\"\n\nHard, dense, fulfilling. Three words that might not mean much now, but give fans a lot to think about. Especially, with what has already been revealed about the show, which is slated to premiere sometime next year on Apple's new streaming service.\n\nAccording to The Hollywood Reporter, the show, which will not only star Witherspoon and Aniston, but will also be executive produced by the duo, will give an \"inside look at the lives of the people who help America wake up in the morning, exploring the unique challenges faced by the women (and men) who carry out this daily televised ritual.\"\n\nThe show, written by Jay Carson (House Of Cards), will be based on an original idea by former HBO executive Michael Ellenberg. It's been reported that it will also take inspiration from Brian Stelter's book Top of the Morning: Inside the Cutthroat World of Morning TV, who is reportedly a consultant on the series. His 2013 book takes a closer look at the rivalry between the Today Show and Good Morning America, and the firing of Today co-anchor Ann Curry.\n\nThe series, which marks Aniston's return to TV, more than a decade after Friends ended, will also star Steve Carell in his first recurring TV role since The Office. THR reported that Carell will play Mitch Kessler, \"a morning show anchor who is struggling to maintain relevance in a changing media landscape.\"\n\nIt's hard to believe the recent events in the media like Megyn Kelly's firing won't play a role in this show. But, unfortunately, no one really knows what's going on with the show since neither Aniston or Witherspoon is saying too much about it just yet.\n\nFor now, fans will just have to wait and hope that Aniston will manage to give up some more details in her next interview or at the very least a few more adjectives. Maybe she'll even throw in some verbs if we're lucky. Until then fans of Aniston can keep re-watching Friends, which don't worry, isn't leaving Netflix anytime soon.", "images": ["https://imgix.bustle.com/uploads/getty/2018/12/5/4cdff8b7-5045-4c20-86c5-59a4f1fe236e-getty-129515470.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/8/2fb229f6-96f6-4740-8129-16ea777d54b0-getty-1205199899.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/14/74bf26f7-328c-46f7-87e6-e27523f13d7d-getty-167930183.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/14/2cea261f-221d-4c14-8796-78e3b1d00383-155251_9180.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/15/0b325359-1a6c-454b-8418-13e86ed9cbd1-4aad7429-d341-48a8-b630-5ccb68968373-mando_106-5_18194c1a.jpeg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/12/5/4cdff8b7-5045-4c20-86c5-59a4f1fe236e-getty-129515470.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/12/5/4cdff8b7-5045-4c20-86c5-59a4f1fe236e-getty-129515470.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/new-details-about-jennifer-aniston-reese-witherspoons-tv-show-will-make-you-even-more-excited-to-see-it-13253355", "title": "New Details About Jennifer Aniston & Reese Witherspoon's TV Show Will Make You Even More Excited To See It", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/new-details-about-jennifer-aniston-reese-witherspoons-tv-show-will-make-you-even-more-excited-to-see-it-13253355", "type": "article", "title": "Details About Jennifer Aniston & Reese Witherspoon's New TV Show Will Make You So Excited", "description": "Jennifer Aniston will be there for you when you need more info on her upcoming Apple TV show with Reese Witherspoon. In a recent interview, Aniston teased new details of her and Witherspoon's show which will tackle morning TV. And while Aniston…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/12/5/4cdff8b7-5045-4c20-86c5-59a4f1fe236e-getty-129515470.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Jennifer Aniston will be there for you when you need more info on her upcoming Apple TV show with Reese Witherspoon. In a recent interview, Aniston teased new details of her and Witherspoon's show which will tackle morning TV. And while Aniston…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}