{"url": "en.wikipedia.org/wiki/The_New_Celebrity_Apprentice", "text": "No.\n\noverall No. in\n\nseason Title Original air date Prod.\n\ncode US viewers\n\n(millions)\n\n84 1 \"In Here You Call Me Governor\" January 2, 2017 ( ) 1501 4.95[13]\n\nTask 1 Task Scope: Tyra Banks Cosmetics—Teams were to prepare a five-minute meet-and-greet experience to showcase and demonstrate a new line of makeup.\n\nTyra Banks Cosmetics—Teams were to prepare a five-minute meet-and-greet experience to showcase and demonstrate a new line of makeup. Prima Project Manager: Porsha Williams\n\nPorsha Williams Arete Project Manager: Boy George\n\nBoy George Judges: Arnold Schwarzenegger, Tyra Banks, Patrick Schwarzenegger\n\nArnold Schwarzenegger, Tyra Banks, Patrick Schwarzenegger Winning team: Arete\n\nArete Reasons for win: The team all learned how to help apply the makeup, and used their celebrity status effectively for the experience.\n\nThe team all learned how to help apply the makeup, and used their celebrity status effectively for the experience. Losing team: Prima\n\nPrima Reasons for loss: Celebrity \"image\" not used to full potential\n\nCelebrity \"image\" not used to full potential Sent to boardroom: Porsha Williams, Carrie Keagan, Nicole \"Snooki\" Polizzi\n\nPorsha Williams, Carrie Keagan, Nicole \"Snooki\" Polizzi Terminated: Carrie Keagan—for Schwarzenegger believing she was the weakest link of the three. The governor was proud of Porsha Williams for her leadership. Even though Carrie was her assistant, she still didn't contribute as much as the other women on Team Prima. Task 2 Task Scope: Trident—Teams were to prepare a short advertisement, including a jingle and video, for Trident's new gum brand.\n\nTrident—Teams were to prepare a short advertisement, including a jingle and video, for Trident's new gum brand. Prima Project Manager: Carnie Wilson\n\nCarnie Wilson Arete Project Manager: Jon Lovitz\n\nJon Lovitz Judges: Arnold Schwarzenegger, Tyra Banks, Patrick Schwarzenegger\n\nArnold Schwarzenegger, Tyra Banks, Patrick Schwarzenegger Winning team: Arete\n\nArete Reasons for win: While the video lacked some professional quality, the Trident executives felt it strongly carried the message about showing off one's smile.\n\nWhile the video lacked some professional quality, the Trident executives felt it strongly carried the message about showing off one's smile. Losing team: Prima\n\nPrima Reasons for loss: The marketing video did not send the message that the Trident executives requested.\n\nThe marketing video did not send the message that the Trident executives requested. Sent to boardroom: Carnie Wilson, Lisa Leslie, Nicole \"Snooki\" Polizzi\n\nCarnie Wilson, Lisa Leslie, Nicole \"Snooki\" Polizzi Terminated: Carnie Wilson—Schwarzenegger had no reason to terminate Lisa Leslie or Nicole Polizzi, for being the project manager, and for not bringing back Kyle Richards, who came up with the boxing idea that led to the team's failure to win\n\nCarnie Wilson—Schwarzenegger had no reason to terminate Lisa Leslie or Nicole Polizzi, for being the project manager, and for not bringing back Kyle Richards, who came up with the boxing idea that led to the team's failure to win NOTE: Eric Dickerson did not participate in this task due to a previous engagement.\n\n85 2 \"Fire Up That Chopper\" January 9, 2017 ( ) 1502 3.91[14]\n\nTask 3 Task Scope: Welch's—Teams had to come up with a talk show-like experience to Welch's executives and a studio audience on the health benefits of grape juice.\n\nWelch's—Teams had to come up with a talk show-like experience to Welch's executives and a studio audience on the health benefits of grape juice. Prima Project Manager: Laila Ali\n\nLaila Ali Arete Project Manager: Chael Sonnen\n\nChael Sonnen Judges: Arnold Schwarzenegger, Rocco DiSpirito, Patrick Schwarzenegger\n\nArnold Schwarzenegger, Rocco DiSpirito, Patrick Schwarzenegger Winning team: Prima\n\nPrima Reasons for win: The women put together a more cohesive talk-show experience that gave the health-related message well.\n\nThe women put together a more cohesive talk-show experience that gave the health-related message well. Losing team: Arete\n\nArete Reasons for loss: While as entertaining and interactive as the women's show, the men's talk-show lacked cohesion and lost the message the executives wanted told.\n\nWhile as entertaining and interactive as the women's show, the men's talk-show lacked cohesion and lost the message the executives wanted told. Sent to boardroom: Chael Sonnen, Ricky Williams, Eric Dickerson\n\nChael Sonnen, Ricky Williams, Eric Dickerson Terminated: Eric Dickerson—for not contributing much to the task and said he wouldn't care if the Governor terminated him. Schwarzenegger was going to terminate Chael Sonnen, but he fought to stay in the game and did. Also, after missing the second task, the Governor felt like Eric should have come back swinging, but his nonchalant attitude wasn't enough to keep him around, and Dickerson had no heart to stay in the competition. Task 4 Task Scope: King's Hawaiian—Teams had to come up with two viral videos to showcase the new King's Hawaiian line of barbecue sauces.\n\nKing's Hawaiian—Teams had to come up with two viral videos to showcase the new King's Hawaiian line of barbecue sauces. Prima Project Manager: Nicole \"Snooki\" Polizzi\n\nNicole \"Snooki\" Polizzi Arete Project Manager: Matt Iseman\n\nMatt Iseman Judges: Arnold Schwarzenegger, Justine Ezarik, Patrick Schwarzenegger\n\nArnold Schwarzenegger, Justine Ezarik, Patrick Schwarzenegger Winning team: Arete\n\nArete Reasons for win: Both videos from the men readily displayed the product and were considered funny, though lacked some production values.\n\nBoth videos from the men readily displayed the product and were considered funny, though lacked some production values. Losing team: Prima\n\nPrima Reasons for loss: While one video was considered great by the executives, the second video lacked production values, had no story line that could be followed, and lacked connection to the product.\n\nWhile one video was considered great by the executives, the second video lacked production values, had no story line that could be followed, and lacked connection to the product. Sent to boardroom: Nicole \"Snooki\" Polizzi, Porsha Williams, Lisa Leslie\n\nNicole \"Snooki\" Polizzi, Porsha Williams, Lisa Leslie Terminated: Nicole \"Snooki\" Polizzi—Schwarzenegger felt that Snooki was not a strong contestant and was willing to take responsibility. The women argued over whose fault it was, and Snooki broke down in tears. Arnold determined that the competition was too much for her, and she agreed and was sent to the chopper.\n\n86 3 \"Candy For a Billionaire\" January 16, 2017 ( ) 1503 4.33[15]\n\nTask 5 Task Scope: Kawasaki—Teams were to run a photo shoot and prepare a four-page brochure for Kawasaki's new motorcycle line.\n\nKawasaki—Teams were to run a photo shoot and prepare a four-page brochure for Kawasaki's new motorcycle line. Prima Project Manager: Kyle Richards\n\nKyle Richards Arete Project Manager: Carson Kressley\n\nCarson Kressley Judges: Arnold Schwarzenegger, Gemma Godfrey, Patrick Schwarzenegger\n\nArnold Schwarzenegger, Gemma Godfrey, Patrick Schwarzenegger Winning team: Arete\n\nArete Reasons for win: The men had a more out-of-the-box campaign idea, although some of their shots, including a tasteful nude of Carson Kressley on the motorcycle, might not resonate with their customer base.\n\nThe men had a more out-of-the-box campaign idea, although some of their shots, including a tasteful nude of Carson Kressley on the motorcycle, might not resonate with their customer base. Losing team: Prima\n\nPrima Reasons for loss: The women had more artistic photos than the men, but the campaign was considered safe, and the executives were concerned about a photo that had Brooke and her husband David Charvet which had put David in front, counter to their goal to sell the motorcycle to women.\n\nThe women had more artistic photos than the men, but the campaign was considered safe, and the executives were concerned about a photo that had Brooke and her husband David Charvet which had put David in front, counter to their goal to sell the motorcycle to women. Sent to boardroom: Kyle Richards, Brooke Burke-Charvet, Porsha Williams\n\nKyle Richards, Brooke Burke-Charvet, Porsha Williams Terminated: Kyle Richards—not only for the creativity, Richards has made too many mistakes throughout this whole season. While Burke tried to defend the issue with her husband, she refused to take “responsibility” for the whole team’s loss. Richards kept her in jeopardy, though, along with Williams, as that was the other photo which was negatively singled out. Schwarzenegger noted this wasn’t the first time Richards’ creativity had led to a loss, and since she was now project manager, she was “terminated.”\n\nKyle Richards—not only for the creativity, Richards has made too many mistakes throughout this whole season. While Burke tried to defend the issue with her husband, she refused to take “responsibility” for the whole team’s loss. Richards kept her in jeopardy, though, along with Williams, as that was the other photo which was negatively singled out. Schwarzenegger noted this wasn’t the first time Richards’ creativity had led to a loss, and since she was now project manager, she was “terminated.” NOTE: Kawasaki thought both teams did very well, so they decided to give Kyle Richards $25,000 for her charity despite her team's loss. Task 6 Task Scope: See's Candies—Teams were to prepare a celebrity-branded candy, and then sell these candies for the most money, using their connections to help raise the money. In addition, the team that made the best-tasting candy as judged by Warren Buffett would get a $25,000 bonus towards their money total. Buffett would meet with one member of each team in Omaha to sample the candies. The winning project manager would get all the money raised by the task.\n\nSee's Candies—Teams were to prepare a celebrity-branded candy, and then sell these candies for the most money, using their connections to help raise the money. In addition, the team that made the best-tasting candy as judged by Warren Buffett would get a $25,000 bonus towards their money total. Buffett would meet with one member of each team in Omaha to sample the candies. The winning project manager would get all the money raised by the task. Prima Project Manager: Vince Neil\n\nVince Neil Arete Project Manager: Ricky Williams\n\nRicky Williams Judges: Arnold Schwarzenegger, Gemma Godfrey, Patrick Schwarzenegger\n\nArnold Schwarzenegger, Gemma Godfrey, Patrick Schwarzenegger Winning team: Prima\n\nPrima Reasons for win: Team Prima had raised $378,535. They did research on Warren Buffett's preference in sweets to tailor the candy to the tasting competition, and succeeded in winning the $25,000 bonus. This bonus helped them to win the task.\n\nTeam Prima had raised $378,535. They did research on Warren Buffett's preference in sweets to tailor the candy to the tasting competition, and succeeded in winning the $25,000 bonus. This bonus helped them to win the task. Losing team: Arete\n\nArete Reasons for loss: Team Arete had raised $365,745.\n\nTeam Arete had raised $365,745. Sent to boardroom: Ricky Williams, Jon Lovitz, Laila Ali\n\nRicky Williams, Jon Lovitz, Laila Ali Terminated: Jon Lovitz—for raising the least amount of money on the team, which was $500. Boy George and Ricky Williams were the highest fundraisers on the team, while Brooke Burke-Chavet, Matt Iseman and Laila Ali raised more money than Jon. Laila was responsible for making the candy and was tasked for not researching what Buffett would prefer, which cost their chances of winning the $25,000 bonus, but defended her losing candy. Both were kept in jeopardy, and continued to point fingers at each other with Williams. Although Schwarzenegger kept criticizing Ricky Williams for not going full-throttle with the fundraising, in the end, Schwarzenegger almost terminated Williams but chose Jon Lovitz to be terminated. On top of that, he was disruptive and a weak link on Team Arete. While getting to the chopper, Lovitz was using his comedy skill to get away from the chopper. Plus, he stated in his interview that he is not a good fundraiser.\n\nJon Lovitz—for raising the least amount of money on the team, which was $500. Boy George and Ricky Williams were the highest fundraisers on the team, while Brooke Burke-Chavet, Matt Iseman and Laila Ali raised more money than Jon. Laila was responsible for making the candy and was tasked for not researching what Buffett would prefer, which cost their chances of winning the $25,000 bonus, but defended her losing candy. Both were kept in jeopardy, and continued to point fingers at each other with Williams. Although Schwarzenegger kept criticizing Ricky Williams for not going full-throttle with the fundraising, in the end, Schwarzenegger almost terminated Williams but chose Jon Lovitz to be terminated. On top of that, he was disruptive and a weak link on Team Arete. While getting to the chopper, Lovitz was using his comedy skill to get away from the chopper. Plus, he stated in his interview that he is not a good fundraiser. NOTE: Arnold decided to switch up the teams since the women had lost four out of five tasks. Vince Neil, Carson Kressley and Chael Sonnen moved to Prima while Brooke Burke-Charvet and Laila Ali moved to Arete. Cameo appearances by Kyle Richards, Carrot Top, Paul Kemsley and Sugar Ray Leonard also made a donation to Team Arete but didn't appear in the episode.\n\nArnold decided to switch up the teams since the women had lost four out of five tasks. Vince Neil, Carson Kressley and Chael Sonnen moved to Prima while Brooke Burke-Charvet and Laila Ali moved to Arete.\n\n87 4 \"Scissors and Some Creativity\" January 23, 2017 ( ) 1504 3.90[16]\n\nTask 7 Task Scope: Lorissa's Food Brand—Teams were tasked for marketing a new product for a health food brand Lorissa's Kitchen.\n\nLorissa's Food Brand—Teams were tasked for marketing a new product for a health food brand Lorissa's Kitchen. Prima Project Manager: Lisa Leslie\n\nLisa Leslie Arete Project Manager: Brooke Burke-Charvet\n\nBrooke Burke-Charvet Judges: Arnold Schwarzenegger, Bob Harper, Patrick Schwarzenegger\n\nArnold Schwarzenegger, Bob Harper, Patrick Schwarzenegger Winning team: Arete\n\nArete Reasons for win: The executives like their “from the farm, to your table” feel of their setting. They felt that Brooke had a very authentic connection to the brand.\n\nThe executives like their “from the farm, to your table” feel of their setting. They felt that Brooke had a very authentic connection to the brand. Losing team: Prima\n\nPrima Reasons for loss: Even though the executives loved Carson as an engaging host and the better space of the team's container display, they felt it was very chaotic of a party atmosphere, and the sexy-dance girls were cheap and off-brand.\n\nEven though the executives loved Carson as an engaging host and the better space of the team's container display, they felt it was very chaotic of a party atmosphere, and the sexy-dance girls were cheap and off-brand. Sent to boardroom: Lisa Leslie, Vince Neil, Chael Sonnen\n\nLisa Leslie, Vince Neil, Chael Sonnen Terminated: Vince Neil—although he won the last task and got more money for his charity, he was responsible for coming up with the ladies dancing idea, which the executives didn't like. Schwarzenegger called Leslie out for previously clashing with the all-women team and now with guys Sonnen and Neil, but also criticized the two men for not going above and beyond. But as Leslie and Sonnen battled, Neil stunned everyone by saying he himself should be terminated. And so, the boss terminated the rocker. Task 8 Task Scope: Universal Studios Hollywood—Teams were tasked to create a digital brochure for the buzzworthy Harry Potter attraction at Universal Studios Hollywood.\n\nUniversal Studios Hollywood—Teams were tasked to create a digital brochure for the buzzworthy Harry Potter attraction at Universal Studios Hollywood. Prima Project Manager: Carson Kressley\n\nCarson Kressley Arete Project Manager: Matt Iseman\n\nMatt Iseman Judges: Arnold Schwarzenegger, Tracey Edmonds, Patrick Schwarzenegger\n\nArnold Schwarzenegger, Tracey Edmonds, Patrick Schwarzenegger Winning team: Arete\n\nArete Reasons for win: Matt Iseman, a self-admitted fan of Harry Potter, helped to lead an earnest and engaging live presentation, including an organic, creative digital brochure.\n\nMatt Iseman, a self-admitted fan of Harry Potter, helped to lead an earnest and engaging live presentation, including an organic, creative digital brochure. Losing team: Prima\n\nPrima Reasons for loss: The executives felt the concept of the digital brochure was too predictable and felt the team had an uninspired presentation. In the end, Team Prima missed the point of the task.\n\nThe executives felt the concept of the digital brochure was too predictable and felt the team had an uninspired presentation. In the end, Team Prima missed the point of the task. Disqualified: Chael Sonnen—for cheating by cutting the computer cord to buy the team extra time to finish the task. He was fired before the winning and losing teams were announced in the boardroom.\n\nChael Sonnen—for cheating by cutting the computer cord to buy the team extra time to finish the task. He was fired before the winning and losing teams were announced in the boardroom. Sent to boardroom: No Final Boardroom\n\nNo Final Boardroom Terminated: Porsha Williams—for being a failure in the creative process in the task, and for talking too much in the boardroom to avoid answering the Governor's questions. Even though Carson was responsible for the teams' unsuccessful presentation, Schwarzenegger felt Carson has done very well in the competition. But Porsha's losing record (2-6) and too many words got her sent to the chopper.\n\nPorsha Williams—for being a failure in the creative process in the task, and for talking too much in the boardroom to avoid answering the Governor's questions. Even though Carson was responsible for the teams' unsuccessful presentation, Schwarzenegger felt Carson has done very well in the competition. But Porsha's losing record (2-6) and too many words got her sent to the chopper. NOTES: Boy George did not participate in this task due to a previous engagement. Arnold told Chael \"you're fired\" rather than \"you're terminated.\"\n\n88 5 \"I'm Going Full Ballmer\" January 30, 2017 ( ) 1505 3.71[17]\n\nTask 9 Task Scope: Los Angeles Clippers -The teams have to create a high-energy presentation to promote the Clipper brand and fire up Clipper Nation during a timeout in a game, as well as designing a T-shirt for fans.\n\nLos Angeles Clippers -The teams have to create a high-energy presentation to promote the Clipper brand and fire up Clipper Nation during a timeout in a game, as well as designing a T-shirt for fans. Prima Project Manager: Lisa Leslie\n\nLisa Leslie Arete Project Manager: Ricky Williams\n\nRicky Williams Judges: Arnold Schwarzenegger, Steve Ballmer, Patrick Schwarzenegger\n\nArnold Schwarzenegger, Steve Ballmer, Patrick Schwarzenegger Winning team: Prima\n\nPrima Reasons for win: Although Lisa was criticized for not showing off her basketball skills, the original song created by Boy George proved popular with the audience, and their T-shirt was judged to be superior.\n\nAlthough Lisa was criticized for not showing off her basketball skills, the original song created by Boy George proved popular with the audience, and their T-shirt was judged to be superior. Losing team: Arete\n\nArete Reasons for loss: Ballmer felt it wasn’t super creative that they used his line in a goofy manner; he feels they “hijacked” his words. He believed it started well, but they didn’t push for the crowd to chant more and it fell flat.\n\nBallmer felt it wasn’t super creative that they used his line in a goofy manner; he feels they “hijacked” his words. He believed it started well, but they didn’t push for the crowd to chant more and it fell flat. Sent to boardroom: Ricky Williams, Brooke Burke-Charvet, Laila Ali\n\nRicky Williams, Brooke Burke-Charvet, Laila Ali Terminated: Ricky Williams—for his terrible project manager record (0-2). Though Laila Ali was criticized for showing no positive energy, she fought harder to stay than Ricky. Ricky was also fired for not pushing the concept far enough and for being a weak contributor for the majority of the recent tasks.\n\nRicky Williams—for his terrible project manager record (0-2). Though Laila Ali was criticized for showing no positive energy, she fought harder to stay than Ricky. Ricky was also fired for not pushing the concept far enough and for being a weak contributor for the majority of the recent tasks. NOTE: Arnold moved Boy George to Prima to even out the teams. Task 10 Task Scope: QVC- The teams had to pick a piece of fitness equipment and sell as many as they could on QVC live from Muscle Beach. The team that generates the most revenue wins.\n\nQVC- The teams had to pick a piece of fitness equipment and sell as many as they could on QVC live from Muscle Beach. The team that generates the most revenue wins. Prima Project Manager: Carson Kressley\n\nCarson Kressley Arete Project Manager: Brooke Burke-Charvet\n\nBrooke Burke-Charvet Judges: Arnold Schwarzenegger, Leeza Gibbons, Patrick Schwarzenegger\n\nArnold Schwarzenegger, Leeza Gibbons, Patrick Schwarzenegger Winning team: Arete\n\nArete Reasons for win: Arete sold 156 units for $17,158.\n\nArete sold 156 units for $17,158. Losing team: Prima\n\nPrima Reasons for loss: Prima sold 88 units for a total of $8,798.\n\nPrima sold 88 units for a total of $8,798. Sent to boardroom: No final boardroom\n\nNo final boardroom Terminated: Carson Kressley—for not having Lisa sell the equipment like Leeza Gibbons suggested, his second loss as project manager (1-2), and leading his team to a crushing defeat. Lisa Leslie—for being a weak sound producer for the sales segment (e.g. not coordinated well with the sales graphs), not being the sales pitch that Leeza Gibbons suggested, having a team record of 3–7, and coming back to the boardroom five times.\n\nNOTES: Arnold told Carson and Lisa \"you're fired\" rather than \"you're terminated\". Boy George was the only person on Team Prima because he was not responsible for the loss.\n\n89 6 \"Bon Voyage\" February 6, 2017 ( ) 1506 3.48[18]\n\nTask 11 Task Scope: The Honest Company—Each team of two was tasked with creating an in-home demonstration showcasing products from the Honest Company, with the company's founder Jessica Alba watching.\n\nThe Honest Company—Each team of two was tasked with creating an in-home demonstration showcasing products from the Honest Company, with the company's founder Jessica Alba watching. Prima Project Manager: Boy George\n\nBoy George Arete Project Manager: Laila Ali\n\nLaila Ali Judges: Arnold Schwarzenegger, Jessica Alba, Patrick Schwarzenegger\n\nArnold Schwarzenegger, Jessica Alba, Patrick Schwarzenegger Winning team: Prima\n\nPrima Reasons for win: Jessica Alba liked the background music, their depiction of a married couple, and their risk-taking, but thought they lacked the takeaways about The Honest Company. But still, they liked it more than ever.\n\nJessica Alba liked the background music, their depiction of a married couple, and their risk-taking, but thought they lacked the takeaways about The Honest Company. But still, they liked it more than ever. Losing team: Arete\n\nArete Reasons for loss: Jessica Alba felt it was concise, hit the product uses, and had tangible takeaways, but it wasn't really creative in the presenting of the company.\n\nJessica Alba felt it was concise, hit the product uses, and had tangible takeaways, but it wasn't really creative in the presenting of the company. Sent to boardroom: No Final Boardroom\n\nNo Final Boardroom Terminated: Laila Ali—for not going out of her comfort zone. Schwarzenegger had no reason to fire Matt because he was very good in the whole competition. Iseman's acknowledged was inauthentic, but put the lack of creativity on Ali, who insisted she was the “stronger” competitor to move on. Obviously, they both thought the other should be fired, and Iseman pointed out that this was only his first time in jeopardy. Ultimately, Schwarzenegger told Ali, “You’re terminated.”\n\nLaila Ali—for not going out of her comfort zone. Schwarzenegger had no reason to fire Matt because he was very good in the whole competition. Iseman's acknowledged was inauthentic, but put the lack of creativity on Ali, who insisted she was the “stronger” competitor to move on. Obviously, they both thought the other should be fired, and Iseman pointed out that this was only his first time in jeopardy. Ultimately, Schwarzenegger told Ali, “You’re terminated.” NOTE: Schwarzenegger moved Brooke Burke-Charvet back to Team Prima with Boy George to even out the teams. Task 12 Schwarzenegger called the three finalists back to the boardroom and asked the three who should stay. In the end, the Governor fired Brooke Burke-Charvet. Terminated: Brooke Burke-Charvet—although the Governor had praised Boy George, Matt Iseman and Brooke Burke-Chavet. Each had won two times as project manager, though Iseman and Boy George were neck-and-neck with their win-loss records (7-4 vs. 7-3). All three had to convince Schwarzenegger why they should go on to the finale. But Schwarzenegger felt that Brooke was a little bit off the edge. Finalists: Boy George and Matt Iseman\n\nFinal Task Scope: Carnival Corporation—expected to create an ad campaign, host a party and produce a variety show that can't be accomplished without some familiar faces. Matt's Team: Carrie Keagan, Kyle Richards, Carnie Wilson Boy George's Team: Laila Ali, Carson Kressley, Porsha Williams\n\nCarnival Corporation—expected to create an ad campaign, host a party and produce a variety show that can't be accomplished without some familiar faces. Task Tension: On Boy George's team, The keyboardist arrives to work with Boy George composing and writing two songs. He is getting frustrated that he isn’t playing what he needs to play and giving it too much personality. He stands up and walks out of the room, telling the producers the keyboardist needs to go and they need to replace him. Boy George gets frustrated and says he can’t be wasting time right now. He tells the producers that he is not going back into the room to have a row with the guy for their pleasure, and orders them to get rid of him or he will leave the show. Porsha is asked to remove the keyboardist and she does. Meanwhile on Matt Iseman's team, Matt continues to struggle with creativity but tells his team he is open to suggestions. He also tells his team they need to finish their ad, as that is their main priority. Carrie is to focus on going through the photos and choosing the best one. Kyle is responsible for the party layout and their different spaces. Carnie is in charge of food and entertainment, suggesting Wilson Phillips will be performing. Matt is working on the fundraising, strongly believing Boy George will easily blow past $500,000. He wants to prove the Governor wrong, who feels Matt won’t be able to raise the funds. He also worries about letting down his charity and promises to give it everything he has.\n\nOn Boy George's team, The keyboardist arrives to work with Boy George composing and writing two songs. He is getting frustrated that he isn’t playing what he needs to play and giving it too much personality. He stands up and walks out of the room, telling the producers the keyboardist needs to go and they need to replace him. Boy George gets frustrated and says he can’t be wasting time right now. He tells the producers that he is not going back into the room to have a row with the guy for their pleasure, and orders them to get rid of him or he will leave the show. Porsha is asked to remove the keyboardist and she does. Meanwhile on Matt Iseman's team, Matt continues to struggle with creativity but tells his team he is open to suggestions. He also tells his team they need to finish their ad, as that is their main priority. Carrie is to focus on going through the photos and choosing the best one. Kyle is responsible for the party layout and their different spaces. Carnie is in charge of food and entertainment, suggesting Wilson Phillips will be performing. Matt is working on the fundraising, strongly believing Boy George will easily blow past $500,000. He wants to prove the Governor wrong, who feels Matt won’t be able to raise the funds. He also worries about letting down his charity and promises to give it everything he has. NOTE: Brooke's termination marks the end of the original Prima members. Both finalists are from the same original team (Arete). Curtis Stone makes an appearance on the show. He helps Boy George's Team to do a photo shoot. He gets Porsha and Carson out of the dining room before they can drink too much alcohol. George is happy they got what they came for.\n\n90 7 \"I Have No Time For Anyone's Ego Except My Own\" February 13, 2017 ( ) 1507 3.48[19]", "images": ["https://upload.wikimedia.org/wikipedia/en/c/c3/NewCA_2016.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/c/c3/NewCA_2016.jpg/220px-NewCA_2016.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/c/c3/NewCA_2016.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_New_Celebrity_Apprentice", "title": "The New Celebrity Apprentice", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/c/c3/NewCA_2016.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}