{"url": "https://www.wmagazine.com/story/kate-beckinsale-says-harvey-weinstein-offered-alcohol-age-17", "text": "Theo Wargo/Getty Images\n\nKate Beckinsale is the latest woman to come forward with a story about Harvey Weinstein's alleged sexual misconduct, describing an incident from when the actress was just 17 years old.\n\nOn Thursday, Beckinsale posted a photo of her teenage self on Instagram with a caption recounting an alleged encounter between her and Weinstein. \"I was called to meet Harvey Weinstein at the Savoy Hotel when I was 17,\" she writes. \"I assumed it would be in a conference room which was very common.\"\n\nThe actress then describes behavior almost identical to that detailed by many other women who have accused Weinstein of sexual harassment or assault, and that appeared in the exposes written by The New York Times and The New Yorker. \"When I arrived reception told me to go to his room,\" Beckinsale continued. \"He opened the door in his bathrobe. I was incredibly naive and young and it did not cross my mind that this older, unattractive man would expect me to have any sexual interest in him. After declining alcohol and announcing that I had school in the morning I left, uneasy but unscathed.\"\n\nBeckinsale then says Weinstein would later allude to the incident in question and subject her to verbal abuse over the years. \"A few years later he asked me if he had tried anything with me in that first meeting. I realized he couldn't remember if he had assaulted me or not,\" the actress wrote. \"I had what I thought were boundaries — I said no to him professionally many times over the years — some of which ended up with him screaming at me calling me a c*nt and making threats, some of which made him laughingly tell people oh 'Kate lives to say no to me.'\"\n\nBeckinsale continues her post by calling out Hollywood's culture of silence and complicity before applauding the women who have spoken out about their experiences with Weinstein. \"It speaks to the status quo in this business that I was aware that standing up for myself and saying no to things, while it did allow me to feel uncompromised in myself, undoubtedly harmed my career and was never something I felt supported by anyone other than my family,\" she says. \"I would like to applaud the women who have come forward, and to pledge that we can from this create a new paradigm where producers, managers, executives and assistants and everyone who has in the past shrugged and said 'Well, that's just Harvey /Mr X/insert name here' will realize that we in numbers can affect real change. For every moment like this there have been thousands where a vulnerable person has confided outrageous unprofessional behavior and found they have no recourse, due to an atmosphere of fear that it seems almost everyone has been living in.\"\n\nRelated Videos\n\nThe actress concludes her account with a story about a friend she says tried to warn another woman about Weinstein. \"I had a male friend who, based on my experience, warned a young actress who said she was going to dinner with Harvey to be careful,\" she recounts. \"He received a phone call the next day saying he would never work in another Miramax film; the girl was already sleeping with Harvey and had told him that my friend had warned her off. Let's stop allowing our young women to be sexual cannon fodder, and let's remember that Harvey is an emblem of a system that is sick, and that we have work to do.\"\n\nSince the publication of the stories in the Times and The New Yorker, other actresses have described experiences similar to Beckinsale's from early on in their career. They include Cara Delevigne, who says Weinstein invited her up to his hotel room, where there was another woman who attempted to kiss her at his behest, and Gwyneth Paltrow, who says the producer suggested \"they head to the bedroom for massages\" when she was 22, after he cast her as the lead in Emma.\n\nAs the accusations continue to pile up against Weinstein, both the New York Police Department and the London police have begun investigations into the allegations, according to The Guardian. Meanwhile, Weinstein has announced his departure from Los Angeles to seek treatment in a rehabilitation center.\n\nRelated: How Tabloids Dragged Ambra Gutierrez Through the Mud After She Accused Harvey Weinstein of Groping Her\n\n\"Women's Rights Are Human Rights\": 62 Fashion Insiders Speak Out in a Powerful Video for International Women's Day:", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.facebook.com/tr?id=3223313014351882&ev=PageView&noscript=1", "https://www.wmagazine.com/wp-content/uploads/2017/10/12/59df93ad38668d05ce191ed6_kate-beckinsale.jpg?crop=0px,0px,2820px,1410px&w=790px"], "top_img": "https://www.wmagazine.com/wp-content/uploads/2017/10/12/59df93ad38668d05ce191ed6_kate-beckinsale.jpg?crop=0px,0px,2820px,1410px&w=790px", "keywords": [], "authors": [], "canonical_link": "https://www.wmagazine.com/story/kate-beckinsale-says-harvey-weinstein-offered-alcohol-age-17/", "title": "Kate Beckinsale Says Harvey Weinstein Offered Her Alcohol When She Was 17 Years Old", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "On her Instagram, Kate Beckinsale shared an encounter she had with Harvey Weinstein when she was 17, wherein he allegedly propositioned her in a hotel room.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Kate Beckinsale Says Harvey Weinstein Offered Her Alcohol When She Was 17 Years Old", "description": "On her Instagram, Kate Beckinsale shared an encounter she had with Harvey Weinstein when she was 17, wherein he allegedly propositioned her in a hotel room.", "url": "https://www.wmagazine.com/story/kate-beckinsale-says-harvey-weinstein-offered-alcohol-age-17/", "site_name": "W Magazine | Women's Fashion & Celebrity News", "image": {"identifier": "https://www.wmagazine.com/wp-content/uploads/2017/10/12/59df93ad38668d05ce191ed6_kate-beckinsale.jpg?crop=0px,0px,2820px,1410px&w=790px", "secure_url": "https://www.wmagazine.com/wp-content/uploads/2017/10/12/59df93ad38668d05ce191ed6_kate-beckinsale.jpg?crop=0px,0px,2820px,1410px&w=790px", "width": 2820, "height": 1586}}, "fb": {"app_id": 450372832509980}, "twitter": {"card": "summary_large_image", "description": "On her Instagram, Kate Beckinsale shared an encounter she had with Harvey Weinstein when she was 17, wherein he allegedly propositioned her in a hotel room.", "title": "Kate Beckinsale Says Harvey Weinstein Offered Her Alcohol When She Was 17 Years Old", "image": "https://www.wmagazine.com/wp-content/uploads/2017/10/12/59df93ad38668d05ce191ed6_kate-beckinsale.jpg?crop=0px,0px,2820px,1410px&w=790px&mbid=social_retweet"}, "generator": "WordPress 5.4", "msapplication-TileImage": "https://www.wmagazine.com/wp-content/uploads/2020/01/cropped-favicon.png?fit=270%2C270"}, "movies": [], "publish_date": null, "source": "https://www.wmagazine.com", "summary": ""}