{"url": "https://www.ocregister.com/2016/03/31/lea-salonga-voice-of-mulan-and-princess-jasmine-to-perform-at-segerstrom-center/", "text": "Born and raised in the Philippines, Lea Salonga grew up watching Disney movies and listening to Disney storybook tapes. Never did she imagine, though, that she would grow up to be a real-life, bona fide Disney Princess.\n\nThen, after earning a Tony Award for her portrayal of Kim in the Broadway musical “Miss Saigon” in 1991, Salonga landed the career break of a lifetime: to be the singing voice of Princess Jasmine in the 1992 hit Disney film “Aladdin.”\n\nSix years later, she got a second chance to live her young girl’s dream as she performed the vocals of Mulan in the 1998 Disney film of that name.\n\n“I never thought when I was 5 and listening to ‘Cinderella’ stories that I’d be a Disney princess. I think it’s such a magical thing to happen in my life, and for it to happen twice is something I would never have thought could happen,” said Salonga in a recent phone interview.\n\nSalonga’s distinctive voice will return to Southern California for concerts tonight at the Valley Performing Arts Center in Northridge and Saturday at Segerstrom Center for the Arts. Backed by a four-piece band, Salonga will perform a selection of well-known songs, including her greatest hits from her various musicals and films.\n\n“We made sure to choose a fun program that the band is going to dig playing and I’m going to love singing,” said Salonga, “and because we are having so much fun onstage, I hope that translates to the audience as well.”\n\nSalonga is keeping the program’s song selections a secret for now, until she and her musical director decide on the set list; however, she promises all of the tunes will be familiar and fit her vocal range. Some of the songs, she added, will be making their California debut.\n\n“This will be the first time for California audiences to hear these songs, but there is nothing unknown or out of left field; stuff that always makes sense with my voice.”\n\nA regular feature of Salonga’s solo concerts is an audience participation segment, in which she chooses someone to join her onstage to sing the Grammy and Academy Award-winning duet “A Whole New World” from “Aladdin.”\n\n“No need to panic; we always have a lyric sheet so anyone who dares to come up doesn’t have to have it memorized fully,” she said. “I want them to have fun.”\n\nSalonga has numerous Broadway credits, including her role as Eponine in the 1993 “Les Misérables” Broadway run and as Fantine in the 2006 Broadway revival. She recently came off Broadway in the new musical “Allegiance,” which also starred George Takei and Telly Leung.\n\nSplitting her time between the U.S. and Manila, Salonga is a coach on the Philippine version of the television show “The Voice.” In addition to her onscreen and onstage career, she has released several solo albums, including “I’d Like to Teach the World to Sing” (1997) and “By Heart” (1999).\n\nOn this tour, Grammy-nominated bass player Trey Henry and drummer Ray Brinker, both from the jazz group Tierney Sutton Band, will back Salonga.\n\n“I get to go up onstage with musicians who I really admire and respect, and just have a great time with,” Salonga said. “It’s thrilling when I get to perform stuff where I can just emotionally let go and fly off to another world in my mind, and the audience gets to ride on that too.”\n\nContact the writer: jmoe@ocregister.com", "images": ["https://www.ocregister.com/wp-content/uploads/migration/o4x/o4xg44-b88660685z.120160331163106000g2kfjet5.10.jpg?w=1024&h=670", "https://www.ocregister.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg", "https://secure.gravatar.com/avatar/2538079f39125cfecb254db2c54bcc07?s=85&d=mm&r=g", "https://secure.gravatar.com/avatar/?s=85&d=mm&r=g", "https://www.ocregister.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://www.ocregister.com/wp-content/uploads/2017/09/oc-register-logo-376x79.svg"], "top_img": "https://www.ocregister.com/wp-content/uploads/migration/o4x/o4xg44-b88660685z.120160331163106000g2kfjet5.10.jpg?w=1024&h=670", "keywords": [], "authors": ["Jackie Moe", "Orange County Register", "Jackie Moe Is A Features Reporter For The Orange County Register. She Has Covered Entertainment Since For The Press-Enterprise", "The Oc Register", "Including Local Events", "Theater Previews", "Concert Reviews", "Human Interest Stories. Since", "She Has Reported As The Head Theater Writer", "Covering Local"], "canonical_link": "https://www.ocregister.com/2016/03/31/lea-salonga-voice-of-mulan-and-princess-jasmine-to-perform-at-segerstrom-center/", "title": "Lea Salonga, voice of ‘Mulan’ and Princess Jasmine, to perform at Segerstrom Center", "meta_data": {"application-name": "orangecountyregister", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 6883399629}, "google-site-verification": "cgpEpd98F7xFS0-WkGzGDc2KVzggxgQbOZaXRXYT61o", "og": {"type": "article", "title": "Lea Salonga, voice of ‘Mulan’ and Princess Jasmine, to perform at Segerstrom Center", "url": "https://www.ocregister.com/2016/03/31/lea-salonga-voice-of-mulan-and-princess-jasmine-to-perform-at-segerstrom-center/", "description": "Born and raised in the Philippines, Lea Salonga grew up watching Disney movies and listening to Disney storybook tapes. Never did she imagine, though, that she would grow up to be a real-life, bona…", "site_name": "Orange County Register", "image": {"identifier": "https://www.ocregister.com/wp-content/uploads/migration/o4x/o4xg44-b88660685z.120160331163106000g2kfjet5.10.jpg?w=1024&h=670", "width": 1024, "height": 670}, "locale": "en_US"}, "article": {"published_time": "2016-03-31T19:19:00+00:00", "modified_time": "2016-03-31T19:19:00+00:00"}, "twitter": {"text": {"title": "Lea Salonga, voice of ‘Mulan’ and Princess Jasmine, to perform at Segerstrom Center"}, "image": "https://www.ocregister.com/wp-content/uploads/migration/o4x/o4xg44-b88660685z.120160331163106000g2kfjet5.10.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.ocregister.com/wp-content/uploads/2017/04/cropped-ocr_icon11.jpg?w=270"}, "movies": [], "publish_date": 1459353600.0, "source": "https://www.ocregister.com", "summary": ""}