{"url": "https://web.archive.org/web/20070105024255/http://www.focusonthefamily.com:80/press/focusvoices/A000000025.cfm", "text": "James C. Dobson, Ph.D., is founder and chairman of Focus on the Family, a non-profit organization that produces his internationally syndicated radio programs, heard on over 3,000 radio facilities in North America and in twenty seven languages in approximately 4,130 additional facilities in over 160 other countries.\n\nHis commentaries are heard by more than 220 million people by way of radio every day, including a translation of a program carried on state-owned radio stations in the Republic of China. He is seen on approximately 60 television stations daily in the U.S.\n\nDobson was for 14 years an Associate Clinical Professor of Pediatrics at the University of Southern California School of Medicine, and served for 17 years on the Attending Staff of Children's Hospital of Los Angeles in the Division of Child Development and Medical Genetics. He has an earned Ph.D. from the University of Southern California (1967) in the field of child development. He is a licensed psychologist in the state of California and a licensed marriage, family and child counselor in both California and Colorado. He is listed in Who's Who in Medicine and Healthcare.\n\nIN RECOGNITION of distinguished service in preserving the family, Dr. James Dobson\n\nhas been recognized\n\nwith academic honors over the past 20 years.\n\nHonorary Degrees Doctor of Laws from Pepperdine University (1983) Doctor of Humanities from Franciscan University of Steubenville, Ohio (1988) Doctor of Humane Letters from Seattle Pacific University (1988) Doctor of Humane Letters from Asbury Theological Seminary (1989) Honorary Doctor of Humane Letters from MidAmerica Nazarene College (1992) Doctor of Letters from Liberty University (1993) Doctor of Humane Letters from Campbell University (1994) Doctor of Humane Letters from Point Loma Nazarene College (1994) Doctor of Literature from Biola University (1995), Doctor of Humanities from Abilene Christian University (1995) Doctor of Humane Letters from Huntington College (1997) Doctor of Public Service from Greenville College (1997) Doctor of Humane Letters from William Tyndale College (1998) Doctor of Humanities from Harding University (1999) Doctor of Humanities from Olivet Nazarene University (1999). and a Doctor of Humane Letters from Indiana Wesleyan University (2005).\n\nBest-Selling Books\n\nDr. Dobson's first book for parents and teachers, Dare to Discipline, has sold more than 4.5 million copies and was selected as one of 50 books to be rebound and placed in the White House Library. It has now been revised and updated as The New Dare to Discipline . He has now written 36 books, including:\n\nFilm and Video Projects\n\nAwards and Recognition\n\nAdvocate for the Family\n\nHis first film series, \"Focus on the Family,\" has now been seen by over 70 million people. His second film series, \"Turn Your Heart Toward Home,\" was released in January 1986. A third seven-part series, \"Life on The Edge\" , designed to help late teens bridge the gap between adolescence and young adulthood, was released in early 1994. In 2002, he produced an eleven-part series based on his best-selling book, \"Bringing up Boys;\" and in 2005, he recorded the \"Your Child\" Essentials of Discipline Video seminar, which presents his time-honored childrearing principles to a new generation of parents.Dr. Dobson was chosen as Layman of the Year by the National Association of Evangelicals in 1982. He was honored in 1987 as \"The Children's Friend\" by CHILDHELP USA, an organization devoted to the prevention of child abuse. He received the Alumni Merit Award from the University of Southern California General Alumni Association (1989); the Humanitarian Award by the California State Psychological Association (1988); the \"Philip Award\" from the United Methodist Church (1994); the \"1996 Man of the Year Award\" by the American Association of Pro-Life Obstetricians and Gynecologists; and 1997 International Human Life Award from Human Life International; Salvation Army \"Others\" Award (1999); the \"Christian Counseling in the Media Award\" from the Board of Directors of the Christian Association for Psychological Studies (CAPS)(1999);the Catholic Alliance Family Advocate of the Year Award (2001); and the \"Proudly Pro-Life Award,\" given by the National Right to Life (2002); the \"Churchill Award\" for Courageous and Committed Service to the Conservative Cause from the Council for National Policy (2002); the Fellowship of Christian Athletes \"Tom Landry Award\" (2003); and Marketplace Ministries \"Integrity in Family Award\" (2004); Promise Keepers \"Trail Blazer Award\" (2005); and was inducted into Indiana Wesleyan University's Society of World Changers (2005); and the First Baptist Church of Dallas' \"W.A. Criswell Lifetime Christian Citizenship Award\" (2006).Dr. Dobson has been heavily involved in governmental activities related to the family. He served on the task force which summarized the White House Conference on Families and received a special commendation from President Jimmy Carter in 1980. He was appointed by President Ronald Reagan to the National Advisory Commission to the office of Juvenile Justice and Delinquency Prevention, 1982-84. From 1984-87 he was regularly invited to the White House to consult with President Reagan and his staff on family matters. He served as co-chairman of the Citizens Advisory Panel for Tax Reform, in consultation with President Reagan, and served as a member and later chairman of the United States Army's Family Initiative, 1986-88.\n\nHe was appointed to Attorney General Edwin Meese's Commission on Pornography, 1985-86. Dr. Dobson was also appointed in the spring of 1987 to the Attorney General's Advisory Board on Missing and Exploited Children, and to Secretary Otis Bowen's Panel on Teen Pregnancy Prevention, within the Department of Health and Human Services. In October, 1987, he received the Marian Pfister Anschutz Award in recognition of his contribution to the American family. A videotaped message of congratulations was sent by President Reagan. He also consulted with President George Bush on family-related matters. In December, 1994, Dr. Dobson was appointed by Senator Robert Dole to the Commission on Child and Family Welfare and in October, 1996, was appointed by Senate Majority Leader Trent Lott to the National Gambling Impact Study Commission.\n\nDr. Dobson is married to Shirley, and the father of two grown children, Danae and Ryan. The Dobsons reside in Colorado Springs, Colorado.\n\nFor more information, contact Gary Schneeberger at (719) 548-5853 or press@family.org, or Sonja Swiatkiewicz at (719) 548-4634 or culturalissues@family.org.", "images": ["https://web.archive.org/web/20070105024255im_/http://www.focusonthefamily.com/images/bios/JamesDobsonTHM2.jpg", "https://web.archive.org/web/20070105024255im_/http://www.focusonthefamily.com/images/bios/JamesDobsonTHM1.jpg", "https://web.archive.org/web/20070105024255im_/http://www.focusonthefamily.com/images/bios/JamesDobson.jpg", "https://web.archive.org/web/20070105024255im_/http://statse.webtrendslive.com/dcsuomczv10000gkaiqgi9fok_7k8j/njs.gif?dcsuri=/nojavascript&WT.js=No"], "top_img": "https://web.archive.org/web/20070105024255im_/http://www.focusonthefamily.com/images/bios/JamesDobson.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "Dr. James Dobson", "meta_data": {"description": "James C. Dobson, Ph.D., is founder and \nchairman of Focus on the Family, \na non-profit organization that produces his \ninternationally syndicated radio programs, \nheard on nearly 3,000 radio facilities in the U.S. and approximately 4,000 internationally in over 160 countries.", "keywords": "dobson, dr. dobson, james dobson, dr. james \ndobson, james c. dobson, ph.d."}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}