{"url": "www.inquisitr.com/4750778/big-bang-theory-drama-behind-the-scenes-not-causing-show-to-fall-apart-debunked/", "text": "Big Bang Theory has been a staple program on CBS for over a decade now and continues to please viewers weekly. Yet recent reports have suggested that the cast members of the show are at odds and that the drama which has resulted, is causing chaos behind the scenes.\n\nAn unreliable tabloid has suggested that the main stars of the show are not happy about their pay and their air time, which is supposedly causing tensions to run high behind the scenes of the long-running sitcom.\n\nGossip Cop notes the details of this recent rumor that has surfaced. The said source to these claims also insists that the former relationship between stars Kaley Cuoco and Johnny Galecki has caused things to be awkward on-set.\n\nThe insider states that “The short-lived relationship antagonized star Jim Parsons and created tensions among the entire cast. Now none of them socialize together at all once the cameras stop rolling.”\n\nApparently there has never been a “friendly” relationship among cast members since the show aired, according to the same source, that is. However, the gossip policing site has reminded how Cuoco and Galecki are actually friendly on set since their split and joke around, as indicated by posts to social media.\n\n“Cuoco and Galecki have remained on good terms since their 2010 split. Last year, Cuoco posted a funny Instagram photo of Galecki cuddling with her current boyfriend Karl Cook, and joked in the caption, ‘Get off my man!’ Clearly, there are no hard feelings between the exes and co-stars.”\n\nGC has checked in with CBS sources and a trustworthy insider has relayed the story that has been circulated about supposed drama and tensions tearing the show apart is completely fake news. The stars are not battling over paychecks and in fact, made news when the top paid actors took pay cuts so that two cast members, co-stars Mayim Bialik and Melissa Rauch, could receive raises.\n\nNot only is there no drama behind the scenes, but the ratings are in for the 2018 premiere, and the Big Bang Theory remains to be CBS’ powerhouse sitcom, as Variety corroborates. The publication indicates that viewer numbers have skyrocketed from 16 million to 21 million as of late, and has a 5.0 rating, which is up from 3.1 in the 18-49 age group.\n\nThe massively successful sitcom would not have endured over the years if the rumored high tensions and drama were fact. Cast members clearly work well together and are set to continue bringing viewers hilarious and clever episodes weekly.", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2018/01/Big-Bang-Theory-Drama.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://secure.gravatar.com/avatar/784fcf0a3514f31a582147119c01ff3d?s=250&d=mm&r=g", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Jessica Dafoe"], "canonical_link": "https://www.inquisitr.com/4750778/big-bang-theory-drama-behind-the-scenes-not-causing-show-to-fall-apart-debunked/", "title": "‘Big Bang Theory’: Drama Behind The Scenes Not Causing Show To ‘Fall Apart’ [Debunked]", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}