{"url": "https://www.cbsnews.com/news/bill-cosby-trial-topless-protester-charges-towards-comedian-as-retrial-begins/", "text": "MONTGOMERY COUNTY, Pa. -- A topless protester with \"Women's Lives Matter\" written on her body jumped a barricade and got within a few feet of Bill Cosby on Monday as the comedian walked into a suburban Philadelphia courthouse for the start of his sexual assault retrial. The woman, who was later identified as an actress that appeared on several episodes of \"The Cosby Show,\" ran in front of the 80-year-old comedian Monday but was intercepted by sheriff's deputies.\n\nCosby seemed startled by the commotion as protesters chanted at him, but he was not touched and is uninjured.\n\nHe was led into the courthouse after the woman was led away in handcuffs.\n\nA protester is detained after Bill Cosby arrives for his sexual assault trial at the Montgomery County Courthouse, Monday, April 9, 2018, in Norristown, Pa. Corey Perrine / AP\n\nThe district attorney's office later identified the woman as Nicolle Rochelle, 39, of Little Falls, N.J. The office says she entered a restricted area outside the courthouse. She was charged with disorderly conduct.\n\nRochelle is listed online as a New Jersey-based actress who appeared on four episodes of the Cosby show between 1990 and 1992.\n\nThe European feminist group Femen claimed Rochelle as one of its own and said she aimed to call attention to sexual violence and the need to hold perpetrators responsible.\n\nFemen leader Inna Shevchenko told The Associated Press the activist was seeking to defend Cosby's alleged victims. She said it's the group's \"contribution to the global revolt launched by #MeToo.\"\n\nThe Femen movement started in Ukraine in 2009 and has spread to multiple countries, staging unauthorized topless protests against religious institutions, far-right politicians and other targets seen as oppressing women.\n\nCosby spokesman Andrew Wyatt praised the deputies for stopping the protester. But he says more is needed to ensure Cosby's safety, telling The Associated Press, \"You never know who's going to want to make a name for themselves.\"\n\nThe protester was among about a half dozen people chanting in support of Cosby's accuser. She had \"Women's Lives Matter\" written in red ink on her chest and stomach along with other phrases in black and red all over her body.\n\nThe disruption came ahead of opening statements, which were delayed while the judge sorted through allegations raised late Friday that a juror told a woman during jury selection that he thought Cosby was guilty. Cosby's lawyers want the juror removed from the case.\n\nProsecutors have lined up a parade of accusers to make the case that the man revered as \"America's Dad\" lived a double life as one of Hollywood's biggest predators.\n\nCosby is fighting back with a new, high-profile lawyer and an aggressive strategy: attacking Andrea Constand as a greedy liar and casting the other women testifying as bandwagon accusers looking for a share of the spotlight.\n\n\"You've seen previews and coming attractions, but things have changed,\" said professor Laurie Levenson of Loyola Law School in Los Angeles.\n\nCosby's first trial last spring ended with jurors unable to reach a unanimous verdict after five days of tense deliberations on charges that the man who made millions of viewers laugh as wise and understanding Dr. Cliff Huxtable on \"The Cosby Show\" drugged and molested Constand at his suburban Philadelphia home in 2004.\n\nThe 80-year-old comedian, who has said the sexual contact was consensual, faces three counts of aggravated indecent assault, each punishable by up to 10 years in prison.\n\nBill Cosby returns to court for 2nd sexual assault trial\n\nHis retrial is taking place in a radically changed and potentially more hostile environment. The #MeToo movement caught fire four months after the first trial, raising awareness of sexual misconduct as it toppled Harvey Weinstein, Sen. Al Franken, Matt Lauer and other powerful men.\n\nNearly every potential juror questioned for the case this time knew about #MeToo.\n\nKristen Houser of the National Sexual Violence Resource Center said that could help prosecutors overcome the skepticism some jurors had last time about Constand's yearlong wait to report her allegations to the police.\n\n\"The #MeToo movement is amplifying what experts have been saying for decades: People are ashamed, they're confused, they can't believe somebody they trust would hurt them, and then they worry that others won't believe them,\" Houser said.\n\nAfter limiting the focus of the first trial, Judge Steven O'Neill has been willing to let both sides push the retrial well beyond Constand's allegations.\n\nThis time, O'Neill is letting prosecutors have five additional accusers testify - including model Janice Dickinson. The judge allowed just one other accuser to take the stand last time.\n\n\"This one will be harder for the defense,\" Levenson said. This time, Constand \"is not alone, and there is strength in numbers.\"\n\nCBS News legal analyst Rikki Klieman said \"the trial completely changes\" in light of the #MeToo movement. The voices of five women rather than one could also help prosecutors in their attempt to show that Cosby had an \"M.O.\" of drugging and raping women, Klieman said.\n\nIn another difference, the judge this time is letting Cosby's legal team call as a witness a former co-worker of Constand's at Temple University who said Constand spoke of setting up a \"high-profile person\" so she could sue and enjoy a big payday. Constand's lawyer has said the co-worker is lying.\n\nHow will Bill Cosby's retrial be different because of #MeToo?\n\nThe judge also decided the jury can hear the answer to one of the biggest questions hanging over the case: How much did Cosby pay Constand to settle her lawsuit against him more than a decade ago? The two sides agreed at the first trial not to mention the lawsuit.\n\nCosby lawyer Tom Mesereau, who won an acquittal in Michael Jackson's 2005 child molestation case, said the jury will learn \"just how greedy\" Constand was.\n\nIn a twist, the judge hinted that he might not allow jurors to hear Cosby's lurid deposition testimony about giving quaaludes to women before sex. He said he would rule on it during the trial. Cosby testified in 2005 and 2006 as part of Constand's lawsuit.\n\nThe Associated Press does not typically identify people who say they are victims of sexual assault unless they grant permission, which Constand and Dickinson have done.", "images": ["https://cbsnews1.cbsistatic.com/hub/i/r/2019/11/19/186936ea-2db7-4a48-b750-74f38f653dc6/thumbnail/640x360/80fb8996993802606d5c971761bf5b42/newsletter-breakingnews.jpg", "https://cbsnews1.cbsistatic.com/hub/i/2018/04/09/0d7c9ff4-d802-4dee-8268-142e1aafc97c/protester.jpg", "https://cbsnews2.cbsistatic.com/hub/i/r/2018/04/09/0d7c9ff4-d802-4dee-8268-142e1aafc97c/thumbnail/1200x630/1347bc291714e24b18d7c30b22090da6/protester.jpg", "https://cbsnews3.cbsistatic.com/hub/i/r/2018/04/09/0d7c9ff4-d802-4dee-8268-142e1aafc97c/thumbnail/620x426/a2260f4ebbac5a678c9d825874e5d705/protester.jpg"], "top_img": "https://cbsnews2.cbsistatic.com/hub/i/r/2018/04/09/0d7c9ff4-d802-4dee-8268-142e1aafc97c/thumbnail/1200x630/1347bc291714e24b18d7c30b22090da6/protester.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.cbsnews.com/news/bill-cosby-trial-topless-protester-charges-towards-comedian-as-retrial-begins/", "title": "Bill Cosby trial: Topless protester charges towards comedian as retrial begins", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1, user-scalable=0", "robots": "index, follow", "description": "The disruption came ahead of opening statements in the 80-year-old comedian&#039; sexual assault retrial in Pennsylvania", "keywords": "Topless protester, bill cosby, sexual assault retrial, Rikki Klieman", "news_keywords": "Topless protester, bill cosby, sexual assault retrial, Rikki Klieman", "al": {"web": {"url": "https://www.cbsnews.com/news/bill-cosby-trial-topless-protester-charges-towards-comedian-as-retrial-begins/"}, "ios": {"app_name": "CBS News", "app_store_id": 334256223, "url": "cbsnewsapp://cbsnews.com/news/bill-cosby-trial-topless-protester-charges-towards-comedian-as-retrial-begins/"}, "android": {"app_name": "CBS News", "package": "com.treemolabs.apps.cbsnews"}}, "og": {"type": "article", "url": "https://www.cbsnews.com/news/bill-cosby-trial-topless-protester-charges-towards-comedian-as-retrial-begins/", "title": "Bill Cosby trial: Topless protester charges towards comedian as retrial begins", "description": "The disruption came ahead of opening statements in the 80-year-old comedian' sexual assault retrial in Pennsylvania", "image": {"identifier": "https://cbsnews2.cbsistatic.com/hub/i/r/2018/04/09/0d7c9ff4-d802-4dee-8268-142e1aafc97c/thumbnail/1200x630/1347bc291714e24b18d7c30b22090da6/protester.jpg", "width": 1200, "height": 630}, "video": {"url": "https://public.vilynx.com/direct/8fc31712de713e0c34c55c4bce033614/317d6ae4-1c74-4499-8d3c-4b7f5a795eb1/pro69.viwindow.mp4", "secure_url": "https://public.vilynx.com/direct/8fc31712de713e0c34c55c4bce033614/317d6ae4-1c74-4499-8d3c-4b7f5a795eb1/pro69.viwindow.mp4", "type": "video/mp4", "width": 1920, "height": 1080}}, "fb": {"app_id": 1536620209892267, "pages": 131459315949}, "article": {"publisher": "https://www.facebook.com/CBSNews", "content_tier": "free", "opinion": "false"}, "twitter": {"dnt": "on", "app": {"country": "US", "name": {"iphone": "CBS News", "ipad": "CBS News", "googleplay": "CBS News"}, "id": {"iphone": 334256223, "ipad": 334256223, "googleplay": "com.treemolabs.apps.cbsnews"}, "url": {"iphone": "cbsnewsapp://cbsnews.com/news/bill-cosby-trial-topless-protester-charges-towards-comedian-as-retrial-begins/", "ipad": "cbsnewsapp://cbsnews.com/news/bill-cosby-trial-topless-protester-charges-towards-comedian-as-retrial-begins/", "googleplay": "cbsnewsapp://cbsnews.com/news/bill-cosby-trial-topless-protester-charges-towards-comedian-as-retrial-begins/"}}, "site": "@CBSNews", "title": "Bill Cosby trial: Topless protester charges towards comedian as retrial begins", "description": "The disruption came ahead of opening statements in the 80-year-old comedian' sexual assault retrial in Pennsylvania", "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2018/04/09/0d7c9ff4-d802-4dee-8268-142e1aafc97c/thumbnail/1200x630/1347bc291714e24b18d7c30b22090da6/protester.jpg", "card": "summary_large_image"}, "theme-color": "#101010", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "CBS News", "apple-mobile-web-app-status-bar-style": "black"}, "movies": [], "publish_date": null, "source": "https://www.cbsnews.com", "summary": ""}