{"url": "https://www.thecut.com/2018/07/meghan-markle-prince-harry-louis-christening.html", "text": "Meghan Markle and Prince Harry. Photo: Dominic Lipinski/AP\n\nOn Monday, the British royal family reported for duty at a St. James’s Palace chapel in London. Many of them (minus Queen Elizabeth and Prince Philip) were on hand to witness/support/just live around the baptism of Prince Louis, the 2-month-old son of Prince William and Kate Middleton. But also in attendance were two royals who showed up looking so sleek, so stylish, so incredibly attractive, we couldn’t help but think: Damn, they look like a cool aunt and uncle. Yes, we’re talking about Meghan Markle and Prince Harry.\n\nWhen Meghan married Prince Harry in a very royal wedding back in May, she not only acquired a new royal life, new royal title, new royal blog-inspired coat of arms, and, perhaps most importantly, new royal wardrobe budget — but she also got a new royal niece (Princess Charlotte) and two royal nephews (Prince George and Prince Louis, who at the time was a brand-spanking-new baby).\n\nSo now, she’s not just, Duchess Meghan of Sussex and Suits and California; she’s also Aunt “Meg,” while Prince Harry is presumably known as Uncle Harry. And at Prince Louis’s very fancy royal christening, Aunt Meg — clad in a green, boatneck ensemble by American designer Ralph Lauren and a hat by Stephen Jones — and Uncle Harry looked every part the cool-sibling-and-sibling-in-law-of-your-parent-who-are-nice-and-cool-to-you.\n\nLots to giggle about with the Archbishop of Canterbury for the Duke and Duchess of Sussex after he officiated at their wedding. pic.twitter.com/HsX2Xm1pXj — Rebecca English (@RE_DailyMail) July 9, 2018\n\nCan’t you just imagine them taking their niece and nephews out to shows (at a palace, probably) and letting them eat dessert (well, healthy dessert) at times when Kate and Prince William won’t? I assume the young princes and princess will feel comfortable talking shit about their parents to their dear Aunt Meg when they’re teens, and they’ll all have a ton of fun joking around with Uncle Harry, who is very similar to a child in many ways.\n\nAnd luckily, if the kids ever get to the point where they want to run away to Aunt Meg and Uncle Harry’s house, they all live in the same palace anyway. How nice!", "images": ["https://pyxis.nymag.com/v1/imgs/d25/4d4/bf58909fe9a6362fb53b580910ff23ecdb-09-meghan-harry.1x.rsocial.w1200.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/07/09/09-meghan-harry.w330.h412.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pyxis.nymag.com/v1/imgs/d25/4d4/bf58909fe9a6362fb53b580910ff23ecdb-09-meghan-harry.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Lisa Ryan"], "canonical_link": "https://www.thecut.com/2018/07/meghan-markle-prince-harry-louis-christening.html", "title": "Meghan Markle and Prince Harry Look Like a Cool Aunt and Uncle", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Meghan Markle and Prince Harry Look Like a Cool Aunt and Uncle", "url": "https://www.thecut.com/2018/07/meghan-markle-prince-harry-louis-christening.html", "description": "They looked great at Prince Louis’s christening.", "image": "https://pyxis.nymag.com/v1/imgs/d25/4d4/bf58909fe9a6362fb53b580910ff23ecdb-09-meghan-harry.1x.rsocial.w1200.jpg", "site_name": "The Cut", "type": "article"}, "twitter": {"title": "Meghan Markle, Prince Harry Look Like a Cool Aunt and Uncle", "description": "They looked great at Prince Louis’s christening.", "image": "https://pyxis.nymag.com/v1/imgs/d25/4d4/bf58909fe9a6362fb53b580910ff23ecdb-09-meghan-harry.2x.rsocial.w600.jpg", "card": "summary_large_image", "creator": "@lisarya", "site": "@TheCut"}, "article": {"published_time": "2018-07-09T13:35:56.371-04:00", "tag": "keeping up with the royals, meghan markle, prince harry, prince louis, culture, celebrity", "publisher": "https://www.facebook.com/cut"}, "description": "Meghan Markle and Prince Harry attended Prince Louis’s christening on Monday, where they looked every part the cool aunt and uncle.", "sailthru.tags": "keeping up with the royals, meghan markle, prince harry, prince louis, culture, celebrity", "author": "Lisa Ryan", "fb": {"app_id": 343556435754245}, "type": "Article", "vertical": "The Cut", "apple-mobile-web-app-title": "The Cut", "application-name": "The Cut", "msapplication-TileColor": "#ff5656", "msapplication-TileImage": "https://assets.nymag.com/media/sites/thecut/icon.144x144.png"}, "movies": [], "publish_date": 1531157756.371, "source": "https://www.thecut.com", "summary": ""}