{"url": "http://uk.businessinsider.com/jumanji-sequel-robin-williams-2017-12", "text": "Warning: Spoilers ahead for \"Jumanji: Welcome to the Jungle.\"\n\n\"Jumanji: Welcome to the Jungle\" (starring Dwayne \"The Rock Johnson,\" Kevin Hart, and Nick Jonas) is a wild and surprisingly not terrible sequel to Robin Williams' 1995 movie about a sentient board game.\n\n\"Welcome to the Jungle\" pays tribute to Williams, who committed suicide in 2014, by mentioning his original \"Jumanji\" character Alan Parrish.\n\nIn case you've forgotten, the original \"Jumanji\" opens by showing a pair of kids in the 1800s burying a mysterious chest in the forest of Brantford, New Hampshire. Then we jump to 1969, where the young Alan Parrish finds the chest and opens it to reveal a board game called Jumanji.\n\n\"A game for those who seek to find a way to leave their world behind.\" TriStar\n\nAlan and his friend Sarah play the game together, and Alan is literally sucked inside the game after he rolls a five. The game says, \"In the jungle you must wait until the dice read five or eight.\"\n\nSarah is rightfully terrified after witnessing this supernatural phenomenon (and being attacked by bats immediately afterwards), so she runs away and never attempts to keep playing the game. The meant Alan was trapped inside Jumanji for 26 years, until a new pair of kids find the game and begin playing in 1995.\n\nAlan Parrish is a grown man when he returns to finish the game. TriStar\n\nWhen one of them rolls a five or eight, Alan returns to the real world and we realize he's been living in the Jumanji jungle the whole time. After he and the kids (and adult-Sarah) finally finish their game of Jumanji, Alan is transported back to 1969 and becomes a kid again.\n\nHow the \"Jumanji\" sequel nods to Alan Parrish\n\nSo, cut to \"Welcome to the Jungle.\" The new sequel opens with a man finding the Jumanji board game washed up on a beach in 1996. Apparently this beach is also near Brantford, New Hampshire, because the house the man lives in is near a Brantford High School.\n\nThe man gives the board game to his teenage son Alex — a metalhead kid who loves video games. Alex dismisses the game, saying \"Who plays board games anymore?\"\n\nThe only snippet you see of Alex in the trailer. Sony Pictures\n\nJumanji, being the sentient device that it is, apparently hears Alex's scoff and decides it needs to adapt. Overnight, the board game magically produces a video game console and cartridge. Using the telltale drum sounds, the game wakes up Alex.\n\nHe finds the cartridge and decides to play. Upon choosing his avatar, Alex gets sucked into the game — just like Alan Parrish all those years ago.\n\n\"Welcome to the Jungle\" then jumps to 2017, where a group of high schoolers in detention find the Jumanji console and plug it in. They all get sucked into the game too, and eventually run into Alex.\n\nAlex is unrecognizable, because the game transformed him into the avatar he chose — Jefferson Seaplane McDonough. He looks like Nick Jonas instead of the metalhead teen we saw in the '90s.\n\nNick Jonas as Jefferson Seaplane McDonough. Sony Pictures\n\nUnlike Robin Williams' Alan Parrish, Alex seems unaware that a significant amount of time has passed. He thinks he's been in Jumanji for several weeks, when really it's been about 20 years.\n\nAlex takes the rest of the characters to the treehouse where he's been staying. Scratched onto a wooden post is the simple note: \"Alan Parrish was here.\"\n\nWhen asked about the name, Alex says it must be the name of the person who built his hideout. Alan's handiwork keps Alex alive by providing shelter.\n\nA view of the treehouse Alan built during his stint in Jumanji. Sony Pictures\n\nThis small mention of the name Alan Parrish is the only connection \"Welcome to the Jungle\" makes to the original \"Jumanji.\" Virtually everything else about the movie stands on its own with no context needed from the 1995 movie.\n\nAlex/Jefferson Seaplane helps the rest of the teens (disguised as their own avatars) navigate the jungle of Jumanji. We won't spoil all the fun for you, though. You'll have to see \"Welcome to the Jungle\" to learn how their story ends.\n\n\"Jumanji: Welcome to the Jungle\" is in theaters now. For our spoiler-free thoughts on the movie, read our full review here.", "images": ["https://i.insider.com/5a3a896b7101ad4de00e13ec?width=1200&format=jpeg", "https://i.insider.com/5a3a896c7101ad4de00e13ef?width=600&format=jpeg&auto=webp", "https://i.insider.com/5a3a896c7101ad4de00e13f1?width=600&format=jpeg&auto=webp", "https://i.insider.com/5a3a896c7101ad4de00e13f0?width=600&format=jpeg&auto=webp", "https://i.insider.com/5a3a896c7101ad4de00e13f2?width=600&format=jpeg&auto=webp", "https://static3.businessinsider.com/assets/images/careerbuilder.png", "http://uk.businessinsider.com/jumanji-sequel-robin-williams-2017-12?width=600&format=jpeg&auto=webp", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1 1'%3E%3C/svg%3E", "https://i.insider.com/5a3a896b7101ad4de00e13ed?width=600&format=jpeg&auto=webp", "https://i.insider.com/5a3a896b7101ad4de00e13ed?width=24&format=jpeg&auto=webp", "https://i.insider.com/5a3a896b7101ad4de00e13ee?width=600&format=jpeg&auto=webp"], "top_img": "https://i.insider.com/5a3a896b7101ad4de00e13ec?width=1200&format=jpeg", "keywords": [], "authors": ["Kim Renfro"], "canonical_link": "https://www.insider.com/jumanji-sequel-robin-williams-2017-12", "title": "How the new 'Jumanji' sequel pays homage to Robin Williams' character", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "How the new 'Jumanji' sequel pays homage to Robin Williams' character", "date": "2017-12-20", "news_keywords": "Jumanji, Welcome to the Jungle, Movies, Robin Williams, Nick Jonas, Kim Renfro", "description": "\"Jumanji: Welcome to the Jungle\" is the sequel to 1995's \"Jumanji.\" Here's how The Rock and Nick Jonas' characters tie into Robin Williams' Alan Parrish.", "author": "Kim Renfro", "article": {"publisher": "businessinsider", "content_tier": "free", "opinion": "false"}, "tbi-vertical": "Insider", "og": {"title": "How the new 'Jumanji' sequel pays homage to Robin Williams' character", "description": "\"Jumanji: Welcome to the Jungle\" is the sequel to 1995's \"Jumanji.\" Here's how The Rock and Nick Jonas' characters tie into Robin Williams' Alan Parrish.", "type": "article", "url": "https://www.businessinsider.com/jumanji-sequel-robin-williams-2017-12", "image": "https://i.insider.com/5a3a896b7101ad4de00e13ec?width=1200&format=jpeg", "site_name": "Business Insider"}, "sailthru.title": "How the new 'Jumanji' sequel pays homage to Robin Williams' character", "sailthru.date": "2017-12-20", "sailthru.tags": "Jumanji, Welcome to the Jungle, Movies, Robin Williams, Nick Jonas, Kim Renfro", "sailthru.description": "\"Jumanji: Welcome to the Jungle\" is the sequel to 1995's \"Jumanji.\" Here's how The Rock and Nick Jonas' characters tie into Robin Williams' Alan Parrish.", "sailthru.author": "Kim Renfro", "sailthru.verticals": "insider", "sailthru.image.full": "https://i.insider.com/5a3a896b7101ad4de00e13eb?width=1200&format=jpeg", "sailthru.image.thumb": "https://i.insider.com/5a3a896b7101ad4de00e13eb?width=160&format=jpeg", "twitter": {"card": "summary_large_image"}, "fb": {"pages": 20446254070}, "apple-itunes-app": "app-id=554260576", "linkedin": {"owner": "mid:1d5f7b"}, "ii-ab-test": {"mobile-sticky": "variant", "pfi-wider-content": "control", "back-to-top": "control", "sticky-section-titles": "control", "post-breadcrumbs": "variant", "tabbed-homepage": "variant", "expanded-coverage-module": "variant", "subscribe-smallest-price": "control"}, "viking-id": "5a3a896d7101ad4de00e13f3", "env": "prod", "msapplication-config": "//www.businessinsider.com/public/assets/BI/US/favicons/browserconfig.xml?12-31-19", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1513699200.0, "source": "http://uk.businessinsider.com", "summary": ""}