{"url": "https://en.wikipedia.org/wiki/Descendants_3", "text": "2019 Disney Channel Original Movie directed by Kenny Ortega\n\nDescendants 3 is an American musical fantasy[1][2] television film, which is the third installment in the Descendants series, following Descendants and Descendants 2. It is written by Sara Parriott and Josann McGibbon, and is directed by Kenny Ortega. The film premiered on Disney Channel on August 2, 2019, and in other parts of the world on October 12, 2019.\n\nPlot [ edit ]\n\nMal, Evie, Jay, and Carlos visit the Isle of the Lost to choose four new villain's kids (VKs) to take to Auradon. They pick Dizzy, daughter of Drizella and granddaughter of Lady Tremaine, Celia, daughter of Dr. Facilier, and Squeaky and Squirmy, the twin sons of Mr. Smee. The day the kids are to be picked up, Ben, Mal's boyfriend and the king of Auradon, proposes to her. She accepts; Ben's ex-girlfriend Audrey seethes with jealousy and her grandmother Queen Leah admonishes her for failing to secure the family legacy by marrying Ben.\n\nWhen the barrier is opened for the new VKs, Hades, the god of the underworld, attempts to escape, but Mal beats him back in her dragon form. That night, unable to contain her jealousy of Mal, Audrey steals the Queen's Crown and Maleficent's Scepter from The Museum of Cultural History. The theft and Hades' escape attempt has the citizens panicking. Mal, as future Queen, decides the best way to protect the subjects and restore peace is to close the barrier permanently, meaning no new VKs can come, nor can anyone enter the Isle.\n\nAudrey attacks Mal with Maleficent's scepter, turning her into an old hag. Mal and the other VKs go to the Isle to get Hades' ember, the only thing powerful enough to break the scepter's curse. Mal is restored upon entering the Isle due to the suppression of evil magic there. Celia gets Mal into Hades' lair, but he thwarts their effort to steal the ember. He is revealed to be Mal's absentee father and reluctantly gives her the ember, warning her that it mustn't get wet and will not exhibit its full powers for her. While leaving the Isle, Mal and the others are stopped by Uma, Gil, and Harry, who take the Ember; they agree to help after Mal agrees to release all the children from the Isle.\n\nIn Auradon, Audrey attacks Jane's birthday party with a sleeping curse; Chad obsequiously aligns himself with Audrey, while Jane escapes into the Enchanted Lake. As the entire kingdom falls under Audrey's spell, she offers to reverse it if Ben will marry her; he refuses, so she turns him into a beast and begins turning people to stone. Mal and Uma, vying for leadership of the VKs, return to Auradon with their friends. Despite their bickering, they defeat suits of armor animated by Audrey. Uma finds Audrey's diary and learns that she spends time at Fairy Cottage, a contribution for which Mal thanks her. Evie, nervous to define her feelings for Doug, wakes him with \"true love's kiss.\" Carlos calms Ben, in beast form, until Jane restores him with lake water. As Mal and Uma are thawing towards each other, Audrey traps them in Evie's house; they reverse Audrey's spell by combining their magic, and they all reunite there.\n\nAt the Fairy Cottage, they find only a shell-shocked Chad. When Mal admits that she plans to seal off the Isle permanently, the group implodes and Celia, learning she can never see her father again, throws the ember in a birdbath and Uma and Harry leave. After Evie tells Mal how upset she is for lying to her and their friends, they are all suddenly turned to stone, except for Mal. Audrey takes Celia hostage and attacks Mal, who turns into her dragon form. Realizing she is Mal's only hope, Uma combines their magic to reignite the ember; Mal overcomes Audrey, who falls comatose, and the curses are lifted. The ember could revive Audrey, but only in Hades' hands; Ben agrees to send for him, while Uma, Harry, Gil, and Celia plan to return to the Isle. Mal apologizes for lying; her friends and former rivals forgive her as they understood that she was just trying to do the right thing. Hades arrives and revives Audrey, but decries the double standard by which Audrey is immediately forgiven because she is not considered a villain. Mal and Ben apologize to Audrey; in response, Audrey and Queen Leah apologize to Mal.\n\nMal announces that she cannot be the Queen of Auradon unless she can also be the Queen of the Isle because everyone is capable of being good and bad. With Ben and the Fairy Godmother's agreement, Mal removes the barrier and creates a bridge, and the people of the newly merged society celebrate. Also, Jane and Carlos become official, Mal and Ben are engaged, and Audrey has eyes for Harry (after Uma rejects him).\n\nIn the mid-credits scene, Mal, Evie, Jay, and Carlos are seen looking at the Isle of the Lost; then racing across the bridge to their parents.\n\nCast [ edit ]\n\nAdditionally, Judith Maxie reprises her role as Queen Leah, Princess Audrey's grandmother, from the first Descendants film.[10] Christian Convery and Luke Roessler play Squeaky and Squirmy, respectively, the twin sons of Mr. Smee.[6][10] Also appearing are Jamal Sims as Celia's father Dr. Facilier,[7][8] Linda Ko as Dizzy's grandmother Lady Tremaine, and Faustino Di Bauda as Squeaky's and Squirmy's father Mr. Smee.\n\nProduction [ edit ]\n\nOn February 16, 2018, Disney Channel announced the production of Descendants 3, which Disney scheduled to air in mid-2019.[11] Descendants 3 is written and produced by Sara Parriott and Josann McGibbon, and is directed and executive produced by Kenny Ortega.[3] Wendy Japhet is a producer on the film,[5] with Ortega, Sara Parriott, Josann McGibbon, and Japhet also serving as executive producers.[6] Mark Hofeling and Kara Saun return as production designer and costume designer on the sequel, respectively.[5] In addition to playing Dr. Facilier, Jamal Sims also serves as the film's choreographer,[7][8] along with Ortega who has served as choreographer for all three Descendants films.[3]\n\nRehearsals and pre-recording on the film began on April 23, 2018, in Vancouver, British Columbia, Canada.[5] Production began on May 25, 2018.[12] On July 18, 2018, it was reported on social media that production on the film had \"officially wrapped\".[13]\n\nIt has been reported that this will be the last film in the Descendants film series.[14]\n\nRelease [ edit ]\n\nSome promotional footage for the film was released on the Disney Descendants YouTube channel in February 2018 as a teaser or first look into the production.[15] In late May 2019, it was announced that the film would premiere on August 2, 2019.[16][3][17]\n\nA related short film, Under the Sea: A Descendants Short Story, which features Mal and Uma facing off in \"an epic underwater showdown\", was released on September 28, 2018.[18][19]\n\nOn July 11, 2019, Disney announced it was canceling a red carpet premiere originally planned for July 22, 2019, in the wake of Cameron Boyce's death. The film's television premiere went on as scheduled, dedicated to Boyce's memory.[20]\n\nReception [ edit ]\n\nDescendants 3 was watched by 4.59 million viewers on its August 2, 2019 premiere,[21] with viewership increasing to 8.43 million viewers after three days of delayed viewing.[22] The film currently has a 78% approval rating on Rotten Tomatoes based on 9 reviews.[23]\n\nSoundtrack [ edit ]\n\nDescendants 3\n\n(Original TV Movie Soundtrack) Soundtrack album by Descendants cast cast Released August 2, 2019 Recorded April—May 2018 Genre Pop Label Walt Disney Descendants soundtracks chronology Descendants 2\n\n(2017) Descendants 3\n\n(Original TV Movie Soundtrack)\n\n(2019) Singles from Descendants 3\n\nReleased: May 31, 2019\n\nReleased: July 19, 2019\n\nReleased: August 2, 2019\n\nDescendants 3 (Original TV Movie Soundtrack) is the soundtrack accompanying the film of the same name. The soundtrack and lead single, \"Good to Be Bad\", was released on May 31, 2019, along with the pre-order of the soundtrack. The soundtrack was released on August 2, 2019. It reached number 7 on the Billboard 200 album chart,[24] and number 1 on the Billboard Kid Albums chart.[25]\n\nTrack listing [ edit ]\n\nNotes\n\n\"VK Mashup\" contains samples of \"Rotten to the Core\", \"Ways to Be Wicked\", and \"Good to be Bad\", from the first, second and third soundtracks.\n\nChart performance [ edit ]\n\nThe album debuted at number 7 on the Billboard 200,[26] and in its second week the album dropped to number 14.[27]\n\nThe single \"Queen of Mean\" reached number 49 on the Billboard Hot 100,[28] number 57 on the Canadian Hot 100,[29] and number 89 on the UK Singles Chart.[30]\n\nCharts [ edit ]\n\nHome media [ edit ]\n\nDescendants 3 was released on DVD on August 6, 2019.[39]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/b/bd/Descendants_3%2C_poster.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/b/bd/Descendants_3%2C_poster.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Descendants_3", "title": "Descendants 3", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/b/bd/Descendants_3%2C_poster.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}