{"url": "https://en.wikipedia.org/wiki/Slow_Hands_(Niall_Horan_song)", "text": "\"Slow Hands\" is a song recorded by Irish singer and songwriter Niall Horan, released as a single on 4 May 2017 by Capitol Records.[2] The song was written by Horan, Alexander Izquierdo, John Ryan, Julian Bunetta, Ruth Anne Cunningham and Tobias Jesso Jr., while the production was handled by Bunetta.[3] It was serviced to US contemporary hit radio on 9 May 2017[4] as the second single from Horan's debut solo album Flicker (2017).\n\n\"Slow Hands\" peaked at number seven on the UK Singles Chart and number eleven on the Billboard Hot 100, becoming Horan's highest-charting single in those countries.\n\nBackground and composition [ edit ]\n\nPrior to its release, Horan discussed the song in an interview with Mikey Piff on Sirius XM. The singer said that after listening to some of the material he had recorded for his debut album, he wanted to add \"a bit more grit, funk and heavier bass.\" At the time he was listening to late 1970s and early 1980s music. \"When Don Henley went solo in the early eighties, he just kinda had this funky kind of feel to it – heavy bass, heavy guitar – so I just thought, 'Let's give this a crack,'\" Horan said of making the track. \"I wanted it to be a little bit cheeky with the lyric.\" About the concept, he explained it is set in a bar and the song's theme changes up stereotypical roles. \"The first line is...'we should take this back to my place' – and usually that's what the guy would say, but we flipped it that the girl would say that, and that's what she said right to my face.\"[5][6]\n\n\"Slow Hands\" is a bass-heavy funk-pop, pop and folk-pop song, with Horan singing in a lower register.[5][7][8][9] A Billboard writer described it as an \"R&B-inflected rock tune.\"[10] It is written in the key of C major at a tempo of 88 beats per minute.[11]\n\nCritical reception [ edit ]\n\nIn Billboard, Taylor Weatherby noted \"Slow Hands\" focuses on a \"funkier guitar vibe\", compared to Horan's previous single \"This Town.\" She also opined \"the subtly-sexy song\" shows an \"edgier side of Niall.\"[12] Colin Stutz from the publication, added, \"The combination of a thumping beat and Horan's raspy vocals makes the song hardly even sound like the same guy who sang [\"This Town\"]. But what \"Slow Hands\" shows is that Horan definitely won't just be sticking to the sweet singer-songwriter sound on his solo debut.\"[6] Rolling Stone's Althea Legaspi also noted Horan \"goes for a more muted sound. Above a stomp-and-clap beat and muted guitar, Horan allows his lower register to showcase his more seductive side on the track.\"[5]\n\nIn The Irish Times, Jennifer Gannon wrote that \"it’s no radical departure, Niall hasn’t decided to go Gaga but it’s a step in a more Sheeran-style, crowd-pleasing direction. A gentle, foot-stomper about a lady with a magic touch, a lady who knows what she wants, she wants to get her hands all over Niall's \"dirty laundry\" and not in a bringing your washing home on a Sunday way. This isn't Timberlake's Sexy Back, it's Horan's Sweaty Back.\"[13]\n\nBillboard's critics' list placed it second on \"Every One Direction Solo Single, Ranked\" in May 2017, stating that the \"secret\" highlight \"[is] the way Niall's vocal on the first verse is ever so discretely chopped on the recording to a clipped staccato, a mysterious move that forces the singer into a less-is-more delivery that ends up being much more indeed.\"[14]\n\nChart performance [ edit ]\n\n\"Slow Hands\" charted within the top 10 in the charts of Australia, Ireland, New Zealand, and the United Kingdom. The single became his second top 20 entry as a solo artist on the US Billboard Hot 100, reaching number 11 and surpassing his preceding single \"This Town\", which reached number 20. On 15 September 2017, the single was certified Platinum for combined sales and streaming equivalent units of over a million units in the United States. On the chart dated 7 October 2017, the single reached number one on the Mainstream Top 40 chart.[15] As of December 2017, it has sold one million copies in the US.[16]\n\nLive performances [ edit ]\n\nHoran has performed \"Slow Hands\" on The Ellen DeGeneres Show and The Tonight Show Starring Jimmy Fallon.[17][18] On 29 May 2017, the singer performed \"Slow Hands\", \"This Town\" and premiered the track \"On the Loose\" on The Today Show.[19] On 4 June 2017, Horan performed the song during the One Love Manchester benefit concert for the victims of the 2017 Manchester Arena bombing.[20] On 5 June he performed on BBC One's The One Show.[21] The singer also performed \"Slow Hands\" at the Capital FM's Summertime Ball 2017.[22]\n\nOn 22 June 2018, Horan performed the song with American singer-songwriter Taylor Swift, at the first London show of her Reputation Stadium Tour at Wembley Stadium, as a surprise guest.\n\nTrack listings [ edit ]\n\nDigital download[23]\n\n\"Slow Hands\" – 3:07\n\nDigital download (Acoustic) [24]\n\n\"Slow Hands\" (Acoustic) – 2:40\n\n\"Slow Hands\" (Jay Pryor remix) – 2:40\n\nDigital download (Basic Tape remix) [26]\n\n\"Slow Hands\" (Basic Tape remix) – 3:02\n\nCharts [ edit ]\n\nCertifications [ edit ]\n\nRelease history [ edit ]\n\nRegion Date Format Version Label Ref. Various 4 May 2017 Digital download Original Capitol [23] 23 June 2017 Acoustic [24] Jay Pryor remix [25] Basic Tape remix [26] United States 9 May 2017 Contemporary hit radio Original [4] Italy 12 May 2017 Warner [92]\n\nSee also [ edit ]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Don_Henley_%282088057840%29.jpg/150px-Don_Henley_%282088057840%29.jpg", "https://upload.wikimedia.org/wikipedia/en/4/45/Slow_Hands_-_Niall_Horan.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/45/Slow_Hands_-_Niall_Horan.jpg/220px-Slow_Hands_-_Niall_Horan.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/4/45/Slow_Hands_-_Niall_Horan.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Slow_Hands_(Niall_Horan_song)", "title": "Slow Hands (Niall Horan song)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/4/45/Slow_Hands_-_Niall_Horan.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}