{"url": "https://www.bustle.com/p/did-drake-hint-at-a-bella-hadid-romance-on-scorpion-one-track-has-people-speculating-9632839", "text": "Ever since Scorpion was released, fans have been trying to figure out what some of Drake's lyrics mean in his many new tracks. Well, one song in particular has some wondering about a romance with a famous model. As E! News noted, Drake may hint at a romance with Bella Hadid in the song, \"Finesse.\" While neither party has confirmed anything regarding any relationship rumors, the rapper's lyrics in the song could shed some light on the situation. (Bustle reached out to Drake and Hadid's reps for comment, but did not receive an immediate response.)\n\nUpdate: Hadid responded to the rumors via Twitter later on June 29, tweeting the following in response to a fan:\n\nNot me!!! [shrug emoji] that’s disrespectful. WHY CANT PPL BE FRIENDS W/o all the insinuation\n\nEarlier: In \"Finesse,\" he sings, \"You stay on my mind / all the time, all the time\" and \"I would make time for you / Commitment.\" So, it would seem like he had some strong feelings about the person in question. While he doesn't give any overt clues as to who he's talking about, based on subsequent lyrics, he may be referring to a model. And who's one of the most famous supermodels in the world right now? Hadid.\n\n\"I want my baby to have your eyes / I'm going against my own advice / Should I do New York? I can't decide/Fashion week is more your thing than mine,\" he sang. Since Hadid has appeared in her fair share of Fashion Week shows, it would make sense if this lyric ties back to her.\n\nAdditionally, he says in the song, \"You and your sister / Too hot to handle.\" It's pretty obvious that, if he is talking about Hadid, this would be a nod to her sister and fellow model, Gigi Hadid. There are so many possible connections to the model that could point to a romance between the two. But, until Drake clarifies things himself, one can only infer what the lyrics may stand for.\n\nMichael Loccisano/Getty Images Entertainment/Getty Images\n\nBut, what if \"Finesse\" is in reference to yet another famous model? Based on the lyrics of the song, it's also possible that it could point to a potential romance between Drake and Kendall Jenner. She checks off all of the same boxes as her friend Hadid does in this great \"Finesse\" mystery.\n\nHas a thing for Fashion Week? Check. Equally famous sister? Check (on multiple accounts, but likely would be about Kylie Jenner). Past romance rumors? Another check. In December 2015, Jenner and Drake were spotted getting a little close at Kris Jenner's annual Christmas party, which sparked some romance rumors. Although, neither of them have touched upon said rumors.\n\nHowever, given the more recent relationship rumors with Drake and Hadid, there's a better case for \"Finesse\" being in reference to her (if it's referencing anyone particularly well known at all).\n\nPascal Le Segretain/Getty Images Entertainment/Getty Images\n\nAccording to Us Weekly, Drake threw Hadid a 21st birthday party in October 2017. While the publication reported that he planned the festivities because he's a \"close friend\" of the model's, that didn't stop some from wondering if the party meant that the two were an item. A subsequent Us Weekly story, published shortly after the party took place, clarified things about their relationship. A source told the publication that they were \"definitely\" not dating.\n\nHadid's mother, Yolanda Hadid, also stepped in to clear things up about her daughter and the \"Hotline Bling\" rapper. During her appearance on Watch What Happens Live, host Andy Cohen asked the former Housewife about the rumors. She replied, while chuckling, \"Are you kidding?\" When Cohen brought up that Drake threw her a birthday party, she tried to play coy but eventually said, \"I mean, they're friends.\"\n\nStill, neither Hadid nor Drake have outright commented on any of the dating rumors. So, for any shippers of them out there, you may just have to settle for some possible references to a romance in one of the singer's newest releases from Scorpion, \"Finesse.\"", "images": ["https://imgix.bustle.com/uploads/image/2018/6/29/3a888fde-c4f0-46f4-8b11-d9bd95e289fe-screen-shot-2018-06-29-at-13328-pm.png?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/6/29/b9cfb33c-e294-43a9-a81e-f5e143a9d243-getty-805757690.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2018/6/28/4e50e5c2-b84a-4017-a3f0-6799616933b2-rulebreakers_cta.png?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/9/e61dc5d5-dfaf-4ecc-b137-2b8d9c48ab2d-getty-1209101385.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/15/2d21ebe8-9f96-4fc8-a8bc-d244baa6bbcb-getty-529590044.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/6/29/3a888fde-c4f0-46f4-8b11-d9bd95e289fe-screen-shot-2018-06-29-at-13328-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2018/6/29/303f10ad-7fcf-494a-8f52-94e894db4ead-getty-801522024.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/14/140f13e5-57be-4d8b-913a-b3ee39ca0dfd-getty-122716729.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2020/4/6/6ec3dcb8-566d-4631-88db-11d6dac03c81-8955bb08-cd84-48c9-b83d-bc8ad846cb05-getty-161442774.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/6/29/3a888fde-c4f0-46f4-8b11-d9bd95e289fe-screen-shot-2018-06-29-at-13328-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/did-drake-hint-at-a-bella-hadid-romance-on-scorpion-one-track-has-people-speculating-9632839", "title": "Did Drake Hint At A Bella Hadid Romance On 'Scorpion'? One Track Has People Speculating", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/did-drake-hint-at-a-bella-hadid-romance-on-scorpion-one-track-has-people-speculating-9632839", "type": "article", "title": "Drake & Bella Hadid May Have Dated, Based On These Intriguing New Lyrics", "description": "Ever since Scorpion was released, fans have been trying to figure out what some of Drake's lyrics mean in his many new tracks. Well, one song in particular has some wondering about a romance with a famous model. As E! News noted, Drake may hint at a…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/6/29/3a888fde-c4f0-46f4-8b11-d9bd95e289fe-screen-shot-2018-06-29-at-13328-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Ever since Scorpion was released, fans have been trying to figure out what some of Drake's lyrics mean in his many new tracks. Well, one song in particular has some wondering about a romance with a famous model. As E! News noted, Drake may hint at a…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}