{"url": "http://www.xxlmag.com/news/2018/05/amber-rose-love-21-savage-instagram/", "text": "Regardless of her current relationship status or rumors to the contrary, Amber Rose loves herself some 21 Savage. That's a point she made loud and clear when she uploaded a heartfelt post to Instagram Monday afternoon (May 14).\n\nAddressing the idea that she's a \"gold digger\" or someone simply after rich men, Rose expressed her love for 21 while explaining all that she thinks makes him awesome.\n\n\"I Love this man so much,\" she begins in the post. “I know the Internet portrays me to be some heartless person or they feel like I’m incapable of love but I love him so hard. He is not only one of the most talented people I have ever met but he is so real, humble and smart as hell.\"\n\nIn the last half of the caption, which is for an image of herself and 21, Rose issues a message to those who'd like to make assumptions about her relationship status based on who she pops up in pictures with. This bit could be referencing a pic she posted of herself and Lil Pump hanging out at the 2018 Rolling Loud Festival on Sunday (May 13). A short while later, one Insta user made a comment possibly insinuating that Rose was involved with the Miami rapper and Rose promptly had him blocked. The post including herself and Pump is now gone.\n\n\"I don’t care who you see me in a picture with or who the Internet associates me with,\" she continued in the caption. \"The Internet is fake af and they pull stories out of their asses for click bait. It’s the price of fame I guess but it’s not real life because in real life Shayaa is my heart and soul. He’s the only one that has ever supported my Slutwalk and my feminist views with no fucks given. He loves my son and I love his Three beautiful children so much. God brings people in ur life for a reason and God brought me him. I don’t care if you call me Thirsty, a hoe, a gold digger or whatever df else. I love him. Put ur pride to the side and tell the person you really love how much they mean to you today because life is too short to care about what anyone else says.\"\n\n21 Savage and Amber Rose's relationship first surfaced in the public eye last summer, and for many of the months after they first stepped out together, they were pretty much inseparable. As Rose alludes to in her Instagram post, 21 even accompanied her to her annual Slut Walk.\n\nWhile there have been rumors of Rose and 21 breaking up, neither have confirmed that to be the case—even if they haven't been seen together in months. Back in March, Rose expressed her wish to work through whatever relationship issues they were having.\n\nCheck out her post below.", "images": ["https://townsquare.media/site/812/files/2017/09/21-Savage-Amber-Rose-Feature.jpeg?w=600&h=0&zc=1&s=0&a=t&q=89", "https://townsquare.media/site/812/files/2017/10/xxl-trimmed-spacing.png", "https://sb.scorecardresearch.com/p?c1=2&c2=16896931&cv=2.0&cj=1"], "top_img": "https://townsquare.media/site/812/files/2017/09/21-Savage-Amber-Rose-Feature.jpeg?w=600&h=0&zc=1&s=0&a=t&q=89", "keywords": [], "authors": ["Peter A. Berry"], "canonical_link": "https://www.xxlmag.com/news/2018/05/amber-rose-love-21-savage-instagram/", "title": "Amber Rose Expresses Her Love for 21 Savage on Instagram", "meta_data": {"instagram_profile": "xxl", "description": "Amber Rose expresses her love for 21 Savage in a heartfelt post she uploaded to Instagram.", "keywords": "amber rose 21 savage breakup, amber rose professes her love 21 savage instagram, 21 savage xxl interview", "fb": {"app_id": 132644573937605, "admins": 100002025987268, "pages": 197474901813}, "og": {"title": "Amber Rose Expresses Her Love for 21 Savage on Instagram - XXL", "description": "Amber Rose expresses her love for 21 Savage in a heartfelt post she uploaded to Instagram.", "url": "https://www.xxlmag.com/news/2018/05/amber-rose-love-21-savage-instagram/", "site_name": "XXL Mag", "type": "article", "image": "https://townsquare.media/site/812/files/2017/09/21-Savage-Amber-Rose-Feature.jpeg?w=600&h=0&zc=1&s=0&a=t&q=89"}, "twitter": {"card": "summary_large_image", "site": "@XXL"}, "sailthru.description": "Amber Rose expresses her love for 21 Savage in a heartfelt post she uploaded to Instagram.", "sailthru.date": "2018-05-14 15:32:13", "sailthru.title": "Amber Rose Expresses Her Love for 21 Savage in Heartfelt Instagram Post", "sailthru.tags": "tsmsite-xxl, tsmmarket-national, tsmtype-national, 21-savage, amber-rose, news", "sailthru.author": "peterberry", "sailthru.image.full": "https://townsquare.media/site/812/files/2017/09/21-Savage-Amber-Rose-Feature.jpeg", "sailthru.image.thumb": "https://townsquare.media/site/812/files/2017/09/21-Savage-Amber-Rose-Feature.jpeg", "google-site-verification": "AUEunxjF_mSKWFvV1uhW1J8ih1S-XheA8UukQCmcyMs", "msvalidate.01": "38FB0DB5D97FA0CEE1853CB708082BF1", "viewport": "width=1286, initial-scale=1.0"}, "movies": [], "publish_date": 1526283133.0, "source": "http://www.xxlmag.com", "summary": ""}