{"url": "https://www.santacruzsentinel.com/2018/10/19/stephen-colbert-really-wants-trump-to-run-in-2020/", "text": "By Alex Horton | Washington Post\n\nThere is already speculation about the Democratic candidate field readying to oppose President Donald Trump in the 2020 election.\n\nBut even that premise may be faulty if you consider one question: Is Trump even going to run?\n\nMSNBC “Morning Joe” co-host Joe Scarborough believes Trump will voluntarily be a one-term president, he told CBS’ Stephen Colbert on Thursday, alongside co-host Mika Brzezinski.\n\nColbert doesn’t want that to happen. And it’s not just to keep delivering a reliable stream of monologue taunts.\n\nThe “Late Show” discussion turned to the disappearance of Washington Post contributing columnist Jamal Khashoggi and Trump’s soft approach and reluctance to pressure the Saudis amid mounting evidence of Khashoggi’s killing by men close to Crown Prince Mohammed bin Salman.\n\nTrump, who advanced the idea of “rogue killers” responsible for Khashoggi’s death, helped sow doubt the Saudi government orchestrated the killing, Brzezinski said. And she said it was similar to how Trump defused sexual assault allegations against Supreme Court Justice Brett Kavanaugh during his nomination process.\n\n“That can’t be our reality, and at some point this has to end, one way or another,” Brzezinski said.\n\nThat end, Scarborough said, was to marshal support for the midterm elections next month and weaken Trump’s influence in Congress.\n\nBy 2020, he believes, Trump will be eyeing the exit.\n\n“He didn’t want to be elected president, he didn’t think he was going to be elected president, he didn’t even think he was going to get the Republican nomination. He’s going to cash out,” Scarborough said.\n\nColbert, a fierce Trump critic, wants him to be out in 2020. But not in that way.\n\n“I think that would be a smart thing for him to do,” Colbert told Scarborough, as the audience laughed.\n\n“I’ll tell you why I don’t want it to happen, because I think it’s important that the voters of America have an opportunity to say, ‘Oops, my bad, we made a mistake there’ and correct themselves.\n\n“And if Donald Trump doesn’t run, he takes away that corrective action of history, and therefore his presidency is whole and unjudged, if he just doesn’t run again.”\n\nColbert said that if that were to happen, Trump could say, “‘I fixed it, I made it great again, goodbye,’” and take the $100 million he raised and make “another failing casino or something,” Colbert said.\n\nScarborough said he was skeptical Trump would ride off into the sunset.\n\n“He’ll get money from the Saudis. He’s right now proving to the Saudis he’ll be their lap dog. He’ll make money from (Russian) President (Vladimir) Putin when he gets out. That’s why he’s been Putin’s lap dog. Donald Trump is all about money. It’s what drives him,” Scarborough said.", "images": ["https://www.santacruzsentinel.com/wp-content/uploads/2018/09/SCS-placeholder.jpg", "https://www.santacruzsentinel.com/wp-content/uploads/2018/10/colbert2-1.jpg?w=1024&h=805", "https://secure.gravatar.com/avatar/?s=85&d=mm&r=g", "https://www.santacruzsentinel.com/wp-content/uploads/2018/09/STC_main.svg"], "top_img": "https://www.santacruzsentinel.com/wp-content/uploads/2018/10/colbert2-1.jpg?w=1024&h=805", "keywords": [], "authors": ["The Washington Post"], "canonical_link": "https://www.mercurynews.com/stephen-colbert-really-wants-trump-to-run-in-2020", "title": "Stephen Colbert really wants Trump to run in 2020", "meta_data": {"application-name": "santacruzsentinel", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "og": {"type": "article", "title": "Stephen Colbert really wants Trump to run in 2020", "url": "https://www.mercurynews.com/stephen-colbert-really-wants-trump-to-run-in-2020", "description": "Colbert said that if that were to happen, Trump could say, “‘I fixed it, I made it great again, goodbye,'” and take the $100 million he raised and make “another failing casi…", "site_name": "Santa Cruz Sentinel", "image": {"identifier": "https://www.santacruzsentinel.com/wp-content/uploads/2018/10/colbert2-1.jpg?w=1024&h=805", "width": 1024, "height": 805}, "locale": "en_US"}, "article": {"published_time": "2018-10-19T20:22:58+00:00", "modified_time": "2018-10-22T11:20:44+00:00"}, "twitter": {"text": {"title": "Stephen Colbert really wants Trump to run in 2020"}, "image": "https://www.santacruzsentinel.com/wp-content/uploads/2018/10/colbert2-1.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.santacruzsentinel.com/wp-content/uploads/2018/08/cropped-STC_SI.png?w=270"}, "movies": [], "publish_date": 1539878400.0, "source": "https://www.santacruzsentinel.com", "summary": ""}