{"url": "https://web.archive.org/web/20140225025141/http://www.themoscowtimes.com/opinion/article/forget-kiev-the-real-fight-will-be-for-crimea/495145.html", "text": "Amid the numerous reports of events in Ukraine in recent days, observers have largely overlooked the situation in Crimea. But I am convinced that the Black Sea peninsula could become the center of major events in the near future.\n\nAs a result of the confusion, Russia gave Crimea to Ukraine but retained Sevastopol.\n\n\n\nDemonstrators in Crimea have been toting signs reading \"Putin is our president\" and \"Russia, we have been abandoned, take us back!\" Late Sunday in the city of Kerch, someone took down the Ukrainian flag above the city administration building and hoisted the Russian flag in its place. At the same time, armored vehicles from the Russian military base in Sevastopol blocked all entrances to the city — essentially protecting it — after local authorities refused to recognize the new Ukrainian government. What's more, a throng of 20,000 demonstrators spontaneously appointed a local businessman and Russian national to head the city. He immediately announced his refusal to transfer local tax revenues to Kiev and claimed personal authority over the city's police force.\n\nNow that President Vladimir Putin is no longer tied up with the Olympics, I have no doubt he will use the \"interests of Russians\" in Crimea as a pretext for supporting the separatist movement there, just as he did with South Ossetia in 2008. Putin does not even need to send troops to Crimea; they are already there, in accordance with a bilateral agreement with Ukraine. Former Ukrainian President Viktor Yushchenko had planned to cancel that agreement, but his successor, recently impeached President Viktor Yanukovych, extended it.\n\nI was actually born in Sevastopol. Interestingly, my birth certificate lists my birthplace as \"Sevastopol\" but makes no mention of \"Ukrainian SSR,\" even though Soviet leader Nikita Khrushchev gave Crimea to Ukraine four years before my birth. Crimea was part of Russia until 1954, at which point Khrushchev presented the region to Ukraine to commemorate the 300th anniversary of the historical decision by the Pereyaslavska Rada, the precursor to the Ukrainian parliament, to unify the country with Russia.\n\nHowever, Khrushchev's spontaneous gesture was implemented somewhat sloppily, and the Sevastopol legislature never officially acknowledged it. Khrushchev had forgotten that in 1948, Stalin issued a decree removing Sevastopol from the jurisdiction of the Crimean administration and making it an autonomous entity under Moscow's direct control. As a result of this confusion, Russia gave Crimea to Ukraine but retained Sevastopol.\n\nSurprisingly, that arrangement did not bother anybody for several decades. Nobody could have imagined that the Soviet Union would one day split into separate republics and that the borders between them would have to be redefined. For the most part, the residents of Sevastopol were seamen, their families or support staff. The city was a large naval base, and it remains one to this day. The majority of residents are Russian who receive their salaries in rubles even though, administratively, the city is Ukrainian. This has proved a constant source of tension and a source of endless debate between Ukrainian and Russian nationalists. In recent years, the city has been managed by two separate administrations — the city administration appointed by Kiev, and representatives of Russia's Black Sea Fleet, a massive organization that owns almost everything in Sevastopol, right down to the kindergartens.\n\nMy father was in the military, and he moved our family from Sevastopol to the Moscow region while I was still an infant. I cannot rightfully call the city my hometown, although we did visit it a few times when I was a schoolboy. During those visits to Sevastopol, I never once saw a sign written in Ukrainian and never heard anyone speaking Ukrainian in the streets. Of course, that was a very long time ago.\n\nThe Soviet Constitution first mentioned Sevastopol as part of Ukraine in 1978, and that moment began the city's gradual but ultimately unsuccessful assimilation into Ukraine.\n\nMany people considered it extremely unfair that the Belavezha Accords, signed after the collapse of the Soviet Union, formally included Sevastopol as part of Ukraine. However, the presidents who signed those accords came to power through legitimate elections and their respective parliaments ratified the agreements. I don't know why President Boris Yeltsin did not raise the question of Sevastopol, or the Crimea in general, with Ukraine in 1991. I once read the memoirs of a member of the Ukrainian delegation to the accords. He wrote that the Ukrainian side was certain Yeltsin would insist that Russia regain Crimea following the Soviet collapse and it was very surprised when he never made such a demand.\n\nThe only way Russia can alter the current situation now is to start a war in Crimea. Many observers believe that, despite Putin's blustery statements, he has no real desire to fight with anyone. His goal in supporting separatists is not to annex additional territory to this already vast and difficult-to-manage country, but to ensure that any republic breaking away from the Soviet empire becomes burdened with internal unrest and conflict. This would explain Moscow's actions in the self-proclaimed Transdnestr republic, South Ossetia and Abkhazia, and it is why Putin might seek to foster instability in Crimea.\n\nThere is little doubt that Putin will aggressively play the Crimean card now and that Moscow will encourage and provide ample funding to all Ukrainian separatist movements.\n\nCrimea has always been a source of anxiety for Kiev, and it is unclear just how far Putin will go this time in his efforts to intensify those difficulties.", "images": ["https://web.archive.org/web/20140225025141im_/http://www.themoscowtimes.com/bitrix/templates/tmt/img/articles_print.png", "https://web.archive.org/web/20140225025141im_/http://static.themoscowtimes.com/bitrix/templates/tmt/img/login.gif", "https://web.archive.org/web/20140225025141im_/http://static.themoscowtimes.com/bitrix/templates/tmt/img/logo_s.gif", "https://web.archive.org/web/20140225025141im_/http://static.themoscowtimes.com/upload/iblock/c46/7-p-08-cartoon1952.jpg", "https://web.archive.org/web/20140225025141im_/http://counter.rambler.ru/top100.cnt?1434385", "https://web.archive.org/web/20140225025141im_/http://www.tns-counter.ru/V13a****imedia_ru/ru/CP1251/tmsec=mostimes_total/", "https://web.archive.org/web/20140225025141im_/http://counter.rambler.ru/top100.cnt?681659", "https://web.archive.org/web/20140225025141im_/http://www.themoscowtimes.com/bitrix/templates/tmt/img/articles_biger.png", "https://web.archive.org/web/20140225025141im_/http://static.themoscowtimes.com/bitrix/templates/tmt/img/articles_smaller.png", "https://web.archive.org/web/20140225025141im_/http://www.themoscowtimes.com/upload/iblock/f23/US-Dental-Care.gif", "https://web.archive.org/web/20140225025141im_/http://static.themoscowtimes.com/bitrix/templates/tmt/img/logo.gif", "https://web.archive.org/web/20140225025141im_/http://static.themoscowtimes.com/upload/iblock/5ed/small_5314-p-08-pu_olim1316.jpg", "https://web.archive.org/web/20140225025141im_/http://www.themoscowtimes.com/favicon.ico", "https://web.archive.org/web/20140225025141im_/http://www.themoscowtimes.com/upload/iblock/f38/Ace International.gif", "https://web.archive.org/web/20140225025141im_/http://static.themoscowtimes.com/templates/tmt/img/login_providers/facebook_16.gif", "https://web.archive.org/web/20140225025141im_/http://static.themoscowtimes.com/templates/tmt/img/login_providers/youtube_16.gif", "https://web.archive.org/web/20140225025141im_/http://static.themoscowtimes.com/upload/iblock/42e/small_5313-08-cartoon1950.jpg", "https://web.archive.org/web/20140225025141im_/http://static.themoscowtimes.com/templates/tmt/img/rss_16.gif", "https://web.archive.org/web/20140225025141im_/http://static.themoscowtimes.com/upload/iblock/111/small_5315-p-08-cartoon1951.jpg", "https://web.archive.org/web/20140225025141im_/http://top100-images.rambler.ru/top100/banner-88x31-rambler-gray2.gif", "https://web.archive.org/web/20140225025141im_/http://static.themoscowtimes.com/upload/iblock/f92/small_5313-09-pu_hero13.jpg", "https://web.archive.org/web/20140225025141im_/http://static.themoscowtimes.com/templates/tmt/img/login_providers/google-plus-16.png", "https://web.archive.org/web/20140225025141im_/http://static.themoscowtimes.com/upload/iblock/035/small_ukr.jpg", "https://web.archive.org/web/20140225025141im_/http://static.themoscowtimes.com/bitrix/templates/tmt/img/calendar.gif", "https://web.archive.org/web/20140225025141im_/http://mc.yandex.ru/watch/10539526", "https://web.archive.org/web/20140225025141im_/http://static.themoscowtimes.com/templates/tmt/img/login_providers/twitter_16.gif"], "top_img": "https://web.archive.org/web/20140225025141im_/http://www.themoscowtimes.com/favicon.ico", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20140225025141/http://www.themoscowtimes.com/opinion/article/forget-kiev-the-real-fight-will-be-for-crimea/495145.html", "title": "Forget Kiev. The Real Fight Will Be for Crimea | Opinion", "meta_data": {"apple-itunes-app": "app-id=376796819, affiliate-data=myAffiliateData, app-argument=http://themoscowtimes.com", "keywords": "Russia, Moscow, Russian news, Moscow news, Russian newspaper, daily news, independent news, reliable news, USSR, Soviet Union, CIS, Russian politics, Russian business, Russian culture, Russian opinion, St Petersburg, Saint Petersburg, oligarch, Kremlin, Berezovsky, Khodorkovsky, Abramovich, Putin, Yeltsin, Kursk, KGB, FSB", "description": "As a result of the confusion, Russia gave Crimea to Ukraine but retained Sevastopol.", "og": {"title": "Forget Kiev. The Real Fight Will Be for Crimea | Opinion", "type": "article", "site_name": "The Moscow Times", "url": "https://web.archive.org/web/20140225025141/http://www.themoscowtimes.com/opinion/article/forget-kiev-the-real-fight-will-be-for-crimea/495145.html", "description": "As a result of the confusion, Russia gave Crimea to Ukraine but retained Sevastopol.", "email": "webeditor@themoscowtimes.com", "phone_number": "+7-495-2324774"}, "fb": {"admins": "100001304578239,3902974,100002922679494,724502989", "app_id": 161628980597899}, "verify-v1": "RNoyq8LlqxRwMADluCWoCmp3I0Zcbe248phME/8dZG0=", "google-site-verification": "3tgcoomyRR0ETB6am2TjkLYr2K6UdAB7q7iI_8uRV6w", "distribution": "global", "robots": "index, follow", "rating": "General", "revisit": "1 day", "audience": "all", "document-state": "Dynamic", "article": {"published_time": "02/25/2014", "author": "http://www.themoscowtimes.com/sitemap/authors/andrei-malgin/171884.html", "section": "Opinion"}}, "movies": [], "publish_date": 1393257600.0, "source": "https://web.archive.org", "summary": ""}