{"url": "www.usatoday.com/story/life/people/2017/09/19/model-elsie-hewitt-accuses-ryan-phillippe-throwing-her-down-staircase-lawsuit/681696001/", "text": "Actor Ryan Phillippe will not face criminal charges in the domestic violence case that resulted in a lawsuit being filed by a former girlfriend.\n\nFrank Mateljan, a spokesperson for the Los Angeles City Attorney's Office, told USA TODAY that his office will not be pursuing the matter further.\n\n\"The City Attorney's Office was referred this matter following an investigation by the LAPD,\" he said in a statement. \"After a thorough review, the matter was set for a City Attorney office hearing, during which both parties were present, detailed the incident, were advised on the law and given guidance as to how to avoid similar incidents in the future.\n\n\"Separate hearings were held in August and September. No further action has been scheduled following our office hearing, though we do reserve the right to file charges up to one year after the incident.\"\n\nRyan Phillippe lands in hospital with 'badly broken' leg\n\nOn Monday, model Elsie Hewitt, 21, sued the actor for $1 million, alleging assault, battery and intentional infliction of emotional distress. Phillippe denies the accusations.\n\n\"The claims are false,\" Phillippe's rep, Nicole Perna, said to USA TODAY in a statement.\n\nLater in the evening, he expanded on his thoughts in a tweet confirmed by Perna.\n\n\"I am saddened and disgusted by these false allegations being circulated about me,\" he wrote. \"At the time these allegations were initially made, I fully cooperated with law enforcement and a thorough investigation was conducted.\"\n\nHe continued, \"As a man, raised by women, in a household where women's right's, feminism and advocacy were very much at the forefront, I am sickened that my name can be found in any article where domestic violence of any kind is being alleged.\"\n\nHewitt's lawsuit, obtained by USA TODAY, says Phillippe, who is 22 years her senior, became increasingly possessive and violent towards her (often while under the influence) during their three-month relationship.\n\nThe document states that during their relationship, she observed Phillippe, 43, \"repeatedly abusing a panoply of legal and illegal drugs, including without limitation: cocaine, ecstasy, psychedelic mushrooms and steroids.\"\n\nThings reached a boiling point over the July 4th holiday, according to the suit, when Hewitt and a friend came to his house to pick up personal items she would need for an upcoming modeling job.\n\nPhillippe, she describes, was \"discernibly drunk and high\" at the time, and became increasingly \"agitated and hostile.\" In an effort to diffuse the situation, Hewitt asked to speak with him privately upstairs.\n\nWhen that plan failed, she called her friend to come upstairs while she cleared out her belongings from his bedroom.\n\nAt that point, the lawsuit says, Phillippe grabbed Hewitt by the arm (\"so tightly that his grip left heavy bruises on her arm hours later\") and \"violently threw her down his staircase as hard as he could.\"\n\nShe made a second trip up the stairs only to be cornered, kicked and thrown down the stairs again. As and her friend fled, he cursed and screamed \"get the (expletive) out of my house, you crazy (expletive)!\"\n\nSoon afterward, she sought treatment at the emergency room at Cedars-Sinai Medical Center, where police filed a report, noting \"visible injuries to (Hewitt's) legs, back, arms, shoulder and face\" and granted her a week-long emergency protective order, which was served at Phillippe's home on July 6.\n\nThe day beforehand, Hewitt says he texted her saying he was \"so sad\" and contacted her friends via private message on social media that he was \"heartbroken\" and \"in disbelief\" that police had come to his home.\n\n\"I can't believe she'd do this to me,\" he allegedly wrote, adding he \"would never hurt her like she's claiming. I didn't hit or punch or kick her.\"\n\nThe friend who witnessed the encounter replied, \"I saw the whole thing Ryan, you literally were grabbing her and threw her down the stairs.\"\n\nHewitt is seeking $1 million in punitive damages, citing emotional distress and the impact physical attack had on her ability to work as a model since her \"income and career (are) largely contingent upon her physical features.\"\n\nPhillippe's publicist released a statement flatly denying the account.\n\nIn his tweet, Phillippe noted, \"I have been a public figure for almost 25 years and many untrue things have been said or written about me in the past. That is something you learn to accept if you choose a profession like mine. This time is different.\"\n\nHe also took offense at the notion of using this type of accusation for personal gain: \"Domestic violence is a very real and tragic issue for many women the world over and should never be used to vengefully slander or as a ploy for monetary gain. This is wrong. This is not who I am. Every one of my accuser's allegations (is) false.\"\n\nKaty Perry dismisses idea she's dating Ryan Phillippe with quippy tweet\n\nPhillippe was previously married to Reese Witherspoon, who filed separation papers in 2006 after seven years of marriage. Their divorce was finalized in 2008.\n\nThey have two children together: 18-year-old daughter Ava and 13-year-old son Deacon. He also has a 6-year-old daughter from his relationship with Pitch Perfect actress Alexis Knapp.", "images": ["https://media.gannett-cdn.com/29906170001/29906170001_5581488853001_5581472153001-vs.jpg?pubId=29906170001&width=660&height=372&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/d273251fd6253cd257a5cbd247f8c6f2a85069d6/c=0-583-2131-1787/local/-/media/2017/09/19/USATODAY/USATODAY/636414293697828424-XXX-AP-17085239152417.JPG?width=2131&height=1204&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/d273251fd6253cd257a5cbd247f8c6f2a85069d6/c=0-583-2131-1787/local/-/media/2017/09/19/USATODAY/USATODAY/636414293697828424-XXX-AP-17085239152417.JPG?width=2131&height=1204&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/people/2017/09/19/model-elsie-hewitt-accuses-ryan-phillippe-throwing-her-down-staircase-lawsuit/681696001/", "title": "Ryan Phillippe on ex-girlfriend's lawsuit: 'Every one of my accuser's allegations is false'", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Ryan Phillippe on ex-girlfriend's lawsuit: 'Every one of my accuser's allegations is false'", "description": "\"I am saddened and disgusted by these false allegations being circulated about me,\" the 'Cruel Intentions' star tweeted Tuesday.", "url": "https://www.usatoday.com/story/life/people/2017/09/19/model-elsie-hewitt-accuses-ryan-phillippe-throwing-her-down-staircase-lawsuit/681696001/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/d273251fd6253cd257a5cbd247f8c6f2a85069d6/c=0-583-2131-1787/local/-/media/2017/09/19/USATODAY/USATODAY/636414293697828424-XXX-AP-17085239152417.JPG?width=2131&height=1204&fit=crop&format=pjpg&auto=webp", "width": 2131, "height": 1204}, "type": "article"}, "article": {"author": "Jayme Deerwester", "content_tier": "free", "opinion": "false"}, "description": "\"I am saddened and disgusted by these false allegations being circulated about me,\" the 'Cruel Intentions' star tweeted Tuesday.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/d273251fd6253cd257a5cbd247f8c6f2a85069d6/c=0-583-2131-1787/local/-/media/2017/09/19/USATODAY/USATODAY/636414293697828424-XXX-AP-17085239152417.JPG?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Ryan Phillippe on ex-girlfriend's lawsuit: 'Every one of my accuser's allegations is false'", "description": "\"I am saddened and disgusted by these false allegations being circulated about me,\" the 'Cruel Intentions' star tweeted Tuesday."}}, "movies": [], "publish_date": 1505750400.0, "source": "http://www.usatoday.com", "summary": ""}