{"url": "www.billboard.com/articles/news/television/8070460/harry-styles-james-corden-bromance-late-late-show-timeline", "text": "TELEVISION A Timeline of Harry Styles & James Corden's 'Late Late Show' Bromance\n\nJames Corden and Harry Styles have one big thing in common: They’ve both crossed the Atlantic to take America by storm. On Tuesday night (Dec. 12) -- when Corden and his wife Jules were a little busy welcoming their new baby girl -- Styles helped his fellow Brit out by taking over hosting duties on The Late Late Show last-minute.\n\n“Donald Trump finally got sick of James’s jokes and deported him back to England,” Styles quipped at the top of the show. Actually, Corden and his wife were at the hospital, and Styles shared some scoop about their new addition. “She looks a lot like James, mainly because James looks like a giant baby,” he joked.\n\nStyles also addressed the kiss heard 'round the world: the one shared between him and Corden on Monday night’s holiday Carpool Karaoke. “I would like to take the opportunity to announce that we will also be having a baby,” he joked.\n\nAll jokes aside, Styles clearly has Corden's back. So where did this adorable bromance begin? Billboard put together a timeline of their past Late Late Show shenanigans.\n\nMay 14, 2015: One Direction goes to battle with Corden in a game of dodgeball. “It definitely feels like the last five years I’ve been in this band has been in preparation for this game,” Styles deadpans.\n\nCorden talks to the quartet about Zayn’s departure from the group. When the host asks if they thought of adding another member like him, Styles flat-out says, “No.”\n\nMay 15, 2015: One Direction talk about life on the road, and Styles reveals that he went on a juice cleanse. “I actually had all the side effects that you read out,” he tells Corden.\n\nDec. 4, 2015: The four members of One Direction play a game of Tattoo Roulette with Corden, where they all pick from boxes and the loser (or winner) has to get a tattoo commemorating the occasion. Styles went under the needle, getting a memento of The Late Late Show permanently inked on his arm.\n\nDec. 15, 2015: As a member of One Direction, Styles sits in the back while the quartet sings Carpool Karaoke versions of their songs “What Makes You Beautiful,” “Best Song Ever” and “Story of My Life.”\n\nMay 15, 2017: Kicking off the show’s week with Styles, the singer appears on the show’s Flinch segment with Aaron Taylor-Johnson, in which he wears a red apron and holds a teacup behind the glass shield. He manages not to spill any of his tea.\n\nMay 16, 2017: The singer delivers some zingers about Russian collusion news in his first Late Late Show monologue. “The good news for Trump is he has been named Employee of the Month by Russia,” he jokes.\n\nMay 17, 2017: Styles and Corden star in a sketch where they play doctors who break into song during a surgery.\n\nMay 19, 2017: This episode marks Styles’ first appearance on Carpool Karaoke without his One Direction mates. His biggest takeaway from his first solo adventure in shotgun? “I feel like I have more control over the buttons.” There’s a fun scene where they magically change clothes into argyle and a skin-tight gold number, confirming what we already knew: The singer can pull off any style.\n\nJune 8, 2017: Styles storms the Late Late Show set to… answer a wrong number.\n\nDec. 11, 2017: Corden’s yuletide segment of Carpool Karaoke features a smattering of A-list celebrities, including Fifth Harmony, Katy Perry and Foo Fighters, singing “Santa Claus Is Comin’ to Town.” But it's his kiss with Styles that made headlines.", "images": ["https://www.billboard.com/assets/1586539892/images/Billboard-white.svg?4863e69cb9d656c61185", "https://static.billboard.com/files/2020/03/radio-city-music-hall-covid19-2020-billboard-1500x845-1584562361-compressed.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://static.billboard.com/files/media/billboard-logo-b-20-billboard-1548-compressed.jpg", "https://static.billboard.com/files/media/harry-styles-and-james-corden-kiss-on-Santa-Claus-Is-Comin-To-Town-Carpool-Karaoke-billboard-1548-1024x677.jpg", "https://static.billboard.com/files/2020/04/miley-cyrus-april-2019-uu-billboard-z-1548-1585925327-compressed.jpg", "https://static.billboard.com/files/2020/03/7cover_Coronavirus_Touring_WEB-1585231399-220x286.jpg", "https://static.billboard.com/files/2020/03/GettyImages-1144319419-1583448877-compressed.jpg"], "top_img": "https://static.billboard.com/files/media/harry-styles-and-james-corden-kiss-on-Santa-Claus-Is-Comin-To-Town-Carpool-Karaoke-billboard-1548-1024x677.jpg", "keywords": [], "authors": ["Caitlin Kelley"], "canonical_link": "http://www.billboard.com/articles/news/television/8070460/harry-styles-james-corden-bromance-late-late-show-timeline", "title": "A Timeline of Harry Styles & James Corden's 'Late Late Show' Bromance", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2017-12-13T18:43:36-05:00", "published_time": "2017-12-13T17:19:46-05:00"}, "description": "The two have made beautiful music together on 'The Late Late Show' for years.", "og": {"description": "The two have made beautiful music together on 'The Late Late Show' for years.", "image": {"identifier": "https://static.billboard.com/files/media/harry-styles-and-james-corden-kiss-on-Santa-Claus-Is-Comin-To-Town-Carpool-Karaoke-billboard-1548-1024x677.jpg", "height": 677, "width": 1024}, "title": "Harry Styles & James Corden 'Late Late Show' Bromance: A Timeline | Billboard", "type": "article", "url": "http://www.billboard.com/articles/news/television/8070460/harry-styles-james-corden-bromance-late-late-show-timeline", "site_name": "Billboard"}, "title": "A Timeline of Harry Styles & James Corden's 'Late Late Show' Bromance", "twitter": {"card": "summary_large_image", "description": "The two have made beautiful music together on 'The Late Late Show' for years.", "image": "https://static.billboard.com/files/media/harry-styles-and-james-corden-kiss-on-Santa-Claus-Is-Comin-To-Town-Carpool-Karaoke-billboard-1548-1024x677.jpg", "title": "A Timeline of Harry Styles & James Corden's 'Late Late Show' Bromance", "site": "@billboard"}}, "movies": [], "publish_date": 1513203586.0, "source": "http://www.billboard.com", "summary": ""}