{"url": "https://money.cnn.com/2018/06/26/media/jimmy-fallon-trump-response/index.html", "text": "Jimmy Fallon kicked off his show Monday by addressing President Donald Trump's Twitter attacks on him -- and he had a simple question for the president: \"Why are you tweeting at me?\"\n\n\"Before we begin, I just wanna give a shout-out to our show's number one fan, the president of the United States!\" Fallon said. \"As you may have heard, last night, the president of the United States went after me on Twitter, so Melania, if you're watching, I don't think your anti-bullying campaign is working.\"\n\nFallon told his audience on NBC's \"The Tonight Show\" that he had planned to tweet back at the president right away on Sunday night, but instead realized he had \"more important things to do.\"\n\n\"Then I thought, 'Wait, shouldn't he have more important things to do?'\" Fallon said to laughs. \"He's the president! What are you doing? Why are you tweeting at me?\"\n\nRelated: Trump goes after Jimmy Fallon\n\nTrump called out the TV host on Sunday night by tweeting that Fallon is \"now whimpering to all that he did the famous 'hair show' with me (where he seriously messed up my hair), & that he would have now done it differently because it is said to have 'humanized' me.\" The president then told Fallon to \"be a man.\"\n\nTrump was referencing a moment during the 2016 presidential campaign when Fallon messed up Trump's famous hair on \"The Tonight Show.\" The moment went viral and led to criticism for Fallon.\n\nIn a recent interview with The Hollywood Reporter, the host explained that he wasn't trying to \"normalize\" Trump. Fallon also said in the interview that it was a \"mistake\" and that looking back he'd do it differently.\n\nOn Monday, Fallon seemed perplexed that Trump had attacked him on social media.\n\n\"It's crazy. The president went after me on Twitter. It's pretty much the only thing I have in common with NFL players,\" Fallon said, referencing Trump's attacks on the NFL and its players last season.\n\nRelated: Jimmy Fallon can't find happy medium in partisan divide\n\nThe host also disputed Trump's claim that Fallon had called him to tell him that he had \"monster ratings.\"\n\n\"I've never called this human in my life. I don't have his number, I don't want his number,\" Fallon said during the show. \"By the way, Donald, I don't know if you've seen my ratings the past two years, but you didn't help.\"\n\n.@jimmyfallon is now whimpering to all that he did the famous \"hair show\" with me (where he seriously messed up my hair), & that he would have now done it differently because it is said to have \"humanized\" me-he is taking heat. He called & said \"monster ratings.\" Be a man Jimmy! — Donald J. Trump (@realDonaldTrump) June 25, 2018\n\nIn honor of the President's tweet I'll be making a donation to RAICES in his name. — jimmy fallon (@jimmyfallon) June 25, 2018\n\nIn response to Trump's tweets, Fallon tweeted Sunday that he made a donation in Trump's name to the Refugee and Immigrant Center for Education and Legal Services, also known as \"RAICES,\" a nonprofit group that provides legal services to immigrants.\n\n\"When Trump heard, he was like, 'I love RAICES. They're my favorite peanut butter cup,'\" Fallon said Monday.", "images": ["https://money.cnn.com/.element/cnnm-3.0/img/logo/logo_cnn.svg", "https://i.cdn.turner.com/money/.element/img/8.0/authors/byline-icon/frank-pallotta.png", "https://i.cdn.turner.com/money/images/1.gif", "https://i2.cdn.turner.com/money/dam/assets/180321145635-jimmy-fallon-nbc-1-780x439.jpg", "https://i2.cdn.turner.com/money/dam/assets/180626033223-fallon-062618-1024x576.jpg", "https://i.cdn.turner.com/money/video/bvp/images/1.gif", "https://i2.cdn.turner.com/money/.element/img/8.0/newsletters/reliable_sources/rs-with-button_large1x1.jpg", "https://money.cnn.com/.element/cnnm-3.0/img/logo/logo_cnnbusiness.png", "https://pixel.quantserve.com/pixel/p-D1yc5zQgjmqr5.gif"], "top_img": "https://i2.cdn.turner.com/money/dam/assets/180321145635-jimmy-fallon-nbc-1-780x439.jpg", "keywords": [], "authors": ["Frank Pallotta"], "canonical_link": "https://money.cnn.com/2018/06/26/media/jimmy-fallon-trump-response/index.html", "title": "Jimmy Fallon responds to Trump: 'Why are you tweeting at me?'", "meta_data": {"viewport": "width=1140", "date": "2018-06-26 12:54:15", "title": "Jimmy Fallon responds to Trump: 'Why are you tweeting at me?'", "description": "Jimmy Fallon responded to President Donald Trump on Monday's broadcast of NBC's \"The Tonight Show.\"", "keywords": "Jimmy Fallon, Donald Trump, Tonight Show, Tweets, Fallon Trump, CNN, CNNMoney, Frank Pallotta", "news_keywords": "Jimmy Fallon, Donald Trump, Tonight Show, Tweets, Fallon Trump, CNN, CNNMoney, Frank Pallotta", "author": "Frank Pallotta", "section": "media", "og": {"title": "Jimmy Fallon responds to Trump: 'Why are you tweeting at me?'", "type": "article", "url": "https://money.cnn.com/2018/06/26/media/jimmy-fallon-trump-response/index.html", "image": {"identifier": "https://i2.cdn.turner.com/money/dam/assets/180321145635-jimmy-fallon-nbc-1-780x439.jpg", "width": 780, "height": 439}, "site_name": "CNNMoney", "description": "Jimmy Fallon responded to President Donald Trump on Monday's broadcast of NBC's \"The Tonight Show.\""}, "fb": {"app_id": 521848191196480}, "twitter": {"card": "summary_large_image", "site": "@CNNMoney", "url": "https://money.cnn.com/2018/06/26/media/jimmy-fallon-trump-response/index.html", "title": "Jimmy Fallon responds to Trump: 'Why are you tweeting at me?'", "description": "Jimmy Fallon responded to President Donald Trump on Monday's broadcast of NBC's \"The Tonight Show.\"", "image": "https://i2.cdn.turner.com/money/dam/assets/180321145635-jimmy-fallon-nbc-1-540x304.jpg"}, "DC.date.issued": "2018-06-26T12:54:15"}, "movies": ["https://www.youtube.com/embed/Ud_-wBFe9bE"], "publish_date": 1529942400.0, "source": "https://money.cnn.com", "summary": ""}