{"url": "www.inquisitr.com/4947310/britney-spears-family-afraid-shell-have-second-meltdown-over-kevin-federline-drama/", "text": "Despite a tumultuous custody battle with ex Kevin Federline, Radar Online reports that Britney Spears may have other things on her plate that would explain her erratic behavior.\n\nThe publication broke the news that Spears is “desperate” for Sam Asghari, her current love interest, to propose, “but he’s dragging his feet and stalling.”\n\nAfter completing a successful run of shows in Las Vegas, Spears allegedly immediately turned her attention to tying the knot with her 23-year-old boyfriend.\n\nThe same source claims that the real reasoning behind Spears being impatient is because of her immediate urge to have children with Asghari.\n\n“All she can talk about right now is having a baby. She wants a girl so bad and she’s madly in love with Sam.”\n\nAsghari however, apparently is hesitant to act on Spear’s marriage advances, citing that he may not be mentally ready to completely settle down with the famous performer.\n\nWhile this all occurs, Spears also is caught up in a heated legal battle with ex, Federline.\n\nHe is reportedly asking the star for more money in spousal and child support to help take care of himself along with their young children, Sean and Jayden.\n\nFeatured image credit: Matthew Simmons Getty Images\n\nThe same source mentioned that “She’s freaking out over this court deposition and doesn’t see an end in sight to all the ugliness with Kevin.”\n\nSpears met Federline, a professional dancer, in April 2004 and, aside from the fact that he already had a child on the way with ex-fiancée Shar Jackson, whom, at the time, he had only been split from for a very short period. Federline and Spears were engaged by July of that year.\n\nTheir marriage ceremony took place on September 18, 2004, with son Sean Preston being born barely a year later. Jayden James, their second son, was born a year after that. However, by November 2006, Spears filed for divorce from Federline and began pursuing other romantic interests.\n\nAll of the drama surrounding Spears is prompting those closest to her to state that they are worried she may spiral off into something akin to her most famous public meltdown over a decade ago when she had shaved her head amongst other media-covered reckless acts.\n\nHowever, the source still described the situation best by saying that “There are still some major demons that Britney has to fight on a daily basis, and her workload never lets up. She feels the weight of the world on her shoulders right now, and her family’s desperately worried about her.”", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2018/04/Britney-Spears-Dancing.jpg", "https://secure.gravatar.com/avatar/43a780a749ecd62a2db75d60a4327bb4?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2018/06/Britney-Spears-Kevin-Federline-Reportedly-Feuding-Only-Speak-Through-Attorneys-Reports-ET.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Christopher Barilla"], "canonical_link": "https://www.inquisitr.com/4947310/britney-spears-family-afraid-shell-have-second-meltdown-over-kevin-federline-drama/", "title": "Britney Spears Family ‘Afraid’ She’ll Have Second Meltdown Over Kevin Federline Drama", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}