{"url": "https://web.archive.org/web/20070103020730/http://www.cdc.gov:80/nchs/products/pubs/pubd/hestats/prelimbirths05/prelimbirths05.htm", "text": "Births: Preliminary Data for 2005\n\nby Brady E. Hamilton, Ph.D.; Joyce A. Martin, M.P.H.; and Stephanie J. Ventura, M.A. Division of Vital Statistics\n\nThis report from the Centers for Disease Control and Prevention’s National Center for Health Statistics (NCHS) summarizes 2005 preliminary births and birth rates and selected 2005 preliminary maternal and infant health birth data for the United States. The findings come from a substantial portion of the records of births (99.2 percent) that occurred in calendar year 2005 and were received and processed by NCHS as of May 31, 2006. A report that includes both these demographic and health characteristics of births as well as state-based preliminary 2005 data is in preparation ( 1 ).\n\nResults from Preliminary Birth Data, 2005\n\nBirths and birth rates\n\nKey findings, illustrated in Tables 1-3, 5-8 , and Figures 1-3 , show:\n\nThe number of births and the general fertility rate (GFR) increased slightly, whereas the crude birth rate remained unchanged from 2004 to 2005. The preliminary estimate of births in 2005, 4,140,419, increased 1 percent from 2004 ( Tables 1 , 5 , 6 , and 8 ) ( 2 ). Births rose for Hispanic, American Indian or Alaska Native (AIAN), Asian or Pacific Islander (API), and non-Hispanic black women, but declined slightly for non-Hispanic white women. The crude birth rate in 2005 was 14.0 births per 1,000 total population, unchanged from 2004. The preliminary 2005 GFR (66.7 births per 1,000 women age 15-44 years), however, rose slightly from 2004, to the highest level since 1993 ( 2 ). The GFR rose for Hispanic and AIAN women, declined slightly for API women, and was essentially unchanged for non-Hispanic white and non-Hispanic black women.\n\nThe birth rate for teenagers declined 2 percent in 2005, falling to 40.4 births per 1,000 women aged 15-19 years, a 35-percent drop compared with the most recent peak in 1991 (61.8), and the lowest ever recorded in the 65 years for which a consistent series of rates is available ( Tables 2 , 5 , 7 , and Figures 1 and 2 ) ( 3 ).\n\nThe decline was concentrated among teenagers aged 15-17 years, for whom the birth rate fell 3 percent, to 21.4 births per 1,000, another record low for the Nation. The rate for this age group has dropped 45 percent since 1991 (38.6).\n\nThe rate for older teenagers, 18-19 years, essentially stable at 69.9 births per 1,000 according to preliminary data for 2005, was 26 percent lower than in 1991 (94.0). The birth rate for the youngest teenage group, 10-14 years, was unchanged in 2005, at 0.7 births per 1,000 females.\n\nAmong race and Hispanic origin subgroups, birth rates fell 3 percent each for non-Hispanic white and non-Hispanic black teenagers 15-19 years. The decline for young non-Hispanic black teenagers 15-17 years was 6 percent for 2004-2005 and 59 percent since 1991, the steepest reduction overall by race or age group.\n\nBirths to women in their early twenties increased slightly. The birth rate for women aged 20–24 years rose to 102.2 births per 1,000 women in 2005, less than 1 percent over the rate in 2004. The rate for women aged 25–29 years, the highest rate amongst the age groups, was essentially unchanged in 2005 (115.6) ( Tables 5 and 7 ).\n\nChildbearing by women in their thirties and forties continued to increase. The birth rate for women aged 30–34 years rose slightly between 2004 and 2005, to 95.9 births per 1,000, the highest rate since 1964. The rate for women aged 35-39 years rose to 46.3 births per 1,000, 2 percent over the rate in 2004 and the highest rate since 1965 [ 2 , 3 ]. The birth rate for women 40–44 years also rose by 2 percent, to 9.1, the highest rate since 1968, and the rate for women aged 45–49 years increased slightly, to 0.6 births per 1,000 women, the first increase in the rate since 2000 and the highest rate for this age group since 1970 ( Tables 5 and 7 ).\n\n\n\nAmong race and Hispanic origin groups, the rates for women aged 30-34 years increased for Hispanic and non-Hispanic black women (about 2 percent each) and decreased for API women (about 2 percent). The rates for non-Hispanic white and AIAN women were essentially unchanged in 2005. Rates for women aged 35-39 years increased by 2 percent for women in each of the three largest groups (non-Hispanic whites, Hispanics, and non-Hispanic blacks). The rates for the remaining groups were essentially unchanged.\n\nThe total fertility rate (TFR) rose slightly in 2005 to 2,054.0, compared with 2,045.5 in 2004 ( Table 1 ) ( 2 ). The TFR summarizes the potential impact of current fertility patterns on completed family size to estimate the average number of births that a hypothetical group of 1,000 women would have over their lifetimes. The total fertility rate by race and Hispanic origin increased significantly in 2005 for only Hispanic women (2 percent), and decreased significantly for only non-Hispanic white women (less than 1 percent) ( Table 1 ). Rates for non-Hispanic black, AIAN, and API women were essentially unchanged between 2004 and 2005.\n\nThe first birth rate for women aged 15-44 years was 26.5 births per 1,000, a slight increase over the rate in 2004 ( Table 7 ). The first birth rates for women aged 20-24 and 35-39 years increased between 2004 and 2005 by 2 and 1 percent, respectively, whereas rates for women aged 15-19, 25-29, and 30-34 years decreased by 1 to 2 percent. Rates for women 40 years of age and over were unchanged.\n\nCrude birth rates (CBR) vary considerably among states ranging, in 2005, from 10.4 births per 1,000 total population in Vermont to 20.9 in Utah ( Table 8 ). There were generally only small changes in the birth rates for most states in 2005 compared with 2004; rates in 10 states declined significantly (Hawaii, Illinois, Louisiana, Massachusetts, Michigan, Mississippi, New Jersey, New York, Texas, and Utah) and rates in 7 states (Alabama, Florida, Iowa, Nevada, North Carolina, Tennessee, and Wyoming) increased significantly.\n\n\n\nFertility rates also vary considerably among states, ranging from 51.0 births per 1,000 women age 15-44 years in Vermont to 90.4 in Utah (see Table 8 ). General fertility rates for most states changed relatively little between 2004 and 2005, like the CBR, however, rates for 16 states increased significantly (Alabama, California, Florida, Iowa, Kentucky, Missouri, Nevada, North Carolina, North Dakota, Ohio, Pennsylvania, South Carolina, Tennessee, Texas, Wisconsin, and Wyoming), whereas rates for 3 states (Louisiana, New York, and Utah) decreased significantly.\n\nAll measures of childbearing by unmarried women increased to record levels for the Nation in 2005 according to preliminary data ( 2 , 4 ). The total number of births rose 4 percent to 1,525,345, compared with 1,470,189 in 2004. During 2002-2005, the number increased 12 percent overall.\n\nThe birth rate increased 3 percent in 2005 to 47.6 per 1,000 unmarried women aged 15-44 years, up from 46.1 in 2004.\n\nThe proportion of births to unmarried women increased in 2005 to 36.8 percent, compared with 35.8 percent in 2004. The proportions increased for all population subgroups by race and Hispanic origin ( Table 1 and Figure 3 ).\n\nIn 2005, well over four in five births to teenagers were nonmarital ( Table 3 ). Over one-half of births to women aged 20-24 years and nearly 3 in 10 births to women aged 25-29 years were to unmarried women.\n\nMaternal and Infant Health Birth Characteristics\n\nKey findings, illustrated in Table 4 and Figures 4 and 5 , show:\n\nThe preliminary rate of cesarean delivery rose 4 percent in 2005 to 30.2 percent of all births, another record high for the Nation ( Table 4 ). The cesarean rate declined somewhat during the early and mid-1990s, but has risen 46 percent since 1996 (from 20.7 percent). Rates were up in 2005 for non-Hispanic white, non-Hispanic black, AIAN, API, and Hispanic women, and also for each 5-year age group. Since 1996, rates have risen by more than 40 percent for all age groups, including for young women under 20 years of age (see Figure 4 ). (For information on trends for 1989 to 2004 in primary cesarean deliveries and vaginal births after a previous cesarean, see “Births: Final Data for 2004” ( 2 ).)\n\nThe preterm birth rate rose from 12.5 to 12.7 percent for 2004-2005 (see Figure 5 ). The percentage of infants delivered at less than 37 completed weeks of gestation has risen 20 percent since 1990 (from 10.6 percent) ( 2 ). Preterm rates rose significantly for non-Hispanic white (11.7 percent for 2005), non-Hispanic black (18.4 percent) and Hispanic infants (12.1 percent) between 2004 and 2005. Rates for non-Hispanic white and Hispanic births have been rising for more than a decade, increasing 38 percent for non-Hispanic white, and 10 percent for Hispanic infants since 1990. The preterm rate for black infants declined modestly during the 1990s, but has been on the rise since the year 2000. Although the upswing in multiple births has had an important influence on recent trends in preterm birth rates, shorter gestations have also risen among singleton deliveries ( 2 ).\n\nThe proportion of all infants born very preterm (less than 32 completed weeks of gestation) rose very slightly between 2004 and 2005 (from 2.01 to 2.03 percent). Late preterm births (34-36 weeks) increased more markedly, from 8.9 to 9.1 percent for the same period. No significant change was observed in the percentage of 32-33 week births. Much of the upturn in the preterm rate over recent years can be attributed to increases in late preterm births ( 2 ), Figure 5 . Although at lower risk than those born at earlier gestational ages, infants delivered late preterm are at greater risk of compromised pregnancy outcome than those born later in pregnancy ( 5 , 6 ).\n\nThe percentage of infants born low birthweight also increased in 2005, to 8.2 percent of all births, from 8.1 percent in 2004 ( Table 4 ). The percentage of infants born low birthweight (less than 2,500 grams) has increased more than 20 percent since the mid-1980s (from 6.7) ( 2 ); the 2005 level is the highest level reported since 1968 ( 7 ). Low birthweight rates rose 1 to 2 percent for non-Hispanic white, non-Hispanic black, and Hispanic infants between 2004 and 2005. Among all births, levels of both very low (less than 1,500 grams), and moderately low birthweight (1,500-2,499 grams) increased slightly for the current year.\n\nReferences\n\n1. Hamilton BE, Martin JA, Ventura SJ. Births: Preliminary data for 2005. National vital statistics reports; vol 55. Hyattsville, MD: National Center for Health Statistics. Forthcoming.\n\n2. Martin JA, Hamilton BE, Sutton PD, et al. Births: Final data for 2004. National vital statistics reports; vol 55 no 1. Hyattsville, MD: National Center for Health Statistics. 2006. Available from: http://www.cdc.gov/nchs/data/nvsr/nvsr55/ nvsr55_01.pdf.\n\n3. National Center for Health Statistics. Vital statistics of the United States, 2001, volume I, natality. Available from: http://www.cdc.gov/nchs/datawh/statab/unpubd/ natality/natab2001.htm.\n\n4. Ventura SJ, Bachrach CA. Nonmarital childbearing in the United States, 1940-99. National vital Statistics reports; vol 48 no 16. Hyattsville, MD: National Center for Health Statistics. 2000. Available from: http://www.cdc.gov/nchs/data/nvsr/ nvsr48/nvs48_16.pdf.\n\n5. Mathews TJ, MacDorman MF. Infant mortality statistics from the 2003 period linked birth/infant death data set. National vital statistics reports; vol 54 no16. Hyattsville, MD: National Center for Health Statistics. 2006. Available from: http://www.cdc. gov/nchs/data/nvsr/nvsr54/nvsr54_16.pdf.\n\n6. Wang ML, Dorer DJ, Fleming MP, Catlin EA. Clinical outcomes of near-term infants. Pediatrics 114(2):372-6. 2006.\n\n7. National Center for Health Statistics. Vital statistics of the United States, 1968, vol I natality. U.S. Department of Health, Education and Welfare. Public Health Service. Rockville, MD. 1970. Available from: http://www.cdc.gov/nchs/data/vsus/vsus_1968_1.pdf.\n\n8. National Center for Health Statistics. Technical Appendix. Vital statistics of the United States, 2004, vol I natality. U.S. Department of Health and Human Services, Centers for Disease Control and Prevention, National Center for Health Statistics. Hyattsville, MD. Available from: http://www.cdc.gov/ nchs/births.htm and included on the forthcoming CD-ROM titled Vital Statistics of the United States, vol 1, Natality, 2006.\n\n9. National Center for Health Statistics. U.S. Certificate of Live Birth. 2003. Available from: http://www.cdc.gov/ nchs/data/dvs/birth11-03final-ACC.pdf.\n\n10. National Center for Health Statistics. 2003 revisions of the U.S. Standard Certificates of Live Birth. 2003. Available from: http://www.cdc.gov/nchs/vital_certs_rev.htm.\n\n11. National Center for Health Statistics. Report of the Panel to Evaluate the U.S. Standard Certificates and Reports. National Center for Health Statistics. 2000. Available from: http://www.cdc.gov/nchs/data/dvs/panelreport_acc.pdf.\n\n12. Office of Management and Budget. Revisions to the standards for the classification of federal data on race and ethnicity. Federal Register 62FR58781-58790. October 30, 1997. Available from: http://www.whitehouse.gov/omb/fedreg/ombdir15.html.\n\n13. Office of Management and Budget. Race and ethnic standards for federal statistics and administrative reporting. Statistical Policy Directive 15. May 12, 1977.\n\n14. National Center for Health Statistics. Postcensal estimates of the resident population of the United States as of July 1, 2005, by year, state and county, age, bridged race, sex, and Hispanic origin (vintage 2005). File pcen_v2005_y05.txt (ASCII). Released August 16, 2006. Available from: http://www.cdc.gov/nchs/ about/major/dvs/popbridge/datadoc.htm.\n\n15. U.S. Census Bureau. America’s Families and Living Arrangements: 2005. Fertility and Family Statistics Branch. Available from: http://www.census.gov/population/ www/socdemo/hh-fam.html.\n\nTechnical Notes\n\nNature and sources of data\n\nPreliminary data for 2005 are based on a substantial proportion of births for that year (99.2 percent). The data for 2005 are based on a continuous receipt and processing of statistical records through May 31, 2006, by the Centers for Disease Control and Prevention’s National Center for Health Statistics (NCHS). NCHS receives the data from the states’ vital registration systems through the Vital Statistics Cooperative Program. In this report, U.S. totals include only events occurring within the 50 states and the District of Columbia. Detailed information on reporting completeness and imputation procedures may be found in the “Technical Appendix” of Vital Statistics of the United States, 2004, Natality (8).\n\nTo produce the preliminary estimates shown in this report, records in the file were weighted using independent control counts of all 2005 births by state of occurrence. Detailed information on weighting is available elsewhere (8). Detailed information on the reliability of estimates also may be found elsewhere (1).\n\nThe 1989 and 2003 U.S. Standard Certificates of Live Birth\n\nThis report includes selected 2005 data on items that are collected on both the 1989 Revision of the U.S. Standard Certificate of Live Birth (unrevised) and 2003 Revision of the U.S. Standard Certificate of Live Birth (revised). The 2003 revision is described in detail elsewhere (2,9-11). Twelve states and one U.S. territory (Florida, Idaho, Kansas, Kentucky, Nebraska, New Hampshire, New York State (excluding New York City), Pennsylvania, Puerto Rico, South Carolina, Tennessee, Texas, and Washington) implemented the revised certificate as of January 1, 2005. One additional state, Vermont, implemented the revised birth certificate in 2005, but after January 1. These 13 states represent 30.8 percent of all 2005 births; the 12 states that implemented as of January 1, 2005, represent 30.6 percent of all births.\n\nHispanic origin and race\n\nHispanic origin\n\nRace and Hispanic origin are reported separately on the birth certificate. Data shown by race (i.e., American Indian or Alaska Native and Asian or Pacific Islander) include persons of Hispanic or non-Hispanic origin, and data for Hispanic origin include persons of any race. Data shown for Hispanic persons include all persons of Hispanic origin of any race. Data are shown separately for non-Hispanic white women because there are substantial differences in childbearing patterns between Hispanic and non-Hispanic white women.\n\nSingle, multiple, and “bridged” race\n\nThe 2003 revision of the U.S. Standard Certificate of Live Birth allows the reporting of more than one race (multiple races) for each parent (9). Information on this change is presented in a recent report (2).\n\nIn 2005, multiple race was reported by Florida, Idaho, Kansas, Kentucky, Nebraska, New Hampshire, New York State (excluding New York City), Pennsylvania, South Carolina, Tennessee, Texas, Vermont (for births occurring from July 1, 2005, only), and Washington, which used the 2003 revision of the U.S. Standard Certificate of Live Birth, as well as, California, Hawaii, Michigan (for births at selected facilities only), Ohio, Utah, and Minnesota, which used the 1989 revision of the U.S. Standard Certificate of Live Birth. In addition, multiple race was also reported by Puerto Rico. Data from the vital records of the remaining 31 states, New York City, and the District of Columbia are based on the 1989 revision of the U.S. Standard Certificate of Live Birth that follows the 1977 Office of Management and Budget (OMB) standard, allowing only a single race to be reported (11-13).\n\nIn order to provide uniformity and comparability of the data during the transition period, before all or most of the data are available in the new multiple race format, it was necessary to “bridge” the responses of those who reported more than one race (multiple race) to one, single race (see “Population denominators”). Information on the processing and tabulation of data by race is presented in a recent report (2)\n\nMarital status\n\nNational estimates of births to unmarried women are based on two methods of determining marital status. For 2004 and 2005, birth certificates in 48 states and the District of Columbia included a direct question about mother’s marital status; in two of these states, California and Nevada, a direct question is part of the electronic birth registration process but does not appear on certified or paper copies of the birth certificate. The question in most states is: “Mother married? (At birth, conception, or any time between) (Yes or no)”. Marital status is inferred in Michigan and New York. A birth is inferred as nonmarital if a paternity acknowledgment was filed or if the father’s name is missing from the birth certificate (listed in respective priority-of-use order).\n\nPopulation denominators\n\nBirth and fertility rates for 2005 shown in this report are based on population estimates based on the 2000 census, as of July 1, 2005. These population estimates are available on the NCHS Web- page (14). The production of these population estimates is described in detail in a recent report (2).\n\nInformation on the national estimates of births to unmarried women (i.e., methods of determining marital status) and the computation of the preliminary birth rates for unmarried women is presented elsewhere (1). The birth rate for unmarried women for 2005 is estimated on the basis of population distributions by marital status provided by the U.S. Census Bureau as of March 2005 applied to the national population estimates as of July 1 (4,14,15). Both population files are 2000 census based. The nonmarital birth rate shown here for 2005 thus differs from those published by NCHS in the annual final reports, which are based on populations estimated from 3-year averages of the marital status distributions, rather than a single year as shown here (4). Population estimates for a single year are not an adequate basis for computing age-specific birth rates for unmarried women—these rates are available only in reports based on final data.\n\nSuggested citation\n\nHamilton BE, Martin JA, Ventura SJ. Births: Preliminary data for 2005. Health E-Stats. Released November 21, 2006.\n\nAcknowledgments\n\nThis report was prepared under the general direction of Stephanie J. Ventura, Chief of the Reproductive Statistics Branch (RSB) and Charles J. Rothwell, Director of the Division of Vital Statistics (DVS). Nicholas F. Pace, Chief of the Systems, Programming, and Statistical Resources Branch (SPSRB), Steven J. Steimel, Candace M. Cosgrove, David P. Johnson, Annie Liu, Sergey Yagodin, Manju Sharma, Jordan A. Sacks, and Bonita W. Gross provided computer programming support and statistical tables. Steven J. Steimel of SPSRB prepared the natality file. Paul D. Sutton (RSB) contributed to the “Technical Notes” and with Thomas D. Dunn (SPSRB), provided content review. Staff of the Data Acquisition and Evaluation Branch carried out quality evaluation and acceptance procedures for the state data files on which this report is based. The Registration Methods staff of DVS consulted with state vital statistics offices regarding the collection of birth certificate data. This report was edited by Demarius V. Miller, Office of Information Services, Information Design and Publishing Staff; graphics produced by Tommy C. Seibert, Jr., of CoCHIS/NCHM/Division of Creative Services; and formatted and posted on the Internet by Christine J. Brown, Office of Information Services, Information Design and Publishing Staff.", "images": ["https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/navimages/nav14.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/images/nchshd.jpg", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r18_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r15_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r22_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/navimages/nav13.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r14_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r26_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/products/pubs/pubd/hestats/prelimbirths05/Figure3.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r25_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r27_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r31_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/products/pubs/pubd/hestats/prelimbirths05/Figure5.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/navimages/nav15.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/products/pubs/pubd/hestats/prelimbirths05/Figure1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/navimages/spacer.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r19_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r20_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r2_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/images/indent.gif", "https://web.archive.org/web/20070103020730im_/http://mtrics.cdc.gov/b/ss/cdcgov/1/G.5--NS/0?cl=Session", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/images/healthestats3.jpg", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r3_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/navimages/nav11.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r17_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r6_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/products/pubs/pubd/hestats/prelimbirths05/Figure4.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/spacer.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r5_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r11_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r1_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/images/hhslogo.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r9_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/navimages/nav12.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r29_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r7_c2.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r8_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/products/pubs/pubd/hestats/prelimbirths05/Figure2.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r10_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/images/bullet.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/images/bullet_sub_1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r13_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r24_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r12_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r21_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r16_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r30_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r28_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r32_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r4_c1.gif", "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/bots/homebot_r23_c1.gif"], "top_img": "https://web.archive.org/web/20070103020730im_/http://www.cdc.gov/nchs/products/pubs/pubd/hestats/prelimbirths05/Figure3.gif", "keywords": [], "authors": [], "canonical_link": "", "title": "Births: Preliminary Data for 2005", "meta_data": {}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}