{"url": "https://www.flickr.com/photos/138991380@N06/24229484207/", "text": "Celebrate #Taylor-Swift's Birthday With 28 of Her #Impressive #Milestones\n\nTaylor Swift might solely be 28 years previous, however judging by this checklist of milestones, lots of her wildest goals have already come true.\n\nIn honor of the megastar’s birthday at the moment, Swifties everywhere in the world are celebrating in her honor. As some followers...\n\ntakenews.net/celebrate-taylor-swifts-birthday-with-28-of-...\n\ntakenews.net/wp-content/uploads/2017/12/rs_1024x759-17121...\n\nTaylor Swift might solely be 28 years previous, however judging by this checklist of milestones, lots of her wildest goals have already come true.\n\nIn honor of the megastar’s birthday at the moment, Swifties everywhere in the world are celebrating in her honor. As some followers highlighted on-line, the songstress precisely predicted early on that she could be a fantastic success by this level in her life.\n\n“I might be, hopefully, headlining and I’d like to, you understand, simply be doing nice touring and nonetheless be placing out profitable albums and having the albums’ materials develop with me and by no means, ever alienate my followers, ever,” Swift mentioned in a 2007 interview with the Nice American Nation cable community in response to a query about what she could be as much as at 28. “It is all the time going to be all concerning the followers and I hope that that by no means modifications.”\n\nNow, as she formally toasts to 28 years, we surprise if she really anticipated simply how a lot she would obtain within the scope of a decade. Setting a number of Guinness World Information? 4 Vogue covers? Making the best-selling album of the yr…3 times?\n\nAs followers have a good time the star’s special occasion, here is 28 of the spectacular milestones she’s reached within the final 28 years:\n\n1. In 2010, Swift turned the youngest foremost artist to win the Grammy Award for Album of the Yr in 2010 for her second studio album, Fearless. She was 20 years previous on the time.\n\n2. Swift’s Fearless turned the best-selling album of 2009, making her the youngest artist to have a best-selling album of the yr.\n\nthree. At 14 years previous, Swift turned the youngest songwriter ever signed to Sony/ATV Music Publishing.\n\nfour. 5 of her six studio albums have peaked at primary on the Billboard 200 and all six have peaked within the high ten.\n\n5. In 2016, she turned the primary girl to win the Grammy’s Album of the Yr greater than as soon as after she gained for 1989.\n\n6. Swift at the moment holds the file for many Billboard Music Awards with 21 awards.\n\n7. In 2008, she acquired her first Grammy Award nomination—for Greatest New Artist. In 2010, she gained for the primary time. She has collected 10 Grammy Awards in complete and 31 nominations.\n\neight. Her 1989 tour turned 2015’s highest grossing live performance tour with roughly $250 million in gross sales worldwide.\n\n9. In 2006, her debut album, Taylor Swift, turned 7-times multi-platinum licensed, the to start with six studio albums to go platinum.\n\n10. Her lyric video for “Look What You Made Me Do” turned the most-watched lyric video of all time in August 2017.\n\n11. The music video for “Look What You Made Me Do” gave Swift her greatest YouTube debut, but in addition turned probably the most seen music video in its first 24 hours in historical past with greater than 43 million views.\n\n12. In only one week, Fame offered 1.22 million copies, making it the highest promoting album of 2017—and her second time reaching the feat.\n\n13. In 2009, Swift each hosted Saturday Evening Dwell and carried out because the musical visitor. She’s appeared as a musical visitor two different occasions.\n\n14. Since 2012, she’s had 5 primary songs on Billboard’s Sizzling 100.\n\n15. In 2017, she was included as one in all Time‘s Individuals of the Yr, the “Silence Breakers.”\n\n16. “Look What You Made Me Do” set a brand new file for many performs generated by any track in someday since Spotify launched.\n\n17. In 2010, Swift set a brand new Guinness World Document for the fastest-selling digital album within the USA by a feminine artist with Converse Now.\n\n18. In 2010, she set a brand new Guinness World Document for many simultaneous U.S. sizzling 100 hits by a feminine with 11 tracks on the chart, 10 of which have been making their chart debut.\n\n19. In 2009, she gained her first MTV Video Music Award for “You Belong With Me.” She’s gone on to win six extra and 17 nominations.\n\n20. In 2012, she appeared on the duvet of Vogue for the primary time. She’s appeared on the American cowl two extra occasions since.\n\n21. In 2010, she made her film debut in Valentine’s Day.\n\n22. She was nominated for her first Golden Globe Award in 2013 for “Greatest Unique Tune,” She’s been nominated a second time since.\n\n23. She gained her first Emmy Award nomination, for Unique Interactive Program, in 2015. In 2016, she set a Guinness World Document for highest annual earnings ever for a feminine pop star with estimated incomes of $170 million.\n\n24. In 2017, Fearless was licensed diamond by the RIAA, that means it had achieved gross sales and streams exceeding 10 million album models.\n\n25. In 2010, Swift was listed as one in all Time‘s most influential individuals on the planet within the annual 100 difficulty.\n\n26. In 2008, she was included in Individuals‘s “World’s Most Lovely Individuals.”\n\n27. She was nominated for her first American Music Award in 2007 and gained her first awards in 2008, amongst them Artist of the Yr. She has gained 19 in complete and has been nominated 25 occasions.\n\n28. Her second studio album, Fearless, gained the Nation Music Affiliation, Academy of Nation Music Award and Grammy Award for Album of the Yr.\n\nThat is actually an inventory to be happy with. Glad Birthday, Taylor!\n\nDone", "images": ["https://live.staticflickr.com/4594/24229484207_7b8b8591eb_n.jpg", "https://live.staticflickr.com/4594/24229484207_7b8b8591eb.jpg", "https://live.staticflickr.com/4594/24229484207_7b8b8591eb_b.jpg"], "top_img": "https://live.staticflickr.com/4594/24229484207_7b8b8591eb_b.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.flickr.com/photos/138991380@N06/24229484207", "title": "Celebrate #Taylor-Swift's Birthday With 28 of Her #Impressive #Milestones", "meta_data": {"fb": {"app_id": 137206539707334}, "og": {"site_name": "Flickr", "updated_time": "2020-04-18T12:33:30.868Z", "title": "Celebrate #Taylor-Swift's Birthday With 28 of Her #Impressive #Milestones", "description": "Taylor Swift  might solely be 28 years previous, however judging by this checklist of milestones, lots of her wildest goals have already come true. In honor of the megastar’s birthday at the moment, Swifties everywhere in the world are celebrating in her honor. As some followers...   takenews.net/celebrate-taylor-swifts-birthday-with-28-of-...  takenews.net/wp-content/uploads/2017/12/rs_1024x759-17121...  Taylor Swift  might solely be 28 years previous, however judging by this checklist of milestones, lots of her wildest goals have already come true. In honor of the megastar’s birthday at the moment, Swifties everywhere in the world are celebrating in her honor. As some followers highlighted on-line, the songstress precisely predicted early on that she could be a fantastic success by this level in her life. “I might be, hopefully, headlining and I’d like to, you understand, simply be doing nice touring and nonetheless be placing out profitable albums and having the albums’ materials develop with me and by no means, ever alienate my followers, ever,” Swift mentioned in a 2007 interview with the Nice American Nation cable community in response to a query about what she could be as much as at 28. “It is all the time going to be all concerning the followers and I hope that that by no means modifications.” Now, as she formally toasts to 28 years, we surprise if she really anticipated simply how a lot she would obtain within the scope of a decade. Setting a number of Guinness World Information? 4 Vogue covers? Making the best-selling album of the yr…3 times? As followers have a good time the star’s special occasion, here is 28 of the spectacular milestones she’s reached within the final 28 years: 1. In 2010, Swift turned the youngest foremost artist to win the Grammy Award for Album of the Yr in 2010 for her second studio album, Fearless. She was 20 years previous on the time. 2. Swift’s Fearless turned the best-selling album of 2009, making her the youngest artist to have a best-selling album of the yr. three. At 14 years previous, Swift turned the youngest songwriter ever signed to Sony/ATV Music Publishing. four. 5 of her six studio albums have peaked at primary on the Billboard 200 and all six have peaked within the high ten. 5. In 2016, she turned the primary girl to win the Grammy’s Album of the Yr greater than as soon as after she gained for 1989. 6. Swift at the moment holds the file for many Billboard Music Awards with 21 awards. 7. In 2008, she acquired her first Grammy Award nomination—for Greatest New Artist. In 2010, she gained for the primary time. She has collected 10 Grammy Awards in complete and 31 nominations. eight. Her 1989 tour turned 2015’s highest grossing live performance tour with roughly $250 million in gross sales worldwide. 9. In 2006, her debut album, Taylor Swift, turned 7-times multi-platinum licensed, the to start with six studio albums to go platinum. 10. Her lyric video for “Look What You Made Me Do” turned the most-watched lyric video of all time in August 2017. 11. The music video for “Look What You Made Me Do” gave Swift her greatest YouTube debut, but in addition turned probably the most seen music video in its first 24 hours in historical past with greater than 43 million views. 12. In only one week, Fame offered 1.22 million copies, making it the highest promoting album of 2017—and her second time reaching the feat. 13. In 2009, Swift each hosted Saturday Evening Dwell and carried out because the musical visitor. She’s appeared as a musical visitor two different occasions. 14. Since 2012, she’s had 5 primary songs on Billboard’s Sizzling 100. 15. In 2017, she was included as one in all Time‘s Individuals of the Yr, the “Silence Breakers.” 16. “Look What You Made Me Do” set a brand new file for many performs generated by any track in someday since Spotify launched. 17. In 2010, Swift set a brand new Guinness World Document for the fastest-selling digital album within the USA by a feminine artist with Converse Now. 18. In 2010, she set a brand new Guinness World Document for many simultaneous U.S. sizzling 100 hits by a feminine with 11 tracks on the chart, 10 of which have been making their chart debut. 19. In 2009, she gained her first MTV Video Music Award for “You Belong With Me.” She’s gone on to win six extra and 17 nominations. 20. In 2012, she appeared on the duvet of Vogue for the primary time. She’s appeared on the American cowl two extra occasions since. 21. In 2010, she made her film debut in Valentine’s Day. 22. She was nominated for her first Golden Globe Award in 2013 for “Greatest Unique Tune,” She’s been nominated a second time since. 23. She gained her first Emmy Award nomination, for Unique Interactive Program, in 2015. In 2016, she set a Guinness World Document for highest annual earnings ever for a feminine pop star with estimated incomes of $170 million. 24. In 2017, Fearless was licensed diamond by the RIAA, that means it had achieved gross sales and streams exceeding 10 million album models. 25. In 2010, Swift was listed as one in all Time‘s most influential individuals on the planet within the annual 100 difficulty. 26. In 2008, she was included in Individuals‘s “World’s Most Lovely Individuals.” 27. She was nominated for her first American Music Award in 2007 and gained her first awards in 2008, amongst them Artist of the Yr. She has gained 19 in complete and has been nominated 25 occasions. 28. Her second studio album, Fearless, gained the Nation Music Affiliation, Academy of Nation Music Award and Grammy Award for Album of the Yr. That is actually an inventory to be happy with. Glad Birthday, Taylor!", "type": "article", "url": "https://www.flickr.com/photos/138991380@N06/24229484207/", "image": {"identifier": "https://live.staticflickr.com/4594/24229484207_7b8b8591eb_b.jpg", "width": 1024, "height": 759}}, "robots": "noarchive", "googlebot": "noarchive", "al": {"ios": {"app_name": "Flickr", "app_store_id": 328407587, "url": "flickr://flickr.com/photos/138991380@N06/24229484207"}}, "twitter": {"app": {"name": {"iphone": "Flickr"}, "id": {"iphone": 328407587}, "url": {"iphone": "flickr://flickr.com/photos/138991380@N06/24229484207/"}}, "site": "@flickr", "card": "photo", "description": "Taylor Swift  might solely be 28 years previous, however judging by this checklist of milestones, lots of her wildest goals have already come true. In honor of the megastar’s birthday at the moment, Swifties everywhere in the world are celebrating in her honor. As some followers...   takenews.net/celebrate-taylor-swifts-birthday-with-28-of-...  takenews.net/wp-content/uploads/2017/12/rs_1024x759-17121...  Taylor Swift  might solely be 28 years previous, however judging by this checklist of milestones, lots of her wildest goals have already come true. In honor of the megastar’s birthday at the moment, Swifties everywhere in the world are celebrating in her honor. As some followers highlighted on-line, the songstress precisely predicted early on that she could be a fantastic success by this level in her life. “I might be, hopefully, headlining and I’d like to, you understand, simply be doing nice touring and nonetheless be placing out profitable albums and having the albums’ materials develop with me and by no means, ever alienate my followers, ever,” Swift mentioned in a 2007 interview with the Nice American Nation cable community in response to a query about what she could be as much as at 28. “It is all the time going to be all concerning the followers and I hope that that by no means modifications.” Now, as she formally toasts to 28 years, we surprise if she really anticipated simply how a lot she would obtain within the scope of a decade. Setting a number of Guinness World Information? 4 Vogue covers? Making the best-selling album of the yr…3 times? As followers have a good time the star’s special occasion, here is 28 of the spectacular milestones she’s reached within the final 28 years: 1. In 2010, Swift turned the youngest foremost artist to win the Grammy Award for Album of the Yr in 2010 for her second studio album, Fearless. She was 20 years previous on the time. 2. Swift’s Fearless turned the best-selling album of 2009, making her the youngest artist to have a best-selling album of the yr. three. At 14 years previous, Swift turned the youngest songwriter ever signed to Sony/ATV Music Publishing. four. 5 of her six studio albums have peaked at primary on the Billboard 200 and all six have peaked within the high ten. 5. In 2016, she turned the primary girl to win the Grammy’s Album of the Yr greater than as soon as after she gained for 1989. 6. Swift at the moment holds the file for many Billboard Music Awards with 21 awards. 7. In 2008, she acquired her first Grammy Award nomination—for Greatest New Artist. In 2010, she gained for the primary time. She has collected 10 Grammy Awards in complete and 31 nominations. eight. Her 1989 tour turned 2015’s highest grossing live performance tour with roughly $250 million in gross sales worldwide. 9. In 2006, her debut album, Taylor Swift, turned 7-times multi-platinum licensed, the to start with six studio albums to go platinum. 10. Her lyric video for “Look What You Made Me Do” turned the most-watched lyric video of all time in August 2017. 11. The music video for “Look What You Made Me Do” gave Swift her greatest YouTube debut, but in addition turned probably the most seen music video in its first 24 hours in historical past with greater than 43 million views. 12. In only one week, Fame offered 1.22 million copies, making it the highest promoting album of 2017—and her second time reaching the feat. 13. In 2009, Swift each hosted Saturday Evening Dwell and carried out because the musical visitor. She’s appeared as a musical visitor two different occasions. 14. Since 2012, she’s had 5 primary songs on Billboard’s Sizzling 100. 15. In 2017, she was included as one in all Time‘s Individuals of the Yr, the “Silence Breakers.” 16. “Look What You Made Me Do” set a brand new file for many performs generated by any track in someday since Spotify launched. 17. In 2010, Swift set a brand new Guinness World Document for the fastest-selling digital album within the USA by a feminine artist with Converse Now. 18. In 2010, she set a brand new Guinness World Document for many simultaneous U.S. sizzling 100 hits by a feminine with 11 tracks on the chart, 10 of which have been making their chart debut. 19. In 2009, she gained her first MTV Video Music Award for “You Belong With Me.” She’s gone on to win six extra and 17 nominations. 20. In 2012, she appeared on the duvet of Vogue for the primary time. She’s appeared on the American cowl two extra occasions since. 21. In 2010, she made her film debut in Valentine’s Day. 22. She was nominated for her first Golden Globe Award in 2013 for “Greatest Unique Tune,” She’s been nominated a second time since. 23. She gained her first Emmy Award nomination, for Unique Interactive Program, in 2015. In 2016, she set a Guinness World Document for highest annual earnings ever for a feminine pop star with estimated incomes of $170 million. 24. In 2017, Fearless was licensed diamond by the RIAA, that means it had achieved gross sales and streams exceeding 10 million album models. 25. In 2010, Swift was listed as one in all Time‘s most influential individuals on the planet within the annual 100 difficulty. 26. In 2008, she was included in Individuals‘s “World’s Most Lovely Individuals.” 27. She was nominated for her first American Music Award in 2007 and gained her first awards in 2008, amongst them Artist of the Yr. She has gained 19 in complete and has been nominated 25 occasions. 28. Her second studio album, Fearless, gained the Nation Music Affiliation, Academy of Nation Music Award and Grammy Award for Album of the Yr. That is actually an inventory to be happy with. Glad Birthday, Taylor!"}, "description": "Taylor Swift  might solely be 28 years previous, however judging by this checklist of milestones, lots of her wildest goals have already come true.\n\tIn honor of the megastar&#8217;s birthday at the moment, Swifties everywhere in the world are celebrating in her honor. As some followers... \n\t\n\t<a href=\"https://takenews.net/celebrate-taylor-swifts-birthday-with-28-of-her-impressive-milestones/\" rel=\"noreferrer nofollow\">takenews.net/celebrate-taylor-swifts-birthday-with-28-of-...</a>\n\t\n\t<a href=\"https://takenews.net/wp-content/uploads/2017/12/rs_1024x759-171213140401-1024-taylor-swift-121317.jpg\" rel=\"noreferrer nofollow\">takenews.net/wp-content/uploads/2017/12/rs_1024x759-17121...</a>\n\t\n\t<strong>Taylor Swift </strong> might solely be 28 years previous, however judging by this checklist of milestones, lots of her wildest goals have already come true.\n\tIn honor of the megastar&#8217;s birthday at the moment, Swifties everywhere in the world are celebrating in her honor. As some followers highlighted on-line, the songstress precisely predicted early on that she could be a fantastic success by this level in her life.\n\t&#8220;I might be, hopefully, headlining and I&#8217;d like to, you understand, simply be doing nice touring and nonetheless be placing out profitable albums and having the albums&#8217; materials develop with me and by no means, ever alienate my followers, ever,&#8221; Swift mentioned in a 2007 interview with the Nice American Nation cable community in response to a query about what she could be as much as at 28. &#8220;It is all the time going to be all concerning the followers and I hope that that by no means modifications.&#8221;\n\tNow, as she formally toasts to 28 years, we surprise if she really anticipated simply <em>how</em> a lot she would obtain within the scope of a decade. Setting a number of Guinness World Information? 4 <em>Vogue</em> covers? Making the best-selling album of the yr&#8230;3 times?\n\tAs followers have a good time the star&#8217;s special occasion, here is 28 of the spectacular milestones she&#8217;s reached within the final 28 years:\n\t1. In 2010, Swift turned the youngest foremost artist to win the Grammy Award for Album of the Yr in 2010 for her second studio album, <em>Fearless</em>. She was 20 years previous on the time.\n\t2. Swift&#8217;s <em>Fearless</em> turned the best-selling album of 2009, making her the youngest artist to have a best-selling album of the yr.\n\tthree. At 14 years previous, Swift turned the youngest songwriter ever signed to Sony/ATV Music Publishing.\n\tfour. 5 of her six studio albums have peaked at primary on the Billboard 200 and all six have peaked within the high ten.\n\t5. In 2016, she turned the primary girl to win the Grammy&#8217;s Album of the Yr greater than as soon as after she gained for <em>1989</em>.\n\t6. Swift at the moment holds the file for many Billboard Music Awards with 21 awards.\n\t7. In 2008, she acquired her first Grammy Award nomination—for Greatest New Artist. In 2010, she gained for the primary time. She has collected 10 Grammy Awards in complete and 31 nominations.\n\teight. Her <em>1989</em> tour turned 2015&#8217;s highest grossing live performance tour with roughly $250 million in gross sales worldwide.\n\t9. In 2006, her debut album, <em>Taylor Swift</em>, turned 7-times multi-platinum licensed, the to start with six studio albums to go platinum.\n\t10. Her lyric video for &#8220;Look What You Made Me Do&#8221; turned the most-watched lyric video of all time in August 2017.\n\t11. The music video for &#8220;Look What You Made Me Do&#8221; gave Swift her greatest YouTube debut, but in addition turned probably the most seen music video in its first 24 hours in historical past with greater than 43 million views.\n\t12. In only one week, <em>Fame</em> offered 1.22 million copies, making it the highest promoting album of 2017—and her second time reaching the feat.\n\t13. In 2009, Swift each hosted <em>Saturday Evening Dwell</em> and carried out because the musical visitor. She&#8217;s appeared as a musical visitor two different occasions.\n\t14. Since 2012, she&#8217;s had 5 primary songs on Billboard&#8217;s Sizzling 100.\n\t15. In 2017, she was included as one in all <em>Time</em>&#8216;s Individuals of the Yr, the &#8220;Silence Breakers.&#8221;\n\t16. &#8220;Look What You Made Me Do&#8221; set a brand new file for many performs generated by any track in someday since Spotify launched.\n\t17. In 2010, Swift set a brand new Guinness World Document for the fastest-selling digital album within the USA by a feminine artist with <em>Converse Now</em>.\n\t18. In 2010, she set a brand new Guinness World Document for many simultaneous U.S. sizzling 100 hits by a feminine with 11 tracks on the chart, 10 of which have been making their chart debut.\n\t19. In 2009, she gained her first MTV Video Music Award for &#8220;You Belong With Me.&#8221; She&#8217;s gone on to win six extra and 17 nominations.\n\t20. In 2012, she appeared on the duvet of <em>Vogue</em> for the primary time. She&#8217;s appeared on the American cowl two extra occasions since.\n\t21. In 2010, she made her film debut in <em>Valentine&#8217;s Day</em>.\n\t22. She was nominated for her first Golden Globe Award in 2013 for &#8220;Greatest Unique Tune,&#8221; She&#8217;s been nominated a second time since.\n\t23. She gained her first Emmy Award nomination, for Unique Interactive Program, in 2015. In 2016, she set a Guinness World Document for highest annual earnings ever for a feminine pop star with estimated incomes of $170 million.\n\t24. In 2017, <em>Fearless</em> was licensed diamond by the RIAA, that means it had achieved gross sales and streams exceeding 10 million album models.\n\t25. In 2010, Swift was listed as one in all <em>Time</em>&#8216;s most influential individuals on the planet within the annual 100 difficulty.\n\t26. In 2008, she was included in <em>Individuals</em>&#8216;s &#8220;World&#8217;s Most Lovely Individuals.&#8221;\n\t27. She was nominated for her first American Music Award in 2007 and gained her first awards in 2008, amongst them Artist of the Yr. She has gained 19 in complete and has been nominated 25 occasions.\n\t28. Her second studio album, <em>Fearless</em>, gained the Nation Music Affiliation, Academy of Nation Music Award and Grammy Award for Album of the Yr.\n\tThat is actually an inventory to be happy with. Glad Birthday, Taylor!", "title": "Celebrate #Taylor-Swift's Birthday With 28 of Her #Impressive #Milestones", "flickr_photos": {"by": "https://www.flickr.com/people/138991380@N06/"}, "application-name": "Celebrate #Taylor-Swift's Birthday With 28 of Her #Impress… | Flickr", "msapplication-TileColor": "#FFFFFF", "google": "notranslate", "msapplication-TileImage": "https://combo.staticflickr.com/pw/images/favicons/favicon-144.png"}, "movies": [], "publish_date": null, "source": "https://www.flickr.com", "summary": ""}