{"url": "https://www.elitedaily.com/p/who-will-walk-meghan-markle-down-the-aisle-instead-of-her-dad-a-royal-expert-weighs-in-9101147", "text": "What's a wedding without a little 11th-hour drama? While Meghan Markle was busy prepping for her May 19 nuptials to Prince Harry, the sad news broke that the father of the bride will reportedly be a no-show because he recently suffered a heart attack and is undergoing heart surgery. Elite Daily reached out to Kensington Palace for confirmation on the report but did not hear back by the time of publication. So if you're now wondering who will walk Meghan Markle down the aisle instead, you're not alone. Can there even be a wedding without the bride getting walked down the aisle by someone special? I'm gonna need some answers here, ASAP!\n\nAccording to royal historian Carolyn Harris, we can all breathe a sigh of relief, because the wedding ceremony will go on as planned, even if the father of the bride really does decide not to attend. In fact, Harris told E! News there's no \"hard rule\" that would require Thomas Markle to walk his daughter down the aisle, and that there are a \"number of different possibilities.\" Now I'm just hoping she taps Patrick J. Adams — a.k.a. the dude who plays her husband on Suits — because OMG how amazing would that be?\n\nMeanwhile, Markle wouldn't be the first bride at a royal wedding to make a trip down the aisle on the arm of someone other than her dad. Harris told E! that when Queen Victoria married Prince Albert in 1840, she was given away by her paternal uncle Prince Augustus Frederick, the Duke of Sussex. Queen Victoria then did the same for her daughters, Princess Helena and Princess Beatrice on their wedding days. \"So if Meghan Markle does make the decision to have her mother give her away,\" she explained. \"There's certainly precedence dating back to Queen Victoria's reign.\"\n\nTell 'em, Ginger!\n\nMy money is def on mama getting the gig, since the two of them are super-tight, and she is already expected to travel in the car to the church with Meghan on her big day. But I'm also kind of digging all those rumors about Prince William landing the job. We probably shouldn't get our hopes up for that pairing, though. Because Harris said even though Princess Margaret's brother-in-law Prince Philip walked her down the aisle when she wed Antony Armstrong-Jones in 1960, since the Duke of Cambridge is Harry's best man, he already has a \"clear role\" in the festivities. Kind of a bummer, right? These two seem to have a nice little in-law bond thing happening.\n\nChris Jackson/Getty Images Entertainment/Getty Images\n\nSo who's left? Harris said there's always the possibility that Meghan may decide to fly solo and walk herself down the aisle. \"She's very much spoken about women's empowerment and women's independence,\" she explained. I can totally see this happening, you guys! And can you even imagine what a powerful sight that would be? What a strong statement for all the little girls watching at home!\n\nOf course, it's also possible that Harry and Meghan will walk down the aisle together. It's an uncommon choice, for sure. But this is a couple who will reportedly have food trucks and a tiki-themed disco following their formal affair, after all. They are \"very much placing their own stamp on the wedding preparations and customizing things according to their preferences and circumstances,\" Harris said.\n\nNot gonna lie, I'm kind of enjoying this whole guessing game. The last-minute shakeup has only added to all the excitement surrounding the big day, and I really can't wait to see how it all turns out. But at the end of the day, it doesn't really matter who walks Meghan down that aisle, as long as she ends up standing next to Prince Harry when she gets to the end of it.\n\nThree days, people — get hype!", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/14/a304d67c-2dc0-495d-bda3-ce880eede1a1-getty-1206652895.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/13/026d9416-ac46-434b-9d37-86cf5b352469-getty-1177785396.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2020/4/13/bbf8e0b4-d579-49d4-b54c-eab4bfcad228-getty-1154991187.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/5/16/e1ec1a45-454e-47e8-889e-a52072317d3e-gettyimages-902992782.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2018/5/16/e1ec1a45-454e-47e8-889e-a52072317d3e-gettyimages-902992782.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.elitedaily.com/uploads/getty/2018/5/16/324b00b1-a412-4d1a-9516-d0bac605d81e-getty-951052690.jpg?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/uploads/image/2018/5/16/e1ec1a45-454e-47e8-889e-a52072317d3e-gettyimages-902992782.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/who-will-walk-meghan-markle-down-the-aisle-instead-of-her-dad-a-royal-expert-weighs-in-9101147", "title": "Who Will Walk Meghan Markle Down The Aisle Instead of Her Dad? A Royal Expert Weighs In", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/who-will-walk-meghan-markle-down-the-aisle-instead-of-her-dad-a-royal-expert-weighs-in-9101147", "type": "article", "title": "Here's Who Might Walk Meghan Markle Down The Aisle If Her Dad Doesn't Come To The Wedding", "description": "What's a wedding without a little 11th-hour drama? While Meghan Markle was busy prepping for her May 19 nuptials to Prince Harry, the sad news broke that the father of the bride will reportedly be a no-show because he recently suffered a heart…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/5/16/e1ec1a45-454e-47e8-889e-a52072317d3e-gettyimages-902992782.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "What's a wedding without a little 11th-hour drama? While Meghan Markle was busy prepping for her May 19 nuptials to Prince Harry, the sad news broke that the father of the bride will reportedly be a no-show because he recently suffered a heart…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}