{"url": "https://www.stuff.co.nz/entertainment/tv-radio/97519856/us-late-night-tv-hosts-call-for-gun-control-after-las-vegas-shooting", "text": "America's late night comedians are sombre following the Las Vegas shooting, calling for action on gun control to end violence in the US.\n\nTV's late-night show hosts responded to the deadliest mass shooting in modern US history with calls for change. Here's what they had to say.\n\nJIMMY KIMMEL\n\nSUPPLIED Jimmy Kimmel was in tears over the tragedy in Las Vegas, his hometown.\n\nJimmy Kimmel began in tears as he lamented the tragedy in Las Vegas, his hometown.\n\nREAD MORE:\n\n* Horror and heartbreak: Keith Urban joins Nashville in tribute to Las Vegas\n\n* Full coverage\n\n* Live updates\n\n* Shooter's arsenal\n\n\"We wonder why - even though there is probably no way to ever know why - a human being would do something like this to other human beings who are at a concert, having fun and listening to music,\" Kimmel said, choking up.\n\n\"It's interesting because when someone with a beard attacks us we tap phones, we invoke travel bans, we build walls, we take every possible precaution to make sure it doesn't happen again,\" Kimmel said.\n\n\"But when an American buys a gun and kills other Americans, then there's nothing we can do about it.\"\n\n\"Maybe I'm nuts, but I would like to think we could put politics aside and agree that no American citizen needs an M16. Or 10 of them,\" Kimmel said. \"And maybe that way we don't do this again.\"\n\nSTEPHEN COLBERT\n\nIn the wake of horrific violence and tragedy, Colbert says he appreciates \"thoughts and prayers,\" but calls for more.\n\nColbert said his was a comedy show but \"jokes aren't appropriate to address the shock and grief and anger we all feel\".\n\nHe asked what the US was willing to do to \"combat pure evil\", echoing President Donald Trump who called the mass shooting an \"act of pure evil\".\n\nThe bar was so low the US Congress could be heroes by doing literally anything on gun control, he said.\n\n\"Anything but nothing,\" he said. \"Doing nothing is cowardice.\"\n\nCONAN O'BRIEN\n\n\"When did this become a ritual, and what does it say about us that it has?\" O'Brien asked.\n\nWhen he arrived at work he was shown the comments he made after two previous mass shootings, to help him decide what he might say this time, he said.\n\n\"That struck me. How could there be a file of mass shooting remarks for a late night host? When did that become normal?\"\n\nWhen he started doing the job 24 years ago mass shootings were extremely rare. During the past decade things had changed, O'Brien said.\n\n\"It should not be so easy for one demented person to kills so many people so quickly.\"\n\nJAMES CORDEN\n\nAn Englishman, Corden said the killings in Las Vegas were the second time in the 2-1/2 years he had lived in the US that the record for mass shooting deaths had been broken.\n\n\"Some say it's too early to talk about gun control. For those victims last night, it's far too late,\" Corden said. He appeared to be referring to a comment from President Trump's spokeswoman Sarah Huckabee Sanders, who said there was a time for political debate but now was a time to unite.\n\nCorden questioned how it was that every other developed country did a better job of preventing mass shootings. Gun crime could not be a surprise when guns were so widely available, he said.\n\n\"Maybe the time for the thoughts and prayers of Congress members and the president has passed. We need to look to them to actually do something to prevent this from every happening in the future,\" Corden said.\n\n\"Even in these strange times we have a show to do hoping that we can bring some levity to this most heavy of days.\"", "images": ["https://resources.stuff.co.nz/content/dam/images/1/m/2/8/7/o/image.related.StuffLandscapeSixteenByNine.1420x800.1m26sw.png/1507019267287.jpg", "https://secure-nz.imrworldwide.com/cgi-bin/m?ci=nz-stuff&cg=0&cc=1&ts=noscript"], "top_img": "https://resources.stuff.co.nz/content/dam/images/1/m/2/8/7/o/image.related.StuffLandscapeSixteenByNine.1420x800.1m26sw.png/1507019267287.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.stuff.co.nz/entertainment/tv-radio/97519856/us-late-night-tv-hosts-call-for-gun-control-after-las-vegas-shooting", "title": "US late night TV hosts call for gun control after Las Vegas shooting", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "noarchive", "format-detection": "telephone=no", "fb": {"app_id": 207633159308175, "pages": 21253884267}, "verify-v1": "RazNiYjuvNuEsMeFXxfR9l9cDZIKxcq2VjQZA25CHgM=", "msapplication-config": "/sics-assets/images/favicons/browserconfig.xml", "theme-color": "#ffffff", "description": "America's late night comedians sombre after Las Vegas massacre, as they call for something, anything to change.", "source": "Stuff", "og": {"description": "America's late night comedians sombre after Las Vegas massacre, as they call for something, anything to change.", "title": "US late night TV hosts call for gun control after Las Vegas shooting", "url": "https://www.stuff.co.nz/entertainment/tv-radio/97519856/us-late-night-tv-hosts-call-for-gun-control-after-las-vegas-shooting", "type": "article", "image": "https://resources.stuff.co.nz/content/dam/images/1/m/2/8/7/o/image.related.StuffLandscapeSixteenByNine.1420x800.1m26sw.png/1507019267287.jpg", "site_name": "Stuff"}}, "movies": [], "publish_date": null, "source": "https://www.stuff.co.nz", "summary": ""}