{"url": "https://www.britannica.com/biography/Bode-Miller", "text": "Bode Miller, in full Samuel Bode Miller, (born October 12, 1977, Easton, New Hampshire, U.S.), American Alpine skier who won six Olympic medals—more than any other male American skier—and won the men’s World Cup overall championship in 2005 and 2008.\n\nMiller was born in the heart of the White Mountains. His parents were self-styled hippies who lived deep in the woods in a house with no electricity or running water, and Miller was homeschooled until the fourth grade. After his parents divorced, his mother took him to nearby Cannon Mountain while she worked, often leaving him in the care of the ski school staff. At age 11 he began skiing competitively.\n\nA natural athlete, Miller earned all-state honours in high school in both soccer and tennis and was an avid golfer. He was a promising snowboarder as well, but ultimately he decided to focus on skiing. He first made the U.S. ski team in 1998 and competed that year in the Nagano (Japan) Winter Olympics; he failed to win a medal. At the 2001 Fédération Internationale de Ski (FIS) World Ski Championships in St. Anton, Austria, he tore ligaments in his left knee in a racing crash, but he rebounded to collect silver medals in the giant slalom (GS) and the combined event at the 2002 Olympic Winter Games in Salt Lake City, Utah.\n\nMiller went on to post increasingly better results. In 2003 he became the first American to win two gold medals at a single World Championships, capturing the GS and combined titles. He also won three U.S. national titles that year. In 2004 he recorded six World Cup wins en route to taking the GS World Cup title—the first in any discipline by an American man since Phil Mahre won the overall and GS titles in 1983. Miller’s phenomenal performances continued into 2005, when he became the only skier in the 39-year history of the World Cup tour to win the first three races of a season. He also picked up two gold medals—in downhill and supergiant slalom (super-G)—at the World Championships. In 2005 Miller also claimed the World Cup overall championship. In doing so, he became only the second man in history to win in all four disciplines—slalom, GS, super-G, and downhill—during a single season. He was also the first American skier to capture a World Cup overall title since 1983.\n\nGet exclusive access to content from our 1768 First Edition with your subscription. Subscribe today\n\nAt the 2006 Winter Olympics in Turin, Italy, Miller competed in five events but failed to win a medal. The following year he won the super-G World Cup title. Shortly thereafter Miller, known for his independence and outspokenness, announced that he was leaving the U.S. ski team. In 2008 he won his 28th World Cup victory to break the U.S. record set by Mahre. (Miller’s record of 32 titles was in turn broken by Lindsey Vonn in 2010.) Later that year he captured his second World Cup overall title. He struggled in the 2009 season, however, as he failed to win a race. In late 2009 Miller rejoined the U.S. ski team, and the following year at the Vancouver Winter Olympics he won his first Olympic gold, taking the top spot in the super combined, as well as a silver medal in the super-G and a bronze in the downhill.\n\nIn 2011 he won his 33rd career World Cup race, a downhill event. Miller skipped the 2013 World Cup season to recover from knee surgery. At the 2014 Olympic Winter Games in Sochi, Russia, he won a bronze medal in the super-G to become the most-decorated American Olympic skier of all time. In addition, he became, at age 36, the oldest individual to win an Olympic medal in an Alpine skiing event. Miller missed the beginning of the 2014–15 skiing season while recovering from back surgery. During his first race of the season—a super-G event at the World Championships in February 2015—he crashed and severed a tendon in his right leg, forcing him to miss the remainder of the World Championships. After not being able to return to the racing circuit for two years, Miller officially retired from competitive skiing in 2017 and then joined the National Broadcasting Company as an analyst for the company’s Olympic skiing broadcasts.\n\nMiller’s autobiography, Bode: Go Fast, Be Good, Have Fun (written with Jack McEnany), was published in 2005.", "images": ["https://safe.britannica.com/safeimages/BFP_marketing_ads_slider.jpg", "https://cdn.britannica.com/s:180x120,c:crop/57/176457-050-35C6B980/poster-Olympic-Winter-Games-Russia-Sochi-2014.jpg", "https://safe.britannica.com/safeimages/BFP_marketing_ads_300x90_C.jpg", "https://cdn.britannica.com/s:300x300/15/91315-050-9917EED3/Bode-Miller-supergiant-slalom-final-men-championships.jpg", "https://cdn.britannica.com/marketing/newsletter-icon-white-SM.png", "https://cdn.britannica.com/15/91315-050-9917EED3/Bode-Miller-supergiant-slalom-final-men-championships.jpg", "https://cdn.britannica.com/s:180x120,c:crop/43/198043-050-06FA423B/events-Infographic-athletes-Olympic-Games-pankration-pentathlon.jpg"], "top_img": "https://cdn.britannica.com/15/91315-050-9917EED3/Bode-Miller-supergiant-slalom-final-men-championships.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.britannica.com/biography/Bode-Miller", "title": "Bode Miller | Biography, Olympics, Medals, & Facts", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "p": {"domain_verify": "5247c07bac63b6b3250f68cfe355c9a2"}, "fb": {"pages": 74442380906, "app_id": 1887621861548296}, "description": "Bode Miller, American Alpine skier who won a total of six Olympic medals—more than any other male American skier—and won the men’s World Cup overall championship in 2005 and 2008. Learn more about Miller’s life, career, and accomplishments in this article.", "keywords": "Bode Miller, encyclopedia, encyclopeadia, britannica, article", "twitter": {"card": "summary_large_image", "site": "@britannica", "image": "https://cdn.britannica.com/15/91315-050-9917EED3/Bode-Miller-supergiant-slalom-final-men-championships.jpg", "description": "Bode Miller, American Alpine skier who won a total of six Olympic medals—more than any other male American skier—and won the men’s World Cup overall championship in 2005 and 2008. Learn more about Miller’s life, career, and accomplishments in this article."}, "og": {"type": "ARTICLE", "title": "Bode Miller | Biography, Olympics, Medals, & Facts", "description": "Bode Miller, American Alpine skier who won a total of six Olympic medals—more than any other male American skier—and won the men’s World Cup overall championship in 2005 and 2008. Learn more about Miller’s life, career, and accomplishments in this article.", "site_name": "Encyclopedia Britannica", "url": "https://www.britannica.com/biography/Bode-Miller", "image": {"identifier": "https://cdn.britannica.com/15/91315-050-9917EED3/Bode-Miller-supergiant-slalom-final-men-championships.jpg", "type": "image/jpeg"}}}, "movies": [], "publish_date": null, "source": "https://www.britannica.com", "summary": ""}