{"url": "https://www.usmagazine.com/celebrity-news/news/christina-aguilera-britney-spears-friendship-what-theyve-said-2015242/", "text": "Friends or foes? Christina Aguilera‘s incredible Tonight Show musical impressions of pop divas like Cher, Shakira, and more have gone viral, but nothing was more spot-on than her take on former pop rival Britney Spears. Here, Us Weekly rounds up the sweetest and shadiest comments the former Mickey Mouse Club stars have made about each other.\n\nFRIENDS\n\nThe girls — who share a lot in common, after all — have had their moments, supporting each other publicly.\n\nPHOTOS: Britney's amazing music video looks\n\n1. In a 2005 blog post on her official site, Spears, now 33, derailed rumors that she hated Aguilera, 34. “Britney would love to be close with Christina again,” her site read. “In fact, Britney recently wrote Christina a letter telling her how happy and beautiful Christina looks lately.”\n\n2. In 2011, Aguilera tweeted public support for her fellow pop star and her seventh studio album release.\n\nHey @BritneySpears Congrats on Femme Fatale release! Can’t wait to see what you bring in the next video. xo – Xtina — Christina Aguilera (@xtina) March 29, 2011\n\n3. In a 2012 press conference for The Voice, Aguilera was asked the question about Spears joining rival reality TV show The X Factor. “[We were in the] Mickey Mouse Club. We were very close, and our paths have always crossed and, interestingly, they will continue to cross,” Aguilera told reporters (as detailed by HitFlix). “I welcome her to this family of fun and entertainment and finding new talent as well….I don’t know what [advice] she’s going to offer specifically, but I know she’s a pro…I think she’s going to give great advice.”\n\nPHOTOS: Xtina's sexy music video looks through the years\n\nFOES\n\n1. In a 2004 interview with Us Weekly, Aguilera dissed Spears ahead of her wedding to now-ex Kevin Federline. “I know Britney,” Aguilera told Us at the time. “She’s not trailer trash, but she sure acts that way.”\n\n2. That wasn’t all! Aguilera also was in utter disbelief that Spears had purchased her own diamond rock. “I can’t believe that girl bought her own engagement ring!” she told Us. “I’ve seen it, up close. It looks like she got it on QVC.”\n\nPHOTOS: Brit's many Us Weekly covers through the years\n\n3. In a December 2003 interview with Blender magazine, Aguilera called out Spears as “distant” during rehearsals for their MTV Video Music Awards performance with Madonna. “Every time I tried to start a conversation with her — well, let’s just say she seemed nervous the whole time,” Aguilera told the mag. “She seems to me like a lost little girl, someone who desperately needs guidance.”\n\n4. Spears, who caught wind of Aguilera’s comments, subsequently slammed the “Dirrty” singer in the January 2004 issue of Blender. Spears noted that she hadn’t seen Aguilera in two years when they ran into each other in a weird encounter. “She comes up to me in a club in front of all these people and tries to put her tongue down my throat!” Spears claimed. “I say, ‘It’s good to see you,’ and she goes, ‘Well, you’re not being real with me.’ I was like, ‘Well, Christina, what’s your definition of real? Going up to girls and kissing them after you haven’t seen them for two years?'”\n\nPHOTOS: Xtina's body evolution\n\n5. Spears continued ripping Aguilera in the interview and said: “A lost girl? I think it’s probably the other way around. I can’t believe she said that about me. When someone has been rude to you so many times, it’s like, ‘You know what, Christina, I’m really not about the fake anymore.'”\n\n6. 2012 marked Aguilera’s first time ever working alongside producer Max Martin. In an interview with Billboard, the “Your Body” singer tossed some subtle shade at her fellow pop stars who had previously worked with him.\n\n“Max is legendary in the business. He’s known about me but we haven’t crossed paths,” she said. “I think when I came in you heard his name with Backstreet Boys, ‘N Sync, Britney Spears — those records were the kind I wanted to stray apart from.”", "images": ["https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered-green.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/bg-subscribe.png", "https://www.usmagazine.com/wp-content/uploads/2020/04/Screen-Shot-2020-04-09-at-11.48.30-AM.png?w=100&h=100&crop=1", "https://www.usmagazine.com/wp-content/uploads/1424801136_xtina-britney-178.jpg?w=300&h=178&crop=1", "https://www.usmagazine.com/wp-content/uploads/2020/04/woman-eating-bar1-1.jpg?w=100&h=100&crop=1", "https://www.usmagazine.com/wp-content/uploads/Britney-Christina-022415-inline.jpg", "https://www.usmagazine.com/wp-content/uploads/1424801136_xtina-britney-zoom.jpg?w=200&h=113&crop=1", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/icon-download.svg", "https://www.usmagazine.com/wp-content/uploads/2020/04/shutterstock_1701843913-1.jpg?w=100&h=100&crop=1"], "top_img": "https://www.usmagazine.com/wp-content/uploads/1424801136_xtina-britney-178.jpg?w=300&h=178&crop=1", "keywords": [], "authors": ["Esther Lee"], "canonical_link": "https://www.usmagazine.com/celebrity-news/news/christina-aguilera-britney-spears-friendship-what-theyve-said-2015242/", "title": "Christina Aguilera, Britney Spears: What They've Said About Each Other", "meta_data": {"viewport": "width=device-width, initial-scale=1", "ir-site-verification-token": "-206090124", "fo-verify": "49e6fc6a-c68d-447f-9978-70e3eac455ac", "msvalidate.01": "097DBAAF43A9B61E9E4259AA7D75B069", "description": "Christina Aguilera and Britney Spears' friendship has been rather confusing over the years -- Us Weekly digs up their sweetest and shadiest comments", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Friends or Foes? What Xtina and Britney Have Said About Each Other", "description": "Christina Aguilera and Britney Spears' friendship has been rather confusing over the years -- Us Weekly digs up their sweetest and shadiest comments", "url": "https://www.usmagazine.com/celebrity-news/news/christina-aguilera-britney-spears-friendship-what-theyve-said-2015242/", "site_name": "Us Weekly", "updated_time": "2017-12-07T03:19:50+00:00", "image": {"identifier": "https://www.usmagazine.com/wp-content/uploads/1424801136_xtina-britney-178.jpg?w=300&h=178&crop=1", "secure_url": "https://www.usmagazine.com/wp-content/uploads/1424801136_xtina-britney-178.jpg?w=300&h=178&crop=1", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/UsWeekly", "tag": "Celebrity Feuds", "section": "Celebrity News", "published_time": "2015-02-24T18:40:00+00:00", "modified_time": "2017-12-07T03:19:50+00:00"}, "fb": {"app_id": 1785612128341436}, "twitter": {"card": "summary_large_image", "description": "Christina Aguilera and Britney Spears' friendship has been rather confusing over the years -- Us Weekly digs up their sweetest and shadiest comments", "title": "Friends or Foes? What Xtina and Britney Have Said About Each Other", "site": "@usweekly", "image": "https://www.usmagazine.com/wp-content/uploads/1424801136_xtina-britney-178.jpg?w=300&h=178&crop=1", "creator": "@usweekly"}, "generator": "WordPress 5.4"}, "movies": [], "publish_date": 1424803200.0, "source": "https://www.usmagazine.com", "summary": ""}