{"url": "https://www.vogue.com/article/being-serena-premiere-serena-venus-williams", "text": "\n\n\n\n1 / 5 Chevron Chevron Photo: Dave Allocca / HBO Serena Williams and Venus Williams\n\nIn the new HBO documentary series Being Serena, tennis champion and Vogue cover star Serena Williams shares it all: her surprise pregnancy, dangerous delivery, courageous recovery, and triumphant return to tennis. The series offers an inside look at one of the world’s greatest athletes, elucidating the immense power she possesses to fight for what she wants—at times, her life. The cameras follow Williams’s every move: inside the delivery room, with baby Olympia, and in the middle of planning her fairy-tale wedding, as well as her matches back on the tennis court. It’s a tell-all video memoir that will undoubtedly enthrall viewers. Serena Williams is truly one of a kind.\n\nAt the premiere of Being Serena in New York City’s Time Warner Center, Williams’s family and friends gathered to celebrate her success. On the red carpet, she sparkled in a light pink dress with shimmering gold sleeves designed by her eponymous label. Sister Venus Williams also wore a black Serena Williams design, including a bomber jacket with shiny silver sleeves. The Williams sisters weren’t the only big sister-little sister duo on the red carpet: Gigi Hadid, in a Derek Lam camel-color suit, matched with Bella Hadid in a black Tom Ford suit. Other attendees included Serena’s husband and tech entrepreneur Alexis Ohanian, Vera Wang, Anna Wintour, and Condé Nast’s Bob Sauerberg.\n\nA consistent theme of both the series and sentiment among Serena’s friends and family is her many layers. She’s a tennis master, entrepreneur, fashion designer, and philanthropist. Her most recent and proudest accolade agreed upon by all, including Serena herself, was the birth of her daughter, Olympia. On the red carpet, Serena told Vogue: “The one thing I’m most proud of is becoming a mom. That is everything, hands down.” On what she has not yet accomplished but would love to, Serena said, “Becoming a multi-mom. I have some records I want to break, but having more kids is my goal.” Olympia is already proving to be a stylish baby thanks to Serena’s good taste. When dressing her, often in mommy-and-me matching style, Williams said, “I just think about things that are comfortable and easy to change a diaper. I get most of her clothes on Amazon. They have great, fun clothes. I want her to be very humble, and I want to start that at an early age.” Ohanian added, “I am so proud and in awe of my wife!”\n\nVenus agreed with Serena on her sister’s greatest accomplishment: “She’s a tennis champion and an unbelievable mom. She does everything for the baby. Balancing her career is not easy, especially when you’re a world tennis champion. I’m most proud of her for that.” Designer Vera Wang shared similar sentiment, telling Vogue: “Underneath that incredible champion is a very human woman. When she gets off the court, she has a desire for a very different kind of life. People will understand the struggle of what it is to be a champion at that level. It’s a wonderful dichotomy—people see the glamour, they see the wins, they see the trophies. But they don’t know what that struggle is day in and day out. There are two sides: There’s the woman side and there’s the champion side, and they’re really one in the same.”\n\nFollowing the red carpet, guests gathered into the movie theater to watch the first two episodes of the Being Serena series. Baby Olympia sat on Serena’s lap in the theater, while a few rows away the Hadid sisters sat next to Wang and Wintour. After the screening, guests dined at Porter House in Columbus Circle, where the Williams clan enjoyed steak and MoonPies, a personal favorite of Serena’s.\n\nWatch Serena Williams Absolutely Tear Up an Airport Runway:", "images": ["https://www.vogue.com/verso/static/vogue/assets/logo-header.e33072deca0cf93bb836ebae5f1a13228ccd143f.svg", "https://assets.vogue.com/photos/5ae1e84edd36a16842883924/master/w_1600%2Cc_limit/01-being-serena.jpg", "https://www.vogue.com/verso/static/vogue/assets/logo-reverse.e59a2fba3f338152fef5e68bdd8de503b13ab406.svg", "https://assets.vogue.com/photos/5ae1e84ef8acad647e0a2b60/master/w_1600%2Cc_limit/00-story-being-serena.jpg", "https://assets.vogue.com/photos/5ae1e84ef3f6a97285347445/master/w_1600%2Cc_limit/02-being-serena.jpg", "https://assets.vogue.com/photos/5ae1e810ebc7245f7f2f6900/16:9/w_1280,c_limit/00-social-being-serena.jpg", "https://www.vogue.com/verso/static/vogue/assets/logo.ca5391719a9bb240552dec148d9ee3c8f603abfd.svg"], "top_img": "https://assets.vogue.com/photos/5ae1e810ebc7245f7f2f6900/16:9/w_1280,c_limit/00-social-being-serena.jpg", "keywords": [], "authors": ["Zachary Schwartz", "Zachary Schwart"], "canonical_link": "https://www.vogue.com/article/being-serena-premiere-serena-venus-williams", "title": "Serena Williams Is Celebrated On and Off the Court at the Premiere of Being Serena", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Zachary Schwartz", "copyright": "Copyright (c) Condé Nast 2020", "description": "The HBO documentary series Being Serena follows Serena Williams through her pregnancy, wedding to Alexis Ohanian, and return to tennis.", "id": "5ae1e7cb11ab624ed677276e", "keywords": "parties,runway,serena williams", "news_keywords": "parties,runway,serena williams", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5ae1e7cb11ab624ed677276e", "parsely-metadata": "{\"description\":\"The HBO documentary series Being Serena follows Serena Williams through her pregnancy, wedding to Alexis Ohanian, and return to tennis.\",\"image-16-9\":\"https://assets.vogue.com/photos/5ae1e7fb69b96d47fd7dcfc7/16:9/w_1000,c_limit/00-promo-being-serena.jpg\",\"image-1-1\":\"https://assets.vogue.com/photos/5ae1e7fb69b96d47fd7dcfc7/1:1/w_1000,c_limit/00-promo-being-serena.jpg\"}", "og": {"description": "The HBO documentary series Being Serena follows Serena Williams through her pregnancy, wedding to Alexis Ohanian, and return to tennis.", "image": "https://assets.vogue.com/photos/5ae1e810ebc7245f7f2f6900/16:9/w_1280,c_limit/00-social-being-serena.jpg", "site_name": "Vogue", "title": "Serena Williams Is Celebrated On and Off the Court at the Premiere of Being Serena", "type": "article", "url": "https://www.vogue.com/article/being-serena-premiere-serena-venus-williams"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@voguemagazine", "description": "The HBO documentary series Being Serena follows Serena Williams through her pregnancy, wedding to Alexis Ohanian, and return to tennis.", "domain": "https://www.vogue.com", "image": {"src": "https://assets.vogue.com/photos/5ae1e810ebc7245f7f2f6900/16:9/w_1280,c_limit/00-social-being-serena.jpg?mbid=social_retweet"}, "site": "@voguemagazine", "title": "Serena Williams Is Celebrated On and Off the Court at the Premiere of Being Serena"}, "fb": {"app_id": 812270538813681, "pages": 42933792278}}, "movies": [], "publish_date": null, "source": "https://www.vogue.com", "summary": ""}