{"url": "http://time.com/5176136/oscars-2018-a-fantastic-woman-daniela-vega-sebastian-lelio/", "text": "Director Sebastián Lelio met his muse outside a beauty salon in Chile, where the burgeoning actress and singer was doing makeup and hair for brides to help pay the bills. He had traveled there to ask Daniela Vega, who would become the star of his of Oscar-nominated film, a question: What is it like to be a transgender woman in Santiago these days?\n\nLelio recalls Vega answering this, in part, by showing him something once they sat down together at a nearby cafe. “I’ll never forget this,” says Lelio, whose feature, A Fantastic Woman, is one of five up for best foreign language film. “She opened her purse and took out her ID, with her old masculine identity on it, because the state of Chile doesn’t recognize or acknowledge the existence of transgender people…. I was just in awe.”\n\nBoth the director and the star say that A Fantastic Woman is not a political film, even if it is having a political impact. The success of the film has catapulted Vega to stardom in Chile, where she recently called for reform to the country’s laws while sharing a stage with the outgoing president — and where the film is still showing in theaters, more than a year after it become a darling on the festival circuit. The actress will also be making history when the ceremony airs on March 4, with Vega becoming the first openly transgender person to present an Academy Award.\n\n“I feel a lot of love from everybody,” Vega, 28, tells TIME on a phone call from Chile, speaking through an interpreter. “If there is any problem, I would say there is a social problem. It’s about the lack of action on the part of the politicians when it comes to transgender rights.”\n\nThe film’s nomination is trailblazing too, because the lead role is not only a transgender character but one being played by a transgender actress. Viewers may recall that non-transgender actors have been feted for playing such roles in recent years (See: Jared Leto in Dallas Buyers Club or Eddie Redmayne in The Danish Girl). Those casting choices, advocates say, are by no means wrong, but they can reaffirm the stereotype that transgender women are nothing more than men in costume.\n\n“It’s rare to have this kind of thing come along,” says Nick Adams, who works at LGBTQ media advocacy organization GLAAD. When Vega is out promoting the film, “she is still a woman, which is who transgender women are,” he says. “They are not just women when they’re on screen.”\n\nThe story of A Fantastic Woman is one about grief and shock, exploring the question of what happens to a person when their lover dies just moments after they were in a tender embrace. Lelio initially planned on telling this tale through a cisgender heterosexual couple, but the moment he and his script co-writer Gonzalo Maza hit on the notion of the woman being transgender, the project took on a new dimension, presenting a challenge to the filmmakers and the viewers.\n\nFor the director, the challenge was in how to tell the story. “I heard like a clack in my head. I froze,” Lelio says. “Because I felt that the idea was extremely moving, contemporary, full of the potential of resonating with so many things that we are going through as a human society. And at the same time,” he continues, “it was, to me, full of dangers. Political dangers, aesthetic dangers, artistic dangers. It had so many traps that it was too irresistible.”\n\nFor viewers, this decision also changed the stakes, because it is easy to feel understanding for someone whose life is similar to your own. “The first question that I would like for people to ask when they watch this movie is, what’s happening with empathy. What are the limits of our empathy?” Vega says. “And who has the right to say that certain bodies cannot be inhabited or certain loves cannot be conquered?”\n\nInitially Lelio had reached out to Vega to be a consultant on the film. But over the course of a year, the script “started to absorb elements from Daniela,” he says. For instance: the main character, Marina, became a singer because Vega is a singer (a classically trained one who did live recordings for most of the music in the film). Lelio says he knew from the minute he met her that he wanted a transgender actress to play the role.\n\n“It felt like it was too late for that, to me,” he says of casting a non-transgender actor to play Marina. “I’m not saying transgender characters should be only interpreted by transgender actors — because that would be as rigid as saying transgender actors cannot play cisgender roles, and that’s not the idea. I want to be clear about that. We are talking about freedom here. I’m just saying that was my feeling and my solution to the ethical challenge of how to cast this film.”\n\nThe film is more provocative than preachy. Lelio likes to describe it as transgénero, a word that can mean transgender as well as cross-genre. At times it feels suspenseful and dangerous, at others like a love story. There’s magical realism and regular old realism, as the main character, Marina, has her identity and her relationship questioned by secondary characters ranging from her lover’s children to the police. Some characters in the movie affirmingly call her Senora, others call her a pervert and a chimera.\n\nThe director says he chose the title A Fantastic Woman (or Una Mujer Fantastica) in part because he was offering two options to the spectators. “Fantastic means that which has extraordinary properties,” he says, “but at the time it means that which is the product of fantasy. So the spectator has enough space within the film, I hope, to decide which way Marina is fantastic.” When secondary characters make those judgments, Lelio says, they are revealing things about themselves more than her. That is why there are several scenes where Marina points her big, dark eyes straight at the camera. Those moments are meant to say to viewers, “What are you seeing in me? What are you projecting?” he explains.\n\nVega emphasizes that the story itself is not biographical. But she has faced discrimination in her own life and the fact that we know she could face the same kind of treatment that Marina does makes the film more uncomfortable and more powerful. “That delivery of a line comes from deep down within,” says Participant Media’s Jonathan King, whose company has produced other “pro-social” films like Spotlight and An Inconvenient Truth. He says that the Oscar nomination has made the film more impactful in Chile, because having a feature put up for an award on the big night is “almost like sending your team to the World Cup or the Olympics.”\n\nVega, the starring member of that team, doesn’t want to focus too much on who plays which roles. She says the real problem is a lack of opportunities for transgender people across the board — that there is struggle to get employment in many industries, that transgender people in Chile face difficulties in trying to get housing — and she sees the arts as something that can act as a catalyst. “The arts were actually a window of opportunity for me,” she says. “It’s going to be like a chain effect, in the sense that throughout the arts there will be more inclusion.” And that will lead to more inclusion in other industries, she adds.\n\nSo what does Vega think of her upcoming turn as a presenter at the Oscars, a moment being heralded by LGBT rights groups? As she responds, her interpreter laughs. “I love that everybody is so excited about it,” her interpreter relays. “And I really, really hope that they love the dress I’m going to be wearing.”\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Katy Steinmetz at katy.steinmetz@time.com.", "images": ["https://api.time.com/wp-content/uploads/2018/02/daniela-vega-2.jpg?quality=85", "https://api.time.com/wp-content/uploads/2018/03/internet-wants-maya-rudolph-tiffany-haddish-to-host-oscars.jpg?quality=85&w=526", "https://api.time.com/wp-content/uploads/2018/02/daniela-vega.jpg", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2018/02/daniela-vega.jpg?quality=85&w=1200&h=628&crop=1", "https://api.time.com/wp-content/uploads/2018/03/who-won-jet-ski-at-oscars.jpg?quality=85&w=525", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2020/04/TIM200427_cover_Hope_USETHIS.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://api.time.com/wp-content/uploads/2018/02/marina-techo-auto_2.jpg?quality=85", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2018/02/daniela-vega.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Katy Steinmetz"], "canonical_link": "https://time.com/5176136/oscars-2018-a-fantastic-woman-daniela-vega-sebastian-lelio/", "title": "Oscars 2018: 'A Fantastic Woman' Has a Challenge for Viewers", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Oscars 2018, academy awards 2018, daniela vega, sebastian lelio, a fantastic woman, chile, best foreign language film, transgender woman, transgender rights", "news_keywords": "Oscars 2018, academy awards 2018, daniela vega, sebastian lelio, a fantastic woman, chile, best foreign language film, transgender woman, transgender rights", "description": "A nominee for best foreign language film makes for uncomfortable and powerful viewing. It's also making history", "og": {"title": "This Oscar-Nominated Film Asks: 'What Are You Seeing in Me?'", "type": "article", "site_name": "Time", "url": "https://time.com/5176136/oscars-2018-a-fantastic-woman-daniela-vega-sebastian-lelio/", "description": "'A Fantastic Woman' will make a little history at the 2018 Oscars", "image": {"identifier": "https://api.time.com/wp-content/uploads/2018/02/daniela-vega.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5176136/oscars-2018-a-fantastic-woman-daniela-vega-sebastian-lelio/", "description": "A nominee for best foreign language film makes for uncomfortable and powerful viewing. It's also making history", "media": "https://api.time.com/wp-content/uploads/2018/02/daniela-vega.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5176136/oscars-2018-a-fantastic-woman-daniela-vega-sebastian-lelio/", "title": "This Oscar-Nominated Film Asks: 'What Are You Seeing in Me?'", "description": "'A Fantastic Woman' will make a little history at the 2018 Oscars", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2018/02/daniela-vega.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}