{"url": "https://www.oxygen.com/crime-time/oxygen-announces-true-crime-programming-slate-with-10-new-original-series", "text": "Oxygen Media, the home for quality true crime programming, is aggressively expanding its original series slate with 10 new greenlights and the US premiere of a Piers Morgan event series, it was announced today by Rod Aissa, Executive Vice President, Original Programming and Development, Oxygen Media. In 2017, Oxygen rebranded to a fulltime true crime destination and quickly became one of the fastest growing networks in cable behind such hits as “Cold Justice” “The Disappearance of Natalee Holloway,” “Dahmer on Dahmer: A Serial Killer Speaks” and “Aaron Hernandez Uncovered,” which all set ratings records for the network.\n\n“The response from the true crime community has been overwhelming,” said Aissa, “We’ve had some tremendous early ratings successes since our rebrand, and this new slate adds to our mission of providing best in class investigative docuseries from the top producers and talent in the genre, while continuing to offer exclusive access and compelling storytelling that have become paramount to our viewers.”\n\n\"Oxygen is delivering an audience of true crime enthusiasts that is passionate about the programming, resulting in the ideal effectiveness for our advertiser’s messaging,” said Laura Molen, Executive Vice President, Lifestyle and Hispanic Advertising Sales, NBCUniversal. “We’re seeing this engagement not just on linear but also across Oxygen’s digital presence, where younger, valuable consumers are coming to the network, allowing us to show the network’s reach across multiple demos.”\n\nThis year, the two-part “Aaron Hernandez Uncovered” became the most watched true crime program in the history of the network, reaching 4.4 million total viewers and 1.9 million P18-49 across all airings during its premiere weekend on Saturday, March 17 and Sunday, March 18. This propelled 1Q18 to be Oxygen’s most watched quarter in seven years among total viewers in total day, and March 2018 to be the network’s most watched month in six years among total viewers in total day. In addition, Oxygen.com continues to be the #1 most popular website dedicated to crime.\n\nNew True Crime Series:\n\n“In Defense Of”\n\nProduced by Magical Elves with Jane Lipsitz and Dan Cutforth serving as executive producers.\n\nThis psychologically thrilling crime series explores the complex relationships between notorious criminals and the defense attorneys who represented them in court. From Oklahoma City bomber, Timothy McVeigh, and his defense attorney, Chris Tritico, who to this day calls Tim his friend; to Jodi Arias and her public defense attorney, Kirk Nurmi, who was willing to give up his entire career half way through the case just to get away from her, viewers will look at these legendary trials from a totally different perspective. For the first time ever, these top defense attorneys share their very personal, and sometimes very controversial, versions of events as they worked alongside some of the biggest monsters of our time.\n\n“Serial Killer with Piers Morgan”\n\nProduced by Plum Pictures and Ferret Productions with Piers Morgan, John Ferriter, Will Daws and Stuart Cabb serving as executive producers.\n\nOxygen will be the home for the US premiere of “Serial Killer with Piers Morgan.” With unprecedented access to some of the most dangerous maximum security prisons in the United States, “Serial Killer with Piers Morgan” will explore the minds of three of America’s most depraved serial killers. Having never spoken on camera about their crimes until now, each landmark episode will be built around Piers’ chilling face-to-face interview with a killer.\n\n“The Disappearance of Crystal Rogers”\n\nProduced by Peacock Productions with Lloyd Fales and Nicole Rittenmeyer serving as executive producers.\n\nIn the summer of 2015, Crystal Rogers’ car was found abandoned on the side of the Bluegrass Parkway in Bardstown, Kentucky. The 35 year-old mother had vanished without a trace, leaving behind a confused and shattered family. Did she run off? Was she abducted? A year later Crystal’s father, who had worked tirelessly to uncover the truth behind his daughter’s disappearance, is shot dead in an alleged hunting accident. However, the locals feel certain there’s a killer in their midst. As the layers of Crystal’s disappearance are pulled back, a town in turmoil rises to the surface, with multiple unsolved homicides, countless secrets and different theories starting to emerge. In this investigative series, journalist Stephanie Bauer partners with retired homicide detective Dwayne Stanton to explore “The Disappearance of Crystal Rogers” and a series of other unsolved homicides that haunt this seemingly idyllic community.\n\n“Price of Duty”\n\nProduced by The Intellectual Property Corporation (IPC) with Eli Holzman, Aaron Saidman, Bill Pruitt, Jackson Nguyen and Todd Crites serving as executive producers.\n\nHomicide detectives are trained to stay detached, to remain calm and stoic during every investigation no matter how ugly the crime. But even the most seasoned detectives have a breaking point. A seminal case so shocking, so profoundly heartbreaking, that no amount of training could shield them from its emotional toll. In each episode of “Price of Duty,” a homicide detective will share the story of the most haunting case of their career. From their first steps on the crime scene, to the final bust and the emotional aftermath – viewers will go on an emotional rollercoaster ride to the front lines of a riveting homicide investigation that reveals a deeply personal side of our nation’s detectives that few ever see.\n\n“Abuse of Power” – Premieres Saturday, May 12th\n\nProduced by Storyville Entertainment and Lucky 8 with Betsy Schechter, Kim Woodard, Greg Henry, Dahlia Damaghi and Mitchell Rosenbaum serving as executive producers.\n\nHosted by esteemed television journalist Lauren Sivan, each episode will examine the twisted and true stories where pillars of the community took advantage of their authority to commit heinous acts of crime, all stemming from their hunger for greed, control and power. Through gripping firsthand accounts, never-before-seen interviews and dramatic reenactments, “Abuse of Power” will expose just how far those in power are willing to go in order to cover up their transgressions and what happens when the law finally catches up to them.\n\n“The Mark of a Killer” (Working Title)\n\nProduced by Jarrett Creative and Motiv8 Media with Seth Jarrett and Julie Jarrett serving as executive producers for Jarrett Creative and Kara Kurcz and Brian Lee serving as executive producers for Motiv8 Media.\n\nAll serial killers commit murder to satisfy their grand fantasies, but the murderers featured in “The Mark of a Killer,” take it one step further, committing heinous acts that allow them to extend their fantasies and relive the excitement of their crimes again and again. With many keeping postmortem souvenirs and performing distinct rituals during each killing, their signature trademarks often prove to be their undoing. This series follows the trails of their obsession, and takes a deep dive into the killers’ depraved psyches to reveal their darkest secrets as investigators close in to end the killer’s reign of terror.\n\n“License To Kill” (Working Title)\n\nProduced by Shed Media, a division of Warner Bros. Unscripted & Alternative Television. Pam Healey, Dave Kuba, Adam Kassen, and Terry Dubrow serve as executive producers.\n\nRenowned plastic surgeon Terry Dubrow (“Botched”) investigates jaw-dropping cases of murderous doctors and nurses. In each episode, Dr. Dubrow will detail the outrageous events that led to each medical professional’s insidious use of their expertise by taking viewers inside the killers’ minds, and inside the bodies of the victims, utilizing signature forensic animation. Every case unfolds from the perspective of the victims, families, colleagues and law enforcement, with harrowing accounts of patients put into jeopardy all the way through to the final act. Whether these doctors spiraled out of control over money, jealousy, power or from mental breakdowns, armchair detectives will be on the edge of their seats as authorities try to stop the madness before someone else gets killed.\n\n“Dying to Belong”\n\nProduced by Jupiter Entertainment with Stephen Land, Allison Wallach, Matt Sprouse and Eric Wetherington serving as executive producers.\n\nWhat happens when the desire to belong takes a dark turn? “Dying to Belong” explores the utterly shocking and spellbinding stories of those who killed in order to feel genuinely accepted. From a teenager who killed to impress his friends, to a mother who plotted to kill a cheerleader who was her daughter’s competition, these stories will reveal the true cost of an obsession to fit in and will feature first-person accounts of those closest to the case.\n\n“Buried in the Backyard” – Premieres Sunday, June 3rd\n\nProduced by Renegade 83 with Jay Renfroe, David Garfinkle, Bob Kusbit and Jeff Kuntz serving as executive producers.\n\nFor most people, the backyard, and the backyards of their neighborhood, are safe havens, places where children can play and families and friends can gather. But sometimes there is something sinister lurking beneath the well-trimmed hedges and fences. This series focuses on true crime stories where the victim was found buried in the most unsuspecting of places, the backyard. However, finding the remains is only the beginning, and each episode will follow the police investigation from discovering the body to identifying it, determining cause of death and who committed the murder.\n\n“A Wedding and a Murder” – Premieres Sunday, June 3rd\n\nProduced by Leepson Bounds Entertainment with David Leepson, Stephanie Lydecker, Mary Bissell and Daniel Schulman serving as executive producers.\n\nThis series chronicles relationships which began with the promise of an engagement, and explores dream weddings that are supposed to bring only the happiest memories of love and good times, but ultimately end up shrouded by mystery and murder. Each hour-long episode will expose a grisly homicide set against the backdrop of what appears to be wedded bliss. From the bride and groom, to a family member, or even a jealous wedding guest – anyone could be the victim or suspect. In many cases the wedding serves as a powerful catalyst for murder, giving the killer the motivation they need to commit the unthinkable.\n\n“Cult of Killers” (Working Title)\n\nProduced by IPC and Eureka Productions with Eli Holzman and Aaron Saidman serving as executive producers for IPC and Paul Franklin and Chris Culvenor serving as executive producers for Eureka.\n\nThis true crime series exposes the complex mystery behind a murder (or string of murders) committed by members of a vicious cult. Each episode will zero in on the cult responsible for a homicide, and begin to unravel the cult’s genesis from the leader down to the individual members. Featuring access to law enforcement and former members, first hand accounts will help explain the cult’s beliefs and how it drove its members to kill.\n\nSource: Nielsen Media Research, L7 through 3/18/18 blended with L3 through 3/29/18 and LS through 4/1/18. Reach based on 6 minute qualifier. Comscore Crime competitive set: oxygen.com, lawandcrime.com (previously lawnewz.com), crimefeed.com, the-line-up.com, crimeonline.com\n\nAbout Oxygen Media:\n\nOxygen Media is a multiplatform crime destination brand for women. Having announced the full-time shift to true crime programming in 2017, Oxygen remains one of the fastest growing cable entertainment networks with popular unscripted original programming that includes the flagship “Snapped” franchise, “Cold Justice,” “Killer Couples,” “Criminal Confessions,” and breakout hit event series such as “The Disappearance of Natalee Holloway,” “Dahmer on Dahmer: A Killer Speaks” and “Aaron Hernandez Uncovered.” Available in more than 77 million homes, Oxygen is a program service of NBCUniversal Cable Entertainment, a division of NBCUniversal, one of the world's leading media and entertainment companies in the development, production, and marketing of entertainment, news, and information to a global audience. Watch Oxygen anywhere: On Demand, online or across mobile and connected TVs.", "images": ["https://www.oxygen.com/sites/oxygen/files/2020-04/mok-phone-booth.jpg", "https://www.oxygen.com/sites/oxygen/files/styles/blog-post--computer/public/2020-04/chanel-galle.jpg?itok=tO4Jwh8I", "https://www.oxygen.com/sites/oxygen/files/styles/blog-post--computer/public/2020-04/heather-inks-pd_0.jpg?itok=l5xMBB89", "https://www.oxygen.com/sites/oxygen/files/2020-04/reginald-mcfadden.jpg", "https://www.oxygen.com/sites/oxygen/files/styles/blog-post-embedded--mobile/public/2020-04/david-gretchen-anthony-pd.jpg?itok=u2f_6jGu", "https://www.oxygen.com/sites/oxygen/files/oxygen-opengraphimage_1200x630-v1.jpg", "https://www.oxygen.com/sites/oxygen/files/styles/blog-post--computer/public/2020-04/sagal-hussein-pd.jpg?itok=HYnHK5kk", "https://www.oxygen.com/sites/oxygen/files/styles/blog-post--computer/public/2020-04/asm.jpg?itok=WExyqYzZ", "https://www.oxygen.com/sites/oxygen/files/styles/watch_full_episode_thumbnail__mobile/public/media_mpx/thumbnails/video-oxygen.akamaized.net/oxygen_video_thumbnails/NBCU_Oxygen/808/319/191007_4044011_A_Beloved_Chicago_Dermatologist_Didn_t_Call_.jpg?itok=rfyyiOUB", "https://www.oxygen.com/sites/oxygen/files/styles/blog-post--computer/public/2020-04/hawaiijpg.jpg?itok=Q2bowLJl", "https://www.oxygen.com/sites/oxygen/files/media_mpx/thumbnails/video-oxygen.akamaized.net/oxygen_video_thumbnails/NBCU_Oxygen/168/231/200407_4146345_Laurie_Barros_Revisits_Sam_Little_Crime_Scen.jpg", "https://www.oxygen.com/sites/oxygen/files/styles/watch_full_episode_thumbnail__mobile/public/media_mpx/thumbnails/video-oxygen.akamaized.net/oxygen_video_thumbnails/NBCU_Oxygen/656/738/171027_3609747_3_Teacher_Student_Sex_Scandals.jpg?itok=Rsxc7TyW", "https://www.oxygen.com/sites/oxygen/files/2020-03/kathleen-in-1998.jpg", "https://www.oxygen.com/sites/oxygen/files/styles/blog-post-embedded--mobile/public/2020-04/natalia-uriarte-francisco-uriarte-fb-pd.jpg?itok=jUpKiULU", "https://www.oxygen.com/sites/oxygen/files/styles/blog-post-embedded--mobile/public/2019-07/lynette-fromme-squeaky_0.jpg?itok=C-Yd-jVg", "https://www.oxygen.com/sites/oxygen/files/styles/watch_full_episode_thumbnail__mobile/public/media_mpx/thumbnails/video-oxygen.akamaized.net/oxygen_video_thumbnails/NBCU_Oxygen/526/531/livestream.jpg?itok=54GqUu4B", "https://www.oxygen.com/sites/oxygen/files/2020-03/kim-kardashian-west-1.jpg"], "top_img": "https://www.oxygen.com/sites/oxygen/files/oxygen-opengraphimage_1200x630-v1.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.oxygen.com/crime-time/oxygen-announces-true-crime-programming-slate-with-10-new-original-series", "title": "Oxygen Announces True Crime Programming Slate with 10 New Original Series", "meta_data": {"title": "Oxygen Announces True Crime Programming Slate with 10 New Original Series | Crime News", "og": {"site_name": "Oxygen Official Site", "type": "article", "url": "https://www.oxygen.com/crime-time/oxygen-announces-true-crime-programming-slate-with-10-new-original-series", "title": "Oxygen Announces True Crime Programming Slate with 10 New Original Series", "description": "Oxygen Media, the home for quality true crime programming, is aggressively expanding its original series slate with 10 new greenlights and the US premiere of a Piers Morgan event series, it was announced today by Rod Aissa, Executive Vice President, Original Programming and Development, Oxygen Media.", "image": "https://www.oxygen.com/sites/oxygen/files/oxygen-opengraphimage_1200x630-v1.jpg"}, "twitter": {"card": "summary_large_image", "site": "@oxygen", "description": "Oxygen Media, the home for quality true crime programming, is aggressively expanding its original series slate with 10 new greenlights and the US premiere of a Piers Morgan event series, it was announced today by Rod Aissa, Executive Vice President, Original Programming and Development, Oxygen Media.", "title": "Oxygen Announces True Crime Programming Slate with 10 New Original Series", "url": "https://www.oxygen.com/crime-time/oxygen-announces-true-crime-programming-slate-with-10-new-original-series", "image": "https://www.oxygen.com/sites/oxygen/files/oxygen-opengraphimage_1200x630-v1.jpg"}, "fb": {"app_id": 282902305377590}, "article": {"published_time": "2018-04-11T17:31:43-04:00", "modified_time": "2018-04-11T17:31:43-04:00"}, "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0", "vertical_name": "Crime News"}, "movies": [], "publish_date": 1523482303.0, "source": "https://www.oxygen.com", "summary": ""}