{"url": "https://www.wrestlinginc.com/news/2017/04/total-divas-recap-625651/", "text": "Total Divas On The E Network\n\nSeason 6 Episode 14- \"Runaway Bride\"\n\nHere is the synopsis for this week's show:\n\nDuring their wedding,Rusev pushes Lana outside of her comfort zone; Nicole gets an offer to go on 'Dancing With The Stars' and wonders if she should quit WWE; Eva Marie pushes a healthier lifestyle on her sick father.\n\nDon't miss a brand new episode of #TotalDivas tonight!!! 9/8c only on E! pic.twitter.com/voCS5i0cos — Nikki & Brie (@BellaTwins) April 26, 2017\n\n\n\nThe show starts off at The Teen Choice Awards. Where stars like Jessica Alba, Sarah Hyland and Lea Michelle are shown arriving. John Cena is also on the red carpet with The Bella sisters. Cena is scheduled to host the awards show. Nikki and Brie are presenting and are nominated for an award. Nikki Bella is asked on the red carpet about returning to the WWE. She says that she was disappointed that she wasn't drafted to Smackdown Live and is unsure of what her future will be.\n\nWe are now in Sofia, Bulgaria. Rusev's mom Slavka is awaiting her son and Lana's arrival at the airport. When they do arrive, Lana off screen talks about their upcoming wedding, which is their second. The first one took place in Malibu and this one will be more in line with Rusev's wishes of having a traditional Bulgarian wedding. Later on, Rusev and Lana are on the road together. They start arguing over who will play the role of maid of honor. To which Rusev states, that there will be no such thing at this wedding. This doesn't go over well with Lana.\n\nBack in the states at Eva Marie's parents home in Concord, California. Eva is with her parents Josie and Barry. Eva's father has recently had knee replacement surgery. He and Eva get into a bit of argument because she didn't bring over the food, that he wanted. Eva tells her dad that he shouldn't be eating McDonalds. She is worried about her father's health and she wants to see him retire. Barry is not keen on the idea of retiring because he feels like he is being put out to pasture.\n\nBack in Bulgaria, Lana and Rusev have arrived at their hotel and meet up with friends and family. Once Lana and Rusev get settled into their honeymoon suite. Lana once again attempts to get Rusev to allow her to have a maid of honor at their wedding. Lana suggests her sister assume the same role, she had at the first wedding. Rusev gets annoyed with Lana pushing for this again. He tells her that they can't mess with Bulgarian traditions, that go back thousands of years. Rusev's best friend and wife are slated to be the best man and woman at their upcoming wedding. Rusev has also pegged them as being future god parents.... Off screen, Lana makes mention of a black eye that Rusev is sporting, as a result of a recent match. Lana is angry with Rusev's stubbornness and suggests giving him another black eye. Back in the hotel room, The couple are still arguing. Lana complains about Rusev's family traditions. Rusev ends the argument by telling Lana, that she should have married a Greek guy instead, if she wanted to be able to make changes.\n\nBack in Los Angeles, The Bellas are doing a photo shoot at Global Fitness. When the shoot is done, Nikki Bella gets a message and an offer to be on 'Dancing With The Stars'. Nikki tells Brie about it and is very excited about the possibility. Nikki asks Brie what night the show is on the air, and wonders if she can do both the WWE and Dancing at the same time. When Nikki finds out that the show is on opposite of Raw on Mondays. She says that she will be going to Smackdown Live instead. Nikki suggests promoting her neck injury and return on both platforms. Brie discourages Nikki by questioning her dancing skills. Nikki tries to demonstrate her abilities to Brie.\n\nBack at Eva Marie's parents house, The family is getting together for dinner. Eva is concerned about her father's health and eating habits. Barry has colon cancer and it hasn't gone away. After the dinner, Eva and her husband Jonathan have a chat in the kitchen. Eva tells him about the concerns for her father. She then decides to take action. She throws out all the leftovers and tells her family, that she is going to start taking control of her father's diet.\n\nMeanwhile in Bulgaria. Lana gets christened in an Orthodox church. She goes through the rituals while Rusev's family aids and looks on. Lana is prayed to, told to spit on the ground and then step on it. Afterwards, She takes off her shoes and places her bare feet in water, and leans over while the priest christens her with water repeatedly. Lana off screen, talks of how upset she is, that Rusev didn't tell her, about what she would had to do. Lana is fuming in the church while Rusev is instructing her on proper hand placement..... Moments later, Lana is asked to have a part of her hair cut and she refuses. Lana looks over her shoulder and tells Rusev, that she should have been told about this beforehand. Rusev is furious and gives Lana back a cold stare. The priest and others try to get Lana to go through with the tradition. Lana spouts back that she wasn't told about these traditions in advance. Rusev looks away in disbelief. After some convincing by her mom Judy, Lana relents and has a small part of her hair cut. Off screen, Lana says that she is so livid with Rusev right now.\n\nThe Bella family is together having lunch in Arizona. Nikki tells her brother and sister in-law about her Dancing With The Stars opportunity. Nikki says that she won't be able to do both the WWE and the dancing show. That she might have to pick one over the other. Nikki admits that she has enjoyed her time away from being on the road and wrestling. She talks about not being cleared yet to return to the WWE, and how she doesn't feel wanted right now by the company. Nikki's brother suggests that she does Dancing With The Stars. He feels that it will open up more opportunities for her outside of wrestling.\n\nBack in Bulgaria. The drama continues for Rusev and Lana. After the christening ceremony, Lana vents to her parents outside of the church. Rusev comes out to address his wife, and Lana airs out her grievances with him. Rusev doesn't understand what the big deal is and why Lana threw a tantrum and disrespected the church. A few expletives are exchanged, while a camera hidden behind a tree, picks up the conversation. Lana tells him that she is upset and leaving. Rusev figures that they are heading back together to the hotel but Lana tells him that she is leaving on her own. Rusev calmly responds \"To America?\". Rusev says that if that's what she wants, Lana can do it.... Moments later, Lana is shown crying somewhere on the grounds outside of the church. Her mom Judy tries to calm her down. When Rusev interrupts the conversation and tells Lana, that she now has to be dipped into the river. Lana pouts like a child and says that she doesn't want to do it. Rusev laughs because he was just joking. Despite Rusev trying to bring some levity to the situation, Lana is still upset.\n\nMeanwhile in Concord, California. Eva Marie and Jonathan have gone grocery shopping for her dad. Eva tries to institute a raw food diet to help with Barry's cancer. Eva and her husband are preparing a health shake for Barry's breakfast. He's not going for it and wants bacon and eggs. The green smoothies with veggies don't go over well with Barry. Eva Marie's brother Neal shows up and he gives his two cents on Eva's forced diet on their dad. Neal is not against his dad eating healthier but doesn't like the extreme transition set up by his sister..... Later on, Eva Marie starts snooping around the house looking to see if her father is still smoking. She searches the house with Jonathan. Eva says that her dad has been known to sneak around and smoke cigarettes on the property. Eva is upset when she does find a cigarette butt in the backyard. She is upset after 3 heart attacks and a 15 year battle with cancer, that her father is still smoking. Later on, Eva has a long time chat with her husband about the approach to take with her dad. Jonathan suggests that Eva take it easy with him because he has been set in his ways for so long.\n\nJimmy Uso, Trinity(Naomi) and Natalya have arrived for Lana and Rusev's second wedding in Bulgaria. They can't believe that they have committed to this. They have taken 3 flights that combined for nearly 20 hours. Natalya and Naomi have the impression that they will both be brides maids for this wedding. On the cab ride from the airport to the hotel. The Bulgarian cab driver tries to speak to Jimmy Uso in his native language..... After Nattie has arrived at the hotel. Lana comes by to see her. She tells Natalya about her traumatizing day at the christening. Natalya sympathizes with Lana's plight and jokes that Lana's mom may make her want to grow a beard.\n\nWe are now at John Cena and Nikki Bella's home in Tampa, Florida. John says \"Nikki, I Love You\" and gives her a diamond... dallas page yoga dvd set!.... Just kidding.... Nikki tells John about her opportunity on Dancing With The Stars. He congratulates her but is surprised and wants to know what it means for Nikki's future. Nikki tells him about potentially doing the WWE and the stars show on ABC at the same time. John cites himself as an example and provides an interesting take on handling both. How he has been doing the WWE and a fox reality tv series at the same time. How it has been risky for him because if he were to be injured on one show, than it would effect him being able to perform on both shows. Cena suggests that Nikki doing WWE and dancing with the stars would be too physically demanding for Nikki to do. He asks her what is most important to her and says that Nikki can't do both, that she has to choose one.\n\nLana and Rusev are with friends and family having dinner at a restaurant in Plovdiv, Bulgaria. Natalya toasts to \"the weird and wacky world of Bulgaria\". Rusev questions Nattie's choice of words and then suggests that everyone have some \"Rakia\". He promises that the alcohol is not too strong. Jimmy Uso, Natalya and Naomi all have comical reactions after taking a sip. Jimmy is hyped for it but appears to have burned a hole in his throat after drinking some of that \"Rakia\". Rusev then toasts to everyone and tells the women that he has prepared for them to wear traditional Bulgarian attire. The women have to take notes and prepare because they will be dancing in the streets during the wedding. Lana and company all leave and get changed. They return in the attire and dance with Bulgarian men. Trinity and Lana seem game but Natalya is uncomfortable. Jimmy Uso gets a kick out of it and likes his wife's attire.\n\nTrinity and Rusev def do NOT have the same taste in alcohol. #TotalDivas pic.twitter.com/niceo4dLJM — Total Divas (@TotalDivas) April 27, 2017\n\n\n\n\n\nFYI: At Bulgarian weddings, dancing is mandatory. Watch an all-new #TotalDivas TONIGHT at 9|8c, only on E! pic.twitter.com/8fvz0duSqE — Total Divas (@TotalDivas) April 26, 2017\n\n\n\nBack in Concord, California. Eva Marie has an emotional conversation with her father. They discuss their time apart from one another, Barry's health and potential retirement. Eva is told by her father that he is not ready to retire yet despite working for 55 years straight. Barry appreciates Eva's love and care for him and promises to let her know when he officially decides to retire.\n\nBack at the dinner in Bulgaria. Lana and Rusev walk off to have a discussion about their recent differences. Lana is still hurt by the fact that Rusev is not respecting her feelings. He doesn't understand why Lana is upset to begin with. He then goes over another bone of contention between them, which is the Bulgarian tradition of who the best man and woman can be in a wedding ceremony, that the best man has to be married and his marital advice must take precedence during any issues. Lana is not down with this at all. Her and Rusev continue to argue and not see eye to eye. Lana walks off, worse off than she was before the conversation even started. When Lana returns to the dinner table. Naomi sees that Lana is upset and asks her about it. Lana starts ranting about how Rusev will never admit to being wrong. Lana ends the rant by saying, \"I don't want his stupid traditions\".\n\nThe very next day, Lana is greeted by Natalya in her hotel room. Lana is in her wedding dress. They have a talk about Lana's recent issues with Rusev. Natalya tries to calm Lana's anxiety by suggesting that she surrender and let go of her feelings. Nattie then takes Lana out to the balcony and gets her to scream \"I surrender\".\n\nNikki Bella meets up with her sister Brie in Phoenix. They discuss Nikki's current situation and future. Nikki then gets in contact with her agent about the Dancing With The Stars opportunity. Nikki tells her agent that she is going to pass on the offer. Nikki says that she wants her comeback to be with the WWE and nowhere else. Her agent \"Blake\" tries to convince her that she needs to think about the future, and asks Nikki if she is sure about this. Nikki reassures him that she is.\n\nLana and Rusev's Bulgarian wedding has begun. Lana is given instructions on all the specific traditions. Part of it entails Lana hiding her shoe and Rusev arriving to buy the bride from the other women. Natalya and Lana's sister are chosen to negotiate the price, at the door when Rusev arrives to claim his wife. A nice touch as Rusev's ring entrance plays when he arrives outside. He has a bottle of liquor with him and heads to Lana's room with several friends and family members in tow. Rusev knocks on the door and says that he wants his wife. The women chant in Bulgarian on the other side of the door. Natalya then negotiates a price with Rusev. The door is then opened slightly for him to start giving money through. Rusev hands over some bills and the women chant \"more money\" at him until he gives them the right amount. When Rusev finally meets the asking price, the door is open and Rusev and an entire Bulgarian band follows. Rusev then searches for and finds Lana's hidden shoe. Before they head out for the remaining festivities. Lana takes Rusev aside and apologizes to him for her behavior. After the chat, They head to street and celebrate in the streets. The wedding ceremony follows and can be seen in the video below. Rusev and Lana exchange vows, They both have crowns put on their heads and they hold candles. After the ceremony, Lana and Rusev throw white doves into the air. The after party occurs and Lana states that she is so happy with the way things turned out. The show ends on this note.\n\nNext week on Total Divas. Maryse and Miz try to jazz up their relationship. Natalya's cat actually gets an agent and Nikki Bella's in ring training for her return continues.", "images": ["https://cdn.relaymedia.com/ping?url=https%3A%2F%2Fwww%2EWrestlingInc%2Ecom%2Fnews%2F2017%2F04%2Ftotal%2Ddivas%2Drecap%2D625651%2F", "https://www.wrestlinginc.com/assets/ui/images/layout/winc-logo.png", "https://www.wrestlinginc.com/assets/lib/counters/news.asp?newsId=625651", "https://www.wrestlinginc.com/assets/ui/images/general/clear.gif", "https://www.wrestlinginc.com/assets/ui/images/layout/f-logo-s.png", "https://www.wrestlinginc.com/assets/ui/images/footer/google-play.png", "https://www.wrestlinginc.com/assets/ui/images/footer/ios-app.png", "http://i1.ytimg.com/vi/wVXd9rt6bkg/maxresdefault.jpg", "https://c.statcounter.com/256370/0//1/"], "top_img": "http://i1.ytimg.com/vi/wVXd9rt6bkg/maxresdefault.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.WrestlingInc.com/news/2017/04/total-divas-recap-625651/", "title": "Total Divas Recap (4/26): Lana & Rusev's Bulgarian Wedding, Nikki Ponders Quitting The WWE And More", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "title": "Total Divas Recap (4/26): Lana & Rusev's Bulgarian Wedding, Nikki Ponders Quitting The WWE And More", "description": "Total Divas Recap (4/26): Lana & Rusev's Bulgarian Wedding, Nikki Ponders Quitting The WWE And More", "keywords": "lana, wwe news, wrestling news", "image": "http://i1.ytimg.com/vi/wVXd9rt6bkg/maxresdefault.jpg", "medium": "article", "article": {"published_time": "2017-04-26T20:49:21 -0400", "tag": "lana, wwe news, wrestling news"}, "og": {"type": "article", "site_name": "Wrestling Inc.", "image": "http://i1.ytimg.com/vi/wVXd9rt6bkg/maxresdefault.jpg", "url": "https://www.WrestlingInc.com/news/2017/04/total-divas-recap-625651/", "title": "Total Divas Recap (4/26): Lana & Rusev's Bulgarian Wedding, Nikki Ponders Quitting The WWE And More - Wrestling Inc.", "description": "Total Divas Recap (4/26): Lana & Rusev's Bulgarian Wedding, Nikki Ponders Quitting The WWE And More"}, "fb": {"app_id": 123325808288224, "pages": 225021057526395}, "twitter": {"site": "@WrestlingINC", "url": "https://www.WrestlingInc.com/news/2017/04/total-divas-recap-625651/", "title": "Total Divas Recap (4/26): Lana & Rusev's Bulgarian Wedding, Nikki Ponders Quitting The WWE And More", "description": "Total Divas Recap (4/26): Lana & Rusev's Bulgarian Wedding, Nikki Ponders Quitting The WWE And More", "card": "summary_large_image", "image": "http://i1.ytimg.com/vi/wVXd9rt6bkg/maxresdefault.jpg", "app": {"name": {"iphone": "Wrestling Inc.", "ipad": "Wrestling Inc.", "googleplay": "Wrestling Inc."}, "id": {"iphone": 1102820164, "ipad": 1102820164, "googleplay": "com.rumble.wrestlinginc"}}}, "msapplication-TileImage": "/assets/ui/images/icons/icon-144x144.png"}, "movies": ["https://www.youtube.com/embed/ceDltS35fpE", "https://www.youtube.com/embed/xSRGbP4DzGY", "https://www.youtube.com/embed/a02i4Y_itIo", "https://www.youtube.com/embed/4DFizvt_0Xo", "https://www.youtube.com/embed/wVXd9rt6bkg", "https://www.youtube.com/embed/sK4LM-3slQc"], "publish_date": 1493254161.0, "source": "https://www.wrestlinginc.com", "summary": ""}