{"url": "https://en.wikipedia.org/wiki/Game_of_Thrones_(season_7)", "text": "The seventh and penultimate season of the fantasy drama television series Game of Thrones premiered on HBO on July 16, 2017, and concluded on August 27, 2017.[1][3] Unlike previous seasons, which consisted of ten episodes each, the seventh season consisted of only seven episodes.[4] Like the previous season, it largely consisted of original content not found in George R. R. Martin's A Song of Ice and Fire series, while also incorporating material that Martin revealed to showrunners about the upcoming novels in the series.[5][better source needed] The series was adapted for television by David Benioff and D. B. Weiss.\n\nThe penultimate season focuses primarily on the convergence of the show's main plotlines in preparation for the final season. Daenerys Targaryen arrives in Westeros with her army and three dragons and begins to wage war against the Lannisters while Jon Snow continues his efforts to find ways to defeat the Army of the Dead. He forges an alliance with Daenerys in an attempt to unite their forces against the White Walker army.\n\nHBO ordered the seventh season on April 21, 2016, three days before the premiere of the show's sixth season, and began filming on August 31, 2016. The season was filmed primarily in Northern Ireland, Spain, Croatia and Iceland.\n\nGame of Thrones features a large ensemble cast, including Peter Dinklage, Nikolaj Coster-Waldau, Lena Headey, Emilia Clarke, and Kit Harington. The season introduces several new cast members, including Jim Broadbent and Tom Hopper.\n\nThe series received 22 nominations for the 70th Primetime Emmy Awards,[6] and won for Outstanding Drama Series and Dinklage won for Outstanding Supporting Actor in a Drama Series.[7]\n\nEpisodes [ edit ]\n\nCast [ edit ]\n\nMain cast [ edit ]\n\nGuest cast [ edit ]\n\nThe recurring actors listed here are those who appeared in season 7. They are listed by the region in which they first appear.\n\nProduction [ edit ]\n\nCrew [ edit ]\n\nSeries creators and executive producers David Benioff and D. B. Weiss serve as showrunners for the seventh season. The directors for the seventh season are Jeremy Podeswa (episodes 1 and 7), Mark Mylod (episodes 2 and 3), Matt Shakman (episodes 4 and 5) and Alan Taylor (episode 6). This marks Taylor's return to the series after an absence since the second season. Shakman is a first-time Game of Thrones director, with the rest each having directed multiple episodes in previous seasons.[36] Michele Clapton returned to the show as costume designer, after spending some time away from the show in the sixth season. She previously worked on the show for the first five seasons, as well as the end of the sixth season.[36]\n\nWriting [ edit ]\n\nThe seventh season contains original material not found in the A Song of Ice and Fire series.[37][needs update] Some of the show's sixth season also consists of material revealed to the writers of the television series during discussions with Martin.[38]\n\nFilming [ edit ]\n\nThe shores of Gaztelugatxe were used as a location for filming Season 7.\n\nFilming began on August 31, 2016, at Titanic Studios in Belfast,[39] and ended in February 2017.[40][41][42] In an interview with the showrunners, it was announced that the filming of the seventh season would be delayed until later in the year due to necessary weather conditions for filming. The showrunners stated \"We're starting a bit later because, you know, at the end of this season, winter is here, and that means that sunny weather doesn't really serve our purposes any more. We kind of pushed everything down the line so we could get some grim, gray weather even in the sunnier places that we shoot.\"[43]\n\nGirona, Spain, did not return as one of the filming locations.[44] Girona stood in for Braavos and parts of King's Landing.[44] It was later announced that the seventh season would film in Northern Ireland, Spain and Iceland, with filming in Northern Ireland beginning in August 2016.[4][40] The series filmed in the Spanish cities Seville, Cáceres, Almodóvar del Río, Santiponce, Zumaia and Bermeo.[45] Spanish sources announced that the series would be filming the seventh season on Muriola Beach in Barrika, Las Atarazanas, the Royal Dockyards of Seville and at the shores of San Juan de Gaztelugatxe, an islet belonging to the city of Bermeo.[46][47][48] The series returned to film at The Dark Hedges in Stranocum, which was previously used as the Kingsroad in the second season.[49] Some scenes were filmed in Iceland.[50] Filming also occurred in Dubrovnik, Croatia, which is used for location of King's Landing.[51] The scene where Arya was reunited with Nymeria was filmed in Alberta, Canada.[52]\n\nCasting [ edit ]\n\nDeadline reported on June 21, 2016, that the five main cast members, Peter Dinklage, Nikolaj Coster-Waldau, Lena Headey, Emilia Clarke, and Kit Harington had been in contract negotiations for the final two seasons. It was reported that the cast members have increased their salary to $500,000 per episode for the seventh and eighth season.[53][54] It was later reported that the actors had gone through a renegotiation, for which they had increased their salary to $1.1 million per episode for the last two seasons.[55]\n\nOn August 31, 2016, Entertainment Weekly reported that Jim Broadbent had been cast for the seventh season in a \"significant\" role.[31] It was announced that the role of Dickon Tarly has been recast, with Tom Hopper replacing Freddie Stroma, who had previously played the role in \"Blood of My Blood\".[29] The seventh season sees the return of Mark Gatiss as Tycho Nestoris, who did not appear in the sixth season,[30] Ben Hawkey as Hot Pie, who last appeared in the fourth season, and Joe Dempsie as Gendry, who last appeared in the third season and maintains his status as starring cast member. Members of the British indie pop band Bastille were reported to have filmed cameo appearances.[56] British singer-songwriter Ed Sheeran also makes a cameo appearance in the season.[57] Frontman of American heavy metal band Mastodon, Brent Hinds, has also revealed he would have a cameo appearance. This is Hinds' second cameo in the series, following his appearance (along with bandmates Brann Dailor and Bill Kelliher) in the fifth season.[58] New York Mets baseball pitcher Noah Syndergaard made a background cameo as a javelin-throwing Lannister soldier in \"The Spoils of War.\"[59]\n\nEpisodes [ edit ]\n\nOn April 21, 2016, HBO officially ordered the seventh season of Game of Thrones, just three days prior to the premiere of the show's sixth season.[60] In a June 2016 interview with Variety, co-creators David Benioff and D. B. Weiss revealed the seventh season would likely consist of fewer episodes, stating at the time of the interview that they were \"down to our final 13 episodes after this season. We're heading into the final lap.\"[61][62] Director Jack Bender, who worked on the show's sixth season, said that the seventh season would consist of seven episodes.[63] Benioff and Weiss stated that they were unable to produce 10 episodes in the show's usual 12 to 14 month time frame, as Weiss said \"It's crossing out of a television schedule into more of a mid-range movie schedule.\"[61] HBO confirmed on July 18, 2016, that the seventh season would consist of seven episodes, and would premiere later than usual in mid-2017 because of the later filming schedule.[4] Later it was confirmed that the season would debut on July 16.[64] The seventh season includes an 81-minute finale;[65] this was the series' longest episode until it was surpassed by the Season 8 episode \"The Long Night\", which is 82 minutes. Season 7's penultimate episode also runs for 71 minutes – around 16 minutes longer than an average Game of Thrones episode. The first five episodes mostly run longer than average (55 minutes), at 59, 59, 63, 50, and 59 minutes respectively.[66] The previous longest episode in the series was the sixth-season finale, \"The Winds of Winter\", which ran for 69 minutes.[65]\n\nMusic [ edit ]\n\nRamin Djawadi returned as the composer of the show for the seventh season.[67]\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nOn Metacritic, the season (based on the first episode) has a score of 77 out of 100 based on 12 reviews, indicating \"generally favorable reviews\".[68] On Rotten Tomatoes, the seventh season has a 93% approval rating from 51 critics with an average rating of 8.22 out of 10, with the site's consensus reading, \"After a year-long wait, Game of Thrones roars back with powerful storytelling and a focused interest in its central characters—particularly the female ones.\"[69]\n\n\n\n\n\nGame of Thrones (season 7): Critical reception by episode Season 7 (2017) : Percentage of positive reviews tracked by the website Rotten Tomatoes[69]\n\nRatings [ edit ]\n\nThe series premiere surpassed 30 million viewers across all of the network's domestic platforms weeks after its release. The show's numbers continued to climb in other countries as well. In the UK, the premiere got up to 4.7 million viewers after seven days, setting a new record for Sky Atlantic. Compared to the previous season, HBO Asia saw an increases of between 24 percent to 50 percent. HBO Latin America saw a record viewership in the region, with a 29 percent climb. In Germany, the show went up 210 percent, in Russia it climbed 40 percent and in Italy it saw a 61 percent increase.[70] In the United States, the finale was watched by 12.1 million viewers on its first airing on television, and 16.5 million when viewings on HBO Now and HBO Go apps are included. Over the season, the viewer numbers averaged at over 30 million per episode across all platforms.[71]\n\n^1 Live +7 ratings were not available, so Live +3 ratings have been used instead.\n\nAccolades [ edit ]\n\nRelease [ edit ]\n\nBroadcast [ edit ]\n\nThe season was simulcast around the world by HBO and its broadcast partners in 186 countries. In some countries, it aired the day after its first release.[70]\n\nMarketing [ edit ]\n\nOn July 23, 2016, a teaser production trailer was released by HBO at the 2016 San Diego Comic-Con. The trailer mostly consisted of voice overs, and shots of crew members creating sets and props.[112] The first footage from the season was revealed in a new promotional video released by HBO highlighting its new and returning original shows for the coming year on November 28, 2016, showcasing Jon Snow, Sansa Stark and Arya Stark.[113][114]\n\nOn March 1, 2017, HBO and Game of Thrones teamed up with Major League Baseball (MLB) for a cross-promotional partnership. At least 19 individual teams participated in this promotion.[115] On March 8, 2017, HBO released the first promotional poster for the season ahead of the SXSW Festival in Austin, Texas, which teases the battle of \"ice vs. fire\". Showrunners Benioff and Weiss also spoke at the event, along with fellow cast members Sophie Turner and Maisie Williams.[116]\n\nOn March 9, 2017, HBO hosted a live stream on the Game of Thrones Facebook page that revealed the premiere date for the seventh season as being July 16, 2017. It was accompanied by a teaser trailer. On March 30, 2017, the first official promo for the show was released, highlighting the thrones of Daenerys Targaryen, Jon Snow, and Cersei Lannister.[117] On April 20, 2017, HBO released 15 official photos shot during the season.[118] On May 22, 2017, HBO released several new photos from the new season.[119] On May 23, 2017, HBO released the official posters featuring the Night King.[120] The first official trailer for season 7 was released on May 24, 2017.[27] The trailer set a world record for being the most viewed show trailer ever, being viewed 61 million times across digital platforms, in the first 24 hours.[121] The second official trailer was released on June 21, 2017.[26] The season premiere was screened at the Walt Disney Concert Hall in Los Angeles on July 12, 2017.[122]\n\nHome media [ edit ]\n\nThe season was released on Blu-ray and DVD in region 1 on December 12, 2017.[123][124]\n\nIllegal distribution [ edit ]\n\nThe season premiere was pirated 90 million times in the first three days after it aired.[125] On August 4, 2017, it was reported that, two days before its original broadcast, the fourth episode of the season was leaked online from Star India, one of HBO's international network partners.[126] The leaked copy has the \"for internal viewing only\" watermark. On July 31, 2017, due to a security breach, HBO was the victim of 1.5 terabytes of stolen data.[127] However, \"this was not related to this episode leak\", according to The Verge.[128] On August 16, 2017, four days before its intended release, it was reported that HBO Spain and HBO Nordic accidentally allowed the sixth episode of the series on-demand viewing for one hour before being removed.[129]\n\nData from piracy monitoring firm MUSO indicates that season seven was pirated more than one billion times mostly by unauthorized streaming, with torrent and direct downloads accounting for about 15 percent of this piracy. On average, each episode is estimated to have been pirated 140 million times,[130] making Game of Thrones the most-pirated television series in 2017.[131]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Global_thinking.svg/10px-Global_thinking.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/92/Game_of_Thrones_Season_7.png/220px-Game_of_Thrones_Season_7.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Gaztelugatxe_4199995260.jpg/220px-Gaztelugatxe_4199995260.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/9/92/Game_of_Thrones_Season_7.png", "https://en.wikipedia.org/api/rest_v1/page/graph/png/Game_of_Thrones_%28season_7%29/0/82913086efae8dcbcb0869daf2b8e26530a73369.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/9/92/Game_of_Thrones_Season_7.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Game_of_Thrones_(season_7)", "title": "Game of Thrones (season 7)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/9/92/Game_of_Thrones_Season_7.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}