{"url": "https://www.usmagazine.com/entertainment/news/lyle-menendez-opens-up-after-killing-parents-7-revelations-w459143/", "text": "Nearly 27 years after brutally slaying their parents in August 1989, Lyle and Erik Menendez are back in the public eye. The two-hour Thursday, January 5, ABC special, entitled Truth And Lies: The Menendez Brothers, revisited the double homicide and featured an interview with Lyle as he serves his two life sentences in Mule Creek State Prison in Ione, California.\n\nWatch Us Weekly Video’s recap above, and read on for seven revelations from the chilling program.\n\nLyle and Erik Robbed Houses in Calabasas\n\nThe murders of Kitty and Jose Menendez were not Lyle and Erik’s first brush with crime. When the affluent Menendez family moved to Los Angeles in 1987, they initially settled in Calabasas. Karen Ferrell, a close friend of the late Kitty, pointed out houses in the neighborhood, even saying, “Bruce Jenner — when he was Bruce Jenner — had a house here.” Karen then continued, saying of the brothers, “They were bored.… Robbing houses was a challenge.… They didn’t think they’d be caught.”\n\nTheir father, the late Jose, a wealthy Hollywood producer at the time, attempted to smooth things over by visiting each house and writing the victims a check in the amount equal to the value of what was stolen. Their neighbor Alicia Hercz told the camera, “The main message was, ‘How stupid of you to get caught.'” According to Craig Cignarelli, a former friend of Erik’s, after getting caught stealing hundreds of thousands of dollars worth of jewelry and other items, “They both got probation… moved down to Beverly Hills.”\n\nErik’s Modeling Photographer Read His Screenplay About Murdering His Parents\n\nCignarelli admitted to the camera about Erik, “We wrote a screenplay. We wrote several screenplays.” Photographer Philip Kearney, known for taking the infamous shirtless modeling photos of Erik, was a recipient of the script, saying it was “about the boy who kills his parents to collect the insurance.” Cignarelli clarified the plot point, saying, “We needed the characters to get money somehow …”\n\nHe continued, “As time went by, Erik took that screenplay and reworded the first four or five pages to exactly what happened in the crime.” When Kearney turned on the news the morning after the murder, he recalled feeling a “chilling realization.” Kearney recalled the famous underwear photoshoot with Erik, saying, “The last photo shoot was a little bit different.… He was a quieter.… A little more humble.… Those pictures to me look a little more haunting.”\n\nKitty Admitted in Front of Erik That She Was Taking Him Out of Her Will\n\nKitty’s friend Karen Ferrell then recalled a moment between Kitty and Erik. Kitty was at the family computer updating her will and speaking openly to Karen about it. Karen recalled mentioning to Kitty that Erik was listening in the other room: “She said, ‘I don’t care. They know I’m not gonna give them any money.'” (The family estate was worth 14 million at the time of her murder.) Kitty’s brother Brian Anderson revealed to the camera that Kitty was worried about her children, saying, “She was really concerned about the irresponsibility.… Lyle was stressing her a lot.”\n\nLyle and Erik Shot Their Parents to Death, Then Went Shopping for Rolexes Weeks Later\n\nLyle and Erik’s bizarre post-murder behavior was one of the reasons they were eventually convicted of murder in the first degree. Beverly Hills Detective Leslie Zoeller recalled of the brutal murder scene on August 20, 1989, “Kitty was wearing white, she was covered in blood.… There was brain matter on the ceiling, on the windows. It was really horrendous.” In a clip from a 1996 interview with Barbara Walters, Erik recalled, “We didn’t have an alibi — we just said we were at the movies.”\n\nFive weeks after the murder, Erik and Lyle received $400,000 in life insurance money and decided to go on a spending spree. ABC journalist Terry Moran recalled, “They were having a grand ol’ time spending the money of a dead man.” They bought Rolexes, a Porsche and even took the time to invest some of the money in a friend’s business before their eventual arrest.\n\nErik and Lyle’s Abuse Claims\n\nThe crux of Lyle and Erik’s 1993 trial hinged on testimony that the two of them were allegedly abused by their parents. Prosecutor Pam Bozanich recalled about Erik’s lawyer, Leslie Abramson, “Everyone told me, ‘Watch out for her. She will lie, cheat and steal.” Pam continued, “The whole ‘abuse excuse’ is a lie.”\n\nHowever, journalist Moran backed Erik and Lyle’s abuse claims. Moran explained of their gruesome abuse testimony, “There was a level of detail.… There are things that people remember from real life that you almost wouldn’t kind of make up.” He recalled noticing Erik’s reaction to Lyle’s testimony of his father molesting him and said, “I saw this vein start popping out of his forehead… that emotion. That’s what a victim looks like.”\n\nMoran also noted that several family members testified to the abuse. “It’s hard to explain that away,” said Moran. He later told the camera, “If the Menendez brothers were the Menedez sisters, they would be free today. We don’t wanna think that boys get raped by their fathers.”\n\nKitty’s brother, on the other hand, did not believe the abuse claims at all: “There was certainly no indication at any time that there was ever any abuse.… I mean it just didn’t happen.… I think the motive was strictly money.” He later said, “The idea that Erik and Lyle were abused by my sister Kitty was gratuitous.”\n\nErik and Lyle Both Got Married While Serving Life Sentences\n\nEventually, the Menendez case resulted in a mistrial, causing the whole process to start all over again. The second trial went much more quickly, and a verdict came in July 1996, which followed the October 1995 decision in the similarly captivating O.J. Simpson case. Terry Moran remembered, “When O.J. Simpson was acquitted … it brought tremendous law-and-order pressure on jurors across the spectrum.”\n\nThey were quickly sentenced to murder in the first degree and are both serving consecutive life sentences in separate prisons. Lyle and Erik, now 48 and 45 years old respectively, both tied the knot while behind bars. Erik is married to Tammi Menendez, who — in a 2002 interview with Barbara Walters — revealed, “I fell in love with him unexpectedly.… And now I’m very happy.”\n\nLyle has been married twice and spoke out about his current relationship with wife Rebecca Sneed, saying, “Physical comfort is much less important than your connection with the people around you,… We’ve been married 15 years.” Lyle then called it a “healthy marriage.”\n\nLyle: “It Could Have So Easily Not Have Happened”\n\nThe most fascinating part of the documentary may have been when Lyle spoke publicly about his life behind bars. Reflecting on the past, he said, “You’re not living in the reality of what has occurred.… You’re living like a ghost among people that are alive. You’re just adrift.” He spoke about his life now, saying he has a “high level of stress.”\n\nHe continued, “My own childhood prepared me surprisingly well for the chaos of prison life.… You feel that loss of freedom deeply.” About murdering both of his parents, he stated, “It’s shocking to think about that that happened.… It’s still jarring. Like, it seems so far removed from who I am and who I was …” He went on to call his life “a failed, destructive ending.… It could have so easily not have happened.”\n\nThe documentary ended after revealing that Lyle and Erik haven’t seen each other since 1996.\n\nTell Us: What did you think of Lyle’s comments?\n\nTruth and Lies: The Menendez Brothers airs on ABC Thursday, January 5, at 9 p.m. ET.", "images": ["https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered-green.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/bg-subscribe.png", "https://www.usmagazine.com/wp-content/uploads/2020/04/Screen-Shot-2020-04-09-at-11.48.30-AM.png?w=100&h=100&crop=1", "https://www.usmagazine.com/wp-content/uploads/lyle-inset-5ae73df9-fba9-4cb1-aefd-f1e04e16fbbc.jpg", "https://www.usmagazine.com/wp-content/uploads/2020/04/woman-eating-bar1-1.jpg?w=100&h=100&crop=1", "https://i2.wp.com/www.usmagazine.com/wp-content/uploads/lyle-8ad3c55f-c32e-4abc-8ef9-05ef9ce80bf4.jpg?crop=1px%2C16px%2C1999px%2C1049px&resize=1200%2C630&ssl=1", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/icon-download.svg", "https://www.usmagazine.com/wp-content/uploads/2020/04/shutterstock_1701843913-1.jpg?w=100&h=100&crop=1"], "top_img": "https://i2.wp.com/www.usmagazine.com/wp-content/uploads/lyle-8ad3c55f-c32e-4abc-8ef9-05ef9ce80bf4.jpg?crop=1px%2C16px%2C1999px%2C1049px&resize=1200%2C630&ssl=1", "keywords": [], "authors": ["Cait Raft"], "canonical_link": "https://www.usmagazine.com/entertainment/news/lyle-menendez-opens-up-after-killing-parents-7-revelations-w459143/", "title": "Lyle Menendez Opens Up After Killing Parents: 7 Revelations", "meta_data": {"viewport": "width=device-width, initial-scale=1", "ir-site-verification-token": "-206090124", "fo-verify": "49e6fc6a-c68d-447f-9978-70e3eac455ac", "msvalidate.01": "097DBAAF43A9B61E9E4259AA7D75B069", "description": "Lyle Menendez spoke out on 'Truth and Lies: The Menendez Brothers,' nearly 27 years after he and brother Erik murdered their parents — here are seven revelations from the Thursday, January 5, ABC special", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Lyle Menendez Speaks Out After Killing Parents: 7 Biggest Revelations", "description": "Lyle Menendez spoke out on 'Truth and Lies: The Menendez Brothers,' nearly 27 years after he and brother Erik murdered their parents — here are seven revelations from the Thursday, January 5, ABC special", "url": "https://www.usmagazine.com/entertainment/news/lyle-menendez-opens-up-after-killing-parents-7-revelations-w459143/", "site_name": "Us Weekly", "updated_time": "2017-10-15T20:17:03+00:00", "image": {"identifier": "https://i2.wp.com/www.usmagazine.com/wp-content/uploads/lyle-8ad3c55f-c32e-4abc-8ef9-05ef9ce80bf4.jpg?crop=1px%2C16px%2C1999px%2C1049px&resize=1200%2C630&ssl=1", "secure_url": "https://i2.wp.com/www.usmagazine.com/wp-content/uploads/lyle-8ad3c55f-c32e-4abc-8ef9-05ef9ce80bf4.jpg?crop=1px%2C16px%2C1999px%2C1049px&resize=1200%2C630&ssl=1", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/UsWeekly", "tag": "Video", "section": "Entertainment", "published_time": "2017-01-06T09:40:00+00:00", "modified_time": "2017-10-15T20:17:03+00:00"}, "fb": {"app_id": 1785612128341436}, "twitter": {"card": "summary_large_image", "description": "Lyle Menendez spoke out on 'Truth and Lies: The Menendez Brothers,' nearly 27 years after he and brother Erik murdered their parents — here are seven revelations from the Thursday, January 5, ABC special", "title": "Lyle Menendez Speaks Out After Killing Parents: 7 Biggest Revelations", "site": "@usweekly", "image": "https://i2.wp.com/www.usmagazine.com/wp-content/uploads/lyle-8ad3c55f-c32e-4abc-8ef9-05ef9ce80bf4.jpg?crop=1px%2C16px%2C1999px%2C1049px&resize=1200%2C630&ssl=1", "creator": "@usweekly"}, "generator": "WordPress 5.4"}, "movies": [], "publish_date": 1483695600.0, "source": "https://www.usmagazine.com", "summary": ""}