{"url": "https://www.independent.co.uk/arts-entertainment/tv/game-of-thrones/game-of-thrones-recap-season-8-catch-up-plot-spoilers-characters-release-date-latest-a8618196.html", "text": "The eighth and final season of Game of Thrones is currently in production, with fans eagerly awaiting what promises to be a thrilling climax.\n\nBased on George RR Martin’s Song of Fire and Ice series of fantasy novels about the warring Seven Kingdoms of Westeros, DB Weiss and David Benioff’s HBO adaptation has passed from word-of-mouth hit to worldwide phenomenon, with the scope of its ambitious world-building growing with every successive instalment.\n\nSince first airing in 2011, the show has made stars of its previously obscure lead actors like Peter Dinklage, Richard Madden, Emilia Clarke, Kit Harrington, Maisie Williams and Sophie Turner and shocked audiences with its unexpected narrative twists and ground-breakingly grisly acts of barbarism.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nAfter 67 hours of exhausting, big-budget television, you would be forgiven for having lost the thread. Here’s a reminder of the story so far.\n\nSeason 1\n\nMembers of the Night’s Watch, an ancient order guarding the Wall to the north of Westeros, encounter a supernatural being known as a White Walker in the forest, previously assumed to be mythical.\n\nNed Stark (Sean Bean), Warden of the North, is visited in Winterfell by Robert Baratheon (Mark Addy) and invited to serve at his side following the sudden death of Jon Arryn, the previous Hand of the King. Stark’s daughters Sansa (Turner) and Arya (Williams) travel with him to King’s Landing but find the corrupt city-state in disarray.\n\nThe family of Baratheon’s bride, Cersei Lannister (Lena Headey), are allegedly behind the killing of Arryn. His son Bran (Isaac Hempstead Wright) witnesses Cersei in bed with her brother Jaime (Nikolaj Coster-Waldau), who shoves him from a tower window, leaving Bran paralysed.\n\nTyrion Lannister (Dinklage), a dwarf dilettante, accompanies Ned’s bastard son Jon Snow (Harrington) to investigate the White Walker incident reported by the Night’s Watch. Snow stays on with the order. Tyrion is arrested at the behest of Catelyn Stark (Michelle Fairley), who believes him responsible for Bran’s fall, prompting a trial by combat to secure his release. Tyrion, imprisoned in the Vale under the watchful eye of Catelyn’s sister Lysa Arryn (Kate Dickie), enlists Bronn (Jerome Flynn) to fight for him. He defeats Arryn’s chosen champion.\n\nWhen Baratheon is fatally wounded in a suspicious hunting accident, Ned is named Protector of the Realm until Cersei’s sadistic son Joffrey (Jack Gleeson) comes of age. Ned, however, plans to instal Stannis Baratheon (Stephen Dillane), the king’s estranged brother, in his stead. Ned is betrayed by councillor Lord Petyr “Littlefinger” Baelish (Aidan Gillan) and decapitated on Joffrey’s orders.\n\nShape Created with Sketch. How Game of Thrones characters have changed Show all 6 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. How Game of Thrones characters have changed 1/6 Bran Stark 2/6 Tyrion Lannister 3/6 Daenerys Targaryen 4/6 Jon Snow 5/6 Sansa Stark 6/6 Arya Stark 1/6 Bran Stark 2/6 Tyrion Lannister 3/6 Daenerys Targaryen 4/6 Jon Snow 5/6 Sansa Stark 6/6 Arya Stark\n\nSansa is arrested by the Lannisters as Arya manages to escape. In response, Stark’s son Robb (Madden) is named King of Winterfell and rallies the armies of the North against the Lannisters.\n\nAcross the Narrow Sea, Dothraki warlord Khal Drogo (Jason Mamoa) marries Daenerys Targaryen (Clarke). She believes herself the true heir to the Iron Throne and plots an assault on Westeros. Drogo dies after being hexed by a witch. Daenerys avenges him and hatches three dragon eggs presented to her as a wedding gift.\n\nSeason 2\n\nTyrion takes up the post of Hand in the hope of reining in Joffrey. Stannis falls under the spell of the witch Melisandre (Carice van Houten) and publicly lays claim to the throne on the basis of Joffrey’s illegitimacy.\n\nRobb’s armies progress south with Jaime Lannister as their prisoner of war. Robb sends Theon Greyjoy (Alfie Allen) to seek an alliance with his father, Balon Greyjoy (Patrick Malahide). Instead, Theon reunites with his family on the Iron Islands and together they capture Winterfell. Bran is forced to escape to the wilderness.\n\nRobb also send Catelyn out to meet with Renly Baratheon (Gethin Anthony), the younger sibling of Stannis who also has a claim to the Iron Throne. Catelyn suggests the brothers join forces. Renly refuses and is murdered by an evil spirit dispatched by Melisandre.\n\nCatelyn and Renly’s bodyguard, Brienne of Tarth (Gwendolyn Christie), are accused of the assassination and forced to flee. Uniting with Robb once more, the women conspire to have Jaime returned to King’s Landing in the hope of swapping him for Sansa.\n\nAt the Wall, Jon Snow uncovers evidence of infant sacrifices and defects from the Night’s Watch to join the Wildlings. Arya is captured by Lannister soldiers, imprisoned at the castle of Harrenhal and taken on as a servant by patriarch Tywin Lannister (Charles Dance) who believes her to be a boy. She escapes with the aid of Jaqen H’ghar (Thomas Wlaschiha), one of the Faceless Men of Essos.\n\nStannis attempts to invade King’s Landing by sea, but his forces are defeated in a naval battle by Tyrion’s cunning use of wildfire.\n\nMeanwhile, across the Narrow Sea, Daenerys arrives at Qarth, hoping to gain support for her invasion of Westeros. She ends up imprisoned in the House of the Undying, along with her dragons, after being drawn into a usurpation plot. She eventually escapes and pillages the city.\n\nSeason 3\n\nTyrion is demoted from Hand by Tywin - who blames Tyrion for causing his wife’s death in childbirth - and forces him to marry Sansa. Joffrey is meanwhile engaged to Margaery Tyrell (Natalie Dormer), Renly’s widow, in the hopes of establishing a Lannister-Tyrell alliance.\n\nBeyond the Wall, Jon Snow encounters Wildling leader Mance Rayder (Ciaran Hinds) who anticipates a battle to the death with the White Walkers. Snow finds himself in a complex relationship with his one-time prisoner, Ygritte (Rose Leslie).\n\nRobb decides against marrying Roslin Frey after falling in love with Talisa (Oona Chaplin), a healer. Nevertheless, the Starks are invited to her wedding to another, which turns out to be a trap sprung by Roslin's resentful father Lord Walder Frey (David Bradley). Robb, Catelyn, the pregnant Talisa and their bannermen are all butchered at the reception, with the blessing of the Lannisters.\n\nThe killings are witnessed by Arya, who finds a reluctant protector in Sandor “The Hound” Clegane (Rory McCann). For his part in the massacre, the treacherous Roose Bolton (Michael McElhatton) is made Warden of the North.\n\nElsewhere, Bran Stark discovers he can project himself into the body of a dire wolf, Brienne and Jaime continue their journey south and Daenerys gathers an army of 8,000 Unsullied in the east.\n\nSeason 4\n\nJoffrey meets his end after being served poisoned wine at his wedding to Margaery . Sansa is smuggled to freedom with the assistance of Littlefinger, who takes her to Lysa Arryn.\n\nArryn proves to be an unfit guardian for Sansa, having lost her mind. She is killed by Baelish, whom she expects to marry, after she attempts to push Sansa to her death through the Moon Door at The Vale.\n\nJaime (who has since lost his hand) and Brienne arrive at King’s Landing to find Sansa has escaped. Brienne, now a knight errant, is tasked with tracking down the missing Stark princess.\n\nA distraught Cersei blames Tyrion for Joffrey’s assassination. When his champion, Oberyn Martell (Pedro Pascal), is defeated in a trial by combat against Gregor “The Mountain” Clegane, Tyrion is imprisoned once more.\n\nFreed by Jaime, the dwarf discovers his father in bed with his mistress Shae and executes him by crossbow on the latrine before departing King’s Landing. Tyrion crosses the Narrow Sea in the hope of meeting Daenerys, whom he believes can defeat Cersei.\n\nRoose Bolton returns to Winterfell from the Red Wedding to find that his vicious son Ramsay Bolton (Iwan Rheon) has tortured Theon to the point of madness, so much so that he now answers only to the name “Reek”.\n\nIn the north, Jon Snow returns from the Wildling camp to warn the Night’s Watch of Mance Rayder’s advancing forces, who duly lay siege to Castle Black. Stannis Baratheon’s remaining men ride to the rescue, now backed by the financiers of the Iron Bank.\n\nArya and The Hound are found by Brienne, who defeats Clegane in battle. Arya runs away to study under the mysterious Jaqan H’ghar at the House of Black and White in Braavos.\n\nSeason 5\n\nStannis has the defeated Rayder burnt at the stake as Jon Snow is elected leader of the Night’s Watch, to the disapproval of the guard’s elders. Stannis is later convinced by Melisandre to sacrifice his own daughter to appease the “Lord of Light” and hold back the winter snows. He burns her alive, losing the respect of his own troops.\n\nLittlefinger leads Sansa to Ramsay Bolton with the intention of marrying them, an event that would mean the return of the Starks to Winterfell.\n\nStannis arrives to fight the Boltons but is easily dispatched when his men desert over doubts about his pagan zealotry. He is slain by Brienne, who has followed Sansa to Winterfell, as Melisandre escapes to Castle Black. Sansa manages to escape Ramsey’s clutches.\n\nAt King’s Landing, Cersei is conspiring against her daughter-in-law Margaery, who has subsequently married Joffrey’s naive younger brother Tommen, now king.\n\nAfter weaponising the High Sparrow (Jonathan Pryce), leader of a puritanical cult, Cersei’s sexual hypocrisy is soon exposed and she is forced to enact a humiliating naked walk of penance through the streets of the capital.\n\nDaenerys takes over the city of Mereen with her Unsullied army. However, she struggles to retain control of the desert slave city when an anonymous collective known as the Sons of the Harpy rise up against her. After a battle between her guards and the Harpies, one of Daenerys’s dragons whisks her away and into the midst of a Dothraki horde.\n\nTyrion meets Daenerys, quickly wins her trust and is left to rule in her absence.\n\nIn the north, Jon Snow takes a group of Night’s Watchmen to meet with the Wildlings in the hope of forming an alliance. As negotiations are ongoing, the Night King breaks up their meeting and scores a devastating victory. Upon returning to the Wall, a band of mutineering Watchmen have Snow run through.\n\nSeason 6\n\nAfter Jon Snow is raised from the dead by Melisandre, the revenant knight takes back control of the Night’s Watch and plans to reclaim Winterfell from Ramsay Bolton, who has since slain his family. He is reunited with Sansa at the Wall.\n\nIn the ensuing “Battle of the Bastards”, Ramsay is finally overcome when Littlefinger and the Knights of the Vale unexpectedly enter the fray. Ramsay is fed to his own dogs.\n\nIn King’s Landing, Cersei faces trial for her misdemeanours as the High Sparrow continues to dominate the hapless King Tommen. The Queen Mother finally takes matters into her own hands, blowing up the Great Sept of Baelor with the last of the wildfire, killing Margaery and the High Sparrow. In his grief, Tommen commits suicide.\n\nDaenerys is now a prisoner of the Dhothraki. The barbarians expect the wife of their late Khal to live in seclusion like other widows. She soon persuades them of her divine powers by walking unharmed through fire and returns to Mereen as their leader.\n\nTheon – free of his ordeal at the hands of Ramsay – returns to the Iron Islands, where he conspires with his sister Yara Greyjoy (Gemma Whelan) to steal the royal fleet from their usurping uncle Euron (Pilou Asbaek). They sail for Essos and join Daenerys Targaryean’s cause.\n\nLeaving the House of Black and White as an elite assassin, Arya avenges her brother and mother by slitting the throat of Walder Frey.\n\nBran, who has been training with the “Three-Eyed Raven”, encounters the Night King, who slays the master, enabling the pupil to succeed him.\n\nSeason 7\n\nDaenerys heads to Dragonstone (once the home of Stannis Baratheon) taking her massive army of Unsullied and Dothraki aboard the Frey ships. Melisandre encourages her to court Jon Snow as an ally in the battle for the Iron Throne.\n\nAfter receiving an invitation from Daenerys, Snow goes to meet her at Dragonstone. The pair grow close as they plan how best to defeat the Lannisters and White Walkers. They decide to send Yara and the Unsullied to King’s Landing.\n\nCersei considers a marriage proposal from Euron Greyjoy and offers him a chance to prove himself by defeating the incoming invaders. Yara and her army are defeated at sea by Euron.\n\nMeanwhile, battles erupt between Dothraki cavalry and the Lannister battalions, led by Jaime. Daenerys’s dragon Drogon is injured by a specially designed ballista during the fray.\n\nHaving seen the dragon, Jaime warns Cersei of Daenerys’s power. Jon and Daenerys decide to call a truce with Cersei and head north of the Wall to capture a White Walker. Jon succumbs to the Night King’s trap and requires saving by Daenerys. In the process, they capture a Walker but lose the dragon Viserion, who falls under the Night King’s spell.\n\nJon and Daenerys head to King’s Landing to discuss teaming up with Cersei to defeat the Walker army. They bring their captured White Walker to convince her. Jon, Daenerys and Tyrion head back to Winterfell after the meeting. Snow and Targaryen become intimate.\n\nArya and Sansa are reunited with Bran at Winterfell but tensions between the sisters emerge and are exploited by Littlefinger. His duplicity is exposed when Bran reveals it was Littlefinger who killed Jon Arryn — the murder that instigated the entire game of thrones. Sansa has him executed. Bran also learns of Jon’s true heritage — he is not in fact Ned Stark’s bastard but a Targaryen with a legitimate claim to the Iron Throne.\n\nThe Night King and the White Walkers breach the Wall with the help of Viserion, now an undead dragon of ice. Winter has come.\n\nHungry for more Game of Thrones? Watch series one to seven on Now TV", "images": ["https://trc.taboola.com/1036135/log/3/unip?en=page_view", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/10/20/17/game-of-thrones-ned-stark.jpg"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/10/20/17/game-of-thrones-ned-stark.jpg", "keywords": [], "authors": ["Joe Sommerlad"], "canonical_link": "https://www.independent.co.uk/arts-entertainment/tv/game-of-thrones/game-of-thrones-recap-season-8-catch-up-plot-spoilers-characters-release-date-latest-a8618196.html", "title": "Game of Thrones recap seasons 1-7: Complete guide to HBO series before season 8 begins", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "https://www.independent.co.uk/arts-entertainment/tv/game-of-thrones/game-of-thrones-recap-season-8-catch-up-plot-spoilers-characters-release-date-latest-a8618196.html", "title": "Our season-by-season guide to Game of Thrones", "description": "*Spoiler warning* As anticipation builds ahead of the climactic battle to decide the future of the Seven Kingdoms of Westeros, here's the story so far", "updated_time": "2019-04-22T01:48:58+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/10/20/17/game-of-thrones-ned-stark.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB", "video": {"identifier": "https://house-fastly-signed-eu-west-1-prod.brightcovecdn.com/media/v1/pmp4/static/clear/624246174001/858b1029-897a-46f1-9b29-61017e47df64/8cc113a9-d4bc-4870-9eac-ccd15ce78bff/main.mp4?fastly_token=NjA3MWMwM2VfYzc5MjI1ODI0MjNhNWI3YjNhNDM5N2JjNDA3NDBiZWE0M2Q2NDZkMTg0ZGZmZmIxZDZmZjFjZjYxMzIxYjQ3NV8vL2hvdXNlLWZhc3RseS1zaWduZWQtZXUtd2VzdC0xLXByb2QuYnJpZ2h0Y292ZWNkbi5jb20vbWVkaWEvdjEvcG1wNC9zdGF0aWMvY2xlYXIvNjI0MjQ2MTc0MDAxLzg1OGIxMDI5LTg5N2EtNDZmMS05YjI5LTYxMDE3ZTQ3ZGY2NC84Y2MxMTNhOS1kNGJjLTQ4NzAtOWVhYy1jY2QxNWNlNzhiZmYvbWFpbi5tcDQ%3D", "type": "application/octet-stream"}}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/8618196"}, "description": "The eighth and final season of Game of Thrones is currently in production, with fans eagerly awaiting what promises to be a thrilling climax.", "keywords": "Game of Thrones, Game of Thrones season 8, HBO, George RR Martin, Peter Dinklage, Richard Madden, Emilia Clarke, Kit Harrington, Maisie Williams, Sophie Turner, Sean Bean, Lena Headey, Nikolaj Coster-Waldau, Aidan Gillan, Jason Mamoa, Alfie Allen, Gwendolyn Christie, Natalie Dormer, Ciarán Hinds, Rose Leslie, Jonathan Pryce, Game of Thrones, TV & Radio, Culture", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Game of Thrones", "published_time": "2019-04-22T01:44:00+01:00", "modified_time": "2019-04-22T01:48:58+01:00", "section": "Game of Thrones", "subsection": "Video, Features", "author_name": "Joe Sommerlad", "content_type": "story", "word_count": 2404, "image_count": 2, "video_count": 0, "embed_count": 0, "internal_link_count": 25, "external_link_count": 1}, "twitter": {"title": "Our season-by-season guide to Game of Thrones", "description": "The eighth and final season of Game of Thrones is currently in production, with fans eagerly awaiting what promises to be a thrilling climax.", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1555893840.0, "source": "https://www.independent.co.uk", "summary": ""}