{"url": "www.radiotimes.com/news/2018-08-24/the-crown-season-2-prince-charles/", "text": "Prince Charles is at the heart of the second season of The Crown on Netflix as the heir to the throne grows up. Find out more about the history of Prince Charles and his time at school, along with who plays him in the Netflix drama, below.\n\nAdvertisement\n\nWho plays young Prince Charles in The Crown?\n\nIn The Crown’s second season, young Prince Charles and Princess Anne are actually played by two different sets of child actors. The roles are re-cast halfway through as the children age.\n\nThe first Prince Charles we meet in season two is played by Billy Jenkins. He also starred in season one and has also appeared in the TV series Humans.\n\nThe second Prince Charles is played by Julian Baring, who takes over the role to deliver an emotional performance in episode nine as we take a deep dive into Philip and Charles’ father-son relationship.\n\nFind out more about the history behind that episode below – contains minor spoilers.\n\nDid Prince Philip force Charles to go to Gordonstoun?\n\nYes, and it didn’t go very well.\n\nCharles had an unusual – and unhappy – education. In his early years the prince thrived as he was educated at home by his governess Catherine Peebles (“Mipsy”), who later described him as dreamy and thoughtful. However, at the age of eight it was announced that the Prince would attend school: he was sent first to Hill House School in London and then transferred to Cheam School, the oldest private school in the country.\n\nCheam was not a big success, as he struggled to fit in and make friends. Reportedly a sensitive child, Charles was deeply homesick and attached to his teddy bear. However, his headmaster Peter Beck later told Radio Times: “Educationally he was a very hard-working and able boy, very lucid in spoken and written work. Some of his written work was very good indeed.”\n\nAs the prince came towards the end of his years at Cheam, the Queen and her husband had to decide where to send him next. Philip was keen for his son to follow in his footsteps and attend the school where he had spent his formative years: Gordonstoun, a remote school in north-east Scotland.\n\nNot everyone was keen. Charles was very close to his maternal grandmother, the Queen Mother, who appreciated his sensitive nature and encouraged his interest in music, art and culture. The Queen Mother wrote to Elizabeth urging her to intervene and keep him closer to home.\n\nArguing that he would be “terribly cut off and lonely in the far north,” she wrote in a letter on 23rd May 1961: “I suppose he will be taking his entrance exam for Eton soon. I do hope he passes because it might be the ideal school for one of his character and temperament.”\n\nBut the Duke of Edinburgh won the debate, arguing that Eton was too close to Windsor and London and the boy would have more privacy from the press in Gordonstoun. He had taken responsibility for family decisions, while his wife concerned herself with affairs of state – and the Queen let him make the decision. So Philip, a qualified pilot, ceremoniously flew his son to an RAF base in Scotland and then drove the rest of the way.\n\nWas Prince Charles miserable at Gordonstoun school?\n\nGordonstoun was completely wrong for Charles. Where the athletic and confident Philip had thrived, Charles was absolutely miserable. He later referred to his years at Gordonstoun as “a prison sentence”, calling the school “Colditz in kilts”.\n\nEach day started with a run (whatever the weather) and then a cold shower. The kids slept in dormitories on hard bunks, with the windows open all year around, and older kids were free to enforce discipline on the younger students.\n\nAccording to his fellow school friends, Charles was relentlessly bullied. His contemporary Ross Benson reported: “He was crushingly lonely for most of his time there. The wonder is that he survived with his sanity intact.”\n\nWith a Prince at the school, the rules became stricter (no drinking, no smoking, less freedom), and the boys took that out on poor Charles. Anyone who tried to be his friend or even talk to him was teased with slurping sounds for sucking up to him. On the rugby field he was a prime target.\n\nCharles wrote in a letter home in 1963: “The people in my dormitory are foul. Goodness, they are horrid. I don’t know how anybody could be so foul.” In another, he told his mother: “I hardly get any sleep in the House because I snore and I get hit on the head all the time. It’s absolute hell.” In response, the Duke of Edinburgh sent his son stern letters urging him to be stronger and more resourceful.\n\nAs we see in The Crown, the young prince was guarded by the detective Donald Green, who did his best to be unobtrusive. Green became a friend and father figure, until he was sacked for letting 14-year-old Charles order a cherry brandy on a school trip – in the presence of a tabloid reporter. Charles was devastated to lose his one ally.\n\nStill, Charles stayed on at Gordonstoun, eventually becoming Head Boy and earning two A-levels: History (grade B) and French (grade C).\n\nThe Queen and her husband also sent Prince Andrew and Prince Edward to Gordonstoun.\n\nWhat was Prince Philip’s relationship like with his son Charles?\n\nThe penultimate episode of The Crown is enough to have even the most ardent republican weeping as we see the gulf of understanding between father and son. Prince Philip, failing to respect the ways his son is different from him and love him for the boy he is; and Prince Charles, unable to live up to his father’s expectations and constantly unable to please him.\n\nPrince Charles later spoke openly about his difficult relationship with his father, most notably to Jonathan Dimbleby for an authorised biography in the early 1990s during the wreckage of his separation from Diana.\n\nHe spoke of a father who was a tough disciplinarian with a forceful personality, whose harsh words had forced him to retreat into himself. Friends who were authorised to speak to Dimbleby for the book described Prince Philip “belittling” and “bullying” his son.\n\nIn his younger years, Charles idolised his father and sought to please him, taking up his sports like polo and even (some observed) starting to walk like him, with one arm behind his back.\n\nLater there was more anger, and as biographer Sally Bedell Smith notes, he has continued to complain about his years at Gordonstoun well into his sixties.\n\nAdvertisement\n\nThe Crown season 2 is available on Netflix now", "images": ["https://images.immediate.co.uk/production/volatile/sites/3/2017/08/cropped-radiotimes-header-logo-ad1202c.png?quality=90&resize=265,55", "https://images.immediate.co.uk/production/volatile/sites/3/2020/03/hamnet-2916df2.png?quality=90&resize=100,100", "https://images.immediate.co.uk/production/volatile/sites/3/2017/11/Michael-Parker-copy-82e8131.jpg?quality=90&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2017/12/The-Crown-young-Prince-Charles-with-the-Queen-Mother-and-Princess-Anne-92cbd3a.jpg?quality=90&lb=620,413&background=white", "https://images.immediate.co.uk/production/volatile/sites/3/2020/04/Spring_Brandsite_1200x800_RTv2-da3a75a.jpg?quality=45&resize=1200,800", "https://images.immediate.co.uk/production/volatile/sites/3/2017/12/GettyImages-541052619-84d9258.jpg?quality=90&lb=620,413&background=white", "https://images.immediate.co.uk/production/volatile/sites/3/2017/12/The-Crown-the-Queen-and-Anthony-Eden-01f87d7.jpg?quality=90&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2020/03/001-SE-14-3-Cover-footer-47186e2.png?quality=90&resize=100,100", "https://images.immediate.co.uk/production/volatile/sites/3/2017/12/The-Crown-Prince-Charles-arrives-at-Gordonstoun-50aeca4.jpg?quality=90&lb=620,413&background=white", "https://images.immediate.co.uk/production/volatile/sites/3/2017/12/the-crown-PM-2915698.jpg?quality=90&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2017/12/the-crown-prince-charles-b90cbfd.jpg?quality=90&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2019/08/python-for-article-0f0e8fe.png?quality=90&resize=100,100", "https://images.immediate.co.uk/production/volatile/sites/3/2017/12/The-royal-family-21382ac.jpg?quality=90&lb=620,413&background=white", "https://images.immediate.co.uk/production/volatile/sites/3/2019/11/The-Crown-S4-7adfc09.jpg?quality=45&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2019/12/ipso-sq-7800070.png?quality=90&resize=150,150", "https://images.immediate.co.uk/production/volatile/sites/3/2017/12/The-Crown-young-Prince-Charles-1963-77ba948.jpg?quality=90&lb=620,413&background=white", "https://images.immediate.co.uk/production/volatile/sites/3/2017/12/the-crown-prince-charles-b90cbfd.jpg?quality=45&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2017/12/The-Crown-Lord-Altrincham-445e220.jpg?quality=90&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2017/12/Prince-Charles-with-the-Queen-Mother-e2508fa.jpg?quality=90&lb=620,413&background=white"], "top_img": "https://images.immediate.co.uk/production/volatile/sites/3/2017/12/the-crown-prince-charles-b90cbfd.jpg?quality=90&resize=620,413", "keywords": [], "authors": ["Eleanor Bley Griffiths"], "canonical_link": "https://www.radiotimes.com/news/on-demand/2019-03-25/the-crown-season-2-prince-charles/", "title": "The Crown season 2: What was Prince Charles really like as young boy? – and why did he hate Gordonstoun?", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "The Crown season 2: What was Prince Charles really like as young boy? – and why did he hate Gordonstoun?", "og": {"site_name": "Radio Times", "title": "The Crown: What was Prince Charles really like as young boy – and why did he hate his time at Gordonstoun?", "url": "https://www.radiotimes.com/news/on-demand/2019-03-25/the-crown-season-2-prince-charles/", "image": "https://images.immediate.co.uk/production/volatile/sites/3/2017/12/the-crown-prince-charles-b90cbfd.jpg?quality=90&resize=620,413", "description": "The Crown season two explores the relationship between Prince Philip and his son Charles as he is sent away to school – but what's the history behind the drama?", "type": "article"}, "twitter": {"title": "The Crown: What was Prince Charles really like as young boy – and why did he hate his time at Gordonstoun?", "card": "summary_large_image", "site": "RadioTimes", "creator": "RadioTimes", "image": "https://images.immediate.co.uk/production/volatile/sites/3/2017/12/the-crown-prince-charles-b90cbfd.jpg?quality=90&resize=620,413", "description": "The Crown season two explores the relationship between Prince Philip and his son Charles as he is sent away to school – but what's the history behind the drama?"}, "fb": {"pages": "u4ylx6xopb5vy1edoq8hy242v9y83x"}, "google-site-verification": "iUM5QciI_0yvO6R3xDcoZPgevG7nfNhNsNv6zOjlvpU", "description": "The Crown season two explores the relationship between Prince Philip and his son Charles as he is sent away to school – but what's the history behind the drama?", "robots": "index,follow", "msapplication-TileImage": "https://images.immediate.co.uk/production/volatile/sites/3/2016/11/cropped-RT-logo-2.png?quality=90&resize=270,270"}, "movies": ["https://www.youtube.com/embed/BoPoSCvPxuM?feature=oembed", "https://www.youtube.com/embed/u3n4_AkszHI?feature=oembed", "https://www.youtube.com/embed/UlXJ_XUft9Y?feature=oembed"], "publish_date": 1535040000.0, "source": "http://www.radiotimes.com", "summary": ""}