{"url": "http://toofab.com/2017/05/08/real-housewives-atlanta-kandi-burruss-rape-phaedra-parks-porsha-williams/", "text": "It all hit the fan on the final \"Real Housewives of Atlanta\" reunion episode Sunday night, as Kandi Burruss finally confronted Phaedra Parks for her role in spreading a vicious rape rumor.\n\nAll season long, Burruss has been fighting allegations she and husband Todd said they wanted to drug co-star Porsha Williams and take advantage of her. Last week, Porsha revealed she first heard about it from Parks, who claimed she heard it from Kandi firsthand.\n\n\"To say I would drug somebody, there's multiple levels to that,\" an emotional Burruss said to Phaedra during the reunion. \"She, as a person who knows me, knows I don't do drugs or deal with anything with drugs, but then on top of that, as an attorney why would you repeat to say somebody would drug somebody?\"\n\n\"People was under my comments with the hashtag #KandiAKABillCosby,\" she continued. \"Y'all know how much I care about my business and my brand and you’re gonna sit up there and say some shit like that? It's one thing to say she messed with this person, we throw shade, whatever, but drugs?\"\n\n\"You should understand that drugging somebody while they're drinking is rape,\" she added, starting to cry. \"Y'all accused me of being a f--king rapist, that is crazy. You as an attorney, why would you do that?!\"\n\nShe then walked off the set.\n\nParks and Williams had a heated talk of their own backstage, as Porsha asked why Phaedra claimed Kandi had told her about her alleged plan.\n\n\"I'm sorry, I shouldn't have repeated it. I didn't know,\" said Parks. \"If something would have happened to you, I would have been a bad friend.\"\n\n\"You have to understand how f--ked up this is and how f--ked up I been looking staying by your side,\" Williams shot back. \"You gotta give me some answers, because what I feel is you used me as a pawn against Kandi and that's why my heart is sunken right now. They ain't ever said nothing to deserve no shit like that and you know it.\"\n\nI'm sorry. I shouldn't have repeated it,\" Phaedra added. \"I mean I'm sorry. Hell, I didn't know if it was true or not.\"\n\n\"I f--king asked was it true. Don't tell me like it's the truth,\" said Williams.\n\nWhen the women all sat back down again together, Porsha apologized to Kandi.\n\n\"I'm here to be direct and I'm here to say that I am very, very upset for being used as a pawn,\" said Williams. \"I feel horrible. From me, I am apologizing to you.\"\n\nCohen then addressed Parks, saying she got caught in a \"megawatt lie.\"\n\n\"What more can I do? I apologized already and the person I'm most concerned about is Porsha,\" Parks said. \"I'm sorry that it hurt Kandi as well.\"\n\nBurruss previously told TooFab things between her and the two women were \"unrepairable.\"\n\n\"It's definitely unrepairable at this point. In the past, I felt like it was repairable, but every time I would try to reach out to try to get some type of positive growth, they would do something else,\" she explained. \"It just got the point now where I'm like no, it's so not repairable, it's so broken at this point, I feel like we need to just stop talking about each other period. At this point, we're not going to be friends, so let's just stop.\"", "images": ["https://ll-assets.tmz.com/www.tmz.com/main/default/cache/images/feedlogo2.v2014_05_09_134122.gif", "https://assets.toofab.com/toofab.com/main/default/img/toofab-logo-white.svg", "https://toofab.akamaized.net/2019/04/06/elite-daily-logo-1.png", "https://assets.toofab.com/toofab.com/main/default/img/skeleton.svg", "https://toofab.akamaized.net/2017/05/08/rhoa-finale-1200x630.jpg", "https://ll-media.tmz.com/2013/04/26/partner-rsss-justjared-logo-cut-v2.gif", "https://ssl-cdn-media.tmz.com/2013/04/26/partner-rss-fox-b-w.png", "https://toofab.akamaized.net/2019/04/06/cdl-260x30-for-tmz3-1.png", "https://toofab.akamaized.net/2018/12/19/newsletter-logo-v2-1.png", "https://ll-media.tmz.com/2013/04/26/partner-rss-thestir-logo-cut-v2-1.png"], "top_img": "https://toofab.akamaized.net/2017/05/08/rhoa-finale-1200x630.jpg", "keywords": [], "authors": ["Toofab Staff"], "canonical_link": "https://toofab.com/2017/05/08/real-housewives-atlanta-kandi-burruss-rape-phaedra-parks-porsha-williams/", "title": "Kandi Burruss Explodes Over Rape Accusation on 'Real Housewives of Atlanta' Reunion (Video)", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "twitter": {"toofab": 116547240, "card": "summary_large_image", "site": "@toofab", "title": "Kandi Burruss Explodes Over Rape Accusation on 'Real Housewives of Atlanta' Reunion (Video)", "description": "\"Y'all accused me of being a f--king rapist, that is crazy,\" Kandi Burruss screams while confronting Phaedra Parks on \"RHOA\" reunion.", "image": "https://toofab.akamaized.net/2017/05/08/rhoa-finale-1200x630.jpg"}, "verify-v1": "Wtpd0N6FufoE2XqopQJoTjWV6Co/Mny9BTaswPJbPPA=", "msvalidate.01": "AFEB17971BCF30779AEA662782EF26F4", "y_key": "14cb04e4656b0c58", "keywords": "Real Housewives", "description": "\"Y'all accused me of being a f--king rapist, that is crazy,\" Kandi Burruss screams while confronting Phaedra Parks on \"RHOA\" reunion.", "robots": "index,follow", "referrer": "unsafe-url", "og": {"url": "https://toofab.com/2017/05/08/real-housewives-atlanta-kandi-burruss-rape-phaedra-parks-porsha-williams/", "site_name": "toofab", "type": "article", "title": "Kandi Burruss Explodes Over Rape Accusation on 'Real Housewives of Atlanta' Reunion (Video)", "description": "\"Y'all accused me of being a f--king rapist, that is crazy,\" Kandi Burruss screams while confronting Phaedra Parks on \"RHOA\" reunion.", "image": "https://toofab.akamaized.net/2017/05/08/rhoa-finale-480x360.jpg"}, "fb": {"app_id": 116046798441464, "pages": 324392354652}, "article": {"publisher": "https://www.facebook.com/TooFab"}}, "movies": [], "publish_date": 1494172800.0, "source": "http://toofab.com", "summary": ""}