{"url": "https://www.thecut.com/2018/02/a-guide-to-the-kim-cattrall-sarah-jessica-parker-sex-and-the-city-beef-drama.html", "text": "Photo: Getty Images\n\nYesterday, actor Jason Lewis, who played Smith Jerrod on Sex and the City, became the latest SATC-adjacent person to weigh in on the ongoing feud between Sarah Jessica Parker and Kim Cattrall. “Listen, I would have to say that Sarah was always just so lovely and such a consummate professional, and I think that people should remember their graciousness and the things that have been given to them,” said the Absolut Hunk, suggesting that he is clearly on Team SJP. “I’m going to stop there because I’ve got nothing good to say.”\n\nAs you may have gathered, Sarah Jessica Parker and Kim Cattrall aren’t exactly Carrie-Samantha close in real life. Though their feuding has come to a head in the past couple of months, the controversy between the two Sex and the City stars has been playing out in the tabloids for more than a decade, from early rumors of salary disputes to allegations of on-set cliquishness. Looking back on it all, I can’t help but wonder: Was Cattrall the “difficult” one, constantly torpedoing plans for future SATC outings with her salary demands? Or was SJP simply playing the part of the “nice girl” while fostering a toxic culture that excluded Cattrall and painted her as a diva in the press? Or are we, the media, at fault for stoking the flames of this drama in the first place?\n\nHave a look at the historical record and decide for yourself:\n\n2004: The show ends.\n\nSoon after season six ends, there’s a production delay on the first Sex and the City movie, and salary negotiations are rumored to be a factor. At the 2004 Emmys, Cattrall is conspicuously seated far away from her co-stars.\n\nIn an interview with Jonathan Ross that same year, Cattrall opens up about some of the long-running money tensions on the show. “I felt after six years it was time for all of us to participate in the financial windfall of Sex and the City,” Cattrall said. “When they didn’t seem keen on that, I thought it was time to move on.”\n\n2008: The first movie comes out.\n\nThe Sex and the City movie finally makes it onto our screens. A Telegraph article goes into more detail about the rumored salary tensions that had long dogged the show, explaining that Cattrall had tried to negotiate a raise for herself after Sarah Jessica Parker became an EP after season two, which created distance between her and the other cast members. As for the film, she had reportedly “openly refused to participate unless she was paid more.”\n\n“Are we the best of friends? No. We’re professional actresses. We have our own separate lives,” said Cattrall. (She also told Marie Claire that she had been going through a rough time back in 2004 when they were negotiating the movie, and it “wasn’t all about the money.”)\n\nSJP, ever the peacekeeper, demurred: “Honestly, we are all friends and I wish I saw more of Kim … She mentioned money and no one should vilify her for it. People made a decision that we had vilified her. No one bothered to say [to the rest of us], Are you disappointed by not making the movie? Yes. Do you respect and support her choice to not do it? Absolutely.”\n\n2009 and 2010, doing promo for SATC 2: We’re fine! Everything’s fine!\n\nAn era of détente. Parker tells Elle: “I don’t think anybody wants to believe that I love Kim. I adore her. I wouldn’t have done the movie without her. Didn’t and wouldn’t.”\n\nCattrall tells the Daily Mail: “It makes for juicy gossip. The truth of us being friends and getting along and happily doing our jobs together is nowhere near as newsworthy. I think Sarah is fantastic. She is a born leader and she guides the crew and the cast in such a strong but gentle way. She and I are sick of this. It’s exhausting talking about it, and a real bore. Next?”\n\nIn a Marie Claire piece, both SJP and Cattrall echo the party line. Says SJP: “When you’re on set, you’re working 90-hour weeks, you’re never home, you’re exhausted. There are times when all of us have been sensitive, and sometimes feelings get hurt. But I don’t have any regrets about how I’ve treated people.” Cattrall adds that the cast’s chemistry remains strong, and “things just have to be explosive for no other reason than for people’s imaginations.”\n\nYet, in 2009, an nymag.com article claimed that “Sarah Jessica Parker and Kim Cattrall are no longer speaking, which is making everyone on the set of the new Sex and the City movie uncomfortable,” with a source offering that “you could cut the tension with a knife.”\n\n2016: We’re still fine!!!!\n\nDespite rumors that a third SATC move is on the way, Kim Cattrall says she doesn’t want to play Samantha again, saying it would be a “challenge.”\n\nMeanwhile, in countless press appearances, SJP quashes rumors of a beef. “It was always so heartbreaking to me that there was this narrative about Kim and myself because it just didn’t reflect anything that happened on that set,” she tells Time. “Nobody asked those questions of shows with men. Isn’t that interesting?”\n\n“These were my sisters, these were people that I grew to love and admire,” SJP told Howard Stern. “Was every day perfect? Were people always desperately, hopefully in love with each other? No, but this is a family of people who needed each other, relied upon each other, and loved each other. This sort of narrative, this ongoing catfight, it really used to upset.”\n\nAlso, SJP posted this Instagram:\n\n2017: SATC 3 falls apart.\n\nSJP confirms a third movie isn’t happening, even though they had the script ready to go. “We had this beautiful, funny, heartbreaking, joyful, very relatable script and story,” she said. “It’s not just disappointing that we don’t get to tell the story and have that experience, but more so for that audience that has been so vocal in wanting another movie.”\n\nThat same day, the Daily Mail claims that it’s because Cattrall “torpedoed” the project by demanding that Warner Bros. produce her other projects in exchange for her participation; Cattrall shoots back:\n\nWoke 2 a @MailOnline 💩storm! The only 'DEMAND' I ever made was that I didn't want to do a 3rd film....& that was back in 2016 — Kim Cattrall (@KimCattrall) September 29, 2017\n\nOther cast members, including Willie Garson (Stanford) and Kristin Davis, turn to social media to express their frustration about the film not going forward.\n\nDisappointed for all crew holding on for negotiations to conclude for their jobs, and of course, for the fans. Leave it at that. #Truth — Willie Garson (@WillieGarson) September 29, 2017\n\nIn an interview with Piers Morgan, Cattrall clarified her stance:\n\n“This isn’t about more money, this is not about more scenes, it’s not about any of those things. This is about a clear decision, an empowered decision in my life to end one chapter and start another … it’s quite extraordinary to get any kind of negative press about something that I’ve been saying for almost a year of ‘no’ that I’m demanding or a diva … I never asked for any money, I never asked for any projects, to be thought of as some kind of diva is absolutely ridiculous.”\n\nBut in that same interview with Morgan, she also threw some shade at SJP. “This is really where I take to task the people from Sex and the City and specifically Sarah Jessica Parker in that I think she could have been nicer. I really think she could have been nicer. I don’t know what her issue is, I never have.”\n\nPer Cattrall, nobody else bothered to reach out to her when reports were leaking to the press about her allegedly quashing the film:\n\n“Another thing that’s really disappointing is that nobody ever picks up the phone and tries to contact you and say, ‘How you doing?’ That would have been the way to handle it… And usually what happens in a healthy relationship is that someone, or a transaction for a job in my business, is that someone says, ‘Are you available?’ and you say ‘Yes’ and here’s the job and you say ‘Yes, but thank you very much but I’m sort of over here right now but thank you very much,’ and that person turns to you, and they say ‘That’s great, good luck to you, I wish you the best.’ That’s not what happened here, this is, it feels like a toxic relationship.”\n\nMeanwhile, Willie Garson seems to think there’s more to it:\n\nDear fans, because I'm \"toxic\", I'm going to negotiate a contract for 6 months, not come to terms, then say I never wanted to do it anyway. — Willie Garson (@WillieGarson) October 4, 2017\n\n2018: Everything falls apart.\n\nIn the wake of the Piers Morgan interview, SJP begins speaking out. In January, she tells the Daily Beast that the #MeToo movement “emboldened” her to speak out about the Sex and the City beef. (I mean, sure.) “I’m stunned by how deeply it still cuts,” she said. “When all that stuff was happening with Sex and the City, which I know is meaningless in the world, but when it’s happening and you’re caught up in any of the muscle of that stuff, it’s so painful because all you want to do is respond. All you want to do is say, ‘Are you kidding me!?’”\n\nShe went on:\n\nWhat happened, that was enormously painful for me. I just kept saying, “This was an experience I loved. I love those women. We shared this experience. It was a privilege. If that’s what we’re left with, those memories, there are only four of us who …” You know? But then all of a sudden the world shifted, right? I was like, oh this is ridiculous. I was afraid to talk about these allegations, and now there are real allegations [relating to abuse and sexual misconduct] in the world that are real? And all of a sudden I was like, “I think I’m going to answer the question about the Sex and the City movie.” For so long I was told to be quiet about all of that stuff. And all of a sudden I’m like, “If people are being encouraged to come forward and talk about really difficult, painful, potentially criminal things that they were part of or witnessed, I think I can talk about the Sex and the City 3 movie.” [Laughs] I think it’s OK! I’m a grown freaking woman.\n\nAlso, in an appearence on Ellen, SJP joked that she should play Samantha in the third movie – which Cattrall appeared to be down with:\n\nShe’d be fabulous! 👍👍 — Kim Cattrall (@KimCattrall) January 17, 2018\n\nTalking to Andy Cohen in February, Parker added that she was “heartbroken” over what happened with Cattrall. “ I found it very upsetting because that’s not the way I recall our experience,” she said. “It’s sad. But I always think that what ties us together was this singular experience. It was a professional experience but it became personal, because it was years and years of our lives. So I’m hoping that that eclipses anything that’s been recently spoken. That many years spent doing something so special that people had a connection with is such a privilege.”\n\nAnd then, shit really hit the fan. Last month, Cattrall’s brother passed away, and Parker sent her condolences, both in statements to the press and in a comment on Cattrall’s Instagram. “If somebody in your life, whether you’re in touch with them or not, [is] suffering for any reason, it’s involuntary that you want to convey condolences or sadness or just let someone know you’re thinking about them,” she told ET.\n\nThis did not go over well with Cattrall, who responded with a scathing Instagram post:\n\nHer Instagram links to a pro-Cattrall New York Post story about the “mean girls” culture on the SATC set, which claims “a clique began to form, leaving Cattrall out in the cold.” Apparently, SJP once rented a house for her and Nixon and Davis and excluded Cattrall, and by the end of the show, no one would talk to her.\n\nPeople were surprised by the extent of Cattrall’s vitriol. An Us Weekly article claimed that though the two had reportedly disliked each other since season two, “their co-stars can’t understand why Kim lashed out” because “it wasn’t this bad during filming.”\n\nMost recently in a People cover story, Parker attempted once again to stake out the moral high ground. “We had this experience and it was amazing, and nothing will ever be like it. We had a connection with an audience, and we had a connection with the city and with this crew, and we got to tell these crazy stories with each other,” she said. “So I don’t want to mess with that. I couldn’t imagine anyone else playing that part. So there was no fight; it was completely fabricated, because I actually never responded. And I won’t, because she needed to say what she needed to say, and that is her privilege.”\n\nSo, SATC fans: Whose side are you on?", "images": ["https://pyxis.nymag.com/v1/imgs/1a8/1ea/267f655dffdac28b6ab5797263c67cfe7a-22-SJP-kim-cattrall.1x.rsocial.w1200.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/02/22/22-SJP-kim-cattrall.w700.h700.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pyxis.nymag.com/v1/imgs/1a8/1ea/267f655dffdac28b6ab5797263c67cfe7a-22-SJP-kim-cattrall.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Anna Silman"], "canonical_link": "https://www.thecut.com/2018/02/a-guide-to-the-kim-cattrall-sarah-jessica-parker-sex-and-the-city-beef-drama.html", "title": "Your Comprehensive Guide to the Kim Cattrall–Sarah Jessica Parker Beef", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Your Comprehensive Guide to the Kim Cattrall–Sarah Jessica Parker Beef", "url": "https://www.thecut.com/2018/02/a-guide-to-the-kim-cattrall-sarah-jessica-parker-sex-and-the-city-beef-drama.html", "description": "Controversy between the two Sex and the City stars has been playing out in the tabloids for over a decade.", "image": "https://pyxis.nymag.com/v1/imgs/1a8/1ea/267f655dffdac28b6ab5797263c67cfe7a-22-SJP-kim-cattrall.1x.rsocial.w1200.jpg", "site_name": "The Cut", "type": "article"}, "twitter": {"title": "A Guide to the Kim Cattrall–Sarah Jessica Parker Beef", "description": "Controversy between the two Sex and the City stars has been playing out in the tabloids for over a decade.", "image": "https://pyxis.nymag.com/v1/imgs/1a8/1ea/267f655dffdac28b6ab5797263c67cfe7a-22-SJP-kim-cattrall.2x.rsocial.w600.jpg", "card": "summary_large_image", "site": "@TheCut"}, "article": {"published_time": "2018-02-23T09:55:59.038-05:00", "tag": "kim cattrall, sarah jessica parker, sex and the city, drama, tv, television, culture", "publisher": "https://www.facebook.com/cut"}, "description": "’Sex and the City’ stars Sarah Jessica Parker and Kim Cattrall’s longtime feud — involving allegations of on-set cliquishness and salary disputes – recently came to a head when Cattrall slammed SJP on Instagram.", "sailthru.tags": "kim cattrall, sarah jessica parker, sex and the city, drama, tv, television, culture", "author": "Anna Silman", "fb": {"app_id": 343556435754245}, "type": "Article", "vertical": "The Cut", "apple-mobile-web-app-title": "The Cut", "application-name": "The Cut", "msapplication-TileColor": "#ff5656", "msapplication-TileImage": "https://assets.nymag.com/media/sites/thecut/icon.144x144.png"}, "movies": [], "publish_date": 1519397759.038, "source": "https://www.thecut.com", "summary": ""}