{"url": "https://variety.com/2017/tv/news/ryan-seacrest-hosting-american-idol-revival-1202501251/", "text": "Seacrest … in!\n\nAfter months of talks and speculation, Ryan Seacrest will officially return to host the “American Idol” revival on ABC. The network made the announcement after Seacrest broke the news on Thursday morning’s “Live With Kelly and Ryan.”\n\nSeacrest will earn about $12 million for his role on the show this season, but will not receive credit as an executive producer. He will, however, have creative consultation and approval on judges and other production issues, Variety has confirmed. Sources say the negotiations were protracted due to questions about his complicated schedule and other commitments.\n\nSeacrest served as host for the franchise during its 15-season run on Fox, which aired its “farewell season” last year. The multihyphenate will continue to co-host and executive produce “Live With Kelly and Ryan” from New York in addition to hosting and executive producing his iHeartRadio-syndicated morning radio show “On Air With Ryan Seacrest” from Los Angeles.\n\n“It’s genuinely hard to put into words what ‘American Idol’ means to me,” Seacrest said in a statement. “I’m so grateful for the show and all the career and life opportunities it’s allowed me to experience. It’s been an incredible journey from day one. To be asked to return this year, at my new home at Disney|ABC, is an honor, if not a bit surreal. I believe ABC is the perfect home for ‘Idol,’ and I’ve every confidence the show’s legions of fans will love it — especially “Idol’s” best traditions of showcasing heartwarming stories, remarkable talent discovery, and, best of all, making dreams come true.”\n\nABC Entertainment president Channing Dungey said she attributes much of “American Idol’s” success to Seacrest.\n\n“We are thrilled to be ushering in this new era of ‘American Idol’ with Ryan at the helm,” Dungey said. “So much of “American Idol’s” overwhelming success can be attributed to Ryan, whose larger-than- life personality and laudable dedication to creating quality entertainment has made him a true master of his craft. His talent is limitless, and I can’t think of a more appropriate person to honor the ‘Idol’ legacy as it takes on new life than the man who has been there through it all.”\n\nVariety reported in May that ABC, which beat out other networks to bring the singing competition back to the air, committed to broadcasting about 40 hours of the program — making it likely that the show will air over two nights most weeks, like it did on Fox.\n\nKaty Perry joined “American Idol” as a judge in May, becoming the first onscreen talent to board the reboot.\n\nLive auditions for the reality series begin in August. The show returns on ABC in 2018.\n\n“American Idol” is produced by FremantleMedia North America and 19 Entertainment, a division of CORE Media Group. The executive producers include FremantleMedia North America’s Trish Kinane and Jennifer Mullin, along with co-executive producer Megan Wolflick. FremantleMedia International distributes the series worldwide.\n\n“‘Idol’ wouldn’t be ‘Idol’ without Ryan,” said Core Media Group CEO Peter Hurwitz. “We’re delighted that he’s joining us and ABC as we set out to uncover the amazing talent America has to offer,” added Kinane, FremantleMedia’s president of entertainment programming.", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://pmcvariety.files.wordpress.com/2016/04/ryan-seacrest-american-idol.jpg?w=1024", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2017%2Ftv%2Fnews%2Fryan-seacrest-hosting-american-idol-revival-1202501251%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202501251&comment_count=10", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2016/04/ryan-seacrest-american-idol.jpg?w=1024", "keywords": [], "authors": ["Maane Khatchatourian"], "canonical_link": "https://variety.com/2017/tv/news/ryan-seacrest-hosting-american-idol-revival-1202501251/", "title": "Ryan Seacrest Returning to Host ‘American Idol’ Revival", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "After months of talks and speculation, Ryan Seacrest will officially return to host the \"American Idol\" revival on ABC.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202501251, "author": "Maane Khatchatourian", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-07-20T06:23:32"}, "pmc-tag": "American Idol,Ryan Seacrest", "title": "Ryan Seacrest Returning to Host ‘American Idol’ Revival", "pageclass": "article", "pmc-vertical": "music,tv", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "Ryan Seacrest Returning to Host ‘American Idol’ Revival", "url": "https://variety.com/2017/tv/news/ryan-seacrest-hosting-american-idol-revival-1202501251/", "description": "Seacrest … in! After months of talks and speculation, Ryan Seacrest will officially return to host the “American Idol” revival on ABC. The network made the announcement after Seac…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2016/04/ryan-seacrest-american-idol.jpg?w=1024", "width": 1024, "height": 768, "alt": "Ryan Seacrest American Idol"}, "locale": "en_US"}, "article": {"published_time": "2017-07-20T13:23:32+00:00", "modified_time": "2017-07-20T16:33:37+00:00"}, "twitter": {"creator": "@https://twitter.com/MaaneKhat", "site": "@variety", "text": {"title": "Ryan Seacrest Returning to Host ‘American Idol’ Revival"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2016/04/ryan-seacrest-american-idol.jpg?w=1024", "alt": "Ryan Seacrest American Idol"}, "card": "summary_large_image", "title": "Ryan Seacrest Returning to Host ‘American Idol’ Revival", "description": "After months of talks and speculation, Ryan Seacrest will officially return to host the \"American Idol\" revival on ABC."}, "author": "Maane Khatchatourian", "content_type": "Article", "post_id": 1202501251, "title": "Ryan Seacrest Returning to Host 'American Idol' Revival", "published_at": "2017-07-20 06:23:32", "image": "https://pmcvariety.files.wordpress.com/2016/04/ryan-seacrest-american-idol.jpg?w=1024", "comment_count": 10, "tags": "Ryan Seacrest", "topics": "News", "appeared_in_print": "No", "body": "Seacrest ... in!\r\n\r\nAfter months of talks and speculation, Ryan Seacrest will officially return to host the \"American Idol\" revival on ABC. The network made the announcement after Seacrest broke the news on Thursday morning's \"Live With Kelly and Ryan.\"\r\n\r\nhttps://youtu.be/boSM1EoPF1M\r\n\r\nSeacrest will earn about $12 million for his role on the show this season, but will not receive credit as an executive producer. He will, however, have creative consultation and approval on judges and other production issues, Variety has confirmed. Sources say the negotiations were protracted due to questions about his complicated schedule and other commitments.\r\n\r\nSeacrest served as host for the franchise during its 15-season run on Fox, which aired its \"farewell season\" last year. The multihyphenate will continue to co-host and executive produce \"Live With Kelly and Ryan\" from New York in addition to hosting and executive producing his iHeartRadio-syndicated morning radio show \"On Air With Ryan Seacrest\" from Los Angeles.\r\n\r\n\"It's genuinely hard to put into words what 'American Idol' means to me,\" Seacrest said in a statement. \"I'm so grateful for the show and all the career and life opportunities it's allowed me to experience. It's been an incredible journey from day one. To be asked to return this year, at my new home at Disney|ABC, is an honor, if not a bit surreal. I believe ABC is the perfect home for 'Idol,' and I've every confidence the show's legions of fans will love it -- especially \"Idol's\" best traditions of showcasing heartwarming stories, remarkable talent discovery, and, best of all, making dreams come true.\"\r\n\r\nABC Entertainment president Channing Dungey said she attributes much of \"American Idol's\" success to Seacrest.\r\n\r\n\"We are thrilled to be ushering in this new era of 'American Idol' with Ryan at the helm,\" Dungey said. \"So much of \"American Idol's\" overwhelming success can be attributed to Ryan, whose larger-than- life personality and laudable dedication to creating quality entertainment has made him a true master of his craft. His talent is limitless, and I can't think of a more appropriate person to honor the 'Idol' legacy as it takes on new life than the man who has been there through it all.\"\r\n\r\nVariety reported in May that ABC, which beat out other networks to bring the singing competition back to the air, committed to broadcasting about 40 hours of the program -- making it likely that the show will air over two nights most weeks, like it did on Fox.\r\n\r\nKaty Perry joined \"American Idol\" as a judge in May, becoming the first onscreen talent to board the reboot.\r\n\r\nLive auditions for the reality series begin in August. The show returns on ABC in 2018.\r\n\r\n\"American Idol\" is produced by FremantleMedia North America and 19 Entertainment, a division of CORE Media Group. The executive producers include FremantleMedia North America's Trish Kinane and Jennifer Mullin, along with co-executive producer Megan Wolflick. FremantleMedia International distributes the series worldwide.\r\n\r\n\"'Idol' wouldn't be 'Idol' without Ryan,\" said Core Media Group CEO Peter Hurwitz. \"We're delighted that he's joining us and ABC as we set out to uncover the amazing talent America has to offer,\" added Kinane, FremantleMedia's president of entertainment programming.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": ["https://www.youtube.com/embed/boSM1EoPF1M?version=3&enablejsapi=1&origin=https://pmcvariety.wordpress.com&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": 1500557012.0, "source": "https://variety.com", "summary": ""}