{"url": "https://abcnews.go.com/2020/Oscar_Stars/slideshow/photos-growing-clooney-9921409", "text": "Before They Were Famous Oscar-winning actor George Clooney was born in Lexington, Ky., in May 1961, the son of Nina and Nick Clooney. His mother was a former state beauty queen and his father was a TV newscaster and talk-show host. Courtesy of Nick and Nina Clooney\n\nBefore They Were Famous Father Nick Clooney describes his superstar son as outgoing, charismatic and optimistic in his early years. Here, toddler Clooney frolics in the snow and eats a snowball. Courtesy of Nick and Nina Clooney\n\nBefore They Were Famous George Clooney hugs his older sister Ada on the family's porch swing in Lexington, Ky. Courtesy of Nick and Nina Clooney\n\nBefore They Were Famous Clooney's family moved around a lot because of his father's broadcasting job. They left Lexington, Ky., for Columbus, Ohio, and then moved to Cincinnati, where his father's news career took off. The Clooneys later moved to Augusta, Ky., where George attended high school, and where his parents still live today. Here, the Clooney clan is pictured in 1966. Courtesy of Nick and Nina Clooney\n\nBefore They Were Famous George Clooney's second-grade school portrait. He was living in Columbus, Ohio, at the time. Courtesy of Nick and Nina Clooney\n\nGeorge Clooney: Before He Was Famous Even the photogenic George Clooney had an awkward stage. In middle school, Clooney was a nerdy-looking kid in glasses. \"George and his glasses -- an experiment that did not work out,\" father Nick Clooney joked. Courtesy Nick and Nina Clooney\n\nBefore They Were Famous At 13, Clooney developed Bell's palsy, a temporary form of facial paralysis caused by damage to the cranial nerve. According to father Nick Clooney, his face was half paralyzed for several weeks and some remnants of the disease lasted months. <P> \"It certainly affected him at the time,\" Nick Clooney said. \"But even there, George would find ways with humor to make it work for him. He would make fun of himself. He always did that. He tried to make fun of himself before others made fun of him, no matter what the disability might be.\" In this photo, his father said, George's smile is slightly crooked because of the facial paralysis. <P> There is still \"some residue of a little eye drooping\" when George gets tired, his dad said. Courtesy of Nick and Nina Clooney\n\nBefore They Were Famous George Clooney took up basketball, which was the big sport at small schools in Kentucky at the time, according to his father. An all-around jock, Clooney played recreational baseball and at one time, aspired to be a major league baseball player -- even trying out for the Cincinnati Reds in 1977. \"George was, you know, in high school, the clown. He also was a jock, of course. But he combined those often,\" Nick Clooney said. Courtesy of Nick and Nina Clooney\n\nBefore They Were Famous George Clooney, number 20, is in the center of the back row in this Augusta High School basketball team yearbook photo. Courtesy of Nick and Nina Clooney\n\nBefore They Were Famous George Clooney, who's been known to pull pranks on the set of movies like \"Ocean's 11,\" has always been a jokester, according to his dad. \"I thought he would be a stand-up comic,\" Nick Clooney said. \"I thought that -- he had that kind of wit and quickness and -- and the way of seeing things funny. …He was always spontaneous and always ready to jump in with a new idea.\" Courtesy of Nick and Nina Clooney\n\nGeorge Clooney: Before He Was Famous Clooney graduated from Augusta High School in 1979 and went on to college at Northern Kentucky University. He dropped out of college to pursue acting. Courtesy Nick and Nina ClooneyHandout\n\nBefore They Were Famous In 1981, Clooney visited the set of a small movie about horse racing, called \"And They're Off,\" that his cousin, Miguel Ferrer, was working on in Lexington, Ky. The visit solidified Clooney's dream to become an actor, his dad said, <P> \"Being around them and being around the entire ambiance of making film, watching how it is done, the process of -- of making the film itself, fascinated him from the very beginning, from that day,\" Nick Clooney said. \"And I think that's what led him away from broadcasting generally and directly into film acting and filmmaking.\" <P> From left to right: Miguel Ferrer, aunt Mary Guilfoyle, Clooney, Mary McDonough and Rafi Ferrer. Courtesy of Nick and Nina Clooney\n\nBefore They Were Famous At 18, George Clooney sold lemonade to earn money to go out to Hollywood. Here, he's pictured making lemon shake-ups on the streets of Augusta, Ky. Clooney moved to L.A. in 1982 to pursue an acting career. Courtesy of Nick and Nina Clooney\n\nBefore They Were Famous A 19-year-old Clooney is pictured with his pooch. He pulled the dog out of a snow bank, more dead than alive, and named her \"Lillian Gish.\" Gish starred in the silent 1921 film \"Orphans of the Storm.\" Courtesy of Nick and Nina Clooney\n\nBefore They Were Famous Clooney smiles at the Miss Indiana pageant, which father Nick Clooney hosted for many years. His mother, Nina, is pictured far left in the strapless lavender gown, with Clooney, sister Ada and dad Nick. Courtesy of Nick and Nina Clooney", "images": ["https://s.abcnews.com/images/2020/before_famous_100225_main.jpg", "https://s.abcnews.comnull", "https://secure-us.imrworldwide.com/cgi-bin/m?ci=us-704476h&cg=0&cc=1&ts=noscript", "http://www.googleadservices.com/pagead/conversion/1005826543/?value=0&label=1GPKCOHYjwMQ7-PO3wM&guid=ON&script=0", "https://s.abcnews.com/favicon.ico", "https://abcnews.go.com/2020/Oscar_Stars/slideshow/photos-growing-clooney-9921409"], "top_img": "https://s.abcnews.com/favicon.ico", "keywords": [], "authors": ["Abc News"], "canonical_link": "https://abcnews.go.com/2020/Oscar_Stars/slideshow/photos-growing-clooney-9921409", "title": "PHOTOS: Growing Up Clooney Photos", "meta_data": {"robots": "index, follow", "author": "ABC News", "copyright": "Copyright (c) 2020 ABC News Internet Ventures", "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "description": "See childhood photos of actor, celebrity and sex symbol George Clooney throughout his childhood and high school years before his big break on the hit TV show,", "keywords": "george clooney, clooney, celebrity, hollywood, famous, actor, oscars, fame, kentucky,", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "George Clooney: Before He Was Famous", "og": {"site_name": "ABC News", "title": "George Clooney: Before He Was Famous", "description": "See childhood photos of actor, celebrity and sex symbol George Clooney throughout his childhood and high school years before his big break on the hit TV show, \"E.R.\"", "url": "https://abcnews.go.com/2020/Oscar_Stars/slideshow/photos-growing-clooney-9921409"}}, "movies": [], "publish_date": null, "source": "https://abcnews.go.com", "summary": ""}