{"url": "www.rollingstone.com/culture/culture-news/notorious-b-i-g-s-mom-slams-kendall-kylie-jenners-disgusting-t-shirts-195635/", "text": "The late Notorious B.I.G.’s mother, Voletta Wallace, has slammed Kylie and Kendall Jenner over their latest marketing tool: “vintage” T-shirts with the pair’s faces superimposed over some of rap and rock’s biggest icons.\n\n“I am not sure who told @kyliejenner and @kendalljenner that they had the right to do this,” Wallace captioned an image of one of shirts with a giant red X emblazoned over it. “The disrespect of these girls to not even reach out to me or anyone connected to the estate baffles me. I have no idea why they feel they can exploit the deaths of 2pac and my Son Christopher to sell a t-shirt. This is disrespectful, disgusting, and exploitation at its worst!!!”\n\nI am not sure who told @kyliejenner and @kendalljenner that they had the right to do this. The disrespect of these girls to not even reach out to me or anyone connected to the estate baffles me. I have no idea why they feel they can exploit the deaths of 2pac and my Son Christopher to sell a t-shirt. This is disrespectful , disgusting, and exploitation at its worst!!! A post shared by Voletta Wallace (@volettawallace) on Jun 29, 2017 at 9:31am PDT\n\nAccording to TMZ, Wallace’s lawyer, Julian Petty, also sent a cease-and-desist letter to the Jenners.\n\nSharon Osbourne, whose husband, Ozzy Osbourne, also had his likeness featured on one of the T-shirts, took aim at the Jenner sisters as well with a scathing tweet.\n\n“Girls, you haven’t earned the right to put your face with musical icons,” she tweeted Thursday. “Stick to what you know … lip gloss.”\n\nGirls, you haven’t earned the right to put your face with musical icons. Stick to what you know…lip gloss. pic.twitter.com/BhmuUVrDBn — Sharon Osbourne (@MrsSOsbourne) June 29, 2017\n\nThe T-shirts in question were unveiled on the sisters’ Kendall & Kylie online shop Wednesday, and featured images of Tupac Shakur, Biggie Smalls, Black Sabbath, Metallica, Pink Floyd, the Doors, Kiss and Led Zeppelin overlaid with Instagram shots of the model/reality star siblings; they retailed for $125 and had the words “Repurposed in the USA” printed on each. The reality stars have since removed the products from their site.\n\nReps for Metallica, Pink Floyd, Kiss and Led Zeppelin and the Shakur estate did not immediately respond to requests for comment.\n\nOn Thursday afternoon, Kendall and Kylie Jenner posted identical messages to Twitter apologizing for the theft. “These designs were not well thought out and we deeply apologize to anyone that has been upset and/or offended, especially to the families of the artists. We are huge fans of their music and it was not our intention to disrespect these cultural icons in anyway [sic]. The tee shirts have been pulled from retail and all images have been removed. We will use this as an opportunity to learn from these mistakes and again, we are very sorry.”\n\nKylie and Kendall’s misstep is only the latest in a long string of problematic marketing and business decisions plaguing the Kardashian-Jenner family.\n\nEarlier this month, Kim Kardashian came under fire for ads for her new contouring kits, which featured a decidedly darker-skinned Kardashian. Critics slammed Kim for trying to hawk her beauty products by using blackface, an accusation that Kim sidestepped.\n\n“I would obviously never want to offend anyone. I used an amazing photographer and a team of people. I was really tan when we shot the images, and it might be that the contrast was off,” she told the New York Times. “But I showed the image to many people, to many in the business. No one brought that to our attention. No one mentioned it.”\n\nKhloe Kardashian faced her own controversy earlier this month too, after fashion designer Destiney Bleu accused her of copying her bedazzled clothing designs for her new Good American collection (with email receipts to back her up). Khloe roundly denied the claims, calling Bleu’s accusations “little more than a cheap publicity stunt.”\n\nLess drama-prone sister Kendall caused an uproar – and an SNL skit – in April after the model starred in a TV ad for Pepsi that cheapened the Black Lives Matter movement.\n\n“Pepsi was trying to project a global message of unity, peace and understanding. Clearly we missed the mark, and we apologize,” Pepsi wrote in a statement at the time. “We did not intend to make light of any serious issue. We are removing the content and halting any further rollout. We also apologize for putting Kendall Jenner in this position.” The commercial has been pulled off the air.", "images": ["http://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fculture%2Fculture-news%2Fnotorious-b-i-g-s-mom-slams-kendall-kylie-jenners-disgusting-t-shirts-195635%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=195635", "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-voletta-wallace-4f072054-3c4c-422e-8735-fec826f1cbf5.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-voletta-wallace-4f072054-3c4c-422e-8735-fec826f1cbf5.jpg", "keywords": [], "authors": ["Joyce Chen", "Joyce Chen'S Most Recent Stories", "Soundgarden", "Family Honor Chris Cornell At Seattle Statue Unveiling", "Bill Coswill Face Five More Accusers In Sexual Assault Retrial", "Natalee Holloway", "Man Linked To Disappearance Fatally Stabbed", "View All"], "canonical_link": "https://www.rollingstone.com/culture/culture-news/notorious-b-i-g-s-mom-slams-kendall-kylie-jenners-disgusting-t-shirts-195635/", "title": "Notorious B.I.G.’s Mom Slams Kendall, Kylie Jenner’s ‘Disgusting’ T-Shirts", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "Notorious B.I.G.'s mom has slammed Kylie and Kendall Jenner for using the rapper's image without permission on a T-shirt.", "news_keywords": "Black Sabbath, Hip-Hop, Kiss, Led Zeppelin, Metallica, Notorious B.I.G., Pink Floyd, The Doors, The Notorious B.I.G., Tupac Shakur", "og": {"type": "article", "title": "Notorious B.I.G.'s Mom Slams Kendall, Kylie Jenner's 'Disgusting' T-Shirts", "url": "https://www.rollingstone.com/culture/culture-news/notorious-b-i-g-s-mom-slams-kendall-kylie-jenners-disgusting-t-shirts-195635/", "description": "Youngest members of Kardashian-Jenner clan are under fire for plastering their faces over rap and rock icons", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-voletta-wallace-4f072054-3c4c-422e-8735-fec826f1cbf5.jpg", "width": 1024, "height": 576, "alt": "kylie jenner, kylie jenner controversy, kendall jenner, kendall jenner controversy, kylie and kendall jenner t-shirts, kylie kendall jenner t-shirt controversy, kylie kendall jenner notorious b.i.g., notorious b.i.g., kardashian controversy, kardashians controversy"}, "locale": "en_US"}, "article": {"published_time": "2017-06-29T20:07:00+00:00", "modified_time": "2018-06-25T16:29:55+00:00"}, "twitter": {"text": {"title": "Notorious B.I.G.'s Mom Slams Kendall, Kylie Jenner's 'Disgusting' T-Shirts"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-voletta-wallace-4f072054-3c4c-422e-8735-fec826f1cbf5.jpg?w=1024", "alt": "kylie jenner, kylie jenner controversy, kendall jenner, kendall jenner controversy, kylie and kendall jenner t-shirts, kylie kendall jenner t-shirt controversy, kylie kendall jenner notorious b.i.g., notorious b.i.g., kardashian controversy, kardashians controversy"}, "card": "summary_large_image", "site": "@RollingStone", "title": "Notorious B.I.G.’s Mom Slams Kendall, Kylie Jenner’s ‘Disgusting’ T-Shirts", "description": "Notorious B.I.G.'s mom has slammed Kylie and Kendall Jenner for using the rapper's image without permission on a T-shirt."}, "generator": "WordPress 5.4", "author": "Joyce Chen", "content_type": "Article", "post_id": 195635, "title": "Notorious B.I.G.'s Mom Slams Kendall, Kylie Jenner's 'Disgusting' T-Shirts", "published_at": "2017-06-29 20:07:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-voletta-wallace-4f072054-3c4c-422e-8735-fec826f1cbf5.jpg?w=1024", "comment_count": 0, "tags": "Tupac Shakur", "topics": "Culture News", "body": "The late Notorious B.I.G.'s mother, Voletta Wallace, has slammed Kylie and Kendall Jenner over their latest marketing tool: \"vintage\" T-shirts with the pair's faces superimposed over some of rap and rock's biggest icons.\"I am not sure who told @kyliejenner and @kendalljenner that they had the right to do this,\" Wallace captioned an image of one of shirts with a giant red X emblazoned over it. \"The disrespect of these girls to not even reach out to me or anyone connected to the estate baffles me. I have no idea why they feel they can exploit the deaths of 2pac and my Son Christopher to sell a t-shirt. This is disrespectful, disgusting, and exploitation at its worst!!!\"    I am not sure who told @kyliejenner and @kendalljenner that they had the right to do this.  The disrespect of these girls to not even reach out to me or anyone connected to the estate baffles me.  I have no idea why they feel they can exploit the deaths of 2pac and my Son Christopher to sell a t-shirt.  This is disrespectful , disgusting, and exploitation at its worst!!! A post shared by Voletta Wallace (@volettawallace) on Jun 29, 2017 at 9:31am PDT\nAccording to TMZ, Wallace's lawyer, Julian Petty, also sent a cease-and-desist letter to the Jenners.Sharon Osbourne, whose husband, Ozzy Osbourne, also had his likeness featured on one of the T-shirts, took aim at the Jenner sisters as well with a scathing tweet. \"Girls, you haven't earned the right to put your face with musical icons,\" she tweeted Thursday. \"Stick to what you know … lip gloss.\"Girls, you haven’t earned the right to put your face with musical icons. Stick to what you know…lip gloss. pic.twitter.com/BhmuUVrDBn— Sharon Osbourne (@MrsSOsbourne) June 29, 2017\nThe T-shirts in question were unveiled on the sisters' Kendall & Kylie online shop Wednesday, and featured images of Tupac Shakur, Biggie Smalls, Black Sabbath, Metallica, Pink Floyd, the Doors, Kiss and Led Zeppelin overlaid with Instagram shots of the model/reality star siblings; they retailed for $125 and had the words \"Repurposed in the USA\" printed on each. The reality stars have since removed the products from their site.Reps for Metallica, Pink Floyd, Kiss and Led Zeppelin and the Shakur estate did not immediately respond to requests for comment.On Thursday afternoon, Kendall and Kylie Jenner posted identical messages to Twitter apologizing for the theft. \"These designs were not well thought out and we deeply apologize to anyone that has been upset and/or offended, especially to the families of the artists. We are huge fans of their music and it was not our intention to disrespect these cultural icons in anyway [sic]. The tee shirts have been pulled from retail and all images have been removed. We will use this as an opportunity to learn from these mistakes and again, we are very sorry.\"Kylie and Kendall's misstep is only the latest in a long string of problematic marketing and business decisions plaguing the Kardashian-Jenner family.Earlier this month, Kim Kardashian came under fire for ads for her new contouring kits, which featured a decidedly darker-skinned Kardashian. Critics slammed Kim for trying to hawk her beauty products by using blackface, an accusation that Kim sidestepped.\"I would obviously never want to offend anyone. I used an amazing photographer and a team of people. I was really tan when we shot the images, and it might be that the contrast was off,\" she told the New York Times. “But I showed the image to many people, to many in the business. No one brought that to our attention. No one mentioned it.\"Khloe Kardashian faced her own controversy earlier this month too, after fashion designer Destiney Bleu accused her of copying her bedazzled clothing designs for her new Good American collection (with email receipts to back her up). Khloe roundly denied the claims, calling Bleu's accusations \"little more than a cheap publicity stunt.\"Less drama-prone sister Kendall caused an uproar – and an SNL skit – in April after the model starred in a TV ad for Pepsi that cheapened the Black Lives Matter movement.\"Pepsi was trying to project a global message of unity, peace and understanding. Clearly we missed the mark, and we apologize,\" Pepsi wrote in a statement at the time. \"We did not intend to make light of any serious issue. We are removing the content and halting any further rollout. We also apologize for putting Kendall Jenner in this position.\" The commercial has been pulled off the air.", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1498766820.0, "source": "http://www.rollingstone.com", "summary": ""}