{"url": "https://www.entitymag.com/the-bachelorette-rachel-deserves-better/", "text": "It feels like just yesterday I gave up watching “The Bachelor” because Nick Viall was so boring, but here we go. Bachelor Nation is back, but at least this time the girl is interesting. Enter Rachel Lindsay. *Spoilers for “The Bachelorette”*\n\nShe is stunning, funny and actually has a real job. (No, she’s not just a “free spirit.”) The Dallas-based trial attorney seemed sincere as she laughed while dubbing herself “sassy yet classy” before nervously kicking off her season of one of the most mocked reality TV series.\n\nOf course season 13 of “The Bachelorette” began with flashbacks of Rachel crying over Nick. Like, girl, you dodged a bullet. And we all know it. Then footage of Chris Harrison and the other assholes at ABC surprising our beautiful tropical fish with the first four contests of her upcoming series because nobody could take one more second of “happy couple” Nick and Vanessa [Grimaldi] scowling at each other.\n\nBut then we finally got back to the live footage of Rachel being the every girl as admitted to feeling like she was “in the movie clueless” while pulling onto Rodeo Drive, before allowing an old lady to advise her not to “sleep with all of ‘em.” Aye, aye, grandma!\n\n“I’m ready to focus on the part of my life that I’m just so talented at neglecting,” Rachel pledges. Giiirl. Get off of this terrible reality show and come be my best friend please, because yes.\n\nUgh. But just like that the attention is off of our darling Rachel and onto the horde of testosterone-filled, big-headed men who literally howl from the limousine and endlessly gush about how sexy Rachel is as if it’s a competition and the man with the best cheesy metaphor for her beauty wins her heart.\n\nThe writing for this show is so bad I leave a note for myself that I should be drinking for next week’s viewing. For example, professional wrestler contestant “Pretty Boy Pitbull Kenny King,” says something like, “I’ve been around a lot of rings in my life, maybe the next one that I touch is going to be the one I give you, Rachel.” [Drink]\n\nAlso, why do so many guys watch “The Bachelor?” Contestants are always saying they fell in love with Bachelorettes while watching them on series of “The Bachelor.” Does it have that big of a male audience? Are they using it for dating? And if so, should I be watching this season’s castoffs for my future husband and then social media stalking them after their final rose ceremonies? (Looking at you, Blake K.)\n\nOkay. What the fuck is the deal with this Whaboom guy? Because it’s not like Ka-boom – either the cleaner or the nonprofit that builds playgrounds for children (as seen on “Parks and Rec.”). It’s more like a bad, drawn out Jim Carrey impersonation…. and therefore seemingly not at all an occupation? This annoying man child has got to go, which means he’s probably going to be, like, the runner up or something. *sigh*\n\nNot to be a bitch here, but I feel like Rachel is better than a 31-year-old aspiring anything, let alone drummer. Especially one who spends his entire intro talking about his exercise regimen and how (supposedly) impressive his dick is. Hard pass.\n\nFor Diggy all I noted is that he has 575 pairs of sneakers and a bunch of “?!?!?!” because boy, what? Don’t get me wrong, I love shoes. But I literally can’t even imagine where that many shoes goes. How big is your house?! I’m getting a headache just thinking about how cluttered a room would look with that many shoes. Or how long it would take to find the pair you want. Unless you have one of those amazing closet computers like Cher in “Clueless,” in which case, you’ve pulled me back in. Let’s talk.\n\nAt this point, I’ve just noted “CORINNE!” The bitch is back! Unfortunately, so were a bunch of other girls I couldn’t remember. I know Raven was one of them, and she’s a sweetheart so she probably wasn’t thinking this, but if it were me I’d be like, hell no am I going back to this goddamn mansion to talk to a “Bachelorette” who is not me after I got all the way to the end just to be rejected by that loser on national television.\n\nBut like I said, she’s much nicer than I am. So she joined a bunch of other former contestants to talk Rachel up and give her encouragement before her big night. Then she ran off to get ready and our TV screens were tarnished by Smarmy McFull-of-it Chris Harrison, who stepped out to pretend once again that he was bestowing us with some great blessing instead of just playing host to the bajillionth season of a bad reality show.\n\nThen we saw Peter, who is a “business owner,” which seems questionable — what kind of business?! — but he was cute AF and in a plaid suit so I’m unbothered. Josiah seems to think he’s won already since they’re both lawyers, so that made him comfortable enough using lame ass puns like, “see you later, litigator” with reckless abandon.\n\nOne guy did an Urkel impression (what year is it?!) and another literally lugged a giant slab of ice and a huge hammer just so he could “break the ice.” Lord help me. Meanwhile, DeMario (whom Rachel had met on the pre-show) was still carrying around his plane tickets to jet off to Vegas with Rachel to elope.\n\nThere was a singer/songwriter, because there always is? I feel like they’re all from Tennessee, too. And was the last one named Lee? I feel like he was. Jack Stone really rubbed me the wrong way because after Rachel said she’d talk to him more inside he gave her crazy eyes and said, “You better.” Sir, all she “better” do in this lifetime is pay taxes and die, so just watch that tone if you want this TV time to launch your startup tie business or whatever you’re here for.\n\nAlso, how many guys are on this show? I feel like I’m back in the theater for the first installment of “The Hobbit,” before I realized it was a three-parter, sitting there like, IS THIS EIGHT HOURS LONG?! This is never going to end.\n\nYou guys, Rachel is TOO NICE. Men are tickling her. They are juggling for her and screaming in her face. And not a side eye to be seen. These produces must have a strict ass contract on her because I’m a people pleaser by nature and even I couldn’t have pulled this shit off.\n\nWait. Jonathan’s occupation is “tickle monster.” A grown man’s occupation is tickle monster. He’s 31, you guys. I can’t with this show. Okay, and now Adam has brought this creepy ass doll (“Adam Jr”) around with him. They have it speaking French to the cameras and literally have Rachel addressing it like it’s a one-on-one. Rachel is better than having to speak alone to a DOLL like some straight to DVD sequel to “The Boy.”\n\nNow Bryan was a little much for my taste because he was talking about how he was going to be “good trouble” for Rachel since he’s Colombian, but she seemed into it. And at least he’s a Chiropractor and not some made up, horrifying job like “tickle monster.” And well, during their one-on-one, not only did he tell her that he’s “good with his hands,” but he fucking WENT FOR IT.\n\nThey tongued like teenagers and if I’m being honest, I was not expecting it. I looked away for one second, and when I looked back, I kid you not, I audibly yelled, “OH SHIT!” at the TV… alone in my bedroom. Get it, girl.\n\nBryan was the only one Rachel kissed that night, and therefore the one mostly likely to be cocky. But he seemed to have kept his mouth shut. Meanwhile, other guys like Josiah and DeMario seemed pretty certain they were getting that first impression rose.\n\nThese dudes are cocky AF not only about the rose but about Rachel being their wife, for having spoken to her for all of, oh, I don’t know, five minutes. Bachelor Nation is weird, man. Just think if a girl said that in real life. Guys would RUN. But they’re literally arguing over who is going to marry her after basically one interaction.\n\nAnd Blake E. is having a little meltdown because he’s so mad Lucas (Whaboom) is there “for the wrong reasons.” Like, every interview is about Lucas. You know you’re there to focus on Rachel, right? Blake E. seems like the new Evan. But Chad is waaaay more interesting than Lucas. Sorry not sorry.\n\nNot surprisingly, Bryan gets the first impression rose, and they seal it with another kiss. This prompts all the other guys to flip out, and say insanely narcissistic things like, “Maybe Rachel doesn’t like guys with perfect hair and perfect facial features.” WOW.\n\nFinally, after the sun had come up Rachel did her first rose ceremony, sending home the adorable Blake K., as well as a bunch of other people I’ve already forgotten. However, she did keep the grown man dressed in a penguin suit as well as whaboom guy (Lucas), much to Blake E.’s dismay. Clearly the producers have a big hand in shaping this season.\n\nNow, we already know Rachel ends up engaged, thanks to ABC’s spoilers. So I’m not entirely sure of the point of this show anymore. It’s like “UnREAL” popped “The Bachelor” bubble and now they’re just admitting that love isn’t real and they’re just all about the fabricated drama.\n\nSo, I guess here’s to drama. And wine. Next week I’ll be watching with wine.", "images": ["https://www.facebook.com/tr?id=1833586533359519&ev=PageView&noscript=1", "https://s24193.pcdn.co/wp-content/uploads/2019/07/sydneywilhelm-262x100.jpg", "https://s24193.pcdn.co/wp-content/uploads/2020/04/sincerelymedia-262x100.jpg", "https://pixel.quantserve.com/pixel/p-LYHLZ2G7DVf5j.gif", "https://s24193.pcdn.co/wp-content/uploads/2019/06/kitchen-515388_1920-262x100.jpg", "https://s24193.pcdn.co/wp-content/uploads/2017/05/The-Bachelorette-Rachel-deserves-better-doll-Entity.png", "https://s24193.pcdn.co/wp-content/uploads/2017/05/The-Bachelorette-Rachel-deserves-better-kiss-Entity.png", "https://pixel.quantserve.com/pixel/p-t0psdDzpeVM89.gif", "https://s24193.pcdn.co/wp-content/uploads/2019/07/noah-buscher-x8ZStukS2PM-unsplash-262x100.jpg", "https://s24193.pcdn.co/wp-content/uploads/2017/04/entity_v7-entity-gold-bar-for-black.png", "https://s24193.pcdn.co/wp-content/uploads/2020/04/performance-art-262x100.jpg", "https://media.giphy.com/media/6Nv7BdrUl6Psc/giphy.gif", "https://s24193.pcdn.co/wp-content/uploads/2017/01/kayla-caldwell-entity-288x300.jpg", "https://s24193.pcdn.co/wp-content/uploads/2017/05/The-Bachelorette-Rachel-deserves-better-Entity-1320x720.png", "https://s24193.pcdn.co/wp-content/uploads/2018/09/170811_Entity_Sin_Charlie_Last-Day1-2-e1538596089633.jpg", "https://s24193.pcdn.co/wp-content/uploads/2018/09/Entity-Academy-Logo-1.png", "https://s24193.pcdn.co/wp-content/uploads/2018/09/ENTITY-Logo-Gold-1024x146.png"], "top_img": "https://s24193.pcdn.co/wp-content/uploads/2017/05/The-Bachelorette-Rachel-deserves-better-Entity-1320x720.png", "keywords": [], "authors": [], "canonical_link": "https://www.entitymag.com/the-bachelorette-rachel-deserves-better/", "title": "‘The Bachelorette’: Rachel Deserves Better Than These Clowns", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "The Bachelorette Rachel deserves better. Lindsay is an attorney in Texas and does not deserve \"tickle monsters\" and creepy dolls.", "fb": {"pages": 1554725741499166}, "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "The Bachelorette Rachel Deserves Better Than These Clowns", "description": "The Bachelorette Rachel deserves better. Lindsay is an attorney in Texas and does not deserve \"tickle monsters\" and creepy dolls.", "url": "https://www.entitymag.com/the-bachelorette-rachel-deserves-better/", "site_name": "ENTITY", "updated_time": "2017-05-23T23:12:22+00:00", "image": {"identifier": "https://s24193.pcdn.co/wp-content/uploads/2017/05/The-Bachelorette-Rachel-deserves-better-Entity-1320x720.png", "secure_url": "https://s24193.pcdn.co/wp-content/uploads/2017/05/The-Bachelorette-Rachel-deserves-better-Entity-1320x720.png", "width": 1320, "height": 720}}, "article": {"publisher": "https://www.facebook.com/entitymag", "tag": "The Bachelorette", "section": "Culture", "published_time": "2017-05-23T20:12:17+00:00", "modified_time": "2017-05-23T23:12:22+00:00"}, "twitter": {"card": "summary", "description": "The Bachelorette Rachel deserves better. Lindsay is an attorney in Texas and does not deserve \"tickle monsters\" and creepy dolls.", "title": "The Bachelorette Rachel Deserves Better Than These Clowns", "site": "@entity_mag", "image": "https://s24193.pcdn.co/wp-content/uploads/2017/05/The-Bachelorette-Rachel-deserves-better-Entity-1320x720.png", "creator": "@en"}, "generator": "WordPress 5.3.2"}, "movies": [], "publish_date": 1495570337.0, "source": "https://www.entitymag.com", "summary": ""}