{"url": "https://www.fastcompany.com/40572040/reese-witherspoon-most-creative-people-2018", "text": "When Reese Witherspoon was 17, she had already appeared in four films. Still, she took an unlikely part-time job, as an intern in Disney’s post-production department. “I wanted to learn about editing, visual correction, and sound mixing,” she tells me 25 years later. Not long after, she worked as a production assistant on the 1995 Denzel Washington film Devil in a Blue Dress, helping with casting, among other things. Also: “I parked Denzel’s Porsche!”\n\nadvertisement\n\nadvertisement\n\nThat inquisitiveness, as well as nearly three decades in front of the camera, has made Witherspoon one of Hollywood’s most astute producers. She turned Gillian Flynn’s Gone Girl into a $369 million worldwide hit in 2014 (that earned Rosamund Pike an Oscar nomination) and did it again, that same year, transforming Cheryl Strayed’s best-selling memoir, Wild, into a breakout success ($52 million plus Oscar nods for Witherspoon and costar Laura Dern). Then came HBO’s Big Little Lies, executive produced with costar Nicole Kidman; the cultural bellwether about female relationships and domestic abuse, based on a novel by Liane Moriarty, swept nearly every category for which it was nominated at the 2017 Emmys. After years of hearing from studio executives that there was no market for female-driven films, Witherspoon had succeeded to a degree that proved a hunger was there. Related: See The 100 Most Creative People In Business 2018 Her instinct for what women want is now being tested on multiple platforms through her 18-month-old storytelling company, Hello Sunshine. She and her team currently have shows in development at Hulu, NBC, and Apple TV (which has partnered on three projects, one rumored to be the biggest deal in history for a straight-to-series show), as well as a film at TriStar/Sony Pictures. But Witherspoon is also laying the foundation for a direct-to-consumer brand, one that is already beginning to speak to women through a website, social media, YouTube and Facebook videos, audiobooks, podcasts, and newsletters—whichever platform she and Hello Sunshine execs think best honors the story being told. For all the company’s digital ambition, Hello Sunshine’s Santa Monica, California, headquarters have an old-fashioned feel. The loft-like interior, with exposed wooden beams and pipes, is cheerfully decorated by Crate & Barrel (Witherspoon collaborates with the retailer). Vintage typewriters and hundreds of books make plain the company’s abiding passions: stories and the people who tell them. Sheets of paper with typewritten words to live by, tacked to a wall, gently rustle every time the front door opens. “I hope that you will find some way to break the rules and make a little trouble out there,” reads one, a line from Nora Ephron’s 1996 commencement address at Wellesley College. “And I also hope you will choose to make some of that trouble on behalf of women.” Fluorescent signs at the back of the room illuminate a five-word ethos: optimism, humor, curiosity, honesty, generosity. The space—which doubles as a set for interviews—is recognizable from videos on the Hello Sunshine website. Witherspoon’s glassed-in office is within shouting distance of her coworkers, who on a late March day sit or stand at a handful of desks or read books in armchairs. Witherspoon is wearing a navy blazer and a blue shirt with white hearts, both from Draper James, the apparel and housewares brand she launched online in 2015 as a “hey y’all!” celebration of her down-home roots. Her look is feminine, but not precious. Or, as her friend Kerry Washington describes it, “genteel Southern badass.” Witherspoon, in person, bears a distracting similitude to Elle Woods, the character she made famous with 2001’s Legally Blonde. Celeste Ng, whose novel Little Fires Everywhere is being adapted by Hello Sunshine for Hulu, had a similar first reaction: “She’s bubbly and perky and scarily smart. I thought, Oh my god, it’s Elle Woods! But there’s a kinship with [Election‘s] Tracy Flick, too, in that people who underestimate her learn their mistake really fast.”\n\nadvertisement\n\nWherever Witherspoon goes—Asia, Europe, Africa, South America—she is stopped by Legally Blonde fans: “I went to law school because of you,” they’ll say, or, “You helped me believe in myself.” She gets teary talking about the film’s impact. “I didn’t even understand when I was making it that it was a bit of a modern feminist manifesto,” she says. “Seeing a woman who is interested in feminine attitudes—getting her nails done—but who is also interested in promoting herself and accomplishing things was a new idea of feminine. A lot of women related to that, and the feeling of being underestimated.” Related video: Our all-female crew talks women in Hollywood with Reese Witherspoon Cynics might wonder if Witherspoon’s production company was merely designed to capitalize on #MeToo’s momentum. But Hello Sunshine was founded in November 2016, nearly a year before the flood of 60-plus allegations against veteran Hollywood producer Harvey Weinstein exposed just how endemic and toxic the industry’s gender imbalance has been. The outpouring of firsthand accounts of sexual abuse from fellow actors encouraged Witherspoon to reveal her own multiple experiences of harassment and assault, including by a director when she was just 16. She was among the Hollywood women who organized the all-black dress code for the Golden Globes this past January as part of the Time’s Up movement. This look is totally Madeline Mackenzie! @reesewitherspoon is in Monterey and brought along the Draper James Elliston Floral Skirt — link in bio to shop ???? A post shared by Draper James (@draperjames) on Apr 14, 2018 at 11:09am PDT “Part of me is incredulous,” says Witherspoon of Hollywood’s quick pivot to addressing gender disparity. “I can’t believe people are actually listening now. It’s also a relief,” she adds with a laugh, “not to have to spend the first 15 minutes of every meeting talking about the lack of content for women. Now it’s, ‘Yeah, got it.’ ” At the same time, she says, “a lot of us are having to step up into leadership positions that we didn’t know we were capable of. I definitely feel that in my life.” Putting more women on screen is a Hello Sunshine mandate. But surfacing the voices of real—and diverse—women is the company’s true mission. There are many female-focused production companies, and several successful digital brands that produce social content directed at women, but no entity has yet tried to do what Witherspoon is attempting: to build a premium independent film and TV studio within a direct-to-consumer, female-led brand that operates on multiple platforms. “Fortunately,” Witherspoon says, “I like proving people wrong.” Hello Sunshine is Witherspoon’s third production company. At 25, she had an office and five employees to develop movies for Universal Studios. She called it Type A Films. “I had no idea what I was doing,” she says. “In four years I produced one film, Penelope, with Christina Ricci. It was beautiful, and I loved it, but it was clear to me that I wasn’t ready to tell stories—because I didn’t know what stories I wanted to tell.”\n\nadvertisement\n\nAs she aged, substantial roles became harder to come by. “It was getting laughable how bad the parts were, particularly for women over 35,” says Witherspoon. “And that, of course, is when you become really interesting as a woman.” Suddenly, there were stories she wanted to tell. Witherspoon thought about partnering again with a studio to develop films. Her husband, Jim Toth, dissuaded her. Toth is a motion picture talent agent at Creative Artists Agency, and it was apparent to him that his wife was good at reading the zeitgeist and spotting promising authors. Toth told her, “‘Babe, do it yourself,'” Witherspoon recalls. “‘You read more books than anyone I know. You know what works as well as anyone.'” She also wanted to “further the evolution of women’s roles,” she says, and they both knew that partnering with a studio would mean satisfying a corporate mandate. “I’d be making products they like,” she says. Witherspoon joined forces in 2012 with another producer, Bruna Papandrea. They created a company called Pacific Standard, which went on to adapt two of that year’s hottest book properties, Crown Publishing Group’s Gone Girl and Alfred A. Knopf’s Wild (Strayed had personally sent an advance copy directly to Witherspoon in November 2011). Around the time that they were developing Big Little Lies, in 2014, Witherspoon began noting changes in consumer behavior. “Women weren’t going to movies,” she says. “They were streaming shows. They were on Instagram and Facebook. Digital was winning. The only way was to go where women are, instead of expecting them to come to us in theaters.” The digital imperative was underscored by her three children—Ava, 18, and Deacon, 14 (with first husband, actor Ryan Phillippe), and 5-year-old Tennessee (with Toth, whom she married in March 2011). For them, YouTube and streaming had replaced watching network TV and going to the movies. Rather than moaning like so many in the industry about the tyranny of tiny screens, Witherspoon became excited by the creative potential of digital platforms and the relationships forged on social media. She joined Instagram in 2013 and started to build an audience (12.8 million followers to date). Draper James—which now has four brick-and-mortar stores—allowed her to become involved with consumers in a more intimate way. “I’d never had that before. I was always behind a screen. And I’m an extrovert,” adds Witherspoon, who remains creative director and the face of the retail company. Witherspoon’s second-ever Instagram post, in May 2013, was about J. Courtney Sullivan’s novel The Engagements (“I love this book! Has anyone else read?”). It got a big-enough reaction that other book recommendations followed. News she posted about Pacific Standard’s coming adaptations of Gone Girl and Wild gave both novels sales bumps. According to Amazon Books, Gone Girl sales tripled following the release of the first movie trailer, then doubled during the opening weekend. Witherspoon learned that she could personally build audiences for movies long before they were released. At the same time, she was also loving the conversations she was having with other women about literature. After starting an informal Instagram-led book club in 2015, Witherspoon grew even more interested in digital community\n\nbuilding. Papandrea preferred to stick with film and TV. The pair decided to dissolve Pacific Standard (though they continue to partner on Big Little Lies; season 2 is due in 2019), and Witherspoon began to think about who might help her build a consumer-facing brand.\n\nadvertisement\n\nIf Witherspoon is the soul of Hello Sunshine, then CEO Sarah Harden, a fast-talking Australian, is the heart of the place, pumping life into the operation daily. I meet her in the company’s second office, in Beverly Hills, where the film and TV brainstorming happens. Harden and Witherspoon met through Peter Chernin, who was head of 20th Century Fox when the studio produced 2005’s Johnny Cash biopic Walk the Line, for which Witherspoon won a Best Actress Oscar. When Chernin left the company, Witherspoon followed his career. “He is very smart,” she says, “and a good prognosticator.” Chernin had gone on to found his own media company, the Chernin Group, and launch (with AT&T) a subsidiary called Otter Media, dedicated to acquiring and building media brands for niche audiences. One of them, Crunchyroll, is now the largest global distributor of anime. The executive overseeing Otter’s acquisitions was Harden, who watched digital media studio Rooster Teeth turn itself into an online mecca for gamers. “Sixty thousand people go to [the Rooster Teeth] convention in Austin every summer,” Harden says. “I said, ‘We’ve got to find a female equivalent.’ ” She spent four years looking at existing female-driven brands. Most “were beauty- and fashion-focused, publishing-focused. They weren’t video storytelling at their core. And video is expensive,” she adds. “It takes incisive understanding to build full-scale, profitable businesses around that, and it requires creating a brand people love.” Witherspoon first brought her idea for Hello Sunshine to Chernin in the summer of 2016. One of her criteria: “I needed to have a woman run the company,” she says. Chernin introduced her to Harden, and by November, Otter Media was Hello Sunshine’s only external seed investor (for an amount in the “single-digit millions,” says Harden), joining Witherspoon, Toth, and investor Seth Rodsky, who was Witherspoon’s partner in founding Draper James. The investment “had nothing to do with Reese being a movie star,” says Chernin. “She’s a great entrepreneur because of her willpower. And she had a remarkably clear idea of what she wanted to build.” He also saw a potentially lucrative white space for an underserved audience. Unlike the millennial- and coastal-focused brands that dominate the digital landscape, Witherspoon is targeting literate women across America, spanning a strikingly wide age range of 20 to 60. Hello Sunshine now has 19 employees, with 20 more likely to join by year’s end—a workforce that, yes, includes men. It’s important, Witherspoon says, that men “feel they have an opportunity to create a new reality for the world too.” Underlying everything, says Harden, is books. Witherspoon’s book club picks—and, yes, she chooses each one (helpfully, she reads fast)—were an easy way to establish the company’s tone. One of Harden’s first moves after taking the helm of the company last June was to turn each selection into a monthly event, supported by video interviews with authors (usually conducted by Witherspoon), social posts on, say, a book’s inspiration, and giveaways—all in the service of community building. Maintaining levity is important, says Harden: “You can go to earnest places very quickly, and Reese will say, ‘This is not funny! Nothing about this is funny!’ ”\n\nadvertisement\n\nReese’s Book Club x Hello Sunshine, which counts upwards of 460,000 followers on Instagram, hasn’t reached Oprah book club heights (more than a million followers), but Hello Sunshine is already considered by the publishing industry to be a powerful marketing force. Two of her selections have been HarperCollins titles: Kate Quinn’s The Alice Network and Balli Kaur Jaswal’s Erotic Stories for Punjabi Widows. “With both novels, we saw significant upticks, not just in sales but in distribution,” says Jennifer Hart, a marketing executive at the publishing company, who is particularly optimistic about a recently launched Hello Sunshine newsletter. Witherspoon is world-famous, deep-pocketed, and married to a top agent at a leading Hollywood agency (where she is also a client). It’s tempting for people to attribute her success as a producer to her undeniable advantage. But Witherspoon’s pipeline to the book world is authentic and robust. Since posting her first book recommendation five years ago, she has relied on her taste and instinct to predict, again and again, which titles will resonate with her audience, and that has encouraged the book world to court her attention. The Alice Network became a New York Times bestseller six months after Witherspoon selected it for her book club. HarperCollins even timed the release of last March’s Erotic Stories for Punjabi Widows—”which wasn’t on anyone’s radar as a big book,” says Hart—to coincide with the Hello Sunshine pick. “I don’t think there’s anyone out there who is as much of an advocate for female authors, and for pushing out new, diverse voices,” says Hart. Little Fires Everywhere was months from publication when Witherspoon first read it, and she chose it for her book club last September, before it became a monster best seller. Like Big Little Lies, the novel is rich with conversation starters—in this case, adoption, parenting, race, and class. Witherspoon had been looking for a series to coproduce with Kerry Washington, and the minute she finished Little Fires, she emailed the actress. “The message was, ‘I’ve found our project!’ ” says Washington, who was shooting Scandal at the time. “I finished it in 72 hours. I literally locked myself in a bathroom.” Hulu won the bidding war and is developing the series. @reesewitherspoon and @kerrywashington are on ???????????? with some MAJOR news. ???? our Stories or tap the link in bio to see what they’ve been up to! #LittleFiresEverywhere @pronounced_ing A post shared by Hello Sunshine (@hellosunshine) on Mar 2, 2018 at 10:11am PST Hello Sunshine’s newest venture is a multiyear partnership with Audible, the world’s largest producer of audiobooks, which will allow anyone to access the audio versions of Witherspoon’s monthly book club picks. Don Katz, the founder of the company, now owned by Amazon, had lunch with Witherspoon in May 2017 (they were both speaking at the Milken Conference) and “one thing led to another,” he says. A separate but related deal, Audible Originals x Hello Sunshine, will enable Witherspoon’s company to commission new audio-first or audio-exclusive works from authors, playwrights, and TV writers. “Reese is focused on talent—actors and writers—who [are] underemployed for various reasons,” says Katz, “and she’s aware of an audience that is similarly underserved. All of those people come with her.” Chernin says that Hello Sunshine’s biggest challenge now is growing its daily engagement, and Harden and Witherspoon know that one key to this will be maintaining Hello Sunshine’s positive, pro-women voice. Witherspoon has been remarkably savvy in the way she communicates with her audience. But as Lena Dunham, Gwyneth Paltrow, and Tony Robbins might attest, too much honesty can be perilous when you are running a personal brand. A single tone-deaf comment, awkwardly phrased joke, or attempt at “making a little trouble” as Nora Ephron suggests, could derail your entire business. But Witherspoon’s wit and straightforwardness are what her fans love about her. If she plays it too safe, she risks losing them, too.\n\nadvertisement\n\nWitherspoon needs to walk off a sciatica flare-up, a recent development, so we stroll from the Santa Monica office to a nearby grocery and café. Witherspoon, who grew up in Nashville, talks about having two doctors as parents—her father is a retired otolaryngologist and her mother has a PhD in pediatric nursing. “My dad, every day he read medical journals and historical novels. If you didn’t have something interesting to say at the dinner table, it was because you weren’t doing any research or you weren’t a curious person,” she says. “He’s not a people person,” she adds. “I get that from my mom.” Asked about her career role models, she thinks for a few moments. “Goldie Hawn,” she says finally. “When she saw studios weren’t making parts for her, she knew her audience and would create a film based on what she knew they wanted to see—Private Benjamin, or Wildcats. Also Dolly Parton, who told me she did her best work partnering with women.” The old trope of the competitive female coworker, will, in Witherspoon’s opinion, disappear as jobs for them increase. “There’s real power in partnership, and I don’t think we have the ego thing as much.” HBO’s chairman and CEO, Richard Plepler, says that when Witherspoon learned that Nicole Kidman was also interested in optioning Big Little Lies, Witherspoon and Papandrea got in touch with Kidman and suggested that they join forces. “I love that about Reese,” says Plepler. “There’s room for everyone at the table.” For Witherspoon, partnering with Kidman has proved to be what she calls a “one plus one equals five” strategy: “People see the show’s success, that it makes a lot of money for the company, and that will create another show like that.” It’s playing out faster than she could have imagined. Casey Bloys, HBO’s president of programming, admitted in April that the network’s recent equal-pay push (e.g., Westworld star Evan Rachel Wood will earn as much as her male costars starting with season 3) was a “direct result” of the Time’s Up movement and encouragement he received from Witherspoon. Witherspoon and Kidman, meanwhile, will each take more than $500,000 per episode for season 2 of Big Little Lies. While crunching on avocado oil potato chips at the café, Witherspoon tells me about an exercise she does with her family, on the rare occasions when they watch TV together. A commercial will come on—such as a recent Adidas ad featuring athletes, models, and DJs sitting around a table, talking about what’s cool—and when it’s over, she’ll press pause and ask, “What did you see?” In this instance, “they said they saw a mix of people who were interesting and creative. And I said, ‘You know what I see? Three women and 13 men at the table. That’s what I see.’ ” Invariably, during these exercises, her family will ask her to roll the commercial back to check her math, and she’s usually pretty close. “Now my husband sees it all the time,” she says. “You just have to ask yourself, What am I not seeing?”\n\nadvertisement\n\nOne of the projects in development at Hello Sunshine is a film version of Karin Tanabe’s The Gilded Years, which will be released by TriStar/Sony Pictures next year. The 2016 novel reimagines the true story of the first black graduate of Vassar, in 1897, who was light-skinned enough to pass for white. Witherspoon fast-tracked a bidding war by preemptively casting the immensely popular former Disney star and pop singer Zendaya, who will also coproduce. For the adaptation, called A White Lie, she hired veteran TV screenwriter and producer Monica Beletsky (Fargo, Parenthood) because Beletsky had an idea for how to turn the period piece—always a hard sell with studios and audiences—into a thriller. Beletsky says she’s never before experienced the level of support she received from Hello Sunshine. “It can’t be overstated how rare it is to find producers who so quickly take a risk on an original idea, who are able to see the same film in their head that I see in mine,” she says. In her experience, producers don’t prep much before pitching movies to studios—”maybe a phone call the day before,” she says. But prior to her first meeting with potential buyers for A White Lie, Hello Sunshine had her workshop the pitch in front of different groups of employees. “I kid them that I felt like I’d been trained for the movie-storytelling Olympics.” The pitches are multimedia productions: Beletsky described her script in front of images from the period; as she talked about a scene, the real places would appear behind her. She’s half black and half Jewish, so she spent some time talking about identity; Zendaya spoke of “colorism” and how she connected to the material. At the end of one meeting, a potential buyer said, “Well, the good news is that we’re living in a world where people are more open-minded,” recalls Lauren Neustadter, Hello Sunshine’s head of TV and film development. Witherspoon was dismayed by the comment, Neustadter says, and on the way back to the office Witherspoon asked her assistant to find current photos of the boards of various big corporations, as well as members of Congress. They offered a stark finale to the team’s second pitch meeting, one that emphasized how little has actually changed—the very reason the film needs to be made. “Reese got very emotional,” remembers Neustadter, “and she said to the room, ‘We wish that we lived in a world where that was different.’ ” She was essentially asking studio execs what she asks of her family: What are you not seeing? It’s a question she hopes every Hello Sunshine project will answer. Reese Witherspoon is No. 11 on the 2018 Most Creative People in Business list. Check out all 100 people here.\n\nadvertisement\n\nRelated video: Reese Witherspoon on her mentor, Oprah", "images": ["https://images.fastcompany.com/image/upload/v1576118408/insta-icon-circle-in.svg", "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2018/05/p-2480-REECE-how-reese-witherspoon-is-flipping-the-script-on-hollywood-FA0618WITH001.jpg", "https://secure-us.imrworldwide.com/cgi-bin/m?ci=us-805310h&cg=0&cc=1&ts=noscript", "https://images.fastcompany.com/image/upload/v1576118408/fb-icon-circle-fb.svg", "http://b.scorecardresearch.com/p?c1=2&c2=6916907&cv=2.0&cj=1", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAwAAAANCAAAAAC4QtCeAAAABGdBTUEAALGPC/xhBQAAAAFzUkdCAK7OHOkAAAAgY0hSTQAAeiYAAICEAAD6AAAAgOgAAHUwAADqYAAAOpgAABdwnLpRPAAAAAJ0Uk5TAAB2k804AAAAAmJLR0QAAKqNIzIAAAAJcEhZcwAAAEgAAABIAEbJaz4AAACASURBVAjXYyir3PaDAQby09KL9/2FcjIWf1mbVX0Mwklfw8DwbF5awzkwZzXDjco/j/vTuq+COe93APXcLE5bCeKczvzOwPCoPG0xiHMq6/f9SWkdF4HK1jKcyepJazgFNnrBpwtpVUchRuempR17+htqaU/55l9w5xzf+RHOBgC94zlXyQTR6wAAACV0RVh0ZGF0ZTpjcmVhdGUAMjAxMy0wMy0wOFQxOToxMDo0NC0wNTowMNnS5vEAAAAldEVYdGRhdGU6bW9kaWZ5ADIwMTMtMDMtMDhUMTk6MTA6NDQtMDU6MDCoj15NAAAAAElFTkSuQmCC", "https://grunerandjahr.112.2o7.net/b/ss/gjincfastcoprod/1/H.24.4--NS/0/5658306", "https://images.fastcompany.com/image/upload/v1576118408/linkedin-icon-circle-li.svg", "https://images.fastcompany.com/image/upload/v1576118408/tw-icon-circle-tw.svg", "https://www.facebook.com/tr?id=1389601884702365&ev=PageView&noscript=1"], "top_img": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2018/05/p-2480-REECE-how-reese-witherspoon-is-flipping-the-script-on-hollywood-FA0618WITH001.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.fastcompany.com/40572040/reese-witherspoon-most-creative-people-2018", "title": "How Reese Witherspoon is flipping the script on Hollywood", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "description": "The Hello Sunshine founder is channeling women’s voices into top-tier entertainment–and altering the dynamics of the entire industry along the way.", "og": {"type": "article", "title": "How Reese Witherspoon is flipping the script on Hollywood", "url": "https://www.fastcompany.com/40572040/reese-witherspoon-most-creative-people-2018", "locale": "en_US", "description": "The Hello Sunshine founder is channeling women’s voices into top-tier entertainment–and altering the dynamics of the entire industry along the way.", "image": {"identifier": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2018/05/p-2480-REECE-how-reese-witherspoon-is-flipping-the-script-on-hollywood-FA0618WITH001.jpg", "width": 1280, "height": 720}, "site_name": "Fast Company"}, "fb": {"app_id": 178479832213933, "admins": 100000062710915}, "twitter": {"card": "summary_large_image", "title": "How Reese Witherspoon is flipping the script on Hollywood", "description": "The Hello Sunshine founder is channeling women’s voices into top-tier entertainment–and altering the dynamics of the entire industry along the way.", "url": "https://www.fastcompany.com/40572040/reese-witherspoon-most-creative-people-2018", "site": "@fastcompany", "image": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2018/05/p-2480-REECE-how-reese-witherspoon-is-flipping-the-script-on-hollywood-FA0618WITH001.jpg", "domain": "fastcompany.com"}, "theme-color": "#ffffff", "google-site-verification": "rU5yl8EMHvPkTmEeqiqqeEVmNz4eTxaV_Zw8-tr26VA", "article": {"publisher": "https://www.facebook.com/FastCompany", "published_time": "2018-05-30T05:00:51", "modified_time": "2018-05-31T21:06:19", "tag": "hello sunshine"}, "author": "Mary Kaye Schilling", "news_keywords": "Fast Company Magazine, hello sunshine"}, "movies": ["https://www.youtube.com/embed/FeLuRSJl4k0?feature=oembed", "https://www.youtube.com/embed/xOPl8gKdmYE?feature=oembed", "https://www.youtube.com/embed/bkAJhhH7Td0?feature=oembed"], "publish_date": 1527627651.0, "source": "https://www.fastcompany.com", "summary": ""}