{"url": "www.bustle.com/articles/135360-leonardo-dicaprios-oscar-snubs-compared-to-other-actors-snubs-shows-hes-not-all-that-unsual", "text": "As Oscar season approaches, all eyes are on Leonardo DiCaprio. Will 2016 be the year he finally gets his Oscar? Unarguably one of the best actors of our time, DiCaprio has been nominated for four Academy Awards and never won. The Wolf of Wall Street (2014), Blood Diamond (2007), The Aviator (2004) and What's Eating Gilbert Grape (1994) have all failed in securing him that coveted golden statue, and, for some reason — be it his lovable face or ridiculous talent — every time another name is called on Oscar night or DiCaprio is denied a well-deserved nomination, it sends us all into a spiral of despair. But he isn't the only actor that has been repeatedly snubbed by the Academy. These nine actors have Oscar snubs to rival Leonardo DiCaprio's.\n\nSo far, DiCaprio's record at the Oscars is zero for four. Honestly, it's almost surprising that he only has four nominations to his name, though, to be fair, he does have 11 Golden Globe nods. Still, looking at his resume, it could be argued that he was snubbed by the Academy for literally any and all performances he gave. (Personally, I take issue with his lack of nominations for Catch Me If You Can and The Departed.)\n\nThis makes tallying up DiCaprio's Oscar snubs incredibly difficult — do you count the times he was nominated but didn't win, or the times he deserved a nomination but didn't get one? For the purposes of this list, I went with the amount of Oscar nominations without a win. Keep in mind that, because not all actors are as fortunate as DiCaprio when it comes to Oscar nods.\n\n1. Peter O'Toole\n\nOver the course of his 50-year career, Peter O'Toole was nominated for a staggering eight Oscars. First nominated in 1963 for his work in Lawrence of Arabia, O'Toole received his final Oscar nomination in 2007 for Venus. In between that time, the Academy did honor O'Toole with an Honorary Oscar in 2003, but there's nothing quite like taking a bow on that international stage. The Academy sometimes likes to give out awards for roles that don't necessarily deserve it just to recognize an actor's career (à la Sandra Bullock), but they never did that with O'Toole. Whether or not DiCaprio follows in his footsteps remains to be seen.\n\n2. Amy Adams\n\nAmy Adams has actually been nominated for more Academy Awards than Leonardo DiCaprio — five to be exact. Nominated for Junebug, Doubt, The Fighter, The Master and American Hustle, Adams has been steadily picking up Oscar nominations since 2006. Personally, I would have loved to see her take home the award for American Hustle in 2014 — she carries the film and gives, hands down, the best performance of the A-list cast. Fun fact: she actually co-starred with DiCaprio in 2002's Catch Me If You Can.\n\n3. Annette Bening\n\nLike DiCaprio, Annette Bening has been nominated for four Academy Awards, but never won. Bening was last nominated for The Kids Are All Right in 2011, and was largely considered Natalie Portman's biggest competition. Portman ended up taking the award, making Bening still one of the greatest actors never to have won an Oscar.\n\n4. Johnny Depp\n\nJohnny Depp's career is regarded as somewhat of a hybrid: half impressive, half joke (remember Mortdecai, anyone?), and confounding. Oddly enough, while film buffs love Depp for his performances in Edward Scissorhands and Ed Wood, Depp didn't earn his first Oscar nomination until 2004 for Pirates of the Caribbean. In the years since, Depp has wracked up two more nominations, but still never won. I'll be honest: Johnny Depp is in no way another Leonardo DiCaprio (again, Mortdecai), but if he keeps getting nominated and never winning, he just might become one.\n\n5. Glenn Close\n\nGlenn Close has been nominated for six Oscars — that's two more than DiCaprio and double Depp's number. Close was nominated five times in seven years in the '80s for her star-making roles in The World According to Garp (1982), The Big Chill (1983), The Natural (1984), Fatal Attraction (1988), and Dangerous Liasons (1988). Ugh, just give this woman an Oscar already!\n\n6. Laura Linney\n\nLaura Linney's Oscar snubs don't cause nearly as much noise as DiCaprio's, probably due to the fact that her low profile is a stark contrast to DiCaprio's larger than life, Hollywood star persona. Still, the actress has been nominated for three Oscars since 2001, but never won, putting her on the track to become another DiCaprio.\n\n7. Mark Ruffalo\n\nMark Ruffalo has only been nominated for two Academy Awards, but that hasn't stopped him from making a name for himself as one of the best actors around. Does he have the same record of jaw-dropping, Oscar-baiting performances as DiCaprio? Not unless you somehow think 13 Going On 30 was a movie made for the Oscars. But if the Golden Globes are anything to go by, it looks like Ruffalo is about to be majorly snubbed by the Academy for his performances in Spotlight and Infinitely Polar Bear. Don't worry, Ruffalo, you're in great company.\n\n8. Judy Garland\n\nTechnically, Judy Garland did receive an Oscar in 1940 — the Juvenile Award — but, since that no longer exists, Garland remains an actress repeatedly snubbed by the academy. Only nominated twice in her entire career, Garland wasn't even nominated for her iconic performances in The Wizard of Oz or Meet Me In St. Louis.\n\n9. Jake Gyllenhaal\n\nJake Gyllenhaal has had a pretty fantastic career, with one critically acclaimed performance after another. And yet he has only been nominated for one Academy Award — in 2006 for his role in Brokeback Mountain. Unlike DiCaprio, Gyllenhaal hasn't really been nominated enough times to be snubbed at the actual awards. Instead, Gyllenhaal has been subbed time and time again when it comes to nominations, getting no Academy recognition for his work in Jarhead, Zodiac, Prisoners or Nightcrawler.\n\nDiCaprio is a one-of-a-kind actor with a one-of-a-kind snub story, but there are many actors that I could see being passed over by the Academy like DiCaprio. Jesse Eisenberg, Michael Fassbender, Viola Davis, Michael Shannon, Andrew Garfield, Anna Kendrick, Vera Farmiga, Michael B. Jordan, and Paul Dano are just a few actors who have given more than one Oscar-worthy performance in their careers without recognition from the Academy.\n\nBut for now, DiCaprio should take comfort in the fact that his time is coming. If we've learned anything from Kate Winslet and Julianne Moore's recent Oscar wins, it's that sometimes it just takes multiple nominations before you get the gold. Maybe The Revenant will finally win Leonardo DiCaprio that Oscar, or maybe it won't, but as long as he keeps trying, I'm sure he'll get there. Eventually.\n\nImages: sageinbloom/tumblr; Giphy (10)", "images": ["https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/rehost/2016/9/13/fa03c37a-46eb-400a-beb9-e5f97035de14.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/rehost/2016/9/13/fa03c37a-46eb-400a-beb9-e5f97035de14.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/rehost/2016/9/13/fa03c37a-46eb-400a-beb9-e5f97035de14.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/articles/135360-leonardo-dicaprios-oscar-snubs-compared-to-other-actors-snubs-shows-hes-not-all-that-unsual", "title": "Leonardo DiCaprio's Oscar Snubs Compared To Other Actors' Snubs Shows He's Not All That Unsual", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/articles/135360-leonardo-dicaprios-oscar-snubs-compared-to-other-actors-snubs-shows-hes-not-all-that-unsual", "type": "article", "title": "9 Actors With Oscar Snubs To Rival Leo's", "description": "As Oscar season approaches, all eyes are on Leonardo DiCaprio. Will 2016 be the year he finally gets his Oscar? Unarguably one of the best actors of our time, DiCaprio has been nominated for four Academy Awards and never won. The Wolf of Wall Street…", "image": {"identifier": "https://imgix.bustle.com/rehost/2016/9/13/fa03c37a-46eb-400a-beb9-e5f97035de14.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "As Oscar season approaches, all eyes are on Leonardo DiCaprio. Will 2016 be the year he finally gets his Oscar? Unarguably one of the best actors of our time, DiCaprio has been nominated for four Academy Awards and never won. The Wolf of Wall Street…"}, "movies": [], "publish_date": null, "source": "http://www.bustle.com", "summary": ""}