{"url": "https://www.vanityfair.com/hollywood/2018/07/bachelorette-men-tell-all-garrett-yrigoyen-instagram-lincoln-adim-conviction", "text": "Next week, Bachelorette fans will finally get to watch all of Rebecca “Becca” Kufrin’s exes—a.k.a. the eliminated contestants—gather together in one room. That is, save for one: Lincoln Adim, who was convicted of indecent assault and battery offscreen as the show aired its pretaped season. Adim will not be present, nor will the season’s finalists—including Garrett Yrigoyen, whose social-media history also caused a furor among fans.\n\nThe “Men Tell All” episode, which tapes later than the competition portion of the series, has traditionally been used as a platform on which the show can discuss controversies like these, which took place offscreen while the series aired. (The special was recorded just this week.) But with Adim and Yrigoyen absent from the group, this one will gloss over both controversies—which, together, have been the center of most of the season’s discussion. Both Kufrin and franchise host and producer Chris Harrison, however, want viewers to keep an open mind—at least, regarding Yrigoyen.\n\n“I want to be very careful about people that put Garrett and Lincoln in the same sentence because they do not belong in the same sentence,” Harrison told The Hollywood Reporter after the episode finished filming. “What Garrett did is something that people disagree with. What Lincoln did is illegal. It’s against the law. He committed a crime. He was convicted of that, so that’s very different. . . . That’s not to say that I agree at all with what Garrett did or if he stood for that or what he stood for,” Harrison added, “but I’m very careful to differentiate those.”\n\nFor those who need a refresher, Yrigoyen emerged as a front-runner as soon as this season premiered, nabbing the coveted First Impression Rose—which is frequently awarded to the show’s eventual winner. Just as the season premiered, however, Yrigoyen’s offscreen life proved troublesome: on a subsequently deleted Instagram account, Yrigoyen had “liked” offensive posts that ran the gamut of transphobia and anti-immigrant sentiments—as well as a post supporting the conspiracy theory that teenaged Parkland shooting survivor David Hogg was a crisis actor.\n\nAdim, meanwhile was convicted in May for indecent assault and battery, after an incident that occurred back in 2016. At the time of his conviction, Warner Bros. Television, which produces The Bachelor and all its offshoots, indicated to V.F. through a statement that no one on the show’s production had any knowledge about Adim’s history, adding that it was investigating how the third-party company it employs to run its background checks missed this. Speaking with T.H.R., Harrison had no concrete information to offer regarding how the shows might alter their vetting process to prevent such oversights in the future.\n\nThe distinction between Yrigoyen and Adim is obvious—but the fact remains that, for different reasons, their separate offscreen controversies have become the two black marks at the center of an otherwise boring, formulaic season. Yrigoyen disavowed his “likes” in an apology, posted to a new Instagram account soon after the firestorm began: “My Instagram ‘likes’ were not a true reflection of me and my morals,” he wrote. “I am not the negative labels people are associating me with. For those who do know me, I am a sincere, genuine, loving, light-hearted, open-minded and non-judgemental individual.”\n\nAs far as Harrison is concerned, though, social media, in general, is toxic: “If I could have one wish, I would take Facebook, Twitter, Instagram, Snapchat, all of it, and throw it in the trash,” Harrison told T.H.R. “I think it continues to do more harm than good, especially now. You get a lot of yelling, you get a lot of the lowest 1 percent—the vocal minority, as I call it—and that’s usually who you hear from.” But as we saw last season, social-media activity can have a bearing on how contestants behave on the show. Just look at Lee Garrett—who had his own history of racist social-media posts—and his feud with black contestant Kenny King. (Yrigoyen has not caused any such disruptions during the season so far.)\n\nRegarding how contestants like Yrigoyen can be picked apart on social media, Harrison said, “Here’s the thing—I don’t know if anyone’s ready for that kind of spotlight. I don’t think that anybody in this day and age is ready for the mob mentality and that’s what it’s become. . . . It is a mob mentality of—you’re guilty, your life is ruined, it’s done, you’re gone. That is the scrutiny that everyone is under.”\n\nKufrin, who has urged viewers to be “open-minded” about Yrigoyen since the news about his Instagram “likes” first broke, stuck to that argument when speaking with T.H.R.: “I want people to stay open to who these guys are,” she said. “I was lucky enough to go on this journey with 28 guys and to really get to know them for who they are—away from social media, away from all the distractions—and so that was something special for me that I got to experience and I just hope that the viewers can be that same way.”", "images": ["https://media.vanityfair.com/photos/5b58a53686763009a9857ce3/master/w_2560%2Cc_limit/149913_0150.jpg", "https://www.vanityfair.com/verso/static/hwd/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg", "https://media.vanityfair.com/photos/5b4e2c719bedd20c4002b7a8/1:1/w_350%2Ch_350%2Cc_limit/t-Bachelorette-Dudes.jpg", "https://www.vanityfair.com/verso/static/hwd/assets/logo-header.7b6624f3aa336c67441a33a3e19289ee14eaf5c7.svg", "https://media.vanityfair.com/photos/5b0d58d814785d7498401a02/1:1/w_350%2Ch_350%2Cc_limit/bachelorette-garrett.jpg", "https://media.vanityfair.com/photos/5b58a53686763009a9857ce3/16:9/w_1280,c_limit/149913_0150.jpg", "https://media.vanityfair.com/photos/5b57233211d0902df883bd10/1:1/w_350%2Ch_350%2Cc_limit/bachelorette-final-two-garrett-blake.jpg"], "top_img": "https://media.vanityfair.com/photos/5b58a53686763009a9857ce3/16:9/w_1280,c_limit/149913_0150.jpg", "keywords": [], "authors": ["Laura Bradley", "Laura Bradle"], "canonical_link": "https://www.vanityfair.com/hollywood/2018/07/bachelorette-men-tell-all-garrett-yrigoyen-instagram-lincoln-adim-conviction", "title": "The Bachelorette’s “Men Tell All” Episode Will Ignore This Season’s Biggest Problems", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Laura Bradley", "copyright": "Copyright (c) Condé Nast 2020", "description": "All of Becca Kufrin’s jilted contestants will be back, save for Lincoln Adim, who was convicted of indecent assault and battery—a detail that won’t be addressed during next week’s episode. Neither will finalist Garrett Yrigoyen’s troubling social-media history.", "id": "5b5898975bec073e61277eb8", "keywords": "hollywood,television", "news_keywords": "hollywood,television", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5b5898975bec073e61277eb8", "parsely-metadata": "{\"description\":\"All of Becca Kufrin’s jilted contestants will be back, save for Lincoln Adim, who was convicted of indecent assault and battery—a detail that won’t be addressed during next week’s episode. Neither will finalist Garrett Yrigoyen’s troubling social-media history.\",\"image-16-9\":\"https://media.vanityfair.com/photos/5b58a53686763009a9857ce3/16:9/w_1000,c_limit/149913_0150.jpg\",\"image-1-1\":\"https://media.vanityfair.com/photos/5b58a53686763009a9857ce3/1:1/w_1000,c_limit/149913_0150.jpg\"}", "og": {"description": "All of Becca Kufrin’s jilted contestants will be back, save for Lincoln Adim, who was convicted of indecent assault and battery—a detail that won’t be addressed during next week’s episode. Neither will finalist Garrett Yrigoyen’s troubling social-media history.", "image": "https://media.vanityfair.com/photos/5b58a53686763009a9857ce3/16:9/w_1280,c_limit/149913_0150.jpg", "site_name": "Vanity Fair", "title": "The Bachelorette’s “Men Tell All” Episode Will Ignore This Season’s Biggest Problems", "type": "article", "url": "https://www.vanityfair.com/hollywood/2018/07/bachelorette-men-tell-all-garrett-yrigoyen-instagram-lincoln-adim-conviction"}, "article": {"content_tier": "metered", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@VanityFair", "description": "All of Becca Kufrin’s jilted contestants will be back, save for Lincoln Adim, who was convicted of indecent assault and battery—a detail that won’t be addressed during next week’s episode. Neither will finalist Garrett Yrigoyen’s troubling social-media history.", "domain": "https://www.vanityfair.com", "image": {"src": "https://media.vanityfair.com/photos/5b58a53686763009a9857ce3/16:9/w_1280,c_limit/149913_0150.jpg?mbid=social_retweet"}, "site": "@VanityFair", "title": "The Bachelorette’s “Men Tell All” Episode Will Ignore This Season’s Biggest Problems"}, "fb": {"app_id": 305927716147259, "pages": 8810407571}, "google-signin-client_id": "1065629119444-svrqo31taikd2j0ji4dgjs9q3vul4133.apps.googleusercontent.com"}, "movies": [], "publish_date": null, "source": "https://www.vanityfair.com", "summary": ""}