{"url": "https://web.archive.org/web/20130314224614/http://www.washingtonpost.com/blogs/wonkblog/wp/2013/03/08/everything-you-need-to-know-about-the-drone-debate-in-one-faq/", "text": "This is well outside Wonkblog’s normal bailiwick, but if nothing else, Sen. Rand Paul’s (R-Ky.) filibuster against CIA director nominee John Brennan — launched as a protest against the administration’s drone policy, which Brennan has steered for the past four years — uncovered a hunger for a broader conversation on the topic. So what does the drone program actually entail, and why are Paul and others criticizing it?\n\nWhat is a drone?\n\nTechnically called “unmanned aerial vehicles” (UAVs), drones are just aircraft without human pilots onboard, encompassing everything from reconnaissance vehicles to unmanned crop dusters. In common parlance, though, “drone” has come to refer to unmanned combat aerial vehicles (UCAVs), which are UAVs equipped with combat capabilities, most commonly the ability to launch missiles.\n\nHow long has the U.S. government been using them?\n\nThe General Atomics MQ-1 Predator, the most famous UCAV in the U.S. arsenal, first saw combat in 1995 as part of the NATO intervention in Bosnia, but at that time was solely a reconnaissance tool and carried no payload. On Feb. 16, 2001, the Predator #3034 became the first to be successfully fitted with a Hellfire missile, and to fire it in a trial flight. Predators were deployed to Afghanistan almost immediately after the Sept. 11, 2001 terrorist attacks, and on Oct. 7, 2001 they conducted their first armed mission there.\n\nIn addition to the Predator, the General Atomics MQ-9 Reaper, a larger UCAV capable of carrying a higher payload, has seen service starting in 2007. The current program is jointly administered by the CIA and the Joint Special Operation Command (JSOC).\n\nWhere do we send them?\n\nPrimarily Pakistan, Yemen and Somalia. According to a Washington Post database, compiled with the help of the New America Foundation and Long War Journal, strikes in Pakistan have been occurring since 2004 and picked up in pace starting in summer 2008. Apart from a November 2002 strike in Yemen, the Somalia and Yemen campaigns began in 2011. There have been reports of strikes in the Philippines, though information there is sketchy.\n\nAdditionally, drones have seen service in Libya, Afghanistan and Iraq as part of the Unites States’s more traditional military campaigns in those countries.\n\nHow powerful is a drone attack?\n\nPredator drones can carry up to two Hellfire missiles. Those have warheads of about 20 pounds, which are designed to pierce tank armor; their damage outside of the vehicle targeted is limited. An alternative warhead, which manufacturer Lockheed Martin touts as featuring “high lethality and minimum collateral damage,” also is in service.\n\nReapers are another story. They feature a maximum payload of 3,000 pounds, or 1.5 tons. That means they can carry a combination of Hellfires and larger 500 pound bombs like the GBU-12 Paveway II and GBD-38 JDAM. Those have an “effective casualty radius” of about 200 feet. That means that about 50 percent of people within 200 feet of the blast site will die. Those odds improve — or worsen, depending on how you look at it — the closer you get, obviously.\n\nSo imagine if you took a football field and shrunk it by a third. A Reaper attacks one endzone with a GBU-12. If you’re on the field, you have a 50 percent chance of dying. Update: I apparently forgot the distinction between yards and feet since middle school. Corrected.\n\nHow many drone attacks have we launched to date?\n\nAccording to the Post database, there have been 347 in Pakistan, 53 in Yemen and 2 in Somalia. From 2008 through October 2012, there were 1,015 strikes in Afghanistan, 48 in Iraq, and at least 105 in Libya according to the Bureau for Investigative Journalism. That does not include strikes in Libya past September 2011, strikes from 2001 to 2007 in Iraq and Afghanistan, and those since October 2012. The New York Times’ Mark Mazzetti reported that at least one strike has happened in the Philippines.\n\nWhat sort of people have we targeted?\n\nPrimarily al-Qaeda and its affiliates. That includes al-Shaabab in Somalia, al-Qaeda in the Arabian Peninsula (which works in Yemen), and the Haqqani Network in Afghanistan and Pakistan. The Philippines strike was intended to kill Umar Patek, a leader of the Indonesian terrorist group Jemaah Islamiyah who helped orchestrate the 2002 attacks in Bali that killed 95 people. Patek is now serving a 20-year sentence in Indonesia.\n\nHave we killed U.S. citizens this way?\n\nWe’ve killed four, at least. Anwar al-Awlaki, an American-born al-Qaeda operative in Yemen, was killed in a drone strike in 2011, as was his American-born 17-year-old son (in a subsequent strike) and Samir Khan, a North Carolina native who died in the same strike as the elder al-Alaki. Ahmed Hijazi, also an American citizen based in Yemen, was killed in 2002. Note: paragraph updated to correct spelling of al-Awlaki’s name and include Hijazi.\n\nTo clarify the Obama administration’s exact policy on killing Americans without a trial, Eric Holder wrote the following letter to Sen. Rand Paul: “Dear Senator Paul: It has come to my attention that you have now asked an additional question: ‘Does the President have the authority to use a weaponized drone to kill an American not engaged in combat on American soil?’ The answer to that question is no.” The dispatch followed an earlier, more equivocal note from Holder on the subject, which seemed to indicate Holder believes the president has the authority to kill U.S. citizens on U.S. soil if he judges them a threat.\n\nHow many people have died in drone attacks?\n\nSen. Lindsey Graham estimated the death toll of the Pakistan/Somalia/Yemen program at 4,700. That’s higher than most estimates; Micah Zenko of the Council on Foreign Relations puts the number at closer to 3,500.\n\nHow many of those were civilians?\n\nCora Currier at ProPublica helpfully compiled a number of estimates in January. New America puts the civilian death total in Pakistan and Yemen between 276 and 368, of which 118-135 were under the Bush administration. The Bureau of Investigative Journalism puts the number between 446 and 978, increasing to 993 if you include Somalia. Of those, 179 to 209 were children, BIJ estimates. A Stanford/NYU study suggests that the strikes have inflicted considerable psychological trauma on residents of Pakistan, and deterred relief workers from serving areas targeted. Funerals and rescue workers have been targeted in past strikes.\n\nWhat’s the process for deciding when and where to launch them?\n\nAs my colleague Greg Miller has reported, the administration uses something called the “disposition matrix” to determine targets for drone strikes. Miller describes it as a “single, continually evolving database in which biographies, locations, known associates and affiliated organizations are all cataloged. So are strategies for taking targets down, including extradition requests, capture operations and drone patrols…The database is meant to map out contingencies, creating an operational menu that spells out each agency’s role in case a suspect surfaces in an unexpected spot.”\n\nThe National Counterterrorism Center (NCTC) will prepare lists of potential targets, which will be reviewed every three months by a panel of intelligence analysts and military officials. They are then passed along to a panel at the National Security Council, currently helmed by CIA director nominee Brennan, and then to Obama for final approval. The criteria for addition to the list are determined personally by Obama, who also must personally approve all strikes outside Pakistan. Pakistan strikes are approved by the CIA director.\n\nWhat’s the case for using drones?\n\nThere’s some political science to suggest that “decapitation strikes,” like these drone attacks, are actually quite effective at reducing the ability of terrorist groups to operate effectively. The RAND Corporation’s Patrick Johnston and UCLA’s Anoop Sarbahi have found preliminary evidence that the drone program specifically is effective at degrading the operations of targeted groups. Zack Beauchamp has a good overview of this literature here.\n\nBut that’s a case for strikes, not for drone strikes specifically. There is, however, substantial evidence that the percentage of casualties borne by civilians is much lower with drone strikes than with just about any other kind of military intervention, even if one accepts high estimates of the percent of killed who are civilians.\n\nIs Congress kept in the loop?\n\nTo some degree. As part of Brennan’s confirmation process, Senate Intelligence Committee members were granted access to Justice Department memos justifying the use of drones, and a similar white paper was shared last year. The Committee and its House counterpart are also allowed to review individual strikes, including the intelligence behind them and video obtained during their commission. But they have not tried to limit the program in any way. ”I don’t know that we’ve ever seen anything that we thought was inappropriate,” one Congressional aide told the Los Angeles Times.\n\nHow about the courts?\n\nNope. Sen. Angus King (I-Maine) has proposed establishing a specialized court to approve drone strikes based on FISA courts that approve surveillance of suspected foreign intelligence in the U.S., but that is, for now, just an idea. Neal Katyal, a former acting solicitor general under Obama, has called for an oversight board placed within the executive branch.\n\nIs this legal?\n\nThe Justice Department certainly thinks so, though the reasons why are classified, and lawsuits to expose them have proven unsuccessful. The clearest window we’ve gotten into their reasoning as relates to the killing of U.S. citizenscomes from a white paper leaked to NBC News last month. It derives the authority for the strikes from the Authorization for the Use of Military Force (AUMF) passed in the wake of 9/11, which grants the government broad powers against al-Qaeda. What’s more, the white paper argues that drone strikes somehow don’t run afoul of Executive Order 12333, the ban on assassinations as a tool of policy that has existed since the Ford administration, as they are used for “self-defense.” See also Brennan’s speech here defending the program more broadly.\n\nAdministration critics aren’t impressed, with the ACLU’s Jameel Jaffeer noting the white paper, “argues that the government has the right to carry out the extrajudicial killing of an American citizen.”\n\nDoes it violate international law?\n\nThe Justice Department memo cites the UN Charter, which allows states to make war in the interest of self-defense, an interest also invoked by Brennan. Critics, like UN special rapporteur on extrajudicial killings, summary or arbitrary executions Christof Heyns, say that this defense is a stretch, and the killings plainly run afoul of the laws of war and international human rights treaties.\n\nAre other countries using drones this way?\n\nOnly the United States and the United Kingdom (which assists in the Pakistan drone effort) currently use drones in combat, but many other countries have acquired drone technology, including China, Russia, India, Iran and Israel. The U.K. uses Reapers and Predators while most other countries use the Israeli Aerospace Industries Heron or similar Israeli models. Drones saw combat use in Israel during the Gaza war of late 2008. Even Hezbollah has acquired reconnaissance drones. All told, the GAO estimates that 76 countries, at least, have drone technology.\n\nWhat do our allies think about it?\n\nEuropean allies other than Britain generally refrain from using drones to attack al-Qaeda, but frequently share intelligence that assists the drone program in selecting targets.\n\nWhat about the countries where we send drones? What do they think?\n\nThey’re very mad. The Pakistani government has condemned the drone strikes as a violation of sovereignty, though there’s evidence they’re tacitly allowing the strikes to happen. The Yemeni government quietly agreed to the strikes, though murmurs of opposition have emerged of late. Citizens in both countries deplore the campaigns.\n\nIs it actually weakening al-Qaeda?\n\nNew America estimates that 1,967 – 3,236 militants were killed in Pakistan and Yemen, meaning the overwhelming majority of casualties were intended targets. That said, the share of deaths who were “high-profile targets” was 11 percent under Obama and 33 percent under Bush according to New America. And there are deeper doubts as to whether the strategy is recruiting more militants than it kills, by turning local populations against the United States. The attempted Times Square bomber, for instance, cited drones as a motivating force.\n\nIt could also be a bad idea even if it is weakening al-Qaeda. Many have noted that the money spent on anti-terrorism efforts might save more lives if devoted to tackling more mundane threats, like auto accidents.\n\nThanks to Zack Beauchamp for research help throughout.", "images": ["https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/blogs/wonkblog/wp-content/themes/wapo-blogs/inc/imrs.php?src=http://www.washingtonpost.com/blogs/wonkblog/files/2013/03/BrettonWoodsBook.jpg&h=100&w=145", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/blogs/wonkblog/wp-content/themes/wapo-blogs/inc/imrs.php?src=http://www.washingtonpost.com/blogs/wonkblog/files/2012/08/immigration-ICE-arrest.jpg&w=140", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/blogs/wonkblog/files/2013/03/katyal-e1362688683966.jpg", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/blogs/wonkblog/wp-content/themes/wapo-blogs/inc/imrs.php?src=http://www.washingtonpost.com/blogs/wonkblog/files/2013/03/matthews_plumer_031413.jpg&h=100&w=145", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/rf/image_606w/2010-2019/WashingtonPost/2012/10/18/National-Security/Images/brennan1.jpg", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/rf/image_606w/2010-2019/WashingtonPost/2013/01/03/Foreign/Images/2013-01-03T101124Z_01_SIN22_RTRIDSP_3_PAKISTAN-DRONE.jpg", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/rf/image_606w/2010-2019/WashingtonPost/2012/11/07/National-Politics/Images/Election_Feinstein_07ba7.jpg", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/blogs/wonkblog/wp-content/themes/wapo-blogs/inc/imrs.php?src=http://www.washingtonpost.com/blogs/wonkblog/files/2013/03/Screen-shot-2013-03-14-at-1.47.33-PM.jpg&h=100&w=145", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/blogs/wonkblog/wp-content/themes/wapo-blogs/inc/imrs.php?src=http://www.washingtonpost.com/blogs/wonkblog/files/2013/03/DXY.jpg&h=100&w=145", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/blogs/wonkblog/wp-content/themes/wapo-blogs/inc/imrs.php?src=http://www.washingtonpost.com/blogs/wonkblog/files/2013/03/catholic-church.png&w=140", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/blogs/wonkblog/files/2013/03/tenet-e1362687526488.jpg", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/rf/image_606w/2010-2019/WashingtonPost/2012/10/22/National-Security/Images/RTR37IHN.jpg", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/blogs/wonkblog/wp-content/themes/wapo-blogs/inc/imrs.php?src=http://www.washingtonpost.com/blogs/ezra-klein/files/2012/08/2179930076_0ba44b5826_z-1.jpg&h=100&w=145", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/rw/sites/twpweb/img/blogs/spacer.gif", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/rf/image_606w/2010-2019/WashingtonPost/2012/11/30/National-Politics/Images/2012-11-27T162741Z_01_WAS405_RTRIDSP_3_USA-BENGHAZI-RICE-SENATORS.jpg?uuid=Yh9inDspEeKiY_Dr_-0vFQ", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/blogs/wonkblog/files/2013/03/iai_heron.jpg", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/blogs/wonkblog/wp-content/themes/wapo-blogs/inc/imrs.php?src=http://www.washingtonpost.com/blogs/wonkblog/files/2013/03/application1.png&h=100&w=145", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/blogs/wonkblog/files/2013/03/heyns.jpg", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/blogs/wonkblog/files/2013/03/Screen-Shot-2013-03-07-at-3.24.32-PM-e1362687907751.png", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/rf/image_606w/2010-2019/WashingtonPost/2011/10/01/Foreign/Images/WEB-ONLY---AnwarAlAwlaki001crp_1317412621.jpg", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/blogs/wonkblog/wp-content/themes/wapo-blogs/inc/imrs.php?src=http://www.washingtonpost.com/blogs/ezra-klein/files/2012/06/Regulate41_1320976801.jpg&w=140", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/blogs/wonkblog/wp-content/themes/wapo-blogs/inc/imrs.php?src=http://www.washingtonpost.com/rf/image_606w/2010-2019/WashingtonPost/2013/01/30/CapitalBusiness/Images/_MG_55801359586026.JPG&w=140", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/rf/image_606w/2010-2019/WashingtonPost/2011/05/09/National-Security/Advance/Images/AL-ZAWAHIRI-08.jpg", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/rf/image_404h/2010-2019/WashingtonPost/2011/12/13/National-Security/Images/117097699.jpg", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/rf/image_606w/2010-2019/WashingtonPost/2013/01/11/National-Security/Images/516311930.jpg", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/rf/image_606w/2010-2019/WashingtonPost/2011/12/20/Foreign/Images/AP100908043027.jpg", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/rf/image_606w/2010-2019/WashingtonPost/2012/05/29/Foreign/Images/2012-05-29T162257Z_01_KHA04_RTRIDSP_3_YEMEN.jpg", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/blogs/wonkblog/files/2013/03/Harold-Koh-hearing.jpg", "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/rf/image_404h/2010-2019/Wires/Online/2013-02-22/AP/Images/Belgium%20NATO%20Defense%20Ministers.JPEG-0cf31.jpg"], "top_img": "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/rf/image_606w/2010-2019/WashingtonPost/2011/12/20/Foreign/Images/AP100908043027.jpg", "keywords": [], "authors": ["Dylan Matthews", "Ezra Klein", "Neil Irwin", "Kunio Francis Tanabe"], "canonical_link": "https://web.archive.org/web/20130314224614/http://www.washingtonpost.com/blogs/wonkblog/wp/2013/03/08/everything-you-need-to-know-about-the-drone-debate-in-one-faq/", "title": "Everything you need to know about the drone debate, in one FAQ", "meta_data": {"keywords": "wonkaround,rand,paul,drone,program,john,brennan,civil,liberties,", "viewport": "width=device-width", "generator": "WordPress 3.5.1", "og": {"url": "https://web.archive.org/web/20130314224614/http://www.washingtonpost.com/blogs/wonkblog/wp/2013/03/08/everything-you-need-to-know-about-the-drone-debate-in-one-faq/", "title": "Everything you need to know about the drone debate, in one FAQ", "description": "The joint military/CIA drone program has suddenly become the most discussed issue in the Senate. Here's what it is.", "image": "https://web.archive.org/web/20130314224614im_/http://www.washingtonpost.com/rf/image_606w/2010-2019/WashingtonPost/2011/12/20/Foreign/Images/AP100908043027.jpg"}}, "movies": [], "publish_date": 1362672000.0, "source": "https://web.archive.org", "summary": ""}