{"url": "https://ew.com/tv/2018/02/07/law-order-svu-raul-esparza-exit/", "text": "Law & Order: SVU type TV Show network NBC genre Crime\n\nWarning: This story contains major spoilers from Wednesday’s episode of Law & Order: Special Victims Unit. Read at your own risk.\n\nAnother long-time cast member has exited Law & Order: Special Victims Unit. Raúl Esparza has left the long-running NBC procedural after six seasons, EW has learned exclusively.\n\nThe actor joined SVU as Assistant District Attorney Rafael Barba in season 14 in a recurring capacity, before being upped to series regular in season 15.\n\nDuring Wednesday’s episode, Barba ultimately left the District Attorney’s office after pulling the plug on a brain dead child. Esparza has effectively exited as a series regular, but the door is open for him to return. In his stead, Chicago Justice character Peter Stone (Philip Winchester) has become the new ADA, with Winchester being added to the show as a regular who will likely continue with the show next season should it be renewed.\n\n“It has truly been an honor writing for Raúl,” SVU showrunner Michael Chernuchin says. “The power, sensitivity, and morality he brought to the character of Rafael Barba never failed to elevate our scripts. Raúl is family and we look forward to seeing his talent shine in new projects. As for Barba, SVU fans may see him again soon.”\n\nThough SVU has been on for 19 seasons, the show hasn’t seen too much turnover in recent years. After Christopher Meloni exited in season 12, fellow originals Richard Belzer and Dann Florek both left in season 15. Danny Pino, who joined the show in season 13, was the show’s last big exit back in season 16.\n\nFollowing his departure, Esparza is temporarily returning to his Broadway roots for a Chess revival at the Kennedy Center. What’s next for him after that? And why did he decide to leave SVU now? Read our full interview to get the scoop:\n\nENTERTAINMENT WEEKLY: Was it your decision to leave the series?\n\nRAUL ESPARZA: Yes.\n\nWhy did you decide to leave now?\n\nI’ve done six seasons, I felt like it was time to go. I had explored a lot of what I thought Barba was about. I just felt it was time to move on. I was also feeling like the role has changed over the years in a way that has been an interesting experience for me. Again, I’m a theater guy, so it’s like having a script in front of you that keeps changing every time you go to do it. The learning process of how roles grow over a period of time with a series has been kind of fascinating, and I just felt I had reached the end of what I wanted to explore where they were writing.\n\nYou were also close with former SVU showrunner Warren Leight, who exited a few seasons back. Was that a factor in your decision to leave?\n\nYeah, I think that’s pretty much understood. [Laughs]\n\nWere you surprised by the way in which Barba exited the series?\n\nYeah, it wasn’t really a way that I figured that he would go out. But I do have to say that when we worked on the script, it was pretty extraordinary. I don’t watch myself, so I haven’t seen the episode, but putting it together was a really great experience. It’s one of those things that you just learn as you go, what a script really is, and it was a surprising one. I think that [current showrunner] Michael Chernuchin has done some really beautiful writing for Barba this season, in a way that’s like a really beautiful gift that got handed to me. Because I had decided to leave at the beginning of the season, before he came in, and then they hand me this beautiful gift with some really gorgeous writing from a new showrunner, who has really taken care of me this year. And this particular script was something very dear to him. As we began to do it I started to find that it was challenging, and emotional, and surprising, and not at all what I expected from having just read it on the page.\n\nWere there alternate ways in which Barba could leave, like him dying?\n\nI’ll say that the one thing we talked about is he absolutely doesn’t need to die, because it’s not like I’m leaving on bad terms. I think that Barba’s become a part of the SVU family, and I think there’s a life for him — I don’t know necessarily, but it’s possible that there’s a life for him as the series goes on. I’m glad they left that door open.\n\nWould you be interested in returning to SVU in the future?\n\nAbsolutely, because I’m really rooting for the opportunity to make television history with the series. I’d be lying if I didn’t say that’s part of what we all hope for, that NBC manages in the end to get a record-breaking series on its hands with potential 21 years. Also, this doesn’t always happen when you work with people, but I became friends with Mariska [Hargitay] and she’s part of my life now. I don’t just miss the role, I miss her, so any opportunity to get back into a room with her is valuable to me. Part of the reason I became Barba, and that it turned into the show that it did for me, was the way I hit it off with her and that was surprising. What was supposed to be a guest starring spot that Warren had written for me morphed into something very rich and surprising, and I really am not blowing smoke when I say it’s entirely because of the space that was created between me and Mariska. It’s chemistry — it happens or doesn’t, and it happened.\n\nIt almost seemed like there was a potential for romance between Barba and Benson. Did you ever think the show would go that route?\n\nNo, I didn’t, honestly, because they are both workaholics. I was never really interested in exploring his private life as much in terms of feeling like he’s a man who has given up on relationships in order to succeed. His ambition has driven him. Maybe that’s making an excuse for what they do or don’t write on shows like Law & Order, but Benson’s life is a much more complicated situation. I always thought it would remove a layer of excitement and friction and sexiness between us if we ever went in that direction. I really thought that would just state the obvious instead of letting it just simmer, which one of the rules of good television is keep them wanting — never have successful relationships and keep them wanting the one that you really wish would happen.\n\nIs there anything you wish you got to do with Barba that you didn’t get a chance to?\n\nHonestly, no. If the show had been a different kind of show, it’d be fun to spin into the political world of what the DAs office is all about, but that’s not really what Law & Order: SVU is about. When they do the Barba spin-off, maybe we can go in that direction, right? [Laughs] I think New York politics in the mayor’s office and with the district attorney’s office is fascinating, but that would be a different world. That’s the only thing we glanced at, but never really got into it. Other than that, I feel like Barba turned out to be both a showman and someone who slowly reined in his ambition to become a truly top-notch prosecutor. His intelligence was ferocious, his turn-of-phrase, and the ways that Benson changed him were apparent to me season by season, and the ways that he changed her were also really alive for me. So that’s pretty rich stuff to get to play with.\n\nImage zoom Michael Parmelee/NBC\n\nWhat was it like having Sam Waterston and Philip Winchester come in for your final episode?\n\nIt was ridiculous. First of all, Philip is one of the coolest, nicest guys I’ve gotten the opportunity to work with and welcoming him to SVU-land was pretty wonderful. For years, long before I had anything to do with Law & Order, Sam Waterston’s performance as Jack McCoy is one of the great TV performances. I feel like it was a benchmark for me of excellence in what you could do in a procedural with material that didn’t reveal a great deal about a character except for what they did, and he revealed an entire life and an entire person for so many years. I think Sam’s a truly great actor, so he paid me an enormous compliment by coming in to see Barba off. It was a little bit of a passing of a baton, but also an opportunity for me to have what felt like a total career highlight. And I’m not making that up, it was thrilling that time I got to spend with him — for the admiration, for the role, and for him in it and just to have his presence there. Even though we are on the series, you still get a little bit starstruck when some of the main people from the first show, show up. You just do. It’s a little like, “Oh yeah, wow, because I’ve been watching you since I was whatever age.”\n\nAs you’re in the middle of rehearsals for Chess right now, was getting back into the world of Broadway a priority for you?\n\nI mean, I miss it. There’s this amazing concert, we’re doing the musical Chess, which has not had a Broadway revival in 30 years, and so we’re looking at it and have been working on it. It’s just really a ferociously cool cast and we started reading it last summer, and we are going to do it at the Kennedy Center concert next week. So that’s what I’m doing and beyond that, I have no sense of what the Broadway world holds. It’s part of my career and of course I miss it, because I miss the relationship to the audience. I love being on stage, but I would be lying if I didn’t say that doing SVU and then doing Hannibal at the same time, and doing the kind of work that I’ve been doing for the last few years, hasn’t been a total amazing head rush. There is something to be missed of a live performance, but this is a whole new world that I am really thrilled to be a part of, and I don’t plan on leaving it. This season, I’m playing a professor on The Path for Hulu, and that was a fantastic arc to be part of and work with Michelle Monaghan, Aaron [Paul], and Hugh [Dancy], who I worked with on Hannibal. To go back and forth between that and SVU this year was thrilling, and also seeing the ways that television is being made, the differences between the ways that shows are made, and learning in every cast that I’m part of how the whole experience comes together. I still feel like a newbie at this.\n\nI look back at some of my episodes when I first started: I’m not bad, I’m good, that’s great. But then I see stuff now and I’m like, holy sh—, I’ve learned so much about how to do this thing. The relationship with the camera, the camera can read your mind. There’s no audience in any theater that can do what a camera can do. Let’s not kid ourselves, on Broadway — well, maybe not right now, I mean with the way that social media has changed some of the things that happen on stage — but for the most part, you’re famous in a 10-block radius. What a television series does is put you in people’s homes all over the world. It just completely transforms how far your acting can go and who it reaches. I am most grateful for the opportunity of rounding out my career. It was a big theater career, and now I’ve been able to do these other projects. I mean, just last season — I was thinking about it before we started this interview — Bojack Horseman, Ferdinand, which I can’t believe they got nominated for an Oscar for that, and then the work on The Path and the work on SVU, and now working on a Broadway musical, it’s pretty thrilling.\n\nAny dream shows you would want to appear on?\n\nRight now, I’m kind of obsessing over The Crown. And who doesn’t want to be on Game of Thrones, honestly? But for years, my go-to was, “I just want to be a zombie on The Walking Dead.” [Laughs] Oh yeah, especially as soon as Danai [Gurira] joined, because Danai and I were in a film for Wes Craven many years ago, and as soon as she was on it, I was like, “Oh come on, I just wanna be there, just be like King Zombie, just one episode.” It’s hard to watch television when you’re making television. I’ve been catching up on some shows, and right now I’m currently obsessing about The Crown. I think it’s some of the best acting I’ve seen on TV. I’m like, “Huh, I wonder if there’s a role I can play there?”\n\nLaw & Order: Special Victims Unit airs Wednesdays at 9 p.m. ET on NBC.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F13%2Fbetter-call-saul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2Frhbh-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F09%2Flennykravitz.jpg%3Fw%3D768", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F115093_46282_b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F09%2FHomeland_810_4979_R.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F115093_48676b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F11%2Frolestout.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F17%2FNUP_189932_0195.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2FListen-to-Your-Heart.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F10%2Fcelebrity-binge.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F116494_0767b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-voice-rec.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Frhony.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2064'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2Fdee-rogan-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F12%2Fsnl.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F03%2Fgreys-anatomy-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F02%2Fnup_181250_1153-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Fevan-rachel-wood-aaron-paul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-challenge-b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Foutlander-sea5.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F116400_1225b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F02%2Fnup_181250_3247-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2FRVD417d_0162b.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F02%2Fnup_181250_3247-2000.jpg", "keywords": [], "authors": ["Natalie Abrams", "Seija Rankin", "Jodi Walker", "Maureen Lee Lenker", "Andy Hoglund", "Dalton Ross", "Chancellor Agard", "Samantha Highfill", "Sydney Bucksbaum", "James Hibberd"], "canonical_link": "https://ew.com/tv/2018/02/07/law-order-svu-raul-esparza-exit/", "title": "Raúl Esparza exits Law & Order: SVU after six seasons", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Raul Esparza", "news_keywords": "Raul Esparza", "description": "The actor reveals why he decided to leave the long-running NBC procedural", "og": {"title": "Raúl Esparza exits 'Law & Order: SVU' after six seasons", "type": "article", "site_name": "EW.com", "url": "https://ew.com/tv/2018/02/07/law-order-svu-raul-esparza-exit/", "description": "Warning: This story contains major spoilers from Wednesday’s episode of Law &amp; Order: Special Victims Unit. Read at your own risk. Another long-time cast member&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F02%2Fnup_181250_3247-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://ew.com/tv/2018/02/07/law-order-svu-raul-esparza-exit/", "description": "The actor reveals why he decided to leave the long-running NBC procedural", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F02%2Fnup_181250_3247-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/tv/2018/02/07/law-order-svu-raul-esparza-exit/", "title": "Raúl Esparza exits 'Law & Order: SVU' after six seasons", "description": "The actor reveals why he decided to leave the long-running NBC procedural", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F02%2Fnup_181250_3247-2000.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}}, "movies": [], "publish_date": 1517932800.0, "source": "https://ew.com", "summary": ""}