{"url": "radaronline.com/videos/thomas-markle-regrets-interview-meghan-harry-wedding/", "text": "Emotional Thomas Markle Says Meghan Is A ‘Prize’ For Harry, Talks Regrets In First Interview 'I really wanted to walk my daughter down the aisle. I wanted that moment.'\n\nOne month after Meghan Markle and Prince Harry’s royal wedding, the Duchess’ beloved father, Thomas Markle, is finally speaking out.\n\nIn a tell-all interview with Good Morning Britain, the Mexico resident opened up about his relationship with Prince Harry, his staged photo scandal, his heart condition and his biggest regrets after missing his daughter’s special day.\n\nTo start off the talk, Pierce Morgan asked Thomas, 73, how he felt when Meghan, 36, told him she was dating Harry, 33.\n\n“Well of course it’s ‘wow’, it comes out as a ‘wow’ but you know this is my daughter. My daughter’s certainly, certainly a prize for him as well,” said Thomas.\n\n“Yeah he’s great, he’s an interesting guy, he’s a prince, but my daughter’s been a princess since the day she was born,” he sweetly added.\n\nMeghan’s dad then admitted that he’s yet to meet Harry in person, but the two have shared various stimulating phone conversations over the past year.\n\n“It’s always been over the phone,” he explained. “We have yet to see each other face to face. We’ve had interesting conversations on the phone. He’s a smart guy.”\n\n“We talked a few times about Donald Trump and Brexit, things like that, and he’s an interesting guy,” Thomas continued. “I was complaining I didn’t like Donald Trump, he said ‘give Donald Trump a chance.’ I sort of disagreed with that, but I still like Harry. That was his politics, I have my politics.” Thomas also touched on Harry’s views about Brexit, saying the Prince seemed “open to the experiment.”\n\nWhen asked about his first phone conversation with Harry, Thomas claimed it was all very casual and friendly.\n\n“He said ‘Hello Thomas’ and I said ‘Hi Harry’ and it became a conversation back and forth mostly about politics. He was asking me how I was feeling that day and I was telling him how unhappy I was with the President,” Thomas explained.\n\n“We talked a little bit about how they met and how happy they were with each other, and that was pretty much it for the first conversation.”\n\nThe GMB host then asked Thomas at what point he knew Meghan would end up marrying the British monarch, and did he believe it was the right choice to wed the royal after her failed first marriage?\n\n“My daughter’s very intelligent. She knows how to choose who she wants to be with. She’s a smart girl, and she made a good pick, didn’t she?” joked Thomas.\n\nHe then confirmed that Harry did in fact ask for his daughter’s hand in marriage during one of their phone conversations.\n\n“Meghan told me first, then a few times after that Harry got on the phone with Meghan, they called me together. Harry asked for her hand over the phone. I said, ‘you’re a gentleman, promise me you’ll never raise your hand against my daughter, and of course I give you my permission.’”\n\nThomas later explained that he “had no idea” how much Meghan’s new royal status would impact him and his entire family, but admitted that he will eventually get used to it.\n\n“Having the press at my door and everywhere I go, yeah that kind of became an invasion a little bit,” he said, adding that although his other family members are “somewhat disturbed,” he feels that the attention is a “compliment.”\n\n“My daughter is now seen all over the world as a Duchess, and I’m very proud of her, and I’ll adjust to this. I’ll get over this,” stated Thomas.\n\nSpeaking to Piers Morgan about Meghan’s new royal rules and guidelines, Thomas claimed he didn’t know how much she’d have to change her lifestyle to fit into Harry’s—and neither did the former actress!\n\n“At the time I didn’t realize that. I’m not sure she even realized that. I’m sure it’s very complicated. They royals… they’re very complicated and it’s a whole different lifestyle. But I think she could always rise to that occasion. My daughter’s capable of everything, and she’ll certainly be a compliment to the royal family.”\n\nAt one point during the interview, Thomas came clean about his staged photo scandal, saying that it was a “serious mistake” but he did it because he wanted to change his image.\n\nThomas said all the other photos that were being taken of him were “derogatory” so he “thought this was a nice way of improving my look. Obviously all that went to hell. I feel bad about it, I apologized for it, and that’s all I can do. I can’t do much beyond that—but that was a mistake.”\n\n“Both Harry and Meghan were very forgiving about it,” Thomas explained, adding that they “absolutely” still wanted him at their wedding and he was “very excited” to join them.\n\n“Meghan said ‘everything is ready for you,’ Harry said ‘I’ve got one of my military friends to take care of you when you’re here.’ It was all set up, it was fine.”\n\nExplaining why he didn’t end up going to the royal wedding after all, Thomas said: “The truth is that I couldn’t get over the fact that that had happened. All that stuff was working on me, I’ve got a bit of a heart condition. This pushed me a little further to the point where I had heart palpitations. I had to drive at two in the morning to Rosarito to a hospital, and they sent me to another little hospital, and then they sent me to a bigger hospital, Rosarito General Hospital and… a heart attack.”\n\nHe said that the hospital stabilized him and after a day and a half he told the nurses he felt much better and wanted to check out because he didn’t want to miss the wedding. “I thought I was better, I thought I felt really good,” Thomas recalled. Unfortunately, his condition worsened and he had to undergo heart surgery days later.\n\nBefore his operation, he told Meghan he would not be able to make it. “Meghan cried,” said Thomas. “They were disappointed but they both said, ‘take care of yourself were really worried about you.’”\n\nOn the days leading up to Meghan and Harry’s May 19 wedding, a friend of Thomas helped him rent an apartment. He stayed there for about three nights to rest and recover. It is also where he ended up watching his daughter’s gorgeous ceremony.\n\nWhen learning Prince Charles would be the one to walk Meghan down the aisle, Thomas “was honored. I can’t think of a better replacement than someone like Prince Charles. He looked very handsome and my daughter looked beautiful with him. I was jealous, I wish I had been there. I wish it had been me, but thank God he was there, and thank him for that.”\n\nSeeing his daughter marry the love of her life, Thomas couldn’t help but get emotional.\n\n“She was beautiful. It was incredible watching her. I cried a little bit about it. But she was so beautiful walking down that aisle and so proud and so gorgeous. I was very proud, I couldn’t have seen a better moment in my life. I was very upset that it wasn’t me, but the whole world was watching my daughter. I was very happy about that,” Thomas added.\n\nDespite the fact that he’s doing well and feels incredibly happy for his daughter, Thomas still has some deep regrets.\n\n“The unfortunate thing for me now, is that I’m a footnote in one of the greatest moments in history, rather than the dad walking her own the aisle, so that upsets me somewhat,” he told Piers Morgan.\n\n“It was a very emotional moment… I regretted it because I really wanted to walk my daughter down the aisle. I wanted that moment. But I’m thankful for everything the way it went.”\n\nWhat do you think of Thomas Markle’s tell-all interview? Let us know in the comments below.\n\nWe pay for juicy info! Do you have a story for RadarOnline.com? Email us at tips@radaronline.com, or call us at 800-344-9598 any time, day or night.", "images": ["https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/logo-celebrity-news.png?ssl=1", "https://radaronline.com/wp-content/uploads/2018/06/Thomas-Markle-Regrets-Interview-Meghan-Harry-Wedding-pp.jpg", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/logo-fashion-police.png?fit=489%2C70&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/fashion-police-bg.jpg?fit=1440%2C210&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/scandal-bg.jpg?fit=1440%2C210&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/omg-bg.jpg?fit=1440%2C210&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/celebrity-news-bg.jpg?fit=1440%2C210&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/logo-scandal.png?fit=307%2C70&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/reality-tv-bg.jpg?fit=1440%2C210&ssl=1", "https://radaronline.com/wp-content/themes/vip/am-radaronline/assets/build/images/icons/logo-tag-registered-green.svg", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2020/04/playboy-mansion-featured-photo.jpg?w=384&crop=0%2C20px%2C384px%2C215px&resize=384%2C215&ssl=1", "https://radaronline.com/wp-content/themes/vip/am-radaronline/assets/build/images/icons/logo-tag-registered.svg", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/logo-omg.png?fit=188%2C70&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2018/06/Thomas-Markle-Regrets-Interview-Meghan-Harry-Wedding-pp.jpg?resize=792%2C446&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2020/03/Featured-Demi-Lovato.jpg?w=384&crop=0%2C20px%2C384px%2C215px&resize=384%2C215&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/logo-true-crime-b.png?fit=357%2C70&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/logo-reality-tv.png?fit=370%2C70&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/05/FEATURED.jpg?w=384&crop=0%2C20px%2C384px%2C215px&resize=384%2C215&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/logo-celebrity-news-b.png?fit=495%2C70&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2019/03/true-crime-bg.jpg?fit=1440%2C210&ssl=1", "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2020/04/rsz_mega580199_001.jpg?w=384&crop=0%2C20px%2C384px%2C215px&resize=384%2C215&ssl=1"], "top_img": "https://radaronline.com/wp-content/uploads/2018/06/Thomas-Markle-Regrets-Interview-Meghan-Harry-Wedding-pp.jpg", "keywords": [], "authors": ["Rosa Sanchez", "June"], "canonical_link": "https://radaronline.com/videos/thomas-markle-regrets-interview-meghan-harry-wedding/", "title": "Thomas Markle Talks Regrets In Interview After Meghan & Prince Harry Wedding", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"admins": 593583017, "app_id": 1008772232528225, "pages": 376279216711}, "theme-color": "#ffffff", "google-site-verification": "kONM_PqGX8Za53dFcExSTIIPZxxN_S4QtvDlONzzdA0", "description": "'I really wanted to walk my daughter down the aisle. I wanted that moment,’ Meghan Markle said in his first interview following his daughter’s big day.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Thomas Markle Talks Regrets In Interview After Meghan & Prince Harry Wedding", "description": "'I really wanted to walk my daughter down the aisle. I wanted that moment,’ Meghan Markle said in his first interview following his daughter’s big day.", "url": "https://radaronline.com/videos/thomas-markle-regrets-interview-meghan-harry-wedding/", "site_name": "RadarOnline", "updated_time": "2018-06-18T16:28:20+00:00", "image": {"identifier": "https://radaronline.com/wp-content/uploads/2018/06/Thomas-Markle-Regrets-Interview-Meghan-Harry-Wedding-pp.jpg", "secure_url": "https://radaronline.com/wp-content/uploads/2018/06/Thomas-Markle-Regrets-Interview-Meghan-Harry-Wedding-pp.jpg", "width": 1280, "height": 840}}, "article": {"tag": "Thomas Markle", "section": "Celebrity", "published_time": "2018-06-18T12:59:19+00:00", "modified_time": "2018-06-18T16:28:20+00:00"}, "twitter": {"card": "summary_large_image", "description": "'I really wanted to walk my daughter down the aisle. I wanted that moment,’ Meghan Markle said in his first interview following his daughter’s big day.", "title": "Thomas Markle Talks Regrets In Interview After Meghan & Prince Harry Wedding", "image": "https://i0.heartyhosting.com/radaronline.com/wp-content/uploads/2018/06/Thomas-Markle-Regrets-Interview-Meghan-Harry-Wedding-pp.jpg?fit=1280%2C840&ssl=1"}, "news_keywords": "Thomas Markle", "generator": "WordPress 5.3.2"}, "movies": [], "publish_date": 1529326759.0, "source": "http://radaronline.com", "summary": ""}