{"url": "https://www.dailynews.com/2018/03/04/oscars-2018s-big-winners-best-moments-as-shape-of-water-takes-the-night/", "text": "“The Shape Of Water,” director Guillermo del Toro’s science-fiction love story about a mute cleaning woman and the fish-man for whom she falls, won best picture, and with three additional Oscars, including best director, ended up the big winner at the 90th annual Academy Awards on Sunday, March 4.\n\n“Everyone who is dreaming of a parable using genre fantasy to tell a story about the things that are real in the world today, you can do this,” del Toro said. “This is a door. Kick it open and come in.”\n\nRELATED: Here are the Oscar red carpet fashions we can’t stop talking about\n\nIn addition to the Oscars for best picture and best director, “The Shape Of Water” also won Oscars for best score for composer Alexandre Desplat and best production design for the work of Paul Denham Austerberry, Shane Vieau and Jeffrey A. Melvin in recreating the Cold War setting of the film.\n\nHOLLYWOOD, CA – MARCH 04: Actor Frances McDormand accepts Best Actress for ‘Three Billboards Outside Ebbing, Missouri’ onstage during the 90th Annual Academy Awards at the Dolby Theatre at Hollywood & Highland Center on March 4, 2018 in Hollywood, California. (Photo by Kevin Winter/Getty Images)\n\nHOLLYWOOD, CA – MARCH 04: In this handout provided by A.M.P.A.S., Jimmy Kimmel (L) and Jennifer Lawrence attend the 90th Annual Academy Awards at the Dolby Theatre on March 4, 2018 in Hollywood, California. (Photo by Matt Petit/Getty Images)\n\nSound The gallery will resume in seconds\n\nMexican director Guillermo del Toro (2ndR) is congratulated by US actress Sally Hawkins next to US actress Octavia Spencer (2ndL) after he won the Oscar for Best Film for “The Shape of Water” during the 90th Annual Academy Awards show on March 4, 2018 in Hollywood, California. / AFP PHOTO / Mark RALSTON (Photo credit should read MARK RALSTON/AFP/Getty Images)\n\nUS actress Jane Fonda (L) and British actress Helen Mirren present the Oscar for Best Actor during the 90th Annual Academy Awards show on March 4, 2018 in Hollywood, California. / AFP PHOTO / Mark Ralston (Photo credit should read MARK RALSTON/AFP/Getty Images)\n\nUS actress Frances McDormand (C) accepts the Oscar for Best Actress in “Three Billboards outside Ebbing, Missouri” from US actresses Jodie Foster (L) and Jennifer Lawrence during the 90th Annual Academy Awards show on March 4, 2018 in Hollywood, California. / AFP PHOTO / Mark RALSTON (Photo credit should read MARK RALSTON/AFP/Getty Images)\n\n\n\nHOLLYWOOD, CA – MARCH 04: Actor Meryl Streep applauds in the audience the 90th Annual Academy Awards at the Dolby Theatre at Hollywood & Highland Center on March 4, 2018 in Hollywood, California. (Photo by Kevin Winter/Getty Images)\n\nHOLLYWOOD, CA – MARCH 04: Actors Faye Dunaway (L) and Warren Beatty speak onstage during the 90th Annual Academy Awards at the Dolby Theatre at Hollywood & Highland Center on March 4, 2018 in Hollywood, California. (Photo by Kevin Winter/Getty Images)\n\nUS actress Frances McDormand (C) delivers a speech next to US actresses Jodie Foster (2ndR) and Jennifer Lawrence (3rdR) after she won the Oscar for Best Actress in “Three Billboards outside Ebbing, Missouri” during the 90th Annual Academy Awards show on March 4, 2018 in Hollywood, California. / AFP PHOTO / Mark RALSTON (Photo credit should read MARK RALSTON/AFP/Getty Images)\n\nMexican director Guillermo del Toro (2ndL) and producer J. Miles Dale (L) accept the Oscar for Best Film for “The Shape of Water” from US actors Faye Dunaway and Warren Beatty during the 90th Annual Academy Awards show on March 4, 2018 in Hollywood, California. / AFP PHOTO / Mark RALSTON (Photo credit should read MARK RALSTON/AFP/Getty Images)\n\nHOLLYWOOD, CA – MARCH 04: (L-R) Actor Helen Mirren with Oscar-winning costume designer Mark Bridges sitting on a Jet Ski (which he received as a prize for shortest acceptance speech) onstage during the 90th Annual Academy Awards at the Dolby Theatre at Hollywood & Highland Center on March 4, 2018 in Hollywood, California. (Photo by Kevin Winter/Getty Images)\n\n\n\nBritish actor Gary Oldman is congratulated after he won the Oscar for Best Actor in “Darkest Hour” during the 90th Annual Academy Awards show on March 4, 2018 in Hollywood, California. / AFP PHOTO / Mark RALSTON (Photo credit should read MARK RALSTON/AFP/Getty Images)\n\nBritish actor Gary Oldman delivers a speech after he won the Oscar for Best Actor in “Darkest Hour” during the 90th Annual Academy Awards show on March 4, 2018 in Hollywood, California. / AFP PHOTO / Mark Ralston (Photo credit should read MARK RALSTON/AFP/Getty Images)\n\nHOLLYWOOD, CA – MARCH 04: In this handout provided by A.M.P.A.S., Helen Mirren attends the 90th Annual Academy Awards at the Dolby Theatre on March 4, 2018 in Hollywood, California. (Photo by Matt Petit/A.M.P.A.S via Getty Images)\n\nJodie Foster, left, presents Frances McDormand with the award for best performance by an actress in a leading role for “Three Billboards Outside Ebbing, Missouri” at the Oscars on Sunday, March 4, 2018, at the Dolby Theatre in Los Angeles. (Photo by Chris Pizzello/Invision/AP)\n\nGuillermo del Toro and the cast and crew of “The Shape of Water” accept the award for best picture at the Oscars on Sunday, March 4, 2018, at the Dolby Theatre in Los Angeles. (Photo by Chris Pizzello/Invision/AP)\n\n\n\nHOLLYWOOD, CA – MARCH 04: Actor Christopher Walken speaks onstage during the 90th Annual Academy Awards at the Dolby Theatre at Hollywood & Highland Center on March 4, 2018 in Hollywood, California. (Photo by Kevin Winter/Getty Images)\n\nTOPSHOT – Kobe Bryant poses in the press room with the Oscar for Best Animated Short Film for “Dear Basketball,”during the 90th Annual Academy Awards on March 4, 2018, in Hollywood, California. / AFP PHOTO / Robyn Beck (Photo credit should read ROBYN BECK/AFP/Getty Images)\n\nHOLLYWOOD, CA – MARCH 04: Cinematographer Roger A. Deakins accepts Best Cinematography for ‘Blade Runner 2049’ onstage during the 90th Annual Academy Awards at the Dolby Theatre at Hollywood & Highland Center on March 4, 2018 in Hollywood, California. (Photo by Kevin Winter/Getty Images)\n\nHOLLYWOOD, CA – MARCH 04: In this handout provided by A.M.P.A.S., Helen Mirren attends the 90th Annual Academy Awards at the Dolby Theatre on March 4, 2018 in Hollywood, California. (Photo by Matt Petit/Getty Images)\n\nUS hip hop artist Common (L) and US singer Andra Day perform during the 90th Annual Academy Awards show on March 4, 2018 in Hollywood, California. / AFP PHOTO / Mark RALSTON (Photo credit should read MARK RALSTON/AFP/Getty Images)\n\n\n\nHOLLYWOOD, CA – MARCH 04: (L-R) Actors Ashley Judd, Annabella Sciorra and Salma Hayek speak onstage during the 90th Annual Academy Awards at the Dolby Theatre at Hollywood & Highland Center on March 4, 2018 in Hollywood, California. (Photo by Kevin Winter/Getty Images)\n\nHOLLYWOOD, CA – MARCH 04: Screenwriter James Ivory accepts Best Adapted Screenplay for ‘Call Me by Your Name’ onstage during the 90th Annual Academy Awards at the Dolby Theatre at Hollywood & Highland Center on March 4, 2018 in Hollywood, California. (Photo by Kevin Winter/Getty Images)\n\nHOLLYWOOD, CA – MARCH 04: Writer/director Jordan Peele (R) accepts Best Original Screenplay for ‘Get Out’ from actor Nicole Kidman onstage during the 90th Annual Academy Awards at the Dolby Theatre at Hollywood & Highland Center on March 4, 2018 in Hollywood, California. (Photo by Kevin Winter/Getty Images)\n\nHOLLYWOOD, CA – MARCH 04: Actor Lakeith Stanfield speaks onstage during the 90th Annual Academy Awards at the Dolby Theatre at Hollywood & Highland Center on March 4, 2018 in Hollywood, California. (Photo by Kevin Winter/Getty Images)\n\nAustralian Film Editor Lee Smith (R) celebrates next to US actor Matthew McConaughey after he won the Oscar for Best Film Editing for “Dunkirk” during the 90th Annual Academy Awards show on March 4, 2018 in Hollywood, California. / AFP PHOTO / Mark Ralston (Photo credit should read MARK RALSTON/AFP/Getty Images)\n\n\n\nHOLLYWOOD, CA – MARCH 04: Actors Gina Rodriguez and Tom Holland speak onstage during the 90th Annual Academy Awards at the Dolby Theatre at Hollywood & Highland Center on March 4, 2018 in Hollywood, California. (Photo by Kevin Winter/Getty Images)\n\nHOLLYWOOD, CA – MARCH 04: (L-R) BB-8, actors Oscar Isaac, Mark Hamill and Kelly Marie Tran speak onstage during the 90th Annual Academy Awards at the Dolby Theatre at Hollywood & Highland Center on March 4, 2018 in Hollywood, California. (Photo by Kevin Winter/Getty Images)\n\nHOLLYWOOD, CA – MARCH 04: Actor/singer Mary J. Blige performs onstage during the 90th Annual Academy Awards at the Dolby Theatre at Hollywood & Highland Center on March 4, 2018 in Hollywood, California. (Photo by Kevin Winter/Getty Images)\n\nHOLLYWOOD, CA – MARCH 04: (L-R) Actors Frances McDormand, Sam Rockwell , and Leslie Bibb celebrate during the 90th Annual Academy Awards at the Dolby Theatre at Hollywood & Highland Center on March 4, 2018 in Hollywood, California. (Photo by Kevin Winter/Getty Images)\n\nHOLLYWOOD, CA – MARCH 04: Host Jimmy Kimmel (R) speaks onstage during the 90th Annual Academy Awards at the Dolby Theatre at Hollywood & Highland Center on March 4, 2018 in Hollywood, California. (Photo by Kevin Winter/Getty Images)\n\n\n\nHOLLYWOOD, CA – MARCH 04: Actors Armie Hammer (L) and Gal Gadot speak onstage during the 90th Annual Academy Awards at the Dolby Theatre at Hollywood & Highland Center on March 4, 2018 in Hollywood, California. (Photo by Kevin Winter/Getty Images)\n\nHOLLYWOOD, CA – MARCH 04: Actors Greta Gerwig (L) and Laura Dern onstage during the 90th Annual Academy Awards at the Dolby Theatre at Hollywood & Highland Center on March 4, 2018 in Hollywood, California. (Photo by Kevin Winter/Getty Images)\n\nActor Sam Rockwell accepts the Oscar for Best Supporting Actor in Three Billboards outside Ebbing, Missouri during the 90th Annual Academy Awards show on March 4, 2018 in Hollywood, California. / AFP PHOTO / Mark Ralston (Photo credit should read MARK RALSTON/AFP/Getty Images)\n\nActor Sam Rockwell (L) is congratulated by US actor Woody Harrelson after he won the Oscar for Best Supporting Actor in Three Billboards outside Ebbing, Missouri during the 90th Annual Academy Awards show on March 4, 2018 in Hollywood, California. / AFP PHOTO / Mark RALSTON (Photo credit should read MARK RALSTON/AFP/Getty Images)\n\nTaraji P. Henson introduces a performance by Mary. J. Blige at the Oscars on Sunday, March 4, 2018, at the Dolby Theatre in Los Angeles. (Photo by Chris Pizzello/Invision/AP)\n\n\n\nKazuhiro Tsuji, from left, Lucy Sibbick, and David Malinowski, winners of the award for best makeup and hairstyling for “Darkest Hour”, pose in the press room at the Oscars on Sunday, March 4, 2018, at the Dolby Theatre in Los Angeles. (Photo by Jordan Strauss/Invision/AP)\n\nArmie Hammer, left, and Gal Gadot present the award for best makeup and hairstyling at the Oscars on Sunday, March 4, 2018, at the Dolby Theatre in Los Angeles. (Photo by Chris Pizzello/Invision/AP)\n\nMargot Robbie, left, reacts as Allison Janney wins the award for best performance by an actress in a supporting role for “I, Tonya” at the Oscars on Sunday, March 4, 2018, at the Dolby Theatre in Los Angeles. (Photo by Chris Pizzello/Invision/AP)\n\nActor Sam Rockwell delivers a spech after he won the Oscar for Best Supporting Actor in Three Billboards outside Ebbing, Missouri during the 90th Annual Academy Awards show on March 4, 2018 in Hollywood, California. / AFP PHOTO / Mark Ralston (Photo credit should read MARK RALSTON/AFP/Getty Images)\n\nRita Moreno arrives at the Oscars on Sunday, March 4, 2018, at the Dolby Theatre in Los Angeles. (Photo by Jordan Strauss/Invision/AP)\n\n\n\nOn a night when diversity and inclusion were celebrated throughout the ceremony, there was a good sense of equality in the distribution of the rest of the awards. “Dunkirk” won three Oscars, while “Three Billboards Outside Ebbing, Missouri” picked up two, with best actress and best supporting actor going to Frances McDormand and Sam Rockwell.\n\nRELATED: Oscars 2018 red carpet fashion: See photos of the stars’ best and worst looks\n\n“Darkest Hour,” “Coco” and “Blade Runner” each won twice, with Gary Oldman’s turn as Winston Churchill in “The Darkest Hour” earning him best actor. No other film won more than once.\n\nMcDormand’s win for best actress was an outcome that, like that for the three acting winners who preceded her on Sunday, was widely expected. Her speech, however, was anything but routine.\n\n“If I fall over pick me up, because I’ve got some things to say,” McDormand said with a take-no-nonsense stare into the camera.\n\nRELATED: Complete winners at the 90th Annual Academy Awards\n\n“And now I want to get some perspective,” she continued. “If I may be so honored to have every female nominee stand with me in this room. The actors, the directors, the writers. OK, look around everybody, because we all have stories to tell, and projects we need financed.”\n\nOldman, who had won most of the best actor honors leading up to the Academy Awards, added that final prize to his collection on Sunday.\n\n“I’ve lived in America for the longest time, and I am deeply grateful to her for the love and the friendships I have made, and the many wonderful gifts it has given me,” Oldman said. “My home, my livelihood, my family, and now Oscar.”\n\nAccepting the Oscar for best director, Del Toro hit one of the recurrent themes of the night: the need to open doors, not close them.\n\n“The greatest thing our art does and our industry does is erase the lines in the sand,” Del Toro said in accepting the Oscar. “We should continue to do that when the world tells us to make them deeper.”\n\nRELATED: Oscars 2018: These 5 moments made history at the 90th Academy Awards\n\nHistory was made by both screenwriters, James Ivory and Jordan Peele, who won Oscars on Sunday.\n\nIvory, who won best adapted screenplay for “Call Me By Your Name,” not only took home his first Academy Award after more than six decades in the film business, by doing so at the age of 89 he became the oldest-ever winner of an Oscar in any category.\n\nAnd Peele, who won for original screenplay for writing “Get Out,” became the first black writer to ever win that category.\n\n“Coco,” the Day of the Dead-inspired film from Pixar and Disney, won as expected for best animated film, its Mexican roots giving its creators a chance to speak out to celebrate diversity and champion equality for all.\n\n“’Coco’ is proof that art can change and connect the world, and this can only be done when we have a place for everyone and anyone who feels like an ‘other’ to be heard,” said Darla K. Anderson.\n\nRELATED: The 2018 Oscars as told by these GIFs\n\nFormer Los Angeles Laker superstar Kobe Bryant added an Oscar to his five NBA championship rings when “Dear Basketball,” the film based on a letter he wrote in 2015 when he announced his retirement from the game, won the Academy Award for best short animated film.\n\n“It’s a message for all of us,” said Glen Keane, who directed the film and shared the Academy Award with Bryant. “Whatever form your dream may take, it’s through passion and perseverance that the impossible is possible.”\n\nAdded Bryant, with a subtle commentary on a recent dispute between a Fox News host and NBA star LeBron James: “I don’t know if it’s possible. I mean, as basketball players we’re really supposed to shut up and dribble, but I’m glad we do a little bit more than that.”\n\nAllison Janney and Sam Rockwell, who won for supporting actress and supporting actor, had been front runners throughout the awards season, though of course you never know for sure until you hear your name read.\n\n“I did it all by myself,” Janney joked of her role as LaVona, the abusive and not at all very nice mother of skater Tonya Harding in “I, Tonya.” “OK, nothing further from the truth.”\n\nRockwell took home the first Oscar of the night, winning best supporting actor as most expected he would for his role as a racist police officer who slowly sees the error of his ways in “Three Billboards Outside of Ebbing, Missouri.”\n\nRockwell sat his shiny statue on the stage at the Dolby Theatre and thanked, among others, his parents for instilling in him a love of movies from a very young age, recounting how one day in elementary school he was called to the principal’s office where his father was waiting.\n\n“My father was looking very solemn, and he said, ‘You gotta go, it’s grandma,’” Rockwell said.”I got in the car and said, ‘What’s wrong with grandma?’ He said, ‘Nothing, we’re going to to the movies.’”\n\nAfter thanking everyone involved in making “Three Billboards” – and “everyone who’s ever looked at a billboard” – Rockwell left the stage, clocking out after a minute and 29 seconds, as host Jimmy Kimmel noted, part of bit he announced in his monologue in which he promised a Jet-Ski to the winner who gave the shortest speech.\n\nIn his opening, Kimmel touched on all the topics you’d expect – sexual harassment and the #MeToo movement, President Donald Trump, and the unprecedented screw-up at the Academy Awards a year ago when the wrong movie was announced as the winner of best picture.\n\n“I do want to mention: This year, when you hear your name called, don’t get up right away,” Kimmel said in reference to the announcement that “La La Land” had won instead of actual winner “Moonlight.” “Give us a minute.”\n\nRELATED: Oscars 2018: Rita Moreno is a national treasure at the 90th Academy Awards\n\nReferencing the sexual harassment scandals that have engulfed Hollywood, politics, business and pretty much everyone corner of society in the past year, Kimmel paid tribute to the man-sized Oscar statue on stage as the perfect man.\n\n“He keeps his hands where you can see them,” Kimmel said. “Never says a rude word. And most importantly no penis at all. He’s literally a statue of limitations.”", "images": ["https://www.dailynews.com/wp-content/uploads/2017/08/ladn-no-margin.svg", "https://i2.wp.com/scng-dash.digitalfirstmedia.com/wp-content/uploads/2018/03/gettyimages-927307266.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://i2.wp.com/scng-dash.digitalfirstmedia.com/wp-content/uploads/2018/03/gettyimages-927322438.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://i0.wp.com/scng-dash.digitalfirstmedia.com/wp-content/uploads/2018/03/ap_18064093995924.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://www.dailynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg", "https://www.dailynews.com/wp-content/uploads/2018/03/ldn-l-oscars-main-0305-0616.jpg?w=1024&h=707", "https://i0.wp.com/scng-dash.digitalfirstmedia.com/wp-content/uploads/2018/03/ap_18064053371041.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://i0.wp.com/scng-dash.digitalfirstmedia.com/wp-content/uploads/2018/03/gettyimages-927333316.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1"], "top_img": "https://www.dailynews.com/wp-content/uploads/2018/03/ldn-l-oscars-main-0305-0616.jpg?w=1024&h=707", "keywords": [], "authors": ["Peter Larsen", "Peter Larsen Has Been The Pop Culture Reporter For The Orange County Register Since", "Finally Achieving The Neat Trick Of Getting Paid To Report", "Write About The Stuff He'S Obsessed About Pretty Much All His Life. He Regularly Covers The Oscars", "The Emmys", "Goes To Comic-Con", "Coachella", "Reviews Pop Music", "Conducts Interviews With Authors", "Actors"], "canonical_link": "https://www.dailynews.com/2018/03/04/oscars-2018s-big-winners-best-moments-as-shape-of-water-takes-the-night/", "title": "Oscars 2018’s big winners, best moments as ‘Shape of Water’ takes the night", "meta_data": {"application-name": "dailynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 55107646487}, "og": {"type": "article", "title": "Oscars 2018’s big winners, best moments as ‘Shape of Water’ takes the night", "url": "https://www.dailynews.com/2018/03/04/oscars-2018s-big-winners-best-moments-as-shape-of-water-takes-the-night/", "description": "Here’s everything you need to know about the Oscars last night", "site_name": "Daily News", "image": {"identifier": "https://www.dailynews.com/wp-content/uploads/2018/03/ldn-l-oscars-main-0305-0616.jpg?w=1024&h=707", "width": 1024, "height": 707}, "locale": "en_US"}, "article": {"published_time": "2018-03-05T06:06:23+00:00", "modified_time": "2018-03-05T22:55:05+00:00"}, "twitter": {"site": "@ladailynews", "text": {"title": "Oscars 2018’s big winners, best moments as ‘Shape of Water’ takes the night"}, "image": "https://www.dailynews.com/wp-content/uploads/2018/03/ldn-l-oscars-main-0305-0616.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.dailynews.com/wp-content/uploads/2017/08/site-icon-ladn.png?w=270"}, "movies": [], "publish_date": 1520092800.0, "source": "https://www.dailynews.com", "summary": ""}