{"url": "www.bustle.com/p/are-gwen-stefani-blake-shelton-engaged-in-2017-the-couple-has-been-going-strong-for-years-7531161", "text": "It's been just over two years since Gwen Stefani and Blake Shelton first started dating, and, as of late, the rumor mill has kicked into overdrive about their future. So, it's time to set the record straight: Are Gwen Stefani and Blake Shelton engaged? It's far from the first time such reports have circulated, and when the couple has shut down gossip in the past, they've made clear they're in no rush to tie the knot.\n\n\"Everything's crazy right now so no, absolutely not,\" Stefani said in June 2016 during 94.7 Fresh FM's The Tommy Show last summer when asked if she was engaged. \"Can you imagine the amount of gossipy, weird stories people make up? To me, it makes me laugh every day. I actually do Google my name just so I can see the next one that's gonna happen, because it's gotten so out of control.\" And, though that was awhile ago, there's been no comment to the contrary from the couple in regards to engagement and marriage.\n\nBoth Shelton and Stefani have been married before, Shelton to his high school sweetheart, Kaynette Gern, from 2003 to 2006, and then to fellow country star Miranda Lambert from 2011 to 2015, and Stefani to Bush frontman Gavin Rossdale from 2002 to 2016. In fact, falling out of love is what helped them fall into it. Shelton went through his second divorce around the same time as Stefani. By that point, they'd become friends from their time on The Voice, and they started leaning on each other for support as they recovered from heartbreak.\n\nKevin Winter/Getty Images Entertainment/Getty Images\n\nEventually, that blossomed into a romance of their own. As Shelton told Billboard in 2016:\n\n“It went from [relating to one another], to checking in on each other once a week through email – ‘This sh*t happened to me, what happened to you?’ – to maybe three times a week, then every day, to ‘Hey, here’s my phone number if you ever want to text.’ Next thing I know, I wake up and she’s all I care about, and I’m wondering if she feels the same about me. Gwen saved my life.\"\n\nSince confirming that they were dating in November 2015, Stefani and Shelton haven't been shy about their relationship. They had noticeable chemistry when they reunited for The Voice Season 12, and they often share sweet posts of each other on social media. \"Got my Christmas present already gx #youmakeitfeellikechristmas @blakeshelton #yum,\" Stefani captioned a recent photo tied to the Christmas duet they wrote together.\n\nAs far as marriage goes, they haven't said much about any potential plans, but considering how publicly they've shown their love for one another, it doesn't seem like it's something they'd hide. For now, it appears that they're perfectly happy as is, and are committed to one another whether or not they're husband and wife. \"It's really been smooth sailing for them,\" an anonymous source claimed to Entertainment Tonight in August. \"They don't talk about getting married, but they talk like they are going to be together forever. They are very committed to one another and their life together.\"\n\nOf course, there are hints to be found in their music, and from the sounds of it, marriage has definitely been on Shelton's mind. “I’m talkin’ you and me with the same street name. Same last name, same everything. It’s a real thing, how I feel thin, so I’mma go on and take a swing,” he sings on September single \"I'll Name The Dogs\" — a message only emphasized by the track's wedding-themed video. But in the meantime, it seems Shelton and Stefani are content to take things slow. And, if and when the time comes, they'll likely let fans know.", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/10/bab84c2f-300c-42c9-a7b4-b3ff6ce066dc-getty-1192972154.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2017/12/11/efc7221f-207b-45c8-a253-4c689cc63ea5-getty-533609742.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2017/12/11/efc7221f-207b-45c8-a253-4c689cc63ea5-getty-533609742.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/9/dbe575a0-757f-431a-b1ff-26cca1927f4d-getty-1187976985.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2017/12/11/1676976c-f8ac-4126-bd7d-62f47c8096a8-getty-531294500.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/10/1a647a57-e12b-432f-bfbc-c72e4905587a-thth_103_portraits_01423r220200403-3458-1e1brpe.jpeg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2020/4/9/61a1cd1f-1abc-4ce9-ba92-b6e265d5d34d-getty-1192972154.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2017/12/11/efc7221f-207b-45c8-a253-4c689cc63ea5-getty-533609742.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/are-gwen-stefani-blake-shelton-engaged-in-2017-the-couple-has-been-going-strong-for-years-7531161", "title": "Are Gwen Stefani & Blake Shelton Engaged In 2017? The Couple Has Been Going Strong For Years", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/are-gwen-stefani-blake-shelton-engaged-in-2017-the-couple-has-been-going-strong-for-years-7531161", "type": "article", "title": "Gwen Stefani & Blake Shelton Haven't Hit This Relationship Milestone Yet", "description": "It's been just over two years since Gwen Stefani and Blake Shelton first started dating, and, as of late, the rumor mill has kicked into overdrive about their future. So, it's time to set the record straight: Are Gwen Stefani and Blake Shelton…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2017/12/11/efc7221f-207b-45c8-a253-4c689cc63ea5-getty-533609742.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "It's been just over two years since Gwen Stefani and Blake Shelton first started dating, and, as of late, the rumor mill has kicked into overdrive about their future. So, it's time to set the record straight: Are Gwen Stefani and Blake Shelton…"}, "movies": [], "publish_date": null, "source": "http://www.bustle.com", "summary": ""}