{"url": "people.com/movies/blac-chyna-kardashians-threatened-leave-e-rob-chyna-report/", "text": "Blac Chyna is reportedly accusing the Kardashian family of conspiring to cancel her show.\n\nChyna, 30, claims the family threatened to pull their show Keeping Up with the Kardashians from E! if the network did not cancel her show Rob & Chyna, according to a new legal filing obtained by TMZ.\n\nGet push notifications with news, features and more.\n\nThe model and entrepreneur reportedly goes on to claim that the first season of the reality show, in which she starred with her ex Rob Kardashian, 31, outperformed Keeping Up with the Kardashians’ ratings, and was in the midst of filming its second season when it was canceled.\n\nChyna claims that a “key meeting” between the Kardashian family and E! executives in January 2017 led to the show’s cancellation, according to TMZ. She also reportedly alleges that the Kardashians “falsely” accusing her of physically abusing Rob contributed to the show’s demise.\n\nImage zoom Blac Chyna, Kim Kardashian West Phillip Faraone/WireImage; Jason LaVeris/FilmMagic\n\nWant to keep up on the latest from PEOPLE? Sign up for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\nShe is asking for a trail of paperwork she believes will prove her accusations, the outlet reports.\n\nThe new filing is just the latest in the ongoing legal drama between Chyna and the Kardashian family.\n\nIn court documents filed April 30 in Los Angeles obtained by The Blast, Chyna defended her initial complaint against the Kardashian-Jenner family that alleges she’s owed money from Kylie Jenner‘s Life of Kylie, an eight-episode E! docu-series that premiered in August 2017. (E! declined to comment at the time.)\n\nIn December, attorneys for Kris Jenner, Kim Kardashian West and Rob filed a “demurrer” challenging the basis of Chyna’s lawsuit against them and asking a judge to dismiss her case. In the filings, attorneys alleged Chyna herself prevented the show from filming after obtaining a domestic violence restraining order against Rob in July.\n\nImage zoom Blac Chyna and Rob Kardashian. Prince Williams/WireImage\n\nThe order prevented Rob from contacting Chyna “either directly or indirectly, in any way” and required him to stay away from her, her home and place of work. The April 30 filing by Chyna asserted that any evidentiary determination is premature and that she has pleaded sufficient facts to move the case forward.\n\nThat filing is part of a larger suit that Chyna filed against Rob and the family in October in which she argued that she suffered “significant damages” after her ex’s social media rampage July 5, when he shared graphic and expletive-ridden content about her — including three naked photos — while accusing her of drug/alcohol abuse and infidelity. Chyna alleged that the nude photo scandal — along with influence from the Kardashian family — are what got Rob & Chyna axed.\n\nRELATED VIDEO: Blac Chyna Says She’ll Protect Kids ‘At All Costs’ After Fight Video Shows Her Swinging Stroller\n\nChyna claimed that Life of Kylie replaced the second season of Rob & Chyna, whichwas initially renewed but later halted. She specifically alleged that it was only after Rob, Kylie and his family “intentionally interfered so as to kill season two of Rob & Chyna that Life of Kylie was created.”\n\nAs such, Chyna alleged that the money Kylie, 19, earned for Life of Kylie was acquired through “unlawful means” that interfered with Chyna’s contract for a second season of Rob & Chyna.Chyna’s legal team has argued that the family had already interfered with plans for a season 2 of Rob & Chyna before the restraining order was issued and that filming for the season could have been completed beforehand.\n\nRob has denied the physical and verbal assault claims brought against him by his ex. The former couple shares a daughter, Dream Kardashian.\n\nLife of Kylie ran for eight episodes starting in August 2017; Rob & Chyna season 1 consisted of seven episodes and aired from September-December 2016, when E! announced the renewal.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fblac-chyna2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fblac-chyna2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F02%2Fblac-chyna1.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fblac-chyna2.jpg", "keywords": [], "authors": ["Mike Miller"], "canonical_link": "https://people.com/movies/blac-chyna-kardashians-threatened-leave-e-rob-chyna-report/", "title": "Blac Chyna Says Kardashians Conspired to Cancel Her Show", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Blac Chyna,Kardashians,Keeping Up with the Kardashians,News,Rob & Chyna,TV", "news_keywords": "Blac Chyna,Kardashians,Keeping Up with the Kardashians,News,Rob & Chyna,TV", "description": "She is asking for a trail of paperwork she believes will prove her accusations, TMZ reports.", "og": {"title": "Blac Chyna Says Kardashians Threatened to Leave E! Unless Network Dropped Rob & Chyna: Report", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/movies/blac-chyna-kardashians-threatened-leave-e-rob-chyna-report/", "description": "Blac Chyna is reportedly accusing the Kardashian family of conspiring to cancel her show. Chyna, 30, claims the family threatened to pull their show&nbsp;Keeping Up&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fblac-chyna2.jpg", "width": 1200, "height": 628}}, "pinterest": {"url": "https://people.com/movies/blac-chyna-kardashians-threatened-leave-e-rob-chyna-report/", "description": "She is asking for a trail of paperwork she believes will prove her accusations, TMZ reports.", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fblac-chyna2.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/movies/blac-chyna-kardashians-threatened-leave-e-rob-chyna-report/", "title": "Blac Chyna Says Kardashians Threatened to Leave E! Unless Network Dropped Rob & Chyna: Report", "description": "She is asking for a trail of paperwork she believes will prove her accusations, TMZ reports.", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fblac-chyna2.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}