{"url": "https://www.hollywoodreporter.com/live-feed/mr-robot-season-3-tyrell-mystery-explained-1051942", "text": "[Warning: This story contains spoilers for Wednesday's episode of Mr. Robot.]\n\nHe was going to be the youngest CTO in E Corp. history — until life was choked to death underneath him.\n\nMartin Wallstrom's Tyrell Wellick, one of the most complicated characters on USA Network's Mr. Robot this side of Elliot Alderson (Rami Malek) and his dark avatar, stepped out of the shadows and into the light in the latest season three episode, \"eps3.2_legacy.so.\" A fugitive from justice due to his role in the Five/Nine Hack and for murdering Sharon Knowles (Michele Hicks), Tyrell spent almost the entirety of season two on the sidelines — but he was never all that far from New York City after all.\n\nDuring his time off screen, Tyrell was just a car ride away from his old stomping grounds, locked down on an impenetrable compound and farm ground, chopping wood and growing out a ferocious beard while he waited for the Dark Army to reconnect him with his business partner and star-crossed love: Elliot, also isolated through his own stint in prison.\n\nThe episode pulls the lens back so far to reveal that Elliot as Mr. Robot (Christian Slater) did indeed try to kill Tyrell on the night of Five/Nine, and would have succeeded if not for divine intervention — or a jammed gun, if you prefer. Thanks to Irving (Bobby Cannavale) and the Dark Army, Tyrell was safely removed from the world for the entirety of Elliot's incarceration, before the two were reunited to set the dreaded Stage Two into motion. At the end of the hour, the action jumps forward to Elliot on the operating table shortly after suffering the gunshot wound at Tyrell's hands. Here, at long last, Tyrell finally learns the truth about the man he admires so much: Elliot Alderson isn't always Elliot Alderson.\n\n\"Initially, I wanted to tease it out throughout the season,\" creator Sam Esmail tells The Hollywood Reporter about how Tyrell's story came together. \"I wanted to fill in the blanks. On Mr. Robot, we sometimes employ circular storytelling. We take a step back, show you something and reframe it — then we step back, show you something else and reframe it again. We're constantly doing that. For Tyrell, because he was such a large part of season one and season two, even if he wasn't in season two, we felt his story deserved no interruptions. Every time we tried to tease it out in other episodes, it was always too magnetic on its own to just be tagged onto another storyline. We felt it had the weight and an emotional arc for his character that really deserved its own episode.\"\n\n\"Deciding where that episode fell was a big debate,\" Esmail adds. \"It's potentially putting the brakes on the current storyline and taking a huge step back into last season, and telling a story we haven't seen yet, but doesn't necessarily have a direct impact on the current storyline. We talked a lot about when the right time would be. We ultimately felt the story deserved its own time and place. I have to be honest, it's probably my favorite episode of the season. I ended up really loving it.\"\n\nIt should come as no surprise that Wallstrom also ended up loving the episode. Read on for what the erstwhile Tyrell Wellick tells The Hollywood Reporter about filling in the blanks on his character's recent disappearance.\n\nHow much wood did you chop for this episode?\n\n(Laughs.) Chopped in the episode, or in the practice beforehand?\n\nBoth!\n\nWell, I did get an email from Sam and production around ... I don't know, February or March: \"Hey, can you start practicing chopping wood?\" So I did! They told me, \"You have to be careful. Don't chop off your leg.\" But I did a little practice. In the episode, it was a lot of chopping. But I enjoyed it a lot!\n\nWas it as relaxing for you as it seemed to be for Tyrell?\n\nI don't know ... does it seem relaxing?\n\nStress-relieving, at least.\n\nOh yeah. I was pretty focused on making clean, nice chops. Sometimes, I would just chop and chop and I couldn't get through it, and the team would start laughing. I was more concerned about making nice, clean cuts.\n\nTyrell was a mystery man throughout season two. We didn't know if he was alive or dead until the finale. Has this season been more fulfilling for you, now that Tyrell's back in the picture?\n\nI have to say, of course, I had a lot more work this year. But I did enjoy [season two]. I thought it was a very bold and smart move from the writers and from Sam. It's interesting, having someone missing like that. I think it was a good choice. But of course, I have a lot more to do this season. It's a lot more fun to chop wood than it is to be in the trunk of a car. (Laughs.) I was a bit surprised [with this episode's story]. Hiding on a farm? I would have never imagined that. That was the most surprising part of it, that he wasn't that far away.\n\nWhat was it like to explore Tyrell in this very different capacity? He's so associated with the city. What was it like to put him in the country?\n\nIt was great. The set and everything they built ... and it's also about how when we've seen him in the past two seasons, he's always in a suit, a tie, nice and tidy hair, a perfectionist. Now we see someone just sort of being one with it. He just accepts where he is. You see that physical change. I thought that was interesting. The way they planned this [episode] was pretty extraordinary. It must be pretty exceptional for a TV show, because we had to plan production around the beard. They did a really good job with that. It also captures Sam in the sense that he always wants everything to be as real as possible with no cheating. When he said, \"We have to plan production around the beard,\" all these amazing people came together to make the schedule work.\n\nHow are you with growing out facial hair?\n\nI think I'm pretty slow. What we see at the full of it, I think we're at eight weeks. We started out with me coming in at eight weeks, filming for one or two days, then shaving, then filming a lot, then starting to grow again for eight weeks, and then filming again. They had a lot of planning to do.\n\nWere you sad to part ways with the beard?\n\nI don't want to sell myself short, but it's not the best-looking beard.\n\nDon't sell yourself short! It looked great.\n\nThank you. (Laughs.) I fit in pretty well in Williamsburg with a beard, but then you can't trim any of it. It has to look like it's been growing for eight weeks! So I can be on a farm or I can be in Williamsburg, but any place else than that? It doesn't look good.\n\nYou shared several scenes with Bobby Cannavale's Irving in this episode, and he's been a breakout this season, with his distinct look and voice. Was it hard to keep it straight as he played the character?\n\nFirst of all, he's such a nice person and such a great actor. The way he does the character? He's so grounded in a sense, and I look upon it as Irving is a top dog playing an underdog, and Tyrell is the underdog playing a top dog. I think that's pretty interesting, in terms of the dynamic. I remember when Irving was going to teach Tyrell to chop wood. Seeing Bobby doing that, it was so hard. The way he does it — the lightness on top of that really grounded character and the voice — it's just funny. It's so good. Sometimes it was hard to keep a straight face.\n\nYou also have a memorable scene in this episode with Wallace Shawn as Mr. Williams, which must have been a blast.\n\nThe writing and the casting on that was so great. Wally adds this lightness to it: the mustache, the way he looks and the cocaine. Everything was so contradictory. The way Wally did it, it wasn't hard to be in it. He had to keep the pace, which he did. That helped me a lot. He really pushed me. I'm so grateful for that.\n\nIn the scene, Mr. Williams pushes Tyrell: \"Do you hate your father? Are you afraid of becoming your father?\" Did his answer — \"yes\" — change anything about how you view Tyrell?\n\nHe talked about his father in season two about the \"Red Wheelbarrow\" poem. I think it has a lot to do with Tyrell's fear. His father represents so much in the world that Tyrell is trying not to be. That fear drives him so much. It's interesting in terms of the character, that he hates his father so much, and that both Elliot and Tyrell have this ambiguous relationship to their dads.\n\nWhat do you think Tyrell is trying to be? We know he's dedicated to Stage Two and he's unwavering in his loyalty to Elliot. What does he want to become?\n\nFrom the beginning, I think he wants to be on top of the world. The way things go for him — that he \"accidentally,\" or however you want to put it, kills Sharon Knowles — it puts him on this downward spiral which takes him so far away from being on top. He sees Stage Two as a way of creating enough chaos to sneak out the back. In some sense, it's also a revenge on E Corp. If you can't be the best? Then you have to be the best at being the worst, I guess.\n\nHow did you react when you heard about Joanna's death and that Stephanie Corneliussen would be leaving the show?\n\nI was definitely surprised. The work Stephanie does and how she portrays this character, it was so amazing to see. Whenever I meet people who are fans of the show, they say to me, \"Tyrell, man, he is so sick ...\" And then there's a two second pause before they go, \"But his wife!\" It captures so much about the way Stephanie portrayed her and what an amazing job she did to fill this dynamic between them, which I think was very interesting. I was very surprised.\n\nThroughout his time in exile, Tyrell is fixated on becoming a better man for Joanna. How is he going to take the news when he finds out about her death?\n\nIt's something fans don't have to [wonder] about — we'll see it.\n\nThe episode ends with Tyrell learning that sometimes, Elliot really is a different person. Was this breaking news for Tyrell, or did he ever suspect anything was off with Elliot?\n\nI think he had some sense that Elliot had some kind of duality — two major sides. That's one of the reasons he was so interested in Elliot. I think it's something Tyrell sees in himself, these two sides. He had a sense of something going on, but that it was this big? No. He could have never guessed that.\n\nHow will the revelation about Elliot's duality impact Tyrell moving forward?\n\nOnce Tyrell puts the pieces together, and with the fact that this brought him into shooting Elliot, he knows that the question of \"Elliot or Robot ... who's who?\" — it's not a game anymore. It's hard to control Elliot and Robot. Things are going to get tougher, for sure.\n\nFollow THR.com/MrRobot for interviews, deep dives, podcasts and more about season two.", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "https://cdn1.thr.com/sites/default/files/2017/10/nup_178054_1137-h_2017.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/01/greg_berlanti_sharon_horgan_alex_kurtzman_and_dwayne_johnson_-_getty_-_h_2020.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2017/10/nup_178054_1137-h_2017.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/03/mrs._america_-_publicity_still_1-_h_2020_.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/blogicon_livefeed-black2.png"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/10/nup_178054_1137-h_2017.jpg", "keywords": [], "authors": ["Josh Wigler", "Thrnews Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/live-feed/mr-robot-season-3-tyrell-mystery-explained-1051942", "title": "'Mr. Robot' Creator and Star Chop into Season 3's Tyrell Mystery", "meta_data": {"viewport": "width=device-width", "description": "Sam Esmail and Martin Wallstrom talk to THR about creating the latest key flashback scenes.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/live-feed/mr-robot-season-3-tyrell-mystery-explained-1051942", "domain": "https://www.hollywoodreporter.com/", "title": "'Mr. Robot' Creator and Star Chop into Season 3's Tyrell Mystery", "description": "Sam Esmail and Martin Wallstrom talk to THR about creating the latest key flashback scenes.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/10/nup_178054_1137-h_2017.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "'Mr. Robot' Creator and Star Chop into Season 3's Tyrell Mystery", "description": "Sam Esmail and Martin Wallstrom talk to THR about creating the latest key flashback scenes.", "url": "https://www.hollywoodreporter.com/live-feed/mr-robot-season-3-tyrell-mystery-explained-1051942", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/10/nup_178054_1137-h_2017.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "'Mr. Robot' Creator and Star Chop into Season 3's Tyrell Mystery", "sailthru.description": "Sam Esmail and Martin Wallstrom talk to THR about creating the latest key flashback scenes.", "sailthru.author": "Josh Wigler", "sailthru.channel": "Live Feed", "sailthru.vertical": "Live Feed", "sailthru.date": "2017-10-25 20:03:00", "sailthru.tags": "Live Feed, Television, Mr. Robot, autoplay"}, "movies": [], "publish_date": 1508932980.0, "source": "https://www.hollywoodreporter.com", "summary": ""}