{"url": "http://www.ssa.gov/history/nestor.html", "text": "Supreme Court Case: Flemming vs. Nestor\n\nBackground to the Case:\n\n\n\nThe fact that workers contribute to the Social Security program's funding through a dedicated payroll tax establishes a unique connection between those tax payments and future benefits. More so than general federal income taxes can be said to establish \"rights\" to certain government services. This is often expressed in the idea that Social Security benefits are \"an earned right.\" This is true enough in a moral and political sense. But like all federal entitlement programs, Congress can change the rules regarding eligibility--and it has done so many times over the years. The rules can be made more generous, or they can be made more restrictive. Benefits which are granted at one time can be withdrawn, as for example with student benefits, which were substantially scaled-back in the 1983 Amendments.\n\n\n\nThere has been a temptation throughout the program's history for some people to suppose that their FICA payroll taxes entitle them to a benefit in a legal, contractual sense. That is to say, if a person makes FICA contributions over a number of years, Congress cannot, according to this reasoning, change the rules in such a way that deprives a contributor of a promised future benefit. Under this reasoning, benefits under Social Security could probably only be increased, never decreased, if the Act could be amended at all. Congress clearly had no such limitation in mind when crafting the law. Section 1104 of the 1935 Act, entitled \"RESERVATION OF POWER,\" specifically said: \"The right to alter, amend, or repeal any provision of this Act is hereby reserved to the Congress.\" Even so, some have thought that this reservation was in some way unconstitutional. This is the issue finally settled by Flemming v. Nestor.\n\n\n\nIn this 1960 Supreme Court decision Nestor's denial of benefits was upheld even though he had contributed to the program for 19 years and was already receiving benefits. Under a 1954 law, Social Security benefits were denied to persons deported for, among other things, having been a member of the Communist party. Accordingly, Mr. Nestor's benefits were terminated. He appealed the termination arguing, among other claims, that promised Social Security benefits were a contract and that Congress could not renege on that contract. In its ruling, the Court rejected this argument and established the principle that entitlement to Social Security benefits is not contractual right. Flemming V. Nestor Case Name: FLEMMING V. NESTOR 363 U.S. 603 NO. 54. ARGUED FEBRUARY 24, 1960. - DECIDED JUNE 20, 1960. - 169 F. SUPP. 922, REVERSED . THE TERMINATION OF OLD-AGE BENEFITS PAYABLE TO AN ALIEN WHO, AFTER THE DATE OF ITS ENACTMENT (SEPTEMBER 1, 1954), IS DEPORTED UNDER SEC. 241(A) OF THE IMMIGRATION AND NATIONALITY ACT ON ANY ONE OF CERTAIN GROUNDS SPECIFIED IN SEC. 202(N). APPELLEE, AN ALIEN WHO HAD BECOME ELIGIBLE FOR OLD-AGE BENEFITS IN 1955, WAS DEPORTED IN 1956, PURSUANT TO SEC. 241(A) OF THE IMMIGRATION AND NATIONALITY ACT, FOR HAVING BEEN A MEMBER OF THE COMMUNIST PARTY FROM 1933 TO 1939. SINCE THIS WAS ONE OF THE GROUNDS SPECIFIED IN SEC. 202(N), HIS OLD-AGE BENEFITS WERE TERMINATED SHORTLY THEREAFTER. HE COMMENCED THIS ACTION IN A SINGLE JUDGE DISTRICT COURT, UNDER SEC. 205(G) OF THE SOCIAL SECURITY ACT, TO SECURE JUDICIAL REVIEW OF THAT ADMINISTRATIVE DECISION. THE DISTRICT COURT HELD THAT SEC. 202(N) DEPRIVED APPELLEE OF AN ACCRUED PROPERTY RIGHT AND, THEREFORE, VIOLATED THE DUE PROCESS CLAUSE OF THE FIFTH AMENDMENT. HELD: 1. ALTHOUGH THIS ACTION DREW INTO QUESTION THE CONSTITUTIONALITY OF SEC. 202(N), IT DID NOT INVOLVE AN INJUNCTION OR OTHERWISE INTERDICT THE OPERATION OF THE STATUTORY SCHEME; 28 U.S.C. SEC. 2282, FORBIDDING THE ISSUANCE OF AN INJUNCTION RESTRAINING THE ENFORCEMENT, OPERATION OR EXECUTION OF AN ACT OF CONGRESS FOR REPUGNANCE TO THE CONSTITUTION, EXCEPT BY A THREE-JUDGE DISTRICT COURT, WAS NOT APPLICABLE; AND JURISDICTION OVER THE ACTION WAS PROPERLY EXERCISED BY THE SINGLE-JUDGE DISTRICT COURT. PP. 606-608. 2. A PERSON COVERED BY THE SOCIAL SECURITY ACT HAS NOT SUCH A RIGHT IN OLD-AGE BENEFIT PAYMENTS AS WOULD MAKE EVERY DEFEASANCE OF \"ACCRUED\" INTERESTS VIOLATIVE OF THE DUE PROCESS CLAUSE OF THE FIFTH AMENDMENT. PP. 608-611. (A) THE NONCONTRACTUAL INTEREST OF AN EMPLOYEE COVERED BY THE ACT CANNOT BE SOUNDLY ANALOGIZED TO THAT OF THE HOLDER OF AN ANNUITY, WHOSE RIGHTS TO BENEFITS ARE BASED ON HIS CONTRACTUAL PREMIUM PAYMENTS. PP. 608-610. (B) TO ENGRAFT UPON THE SOCIAL SECURITY SYSTEM A CONCEPT OF \"ACCRUED PROPERTY RIGHTS\" WOULD DEPRIVE IT OF THE FLEXIBILITY AND BOLDNESS IN ADJUSTMENT TO EVER-CHANGING CONDITIONS WHICH IT DEMANDS AND WHICH CONGRESS PROBABLY HAD IN MIND WHEN IT EXPRESSLY RESERVED THE RIGHT TO ALTER, AMEND OR REPEAL ANY PROVISION OF THE ACT. PP. 610-611. 3. SECTION 202(N) OF THE ACT CANNOT BE CONDEMNED AS SO LACKING IN RATIONAL JUSTIFICATION AS TO OFFEND DUE PROCESS. PP. 611-612. 4. TERMINATION OF APPELLEE'S BENEFITS UNDER SEC. 202(N) DOES NOT AMOUNT TO PUNISHING HIM WITHOUT A TRIAL, IN VIOLATION OF ART. III, SEC. 2, CL. 3, OF THE CONSTITUTION OR THE SIXTH AMENDMENT; NOR IS SEC. 202(N) A BILL OF ATTAINDER OR EX POST FACTO LAW, SINCE ITS PURPOSE IS NOT PUNITIVE. PP. 612-621. FLEMMING , SECRETARY OF HEALTH, EDUCATION, AND WELFARE, V. NESTOR . APPEAL FROM THE UNITED STATES DISTRICT COURT FOR THE DISTRICT OF COLUMBIA. MR. JUSTICE HARLAN DELIVERED THE OPINON OF THE COURT. FROM A DECISION OF THE DISTRICT COURT FOR THE DISTRICT OF COLUMBIA HOLDING SEC. 202(N) OF THE SOCIAL SECURITY ACT (68 STAT. 1083, AS AMENDED, 42 U.S.C. SEC. 402(N)) UNCONSTITUTIONAL, THE SECRETARY OF HEALTH, EDUCATION, AND WELFARE TAKES THIS DIRECT APPEAL PURSUANT TO 28 U.S.C. SEC. 1252. THE CHALLENGED SECTION, SET FORTH IN FULL IN THE MARGIN, (FN1) PROVIDES FOR THE TERMINATION OF OLD-AGE, SURVIVOR, AND DISABILITY INSURANCE BENEFITS PAYABLE TO, OR IN CERTAIN CASES IN RESPECT OF, AN ALIEN INDIVIDUAL WHO, AFTER SEPTEMBER 1, 1954 (THE DATE OF ENACTMENT OF THE SECTION), IS DEPORTED UNDER SEC. 241(A) OF THE IMMIGRATION AND NATIONALITY ACT (8 U.S.C. SEC. 1251A)) ON ANY ONE OF CERTAIN GROUNDS SPECIFIED IN SEC. 202(N). APPELLEE, AN ALIEN, IMMIGRATED TO THIS COUNTRY FROM BULGARIA IN 1913, AND BECAME ELIGIBLE FOR OLD-AGE BENEFITS IN NOVEMBER 1955. IN JULY 1956 HE WAS DEPORTED PURSUANT TO SEC. 241(A)(6)(C)(I) OF THE IMMIGRATION AND NATIONALITY ACT FOR HAVING BEEN A MEMBER OF THE COMMUNIST PARTY FROM 1933 TO 1939. THIS BEING ONE OF THE BENEFIT TERMINATION DEPORTATION GROUNDS SPECIFIED IN SEC. 202(N), APPELLEE'S BENEFITS WERE TERMINATED SOON THEREAFTER, AND NOTICE OF THE TERMINATION WAS GIVEN TO HIS WIFE, WHO HAD REMAINED IN THIS COUNTRY. (FN2) UPON HIS FAILURE TO OBTAIN ADMINISTRATIVE REVERSAL OF THE DECISION, APPELLEE COMMENCED THIS ACTION IN THE DISTRICT COURT, PURSUANT TO SEC. 205(G) OF THE SOCIAL SECURITY ACT (53 STAT. 1370, AS AMENDED, 42 U.S.C. SEC. 405(G)), TO SECURE JUDICIAL REVIEW. (FN3) ON CROSS-MOTIONS FOR SUMMARY JUDGMENT, THE DISTRICT COURT RULED FOR APPELLEE, HOLDING SEC. 202(N) UNCONSTITUTIONAL UNDER THE DUE PROCESS CLAUSE OF THE FIFTH AMENDMENT IN THAT IT DEPRIVED APPELLEE OF AN ACCRUED PROPERTY RIGHT. 169 F. SUPP. 922. THE SECRETARY PROSECUTED AN APPEAL TO THIS COURT, AND, SUBJECT TO A JURISDICTIONAL QUESTION HEREINAFTER DISCUSSED, WE SET THE CASE DOWN FOR PLENARY HEARING. 360 U.S. 915. THE PRELIMINARY JURISDICTIONAL QUESTION IS WHETHER 28 U.S.C. SEC. 2282 IS APPLICABLE, AND THEREFORE REQUIRED THAT THE CASE BE HEARD BELOW BEFORE THREE JUDGES, RATHER THAN BY A SINGLE JUDGE, AS IT WAS. SECTION 2282 FORBIDS THE ISSUANCE, EXCEPT BY A THREE-JUDGE DISTRICT COURT, OF ANY \"INTERLOCUTORY OR PERMANENT INJUNCTION RESTRAINING THE ENFORCEMENT, OPERATION OR EXECUTION OF ANY ACT OF CONGRESS FOR REPUGNANCE TO THE CONSTITUTION ... .\" NEITHER PARTY REQUESTED A THREE-JUDGE COURT BELOW, AND IN THIS COURT BOTH PARTIES ARGUE THE INAPPLICABILITY OF SEC. 2282. IF THE PROVISION APPLIES, WE CANNOT REACH THE MERITS, BUT MUST VACATE THE JUDGMENT BELOW AND REMAND THE CASE FOR CONSIDERATION BY A THREE-JUDGE DISTRICT COURT. SEE FEDERAL HOUSING ADMINISTRATION V. THE DARLINGTON, INC., 352 U.S. 977. UNDER THE DECISIONS OF THIS COURT, THIS SEC. 205(G) ACTION COULD, AND DID, DRAW IN QUESTION THE CONSTITUTIONALITY OF SEC. 202(N). SEE, E.G., ANNISTON MFG. CO. V. DAVIS, 301 U.S. 337, 345-346. HOWEVER, THE ACTION DID NO MORE. IT DID NOT SEEK AFFIRMATIVELY TO INTERDICT THE OPERATION OF A STATUTORY SCHEME. A JUDGMENT FOR THE APPELLEE WOULD NOT PUT THE OPERATION OF A FEDERAL STATUTE UNDER THE RESTRAINT OF AN EQUITY DECREE; INDEED, APART FROM ITS EFFECT UNDER THE DOCTRINE OF STARE DECISIS, IT WOULD HAVE NO OTHER RESULT THAN TO REQUIRE THE PAYMENT OF APPELLEE'S BENEFITS. IN THESE CIRCUMSTANCES WE THINK THAT WHAT WAS SAID IN GARMENT WORKERS V. DONNELLY CO., 304 U.S. 243, WHERE THIS COURT DEALT WITH AN ANALOGOUS SITUATION, IS CONTROLLING HERE: \"THE PREDECESSOR OF SEC. 2282 DOES NOT PROVIDE FOR A CASE WHERE THE VALIDITY OF AN ACT OF CONGRESS IS MERELY DRAWN IN QUESTION, ALBEIT THAT QUESTION BE DECIDED, BUT ONLY FOR A CASE WHERE THERE IS AN APPLICATION FOR AN INTERLOCUTORY OR PERMANENT INJUNCTION TO RESTRAIN THE ENFORCEMENT OF AN ACT OF CONGRESS ... . HAD CONGRESS INTENDED THE PROVISION ... , FOR THREE JUDGES AND DIRECT APPEAL, TO APPLY WHENEVER A QUESTION OF THE VALIDITY OF AN ACT OF CONGRESS BECAME INVOLVED, CONGRESS WOULD NATURALLY HAVE USED THE FAMILIAR PHRASE 'DRAWN IN QUESTION' ... .\" ID., AT 250. WE HOLD THAT JURISDICTION OVER THE ACTION WAS PROPERLY EXERCISED BY THE DISTRICT COURT, AND THEREFORE REACH THE MERITS. I. WE THINK THAT THE DISTRICT COURT ERRED IN HOLDING THAT SEC. 202(N) DEPRIVED APPELLEE OF AN \"ACCRUED PROPERTY RIGHT.\" 169 F. SUPP., AT 934. APPELLEE'S RIGHT TO SOCIAL SECURITY BENEFITS CANNOT PROPERLY BE CONSIDERED TO HAVE BEEN OF THAT ORDER. THE GENERAL PURPOSES UNDERLYING THE SOCIAL SECURITY ACT WERE EXPOUNDED BY MR. JUSTICE CARDOZO IN HELVERING V. DAVIS, 301 U.S. 619, 640-645. THE ISSUE HERE, HOWEVER, REQUIRES SOME INQUIRY INTO THE STATUTORY SCHEME BY WHICH THOSE PURPOSES ARE SOUGHT TO BE ACHIEVED. PAYMENTS UNDER THE ACT ARE BASED UPON THE WAGE EARNER'S RECORD OF EARNINGS IN EMPLOYMENT OR SELF-EMPLOYMENT COVERED BY THE ACT, AND TAKE THE FORM OF OLD-AGE INSURANCE AND DISABILITY INSURANCE BENEFITS INURING TO THE WAGE EARNER (KNOWN AS THE \"PRIMARY BENEFICIARY\"), AND OF BENEFITS, INCLUDING SURVIVOR BENEFITS, PAYABLE TO NAMED DEPENDENTS (\"SECONDARY BENEFICIARIES\") OF A WAGE EARNER. BROADLY SPEAKING, ELIGIBILITY FOR BENEFITS DEPENDS ON SATISFYING STATUTORY CONDITIONS AS TO (1) EMPLOYMENT IN COVERED EMPLOYMENT OR SELF-EMPLOYMENT (SEE SEC. 210(A), 42 U.S.C. SEC. 410(A)); (2) THE REQUISITE NUMBER OF \"QUARTERS OF COVERAGE\" - I.E., THREE-MONTH PERIODS DURING WHICH NOT LESS THAN A STATED SUM WAS EARNED - THE NUMBER DEPENDING GENERALLY ON AGE (SEE SECS. 213-215, 42 U.S.C. SECS. 413-415); AND (3) ATTAINMENT OF THE RETIREMENT AGE (SEE SEC. 216(A), 42 U.S.C. SEC. 416(A)). SEC. 202(A), 42 U.S.C. SEC. 402(A). (FN4) ENTITLEMENT TO BENEFITS ONCE GAINED IS PARTIALLY OR TOTALLY LOST IF THE BENEFICIARY EARNS MORE THAN A STATED ANNUAL SUM, UNLESS HE OR SHE IS AT LEAST 72 YEARS OLD. SEC. 203(B), (E), 42 U.S.C. SEC. 403(B), (E). OF SPECIAL IMPORTANCE IN THIS CASE IS THE FACT THAT ELIGIBILITY FOR BENEFITS, AND THE AMOUNT OF SUCH BENEFITS, DO NOT IN ANY TRUE SENSE DEPEND ON CONTRIBUTION TO THE PROGRAM THROUGH THE PAYMENT OF TAXES, BUT RATHER ON THE EARNINGS RECORD OF THE PRIMARY BENEFICIARY. THE PROGRAM IS FINANCED THROUGH A PAYROLL TAX LEVIED ON EMPLOYEES IN COVERED EMPLOYMENT, AND ON THEIR EMPLOYERS. THE TAX RATE, WHICH IS A FIXED PERCENTAGE OF THE FIRST $4,800 OF EMPLOYEE ANNUAL INCOME, IS SET AT A SCALE WHICH WILL INCREASE FROM YEAR TO YEAR, PRESUMABLY TO KEEP PACE WITH RISING BENEFIT COSTS. I.R.C. OF 1954, SECS. 3101, 3111, 3121(A). THE TAX PROCEEDS ARE PAID INTO THE TREASURY \"AS INTERNAL REVENUE COLLECTIONS,\" I.R.C., SEC. 3501, AND EACH YEAR AN AMOUNT EQUAL TO THE PROCEEDS IS APPROPRIATED TO A TRUST FUND, FROM WHICH BENEFITS AND THE EXPENSES OF THE PROGRAM ARE PAID. SEC. 201, 42 U.S.C. SEC. 401. IT WAS EVIDENTLY CONTEMPLATED THAT RECEIPTS WOULD GREATLY EXCEED DISBURSEMENTS IN THE EARLY YEARS OF OPERATION OF THE SYSTEM, AND SURPLUS FUNDS ARE INVESTED IN GOVERNMENT OBLIGATIONS, AND THE INCOME RETURNED TO THE TRUST FUND. THUS, PROVISION IS MADE FOR EXPECTED INCREASING COSTS OF THE PROGRAM. THE SOCIAL SECURITY SYSTEM MAY BE ACCURATELY DESCRIBED AS A FORM OF SOCIAL INSURANCE, ENACTED PURSUANT TO CONGRESS' POWER TO \"SPEND MONEY IN AID OF THE 'GENERAL WELFARE,'\" HELVERING V. DAVIS, SUPRA, AT 640, WHEREBY PERSONS GAINFULLY EMPLOYED, AND THOSE WHO EMPLOY THEM, ARE TAXED TO PERMIT THE PAYMENT OF BENEFITS TO THE RETIRED AND DISABLED, AND THEIR DEPENDENTS. PLAINLY THE EXPECTATION IS THAT MANY MEMBERS OF THE PRESENT PRODUCTIVE WORK FORCE WILL IN TURN BECOME BENEFICIARIES RATHER THAN SUPPORTERS OF THE PROGRAM. BUT EACH WORKER'S BENEFITS, THOUGH FLOWING FROM THE CONTRIBUTIONS HE MADE TO THE NATIONAL ECONOMY WHILE ACTIVELY EMPLOYED, ARE NOT DEPENDENT ON THE DEGREE TO WHICH HE WAS CALLED UPON TO SUPPORT THE SYSTEM BY TAXATION. IT IS APPARENT THAT THE NONCONTRACTUAL INTEREST OF AN EMPLOYEE COVERED BY THE ACT CANNOT BE SOUNDLY ANALOGIZED TO THAT OF THE HOLDER OF AN ANNUITY, WHOSE RIGHT TO BENEFITS IS BOTTOMED ON HIS CONTRACTUAL PREMIUM PAYMENTS. IT IS HARDLY PROFITABLE TO ENGAGE IN CONCEPTUALIZATIONS REGARDING \"EARNED RIGHTS\" AND GRATUITIES.\" CF. LYNCH V. UNITED STATES, 292 U.S. 571, 576-577. THE \"RIGHT\" TO SOCIAL SECURITY BENEFITS IS IN ONE SENSE \"EARNED,\" FOR THE ENTIRE SCHEME RESTS ON THE LEGISLATIVE JUDGMENT THAT THOSE WHO IN THEIR PRODUCTIVE YEARS WERE FUNCTIONING MEMBERS OF THE ECONOMY MAY JUSTLY CALL UPON THAT ECONOMY, IN THEIR LATER YEARS, FOR PROTECTION FROM \"THE RIGORS OF THE POOR HOUSE AS WELL AS FROM THE HAUNTING FEAR THAT SUCH A LOT AWAITS THEM WHEN JOURNEY'S END IS NEAR.\" HELVERING V. DAVIS, SUPRA, AT 641. BUT THE PRACTICAL EFFECTUATION OF THAT JUDGMENT HAS OF NECESSITY CALLED FORTH A HIGHLY COMPLEX AND INTERRELATED STATUTORY STRUCTURE. INTEGRATED TREATMENT OF THE MANIFOLD SPECIFIC PROBLEMS PRESENTED BY THE SOCIAL SECURITY PROGRAM DEMANDS MORE THAN A GENERALIZATION. THAT PROGRAM WAS DESIGNED TO FUNCTION INTO THE INDEFINITE FUTURE, AND ITS SPECIFIC PROVISIONS REST ON PREDICTIONS AS TO EXPECTED ECONOMIC CONDITIONS WHICH MUST INEVITABLY PROVE LESS THAN WHOLLY ACCURATE, AND ON JUDGMENTS AND PREFERENCES AS TO THE PROPER ALLOCATION OF THE NATION'S RESOURCES WHICH EVOLVING ECONOMIC AND SOCIAL CONDITIONS WILL OF NECESSITY IN SOME DEGREE MODIFY. TO ENGRAFT UPON THE SOCIAL SECURITY SYSTEM A CONCEPT OF \"ACCRUED PROPERTY RIGHTS\" WOULD DEPRIVE IT OF THE FLEXIBILITY AND BOLDNESS IN ADJUSTMENT TO EVER-CHANGING CONDITIONS WHICH IT DEMANDS. SEE WOLLENBERG, VESTED RIGHTS IN SOCIAL-SECURITY BENEFITS, 37 ORE. L. REV. 299, 359. IT WAS DOUBTLESS OUT OF AN AWARENESS OF THE NEED FOR SUCH FLEXIBILITY THAT CONGRESS INCLUDED IN THE ORIGINAL ACT, AND HAS SINCE RETAINED, A CLAUSE EXPRESSLY RESERVING TO IT \"THE RIGHT TO ALTER, AMEND, OR REPEAL ANY PROVISION\" OF THE ACT. SEC. 1104, 49 STAT. 648, 42 U.S.C. SEC. 1304. THAT PROVISION MAKES EXPRESS WHAT IS IMPLICIT IN THE INSTITUTIONAL NEEDS OF THE PROGRAM. SEE ANALYSIS OF THE SOCIAL SECURITY SYSTEM, HEARINGS BEFORE A SUBCOMMITTEE OF THE COMMITTEE ON WAYS AND MEANS, HOUSE OF REPRESENTATIVES, 83D CONG., 1ST SESS., PP. 920 921. IT WAS PURSUANT TO THAT PROVISION THAT SEC. 202(N) WAS ENACTED. WE MUST CONCLUDE THAT A PERSON COVERED BY THE ACT HAS NOT SUCH A RIGHT IN BENEFIT PAYMENTS AS WOULD MAKE EVERY DEFEASANCE OF \"ACCRUED\" INTERESTS VIOLATIVE OF THE DUE PROCESS CLAUSE OF THE FIFTH AMENDMENT. II. THIS IS NOT TO SAY, HOWEVER, THAT CONGRESS MAY EXERCISE ITS POWER TO MODIFY THE STATUTORY SCHEME FREE OF ALL CONSTITUTIONAL RESTRAINT. THE INTEREST OF A COVERED EMPLOYEE UNDER THE ACT IS OF SUFFICIENT SUBSTANCE TO FALL WITHIN THE PROTECTION FROM ARBITRARY GOVERNMENTAL ACTION AFFORDED BY THE DUE PROCESS CLAUSE. IN JUDGING THE PERMISSIBILITY OF THE CUT-OFF PROVISIONS OF SEC. 202(N) FROM THIS STANDPOINT, IT IS NOT WITHIN OUR AUTHORITY TO DETERMINE WHETHER THE CONGRESSIONAL JUDGMENT EXPRESSED IN THAT SECTION IS SOUND OR EQUITABLE, OR WHETHER IT COMPORTS WELL OR ILL WITH THE PURPOSES OF THE ACT. \"WHETHER WISDOM OR UNWISDOM RESIDES IN THE SCHEME OF BENEFITS SET FORTH IN TITLE II, IT IS NOT FOR US TO SAY. THE ANSWER TO SUCH INQUIRIES MUST COME FROM CONGRESS, NOT THE COURTS. OUR CONCERN HERE, AS OFTEN, IS WITH POWER, NOT WITH WISDOM.\" HELVERING V. DAVIS, SUPRA, AT 644. PARTICULARLY WHEN WE DEAL WITH A WITHHOLDING OF A NONCONTRACTUAL BENEFIT UNDER A SOCIAL WELFARE PROGRAM SUCH AS THIS, WE MUST RECOGNIZE THAT THE DUE PROCESS CLAUSE CAN BE THOUGHT TO INTERPOSE A BAR ONLY IF THE STATUTE MANIFESTS A PATENTLY ARBITRARY CLASSIFICATION, UTTERLY LACKING IN RATIONAL JUSTIFICATION. SUCH IS NOT THE CASE HERE. THE FACT OF A BENEFICIARY'S RESIDENCE ABROAD - IN THE CASE OF A DEPORTEE, A PRESUMABLY PERMANENT RESIDENCE - CAN BE OF OBVIOUS RELEVANCE TO THE QUESTION OF ELIGIBILITY. ONE BENEFIT WHICH MAY BE THOUGHT TO ACCRUE TO THE ECONOMY FROM THE SOCIAL SECURITY SYSTEM IS THE INCREASED OVER-ALL NATIONAL PURCHASING POWER RESULTING FROM TAXATION OF PRODUCTIVE ELEMENTS OF THE ECONOMY TO PROVIDE PAYMENTS TO THE RETIRED AND DISABLED, WHO MIGHT OTHERWISE BE DESTITUTE OR NEARLY SO, AND WHO WOULD GENERALLY SPEND A COMPARATIVELY LARGE PERCENTAGE OF THEIR BENEFIT PAYMENTS. THIS ADVANTAGE WOULD BE LOST AS TO PAYMENTS MADE TO ONE RESIDING ABROAD. FOR THESE PURPOSES, IT IS, OF COURSE, CONSTITUTIONALLY IRRELEVANT WHETHER THIS REASONING IN FACT UNDERLAY THE LEGISLATIVE DECISION, AS IT IS IRRELEVANT THAT THE IN LOGIC APPLY. (FN5) SEE UNITED STATES V. PETRILLO, 332 U.S. 1, 8-9; STEWARD MACHINE CO. V. DAVIS, 301 U.S. 548, 584-585; CF. CARMICHAEL V. SOUTHERN COAL CO., 301 U.S. 495, 510-513. NOR, APART FROM THIS, CAN IT BE DEEMED IRRATIONAL FOR CONGRESS TO HAVE CONCLUDED THAT THE PUBLIC PURSE SHOULD NOT BE UTILIZED TO CONTRIBUTE TO THE SUPPORT OF THOSE DEPORTED ON THE GROUNDS SPECIFIED IN THE STATUTE. WE NEED GO NO FURTHER TO FIND SUPPORT FOR OUR CONCLUSION THAT THIS PROVISION OF THE ACT CANNOT BE CONDEMNED AS SO LACKING IN RATIONAL JUSTIFICATION AS TO OFFEND DUE PROCESS. III. THE REMAINING, AND MOST INSISTENTLY PRESSED, CONSTITUTIONAL OBJECTIONS REST UPON ART. I, SEC. 9, CL. 3, AND ART. III, SEC. 2, CL. 3, OF THE CONSTITUTION, AND THE SIXTH AMENDMENT. (FN6) IT IS SAID THAT THE TERMINATION OF APPELLEE'S BENEFITS AMOUNTS TO PUNISHING HIM WITHOUT A JUDICIAL TRIAL, SEE WONG WING V. UNITED STATES, 163 U.S. 228; THAT THE TERMINATION OF BENEFITS CONSTITUTES THE IMPOSITION OF PUNISHMENT BY LEGISLATIVE ACT, RENDERING SEC. 202(N) A BILL OF ATTAINDER\" SEE UNITED STATES V. LOVETT, 328 U.S. 303; CUMMINGS V. MISSOURI, 4 WALL. 277; AND THAT THE PUNISHMENT EXACTED IS IMPOSED FOR PAST CONDUCT NOT UNLAWFUL WHEN ENGAGED IN, THEREBY VIOLATING THE CONSTITUTIONAL PROHIBITION ON EX POST FACTO LAWS, SEE EX PARTE GARLAND, 4 WALL. 333. (FN7) ESSENTIAL TO THE SUCCESS OF EACH OF THESE CONTENTIONS IS THE VALIDITY OF CHARACTERIZING AS \"PUNISHMENT\" IN THE CONSTITUTIONAL SENSE THE TERMINATION OF BENEFITS UNDER SEC. 202(N). IN DETERMINING WHETHER LEGISLATION WHICH BASES A DISQUALIFICATION ON THE HAPPENING OF A CERTAIN PAST EVENT IMPOSES A PUNISHMENT, THE COURT HAS SOUGHT TO DISCERN THE OBJECTS ON WHICH THE ENACTMENT IN QUESTION WAS FOCUSED. WHERE THE SOURCE OF LEGISLATIVE CONCERN CAN BE THOUGHT TO BE THE ACTIVITY OR STATUS FROM WHICH THE INDIVIDUAL IS BARRED, THE DISQUALIFICATION IS NOT PUNISHMENT EVEN THOUGH IT MAY BEAR HARSHLY UPON ONE AFFECTED. THE CONTRARY IS THE CASE WHERE THE STATUTE IN QUESTION IS EVIDENTLY AIMED AT THE PERSON OR CLASS OF PERSONS DISQUALIFIED. IN THE EARLIEST CASE ON WHICH APPELLEE RELIES, A CLERGYMAN SUCCESSFULLY CHALLENGED A STATE CONSTITUTIONAL PROVISION BARRING FROM THAT PROFESSION - AND FROM MANY OTHER PROFESSIONS AND OFFICES - ALL WHO WOULD NOT SWEAR THAT THEY HAD NEVER MANIFESTED ANY SYMPATHY OR SUPPORT FOR THE CAUSE OF THE CONFEDERACY. CUMMINGS V. MISSOURI, SUPRA. THE COURT THUS DESCRIBED THE AIMS OF THE CHALLENGED ENACTMENT: \"THE OATH COULD NOT ... HAVE BEEN REQUIRED AS A MEANS OF ASCERTAINING WHETHER PARTIES WERE QUALIFIED OR NOT FOR THEIR RESPECTIVE CALLINGS OR THE TRUSTS WITH WHICH THEY WERE CHARGED. IT WAS REQUIRED IN ORDER TO REACH THE PERSON, NOT THE CALLING. IT WAS EXACTED, NOT FROM ANY NOTION THAT THE SEVERAL ACTS DESIGNATED INDICATED UNFITNESS FOR THE CALLINGS, BUT BECAUSE IT WAS THOUGHT THAT THE SEVERAL ACTS DESERVED PUNISHMENT ... .\" ID., AT 320. ONLY THE OTHER DAY THE GOVERNING INQUIRY WAS STATED, IN AN OPINION JOINED BY FOUR MEMBERS OF THE COURT, IN THESE TERMS: \"THE QUESTION IN EACH CASE WHERE UNPLEASANT CONSEQUENCES ARE BROUGHT TO BEAR UPON AN INDIVIDUAL FOR PRIOR CONDUCT, IS WHETHER THE LEGISLATIVE AIM WAS TO PUNISH THAT INDIVIDUAL FOR PAST ACTIVITY, OR WHETHER THE RESTRICTION OF THE INDIVIDUAL COMES ABOUT AS A RELEVANT INCIDENT TO A REGULATION OF A PRESENT SITUATION, SUCH AS THE PROPER QUALIFICATIONS FOR A PROFESSION.\" DE VEAU V. BRAISTED, 363 U.S. 144, 160 (PLURALITY OPINION). IN EX PARTE GARLAND, SUPRA, WHERE THE COURT STRUCK DOWN AN OATH - SIMILAR IN CONTENT TO THAT INVOLVED IN CUMMINGS - REQUIRED OF ATTORNEYS SEEKING TO PRACTICE BEFORE ANY FEDERAL COURT, AS ALSO IN CUMMINGS, THE FINDING OF PUNITIVE INTENT DREW HEAVILY ON THE COURT'S FIRST-HAND ACQUAINTANCE WITH THE EVENTS AND THE MOOD OF THE THEN RECENT CIVIL WAR, AND \"THE FIERCE PASSIONS WHICH THAT STRUGGLE AROUSED.\" CUMMINGS V. MISSOURI, SUPRA, AT 322. (FN8) SIMILARLY, IN UNITED STATES V. LOVETT, SUPRA, WHERE THE COURT INVALIDATED, AS A BILL OF ATTAINDER, A STATUTE FORBIDDING - SUBJECT TO CERTAIN CONDITIONS - THE FURTHER PAYMENT OF THE SALARIES OF THREE NAMED GOVERNMENT EMPLOYEES, THE DETERMINATION THAT A PUNISHMENT HAD BEEN IMPOSED RESTED IN LARGE MEASURE ON THE SPECIFIC CONGRESSIONAL HISTORY WHICH THE COURT WAS AT PAINS TO SPELL OUT IN DETAIL. SEE 328 U.S., AT 308-312. MOST RECENTLY, IN TROP V. DULLES, 356 U.S. 86, WHICH HELD UNCONSTITUTIONAL A STATUTE PROVIDING FOR THE EXPATRIATION OF ONE WHO HAD BEEN SENTENCED BY A COURT-MARTIAL TO DISMISSAL OR DISHONORABLE DISCHARGE FOR WARTIME DESERTION, THE MAJORITY OF THE COURT CHARACTERIZED THE STATUTE AS PUNITIVE. HOWEVER, NO SINGLE OPINION COMMANDED THE SUPPORT OF A MAJORITY. THE PLURALITY OPINION RESTED ITS DETERMINATION, AT LEAST IN PART, ON ITS INABILITY TO DISCERN ANY ALTERNATIVE PURPOSE WHICH THE STATUTE COULD BE THOUGHT TO SERVE. ID., AT 97. THE CONCURRING OPINION FOUND IN THE SPECIFIC HISTORICAL EVOLUTION OF THE PROVISION IN QUESTION COMPELLING EVIDENCE OF PUNITIVE INTENT. ID., AT 107-109. IT IS THUS APPARENT THAT, THOUGH THE GOVERNING CRITERION MAY BE READILY STATED, EACH CASE HAS TURNED ON ITS OWN HIGHLY PARTICULARIZED CONTEXT. WHERE NO PERSUASIVE SHOWING OF A PURPOSE \"TO REACH THE PERSON, NOT THE CALLING,\" CUMMINGS V. MISSOURI, SUPRA, AT 320, HAS BEEN MADE, THE COURT HAS NOT HAMPERED LEGISLATIVE REGULATION OF ACTIVITIES WITHIN ITS SPHERE OF CONCERN, DESPITE THE OFTEN-SEVERE EFFECTS SUCH REGULATION HAS HAD ON THE PERSONS SUBJECT TO IT. (FN9) THUS, DEPORTATION HAS BEEN HELD TO BE NOT PUNISHMENT, BUT AN EXERCISE OF THE PLENARY POWER OF CONGRESS TO FIX THE CONDITIONS UNDER WHICH ALIENS ARE TO BE PERMITTED TO ENTER AND REMAIN IN THIS COUNTRY. FONG YUE TING V. UNITED STATES, 149 U.S. 698, 730; SEE GALVAN V. PRESS, 347 U.S. 522, 530-531. SIMILARLY, THE SETTING BY A STATE OF QUALIFICATIONS FOR THE PRACTICE OF MEDICINE, AND THEIR MODIFICATION FROM TIME TO TIME, IS AN INCIDENT OF THE STATE'S POWER TO PROTECT THE HEALTH AND SAFETY OF ITS CITIZENS, AND ITS DECISION TO BAR FROM PRACTICE PERSONS WHO COMMIT OR HAVE COMMITTED A FELONY IS TAKEN AS EVIDENCING AN INTENT TO EXERCISE THAT REGULATORY POWER, AND NOT A PURPOSE TO ADD TO THE PUNISHMENT OF EX FELONS. HAWKER V. NEW YORK, 170 U.S. 189. SEE DE VEAU V. BRAISTED, SUPRA (REGULATION OF CRIME ON THE WATERFRONT THROUGH DISQUALIFICATION OF EX-FELONS FROM HOLDING UNION OFFICE). CF. HELVERING V. MITCHELL, 303 U.S. 391, 397-401, HOLDING THAT, WITH RESPECT TO DEFICIENCIES DUE TO FRAUD, A 50 PERCENT ADDITION TO THE TAX IMPOSED WAS NOT PUNISHMENT SO AS TO PREVENT, UPON PRINCIPLES OF DOUBLE JEOPARDY, ITS ASSESSMENT AGAINST ONE ACQUITTED OF TAX EVASION. TURNING, THEN, TO THE PARTICULAR STATUTORY PROVISION BEFORE US, APPELLEE CANNOT SUCCESSFULLY CONTEND THAT THE LANGUAGE AND STRUCTURE OF SEC. 202(N), OR THE NATURE OF THE DEPRIVATION, REQUIRES US TO RECOGNIZE A PUNITIVE DESIGN. CF. WONG WING V. UNITED STATES, SUPRA (IMPRISONMENT, AT HARD LABOR UP TO ONE YEAR, OF PERSON FOUND TO BE UNLAWFULLY IN THE COUNTRY). HERE THE SANCTION IS THE MERE DENIAL OF A NONCONTRACTUAL GOVERNMENTAL BENEFIT. NO AFFIRMATIVE DISABILITY OR RESTRAINT IS IMPOSED, AND CERTAINLY NOTHING APPROACHING THE \"INFAMOUS PUNISHMENT\" OF IMPRISONMENT, AS IN WONG WING, ON WHICH GREAT RELIANCE IS MISTAKENLY PLACED. MOREOVER, FOR REASONS ALREADY GIVEN (ANTE, PP. 611-612), IT CANNOT BE SAID, AS WAS SAID OF THE STATUTE IN CUMMINGS V. MISSOURI, SUPRA, AT 319; SEE DENT V. WEST VIRGINIA, 129 U.S. 114, 126, THAT THE DISQUALIFICATION OF CERTAIN DEPORTEES FROM RECEIPT OF SOCIAL SECURITY BENEFITS WHILE THEY ARE NOT LAWFULLY IN THIS COUNTRY BEARS NO RATIONAL CONNECTION TO THE PURPOSES OF THE LEGISLATION OF WHICH IT IS A PART, AND MUST WITHOUT MORE THEREFORE BE TAKEN AS EVIDENCING A CONGRESSIONAL DESIRE TO PUNISH. APPELLEE ARGUES, HOWEVER, THAT THE HISTORY AND SCOPE OF SEC. 202(N) PROVE THAT NO SUCH POSTULATED PURPOSE CAN BE THOUGHT TO HAVE MOTIVATED THE LEGISLATURE, AND THAT THEY PERSUASIVELY SHOW THAT A PUNITIVE PURPOSE IN FACT LAY BEHIND THE STATUTE. WE DO NOT AGREE. WE OBSERVE INITIALLY THAT ONLY THE CLEAREST PROOF COULD SUFFICE TO ESTABLISH THE UNCONSTITUTIONALITY OF A STATUTE ON SUCH A GROUND. JUDICIAL INQUIRIES INTO CONGRESSIONAL MOTIVES ARE AT BEST A HAZARDOUS MATTER, AND WHEN THAT INQUIRY SEEKS TO GO BEHIND OBJECTIVE MANIFESTATIONS IT BECOMES A DUBIOUS AFFAIR INDEED. MOREOVER, THE PRESUMPTION OF CONSTITUTIONALITY WITH WHICH THIS ENACTMENT, LIKE ANY OTHER, COMES TO US FORBIDS US LIGHTLY TO CHOOSE THAT READING OF THE STATUTE'S SETTING WHICH WILL INVALIDATE IT OVER THAT WHICH WILL SAVE IT. \"IT IS NOT ON SLIGHT IMPLICATION AND VAGUE CONJECTURE THAT THE LEGISLATURE IS TO BE PRONOUNCED TO HAVE TRANSCENDED ITS POWERS, AND ITS ACTS TO BE CONSIDERED AS VOID.\" FLETCHER V. PECK, 6 CRANCH 87, 128. OF THE SOCIAL SECURITY PROGRAM. THE PROVISION ORIGINATED IN THE HOUSE OF REPRESENTATIVES. H.R. 9366, 83D CONG., 2D SESS., SEC. 108. THE DISCUSSION IN THE HOUSE COMMITTEE REPORT, H.R. REP. NO. 1698, 83D CONG., 2D SESS., PP. 5, 25, 77, DOES NOT EXPRESS THE PURPOSE OF THE STATUTE. HOWEVER, IT DOES SAY THAT THE TERMINATION OF BENEFITS WOULD APPLY TO THOSE PERSONS WHO WERE \"DEPORTED FROM THE UNITED STATES BECAUSE OF ILLEGAL ENTRY, CONVICTION OF A CRIME, OR SUBVERSIVE ACTIVITY ... .\" ID., AT 25. IT WAS EVIDENTLY THE THOUGHT THAT SUCH WAS THE SCOPE OF THE STATUTE RESULTING FROM ITS APPLICATION TO DEPORTATION UNDER THE 14 NAMED PARAGRAPHS OF SEC. 241(A) OF THE IMMIGRATION AND NATIONALITY ACT. ID., AT 77. (FN10) THE SENATE COMMITTEE REJECTED THE PROPOSAL FOR THE STATED REASON THAT IT HAD \"NOT HAD AN OPPORTUNITY TO GIVE SUFFICIENT STUDY TO ALL THE POSSIBLE IMPLICATIONS OF THIS PROVISION, WHICH INVOLVES TERMINATION OF BENEFIT RIGHTS UNDER THE CONTRIBUTORY PROGRAM OF OLD-AGE AND SURVIVORS INSURANCE ... .\" S. REP. NO. 1987, 83D CONG., 2D SESS., P. 23; SEE ALSO ID., AT 76. HOWEVER, IN CONFERENCE, THE PROPOSAL WAS RESTORED IN MODIFIED FORM, (FN11) AND AS MODIFIED WAS ENACTED AS SEC. 202(N). SEE H.R. CONF. REP. NO. 2679, 83D CONG., 2D SESS., P. 18. APPELLEE ARGUES THAT THIS HISTORY DEMONSTRATES THAT CONGRESS WAS NOT CONCERNED WITH THE FACT OF A BENEFICIARY'S DEPORTATION - WHICH IT IS CLAIMED ALONE WOULD JUSTIFY THIS LEGISLATION AS BEING PURSUANT TO A POLICY RELEVANT TO REGULATION OF THE SOCIAL SECURITY SYSTEM - BUT THAT IT SOUGHT TO REACH CERTAIN GROUNDS FOR DEPORTATION, THUS EVIDENCING A PUNITIVE INTENT. (FN12) IT IS IMPOSSIBLE TO FIND IN THE MEAGRE HISTORY THE UNMISTAKABLE EVIDENCE OF PUNITIVE INTENT WHICH, UNDER PRINCIPLES ALREADY DISCUSSED, IS REQUIRED BEFORE A CONGRESSIONAL ENACTMENT OF THIS KIND MAY BE STRUCK DOWN. EVEN WERE THAT HISTORY TO BE TAKEN AS EVIDENCING CONGRESS' CONCERN WITH THE GROUNDS, RATHER THAN THE FACT, OF DEPORTATION, WE DO NOT THINK THAT THIS, STANDING ALONE, WOULD SUFFICE TO ESTABLISH A PUNITIVE PURPOSE. THIS WOULD STILL BE A FAR CRY FROM THE SITUATIONS INVOLVED IN SUCH CASES AS CUMMINGS, WONG WING, AND GARLAND (SEE ANTE, P. 617), AND FROM THAT IN LOVETT, SUPRA, WHERE THE LEGISLATION WAS ON ITS FACE AIMED AT PARTICULAR INDIVIDUALS. THE LEGISLATIVE RECORD, HOWEVER, FALLS SHORT OF ANY PERSUASIVE SHOWING THAT CONGRESS WAS IN FACT CONCERNED ALONE WITH THE GROUNDS OF DEPORTATION. TO BE SURE CONGRESS DID NOT APPLY THE TERMINATION PROVISION TO ALL DEPORTEES. HOWEVER, IT IS EVIDENT THAT NEITHER DID IT REST THE OPERATION OF THE STATUTE ON THE OCCURRENCE OF THE UNDERLYING ACT. THE FACT OF DEPORTATION ITSELF REMAINED AN ESSENTIAL CONDITION FOR LOSS OF BENEFITS, AND EVEN IF A BENEFICIARY WERE SAVED FROM DEPORTATION ONLY THROUGH DISCRETIONARY SUSPENSION BY THE ATTORNEY GENERAL UNDER SEC. 244 OF THE IMMIGRATION AND NATIONALITY ACT (66 STAT. 214, 8 U.S.C. SEC. 1254), SEC. 202(N) WOULD NOT REACH HIM. MOREOVER, THE GROUNDS FOR DEPORTATION REFERRED TO IN THE COMMITTEE REPORT EMBRACE THE GREAT MAJORITY OF THOSE DEPORTED, AS IS EVIDENT FROM AN EXAMINATION OF THE FOUR OMITTED GROUNDS, SUMMARIZED IN THE MARGIN. (FN13) INFERENCES DRAWN FROM THE OMISSION OF THOSE GROUNDS CANNOT ESTABLISH, TO THE DEGREE OF CERTAINTY REQUIRED, THAT CONGRESSIONAL CONCERN WAS WHOLLY WITH THE ACTS LEADING TO DEPORTATION, AND NOT WITH THE FACT OF DEPORTATION. (FN14) TO HOLD OTHERWISE WOULD BE TO REST ON THE \"SLIGHT IMPLICATION AND VAGUE CONJECTURE\" AGAINST WHICH CHIEF JUSTICE MARSHALL WARNED. FLETCHER V. PECK, SUPRA, AT 128. THE SAME ANSWER MUST BE MADE TO ARGUMENTS DRAWN FROM THE FAILURE OF CONGRESS TO APPLY SEC. 202(N) TO BENEFICIARIES VOLUNTARILY RESIDING ABROAD. BUT CF. SEC. 202(T), ANTE, NOTE 5. CONGRESS MAY HAVE FAILED TO CONSIDER SUCH PERSONS; OR IT MAY HAVE THOUGHT THEIR NUMBER TOO SLIGHT, OR THE PERMANENCE OF THEIR VOLUNTARY RESIDENCE ABROAD TOO UNCERTAIN, TO WARRANT APPLICATION OF THE STATUTE TO THEM, WITH ITS ATTENDANT ADMINISTRATIVE PROBLEMS OF SUPERVISION AND ENFORCEMENT. AGAIN, WE CANNOT WITH CONFIDENCE REJECT ALL THOSE ALTERNATIVES WHICH IMAGINATIVENESS CAN BRING TO MIND, SAVE THAT ONE WHICH MIGHT REQUIRE THE INVALIDATION OF THE STATUTE. REVERSED. FOOTNOTES Footnote 1- SECTION 202(N) PROVIDES AS FOLLOWS: \"(N)(1) IF ANY INDIVIDUAL IS (AFTER THE DATE OF ENACTMENT OF THIS SUBSECTION) DEPORTED UNDER PARAGRAPH (1), (2), (4), (5), (6), (7), (10), (11), (12), (14), (15), (16), (17), OR (18) OF SECTION 241(A) OF THE IMMIGRATION AND NATIONALITY ACT, THEN, NOTWITHSTANDING ANY OTHER PROVISIONS OF THIS TITLE: \"(A) NO MONTHLY BENEFIT UNDER THIS SECTION OR SECTION 223 (42 U.S.C. SEC. 423, RELATING TO \"DISABILITY INSURANCE BENEFITS\") SHALL BE PAID TO SUCH INDIVIDUAL, ON THE BASIS OF HIS WAGES AND SELF-EMPLOYMENT INCOME, FOR ANY MONTH OCCURRING (I) AFTER THE MONTH IN WHICH THE SECRETARY IS NOTIFIED BY THE ATTORNEY GENERAL THAT SUCH INDIVIDUAL HAS BEEN SO DEPORTED, AND (II) BEFORE THE MONTH IN WHICH SUCH INDIVIDUAL IS THEREAFTER LAWFULLY ADMITTED TO THE UNITED STATES FOR PERMANENT RESIDENCE: \"(B) IF NO BENEFIT COULD BE PAID TO SUCH INDIVIDUAL (OR IF NO BENEFIT COULD BE PAID TO HIM IF HE WERE ALIVE) FOR ANY MONTH BY REASON OF SUBPARAGRAPH (A), NO MONTHLY BENEFIT UNDER THIS SECTION SHALL BE PAID, ON THE BASIS OF HIS WAGES AND SELF-EMPLOYMENT INCOME, FOR SUCH MONTH TO ANY OTHER PERSON WHO IS NOT A CITIZEN OF THE UNITED STATES AND IS OUTSIDE THE UNITED STATES FOR ANY PART OF SUCH MONTH, AND: \"(C) NO LUMP-SUM DEATH PAYMENT SHALL BE MADE ON THE BASIS OF SUCH INDIVIDUAL'S WAGES AND SELF-EMPLOYMENT INCOME IF HE DIES (I) IN OR AFTER THE MONTH IN WHICH SUCH NOTICE IS RECEIVED, AND (II) BEFORE THE MONTH IN WHICH HE IS THEREAFTER LAWFULLY ADMITTED TO THE UNITED STATES FOR PERMANENT RESIDENCE. \"SECTION 203(B) AND (C) OF THIS ACT SHALL NOT APPLY WITH RESPECT TO ANY SUCH INDIVIDUAL FOR ANY MONTH FOR WHICH NO MONTHLY BENEFIT MAY BE PAID TO HIM BY REASON OF THIS PARAGRAPH. \"(2) AS SOON AS PRACTICABLE AFTER THE DEPORTATION OF ANY INDIVIDUAL UNDER ANY OF THE PARAGRAPHS OF SECTION 241(A) OF THE IMMIGRATION AND NATIONALITY ACT ENUMERATED IN PARAGRAPH (1) IN THIS SUBSECTION, THE ATTORNEY GENERAL SHALL NOTIFY THE SECRETARY OF SUCH DEPORTATION.\" THE PROVISIONS OF SEC. 241(A) OF THE IMMIGRATION AND NATIONALITY ACT ARE SUMMARIZED IN NOTES 10, 13, POST, PP. 618, 620. Footnote 2- UNDER PARAGRAPH (1)(B) OF SEC. 202(N) (SEE NOTE 1, ANTE), APPELLEE'S WIFE, BECAUSE OF HER RESIDENCE HERE, HAS REMAINED ELIGIBLE FOR BENEFITS PAYABLE TO HER AS THE WIFE OF AN INSURED INDIVIDUAL. SEE SEC. 202(B), 53 STAT. 1364, AS AMENDED, 42 U.S.C. SEC. 402(B). Footnote 3- SECTION 205(G) PROVIDES AS FOLLOWS: \"(G) ANY INDIVIDUAL, AFTER ANY FINAL DECISION OF THE BOARD MADE AFTER A HEARING TO WHICH HE WAS A PARTY, IRRESPECTIVE OF THE AMOUNT IN CONTROVERSY, MAY OBTAIN A REVIEW OF SUCH DECISION BY A CIVIL ACTION COMMENCED WITHIN SIXTY DAYS AFTER THE MAILING TO HIM OF NOTICE OF SUCH DECISION OR WITHIN SUCH FURTHER TIME AS THE BOARD MAY ALLOW ... . AS PART OF ITS ANSWER THE BOARD SHALL FILE A CERTIFIED COPY OF THE TRANSCRIPT OF THE RECORD INCLUDING THE EVIDENCE UPON WHICH THE FINDINGS AND DECISION COMPLAINED OF ARE BASED. THE COURT SHALL HAVE POWER TO ENTER, UPON THE PLEADINGS AND TRANSCRIPT OF THE RECORD, A JUDGMENT AFFIRMING, MODIFYING, OR REVERSING THE DECISION OF THE BOARD, WITH OR WITHOUT REMANDING THE CAUSE FOR A REHEARING. THE FINDINGS OF THE BOARD AS TO ANY FACT, IF SUPPORTED BY SUBSTANTIAL EVIDENCE, SHALL BE CONCLUSIVE ... . THE JUDGMENT OF THE COURT SHALL BE FINAL EXCEPT THAT IT SHALL BE SUBJECT TO REVIEW IN THE SAME MANNER AS A JUDGMENT IN OTHER CIVIL ACTIONS.\" Footnote 4- IN ADDITION, ELIGIBILITY FOR DISABILITY INSURANCE BENEFITS IS OF COURSE SUBJECT TO THE FURTHER CONDITION OF THE INCURRING OF A DISABILITY AS DEFINED IN THE ACT. SEC. 223, 42 U.S.C. SEC. 423. SECONDARY BENEFICIARIES MUST MEET THE TESTS OF FAMILY RELATIONSHIP TO THE WAGE EARNER SET FORTH IN THE ACT. SEC. 202(B)-(H), 42 U.S.C. SEC. 402(B)-(H). Footnote 5- THE ACT DOES NOT PROVIDE FOR THE TERMINATION OF BENEFITS OF NON RESIDENT CITIZENS, OR OF SOME ALIENS WHO LEAVE THE COUNTRY VOLUNTARILY ALTHOUGH MANY NONRESIDENT ALIENS DO LOSE THEIR ELIGIBILITY BY VIRTUE OF THE PROVISIONS OF SEC. 202(T), 70 STAT. 835, AS AMENDED, 42 U.S.C. SEC. 402(T) - OR OF ALIENS DEPORTED PURSUANT TO PARAGRAPHS 3, 8, 9, OR 13 OF THE 18 PARAGRAPHS OF SEC. 241(A) OF THE IMMIGRATION AND NATIONALITY ACT. SEE NOTE 13, POST. Footnote 6- ART. I, SEC. 9, CL. 3: \"NO BILL OF ATTAINDER OR EX POST FACTO LAW SHALL BE PASSED.\" ART. III, SEC. 2, CL. 3: \"THE TRIAL OF ALL CRIMES, EXCEPT IN CASES OF IMPEACHMENT, SHALL BE BY JURY; AND SUCH TRIAL SHALL BE HELD IN THE STATE WHERE THE SAID CRIMES SHALL HAVE BEEN COMMITTED ... .\" AMEND. VI: \"IN ALL CRIMINAL PROSECUTIONS THE ACCUSED SHALL ENJOY THE RIGHT TO A SPEEDY AND PUBLIC TRIAL, BY AN IMPARTIAL JURY OF THE STATE AND DISTRICT WHEREIN THE CRIME SHALL HAVE BEEN COMMITTED, WHICH DISTRICT SHALL HAVE BEEN PREVIOUSLY ASCERTAINED BY LAW, AND TO BE INFORMED OF THE NATURE AND CAUSE OF THE ACCUSATION; TO BE CONFRONTED WITH THE WITNESSES AGAINST HIM; TO HAVE COMPULSORY PROCESS FOR OBTAINING WITNESSES IN HIS FAVOUR; AND TO HAVE THE ASSISTANCE OF COUNSEL FOR HIS DEFENCE.\" Footnote 7- APPELLEE ALSO ADDS, BUT HARDLY ARGUES, THE CONTENTION THAT HE HAS BEEN DEPRIVED OF HIS RIGHTS UNDER THE FIRST AMENDMENT, SINCE THE ADVERSE CONSEQUENCES STEMMED FROM \"MERE PAST MEMBERSHIP\" IN THE COMMUNIST PARTY. THIS CONTENTION, WHICH IS NO MORE THAN A COLLATERAL ATTACK ON APPELLEE'S DEPORTATION, IS NOT OPEN TO HIM. Footnote 8- SEE ALSO PIERCE V. CARSKADON, 16 WALL. 234. A WEST VIRGINIA STATUTE PROVIDING THAT A NONRESIDENT WHO HAD SUFFERED A JUDGMENT IN AN ACTION COMMENCED BY ATTACHMENT, BUT IN WHICH HE HAD NOT BEEN PERSONALLY SERVED AND DID NOT APPEAR, COULD WITHIN ONE YEAR PETITION THE COURT FOR A REOPENING OF THE JUDGMENT AND A TRIAL ON THE MERITS, WAS AMENDED IN 1865 SO AS TO CONDITION THAT RIGHT ON THE TAKING OF AN EXCULPATORY OATH THAT THE DEFENDANT HAD NEVER SUPPORTED THE CONFEDERACY. ON THE AUTHORITY OF CUMMINGS AND GARLAND, THE AMENDMENT WAS INVALIDATED. Footnote 9- AS PRIOR DECISIONS MAKE CLEAR, COMPARE EX PARTE GARLAND, SUPRA, WITH HAWKER V. NEW YORK, SUPRA, THE SEVERITY OF A SANCTION IS NOT DETERMINATIVE OF ITS CHARACTER AS \"PUNISHMENT.\" Footnote 10- PARAGRAPHS (1), (2), AND (10) OF SEC. 241(A) RELATE TO UNLAWFUL ENTRY, OR ENTRY NOT COMPLYING WITH CERTAIN CONDITIONS; PARAGRAPHS (6) AND (7) APPLY TO \"SUBVERSIVE\" AND RELATED ACTIVITIES; THE REMAINDER OF THE INCLUDED PARAGRAPHS ARE CONCERNED WITH CONVICTIONS OF DESIGNATED CRIMES, OR THE COMMISSION OF ACTS RELATED TO THEM, SUCH AS NARCOTICS ADDICTION OR PROSTITUTION. Footnote 11- FOR EXAMPLE, UNDER THE HOUSE VERSION TERMINATION OF BENEFITS OF A DEPORTEE WOULD ALSO HAVE TERMINATED BENEFITS PAID TO SECONDARY BENEFICIARIES BASED ON THE EARNING RECORDS OF THE DEPORTEE. THE CONFERENCE PROPOSAL LIMITED THIS EFFECT TO SECONDARY BENEFICIARIES WHO WERE NONRESIDENT ALIENS. SEE NOTE 2, ANTE. Footnote 12- APPELLEE ALSO RELIES ON THE JUXTAPOSITION OF THE PROPOSED SEC. 108 AND CERTAIN OTHER PROVISIONS, SOME OF WHICH WERE ENACTED AND SOME OF WHICH WERE NOT. THIS ARGUMENT IS TOO CONJECTURAL TO WARRANT DISCUSSION. IN ADDITION, RELIANCE IS PLACED ON A LETTER WRITTEN TO THE SENATE FINANCE COMMITTEE BY APPELLANT'S PREDECESSOR IN OFFICE, OPPOSING THE ENACTMENT OF WHAT IS NOW SEC. 202(U) OF THE ACT, 70 STAT. 838, 42 U.S.C. SEC. 402(U), ON THE GROUND THAT THE SECTION WAS \"IN THE NATURE OF A PENALTY AND BASED ON CONSIDERATIONS FOREIGN TO THE OBJECTIVES\" OF THE PROGRAM. SOCIAL SECURITY AMENDMENTS OF 1955, HEARINGS BEFORE THE SENATE COMMITTEE ON FINANCE, 84TH CONG., 2D SESS., P. 1319. THE SECRETARY WENT ON TO SAY THAT \"PRESENT LAW RECOGNIZES ONLY THREE NARROWLY LIMITED EXCEPTIONS (OF WHICH SEC. 202(N) IS ONE) TO THE BASIC PRINCIPLE THAT BENEFITS ARE PAID WITHOUT REGARD TO THE ATTITUDES, OPINIONS, BEHAVIOR, OR PERSONAL CHARACTERISTICS OF THE INDIVIDUAL ... .\" IT SHOULD BE OBSERVED, HOWEVER, THAT THE SECRETARY DID NOT SPEAK OF SEC. 202(N) AS A PENALTY, AS HE DID OF THE PROPOSED SEC. 202(U). THE LATTER PROVISION IS CONCEDEDLY PENAL, AND APPLIES ONLY PURSUANT TO A JUDGMENT OF A COURT IN A CRIMINAL CASE. Footnote 13- THEY ARE: (1) PERSONS INSTITUTIONALIZED AT PUBLIC EXPENSE WITHIN FIVE YEARS AFTER ENTRY BECAUSE OF \"MENTAL DISEASE, DEFECT, OR DEFICIENCY\" NOT SHOWN TO HAVE ARISEN SUBSEQUENT TO ADMISSION (SEC. 241(A)(3)); (2) PERSONS BECOMING A PUBLIC CHARGE WITHIN FIVE YEARS AFTER ENTRY FROM CAUSES NOT SHOWN TO HAVE ARISEN SUBSEQUENT TO ADMISSION SEC. 241(A)(8)); (3) PERSONS ADMITTED AS NONIMMIGRANTS (SEE SEC. 101(A)(15), 66 STAT. 167, 8 U.S.C. SEC. 1101(A)(15)) WHO FAIL TO MAINTAIN, OR COMPLY WITH THE CONDITIONS OF, SUCH STATUS (SEC. 241(A)(9)); (4) PERSONS KNOWINGLY AND FOR GAIN INDUCING OR AIDING, PRIOR TO OR WITHIN FIVE YEARS AFTER ENTRY, ANY OTHER ALIEN TO ENTER OR ATTEMPT TO ENTER UNLAWFULLY (SEC. 241(A)(13)). Footnote 14- WERE WE TO ENGAGE IN SPECULATION, IT WOULD NOT BE DIFFICULT TO CONJECTURE THAT CONGRESS MAY HAVE BEEN LED TO EXCLUDE THESE FOUR GROUNDS OF DEPORTATION OUT OF COMPASSIONATE OR DE MINIMIS CONSIDERATIONS. MR. JUSTICE BLACK, DISSENTING. FOR THE REASONS STATED HERE AND IN THE DISSENTS OF MR. JUSTICE DOUGLAS AND MR. JUSTICE BRENNAN I AGREE WITH THE DISTRICT COURT THAT THE UNITED STATES IS DEPRIVING APPELLEE, EPHRAM NESTOR, OF HIS STATUTORY RIGHT TO OLD-AGE BENEFITS IN VIOLATION OF THE UNITED STATES CONSTITUTION. NESTOR CAME TO THIS COUNTRY FROM BULGARIA IN 1913 AND LIVED HERE CONTINUOUSLY FOR 43 YEARS, UNTIL JULY 1956. HE WAS THEN DEPORTED FROM THIS COUNTRY FOR HAVING BEEN A COMMUNIST FROM 1933 TO 1939. AT THAT TIME MEMBERSHIP IN THE COMMUNIST PARTY AS SUCH WAS NOT ILLEGAL AND WAS NOT EVEN A STATUTORY GROUND FOR DEPORTATION. FROM DECEMBER 1936 TO JANUARY 1955 NESTOR AND HIS EMPLOYERS MADE REGULAR PAYMENTS TO THE GOVERNMENT UNDER THE FEDERAL INSURANCE CONTRIBUTIONS ACT, 26 U.S.C. SECS. 3101-3125. THESE FUNDS WENT TO A SPECIAL FEDERAL OLD-AGE AND SURVIVORS INSURANCE TRUST FUND UNDER 49 STAT. 622, 53 STAT. 1362, AS AMENDED, 42 U.S.C. SEC. 401, IN RETURN FOR WHICH NESTOR, LIKE MILLIONS OF OTHERS, EXPECTED TO RECEIVE PAYMENTS WHEN HE REACHED THE STATUTORY AGE. IN 1954, 15 YEARS AFTER NESTOR HAD LAST BEEN A COMMUNIST, AND 18 YEARS AFTER HE BEGAN TO MAKE PAYMENTS INTO THE OLD-AGE SECURITY FUND, CONGRESS PASSED A LAW PROVIDING, AMONG OTHER THINGS, THAT ANY PERSON WHO HAD BEEN DEPORTED FROM THIS COUNTRY BECAUSE OF PAST COMMUNIST MEMBERSHIP UNDER 66 STAT. 205, 8 U.S.C. SEC. 1251(A)(6)(C) SHOULD BE WHOLLY CUT OFF FROM ANY BENEFITS OF THE FUND TO WHICH HE HAD CONTRIBUTED UNDER THE LAW. 68 STAT. 1083, 42 U.S.C. SEC. 402(N). AFTER THE GOVERNMENT DEPORTED NESTOR IN 1956 IT NOTIFIED HIS WIFE, WHO HAD REMAINED IN THIS COUNTRY, THAT HE WAS CUT OFF AND NO FURTHER PAYMENTS WOULD BE MADE TO HIM. THIS ACTION, IT SEEMS TO ME, TAKES NESTOR'S INSURANCE WITHOUT JUST COMPENSATION AND IN VIOLATION OF THE DUE PROCESS CLAUSE OF THE FIFTH AMENDMENT. MOREOVER, IT IMPOSES AN EX POST FACTO LAW AND BILL OF ATTAINDER BY STAMPING HIM, WITHOUT A COURT TRIAL, AS UNWORTHY TO RECEIVE THAT FOR WHICH HE HAS PAID AND WHICH THE GOVERNMENT PROMISED TO PAY HIM. THE FACT THAT THE COURT IS SUSTAINING THIS ACTION INDICATES THE EXTENT TO WHICH PEOPLE ARE WILLING TO GO THESE DAYS TO OVERLOOK VIOLATIONS OF THE CONSTITUTION PERPETRATED AGAINST ANYONE WHO HAS EVER EVEN INNOCENTLY BELONGED TO THE COMMUNIST PARTY. I. IN LYNCH V. UNITED STATES, 292 U.S. 571, THIS COURT UNANIMOUSLY HELD THAT CONGRESS WAS WITHOUT POWER TO REPUDIATE AND ABROGATE IN WHOLE OR IN PART ITS PROMISES TO PAY AMOUNTS CLAIMED BY SOLDIERS UNDER THE WAR RISK INSURANCE ACT OF 1917, SECS. 400-405, 40 STAT. 409. THIS COURT HELD THAT SUCH A REPUDIATION WAS INCONSISTENT WITH THE PROVISION OF THE FIFTH AMENDMENT THAT \"NO PERSON SHALL BE ... DEPRIVED OF LIFE, LIBERTY, OR PROPERTY, WITHOUT DUE PROCESS OF LAW; NOR SHALL PRIVATE PROPERTY BE TAKEN FOR PUBLIC USE, WITHOUT JUST COMPENSATION.\" THE COURT TODAY PUTS THE LYNCH CASE ASIDE ON THE GROUND THAT \"IT IS HARDLY PROFITABLE TO ENGAGE IN CONCEPTUALIZATIONS REGARDING 'EARNED RIGHTS' AND 'GRATUITIES.'\" FROM THIS SOUND PREMISE THE COURT GOES ON TO SAY THAT WHILE \"THE 'RIGHT' TO SOCIAL SECURITY BENEFITS IS IN ONE SENSE 'EARNED,'\" YET THE GOVERNMENT'S INSURANCE SCHEME NOW BEFORE US RESTS NOT ON THE IDEA OF THE CONTRIBUTORS TO THE FUND EARNING SOMETHING, BUT SIMPLY PROVIDES THAT THEY MAY \"JUSTLY CALL\" UPON THE GOVERNMENT \"IN THEIR LATER YEARS, FOR PROTECTION FROM 'THE RIGORS OF THE POOR HOUSE AS WELL AS FROM THE HAUNTING FEAR THAT SUCH A LOT AWAITS THEM WHEN JOURNEY'S END IS NEAR.'\" THESE ARE NICE WORDS BUT THEY CANNOT CONCEAL THE FACT THAT THEY SIMPLY TELL THE CONTRIBUTORS TO THIS INSURANCE FUND THAT DESPITE THEIR OWN AND THEIR EMPLOYERS' PAYMENTS THE GOVERNMENT, IN PAYING THE BENEFICIARIES OUT OF THE FUND, IS MERELY GIVING THEM SOMETHING FOR NOTHING AND CAN STOP DOING SO WHEN IT PLEASES. THIS, IN MY JUDGMENT, REVEALS A COMPLETE MISUNDERSTANDING OF THE PURPOSE CONGRESS AND THE COUNTRY HAD IN PASSING THAT LAW. IT WAS THEN GENERALLY AGREED, AS IT IS TODAY, THAT IT IS NOT DESIRABLE THAT AGED PEOPLE THINK OF THE GOVERNMENT AS GIVING THEM SOMETHING FOR NOTHING. AN EXCELLENT STATEMENT OF THIS VIEW, QUOTED BY MR. JUSTICE DOUGLAS IN ANOTHER CONNECTION, WAS MADE BY SENATOR GEORGE, THE CHAIRMAN OF THE FINANCE COMMITTEE WHEN THE SOCIAL SECURITY ACT WAS PASSED, AND ONE VERY FAMILIAR WITH THE PHILOSOPHY THAT BROUGHT IT ABOUT: \"IT COMPORTS BETTER THAN ANY SUBSTITUTE WE HAVE DISCOVERED WITH THE AMERICAN CONCEPT THAT FREE MEN WANT TO EARN THEIR SECURITY AND NOT ASK FOR DOLES - THAT WHAT IS DUE AS A MATTER OF EARNED RIGHT IS FAR BETTER THAN A GRATUITY ... \"SOCIAL SECURITY IS NOT A HANDOUT; IT IS NOT CHARITY; IT IS NOT RELIEF. IT IS AN EARNED RIGHT BASED UPON THE CONTRIBUTIONS AND EARNINGS OF THE INDIVIDUAL. AS AN EARNED RIGHT, THE INDIVIDUAL IS ELIGIBLE TO RECEIVE HIS BENEFIT IN DIGNITY AND SELF-RESPECT.\" 102 CONG. REC. 15110. THE PEOPLE COVERED BY THIS ACT ARE NOW ABLE TO RELY WITH COMPLETE ASSURANCE ON THE FACT THAT THEY WILL BE COMPELLED TO CONTRIBUTE REGULARLY TO THIS FUND WHENEVER EACH CONTRIBUTION FALLS DUE. I BELIEVE THEY ARE ENTITLED TO RELY WITH THE SAME ASSURANCE ON GETTING THE BENEFITS THEY HAVE PAID FOR AND HAVE BEEN PROMISED, WHEN THEIR DISABILITY OR AGE MAKES THEIR INSURANCE PAYABLE UNDER THE TERMS OF THE LAW. THE COURT DID NOT PERMIT THE GOVERNMENT TO BREAK ITS PLIGHTED FAITH WITH THE SOLDIERS IN THE LYNCH CASE; IT SAID THE CONSTITUTION FORBADE SUCH GOVERNMENTAL CONDUCT. I WOULD SAY PRECISELY THE SAME THING HERE. THE COURT CONSOLES THOSE WHOSE INSURANCE IS TAKEN AWAY TODAY, AND OTHERS WHO MAY SUFFER THE SAME FATE IN THE FUTURE, BY SAYING THAT A DECISION REQUIRING THE SOCIAL SECURITY SYSTEM TO KEEP FAITH \"WOULD DEPRIVE IT OF THE FLEXIBILITY AND BOLDNESS IN ADJUSTMENT TO EVER CHANGING CONDITIONS WHICH IT DEMANDS.\" PEOPLE WHO PAY PREMIUMS FOR INSURANCE USUALLY THINK THEY ARE PAYING FOR INSURANCE, NOT FOR \"FLEXIBILITY AND BOLDNESS.\" I CANNOT BELIEVE THAT ANY PRIVATE INSURANCE COMPANY IN AMERICA WOULD BE PERMITTED TO REPUDIATE ITS MATURED CONTRACTS WITH ITS POLICYHOLDERS WHO HAVE REGULARLY PAID ALL THEIR PREMIUMS IN RELIANCE UPON THE GOOD FAITH OF THE COMPANY. IT IS TRUE, AS THE COURT SAYS, THAT THE ORIGINAL ACT CONTAINED A CLAUSE, STILL IN FORCE, THAT EXPRESSLY RESERVES TO CONGRESS \"THE RIGHT TO ALTER, AMEND, OR REPEAL ANY PROVISION\" OF THE ACT. SEC. 1104, 49 STAT. 648, 42 U.S.C. SEC. 1304. CONGRESS, OF COURSE PROPERLY RETAINED THAT POWER. IT COULD REPEAL THE ACT SO AS TO CEASE TO OPERATE ITS OLD-AGE INSURANCE ACTIVITIES FOR THE FUTURE. THIS MEANS THAT IT COULD STOP COVERING NEW PEOPLE, AND EVEN STOP INCREASING ITS OBLIGATIONS TO ITS OLD CONTRIBUTORS. BUT THAT IS QUITE DIFFERENT FROM DISAPPOINTING THE JUST EXPECTATIONS OF THE CONTRIBUTORS TO THE FUND WHICH THE GOVERNMENT HAS COMPELLED THEM AND THEIR EMPLOYERS TO PAY ITS TREASURY. THERE IS NOTHING \"CONCEPTUALISTIC\" ABOUT SAYING, AS THIS COURT DID IN LYNCH, THAT SUCH A TAKING AS THIS THE CONSTITUTION FORBIDS. II. IN PART II OF ITS OPINION, THE COURT THROWS OUT A LINE OF HOPE BY ITS SUGGESTION THAT IF CONGRESS IN THE FUTURE CUTS OFF SOME OTHER GROUP FROM THE BENEFITS THEY HAVE BOUGHT FROM THE GOVERNMENT, THIS COURT MIGHT POSSIBLY HOLD THAT THE FUTURE HYPOTHETICAL ACT VIOLATES THE DUE PROCESS CLAUSE. IN DOING SO IT READS DUE PROCESS AS AFFORDING ONLY MINIMAL PROTECTION, AND UNDER THIS READING IT WILL PROTECT ALL FUTURE GROUPS FROM DESTRUCTION OF THEIR RIGHTS ONLY IF CONGRESS \"MANIFESTS A PATENTLY ARBITRARY CLASSIFICATION, UTTERLY LACKING IN RATIONAL JUSTIFICATION.\" THE DUE PROCESS CLAUSE SO DEFINED PROVIDES LITTLE PROTECTION INDEED COMPARED WITH THE SPECIFIC SAFEGUARDS OF THE CONSTITUTION SUCH AS ITS PROHIBITIONS AGAINST TAKING PRIVATE PROPERTY FOR A PUBLIC USE WITHOUT JUST COMPENSATION, PASSING EX POST FACTO LAWS, AND IMPOSING BILLS OF ATTAINDER. I CANNOT AGREE, HOWEVER, THAT THE DUE PROCESS CLAUSE IS PROPERLY INTERPRETED WHEN IT IS USED TO SUBORDINATE AND DILUTE THE SPECIFIC SAFEGUARDS OF THE BILL OF RIGHTS, AND WHEN \"DUE PROCESS\" ITSELF BECOMES SO WHOLLY DEPENDENT UPON THIS COURT'S IDEA OF WHAT IS \"ARBITRARY\" AND \"RATIONAL.\" SEE LEVINE V. UNITED STATES, 362 U.S. 610, 620 (DISSENTING OPINION); ADAMSON V. CALIFORNIA, 332 U.S. 46, 89-92 (DISSENTING OPINION); ROCHIN V. CALIFORNIA, 342 U.S. 165, 174 (CONCURRING OPINION). ONE REASON FOR MY BELIEF IN THIS RESPECT IS THAT I AGREE WITH WHAT IS SAID IN THE COURT'S QUOTATION FROM HELVERING V. DAVIS, 301 U.S. 619, 644: \"WHETHER WISDOM OR UNWISDOM RESIDES IN THE SCHEME OF BENEFITS SET FORTH IN TITLE II, IT IS NOT FOR US TO SAY. THE ANSWER TO SUCH INQUIRIES MUST COME FROM CONGRESS, NOT THE COURTS. OUR CONCERN HERE, AS OFTEN, IS WITH POWER, NOT WITH WISDOM.\" AND YET THE COURT'S ASSUMPTION OF ITS POWER TO HOLD ACTS UNCONSTITUTIONAL BECAUSE THE COURT THINKS THEY ARE ARBITRARY AND IRRATIONAL CAN BE NEITHER MORE NOR LESS THAN A JUDICIAL FORAY INTO THE FIELD OF GOVERNMENTAL POLICY. BY THE USE OF THIS DUE PROCESS FORMULA THE COURT DOES NOT, AS ITS PROPONENTS FREQUENTLY PROCLAIM, ABSTAIN FROM INTERFERING WITH THE CONGRESSIONAL POLICY. IT ACTIVELY ENTERS THAT FIELD WITH NO STANDARDS EXCEPT ITS OWN CONCLUSION AS TO WHAT IS \"ARBITRARY\" AND WHAT IS \"RATIONAL.\" AND THIS ELASTIC FORMULA GIVES THE COURT A FURTHER POWER, THAT OF HOLDING LEGISLATIVE ACTS CONSTITUTIONAL ON THE GROUND THAT THEY ARE NEITHER ARBITRARY NOR IRRATIONAL, EVEN THOUGH THE ACTS VIOLATE SPECIFIC BILL OF RIGHTS SAFEGUARDS. SEE MY DISSENT IN ADAMSON V. CALIFORNIA, SUPRA. WHETHER THIS ACT HAD \"RATIONAL JUSTIFICATION\" WAS, IN MY JUDGMENT, FOR CONGRESS; WHETHER IT VIOLATES THE FEDERAL CONSTITUTIONAL IS FOR US TO DETERMINE, UNLESS WE ARE BY CIRCUMLOCUTION TO ABDICATE THE POWER THAT THIS COURT HAS BEEN HELD TO HAVE EVER SINCE MARBURY V. MADISON, 1 CRANCH 137. III. THE COURT IN PART III OF ITS OPINION HOLDS THAT THE 1954 ACT IS NOT AN EX POST FACTO LAW OR BILL OR ATTAINDER EVEN THOUGH IT CREATES A CLASS OF DEPORTEES WHO CANNOT COLLECT THEIR INSURANCE BENEFITS BECAUSE THEY WERE ONCE COMMUNISTS AT A TIME WHEN SIMPLY BEING A COMMUNIST WAS NOT ILLEGAL. THE COURT ALSO PUTS GREAT EMPHASIS ON ITS BELIEF THAT THE ACT HERE IS NOT PUNISHMENT. ALTHOUGH NOT BELIEVING THAT THE PARTICULAR LABEL \"PUNISHMENT\" IS OF DECISIVE IMPORTANCE, I THINK THE ACT DOES IMPOSE PUNISHMENT EVEN IN A CLASSIC SENSE. THE BASIC REASON FOR NESTOR'S LOSS OF HIS INSURANCE PAYMENTS IS THAT HE WAS ONCE A COMMUNIST. THIS MAN, NOW 69 YEARS OLD, HAS BEEN DRIVEN OUT OF THE COUNTRY WHERE HE HAS LIVED FOR 43 YEARS TO A LAND WHERE HE IS PRACTICALLY A STRANGER, UNDER AN ACT AUTHORIZING HIS DEPORTATION MANY YEARS AFTER HIS COMMUNIST MEMBERSHIP. CF. GALVAN V. PRESS, 347 U.S. 522, 532, 533 (DISSENTING OPINIONS). NOW A SIMILAR EX POST FACTO LAW DEPRIVES HIM OF HIS INSURANCE, WHICH, WHILE PETTY AND INSIGNIFICANT IN AMOUNT TO THIS GREAT GOVERNMENT, MAY WELL BE THIS EXILE'S DAILY BREAD, FOR THE SAME REASON AND IN ACCORD WITH THE GENERAL FASHION OF THE DAY - THAT IS, TO PUNISH IN EVERY WAY POSSIBLE ANYONE WHO EVER MADE THE MISTAKE OF BEING A COMMUNIST IN THIS COUNTRY OR WHO IS SUPPOSED EVER TO HAVE BEEN ASSOCIATED WITH ANYONE WHO MADE THAT MISTAKE. SEE, E.G., BARENBLATT V. UNITED STATES, 360 U.S. 109, AND UPHAUS V. WYMAN, 360 U.S. 72. IN UNITED STATES V. LOVETT, 328 U.S. 303, 315-316, WE SAID: \" ... LEGISLATIVE ACTS, NO MATTER WHAT THEIR FORM, THAT APPLY EITHER TO NAMED INDIVIDUALS OR TO EASILY ASCERTAINABLE MEMBERS OF A GROUP IN SUCH A WAY AS TO INFLICT PUNISHMENT ON THEM WITHOUT A JUDICIAL TRIAL ARE BILLS OF ATTAINDER PROHIBITED BY THE CONSTITUTION.\" FAITHFUL OBSERVANCE OF OUR HOLDINGS IN THAT CASE, IN EX PARTE GARLAND, 4 WALL. 333, AND IN CUMMINGS V. MISSOURI, 4 WALL. 277, WOULD, IN MY JUDGMENT, REQUIRE US TO HOLD THAT THE 1954 ACT IS A BILL OF ATTAINDER. IT IS A CONGRESSIONAL ENACTMENT AIMED AT AN EASILY ASCERTAINABLE GROUP; IT IS CERTAINLY PUNISHMENT IN ANY NORMAL SENSE OF THE WORD TO TAKE AWAY FROM ANY PERSON THE BENEFITS OF AN INSURANCE SYSTEM INTO WHICH HE AND HIS EMPLOYER HAVE PAID THEIR MONEYS FOR ALMOST TWO DECADES; AND IT DOES ALL THIS WITHOUT A TRIAL ACCORDING TO DUE PROCESS OF LAW. IT IS TRUE THAT THE LOVETT, CUMMINGS AND GARLAND COURT OPINIONS WERE NOT UNANIMOUS, BUT THEY NONETHELESS REPRESENT POSITIVE PRECEDENTS ON HIGHLY IMPORTANT QUESTIONS OF INDIVIDUAL LIBERTY WHICH SHOULD NOT BE EXPLAINED AWAY WITH COBWEBBERY REFINEMENTS. IF THE COURT IS GOING TO OVERRULE THESE CASES IN WHOLE OR IN PART, AND ADOPT THE VIEWS OF PREVIOUS DISSENTERS, I BELIEVE IT SHOULD BE DONE CLEARLY AND FORTHRIGHTLY. A BASIC CONSTITUTIONAL INFIRMITY OF THIS ACT, IN MY JUDGMENT, IS THAT IT IS A PART OF A PATTERN OF LAWS ALL OF WHICH VIOLATE THE FIRST AMENDMENT OUT OF FEAR THAT THIS COUNTRY IS IN GRAVE DANGER IF IT LETS A HANDFUL OF COMMUNIST FANATICS OR SOME OTHER EXTREMIST GROUP MAKE THEIR ARGUMENTS AND DISCUSS THEIR IDEAS. THIS FEAR, I THINK, IS BASELESS. IT REFLECTS A LACK OF FAITH IN THE STURDY PATRIOTISM OF OUR PEOPLE AND DOES NOT GIVE TO THE WORLD A TRUE PICTURE OF OUR ABIDING STRENGTH. IT IS AN UNWORTHY FEAR IN A COUNTRY THAT HAS A BILL OF RIGHTS CONTAINING PROVISONS FOR FAIR TRIALS, FREEDOM OF SPEECH, PRESS AND RELIGION, AND OTHER SPECIFIC SAFEGUARDS DESIGNED TO KEEP MEN FREE. I REPEAT ONCE MORE THAT I THINK THIS NATION'S GREATEST SECURITY LIES, NOT IN TRUSTING TO A MOMENTARY MAJORITY OF THIS COURT'S VIEW AT ANY PARTICULAR TIME OF WHAT IS \"PATENTLY ARBITRARY,\" BUT IN WHOLEHEARTED DEVOTION TO AND OBSERVANCE OF OUR CONSTITUTIONAL FREEDOMS. SEE WIEMAN V. UPDEGRAFF, 344 U.S. 183, 192 (CONCURRING OPINION). I WOULD AFFIRM THE JUDGMENT OF THE DISTRICT COURT WHICH HELD THAT NESTOR IS CONSTITUTIONALLY ENTITLED TO COLLECT HIS INSURANCE. MR. JUSTICE DOUGLAS, DISSENTING. APPELLEE CAME TO THIS COUNTRY FROM BULGARIA IN 1913 AND WAS EMPLOYED, SO AS TO BE COVERED BY THE SOCIAL SECURITY ACT, FROM DECEMBER 1936 TO JANUARY 1955 - A PERIOD OF 19 YEARS. HE BECAME ELIGIBLE FOR RETIREMENT AND FOR SOCIAL SECURITY BENEFITS IN NOVEMBER 1955 AND WAS AWARDED $55.60 PER MONTH. IN JULY 1956 HE WAS DEPORTED FOR HAVING BEEN A MEMBER OF THE COMMUNIST PARTY FROM 1933 TO 1939. PURSUANT TO A LAW, ENACTED SEPTEMBER 1, 1954, HE WAS THEREUPON DENIED PAYMENT OF FURTHER SOCIAL SECURITY BENEFITS. THIS 1954 LAW SEEMS TO ME TO BE A CLASSIC EXAMPLE OF A BILL OF ATTAINDER, WHICH ART. I, SEC. 9 OF THE CONSTITUTION PROHIBITS CONGRESS FROM ENACTING. A BILL OF ATTAINDER IS A LEGISLATIVE ACT WHICH INFLICTS PUNISHMENT WITHOUT A JUDICIAL TRIAL. CUMMINGS V. MISSOURI, 4 WALL. 277, 323. IN THE OLD DAYS PUNISHMENT WAS METED OUT TO A CREDITOR OR RIVAL OR ENEMY BY SENDING HIM TO THE GALLOWS. BUT AS RECENTLY STATED BY IRVING BRANT: (FN1) \" ... BY SMITING A MAN DAY AFTER DAY WITH SLANDEROUS WORDS, BY TAKING AWAY HIS OPPORTUNITY TO EARN A LIVING, YOU CAN DRAIN THE BLOOD FROM HIS VEINS WITHOUT EVEN SCRATCHING HIS SKIN. \"TODAY'S BILL OF ATTAINDER IS BROADER THAN THE CLASSIC FORM, AND NOT SO TALL AND SHARP. THERE IS MENTAL IN PLACE OF PHYSICAL TORTURE, AND CONFISCATION OF TOMMORROW'S BREAD AND BUTTER INSTEAD OF YESTERDAY'S LAND AND GOLD. WHAT IS PERFECTLY CLEAR IS THAT HATE, FEAR AND PREJUDICE PLAY THE SAME ROLE TODAY, IN THE DESTRUCTION OF HUMAN RIGHTS IN AMERICA THAT THEY DID IN ENGLAND WHEN A FRENZIED MOB OF LORDS, JUDGES, BISHOPS AND SHOEMAKERS TURNED THE TITUS OATES BLACKLIST INTO A HANGMAN'S RECORD. HATE, JEALOUSY AND SPITE CONTINUE TO FILL THE LEGISLATIVE ATTAINDER LISTS JUST AS THEY DID IN THE IRISH PARLIAMENT OF EX-KING JAMES.\" BILLS OF ATTAINDER, WHEN THEY IMPOSED PUNISHMENT LESS THAN DEATH, WERE BILLS OF PAINS AND PENALTIES AND EQUALLY BEYOND THE CONSTITUTIONAL POWER OF CONGRESS. CUMMINGS V. MISSOURI, SUPRA, AT 323. PUNISHMENT IN THE SENSE OF A BILL OF ATTAINDER INCLUDES THE \"DEPRIVATION OR SUSPENSION OF POLITICAL OR CIVIL RIGHTS.\" CUMMINGS V. MISSOURI, SUPRA, AT 322. IN THAT CASE IT WAS BARRING A PRIEST FROM PRACTICING HIS PROFESSION. IN EX PARTE GARLAND, 4 WALL. 333, IT WAS EXCLUDING A MAN FROM PRACTICING LAW IN THE FEDERAL COURTS. IN UNITED STATES V. LOVETT, 328 U.S. 303, IT WAS CUTTING OFF EMPLOYEES' COMPENSATION AND BARRING THEM PERMANENTLY FROM GOVERNMENT SERVICE. CUTTING OFF A PERSON'S LIVELIHOOD BY DENYING HIM ACCRUED SOCIAL BENEFITS - PART OF HIS PROPERTY INTERESTS - IS NO LESS A PUNISHMENT. HERE, AS IN THE OTHER CASES CITED, THE PENALTY EXACTED HAS ONE OF THE CLASSIC PURPOSES OF PUNISHMENT (FN2) - \"TO REPRIMAND THE WRONGDOER TO DETER OTHERS.\" TROP V. DULLES, 356 U.S. 86, 96. SOCIAL SECURITY PAYMENTS ARE NOT GRATUITIES. THEY ARE PRODUCTS OF A CONTRIBUTORY SYSTEM, THE FUNDS BEING RAISED BY PAYMENT FROM EMPLOYEES AND EMPLOYERS ALIKE, OR IN CASE OF SELF-EMPLOYED PERSONS, BY THE INDIVIDUAL ALONE. SEE SOCIAL SECURITY BOARD V. NIEROTKO, 327 U.S. 358, 364. THE FUNDS ARE PLACED IN THE FEDERAL OLD-AGE AND SURVIVORS INSURANCE TRUST FUND, 42 U.S.C. SEC. 401(A); AND ONLY THOSE WHO CONTRIBUTE TO THE FUND ARE ENTITLED TO ITS BENEFITS, THE AMOUNT OF BENEFITS BEING RELATED TO THE AMOUNT OF CONTRIBUTIONS MADE. SEE STARK, SOCIAL SECURITY: ITS IMPORTANCE TO LAWYERS, 43 A.B.A.J. 319, 321 (1957). AS THE LATE SENATOR GEORGE, LONG CHAIRMAN OF THE SENATE FINANCE COMMITTEE AND ONE OF THE AUTHORS OF THE SOCIAL SECURITY SYSTEM, SAID: \"THERE HAS DEVELOPED THROUGH THE YEARS A FEELING BOTH IN AND OUT OF CONGRESS THAT THE CONTRIBUTORY SOCIAL INSURANCE PRINCIPLE FITS OUR TIMES - THAT IT SERVES A VITAL NEED THAT CANNOT BE AS WELL SERVED OTHERWISE. IT COMPORTS BETTER THAN ANY SUBSTITUTE WE HAVE DISCOVERED WITH THE AMERICAN CONCEPT THAT FREE MEN WANT TO EARN THEIR SECURITY AND NOT ASK FOR DOLES - THAT WHAT IS DUE AS A MATTER OF EARNED RIGHT IS FAR BETTER THAN A GRATUITY ... \"SOCIAL SECURITY IS NOT A HANDOUT; IT IS NOT CHARITY; IT IS NOT RELIEF. IT IS AN EARNED RIGHT BASED UPON THE CONTRIBUTIONS AND EARNINGS OF THE INDIVIDUAL. AS AN EARNED RIGHT, THE INDIVIDUAL IS ELIGIBLE TO RECEIVE HIS BENEFIT IN DIGNITY AND SELF-RESPECT.\" 102 CONG. REC. 15110. SOCIAL SECURITY BENEFITS HAVE RIGHTLY COME TO BE REGARDED AS BASIC FINANCIAL PROTECTION AGAINST THE HAZARDS OF OLD AGE AND DISABILITY. AS STATED IN A RECENT HOUSE REPORT: \"THE OLD-AGE AND SURVIVORS INSURANCE SYSTEM IS THE BASIC PROGRAM WHICH PROVIDES PROTECTION FOR AMERICA'S FAMILIES AGAINST THE LOSS OF EARNED INCOME UPON THE RETIREMENT OR DEATH OF THE FAMILY PROVIDER. THE PROGRAM PROVIDES BENEFITS RELATED TO EARNED INCOME AND SUCH BENEFITS ARE PAID FOR BY THE CONTRIBUTIONS MADE WITH RESPECT TO PERSONS WORKING IN COVERED OCCUPATIONS.\" H.R. REP. NO. 1189, 84TH CONG., 1ST SESS. 2. CONGRESS COULD PROVIDE THAT ONLY PEOPLE RESIDENT HERE COULD GET SOCIAL SECURITY BENEFITS. YET BOTH THE HOUSE AND THE SENATE REJECTED ANY RESIDENCE REQUIREMENTS. SEE H.R. REP. NO. 1698, 83D CONG., 2D SESS. 24-25; S. REP. NO. 1987, 83D CONG., 2D SESS. 23. CONGRESS CONCEDEDLY MIGHT AMEND THE PROGRAM TO MEET NEW CONDITIONS. BUT MAY IT TAKE AWAY SOCIAL SECURITY BENEFITS FROM ONE PERSON OR FROM A GROUP OF PERSONS FOR VINDICTIVE REASONS? COULD CONGRESS ON DEPORTING AN ALIEN FOR HAVING BEEN A COMMUNIST CONFISCATE HIS HOME, APPROPRIATE HIS SAVINGS ACCOUNTS, AND THUS SEND HIM OUT OF THE COUNTRY PENNILESS? I THINK NOT. ANY SUCH ACT WOULD BE A BILL OF ATTAINDER. THE DIFFERENCE, AS I SEE IT, BETWEEN THAT CASE AND THIS IS ONE MERELY OF DEGREE. SOCIAL SECURITY BENEFITS, MADE UP IN PART OF THIS ALIEN'S OWN EARNINGS, ARE TAKEN FROM HIM BECAUSE HE ONCE WAS A COMMUNIST. THE VIEW THAT SEC. 202(N), WITH WHICH WE NOW DEAL, IMPOSES A PENALTY WAS TAKEN BY SECRETARY FOLSOM, APPELLANT'S PREDECESSOR, WHEN OPPOSING ENLARGEMENT OF THE CATEGORY OF PEOPLE TO BE DENIED BENEFITS OF SOCIAL SECURITY, E.G., THOSE CONVICTED OF TREASON AND SEDITION. HE SAID: \"BECAUSE THE DEPRIVATION OF BENEFITS AS PROVIDED IN THE AMENDMENT IS IN THE NATURE OF A PENALTY AND BASED ON CONSIDERATIONS FOREIGN TO THE OBJECTIVES AND PROVISIONS OF THE OLD-AGE AND SURVIVORS INSURANCE PROGRAM, THE AMENDMENT MAY WELL SERVE AS A PRECEDENT FOR EXTENSION OF SIMILAR PROVISIONS TO OTHER PUBLIC PROGRAMS AND TO OTHER CRIMES WHICH, WHILE PERHAPS DIFFERENT IN DEGREE, ARE DIFFICULT TO DISTINGUISH IN PRINCIPLE. \"THE PRESENT LAW RECOGNIZES ONLY THREE NARROWLY LIMITED EXCEPTIONS (FN3) TO THE BASIC PRINCIPLE THAT BENEFITS ARE PAID WITHOUT REGARD TO THE ATTITUDES, OPINIONS, BEHAVIOR, OR PERSONAL CHARACTERISTICS OF THE INDIVIDUAL ... .\" HEARINGS, SENATE FINANCE COMMITTEE ON SOCIAL SECURITY AMENDMENTS OF 1955, 84TH CONG., 2D SESS. 1319. THE COMMITTEE REPORTS, THOUGH MEAGRE, SUPPORT SECRETARY FOLSOM IN THAT CHARACTERIZATION OF SEC. 202(N). THE HOUSE REPORT TERSELY STATED THAT TERMINATION OF THE BENEFITS WOULD APPLY TO THOSE PERSONS WHO WERE DEPORTED \"BECAUSE OF ILLEGAL ENTRY, CONVICTION OF A CRIME, OR SUBVERSIVE ACTIVITY.\" H.R. REP. NO. 1698, 83D CONG., 2D SESS. 25. THE AIM AND PURPOSE ARE CLEAR - TO TAKE AWAY FROM A PERSON BY LEGISLATIVE FIAT PROPERTY WHICH HE HAS ACCUMULATED BECAUSE HE HAS ACTED IN A CERTAIN WAY OR EMBRACED A CERTAIN IDEOLOGY. THAT IS A MODERN VERSION OF THE BILL OF ATTAINDER - AS PLAIN, AS DIRECT, AS EFFECTIVE AS THOSE WHICH RELIGIOUS PASSIONS ONCE LOOSED IN ENGLAND AND WHICH LATER WERE EMPLOYED AGAINST THE TORIES HERE. (FN4) I WOULD AFFIRM THIS JUDGMENT. FOOTNOTES Footnote 1- ADDRESS ENTITLED BILLS OF ATTAINDER IN 1787 AND TODAY. COLUMBIA LAW REVIEW DINNER 1954, PUBLISHED IN 1959 BY THE EMERGENCY CIVIL LIBERTIES COMMITTEE, UNDER THE TITLE CONGRESSIONAL INVESTIGATIONS AND BILLS OF ATTAINDER. Footnote 2- THE BROAD SWEEP OF THE IDEA OF PUNISHMENT BEHIND THE CONCEPT OF THE BILL OF ATTAINDER WAS STATED AS FOLLOWS BY IRVING BRANT, OP. CIT., SUPRA, NOTE 1, 9-10: \"IN 1794 THE AMERICAN PEOPLE WERE IN A STATE OF EXCITEMENT COMPARABLE TO THAT WHICH EXISTS TODAY. SUPPORTERS OF THE FRENCH REVOLUTION HAD ORGANIZED THE DEMOCRATIC SOCIETIES - BLATANTLY ADOPTING THAT SUBVERSIVE TITLE. THEN THE WHISKY REBELLION EXPLODED IN WESTERN PENNSYLVANIA. THE DEMOCRATIC SOCIETIES WERE BLAMED. A MOTION CENSURING THE SOCIETIES WAS INTRODUCED IN THE HOUSE OF REPRESENTATIVES. \"THERE, IN 1794, YOU HAD THE BASIC DIVISION IN AMERICAN THOUGHT - ON ONE SIDE THE DOCTRINE OF POLITICAL LIBERTY FOR EVERYBODY, WITH COLLECTIVE SECURITY RESTING ON THE CAPACITY OF THE PEOPLE FOR SELF GOVERNMENT; ON THE OTHER SIDE THE DOCTRINE THAT THE PEOPLE COULD NOT BE TRUSTED AND POLITICAL LIBERTY MUST BE RESTRAINED. \"JAMES MADISON CHALLENGED THIS LATTER DOCTRINE. THE INVESTIGATIVE POWER OF CONGRESS OVER PERSONS, HE CONTENDED, WAS LIMITED TO INQUIRY INTO THE CONDUCT OF INDIVIDUALS IN THE PUBLIC SERVICE. 'OPINIONS,' HE SAID, 'ARE NOT THE SUBJECTS OF LEGISLATION.' START CRITICIZING PEOPLE FOR ABUSE OF THEIR RESERVED RIGHTS, AND THE CENSURE MIGHT EXTEND TO FREEDOM OF SPEECH AND PRESS. WHAT WOULD BE THE EFFECT ON THE PEOPLE THUS CONDEMNED? SAID MADISON: \"'IT IS IN VAIN TO SAY THAT THIS INDISCRIMINATE CENSURE IS NO PUNISHMENT ... . IS NOT THIS PROPOSITION, IF VOTED, A BILL OF ATTAINDER?' \"MADISON WON HIS FIGHT, NOT BECAUSE HE CALLED THE RESOLUTION A BILL OF ATTAINDER, BUT BECAUSE IT ATTAINTED TOO MANY MEN WHO WERE GOING TO VOTE IN THE NEXT ELECTION. THE DEFINITION, HOWEVER, WAS THERE - A BILL OF ATTAINDER - AND THE DEFINITION WAS GIVEN BY THE FOREMOST AMERICAN AUTHORITY ON THE PRINCIPLES OF LIBERTY AND ORDER UNDERLYING OUR SYSTEM OF GOVERNMENT.\" Footnote 3- THE THREE EXCEPTIONS REFERRED TO WERE (1) SEC. 202(N); (2) ACT OF SEPTEMBER 1, 1954, 68 STAT. 1142, 5 U.S.C. SECS. 2281-2288; (3) REGULATION OF THE SOCIAL SECURITY ADMINISTRATION, 20 CFR SEC. 403.409 - DENYING DEPENDENT'S BENEFITS TO A PERSON FOUND GUILTY OF FELONIOUS HOMICIDE OF THE INSURED WORKER. Footnote 4- BRANT, OP. CIT., SUPRA, NOTE 1, STATES AT P. 9: \"WHAT WERE THE FRAMERS AIMING AT WHEN THEY FORBADE BILLS OF ATTAINDER? THEY WERE, OF COURSE, GUARDING AGAINST THE RELIGIOUS PASSIONS THAT DISGRACED CHRISTIANITY IN EUROPE. BUT AMERICAN BILLS OF ATTAINDER, JUST BEFORE 1787, WERE TYPICALLY USED BY REVOLUTIONARY ASSEMBLIES TO RID THE STATES OF BRITISH LOYALISTS. BY A CURIOUS COINCIDENCE, IT WAS USUALLY THE TORY WITH A GOOD FARM WHO WAS SENT INTO EXILE, AND ALL TOO OFTEN IT WAS SOMEBODY WHO WANTED THAT FARM WHO INDUCED THE LEGISLATURE TO ATTAINT HIM. PATRIOTISM COULD SERVE AS A CLOAK FOR GREED AS EASILY AS RELIGION DID IN THAT IRISH PARLIAMENT OF JAMES THE SECOND. \"BUT CONSIDER A CASE IN WHICH NOTHING COULD BE SAID AGAINST THE MOTIVE. DURING THE REVOLUTION, GOVERNOR PATRICK HENRY INDUCED THE VIRGINIA LEGISLATURE TO PASS A BILL OF ATTAINDER CONDEMNING JOSIAH PHILLIPS TO DEATH. HE WAS A TRAITOR, A MURDERER, A PIRATE AND AN OUTLAW. WHEN RATIFICATION OF THE NEW CONSTITUTION CAME BEFORE THE VIRGINIA CONVENTION, HENRY INVEIGHED AGAINST IT BECAUSE IT CONTAINED NO BILL OF RIGHTS. EDMUND RANDOLPH TAUNTED HIM WITH HIS SPONSORSHIP OF THE PHILLIPS BILL OF ATTAINDER. HENRY THEN MADE THE BLUNDER OF DEFENDING IT. THE BILL WAS WARRANTED, HE SAID, BECAUSE PHILLIPS WAS NO SOCRATES. THAT SHOCKING DEFENSE OF ARBITRARY CONDEMNATION MAY HAVE PRODUCED THE SMALL MARGIN BY WHICH THE CONSTITUTION WAS RATIFIED.\" MR. JUSTICE BRENNAN, WITH WHOM THE CHIEF JUSTICE AND MR. JUSTICE DOUGLAS JOIN, DISSENTING. WHEN NESTOR QUIT THE COMMUNIST PARTY IN 1939 HIS PAST MEMBERSHIP WAS NOT A GROUND FOR HIS DEPORTATION. KESSLER V. STRECKER, 307 U.S. 22. IT WAS NOT UNTIL A YEAR LATER THAT PAST MEMBERSHIP WAS MADE A SPECIFIC GROUND FOR DEPORTATION. (FN1) THIS PAST MEMBERSHIP HAS COST NESTOR DEAR. IT BROUGHT HIM EXPULSION FROM THE COUNTRY AFTER 43 YEARS' RESIDENCE - MOST OF HIS LIFE. NOW MORE IS EXACTED FROM HIM, FOR AFTER HE HAD BEGUN TO RECEIVE BENEFITS IN 1955 - HAVING WORKED IN COVERED EMPLOYMENT THE REQUIRED TIME AND REACHED AGE 65 - AND MIGHT ANTICIPATE RECEIVING THEM THE REST OF HIS LIFE, THE BENEFITS WERE STOPPED PURSUANT TO SEC. 202(N) OF THE AMENDED SOCIAL SECURITY ACT. (FN2) HIS PREDICAMENT IS VERY REAL - AN AGING MAN DEPRIVED OF THE MEANS WITH WHICH TO LIVE AFTER BEING SEPARATED FROM HIS FAMILY AND EXILED TO LIVE AMONG STRANGERS IN A LAND HE QUIT 47 YEARS AGO. THE COMMON SENSE OF IT IS THAT HE HAS BEEN PUNISHED SEVERELY FOR HIS PAST CONDUCT. EVEN THE 1950 STATUTE DEPORTING ALIENS FOR PAST MEMBERSHIP RAISED SERIOUS QUESTIONS IN THIS COURT WHETHER THE PROHIBITION AGAINST EX POST FACTO LAWS WAS VIOLATED. IN GALVAN V. PRESS, 347 U.S. 522, 531, WE SAID \"SINCE THE INTRINSIC CONSEQUENCES OF DEPORTATION ARE SO CLOSE TO PUNISHMENT FOR CRIME, IT MIGHT FAIRLY BE SAID ALSO THAT THE EX POST FACTO CLAUSE, EVEN THOUGH APPLICABLE ONLY TO PUNITIVE LEGISLATION, SHOULD BE APPLIED TO DEPORTATION.\" HOWEVER, PRECEDENTS WHICH TREAT DEPORTATION NOT AS PUNISHMENT, BUT AS A PERMISSIBLE EXERCISE OF CONGRESSIONAL POWER TO ENACT THE CONDITIONS UNDER WHICH ALIENS MAY COME TO AND REMAIN IN THIS COUNTRY, GOVERNED THE DECISION IN FAVOR OF THE CONSTITUTIONALITY OF THE STATUTE. HOWEVER, THE COURT CANNOT REST A DECISION THAT SEC. 202(N) DOES NOT IMPOSE PUNISHMENT ON CONGRESS' POWER TO REGULATE IMMIGRATION. IT ESCAPES THE COMMON-SENSE CONCLUSION THAT CONGRESS HAS IMPOSED PUNISHMENT BY FINDING THE REQUISITE RATIONAL NEXUS TO A GRANTED POWER IN THE SUPPOSED FURTHERANCE OF THE SOCIAL SECURITY PROGRAM \"ENACTED PURSUANT TO CONGRESS' POWER TO 'SPEND MONEY IN AID OF THE \"GENERAL WELFARE.\"'\" I DO NOT UNDERSTAND THE COURT TO DENY THAT BUT FOR THAT CONNECTION, SEC. 202(N) WOULD IMPOSE PUNISHMENT AND NOT ONLY OFFEND THE CONSTITUTIONAL PROHIBITION ON EX POST FACTO LAWS BUT ALSO VIOLATE THE CONSTITUTIONAL GUARANTEES AGAINST IMPOSITION OF PUNISHMENT WITHOUT A JUDICIAL TRIAL. THE COURT'S TEST OF THE CONSTITUTIONALITY OF SEC. 202(N) IS WHETHER THE LEGISLATIVE CONCERN UNDERLYING THE STATUTE WAS TO REGULATE \"THE ACTIVITY OR STATUS FROM WHICH THE INDIVIDUAL IS BARRED\" OR WHETHER THE STATUTE \"IS EVIDENTLY AIMED AT THE PERSON OR CLASS OF PERSONS DISQUALIFIED.\" IT REJECTS THE INFERENCE THAT THE STATUTE IS \"AIMED AT THE PERSON OR CLASS OF PERSONS DISQUALIFIED\" BY RELYING UPON THE PRESUMPTION OF CONSTITUTIONALITY. THIS PRESUMPTION MIGHT BE A BASIS FOR SUSTAINING THE STATUTE IF IN FACT THERE WERE TWO OPPOSING INFERENCES WHICH COULD REASONABLY BE DRAWN FROM THE LEGISLATION, ONE THAT IT IMPOSES PUNISHMENT AND THE OTHER THAT IT IS PURPOSED TO FURTHER THE ADMINISTRATION OF THE SOCIAL SECURITY PROGRAM. THE COURT, HOWEVER, DOES NOT LIMIT THE PRESUMPTION TO THAT USE. RATHER THE PRESUMPTION BECOMES A COMPLETE SUBSTITUTE FOR ANY SUPPORTABLE FINDING OF A RATIONAL CONNECTION OF SEC. 202(N) WITH THE SOCIAL SECURITY PROGRAM. FOR ME IT IS NOT ENOUGH TO STATE THE TEST AND HOLD THAT THE PRESUMPTION ALONE SATISFIES IT. I FIND IT NECESSARY TO EXAMINE THE ACT AND ITS CONSEQUENCES TO ASCERTAIN WHETHER THERE IS GROUND FOR THE INFERENCE OF A CONGRESSIONAL CONCERN WITH THE ADMINISTRATION OF THE SOCIAL SECURITY PROGRAM. ONLY AFTER THIS INQUIRY WOULD I CONSIDER THE APPLICATION OF THE PRESUMPTION. THE COURT SEEMS TO ACKNOWLEDGE THAT THE STATUTE BEARS HARSHLY UPON THE INDIVIDUAL DISQUALIFIED, BUT STATES THAT THIS IS PERMISSIBLE WHEN A STATUTE IS ENACTED AS A REGULATION OF THE ACTIVITY. BUT SURELY THE HARSHNESS OF THE CONSEQUENCES IS ITSELF A RELEVANT CONSIDERATION TO THE INQUIRY INTO THE CONGRESSIONAL PURPOSE. (FN3) CF. TROP V. DULLES, 356 U.S. 86, 110 (CONCURRING OPINION). IT SEEMS TO ME THAT THE STATUTE ITSELF SHOWS THAT THE SOLE LEGISLATIVE CONCERN WAS WITH \"THE PERSON OR CLASS OF PERSONS DISQUALIFIED.\" CONGRESS DID NOT DISQUALIFY FOR BENEFITS ALL BENEFICIARIES RESIDING ABROAD OR EVEN ALL DEPENDENTS RESIDING ABROAD WHO ARE ALIENS. IF THAT HAD BEEN THE CASE I MIGHT AGREE THAT CONGRESS' CONCERN WOULD HAVE BEEN WITH \"THE ACTIVITY OR STATUS\" AND NOT WITH THE \"PERSON OR CLASS OF PERSONS DISQUALIFIED.\" THE SCALES WOULD THEN BE TIPPED TOWARD THE CONCLUSION THAT CONGRESS DESIRED TO LIMIT BENEFIT PAYMENTS TO BENEFICIARIES RESIDING IN THE UNITED STATES SO THAT THE AMERICAN ECONOMY WOULD BE AIDED BY EXPENDITURE OF BENEFITS HERE. INDEED A PROPOSAL ALONG THOSE LINES WAS SUBMITTED TO CONGRESS IN 1954, AT THE SAME TIME SEC. 202(N) WAS PROPOSED, (FN4) AND IT WAS REJECTED. (FN5) PERHAPS, THE COURT'S CONCLUSION THAT REGULATION OF \"THE ACTIVITY OR STATUS\" WAS THE CONGRESSIONAL CONCERN WOULD BE A FAIR APPRAISAL OF THE STATUTE IF CONGRESS HAD TERMINATED THE BENEFITS OF ALL ALIEN BENEFICIARIES WHO ARE DEPORTED. BUT THAT IS NOT WHAT CONGRESS DID. THE 18 GROUNDS FOR WHICH ALIENS MAY BE DEPORTED. (FN6) H.R. REP. NO. 1698, 83D CONG., 2D SESS. 25, 77, CITED BY THE COURT, DESCRIBES SEC. 202(N) AS INCLUDING PERSONS WHO WERE DEPORTED \"BECAUSE OF UNLAWFUL ENTRY, CONVICTION OF A CRIME, OR SUBVERSIVE ACTIVITY.\" THE ACTS AS NARCOTIC ADDICTION OR PROSTITUTION. THE COMMON ELEMENT OF THE 14 GROUNDS IS THAT THE ALIEN HAS BEEN GUILTY OF SOME BLAMEWORTHY CONDUCT. IN OTHER WORDS CONGRESS WORKED ITS WILL ONLY ON ALIENS DEPORTED FOR CONDUCT DISPLEASING TO THE LAWMAKERS. THIS IS PLAINLY DEMONSTRATED BY THE REMAINING FOUR GROUNDS OF DEPORTATION, THOSE WHICH DO NOT RESULT IN THE CANCELLATION OF BENEFITS. (FN7) TWO OF THOSE FOUR GROUNDS COVER PERSONS WHO BECOME PUBLIC CHARGES WITHIN FIVE YEARS AFTER ENTRY FOR REASONS WHICH PREDATED THE ENTRY. A THIRD GROUND COVERS THE ALIEN WHO FAILS TO MAINTAIN HIS NONIMMIGRANT STATUS. THE FOURTH GROUND REACHES THE ALIEN WHO, PRIOR TO OR WITHIN FIVE YEARS AFTER ENTRY, AIDS OTHER ALIENS TO ENTER THE COUNTRY ILLEGALLY. THOSE WHO ARE DEPORTED FOR BECOMING PUBLIC CHARGES CLEARLY HAVE NOT, BY MODERN STANDARDS, ENGAGED IN CONDUCT WORTHY OF CENSURE. THE GOVERNMENT'S SUGGESTION THAT THE REASON FOR THEIR EXCLUSION FROM SEC. 202(N) WAS AN UNARTICULATED FEELING OF CONGRESS THAT IT WOULD BE UNFAIR TO THE \"OTHER COUNTRY TO DEPORT SUCH DESTITUTE PERSONS WITHOUT LETTING THEM RETAIN THEIR MODICUM OF SOCIAL SECURITY BENEFITS\" APPEARS AT BEST FANCIFUL, ESPECIALLY SINCE, BY HYPOTHESIS, THEY ARE DEPORTABLE BECAUSE THE CONDITIONS WHICH LED TO THEIR BECOMING PUBLIC CHARGES EXISTED PRIOR TO ENTRY. THE EXCLUSION FROM THE OPERATION OF SEC. 202(N) OF ALIENS DEPORTED FOR FAILURE TO MAINTAIN NONIMMIGRANT STATUS RATIONALLY CAN BE EXPLAINED, IN THE CONTEXT OF THE WHOLE STATUTE, ONLY AS EVIDENCING THAT CONGRESS CONSIDERED THAT CONDUCT LESS BLAMEWORTHY. CERTAINLY THE GOVERNMENT'S SUGGESTION THAT CONGRESS MAY HAVE THOUGHT IT UNLIKELY THAT SUCH PERSONS WOULD WORK SUFFICIENT TIME IN COVERED EMPLOYMENT TO BECOME ELIGIBLE FOR SOCIAL SECURITY BENEFITS CANNOT BE THE REASON FOR THIS EXCLUSION. FOR FREQUENTLY THE VERY ACT WHICH EVENTUALLY RESULTS IN THE DEPORTATION OF PERSONS ON THAT GROUND IS THE SECURING OF PRIVATE EMPLOYMENT. FINALLY, IT IS IMPOSSIBLE TO RECONCILE THE CONTINUATION OF BENEFITS TO ALIENS WHO ARE DEPORTED FOR AIDING OTHER ALIENS TO ENTER THE COUNTRY ILLEGALLY, EXCEPT UPON THE GROUND THAT CONGRESS FELT THAT THEIR CONDUCT WAS LESS REPREHENSIBLE. AGAIN THE GOVERNMENT'S SUGGESTION THAT THE REASON MIGHT BE CONGRESS' BELIEF THAT THESE ALIENS WOULD NOT HAVE WORKED IN COVERED EMPLOYMENT MUST BE REJECTED. FIVE YEARS AFTER ENTRY WOULD BE AMPLE TIME WITHIN WHICH TO SECURE EMPLOYMENT AND QUALIFY. MOREOVER THE SAME FIVE-YEAR LIMITATION APPLIES TO SEVERAL OF THE 14 GROUNDS OF DEPORTATION FOR WHICH ALIENS ARE CUT OFF FROM BENEFITS AND THE GOVERNMENT'S ARGUMENT WOULD APPLY EQUALLY TO THEM IF THAT IN FACT WAS THE CONGRESSIONAL REASON. THIS APPRAISAL OF THE DISTINCTIONS DRAWN BY CONGRESS BETWEEN VARIOUS KINDS OF CONDUCT IMPELS THE CONCLUSION, BEYOND PERADVENTURE THAT THE DISTINCTIONS CAN BE UNDERSTOOD ONLY IF THE PURPOSE OF CONGRESS WAS TO STRIKE AT \"THE PERSON OR CLASS OF PERSONS DISQUALIFIED.\" THE COURT INVEIGHS AGAINST INVALIDATING A STATUTE ON \"IMPLICATON AND VAGUE CONJECTURE.\" RATHER I THINK THE COURT HAS STRAINED TO SUSTAIN THE STATUTE ON \"IMPLICATION AND VAGUE CONJECTURE,\" IN HOLDING THAT THE CONGRESSIONAL CONCERN WAS \"THE ACTIVITY OR STATUS FROM WHICH THE INDIVIDUAL IS BARRED.\" TODAY'S DECISION SANCTIONS THE USE OF THE SPENDING POWER NOT TO FURTHER THE LEGITIMATE OBJECTIVES OF THE SOCIAL SECURITY PROGRAM BUT TO INFLICT HURT UPON THOSE WHO BY THEIR CONDUCT HAVE INCURRED THE DISPLEASURE OF CONGRESS. THE FRAMERS ORDAINED THAT EVEN THE WORST OF MEN SHOULD NOT BE PUNISHED FOR THEIR PAST ACTS OR FOR ANY CONDUCT WITHOUT ADHERENCE TO THE PROCEDURAL SAFEGUARDS WRITTEN INTO THE CONSTITUTION. TODAY'S DECISION IS TO ME A REGRETFUL RETREAT FROM LOVETT, CUMMINGS AND GARLAND.", "images": ["http://www.ssa.gov/templateimages/blank.gif", "http://www.ssa.gov/templateimages/firstgov3.gif"], "top_img": "", "keywords": [], "authors": ["Ocomm Opum"], "canonical_link": "", "title": "Social Security Online History Pages", "meta_data": {"dc.language": "eng", "dc.creator": "OCOMM,OPUM", "lead_content_manager": "ldewit", "coder": "ldewit", "dc.description": "Social Security history", "dc.date.created": "prior to 2003", "dc.date.reviewed": "2005-11-21", "dc.title": "history", "dc.keywords": "Social Security history, Medicare history, Social Security Administration history"}, "movies": [], "publish_date": null, "source": "http://www.ssa.gov", "summary": ""}