{"url": "www.townandcountrymag.com/society/a15845582/what-matt-lauer-is-doing-now/", "text": "Lauer was ousted from NBC's morning show Today in 2017 over allegations of inappropriate sexual behavior in the workplace.\n\nHe has been keeping a low profile since losing his anchor position, spending time at his home in the Hamptons.\n\nHis divorce from Annette Roque was finalized last fall and he is reportedly dating a longtime acquaintance, Shamin Abas.\n\nNew allegations about Lauer's behavior toward one former NBC coworker have surfaced.\n\n\n\nNearly two years after former Today show host Matt Lauer was ousted for what NBC News chairman Andy Lack called \"inappropriate sexual behavior,\" the former anchor is beginning to move on from the life he had. Following the finalization of his divorce from his wife of almost two decades, Annette Roque, he is reportedly dating marketing and public relations executive Shamin Abas. According to multiple media outlets, they spent the holidays at his home in New Zealand.\n\nRead on for more about what Lauer has been doing lately.\n\n\n\nLaying Low After 'Today'\n\nSince his firing from the Today show in November 2017, Lauer has reportedly spent his days holed up in his Hamptons house, where he's been staying quiet and \"focused on family.\" That may soon change, as he is reportedly selling the $44 million home, apparently as part of his divorce settlement with Roque.\n\nMatt Lauer at a basketball game with his children Jack, Romy, and Thijs at Madison Square Garden in January 2016. James Devaney Getty Images\n\nAccording to reports from Page Six, Lauer and Rocque filed for an uncontested divorce in July of 2019, which was finalized by a Suffolk County Supreme Court judge in September. The couple had been separated for almost two years. The publication says that Lauer will pay Roque up to $20 million in a divorce and that she will retain the ownership of a horse farm that they jointly owned in the Hamptons.\n\nA source reportedly told the publication that the former couple, who have three children together, are now on good terms.\n\nLauer reportedly began dating Shamin Abas this fall. “Matt and Shamin have known each other for many years, as she spends a lot of time in the Hamptons, as does he,\" a source close to Lauer told Page Six. \"They very recently began dating, she is a lovely woman.”\n\nAbas at an event in the Hamptons last September. Jared Siskin Getty Images\n\nNew allegations against Lauer surfaced in October 2019.\n\nIn his book , Catch and Kill, journalist Ronan Farrow revealed new allegations from Lauer's former NBC coworker Brooke Nevils. She was the previously unnamed former NBC News employee whose complaint contributed to Lauer's firing. However, the full breadth of Nevils's allegations had never been made public, and in Farrow's book she reportedly alleges that she was anally raped by Lauer in his hotel room while attending the Sochi Olympics in 2014 on assignment for NBC.\n\nA statement released by NBC News stated that “Matt Lauer’s conduct was appalling, horrific and reprehensible, as we said at the time. That’s why he was fired within 24 hours of us first learning of the complaint. Our hearts break again for our colleague.”\n\nMatt Lauer in Sag Harbor on January 22, 2018 Splash News\n\nIn a statement to Variety through his lawyer, Lauer denied this allegation, saying that it is \"categorically false, ignores the facts, and defies common sense.”\n\nLauer Made Similar Denials in 2018\n\n\n\nIn April of 2018 the disgraced anchor made a statement to the Washington Post in which he said, \"I have made no public comments on the many false stories from anonymous or biased sources that have been reported about me over these past several months... I remained silent in an attempt to protect my family from further embarrassment and to restore a small degree of the privacy they have lost. But defending my family now requires me to speak up.\"\n\n\"I fully acknowledge that I acted inappropriately as a husband, father and principal at NBC. However I want to make it perfectly clear that any allegations or reports of coercive, aggressive or abusive actions on my part, at any time, are absolutely false.\"\n\nSavannah Guthrie, Matt Lauer, and Hoda Kotb in the Today studio on October 9, 2017 Getty Images\n\nHe followed that up in May in response to a report released by NBCUniversal following its internal investigation into the misconduct allegations that cost him his job. In a statement to Variety, Lauer said he was fired after \"admitting to past relationships with co-workers,\" but expressed his disagreement with \"certain aspects\" of the report.\n\n\n\n\"There are aspects of the NBC report with which I clearly disagree. However, I spent 25 wonderful years at the network, 20 of those at Today, and I’m extremely proud of what we accomplished as a team. On November 29, 2017, I was terminated by NBC after admitting to past relationships with co-workers. A day later I took responsibility for those relationships, apologized to the people I hurt and promised to begin the process of repairing the damage I had caused my family,\" Lauer said. \"I have worked every day since then to honor that promise.\"\n\nWill He Be Returning to TV?\n\nIn May 2019, CNN chief Jeff Zucker has assured CNN staffers that Lauer will not be appearing on the cable news network. The announcement, which came via an internal broadcast to CNN employees according to Page Six, appears to have been a direct result of Lauer making a rare public appearance at Zucker's birthday celebration last April.\n\nZucker previously served as an executive at NBC, including a stint as executive producer on the Today show while Lauer was at the helm, and the two are said to have remained friends even after parting ways professionally. Combined with his appearance at Zucker's party, this prompted some to speculate that Lauer might be planning a much-rumored return to the airwaves on CNN.\n\n\n\nJeff Zucker, Matt Lauer, and Al Roker at an event for The Metropolitan Opera House in New York in 2009. Patrick McMullan Getty Images\n\n\"In many ways the Matt rumors seemed to make sense, ratings on CNN’s morning show and across prime time have been flagging, and perhaps Matt could be brought back to revive the numbers, and his own career at the same time,\" one CNN insider reportedly told Page Six, adding that some senior female staffers at the network already had plans to refuse to work with Lauer. \"There was palpable relief in the office after Jeff confirmed Matt isn’t happening,\" the source said.\n\nHow Lauer's Departure Impacted Today\n\nWhile the allegations against Lauer that ultimately led to his firing were a surprise to many, a ratings review showed that the damage to Today has been significantly less dramatic than many experts had feared.\n\nIndeed, according to numbers obtained from the Nielsen company by USA Today, the NBC morning show averaged 4 million viewers each morning in late 2018, just 3% lower than its ratings before Lauer’s exit. By comparison, CBS This Morning, which lost anchor Charlie Rose around the same time as Lauer under another sexual misconduct scandal, is reportedly down 10% over the same time period.\n\n“There was concern when Matt Lauer left that they would be hurt more than turned out to be the case,” Garth Tiedje, an analyst and senior vice president at Horizon Media told USA Today.\n\nThe show's ability to maintain its audience is attributed in part to its long track record—Today first launched in 1952—as well as the success of replacement host Hoda Kotb. Kotb’s popularity among women is strong, essential considering that female viewers make up the bulk of Today's audience. In fact, according to Marketing Evaluations, Inc., her popularity score more than doubles Lauer’s last score among older women.\n\nMatt Lauer on a Harley-Davidson motorcycle in the Hamptons on June 7, 2018. MATT AGUDO/INSTARimages.com\n\nOn June 20, 2019, the NBC morning show shared a celebratory video on air showing special moments from throughout the show's history to mark 25 years on the air. While the five minute video shared a number of iconic moments from the show's run, fans were quick to point out that Lauer, who served on the show for 20 of its 25 year run, was notably missing from the clips.\n\nOpinions were divided on whether or not Lauer deserved to be in the anniversary video. While some felt that Lauer's behavior should disqualify him from being publicly acknowledged—\"Thank you for not including Matt Lauer you did the right thing,\" one Twitter user wrote—others felt that despite the allegations his long service on the show should not have been glossed over. Another Twitter fan argued, \"Amazing that a member of “the family” was totally excluded from the 25th Anniversary of Studio 1-A. I know there were serious issues with Matt Lauer and his conduct is not to ever be condoned, but all “families” are flawed in some way. Aren’t they? History shouldn’t be erased.\"\n\nThank you for not including Matt Lauer you did the right thing — Anneisafan (@anne_is_a_fan) June 20, 2019\n\nAmazing that a member of “the family” was totally excluded from the 25th Anniversary of Studio 1-A. I know there were serious issues with Matt Lauer and his conduct is not to ever be condoned, but all “families” are flawed in some way. Aren’t they? History shouldn’t be erased — Richard Iniguez (@riniguez23) June 20, 2019\n\nLauer wasn't the only former face of the show to be omitted from the anniversary, though. Viewers also noted that Ann Curry, who served as Lauer's co-anchor from 2011 to 2012, also did not appear in any of the clips chosen for the anniversary. Curry was unexpectedly forced out of her role on Today in 2012, a removal in which Lauer himself reportedly had a hand, leaving a particularly bitter taste in the mouths of fans who felt Curry, at least, deserved to be recognized.\n\nHow Lauer's Departure Impacted His Former Colleagues\n\nLauer and Gifford attended the opening night of Scandalous on Broadway in November 2012. Bruce Glikas Getty Images\n\nOn December 11, Kathie Lee Gifford announced on the fourth hour of Today, which she hosts with Hoda Kotb, that she will be leaving the show in the spring of 2019. The move comes a full year after Gifford had expected to make her final bows on the show.\n\nAccording to statements she made to People in 2018, she had informed the network in January of 2017 that she would be leaving to pursue film projects. Those plans fell by the wayside amid the turmoil that followed the misconduct allegations against Lauer and his subsequent removal.\n\n“Some things were painful for us. And we had to adjust, and then they said, ‘If we accommodate your schedule, will you consider staying?’\" she told People at the time. \"I wasn’t looking to get out, but I needed the time. So when they accommodated the schedule, then there was no reason to leave.\"\n\nJenna Bush Hager officially replaced Kathie Lee as co-host of the 10 o'clock hour in April of 2019.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/matt-lauer-house-1512422273.jpg?crop=1.00xw:1.00xh;0,0&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mv5bmjdlote4nwutmdfins00ndqyltljmdytm2mznjmwnzfjmzfixkeyxkfqcgdeqxvyntcymjmxmdaat-v1-1572933149.jpg?crop=1.00xw:0.752xh;0,0.0414xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/matt-lauer-attends-nbcs-today-at-rockefeller-plaza-on-news-photo-1570637122.jpg?crop=1.00xw:0.715xh;0,0.0320xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/matt-lauer-attends-nbcs-today-at-rockefeller-plaza-on-news-photo-1570637122.jpg?crop=1.00xw:0.715xh;0,0.0320xh&resize=1200:*", "keywords": [], "authors": ["Lauren Hubbard", "Lauren Hubbard Is A Freelance Writer", "Town", "Country Contributor Who Covers Beauty", "Shopping", "Entertainment", "Travel", "Home Decor", "Wine"], "canonical_link": "https://www.townandcountrymag.com/society/a15845582/what-matt-lauer-is-doing-now/", "title": "Latest News on Fired NBC Today Show Anchor", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#BE3E19", "og": {"type": "article", "site_name": "Town & Country", "title": "Matt Lauer Reportedly Dating Marketing and PR Exec Shamin Abas", "description": "The two spent time together at his New Zealand ranch over the holidays.", "url": "https://www.townandcountrymag.com/society/a15845582/what-matt-lauer-is-doing-now/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/matt-lauer-attends-nbcs-today-at-rockefeller-plaza-on-news-photo-1570637122.jpg?crop=1.00xw:0.715xh;0,0.0320xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 526594570689062, "pages": 344794953432}, "article": {"publisher": "https://www.facebook.com/TownandCountryMagazine", "modified_time": "2020-01-02 06:10:06", "published_time": "2020-01-02 02:00:00", "section": "Society", "opinion": "false"}, "twitter": {"site": "@TandCmag", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/matt-lauer-attends-nbcs-today-at-rockefeller-plaza-on-news-photo-1570637122.jpg?crop=1.00xw:0.715xh;0,0.0320xh&resize=640:*"}, "google-site-verification": "musQPiBADe3f4WpT4JNcg9uUChC3qnOhhPLSR4n1urM", "title": "What is Matt Lauer Doing Now? - Latest News on Fired NBC Today Show Anchor", "description": "Since his firing from the Today show in November 2017, many have asked, 'what will Matt Lauer do now?' Here's the latest on Matt Lauer and where he might be hiding out.", "keywords": "Matt Lauer, Annette Roque, what matt lauer is doing now, what will matt lauer do now, where is matt lauer now, matt lauer today, latest news on matt lauer, is matt lauer ill, where is matt lauer from the today show", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/matt-lauer-attends-nbcs-today-at-rockefeller-plaza-on-news-photo-1570637122.jpg?crop=0.704xw:1.00xh;0.149xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Society,society", "sailthru.date": "2020-01-02T14:00:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/matt-lauer-attends-nbcs-today-at-rockefeller-plaza-on-news-photo-1570637122.jpg?crop=1.00xw:0.715xh;0,0.0320xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/matt-lauer-attends-nbcs-today-at-rockefeller-plaza-on-news-photo-1570637122.jpg?crop=0.704xw:1.00xh;0.149xw,0", "sailthru.socialtitle": "Matt Lauer Reportedly Dating Marketing and PR Exec Shamin Abas", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1577901600.0, "source": "http://www.townandcountrymag.com", "summary": ""}