{"url": "www.inquisitr.com/3973627/tom-hiddlestons-gq-interview-not-pre-approved-by-taylor-swift/", "text": "Tom Hiddleston had nothing but nice words to say about Taylor Swift. Although their relationship ended just as fast as it began, the Thor: Ragnarok star said that he had no regrets and described the singer as an “amazing woman.” A new report, however, claimed that Hiddleston was only trying to stay on Swift’s good side.\n\nAccording to Radar Online, Tom Hiddleston is “scared” to cross Taylor Swift. After he found out that he’s doing an interview with GQ magazine, where he would definitely be asked about his relationship with Swift, the actor allegedly reached out to her people to “strategize” and come up with the right answers.\n\n“All his answers were pre-approved and very carefully constructed. Even his reason for wearing a tank top with ‘I heart T.S.’ was all pre-planned.”\n\nGiven Swift’s infamous reputation with her exes, insiders close to Hiddleston revealed that he did not want to get on Swift’s bad side, thinking that she is one of the most powerful people in the music industry.\n\n“It’s like he is scared of her. She is one of the most powerful people in the business and no one wants to cross her,” they explained.\n\nhttps://www.instagram.com/p/BQH3OsmBB4F/?taken-by=taylorswift&hl=en\n\nHowever, it did not take long before Gossip Cop debunked the rumor, calling it nothing but bogus and fabricated. After reaching out to a reliable source close to Tom Hiddleston, the site confirmed that his answers to recent interview concerning Taylor Swift were not pre-approved by the singer.\n\nFor the first time, Tom Hiddleston opened about his relationship to Taylor Swift on his GQ cover story. Contrary to early reports, the actor explained that there was no bad blood between them. He also had nothing but nice words to say about the Grammy winner.\n\n“Taylor is an amazing woman. She’s generous and kind and lovely, and we had the best time,” he said.\n\nAlthough many claimed that Tom Hiddleston and Taylor Swift’s relationship was nothing but a publicity stunt, the Crimson Peak star insisted that what he and Swift had was real. Hiddleston, however, admitted that he was surprised with the amount of attention they received from both the fans and the media. He shared that he had to be psychologically strong and not let people’s interpretations about their relationship affect his life.\n\nHiddleston said that he had no regrets being with Swift. Though it was short, he shared that their relationship taught him so much about love.\n\n“If your values are under attack, if you’re being shamed, if you’re being humiliated, the animal response is to hide in the bush. It’s to be less, to make yourself smaller, to diminish in size and volume. And the lesson of 2016 is we have to love more, we have to risk more, we have to be braver, we have to be more outspoken.”\n\nhttps://www.instagram.com/p/BQQfB_agHEb/?taken-by=gq&hl=en\n\nMeanwhile, Lena Dunham came to Taylor Swift’s defense after the Grammy winner received backlash following her split with Tom Hiddleston. In an interview with Howard Stern on his SiriusXM radio show, via Us Weekly, the Girls star said that it was really unfair how the press had been so critical of Swift and her dating life.\n\n“I mean, not to repeat age-old feminist points, but it’s like, you know, any male actor her age who’s going out and dating is applauded, and to just have a perfectly normal amount of romantic partners but be held to impossibly high standards by the press, like, it’s just an unfair and unwinnable game,” Dunham explained.\n\nTell us! What do you think of Tom Hiddleston’s GQ interview? Are people really being too hard on Taylor Swift’s dating life? Sound off in the comments below.\n\n[Featured Image by Kevin Winter/Getty Images]", "images": ["https://secure.gravatar.com/avatar/ae76549580e09aba62643764aa212f53?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2017/02/Taylor-Swift.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Precious Del Valle"], "canonical_link": "https://www.inquisitr.com/3973627/tom-hiddlestons-gq-interview-not-pre-approved-by-taylor-swift/", "title": "Tom Hiddleston’s GQ Interview Not ‘Pre-Approved’ By Taylor Swift", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}