{"url": "https://www.huffingtonpost.com/entry/the-bachelorette-jordan-kimball-tinder-david-ravitz_us_5b1f2ddde4b0bbb7a0e08c5c", "text": "On this week’s episode of “The Bachelorette,” a male model claimed to have a 100 percent swipe-to-match success rate on Tinder, and a guy who showed up in a chicken suit broke his face by falling out of a bunk bed.\n\nYou can’t make this stuff up.\n\nThe two (highly entertaining, somewhat delightful) doofuses in question are Jordan Kimball, a male model from Florida, and David Ravitz, a venture capitalist from New Jersey. Seeds of an impending feud were planted at the beginning of the season, and now that we’re at Week 3, it’s revving up. It’s unclear exactly why they hate each other so much, but the enmity is real, and it’s reality television gold.\n\nDuring a group date, male model Jordan claims to have gotten more than 4,000 matches on Tinder during 2017. He also says that every woman he swipes right on also swipes right on him ― hence the 100 percent swipe-to-match rate. (HuffPost reached out to Tinder to fact check these claims but did not hear back.)\n\nI am ashamed to admit that I was one of Jordan from #theBachlorette ‘s 4000 tinder matches 🤦🏼‍♀️ — Cassie Livingston (@heyitscassie13) June 12, 2018\n\nDavid continues to needle Jordan about his Tinder habits until the Wilhemina model cracks and delivers a monologue of epic proportions.\n\n“You think I’m a joke. I’m a Wilhemina model,” he says. “I don’t think you know what that means. I have an image. If you’re trying to tear down my image and my three-year contract ... it’s actually pretty serious. It’s something some people consider the top.... If you’re trying to wreck my image, you’ll never succeed. Because, do you know why? Because my image is me.”\n\nHuffPost’s Emma Gray chatted all about Jordan and David with actress and “Bachelor” fan Erin Darke on the “Here to Make Friends” podcast:\n\nGray: So Jordan makes a few claims on this group date. One, he claims he got a notification from Tinder that he got 4,000 matches in 2017. My colleague Maxwell is emailing Tinder to fact-check these claims. (Update: We did not hear back from Tinder.) But I’ve never heard of such a notification. Maybe it does exist, and I guess if you’re swiping on tons of people every day of the year, it wouldn’t be that hard to get 4,000 matches. You’d have to get 10-12 matches a day.\n\nDarke: But you’re talking about every day.\n\nGray: And Jordan says he didn’t [use Tinder] every day. He also says he’s very selective.\n\nDarke: There’s no way you get 4,000 matches if you’re very selective. Those things are in opposition.\n\nGray: But there’s an even more wild claim that Jordan makes. David is just needling him and he says, “What do you think your match percentage is, Jordan?” And Jordan says, “100 percent.”\n\nAnyone who has online-dated knows that’s a wild claim. The algorithm [of Tinder and similar apps] intentionally serves you people who haven’t matched you mixed in with people who have. Because it’s a game! I don’t believe anyone has a perfect swipe-to-match rate. Unless you’ve only swiped on one person.\n\nDarke: But apparently Jordan’s swiped on 4,000! Also, what a weird thing to bring up on a date, and then to brag about and then to lie about!\n\nGray: And then, of course, David is just a little shit-stirrer. I know a lot of people are kind of down on David, but I’m still sort of into him. I feel like I know people like him.\n\nDarke: I also feel like if I was stuck in a house with literally nothing to do with Jordan for weeks, it would be really hard not to play with him.\n\nGray: Yeah. It’s not the kindest way to act, but... And I do think [Jordan] will ultimately be David’s undoing. But, for now, I’m enjoying it.\n\nDarke: I am, too. It makes for great TV.\n\nGray: David’s also so transparent. He goes to Becca and says, “I’m not one to throw people under the bus, but...”\n\nDarke: “I don’t throw people under the bus, but there is a bus coming and Jordan has a date with it.”\n\nGray: And then Becca, who obviously is not into Jordan, just goes up to him and is like, “Jordan, 4,000 matches, eh?” And Jordan just becomes enraged. Meanwhile, Wills has fully burrowed into the couch by that point.\n\nDarke: He was trying to make himself a part of the furniture.\n\nGray: But Jordan talks to Becca and explains that he’s like a golden retriever as a partner. He’s loyal, he’s dependable and he loves a good girls’ day! I mean... good qualities.\n\nDarke: But I also feel like he had a weird pause in that speech. First he said, “I cook, I clean, I am a golden retriever.” And then there was a pause. And then he was like, “I’m loyal.” I was watching it wondering if he thinks cooking and cleaning are golden retriever qualities?\n\nGray: He grew up with a very intelligent golden retriever.\n\nDarke: Oh, I enjoy him so much.\n\nFor more on “The Bachelorette,” listen to “Here to Make Friends”:\n\nDo people love “The Bachelor,” “The Bachelorette” and “Bachelor in Paradise,” or do they love to hate these shows? It’s unclear. But at “Here to Make Friends,” we both love and love to hate them — and we love to snarkily dissect each episode in vivid detail. Podcast edited by Nick Offenberg.", "images": ["https://www.facebook.com/tr?id=10153394098876130&ev=PageView&noscript=1", "https://img.huffingtonpost.com/asset/5d88f91b2100003200dab6d8.png", "https://s.m.huffpost.com/assets/H-icon-72fd5782b36a1a42ab82a4af65cbc6dd6ddc4d4a71190a91c5cfaab7c66fd836.svg", "https://img.huffingtonpost.com/asset/5b2080ee1a0000c704ce15cd.png?cache=2jeeneno6f&ops=1778_1000", "https://sb.scorecardresearch.com/p?c1=2&c2=6723616&c3=&c4=&c5=&c6=&c15=&cj=1", "https://img.huffingtonpost.com/asset/56730fed1600001400eb924a.jpg?ops=100_100", "https://s.m.huffpost.com/assets/HuffPostHero-d783f680fb974e80346bdfa145131d058e596e1d32f791981875aa481702c770.svg", "https://img.huffingtonpost.com/asset/5cacf4f424000030074f66b5.jpg?ops=100_100", "https://www.facebook.com/tr?id=1621685564716533&ev=PageView&noscript=1"], "top_img": "https://img.huffingtonpost.com/asset/5b2080ee1a0000c704ce15cd.png?cache=2jeeneno6f&ops=1778_1000", "keywords": [], "authors": ["Senior Women'S Reporter", "Senior Audio Producer"], "canonical_link": "https://www.huffpost.com/entry/the-bachelorette-jordan-kimball-tinder-david-ravitz_n_5b1f2ddde4b0bbb7a0e08c5c", "title": "A Male Model Made Wild Claims About Tinder On 'The Bachelorette'", "meta_data": {"google-site-verification": "97Mj-wW7u8U1NOnkW1rfH-I1kgO0-a9YsgoesOk41R8", "oath": {"guce": {"product-eu": "false", "consent-host": "guce.huffpost.com", "locale": "en-US", "inline-consent": "true"}}, "fb": {"pages": 70242384902, "app_id": 46744042133}, "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "description": "Jordan Kimball continues to be a gift to production.", "keywords": "Reality TV,tinder,the bachelorette tv series", "og": {"title": "A Male Model Made Wild Claims About Tinder On 'The Bachelorette'", "type": "article", "image": {"identifier": "https://img.huffingtonpost.com/asset/5b2080ee1a0000c704ce15cd.png?cache=2jeeneno6f&ops=1778_1000", "url": "https://img.huffingtonpost.com/asset/5b2080ee1a0000c704ce15cd.png?cache=2jeeneno6f&ops=1778_1000", "type": "image/png", "width": 1778, "height": 1000}, "url": "https://www.huffpost.com/entry/the-bachelorette-jordan-kimball-tinder-david-ravitz_n_5b1f2ddde4b0bbb7a0e08c5c", "site_name": "HuffPost", "locale": "en_US", "description": "Jordan Kimball continues to be a gift to production."}, "article": {"tag": "Reality TV,tinder,the bachelorette tv series", "section": "Entertainment", "author": "https://www.facebook.com/emma.rose.gray.1", "published_time": "2018-06-12 23:16:10 -0400", "modified_time": "2018-06-12 23:16:10 -0400"}, "twitter": {"card": "summary_large_image", "site": "@HuffPostEnt", "title": "A Male Model Made Wild Claims About Tinder On 'The Bachelorette'", "image": {"identifier": "https://img.huffingtonpost.com/asset/5b2080ee1a0000c704ce15cd.png?cache=2jeeneno6f&ops=1778_1000", "width": 1778, "height": 1000}, "description": "Jordan Kimball continues to be a gift to production.", "creator": "emmaladyrose"}, "al": {"ios": {"url": "huffpostnews:///?editionID=us&entryID=us_5b1f2ddde4b0bbb7a0e08c5c", "app_store_id": 306621789, "app_name": "HuffPost"}}, "taboola.category": "entertainment"}, "movies": [], "publish_date": 1528859770.0, "source": "https://www.huffingtonpost.com", "summary": ""}