{"url": "collider.com/deadpool-brianna-hildebrand-negasonic-teenage-warhead-interview/", "text": "Last year, when director Tim Miller’s Deadpool movie was filming in Vancouver, I got to visit the set with a few other reporters. While I’ve been able to visit a number of movie sets while they’ve been filming, getting to see Deadpool get made was something special because of the passion of everyone involved. In case you aren’t aware, Miller, Ryan Reynolds, and screenwriters Rhett Reese and Paul Wernick had spent many years trying to get Fox to give them the greenlight and shortly after some test footage leaked and the fan reaction was beyond enthusiastic, Fox finally gave them the go ahead to make their movie – with the added bonus of allowing it to be rated R. While on set, I got the feeling they were making something special, but now that I’ve seen the finished film, I can happily report the movie is even better than I hoped. Not only is Deadpool a hard R superhero film, it pushes the boundaries of what a comic book movie can show and do and allows the genre to expand into new areas. The fact is, the only way for the “superhero movie” to survive is by making sure each film does something new. Deadpool absolutely does that.\n\nWhile on set I got to participate in a group interview with Brianna Hildebrand, the young actress who plays mutant Negasonic Teenage Warhead in the film. She talked about her character and her relationship to Deadpool, being part of her first big movie, how Ryan Reynolds was her childhood crush, her character’s piercings, working alongside someone doing motion-capture on set, and a lot more. Check out what she had to say below.\n\nQuestion: Start by introducing yourself and your character and her relationship to Deadpool.\n\nBrianna Hildebrand: I am Brianna Hildebrand, I play Negasonic Teenage Warhead. She is a 15 year old psychic, she reads the future, and she also is her own personal cannonball, she’s a warhead. So she runs at things and explodes at them, and she’s Colossus’ sidekick. Her relationship with Deadpool is friendly, it’s like a brother-sister relationship. They don’t really get along but they’re on the same side, so, yeah.\n\nYour character was only in one comic book before she was killed, so I’m curious, you get to create this character for the audience, so what’s it like to take what little there is and build off it?\n\nHildebrand: It’s awesome, yeah, for my character development it was really great because I could literally give her my own biography, I could give her whatever I wanted her to be. It’s been fun, I’m really excited about it.\n\nYou’re relatively new to the film world, was it daunting to step on a set this massive?\n\nHildebrand: It was, I was so afraid because everyone knows what they’re doing and I was like “Hey, what’s going on? Let me know.” Once I got here it was so much fun, and has been so much fun, everyone’s like so chill, it’s awesome. Everyone is pretty understanding. Also, since it’s Tim’s first time directing I was like “We’re in this together man! We got this! I believe in you!”\n\nWhat’s the coolest thing you’ve done so far in the film?\n\nHildebrand: The coolest thing is probably just all the stunts. The stunts are my favorite part, the stunts that I get to do anyway. Like when Angel Dust throws me, that was so fun because they put you on this string bungee cord thing and they throw you in the air, and you’re like, “Whoooaaa.” I think I love the stunts the most of everything.\n\nWhat kind of training have you had like fighting or anything like that?\n\nHildebrand: I trained in Muay Thai for a few months before I got out here, because I was a dancer before but I had never done any kind of fighting so I was like I should probably look like I can kick someone’s ass. I’ve done a lot of boxing, which I really enjoy, but that’s really the training that I did, and a lot of sprinting because she runs at things.\n\nIn terms of her looks did you bring something personally, for her look physically?\n\nHildebrand: I think maybe the fact that I have a shaved head would be a look that I bring. I really love everything that she wears, and all of her outfits is actually stuff that I would actually wear, I was so excited about it all. I was like “Aw the studs, so cool, she’s badass.”\n\nDid you go all the way with the piercings?\n\nHildebrand: I actually already had all of this happening, and when I auditioned I actually had my septum ring flipped up, so they didn’t know I had it, but they saw it in a picture and they were like ‘Oh that’s really cool.’ I’ve had my head shaved for like a year and I’ve had my piercings for like a year. It’s cool that they loved all of it and cool that they could be useful.\n\nWhat’s the biggest surprise in terms of being on set and making a movie, was there something you were really shocked about?\n\nHildebrand: Probably just how friendly everyone was, I don’t know, and also how slowly things go, because there are so many people, like how slowly it takes to film certain scenes and to set up for another shot takes like fifteen minutes because everyone is getting ready to set up. I dunno, it’s crazy. I didn’t think about how many factors played into filming and stuff. It’s really cool though.\n\nCan you talk a little about working with Ryan Reynolds?\n\nHildebrand: Ryan is great, he’s super cool. Ryan Reynolds was my childhood crush. His name is all over the walls of my room, I actually photoshopped myself into a picture with him my freshman year of high school. I was hardcore obsessed so it’s crazy how this all worked out. When I auditioned for this film I actually didn’t really have any kind of idea what I was auditioning for, or that he had anything to do with it, but for my call back I was like “Oh my god! What!” So yeah, it’s cool working with him. He’s awesome.\n\nHave you admitted that to him?\n\nHildebrand: Oh yeah, my first day on set I brought the picture and everything. I was like, “check it out!” I was more excited about it than they were.\n\nWhat was it that you saw Ryan Reynolds in when you were young?\n\nHildebrand: I saw him in The Proposal, I saw him in a lot of stuff, I saw him in the Green Lantern. I remember watching that in my room. Everything though because I was obsessed with him, everything he was in just because he was in it.\n\nHas Blake pulled you aside and said…\n\nHildebrand: I don’t know that she knows, if not, sorry Blake. She’s really sweet though so it would probably be okay. She’d be like, “I understand, my husband is a hot piece of meat” and I’d say “Yeah, go you girl, 10/10.”\n\nAre you in any of these (concept art)?\n\nPublicist: Here she is, exploding into action.\n\nHildebrand: It looks like, maybe, the thing is for the exploding and stuff we film up to the explosion obviously and then it’s the effects. She explodes like three times, I think we’ve filmed one of them so far, maybe two. It’s just strange because of how it’s filmed, we go up to the explosion and then we start filming after the explosion so it’s kind of hard to tell like where the explosion is or where the explosion is type thing. We’ve at least filmed one so far.\n\nThere’s obviously a lot of back story, a lot of comics, did you read a lot of the comics? Did you discover something about Deadpool in general that you were happy to see incorporated into the movie?\n\nHildebrand: I was really focused into my character because I couldn’t find anything about her and it was actually stressing me out a little bit, but I borrowed a few comics, Deadpool comics from Ed (Skrein) actually, my co-star, he plays Ajax. He’s a comic book nerd, straight up, he has all of them. So I borrowed some from him and I was reading through a few of them, I haven’t really got that much into them. I’ll let you know. I’m on volume two of the complete Deadpool series, go me.\n\nYou’re spending a lot of time working next to a gigantic man wearing a motion capture suit who is playing Colossus, can you talk about that? Are you visualizing the final character when you’re working with him?\n\nHildebrand: Kind of, it’s hard because I don’t actually know what he’s going to look like in the end. It can be a little difficult talking to him with the thing on his head. I started making fun of him, calling him a tellytubby. For the most part I just imagine a giant titanium guy, I’m really excited to what he looks like actually at the end and be like, ‘Oh thats who I’m talking to.’\n\nHow tall is he?\n\nHildebrand: Without his things, he’s like 6’8”.\n\nPublicist: 6’8” and then 8” platforms on set for the motion capture.\n\nHildebrand: I told him I was going to try them (his shoes) on. I told him I’m going to try them on by the end.\n\nHave you listened to the song that is the namesake for your character?\n\nHildebrand: Yeah, by Monster Magnet? It’s on my playlist, I gave her a nice rock playlist that I listen to in the morning so I get in the zone. I love it, I jam.\n\nDeadpool is in theaters this weekend.", "images": ["https://cdn.collider.com/wp-content/uploads/2015/07/deadpool-movie-image-wade-wilson-600x400.jpg", "https://cdn.collider.com/wp-content/uploads/2020/03/devs-alex-garland-thumbnail-171x160.jpeg", "https://collider.com/wp-content/themes/collider-v3/images/Collider_Logo_Dark.png", "https://cdn.collider.com/wp-content/uploads/2015/07/deadpool-movie-image-ed-skrein-ajax-600x399.jpg", "https://cdn.collider.com/wp-content/uploads/2016/01/deadpool-400x600.jpg", "https://cdn.collider.com/wp-content/uploads/2020/04/armageddon-ben-affleck-liv-tyler-thumbnail-171x160.jpg", "https://cdn.collider.com/wp-content/uploads/2020/01/justice-league-dark-thumbnail-171x160.jpeg", "https://collider.com/wp-content/themes/collider-v3/images/close-circle-512.png", "https://www.facebook.com/tr?id=1628636477376373&ev=PageView&noscript=1", "https://cdn.collider.com/wp-content/uploads/2019/09/peacock-thumbnail-171x160.jpg", "https://cdn.collider.com/wp-content/uploads/2015/07/deadpool-movie-image-brianna-hildebrand-negasonic-teenage-warhead-399x600.jpg", "https://cdn.collider.com/wp-content/uploads/2015/07/deadpool-ryan-reynolds-brianna-hildebrand-600x400.jpg", "https://collider.com/wp-content/themes/collider-v3/images/Collider_Logo_Light.png", "https://cdn.collider.com/wp-content/uploads/2015/07/deadpool-ryan-reynolds-brianna-hildebrand.jpg", "https://cdn.collider.com/wp-content/uploads/2015/04/deadpool-brianna-hildebrand.jpg", "https://cdn.collider.com/wp-content/uploads/2015/07/deadpool-ryan-reynolds-brianna-hildebrand-slice-600x200.jpg", "https://cdn.collider.com/wp-content/uploads/2019/11/mad-max-fury-road-charlize-theron-thumbnail-171x160.jpg"], "top_img": "https://cdn.collider.com/wp-content/uploads/2015/07/deadpool-ryan-reynolds-brianna-hildebrand.jpg", "keywords": [], "authors": ["Steve 'Frosty' Weintraub"], "canonical_link": "https://collider.com/deadpool-brianna-hildebrand-negasonic-teenage-warhead-interview/", "title": "‘Deadpool’: Brianna Hildebrand on Negasonic Teenage Warhead, Ryan Reynolds, and More", "meta_data": {"msapplication-square70x70logo": "/smalltile.png", "msapplication-square150x150logo": "/mediumtile.png", "msapplication-wide310x150logo": "/widetile.png", "msapplication-square310x310logo": "/largetile.png", "description": "Steve talks with Brianna Hildebrand about her debut role as Negasonic Teenage Warhead in Deadpool, working with Ryan Reynolds, character design, and more.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "'Deadpool': Brianna Hildebrand on Negasonic Teenage Warhead, Ryan Reynolds, and More", "description": "Steve talks with Brianna Hildebrand about her debut role as Negasonic Teenage Warhead in Deadpool, working with Ryan Reynolds, character design, and more.", "url": "https://collider.com/deadpool-brianna-hildebrand-negasonic-teenage-warhead-interview/", "site_name": "Collider", "updated_time": "2019-09-24T23:36:39+00:00", "image": {"identifier": "https://cdn.collider.com/wp-content/uploads/2015/07/deadpool-ryan-reynolds-brianna-hildebrand.jpg", "secure_url": "https://cdn.collider.com/wp-content/uploads/2015/07/deadpool-ryan-reynolds-brianna-hildebrand.jpg"}}, "article": {"publisher": "https://www.facebook.com/colliderdotcom", "tag": "Tim Miller", "section": "Interviews", "published_time": "2016-02-08T17:10:36+00:00", "modified_time": "2019-09-24T23:36:39+00:00"}, "fb": {"app_id": 190932086012, "pages": 160246414365}, "twitter": {"card": "summary_large_image", "description": "Steve talks with Brianna Hildebrand about her debut role as Negasonic Teenage Warhead in Deadpool, working with Ryan Reynolds, character design, and more.", "title": "Deadpool: Brianna Hildebrand on Her Marvel Debut, and More", "site": "@collidernews", "image": "https://cdn.collider.com/wp-content/uploads/2015/07/deadpool-ryan-reynolds-brianna-hildebrand.jpg", "creator": "@colliderfrosty"}, "generator": "WordPress 5.3.2", "ia": {"markup_url": "https://collider.com/deadpool-brianna-hildebrand-negasonic-teenage-warhead-interview/?ia_markup=1"}, "msvalidate.01": "F97A06145E9767C313B356E7E5B833F3", "viewport": "width=device-width", "google-site-verification": "rtgRWlKYqmg2IwU4e9PBjtt31jXoTjotyW6iJbyqdyc", "verify-v1": "ag44RccQF3Xr4VqGQnxB+TOx8+rCP4SHaCwwGAtuWzc="}, "movies": [], "publish_date": 1454951436.0, "source": "http://collider.com", "summary": ""}