{"url": "https://www.bustle.com/p/cardi-bs-be-careful-video-shows-her-as-both-angelic-bride-a-widow-video-9157327", "text": "It's not the first story to start with a wedding and end with a funeral, but Cardi B dropped her \"Be Careful\" music video on Monday, and it shows the rapper as both a bride and widow. The video opens with the rapper walking ominously through the desert, a white cross in hand. Then, it cuts to a wedding in a small chapel, with Cardi in a big white dress. Of course, it doesn't seem that this holy union ended well, as soon she's leaning over her lover's coffin at his funeral. In the final scene, she drives into the wilderness to rest the wooden cross on the grave. The video concept goes well with the song, which is a warning to an unfaithful lover. \"The only man, baby, I adore, I gave you everything, what's mine is yours,\" Cardi B raps. \"I want you to live your life of course, but I hope you get what you dyin' for.\"\n\nAccording to Spin, Jora Frantzis, a photographer and director, brought the themes from the song into the music video. Frantzis has collaborated with Cardi B in the past, and is also behind the album art for her debut, Invasion of Privacy. As Spin notes, for this song, Frantzis seems to have taken a page from Quentin Tarantino's Kill Bill, which also features a similar wedding scene. The film is all about revenge, so it's a fitting reference for a song and video about a wronged lover. It borrows the desert church location, but the design of the music video is distinct to Cardi B's style and aesthetic.\n\nCardi B on YouTube\n\nIn April, Cardi B performed \"Be Careful\" on Saturday Night Live and revealed during the performance that she was expecting her first child with fiancé Offset. In the past, fans have speculated that the song is about her current partner. Cardi has since dispelled these rumors in interviews, arguing the track is about past relationships, meant to tell of a universal experience, and recorded long before getting engaged.\n\nIn an interview with Ebro Darden for Beats 1, she addressed the Offset rumors head on. \"No, I wasn't talkin' about Offset, I just was talkin' about things that I relate to and that have happened to me. You just think about different types of things that you went with different type of men,\" she told the host. \"First of all, I heard the record before I even like was in love with Offset. Our relationship is like, at first we liked each other, but it was very protective of each other because people would put things in your ears and it's like I gotta protect my heart.\"\n\nChristopher Polk/Getty Images Entertainment/Getty Images\n\nThis doesn't mean the musical couple's relationship has been without controversy. In February, rumors that the Migos rapper was cheating on Cardi B spread online. Once again, she shut down the critics in an interview with Cosmopolitan. “It’s like everybody is coming down my neck, like, ‘Why are you not leaving him? You have low self-esteem.’ I don’t have low self-esteem,” Cardi said in the interview. “I know I look good, I know I’m rich, I know I’m talented. I know I could get any man I want — any basketball player, football player. But I want to work out my sh*t with my man, and I don’t got to explain why.\" She continued, \"I’m going to take my time, and I’m going to decide on my decision … It’s not right, what he f*cking did — but people don’t know what I did, ’cause I ain’t no angel.”\n\nIn light of her recent success, the rapper has every reason to clap back at critics. According to Forbes, her first album, Invasion of Privacy, is certified gold by the RIAA and it debuted at #1 on the Billboard charts. \"Be Careful\" is just one of the album's hit singles to debut in the Billboard Hot 100, including \"Bodak Yellow\", \"Bartier Cadi\", and \"Drip\". She's also featured on Bruno Mars chart-topping son, \"Finesse\", which she performed at the 60th Grammy Awards.\n\nIt doesn't seem like Cardi B's reign over the music industry will end anytime soon, and the video for \"Be Careful\" is just the latest way her star power continues to flourish.", "images": ["https://imgix.bustle.com/uploads/image/2018/5/21/07aae05a-ef2d-4df0-87dd-719c0b123972-screen-shot-2018-05-21-at-122210-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/11/157ce083-46d3-4c39-b85d-4d73fdc1dbac-getty-1204035319.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/5/21/ba0d29dd-3938-4cf2-a493-2775432ff0a5-getty-911539286.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2020/3/31/6e92d705-571e-40ca-aa4e-4cfe1cfd7721-gettyimages-518037594.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/5/21/07aae05a-ef2d-4df0-87dd-719c0b123972-screen-shot-2018-05-21-at-122210-pm.png?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/9/e61dc5d5-dfaf-4ecc-b137-2b8d9c48ab2d-getty-1209101385.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2020/4/6/6ec3dcb8-566d-4631-88db-11d6dac03c81-8955bb08-cd84-48c9-b83d-bc8ad846cb05-getty-161442774.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/5/21/07aae05a-ef2d-4df0-87dd-719c0b123972-screen-shot-2018-05-21-at-122210-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/cardi-bs-be-careful-video-shows-her-as-both-angelic-bride-a-widow-video-9157327", "title": "Cardi B’s “Be Careful” Video Shows Her As Both An Angelic Bride & A Widow — VIDEO", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/cardi-bs-be-careful-video-shows-her-as-both-angelic-bride-a-widow-video-9157327", "type": "article", "title": "Cardi B’s Video For “Be Careful” Is Here & She Gets To Play Both A Bride & A Widow", "description": "It's not the first story to start with a wedding and end with a funeral, but Cardi B dropped her \"Be Careful\" music video on Monday, and it shows the rapper as both a bride and widow. The video opens with the rapper walking ominously through the…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/5/21/07aae05a-ef2d-4df0-87dd-719c0b123972-screen-shot-2018-05-21-at-122210-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "It's not the first story to start with a wedding and end with a funeral, but Cardi B dropped her \"Be Careful\" music video on Monday, and it shows the rapper as both a bride and widow. The video opens with the rapper walking ominously through the…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}