{"url": "later.com/blog/instagram-themes/", "text": "Building a consistent Instagram theme for your feed is super important if you want to attract more followers and engagement.\n\nBut with so many Instagram themes to choose from, it can difficult knowing where (and how) to start!\n\nWhat makes the most sense for your business? How do you edit your photos in a consistent way? Should you create a color palette?\n\nTo give you a hand, we put together this list of 20 awesome Instagram themes with advice on how to incorporate them into your own account. Check it out!\n\nNote: If you want a ton of awesome tips on how to create a beautiful Instagram feed, just sign up for our free Instagram training course here!\n\n1. @vitruvi’s Inspirational Instagram Theme\n\nAs a highly visual brand in the aromatherapy space, Vitruvi is all about inspiring their followers — and it shows on their Instagram feed.\n\n“We know the Vitruvi woman, what she cares about, and the other things she loves,” says Sara Panton, co-founder of Vitruvi. “We know her days are really busy. So we’ll never put out a piece of content unless 1. She’s learning something, or 2. It’s inspiring her to live a better life.”\n\nIt’s certainly true. Vituvi’s feed is filled with stunning images of women doing everything from shopping at a farmer’s marketing to making a homemade smoothie for breakfast.\n\nAs Panton says, “It’s really just telling the story of her day.”\n\nA post shared by VITRUVI (@vitruvi) on Sep 2, 2017 at 8:05am PDT\n\n\n\nBut given that Vitruvi posts on Instagram 2-3 times per day, how do they keep their feed so consistent? According to Panton, it takes a lot of planning.\n\n“Our planning is seasonal, it’s quarterly, and then we kind of break it down by month,” says Panton. “And then sometimes we’ll use a really random piece of inspiration. For example, for summer it was watermelon. All of our tones and photography pulled from the colors of a watermelon. So whether it would be a cream rind, and a little bit green with pink, and our black bottles being the seeds.”\n\n“It’s a theme we used unintentionally through the quarter, and you probably wouldn’t pick up on it, but it just acts as subtle way of talking about what season it is through the year,” Panton says.\n\n\n\n2. @k.els.e.y’s Minimal & Neutral Instagram Theme\n\nFashion and beauty vlogger Kelsey Simone has achieved a ton of success on her YouTube channel, but the real success story is her Instagram account, which has over 650,000 followers to date.\n\nFor those looking to emulate Simone’s minimalist Instagram theme, she has a few key pieces of advice.\n\n“One of the key elements to getting a minimal feed is having a lot of negative space pictures and fillers,” she says. “I also think it’s really important to choose about three main colors, because if you have like 7 or 8 different colors in your feed it’s not going have a cohesive color or tone.”\n\nA post shared by Kelsey Simone (@k.els.e.y) on Sep 8, 2017 at 5:53pm PDT\n\n\n\nAnother tip from Simone is to categorize your photos. “I categorize it into selfies, outfit pictures, product shots, and fillers,” she says. “It’s a rotation. For example, if I post a selfie, I don’t want to post a selfie right after that. So I’ll post a selfie, I’ll post a product shot, an outfit picture, a filler, and I’ll keep that going.\n\n3. @elainery’s Bright, Light, & Colorful Instagram Theme\n\nOne scroll through Elaine Rystead’s Instagram feed and you’ll immediately fall in love with her beautiful and varied shot selections. But the Vancouver-based photographer isn’t just great with a camera, she’s also a wiz when it comes to editing her photos.\n\n“I start with VSCO. It’s my first step. I import the image and I decide what filter I want to use.” Rystead says. “A6, A7, M5, and M6 are my favorite filters because they’re warm and they’re bright, and they create a very similar tone for my feed.”\n\n“Then I’ll open up the image in SnapSeed. I’ll go to the tools section, select ‘Tune Image’ and I’ll play around with the features,” she says. “I love the ambience tool, especially if you want a little more detail. I’ll also play with the brightness and contrast.”\n\nA post shared by elaine rystead (@elainery) on May 29, 2017 at 9:28pm PDT\n\n\n\nFinally, when it comes to organizing the look of her feed before she posts, Rystead will open the Later app on her phone and plan her feed with Later’s Visual Instagram Planner.\n\n“If I have two dark images, I probably wouldn’t want them side by side,” she says. “I tend to put a dark image between two bright images, I find that that makes the other two bright images stand out.”\n\nPlan Your Instagram Feed\n\n4. @jeffmindell’s Bright, Sunny, & Happy Instagram Theme\n\nIf you’re ever in need of some inspiration for a colorful and uplifting Instagram theme, look no further than Jeff Mindell’s feed. The Los Angeles-based lifestyle photographer has made a career of creating colorful content for brands of all types.\n\nSo how does he keep his own feed consistent? According to Mindell, he sticks to a few simple rules.\n\n“I generally use the same tones (it’s no secret I love my blues and greens), I don’t post photos taken at night, and I try to keep my photos taken from the same point-of-view, be it a shot of me or an interior space,” Mindell says.\n\nA post shared by Jeff Mindell (@jeffmindell) on Sep 11, 2017 at 1:41pm PDT\n\n\n\nMindell also admits to having a fairly “intense” editing process for his photos. “My favorite apps that I use every day are SnapSeed, VSCO, Touch ReTouch, Facetune, SKRWT (I’m a freak about having all my lines straight!), and of course A Color Story, where I have my own effects pack available for purchase within the app!”\n\n5. @shopdoen’s Vintage & Warm Instagram Theme\n\nThe team behind DÔEN keeps a pretty amazing Instagram feed. Characterized by a laid-back and ultra-aesthetic bohemian vibe, it’s no wonder how they’ve racked up their nearly 75,000 followers!\n\nPart of DÔEN’s Instagram success can be explained by their beautiful Instagram theme. Despite showcasing hundreds of different outfits and styles on their account, they’ve been able to maintain a consistent color palette centered around warm earthy tones.\n\nA post shared by D Ô E N / @shopdoen (@shopdoen) on Sep 7, 2017 at 12:14pm PDT\n\nDÔEN also edits their photos with a consistent filter, which gives their feed that 70s bohemian look. The overall result? Despite being product-based account, DÔEN’s Instagram feels more like a visual lifestyle blog.\n\n6. @everlane’s Minimalist Instagram Theme\n\nEverlane is an apparel startup rooted in their motto of “radical transparency,” and they’ve seen massive success on Instagram with a growing following of over 385,000 people. The reason for their success? A clean, simple, and visually appealing Instagram feed.\n\nJust check it out! It’s packed with a ton of gorgeous photos that work so well with their brand. And each photo has a minimalist design, which is totally evocative of the clothes that Everlane creates.\n\nSo what can we learn from Everlane? Well, when you’re developing your own Instagram style, it’s super important to keep in mind how it will impact your brand, and, on the flip side, how it can be used to convey your beliefs and opinions.\n\nA post shared by Everlane (@everlane) on Aug 25, 2017 at 8:59am PDT\n\nTake Everlane’s minimalist Instagram feed as an example. It’s used to remind their followers that radical transparency is at the heart of the brand.\n\n7. @elizabethgilmore’s Curious & Colorful Instagram Theme\n\nFor those seeking a lifestyle Instagram account that’s as breathtaking as it is creative, look no further. Art director and graphic designer Elizabeth Gilmore certainly knows how to put a beautiful feed together.\n\nSo where does Gilmore find her inspiration?\n\n“In today’s times, it’s important to have a unique perspective on how you see the world and ultimately how you share that view to your followers,” Gilmore says.\n\n“Of course, visual elements like color palette, composition, and themes are easy ways to have consistency in your account. But as I spend more and more time on the platform, I’ve discovered it’s more about being relentlessly you and sharing that story in my own way.”\n\nYesterday a new camera joined the fam (used to shoot with Canon and Sony). I picked up the new FujifilmX-Pro2 in order to get myself off the iPhone and back to the basics. Here’s my first Fuji #selfie 📸👌 Oh did I mention I like plants? 🌱🍃🌿🍃🌱#firsttimeFuji A post shared by Elizabeth Gilmore (@elizabethgilmore) on May 24, 2017 at 5:48pm PDT\n\nFor Gilmore, that story happens to be in saturated colors, hidden light patches, and curious encounters. “I really just share the small moments of my own life. The more I focus in on how I uniquely see beauty in this world, the stronger (and truer) the aesthetic is… So lean into the things that you love and be as unapologetic as possible,” she says.\n\n8. @bethanymenzel’s Bright, Beachy, & Relaxed Instagram Theme\n\nLifestyle blogger Bethany Menzel has attracted a huge following with her amazing content — but it’s her beautifully curated Instagram feed, marked by the heavy use of pastels, lower saturations, and neutral tones, that really turns our heads.\n\nSo how does she keep such consistent Instagram theme? Well, according to Menzel, a lot of it has to do with being true to yourself.\n\n“Making sure that your aesthetic is a natural fit for your lifestyle helps a lot. Mostly everything I own is neutral colours, natural woods, or blush pink since a certain little girl rules my world,” she says. “So it’s natural that those colours are going to show up in my pictures. In my opinion your feed should be a representation of your life, that will likely result in everything feeling consistent and original.”\n\nLook how long this guy is! Passed along all of our baby stuff today because by the time we come home we’ll have no use for it 😳 crazy. A post shared by Bethany Menzel (@bethanymenzel) on Aug 28, 2017 at 3:48pm PDT\n\nAnd like most other Instagram influencers, a lot of work goes into post-production. “I edit all photos in Photoshop Lightroom, whether the photos are taken on my iPhone, point & shoot, or DSLR, they all get imported into Lightroom where I apply a custom filter that a photographer helped me create and I’ve slowly tweaked and refined over time.”\n\nThis is a big part of keeping your feed consistent. Using the same filter on every single photos is key to bringing cohesiveness to your feed. Want to learn more about building a consistent Instagram feed? Sign up for our free Instagram training course here!\n\n9. @privacypls’ Faded & Romantic Instagram Theme\n\nWhether it’s a color palette or a style palette, finding and sticking to a theme that works for you will make your Instagram photos really pop. Need a good example? Check out Privacy Please’s Instagram feed.\n\nIn some cases, a business may want to highlight one color. In other cases, it makes more sense to highlight several colors on your feed. Whatever direction you decide to take, it’s important to be consistent! And that’s exactly what Privacy Please does best.\n\nDespite posting a range of different content types, including user-generated content, quotes, product shots, lifestyle content, and more, Privacy Please keeps a super-cohesive feed by sticking to a consistent color palette.\n\nLiterally perfect 💕 A post shared by PRIVACY PLEASE (@privacypls) on Sep 11, 2017 at 4:52pm PDT\n\nYou can also achieve this look by editing your photos in a similar way, for example by adding the same filter to all of your photos.\n\n10. @laurenjaneyt’s Rotating Instagram Themes\n\nSometimes it can be hard to commit to a single Instagram theme. With so many options out there, it’s nice to switch things up every now and again. If you’re looking for some advice on how to seamlessly rotate your Instagram theme, look no further than beauty, fashion, and lifestyle vlogger, Lauren Jane.\n\nLike Bethany Menzel, Jane recommends picking Instagram themes that make the most sense for you and your lifestyle.\n\n“When you’re choosing a theme, take into consideration what clothing you have, what color your room is, what color your bed spread is, what color your floors are, where you live.”\n\n“You need to keep in mind what’s achievable versus what you appreciate. For example, I don’t have any pink clothing. So when I wanted a pink theme, I wore the same pink sweatshirt in every photo, and that got rather boring. So that theme was not long-lived,” Jane says.\n\ncomment your favorite emoji for spam / a follow back on my second account @morelaurenjane 🌹🔥 A post shared by Lauren Mullally (@laurenjaneyt) on May 25, 2017 at 2:49pm PDT\n\nJane also recommends switching things up every so often. “Even though you want your theme to look cohesive and similar, you don’t want every photo to be identical,” Jane says. “So some easy ways to make sure you’re spicing up your photos is to change up your poses and your angles.”\n\n11. @teamwoodnote’s Use of Borders in their Photos\n\nAdding borders to your Instagram posts can be a daunting prospect: once you commit to the look, it can be difficult to go back. But if you’re ever in need of some inspiration for a beautiful Instagram feed that makes great use of borders, check out Caroline Ingraham Lee of Woodnote Photography!\n\nAccording to Caroline, a lot of work goes into prepping their photos for Instagram.\n\n“I use so many apps!” she says. “First, I size my images in VSCO because it’s the only app I know of that has a crop to 4:5 option. Next, I edit it in A Color Story! After that, I pop the photo into Afterlight to add the white border at 15, which is something that other apps also don’t allow me to do.”\n\nA post shared by caroline ingraham lee. (@teamwoodnote) on Aug 14, 2017 at 12:55pm PDT\n\nCaroline also mentions the benefits of planning the look of her feed before publishing to Instagram. “I always upload my photos to Later to see them in my feed before I upload them,” she says. “It helps me visualize how the photo is going to look before I actually post it, and then I can rearrange if there’s too much of the same color, or not enough of something.”\n\n12. @kimkardashian’s New & Improved Instagram Theme\n\nSometimes even the most famous Instagrammers need help. Such was the case with Kim Kardashian who, in early August, took to Instagram to ask her followers for advice on her feed.\n\nI need more consistency on my insta feed. Should I go back to all one filter? Please help. I really need to step my insta page up A post shared by Kim Kardashian West (@kimkardashian) on Aug 2, 2017 at 9:40pm PDT\n\nWhile in the past Kim didn’t stick to a specific aesthetic for her feed and posts, she did use a little bit of Instagram’s “Aden” filter on top of every photo to add a warm and purplish hue.\n\nLately, however, Kim has focused on highlighting the warmth of her skin tone with a dark or cool background, and her colours centre around a cool palette of baby pinks, purples, and blues. Kim has learned that posting “filler” photos is key to a good Instagram theme, and has been incorporating throwback images and detailed shots into her feed lately.\n\nShe also posts black and white photos on occasion, which helps create even more contrast between her colored and uncolored photos (and it allows her to post any photo, even if it doesn’t go with her theme, because she can just make it black and white!)\n\n13. @katvondbeauty’s Color Blocking Instagram Theme\n\nIncorporating color blocking into your Instagram feed can be difficult, but it isn’t impossible. Take Kat Von D Beauty for example, a cosmetic brand that has totally mastered the technique.\n\nIt’s no secret that cosmetic brands tend to do really well on Instagram. The visual appeal of their products (think colorful, eye-catching designs) are perfect for Instagram’s ultra-engaged beauty community. But Kat Von D Beauty does something really special with their super colorful feed.\n\nRather than sticking to a color palette and posting the same colors consistently, the makeup brand uses color blocking to create an eye-catching aesthetic that really pops on their feed.\n\nA post shared by Kat Von D Beauty (@katvondbeauty) on Sep 20, 2017 at 3:02pm PDT\n\nWhat’s really amazing is how often they switch between color blocks. While some brands will keep a color block going for weeks or even months, Kat Von D Beauty rarely goes more than a few days before switching to a new color.\n\n14. @peoplefootwear’s Color Blocking Instagram Theme\n\nIf you’re looking for a more tame (but still incredibly gorgeous!) example of color blocking in action, look no further than People Footwear.\n\nAccording to photographer Caley Vanular, People Footwear organizes their color blocking around monthly intervals and new product lines. “We run a monthly colour theme based off new colours that come out each season,” says Vanular. “We use our designers, VSCO, and the in-app filters to adjust the colour and size to better fit our theme.”\n\nThe result? A seamless feed that incorporates product shots, lifestyle shots, and user-generated content.\n\nA post shared by People Footwear (@peoplefootwear) on Sep 8, 2017 at 12:55pm PDT\n\nPeople Footwear also spends a lot of time planning the look of their feed.\n\n“We use scheduling apps to layout the images ahead of time to ensure a variety of colour, inspo, consumer content, video, GIFS, and product focusing on our colour theme and brand ethos,” says Vanular.”\n\n15. @artifactuprising’s Bright & Airy Instagram Theme\n\nArtifact Uprising, a Colorado-based lifestyle brand that specializes in custom photo books for photographers, runs a pretty amazing Instagram feed.\n\nWhen asked how they decide what content to post, marketing coordinator Megan White explains: “Our rule of thumb is to post anything that provokes awe and wonder.”\n\n“More than anything, though, we want to keep the images looking natural to be as real as possible,” she says.\n\nA post shared by Artifact Uprising (@artifactuprising) on Sep 10, 2017 at 5:25pm PDT\n\nFurthermore, according to White, beyond playing with exposure and making the colors in their photos pop, Artifact Uprising doesn’t do much editing on their posts.\n\n“We don’t put too much thought into making it orchestrated,” she says. “We put up what makes sense and what we know our community will think is beautiful and inspiring. We do, though, use the Later layout tool to make sure it looks consistent.”\n\n“We wouldn’t go anywhere else to schedule and curate our social media!” she says.\n\n16. @taramilktea’s Bold & Vibrant Instagram Theme\n\nCombining vibrant colors, drool worthy food, and breathtaking travel shots, it’s no wonder why blogger Tara Milk Tea has accumulated over 800,000 followers on Instagram.\n\nAccording to a recent interview, Tara’s Instagram theme took a number of years to develop. “When I first started I was posting random stuff. I was trying to develop my photography skills in general. And then fashion became a hobby, and then after that came travel and food. And now I try to do as much of it as possible: fashion, food and travel all in one!”\n\n“If I look back to 2013 at the sort of things I was posting, I’m like, ‘what was I thinking!’ but it sort of became a learning curve from there,” she says. Of course, today, Tara is much more consistent in what she posts — both in her subjects and style.\n\nA post shared by Tara Milk Tea (@taramilktea) on Sep 10, 2017 at 6:51am PDT\n\n“My content does cater to my Asian fan base. I do really like cute Asian things and when I post about them, I think that attracts them,” she says. “But I don’t pay attention to just one audience, I try to be as diverse as possible… like I try not to always do food, even though I love doing food, and it is my most popular content.”\n\n17. @foodess’ Mouth-Watering Instagram Theme\n\nJennifer Pallian, the writer, editor and food styler behind the popular blog Foodess, is a master when it comes to food styling and flat lays.\n\nSo how does Pallian achieve her beautiful Instagram theme? Well, it all starts before the photoshoot. “When I’m thinking about how I’m going to style a flat lay, the first thing I think about is the flat lines and shapes — what it would look like if it was flat on paper,” says Pallian.\n\nIt’s a jam for dinner kinda Monday, who’s with me? Also, 🍷. Ok fine, 🍷🍷. A post shared by Jennifer Pallian | Foodess.com (@foodess) on Aug 28, 2017 at 6:27pm PDT\n\nPallian also believes in the importance of keeping things as natural as possible. “When you’re styling food, the most important thing is not to over-style. You’re looking for that naturally unstyled kind of look,” she says. “You want to look for those gooey bits and the crumbly crust and see how you can integrate that in a natural way.”\n\nAnd it you want to switch things up in your feed without stepping too far away from your Instagram theme, Pallian recommends incorporating cropping and white space. “White space is a really great tool to mix up your style and not having all your photos look the same,” she says.\n\n18. @ritual’s Color-Focused Instagram Theme\n\nScroll through Ritual‘s beautifully-curated Instagram feed, and you’ll soon see why the vitamin startup has taken off. They’ve mastered the art of creating lifestyle content.\n\nFrom the very beginning, Ritual focused its Instagram strategy on creating an aesthetically pleasing feed, incorporating product shots, behind-the-scenes posts, inspirational imagery, and, of course, their signature yellow brand color.\n\nA post shared by Ritual (@ritual) on Aug 21, 2017 at 9:26am PDT\n\nBut a big part of their success on Instagram can be chalked up to their ability to incorporate UGC into their feed. In fact, according to founder and CEO Katerina Schneider, both the vitamin itself, which looks iridescent in the light, and its packaging were designed to be super-shareable.\n\n19. @tomwindeknecht’s Pop Pastel Instagram Theme\n\nSticking to a consistent color palette is a great way to maintain a cohesive Instagram feed, and very few do it better than Tom Windeknecht, a California-based photographer and content creator.\n\nWhen asked what he likes to post on Instagram in a recent interview, Tom explains that nearly all of his work is edited with very colorful hues of pinks and blues.\n\n“I primarily look for lines, shadows, patterns, colors and shapes. I like clean, minimal compositions with bright colors,” he says. “These are the largest components of my work. I really try to force myself to look at things from a creative perspective, a smaller perspective, and not just the whole picture. For example, instead of seeing the whole building, I will try to look at corners, architectural details, or angles of the building.”\n\nI’m in the mood for love 🎶💖💙 #whpmood . #paintlifepink A post shared by Tom Windeknecht 📷 (@tomwindeknecht) on Jul 23, 2017 at 12:10pm PDT\n\nAnd when it comes to editing his photos, Tom has a fairly stringent process. “My photo-editing routine usually consists of pulling the photo in Photoshop, tweaking the background colors, and then editing the hues. Sometimes, I will remove the background or sky completely, and replace it with a gradient.”\n\n20. @jl_saez’s Black & White Instagram Theme\n\nCreating a black and white Instagram theme for your account can be a daunting prospect, and it’s definitely not for everyone. But when it’s done well, it can look amazing. Take for example the Instagram account of Spanish photographer, Jose Luis.\n\nIn a recent interview, Luis offered a few pieces of advice to photographers. “Symmetry is always a good choice for square format photos, but spending time and effort in the selection of a scene is of central importance to ensure a good end result,” he says.\n\n“My advice is to choose a scene without any disturbing or distracting elements. Including objects that have nothing to do with the story you’re trying to tell reduces the power of the picture, so keep it simple.”\n\nA post shared by José Luis (@jl_saez) on Jul 23, 2017 at 10:03am PDT\n\nHe also recommends shooting in color and then switching to black and white in post-production. “I usually shoot in color, even though I love the Noir filter in the iPhone’s native camera app. I find that I can achieve a better black and white image in post-processing if I shoot the original photo in color,” he says.\n\nHopefully this list of 20 awesome Instagram themes gives you some inspiration to go and create your own Instagram theme! Remember, if you need any more advice on building a beautiful feed, check out our free Instagram course here!\n\nSign up for our Free Instagram Course to get a ton of tips on how to design, curate, and plan your Instagram feed!", "images": ["data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20480%20320'%3E%3C/svg%3E", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2020/04/Apr3-Instagram-Launches-New-Stickers-for-Restaurants-Small-Businesses-Feature-FL-480x320.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201200%20800'%3E%3C/svg%3E", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2020/04/Apr2-How-to-Repurpose-Instagram-Stories-Across-All-Your-Social-Platforms-Feature-FL-480x320.png", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/themes/later/images/logo.svg", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/vitruvi-feed.png", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/artifactup-b.png", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/people-b.png", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/privacy-b.png", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/everlane-b.png", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/katvond-b.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20150%20150'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2020/04/Apr2-How-to-Send-Instagram-DMs-From-Your-Desktop-Feature-FL-480x320.png", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/elaine-b.png", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/shopdoen-b.png", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/tomwind-b.png", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/kim-b.png", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/septw3-feedideas-share.jpg", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/foodess-b.png", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/bethany-b.png", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/woodnote-b.png", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/elizabethgilmore-b.png", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/@k.els_.e.y-2.png", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/jeff-mindell-b.png", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/jose-b.png", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/foodess-b-1.png", "https://secure.gravatar.com/avatar/f4a16a9a9753bf7113ea9b3c1105c18d?s=60&d=mm&r=g", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/laurenjane-b.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20800%20801'%3E%3C/svg%3E", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/taramilk-b.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%2060%2060'%3E%3C/svg%3E", "https://secure.gravatar.com/avatar/f4a16a9a9753bf7113ea9b3c1105c18d?s=150&d=mm&r=g", "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/septw3-feedideas-feature.jpg"], "top_img": "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/septw3-feedideas-feature.jpg", "keywords": [], "authors": ["Benjamin Chacon"], "canonical_link": "https://later.com/blog/instagram-themes/", "title": "20 Awesome Instagram Themes (and How to Get Them)", "meta_data": {"HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1, maximum-scale=1", "format-detection": "telephone=no", "description": "We put together a list of 20 awesome Instagram themes with a ton of advice on how to incorporate them into your own account!", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "20 Awesome Instagram Themes (and How to Get Them) - Later Blog", "description": "We put together a list of 20 awesome Instagram themes with a ton of advice on how to incorporate them into your own account!", "url": "https://later.com/blog/instagram-themes/", "site_name": "Later Blog", "updated_time": "2018-11-23T21:34:59+00:00", "image": {"identifier": "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/septw3-feedideas-feature.jpg", "secure_url": "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/septw3-feedideas-feature.jpg", "width": 1200, "height": 800}}, "article": {"publisher": "https://www.facebook.com/latermedia/", "author": "benjaminchacs", "section": "Instagram", "published_time": "2017-09-21T03:54:11+00:00", "modified_time": "2018-11-23T21:34:59+00:00"}, "twitter": {"card": "summary_large_image", "description": "We put together a list of 20 awesome Instagram themes with a ton of advice on how to incorporate them into your own account!", "title": "20 Awesome Instagram Themes (and How to Get Them) - Later Blog", "site": "@latermedia", "image": "https://mk0laterblog4vkmxupe.kinstacdn.com/wp-content/uploads/2017/09/septw3-feedideas-feature.jpg", "creator": "@latermedia"}}, "movies": ["https://www.youtube.com/embed/mEGLrMI0uak?rel=0", "https://www.youtube.com/embed/Vsiil1jnVq0?rel=0"], "publish_date": 1505966051.0, "source": "http://later.com", "summary": ""}