{"url": "https://www.pe.com/2018/05/30/coachella-2019-festival-dates-announced-and-how-to-get-tickets/", "text": "The Coachella Valley Music and Arts Festival has announced the dates for its 20th anniversary and how to get pre-sale tickets. The festival is also offering a new upgrade for car camping.\n\nSo when is Coachella 2019? The festival happens April 12-14 and April 19-21 at the Empire Polo Club in Indio.\n\nAs it has done in recent years, promoter Goldenvoice will put a limited number of passes on sale early. This year you can get Coachella 2019 passes for Weekend 1 and Weekend 2 starting at 11 a.m. Pacific Friday, June 1.\n\nGeneral admission passes are $429 for the weekend and go up to $504 for the inclusion of a shuttle pass. A VIP pass is $999 and preferred parking (formerly known as VIP parking) is $150.\n\nSign up for our Festival Pass newsletter . Whether you are a Coachella lifer or prefer to watch from afar, get weekly dispatches during the Southern California music festival season. Subscribe here\n\nRegular car camping is $125 for a pass but for $325, preferred camping gets you in the lot closest to the Ferris wheel (and closest to the festival entrance). If you pony up for the preferred camping, you don’t have to line up as early to get the prime spots. Tent camping is $125. Camping companion parking is $60.\n\nThe Lake Eldorado luxury camping starts at $2,458 for a two-person teepee and two general admission passes and goes up to $5,600 for a four-person tent and VIP passes. Ultra luxe Safari camping starts at $8,500 and includes WiFi and guest passes to the festival, among other perks.\n\nOther things available to purchase in the pre-sale include shuttle passes for $75 and a one-way airport shuttle pass from LAX for $70-$80.\n\nThe pre-sale is the only time you can do the payment plan for tickets.\n\nTypically, Coachella doesn’t announce the lineup for the festival until January. However, the pre-sale for 2018 had a little bit of an advantage since everyone knew Beyoncé was going to be there.\n\nPasses and more will be available via www.coachella.com.\n\nRelive Coachella 2018 with our photos from the festival.", "images": ["https://www.pe.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg", "https://www.pe.com/wp-content/uploads/2017/04/pe-logo-large.svg", "https://www.pe.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://www.pe.com/wp-content/uploads/2018/05/0421_ent_rpe-l-cf-features062.jpg?w=1024&h=681"], "top_img": "https://www.pe.com/wp-content/uploads/2018/05/0421_ent_rpe-l-cf-features062.jpg?w=1024&h=681", "keywords": [], "authors": ["Vanessa Franko", "Digital Director Of Entertainment", "Vanessa Franko Is The Digital Director Of Entertainment For The Southern California News Group. The Lure Of Palm Trees", "Covering Pop Culture Brought Her To The Press-Enterprise In Riverside In Vanessa Has Reported On Everything The Palm Springs International Film Festival To The Mlb All-Star Game As A Reporter", "Photographer", "Videographer", "On-Camera Personality. She'S Won Awards For Her Coverage Of The Coachella Valley Music", "Arts Festival", "For Crime Reporting In Her Home State Of Maryland. Vanessa Studied Multimedia Storytelling As A Knight Digital Media Center Fellow In Dec.", "Has Taught College Courses In Digital Journalism. She'S Seen Shows At Every Major Concert Venue In Southern California"], "canonical_link": "https://www.pe.com/coachella-2019-festival-dates-announced-and-how-to-get-tickets", "title": "Coachella 2019: Festival dates announced and how to get tickets", "meta_data": {"application-name": "pressenterprise", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "Find out when do Coachella presale tickets go on sale and when do Coachella tickets go on sale", "keywords": "Coachella 2019, Coachella Festival 2019, Coachella Music Festival 2019, Coachella Valley Music and Arts Festival 2019, Coachella 2019 tickets", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 50855317267}, "google-site-verification": "LZdYqNUkxSP_ouZYzIcwZ3Fh_UoSNQi3LYJ87CiDYec", "og": {"type": "article", "title": "Coachella 2019: Festival dates announced and how to get tickets", "url": "https://www.pe.com/coachella-2019-festival-dates-announced-and-how-to-get-tickets", "description": "Pre-sale tickets for the 2019 Coachella Valley Music and Arts Festival become available Friday, June 1.", "site_name": "Press Enterprise", "image": {"identifier": "https://www.pe.com/wp-content/uploads/2018/05/0421_ent_rpe-l-cf-features062.jpg?w=1024&h=681", "width": 1024, "height": 681}, "locale": "en_US"}, "article": {"published_time": "2018-05-30T11:10:24+00:00", "modified_time": "2019-03-04T15:48:17+00:00"}, "twitter": {"text": {"title": "Coachella 2019: Festival dates announced and how to get tickets"}, "image": "https://www.pe.com/wp-content/uploads/2018/05/0421_ent_rpe-l-cf-features062.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.pe.com/wp-content/uploads/2017/04/cropped-pe_icon1.jpg?w=270"}, "movies": [], "publish_date": 1527609600.0, "source": "https://www.pe.com", "summary": ""}