{"url": "https://www.bustle.com/p/how-accurate-is-david-koresh-in-waco-taylor-kitsch-fully-transformed-himself-into-the-enigmatic-leader-8001116", "text": "In 1993, a conflict over a permit between the federal government's Bureau of Alcohol, Tobacco, and Firearms and a compound of Branch Davidians — a fringe offshoot of the Seventh-day Adventist Church — began with violence, dragged on for 51 days, and eventually ended in a firefight. All told, 86 people died, including Branch Davidian leader, David Koresh. Taylor Kitsch stars in Waco, a six-part miniseries on the Paramount network (formerly Spike), which recreates the standoff. When I ask Kitsch over the phone ahead of the show's Jan. 24 premiere what kind of process he undertook to transform himself into the charismatic leader, he answers with a laugh and a question: \"Where do you want to start?\"\n\nUnderneath aviator-frame glasses and a shaggy mullet, Kitsch is nearly unrecognizable in the role. In addition to losing weight to match Koresh's slight frame, Kitsch did extensive research into his background, watching recruitment videos and reading letters Koresh had sent and received. He pored over the scripture that Koresh taught — sometimes, Kitsch says, in 18-hour sermons. The actor also took guitar and singing lessons, because Koresh took pride in his musical abilities and utilized them in his evangelizing.\n\nWaco is based in part on A Place Called Waco: A Survivor's Story, an account of the siege and life on the Branch Davidian compound co-written by former member David Thibodeau. (Thibodeau is played by Rory Culkin in the series.) In addition to having that first-person retelling to consult, Kitsch was also in direct contact with Thibodeau himself throughout the production.\n\nParamount\n\n\"Sometimes I’d just email him during the shoot at two or one in the morning, saying, 'What kind of song would Dave sing in this next scene we’re doing on Thursday?' Or whatever. And he would send over three songs that were very Koresh-like. Those kind of things go a long way for me, and it allows you as an actor to just kind of marry yourself to it,\" Kitsch says.\n\nBy the time the audience meets Koresh (born Vernon Wayne Howell) in the Paramount series, he's the unquestioned, infallible leader of what some might call a \"cult,\" whose followers believe he is the \"lamb\" spoken about in the Book of Revelation. After studying him extensively, Kitsch has an opinion about how Koresh built up such a faithful following.\n\n\"I think he was incredible at giving purpose, which everyone in life searches for,\" the actor says. \"And a majority of people are followers. And when he finds somebody or there’s a moment in their life and they’re more susceptible to it, he can individualize people in an incredible way. And in that, he gains purpose as well.\"\n\nGetty Images/Getty Images Sport/Getty Images\n\nAs most Branch Davidians didn't survive the standoff, their stories have largely gone unheard. But Waco gives those people a voice through full and empathetic portrayals. In watching the series, viewers can see how (according to the accounts the series is based on), the residents of the compound lived, worked, loved, and took care of their children.\n\n\"[The perception is] it’s just robots and drones that are following this crazy guy that’s slinging the Bible around,\" Kitsch says of the Branch Davidians. But in reality, many of Koresh's followers were average people — and some were remarkable: Douglas Wayne Martin, who died in the siege, was one of the first black students to graduate from Harvard Law.\n\nBut in creating his own version of Koresh, Kitsch came to understand that what called to Branch Davidians the most was that their leader made them feel vitally important and gave them constant validation. Some would follow Koresh around all day, Kitsch says, just to wait for him to zero in and give them personal attention.\n\n\"I think Dave had a really mad, brilliant way of putting everything in layman’s terms, and that just makes him more relatable. He can relate [scripture] to your life and personalize it,\" he says. \"And it was never enough, that was the beauty of what he was doing. Because they want more; it’s like a drug in that sense.\"\n\nParamount\n\nBeloved though Koresh was, Kitsch also acknowledges the darker, selfish motivations at the core of the man's preaching. Because Koresh and his followers believed that he would create the 24 elders that would rule the world after the \"seventh seal\" brought about the apocalypse, women would offer themselves up to be a vessel for that child. All Branch Davidians except Koresh and his several \"spiritual wives\" were instructed to stay celibate. The leader was born to a teenage single mother and his father was not around; Kitsch thinks that Koresh painstakingly built a \"world of control that he never had growing up.\"\n\n\"He had his pick of any woman he wants,\" Kitsch says. \"He’ll have a gig and go to LA and try to get a record label and come back, and he has people waiting on him. It’s just like — it’s kind of his birthday every day, if you think about it.\"\n\nAt the same time, the actor had to explore the more sympathetic aspects of Koresh, like the sharp sense of humor Kitsch was surprised to learn that he had. There was a version of Koresh who was just \"a Texas boy,\" he says, who'd grab a drink at the local bar and — as the series shows — was friendly with the compound's Waco neighbors.\n\n\"As an actor, you want to play and show every color, no matter who you’re playing. Dave certainly had that in spades. He was very dramatic and kind of lived with his heart on his sleeve and led that way and was manipulative and loving and he was all of it. Enigmatic,\" Kitsch says. \"And there’s still things that we won’t have answers to. But it was incredibly fulfilling — just an insane challenge to kind of wrap my head [around] the whole thing.\"", "images": ["https://imgix.bustle.com/uploads/getty/2018/1/24/c85d8670-4a48-46ff-bc3c-e671993573c2-getty-1960424.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/1/24/8ea161ee-cf72-4772-aebc-8968d2118470-waco-3.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/16/a0c20f01-67af-4bfe-ae91-db67a37e5b8a-getty-1142135670.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/16/2bf4bb46-4980-447a-8cb8-81522214da06-jessie-saved-by-the-bell-reboot-1.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/8/630a9d05-b742-4adb-82c5-030cd815d6dc-fh_101_02597r1.JPG?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/12/a050599c-0f91-449c-a680-e88ed10034ae-getty-1202992300.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/1/24/109b714c-c182-4ee3-b1a7-2fcf884fcc6a-waco.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2018/1/24/d6d3c54f-ccaa-4ab3-a451-8464f7a66554-waco-2.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/1/24/109b714c-c182-4ee3-b1a7-2fcf884fcc6a-waco.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/1/24/109b714c-c182-4ee3-b1a7-2fcf884fcc6a-waco.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/how-accurate-is-david-koresh-in-waco-taylor-kitsch-fully-transformed-himself-into-the-enigmatic-leader-8001116", "title": "How Accurate Is David Koresh In 'Waco'? Taylor Kitsch Fully Transformed Himself Into The Enigmatic Leader", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/how-accurate-is-david-koresh-in-waco-taylor-kitsch-fully-transformed-himself-into-the-enigmatic-leader-8001116", "type": "article", "title": "Taylor Kitsch Transformed Himself Into An Infamous Spiritual Leader For A New Miniseries", "description": "In 1993, a conflict over a permit between the federal government's Bureau of Alcohol, Tobacco, and Firearms and a compound of Branch Davidians — a fringe offshoot of the Seventh-day Adventist Church — began with violence, dragged on for 51 days, and…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/1/24/109b714c-c182-4ee3-b1a7-2fcf884fcc6a-waco.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "In 1993, a conflict over a permit between the federal government's Bureau of Alcohol, Tobacco, and Firearms and a compound of Branch Davidians — a fringe offshoot of the Seventh-day Adventist Church — began with violence, dragged on for 51 days, and…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}