{"url": "www.romper.com/p/are-prince-harry-meghan-markle-living-together-now-they-did-long-distance-for-a-long-time-9097519", "text": "Prince Harry and Meghan Markle have been dating since 2016, and most of the relationship was formed over a long distance. So now that they've made things official and are about to get married, it's fair to wonder if Prince Harry and Meghan Markle are living together now or if royal protocol has kept them under different roofs. The answer is not all that surprising.\n\nWhen the couple first met, Suits was still filming in Toronto, which is where Meghan was posted up. To visit each other, the couple had to carry out an elaborate bait and switch plan to distract the paparazzi and keep their romance a secret, according to Us Weekly. Meghan would travel to London for events and they took vacations together, but it wasn't until late 2016 that the The Sun reported they were \"virtually inseparable\" and that Markle had \"practically moved in\" with Harry. By that time, the couple had made their relationship public.\n\nAn anonymous source also told the outlet, \"They’ve taken things to the next level. They’re practically living together. She cooks for him, he pops out to the gym and they’re just enjoying hanging out.\" For those who might be scandalized by the young couple living together before marriage, it's actually a lot more common than some might think -- even accounting for royal protocol.\n\nA source told HollywoodLife last year, \"The royal family has had to move with the times in order to survive, and they are nowhere near as stuffy and old fashioned as they used to be. Prince William and Kate Middleton lived together before marrying, so it’s no shocker that Harry and Meghan plan to do the same.\"\n\nWPA Pool/Getty Images Entertainment/Getty Images\n\nRight now, they're living in Nottingham Cottage, a 1,300 square foot house on the Kensington Palace compound, according to People. Ken Wharfe, a former police protection officer for the family, told the outlet that it's a \"lovely, classic Victorian cottage.\"\n\nHe added that it's \"not very big, incredibly small,\" which is understandable by royal standards. Wharfe elaborated that the cottage, one of just a few at Kensington Palace, was originally used for estate staff, but in the past few decades has been occupied by family members. He added of the properties:\n\nThey are well restored, typical country cottages and originally used for the estate workers. In the past 40 years or so they’ve been accommodation for senior members of the household. They’ll be updated but there certainly wouldn’t be room for servants. Not far from there are apartments, almshouses that housed some of Princess Margaret’s staff.\n\nPrince William and Kate Middleton also stayed in \"Nott Cott,\" as it's referred to by the British press, for two years whenever they were in London.\n\nChris Jackson/Getty Images Entertainment/Getty Images\n\nFor their wedding, Queen Elizabeth is supposedly gifting the couple a house at Sandringham Estate, in Norfolk, which is where the entire royal family spends the holiday season. That house has 21-rooms, which might be fun to decorate and make into a home, especially if they eventually have children.\n\nThe catch? That home is about 110 miles from London, and it seems a little odd that the young couple would want to be that far away from the hustle of the city. Harry did grow up at Kensington Palace, and Markle seems suited to city life, so it's entirely possible that they'll stay in Nottingham Cottage and keep the Sandringham Estate house for country getaways.\n\nThen again, there are reportedly no air conditioners in the cottage and, according to Vanity Fair, Kate Middleton set up an entire system of fans when she lived there, so who knows how long they'll last in London-town after the wedding.\n\nWherever they end up living, they'll likely be very happy. And in the worst case scenario, they can always ask the Queen for some central air!", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/15/a6c7516f-17d9-49a4-be4c-2d2441831e4c-getty-960075454.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.romper.com/uploads/getty/2018/5/15/754daa3a-6339-4557-8d3b-65458cebbe10-getty-898499166.jpg?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.romper.com/uploads/image/2018/5/15/2599b3bf-0651-4922-9443-9179df801876-bodybuilders_cta_hubs.png?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/14/9c30c48d-75d0-442f-af7a-e1190e8618a2-getty-1177044869.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/16/98b27883-e6c5-4cf9-9a31-7f69760b36d8-getty-1052729732.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/5/15/4517616a-9017-496b-b809-6b45421d5286-getty-948760262.jpg?w=960&h=540&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.romper.com/uploads/getty/2018/5/15/3a6030a3-8073-45c4-901a-30fcbd0be9a7-getty-949479436.jpg?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/5/15/4517616a-9017-496b-b809-6b45421d5286-getty-948760262.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=932972280084675&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/5/15/4517616a-9017-496b-b809-6b45421d5286-getty-948760262.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.romper.com/p/are-prince-harry-meghan-markle-living-together-now-they-did-long-distance-for-a-long-time-9097519", "title": "Are Prince Harry & Meghan Markle Living Together Now? They Did Long Distance For A Long Time", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@romper", "card": "summary_large_image"}, "og": {"site_name": "Romper", "url": "https://www.romper.com/p/are-prince-harry-meghan-markle-living-together-now-they-did-long-distance-for-a-long-time-9097519", "type": "article", "title": "Here's Everything We Know About Prince Harry & Meghan Markle's Home Together", "description": "Prince Harry and Meghan Markle have been dating since 2016, and most of the relationship was formed over a long distance. So now that they've made things official and are about to get married, it's fair to wonder if Prince Harry and Meghan Markle…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/5/15/4517616a-9017-496b-b809-6b45421d5286-getty-948760262.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 510210782483125}, "description": "Prince Harry and Meghan Markle have been dating since 2016, and most of the relationship was formed over a long distance. So now that they've made things official and are about to get married, it's fair to wonder if Prince Harry and Meghan Markle…"}, "movies": [], "publish_date": null, "source": "http://www.romper.com", "summary": ""}