{"url": "https://www.elle.com/culture/movies-tv/a12262644/emmy-awards-recap-best-moments-2017/", "text": "With Stephen Colbert at the helm, the 2017 Emmys was always going to be a cornucopia of comedy. And because so many social and political issues are being passionately fought, it wasn't surprising that many of the award winners spoke out about what was important to them once they took the stage. Here are the best, funniest, most controversial, and most important moments from TV's night of nights.\n\n1. Sean Spicer showed up.\n\nLook, he's still terrible. And there's no universe in which this was a totally great move. But my jaw legitimately dropped (just like Sarah Hyland's and Anna Chlumsky's) when the former White House press secretary wheeled that lectern out onto the stage. Trump's reign truly is a televisual one.\n\nGiphy\n\n2. Nicole Kidman and Alexander Skarsgård KISSED.\n\nSkarsgård won Best Supporting Actor in a Limited Series or Movie for Big Little Lies, and his co-star Nicole Kidman gave him a congratulatory peck on the lips as he approached the stage. FYI, this is how I'll be greeting all handsome men from now on, too.\n\nGIPHY\n\n3. Kate McKinnon gave Hillary Clinton a shout-out.\n\nWhile accepting her Outstanding Supporting Actress award, McKinnon made sure to thank her SNL muse, presidential candidate Clinton, for her \"grace and grit.\"\n\n4. Stephen Colbert glitched.\n\nOne of the most fun skits was Colbert's Westworld \"Host\" reveal. It was pitch perfect, political, and silly. But also...does he not have a butt???\n\n5. Alec Baldwin said that doing Donald Trump impressions is pretty good birth control.\n\nThe Saturday Night Live actor thanked his wife when accepting his Outstanding Supporting Actor award, noting that they didn't have a child while he was portraying Trump on the sketch show. Was that because of the orange wig? Probs.\n\n6. Ann Dowd gave an incredibly emotional speech from the heart.\n\nAlready teary when she reached the stage, the Handmaid's Tale actress, who scored Outstanding Supporting Actress in a Drama Series, delivered one of the most moving speeches of the night. But when she thanked the show's streaming home—\"They're very lovely, Hulu\"—we all melted into a pool of tears along with her.\n\n7. Can an Emmy award be nominated for an Emmy award?\n\nBecause that's what we think RuPaul deserves for her tutting, gossipy portrayal of the Emmy statuette itself. \"Honey, get out your China because I'm ready to spill the tea, okay?\" Any time, Mama Ru.\n\nGiphy\n\n8. We had no idea we wanted a 9 to 5 reunion SO badly.\n\nBut now we can't believe we ever lived without it. Dolly Parton, Lily Tomlin, and Jane Fonda gave us a good dream to wish for every night when they came together on stage to present the Outstanding Supporting Actor in a Limited Series or Movie award. Plus, they pointed out some pretty disappointing parallels between their iconic movie and the present day: \"We still refuse to be controlled by a sexist, egotistical, lying hypocritical bigot!\"\n\n9. Laura Dern.\n\nThat's it. Just Laura Dern. Put her in the Met.\n\n10. Lena Waithe became the first black woman to win an Emmy for comedy writing.\n\nShe and her Master of None co-writer Aziz Ansari received a standing ovation for their notable achievement, awarded for the episode \"Thanksgiving,\" which focuses on Waithe's character Denise as she comes out to her family. \"Oh, Jesus, let me reclaim my time, give me a second,\" Waithe said. \"My LGBTQIA family, I see each and every one of you. The things that make us different, those are our superpowers.\"\n\n11. Jackie Hoffman pretended to lose it when someone else won the award.\n\nJackie Hoffman, who gave a memorable turn as Mamacita in Feud, gave another great performance when Laura Dern won the award they were both up for. Good old-fashioned shenanigans—we'll never tire of them.\n\nBest moment of the #Emmys so far: Jackie Hoffman yelling \"dammit!!\" when she lost to Laura Dern pic.twitter.com/euCWaRFsAy — Adam Feldman (@FeldmanAdam) September 18, 2017\n\n12. Nicole Kidman won an award, and used the moment to speak out about domestic abuse.\n\nAs Big Little Lies' Celeste, a woman whose husband is physically and emotionally abusive, Kidman delivered one of her most memorable performances. So it was no surprise that she chose to talk about the cause when she accepted her Outstanding Lead Actress award: \"We shone a light on domestic abuse. It is a complicated, insidious disease. It exists far more than we allow ourselves to know. It is filled with shame and secrecy, and by you acknowledging me with this award, it shines a light on it even more.\"", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/elle-emmys-2017-best-moments-1505705040.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/elle-emmys-2017-best-moments-1505705040.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": ["Estelle Tang", "Senior Editor", "Estelle Tang Is The Former Senior Editor Of Elle.Com."], "canonical_link": "https://www.elle.com/culture/movies-tv/a12262644/emmy-awards-recap-best-moments-2017/", "title": "The 12 Best Moments From the 2017 Emmy Awards", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "The 12 Best Moments From the 2017 Emmy Awards", "description": "Well, that was surprising.", "url": "https://www.elle.com/culture/movies-tv/a12262644/emmy-awards-recap-best-moments-2017/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/elle-emmys-2017-best-moments-1505705040.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "modified_time": "2018-03-19 05:05:32", "published_time": "2017-09-18 03:41:25", "section": "Movies & TV 2020", "opinion": "false"}, "twitter": {"site": "@ELLEmagazine", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/elle-emmys-2017-best-moments-1505705040.jpg?crop=1.00xw:1.00xh;0,0&resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "Emmy 2017 Recap – Best Moments of the 2017 Emmy Awards", "description": "The 2017 Emmy Awards were always going to be hilarious, political, and entertaining. Here are some of the best and most important moments from the night.", "keywords": "emmys 2017, emmys funniest moments, emmys best moments", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/elle-emmys-2017-best-moments-1505705040.jpg?crop=0.501xw:1.00xh;0.250xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Culture,culture,movies-tv,Ann Dowd,lena waithe,sean spicer,laura dern,emmys,Stephen Colbert,Kate McKinnon,alexander skarsgard,nicole kidman", "sailthru.date": "2017-09-18T03:41:25Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/elle-emmys-2017-best-moments-1505705040.jpg?crop=1.00xw:1.00xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/elle-emmys-2017-best-moments-1505705040.jpg?crop=0.501xw:1.00xh;0.250xw,0", "sailthru.socialtitle": "The 12 Best Moments From the 2017 Emmy Awards", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1505677285.0, "source": "https://www.elle.com", "summary": ""}