{"url": "https://www.nbcdfw.com/entertainment/entertainment-news/Most-Talked-About-Moments-From-the-2018-Super-Bowl-472798553.html", "text": "The 2018 Super Bowl was full of memorable moments. The Philadelphia Eagles beat the New England Patriots giving the team its first Super Bowl title.\n\nThere was plenty of excitement both off and on the field. There was Pink's national anthem performance, Justin Timberlake's halftime show and, of course, plenty of commercials.\n\nMissed any part of the big game? Don't worry! We have you covered. Check out our list of the most-talked about moments from the 2018 Super Bowl.\n\nPINK'S NATIONAL ANTHEM PERFORMANCE\n\nBefore the Eagles and the Patriots faced off, Pink took the field at U.S. Bank Stadium to sing the national anthem. The \"Beautiful Trauma\" singer didn't let the cold in Minneapolis stop her from belting out the lyrics. However, the artist received bit of backlash after viewers thought she spit out gum during the patriotic performance. Pink clapped back at her haters and tweeted that she spit out a throat lozenge—the singer had been battling the flu before the big game. Still, Pink didn't let any trolls bring her down. She tweeted a sweet photo of her and her daughter Willow and thanked her loyal fans for their support.\n\nTRAILERS GALORE\n\nFrom a super-hero-packed sneak peek of \"Avengers: Infinity War\" to a thrilling teaser for \"Solo: A Star Wars Story,\" there were tons of trailers to get movie buffs excited about upcoming films. Perhaps one of the most surprising trailers, however, was Netflix's teaser for \"The Cloverfield Paradox,\" which the streaming company released directly after the game. Ava DuVernay teased a big surprise was on the way; however, fans couldn't predict this shocker.\n\nFor millions of fans Super Bowl commercials are one of the most anticipated and entertaining parts of the football championship finals, and this year's ad game has something for everyone. NBC's Jay Gray reports.\n\nTHE COMMERCIALS\n\nThere were plenty of funny commercials throughout the big game, too. For instance, Eli Manning and Odell Beckham, Jr. choreographed a whole \"Dirty Dancing\" routine (complete with a Patrick Swayze lift), and Morgan Freeman and \"Game of Thrones\" star Peter Dinklage promoted Doritos and Mountain Dew by lip-syncing to Missy Elliot.\n\nThere were a ton of celebrity cameos in other ads, too. Chris Pratt bared his abs in an ad for Michelob Ultra and Tiffany Haddish showed the pains of not shopping local in a spot for Groupon.\n\nPRINCE APPEARS IN JUSTIN TIMBERLAKE'S HALFTIME SHOW\n\nDuring the halftime show, Timberlake sang a number of fan favorites, including \"Sexy Back,\" \"Rock Your Body\" and \"Can't Stop This Feeling.\" At one point, he also projected a video of Prince on a giant banner for his performance of \"I Would Die for You.\" The move generated mixed reviews, mainly because Prince spoke out against technological performances back in a 1998 during an interview with Guitar World. In fact, he called virtual reality \"demonic.\" Still, others appreciated the tribute to Prince in his home state.\n\nJustin Timberlake paid tribute to late pop sensation Prince during this year's Super Bowl halftime show.\n\nTimberlake defended the decision in a follow-up interview with Jimmy Fallon.\n\n\"It's a moment for me, if I'm being quite honest, because he's always been the pinnacle of musicianship for me. And when we decided that, like, the serendipity and synergy that we would be in Minneapolis, and that, you know, he's such a special thing here, aside from what he is all over the world, um, I just felt I wanted to do something for this city and something for him that, uh, would just be the ultimate homage to what I consider the GOAT of musicians,\" Timberlake told the host.\n\nA VIRAL STAR IS BORN\n\nTimberlake wasn't the only one to garner attention during the halftime show. Ryan McKenna went viral after he snapped a selfie with the singer. An image of him looking distracted on this phone also turned into an Internet meme that trended throughout the night.\n\n[NATL] Justin Timberlake Performs at the Super Bowl LII Halftime Show\n\nKEVIN HART TRIES TO CELEBRATE WITH EAGLES\n\nKevin Hart was truly excited the Eagles won the Super Bowl. In fact, he was so excited that he tried to join the team on stage to accept the big trophy. However, the comedian was quickly denied, and he started arguing with an official. The entire incident was captured on camera and went viral. Hart got into more Super Bowl shenanigans when he dropped an F-bomb during a live post-game interview with defensive tackle Fletcher Cox.", "images": ["https://media.nbcdfw.com/2019/09/Coronavirus-Pandemic-New-York-April-17.jpg?crop=60px%2C248px%2C4296px%2C2417px&resize=850%2C478", "https://media.nbcdfw.com/2019/09/goodnews2-apr17.jpg?resize=850%2C478", "https://sb.scorecardresearch.com/p?c1=2&c2=6035083&cv=2.0&cj=1", "https://media.nbcdfw.com/2019/09/DFW_On_Dark@3x-3.png?fit=411%2C120", "https://media.nbcdfw.com/2019/09/DFW_On_Light@3x.png?fit=411%2C120", "https://media.nbcdfw.com/2019/09/topsbmoments.jpg?resize=850%2C478"], "top_img": "https://media.nbcdfw.com/2019/09/topsbmoments.jpg?resize=850%2C478", "keywords": [], "authors": ["Elyse Dupre"], "canonical_link": "https://www.nbcbayarea.com/uncategorized/most-talked-about-moments-from-the-2018-super-bowl/276704/", "title": "Most Talked-About Moments From the 2018 Super Bowl", "meta_data": {"viewport": "width=device-width, initial-scale=1", "generator": "WordPress 5.3.2", "og": {"site_name": "NBC 5 Dallas-Fort Worth", "type": "article", "description": "The 2018 Super Bowl was full of memorable moments. The Philadelphia Eagles beat the New England Patriots giving the team its first Super Bowl title.", "title": "Most Talked-About Moments From the 2018 Super Bowl", "url": "https://www.nbcdfw.com/news/national-international/most-talked-about-moments-from-the-2018-super-bowl/225279/", "image": "https://media.nbcdfw.com/2019/09/topsbmoments.jpg?resize=850%2C478"}, "google-site-verification": "TulxZlVUPoj7DKPRWGCGsen6t4RRfLKo9TwVr3Z-6x0", "fb": {"app_id": 79562228021}, "twitter": {"site": "@nbcdfw", "creator": "@nbcdfw", "description": "The 2018 Super Bowl was full of memorable moments. The Philadelphia Eagles beat the New England Patriots giving the team its first Super Bowl title.", "title": "Most Talked-About Moments From the 2018 Super Bowl", "url": "https://www.nbcdfw.com/news/national-international/most-talked-about-moments-from-the-2018-super-bowl/225279/", "image": "https://media.nbcdfw.com/2019/09/topsbmoments.jpg?resize=850%2C478"}, "article": {"opinion": "false", "content_tier": "free", "publisher": "http://www.facebook.com/nbcdfw"}, "description": "The 2018 Super Bowl was full of memorable moments. The Philadelphia Eagles beat the New England Patriots giving the team its first Super Bowl title.", "keywords": "Philadelphia Eagles, moments, Justin Timberlake, Super Bowl, Pink, title, singer, performance, PERFORMANCE, fans, Ava DuVernay, comedian, defensive tackle, Dirty Dancing, Eli Manning, Jr., Justin Timberlake, Kevin Hart, Minneapolis, Missy Elliot", "sailthru.title": "Most Talked-About Moments From the 2018 Super Bowl", "sailthru.description": "The 2018 Super Bowl was full of memorable moments. The Philadelphia Eagles beat the New England Patriots giving the team its first Super Bowl title.", "sailthru.tags": "Philadelphia Eagles, moments, Justin Timberlake, Super Bowl, Pink, title, singer, performance, PERFORMANCE, fans, Ava DuVernay, comedian, defensive tackle, Dirty Dancing, Eli Manning, Jr., Justin Timberlake, Kevin Hart, Minneapolis, Missy Elliot", "sailthru.type": "article", "sailthru.date": "2018-02-05T14:45:00+00:00", "taboola_lead": "video", "msapplication-TileImage": "https://media.nbcdfw.com/2019/09/cropped-NBC_DFW.png?fit=270%2C270"}, "movies": ["https://www.youtube.com/embed/KUoD-gPDahw"], "publish_date": 1517841900.0, "source": "https://www.nbcdfw.com", "summary": ""}