{"url": "https://people.com/tv/alan-thicke-widow-says-couple-planning-having-baby/", "text": "Just weeks before Alan Thicke passed away, the late actor and his wife were preparing to add a baby to their family.\n\nIn a new interview with E! News, Tanya Callau, who married the Growing Pains star in 2005, says that the couple was designing a nursery in their home in preparation of a new little addition.\n\nGet push notifications with news, features and more.\n\n“[Alan] went in for a full physical because we were planning on having a baby, so in order to go and do the whole sperm thing, he wanted to get a full physical and make sure that he was healthy and ready to go … the timing of it was just unbelievable,” Callau says in the interview.\n\nImage zoom Frazer Harrison/Getty\n\nThicke passed away unexpectedly on Dec. 13 at 69 years old after suffering a heart attack while playing hockey with his youngest son, Carter. But months prior to his death, he and his wife sat down with Tyler Henry for an episode of Hollywood Medium with Tyler Henry, which will air next Wednesday.\n\n“Tyler did say — this is something that’s uncovered on the episode —but when you did your reading, Alan did ask him, ‘Do you see children?’ And Tyler said, ‘No.’ And I kept saying to Alan, ‘Isn’t it strange that Tyler didn’t see that?’ Two weeks before my husband died, we were already starting to build a baby nursery. We had designed it and met with our architect and wanted to do the baby’s nursery upstairs … so it was near Alan’s office and near my bedroom,” Callau explains in the interview.\n\nRELATED VIDEO: Alan Thicke’s Sons Taking His Widow to Court Over Prenup She Claims Is Invalid\n\nCallau also notes that her husband later went in for a full physical after Henry brought up the topic of the heart numerous times during their filmed reading.\n\n“The fact that [Tyler] touched on the heart and kind of kept emphasizing that — my husband went in for a full checkup two months later and he had a full, clean health of bill. So what happened to Alan is a massive heart attack — an aorta. It’s hereditary and there was no indication that that was in the family histories. It wasn’t something that the doctors would have been looking for,” says Callau. “To see Tyler keep mentioning the heart … it was devastating to me because you always want to protect your loved ones and if you could have prevented it or done something, you’d want to be able to do that.”\n\nHenry also explains in the sit-down interview that his job “is really just to relay sometimes the medical susceptibilities that I’m told people have. In that case, that’s what happened.”\n\nFROM PEN: Learn The Process Behind Time Selecting The 100 Most Influential People\n\nLast week, according to court documents obtained by PEOPLE, Thicke’s two eldest sons — Brennan and Robin Thicke — filed a petition against Callau and claim in the documents that she is now alleging that the prenuptial agreement she signed ahead of marrying the actor in 2005 is invalid.\n\n“Nonetheless, despite Alan’s generous benefits and careful planning Tanya demands more. Tanya insists the Prenuptial Agreement that she entered into before marrying Alan is invalid,” the documents state.\n\nBut according to Callau’s attorney Adam F. Streisand, she “has never claimed that the prenup is invalid and has no intention of ever claiming it.”\n\n“Tanya Thicke has never threatened to take private family matters public and she never has,” Streisand said in a statement to PEOPLE. “It is clear that Alan’s sons have chosen this distasteful public smear tactic to bully Tanya, by stirring up the tabloid media, filing a bogus lawsuit, and refusing family mediation. Tanya is still grieving the death of her beloved husband and out of respect for Alan’s memory intends to handle his sons’ false statements privately.”\n\nHollywood Medium with Tyler Henry airs Wednesdays (8 p.m. ET) on E!", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F05%2Ftanya-callau-alan-thicke.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F05%2Ftanya-callau-alan-thicke.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F05%2Ftanya-callau-alan-thicke.jpg", "keywords": [], "authors": ["Natalie Stone"], "canonical_link": "https://people.com/tv/alan-thicke-widow-says-couple-planning-having-baby/", "title": "Alan Thicke's Widow Says They Were 'Planning on Having a Baby' Prior to His Death", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Alan Thicke,Death,News,TV", "news_keywords": "Alan Thicke,Death,News,TV", "description": "Alan Thicke died unexpectedly on Dec. 13 after suffering a heart attack", "og": {"title": "Alan Thicke's Widow Says They Were 'Planning on Having a Baby' Prior to His Death", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/alan-thicke-widow-says-couple-planning-having-baby/", "description": "Just weeks before Alan Thicke passed away, the late actor and his wife were preparing to add a baby to their family. In a new&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F05%2Ftanya-callau-alan-thicke.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/alan-thicke-widow-says-couple-planning-having-baby/", "description": "Alan Thicke died unexpectedly on Dec. 13 after suffering a heart attack", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F05%2Ftanya-callau-alan-thicke.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/alan-thicke-widow-says-couple-planning-having-baby/", "title": "Alan Thicke's Widow Says They Were 'Planning on Having a Baby' Prior to His Death", "description": "Alan Thicke died unexpectedly on Dec. 13 after suffering a heart attack", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F05%2Ftanya-callau-alan-thicke.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}