{"url": "https://www.wanttoknow.info/newsstories-0-10000", "text": "News Stories Excerpts of Key News Stories in Major Media\n\nNote: This comprehensive list of news stories is usually updated once a week. Explore our full index to revealing excerpts of key major media news stories on several dozen engaging topics. And don't miss amazing excerpts from 20 of the most revealing news articles ever published.\n\nMeet the world’s most powerful doctor: Bill Gates\n\n2017-05-04, Politico\n\nPosted: 2020-04-13 02:18:06\n\nSome billionaires are satisfied with buying themselves an island. Bill Gates got a United Nations health agency in Geneva. The world’s richest man has become the World Health Organization’s second biggest donor, second only to the United States. This largesse gives him outsized influence over its agenda. The result, say his critics, is that Gates’ priorities have become the WHO’s. When Gates started throwing money into malaria eradication, top officials — including the chief of the WHO’s malaria program — raised concerns that the foundation was distorting research priorities. “The term often used was ‘monopolistic philanthropy’, the idea that Gates was taking his approach to computers and applying it to the Gates Foundation,” said a source close to the WHO board. “He is treated liked a head of state, not only at the WHO, but also at the G20,” a Geneva-based NGO representative said. Some health advocates fear that because the Gates Foundation’s money comes from investments in big business, it could serve as a Trojan horse for corporate interests to undermine WHO’s role in setting standards and shaping health policies. The Gates Foundation has pumped more than $2.4 billion into the WHO since 2000. Dues paid by member states now account for less than a quarter of WHO’s $4.5 billion biennial budget. The rest comes from ... governments, Gates, other foundations and companies. Since these funds are usually earmarked for specific projects or diseases, WHO can’t freely decide how to use them.\n\nNote: Just to be clear, Bill Gates is neither an MD nor a PhD. This entire article has astounding information on the unethical relationship between Gates and the WHO and his desire to have a global ID to ensure everyone in the world is vaccinated. This Forbes article is titled \"Bill Gates Calls For National Tracking System For Coronavirus During Reddit AMA.\" For lots more, see this highly revealing video. For more along these lines, see concise summaries of deeply revealing news articles on health from reliable major media sources.\n\nFor Autocrats, and Others, Coronavirus Is a Chance to Grab Even More Power\n\n2020-03-30, New York Times\n\nPosted: 2020-04-13 02:15:15\n\nIn Hungary, the prime minister can now rule by decree. In Britain, ministers have what a critic called “eye-watering” power to detain people and close borders. Israel’s prime minister has shut down courts and begun an intrusive surveillance of citizens. Chile has sent the military to public squares once occupied by protesters. Bolivia has postponed elections. As the coronavirus pandemic brings the world to a juddering halt and anxious citizens demand action, leaders across the globe are invoking executive powers and seizing virtually dictatorial authority with scant resistance. Critics say some governments are using the public health crisis as cover to seize new powers that have little to do with the outbreak, with few safeguards to ensure that their new authority will not be abused. The laws are taking swift hold across a broad range of political systems — in authoritarian states like Jordan, faltering democracies like Hungary, and traditional democracies like Britain. And there are few sunset provisions to ensure that the powers will be rescinded once the threat passes. “We could have a parallel epidemic of authoritarian and repressive measures following close if not on the heels of a health epidemic,” said Fionnuala Ni Aolain, the United Nations Special Rapporteur on counterterrorism and human rights. As the new laws broaden state surveillance, allow governments to detain people indefinitely and infringe on freedoms of assembly and expression, they could also shape civic life, politics and economies for decades to come.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus pandemic and the erosion of civil liberties from reliable major media sources.\n\nHow Russia is using authoritarian tech to curb coronavirus\n\n2020-03-29, CNN News\n\nPosted: 2020-04-13 02:12:56\n\nThe Covid-19 pandemic is now giving Russian authorities an opportunity to test new powers and technology, and the country's privacy and free-speech advocates worry the government is building sweeping new surveillance capabilities. Perhaps the most well-publicized tech tool in Russia's arsenal for fighting coronavirus is Moscow's massive facial-recognition system. Rolled out earlier this year, the surveillance system had originally prompted an unusual public backlash, with privacy advocates filing lawsuits over unlawful surveillance. Coronavirus, however, has given an unexpected public-relations boost to the system. Last week, Moscow police claimed to have caught and fined 200 people who violated quarantine and self-isolation using facial recognition and a 170,000-camera system. Some of the alleged violators who were fined had been outside for less than half a minute before they were picked up by a camera. And then there's the use of geolocation to track coronavirus carriers. Prime Minister Mikhail Mishustin earlier this week ordered Russia's Ministry of Communications to roll out a tracking system based on \"the geolocation data from the mobile providers for a specific person\" by the end of this week. According to a description in the government decree, information gathered under the tracking system will be used to send texts to those who have come into contact with a coronavirus carrier, and to notify regional authorities so they can put individuals into quarantine.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus pandemic and the disappearance of privacy from reliable major media sources.\n\nE.P.A., Citing Coronavirus, Drastically Relaxes Rules for Polluters\n\n2020-03-26, New York Times\n\nPosted: 2020-04-13 02:11:13\n\nThe Environmental Protection Agency on Thursday announced a sweeping relaxation of environmental rules in response to the coronavirus pandemic, allowing power plants, factories and other facilities to determine for themselves if they are able to meet legal requirements on reporting air and water pollution. The move comes amid an influx of requests from businesses for a relaxation of regulations as they face layoffs, personnel restrictions and other problems related to the coronavirus outbreak. Issued by the E.P.A.’s top compliance official, Susan P. Bodine, the policy sets new guidelines for companies to monitor themselves for an undetermined period of time during the outbreak and says that the agency will not issue fines for violations of certain air, water and hazardous-waste-reporting requirements. Companies are normally required to report when their factories discharge certain levels of pollution. The order asks companies to “act responsibly” if they cannot ... monitor or report the release of hazardous air pollution. Businesses, it said, should “minimize the effects and duration of any noncompliance” and keep records to report to the agency how Covid-19 restrictions prevented them from meeting pollution rules. Gina McCarthy, who led the E.P.A. under the Obama administration ... called it “an open license to pollute.” She said that while individual companies might need flexibility, “this brazen directive is nothing short of an abject abdication of the E.P.A. mission to protect our well being.”\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on government corruption and the coronavirus pandemic from reliable major media sources.\n\nNew Research Links Air Pollution to Higher Coronavirus Death Rates\n\n2020-04-07, New York Times\n\nPosted: 2020-04-13 02:09:25\n\nCoronavirus patients in areas that had high levels of air pollution before the pandemic are more likely to die from the infection than patients in cleaner parts of the country, according to a new nationwide study that offers the first clear link between long-term exposure to pollution and Covid-19 death rates. In an analysis of 3,080 counties in the United States, researchers at the Harvard University T.H. Chan School of Public Health found that higher levels of the tiny, dangerous particles in air known as PM 2.5 were associated with higher death rates from the disease. For weeks, public health officials have surmised a link between dirty air and death or serious illness from Covid-19. The Harvard analysis is the first nationwide study to show a statistical link, revealing a “large overlap” between Covid-19 deaths and other diseases associated with long-term exposure to fine particulate matter. The paper found that if Manhattan had lowered its average particulate matter level by just a single unit, or one microgram per cubic meter, over the past 20 years, the borough would most likely have seen 248 fewer Covid-19 deaths by this point in the outbreak. The paper ... found that just a slight increase in long-term pollution exposure could have serious coronavirus-related consequences, even accounting for other factors like smoking rates and population density. The study also could have far-reaching implications for clean-air regulations, which the Trump administration has worked to roll back over the past three years.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus pandemic from reliable major media sources.\n\nNeed a Coronavirus Test? Being Rich and Famous May Help\n\n2020-03-18, New York Times\n\nPosted: 2020-04-13 02:07:06\n\nPoliticians, celebrities, social media influencers and even N.B.A. teams have been tested for the new coronavirus. But as that list of rich, famous and powerful people grows by the day, so do questions about whether they are getting access to testing that is denied to other Americans. With testing still in short supply in areas of the country, leaving health care workers and many sick people unable to get diagnoses, some prominent personalities have obtained tests without exhibiting symptoms or having known contact with someone who has the virus. In areas of the country where the virus has been slow to appear, people have been able to obtain tests easily. But in New York, California, Washington State and Massachusetts, where the virus has spread rapidly and demand for tests is most high, it is very difficult. The New York City Health Department has directed doctors only to order tests for patients in need of hospitalization. People with mild symptoms are being told to quarantine themselves at home. Even health care workers, at high risk of contracting the virus and transmitting it, have struggled to get tested. Police chiefs across the country are growing concerned that they cannot get their hands on tests. “What’s frustrating is to continue to hear that there aren’t testing kits available, and my rank and file have to continue to answer calls for service while professional athletes and movie stars are getting tested without even showing any symptoms,” said Eddie Garcia, the police chief of San Jose, Calif..\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus pandemic from reliable major media sources.\n\nTrump Ousts Pandemic Spending Watchdog Known for Independence\n\n2020-04-07, New York Times\n\nPosted: 2020-04-13 02:05:15\n\nPresident Trump moved on Tuesday to oust the leader of a new watchdog panel charged with overseeing how his administration spends trillions of taxpayer dollars in coronavirus pandemic relief, the latest step in an abruptly unfolding White House power play against semi-independent inspectors general across the government. The official, Glenn A. Fine, has been the acting inspector general for the Defense Department since before Mr. Trump took office and was set to become the chairman of a new Pandemic Response Accountability Committee to police how the government carries out the $2.2 trillion coronavirus relief bill. But Mr. Trump replaced Mr. Fine in his Pentagon job. In recent days, [Mr. Trump] fired an inspector general who reviewed the whistle-blower complaint that led to his impeachment, nominated a White House aide to another key inspector general post, declared that he would ignore certain oversight provisions in the new relief law and attacked another inspector general who criticized virus testing shortages. In removing Mr. Fine from his role overseeing pandemic spending, Mr. Trump targeted a former Justice Department inspector general who earned a reputation for aggressive independence in scrutinizing the F.B.I.’s use of surveillance and other law enforcement powers in the years after the Sept. 11, 2001, attacks. Replacing Mr. Fine ... will be Sean O’Donnell, who serves as the inspector general at the Environmental Protection Agency and will do double duty.\n\nNote: This 2015 article suggests that inspectors general have been under fire since the Obama administration. For more along these lines, see concise summaries of deeply revealing news articles on government corruption from reliable major media sources.\n\nCardinal Pell’s Acquittal Was as Opaque as His Sexual Abuse Trial\n\n2020-04-07, New York Times\n\nPosted: 2020-04-13 02:03:24\n\nCardinal George Pell walked out of prison on Tuesday after Australia’s highest court reversed his 2018 conviction for molesting two choirboys decades earlier — liberating the most senior Roman Catholic cleric to ever face trial over child sexual abuse. The world may never be able to assess whether the court’s reasoning was sound. The central evidence — the testimony of the main accuser, on which the case “was wholly dependent,” the judges wrote — has never been released, not in video, audio nor even redacted transcripts. It is just one glaring example of the secrecy and lack of accountability that have shaped the Pell prosecution from the beginning. The case has been a model of opaque operations, starting with judges who dismissed related allegations early on, followed by gag orders preventing media coverage and a refusal to release evidence — even when a jury verdict is dismissed as unreasonable. Legal experts said that the case made clear just how much power judges in Australia have to suppress public oversight and overrule jury verdicts. At every stage, critics argue, Australia’s courts exhibited a penchant for secrecy and insular decision-making that resembled the Catholic Church’s flawed and damaging response to sexual abuse within its ranks. For many of those who have been living with the legacy of abuse in the church, the High Court’s decision is a blow to their faith in a justice system they had just started to trust.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on sexual abuse scandals from reliable major media sources.\n\nThe ozone layer is healing, new study finds\n\n2020-03-26, MSN News/The Independent\n\nPosted: 2020-04-13 02:01:36\n\nThe ozone layer is continuing to heal and has the potential to fully recover, according to a new study. A scientific paper, published in Nature, heralds a rare success in the reversal of environmental damage and shows that orchestrated global action can make a difference. The ozone layer is a protective shield in the Earth’s stratosphere which absorbs most of the ultraviolet radiation reaching us from the sun. Antara Banerjee ... is lead author of the study. She told The Independent: “We found signs of climate changes in the southern hemisphere, specifically in the air circulation patterns. The challenge was showing that these changing air circulation patterns were due to the shrinking ozone hole following the implementation of the Montreal Protocol. The jet stream in the southern hemisphere was gradually shifting towards the south pole in the last decades of the 20th century due to ozone depletion. Our study found that movement has stopped since 2000 and might even be reversing. The pause in movement began around the same time that the ozone hole started to recover. The emissions of ozone-depleting substances that were responsible for the ozone hole - the CFCs from spray cans and refrigerants – started to decline around 2000, thanks to the Montreal Protocol.” Overall, it is good news for the fight against climate change. She added: “It shows that this international treaty has worked and we can reverse the damage that we’ve already done to our planet. That’s a lesson to us all.”\n\nNote: The Nature study referenced above is available here. Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nA letter to the UK from Italy: this is what we know about your future\n\n2020-03-27, The Guardian (One of the UK's leading newspapers)\n\nPosted: 2020-04-13 02:00:00\n\nI am writing to you from Italy, which means I am writing from your future. We are now where you will be in a few days. As we watch you from here, from your future, we know that many of you, as you were told to lock yourselves up into your homes, quoted Orwell, some even Hobbes. But soon you’ll be too busy for that. First of all, you’ll eat. Not just because it will be one of the few last things that you can still do. Old resentments and falling-outs will seem irrelevant. You will call people you had sworn never to talk to ever again, so as to ask them: “How are you doing?” You’ll laugh. You’ll laugh a lot. You’ll flaunt a gallows humour you never had before. Even people who’ve always taken everything dead seriously will contemplate the absurdity of life, of the universe and of it all. You will count all the things you do not need. The true nature of the people around you will be revealed with total clarity. You will have confirmations and surprises. Those who invite you to see all this mess as an opportunity for planetary renewal will help you to put things in a larger perspective. You will also find them terribly annoying: nice, the planet is breathing better because of the halved CO2 emissions, but how will you pay your bills next month? You will not understand if witnessing the birth of a new world is more a grandiose or a miserable affair. You will play music from your windows and lawns. When you saw us singing opera from our balconies, you thought “ah, those Italians”. But we know you will sing uplifting songs to each other too.\n\nNote: The above was written by acclaimed Italian novelist Francesca Melandri. Note that the number of people dying from the coronavirus in Italy has been gradually decreasing since it peaked on March 26th. Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nHydroxychloroquine rated ‘most effective’ coronavirus treatment, poll of doctors finds\n\n2020-04-02, New York Post\n\nPosted: 2020-04-13 01:57:49\n\nAn international poll of thousands of doctors rated the Trump-touted anti-malaria drug hydroxychloroquine the best treatment for the novel coronavirus. Of the 2,171 physicians surveyed, 37 percent rated hydroxychloroquine the “most effective therapy” for combating the potentially deadly illness. The survey, conducted by the global health care polling company Sermo, also found that 23 percent of medical professionals had prescribed the drug in the US — far less than other countries. “Outside the US, hydroxychloroquine was equally used for diagnosed patients with mild to severe symptoms whereas in the US it was most commonly used for high risk diagnosed patients,” the survey found. The medicine was most widely used in Spain, where 72 percent of physicians said they had prescribed it. Of the 2,171 doctors asked which drug is most effective, 37 said hydroxychloroquine. By contrast, 32 percent answered “nothing.” To date, “there is no evidence” that any medicine “can prevent or cure the disease,” according to the World Health Organization. But Sermo CEO Peter Kirk called the polling results a “treasure trove of global insights for policymakers.” “Physicians should have more of a voice in how we deal with this pandemic and be able to quickly share information with one another and the world,” he said in a press release. The 30 countries where doctors were surveyed included Europe, South America and Australia — and no incentives were provided to participate, the company said.\n\nNote: How interesting that very few major media reported on this. Could it be because this drug is inexpensive and big Pharma, which hugely sponsors the major media, won't make big profits? Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nBill Gates and his coronavirus conflicts of interest\n\n2020-04-02, Washington Times\n\nPosted: 2020-04-12 22:57:21\n\nBill Gates ... just called for a complete and utter shutdown and quarantining of the entire American nation. “Despite urging from public health experts,” Gates wrote in a Washington Post opinion piece, “some states and counties haven’t shut down completely. This is a recipe for disaster. Because people can travel freely across state lines, so can the virus. The country’s leaders need to be clear: Shutdown anywhere means shutdown everywhere. Until the case numbers start to go down ... no one can continue business as usual or relax the shutdown.” He then added that the impacts of the new coronavirus could linger another 18 months or so, until a vaccine was developed. For the peons of America, work isn’t an option. It’s food. It’s survival. The fate of a hard-earned dream shouldn’t rest with a globalist billionaire who’s warning of dire coronavirus consequences to come — all the while making hands-over-fist coronavirus money. It’s a conflict of interest. WHO didn’t announce the coronavirus as a pandemic until the very day after Gates ... made a very large donation to a cause that benefits WHO. In a 2017 piece titled, “Meet the world’s most powerful doctor: Bill Gates,” Politico wrote: “Some billionaires are satisfied with buying themselves an island. Bill Gates got a United Nations health agency. Over the past decade, the world’s richest man has become the World Health Organization’s second-biggest donor, second only to the United States. … This largesse gives him outsized influence over its agenda. … The result, say his critics, is that Gates‘ priorities have become the WHO‘s.”\n\nVery Important Note: To understand how the coronavirus is being used to exert more control over humanity, don't miss this incredibly important video focused on how Bill Gates is blatantly using fear around the coronavirus to push through his agenda to vaccinate everyone on the planet and then microchip them as a way to ensure they've been vaccinated. For other reliable, verifiable informing demonstrating how Gates' vaccine agenda has already harmed hundreds of thousands of children read this excellent article by Robert F. Kennedy, Jr.\n\nJapan’s coronavirus response is too little, too late\n\n2020-04-10, Washington Post\n\nPosted: 2020-04-12 22:53:44\n\nTokyo’s coronavirus “state of emergency” is as surreal as they come. Though the streets are noticeably quieter than normal, subways and buses are still jammed with commuters. Stock trading goes on as normal. Many bars, restaurants and cafes are abuzz. So are barbershops, beauty salons and home improvement centers. In Shibuya and other meccas of youth culture, teenagers who should be hunkering down at home are out and about. Leave it to Japan’s largest metropolis to morph shelter-in-place into a giant kabuki performance starring 8.3 million people. [Prime Minister] Abe should dispense with the pandemic kabuki and call for a strict shelter-in-place policy. Though there are legal questions about enforceability, Abe could use the bully pulpit to urge Japanese — and companies — to comply.\n\nImportant Editor's Note: This article is a prime example of how the media is bulldozing it's social isolation agenda and convincing people to willingly give up their freedoms. Japan was one of the first countries hit by the virus, with it's first death due to the coronavirus on Feb. 13th. Yet while the U.S., Italy, France, Spain, and the UK all had their first coronavirus deaths after Japan, all of these countries as of April 12th had tens of thousands of deaths, while Japan had only 124 deaths. That's 100 times less. Instead of calling for stricter policies in Japan, why isn't everyone asking what they are doing to have such an incredibly low death rate without instituting lockdown procedures? For more serious questions on how we are being manipulated, see this excellent essay.\n\nCoronavirus: Why Dutch lockdown may be a high-risk strategy\n\n2020-04-05, BBC News\n\nPosted: 2020-04-12 22:51:51\n\nThe Netherlands has tried to adopt an \"intelligent lockdown\", but the infection is spreading rapidly and it has one of the world's highest mortality rates from the pandemic. Having shunned the stricter measures of neighbouring states the government has pursued an \"intelligent\" or \"targeted\" lockdown. It wants to cushion the social, economic and psychological costs of social isolation and make the eventual return to normality more manageable. [The] local florist, ironmonger, delicatessen, bakery and toy store are still serving customers. Posters on the door and sticky tape on the floor encourage people to give each other space. Only those businesses that require touching, like hairdressers, beauticians and red light brothels, have been forced to cease trading. Schools, nurseries and universities are closed. Bars, restaurants and cannabis cafes are shut, although they seem to be doing a roaring trade in takeaways. \"We think we're cool-headed,\" explained Dr Louise van Schaik of the Clingendael Institute of International Relations. \"We don't want to overreact, to lock up everybody in their houses.\" People have been advised to stay at home, but you can go out if you are unable to work from home ... as long as you maintain 1.5m (5ft) social distance. It helps that the Dutch appear to be broadly compliant. One survey suggested 99% of people kept their distance. Dutch public health agency RIVM has launched a study to see how far antibodies created when people are exposed remain effective in preventing re-infection. \"It's kind of like creating your own internal vaccine, by being exposed to it and then letting your body generate those antibodies naturally,\" Prof Aura Timen from the RIVM told the BBC.\n\nNote: On 3/28, the Netherlands had over six times as many deaths as California with 639 compared to California's 104. Yet 15 days later (4/12), California had risen 608% to 633, while the Netherlands has gone up only 428% to 2,737. This is quite interesting considering that California has been in lockdown since 3/19. You can verify this by going to this link of archived statistics on the virus and clicking on the dates in question. For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus from reliable major media sources.\n\nSweden challenges Trump -- and scientific mainstream -- by refusing to lock down\n\n2020-04-10, CNN News\n\nPosted: 2020-04-12 22:50:06\n\nMuch of Europe is still on coronavirus lockdown, with severe restrictions on movement and penalties for those who transgress. But not Sweden. Restaurants and bars are open in the Nordic country, playgrounds and schools too, and the government is relying on voluntary action to stem the spread of Covid-19. The Swedish government is confident its policy can work. Sweden's actions are about encouraging and recommending, not compulsion. Elisabeth Liden, a journalist in Stockholm, [noted that] \"the subway went from being completely packed to having only a few passengers per car. I get the sense that a vast majority are taking the recommendations of social distancing seriously.\" On March 24, new rules were introduced to avoid crowding at restaurants. But they very much stayed open. So did many primary and secondary schools. Gatherings of up to 50 people are still permitted. The country's state epidemiologist, Anders Tegnell ... defended the decision to keep schools open [saying] \"a lot of children are suffering when they can't go to school.\" Much of Sweden's focus has been to protect the elderly. Anyone aged 70 or older has been told to stay at home and limit their social contact as much as possible. Another factor in Sweden's favor is a generous social welfare net that means people don't feel obligated to turn up for work if their young child is sick. State support kicks in on day one of absence from work due to a child being sick. The next month will determine whether the Swedish system got it right.\n\nNote: On 3/28, Sweden had twice as many deaths (203) as California (104). Yet 15 days later (4/12), California had risen 608% to 633, while Sweden had risen only 443% to 899. This is quite interesting considering that California has been in lockdown since 3/19, yet Sweden is not. You can verify these figures by going to this link of archived statistics from Johns Hopkins on the virus and clicking on the dates in question. For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus from reliable major media sources.\n\nThe Attorney General's Power Grab in the Shadow of the Pandemic is Unprecedented, Unconstitutional—and Unnecessary\n\n2020-03-25, Newsweek\n\nPosted: 2020-04-07 01:22:35\n\nOur Attorney General submitted a proposal last week that would dramatically erode our civil liberties. Among other things, the proposal suspends habeas corpus ... or the right to appear before a judge before being detained. That right is enshrined in our Constitution and without it, Barr could hold Americans indefinitely without a trial. Our justice system is grounded in an unwavering guarantee that each one of us is entitled to certain inalienable rights, including the right to due process before one's freedom is taken away. On March 13, the President declared a national emergency, which unlocked special powers to keep our country safe. Congress has enacted roughly 120 laws that allow presidents such powers to meet precisely these types of threats while maintaining our democracy. These laws are not without limits. Nor were they meant to be used to capitalize on fear to unnecessarily erode our freedoms. Yet while the world is consumed by this pandemic and when he thought no one was watching, Attorney General William Barr proposed granting himself immense, permanent powers extending far past the needs posed by this threat. For example, the proposal grants Barr personally the power to ask any chief judge to hold a citizen, \"whenever the district court is fully or partially closed by virtue of any natural disaster, civil disobedience, or other emergency situation.\" If this were about COVID-19, the proposal would suspend only certain rights narrowly tailored to fighting this disease.\n\nNote: This New York Times article details how autocrats around the world are using the fear generated to grab power. Read another highly informative article on how this crisis is being exploited to grab power. For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus pandemic and the erosion of civil liberties from reliable major media sources.\n\nCoronavirus: India's pandemic lockdown turns into a human tragedy\n\n2020-03-30, BBC News\n\nPosted: 2020-04-07 01:20:42\n\nIndia declared a 21-day lockdown with four hours notice on the midnight of 24 March to prevent the spread of coronavirus. All over India, millions of migrant workers are fleeing its shuttered cities and trekking home to their villages. These informal workers are the backbone of the big city economy. Escaping poverty in their villages, most of the estimated 100 million of them live in squalid housing in congested urban ghettos. Last week's lockdown turned them into refugees overnight. Their workplaces were shut, and most employees and contractors who paid them vanished. Sprawled together, men, women and children began their journeys at all hours of the day last week. When the children were too tired to walk, their parents carried them on their shoulders. Clearly, a lockdown to stave off a pandemic is turning into a humanitarian crisis. In the end, India is facing daunting and predictable challenges in enforcing the lockdown and also making sure the poor and homeless are not fatally hurt. India has already announced a $22bn relief package for those affected by the lockdown. The next few days will determine whether the states are able to transport the workers home or keep them in the cities and provide them with food and money. \"People are forgetting the big stakes amid the drama of the consequences of the lockdown: the risk of millions of people dying,\" says Nitin Pai of Takshashila Institution, a prominent think tank. \"There too, likely the worst affected will be the poor.\"\n\nNote: In how many countries besides India is this scenario playing out? For more along these lines, see concise summaries of deeply revealing news articles on government corruption and the coronavirus pandemic from reliable major media sources.\n\nThe U.S. wants smartphone location data to fight coronavirus. Privacy advocates are worried.\n\n2020-03-18, NBC News\n\nPosted: 2020-04-07 01:18:26\n\nThe White House and the Centers for Disease Control and Prevention are asking Facebook, Google and other tech giants to give them greater access to Americans' smartphone location data in order to help them combat the spread of the coronavirus, according to four people at companies involved in the discussions who are not authorized to speak about them publicly. Federal health officials say they could use anonymous, aggregated user data collected by the tech companies to map the spread of the virus — a practice known as \"syndromic surveillance\" — and prevent further infections. They could also use the data to see whether people were practicing \"social distancing.\" The federal effort [was] first reported by The Washington Post. The government officials have held at least two calls in recent days with representatives from the companies, the sources said. Those officials are \"very serious\" about making this happen, a person at one of the tech companies said. Similar and more aggressive surveillance practices have already been put to use in China, South Korea and Israel. The moves have set off alarm bells among privacy advocates who fear what the government may do with users' data. Facebook already provides health researchers and nongovernmental organizations in some countries with anonymized data to help disease prevention efforts. Representatives from Facebook, Google, Twitter, Apple, Amazon, Microsoft, IBM and Cisco all took part in the call with White House and federal health officials.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus pandemic and the disappearance of privacy from reliable major media sources.\n\nThe Fed’s Cure Risks Being Worse Than the Disease\n\n2020-03-29, Washington Post\n\nPosted: 2020-04-07 01:16:21\n\nThe economic debate of the day centers on whether the cure of an economic shutdown is worse than the disease of the virus. Similarly, we need to ask if the cure of the Federal Reserve getting so deeply into corporate bonds, asset-backed securities, commercial paper, and exchange-traded funds is worse than the disease seizing financial markets. It may be. In just these past few weeks, the Fed has cut rates by 150 basis points to near zero and run through its entire 2008 crisis handbook. That wasn’t enough to calm markets, though — so the central bank also announced $1 trillion a day in repurchase agreements and unlimited quantitative easing, which includes a hard-to-understand $625 billion of bond buying a week going forward. At this rate, the Fed will own two-thirds of the Treasury market in a year. But it’s the alphabet soup of new programs that deserve special consideration, as they could have profound long-term consequences. The federal government is nationalizing large swaths of the financial markets. The Fed is providing the money to do it. If these acronym programs were abused ... they might indeed force markets higher than valuation warrants. But it would come with a heavy price. Investors would be deprived of the necessary market signals that freely traded capital markets offer to aid in the efficient allocation of capital. Malinvestment would be rampant. It also could force private sector players to leave as the government’s heavy hand makes operating in “controlled” markets uneconomic.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus pandemic and financial industry corruption from reliable major media sources.\n\nNew Oxford study suggests millions of people may have already built up coronavirus immunity\n\n2020-03-24, Yahoo! News\n\nPosted: 2020-04-07 01:14:14\n\nA model predicting the progression of the novel coronavirus pandemic produced by researchers at Imperial College London set off alarms across the world and was a major factor in several governments' decisions to lock things down. But a new model from Oxford University is challenging its accuracy. The Oxford research suggests the pandemic is in a later stage than previously thought and estimates the virus has already infected at least millions of people worldwide. In the United Kingdom, which the study focuses on, half the population would have already been infected. If accurate, that would mean transmission began around mid-January and the vast majority of cases presented mild or no symptoms. The head of the study, professor Sunetra Gupta, an Oxford theoretical epidemiologist, said she still supports the U.K.'s decision to shut down the country to suppress the virus. But she also doesn't appear to be a big fan of the work done by the Imperial College team. If her work is accurate, that would likely mean a large swath of the population has built up resistance to the virus. Theoretically, then, social restrictions could ease sooner than anticipated. What needs to be done now, Gupta said, is a whole lot of antibody testing to figure out who may have contracted the virus. Her research team is working with groups from the University of Cambridge and the University of Kent to start those tests for the general population as quickly as possible.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus pandemic from reliable major media sources.\n\nDesperate for medical equipment, states encounter a beleaguered national stockpile\n\n2020-03-28, Washington Post\n\nPosted: 2020-04-07 01:12:13\n\nA shouting match broke out in the White House Situation Room between Health and Human Services Secretary Alex Azar and an Office of Management and Budget official. Azar had asked OMB ... for $2 billion to buy respirator masks and other supplies for a depleted federal stockpile of emergency medical equipment. The relief package enacted Friday secured $16 billion for the Strategic National Stockpile. States desperate for materials from the stockpile are encountering a beleaguered system beset by years of underfunding, changing lines of authority, confusion over the allocation of supplies and a lack of transparency from the administration. The stockpile holds masks, drugs, ventilators and other items in secret sites around the country. It has become a source of growing frustration for many state and hospital officials who are having trouble buying — or even locating — crucial equipment on their own. Massachusetts ... has received 17 percent of the protective gear it requested. Maine requested a half-million N95 specialized protective masks and received 25,558 — about 5 percent of what it sought. Florida has been an exception in its dealings with the stockpile: The state submitted a request on March 11 for 430,000 surgical masks, 180,000 N95 respirators, 82,000 face shields and 238,000 gloves, among other supplies — and received a shipment with everything three days later. President Trump repeatedly has warned states not to complain about how much they are receiving.\n\nNote: This 2018 Washington Post article raises many questions about the secret U.S. stockpile. For more along these lines, see concise summaries of deeply revealing news articles on government corruption and the coronavirus pandemic from reliable major media sources.\n\nTrump rejects congressional oversight of $500 billion in corporate relief\n\n2020-03-30, San Francisco Chronicle (San Francisco's leading newspaper)\n\nPosted: 2020-04-07 01:10:19\n\nThe coronavirus financial aid package that landed on President Trump’s desk last week included a $500 billion corporate-loan fund that contained a major downside for his administration: Congressional Democrats had pushed for increased oversight of the loans, with a federal investigator designated to report to lawmakers on uses of the funding. So Trump, in endorsing the legislation Saturday, turned to a device he has used in record numbers during his tenure, the presidential “signing statement”. He signed the bill into law, but in the accompanying statement, he said he would not be bound by provisions that interfered with executive authority. Trump said he would not allow an inspector general to report to Congress because the Constitution, in his view, requires “presidential supervision” of such information. Using the signing statement to get his way with Congress is a familiar maneuver for Trump. It was at least the 769th signing statement Trump has issued since he took office. President George W. Bush, who produced more signing statements than all previous presidents combined, issued 750 in his first term. The disputes that arise between presidents and Congress because of executive signing statements could be resolved by the courts. But members of Congress have generally been unwilling to file suit, and it is difficult to find private citizens who can ... establish legal standing. Unless a court says otherwise, the president, not Congress, will have the last word on the $500 billion loan fund.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on government corruption from reliable major media sources.\n\nOne Year of U.S. Nuclear Weapons Spending Would Provide 300,000 ICU Beds, 35,000 Ventilators and Salaries of 75,000 Doctors\n\n2020-03-26, Newsweek\n\nPosted: 2020-04-07 01:08:07\n\nThe amount of money spent in one year by the U.S. on nuclear weapons could instead provide 300,000 ICU (intensive care unit) beds, 35,000 ventilators and 75,000 doctors' salaries, according to the International Campaign to Abolish Nuclear Weapons (ICAN) - a \"coalition of non-government organizations promoting adherence to and implementation of the UN [United Nations} nuclear weapon ban treaty.\" In its recent report, the group stated that, according to armscontrol.org, the U.S. spent $35.1 billion on nuclear weapons in 2019. As the number of confirmed COVID-19 cases increases, more resources are required. The shortage of ventilators in U.S. hospitals has ... been a major issue during the coronavirus pandemic. During a recent interview with Vox, Dr. Tom Freiden, former head of the Centers for Disease Control and Prevention (CDC), stated that \"in the worst-case scenario, in which there is an exponential surge in COVID-19 cases, the need for ventilators could greatly outstrip the number available.\" In addition to the shortage, the cost of the ventilators has also become a problem for hospitals. They can cost between $25,000 to $50,000 and require very skilled people to run them. The report published by ICAN also touches on the nuclear spending costs of the United Kingdom and France. For instance, France spent around $4.9 million on nuclear weapons in 2019. This amount ... would translate to 100,000 ICU beds, 10,000 ventilators and the salaries of 20,000 French nurses and 10,000 French doctors.\n\nNote: Read this Washington Post article about a secret stockpile which could be used now. For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus pandemic from reliable major media sources.\n\nHere are some educational resources for parents during coronavirus quarantine\n\n2020-03-30, Baltimore Sun\n\nPosted: 2020-04-07 01:06:02\n\nWith Maryland schools and some places of work closed amid the coronavirus pandemic, parents are looking for creative new ways to educate their children at home. One expert in homeschooling says a coronavirus-related quarantine situation should not be mistaken for a traditional educational setting. And parents should not lose sleep over whether their children are getting enough learning materials during such uncertain times. “We’re dealing with a global pandemic ... we need to worry about how we’re helping our children to cope with the stress,\" said Alessa Giampaolo Keener, an educational consultant. One of the best ways to help students stay mentally engaged in the coming weeks is by finding a routine that works for them without caving to the pressure [to] interrupt play or set elaborate schedules for children. Older children may respond well to being given a list of chores or assignments to complete by a set deadline, which allows them the autonomy to budget their own time throughout the day. The Khan Academy is a nonprofit that offers online educational resources for students, teachers and parents. Families can find day-by-day projects on Scholastic’s Learn at Home webpage to keep kids thinking during a quarantine. Projects are available for levels Pre-K through 9th grade. Some kids may miss recess and gym class just as much as academics. Families can find yoga, mindfulness and relaxation exercises on the Cosmic Kids Yoga Channel on YouTube.\n\nNote: You can find more useful homeschooling resources on this webpage and this one and this one. Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nWhy CEOs are giving up their salaries during the coronavirus crisis\n\n2020-03-26, CNN News\n\nPosted: 2020-04-07 01:04:21\n\nCoronavirus has hit companies hard and fast over the past several weeks — prompting calls for industry bailouts and dramatic measures to cut costs. Among the steps some major corporations are taking to mitigate the consequences of the outbreak are pay cuts to CEOs and other top executives. Executive pay cuts alone aren't likely to have a significant impact on companies' bottom lines or provide a boost to lower-paid employees further down the org chart. But they send an important message. Airlines and travel companies, one of the industries hit hardest by the outbreak early on, were among the first to take such a step, including Delta (DAL), Alaska (ALK), United Airlines (UAL) and others, which all announced CEO pay cuts, and other executive compensation reductions. Marriott (MAR), the world's largest hotel chain, said last week that CEO Arne Sorenson will not take home any salary for the rest of the year, and the rest of the executive team will take a 50% pay cut. The announcement came at the same time that the company said it would begin furloughing what could be tens of thousands of hotel workers, from housekeepers to general managers. On Wednesday, Dick's Sporting Goods (DKS) also announced its CEO Ed Stack and President Lauren Hobart will forgo their salaries, except for an amount covering company-provided benefits. The company's other named executive officers will take a 50% reduction in base salary. Other companies, including Ford (F), GE (GESLX) and Lyft (LYFT) have taken similar steps.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nWhat Taiwan can teach the world on fighting the coronavirus\n\n2020-03-10, NBC News\n\nPosted: 2020-04-07 01:02:41\n\nAs countries around the world grapple with the coronavirus, Taiwan may offer valuable lessons on how to curb its spread. The island is just 81 miles and a short flight away from mainland China, where COVID-19 is believed to have originated in the city of Wuhan. And yet, Taiwan has had only 50 cases of COVID-19 and one death. Of the 100-plus countries and territories affected, Taiwan has the lowest incidence rate per capita — around 1 in every 500,000 people. What lessons can Taiwan teach the world so other countries can stem the spread of the virus? On Dec. 31, the same day China notified the World Health Organization that it had several cases of an unknown pneumonia, Taiwan’s Centers for Disease Control immediately ordered inspections of passengers arriving on flights from Wuhan. Taiwan began requiring hospitals to test for and report cases. That helped the government identify those infected, trace their contacts and isolate everyone involved. Equally important, Taiwan's CDC activated the Central Epidemic Command Center relatively early on Jan. 20 and that allowed it to quickly roll out a series of epidemic control measures. The country’s health insurance system, which covers 99 percent of the population, has been crucial. “You can get a free test, and if you’re forced to be isolated, during the 14 days, we pay for your food, lodging and medical care,” [government spokesperson Kolas Yotaka] said. “So no one would avoid seeing the doctor because they can’t pay for health care.”\n\nNote: This wired.com article further shows how Singapore is doing well with the pandemic. Another article shows why several countries have had success in this. Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nAs Congress Pushes a $2 Trillion Stimulus Package, the “How Will You Pay For It?” Question Is Tossed in the Trash\n\n2020-03-27, The Intercept\n\nPosted: 2020-04-06 20:42:32\n\nHow was Congress able to come up with $2 trillion so quickly? Where is the money coming from? On Friday, the House of Representatives, led by Speaker Nancy Pelosi ... waved away that question, preparing to rubber-stamp a $2 trillion Senate package aimed at staving off economic collapse. The details of the legislation — particularly the $500 billion, strings-optional corporate slush fund — may be shameful ... but the moment is instructive ... as it became clear that concerns about deficits and revenue had evaporated. Congress has ignored millions of people who have existed in a state of crisis for decades. The people of Flint, Michigan, (and elsewhere) still do not have safe drinking water. Millions of kids go hungry each day. There has been no multitrillion-dollar spending bill to combat these and other domestic emergencies. Instead, lawmakers have deprived communities of critical investments that could have attenuated their emergencies, often hiding behind the excuse that there isn’t enough money in the budget to deal with problems like these. Congress is doing now what it could always have done. Uncle Sam can’t run out of dollars. The U.S. government is the issuer of our currency — the U.S. dollar — which means that ... it can never find itself in a situation in which it has bills coming due that it can’t afford to pay. If the votes are there, the money can always be made available. When all of this is behind us, to the extent that it ever can be, let’s not forget what we’ve learned.\n\nNote: The entire article at the link above raises important questions about why Congress hasn't made more money available in the past for much needed support of a variety of important programs. The author, Stephanie Kelton, served as the chief economist for Democrats on the U.S. Senate Budget Committee. For more along these lines, see concise summaries of deeply revealing news articles on banking and financial corruption from reliable major media sources. Then explore the excellent, reliable resources provided in our Banking Corruption Information Center.\n\nWhy this Nobel laureate predicts a quicker coronavirus recovery: ‘We’re going to be fine’\n\n2020-03-22, Los Angeles Times\n\nPosted: 2020-03-30 02:23:35\n\nMichael Levitt, a Nobel laureate and Stanford biophysicist, began analyzing the number of COVID-19 cases worldwide in January and correctly calculated that China would get through the worst of its coronavirus outbreak long before many health experts had predicted. Now he foresees a similar outcome in the United States and the rest of the world. While many epidemiologists are warning of months, or even years, of massive social disruption and millions of deaths, Levitt says the data simply don’t support such a dire scenario — especially in areas where reasonable social distancing measures are in place. “What we need is to control the panic,” he said. In the grand scheme, “we’re going to be fine.” Here’s what Levitt noticed in China: On Jan. 31, the country had 46 new deaths due to the novel coronavirus, compared with 42 new deaths the day before. Although the number of daily deaths had increased, the rate of that increase had begun to ease off. It was an early sign that the trajectory of the outbreak had shifted. “This suggests that the rate of increase in the number of deaths will slow down even more over the next week,” Levitt wrote. He predicted that the total number of confirmed COVID-19 cases in China would end up around 80,000, with about 3,250 deaths. This forecast turned out to be remarkably accurate. Now Levitt ... is seeing similar turning points in other nations. He analyzed data from 78 countries that reported more than 50 new cases of COVID-19 every day and sees “signs of recovery” in many of them.\n\nNote: Consider the research of 12 other experts questioning the coronavirus panic. For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus pandemic from reliable major media sources.\n\nDOJ Wants to Suspend Certain Constitutional Rights During Coronavirus Emergency\n\n2020-03-21, Rolling Stone\n\nPosted: 2020-03-30 02:20:29\n\nThe Trump Department of Justice has asked Congress to craft legislation allowing chief judges to indefinitely hold people without trial and suspend other constitutionally-protected rights during coronavirus and other emergencies, according to a report by Politico. The DOJ has requested Congress allow any chief judge of a district court to pause court proceedings “whenever the district court is fully or partially closed by virtue of any natural disaster, civil disobedience, or other emergency situation,” according to draft language obtained by Politico. This would be applicable to “any statutes or rules of procedure otherwise affecting pre-arrest, post-arrest, pre-trial, trial, and post-trial procedures in criminal and juvenile proceedings and all civil processes and proceedings.” But the Constitution grants citizens habeas corpus which gives arrestees the right to appear in front of a judge and ask to be released before trial. Enacting legislation like the DOJ wants would essentially suspend habeas corpus indefinitely until the emergency ended. Further, DOJ asked Congress to suspend the statute of limitations on criminal investigations and civil proceedings during the emergency until a year after it ended. That means you could be arrested and never brought before a judge until they decide that the emergency or the civil disobedience is over. The DOJ ... also asked Congress to pass a law saying that immigrants who test positive for COVID-19 cannot qualify as asylum seekers.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus pandemic and the erosion of civil liberties from reliable major media sources.\n\nCoronavirus: California prepared to enact martial law if its a 'necessity', governor says\n\n2020-03-18, The Independent (One of the UK's leading newspapers)\n\nPosted: 2020-03-30 02:18:38\n\nCalifornia has prepared for worst case scenarios as the coronavirus pandemic heightens, including the possibility of enacting martial law. Governor Gavin Newsom said during a press conference on Tuesday he would consider implementing martial law if it was necessary to curb the novel virus. “We have the ability to do martial law ... if we feel the necessity,” he said. Issuing martial law would be an unprecedented move rarely used by officials in US history. If enacted, it would temporarily replace civil rule with military authority. The precedent for martial law in the US states “certain civil liberties may be suspended, such as the right to be free from unreasonable searches and seizures, freedom of association, and freedom of movement,” according to a legal journal. The president and Congress have the power to enact martial law for the entire country. State governors also have the power to enact martial law if its in their state’s constitution. Previous examples of martial law used include after World War II, specifically following the bombing of Pearl Harbour, when the state of Hawaii was held under martial law from 1941 to 1944. President Abraham Lincoln also used martial law during the Civil War to temporarily suspend habeas corpus, which is the right to a trial before imprisonment. California considering the possibility of using martial law on Tuesday comes just two days after the governor said he had no current plans for the measure.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus pandemic and the erosion of civil liberties from reliable major media sources.\n\nWe can't let the coronavirus lead to a 9/11-style erosion of civil liberties\n\n2020-03-23, The Guardian (One of the UK's leading newspapers)\n\nPosted: 2020-03-30 02:16:32\n\nMy adulthood has been punctuated by severe national emergencies. The first my generation experienced was the terrorist attack on September 11, 2001. The government quickly responded by attempting to achieve two things: one, expanding executive power, and two, transferring public wealth into private corporations. The second national emergency my generation experienced was the 2008 housing bubble collapse and subsequent recession. Again the federal government ... sought to exploit the crisis to move vast wealth from the public treasury into private bank accounts. A staggering $14tn was transferred from taxpayers to private hands. [The] latest iteration is the Covid-19 pandemic. Once again, the federal government appears poised to exploit this emergency to expand executive power and move wealth from the public treasury into private bank accounts. As we witnessed with the authoritarian reactions to 9/11, emergency violations of civil liberties are not easily rolled back, and often aggregate over time. In the wake of 9/11, Congress passed the National Defense Authorization Act, which gave sweeping powers to the executive branch. In 2012, Obama signed an expanded version into law, which gave the president the power to “hold individuals, including US citizens, in military detention indefinitely”, which means for life. We must reject such authoritarian measures wholly.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on government corruption and the erosion of civil liberties from reliable major media sources.\n\nDeadly Germ Research Is Shut Down at Army Lab Over Safety Concerns\n\n2019-08-05, New York Times\n\nPosted: 2020-03-30 02:14:09\n\nSafety concerns at a prominent military germ lab have led the government to shut down research involving dangerous microbes. “Research is currently on hold,” the United States Army Medical Research Institute of Infectious Diseases, in Fort Detrick, Md., said in a statement. The Centers for Disease Control and Prevention decided to issue a “cease and desist order” last month to halt the research at Fort Detrick because the center did not have “sufficient systems in place to decontaminate wastewater” from its highest-security labs. The C.D.C. cited “national security reasons” as the rationale for not releasing information about its decision. The institute is a biodefense center that studies germs and toxins that could be used to threaten the military or public health, and also investigates disease outbreaks. The problems date back to May 2018, when storms flooded and ruined a decades-old steam sterilization plant that the institute had been using to treat wastewater from its labs. The damage halted research for months, until the institute developed a new decontamination system using chemicals. The new system required changes in certain procedures. During an inspection in June, the C.D.C. found that the new procedures were not being followed. Inspectors also found mechanical problems with the chemical-based decontamination system, as well as leaks. In 2009, research at the institute in Fort Detrick was suspended because it was storing pathogens not listed in its database.\n\nNote: Check out credible evidence that links the Fort Detrick lab shutdown with the start of the Coronavirus outbreak on this webpage. For more along these lines, see concise summaries of deeply revealing news articles on government corruption from reliable major media sources.\n\nBanks Pressure Health Care Firms to Raise Prices on Critical Drugs, Medical Supplies for Coronavirus\n\n2020-03-19, The Intercept\n\nPosted: 2020-03-30 02:11:47\n\nInvestment bankers have pressed health care companies on the front lines of fighting the novel coronavirus, including drug firms developing experimental treatments and medical supply firms, to consider ways that they can profit from the crisis. The largest voices in the health care industry stand to gain from billions of dollars in emergency spending on the pandemic, as do the bankers and investors who invest in health care companies. Over the past few weeks, investment bankers have been candid on investor calls and during health care conferences about the opportunity to raise drug prices. Executives joked about using the attention on Covid-19 to dodge public pressure on the opioid crisis. Health and Human Services Secretary Alex Azar previously served as president of the U.S. division of drug giant Eli Lilly and on the board of the Biotechnology Innovation Organization, a drug lobby group. During a congressional hearing ... Azar rejected the notion that any vaccine or treatment for Covid-19 should be set at an affordable price. “We can’t control that price because we need the private sector to invest,” said Azar. “The priority is to get vaccines and therapeutics. Price controls won’t get us there.” The initial $8.3 billion coronavirus spending bill passed in early March ... contained a provision that prevents the government from delaying the introduction of any new pharmaceutical to address the crisis over affordability concerns. The legislative text was shaped, according to reports, by industry lobbyists.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus pandemic and Big Pharma profiteering from reliable major media sources.\n\nIt's morally repulsive how corporations are exploiting this crisis. Workers will suffer\n\n2020-03-22, The Guardian (One of the UK's leading newspapers)\n\nPosted: 2020-03-30 02:09:49\n\nBefore the coronavirus virus crushed the US stock market, the Republican senator Richard Burr apparently used information he gleaned from his role as chairman of the Senate intelligence committee about the ferocity of the coming pandemic to unload 33 stocks held by him and his spouse. They were estimated at being worth between $628,033 and $1.72m. While publicly parroting Trump’s happy talk at the time, Burr confided to several of his political funders that the disease would be comparable to the deadly 1918 flu pandemic. When society faces a common threat, exploiting a special advantage is morally repugnant. Call it “Burring”. The coronavirus should have altered business as usual. But last week’s Senate Republican relief package, giving airlines $58bn and billions more to other industries, is pure Burring. Walmart, the largest employer in America, doesn’t give its employees paid sick leave. 88% of Walmart employees report sometimes coming to work when sick. None of the giants of the fast-food industry – McDonald’s, Burger King, Pizza Hut, Duncan Donuts, Wendy’s, Taco Bell, Subway – gives their workers paid sick leave, either. Amazon, one of the richest corporations in the world, which paid almost no taxes last year, is offering unpaid time off for workers who are sick. These corporations have made sure they and other companies with more than 500 employees are exempt from the requirement in the House coronavirus bill that employers provide paid sick leave.\n\nNote: Read a New York Times article for further information on how Senator Burr, the head of the US Senate Intelligence Committee, after being briefed of impending disaster, unloaded $1 million in investments while telling the public everything was fine. Read an article in The Atlantic showing how the Coronavirus is giving the world's leaders a rich opportunity for a power grab. For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus pandemic from reliable major media sources.\n\nThe man behind the sequencing of the coronavirus could have keys to the disease\n\n2020-03-22, San Francisco Chronicle (San Francisco's leading newspaper)\n\nPosted: 2020-03-30 02:07:19\n\nThe new NextSeq 550 sequencing machine at UCSF’s clinical lab on Berry Street looks like a microwave with a computer keyboard, but to microbiologist Charles Chiu, it is the key to California’s fight against the deadliest, most invasive virus to strike humanity in decades. The professor of medicine at UCSF will be using the black contraption ... to sequence the genomes of the viruses infecting hundreds of COVID-19 patients in the Bay Area during the next few weeks. Chiu ... is one of the top infectious disease specialists in the world. He has assembled an expert team of scientists ... to find critical clues about where the viral outbreaks in the Bay Area came from and how quickly the disease is spreading. He has already analyzed nine samples from the more than two dozen passengers who tested positive for the coronavirus on the Grand Princess cruise ship and is close to pinpointing the origin of those cases. “Those sequences belong in the same cluster as the infection in Washington state,” Chiu said. “They really suggest a link between Washington state and California.” Chiu said tracking the spread of the virus through genetics is possible because coronaviruses are known to have one to two mutations per month, allowing genomic sequencing to track a particular strain back to its origin. The rate of mutation in coronaviruses is much slower than it is with the influenza virus, which averages about eight to 10 mutations per month.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus pandemic from reliable major media sources.\n\nCoronavirus Advice: The Happiest People In The World Share 5 Ways To Be Happy\n\n2020-03-20, Forbes\n\nPosted: 2020-03-30 02:05:15\n\nToday, the UN issued its annual World Happiness Report, which ranks 156 countries around the world. For the third year in a row, Finland was named the happiest country in the world. So what makes the Finns so happy—and what can we learn from them during this time of global turmoil caused by an outbreak of coronavirus? The first thing to know is that 70% of Finland is covered by forest and the air is clean and serene. “Nature is our secret,” says [Heli] Jimenez. “We Finns like to put on a pair of rubber boots, head to the woods to slow down and calm our mind.” But even if you can’t get out of the house, you can replicate the experience at home and listen to the relaxing sounds of Finnish Lapland. Finns love swimming in the winter in a lake or the sea. The easiest way to do this at home is with a quick, ice-cold shower. Another hallmark of Finland is its rich art scene, which ranges from experimental artist-run initiatives to commercial galleries to flagship art institutions. The country is home to more than 55 art museums, and much of the art in the country is inspired by the Finns’ close relationship with nature. The Finns also use art to “calm the mind and transport their thoughts to stress-free, comforting places.” says Jimenez. Her advice: “Why not take a virtual trip from your own sofa to the Finnish museums to understand how art is a tool for happiness.” Take a virtual tour of the Ateneum, and you’ll be feeling the calm Finnish vibes in no time flat.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nLooking for something to do while quarantined? You can take Yale's most popular class ever for free online\n\n2020-03-20, CBS News\n\nPosted: 2020-03-30 02:02:13\n\nPeople around the world are learning to cope with quarantines in an attempt to stop the further spread of the new coronavirus. As city lockdowns force people to self-quarantine, everyone is searching for ways to keep busy — and Yale University has a solution. \"Psychology and the Good Life,\" a course first introduced by Professor Laurie Santos in spring 2018, teaches stressed-out students how to be happier. The university said it quickly became the most popular course in the school's 317-year history. Given its success, Yale decided to release the course online with the title, \"The Science of Well Being.\" It features lectures by Santos \"on things people think will make them happy but don't — and, more importantly, things that do bring lasting life satisfaction.\" Anyone with an internet connection can sign up for the class for free. The course involves a series of challenges \"designed to increase your own happiness and build more productive habits.\" The course is fully online and takes about 20 hours to complete. It includes videos, readings, quizzes and \"retirement\" activities to build happier habits. \"The Science of Well Being\" isn't the only course that could keep you busy during the coronavirus outbreak. Coursera offers other free courses from the nation's top schools, including \"Greek and Roman Mythology\" from the University of Pennsylvania, \"Imagining other Earths\" from Princeton, and \"Child Nutrition and Cooking\" from Stanford.\n\nNote: Don't miss the incredibly popular course (4.9 stars out of 5) offered free on this webpage. Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nSocial distancing is so hard because it’s contrary to human nature\n\n2020-03-17, Washington Post\n\nPosted: 2020-03-30 01:59:55\n\nAmid a novel coronavirus pandemic, some of us have defied public health officials’ exhortations and headed to bars to be with other members of our species. More of us have stared into the weeks to come and wondered how we will cope without basketball games, book groups, worship services, yoga classes and dinners with friends. Humans are social animals, even what some call “ultra-social.” For millennia, survival has depended on being part of a group. If distancing seems hard, it’s not just you: It’s human nature. “We are the most extreme example of a species that’s decided that collaborating with others is going to be my entire strategy,” said Steve Cole, a professor ... at the University of California. These social skills helped our ancestors fend off predators and more efficiently gather and hunt food and raise offspring. Our emotional dependence on each other can make keeping our distance, even for the public health benefit of “flattening the curve,” feel crummy. Most who are reducing physical contact, of course, are not locking themselves into isolation chambers. They’ve got a few relatives or friends around. Technology and social media ... should now be viewed as a lifeline. “People are going to feel isolated and lonely unless they make an effort to reach out to each other, so what we have to do is make sure that we call people on the phone and Skype with them and send them texts and emails, especially the people who are least proficient on the Internet,” [psychological anthropologist Alan] Fiske said.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nCovid-19 — Navigating the Uncharted - by Anthony Fauci, et al\n\n2020-03-26, New England Journal of Medicine - NEJM\n\nPosted: 2020-03-30 00:26:18\n\nThe latest threat to global health is the ongoing outbreak of the respiratory disease that was recently given the name Coronavirus Disease 2019 (Covid-19). The Covid-19 outbreak has posed critical challenges for the public health, research, and medical communities. In their Journal article, Li and colleagues provide a detailed clinical and epidemiologic description of the first 425 cases reported in the epicenter of the outbreak: the city of Wuhan in Hubei province, China. A degree of clarity is emerging from this report. The median age of the patients was 59 years, with higher morbidity and mortality among the elderly and among those with coexisting conditions (similar to the situation with influenza). Of note, there were no cases in children younger than 15 years of age. Li et al. report a mean interval of 9.1 to 12.5 days between the onset of illness and hospitalization. On the basis of a case definition requiring a diagnosis of pneumonia, the currently reported case fatality rate is approximately 2%. In another article in the Journal, Guan et al. report mortality of 1.4% among 1099 patients with laboratory-confirmed Covid-19; these patients had a wide spectrum of disease severity. If one assumes that the number of asymptomatic or minimally symptomatic cases is several times as high as the number of reported cases, the case fatality rate may be considerably less than 1%. This suggests that the overall clinical consequences of Covid-19 may ultimately be more akin to those of a severe seasonal influenza (which has a case fatality rate of approximately 0.1%) or a pandemic influenza (similar to those in 1957 and 1968) rather than a disease similar to SARS or MERS, which have had case fatality rates of 9 to 10% and 36%, respectively.\n\nNote: The main author of this article, Anthony S. Fauci, is the director of the U.S. National Institute of Allergy and Infectious Diseases. Consider the research of 12 other experts questioning the coronavirus panic. Explore also this excellent article which covers key, vitally important aspects of this pandemic that few have considered. For more along these lines, see concise summaries of deeply revealing news articles on coronavirus pandemic from reliable major media sources.\n\nA fiasco in the making? – By Stanford Professor of Medicine John Ioannidis\n\n2020-03-17, boston.com\n\nPosted: 2020-03-30 00:18:34\n\nThe current coronavirus disease [may] be a once-in-a-century evidence fiasco. At a time when everyone needs better information ... no countries have reliable data. This evidence fiasco creates tremendous uncertainty. Draconian countermeasures have been adopted in many countries. The data collected so far on how many people are infected and how the epidemic is evolving are utterly unreliable. Given the limited testing to date ... we don’t know if we are failing to capture infections by a factor of three or 300. Reported case fatality rates, like the official 3.4% rate from the [WHO], cause horror — and are meaningless. Patients who have been tested ... are disproportionately those with severe symptoms and bad outcomes. The Diamond Princess cruise ship [had a] case fatality rate [of] 1.0%, but this was a largely elderly population. Projecting the Diamond Princess mortality rate onto the age structure of the U.S. population, the death rate among people infected with Covid-19 would be 0.125%. But since this estimate is based on extremely thin data ... the real death rate could stretch from five times lower (0.025%) to five times higher (0.625%). A population-wide case fatality rate of 0.05% is lower than seasonal influenza. If that is the true rate, locking down the world with potentially tremendous social and financial consequences may be totally irrational. In the absence of data, prepare-for-the-worst reasoning leads to extreme measures of social distancing and lockdowns. Unfortunately, we do not know if these measures work. With lockdowns of months, if not years, life largely stops, short-term and long-term consequences are entirely unknown, and billions, not just millions, of lives may be eventually at stake.\n\nNote: John Ioannidis is professor of medicine, epidemiology and population health at Stanford University. To be truly informed, don't miss this entire, very well researched article at the link above. Consider also the research of 12 other experts questioning the coronavirus panic. For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus pandemic from reliable major media sources.\n\nIs the Coronavirus as Deadly as They Say? – Stanford Professors Speak Out\n\n2020-03-24, Wall Street Journal\n\nPosted: 2020-03-26 03:16:26\n\nFear of Covid-19 is based on its high estimated case fatality rate—2% to 4% ... according to the World Health Organization and others. We believe that estimate is deeply flawed. There’s little evidence to confirm that premise—and projections of the death toll could plausibly be orders of magnitude too high. The true fatality rate is the portion of those infected who die, not the deaths from identified positive cases. The latter rate is misleading because of selection bias in testing. The degree of bias ... could make the difference between an epidemic that kills 20,000 and one that kills two million [in the U.S.]. First, the test used to identify cases doesn’t catch people who were infected and recovered. Second, testing rates were woefully low for a long time and typically reserved for the severely ill. Together, these facts imply that the confirmed cases are likely orders of magnitude less than the true number of infections. Epidemiological modelers haven’t adequately adapted their estimates to account for these factors. This does not make Covid-19 a nonissue. The daily reports from Italy and across the U.S. show real struggles and overwhelmed health systems. But a 20,000- or 40,000-death epidemic is a far less severe problem than one that kills two million. Given the enormous consequences of decisions around Covid-19 response, getting clear data to guide decisions now is critical. We don’t know the true infection rate in the U.S. If we’re right about the limited scale of the epidemic, then measures focused on older populations and hospitals are sensible. A universal quarantine may not be worth the costs it imposes on the economy, community and individual mental and physical health.\n\nNote:Authors Dr. Bendavid and Dr. Bhattacharya are professors of medicine at Stanford. The Wall Street Journal charges non-subscribers to read more than the first two paragraphs of this article. You may find it well worth your time to read the entire article free on this webpage. Explore also this excellent article the covers key, vitally important aspects of this pandemic that few have considered. For more along these lines, see concise summaries of deeply revealing news articles on coronavirus pandemic from reliable major media sources.\n\nInside the Military's Top Secret Plans if Coronavirus Cripples the Government\n\n2020-03-18, Newsweek\n\nPosted: 2020-03-23 19:25:52\n\nEven as President Trump says he tested negative for coronavirus, the COVID-19 pandemic raises the fear that huge swaths of the executive branch or even Congress and the Supreme Court could also be disabled, forcing the implementation of \"continuity of government\" plans. Above-Top Secret contingency plans already exist for what the military is supposed to do if all the Constitutional successors are incapacitated. Standby orders were issued more than three weeks ago to ready these plans, not just to protect Washington but also to prepare for the possibility of some form of martial law. The various plans – codenamed Octagon, Freejack and Zodiac – are the underground laws to ensure government continuity. Under these extraordinary plans, \"devolution\" could circumvent the normal Constitutional provisions for government succession, and military commanders could be placed in control around America. Since Hurricane Katrina in 2006, no emergency has triggered any state to even request federal military aid under these procedures. Part of the reason, the senior officer involved in planning says, is that local police forces have themselves become more capable, acquiring military-grade equipment and training. And part of the reason is that the governors have worked together to strengthen the National Guard, which can enforce domestic law when it is mustered under state control.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus pandemic from reliable major media sources.\n\nFDA medical adviser: 'Congress is owned by pharma'\n\n2019-03-13, Yahoo! News\n\nPosted: 2020-03-23 19:23:36\n\nPharmaceutical companies are under the spotlight with congressional hearings on the cost of drug prices and allegations of the industry’s role in the opioid crisis. Dr. Raeford Brown, a pediatric anesthesia specialist ... and chair of the Food and Drug Administration (FDA) Committee on Analgesics and Anesthetics, has been openly critical of big pharma and the lack of proper oversight from the FDA. Despite many politicians, particularly declared presidential candidates, beginning to speak out against big pharma, Brown does not think that anything will come out of it “because Congress is owned by pharma.” “The pharmaceutical industry pours millions of dollars into the legislative branch every single year,” he [said]. “In 2016, they put $100 million into the elections. That’s a ton of money.” OpenSecrets, a website operated by the nonpartisan Center for Responsive Politics, tracks money in U.S. politics. It ranked the top 20 members of the House and the Senate that have received the most campaign contributions from the pharmaceutical and health products industry. Kevin McCarthy, now the House minority leader after midterms, received ... a total of $380,350 in campaign contributions, with a large sum coming from pharma companies. “Congress is supposed to have oversight for the FDA,” Brown said. “If the FDA isn’t going to hold pharma accountable, and Congress is getting paid to not hold pharma accountable, then it really doesn’t matter who the president is because it’s really about Congress.”\n\nNote: Learn more on how big Pharma controls politicians in this very well researched video. For more along these lines, see concise summaries of deeply revealing news articles on government corruption and Big Pharma profiteering from reliable major media sources.\n\nFlu Season That's Sickened 26 Million May Be at Its Peak\n\n2020-02-21, US News & World Report\n\nPosted: 2020-03-23 19:21:31\n\nIt's been overshadowed by the new coronavirus outbreak in China, but this year's flu season could be near its peak. At least 14,000 people have died and 250,000 have already been hospitalized during the 2019-2020 flu season, according to estimates from the U.S. Centers for Disease Control and Prevention. More than 26 million Americans have fallen ill with flu-like symptoms. \"There is a deadly respiratory virus that is circulating throughout the United States, and it is at its peak. It is not novel coronavirus,\" said Dr. Pritish Tosh, an infectious disease specialist with the Mayo Clinic. This flu season ... started early, in October, with an unusual wave of influenza B virus. Influenza B is less likely than other strains to mutate and become more virulent. That means it poses a greater threat to young people than to older folks, who may have gained immunity because they encountered the strain before. There have been 105 flu-related deaths among children this season, a higher total at this point of the year than any season in the past decade. Two-thirds of these deaths were associated with influenza B viruses, the CDC noted. More recently, a second wave of influenza A viruses featuring the H1N1 strain has hit the United States, Tosh noted. \"This has been an extended season, and we've certainly been seeing a lot of hospitalizations and bad outcomes from it,\" Tosh said. \"We will likely continue to see high influenza activity for several weeks. We are probably at its peak right now. I sure hope it doesn't get much worse.\"\n\nNote: The Centers for Disease Control and Prevention now estimates that between 390,000 and 710,000 hospitalizations and between 23,000 and 59,000 deaths have resulted from seasonal flu so far this season. That's between 150 and 300 deaths every day in the U.S. from the regular flu. For more along these lines, see concise summaries of deeply revealing news articles on health from reliable major media sources. Then explore the excellent, reliable resources provided in our Health Information Center.\n\nErik Prince Recruits Ex-Spies to Help Infiltrate Liberal Groups\n\n2020-03-07, New York Times\n\nPosted: 2020-03-23 19:18:36\n\nErik Prince, the security contractor with close ties to the Trump administration, has in recent years helped recruit former American and British spies for secretive intelligence-gathering operations that included infiltrating Democratic congressional campaigns, labor organizations and other groups considered hostile to the Trump agenda. One of the former spies, an ex-MI6 officer named Richard Seddon, helped run a 2017 operation to copy files and record conversations in a Michigan office of ... one of the largest teachers’ unions in the nation. The next year, the same undercover operative infiltrated the congressional campaign of Abigail Spanberger, then a former C.I.A. officer who went on to win an important House seat in Virginia as a Democrat. Both operations were run by Project Veritas, a conservative group that has gained attention using hidden cameras and microphones for sting operations. Mr. Prince, the former head of Blackwater Worldwide ... appears to have become interested in using former spies to train Project Veritas operatives in espionage tactics sometime during the 2016 presidential campaign. In 2017, he met with White House and Pentagon officials to pitch a plan to privatize the Afghan war. Mr. Prince invited Project Veritas operatives ... to his family’s Wyoming ranch for training in 2017. [They] shared social media photos of taking target practice with guns at the ranch, including one post ... saying that with the training, Project Veritas will be “the next great intelligence agency.”\n\nNote: Mr. Prince's Blackwater operation got caught systematically defrauding the government. Then Blackwater changed its name to Academi and made over $300 million off the Afghan drug trade. For more along these lines, see concise summaries of deeply revealing news articles on corporate corruption from reliable major media sources.\n\nFighting the Good Fight Against Online Child Sexual Abuse\n\n2019-12-23, New York Times\n\nPosted: 2020-03-23 19:16:44\n\nSeveral websites popular with sexual predators were thwarted last month after a determined campaign by groups dedicated to eliminating the content. It was a rare victory in an unending war. In late November, the moderator of three highly trafficked websites posted a message titled “R.I.P.” It offered a convoluted explanation for why they were left with no choice but to close. The unnamed moderator thanked over 100,000 “brothers” who had visited and contributed to the sites before their demise, blaming an “increasingly intolerant world” that did not allow children to “fully express themselves.” In fact, forums on the sites had been bastions of illegal content almost since their inception in 2012, containing child sexual abuse photos and videos, including violent and explicit imagery of infants and toddlers. In a world exploding with the imagery — 45 million photos and videos of child sexual abuse were reported last year alone — the open web is a freewheeling expanse where the underdog task of confronting the predators falls mainly to a few dozen nonprofits with small budgets. Several of those groups, including a child exploitation hotline in Canada, hunted the three sites across the internet for years but could never quite defeat them. But [a] Canadian hotline developed ... a sophisticated tool to find and report illegal imagery. The three sites were overwhelmed by the Canadian tool, which had sent more than 1 million notices of illegal content to the companies keeping them online. And last month, they were compelled to surrender.\n\nNote: Listen to a disturbing, yet vitally important New York Times podcast showing this huge problem that few are willing to look at. For more along these lines, see concise summaries of deeply revealing news articles on sexual abuse scandals from reliable major media sources.\n\nLoaded Gun Found Smuggled Into Jail Where Jeffrey Epstein Killed Himself\n\n2020-03-06, New York Times\n\nPosted: 2020-03-23 19:14:21\n\nFederal investigators on Thursday found a loaded gun that had been smuggled into the Manhattan jail where the financier Jeffrey Epstein hanged himself last summer while awaiting trial on sex-trafficking charges, officials said. The discovery of the gun at the jail, the Metropolitan Correctional Center, came amid a weeklong lockdown that began with a tip that a firearm might have been “introduced” into the building, according to a statement from the federal Bureau of Prisons. The gun was found in one of the jail’s housing units, the bureau said. The Metropolitan Correctional Center and other federal prisons across the United States have been dealing with rising levels of violence and other safety problems, including an influx of contraband. The problems have coincided with a push by the Trump administration, in its quest to shrink the federal government, to curtail prison hiring, according to a 2018 investigation by The New York Times. In at least one prison, The Times found, people regularly walked up to the double security fence in broad daylight, and, with no guards in sight, tossed weapons, drugs, cellphones and other items to inmates. But a gun is a rare and unique threat. The lockdown and ensuing search were part of the continuing fallout stemming from the suicide of Mr. Epstein in August. Lawyers for Mr. Epstein have challenged the New York City medical examiner’s finding that his death was a suicide.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on prison system corruption and Jeffrey Epstein from reliable major media sources.\n\nTrump calls for Sotomayor, Ginsburg to recuse themselves from 'Trump-related' cases as he has a lot at stake before the court\n\n2020-02-25, CNN News\n\nPosted: 2020-03-23 19:12:06\n\nPresident Donald Trump on Tuesday called for two liberal Supreme Court justices to recuse themselves from cases involving him following a scathing dissent issued by one of them, blasting the justices as the court considers a number of cases critical to his presidency. \"I just don't know how they can't recuse themselves for anything having to do with Trump or Trump-related,\" Trump said of Justices Sonia Sotomayor and Ruth Bader Ginsburg during a trip to India. \"Her statement was so inappropriate when you're a justice of the Supreme Court,\" he said of Sotomayor, who was appointed to the court by President Barack Obama. Sotomayor castigated the government for repeatedly asking justices on an emergency basis to allow controversial policies to go into effect and charged her conservative colleagues on the court with being too eager to side with the Trump administration on such requests. While Sotomayor's dissent targeted the federal government -- not The Trump administration per se -- she was speaking about the recent uptick in emergency petitions concerning many of the President's policies. And her criticism of her conservative colleagues was pointed. Sotomayor wrote that granting emergency applications often upends \"the normal appellate process\" while \"putting a thumb on the scale in favor of the party that won.\" Targeting her conservative colleagues, she said \"most troublingly, the court's recent behavior\" has benefited \"one litigant over all others.\"\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on judicial system corruption from reliable major media sources.\n\nZika Virus – Fear is the Key.\n\n2016-02-11, BMJ (formerly British Medical Journal)\n\nPosted: 2020-03-23 19:09:47\n\nI wonder how many of the readers remember the WHO’s pandemic alert on swine ‘flu some years ago? When the WHO was proactive to announce a pandemic then without any scientific justifications I was the one who wrote that that was a business stunt! People did not believe and the British Medical Journal rejected my paper. After one long year what I had predicted came true. Council of Europe Health Committee Chairman Dr. Wolfgang Wodarg said that the declaration of a swine flu pandemic was a false alarm. “There are many signs that there is close cooperation between the WHO and pharmaceutical companies. We have to find out whether there was pressure or whether there was money given as an incentive to the WHO to have this pandemic declared,” Dr. Wolfgang Wodarg adds. To give a simple example of the swine flu drug Tamiflu when given to a million people, 45,000 will experience vomiting, 31,000 will experience headache and 11,000 will have psychiatric side-effects. These figures might be insignificant if Tamiflu cures swine flu. That is not the case. Raising the fear levels in society is the surest way of depressing their immune system! This is good for business. With people’s immune system depressed they are prone to all kinds of infections. What follows next is the usual history. Greedy drug companies will now vie with each other to produce a vaccine. Vaccination is big business. This pattern goes on and on as long as money and medicine are related.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on Big Pharma corruption from reliable major media sources.\n\nPatents Secured for Revolutionary Nuclear Fusion Technology\n\n2020-02-24, Popular Mechanics\n\nPosted: 2020-03-23 19:07:32\n\nScientists in Australia are making some astonishing claims about a new nuclear reactor technology. Startup HB11, which spun out of the University of New South Wales, has applied for and received patents in the U.S., Japan, and China so far. The company's technology uses lasers to trigger a nuclear fusion reaction in hydrogen and boron—purportedly with no radioactive fuel required. The laser doesn’t heat the materials. Instead, it speeds up the hydrogen to the point where it (hopefully) collides with the boron to begin a reaction. “You could say we're using the hydrogen as a dart, and hoping to hit a boron, and if we hit one, we can start a fusion reaction,” managing director Warren McKenzie [said]. He says HB11's approach is “more precise” than designs that use heat to approach fusion because in those reactors, everything is heated in the hope that something will collide. When the lucky hydrogen does fuse with a boron particle, the reaction throws off helium atoms whose lack of electrons means they’re positively charged. It’s this charge that the device gathers as electricity. The overall idea was developed by UNSW emeritus professor Heinrich Hora. Hora’s design seeks to not just compete with, but replace entirely the extremely high-temperature current technologies to achieve fusion. These include fussy and volatile designs like the tokamak or stellarator, which can take months to get up to functionality and still spin out of working order in a matter of microseconds.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nSecond patient cured of HIV, say doctors\n\n2020-03-10, BBC News\n\nPosted: 2020-03-23 19:05:24\n\nA man from London has become the second person in the world to be cured of HIV, doctors say. Adam Castillejo is still free of the virus more than 30 months after stopping anti-retroviral therapy. He was not cured by the HIV drugs, however, but by a stem-cell treatment he received for a cancer he also had, the Lancet HIV journal reports. The donors of those stem cells have an uncommon gene that gives them, and now Mr Castillejo, protection against HIV. In 2011, Timothy Brown, the \"Berlin Patient\" became the first person reported as cured of HIV, three and half years after having similar treatment. Stem-cell transplants appear to stop the virus being able to replicate inside the body by replacing the patient's own immune cells with donor ones that resist HIV infection. Adam Castillejo - the now 40-year-old \"London Patient\" who has decided to go public with his identity - has no detectable active HIV infection in his blood, semen or tissues, his doctors say. It is now a year after they first announced he was clear of the virus and he still remains free of HIV. Lead researcher Prof Ravindra Kumar Gupta, from the University of Cambridge, told BBC News: \"This represents HIV cure with almost certainty. \"We have now had two and a half years with anti-retroviral-free remission. \"Our findings show that the success of stem-cell transplantation as a cure for HIV, first reported nine years ago in the Berlin Patient, can be replicated.\"\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nRats avoid harming other rats. The finding may help us understand sociopaths.\n\n2020-03-05, National Geographic\n\nPosted: 2020-03-23 19:03:56\n\nHumans and rodents have similar brain structures that regulate empathy, suggesting the behavior is deeply rooted in mammal evolution. Previous research has shown the much-maligned rodents assist comrades in need, as well as remember individual rats that have helped them—and return the favor. Now, a new study builds on this evidence of empathy, revealing that domestic rats will avoid harming other rats. In the study, published ... in the journal Current Biology, rats were trained to pull levers to get a tasty sugar pellet. If the lever delivered a mild shock to a neighbor, several of the rats stopped pulling that lever and switched to another. Harm aversion, as it's known, is a well-known human trait regulated by a part of the brain called the anterior cingulate cortex (ACC). Further experiments showed the ACC controls this behavior in rats, too. This is the first time scientists have found the ACC is necessary for harm aversion in a non-human species. The finding could have a real impact on people suffering from psychiatric disorders such as psychopathy and sociopathy, whose anterior cingulate cortexes are impaired. “We currently have no effective drugs to reduce violence in antisocial populations,” [study co-author Christian] Keysers says, and figuring out how to increase such patients’ aversion to hurting others could be a powerful tool. Whatever the motivation ... it’s fascinating that the impulse to avoid hurting others is at least 93 million years old, which is when humans and rats diverged on the evolutio", "images": ["https://www.paypalobjects.com/en_US/i/btn/btn_donate_LG.gif", "https://www.wanttoknow.info/m/images/header-mission.png", "https://www.wanttoknow.info/m/images/header-logo.png", "https://www.WantToKnow.info/images/news-magnify.jpg", "https://www.wanttoknow.info/images/rss.gif"], "top_img": "https://www.WantToKnow.info/images/news-magnify.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "News Stories", "meta_data": {"description": "News stories: Excerpts from highly revealing major media news stories suggest major cover-ups of health, energy, media, 9/11, war, elections, and more. Links to original stories provided for easy verification.", "keywords": "news,articles,9/11,911,elections,energy,inventions,financial,global,warming,government,health,mass,media,,information,polls,able,danger,avian,flu,corporate,corruption,dolphins,whales,hurricane,katrina,income,inequality,inspirational,microchips,mind,control,nature,reality,non-lethal,nonlethal,privacy,secrecy,secret,societies,terrorism,ufos,vaccines,war", "viewport": "width=device-width, initial-scale=1", "ROBOTS": "INDEX,FOLLOW", "Revisit-after": "21 days", "rating": "general", "google-site-verification": "93poa4ULbuO4k4m5pcOzlCUyZF-QR_CMpiv-eFUo8sw"}, "movies": [], "publish_date": null, "source": "https://www.wanttoknow.info", "summary": ""}