{"url": "https://www.independent.co.uk/news/people/tom-daley-father-dustin-lance-black-husband-baby-birth-lgbt-surrogate-robert-ray-a8424351.html", "text": "British diver Tom Daley and his husband Dustin Lance Black have become parents.\n\nThe celebrity couple revealed the birth of their son, Robert Ray, in a notice printed in The Times, the same newspaper in which they announced their 2015 engagement.\n\n\"On 27th June 2018 to Thomas Robert Daley and Dustin Lance Black, a son, Robert Ray,\" it read.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nThe couple had revealed they were expecting a child through a surrogate on Valentine's Day, and said they did not know who the biological father would be after fertilising \"half the eggs each\".\n\nThe three-time world champion diver has also said he wants to be as good a dad as his father, who was also called Robert and died in 2011.\n\nDaley spoke of how impending fatherhood changed his perspective as he competed at the Commonwealth Games on the Gold Coast in April.\n\nHe said: “It's been such a crazy experience. It changes your outlook on life.\n\n“Even on a plane. I'm never scared of flying - and as soon as there was any turbulence I was like 'oh my God', because there's more than my life I have to care about now.\n\n“It made me feel a bit more nervous. It changes your perspective on absolutely everything.\n\n“It's all filled with excitement, getting everything ready, feeling like you don't really know what's going to happen.\n\nShape Created with Sketch. UK news in pictures Show all 50 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. UK news in pictures 1/50 10 April 2020 Military personnel testing people at a coronavirus test centre in the car park of Chessington World of Adventures Reuters 2/50 9 April 2020 Posters drawn by children displayed in support of the NHS in a building near St Thomas' Hospital in London Getty 3/50 8 April 2020 A street cleaner in front of Coronavirus messaging on Picadilly Circus in London Getty 4/50 7 April 2020 A jogger on the Millennium Bridge in London, as the UK continues in lockdown to help curb the spread of the coronavirus PA 5/50 6 April 2020 A Royal Signals soldier practices during training held by the British Army. They are preparing them to support the Welsh Ambulance Service NHS Trust in the battle against coronavirus Ministry of Defence/Reuters 6/50 5 April 2020 A police officer advises a woman to go home after spotting her enjoying the sun in Primrose Hill, London AP 7/50 4 March 2020 New Leader of the Labour Party Keir Starmer speaks on the announcement of his victory in the leadership race of the Labour Party AFP via Getty 8/50 3 April 2020 Health Secretary Matt Hancock and NHS staff stand on marks on the ground, put in place to ensure social distancing guidelines are adhered to, at the opening of the NHS Nightingale Hospital at the ExCel centre in London, a temporary hospital with 4000 beds which has been set up for the treatment of Covid-19 patients. PA Photo. Picture date: Friday April 3, 2020. Split into more than 80 wards containing 42 beds each, the facility will be used to treat Covid-19 patients who have been transferred from other intensive care units across London. PA 9/50 2 April 2020 A child at Westlands Primary School paints a poster in support of the NHS in Newcastle-under-Lyme Reuters 10/50 1 April 2020 Staff wearing PPE of gloves and face masks, as a preactionary measure against Covid-19, disinfect an ambulance after it arrived with a patient at St Thomas' Hospital in north London AFP via Getty 11/50 31 March 2020 Llandudno Pier remains closed and deserted of tourists during the pandemic lockdown in Wales Getty 12/50 30 March 2020 Waves break against the pier at Tynemouth, on the North East coast PA 13/50 29 March 2020 Waves crash over a car on the seafront during windy conditions in Broadstairs, Kent PA 14/50 28 March 2020 Derbyshire Police dye the \"blue lagoon\" in Harpur Hill, Buxton black, as gatherings there are \"dangerous\" and are \"in contravention of the current instruction of the UK Government\" PA 15/50 27 March 2020 A road sign advising drivers to 'stay home protect NHS saves lives' is visible on the M80 near Banknock as the UK continues in lockdown to help curb the spread of the coronavirus PA 16/50 26 March 2020 A postman wears a mask and gloves to deliver letters in Broadstairs, Kent, after Prime Minister Boris Johnson has put the UK in lockdown to help curb the spread of the coronavirus. PA Photo. Picture date: Thursday March 26, 2020. The UK's coronavirus death toll reached 463 on Wednesday. PA 17/50 25 March 2020 Members of the public out exercising on Brighton beach at sunset Getty 18/50 24 March 2020 Military vehicles cross Westminster Bridge after members of the 101 Logistic Brigade delivered a consignment of medical masks to St Thomas' hospital Getty 19/50 23 March 2020 Commuters travel on the London underground during the Coronavirus pandemic Getty 20/50 22 March 2020 People walk on the seafront after recent incidents of members of the public ignoring government advice on social distancing on in Hove Getty 21/50 21 March 2020 A general view of an empty Trafalgar Square in London. There have as of now been 3,983 diagnosed coronavirus cases in the UK and 177 deaths Getty 22/50 20 March 2020 Swans swim on the banks of the River Severn in Worcester PA 23/50 19 March 2020 A piece of art by the artist, known as the Rebel Bear has appeared on a wall on Bank Street in Glasgow. The new addition to Glasgow's street art is capturing the global Coronavirus crisis. The piece features a woman and a man pulling back to give each other a kiss PA 24/50 18 March 2020 Students tend to Spring Lambs at Moreton Morrell College in Warwickshire PA 25/50 17 March 2020 Caerphilly Castle in South Wales joins Tourism Ireland's Global Greenings campaign to mark St Patrick's Day PA 26/50 16 March 2020 Shoppers form long queues ahead of the opening of a Costco wholesale store in Chingford Getty 27/50 15 March 2020 Players sing songs in the changing room after their game of football at Hackney Marshes in London Reuters 28/50 14 March 2020 Empty shelves in the laundry aisle of an Asda store in London PA 29/50 13 March 2020 Runners and riders compete in the JCB Triumph Hurdle during day four of the Cheltenham Festival at Cheltenham Racecourse. Thousands of people attended where Gold Cup day amid great uncertainty as sports events up and down the United Kingdom are postponed and cancelled due to the Coronavirus outbreak PA Images via Reuters Connect 30/50 12 March 2020 A worker makes her way along rows of daffodils, removing any rogue varieties, at Taylors Bulbs in Holbeach, Lincolnshire. The fourth generation family company plant over 35 million bulbs every year, and have held The Royal Warrant as Bulb Growers to Her Majesty The Queen since 1985 PA 31/50 11 March 2020 Chancellor of the Exchequer Rishi Sunak poses for pictures with the Budget Box outside 11 Downing Street ahead of Britain's first post-Brexit budget AFP/Getty 32/50 10 March 2020 A Tate Modern gallery assistant interacts with the 'Silver Clouds' installation, at a press view of major new Andy Warhol exhibition at Tate Modern, which features classic pop art pieces and works never shown before in the UK PA 33/50 9 March 2020 The Sub Dean and Canon Paster of Southwark, Canon Michael Rawson, left, blesses the statue of Santa Barbara and workers on one of the sites of the Thames Tideway Tunnel in London. Santa Barbara is the patron saint of tunnellers and by tradition a statue and shrine to her is placed at tunnel portals and the entrance to long tunnel headings to keep workers safe while underground. The 16 mile-long Thames Tideway Tunnel will prevent tens of millions of tonnes of sewage and rainwater run-off entering the river every year PA 34/50 8 March 2020 An Afghan Hound dog is prepared for show at the Birmingham National Exhibition Centre (NEC) during the final day of the Crufts Dog Show PA 35/50 7 March 2020 People taking part in the Million Women Rise march through central London, to demand an end to male violence against women and girls in all its forms PA 36/50 6 March 2020 Crew members take a selfie beside the cab of The Flying Scotswoman, the LNER Edinburgh to London rail service which has an all-female crew to celebrate International Women's Day, before it departs Edinburgh Waverley station PA 37/50 5 March 2020 A poodle arrives for the first day of Crufts 2020 in Birmingham Jason Skarratt/Flick.digital 38/50 4 March 2020 An Emergency Department Nurse during a demonstration of the Coronavirus pod and Covid-19 virus testing procedures set-up beside the Emergency Department of Antrim Area Hospital in Northern Ireland PA 39/50 3 March 2020 A pedestrian wears a protective facemask while taking a bus in Westminster, London, on the day that Health Secretary Matt Hancock said that the number of people diagnosed with coronavirus in the UK has risen to 51 PA 40/50 2 March 2020 An artist at Madame Tussauds in London fits the museum's waxwork of Prime Minister Boris Johnson with a baby carrier, following the recent announcement that he is expecting a baby with partner Carrie Symonds PA 41/50 1 March 2020 A man dressed as Dewi Sant leads the St David's day parade in Cardiff, where hundreds of people march through the city in celebration of the patron saint of Wales. Dewi Sant (Saint David in English) was the Welsh bishop of Mynyw (now St Davids) during the 6th century PA 42/50 29 February 2020 A home flooded after the River Aire burst its banks in East Cowick, East Yorkshire Getty 43/50 28 February 2020 Swedish climate activist Greta Thunberg takes part in a \"Youth Strike 4 Climate\" protest march in Bristol, south west England. \"Activism works, so I ask you to act,\" she said AFP/Getty 44/50 27 February 2020 Campaigners cheer outside the Royal Courts of Justice in London after they won a Court of Appeal challenge against controversial plans for a third runway at Heathrow PA 45/50 26 February 2020 Temporary barriers have been overwhelmed by flood water in Bewdley, Shropshire Getty 46/50 25 February 2020 Players take part in the Atherstone Ball Game in Warwickshire. The game honours a match played between Leicestershire and Warwickshire in 1199, when teams used a bag of gold as a ball, and which was won by Warwickshire PA 47/50 24 February 2020 A couple shelter from waves crashing over the promenade in Folkestone, Kent, as bad weather continues to cause problems across the country PA 48/50 23 February 2020 Viking re-enactors during the Jorvik Viking Festival in York, recognised as the largest event of its kind in Europe PA 49/50 22 February 2020 Former Greek Finance minister Yanis Varoufakis, fashion designer Vivienne Westwood and editor in chief of WikiLeaks Kristinn Hrafnsonn attend a protest against the extradition of Julian Assange outside the Australian High Commission in London Reuters 50/50 21 February 2020 A worker recovers stranded vehicles from flood water on the A761 in Paisley, Scotland Getty 1/50 10 April 2020 Military personnel testing people at a coronavirus test centre in the car park of Chessington World of Adventures Reuters 2/50 9 April 2020 Posters drawn by children displayed in support of the NHS in a building near St Thomas' Hospital in London Getty 3/50 8 April 2020 A street cleaner in front of Coronavirus messaging on Picadilly Circus in London Getty 4/50 7 April 2020 A jogger on the Millennium Bridge in London, as the UK continues in lockdown to help curb the spread of the coronavirus PA 5/50 6 April 2020 A Royal Signals soldier practices during training held by the British Army. They are preparing them to support the Welsh Ambulance Service NHS Trust in the battle against coronavirus Ministry of Defence/Reuters 6/50 5 April 2020 A police officer advises a woman to go home after spotting her enjoying the sun in Primrose Hill, London AP 7/50 4 March 2020 New Leader of the Labour Party Keir Starmer speaks on the announcement of his victory in the leadership race of the Labour Party AFP via Getty 8/50 3 April 2020 Health Secretary Matt Hancock and NHS staff stand on marks on the ground, put in place to ensure social distancing guidelines are adhered to, at the opening of the NHS Nightingale Hospital at the ExCel centre in London, a temporary hospital with 4000 beds which has been set up for the treatment of Covid-19 patients. PA Photo. Picture date: Friday April 3, 2020. Split into more than 80 wards containing 42 beds each, the facility will be used to treat Covid-19 patients who have been transferred from other intensive care units across London. PA 9/50 2 April 2020 A child at Westlands Primary School paints a poster in support of the NHS in Newcastle-under-Lyme Reuters 10/50 1 April 2020 Staff wearing PPE of gloves and face masks, as a preactionary measure against Covid-19, disinfect an ambulance after it arrived with a patient at St Thomas' Hospital in north London AFP via Getty 11/50 31 March 2020 Llandudno Pier remains closed and deserted of tourists during the pandemic lockdown in Wales Getty 12/50 30 March 2020 Waves break against the pier at Tynemouth, on the North East coast PA 13/50 29 March 2020 Waves crash over a car on the seafront during windy conditions in Broadstairs, Kent PA 14/50 28 March 2020 Derbyshire Police dye the \"blue lagoon\" in Harpur Hill, Buxton black, as gatherings there are \"dangerous\" and are \"in contravention of the current instruction of the UK Government\" PA 15/50 27 March 2020 A road sign advising drivers to 'stay home protect NHS saves lives' is visible on the M80 near Banknock as the UK continues in lockdown to help curb the spread of the coronavirus PA 16/50 26 March 2020 A postman wears a mask and gloves to deliver letters in Broadstairs, Kent, after Prime Minister Boris Johnson has put the UK in lockdown to help curb the spread of the coronavirus. PA Photo. Picture date: Thursday March 26, 2020. The UK's coronavirus death toll reached 463 on Wednesday. PA 17/50 25 March 2020 Members of the public out exercising on Brighton beach at sunset Getty 18/50 24 March 2020 Military vehicles cross Westminster Bridge after members of the 101 Logistic Brigade delivered a consignment of medical masks to St Thomas' hospital Getty 19/50 23 March 2020 Commuters travel on the London underground during the Coronavirus pandemic Getty 20/50 22 March 2020 People walk on the seafront after recent incidents of members of the public ignoring government advice on social distancing on in Hove Getty 21/50 21 March 2020 A general view of an empty Trafalgar Square in London. There have as of now been 3,983 diagnosed coronavirus cases in the UK and 177 deaths Getty 22/50 20 March 2020 Swans swim on the banks of the River Severn in Worcester PA 23/50 19 March 2020 A piece of art by the artist, known as the Rebel Bear has appeared on a wall on Bank Street in Glasgow. The new addition to Glasgow's street art is capturing the global Coronavirus crisis. The piece features a woman and a man pulling back to give each other a kiss PA 24/50 18 March 2020 Students tend to Spring Lambs at Moreton Morrell College in Warwickshire PA 25/50 17 March 2020 Caerphilly Castle in South Wales joins Tourism Ireland's Global Greenings campaign to mark St Patrick's Day PA 26/50 16 March 2020 Shoppers form long queues ahead of the opening of a Costco wholesale store in Chingford Getty 27/50 15 March 2020 Players sing songs in the changing room after their game of football at Hackney Marshes in London Reuters 28/50 14 March 2020 Empty shelves in the laundry aisle of an Asda store in London PA 29/50 13 March 2020 Runners and riders compete in the JCB Triumph Hurdle during day four of the Cheltenham Festival at Cheltenham Racecourse. Thousands of people attended where Gold Cup day amid great uncertainty as sports events up and down the United Kingdom are postponed and cancelled due to the Coronavirus outbreak PA Images via Reuters Connect 30/50 12 March 2020 A worker makes her way along rows of daffodils, removing any rogue varieties, at Taylors Bulbs in Holbeach, Lincolnshire. The fourth generation family company plant over 35 million bulbs every year, and have held The Royal Warrant as Bulb Growers to Her Majesty The Queen since 1985 PA 31/50 11 March 2020 Chancellor of the Exchequer Rishi Sunak poses for pictures with the Budget Box outside 11 Downing Street ahead of Britain's first post-Brexit budget AFP/Getty 32/50 10 March 2020 A Tate Modern gallery assistant interacts with the 'Silver Clouds' installation, at a press view of major new Andy Warhol exhibition at Tate Modern, which features classic pop art pieces and works never shown before in the UK PA 33/50 9 March 2020 The Sub Dean and Canon Paster of Southwark, Canon Michael Rawson, left, blesses the statue of Santa Barbara and workers on one of the sites of the Thames Tideway Tunnel in London. Santa Barbara is the patron saint of tunnellers and by tradition a statue and shrine to her is placed at tunnel portals and the entrance to long tunnel headings to keep workers safe while underground. The 16 mile-long Thames Tideway Tunnel will prevent tens of millions of tonnes of sewage and rainwater run-off entering the river every year PA 34/50 8 March 2020 An Afghan Hound dog is prepared for show at the Birmingham National Exhibition Centre (NEC) during the final day of the Crufts Dog Show PA 35/50 7 March 2020 People taking part in the Million Women Rise march through central London, to demand an end to male violence against women and girls in all its forms PA 36/50 6 March 2020 Crew members take a selfie beside the cab of The Flying Scotswoman, the LNER Edinburgh to London rail service which has an all-female crew to celebrate International Women's Day, before it departs Edinburgh Waverley station PA 37/50 5 March 2020 A poodle arrives for the first day of Crufts 2020 in Birmingham Jason Skarratt/Flick.digital 38/50 4 March 2020 An Emergency Department Nurse during a demonstration of the Coronavirus pod and Covid-19 virus testing procedures set-up beside the Emergency Department of Antrim Area Hospital in Northern Ireland PA 39/50 3 March 2020 A pedestrian wears a protective facemask while taking a bus in Westminster, London, on the day that Health Secretary Matt Hancock said that the number of people diagnosed with coronavirus in the UK has risen to 51 PA 40/50 2 March 2020 An artist at Madame Tussauds in London fits the museum's waxwork of Prime Minister Boris Johnson with a baby carrier, following the recent announcement that he is expecting a baby with partner Carrie Symonds PA 41/50 1 March 2020 A man dressed as Dewi Sant leads the St David's day parade in Cardiff, where hundreds of people march through the city in celebration of the patron saint of Wales. Dewi Sant (Saint David in English) was the Welsh bishop of Mynyw (now St Davids) during the 6th century PA 42/50 29 February 2020 A home flooded after the River Aire burst its banks in East Cowick, East Yorkshire Getty 43/50 28 February 2020 Swedish climate activist Greta Thunberg takes part in a \"Youth Strike 4 Climate\" protest march in Bristol, south west England. \"Activism works, so I ask you to act,\" she said AFP/Getty 44/50 27 February 2020 Campaigners cheer outside the Royal Courts of Justice in London after they won a Court of Appeal challenge against controversial plans for a third runway at Heathrow PA 45/50 26 February 2020 Temporary barriers have been overwhelmed by flood water in Bewdley, Shropshire Getty 46/50 25 February 2020 Players take part in the Atherstone Ball Game in Warwickshire. The game honours a match played between Leicestershire and Warwickshire in 1199, when teams used a bag of gold as a ball, and which was won by Warwickshire PA 47/50 24 February 2020 A couple shelter from waves crashing over the promenade in Folkestone, Kent, as bad weather continues to cause problems across the country PA 48/50 23 February 2020 Viking re-enactors during the Jorvik Viking Festival in York, recognised as the largest event of its kind in Europe PA 49/50 22 February 2020 Former Greek Finance minister Yanis Varoufakis, fashion designer Vivienne Westwood and editor in chief of WikiLeaks Kristinn Hrafnsonn attend a protest against the extradition of Julian Assange outside the Australian High Commission in London Reuters 50/50 21 February 2020 A worker recovers stranded vehicles from flood water on the A761 in Paisley, Scotland Getty\n\n“The fear of what might happen and the excitement. There's so many emotions that come with being an expectant father.”\n\nDaley and Black also announced their engagement in a similarly understated way in 2015, with an announcement reading: “The engagement is announced between Tom, the son of Robert and Debra Daley of Plymouth, and Lance, son of Jeff Bisch of Philadelphia and Anne Bisch of Lake Providence.”\n\nBlack, 44, is an American film director and producer. He won an Oscar for best original screenplay for Milk, a film based on the life of gay rights activist and politician Harvey Milk.\n\nAdditional reporting by Press Association.", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/02/14/14/tom-daley-dustin-lance-black.jpg", "https://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/02/14/14/tom-daley-dustin-lance-black.jpg", "keywords": [], "authors": ["Tom Embury-Dennis"], "canonical_link": "https://www.independent.co.uk/news/people/tom-daley-father-dustin-lance-black-husband-baby-birth-lgbt-surrogate-robert-ray-a8424351.html", "title": "Tom Daley and husband Dustin Lance Black release first photos of their baby boy", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "https://www.independent.co.uk/news/people/tom-daley-father-dustin-lance-black-husband-baby-birth-lgbt-surrogate-robert-ray-a8424351.html", "title": "Tom Daley and husband Dustin Lance Black release first photos of their baby boy", "description": "Couple revealed they were expecting child through surrogate", "updated_time": "2018-06-30T15:05:00+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/02/14/14/tom-daley-dustin-lance-black.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/8424351"}, "description": "British diver Tom Daley and his husband Dustin Lance Black have become parents. The celebrity couple revealed the birth of their son, Robert Ray, in a notice printed in The Times, the same newspaper in which they announced their 2015 engagement. \"On 27th June 2018 to Thomas Robert Daley and Dustin Lance Black, a son, Robert Ray,\" it read.", "keywords": "Tom Daley, Dustin Lance Black, People, News", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Tom Daley", "published_time": "2018-06-30T15:00:00+01:00", "modified_time": "2018-06-30T15:05:00+01:00", "section": "People", "author_name": "Tom Embury-Dennis", "content_type": "story", "word_count": 468, "image_count": 1, "video_count": 0, "embed_count": 0, "internal_link_count": 7, "external_link_count": 4}, "twitter": {"title": "Tom Daley and husband Dustin Lance Black release first photos of the…", "description": "British diver Tom Daley and his husband Dustin Lance Black have become parents. The celebrity couple revealed the birth of their son, Robert Ray, in a notice printed in The Times, the same newspaper", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1530367200.0, "source": "https://www.independent.co.uk", "summary": ""}