{"url": "en.wikipedia.org/wiki/Charlie_Murphy", "text": "For other people with the same name, see Charles Murphy\n\nAmerican actor\n\nCharles Quinton Murphy (July 12, 1959 – April 12, 2017) was an American actor, comedian, and writer. Murphy was best known as a writer and cast member of the Comedy Central sketch-comedy series Chappelle's Show, and as the co-star of the sitcom Black Jesus. He was the older brother of comedian Eddie Murphy.\n\nEarly life [ edit ]\n\nMurphy was born on July 12, 1959, in the New York City borough of Brooklyn.[3] His mother, Lillian, was a telephone operator, and his father, Charles Edward Murphy, was a transit police officer and an amateur actor and comedian who died in 1969.[4]\n\nAs an adolescent, Murphy spent 10 months in jail.[5] In 1978, on the day he was released from jail,[6] he enlisted in the United States Navy and served for six years as a boiler technician.[7]\n\nCareer [ edit ]\n\nMurphy had minor roles in several films in the late 1980s and early 1990s, and worked behind the scenes with the hip hop group K-9 Posse, a duo composed of his half-brother Vernon Lynch, Jr., and Wardell Mahone. On their 1988 self-titled debut, Murphy was credited as the album's executive producer as well as songwriter on the songs \"Somebody's Brother\" and \"Say Who Say What.\" [8] He also made an appearance in the video for the duo's first single \"This Beat Is Military.\" [9] Murphy's first major role in a motion picture was in the 1993 film CB4, in which he portrayed the antagonist Gusto.\n\nMurphy gained national attention as a recurring performer on Chappelle's Show, particularly in the Charlie Murphy's True Hollywood Stories sketches. In these, Murphy recounts his misadventures as part of his brother Eddie's entourage, including encounters with various celebrities such as Rick James and Prince.[10][11] After Chappelle's Show host Dave Chappelle left the show, Murphy and Donnell Rawlings hosted the \"lost episodes\" compiled from sketches produced before Chappelle's departure.\n\nIn 2005, he appeared in King's Ransom (alongside Anthony Anderson and Jay Mohr). In the film, Murphy portrayed \"Herb,\" a gay ex-con who is hired by King (Anderson) to kidnap him in a fake kidnapping.[12] Murphy has done voiceovers for Budweiser radio commercials, provided the voice for Iraq War veteran/criminal Ed Wuncler III on Cartoon Network's Adult Swim series The Boondocks, and the voice for a pimp named Jizzy-B in Rockstar Games' Grand Theft Auto: San Andreas video game. Murphy provided the voice for Spock on the G4TV's Star Trek 2.0 shorts, and the dog in his younger brother Eddie's 2007 film, Norbit.[13]\n\nOn March 20, 2009, his own sketch comedy series Charlie Murphy's Crash Comedy began on Crackle.[14] A stand-up special, Charlie Murphy: I Will Not Apologize premiered on Comedy Central in late February 2010.[15] Murphy also made special appearances in 1000 Ways to Die and the TBS sitcom Are We There Yet? as Frank Kingston. In 2014–15, Murphy played Vic on the Adult Swim live action show Black Jesus.[16]\n\nPersonal life and death [ edit ]\n\nMurphy was a resident of Tewksbury Township, New Jersey.[17] He was married to Tisha Taylor Murphy from 1997 until her death from cervical cancer in December 2009.[1] The couple had two children together, and Murphy had another child from a previous relationship.[1] He was a karate practitioner.[18][19]\n\nMurphy died from leukemia on April 12, 2017, at the age of 57.[20][21]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nVideo games [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/CharlieMurphyDec09.jpg/1200px-CharlieMurphyDec09.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/27/CharlieMurphyDec09.jpg/220px-CharlieMurphyDec09.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/CharlieMurphyDec09.jpg/1200px-CharlieMurphyDec09.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Charlie_Murphy", "title": "Charlie Murphy", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/CharlieMurphyDec09.jpg/1200px-CharlieMurphyDec09.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}