{"url": "https://web.archive.org/web/20130401023352/http://www.foxnews.com/on-air/fox-news-sunday-chris-wallace/2013/03/31/mark-kelly-whether-call-action-gun-control-fading-cardinal-donald-wuerl-new-pope", "text": "Written by Chris Wallace / Published March 31, 2013 / Fox News Sunday\n\nSpecial Guests: Capt. Mark Kelly, Cardinal Donald Wuerl\n\nThe following is a rush transcript of the March 31, 2013, edition of \"Fox News Sunday With Chris Wallace.\" This copy may not be in its final form and may be updated.\n\nCHRIS WALLACE, HOST: I'm Chris Wallace. The debate over gun control heats up.\n\n(BEGIN VIDEOTAPE)\n\nWALLACE: One hundred days after Newtown, Congress gets ready to vote on new measures to prevent mass shootings. But is the call to action starting to fade? We'll ask a leading voice in the debate, former astronaut Mark Kelly, husband of Gabrielle Giffords. It's a \"Fox News Sunday\" exclusive.\n\nThen, how will the new pope change the Catholic Church? As the world celebrates Easter, Pope Francis must shepherd the church out of scandal and confront challenges to Catholic doctrine. We'll talk with the archbishop of Washington, Cardinal Donald Wuerl.\n\nPlus, North Korea enters a state of war against South Korea. We'll ask our Sunday panel, have the fiery threats reached the danger point?\n\nAnd our Power Player of the Week -- the untold story of how a doctor saved the life of Ronald Reagan.\n\nAll, right now, on \"Fox News Sunday.\"\n\n(END VIDEOTAPE)\n\nWALLACE: Hello, again, and happy Easter from Fox News in Washington.\n\nWell, after months of debate, the Senate is finally ready to vote on new gun control legislation. One of the people at the center of the issue is Mark Kelly, retired astronaut and Navy captain, and the husband of former Congresswoman Gabrielle Giffords, who was shot two years ago.\n\nCaptain Kelly joins us from Tucson, Arizona.\n\nCaptain, after Newtown, there was national outrage over these acts of mass violence, but that has begun to change. CBS has a new poll, just after the massacre, 57 percent supported stricter gun controls. Now, that's down to 47 percent.\n\nAnd, Senate Majority Leader Harry Reid says the bill he'll introduce the week after next won't include a ban on assault weapons and won't include a limit on high capacity magazines.\n\nQuestion -- should President Obama have moved faster to bring it to a vote before the call for action began to fade?\n\nCAPTAIN MARK KELLY, (RET.) U.S. NAVY: Well, I think, after something like, you know, 20 first graders being murdered in their classrooms, you know, it is important to take action. And the American people are demanding action now. You know, the timeline of that, you know, sometimes, especially with a polarized Congress, these things can take a long time.\n\nBut, it's clear -- and you say that, you know, there is less support and I want to address that for a second. When you use words like gun control, you know, gun control doesn't poll very well, but we do know that over 90 percent of Americans support a universal background check. And, there is incredible momentum in Congress and around the nation to get this done.\n\nWALLACE: Well, you say incredible momentum. Five Republican senators say that they are going to filibuster any additional gun restrictions. We have them up on the screen.\n\nWhat do you say, for instance, to Marco Rubio and Rand Paul?\n\nKELLY: Well, first, I would say to Marco Rubio that 94 percent of his constituents support a universal background check.\n\nFor Senator Rand Paul, it's about 83 percent, in Kentucky. So, they should listen to their constituents and, certainly, shouldn't be getting in the way of the process, which is to debate the bill and to vote on the bill. I mean, that doesn't make any sense.\n\nAnd, I imagine that at some point, if they actually do this, that their constituents will hold them accountable for those actions.\n\nWALLACE: Why do you think there is, in polls -- I mean, there are a couple of things going on here. One, we see in the polls, diminishing support. Two, we see Harry Reid, who is, you know, the Senate majority leader, and he's not even going to include the high capacity magazines or the assault weapons ban in the bill. They'll be a vote of amendments, but they're not part of the bill. He says in the assault weapons ban, it wouldn't get 40 votes, let alone 60.\n\nWhat's going on?\n\nKELLY: Well, certainly, you know, in this country we have a very powerful gun lobby and the leadership of the NRA has done a very good job over many, many years of controlling the debate on this issue. But, one thing that is different now, is the fact that we had 20 first graders murdered in a classroom, along with six educators. I mean, that's unacceptable.\n\nAnd the American people, you know, want something done on this. You know, 92 percent of Americans support a universal background check. It's 74 percent of NRA members.\n\nI would hope at some point that the leadership of the NRA would just listen to their membership on this issue.\n\nWALLACE: We're going to get to the background check in a second. One last question about the Senate, because Republicans say they are going to offer an alternative bill that would crack down on gun trafficking and would beef up school safety. It would not include the background check or an assault weapons ban.\n\nWhat do you think of what's called the \"Grassley alternative\"?\n\nKELLY: Well, you know, I think it is a mistake. Any bill that does not include a universal background check is a mistake. It's the most common-sense thing that we can do to prevent criminals and the mentally ill from having access to weapons.\n\nI mean, the system we have right now, we have 40 percent of all Americans who buy a gun, buy it without a background check and that's probably where most of the criminals and the mentally ill are going. I mean, we know from a poll that has been done with criminals in prison, that over 80 percent of them get them through that loophole.\n\nSo, it would be a mistake not to address the thing that 92 percent of American households support and 74 percent of NRA members support, which is the universal background check.\n\nWALLACE: All right. Well, let's pick up on that, because the main feature of what is going to be in the Senate bill and what you are pushing and pushing today is the universal background check. This week, you went -- or rather, recently, a few weeks ago, you went to a gun store in the Arizona area, and bought a .45 caliber hand gun and afterwards discussed the background check you had to go through with your wife, Gabby.\n\nLet's take a look.\n\n(BEGIN VIDEO CLIP)\n\nKELLY: It was very easy to do. It took just like five minutes.\n\nFORMER REP. GABBY GIFFORDS, D-ARIZ.: Yes. Five minutes.\n\nKELLY: You know, that's all we have to do to make sure everybody has to get a background check before buying a gun, to make sure that criminals and the mentally ill can't get one.\n\nGIFFORDS: Universal background check.\n\nKELLY: Yes.\n\n(END VIDEO CLIP)\n\nWALLACE: Captain Kelly, what do you think that showed?\n\nKELLY: Well, you know, we went in there, my executive director (inaudible), the executive of our organization, and in five minutes and 36 seconds is the time it took to fill out one piece of paper. You only have to fill out one side for it to be submitted to the National Instant Criminal Background Check System and get an answer. Five minutes and 36 seconds.\n\nSo, what it shows you is that it is not the burden that the NRA leadership says, what a background check is. I mean, it's s a simple, common sense thing we can do to make sure criminals and the mentally ill can't have access to firearms.\n\nWALLACE: Well, let's talk about that, because, in Gabby's tragic case, the shooter, Jared Loughner, had been suspended from college, because he was deemed to be a threat to himself and to others. He went to a gun store, he got a gun, passed a background check. And, yet was able to go out and shoot Gabby and 18 other people.\n\nAnd, the NRA says the problem with the background check is that -- the kind of mental health information, for instance in Loughner's case, doesn't get passed on. So, it doesn't get to be part of the background check.\n\nKELLY: Well, it doesn't get passed on in a lot of cases. You know, you know, 19 states have included less than 100 records on mental illness into the NICS, into the National Instant Criminal Background Check System. In the case of the shooter in Tucson, the information on his mental illness, that caused him to get expelled from community college, that should have been in the system. His admitted drug use to the U.S. Army, who rejected him, that should have been in the system.\n\nSo he should have -- if we had, you know, a system -- if we improved the system, he would have been rejected from buying the gun in the gun store. Now, the other problem is, there's the other loophole, right? There's the records loophole, but there is the loophole that would allow him to go to a gun show, or on the Internet to buy a gun.\n\nAnd we need to prevent criminals and the mentally ill from doing that. It's crazy that we have a system -- you know, we have a system that responsible gun owners get a background check, and the option to avoid one is available for anybody who doesn't want to do it. I mean, it's a -- it's a crazy system.\n\nWALLACE: But doesn't the NRA have a point: if you're going to expand the background check and cover more people, don't you have to make sure the mental health information gets into the system, because otherwise it's kind of a waste of time?\n\nKELLY: They absolutely have a point. I mean, they are -- they are right on that issue.\n\nI mean, we need to encourage states to include the mental health records. After Virginia Tech, for instance, Virginia was one of the worst states on this. And after what happened in Virginia Tech, they're actually really, really good about getting those records to the federal government.\n\nSo I'm encouraging -- I mean, I would love to be able to work with the leadership of the NRA and work with the United States Senate and the House to make sure we get those records in the system and then close the gun show and private seller loophole, like 92 percent of Americans want, like 74 percent of NRA members want.\n\nWALLACE: The big hold-up in the Senate now over the background check is that if you do expand it to include gun shows and private sales, do the people who sell the guns in those cases have to keep private records? Keep records of those sales? And as you well know, the NRA says the danger is that if they have to do what licensed dealers have to do and keep those records, that could be used to form a national registry and somewhere down the line, that could be used to confiscate people's guns.\n\nHow do you respond to that?\n\nKELLY: Well, I just don't think it's logical. I mean, right now, when you buy a gun in a gun store like I did, you know, there is a record that remains with the gun store. It's not a record with the federal government. It is not a record that is going to one day lead to a national registry, or gun confiscation.\n\nSo the system currently works with the federally licensed firearms dealers. There is no reason that same system cannot work with the gun show, and the private seller. But, of course, this is an issue for many, you know, some Republican senators. And it's certainly something that could be worked on. I mean, we've got a lot of smart members in the Senate and I think they can figure out a compromise on this issue.\n\nWALLACE: Finally, Arizona officials this week released a lot of records about the shooter, Jared Loughner, the man who shot Gabby and 18 others. His parents, it turns out, knew he was deeply disturbed. They tested him for drugs, but they did not send him to get help.\n\nWhat do you have to say after learning all of this to Jared Loughner's parents?\n\nKELLY: Well, certainly as a parent, myself, I understand. I mean, it is a tragic thing they went through as well. It would have been an entirely different situation, however, if he would have gotten some mental health -- you know, gotten an evaluation. And when he -- you know, certainly in his case, when he's taking medication, he's not as psychotic as without the medication.\n\nSo, this would have clearly been -- would not have happened if he would have had proper mental health treatment, you know? But you can't -- you know, you can't go back in time. I mean, there's -- you know, the only thing we can do is move forward and try to make sure that the dangerously mentally ill are not only getting treatment for their mental illness, but let's make sure they don't have access to guns. Let's make sure criminals don't have access to guns.\n\nI mean, our organization, Americans for Responsible Solutions -- I mean, we are really focused on this, every, single day. To make sure we fix this problem, and we address gun violence in this country.\n\nWALLACE: I just want to pick up on that last point, because after Newtown, there was a lot of talk about making it easier for authorities, a school or a family to commit a Jared Loughner, an Adam Lanza, the Newtown shooter before they got access to guns and acted out in this horrible way. But, that seems to have been forgotten in all of the debate about gun control.\n\nKELLY: Well, I don't know if it has been forgotten. I mean, certainly, you know, the debate in the Senate is going to -- going to include some aspect of help for the mentally ill. Now, what that is, you know, I'm not -- you know, I don't know what those details -- how that's going to turn out but that is certainly an important component of this. I mean, to address mental illness in this country, to get those records of mental illness into the system and then to make sure that there isn't a loophole where the clearly dangerously and mentally ill and criminals can get access to a gun.\n\nWALLACE: Captain Kelly, we want to thank you. Thank you for joining us. And we want to wish you and your wife, Gabby, the very best, sir.\n\nKELLY: Thank you, and, happy Easter, Chris.\n\nWALLACE: Happy Easter to you.\n\nUp next on this Easter Sunday, we'll discuss the new pope and the challenges he faces as we talk with one of the men who elected him, Washington's cardinal, Donald Wuerl.\n\n(COMMERCIAL BREAK)\n\nWALLACE: Today at the Vatican, Pope Francis celebrated his first Easter mass as leader of the world's 1 billion Catholics. In the traditional Easter message, the pope called for a political solution to the civil war in Syria, as well as peace on the Korean peninsula.\n\nAs his papacy begins, Francis has set a humble tone in contrast to the corruption and scandal in some parts of the church. But, how much does the new pope intend to shake things up?\n\nEarlier, I asked the archbishop of Washington, Cardinal Donald Wuerl, what he thinks Pope Francis will do.\n\n(BEGIN VIDEOTAPE)\n\nWALLACE: Your Eminence, happy Easter and welcome back to \"Fox News Sunday.\"\n\nCARDINAL DONALD WUERL, ARCHBISHOP OF WASHINGTON: Thank you. It's great to be back.\n\nWALLACE: From the moment he took the world stage, Pope Francis talked about serving the poorest, the weakest, the least important. On Holy Thursday, he followed the tradition of washing the feet of 12 people. But instead of 12 priests as other popes have done, he washed and kissed the feet of a dozen young inmates, including women and Muslims.\n\nQuestion -- what message is the pope sending about what he is going to do?\n\nWUERL: I think his message is a very clear one, that you bear witness with words, but you also bear witness with actions. And I think what he is trying to say to all of us is, if we really are trying to introduce people to the gospel, if we are really trying to tell believers how important the gospel is, can't you do that as well, maybe even better, with actions as well as words. I think that's what he's trying to do.\n\nWALLACE: There is a widespread sense that the church has problems, governance problems. That there is corruption inside the church, that there are turf wars. One of the first things the pope has to deal with is that secret investigative report about the Vatican leaks.\n\nWhy did the cardinals believe that Pope Francis was the right man to clean things up?\n\nWUERL: I think there are probably a couple of ideas that were going around as we were talking about who might be the next pope, who would be the best person to choose. One, when we talk about the church, we also want to make sure that we distinguish it from just the operation of the Vatican. I think we were concerned about who will keep the momentum of the new evangelization going and who will keep this energy the church is seeing among many of our young people around the world. Who will keep that going?\n\nAt the same time, somebody has to address the administration of the Holy See. Somebody has to take a look at what is working and what isn't working. I can't tell you what that means, because we didn't have the report. But the very fact that we recognize there needs to be some change, that was a part of the thinking.\n\nCan you -- can you envision someone better than Pope Francis? The credibility he brings to whatever he decides, in the Vatican, is going to be enormous. But, in the meantime, he is keeping the focus on the rest of the church, where there is an awful lot of good going on.\n\nWALLACE: But on the inside game, how aggressive a reformer, how revolutionary, if you will, do you expect Pope Francis to be -- not on doctrine -- but on changing the way the church does business?\n\nWUERL: Well, perhaps we're seeing signs of it in the fact that he hasn't moved in to the papal residence, that he's chosen to stay in the residence where we all were for the conclave. Maybe he's simply saying, there are going to be a lot of changes, we're going to get back to something that will be a little more direct, and maybe contact with the pope will be a little easier.\n\nAnd that was one of the things that we cardinals talked about -- the need to find ways in which there is a lot more communication between the rest of the church and the pope.\n\nWALLACE: All right. You were there. We saw all of the pictures. Take us inside. This is your first conclave. Take us inside the Sistine Chapel. They closed the doors, the 115 cardinal electors are all there and you are choosing the head of church, for 1.2 billion, 1.3 billion Catholics.\n\nWhat is that moment like?\n\nWUERL: There is a solemnness that I really wasn't prepared to experience as fully. When you hear that door closing, you hear it, and the -- that bolt is locked, then you realize, this is really a liturgy. We're all -- we're all wearing what we would wear if we were presiding at a mass, somewhere. Not as the celebrant but simply as a cardinal.\n\nThis absolute silence -- and the one thing you are supposed to be doing is listening with your heart. Before I went in, I talked to one of the older cardinals, he's 90 years old. He came to one of those general meetings, just so we could chat. I have known him for 40 years.\n\nAnd I said to him, \"Cardinal, I am feeling a little bit overwhelmed by all of this.\" He said, \"When you get into the Sistine Chapel and they close that door, just listen with your heart. And you'll hear.\"\n\nAnd it turned out to be true. There is a solemn oath you take, and, then, Chris, when the moment comes to write a name on the ballot. There is nobody there but you and, I like to think, the Holy Spirit, guiding that pen.\n\nWALLACE: I'm fascinated. There were five ballots. Obviously, the fifth ballot you chose the pope. After a ballot, and they tell you, so-and-so, Bergoglio, Pope Francis has so many votes. Do you mill about and talk and --\n\nWUERL: No. This is the interesting thing. They count the ballots and that in itself is rather solemn. Three people look at each ballot, and go through the whole thing, so -- once it's clear no one was elected, nothing is said.\n\nThere is this moment, quiet, and then, you just write another name on the next ballot. It is as if the Holy Spirit is saying, look, now you know the direction, OK. You're going to have to -- you're going to have to whittle this down.\n\nThis is the power of the part, though, Chris, you have your ballot in your hand and you have to stand there in front of that fresco of the last judgment, and say, \"I call on Christ the Lord, who will come to judge me that this ballot is for the person I believe should serve and lead the church.\" And it's really powerful.\n\nBut, there is no milling about. There is no discussion. There -- it's altogether different than anything that you and I have experienced in our life here, politically. There are no nominations, no candidates. It's all open to the action of the spirit.\n\nWALLACE: Not exactly like pulling the lever on election day.\n\nThe big story in Washington, this week, as you well know has been the Supreme Court's consideration of the issue of same sex marriage. If the court finds that there is a constitutional right, what will you say to gays, who are good Catholics, attend church every week, who say, who believe that God made them that way, and who want to commit to a partner?\n\nWUERL: We are always welcoming of everyone. The Catholic Church welcomes everyone.\n\nBut, the Catholic Church also reminds all of us, there is a moral law. There are commandments of God, and we have to do our best to live by them. We announce that from the pulpit and, we try to meet people where they are and walk with them in life's journey.\n\nThe church is probably, with 20 centuries of experience, probably the most understanding of the human condition of any institution. But, at the same time it does remind, not only gay people, but heterosexual people, straight people, you're not supposed to be following a moral law apart from what Christ has said to us.\n\nWe do that all the time --\n\nWALLACE: So, specifically, what do you say, what would you say to the good, gay Catholic?\n\nWUERL: I think we try to work with them, whatever situation they find themselves in. The goal is to hold them as close to the church and to Christ and the sacraments as possible. A lot depends on how well we're able to communicate, how well we're able in a pastoral situation to look at each person's life and see where we are.\n\nWALLACE: So, you would allow him to continue in the church but you would not recognize his marriage?\n\nWUERL: We do that with people who are married, divorced and remarried. We say you are still part of the family, but we can't recognize that second marriage. We do that, we've done that -- and it has never been a great problem.\n\nIt's painful for all of us to have to realize that making our way through life is difficult and, that we can't always be as perfect as away would like to be. I look to the church to say to me, look, walk as close to Christ as you can. That's why we are here. Come to mass. Participate in the life of the church.\n\nWALLACE: I want to ask you about the legal situation. Canada legalized same sex marriage in 2005 and there have been legal problems. There was a case of a Knights of Columbus hall that had agreed to hold a reception for a married couple, until they found out that it was a same sex couple and they had to pay a fine.\n\nAnd there are questions, about a Catholic university that has housing for married couples, what are they going to do if it's a same sex couple. How is the church and the -- writ large, not just the church but the whole religious institution, how is it going to deal with that and doesn't it get a little bit to the issue you have with the administration, about the mandate of insurance policies, including birth control?\n\nWUERL: Shouldn't there be enough space in a society as pluralistic and free as America is to be able to work all of these things out in a way that everybody can be who they are, and carry on their activities?\n\nI'm thinking for example when we talk about changing the definition of marriage. There is going to have to be a lot of adjusting, because the whole world has always understood marriage is the word you use to describe when a man and a woman commit to each other for the rest of their lives, and generate and educate children. Once you change that arbitrarily, there is going to be downstream from that, all kinds of questions. We're going to have to deal with them one by one as we come to them and that's why the church keeps saying, make room for everyone's faith.\n\nThe only thing I worry about is someone saying to see, you, because you believe that sex is intended for marriage, and because you believe that marriage is undissolvable and because you believe that marriage is between a man and a woman, that somehow you don't belong here, that somehow this is -- this is bigotry or this is hate speech. That's what I worry about.\n\nThere has to be room enough in the society as large, as free and as pluralistic as America, to make space for all of us.\n\nWALLACE: Finally, for all of the controversies, this is Easter which has a very joyous meaning. What is your message, your Easter message, for our viewers.\n\nWUERL: The Easter message for every Christian is Christ is risen and that's we say, hallelujah, come to mass. But for the rest of the world, Easter is also a reminder of hope. There is always hope, individually, collectively, societally, we should never give up hope that we can make things better. That's the story of Easter.\n\nFor the believer, it's hallelujah. For everyone else, it should be -- there is hope, there is a possibility to make it a better world.\n\nWALLACE: And it's a beautiful spring and flowers are blooming, and all is right with the world.\n\nCardinal, Thank you so much.\n\nWUERL: You are very welcome. Thank you, Chris.\n\n(END VIDEOTAPE)\n\nWALLACE: The archbishop of Washington, Cardinal Donald Wuerl.\n\nUp next, a threat to peace in the Pacific. We'll ask our Sunday group how serious is North Korea's drumbeat of war?\n\n(COMMERCIAL BREAK)\n\n(BEGIN VIDEO CLIP)\n\nCHUCK HAGEL, DEFENSE SECRETARY: ... their very provocative actions. And belligerent tone. It has ratcheted up the danger.\n\n(END VIDEO CLIP)\n\nWALLACE: Defense Secretary Chuck Hagel responding to North Korea's threat of war against the U.S. and South Korea. And, it is time now for our Sunday group. Bill Kristol of \"The Weekly Standard.\" Mara Liasson of National Public Radio. Republican strategist Ed Gillespie and Charles Lane of \"The Washington Post.\" Well, Kim Jong- un, the young leader of North Korea, was quoted Friday as ordering his missile units to be ready to strike the U.S. and South Korea, and this photo was released. Kim meeting with top North Korean generals with a chart showing the trajectory of their missiles, hitting major American cities. Bill, what is Kim's game?\n\nBILL KRISTOL, THE WEEKLY STANDARD: Who knows, but it's not good. I mean, they've murdered, starved millions of their own people, that regime, and now -- and they proliferated nuclear weapons. And don't forget, the Israeli strike on the Syrian nuclear weapons plant in 2007, that was given to them by North Korea. So, even if you discount North Korea, oh, they are containable, they are not going to destroy their regime by attacking us, they can proliferate weapons of mass destruction, they can proliferate nuclear weapons and missiles and guess what? Iran and North Korea have this dark relationship and North Korea is short of cash, it could sell these weapons to terrorist groups. So, the threat of North Korea is very real.\n\nWALLACE: And why do you think they are ratcheting up - he is ratcheting up the tension?\n\nKRISTOL: Well, the normal explanation is that it helps stabilize and, you know, helps secure his situation at home -- maybe that is true. But the degree to which, you know, they've created -- he might think he's being playing two games, like his father and his grandfather did, I guess, and, you know, they can pull back at the key moment. But, you know, South Korea and Japan are sitting there, nervous -- he killed South Koreans just about two years ago, three years ago, they killed, what, 45 South Korean sailors, attacked their ship. I mean, Japan, they lobbed a missile over Japan. It's dangerous.\n\nWALLACE: Yeah, let me pick up on that, Mara. Because the North Koreans traditionally, as Bill points out like to bluster and saber- rattle, but even by their standards, this is pretty extreme what is going on now, and that is the concern, that somehow particularly with South Korean, if you've ever been in Seoul, I mean it is an hour's drive from the DMZ. I mean they would be right on the front line. The danger is it gets out of hand.\n\nMARA LIASSON, NATIONAL PUBLIC RADIO: The danger is it gets out of hand. And that crazy map behind Kim Jong-un, which showed the lines of the missiles hitting the mainland of the United States and exposing their, quote, battle plans, that might be a fantasy, but they can do tremendous damage to South Korea, and he's announced also that the armistice doesn't hold anymore. They are back in a state of war. Nobody knows exactly what he wants to do. I don't even know if he knows what he wants to do, but yes, it is a really dangerous situation, and I don't think the United States has a clear idea of what to do to stop him.\n\nWALLACE: Well, let's talk, Ed, about the U.S. response. Because first, Chuck Hagel, the defense secretary announced that we are beefing up our missile defense along the border with Alaska and then this week -- in Alaska, again, along the border with Russia, and, then, this week we sent, as you can see there -- a pair of B-2 stealth bombers capable of carrying nuclear weapons, all the way from Missouri to military exercises over South Korea. Ed, sensible reaction by the Pentagon or over-reaction?\n\nED GILLESPIE, FMR. ROMNEY CAMPAIGN SENIOR ADVISER: No, I think it's a sensible reaction. And I think in addition to that, it would be good for the administration to not only bolster our own missile defense, but to support Japan and South Korea with missile defense. I think, to Bill's point, they are nervous, understandably, and I think doing anything -- everything we can to reassure them would be helpful, and, obviously, you know, trying to get China to engage in their own region in a way that would be helpful, I think, with Kim Jong-un would be important, too.\n\nWALLACE: I'm going to pick up on China in a second. Your thoughts, though, Chuck about the U.S. response. What we have done so far, what more we can do?\n\nCHARLES LANE, THE WASHINGTON POST: Well, I think President Obama's approach to North Korea throughout his presidency has been, essentially, not to rise to the bait, and I think that has been a good approach so far. I think sending the B-2s sent a strong signal.\n\nI think what we are dealing with here is sort of the third generation of a family business over there in North Korea, and the business is building up this whole military structure, building up as Bill suggests, the capability to proliferate. Conducting terrorist activities. People forget that years ago they blew up a whole group of South Korean diplomats in Burma of all places. And the purpose of the family business is through the constant threat, constant belligerence, constant menace, to extract money, concessions, and everything else you can get by blackmailing the other side. Whether the endgame of the family business is to actually go to war in South Korea, I doubt, because I think people are -- need to remember, North Korea would not win that war. At the very least would come out of it very badly damaged. So, I think what we are seeing here is a generation of war hysteria to help control themselves inside and the generation of threats, especially towards this new, more conservative, less concession-minded government in South Korea to see what they can extract. As they have now for 20 years since this nuclear issue began.\n\nWALLACE: You know, one of the concerns here, and that does seem to be different, Bill, is that North Korea seems to be ignoring the warnings from its main, far and away biggest sponsor, China, which had warned the regime and Kim Jong-un not to make these threats against the United States, not to make these threats against South Korea, and yet it proceeded with them. Why would Kim risk alienating the country that literally, you know -- talk about biting the hand that feeds you, that literally feeds its people?\n\nKRISTOL: Well, China never seemed to really have been willing to pull the trigger and stop feeding his people or stop providing other kinds of aid to North Korea, so they've gotten away with this in the past, and the Chinese have been unwilling to risk undermining -- allowing the North Korean regime to be undermined and to fall with the unified Korea. And I think that's dangerous to them. I don't know why, Korea isn't going to invade China, but nonetheless, they want to preserve -- they don't want the East European model of communist regimes falling on their border.\n\nThe U.S., what can we do? We can get serious about missile defense. We spend about 1.5 percent of our defense budget on missile defense. The Obama administration having canceled the ground base interceptors, then restored them just, what, a couple of weeks ago, and said we're going ahead on it. But basically, under both parties, really, but especially under the Democrats, there's been a sort of very haphazard (inaudible) through to President Reagan's announcement 30 years ago. The (inaudible) made a decision, really, and maybe we should try to defend ourselves from nuclear weapons and not just accept them as inevitable. And I think in a post-Cold War world, we don't know, the North Korean regime could be ten or 20 years from now, and they could have many more missiles and many more nuclear weapons and they could be proliferating them. I'm not sure we'll find them or the Israelis will know whether they have proliferated. Don't we want to get serious and spend some real money and really invest in serious missile defense for ourselves and our neighbors?\n\n(CROSSTALK)\n\nWALLACE: Ed, the president has kind of flipped on missile defense.\n\nGILLESPIE: Yeah.\n\nWALLACE: Because when he first came in, he pulled back on some of the deployment of anti-missile interceptors. Now, one of his first steps, he and Chuck Hagel at the Pentagon, was to beef up our interceptors system up along the Alaska coast.\n\nGILLESPIE: Yeah, and like I said, they should be commended for that. I'll take one exception, Bill, I'm not -- I think President Bush did make a priority of missile defense, and one of the first things that the Obama administration did was to reverse that, and now they've reversed themselves again, understanding that there was a reason for it, an important strategic reason for it, and I'm glad they reversed themselves. I wish they hadn't reversed themselves in the first place or reverse the policy in the first place, but we have -- this is an example of why we need missile defense, and we need for our friends to have it as well.\n\nWALLACE: All right. We have to take a break here, but when we come back, after this week's historic Supreme Court hearings on same sex marriage, where does the issue stand now?\n\n(COMMERCIAL BREAK)\n\n(BEGIN VIDEO CLIP)\n\nSUPREME COURT JUSTICE SAMUEL ALITO: You want us to step in and render a decision based on an assessment of the effects of this institution, which is newer than cell phones or the Internet? I mean we -- we are not -- we do not have the ability to see the future.\n\nSUPREME COURT JUSTICE ELENA KAGAN: Supposed the states said, because we think that the focus of marriage really should be on procreation we are not going to give marriage licenses anymore to any couple where both people are over the age of 55. Would that be constitutional?\n\n(END VIDEO CLIP)\n\nWALLACE: Supreme Court Justices Samuel Alito and Elena Kagan differing on whether the court should intervene in the issue of same sex marriage. We're back now with the panel. So, at the end of a rare two days of arguments, Bill, where do you think the court is on the constitutional question of same sex marriage, and also, on the Defense of Marriage Act, which denies federal benefits to same sex couples, who have been legally married in their states?\n\nKRISTOL: I mean, it looks as if the court will strike down part of the Defense of Marriage Act, on sort of federalism grounds, and ...\n\nWALLACE: But it's a state issue, not a federal issue.\n\nKRISTOL: Right, and the federal government in a way is putting a thumb on the scale by preferring traditional marriage to states that -- by preferring states that have chosen traditional marriage over states that have chosen same sex marriage, and it looks as if the court is not going to impose a universal constitutional right to same sex marriage on the nation. And I hope they don't, and I -- I think they won't.\n\nWALLACE: Do you think that they will leave Prop 8 alone and, just, let's say, deny it on procedural grounds, the plaintiff didn't have standing or do you think that they might decide, yes, Prop 8 either stands or falls in California, but that doesn't impact other states.\n\nKRISTOL: Yeah, I can't - I can't tell it, it is hard to read. And maybe others know better than I do what the court is going to do.\n\nWALLACE: All right, we'll go down the list. Down the row here and see. But, one of the points, Mara, that several justices made, is that public opinion is changing so quickly on this issue, both in the polls and, four states in 2012 legalized same sex marriage, that perhaps the court should stay out of it, and leave it to the political process in the states. In that sense, could the supporters of same sex marriage be victims of their own success?\n\nLIASSON: Yes. I think they could and I actually think the best outcome for Democrats and even proponents of same sex marriage is if Prop 8 is upheld in California, but there is no sweeping constitutional finding that same sex marriage is legal all over the country, because ...\n\nWALLACE: Well, if Prop 8 is upheld, that means that same sex marriage is banned.\n\nLIASSON: No, I'm sorry, Prop 8 is -- the lower court ruling is upheld, which means Prop 8 is overturned.\n\nWALLACE: OK.\n\nLIASSON: I'm sorry about that. But if they want to in California, right now they could back and put up Prop 8.2, legalizing same sex marriage and it would probably pass, it is a lot more meaningful and profound to kind of adjudicate divisive social issues by voters and legislators, not unelected justices, and I think that it's going to be more lasting political change if you do it at the ballot box. It also means you're not going to have this huge backlash and I agree with Bill, I don't think the court is going in the direction of legalizing same sex marriage on the national constitutional basis.\n\nWALLACE: Ed, let's talk about the politics of this. You, of course, a former chairman of the Republican National Committee, isn't this a problem for the GOP? As we say, public opinion is moving in the direction of support for same sex marriage, especially among young people, 70, 80 percent of all people of all persuasions, under the age of 35, 40, support same sex marriage as a legal right. But the polls show that Republicans still overwhelmingly oppose it, only 27 percent in one poll, I saw, support same sex marriage. So, where does the Republican Party go? You have an awful lot of your base still very much opposes this. But you can see the pendulum swinging for the country.\n\nGILLESPIE: Chris, I don't see the Republican Party or most Republicans, obviously, changing in terms of believing that marriage is between one man and one woman. I do think that in the context of this debate, as in so many other debates, Republicans have been cast in the negative, you know - in the negative to say we are opposing something as opposed to talking about what most Republicans are for. Most Republicans are also for the benefits of marriage in the legal system, that are afforded, the protections like, for example, visitation - hospital visitation rights or survivorship benefits and I think you will hear more Republicans making that point, that we can do those things without having the government sanction same sex marriage.\n\nWALLACE: But looking at the polls, and, particularly, looking at where younger people are going, would you have any problems in 2016, with a Republican Party platform saying that marriage is between a man and a woman?\n\nGILLESPIE: I wouldn't have any problem with that. I think one of the questions is, I believe the platform right now calls for a federal constitutional amendment to ban it. You know, there may be a debate about that.\n\nWALLACE: (inaudible) ban same sex marriage.\n\nGILLESPIE: Yeah, to ban it. I don't think you would ever see the Republican Party platform saying we are in favor of same sex marriage, but there may be a question, because I think to Mara's point, the federalism aspect of this Supreme Court debate has been interesting, and because a lot of conservatives have felt for a long time that Roe was wrongfully decided and imposed ...\n\nWALLACE: Roe v. Wade.\n\nGILLESPIE: Roe v. Wade.\n\nWALLACE: 1973.\n\nGILLESPIE: And that the issue of abortion should have been left to the states, for people to hash out in a more civil manner.\n\nA lot of conservatives found themselves arguing in this instance that the court shouldn't impose a federal mandate that it is legal. So there has been a little bit of a shift I think in terms of Republicans saying we should allow this to be worked out in the states not imposed by courts and not imposed federally. And, it will be interesting to see how that shakes up, because the platform as it is today says a federal constitutional amendment to ban it.\n\nWALLACE: We should point out it isn't just conservatives who feel that Roe was wrong in this particular issue, Ruth Bader Ginsburg, a justice of the Supreme Court appointed by Democrats, liberal, very much an abortion rights supporter, says she thinks it was a mistake, because she thought it moved the court too quickly in this direction in a judicial fiat instead of leaving it to the states to work out something that they were working out. Chuck, when you listened to what you three learned colleagues, your fellow justices here on the court, say, your thoughts about the debate this week, where it leaves the issue and the political implications.\n\nLANE: Well, as to the debate, not to sounds Pollyanish, but I thought it was actually refreshing and useful for the whole country to listen to two days of discussion among nine very intelligent people of various views who are not running for office, you know? And who aren't obsessed with the short-term political consequences of these things themselves, but are really sort of wrestling with it in a very serious way, and in that regard I think it was a very, very helpful occasion in the whole debate. Because they've had the sort of guts to go through a whole lot of difficult questions, you know, about, is this really just like interracial marriage? What are the social science consequences and so forth.\n\nBut I think what is crystallizing as a result of this is a distinction is developing between the substance of whether this is a good idea or not, and the process of how we as a country are going to decide. And, in that respect, I do think there is a -- a kind of a tentative consensus on the court that the procedural - the optimum way to handle it is to let the states decide, to give more time to the democratic process to work this thing out as opposed to having the judicial branch sort of slice through the Gordian knot --\n\nWALLACE: But what about the argument? For the sake of argument, what about the argument, look, we don't decide constitutional rights ...\n\nLANE: Right.\n\nWALLACE: ... that way. We don't decide whether schools can be segregated that way. We don't decide interracial marriage that way.\n\nLANE: I think the answer, I've heard from the court was, we're not ready to say this is a constitutional right. That there isn't enough support in the text of the document or in the precedence of this court to say that without same sex marriage every state in the union is violating the Constitution.\n\nWALLACE: Thank you, panel. See you next week and don't forget to check out panel-plus. Where our group picks right up with the discussion on our Web site, FoxNewsSunday.com, we'll post the video before noon eastern time, and make sure to follow us on Twitter @FoxnewsSunday.\n\nUp next, our Power Player of the Week.\n\n(COMMERCIAL BREAK)\n\nWALLACE: Of course, this is Easter Sunday. But, it was also 32 years ago, this weekend, a gunman tried to kill Ronald Reagan. Today, a story you have never heard before. About how a doctor saved the president's life with what he believes was some divine help. Here's our Power Player of the Week.\n\n(BEGIN VIDEO CLIP)\n\nDR. SAM SPAGNOLO, GWU & VA MEDICAL CENTER: And they said we need you to come over to the hospital right away.\n\nWALLACE: That was how Dr. Sam Spagnolo learned 32 years ago he was about to take on the case of his life. He was the head of the lung department at George Washington University Hospital. And Ronald Reagan, who had sustained a gunshot to the lung, was in the operating room. SPAGNOLO: The bullet went through here and lodged over here on the inner surface of the lung, so another inch or two and it would have been into the heart.\n\nWALLACE: Spagnolo first saw the president when he was wheeled into the recovery room.\n\nSPAGNOLO: And we put him on the ventilator right away and he was getting some sedation and I stayed there until we finally got him off the ventilator, about 3 o'clock in the morning.\n\nWALLACE: The doctor says Reagan did well in the first couple of days, his condition serious, but not critical, then things changed. Spagnolo kept a diary he's making public for the first time.\n\nSPAGNOLO: Day five, April 3rd, 1981. I was called at home and requested a return to the hospital. I arrived at the presidential suite and asked the nurse in charge what was going on. She told me the president's temperature was almost 104 degrees and he was not looking well. That made all of us a little nervous about which way this was going to go.\n\nWALLACE (on camera): When you said which way this was going to go, was his life is danger?\n\nSPAGNOLO: At that point I thought his life was in danger.\n\nWALLACE: That's got to take your breath away.\n\nSPAGNOLO: It did.\n\nWALLACE (voice over): Spagnolo ordered a battery of tests, to check for infection. But the president's medical team resisted.\n\nSPAGNOLO: Things were going a little slower than I'd hoped.\n\nWALLACE (on camera): So, what did you say?\n\nSPAGNOLO: If we don't get movement, I'm not - I'm going to walk off this case.\n\nWALLACE (voice over): The other doctors agreed to the tests, but they found no sign of infection. Still, Spagnolo was convinced that was the problem. And put Reagan on antibiotics. Within 24 hours, his temperature went down.\n\nWALLACE (on camera): Honestly, 30 years later, what do you think would have happened if you had not intervened and given him this broad dose of antibiotics.\n\nSPAGNOLO: He might not have gotten better.\n\nWALLACE (voice over): Spagnolo sat by the president's bedside in the morning for the next two weeks, watching TV and listening to his stories. There was no mention of politics.\n\nSPAGNOLO: Day nine, Tuesday, April 7th -- I went to the president's room and spoke with him for 10 to 15 minutes. He looked better and his spirits were good. He continued to tell me various stories at that time about his early days in Hollywood.\n\nWALLACE: Months later the Reagans invited the medical team to the Oval Office to thank them for saving the president's life. Reagan always said his recovery was miraculous. Dr. Spagnolo agrees.\n\nSPAGNOLO: I certainly think somebody was watching over me, all the time, making sure that the thing was going well. I certainly - took any extra help that I could get from the good Lord above.\n\n(END VIDEOTAPE)\n\nWALLACE: I spoke with Nancy Reagan this weekend and asked if she had a message for Dr. Spagnolo. She said please send him a big, big thank you.\n\nAnd that's it for today. Have a great week and we'll see you next \"Fox News Sunday.\"\n\nContent and Programming Copyright 2013 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2013 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "images": ["https://web.archive.org/web/20130401023352im_/http://www.foxnews.com/on-air/fox-news-sunday-chris-wallace/sites/foxnews.com.on-air.fox-news-sunday-chris-wallace/files/styles/style252x173/public/CardinalDonaldWuerl_0.jpg", "https://web.archive.org/web/20130401023352im_/http://www.foxnews.com/on-air/fox-news-sunday-chris-wallace/sites/foxnews.com.on-air.fox-news-sunday-chris-wallace/files/styles/style252x173/public/MarkKelly_1.jpg", "https://web.archive.org/web/20130401023352im_/http://www.foxnews.com/static/all/img/fn_128x128.png", "https://web.archive.org/web/20130401023352im_/http://global.fncstatic.com/static/p/show-page/all/img/logo-fn.gif", "https://web.archive.org/web/20130401023352im_/http://global.fncstatic.com/static/p/show-page/all/img/logo-fn-2.png"], "top_img": "https://web.archive.org/web/20130401023352im_/http://www.foxnews.com/static/all/img/fn_128x128.png", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20130401023352/http://www.foxnews.com/on-air/fox-news-sunday-chris-wallace/2013/03/31/mark-kelly-whether-call-action-gun-control-fading-cardinal-donald-wuerl-new-pope", "title": "Mark Kelly on whether call to action on gun control is fading; Cardinal Donald Wuerl on new pope", "meta_data": {"dc.language": "en-US", "dc.publisher": "Fox News", "dc.date": "2013-03-31", "dcterms.created": "2010-08-19T16:42:25-04:00", "dcterms.modified": "2010-09-29T13:44:12-04:00", "dc.format": "text/html", "dc.identifier": "urn:uri:base64:cGFnZTE=", "dc.type": "Collection", "dc.title": "Mark Kelly on whether call to action on gun control is fading; Cardinal Donald Wuerl on new pope", "keywords": "Fox News Sunday, FNS, Chris Wallace, Capitol Hill, Washington DC, Politics, Panel Plus, Wallace Unplugged, Power Player, Wallace Watch, Morning Booking Call, Bill Kristol, Mara Liasson, Kevin Madden, Juan Williams, Fox News Channel, FNC, Fox News, shows, FoxNews.com", "prism.genre": "transcript", "prism.aggregationType": "subsection", "prism.channel": "fnc", "prism.section": "shows", "prism.subsection1": "foxnewssunday", "prism.subsection2": "transcript", "prism.subsection3": "interviews", "og": {"type": "article", "title": "Mark Kelly on whether call to action on gun control is fading; Cardinal Donald Wuerl on new pope", "image": "https://web.archive.org/web/20130401023352im_/http://www.foxnews.com/static/all/img/fn_128x128.png", "site_name": "Fox News", "url": "https://web.archive.org/web/20130401023352/http://www.foxnews.com/on-air/fox-news-sunday-chris-wallace/2013/03/31/mark-kelly-whether-call-action-gun-control-fading-cardinal-donald-wuerl-new-pope"}, "fb": {"app_id": 113186182048399, "admins": 100000924384522}}, "movies": [], "publish_date": 1364659200.0, "source": "https://web.archive.org", "summary": ""}