{"url": "https://people.com/parents/john-stamos-fatherhood-billy-road-trip/", "text": "Third generation Greek immigrant John Stamos has long been a proud American, and now that he’s also become a proud papa for the first time, he’ll be sharing his patriotism with his new son, Billy.\n\nStamos, 54, will be bringing nearly 2-month-old Billy along on his first cross-country trip as the Fuller House star/producer returns to host PBS’s annual broadcast of A Capitol Fourth, the national 4th of July celebration in Washington, D.C.\n\nGet push notifications with news, features and more.\n\nIt’s been a celebratory year thus far for Stamos, who wed model/actress Caitlin McHugh in February and welcomed their new baby – named after his late father – in April. But the timing of the new arrival made Stamos wonder if he’d be able to return to host the 38th annual 4th of July broadcast from the West Lawn of the U.S. Capitol again this year after deeply enjoying his debut stint in 2017.\n\nImage zoom Rachel Murray/Getty\n\n“Fortunately, I’ve been able to take off work now, but I said, ‘Well I don’t know if I could do [the concert] again, because I’m having a little baby,’ ” Stamos told PEOPLE at a photo shoot to promote the celebration. “And they said, ‘Well, what can we do to get you?’ ”\n\nThe solution? Family road trip! “I said, ‘Well, I got to bring the kid, then.’ So we’re bringing Billy! And PBS just sent this really cute onesie that says ‘Future Host,’ and all this patriotic stuff.”\n\nIt’ll be baby Stamos’ first cross-country excursion, coming on the heels of a slightly not-so-smooth local road trip, Stamos admitted. “It was Mother’s Day and Caitlin’s birthday, so we went down to Laguna [Beach], and it was the first time we didn’t have a nanny — that was rough!” he laughed. “[But] so far, it’s been a dream, and when I look at him, I feel like I’ve been thinking about that face for a long time.”\n\nStamos said that fatherhood has been everything that he expected it would be, and it’s deepened his connection to his country. “I always knew it was going to be like this,” he explained. “It took me longer than it should’ve, but I knew that I would be a family and be contributing to this country, and holding onto the morals and the values that my parents had, that I like to think of the world having. It’s a time to be kind and graceful to people. It just takes so much energy to block all the negativity. I’m really trying to get people together.”\n\nAs a bonus, Stamos’ longtime friends and frequent, if unofficial, bandmates — the iconic, multi-platinum selling music legends The Beach Boys — will join him in the nation’s capitol as both performers and the recipients of the fifth annual A CAPITOL FOURTH’s National Artistic Achievement Award, with Stamos presenting.\n\n“I’m just the biggest glorified fan, really,” Stamos said of his connection to the group, which goes back to the 1980s, appearing in their music video for “Kokomo,” frequently joining them on stage behind the drum kit and executive producing the 2000 miniseries The Beach Boys: An American Family. “I’m a fan who gets to hang out with them.”\n\nRELATED VIDEO: New Dad John Stamos Opens Up About Fatherhood & Reveals Which Parent His Son Looks Like\n\nSo much so that the band has become as close as family: founding member Mike Love even got ordained and officiated Stamos and McHugh’s wedding ceremony.\n\nWant all the latest pregnancy and birth announcements, plus celebrity mom blogs? Click here to get those and more in the PEOPLE Babies newsletter\n\n“They’re America’s band. It’s always a special feeling playing with them, but especially when you’re in D.C. I think I said it even in the show last year: the Fourth of July, Washington, the Beach Boys — it doesn’t get more American than that. But more than that, I love the effect they have on people and that their music has on people. In a graceless time right now, where people are looking for comfort, I think the Beach Boys music and this whole show, it does that, right?”\n\nAn all-star roster of performers bridging a variety of American favorite musical genres will be joining Stamos and the Beach Boys for the celebration, including Jimmy Buffett and the Broadway cast of the new musical Escape From Margaritaville (this is their first stop after Broadway before launching a national tour); three-time Grammy Award-winning a capella artists Pentatonix; legendary Motown stars The Temptations; platinum country music singer-songwriter Luke Combs; country music star and American Idol alum Lauren Alaina; gospel legend CeCe Winans; and internationally-acclaimed violinist Joshua Bell; with the National Symphony Orchestra, under the direction of top pops conductor Jack Everly.\n\nAdditionally, soprano superstar Renée Fleming will perform “You’ll Never Walk Alone” to honor the nation’s men and women in uniform and their families.\n\nAlso participating in the event will be the Choral Arts Society of Washington, the U.S. Army Herald Trumpets, the U.S. Army Ceremonial Band, Members of the Armed Forces carrying the State and Territorial Flags and the Armed Forces Color Guard provided by the Military District of Washington, D.C. The top-rated, award-winning program will be capped off with a rousing rendition of Tchaikovsky’s “1812 Overture” complete with live cannon fire provided by the United States Army Presidential Salute Battery, an audience favorite and “A Capitol Fourth” tradition.\n\nImage zoom John Stamos/Instagram\n\nThe celebration will culminate with the largest and most spectacular fireworks display in the nation.\n\n“It was electrifying,” said Stamos of his debut hosting stint. “And I’ve been in front of crowds and a lot of the shows or concerts, and Broadway stuff I’ve done. But they’re coming there for a different reason, to see something. Here I felt they were part of it. They were part of our party, part of our show. … I’ll try again this year to interact with the crowd. I let the producer and the director know, ‘I may stop and talk to somebody,’ and we did it. It was really sweet.”\n\nStamos was also gratified that last year during the show he was able to address the hot-button topic of immigration, a facet of American tradition he values given his own family’s history since his grandfather passed through Ellis Island to embrace the nation’s traditions of liberty, opportunity and freedom of speech.\n\n“The beauty was that this country give him that, and then has given that to my father and me, and I’ll pass that on to my son, all because of an immigrant coming over,” said Stamos. “He worked hard and took advantage, in the best sense, of what this country has to offer all of us.”\n\nThe 38th annual broadcast of A Capitol Fourth airs on PBS Wednesday, July 4 from 8-9:30 p.m. ET before a concert audience of hundreds of thousands, millions more at home, as well as to our troops serving around the world on the American Forces Network. The program can also be heard live in stereo over NPR member stations nationwide. The concert will also be live-streamed on PBS, You Tube, Facebook and www.pbs.org/a-capitol-fourth and available as Video on Demand for a limited time only, July 4 to July 18, 2018.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fjohn-stamos1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1310&h=686&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fjohn-stamos.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fstamos-fiance.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1310&h=686&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fjohn-stamos.jpg", "keywords": [], "authors": ["Scott Huver"], "canonical_link": "https://people.com/parents/john-stamos-fatherhood-billy-road-trip/", "title": "John Stamos — Host of PBS’s Annual Broadcast of A Capitol Fourth —Calls Fatherhood 'a Dream'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Babies,Babies Exclusives,Caitlin McHugh,Exclusive,John Stamos,News,Parenting,TV", "news_keywords": "Babies,Babies Exclusives,Caitlin McHugh,Exclusive,John Stamos,News,Parenting,TV", "description": "\"So far, it's been a dream, and when I look at him, I feel like I've been thinking about that face for a long time,\" John Stamos tells PEOPLE", "og": {"title": "John Stamos — Host of PBS’s Annual Broadcast of A Capitol Fourth —Calls Fatherhood 'a Dream'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/parents/john-stamos-fatherhood-billy-road-trip/", "description": "Third generation Greek immigrant John Stamos has long been a proud American, and now that he’s also become a proud papa for the first time,&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1310&h=686&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fjohn-stamos.jpg", "width": 1310, "height": 686}}, "pinterest": {"url": "https://people.com/parents/john-stamos-fatherhood-billy-road-trip/", "description": "\"So far, it's been a dream, and when I look at him, I feel like I've been thinking about that face for a long time,\" John Stamos tells PEOPLE", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fjohn-stamos.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/parents/john-stamos-fatherhood-billy-road-trip/", "title": "John Stamos — Host of PBS’s Annual Broadcast of A Capitol Fourth —Calls Fatherhood 'a Dream'", "description": "\"So far, it's been a dream, and when I look at him, I feel like I've been thinking about that face for a long time,\" John Stamos tells PEOPLE", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1310&h=686&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fjohn-stamos.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}