{"url": "www.yourtango.com/2018314619/7-details-about-taylor-swift-joe-alwyns-relationship-marriage-rumors", "text": "She reportedly thinks he's \"The One.\"\n\nWhether they do it or not, most celebrities are able to keep their public persona and private relationships separate.\n\nTaylor Swift is not one of those people.\n\nWhen it comes to Swift, it’s impossible to talk about her career without also talking about her relationships, as she uses each and every one as inspiration for her songs. “It’s individual people that come into my life,” Swift has said about where she finds inspiration for her lyrics. “When I first started writing songs, I was always scared that my songs were too personal like, if I put someone’s name in a song, people won’t relate to it as much. But what I saw happening was, if I let my fans into my life and my feelings and what I’m going through my vulnerabilities, my fears, my insecurities it turns out they have all those things, too, and it kind of connects us.”\n\nNot only has it connected her and her fans, but also leaves people dissecting each and every one of her songs to find out which of her romances they are about — and there are many to choose from.\n\nMost of Swift’s relationships haven’t been all that long-lasting, but they’ve all been known to fuel the tabloids along with rumors that they’re PR stunts. However, she’s managed to keep her most recent relationship with actor Joe Alwyn under wraps — but that doesn’t mean there isn’t some interesting stuff going on right under our noses!\n\n1. They dated for months without anyone knowing\n\nIn 2017, Swift all but disappeared from the public eye, which is weird for someone who until that point basically dominated the celebrity news cycle. A source close to Swift told People that she stepped away from the spotlight as “she felt like her personal life was spinning out of control.”\n\nDuring this time, Swift and Alwyn reportedly started dating unbeknownst to just about everyone. The Sun was the first to break the news about their relationship in May 2017 after they allegedly had already been together for months. “After what happened with Tom Hiddleston, they were determined to keep it quiet,” a source told The Sun. \"Taylor has flown in via private jets and her security has made it a military-like mission to prevent her from being seen.”\n\n2. They started dating right after her breakup with Tom Hiddleston\n\nOut of all of Swift’s relationships, the one with Tom Hiddleston is probably the most bizarre. Though it only lasted three months, it was quite a whirlwind. Swift and Hiddleston broke up in September 2016, and it seems her relationship with Alwyn may have started in October of that year. \"She has been going back and forth between Nashville and the U.K. for the last few months while she has been recording her album,\" a source told E! Online.\n\n3. They’re rarely seen together\n\nDespite Swift being “crazy about Joe” and “really excited about their relationship,” it’s very rare that we catch a glimpse of them together — which is very unlike the country-pop crossover star. This leads us to believe Alwyn has something to do with the change of pace which, according to an insider, is likely the case. “Joe doesn't like attention or have any interest in being a celebrity,” the source said, telling E! Online, \"She still intends to keep the relationship as private as possible. It's sacred to her and she feels that keeping it to themselves has worked out for the best.”\n\n4. They haven't walked the red carpet together\n\nIt’s one thing to avoid paparazzi, but throughout their relationship so far, Swift and Alwyn have also yet to walk a red carpet together. According to Hollywood Life, this is a deliberate way for the couple to keep their relationship together. “[Taylor]’s grown up a lot in the last few years and realizes how important it is to avoid being in the limelight 24/7 in order to maintain a stable, secure relationship,” a source reportedly said.\n\n5. He doesn’t want to be known as “Taylor Swift’s boyfriend”\n\nSwift is about as popular of a celebrity as you can be. And while Alwyn has started to up his status, he’s nowhere near the star Swift is — yet. And according to a source, he doesn’t want Swift’s celebrity to eclipse his talent.\n\n“Joe is determined to make it as an actor in his own right, and not to be known just as Taylor Swift’s boyfriend,” a source close to Joe reportedly told Hollywood Life. “Taylor is really supportive of Joe’s career, and totally understands why he doesn’t want to be a red carpet fixture with her.\n\n6. He puts his job over everything\n\nAlwyn’s acting career is still in its infancy, but he’s determined to make it in the industry. According to one of Alwyn’s former classmates, Alwyn is “married to his work.” It seems Swift knows this, though, and so far doesn’t mind. “Taylor loves that Joe is so dedicated to his career, and to making it big in his own name, and their relationship is all the happier for it,” a source told Hollywood Life.\n\n7. They might already be talking marriage\n\nIt seems as though all of Swift’s relationships up to this point have been lighthearted and fun (until they weren’t, of course, as we’ve learned in her lyrics). However, it seems she’s ready to get serious with Alwyn. In fact, a source told Us Weekly that she’s got marriage on the brain. “Taylor really believes Joe is the one for her,” an insider revealed. “She wants to get engaged to him.”\n\nMicki Spollen is a YourTango editor, writer, and traveler. Follow her on Instagram and keep up with her travels on her website.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6035233&cv=2.0&cj=1", "https://www.yourtango.com/sites/default/files/styles/header_slider/public/image_blog/ts_1.jpg?itok=jfYkXzxe", "https://www.yourtango.com/sites/all/themes/ytpurple/img/logo-150.png?v2", "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/ts_1.jpg?itok=Q4xzHfAr"], "top_img": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/ts_1.jpg?itok=Q4xzHfAr", "keywords": [], "authors": [], "canonical_link": "https://www.yourtango.com/2018314619/7-details-about-taylor-swift-joe-alwyns-relationship-marriage-rumors", "title": "7 Questionable Details About Taylor Swift And Joe Alwyn's Relationship, Including Her \"Military-Like Mission\" To Keep It Under Wraps", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "fb": {"app_id": 102332647006, "pages": 39475817260}, "keywords": "Taylor Swift, joe alwyn, Relationships, Dating, celeb, entertainment and news, Buzz", "article": {"author": "https://www.yourtango.com/users/micki-spollen", "published_time": "2018-06-25T15:45:00", "modified_time": "2018-06-25T15:45:00"}, "og": {"site_name": "YourTango", "type": "article", "url": "https://www.yourtango.com/2018314619/7-details-about-taylor-swift-joe-alwyns-relationship-marriage-rumors", "title": "7 Questionable Details About Taylor Swift And Joe Alwyn's Relationship, Including Her \"Military-Like Mission\" To Keep It Under Wraps", "description": "She reportedly thinks he's \"The One.\"", "updated_time": "2018-06-25T15:45:00", "image": {"identifier": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/ts_1.jpg?itok=Q4xzHfAr", "width": 620, "height": 309}}, "description": "Taylor Swift and Joe Alwyn’s relationship is very unlike the rest of her relationships. Find out why Swift’s boyfriend is never seen with the songstress and what their dating life is really like.", "abstract": "Whether they do it or not, most celebrities are able to keep their public persona and private relationships separate. Taylor Swift is not one of", "robots": "follow, index, noodp, noydir", "news_keywords": "taylor swift, relationships, joe alwyn, dating", "generator": "Drupal 7 (http://drupal.org)", "twitter": {"card": "summary_large_image", "creator": {"identifier": "@yourtango", "id": 17490866}, "url": "https://www.yourtango.com/2018314619/7-details-about-taylor-swift-joe-alwyns-relationship-marriage-rumors", "title": "7 Questionable Details About Taylor Swift And Joe Alwyn's Relationship, Including Her \"Military-Like Mission\" To Keep It Under Wraps", "image": {"src": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/ts_1.jpg?itok=Q4xzHfAr", "width": 60, "height": 60}}}, "movies": ["https://www.youtube.com/embed/VPDFJxCbLP0"], "publish_date": 1529912700.0, "source": "http://www.yourtango.com", "summary": ""}