{"url": "https://www.etonline.com/bachelor-contestant-on-colton-underwoods-season-apologizes-for-offensive-tweets-115398", "text": "Colton Underwood's season of The Bachelor hasn't even started yet, but already, the show seems to have a controversy on its hands.\n\nJust one day after the new cast was announced on Thursday, fans found old, offensive messages tweeted by contestant Tracy Shapoff. She owned up to the tweets -- which included racist comments, fat-shaming remarks, using the R-word, and seemingly even slamming The Bachelor -- on Friday, alongside an apology.\n\n\"I want to start by expressing my sincerest apologizes for the extremely hurtful words that I said many years ago,\" Shapoff wrote on Instagram. \"I'm so sorry for those who I have offended. I am beyond mortified that I ever had those thoughts and then proceeded to express them. By no means does this reflect the person who I am today. To the people who do not know me, I am a loving, kind, thoughtful, generous, and compassionate woman. I am not mean-hearted or hurtful.\"\n\n\"The people I have always surrounded myself with are very diverse and come from all over the world,\" she continued. \"I have a huge heart and a very open mind. In the many years since writing those tweets, I have made a conscious effort not to be judgmental and to be accepting of all people. I have gone into a field of work where I am able to help women and men have positive images of themselves, their bodies, and feel beautiful in who they are. It is the most rewarding feeling being able to work in such a diverse field. It shows me the beauty in all people and I am so lucky to have this opportunity.\"\n\nShapoff concluded by insisting that she doesn't \"defend any of the words I have tweeted.\" \"I just want to deeply apologize and learn from my mistakes. I wholeheartedly reject all of those sentiments,\" she said. \"That being said, I take full responsibility for my tweets and will use this as a learning experience. I hope that we can continue to spread love and kindness in the world.\"\n\nABC has no comment.\n\nSocial media scandals have been a recurring theme for the Bachelor franchise lately. One of the contestants on Rachel Lindsay's season of The Bachelorette in 2017, Lee Garrett, was discovered to have a large history of racist tweets. Host Christ Harrison called him out on the show's Men Tell All special, and he apologized for his remarks.\n\n'Bachelorette' Winner Garrett Yrigoyen Was 'Worried' He Would 'Lose' Becca Kufrin After Instagram Scandal This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart 'Bachelorette' Winner Garrett Yrigoyen Was 'Worried' He Would 'Lose' Becca Kufrin After Instagram Scandal\n\nThen on Becca Kufrin's season of The Bachelorette earlier this year, her final pick, Garrett Yrigoyen, owned up to having liked Instagram posts which mocked transgender people, feminists, immigrants and Parkland shooting survivors. He apologized for his actions in an Instagram statement weeks after the scandal came to light, and clarified his views to ET after the show's finale.\n\n\"I'm just open-minded to everybody,\" he said in response to the anti-transgender memes he liked, noting that he grew up in a very welcoming family. \"I'm open and accepting to everybody.\"\n\nHe also opened up about the meme he liked that called David Hogg and other Parkland shooting survivors crisis actors. \"I don't believe David Hogg is a crisis actor. No, I don't,\" he added.\n\nSee more in the video below.\n\nThe Bachelor returns with a three-hour live premiere on Monday, Jan. 7 at 8 p.m. ET/PT on ABC -- join ET's Bachelor Nation Facebook group here.\n\nRELATED CONTENT:\n\n'Bachelor' Colton Underwood's Contestants Revealed! Meet the Women Vying for His Heart\n\nRachel Lindsay on How Bachelorette Becca Should Handle Garrett's Instagram Scandal If He Wins\n\nWhy 'Bachelorette' Winner Thought Becca Would Break Up With Him\n\n'Bachelorette' Winner Garrett Yrigoyen Addresses Instagram Controversy (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRelated Gallery", "images": ["https://www.etonline.com/themes/custom/et/img/watch-now.png", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2020-03/peter_madison_gettyimages-1206495953_1280.jpg?h=c673cd1c&itok=KXkKlwfc", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2018-12/1280_tracy_150167_0303.jpg?h=2e976bc2&itok=FL-1T86Y", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-12/1280_tracy_150167_0303.jpg?h=2e976bc2&itok=FIsfi9d2"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-12/1280_tracy_150167_0303.jpg?h=2e976bc2&itok=FIsfi9d2", "keywords": [], "authors": ["Jennifer Drysdale"], "canonical_link": "https://www.etonline.com/bachelor-contestant-on-colton-underwoods-season-apologizes-for-offensive-tweets-115398", "title": "'Bachelor' Contestant on Colton Underwood's Season Apologizes for Offensive Tweets", "meta_data": {"article": {"opinion": "false"}, "title": "'Bachelor' Contestant on Colton Underwood's Season Apologizes for Offensive Tweets | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/bachelor-contestant-on-colton-underwoods-season-apologizes-for-offensive-tweets-115398", "title": "Bachelor Contestant on Colton's Season Apologizes for Offensive Tweets", "description": "Tracy Shapoff owned up to making racist and fat-shaming comments in her apology on Friday.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-12/1280_tracy_150167_0303.jpg?h=2e976bc2&itok=FIsfi9d2", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "Tracy Shapoff owned up to making racist and fat-shaming comments in her apology on Friday.", "title": "Bachelor Contestant on Colton's Season Apologizes for Offensive Tweets", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Jennifer Drysdale‍", "url": "https://www.etonline.com/bachelor-contestant-on-colton-underwoods-season-apologizes-for-offensive-tweets-115398", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-12/1280_tracy_150167_0303.jpg?h=2e976bc2&itok=FIsfi9d2"}, "description": "Tracy Shapoff owned up to making racist and fat-shaming comments in her apology on Friday.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "TV, News, The Bachelor, Colton Underwood, GARRETT YRIGOYEN", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}