{"url": "https://en.wikipedia.org/wiki/American_Woman_(TV_series)", "text": "American Woman is an American comedy series inspired by the childhood of actress and reality star Kyle Richards that premiered on June 7, 2018, on Paramount Network. The series was created by John Riggi and stars Alicia Silverstone, Mena Suvari, Jennifer Bartels, Makenna James, and Lia McHugh. On September 5, 2018, it was announced that the series had been canceled after one season.\n\nPremise [ edit ]\n\nAmerican Woman follows \"Bonnie, an unconventional mother struggling to raise her two daughters after leaving her husband amid the rise of second-wave feminism in the 1970s. With the help of her two best friends, Kathleen and Diana, these three women each discover their own brand of independence in a glamorous and ever-changing world reluctant to give it.\"[1]\n\nCast and characters [ edit ]\n\nMain [ edit ]\n\nAlicia Silverstone as Bonnie Nolan\n\nMena Suvari as Kathleen Callahan\n\nJennifer Bartels as Diana Vaughan\n\nMakenna James as Becca Nolan, Bonnie and Steve's elder daughter\n\nLia McHugh as Jessica Nolan, Bonnie and Steve's younger daughter\n\nRecurring [ edit ]\n\nJames Tupper as Steve Nolan, Bonnie's husband whom she throws out after catching him with another woman.\n\nCheyenne Jackson as Greg, Kathleen's boyfriend who is secretly gay.\n\nSam Morgan as Adam\n\nDiandra Lyle as Louise\n\nTobias Jelinek as Mr. Bishop\n\nPatrick Bristow as Randall\n\nJonathan Chase as Alan\n\nChristine Estabrook as Peggy, Diana's Mother\n\nGuest [ edit ]\n\nEpisodes [ edit ]\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nOn June 2, 2015, it was announced that TV Land was developing a television pilot based on the life of The Real Housewives of Beverly Hills star Kyle Richards. The pilot was set to be produced by John Wells Productions in association with Warner Horizon Television. Executive producers included John Wells and John Riggi, who wrote the pilot script.[13]\n\nOn November 7, 2016, it was announced that TV Land had given the production a series order for a first season consisting of 12 episodes, but a premiere date had not been set.[14][15]\n\nOn March 30, 2017, it was revealed that the series had been shifted from TV Land to the newly rebranded Paramount Network.[16] On August 14, 2017, it was announced that John Riggi had departed the series citing creative differences. Replacing him in the role of showrunner was fellow executive producer John Wells.[17] On January 16, 2018, it was announced at the annual Television Critics Association's winter press tour that the series would premiere on June 7, 2018.[18] On September 5, 2018, it was announced that the series had been canceled after one season.[19]\n\nCasting [ edit ]\n\nOn July 25, 2016, it was announced that Alicia Silverstone had been cast in the series lead role.[20] On August 11, 2016, Mena Suvari joined the pilot in another lead role.[21] Later that month, it was reported that Cheyenne Jackson and Jennifer Bartels had also joined the cast.[22] In May 2017, Diandra Lyle was cast as Louise, a recurring role.[23] On June 13, 2017, it was announced that Sam Morgan had joined the cast in a recurring capacity.[24]\n\nFilming [ edit ]\n\nPrincipal photography for the first season of the series began in April 2017 in Los Angeles, California.[25]\n\nRelease [ edit ]\n\nMarketing [ edit ]\n\nOn March 27, 2018, Paramount Network released six \"first look\" images from the series.[26] On May 3, 2018, the first official trailer for the series was released.[27] On May 17, 2018, it was announced that a cover of the song \"American Woman\" had been recorded by singer Kelly Clarkson. It was subsequently used in marketing material for the series.[28]\n\nPremiere [ edit ]\n\nOn April 29, 2018, the series held its official world premiere during the Series Mania Festival in Lille, France in which the first three episodes of the first season were screened. It competed against nine other international television programs in the festival's \"official competition\" series of shows.[29][30][31]\n\nOn June 7, 2018, the series held a screening at the annual ATX Television Festival in Austin, Texas. A question-and-answer panel followed, featuring executive producer Josh Wells, cast members Alicia Silverstone, Mena Suvari, Jennifer Bartels, and co-executive producer Kyle Richards.[32]\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nThe series has received a mixed reception from critics upon its premiere. On the review aggregation website Rotten Tomatoes, the series holds a 44% approval rating with an average rating of 5.36 out of 10 based on 18 reviews. The website's critical consensus reads, \"Stereotypes and ambiguity shadow the well-meaning intentions of American Woman, though the nostalgic period setting is cute.\"[33] Metacritic, which uses a weighted average, assigned the series a score of 48 out of 100 based on 10 critics, indicating \"mixed or average reviews.\"[34]\n\nRatings [ edit ]\n\nNotes [ edit ]\n\na b Live +7 ratings were not available, so Live +3 ratings have been used instead.", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/ae/American_Woman_%28TV_series%29.png/250px-American_Woman_%28TV_series%29.png", "https://upload.wikimedia.org/wikipedia/en/a/ae/American_Woman_%28TV_series%29.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/a/ae/American_Woman_%28TV_series%29.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/American_Woman_(TV_series)", "title": "American Woman (TV series)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/a/ae/American_Woman_%28TV_series%29.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}