{"url": "https://money.cnn.com/2018/06/11/investing/ihob-ihop-burgers-name-change/index.html", "text": "The mystery of IHOb is solved.\n\nIHOP said on Monday that it's temporarily changing its branding because the B stands for burgers.\n\nIt's only a marketing campaign. IHOP isn't changing its name. But the chain of breakfast diners took social media by storm last week with the cryptic announcement that it was flipping the lowercase \"p\" in its logo and making it a \"b.\"\n\nIHOP, of course, stands for International House of Pancakes. But IHOP — sorry, IHOb — wants to be known as a place to get lunch and dinner, not just breakfast and brunch. It's adding several burgers to its menu, including a Big Brunch burger with bacon, a fried egg and browned potato on top.\n\nDear Internet, we abbreciate your batience. Now let's see who guessed right. B-hold!!!!! #IHOb pic.twitter.com/Fh3SkZ7s3Y — IHOb (@IHOb) June 11, 2018\n\n\"We are definitely going to be IHOP,\" Darren Rebelez, president of IHOP, told CNNMoney. \"But we want to convey that we are taking our burgers as seriously as our pancakes.\"\n\nAn IHOP in Hollywood is getting new IHOb signs, and some others might get the treatment. The new IHOb Twitter account even retweeted photos and video of a construction crew putting up the new sign in LA.\n\nBut Rebelez said the vast majority of the nearly 1,800 other locations will still go by IHOP.\n\nSo, to use another B-word, will there be a backlash?\n\nSome people correctly predicted it would stand for burgers, but many others on Twitter and Facebook thought the B would stand for breakfast or bacon.\n\nOthers had more fun, speculating that the B stood for bitcoin or break dancing.\n\nChiquita even got in on the act, saying that the B should stand for bananas.\n\nOthers noted that the Ob in the IHOb logo looked extremely similar to the O.B. brand of tampons.\n\nWell I don't know about you but nothing like the new logo that looks like a tampon brand to make me hungry for flapjacks! #IHOb Just sloppy management pic.twitter.com/eum338fj81 — G (@momomiester) June 7, 2018\n\nRebelez isn't worried that people will be disappointed. He said some people were upset that IHOP would even consider tinkering with the name. But most fans figured out it was just a way to get people talking.\n\nThat clearly worked.\n\n\"The vast majority of people were having fun with the name change and were trying to solve the riddle. They had fun for a week trying to figure it out,\" Rebelez said.\n\nAmerica loves burgers, and IHOP wants to be a bigger player at lunch and dinner.\n\nWhen I asked Rebelez whether IHOP was considering food-fusion menu items — remember Burger King's Whopperito or Taco Bell's Nacho Fries? — he joked that diners could order a side of flapjacks and make their own pancake burger.\n\nStill, it's worth wondering why IHOP is going through all this trouble. Why mess with a good thing?\n\nIHOP owner Dine Brands (DIN) is also the parent company of Applebee's. Is Rebelez worried that he's competing more directly with his corporate sibling?\n\nNot really. Rebelez said IHOP will remain family-focused, while Applebee's will still be a place to go with friends to get a beer and watch a game.\n\n\"They have a bar,\" Rebelez said. \"If you want a burger and beer, you are not going to come to IHOP.\"\n\nIn other words, the B in IHOb clearly doesn't stand for booze.", "images": ["https://money.cnn.com/.element/cnnm-3.0/img/logo/logo_cnn.svg", "https://i.cdn.turner.com/money/images/1.gif", "https://i2.cdn.turner.com/money/dam/assets/180606075827-ihop-ihob-780x439.jpg", "https://i2.cdn.turner.com/money/.element/branding/8.0/section/investing/specials/before-the-bell/right-rail-sign-up-with-logo_2X.png", "https://i.cdn.turner.com/money/video/bvp/images/1.gif", "https://i2.cdn.turner.com/money/dam/assets/180413154819-google-right-to-be-forgotten-1024x576.jpg", "https://money.cnn.com/.element/cnnm-3.0/img/logo/logo_cnnbusiness.png", "https://pixel.quantserve.com/pixel/p-D1yc5zQgjmqr5.gif"], "top_img": "https://i2.cdn.turner.com/money/dam/assets/180606075827-ihop-ihob-780x439.jpg", "keywords": [], "authors": ["Paul R. La Monica"], "canonical_link": "https://money.cnn.com/2018/06/11/investing/ihob-ihop-burgers-name-change/index.html", "title": "IHOP reveals the mystery of IHOb", "meta_data": {"viewport": "width=1140", "date": "2018-06-11 08:17:06", "title": "IHOP reveals the mystery of IHOb", "description": "What's in a name? After a week of social media speculation, IHOP has ended the mystery.", "keywords": "IHOb, IHOP, pancakes, burgers", "news_keywords": "IHOb, IHOP, pancakes, burgers", "author": "Paul R. La Monica", "section": "investing", "og": {"title": "IHOP reveals the mystery of IHOb", "type": "article", "url": "https://money.cnn.com/2018/06/11/investing/ihob-ihop-burgers-name-change/index.html", "image": {"identifier": "https://i2.cdn.turner.com/money/dam/assets/180606075827-ihop-ihob-780x439.jpg", "width": 780, "height": 439}, "site_name": "CNNMoney", "description": "What's in a name? After a week of social media speculation, IHOP has ended the mystery."}, "fb": {"app_id": 521848191196480}, "twitter": {"card": "summary_large_image", "site": "@CNNMoney", "url": "https://money.cnn.com/2018/06/11/investing/ihob-ihop-burgers-name-change/index.html", "title": "IHOP reveals the mystery of IHOb", "description": "What's in a name? After a week of social media speculation, IHOP has ended the mystery.", "image": "https://i2.cdn.turner.com/money/dam/assets/180606075827-ihop-ihob-540x304.jpg"}, "DC.date.issued": "2018-06-11T08:17:06"}, "movies": [], "publish_date": 1528646400.0, "source": "https://money.cnn.com", "summary": ""}