{"url": "https://www.elitedaily.com/p/will-big-little-lies-season-3-happen-nicole-kidman-says-it-isnt-likely-13193947", "text": "When the first season of Big Little Lies ended in the spring of 2017, fans of the buzzy miniseries figured that was that. After all, the debut season was marketed as a one-off miniseries, and it had adapted the entirety of the Liane Moriarty novel on which is was based. But months later, HBO surprised us all by revealing the show would get a second season. While we are still waiting for this new season to premiere, now fans are left with another pressing question: how much longer will the show go on? Will Big Little Lies Season 3 happen or is Season 2 where we will have to say goodbye to Monterey? Nicole Kidman talked about the future of the series in a recent interview, and it does not sound like fans should hold out much hope for more new seasons.\n\nThe biggest hurdle to keeping Big Little Lies going after its upcoming second season, it sounds like, is the hectic schedules of the cast. The ensemble drama boasts one of the most star-studded casts on television, and all of its stars are still putting out multiple blockbuster or critically acclaimed movies each year alongside their new TV jobs. The cast includes Reese Witherspoon, Nicole Kidman, Laura Dern, Shailene Woodley, and Zoë Kravitz, among others, and Season 2 will see none other than Meryl Streep joining the series as well.\n\nWith all of those huge names, it is not easy to block out time for production on Big Little Lies, and unfortunately, that might make Season 2 the last season of the show. In a new profile with Variety, Nicole Kidman said that although she and her costars would love to make a third season, she thinks that getting everyone back together could be difficult:\n\nI think it would be hard to get the whole group together. But we would love to do it.\n\nHBO\n\nAnother reason that Big Little Lies may not continue for much longer is the fact that it was only originally intended to run for one season. After fully telling the story of Liane Moriarty's Big Little Lies novel in Season 1, Moriarty penned a brand new continuation to her book once HBO announced it was picking up a second season.\n\nThe plot for the upcoming season is a big mystery for fans, but we do know it will most likely center on the group of women trying to keep quiet about the murder of Celeste Wright's abusive husband, Perry. Season 1 ended with Bonnie Carlson pushing Perry down a flight of stairs to his death, and the group of moms agreeing to keep the murder a secret to protect Bonnie. Although they seemed to manage to get the police off their scent, Meryl Streep will be playing Perry's mother, Mary Louise Wright, in Season 2, and her arrival in Monterey is sure to complicate matters.\n\nA bigger mystery still is when Season 2 of Big Little Lies will finally premiere. The new season filmed throughout this past summer, and is set to premiere sometime in 2019.", "images": ["https://imgix.bustle.com/uploads/image/2020/4/13/5bccb695-f1c1-42ad-aa95-9463642212ab-5.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.elitedaily.com/uploads/image/2018/11/26/44cfbf1a-5631-4567-8c79-8392a678c30a-big-little-lies.jpg?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/11/26/69e41c8f-b215-42bd-b4d4-ea85f3e5af8a-zs7qlrpkwwioesro3tfmphc5uy.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/8/3fe6c35a-4a89-4623-982e-f8fa8c6ee980-daniel-levy-as-david-rose-on-schitts-creek.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/13/71678fbc-fd23-4e72-97ec-b9f9cb250de2-aaron-paul-evan-rachel-wood_0.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2018/11/26/69e41c8f-b215-42bd-b4d4-ea85f3e5af8a-zs7qlrpkwwioesro3tfmphc5uy.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/uploads/image/2018/11/26/69e41c8f-b215-42bd-b4d4-ea85f3e5af8a-zs7qlrpkwwioesro3tfmphc5uy.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/will-big-little-lies-season-3-happen-nicole-kidman-says-it-isnt-likely-13193947", "title": "Will 'Big Little Lies' Season 3 Happen? Nicole Kidman Says It Isn't Likely", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/will-big-little-lies-season-3-happen-nicole-kidman-says-it-isnt-likely-13193947", "type": "article", "title": "'Big Little Lies' Will Probably End With Season 2, According To Nicole Kidman", "description": "When the first season of Big Little Lies ended in the spring of 2017, fans of the buzzy miniseries figured that was that. After all, the debut season was marketed as a one-off miniseries, and it had adapted the entirety of the Liane Moriarty novel…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/11/26/69e41c8f-b215-42bd-b4d4-ea85f3e5af8a-zs7qlrpkwwioesro3tfmphc5uy.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "When the first season of Big Little Lies ended in the spring of 2017, fans of the buzzy miniseries figured that was that. After all, the debut season was marketed as a one-off miniseries, and it had adapted the entirety of the Liane Moriarty novel…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}