{"url": "https://www.inquisitr.com/4856890/meghan-markle-haunted-by-past-amid-royal-wedding-plans-e-news-reveals-shocking-ghosts-who-betrayed-her/", "text": "Meghan Markle is counting the days until her royal wedding to Prince Harry. But even as Meghan joyfully prepares for her walk down the aisle and marriage to royalty, Markle reportedly is finding herself haunted by ghosts from her past. Ranging from Meghan’s former best friend, Ninaki Priddy, who allegedly betrayed Markle in a shocking way to jealous relatives and a possibly hostile ex-husband, those “ghosts” are darkening Meghan’s wedding plans, according to E! News.\n\nMeghan Markle Reportedly Is Faced With Individuals From Her Past Who Want To Wreck Her Wedding Plans\n\nWhile most of the people in Markle’s life are thrilled about her marriage to Prince Harry, some of those “ghosts” from her past are tormenting her, according to the publication.\n\n“A few [individuals] seem hell-bent on trying to ruin the big [wedding] day. The torment Meghan Markle must be going through, thanks to a best friend from hell, jealous family members and a former spouse, is unimaginable.”\n\nWith a mere six weeks until Meghan and Harry tie the knot, the public Markle is focused on tasks such as getting fitted for her wedding dress, taking royal etiquette classes, and figuring out the politically charged seating arrangements. But it’s the behind-the-scenes antics that are reportedly the most intriguing.\n\nPrince Harry and Meghan Markle will tie the knot on Saturday, May 19, in St. George's Chapel on the grounds of Windsor Castle. Featured image credit: Chris Jackson Getty Images\n\nMeghan Markle’s Brand Gets Makeover: Two “Ghosts” Get Killed Off\n\nAs an actress, Meghan was viewed as a brand with a distinctive voice, including her popular social media accounts. But as Markle prepares to become a duchess and member of the royal family, she is having to reinvent that brand. Meghan was fond of her social media platforms, sources told E! News, but now she must follow in Prince William’s, Kate Middleton’s, and Prince Harry’s footsteps. The trio use the same @KensingtonRoyal handle, and Markle’s appearances with Harry now are reported on Twitter with that handle.\n\nPrince Harry, Patron of the Invictus Games, and Ms. Meghan Markle are today attending the UK team trials for @InvictusSydney 2018 at the @UniofBath Sports Training Village. #IG2018 pic.twitter.com/t7ty0YDBCK — Kensington Palace (@KensingtonRoyal) April 6, 2018\n\nInitially, Meghan’s social media platforms, including Instagram, Twitter, and Facebook, were among the ghosts who haunted her. But those platforms, as well as her lifestyle website, the Tig, have been deleted.\n\nIn addition to social media, Markle’s style when she dated Prince Harry first reflected her old life. Short skirts, ripped jeans, and low necklines turned heads as she stepped out with a member of royalty. But just as she deleted her social media, Meghan has laid to rest her actress-era fashion.\n\n“Gone [are Meghan Markle’s] short skirts and low necklines from her red-carpet days, replaced by more demure outfits of pants, skirts with longer hemlines, tailored coats and even a fashion-forward beret. Meghan 2.0 now looks every inch a style-conscious-yet-sensibly attired member of the regal elite.”\n\nWhile Markle was able to deal with the end of her personal social media accounts, her website, and her former fashion in private, the people who form the “ghosts” in her life haven’t stopped haunting her.\n\nMeghan Markle’s “Ghosts” Include People Who Betrayed Her\n\nE! News pointed to Meghan’s half-sister, Samantha, as an example of one of the ghosts from Markle’s past who she can’t escape. Markle’s relative alleged that Markle had always wanted to be a princess, labeling her a social climber. Samantha even began penning a memoir titled The Diary of Princess Pushy’s Sister and announced plans for a reality show.\n\nOne of the most hurtful “ghosts” from Meghan’s past, and the most shocking, however, is her former best friend, Ninaki Priddy. For 30 years, the two were like sisters, from growing up together to Priddy’s role as the maid of honor at Markle’s wedding to Hollywood producer Trevor Engleson.\n\nInvitations to the wedding of Prince Harry and Ms. Meghan Markle have been issued in the name of His Royal Highness The Prince of Wales. pic.twitter.com/jidwuYboon — Kensington Palace (@KensingtonRoyal) March 22, 2018\n\nBut as invitations to Meghan and Harry’s wedding are issued, Markle has been wounded by Ninaki spilling her secrets, pointed out E! News.\n\n“When [Meghan Markle’s former best friend] Ninaki started to spill stories of their intimate conversations, it was a betrayal that must have felt like a stab in the heart to Meghan. Ninaki [claims] she is a calculating manipulator who was so obsessed with Princess Diana she made it her aim to marry Di’s son.”\n\nMarkle’s concerns about what might be revealed or alleged about her past don’t end with the betrayal from her best friend, however. Biographer Andrew Morton, known for infuriating the Palace with his book Diana: Her True Story, is set to publish his version of Meghan’s life. Morton reportedly will portray Markle as intensely ambitious, driven to become a member of the royal family.\n\nThere’s one person in Meghan’s life who supports her, and that’s her future husband, Prince Harry. Harry previously said that when he found the right woman, he would “ensure we get to the point where we are actually comfortable with each other before the massive invasion into her privacy.” With that “invasion” currently taking place, it’s thought that Prince Harry will stand by Meghan no matter what those ghosts claim about his beloved bride.", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2018/04/Meghan-Markle-Prince-Harry-Ghosts.jpg", "https://secure.gravatar.com/avatar/fa8aa86244d76bf2aee7e2fb5b934ea3?s=250&d=mm&r=g", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://cdn.inquisitr.com/wp-content/uploads/2018/04/Prince-Harry-Meghan-Markle-Ghosts.jpg", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E"], "top_img": "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Joanne Eglash"], "canonical_link": "https://www.inquisitr.com/4856890/meghan-markle-haunted-by-past-amid-royal-wedding-plans-e-news-reveals-shocking-ghosts-who-betrayed-her/", "title": "Meghan Markle Reportedly Haunted By Past Amid Royal Wedding Plans: ‘E! News’ Reveals ‘Ghosts’ Who Betrayed Her", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}