{"url": "https://web.archive.org/web/20080906104758/http://www.johnmccain.com:80/informing/news/Speeches/ef046a10-706a-4dd5-bd01-b93b36b054bc.htm", "text": "John McCain's Acceptance Speech\n\n\n\n\n\nBy John McCain\n\nSeptember 5, 2008 Thank you all very much. Tonight, I have a privilege given few Americans -- the privilege of accepting our party's nomination for President of the United States. And I accept it with gratitude, humility and confidence.\n\n\n\nIn my life, no success has come without a good fight, and this nomination wasn't any different. That's a tribute to the candidates who opposed me and their supporters. They're leaders of great ability, who love our country, and wished to lead it to better days. Their support is an honor I won't forget.\n\n\n\nI'm grateful to the President for leading us in those dark days following the worst attack on American soil in our history, and keeping us safe from another attack many thought was inevitable; and to the First Lady, Laura Bush, a model of grace and kindness in public and in private. And I'm grateful to the 41st President and his bride of 63 years, and for their outstanding example of honorable service to our country.\n\n\n\n\n\n\n\nAs always, I'm indebted to my wife, Cindy, and my seven children. The pleasures of family life can seem like a brief holiday from the crowded calendar of our nation's business. But I have treasured them all the more, and can't imagine a life without the happiness you give me. Cindy said a lot of nice things about me tonight. But, in truth, she's more my inspiration than I am hers. Her concern for those less blessed than we are -- victims of land mines, children born in poverty and with birth defects -- shows the measure of her humanity. I know she will make a great First Lady.\n\n\n\nWhen I was growing up, my father was often at sea, and the job of raising my brother, sister and me would fall to my mother alone. Roberta McCain gave us her love of life, her deep interest in the world, her strength, and her belief we are all meant to use our opportunities to make ourselves useful to our country. I wouldn't be here tonight but for the strength of her character.\n\n\n\nMy heartfelt thanks to all of you, who helped me win this nomination, and stood by me when the odds were long. I won't let you down. To Americans who have yet to decide who to vote for, thank you for your consideration and the opportunity to win your trust. I intend to earn it.\n\n\n\nFinally, a word to Senator Obama and his supporters. We'll go at it over the next two months. That's the nature of these contests, and there are big differences between us. But you have my respect and admiration. Despite our differences, much more unites us than divides us. We are fellow Americans, an association that means more to me than any other. We're dedicated to the proposition that all people are created equal and endowed by our Creator with inalienable rights. No country ever had a greater cause than that. And I wouldn't be an American worthy of the name if I didn't honor Senator Obama and his supporters for their achievement.\n\n\n\nBut let there be no doubt, my friends, we're going to win this election. And after we've won, we're going to reach out our hand to any willing patriot, make this government start working for you again, and get this country back on the road to prosperity and peace.\n\n\n\nThese are tough times for many of you. You're worried about keeping your job or finding a new one, and are struggling to put food on the table and stay in your home. All you ever asked of government is to stand on your side, not in your way. And that's just what I intend to do: stand on your side and fight for your future.\n\n\n\nAnd I've found just the right partner to help me shake up Washington, Governor Sarah Palin of Alaska. She has executive experience and a real record of accomplishment. She's tackled tough problems like energy independence and corruption. She's balanced a budget, cut taxes, and taken on the special interests. She's reached across the aisle and asked Republicans, Democrats and Independents to serve in her administration. She's the mother of five children. She's helped run a small business, worked with her hands and knows what it's like to worry about mortgage payments and health care and the cost of gasoline and groceries.\n\n\n\nShe knows where she comes from and she knows who she works for. She stands up for what's right, and she doesn't let anyone tell her to sit down. I'm very proud to have introduced our next Vice President to the country. But I can't wait until I introduce her to Washington. And let me offer an advance warning to the old, big spending, do nothing, me first, country second Washington crowd: change is coming.\n\n\n\nI'm not in the habit of breaking promises to my country and neither is Governor Palin. And when we tell you we're going to change Washington, and stop leaving our country's problems for some unluckier generation to fix, you can count on it. We've got a record of doing just that, and the strength, experience, judgment and backbone to keep our word to you.\n\n\n\nYou know, I've been called a maverick; someone who marches to the beat of his own drum. Sometimes it's meant as a compliment and sometimes it's not. What it really means is I understand who I work for. I don't work for a party. I don't work for a special interest. I don't work for myself. I work for you.\n\n\n\nI've fought corruption, and it didn't matter if the culprits were Democrats or Republicans. They violated their public trust, and had to be held accountable. I've fought big spenders in both parties, who waste your money on things you neither need nor want, while you struggle to buy groceries, fill your gas tank and make your mortgage payment. I've fought to get million dollar checks out of our elections. I've fought lobbyists who stole from Indian tribes. I fought crooked deals in the Pentagon. I fought tobacco companies and trial lawyers, drug companies and union bosses.\n\n\n\nI fought for the right strategy and more troops in Iraq, when it wasn't a popular thing to do. And when the pundits said my campaign was finished, I said I'd rather lose an election than see my country lose a war.\n\n\n\nThanks to the leadership of a brilliant general, David Petreaus, and the brave men and women he has the honor to command, that strategy succeeded and rescued us from a defeat that would have demoralized our military, risked a wider war and threatened the security of all Americans.\n\n\n\nI don't mind a good fight. For reasons known only to God, I've had quite a few tough ones in my life. But I learned an important lesson along the way. In the end, it matters less that you can fight. What you fight for is the real test.\n\n\n\nI fight for Americans. I fight for you. I fight for Bill and Sue Nebe from Farmington Hills, Michigan, who lost their real estate investments in the bad housing market. Bill got a temporary job after he was out of work for seven months. Sue works three jobs to help pay the bills.\n\n\n\nI fight for Jake and Toni Wimmer of Franklin County, Pennsylvania. Jake works on a loading dock; coaches Little League, and raises money for the mentally and physically disabled. Toni is a schoolteacher, working toward her Master's Degree. They have two sons, the youngest, Luke, has been diagnosed with autism. Their lives should matter to the people they elect to office. They matter to me.\n\n\n\nI fight for the family of Matthew Stanley of Wolfboro, New Hampshire, who died serving our country in Iraq. I wear his bracelet and think of him every day. I intend to honor their sacrifice by making sure the country their son loved so well and never returned to, remains safe from its enemies.\n\n\n\nI fight to restore the pride and principles of our party. We were elected to change Washington, and we let Washington change us. We lost the trust of the American people when some Republicans gave in to the temptations of corruption. We lost their trust when rather than reform government, both parties made it bigger. We lost their trust when instead of freeing ourselves from a dangerous dependence on foreign oil, both parties and Senator Obama passed another corporate welfare bill for oil companies. We lost their trust, when we valued our power over our principles.\n\n\n\nWe're going to change that. We're going to recover the people's trust by standing up again for the values Americans admire. The party of Lincoln, Roosevelt and Reagan is going to get back to basics.\n\n\n\nWe believe everyone has something to contribute and deserves the opportunity to reach their God-given potential from the boy whose descendents arrived on the Mayflower to the Latina daughter of migrant workers. We're all God's children and we're all Americans.\n\n\n\nWe believe in low taxes; spending discipline, and open markets. We believe in rewarding hard work and risk takers and letting people keep the fruits of their labor.\n\n\n\nWe believe in a strong defense, work, faith, service, a culture of life, personal responsibility, the rule of law, and judges who dispense justice impartially and don't legislate from the bench. We believe in the values of families, neighborhoods and communities.\n\n\n\nWe believe in a government that unleashes the creativity and initiative of Americans. Government that doesn't make your choices for you, but works to make sure you have more choices to make for yourself.\n\n\n\nI will keep taxes low and cut them where I can. My opponent will raise them. I will open new markets to our goods and services. My opponent will close them. I will cut government spending. He will increase it.\n\n\n\nMy tax cuts will create jobs. His tax increases will eliminate them. My health care plan will make it easier for more Americans to find and keep good health care insurance. His plan will force small businesses to cut jobs, reduce wages, and force families into a government run health care system where a bureaucrat stands between you and your doctor.\n\n\n\nKeeping taxes low helps small businesses grow and create new jobs. Cutting the second highest business tax rate in the world will help American companies compete and keep jobs from moving overseas. Doubling the child tax exemption from $3500 to $7000 will improve the lives of millions of American families. Reducing government spending and getting rid of failed programs will let you keep more of your own money to save, spend and invest as you see fit. Opening new markets and preparing workers to compete in the world economy is essential to our future prosperity.\n\n\n\nI know some of you have been left behind in the changing economy and it often seems your government hasn't even noticed. Government assistance for unemployed workers was designed for the economy of the 1950s. That's going to change on my watch. My opponent promises to bring back old jobs by wishing away the global economy. We're going to help workers who've lost a job that won't come back, find a new one that won't go away.\n\n\n\nWe will prepare them for the jobs of today. We will use our community colleges to help train people for new opportunities in their communities. For workers in industries that have been hard hit, we'll help make up part of the difference in wages between their old job and a temporary, lower paid one while they receive retraining that will help them find secure new employment at a decent wage.\n\n\n\nEducation is the civil rights issue of this century. Equal access to public education has been gained. But what is the value of access to a failing school? We need to shake up failed school bureaucracies with competition, empower parents with choice, remove barriers to qualified instructors, attract and reward good teachers, and help bad teachers find another line of work.\n\n\n\nWhen a public school fails to meet its obligations to students, parents deserve a choice in the education of their children. And I intend to give it to them. Some may choose a better public school. Some may choose a private one. Many will choose a charter school. But they will have that choice and their children will have that opportunity.\n\n\n\nSenator Obama wants our schools to answer to unions and entrenched bureaucracies. I want schools to answer to parents and students. And when I'm President, they will.\n\n\n\nMy fellow Americans, when I'm President, we're going to embark on the most ambitious national project in decades. We are going to stop sending $700 billion a year to countries that don't like us very much. We will attack the problem on every front. We will produce more energy at home. We will drill new wells offshore, and we'll drill them now. We will build more nuclear power plants. We will develop clean coal technology. We will increase the use of wind, tide, solar and natural gas. We will encourage the development and use of flex fuel, hybrid and electric automobiles.\n\n\n\nSenator Obama thinks we can achieve energy independence without more drilling and without more nuclear power. But Americans know better than that. We must use all resources and develop all technologies necessary to rescue our economy from the damage caused by rising oil prices and to restore the health of our planet. It's an ambitious plan, but Americans are ambitious by nature, and we have faced greater challenges. It's time for us to show the world again how Americans lead.\n\n\n\nThis great national cause will create millions of new jobs, many in industries that will be the engine of our future prosperity; jobs that will be there when your children enter the workforce.\n\n\n\nToday, the prospect of a better world remains within our reach. But we must see the threats to peace and liberty in our time clearly and face them, as Americans before us did, with confidence, wisdom and resolve.\n\n\n\nWe have dealt a serious blow to al Qaeda in recent years. But they are not defeated, and they'll strike us again if they can. Iran remains the chief state sponsor of terrorism and on the path to acquiring nuclear weapons. Russia's leaders, rich with oil wealth and corrupt with power, have rejected democratic ideals and the obligations of a responsible power. They invaded a small, democratic neighbor to gain more control over the world's oil supply, intimidate other neighbors, and further their ambitions of reassembling the Russian empire. And the brave people of Georgia need our solidarity and prayers. As President I will work to establish good relations with Russia so we need not fear a return of the Cold War. But we can't turn a blind eye to aggression and international lawlessness that threatens the peace and stability of the world and the security of the American people.\n\n\n\nWe face many threats in this dangerous world, but I'm not afraid of them. I'm prepared for them. I know how the military works, what it can do, what it can do better, and what it should not do. I know how the world works. I know the good and the evil in it. I know how to work with leaders who share our dreams of a freer, safer and more prosperous world, and how to stand up to those who don't. I know how to secure the peace.\n\n\n\nWhen I was five years old, a car pulled up in front of our house. A Navy officer rolled down the window, and shouted at my father that the Japanese had bombed Pearl Harbor. I rarely saw my father again for four years. My grandfather came home from that same war exhausted from the burdens he had borne, and died the next day. In Vietnam, where I formed the closest friendships of my life, some of those friends never came home with me. I hate war. It is terrible beyond imagination.\n\n\n\nI'm running for President to keep the country I love safe, and prevent other families from risking their loved ones in war as my family has. I will draw on all my experience with the world and its leaders, and all the tools at our disposal -- diplomatic, economic, military and the power of our ideals -- to build the foundations for a stable and enduring peace.\n\n\n\nIn America, we change things that need to be changed. Each generation makes its contribution to our greatness. The work that is ours to do is plainly before us. We don't need to search for it.\n\n\n\nWe need to change the way government does almost everything: from the way we protect our security to the way we compete in the world economy; from the way we respond to disasters to the way we fuel our transportation network; from the way we train our workers to the way we educate our children. All these functions of government were designed before the rise of the global economy, the information technology revolution and the end of the Cold War. We have to catch up to history, and we have to change the way we do business in Washington.\n\n\n\nThe constant partisan rancor that stops us from solving these problems isn't a cause, it's a symptom. It's what happens when people go to Washington to work for themselves and not you.\n\n\n\nAgain and again, I've worked with members of both parties to fix problems that need to be fixed. That's how I will govern as President. I will reach out my hand to anyone to help me get this country moving again. I have that record and the scars to prove it. Senator Obama does not.\n\n\n\nInstead of rejecting good ideas because we didn't think of them first, let's use the best ideas from both sides. Instead of fighting over who gets the credit, let's try sharing it. This amazing country can do anything we put our minds to. I will ask Democrats and Independents to serve with me. And my administration will set a new standard for transparency and accountability.\n\n\n\nWe're going to finally start getting things done for the people who are counting on us, and I won't care who gets the credit.\n\n\n\nI've been an imperfect servant of my country for many years. But I have been her servant first, last and always. And I've never lived a day, in good times or bad, that I didn't thank God for the privilege.\n\n\n\nLong ago, something unusual happened to me that taught me the most valuable lesson of my life. I was blessed by misfortune. I mean that sincerely. I was blessed because I served in the company of heroes, and I witnessed a thousand acts of courage, compassion and love.\n\n\n\nOn an October morning, in the Gulf of Tonkin, I prepared for my 23rd mission over North Vietnam. I hadn't any worry I wouldn't come back safe and sound. I thought I was tougher than anyone. I was pretty independent then, too. I liked to bend a few rules, and pick a few fights for the fun of it. But I did it for my own pleasure; my own pride. I didn't think there was a cause more important than me.\n\n\n\nThen I found myself falling toward the middle of a small lake in the city of Hanoi, with two broken arms, a broken leg, and an angry crowd waiting to greet me. I was dumped in a dark cell, and left to die. I didn't feel so tough anymore. When they discovered my father was an admiral, they took me to a hospital. They couldn't set my bones properly, so they just slapped a cast on me. When I didn't get better, and was down to about a hundred pounds, they put me in a cell with two other Americans. I couldn't do anything. I couldn't even feed myself. They did it for me. I was beginning to learn the limits of my selfish independence. Those men saved my life.\n\n\n\nI was in solitary confinement when my captors offered to release me. I knew why. If I went home, they would use it as propaganda to demoralize my fellow prisoners. Our Code said we could only go home in the order of our capture, and there were men who had been shot down before me. I thought about it, though. I wasn't in great shape, and I missed everything about America. But I turned it down.\n\n\n\nA lot of prisoners had it worse than I did. I'd been mistreated before, but not as badly as others. I always liked to strut a little after I'd been roughed up to show the other guys I was tough enough to take it. But after I turned down their offer, they worked me over harder than they ever had before. For a long time. And they broke me.\n\n\n\nWhen they brought me back to my cell, I was hurt and ashamed, and I didn't know how I could face my fellow prisoners. The good man in the cell next door, my friend, Bob Craner, saved me. Through taps on a wall he told me I had fought as hard as I could. No man can always stand alone. And then he told me to get back up and fight again for our country and for the men I had the honor to serve with. Because every day they fought for me.\n\n\n\nI fell in love with my country when I was a prisoner in someone else's. I loved it not just for the many comforts of life here. I loved it for its decency; for its faith in the wisdom, justice and goodness of its people. I loved it because it was not just a place, but an idea, a cause worth fighting for. I was never the same again. I wasn't my own man anymore. I was my country's.\n\n\n\nI'm not running for president because I think I'm blessed with such personal greatness that history has anointed me to save our country in its hour of need. My country saved me. My country saved me, and I cannot forget it. And I will fight for her for as long as I draw breath, so help me God.\n\n\n\nIf you find faults with our country, make it a better one. If you're disappointed with the mistakes of government, join its ranks and work to correct them. Enlist in our Armed Forces. Become a teacher. Enter the ministry. Run for public office. Feed a hungry child. Teach an illiterate adult to read. Comfort the afflicted. Defend the rights of the oppressed. Our country will be the better, and you will be the happier. Because nothing brings greater happiness in life than to serve a cause greater than yourself.\n\n\n\nI'm going to fight for my cause every day as your President. I'm going to fight to make sure every American has every reason to thank God, as I thank Him: that I'm an American, a proud citizen of the greatest country on earth, and with hard work, strong faith and a little courage, great things are always within our reach. Fight with me. Fight with me.\n\n\n\nFight for what's right for our country.\n\n\n\nFight for the ideals and character of a free people.\n\n\n\nFight for our children's future.\n\n\n\nFight for justice and opportunity for all.\n\n\n\nStand up to defend our country from its enemies.\n\n\n\nStand up for each other; for beautiful, blessed, bountiful America.\n\n\n\nStand up, stand up, stand up and fight. Nothing is inevitable here. We're Americans, and we never give up. We never quit. We never hide from history. We make history.\n\n\n\nThank you, and God Bless you.", "images": ["https://web.archive.org/web/20080906104758im_/http://images.johnmccain.com/Images/news/icons/icons_arrow.gif", "https://web.archive.org/web/20080906104758im_/http://www.johnmccain.com/informing/news/Speeches/spacer.gif", "https://web.archive.org/web/20080906104758im_/http://www.johnmccain.com/Images/HP3/sb_events.gif", "https://web.archive.org/web/20080906104758im_/http://www.johnmccain.com/Images/About/JSM/0904_JSM_SPEECH_2.jpg", "https://web.archive.org/web/20080906104758im_/http://www.johnmccain.com/Images/HP3/sb_news.gif", "https://web.archive.org/web/20080906104758im_/http://images.johnmccain.com/Images/news/icons/icons_videos.gif", "https://web.archive.org/web/20080906104758im_/http://images.johnmccain.com/Images/news/icons/icons_news.gif", "https://web.archive.org/web/20080906104758im_/http://www.johnmccain.com/Images/HP3/hp3_lo_logo.jpg", "https://web.archive.org/web/20080906104758im_/http://www.johnmccain.com/images/news/newsbox_picture.jpg", "https://web.archive.org/web/20080906104758im_/http://www.johnmccain.com/Images/HP3/hp3_lo_esp.jpg", "https://web.archive.org/web/20080906104758im_/http://www.johnmccain.com/Images/About/JSM/0904_JSM_SPEECH_3.jpg", "https://web.archive.org/web/20080906104758im_/http://www.johnmccain.com/Images/About/JSM/0904_JSM_SPEECH_1.jpg", "https://web.archive.org/web/20080906104758im_/http://images.johnmccain.com/Images/news/icons/icons_topics.gif", "https://web.archive.org/web/20080906104758im_/http://images.johnmccain.com/Images/button_search2.jpg", "https://web.archive.org/web/20080906104758im_/http://images.johnmccain.com/Images/spacer.gif"], "top_img": "https://web.archive.org/web/20080906104758im_/http://www.johnmccain.com/Images/About/JSM/0904_JSM_SPEECH_3.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "McCain-Palin 2008", "meta_data": {"description": "John McCain 2008 - The Official Website of John McCain's 2008 Campaign for President", "keywords": "John McCain, McCain, mccain for president, John S. McCain, McCain 2008, president, presidential, 2008, campaign, election, straight talk, straight talk express, politics, political, john mccain, john mccain for president, senator john mccain, sen. john mccain, cindy mccain, john mcain, john mckaine, john maccane, jon mccain, john maccaine, john mccaine, mccain 2008, johnmccain.com, senator mccain, mccain 2000, mccain campaign, mccain hq, exploremccain.com, explore mccain, mccain exploratory committee, mccain exploratory"}, "movies": ["http://www.youtube.com/v/OrlkcMOMhrQ&hl=en&fs=1"], "publish_date": null, "source": "https://web.archive.org", "summary": ""}