{"url": "www.newidea.com.au/jennifer-aniston-confronts-brad-pitt-new-girlfriend-neri-oxman", "text": "Amid reports that Brad Pitt, 54, is ‘smitten’ with glamorous architect Neri Oxman, the 49-year-old actress isn’t giving up on him – as New Idea can exclusively reveal.\n\n‘Jen is going to fight for Brad, plain and simple,’ says a friend close to the actress. ‘When Ange stole Brad from her, Jen feels she just sat back and did nothing, and pretty much gave in straight away. She didn’t fight for her marriage last time – but that’s not going to happen this time around.’\n\nAccording to recent reports, after meeting one another at an event, Brad and Neri ‘got romantically involved almost straight away’ and were ‘very much a couple’.\n\nJen also very much ‘hates the fact that Neri reminds her so much of Angelina Jolie.'\n\nBrad has denied the claims and told Jen that they’re just good friends, but Jen is less naive now and is determined not to let another woman come between them.\n\n‘She’s older and stronger now, she’s not going to let Neri stop her from finally having her happily ever after with Brad. She’s determined that nothing will get in the way of her happiness,’ the source added.\n\nBefore, sources told New Idea that Jen was ‘keeping her distance’ from Brad, but now the Friends star is making it clear to Neri she has to back off.\n\n‘Last weekend she went and saw Neri, and had a face-to-face with her. It was very calm and there was no big fight, but Jen was firm with Neri and told her to stay away from Brad and not come between them,’ the insider continued.\n\n‘Neri was taken aback and denied that she was trying to steal Brad, but Jen just remained strong and stood her ground. She doesn’t care what Neri’s intentions are – she just wants Brad and her to be together, without any distractions.’\n\nStrangely enough, Jen was seen wearing an arm brace last week while attending Gwyneth Paltrow’s engagement party in LA. She kept her reasons quiet on why she was wearing it, leaving onlookers confused.\n\nBrad hit it off with Neri, as they share the same passion for architecture, design and art, but Jen is not going to let history repeat itself this time and wants nothing to stand in the way of her wedding day.\n\nJen, who announced her split from her husband Justin Theroux in February, has reportedly been to Brad’s hometown in Missouri to meet Brad’s childhood pastor, Reverend Swadley, recently.\n\nA friend of the pastor told New Idea that the reverend spoke at length with Brad and Jen about getting married as soon as possible.\n\n‘Reverend Swadley revealed how in love Brad and Jen were and how they planned to officially wed as soon as their divorces were finalised, with him agreeing to conduct the ceremony and welcome them back into the church,’ the friend claimed.\n\n‘He said Jen kept on saying how grateful she was that they had been brought back together,’ the insider added.\n\nThe question is, will Neri put a spanner in the works?\n\nYoung, smart and beautiful, Jen is ‘jealous’ of Neri and friends say she doesn’t want to lose Brad for a second time.\n\n‘Jen desperately wants her renewed relationship with Brad to work, but at the same time, she can’t be dumped by Brad twice,’ a source told New Idea.\n\n‘She barely recovered the first time and she fears it will destroy her for good if Brad leaves her for another woman.’\n\nFor the full story see this weeks issue of New Idea - out now!", "images": ["http://www.newidea.com.au/Branding/newidea/images/brand-logo-gray.svg", "https://snowplow.swm.digital/i?e=se&se_ca=ping&tv=http-get-0.1.0&dtm=0&stm=0&tna=pac&p=web", "http://www.newidea.com.au/media/26155/jen-confronts-neri.jpg", "http://www.newidea.com.au/media/73139/ni4619_cover_nobc_bws.png?height=158", "http://www.newidea.com.au/Branding/newidea/Images/idm-error-icon.svg", "http://www.newidea.com.au/Branding/newidea/images/gmail.svg", "http://secure-gl.imrworldwide.com/cgi-bin/m?ci=au-pacmags&cg=0&cc=1&ts=noscript", "http://www.newidea.com.au/Branding/NewIdea/images/brand-logo-footer-new.svg", "http://www.newidea.com.au/Branding/newidea/images/idm-thanks-icon.svg", "http://www.newidea.com.au/Branding/NewIdea/images/enhanced-header-logo.svg"], "top_img": "http://www.newidea.com.au/media/26155/jen-confronts-neri.jpg", "keywords": [], "authors": ["Faye James", "Faye James Is A Regular Contributor At New Idea", "Who", "Practical Parenting", "Works Across Health", "Beauty", "Celebrity", "Royal Content. She Has Over Years Of Experience Spanning Across The Uk", "Middle East"], "canonical_link": "https://www.newidea.com.au/jennifer-aniston-confronts-brad-pitt-new-girlfriend-neri-oxman", "title": "Jennifer Aniston confronts Neri: ‘Stay away from Brad!’", "meta_data": {"language": "en-us", "description": "Jennifer Aniston has made a brave step to hold onto her man.", "news_keywords": "Jennifer Aniston, Brad Pitt, Jennifer Aniston and Brad Pitt back together, Neri Oxman, Brad Pitt and Neri Oxman, Jen Aniston, Jen, Jen and Brad, Neri Oxman Brad Pitt smitten, Photos brad pitt new girlfriend, celebrity gossip, celeb gossip, latest celeb gossip, latest celebrity gossip, Brad and Jen wedding", "robots": "index, follow", "og": {"site_name": "New Idea", "type": "article", "url": "https://www.newidea.com.au/jennifer-aniston-confronts-brad-pitt-new-girlfriend-neri-oxman", "title": "Jennifer Aniston confronts Neri: ‘Stay away from Brad!’", "description": "Jennifer Aniston has made a brave step to hold onto her man.", "image": {"identifier": "http://www.newidea.com.au/media/26155/jen-confronts-neri.jpg", "width": 1500, "height": 1000}}, "twitter": {"title": "Jennifer Aniston confronts Brad Pitt's rumoured girlfriend Neri Oxman: ‘Stay away from Brad!’", "description": "Jennifer Aniston has made a brave step to hold onto her man.", "image": "http://www.newidea.com.au/media/26155/jen-confronts-neri.jpg", "url": "https://www.newidea.com.au/jennifer-aniston-confronts-brad-pitt-new-girlfriend-neri-oxman"}, "fb": {"admins": 863618607005758, "pages": 140279489324860}, "msvalidate.01": "3BD3CB44DC500E9821E82E085D0F0D13", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1524436351.165, "source": "http://www.newidea.com.au", "summary": ""}