{"url": "https://uproxx.com/prowrestling/total-bellas-season-2-episode-5-recap/", "text": "\n\nPreviously on Total Bellas: JJ was once again the absolute worst, John Cena wouldn’t share confidential death-related information with Nikki, and no one wanted to treat Mama Bella like a human being. Surely things will be drastically different this time around!\n\nAnd now, the five most ridiculous, bizarre, and baffling moments of season two, episode five of Total Bellas.\n\nSome preggers yogs\n\nWe get a very good opening this week, as Nikki is doing yoga in the yard with a friend, and Brie drops by in a bikini. The other two women marvel at how unreal Brie’s body looks at this stage in her pregnancy (their words, not mine), and Brie complains about not being able to see over her belly, so at this point her bikini line is a haphazard shave job.\n\nThen Brie gets encouraged to do some “yogs” with them, and it turns out you lose flexibility when pregnant! Who knew?\n\nHow deep can you plant your seed?\n\nThe clan of Kathy, John Laurinaitis, Brie, Bryan, Nikki and JJ head up to Sonoma to spend some time at another palatial estate and officially launch the Bella’s wine, Belle Radici. On their first afternoon there, Bryan brings up that he’s thinking of getting into a business of his own: a seed box, where each month gardeners (or prospective gardeners) are sent a box of fine seeds, with instructions for planting and best practices for successful gardening.\n\nFirst of all, this is a great idea, and a great fit for Bryan, but Nikki tries to get some single entendres going by suggestively saying “How deep can you plant your seeds?” Bryan points out that she shouldn’t pluralize it if she really wants to make it dirty. This was every bit as good as a bit later in the episode, when Nikki is trying to start a family race, but keeps mixing up the order of a combination of “On your marks, get set, go” and “Get ready, get set, go.”\n\nEveryone is an asshole to Kathy\n\nWhile Bryan is talking about his seed business, he asks Kathy for advice, and everyone starts clowning on Kathy for various reasons. Elsewhere in the episode, Kathy attempts to offer the twins advice for their wine business, but they basically blow her off and clown on her some more. Basically, no one really takes seriously the fact that she started her own business and has been running it successfully for 19 years.\n\nCombined with the steady mockery of Kathy all season to this point, things finally reach a breaking point when Kathy snaps after being clowned on once too often and for too long. Bryan and Johnny Ace both point out from an outsider’s perspective that sometimes a line gets crossed and you gotta stop or reel it in. Bryan gets choked up talking about Kathy’s frustrations at just wanting to be a good parent and not an embarrassment, because he equates it to what his late father felt.\n\nThis is possibly the realest the Total franchise has ever gotten and it was mad intense. We all clown on our mothers from time to time, probably. But maybe … we shouldn’t? I’ll have to get back to you on that one.\n\n", "images": ["https://uproxx.com/wp-content/uploads/2020/04/moxley-chair-aew.jpg?w=328&h=185&crop=1", "https://sb.scorecardresearch.com/p?c1=2&c2=8430760&c3=&c4=&c5=&c6=&c15=&cj=1", "https://uproxx.com/wp-content/themes/uproxx/assets/images/logo-prowrestling.png?v=1.0.8", "https://uproxx.com/wp-content/uploads/2020/04/smackdown-triple-threat.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2020/03/royal-rumble-1999-logo.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2020/04/braun-strowman-black-sheep.jpg?w=328&h=185&crop=1", "https://pixel.quantserve.com/pixel/p-73t-O7FWprUTo.gif", "https://uproxx.com/wp-content/uploads/2020/04/charlotte-flair-smackdown-2020-grid.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2019/07/peoples-party-2.jpg?w=719&h=272&crop=1", "https://uproxx.com/wp-content/uploads/2017/10/kathy-bella-crying.jpg?w=650", "https://uproxx.com/wp-content/uploads/2020/04/timothy-thatcher-nxt-debut.jpg?w=328&h=185&crop=1"], "top_img": "https://uproxx.com/wp-content/uploads/2017/10/kathy-bella-crying.jpg?w=650", "keywords": [], "authors": ["Bill Hanstock", "Brandon Stroud", "Emily Pratt", "Contributing Writer"], "canonical_link": "https://uproxx.com/prowrestling/total-bellas-season-2-episode-5-recap/", "title": "The Most Outrageous ‘Total Bellas’ Moments Of The Week", "meta_data": {"description": "In this episode, JJ installs a fart machine and almost grievously injures his sister.", "keywords": "prowrestling, sports, tv, total bellas, total divas", "viewport": "width=device-width, initial-scale=1", "robots": "index,follow", "twitter": {"card": "summary_large_image", "site": "@UPROXX", "creator": "@UPROXX", "widgets": {"csp": "on"}, "title": "The Most Outrageous ‘Total Bellas’ Moments Of The Week"}, "google-site-verification": "370ZQZwYhpp3OFLpudIZ11ONRN8X1ZhGglPMAFJ6GKw", "qc": {"post": "total-bellas-season-2-episode-5-recap", "author": "Bill Hanstock", "section": "prowrestling", "primary_tag": "total-bellas"}, "generator": "WordPress 5.4", "og": {"type": "article", "title": "The Most Outrageous ’Total Bellas’ Moments Of The Week", "url": "https://uproxx.com/prowrestling/total-bellas-season-2-episode-5-recap/", "description": "In this episode, JJ installs a fart machine and almost grievously injures his sister.", "site_name": "UPROXX", "image": {"identifier": "https://uproxx.com/wp-content/uploads/2017/10/kathy-bella-crying.jpg?w=650", "width": 650, "height": 400}, "locale": {"identifier": "en_US", "alternate": "en_GB"}}, "article": {"published_time": "2017-10-05T15:15:00+00:00", "modified_time": "2019-03-19T13:47:59+00:00", "publisher": "https://www.facebook.com/UPROXX"}, "fb": {"admins": "680207693,2208604", "app_id": 117400151618132, "pages": 116548701336}}, "movies": [], "publish_date": 1507216500.0, "source": "https://uproxx.com", "summary": ""}