{"url": "http://www.papermag.com/hottest-young-royals-2449263049.html", "text": "The world is having a major royal moment. The 20th anniversary of Diana, Princess of Wales' death approaches at the end of this month, spurring memorials and retrospectives. Sons William and Harry's documentary Diana, Our Mother: Her Life and Legacy has had an overwhelmingly positive response. As we reminisce over that magical royal wedding so long ago our minds have turned to the new generation of up-and-coming royals. We asked our favorite royal expert Marlene Eilers Koenig of the Royal Musings blog for her choices on the hottest young aristocrats. Below are ten blue bloods to watch (and name drop to prove you're more than just a bandwagon Harry and Wills royal-watcher).\n\nPrincess Victoria Elisabeth\n\n\n\nJust 20, Princess Victoria Elisabeth of Hohenlohe-Langenburg has a German title but is very much a Spanish noblewoman. In 2016, she succeeded her maternal grandmother as the tenth Countess of Ofalia. A quiet, reflective young woman, Victoria is awaiting the confirmation that she will be named as her late father's successor as Duchess of Medinaceli, one of Spain's most prestigious titles.\n\nPrince Donatus of Schaumburg-Lippe\n\nClemens Bilan/Getty\n\nHereditary Prince Heinrich Donatus of Schaumburg-Lippe's maxim \"Extravagance is necessary\" seems a bit off as the heir to his father, Alexander, the Prince of Schaumburg-Lippe, and the fabulous Schloss Bückeburg. The 23-year-old prince is said to be the first German to pass the commissioning course at the Royal Military Academy at Sandhurst, where he rose to troop leader in Her Majesty's Cavalry Life Guards. The prince was a child when his parents – his mother is Princess Marie Louise \"Lily\" of Sayn-Wittgenstein-Berleburg -- divorced and Heinrich and his mother moved to Munich. Both parents remarried (and divorced their second spouses, as well), but Heinrich seems unfazed. He is an active supporter of InterHelp, German Society of International Aid, of which his father is the Patron. He and his mother have joined forces to support InterHelp and Save the Children. Last year, they ran an ultra-marathon in Bulgaria, and in July, the duo took part in the Mongol Rally, a car race from London to Ulaan-UIde in norther Mongolia. Heinrich Donatus, who speaks five languages, understands the importance of doing good for others. His motto is \"I have always set myself ambitious goals – and I intend to succeed in them.\"\n\nLady Amelia Windsor\n\nMike Marsland/Getty\n\nLady Amelia Windsor is 20 years old and said to be the most beautiful member of the British royal family. She is the youngest of the three children of the Earl and Countess of St. Andrews. The Earl is the elder son and heir to the Duke of Kent, first cousin to Queen Elizabeth II. Lady Amelia is doing double duty as a model – she recently signed with Storm Models, which launched Kate Moss – and is in her final year at Edinburgh where she is completing a degree in Italian and French.\n\nGeorge John Godolphin Spencer-Churchill\n\nChris Jackson/Getty\n\nGeorge John Godolphin Spencer-Churchill, 22, is the Marquess of Blanford & heir to his father, the Duke of Marlborough. An Old Harrovian, Lord Blandford has \"devilishly good looks\" and a degree in Urbanization. The good looks may help a bit in his chosen sport, polo. He has played for England's National Team and has his own team, Blenheim Palace, at Circencester Park. A Brand Ambassador for La Martina, the Marlborough scion hopes to play polo for a long time.\n\nLouis Spencer\n\n\n\nDavid M. Bennett/Getty\n\nLouis Spencer, better known as Viscount Althorp, is the heir apparent to his father's earldom (Spencer) and the historic Althorp estate. A University of Edinburgh student, Lord Althorp will go through life with the description as Princess Diana's nephew. The Duke of Cambridge is his first cousin. He is fond of London's nightlife, and in 2015 jokingly proposed marriage to singer Nicki Minaj. Now 23, Lord Althorp is at the center of London's high life, due to his title, his inheritance, and, of course, his good looks.\n\nPrince Joseph Wenzel\n\nHSH Prince Joseph Wenzel of Liechtenstein, 22, will never have to worry about whether he has enough money in his wallet, thanks to the family-owned LGT Bank. He is second in line to his grandfather, Hans Adam, the Prince of Liechtenstein, which is one of Europe's wealthiest royal families. The princely family's portfolio also includes property and a fab art collection. The British-educated prince took some time off before university, reportedly Yale or Harvard.\n\nPrince Constantine Alexios\n\n18-year old HRH Prince Constantine Alexios of Greece is already a heart throb thanks to his shirtless images on Instagram. Tino is the second but eldest son of five children of Crown Prince Pavlos of Greece and his immensely wealthy wife, Marie Chantal Miller, whose father made a fortune in airport duty free shops. Grandpa is King Constantine II, whose reign came to an end after a plebiscite in 1973. Thanks to close ties with the British royal family – the Duke of Cambridge is Tino's godfather – Tino moves in all the right circles. He attended the posh Wellington College, and is now preparing to attend university. His life is about to come full circle. Tino was born in New York City, but his parents moved to London in 2004. They are now moving back to an apartment on Madison Avenue. Expect Tino to follow and attend an American university, like his older sister, Princess Olympia, who is a student at Parsons.\n\nDom Afonso de Santa Maria\n\nAfonso of Portugal, Prince of Beira, at 21 is an Iberian stunner and the heir to Portugal's throne. Okay, Portugal has not been a monarchy since 1910, but if it were still a monarchy, Afonso's father, the Duke of Braganza, would be the king, and the blue-eyed hunky young prince would be the heir apparent. The Duke and Duchess of Braganza attend many official events in Portugal, and Afonso is expected to add to his royal portfolio after completing his education at the University of Lusíada , where he is said to be studying political science.\n\n\n\nLady Viola Grosvenor\n\nTim Whitby/Getty\n\nLady Viola Grosvenor, 24, has no plans for the debutante route. The younger sister of the seventh Duke of Westminster (who succeeded to the title last year following the death of their father, the sixth Duke) Although she spent last summer at festivals where she was \"kitted out in tight tie-dye, face covered in glitter,\" she wants to pursue a career in art therapy, and start her own charity to help young people. Lady Viola already devotes time to charities, including Kidscape, an anti-bullying charities, that receive funding from the Westminster Foundation, which represents the \"philanthropic activities\" of the Grosvenor family.\n\nPrincess Larissa\n\nElisabetta A. Valli/Getty\n\n20 year old Princess Larissa of Windisch-Graetz has the inherited both her parents' good looks. She is the youngest and only daughter of Mariano Hugo, the Prince of Windisch-Graetz, and Archduchess Sophie of Austria. She made her debut in 2014 at the annual Bal des Debutantes in Paris, where, naturally, she wore Valentino, who happens to be a good friend of Archduchess Sophie. When the famed designer learned that Larissa was attending the invitation-only ball, he selected a gown for her from his latest collection. She has been described as a \"princess from a storybook,\" thanks to her long blonde curls, \"huge blue eyes and perfect milky-white skin.\" No doubt, this young Italian princess will become one of the most popular Euro royals in the next few years.", "images": ["https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMjkxNjA2MC9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTYxMDA0OTU5OH0.rYThD-dZhqCLlCr9t84OtVkAbcNe-LUOKhiSAtQca8c/img.png?width=293&height=54", "https://www.facebook.com/tr?id=547949808911864&ev=PageView&noscript=1", "http://b.scorecardresearch.com/p?cv=2.0&cj=1&c1=2&c2=28245967&c6=Famous+People&c8=Who+Are+the+Hottest+Young+Royals+and+Artistocrats%3F", "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8xMDI1ODE0NC9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTYzMzI3NTgzOH0.XrNkRRMz85MpTRHteD52J4DxCJl2b9wHnE8KnyO4rKY/img.png?width=1200&coordinates=0%2C0%2C0%2C112&height=600", "https://assets.rbl.ms/22935136/origin.png"], "top_img": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8xMDI1ODE0NC9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTYzMzI3NTgzOH0.XrNkRRMz85MpTRHteD52J4DxCJl2b9wHnE8KnyO4rKY/img.png?width=1200&coordinates=0%2C0%2C0%2C112&height=600", "keywords": [], "authors": ["Mickey Boardman", "Jasmine Ting", "Eda Yu"], "canonical_link": "https://www.papermag.com/hottest-young-royals-2449263049.html", "title": "Who Are the Hottest Young Royals?", "meta_data": {"twitter": {"card": "summary_large_image", "site": "@", "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8xMDI1ODE0NC9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTYzMzI3NTgzOH0.XrNkRRMz85MpTRHteD52J4DxCJl2b9wHnE8KnyO4rKY/img.png?width=1200&coordinates=0%2C0%2C0%2C112&height=600"}, "fb": {"app_id": 1507945686182456}, "og": {"type": "article", "url": "https://www.papermag.com/hottest-young-royals-2449263049.html", "site_name": "PAPER", "image": {"identifier": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8xMDI1ODE0NC9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTYzMzI3NTgzOH0.XrNkRRMz85MpTRHteD52J4DxCJl2b9wHnE8KnyO4rKY/img.png?width=1200&coordinates=0%2C0%2C0%2C112&height=600", "width": 1200, "height": 600}, "title": "Who Are the Hottest Young Royals?", "description": "Expert Marlene Eilers Koenig runs down the new generation of aristocrats."}, "referrer": "always", "viewport": "width=device-width,initial-scale=1,minimum-scale=1.0,maximum-scale=1.0,user-scalable=no", "article": {"published_time": "2017-08-21T21:58:45+00:00", "modified_time": "2017-08-22T21:29:34+00:00", "author": "https://www.facebook.com/16081247185"}, "keywords": "royals", "description": "Expert Marlene Eilers Koenig runs down the new generation of aristocrats."}, "movies": [], "publish_date": 1503352725.0, "source": "http://www.papermag.com", "summary": ""}