{"url": "https://www.teenvogue.com/story/sexual-harassment-assault-allegations-hollywood-music-entertainment", "text": "Trigger Warning: This post contains language about sexual harassment and assault that some readers may find disturbing.\n\nOn October 5, 2017, The New York Times published a series of allegations against producer Harvey Weinstein from women who claimed that he sexually harassed them. Since those initial accusations came to light, a floodgate seems to have opened, with many people coming forward to discuss their experiences of sexual harassment and/or assault. Shortly after the bombshell report about Weinstein, the hashtag #MeToo, intended to demonstrate the prevalence of harassment and assault within our culture, went viral on social media.\n\nMany of these stories, particularly those in Hollywood and the media, are centered around men who have allegedly abused or harassed people in lower positions of power. The Weinstein scandal seemed to embolden more victims to speak out and shed the light on other men — including directors and celebrity chefs — who they claim have behaved inappropriately toward them. Ahead are some of the biggest cases that have come to light so far this year, most of which were revealed only after the Weinstein accusers told their stories.\n\nThis list is by no means exhaustive, as new allegations continue to be made daily. Anita Hill, who testified in the United States Senate that current Supreme Court Justice Clarence Thomas had sexually harassed her, pointed out to The New Yorker that \"People need to take this moment to make clear that this is not just about Hollywood.” The below list, while centered on Hollywood and the music industry, is not meant to suggest that this is an issue that is specific to one industry. For more coverage on sexual harassment, please click here and here.\n\nTeen Vogue will continue to update this list as more accusations are made.\n\nAndrew Kreisberg\n\nAndrew Kreisberg, who served as the executive producer for Supergirl and The Flash, has been suspended from working on the CW shows after several allegations of sexual harassment, according to Variety. The report cites 19 anonymous sources who did not want to speak on the record for fear of retaliation. Kreisberg told Variety, \"I have made comments on women’s appearances and clothes in my capacity as an executive producer, but they were not sexualized.\" In a statement to CNN, Warner Bros. TV Group said “We have suspended Mr. Kreisberg and are conducting an internal investigation. We take all allegations of misconduct extremely seriously, and are committed to creating a safe working environment for our employees and everyone involved in our productions.”\n\nAndy Dick\n\nActor Andy Dick was recently fired from the film Raising Buchanan after allegations of sexual harassment and misconduct surfaced on the set. The Hollywood Reporter notes that sources described Dick's behavior as groping, unwanted kissing and licking, and sexual propositions of people on set. Dick told THR that he never groped anybody but said: “I might have kissed somebody on the cheek to say goodbye and then licked them. That's my thing.… It's me being funny. I'm not trying to sexually harass people.”\n\nAnthony Anderson\n\nAnthony Anderson is currently the subject of a criminal investigation for alleged assault, The Blast reported on July 21, 2018. A woman claims that she attended an event thrown by the Black-ish actor last year, which is where she initially met Anderson. According to a report filed to the LAPD, the woman alleges that Anderson assaulted her when she met him a second time to “discuss future business opportunities.” The LAPD confirmed to The Blast that they have a “crime report listing [Anderson] as a suspect,” adding that “it is an open investigation.”", "images": ["https://assets.teenvogue.com/photos/5a063024545af946d5bbdf73/16:9/w_1280,c_limit/sexual-assault-hollywood-fb.jpg", "https://www.teenvogue.com/verso/static/teen-vogue/assets/logo-header.a32c5f649a1140996fd12f4a5ee1d0638ce23dc6.svg", "https://www.teenvogue.com/verso/static/teen-vogue/assets/logo-reverse.c9fd2ea81f6f84a7d604882e3d5f7ab119aeee5a.svg", "https://assets.teenvogue.com/photos/5a06302052e9dc2ff73f7051/16:9/w_2560%2Cc_limit/sexual-assault-hollywood.jpg"], "top_img": "https://assets.teenvogue.com/photos/5a063024545af946d5bbdf73/16:9/w_1280,c_limit/sexual-assault-hollywood-fb.jpg", "keywords": [], "authors": ["De Elizabeth", "De Elizabet", "Ella Ceró"], "canonical_link": "https://www.teenvogue.com/story/sexual-harassment-assault-allegations-hollywood-music-entertainment", "title": "Powerful People in Entertainment Who Have Been Accused of Sexual Harassment or Assault", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "De Elizabeth", "copyright": "Copyright (c) Condé Nast 2020", "description": "The allegations made against Harvey Weinstein changed how the entertainment industry treats sexual harassment and assault claims. See a list of those accused.", "id": "5a01d28904c1421ac8c7d1c0", "keywords": "sexual health + identity,sexual harassment,sexual assault,harvey weinstein,ben affleck", "news_keywords": "sexual health + identity,sexual harassment,sexual assault,harvey weinstein,ben affleck", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5a01d28904c1421ac8c7d1c0", "parsely-metadata": "{\"description\":\"The allegations made against Harvey Weinstein changed how the entertainment industry treats sexual harassment and assault claims. See a list of those accused.\",\"image-16-9\":\"https://assets.teenvogue.com/photos/5a06301f6a66c92585b51010/16:9/w_1000,c_limit/sexual-assault-hollywood-tout.jpg\",\"image-1-1\":\"https://assets.teenvogue.com/photos/5a06301f6a66c92585b51010/1:1/w_1000,c_limit/sexual-assault-hollywood-tout.jpg\"}", "og": {"description": "Hollywood isn't the only place harassment happens, but it's helping change the conversation.", "image": "https://assets.teenvogue.com/photos/5a063024545af946d5bbdf73/16:9/w_1280,c_limit/sexual-assault-hollywood-fb.jpg", "site_name": "Teen Vogue", "title": "A List of Powerful People in Entertainment Who Have Been Accused of Sexual Harassment or Assault This Year", "type": "article", "url": "https://www.teenvogue.com/story/sexual-harassment-assault-allegations-hollywood-music-entertainment"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@TeenVogue", "description": "Hollywood isn't the only place harassment happens, but it's helping change the conversation.", "domain": "https://www.teenvogue.com", "image": {"src": "https://assets.teenvogue.com/photos/5a063024545af946d5bbdf73/16:9/w_1280,c_limit/sexual-assault-hollywood-fb.jpg?mbid=social_retweet"}, "site": "@TeenVogue", "title": "A List of Powerful People in Entertainment Who Have Been Accused of Sexual Harassment or Assault This Year"}, "fb": {"app_id": 1013284322017473, "pages": 6636341311}}, "movies": [], "publish_date": null, "source": "https://www.teenvogue.com", "summary": ""}