{"url": "https://en.wikipedia.org/wiki/Grammy_Award_records", "text": "Throughout the history of the Grammy Awards, many significant records have been set. This page only includes the competitive awards which have been won by various artists. This does not include the various special awards that are presented by the National Academy of Recording Arts and Sciences such as Lifetime Achievement Awards, Trustees Awards, Technical Awards or Legend Awards. The page however does include other non-performance related Grammys (known as the Craft & Production Fields) that may have been presented to the artist(s).\n\nAwards [ edit ]\n\nMost Grammys won [ edit ]\n\nGeorg Solti won a total of 31 Grammy Awards\n\nThe record for the most Grammy Awards won in a lifetime is held by Georg Solti, a Hungarian-British conductor who was music director of the Chicago Symphony Orchestra for twenty-two years (1969-1991). He won 31 competitive Grammy Awards out of 74 nominations and was also awarded the first Grammy Trustees Award in 1967 and a Grammy Lifetime Achievement Award in 1996.[1][2]\n\nMost Grammys won by a male artist [ edit ]\n\nGeorg Solti has won 31 Grammy Awards.\n\nMost Grammys won by a female artist [ edit ]\n\nAlison Krauss has won 27 Grammy Awards, more than any other female artist\n\nAlison Krauss has, as a solo artist, collaborator and producer, won 27 Grammy Awards.[3]\n\nMost Grammys won by a group [ edit ]\n\n22-time Grammy Winners, U2 in 2005\n\nU2 holds the record for most Grammy Awards won by a group. They have won 22 awards.\n\nMost Grammys won by a producer [ edit ]\n\n28-time Grammy Winner, Quincy Jones in 1997\n\nQuincy Jones with 28 awards holds the record for most Grammy Awards won by a producer (and eleven of those were awarded for production duties. Jones also received Grammys as an arranger and a performing artist). Some producers have also won awards as engineers, mixers and/or mastering engineers.\n\nMost Grammys won by an engineer or mixer [ edit ]\n\nAl Schmitt, with 20 awards, has won more Grammy Awards than any other engineer or mixer. Serban Ghenea is second with 16 Grammy Awards.[4]\n\nRank Engineer / Mixer Awards 1 Al Schmitt 20 2 Serban Ghenea 16 3 Manny Marroquin 8\n\nYoungest winners [ edit ]\n\nLeAnn Rimes is the youngest individual Grammy winner and the youngest to win Best New Artist.\n\nThe Peasall Sisters are the youngest Grammy winners, when they were credited artists on the O Brother, Where Art Thou? soundtrack, which won Album of the Year in 2002.[5] LeAnn Rimes is the youngest individual winner. She was 14 years old when she won her first two awards in 1997. She was also the first Country artist to win the Best New Artist Grammy.\n\nRank Age Artist 1 8 years Leah Peasall 2 11 years Hannah Peasall 3 14 years Sarah Peasall 4 14 years, 182 days LeAnn Rimes 5 14 years, 313 days Luis Miguel 6 17 years, 80 days Lorde 7 18 years, 39 days Billie Eilish 8 18 years, 105 days Daya 9 18 years, 123 days Monica 10 19 years, 67 days Christina Aguilera\n\nYoungest artists to win Album of the Year [ edit ]\n\nBillie Eilish is the youngest artist to win the Grammys for Album of the Year and Record of the Year.\n\nBillie Eilish is the youngest artist to win Album of the Year. She was 18 years old when she won in 2020 for her album When We All Fall Asleep, Where Do We Go?.\n\nYoungest artist to win Record of the Year [ edit ]\n\nAt 18 years of age, Billie Eilish became the youngest artist to win Record of the Year when she won for “Bad Guy” in 2020.\n\nYoungest artist to win Song of the Year [ edit ]\n\nLorde became the youngest Song of the Year winner in 2014.\n\nAt 17 years of age, Lorde became the youngest artist to win Song of the Year when she won for “Royals” in 2014.\n\nYoungest artist to win Best New Artist [ edit ]\n\nAt 14 years of age, LeAnn Rimes became the youngest Best New Artist winning and the youngest individual Grammy winner when she won in 1997.\n\nOldest winners [ edit ]\n\nPinetop Perkins is the oldest Grammy winner, winning just weeks prior to his death\n\nPinetop Perkins is the oldest person to win a Grammy. In 2011 he was awarded Best Traditional Blues Album for Joined At The Hip at 97 years of age.\n\nNote: Sources vary on the birth year of Elizabeth Cotten, with some stating it as 1893, while others say 1895. The above information credits it as 1895. With either year, Cotten is the oldest female Grammy winner.\n\nMost honored albums [ edit ]\n\nSantana's Supernatural and U2's How to Dismantle an Atomic Bomb hold the record for most honoured album having won nine awards. Supernatural won nine awards in 2000 and How to Dismantle an Atomic Bomb won three awards in 2005 and won a further six in 2006 giving it a total of nine awards.\n\nMost Album of the Year wins [ edit ]\n\nTom Coyne won Album of the Year four times as a mastering engineer\n\nThe record for most Album of the Year wins is four. Tom Coyne, a mastering engineer won Album of the Year four times — 21 (2012), 1989 (2016), 25 (2017), 24K Magic (2018)\n\nThree recording artists, four record producers, two mastering engineers and four engineer/mixers have won the award three times;\n\nMost Record of the Year wins [ edit ]\n\nTom Coyne won Record of the Year four consecutive times as a mastering engineer.\n\nMost Grammys won for consecutive albums [ edit ]\n\nAlison Krauss and Union Station and The Manhattan Transfer have won seven consecutive awards for seven consecutive studio albums.\n\nMost consecutive Grammys won for the same category [ edit ]\n\nAretha Franklin won Best Female R&B Vocal Performance eight years in a row.\n\nAretha Franklin holds the record for winning the most consecutive Grammys in the same category. She won the Best Female R&B Vocal Performance every year from 1968 to 1975, for an eight-year winning streak. She also won in this category in 1982, 1986, and 1988, giving her 11 wins in the category.\n\nAfter Franklin, Jimmy Sturr, Bill Cosby, and John Williams are tied for second place for consecutive Grammy wins in the same category:\n\nSturr won six years in a row between 1987 and 1992 for Best Polka Album. He also won for three runs of four consecutive years (1996–1999, 2001–2004, and 2006–2009.) He won 18 out of the 24 Best Polka Album Grammys that were awarded since that category was added in 1985. The award was discontinued in 2009.\n\nCosby won six years in a row between 1965 and 1970 for Best Comedy Album.\n\nWilliams won six years in a row between 1978 and 1983 for Best Score Soundtrack for Visual Media.\n\nPat Benatar won Best Female Rock Vocal Performance four years in a row (1981, 1982 1983, 1984). Tina Turner won Best Female Rock Vocal Performance four years in a row (1985, 1986, 1987, 1989) as the award was not presented in 1988.\n\nLenny Kravitz won the Best Male Rock Vocal Performance award four years in a row (1999, 2000, 2001, 2002).\n\nTom Coyne won Record of the Year four years in a row (2015–2018).\n\nArtists who have won all four General Field awards [ edit ]\n\nThere have been only three artists who have won all four General Field awards: Best New Artist, Song of the Year, Record of the Year, and Album of the Year. In 1981, Christopher Cross became the first artist to win all four awards, as well as the first artist to win all four awards in a single ceremony.[6] Adele is the second artist to win all four, and the first female to do so. In 2009, she won Best New Artist and in 2012 and 2017, she won Song of the Year, Record of the Year, and Album of the Year. In 2020, Billie Eilish became the third artist ever, second female overall, and first female artist to win all four awards in a single ceremony.\n\nSingle ceremony [ edit ]\n\nMost Grammys won in one night [ edit ]\n\nThe record for Most Grammys won in one night is eight. Michael Jackson won eight in 1984 and Santana tied Jackson's record in 2000.[7]\n\nMost Grammys won by a male artist in one night [ edit ]\n\nMichael Jackson won a record eight awards in 1984\n\nThe record most Grammys won by a male artist in one night is eight. Michael Jackson won eight in 1984.\n\nMost Grammys won by a female artist in one night [ edit ]\n\nAdele won six awards in one night in 2012\n\nThe record most Grammys won by a female artist in one night is six. Beyoncé and Adele each won six in 2010 and 2012, respectively.\n\nMost Grammys won by a group in one night [ edit ]\n\nSantana won a record-tying eight awards in 2000\n\nThe record most Grammys won by a group artist in one night is eight. Santana won eight in 2000.\n\nMost Grammys won by a record producer in one night [ edit ]\n\nFinneas O’Connell won six Grammys in 2020 at 22 years of age.\n\nThe record for most awards won by a producer in one night is six. Finneas O'Connell won six awards in 2020, winning Producer of the Year, Non-Classical and five more awards including Record of the Year, Song of the Year, Album of the Year, Best Pop Vocal Album and Best Engineered Album, Non-Classical for his work on Billie Eilish's When We All Fall Asleep, Where Do We Go?.[8] [9]\n\nMost Grammys won by an engineer or mixer in one night [ edit ]\n\nThe most Grammys won by an engineer or mixer in one night is six. At the 59th Annual Grammy Awards in 2017, Tom Elmhirst won Record of the Year, Album of the Year, Best Pop Vocal Album, Best Alternative Music Album, Best Engineered Album, Non-Classical, and Best Rock Album for his work on Adele's 25, David Bowie's Blackstar, and Cage the Elephant's Tell Me I'm Pretty respectively.\n\nFinneas O'Connell won six awards in 2020, winning Producer of the Year, Non-Classical, Record of the Year, Song of the Year, Album of the Year, Best Pop Vocal Album and Best Engineered Album, Non-Classical for his work on Billie Eilish's When We All Fall Asleep, Where Do We Go?.[10] [11]\n\nArtists who have won all four General Field Awards at a single ceremony [ edit ]\n\nChristopher Cross was the first artist to win all four general field categories in one night\n\nChristopher Cross (1981) and Billie Eilish (2020) are the only artists who have received all four General Field awards in one night.[12]\n\nArtists who have won Record, Album and Song of the Year in one night [ edit ]\n\nEric Clapton won Record, Album and Song of the Year in one night in 1993\n\nThe three biggest Grammy Awards are Record of the Year, Album of the Year and Song of the Year. Eight artists have won all three in one night. Adele is the only artist in Grammy history to accomplish this twice.\n\nMost Grammys won by an album in one night [ edit ]\n\nThe most awards awarded to an album in one night is nine. At the 42nd Annual Grammy Awards in 2000 Santana's Supernatural was awarded nine awards. It won Record of the Year, Album of the Year, Song of the Year, Best Pop Performance by a Duo or Group with Vocals, Best Pop Collaboration with Vocals, Best Pop Instrumental Performance, Best Rock Performance by a Duo or Group with Vocal, Best Rock Instrumental Performance, and Best Rock Album.\n\nMost posthumous Grammys won in one night [ edit ]\n\nRay Charles won five Grammys in 2005, less than a year after his death.\n\nRay Charles holds the record for most posthumous awards won in one night. He was awarded five Grammy Awards at the 47th Annual Grammy Awards in 2005 including Album of the Year.\n\nNominations [ edit ]\n\nMost Grammy nominations [ edit ]\n\nQuincy Jones holds the record for the most Grammy nominations with 80.[13][14]\n\nMost nominations in one night [ edit ]\n\nMichael Jackson and Babyface hold the record for most Grammy nominations in one night with 12 nominations.\n\nMost nominations without winning [ edit ]\n\nZubin Mehta holds the record for most Grammy nominations without winning\n\nWith 18 nominations, Zubin Mehta has received the most Grammy nominations without winning.\n\nNorwegian sound engineer and chorus leader Morten Lindberg removed himself from this list in February 2020, when he finally received his first Grammy Award with his 28th nomination between 2006 and 2020.\n\nMost nominations in one night without winning [ edit ]\n\nPaul McCartney was nominated for nine awards in 1966 but failed to win\n\nThe record for most Grammy nominations without a win in one night is 9, held by Paul McCartney. The record was set in 1966.\n\nGrammy nominations in the most fields [ edit ]\n\nArtists who had been nominated for all four General Field awards in one night [ edit ]\n\nOnly twelve artists have been nominated for all four General Field awards in one night. Lizzo is the oldest person to be nominated for all four awards in one night, at 31 years old; while the youngest person to be nominated is Billie Eilish at 17 years old. Both were nominated in 2020, making it the first time that two artists were nominated for all four awards in one night. In 1968, Bobbie Gentry became the first person and first female artist to be nominated for all four awards, followed by Christopher Cross in 1981 and Fun. in 2013, becoming the first male artist and first group to be nominated, respectively.\n\nYoungest nominees [ edit ]\n\nLeah Peasall of the Peasall sisters is the youngest ever Grammy nominee (and winner) as one of the credited artists on the O Brother, Where Art Thou? (soundtrack) in 2002.[5] Deleon Richards is the youngest performer to receive an individual nomination, for Best Soul/Gospel performance.[15]\n\nSee also [ edit ]\n\nNotes [ edit ]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Santana_%281971%29.png/190px-Santana_%281971%29.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Eclapton_cardiff.jpg/190px-Eclapton_cardiff.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/2005-11-21_U2_%40_MSG_by_ZG.JPG/190px-2005-11-21_U2_%40_MSG_by_ZG.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Adele_-_Live_2009_%284%29_cropped.jpg/190px-Adele_-_Live_2009_%284%29_cropped.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Quincy_Jones_1997.jpg/190px-Quincy_Jones_1997.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Lorde_-_Coachella_2014_%2806%29.jpg/190px-Lorde_-_Coachella_2014_%2806%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Michael_Jackson1_1988.jpg/190px-Michael_Jackson1_1988.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Alison_Krauss_2011.jpg/190px-Alison_Krauss_2011.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Christopher_Cross_in_beaumont_ca_%282637703689%29.jpg/190px-Christopher_Cross_in_beaumont_ca_%282637703689%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Paul_McCartney_Headshot_%28cropped%29.jpg/190px-Paul_McCartney_Headshot_%28cropped%29.jpg", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Finneas_O%27Connell_2019_by_Glenn_Francis.jpg/190px-Finneas_O%27Connell_2019_by_Glenn_Francis.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/PikiWiki_Israel_8929_Shalit_concert.JPG/190px-PikiWiki_Israel_8929_Shalit_concert.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Sir_George_Solti_6_Allan_Allan_Warren.jpg/190px-Sir_George_Solti_6_Allan_Allan_Warren.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Ray_Charles_FIJM_2003.jpg/190px-Ray_Charles_FIJM_2003.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Billie_Eilish_at_Pukkelpop_Festival_-_18_AUGUST_2019_%2801%29_%28cropped%29.jpg/190px-Billie_Eilish_at_Pukkelpop_Festival_-_18_AUGUST_2019_%2801%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Pinetop_Perkins_1.jpg/190px-Pinetop_Perkins_1.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Aretha_Franklin_1998.jpg/190px-Aretha_Franklin_1998.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Tom_Coyne.jpg/190px-Tom_Coyne.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Lee_Ann_Rimes_1999.jpg/190px-Lee_Ann_Rimes_1999.jpg"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Grammy_Award_records", "title": "Grammy Award records", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}