{"url": "www.thehollywoodgossip.com/2016/10/brad-pitt-and-marion-cotillard-spotted-nearly-kissing/", "text": "Brad Pitt has been caught nearly kissing Marion Cotillard.\n\nWhat sort of wrench will this throw into Pitt's divorce proceedings with Angelina Jolie?\n\nWill she use the image below against her estranged husband in her plans to secure full legal custody of the stars' six children?\n\nWhat impact will this development have on Pitt's global popularity?\n\nThe answers, in order, are:\n\nNo wrench. No way for Jolie to use this photo against Pitt. And no impact at all on Pitt's standing with millions of fans around the globe.\n\nHow come? Because the image in question is a movie poster!\n\nHA! Got ya!\n\nSorry, but we had to.\n\nThe first promotional poster for Pitt and Cotillard’s upcoming World War II romantic drama, Allied, has hit the Internet.\n\nAnd it's only worth noting because a rumor circulated soon after Jolie filed to divorce Pitt that he actually carried on an affair with Cotillard.\n\nThis chatter was based on nothing but the fact that Pitt and Cotillard are starring together as husband and wife in this film and were probably caught looking cozy on set together.\n\nFor the camera, that is, and nothing more.\n\nOf course, it is widely believed that Pitt got together with Jolie on the set of Mr. and Mrs. Smith way back in the day, ending his marriage to Jennifer Aniston as a result of this new relationship.\n\nSo we do understand where people got the idea that Pitt might bond with a female co-star.\n\nBut Cotillard did a masterful job of shooting down any affair allegations before they built up too much momentum.\n\nIn a very straightforward Instagram post, the French actress responded to these silly rumors as follows last month:\n\nThis is going to be my first and only reaction to the whirlwind news that broke 24 hours ago and that I was swept up into.\n\nI am not used to commenting on things like this nor taking them seriously but as this situation is spiraling and affecting people I love, I have to speak up.\n\nFirstly, many years ago, I met the man of my life, father of our son and of the baby we are expecting. He is my love, my best friend, the only one that I need.\n\nSecondly to those who have indicated that I am devastated, I am very well thank you. This crafted conversation isn't distressing. And to all the media and the haters who are quick to pass judgment, I sincerely wish you a swift recovery.\n\nFinally, I do very much wish that Angelina and Brad, both whom I deeply respect, will find peace in this very tumultuous moment. With all my love Marion.\n\nThere you have it, right? Case very much closed.\n\nAllies opens in theaters on November 23.\n\nIt will be interesting to see if Pitt's divorce helps the movie do well... or prompts the movie to tank at the box office.\n\nAs for the latest regarding the Divorce Heard 'Round the World, a recent report suggests that Jolie is having second thoughts about her legal split.\n\n\"Angelina didn't realize how much she would miss him but now that Brad is out of her daily life, she misses his sense of humor and seeing him everyday,\" an anonymous insider tells Hollywood Life.\n\nBelieve this at your own discretion, however.\n\nWe're pretty sure the marriage is doomed.", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--409x6xBR--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1474625377/brad-pitt-wearing-glasses-and-smiling.jpg"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--409x6xBR--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1474625377/brad-pitt-wearing-glasses-and-smiling.jpg", "keywords": [], "authors": ["Hilton Hater"], "canonical_link": "https://www.thehollywoodgossip.com/2016/10/brad-pitt-and-marion-cotillard-spotted-nearly-kissing/", "title": "Brad Pitt and Marion Cotillard: Spotted Nearly Kissing!!!!!!", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2016/10/brad-pitt-and-marion-cotillard-spotted-nearly-kissing/", "title": "Brad Pitt and Marion Cotillard: Spotted Nearly Kissing!!!!!!", "description": "Brad Pitt and Marion Cotillard are nearly kissing in this photo. Is there a catch? Perhaps. Read on to find out what it could be!", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--409x6xBR--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1474625377/brad-pitt-wearing-glasses-and-smiling.jpg", "type": "image/jpeg", "width": 630, "height": 805}, "video": {"identifier": "https://www.thehollywoodgossip.com/videos/brad-pitt-and-marion-cotillard-allied-trailer/", "type": "text/html"}}, "article": {"published_time": "2016-10-24T13:35:02-04:00", "modified_time": "2016-10-24T13:34:57-04:00", "tag": "Celebrity Gossip", "author": "Hilton Hater"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Brad Pitt and Marion Cotillard: Spotted Nearly Kissing!!!!!!", "description": "Brad Pitt and Marion Cotillard are nearly kissing in this photo. Is there a catch? Perhaps. Read on to find out what it could be!", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--409x6xBR--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1474625377/brad-pitt-wearing-glasses-and-smiling.jpg"}}, "description": "Brad Pitt and Marion Cotillard are nearly kissing in this photo. Is there a catch? Perhaps. Read on to find out what it could be!"}, "movies": [], "publish_date": 1477330502.0, "source": "http://www.thehollywoodgossip.com", "summary": ""}