{"url": "https://www.digitalspy.com/tv/a853228/american-crime-story-katrina-cast-plot-airdate-and-everything-you-need-to-know/", "text": "American Crime Story has had a pretty fascinating journey to the small screen so far. Even before the first OJ Simpson-focused season aired, showrunner Ryan Murphy (of American Horror Story and that massive Netflix deal fame) had announced he'd be focusing on the story of Hurricane Katrina next.\n\nBut, in a plot twist worthy of most of his shows, Murphy changed his mind and went with The Assassination of Gianni Versace as season two's title and focus.\n\nSo does this mean Katrina's off-the-cards, or will it end up being Crime Story's third season? We're glad you asked, because we've done some investigating.\n\nAmerican Crime Story Katrina plot: What's it about?\n\nGetty Images\n\nThe original plan was to adapt Douglas Brinkley's book about Katrina and its aftermath, The Great Deluge, but the season will now be based on Sheri Fink's book Five Days at Memorial: Life and Death in a Storm-Ravaged Hospital, which examines how the disaster impacted the staff of Memorial Medical Center 15.\n\nWay back in January 2016, in the run-up to The People v OJ's first episode, Ryan Murphy was pretty clear about why he wanted to cover the narrative around Hurricane Katrina for the second season of his crime show.\n\n\"I want this show to be a socially conscious, socially aware examination of different types of crime around the world,\" Murphy said.\n\n\"And in my opinion, Katrina was a f**king crime – a crime against a lot of people who didn't have a strong voice, and we're going to treat it as a crime. That's what this show is all about.\"\n\nIn August 2016, we had an update from producer Brad Simpson, who said the show would focus on two things.\n\n\"One is just the intensity, what it was like to be there on the ground, to be in that pressure cooker,\" said Simpson.\n\n\"But also, thematically, the bigger crime, which is that Katrina was something that was predictable that we weren't prepared for, even though we knew it was going to happen. Like OJ, I think it turns a lens back on America and shows some uncomfortable truths about it.\"\n\nAmerican Crime Story Katrina cast: Who's in it?\n\nGetty Images\n\nBack when Katrina was adapting The Great Deluge, an impressive list of names had signed up, including Annette Bening as Kathleen Blanco (the governor of Louisiana), Matthew Broderick as Michael D. Brown (the Federal Emergency Management Agency, or FEMA, director) and Dennis Quaid as President George W Bush.\n\nHowever, with those plans plans later abandoned (see above), Murphy and company opted for a cast overhaul.\n\nSarah Paulson will now play the lead role of Dr. Anna Pou, who was on duty when Katrina struck, but no other names have been confirmed. The Hollywood Reporter noted last August that producers were \"attempting to find new characters\" for the cast attached to the previous version of Katrina, including Quaid, Bening and Broderick.\n\nAmerican Crime Story Katrina airdate: When's it on?\n\nFX\n\nPost-overhaul, the project remains in development, but at time of writing has no confirmed air-date.\n\n\"[Katrina] just kind of got stalled,\" director Anthony Hemingway said in 2017. \"We're all standing by waiting to find out what's happening... Nothing has really been done. We haven't started prep on it at all.\"\n\nFX president John Landgraf seemed confident that Katrina would still happen when asked about it in August 2017. \"I'm confident that it will air and I'm really, really excited,\" Landgraf said. \"It was a big creative pivot we made [to swap Katrina for Versace].\n\n\"It was a difficult decision because we were far along one creative direction, and Ryan decided – and we supported Ryan – that the bar is really high for this franchise and we just weren't confident we were going to get over it.\n\n\"Simultaneously, there was an idea for a creative pivot, which I'm going to let Ryan announce to you when he feels the time is right. But I think you'll see when he does, it's a really, really exciting idea. I'm now more confident about it creatively than I was before we made this pivot.\"\n\nGetty Images\n\nBut later word from Murphy seemed to suggest an airdate announcement might not be imminent.\n\n\"That's a show where we have a lot of things cooking,\" Murphy said in March. \"We literally just edited the [Versace] finale last week, so we haven't made that decision yet.\n\n\"We're never going to have a Crime Story unless we have the scripts down. I think the reason why Versace went next is because Tom Rob Smith had such a strong take on it. I am not in a rush to move forward with anything unless it's perfect.\"\n\nOur latest update came in August, with Landgraf confirming that Katrina had again been delayed due to further script changes. \"We went back to square one and started over,\" he said. \"My understanding is [producers] have seen scripts but they haven't given them to me yet.\n\n\"So much of it is right now is Ryan. He kind of sets his own timetable. I'm quite certain [Murphy's othe FX shows] American Horror Story and Pose are on an annual cycle. With Crime Story and Feud, they're on a cycle of when the material is good enough and when is Ryan willing and able to slot that into his schedule.\n\n\"So I think there will be more cycles, but I'm not really in control of that.\"\n\nWe'll be updating this page with any incoming American Crime Story: Katrina news, so bookmark it to get all the latest stories, reveals and – eventually (hopefully!) – trailers.\n\nWant up-to-the-minute entertainment news and features? Just hit 'Like' on our Digital Spy Facebook page and 'Follow' on our @digitalspy Twitter account and you're all set.", "images": ["https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/35/1535544281-screen-shot-2018-08-29-at-10424-pm.jpg?crop=1xw:0.7217868338557993xh;center,top&resize=1200:*", "https://www.digitalspy.com/sites/digitalspy/assets/images/logos/ipso_regulated_hires.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/35/1535544281-screen-shot-2018-08-29-at-10424-pm.jpg?crop=1xw:0.7217868338557993xh;center,top&resize=1200:*", "keywords": [], "authors": ["Sam Ashurst"], "canonical_link": "https://www.digitalspy.com/tv/a853228/american-crime-story-katrina-cast-plot-airdate-and-everything-you-need-to-know/", "title": "American Crime Story Katrina cast, plot, airdate and everything you need to know", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#e94114", "og": {"type": "article", "site_name": "Digital Spy", "title": "American Crime Story – Katrina: All you need to know", "description": "After OJ and Versace, where will Ryan Murphy go next?", "url": "http://www.digitalspy.com/tv/a853228/american-crime-story-katrina-cast-plot-airdate-and-everything-you-need-to-know/", "image": {"identifier": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/35/1535544281-screen-shot-2018-08-29-at-10424-pm.jpg?crop=1xw:0.7217868338557993xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 131928163488848}, "article": {"publisher": "https://www.facebook.com/digitalspyuk/", "modified_time": "2018-11-28 10:05:00", "published_time": "2018-08-29 12:06:00", "section": "TV", "opinion": "false"}, "twitter": {"site": "@digitalspy", "card": "summary_large_image", "image": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/35/1535544281-screen-shot-2018-08-29-at-10424-pm.jpg?crop=1xw:0.7217868338557993xh;center,top&resize=640:*"}, "google-site-verification": "yOsKGKJADzRcnlk-FrptJIoYYaNs5pgoJx2J0ie4bWE", "title": "American Crime Story Katrina cast, plot, airdate and everything you need to know", "description": "After OJ and Versace, what's next for Ryan Murphy's anthology series?", "keywords": "American Crime Story Katrina, Katrina, ACS Katrina, American Crime Story Katrina cast, American Crime Story season 3, American Crime Story season 3 Katrina, American Crime Story season 3 cast, American Crime Story 2019, Ryan Murphy, ACS season 3, American Crime Story season 3 trailer, American Crime Story season 3 air date", "thumbnail": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/35/1535544281-screen-shot-2018-08-29-at-10424-pm.jpg?crop=0.6927252985884907xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "TV,tv,Matthew Broderick,Dennis Quaid,Ryan Murphy,John Travolta,Annette Bening", "sailthru.date": "2018-08-29T12:06:00Z", "sailthru.image.full": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/35/1535544281-screen-shot-2018-08-29-at-10424-pm.jpg?crop=1xw:0.7217868338557993xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/35/1535544281-screen-shot-2018-08-29-at-10424-pm.jpg?crop=0.6927252985884907xw:1xh;center,top", "sailthru.socialtitle": "American Crime Story – Katrina: All you need to know", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1535515560.0, "source": "https://www.digitalspy.com", "summary": ""}