{"url": "http://www.duggarfamily.com/about", "text": "About Jim Bob and Michelle\n\nJim Bob & Michelle Duggar married July 21st, 1984. At that time, they chose to use the birth control pill. They thought, “We don’t want children right now. We can’t afford them. We want children in our timing, when we’re ready.” Four years later they decided to have their first child. Then, Michelle went back on the pill, but she conceived and had a miscarriage. At that point they talked with a Christian medical doctor and read the fine print in the contraceptives package. They found that while taking the pill you can get pregnant and then miscarry. They were grieved! They were Christians! They were pro-life! They realized that their selfish actions had taken the life of their child.\n\nThey prayed and asked God to forgive them, and to teach them to love children like He loves children. They asked God to bless them with as many children as He saw fit in His timing. Right after that Michelle got pregnant with twins! To date they have been blessed with 19 children, (10 boys and 9 girls) Joshua (& wife Anna), Jana & John-David (twins), Jill, Jessa, Jinger, Joseph, Josiah, Joy-Anna, Jedidiah & Jeremiah (twins), Jason, James, Justin, Jackson, Johannah, Jennifer, Jordyn-Grace and Josie.\n\nGod has opened many doors for them to share that children are a blessing from the Lord! To date they have been featured on five Discovery Health & TLC documentaries entitled, “14 Children and Pregnant Again!”, “16 Children and Moving In!”, “Raising 16 Children!”,“On The Road With 16 Children!” & \"Duggar's Big Family Album\". They have appeared on numerous National and International TV shows including The Early Show, The Today Show, The View,Fox & Friends, Italian Public Television, KBS (Korean Broadcasting System),Discovery Home & Health (UK & Australia), Jimmy Kimmel Live, Fox News Network, CNN, MSNBC and others. They have done countless interviews with radio talk show hosts around the world including NPR, AP Radio, CBS Radio,FOX Radio and others. They have appeared in various magazine and newspapers including Parents, New York Times, Dallas Morning News, Chicago Tribune, Ladies Home Journal, People and many others. From the United States, Canada, Korea, Japan, China, India, New Zealand, Australia, France and Germany. They have recently completed work on their first book,The Duggars: 20 and Counting! The Duggar’s desire is to make Christ known and for others to see that the Bible is the owner’s manual for life.", "images": ["http://www.duggarfamily.com/?a=Advertisements.Show&id=51E5D119-2E1F-4DAB-88D6-D51BD13894F9&r=1587223477168", "http://www.duggarfamily.com/index.cfm?a=Files.Serve&File_id=af15bca7-7ae5-4a7d-8ee4-16698d00a58e", "http://www.duggarfamily.com/?a=Advertisements.Show&id=2F710AD7-264C-404A-B87D-C7A23DEDE66E&r=1587223477177"], "top_img": "http://www.duggarfamily.com/index.cfm?a=Files.Serve&File_id=af15bca7-7ae5-4a7d-8ee4-16698d00a58e", "keywords": [], "authors": [], "canonical_link": "http://www.duggarfamily.com/about", "title": "The Duggar Family", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "og": {"site_name": "The Duggar Family", "type": "website", "url": "http://www.duggarfamily.com/about"}}, "movies": [], "publish_date": null, "source": "http://www.duggarfamily.com", "summary": ""}