{"url": "https://www.vibe.com/2013/07/lady-gaga-nude-photo-hot-or-not-nsfw-2", "text": "As another day passes without Aaliyah's music on streaming platforms, fans are looking for answers.\n\nOver the weekend, the hashtag #FreeAaliyahMusic appeared on Twitter in light of song battles between Swizz Beats vs. Timbaland and Ne-Yo vs. Johnta Austin. The latter opponents played their collaborations with the late singer, proving Baby Girl's dynamic relevancy in the age of modern R&B. As songs like \"I Don't Wanna\" and \"Come Over\" picked up plays on YouTube, the hashtag pointed out the tragedy of her songs not existing on platforms like Spotify, Tidal and Apple Music.\n\nAaliyah's only album on multiple platforms is her 1994 debut, Age Ain't Nothing But A Number. Other albums like the platinum-selling One in A Million and Aaliyah are being held in a vault of sorts along with other unmixed vocals by her uncle and founder of Blackground Records, Barry Hankerson.\n\nHankerson has built up a mysterious yet haunting aura over the years due to his refusal to release Aaliyah's music on streaming platforms. Reasons are unknown but Stephen Witt's 2016 investigation revealed business deals like the shift in distribution from Jive Records to Atlantic helped Hankerson take ownership of the singer's masters. The deal was made in 1996 when Blackground featured artists like Aaliyah, Toni Braxton, R. Kelly, then-production duo Timbaland and Magoo as well as Missy Elliott.\n\nSadly, Aaliyah's music isn't the only recordings lost in the shuffle. Recordings from Timbaland and Toni Braxton have been hidden from the world with both taking legal action against the label over the years. There's also JoJo, who had to break from the label after they refused to release her third album. The singer recently re-recorded her first two albums.\n\nWith Aaliyah's music getting the attention it deserves, Johnta Austin discussed the singer's impact on R&B today. \"It was amazing, she was incredible from top to bottom,\" he told OkayPlayer of working with the singer on \"Come Over\" and \"I Don't Wanna.\" \"I don't think Aaliyah gets the vocal credit that she deserves. When she was on it, she had the riffs, she had everything.\"\n\nEarlier this year, an account impersonating Hankerson claimed her music would arrive on streaming platforms January 16, on what would've been her 41st birthday. A docuseries called the Aaliyah Diaries was also promoted for a release on Netflix.\n\nOf course, it was far from the truth. Fans can enjoy selected videos and songs on YouTube, but it's clear they want more.\n\nAaliyah’s music is the landmark for a lot of your favs not only was she ahead of her time with her futuristic sounds she also was a fashion Icon dancer and phenomenal actress . The future generations need be exposed to her artistry and pay homage .#FreeAaliyahMusic pic.twitter.com/LxZfxcqRgF\n\n— Black Clover (@la_alchemist) March 29, 2020\n\nHer first #1 solely based on AirPlay! She was the first ! #FreeAaliyahMusic pic.twitter.com/BHlANZjCGZ\n\n— (@hodeciii) March 29, 2020\n\nMakes no sense for someone still so influential to be hidden. Many try to emulate her. On Spotifys This is Aaliyah playlist, theres some great tracks not on her main Spotify #FreeAaliyahMusic pic.twitter.com/vLqLTVxqO9\n\n— Blackity Black⁷ (@ClaudBuzzzz) March 29, 2020\n\nAaliyah is trending once again. She deserves endless flowers. This is true impact y’all. Her voice, her sound, her music...She’s been gone for 2 decades and y’all see the love for her is even stronger! We miss you baby girl! #FreeAaliyahMusic pic.twitter.com/ALDcT0ZQxR\n\n— A A L I Y A H (@forbbygrlaali) March 30, 2020\n\nAaliyah said she wanted to be remembered for her music and yet most of it is not on streaming services #FreeAaliyahMusic pic.twitter.com/zwk0AWMCoE\n\n— RJR (@MyNewEssence96) March 29, 2020\n\naaliyah’s gems like more than a woman deserve to be in streaming sites #FreeAaliyahMusic pic.twitter.com/mM2GWEg1pe\n\n— k (@grandexrocky) March 30, 2020\n\nI saw #FreeAaliyahMusic and IMMEDIATELY jumped into action! I can’t express how betrayed I felt when we were supposed to have all her music on Spotify by her birthday. Her discography is deeply underestimated and we need to make it right for our babygirl!pic.twitter.com/GfxBeJxUY1\n\n— jerrica✨ (@jerricaofficial) March 29, 2020\n\nBefore Megan The Stallion drove the boat...\n\nAaliyah rocked the boat...\n\n#FreeAaliyahMusic pic.twitter.com/iXNwssD3sY\n\n— Al’Bei (@_albei) March 29, 2020\n\ni think we should have that conversation #FreeAaliyahMusic pic.twitter.com/cGl269tuTr\n\n— AALIYAH LEGION (@AaliyahLegion) April 1, 2020", "images": ["https://www.vibe.com/assets/images/logo/white.svg?0cd0b31e24683c892ef3", "https://static.vibe.com/files/2020/04/GettyImages-105170898-1585844901-313x480.jpg", "https://static.vibe.com/files/2020/04/sid-tipton-look-both-ways-premiere-1-copy-1587154525-e1587154609881-240x135.jpg", "https://static.vibe.com/files/2020/03/GettyImages-452658434-1584642352-e1584642486976-650x366.jpg", "https://static.vibe.com/files/2020/04/the-clark-sisters-lifetime-cast-viewers-1587065706-e1587066161772-300x169.jpg", "https://static.vibe.com/files/2020/04/GettyImages-105170898-1585844901-compressed.jpg", "https://static.vibe.com/files/2013/07/lady-gaga-nude-naked-v-magazine-artpop-2013-full-size-600x400.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://static.vibe.com/files/2020/04/kelly-rowland-coffee-music-video-1587167209-e1587167261519-240x135.jpg", "https://static.vibe.com/files/2020/04/pop-smoke-documentary-in-the-works-1-1587155425-240x135.jpg", "https://static.vibe.com/files/2020/03/GettyImages-77406924-1585669435-e1585670897804-650x366.jpg"], "top_img": "https://static.vibe.com/files/2013/07/lady-gaga-nude-naked-v-magazine-artpop-2013-full-size-600x400.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.vibe.com/2013/07/lady-gaga-nude-photo-hot-or-not-nsfw-2", "title": "Lady Gaga Nude Photo: Hot or Not? (NSFW)", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2015-02-24T15:27:31-05:00", "published_time": "2013-07-21T20:15:08-04:00"}, "og": {"image": {"identifier": "https://static.vibe.com/files/2013/07/lady-gaga-nude-naked-v-magazine-artpop-2013-full-size-600x400.jpg", "height": 400, "width": 600}, "type": "article", "url": "https://www.vibe.com/2013/07/lady-gaga-nude-photo-hot-or-not-nsfw-2", "site_name": "Vibe"}, "twitter": {"card": "summary", "image": "https://static.vibe.com/files/2013/07/lady-gaga-nude-naked-v-magazine-artpop-2013-full-size-600x400.jpg", "title": "Lady Gaga Nude Photo: Hot or Not? (NSFW)", "site": "@vibemagazine"}}, "movies": [], "publish_date": 1374452108.0, "source": "https://www.vibe.com", "summary": ""}