{"url": "en.wikipedia.org/wiki/Heidi_Klum", "text": "German-American model, television personality, singer and actress\n\nHeidi Klum ( German pronunciation: [ˈhaɪ̯diː ˈklʊm]; born 1 June 1973)[6] is a German-American model, television personality, businesswoman, fashion designer, singer, television producer, author, and actress. She appeared on the cover of the Sports Illustrated Swimsuit Issue in 1998 and was the first German model to become a Victoria's Secret Angel.\n\nFollowing a successful modeling career, Klum became the host and a judge of Germany's Next Topmodel and the reality show Project Runway, which earned her an Emmy nomination in 2008 and a win in 2013 for Outstanding Host for a Reality or Reality-Competition Program (shared with co-host Tim Gunn); Klum has been nominated for six Emmy Awards. She has worked as a spokesmodel for Dannon and H&M, and has appeared in numerous commercials for McDonald's, Volkswagen and others. In 2009, Klum became Barbie's official ambassador on Barbie's 50th anniversary. As an occasional actress, she had supporting roles in movies including Blow Dry (2001), Ella Enchanted (2004), and made cameo appearances in The Devil Wears Prada (2006) and Perfect Stranger (2007). She has also appeared on TV shows including Sex and the City, How I Met Your Mother, Desperate Housewives and Parks and Recreation. From 2013 until February 2019, Klum was a judge on NBC reality show, America's Got Talent, and is set to return in summer 2020.\n\nIn May 2011, Forbes magazine estimated Klum's total earnings for that year as US$20 million. She was ranked second on Forbes' list of the \"World's Top-Earning Models\". Forbes noted that since ending her 13-year run as a Victoria's Secret Angel, Klum has become more of a businesswoman than a model. In 2008, she became an American citizen while maintaining her native German citizenship.[7][8][9][10]\n\nEarly life and discovery\n\nKlum was born and raised in Bergisch Gladbach, a town outside Cologne, West Germany. She is the daughter of Erna, a hairdresser,[11] and Günther Klum,[12] a cosmetics company executive. A friend convinced her to enroll in a national modeling contest called \"Model 92\".[13] Out of 25,000 contestants, Klum was voted the winner on 29 April 1992, and offered a modeling contract worth US$300,000 by Thomas Zeumer, CEO of Metropolitan Models New York.[14] After winning, she appeared on the Gottschalk Late Night Show, a German television show with host Thomas Gottschalk. She accepted the contract a few months later, after graduating from school, and decided not to try for an apprentice position at a fashion design school.[15]\n\nCareer\n\nModeling and acting\n\nKlum has been featured on the cover of French, German, Portuguese and Spanish Vogue magazines, as well as Elle, InStyle, Marie Claire, Glamour and Russian Harper's Bazaar magazines. She became widely known after appearing on the cover of the Sports Illustrated Swimsuit Issue and for her work with Victoria's Secret as an \"Angel\".[16] Klum hosted the 2002, 2006, 2007, 2008, and 2009 Victoria's Secret Fashion Shows. On 1 October 2010, the New York Post reported in its \"Page Six\" gossip column that Klum would be leaving Victoria's Secret, which was later confirmed by Klum.[17]\n\nIn addition to working with well-known photographers on her first husband's Sports Illustrated shoots, she was the object and subject of Joanne Gair body painting works in several editions from 1997 to 2010. She wrote the foreword to Gair's book of body paint work, Body Painting, Masterpieces.[18] Klum′s modeling work include advertising campaigns for brands like Pringle of Scotland, Liz Claiborne and – alongside fellow German supermodels Nadja Auermann, Veruschka von Lehndorff and Tatjana Patitz – for the New York jersey label Kathleen Madden. Beauty campaigns include makeup brands Bobbi Brown and Astor as well as Givenchy's Amarige fragrance. Also she appeared in special ad campaigns by designers like Marc Jacobs (Protect The Skin You′e In to raise awereness for skin cancer) and Jean-Paul Gaultier (summer tote in collaboration with and to benefit amfAR). Further she modeled for retail clothing brands such as H & M, Ann Taylor and Peek & Cloppenburg. She also served as a spokesmodel for McDonald's, Braun, Dannon and since 2007, she has been a celebrity spokesmodel for Jordache[19] and Volkswagen. In addition to modeling, she has appeared in several TV shows, including Spin City, Sex and the City, Yes, Dear, and How I Met Your Mother. She had a role as an ill-tempered hair model in the movie Blow Dry, played a giantess in the movie Ella Enchanted and was cast as Ursula Andress in The Life and Death of Peter Sellers. She had cameo appearances in the films The Devil Wears Prada and Perfect Stranger.\n\nHer other projects include dance and video games. She is featured in the 2003 video game James Bond 007: Everything or Nothing, where she plays the villain Dr. Katya Nadanova.[20] She has appeared in several music videos, including Jamiroquai's video \"Love Foolosophy\" from their album A Funk Odyssey, Kelis's \"Young, Fresh n' New\", off her second 2001 album Wanderland and, most recently, the second video for her then husband Seal's song \"Secret\" off his 2010 album Seal 6: Commitment. The latter video depicts the married couple sharing intimate moments while naked in bed; the concept was Klum's idea.[21] In July 2007, having earned US$8 million in the previous 16 months, Klum was named by Forbes as third on the list of the World's 15 Top-Earning Supermodels.[22]\n\nIn 2008, Forbes estimated her income at US$16 million, putting Klum in first place. For 2007, Forbes estimated her income at US$14 million.[23] Klum is signed to IMG Models in New York City.[24] In 2008, Klum was a featured guest on an American Volkswagen commercial, where she was interviewed by a black Beetle. When she commented that German engineering is so sexy, she caused the Beetle to blush and turn red. She has been a part of several commercials for Volkswagen and McDonald's on German television.[25] In November 2008, Klum appeared in two versions of a Guitar Hero World Tour commercial, wherein she did a take on Tom Cruise's iconic underwear dancing scene in Risky Business. In both versions, she lip-synced to Bob Seger's \"Old Time Rock and Roll\" while dancing around the living room with the wireless guitar controller.[citation needed]\n\nIn October 2009, Klum was the often-nude one-woman subject of Heidilicious,[26] a photo book by photographer Rankin. Klum ventured into web-based videos, starring in \"SPIKED HEEL: Supermodels Battle the Forces of Evil\". The web-series starred model Coco Rocha and was directed by fashion documentarian Doug Keeve. In the story, Klum aka 'The Kluminator,'[27] and her stylish sidekick Coco \"The Sassy Superhero\" Rocha battle the evil Dr. Faux Pas who is plotting to destroy Fashion Week. The heroines employ everything from blow-dryer guns to fist fights, in order to thwart Dr. Faux Pas' dastardly plans. The Kluminator and Girl Wonder avoid a chain of fashion disasters to neutralize a death ray that threatens to vaporize the community of fashionistas gathered in Bryant Park.[28] In 2010, Klum became the new face and creative advisor for European cosmetics brand Astor, for which she sets artistic direction and designs new products and fashion forward color collections.[29] In October 2010, Klum parted ways with Victoria's Secret after 13 years of working with the brand. She provided a simple explanation in her official statement, stating: \"All good things have to come to an end. I will always love Victoria and never tell her secret. It's been an absolute amazing time!\"[30]\n\nIt was reported in May 2011 that Klum ranked second with estimated earnings of US$20 million on Forbes' list of the World's Top-Earning Models (2010–2011). Forbes noted that since ending her 13-year run as a Victoria's Secret Angel, Klum has become more of a businesswoman than a model. She partnered with New Balance and Amazon.com to launch a clothing line and signed a 20-episode deal to host a new show on Lifetime, called Seriously Funny Kids.[31] In fact, some noted fashion designers have long been commenting on Klum's limited role as a fashion model. Karl Lagerfeld, for example, in 2009 agreed with German designer Wolfgang Joop, who called Klum after she had posed naked on the cover of the German edition of GQ magazine,[32] \"no runway model. She is simply too heavy and has too big a bust\".[33] Lagerfeld observed that neither he nor Claudia Schiffer knew Klum, as she has never worked in Paris and was insignificant in the world of fashion, being \"more bling bling and glamorous than current fashion.\"[34]\n\nProducing\n\nIn December 2004, Klum became the host, judge and executive producer of the reality show Project Runway on the U.S. cable television channel Bravo (airing on Lifetime television beginning in 2009), in which fashion designers compete for the opportunity to show their line at New York Fashion Week and receive money to launch their own fashion line. She received an Emmy Award nomination for the show for each of the first four seasons.[35][36] In 2008, Klum and Project Runway received a Peabody Award, the first time a reality show won the award.[37] Klum was nominated for an Emmy in 2008 for \"outstanding host of a reality or reality-competition show\" for Project Runway, the first year that category was recognized by the Emmys.[36] Klum has been the host, judge and co-producer of Germany's Next Topmodel, the German version of the internationally successful reality television show, since 2006. All twelve seasons aired on the German TV station ProSieben. In 2013, Klum, along with her co-host Tim Gunn won an Emmy Award for Outstanding Host for a Reality or Reality-Competition Program.[38] On 7 September 2018, it was confirmed that Klum, along with Tim Gunn would not be returning to Project Runway for a 17th season on Bravo as they both signed a deal to helm another fashion competition show on Amazon Video.[39]\n\nDesign and other business ventures\n\nKlum designed clothing lines (one for men), featured in the German mail-order catalog \"Otto\". She designed shoes for Birkenstock,[40] jewelry for Mouawad, a clothing line for Jordache, and swimsuits – featured in the 2002 Sports Illustrated Swimsuit Issue.[41] She was one of the designers of the Victoria's Secret lingerie line \"The Body\", named after the nickname she received following her first Victoria's Secret Fashion Show appearance.[42] Her Mouawad jewelry collection debuted on the cable shopping network QVC on 14 September 2006, and 14 of the 16 styles sold out after 36 minutes.[43] Klum's clothing line for Jordache launched on 30 April 2008.[44]\n\nKlum in September 2010\n\nKlum has two fragrances, called \"Heidi Klum\" and \"Me\". She designed makeup for Victoria's Secret as part of their \"Very Sexy Makeup Collection\", titled \"The Heidi Klum Collection\". The first run debuted in Fall 2007. A second run was released in Fall 2008.[45] Klum was involved in the development of a namesake rose, the Heidi Klum rose,[46][47] which is available in Germany. For the 2008 US Open, Klum designed a screen print T-shirt which was sold at the US Open shop. It featured childlike butterfly pictures. Proceeds will go to a non-profit organization maintaining the park, which is home to the US Open.[48] Klum became Barbie's official ambassador for the doll's 50th anniversary in 2009, even having made a Barbie doll out of herself.[49] On 1 April that same year, she appeared on the CBS television special, I Get That a Lot, as a girl working at a pizza shop.[citation needed] That same year, she appeared in advertising for Dannon's Light & Fit brand.[50]\n\nKlum and husband Seal announced in June 2010 that they would be making a reality series on Lifetime titled Love's Divine (after Seal's song of the same name.)[51] In January 2010, Klum launched two lines of maternity wear: Lavish by Heidi Klum for A Pea in the Pod, and Loved by Heidi Klum for Motherhood Maternity. Klum stated, \"I experienced fashion challenges during my four pregnancies and combined my knowledge of what works in terms of style, comfort and practicality to create these lines\".[52] In October 2010, Klum with New Balance, HKNB, launched a line of active woman's wear fashion clothing on Amazon.com.[53] In January 2015, Klum launched her lingerie line \"Heidi Klum Intimates\" in Melbourne, Australia.[54] She launched her Intimates collection in collaboration with Bendon in March 2015.[55]\n\nKlum is a \"Real Celebrity\" on the website Stardoll, where she has a line of virtual jewelry, and a virtual clothing line called Jordache. Users can go to Klum's suite (address) and interact with her by doing interviews, sending pending requests or dressing Klum's doll.[56] In 2015, she appeared in Australian singer Sia's music video \"Fire Meet Gasoline\",[57] to promote her lingerie line.[58]\n\nIn 2017, Klum released the fashion line Heidi & the City for exclusive sale in Lidl Grocery Stores. It was first presented with a show at the New York Fashion Week.[59]\n\nAmerica's Got Talent\n\nIn March 2013, it was announced that Klum would be joining America's Got Talent replacing Sharon Osbourne as a judge.[60] She judged seasons 8 through 13, and the first season of America's Got Talent: The Champions before her departure was announced in February 2019.[61] In February 2020, it was announced she would be back on the panel for season 15 of the main series.[62]\n\nOther work\n\nKlum is an artist, and had several of her paintings appear in various art magazines in the U.S. On 27 September 2002 she dedicated a sculpture she painted called \"Dog with Butterflies\" to commemorate the role of rescue dogs in the aftermath of 11 September.[63] In 2004, Klum co-authored Heidi Klum's Body of Knowledge with Elle magazine editor Alexandra Postman.[64] The book gives Klum's biography as well as her advice on becoming successful. Prior to that, Klum had been an occasional guest columnist for the German television network RTL's website. She wrote an essay for the German newspaper Die Zeit.[65]\n\nIn November 2006, Klum released her debut single \"Wonderland\", written for a series of television advertisements for the German retailer \"Douglas\".[66] Proceeds were given to a children's charity in her hometown of Bergisch Gladbach. She contributed to her husband Seal's 2007 album System, singing the duet \"Wedding Day\", a song that Seal wrote for their wedding.[67]\n\nPersonal life\n\nIn 1997, Klum married stylist Ric Pipino. The couple divorced in 2002.[68] In March 2003, Klum began a relationship with Flavio Briatore, the Italian managing director of Renault’s Formula One team.[69] In December she announced her pregnancy.[70] Soon after, the two split and Klum began dating the musician Seal. Klum gave birth to daughter Helene, nicknamed “Leni”, in May 2004 in New York City.[71] Seal was present for Leni's birth, and according to Klum, Briatore is not involved in Leni's life; she has stated emphatically that \"Seal is Leni's father.\"[72]\n\nKlum and Seal got engaged in December 2004 on a glacier in Whistler, British Columbia[73] and married on 10 May 2005 on a beach in Mexico.[74] They have three biological children together: sons born in September 2005[75] and November 2006,[76] and a daughter born in October 2009.[77] On 21 November 2009, Klum officially adopted Seal's surname and became legally known as Heidi Samuel.[78] Soon after, in December 2009, Seal officially adopted Leni, and her last name was changed to Samuel.[79] During their marriage, Klum and Seal renewed their vows to one another each year on their anniversary in front of family and friends.[80] On 22 January 2012, the couple announced that they were separating after almost seven years of marriage.[81][82][83] She filed for divorce from Seal three months later on 6 April 2012.[84] She also requested that her name be restored to her birth name of Heidi Klum.[85] Their divorce was finalized on 14 October 2014.[86]\n\nKlum dated her bodyguard, Martin Kirsten, from 2012 to 2014.[87] She started dating art curator Vito Schnabel in 2014. They broke up in 2017 after three years of dating.[88]\n\nIn May 2018, Klum made public her relationship with Tokio Hotel guitarist Tom Kaulitz through Instagram posts and appearances at Cannes Film Festival. The two were first romantically linked in March of the same year.[89] On 24 December 2018, after approximately one year of dating, Klum announced on her Instagram that she and Kaulitz were engaged and posted a picture of the couple where the ring was showing with the caption \"I SAID YES\" followed with a red heart emoji.[90] Klum privately married Kaulitz in February 2019.[91] The couple's wedding ceremony was held on the yacht Christina O in Italy in August 2019.[92]\n\nIn an interview with Ocean View, Klum has described herself as a nudist, stating \"I grew up very free... not hiding or feeling insecure about myself or my body. As much as I love wearing beautiful lingerie and clothes, I also love not wearing too much. It's a free feeling that I've had since being a small child growing up in Germany. I had parents that never hid from me when they changed clothing or when I walked into the room. When we would go to the beach, my mom would sunbathe topless.\"[93]\n\nBomb threat during GNTM live finale\n\nDuring the live finale of the 10th season of Germany's Next Top Model in the Mannheim SAP Arena on 14 May 2015, a telephone call by a woman came in at 9:07 pm, threatening that a bomb would go off during the live show. The organizer decided to have the hall evacuated and then to call the police. In the meantime, the live broadcast had been canceled and a note was shown to the television viewers, stating that the show had been interrupted due to technical issues. Later on, a man was arrested after he came near Klum, issuing another bomb threat. Thereupon, she was evacuated along with her daughter Leni and the two other judges. A suspicious suitcase was found, which turned out to be a hoax.[94]\n\nPhilanthropy\n\nOn 30 April 2011, Klum led Walk for Kids, a community 5K walk to raise funds as part of Children's Hospital Los Angeles community awareness efforts.[95] In May 2014, Klum was honoured with the Crystal Cross Award of the American Red Cross for her charity work, most notably for her contributions to the Red Cross after Hurricane Sandy.[96]\n\nFilmography\n\nAwards and nominations\n\nSee also", "images": ["http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/21px-P_vip.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Audio_a.svg/24px-Audio_a.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Heidi_Klum_%282010%29.jpg/220px-Heidi_Klum_%282010%29.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/24px-Flag_of_the_United_States.svg.png", "http://upload.wikimedia.org/wikipedia/commons/4/42/Heidi_Klum4crop.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/73/BathingSuit1920s.jpg/24px-BathingSuit1920s.jpg", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/07/Heidi_Klum_by_Glenn_Francis.jpg/220px-Heidi_Klum_by_Glenn_Francis.jpg", "http://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/Heidi_Klum_by_Glenn_Francis.jpg/1200px-Heidi_Klum_by_Glenn_Francis.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/b/ba/Flag_of_Germany.svg/24px-Flag_of_Germany.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Emmys-bennett-klum-seal.jpg/220px-Emmys-bennett-klum-seal.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/24px-Blank_television_set.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/Heidi_Klum_by_Glenn_Francis.jpg/1200px-Heidi_Klum_by_Glenn_Francis.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Heidi_Klum", "title": "Heidi Klum", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/Heidi_Klum_by_Glenn_Francis.jpg/1200px-Heidi_Klum_by_Glenn_Francis.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}