{"url": "www.nationalenquirer.com/photos/ellen-degeneres-portia-derossi-breakup/", "text": "Ellen DeGeneres — after a fight to end all fights that climaxed with Ellen ripping off her wedding ring — has fled the marital home she shares with Portia de Rossi , and multiple sources have claimed the stage is set for a blockbuster $400 million divorce! Photo credit: Getty Images/InStar\n\nThe National ENQUIRER has learned Ellen left In a bombshell world exclusive,has learned Ellen left the couple’s love nest and has agreed to an off-listing sale of the marital estate they bought together just eight months ago! Photo credit: Mega\n\n“It’s all very shady and ominous. Ellen went to great lengths to keep the news from their close friends to avoid being asked questions,” an insider claimed. “She and Portia were fighting more and more. Eventually, what normally would have been a routine back-and-forth turned nasty .” Photo credit: Mega\n\nEllen has publicly insisted the couple’s marriage is on solid ground. But sources have exclusively told The ENQUIRER the pair have been spending nights alone, and now they appear to be living completely apart. Photo credit: Mega\n\nProperty records show Ellen and Portia — who will be married for ten years on Aug. 16 — maintained two separate residences on the six-acre equestrian estate in exclusive Montecito, Calif., which recently sold for $11 million. Photo credit: Files\n\nIn yet another clue to their marital woes , just weeks after they paid $7.2 million for the sprawling property last September, Ellen quietly snapped up a place of her own nine miles away in Carpinteria! Photo credit: Files\n\nSources claimed the $77 million-a-year TV chatterbox is holed up at this $18.6 million beachfront mansion, which she secretly purchased in October 2017. “It didn’t bode well for the long term when Ellen bought that home,” a source claimed. Photo credit: Mega\n\nThe talk-show host is a notorious house-flipper — investing in properties before cashing out when the real-estate market heats up. But according to sources, her recent spree is less about the money and more about having separate residences as she and Portia inch closer toward officially separating. Photo credit: Mega\n\n“They spend less and less time together ,” said one source. “In fact, they’ve been living separate lives. It’s gotten so bad that they hardly say a word to each other all day.” Photo credit: Mega\n\n“Portia feels neglected and mistreated,” another insider told The ENQUIRER. “She feels as if she supports Ellen in everything she does, while Ellen just gets aggravated and judgmental when it comes to her needs.” Photo credit: Mega\n\nIf they do announce a divorce, it promises to be one of the most expensive in Hollywood history! “With their combined fortune, future earnings and property totaling $400 million, it’ll be a good day to be their divorce lawyers!” claimed an insider. Photo credit: Mega\n\n“The idea of going through that mess is probably the glue that’s kept them together this long!” A sour-faced Ellen was pictured without her wedding ring during a Beverly Hills shopping spree on April 20. At the time, talk heated up that her high-profile union was under pressure. Photo credit: Mega\n\nBut in the days that followed, she and Portia paraded their “happy” marriage in front of paparazzi at multiple Hollywood hot spots, usually arm in arm and sporting painful smiles. “Nobody is convinced,” a source said. “They aren’t intimate!” Photo credit: Mega\n\nWhile a friend of Ellen’s brushed off talk of divorce, the couple’s marriage has exploded many times before, according to inside sources. But The ENQUIRER’s mole fears the worst as Portia continues to spend days alone at her own $17.3 million bolt-hole in Beverly Hills. Photo credit: Mega\n\n“It’s usually Portia who walks out whenever they fight,” the insider claimed. “Ellen has a great TV personality, but at home she’s a bore who goes to bed every night at nine.” “Arrested Development” star Portia has also complained Ellen cares more about her fur-shedding cats and dogs, said the source. Photo credit: Getty Images", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAUEBAAAACwAAAAAAQABAAACAkQBADs=", "https://cdn-neq0.heartyhosting.com/wp-content/themes/vip/am-neq/images/svg/logo-tag-registered-green.svg", "https://cdn-neq0.heartyhosting.com/wp-content/themes/vip/am-neq/images/svg/logo-tag-registered.svg", "https://secure.gravatar.com/avatar/04f082eec183205c28a957949c1a0389?s=64&d=identicon&r=g", "https://i0.heartyhosting.com/www.nationalenquirer.com/wp-content/uploads/2018/06/ellen-degeneres-portia-derossi-breakup-FF.jpg?resize=540%2C400&ssl=1", "https://i0.heartyhosting.com/www.nationalenquirer.com/wp-content/uploads/2020/02/Hot-pics-feb-2020-jlo-shakira-n.jpg?resize=300%2C194&ssl=1", "https://i0.heartyhosting.com/www.nationalenquirer.com/wp-content/uploads/2018/06/ellen-degeneres-portia-derossi-breakup-FF.jpg?fit=640%2C400&ssl=1", "https://i0.heartyhosting.com/www.nationalenquirer.com/wp-content/uploads/2018/06/ellen-degeneres-portia-derossi-breakup-FF.jpg?resize=408%2C229&ssl=1", "https://cdn-neq0.heartyhosting.com/wp-content/themes/vip/am-neq/images/nationalenquirer-logo.svg"], "top_img": "https://i0.heartyhosting.com/www.nationalenquirer.com/wp-content/uploads/2018/06/ellen-degeneres-portia-derossi-breakup-FF.jpg?fit=640%2C400&ssl=1", "keywords": [], "authors": ["National Enquirer Staff"], "canonical_link": "https://www.nationalenquirer.com/photos/ellen-degeneres-portia-derossi-breakup/", "title": "Ellen DeGeneres Dumps Portia De Rossi", "meta_data": {"viewport": "width=device-width, user-scalable=0", "msapplication-TileColor": "#da532c", "msapplication-TileImage": "/images/favicon/mstile-144x144.png", "msapplication-config": "https://cdn-neq0.heartyhosting.com/wp-content/themes/vip/am-neq/images/favicon/browserconfig.xml", "theme-color": "#ffffff", "google-site-verification": "kONM_PqGX8Za53dFcExSTIIPZxxN_S4QtvDlONzzdA0", "description": "Ellen DeGeneres — after a fight to end all fights that climaxed with Ellen ripping off her wedding ring — has fled the marital home she shares with Portia de Rossi, and multiple sources have claimed the stage is set for a blockbuster $400 million divorce!", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "news_keywords": "ellen degeneres", "generator": "WordPress 5.3.2", "og": {"type": "article", "title": "Ellen DeGeneres Dumps Portia De Rossi", "url": "https://www.nationalenquirer.com/photos/ellen-degeneres-portia-derossi-breakup/", "description": "Ellen DeGeneres — after a fight to end all fights that climaxed with Ellen ripping off her wedding ring — has fled the marital home she shares with Portia de Rossi, and multiple sources have claime...", "site_name": "National Enquirer", "image": "https://i0.heartyhosting.com/www.nationalenquirer.com/wp-content/uploads/2018/06/ellen-degeneres-portia-derossi-breakup-FF.jpg?fit=640%2C400&ssl=1"}, "article": {"published_time": "2018-06-13T14:22:13+00:00", "modified_time": "2018-06-13T15:22:31+00:00", "author": "https://www.nationalenquirer.com/author/nestaff/"}, "fb": {"app_id": 953902771314199}, "twitter": {"card": "summary_large_image", "title": "Ellen DeGeneres Dumps Portia De Rossi", "description": "Ellen DeGeneres — after a fight to end all fights that climaxed with Ellen ripping off her wedding ring — has fled the marital home she shares with Portia de Rossi, and multiple sources have claimed t...", "image": "https://i0.heartyhosting.com/www.nationalenquirer.com/wp-content/uploads/2018/06/ellen-degeneres-portia-derossi-breakup-FF.jpg?fit=640%2C400&ssl=1"}}, "movies": [], "publish_date": 1528899733.0, "source": "http://www.nationalenquirer.com", "summary": ""}