{"url": "https://www.cosmopolitan.com/entertainment/celebs/a12786652/sarah-jessica-parker-kim-cattrall-sex-and-the-city-feud-timeline/", "text": "Stream It HBO\n\nFebruary 2004: Sex and the City airs its final episode on HBO after six seasons. As revealed in later interviews, the first SATC movie was supposed to go into production not long after the series wrap, but was delayed due to several factors, including rumored salary negotiations. According to The Telegraph in 2008, tensions between Kim Cattrall and the rest of the cast worsened after she asked for a raise in wake of Sarah Jessica Parker's season two promotion to executive producer. Insiders told The Telegraph that SJP, Kristin Davis, and Cynthia Nixon began to distance themselves from Cattrall even during “mealtimes.” (In a 2010 interview with Marie Claire, Davis would shoot down this mealtime rumor, calling it “ridiculous.”)\n\nSeptember 2004: The distance makes its way to the Emmys as Cattrall sits noticeably far away from her SATC co-stars. At the HBO after party, all four women are spotted in attendance but only three are photographed celebrating the show's newest Emmys. (SJP and Nixon won for Outstanding Lead Actress in a Comedy Series and Outstanding Supporting Actress in a Comedy Series, respectively.)\n\nGetty\n\nGetty\n\nGetty\n\nCattrall later offered this explanation (via The Telegraph), “Are we the best of friends? No. We’re professional actresses. We have our own separate lives.”\n\nDecember 2004: In an interview with Jonathan Ross, Cattrall offers some light on the long-rumored salary negotiations. “I felt after six years it was time for all of us to participate in the financial windfall of Sex and the City. When they didn’t seem keen on that I thought it was time to move on.” Cattrall added that she had asked for $1 million per episode (more than double the reported $350,000 she was making).\n\nMay 2008: Speaking to The Telegraph on the set of the first SATC movie (in an interview published the week the movie was released), SJP defends her friendship with Cattrall and commends her for bringing up the whole paycheck issue. “Honestly, we are all friends and I wish I saw more of Kim. She mentioned money and no one should vilify her for it. People made a decision that we had vilified her. No one bothered to say [to the rest of us], ‘Are you disappointed by not making the movie?’ Yes. ‘Do you respect and support her choice to not do it?’ Absolutely.”\n\nIn the same interview, Cattrall says she was going through “a really tough time” when initial discussions for the movie began. “I was going through a divorce and my job of seven years was coming to an end. Then my dad was diagnosed with dementia. So I took a step back and returned to Canada, where my family is – that’s the reason behind it. It wasn’t all about the money.”\n\nKim Cattrall and Sarah Jessica Parker at the Sex and the City movie premiere in NYC in May 2008. Getty\n\nJune 2008: In a Marie Claire roundup published in support of the first SATC film’s release, feud rumors and contract disputes are brought up again. According to series creator Darren Star, the cast’s “chemistry” was never forced. “When you do a series for so many years, you can’t fake it completely.” Says Chris Albrecht, former CEO of HBO, “Sarah was becoming more and more famous, and her salary increased beyond what was contractually committed, which is normal for hit shows. The other actresses wanted to keep up.” Mario Cantone (Anthony on SATC), also chimed in: “Certain people were vilified in some articles, and others were vilified in other articles. It's interesting how they never write stuff like that about the men on The Sopranos. They always go after the women. They just do.”\n\nNovember 2009: In an interview with Elle, SJP says, “I don’t think anybody wants to believe that I love Kim. I adore her. I wouldn’t have done the movie without her. Didn’t and wouldn’t,” referring to the delays in making the first SATC movie.\n\nJanuary 2010: When the alleged feud is brought up during an interview with The Daily Mail, Cattrall offers this: “I think Sarah was right: people don’t want to believe that we get on. They have too much invested in the idea of two strong, successful women fighting with each other. It makes for juicy gossip and copy. The truth of us being friends and getting along and happily doing our jobs together is where near as newsworthy. I think Sarah is fantastic… She and I are sick of this. It’s exhausting talking about it, and a real bore. Next?”\n\nKim Cattrall and Sarah Jessica Parker on the set of the final season of Sex and the City in 2003. Getty\n\nMay 2010: Ahead of Sex and the City 2’s release, the four women address the longtime feud rumors that won’t seem to quit in Marie Claire. “When you’re on set, you’re working 90-hour weeks, you’re never home, you’re exhausted,” says SJP. “There are times when all of us have been sensitive, and sometimes feelings get hurt. But I don’t have any regrets about how I’ve treated people.” Cattrall says the cast’s “chemistry” remains \"very strong,” adding that the feud rumors haven’t been laid to rest because of the press. “Things just have to be explosive for no other reason than for people’s imaginations.”\n\nJune 2016: Speaking to The Daily Record, Cattrall says it doesn’t feel right to make a third SATC movie, given the change in “climate.” She also adds that the cast’s respective schedules would get in the way. “Everyone is doing their own thing and if it was going to happen, it would have happened by now. It would be a challenge to do a third installment. It could be fun though. To say goodbye completely to Samantha would be pretty hard.\"\n\nAugust 2016: SJP wishes Cattrall a happy 60th birthday by posting this throwback on Instagram, along with the message, “Sending love and the very best for a perfectly marvelous, joyous, healthy and adventure filled birthday year. Your ol’ pal, fellow mischief maker and “sister.”\n\nSeptember 2016: On how she’s dealt with rumors of feuds with SATC cast mates through the years, SJP tells Time, “It was always so heartbreaking to me that there was this narrative about Kim and myself because it just didn’t reflect anything that happened on that set. They just didn’t do it to the Sopranos guys. It was so strange to me and upsetting. I posted something on Kim’s birthday and people were like “Oh my God, I didn’t know you liked her!” What? We were all at liberty to walk away at any time! But nobody asked those questions of shows with men. Isn’t that interesting?”\n\nOctober 2016: Speaking to Howard Stern on his radio show, SJP continues to highlight the problem with pitting women against each other. \"These were my sisters, these were people that I grew to love and admire… Was every day perfect? Were people always desperately, hopefully in love with each other? No, but this is a family of people who needed each other, relied upon each other, and loved each other. This sort of narrative, this ongoing catfight, it really used to upset. It was usually about bad behavior on the set. I take very seriously, my reputation. I work really hard and I treat people well. I have a work ethic that's very meaningful to me and it's based on the affection I feel for the people I get to work with. To suggest that I'm behaving poorly or not treating somebody well... It would drive me bananas.\"\n\nSeptember 2017: SJP confirms that there are no longer plans to make a third Sex and the City film. “It’s over… we’re not doing it,” she tells Extra. “I’m disappointed. We had this beautiful, funny, heartbreaking, joyful, very relatable script and story. It’s not just disappointing that we don’t’ get to tell the story and have that experience, but more so for that audience that has been so vocal in wanting another movie.”\n\nFollowing the announcement and The Daily Mail’s report that the film was cancelled because Cattrall demanded that Warner Bros. produce her other projects along with SATC 3, Cattrall takes to Twitter to clear the air.\n\nWoke 2 a @MailOnline 💩storm! The only 'DEMAND' I ever made was that I didn't want to do a 3rd film....& that was back in 2016 — Kim Cattrall (@KimCattrall) September 29, 2017\n\nBefore the day ends, Willie Garson (Stanford) shares a cryptic tweet and Kristin Davis says goodbye to Charlotte York on Instagram:\n\nDisappointed for all crew holding on for negotiations to conclude for their jobs, and of course, for the fans. Leave it at that. #Truth — Willie Garson (@WillieGarson) September 29, 2017\n\nOctober 2017: Speaking to Piers Morgan on his show Life Stories (via The Daily Mail), Cattrall continues to make her case. “And now, now at this very moment it’s quite extraordinary to get any kind of negative press about something that I’ve been saying for almost a year of 'no' that I’m demanding or a diva ... I never asked for any money, I never asked for any projects, to be thought of as some kind of diva is absolutely ridiculous.\" Of SJP, she says, “This is really where I take to task the people from Sex and the City and specifically Sarah Jessica Parker in that I think she could have been nicer. I really think she could have been nicer.”\n\nAccording to Cattrall, the means of communication leading up to the demise of SATC 3 was not great. “Another thing that's really disappointing is that nobody ever picks up the phone and tries to contact you and say, 'How you doing?' That would have been the way to handle it… And usually what happens in a healthy relationship is that someone, or a transaction for a job in my business, is that someone says, 'Are you available?' and you say 'Yes' and here's the job and you say 'Yes, but thank you very much but I'm sort of over here right now but thank you very much,' and that person turns to you, and they say 'That's great, good luck to you, I wish you the best.' That's not what happened here, this is, it feels like a toxic relationship.\"\n\nShe also adds, \"This isn’t about more money, this is not about more scenes, it’s not about any of those things. This is about a clear decision, an empowered decision in my life to end one chapter and start another. I’m 61. It’s now.\"\n\nSex and the City Season 2 promo, 1999. HBO | Getty\n\nJanuary 31, 2018: Parker appears on Watch What Happens Live With Andy Cohen and says she is “just heartbroken\" over what has transpired with Cattrall. \"I mean, that whole week, you and I spoke about it endlessly, because I was just… I don’t know, I found it very upsetting because that’s not the way I recall our experience,\" she said.\n\n\"It’s sad,\" she continued. \"But I always think that what ties us together was this singular experience. It was a professional experience but it became personal because it was years and years of our lives. So I’m hoping that that eclipses anything that’s been recently spoken. That many years spent doing something so special that people had a connection with is such a privilege.\"\n\nFebruary 9, 2018: After Cattrall announces the death of her brother on February 4, Parker tells Extra, \"I can't begin to know how her family is managing such a loss. We all send her our love and condolences and grant her the privacy that she's asked for.\"\n\nPrior to that, Parker commented on Cattrall's Instagram (via Us Weekly), saying, \"Dearest Kim, my love and condolences to you and yours and Godspeed to your beloved brother. Xx.\" And on February 8, Parker told Entertainment Tonight, \"If somebody in your life, whether you’re in touch with them or not, [is] suffering for any reason, it’s involuntary that you want to convey condolences or sadness or just let someone know you’re thinking about them.\"\n\n\n\nFebruary 10, 2018: Cattrall posts a scathing message to Parker on Instagram, saying, \"I don't need your love or support at this tragic time @sarahjessicaparker.\"\n\nThe caption reads:\n\nMy Mom asked me today “When will that @sarahjessicaparker, that hypocrite, leave you alone?” Your continuous reaching out is a painful reminder of how cruel you really were then and now. Let me make this VERY clear. (If I haven’t already) You are not my family. You are not my friend. So I’m writing to tell you one last time to stop exploiting our tragedy in order to restore your ‘nice girl’ persona.\n\nCattrall refers followers to a New York Post story about the \"mean-girls culture\" on the set of Sex and the City. According to the article, tensions built on set in part because Cattrall was a scene-stealer, and \"a clique began to form\" between Parker, Cynthia Nixon, and Kristin Davis, \"leaving Cattrall out in the cold.\"\n\nThree days before this latest post, Cattrall had thanked fans, friends, and her \"#SexandtheCity colleagues\" for their \"outpouring of support.\"\n\nFebruary 14, 2018: In a PEOPLE cover story, Parker says she's \"disappointed\" that the third SATC is not happening and takes the opportunity to address Cattrall's \"hurtful\" words from the Piers Morgan interview. \"We had this experience and it was amazing, and nothing will ever be like it. We had a connection with an audience, and we had a connection with the city and with this crew, and we got to tell these crazy stories with each other,\" Parker says. \"So I don’t want to mess with that. I couldn’t imagine anyone else playing that part. So there was no fight; it was completely fabricated, because I actually never responded. And I won’t, because she needed to say what she needed to say, and that is her privilege.”\n\nPeople\n\nApril 23, 2018: In an interview with Vulture, SJP sends the world a friendly reminder. “I’d just like to remind everybody that there is no catfight. I have never uttered an unkind, unsupportive, unfriendly word, so I would love to redefine it. I also want to remind everybody that there were four women on the set and I spent equal time with all of them, so this was not a set with two women who didn’t get along.” Of Cattrall turning down a third SATC film, she said, “I’ve always held Kim’s work in high regard and always [been] appreciative of her contributions. If she chooses not to do the third movie, there’s not a lot I can do to change her mind and we must respect it. That’s the only thing I’ve ever said about it, you know?”", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-81068453-1507484683.jpg?crop=0.897xw:0.573xh;0.103xw,0.217xh&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-81068453-1507484683.jpg?crop=0.897xw:0.573xh;0.103xw,0.217xh&resize=1200:*", "keywords": [], "authors": ["Peggy Truong", "Entertainment Writer", "Peggy Is Cosmopolitan.Com S Entertainment Writer", "Specializing In Leonardo Dicaprio", "This Is Us", "The Royals."], "canonical_link": "https://www.cosmopolitan.com/entertainment/celebs/a12786652/sarah-jessica-parker-kim-cattrall-sex-and-the-city-feud-timeline/", "title": "A Definitive Timeline of Sarah Jessica Parker and Kim Cattrall’s Sex and the City Feud", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "A Definitive Timeline of Sarah Jessica Parker and Kim Cattrall’s Sex and the City Feud", "description": "“Can you ever really forgive, if you can’t forget?”", "url": "https://www.cosmopolitan.com/entertainment/celebs/a12786652/sarah-jessica-parker-kim-cattrall-sex-and-the-city-feud-timeline/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-81068453-1507484683.jpg?crop=0.897xw:0.573xh;0.103xw,0.217xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2018-06-05 08:57:07", "published_time": "2018-04-24 03:45:00", "section": "Celebs", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-81068453-1507484683.jpg?crop=0.897xw:0.573xh;0.103xw,0.217xh&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "A Definitive Timeline of Sarah Jessica Parker and Kim Cattrall’s Sex and the City Feud - SATC Feud Quotes", "description": "In wake of the Sex and the City 3 movie being cancelled, here's a look back at the long rumored feud between Sarah Jessica Parker and Kim Cattrall.", "keywords": "kim cattrall, sarah jessica parker, sex and the city, satc, satc 3, sex and the city movie, satc feud, kim cattrall sjp feud", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-81068453-1507484683.jpg?crop=0.788xw:1.00xh;0.183xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrities & Entertainment,entertainment,celebs,SATC,Sex And The City,Kim Cattrall,Sarah Jessica Parker", "sailthru.date": "2018-04-24T15:45:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-81068453-1507484683.jpg?crop=0.897xw:0.573xh;0.103xw,0.217xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-81068453-1507484683.jpg?crop=0.788xw:1.00xh;0.183xw,0", "sailthru.socialtitle": "A Definitive Timeline of Sarah Jessica Parker and Kim Cattrall’s Sex and the City Feud", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1524512700.0, "source": "https://www.cosmopolitan.com", "summary": ""}