{"url": "https://www.dailynews.com/2017/08/28/ed-skrein-drops-out-of-hellboy-reboot-after-whitewashing-backlash/", "text": "A week after his casting in the upcoming “Hellboy” film sparked a “whitewashing” uproar, British actor Ed Skrein has decided to exit the project.\n\n“I accepted the role unaware that the character in the original comics was of mixed Asian heritage,” Skrein said in a lengthy statement Monday on Twitter. “It is clear that representing this character in a culturally accurate way holds significance for people, and that to neglect this responsibility would continue a worrying tendency to obscure ethnic minority stories and voice in the Arts.”\n\nSkrein — previously best known for a role in “Deadpool” — made headlines after it was announced on Aug. 21, that he would play Major Ben Daimio, a Japanese-American ex-Marine in the original comic book series by Mike Mignola.\n\nThe actor said Monday, he feels it is important to respect the character’s heritage as originally written and for that reason, he is leaving the film.\n\n“I have decided to step down so the role can be cast appropriately,” he said. “Representation of ethnic diversity is important, especially to me as I have a mixed heritage family. It is our responsibility to make moral decisions in difficult times and to give voice to inclusivity.”\n\n• RELATED STORY: ‘Hellboy’ casting sparks ‘whitewashing’ storm: ‘It just doesn’t make sense’\n\nFans and critics blasted the casting last week, saying it was another example of Hollywood “whitewashing” a character that was originally intended to be Asian.\n\nAmong those critics was Guy Aoki, founding president of MANAA, the Media Action Network for Asian Americans — a media watchdog group based in Los Angeles.\n\nAoki appeared caught off guard by Skrein’s swift about-face.\n\n“We’re pleasantly surprised that Skrein volunteered to not do the role after understanding how much of an uproar it created in the Asian-American community. We want to thank him for that,” Aoki said Monday. “We think it’s a model for other [non-Asian] actors to follow. If you get offered a role that was supposed to be an Asian role, you might want to politely decline and suggest that they get someone who’s more appropriate for it.”\n\nMatt Donnelly, senior film reporter at Hollywood business website TheWrap.com, also praised the actor’s decision.\n\n“It makes Ed Skrein look really thoughtful and responsible, and sort of committed to making sure that diversity and people of different ethnic backgrounds are represented the right way in film,” Donnelly said.\n\nProducers of “Hellboy: Rise of the Blood Queen” suddenly found themselves off the hook after facing intense criticism over the casting, and thanked the actor.\n\n“Ed came to us and felt very strongly about this. We fully support his unselfish decision,” producers Larry Gordon, Lloyd Levin, Millennium Films and Lionsgate said in a joint statement issued to the Southern California News Group. “It was not our intent to be insensitive to issues of authenticity and ethnicity, and we will look to recast the part with an actor more consistent with the character in the source material.”\n\nThis isn’t the first time Hollywood has come under fire for hiring a non-Asian actor to play an Asian character. Among the other controversial castings were Emma Stone as a part-Hawaiian, part-Chinese woman in 2015’s “Aloha” and Scarlett Johansson as a cyborg in “Ghost in the Shell,” a 2017 remake of a Japanese anime film.\n\nEach of those castings ignited a firestorm of criticism on social media as well, and the films underperformed at the box office. While executives brushed off those previous controversies, Donnelly called the lightning-speed “Hellboy” development a possible game-changer in Hollywood.\n\n“Hopefully we’ll get to a point where this doesn’t happen in the first place, the casting never goes down where you hire the white guy who’s supposed to play an Asian character,” he said. “But I think the fact that it’s been addressed so quickly is really promising.”", "images": ["https://www.dailynews.com/wp-content/uploads/2017/08/ladn-no-margin.svg", "https://www.dailynews.com/wp-content/uploads/migration/2017/201708/NEWS_170829523_AR_0_ZZUDJKGRZRND.jpg?w=1024&h=670", "https://secure.gravatar.com/avatar/?s=85&d=mm&r=g", "https://secure.gravatar.com/avatar/37bd654020f336322dbfbb8541bf35a5?s=85&d=mm&r=g", "https://www.dailynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg"], "top_img": "https://www.dailynews.com/wp-content/uploads/migration/2017/201708/NEWS_170829523_AR_0_ZZUDJKGRZRND.jpg?w=1024&h=670", "keywords": [], "authors": ["Anita Bennett", "Matthew Carey", "Senior Editor", "Anita Bennett Is Senior Editor For The Los Angeles Daily News."], "canonical_link": "https://www.dailynews.com/social-affairs/20170828/ed-skrein-drops-out-of-hellboy-reboot-after-whitewashing-backlash", "title": "Ed Skrein drops out of ‘Hellboy’ reboot after ‘whitewashing’ backlash", "meta_data": {"application-name": "dailynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 55107646487}, "og": {"type": "article", "title": "Ed Skrein drops out of ‘Hellboy’ reboot after ‘whitewashing’ backlash", "url": "https://www.dailynews.com/social-affairs/20170828/ed-skrein-drops-out-of-hellboy-reboot-after-whitewashing-backlash", "description": "A week after his casting in the upcoming “Hellboy” film sparked a “whitewashing” uproar, British actor Ed Skrein has decided to exit the project.“I accepted the r…", "site_name": "Daily News", "image": {"identifier": "https://www.dailynews.com/wp-content/uploads/migration/2017/201708/NEWS_170829523_AR_0_ZZUDJKGRZRND.jpg?w=1024&h=670", "width": 1024, "height": 670}, "locale": "en_US"}, "article": {"published_time": "2017-08-29T00:08:35+00:00", "modified_time": "2017-09-01T15:41:28+00:00"}, "twitter": {"site": "@ladailynews", "text": {"title": "Ed Skrein drops out of ‘Hellboy’ reboot after ‘whitewashing’ backlash"}, "image": "https://www.dailynews.com/wp-content/uploads/migration/2017/201708/NEWS_170829523_AR_0_ZZUDJKGRZRND.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.dailynews.com/wp-content/uploads/2017/08/site-icon-ladn.png?w=270"}, "movies": [], "publish_date": 1503849600.0, "source": "https://www.dailynews.com", "summary": ""}