{"url": "https://www.foxnews.com/entertainment/second-wives-club-star-shawna-craig-talks-marriage-to-lorenzo-lamas-being-a-surrogate-to-his-daughter-shayne", "text": "When Shawna Craig first met Lorenzo Lamas in 2011, she didn’t think the two would start a romance. For starters, the “Falcon Crest” and “Renegade” actor was already involved with someone else.\n\nThe 31-year-old actress and model was first introduced to the 59-year-old through a friend in Los Angeles, who suggested the pair should date.\n\n“Lorenzo said, ‘Oh, I would love to, but I have a girlfriend,’” Craig told Fox News. “So it was kind of an awkward transition. I thought we could be friends.”\n\nWHY 'SECOND WIVES CLUB' SHIVA SAFAI TURNED DOWN 'REAL HOUSEWIVES OF BEVERLY HILLS'\n\nBut a week after the initial meeting, the two saw each other again — and this time the actor made a move.\n\n“He said, ‘I’d like to take you out on a date, if that’s OK,’” she recalled. “I said, ‘Well, you have a girlfriend and I would never do that.’ Then he said, ‘I actually broke up with her because it wasn’t a serious relationship. I wanted to be honest with you and start things off properly with you. That’s all buttoned up now and I would like to take you out.’”\n\nAnd after three months of dating, Lamas proposed.\n\n“He showed me the ring. And I said, ‘Oh, no, no, no,'” said Craig. “I mean, it had only been three months… [but] we were engaged for a little over a year and then got married in Mexico. It was great.”\n\nBut marrying the actor wasn’t all glitz and glamour. Lamas, who was previously married four times and has six children, was faced with financial issues.\n\nIn 2015, Lamas told Fox News he didn’t have his former wives sign prenuptial agreements because “It’s like you’re almost professing failure at the outset.” In addition, he grew tired of waiting for a phone call to “get me on another B-movie,” prompting him to pursue a new role as a commercial pilot.\n\nStill, Craig insisted Lamas’ past didn’t make her think twice about the marriage.\n\n“No, it didn’t make me question anything because he’s such an honest, good person and my best friend, first and foremost,” she explained. “[But] it did bother me. I just felt like he had spent all of his time, energy, and resources on these people who I didn’t really feel had his best interest at heart and didn’t love him as much as I love him unconditionally.\n\n\"So it would always make me sad that he struggled with his finances… I thought, ‘I wish our lives had started off easier where we can have fun and enjoy each other' instead of, from the very beginning, be stressed with all the things that come along with being with Lorenzo. But that’s something I’ve always struggled with. It has gotten better in the last year or so, but… I would get very said about it and I cried. It was hard.”\n\nCraig recently chronicled their relationship in front of cameras for E!’s “Second Wives Club” where she, along with three other celebrity wives, reveal what their high-profile marriages are really like. She believed discussing her husband’s finances made them more relatable to audiences.\n\n“I think the way that was put together, I didn’t really say it exactly the way it came across,” she admitted. “It is definitely an issue because he’s got three kids that are still young and he’s taking care of them… but I think a lot of people go through that. Sometimes finances are great, sometimes it’s hard. I think that’s really relatable. There’s no shame in struggling… I think that’s just life.”\n\nViewers also learned how Craig willingly took on the role of step-mom despite not wanting children of her own.\n\n“It was never something Lorenzo said I needed to do,” she said. “It was a lot for one person to handle, especially a single dad… My mom was a single mother and the girls were really young when I came into Lorenzo’s life. I just thought they needed guidance, structure, and stability. I knew I could provide that to them. It made me happy to do that. I’m really proud of it.”\n\nCraig particularly bonded with 31-year-old Shayne Lamas. When Lamas’ eldest daughter suffered a near-fatal miscarriage in 2014 that resulted in a full hysterectomy, Craig volunteered to become her surrogate.\n\n“I never wanted to have children of my own. I always knew I wanted to help in some form,” said Craig. “I started out as an egg donor and I did that many times. And all the couples were able to have children because of it. I thought, ‘I’m not going to be doing egg donations for much longer, I would love to carry a child.\n\n\"I offered my assistance to Shayne and [her husband] Nik. They were hesitant about it. I said, ‘Take your time and think about it. If this is something you’d like to move forward with, I’m here.’ And so week later, they called me and said, ‘Let’s do it, we’re on board.’”\n\nThe couple welcomed their second child together on July 4, 2015. Craig enjoyed every moment of carrying the baby boy named Lyon.\n\n“Honestly, if I could be pregnant my whole life, I would,” she gushed. “I love being pregnant, it’s so much fun. I know that sounds crazy, but I love it. Shayne is so happy and feels very fulfilled on having a little boy and girl. She’s definitely got her hands full.”\n\nStill, Craig stressed she and her husband have zero plans to have children of their own.\n\n“We actually thought about in vitro for about a week,” she said. “And I was like, ‘No, I can’t do it.’ He was kind of upset about it, but he looks back and goes, ‘Thank you so much. I’m going to get a little bit of my life to do my own thing. And if we had kids, I don’t know. I’d been raising kids my whole life.’ It’s definitely not something I see for myself. Being a surrogate? I’m positive I’ll do it at least once or twice more.”", "images": ["https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2020/04/270/152/Mafia-Hit-Man.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/02/348/196/meghan-markle-red.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/07/348/196/em-rata-getty.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2020/04/270/152/AP20104012734692.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/08/348/196/liz-hurley.jpg?ve=1&tl=1", "https://a57.foxnews.com/media2.foxnews.com/BrightCove/694940094001/2017/06/28/931/524/694940094001_5485874508001_-Second-Wives-Club--star-talks-marriage-to-Lorenzo-Lamas.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2020/03/348/196/Lorenzo-twitter.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/02/348/196/lauren-sanchez-jeff-bezos.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/10/270/152/RT-Hollywood-sign.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2020/03/348/196/Screen-Shot-2020-03-17-at-9.39.14-AM.png?ve=1&tl=1", "http://media2.foxnews.com/BrightCove/694940094001/2017/06/28/694940094001_5485874508001_-Second-Wives-Club--star-talks-marriage-to-Lorenzo-Lamas.jpg", "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/e4bdc6f3-8d06-4623-b934-f4a25899cb6c/dc192956-9929-4f64-abb4-d9b8827a6fac/1280x720/match/270/152/image.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2018/09/348/196/elvispresleyreuters.jpg?ve=1&tl=1"], "top_img": "http://media2.foxnews.com/BrightCove/694940094001/2017/06/28/694940094001_5485874508001_-Second-Wives-Club--star-talks-marriage-to-Lorenzo-Lamas.jpg", "keywords": [], "authors": ["Stephanie Nolasco"], "canonical_link": "https://www.foxnews.com/entertainment/second-wives-club-star-shawna-craig-talks-marriage-to-lorenzo-lamas-being-a-surrogate-to-his-daughter-shayne", "title": "'Second Wives Club' star Shawna Craig talks marriage to Lorenzo Lamas, being a surrogate to his daughter Shayne", "meta_data": {"viewport": "width=device-width, minimum-scale=1.0, initial-scale=1.0", "description": "When Shawna Craig first met Lorenzo Lamas in 2011, she didn’t think the two would start a romance.", "prism.channel": "fnc", "prism.section": "entertainment", "prism.aggregationType": "subsection", "pagetype": "article", "content-creator": "tiger", "dc.creator": "Stephanie Nolasco", "dc.title": "'Second Wives Club' star Shawna Craig talks marriage to Lorenzo Lamas, being a surrogate to his daughter Shayne", "dcterms.abstract": "When Shawna Craig first met Lorenzo Lamas in 2011, she didn’t think the two would start a romance.", "dc.type": "Text.Article", "dc.description": "When Shawna Craig first met Lorenzo Lamas in 2011, she didn’t think the two would start a romance.", "dc.language": "en-US", "dc.publisher": "Fox News", "dc.format": "text/html", "dc.identifier": "urn:uri:base64:d9321ae8-01e8-5bda-9f04-473d59fb2a85", "dc.source": "Fox News", "dc.date": "2017-06-27", "dcterms.created": "2017-06-27T12:22:14-04:00", "dcterms.modified": "2017-06-28T11:55:46-04:00", "og": {"title": "'Second Wives Club' star Shawna Craig talks marriage to Lorenzo Lamas, being a surrogate to his daughter Shayne", "description": "When Shawna Craig first met Lorenzo Lamas in 2011, she didn’t think the two would start a romance.", "type": "article", "image": "http://media2.foxnews.com/BrightCove/694940094001/2017/06/28/694940094001_5485874508001_-Second-Wives-Club--star-talks-marriage-to-Lorenzo-Lamas.jpg", "url": "https://www.foxnews.com/entertainment/second-wives-club-star-shawna-craig-talks-marriage-to-lorenzo-lamas-being-a-surrogate-to-his-daughter-shayne", "site_name": "Fox News"}, "robots": "noarchive, noodp", "twitter": {"card": "summary_large_image", "site": "@foxnews", "title": "'Second Wives Club' star Shawna Craig talks marriage to Lorenzo Lamas, being a surrogate to his daughter Shayne", "description": "When Shawna Craig first met Lorenzo Lamas in 2011, she didn’t think the two would start a romance.", "image": "https://a57.foxnews.com/media2.foxnews.com/BrightCove/694940094001/2017/06/28/1024/512/694940094001_5485874508001_-Second-Wives-Club--star-talks-marriage-to-Lorenzo-Lamas.jpg?ve=1&tl=1", "url": "https://www.foxnews.com/entertainment/second-wives-club-star-shawna-craig-talks-marriage-to-lorenzo-lamas-being-a-surrogate-to-his-daughter-shayne"}, "fb": {"app_id": 116027085089150}, "article": {"opinion": "false"}, "classification": "/FOX NEWS/ENTERTAINMENT/EVENTS/Couples,/FOX NEWS/ENTERTAINMENT", "classification-isa": "couples,entertainment"}, "movies": [], "publish_date": null, "source": "https://www.foxnews.com", "summary": ""}