{"url": "https://web.archive.org/web/20180430105110/https://en.wikipedia.org/wiki/Jersey_Shore:_Family_Vacation", "text": "Jersey Shore Family Vacation is an American reality television series that premiered on MTV globally on April 5, 2018. The series follows seven housemates from the original Jersey Shore spending a month living together in Miami, Florida.[1] On February 28, 2018, a second season had been ordered ahead of the series premiere.[2]\n\nOn November 27, 2017, MTV announced that the cast (with the exception of Sammi) would be reuniting in Miami, Florida for a new reunion season titled Jersey Shore Family Vacation.[3] The series premiered globally on April 5, 2018. According to MTV, it is considered a new series and not the seventh season of the original show.[3][4]\n\nNo. Title Original air date U.S. viewers\n\n(millions)\n\n1 \"What's in the Bag?\" April 5, 2018 ( ) 2.41[5]\n\nAfter five years, the group reunites in Miami for a family vacation, but The Situation's legal issues put his vacation in jeopardy.\n\n2 \"The Ring\" April 5, 2018 ( ) 2.55[5]\n\nRonnie and Deena's unresolved issues resurface; the family is complete with the arrival of The Situation.\n\n3 \"Sunday Vinday\" April 12, 2018 ( ) 1.68[6]\n\nSnooki and Vinny’s past issues resurface causing a heated argument between Snooki and JWoww. Meanwhile, the roommates go rock climbing where Deena and Snooki try to race to the top and the loser has to clean Ronnie’s toilet. Also, The Situation continues to open up about his sobriety and past mistakes.\n\n4 \"Ron Ron Juice\" April 19, 2018 ( ) 1.73[7]\n\nTension between Deena and Ronnie continues to run high, and the night out ends with Ronnie making a questionable choice.\n\n5 \"About Last Night\" April 26, 2018 ( ) 1.44[8]\n\nFollowing the previous episode, Ronnie takes women back to the house and tries to cheat on his girlfriend. However, the rest of the housemates talk him out of it. The next day, Ronnie begins to have regrets when he discovers that cell phone footage of him at the club shows up on social media. Meanwhile, the roommates rent a yacht for the day. Also, The Situation considers proposing to his girlfriend Lauren.", "images": ["https://web.archive.org/web/20180430105110im_/https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://web.archive.org/web/20180430105110im_/https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://web.archive.org/web/20180430105110im_/https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://web.archive.org/web/20180430105110im_/https://en.wikipedia.org/static/images/wikimedia-button.png"], "top_img": "https://web.archive.org/web/20180430105110im_/https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20180430105110/https://en.wikipedia.org/wiki/Jersey_Shore:_Family_Vacation", "title": "Jersey Shore: Family Vacation", "meta_data": {"generator": "MediaWiki 1.32.0-wmf.1", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}