{"url": "https://hollywoodlife.com/2017/04/16/the-arrangement-episode-7-season-1-recap-megan-molested-step-brother/", "text": "Megan goes back home and finally opens up to Kyle about her past on the April 16 episode of ‘The Arrangement.’ Plus, Terence goes on a weird drug-induced trip that reveals what he really wants.\n\nKyle and Megan kick off their day with some hot sex in bed. Unfortunately, it doesn’t stay as steamy at they would have preferred. Megan and Kyle are plagued by thoughts of Nate and the LAPD detective. They’re both keeping secrets from each other, and it’s weighing on them.\n\nMegan’s best friend, Tessa, is getting married so she has to head back home for the weekend. She’s officiating! Kyle can’t go because of a work commitment. It’s awkward between them because they’re keeping secrets. Come on, guys. Get it together!\n\nNate calls Megan and says the play might get a run in New York. He needs her help in a meeting to move this forward. Megan is going to be on the east coast for the wedding, so a short trip to NYC isn’t a problem. The thing is, she doesn’t tell Kyle about Nate’s call.\n\nUnderstandably, Kyle is beyond pissed at Terence for forcing him to have sex with the LAPD detective. Kyle’s been avoiding Terence since it all went down. Terence isn’t going to let that fly. “We have to fix this together,” Terence says. “With bullsh*t conversations and apologies and you trying to convince me that everything you did was OK?” Kyle snaps back. Terence tries to calm Kyle down, but Kyle just slams him against a wall. Kyle is finally seeing Terence for who he truly is.\n\nThe Other Side Of Megan Morrison\n\nWith all the drama going on, Kyle decides he needs to get out of LA. He asks Megan to go to wedding with her. She gets a hint that something’s wrong, but Kyle won’t open up to her. There’s also something up with Megan. The last time Megan was back home was for her mother’s funeral.\n\nMegan’s BFF Tessa is a trip. She can read Megan like a book. Immediately, Tessa knows that Megan is conflicted about her new life. Kyle is introduced to Tessa’s family, who happen to be Megan’s second family. Kyle is seeing a side to Megan that he’s never seen before. But there’s a part of Megan who’s not so sure Kyle is going to like what he sees. Later, Tessa asks Megan how it’s going with Kyle. Megan admits that they’ve always had this unspoken, deep connection. She’s just worried that things will fly off the rails.\n\nWhen Megan and Kyle head up to Tessa’s room to crash, Megan’s sees a picture of another friend up on the wall. This woman, Rebecca, is going to be at the wedding. Megan is not OK with it. There’s some drama over a guy named Evan. When Megan goes to get some water, she hallucinates a mysterious man and can’t stop shaking. She breaks down and starts crying.\n\nA Crazy Trip\n\nMeanwhile, Terence goes to see a doctor named Isaac. He takes mushrooms and is encased in a vault filled with water. He goes on a wild trip to figure out what’s wrong with him. This trip takes him deep inside his subconscious and unearths some very interesting things about Terence. During this hallucination, Terence is Kyle. He has everything Kyle has — movie career, fame, and Megan. He wants to be Kyle and have Kyle’s life. This guy is twisted AF.\n\nTerence’s trip ends with him coming face-to-face with Kyle. Here’s the thing about Terence, he knows he’s effed up. “I built my life around helping people, and I don’t care about anybody,” he says. He asks Kyle for help but ends up strangling him. WTF?!\n\nMegan officiates the wedding and spots Rebecca in the crowd. She gets a bit shaken up and Kyle notices. At the the reception, Rebecca comes up to Megan. When Rebecca starts talking about Evan, Megan walks away. Kyle follows and begs Megan to open up. She doesn’t want to talk about Evan. Megan and Kyle dance, but she freaks when she hallucinates Evan again.\n\nA Shocking & Devastating Reveal\n\nOnce again, Kyle tries to help Megan, but she shuts him out. When he’s walking away, she admits she’s upset over her step-brother. She reveals that he molested her when she was 11 years old. She feels like a terrible person because, when he started dating Rebecca, she thought she did something wrong. Rebecca has no idea that Evan took advantage of Megan. That’s why it’s awkward. Thankfully, Evan is no longer a part of the equation. He died after getting mixed up with the wrong crowd, but his presence still lingers.\n\nAfter Megan finally opens up, her relationship with Kyle changes. They’re stronger now. When Megan looks over at Kyle when they’re back at the party, he mouths “I love you.” At the end of the day, it’s only Kyle and Megan.\n\nOn their way home, Megan thanks Kyle for being such an amazing boyfriend. “You let me be exactly the way I needed to be,” she says. Kyle made her feel safe and that means more to her than he could ever know. “You’re always safe with me,” he assures her.\n\nAfter a rendezvous with Anika, Deann goes to Terence to figure out the next step with Kyle’s directing project. Terence tells Deann to make all the decisions. He’s letting go of all the unnecessary BS (for now) and focusing entirely on IHM.\n\nKyle and Megan get back to LA and find his apartment has been broken into. Nothing’s been stolen, which is weird. The police officer warns that someone was likely trying to make a point that they can come in at any time. Who could it have been? LISBETH?!\n\nHollywoodLifers, what did you think of tonight’s episode of The Arrangement?", "images": ["https://i2.wp.com/www.sheknows.com/wp-content/uploads/2020/04/what-i-learned-as-a-17-year-old-girl-in-the-boy-scouts.jpg?resize=230%2C135&ssl=1", "https://pmchollywoodlife.files.wordpress.com/2020/04/rolling-stones-performance-one-world-nbc-ftr.jpg?w=143&h=80&crop=1", "https://scstylecaster.files.wordpress.com/2020/04/bean-bag-chairs.jpg?resize=230%2C135", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=hollywoodlife.com&path=%2F2017%2F04%2F16%2Fthe-arrangement-episode-7-season-1-recap-megan-molested-step-brother%2F&ct=article&lob=hollywoodlife&loc=us&env=desktop&post_id=2551008&comment_count=1", "https://pmchollywoodlife.files.wordpress.com/2020/04/lady-gaga-performance-one-world-nbc-ftr.jpg?w=143&h=80&crop=1", "https://pmchollywoodlife.files.wordpress.com/2015/02/avery_arya.jpg?w=64&h=64&crop=1", "https://pmchollywoodlife.files.wordpress.com/2018/06/hl_logo.png?w=128", "https://i1.wp.com/www.rollingstone.com/wp-content/uploads/2020/04/office-chairs.jpg?resize=230%2C135&ssl=1", "https://pmchollywoodlife.files.wordpress.com/2020/04/taylor-swift-then-vs-now-shutterstock-ftr.jpg?w=143&h=80&crop=1", "https://pmctvline2.files.wordpress.com/2020/04/lady-gaga-one-world-together-at-home.png?resize=230%2C135", "https://pixel.quantserve.com/pixel?a.1=p-6fKiDaopTGEQg&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pmchollywoodlife.files.wordpress.com/2017/04/the-arrangement-tv-recap-ftr-6.jpg", "https://pixel.wp.com/b.gif?v=noscript", "https://i0.wp.com/www.indiewire.com/wp-content/uploads/2020/04/10546188dy.jpg?resize=230%2C135&ssl=1", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://pmchollywoodlife.files.wordpress.com/2017/04/the-arrangement-tv-recap-ftr-6.jpg", "keywords": [], "authors": ["Avery Thompson", "Melody Fewx", "Lana Parker", "Nick Caruso", "Oscar Hartzog", "Ryan Lattanzio", "Entertainment Director"], "canonical_link": "https://hollywoodlife.com/2017/04/16/the-arrangement-episode-7-season-1-recap-megan-molested-step-brother/", "title": "‘The Arrangement’ Recap: Megan Reveals A Heartbreaking Secret About Her Past", "meta_data": {"description": "Megan goes back home and finally opens up to Kyle about her past on the April 16 episode of 'The Arrangement.' Plus, Terence goes on a weird drug-induced trip that reveals what he really wants.", "news_keywords": "The Arrangement, TV recaps", "apple-itunes-app": "app-id=1400650284", "generator": "WordPress.com", "og": {"type": "article", "title": "‘The Arrangement’ Recap: Megan Reveals A Heartbreaking Secret About Her Past", "url": "https://hollywoodlife.com/2017/04/16/the-arrangement-episode-7-season-1-recap-megan-molested-step-brother/", "description": "Megan goes back home and finally opens up to Kyle about her past on the April 16 episode of ‘The Arrangement.’ Plus, Terence goes on a weird drug-induced trip that reveals what he reall…", "site_name": "Hollywood Life", "image": {"identifier": "https://pmchollywoodlife.files.wordpress.com/2017/04/the-arrangement-tv-recap-ftr-6.jpg", "width": 600, "height": 400, "alt": "The Arrangement Episode 7 Season 1 Recap"}, "locale": "en_US"}, "article": {"published_time": "2017-04-17T03:00:36+00:00", "modified_time": "2017-04-17T03:00:37+00:00"}, "twitter": {"site": "@HollywoodLife", "text": {"title": "‘The Arrangement’ Recap: Megan Reveals A Heartbreaking Secret About Her Past"}, "image": {"identifier": "https://pmchollywoodlife.files.wordpress.com/2017/04/the-arrangement-tv-recap-ftr-6.jpg?w=600", "alt": "The Arrangement Episode 7 Season 1 Recap"}, "card": "summary_large_image", "creator": "@https://twitter.com/avery__thompson", "title": "‘The Arrangement’ Recap: Megan Reveals A Heartbreaking Secret About Her Past", "description": "Megan goes back home and finally opens up to Kyle about her past on the April 16 episode of 'The Arrangement.' Plus, Terence goes on a weird drug-induced trip that reveals what he really wants."}, "author": "Avery Thompson", "fb": {"pages": 94724837471}, "application-name": "Hollywood Life", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Latest Hollywood Celebrity & Entertainment News", "msapplication-task": "name=Subscribe;action-uri=https://hollywoodlife.com/feed/;icon-uri=https://pmchollywoodlife.files.wordpress.com/2018/06/hl_logo.png?w=16", "onesignal": "wordpress-plugin", "msapplication-TileImage": "https://pmchollywoodlife.files.wordpress.com/2018/06/hl_logo.png?w=128"}, "movies": [], "publish_date": 1492272000.0, "source": "https://hollywoodlife.com", "summary": ""}