{"url": "www.thesun.co.uk/fabulous/6827084/megan-markle-pregnancy-royal-rules/", "text": "AFTER Prince Harry and Meghan Markle tied the knot in their luxurious royal wedding, people began wondering when the newlywed couple would extend their family with a little bundle of joy.\n\nWhen Meghan was confirmed to be pregnant with a due date in April, certain rules and traditions were expected to be followed. We take a look, below.\n\n7 The Duke and Duchess of Sussex with the royal family in one of their official wedding photos Credit: Alexi Lubomirski\n\nThe gender is top secret\n\nThe royals keep mum about the baby's sex before the birth.\n\nAll anybody could talk about before the birth of Prince Louis was whether Kate Middleton and Prince William would be having another prince or princess.\n\nIn fact, the world didn't find out the gender of any of the Duke and Duchess of Cambridge's children until after the birth.\n\nThis is typically a standard rule for members of the royal family.\n\nEven Kate and Will themselves are reported to have chosen not to find out Prince Louis' gender until the birth itself.\n\n7 The gender is top secret - even Kate and Wills didn't find out if they were having a boy or girl Credit: Ian Jones\n\nTravelling abroad is frowned upon\n\nUnlike many other royal women, Meghan is more affected by this \"rule\" - she'd just touched down in Australia when she announced her pregnancy.\n\nAccording to reports, pregnant royals are encouraged to keep travelling abroad to a minimum - and it's all to do with safety measures.\n\nWhile royal women usually conduct engagements up until the end of their pregnancy (they usually don't have an official \"maternity leave\" until after the baby is born) they're encouraged to stay as close to home as possible so emergency help is more readily available.\n\nKate did travel to Norway while pregnant with Prince Louis - but she's said to have kept other trips to a minimum.\n\nIn February 2019, just weeks away from giving birth, Meghan and Harry stopped in Morocco for a short official visit.\n\n7 Kate visited Norway with Prince William during her third pregnancy Credit: Reuters\n\nRoyal mums-to-be don't have baby showers\n\nIt was speculated that the Duchess of Sussex would probably have to give a pre-birth party a miss due to royal tradition.\n\nAccording to royal expert Victoria Arbiter, throwing an elaborate baby shower is unheard of for members of The Firm.\n\nWhile the royals are \"very wealthy... a lavish baby shower would be seen as highly inappropriate...There's nothing they can't go out and buy themselves\".\n\nDespite reports that Pippa Middleton threw a party for Kate before Prince George's birth in 2013 many royal experts believe this wasn't the case.\n\nHowever, in February 2019, Meghan jetted off to New York for a star-studded baby shower thrown by Amal Clooney and Serena Williams.\n\nThe elaborate £300,000 baby shower took place at the swanky £60k-a-night penthouse at The Mark Hotel in New York.\n\nIt was attended by an A-list crowd including designers Jessica Mulroney and Misha Nonoo, and US TV anchor Gayle King.\n\n7 Sadly, Meghan probably won't be able to have an official baby shower\n\nYou won't believe how many midwives are involved\n\nTraditionally, royal mums-to-be would give birth at home.\n\nThe Queen, for example, had all four of her children in the royal residences - as did Queen Victoria.\n\nBut this tradition was quashed by Princess Anne and followed by Princess Diana, who gave birth to Princes William and Harry in the private Lindo Wing of St Mary's Hospital in Paddington, London.\n\nAnd while this has now become a tradition - with Prince George, Princess Charlotte and Prince Louis all being born at St Mary's too, there's still an army of doctors, midwives and anaesthetists on hand.\n\nIn fact, Kate had three midwives during Princess Charlotte's birth - and it's expected Meghan will be given the same expert treatment.\n\nAlthough sources have revealed to The Sun that Meghan wants to have her baby at Frimley Park Hospital in Surrey, she is still expected to have several midwives on hand for the birth of baby Sussex.\n\n7 Princess Anne was the first to break the home birth tradition, when she gave birth to her son, Peter Credit: PA:Press Association\n\nOnce the baby is born, the Queen must be the first to find out\n\nWhen Meghan and Harry welcome their son or daughter, the first person to be informed of the new royal birth has to be Her Majesty.\n\nRoyal protocol dictates the Queen must be in the know before anyone else - including grandparents.\n\nSo while Meghan might be keen to make a trans-Atlantic phone call, Prince Harry will probably have to follow in his brother's footsteps and inform the Queen via encrypted telephone first.\n\nWhile we don't know exactly when the Duchess of Sussex is due to give birth, Meghan revealed she was six months' pregnant as she greeted crowds in Birkenhead.\n\nBuckingham Palace posts a notice of the royal birth\n\nA notice is placed on the forecourt of Buckingham Palace announcing the birth, and the time of delivery.\n\nIt's tradition that a framed notice of birth goes on display on a ceremonial easel on the forecourt.\n\nNotices have been posted on the occasion of a Royal birth for at least as long as Buckingham Palace has been the Sovereign's official residence - from 1837.\n\nHowever, the royals still have to register their baby's birth.\n\nMeghan Markle let slip that she's expecting to give birth in April as she and Prince Harry visited Birkenhead for first official royal engagement together in 2019\n\n7 Her Majesty must be the first to know Credit: Reuters\n\nThe baby is usually given three to four names\n\nIf you've ever struggled to think of just one baby name, spare a thought for Meghan and Harry, who'll probably have to think of four.\n\nRoyals typically have four names. For example, Prince Harry has four: Henry Charles Albert David while Kate and Will's children have three: Prince George Alexander Louis, Princess Charlotte Elizabeth Diana and Prince Louis Arthur Charles.\n\nMeanwhile, a recent Expedia report found that Albert was the most popular male Royal name of all time while Victoria is the name of the greatest number of Royal women.\n\n7 Meghan and Harry will probably have to give their child at least three names Credit: Splash News\n\nMOST READ IN FABULOUS LOCKDOWN LOVE From loo trouble to too much sex, how isolating with a new love can go wrong TAKE A SWIPE Model shames sleazy blokes by exposing their pervy DMs Comment INGRID SEWARD Privacy-hunting Harry and Meghan's move to celeb hotspot LA is senseless MYSTIC MEG April 18: Uranus gives you a genius idea that turns rivals into friends camera sly We’re addicted to taking catfish selfies - and our dates have walked out on us pandemic pin-ups From 'Dishy Rishi' to 'silver fox' Dr Hilary – the unlikely corona-crushes\n\nIn more Royal Family news, Meghan Markle has been warned by doctors \"not to put her baby at risk for the sake of fashion\" after she stepped out in TWO pairs of five inch heels in one day.\n\nAnd Meghan Markle broke down in tears after her protection officer quit earlier this year.\n\nPlus Meghan Markle said Prince Harry will be a \"fantastic dad\" and she's \"thrilled\" about royal baby ahead of April due date.", "images": ["http://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.3 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.6 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.9 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.7 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.8 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.thesun.co.uk/wp-content/uploads/2018/10/NINTCHDBPICT0004619178301-e1547850286545.jpg?strip=all&quality=100&w=1200&h=800&crop=1"], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2018/10/NINTCHDBPICT0004619178301-e1547850286545.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "keywords": [], "authors": ["Lucy Devine"], "canonical_link": "https://www.thesun.co.uk/fabulous/6827084/meghan-markle-pregnancy-royal-rules/", "title": "Meghan Markle will need to follow these royal pregnancy rules as she and Prince Harry prepare for parenthood", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Meghan Markle will need to follow these royal pregnancy rules as she and Prince Harry prepare for parenthood", "url": "https://www.thesun.co.uk/fabulous/6827084/meghan-markle-pregnancy-royal-rules/", "description": "AFTER Prince Harry and Meghan Markle tied the knot in their luxurious royal wedding, people began wondering when the newlywed couple would extend their family with a little bundle of joy. When Megh…", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2018/10/NINTCHDBPICT0004619178301-e1547850286545.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "width": 1200, "height": 800}, "locale": "en_GB"}, "article": {"published_time": "2019-04-02T14:50:51+00:00", "modified_time": "2019-05-11T17:34:57+00:00", "publisher": 161385360554578, "tag": "Archie Harrison Mountbatten-Windsor, Meghan Markle, Prince Harry, Prince Louis, Explainers, Meghan Markle pregnant, Royal Family", "author": "https://www.facebook.com/Fabulous/"}, "fb": {"app_id": 144647118961553, "pages": 8401947179}, "description": "Meghan went against royal tradition with a very star-studded baby shower in New York", "keywords": "Meghan Markle, Prince Harry, Pregnant, Baby, Royal rules", "news_keywords": "Meghan Markle, Prince Harry, Pregnant, Baby, Royal rules", "twitter": {"text": {"title": "Meghan Markle will need to follow these royal pregnancy rules as she and Prince Harry prepare for parenthood"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "HEIRY STRICT", "headline": "Royal pregnancy rules Meghan will follow now she and Harry are having a baby", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2018/10/NINTCHDBPICT0004619178301-e1547850286545.jpg?strip=all&quality=100&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2018/10/NINTCHDBPICT0004619178301-e1547850286545.jpg?strip=all&quality=100&w=620&h=413&crop=1"}}, "parsely-post-id": 6827084, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1554216651.0, "source": "http://www.thesun.co.uk", "summary": ""}