{"url": "https://www.romper.com/p/cardi-b-might-have-accidentally-revealed-her-babys-sex-its-not-the-first-time-theres-been-a-slip-up-8752033", "text": "Cardi B is one busy lady lately. She's engaged, she's pregnant, and she just released a new album. Clearly, the Bronx rapper has a lot going on at the moment, so it's understandable that she might have recently slipped up on something regarding her personal life. As Us Weekly reported, it sounds like Cardi B may have accidentally revealed her baby's sex and she seems so excited about her baby-to-be.\n\nYes, in case you missed it, the 25-year-old subtly revealed her pregnancy during her performance on Saturday Night Live over the weekend, and fans have been (mostly) encouraging of her happy news. Still, she's been pretty hesitant to reveal too many details about her pregnancy, and with good reason. As many fans as the rapper may have, there are still plenty of haters out there trying bring her down, which is exactly why she kept her pregnancy hidden for so long.\n\nStill, during an appearance on Hot 97’s Ebro in the Morning on Monday, Cardi B was asked a few questions about her life and what she had been up to lately, and she seemed more than happy to answer. When one of the hosts asked if she would ever go host an event at a strip club, she responded simply, \"I was just hosting a strip club, matter of fact. In Miami on Friday.\" But it was what she said a moment later that got people talking.\n\nSpecifically, after one of the DJs asked her if she covered up her pregnancy bump during the event, Cardi B started to respond, \"Yeah, she was...\" before she caught herself and trailed off, Us Weekly reported. Additionally, the magazine also reported that Cardi B and her fiancée, Offset, do actually \"know the gender of their baby and already have a name picked out.\" So, based off of that tiny little slip, it sure does seem like Cardi B is having a girl.\n\nAlso, her sister, Hennessy Carolina, dropped another hint that she's expecting a girl. Over the weekend, she wrote a congratulatory message, which has since been edited, that included, \"give her all the kisses and hugs,\" according to MSN.\n\nEven though plenty of haters have tried to kill her vibe, Cardi B isn't letting any of them get to her. In another radio interview, with Power 105.1's show The Breakfast Club on Tuesday, she revealed that she was getting frustrated with people assuming that her having a baby meant her career was over. \"I see a lot of women online like, 'Oh I feel sorry for you, oh your career is over,'\" she said in the interview, according to People. \"As a woman, why can’t I have both? Why do I gotta choose a career or a baby? Like, why can’t I have both? I want both.\"\n\nWhether Cardi B is having a boy or a girl (but it really sounds like she's expecting a daughter, though, given all of the recent *hints*), she sounds like she's just so thrilled to be starting her own family and becoming a mom soon. In fact, she confirmed that she's due in July, according to People. The rapper also told the publication that she's confident in her fiancée's parenting skills. \"And even though, let's say, God forbid we don't [work out], my man is a great father to his kids, so I will never lose. I'm not having a baby with a deadbeat,\" she said, according to People.\n\nCardi B has been pretty open with her fans in the few days since confirming her exciting news, and perhaps an official sex reveal is on the way. If not, she'll no doubt share that as well when the time is right.\n\nCheck out Romper's new video series, Bearing The Motherload, where disagreeing parents from different sides of an issue sit down with a mediator and talk about how to support (and not judge) each other’s parenting perspectives. New episodes air Mondays on Facebook.", "images": ["https://imgix.bustle.com/uploads/getty/2018/4/10/c97dadf9-0815-417e-ada4-f81cd325acf5-getty-944370566.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2020/4/9/68c997a3-93e3-41e2-b6de-0f2dc95adf2c-screen-shot-2020-04-09-at-13106-pm.png?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/6/2b4b42d3-4475-4d32-af08-89bbe2575aa3-getty-1200433192.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/6/15155e54-1e2c-439c-870e-2ae9587ae2e8-getty-1169525359.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/4/10/c97dadf9-0815-417e-ada4-f81cd325acf5-getty-944370566.jpg?w=960&h=540&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=932972280084675&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/4/10/c97dadf9-0815-417e-ada4-f81cd325acf5-getty-944370566.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.romper.com/p/cardi-b-might-have-accidentally-revealed-her-babys-sex-its-not-the-first-time-theres-been-a-slip-up-8752033", "title": "Cardi B Might Have Accidentally Revealed Her Baby’s Sex, & It's Not The First Time There's Been A Slip-Up", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@romper", "card": "summary_large_image"}, "og": {"site_name": "Romper", "url": "https://www.romper.com/p/cardi-b-might-have-accidentally-revealed-her-babys-sex-its-not-the-first-time-theres-been-a-slip-up-8752033", "type": "article", "title": "It Sounds Like Cardi B *May* Have Accidentally Revealed Whether She's Having A Boy Or A Girl", "description": "Cardi B is one busy lady lately. She's engaged, she's pregnant, and she just released a new album. Clearly, the Bronx rapper has a lot going on at the moment, so it's understandable that she might have recently slipped up on something regarding her…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/4/10/c97dadf9-0815-417e-ada4-f81cd325acf5-getty-944370566.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 510210782483125}, "description": "Cardi B is one busy lady lately. She's engaged, she's pregnant, and she just released a new album. Clearly, the Bronx rapper has a lot going on at the moment, so it's understandable that she might have recently slipped up on something regarding her…"}, "movies": [], "publish_date": null, "source": "https://www.romper.com", "summary": ""}