{"url": "http://time.com/5003930/most-influential-teens-2017/", "text": "To determine TIME’s annual list , we consider accolades across numerous fields, global impact through social media and overall ability to drive news. In the past, we’ve recognized everyone from singer Lorde to Olympic champion Simone Biles to political activist Joshua Wong. Here’s who made this year’s cut (ordered from youngest to oldest):\n\nGetty Images (2) Millie Bobby Brown, 13 Not many actors can say they got an Emmy nomination, and worldwide fame, for convincing the world that they have superpowers. Brown can, thanks to her role on Netflix’s sci-fi ’80s-nostalgia-fest Stranger Things . She plays Eleven, a mysterious girl—part science experiment, part prodigy, part awkward teen—who uses telekinesis to ward off evil. But there’s remarkable nuance in Brown’s performance, the kind that is able to convey melancholy beneath magic. It has made Eleven the standout character on a show brimming with them, one who inspires Internet memes , Halloween costumes and newfound interest in Eggo waffles (Eleven’s favorite food). Brown’s own profile has risen as well. Since the show’s July 2016 debut, the British actor has rapped at the Golden Globes, signed with IMG Models and appeared on the covers of Entertainment Weekly , InStyle and more. One secret to Brown’s success? Not overthinking her craft. “Eleven is part of me and always will be. I don’t try with her,” she told TIME during a Stranger Things set visit earlier this year. “I don’t even know my lines for today’s scene ... and that’s what makes it so instinctual.” —Daniel D’Addario\n\nUlmer: Courtesy D'Andra Ulmer; Getty Images Mikaila Ulmer, 13 Like most kids her age, Ulmer used to hate bees. “I absolutely despised anything that buzzed,” she says. But shortly after she was stung, twice, in 2009, the Texas native developed a fascination with them. That’s when she learned that honeybees are critical to the ecosystem, and also going extinct . So Ulmer decided to help—with lemonade. Using her great grandmother’s recipe, Ulmer made a blend, sweetened with local honey, to sell at community business fairs, donating 10% of her profits to honeybee advocate groups. By 2014, her side project was a full-blown business . Now Me & the Bees Lemonade is stocked at more than 300 Whole Foods Markets, Wegmans and other grocers across the U.S. and Ulmer runs a nonprofit, the Healthy Hive Foundation, to raise awareness about the plight of the honeybee. Next up: finishing her first children’s book (it aims to teach kids how to start their own businesses) and expanding her company. To that end, Ulmer says, “I just hired my dad.” —Melissa Chan\n\nGuzman: Courtesy of Shamah S. Bulangis; Getty Images Shibby de Guzman, 14 It’s a risky move to speak out against Philippine President Rodrigo Duterte, whose brutal war on drugs has left thousands dead. He told E.U. politicians to “go to hell” for raising human-rights concerns and branded Oxford University a “school for stupid people” after it published a study claiming he employs an army of online trolls to suppress dissent. His fiercest critic, Senator Leila de Lima , has been in jail for more than eight months. None of this has deterred de Guzman, who shot to prominence after she was photographed protesting the lionization of late Philippine dictator Ferdinand Marcos. She carried a megaphone and wore a cardboard sign similar to those sometimes strewn over the bodies of drug-war victims. Then, in a widely shared social-media post, she shut down critics who alleged that her fellow protesters were “brainwashed”: “We completely know and understand the injustice we are protesting against.” Now in the ninth grade, de Guzman hopes to rally even more young people to take action in the Philippines. “It’s so important that [they] know their own rights and when authorities abuse them,” she says. “There are values that aren’t up for debate.” —Joseph Hincks\n\nGetty Images (2) Moziah Bridges, 15 At age 9, Bridges launched his own handmade bow-tie business from his grandmother’s kitchen table. Now Mo’s Bows is worth about $1.5 million—thanks in part to his 2015 appearance on ABC’s Shark Tank and, more recently, a licensing deal with the NBA that lets Bridges sell bow ties featuring team logos. But the Memphis native has even grander ambitions: he plans to expand globally, breaking into new clothing markets (he just released a line of neckties), while working toward graduating from high school and getting his driver’s license. “My all-time goal is to be a fashion mogul and a good person overall,” says Bridges, who credits his success to his inborn sense of style (he says he would “go to the playground in a suit and tie”). At home, though, his mom is still the boss: Bridges wants a Range Rover for his upcoming birthday, but she has made it clear that he’s “going to get the 2007 Jetta in the garage.” —Melissa Chan\n\nColon: Courtesy Michelle Colon; Getty Images Salvador Gómez Colón, 15 Everything went dark when Hurricane Maria hit Puerto Rico—including Colón’s San Juan neighborhood of Condado, one of many that could remain without power for at least a year. Initially, Colón says he felt scared and overwhelmed, especially when his family started to ration food. “Then I asked myself, How could I give people hope?” he says. The answer: Light and Hope for Puerto Rico, a Generosity campaign he started to raise money for solar lamps, hand-operated washing machines and other supplies for his neighbors in need. In four days, he raised $36,000; the total now stands at $75,000 and counting. Colón estimates that the money will be able to help at least 1,000 people. But he knows it’s only a start—and that the world should remember Puerto Rico still needs aid. “One day should not go by that we don’t remind ourselves of how we can make other people’s lives better,” he says. —Ashley Hoffman\n\nGetty Images (2) Maddie Ziegler, 15 Ziegler, who recently made her big screen debut in 2017’s The Book of Henry , has come a long way from starring in Dance Moms , the reality TV series that kickstarted her career. \"[Acting] has become one of my biggest passions,\" she tells TIME. \"It lets me express so many different emotions. When you're acting, you're always playing someone else and you're always getting to experience someone new.\" But that doesn't mean she's hanging up her dancing shoes. Ziegler continues to perform as Sia's spirited alter-ego on tour with the pop star. In March, she gave her many fans — the dance phenom has over 10 million followers on Instagram alone — an inside look at her rise to fame by releasing a memoir, The Maddie Diaries . Not to mention that she also has a trilogy of Young Adult novels about competitive dance in the works, the first of which is available now. –Megan McCluskey\n\nAlhumedhi: Courtesy Rayouf Alhumedhi; Getty Images Rayouf Alhumedhi, 16 This fall, millions of women around the world will finally have an emoji they can identify with, thanks to this Vienna high school student who proposed Apple’s new emoji with a headscarf. While messaging friends last year, Alhumedhi, who is Muslim and wears a headscarf, was baffled when she searched her phone for an emoji that looked like her but couldn’t find one. “It’s something important to my identity,” she says. So Alhumedhi, who hails from Saudi Arabia, appealed to Apple and then the Unicode Consortium, which controls emoji standards. Her campaign quickly gained steam, earning the support of Reddit co-founder Alexis Ohanian, and eventually Apple announced the emoji was on its way . Alhumedhi says it’s a step forward in celebrating diversity and accepting the Muslim faith. “I think this emoji will influence the world indirectly,” she says, “once people who are against women wearing the headscarf, or against Islam in general, view such an emoji on their keyboard.” —Melissa Chan\n\nGetty Images (2) Auli’i Cravalho, 16 Even if you don’t immediately recognize Cravalho’s face, chances are you’ve heard her sing: the Hawaii native voiced the titular hero in Disney’s Moana , which grossed more than $640 million at the global box office. Now Cravalho is taking on a new role. In January, she’ll star on NBC’s Rise , a drama about a high school theater department that lifts the spirits of a struggling steel town in Pennsylvania. Cravalho says the premise, which is based on a true story, reinforced her belief that young people can effect real change—though it helps, she adds, to “find a troupe who will support you and be your megaphone” and to never let “being a teen make you feel like you make less of an impact.” Cravalho would know. On Rise she plays a character who, like her, is of Polynesian and Puerto Rican descent—a heritage that isn’t often portrayed onscreen. And while Cravalho is grateful that she gets to “share my culture with the world,” she’s also determined to help shift the status quo. “Accurate representation matters,” she says. “I’m proud to be involved in projects that reflect the modern melting pot that is America.” —Eliana Dockterman\n\nGetty Images (2) Kaia Gerber, 16 The daughter of legendary supermodel Cindy Crawford and Rande Gerber has clearly inherited her mother’s fashion savvy. Since gracing the cover of Vogue Paris with her mom at 14, Gerber has made a name for herself as a high fashion model and snagged campaigns for major brands like Versace and Alexander Wang. And in 2017 Gerber became one of the most in-demand runway models at New York Fashion Week, walking in more than a dozen high-profile shows during her first year on the catwalk. More recently, Vogue gave her the reins to its Instagram account, so she could document her experience during New York Fashion Week. Her mom, of course, could not be prouder . —Ashley Hoffman\n\nCourtesy of Lee Bada/SF Models; Getty Images Han Hyun Min, 16 Growing up in a largely homogeneous society, Han, who is half Nigerian, half Korean, was often made to feel ashamed of his appearance. “There are so many prejudices about darker skinned people in South Korea,” he tells TIME. “When I was in kindergarten, some of the mothers in the playground would tell my friends, ‘Don’t play with him. If you play with him, you will become darker too.’” But Han, who was discovered on Instagram, is now one of the country’s most sought-after fashion models ; he’s a fixture in local magazines and walked in 20 shows during the recent Seoul Fashion Week. Although he has faced discrimination—he was denied several early castings because of his skin color—Han says he hopes his rising profile will help make South Korea’s beauty standards more inclusive. “My dream is now a reality,” he tells TIME, “and I want those like me to feel they can achieve the same.” —Suyin Haynes\n\nGetty Images (2) Wang Yuan, 16 With lyrics like “polish your leather shoes, put on a suit … arrive at every place with head held high,” Wang is not exactly the tattooed bad boy of Chinese pop. But that hasn’t stopped his singing trio, TFBoys , from ruling the charts. Since its founding four years ago, TFBoys has amassed more than 20 million fans on the Twitter-like microblog Weibo and reportedly sells some $17 million worth of branded merchandise every month. And Wang, who goes by the English name Roy and hails from central China, is poised for even greater success: As a solo act, he has also appeared in a bevy of movie and television roles, and was appointed a UNICEF Special Advocate for Education . —Charlie Campbell\n\nGetty Images (2) Noah Cyrus, 17 As the sister of Miley and daughter of Billy Ray, Cyrus is no stranger to show business. But her music — a collection of moody, emo-pop singles, with more to come on her debut album NC-17 — steers clear of her famous family’s country roots, trading instead on teen angst. It seems to be working: her first single, “Make Me (Cry),” jumped to the top of Spotify’s global viral charts, and she opened for Katy Perry during the megastar’s recent New York shows. “I feel like I communicate so much better through a song than I do through talking,” Cyrus tells TIME, adding that she wants her music to be relatable. “I’m there with you if you’re going through heartbreak, because I’ve definitely had my share of heartbreak. People don’t think we [celebrities] have normal people problems, but we do. We go through it just like you.” —Raisa Bruner\n\nGetty Images (2) Ethan and Grayson Dolan, 17 Ethan Dolan didn’t want to get his tongue pierced, but he had to. Those were the rules. He and his twin Grayson had just attempted a series of tongue challenges—like tying cherry stems into knots—and agreed, on camera, that the loser would get the piercing. Of course, the brothers could have called it off. But they would have to answer to their legions of social-media followers (27 million across Instagram , Twitter, YouTube and Facebook). So in late September, the Dolans flew from L.A. to their home state of New Jersey, where piercing laws are less strict, to document Ethan’s experience in all its graphic glory; the resulting YouTube clip has 2 million views and counting. It’s these kinds of outlandish stunts—coupled with their boyish charm and good looks—that have catapulted the Dolans into social-media stardom. As they put it, “We don’t like to limit ourselves to a certain category, such as ‘content creators’ or ‘influencers,’ because we like to do it all.” Increasingly, the Dolans are popping up offline as well. Earlier this year, they embarked on a nationwide variety-show tour, which sold out in several cities; now they’re regular correspondents on MTV’s relaunched TRL . But these gigs, they insist, are not jobs: “We enjoy what we do too much to consider it work.” —Raisa Bruner\n\nGetty Images (2) Chloe Kim, 17 When Kim’s father first took her snowboarding near the family’s home in Orange County, California, when she was 4, Kim didn’t fall hard for the sport. “I wanted to go play My Little Ponies,” she says. “But I was stuck on a mountain.” That was then. Now Kim, who last year became the first woman to ever land back-to-back 1080s (three full revolutions in the air) in competition, is widely seen as a favorite to win gold at the 2018 Winter Olympics in Pyeongchang, South Korea. Although Kim is American and a member of Team USA, she’ll also in effect be competing on home turf: both her parents were born in South Korea, and several of her South Korean relatives plan to cheer her on. “It’ll be a good experience to go through such a crazy event with my family,” says Kim. “But at the same time, I’m very worried, ’cause it’s the freaking Olympics. I want to do really good. I’ve got to nail it.” —Sean Gregory\n\nNithiyanandam: Courtesy Krtin Nithiyanandam; Getty Images Krtin Nithiyanandam, 17 He may not have graduated high school yet, but Nithiyanandam—whose interest in science was sparked after getting ear surgery as a kid—already has a resume that rivals many professional researchers. In 2015, when he was only 15, the U.K. native developed an antibody that can help detect early signs of Alzheimer’s disease, a project that earned him a $25,000 award at the Google Science Fair. Then, this September, he won another award for creating a bioplastic that can clear wastewater of toxins. Meanwhile, Nithiyanandam is working on a method to make triple negative breast cancer—a type of breast cancer that doesn’t respond well to usual therapy—more treatable. His advice to his peers? “Don’t be afraid of being rejected,” he says, noting that he reached out to 52 different academic institutions about his Alzheimer’s research before finding someone to support his study. —Alexandra Sifferlin\n\nGetty Images (2) Yara Shahidi, 17 Most network TV stars tend to avoid talking politics, so as to appeal to the widest possible demographic. But as the child of an Iranian father and an African-American mother, Shahidi, who plays Zoe on popular ABC sitcom Black-ish , has felt compelled to speak out. When President Trump first tried to enact his travel ban against several Muslim majority countries, for example, she took him to task for xenophobia . “Immigrants don’t threaten safety — stereotypical narratives that promote hate do,” Shahidi wrote on Instagram , noting that she herself is the product of “Black and Iranian love.” If Shahidi is no ordinary sitcom star, it’s because Black-ish is no ordinary sitcom. The show examines issues of race and class through the lens of a black, upper-middle-class family; in January, Shahidi will star in her own spinoff, Grown-ish , about college students wrangling with those same issues in the age of Trump. “My family taught me to use my voice, my work, to help better society,” she tells TIME. Next year, after Grown-ish wraps, Shahidi is heading to Harvard to double major in sociology and African-American studies — thanks in part to a recommendation letter from Michelle Obama. —Eliana Dockterman\n\nGetty Images (2) Willow Smith, 17 The daughter of actors Will and Jada Pinkett, who first rose to prominence with her 2010 breakout single “Whip My Hair,” has since emerged as one of her generation’s most intriguing artists. Her latest single, “Romance,” imagines a world where “morality doesn’t exist” and “man and women stay equal in the eyes of society.” She also serves as a Chanel ambassador and frequently shares her musings about art and science with her 2.4 million Instagram followers. —Cady Lang\n\nGetty Images (2) Brooklyn Beckham, 18 As the son of footballer David and pop star-turned-fashion maverick Victoria, Beckham was never going to live an ordinary life. Case in point: although he just started his first year as a photography major at Parsons in New York City, Beckham has already published a book of his own photos ( What I See ), shot a campaign for Burberry Brit , worked with esteemed fashion photographer Nick Knight, and touts some 10 million Instagram followers . “I’m just so lucky to have been given the opportunities that I have,” Beckham tells TIME. “I’m looking forward to the next few years and learning as much as I can and experiencing life as a student.” —Cady Lang\n\nMcLaughlin: Sports Illustrated; Getty Images Sydney McLaughlin, 18 At track meets, on social media, at the New Jersey dress shop where she worked this summer, people often tell McLaughlin that she’s inspired them to run. It’s no wonder: as the first repeat winner of the Gatorade National High School Athlete of the Year Award, the youngest U.S. track and field Olympian since 1972 (she reached the semifinals of the 400-m hurdles in Rio), and holder of the junior world record in the 400-m hurdles, McLaughlin is the future of U.S. track and field. But first, she’s headed to college. Rather than turn pro right after high school and cash in on sponsorships and prize money, McLaughlin will race for the University of Kentucky , where she’s a freshman relishing her newfound freedoms. “I can always take a nap when I have free time,” she tells TIME, “instead of my parents telling me to do laundry.” —Sean Gregory\n\nRanran: Courtesy Hu Ranran; Getty Images Hu Ranran, 18 While depictions of LGBTQ lifestyles are relatively routine in Western media, China has taken several steps backward, rolling out new regulations in July that put homosexuality alongside incest as cases of “abnormal sexual relationships” unfit for broadcast. So it was especially daring for Hu to direct Escape—a 75-minute film about a transgender youth coming to terms with his sexual identity—and release it in her home country. “I wanted to address the theme of being yourself,” she tells TIME. To help realize her vision, which had basically no production budget, Hu tapped 37 students from her high school, which is affiliated with Beijing’s prestigious Renmin University. They made the sets and costumes themselves and shot the film mostly on school grounds. Subsequent critical acclaim helped Hu gain a place at the University of California, Los Angeles, and reignited conversation about trans issues across the world’s most populous nation. “Getting to know [the stories of] LGBTQ people is the start to reducing prejudice,” Hu says. —Charlie Campbell\n\nGetty Images (2) Isaac Hempstead Wright, 18 The U.K. native has spent eight years playing Bran Stark, a character whose every move is scrutinized by Game of Thrones’ massive fan base —especially during the most recent season. And as one of the show’s few remaining players, he can drive countless headlines by simply commenting on a plot or debunking a fan theory . But Wright, who just started his first year at the University of Birmingham, isn’t fazed by the attention: \"You can go pretty much anywhere in the world and be able to drum up a conversation with someone and have something in common with someone,\" he tells TIME. “It means that pretty much everywhere you go, you’re met with the warmest of welcomes.” —Megan McCluskey\n\nMuzoon: Courtesy UNICEF; Getty Images Muzoon Almellehan, 19 For the millions of children living in refugee camps, the outlook is bleak: only half are enrolled in primary school and less than a quarter in secondary school, which severely limits their upward mobility. “They don’t have many options,” says Almellehan, who experienced these conditions firsthand after she fled Syria for Jordan in 2013. (Her family has since resettled in Newcastle, England.) Now she’s fighting to change that. In June, Almellehan became UNICEF’s youngest ever goodwill ambassador . As part of her duties, she travels the world to evangelize the importance of education, especially in places like Chad, where the militant group Boko Haram has forced children out of school. Ultimately, though, Almellehan plans to return to Syria. “Our country needs a strong generation,” she says. —Alexandra Sifferlin\n\nGetty Images (2) Elle Fanning, 19 Fanning began her career before the age of 3, playing the younger version of her sister Dakota’s character in I Am Sam . Since then, she has carved out her own niche with roles in movies like The Neon Demon , The Beguiled and the Oscar-nominated 20th Century Women . She has also become a standout in the fashion world, appearing on her first Vogue cover and fronting her second Miu Miu campaign. Looking ahead, Fanning harbors big dreams of directing her own movie. \"From nothing to something,\" she tells TIME of creating a story. \"That's very enticing to me.\" —Megan McCluskey\n\nGetty Images (2) Khalid, 19 The Texas musician, whose debut album was fittingly titled American Teen , is one of R&B’s hottest new acts. His music, including the hit single “Young Dumb & Broke,” has been streamed over a billion times worldwide, earning Khalid a win at the MTV Video Music Awards for Best New Artist and an opening-act spot on Lorde’s tour. He’s also committed, both in song and in life, to championing the vulnerable. “America today feels like a scary place for many people, people of color, DREAMERS, women, the LGBTQ community,” he tells TIME. “It’s the young people of America, the teens, who have the power to create change.” For now, though, he’s focused on navigating his newfound fame. “It’s been a year of firsts and surprises,” he says, “I don’t think I’ve changed though. I’m still the same Khalid, I just buy more clothes!” —Raisa Bruner\n\nGetty Images (2) Steve Lacy, 19 When Lacy first set out to make music, he couldn’t even afford a laptop, let alone professional recording equipment. So instead, he turned his iPhone into a portable studio—using apps to make original drum patterns and guitar riffs, then layering on vocals he’d recorded using the mike. “You have to find a way with what you have,” he says. His way paid off: Lacy co-produced his band, the Internet’s 2015 release Ego Death , which went on to nab a Grammy nomination for Best Urban Contemporary Album . Now, in addition to creating his own music, the Compton, Calif., native is producing tracks for artists like Big Sean and Kendrick Lamar. (He says the latter collaboration was like “my eighth-grade playlist coming full circle.”) As his profile increases, Lacy has started to embrace more traditional producing platforms. He remains committed to his iPhone, though. “It’s scary to do things differently,” he says, “but I’m for the weirdos.” —Ashley Hoffman\n\nGetty Images (2) Shawn Mendes, 19 Mendes, like Justin Bieber before him, may have risen to fame on a social-media platform (in his case, the defunct video app Vine ). But he has since become one of pop music’s biggest stars. In the past three years, Mendes has released two blockbuster albums and several hit singles, including “Stitches,” “Mercy” and “Treat You Better”; his latest, “There’s Nothing Holdin’ Me Back,” has logged more than 700 million streams. And the Canadian singer has no plans to slow down. “I’m just honing and getting better at my craft,” he says of writing songs for his as-yet-unannounced third LP. “So I hope what comes out will be the best album yet by a landslide.” In the meantime, he remains focused on entertaining his many young fans— Mendes has 26 million followers on Instagram alone—and encouraging them to pursue their passions. “I always want people to feel like they can do anything,” he says, “and I hope that I can inspire them.” —Raisa Bruner\n\nGetty Images (2) Christian Pulisic, 19 The soccer prodigy, already one of the sport’s most promising young players (alongside Kylian Mbappé and Gianluigi Donnarumma, among others), is poised to become America’s first top-flight international star. Pulisic, who plays for both the U.S. national team and in Germany’s top pro league, has broken multiple goal-scoring records, and was a rare bright spot in the recent U.S. attempt to qualify for the World Cup . The Pennsylvania native credits his success to his parents, who largely eschewed the travel soccer scene while he was growing up in Hershey. “A lot of kids, their parents force them to play on some team where they have to travel super far everyday,” he tells TIME. “I think that makes it worse because they don’t realize their kid isn’t enjoying it at all. Let kids be kids.” When asked about America’s World Cup defeat, or to recommend any systemic changes to improve U.S. soccer’s fate, Pulisic declined comment. But his rising profile may well offer U.S. soccer fans something more valuable: hope. —Sean Gregory\n\nGetty Images (2) Bretman Rock, 19 There is nobody on the Internet more fabulous than Rock. Just ask him. The Hawaii-based Filipino beauty vlogger shot to fame for demonstrating makeup skills—fierce contouring, flawless eyebrows—that could give the Kardashians a run for their money. But the real reason Rock (born Bretman Rock Sacayanan) has racked up nearly 9 million Instagram followers is his larger-than-life personality, best seen in the musings he posts alongside his glam how-tos. Among his favorite topics: his haters (“This nose can be fixed with contour ... but your attitude and personality can’t”), his appearance (“I’m, like, really cute”) and his friends and family (“Don’t forget to appreciate everyone you have in your life ... not everyone is blessed to have them like you do”). Now Rock is building a career off that cheeky candor. Earlier this year, he hosted the Miss Universe red-carpet preshow; in September, he kicked off a national tour to meet his biggest fans. “I think the universe is taking quite good care of [me],” he says. —Cady Lang", "images": ["https://api.time.com/wp-content/uploads/2020/04/AP20108635361827.jpg?h=52", "https://api.time.com/wp-content/uploads/2020/04/AP20108779053267.jpg?h=52", "https://api.time.com/wp-content/uploads/2017/11/influential-teens-2017.jpg?w=720", "https://api.time.com/wp-content/uploads/2020/04/white-house-trump-rosa-parks.jpg?h=52", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://api.time.com/wp-content/uploads/2017/11/influential-teens-2017.jpg?w=720&quality=85"], "top_img": "https://api.time.com/wp-content/uploads/2017/11/influential-teens-2017.jpg?w=720", "keywords": [], "authors": [], "canonical_link": "https://time.com/5003930/most-influential-teens-2017/", "title": "TIME's 30 Most Influential Teens of 2017", "meta_data": {"description": "From Stranger Things standout Millie Bobby Brown to budding fashion mogul Moziah Bridges, these are TIME's 30 most influential teens of 2017.", "keywords": "most influential teenagers, time most influential teens, most influential teens 2017, millie bobby brown, mikaila ulmer, brooklyn beckham, elle fanning, shawn mendes, moziah bridges, kaia gerber, ethan and grayson dolan", "news_keywords": "most influential teenagers, time most influential teens, most influential teens 2017, millie bobby brown, mikaila ulmer, brooklyn beckham, elle fanning, shawn mendes, moziah bridges, kaia gerber, ethan and grayson dolan", "og": {"site_name": "Time", "type": "article", "locale": "en_US", "url": "https://time.com/5003930/most-influential-teens-2017/", "title": "Meet the 30 Most Influential Teens of 2017", "description": "See who made the cut in TIME's annual list", "image": "https://api.time.com/wp-content/uploads/2017/11/influential-teens-2017.jpg?w=720"}, "author": "TIME Staff", "fb": {"app_id": 53177223193}, "twitter": {"site": "@TIME", "title": "Meet the 30 Most Influential Teens of 2017", "description": "See who made the cut in TIME's annual list", "card": "summary_large_image"}, "article": {"author": "https://time.com/author/time-staff/"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}