{"url": "https://web.archive.org/web/20071016102723/http://eia.doe.gov:80/emeu/cabs/Saudi_Arabia/Oil.html", "text": "Saudi Arabia has announced an ambitious $70-billion energy investment plan, $18 billion of which will be directed toward increasing upstream petroleum capacity to an estimated 12 million bbl/d by 2009.\n\nReserves\n\nOil and Gas Journal , Saudi Arabia contains about 260 billion barrels of proven oil reserves (including 2.5 billion barrels in the Saudi-Kuwaiti Divided, or \"Neutral\" Zone), or around one-fifth of proven, conventional world oil reserves. Around two-thirds of Saudi reserves are considered \"light\" or \"extra light\" grades of oil, with the rest either \"medium\" or \"heavy.\" Although Saudi Arabia has over 100 oil and gas fields (and more than 1,500 wells), over half of its oil reserves are contained in only eight fields, including the giant 1260-sq mile Ghawar (the world's largest oil field, with estimated remaining reserves of 70 billion barrels) and Safaniya, including Khafji and Hout (the world's largest offshore oilfield, with estimated reserves of 25-35 billion barrels). Ghawar's main producing structures are, from north to south: Ain Dar, Shedgum, Uthmaniyah, Hawiya, and Haradh. Ghawar alone accounts for about half of Saudi Arabia's total oil production capacity. According to the, Saudi Arabia contains about 260 billion barrels of proven oil reserves (including 2.5 billion barrels in the Saudi-Kuwaiti Divided, or \"Neutral\" Zone), or around one-fifth of proven, conventional world oil reserves. Around two-thirds of Saudi reserves are considered \"light\" or \"extra light\" grades of oil, with the rest either \"medium\" or \"heavy.\" Although Saudi Arabia has over 100 oil and gas fields (and more than 1,500 wells), over half of its oil reserves are contained in only eight fields, including the giant 1260-sq mile Ghawar (the world's largest oil field, with estimated remaining reserves of 70 billion barrels) and Safaniya, including Khafji and Hout (the world's largest offshore oilfield, with estimated reserves of 25-35 billion barrels). Ghawar's main producing structures are, from north to south: Ain Dar, Shedgum, Uthmaniyah, Hawiya, and Haradh. Ghawar alone accounts for about half of Saudi Arabia's total oil production capacity. Production Capacity\n\nSaudi Arabia maintains the world’s largest crude oil production capacity, estimated to be around 10.5-11.0 million bbl/d. In 2005, Saudi Arabia’s Ministry of Petroleum announced the details of an $18-billion plan to increase capacity to 12 million bbl/d by 2009. Oil Daily reports, Aramco plans to drill 427 onshore and offshore crude oil development wells in 2007. Approximately 134 wells will be in or near Ghawar, while 85 will be drilled in Khurais, and some 50 drilled in Khursaniya. In December 2006, Saudi Aramco announced its 2007 exploration and drilling budget of almost $4 billion - nearly double the draft budget and full quarter of Aramco’s 2007 capital budget. According toreports, Aramco plans to drill 427 onshore and offshore crude oil development wells in 2007. Approximately 134 wells will be in or near Ghawar, while 85 will be drilled in Khurais, and some 50 drilled in Khursaniya. Platts Oilgram ) in existing fields, meaning that the country needs around 700,000 bbl/d in additional capacity each year just to compensate for natural decline. One challenge for the Saudis in achieving their strategic vision to add production capacity is that their existing fields sustain, on average, 6 to 8 percent annual \"decline rates” (as reported by) in existing fields, meaning that the country needs around 700,000 bbl/d in additional capacity each year just to compensate for natural decline. Aramco estimates that the average total depletion for Saudi oil fields is 29 percent, with Abqaiq (the oldest) 74 percent depleted, the giant Ghawar field having produced 48 percent of its proven reserves and the younger Shaybah just 5 percent depleted. Aramco also claims that, if anything, Saudi oil reserves are underestimated, not overestimated. Some analysts have disputed Aramco's optimistic assessments of Saudi oil reserves and future production. Minister Al-Naimi has vigorously refuted these arguments, and stated that Saudi Arabia could add as much as 200 billion barrels of oil to proven reserves after the extended period of investment and exploration. In order to stave off decline, wells are undergoing reservoir management and rehabilitation projects, including the installation of “smart well” technologies. Production\n\nSaudi Arabia produces a range of crude oils, from heavy to super light. Of Saudi Arabia's total oil production capacity, about 65-70 percent is considered light gravity, with the rest either medium or heavy; the country is moving to reduce the share of the latter two grades. Lighter grades generally are produced onshore, while medium and heavy grades come mainly from offshore fields. For 2006, the U.S. Energy Information Administration estimates that Saudi Arabia produced around 10.7 million bbl/d of total oil -- comprising crude oil, natural gas liquids, and \"other liquids\" (includes half of the Saudi-Kuwaiti Divided Zone's 600,000 bbl/d). In addition to crude oil, Saudi Arabia produces around 1.5 million bbl/d of natural gas liquids (NGLs) and \"other liquids,\" not subject to OPEC quotas. o API Arabian Light crude. Abqaiq (17 billion barrels of proven reserves) produces approximately 400,000 bbl/d 37 o API Arab Extra Light crude. Since 1994, the Najd fields, which includes the Hawtah field and smaller satellites (Nuayyim, Hazmiyah) south of Riyadh, have been producing around 200,000 bbl/d of 45 o -50 o API, 0.06 percent sulphur, Arab Super Light. Offshore production includes Arab Medium crude from the Zuluf (over 500,000 bbl/d capacity) and Marjan (270,000 bbl/d capacity) fields and Arab Heavy crude from the Safaniya field. Most Saudi oil production, except for \"extra light\" and \"super light,\" is considered \"sour,\" containing relatively high levels of sulfur. The Ghawar field is the main producer of 5 million bbl/d of 34API Arabian Light crude. Abqaiq (17 billion barrels of proven reserves) produces approximately 400,000 bbl/d 37API Arab Extra Light crude. Since 1994, the Najd fields, which includes the Hawtah field and smaller satellites (Nuayyim, Hazmiyah) south of Riyadh, have been producing around 200,000 bbl/d of 45-50API, 0.06 percent sulphur, Arab Super Light. Offshore production includes Arab Medium crude from the Zuluf (over 500,000 bbl/d capacity) and Marjan (270,000 bbl/d capacity) fields and Arab Heavy crude from the Safaniya field. Most Saudi oil production, except for \"extra light\" and \"super light,\" is considered \"sour,\" containing relatively high levels of sulfur. The $4-billion project, known as the Qatif Producing Facilities Development Program (QPFDP), involved construction of two gas-oil separation plants (GOSPs), as well as gas treatment and oil stabilization facilities, for the Qatif and Abu Saafa oilfields (Abu Saafa is half owned by Bahrain). Additional production from these fields was slated to replace production elsewhere in Saudi Arabia, not to boost overall capacity. Despite recent OPEC cuts, Saudi Aramco continues aggressive plans to increase capacity; the following is a table of planed production capacity increases through 2011. In addition to these capacity increases, Saudi Aramco has said that it will also conduct additional drilling at existing fields in order to help compensate for the natural declines from the mature fields. o API sweet (nearly sulfur-free) Arab Extra Light crude oil, with production as of November 2006, at around 550,000 bbl/d from 141 wells. It is the largest oil field in the world that has been developed in the past two decades. According to Oil Minister Naimi (October 1999), the development of Shaybah showed that \"the cost of adding...capacity - that is, all the infrastructure, producing and transportation facilities - necessary to produce one additional barrel of oil per day in Saudi Arabia is, at most, $5,000 compared to between $10,000 and $20,000 in most areas of the world.\" Saudi Arabia's long-term goal is to further develop its lighter crude reserves including the Shaybah field, located in the remote Empty Quarter (Rub al-Khali) area bordering the United Arab Emirates. (In June 2005, the UAE said it wanted to amend a 1974 border pact which gave the Saudis rights to Shaybah, which lies 80 percent in Saudi territory and 20 percent in UAE). Shaybah contains an estimated 14.3 billion barrels of premium grade 41.6API sweet (nearly sulfur-free) Arab Extra Light crude oil, with production as of November 2006, at around 550,000 bbl/d from 141 wells. It is the largest oil field in the world that has been developed in the past two decades. According to Oil Minister Naimi (October 1999), the development of Shaybah showed that \"the cost of adding...capacity - that is, all the infrastructure, producing and transportation facilities - necessary to produce one additional barrel of oil per day in Saudi Arabia is, at most, $5,000 compared to between $10,000 and $20,000 in most areas of the world.\" · The Shaybah complex includes three gas/oil separation plants (GOSPs) and a 395-mile pipeline to connect the field to Abqaiq, Saudi Arabia's closest gathering center, for blending with Arab Light crude (Berri and Abqaiq streams). In addition to oil, Shaybah has a large natural gas \"cap\" (associated gas), with estimated reserves of 25 trillion cubic feet (Tcf). Gas production of 880 million cubic feet per day (MMcf/d) is re-injected. It is reported that possible gas recovery project could be implemented within 5 or 6 years, potentially for use in petrochemical production. · The Khurais fields (including Abu Jifan and Mazalij) west of Ghawar, will increase Saudi production capacity (of Arab Light) by 1.2 million bbl/d at a cost of $3 billion. Once online, Saudi Arabia will be the only oil producer to have two “super giant” fields, that which produce more than 1 million bbl/d of crude oil. This is to involve installation of four GOSPs, with a capacity of 200,000 bbl/d each, at Khurais, which first came online in the 1963, but was mothballed by Aramco some three-decades later. Aramco plans to drill at least 300 exploration wells with 23 rigs. · Several other fields -- Abu Hadriya (1.8-2.0 billion barrels in reserves), Fadhili (1-1.4 billion barrels), Harmaliya, Khursaniya (3.5 billion barrels), and Manifa estimated 10 – 20 billion barrels) -- also mothballed by the Saudis during the 1980s and 1990s, will be brought back online given Saudi desire to maintain spare or “swing” production capacity. In particular, Saudi Aramco is pushing ahead with development of the Abu Hadriya, Fadhili and Khursaniya (AFK) onshore fields. In March 2005, the Saudis awarded eight contracts for work at Khursaniya and also at Hawiya (see below). Production of 500,000 bbl/d (medium, 35 o API) of Arab Light from the AFK fields in on-track for late 2007. Besides AFK, the Saudis are planning to increase Arab Light production from the 1-billion-barrel Nuayyim onshore field by 100,000 bbl/d in 2009. · The $1.5 million Haradh-3 project increased production capacity at the Haradh oil field (which part of Ghawar) to 600,000 bbl/d by in April 2006. The expansion involves adding a third, 300,000-bbl/d GOSP to Haradh (in addition to two other 300,000-bbl/d GOSPs, one of which was inaugurated in January 2004). Haradh also is also producing significant volumes of non-associated natural gas, natural gas condensates and sulfur. The project was carried out by Aramco, along with private partners. · In their 2005 annual report, Saudi Aramco reported five smaller discoveries, three of which were predominantly oil. The new fields include Du'ayban, with 3,260 bbl/ day of Arabian Super Light, Halfa, with 6,000 bbl/d of Arabian Extra Light; and Muraiqib with 1,079 bb/d Arab Light. Also, Aramco reported a successful extension of reserves outside the booked reserves area at Fadhili, northeast of Riyadh. \"According to the report, the discovery could increase reserves by “approximately 700 million barrels of original oil in place, of which…300 million barrels, is recoverable.” Saudi-Kuwaiti Neutral Zone; Bahrain\n\nproduction of the Abu Saafa offshore field. The Saudi-Kuwait Divided Zone, 2230 sq mi between the borders of Saudi Arabia and Kuwait that was left undefined in 1922, contains an estimated 5 billion barrels of proven oil reserves, divided equally between the two countries. Within the Divided Zone, Japan's Arabian Oil Co. (AOC) traditionally operated two offshore fields (Khafji and Hout) with 300,000 bbl/d in production (now approximately 150,000 bbl/d), but in February 2000, it lost the concession (in January 2003, AOC reached an agreement with Kuwait on the right to purchase at least 100,000 bbl/d of crude for the next 20 years from Khafji). Efforts to negotiate an extension of the operating contract with Saudi authorities failed when Japan refused to commit to investment in development projects desired by the Saudis. Saudi Aramco has taken over operation of the former AOC fields. ChevronTexaco, meanwhile, operates three onshore fields (Wafra, South Fawaris, and South Umm Gudair) in the Divided Zone under a 60-year license that expires in 2009. These fields have 2 billion barrels of proven reserves and total production of about 260,000 bbl/d. Finally, Bahrain and Saudi Arabia share the 300,000 bbl/dof the Abu Saafa offshore field. Refining\n\nOil and Gas Journal , Saudi Arabia has seven functioning refineries, with combined crude throughput capacity of around 2.1 million bbl/d, plus around 1.75 million bbl/d of refining capacity overseas, making it the sixth largest oil refiner in the world. The Saudi Aramco development plan calls for a $20-billion investment, increasing domestic refining capacity to 3 million bbl/d and international holdings by at least 1-2 million bbl/d by 2011, particularly in an effort to meet requirements of the fast-growing Asian market. According to, Saudi Arabia has seven functioning refineries, with combined crude throughput capacity of around 2.1 million bbl/d, plus around 1.75 million bbl/d of refining capacity overseas, making it the sixth largest oil refiner in the world. The Saudi Aramco development plan calls for a $20-billion investment, increasing domestic refining capacity to 3 million bbl/d and international holdings by at least 1-2 million bbl/d by 2011, particularly in an effort to meet requirements of the fast-growing Asian market. Saudi Aramco is also aiming to increase private investment through join ventures in downstream petroleum activities. In March 2006, France’s Total and Saudi Aramco announced plans to build a $6-billion, 400,000-450,000 bbl/d export-oriented refinery in Jubail. Also in 2006, Aramco signed an MOU with Conoco Philips for a 400,000-bbl/d heavy conversion facility at Yanbu. As part of the privatization program, 30 percent of shares will reportedly be offered to the public. Reportedly, Aramco is considering putting out a tender for a privately-owned refinery at the port-city of Jizan · Last year Saudi Aramco and Japan’s Sumitomo Chemical broke ground on the $9.8-billion Rabigh Refining and Petrochemical joint venture (PETRORabigh) - one of the biggest projects of its kind. Rabigh will be upgraded to 825,000 bbl/d (from 400,000 bbl/d), while shifting the product mix away from low-value heavy products towards gasoline and kerosene, while integrating the site with a new petrochemicals plan. The refinery will come online in 2008. At the same time, Aramco announced 100,000 bbl/d expansion and integration with neighboring petrochemical plants upgrades for Ras Tanura and Yanbu by 2010 to 2012. · Overseas, Saudi Arabia has interests in refineries in the US, South Korea, Japan and the Phillippeans . In July 2005, a new, $3.6 -billion 160,000 bbl/d refinery and petrochemical plant complex was inaugurated in Fujian, China. The facility is a joint venture between Sinopec (50 percent), ExxonMobil (25 percent), and Saudi Aramco (25 percent). Crude oil for the plant is to be supplied by Saudi Arabia under a long-term agreement, and will come online in 2007/2008. Aramco reports that capacity will be increased to 230,000 in the next few year. Aramco is also in talks with Sinopec to participate in the ongoing construction of a second facility in the northern province of Shandong (Qingdao). Both plants are expected to be able to handle high sulphur (\"sour\") oils, as there is a dearth of such capacity worldwide. · In July 2004, Aramco signed an agreement with Shell to purchase a 15 percent share in Showa Shell Group, a refining and marketing company based in Japan. Under the deal, Aramco will supply Showa Shell with 300,000 bbl/d of crude oil. Saudi Arabia also owns a 7.9 percent share in AOC Holdings, which operates the 192,000 b/d Sodegaura refinery in Japan through a subsidiary, Fuji Oil. · In the Philippines, Aramco is conducting preliminary studies on a new $5-billion refinery at Mindanao, which will supply East Asia and the US West Coast. Aramco is also a 40 percent shareholder in Philippine Petron, which runs a 180,000 b/d refinery on the island. · In March 2005, Saudi Arabia and India signed an agreement on oil cooperation; with the Saudis reportedly interested in acquiring a stake in India Oil Company’s expansion of the 180,000-bbl/d Paradip refinery (it will reach 300,000-bbl/d by 2008). Saudi Aramco is reportedly considering taking a stake in Hindustan Petroleum Corporation Limited's (HPCL) Vishakhapatnam refinery (165,000 bbl/d capacity), which will be doubled in capacity by 2010-ll. · In the United States, Aramco and partner Royal Dutch/Shell are planning an expansion of at least one of their three Motiva joint-venture refineries in Louisiana and Texas. The three facilities have a total capacity of around 745,000, approximately 5 percent of the US refining market. There are detailed plans to expand the 290,000 b/d Port Arthur, Texas facility to 325,000 bbl/d by 2010. According to Aramco, however, future expansion plans will increase total capacity by 600,000 bbl/d. Saudi Aramco owns 50 percent of Motiva though their subsidiary, Saudi Refining. · Aramco also has reported interests in South Korea's Sangyong Oil Refining Company and Motor Oil (Hellas) in Greece. Security Issues\n\nThe Saudi petroleum pipeline and export network (and energy sector in general) remains a terrorism target. In February 2006, Saudi security prevented an attempted suicide bomb attack at the Abqaiq petroleum processing facility, after Al-Qaeda leadership called for renewed attacks against the country’s economic backbone. Nevertheless, energy infrastructure remains well-protected. Following the February incident, the government increased the National Guard and military security force to approximately 20,000, in addition to the 5000 guards employed directly by Aramco. Reportedly, security spending has been ramped up since a series of attacks against energy infrastructure and foreign nationals were carried out in 2004. In addition to direct security, Saudi Arabia is known to ensure export security by maintaining \"redundancy\" (i.e., multiple options for transportation and export) in its oil system, in part as a form of indirect security against any one facility being disabled.", "images": ["https://web.archive.org/web/20071016102723im_/http://eia.doe.gov/emeu/cabs/images/R4_04.jpg", "https://web.archive.org/web/20071016102723im_/http://eia.doe.gov/emeu/cabs/images/Blank.gif", "https://web.archive.org/web/20071016102723im_/http://eia.doe.gov/emeu/cabs/Saudi_Arabia/images/saudi fields Nat Def Uni.gif", "https://web.archive.org/web/20071016102723im_/http://eia.doe.gov/emeu/cabs/images/R4_10.jpg", "https://web.archive.org/web/20071016102723im_/http://eia.doe.gov/emeu/cabs/images/R4_08.jpg", "https://web.archive.org/web/20071016102723im_/http://eia.doe.gov/emeu/cabs/images/R4_05.jpg", "https://web.archive.org/web/20071016102723im_/http://eia.doe.gov/emeu/cabs/Saudi_Arabia/images/projects.gif", "https://web.archive.org/web/20071016102723im_/http://www.eia.doe.gov/images/eia_new.gif", "https://web.archive.org/web/20071016102723im_/http://eia.doe.gov/emeu/cabs/Saudi_Arabia/images/saudi_STEO_production.gif", "https://web.archive.org/web/20071016102723im_/http://eia.doe.gov/emeu/cabs/images/R4_Shadow.jpg", "https://web.archive.org/web/20071016102723im_/http://eia.doe.gov/emeu/cabs/Saudi_Arabia/images/neutzone.gif"], "top_img": "https://web.archive.org/web/20071016102723im_/http://eia.doe.gov/emeu/cabs/Saudi_Arabia/images/projects.gif", "keywords": [], "authors": [], "canonical_link": "", "title": "Saudi Arabia Energy Data, Statistics and Analysis", "meta_data": {"description": "Saudi Arabia Energy Data, Statistics and Analysis - Oil, Gas, Electricity, Coal", "keywords": "Saudi Arabia Energy Data, Statistics and Analysis - Oil, Gas, Electricity, Coal"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}