{"url": "https://www.avclub.com/an-incomplete-depressingly-long-list-of-celebrities-se-1819628519", "text": "L to R: Reese Witherspoon, America Ferrera, Jennifer Lawrence, and Molly Ringwald, all of whom have shared their stories of assault and harassment over the past 24 hours. (Photos: Getty Images)\n\nOver the weekend, a campaign started 10 years ago by a black woman, activist Tarana Burke, to encourage “empowerment through empathy” re-emerged as a response to last week’s soul-crushing torrent of sexual assault allegations against Harvey Weinstein. (Actress Alyssa Milano, widely credited with jump-starting the hashtag, later said she was not aware of Burke’s campaign until later.) That campaign is known as “Me Too,” and it encourages survivors to confirm a devastating, and largely unspoken, truth: That nearly every woman on Earth, and a significant minority of men, has been the victim of sexual assault and/or harassment in their lifetime.\n\n\n\nAdvertisement\n\nThe campaign’s effectiveness hinges on the sheer volume of posts where hundreds of thousands of people share their stories, from a simple “me too” to raw, vulnerable accounts of harassment and assault. As the accounts continue to emerge from everyday people and celebrities alike, we’re going to compile some of the stories celebrities have shared over the past week or so that reach beyond the Weinstein allegations, in hopes that their sheer volume helps demonstrate the ubiquity of this problem.\n\nThe list is by no means comprehensive: We can’t forget the women who have come forward to accuse Weinstein of assault and harassment—including Rose McGowan, Asia Argento, Mira Sorvino, Ambra Battilana Gutierrez, Gwyneth Paltrow, Angelina Jolie, Rosanna Arquette, Angie Everhart, Cara Delevingne, Léa Seydoux, Louisette Geiss, Heather Graham, Ashley Judd, and many more—the more than 60 women who have accused Bill Cosby of sexual assault, the sexual assault and harassment charges leveled against Ain’t It Cool News’ Harry Knowles and former Birth.Movies. Death. editor Devin Faraci, Amber Tamblyn’s recent account of being harassed by James Woods, charges that R. Kelly is keeping women in an abusive “cult,” and the millions of other non-celebrity examples that prove harassment and assault have affected basically every woman and a good number of the men that you—yes, you!—know.\n\nAdvertisement\n\nWe’re also sure this list will have to be updated as more of these stories come out. If it all seems overwhelming, remember: This is only a small fraction. The real numbers are actually much higher.\n\n\n\nReese Witherspoon\n\nLast night, Reese Witherspoon spoke at the Elle Women In Hollywood Awards. She was there to introduce her Big Little Lies co-star Laura Dern, but, like many women who have been reliving every horrible thing that ever happened to them over the past couple of weeks, Witherspoon was having trouble thinking about anything besides the Harvey Weinstein allegations. “I have my own experiences that have come back to me very vividly, and I have found it hard to sleep, hard to think, hard to communicate,” she said.\n\nAdvertisement\n\nShe went on to reveal that she had been assaulted by a director when she was 16 years old, talking about the “anger that I felt at the agents and the producers who made me feel that silence was a condition of my employment.” She added, “I’ve had multiple experiences of harassment and sexual assault, and I don’t speak about them very often, but after hearing all the stories these past few days and hearing these brave women speak up tonight, the things that we’re kind of told to sweep under the rug and not talk about, it’s made me want to speak up and speak up loudly because I felt less alone this week than I’ve ever felt in my entire career.”\n\nAdvertisement\n\nAmerica Ferrera\n\nAlso last night, America Ferrera posted a heart-wrenching story to Instagram revealing that she had been the victim of child sexual abuse:\n\nAdvertisement\n\nJennifer Lawrence\n\nAt the same awards ceremony where Reese Witherspoon shared her story (see above), Jennifer Lawrence gave a speech in which she described her “degrading and humiliating” experiences with producers and casting directors. Lawrence said that, early on in her career, she had been instructed to lose “15 pounds in two weeks”—a practically impossible and definitely unhealthy feat—to get (and keep) a part. “During this time, a female producer had me do a nude lineup with about five women who were much, much, thinner than me,” she said. “We stood side by side with only paste-ons covering our privates.”\n\nAdvertisement\n\nWhen Lawrence went to another producer to complain, “he said he didn’t know why everyone thought I was so fat. He thought I was ‘perfectly fuckable,’” she added. The whole experience left her feeling “trapped” and afraid of being labeled “difficult” if she stood up for herself. “I let myself be treated a certain way because I felt I had to for my career,” she said.\n\nAdvertisement\n\nMolly Ringwald\n\nIn an op-ed posted on The New Yorker website this afternoon, Molly Ringwald says that, while she was able to avoid harassment in her dealings with Harvey Weinstein (“at that moment in time, I was the one with more power,” she writes), “I have had plenty of Harveys of my own over the years, enough to feel a sickening shock of recognition.” She says:\n\nWhen I was thirteen, a fifty-year-old crew member told me that he would teach me to dance, and then proceeded to push against me with an erection. At fourteen, a married film director stuck his tongue in my mouth on set. At a time when I was trying to figure out what it meant to become a sexually viable young woman, at every turn some older guy tried to help speed up the process.\n\nAdvertisement\n\nShe goes on to recall a humiliating audition where she was forced to wear a dog collar for reasons that had nothing to do with the scene, an incident her agent dismissed as “one for the memoirs.” “Stories like these have never been taken seriously. Women are shamed, told they are uptight, nasty, bitter, can’t take a joke, are too sensitive,” Ringwald writes. “And the men? Well, if they’re lucky, they might get elected President.”\n\n\n\nLady Gaga\n\nLady Gaga first publicly revealed her rape at the hands of a record producer back in 2014, when she said on The Howard Stern Show that her song “Swine” was about being assaulted when she was 19 years old and “very naïve.” Gaga later performed a powerful rendition of her song “Til It Happens To You,” from the campus rape documentary The Hunting Ground, at the 2016 Oscars, surrounded by fellow survivors.\n\nAdvertisement\n\nGabrielle Union\n\nGabrielle Union has also been open about her experience as an assault survivor for many years. This morning, she appeared on Good Morning America to promote her new book, We’re Gonna Need More Wine, in which she discusses being raped at gunpoint at the age of 19, among other issues. On the show, she described the powerful post-traumatic stress she experienced upon seeing the hashtag trending:\n\nI saw #MeToo and my arm went numb. I thought it was all about me, and when I realized literally hundreds of thousands of people, men and women, talking about being a part of this unfortunate club. It just rips your heart out. I will continue talking about it, I will continue to try to keep educating. You see so much now with victim blaming and victim shaming and really trying to put the onus on the victim and trying to say that there’s some right way to deal with trauma. And I just have to keep speaking out to dispel as many misconceptions as possible about sexual violence.\n\nAdvertisement\n\nAdvertisement\n\nEvan Rachel Wood\n\nAnother outspoken survivor, Evan Rachel Wood has talked about having been sexually assaulted twice, once by an ex and again by the owner of a bar. Last year, she posted a lengthy statement on Twitter talking about the assaults after touching on them in a Rolling Stone interview, and she has continued to advocate for victims’ rights ever since.\n\nAdvertisement\n\nMore recently, she posted a video explaining why she has yet to name her attackers; it’s “not because I don’t plan on saying these people’s names eventually, but because to start that process is an emotionally draining, financially draining, really everything draining thing to do and to go through and I want to do it when I’m ready,” she said. Over the weekend on Twitter, Wood talked about her experiences with PTSD after being raped, and how she would disassociate to protect herself. You can read those comments in full here.\n\nAdvertisement\n\nAdvertisement\n\nMelanie Lynskey\n\nActress Melanie Lynskey has been an outspoken supporter of the women who came forward to accuse Weinstein, and added her voice in a thread responding to a New York Times editorial by Big Bang Theory star Mayim Bialik, in which Bialik credited her modest dress and inability to conform to an “impossible standard of beauty” for her lack of experience with sexual harassment on set.\n\nAdvertisement\n\nAdvertisement\n\nAdvertisement\n\nBjörk\n\nInspired by the accounts that were already coming out before the #MeToo hashtag took off, on Sunday Björk told the story of her encounters with “a Danish film director” who repeatedly came on to her on set and humiliated and punished her when she turned him down. “It was extremely clear to me when I walked into the actresses’ profession that my humiliation and role as a lesser, sexually harassed being was the norm,” she wrote. Although she didn’t mention him by name, Björk only made one movie with a Danish director, Dancer In The Dark with Lars Von Trier, prompting Von Trier to deny her account the next day. Today Björk shot back with more detailed allegations:\n\nAdvertisement\n\nPatricia Arquette\n\nAfter director Oliver Stone expressed sympathy for Harvey Weinstein, Patricia Arquette suggested that this was a case of creeps protecting their own by detailing her “weird” experience with Stone after he asked to meet with her about a film that was “very sexual” in content. She’s now calling for an end to the backlog of hundreds of thousands of rape kits that are sitting untested at law-enforcement agencies around the world.\n\nAdvertisement\n\nIsa Dick Hackett\n\nHackett, a producer on Amazon’s The Man In The High Castle and Philip K. Dick’s Electric Dreams—both based on the work of her father, sci-fi author Philip K. Dick—gave an interview to The Hollywood Reporter last Thursday in which she accused then-Amazon programming chief Roy Price of sexual harassment. Price, she said, repeatedly and aggressively sexually propositioned her even after she turned him down, going so far as to tell her, “You will love my dick.” Price has since resigned from Amazon Studios.\n\nAdvertisement\n\nHilarie Burton\n\nA former MTV VJ turned actress (she starred on One Tree Hill and currently appears on Fox’s Lethal Weapon reboot), Hilarie Burton accused Ben Affleck of grabbing her breast during an appearance on Total Request Live in 2003, prompting other women, like makeup artist Annamarie Tendler, to also accuse Affleck of improper conduct toward them. Affleck later apologized to Burton, in a one-line tweet that didn’t even have proper punctuation at the end.\n\nAdvertisement\n\nTerry Crews\n\nIn the wake of the Weinstein accusations, Terry Crews came forward to share his story of being groped by an unnamed Hollywood executive in front of his wife at a party, and the shame and fear he felt that prevented him from speaking about it earlier. “Hopefully, me coming forward with my story will deter a predator and encourage someone who feels hopeless,” he wrote. It’s a powerful reminder that sexual assault can happen to anyone. Click through on the tweet below to read the full thread.\n\nAdvertisement\n\nJames Van Der Beek\n\nShortly after Crews came forward, former child star James Van Der Beek talked about his experiences being assaulted by “older, powerful men” as well.\n\nAdvertisement\n\nAdvertisement\n\nJavier Muñoz\n\nMuñoz stars as Alexander Hamilton in the Broadway production of Hamilton. He took over the role from Lin-Manuel Miranda last year.\n\nAdvertisement\n\nJenny Slate\n\nAdvertisement\n\nRosario Dawson\n\nAdvertisement\n\nAnna Paquin\n\nAdvertisement\n\nAnika Noni Rose\n\nAdvertisement\n\nDebra Messing\n\nAdvertisement\n\nFelicia Day\n\nAdvertisement\n\nKimya Dawson\n\nAdvertisement\n\nThese are just a few of those shared in recent days by famous people who were able to talk about what happened to them in public. Just because someone hasn’t posted “Me too” doesn’t meant that they haven’t lived through harassment and assault; they may not be emotionally prepared to talk about their experiences publicly, and re-traumatize themselves in the process. The important thing is to remember that these stories are difficult to tell, and should be believed.\n\nAdvertisement\n\nUpdated October 18, 9:09 a.m.:\n\nIlana Glazer\n\nBroad City co-creator Ilana Glazer’s Instagram post about the “countless” times she’s been sexually harassed is especially depressing because, as she notes, entitled assholes have plagued her from middle school into the present. Teachers, coworkers, restaurant patrons, a doctor, and a couple of Glazer’s employees have all harassed her at some point. And whether she was waiting tables or running her own TV show, Glazer notes she was “a woman in both places.” The gall to then ask “are you sure?” when she wanted to fire someone who’d harassed her is the cherry on top of this shit sundae.\n\nAdvertisement\n\nUpdated October 18, 11:15 a.m.:\n\nTrace Lysette\n\nAdvertisement\n\nViola Davis\n\nAdvertisement\n\nCharlyne Yi\n\nShortly before sharing her story accusing comedian David Cross of racist harassment, Charlyne Yi added her voice to the “Me Too” movement as well:\n\nAdvertisement\n\nMcKayla Maroney\n\nThis morning, Olympic gold medalist McKayla Maroney came forward to reveal that she was repeatedly molested beginning at the age of 13. Her attacker was Larry Nassar, the former doctor for the U.S. Women’s National and Olympic gymnastics teams who has been accused of assault by more than 100 women. Nassar pleaded guilty to federal child pornography charges in June, and is awaiting trial on 22 charges of sexually assaulting children in Michigan.\n\nAdvertisement\n\nMaureen Ryan\n\nAlso this morning, Variety chief TV critic Maureen Ryan published a powerful essay describing her sexual assault at the hands of an unnamed TV executive in 2014. Ryan ended up taking a leave of absence after the assault, after attempts to report her attacker were met with indifference at his company. (“He was reprimanded. That’s it. I later heard that there were rumors of him harassing the network’s assistants,” she writes.)\n\nAdvertisement\n\nRyan’s essay doubles as a call to action for men in Hollywood to take responsibility for the predators in their midst, and to start prioritizing the safety of victims—many of whom leave the industry after learning that assault and harassment are the “price” they’re expected to pay for pursuing their dreams—over the career prospects of predators. “Men, listen up: You may not want to believe that your friend, your colleague, your collaborator is capable of this. Listen to me, LISTEN: The face he shows you may not be his only face,” she writes. You can read her essay in full here.\n\nJanis Hirsch\n\nIn a guest column in The Hollywood Reporter, comedy writer Janis Hirsch recalls the persistent sexual harassment that drove her to leave her job as a staff writer on It’s Garry Shandling’s Show. Although Hirsch’s contributions to the show’s first season—she wrote two of the first six episodes—were well-received, she soon found herself excluded from the otherwise all-male writers’ room, assigned only the “slit scenes,” a.k.a. scenes featuring the show’s only female cast member. (Yeah.)\n\nAdvertisement\n\nFinally, Hirsch was told to quit her job by producer Brad Grey after an incident where one of the show’s actors made the hilarious “joke” of draping his flaccid penis on her shoulder “like a pirate’s dead parrot.” She writes, “My mantra became, ‘I won’t cry until I get home.’ It was amended to ‘I won’t cry until I get into the parking lot,’ which became ‘I won’t cry until I get into the stairwell,’ which morphed into ‘Fuck, I’m crying.’” Hirsch’s essay ends on a rare positive note for these sorts of stories, relaying an anecdote where two younger female writers told her, “Thank you for getting that flaccid penis on your shoulder so we never had to.”\n\nAlso in The Hollywood Reporter, a story called “Hollywood’s Female Crew Members Suffer harassment Without The Platform Of Stardom” tells the stories of dozens of crew members with stories like Hirsch’s, many of whom speak anonymously for fear of retaliation.\n\nAdvertisement\n\nUpdated October 19, 10:03 a.m.:\n\nLaura Dern\n\nThe Big Little Lies and Twin Peaks actress opened up on The Ellen DeGeneres Show about the pervasiveness of sexual harassment in Hollywood, including how she had dismissed misconduct in the past. When Dern was honored at Elle’s Women In Hollywood celebration earlier this week, she initially considered herself “one of the lucky ones,” i.e., one of the few women who hadn’t been assaulted or harassed. She credited her actor parents, Diane Ladd and Bruce Dern, for teaching her early on about the dark side of Hollywood. But it wasn’t until Dern was talking with her mother about the recent flood of revelations from other celebrities (and women in general) that she realized she’d also been sexually harassed as a teen. “It was my mom who said, ‘No, no, no, Laura. That was sexual assault. That was harassment, that was assault. No, you were 14 then,’” Dern told DeGeneres.\n\n\n\nUpdated October 24, 7:55 a.m.\n\nAnna Faris\n\nEntertainment Weekly reports Mom star Anna Faris opened up on her Unqualified podcast about her own experiences with sexual harassment, as well as the ways we condition women to laugh off mistreatment. The host recalled “doing a scene where I was on a ladder and I was supposed to be taking books off a shelf,” when the director of the film “slapped my ass in front of the crew so hard. And all I could do was giggle.” Faris looked to the crew members who’d witnessed the slap, which “seemed weird,” which was precisely how she tried to shrug the whole thing off. Like so many other women, she assumed responsibility for smoothing things over: “I was like, ‘Well, this isn’t a thing. Like, it’s not that big of a deal. Buck up, Faris. Like, just giggle.’ But it made me feel small. He wouldn’t have done that to the lead male.”\n\nAdvertisement\n\nFarris and her guest, UnREAL’s Arielle Kebbel, note that “if we were to do anything else, we’d be labeled a bitch or difficult. That would be the best of circumstances. I guess what I do is I laugh. It puts everyone at ease. That’s the defense mode you go into.”\n\nUpdated November 3, 2:00 p.m.\n\nJessica Barth\n\nYesterday, Ted and Ted 2 star Jessica Barth went to the LAPD to revive a sexual assault accusation first leveled in 2012 against her ex-manager, David Guillod. Barth says she decided to revive the charges after another, unnamed woman came to her to say she had a similar experience with Guillod. The email that inspired Barth to pursue her case anew was in response to a guest post Barth published in The Wrap last week called, “Jessica Barth Wants To Bring Survivors Together With #WhoIsYourHarvey.”\n\nAdvertisement\n\nThe post does not specifically name as Barth’s attacker, but it does detail her story of a manager who pursued her aggressively, first as a client and then for a sexual relationship. Despite her repeated rejections, he persisted, and in 2012 Barth says Guillod sexually assaulted her after drugging her wine at a dinner at a restaurant attended by Barth, one of her friends, and Guillod. She writes:\n\nAt first, I went through textbook emotions experienced by victims of sexual assault. I felt completely ashamed and like it was my fault. Over and over in my mind, ran self-blaming thoughts like, I should have trusted my goddamn instincts, I never should have gone, and I should not have had any wine. I was in a committed relationship that meant the world to me. He knew this. I talked about my relationship throughout the whole dinner. I felt devastated, humiliated and completely violated. I felt this way because he was the one who devastated me, he humiliated me, he violated me. This was years ago and I did not possess the strength or the confidence that I possess today. I was so wrapped up in blaming myself that I failed to even recognize that I had been sexually assaulted. That is how blinding shame can become.\n\nAdvertisement\n\nGuillod has since taken a leave of absence from his company Primary Wave as Barth’s charges are investigated. In reporting its story, The Wrap found that Guillod—who recently executive produced Atomic Blonde, and whose clients include Gina Rodriguez, Nia Long, and Emilio Estevez—left two previous talent agency jobs after being charged with sexual harassment. As for Barth, she says, “I want to prosecute him. I want to do whatever is in my power to make sure this never happens to another woman.”\n\nUpdated November 22, 1:00 p.m.:\n\nGabby Douglas\n\nAfter making comments critical of her teammates McKayla Maroney (see above) and Aly Raisman’s allegations of sexual abuse against their former U.S. Women’s National and Olympic team coach Larry Nassar, three-time Olympic gold medalist Gabby Douglas has come forward to reveal that Nassar sexually abused her, too. She did so in a new apology to her teammates posted on Instagram, following up on a shorter previous apology hashtagged #MeToo. In the post, Douglas speaks in vague terms about the abuse she suffered, placing it in the context of a since-deleted tweet that read, “It is our responsibility as women to dress modestly and be classy. Dressing in a provocative/sexy way entices the wrong crowd.”\n\nAdvertisement\n\nIn her new statement, Douglas says that “I understand many of you didn’t know what I was dealing with,” and clarifies that she does not advocate “victim shaming or blaming in any way, shape, or form.” She says, “I didn’t publicly share my experiences as well as many other things because for years we were conditioned to stay silent and honestly some things were extremely painful. I wholeheartedly support my teammates for coming forward with what happened to them.”", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/e4hvwhqoshzq7daqkzi7.jpg"], "top_img": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/e4hvwhqoshzq7daqkzi7.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.avclub.com/an-incomplete-depressingly-long-list-of-celebrities-se-1819628519", "title": "An incomplete, depressingly long list of celebrities’ sexual assault and harassment stories [UPDATED]", "meta_data": {"google-site-verification": "P13oAn8o8LB6FVCJWKsHWXvxfbR-SJrmvox6EgULpUs", "ir-site-verification-token": "-1270174611", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0,maximum-scale=10.0", "ROBOTS": "INDEX, FOLLOW", "msapplication-square70x70logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/no63bw902mddhwxtjtxh.png", "msapplication-square150x150logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_200,q_80,w_200/no63bw902mddhwxtjtxh.png", "keywords": "Film, Music, #MeToo, Aux, The A.V. Club", "news_keywords": "Film, Music, #MeToo, Aux, The A.V. Club", "twitter": {"url": "https://www.avclub.com/an-incomplete-depressingly-long-list-of-celebrities-se-1819628519", "card": "summary_large_image", "site": "theavclub", "title": "An incomplete, depressingly long list of celebrities’ sexual assault and harassment stories [UPDATED]", "description": "Over the weekend, a campaign started 10 years ago by a black woman, activist Tarana Burke, to encourage “empowerment through empathy” re-emerged as a response to last week’s soul-crushing torrent of sexual assault allegations against Harvey Weinstein. (Actress Alyssa Milano, widely credited with jump-starting the hashtag, later said she was not aware of Burke’s campaign until later.) That campaign is known as “Me Too,” and it encourages survivors to confirm a devastating, and largely unspoken, truth: That nearly every woman on Earth, and a significant minority of men, has been the victim of sexual assault and/or harassment in their lifetime.", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/e4hvwhqoshzq7daqkzi7.jpg"}, "description": "Over the weekend, a campaign started 10 years ago by a black woman, activist Tarana Burke, to encourage “empowerment through empathy” re-emerged as a response to last week’s soul-crushing torrent of sexual assault allegations against Harvey Weinstein. (Actress Alyssa Milano, widely credited with jump-starting the hashtag, later said she was not aware of Burke’s campaign until later.) That campaign is known as “Me Too,” and it encourages survivors to confirm a devastating, and largely unspoken, truth: That nearly every woman on Earth, and a significant minority of men, has been the victim of sexual assault and/or harassment in their lifetime.", "og": {"title": "An incomplete, depressingly long list of celebrities’ sexual assault and harassment stories [UPDATED]", "type": "article", "url": "https://www.avclub.com/an-incomplete-depressingly-long-list-of-celebrities-se-1819628519", "description": "Over the weekend, a campaign started 10 years ago by a black woman, activist Tarana Burke, to encourage “empowerment through empathy” re-emerged as a response to last week’s soul-crushing torrent of sexual assault allegations against Harvey Weinstein. (Actress Alyssa Milano, widely credited with jump-starting the hashtag, later said she was not aware of Burke’s campaign until later.) That campaign is known as “Me Too,” and it encourages survivors to confirm a devastating, and largely unspoken, truth: That nearly every woman on Earth, and a significant minority of men, has been the victim of sexual assault and/or harassment in their lifetime.", "locale": "en_US", "site_name": "The A.V. Club", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/e4hvwhqoshzq7daqkzi7.jpg"}, "fb": {"app_id": 1621890511466174, "pages": 39581755672}}, "movies": ["/ajax/inset/iframe?id=youtube-video-_Jn3urgf7zg&start=0"], "publish_date": null, "source": "https://www.avclub.com", "summary": ""}