{"url": "https://abcnews.go.com/Entertainment/dancing-stars-recap-drew-scott-eliminated-couldnt-asked/story?id=51294867", "text": "'Dancing With the Stars' recap: Drew Scott eliminated, 'couldn't have asked for a better partner' \"Property Brothers\" star Drew Scott was sent home on first night of the finale.\n\n\u0097 -- HGTV's \"Property Brothers\" star Drew Scott turned in his best \"Dancing With the Stars\" performance of the season Monday night, but he was ultimately sent home.\n\nScott and his partner, Emma Slater, said they were grateful for the opportunity to compete and make it as far as they did.\n\n\"I'm just so grateful to even be here and to have Emma to just pull out the best in me every single week. I couldn't have asked for a better partner,\" Scott told ABC News.\n\nBoth will quickly move on to even bigger plans: their respective weddings. \"Emma and her fiance are actually teaching my fiancee and me to dance for the wedding, first dance,\" Scott revealed.\n\nAs for the rest of the competition, Scott said, \"You really never know\" who will take it all.\n\nBut Slater said it ill be Jordan Fisher. \"I'm sure it's going to be Jordan, Jordan,\" she said. \"But everybody's freestyle was so good. It could go either way.\"\n\nThe first night of the finals featured two rounds of competition. First, stars and their partners had to participate in the redemption round, for which the judges gave the stars some personal attention and direction to focus on an earlier performance that needed improvement.\n\nLater the couples competed in the freestyles. Monday also featured special guest judge Julianne Hough, upping the ante for a potential of 40 points per dance.\n\nThe night began with judge Bruno Tonioli's arrival at a rehearsal studio dressed for a dance renovation as a construction worker, albeit a stylized version of one. He was there to work with Scott on a paso doble from an action-film paso that was not his finest moment earlier in the season.\n\n\"I expect a transformation from you, Drew,\" Tonioli said, challenging him to sort out his shaping, artistry and timing.\n\nAfter his routine, the judges called it his best dance, earning him and Slater a 36 out of 40.\n\nCarrie Ann Inaba asked Frankie Muniz and Witney Carson for a repeat of their week 1 foxtrot because Inaba thought he can win the competition. Part of the challenge was for him to deliver a solo portion in the routine. They danced to \"I Won't Dance\" and impressed the judges enough to earn a score of 38.\n\nLater, Pitbull and Fifth Harmony showed up to perform their new single, \"Por Favor.\"\n\nJudge Len Goodman showed up at Fisher and Lindsay Arnold's rehearsal to coach them on a redemption Charleston. After their explosive number — in spite of Arnold's bad knee and Fisher's corneal abrasion — Goodman wanted more traditional moves, but they still got perfect scores from all the judges.\n\nHe didn't dance on the ceiling, but new \"American Idol\" judge Lionel Richie showed up to announce Brittany Holmes as the \"golden ticket\" winner who will get a shot at stardom. \"Idol\" will return to television Sunday, March 11, on ABC.\n\nHough coached Lindsey Stirling on her quickstep. After the performance, Goodman said, \"I know you can play the violin, but there was no fiddling about with that quickstep. Honestly, all the flair. The difficulty with quickstep is to get the speed but maintain the control. And you did that. You used the word — I'm going to use a word I never use because it's an American word: awesome.\"\n\nTheir routine brought them a perfect score.\n\nScott returned for his freestyle, which Slater said \"is going to be different than everybody else's because you're different from everybody else.\"\n\nTheir lively dance earned praise from everyone but Inaba, who said she saw him go out of sync with the team of dancers, ruining his chance at a perfect score. His freestyle earned him his highest score so far, 39.\n\nMuniz and Carson chose a freestyle with dark aspects in spite of a producer's suggestion that Muniz be light. The decision to go out of his comfort zone drew cheers from the audience, and they chanted his name after the routine.\n\nThe judges praised the performance and the decision to go dark, but Inaba and Goodman awarded only 9s, while Bruno and Hough gave them 10s, for a 38.\n\nAlmost unsurprisingly, Fisher's jazzy freestyle and Stirling's quirky freestyle with Mark Ballas earned both pairs their second perfect scores for the night.\n\nAfter an exciting evening filled with magnificent performances, the combined viewer votes and judges' scores put Fisher and Stirling into competition for the Mirror Ball. Scott and Muniz were in jeopardy, and it was Muniz who made it to the final night.\n\nScott showed great sportsmanship with his closing remarks, saying of his partner, \"I mean, there's no way I could have done anything I did out here without her. It's been such a ride. I can't believe I'm here with these guys. Thank you. Thanks to the judges, crew and everybody. It's a once in a lifetime opportunity.\"\n\nThe second night of finals on \"Dancing With the Stars\" airs today at 8 p.m. on ABC.", "images": ["https://s.abcnews.com/images/Entertainment/dancing-with-the-stars-drew-scott-emma-slater-gty-ml-171121_16x9_992.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://s.abcnews.com/images/Entertainment/dancing-with-the-stars-drew-scott-emma-slater-gty-ml-171121_16x9_992.jpg", "keywords": [], "authors": ["Abc News", "Mick Stingley", "November", "Min Read"], "canonical_link": "https://abcnews.go.com/Entertainment/dancing-stars-recap-drew-scott-eliminated-couldnt-asked/story?id=51294867", "title": "'Dancing With the Stars' recap: Drew Scott eliminated, 'couldn't have asked for a better partner'", "meta_data": {"keywords": "Dancing with the Stars, dancing, competition, tv show", "copyright": "2020 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "'Dancing With the Stars' recap: Drew Scott eliminated, 'couldn't have asked for a better partner'", "og": {"site_name": "ABC News", "url": "https://abcnews.go.com/Entertainment/dancing-stars-recap-drew-scott-eliminated-couldnt-asked/story?id=51294867", "title": "'Dancing With the Stars' recap: Drew Scott eliminated, 'couldn't have asked for a better partner'", "image": "https://s.abcnews.com/images/Entertainment/dancing-with-the-stars-drew-scott-emma-slater-gty-ml-171121_16x9_992.jpg", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2017-11-21T18:56:38Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,51294867", "ipad": "abcnewsipad://link/story,51294867", "googleplay": "https://abcnews.go.com/Entertainment/dancing-stars-recap-drew-scott-eliminated-couldnt-asked/story?id=51294867"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "'Dancing With the Stars' recap: Drew Scott eliminated, 'couldn't have asked for a better partner'", "url": "https://abcnews.go.com/Entertainment/dancing-stars-recap-drew-scott-eliminated-couldnt-asked/story?id=51294867", "image": {"identifier": "https://s.abcnews.com/images/Entertainment/dancing-with-the-stars-drew-scott-emma-slater-gty-ml-171121_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,51294867", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,51294867", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/Entertainment/dancing-stars-recap-drew-scott-eliminated-couldnt-asked/story?id=51294867", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/Entertainment/dancing-stars-recap-drew-scott-eliminated-couldnt-asked/story?id=51294867"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "https://abcnews.go.com", "summary": ""}