{"url": "https://www.hollywoodreporter.com/live-feed/greys-anatomy-how-jessica-capshaw-sarah-drew-were-written-1112731", "text": "[This story contains spoilers from Grey's Anatomy's 14th season finale, \"All of Me.\"]\n\nGrey's Anatomy star Ellen Pompeo previewed that the season 14 exits for co-stars Sarah Drew (April) and Arizona (Jessica Capshaw) would not be tragic as \"you only get killed off [the show] when your behavior is bad.\"\n\nAnd judging from how Thursday's finale ended for both departing actresses, it's clear that the ABC medical drama valued Capshaw and Drew as much as their legions of viewers did. News broke in March that Capshaw and Drew — who have been with the Shondaland drama for 10 and nine seasons, respectively — would be departing at the conclusion of the current season.\n\nAfter a penultimate episode in which Drew's April Kepner came this close to death, the finale jumped forward a few weeks to reveal that she'd quit her job at Grey Sloan Memorial to \"do God's work.\" It brought the religious character's crisis-of-faith storyline to a close and was capped off when April and Matthew (Justin Bruening) tied the knot after Alex (Justin Chambers) and Jo's (Camilla Luddington) destination wedding went off the rails. (Don't fret, Alex and Jo got married on a ferry, with Meredith — ordained online — performing the ceremony.)\n\nAs for Capshaw's Arizona, well, she got her happily ever after as well. Following her decision to move from Seattle to New York so her daughter, Sofia, could be in the same city with her other mother, Callie (former series regular Sara Ramirez). What's more, Arizona revealed that Callie was now single as well as the former married couple seemed poised to start anew.\n\nCreator Shonda Rhimes acknowledged the duo Thursday after the finale.\n\nI will never stop being grateful for the chance to work with @sarahdrew and @JessicaCapshaw. In April and Arizona, they created powerful unforgettable characters. #GreysAnatomy #TGIT — shonda rhimes (@shondarhimes) May 18, 2018\n\nThat Arizona and April would both find love with their respective former flames Callie and Matthew was a fitting way for the onscreen friends to go out together in a season that has increasingly honored its history. In a nod to its roots, the finale also featured a cameo of sorts by Ramirez as her cover of Brandi Carlile's \"The Story\" from the season seven musical was featured during the double-wedding final scene.\n\nThe decision to part ways with Capshaw and Drew was a creative one, showrunner Krista Vernoff said, and not based on salary or budget factors after Pompeo inked a new $20 million annual deal that made her TV's highest paid actress on a primetime drama.\n\n\"The suggestion ... that our cast changes are in any way related to Ellen Pompeo's salary renegotiation is wrong and hurtful and misguided,\" wrote Vernoff, who like Pompeo, has been a vocal advocate of salary parity. \"It smacks of an old, broken, patriarchal notion that women must be pitted against each other and that one woman's success will be costly to others.\n\nCapshaw has been with Grey's for 10 seasons, nine as a series regular playing Arizona, the openly gay pediatrics surgeon who was almost immediately embraced by the LGBTQ community. With former star Ramirez, Capshaw was part of one of primetime's first lesbian weddings. The character helped Grey's receive multiple awards from LGBTQ watchdog group GLAAD, while also representing a traditionally underserved community in an era when gay characters were still few and far between.\n\nDrew, with the Shondaland drama for nine seasons (eight as a regular), came in as an intern and has been wildly praised for April's commitment to her Christianity, which was put to the test this season.\n\n\"It's always hard for me to say goodbye to any of my characters. Both Arizona Robbins and April Kepner are not only beloved but iconic — both the LBGTQ and devout Christian communities are underrepresented on TV,\" Rhimes said back in March when news of their departures broke. \"I will be forever grateful to both Jessica and Sarah for bringing these characters to life with such vibrant performances and for inspiring women around the globe. They will always be a part of our Shondaland family.\"\n\nCapshaw and Drew become the second and third series regulars to exit Grey's this season. They join Martin Henderson (Nathan), who was written out after a two-season run. (For her part, Drew quickly booked a post-Grey's role in CBS' Cagney and Lacey pilot that ultimately was passed over at the network.)\n\nThe exits come as Grey's — ABC's No. 2 drama behind The Good Doctor — is in a period of change. After saying farewell to series regular Jerrika Hinton (Stephanie) last year, star Jason George (Ben) transitioned to Station 19, the recently renewed firefighter spinoff. The drama, which welcomed back Vernoff as co-showrunner (after her stint in seasons one through seven) as creator Rhimes prepared her move to Netflix, also introduced six new interns as the veteran drama looks to repopulate its ranks.\n\nElsewhere in the finale, former star Kim Raver (Teddy) returned following a one-episode bottle episode in which Owen (Kevin McKidd) traveled to Germany to make a play for his old Army friend and colleague. The finale opened the door for Raver to return in a more permanent role as Bailey (Chandra Wilson) — enjoying the financial rewards of her \"Trailblazer\" — tapped Teddy to serve as interim chief as Grey Sloan's newest (former) doc also revealed she was pregnant (following her romp with Owen).\n\nAs for who else could return in the recently announced 15th season, the door remains open for Scott Speedman to reprise his role as the charismatic Nick Marsh, a transplant surgeon who hit it off with Meredith (Pompeo) earlier this season. (The finale also featured an interesting moment between Meredith and her daughter, Zola, about finding love again.)\n\nWhat did you think of how April and Arizona's storyline ended? Sound off in the comments section below. Grey's Anatomy returns in the fall on ABC.", "images": ["https://cdn1.thr.com/sites/default/files/2018/05/149228_2806.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/01/greg_berlanti_sharon_horgan_alex_kurtzman_and_dwayne_johnson_-_getty_-_h_2020.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/04/lesley_goldberg_0.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/03/mrs._america_-_publicity_still_1-_h_2020_.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/blogicon_livefeed-black2.png", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2018/05/149228_2806.jpg"], "top_img": "https://cdn1.thr.com/sites/default/files/2018/05/149228_2806.jpg", "keywords": [], "authors": ["Lesley Goldberg", "Lesley.Goldberg Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/live-feed/greys-anatomy-how-jessica-capshaw-sarah-drew-were-written-1112731", "title": "How 'Grey's Anatomy' Wrote Out Jessica Capshaw and Sarah Drew", "meta_data": {"viewport": "width=device-width", "description": "The fan favorites made their last appearance on the ABC medical drama during Thursday's season 14 finale.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/live-feed/greys-anatomy-how-jessica-capshaw-sarah-drew-were-written-1112731", "domain": "https://www.hollywoodreporter.com/", "title": "How 'Grey's Anatomy' Wrote Out Jessica Capshaw and Sarah Drew", "description": "The fan favorites made their last appearance on the ABC medical drama during Thursday's season 14 finale.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2018/05/149228_2806.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "How 'Grey's Anatomy' Wrote Out Jessica Capshaw and Sarah Drew", "description": "The fan favorites made their last appearance on the ABC medical drama during Thursday's season 14 finale.", "url": "https://www.hollywoodreporter.com/live-feed/greys-anatomy-how-jessica-capshaw-sarah-drew-were-written-1112731", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2018/05/149228_2806.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "How 'Grey's Anatomy' Wrote Out Jessica Capshaw and Sarah Drew", "sailthru.description": "The fan favorites made their last appearance on the ABC medical drama during Thursday's season 14 finale.", "sailthru.author": "Lesley Goldberg", "sailthru.channel": "Live Feed", "sailthru.vertical": "Live Feed", "sailthru.date": "2018-05-17 18:00:00", "sailthru.tags": "Live Feed, Television, Jessica Capshaw , Sarah Drew, Shonda Rhimes, Grey&#39;s Anatomy"}, "movies": [], "publish_date": 1526551200.0, "source": "https://www.hollywoodreporter.com", "summary": ""}