{"url": "https://www.rollingstone.com/music/music-features/janelle-monae-frees-herself-629204/", "text": "Janelle Monáe is crying in her spacesuit. It’s early April in Atlanta, and she’s in one of the basement studios of her Wondaland Records headquarters, surrounded by computer monitors and TV screens, one of them running a screensaver that displays images of her heroes: Prince, Martin Luther King Jr., Pam Grier, Tina Turner, Lupita Nyong’o, David Bowie. She’s about to reveal, for the first time, something the world has long guessed, something her closest friends and family already know, something she’s long been loath to say in public. As she sings on a song from her new album, Dirty Computer, “Let the rumors be true.” Janelle Monáe is not, she finally admits, the immaculate android, the “alien from outer space/The cybergirl without a face” she’s claimed to be over a decade’s worth of albums, videos, concerts and even interviews – she is, instead, a flawed, messy, flesh-and-blood 32-year-old human being.\n\nAnd she has another rumor to confirm. “Being a queer black woman in America,” she says, taking a breath as she comes out, “someone who has been in relationships with both men and women – I consider myself to be a free-ass motherfucker.” She initially identified as bisexual, she clarifies, “but then later I read about pansexuality and was like, ‘Oh, these are things that I identify with too.’ I’m open to learning more about who I am.”\n\nIt’s a lovely spacesuit she’s wearing, a form-fitting white NASA artifact complete with a “commander” patch on one arm and an American flag on the other. She’s put it on for no reason at all – there are no cameras in sight – as she lounges around Wondaland. The outfit is a remnant, perhaps, of the android persona, known as Cindi Mayweather, that she fed us all these years: a messianic, revolutionary robot who fell in love with a human and vowed to free the rest of the androids.\n\nEarly in her career, Monáe was insecure about living up to impossible showbiz ideals; the persona, the androgynous outfits, the inflexible commitment to the storyline both on- and offstage, served in part as protective armor. “It had to do with the fear of being judged,” she says. “All I saw was that I was supposed to look a certain way coming into this industry, and I felt like I [didn’t] look like a stereotypical black female artist.”\n\nShe is also a perfectionist, a tendency that’s helped her career and hindered her emotional life; portraying a flawless automaton was also a bit of wish fulfillment. It’s one of the many reasons she thought she had a “computer virus” that needed cleaning, which led her to years of therapy, starting before the 2010 release of her debut, The ArchAndroid. “I felt misunderstood,” she says. “I was like, ‘Before I self-destruct, before I become a confused person in front of the world, let me seek some help.’ I was afraid for anybody to see me not at the top of my game. That obsession was too much for me.”\n\nSo she overcompensated, as she puts it, leaving fans to puzzle over the sight and sound of a dark-skinned, androgynously dressed black woman creating Afro-futuristic fantasias as trippy as the Parliament-Funkadelic soundscapes she grew up hearing. She became a pop anomaly, a sometimes incongruous interloper in the universes of her earliest supporters, Big Boi and Puff Daddy, the latter having signed her to a partnership with Bad Boy Records in 2008. The ArchAndroid was a buzzy introduction, and 2013’s Electric Lady – certainly the first progged-out concept album in the history of Bad Boy – established her as one of the 21st century’s most inventive voices. Years before Frank Ocean, Solange, Beyoncé and SZA pushed arty, alternative R&B to the mainstream, Monáe was already there, bridging the gap between neo-soul and all that was to come, unafraid to fuse rock, funk, hip-hop (when she feels like it, as on her recent single “Django Jane,” she’s a top-flight rapper), R&B, electronica and campy, drama-kid theatricality.\n\nShe always ducked questions about her sexuality (“I only date androids” was a stock response) but embedded the real answers in her music. “If you listen to my albums, it’s there,” she says. She cites “Mushrooms & Roses” and “Q.U.E.E.N.,” two songs that reference a character named Mary as an object of affection. In the 45-minute film accompanying Dirty Computer, “Mary Apple” is the name given to female “dirty computers” taken captive and stripped of their real names, one of whom is played by Tessa Thompson. (The actress has been rumored to be Monáe’s girlfriend, though Monáe won’t discuss her dating life.) The original title of “Q.U.E.E.N.,” she notes, was “Q.U.E.E.R.,” and you can still hear the word on the track’s background harmonies.\n\nMonáe is the CEO of her own label, a CoverGirl model and a movie star, appearing in the Oscar-winning Moonlight and the Oscar-nominated Hidden Figures, two hits led by black casts. In both films, she tackles black American stories that don’t typically get the big-screen treatment. “Our stories are being erased, basically,” she says of her attachment to those scripts, which made her “want to tell my story.”\n\nMonáe does worry that the human behind her masks may not be enough. She has asked aloud, including in therapy, “What if people don’t think I’m as interesting as Cindi Mayweather?” She’ll miss the freedom of being the android. “I created her, so I got to make her be whatever I wanted her to be. I didn’t have to talk about the Janelle Monáe who was in therapy. It’s Cindi Mayweather. She is who I aspire to be.”\n\nOn Dirty Computer, the only hints of sci-fi are in the title and the storyline of the accompanying film. The lyrics are flesh-and-blood confessions of both physical and emotional insecurity, punctuated with sexual liberation. They’re the unfiltered desires of an overthinker letting herself speak without pause, for once. And she wants to help listeners gain the courage to be dirty computers too. “I want young girls, young boys, nonbinary, gay, straight, queer people who are having a hard time dealing with their sexuality, dealing with feeling ostracized or bullied for just being their unique selves, to know that I see you,” she says in a tone befitting the “commander” patch on her arm. “This album is for you. Be proud.”\n\nMonáe grew up in a massive, devoutly Baptist family in Kansas City, Kansas, or as she likes to put it, “I got 50 first cousins!” Not all of them know details of her romantic life, but they have almost certainly seen her wear sheer pants and share a lollipop with Thompson in the “Make Me Feel” video. “I literally do not have time,” she says, laughing, “to hold a town-hall meeting with my big-ass family and be like, ‘Hey, news flash!’ ” She worries that when we visit Kansas City tomorrow, they’ll bring it up: “There are people in my life that love me and they have questions, and I guess when I get there, I’ll have to answer those questions.”\n\nOver the years, she’s heard some members of her family, mostly distant ones, say certain upsetting things. “A lot of this album,” she says, “is a reaction to the sting of what it means to hear people in my family say, ‘All gay people are going to hell.’ ”\n\nShe began questioning the Bible and her family’s Baptist faith early on. Now, she says, “I serve the God of love” – love, she’s determined, is the common factor among all religions, an idea Stevie Wonder expanded on in a Dirty Computer interlude.\n\nWhen we arrive in the flat, industrial Kansas side of Kansas City, her family doesn’t actually have any questions – or anything unkind to say, for that matter. There’s just a whole lot of love for their homegrown superstar.\n\nJanelle Monáe Robinson was born here on December 1st, 1985, to a mom who worked as a janitor and a dad who was in the middle of a 21-year battle with crack addiction. Her parents separated when Monáe was less than a year old, and her mother later married the father of Janelle’s younger sister, Kimmy.\n\nMonáe’s loving warnings about the sheer size of her family ring true as soon as we step into her old neighborhood. On one street, her maternal grandmother owned several homes in a row that housed cousins, aunts, uncles and Monáe herself. A few minutes away is her paternal great-grandmother’s pastel-coated house. Monáe spent a significant portion of her time there – it was her main connection to her dad and his family as he went in and out of prison; their relationship was rocky until he got sober 13 years ago. Another short car ride away is her maternal Aunt Glo’s home, where we meet her mom. “She’s my favorite slice of pie,” her Auntie Fats says, referring to Monáe’s familial nickname of “pun’kin.”\n\nMonáe was raised in a working-class community called Quindaro. It started as a settlement established by Native Americans and abolitionists just prior to the Civil War, and became a refuge for black Americans escaping slavery via the Underground Railroad. A few weeks before our visit, vandals painted swastikas and “Hail Satan” on a statue of abolitionist John Brown in the neighborhood. It’s since been repainted. “I know nobody in this neighborhood did that,” her great-grandmother says, shaking her head. “Outsiders.”\n\nOn the Missouri side of the bridge, Kansas City is predominately white, but Monáe’s community is overwhelmingly black. “I would read about where I was from,” she says, “and understand who’s really disadvantaged coming from these environments. It sucks. It’s like that for brown folks.”\n\nIt’s hard to miss her family’s religiosity – they hardly get a sentence out without a mention of God’s blessings. At 91, Monáe’s great-grandma still monitors the halls at the local vacation Bible school with a switch in hand. During our visit, she sits behind a piano to lead a gospel singalong. Monáe, beside an aunt and a cousin, joins in, belting “Call Him Up and Tell Him What You Want” and “Savior, Do Not Pass Me By.”\n\nMonáe is never more relaxed during our time together than when she’s in Kansas City. Her Midwestern drawl comes back as she screams and sings while running into the arms of her cousins, aunts and uncles, many of whom she gets to see only during the holidays or tour stops nearby. At one point, she curls up into her mom’s lap while they look at a homemade poster full of sepia-toned childhood pics. “She was a delightful baby,” Auntie Fats recalls.\n\nMonáe’s family members all share different versions of the same story: She was born to be a star, and she made that clear as soon as she gained motor skills. There was that time she got escorted out of church for insisting on singing Michael Jackson’s “Beat It” in the middle of the service. There were the talent shows for Juneteenth where she covered “The Miseducation of Lauryn Hill” three years in a row and won each time. She was the star of the school musicals, except for The Wiz her senior year, when she lost the role of Dorothy because she had to leave the audition early to pick up her mom at work. She’s still a bit miffed about not getting that part.\n\nMonáe soon passed a bigger audition, for the American Musical and Dramatic Academy, and headed to New York. She studied musical theater and shared a small apartment with a cousin where she didn’t even have a bed to herself. When she wasn’t in class, she was working.\n\nMeanwhile, an old friend was having the college experience Monáe desired, in Atlanta, so she relocated. The rest is well-trod history in the myth-building of Monáe: She was an Afro’d neo-soul singer strumming her guitar on college quads and working at Office Depot. She was fired from that job for using one of the company’s computers to respond to a fan’s e-mail, an incident that inspired the song “Lettin’ Go.”\n\nThat song caught the attention of Big Boi, who put her on Outkast’s Idlewild and helped connect her with Sean Combs. “I’m-a be honest with you,” her dad says, recalling an invite to one of Monáe’s shows in Atlanta, where Combs was supposed to be in the house. “I was like, ‘Yeah, right.’ I didn’t think Puff Daddy was coming.”\n\nSkepticism aside, Michael Robinson was proud of the invite. He’d recently gotten sober, and the two were repairing their relationship. He spent much of Janelle’s childhood hearing about her immense talents from the more-present members of their family. He was honored that they had come far enough for Monáe to want him to be there for such an important concert. But he still didn’t believe Puffy would be there.\n\n“I go down there with my two cousins, and she says, ‘Dad, everyone’s gonna know you’re not from here. Your jeans are creased.’ ” Fashion faux pas aside – he insists he hasn’t creased his jeans since – Robinson was in for a pleasant surprise when one of his cousins spotted Combs and Big Boi in the back. It was the beginning of his daughter’s new life, and he was just in time to be along for the journey. “I remember thinking, ‘This is what the big time is like,’ ” he muses. “They had all the cameras, all the lights. It was all about Janelle.”\n\nWondaland Arts Society’s headquarters feels like a utopian synthesis of Monáe’s past lives in Kansas City and Manhattan. It sits inconspicuously in the midst of suburban Atlanta and looks like every other neighborhood home, with its two floors and brick exterior. Inside is much more ostentatious, with vintage clocks wallpapering the foyer, pristine white couches in the communal living spaces, and books and records everywhere.\n\nIt mimics the close-knit, constant accessibility of her childhood in Kansas City, with all its artists popping in and out of the space throughout each day to record new music, rehearse for shows and present the final product to the rest of the collective. At one point, the singer-rapper Jidenna shows up, having recently returned from a trip to Africa – everyone immediately starts teasing him about his newly buff physique.\n\nSimultaneously, Chuck Lightning, seemingly the more extroverted half of two-man funk act Deep Cotton, who make their own music as well as work with Monáe, grabs a bowl of quinoa from the kitchen as Monáe doles out decisions on which version of the “Pynk” video will be released (they settle on the one without the spoken-word love poem that appears within the song in the film).\n\nMonáe recorded most of Dirty Computer here, in a small studio with Havana-inspired decor. Guests and collaborators ranged from Grimes to Brian Wilson, who added harmonies to the title track. The album’s liner notes cite Bible verses and a recent Quincy Jones interview alongside Monica Sjöö’s The Great Cosmic Mother and Ryan Coogler’s Black Panther.\n\nBut she was particularly close to one inspiration. Monáe was good friends with Prince, who personally blessed the album’s glossy camp tone and synthed-out hooks. “When Prince heard this particular direction, he was like, ‘That’s what y’all need to be doing,’ ” Lightning says. “He picked out that sound as what was resonating with him.” Prince gave highly specific music and equipment recommendations from the era they were drawing on, including Gary Numan, whom he loved. “The most powerful thing he could do was give us the brushes to paint with,” Lightning says.\n\nRumors spread that Prince co-wrote the single “Make Me Feel,” which features a “Kiss”-like guitar riff. “Prince did not write that song,” says Monáe, who sorely missed his advice during the production process. “It was very difficult writing this album without him.” Prince was the first person to get a physical copy of The ArchAndroid – she presented the CD to him with a flower and the titles written out by hand. “As we were writing songs, I was like, ‘What would Prince think?’ And I could not call him. It’s a difficult thing to lose your mentor in the middle of a journey they had been a part of.”\n\nStevie Wonder was another early fan of Monáe, and a conversation between them – Wonder insisted she record it – appears as an interlude on Dirty Computer. At one point, years ago, her budding friendships with both legends collided: She had to choose between playing with Prince at Madison Square Garden or with Wonder in Los Angeles. Prince encouraged her to pick Stevie.\n\nOn election night in 2016, Monáe found herself experiencing an unfamiliar emotion. “For the first time,” she says, “I felt scared.” Overnight, she went from living in a country whose president loved her music and had her perform on the White House lawn to one where it felt like her right to exist was threatened. “I felt like if I wake up tomorrow,” she says, “are people going to feel they have the right to just, like, kill me now?”\n\nMonáe had already been a committed activist. In 2015, with members of Wondaland, she created “Hell You Talmbout,” which demands we say the names of black Americans who have been victims of racial violence and police brutality. Before #MeToo and Time’s Up, Monáe created an organization, Fem the Future, which stemmed from her frustrations about opportunities for women in the music industry. She was called on to perform at the 2017 Women’s March and to speak about Time’s Up while introducing Kesha at the Grammys. “We come in peace, but we mean business,” she told the cheering crowd.\n\nThat sums up Monáe’s mindset in the Trump era. She hopes not to destroy the oppressors but to change their minds. “The conversations might not happen with people in the position of power,” she says, “but they can happen through a movie, they can happen through a song, they can happen through an album, they can happen through a speech on TV. Most of them will probably turn off their TVs, but . . .”\n\nShe’s in a New York hotel now, two weeks before the album’s release. “There’s some anxiety there, but I feel brave,” she says, teetering between her typical sternness and a bit of vulnerable shakiness. No tears will be shed today. “My musical heroes did not make the sacrifices they did for me to live in fear.” Her activism isn’t the focus of Dirty Computer, but it’s there, hovering above every note. She ended band rehearsal in Atlanta by asking the musicians to reflect on how American this album is. Monáe’s America is the one on the fringes; it accepts the outsiders and the computers with viruses, like the ones she thought she had.\n\nShe understands the significance of now making her personal life a bigger, louder part of her art. She cites the conversation around one of her films as an example of how she might use her own story to engage with more-conservative listeners. “When I did Hidden Figures, there were some Republican white men tweeting about it and how they just felt bad. You could feel through their tweets that they were just like, ‘These black women did help us get to space. How could we treat them like that?’ ”\n\nMeanwhile, she’s again anticipating questions from her family back in Kansas. She seems more worried about them than what anyone else has to say. Still, Dirty Computer is meant to be a celebration, and if she loses a few people along the way, Monáe seems OK with that risk.\n\n“Through my experiences, I hope people are seen and heard,” she says, sitting at a hotel-room desk, dressed up from a day of promo in a puffy black-and-red jacket, matching red pants and terry-cloth hotel slippers. “I may make some mistakes. I may have to learn on the go, but I’m open to this journey.” She sighs, voice confident and stare unfaltering. “I need to go through this. We need to go through this. Together. I’m going to make you empathize with dirty computers all around the world.”", "images": ["https://www.rollingstone.com/wp-content/uploads/2018/06/janelle-monae-cover-story-rolling-stone-2018-40f2968e-20e6-4009-88a1-c1d4c1c8371e.jpg", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fmusic%2Fmusic-features%2Fjanelle-monae-frees-herself-629204%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=629204&comment_count=4", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/janelle-monae-cover-story-rolling-stone-2018-40f2968e-20e6-4009-88a1-c1d4c1c8371e.jpg", "keywords": [], "authors": ["Brittany Spanos", "Staff Writer", "Brittany Spanos'S Most Recent Stories", "Lady Gaga", "Celine Dion", "Andrea Bocelli", "John Legend Offer", "The Prayer", "For", "Together At Home"], "canonical_link": "https://www.rollingstone.com/music/music-features/janelle-monae-frees-herself-629204/", "title": "Janelle Monáe Frees Herself", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "Janelle Monae rose to fame as an endlessly inventive pop android. Now, she's finally revealing the real person inside.", "news_keywords": "Janelle Monae, LGBT", "og": {"type": "article", "title": "Janelle Monáe Frees Herself", "url": "https://www.rollingstone.com/music/music-features/janelle-monae-frees-herself-629204/", "description": "She rose to fame as an endlessly inventive pop android. Now, she’s finally revealing the real person inside", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/janelle-monae-cover-story-rolling-stone-2018-40f2968e-20e6-4009-88a1-c1d4c1c8371e.jpg", "width": 1024, "height": 662, "alt": "Janelle Monáe Frees Herself Rolling Stone Cover"}, "locale": "en_US"}, "article": {"published_time": "2018-04-26T12:00:00+00:00", "modified_time": "2018-06-25T15:57:57+00:00"}, "twitter": {"text": {"title": "Janelle Monáe Frees Herself"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/janelle-monae-cover-story-rolling-stone-2018-40f2968e-20e6-4009-88a1-c1d4c1c8371e.jpg?w=1024", "alt": "Janelle Monáe Frees Herself Rolling Stone Cover"}, "card": "summary_large_image", "site": "@RollingStone", "creator": "@ohheybrittany", "title": "Janelle Monáe Frees Herself", "description": "Janelle Monae rose to fame as an endlessly inventive pop android. Now, she's finally revealing the real person inside."}, "generator": "WordPress 5.4", "author": "Brittany Spanos", "content_type": "Article", "post_id": 629204, "title": "Janelle Monáe Frees Herself", "published_at": "2018-04-26 12:00:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/janelle-monae-cover-story-rolling-stone-2018-40f2968e-20e6-4009-88a1-c1d4c1c8371e.jpg?w=1024", "comment_count": 4, "tags": "LGBT", "topics": "Music Features", "body": "Janelle Monáe is crying in her spacesuit. It's early April in Atlanta, and she's in one of the basement studios of her Wondaland Records headquarters, surrounded by computer monitors and TV screens, one of them running a screensaver that displays images of her heroes: Prince, Martin Luther King Jr., Pam Grier, Tina Turner, Lupita Nyong'o, David Bowie. She's about to reveal, for the first time, something the world has long guessed, something her closest friends and family already know, something she's long been loath to say in public. As she sings on a song from her new album, Dirty Computer, \"Let the rumors be true.\" Janelle Monáe is not, she finally admits, the immaculate android, the \"alien from outer space/The cybergirl without a face\" she's claimed to be over a decade's worth of albums, videos, concerts and even interviews – she is, instead, a flawed, messy, flesh-and-blood 32-year-old human being. And she has another rumor to confirm. \"Being a queer black woman in America,\" she says, taking a breath as she comes out, \"someone who has been in relationships with both men and women – I consider myself to be a free-ass motherfucker.\" She initially identified as bisexual, she clarifies, \"but then later I read about pansexuality and was like, ‘Oh, these are things that I identify with too.' I'm open to learning more about who I am.\"It's a lovely spacesuit she's wearing, a form-fitting white NASA artifact complete with a \"commander\" patch on one arm and an American flag on the other. She's put it on for no reason at all – there are no cameras in sight – as she lounges around Wondaland. The outfit is a remnant, perhaps, of the android persona, known as Cindi Mayweather, that she fed us all these years: a messianic, revolutionary robot who fell in love with a human and vowed to free the rest of the androids. Early in her career, Monáe was insecure about living up to impossible showbiz ideals; the persona, the androgynous outfits, the inflexible commitment to the storyline both on- and offstage, served in part as protective armor. \"It had to do with the fear of being judged,\" she says. \"All I saw was that I was supposed to look a certain way coming into this industry, and I felt like I [didn't] look like a stereotypical black female artist.\"She is also a perfectionist, a tendency that's helped her career and hindered her emotional life; portraying a flawless automaton was also a bit of wish fulfillment. It's one of the many reasons she thought she had a \"computer virus\" that needed cleaning, which led her to years of therapy, starting before the 2010 release of her debut, The ArchAndroid. \"I felt misunderstood,\" she says. \"I was like, ‘Before I self-destruct, before I become a confused person in front of the world, let me seek some help.' I was afraid for anybody to see me not at the top of my game. That obsession was too much for me.\"So she overcompensated, as she puts it, leaving fans to puzzle over the sight and sound of a dark-skinned, androgynously dressed black woman creating Afro-futuristic fantasias as trippy as the Parliament-Funkadelic soundscapes she grew up hearing. She became a pop anomaly, a sometimes incongruous interloper in the universes of her earliest supporters, Big Boi and Puff Daddy, the latter having signed her to a partnership with Bad Boy Records in 2008. The ArchAndroid was a buzzy introduction, and 2013's Electric Lady – certainly the first progged-out concept album in the history of Bad Boy – established her as one of the 21st century's most inventive voices. Years before Frank Ocean, Solange, Beyoncé and SZA pushed arty, alternative R&B to the mainstream, Monáe was already there, bridging the gap between neo-soul and all that was to come, unafraid to fuse rock, funk, hip-hop (when she feels like it, as on her recent single \"Django Jane,\" she's a top-flight rapper), R&B, electronica and campy, drama-kid theatricality. She always ducked questions about her sexuality (\"I only date androids\" was a stock response) but embedded the real answers in her music. \"If you listen to my albums, it's there,\" she says. She cites \"Mushrooms & Roses\" and \"Q.U.E.E.N.,\" two songs that reference a character named Mary as an object of affection. In the 45-minute film accompanying Dirty Computer, \"Mary Apple\" is the name given to female \"dirty computers\" taken captive and stripped of their real names, one of whom is played by Tessa Thompson. (The actress has been rumored to be Monáe's girlfriend, though Monáe won't discuss her dating life.) The original title of \"Q.U.E.E.N.,\" she notes, was \"Q.U.E.E.R.,\" and you can still hear the word on the track's background harmonies. Monáe is the CEO of her own label, a CoverGirl model and a movie star, appearing in the Oscar-winning Moonlight and the Oscar-nominated Hidden Figures, two hits led by black casts. In both films, she tackles black American stories that don't typically get the big-screen treatment. \"Our stories are being erased, basically,\" she says of her attachment to those scripts, which made her \"want to tell my story.\"Monáe does worry that the human behind her masks may not be enough. She has asked aloud, including in therapy, \"What if people don't think I'm as interesting as Cindi Mayweather?\" She'll miss the freedom of being the android. \"I created her, so I got to make her be whatever I wanted her to be. I didn't have to talk about the Janelle Monáe who was in therapy. It's Cindi Mayweather. She is who I aspire to be.\"On Dirty Computer, the only hints of sci-fi are in the title and the storyline of the accompanying film. The lyrics are flesh-and-blood confessions of both physical and emotional insecurity, punctuated with sexual liberation. They're the unfiltered desires of an overthinker letting herself speak without pause, for once. And she wants to help listeners gain the courage to be dirty computers too. \"I want young girls, young boys, nonbinary, gay, straight, queer people who are having a hard time dealing with their sexuality, dealing with feeling ostracized or bullied for just being their unique selves, to know that I see you,\" she says in a tone befitting the \"commander\" patch on her arm. \"This album is for you. Be proud.\"Monáe grew up in a massive, devoutly Baptist family in Kansas City, Kansas, or as she likes to put it, \"I got 50 first cousins!\" Not all of them know details of her romantic life, but they have almost certainly seen her wear sheer pants and share a lollipop with Thompson in the \"Make Me Feel\" video. \"I literally do not have time,\" she says, laughing, \"to hold a town-hall meeting with my big-ass family and be like, ‘Hey, news flash!' \" She worries that when we visit Kansas City tomorrow, they'll bring it up: \"There are people in my life that love me and they have questions, and I guess when I get there, I'll have to answer those questions.\" Over the years, she's heard some members of her family, mostly distant ones, say certain upsetting things. \"A lot of this album,\" she says, \"is a reaction to the sting of what it means to hear people in my family say, ‘All gay people are going to hell.' \"She began questioning the Bible and her family's Baptist faith early on. Now, she says, \"I serve the God of love\" – love, she's determined, is the common factor among all religions, an idea Stevie Wonder expanded on in a Dirty Computer interlude. When we arrive in the flat, industrial Kansas side of Kansas City, her family doesn't actually have any questions – or anything unkind to say, for that matter. There's just a whole lot of love for their homegrown superstar. Janelle Monáe Robinson was born here on December 1st, 1985, to a mom who worked as a janitor and a dad who was in the middle of a 21-year battle with crack addiction. Her parents separated when Monáe was less than a year old, and her mother later married the father of Janelle's younger sister, Kimmy. Monáe's loving warnings about the sheer size of her family ring true as soon as we step into her old neighborhood. On one street, her maternal grandmother owned several homes in a row that housed cousins, aunts, uncles and Monáe herself. A few minutes away is her paternal great-grandmother's pastel-coated house. Monáe spent a significant portion of her time there – it was her main connection to her dad and his family as he went in and out of prison; their relationship was rocky until he got sober 13 years ago. Another short car ride away is her maternal Aunt Glo's home, where we meet her mom. \"She's my favorite slice of pie,\" her Auntie Fats says, referring to Monáe's familial nickname of \"pun'kin.\" Monáe was raised in a working-class community called Quindaro. It started as a settlement established by Native Americans and abolitionists just prior to the Civil War, and became a refuge for black Americans escaping slavery via the Underground Railroad. A few weeks before our visit, vandals painted swastikas and \"Hail Satan\" on a statue of abolitionist John Brown in the neighborhood. It's since been repainted. \"I know nobody in this neighborhood did that,\" her great-grandmother says, shaking her head. \"Outsiders.\" On the Missouri side of the bridge, Kansas City is predominately white, but Monáe's community is overwhelmingly black. \"I would read about where I was from,\" she says, \"and understand who's really disadvantaged coming from these environments. It sucks. It's like that for brown folks.\"It's hard to miss her family's religiosity – they hardly get a sentence out without a mention of God's blessings. At 91, Monáe's great-grandma still monitors the halls at the local vacation Bible school with a switch in hand. During our visit, she sits behind a piano to lead a gospel singalong. Monáe, beside an aunt and a cousin, joins in, belting \"Call Him Up and Tell Him What You Want\" and \"Savior, Do Not Pass Me By.\"Monáe is never more relaxed during our time together than when she's in Kansas City. Her Midwestern drawl comes back as she screams and sings while running into the arms of her cousins, aunts and uncles, many of whom she gets to see only during the holidays or tour stops nearby. At one point, she curls up into her mom's lap while they look at a homemade poster full of sepia-toned childhood pics. \"She was a delightful baby,\" Auntie Fats recalls.Monáe's family members all share different versions of the same story: She was born to be a star, and she made that clear as soon as she gained motor skills. There was that time she got escorted out of church for insisting on singing Michael Jackson's \"Beat It\" in the middle of the service. There were the talent shows for Juneteenth where she covered \"The Miseducation of Lauryn Hill\" three years in a row and won each time. She was the star of the school musicals, except for The Wiz her senior year, when she lost the role of Dorothy because she had to leave the audition early to pick up her mom at work. She's still a bit miffed about not getting that part.Monáe soon passed a bigger audition, for the American Musical and Dramatic Academy, and headed to New York. She studied musical theater and shared a small apartment with a cousin where she didn't even have a bed to herself. When she wasn't in class, she was working. Meanwhile, an old friend was having the college experience Monáe desired, in Atlanta, so she relocated. The rest is well-trod history in the myth-building of Monáe: She was an Afro'd neo-soul singer strumming her guitar on college quads and working at Office Depot. She was fired from that job for using one of the company's computers to respond to a fan's e-mail, an incident that inspired the song \"Lettin' Go.\"That song caught the attention of Big Boi, who put her on Outkast's Idlewild and helped connect her with Sean Combs. \"I'm-a be honest with you,\" her dad says, recalling an invite to one of Monáe's shows in Atlanta, where Combs was supposed to be in the house. \"I was like, ‘Yeah, right.' I didn't think Puff Daddy was coming.\" Skepticism aside, Michael Robinson was proud of the invite. He'd recently gotten sober, and the two were repairing their relationship. He spent much of Janelle's childhood hearing about her immense talents from the more-present members of their family. He was honored that they had come far enough for Monáe to want him to be there for such an important concert. But he still didn't believe Puffy would be there.\"I go down there with my two cousins, and she says, ‘Dad, everyone's gonna know you're not from here. Your jeans are creased.' \" Fashion faux pas aside – he insists he hasn't creased his jeans since – Robinson was in for a pleasant surprise when one of his cousins spotted Combs and Big Boi in the back. It was the beginning of his daughter's new life, and he was just in time to be along for the journey. \"I remember thinking, ‘This is what the big time is like,' \" he muses. \"They had all the cameras, all the lights. It was all about Janelle.\"Wondaland Arts Society's headquarters feels like a utopian synthesis of Monáe's past lives in Kansas City and Manhattan. It sits inconspicuously in the midst of suburban Atlanta and looks like every other neighborhood home, with its two floors and brick exterior. Inside is much more ostentatious, with vintage clocks wallpapering the foyer, pristine white couches in the communal living spaces, and books and records everywhere. It mimics the close-knit, constant accessibility of her childhood in Kansas City, with all its artists popping in and out of the space throughout each day to record new music, rehearse for shows and present the final product to the rest of the collective. At one point, the singer-rapper Jidenna shows up, having recently returned from a trip to Africa – everyone immediately starts teasing him about his newly buff physique.Simultaneously, Chuck Lightning, seemingly the more extroverted half of two-man funk act Deep Cotton, who make their own music as well as work with Monáe, grabs a bowl of quinoa from the kitchen as Monáe doles out decisions on which version of the \"Pynk\" video will be released (they settle on the one without the spoken-word love poem that appears within the song in the film).Monáe recorded most of Dirty Computer here, in a small studio with Havana-inspired decor. Guests and collaborators ranged from Grimes to Brian Wilson, who added harmonies to the title track. The album's liner notes cite Bible verses and a recent Quincy Jones interview alongside Monica Sjöö's The Great Cosmic Mother and Ryan Coogler's Black Panther. But she was particularly close to one inspiration. Monáe was good friends with Prince, who personally blessed the album's glossy camp tone and synthed-out hooks. \"When Prince heard this particular direction, he was like, ‘That's what y'all need to be doing,' \" Lightning says. \"He picked out that sound as what was resonating with him.\" Prince gave highly specific music and equipment recommendations from the era they were drawing on, including Gary Numan, whom he loved. \"The most powerful thing he could do was give us the brushes to paint with,\" Lightning says. Rumors spread that Prince co-wrote the single \"Make Me Feel,\" which features a \"Kiss\"-like guitar riff. \"Prince did not write that song,\" says Monáe, who sorely missed his advice during the production process. \"It was very difficult writing this album without him.\" Prince was the first person to get a physical copy of The ArchAndroid – she presented the CD to him with a flower and the titles written out by hand. \"As we were writing songs, I was like, ‘What would Prince think?' And I could not call him. It's a difficult thing to lose your mentor in the middle of a journey they had been a part of.\"Stevie Wonder was another early fan of Monáe, and a conversation between them – Wonder insisted she record it – appears as an interlude on Dirty Computer. At one point, years ago, her budding friendships with both legends collided: She had to choose between playing with Prince at Madison Square Garden or with Wonder in Los Angeles. Prince encouraged her to pick Stevie. On election night in 2016, Monáe found herself experiencing an unfamiliar emotion. \"For the first time,\" she says, \"I felt scared.\" Overnight, she went from living in a country whose president loved her music and had her perform on the White House lawn to one where it felt like her right to exist was threatened. \"I felt like if I wake up tomorrow,\" she says, \"are people going to feel they have the right to just, like, kill me now?\"Monáe had already been a committed activist. In 2015, with members of Wondaland, she created \"Hell You Talmbout,\" which demands we say the names of black Americans who have been victims of racial violence and police brutality. Before #MeToo and Time's Up, Monáe created an organization, Fem the Future, which stemmed from her frustrations about opportunities for women in the music industry. She was called on to perform at the 2017 Women's March and to speak about Time's Up while introducing Kesha at the Grammys. \"We come in peace, but we mean business,\" she told the cheering crowd. That sums up Monáe's mindset in the Trump era. She hopes not to destroy the oppressors but to change their minds. \"The conversations might not happen with people in the position of power,\" she says, \"but they can happen through a movie, they can happen through a song, they can happen through an album, they can happen through a speech on TV. Most of them will probably turn off their TVs, but . . .\"She's in a New York hotel now, two weeks before the album's release. \"There's some anxiety there, but I feel brave,\" she says, teetering between her typical sternness and a bit of vulnerable shakiness. No tears will be shed today. \"My musical heroes did not make the sacrifices they did for me to live in fear.\" Her activism isn't the focus of Dirty Computer, but it's there, hovering above every note. She ended band rehearsal in Atlanta by asking the musicians to reflect on how American this album is. Monáe's America is the one on the fringes; it accepts the outsiders and the computers with viruses, like the ones she thought she had.She understands the significance of now making her personal life a bigger, louder part of her art. She cites the conversation around one of her films as an example of how she might use her own story to engage with more-conservative listeners. \"When I did Hidden Figures, there were some Republican white men tweeting about it and how they just felt bad. You could feel through their tweets that they were just like, ‘These black women did help us get to space. How could we treat them like that?' \" Meanwhile, she's again anticipating questions from her family back in Kansas. She seems more worried about them than what anyone else has to say. Still, Dirty Computer is meant to be a celebration, and if she loses a few people along the way, Monáe seems OK with that risk.\"Through my experiences, I hope people are seen and heard,\" she says, sitting at a hotel-room desk, dressed up from a day of promo in a puffy black-and-red jacket, matching red pants and terry-cloth hotel slippers. \"I may make some mistakes. I may have to learn on the go, but I'm open to this journey.\" She sighs, voice confident and stare unfaltering. \"I need to go through this. We need to go through this. Together. I'm going to make you empathize with dirty computers all around the world.\"", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1524744000.0, "source": "https://www.rollingstone.com", "summary": ""}