{"url": "https://www.marketwatch.com/story/these-are-the-hottest-fashion-trends-from-the-2017-emmys-red-carpet-2017-09-17", "text": "The Emmys red carpet took a page from “The Handmaid’s Tale.”\n\nWhile television’s brightest stars sashayed in a Technicolor parade on Sunday, red and white - a la the crimson cloaks and snowy bonnets worn by the enslaved women on the Hulu series based on Margaret Atwood’s book - emerged as the night’s biggest winners. (Which was fitting, considering \"The Handmaid's Tale\" won Best Drama, along with Best Actress and Best Supporting Actress in a Drama.) And everything shimmered with sequins and beading.\n\nNicole Kidman was among the best dressed of the night in a red halter Calvin Klein Calvin Klein by Appointment gown with a pleated bust. “Handmaid’s” Yvonne Strahovski also worked the red hot shade in a custom Julien MacDonald silk number, as did Sarah Hyland in a fiery cutout Zac Posen, Heidi Klum in plunging Peter Dundas, and Issa Rae in an asymmetrical Vera Wang. (\"The Handmaid's Tale\" author Margaret Atwood was also notably in red.)\n\n“A red dress is fiery, it’s sexy, it’s a universal power color,” celebrity stylist Robert Verdi told Moneyish. “And it also says ‘resistance’ in my opinion, so it makes a strong statement.”\n\nViola Davis wore Zac Posen. (Frazer Harrison/Getty Images)\n\nThe white haute women included Evan Rachel Wood in a Moschino gown with cropped tuxedo jacket, Priyanka Chopra in long-sleeved Balmain, Sofia Vergara in a strapless figure-hugging Mark Zunino mermaid gown, and “Stranger Things’” adorable Millie Bobby Brown in a ballerina-inspired Calvin Klein gown with full tulle princess skirt.\n\nPriyanka Chopra wore Balmain. (Rich Polk/Getty Images)\n\n“White always emerges when people are desperate for change in our culture,” mused Verdi, “because it’s a blank canvas for new beginnings.”\n\nAnd the summer’s glitter trend was on full display, with sequins and beads dusted across almost everyone, including Lea Michele’s belted purple Elie Saab gown, Tracee Ellis Ross’s silver Chanel disco ball, Leslie Jones’ black sparkling Christian Siriano, and Ellie Kemper’s midnight blue capsleeve Jenny Packham gown.\n\n“Glitter is so hot right now, and it was sparkle, sparkle, sparkle everywhere, and lots of sequin sand silver,” Tom Fitzgerald, co-creator of the fashion and pop culture blog TomandLorenzo.com with Lorenzo Marquez, told Moneyish.\n\nOther standouts included Viola Davis in juicy orange Zac Posen, Jane Fonda in long-sleeved hot pink Brandon Maxwell (with long, sleek ponytail to match), and both Tessa Thompson and Zoe Kravitz chasing the rainbow; the former in a pleated metallic Rosie Assoulin, and the latter in a feathery cascading Dior.\n\nTessa Thompson wore Rosie Assoui. (Rich Polk/Getty Images)\n\n“There were a lot of movie stars on the red carpet this year, so there was a heightened sense of glamour. If you know Nicole Kidman is going to be there, you’re gonna bring your A game,” said Fitzgerald. “And we are at peak TV with all of the incredible programming now, so it’s become more much competitive, and the Emmys are closer in tone to the Oscars than it used to be.”\n\nWhile the Emmys ratings have dipped the past couple of years, more than 11 million people tuned into last year’s awards show - and the glamorous gowns worn by the nominees and presenters on any awards show red carpet influence what the $15.6 billion dress industry will put on the rack next spring. Remember when Amal Clooney wore white opera gloves to the 2015 Golden Globes? Long gloves appeared on the fall/winter runways of Marc Jacobs and Prada later that year.\n\nMillie Bobby Brown wore Calvin Klein. (Frazer Harrison/Getty Images)\n\n“You’ll see silhouettes shift now, thanks to the classic and demure 1950s and 60s looks on Nicole Kidman and Millie Bobby Brown, that kind of princess-style dress,” said Verdi. “You’ll see these popular colors (red, white, silver, the pops of orange and green) trickle down into ready-to-wear fashion. And you’ll see the fabrics - like the sparkle and lace we saw on the carpet - be used to embellish affordable versions of these gowns.”\n\nAnd you may even be able to snap up at least one of Sunday’s red carpet looks yourself. While many movie and TV stories are loaned their designer gowns for these award shows - or are sometimes paid between $100,000 and $250,000 to wear a label for all of the free publicity it will bring the brand - singer and presenter Rachel Bloom revealed to E! that she had to pay for her $3,500 Gucci gown out of pocket.\n\n“A lot of fashion houses are reluctant to lend clothes that aren’t in the sample sizes of 0 and 2, so it’s getting harder and harder for me to find clothes without buying them,” she said. “That’s the whole problem with the fashion industry: My body size is literally normal and healthy but when you put me next to a model I look obese.”\n\nVerdi noted this is an issue because the competition for these couture gowns is fierce.\n\n“There’s only a few great dresses in any given collection every season, and every stylist is trying to pull them for the celebrities that they are dressing,” he said. “So when the fashion houses are assessing who these should go to, they want it to go to a nominee over a presenter; to a global star versus a national star; to someone younger over someone older - those are what the ‘rules’ would be.”\n\nAnd, often, to someone slimmer over someone curvier, as stars like Melissa McCarthy and Leslie Jones (both nominated Sunday night) have been public about their struggles to find designers to dress them.\n\nBut Bloom noted that she’s fortunate to be in a financial position where she can buy her dress. And she might get some money back for the gently-used gown, anyway.\n\n“I can always resell it,” she said. “I do have an account on [the resell/consignment site] The RealReal. My writing partner sells all of her clothes there. Take a look on The Real Real for this dress tomorrow.”", "images": ["https://www.marketwatch.com/Multimedia/2018/10/30/Photos/ZH/MW-GU701_f0fb14_20181030155116_ZH.jpg", "https://www.marketwatch.com/Multimedia/2018/10/30/Photos/NS/MW-GU703_29507a_20181030155121_NS.jpg", "https://www.marketwatch.com/Multimedia/2018/10/30/Photos/NS/MW-GU702_3b797a_20181030155119_NS.jpg", "https://sts3.wsj.net/bucket-a/maggie/static/images/google-play.png", "https://www.marketwatch.com/Multimedia/2018/10/30/Photos/NS/MW-GU704_7c6355_20181030155124_NS.jpg", "https://s.wsj.net/public/resources/images/MW-GU701_f0fb14_ZG_20181030155116.jpg", "https://www.marketwatch.com/Multimedia/2018/10/30/Photos/NS/MW-GU705_e04a6c_20181030155127_NS.jpg", "https://sts3.wsj.net/bucket-a/maggie/static/images/app-store.svg", "https://s.marketwatch.com/public/resources/MWimages/MW-IE699_stimul_ZU_20200417141513.jpg"], "top_img": "https://s.wsj.net/public/resources/images/MW-GU701_f0fb14_ZG_20181030155116.jpg", "keywords": [], "authors": ["Nicole Lyn Pesce"], "canonical_link": "http://www.marketwatch.com/story/these-are-the-hottest-fashion-trends-from-the-2017-emmys-red-carpet-2017-09-17", "title": "These are the hottest fashion trends from the 2017 Emmys red carpet", "meta_data": {"og": {"title": "These are the hottest fashion trends from the 2017 Emmys red carpet", "site_name": "MarketWatch", "type": "article", "url": "https://www.marketwatch.com/story/these-are-the-hottest-fashion-trends-from-the-2017-emmys-red-carpet-2017-09-17", "description": "Thanks to the Emmys, every prom dress and formal gown is gonna be red, white or covered in sparkles next spring.", "image": {"identifier": "https://s.wsj.net/public/resources/images/MW-GU701_f0fb14_ZG_20181030155116.jpg", "width": 1320, "height": 742}}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1", "page.site": "marketwatch", "twitter": {"site": {"identifier": "@marketwatch", "id": 624413}, "domain": "marketwatch.com", "description": "Thanks to the Emmys, every prom dress and formal gown is gonna be red, white or covered in sparkles next spring.", "image": {"identifier": "https://s.wsj.net/public/resources/images/MW-GU701_f0fb14_ZG_20181030155116.jpg", "width": 1320, "height": 742}, "card": "summary_large_image"}, "article.content_group": "marketwatch", "article": {"publisher": "https://www.facebook.com/marketwatch", "opinion": "false"}, "fb": {"app_id": 283204329838}, "theme-color": "#2e2e2f", "referrer": "no-referrer-when-downgrade", "robots": "noarchive,noodp", "googlebot-news": "index", "article.doctype": 88, "cXenseParse": {"wsj-doctype": 88, "wsj-product": "Moneyish Blogs", "wsj-column": "Moneyish"}, "article.id": "5293dec6-4491-4aed-b13c-f6662efef9da", "apple-itunes-app": "app-id=336693422,app-argument=mwatch://article?id=5293dec6-4491-4aed-b13c-f6662efef9da", "article.section": "Personal Finance", "article.column": "Moneyish", "author": "Nicole Lyn Pesce", "description": "Thanks to the Emmys, every prom dress and formal gown is gonna be red, white or covered in sparkles next spring.", "article.template": "full", "keywords": "article_normal", "news_keywords": "article_normal", "parsely-link": "https://www.marketwatch.com/story/these-are-the-hottest-fashion-trends-from-the-2017-emmys-red-carpet-2017-09-17", "parsely-type": "post", "parsely-title": "These are the hottest fashion trends from the 2017 Emmys red carpet", "parsely-section": "Personal Finance", "parsely-post-id": "5293dec6-4491-4aed-b13c-f6662efef9da", "parsely-tags": "PageType: Article, Template: full, ArticleId: 5293dec6-4491-4aed-b13c-f6662efef9da, Column: Moneyish, DocType: 88, Subsection: Personal Finance", "parsely-pub-date": "2017-09-17T23:04:00-04:00", "parsely-author": "Nicole Lyn Pesce"}, "movies": [], "publish_date": null, "source": "https://www.marketwatch.com", "summary": ""}