{"url": "http://www.state.gov/r/pa/ei/bgn/5375.htm#econ", "text": "More information about the United Kingdom is available on the United Kingdom Page and from other Department of State publications and other sources listed at the end of this fact sheet.\n\nU.S.-UNITED KINGDOM RELATIONS\n\nThe United States has no closer partner than the United Kingdom. Following the end of the American Revolution in 1783, the United Kingdom officially recognized American independence, and in 1785, our two countries established diplomatic relations. Other than a brief break in relations during the War of 1812, the United States and the United Kingdom have remained durable partners and Allies. Our partnership is the foundation of our mutual prosperity and security.\n\nThe strong relationship between the United States and the United Kingdom reflects our common democratic ideals and values, which are reinforced through cooperation on political, security, and economic issues. Along with other European Allies, the United States and the United Kingdom work closely together to combat terrorism, stop the proliferation of weapons of mass destruction, and work to solve regional issues, such as ending conflicts in the Middle East. Following the United Kingdom’s January 31, 2020 departure from the European Union, the United States continues to be a strong partner to the United Kingdom and looks forward to negotiating an ambitious U.S.-U.K. free trade agreement.\n\nThe United States supports the peace process and devolved political institutions in Northern Ireland and encourages the implementation of the U.S.-brokered 1998 Belfast Agreement, also known as the Good Friday Agreement.\n\nU.S. Assistance to the United Kingdom\n\nThe International Fund for Ireland (IFI), created in 1986, provides funding for projects to generate cross-community engagement and economic opportunity in Northern Ireland and the border counties of Ireland. Since the IFI’s establishment, the United States and EU have contributed the majority of funds, with the United States allocating more than $540 million.\n\nBilateral Economic Relations\n\nMutual trade and investment are at the heart of our prosperity, and our commitment to free market values enables our economies to thrive. The United States and the United Kingdom are the world’s first and fifth largest economies in the world. We currently trade over $260 billion worth of goods and services each year. We are each other’s number one source of foreign direct investment and two-way direct investment totals over $1 trillion.\n\nEvery U.S. state has jobs that are connected to an investment by a U.K. company. More than 1.2 million Americans work for U.K. companies in the United States, and over 1.5 million Britons are directly employed by U.S. firms. The top U.S. exports to the United Kingdom include aircraft, machinery, financial and travel services, and agricultural products, such as wine and beer.\n\nThe United Kingdom’s Membership in International Organizations\n\nAlong with France, both the United States and the United Kingdom are among the five permanent members of the UN Security Council (P5) and are founding members of NATO. In addition, the United Kingdom and the United States belong to the Organization for Security and Cooperation in Europe (OSCE), G-20, G-7, Organization for Economic Cooperation and Development (OECD), International Monetary Fund (IMF), World Bank, and World Trade Organization. The United Kingdom also is an observer to the Organization of American States.\n\nBilateral Representation\n\nThe U.S. Ambassador to the United Kingdom is Robert Wood Johnson; other principal embassy officials are listed in the Department’s Key Officers List.\n\nThe United Kingdom maintains an embassy in the United States at 3100 Massachusetts Ave. NW, Washington, DC 20008; tel. 202-588-6500.\n\nMore information about the United Kingdom is available from the Department of State and other sources, some of which are listed here:\n\nCIA World Factbook United Kingdom Page\n\nU.S. Embassy\n\nHistory of U.S. Relations With the United Kingdom\n\nU.S. Census Bureau Foreign Trade Statistics\n\nExport.gov International Offices Page\n\nTravel Information", "images": ["https://www.state.gov/wp-content/uploads/2019/12/dos_seal.png"], "top_img": "https://www.state.gov/wp-content/uploads/2019/12/dos_seal.png", "keywords": [], "authors": [], "canonical_link": "https://www.state.gov/u-s-relations-with-united-kingdom/", "title": "U.S. Relations With United Kingdom", "meta_data": {"viewport": "width=device-width, initial-scale=1", "msapplication-tap-highlight": "no", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "U.S. Relations With United Kingdom - United States Department of State", "description": "More information about the United Kingdom is available on the United Kingdom Page and from other Department of State publications and other sources listed at the end of this fact sheet. U.S.-UNITED KINGDOM RELATIONS The United States has no closer partner than the United Kingdom.  Following the end of the American Revolution in 1783, the …", "url": "https://www.state.gov/u-s-relations-with-united-kingdom/", "site_name": "United States Department of State", "image": {"identifier": "https://www.state.gov/wp-content/uploads/2019/12/dos_seal.png", "secure_url": "https://www.state.gov/wp-content/uploads/2019/12/dos_seal.png", "width": 1200, "height": 630}}, "twitter": {"card": "summary_large_image", "description": "More information about the United Kingdom is available on the United Kingdom Page and from other Department of State publications and other sources listed at the end of this fact sheet. U.S.-UNITED KINGDOM RELATIONS The United States has no closer partner than the United Kingdom.  Following the end of the American Revolution in 1783, the […]", "title": "U.S. Relations With United Kingdom - United States Department of State", "image": "https://www.state.gov/wp-content/uploads/2019/12/dos_seal.png"}, "generator": "WordPress 5.4", "msapplication-TileImage": "https://www.state.gov/wp-content/uploads/2019/02/cropped-Seal-of-the-U.S.-Department-of-State-270x270.png"}, "movies": [], "publish_date": null, "source": "http://www.state.gov", "summary": ""}