{"url": "https://www.hollywoodreporter.com/features/billy-bush-breaks-his-silence-trump-access-hollywood-tape-nbc-a-comeback-plan-1005744", "text": "Seven months after the infamous \"grab them by the pussy\" recording got Bush fired (and nearly toppled Trump's White House run), the former 'Today' host goes public with what happened on that bus, the people who knew about the tape, how he broke the \"awful\" news to his daughters and his bold comeback move: \"I plan to return to the job that I love.\"\n\nBilly Bush was on the tarmac at New York's JFK International Airport waiting to take off for Los Angeles when his world imploded. It was Friday, Oct. 7, 2016, and an 11-year-old tape of a lewd conversation with Donald Trump — in which the then-Apprentice star could be heard bragging about sexually assaulting women with a chortling Bush egging him on — was leaked to The Washington Post. The tape was supposed to end Trump's improbable presidential run. Instead, it torpedoed Bush's job at NBC's Today, turning the former Access Hollywood host into a late-night punch line and media pariah. \"I could not put two thoughts together,\" Bush, 45, tells The Hollywood Reporter in an extended interview, his first since the scandal erupted more than seven months ago. \"Things were happening way too fast.\"\n\nCaptive on that airplane for nearly six Wi-Fi-enabled hours, Bush read news reports in disbelief as a real-time train wreck engulfed his career. By the time he arrived in Los Angeles, a horde of paparazzi had materialized at LAX and, later, at his L.A. home, where they remained for more than a week. Ducking out only through a back path, Bush spent the remainder of that October weekend desperately trying to save his job, then just a few months old and already off to a shaky start after a much-criticized interview with embattled Olympic swimmer Ryan Lochte. Though Today long had been among Bush's ambitions, his hiring as the co-host of the 9 a.m. hour was somewhat controversial given his lack of hard-news experience and a snarky red-carpet presence. Initially, NBC News signaled Bush would return that Monday to apologize on-air. \"I would have welcomed addressing the audience,\" he says pointedly.\n\nThat opportunity never came. Though Bush issued an apology statement, and Trump dismissed his own remarks about grabbing women \"by the pussy\" as merely \"locker-room banter,\" many enraged viewers vowed never to watch Today again. That rancor could be felt internally, too, with several NBC News staffers, many of them women, incredulous that Bush would be allowed to return so soon — or at all. By Monday, Bush was suspended. Seven days later, on Oct. 17, he was out with a multimillion-dollar severance package and a nondisclosure agreement that prevents him from going into detail about his exit from NBC News. He still has no idea who leaked the tape.\n\nWhere has Bush been since then? Engaged in a lot of soul searching, a process that included time walking on fiery coals with spiritual guru Tony Robbins and a stint at a Napa Valley healing retreat. He took up yoga and meditation, developed a boxing routine and read books like 10% Happier, written by ABC News anchor and buddy Dan Harris. Bush, the nephew of President George H.W. Bush, also spent more time than he had in years with his family, including daughters Lillie, 12, Mary, 16, and Josie, 18. \"It was fun to have his undivided attention,\" says his older brother, Jonathan. \"There was no rushing off to do this or that.\" He's also stayed in contact with his former Today colleagues; he recently saw Hoda Kotb and her baby and was invited to lunch with Matt Lauer.\n\nWhat Bush refrained from doing is watching the infamous three-minute tape from 2005. While he long has been aware of its existence and says \"plenty of people\" at NBC knew about it, too, he claims he has seen it only three times: once, three days before the rest of the world did, and then twice more in preparation for this interview. Each time it left him \"totally and completely gutted,\" he says, his voice shaky and eyes watery. \"Looking back upon what was said on that bus, I wish I had changed the topic. [Trump] liked TV and competition. I could've said, 'Can you believe the ratings on whatever?' But I didn't have the strength of character to do it.\"\n\nOn the morning of May 17, Bush is in New York, sitting in the living room of his parents' Upper East Side apartment, which he called home during his brief tenure at Today, when his family had not yet relocated from Los Angeles. Lining a built-in bookcase are family photos: his daughters, a picture from his 1998 wedding to wife Sydney, and one of Bush and his brother as children at a cousin's wedding (he won't say which cousin, which leaves a visitor to guess whether it was a former president or a former presidential contender).\n\nOver the next hour and a half, Bush will recount his descent from successful TV host to the bizarre casualty of a presidential campaign scandal. His lawyer and publicist are present, but he is relaxed and open about his failings and fears. He becomes emotional as he talks about disappointing his family, his friends and himself, and animated when he recounts the spiritual awakening that led him to become \"a better man,\" he says. \"I was kind of bopping along, and I don't know if it was God or what that said, 'OK, you've developed. You're a pretty good guy. Let's see how you handle this.' And ka-boom!\" He puts his hands to his face. \"It all comes apart.\"\n\nThose close to him are quick to suggest Bush got a raw deal. After all, the other guy on the tape is now in the White House. \"He got lumped up with Donald Trump, and his last name is Bush, and all of a sudden he got bushwhacked,\" says pal Howard Owens, a TV producer and co-CEO of Propagate Content. \"And not to say that he didn't think what came out was terrible and certainly would have been something he would have had to deal with to regain the respect of his audience, but to never get that chance and to go down in a tidal wave of political anger is a tough thing.\"\n\nThough Bush never utters a disparaging word about his former bosses, Jonathan allows that his brother was perplexed by the way his exit was handled by NBC News executives. \"NBC News and [their] crocodile outrage: 'We are so disappointed with Billy,'\" says Jonathan. \"I think Billy was angry, notwithstanding his own devils to reckon with. You build an identity and reputation over 15 years, and you lose it over 15 hours. And you don't get to be part of it. You don't get to say, 'Hey, wait a minute.'\"\n\nBush seems to have come to a place of acceptance, however. \"I am not grateful for the moment,\" he says. \"But I'm grateful for what I've gotten out of it. I'm grateful that it hit me all the way to my core.\" And now, the Manhattan-born broadcaster is ready to get back to work. With Propagate's Owens and co-CEO Ben Silverman, Bush has been developing a series designed to show audiences a deeper and more empathetic side to him. The trio are light on details but say that pop culture, sports and interviews likely will play a role. And though the project won't be the right fit for A+E Networks CEO Nancy Dubuc's portfolio of channels, she suggests she'd have no hesitation about putting Bush back on the air.\n\n\"I don't think anyone deserves to be sidelined in a way that's vengeful, especially if they're truly remorseful,\" says Dubuc, one of the industry's highest-ranking female executives and a personal friend of Bush's. \"That action, while not right and a deep-seated reflection of some of the things that are not only wrong in our industry but in our country, doesn't mean that he's a bad person and doesn't mean that he doesn’t deserve to be forgiven.\"\n\nAn edited transcript of Bush's conversation with THR follows.\n\n•••\n\nYou have three daughters. How did you explain all of this to them?\n\nMy [then] 15-year-old, Mary, called me from boarding school, and she was in tears: \"Dad, Dad, Dad,\" and I said, \"Everything is going to be fine, Mary. Everything's going to be OK.\" It's just instinctively what you say to your daughter. And she said, \"No, why were you laughing at the things that he was saying on that bus, Dad? They weren't funny.\" It hit really hard, and I stopped for a second, and I said, \"I have no answer for that that's any good. I am really sorry. That was Dad in a bad moment a long time ago. You know me. I am really sorry that you had to hear and see that. I love you.\" She needed to hear that, and I certainly needed to tell her that.\n\nDid you have that conversation with the other two as well?\n\nYes. The little one is 12, and she has made the decision not to ever watch [the Trump tape]. And my 18-year-old is more of a fighter. She was like, \"All right, who do I need to take out?\" And my wife, Sydney, knows the environment and the atmosphere I was in at the time, and she knows very well the person she married. She has been very supportive from the very beginning.\n\nHow would you describe the past seven and a half months? What have you been doing?\n\nIt's been a roller coaster. If you start from the day everything happened, Friday, Oct. 7, it was just instant shock. Things were happening way too fast, and a media circus developed. I've never been the type that the paparazzi would be interested in. So that early part was just chaos. But then things progressed, and when you have a big, traumatic event, you go through stages, and it led to acceptance and understanding. And then I found myself in a place of soul searching. And I developed a commitment to become a better, fuller man.\n\nWhen that tape was first leaked, how did you think the situation was going to play out?\n\nI thought that we would work through it and we would address people. I put together an apology right away, the one you saw; I told people that I was ashamed and embarrassed. And I was. So in the beginning, I thought, \"OK, we'll go and own up to this moment.\" Then I got home, and it started to become apparent that [I] would not be returning [to Today]. It hurt a lot, and I fell apart. But I had to put aside those feelings and get through legal things. I never had a legal team; I had never had a publicist before.\n\nWhat would you have said if NBC had given you the opportunity to appear on Today that Monday?\n\nI would have said, \"I am deeply embarrassed. I sit before you every morning, and I have on a different show [Access Hollywood Live] many mornings, and I hope you know the person you're looking at and have developed an opinion about is [the real me]. You aren't wrong about that. I am ashamed. Going forward, you can be sure that I will not participate in anything like that. And I will keep my eyes out and do what I can to stop it from happening.\"\n\nHow frustrating was it for you to not be able to tell your own story when so many other people were?\n\nI'd like to say I didn't read any of the items, but that's not the case. I did. Many of them were very hurtful. To be the butt of monologue jokes — that's all hurtful. Having been in the job as long as I have, I developed a fairly thick skin. My skin is definitely thicker now, and my heart is a little softer underneath it. But I will say I think everybody should have the opportunity to apologize.\n\nYou got fired, and the other guy on that tape became president. How does that make you feel?\n\nI will admit the irony is glaring. [Trump] has his process for his participation [in the tape], and I have mine. I had to turn this into a positive. Robin Roberts' mother has this quote, \"Make your mess your message.\" And so I have that opportunity. I've come out of this with a deeper understanding of how women can connect to the feeling of having to fight extra hard for an even playing field. The ground isn't even. Maybe it's improving, but still it isn't even. When a woman watches that tape — and this is what really hit me — they may be asking themselves, \"Is that what happens when I walk out of a room? When I walk out of a meeting, is that what they're saying about me? Are they sizing me up?\" I can’t live with that. If a moment like that arose again, I would shut it down quickly. I am in the women-raising business, exclusively. I have three daughters — Mary, Lillie, Josie — and I care very much about the world and the people they encounter.\n\nTake us back to your days at Access Hollywood when this happened. How important was Trump to the show?\n\nIt was 2005, the second season of The Apprentice. The first season ended with 44 million viewers watching. It was a bona fide television phenomenon. So he was the biggest star, not just on the network with which Access Hollywood is affiliated but on TV, period. And so I spent a lot of time with Trump. He was my main assignment. He was the core of my job for a period of time there, because if we could get him three times a week in exclusive-type situations, he was always going to say something that was headline-worthy. And Access Hollywood was certainly interested in that. So that was my job, and I did it well. I got access to Trump. And in my job, there's a lot of downtime, and there are off-camera moments where you have a short period of time to, in a chameleonlike way, connect with people. If it's Martha Stewart, I would tell her about the new organic garden that I just started growing in my backyard.\n\nAnd with Trump?\n\nWith Donald, there wasn't much interaction. He sort of talks and performs, and everybody reacts. And the topics were usually golf, gossip or women. And boy, do I wish this was a golf day. But I always had a nervous energy through these situations because he also decided a lot of times from day to day, moment to moment, who he liked, who was in and who was out, and my job was to remain in. I needed to be in, or maybe I'd be out. So that was the Trump environment. Looking back on what was said on that bus, I wish I had changed the topic. I wish I had said: \"Does anyone want water?\" or \"It looks like it's gonna rain.\" He liked TV and competition. I could've said, \"Can you believe the ratings on whatever?\" I didn't have the strength of character to do it.\n\nHad you heard him speak like that about women before?\n\nI don't recall anything to that degree. But he's a provocateur. Shocking statements flow like wine from him. And he likes to captivate an audience.\n\nDid Trump know he was being recorded?\n\nI would assume not. I've done many interviews with him, and he always knew when the camera was on and when the camera was off because [he] changed. He was very aware of the camera.\n\nTrump chalked it up to \"locker-room banter.\" Is that a fair characterization?\n\nNo. I'm in a lot of locker rooms, I am an athlete, and no, that is not the type of conversation that goes on or that I've participated in.\n\nSo is that seriously how Trump approaches women?\n\nI felt that, in that moment, he was being typically Donald, which is performing and shocking. Almost like Andrew Dice Clay, the stand-up comedian: Does he really do the things that he's saying or is that his act? And in Donald's case, I equated it that way. When he said what he said, I'd like to think if I had thought for a minute that there was a grown man detailing his sexual assault strategy to me, I'd have called the FBI.\n\nMuch like you, Trump released a statement in which he said, \"Anyone who knows me knows that those words don't reflect who I am.\" Is that true?\n\nI don't know who he is. We don't have a personal relationship and never have.\n\nDid you hear from Trump during or after this all went down?\n\nI did not. I haven't spoken to Donald since before he announced he was running for president.\n\nHow was the tape brought to your attention? There were some reports that you were discussing it in August when you were in Rio de Janeiro covering the Olympics.\n\nI never shared knowledge of the tape with anyone who didn't already know of its existence. And that was plenty of people.\n\nWhen did you first watch it?\n\nI heard it for the first time seven and a half months ago, three days before the rest of the world heard it. I was shocked and alarmed and totally and completely gutted. It was awful. And my participation was awful, too. I remember that guy, he was almost sycophantic. It was my first year as co-host of Access Hollywood, and I was an insecure person, a bit of a pleaser, wanting celebrities to like me and fit in. There is an expression, \"Meet them where they are for each person.\" For Ben Affleck, it's Boston sports. But I went way too far in my desire to keep this No. 1 star happy.\n\nDid you know it was going out to the world?\n\nI did not know. I just knew of the existence of the tape. I mean, I'd known about the existence of the tape for 11 years. I remember the day.\n\nDid you think that the tape should come out?\n\nI [thought] it would certainly be interesting for people to know because I think a lot of people were making up their minds about [Trump]. So, yes, I understand that people would want to know about it. You never thought to go to your NBC bosses and say, \"Hey, there's a tape you should listen to here.\" They did that on their own. I didn't need to. Enough people knew.\n\nYou clearly are remorseful. Do you think Trump regrets it?\n\nI don't know. I don't know.\n\nHow is the man we see in the White House the same or different from the man you knew?\n\nI don't know what stark revelations that he's had. I have to imagine he's come across some pretty jarring information and realities about the job. I would assume, but I don't know. He has confidence in abundance, that's for sure.\n\nDid you vote for him?\n\nYou're asking a journalist the way he voted? I've never made politics and prior votes public knowledge. I'm a registered independent, I'll tell you that.\n\nWould the recovery from the scandal have been easier for you if Trump had lost?\n\nI don't know. I mean, the tape would have worked. But I'm out of the coulda-shoulda-woulda game; beyond that I wish I had changed the topic on the bus.\n\nWho reached out to you after all of this? Anyone from Today?\n\nA lot of people. From the Today show, Tamron [Hall, his then-co-host on the 9 a.m. hour], Hoda [Kotb] and Kathie Lee [Gifford], Matt [Lauer], Savannah [Guthrie], Al Roker. Everyone from Access Hollywood. I got a wonderful handwritten letter from Suzanne Somers. I got a great letter from Cindy Crawford. Kate Walsh and Julie Bowen reached out. They were all supportive — \"We know the real you.\"\n\nDid anyone reach out to express their displeasure?\n\nNo … but I did have some frank conversations with people who said, \"You have to understand the moment and that it was terrible and why people reacted.\" My wife said that to me. She said: \"It's not a good moment. You know that?\" I said, \"I know.\" And I'd only listened to [the tape] once at that time. I've listened to it three times total in my life.\n\nHave you reached out to Nancy O'Dell, your co-host on Access at the time and about whom the lewd comments were focused?\n\nI recently sent her a communication, yeah. I need to keep that between me and Nancy. [Bush declined to say whether O'Dell responded.]\n\nWhat did your soul-searching process entail? Your friends mentioned a retreat.\n\nThis was my most powerful thing I did. Over the holidays, I said, \"I'm just depressed, bloated and miserable. I need to get up and get better.\" So it was my brother's recommendation to go through The Hoffman Process in Napa, California. It's not glamorous. It was seven days — no phones, no communication. And it's so overpowering and so draining that you have to sign an agreement that you'll take two days on your own by yourself before you go back to family or friends. For 13 hours a day, it's a study on your life and your negative patterns. At one point, you're on your knees with a baseball bat and a pillow in front of you, and you are literally bashing these negative patterns that you've identified in your life. For me, one was judginess. I look back three years ago, doing Access Hollywood Live, and some story would come up, and I'd be like, \"Oh, these people, these celebrities, how can they not ba-ba-ba-ba whatever.\" So that became the moment of real awakening, and it went on from there. I've done everything.\n\nWhat else?\n\nI spent time with Tony Robbins. I attended his seminar. There was a powerful moment with Tony in front of 9,000 people at the Galen Center [in L.A.]. He walked to the end of the stage, and he pointed at me in the middle of his thing, and he said, \"One moment in your life does not define who you are.\" And the camera hit me, and these people started applauding — it was a little overwhelming but really empowering. Later that night, we walked on fire together: 12 feet over 2,200-degree coals. And I've done a lot of reading. I'm reading a book now called The Power of Now, by Eckhart Tolle. I've gotten into a lot of meditation and yoga. Mindfulness meditation is a powerful thing.\n\nYou've spent the past seven and a half months on the sidelines. Are you ready to come back?\n\nIn the beginning, your instinct is, \"Hey, I need to get back, the train is leaving. I need to …\" But that would not have been a good idea. There's a process that needs to take place because you just can't come back; it has to have changed you in some way. But I plan to return to the job that I love, which is television, communicating, interviewing people. I have changed in a way that I think will make me better at my job. I believe there will be more people like me in crisis. And with social media, a flame becomes a bonfire quickly. So I will be picking up my pen and writing them and calling them on the phone, and I will pursue these interviews and these moments with these people. And through what I've learned and where I've been, I will tell them, \"You have empathetic ears in me.\"\n\nAre those celebrities?\n\nNot just celebrities. One thing I learned at The Hoffman Process is that I've always relied on my charm and my quick wit and all that, but I've kept my depth in the shadows. And I was heading in that direction in my latest phase of my career [at Today], and I'm going to return to that place because there's a lot of wisdom to learn from a lot of people. There are a lot of interviews I'd like to conduct, and I'm committed to that. I'm not just going to ride around in a rickshaw through the streets of New York picking up strangers and having funny moments with them. There must be more depth to what I do. I have something in development with Howard and Ben that takes what people know of me to a smarter level and, with the perspective gained in the last seven months, a drive to pursue deeper, more pivotal interviews.\n\nYou're a big sports fan. Is that a world that's appealing?\n\nWell, [they say] go with what you know. … I always thought I would love to be a golf announcer, but I'm too excitable. I don't whisper well.\n\nLet's say Trump sees this interview and he calls you. What would you say to him?\n\nI don't know. I guess if the president of the United States calls, you take the call. I would listen and say thank you.\n\nWould you ask if he was remorseful about the situation?\n\nConduct a little private interview? No. I'd just say thanks and move on. There is nothing I need from him.\n\nYou realize that you interviewing him would probably be the highest-rated interview he's ever done?\n\nI don't think I'd interview Trump. It would be a spectacle. In television, we love a spectacle, but I've come too far and learned too much. There are others that I'd rather interview, like Emmanuel Macron of France. What a fascinating story he is: a third-party dark-horse candidate who comes in — and might that be a foreshadowing of what happens in America? There's more wisdom to extract from Oprah [Winfrey], too. It would be fascinating to talk about picking yourself up [after trauma] because there are two types of people in the world: those who have faced something traumatic and those who will. It is inevitable. So I'd talk about getting up, and who knows where that goes? Someday I might address groups and other people about it. Important to it all is owning and accepting your part of it. And I completely have owned and accepted my part in all of this. But I'm not a victim. There are people who are going through things far worse than me.\n\nDo you watch the Today show now?\n\nI've been watching very little TV in the morning because I get up and meditate, and then I do yoga. And I've been doing some boxing now, too, and it's interesting; it's 75 percent women in the gym. But I love it. I'm active and moving.\n\nSome of your friends suggest your last name has made all of this more complicated. Do you agree with that?\n\nI don't think so. This situation happened because I participated in a terrible moment and it became public. It doesn't matter what your name is. Anyone who is participating in that moment is going to get it. In that way, I deserved it. Judgment day arrived all of a sudden and very quickly, and it is my own personal hell that judgment day was solely based upon a bad moment 12 years ago and not the complete evolution of the man. But that's my own private cross to bear and my own issue to work through. It does not in any way excuse the moment on that tape and the way people reacted because I completely understand it.\n\nAnd it all was exposed while you were on a plane. That must have felt like the longest flight you've ever been on.\n\nI kind of wanted it to be longer. (Laughs.)\n\n•••\n\nBILLY'S SPIRITUAL RETREAT: THE HOFFMAN PROCESS\n\nHow Bush used group therapy to stop feeling \"bloated and miserable\" after his NBC firing.\n\nBilly Bush first heard about The Hoffman Process from his older brother, Jonathan, who had participated in a retreat about 10 years ago when he was splitting with his wife. \"It's standard protocol for insecure, divorced men,\" laughs Jonathan. But Billy went for a different reason in January, when he admits to feeling \"depressed, bloated and miserable\" after his NBC firing.\n\nSo, what is The Hoffman Process? The self-help regimen was launched in 1967 by Bob Hoffman, a tailor from Oakland, Calif., who had no formal medical training but became a spiritual guru of sorts after he developed a theory dubbed \"Negative Love Syndrome.\" It posits that many people are unable to form healthy and lasting relationships due to negative behaviors learned in childhood and through trauma. Today, the nonprofit Hoffman Institute holds weeklong residential retreats on modest grounds in St. Helena, Calif., and Chester, Conn. (participants pay about $5,000 for the week and are anonymous; Bush says his group was asked to use only childhood nicknames, though he was recognized). Group therapy is a large component of the retreats, which aid participants in becoming \"conscious of and disconnected from negative patterns of thought and behaviors on an emotional, intellectual, physical and spiritual level,\" according to the institute's website. The Process has a handful of celebrity fans, including Moonlight's Naomie Harris and Toms founder Blake Mycoskie. \"The Hoffman Process was the beginning of real enlightenment,\" says Bush. \"I wondered, 'Were my negative patterns what led to [the Trump tape]?' Then I think, 'Maybe not, but do I have them? And while we're here, let's get into that because you get [those patterns] from one or both of your parents, and I don't want to pass it on to my girls.'\"\n\nThis story appears in the May 24 issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe.", "images": ["https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2017/05/thr_billy_bush_hr_bb_shot3_02190.jpg", "https://cdn1.thr.com/sites/default/files/2017/05/thr_billy_bush_hr_bb_shot3_02190.jpg"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/05/thr_billy_bush_hr_bb_shot3_02190.jpg", "keywords": [], "authors": ["Lacey Rose Marisa Guthrie"], "canonical_link": "https://www.hollywoodreporter.com/features/billy-bush-breaks-his-silence-trump-access-hollywood-tape-nbc-a-comeback-plan-1005744", "title": "Billy Bush Breaks His Silence on Trump, the 'Access Hollywood' Tape, NBC and a Comeback Plan (Exclusive)", "meta_data": {"viewport": "width=device-width", "description": "Seven months after the infamous \"grab them by the pussy\" recording got Bush fired (and nearly toppled Trump's White House run), the former 'Today' host goes public with what happened on that bus, the people who knew about the tape, how he broke the \"awful\" news to his daughters and his bold comeback move: \"I plan to return to the job that I love.\"", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/features/billy-bush-breaks-his-silence-trump-access-hollywood-tape-nbc-a-comeback-plan-1005744", "domain": "https://www.hollywoodreporter.com/", "title": "Billy Bush Breaks His Silence on Trump, the 'Access Hollywood' Tape, NBC and a Comeback Plan (Exclusive)", "description": "Seven months after the infamous \"grab them by the pussy\" recording got Bush fired (and nearly toppled Trump's White House run), the former 'Today' host goes public with what happened on that bus, the people who knew about the tape, how he broke the \"awful\" news to his daughters and his bold comeback move: \"I plan to return to the job that I love.\"", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/05/thr_billy_bush_hr_bb_shot3_02190.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Billy Bush Breaks His Silence on Trump, the 'Access Hollywood' Tape, NBC and a Comeback Plan (Exclusive)", "description": "Seven months after the infamous \"grab them by the pussy\" recording got Bush fired (and nearly toppled Trump's White House run), the former 'Today' host goes public with what happened on that bus, the people who knew about the tape, how he broke the \"awful\" news to his daughters and his bold comeback move: \"I plan to return to the job that I love.\"", "url": "https://www.hollywoodreporter.com/features/billy-bush-breaks-his-silence-trump-access-hollywood-tape-nbc-a-comeback-plan-1005744", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/05/thr_billy_bush_hr_bb_shot3_02190.jpg", "width": 1500, "height": 844, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Billy Bush Breaks His Silence on Trump, the 'Access Hollywood' Tape, NBC and a Comeback Plan (Exclusive)", "sailthru.description": "Seven months after the infamous \"grab them by the pussy\" recording got Bush fired (and nearly toppled Trump's White House run), the former 'Today' host goes public with what happened on that bus, the people who knew about the tape, how he broke the \"awful\" news to his daughters and his bold comeback move: \"I plan to return to the job that I love.\"", "sailthru.author": "Lacey Rose,Marisa Guthrie", "sailthru.vertical": "Television", "sailthru.date": "2017-05-21 16:30:00", "sailthru.tags": "Television,Billy Bush,Donald Trump,autoplay,Longform 2017,THR Cover Story"}, "movies": [], "publish_date": 1495355400.0, "source": "https://www.hollywoodreporter.com", "summary": ""}