{"url": "http://www.newslocker.com/en-us/news/celebrity/kate-middleton-looks-lovely-in-stripes-as-she-hosts-london-marathon-runners-at-kensington-palace/", "text": "Celeb-Loved Spanx Leggings Come in a Bike Shorts Style, Too — and They’re Half-Off Today Remember once upon a time when Kris Jenner shaded Kim Kardashian for wearing bike shorts? The once-controversial silhouette has proven it’s here for the long haul, with stars like Gigi Hadid and Hailey Bieber since giving it their style stamp of approval. So when we saw that Spanx, the foremother of shapewear, dropped a surprise one-day flash sale on its popular bike shorts, we couldn’t have been there any faster.\n\nThrough today only, you can shop the brand’s bike shorts for an Read more\n\nJennifer Lopez Performs Barbra Streisand's 'People' for One World: Together at Home Special Jennifer Lopez pulled off a spectacular performance to support healthcare professionals battling the global coronavirus pandemic.\n\nOn Saturday, the “Let’s Get Loud” songstress sang remotely for the One World: Together at Home special, organized by Global Citizen, the World Health Organization, and Lady Gaga to raise awareness through the COVID-19 Solidarity Response Fund to support local and regional charities providing food, shelter and healthcare to those in need amid the ongo Read more\n\nElton John Thanks Healthcare Workers with Performance of 'I'm Still Standing' amid Coronavirus Pandemic Elton John gave an electric performance of “I’m Still Standing” from his home to thank those affected most by the coronavirus pandemic.\n\nThe iconic singer, 73, gave a solo performance from home during the One World: Together At Home special, raising awareness through the COVID-19 Solidarity Response Fund to support local and regional charities providing food, shelter and healthcare to those in need amid the ongoing health crisis.\n\n“This is for everyone out there who’s Read more\n\nKhloé Kardashian Pays for Elderly Shoppers' Groceries in Los Angeles Area amid Coronavirus Khloé Kardashian is lending a helping hand to some of the most vulnerable amid the coronavirus pandemic.\n\nFor the past week, the reality star, 35, has been hitting up different stores in the Los Angeles area to pay for elderly customers’ groceries, PEOPLE can confirm.\n\nTMZ was the first to report the news. According to the outlet, Kardashian has covered tabs for shoppers at different Trader Joe’s and Ralphs supermarkets, which have been opening early to let seniors in before oth Read more\n\nLala Kent Receives Sweet Note from Fiancé Randall Emmett on What Would've Been Their Wedding Day Lala Kent is reflecting on her postponed nuptials after she and fiancé Randall Emmett decided to move their wedding date from April to July due to the spread of the novel coronavirus (COVID-19).\n\nOn Saturday, the day she planned to marry Emmett, Kent shared a photo of herself posing with a veil along with a message about how she’s been coping with the postponement.\n\n“Life doesn’t care what we want or have planned,” the Vanderpump Rules star wrote. “I’m a Read more\n\nRachel McAdams Calls Her 2-Year-Old Son a 'Welcome Distraction' amid Coronavirus Pandemic Rachel McAdams is staying busy while self-isolating at home with her 2-year-old son.\n\nThe actress opened up about her toddler on Thursday during her appearance on Canada’s Heroes of Health: Covid-19 Stream-a-Thon, during which she donated $10,000 to support local healthcare workers.\n\nThe Spotlight star — who shares her son with boyfriend Jamie Linden — said her child is keeping her active during her time at home, joking that he’s her “welcome distraction.”\n\n&ldqu Read more\n\nDwayne Johnson Says Self-Quarantining Has Had 'Very Positive Effect' on His Marriage amid Pandemic Dwayne Johnson is opening up about how he and wife Lauren Hashian are maintaining a healthy relationship at home amid the coronavirus pandemic.\n\nOn Saturday, the actor — who is also self-isolating at home with their daughters Jasmine Lia, 4, and Tiana Gia, 2 — shared a thoughtful response on Instagram after a fan asked him how social distancing has been affecting his marriage.\n\nIn his candid video message, Johnson explained that he and Lauren — who tied the knot in August du Read more\n\nBroadway Star Nick Cordero Undergoes Surgery to Amputate Leg Due to Coronavirus Complications Broadway star Nick Cordero had his right leg amputated as a result of coronavirus-related complications, his wife Amanda Kloots announced on her Instagram Story Saturday.\n\nCordero, 41, has spent 18 days in intensive care while sick with the novel coronavirus (COVID-19). “We got some difficult news yesterday,” Kloots began in her latest video update, before revealing that the blood thinners initially helping to ease some clotting in Cordero’s leg were causing issues with his bloo Read more\n\nBroadway Star Nick Cordero to Have His Right Leg Amputated Due to Coronavirus Complications Broadway star Nick Cordero will have his right leg amputated as a result of coronavirus-related complications, his wife Amanda Kloots announced on her Instagram Story Saturday.\n\nCordero, 41, has spent 18 days in intensive care while sick with the novel coronavirus (COVID-19). “We got some difficult news yesterday,” Kloots began in her latest video update, before revealing that the blood thinners initially helping to ease some clotting in Cordero’s leg were causing issues with hi Read more\n\nSam Smith Says Demi Lovato 'Seems Happy at the Moment' with Boyfriend Max Ehrich Sam Smith has (virtually) met his pal Demi Lovato’s new boyfriend!\n\nSmith connected with Lovato and her new beau Max Ehrich during a video call Thursday night ahead of the release of their new song “I’m Ready.”\n\n“They seem so sweet,” the singer, 27, told Andy Cohen of Lovato and Ehrich during an appearance on the Bravo host’s SiriusXM radio show Friday. “She seems happy at the moment which is the most important thing.”\n\nPEOPLE confirmed late las Read more\n\nKourtney Kardashian Turns 41! See Sweet Birthday Wishes from Kim, Khloè and More Family Members Kourtney Kardashian is ringing in her 41st birthday with love from her family.\n\nWhile the Poosh creator wasn’t able to throw a birthday bash due to the coronavirus pandemic, the reality star still received loving messages on social media from sisters Kim Kardashian West and Khloé Kardashian as well as their momager Kris Jenner.\n\nJenner kicked off the birthday festivities with a heartwarming note to her firstborn, alongside a series of adorable throwback pictures of Kourtney as a young Read more\n\nGage Edward Talks About How He Is Parenting Daughter Monroe After Split from Jeff Lewis Gage Edward is opening up about how he is parenting his 3-year-old daughter Monroe as a single father.\n\nEdward gave a rare public address during an Instagram Live on Friday amid his tumultuous custody battle with ex Jeff Lewis and discussed his relationship with Monroe, sharing that it’s “an amazing thing to watch” her learn and grow.\n\n“I think it’s just interesting to watch how a kid learns. I think that Monroe’s smart,” the former Flipping Out star, 35, Read more\n\nVanessa Bryant Shares Emotional Tribute to Late Daughter Gianna After Her WNBA Honor Vanessa Bryant is bursting with pride as she celebrates her late daughter Gianna Bryant‘s honorary draft into the WNBA.\n\nNearly three months after the tragic helicopter crash that killed Gianna, her father Kobe Bryant and seven others, the 13-year-old and her two Mamba Academy teammates Alyssa Altobelli and Payton Chester, who also died in the crash, were named honorary picks during the WNBA draft on Friday.\n\nOn Saturday, Vanessa, 37, posted an emotional tribute to Gianna, sharing how proud Read more", "images": ["https://img.newslocker.com/2020/04/18/205356153_350.jpg", "https://img.newslocker.com/2020/04/19/205362178_725.jpg", "https://img.newslocker.com/2020/04/18/205348444_725.jpg", "http://www.newslocker.com/images/share-linkedin.png", "https://img.newslocker.com/2020/04/19/205365600_725.jpg", "https://img.newslocker.com/2020/04/19/205367597_725.jpg", "https://img.newslocker.com/2020/04/19/205392571_725.jpg", "https://img.newslocker.com/2020/04/18/205348945_725.jpg", "https://img.newslocker.com/2020/04/18/205356962_725.jpg", "https://img.newslocker.com/2020/04/18/205356152_350.jpg", "http://www.newslocker.com/images/share-twitter.png", "https://img.newslocker.com/2020/04/19/205367921_725.jpg", "https://img.newslocker.com/2020/04/18/205345208_725.jpg", "https://img.newslocker.com/2020/04/18/205344382_725.jpg", "https://img.newslocker.com/2020/04/19/205369589_725.jpg", "https://img.newslocker.com/2020/04/19/205366616_725.jpg", "https://img.newslocker.com/2020/04/19/205364513_725.jpg", "https://img.newslocker.com/2020/04/18/205347192_725.jpg", "http://www.newslocker.com/images/newslocker-logo.png", "https://img.newslocker.com/2020/04/19/205361047_725.jpg", "https://img.newslocker.com/2020/04/19/205364339_725.jpg", "https://img.newslocker.com/2020/04/19/205365148_725.jpg", "https://img.newslocker.com/2020/04/19/205368196_725.jpg", "https://img.newslocker.com/2020/04/18/205356607_725.jpg", "http://www.newslocker.com/images/rss.png", "http://www.newslocker.com/images/newslocker-cube.png", "https://img.newslocker.com/2020/04/18/205345902_725.jpg", "http://akns-images.eonline.com/eol_images/Entire_Site/2017319/rs_600x600-170419101821-600.Kate-Middleton-London-JR-041917a.jpg?downsize=450:*&crop=450:350;left,top", "https://static.addtoany.com/buttons/share_save_120_16.gif", "https://img.newslocker.com/2020/04/19/205363541_725.jpg", "https://img.newslocker.com/2020/04/18/205350278_725.jpg", "http://www.newslocker.com/images/share-facebook.png", "https://img.newslocker.com/2020/04/18/205354005_725.jpg", "https://img.newslocker.com/2020/04/19/205357733_725.jpg", "https://img.newslocker.com/2020/04/19/205359727_696.jpg", "https://img.newslocker.com/2020/04/18/205351135_725.jpg", "https://img.newslocker.com/2020/04/19/205364014_725.jpg"], "top_img": "http://akns-images.eonline.com/eol_images/Entire_Site/2017319/rs_600x600-170419101821-600.Kate-Middleton-London-JR-041917a.jpg?downsize=450:*&crop=450:350;left,top", "keywords": [], "authors": [], "canonical_link": "https://www.newslocker.com/en-us/news/celebrity/kate-middleton-looks-lovely-in-stripes-as-she-hosts-london-marathon-runners-at-kensington-palace/", "title": "Kate Middleton Looks Lovely in Stripes as She Hosts London Marathon Runners at Kensington Palace", "meta_data": {"description": "Kate Middleton gave runners of the 2017 Virgin Money London Marathon an extra boost of confidence Wednesday.Dressed casually in a lovely white $280 Luisa Spagoli Muvi pullover with red...", "og": {"title": "Kate Middleton Looks Lovely in Stripes as She Hosts London Marathon Runners at Kensington Palace - Celebrity news - NewsLocker", "description": "Kate Middleton gave runners of the 2017 Virgin Money London Marathon an extra boost of confidence Wednesday.Dressed casually in a lovely white $280 Luisa Spagoli Muvi pullover with red...", "type": "website", "url": "https://www.newslocker.com/en-us/news/celebrity/kate-middleton-looks-lovely-in-stripes-as-she-hosts-london-marathon-runners-at-kensington-palace/", "image": "http://akns-images.eonline.com/eol_images/Entire_Site/2017319/rs_600x600-170419101821-600.Kate-Middleton-London-JR-041917a.jpg?downsize=450:*&crop=450:350;left,top", "site_name": "Newslocker"}, "fb": {"admins": 1335791813}, "robots": "index", "google-site-verification": "wAInSoPxz3OEgOXCHtETx-x7ukmlX40FRoiPZpO7ww4", "msvalidate.01": "2F0DB39856FAA0E47C70E9E1FF8653AA"}, "movies": [], "publish_date": 1492624020.0, "source": "http://www.newslocker.com", "summary": ""}