{"url": "https://www.nytimes.com/2018/01/24/magazine/is-rupauls-drag-race-the-most-radical-show-on-tv.html", "text": "Charles frequently described his relationship to drag as “the Superman to my Clark Kent.” The first time he stepped into his drag persona, Charles felt fully alive, electric with a power to command attention and desire. One day his therapist told him he could be Superman regardless of his attire. “She said, ‘The power you feel in drag is available to you 24/7,’ ” he told me. That realization, he said, is what he is trying to relay in each season of the show, to both the queens and the viewers. Charles is rarely in drag these days — only for special occasions, and during the judging and elimination rounds on the show — a shift that he made about a decade ago. For Charles, the confidence and fun of drag is a state of mind, not an outfit change. But he is always keenly aware of the power dynamics (the ones Halberstam noted) that favor men, even when they are taking on female personas. “We never forget the fact that we are men in a male-dominated culture where masculinity is a currency that is valued more than gold. For men to do anything with femininity, to use femininity as a palette, it’s basically an act of treason in our culture.”\n\nDuring a break in taping while I was on set, Charles rounded up people for a game of dirty charades, which he loves so much that he keeps a list of clever ideas on his iPhone that is several swipes long. Empty director’s chairs were dragged into an approximation of an audience around the giant stage where the show’s contestants usually walk the runway. About half a dozen crew members arranged themselves accordingly. Charles, impeccable in his petal-pink three-piece suit, leapt onto the stage, lit by fuchsia lights, and signaled the start of the game. He used his hands to simulate the whirring of an analog film camera, and then held up three fingers, indicating a three-word movie title. He pinched his forefinger and thumb to indicate that the first word was short. He curled his hands into soft fists and raised them to his mouth. He mimed licking himself, and then spun around and squatted, reaching his hands around and motioning as if he were pulling something from his ass. The group, including me, burst into laughter. Someone yelled, “That Darn Scat!” and Charles slapped his thighs and released a peal of laughter so distinct and delightful — like a throaty giggle — that as a child his older sisters regularly tickled it out of him.\n\nNo one wanted to try and top that performance, so Charles cycled through several more R-rated versions of movies and songs like “It’s the Hard-Knock Life,” “A Clockwork Orange” and “The Blue Lagoon.” After each round, there was wild applause. I had the discomfiting sensation of catching a glimpse of something deeply private, like walking in on someone in a state of undress or using the bathroom. I had seen more than 100 episodes of “Drag Race.” I had watched Charles play the matriarch and patriarch, dispensing wisdom, jokes, admonishments and pep talks. Here, he looked carefree as he moved seamlessly between impersonations of a tough biker, a coquettish flirt, a naughty schoolgirl. Onscreen, he was always slightly removed, distant, ruling the show with a steely reserve that bordered on conservatism. The contrast between that Ru and the Ru pantomiming masturbation onstage was so disorienting it made my head spin. Watching him shape-shift onstage, I finally understood what he was trying to get at, how he refuses the outward ways in which people try to characterize him — and really, all people.\n\nCharles has been with his husband, Georges LeBar, since 1994, when they met on the dance floor at Limelight. On their second date, they flew from London to Düsseldorf on Elton John’s private jet. They married in early 2017, 23 years after they met. The couple split their time between Los Angeles and Wyoming, where LeBar, a ruggedly handsome man somehow taller than Charles, has a 60,000-acre ranch. When they can, they take quick trips to San Francisco, New York or Maui. One time they took a helicopter from Las Vegas to the Grand Canyon, had lunch and took a boat down the Colorado River. “Having money is great when you have an imagination,” Charles told me. I asked him if LeBar likes that sort of thing. “He loves luxury and doesn’t give a [expletive] about culture,” Charles replied. “He doesn’t know who the Kardashians are. He doesn’t know who Lil Yachty is. He couldn’t name a Taylor Swift song.” It’s a reprieve from the celebrity status of Charles’s world.\n\nBut Charles thrives on that culture. He is working on a scripted television series for Hulu with the director J.J. Abrams based on his own life, and he recently appeared in the fourth season of “Broad City,” as Marcel, the manager of a haughty Brooklyn restaurant where Ilana works, who encourages her to be mean to the customers as a tactic to pressure them into spending money. Ilana eventually pushes back against Marcel’s tyranny and realizes she is more successful as herself — the ultimate Ru message. “We wrote this character with Ru in mind,” Abbi Jacobson, the creator of the show with Ilana Glazer, told me. “There’s a [expletive]-it mentality of being and owning yourself, and experimenting with yourself,” she said of his appeal. Jacobson and Glazer watched “The RuPaul Show” when it aired during the 1990s and remembered the fun freakiness of the cast and characters. At the time, Glazer was also watching the sitcom “Saved by the Bell,” which featured model-looking teenagers; the show made her feel “ugly and fat,” she said. “It was such a relief to change the channel and see Ru dancing and partying in the margins, and making space for his identity. He elbowed his way into the room in such a way that includes so many more people than him, and that representation trickled all the way down to these two little weird Jewish girls.”\n\nI arrived at a Midtown Manhattan convention hall early on a Sunday morning in September to find the new drag economy, the one that Peppermint noted, at work. In 2015, Charles and World of Wonder created RuPaul’s DragCon, a multiday convention about all things drag. Charles had mentioned to me it several times — he is nothing if not media-savvy — as the future of his empire and a way to widen the culture of drag beyond a television show and nighttime acts.\n\nTables were laden with items for sale: intricate corsets, leather gloves, beaded jewelry, sequined pasties, gel breastplates and elaborate bouffant-style wigs in every shade of pastel. There were makeup counters and queens giving attendees makeovers. One aisle was marked “backrolls.” Past winners and former contestants paraded the halls, with everyone holding court in their best looks. Ginger Minj was dressed as Snow White, while Bob the Drag Queen looked like a cute clown in a blue tulle top and yellow party hat. Nearby, a queen named Detox lounged near the kind of bubble pit usually reserved for children at a fast-food restaurant. There were local queens, too, as well as children like Lactatia, a 9-year-old drag queen from Montreal (born Nemis Quinn Mélançon Golden), who strutted the convention floor in an iridescent hologram three-piece suit and a cotton-candy-pink bobbed wig. Peppermint was there, too, resplendent in a sheer polka-dot caftan.", "images": ["https://static01.nyt.com/images/2018/01/28/magazine/28mag-rupaul4-cover/28mag-rupaul4-cover-articleLarge-v4.jpg?quality=75&auto=webp&disable=upscale", "https://static01.nyt.com/images/2018/01/28/magazine/28mag-rupaul2/28mag-28rupaul-t_CA2-articleLarge.jpg?quality=75&auto=webp&disable=upscale", "https://static01.nyt.com/images/2018/01/28/magazine/28mag-rupaul4-cover/28mag-rupaul4-cover-facebookJumbo.jpg"], "top_img": "https://static01.nyt.com/images/2018/01/28/magazine/28mag-rupaul4-cover/28mag-rupaul4-cover-facebookJumbo.jpg", "keywords": [], "authors": ["Jenna Wortham"], "canonical_link": "https://www.nytimes.com/2018/01/24/magazine/is-rupauls-drag-race-the-most-radical-show-on-tv.html", "title": "Is ‘RuPaul’s Drag Race’ the Most Radical Show on TV?", "meta_data": {"article": {"published": "2018-01-24T10:00:03.000Z", "modified": "2018-01-24T05:00:02.000Z", "section": "Magazine", "author": "http://www.nytimes.com/by/jenna-wortham", "tag": "Television", "opinion": "false", "content_tier": "metered"}, "robots": "noarchive", "articleid": 100000005688823, "nyt_uri": "nyt://article/efb2d9b0-935a-53f5-abb6-fe052e394e58", "pubp_event_id": "pubp://event/d96211fb6a2a499ebc068ef87f1b3550", "description": "The reality-television competition that began nine years ago has evolved to reflect an era fixated on gender and identity — and the boundary-pushing spirit of its star.", "image": "https://static01.nyt.com/images/2018/01/28/magazine/28mag-rupaul4-cover/28mag-rupaul4-cover-facebookJumbo.jpg", "byl": "By Jenna Wortham", "thumbnail": "https://static01.nyt.com/images/2018/01/28/magazine/28mag-rupaul4-cover/28mag-rupaul4-cover-thumbStandard.jpg", "news_keywords": "RuPaul Charles,RuPaul's Drag Race,cross-dressing;drag,TV", "pdate": 20180124, "og": {"url": "https://www.nytimes.com/2018/01/24/magazine/is-rupauls-drag-race-the-most-radical-show-on-tv.html", "type": "article", "title": "Is ‘RuPaul’s Drag Race’ the Most Radical Show on TV?", "image": {"identifier": "https://static01.nyt.com/images/2018/01/28/magazine/28mag-rupaul4-cover/28mag-rupaul4-cover-facebookJumbo.jpg", "alt": "RuPaul Charles."}, "description": "The reality-television competition that began nine years ago has evolved to reflect an era fixated on gender and identity — and the boundary-pushing spirit of its star."}, "twitter": {"url": "https://www.nytimes.com/2018/01/24/magazine/is-rupauls-drag-race-the-most-radical-show-on-tv.html", "title": "Is ‘RuPaul’s Drag Race’ the Most Radical Show on TV?", "description": "The reality-television competition that began nine years ago has evolved to reflect an era fixated on gender and identity — and the boundary-pushing spirit of its star.", "image": {"identifier": "https://static01.nyt.com/images/2018/01/28/magazine/28mag-rupaul4-cover/28mag-rupaul4-cover-videoSixteenByNineJumbo1600.jpg", "alt": "RuPaul Charles."}, "card": "summary_large_image", "app": {"name": {"googleplay": "NYTimes"}, "id": {"googleplay": "com.nytimes.android"}, "url": {"googleplay": "nyt://article/efb2d9b0-935a-53f5-abb6-fe052e394e58"}}, "site": "@nytimes"}, "CG": "magazine", "PT": "article", "PST": "News", "url": "https://www.nytimes.com/2018/01/24/magazine/is-rupauls-drag-race-the-most-radical-show-on-tv.html", "msapplication-starturl": "https://www.nytimes.com", "al": {"android": {"url": "nyt://article/efb2d9b0-935a-53f5-abb6-fe052e394e58", "package": "com.nytimes.android", "app_name": "NYTimes"}, "iphone": {"url": "nytimes://www.nytimes.com/2018/01/24/magazine/is-rupauls-drag-race-the-most-radical-show-on-tv.html", "app_store_id": 284862083, "app_name": "NYTimes"}, "ipad": {"url": "nytimes://www.nytimes.com/2018/01/24/magazine/is-rupauls-drag-race-the-most-radical-show-on-tv.html", "app_store_id": 357066198, "app_name": "NYTimes"}}, "viewport": "width=device-width, initial-scale=1", "fb": {"app_id": 9869919170}}, "movies": [], "publish_date": 1516723200.0, "source": "https://www.nytimes.com", "summary": ""}