{"url": "https://www.digitalspy.com/movies/a804382/fast-and-furious-feud-a-timeline-of-dwayne-johnson-and-vin-diesels-beef/", "text": "We didn't see this one coming. The stars of the Fast and Furious franchise are known for being a family on and off-screen, but it looks as if that family has some serious dinner-table discussions to get out the way.\n\nDwayne Johnson – who plays government agent Luke Hobbs in the series – dropped one hell of a bombshell by implying he had some serious beef with at least one of his male co-stars. And that was just the first of several potential cast fallouts.\n\nBut what's going on? Here's a timeline of events so far:\n\n1. Dwayne Johnson vs Vin Diesel\n\nThe Rock slams 'candy ass' male co-stars\n\nIn a pumped-up post on his social media accounts, Dwayne Johnson unveiled a brief clip from Fast 8, while calling out some \"chicken shit\" male co-stars, but didn't name names.\n\nHe wrote: \"There's no other franchise that gets my blood boiling more than this one. An incredible hard working crew. Universal Studios Entertainment has been great partners as well. My female co-stars are always amazing and I love 'em.\n\n\"My male co-stars however are a different story. Some conduct themselves as stand up men and true professionals, while others don't.\n\nParamount\n\n\"The ones that don't are too chicken shit to do anything about it anyway. Candy asses. When you watch this movie next April and it seems like I'm not acting in some of these scenes and my blood is legit boiling - you're right.\n\n\"Bottom line is it'll play great for the movie and fits this Hobbs character that's embedded in my DNA extremely well. The producer in me is happy about this part. Final week on FAST 8 and I will finish strong.\"\n\nWho is he talking about? Is it Vin Diesel?\n\nWhile Dwayne didn't name anyone in his rant, all eyes turned to the franchise's lead star Vin Diesel.\n\nUniversal\n\nSeveral gossip sites including TMZ have claimed that Dwayne's supposed anger was aimed at Vin, allegedly due to his work ethic and showing up late to filming. Though, we're not sure we believe any of that, as Vin is notoriously protective and passionate about the legacy of the franchise.\n\nObviously take all this with a furious pinch of salt, but the two have apparently held a secret meeting, while the cast and crew have taken sides over the whole affair.\n\nTyrese Gibson played the whole thing down\n\nThe Rock and Vin's longtime co-star Tyrese responded to the comments on Instagram, but soon deleted his post. But thankfully it was saved by eagle-eyed fans and reposted.\n\nTyrese said he wasn't aware of any issues between any of his castmates, and that Dwayne is one of the most professional guys he's ever worked with.\n\nHe also ruled himself out of the 'candy ass' category by uploading a since-deleted video of Dwayne singing 'Happy Birthday' to his daughter.\n\n\"Why are you guys so impressionable? A man wouldn't be singing from his heart and soul to another mans little angel if he had a problem with her dad,\" he wrote.\n\nAlberto E. Rodriguez Getty Images\n\nHe continued: \"Does any of us know why bro decided to jump out there with his post? No...Would one assume that IF he's going to jump out there and generalize and say 'Male Co-Stars' he would be more clear and call out names???\n\n\"Of course he should of—Let me calm you guys all the way down...I don't know WHO he has a problem and I don't have any details of WHAT those problems are—as a matter of fact if I DID know I would tell you shit!!!!\"\n\n\"I think Dwayne aka DJ happens to be one of the most humble, down to earth and professional people I've ever worked with and more importantly he's my brother we have NEVER had a problem and will never have a problem...WE are good over here....As a cast we're ALL married dammit!!!\"\n\nVin's response\n\nNot really, nope. He's posted a couple of videos since Dwayne's rant, but he hasn't directly replied.\n\n\"So much has gone in this year,\" he said in one post.\n\n\"I can't believe I wrapped two back to back pictures I both starred in and produced. Now I get to return to my family, my life... To me.\"\n\nScott Eastwood hinted at potential issues before\n\nF Gary Gray Instagram\n\nThe newest addition to the Fast Family, Scott Eastwood, previously spoke of his surprise that certain co-stars would spend so long in their trailers. With rumours that one of The Rock's gripes with Vin is about his trailer love, could these remarks be telling?\n\nHe told Esquire: \"I remember something he told me early on. I don't remember how old I was when you told me this, Dad. But you said, 'As an actor, I never went back to my trailer. I always hung out on set and learned'.\n\n\"That stuck with me. I'm on this Fast and the Furious movie right now, and everyone goes back to their trailer. I stick around and say, 'Why are you setting up the shot like this?' I want to learn.\"\n\nDwayne later defused the situation (for a bit)\n\nJust a day and a half after making his initial comments, Dwayne made a further statement on Instagram, implying that any issues he had were either not that big a deal or had been settled.\n\n\"My FINAL WEEK of shooting #FastAndFurious,\" he said. \"There's no greatness ever achieved alone.. it's always a team effort.\n\n\"You guys reading this know how much I believe in the idea of TEAM EFFORT. That means respecting every person, their time and their value when they step on to my set or partner with our production company.\n\nFameFlynet\n\n\"And like with any team – that's a family – there's gonna be conflict. Family is gonna have differences of opinion and fundamental core beliefs.\"\n\nHe added: \"To me, conflict can be a good thing, when it's followed by great resolution. I was raised on healthy conflict and welcome it.\n\n\"And like any family, we get better from it. At the end of the day me and #F8 co-stars all agree on the most important thing: Delivering an incredible movie to the world.\"\n\nTyrese and Ludacris appeared to take Vin's side\n\nWhile not exactly dissing The Rock in any way, both Tyrese and Ludacris posted to Instagram their support of Vin Diesel.\n\nLudacris simply posted a nostalgic shot of him with Vin and their F&F co-stars:\n\nWhereas, Tyrese elaborated on his earlier post by supporting his 'brother' Vin:\n\nThe Rock thanks everyone APART from Vin after the film wrapped\n\nJust when you thought it was over, Dwayne through some furious shade towards Vin in an Instagram post, in which he mentioned pretty much everyone apart from Diesel.\n\nHe wrote: \"Finished strong and on to the next. That's an officially wrap on #FastAndFurious8. Thank you to our director @fgarygray for the vision and execution.\n\n\"Thank you UNIVERSAL for being tremendous partners as always, thank you to all my fellow co-stars for the daily effort and grind. Scott Eastwood you handsome sumbitch! Natalie Emmanuel I have a cold Budweiser ready for you and Tyrese Gibson you still have the biggest smile and forehead I've ever seen.\n\nBut then again, he didn't mention Michelle Rodriguez, Ludacris or Jason Statham among others – so could we have a Civil War on our hands? Probably not.\n\nVin finally mentions Dwayne, and was full of praise\n\nAfter a few semi-cryptic posts, Vin actually named his co-star by name in a Facebook Live video, and was nothing but positive about him.\n\n\"The reason we brought Dwayne Johnson into Fast 5 was because of you (the fans),\" he said.\n\n\"There was a girl named Jan Kelly who said, 'I would love to see you work together on screen.' So the role that was originally written for Tommy Lee Jones, we gave it to Dwayne and he shined in it.\"\n\nDwayne and Vin barely share screen time in The Fate of the Furious\n\nTheir real-life beef clearly had an impact, as Vin and Dwayne's characters are hardly seen on screen together at the same time.\n\nHobbs and Dom share a phone call, when Dom crashes into Hobbs you don't actually see them on screen at the same time, and you only see Dom's back when Hobbs joins the gang for dinner at the end of the movie. What gives?\n\nDwayne announces his Hobbs spin-off, while throwing shade in Vin's general direction\n\nThe Hobbs spin-off which may or may not be responsible for Fast and Furious 9's release date delay (it was planned for 2019 but has been pushed back to 2020) is moving forward and Dwayne Johnson took to Instagram to announce it. Never missing an opportunity to fan the feud flames, he added the odd dig, saying:\n\n\"My vision is to create greater opportunities for not only my fellow FF cast mates, but for other amazing actors as well who want to be a part of something new and cool. I want to use my spinoff platform to create new characters that fans will ultimately love to have fun with in multiple chapters and platforms. Film, TV, Digital, Virtual Reality etc.. the more opportunities we can create the better for the fans. Smart business. Let's have some FUN and to quote, Hobbs the boss, if you don't like it, we're happy to beat that ass like a Cherokee drum.\"\n\nAnd signing off with #NewOpportunities #CandyAssesNeedNotApply\n\nDwayne confirms he didn't shoot with Vin on Fast & Furious 8\n\nJust when you think the drama is over, Dwayne confirmed that he didn't shoot any scenes with Vin on the latest movie, while also throwing some serious shade his way.\n\n\"Vin and I had a few discussions, including an important face-to-face in my trailer. And what I came to realise is that we have a fundamental difference in philosophies on how we approach moviemaking and collaborating. It took me some time, but I'm grateful for that clarity. Whether we work together again or not,\" he reflected.\n\nWith the Hobbs and Shaw spin-off on the way, Johnson is \"not quite sure\" if he'll be in Fast & Furious 9 as he's currently concentrating on making his movie \"as good as it can be\".\n\n\"But I wish him all the best, and I harbour no ill will there, just because of the clarity we have,\" he concluded, adding with a laugh: \"Actually, you can erase that last part about 'no ill will'. We'll just keep it with the clarity.\"\n\n2. Vin Diesel vs Michelle Rodriguez\n\nMichelle says female stars deserve better\n\nFranchise veteran Michelle Rodriguez said in July 2017 that she could consider quitting if it does not give its female stars more \"love\".\n\nCharlize Theron was introduced in the eighth movie as the latest Big Bad, but Jordana Brewster (Mia) was written out following Paul Walker's tragic death and Nathalie Emmanuel (Ramsey) was largely sidelined and didn't get an awful lot to do.\n\nElsa Pataky's character Elena Neves only existed to service Dom's storyline (and was then killed off), while Dame Helen Mirren had a cameo as Deckard and Owen Shaw's mother.\n\nRodriguez called for the franchise to do better by its female characters in the ninth movie, posting her message on Instagram:\n\nVin plays down any potential beef\n\nVin Diesel later showed his support, posting on Instagram that he was \"proud\" of the franchise's saga, but added: \"We must try to reach higher each time. The challenge is what makes it fun and exciting.\n\n\"Its also why this saga has reached the level that it has... you have been the best fans in film history and we are forever grateful...\"\n\nThe caption accompanied a video where Rodriguez called Diesel a long-time supporter of strong women, and said her comments were not aimed at him:\n\n3. Tyrese Gibson vs Dwayne Johnson\n\nTyrese Gibson – aka Roman Pearce – is apparently angry that Dwayne Johnson will be branching off from the main Fast and Furious series for a spin-off with Jason Statham.\n\nTyrese took his displeasure public by posting a warning against The Rock's Instagram timeline for his 93.5 million followers to see.\n\nReplying to a photo of The Rock reviewing a movie contract, Tyrese vented: \"If you move forward with that #Hobbs Movie you will have purposely ignored the heart to heart moment we had in my sprinter.\n\n\"I don't wanna hear from you until you remember what we talked about. I'm on your timeline cause you're not responding to my texts messages. #FastFamily is just that a family……We don't fly solo.\"\n\nDays later, he added: \"I want you to shoot it just not right now cause the #Fast9 release date has already been announced and we can't let our loyal fans #FastFamily or our loyal fast and furious FANS down on any level from pushing the date.\"\n\nThose messages have since been deleted, but the actor did caption a follow-up photo of the two together with: \"I don't do email bruh. You got my cell same San Diego # hit me.\"\n\nOn October 5 2017, Tyrese stepped it up again:\n\n\"Diversity, love, multi ethnic worldwide multi generational, United Nations, One Race, Fast Family...... Until Dewayne showed up I guess this whole time he had a problem cause he wasn't the ONLY ONE on the movie poster\"\n\nHe goes on to claim that he, Vin Diesel, Paul Walker and director Rob Cohen were offered a spin-off movie but refused it.\n\nIn a subsequent post, he bashed Johnson further for accepting a Hobbs solo movie:\n\n\"#PSA Congratulations to @TheRock and your brother in law aka 7 bucks producing partner @hhgarcia41 [Hiram Garcia] for making the fast and the furious franchise about YOU,\" he wrote on Instagram.\n\nGibson later elaborated on his instagram post in an interview with TMZ:\n\n\"Everybody coming at me like I'm hating on Dwayne for his spin-off. I'm not. Truth is I just wish he was releasing it at a different time... Pushing our release date back? It's only happened one time in the history of the Fast and the Furious, when we lost our brother Paul Walker. So what's the reason we're pushing the release date back now? I just got a problem with Dwayne, it appears he's being selfish, it appears that he's being so focused on furthering his own self interest that he's making decisions from the seat that he's sitting in. The Fast and the Furious 9 isn't coming out till 2020… that's f**ked up.\"\n\nThings seemed to reach even more of a head with Tyrese implying that he wouldn't work with Johnson on Fast 9 and that the producers would have to choose between the two,.\n\n\"Hello world.......... hello loyal fans and loved ones from OUR fast universe........ I'm sorry to announce that if Dewayne is in Fast9 there will no more Roman Peirce - You mess with family and my daughters survival I mess with yours......... close your eyes dude you're a \"Clown\"...... #CandyAssBitchMade All my real one.... Men on integrity... my real ones out here stand UP...... folks that GP to the gym and get big naturally #NoJuice #NoOJ spin off huh? Spin off these nuts selfish champ...... pause notice who's got his arms around my shoulder and who's standing alone -#OurChildrenMatter\"\n\nBut it looks like some sort of peace has finally been found between the two.\n\nTyrese's 'final word' (we'll see) is that he's spoken to an 'Associate' of Johnson and won't be posting about him any more. His message also implied he WILL be back for Fast 9 (again, we'll see).\n\n\"Want you guys to know I️ had a real Heart to Heart with one of Dewayne's associates and this will be my last post about him........ I️ repeat my last.... I️ respect the associate who called.. My story will never change I️ was never DJ's Co-Star... I'm Shayla's Father first.... Justin Lin is back in the driver seat that's exciting cause it going to feel like the true #FastFamily all over again..... When we see Justin we see Paul.....\n\nDwayne Johnson has yet to publicly respond to any of Tyrese's social media posts. This is yet another frustrating development for a franchise whose main theme is the importance of family and togetherness.\n\nFast & Furious 9, meanwhile, was slotted to arrive in cinemas on April 19, 2019 but has now been put back to April 20, 2020.\n\nWant up-to-the-minute entertainment news and features? Just hit 'Like' on our Digital Spy Facebook page and 'Follow' on our @digitalspy Twitter account and you're all set.", "images": ["https://www.digitalspy.com/sites/digitalspy/assets/images/logos/ipso_regulated_hires.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/14/1522920283-the-rock-vin-diesel-feud.jpg?crop=1xw:0.8839779005524862xh;center,top&resize=1200:*"], "top_img": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/14/1522920283-the-rock-vin-diesel-feud.jpg?crop=1xw:0.8839779005524862xh;center,top&resize=1200:*", "keywords": [], "authors": ["Tom Eames", "Rosie Fletcher"], "canonical_link": "https://www.digitalspy.com/movies/a804382/fast-and-furious-feud-a-timeline-of-dwayne-johnson-and-vin-diesels-beef/", "title": "Fast and Furious feuds explained: A timeline of Dwayne Johnson, Vin Diesel, Tyrese Gibson and Michelle Rodriguez's beef", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#e94114", "og": {"type": "article", "site_name": "Digital Spy", "title": "Fast & Furious feuds: All the cast beefs explained", "description": "Just make out already.", "url": "http://www.digitalspy.com/movies/a804382/fast-and-furious-feud-a-timeline-of-dwayne-johnson-and-vin-diesels-beef/", "image": {"identifier": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/14/1522920283-the-rock-vin-diesel-feud.jpg?crop=1xw:0.8839779005524862xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 131928163488848}, "article": {"publisher": "https://www.facebook.com/digitalspyuk/", "modified_time": "2018-11-28 05:19:46", "published_time": "2018-04-04 03:40:00", "section": "Movies", "opinion": "false"}, "twitter": {"site": "@digitalspy", "card": "summary_large_image", "image": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/14/1522920283-the-rock-vin-diesel-feud.jpg?crop=1xw:0.8839779005524862xh;center,top&resize=640:*"}, "google-site-verification": "yOsKGKJADzRcnlk-FrptJIoYYaNs5pgoJx2J0ie4bWE", "title": "Fast and Furious feuds explained: A timeline of Dwayne Johnson, Vin Diesel, Tyrese Gibson and Michelle Rodriguez's beef", "description": "What has happened to Vin Diesel, Dwayne Johnson, Tyrese Gibson, Michelle Rodriguez and co?", "keywords": "Dwayne Johnson,Vin Diesel, Tyrese Gibson, fast & furious 8, fast & furious feud, vin diesel dwayne johnson feud", "thumbnail": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/14/1522920283-the-rock-vin-diesel-feud.jpg?crop=0.565625xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Movies,movies,Tyrese Gibson,Vin Diesel,Dwayne Johnson", "sailthru.date": "2018-04-04T15:40:00Z", "sailthru.image.full": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/14/1522920283-the-rock-vin-diesel-feud.jpg?crop=1xw:0.8839779005524862xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/14/1522920283-the-rock-vin-diesel-feud.jpg?crop=0.565625xw:1xh;center,top", "sailthru.socialtitle": "Fast & Furious feuds: All the cast beefs explained", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1522784400.0, "source": "https://www.digitalspy.com", "summary": ""}