{"url": "www.theguardian.com/us-news/2017/aug/12/virginia-unite-the-right-rally-protest-violence", "text": "James Fields, from Ohio, arrested following attack at ‘Unite the Right’ gathering, and two police officers die in helicopter crash\n\nThis article is more than 2 years old\n\nThis article is more than 2 years old\n\nA man has been arrested and charged with murder after a car rammed into a group of people peacefully protesting against a white supremacist rally in Charlottesville, Virginia, killing one person and injuring 19.\n\nPolice said a 32-year-old woman had died and that they were attempting to notify her family before releasing more details.\n\nCol Martin Kumer, the superintendent of Albemarle-Charlottesville regional jail, told the Guardian that 20-year-old James Fields, of Ohio, had been arrested following the attack on Saturday.\n\nFacebook Twitter Pinterest James Fields was charged with second-degree murder. Photograph: Albemarle County Jail/AFP/Getty Images\n\n“He has been charged with second degree murder, three counts of malicious wounding and failing to stop at an accident that resulted in a death,” Kumer said in an email.\n\nDonald Trump condemned the “violence on many sides”, but faced criticism for failing to directly denounce the far-right demonstrators.\n\nIn a separate incident, two police officers died when their helicopter, which was monitoring the far-right rally, crashed outside Charlottesville.\n\nState police said in a statement the helicopter was “assisting public safety resources with the ongoing situation” when it crashed in a wooded area. The pilot, Lieutenant H Jay Cullen, 48, of Midlothian, Virginia, and Trooper-pilot Berke Bates of Quinton, Virginia, died at the scene.\n\nThe deaths came at the end of a day marked by violent clashes between far-right nationalists and people who had come to protest against their occupation of a downtown park containing a statue of the Confederate general Robert E Lee.\n\nWitnesses said those hit by the car were peacefully protesting against the white supremacist rally and footage showed the vehicle crashing into another car, throwing people over the top of it.\n\nPlay Video 1:34 Virginia governor says 'go home' to white supremacists and nazis – video\n\nCharlottesville: far-right crowd with torches encircles counter-protest group Read more\n\nThe photographer Pat Jarrett, who witnessed the incident, said: “A gray Dodge Charger plowed into a sedan and then into a minivan. Bodies flew. People were terrified and screaming. Those closest to it said it was definitely a violent attack. The driver, who people later described as a skinny white guy with a straggly beard, reversed out of there and drove off, the front end of his car all smashed up.”\n\nCharlottesville mayor Mike Signer tweeted: “I am heartbroken that a life has been lost here. I urge all people of good will – go home.”\n\nSpeaking at a press conference on Saturday evening, the governor of Virginia, Terry McAuliffe, who had earlier declared a state of emergency, told the white supremacists: “Go home … Shame on you. You pretend you are patriots, but you are anything but a patriot.”\n\nThe mother of Fields told the Associated Press on Saturday night that she knew her son was attending a rally in Virginia but didn’t know it was a white supremacist rally.\n\n“I thought it had something to do with Trump. Trump’s not a white supremacist,” Samantha Bloom said, before becoming visibly upset as she learned of the injuries and deaths at the rally “He had an African-American friend …,” she said before her voice trailed off.\n\nResponding to the events in Charlottesville from Bedminster, New Jersey, Trump: “We condemn in the strongest possible terms this egregious display of hatred, bigotry and violence on many sides, on many sides.”\n\nBut the Republican senator Marco Rubio tweeted that it was important for Trump to describe the events as a “terror attack by white supremacists”.\n\nThe FBI said it was opening a civil rights investigation into the accident along with the justice department’s civil rights division and the district attorney’s office.\n\nThe US attorney general, Jeff Sessions, said: “The violence and deaths in Charlottesville strike at the heart of American law and justice. When such actions arise from racial bigotry and hatred, they betray our core values and cannot be tolerated.\n\nNBC News (@NBCNews) WATCH: White nationalists and counter-protesters clash at Charlottesville rally https://t.co/4qH1yJjrGy\n\nThe car attack came about two hours after state police in riot gear had cleared Emancipation Park, the site of the Robert E Lee statue. The city’s decision in February to remove the statue drew earlier protests by the “alt-right” and the Ku Klux Klan.\n\nRiot police cleared the park after almost an hour of clashes. The far-right groups were largely compliant, but had to run the gauntlet of counter-protesters as they walked west along Market Street.\n\nAfter a brief stalemate, a hard core of about 100 far-right protesters moved to a park two miles away and gathered to hear speakers who had been scheduled for the “Unite the Right” event.\n\nOne of the speakers, the far-right figurehead Richard Spencer, said he had been maced on the way in and lashed out at police and city authorities.\n\nFacebook Twitter Pinterest Rescue personnel help injured people after a car ran into a large group. Photograph: Steve Helber/AP\n\n“Never in my life have I felt like the government was cracking down on me until today,” said Spencer. “We came in peace and we were effectively thrown to the wolves.”\n\nHe said that they would not back down from protesting against the statue. When he mentioned Mayor Signer by name, the crowd chanted: “Jew! Jew! Jew!”\n\nAround the park, members of the far right were nursing and treating minor wounds. One of them, who declined to give his name, was bleeding from the head, and claimed to have been struck with an iron bar. Another young man, with a swastika tattoo on his chest and blood on his forehead, told photographers: “If you take my picture, I’ll cut you. I’m not even kidding.”\n\nMeanwhile, counter-protesters were trying to stop the far-right groups from entering the park. Some counter-protesters, including many marching under red and black anti-fascist banners, tried to block the streets. This led to altercations with far-right groups, who were seen using chemical weapons, sticks and shields on people.\n\nA group of clergy linked arms to block a set of stairs leading into the park. The Rev Seth Wispelwey, of Sojourners United Church of Christ in Charlottesville, said: “We’re here to counteract white supremacy, and to let people know that it is a system of evil and a system of sin.”\n\nSteve Thomas, from Lynchburg, Virginia, who also protested against the far-right groups, said: “I think that what we are witnessing here has always been simmering beneath the surface, and now has been emboldened and enabled by the Trump administration’s politics and rhetoric.”\n\nStatue controversy\n\nIn February, the city council narrowly voted to remove and sell the Robert Lee statue, and to rename the park in which it stands from Lee Park to Emancipation Park. This was the culmination of a campaign to remove the statue started by a local high school student, Zyahna Bryant.\n\n\n\nIt was part of a wave of such removals of Confederate monuments across the south, which began after Dylann Roof massacred nine African American churchgoers in Charleston, South Carolina.\n\nIn response, last May, Richard Spencer led a torchlit white nationalist parade around the park. Then, on 8 July, about 50 members of the Loyal White Knights of the Ku Klux Klan held a rally in the park, and were greeted by about 1,000 counter-protesters. The day ended in turmoil after police used tear gas on some counter-protesters following the Klan’s departure, and made 23 arrests.\n\nBen Jacobs and the Associated Press contributed to this report", "images": ["https://i.guim.co.uk/img/media/eb576ed16aaef48bcf37a5b6aacae1c29b7f21c2/0_411_5804_3483/master/5804.jpg?width=300&quality=85&auto=format&fit=max&s=060b8cc3fc2ff9eff06c1f44e1794c63", "https://i.guim.co.uk/img/media/4341309433d3286714fa61eaab0d85b4df0f1059/0_1526_3310_1986/master/3310.jpg?width=300&quality=85&auto=format&fit=max&s=9fd183bac882454571190d1f2fdb7b6b", "https://i.guim.co.uk/img/media/76be9469e260843ba4be27f1259e035ba4abde57/0_0_2884_1731/master/2884.jpg?width=300&quality=85&auto=format&fit=max&s=8641a095e2d792d5302b4a03fa919a6c", "https://i.guim.co.uk/img/media/8e1f1a67cad0418e5308c4272ca4933ccf7e52b4/0_400_4623_2774/master/4623.jpg?width=300&quality=85&auto=format&fit=max&s=4774d8fc7ad73ccf0da027e7c725721d", "https://i.guim.co.uk/img/media/76be9469e260843ba4be27f1259e035ba4abde57/246_59_2567_1540/master/2567.jpg?width=300&quality=85&auto=format&fit=max&s=95f75996cea841edff4e505507ea116b", "https://i.guim.co.uk/img/media/ab35a86c171ddb136396ea463757e1da5f4fe17c/282_602_6220_3733/master/6220.jpg?width=300&quality=85&auto=format&fit=max&s=eb5f3cec21d586e8eb98497d8bd91c27", "http://phar.gu-web.net/count/pvg.gif", "http://phar.gu-web.net/count/pv.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Virginia%2CRace%2CThe+far+right%2CUS+news", "https://i.guim.co.uk/img/media/d0a6a439eb9737c559313ba0b9a25aa3d0c74232/0_0_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctYWdlLTIwMTcucG5n&enable=upscale&s=c977fda2e18a4de2274498399ae6a949"], "top_img": "https://i.guim.co.uk/img/media/d0a6a439eb9737c559313ba0b9a25aa3d0c74232/0_0_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctYWdlLTIwMTcucG5n&enable=upscale&s=c977fda2e18a4de2274498399ae6a949", "keywords": [], "authors": ["Edward Helmore", "Jason Wilson", "Jon Swaine", "Cas Mudde"], "canonical_link": "https://www.theguardian.com/us-news/2017/aug/12/virginia-unite-the-right-rally-protest-violence", "title": "Man charged with murder after driving into anti-far-right protesters in Charlottesville", "meta_data": {"description": "James Fields, from Ohio, arrested following attack at ‘Unite the Right’ gathering, and two police officers die in helicopter crash", "format-detection": "telephone=no", "HandheldFriendly": "True", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "apple-mobile-web-app-title": "Guardian", "application-name": "The Guardian", "msapplication-TileColor": "#052962", "theme-color": "#052962", "msapplication-TileImage": "https://assets.guim.co.uk/images/favicons/023dafadbf5ef53e0865e4baaaa32b3b/windows_tile_144_b.png", "author": "Jon Swaine", "thumbnail": "https://i.guim.co.uk/img/media/d0a6a439eb9737c559313ba0b9a25aa3d0c74232/0_0_3500_2100/master/3500.jpg?width=620&quality=85&auto=format&fit=max&s=bed7d479bf83e131dec0fdb858b3d3b4", "keywords": "Virginia,Race,The far right,US news", "news_keywords": "Virginia,Race,The far right,US news", "og": {"url": "http://www.theguardian.com/us-news/2017/aug/12/virginia-unite-the-right-rally-protest-violence", "image": "https://i.guim.co.uk/img/media/d0a6a439eb9737c559313ba0b9a25aa3d0c74232/0_0_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctYWdlLTIwMTcucG5n&enable=upscale&s=c977fda2e18a4de2274498399ae6a949", "description": "James Fields, from Ohio, arrested following attack at ‘Unite the Right’ gathering, and two police officers die in helicopter crash", "type": "article", "title": "Man charged with murder after driving into anti-far-right protesters in Charlottesville", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/edwardhelmore,https://www.theguardian.com/profile/wilson-jason,https://www.theguardian.com/profile/jon-swaine", "publisher": "https://www.facebook.com/theguardian", "section": "US news", "published_time": "2017-08-13T13:45:56.000Z", "tag": "Virginia,Race,The far right,US news", "modified_time": "2018-06-14T15:55:17.000Z"}, "al": {"ios": {"url": "gnmguardian://us-news/2017/aug/12/virginia-unite-the-right-rally-protest-violence?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287, "pages": 516977308337360}, "twitter": {"app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"ipad": "gnmguardian://us-news/2017/aug/12/virginia-unite-the-right-rally-protest-violence?contenttype=Article&source=twitter", "googleplay": "guardian://www.theguardian.com/us-news/2017/aug/12/virginia-unite-the-right-rally-protest-violence", "iphone": "gnmguardian://us-news/2017/aug/12/virginia-unite-the-right-rally-protest-violence?contenttype=Article&source=twitter"}}, "image": "https://i.guim.co.uk/img/media/d0a6a439eb9737c559313ba0b9a25aa3d0c74232/0_0_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctYWdlLTIwMTcucG5n&s=b0dbc278d630755be95de6ce115e1e46", "site": "@guardian", "card": "summary_large_image", "dnt": "on"}, "robots": "max-image-preview:large"}, "movies": [], "publish_date": 1502467200.0, "source": "http://www.theguardian.com", "summary": ""}