{"url": "hollywoodlife.com/2017/06/01/nba-finals-predictions-2017-cavaliers-warriors-picks-who-will-win/", "text": "The wait is over! The inevitable Cavs-Warriors Finals matchup is here for the third year in a row. And, I’m here to tell you why the Cavs will take the Larry O’Brien gold back to Cleveland. If you’ve got a strong debate prepared, click inside to challenge me…\n\nAh, you’re brave. Welcome to the Cavs den. Yes, I’m obviously predicting for the Cleveland Cavaliers to win the 2017 NBA Finals. Now, Dubs fans — Before you get up in arms about your beloved Warriors, let me remind you that this is all in fun. Although my shirt currently says “Defend The Land”, that doesn’t mean I don’t think that Golden State is also an incredible team. So, lets talk all things FINALS.\n\nBefore I get into individual reasons, here’s why the Cavs will win the title in the short. Their resume, 3-point shooting, mentality, players in the paint, and the big three, LeBron James, 32, Kyrie Irving, 25, and Kevin Love, 28.\n\nNow, let’s break this down. First of all, have we forgotten about LeBron James’ insane performance in the 2016 finals, when he was the catalyst who brought the Cavs back from a 3-1 deficit? He went back to Cleveland and brought them their first championship in a half century! Damn, that gets me every time. And, I know what you’re saying, “Well, that was last year.” Oh, I know. But, at 32-years-old, King James is playing the best basketball of his life. He’s been averaging about 33.4 points, 9.0 rebounds and 7.1 assists per game in the postseason. Not to mention, he’s passed Michael Jordan, 54, on the postseason scoring list. Mic drop, no. 1!\n\nKevin Love. Oh, do I love me some Love. You can’t even say that he isn’t playing the best basketball of his time with the Cavs. And, the Cavs finally know how to use him. He’s proven to be a dynamic player, shooting 47. 5 from the arc and acting as a beast on the boards, averaging 10.2 rebounds in the postseason. And, can we talk about how he must’ve been a quarterback in a past life? He’s firing long-court passes down to LeBron like it’s no one’s business. What’s up, Tom Brady?!\n\nLet’s talk about Kyrie Irving, aka one of the most clutch players in the NBA. And, that’s exactly what a team needs in the postseason, especially the Finals. The showdown between Irving and Steph Curry, 29, is something that everyone’s been waiting for. Irving has averaged 26.6 points in the past two Finals, while Curry has averaged 24.1. AND, those handles. Not to mention, he’s a young pup at 25, having been in the league for six years now. And, by the look on his face when talking about heading to Oakland, I think he’s more than ready for a matchup with Curry.\n\nLook at Kyrie when Ernie Johnson talks about facing the Warriors again in the Finals 😂 pic.twitter.com/8zlx0Nkca8 — Bleacher Report (@BleacherReport) May 26, 2017\n\nWhat’s something else that the Warriors don’t have? — Tristan Thompson, 26. He knows how to go hard, yet stay in control in the paint. And, he completely eats the glass when it comes to the boards.\n\nAnother thing that the Warriors don’t have right now? — Klay Thompson, 27. Where has he been in the postseason? Warriors fans, I’ll give it to you, Thompson is one of the greatest shooters in the NBA. However, he hasn’t been performing that way during this year’s Finals. His numbers are lower than last year’s averages during this postseason, and with all do respect, I think he’s in a bit of a funk; which has me thinking that he may be less of a threat for the Cavs on defense.\n\nAnd, speaking of less threats… Warriors fans are probably praying that Draymond Green, 27, is on his best behavior heading into the Finals. Let’s not forget about last year, when he was suspended for Game 5, for appearing to slap LeBron in the groin in Game 4. Clearly, attitudes are key in the Finals, and the Cavs have their heads on a bit tighter this year.\n\nHere’s my thing — People continue to doubt the best player in the league, LeBron and the army behind him. Yes, Golden State will be a challenge and yes, they have four All-Star players; But, the Cavs also have three as well. I think the real hype is on Golden State, because some people have given Curry this persona that he somehow, someway needs to seek revenge, or redeem himself. UM, redeem himself from what, exactly? [And, here is where I defend Steph for a hot second]. Why on earth would the 2-time MVP have to prove anything to anyone? The man is only 29-years-old, has a ring, AND shooting records that have set the bar at an unrealistic level that league has ever seen. And, he’s the best point guard in the league; behind Kyrie Irving, of course. Come on, I’m a Cavs fan, remember?\n\nGame 1 kicks off Thursday, June 1 in Oakland, California, at 9 PM ET. And, you can catch all of the action, right here at HollywoodLife.com! So, HollywoodLifers, let’s chat — Who’s your pick to take it all?", "images": ["https://s3.amazonaws.com/heartbeat.pmc.com/track?host=hollywoodlife.com&path=%2F2017%2F06%2F01%2Fnba-finals-predictions-2017-cavaliers-warriors-picks-who-will-win%2F&ct=article&lob=hollywoodlife&loc=us&env=desktop&post_id=2612433", "https://i1.wp.com/www.rollingstone.com/wp-content/uploads/2020/04/nomad-pipe-1.jpg?resize=230%2C135&ssl=1", "https://pmchollywoodlife.files.wordpress.com/2017/05/lebron-james-will-dominate-trilogy-lead.jpg", "https://pixel.wp.com/b.gif?v=noscript", "https://pmchollywoodlife.files.wordpress.com/2020/04/kenya-moore-expose-nene-leakes-rhoa-reunion-bravo-ftr.jpg?w=143&h=80&crop=1", "http://pixel.quantserve.com/pixel?a.1=p-6fKiDaopTGEQg&a.2=p-31f3D02tYU8zY", "https://pmctvline2.files.wordpress.com/2020/04/drag-race-recap-2.jpg?resize=230%2C135", "https://pmchollywoodlife.files.wordpress.com/2020/04/kylie-jenner-skims-rex-ftr.jpg?w=143&h=80&crop=1", "https://scstylecaster.files.wordpress.com/2015/12/glowing-skin-cleanser.jpg?resize=230%2C135", "https://pmchollywoodlife.files.wordpress.com/2017/06/jenna_lemoncelli.jpg?w=64&h=64&crop=1", "https://pmchollywoodlife.files.wordpress.com/2018/06/hl_logo.png?w=128", "https://pmchollywoodlife.files.wordpress.com/2020/04/denise-richards-charlie-sheen-daughters-backgrid-mega-ftr.jpg?w=143&h=80&crop=1", "https://i2.wp.com/www.sheknows.com/wp-content/uploads/2020/04/Kobe-Gianna-Bryant.jpg?resize=230%2C135&ssl=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://i0.wp.com/www.indiewire.com/wp-content/uploads/2020/04/Home_Photo_010102.jpg?resize=230%2C135&ssl=1", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://pmchollywoodlife.files.wordpress.com/2017/05/lebron-james-will-dominate-trilogy-lead.jpg", "keywords": [], "authors": ["Jenna Lemoncelli", "Kristyn Burtt", "Lana Parker", "Andy Swift", "Brandt Ranj", "Tyler Hersko", "News Editor"], "canonical_link": "https://hollywoodlife.com/2017/06/01/nba-finals-predictions-2017-cavaliers-warriors-picks-who-will-win/", "title": "NBA Finals: Why LeBron & The Cavaliers Will Win The Title", "meta_data": {"description": "The wait is over! The 2017 NBA Finals are here and HollywoodLife.com has our predictions ready. Here's why the Cavaliers will win!", "news_keywords": "LeBron James, NBA Finals, NBA Playoffs", "apple-itunes-app": "app-id=1400650284", "generator": "WordPress.com", "og": {"type": "article", "title": "NBA Finals: Why LeBron & The Cavaliers Will Win The Title", "url": "https://hollywoodlife.com/2017/06/01/nba-finals-predictions-2017-cavaliers-warriors-picks-who-will-win/", "description": "The wait is over! The inevitable Cavs-Warriors Finals matchup is here for the third year in a row. And, I’m here to tell you why the Cavs will take the Larry O’Brien gold back to Clevel…", "site_name": "Hollywood Life", "image": {"identifier": "https://pmchollywoodlife.files.wordpress.com/2017/05/lebron-james-will-dominate-trilogy-lead.jpg", "width": 600, "height": 784, "alt": "LeBron James & Draymond Green"}, "locale": "en_US"}, "article": {"published_time": "2017-06-01T19:12:53+00:00", "modified_time": "2017-07-14T02:45:55+00:00"}, "twitter": {"site": "@HollywoodLife", "text": {"title": "NBA Finals: Why LeBron & The Cavaliers Will Win The Title"}, "image": {"identifier": "https://pmchollywoodlife.files.wordpress.com/2017/05/lebron-james-will-dominate-trilogy-lead.jpg?w=600", "alt": "LeBron James & Draymond Green"}, "card": "summary_large_image", "creator": "@https://twitter.com/jennalemoncelli", "title": "NBA Finals: Why LeBron & The Cavaliers Will Win The Title", "description": "The wait is over! The 2017 NBA Finals are here and HollywoodLife.com has our predictions ready. Here's why the Cavaliers will win!"}, "author": "Jenna Lemoncelli", "fb": {"pages": 94724837471}, "application-name": "Hollywood Life", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Latest Hollywood Celebrity & Entertainment News", "msapplication-task": "name=Subscribe;action-uri=https://hollywoodlife.com/feed/;icon-uri=https://pmchollywoodlife.files.wordpress.com/2018/06/hl_logo.png?w=16", "onesignal": "wordpress-plugin", "msapplication-TileImage": "https://pmchollywoodlife.files.wordpress.com/2018/06/hl_logo.png?w=128"}, "movies": [], "publish_date": 1496246400.0, "source": "http://hollywoodlife.com", "summary": ""}