{"url": "www.celebritynetworth.com/richest-celebrities/actors/dean-mcdermott-net-worth/", "text": "Dean McDermott Net Worth: Dean McDermott is a Canadian-American actor who has a net worth of $500 thousand. Dean McDermott earned his net worth through his many roles in movies and TV. He was born in Toronto, Ontario, Canada and is the husband of Tori Spelling. McDermott reached the peak of his fame in the mid 1990's when he was considered to be the greatest screen heartthrob. Having appeared in more than 30 movies and 15 TV productions, he is best known for his portrayal of Constable Turnbull on the TV series Due South (CTV, 1995-96) and for his intriguing performance in Lives of Girls and Women (CBC Television, 1994). However, he first rose to fame for his whirlwind affair with actress Tori Spelling, which instantly hit the headlines since both of them were still married at the time. Once they split from their spouses, Dean and Tori tied the knot a month after they met in 2006. Next, the newlywed couple found fresh fame into the reality series Tori & Dean: Inn Love (Oxygen, 2007-08) and Tori & Dean: Home Sweet Hollywood (Oxygen, 2008- ). The success of these two shows led McDermott to became a household name and to gain a whole new legion of fans. As of recent, he was the winner of Team Guy on the second season of Food Network's Rachael vs. Guy: Celebrity Cook-Off. He hosted the first two seasons of Chopped Canada on Food Network Canada. Spelling and McDermott are still together and have four children.\n\nFinancial Situation: In October 2013, Tori made the shocking announcement that she was broke and had squandered away every penny she had ever made to the point where she was borrowing money from her mother to pay rent and could not afford a simple medical procedure for her husband. Spelling claimed to have blown through every dollar she ever made acting or inherited from her late father (an estimated $15 – $20 million). In an interview, Spelling claimed to have blown through millions of dollars on failed real estate investments and lavish purchases for her family. When asked about her exact net worth Tori replied \"I don't have one million dollars. We had some income here and there, but no savings apart from our retirement accounts.\" To be fair, Tori's husband Dean clarified her statements the next day by telling US Magazine that \"Right now things are going well. Tori and I are doing just fine financially\". In March 2017, City National Bank filed a lawsuit against Tori and Dean after they failed to pay off $200,000 out of a $400,000 loan. City National also claims that Tori overdrew $17,000 from her checking account. Meanwhile, while that lawsuit was going on Dean was also being sued by his ex for $100,000 in owed child support. A few months earlier the couple was sued by American Express for $87,000 in credit card debt and $260,000 in unpaid taxes.", "images": ["https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "http://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "http://googleads.g.doubleclick.net/pagead/viewthroughconversion/1057081139/?value=0&guid=ON&script=0", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/wp-content/uploads/2010/07/GettyImages-150882727.jpg"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2010/07/GettyImages-150882727.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/dean-mcdermott-net-worth/", "title": "Dean McDermott Net Worth", "meta_data": {"description": "Dean McDermott Net Worth: Dean McDermott is a Canadian-American actor who has a net worth of $500 thousand. Dean McDermott earned his net worth", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "cnw_share_fb_count": 119, "cnw_share_tw_count": 30, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Dean McDermott Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/dean-mcdermott-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/07/GettyImages-150882727.jpg", "site_name": "Celebrity Net Worth", "description": "Dean McDermott Net Worth: Dean McDermott is a Canadian-American actor who has a net worth of $500 thousand. Dean McDermott earned his net worth"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2017-03-16T20:31:01+00:00", "published_time": "2010-07-02T01:15:39+00:00", "section": "Actors", "tag": "tori spelling net worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/07/GettyImages-150882727.jpg", "title": "Dean McDermott Net Worth", "description": "Dean McDermott Net Worth: Dean McDermott is a Canadian-American actor who has a net worth of $500 thousand. Dean McDermott earned his net worth"}}, "movies": [], "publish_date": 1278033339.0, "source": "http://www.celebritynetworth.com", "summary": ""}