{"url": "https://www.usatoday.com/story/life/2017/08/30/how-princess-diana-aggravated-but-also-changed-royal-family-forever/539706001/", "text": "Princess Diana mystified and irked the British royals in life, but in death she changed them in ways that strengthened the monarchy by making them seem a bit more like her — warm, approachable, human.\n\nExhibit A has to be the 2012 London Olympics when Queen Elizabeth II, then 86 and celebrating 60 years on her throne, participated in an extraordinary video skit to open the Games, featuring James Bond actor Daniel Craig and \"the queen\" as a Bond girl skydiving from a helicopter into Olympic Stadium. Mouths dropped, especially those of her grandchildren, as tens of thousands of Brits watching cheered and roared.\n\nRELATED: Princess Diana remembered\n\n\"Would she have done that cameo had it not been for Diana, all those years earlier, who emboldened them to do things in a fresh way and be more relatable?\" says American biographer Sally Bedell Smith, who's written best-sellers about both the queen and Diana.\n\nThe Princess of Wales' feelings about the Windsors were as mercurial as she was, toggling between awe and admiration to rage and despair during the years she was the desperately unhappy wife of Prince Charles and the daughter-in-law of the queen and Prince Philip.\n\nAs the queen herself said at the time, there were \"lessons to be drawn\" from the story of Diana, and these are now apparent, says British PR consultant and royal commentator Richard Fitzwilliams.\n\n\"Diana's more approachable, endearing and emotional style, her conviction that the royal family had no heart, the way she appealed to the public in (interviews), all this was unique but had real impact,\" Fitzwilliams says. \"It is a tribute to the resilience of the Windsors that they have made certain changes yet kept the monarchy's mystique.\"\n\nDespite her troubles with her in-laws, Diana said she wanted to bolster the ties between the monarchy and the people; she was, after all, the mother of a future king.\n\n\"It's vital the monarchy keeps in touch with the people — it's what I try to do,\" she told former Times editor Peter Stothard at a lunch in 1994, according to Phil Dampier's new collection of Diana quotes, Diana: I'm Going to Be Me.\n\nBritish royal reporter and broadcaster Katie Nicholl, author of several royal biographies, says Diana broke the royal mold: She did and said things considered \"very un-royal\" that had a positive effect, especially in the way her sons, Prince William and Prince Harry, were raised to be aware of life beyond palace walls.\n\n\"As they have said in recent interviews they are the princes and the men they are today largely because of the way Diana raised them and the things that she exposed them to from an early age,\" Nicholl says.\n\n\"There is a rawness in these interviews, an openness that Diana would have approved,\" says Fitzwilliams. \"The princes are following directly in her footsteps.\"\n\nDiana campaigned for \"politically sensitive\" causes not previously connected to the royals, including AIDS, homelessness and landmines — issues that touched real people and people who had no voice, Nicholl says.\n\n\"Ultimately, this was all very positive for the royal family even though the queen and others were concerned at points that some of the issues Diana was campaigning for weren’t synonymous with what royals should be doing,\" Nicholl says. \"To the people, Diana was seen as in touch. She was a princess, but one who wasn’t afraid to roll up her sleeves and get stuck in and that did the royal family a huge amount of good.\"\n\nNo doubt the 1,000-year-old British monarchy already knew a thing or two about keeping in touch with the people (to do otherwise risked execution and exile over the centuries), but it was Diana — equal parts beguiling and bewildering — whose shocking death helped remind them of this fundamental survival skill.\n\nAfter she was killed in a Paris car crash in 1997, an almost-as-shocking tsunami of grief washed over Britain and the world, and nearly swamped the royals.\n\nTucked away at their usual summer bastion of Balmoral, their vast estate in Scotland, they were unprepared for the unprecedented reaction back in London: The hysteria, the headlines, the 24/7 media coverage. Also, the persistent importuning, from then-Prime Minister Tony Blair and many others, that the queen return, respond to the public grief, and put on a semi-royal funeral for Diana.\n\n\"The queen has an unchanging style which has been perfection; the death of Diana was the one occasion where reliance on tradition and precedent were not appropriate and Blair was fortunately there to advise her,\" Fitzwilliams says.\n\nThe queen met all the demands and more, after first balking. She rose to the occasion with a stirring live speech to the nation (a rarity) before the funeral in which she paid tribute to Diana.\n\nIn deed and metaphor, the queen bowed her head to Diana's coffin, and it was sincere. Diana was no longer a member of the royal family, and she had behaved in obnoxious ways in the years before her 1996 divorce, but she was still the mother of the queen's young grandsons; this was a gesture no loving grandmother would withhold.\n\n\"Diana had a real effect on the monarchy,\" Smith says. \"They realized, in their practical and efficient way, that Diana had touched people in a special way, in accessibility and informality. They commissioned research, polling, focus groups, and they responded, not in a dramatic way, but in an incremental way. The queen did things a little more informally, she loosened protocol.\"\n\nImmediately, public opinion about the queen and her family swung back to its previous high levels. In the years since Diana's death, the royals have been more popular than ever, culminating in extravagant displays of affection for the queen during her Diamond Jubilee in 2012 and for her 90th birthday in 2016.\n\nEven Prince Charles and his second wife, Camilla, Duchess of Cornwall, the longtime mistress Diana blamed for her marital woes, are popular (if only because they are not as widely despised as they were in 1997).\n\nVictoria Arbiter, daughter of the queen's former press secretary and a royal commentator for CNN in New York, says \"little glimpses of Diana\" are everywhere apparent today. But she also gives credit to the queen.\n\n\"You can't take anything away from the queen and her ability to adapt and evolve and meet the needs of the people at any one time,\" Arbiter says. \"Diana should be credited with many changes, one of which is the royal family is very much more hands on. They're getting much more involved on a visceral level as a result of Diana.\"\n\nSociety's expectations have changed, Arbiter says. The deference and formality associated with the royals are disappearing. You might not see the queen sipping tea in a Starbucks, but she's no longer quite as remote as she once was.\n\n\"It's been slow, gradual change,\" Arbiter says, \"and Diana was definitely the trigger.\"\n\n\n\n\n\n.", "images": ["http://www.gannett-cdn.com/-mm-/555d835bae75a8b7133bad64912096ce67cc17fa/c=0-410-1645-1339&r=1280x720/local/-/media/2017/08/07/USATODAY/USATODAY/636376959968085403-DIANA-MUG-60599350.JPG?width=660&height=372&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/sites/usatoday/images/footer-logo@2x.png"], "top_img": "https://www.gannett-cdn.com/sites/usatoday/images/footer-logo@2x.png", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/2017/08/30/how-princess-diana-aggravated-but-also-changed-royal-family-forever/539706001/", "title": "How Princess Diana aggravated but also changed the royal family forever", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "How Princess Diana aggravated but also changed the royal family forever", "description": "The royals didn't understand her, they sometimes didn't like her but in the end they were changed by Diana.", "url": "https://www.usatoday.com/story/life/2017/08/30/how-princess-diana-aggravated-but-also-changed-royal-family-forever/539706001/", "site_name": "USA TODAY", "image": "https://www.gannett-cdn.com/sites/usatoday/images/footer-logo@2x.png", "type": "article"}, "article": {"author": "Maria Puente", "content_tier": "free", "opinion": "false"}, "description": "The royals didn't understand her, they sometimes didn't like her but in the end they were changed by Diana.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "site": "@usatoday", "creator": "@usatoday", "title": "How Princess Diana aggravated but also changed the royal family forever", "description": "The royals didn't understand her, they sometimes didn't like her but in the end they were changed by Diana."}}, "movies": [], "publish_date": 1504022400.0, "source": "https://www.usatoday.com", "summary": ""}