{"url": "https://www.dailymail.co.uk/femail/article-4793014/I-met-guy-call-Highness.html", "text": "Marking the 20th anniversary of her death, the Daily Mail's Weekend magazine still has one more unmissable tribute to come\n\nAdvertisement\n\nOver the past three weeks in our groundbreaking series to mark the 20th anniversary of Diana’s death, The Daily Mail's Weekend magazine brought you dozens of glorious photographs from her unseen album as well as the real stories behind her affairs, the disintegration of her marriage and her bitter rivalry with Camilla.\n\nNow Richard Kay and Geoffrey Levy, who have spent months talking to her closest friends, her family and those she confided in, many of whom only now feel able to speak freely for the first time, reveal her excitement as her fledgling relationship with Charles developed into a fairy-tale romance that captivated the nation, and how she yearned for more children after the births of William and Harry.\n\nDon’t miss the concluding part of this fascinating series in the Mail next Saturday, as Kay and Levy explore the final fateful hours before her death in Paris.\n\nThe Ghillies Ball is a twice-yearly knees-up for gamekeepers and staff in the ballroom at Balmoral Castle which the Queen holds in the late summer.\n\nIt is an evening of unbridled enthusiasm for the Royal Family. It’s where they can let their hair down and join in the vigorous Scottish dancing, the perfect setting for the newest member of the family, dance-mad Diana, settling into her role of Princess of Wales. It was a night no one who was there has ever forgotten.\n\nFor Darren McGrady, then a young sous chef in the royal kitchen, it was his first Ghillies Ball and he recalls, ‘Everyone was doing eightsome reels and the royals formed a circle – the Queen, Andrew, Edward, Diana and Charles.\n\nCharles and Diana liked this picture of five-year-old William and Harry, almost three, so much they used it for their 1987 Christmas card\n\nDiana was screaming as she and Charles were spinning around as fast as they could go. He was red-faced with a big grin and she was spinning him and everyone stopped to watch. There was a magic between them that night, a chemistry.’\n\nDiana was in her element. At one stage McGrady, who went on to become the Queen’s pastry chef before working for the princess, found himself being dragged by her onto the dance floor despite his objections.\n\n‘I can’t dance, Your Royal Highness,’ protested McGrady, who was a year younger than Diana. ‘I know,’ she shot back, ‘but this will be fun.’ And with a grinning Charles looking on, away they charged.\n\nNo one witnessing Diana’s carefree joy that Balmoral night in 1982, and the sheer electricity that fizzed between her and Prince Charles, could possibly have known the anxieties that gnawed inside the princess, nor could they have foreseen the troubled future unfolding before this apparently blissful couple.\n\nDiana’s first encounter with Prince Charles. He was dating her older sister Lady Sarah and was a guest for a shoot at Althorp, the Spencer family home, in the winter of 1977\n\nCertainly, as staff and royals dispersed after that intoxicating ball, all the talk was of happy days ahead.\n\nWhat that memorable night reveals is that there were periods of great joy and fulfilment for Diana and Charles, whose picture, cut from a magazine when she was a teenage schoolgirl, she pinned on the wall of her dormitory.\n\nIt begs the question that has been asked a million times in homes throughout Britain: what might have been for Charles and Diana had Camilla Parker Bowles, the older woman who first beguiled the prince when he was 23, been selfless and strong enough to walk away?\n\nCertainly, no one could have realised that they were witnessing the opening scenes of a unique drama when the 19-year-old Lady Diana Spencer burst excitedly into her bachelor-girl apartment in Coleherne Court, on the border of Chelsea and Earl’s Court, on a Sunday evening and announced to her three flatmates that she’d met a chap…\n\nOne of the three, Virginia Pitman, vividly recalls that moment 37 years ago. ‘Just as I would be saying, “Oh my God, I met this guy last night”, Diana was going, “Oh my God I met this guy at the weekend but I have to call him Your Highness.”\n\nIt was actually true,’ says Virginia, now Mrs Clarke, and living near Andover in Hampshire with husband Henry and two children and two stepchildren. ‘She did have to call him that because that was what everybody was calling him. That was how you talked to him.’\n\nOnly then did the penny drop, and the girls realised that Diana, who was nannying and house cleaning to earn money, was talking about her romance with the future king.\n\nAs for the weekend meeting to which Diana was referring, this was the country house summer barbecue in Petworth, West Sussex, where Diana and Charles famously sat side by side on a bale of hay, talking. By the evening she was sitting on his knee.\n\nA demure Diana, age 20, is pictured just two months before the royal wedding to Charles in 1981\n\nAugust 1980 and Charles, captivated by Earl Spencer’s youngest daughter, has invited Diana to join him for Cowes Week on the Isle of Wight\n\nThey were guests at the home of the late Commander Robert de Pass, a polo-playing friend of Prince Philip, and his wife Philippa, who was, and still is, a lady-in-waiting to the Queen.\n\nTheir son Philip had invited Diana for the weekend – though he admits now he ‘didn’t really know her terribly well’ – offering the tempting titbit that the Prince of Wales would also be coming.\n\nAs the daughter of Earl Spencer, a former equerry to both the Queen and King George VI, and having been brought up in a house on the Sandringham estate, Diana was familiar with the Queen’s younger children, especially Andrew, 18 months her senior, on whom she’d had an early teenage crush. Da\n\nBut she had only consciously met Charles once before, when she was 16. That was the weekend three years earlier when he and his pet labrador Harvey arrived at Althorp, in Northamptonshire, the Spencer family seat where they had been living since her father succeeded to the earldom in 1975, for a pheasant shoot.\n\nShe was deputed by her father to show the prince round Althorp’s picture gallery. At that time Charles, then 29, was courting her elder sister Lady Sarah – a romance which never caught fire and was soon to fizzle out. (Lady Sarah, now 62, has been happily married to farmer and landowner Neil McCorquodale since 1980 and has three children.)\n\nThat shoot at Althorp remains indelibly inscribed in the mind of Penny Walker, Diana’s former schoolteacher at West Heath, her boarding school at Sevenoaks in Kent, because Diana returned after the weekend proclaiming, ‘I’ve met him! At last I’ve met him.’\n\nDiana spent time with her flatmate Virginia Pitman three weeks before the engagement\n\nHer days as a single girl are coming to an end and Diana carries her record player away from her flat at Coleherne Court just weeks before the marriag\n\nMrs Walker was not altogether surprised at the excitement as she had noticed that Diana had pictures of the Prince of Wales pinned up in her cubicle and had often talked of meeting him. ‘I’m not sure there was any talk about marrying, but she just seemed completely besotted,’ Mrs Walker says.\n\nFor her teachers it was all rather amusing. From a very young age it had been Prince Andrew with whom Diana had played in the school holidays. She referred to him as ‘my friend’.\n\nAnd it was photographs of the Queen’s second son which could usually be seen spread out in front of her on her school desk. ‘When I grow up,’ Diana one day announced to the Rev Reginald Sweet, chaplain at her previous boarding school, Riddlesworth Hall near Thetford, Norfolk, where she went at the age of nine, ‘I’m going to marry Prince Andrew.’\n\nWho knows how different so many things might have been had she done so. But with the advance of Diana’s teenage years, Andrew had been replaced by Charles in her romantic daydreams.\n\nAnd now, having just had her 19th birthday, she found herself actually sitting next to him at the de Pass family barbecue, talking. No wonder she could hardly contain her excitement when she got back to her flat at Coleherne Court and was telling the girls all about it.\n\nFor his part, the heir to the throne, four months short of his 32nd birthday, found himself very impressed by her. He was deeply touched by the unusual sensitivity and compassion of one so young as she talked about how sad he had appeared at the funeral of Earl Mountbatten, his beloved great-uncle murdered by a remote-controlled IRA bomb the previous August on his fishing boat in Ireland. In particular, Charles was moved at how she had sensed his loneliness and his need for someone to care for him.\n\nDiana was pictured with boyfriend Adam Russell a year before she met Charles. It was said that ‘The girl he marries must have no former lovers who may kiss and tell’\n\nBefore long Diana’s flatmates were hearing all about the blossoming relationship between her and the Prince of Wales. The three-bedroom flat on the corner of Old Brompton Road and The Little Boltons became the nerve centre of the secret romance. But outwardly, life went on as normal.\n\nDiana, who was bought the flat by her mother, Frances, and charged the girls £18 a week rent, continued to work at a kindergarten three days a week plus two days nannying Patrick, infant son of American Mary Robertson, who lived in Belgravia. She also earned £1 an hour in her spare time cleaning her sister Lady Sarah’s flat round the corner.\n\nThis was the unlikely setting for one of the great tragic stories of our time.\n\nLady Diana could hardly contain herself with the thrill of the romance. She shared it all, step by step, with the girls. In addition to Virginia, there was old school friend Carolyn Pride, now the wife of party organiser William Bartholomew and a mother of two as well as being Prince Harry’s godmother.\n\nThe third flatmate was Annie Bolton, who married Noel Hill, son of Prince Charles’s former polo coach, and lives with their two children on a 40,000-acre cattle station in Queensland, Australia, where Harry spent part of his gap year working in 2003.\n\nGallant schoolboy Nicholas Hardy asked the princess-to-be, ‘May I kiss the hand of my future Queen?’ as Diana arrived in Cheltenham with Charles while getting to know Gloucestershire ahead of her wedding in March 1981. ‘I don’t know about that,’ Diana replied, by which time he’d already done it – to the sniggering of his fellow pupils\n\n‘No amount of arranging in the world could have induced Diana to marry Charles if she had not loved him,’ declares Mrs Clarke. Charles and Diana (pictured) at their engagement announcment\n\nDisplaying that shy-Di look as she poses with Charles on a pre-wedding visit to Balmoral\n\nVirginia and Carolyn shared a bedroom, while Diana and Annie each had their own. So, alongside the commonplace problem of having one bathroom, the four girls found themselves sharing the secrets of an evolving 20th-century fairy tale. ‘Diana was very keen on the prince,’ recalls Virginia, now 57.\n\n‘She thought he was marvellous. He was obviously wiser and older, and she was young and enthusiastic, very vivacious and chatty. I remember it as a happy time. From what I could see and from what she told me, she went in there [into Prince Charles’s life] a little bit like a tornado.’\n\nBut, clearly, this could never be an everyday romance. As Virginia recalls, ‘I think it was hard for them because it wasn’t “normal”. They couldn’t just pop out to the cinema, whereas if you take William and Kate, they had the opportunity to lead a proper life and therefore have a proper romance.\n\nThey also had a deep and knowledgeable friendship before it went any further whereas Diana and Charles, I felt, didn’t have that opportunity at all.’\n\nDiana is about to embark on her honeymoon cruise aboard the Royal Yacht Britannia from Gibraltar. But when she and Charles were next seen in Egypt they’d already had their first post-wedding row over his cufflinks from Camilla\n\nVirginia has, in fact, put her finger on a key flaw in the romance of Lady Diana Spencer and the Prince of Wales – they were to make their marriage vows without ever having had the time to get to know each other properly.\n\nDiana was acutely aware of this on her wedding day, and bitterly regretted it always. Indeed, we can reveal that she confided in her friend, Argentine-born fashion consultant Roberto Devorik, that when she explained her fears to her father, the late 8th Earl Spencer, he consoled her, saying, ‘Things will change. He [Charles] will get to know you.’\n\nToday it’s largely forgotten, but Charles was far from being Diana’s first boyfriend. There was Adam Russell – a great-grandson of Prime Minister Stanley Baldwin and now a deer farmer in Dorset, Guards officer Rory Scott, now married with children, whose shirts she chastely washed at the flat, and George Plumptre, now chief executive of the National Gardens Scheme, who used to take her to the theatre.\n\nBut none of them was ‘serious’, a factor crucially important to Charles. His mentor Lord Mountbatten’s advice had been that the girl he married should have no ‘past’, in other words, no former lovers who may be tempted to ‘kiss and tell’. Diana fitted the bill perfectly.\n\nShe had not been in love before. She had, as she put it to a friend, ‘kept herself tidy’. As Devorik bluntly puts it, ‘She was a virgin when she married. So young and totally inexperienced.’ What pleased Charles most of all was the thought that he would not only be her first love but her last.\n\nBarely two weeks after the barbecue, at Cowes Week, he told a close friend that he had met the girl he intended to marry. In fact she was there – he’d invited Diana to join his house party aboard the Royal Yacht Britannia.\n\nWhile he windsurfed, she water-skied. The friend’s advice was for him to keep the matter to himself until he was sure. What he was saying dovetailed with the assurances given to Diana by her father, that all they needed was time. But was this true? Certainly, Charles was under pressure, as he saw it, from Prince Philip to make up his mind.\n\nBack in the flat, excitement was rising as the world’s media, entranced by the idea of the nursery school assistant marrying the heir to the throne, camped outside. In fact, as Virginia recalls, the romance was a fairly standard progression from ‘I kissed him’ to ‘Wa-hey, we are going out for dinner’.\n\nUnlike other boyfriends, the prince never came round to the flat. But Diana kept nothing secret from them, and they loyally kept what they knew to themselves. These were exciting, jolly times at Flat 60, filling Virginia with nostalgia. ‘When I think of her today,’ she says emotionally, ‘I think of her laugh – it was a naughty laugh, a booming, wonderful laugh.’\n\nIn February 1981, seven months after their hay-bale encounter, the prince invited her to Windsor Castle and proposed. In accepting, Diana told him she was ‘in love’ with him. He bumblingly replied with a curious phrase that rather shook her and shocked millions later when he repeated it during their first television engagement interview – ‘whatever “in love” means’.\n\n‘Diana was undoubtedly in love with him,’ says her old nanny Mary Clarke. ‘He was the man she had been waiting for all her life, someone she could marry knowing that divorce was impossible.\n\nShe couldn’t forget that Charles had told her she was chubby\n\nShe had made a vow never to be divorced as a child after going through all the tumult of her parents’ separation and divorce when she was six.’ What especially attracted her about Charles was something he had said years earlier in an interview about marriage: ‘In my position obviously the last thing I could entertain is getting divorced.’ Indeed, almost the first thing Diana, aged nine, told nanny Clarke when she arrived to look after the four Spencer children was, ‘I shall only get married when I am sure I’m in love so that we will never be divorced.’\n\nNow that little girl was slipping into her perfect future. There were murmurings of an ‘arranged marriage’ – not least from the late Archbishop of Canterbury Robert Runcie who married them at St Paul’s Cathedral – but Mrs Clarke, these days living quietly in Canada, dismisses them.\n\n‘No amount of arranging in the world could have induced Diana to marry Charles if she had not loved him,’ declares Mrs Clarke, who was still in touch with Diana until shortly before her death. ‘That remains at the heart of the sadness of her life. All Diana ever wanted was to make a picture-book home with a loving husband and children – a ‘nest’, she called it.\n\nI know how proud and thrilled Diana would have been at William’s choice of wife. His marriage is wonderful. The way they are so together and secure is everything Diana wanted. And how she would have loved those grandchildren.’\n\nCharles slips an arm round Diana’s waist during a visit to Tetbury in 1981. Earlier in the engagement he had done just that and remarked on her weight\n\nDiana is led down the aisle of St Paul’s Cathedral by her father Earl Spencer on the day of her wedding to Prince Charles, 29 July 1981. Elizabeth Emanuel, who made her wedding dress, said that Diana lost six inches around her waist between her first and last fittings, shrinking to a slender 23 inche\n\nFor the moment everything was perfect in Diana’s world. She raced back to Coleherne Court and declared, ‘Guess what?’ They cried out, ‘He asked you?!’ Diana replied, ‘He did. And I said, “Yes please!”’ The girls hugged her with kisses, and some tears, and someone opened a bottle of champagne. But the engagement was still a secret, and all of them maintained omerta until the official announcement three weeks later. ‘We were all very excited,’ Virginia recalls. ‘It was quite other-worldly.’\n\nReality cut in, however, the night before the announcement when Diana packed her things and was collected by a police bodyguard who drove her to her new temporary home, Clarence House, where the Queen Mother lived. Charles wasn’t there to greet her.\n\nIn fact there was no welcoming member of the Royal Family. A servant showed her to her bedroom on the first floor. There, a letter was lying on the bed. A curiously warm and welcoming letter from someone she hardly knew, Camilla Parker Bowles.\n\nThe friendly note, which had been written several days before the engagement, invited her to lunch. For the moment Diana was absorbed in all the excitement of becoming engaged. She stayed briefly with the Queen Mother before moving across the road into Buckingham Palace, where she was given her own suite of rooms. But she was missing her flatmates.\n\n‘The sweetest thing I can remember is when she moved into Buckingham Palace,’ says Virginia. ‘She liked to invite us round there sometimes. We were there when her wedding veil arrived. I think it was Carolyn and me and Diana and we were taking it in turns trying it on and imagining what was coming. It was surreal, wandering around her bedroom in the palace wearing the veil.’\n\nThe giggling girls demanded of Diana, ‘How are you going to curtsy?... Are you going to go low?... How low can you go?’ Diana had to curtsy to the Queen at the top of the aisle in St Paul’s. On the day her curtsy was textbook. Textbook also was Prince Charles’s gesture to the girls in the flat. ‘He sent us a huge bouquet of flowers to thank us for our support,’ says Virginia. ‘That was really sweet.’\n\nA VERY IMPORTANT WAITER o one encapsulated the wedding euphoria more than Molimea ‘Ilolahia. He was a waiter for the King of Tonga and had met the Queen on her visits. Hearing of the royal wedding, he wrote to her private secretary Sir William Heseltine explaining that his greatest ambition was to serve at Buckingham Palace, if only for a day, and could he fix it. Sir William did, with the Queen herself. So on the eve of the wedding, when the Queen held a reception at the palace, Moli was there on duty, with a tray of drinks to hand out. ‘There were three reigning sovereigns present, as well as maharajahs, several de-throned monarchs and all of the Commonwealth governors-general,’ chuckles Sir William. ‘One of the VIPs was the president of Gambia [President Dawda Jawara] who was deposed while he was at the party. ‘But when the Queen came in, the first person her eye lit on was Moli and he was the first person she walked across the room to greet. All the assembled VIPs thought he must be some even higher VIP. But he was just a waiter.’\n\nMeanwhile, there was the matter of the dress itself. Diana chose the little-known designer couple David and Elizabeth Emanuel. She did not tell them at that first consultation in their Brook Street, Mayfair, salon that whatever waist measurement they took would be too big because she was going to lose weight, and lose weight she did.\n\nMost brides do slim down before their wedding, but with Diana there was a worrying sense of urgency. She could not get out of her mind that Charles had put his arm round her waist and humorously told her she was ‘chubby’. Actually, her waist was 29in, hardly big for a young woman almost 5ft 11in tall.\n\nBut by her wedding day it had shrunk to a slender 23in. ‘We did notice she was losing a lot of weight,’ says Elizabeth. ‘We weren’t concerned in any way because that was the norm. We put it down to bridal nerves. It didn’t even cross our minds that she could be anorexic.’\n\nThis was a worrying precursor to the eating disorder, bulimia, that was to plague her through much of her marriage. Flatmate Carolyn Pride put it down to her terror of the life she was stepping into.\n\nShe worried as she saw her friend getting ‘so thin’. Diana was nervous, but doesn’t this apply to all brides? But as was soon to emerge, Diana was already troubled by the shadow of Camilla. She had seen the signs that Mrs Parker Bowles, ostensibly an older woman trying to be helpful, meant more to Charles than she had thought.\n\nMeanwhile, the nation was gripped by royal wedding fever. Around this time there were also inner city riots in Brixton, Liverpool and Manchester. Sir William Heseltine, the Queen’s former private secretary, recalls motoring through Brixton in the aftermath of the riots.\n\nScores of buildings were burned and cars had been set ablaze. ‘Bizarrely, the fronts of shops were adorned with pictures of Charles and Di and bunting and flags – big posters of them in front of burned-out buildings,’ Sir William recalls. ‘It was amazing. This was 24 July and the wedding was on the 29th. I can’t remember if I told Charles and Diana but I certainly told the Queen.’\n\nIt was a beautiful wedding, no doubt about that, even though the estimated 750 million watching on television around the world had no idea that Diana didn’t really like the dress. Too voluminous – she felt ‘swamped’ in it – and it creased. Still, from a respectful distance, no one guessed. They looked so happy. She was radiant.\n\nEverything that Princess Margaret had told her had gone to plan. The Queen’s sister had taken her under her wing on the way to the wedding rehearsal and told her how to greet the clergymen she would meet, whose hands to shake and how to move on slowly down a receiving line. David Griffin, Margaret’s chauffeur for some 26 years, heard it all in the car as he drove them to St Paul’s Cathedral.\n\n‘Princess Margaret was very thorough,’ he remembers, ‘telling her how things would be, step by step. Diana took it all in. We had also taken Diana for some of her wedding dress fittings. Margaret was very helpful and her daughter Lady Sarah, just three years younger than the bride, was very excited about being a bridesmaid.’\n\nAnd so to the Queen’s post-wedding supper party at Claridge’s, where an extraordinary gathering was crowded around a flickering television screen put there so they could watch a video recording of the day’s events.\n\nThere is no better description than the words of Nicky Haslam, the waspish interior designer and man-about-town: ‘Besides the entire Royal Family and every king and queen regnant or exiled, there were Nancy Reagan, Princess Grace of Monaco, the Empress of Iran, the Crown Prince of Japan, archbishops, archimandrakes, princelings and potentates.\n\nThis extraordinary melange, these remnants of foreclosed kingdoms and endless lineage, sat cheek-by-jowl with the few who had survived, watching that film of a real-live fairy tale. It was the greatest party I’ve ever been to in my life.’\n\nWith the glowing Queen, the exalted group watched the newlyweds kiss on the Buckingham Palace balcony. Then the Queen stood up, beaming. ‘Supper,’ she called and led them all into the ballroom.\n\nCharles and Diana were long gone on the start of their lives together. They had arrived at Broadlands, home of the late Lord Mountbatten, to spend their wedding night in the Portico Room, with its views across the lawns to the River Test and its canopied four-poster bed whose previous honeymoon occupants had included the Queen and Prince Philip.\n\nCharles took with him a gift from Camilla, a pair of cufflinks monogrammed with their entwined initials ‘CC’. It would not be long before it emerged that all was not quite as it seemed.", "images": ["https://i.dailymail.co.uk/i/furniture/misc/logo_cookie_reg.png", "https://i.dailymail.co.uk/i/pix/2017/08/17/16/4344077200000578-4793014-Diana_s_first_encounter_with_Prince_Charles_He_was_dating_her_ol-a-37_1502983723195.jpg", "https://i.dailymail.co.uk/i/pix/2017/08/15/17/4344078400000578-4793014-image-a-168_1502813359469.jpg", "https://i.dailymail.co.uk/i/pix/2017/08/15/17/4344073600000578-4793014-image-a-176_1502813359965.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/27/20/42B5B25000000578-0-image-m-86_1501182921878.jpg", "https://i.dailymail.co.uk/i/pix/2017/08/08/16/4313BD0A00000578-0-image-m-55_1502206932922.jpg", "https://i.dailymail.co.uk/i/pix/2017/08/15/17/434407AA00000578-4793014-image-a-174_1502813359737.jpg", "https://i.dailymail.co.uk/i/sitelogos/logo_mol.gif", "https://i.dailymail.co.uk/i/pix/2017/08/17/16/4344078D00000578-4793014-August_1980_and_Charles_captivated_by_Earl_Spencer_s_youngest_da-m-42_1502983766404.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.dailymail.co.uk/i/pix/2017/08/15/17/434407AF00000578-4793014-image-a-163_1502813359275.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://i.dailymail.co.uk/i/pix/2017/08/17/16/4344078800000578-4793014-Charles_the_action_man_prince_shows_off_his_physique_in_a_wetsui-a-43_1502983772971.jpg", "https://i.dailymail.co.uk/i/pix/2017/08/15/17/4344079900000578-4793014-image-a-169_1502813359510.jpg", "https://i.dailymail.co.uk/i/furniture/facebook/DailyMail/DailyMail.png", "https://i.dailymail.co.uk/i/pix/2017/08/15/17/434407A600000578-4793014-image-a-171_1502813359641.jpg", "https://i.dailymail.co.uk/i/pix/2017/08/15/17/4344079500000578-4793014-image-a-177_1502814107383.jpg", "https://i.dailymail.co.uk/i/pix/2017/08/08/16/4311F57900000578-0-image-m-56_1502206599913.jpg", "https://i.dailymail.co.uk/i/pix/2017/08/15/17/434407A200000578-4793014-image-a-179_1502814228720.jpg", "https://i.dailymail.co.uk/i/pix/2017/08/15/17/434407B700000578-4793014-image-a-165_1502813359330.jpg", "https://i.dailymail.co.uk/i/pix/2017/08/15/17/4344079D00000578-4793014-image-a-172_1502813359642.jpg", "https://i.dailymail.co.uk/i/pix/2017/08/15/18/43470A7900000578-0-image-a-196_1502816979696.jpg", "https://i.dailymail.co.uk/i/pix/2017/08/17/16/434407B300000578-4793014-Diana_is_about_to_embark_on_her_honeymoon_cruise_aboard_the_Roya-m-36_1502982265394.jpg"], "top_img": "https://i.dailymail.co.uk/i/pix/2017/08/15/18/43470A7900000578-0-image-a-196_1502816979696.jpg", "keywords": [], "authors": ["Richard Kay", "Richard Kay And Geoffrey Levy For The Daily Mail", "Additional Reporting Emily Kent Smith", "Emine Sinmaz And Jane Slade", "Lisa Sewards", "Jackie Modlinger", "Richard Sears", "Picture Research Claire Cisotti"], "canonical_link": "https://www.dailymail.co.uk/femail/article-4793014/I-met-guy-call-Highness.html", "title": "Diana shared details of her love for Charles with friends", "meta_data": {"keywords": "dailymail,femail,Diana", "news_keywords": "dailymail,femail,Diana", "original-source": "https://www.dailymail.co.uk/femail/article-4793014/I-met-guy-call-Highness.html", "description": "Inside Saturday's Daily Mail you can find Weekend magazine's third special tribute issue as part of an unmissable five-week series marking the 20th anniversary of Princess Diana’s death.", "channel": "Lifestyle,Femail", "doc-class": "Living Document", "verify-v1": "DXwlrsxbqxSv+FTFkWUfgflBvFJfx2YbNf/HmABrVyY=", "msvalidate.01": "12E6B4B813EB44C9BFC8F6A21F1D01F5", "y_key": "1a7e912afbfcab2f", "MSSmartTagsPreventParsing": "true", "twitter": {"account_id": 15438913, "card": "summary_large_image", "title": "'I met this guy...but I have to call him Your Highness'", "description": "Inside Saturday's Daily Mail you can find Weekend magazine's third special tribute issue as part of an unmissable five-week series marking the 20th anniversary of Princess Diana’s death.", "url": "https://www.dailymail.co.uk/femail/article-4793014/I-met-guy-call-Highness.html", "image": "https://i.dailymail.co.uk/i/pix/2017/08/15/18/43470A7900000578-0-image-a-196_1502816979696.jpg", "app": {"id": {"iphone": 384101264, "ipad": 400442503}}}, "articleid": 4793014, "author": "Richard Kay", "divclasspage": "articlePage", "mol": {"headline": "'I met this guy...but I have to call him Your Highness': Diana shared every detail of her blossoming love for Charles with her friends, family and flatmates, now, they reveal the intoxicating excitement of those days"}, "article": {"publisher": "https://www.facebook.com/DailyMail", "published_time": "2017-08-18T23:32:17+0100", "modified_time": "2017-08-19T13:14:16+0100", "section": "Femail", "tag": "I met guy call Highness", "author": "https://www.facebook.com/DailyMail"}, "mobile-web-app-capable": "yes", "fb": {"app_id": 146202712090395, "pages": "1622758588037001,164305410295882"}, "og": {"site_name": "Mail Online", "title": "'I met this guy...but I have to call him Your Highness'", "type": "article", "description": "Inside Saturday's Daily Mail you can find Weekend magazine's third special tribute issue as part of an unmissable five-week series marking the 20th anniversary of Princess Diana’s death.", "url": "http://www.dailymail.co.uk/~/article-4793014/index.html", "image": {"identifier": "https://i.dailymail.co.uk/i/pix/2017/08/15/18/43470A7900000578-0-image-a-196_1502816979696.jpg", "width": 636, "height": 382}, "video": {"identifier": "https://videos.dailymail.co.uk/video/mol/2017/01/16/6741323965739321630/1024x576_MP4_6741323965739321630.mp4", "type": "video/mp4", "width": 636, "height": 358}}, "al": {"android": {"url": "dailymail-fb://article/4793014/", "package": "com.dailymail.online", "app_name": "Daily Mail Online"}, "ios": {"url": "dailymail-fb://article/4793014/", "app_store_id": 384101264, "app_name": "MailOnline"}}}, "movies": [], "publish_date": 1503095537.0, "source": "https://www.dailymail.co.uk", "summary": ""}