{"url": "https://people.com/tv/kristin-cavallari-husband-jay-cutler-home/", "text": "With a booming company, hit TV show and three young kids, Kristin Cavallari makes doing it all look like a breeze — but she couldn’t do it without her husband Jay Cutler.\n\n“We’ve definitely switched roles which has been really interesting, but it’s great,” Cavallari, 31, told PEOPLE at the Los Angeles pop-up of her store Uncommon James at The Grove. “I couldn’t do any of this without him. He’s home with the kids, picking the boys up from school and really allowing me to be able to have the time and freedom to do all this. He’s been really supportive.”\n\nGet push notifications with news, features and more.\n\nThe slower pace of life is a huge change for Cutler, 35, who up until 2017 had a nonstop football career. On the first season of Very Cavallari, the couple — who are parents to sons Camden, 6, and Jaxon, 4, and daughter Saylor, 3 — often joked about the athlete’s excess of free time.\n\n“I call him my farmhand because he’s been planting trees around the house. He’s been taking care of all the animals,” says Cavallari, who recently moved with her family into a new home in the Tennessee countryside. “I’m just giving him time. I’m not gonna pressure him. He worked his ass off for so many years, so I get that all he’s ever known is football. He’s gonna figure it out.”\n\nImage zoom Todd Williamson/Getty\n\nRELATED: Kristin Cavallari Explains Why She Keeps Her Money Separate from Jay Cutler’s\n\nThe former Dolphins quarterback quickly became a fan favorite on Very Cavallari thanks to his dry humor, and Cavallari says he’s now fully embraced his new role.\n\n“Coming from the football world where people didn’t get his personality, it’s been really nice for me and him [to have fans] appreciate him and see the real side of Jay,” she says. “He’s been having fun with the show. Now that he sees he had a really positive reaction, he’s been having a good time with it.”\n\nThough they often reference their three kids on the show, the couple choose to keep their children away from the spotlight — though they know exactly what’s going on.\n\n“We try to limit the time we shoot at home, and the boys are at school and Saylor takes a three-hour nap every day, but when they are home they love watching the monitors,” she says.\n\nRELATED: Kristin Cavallari Reminisces About When She and Jay Cutler Started Dating: ‘He Has No Game!’\n\nImage zoom Kristin Cavallari Courtesy Uncommon James\n\nUsually filming four days a week, Cavallari says shooting the show has been easier than expected. “The Hills was a breeze ’cause we filmed three days a week, and it was three scenes and very regimented,” she says about her former MTV home. “This isn’t bad either. It’s nice for me because I’m killing two birds with one stone. It’s about my company and these are my real employees. I go into the office and handle business, and there happens to be cameras there.”\n\nThe reality star recently launched Little James, a baby-focused spin-off of her brand Uncommon James, and Cavallari says she’s excited to outfit her friend’s children — including the Hills castmates like Heidi Pratt and Audrina Patridge.\n\nHer own kids are the fit models for the line, and “I really asked for their opinion,” adds Cavallari. “The great thing about them is they’re very opinionated … but they’re good sports about everything.”\n\nRELATED VIDEO: Kristin Cavallari Reveals the Only Two Laguna Beach Alums She Follows on Instagram\n\nWhen the reboot of The Hills airs next year, Cavallari says she’ll definitely be watching. “There’s a part of me that’s really sad I can’t be part of the show, but Heidi and I have joked that maybe we could swap an episode.”\n\nOne of the most beloved “villains” in reality show history, Cavallari is excited to just kick back this time and soak up everyone else’s drama. Says the star: “I’m curious. Who’s the villain? I want to see it all! I did it for too many years.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1631&h=854&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F11%2Fkristin-cavallari-jay-cutler-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F11%2Fkristin-cavallari-jay-cutler-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F11%2Fkristin-cavallari1-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1631&h=854&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F11%2Fkristin-cavallari-jay-cutler-2000.jpg", "keywords": [], "authors": ["Melody Chiu"], "canonical_link": "https://people.com/tv/kristin-cavallari-husband-jay-cutler-home/", "title": "Kristin Cavallari Says She and Husband Jay Cutler Have 'Switched Roles' at Home", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Celeb Relationships,Couples,Kristin Cavallari,News,Relationships,TV", "news_keywords": "Celeb Relationships,Couples,Kristin Cavallari,News,Relationships,TV", "description": "\"He's home with the kids and picking the boys up from school,\" says Cavallari", "og": {"title": "Kristin Cavallari Says She and Husband Jay Cutler Have 'Switched Roles' at Home", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/kristin-cavallari-husband-jay-cutler-home/", "description": "With a booming company, hit TV show and three young kids, Kristin Cavallari makes doing it all look like a breeze — but she couldn’t&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1631&h=854&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F11%2Fkristin-cavallari-jay-cutler-2000.jpg", "width": 1631, "height": 854}}, "pinterest": {"url": "https://people.com/tv/kristin-cavallari-husband-jay-cutler-home/", "description": "\"He's home with the kids and picking the boys up from school,\" says Cavallari", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F11%2Fkristin-cavallari-jay-cutler-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/kristin-cavallari-husband-jay-cutler-home/", "title": "Kristin Cavallari Says She and Husband Jay Cutler Have 'Switched Roles' at Home", "description": "\"He's home with the kids and picking the boys up from school,\" says Cavallari", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1631&h=854&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F11%2Fkristin-cavallari-jay-cutler-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}