{"url": "www.elle.com/culture/celebrities/a22221490/taylor-swift-joe-alwyn-breakup-speculation-necklace-nyc-outing/", "text": "Taylor Swift is embracing her old favorite hobby this week: modeling great outfits for New York paparazzi while leaving her Tribeca apartment. Her first solo walk was Sunday, and today, she was snapped leaving her place in a very floral print romper and Kate Spade snakeskin backpack. And after breakup rumors started spreading among fans, Swift also took the opportunity to make a statement about the status of her and Joe Alwyn's relationship through her necklace choice:\n\nSplash News\n\nGetty Images\n\nFans were worried that Alwyn and Swift had hit a rough patch when photos of her Sunday look—a Faith Connexion dress, Elie Saab sunglasses, a Stella McCartney bag, and Jimmy Choo knee-high boots (below)—very visibly didn't include Swift wearing her silver \"J\" pendant necklace, the one she appears to be wearing again today (above).\n\nSplash News\n\nSwift always wears the necklace as a tribute to her boyfriend and their so-happily-private romance. She explained everything about the necklace in her song, \"Call It What You Want\" with the lyrics, \"\"I want to wear his initial on a chain round my neck/Chain round my neck/Not because he owns me/But 'cause he really knows me.\" Swift told some fans that all of Reputation's love songs were about Alwyn.\n\nLaineyGossip pointed out that Sunday was just the second time Swift had been seen without her necklace; she also didn't wear it while performing last Tuesday in Maryland either. Maybe that meant something since Swift thinks about the details with her image; maybe it doesn't because it's just a necklace.\n\nSwift performs in Maryland last week, sans necklace. Getty Images\n\nBuzzfeed, meanwhile, noted that Swift didn't wear the pendant to the Billboard Music Awards in May, so it's not like this week was the first time in history she's ever publicly left the pendant at home. Also: She posted an Instagram (below) wearing it just four days ago. All in all, an abundance of evidence that the necklace is not any official sartorial indicator of her relationship health. It's not an engagement ring, and even those can come on and off without people breaking up.\n\nUp until the ultimately non-dramatic necklace saga, Alwyn and Swift's romance only made headlines for how happy, private, and well it's been going. Last week, photos came out of Swift and Alwyn holding hands on vacation in Turks and Caicos. Us Weekly ran a report seven days ago on how Swift was happier than ever with Alwyn, keeping things secretish. As a source told the outlet, the couple “vowed to keep their relationship to themselves. They’ve done everything they can to keep it that way.”\n\ni know that a relationship isn’t based off a necklace but i really hope taylor and joe are okay 🤷🏽‍♀️ — kerensa⁷ (@jjkafterglow) July 16, 2018", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/spl5010563-011-1531844934.jpg?crop=1.00xw:0.362xh;0,0.0116xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/spl5010563-011-1531844934.jpg?crop=1.00xw:0.362xh;0,0.0116xh&resize=1200:*", "keywords": [], "authors": ["Alyssa Bailey", "News", "Strategy Editor", "Alyssa Bailey Is The News", "Strategy Editor At Elle.Com", "Where She Oversees Coverage Of Celebrities", "Royals", "Particularly Meghan Markle", "Kate Middleton ."], "canonical_link": "https://www.elle.com/culture/celebrities/a22221490/taylor-swift-joe-alwyn-breakup-speculation-necklace-nyc-outing/", "title": "Taylor Swift Just Gave a Sneaky Response to the Internet's Joe Alwyn Breakup Speculation", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "Taylor Swift Just Gave a Sneaky Response to the Internet's Joe Alwyn Breakup Speculation", "description": "It's just a pendant. OR IS IT????", "url": "https://www.elle.com/culture/celebrities/a22221490/taylor-swift-joe-alwyn-breakup-speculation-necklace-nyc-outing/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/spl5010563-011-1531844934.jpg?crop=1.00xw:0.362xh;0,0.0116xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "modified_time": "2018-07-17 05:28:38", "published_time": "2018-07-17 05:28:00", "section": "Celebrity News 2020", "opinion": "false"}, "twitter": {"site": "@ELLEmagazine", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/spl5010563-011-1531844934.jpg?crop=1.00xw:0.362xh;0,0.0116xh&resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "Taylor Swift Responds to Joe Alwyn Breakup Speculation By Wearing J Pendant in New York City", "description": "Taylor Swift is embracing her old favorite hobby this week: modeling great outfits for New York paparazzi while leaving her Tribeca apartment. Her first solo walk was Sunday​, and today, she was snapped leaving her place in a very​ floral print romper and Kate Spade snakeskin backpack. Swift also took the opportunity to make a statement about the status of her and Joe Alwyn's relationship through her necklace choice after breakup rumors started spreading among fans.", "keywords": "joe alwyn, taylor swift, taylor swift boyfriend, taylor swift fashion, taylor swift j pendant, taylor swift joe alwyn, taylor swift joe alwyn breakup, taylor swift joe alwyn necklace", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/spl5010563-011-1531844934.jpg?crop=1.00xw:0.721xh;0,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Culture,culture,celebrities,taylor swift joe alwyn breakup,taylor swift j pendant,taylor swift joe alwyn necklace,taylor swift fashion,taylor swift boyfriend,taylor swift joe alwyn,joe alwyn,Taylor Swift", "sailthru.date": "2018-07-17T17:28:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/spl5010563-011-1531844934.jpg?crop=1.00xw:0.362xh;0,0.0116xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/spl5010563-011-1531844934.jpg?crop=1.00xw:0.721xh;0,0", "sailthru.socialtitle": "Taylor Swift Just Gave a Sneaky Response to the Internet's Joe Alwyn Breakup Speculation", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1531776480.0, "source": "https://www.elle.com", "summary": ""}