{"url": "www.cnn.com/2015/11/17/health/charlie-sheen-health/index.html", "text": "(CNN) Actor Charlie Sheen told NBC's \"Today\" show Tuesday that he was diagnosed as HIV-positive about four years ago, and that a few people who knew it demanded money from him to keep the secret.\n\n\"I'm here to admit that I am in fact HIV-positive,\" Sheen told NBC's Matt Lauer. \"And I have to put a stop to this onslaught, this barrage of attacks and of sub-truths and very harmful and mercurial stories that are about the [alleged] threatening the health of so many others, which couldn't be farther from the truth.\"\n\nSheen, 50, said he is not sure how he contracted the virus. Since his diagnosis, he said, he has informed every sexual partner of his condition. He called it \"impossible\" that he had transferred the virus to others.\n\nHe said the diagnosis came after he suffered a series of cluster headaches and night sweats.\n\n\"After a battery of tests ... they walked in the room and said, 'Boom, here's what's going on,'\" Sheen said.\n\n\"It's a hard three letters to absorb,\" he said. \"It's a turning point in one's life.\"\n\nPhotos: Charlie Sheen through the years Photos: Charlie Sheen through the years Charlie Sheen has been in the public eye almost as long as the 50 years he's been alive. The actor, seen here in 2013, has appeared in dozens of films, headlined a hit TV show, battled substance abuse, dated porn stars and made numerous headlines for his bad-boy behavior. Here's a look at Sheen's turbulent life and career. Hide Caption 1 of 16 Photos: Charlie Sheen through the years As the son of actor Martin Sheen, he had small parts in some of his father's films. The public may have first become aware of him as a thuggish visitor in a police station making conversation with Jennifer Grey in 1986's \"Ferris Bueller's Day Off.\" That same year, Sheen starred in Oliver Stone's Oscar-winning film \"Platoon,\" playing Chris, a soldier in Vietnam caught in a battle between Willem Dafoe and Tom Berenger. Hide Caption 2 of 16 Photos: Charlie Sheen through the years Sheen and Stone teamed up again in 1987 with \"Wall Street,\" in which Sheen played an up-and-coming broker seduced by Michael Douglas' Gordon Gekko. Douglas' performance won an Oscar, and Sheen's own stock went up. Hide Caption 3 of 16 Photos: Charlie Sheen through the years Sheen played relief pitcher Ricky \"Wild Thing\" Vaughn in the 1989 baseball comedy \"Major League.\" The box office hit led to a 1994 sequel, \"Major League II,\" also featuring Sheen. Hide Caption 4 of 16 Photos: Charlie Sheen through the years After becoming one of the hottest young actors of the '80s, Sheen saw his star dim in the '90s. Here he is in a poster for \"Men at Work,\" a minor comedy that starred him and brother Emilio Estevez as garbagemen who stumble on a nefarious plot. Hide Caption 5 of 16 Photos: Charlie Sheen through the years \"Terminal Velocity,\" a 1994 film in which he played a skydiving instructor, fared even worse. Critics wondered whether the film was a goof, comparable to Sheen's \"Hot Shots!\" parody series. It made just $17 million at the box office on a $50 million budget. Hide Caption 6 of 16 Photos: Charlie Sheen through the years By the mid-'90s, Sheen was as famous for being a ladies' man as he was for being a leading man. Known as \"the Machine,\" he dated porn stars, and though Hollywood madam Heidi Fleiss kept the names of her clients secret, Sheen testified during her tax-evasion trial that he'd used her services. He also spent time in rehab and was hospitalized for a drug overdose . \"Pray for my boy,\" said his father. \"He has appetites that get him into trouble.\" Hide Caption 7 of 16 Photos: Charlie Sheen through the years But after a well-received turn in 1999's \"Being John Malkovich\" -- in which he played, well, Charlie Sheen -- Sheen was cast as Michael J. Fox's replacement in the hit ABC show \"Spin City.\" Show creator Gary David Goldberg praised him. \"He's the first one on the set every morning and the last to leave at night,\" he said. The show ran until 2002. Hide Caption 8 of 16 Photos: Charlie Sheen through the years Sheen rose to the top again with \"Two and a Half Man,\" playing free-spirited jingle writer Charlie Harper. The show was one of the highest-rated on television, and Sheen soon became the highest-paid actor on TV, eventually making close to $2 million an episode. But a rehab stint shut down production in 2010, and he and show creator Chuck Lorre were soon at loggerheads. Sheen was fired after the eighth season. Hide Caption 9 of 16 Photos: Charlie Sheen through the years Sheen occasionally popped up in movies in the 2000s, though not of the level of his '80s work. Among them were \"Scary Movie 3,\" seen here with Denise Richards, \"Scary Movie 4\" and \"Scary Movie 5.\" Hide Caption 10 of 16 Photos: Charlie Sheen through the years In 2002, Sheen married Richards. The marriage produced two daughters but was rocky; Richards filed a restraining order against him in 2006 and filed for divorce while pregnant with their second child. Sheen later tried to block the appearance of their children on Richards' reality show and insulted her in the media, a habit he's continued to the present day Hide Caption 11 of 16 Photos: Charlie Sheen through the years Sheen's third marriage, to actress Brooke Mueller, was also contentious. The two married in 2008 and divorced three years later, time that included Sheen's arrest on suspicion of domestic abuse and rehab stints for both. A custody battle ensued after the divorce, but the two are getting along for now. Hide Caption 12 of 16 Photos: Charlie Sheen through the years The end of Sheen's marriage to Mueller and his firing from \"Two and a Half Men\" came in the midst of increasingly erratic behavior. He allegedly trashed a New York hotel room; he went on a radio show and criticized Lorre and Thomas Jefferson, among others; and he filed a lawsuit against Lorre and \"Two and a Half Men's\" studio, Warner Bros. Television. He joined Twitter and racked up a million followers in just over 24 hours -- a record, said Guinness . His tweets included the hashtags #winning and #tigerblood, both of which became catchphrases. He's shown here with publicist Stan Rosenfield, who resigned from that job in early 2011. Hide Caption 13 of 16 Photos: Charlie Sheen through the years In April 2011, he embarked on tour of his one-man show, \"My Violent Torpedo of Truth/Defeat Is Not an Option.\" The first show, in Detroit, went off the rails quickly. \"Early in the evening, before the crowd turned sour, there was a creepy atmosphere that suggested group indoctrination into a cult,\" said a Hollywood Reporter review . And that was before the booing and shouts of \"You suck\" started. He changed the style to a Q&A for the second show, but the tour never really caught fire. Hide Caption 14 of 16 Photos: Charlie Sheen through the years Still, Sheen had enough buzz that he was announced as the lead in \"Anger Management,\" a TV version of the 2003 movie. The series lasted two years on FX. Meanwhile, \"Two and a Half Men\" ended its run in 2015 with Sheen's character -- who had been assumed dead -- crushed by a piano Hide Caption 15 of 16 Photos: Charlie Sheen through the years Since \"Anger,\" Sheen has had a guest spot on \"The Goldbergs\" and has popped up occasionally on TMZ . In November 2015 he announced to \"Today's\" Matt Lauer that he is HIV-positive. The actor said the diagnosis had inspired him to retire his hard-partying ways. \"It's a turning point in one's life,\" he said. Hide Caption 16 of 16\n\nHe said he revealed the diagnosis to people he thought he trusted, but some of them demanded money to keep the information to themselves. He paid those people \"in the millions,\" he said. Later in the show, Lauer said that Sheen told him it was more than $10 million.\n\n\"We're talking about shakedowns,\" Sheen said. \"I've paid those people.\"\n\nOne of those people, he said, was a prostitute who entered his bathroom, took a cellphone picture of his medication and threatened to sell the image.\n\nAsked if he would continue to pay the people he'd been paying, he said: \"Not after today, I'm not.\"\n\n'Charlie does not have AIDS'\n\nSheen was joined on the show by his doctor, Robert Huizenga, an assistant professor of clinical medicine at UCLA ,and was asked directly if he had AIDS.\n\n\"Charlie does not have AIDS,\" Huizenga said. \"AIDS is a condition where the HIV virus markedly suppresses the immune system and you are susceptible to rare, difficult cancers and infections. Charlie has none of those. He is healthy; he does not have AIDS.\"\n\nHIV, or human immunodeficiency virus , attacks the immune system by destroying white blood cells, which are vital to fighting infection. Once enough of these cells have been destroyed and the person has another \"opportunistic\" infection like pneumonia or tuberculosis, the diagnosis moves to the final stage of the infection, called AIDS.\n\nThere are two main ways HIV is spread in the United States -- by sex and by sharing needles, syringes or any of the equipment used to prepare and inject drugs. Anal sex carries the highest risk, followed by vaginal sex and having multiple partners.\n\nIn the \"Today\" interview, Sheen denied any possibility that he got the disease via drug use. \"No needles,\" Sheen said. He also said he was no longer on drugs, but did continue to drink and seek the company of prostitutes.\n\nPhotos: Photos: The PrEP Heroes campaign aims to increase awareness of drugs that prevent HIV from establishing itself if a person is exposed. \"Being a part of the PrEP Hero campaign was important because it was an opportunity to show diversity in communities where HIV and LGBT intersect,\" Franco De Marco said. Hide Caption 1 of 9 Photos: Models featured in the campaign all use the drug. \"As a community that's already dealt with hardship, hatred and discrimination, we don't need to turn on ourselves,\" Peter William Dunn said about breaking stigma around HIV and AIDS. \"Treat everyone with respect and empathy, and treat those who are HIV-positive as real human beings not defined by a disease.\" Hide Caption 2 of 9 Photos: Mike Dreyden says he believes awareness is the best teacher. \"Having open and honest discussions where we can teach young people how to protect themselves,\" he says. Hide Caption 3 of 9 Photos: \"Give the public a face to put to the movement towards a cure,\" Alex Marshall said. \"It makes the issue more personal so it doesn't feel so scary.\" Hide Caption 4 of 9 Photos: Charles Quiles first learned about PrEP in 2013. \"Since then, it's impacted my approach by adding an added level of safety from current methods of prevention,\" he said. Hide Caption 5 of 9 Photos: Calvin Joshua was excited to learn about the potential for PrEP. \"It inspired hope that we are getting closer each day to a full-on cure,\" he said. Hide Caption 6 of 9 Photos: \"HIV is still a big issue that we all need to be responsible for, regardless of race or sexual orientation,\" Alex Zarlengo said. \"It's everyone's responsibility.\" Hide Caption 7 of 9 Photos: Seth Fornea was inspired by PrEP Heroes to stage his own hero shoot to be part of the campaign. Hide Caption 8 of 9 Photos: Nathan King wants to help fight the stigma associated with PrEP. \"Unlike many medical breakthroughs and preventive strategies, PrEP, and its users, faced criticism from the beginning,\" he said. \"People who used the medication are stigmatized and stereotyped, rather than supported for taking steps to protect the health of themselves and their communities.\" Hide Caption 9 of 9\n\nIn the past, Sheen has admitted to frequent visits to prostitutes at various times in his life. In July 1995, he testified in the tax evasion trial of \"Hollywood madam\" Heidi Fleiss that he had spent $53,000 in one 15-month period on \"sexual services.\"\n\nTwo cases of 'unprotected sex'\n\nSheen told Lauer that he had unprotected sex \"under the care of my doctor\" with two women since his diagnosis, but that it was \"impossible\" that he had transferred the virus to them. While Huizenga did not agree that it's \"impossible,\" he did say it was highly unlikely.\n\n\"He was immediately put on treatment, strong antiviral drugs, which has suppressed the virus, to the point that he is absolutely healthy from that vantage,\" Huizenga said. \"Individuals who are optimally treated with undetectable viral loads, (the risk is) incredibly low to transmit the virus. We can't say it's zero, but it's an incredibly low number.\"\n\nStaying on daily medication is important to keep the HIV virus from developing resistance and spreading, experts said.\n\n\"Resistance occurs when the virus replicates in the presence of the drugs,\" said Dr. Stephen Boswell, president and CEO of Boston's Fenway Health, a healthcare organization that works with lesbian, gay, bisexual and transgender people. \"Missed dosages lead to lower concentrations in the bloodstream and in the body, so the virus can become resistant and spread. So staying on your medications and not missing dosages is absolutely critical.\"\n\nPhotos: Are we on the road to an HIV vaccine? Photos: Are we on the road to an HIV vaccine? New HIV infections globally in 2013: Sub-Saharan Africa continues to have the greatest numbers of new infections. Hide Caption 1 of 13 Photos: Are we on the road to an HIV vaccine? Vaccines developed over time. Hide Caption 2 of 13 Photos: Are we on the road to an HIV vaccine? Hide Caption 3 of 13 Photos: Are we on the road to an HIV vaccine? Hide Caption 4 of 13 Photos: Are we on the road to an HIV vaccine? Hide Caption 5 of 13 Photos: Are we on the road to an HIV vaccine? AIDS activists light a group of candles placed in the shape of a red ribbon during an event marking World AIDS Day in Manila on December 1, 2012. Hide Caption 6 of 13 Photos: Are we on the road to an HIV vaccine? Balloons are released next to a sea of candles at the World Aids Day memorial in Berlin on November 30, 2011. Hide Caption 7 of 13 Photos: Are we on the road to an HIV vaccine? A red ribbon is hung between columns on the north side of the White House to commemorate World AIDS Day on November 30, 2010, in Washington. Hide Caption 8 of 13 Photos: Are we on the road to an HIV vaccine? Volunteers from Red Cross China take part in an AIDS-awareness event on World AIDS Day in Beijing on December 1, 2009. Hide Caption 9 of 13 Photos: Are we on the road to an HIV vaccine? A group of Chinese men gather to collect the free condoms distributed to mark World AIDS Day in Fujian province on December 1, 2010. Hide Caption 10 of 13 Photos: Are we on the road to an HIV vaccine? Indian villagers hold oil lamps as they surround a huge AIDS symbol on the beach at Nalsarovar on November 30, 2009, the eve of World Aids Day. Hide Caption 11 of 13 Photos: Are we on the road to an HIV vaccine? HIV-positive women make red ribbons, the universal symbol of awareness and support for those living with HIV, at a support center in Bangalore on the eve of World AIDS Day on November 30, 2012. Hide Caption 12 of 13 Photos: Are we on the road to an HIV vaccine? A Pakistani technician takes samples in a laboratory alongside a ribbon promoting World Aids Day in Islamabad on November 30, 2013. Researchers in the United States believe there may finally be an HIV vaccine within 10 years. Hide Caption 13 of 13\n\nSheen said that he was taking an antiviral \"cocktail\" of HIV drugs -- four pills per day -- and that he had not missed a day of medication, even while struggling with depression and substance abuse. Huizenga backed up his comment, saying that Sheen was undergoing lab tests every three to four months that showed the virus was at low levels.\n\n\"It's no longer a death sentence,\" Boswell said of HIV. \"It's a very different time now. Most people just diagnosed with HIV will live an almost normal life span if they get an early diagnosis, appropriate care and stay on their medications.\"\n\nUp and downs\n\nSheen is one of Hollywood's best-known actors, starring in hit films such as \"Wall Street\" and on the CBS sitcom \"Two and a Half Men.\"\n\nJUST WATCHED 2012: Charlie Sheen not ashamed of mistakes Replay More Videos ... MUST WATCH 2012: Charlie Sheen not ashamed of mistakes 03:50\n\nSheen was fired from \"Two and a Half Men\" in 2011 after a public meltdown that had the actor lashing out at the show's creator.\n\nAmong the more notorious points of his career, Sheen entered drug rehab twice and lived at one time with three women.\n\nHe's also been married multiple times and has children with ex-wives Brooke Mueller and Denise Richards. His ex-wives and an older child are aware of his illness, he said in the NBC interview.\n\nA spokesman for Mueller told People magazine that she and her sons with Sheen, 6-year-old twins, do not have HIV.\n\nHis salary on \"Two and a Half Men\" was one of the highest on TV at the time, at $1.25 million per episode in 2010.", "images": ["http://cdn.cnn.com/cnnnext/dam/assets/111128033228-red-ribbon-aids-white-house-topics.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116182900-08-charlie-sheen-through-the-years-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116183619-16-charlie-sheen-through-the-years-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116182744-07-charlie-sheen-through-the-years-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150909142157-02-hiv-prep-heroes-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116183016-06-charlie-sheen-through-the-years-restricted-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150909154238-07-hiv-prep-heroes-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/141128154753-world-aids-day-india-2009-horizontal-large-gallery.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/130220133444-hiv-ribbons-file-horizontal-large-gallery.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/141127183013-world-aids-day-3-topics.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/120111063108-piers-sheen-story-top.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/111107042000-china-condom-distribution-horizontal-large-gallery.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/141127182630-world-aids-day-1-topics.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116181734-01-charlie-sheen-through-the-years-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116183227-11-charlie-sheen-through-the-years-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/141127182630-world-aids-day-1-horizontal-large-gallery.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116183406-14-charlie-sheen-through-the-years-restricted-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/141127181342-time-to-hiv-vaccine-topics.gif", "http://cdn.cnn.com/cnnnext/dam/assets/151116181734-01-charlie-sheen-through-the-years-large-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150909142149-01-hiv-prep-heroes-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150909142218-04-hiv-prep-heroes-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116183619-16-charlie-sheen-through-the-years-exlarge-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116182449-03-charlie-sheen-through-the-years-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116183434-15-charlie-sheen-through-the-years-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116183016-06-charlie-sheen-through-the-years-restricted-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116183055-09-charlie-sheen-through-the-years-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116183314-12-charlie-sheen-through-the-years-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150909154257-09-hiv-prep-heroes-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150909142209-03-hiv-prep-heroes-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/141127181342-time-to-hiv-vaccine-horizontal-large-gallery.gif", "http://cdn.cnn.com/cnnnext/dam/assets/151116183406-14-charlie-sheen-through-the-years-restricted-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116182530-04-charlie-sheen-through-the-years-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/141127183013-world-aids-day-3-horizontal-large-gallery.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/141127182821-world-aids-day-2-topics.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116183055-09-charlie-sheen-through-the-years-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150909142229-05-hiv-prep-heroes-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/130118215738-charlie-sheen-getty-story-top.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/111201071557-berlin-world-aids-day-topics.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/121130050557-hiv-china-2009-horizontal-large-gallery.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/131128150802-aids-day-file-topics.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/141128154650-world-aids-day-2013-islamabad-2-topics.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116183150-10-charlie-sheen-through-the-years-restricted-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150909154248-08-hiv-prep-heroes-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150909154248-08-hiv-prep-heroes-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116182530-04-charlie-sheen-through-the-years-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116182744-07-charlie-sheen-through-the-years-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116183619-16-charlie-sheen-through-the-years-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/141128154650-world-aids-day-2013-islamabad-2-horizontal-large-gallery.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/131128150802-aids-day-file-horizontal-large-gallery.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116183227-11-charlie-sheen-through-the-years-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116182900-08-charlie-sheen-through-the-years-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116183434-15-charlie-sheen-through-the-years-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/130220133444-hiv-ribbons-file-topics.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116182637-05-charlie-sheen-through-the-years-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116182449-03-charlie-sheen-through-the-years-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150909154228-06-hiv-prep-heroes-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/141127180602-new-hiv-infections-by-region-topics.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/121130050557-hiv-china-2009-topics.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116182415-02-charlie-sheen-through-the-years-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150909142218-04-hiv-prep-heroes-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/111107042000-china-condom-distribution-topics.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116181734-01-charlie-sheen-through-the-years-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116183314-12-charlie-sheen-through-the-years-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/140110095114-charlie-sheen-0110-horizontal-large-gallery.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116182415-02-charlie-sheen-through-the-years-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/141127182821-world-aids-day-2-horizontal-large-gallery.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150909154257-09-hiv-prep-heroes-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150909154228-06-hiv-prep-heroes-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150909142209-03-hiv-prep-heroes-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/141127180602-new-hiv-infections-by-region-horizontal-large-gallery.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/141128154753-world-aids-day-india-2009-topics.jpg", "http://pixel.quantserve.com/pixel/p-D1yc5zQgjmqr5.gif?labels=noscript%3ANo%20Labels%20Set", "http://cdn.cnn.com/cnnnext/dam/assets/151116183150-10-charlie-sheen-through-the-years-restricted-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/140110095114-charlie-sheen-0110-topics.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150909154238-07-hiv-prep-heroes-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150909142157-02-hiv-prep-heroes-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150909142149-01-hiv-prep-heroes-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/111128033228-red-ribbon-aids-white-house-horizontal-large-gallery.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/151116182637-05-charlie-sheen-through-the-years-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150909142345-prep-heroes-tease-large-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150909142229-05-hiv-prep-heroes-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/111201071557-berlin-world-aids-day-horizontal-large-gallery.jpg", "data:image/gif;base64,R0lGODlhEAAJAJEAAAAAAP///////wAAACH5BAEAAAIALAAAAAAQAAkAAAIKlI+py+0Po5yUFQA7"], "top_img": "https://cdn.cnn.com/cnnnext/dam/assets/130118215738-charlie-sheen-getty-story-top.jpg", "keywords": [], "authors": ["Jason Hanna", "Doug Criss", "Sandee Lamotte"], "canonical_link": "https://www.cnn.com/2015/11/17/health/charlie-sheen-health/index.html", "title": "Charlie Sheen says he is HIV-positive", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "section": "health", "referrer": "unsafe-url", "og": {"pubdate": "2015-11-17T12:15:26Z", "url": "https://www.cnn.com/2015/11/17/health/charlie-sheen-health/index.html", "title": "Charlie Sheen says he is HIV-positive", "description": "In an interview with Matt Lauer on NBC's \"Today\" show, Charlie Sheen revealed that he's HIV-positive.", "site_name": "CNN", "type": "article", "image": {"identifier": "https://cdn.cnn.com/cnnnext/dam/assets/130118215738-charlie-sheen-getty-story-top.jpg", "width": 640, "height": 360}}, "pubdate": "2015-11-17T12:15:26Z", "lastmod": "2017-08-01T17:05:57Z", "author": "Jason Hanna, Doug Criss and Sandee LaMotte, CNN", "twitter": {"title": "Charlie Sheen says he is HIV-positive", "description": "In an interview with Matt Lauer on NBC's \"Today\" show, Charlie Sheen revealed that he's HIV-positive.", "card": "summary_large_image", "image": "https://cdn.cnn.com/cnnnext/dam/assets/130118215738-charlie-sheen-getty-story-top.jpg"}, "description": "In an interview with Matt Lauer on NBC's \"Today\" show, Charlie Sheen revealed that he's HIV-positive.", "keywords": "Charlie Sheen, Charlie Sheen HIV, health, Charlie Sheen says he is HIV-positive - CNN", "thumbnail": "https://cdn.cnn.com/cnnnext/dam/assets/130118215738-charlie-sheen-getty-story-top.jpg", "vr": {"canonical": "https://edition.cnn.com/2015/11/17/health/charlie-sheen-health/index.html"}, "article": {"opinion": "false", "content-tier": "free"}, "fb": {"app_id": 80401312489, "pages": "5550296508,18793419640"}, "template-top": "health,art-vid"}, "movies": [], "publish_date": 1447689600.0, "source": "http://www.cnn.com", "summary": ""}