{"url": "https://en.wikipedia.org/wiki/Coca-Cola_Vanilla", "text": "Coca-Cola Vanilla (commonly referred to as Vanilla Coke) is a vanilla-flavored version of Coca-Cola, introduced in 2002 but subsequently discontinued in North America and the United Kingdom in 2005, only remaining available as a fountain drink. It was relaunched in the US in 2007, in Denmark in 2012, the UK in 2013, and Canada in 2016. Vanilla Coke has been available in Australia since its initial introduction in 2002, being produced by Coca-Cola Amatil. Originally announced as a limited edition in the UK, it became permanent for several years; however, it was again discontinued in the UK in Summer 2018. Despite this, the product has still been distributed in related brands Diet Vanilla Coke and Coke Vanilla Zero.\n\nIn 2003, Pepsi introduced Pepsi Vanilla to compete with Vanilla Coke. Virgin released their own vanilla cola in 2002 in the UK, the year before Coke released Vanilla Coke there.\n\nDevelopment [ edit ]\n\nOrdinary Coca-Cola already contains small amounts of vanilla. The history of adding additional vanilla flavoring to Coca-Cola, at least in the US, dates back at least to the 1940s when local soda fountain workers (soda jerks) would upon request add a \"shot\" (roughly two tablespoons) of vanilla syrup to a (12-16 oz) Coca-Cola fountain soda. For decades, this remained common practice in ice cream shops where vanilla syrup and Coca-Cola were both available. The Coca-Cola Company first tested a Coca-Cola blend with extra vanilla flavoring at the 1982 World's Fair in Knoxville, Tennessee.[1] After the introduction of Cherry Coke and the failure of New Coke, the company was hesitant to introduce anything radically new. It was not until early April 2002 that rumors began to circulate that the company was planning a new variation to their classic soft drink. The Coca-Cola Company was tight lipped regarding the details of the new beverage, commenting to a London based newspaper, \"We've always got a number of things in development,\" leaving open speculation for what was to develop.[2] It was later revealed that testing for a vanilla flavor had been completed and that the new beverage would be available in months. However, in late April 2002 the company announced that Vanilla Coke would be produced as early as May.[3]\n\nMarketing campaign [ edit ]\n\nA 1.25L bottle from Australia.\n\nThe marketing campaign for Vanilla Coke aimed to appeal across all generations. Yolanda Ball, brand manager for Coca-Cola Classic, said, \"We had to learn how to balance the newness of vanilla with the established qualities of Coca-Cola\".[4] Vanilla Coke debuted at the Vanilla Bean Café, locally known as \"the Bean,\" in Pomfret, Connecticut. The diet variety would be directed primarily at women. The first public tasting of Vanilla Coke took place in the Buckhead district of Atlanta at the Three Dollar Cafe with Atlanta radio station Q100 and their morning hosts from The Bert Show.\n\nOne of the first notable advertisements was a television ad created by The Martin Agency which was based upon the product's original campaign line of \"Reward Your Curiosity\". The ad featured actor Chazz Palminteri, in which he and another man pull a teenager (played by a young Aaron Paul) into an alley after catching him peering into a hole. Palminteri gives the boy a Vanilla Coke, as a reward for his curiosity. Their former website rewardyourcuriosity.com went along with the campaign and drew a large interest at the time. (In the Philippine version of the ad, Palminteri's role was taken by the late actor Johnny Delgado.) Ms. Ball described the ad: \"We were trying to create something new and intriguing . . . half of it was about new, different and change of pace, and the rest of it was about how people love and trust Coca-Cola. But we didn't have to say New from Coca-Cola. We didn't have to hit them over the head with it.\"[4]\n\nDistribution [ edit ]\n\nThe Coca-Cola Company announced in 2002 that Vanilla Coke would be introduced initially in the United States with distribution starting May 15, followed by a rollout in Canada. The introduction of vanilla flavor was hailed by The Coca-Cola Company as \"the greatest innovation since Diet Coke in 1983\".[5] It also marked the 116th anniversary of the Coca-Cola Company.[6] Later that year, it was introduced to the Norwegian, Swedish, and Icelandic markets of Europe. This was the first Coca-Cola variety introduced in Norway since Coca-Cola itself in 1937 and Coca-Cola Light in 1983.[7] As of 2003 , Vanilla Coke was marketed in several European countries as well as Australia and New Zealand (in mid-to-late-2002). By late 2003, the company had marketed Vanilla Coke in over 30 countries around the globe. During the 2016 Summer Olympics the vanilla and cherry version was presented to selected markets in Brazil.[8] Today, It can easily be distributed using a Coca-Cola Freestyle machine, which injects vanilla syrup into Coca-Cola\n\nReception and discontinuation [ edit ]\n\nIts inaugural year in 2002 saw its best sales. It is estimated that the product was purchased by about 29% of all United States households that year. It still remains popular along with its flavored partner, Cherry Coca-Cola.[9] Doubt was cast over the future of Vanilla Coke and its splinter beverages when the company announced the 2004 sales figures: 35 million unit cases in North America compared to 90 million in 2002; Vanilla Diet Coke dropped from 23 million unit cases in its inaugural year (2003) to 13 million in 2004.[10]\n\nVanilla Coke as sold in Malaysia . (January 2019)\n\nIn November 2005, after slumping sales, The Coca-Cola Company announced that Vanilla Coke would be discontinued in North America and Great Britain by the end of the year.[10] Coca-Cola introduced Black Cherry Vanilla Coke and Diet Black Cherry Vanilla Coke in North America in January 2006. At the time, the company said Vanilla Coke and Diet Vanilla Coke would possibly be made available again in the future:[10] \"We are exploring ways to bring them back at another time, but right now Diet Black Cherry Vanilla Coke and Black Cherry Vanilla Coke are what consumers are telling us they want.\"[11] Vanilla Coke beverages were never discontinued in some markets, such as Australia, France, Russia, Malaysia, and Germany.\n\nFrom February 19, 2007, Vanilla Coke was re-introduced into New Zealand.[12] The official re-introduction of Vanilla Coke in the US began May 25, 2007 at the World of Coca-Cola Museum in Atlanta, Georgia. The Coca-Cola Company announced a partnership with Edy's Ice Cream to co-advertise with Coke on the launch, and featured a 10-ton Vanilla Coke float, which was certified by the Guinness World Records as the largest ice cream float in the world.[13] A Coca-Cola Vanilla Zero has also been introduced. The re-released Coca-Cola Vanilla features a new packaging design. The advertising campaign for the revival used an instrumental cover of \"Welcome Back\". In 2007, Vanilla Coke was also introduced into China. It was also introduced in other countries in Europe and Asia. In June 2010, certain convenience stores in Ontario, Canada have re-introduced it by importing it from the neighbouring United States. Coca-Cola has made Coke Vanilla available in their Freestyle beverage machine in Canada; however, bottled and canned versions were not available until 2016.\n\nAdvert celebrating the re-launch of Coca-Cola Vanilla on the side of a double-decker bus in London.\n\nCoca-Cola initially stated that it had no plans to return Coca-Cola Vanilla to the United Kingdom despite high demand. Several enquiries were made throughout 2011 and 2012. Coca-Cola then thought about returning Vanilla Coca-Cola to the United Kingdom sooner or later. It was reintroduced on March as part of Papa Johns promotion campaign before becoming available elsewhere.[citation needed]In April 2017 Vanilla Zero Sugar will be available in the UK.[14] In May 2013, Coca-Cola Vanilla appeared in stores in Romania (imported), expanding to more stores through the year, due to demand, while there is still no official word from Coca-Cola. In July 2013, the drink re-appeared in stores around Belgium and the Netherlands as well. In October 2013, Coca-Cola Vanilla appeared in stores in Czech Republic and Slovakia. In February 2015, it appeared in some Tesco stores in Poland, where it is also available in Carrefour shops. It can also be purchased in many shops in Canada, and is widely available in Sweden, and also in some stores in Finland. In 2018, Coca-Cola confirmed the product's discontinuation in the UK in favour of Vanilla Zero Sugar.[15]\n\nCoca-Cola Vanilla was introduced in Lithuania by the end of 2015 but only stayed in the shops for a few months (It was sold in selected stores of \"Maxima\") Possible reason for the drink being discontinued is that the sales were not good enough[citation needed]. It was distributed in 1L bottles only and price was 99 Euro cents (Regular 1L bottle was cheaper).\n\nProduct information [ edit ]\n\nNutritional [ edit ]\n\nAverage quantity per 12 oz\n\n(≈355 mL) per 100 mL\n\n(≈3.4 oz) Energy 140 calories 44 calories Protein 0 g 0 g Fat, total 0 g 0 g - saturated 0 g 0 g Carbohydrates 39 g 11.0 g - sugars 39 g 10.9 g Sodium 25 mg 10 mg\n\nPackaging [ edit ]\n\n2007 U.S. Vanilla Coke bottles.\n\nVanilla Coke was packaged in standard bottles in accordance with appropriate Coca-Cola packaging. For a brief period of time in mid-2003, the bottles that Vanilla Coke came in, which had before said Vanilla Coke, were changed simply to V (which matched Cherry Coke's new labeling showing a picture of a cherry).\n\nAs part of Coca-Cola's ongoing \"One Brand\" marketing campaign, a new U.S. packaging design for Coca-Cola Vanilla was introduced in January 2019. The new packaging follows the design principles already employed in the United States for Coca-Cola, Coca-Cola Zero Sugar, and Coca-Cola Life. The word \"Coca-Cola\" is superimposed upon a red disc with a light beige drop (representing a drop of vanilla syrup) below the text. The background color of the can or bottle is light beige in color. The word \"Vanilla\" is placed above the red disc, similar to the \"Original Taste\" text currently used on cans and bottles of original Coca-Cola.\n\nVarieties [ edit ]\n\nCoca-Cola Vanilla (2002–05; 2007–present)\n\nCoca-Cola Vanilla Zero (2007–2019)\n\nDiet Coke Vanilla (2002–05)\n\nCoca-Cola Vanilla - Zero Sugar (2017–Present) UK, US and Australia\n\nIn late 2002, a sugar-free version, Diet Vanilla Coke, became available. In some countries, including Australia and New Zealand, a similar drink is marketed as \"Diet Coke with Vanilla\" and in others is known as Coca-Cola light Vanilla (or Vanilla Coke Light) In 2005, the sugar-free product in the United States and Canada became \"Diet Coke Vanilla,\" with more emphasis on the Diet Coke label. All varieties were discontinued in 2005 in the United States, Canada and the United Kingdom. Both varieties are still available in Australia and Hong Kong, Coca-Cola Vanille (translation) is also available in France and Germany. A new Coke Vanilla Zero was introduced in 2007, along with regular Vanilla. Only these two are available in the United States. The company has not announced any plan to resume production of Diet Vanilla Coke. Diet Vanilla Coke is, however, available using a Coca-Cola Freestyle machine. Coca-Cola Zero sugar Vanilla will be available in the UK from April 2017 in 1.75L bottles, 330ml cans, 500ml bottles and multipack of cans.", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Vanilla_Coke_is_back_advert.jpg/220px-Vanilla_Coke_is_back_advert.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a0/Vanilla07.jpg/250px-Vanilla07.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Coca-Cola_logo.svg/80px-Coca-Cola_logo.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Vanilla_Coke_Wiki.jpg/170px-Vanilla_Coke_Wiki.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Vanila_Coke_Malaysia.jpg/220px-Vanila_Coke_Malaysia.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/d/dc/Vanilla_cola_can.png/100px-Vanilla_cola_can.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Coca-Cola_Vanilla", "title": "Coca-Cola Vanilla", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}