{"url": "https://en.wikipedia.org/wiki/2022_Winter_Olympics", "text": "24th Olympic Winter Games, to be held in Beijing, China\n\n\"Beijing 2022\" redirects here. For the Winter Paralympics, see 2022 Winter Paralympics\n\nThe 2022 Winter Olympics, officially known as the XXIV Olympic Winter Games (French: Les XXIVes Jeux olympiques d'hiver;[1] Chinese: 第二十四届冬季奥林匹克运动会; pinyin: Dì Èrshísì Jiè Dōngjì Àolínpǐkè Yùndònghuì), and commonly known as Beijing 2022, is an international winter multi-sport event that is scheduled to take place from 4 to 20 February 2022, in Beijing and towns in the neighboring Hebei province, China.[2]\n\nBeijing was elected as the host city in July 2015 at the 128th IOC Session in Kuala Lumpur, Malaysia. These Games will be the first Winter Olympics ever to be held in China, the fourth Winter Olympics held in East Asia, and the last of three consecutive Olympics to be held in East Asia, following the 2018 Winter Olympics in Pyeongchang, South Korea, and the 2020 Summer Olympics in Tokyo, Japan. With its previous hosting of the 2008 Summer Olympics, Beijing will be the first city to have hosted both the Summer and Winter Olympics and there are plans to use many of the same venues that were used for the 2008 Games, including its indoor venues, as well as Beijing National Stadium (also known as the Bird's Nest) as the ceremonies venue. Beijing is also the second national capital to host the Winter Olympics, after Oslo, Norway in 1952, the third consecutive mainland Asian city hosting the Winter Olympics, after Sochi and Pyeongchang.\n\nBidding [ edit ]\n\nThe bidding calendar was announced by the IOC in October 2012, with the application deadline set for 14 November 2013. The IOC Executive Board reviewed the bids from all applicant cities on 7 July 2014, and selected three cities, Oslo (Norway), Almaty (Kazakhstan) and Beijing (China) as the final candidates.\n\nSeveral cities withdrew their applications during the bidding process, citing the high costs or the lack of local support for hosting the Games.[3] Oslo, which had been considered the clear frontrunner, withdrew after its application to the Norwegian parliament for funding of the Olympics was rejected. Public reception to the application for funding had been highly negative due to cost concerns after the cost overruns of the 2014 Winter Olympics in Sochi, and especially revelations about a series of hospitality-related demands that had been reportedly made by the IOC. The demands notably included \"diva-like demands for luxury treatment\" for the IOC members themselves, such as special lanes on all roads only to be used by IOC members and a cocktail reception at the Royal Palace with drinks paid for by the royal family. Several commentators pointed out that such demands were unheard of in a western democracy; Slate described the IOC as a \"notoriously ridiculous organization run by grifters and hereditary aristocrats.\"[4][5][6][7]\n\nBeijing was selected as host city of the 2022 Winter Olympics after beating Almaty by four votes on 31 July 2015 at the 128th IOC Session in Kuala Lumpur, Malaysia.\n\n2022 Winter Olympics bidding results City Nation Votes Beijing 44 Almaty 40\n\nVenues [ edit ]\n\nLocation of the three Beijing 2022 clusters\n\nBeijing National Stadium\n\nNational Aquatics Center\n\nNational Speed Skating Oval\n\nOlympic Green [ edit ]\n\nFive ice events will be held at the Olympic Green, the Capital Indoor Stadium and the Beijing Wukesong Sports Center, which were some of the main venues of the 2008 Summer Olympics.\n\nBeijing 2022 Winter Olympic Village – new\n\nSince the start of 2009, the Beijing Olympic Village on the Olympic Green, has been occupied by fixed residents. Therefore, there was a need to build a second village on a smaller scale to the Winter Olympics. These new buildings were located in the southern area of Olympic Green on the area of the National Olympic Sports Center.[8]\n\nOther venues\n\nThe Big Air snowboarding and freestyle skiing events will be held in a new area of urban development in Shijingshan District, a district in urban area of Beijing.[9]\n\nYanqing cluster [ edit ]\n\nYanqing District is a suburban district of Beijing. Competitions for luge, bobsleigh and alpine skiing will be held in Xiaohaituo Mountain area in the village Greater Zhuangke of the West [Wikidata][12] of Zhangshanying in Yanqing District, northwest of urban area of Beijing, 90 kilometres (56 miles) away from the city center of Beijing and 17.5 kilometres (10.9 miles) away from the town of Yanqing, using artificial snow because of the rarity of natural snow in this region.[13][14]\n\nZhangjiakou cluster [ edit ]\n\nAll other skiing events will be held in Taizicheng Area in Chongli District, Zhangjiakou city, Hebei Province. It is 220 km (140 mi) from downtown Beijing and 130 km (81 mi) away from Xiaohaituo Mountain Area.[15] The ski resort earned over 1.54 billion yuan (US$237.77 million) in tourism during the 2015–16 snow season for a 31.6% growth over the previous season. In 2016, it was announced that Chongli received 2.185 million tourists, an increase of 30% from the previous season, during the first snow season after winning the Olympic bid. The snow season lasted for five months from November, during which Chongli has hosted thirty-six competitions and activities, such as Far East Cup and Children Skiing International Festival. A total of twenty-three skiing camps have also been set up, attracting the participation of 3,800 youths. All venue construction started in November 2016 and will be finished by the end of 2020 to enable the city to hold test events.[16]\n\nTransport [ edit ]\n\nThe new Beijing-Zhangjiakou intercity railway opened in late 2019, starting from Beijing North railway station and ending at Zhangjiakou railway station. It is built for speeds of up to 350 km/h (220 mph); travel time from Beijing to Zhangjiakou has decreased to around 50 minutes.\n\nThe Beijing Subway is expected to continue expanding and is projected to reach 1,000 km (620 mi) in length by 2022.[17]\n\nA new airport for Beijing and the surrounding region, Beijing Daxing International Airport, opened in 2019. The airport replaced the Beijing Nanyuan Airport and is operated together with the Beijing Capital International Airport.[18]\n\nBudget [ edit ]\n\nThe estimated budget for the games is US$3.9 billion, less than one-tenth of the $43 billion spent on the 2008 Summer Olympics.[19]\n\nSports [ edit ]\n\nThe 2022 Winter Olympics are scheduled to include a record 109 events over 15 disciplines in 7 sports.\n\nNumbers in parentheses indicate the number of medal events contested in each separate discipline.\n\nNew events [ edit ]\n\nIn October 2016, the International Ski Federation (FIS) announced plans to begin sanctioning women's competitions in Nordic combined, with the objective of contesting the discipline at the Olympic level for the first time in Beijing.[20] In November 2017, a further three events were put forward by the FIS for possible Olympic inclusion: a ski jumping mixed team competition and men's and women's big air in freestyle skiing.[21]\n\nAt their May 2018 Congress at the Costa Navarino resort in Messenia, Greece, FIS submitted several additional events for consideration, including a proposal to make telemark skiing an Olympic discipline for the first time in Beijing, with proposed competitions to include the men's and women's parallel sprint and a mixed team parallel sprint. The Congress also approved to submit the aerials mixed team event and several new snowboarding events: the men and women's snowboard cross team event; a mixed team alpine parallel event; the men's and women's parallel special slalom; and a mixed team parallel special slalom event.[22] The individual parallel special slalom events were featured at the 2014 Winter Olympics in Sochi, Russia, but were dropped from the Olympic program in 2018 to make way for the snowboarding big air competitions.\n\nThe International Luge Federation (FIL) has proposed the addition of six new events, including natural track luge (men's and women's singles), a women's doubles competition on the artificial track, and sprint events (men, women, and doubles) on the artificial track.[23][24]\n\nThe International Skating Union (ISU) continues to campaign for the addition of synchronized skating as a new event within the discipline of figure skating.[25] The ISU is also proposing a new mixed team event in short track speed skating.[24]\n\nIn biathlon, a single mixed relay has been proposed by the International Biathlon Union (IBU) to complement the four-person mixed relay that featured at the 2018 Winter Olympics.[24] Also, the International Bobsleigh and Skeleton Federation (IBSF) has proposed a new team event, but there is no plan to introduce a four-women bobsleigh event despite the recommendation from the federation's executive board to propose such an event in the interests of gender equality.[24]\n\nIn July 2018, the IOC announced the addition of seven new events: women's monobob; freestyle skiing big air (men and women); mixed team events for freestyle skiing aerials, ski jumping, and snowboard cross; and the mixed relay in short track speed skating. This means a total of 109 events will be held.\n\nParticipating National Olympic Committees [ edit ]\n\nIn May 2019 the IIHF announced nine nations that had secured Olympic qualification in the men's tournament.[26] As the host nation, China qualified teams automatically, thus making a total of ten teams per event in the curling tournaments.[27]\n\nOn 9 December 2019, the World Anti-Doping Agency (WADA) banned Russia from all international sport for four years, after it found that the Russian government had tampered with lab data that it provided to WADA in January 2019 as a condition of its reinstatement of the Russian Anti-Doping Agency. As at the 2018 Winter Olympics, WADA will allow individual cleared Russian athletes to compete neutrally under a title to be determined. WADA Compliance Review Committee head Jonathan Taylor stated that the IOC would not be able to use \"Olympic Athletes from Russia\" (OAR) as it did in 2018, specifically emphasizing that neutral athletes are to not to be portrayed as representing Russia.[28][29][30]\n\nOn May 30, 2019, the first 8 countries classified for the men's ice hockey tournament were announced. These countries were the first to confirm that they will send a delegation to Beijing.[31][32][33]\n\nMarketing [ edit ]\n\nBroadcasting [ edit ]\n\nIn some countries, broadcast rights to the 2022 Winter Olympics are already agreed through existing long-term deals. In France and the United Kingdom, these are the first Games where Eurosport will be the main rightsholder; the BBC will sub-license a limited amount of coverage on free-to-air television, as part of a deal in which the BBC sold the pay-TV rights to the 2018 and 2020 Games to Eurosport.[34][35] This will be the final Olympic Winter Games to be broadcast by SBS in North and South Korea. This is because cable network JTBC will broadcast the Games starting in 2026\n\nIn the United States, the Games will once again be broadcast by NBCUniversal properties as part of its multi-year agreement with the IOC. The 2022 edition of the Super Bowl—championship game of the National Football League (NFL) and historically among the most-watched television broadcasts in the country annually—is tentatively scheduled during an ongoing Olympics for the first time in its history. On 13 March 2019, it was announced that NBC had traded 2021's Super Bowl LV to CBS (which, alongside Fox and NBC, alternate airing the Super Bowl on a three-year rotation) in favour of the 2022 games. Holding rights to both events will prevent them from competing for viewership and advertising sales, and also allow NBC to create synergies and advertising packages for them (as it did during Super Bowl LII, which was played prior to the 2018 Winter Olympics and also televised by NBC).[36][37]\n\nConcerns and controversies [ edit ]\n\nCritics questioned the Beijing bid, citing that the proposed outdoor venue sites do not have reliable snowfall in winter for snow sports. Concerns have been raised that snow may need to be transported to the venues at great cost and with uncertain environmental consequences.[62][63]\n\nThe environmental impact of hosting the games near Beijing has been questioned. Some of the proposed venues will be adjacent to the Beijing Songshan National Nature Reserve and part of the same mountain system, and the environmental impact on the nature reserve of construction, and artificially covering parts of the mountain with snow, is uncertain.[64][65] The Chinese government responded to these concerns by expanding the adjacent Beijing Songshan National Nature Reserve by 31% of its original size.[66]\n\nShortly after the announcement of the 2022 host city, some musical critics alleged that the official song used during the bid was \"suspiciously\" similar to \"Let it Go\" from the Disney film Frozen.[67][68]\n\nIn the aftermath of the 2019 leak of the Xinjiang papers and the 2019 Hong Kong protests, calls were made for a boycott of the 2022 games.[69][70]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/b/ba/Flag_of_Germany.svg/23px-Flag_of_Germany.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Biathlon_pictogram.svg/20px-Biathlon_pictogram.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/cf/Flag_of_Canada.svg/22px-Flag_of_Canada.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Flag_of_Finland.svg/23px-Flag_of_Finland.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Flag_of_New_Zealand.svg/23px-Flag_of_New_Zealand.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Flag_of_South_Africa.svg/23px-Flag_of_South_Africa.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Olympic_rings_without_rims.svg/40px-Olympic_rings_without_rims.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Figure_skating_pictogram.svg/20px-Figure_skating_pictogram.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a3/2022_Winter_Olympics_official_logo.svg/1200px-2022_Winter_Olympics_official_logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Flag_of_Switzerland.svg/20px-Flag_of_Switzerland.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Flag_of_the_People%27s_Republic_of_China.svg/24px-Flag_of_the_People%27s_Republic_of_China.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/23px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Flag_of_Kazakhstan.svg/23px-Flag_of_Kazakhstan.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Snowboarding_pictogram.svg/20px-Snowboarding_pictogram.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Luge_pictogram.svg/20px-Luge_pictogram.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Flag_of_Austria.svg/23px-Flag_of_Austria.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/22px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Flag_of_the_People%27s_Republic_of_China.svg/23px-Flag_of_the_People%27s_Republic_of_China.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Norway.svg/21px-Flag_of_Norway.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Flag_of_Europe.svg/23px-Flag_of_Europe.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/9e/Flag_of_Japan.svg/23px-Flag_of_Japan.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/Beijing_national_stadium.jpg/220px-Beijing_national_stadium.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Short_track_speed_skating_pictogram.svg/20px-Short_track_speed_skating_pictogram.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Flag_of_the_People%27s_Republic_of_China.svg/22px-Flag_of_the_People%27s_Republic_of_China.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Flag_of_Finland.svg/22px-Flag_of_Finland.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Freestyle_skiing_pictogram.svg/20px-Freestyle_skiing_pictogram.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Flag_of_Yugoslavia_%281946-1992%29.svg/23px-Flag_of_Yugoslavia_%281946-1992%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Cross_country_skiing_pictogram.svg/20px-Cross_country_skiing_pictogram.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Wikivoyage-Logo-v3-icon.svg/40px-Wikivoyage-Logo-v3-icon.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/03/Flag_of_Italy.svg/23px-Flag_of_Italy.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a3/2022_Winter_Olympics_official_logo.svg/161px-2022_Winter_Olympics_official_logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Flag_of_France.svg/23px-Flag_of_France.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Flag_of_Armenia.svg/23px-Flag_of_Armenia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Alpine_skiing_pictogram.svg/20px-Alpine_skiing_pictogram.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Flag_of_Switzerland.svg/16px-Flag_of_Switzerland.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/Speed_skating_pictogram.svg/20px-Speed_skating_pictogram.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Flag_of_Germany_%281935%E2%80%931945%29.svg/23px-Flag_of_Germany_%281935%E2%80%931945%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f3/Flag_of_Russia.svg/23px-Flag_of_Russia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Flag_of_Singapore.svg/23px-Flag_of_Singapore.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Bobsleigh_pictogram.svg/20px-Bobsleigh_pictogram.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Ice_hockey_pictogram.svg/20px-Ice_hockey_pictogram.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/Flag_of_Kosovo.svg/21px-Flag_of_Kosovo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/05/Flag_of_Brazil.svg/22px-Flag_of_Brazil.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b1/Olympic_Rings.svg/24px-Olympic_Rings.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Nordic_combined_pictogram.svg/20px-Nordic_combined_pictogram.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b1/Olympic_Rings.svg/32px-Olympic_Rings.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Skeleton_pictogram.svg/20px-Skeleton_pictogram.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Canada_%28Pantone%29.svg/23px-Flag_of_Canada_%28Pantone%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Flag_of_South_Korea.svg/23px-Flag_of_South_Korea.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Water_Cube_Ice_Cube_Beijing_2.jpg/220px-Water_Cube_Ice_Cube_Beijing_2.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f5/Flag_of_the_United_States_%281912-1959%29.svg/23px-Flag_of_the_United_States_%281912-1959%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/ae/Flag_of_the_United_Kingdom.svg/23px-Flag_of_the_United_Kingdom.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Curling_pictogram.svg/20px-Curling_pictogram.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Ski_jumping_pictogram.svg/20px-Ski_jumping_pictogram.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Flag_of_North_Korea.svg/23px-Flag_of_North_Korea.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Flag_of_the_People%27s_Republic_of_China.svg/32px-Flag_of_the_People%27s_Republic_of_China.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Flag_of_the_United_States_%281959-1960%29.svg/23px-Flag_of_the_United_States_%281959-1960%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/National_Speed_Skating_Oval_Beijing_2.jpg/220px-National_Speed_Skating_Oval_Beijing_2.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/b/ba/Flag_of_Germany.svg/22px-Flag_of_Germany.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4c/Flag_of_Sweden.svg/22px-Flag_of_Sweden.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/2022_Winter_Olympics_clusters_location_map-en.svg/220px-2022_Winter_Olympics_clusters_location_map-en.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Flag_of_the_Czech_Republic.svg/22px-Flag_of_the_Czech_Republic.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/Flag_of_Hungary.svg/23px-Flag_of_Hungary.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Flag_of_Thailand.svg/23px-Flag_of_Thailand.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Flag_of_Belgium_%28civil%29.svg/23px-Flag_of_Belgium_%28civil%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Olympic_rings_without_rims.svg/100px-Olympic_rings_without_rims.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/thumb/a/a3/2022_Winter_Olympics_official_logo.svg/1200px-2022_Winter_Olympics_official_logo.svg.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/2022_Winter_Olympics", "title": "2022 Winter Olympics", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/thumb/a/a3/2022_Winter_Olympics_official_logo.svg/1200px-2022_Winter_Olympics_official_logo.svg.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}