{"url": "https://www.cbsnews.com/news/mistrial-declared-bill-cosby-jury-deadlocked-on-verdict/", "text": "NORRISTOWN, Pa. -- The judge in Bill Cosby's sexual assault trial declared a mistrial Saturday after jurors said they were deadlocked after five days of deliberations.\n\nThe jury informed Judge Steven T. O'Neill it was \"deadlocked on all counts\" in a note Saturday morning. O'Neill asked jurors if they were \"hopeless[ly] deadlocked,\" and each stood and agreed they were, CBS News' Vidya Singh reports.\n\nO'Neill called the jury's effort \"one of the more courageous acts, one of the more selfless acts that I've seen in the justice system.\"\n\n\"I feel bad for all of you. I really do,\" he said.\n\nCosby remains free on bail.\n\nMontgomery County District Attorney Kevin Steele said he will immediately retry the case.\n\n\"We will evaluate and review our case. We will take a hard look at everything involved, and then we will retry it,\" Steele said at a press conference Saturday morning. \"As I said in court, our plan is to move this case forward as soon as possible.\"\n\nA courtroom sketch shows Cosby in court on Saturday, June 17, 2017. Jane Rosenberg\n\nAndrea Constand, who accused Cosby of sexual assault, smiled and hugged supporters in the courtroom. Constand embraced many of the alleged victims who sat through the trial.\n\nGloria Allred, an attorney for many Cosby's accusers, said she will continue to pursue legal action.\n\n\"We can never underestimate the blinding power of celebrity,\" Allred said. \"But justice will come... It's too early to celebrate, Mr. Cosby.\"\n\nCosby's defense team declared victory and went on the attack, with spokesman Andrew Wyatt saying that \"Cosby's power is back.\"\n\nCosby's wife, Camille Cosby, slammed prosecutors for bringing the case to court. She issued a statement calling Steele \"heinously and exploitively ambitious.\" She also attacked the judge, the accuser's lawyers and the media.\n\nThe fast-moving case went to the jury of seven men and five women Monday, on day six of the trial, after closing arguments painted different pictures of what happened between Cosby and Constand at his suburban Philadelphia estate in 2004. But the sequestered jury failed to reach a verdict, pausing a half-dozen times to revisit key evidence, including Cosby's decade-old admissions that he fondled Constand after giving her pills.\n\nLate Thursday morning, the panel announced they were deadlocked, but the judge sent them back to work.\n\nCosby was charged with three counts of aggravated indecent assault, each one punishable by up to 10 years behind bars.\n\nThe black comedian once known as America's Dad for his portrayal of kindly Dr. Cliff Huxtable on \"The Cosby Show\" suggested recently that race could have played a role in the case against him. The jury included two black members.\n\nCosby used his power and fame to violate Constand, an employee of Temple University's basketball program, Assistant District Attorney Kristen Feden said in her opening statement. Constand, 44, testified last week that Cosby gave her three blue pills and then penetrated her with his fingers against her will as she lay paralyzed and half-conscious. She denied they had a romantic relationship and said she had rebuffed previous advances from him.\n\nCosby accuser stands by her story\n\n\"In my head, I was trying to get my hands to move or my legs to move, but I was frozen,\" Constand, 44, testified June 6. \"I wasn't able to fight in any way.\"\n\nShe added: \"I wanted it to stop.\"\n\nDefense lawyer Brian McMonagle, however, attacked what he said were inconsistencies in Constand's story, disputed that Constand was incapacitated, and made the case that she and Cosby, who was married, had a romantic relationship. McMonagle said Cosby gave her the cold and allergy medicine Benadryl only after she complained she couldn't sleep.\n\nConstand sued Cosby after prosecutors in 2005 declined to press charges. Cosby testified over a decade ago as part of that lawsuit, eventually settling with her for an undisclosed sum. Cosby didn't testify at the six-day trial. But jurors still heard plenty from him as prosecutors read them excerpts from his 2005 police statement and civil deposition.\n\nThe sole witness for the defense was the detective who led the 2005 investigation, Richard Schaffer, who previously took the stand during the prosecution's case. He was questioned for six minutes.\n\nIn his hour-and-a half closing statement, McMonagle told the jury that Cosby is a brilliant comedian who \"taught us how to smile,\" reports CBS Philadelphia. He said Constand told a \"stone cold lie,\" reports CBS News' Jericka Duncan -- and that while Cosby cheated on his wife, he didn't commit a crime.\n\nCosby's wife of 53 years, Camille -- in the courtroom for the first time Monday in the 6-day trial -- was stoic during the defense argument.\n\nMcMonagle turned towards Cosby and said, \"When you dance outside your marriage ... and you danced.\"\n\nHe then pointed at Camille Cosby and shouted, \"And you deserved better.\"\n\nMcMonagle pointed out that Constand telephoned Cosby dozens of times after the alleged assault. Constand told the jury she was merely returning his calls about the women's basketball squad at Temple University, where she worked as director of team operations and he was a member of the board of trustees.\n\nAndrea Constand arrives during Bill Cosby's sexual assault trial at the Montgomery County Courthouse in Norristown, Pa., on Wed., June 7, 2017. Cosby is accused of drugging and sexually assaulting Constand at his home outside Philadelphia in 2004. AP\n\n\"This isn't talking to a trustee. This is talking to a lover,\" McMonagle said of one call that lasted 49 minutes. \"Why are we running from the truth of this case -- this relationship? Why? I don't understand it.\"\n\nCamille Cosby sat in the front row, across the aisle from Constand, who didn't react to McMonagle's two-hour closing but smiled at the end of it. Camille Cosby left when it was the prosecution's turn.\n\nMontgomery County District Attorney Kevin Steele said in his closing argument Monday that the 79-year-old comedian's decade-old statements corroborate Constand's allegations that he drugged and violated her.\n\n\"Drugging somebody and putting them in a position where you can do what you want with them is not romantic. It's criminal,\" Steele said in his closing argument.\n\nSteele also reminded jurors about a telephone conversation in which Cosby apologized to Constand's mother and described himself as a \"sick man.\"\n\n\"This is where all the fancy lawyering can't get you around your own words,\" Steele said.\n\nBill Cosby arrives for his sexual assault trial with his wife Camille Cosby at the Montgomery County Courthouse in Norristown, Pa., Monday, June 12, 2017. Matt Rourke / AP\n\nIn his 2005 deposition, Cosby said he obtained several prescriptions for quaaludes in the 1970s and offered the now-banned sedatives to women he wanted to have sex with.\n\nHe also said he gave Constand three half-tablets of the cold and allergy medicine Benadryl before the \"petting\" began. Prosecutors have suggested he drugged her with something stronger - perhaps quaaludes.\n\nHis deposition was sealed for years until a judge released parts in 2015 at the request of The Associated Press, prompting a new set of prosecutors to take a fresh look at the case and charge him.\n\nSome 60 women have come forward to say Cosby sexually violated them, all but destroying his nice-guy image, but the statute of limitations for prosecution had run out in nearly every case. Constand's case is the only one in which Cosby has been charged.\n\nThe Associated Press does not typically identify people who say they are sexual assault victims unless they grant permission, which Constand has done.\n\nVidya Singh contributed reporting from Norristown, Pennsylvania.", "images": ["https://cbsnews2.cbsistatic.com/hub/i/r/2017/06/17/31f6628a-3a83-44fa-9078-05b3a72b8e84/thumbnail/620x465g2/357cf681abf605c6fb48dfe30c4bf419/6-17-17-cosby-10.jpg", "https://cbsnews2.cbsistatic.com/hub/i/r/2017/06/17/96d2503f-06d6-4e7d-8883-b0b1603f5ffa/thumbnail/1200x630g2/49c6f29d9a57e9ef2425078c4de16791/ap-17168528204656.jpg", "https://cbsnews3.cbsistatic.com/hub/i/r/2017/06/07/1462865f-9f6f-4eff-904d-3e5876a02525/thumbnail/620x350/58f3faf23025f0f4016fda682565b614/constand2.jpg", "https://cbsnews2.cbsistatic.com/hub/i/r/2017/06/12/170eac44-e83f-43cc-a3c9-a6db5ea37b9d/thumbnail/620x350/358f22d85b8a0ecf54a418efc7b9228d/ap60.jpg", "https://cbsnews1.cbsistatic.com/hub/i/r/2019/11/19/186936ea-2db7-4a48-b750-74f38f653dc6/thumbnail/640x360/80fb8996993802606d5c971761bf5b42/newsletter-breakingnews.jpg"], "top_img": "https://cbsnews2.cbsistatic.com/hub/i/r/2017/06/17/96d2503f-06d6-4e7d-8883-b0b1603f5ffa/thumbnail/1200x630g2/49c6f29d9a57e9ef2425078c4de16791/ap-17168528204656.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.cbsnews.com/news/mistrial-declared-bill-cosby-jury-deadlocked-on-verdict/", "title": "Mistrial declared; Bill Cosby jury deadlocked on verdict", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1, user-scalable=0", "robots": "index, follow", "description": "The jury in suburban Philadelphia was &quot;hopelessly deadlocked&quot; after five days of deliberations", "keywords": "Bill Cosby trial, Andrea Constand, verdict, Bill Cosby sex assault trial, bill cosby", "news_keywords": "Bill Cosby trial, Andrea Constand, verdict, Bill Cosby sex assault trial, bill cosby", "al": {"web": {"url": "https://www.cbsnews.com/news/mistrial-declared-bill-cosby-jury-deadlocked-on-verdict/"}, "ios": {"app_name": "CBS News", "app_store_id": 334256223, "url": "cbsnewsapp://cbsnews.com/news/mistrial-declared-bill-cosby-jury-deadlocked-on-verdict/"}, "android": {"app_name": "CBS News", "package": "com.treemolabs.apps.cbsnews"}}, "og": {"type": "article", "url": "https://www.cbsnews.com/news/mistrial-declared-bill-cosby-jury-deadlocked-on-verdict/", "title": "Mistrial declared; Bill Cosby jury deadlocked on verdict", "description": "The jury in suburban Philadelphia was \"hopelessly deadlocked\" after five days of deliberations", "image": {"identifier": "https://cbsnews2.cbsistatic.com/hub/i/r/2017/06/17/96d2503f-06d6-4e7d-8883-b0b1603f5ffa/thumbnail/1200x630g2/49c6f29d9a57e9ef2425078c4de16791/ap-17168528204656.jpg", "width": 1200, "height": 630}, "video": {"url": "https://public.vilynx.com/direct/8fc31712de713e0c34c55c4bce033614/7092bc95-4dc5-4349-9873-365b5ed4079a/pro69.viwindow.mp4", "secure_url": "https://public.vilynx.com/direct/8fc31712de713e0c34c55c4bce033614/7092bc95-4dc5-4349-9873-365b5ed4079a/pro69.viwindow.mp4", "type": "video/mp4", "width": 1920, "height": 1080}}, "fb": {"app_id": 1536620209892267, "pages": 131459315949}, "article": {"publisher": "https://www.facebook.com/CBSNews", "content_tier": "free", "opinion": "false"}, "twitter": {"dnt": "on", "app": {"country": "US", "name": {"iphone": "CBS News", "ipad": "CBS News", "googleplay": "CBS News"}, "id": {"iphone": 334256223, "ipad": 334256223, "googleplay": "com.treemolabs.apps.cbsnews"}, "url": {"iphone": "cbsnewsapp://cbsnews.com/news/mistrial-declared-bill-cosby-jury-deadlocked-on-verdict/", "ipad": "cbsnewsapp://cbsnews.com/news/mistrial-declared-bill-cosby-jury-deadlocked-on-verdict/", "googleplay": "cbsnewsapp://cbsnews.com/news/mistrial-declared-bill-cosby-jury-deadlocked-on-verdict/"}}, "site": "@CBSNews", "title": "Mistrial declared; Bill Cosby jury deadlocked on verdict", "description": "The jury in suburban Philadelphia was \"hopelessly deadlocked\" after five days of deliberations", "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2017/06/17/96d2503f-06d6-4e7d-8883-b0b1603f5ffa/thumbnail/1200x630g2/49c6f29d9a57e9ef2425078c4de16791/ap-17168528204656.jpg", "card": "summary_large_image"}, "theme-color": "#101010", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "CBS News", "apple-mobile-web-app-status-bar-style": "black"}, "movies": [], "publish_date": null, "source": "https://www.cbsnews.com", "summary": ""}