{"url": "en.wikipedia.org/wiki/Regis_Philbin", "text": "Regis Francis Xavier Philbin ( ; born August 25, 1931) is an American media personality, actor, and singer, known for hosting talk and game shows since the 1960s.[4] After graduating from the University of Notre Dame, he served in the Navy and got his television start serving as a page for The Tonight Show in the 1950s. Philbin gained his first network TV exposure in 1967 as Joey Bishop's sidekick on The Joey Bishop Show.\n\nSometimes called (alternatively attributed to James Brown) \"the hardest working man in show business\",[5][6] Philbin holds the Guinness World Record for the most hours on US television.[7][8] His trademarks include his excited manner, his New York accent, his wit, and his irreverent ad-libs.\n\nPhilbin is most widely known as the host of the New York City-based nationally syndicated talk show Live! with Regis and Kathie Lee starting in 1988, which became Live! with Regis and Kelly starting in 2001, and continued on with former football player Michael Strahan after Philbin's departure in 2011.[9][10][11]\n\nPhilbin debuted and hosted Who Wants to Be a Millionaire,[11] Million Dollar Password,[12] and the first season of America's Got Talent.[13]\n\nEarly life and career [ edit ]\n\nPhilbin was born on August 25, 1931 in the Bronx, New York City. His father, Francis \"Frank\" Philbin, a U.S. Marine who served in the Pacific, was of Irish heritage.[14] His mother, Filomena \"Florence\" (née Boscia), was from an Italian immigrant family of Arbëreshë (ethnic Albanians from Italy) descent from Greci, Campania.[3] They lived in the Van Nest section of the Bronx.[15] Philbin had a Catholic upbringing.[14] He was supposedly named \"Regis\" because his father wanted him to attend the prestigious Regis High School. It was long believed that Philbin was an only child, but on the February 1, 2007 broadcast of Live with Regis and Kelly, Philbin announced that he did have a brother, Frank M. Philbin (March 1, 1951 – January 27, 2007), who had died from non-Hodgkin lymphoma several days earlier.[16] Philbin said his brother, 20 years younger than him, had asked not to be mentioned on television or in the press.[17]\n\nPhilbin attended Our Lady of Solace grammar school in the Bronx,[18] and graduated from Cardinal Hayes High School[1] in the Bronx in 1949 before attending the University of Notre Dame, from which he graduated in 1953 with a sociology degree.[16] He later served in the United States Navy as a supply officer, then went through a few behind-the-scenes jobs in television and radio before moving into the broadcasting arena.[16]\n\nIn his earliest show business work, Philbin was a page at The Tonight Show in 1955.[19] Later he wrote for Los Angeles-based talk show host Tom Duggan and nervously filled in one night when the hard-drinking Duggan didn't show up.[20] He also was an announcer on The Tonight Show in 1962.[4] In 1957, Regis left his job as assistant news editor to Baxter Ward at KCOP, Los Angeles to make his fortune in New York. His replacement at KCOP was George Van Valkenburg.\n\nHis first talk show was The Regis Philbin Show[1] on KOGO-TV (now KGTV) in San Diego. For financial reasons, he had no writing staff, so he began each show with what has become his hallmark, the \"host chat\" segment (influenced by Jack Paar), where he engaged his audience (and later his co-host) in discussions about his life and the day's events. In 1964, Westinghouse Broadcasting picked up Philbin's talk show for national syndication in the late night time slot (replacing Steve Allen). The show failed to attract many stations and Westinghouse replaced Philbin with Merv Griffin.\n\nPhilbin gained his first network TV exposure in 1967 as Joey Bishop's sidekick on The Joey Bishop Show[21] on television (1967–1969). In a Johnny Carson-Ed McMahon vein, Bishop would playfully tease Philbin and he would take the barbs in stride. But his feelings were hurt when he learned from the network grapevine that ABC executives were dissatisfied with his work and his thick accent, so during the opening of one 1968 program, he launched an unplanned diatribe about \"not being wanted and letting down\" the program and abruptly quit on air. A few nights later, assured by Bishop that all was well and the barbs were not personal, Philbin returned. As revealed in his book, How I Got This Way, this was actually all a ruse planned by Bishop and Regis to steal the spotlight and attract some of Johnny Carson's viewers. When The Joey Bishop Show was canceled, Bishop returned the favor and walked off the show on the air unannounced, leaving Philbin to successfully carry the night on his own.\n\nTalk show career [ edit ]\n\nIn 1964, Philbin took over the show that replaced The Steve Allen Show when Steve Allen left the show.[22] The audience did not accept Philbin as a replacement for Allen's zany antics and the appearance lasted only a little over four months because of dismal ratings. Johnny Carson was too strong in the ratings for the same time slot. According to Philbin, Carson was his inspiration (PBS, 2008, Pioneers of Television).[citation needed]\n\nFrom 1975 to 1981, he co-hosted A.M. Los Angeles, a local morning talk show on KABC-TV,[23] first with Sarah Purcell (1975 to 1978), then with Cyndy Garvey (1978 to 1981).[23] Philbin's presence brought the show from the bottom of the local ratings to No. 1.[24]\n\nDuring the early 1970s, Philbin also commuted each weekend to St. Louis, where he filmed Regis Philbin's Saturday Night in St. Louis[23] on KMOX-TV (now KMOV).\n\nA 1978 book called The Great 1960s Quiz, authored by Dan Carlinsky (pub. Harper & Row), asked, \"Who was Regis Philbin?\" (p. 7) The answer was \"Joey Bishop's sidekick on his late night show.\" (p. 124) Philbin's seemingly trivial national media presence would soon be revived.\n\nIn 1981, Philbin and Mary Hart co-hosted a national morning variety series for NBC. The show lasted 18 weeks.[25]\n\nAfter Garvey left Los Angeles in 1982 and moved to New York City,[23] Philbin rejoined her on The Morning Show,[23] on WABC-TV.[23] At the time, the 9 am time slot for WABC suffered from low Nielsen ratings because of competition from WNBC-TV's Donahue and WCBS-TV's game show block featuring The Joker's Wild and Tic Tac Dough. After Garvey left again and Ann Abernathy briefly shared co-hosting duties, Philbin was paired with Kathie Lee Johnson (later Gifford), in June 1985, and ratings improved significantly. The show became nationally syndicated in September 1988 as Live! with Regis and Kathie Lee[23] and the success continued. The program replaced A.M. Los Angeles upon its cancellation in 1991 and was eventually picked up by all of the ABC owned-and-operated stations except for WLS in Chicago, which aired The Oprah Winfrey Show in that time slot and had done so since the show's debut as A.M. Chicago.\n\nIn the 1980s, Philbin hosted Lifestyles with Regis Philbin on the Lifetime television network.[26]\n\nWhen Gifford departed in 2000,[27] the show was temporarily named Live! with Regis.[27] Philbin had guest co-hosts until a replacement was found.[27] Philbin won a Daytime Emmy Award for Outstanding Talk Show Host in 2001.[27] Kelly Ripa was chosen as the permanent co-host in 2001, and the show was renamed Live! with Regis and Kelly.[27] Their chemistry proved to be successful as the show continued to enjoy high ratings.[citation needed]\n\nPhilbin set a Guinness World Record for \"Most Hours on Camera\" on his August 20, 2004, Live show (replacing Hugh Downs), which gave him a total of 15,188 hours on television.[7] On the September 14, 2006, episode of Live, his record was updated to 15,662 hours.[28]\n\nRegis Philbin in 2009\n\nIn 2008, Philbin's contract with ABC was renewed through 2011.[29] Under this contract, Philbin reportedly earned more than US $21 million. He received a similar contract with CBS for hosting Million Dollar Password.[29]\n\nIt was announced on the September 17, 2009, episode of Live with Regis and Kelly during their World Record Breaker week, that Philbin's Guinness Book World Record for most time spent in front of a TV camera had reached 16,343 hours.\n\nGame show career [ edit ]\n\nPhilbin was also a game show host. He hosted The Neighbors, a short-lived game show on ABC from late 1975 to early 1976. The show had two female contestants guessing which of her three women neighbors said gossipy things about her.[4] In 1976, he was a \"field reporter\" for ABC's Almost Anything Goes, an American adaptation of the British game show, It's a Knockout. Both shows suffered from poor ratings.[citation needed]\n\nPhilbin was the original host of the U.S. version of Who Wants to Be a Millionaire, an ABC game show that had its roots in Britain. Millionaire was a big ratings success in its 1999 debut, when it was intended as an occasional special series. ABC aired Millionaire as a regular series with frequent episodes, but its viewership slowly declined. After Millionaire was canceled, it was retooled in 2002 as a syndicated series hosted by Meredith Vieira. ABC brought back Millionaire in 2004 with Philbin, retitled Who Wants to Be a Super Millionaire, a related series that was aired on a more limited basis. Philbin had appeared in 11 episodes of a special edition of Who Wants to Be a Millionaire, which started on August 9, 2009, 10th anniversary of the show.[30] He also was a celebrity contestant in this version. Millionaire, in its syndicated format, uses guest hosts for selected weeks during the season and Philbin hosted a week of episodes that aired in November 2009, coinciding with his 2009 surgery.\n\nPhilbin's Millionaire hosting duties won him a Daytime Emmy Award for Outstanding Game Show Host in 2001. In a 2007 Time article, he was listed among the 15 Best Game Show Hosts in History.[31] When Millionaire was honored on GSN's Gameshow Hall of Fame special, Philbin's tenure as the show's host was praised. Leigh Hampton, then executive producer of the syndicated version, said that he \"[knew] when to take rein of it and when to sit back and let the contestant be the contestant,\"[32] and Jennifer Slater of twogirlsandatv.com called him \"the sweetest man on television.\"[32] Philbin himself recalled his own Millionaire tenure on said special with the following statement:[32]\n\nYou could only have a minute or two with it before the questions began. I did everything I could to make them more available for the right answer. — Regis Philbin\n\nIn November 2005, ABC announced that Philbin would host the network's revival of This Is Your Life. In August 2006, he reported that his option on the contract for the show had lapsed and he declined to renew it.[33]\n\nPhilbin hosted the first season of America's Got Talent, a Simon Cowell-produced amateur talent search show on NBC, during the summer of 2006. He flew between New York City and Los Angeles during that time period to participate in both Live with Regis and Kelly and AGT. Because of his difficulty with commuting cross country and his health problems, he was replaced in 2007 by talk show host Jerry Springer.[34] With regard to filling Philbin's spot, Springer noted that \"no one fills in for Regis. He's the best there ever was at this so you pay homage to him.\"[35]\n\nPhilbin's affiliation with FremantleMedia started to develop at this time. He hosted a revival of the Password franchise entitled Million Dollar Password, which premiered June 1, 2008, and ended in 2009.[36]\n\nOther television appearances [ edit ]\n\nOn December 31, 2004, Philbin filled in for Dick Clark on ABC's Dick Clark's New Year's Rockin' Eve, as Clark was recovering from a stroke. Philbin (who is a year and a half younger than Clark) lightheartedly claimed to have interrupted his previously planned vacation to do the show.[37] The following year, Philbin hosted a competing special for Fox, replacing Clark's new co-host and eventual successor Ryan Seacrest.[38]\n\nPhilbin was also the host of The Apprentice 2 finale on December 16, 2004,[39] and the official 30-minute red carpet arrivals at the 80th Academy Awards ceremony on February 24, 2008.[40]\n\nPhilbin hosted the 37th Daytime Emmy Awards on June 27, 2010.[41]\n\nGuest appearances [ edit ]\n\nPhilbin made regular guest appearances on Late Show with David Letterman.[42] He was often introduced by Letterman as \"Regis Lee Philbin\", a play on his former morning co-host, Kathie Lee Gifford. He has also appeared on other late-night talk shows, such as Jimmy Kimmel Live!, Late Night with Conan O'Brien, The Late Late Show with Craig Ferguson, and Late Night with Jimmy Fallon.\n\nPhilbin has appeared on the sitcoms Spin City, How I Met Your Mother, Mad About You, Hope & Faith, Seinfeld, and The Fresh Prince of Bel-Air, as well as the sketch-comedy program The Dana Carvey Show, \"Chuck\", Mad TV, and The Larry Sanders Show. He appeared in an episode of \"The Big Valley\" called \"The Challenge\" which first aired on March 18, 1968. In 1970, he appeared in an episode of the ABC crime drama The Silent Force.\n\nIn 1991, Philbin was a celebrity guest at WrestleMania VII in Los Angeles, commenting on the main event between Hulk Hogan and Sgt. Slaughter.\n\nIn 1998, Philbin made an appearance in Disney's Hercules as the voice of the mythical monster Typhon. Kathie Lee Gifford was also present as the voice of Typhon's mate, Echidna.\n\nOn December 25, 2000, Philbin appeared as a panelist on the first season championship game of the ESPN game show 2 Minute Drill.\n\nOn February 28, 2004, Philbin guest-starred in a Lilo & Stitch: The Series episode called \"Drowsy\".\n\nOn May 15, 2006, Philbin appeared as a special guest, alongside Howie Mandel, for a two-hour special episode of Deal or No Deal on NBC.\n\nPhilbin has appeared three times on Celebrity Jeopardy!, the most appearances for any competing celebrity on the game show Jeopardy!. In November 2006, he won his competition and earned $50,000 for Cardinal Hayes High School, his alma mater.[43]\n\nPhilbin appeared as a contestant on Celebrity Are You Smarter Than a 5th Grader? in November 2007. He again played for his alma mater, Cardinal Hayes High School. He dropped out of the game and went home with $175,000 for the school.\n\nIn September 2008, Philbin guest starred as himself on How I Met Your Mother,[44] where he joined the cast in the search for New York's best hamburger. The show revealed that he worked out at Barney's gym. During the best-burger hunt, his picture hung in the \"Best Burger\" restaurant and every other suspected best-burger restaurant, such as Corner Bistro and Veggie Heaven. In the show, he hosted a \"show within a show\" called Million Dollar Heads or Tails, which made reference to both Million Dollar Password and Millionaire.\n\nOn December 25, 2009, Philbin attended Christmas Mass with Father Edward L. Beck and Timothy Dolan, the current Archbishop of New York, at The Sunday Mass[45] and gave a special interview discussing how being a Catholic had influenced his life.[46]\n\nIn February 2011, Philbin made an appearance on Take Two with Phineas and Ferb. On July 3, 2011, he was a celebrity guest on The Marriage Ref, along with Tracy Morgan and Susie Essman.\n\nAfter Live! [ edit ]\n\nOn May 29, 2012, Philbin appeared on CNN's Piers Morgan Tonight during the show's Guest Host Week. Philbin's guest was his long-time friend, fellow television host David Letterman.\n\nFrom September 2012 to October 2017, Philbin was an official recurring monthly co-host on Rachael Ray.[47]\n\nIn 2013, while Jon Stewart was absent from The Daily Show, Philbin made a guest appearance, kissing guest-host John Oliver on the head at the end of the interview.\n\nFox Sports announced on March 5, 2013, that Philbin would be hosting Crowd Goes Wild, a daily sports talk show featuring a panel of hosts on their all new national sports network Fox Sports 1, which launched on August 17, 2013. He once again partnered with his producer from Millionaire, Michael Davies.[48][49]\n\nIn February 2014, Philbin announced that he was leaving Fox Sports, only returning to occasionally host Crowd Goes Wild from March until its cancellation of the show on May 8, 2014. He guest hosted two episodes of The Late Late Show in January 2015. On July 9, 2015, Philbin appeared on Today with Kathie Lee and Hoda. It was announced that he was joining the program as an occasional contributor and guest host. Philbin eventually appeared on the program roughly once a month, and sometimes joined Gifford as a guest host on Hoda Kotb's days off.\n\nWritten and musical works [ edit ]\n\nPhilbin is also an author and singer. His two autobiographies (with co-author Bill Zehme), I'm Only One Man! (1995) and Who Wants To Be Me? (2000), are written in the conversational or anecdotal style of his host chats. The former book follows a year (1994–1995) in his life recalling his personal life, his memories with celebrities, and work on Live with Regis and Kathie Lee, among other things. The latter book was a response to the success of Who Wants to Be a Millionaire and deals with the show and his life. In 2011, upon leaving Live!, Philbin released a memoir titled How I Got This Way.[50]\n\nAs a singer, Philbin can best be described as a crooner in the style of his favorite singers: Dean Martin, Perry Como, and Frank Sinatra. He tested the musical waters with his 1968 pop vocal release, It's Time For Regis! After receiving poor reviews, Philbin was reluctant to record another studio album, but he occasionally sang on Live, usually in duet with another singer. After 36 years, he recorded When You're Smiling (2004), a more mature-sounding pop standards album. The Regis Philbin Christmas Album was released September 2005. This album features several duets, with close friend Donald Trump (\"Rudolph the Red-Nosed Reindeer\"), Steve Tyrell (\"Marshmallow World\"), and wife Joy (\"Baby, It's Cold Outside\" and \"Winter Wonderland\"). A special edition of the album was produced with tracks recorded with the Notre Dame Glee Club.[51] Philbin is signed on to Hollywood Records.[citation needed]\n\nPersonal life [ edit ]\n\nPhilbin and his wife Joy in New York City, 2009\n\nPhilbin has been married twice and has four children. He was married to Catherine \"Kay\" Faylen, daughter of actor Frank Faylen, from 1955 to 1968, and they had Amy and Daniel. He has been married to interior decorator Joy Senese since 1970 and they had Joanna, and Jennifer \"J. J.\". Joy Philbin occasionally co-hosted with her husband Regis. On Live, he often mentioned Joy, and to a lesser degree, Joanna, J.J., Amy, and Danny. Philbin spends time between his home in Greenwich, Connecticut, condo in Beverly Hills, California and apartment on the Upper West Side of Manhattan across from the WABC-TV studios.\n\nPhilbin follows the professional sports world extensively, enjoying baseball as well as football. He is an avid fan of the New York Yankees and a proud supporter of the sports teams of his alma mater, the Notre Dame Fighting Irish. Philbin narrated the two audio CDs that accompanied Joe Garner's book, Echoes of Notre Dame Football: Great and Memorable Moments of the Fighting Irish, and was unwilling to waver even when St. John's basketball coach Steve Lavin asked Regis to trade his allegiance.[52] Philbin played on the Notre Dame tennis team (putting his recent statements in an ad where he claimed to have learned tennis from second wife Joy, in doubt). Notre Dame football coaches such as Charlie Weis, Tyrone Willingham, and Lou Holtz have appeared on Live. Along with being a Yankees fan, Regis is also \"keeping an eye on the Florida Marlins.\"[53] On May 5, 2009, he delivered the first pitch at a Marlins game. He has also supported the Pittsburgh Pirates in recent years.[54]\n\nIn March 1984, Philbin opened a Ford dealership in Gilbert, Arizona, as a side investment during his career in television. The dealership, Philbin Ford, suffered due to the already saturated auto market in the area, and was closed in late 1988.[55]\n\nHe is known to have trouble handling new technology and is frequently confused when operating electronics (such as remote controls and DVD players). He does not usually use computers (although he did use one for an episode of Live during summer 2008, demonstrating how to find homes online) and did not own a cell phone until September 10, 2008. It is often noted, however, that Philbin does not completely reject the technology; he simply has Joy make calls and send e-mails for him.[56]\n\nHealth [ edit ]\n\nPhilbin had an angioplasty in 1993.[57][58] On March 14, 2007, he underwent triple bypass surgery at Weill Cornell Medical Center because of plaque in his arteries.[59] Prior to the surgery, Philbin talked with David Letterman, for whom Philbin had substituted on Late Show with David Letterman during Letterman's own quintuple bypass surgery.[59] Following Philbin's successful heart surgery, he returned to the show on April 26.\n\nOn December 1, 2009, Philbin had hip-replacement surgery.[60][61] He returned on Monday, January 4, 2010, to his regular hosting duties.[62]\n\nIn May 2010, Philbin underwent surgery to have a blood clot removed from his calf. He returned to work the next day.[63]\n\nPopular culture [ edit ]\n\nPhilbin was cast as car salesman Handsome Hal on Kelly Ripa's sitcom Hope & Faith, once playing the piccolo in this role.\n\nHe was chosen as the voice of a minor female character in Shrek the Third: Mabel, the sister of the Ugly Stepsister (played by Larry King).\n\nIn the Animaniacs episode \"Pigeon on a Roof\" (a Goodfeathers musical parody of Fiddler on the Roof), a key plot element involves toppling a statue of Martin Scorsese and replacing it with one of Philbin.\n\nSeveral Hey Arnold! episodes featured a talk show that parodied Live! with Regis and Kathie Lee and included a male host who parodied Philbin's extreme excitability.\n\nPhilbin was frequently parodied by comedian Alex Borstein on Mad TV.\n\nHe is mentioned in Christian artist Steven Curtis Chapman's song \"Live Out Loud.\"\n\nIn the How I Met Your Mother Episode: \"The Best Burger in New York\", Philbin guest-starred as himself. There are also pictures of Philbin displayed in the background of all the burger restaurants.\n\nWho Wants to Be a Millionaire [ edit ]\n\nDuring the successful first run of Who Wants to Be a Millionaire, Philbin popularized the monochromatic look in men's formal wear that emphasizes color rather than pattern in ties and dress shirts. His look was a suit, shirt and tie coordinated in solid, slightly varying shades of the same, usually dark or muted, color.[42] A Van Heusen clothing line based on this look, called Regis, was short-lived.[64]\n\nWhen Philbin hosted Who Wants to Be a Millionaire, he used the phrase \"Is that your final answer?\" whenever he had to confirm a contestant's answer. Adopted from the original UK host Chris Tarrant, this became Philbin's catch phrase during his tenure with the show.\n\nIn August 2009, Philbin returned for a two-week stint as host of Millionaire. The eleven shows (Sunday-to-Thursday twice, plus one extra Sunday) started airing on August 9 on ABC primetime.\n\nPhilbin (along with Steve Harvey and John Henson) were named the 2009–10 guest hosts of the daily Millionaire. Philbin's episodes aired November 30 – December 4, 2009, and debuted new rules on the show.\n\n2007 Neiman Marcus Christmas Book [ edit ]\n\nIn October 2007, Philbin was featured in the 100th anniversary issue of the Neiman Marcus Christmas Book. He was a host of the Classical Superstars Fantasy Concert, which included piano virtuoso Lola Astanova with Russia's Kirov Orchestra led by conductor Valery Gergiev. The super concert for 500 guests was offered for sale at $1.6 million.[65]\n\nAwards and honors [ edit ]\n\nIn Morris Park, Bronx, Cruger Avenue between Sagamore Street and Bronxdale Avenue was co-named Regis Philbin Avenue.[66]\n\nRegis Philbin's star at the Hollywood Walk of Fame\n\nCredits [ edit ]\n\nTelevision [ edit ]\n\nFilms [ edit ]\n\nDiscography [ edit ]\n\nStudio albums Year Album details Peak positions US 1968 It's Time for Regis! Released: 1968\n\nLabel: Mercury Records — 2004 When You're Smiling Released: September 28, 2004\n\nLabel: Hollywood Records 54 2009 Just You. Just Me. Released: November 24, 2009\n\nLabel: Big Dot Records 9 \"—\" denotes releases that did not chart Holiday albums Year Album details Peak positions US US Holiday UK 2005 The Regis Philbin Christmas Album Released: September 27, 2005\n\nLabel: Hollywood Records 74 9 163\n\nSingles\n\nBooks [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Regis_Philbin_2000.jpg/220px-Regis_Philbin_2000.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Regis_Philbin_Star_HWoF.jpg/220px-Regis_Philbin_Star_HWoF.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/43/Croppedregisphilbin.jpg/170px-Croppedregisphilbin.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Regis_Philbin_2000.jpg/1200px-Regis_Philbin_2000.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Regis_Philbin_and_Joy_Philbin_in_2009.jpg/220px-Regis_Philbin_and_Joy_Philbin_in_2009.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Wikinews-logo.svg/40px-Wikinews-logo.svg.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Regis_Philbin_2000.jpg/1200px-Regis_Philbin_2000.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Regis_Philbin", "title": "Regis Philbin", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.27", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Regis_Philbin_2000.jpg/1200px-Regis_Philbin_2000.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}