{"url": "http://wfpl.org/post/mitch-mcconnell-alison-lundergan-grimes-have-sharp-differences-campaign-finance-rules", "text": "Republican Senator Mitch McConnell and Democratic challenger Alison Lundergan Grimes sit on opposite sides of the debate about the role of money in U.S. elections.\n\nA deluge of campaign cash is playing a significant role in Kentucky’s Senate race thus far.\n\nThe money raised by the campaigns and outside groups is expected to top the $100 million mark and go down as the most expensive in U.S. history.\n\nMore than any lawmaker, McConnell is the face of loosening—if not, eliminating—campaign finance regulations.\n\nFor over a decade the GOP leader has espoused that money and free speech are synonymous. He has filed legal briefs urging the Supreme Court to reaffirm its Citizens United decision and supports a controversial case to further deregulate contribution limits placed on individuals.\n\nIn a March 17 e-mail to supporters, Grimes took a strong stance against the influence wealthy donors are having and calls out McConnell as the chief architect and beneficiary of that system.\n\n“Special interest money has already flooded into Mitch McConnell’s campaign,” Grimes said. “He’s the number one recipient of contributions from lobbyists this cycle and his Karl Rove-affiliated Super PACs are clogging the Commonwealth’s airwaves with negative attack ads. Enough is enough—our democracy is too important to be auctioned off to the highest bidder.”\n\nGrimes has played it safe on the campaign trail when faced with thornier issues outside of core Democratic principles, such as raising the minimum wage. But given the left’s apoplectic reaction to the Roberts Court’s dismantling limitations and the rise of super PACs, her position is receiving applause from watchdog groups.\n\n“It’s very good that Alison Grimes has come out in support of a policy that puts regular people in charge of government again,” says David Donnelly, who is executive director of Public Campaign Action Fund. “She understands that money in politics drowns out the voices of every day Kentuckians. This is a sharp difference between her and McConnell, someone who is advocating the make the problem worse.”\n\nThe Grimes campaign message also directs voters to sign a petition calling on Congress to “stop special interest billionaires,” that has the support of red state Democratic senators such as Joe Donnelly of Indiana and Joe Manchin of West Virginia.\n\nIn the 2014 election cycle, there are almost 1,000 registered super PACs that have generated over $141 million and spent more than $24.8 million on races.\n\nAccording to the non-partisan Center for Responsive Politics, the pro-McConnell super PAC Kentuckians for Strong Leadership is among the ranks among the top ten groups in this year’s races.\n\nDemocrats and liberal activists decrying the influence of money in politics have themselves pointed out its limitations in Kentucky’s Senate race.\n\nMcConnell has spent over half of the $20 million he’s raised this cycle and he has a number of outside groups spending millions in advertisements supporting his re-election. Yet McConnell’s approval ratings remain terribly low and Grimes either leads or ties the GOP leader in most polling.\n\nFormer FEC Chairman Michael Toner says despite arguments that the wealthy are purchasing American elections, those independent expenditure committees haven’t always worked out for candidates.\n\n“One reason the federal courts over the years have not found a corruption threat at the independent spending is that sometimes it’s not that effective in directly advancing a candidate’s interest,” he says.\n\n“A lot of candidates who spend more money than their opponents whether out of their own pocket or let’s say supported by major outside groups, their track record in winning elections is not that good to be honest. We’ve seen a lot of multi-millionaire candidates who are defeated in various races. Now to be sure some are also elected, but by now means is the candidate with the most money spent on their behalf assured of being elected.”\n\nGrimes has raised $4.5 million since entering the race last year and been all over the country at fundraisers with big name Democratic donors. She outpaced McConnell’s money machine during the third quarter and Democratic-affiliated groups have also spent money attacking McConnell in television ads.\n\nThe McConnell campaign was quick to point out that while Grimes is criticizing Citizens United, she is also benefiting from attack ads against the senator from outside liberal groups who praise her position.\n\n“Like Barack Obama, Alison Lundergan Grimes is obviously much more concerned with political convenience than Constitutional protections,” McConnell campaign spokeswoman Allison Moore told WFPL. “The sad part is that she apparently sees no irony in the fact the special interest group who successfully persuaded her to embrace trampling on our First Amendment rights in the name of money in politics is the same one running hundreds of thousands of dollars of advertising on her behalf.”\n\nThe top expenditures in 2014 have been super PACs with liberal viewpoints such as Senate Majority PAC, which has slammed McConnell in TV ads.\n\nAsked about Grimes’ wealthy donors, Donnelly says all elected officials and candidates are implicated but that what lawmakers do in Washington matters.\n\n“The real distinction is what are you going to do to clean it up and propose pro-actively to make the system better,” he says. “And on that score voters know in Alison Grimes they have someone who is going to champion the issue and that in Mitch McConnell who is going to make the problem worse.”", "images": ["http://pixel.locker2.com/image/oNyKAraNtBEvCqnoM.png", "http://www.google-analytics.com/__utm.gif?utmac=UA-5828686-12&utmdt=Mitch+McConnell%2C+Alison+Lundergan+Grimes+Have+%27Sharp+Differences%27+on+Campaign+Finance+Rules&utme=8(APIKey)9(MDA5MDc2MjY5MDEzMzAyMDEwMDQ4MGM3OA004)", "http://mediad.publicbroadcasting.net/p/wfpl/files/styles/card_280/public/201305/MitchGrimes.jpg", "https://wfpl.org/wp-content/uploads/2014/03/MitchGrimes.jpg"], "top_img": "https://wfpl.org/wp-content/uploads/2014/03/MitchGrimes.jpg", "keywords": [], "authors": ["Phillip M. Bailey"], "canonical_link": "https://wfpl.org/mitch-mcconnell-alison-lundergan-grimes-have-sharp-differences-campaign-finance-rules/", "title": "Mitch McConnell, Alison Lundergan Grimes Have 'Sharp Differences' on Campaign Finance Rules", "meta_data": {"fb": {"pages": 33077174555}, "viewport": "width=device-width, initial-scale=1, user-scalable=no", "author": "Phillip M. Bailey", "category": "Politics", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Mitch McConnell, Alison Lundergan Grimes Have 'Sharp Differences' on Campaign Finance Rules | 89.3 WFPL News Louisville", "description": "Republican Senator Mitch McConnell and Democratic challenger Alison Lundergan Grimes sit on opposite sides of the debate about the role of money in U.S....", "url": "https://wfpl.org/mitch-mcconnell-alison-lundergan-grimes-have-sharp-differences-campaign-finance-rules/", "site_name": "89.3 WFPL News Louisville", "updated_time": "2014-10-14T15:54:24+00:00", "image": {"identifier": "https://wfpl.org/wp-content/uploads/2014/03/MitchGrimes.jpg", "secure_url": "https://wfpl.org/wp-content/uploads/2014/03/MitchGrimes.jpg", "width": 444, "height": 282}}, "article": {"publisher": "https://www.facebook.com/wfpllouisville", "section": "Politics", "published_time": "-0001-11-30T00:00:00+00:00", "modified_time": "2014-10-14T15:54:24+00:00"}, "twitter": {"card": "summary", "description": "Republican Senator Mitch McConnell and Democratic challenger Alison Lundergan Grimes sit on opposite sides of the debate about the role of money in U.S....", "title": "Mitch McConnell, Alison Lundergan Grimes Have 'Sharp Differences' on Campaign Finance Rules | 89.3 WFPL News Louisville", "site": "@WFPLNews", "image": "https://wfpl.org/wp-content/uploads/2014/03/MitchGrimes.jpg", "creator": "@WFPLNews"}, "generator": "AMP for WP 1.0.39", "msapplication-TileImage": "https://wfpl.org/wp-content/uploads/2016/10/cropped-wfpl-270x270.gif"}, "movies": [], "publish_date": -62106825600.0, "source": "http://wfpl.org", "summary": ""}