{"url": "https://en.wikipedia.org/wiki/Rey_(Star_Wars)", "text": "Fictional character in Star Wars\n\nRey is a fictional character in the Star Wars franchise and the main protagonist of the sequel film trilogy. She was created by Lawrence Kasdan, J.J. Abrams, and Michael Arndt for The Force Awakens (2015), the first installment of the trilogy, and is portrayed by Daisy Ridley.[1][8][9][10] She appears in the sequels The Last Jedi (2017) and The Rise of Skywalker (2019).\n\nIn the films, Rey is a scavenger who was left behind on the planet Jakku when she was a child, and later becomes involved with the Resistance's conflict with the First Order. Powerful with the Force, Rey trains to be a Jedi under Luke Skywalker and General Leia, and faces adversaries such as Supreme Leader Snoke, Kylo Ren, and Emperor Palpatine; the latter is revealed to be her grandfather in The Rise of Skywalker.\n\nDevelopment\n\nCreation and casting\n\nEpisode VII Rey's costume from\n\nScreenwriter Michael Arndt said that he found Lucasfilm President Kathleen Kennedy's offer to write Episode VII daunting in mid-2012, but he became interested when it was explained to him that the tale was about the origin story of a female Jedi and he met with George Lucas.[11] The character was known as Kira in the early stages of production, and Arndt described her as a \"loner, hothead, gear-head, badass\". Arndt said that he struggled with introducing the young woman as the main character in his story while keeping her from being overshadowed after her early meeting with Luke Skywalker, whose role in the film was eventually minimized.[11] Ridley recalled that director and writer J. J. Abrams originally intended to name the character \"Keera\" [sic], but during filming in Abu Dhabi, Abrams revealed to Ridley that he was thinking of going with \"Rey\".[13]\n\nOn creating a female lead for the new trilogy, Abrams stated that from his initial discussions with writer Lawrence Kasdan, he was excited at the concept of having a woman at the center of the story. He said that \"We always wanted to write Rey as the central character\" and that other female representation in the story was also important.[1] Kennedy stated that, \"Rey is the new generation's Luke Skywalker.\"[14] Rey's background as a scavenger was part of the developers attempting to portray her as \"the ultimate outsider and the ultimate disenfranchised person\", due to their belief that a person of that nature would likely experience a prolonged journey compared to other types of people.[15]\n\nDaisy Ridley was largely unknown before being cast for the role of Rey. Ridley said that she auditioned many times for the role over the course of seven months and had to keep her casting a secret for three months.[16] She was announced as part of the cast at the end of April 2014. She only had experience with small parts in TV shows. Her inexperience and lack of exposure were a crucial part of what convinced Abrams to give Ridley the role, as the previous installments had featured relatively unknown talent that would not experience heightened degrees of scrutiny.[17] Abrams stated that Ridley \"was so funny and had a great spark\", as well as having her act out an emotional scene, proclaiming that \"she nailed it on the first take.\" Abrams went on to praise Ridley, saying, \"She was born with this gift to be in a moment and make it her own. She simultaneously works from the inside out and the outside in.\"[18] Kennedy proclaimed, \"Daisy had a physicality and a self-confidence that was so important to the character we were looking for. She epitomizes that optimism where anything is possible.\"[18] Director Dusan Lazarevic, who was present at the casting of Ridley for a role in British drama series Silent Witness, in addition to praising her acting range, stated, \"She showed a combination of vulnerability and strength which gave her a complexity, and there was an intelligence in her eyes that was an indicator she could play quite a complicated part.\"[17] Cailey Fleming was additionally cast to portray a young Rey.[2]\n\nAlthough Ridley said she was \"riddled with doubts and insecurities\", she said that Rey's hopefulness is what she related to most: it \"was something driving me through the auditions—even though it felt so insanely out of anything that I could've imagined.\"[19] Ridley recalled her shooting experience as starting off bumpy, with Abrams telling her that her first few takes were \"wooden\".[20] But Ridley and Abrams had an \"incredibly collaborative\" process creating Rey; Ridley recalled that the character \"changed from when we first began, she became softer. And I think that's probably me, because Americans tend not to understand me, so it helped, slowing down the speech and everything just made it softer than I am.\"[19] Ridley has said that Rey will have \"some impact in a girl power-y way\", adding that the character \"doesn't have to be one thing to embody a woman in a film. It just so happens she's a woman but she transcends gender. She's going to speak to men and women.\"[21] In an interview with Elle, Ridley said, \"She's so strong. She's cool and smart and she can look after herself,\" adding, \"Young girls can look at her and know that they can wear trousers if they want to. That they don't have to show off their bodies.\"[18]\n\nComposer John Williams said he immediately loved Ridley in the film and found composing her theme an interesting challenge. He said that her theme does not suggest a love theme, but rather a strong female adventurer character infused with the Force for a mature, thoughtful theme.[22] He added that the \"musical grammar\" of Rey's theme is not heroic, but conveys \"an adventurous tone that needs to illustrate empathy.\"[23]\n\nCharacterization\n\nRey is introduced as a 19-year-old woman in The Force Awakens.[24] She is stubborn, headstrong, brave, optimistic, and maintains fierce loyalty to her friends. Matthew Yglesias of Vox wrote, \"Rey is considerably less callow than Luke\".[25][26]\n\nMegan Garber of The Atlantic argued that Rey \"proves herself to be, in extremely short order, extremely adept as a fighter\".[27] Rey is highly Force-sensitive, which is revealed when she is presented with the lightsaber first owned by Anakin Skywalker, then his son Luke.[28] Without training, she is able to use advanced Force abilities and even defeat Kylo Ren in a duel, though he was already injured and using his power of the dark side to fight being weakened by his pain.[29] Adrienne Tyler of Screen Rant argued that these abilities are explained in The Rise of Skywalker as resulting from the pair forming a dyad in the Force, sharing the same fighting capabilities.[30]\n\nAppearances\n\nFilm\n\nThe Force Awakens (2015)\n\nRey is first introduced as an orphan living alone on the desert planet Jakku, scraping a living through scavenging parts from ships. She rescues the astromech droid BB-8 and encounters Finn (John Boyega), a former stormtrooper. Attacked by First Order troops, Rey steals and pilots the Millennium Falcon to evade them and escape Jakku. Smuggler Han Solo (Harrison Ford) and Wookiee Chewbacca (Peter Mayhew) take back the Falcon in their freighter ship. She saves Finn and they escape the freighter in the Falcon. Impressed with Rey's bravery and piloting skill, Han offers her a job on the Falcon; however, Rey declines his offer, feeling that she has to return to Jakku.\n\nAfter they convene at Maz Kanata's (Lupita Nyong'o) castle on the planet Takodana to return BB-8 to the Resistance, the First Order is alerted to their presence. Rey visits the castle's basement vault in which Maz has stored a lightsaber that once belonged to Luke Skywalker (Mark Hamill) and his father before him. Upon touching it, she experiences a terrifying vision: she sees a battle led by First Order enforcer Kylo Ren (Adam Driver), a flashback of her younger self being left behind on Jakku, and a vision of Luke, the last Jedi Master in the galaxy, who has been missing for several years. Maz debates that whoever abandoned her will never return to Jakku, and her only option is to seek out strength in the Force. Feeling overwhelmed, Rey rejects the lightsaber and flees into the forest.\n\nThe First Order attacks Maz's castle, and Ren captures Rey when the Resistance arrives. Ren takes her to Starkiller Base, where he probes her mind for the map piece that BB-8 showed her. Ren uses the Force to read Rey's mind, revealing Rey feels that Han is like the father she never had. Rey then resists him and reads Ren's emotions, exposing his fear that he will never be as powerful as his grandfather, Darth Vader. Ren reports to his master, Supreme Leader Snoke (Andy Serkis), who commands that Rey should be brought before him. Left alone with a stormtrooper guarding her, Rey uses a Jedi mind trick to get him to help free her. After sneaking around inside the base looking for a way to escape, she is elated to find Finn, Han, and Chewbacca have come for her. They watch in horror as Ren kills his own father, Han.\n\nAs they try to escape the base through the woods, Ren challenges Rey and Finn, using his lightsaber. After Ren seriously injures Finn and disarms him of Luke's lightsaber, Rey uses the Force to retrieve the weapon and battles Ren herself. Initially overpowered, Rey rejects Ren's offer to train her and uses the Force with the lightsaber, disfiguring his face. After escaping the destroyed base in the Millennium Falcon with Chewbacca and the wounded Finn, she returns to the Resistance base. While the Resistance celebrates the victory, Rey mourns Han's death with Leia Organa (Carrie Fisher) and visits Finn, who is still unconscious. She decides to seek out Luke's location, using information provided by BB-8 and the re-activated R2-D2 (Kenny Baker). Rey, Chewbacca, and R2 travel in the Falcon to the oceanic planet of Ahch-To; upon finding Luke, Rey presents him with his longtime lightsaber.\n\nRelated works and merchandising\n\nRey is featured in Star Wars: Before the Awakening (2015) by Greg Rucka, an anthology book for young readers that focuses on the lives of Poe, Rey and Finn before the events of The Force Awakens.[31] Rey's Survival Guide (2015) by Jason Fry is a first-person account from Rey's perspective about herself and her home planet of Jakku.[32] Rey is also a point of view character in the 2015 novelization of The Force Awakens by Alan Dean Foster.[33]\n\nFans noticed a lack of tie-in toys featuring Rey.[34] Hasbro released a version of Monopoly based on The Force Awakens that excluded the Rey character. After receiving criticism, Hasbro stated that they did not include Rey to avoid revealing spoilers, and would be including Rey in future toy releases.[35] Paul Southern, the head of Lucasfilm Licensing, said that they wanted to protect the secrets that \"the Force awakens in Rey\" and that her character carries a lightsaber.[36] He said that demand for Rey products was underestimated.[37][38] Abrams said, \"I will say that it seems preposterous and wrong that the main character of the movie is not well represented in what is clearly a huge piece of the Star Wars world in terms of merchandising.\"[9] Regarding Rey's relative absence in Star Wars merchandising, CBBC presenter and voice actor Christopher Johnson stated: \"It still baffles me to this day that some toy manufacturers don't think that girls want to play with 'superhero' toys and that boys aren't interested in female characters.\"[39]\n\nThe Last Jedi (2017)\n\nRey is one of the key characters of The Last Jedi. Picking up directly where the previous installment left off, Rey presents Luke with his lightsaber, but Luke dismissively throws it aside. Luke eventually agrees to teach Rey the ways of the Force. Rey demonstrates immense raw strength and a clear temptation toward the dark side of the Force that reminds Luke of Kylo Ren, who was once his nephew and student, Ben Solo. All the while, Rey feels a sudden connection through the Force with Ren, who tells her that Luke tried to kill him while he was the Jedi master’s student (Luke later tells her that he was tempted to kill Ben after seeing a vision of the pain and suffering he would cause, but relented). In one of their conversations, Rey and Ren touch hands, and through this Rey swears that she is able to feel conflict within Ren, and becomes determined to turn him back to the light side. Rey asks Luke once more to come with her and rejoin the Resistance, but when he declines, Rey, Chewbacca, and R2-D2 leave without him.\n\nRen takes Rey prisoner and brings her before Snoke (Andy Serkis). Snoke tells her that he created the Force connection between her and Ren as a trap to reach Luke. Snoke tortures and taunts Rey, showing her the attack on the Resistance transports, and eventually orders Ren to kill her. Ren instead kills Snoke, and he and Rey fight Snoke's guards side by side. The duo won, Ren asks Rey to join him and create a new order separate from the legacies of Snoke and Luke, but Rey refuses. In an attempt to get her to turn, Ren gets Rey to admit that her parents abandoned her. Despite the revelation, Rey refuses to join him and uses the Force to summon Luke's lightsaber, but Ren does so, too, resulting in a standoff that ultimately breaks the lightsaber. Shortly afterwards, Resistance leader Vice Admiral Holdo (Laura Dern) rams her cruiser into Snoke's flagship, separating Rey from Ren. Rey subsequently uses Snoke's escape craft to flee the dreadnought as later stated by General Hux.\n\nRey is later revealed to have made her way back to the Millennium Falcon, aiding the Resistance in fighting the First Order’s troops during the Battle of Crait. Despite their valiant efforts, the Resistance loses the battle, and Rey focuses her efforts on finding the surviving Resistance fighters to help evacuate them. Eventually, she finds the Resistance fighters behind a dead end, and uses the Force to move the rocky barrier aside, clearing the path for them to board the Falcon. Rey reunites with Finn and Leia, and meets Poe Dameron (Oscar Isaac) for the first time aboard the Falcon. Rey feels Luke’s death through the Force, and reassures Leia that he met his end with \"peace and purpose\". As she holds the leftovers of Luke's lightsaber, Rey asks Leia how they can rebuild the Resistance from what remains, and Leia, gesturing towards Rey, says that they now have all they need. Unbeknownst to Leia, that includes the fact that Rey stole the sacred Jedi texts from Luke before Yoda's (Frank Oz) ghost burned the tree cave they were in.[40]\n\nThe Rise of Skywalker (2019)\n\nRey is the main protagonist of the trilogy's final film, The Rise of Skywalker, which is set one year following the events of The Last Jedi. Rey is continuing her Jedi training at the Resistance base under the tutelage of Leia. The Resistance announce that the resurrected Emperor Palpatine (Ian McDiarmid) has been manipulating events from the Sith world Exegol and has built a secret armada of Xyston-class Star Destroyers called the Sith Eternal fleet. Rey discovers from Luke's old notes that a Sith wayfinder can lead them to Exegol. Rey, Finn, Poe, Chewbacca, C-3PO, and BB-8 leave for Pasaana, where a clue to the wayfinder's location is hidden. Rey locates the clue—a dagger with Sith inscriptions—with the help of Lando Calrissian (Billy Dee Williams). Meanwhile, Rey continues communicating with Ren; through this correspondence, Ren learns where Rey is and comes for her. Rey confronts Ren, inadvertently allowing Chewbacca to be taken aboard a First Order transport. Attempting to save Chewbacca, Rey accidentally destroys the transport with Force lightning, seemingly killing him. Rey is stricken with guilt, and reveals to Finn that she has been having visions of herself and Ren on the Sith throne.\n\nRey and the others travel to Kijimi, where programmer Babu Frik extracts the location of the Wayfinder—the moon Kef Bir[41]—from C-3PO's memory files. Ren and the First Order follow Rey to Kijimi. Rey senses Chewbacca is alive and the group mount a rescue mission. Rey retrieves the dagger aboard Ren's Star Destroyer Steadfast and has visions of her parents being killed with it; Ren informs her that she is Palpatine's granddaughter. Palpatine had fathered a son who renounced him; he and his wife hid Rey on Jakku, assuming lives as \"nobodies\" to protect her. Palpatine eventually found Rey's parents and had them killed, but never found Rey. Ren also reveals that, as the grandchildren of Sith Lords, they are a dyad in the Force. Ren urges her to join him so they can overthrow Palpatine, but Rey refuses and escapes aboard the Millennium Falcon with her friends.\n\nTogether, they travel to Kef Bir where Rey retrieves the wayfinder on the remains of the second Death Star; upon touching the artifact, she has a vision of herself as a Sith. Having tracked them, Ren destroys the wayfinder and duels Rey. Leia, dying, calls to Ren through the Force; Rey impales him as he is distracted. Sensing Leia's death, Rey uses the Force to heal Ren before escaping aboard his TIE fighter. Disturbed by her Sith lineage, Rey exiles herself on Ahch-To. Luke's Force spirit encourages her to face Palpatine and gives her Leia's lightsaber and his old X-wing. Rey departs for Exegol with the wayfinder from Ren's ship. Meanwhile, Ren resumes his true identity as Ben Solo.\n\nRey transmits her coordinates to the Resistance, allowing them to launch an offensive against the Sith fleet. Rey confronts Palpatine, who demands she kill him in anger for his spirit to pass into her, making her \"Empress Palpatine\". However, Ben arrives and joins Rey. Palpatine absorbs their life energy to restore his full power and incapacitates Ben. He then attacks the Resistance fleet with Force lightning. Weakened, Rey hears the voices of past Jedi, who restore her strength. Palpatine attacks her with his lightning, but Rey deflects it using the Skywalker lightsabers, killing him and herself. Ben uses the Force to revive her at the cost of his own life; Rey kisses Ben before he dies. Rey then returns to the Resistance base and reunites with her friends, celebrating their victory.\n\nSome time later, Rey visits Luke's abandoned childhood home on Tatooine and buries the Skywalker lightsabers, having built her own in a golden color.[42] A passerby asks Rey her name; after seeing the Force spirits of Luke and Leia, she responds, \"Rey Skywalker\".[43]\n\nRelated works\n\nThe novelization of The Rise of Skywalker reveals that Rey's father was a nonidentical clone of Palpatine.[44] An upcoming issue of the comic book series Star Wars Adventures will feature a story set after the events of the film featuring Rey, Finn, and Poe continuing to fight the First Order.[45]\n\nTelevision\n\nStar Wars Rebels (2014)\n\nRey makes a brief cameo as a disembodied voice in the television series Star Wars Rebels, in the episode \"A World Between Worlds\".[46] In the episode, set 16 years before her birth and 35 years before The Force Awakens, the young padawan Ezra Bridger briefly hears some of her lines from the film (specifically her speaking to the unconscious Finn at the end) in the World Between Worlds, a dimension that exists outside of time and space.[47]\n\nForces of Destiny (2017)\n\nRey stars in the micro-series Star Wars Forces of Destiny, voiced by Daisy Ridley.[3]\n\nVideo games\n\nThe character of Rey appears in the video games Disney Infinity 3.0, Lego Star Wars: The Force Awakens, andStar Wars Battlefront II (2017), both voiced by Ridley,[48] as well as the strategy video game Star Wars: Force Arena.[49] The character was also introduced as a player \"skin\" in the game Fortnite.[50]\n\nReception\n\nGeneral\n\nThe character and Ridley's portrayal have received critical acclaim. Joe Morgenstern of The Wall Street Journal proclaimed that Rey is \"a woman warrior with the stylish ferocity of a kung-fu star,\" praising \"the verve [Ridley] must have been born with plus the skill she must have acquired as a young actress coming up in England,\" and stating, \"It's hard to imagine what the movie—and the sequels to come—might have been if they'd cast the wrong person, but here Daisy Ridley is in all her unassuming glory, and all's right with the galaxy.\"[51] Adam Howard of MSNBC stated that \"one of the most pleasant surprises of the film has been the strength of its lead female character,\" adding that some have likened Rey to a \"new feminist icon\".[52] Relatedly, Emily Rome of HitFix argued that Rey is \"everything we wanted in a Star Wars female character,\" praising her for being a character that is \"independent, skilled, scrappy, tough, and doesn't need saving.\"[53] In a personal essay, Nicole Sperling of Entertainment Weekly wrote about her daughters feeling empowered after viewing the film, stating, \"They never commented on how pretty Rey is. They never had to flinch because Rey was a sexual object to some man in power. They just felt strong. Equal.\"[54]\n\nSome fans opined that Rey is too skilled despite her inexperience during The Force Awakens, making her a Mary Sue. Rome wrote that \"the speed with which Rey mastered Jedi mind tricks and lightsaber fighting with zero training is the stuff of fan fiction. Rey is geek feminist wish-fulfillment.\"[53] Tasha Robinson of The Verge said that Rey \"keeps falling into standard-issue damsel-in-distress situations, then capably rescuing herself.\"[55] Robinson wrote \"Rey is kind of a Mary Sue character\" and that \"She's a fantasy wish-fulfillment character with outsized skills, an inhuman reaction time, and a clever answer to every question—but so are the other major Star Wars heroes.\"[55] Other outlets, including Ridley herself, have argued that the term Mary Sue carries an inherent gender bias,[56] and that the male characters from the original trilogy did not face comparable criticism.[57][58] J. J. Abrams stated that \"the people who are getting freaked out are the people who are accustomed to [male] privilege, and this is not oppression, this is about fairness.\" He elaborated, \"You can probably look at the first [Star Wars] movie that George [Lucas] did and say that Leia was too outspoken, or she was too tough. Anyone who wants to find a problem with anything can find the problem. The internet seems to be made for that.\"[59]\n\nRey's unique hairstyle attracted attention before and after The Force Awakens was released,[60] being compared to Leia's hairdo from the original film, with debate over whether it would become as popular.[61] Rey has also been compared to the titular character from the Hayao Miyazaki anime film Nausicaä of the Valley of the Wind (1984).[62]\n\nRichard Roeper described Ridley's portrayal of Rey as \"a breakout performance\", continuing by calling the character \"tough and resourceful and smart and brave\".[63] Ridley was nominated for a 2016 Saturn Award for Best Actress for her portrayal.[64] The first Reel Women in Technology Award for a fictional character was awarded to the character Rey.[65]\n\nSome fans criticized Rey's trilogy-wide character arc as insufficient. Fan fiction author Ricca said that tension that was built in the first two films never gets resolved in the last film. She wanted a moment at the end of The Rise of Skywalker in which Rey reacted to and reflected on everything that has happened to her.[66]\n\nParentage\n\nThe question of Rey's parentage was a significant point of discussion for the series, and spawned numerous fan theories.[67][68] The most popular theories were that she is the daughter of Luke Skywalker or Han Solo, or is Obi-Wan Kenobi's granddaughter (because of a scene where Rey hears Kenobi's echoed voice following a vision in The Force Awakens).[67][69][70] The view that she is Luke's daughter was especially prominent, with fans and critics highlighting their story arc similarities, Star Wars being a Skywalker saga, Rey having a strong attachment to Luke's lightsaber, and being exceptionally strong with the Force without any training.[69][70][71] Some fan theories about Rey's parentage pointed to \"Rey's Theme\" featured in John Williams' score of The Force Awakens, as the theme shared similarities with the themes for Darth Vader and Luke.[72]\n\nAbrams stated that he intentionally withheld Rey's last name and background in The Force Awakens.[73] He said that he felt that the origin of Kylo Ren was the only thing that could be revealed in his film and that he knew \"quite a bit\" about Rey's origin but would give courtesy to The Last Jedi director Rian Johnson by not saying any more.[74][75] Former Star Wars: Episode IX director Colin Trevorrow stated that the answer of Rey's origin would be \"deeply and profoundly satisfying\" and that Rey is \"important in this universe, not just in the context of The Force Awakens, but in the entire galaxy. She deserves it.\"[76] Ridley said that she knew who Rey's parents were.[16]\n\nIn The Last Jedi, a conversation between Rey and Kylo Ren implies that Rey's parents were insignificant. Rey is coaxed by Kylo into admitting they were \"nobodies\", a revelation that Kylo tells Rey she already knew.[77] Emily VanDerWerff of Vox equated this scene with Luke finding out that Darth Vader is his father, which was his greatest nightmare.[77] To VanDerWerff, \"Rey's greatest nightmare is being no one.\" She added that Kylo Ren \"has every reason to be lying\" in this instance because \"he's trying to get Rey to let the past—Jedi, Sith, Rebellion, Empire, First Order, etc. ...—crumble to dust,\" but that \"in a weird way, it's a kind of meta-commentary on a franchise that is seeking a new future, while still being indebted enough to its past that it continually recycles itself.\" She said that it is a good thing that \"Rey is the child of nobody of particular importance to the story so far.\"[77] Josh Spiegel of The Hollywood Reporter stated that although some fans may be disappointed by the revelation that Rey's parents are nobodies, \"it fits in perfectly with the message Rian Johnson sends all the way to the very last scene\" which is that \"knowing that Rey is both exceptionally gifted in the Force and also not a Skywalker\" and that \"the spirit of the Jedi extends beyond those like Luke, to anyone with a gift and the power to believe.\"[78]\n\nConversely, although Casey Cipriani of Bustle recognized that Kylo Ren might be right about Rey's parents, she opined that he is unreliable and that \"we have to take what he says with a grain of salt and look elsewhere [within the story] for hints of Rey's lineage.\"[71] Before the release of Episode IX – The Rise of Skywalker, Abrams said that \"there's more to the story than you've seen,\"[79] though according to Ridley the facts presented in The Last Jedi will not change.[80] In The Rise of Skywalker, it is revealed that Rey is the granddaughter of Palpatine (also known as Darth Sidious). After the defeat of the Sith lord, Rey travels to Tatooine. There, in reflection and response to an appearance from a reunited Luke and Leia as Force spirits, she declares her name to be Rey Skywalker.\n\nFamily tree\n\nReferences\n\nSources\n\nSzostak, Phil (2015). The Art of 'Star Wars: The Force Awakens' . New York City: Abrams Books. ISBN 9781419717802 .\n\nFurther reading", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/a/af/Rey_Star_Wars.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/21px-Video-x-generic.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Star_Wars_Launch_Bay_Skywalker%27s_Lightsaber.jpg/220px-Star_Wars_Launch_Bay_Skywalker%27s_Lightsaber.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Star_Wars_and_the_Power_of_Costume_July_2018_27_%28Rey%27s_costume_from_Episode_VII%29.jpg/220px-Star_Wars_and_the_Power_of_Costume_July_2018_27_%28Rey%27s_costume_from_Episode_VII%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Dragon-149393.svg/20px-Dragon-149393.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/af/Rey_Star_Wars.png/220px-Rey_Star_Wars.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/a/af/Rey_Star_Wars.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Rey_(Star_Wars)", "title": "Rey (Star Wars)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/a/af/Rey_Star_Wars.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}