{"url": "https://en.wikipedia.org/wiki/Chad_Kroeger", "text": "Chad Robert Kroeger [5] (né Turton; born November 15, 1974) is a Canadian singer, songwriter, musician, producer, and entrepreneur. He is best known as the lead vocalist and guitarist for the rock band Nickelback.[6] In addition to his work with Nickelback, Kroeger has been involved with a variety of collaborations, appearing as a guest musician in several songs and has contributed in both production and songwriting. He has co-written several songs for other artists and films.\n\nEarly life\n\nKroeger was born Chad Robert Turton in Hanna, Alberta, on November 15, 1974.[7][8] His maternal grandfather, politician Henry Kroeger, was born in Moscow to a Mennonite family of German descent.[9][10] After his father left the family when he was two, he started going by his mother's maiden name of Kroeger.[9] He learned to play the guitar at age 13.\n\nCareer\n\nNickelback\n\nIn the early 1990s, Kroeger was part of a grunge cover band, Village Idiot, with his cousin Brandon Kroeger and future Nickelback members bassist Mike Kroeger (his brother) and singer Ryan Peake. In 1995, Kroeger, Peake, Mike Kroeger, and then drummer Brandon Kroeger,[11] formed the band Nickelback. Kroeger has continued to record and tour with this successful band for more than 20 years.\n\nThe Suits XL\n\nIn 2001, Kroeger, with the help of lawyer Jonathan Simkin, founded the band The Suits XL.[12] Band members included Sam Loubier-Demers and Yohann Gosselin on vocals and guitars, drummer Patrick Paquet, keyboardist Felix-Antoine Berube and singer Oliver Roy de Belleval. The next year, he co-founded the Vancouver, British Columbia-based 604 Records.[7] Later, in 2006, The Suits XL released an album through this label.[12][13] The next year the band was nominated for a Canadian Indie Award.[14]\n\nCollaborations\n\nKroeger produced music for the bands Default, Theory of a Deadman, and Bo Bice.[citation needed]\n\nKroeger, along with Saliva vocalist Josey Scott, Theory of a Deadman lead vocalist (serving as guitarist for this track) Tyler Connolly and Our Lady Peace drummer Jeremy Taggart, performed the theme song titled \"Hero\" for the hit movie Spider-Man in 2002. Also in 2002, Kroeger wrote and sang on \"Why Don't You & I\" for Santana's Shaman. However, when Arista decided to release the song as a single in Summer 2003, Kroeger's label, Roadrunner, refused permission, citing concerns that Kroeger appearing on a \"high-profile single\" would compromise the excitement over Nickelback's fall 2003 release The Long Road. Kroeger recommended The Calling's Alex Band, another Arista artist, as a replacement for re-recording the single.[15][16]\n\nIn 2003, Kroeger won an International Achievement Award for the song \"Hero\" at the SOCAN Awards in Toronto.[17]\n\nIn 2007, Chad Kroeger worked with Santana for a second time, when he co-wrote and recorded guitar and vocals parts for a new song meant to appear on the compilation album Ultimate Santana. The track is called \"Into the Night\" and was released as a single on October 2, 2007. The album Ultimate Santana was released in October. Besides working with Santana, Kroeger also recorded with Travis Tritt on his album The Storm, where Tritt did a cover of Nickelback's \"Should've Listened\" track from The Long Road.\n\nKroeger also wrote and played guitar on Bo Bice's You're Everything.\n\nChad Kroeger, Eric Dill, Rune Westberg and Chris Daughtry wrote the debut single of Daughtry's new album.[18] The single, titled \"No Surprise\", was debuted on American Idol Wednesday, May 6, 2009. Kroeger also helped write another song from the album titled \"Life After You.\" He and Brett James co-wrote Tim McGraw's 2009 single \"It's a Business Doing Pleasure with You.\" Kroeger featured on the Timbaland album Shock Value 2 with the song \"Tomorrow in the Bottle\", which also features Sebastian. In 2010 he provided guest vocals, along with Ludacris and guest lead guitarist Zakk Wylde, on the My Darkest Days single \"Porn Star Dancing.\" In 2011, Kroeger was featured on the new Steel Panther album Balls Out with the song \"It Won't Suck Itself.\" In early 2012, it was confirmed that Kroeger was working with French-Canadian pop rock singer Avril Lavigne on her upcoming fifth studio album.[19]\n\nPersonal life\n\nIn 2008, Kroeger was convicted of drunk driving in a British Columbia court after he was stopped for speeding in Surrey.[8][20]\n\nKroeger started dating fellow Canadian rocker Avril Lavigne on July 1, 2012.[21] The relationship blossomed after they began working together in March 2012 to write and record music for Lavigne's fifth album.[21] Kroeger and Lavigne became engaged in August 2012.[22] The couple married in the south of France on July 1, 2013, which is Canada Day.[21] Lavigne and Kroeger honeymooned in Portofino, Italy. In September 2014, the entertainment media began reporting that Lavigne and Kroeger were headed for separation after only one year of marriage.[23] On September 2, 2015, Lavigne announced their separation via her official Instagram account.[24]\n\nIn 2015, the second leg of the band's North American tour had to be canceled so Kroeger could have surgery for a cyst on his larynx. The entire leg of the European tour was cancelled as well.[25][26]\n\nDiscography\n\nSingles\n\nAs featured artist\n\nOther appearances", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Chad_Kroeger_2016.jpg/1200px-Chad_Kroeger_2016.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Chad_Kroeger_2016.jpg/220px-Chad_Kroeger_2016.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Chad_Kroeger_2016.jpg/1200px-Chad_Kroeger_2016.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Chad_Kroeger", "title": "Chad Kroeger", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Chad_Kroeger_2016.jpg/1200px-Chad_Kroeger_2016.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}