{"url": "www.cosmopolitan.com/uk/reports/a22112279/is-meghan-markle-pregnant/", "text": "For most brides, it's usually about 30 seconds after saying, \"I do\" that they get inundated with questions about when they're planning to have kids. And being the couple of the moment, things are no different for Meghan Markle and Prince Harry.\n\nPretty much as soon as the pair got wed and became the Duke and Duchess of Sussex, there was talk of their imminent plans to start a family. All it took was for Meghan to turn up to a family wedding in a billowing Oscar de la Renta dress for onlookers to start speculating whether the couple had already got started.\n\nBut you can hold your horses right now, because the Duchess isn't pregnant, there's a photo that as good as proves it, and they probably want at least five minutes to sit down and relax before they start planning parenthood, thank you very much.\n\nGetty Images\n\nIn a picture taken yesterday in Dublin, when Meghan and Harry attended a Summer Party at the British Ambassador in Ireland's residence at Glencairn House, the latest addition-by-marriage to the Royal Family can very clearly be seen drinking champagne. And while a glass or two isn't deemed any great issue for pregnant women, we can't imagine hitting the booze would be the first thing on Meg's list to do in the early stages of pregnancy.\n\nThat's not to say the pair don't intend on having children at some point in the future, however. Did you see the look Harry gave Meghan during their wedding vows when the Reverend said: \"[Marriage] is given as the foundation of family life in which children are born and nurtured\". Harry turned to his bride with biggest grin, which Meghan enthusiastically reciprocated.\n\nGetty Images\n\nAnd the couple have also hinted in public that they very much plan to start a family. Back in March, on the couple's last official visit to Ireland - then in Belfast, Northern Ireland - Meghan greeted an entrepreneur who makes baby products by saying: \"I’m sure at some point we’ll need the whole thing.\"\n\nIn the Duke and Duchess' post-engagement interview with the BBC back in November 2017, the subject was also brought up. Harry said they definitely planned to have children, just \"not yet\".\n\n\"I think eventually, one step at a time...we'll start a family in the near future,\" Harry said.\n\nGetty Images\n\nAnd of course, we can't forget Meghan's dad's thoughts on his daughter becoming a mother herself someday. In an interview with Good Morning Britain last month, Thomas Markle told Piers Morgan and Susannah Reid that Meghan has \"wanted children for a long time.\n\n\"When she met Harry and she spoke about how much she loves him... there’s got to be a child in the making there soon,\" he said.\n\nSo it's safe to say - yes - if all goes well, Meghan and Harry will be producing beautiful royal babies. Just not right this second, okay?\n\nCheers to that Getty Images\n\nBut here's what they might look like if and when they do, because we couldn't resist.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/meghan-markle-not-pregnant-1531304783.jpg?crop=1xw:1xh;center,top&resize=1200:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-960096296-1528199833.jpg?crop=1xw:0.75xh;center,top&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "http://www.cosmopolitan.com/sites/cosmopolitan/assets/images/logos/ipso_regulated_hires.png"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/meghan-markle-not-pregnant-1531304783.jpg?crop=1xw:1xh;center,top&resize=1200:*", "keywords": [], "authors": ["Catriona Harvey-Jenner", "Digital Features Editor", "Cat Is Cosmopolitan Uk'S Features Editor Covering Women'S Issues", "Health", "Current Affairs."], "canonical_link": "https://www.cosmopolitan.com/uk/reports/a22112279/is-meghan-markle-pregnant/", "title": "The picture that proves Meghan Markle and Prince Harry aren't having children quite yet", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "The picture that proves Meghan Markle and Prince Harry aren't having children quite yet", "description": "Before we all start getting ahead of ourselves...", "url": "https://www.cosmopolitan.com/uk/reports/a22112279/is-meghan-markle-pregnant/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/meghan-markle-not-pregnant-1531304783.jpg?crop=1xw:1xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 211620818858710}, "article": {"publisher": "https://facebook.com/cosmopolitanuk", "modified_time": "2018-07-11 01:39:26", "published_time": "2018-07-11 10:34:00", "section": "News & Politics", "opinion": "false"}, "twitter": {"site": "@CosmopolitanUK", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/meghan-markle-not-pregnant-1531304783.jpg?crop=1xw:1xh;center,top&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Is Meghan Markle pregnant? The Duchess of Sussex proves she's not having a baby just yet with this picture", "description": "In a picture taken yesterday in Dublin when the Duke and Duchess of Sussex attended a Summer Party at the British Ambassador in Ireland's residence at Glencairn House, Meghan Markle can very clearly be seen drinking champagne.", "keywords": "Meghan Markle, pregnant, Harry and Meghan baby, Duke and Duchess of Sussex pregnant, Duke and Duchess of Sussex children, Duke and Duchess of Sussex kids, Meghan and Harry starting a family", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/meghan-markle-not-pregnant-1531304783.jpg?crop=0.5xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "News & Politics,reports", "sailthru.date": "2018-07-11T10:34:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/meghan-markle-not-pregnant-1531304783.jpg?crop=1xw:1xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/meghan-markle-not-pregnant-1531304783.jpg?crop=0.5xw:1xh;center,top", "sailthru.socialtitle": "The picture that proves Meghan Markle and Prince Harry aren't having children quite yet", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1531276440.0, "source": "http://www.cosmopolitan.com", "summary": ""}