{"url": "https://people.com/tv/carrie-ann-inaba-love-ups-and-downs/", "text": "Carrie Ann Inaba has found career success over the past 25 seasons of judging tangos, sambas and cha cha cha’s on Dancing with the Stars — the hit ABC dancing competition that made her a household name.\n\nBut though her professional life has continued to score high marks, Inaba’s romantic life has had its fair share of stumbles in the spotlight.\n\nGet push notifications with news, features and more.\n\nThe latest is Robb Derringer, Inaba’s ex-fiancé, who proposed to the 49-year-old in December at the same beach cove along the California coast where the pair shared their spontaneous and magical first date. Just nine months later, sources exclusively told PEOPLE the pair had decided to quietly end their engagement and planned Hawaii wedding.\n\n“Just when I think I’ve learned the way to live, life changes,” Inaba said in a quote on Instagram on Sept. 7, captioning the graphic with prayer hands and a broken-heart emoji.\n\nImage zoom Carrie Ann Inaba and Robb Derringer Kathy Hutchins/Newscom\n\nIt was a sad end to a romance that seemed to blossom immediately.\n\n“I knew after our first romantic date, that if she felt for me what I felt for her, then it was something that was going to be significant and life changing and lasting,” Derringer, 50, told PEOPLE when announcing their engagement. “There was just a powerful and palpable sense of destiny that I could not deny.”\n\n“As a young girl, I had always dreamed about going on a date like the first date I shared with Robb,” Inaba added at the time. “Somehow, he instinctively knew what that was and went to great lengths to surprise me with the most romantic night ever. I could see then how pure of heart he was and how generous and caring his soul was.”\n\n“Everything about the evening felt so ‘right’. There was an ease and an authentic familiarity,” she continued. “We talked about everything under the stars … even marriage. There was a strong sense of destiny that night, and I think I knew then, deep in my heart, that he and I were going to be together forever.”\n\nImage zoom Robb Derringer and Carrie Ann Inaba Carrie Ann Inaba\n\nRELATED VIDEO: Carrie Ann Inaba Gushes About Fiancé Jesse Sloan\n\nDerringer isn’t Inaba’s first ex-fiancé.\n\nIn September 2012, a rep for Inaba told PEOPLE that she and Jesse Sloan “decided early in the summer to break off their engagement and have remained friends.”\n\nSloan, a 45-year-old accountant, had proposed to Inaba on Live! With Regis and Kelly in March 2011 — surprising her on air. “Our family is spread out all across the country,” Sloan told PEOPLE at the time. “I wanted to be able to share it with our family and friends.”\n\nImage zoom Jesse Sloan and Carrie Ann Inaba Gregg DeGuire/WireImage\n\n“He’s a keeper,” Inaba gushed to PEOPLE as she snuggled up to her groom-to-be. “Our family got to witness the whole thing – along with a lot of other people … There is no way I would say no to him. He’s my dreamboat and my life is so much better with him in it. It’s just so exciting to know that now we’re going to spend the rest of our life together. And have babies!”\n\nIn the weeks following the surprise proposal, Inaba revealed the duo planned to have a seaside wedding so that their guests could walk barefoot on the sand. The ocean, she told PEOPLE, “has such a spiritual meaning. It’s so vast and yet it unites everyone. We want everybody to get their feet wet in the water after we say our vows.”\n\nImage zoom Artem Chigvintsev and Carrie Ann Inaba Michael Buckner/Getty\n\nPrior to Sloan, Inaba was in a 2½-year relationship with DWTS pro Artem Chigvintsev.\n\nThe Russian ballroom dancer, who is 14 years her junior, first met Inaba when he was competing on Fox’s So You Think You Can Dance. The two began dating in 2006 and split in November 2008.\n\n“He’s my ballroom champ,” Inaba told PEOPLE in October 2006, after the pair had been dating for eight months.\n\nRELATED VIDEO: The Cost of Dancing With the Stars‘ Mirrorball Trophy\n\nTheir breakup, like Inaba’s others, was amicable.\n\n“Artem and I broke up in the beginning of November,” she told PEOPLE in February 2009. “As much as our relationship was really good,” she added, the two realized that neither “was ‘the one’ for the other. It was very sad to let go of something that was so good on so many levels.”\n\nShe also praised her ex for being “a fine gentleman,” saying, “I have never gone out with somebody that grounded, always ready to talk it out. I’m very happy for him and the success he’s having.”\n\nChigvintsev will be back for season 25 of DWTS, paired with Nikki Bella.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F05%2Fcarrie-ann-inaba.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F12%2Fcarrie-ann-inaba3-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fcarrie-ann-inaba-3.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fcarrie-ann-inaba-1-2.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1493&h=782&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fcarrie-ann-inaba-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1493&h=782&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fcarrie-ann-inaba-2000.jpg", "keywords": [], "authors": ["Dave Quinn"], "canonical_link": "https://people.com/tv/carrie-ann-inaba-love-ups-and-downs/", "title": "Dancing with the Stars Judge Carrie Ann Inaba: Her Love Ups and Downs", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Carrie Ann Inaba,Dancing with the Stars,News,TV", "news_keywords": "Carrie Ann Inaba,Dancing with the Stars,News,TV", "description": "Though Dancing with the Stars' judge Carrie Ann Inaba's professional life has continued to score high marks, her romantic life has had its fair share of stumbles", "og": {"title": "Dancing with the Stars Judge Carrie Ann Inaba: Her Love Ups and Downs", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/carrie-ann-inaba-love-ups-and-downs/", "description": "Carrie Ann Inaba&nbsp;has found career success over the past 25 seasons of judging tangos, sambas and cha cha cha’s on&nbsp;Dancing with the Stars&nbsp;—&nbsp;the hit ABC&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1493&h=782&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fcarrie-ann-inaba-2000.jpg", "width": 1493, "height": 782}}, "pinterest": {"url": "https://people.com/tv/carrie-ann-inaba-love-ups-and-downs/", "description": "Though Dancing with the Stars' judge Carrie Ann Inaba's professional life has continued to score high marks, her romantic life has had its fair share of stumbles", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fcarrie-ann-inaba-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/carrie-ann-inaba-love-ups-and-downs/", "title": "Dancing with the Stars Judge Carrie Ann Inaba: Her Love Ups and Downs", "description": "Though Dancing with the Stars' judge Carrie Ann Inaba's professional life has continued to score high marks, her romantic life has had its fair share of stumbles", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1493&h=782&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F10%2Fcarrie-ann-inaba-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}