{"url": "https://www.hollywoodreporter.com/live-feed/bachelor-paradise-2017-controversy-evan-bass-begs-abc-not-cancel-show-1014290", "text": "On June 4, 2017, a sexual encounter occurred on the set of Bachelor in Paradise in Sayulita, Mexico, between two castmembers who had been drinking. One or both parties may have been too intoxicated to give consent. One week later, on June 11, production company Warner Bros. Television announced that it had suspended shooting of ABC's Bachelor spinoff. Corinne Olympios and DeMario Jackson came forward on June 14 as the individuals at the center of the investigation, releasing separate public statements and vowing to take legal action.\n\nWith a possible cancellation of Bachelor in Paradise looming, season-three alum Evan Bass defends the series on which he fell in love.\n\nBass, 34, and Carly Waddell, 31, met and got engaged during the summer of 2016. Bass had recently been introduced on Joelle \"JoJo\" Fletcher's season of The Bachelorette. On the show, Bass was portrayed as a quirky \"erectile dysfunction specialist\" and loving father of three boys in Nashville, Tennessee. Fans first met Waddell, a Nashville singer-songwriter, on Chris Soules' season of The Bachelor and the previous season of Bachelor in Paradise. The couple was set to return to the island paradise during this season for a televised wedding, back where their love story first began and will still be tying the knot on Saturday, sources tell The Hollywood Reporter, for the cameras and a select guest list despite the ongoing investigation.\n\nBelow, Bass begs ABC not to cancel the series, describes the protocol for alcohol on set and explains the way he believes consent is and should be dealt with on and off the reality show.\n\nBachelor in Paradise is my show. It's my jam. Personal redemption, lifelong friends and the woman of my dreams are just a few of the many takeaways I found living on set for weeks at the air-condition-less resort. When the news about Paradise production broke the internet, it also broke my heart. While to some it's a silly TV show, for me, it was an experience that changed my life in unimaginable ways. I am troubled thinking about the allegations happening on my favorite beach, and I'm sad that some couples will not have the opportunity to find love in a powerful and unique way. I can't help but think about [season-one couple] Jade and Tanner [Tolbert], the fast-approaching birth of their baby and how that beautiful family wouldn't exist without Paradise. And for me, I will be forever grateful to Paradise for guiding me to an incredible stepmother to my own children.\n\nFamily creation aside, I'm equally disturbed by the way the production of the show is being portrayed. At first I wanted to stay quiet and let the dust settle before speaking out, but as the show has come under more sensationalized hostility and more unnamed \"sources\" speak out, I feel compelled to share my experiences with the show and its production team. Between Carly and me, we've appeared on five Bachelor-themed series, including appearances on the entire seasons of BIP two and three. So we know how this show works, why it works, and I'm going to tell you why ABC should keep the show.\n\nI'm not here to pontificate about rumors or conjecture, and we must absolutely allow time for the truth to come out. In this day and age, people are happy to consume rumors and then regurgitate them in toxic judgment, but the truth has a way of weaseling its way to the surface. I'm anxiously hopeful that the full story is given the light of day before misinformation does any more damage. I've talked with several castmembers who were on-site, and from their perspectives, this was not anywhere close to what's being portrayed in the media. The overwhelming theme from the cast is that although these allegations should be taken seriously, the actual events have been blown way out of proportion and that \"consent\" was not an issue that day or in the days following. Their anger is not so much directed at Corinne but more at the rogue \"newbie\" producers who manufactured something out of nothing. Now that Corinne has lawyered up, she's following the natural path of a scandal by protecting herself, as she has every right to do.\n\nSince I wasn't involved and have no firsthand knowledge of the situation, I want to share my Paradise experience. When I first got the call to do Paradise, I was extremely nervous about joining the cast because of how terribly I came across on JoJo's season of The Bachelorette. I felt kind of stupid about my behavior, and most of Bachelor Nation thought I was strange, to put it mildly. I avoided Twitter because I was constantly being trolled, and it honestly hurt a bunch. But I decided that if there was a chance I could find redemption, and maybe even love, that it was worth it. My heart was so ready to find a partner.\n\nAs someone who got a bad \"edit\" on The Bachelorette, it drives me nuts when news hits and former Bachelor contestants come out of the woodwork to cry about their bad edit or how terribly they were treated. Usually, it's the ones who didn't get the acclaim or followers they felt they deserved. But in all reality, we are at least cognizant of the fact that we may not look great. Most of us falsely assume we are going to come across on the screen looking like champions and don't see ourselves as \"villains,\" so how could they make us look like that? But, for example, on JoJo's season, I kept finding myself in situations where I would look silly and do abnormal things. But I did those things. I decided to give JoJo an ultimatum and then take it back five minutes later. I decided to make Chad [Johnson] my archnemesis. Doing the show, for me, with no filter, opened myself to the Twitter jeering and pain that most desperately try to avoid. After not being my best self on The Bachelorette, I took time to reflect and learn from those mistakes, but I ended up looking \"bad\" because of decisions I made and faulty internal beliefs I chose to rely on about others and myself. I realized I was broken in places and had blind spots in others.\n\nUltimately, after licking my wounds, reflecting and getting support from my friends, I found a clear headspace on Paradise where I was able to (after some ambulance theatrics) win the heart of a beautiful, smart and wildly amazing woman. The experience also created a new layer of strength and emotional armor that has been invaluable. The Twitter trolls bother me less, and my relationships are richer because of the cumulative experiences. Most importantly, it made me a better dad. Parents, especially moms, are assailed for leaving their children to go on a reality show, but the journey is powerfully transformational for all the parents I know. We become better parents and cherish the time with our children to a degree that perhaps wasn't possible without taking the time to work on us. The castmembers who get the most out of the experience are the ones who treat it as therapy. The dramatic and epic stuff is the large majority of what is televised, but some of the most valuable moments are the hours of talking that will never be shown. Generally speaking, the contestants who gripe are the ones who can't/won't internalize their experience. It's always easier to blame someone else than accept responsibility. Sure, there's a nugget of truth in what they complain about, but at the end of the day, our actions and words are our responsibility, and we are never forced to do what we don't want to do.\n\nI can't talk too much about our contracts with the show, but let me say this: It's very, very clear that, as contestants, our actions and words are our responsibility, including alcohol consumption. But in reality, the producers are always there to help when things get fuzzy.\n\nIt's common knowledge that there is alcohol on the show. But what I want people to know is that my friends and I were never once prodded or forced to drink alcohol. Hell, the furthest production goes is asking what type of beverage you'd like. And saying \"water\" is a perfectly fine response. On BIP season three, none of us imbibed to the point of being more than \"tipsy,\" except Chad — and he readily admits that he did that on his own, with no prodding. BIP naturally creates several degrees of pressure. Pressure because there's cameras and pressure to find a match. The fascinating part to watch is how people deal with that pressure. Some get very quiet, some drink too much, and some, like me, do ridiculous things like fake my own death. That's what makes the show interesting to watch. Alcohol is treated with the respect it deserves, and sometimes contestants are asked to stop. In fact, I wasn't allowed to drink for two weeks because of medication I was taking, and although I badly wanted a glass of wine for rose ceremonies, the staff would come running from all directions to stop me when I tried to sneak a sip or order a drink. I've watched staff and producers stop many situations before they became a problem, even at the expense of making \"great TV.\" Their interventions were not only beneficial, but also truly assisted in my process of finding love.\n\nThere were many amazing people on staff to assist us when we were doing something stupid, but Chris Harrison and [bartender] Jorge are truly great men. Jorge was our sage, our muse and our shoulder to cry on. Harrison was there to chat at rose ceremonies and for the always dramatic interventions. Jorge and Harrison, like the producers, have two goals: to reveal character and assist in finding love. Great TV naturally follows both of those things. The cast grows very close with the producers. There are hours and hours of unaired interviews where we talk about heart and soul issues. The producers helped guide me to a place where I was able to break down the barrier of my heart that \"I wasn't good enough for Carly\" … and \"I'm not good enough for love.\" I had deep wounds in my heart, and — I'm crying as I'm writing this — they helped me heal. And that's what they do — help us navigate feelings and make decisions that are in line with our values when we get stuck. They are always watching and always approachable for us when we need them. The producers I know would never allow someone to do something against their will or get to a place where something bad would occur. That's what makes this situation so tough. I know this cast and the production staff so well, I find this alleged situation unimaginable.\n\nOn the other hand, I think we are all glad the production staff, ABC and Warner Bros. are taking it seriously. I know for a fact that no one on the show would want anyone to be violated in any way for ratings. The show doesn't cast intentionally bad people. Sometimes contestants are misguided, ridiculous and narcissistic, but no one shows up ready to hurt someone. I don't know DeMario [Jackson], but the castmembers I've spoken to that have gotten to know him say he's a good guy. I just don't believe that he thought he was hurting Corinne or that he knew she wasn't able to give consent. But that's where all men can learn. Getting approval not just once but multiple times is the right thing and should become our society's norm. In our society, we must learn to go above and beyond to make sure people feel safe. And I think the show is doing that by shutting down production to ensure they've done everything they can do to guarantee safety.\n\nAnother thing I often hear people trying to discredit the show say is, \"There's no way you can find love in a matter of weeks.\" or \"How could you really find love in a month?\" Well, it's quite amazing, actually. We spend all day, every day with our fellow castmates. In a \"real life\" dating situation, you go on a date for a few hours, text a bit, maybe set up another date a few days later, and you do that for a few months. So Paradise condenses it. You quickly find out almost everything about a potential match, especially the important stuff. There is no \"ghosting\" or hiding behind phones. If you do run, the show holds you accountable. But really, you watch how people interact with others, what pisses them off, how they respond to pressure, even what foods they like. It was adorable watching Carly order avocado, eggs and a black coffee every single morning (and she still tries to have that for breakfast every day). Spending quality time with others is a lost art to the game of texting, but Paradise brings back QT. Carly and I sat on a beach for weeks talking. At first I creeped her out, but because of the time allowed to just hang after she friend-zoned me, she came to realize that she not only liked my flavor of creepiness, but wanted to marry it as well!\n\nI'm sure people will say I drank the Paradise Kool-Aid, got paid to write nice things — which I didn't — or whatever, but I truly believe in the show and its production staff. They are all good people who work harder than anyone I've ever met and are genuinely fighting for love, and a great story. I believe I have one of the most epic love stories of any reality TV love, and I don't want these stories to end. I'm sure adjustments will be made, but ultimately one bad incident does not have to tarnish a show's legacy, and I'm sure as hell not going to let it affect my relationship with Carly in any way. I am incredibly grateful to the producers, the staff and everyone involved in Paradise for choosing to illuminate my story and help me become a better man.\n\nBut beyond the cast, the Bachelor shows are important to millions. The shows are a beautiful juxtaposition of parody and melodrama that illuminate our own lives. Paradise and the other shows bring people together by helping us see our own ridiculousness. Live-tweeting has become a collective event. The shows, and especially Paradise, break stereotypes and help people learn about themselves as human beings. We identify with some of the characters, and we think about our experiences with people similar to those shown on the screen. I've received countless tweets and comments that Carly and I have strengthened relationships because couples identify with us. One girl said she was able to find love because her guy \"is a lot like you, Evan.\" She ended up giving him a chance, and now they're happy. Another girl wrestled with self-hate and said watching us gave her hope. You may say I'm being too dramatic about a TV show, and I am definitely biased, but reading the awesome comments and watching the very real positive outcomes people have from watching make me happy.\n\nThe show also highlights important topics the public wrestles with. This \"scandal\" has had the unintended consequence of bringing the discussion about \"consent\" to the forefront of people's minds. Frankly, although the circumstances suck and no one wishes harm on anyone, the learning edge of this has been powerful. We all want healthy relationships and to be treated with respect. And as this plays out, it will help many people treat consent on a new level and understand personal responsibility versus the duty of others to act. The show has recently introduced Rachel [Lindsay] as the first African-American lead, and she is doing a fantastic job as the Bachelorette. Healthy conversations about race are happening everywhere because of it.\n\nLet me reiterate that I do not want to downplay the seriousness of this very difficult situation. My heart goes out to Corinne and everyone negatively affected by this. I pray for peace and healing to begin and personal growth for all. And Paradise must come back, if not this season, then next season. I want to watch love form and grow on ABC Mondays and Tuesdays. I want to watch the next steady Jade and Tanner and also the next roller-coaster relationship like I had. Love always wins, and I trust in Paradise.\n\nEvan Bass was a contestant on season 12 of The Bachelorette and on the third season of Bachelor in Paradise.", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "https://cdn1.thr.com/sites/default/files/2017/06/gettyimages-599735218-h_2017_0.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2016/08/chris_harrison.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2018/12/colton_from_the_bachelor_-_publicity_-_h_2018.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2017/06/gettyimages-599735218-h_2017_0.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/01/greg_berlanti_sharon_horgan_alex_kurtzman_and_dwayne_johnson_-_getty_-_h_2020.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/03/mrs._america_-_publicity_still_1-_h_2020_.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/blogicon_livefeed-black2.png"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/06/gettyimages-599735218-h_2017_0.jpg", "keywords": [], "authors": ["Evan Bass", "Thrnews Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/live-feed/bachelor-paradise-2017-controversy-evan-bass-begs-abc-not-cancel-show-1014290", "title": "'Bachelor in Paradise' Engaged Star to ABC: Please Don't Cancel the Show (Guest Column)", "meta_data": {"viewport": "width=device-width", "description": "Evan Bass, who met fiancee Carly Waddell on season three of 'BIP,' defends the show amid an ongoing investigation of misconduct.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/live-feed/bachelor-paradise-2017-controversy-evan-bass-begs-abc-not-cancel-show-1014290", "domain": "https://www.hollywoodreporter.com/", "title": "'Bachelor in Paradise' Engaged Star to ABC: Please Don't Cancel the Show (Guest Column)", "description": "Evan Bass, who met fiancee Carly Waddell last year on the 'Bachelor' spinoff, defends the show amid an ongoing investigation of misconduct.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/06/gettyimages-599735218-h_2017_0.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "'Bachelor in Paradise' Engaged Star to ABC: Please Don't Cancel the Show (Guest Column)", "description": "Evan Bass, who met fiancee Carly Waddell last year on the 'Bachelor' spinoff, defends the show amid an ongoing investigation of misconduct.", "url": "https://www.hollywoodreporter.com/live-feed/bachelor-paradise-2017-controversy-evan-bass-begs-abc-not-cancel-show-1014290", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/06/gettyimages-599735218-h_2017_0.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "'Bachelor in Paradise' Engaged Star to ABC: Please Don't Cancel the Show (Guest Column)", "sailthru.description": "Evan Bass, who met fiancee Carly Waddell last year on the 'Bachelor' spinoff, defends the show amid an ongoing investigation of misconduct.", "sailthru.author": "Evan Bass", "sailthru.channel": "Live Feed", "sailthru.vertical": "Live Feed", "sailthru.date": "2017-06-17 07:00:00", "sailthru.tags": "Live Feed, Television, Bachelor In Paradise, The Bachelor, The Bachelorette"}, "movies": [], "publish_date": 1497654000.0, "source": "https://www.hollywoodreporter.com", "summary": ""}