{"url": "https://web.archive.org/web/20080703202454/http://www.foxnews.com:80/story/0,2933,373450,00.html", "text": "WASHINGTON \u0097 The following is a parial transcript of the June 29, 2008, edition of \"FOX News Sunday With Chris Wallace\":\n\nClick here to see Part 1 of the transcript, featuring a discussion between vice presidential hopefuls, Republican Rob Portman and Democrat Ed Rendell.\n\n\"FOX NEWS SUNDAY\" HOST CHRIS WALLACE: The last three presidential elections, Democrats have faced challenges from independent candidate Ralph Nader.\n\nWell, this time Republicans have their own problem, Bob Barr, the former Republican Congressman from Georgia, who is now the Libertarian Party nominee for president, and he joins us from Portland, Oregon.\n\nCongressman, you say the Republican Party has no vision, no agenda and a candidate who provides no excitement. What's wrong with John McCain?\n\nFORMER REP. BOB BARR: What's wrong with John McCain is symptomatic of what's wrong with the Republican Party in these first years of the 21st century. They talk one thing but do something different, and that's become very obvious to the American people.\n\nAnd when you look, for example, at what the Republican Party and the Congress has done since losing their majorities in 2006, you see absolutely no new program, new leadership or vision put forward.\n\nAnd that's one of the reasons, Chris, why I think we see over 80 percent of the American people concluding that the country is on the wrong track and going in the wrong direction.\n\nWALLACE: But in a race between John McCain and Barack Obama, as a longtime now former conservative Republican, don't you think McCain honestly would be the better president?\n\nBARR: This is very much a mixed bag, Chris. For example, on some of the civil liberties and privacy issues with which I and the Libertarian Party are very concerned, Senator Obama clearly is much better.\n\nOn other issues, those relating to the cost of government and government spending, while neither candidate is good, Senator Obama clearly would favor a more expansive federal spending policy.\n\nSo it's very much a mixed bag, but neither of these candidates is talking about the deep cuts in government spending and returning power to the people that we are.\n\nWALLACE: What are your major beefs -- you said they have retreated from principle, but you weren't very specific. What are your major beefs with McCain and the Republicans right now?\n\nBARR: Well, let's take, as just one example, the Foreign Intelligence Surveillance Act. Nobody is really asking the question, \"Why does the government, our own government, need to be spying on its own citizens -- that is, U.S. citizens -- in this country, without some good reason?\"\n\nThe legislation that is now pending before the Senate, that just passed the House, that Senator McCain supports would provide the authority for the federal government to surveille American citizens in their own country without any suspicion whatsoever that they're engaging in discussions with terrorists or about criminal activity.\n\nThis is a fundamental issue that goes to the very nature and power of our government, but nobody's really talking about it.\n\nWALLACE: But in those cases, and correct me if I'm wrong on foreign intelligence surveillance, they cannot issue a wiretap, a warrantless wiretap, unless it's communications between someone in this country and someone outside the country where they have reason to suspect that there is a terrorist connection.\n\nBARR: The first part of what you said, Chris, is absolutely correct. The second part is not. The government does not under this legislation need to establish any link whatsoever between the U.S. citizen that they're seeking to surveille and suspected terrorist activity or contacts.\n\nAll they have to do is establish that they think one of the parties to that conversation is not inside the United States. This is far too broad an authority for the federal government to have.\n\nWALLACE: According, Congressman Barr, to a recent national poll, you get 3 percent of the vote, and mostly from people who say that otherwise, if you weren't in the race, they would vote Republican, especially in a few states like Colorado, like your home state of Georgia.\n\nCouldn't you end up having the balance of power and tipping those states from McCain to Obama?\n\nBARR: First of all, those polls -- this is very, very early in the campaign. We anticipate once we really launch our campaign full- time after July 4th to see those numbers increase, not just in those couple of states that you mentioned, but elsewhere around the country.\n\nAnd of course, I and the Libertarian Party will be on the ballot in, we hope, all 50 states, but certainly 49 states.\n\nThe fact of the matter is that the American people are hungry, particularly young people, for a new vision, a new choice, to open up the political system once again and not feel bound by the artificial constraints of the two-party system.\n\nThat's why it's important that I'm in this race, not as a spoiler for anybody any more than Senator McCain or Senator Obama would be a spoiler for Bob Barr.\n\nWALLACE: But I have to ask you the question that is always asked of Ralph Nader. You would have no qualms if, because of your involvement, you ended up helping elect President Obama?\n\nBARR: If Senator Obama wins on November 4th and Senator McCain and I lose, it will be because he presented a vision and a platform and a candidacy to the American people that resonated with a plurality of the voters.\n\nThat's what each of those candidates needs to do. That's what I intend to do. And that's, I think, what the American people want. They're not so concerned anymore about partisanship over principle.\n\nWALLACE: All right. Let's talk a little bit about Bob Barr. Libertarians generally, I think you'd agree, favor smaller government and few foreign entanglements, but let's take a look at your record.\n\nYou voted for the Patriot Act permitting more government surveillance, the thing that you just decried. You voted to authorize the war in Iraq. You introduced back in the '90s the Defense of Marriage Act and you introduced the so-called \"Barr Amendment\" against medical marijuana.\n\nCongressman, how does that record make you a Libertarian?\n\nBARR: Well, what makes me a Libertarian is the fact that I deeply and truly believe in the Libertarian platform and what resonates with most Americans, and that is to shrink the size of the federal government.\n\nLet's take just one example there, the Defense of Marriage Act. The Defense of Marriage Act simply stands for the proposition that each state can set its own definition of marriage and can't be forced to adopt a different definition of marriage forced on it by another state.\n\nThat's a very conservative principle reflecting the fundamental notion of states' rights in our country.\n\nWALLACE: But what about voting for the war in Iraq, voting for the Patriot Act, voting -- in fact, introducing the amendment to ban the legalization of the medical use of marijuana?\n\nBARR: With regard to the Patriot Act, I have fought over the last five years since leaving the Congress to limit or, better even yet, repeal the Patriot Act, and I was able in the Congress to secure a number of sunset provisions for the provisions in the Patriot Act, so we would have the opportunity to go back and review them and look at them.\n\nThe powers in the Patriot Act have been used and abused by the Bush administration far in excess of what the Congress intended for it, and it's those abuses that have led I and a lot of other folks who voted for it under false pretenses essentially to work against it.\n\nWith regard to the vote for hostilities in Iraq, that was a vote that was based on what we now know to be inappropriate and erroneously analyzed intelligence.\n\nThat vote certainly was not intended -- was not presented to the Congress or myself in the Congress at the time as a vote for a multiyear, perhaps multidecade, occupation of Iraq.\n\nHere again, the administration has taken an inch and gone a mile, sometimes in very clear contravention of what Congress intended.\n\nWALLACE: So you're willing to take no personal responsibility and say, \"Hey, I was wrong?\"\n\nBARR: Oh, I do. I just said that I was wrong with regard to the Patriot Act, entrusting the administration with its assurances that the act would not be used and abused.\n\nAnd I certainly was wrong, along with a lot of others in the Congress, who now realize that their vote in support of military operations in Iraq was not what the administration intended. They intended to occupy the country even though they didn't tell us or the American people that at the time.\n\nWALLACE: Finally, Congressman, let's talk about your viability as a candidate and the viability of your campaign. You have no campaign headquarters. You have yet to hold a single fundraiser. Best we can tell, you have about $300,000 in donations.\n\nWhy should American voters trying to make a decision about November take you and your campaign seriously?\n\nBARR: The campaign is really just beginning. We do have a campaign headquarters. It will be in Atlanta, Georgia. We already have an entire staff in place, including Ross Perot's former campaign manager, deputy campaign manager, finance director.\n\nWe have an Internet team that worked for Ron Paul. We have held a number of fundraisers. We will be holding more. And we're, of course, launching a nationwide fundraising effort through the Internet.\n\nI think the American people will be very surprised and very pleased with what they see out of the Barr 2008 campaign over the coming months.\n\nWALLACE: Congressman Barr, we are going to have to leave it there. We want to thank you so much for getting up early today to talk with us, and safe travels on the campaign trail, sir.\n\nBARR: Thank you, Chris.\n\nClick here to see Part 1 of the transcript, featuring a discussion between vice presidential hopefuls, Republican Rob Portman and Democrat Ed Rendell.", "images": ["https://web.archive.org/web/20080703202454im_/http://www.foxnews.com/i/icon_stumbleupon.gif", "https://web.archive.org/web/20080703202454im_/http://www.foxnews.com/i/mkt/mkt_freecredit.gif", "https://web.archive.org/web/20080703202454im_/http://www.foxnews.com/images/foxnews_story.gif", "https://web.archive.org/web/20080703202454im_/http://www.foxnews.com/i/tv_icon.gif", "https://web.archive.org/web/20080703202454im_/http://www.foxnews.com/i/mkt/mkt_fnradio.gif", "https://web.archive.org/web/20080703202454im_/http://www.foxnews.com/i/fnc.jpg", "https://web.archive.org/web/20080703202454im_/http://www.foxnews.com/i/mkt/mkt_people.gif", "https://web.archive.org/web/20080703202454im_/http://view.atdmt.com/VON/view/fxnwsvos0470000663von/direct/01/", "https://web.archive.org/web/20080703202454im_/http://pix01.revsci.net/E05510/a3/0/0/0/0/0/0/0/0/0/noscript.gif", "https://web.archive.org/web/20080703202454im_/http://www.foxnews.com/i/sched_top.gif", "https://web.archive.org/web/20080703202454im_/http://www.foxnews.com/i/icon_digg.gif", "https://web.archive.org/web/20080703202454im_/http://www.foxnews.com/i/mkt/mkt_fnshop.gif", "https://web.archive.org/web/20080703202454im_/http://cms.myspacecdn.com/cms/post_myspace_icon.gif", "https://web.archive.org/web/20080703202454im_/http://www.foxnews.com/i/mkt/mkt_bankrate.jpg", "https://web.archive.org/web/20080703202454im_/http://www.foxnews.com/i/mkt/mkt_carsdirect.jpg", "https://web.archive.org/web/20080703202454im_/http://www.foxnews.com/i/mkt/mkt_freecredit2.gif", "https://web.archive.org/web/20080703202454im_/http://www.foxnews.com/i/icon_facebook.gif"], "top_img": "https://web.archive.org/web/20080703202454im_/http://www.foxnews.com/i/fnc.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "FOXNews.com - Transcript: Bob Barr on 'FOX News Sunday' - FOX News Sunday", "meta_data": {"description": "Transcript: Bob Barr on 'FOX News Sunday', Former Rep. Bob Barr, who is the Libertarian nominee for president, appears on 'FOX News Sunday'", "keywords": "fns,rendell,portman,barr, fox news sunday, chris wallace", "storyid": 386798, "publish_date": "2008-06-30", "section_name": "FNS w/ Chris Wallace"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}