{"url": "https://www.bustle.com/p/video-of-ariana-grande-pete-davidson-dancing-is-their-cutest-instagram-moment-yet-9628105", "text": "When Petiana Grandson sings “Bring Me To Life” by Evanescence together at karaoke, it’s cute. When they talk about Harry Potter, it’s cute. And when Ariana Grande and Pete Davidson attempt to swing dance in a video together, it is cute. Almost disastrous, sure, but still cute. On Thursday, June 28, Grande shared a montage of clips she took with friends while dancing around in a rehearsal space on Instagram. In one of the snippets, Grande and Davidson dance together. The Grande and Davidson section of the video is short. It is cute. And it is dramatic.\n\nAt the top of the segment, Grande and Davidson clasp hands. He swings her through his legs. Everything seems to be going fine. Seconds later, that all changes. When it comes time to swing her back on her feet, both Davidson and Grande lose their balance. He stumbles backward, she stumbles forward, he catches her, and she laughs. “Oh, my god,” he exclaims. “That could’ve went very bad.”\n\nFortunately, the swing dance move attempt did not end poorly for either Grande or Davidson. No one fell to the ground, no one crashed into anyone’s nether regions, no shoulders were dislocated, no one twisted any limbs, and no one bruised any tailbones. Honest to god, no one was knocked out. Consider it a success.\n\nIn addition to the clip of the swing dance near-catastrophe, the IG post includes some snippets of Grande dancing around with her other pals. No one falls in the the other snippets. And yeah, all of it is cute.\n\nSpeaking of cute (huh, guess it is the word of the day), here is a wonderfully cute IG video Davidson shared on Thursday of Grande dancing around a baby sitting in a parked stroller.\n\nPrecious, precious stuff.\n\nAfter Davidson and Grande made their coupledom Instagram official on May 30, their IG feeds and their IG Stories quickly turned into sources of cute couple content. In the last month, they have given us the Hogwarts robes pic, videos from their post-engagement trip to Disneyland, an engagement ring photo, and so many lovey dovey IG comments (sorry, Seth Rogen). They’re lovin’, they’re livin’, they’re Instagramming it up.\n\nAnd they're shacking up together it up. And they're birthday-ing it up. And they're \"Evanescence\"-ing it up. And they're TMI-ing it up. And they're Harry Potter-ing it up. And, as TMZ reported on Thursday, they're smoochin' and shoppin' it up.\n\nAnd no, your calendar is not full of lies. It really has been only one month since Grande and Davidson announced on Instagram that they are dating. And it has only been a month and a half since Bossip reported that the “The Light Is Coming” singer and the Saturday Night Live performer are an item. Now, how does that old saying go again? Is it not something along the lines of, “Time turns into a jar of molasses when you are having a great time poring over adorable social media content created by two celebrities who seem very happy together and very much in love”? Sure, that feels about right.\n\nAnyway, what is the over-under (har har har) on Davidson and Grande incorporating that swing dance move into their first dance at their wedding? Hey, they will have plenty of room to practice that swing dance move in that enormous new apartment they reportedly moved in to together. What is that other old saying? Something along the lines of, \"Home is where you spend hours trying to figure out ballroom dance moves like you are on Dancing with the Stars\"? Sure, that feels about right.", "images": ["https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2020/4/9/18095bba-0961-4b71-b9a9-2aee8da87cc7-getty-1198910351.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/6/3568dd56-f08c-499e-82a6-a5f2f07fdf23-getty-1183705964.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/16/97010b86-55b6-4027-8ae3-8bbc96a4f438-getty-1132368586.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/6/29/e3a25be2-ae42-4755-85b2-6521e311ae50-ariana-pete-3-2.png?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/6/29/e3a25be2-ae42-4755-85b2-6521e311ae50-ariana-pete-3-2.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/15/bdb0f12d-3fc5-4f54-9148-62a9337bc4d5-getty-1199620322.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/6/29/e3a25be2-ae42-4755-85b2-6521e311ae50-ariana-pete-3-2.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/video-of-ariana-grande-pete-davidson-dancing-is-their-cutest-instagram-moment-yet-9628105", "title": "Video Of Ariana Grande & Pete Davidson Dancing Is Their Cutest Instagram Moment Yet", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/video-of-ariana-grande-pete-davidson-dancing-is-their-cutest-instagram-moment-yet-9628105", "type": "article", "title": "This Video Of Ariana Grande & Pete Davidson Swing Dancing Is Too Cute", "description": "When Petiana Grandson sings “Bring Me To Life” by Evanescence together at karaoke, it’s cute. When they talk about Harry Potter, it’s cute. And when Ariana Grande and Pete Davidson attempt to swing dance in a video together, it is cute. Almost…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/6/29/e3a25be2-ae42-4755-85b2-6521e311ae50-ariana-pete-3-2.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "When Petiana Grandson sings “Bring Me To Life” by Evanescence together at karaoke, it’s cute. When they talk about Harry Potter, it’s cute. And when Ariana Grande and Pete Davidson attempt to swing dance in a video together, it is cute. Almost…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}