{"url": "https://www.nickiswift.com/92329/hollywood-speaks-director-james-toback-sexual-harassment-allegations/", "text": "Hollywood speaks out against director James Toback after sexual harassment allegations\n\nCelebrities have been quick to condemn the writer-director after he was accused of sexual harassment and assault by dozens of women.\n\nOn Oct. 23, 2017, the Los Angeles Times published a report, claiming that screenwriter and director James Toback had sexually harassed at least 38 women (via The Washington Post). According to the exposé, Toback would often explain his Hollywood reputation to women he'd meet on the street, offering them a chance to be in his next film. Then, he'd allegedly bring them to his hotel room and ask them questions about their sex lives. Some of his accusers claim he'd then rub his groin against their legs or start masturbating in front of them.\n\nToback, 72, has denied these allegations, stating that he'd never met the women or, if he had, he couldn't remember their interactions because their meeting \"was for five minutes.\" He also claimed that it'd be \"biologically impossible\" for him to have engaged in such behavior due to the medication he was taking for both diabetes and a heart condition.\n\nIt appears that many celebrities had heard rumors of Toback's alleged behavior over the years, and, as such, they wasted no time in slamming the Bugsy writer after the Los Angeles Times article was published.\n\n\"The damn has broke. Women will no longer be silent. We have your back and will amplify,\" actress Debra Messing wrote.\n\n\"One of the main jobs of a director is to create a safe environment for the actors. James Toback is a disgrace,\" Bridesmaids director Paul Feig tweeted.\n\nGuardians of the Galaxy director James Gunn penned a lengthy Facebook post, describing how he personally knew at least 15 women that Toback had harassed or assaulted. Enraged at Toback's alleged behavior, Gunn wrote, \"For over twenty years now, I've been bringing up James Toback every chance I could in groups of people. I couldn't stop him, but I could warn people about him.\"\n\n\"James Toback damn you for stealing, damn you for traumatizing,\" Charmed star Rose McGowan wrote.\n\n\"So proud of my sisters for bringing down yet another pig: James Toback,\" xXx actress Asia Argento tweeted out.\n\nAs Nicki Swift previously reported, McGowan and Argento have recently come out about the alleged sexual harassment and assault they were victims to at the hands of movie producer Harvey Weinstein, who faces accusations of sexual misconduct by dozens of women in the entertainment industry. After Weinstein's alleged behavior was exposed by both The New York Times and The New Yorker, he was fired from his position at The Weinstein Company, was left by his wife, Georgina Chapman, and became the subject of investigations by the NYPD, the LAPD, and London police.\n\nOnly time will tell if Toback faces similar consequences.", "images": ["https://img.nickiswift.com/img/nickiswift_logo_black.svg", "https://img.nickiswift.com/img/nicki-swift-icon-white.svg", "https://img.nickiswift.com/img/nickiswift_logo_white_2.svg", "https://img1.nickiswift.com/img/gallery/hollywood-speaks-out-against-director-james-toback-after-sexual-harassment-allegations/intro-1508856004.jpg"], "top_img": "https://img1.nickiswift.com/img/gallery/hollywood-speaks-out-against-director-james-toback-after-sexual-harassment-allegations/intro-1508856004.jpg", "keywords": [], "authors": ["Emily Surpless"], "canonical_link": "https://www.nickiswift.com/92329/hollywood-speaks-director-james-toback-sexual-harassment-allegations/", "title": "Hollywood speaks out against director James Toback after sexual harassment allegations", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "og": {"image": "https://img1.nickiswift.com/img/gallery/hollywood-speaks-out-against-director-james-toback-after-sexual-harassment-allegations/intro-1508856004.jpg", "title": "Hollywood speaks out against director James Toback after sexual harassment allegations", "description": "Celebrities have been quick to condemn the writer-director after he was accused of sexual harassment and assault.", "type": "article", "url": "https://www.nickiswift.com/92329/hollywood-speaks-director-james-toback-sexual-harassment-allegations/", "site_name": "NickiSwift.com"}, "twitter": {"title": "Hollywood speaks out against director James Toback after sexual harassment allegations", "description": "Celebrities have been quick to condemn the writer-director after he was accused of sexual harassment and assault.", "card": "summary_large_image", "site": "@NickiSwiftCeleb", "image": "https://img1.nickiswift.com/img/gallery/hollywood-speaks-out-against-director-james-toback-after-sexual-harassment-allegations/intro-1508856004.jpg"}, "title": "Hollywood speaks out against director James Toback after sexual harassment allegations", "description": "Celebrities have been quick to condemn the writer-director after he was accused of sexual harassment and assault.", "article": {"published_time": "2017-10-24T09:51:54+00:00", "modified_time": "2017-10-24T09:51:54+00:00", "author": "Emily Surpless"}, "fb": {"pages": 915319058545299, "use_automatic_ad_placement": "enable=true ad_density=default"}, "p": {"domain_verify": "f7a286f935bd433580c2d31f5d66fea9"}}, "movies": [], "publish_date": 1508838714.0, "source": "https://www.nickiswift.com", "summary": ""}