{"url": "https://www.rollingstone.com/movies/movie-news/harvey-weinsteins-lawyer-rebuffs-rose-mcgowans-assault-allegations-197713/", "text": "Harvey Weinstein‘s lawyer said that Rose McGowan‘s claims that the film producer sexually assaulted her is “a bold lie,” Variety reports.\n\nThe statement, issued by Ben Brafman, comes as McGowan embarks on a publicity tour behind her new E! documentary series, Citizen Rose, and book, Brave. In both, McGowan discusses her allegations against Weinstein, saying the producer sexually assaulted her in a hotel in 1997 during the Sundance Film Festival. On Tuesday, McGowan also spoke about Weinstein and what she called the “complicity machine” that allowed his behavior to go unchecked for so long during interviews with Good Morning America and The View.\n\n“As a general matter, Harvey Weinstein and his attorneys have refrained from publicly criticizing any of the women who have made allegations of sexual assault against Mr. Weinstein despite a wealth of evidence that would demonstrate the patent falsity of these claims,” Brafman’s statement read. “Watching the ‘performance’ by Rose McGowan as she looks to promote her new book however, has made it impossible to remain quiet as she tries to smear Mr. Weinstein with a bold lie that is denied not only by Mr. Weinstein himself, but by at least two witnesses.”\n\nThe two witnesses are McGowan’s former manager, Jill Messick, and actor Ben Affleck. During her interview with GMA, McGowan reiterated her claim that she told Affleck about her encounter with Weinstein the day after it happened during a press event for their film, Going All the Way. McGowan said Affleck responded,”God dammit, I told him to stop doing that,” suggesting the actor knew Weinstein had a history of inappropriate behavior.\n\nBrafman’s statement, however, quotes an e-mail from Affleck to Weinstein, in which the actor says, “She never told me nor did I ever infer that she was attacked by anyone. Any accounts to the contrary are false. I have no knowledge about anything Rose did or claimed to have done.”\n\nAs for McGowan’s former manager, Brafman quotes Messick as saying that McGowan “hesitantly told me of her own accord that during the meeting that night before she had gotten into a hot tub with Mr. Weinstein. She was very clear about the fact that getting into that hot tub was something that she did consensually and that in hindsight it was also something that she regretted having done.”\n\nMcGowan is one of dozens of women to accuse Weinstein of sexual assault and harassment. The allegations were first reported last October by both The New York Times and The New Yorker, while other women, including several high profile actresses, have since come forward with their own stories. Recently, Weinstein’s ex-assistant filed a sexual harassment lawsuit against him, while the NYPD, LAPD and Beverly Hills Police Department have all opened investigations into sexual misconduct allegations involving the producer.", "images": ["https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fmovies%2Fmovie-news%2Fharvey-weinsteins-lawyer-rebuffs-rose-mcgowans-assault-allegations-197713%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=197713", "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-687411466-b6a32e0b-f608-429c-9055-984d7e636bc5.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-687411466-b6a32e0b-f608-429c-9055-984d7e636bc5.jpg", "keywords": [], "authors": ["Jon Blistein", "Jon Blistein'S Most Recent Stories", "Johnny Marr Teaches Viewers How To Play The Smiths", "The Headmaster Ritual", "Adeline Ruminates On A Lost Love With New Song", "Twilight", "Michael Mcdonald Offers Self-Isolation Balm With", "On My Own", "View All"], "canonical_link": "https://www.rollingstone.com/movies/movie-news/harvey-weinsteins-lawyer-rebuffs-rose-mcgowans-assault-allegations-197713/", "title": "Harvey Weinstein’s Lawyer Rebuffs Rose McGowan’s Assault Allegations", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "Harvey Weinstein's lawyer rebuffed Rose McGowan's claims that the producer sexually assaulted her, calling them \"a bold lie.\"", "news_keywords": "Harvey Weinstein, sexual harassment", "og": {"type": "article", "title": "Harvey Weinstein's Lawyer Rebuffs Rose McGowan's Assault Allegations", "url": "https://www.rollingstone.com/movies/movie-news/harvey-weinsteins-lawyer-rebuffs-rose-mcgowans-assault-allegations-197713/", "description": "Statement accuses actress of trying to “smear Mr. Weinstein with a bold lie”", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-687411466-b6a32e0b-f608-429c-9055-984d7e636bc5.jpg", "width": 1024, "height": 1539, "alt": "Harvey Weinstein"}, "locale": "en_US"}, "article": {"published_time": "2018-01-31T02:30:51+00:00", "modified_time": "2018-06-25T13:37:01+00:00"}, "twitter": {"text": {"title": "Harvey Weinstein's Lawyer Rebuffs Rose McGowan's Assault Allegations"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-687411466-b6a32e0b-f608-429c-9055-984d7e636bc5.jpg?w=682", "alt": "Harvey Weinstein"}, "card": "summary_large_image", "site": "@RollingStone", "title": "Harvey Weinstein’s Lawyer Rebuffs Rose McGowan’s Assault Allegations", "description": "Harvey Weinstein's lawyer rebuffed Rose McGowan's claims that the producer sexually assaulted her, calling them \"a bold lie.\""}, "generator": "WordPress 5.4", "author": "Jon Blistein", "content_type": "Article", "post_id": 197713, "title": "Harvey Weinstein's Lawyer Rebuffs Rose McGowan's Assault Allegations", "published_at": "2018-01-31 02:30:51", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-687411466-b6a32e0b-f608-429c-9055-984d7e636bc5.jpg?w=1024", "comment_count": 0, "tags": "sexual harassment", "topics": "Movies", "body": "Harvey Weinstein's lawyer said that Rose McGowan's claims that the film producer sexually assaulted her is \"a bold lie,\" Variety reports.The statement, issued by Ben Brafman, comes as McGowan embarks on a publicity tour behind her new E! documentary series, Citizen Rose, and book, Brave. In both, McGowan discusses her allegations against Weinstein, saying the producer sexually assaulted her in a hotel in 1997 during the Sundance Film Festival. On Tuesday, McGowan also spoke about Weinstein and what she called the \"complicity machine\" that allowed his behavior to go unchecked for so long during interviews with Good Morning America and The View.\"As a general matter, Harvey Weinstein and his attorneys have refrained from publicly criticizing any of the women who have made allegations of sexual assault against Mr. Weinstein despite a wealth of evidence that would demonstrate the patent falsity of these claims,\" Brafman's statement read. \"Watching the 'performance' by Rose McGowan as she looks to promote her new book however, has made it impossible to remain quiet as she tries to smear Mr. Weinstein with a bold lie that is denied not only by Mr. Weinstein himself, but by at least two witnesses.\"The two witnesses are McGowan's former manager, Jill Messick, and actor Ben Affleck. During her interview with GMA, McGowan reiterated her claim that she told Affleck about her encounter with Weinstein the day after it happened during a press event for their film, Going All the Way. McGowan said Affleck responded,\"God dammit, I told him to stop doing that,\" suggesting the actor knew Weinstein had a history of inappropriate behavior. Brafman's statement, however, quotes an e-mail from Affleck to Weinstein, in which the actor says, \"She never told me nor did I ever infer that she was attacked by anyone. Any accounts to the contrary are false. I have no knowledge about anything Rose did or claimed to have done.\"As for McGowan's former manager, Brafman quotes Messick as saying that McGowan \"hesitantly told me of her own accord that during the meeting that night before she had gotten into a hot tub with Mr. Weinstein. She was very clear about the fact that getting into that hot tub was something that she did consensually and that in hindsight it was also something that she regretted having done.\" McGowan is one of dozens of women to accuse Weinstein of sexual assault and harassment. The allegations were first reported last October by both The New York Times and The New Yorker, while other women, including several high profile actresses, have since come forward with their own stories. Recently, Weinstein's ex-assistant filed a sexual harassment lawsuit against him, while the NYPD, LAPD and Beverly Hills Police Department have all opened investigations into sexual misconduct allegations involving the producer.", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1517365851.0, "source": "https://www.rollingstone.com", "summary": ""}