{"url": "https://www.cosmopolitan.com/entertainment/celebs/a23582879/nikki-brie-bella-twins/", "text": "You don’t need to know what a clothesline, knee strike, or Rack Attack 2.0 is to recognize Stephanie Nicole Garcia-Colace and Brianna Monique Danielson. It’s not an exaggeration to say that the 35-year-old sisters are the most famous twins in the world right now. (Don’t tell the Olsens.)\n\n\n\nBrie Bella at Cosmopolitan.com HQ. Photo by Ruben Chamorro.\n\nThey’re so well-known they go by just Nikki and Brie, AKA the Bella Twins, World Wrestling Entertainment superstars whose superstardom has transcended the ring and turned into measurable mainstream success. See: nearly 20 million combined followers across Twitter, YouTube, and Instagram; almost 1 million viewers per episode of their E! reality series; and a reported combined net worth of roughly $10 million.\n\n\n\n(Oh, and for the record: the Rack Attack 2.0 is Nikki’s signature “finisher” move in which she slings her opponent over her shoulders like it’s nothing and then drops her down so she lands hard onto the ring floor, boobs first. Do not attempt this at home.)\n\n\n\nChances are, you’ve seen them on TV, in the middle of an arena, under the glow of stoplight red-colored lights—Nikki probably sporting a bright red bra top with the words “Fearless Nikki” emblazoned across the front and Brie in a black crop top reading “BRIE MODE”—sharing a mischievous grin before simultaneously flipping over the top rope, their Kardashian-length hair trailing behind them.\n\nJohn Francis/Instagram.\n\nNo? Then you’ve probably caught an episode of the popular E! reality show Total Divas, which follows the professional and personal lives of the twins and the other wrestlers in the Women's Division of WWE. (The series just returned for its eighth season last month, currently ranking as one of Wednesday night’s top ten original primetime programs for women ages 18-34, per E!.) Or maybe it was an episode of the network’s hit spinoff series, Total Bellas, which also ranks among the top ten primetime cable programs for women ages 18-49, according to the network, and is filming its fourth season now.\n\nNikki Bella at Cosmopolitan.com HQ. Photo by Ruben Chamorro.\n\nIf you’re lucky, you’ve sipped their Belle Radici wine—the first run sold out in 36 hours. Or maybe you considered ordering one of the good-vibes-infused graphic tees from their women’s empowerment-inspired clothing brand, Birdiebee. Or cooed over home videos of Birdie, Brie’s adorbs 16-month-old daughter with husband and fellow professional wrestler Bryan Danielson, on the twins’ very popular YouTube channel.)\n\nAt the very least, in the last year—arguably Nikki and Brie’s biggest, most dramatic year yet—you’ve seen them making the morning-show rounds, sitting on late-night couches, and splashed across tabloid covers breathlessly reporting on the details of the drawn-out public split between Nikki and WWE superstar John Cena. (More on that later.)\n\n\n\nAnd after an over three-year hiatus from wrestling together, the Bellas are back in the ring following a scary, sidelining neck injury (Nikki) and a baby (Brie). They made their triumphant return a few weeks ago, just in time to be part of WWE history, headlining high-profile all-women matches they themselves inspired the network to air. (More on that later, too.)\n\nWhich is why they’re at the Cosmopolitan.com office on the gray, muggy Monday morning after the annual pay-per-view WWE event known as SummerSlam. In the ring, Nikki and Brie play ass-kicking Mean Girls. IRL, they’re more like the pretty, popular girl who’s actually really, really nice.\n\n\n\nThat’s part of the appeal—they’re remarkably down-to-earth for a set of famous identical-looking babes. As the elevator door opens into the Cosmopolitan.com office, they’re all smiles, chill vibes, and eye contact. Before they start playing dress-up, forgoing the rack of Dancing with the Stars-esque sexy sequined dresses you might expect them to choose and instead gushing over the cooler, sleeker fashion-fashion looks, Nikki is low-key in a black tank and black leggings and a flannel buttoned-down. Brie is in a blush-colored flowy top and flared, wide-legged light blue jeans. Even their coffee orders are unfussy: just black, with some cinnamon if you have it.\n\nAt lunch a few hours later, over bowls of sea salt-dusted edamame and blistered shishito peppers, Nikki and Brie seem wholly unaffected by the fact that everyone else around us is literally staring at them. It’s almost like they’re charmingly oblivious to the whole being-famous thing. Except that they’ve been preparing for this moment their entire lives.\n\nEven as kids, when they were still the Garcia twins, the sisters sought out the spotlight, putting on karaoke performances at home for their parents’ unwitting friends during pay-per-view fight nights. “When there was an intermission, we would ask if we could lip sync and dance to the Spice Girls,” Brie recalls. “And my parents were always like, ‘OK?’ I look back—my parents had to watch these young girls go, ‘Tell me what you want, what you really, really want’ to like all of their drunk friends—and I'm like, How were we not embarrassed?\"\n\nTheir mom, Kathy Colace Laurinaitis, a managing partner at a national recruiting firm in Phoenix, Arizona, recalls how even as babies “they've loved entertaining people.” “I remember this time they were in a shopping cart in Toys ‘R’ Us and they weren't verbal at this point,” Laurinaitis says, “and Nicole almost started…flirting with her eyes with this group of probably grandmothers. The twins just all of a sudden started entertaining these women.”\n\nJohn Francis/Instagram.\n\nA pair of tragedies marred the twins’ senior year of high school—Brie lost her boyfriend to a car accident; Nikki lost her prospective soccer career after suffering a broken leg—and shoved them out of the nest, nearly 400 miles from home. “We both went through something life-changing,” Brie recalls, “and were like, ‘Let's go to San Diego, we have cousins there. We could just start fresh.’”\n\n\n\nAnd so, the sisters packed up their mom’s car and drove to San Diego State, where they had a dorm room for their freshman year at Grossmont College. It was there they “just started to figure out life and what we wanted,” Brie says. College, it turns out, wasn’t actually on the list.\n\n\n\nTheir extracurriculars were way more enlightening anyway. To pay the bills, Nikki and Brie worked at the Hooters in nearby Mission Valley. It was there that things finally started to click. Because Hooters isn’t just a place for chicken wing aficionados to stare at teeny orange shorts. It’s a place for chicken wing aficionados to watch live sports, too—like, say, wrestling.\n\nOh my gosh this is...this is Nicole and me, Brie remembers thinking while eyeing the TVs. There's entertainment, there's storylines, there's acting, there's athletics.\n\nAnd when she saw an ad for the 2006 Diva Search—a now-discontinued annual talent competition—she knew they had to be part of it. And they were, in matching black tank tops that read “Nicole Fo’ Sho’” and “Brizee Fo’ Sheezy,” and black booty shorts with “Garcia Twins” spelled out across the back. No blowouts or makeup, “just Plain Janes walking in,” as Brie says, in a room that sounds like a cross between a beauty pageant and an NFL cheerleader tryout. They didn’t make it.\n\nLuckily a WWE executive—Kristin Prouty, senior vice president of entertainment relations—saw something in them and gave them a chance anyway, sending the sisters to a training facility in McDonough, Georgia. “I’ll never forget the day Brie and Nicole walked through WWE’s door,” Prouty recalls. “It was immediately obvious they had something special, that ‘it’ factor that naturally lights up a room. I thought it would one day light up the world.” For the sisters, it was love at first body slam.\n\n“This was the connection to something that we'd been waiting for,” Brie says. “Something to aspire to be. College wasn't for us. We just didn't have the attention span. And it was neat to find something that we actually finally wanted to work for.”\n\nIn the more than a decade since, Nikki and Brie have performed across the country, each held championship titles, and become the breakout stars of Total Divas (of which Nikki is now also an executive producer), which is what led them to scoring their own spinoff.\n\n“It was a real shock,” Brie says of the offer to star in their own series on the network. “What got them is they knew I was going to Tampa to help out Nicole after her neck surgery. So I think a lot of the producers were like, ‘Wait, Brie and Bryan are moving to Tampa to help Nicole out?’ That really sparked something.”\n\n\n\n“They really so represent different facets of women,” says Amy Introcaso-Davis, E!’s EVP of development and production, who last month announced the decision to renew the show for a fourth season. “And they attack everything with such positivity. They are moving-forward kind of people—I think our audiences really responded to that.”\n\nPlus, there’s just something about the twins, something magnetic, something incessantly watchable, that draws in nearly 1 million total viewers per episode. “There is that twin bond people are so interested in,” Introcaso-Davis says. “Full disclosure: I am a mother of twins, and there is something so fascinating particularly with identical twins. How they react to things differently or exactly the same or how they finish one another’s sentences. That's something you can't produce.”\n\n\n\nGiphy\n\nThe timing couldn’t be better for a Bellas comeback. In the years since the Bella Twins’ September 2007 debut in the professional wrestling ring, women in the WWE have experienced what the company has dubbed an “evolution.”\n\n“One of the goals, before we were actually producing Total Divas and then ultimately the spinoff Total Bellas, was for us to have the ability to showcase the incredible women on our roster,” explains WWE chief brand officer Stephanie McMahon over the phone from Dallas, Texas, a few hours before a live broadcast of WWE Raw.\n\n“When you think about them—they are professional athletes but also professional actors, performing in front of tens of thousands of people multiple times a week, traveling the world,” McMahon continues. (WWE is seen in 180 countries in 24 different languages.) “And putting their hearts and souls and bodies on the line.”\n\nThe now-higher profile of women in the WWE is, in part, thanks to the success of Total Divas. Back before the July 2013 premiere of the series, the organization’s female wrestlers weren’t exactly given the same screen time or, you know, respect as the men.\n\n\n\nGiphy\n\n“Total Divas gave us a mainstream platform, letting people really see what the women wrestlers were doing,” Nikki explains. “I think it was the first time even for the WWE universe where they were like, ‘Whoa the women work really hard! And they work hard inside the ring and outside the ring.’\"\n\n“We started to get these people coming to the live events because they wanted to see the Total Divas,” Nikki adds, “and they’d be like, ‘Why did I see women for just two minutes and that was it?’”\n\nBrie Bella at Cosmopolitan.com HQ. Ruben Chamorro\n\nThat’s exactly what happened a little over three years ago during on a live episode of Raw. The Bellas won a tag-team match—which would’ve been a hell of a lot more exciting if, say, the match had lasted longer than 30 seconds. The abrupt bout prompted the trending Twitter hashtag #GiveDivasAChance in protest. “Fans were specifically asking for more athleticism, longer matches, better character development, better storylines,” McMahon says.\n\nThe WWE, pinned to mat, gave in. The company rebranded the then-Divas Division, which the company announced the following year at what McMahon describes as “the equivalent of our Super Bowl in front of our largest audience ever.” They decided to call it the Women’s Division, as well as introduce “a new championship belt that was more akin to the men's but still very feminine,” McMahon says.\n\n\n\nThe WWE’s female talent now participates in main event matches, and this fall, the more-than-60-year-old company is hosting its first-ever all-female pay-per-view event, titled, you guessed it, “WWE Evolution,” which will air on October 28 live from New York.\n\n\n\nThe history-making night is partly what inspired the Bellas’ triumphant return to the ring. “When they announced the all-women's pay-per-view, I was like, I have to be a part of this,\" Nikki says. “The women before me, the women of my era, the women now, we all have worked so hard to get to that place and to get women to be just as important as the men in this industry. Nothing is better than to have a comeback now.”\n\nThis is the part where we talk about John Cena—not that we should. And definitely not because his ex-fiancée Nikki wants to talk about him—she doesn’t. (In fact, at one point during our conversation, when she refers to him as “my ex,” she adds: “I can't say his name, legally, anymore” and shares a knowing smile with Brie that makes me unsure whether it’s an inside joke or if she’s serious. FWIW: The guy loves a good contract.) But because this past summer it seemed like all anyone could talk about.\n\n\n\nIf you’ve walked by a supermarket aisle or newsstand in the last few months, you know that John Cena, WWE superstar and aspiring Dwayne “The Rock” Johnson, was the prom king to Nikki’s prom queen, if the professional wrestling ring were a high school dance. After dating for nearly five years, much of which was documented on Total Divas and Total Bellas, Cena—fighting back tears, his hands shaking, the excited grin of a kid on Christmas morning across his face—got down on one knee and proposed to Nikki in the middle of the ring on live television during WrestleMania 33.\n\n\n\nBut, as Total Bellas viewers watched over the summer, their happily ever after was cut short. The first time Nikki called the wedding off it was because Cena didn’t want kids and that sacrifice was just too big for her. But when Cena had a change of heart and they got back together, underlying problems—namely, that she felt as if she’d lost herself throughout their relationship and felt a nagging sense of discontentment—surfaced and she called it off for good.\n\nAs she told Brie and their mother in an emotional car ride after she’d left the Tampa home she’d shared with Cena: “I don’t want to be the 66-year-old woman that starts living her happy life at 63.”\n\n\n\nThere’s something about the wobbliness of her voice, her face unconsciously contorting to fight back tears, the sort of tired I’ve-been-up-all-night-worrying look on all three of their faces, that makes the moment feel real, affecting, intimate even. So much so in fact, that maybe you’re, I don’t know, sort of embarrassed to admit that OK, fine, you teared up watching it the first time, and then again when you were writing this story. Which makes all of the cynical albeit somewhat understandable (it is reality TV, after all) fan conspiracy theories that the breakup is just for show seem that much more unbearable.\n\nNikki Bella at Cosmopolitan.com HQ. Ruben Chamorro\n\n“When everyone was saying what I was going through was fake for ratings and all that,” Nikki says, “and when you're really going through it, it's like, you're just, in my heartache you're literally just knifing it and just churning it.”\n\nReliving the breakup each week on television was difficult. Being questioned about it at every press appearance and criticized by fans on social media was excruciating. “We’re both are at the point that we just don't want to be talked about at all together anymore,” Nikki says. “We don't want our breakup to define us or interfere with our work. And that was happening for a while.”\n\n\n\nAnd it wasn’t just the spotlight-stealing attention that got to Nikki—it was the criticism and hate from fans who thought she was making a mistake, being “too cold” to Cena by no longer wanting the life she’d thought she did. Imagine going to work and all that your boss, the mailroom guy, and your cubicle-mate want to talk about is your breakup and why you’ve got it all wrong.\n\nNikki understands that she’s in the public eye—she’s the one who’s put it all out there—so of course people will feel a right to have, and express, their opinions about her personal life. That said, “going through all that, I don't ever want to do it again,” she says. “It scares me to ever have another public relationship.”\n\nBut the fear isn’t just about the heartbreak or the public scrutiny. “I don't want my relationship to define who I am, as a woman,” she says calmly. Nikki doesn’t sound angry or bitter or sad. She doesn’t even break eye contact. She speaks with the sort of clarity a person finds after a heartbreak finally starts healing. “And to take away all the hard work that I've ever done in my career,” she continues. “I think for a man, it's different. I feel like, if anything, the woman gets blamed for what happens, for taking away from what they do. But I get all my work taken away because of that. I don’t know, I feel like sometimes there's a double standard and I really have felt that. And it's been really, really hard.”\n\n\n\nSo anyway, Nikki, who is seeing a life coach, is working on self-love, something “I lost for so many years,” she says. “That was all my fault. I'm the one who forgot about me. I have realized now to truly have a happy life, you have to give yourself so much love first and work on you in any way you can.”\n\n\n\nThat happy life? It’s about more than championship belts and reality-TV fame: “sunsets, wine, family.” For Brie, it’s “waking up in the morning and my daughter seeing me when she wakes up, and having my mornings with her.” Also: “Not caring what people think.”\n\n\n\nGiphy\n\nBrie and Nikki at Cosmopolitan.com HQ. Ruben Chamorro\n\nOh, and “happy hour.”\n\nRight now the twins are tackling two burgeoning businesses, two reality shows, vlogging, appearances, motherhood, and dating, and they’re actually doing it themselves, not with the entourage of support so many celebrities tap into at this stage of their careers.\n\n\"Brie and I don't have personal assistants, we don't have a manager, we truly do everything on our own,” Nikki says. “We keep each other in check and we really help each other out. We're kind of each other's personal assistants.” But, perhaps most importantly, today Nikki and Brie are focused on the ring and the change they’re helping body slam into it.\n\n“We’re in the middle of history being made, which is amazing to witness,” Nikki says. “It's just how I think of being around women when they were told they could vote. I would have loved to have felt that energy. I'd have popped so many bottles of champagne.”\n\n\n\nPhotographed by Ruben Chamorro; lead wrestling images courtesy of WWE.\n\nStyled by Andrew Gelwicks. On Brie: top and pants by Marimekko, shoes by Alias Mae; and earrings by Laruicci. On Nikki: hoodie by Unravel; pants by Belstaff; shoes by Giuseppe Zanotti; and earrings by Laruicci. Together: dresses by Cynthia Rowley; shoes by Brother Vellies, and earrings (Nikki) by Laruicci.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/bella-twins-1538581805.jpg?crop=0.843xw:0.631xh;0.0721xw,0.0144xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/bella-twins-1538581805.jpg?crop=0.843xw:0.631xh;0.0721xw,0.0144xh&resize=1200:*", "keywords": [], "authors": ["Jen Ortiz", "Deputy Editor", "As Deputy Editor", "Jen Helps Oversee Cosmopolitan'S Daily Digital Editorial Operations", "Editing", "Contributing Features", "Profiles", "Essays", "News"], "canonical_link": "https://www.cosmopolitan.com/entertainment/celebs/a23582879/nikki-brie-bella-twins/", "title": "How the Bella Twins Turned Your Fave Guilty-Pleasure Sport into a Feminist Empire", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "How the Bella Twins Turned Your Fave Guilty-Pleasure Sport into a Feminist Empire", "description": "One body slam at a time.", "url": "https://www.cosmopolitan.com/entertainment/celebs/a23582879/nikki-brie-bella-twins/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/bella-twins-1538581805.jpg?crop=0.843xw:0.631xh;0.0721xw,0.0144xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2018-10-11 02:23:58", "published_time": "2018-10-10 02:45:00", "section": "Celebs", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/bella-twins-1538581805.jpg?crop=0.843xw:0.631xh;0.0721xw,0.0144xh&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "WWE Superstars Nikki and Brie Bella on WWE's Evolution, That John Cena Breakup, and Living Their Best (Crazy-Successful) Lives | Bella Twins interview", "description": "Cosmopolitan.com sits down with Nikki and Brie—AKA WWE superstars, The Bella Twins—to talk about reality TV fame, public breakups, and their highly anticipated comeback to the ring.", "keywords": "bella twins, brie bella, john cena, nikki bella, wwe, nikki bella john cena, nikki brie, nikkie brie bella, wwe bellas, wwe bella twins, total divas, total bellas, total bellas new season, bella twins reality show, total divas new season, wwe evolution, birdiebee, belle radici wine, wwe womens division, wwe divas", "auto-publish": "evergreen", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/bella-twins-1538581805.jpg?crop=0.671xw:1.00xh;0.165xw,0&resize=320:*", "sailthru.contenttype": "long-form-article", "sailthru.tags": "Celebrities & Entertainment,entertainment,celebs,brie bella,bella twins,nikki bella,John Cena,wwe,Reality TV", "sailthru.date": "2018-10-10T14:45:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/bella-twins-1538581805.jpg?crop=0.843xw:0.631xh;0.0721xw,0.0144xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/bella-twins-1538581805.jpg?crop=0.671xw:1.00xh;0.165xw,0", "sailthru.socialtitle": "How the Bella Twins Turned Your Fave Guilty-Pleasure Sport into a Feminist Empire", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1539110700.0, "source": "https://www.cosmopolitan.com", "summary": ""}