{"url": "people.com/celebrity/kevin-hart-extortion-eniko-parrish-cheating/", "text": "Kevin Hart is facing a media storm after an alleged extortion attempt against the comedian prompted him to issue an emotional apology to his wife and children on social media.\n\nThe 38-year-old star apologized to his pregnant wife Eniko Parrish in the Instagram video, claiming that there was someone who was trying to make “financial gain” from his misbehavior.\n\nGet push notifications with news, features and more.\n\nHere’s everything we know so far about the alleged extortion — and the cheating rumors that have plagued the Central Intelligence actor for months.\n\nImage zoom Eniko Parrish (left) and Kevin Hart Kevin Hart/Instagram\n\nThe FBI Is Reportedly Investigating an Alleged Extortion Attempt\n\nReports surfaced over the weekend that federal officials are investigating an alleged blackmail attempt that allegedly includes a “sexually provocative” video of Hart.\n\n“Someone tried to set Kevin up in a failed extortion attempt,” Hart’s rep confirmed in a statement to PEOPLE. “As law enforcement is involved, we cannot comment further as it could affect the investigation.”\n\nTMZ reports that FBI agents believe they know the identity of a person who allegedly demanded money to not leak the video, which features a man who may or may not be Hart getting cozy with a woman at a club and then in a bedroom.\n\nOfficials have reportedly identified the woman in the alleged footage, and believe she or someone else attempted to blackmail the star.\n\nThe alleged extortionist reportedly told TMZ that he or she was trying to get money and expose Hart for cheating. The person also claimed to have seen Hart partying in Las Vegas last month, and accused the actor of cheating on Parrish with several women.\n\nHart Apologized for His ‘Mistakes’ in an Emotional Video\n\nBefore news of the alleged extortion broke, Hart shared an Instagram video in which he revealed that a person was trying to make “financial gain” off of his past misbehavior and apologized to his family.\n\nImage zoom Eniko Parrish Instagram\n\n“I’m at a place in my life where I feel like I have a target on my back,” Hart, 38, said in the clip. “And because of that I should make smart decisions. And recently, I didn’t. You know, I’m not perfect. I’m not going to sit up here and say that I am or claim to be in any way shape or form.”\n\nHe continued: “I made a bad error in judgement and I put myself in a bad environment where only bad things can happen and they did. And in doing that I know that I’m going to hurt the people closest to me, who’ve I talked to and apologized to, that would be my wife and my kids.”\n\nHart, who’s dad to daughter Heaven, 12, and son Hendrix, 9, with ex-wife Torrei and is expecting a baby boy with Parrish, added that there are no excuses for his “wrong behavior” and described the situation as a “s—-y moment.”\n\nHart captioned the video: “Sending so many apologies to my wife & kids. I gotta do better and I will. I’m not perfect and have never claimed to be …I love you all.”\n\nParrish was photographed Sunday with her wedding ring on, walking her dog in L.A.\n\nHart Was Accused of Cheating on Parrish Over the Summer\n\nIn July, the Ride Along actor laughed off rumors that he cheated on his 32-year-old wife with a woman that he met in a Miami Beach nightclub.\n\n“At the end of the day, you just gotta laugh at the BS,” Hart wrote alongside an Instagram photo of himself mid-cackle seemingly dismissing the claims. “#LiveLoveLaugh ….. [Shaking my damn head].”\n\nRumors swirled after photos surfaced online showing him in a car with a woman after a Miami Beach nightclub appearance.\n\nThe shots quickly caught the attention of the Twittersphere, and Hart’s name trended on the social media site.\n\nImage zoom Eniko Parrish and Kevin Hart (left), Torrei Hart (right) Allen Berezovsky/Getty; Jason LaVeris/FilmMagic\n\nHart’s Ex-Wife Claimed That He Cheated on Her with Parrish While They Were Married\n\nHart was again forced to address rumors of infidelity a month later, in August, when his ex-wife, Torrei, claimed that Hart and Parrish started dating before he split from Torrei.\n\nParrish caused a stir on social media when she wrote on Instagram that she and Hart had been together for the past eight years. Fans and followers were quick to point out that Hart and Torrei got divorced six years ago.\n\n“Numbers don’t lie. Dates don’t lie at the end of the day,” Torrei told TMZ after she and Parrish went back and forth in a series of now-deleted Instagram comments.\n\nKevin Hart’s Ex-Wife Torrei Says He Was Cheating on Her with Current Wife Eniko Parrish\n\n“She forced my hand to address this publicly. The most important thing to me is my children, so if my children see something that she’s writing that makes me look like a liar, no.”\n\nParrish responded in a since-deleted comment: “Their marriage was broken way before I came in the picture. They were separated living in separate homes. I was never a secret.”\n\nHart appeared to address Torrei’s claims in a video on his Instagram Story, saying, “Going to be honest with you people, I’m at a point where I can’t even be shocked anymore. All I do is laugh man.”\n\nHart and Parrish, 32, married last August in a lavish California ceremony after a two-year engagement. The couple broke their baby news in May, telling PEOPLE that they are expecting their first child together — a little boy.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fkevin-hart1-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F06%2Fkevin-hart3.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fkevin-hart1-1.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F09%2Fpregnant-celebs-bikinis-eniko-hart-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fkevin-hart1-1.jpg", "keywords": [], "authors": ["Char Adams"], "canonical_link": "https://people.com/celebrity/kevin-hart-extortion-eniko-parrish-cheating/", "title": "Kevin Hart's Extortion Case & Cheating Rumors: Everything We Know", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Couples,Kevin Hart,Movie News,News,Scandal", "news_keywords": "Couples,Kevin Hart,Movie News,News,Scandal", "description": "The FBI is reportedly investigating an alleged extortion attempt against Kevin Hart that includes a “sexually provocative” video", "og": {"title": "Kevin Hart's Extortion Case & Cheating Rumors: Everything We Know", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/celebrity/kevin-hart-extortion-eniko-parrish-cheating/", "description": "Kevin Hart is facing a media storm after an alleged extortion attempt against the comedian prompted him to issue an emotional apology to his wife&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fkevin-hart1-1.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/celebrity/kevin-hart-extortion-eniko-parrish-cheating/", "description": "The FBI is reportedly investigating an alleged extortion attempt against Kevin Hart that includes a “sexually provocative” video", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fkevin-hart1-1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/celebrity/kevin-hart-extortion-eniko-parrish-cheating/", "title": "Kevin Hart's Extortion Case & Cheating Rumors: Everything We Know", "description": "The FBI is reportedly investigating an alleged extortion attempt against Kevin Hart that includes a “sexually provocative” video", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fkevin-hart1-1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}