{"url": "https://www.etonline.com/ariana-grande-turns-25-all-the-clues-this-will-be-her-best-year-yet-104784", "text": "Happy birthday, Ariana Grande!\n\nThe \"No Tears Left to Cry\" singer turns 25 on Tuesday, and in honor of her special day, ET is breaking down all the clues that this will be her best year yet, both personally and professionally.\n\nGrande kicked off her career as an entertainer in 2008 when she landed a role in Broadway's 13. But it wasn't until 2010 that she started to become a household name among teens everywhere when she starred as the adorable, quirky Cat Valentine in Nickelodeon's Victorious, as well as the show's short-lived spinoff, Sam & Cat, with Jennette McCurdy until 2014.\n\nWhile the brunette beauty certainly made a name for herself as an actress, her dreams of becoming a pop star were clear right from the start. For years, Grande expressed her passion for music in various interviews, belting out tunes behind the scenes and frequently sharing her future goals for a career in the music industry.\n\nTimothy Hiatt/Getty Images\n\nShe made those aspirations a reality in 2013 with the release of her debut album, Yours Truly, which featured her first big hit, \"The Way.\" She followed it up with My Everything in 2014, and Dangerous Woman, featuring Nicki Minaj, Lil Wayne, Macy Gray and Future, two years later.\n\nGrande has had massive success an artist thus far, but her star power is about to shine even brighter during year 25. Here's why:\n\nSHE'S GOT NEW MUSIC...\n\nOne week ahead of her birthday, Grande gave fans a surprise gift by unlocking her fourth studio album, Sweetener, for pre-order, along with the catchy promotional track \"The Light Is Coming.\" The song and its accompanying music video, which features Minaj and was produced by Pharrell Williams, has already received rave reviews from her loyal fan base of Arianators.\n\nIt's clear Grande is coming in hot with a brand new sound for Sweetener, available Aug. 17, and we can't wait to hear what else the powerhouse singer has up her sleeve.\n\n...A NEW FIANCE\n\nGetting engaged is one way to kick off another year older! Saturday Night Live star Pete Davidson put a ring on it earlier this month, proposing to Grande with a stunning sparkler that cost $93,000 and was commissioned by New York City jeweler Greg Yuna.\n\nInstagram\n\nThe lovebirds haven't been able to contain their excitement about their future together, with Davidson confirming the news during a recent appearance on The Tonight Show Starring Jimmy Fallon, and calling the engagement \"a dream\" via social media.\n\n\"I feel like I've won a contest,\" the 24-year-old comedian marveled. \"It's so lit.\"\n\n...A NEW HOME\n\nFollowing their engagement news, Grande and Davidson moved into a lavish apartment in New York City, and according to their Instagram Stories, they are in the exciting process of buying furniture and decorating their first place together.\n\n\"[They're] excited for the next chapter,\" a source said.\n\nAn additional source told us that the newly engaged couple actually purchased the 4,023 square-foot apartment, which features five bedrooms and four and a half baths, and is located in Chelsea, a hip and upscale neighborhood in Manhattan.\n\nStreetEasy.com\n\n...AND A NEW FRAGRANCE!\n\nAs if working on an album and getting engaged wasn't enough, Grande has also been putting her business skills to good use with the release of CLOUD. The perfume sounds like a dreamy delight, as its smell is described as a mix of \"lavender blossom, forbidden juicy pear and mouthwatering bergamot\" with a \"whipped touch of crème de coconut, indulgent praline and exotic, vanilla orchid.\"\n\nKnowing what we know about Grande, we can't imagine her beauty biz will stop here!\n\nHER CONFIDENCE IS ON FIRE.\n\nGrande still loves rocking her signature ponytail these days, but we were ecstatic to see her experiment with a few different looks this past year, including going blonde, makeup-free and even wearing her hair down for various appearances.\n\nAndrew Lipovsky/NBC\n\nIt seems as if she's become more confident in recent years, tapping into her sexy side and letting go of insecurities. Plus, it looks like Davidson is helping her out in that area, too, making her feel like \"the hottest girl in the world\" in person and on social media:\n\nSHE'S GOT A WEDDING TO PLAN!\n\nWhat could be more exciting than that? Though a source previously told ET that Grande and Davidson will have a \"long engagement,\" we have a feeling the birthday girl won't be wasting any time working on all the details for her upcoming nuptials. In fact, Grande has actually been dreaming up her big day since she was a teenager.\n\n\"Ariana has talked about marriage since she was 15,\" an additional source told ET. \"During her teen years, she was always very dreamy about a wedding and she used to call friends and talk about one day having that one special person.\"\n\n\"Ariana also spoke about a winter wedding, which seemed a little cold, but she loves the idea of a winter wonderland-type scene,\" the source added. \"We used to laugh about her fun ideas of a snowy wedding day.\"\n\nAND MAY BE GOING ON TOUR?\n\nNo official word yet, but the Boca Raton, Florida, native seems to be hinting that one might be coming! In addition to the upcoming release of her new album, which includes \"presale access to tickets for a future Ariana Grande headline tour\" when you pre-order, Grande has already created a collection of rad Sweetener merchandise.\n\nSlay, birthday girl!\n\nRELATED CONTENT:\n\nPete Davidson in Awe of Ariana Grande as He Shares Sexy Pic of Fiancée in Lingerie\n\nPete Davidson On Ariana Grande Engagement: 'I Feel Like I Won A Contest'\n\nInside Ariana Grande and Pete Davidson's Lavish New York City Apartment (Exclusive)\n\nPete Davidson Sweetly Says Being Engaged to Ariana Grande Feels Like He 'Won a Contest' This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRelated Gallery", "images": ["https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-06/gettyimages-953566612.jpg?h=c673cd1c&itok=BNnLQ0ZW", "https://www.etonline.com/themes/custom/et/img/watch-now.png", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-06/gettyimages-456610931.jpg?itok=-5cn27-J", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-06/309949612.jpg?itok=twwCzbVk", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/GettyImages-1143597813.jpg?h=ee1ee909&itok=I68E4wZI", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2020-04/gettyimages-1208907871.jpg?h=967b01ed&itok=f0LeBGob", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-06/gettyimages-953566606.jpg?itok=B3xrmrn6", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-06/clipboard01_aripete.jpg?itok=pOmQIOT7", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/gctah300_0.jpg?h=35278c44&itok=wFHc-B3i", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2018-06/gettyimages-953566612.jpg?h=c673cd1c&itok=_EIiirKk"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-06/gettyimages-953566612.jpg?h=c673cd1c&itok=BNnLQ0ZW", "keywords": [], "authors": ["Desiree Murphy"], "canonical_link": "https://www.etonline.com/ariana-grande-turns-25-all-the-clues-this-will-be-her-best-year-yet-104784", "title": "Ariana Grande Turns 25! All the Clues This Will Be Her Best Year Yet", "meta_data": {"article": {"opinion": "false"}, "title": "Ariana Grande Turns 25! All the Clues This Will Be Her Best Year Yet | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/ariana-grande-turns-25-all-the-clues-this-will-be-her-best-year-yet-104784", "title": "Ariana Grande Turns 25! All the Clues This Will Be Her Best Year Yet", "description": "'The Light Is Coming' singer is kicking off another year older with new music and a new fiancé.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-06/gettyimages-953566612.jpg?h=c673cd1c&itok=BNnLQ0ZW", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "'The Light Is Coming' singer is kicking off another year older with new music and a new fiancé.", "title": "Ariana Grande Turns 25! All the Clues This Will Be Her Best Year Yet", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Desiree Murphy‍", "url": "https://www.etonline.com/ariana-grande-turns-25-all-the-clues-this-will-be-her-best-year-yet-104784", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-06/gettyimages-953566612.jpg?h=c673cd1c&itok=BNnLQ0ZW"}, "description": "'The Light Is Coming' singer is kicking off another year older with new music and a new fiancé.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, News, Ariana Grande, Pete Davidson, Nicki Minaj, Jenette McCurdy", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}