{"url": "https://en.wikipedia.org/wiki/Murder_of_Travis_Alexander", "text": "Travis Victor Alexander (July 28, 1977 – June 4, 2008) was an American salesman who was murdered by his ex-girlfriend, Jodi Ann Arias (born July 9, 1980), in his house in Mesa, Arizona. Arias was convicted of first-degree murder on May 8, 2013, and sentenced to life in prison without the possibility of parole on April 13, 2015.[n 1]\n\nAt the time of the murder, Alexander sustained 27 knife wounds and a gunshot to the head. Arias testified that she killed him in self-defense, but she did not convince a jury.[3] The murder and trial received widespread media attention in the United States.[4][5][6][7][8]\n\nBackground [ edit ]\n\nTravis Victor Alexander was born on July 28, 1977,[9] in Riverside, California to Gary David Alexander (1948–1997) and Pamela Elizabeth Morgan Alexander (1953–2005). At the age of 11, Travis moved in with his paternal grandparents. After his father's death in July 1997,[10] his seven siblings were also taken in by their paternal grandmother. Alexander was a salesman and motivational speaker for Pre-Paid Legal Services (PPL).[11][12]\n\nJodi Ann Arias was born on July 9, 1980, in Salinas, California[13] to William and Sandra (née Allen) Arias.[14][15] Her father is of Mexican ancestry and her mother is of German and English ancestry. Jodi and Alexander met in September 2006 at a PPL conference in Las Vegas, Nevada. Arias converted to The Church of Jesus Christ of Latter-day Saints of which Alexander was a member being baptized by him on November 26, 2006 in a ceremony in southern California.[16] Alexander and Arias began dating in February 2007.[9][16] Arias moved to Mesa to live closer to Alexander.[17] In March 2007, she moved to Yreka, California, and lived there with her grandparents.[5]\n\nAlexander and Arias dated intermittently for a year and a half, often in a long-distance relationship, taking turns traveling between their respective Arizona and California homes.[18] Alexander's friends who knew Arias and observed them together tended to have a negative opinion of her, stating that the relationship was unusually tumultuous and that Arias' behavior was worrying.[18]\n\nMurder [ edit ]\n\nAlexander was murdered on Wednesday, June 4, 2008.[19] He sustained 27 to 29 stab wounds, a slit throat, and a gunshot wound to the head.[20][21] Medical examiner Kevin Horn testified that Alexander's jugular vein, common carotid artery, and trachea had been slashed and that Alexander had defensive wounds on his hands. Horn further testified that Alexander \"may have\" been dead at the time the gunshot was inflicted, and that the back wounds were shallow.[22][23][24] Alexander's death was ruled a homicide. He was buried at Riverside's Olivewood Cemetery.[25]\n\nDiscovery and investigation [ edit ]\n\nIn early 2008, Alexander told people that Arias would join him for a work-related trip to Cancún, Mexico, scheduled for June 15.[26][27] In April, Alexander asked to change his travel companion to another female friend.[28] On May 28, a burglary occurred at the residence of Arias' grandparents, with whom Arias was living. Among the missing objects was a .25-caliber automatic Colt pistol which was never recovered.[29] This later became significant as a shell case from a spent .25 caliber round was found near Alexander's body at the murder scene.[30]\n\nOn June 2, between 1:00 am and 3:00 am, Arias called Alexander four times but did not appear to get through to him, since the longest of the calls was seventeen seconds. After 3:00 am, Alexander called Arias twice, the first time for eighteen minutes, the second time for 41 minutes. At 4:03 am, Arias called Alexander back, and the call lasted two minutes, 48 seconds.[31] Neither these calls nor their transcripts were presented in Arias' trial. At 5:39 am, Arias set out to drive south to rent a car for a long trip to Utah, as stated in evidence by a gasoline purchase at Shell Food Mart in Yreka. On June 2, at 8:04 am, Arias rented a car at Budget Rent a Car in Redding, California.[31] She indicated she would return the car to Budget in Redding. Arias visited friends in southern California on her way to Utah for a PPL work conference and to meet with Ryan Burns, a PPL co-worker. By late evening on June 3, Arias apparently set out for Salt Lake City.\n\nAlexander missed an important conference call on the evening of June 4. The following day, Arias met up with Burns in the Salt Lake City suburb of West Jordan, Utah, and attended business meetings for the conference. Burns later said he noticed Arias' formerly blonde hair was now dark brown, and she had cuts on her hands.[31] On June 6, she left Salt Lake City and drove west towards California. She called Alexander several times and left several voicemail messages for him. She also accessed his cell phone voice mail system.[32] When Arias returned the car on June 7, it had been driven about 2,800 miles (4,500 km). The rental clerk testified that the car was missing its floor mats and had red stains on its front and rear seats.[31] It could not be verified that the car had floor mats when Arias picked it up and any stains could not be verified since the car was cleaned before police could examine it.\n\nOn June 9, having been unable to reach Alexander, a concerned group of friends went to his home. His roommates had not seen him for several days, but they believed he was out of town and thus did not think anything was amiss. After finding a key to Alexander's master bedroom, his friends entered and found large pools of blood in the hallway to the master bathroom, where his body was discovered in the shower.[26] In the 9-1-1 call (not heard by the jury), the dispatcher asked if Alexander had been suicidal or if anyone was angry enough to hurt him. Alexander's friends specifically mentioned Arias as a possible suspect, stating that Alexander had said she was stalking him, accessing his Facebook account, and slashing his car's tires.[33][34][35]\n\nWhile searching Alexander's home, police found his recently purchased digital camera damaged in the washing machine. Police were able to recover deleted images showing Arias and Alexander in sexually suggestive poses, taken at approximately 1:40 pm on June 4. The final photograph of Alexander alive, showing him in the shower, was taken at 5:29 pm that day. Photos taken moments later show an individual believed to be Alexander \"profusely bleeding\" on the bathroom floor.[36][37] A bloody palm print was discovered along the wall in the bathroom hallway; it contained DNA from both Arias and Alexander.[36][38]\n\nOn July 9, 2008, Arias's 28th birthday, she was indicted by a grand jury in Maricopa County, Arizona, for the first-degree murder of Alexander.[39][40] She was arrested at her home later the same day[41] and extradited to Arizona on September 5. Arias pleaded not guilty on September 11.[42] During this time, she gave several different accounts about her involvement in Alexander's death.[43] She originally told police that she had not been in Mesa on the day of the murder and had last seen Alexander in March 2008.[36][38] Arias later told police that two intruders had broken into Alexander's home, murdering him and attacking her. Two years after her arrest, Arias told police that she killed Alexander in self-defense, claiming that she had been a victim of domestic violence.[20][21][44][45][46]\n\nOn April 6, 2009, a motion to reconsider the defendant's motion to disqualify the Maricopa County District Attorney's Office was denied.[47] On May 18, the court ordered Arias to submit to IQ and competency testing.[48] Later, in January 2011, a defense filing detailed the efforts to which Arias' attorneys went to obtain text messages and emails. The prosecution initially told defense attorneys that there were no available text messages sent or received by Alexander, and then was ordered to turn over several hundred such messages. Mesa police detective Esteban Flores told defense attorneys that there was nothing \"out of the ordinary\" among Alexander's emails; about 8,000 were turned over to the defense in June 2009.[49]\n\nTrial [ edit ]\n\nCourt Superior Court of the State of Arizona in and for the County of Maricopa Decided May 7, 2013 ( ) Verdict Guilty on one count of first-degree premeditated murder Case history Subsequent action(s) During the penalty phase, a mistrial was declared due to a hung jury. Arias was eventually sentenced to life in prison without the possibility of parole on April 13, 2015. Case opinions 7 jury members: Guilty of first-degree premeditated murder and felony murder\n\n5 jury members: Guilty of first-degree premeditated murder Court membership Judge(s) sitting Sherry K. Stephens\n\nJury selection [ edit ]\n\nThe trial commenced in Maricopa County's Superior Court before Judge Sherry K. Stephens on December 10, 2011. Initial jury selection began on December 10, 2012.[50] During jury selection on December 20, Arias' defense attorneys argued that the prosecution was \"systematically excluding\" women and African-Americans; prosecutor Juan Martinez said that race and sex were irrelevant to his decisions to strike certain jurors. Judge Stephens ruled that the prosecution had shown no bias in the jury selection.[51]\n\nGuilt phase [ edit ]\n\nIn opening arguments on January 2, 2013, Martinez sought the death penalty.[52] Arias was represented by appointed counsel L. Kirk Nurmi and Jennifer Willmott, who argued that Alexander's death was a justifiable homicide committed in self-defense.[53]\n\nCo-worker Burns testified that when Arias visited him in Utah, the two had spent several hours hugging and kissing on a large bean bag chair. She told him she had cut her hands on broken glass while working at a restaurant called Margaritaville. A detective testified no restaurant by that name had ever existed in the Yreka area; at the time, Arias was working at a restaurant called Casa Ramos.[54] Arias later testified that after she cut her finger: \"I had a bazillion margaritas to make.\"[55] Later, the prosecution argued that since a .25 caliber round was found near Alexander's body and that a gun of the same caliber was stolen from Arias's residence in Yreka the week before, she had staged the burglary and used the gun to kill Alexander.[29][30] Martinez claimed Arias had stalked Alexander and had slashed his tires twice. In addition, in the final days before his death, Alexander had called her a \"sociopath\" and \"the worst thing that ever happened to me\", and stated he was afraid of her.[56]\n\nArias took the stand in her own defense on February 4, 2013,[57] testifying for a total of eighteen days; the length of time Arias spent on the stand was described by criminal defense attorney Mark Geragos as \"unprecedented\".[58] On the first day of her testimony, Arias told of being violently abused by her parents beginning when she was approximately seven years old.[57] She testified that she rented a car in Redding because Budget's website gave her two options, one to the north and one to the south, and her brother lived in Redding.[59] On her second day on the stand, she said that her sex life with Alexander included oral and anal sex; she said the anal sex was painful for her the first time they experienced it together, and that while she considered these forms of sex to be real sex, Alexander did not as they were (supposedly) not against Mormon rules concerning vaginal intercourse. Arias said that they eventually had intercourse, but less often.[60] A phone sex tape was played in which Alexander said he wanted to zip tie Arias to a tree and have anal sex with her while she was dressed as Little Red Riding Hood, which Arias seemed to respond to enthusiastically.[61] Arias had recorded this phone sex session without Alexander's knowledge or consent, apparently hoping to use it to embarrass Alexander to his Mormon peers.[18] Arias also testified that Alexander had secretly found young boys and girls sexually attractive and that she tried to help him with these urges.[62][63] Forensic experts testified that an examination of Alexander's computer found no evidence of pornographic material.[18]\n\nArias testified that her relationship with Alexander became increasingly physically and emotionally abusive.[64] She said that Alexander shook her while saying, \"I'm fucking sick of you\", then began \"screaming at me\", after which he \"body slammed me on the floor at the foot of his bed\" and taunted her, saying \"don't act like that hurts\", before he called her a \"bitch\" and kicked her in the ribs. Afterward, Arias said \"he went to kick me again, and I put my hand out.\" Arias held up her left hand in the courtroom, showing that her ring finger was crooked.[64] According to Arias, the dysfunction of their relationship reached its climax when she killed him in self-defense after he became enraged when she dropped his camera,[65] forcing her to fight for her life. This was the third differing account of Alexander's death given by Arias,[66] which both prosecutors, courtroom observers, and later jurors felt severely damaged her credibility. Rebuttal witnesses from the prosecution included several of Alexander's other girlfriends, who stated he never exhibited any problems with anger or violence.[18]\n\nArias addressed comments she made in a September 2008 interview with the syndicated news program Inside Edition, which had been played earlier in the trial. In the interview, she said: \"No jury is going to convict me ... because I am innocent. You can mark my words on that.\" Discussing the statement during her testimony, Arias said, \"At the time [of the interview], I had plans to commit suicide. So I was extremely confident that no jury would convict me, because I didn't expect any of you to be here.\" At the close of his cross-examination of Arias, Martinez replayed the video and prompted Arias to affirm that she had said during the interview that she would not be convicted because she was innocent.[57][67][68] When being questioned by Martinez, Arias was initially combative and flippant, but after several days, Martinez was able to highlight the numerous lies and inconsistencies in her testimony and she admitted to stabbing and shooting Alexander despite her earlier claims of a lapse in her memory.[18] The jury's foreman, William Zervakos, later expressed an opinion common to both jurors and observers when he told ABC's Good Morning America that Arias' testimony did not do her any good: \"I think eighteen days hurt her. I think she was not a good witness.\"[69]\n\nStarting March 14, psychologist Richard Samuels testified for the defense for nearly six days. He said Arias was likely suffering from acute stress at the time of the murder, sending her body into a \"fight or flight\" mode to defend herself, which caused her brain to stop retaining memory. In response to a juror's question asking whether this scenario could occur even if this was a premeditated murder, as the prosecution contended, he responded: \"Is it possible? Yes. Is it probable? No.\" Samuels also diagnosed Arias with post traumatic stress disorder (PTSD).[70] Martinez attacked Samuels' credibility, accusing him of forming a relationship with Arias and being biased; Samuels had previously testified he had compassion for Arias.[71] Beginning on March 26, Alyce LaViolette, a psychotherapist who specializes in domestic violence, testified that Arias was a victim of domestic abuse, and that most victims do not tell anyone about abuse because they feel ashamed and humiliated.[72] LaViolette summarized emails from Alexander's close friends: \"They have basically advised Ms. Arias to move on from the relationship ... that Mr. Alexander has been abusive to women.\"[73] The jury posed nearly 160 questions to LaViolette, many of them focusing on Arias' credibility.[74]\n\nClinical psychologist Janeen DeMarte testified for the prosecution, stating that she found no evidence Alexander had abused Arias, and no evidence of PTSD or amnesia in Arias. Furthermore, Arias' claimed total memory loss for long stretches of time was inconsistent with traumatic amnesia associated with PTSD which manifests as much shorter gaps in memory.[18] Instead, DeMarte said Arias suffered from borderline personality disorder, showing signs of immaturity and an \"unstable sense of identity.\" People who suffer from such a disorder \"have a terrified feeling of being abandoned by others\", DeMarte told jurors.[75] The final defense witness was psychologist Robert Geffner, who said that DeMarte's borderline diagnosis was \"not appropriate\" and that all tests taken by Arias since her arrest pointed toward an anxiety disorder stemming from trauma. He also said the tests indicated that she answered questions honestly, without lying.[76][77] Following Geffner's testimony, the state recalled Horn, who testified further on the gunshot wound, and called Jill Hayes, a forensic neuro-psychologist, who disputed Geffner's testimony that the MMPI test was not geared toward diagnosing borderline personality disorder,[78] concluding a long day in court at 8:29 pm.[48]\n\nOn April 24, in response to previous testimony given by Arias about buying a five-gallon gas can from a Walmart store in Salinas on June 3, 2008, that she returned on the same day,[55] the prosecution called Amanda Webb, an employee from the only Walmart in Salinas, to the stand. Webb said that according to Walmart's records, no one returned a five-gallon gas can on that date, and that Arias returned the gas can a week later rather than on June 3.[79] The gas can evidence was seen as important in establishing premeditation, as the prosecutor argued that Arias was trying to avoid being recorded on gas station security cameras as she drove to Mesa.[18]\n\nIn closing arguments on May 4, Arias' defense argued that the premeditation theory did not make sense. \"What happened in that moment in time? The relationship, the relationship of chaos, that ended in chaos as well. There is nothing about what happened on June 4th in that bathroom that looks planned ... Couldn't it also be that after everything they went through in that relationship, that she simply snapped? ... Ultimately, if Miss Arias is guilty of any crime at all, it is the crime of manslaughter and nothing more.\" In rebuttal, Martinez described the extent and variety of Alexander's wounds. \"There is no evidence that he ever laid a hand on her, ever. Nothing indicates that this is anything less than a slaughter. There was no way to appease this woman who just wouldn't leave him alone,\" he said.[80]\n\nArias' testimony added to a very long defense portion of the guilt phase of the trial, which led to problems with retention of jury members. On April 3, a member of the jury was dismissed for \"misconduct.\" The defense team asked for a mistrial, which the judge denied.[8] On April 12, another juror was excused for health reasons.[81] A third juror was dismissed on April 25 after being arrested for a DUI offense.[82] As of April 25, defense costs had reached almost $1.7 million, paid by taxpayers.[83]\n\nOn May 7, 2013, after fifteen hours of deliberation, Arias was found guilty of first-degree murder. Out of twelve jurors, five jurors found her guilty of first-degree premeditated murder, and seven jurors found her guilty of both first-degree premeditated murder and felony murder.[84] As the guilty verdict was read, Alexander's family smiled and hugged each other. People outside the courtroom began cheering and chanting.[85]\n\nAggravation phase [ edit ]\n\nFollowing the conviction, the prosecution was required to convince the jury that the murder was \"cruel, heinous, or depraved\" in order for them to determine that Arias was eligible for the death penalty.[86] The aggravation phase of the trial started on May 15, 2013.[87][88] The only witness was the medical examiner who performed the autopsy. Arias' attorneys, who had repeatedly asked to step down from the case, gave only brief opening statements and closing arguments, in which they said the adrenaline rushing through Alexander's body may have prevented him from feeling much pain during his death. Prosecutor Martinez showed photos of the corpse and crime scene to the jury, then paused for two minutes of silence to illustrate how long he said it took for Alexander to die at Arias' hands. After less than three hours of consideration, the jury determined that Arias was eligible for the death penalty.[89]\n\nPenalty phase [ edit ]\n\nThe penalty phase began on May 16, 2013, when prosecutors called Alexander's family members to offer victim impact statements, in an effort to convince the jury that Arias' crime merited a death sentence.[89]\n\nOn May 21, Arias offered an allocution, during which she pleaded for a life sentence. Arias acknowledged that her plea for life was a reversal of remarks she made to a TV reporter shortly after her conviction, when she said she preferred the death penalty. \"Each time I said that, I meant it, but I lacked perspective,\" she said. \"Until very recently, I could not imagine standing before you and asking you to give me life.\" She said she changed her mind to avoid bringing more pain to members of her family, who were in the courtroom. At one point, she held up a white T-shirt with the word \"survivor\" written across it, telling the jurors that she would sell the clothing and donate all proceeds to victims of domestic abuse. She also said she would donate her hair to Locks of Love while in prison, and had already done so three times while in jail.[90]\n\nThat evening, in a joint jailhouse interview with The Arizona Republic, KPNX-TV and NBC's Today, Arias said she did not know whether the jury would come back with life or death. \"Whatever they come back with I will have to deal with it, I have no other choice.\" Regarding the verdict she said, \"It felt like a huge sense of unreality. I felt betrayed, actually, by the jury. I was hoping they would see things for what they are. I felt really awful for my family and what they were thinking.\"[91][92]\n\nOn May 23, the sentencing phase of Arias' trial resulted in a hung jury, prompting the judge to declare a mistrial for that phase. The jury had reached an 8–4 decision in favor of the death penalty.[93] After the jury was discharged, jury foreman Zervakos stated that the jury found the responsibility of weighing the death sentence overwhelming, but were horrified when their efforts ended in a mistrial. \"By the end of it, we were mentally and emotionally exhausted,\" he said. \"I think we were horrified when we found out that they had actually called a mistrial, and we felt like we had failed.\"[94]\n\nOn May 30, Maricopa County Attorney Bill Montgomery discussed the next steps at a news conference. He said he was confident an impartial jury could be seated, but it was possible that lawyers and the victim's family could agree to scrap the trial in favor of a life sentence with no parole.[95] Arias had said, \"I don't think there is an untainted jury pool anywhere in the world right now. That's what it feels like. But I still believe in the system to a degree, so we'll just go through that if that happens.\"[91] Defense attorneys responded, \"If the diagnosis made by the State's psychologist is correct, the Maricopa County Attorney's Office is seeking to impose the death penalty upon a mentally ill woman who has no prior criminal history. It is not incumbent upon Ms. Arias' defense counsel to resolve this case.\"[96][97]\n\nAppeals [ edit ]\n\nDuring the trial, defense attorneys filed for mistrial in January, April and May 2013.[98][99] Arias' lawyers argued in January that Esteban Flores, the lead Mesa police detective on the case, perjured himself during a 2008 pretrial hearing aimed at determining whether the death penalty should be considered an option for jurors. Flores testified at the 2009 hearing that based on his own review of the scene and a discussion with the medical examiner, it was apparent that Alexander had been shot in the forehead first. Contrary to Flores' testimony at the 2009 hearing, the medical examiner told jurors the gunshot probably would have incapacitated Alexander. Given his extensive defense wounds, including stab marks and slashes to his hands, arms and legs, it was not likely the shot came first. Flores denied perjury and said during his trial testimony that he just misunderstood what the medical examiner told him.[100]\n\nIn April, the defense claimed the prosecutor had acted inappropriately and said the case resembled a modern-day equivalent to the Salem witch trials. In the motion the defense team contended \"the prosecutorial misconduct has infested these proceedings with a level of unfairness that cannot be cured by any other means.\" The motion also stated there is a \"circus-like atmosphere inside the courtroom\" and that Martinez had yelled at witnesses, attacked witnesses on a personal level, and had thrown evidence. The motion also alleged that Martinez chose to release evidence and to pose for pictures with his fans on the steps of the courthouse. The attorneys claimed Arias was in a position in which she could not present a complete defense and that the only constitutional course was to declare a mistrial.\n\nOn May 20, 2013, defense attorneys filed motion which alleged that a defense witness who had been due to testify the preceding Friday, the 17th, began receiving death threats for her scheduled testimony on Arias' behalf. The day before the filing, the witness contacted counsel for Arias, stating that she was no longer willing to testify because of the threats. The motion continued, \"It should also be noted that these threats follow those made to Alyce LaViolette, a record of which was made ex-parte and under seal.\" The motion was denied, as was a motion for a stay in the proceedings that had been sought to give time to appeal the decisions to the Arizona Supreme Court.[101]\n\nOn May 29, 2013, the Arizona Supreme Court declined to hear an appeal filed three months earlier, also refused by the mid-level Arizona Court of Appeals. Nurmi had asked the high court to throw out the aggravating factor of cruelty because the judge had allowed it to go forward based on a different theory of how the murder occurred. The lead detective originally claimed that the gunshot occurred first, followed by the stabbing and slitting of the throat. Based on that theory, Stephens ruled there was probable cause to find the crime had been committed in an especially cruel manner, an aggravating factor under state law. Subsequent to this initial hearing, the medical examiner testified that the gunshot occurred postmortem.[100][102]\n\nOn July 6, 2018, Arias' current attorneys, Margaret M. Green (a.k.a. Peg Green) and Corey Engle, filed a 324-page appeal seeking her murder conviction be overturned to the Court of Appeals. The state's response was due by January 4, 2019 and is to be provided by the Arizona Attorney General's Office. Arias would be allowed a formal reply to the state's counterargument prior to the case going before a three-judge panel for oral argument.[103][104]\n\nOn October 17, 2019, Arias' attorneys argued to the Court of Appeals that her sentence should be overturned on the basis that Martinez acted inappropriately throughout the trial, resulting in a media frenzy and affecting the outcome of the trial.[105] On March 24, 2020, the court held that notwithstanding \"egregious\" and \"self-promoting\" misconduct by the prosecutor, Arias had been convicted \"based upon the overwhelming evidence of her guilt,\" and upheld the conviction.[106]\n\nSentencing retrial and incarceration [ edit ]\n\nOn October 21, 2014, Arias' sentencing retrial began. Opening statements were given, and a hearing on evidence was held. Prosecution witness Amanda Webb, called in the first trial to rebut Arias' testimony that she returned a gas can to Walmart on May 8, 2007, admitted she did not know if all records were transferred after the store relocated.[107] After a holiday break, the retrial resumed in January, 2015.[108] Mesa police experts admitted that Alexander's laptop had viruses and pornography, contrary to testimony in the first trial in 2013.[109] Jury deliberations began on February 12, 2015.[110][111] On March 2, 2015, the jury informed Judge Stephens that they were deadlocked. Arias' attorneys requested a mistrial. Stephens denied the request, read additional instructions to the jury, and ordered them to resume deliberations.[112] On March 5, 2015, Stephens declared a mistrial because the jurors, who deliberated for about 26 hours over five days, deadlocked at 11–1 vote in favor of the death penalty. Sentencing was scheduled for April 7, 2015, with Stephens having the option to sentence Arias to either life imprisonment without the possibility of parole, or with the possibility of parole after 25 years.[113][114][115] On April 13, Stephens sentenced Arias to life imprisonment without the possibility of parole.[116] By March 5, 2015, Arias' trials cost an estimated $3 million.[117]\n\nIn an interview on April 8, 2015, Arias' attorney Jennifer Willmott discussed the social media furor, death threats she received, Arias' statements at the sentencing, the holdout juror, and stated that she believed that Arias testified truthfully.[118]\n\nIn June 2015, following a restitution hearing, Arias was ordered to pay more than $32,000 to Alexander's siblings. Her attorney stated this was about one third of the amount requested.[119]\n\nAs of 2016 , Arias is housed at the Arizona Department of Corrections #281129, which is located at Arizona State Prison Complex - Perryville.[120] She started her sentence in the complex's maximum security Lumley Unit, but she has the possibility of being downgraded to the medium security level.[121]\n\nMedia [ edit ]\n\nThe Associated Press reported that the public would be able to watch testimony in the Jodi Arias trial.[122] This decision by a three-judge panel of the Arizona Court of Appeals overruled Maricopa County Superior Court Judge Sherry Stephens' decision to \"allow a witness to testify in private as jurors [weighed] whether to give [Arias] the death penalty.\"[122] Judge Stephens held secret (non-public) hearings. As a result of the move for secrecy, an unidentified defense witness was allowed to testify in private. Though Judge Stephens' decision was overruled, \"the mystery witness who testified...at the start of the defense case\" wasn't revealed to the public.[122]\n\nThe case featured on an episode of 48 Hours Mystery: Picture Perfect in 2008,[9] an interview which, for the first time in the history of 48 Hours, was used as evidence in a death penalty trial.[123] On September 24, 2008, Inside Edition interviewed Arias at the Maricopa County Jail where she stated, \"No jury is going to convict me...because I am innocent and you can mark my words on that. No jury is going to convict me.\"[41]\n\nThe Associated Press said the case was a \"circus,\"[124] a \"runaway train\"[124] and said the case \"grew into a worldwide sensation as thousands followed the trial via a live, unedited Web feed.\"[125] They added that the trial garnered \"daily coverage from cable news networks and spawned a virtual cottage industry for talk shows\" and at the courthouse, \"the entire case devolved into a circus-like spectacle attracting dozens of enthusiasts each day to the courthouse as they lined up for a chance to score just a few open public seats in the gallery;\" \"For its fans, the Arias trial became a live daytime soap opera.\"[125] The Toronto Star stated, \"With its mix of jealousy, religion, murder, and sex, the Jodi Arias case shows what happens when the justice system becomes entertainment.\"[126]\n\nDuring the trial, public figures freely expressed their opinions. \"Jodi Arias has stated that she follows me on Twitter so I really hate to be saying that she is guilty but sadly, she is as guilty as it gets\", Donald Trump wrote. He also commented on how the Government should avoid leniency. \"Jodi should try but the govt. should not make a deal – no jury could be dumb enough to let her off (but you never know, look at OJ & others),\" Trump suggested.[127] Arizona Governor Jan Brewer told reporters after an unrelated press event that she believed Arias to be guilty. She sidestepped a question about whether she believed Arias was guilty of manslaughter, second-degree murder or first-degree murder, but said \"I don't have all the information, but I think she's guilty.\"[128]\n\nHLN staff and their commentators compared the case to the Casey Anthony case for the perceived similarities between Anthony and Arias and the emotions that the cases incited in the general public.[6][7] Additionally, HLN aired a daily show covering the trial called HLN After Dark: The Jodi Arias Trial.[129] The cable network sent out a press release titled \"HLN No. 1 Among Ad-Supported Cable as Arias Pleads for Her Life,\" bragging that they led in the ratings. The release stated: \"HLN continues to be the ratings leader and complete source for coverage of the Jodi Arias Trial. On May 21, HLN ranked No.1 among ad-supported cable networks from 1:56p to 2:15p (ET) as Arias took the stand to plead for her life in front of the jury that found her guilty of Alexander's murder. During that time period, HLN out-delivered the competition among both total viewers (2,540,000) and 25–54 demo viewers (691,000). HLN also ranked No.1 among ad-supported cable networks for the 2p hour delivering 2,227,000 total viewers and 620,000 25–54 viewers.\"[130]\n\nJodi Arias: Dirty Little Secret, a made-for-television movie, stars Lost actress Tania Raymonde as Arias and Jesse Lee Soffer, of The Mob Doctor and Chicago P.D., as Alexander. Prosecutor Juan Martinez was played by Ugly Betty actor Tony Plana and David Zayas, of Dexter, portrays detective Esteban Flores.[131] Created for and distributed by the Lifetime Network, the film premiered June 22, 2013.[132]\n\nFormer detective for Siskiyou County, California, who arrested Arias at her grandparents' home after it appeared she was on the move, is coming forward. He discusses his involvement in the explosive investigation and trial in the three-part limited series, that aired mid-January 2018, on Investigation Discovery (ID) titled \"Jodi Arias: An American Murder Mystery.\"[133] The special explores the death of Alexander and the subsequent legal circus as Arias was tried.\n\nThe pilot episode of Murder Made Me Famous, which aired 15 August 2015, chronicled the case.\n\nABC also reported on the murder on their show 20/20 on 14 February 2020.[134]\n\nSocial media [ edit ]\n\nIn late January 2013, artwork drawn by Arias began selling on eBay. The seller was her brother; he claimed that the profits went towards covering the family's travel expenses to the trial and \"better food\" for Arias while she was in jail.[135]\n\nOn April 11, USA Today reported that during the testimony of defense witness Alyce LaViolette, public outrage was extreme concerning her assertions that Arias was a victim of domestic violence. Tweets and other social media posts attacked LaViolette's reputation. More than 500 negative reviews of LaViolette's yet-to-be-released book appeared on Amazon.com calling LaViolette a fraud and a disgrace. \"It's the electronic version of a lynch mob,\" said retired Maricopa County Superior Court Judge Kenneth Fields.[136] Attorney Anne Bremner, who said she received death threats after she provided legal counsel in the Amanda Knox case, told The Huffington Post that the kind of online ridicule and threats LaViolette received could affect attorneys and witnesses in high-profile trials. \"It's something to take into account,\" Bremner said. \"If I had kids I would consider it even more so.\"[137]\n\nOn May 9, The Republic commented: \"The Jodi Arias trial has been a social-media magnet. And when Arias was convicted Wednesday of first-degree murder, Twitter and Facebook exploded with reaction. Much of it was aimed at Arias, though plenty of people tweeted at the media coverage, such as the antics of HLN host Nancy Grace. During the trial, hardcore followers of the proceedings were accused of trying to use social media to intimidate witnesses, or otherwise influence the outcome. Whether it had any effect is questionable, but it's a notable development.\"[138]\n\nOn May 24, Victoria Washington, who was one of Arias' attorneys until she had to resign in 2011 because of a conflict, said \"Arias' lead attorney, Nurmi, was pilloried in social media. At one point, an Internet denizen digitally superimposed his face onto a crime-scene photo of Alexander dead in the shower of his Mesa home. I know people were aggravated with him constantly filing for mistrial, but you have to make and preserve the record for federal review (on appeal). If you don't file for mistrial, the appeals courts will say you waived it.\"[139]\n\nOn May 28, Radar Online reported the jury foreman had been receiving threats ever since the panel deadlocked on the sentencing phase, and now his son was claiming he's receiving death threats. \"Today I read hate mail my dad had gotten. Some person had sent him a threatening message complete with his email address, full name, and phone number (which at the very least means that this guy should retake Hate Mail 101). I also read some comments on an article online about my dad. Surreal. They say my dad was fooled by the defendant, that he was taken with her, that he hated the prosecutor,\" his son wrote on his public blog.[140]\n\nThe Twitter account in Arias' name is operated by Arias' friends on her behalf. On June 22, from that account, Arias tweeted, \"Just don't know yet if I will plea or appeal.\"[141]\n\nOn March 6, 2015, after the retrial of the penalty phase concluded, it was reported that juror #17, the sole holdout, received death threats and police were posted at her house. Dennis Elias, a jury consultant, said, \"The very fact that people are making death threats and trying to out her, it is not a proud day for any single one of those people and they should be ashamed.\"[142]\n\nSee also [ edit ]\n\nNotes [ edit ]\n\n^ In the State of Arizona, a sentence of natural life requires that the defendant be incarcerated for the rest of their natural lifespan, with no possibility of parole or early release.", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/42/Jodi_Arias_%28inmate%29.png/150px-Jodi_Arias_%28inmate%29.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/81/Photo_of_Travis_Alexander.jpg/220px-Photo_of_Travis_Alexander.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/8/81/Photo_of_Travis_Alexander.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/8/81/Photo_of_Travis_Alexander.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Murder_of_Travis_Alexander", "title": "Murder of Travis Alexander", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/8/81/Photo_of_Travis_Alexander.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}