{"url": "https://www.etonline.com/why-jim-carrey-took-his-first-tv-role-since-in-living-color-with-kidding-exclusive-107433", "text": "Jim Carrey is returning to television with his new Showtime dramedy Kidding, marking his first return to TV since his time on In Living Color. And the comedy icon is opening up about why this project was the one to draw him back.\n\nCarrey and his Kidding co-stars, Judy Greer and Catherine Keener, sat down with ET's Nischelle Turner at the Television Critics Association summer press tour, and he talked about working on the small screen once again after almost a quarter of a century.\n\n\"Projects find you when you're ready to express them. That's what I find,\" Carrey shared. \"The ones that you're drawn to are the ones that, for some reason, you've just experienced something very similar or something in your past is lit up by this.\"\n\nCarrey got his big break as a cast member on the Fox sketch comedy series In Living Color, on which he starred from 1990 to 1994. Carrey left the series following the release of his massive hit films Ace Ventura: Pet Detective, The Mask and Dumb and Dumber, which all came out in his final year on the show.\n\nBut Carrey said there was one memory he had from the made-for-TV movie Mike Hammer: Murder Takes All, which he shot alongside veteran film and TV star Stacy Keach back in 1989, that really gave him a passion for acting that he's never forgotten.\n\nYoung Jim Carrey Performs Hilarious Stand-Up Routine, Opens Up About Start in Comedy -- Watch! This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart Young Jim Carrey Performs Hilarious Stand-Up Routine, Opens Up About Start in Comedy -- Watch!\n\n\"[In one scene] I had just hid behind a door [and] I remember looking over at Stacy Keach on the other side of the door and on action we were both supposed to burst out through the door and run for the car,\" Carrey recalled. \"I was on one side of the door with a gun and he was on the other side of the door with a gun and he looked at me and I looked at him and just for a split second there was a really conscious kind of connection over the idea that we are grown men, pretending to have guns, and that we're going to run into a spray of gunfire.\"\n\n\"It felt really ridiculous and it's really never felt like anything but that since,\" Carrey added.\n\nIn Kidding, Carrey stars as Jeff, a children's television icon who goes by the name Mr. Pickles (and was created in the vein of Mr. Rogers), and who has been a guiding beacon of hope and happiness for America's children for generations.\n\nHowever, as Jeff's life implodes around him and the pressures of his fame begin to feel stifling, he suffers an emotional collapse and spirals into a very complicated and public madness.\n\nHelmed by the deft directorial hand of Michel Gondry, who previously worked with Carrey on the acclaimed 2004 dramedy Eternal Sunshine of the Spotless Mind and earned accolades for his films The Science of Sleep and Be King Rewind, Kidding has a chaotic complexity and layered, post-surreal quality that even its stars have trouble explaining succinctly.\n\n\"There's a tragedy but it's not about a tragedy,\" Greer reflected. \"You talk about the innocence and finding the innocence within you that we try so hard to build these walls around, but really we're all ourselves as children inside.\"\n\n\"It's about what happens in the lightning storm when you get hit, when the family gets hit by lightning,\" Carrey added. \"And the lighting is meant to be. There's something about it that's meant to be, that is the craziest, hairiest blessing that could ever happen.\"\n\nCarrey added that, while his character has something of a nervous breakdown in the series, the show is actually \"about a nervous breakthrough.\"\n\nKidding premieres Sept. 9 on Showtime.\n\nEXCLUSIVE: Jim Carrey Reflects on the 'Insane' Experience of Getting His Start in Stand-Up Comedy This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRELATED CONTENT:\n\nJudy Greer Joins Jim Carrey's 'Kidding' Comedy Series\n\nJim Carrey to Star in Showtime Comedy 'Kidding', His First TV Series Since 'In Living Color'\n\nJim Carrey Plays an Obsessed Cop Accused of Assault in 'Dark Crimes' Clip (Exclusive)", "images": ["https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2018-08/jim_carrey_gettyimages-873872234_1280.jpg?h=c673cd1c&itok=ZKe2fxkl", "https://www.etonline.com/themes/custom/et/img/watch-now.png", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-08/jim_carrey_gettyimages-873872234_1280.jpg?h=c673cd1c&itok=3N01VLOc"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-08/jim_carrey_gettyimages-873872234_1280.jpg?h=c673cd1c&itok=3N01VLOc", "keywords": [], "authors": ["Zach Seemayer"], "canonical_link": "https://www.etonline.com/why-jim-carrey-took-his-first-tv-role-since-in-living-color-with-kidding-exclusive-107433", "title": "Why Jim Carrey Took His First TV Role Since 'In Living Color' With 'Kidding' (Exclusive)", "meta_data": {"article": {"opinion": "false"}, "title": "Why Jim Carrey Took His First TV Role Since 'In Living Color' With 'Kidding' (Exclusive) | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/why-jim-carrey-took-his-first-tv-role-since-in-living-color-with-kidding-exclusive-107433", "title": "Jim Carrey on Why He Finally Returned to TV for New Show 'Kidding'", "description": "The stars of 'Kidding' opened up to ET about their beautifully chaotic new dramedy.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-08/jim_carrey_gettyimages-873872234_1280.jpg?h=c673cd1c&itok=3N01VLOc", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "The stars of 'Kidding' opened up to ET about their beautifully chaotic new dramedy.", "title": "Jim Carrey on Why He Finally Returned to TV for New Show 'Kidding'", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Zach Seemayer‍", "url": "https://www.etonline.com/why-jim-carrey-took-his-first-tv-role-since-in-living-color-with-kidding-exclusive-107433", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-08/jim_carrey_gettyimages-873872234_1280.jpg?h=c673cd1c&itok=3N01VLOc"}, "description": "The stars of 'Kidding' opened up to ET about their beautifully chaotic new dramedy.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "TV, News, Jim Carrey, Judy Greer, Kidding", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": ["https://www.youtube.com/embed/OzwU7dbmAyY?feature=oembed"], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}