{"url": "https://realityblurb.com/2018/09/03/kim-zolciak-slams-rhoa-cast-and-evil-kenya-moore-calls-reunion-traumatizing-plus-she-talks-strained-relationship-with-kroys-parents-brielles-instagram-career/", "text": "Former Real Housewives of Atlanta star Kim Zolciak is slamming her former castmates in an all new interview!\n\nThe Don’t Be Tardy star appeared on former RHOBH star Brandi Glanville‘s podcast – Brandi Glanville Unfiltered – on Friday, and dished on a number of topics including her children’s cursing, her daughter Brielle Biermann’s lack of ambition, her strained relationship with her parents and her husband Kroy Biermann’s parents, and most importantly, her return to RHOA this past season.\n\nIf you recall, Kim had an incredibly difficult time during this year’s RHOA reunion as pretty much every lady on the show was against her, with the exception of her pal Sheree Whitfield. In her interview, Kim described the reunion as “traumatizing” and vowed she will NEVER return to the series.\n\n“It was horrible. It was disgusting,” said Kim about her return to RHOA for season 10. “The reunion was so f–king traumatizing. There was a complete attack. You only saw a few minutes [of me] from the reunion, but it was three and a half hours of me sitting on the couch to the point where I didn’t hear anything after about two hours. They were talking [about] my kids are so ugly. Kenya Moore was saying my kids are so ugly, they’re so stupid, and they’re not going anywhere.”\n\n“She’s disgusting. She’s pretty nasty. She’s evil. Kenya’s not a good person. You don’t have a good heart,” continued Kim.\n\nHost Brandi, who has also feuded with Kenya in the past during their time on Celebrity Apprentice, also got in on the Kenya bashing action! “She’s like the devil. She’s like Omarosa [Manigault]. I worked with both of them. It was hell,” shared Brandi.\n\nUnfortunately for Kim, she also got a ton of public backlash after she was shown complaining to host Andy Cohen backstage at the reunion about some of her castmates referring to her as racist. During that convo, Kim made an odd comment when she told Andy that racism wasn’t really a real thing, and that it’s only making headlines nowadays due to social media. While she has since apologized for that comment, Kim made it clear that she is still upset over that convo, as she feels she was edited out of context.\n\n“You don’t even get to see the 45 minutes in the bathroom [of what] really happened between Andy and I. I just think that they edited out of context a lot,” shared Kim. “When you don’t finish my statement, you make me look like somebody I’m not. It just puts a bad taste in my mouth. After being on this network for 11 years, it’s like you can’t tether on the line of racism in this day and age. It’s not funny. I don’t find it f–king funny. It’s gross.”\n\nIn addition to blaming RHOA producers for bad editing, she also blames her former co-stars for what she sees as playing the race card.\n\n“They know damn well that I’m not racist,” said Kim about the RHOA cast. “So, to pull that f–king card is disgusting.”\n\nShe added, “I’ll never go back. I really envisioned it to be so different but there’s so much hatred in these girls’ hearts. It’s fun to banter back and forth and cut up and whatever, but this was downright f–king nasty, dirty.”\n\nKim then went on to reveal how some of the ladies requested that Kroy stop coming to cast events with her, adding that Kroy compared that reqeust to slavery.\n\n“We got a phone call that Kroy could no longer drive me to scenes. Kroy said slavery ended a long time ago,” shared Kim. “We drink at these scenes so I’m not going to drink and f–king drive. They called and said he can no longer drive [you], two of the women have complained. Kroy said slavery ended a long time ago sweety.”\n\nThe topic turned to Kim’s strained relationship with her parents, who she hasn’t seen or spoken to in over six years, as she revealed they remain estranged.\n\n“No,” answered Kim when asked if she talks to her mom. “And I’m okay with it though, like I wasn’t okay with it for so long. As a mother, if you mess with my kids and you start selling stories that aren’t true, and you affect my kids? [I’m done].”\n\nShe seems to be referencing an interview her parents did years ago, in which they confirmed that Kim’s eldest two daughters, Brielle and Ariana Biermann, don’t have the same father.\n\nShe was also asked about her estranged relationship with Kroy’s parents. They don’t have a relationship with Kroy as well since he married Kim. Oddly enough, Kim said she sort of understands why Kroy’s parents didn’t want their son to marry her.\n\n“I don’t think they ever necessarily hated me but I just wasn’t their vision [for their son],” she shared. “I was 31, yes I have a bachelor’s degree in nursing, I went to college, but I had two kids. And I told Kroy that if I saw Housewives, like the chain-smoking, drinking wine, cursing like a sailor, I would be like ugh [as well].”\n\nAdditionally, Kim was asked about her kids cursing up a storm on the show, and she appeared to want to blame their big sister Brielle, 21, for being the bad influence.\n\n“KJ, I mean what do you expect? He has a 21-yr-old sister at the end of the day,” said Kim. “But he’s so well behaved in school. He doesn’t say it around other people. He won a huge award at school for his behavior so the kids are just so great at school and then they come home. It’s more me. He would never say that in front of Kroy.”\n\nOn the topic of Brielle, Kim admitted that her daughter lacks motivation when asked what Brielle does these days, adding that Brielle’s main focus now is Instagram.\n\n“Well, she wants to start on her own podcast actually, [but] she is so busy with Instagram,” admitted Kim. “It’s insane [how much money she’s making]. She does so well. She’s very authentic and very real. and only will post what she believes in but she’s not overly motivated. When you make that kind of money on Instagram though, it’s like you think I’m going to wait tables?”\n\nShe did add that Brielle is a great big sister, who actually spends nights at her home, in order to be closer to her young siblings, despite having her own place now.\n\n“She has her own apartment but yeah, she’s at the house with me,” explained Kim. “She has a huge high rise [apartment] in Buckhead which is like Beverly Hills, you know. She has this beautiful apartment and she comes to our house every night and sleeps.”\n\n“She uses [her apartment] on the weekends,” added Kroy, who was also present during the interview, although he barely said anything.\n\n“She has younger siblings that she’s so connected with. She picks them up from school [and] she has lunch with them. She’s super involved,” continued Kim.\n\nFinally, Kim was asked when viewers can expect to see the new season of Don’t Be Tardy.\n\n“I don’t know. They said December. Usually, we’ve aired by now. I swear it’s coming,” answered Kim.\n\nPhotos Credit: Michael Simon/startraksphoto.com,", "images": ["https://realityblurb.com/wp-content/uploads/2020/04/Pump-Rules-Dayna-Kathan-and-Brett-Caprioni-plus-Charli-Burnett-400x284.jpg", "https://realityblurb.com/wp-content/uploads/2019/11/Shiva-Safai-new-boyfriend-Niels-Houweling-plus-Mohamed-Hadid-e1574892714519-400x283.jpg", "https://realityblurb.com/2018/09/03/kim-zolciak-slams-rhoa-cast-and-evil-kenya-moore-calls-reunion-traumatizing-plus-she-talks-strained-relationship-with-kroys-parents-brielles-instagram-career/ https:/realityblurb.com/wp-content/uploads/2019/02/social-twitter-pink.png", "https://realityblurb.com/2018/09/03/kim-zolciak-slams-rhoa-cast-and-evil-kenya-moore-calls-reunion-traumatizing-plus-she-talks-strained-relationship-with-kroys-parents-brielles-instagram-career/ https:/realityblurb.com/wp-content/uploads/2019/02/social-pinterest-pink.png", "https://realityblurb.com/2018/09/03/kim-zolciak-slams-rhoa-cast-and-evil-kenya-moore-calls-reunion-traumatizing-plus-she-talks-strained-relationship-with-kroys-parents-brielles-instagram-career/ https:/realityblurb.com/wp-content/uploads/2019/02/social-instagram-pink.png", "https://realityblurb.com/wp-content/uploads/2016/02/retina-pin2k-logo-1.png", "https://realityblurb.com/wp-content/uploads/2020/04/Vanderpump-Rules-Recap-Tom-Schwartz-and-Katie-Maloney-400x256.jpg", "https://realityblurb.com/wp-content/uploads/2019/11/RHONJ-Joe-Giudice-and-Teresa-Giudice-News-400x281.jpg", "https://realityblurb.com/wp-content/uploads/2018/09/Kim-Zolciak-talks-Kenya-Moore-and-Brielle-Biermann.jpg", "https://realityblurb.com/wp-content/uploads/2016/02/white-logo1.png", "https://realityblurb.com/wp-content/uploads/2016/02/profile-sola1-120x120.jpg", "https://realityblurb.com/wp-content/uploads/2016/02/retina-pin2k-logo-1B.png", "https://realityblurb.com/wp-content/uploads/2018/09/Kim-Zolciak-talks-Kenya-Moore-and-Brielle-Biermann-1024x792.jpg", "https://realityblurb.com/wp-content/uploads/2020/03/Melissa-Gorga-Getting-Her-Mail-Photos-3-400x250.jpg", "https://realityblurb.com/wp-content/uploads/2016/02/feed-logo.png", "https://realityblurb.com/wp-content/uploads/2020/04/Pump-Rules-Kristen-Doute-and-Stassi-Schroeder-and-Lala-Kent-plus-Scheana-Shay-400x279.jpg", "https://realityblurb.com/wp-content/uploads/2016/02/blurb-logo-1@2x.png", "https://realityblurb.com/wp-content/uploads/2020/04/Jeana-Keough-and-Kara-Keough-e1586961040194-400x295.jpg", "https://realityblurb.com/wp-content/uploads/2019/12/Kenya-Moore-News-Update-e1577372761358-400x289.jpg", "https://realityblurb.com/wp-content/uploads/2019/06/Kathryn-Dennis-plus-Thomas-Ravenel-News-400x263.jpg", "https://realityblurb.com/2018/09/03/kim-zolciak-slams-rhoa-cast-and-evil-kenya-moore-calls-reunion-traumatizing-plus-she-talks-strained-relationship-with-kroys-parents-brielles-instagram-career/ https:/realityblurb.com/wp-content/uploads/2019/02/social-facebook-pink.png"], "top_img": "https://realityblurb.com/wp-content/uploads/2018/09/Kim-Zolciak-talks-Kenya-Moore-and-Brielle-Biermann.jpg", "keywords": [], "authors": ["Ace Infphoto.Com."], "canonical_link": "https://realityblurb.com/2018/09/03/kim-zolciak-slams-rhoa-cast-and-evil-kenya-moore-calls-reunion-traumatizing-plus-she-talks-strained-relationship-with-kroys-parents-brielles-instagram-career/", "title": "Kim Zolciak Slams RHOA Cast! Talks Feud with Kroy's Parents & Racist Claims", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "format-detection": "telephone=no", "theme-color": "#db0a5b", "og": {"type": "article", "title": "Kim Zolciak Slams RHOA Cast & \"Evil\" Kenya Moore, Talks Strained Relationship With Kroy's Parents & Brielle's Instagram Career", "description": "Former Real Housewives of Atlanta star Kim Zolciak is slamming her former RHOA castmates and \"evil\" Kenya Moore in a new interview. The Don't Be Tardy star also discusses her strained relationship with husband Kroy Biermann's parents, and daughter Brielle Biermann's lack of ambition.", "image": {"identifier": "https://realityblurb.com/wp-content/uploads/2018/09/Kim-Zolciak-talks-Kenya-Moore-and-Brielle-Biermann.jpg", "width": 1400, "height": 1083}, "url": "https://realityblurb.com/2018/09/03/kim-zolciak-slams-rhoa-cast-and-evil-kenya-moore-calls-reunion-traumatizing-plus-she-talks-strained-relationship-with-kroys-parents-brielles-instagram-career/", "site_name": "Reality Blurb", "updated_time": "2018-09-03T15:37:14-05:00"}, "article": {"author": "https://www.facebook.com/realityblurb", "publisher": "https://www.facebook.com/realityblurb", "published_time": "2018-09-03T15:25:47-05:00", "modified_time": "2018-09-03T15:37:14-05:00"}, "twitter": {"card": "summary_large_image", "title": "Kim Zolciak Slams RHOA Cast! Talks Feud with Kroy's Parents & Racist Claims", "description": "Former Real Housewives of Atlanta star Kim Zolciak is slamming her former castmates in an all new interview!    The Don't Be Tardy star appeared on former RHOBH star Brandi Glanville's podcast - Brandi Glanville Unfiltered -", "image": "https://realityblurb.com/wp-content/uploads/2018/09/Kim-Zolciak-talks-Kenya-Moore-and-Brielle-Biermann.jpg", "creator": "@realityblurb"}, "description": "Former Real Housewives of Atlanta star Kim Zolciak is slamming her former RHOA castmates and \"evil\" Kenya Moore in a new interview. The Don't Be Tardy star also discusses her strained relationship with husband Kroy Biermann's parents, and daughter Brielle Biermann's lack of ambition.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "generator": "WordPress 5.3.2", "google-site-verification": "KLs5Ahl3S2IZ7ied-aRAdTdpzpk7JE8c7coRSP72Ob8", "msapplication-TileImage": "https://realityblurb.com/wp-content/uploads/2016/02/cropped-Image1-300x300.jpg"}, "movies": [], "publish_date": 1535904000.0, "source": "https://realityblurb.com", "summary": ""}