{"url": "https://www.washingtonpost.com/news/wonk/wp/2017/08/21/treasury-secretarys-wife-boasts-of-travel-on-government-plane-touts-hermes-and-valentino-fashion/", "text": "“Did you think this was a personal trip?!” Linton wrote on her Instagram page, responding to the person who had written “glad we could pay for your little getaway.”\n\nAD\n\n(Linton's Instagram account was later made “private” so that it could not be publicly seen).\n\nLinton continued in her response to the critic: “Adorable! Do you think the US govt paid for our honeymoon or personal travel?! Lololol. Have you given more to the economy than me and my husband? Either as an individual earner in taxes OR in self sacrifice to your country? I’m pretty sure we paid more taxes toward our day ‘trip’ than you did. Pretty sure the amount we sacrifice per year is a lot more than you’d be willing to sacrifice if the choice was yours.”\n\nAD\n\nLinton added, “You’re adorably out of touch … Thanks for the passive aggressive nasty comment. Your kids look very cute. Your life looks cute.”\n\nAD\n\nThis ignited a raft of controversy and drew national media attention for Linton. The spouses of cabinet members are often shielded from public scrutiny, but they also tend to keep a low profile. The spouses of recent Treasury chiefs rarely traveled on official business with their husbands, and there is little precedent for a social media fight like this.\n\nLinton's Instagram episode came in the midst of a strange period for Mnuchin, who two days earlier sent a letter to his former Yale University classmates explaining why he would not resign from office. His former classmates at Yale had called on Mnuchin to step down because of comments President Trump made following a killing in Charlottesville, Va. at the scene of a violent rally held by white supremacists and Neo-Nazis. Trump's comments after the rally expressed some sympathy for some of the people marching with the white supremacists.\n\nAD\n\nIn the statement Mnuchin issued one week after the Charlottesville death, he said he condemns \"the actions of those filled with hate and with the intent to harm others.\" Mnuchin's statement stood out in part because other members of Trump's cabinet issued statements condemning the white supremacists almost immediately after the violence.\n\nAD\n\nMnuchin is playing a central role in the White House's effort to overhaul the tax code and raise the debt ceiling, and the recent distractions have the potential to overshadow his work in those areas.\n\nThe fashion companies Linton “tagged” in her Instagram post were Hermès, Roland Mouret, Tom Ford and Valentino.\n\nMnuchin and Linton have been married for two months. Mnuchin is a Hollywood producer and former banker.\n\nThe bizarre exchange came the day Mnuchin flew to Louisville to try to make the case for Congress to overhaul the tax code. He particularly stressed how the tax changes would help middle-class Americans, although Democrats have alleged the Trump administration wants to pass large tax cuts that benefit the wealthy and multinational corporations.\n\nAD\n\nAD\n\nTypically, Treasury secretaries only fly government planes when they go on international trips. They usually fly on domestic carriers when they are traveling inside the country.\n\nMnuchin and Linton recently returned from their honeymoon, though they have not revealed where they went. Linton is a Scottish actress and has raised eyebrows within the White House for accompanying Mnuchin to congressional hearings and on other trips that spouses don’t often take.\n\nA Treasury Department spokesman said Monday’s flight was cleared by appropriate government channels, and that the Mnuchins covered the cost of Linton’s travel. The spokesman added that Linton did not receive any financial compensation for mentioning the fashion brands that she tagged in her Instagram post.", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/5a455ec3-00dd-48c6-9dfd-0bd1d97924ea.png&w=90&h=90", "https://www.washingtonpost.com/resizer/fXS-pdo_eniFQffBF8byIHxwWM0=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/L3LG5TQBPY2D7L6SZQDP7ER56M.jpg"], "top_img": "https://www.washingtonpost.com/resizer/fXS-pdo_eniFQffBF8byIHxwWM0=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/L3LG5TQBPY2D7L6SZQDP7ER56M.jpg", "keywords": [], "authors": ["Damian Paletta", "Reporter Covering Economic Policy"], "canonical_link": "https://www.washingtonpost.com/news/wonk/wp/2017/08/21/treasury-secretarys-wife-boasts-of-travel-on-government-plane-touts-hermes-and-valentino-fashion/", "title": "Treasury secretary’s wife boasts of travel on government plane, touts Hermes and Valentino fashion", "meta_data": {"description": "U.S. Treasury Secretary Steven Mnuchin’s wife Louise Linton boasted of flying on a government plane with her husband to Kentucky on Monday and then named the numerous fashion brands she wore on the trip in an unusual social media post that only became more bizarre minutes later.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/wonk/wp/2017/08/21/treasury-secretarys-wife-boasts-of-travel-on-government-plane-touts-hermes-and-valentino-fashion/", "image": "https://www.washingtonpost.com/resizer/fXS-pdo_eniFQffBF8byIHxwWM0=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/L3LG5TQBPY2D7L6SZQDP7ER56M.jpg", "title": "Treasury secretary’s wife boasts of travel on government plane, touts Hermes and Valentino fashion", "description": "U.S. Treasury Secretary Steven Mnuchin’s wife Louise Linton boasted of flying on a government plane with her husband to Kentucky on Monday and then named the numerous fashion brands she wore on the trip in an unusual social media post that only became more bizarre minutes later."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Treasury secretary’s wife boasts of travel on government plane, touts Hermes and Valentino fashion", "description": "U.S. Treasury Secretary Steven Mnuchin’s wife Louise Linton boasted of flying on a government plane with her husband to Kentucky on Monday and then named the numerous fashion brands she wore on the trip in an unusual social media post that only became more bizarre minutes later."}, "last_updated_date": "2019-04-29T13:58:55.069Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1503244800.0, "source": "https://www.washingtonpost.com", "summary": ""}