{"url": "http://time.com/4913247/game-of-thrones-season-8-premiere-date/", "text": "The eighth and final season of Game of Thrones premiered on April 14, 2019. At last, fans are finally going to find out the ultimate fate of Jon Snow, Daenerys Targaryen and the rest of the Westerosi.\n\nGame of Thrones will air every Sunday night until the series finale on May 19. Until then, fans are theorizing about how the show will end — and who will win the Iron Throne.\n\nHere’s everything we know about season 8 so far.\n\nWhat time does Game of Thrones air?\n\nIt airs on 9 p.m. EST on HBO in the U.S., and at 2 a.m. on Sky Atlantic in the U.K. as part of the Transatlantic simulcast the show is offering this year.\n\nWhat happened in Game of Thrones season 8 episode 5?\n\nArya Stark fights for survival in Game of Thrones season 8 episode 5. Helen Sloan—HBO\n\nGame of Thrones‘ final penultimate episode saw Daenerys unleash a fiery spree of terror on King’s Landing despite the fact that Cersei rang the bells of surrender after Drogon destroyed the Iron Fleet and all of the scorpions lining the city’s outer walls. Jon and Tyrion then watched on in horror as Daenerys transitioned fully into the Mad Queen some had long feared she would become.\n\nAfter Tyrion freed Jaime in hopes that he could convince Cersei to leave Westeros with him, Jaime attempted to sneak into the Red Keep to reunite with his sister. However, he was caught by Euron Greyjoy and forced into a fight to the death. Jaime ultimately came out on top, but was mortally wounded in the process. Despite his injuries, he still made it to Cersei’s side and the twin Lannisters died together as the castle crumbled around them.\n\nMeanwhile, after convincing Arya to abandon her quest for vengeance on Cersei, the Hound finally came face to face with the Mountain and it was time for “Cleganebowl.” The Hound managed to stab the Mountain through the stomach with a sword and through the eye with a dagger despite taking a horrific beating. But after realizing that his zombified brother couldn’t be killed by normal means, the Hound tackled the Mountain through the crumbling Red Keep wall and the two both fell to their deaths.\n\nArya was then left to try to make her way out the city alone as Daenerys continued her carnage. In the final moments of the episode, a traumatized Arya found herself alone in the ruins of King’s Landing. But after discovering the burned bodies of a mother and daughter who had saved her from being trampled to death, she looked up to see a lone white horse seemingly waiting for her. She then mounted the horse and rode off through the destruction.\n\nWhat happened in Game of Thrones season 8 episode 4?\n\nHelen Sloan—HBO\n\nAfter mourning the fallen of the Battle of Winterfell, those left alive spent some time celebrating their victory against the Night King in episode 4, “The Last of the Starks.” But Daenerys’ spirits were dampened when she saw firsthand how much people adore Jon, prompting her to beg him to never reveal his true identity. Jon, however, felt compelled to tell Sansa and Arya, and the truth then spread to Tyrion and Varys.\n\nThings only went from bad to worse for Daenerys when Rhaegal was killed and Missandei was captured during a surprise attack by Euron and the Iron Fleet at Dragonstone. News of this assault sent Jaime — who had spent the episode growing closer to Brienne — into a downward spiral, and the Kingslayer fled Winterfell in the night to return to Cersei despite Brienne’s tearful pleas for him to stay.\n\nDaenerys and her entourage then made their way to King’s Landing to try to parlay with Cersei and save Missandei, but Tyrion’s attempt to convince Cersei to surrender to save her unborn child fell on death ears. As Tyrion, Grey Worm and Daenerys watched on in horror, the Mountain beheaded Missandei on Cersei’s orders.\n\nWhat happened in Game of Thrones season 8 episode 3?\n\nIain Glen as Jorah Mormont and Emilia Clarke as Daenerys Targaryen Helen Sloan—HBO\n\n“The Long Night” episode of Game of Thrones‘ eighth season didn’t waste any time jumping right into the action of the Battle of Winterfell. After Melisandre showed up to set the Dothrakis’ swords ablaze with an incantation she presumably learned during her time in Volantis, the showdown with the Night King and his army of dead quickly got underway.\n\nUnfortunately, even with Daenerys and Jon flying into battle on the backs of Drogon and Rhaegal, it seemed like the living didn’t stand a chance against the dead from the get-go — especially once the Night King raised all of the soldiers who had been killed to revitalize his forces.\n\nBut Melisandre still had one more trick up her sleeve. After Beric Dondarrion sacrificed himself to save Arya, Melisandre gave her the push she needed to realize she was the one who was fated to kill the Night King. Arya then sprinted to the godswood, where the Night King was preparing to kill Bran after cutting down Theon, and stabbed the leader of the White Walkers with her Valyrian steel dagger. Once the Night King was vanquished, all of the dead — including zombie Viserion — fell too, ending the Great War.\n\nWhat happened in Game of Thrones season 8 episode 2?\n\nBrienne of Tarth gets knighted by Jamie Lannister at last. Helen Sloan/HBO\n\n“A Knight of the Seven Kingdoms” was another dialogue-heavy, table-setting episode, as everyone at Winterfell hunkered down and prepared for the White Walkers’ impending siege of the city.\n\nJaime Lannister was met with skepticism when he arrived at Winterfell and announced he had defected from his sister Cersei. But after Brienne of Tarth vouched for his integrity, he was set free; Jaime returned the favor by knighting her, creating one of show’s most touching and uplifting moments.\n\nDaenerys sparred with two Stark siblings: Sansa (over the issue of Northern independence) and Jon (after he revealed his true identity, which gave him a claim to the Iron Throne).\n\nTheon returned and pledged to defend Bran Stark, who is expecting a visit from the Night King during the Battle of Winterfell. Arya received a weapon from Gendry; the pair consummated their long-held crushes for each other. Podrick sang a hymn, “Jenny’s song.”\n\nAs many characters exchanged their farewells before the war, from Grey Worm to Missandei to the Hound to Jorah to Brienne to Sam, it was hard not to think that many of them might be saying goodbye for good.\n\nWhat happened in the Game of Thrones season 8 premiere?\n\nHelen Sloan/HBO\n\nThe Game of Thrones season 8 premiere opened with Jon, Daenerys and their combined entourage arriving at Winterfell to begin preparing for the war against the dead, a development that led to several long-awaited reunions between fan favorite characters. After Sansa and Tyrion got nostalgic about Joffrey’s murder, Jon and Arya shared an emotional moment in the godswood, and Gendry agreed to make Arya a fancy new dragonglass weapon.\n\nAs was speculated by fans, Jon finally rode Rhaegal, the dragon named after his father, and Bran spent the majority of the episode staring at people from across the Winterfell courtyard while “waiting for an old friend” — a.k.a. Jaime.\n\nMeanwhile, the Night King and his army were busy sending a message by leaving the dead body of young Ned Umber impaled to a wall and surrounded by a spiral of severed limbs for Tormund, Beric and Dolorous Edd to discover at Last Hearth.\n\nAnd last but not least, Jon finally learned that he is the trueborn son of Rhaegar Tarygaryen and Lyanna Stark, not the bastard of Ned Stark as he was raised to believe. Unfortunately, since that means Jon is not only related to Daenerys, but also the rightful heir to the Iron Throne, this discovery seems likely to throw a wrench their budding romance.\n\nHere’s what we learned from the official Game of Thrones season 8 trailer when it came out.\n\nThe two-minute preview was all about building up to the final showdown between the living and the dead that’s supposed to blow the Battle of the Bastards out of the water. All eyes were on an injured Arya Stark running away and in another key shot, an uninjured Arya with a a dragonglass dagger in hand. Another revelation? Tormund and Beric live! And most interesting of all, Daenerys and Jon visit Drogon and Rhaegal, fueling speculation that it might be time for Jon to ride the dragon named after his father. (And in the premiere, it happened.)\n\nWatch the full trailer below.\n\n“Wig,” wrote Maisie Williams who was just one of the cast members to tweet about it.\n\nGame of Thrones season 8 poster shows a dragon eyeing the iron throne Game of Thrones season 8 poster\n\nHow about those new Game of Thrones season 8 teasers?\n\nWith just days to go until the season 8 premiere, HBO dropped two new promos, “Together” and “Survival,” as well as a new teaser, “Aftermath,” to get fans hype for Game of Thrones‘ return. While both promos largely featured scenes that we already saw in the season 8 trailer — except for a shot of what looks to be the moments before Jon and Arya finally reunite — the teaser does not contain any show footage, according to HBO.\n\nInstead, it shows glimpses of Tyrion’s Hand of the Queen pin, Arya’s sword Needle, Lyanna’s feather, Bran’s wheelchair, Jaime’s golden hand, Daenerys’ dragon chain and Jon’s sword Longclaw in the snowy ruins of Winterfell, perhaps hinting at what’s to come if our heroes fail to defeat the Night King.\n\nGame of Thrones season 8 “Together” video\n\nGame of Thrones season 8 “Survival” video\n\nGame of Thrones season 8 “Aftermath” video\n\nHBO also released a corresponding poster to the “Aftermath” teaser that shows the bodies of nearly all of Westeros’ major players laid out in the snow in the shape of the Iron Throne.\n\nHBO\n\nREAD MORE: Your Ultimate Guide to Binge-Watching Every Game of Thrones Episode\n\nWhat is the plot of Games of Thrones?\n\nThe plot of the final season is still very much under wraps. HBO programming president Casey Bloys told Entertainment Weekly that the network has heightened security to prevent season 8 leaks and Nikolaj Coster-Waldau even revealed that the scripts the cast received would “self-destruct.”\n\n“They’re very very strict. It’s reached a crazy level this year,” he explained during an interview at Cannes 2018. “We actually get the scripts, and then when we’ve shot the scene—and we only have it digitally—and then when you’ve done the scene, it just vanishes. It’s like Mission: Impossible. ‘This will self-destruct.'”\n\nBut that hasn’t stopped some of Thrones‘ biggest stars from teasing the action to come. “This season is bloodier than ever. It’s full of betrayal, full of war, full of danger,” Sophie Turner told 1883 Magazine. “That’s all I can say without giving too much away.”\n\nHow many episodes are there in season 8 of Game of Thrones?\n\nHBO split the final 13 episodes of Game of Thrones into two shorter seasons. Season 8 will consist of six episodes and will have the longest average episode length of any Game of Thrones season. The run times for all six episodes have been confirmed by HBO, with the first four episodes set to run for 54, 58, 82 minutes and 78 minutes, respectively, while episode 5 and the finale will run for 80 minutes each. That’s an average episode length of 68 minutes and 20 seconds.\n\nA November cover of Entertainment Weekly also featured the first official photo from Game of Thrones season 8. The instantly iconic shot shows Kit Harington and Emilia Clarke cozied up to each other against a wintry Westeros backdrop. “End game,” reads the caption, which seems like a nod to both the final season of the show and possibly, Jon and Dany’s romance.\n\nOn Feb. 6, HBO released the first official photos from season 8. The stills — which show Jon Snow (Kit Harington), Daenerys Targaryen (Emilia Clarke), Tyrion Lannister (Peter Dinklage), Cersei Lannister (Lena Headey) and others — don’t give much away about the plot.\n\nKit Harington as Jon Snow and Emilia Clarke as Daenerys Targaryen Helen Sloan—HBO\n\nThe stills — which show Jon Snow (Kit Harington), Daenerys Targaryen (Emilia Clarke), Tyrion Lannister (Peter Dinklage), Cersei Lannister (Lena Headey) and others — don’t give much away about the plot, but they’re another sign that the premiere is getting closer.\n\nPeter Dinklage as Tyrion Lannister Helen Sloan—HBO\n\nHBO dropped a new collection of character posters featuring each of Westeros’ remaining power players — from Jon Snow to Daenerys Targaryen to Sansa Stark — on the Iron Throne back in February as well.\n\nHBO has also announced that David Benioff & D.B. Weiss, David Nutter and Miguel Sapochnik are the directors of the new season. Season 8 episodes were written by David Benioff & D.B. Weiss, Bryan Cogman and Dave Hill.\n\nIn an interview with TIME in March 2017, showrunners David Benioff and D.B. Weiss told us that they already knew “what happens in every scene.”\n\nHow many more seasons of Game of Thrones are there?\n\nSeason 8 will be the final season of Game of Thrones. However, HBO has officially greenlit a pilot episode for a prequel series from showrunner Jane Goldman (X-Men: First Class, Kingsman: The Secret Service) that will take place thousands of years before the events of Game of Thrones and chronicle “the world’s descent from the golden Age of Heroes into its darkest hour.”\n\nBloys told EW that Goldman’s prequel won’t start shooting until at least early 2019.\n\nThere’s also a chance we could be getting even more Thrones spinoff series. “Three more Game of Thrones prequels, set in different periods and featuring different characters and storylines, remain in active development,”George R.R. Martin wrote in a June blog post. “Everything I am told indicates that we could film at least one more pilot, and maybe more than one, in the years to come.”\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Eliana Dockterman at eliana.dockterman@time.com and Megan McCluskey at megan.mccluskey@time.com.", "images": ["https://api.time.com/wp-content/uploads/2017/08/game-of-thrones-s8-e4-daenerys-drogon.jpeg", "https://api.time.com/wp-content/uploads/2020/04/THTH_103_Portraits_01423R2.jpg?quality=85&w=600", "https://api.time.com/wp-content/uploads/2019/04/gameofthronesbrienneknightinghistory.jpeg", "https://api.time.com/wp-content/uploads/2017/08/game-of-thrones-aftermath-poster.jpeg", "https://api.time.com/wp-content/uploads/2019/02/game-of-thrones-season-8-photos-01.jpg", "https://api.time.com/wp-content/uploads/2019/05/gameofthronesaryastarkseason8episode5.jpg", "https://api.time.com/wp-content/uploads/2019/04/game-of-thrones-s8-e3-jorah-daenerys.jpeg", "https://api.time.com/wp-content/uploads/2019/04/gameofthronesseason8episode1.jpg", "https://api.time.com/wp-content/uploads/2019/02/game-of-thrones-season-8-photos-05.jpg", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2017/08/gameofthronesseason8poster.jpg", "https://api.time.com/wp-content/uploads/2020/04/TheCircle.jpeg?quality=85&w=600", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2020/04/TIM200427_cover_Hope_USETHIS.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://api.time.com/wp-content/uploads/2019/05/gameofthronesdaenerysmadqueenseason8episode5.jpg?quality=85&w=1200&h=628&crop=1", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2019/05/gameofthronesdaenerysmadqueenseason8episode5.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Eliana Dockterman", "Megan Mccluskey", "Andrew R. Chow"], "canonical_link": "https://time.com/4913247/game-of-thrones-season-8-premiere-date/", "title": "Game of Thrones Season 8 Release Date: All The News So Far", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Game of Thrones season 8, game of thrones season 8 premiere date, when does game of thrones season 8 start, game of thrones season 8 air date, game of thrones season 8 trailer, season 8 leaks, season 8 script, season 8 filming, when does game of thrones season 8 start, when does game of thrones start", "news_keywords": "Game of Thrones season 8, game of thrones season 8 premiere date, when does game of thrones season 8 start, game of thrones season 8 air date, game of thrones season 8 trailer, season 8 leaks, season 8 script, season 8 filming, when does game of thrones season 8 start, when does game of thrones start", "description": "Get all the updates on when Game of Thrones Season 8 will air, how many episodes it will have and when new spinoffs will premiere.", "og": {"title": "Everything to Know About the Final Season of Game of Thrones", "type": "article", "site_name": "Time", "url": "https://time.com/4913247/game-of-thrones-season-8-premiere-date/", "description": "It's over. Here's your complete guide", "image": {"identifier": "https://api.time.com/wp-content/uploads/2019/05/gameofthronesdaenerysmadqueenseason8episode5.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/4913247/game-of-thrones-season-8-premiere-date/", "description": "Get all the updates on when Game of Thrones Season 8 will air, how many episodes it will have and when new spinoffs will premiere.", "media": "https://api.time.com/wp-content/uploads/2019/05/gameofthronesdaenerysmadqueenseason8episode5.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/4913247/game-of-thrones-season-8-premiere-date/", "title": "Everything to Know About the Final Season of Game of Thrones", "description": "It's over. Here's your complete guide", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2019/05/gameofthronesdaenerysmadqueenseason8episode5.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": ["https://www.youtube.com/embed/rlR4PJn8b8I", "https://www.youtube.com/embed/kuLUyJdRvSU", "https://www.youtube.com/embed/p2E30wWcBjY", "https://www.youtube.com/embed/vwmAWOE5F9o"], "publish_date": null, "source": "http://time.com", "summary": ""}