{"url": "www.washingtonpost.com/news/arts-and-entertainment/wp/2017/09/27/keeping-up-with-the-kardashian-pregnancy-rumors-a-timeline/", "text": "Even as the “Keeping Up With the Kardashians” special aired, a chyron scrolled by on the bottom of the screen reading: “KYLIE JENNER IS PREGNANT: REPORTS.”\n\nThat story line alone would have been enough to heighten the world’s attention on the family: Pregnancy is a hot commodity for celebrity news coverage; Kylie is just 20; and she’s only been linked to her current boyfriend for about six months. But the scrutiny amped up considerably as other pregnancy-related stories hit the tabloids.\n\nAD\n\nNone of the famous sisters has actually confirmed, on the record, that they are expecting. Still, the stories are breaking and it can be hard to get a handle on them all. Here’s a rundown:\n\nAD\n\nKim Kardashian surrogacy rumors (summer 2017)\n\nThis was the first peg in the pregnancy saga. TMZ ran a story in June that Kim and husband Kanye West had hired a surrogate to carry their third child, including some juicy details as to how much they were paying.\n\nThen in July, Us Weekly ran a story that the surrogate was three months pregnant and expecting in November.\n\nBut, in an August Hollywood Reporter cover story, the outlet wrote that “on the possibility of a third child, reportedly via a surrogate,” Kim said: “I hope so. There have been a lot of things said and Kanye and I have not confirmed anything. We’re definitely trying. We are hoping so.”\n\nAD\n\nOn Thursday, Kim tweeted the trailer for the upcoming season of her family’s reality show — in which she confirms that she’s having another baby. “What happens every time I say, ‘Guess what?’ ” Kim says to Khloé over FaceTime. “You’re pregnant — or the person’s pregnant,” her sister responds.\n\nAD\n\n“We’re having a baby!” Kim says.\n\nSeason 14 is gonna be wild. Tune in this Sunday!!! #KUWTK pic.twitter.com/rnpIdGiNyK — Kim Kardashian West (@KimKardashian) September 28, 2017\n\nThat Kim may have hired a surrogate at all wasn’t surprising to begin with; she’s been public about her prior difficult pregnancies with North and Saint, and the life-threatening conditions she endured while carrying them.\n\nKylie Jenner, allegedly pregnant (starting Sept. 22)\n\nTMZ dropped the bombshell Friday: The youngest of the Kardashian-Jenner brood is pregnant, and the father is Travis Scott. The two have been romantically linked since April.\n\nAD\n\nBut Kylie herself has not confirmed the reports. Neither have her family members — sort of.\n\nHollywood Life cited an individual close to Caitlyn Jenner as saying she was “shocked and disappointed” to hear her 20-year-old daughter was pregnant. Then, in a non-denial denial, the British tabloid the Sun wrote: “Speaking about claims Caitlyn wasn’t personally told her youngest daughter is pregnant, the Olympian’s rep confirmed she was told and said: ‘All I can tell you is that it was some time ago.’”\n\nAD\n\nWhat about Kris Jenner? During “Live With Kelly and Ryan,” Ryan Seacrest read a text from the momager herself. “Kris says Kylie’s not confirming anything,” Seacrest said on air. “That’s the news from the family this morning. Kylie is not confirming anything.”\n\nAD\n\nKris also talked to the Cut at the Bottega Veneta fashion show, and the matriarch offered frustratingly few details:\n\nDid you know the news was going to break about Kylie? I just woke up this morning. She’s not confirmed anything. I think it’s kind of wild that everyone is just assuming that that’s just happening. So, you didn’t know that rumor was going to happen? Something happens every single day. You never know what is going to break at any moment.\n\nEven Kylie herself posted throwback, flat-tummy photos on social media — along with a more recent one offering an inconclusive peek at her stomach.\n\nThen came the gossip about how the rest of the family was taking it.\n\n“Kim Kardashian’s first reaction to Kylie’s pregnancy news was reportedly not great,” read a Harpers Bazaar headline. Kim tweeted it adding:\n\nThis sounds like a very fake story... https://t.co/ZIxCltgK6d — Kim Kardashian West (@KimKardashian) September 26, 2017\n\nPeople cited an individual saying it was the family’s “nightmare” that Kylie would get pregnant with her ex-boyfriend Tyga. (And in case you need a catch-up: Tyga, who dated Kylie Jenner for years, shares a child with Blac Chyna, who then went on to have a daughter with Rob Kardashian. The Blac Chyna-Rob Kardashian romance was short-lived, filmed on a sad reality TV show; it led to a public meltdown and a restraining order.)\n\nAD\n\nAD\n\nKhloe Kardashian, also apparently expecting! (Sept. 26)\n\nOn Tuesday, TMZ, E! and BuzzFeed all cited anonymous individuals in reporting that the 33-year-old younger sister of Kourtney and Kim is pregnant, and her boyfriend, Cleveland Cavaliers player Tristan Thompson, is the father.\n\nAccording to TMZ, Khloe is three months along. Let the clue hunting begin.\n\nKhloe said she was drinking champagne during the family’s 10th anniversary special, which was pretaped. She also talked about Thompson: “Yeah, it’s a serious relationship.”\n\nShe also said she’s always in Cleveland whenever he is. Days before the anonymously cited reports about her pregnancy broke, she posted this bare-belly photo, prompting a lot of curious fans to wonder if she was actually three months along. (Yes, we’ve approached Zapruder film-level analysis here.)\n\nAD\n\nAD\n\nThe June season finale of KUWTK included a story line in which Khloe explored whether to serve as a surrogate for Kim. A fertility specialist delivered not-great news to Khloe, and suggested she stop taking birth control pills.\n\nKhloe did just that, and when she received an update that her chances of conceiving had improved, she called Thompson.\n\n“I am so relieved to know that I am able to get pregnant,” Khloe said on air. “Now I have so many other things to think about. Do I wanna have my own baby now? I don’t know. I’m at a crossroads.”\n\nShe continued: “Tristan and I definitely talk about starting a family. He wants to have about five or six kids with me and that’s lovely. We could start at one and we could grow from there. But now knowing I’m not on birth control is scary. It’s like a really big step.”\n\nAD\n\nAD\n\nThe conspiracy theories (from the beginning until forever)\n\nThe convergence of these three story lines has led to this:\n\n“All the Evidence That Khloe Kardashian Is Kim’s Surrogate,” reads a Marie Claire headline.\n\n“Is Pregnant Kylie Jenner Secretly Kim Kardashian’s Surrogate? An Investigation,” proclaims the Daily Beast.\n\nWhat if the twist in the alleged Kylie Jenner pregnancy is that she's Kim and Kanye's surrogate for baby no. 3? pic.twitter.com/RI8CG18Qvz — David Onda (@David_Onda) September 22, 2017\n\nRegardless of whether there’s any truth to these avalanche of rumors, one thing’s certain: People will keep watching the family on TV, keep scouring social media for clues and will keep keeping up.", "images": ["https://www.washingtonpost.com/resizer/xm6vEblUTbTKfG5NVcQPNy5MlPw=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QUIVT4GB5YZUXMXQE4VYS647IE.JPG", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/5bd13033-50c2-4ef3-a231-2f9d3ef43dcc.png&w=90&h=90", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QUIVT4GB5YZUXMXQE4VYS647IE.JPG&w=150"], "top_img": "https://www.washingtonpost.com/resizer/xm6vEblUTbTKfG5NVcQPNy5MlPw=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QUIVT4GB5YZUXMXQE4VYS647IE.JPG", "keywords": [], "authors": ["Elahe Izadi", "Pop Culture Writer"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/09/27/keeping-up-with-the-kardashian-pregnancy-rumors-a-timeline/", "title": "Keeping up with the Kardashian pregnancy rumors: A timeline", "meta_data": {"description": "Who is Kim Kardashian's surrogate? Is Kylie Jenner pregnant? What about Khloe Kardashian?", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/09/27/keeping-up-with-the-kardashian-pregnancy-rumors-a-timeline/", "image": "https://www.washingtonpost.com/resizer/xm6vEblUTbTKfG5NVcQPNy5MlPw=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QUIVT4GB5YZUXMXQE4VYS647IE.JPG", "title": "Keeping up with the Kardashian pregnancy rumors: A timeline", "description": "Who is Kim Kardashian's surrogate? Is Kylie Jenner pregnant? What about Khloe Kardashian?"}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Keeping up with the Kardashian pregnancy rumors: A timeline", "description": "Who is Kim Kardashian's surrogate? Is Kylie Jenner pregnant? What about Khloe Kardashian?"}, "last_updated_date": "2018-02-26T00:36:26.307Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1506441600.0, "source": "http://www.washingtonpost.com", "summary": ""}