{"url": "www.romper.com/p/is-beyonce-at-the-2018-grammys-twitter-is-searching-for-the-star-8041861", "text": "As celebs head to the red carpet for the 2018 Grammys, fans are looking for their favorite celebs, but there's one mega star who hasn't appeared yet. Now many are wondering is Beyoncé at the 2018 Grammys?\n\nUpdate: Later in the show, Beyoncé did appear to be at the Grammy Awards. She was pictured alongside her daughter Blue Ivy, and husband JAY-Z.\n\nEarlier: Beyoncé received a nomination this year for her collab with her husband, Jay-Z on his song \"Family Feud,\" and Jay was nominated for a total of eight award this year, including the highly coveted Album of the Year award. Thus, it makes sense that Queen B would be in attendance to support her man. She was even at Clive Davis' annual pre-Grammys gala last night. So where is she tonight? Fans are desperate for answers.\n\nThankfully, Jay-Z has walked the red carpet yet either, so it's most likely that the duo are just planning some form of a grand entrance. Or they're just running late. Either way, it'd be shocking if Beyoncé and Jay-Z didn't show, especially because Jay-Z received the most Grammy nominations this year. Why wouldn't he wanted to come and celebrate such a big night?\n\nStill, all these facts hasn't made the Beyhive feel anymore assured. Beyoncé fans (or stans, really) are losing it wondering when she'll arrive and what she'll be wearing. Last year, Beyoncé stunned the crowd with her gorgeous red dress that beautifully showed off her pregnancy bump. Now fans are excited to see how she'll wow the crowd this year.\n\nAdditionally, some are questioning if the Carters will bring their eldest daughter, Blue Ivy, with them to the awards ceremony this year like they did last year. At the 2017 Grammys Blue wore a Prince inspired ensemble in honor of the late singer who passed away in April 2016. However, now that Blue has two younger siblings, Rumi and Sir, perhaps her parents decided to leave all the kids at home this year.\n\nWhether or not Beyoncé and Jay-Z show up, with or without Blue Ivy, most fans are just anxious to see if Jay-Z actually wins album of the year for 4:44. Many fans are conflicted on the subject, especially because Beyoncé didn't win last year for Lemonade. Some have argued that Jay-Z should win Album of the Year for telling his side of the story when Beyoncé didn't win for telling hers. That being said almost everyone can agree 4:44 was a phenomenal album and really, isn't a win for Jay-Z kind of win for Beyoncé too. She is on the album, after all.\n\nStill, Jay-Z is going up against some tough competition. Also nominated for Album of the Year is Awaken, My Love! by Childish Gambino, DAMN. by Kendrick Lamar, Melodrama by Lorde, and 24K Magic by Bruno Mars. This year's nominees are the most diverse in Grammys history and it's the first time and white man wasn't nominated in the category. Thus, no matter who wins this is still quite a groundbreaking year. That being said many are still rooting for Jay-Z to take home the award at the end of the night.\n\nRegardless of who wins, it's still a historic list of nominees this year and it'll be exciting to see it all plays out. For now though, many are just keeping an eye out for Beyoncé and Jay. No matter how many awards Jay-Z leaves with tonight, the Beyhive is confident Beyoncé will be walking away with the Best Dressed honor. Now if only she'd finally bless us and show us what she's wearing. Hopefully, she make fans wait too much longer.\n\nCheck out Romper's new video series, Romper's Doula Diaries:\n\nWatch full episodes of Romper's Doula Diaries on Facebook Watch.", "images": ["https://imgix.bustle.com/uploads/image/2020/4/9/68c997a3-93e3-41e2-b6de-0f2dc95adf2c-screen-shot-2020-04-09-at-13106-pm.png?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/1/29/0985d132-bb74-45eb-8e27-d05d3efd194c-getty-911221420.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/6/2b4b42d3-4475-4d32-af08-89bbe2575aa3-getty-1200433192.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/6/15155e54-1e2c-439c-870e-2ae9587ae2e8-getty-1169525359.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/1/29/0985d132-bb74-45eb-8e27-d05d3efd194c-getty-911221420.jpg?w=960&h=540&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=932972280084675&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/1/29/0985d132-bb74-45eb-8e27-d05d3efd194c-getty-911221420.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.romper.com/p/is-beyonce-at-the-2018-grammys-twitter-is-searching-for-the-star-8041861", "title": "Is Beyonce At The 2018 Grammys? Twitter Is Searching For The Star", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@romper", "card": "summary_large_image"}, "og": {"site_name": "Romper", "url": "https://www.romper.com/p/is-beyonce-at-the-2018-grammys-twitter-is-searching-for-the-star-8041861", "type": "article", "title": "Twitter Is Frantically Searching For Beyonce At The Grammys", "description": "As celebs head to the red carpet for the 2018 Grammys, fans are looking for their favorite celebs, but there's one mega star who hasn't appeared yet. Now many are wondering is Beyoncé at the 2018 Grammys?\nUpdate: Later in the show, Beyoncé did…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/1/29/0985d132-bb74-45eb-8e27-d05d3efd194c-getty-911221420.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 510210782483125}, "description": "As celebs head to the red carpet for the 2018 Grammys, fans are looking for their favorite celebs, but there's one mega star who hasn't appeared yet. Now many are wondering is Beyoncé at the 2018 Grammys?\nUpdate: Later in the show, Beyoncé did…"}, "movies": [], "publish_date": null, "source": "http://www.romper.com", "summary": ""}