{"url": "https://en.wikipedia.org/wiki/Adamari_L%C3%B3pez", "text": "Puerto Rican actress\n\nLópez and the second or maternal family name is Torres. This article uses Spanish naming customs : the first or paternal family name isand the second or maternal family name is\n\nAdamari López Torres (born May 18, 1971) is a Puerto Rican actress known for participating in several Puerto Rican and Mexican soap operas. She is currently a host on the Telemundo morning show Un Nuevo Día and is a Latina ambassador for WW, formerly Weight Watchers.\n\nEarly career [ edit ]\n\nThe daughter of an undertaker, Luis López, Adamari started her career at the age of six in the Telemundo Canal 2 production of the Cristina Bazán soap opera, alongside legendary Puerto Rican actress Johanna Rosaly and Venezuelan singer José Luis Rodríguez, El Puma.\n\nHer talent indicated a future superstar. WAPA-TV next chose her to play Iris Chacón and Daniel Guerrero's daughter in Yo sé que mentía. She was a child actress playing an important supporting role in the story, thus became a household name.[2]\n\nA short, two chapter appearance on Vivir Para Ti followed in 1983, and after that, López decided to dedicate herself to her studies. She holds a B.A. in Communications from the University of the Sacred Heart\n\nAdulthood and fame [ edit ]\n\nAfter reaching the age of maturity, she came back, participating in several plays at Puerto Rico's Teatro Tapia, San Juan's premier and oldest theater, and getting the attention of Mexican producers.\n\nShe traveled to Mexico next, after the invitation by the producers to try out there, and became a superstar in that country as well, working in many top soap operas, including Camila and the national super hit Amigas y Rivales. López also participated in Mujer, Casos de la Vida Real, where she played a victim of rape that later turned lesbian.\n\nRecent years [ edit ]\n\nIn 2004, López participated in the soap opera Mujer de Madera. During the recording of that soap opera, her father, Luis, a respected and successful undertaker, suffered a heart attack and had to be hospitalized and operated on. López was given immediate permission to travel to Puerto Rico and be with her father for as long as she needed. Her father recovered, but with only five percent of his heart working. López had to return to Mexico after her father was released from the hospital, but she flew back to Puerto Rico every time that the filming schedule allowed her to. In 2011, she participated in the second season of Univision's dancing show Mira Quien Baila where she was one of the top dancers and won the competition.\n\nPersonal life and relationships [ edit ]\n\nLópez was the wife of fellow Puerto Rican singing super star Luis Fonsi. In 2006, López and Fonsi announced they would be getting married during the summer of that year. They were married on June 3, 2006 in Puerto Rico. On November 8, 2009, Adamari López and Luis Fonsi released a joint statement where they announced they were separating. They were divorced on November 8, 2010. In January 2013 López published a tell-all book, Viviendo.[3] She met Toni Costa while participating in a dance contest called Mira Quién Baila (Look whos' dancing) and on September 20, 2014, announced that she was expecting her first child with him, who was now her fiancé.[4] She gave birth to a girl, Alaïa, on March 4, 2015.[5] In 2019 she and Toni celebrated 8 years together, as a couple.[6]\n\nHealth [ edit ]\n\nOn March 22, 2005, López held a press conference in San Juan announcing she had been diagnosed with breast cancer. Her then-boyfriend, Luis Fonsi, announced at the same press conference that he was cancelling his 2005 international tour to be by her side. She was expected to recover, as her cancer was caught at \"stage 1,\" which is a very early stage, and it had not spread to other areas of her body.\n\nShe underwent cancer surgery. In 2006, it was reported that she is in remission. Since being diagnosed, she has campaigned for breast cancer awareness.[7]\n\nIn 2020, López was a Weight Watchers ambassador.[8][9]. Oprah Winfrey welcomed her into the WW community[10] during her 2020 Vision: Your Life in Focus tour in Fort Lauderdale, Florida.\n\nFilmography [ edit ]\n\nTelenovelas [ edit ]\n\nSee also [ edit ]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Adamari_L%C3%B3pez", "title": "Adamari López", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}