{"url": "https://www.womenshealthmag.com/weight-loss/a19905341/lauren-hennessey-success-story/", "text": "Before: 275\n\nAfter: 225\n\nI was always bigger growing up, but in 2005, I went on a family trip to Hawaii to celebrate my birthday and my parents’ anniversary. On the last day of that trip, my father was killed in a drowning accident. We were a very tight-knit family and had just moved here from overseas, so it was crushing for us all to lose him. From that point on, I went from living an active lifestyle to living one centered around food. I used eating as a coping mechanism for everything—celebrations where I wished my dad was there and all the low moments when I missed him most. I filled the void with food and starting piling on the weight.\n\nTHE CHANGE\n\nLauren Hennessey\n\nEven as I got engaged a year ago, I found myself celebrating by constantly eating. As my fiancé and I began discussing our future and thinking about kids, we decided to go to the doctor to discuss family planning. During that visit, my doctor told me that if I continued my current lifestyle, I’d struggle to have children. That’s when I knew it was time to turn this around and lose weight in order to be healthy and present for my future kids.\n\nI began researching diet trends online when I came across an advertisement for Khloe Kardashian’s show, \"Revenge Body.\" I figured I had nothing to lose and spent the next two hours filling out the application. Within 45 minutes of submitting my application, I got a call from a producer.\n\nTry Khloe Kardashian's Revenge Body workout for yourself:\n\n​\n\nTHE FOOD\n\nLauren Hennessey\n\nThere was no prep work leading up to the show; producers told me to maintain my current weight and habits until we began filming on March 14, 2016. I knew the premise of the show would have me paired up with a celebrity trainer and I was ecstatic when I learned I would be working with Jorge Cruise. My first assignment on day one was to read his book, . After that, we started making changes fast.\n\nJorge’s weekly meal plans completely turned my world upside down. What I loved most about the program was how he took the foods I love and made them better for me. For example, I’m a big fan of pizza, so Jorge showed me how to make it at home with a whole-wheat tortilla instead of a large, heavy crust, and with low-fat cheese. I also love pasta, so we switched that to zoodles, which I love. Because we were making such small changes, I never felt deprived. Everything I ate was full of flavor and left me satisfied. By June of that same year, I was down 50 pounds.\n\nSince going off the show, I’ve been able to stick to the principles I learned from Jorge (and keep the pounds off!) for a year. A typical day of eating for me starts at breakfast with oatmeal with a splash of almond milk, bananas, and strawberries. After that, I have a protein shake that keeps me full until lunchtime. Lunch is usually my favorite, a chicken Caesar salad. Between lunch and dinner, I may have a snack like a cup of popcorn or celery with peanut butter. I like to mix up my snacks to keep things interesting. Dinner is often that pizza, zoodles, or some other combination of protein and veggies. For dessert, I like to make “ice cream” that’s basically blended frozen fruits with a bit of heavy cream added. I’ll also have a frozen Greek yogurt with raspberries.\n\nWhat’s made this new diet so maintainable is the fact that I don’t ever feel the need to cheat. I’m happy and satisfied with my meals and that’s what prevents me from going out and grabbing a greasy burger.\n\n(Get tons of great workout ideas that will help you maintain a fit, healthy lifestyle for GOOD with The Women's Health Fitness Fix.)\n\nTHE WORKOUTS\n\nLauren Hennessey\n\nOn the show, I worked out with Jorge five days a week before work for an hour. I woke up every morning at 3:45 a.m. in order to get to the training facility by 5 a.m. It was grueling, but totally worth it. During production, Monday, Wednesday, and Friday were dedicated to high-intensity interval training (HIIT) workouts using bodyweight movements. Thursdays and Fridays were regular cardio sessions with a bit of weight training. My favorite workout that Jorge introduced to me is HIIT yoga, which utilizes breathing and rapid flow for a great workout. It keeps me balanced.\n\nNow, I generally stick to the same routine, except I work out in the gym four days during the week and hit hot yoga once a weekend.\n\nSTICKING WITH IT\n\nLauren Hennessey\n\nI used as my guide for nutrition and workouts, and having that as a resource has been a great help. Jorge’s new book, , emphasizes two of my major motivators. The first is to be perfectly you. By that I mean I now realize it’s okay to not be perfect and the best I can do is be myself. Rather than put all that pressure on myself, I’m free to enjoy life. The second key is to not hold your breath. I always wanted results and would give up if I didn’t see them. But by staying focused and determined and being okay with the process, I finally made progress.\n\nTHE REWARD\n\nLauren Hennessey\n\nThis weight loss has changed me completely. I’m the same person but I'm much happier. Everyone I know says there’s a brighter light within me now. For me, it was never about getting skinny, but about being healthy enough to start a family. I stand by that and say healthy is the new skinny. Although, I will say it’s fun being able to step into any store now and try on something that fits fantastically.\n\nMY NUMBER-ONE TIP\n\nLauren Hennessey\n\nYou have to reconcile with the fact that transitioning to a healthy lifestyle is a roller coaster, but it’s worth it. If you plateau or feel stuck, don’t just give up. Take this from someone who used to want instant change. If you stumble or fall, just get right back up and keep going.", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/766/7-20-wls-main-1515511021.jpg?crop=1xw:0.786xh;center,top&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/766/7-20-wls-main-1515511021.jpg?crop=1xw:0.786xh;center,top&resize=1200:*", "keywords": [], "authors": ["Lauren Hennessey As Told To Alexandria Gomez"], "canonical_link": "https://www.womenshealthmag.com/weight-loss/a19905341/lauren-hennessey-success-story/", "title": "​'Khloe Kardashian's \"Revenge Body\" Helped Me Lose 50 Pounds—But This Is How I Kept It Off'", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Women's Health", "title": "​'Khloe Kardashian's \"Revenge Body\" Helped Me Lose 50 Pounds—But This Is How I Kept It Off'", "description": "​Lauren Hennessey says the show gave her all the necessary tools to maintain her weight loss.", "url": "https://www.womenshealthmag.com/weight-loss/a19905341/lauren-hennessey-success-story/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/766/7-20-wls-main-1515511021.jpg?crop=1xw:0.786xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 223993857646230}, "article": {"publisher": "https://www.facebook.com/womenshealthmagazine/", "modified_time": "2019-10-22 07:49:47", "published_time": "2018-01-02 03:44:48", "section": "Weight Loss", "opinion": "false"}, "twitter": {"site": "@WomensHealthMag", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/766/7-20-wls-main-1515511021.jpg?crop=1xw:0.786xh;center,top&resize=640:*"}, "google-site-verification": "mJMUXwyIdtxgKFgxuJIMK0pLRtYTrhduC6K_LFpAP8Y", "title": "​'Khloe Kardashian's \"Revenge Body\" Helped Me Lose 50 Pounds—But This Is How I Kept It Off' | Women's Health", "description": "​​Lauren Hennessey says the show gave her all the necessary tools to maintain her weight loss.", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/766/7-20-wls-main-1515511021.jpg?crop=0.636xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Weight Loss,weight-loss,success stories", "sailthru.date": "2018-01-02T15:44:48Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/766/7-20-wls-main-1515511021.jpg?crop=1xw:0.786xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/766/7-20-wls-main-1515511021.jpg?crop=0.636xw:1xh;center,top", "sailthru.socialtitle": "​'Khloe Kardashian's \"Revenge Body\" Helped Me Lose 50 Pounds—But This Is How I Kept It Off'", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1514835888.0, "source": "https://www.womenshealthmag.com", "summary": ""}