{"url": "www.news.com.au/entertainment/celebrity-life/royals/meghan-markle-just-waiting-for-the-next-bombshell/news-story/13f31fbddf0234ef0490c1f5e1739724", "text": "MEGHAN Markle is putting on a brave face as she is harassed by members of her own family, and is living with the constant threat they will say something destructive about her, says a royal biographer.\n\nThe Duchess of Sussex not only has to deal with the pressures of being one of the most famous women in the world, she must do so while deflecting the worsening behaviour of close family.\n\nIt seems they will continue to stalk her by speaking out against her — and her royal in-laws — until they get what they want. Things have gotten so bad that palace aides have reportedly had three top-level crisis meetings about how to deal with her family, particularly her father.\n\nIn his latest tirade, Thomas Markle claimed Meghan changed her phone number and was sending him “mixed messages”, dismissed the royals as a “Monty Python sketch” and accused his daughter of having a “sense of superiority”.\n\nHe suggested it would be better for Meghan if he died, and that Princess Diana would be disgusted with how he was being treated.\n\nMeghan is said to be “deeply hurt and embarrassed” that he mentioned the Princess of Wales, and remains angry over his television interview where he discussed private conversations between himself and Prince Harry.\n\nMost damaging in his recent interview were the comments about the monarchy itself, which he called an “ancient institution, stuck in its ways”.\n\nVeteran royal watcher Phil Dampier, author of Royally Suited: Harry and Meghan in their Own Words, told news.com.au: “Harry and Meghan have tried ignoring the Markles, but it’s not working. Before things get even more embarrassing for the royal family, they must try to build bridges.\n\n“Ideally, they should go out and see Thomas or invite him over to London. It is incredible that Harry still hasn’t met his father-in-law. At the very least, a senior courtier should go out and placate him first.”\n\nDampier said the problem stemmed from poor Palace judgement from the start. “They should have gone out and befriended Thomas and his children long before the wedding. This is now hurting the monarchy and I wouldn’t be surprised if behind the scenes the Queen is starting to bang a few heads together.”\n\nSources told Britain’s Daily Mirror Meghan now had three options — speak to him directly and ask him to stop, get an intermediary to meet with him, or cut him off for good in a desperate hope he will stop. “This could be the final straw for Thomas. A line has been crossed.”\n\nRoyal commentator Angela Levin, author of new Prince Harry biography Harry: Conversations With The Prince, told news.com.au Meghan would be putting on a brave front, but would be troubled by her father’s antics — and on edge at what could be coming next.\n\n“It must be desperately upsetting to Meghan, who I think is a very good actor at putting on a good face, but she must be very hurt.\n\n“She was very close to her father and she did want him to walk her down the aisle. For him to do that has made her speechless psychologically and physically — she can’t say anything to him now.”\n\nLevin said the Duchess of Sussex would not be able to speak to her dad about plans to have a baby or things she has discussed with Prince Harry.\n\n“I think his duty is to think of her, that’s a parental duty. If you want to have a good relationship with your children, you have to behave properly yourself … to talk about Harry’s private conversations about President Trump and Brexit was very wrong.”\n\nThe situation is now so bad that in many ways, Meghan has been left “bereft of a parent” — and the constant waiting game for a new story to appear could take its toll in the long run, Levin said.\n\n“I suspect she will feel very self-conscious with the royal family. It’s difficult to know how to manage being a senior royal so she must feel very awkward.”\n\nPrince Harry would be sympathetic after all the drama and embarrassment his own parents put him through when he was a young boy.\n\nBut Levin does not believe the Markles are going to stop.\n\n“I think it will be an ongoing issue … the half-brother and sister seem to imagine the nastier they are about her, the more likely she will come back and be a part of their family. But it doesn’t work like that, does it?”\n\nIt is also set to be a massive distraction for Meghan as she works to find her place in the royal family and achieve her goals.\n\n“I don’t know her sufficiently to know now if she can put things right out of her mind, but even if she does, (the thoughts) can come at night, can’t they — at four in the morning and you think ‘not again’. Also, if you have a few things you don’t want the public to know about, will he say that?”\n\nRumours that her half-sister Samantha Markle is to be a Celebrity Big Brother housemate will just fuel the controversy.\n\n“I think they will spout at every possible occasion and if Samantha goes into Celebrity Big Brother then goodness knows what she will say.”\n\nLevin thought part of the problem lay with royal aides who failed to bring Thomas Markle into the fold and under control before the wedding.\n\nIngrid Seward, editor-in-chief of Majesty magazine, agreed. She wrote in the Mail On Sunday it was a mistake not to visit her father with Harry before their engagement. And she warned the complicated situation needed to be urgently brought under control.\n\n“Most people understand how difficult families can be, but in her public position Meghan has to be seen to care, or else her hard-earned reputation could be tainted forever, and no one would wish that on her,” Seward wrote.\n\nSamantha Markle has, at various times, slammed Meghan for not doing enough to look after their father, and even suggested she would be responsible if he died.\n\nIn a series of extraordinary tweets, she even labelled Prince Harry a “wuss” and called Meghan the “Duchess of Nonsense”. She even lashed out at Meghan’s mother, Doria Ragland, who she accused of “cashing in” on the wedding by planning an interview with Oprah Winfrey.\n\nAt the weekend, she returned to the public eye in an interview with The Sunday Mirror, where she said she feared their father would die of sadness without speaking to his royal daughter again.\n\n“I’m desperate for Meghan to meet up with Dad when she’s back. If she doesn’t, it would be really cruel and break his heart forever,” she said.\n\n“If they don’t, I’m worried he’ll die of sadness. I just want her to get in touch before it’s too late. Life’s short — neither of them deserves to be left with the consequences.”\n\nShe said he was even thinking of travelling to the UK, unannounced, to try to see her.\n\nStephen Bates, a former royal correspondent and the author of Royalty Inc, said Mr Markle’s arrival could be “vaguely embarrassing for Meghan”.\n\n“Many of us have slightly embarrassing relatives and I am guessing that people here will be fairly indifferent … He has really become a tabloid figure of fun.”\n\nBates didn’t think it would rock Meghan’s marriage or the monarchy.\n\n“Far from being silenced by the royals, I suspect she’s not reacting on the basis of ‘least said, soonest mended’, rather than getting into a public soap opera-type spat.”\n\nHe said she and Prince Harry had already publicly advised they intended to meet Mr Markle when they visited the United States.\n\nandrew.koubaridis@news.com.au", "images": ["https://cdn.newsapi.com.au/image/v1/31bff67c6a939eac32fc1b2937b4f3f2", "https://i1.wp.com/pixel.tcog.cp1.news.com.au/track/component/author/8e7e004cc5b76810fab3933e892fbffa?t_product=newscomau&t_template=s3/ncatemp/authorBlock@2.0.0", "https://i1.wp.com/pixel.tcog.cp1.news.com.au/track/component/resource/networksales/exoduscampaigns/campaigns.json?esi=true&t_product=newscomau&t_template=s3/networksales-loader/index&td_channel=desktop&td_domain=news.com.au&td_pagetype=story&td_section=entertainment/celebrity-life/royals", "https://content.api.news/v3/images/bin/97075dfb4de14cf9189a176944dc9604", "https://www.news.com.au/wp-content/themes/vip/newscorpau-nca/assets/dist/img/common/headshots/andrew-koubaridis.png?v=4", "https://i1.wp.com/pixel.tcog.cp1.news.com.au/track/spp-api/v1/template/?path=components.nav-primary&t_domain=news.com.au&t_product=newscomau", "https://cdn.newsapi.com.au/image/v1/6c41f2a19c57c9e1ee62065c666f4fa3", "https://cdn.newsapi.com.au/image/v1/1ff027438c6849898f93afff329a34fd", "https://cdn.newsapi.com.au/image/v1/8c0361c4c16eb738741f8276b9b8d2f9", "https://cdn.newsapi.com.au/image/v1/8e3ecfb9c831bc764e40b97954873485", "https://i1.wp.com/pixel.tcog.cp1.news.com.au/track/news/content/v2?includeRelated=true&pageSize=8&query=(contentType:NEWS_STORY%2520AND%2520paidStatus:NON_PREMIUM%2520AND%2520domains:news.com.au%2520AND%2520categories.value:%2522%252Fdisplay%252Fnewscorpaustralia.com%252FWeb%252FNewsNetwork%252FEntertainment%2520-%2520syndicated%252FLife%252FRoyals%252F%2522)&t_product=newscomau&t_template=s3/ncatemp/standalone/readnext/more-in&td_module-header=celebrity+life&td_storyID=13f31fbddf0234ef0490c1f5e1739724", "https://i1.wp.com/pixel.tcog.cp1.news.com.au/track/chartbeat/live/toppages/v3/?esi=true&host=news.com.au&limit=5&section=entertainment&sort_by=internal&t_product=newscomau&t_template=s3/ncatemp/bodyandsoul/fragment/trending&td_heading=trending%2520in%2520entertainment&td_showcount=true&td_showimages=true&type=article", "https://i1.wp.com/pixel.tcog.cp1.news.com.au/track/component/article/c4d631c1e54a359f14b393b702889ad6?t_domain=news.com.au&t_product=newscomau&t_template=s3/ncatemp/bodyandsoul/fragment/thumbnail", "https://i1.wp.com/pixel.tcog.cp1.news.com.au/track/component/article/39f913e15c4402fb392766e6c932d403?t_domain=news.com.au&t_product=newscomau&t_template=s3/ncatemp/bodyandsoul/fragment/thumbnail", "https://i1.wp.com/pixel.tcog.cp1.news.com.au/track/component/article/a898aa938552dd3dadaefb1f2777d72a?t_domain=news.com.au&t_product=newscomau&t_template=s3/ncatemp/bodyandsoul/fragment/thumbnail", "https://i1.wp.com/pixel.tcog.cp1.news.com.au/track/spp-api/v1/template/?articleGMT=10&path=components.footer-desktop&t_domain=news.com.au&t_product=newscomau", "https://cdn.newsapi.com.au/image/v1/867e52eb4056e0e82685c5b644fd2bfc", "https://cdn.newsapi.com.au/image/v1/b060c19afb6b55fae091ba72dde0d089", "https://i1.wp.com/pixel.tcog.cp1.news.com.au/track/spp-api/v1/template/?path=components.header-desktop&t_domain=news.com.au&t_product=newscomau", "https://cdn.newsapi.com.au/image/v1/91b4838ffca843fa38cf605086fa6df8", "https://cdn.newsapi.com.au/image/v1/1ceb680747e448c7c74fe49aa85cbb3d", "https://cdn.newsapi.com.au/image/v1/de4036b35f3f43ec4e24ddac997741bb", "https://cdn.newsapi.com.au/image/v1/be701fd4abde38e56fa212398c084b56", "https://cdn.newsapi.com.au/image/v1/3e88beda9c8dface6cd84d08cbdc867a", "https://i1.wp.com/pixel.tcog.cp1.news.com.au/track/component/article/17e7e428f6cde48e306a666c0fe86f98?t_domain=news.com.au&t_product=newscomau&t_template=s3/ncatemp/bodyandsoul/fragment/thumbnail", "https://i1.wp.com/pixel.tcog.cp1.news.com.au/track/component/article/f8f3c04086f03f4a06886c4f64b8680c?t_domain=news.com.au&t_product=newscomau&t_template=s3/ncatemp/bodyandsoul/fragment/thumbnail", "https://cdn.newsapi.com.au/image/v1/832490f896338774a59abe229d226660", "https://cdn.newsapi.com.au/image/v1/f76659e2826b46d74a4c5cd6bd222921?width=650"], "top_img": "https://cdn.newsapi.com.au/image/v1/f76659e2826b46d74a4c5cd6bd222921?width=650", "keywords": [], "authors": ["Andrew Koubaridis", "Uk Correspondent"], "canonical_link": "https://www.news.com.au/entertainment/celebrity-life/royals/meghan-markle-just-waiting-for-the-next-bombshell/news-story/13f31fbddf0234ef0490c1f5e1739724", "title": "Meghan Markle and Prince Harry: Royal wedding started family feud", "meta_data": {"viewport": "width=device-width", "generator": "tcog", "articleid": "13f31fbddf0234ef0490c1f5e1739724", "article": {"published_time": "2018-07-30T08:37:00.000Z", "modified_time": "2018-08-02T08:35:17.000Z", "publisher": "News Limited", "author": "Andrew Koubaridis, UK Correspondent", "publicationdate": "02/08/2018"}, "description": "MEGHAN Markle is putting on a brave face as she is harassed by members of her own family, and is living with the constant threat they will say something destructive about her, says a royal biographer.", "keywords": "royal in-laws,ticking time bomb,public soap opera,soap opera type,famous women,ancient institution,Royal drama,royal daughter,United States of America,Northern America,North America,America,Royalty,Oprah Winfrey,Samantha Markle,Doria Ragland,Monty Python,Stephen Bates", "og": {"image": "https://cdn.newsapi.com.au/image/v1/f76659e2826b46d74a4c5cd6bd222921?width=650", "title": "Meghan’s constantly worries about what’s next?", "type": "article", "url": "https://www.news.com.au/entertainment/celebrity-life/royals/meghan-markle-just-waiting-for-the-next-bombshell/news-story/13f31fbddf0234ef0490c1f5e1739724", "site_name": "NewsComAu", "description": "MEGHAN Markle is putting on a brave face as she is harassed by members of her own family, and is living with the constant threat they will say something destructive about her, says a royal biographer."}, "fb": {"app_id": 113758722003364, "admins": "1533025129,653135158,737988273"}, "twitter": {"card": "summary_large_image", "site": "@newscomauHQ", "title": "Meghan’s constantly worries about what’s next?"}, "robots": "noarchive", "apple-mobile-web-app-title": "news.com.au", "msapplication-TileColor": "#ffffff", "theme-color": "#ffffff", "msapplication-TileImage": "https://resources.newscdn.com.au/cs/nca/latest/public/img/favicons/mstile-144x144.png", "msapplication-config": "https://resources.newscdn.com.au/cs/nca/latest/public/img/favicons/browserconfig.xml", "application-name": "news.com.au", "referrer": "origin", "google-site-verification": "GWTbDFKaKnGKyk3q0Na5jIbWHZ4qXn-ibcfMayjSQA0"}, "movies": [], "publish_date": 1532939820.0, "source": "http://www.news.com.au", "summary": ""}