{"url": "https://www.denofgeek.com/tv/29456/10-great-tv-shows-for-geek-parents-to-watch-with-their-kids", "text": "Adventure Time\n\nWhy kids love it: For very much the same reason that adults love it; Adventure Time is awesome. It may seem slightly out of place when listed with some of the shows on this list, and you may question how responsible it is to show it to a toddler, but it’s worth pointing out that I watched RoboCop at eight and I turned out Okay(ish). Adventure Time is the creation of Pendleton Ward and follows Finn the human and Jake the dog, who has magical powers as they find themselves in a series of, well, adventures in the land of Ooo. Brightly coloured, action-packed and very funny, Adventure Time is one of the finest animated shows around. Admittedly, it has lead to my two-and-a-half-year-old daughter saying “dude” a lot of late, but I can live with that.\n\nWhat’s in it for the grown ups? As if you’re not sold on this already. Okay, fine; again, it’s brilliant, hilarious and insane. Jake is possibly one of the most gifted but ultimately lazy heroes I’ve seen. Like a talking dog version of Bill Murray, there’s the strong sense that if Jake wasn’t spurring him on nothing would get done. It’s a show that will prove a hit with your child and one that you can watch and enjoy in a different way given that much of the humour is pitched at adults. It’s brilliant, buy everything.\n\nYo Gabba Gabba!\n\nWhy kids love it: As big a hit as many of the aforementioned shows have been with my daughter, if I had to pick one that she’s watched and enjoyed more than any other it would be Yo Gabba Gabba! Since before she was walking, the bright colours, characters and musical sequences captivated her and now she dances and sings along, which has been great to see. The brainchild of Christian Jacobs (Lead Singer of The Aquabats) and Scott Schultz who worked together as teens on skateboarding videos and after becoming fathers set out to make an entertaining kids show showcasing real artists and performers, and very much achieved that. Episodes move at a brisk pace and focus on particular themes as the inhabitants of Gabba Land (Brobee, Plex, Muno, Foofa, Toodee) under the guidance of DJ Lance Rock, learn life lessons and become better people through play, song and dance with the action being broken up with guest musical performances from some big names, short cartoons and 8-bit video game clips.\n\nWhat’s in it for the grown ups? When you become a parent there are a number of questions you have to ask; once you’ve got the big ones out of the way like name, breast or bottle-feed, re-useable or disposable nappies etc you soon get to arguably the biggest questions of all; do I want Devo’s Mark Mothersbaugh to be my child’s art teacher? And do I want Biz Markie to teach my kid how to beat box? The answer to both is obviously yes.", "images": ["https://secure.gravatar.com/avatar/?s=96&d=mm&r=g", "https://www.denofgeek.com/wp-content/uploads/2014/02/adventure_time_1.jpg?fit=640%2C380", "https://www.denofgeek.com/wp-content/uploads/2014/02/adventure_time_1.jpg?resize=640%2C380"], "top_img": "https://www.denofgeek.com/wp-content/uploads/2014/02/adventure_time_1.jpg?fit=640%2C380", "keywords": [], "authors": ["Glen Chapman", "James Stansfield", "Shamus Kelley", "Rosie Knight", "Nicole Hill", "Megan Crouse", "Daniel Kurland", "David Burszan"], "canonical_link": "https://www.denofgeek.com/tv/10-great-tv-shows-for-geek-parents-to-watch-with-their-kids/", "title": "10 great TV shows to enjoy with your kids", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#d23226", "description": "From Adventure Time to Old Jack's Boat, James and Glen talk us through ten modern kids' TV shows that geek parents can enjoy too...", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "10 great TV shows to enjoy with your kids | Den of Geek", "description": "From Adventure Time to Old Jack's Boat, James and Glen talk us through ten modern kids' TV shows that geek parents can enjoy too...", "url": "https://www.denofgeek.com/tv/10-great-tv-shows-for-geek-parents-to-watch-with-their-kids/", "site_name": "Den of Geek", "image": {"identifier": "https://www.denofgeek.com/wp-content/uploads/2014/02/adventure_time_1.jpg?fit=640%2C380", "secure_url": "https://www.denofgeek.com/wp-content/uploads/2014/02/adventure_time_1.jpg?fit=640%2C380", "width": 640, "height": 380}}, "article": {"tag": "James Stansfield", "section": "TV", "published_time": "2014-02-26T07:00:00+00:00"}, "twitter": {"card": "summary_large_image", "description": "From Adventure Time to Old Jack's Boat, James and Glen talk us through ten modern kids' TV shows that geek parents can enjoy too...", "title": "10 great TV shows to enjoy with your kids | Den of Geek", "image": "https://www.denofgeek.com/wp-content/uploads/2014/02/adventure_time_1.jpg?fit=640%2C380"}, "msapplication-TileImage": "https://www.denofgeek.com/wp-content/uploads/2020/02/favicon.geek_.purple.swirl_-1.png?fit=270%2C270"}, "movies": [], "publish_date": 1393398000.0, "source": "https://www.denofgeek.com", "summary": ""}