{"url": "https://en.wikipedia.org/wiki/East_Coast%E2%80%93West_Coast_hip_hop_rivalry", "text": "The East Coast–West Coast hip hop rivalry was a feud between artists and fans of the East Coast hip hop and West Coast hip hop scenes in the United States, especially from the mid-1990s.[1] Focal points of the feud were East Coast–based rapper The Notorious B.I.G. (and his New York–based label, Bad Boy Records), and West Coast–based rapper Tupac Shakur (and Suge Knight's Los Angeles–based label, Death Row Records, which he was part of), who were both murdered in drive-by shootings. Orlando Anderson (a.k.a. Baby Lane) has been accused of the murder of Shakur, but he himself was shot dead in the spring of 1998.[2] The person responsible for the murder of The Notorious B.I.G. remains unknown.\n\nRivalry [ edit ]\n\nTim Dog [ edit ]\n\nIn 1991, angry at record companies' rejections of East Coast artists and the growing popularity of West Coast hip hop, Bronx rapper Tim Dog decided to voice his anger on the notorious diss track \"Fuck Compton\". It contained shots at the LA rap scene, although he explicitly stated that he was \"cool with Ice-T\". The music video featured violent threats aimed at Eazy-E. There were several responses from numerous West Coast artists, including the \"Fuck wit Dre Day (And Everybody's Celebratin')\" which featured Snoop Doggy Dogg dissing Tim Dog (as well as Eazy-E and others), and a separate skit, \"$20 Sack Pyramid\". Both featured on Dr. Dre's The Chronic album. Compton's Most Wanted responded with \"Who's Fucking Who?\"\n\nBad Boy vs. Death Row [ edit ]\n\nSean \"Puff Daddy\" Combs\n\nIn 1993, fledgling A&R executive and record producer Sean \"Puff Daddy\" Combs founded the New York-centered hip-hop label, Bad Boy Records.[3][4] The next year, the label's debut releases by Brooklyn-based rapper The Notorious B.I.G. (also known as Biggie Smalls; born Christopher Wallace)[5] and Long Island–based rapper Craig Mack became immediate critical and commercial successes, and seemed to revitalize the East Coast hip-hop scene by 1995.[6] New York born and California-based rapper Tupac Shakur publicly accused The Notorious B.I.G., Andre Harrell, and Sean Combs of involvement in his shooting (and robbery) in the lobby of Quad Recording Studios in Manhattan on November 30, 1994.[7][8][9][10][10][11] Shortly after the shooting, \"Who Shot Ya?,\" a B-side track from Biggie's \"Big Poppa\" single was released. Although Combs and Wallace denied having anything to do with the shooting and stated that \"Who Shot Ya?\" had been recorded before the shooting,[12] 2Pac interpreted it as B.I.G.'s way of taunting him.[13][14].\n\nIn August 1995, Death Row CEO Suge Knight took a dig at Bad Boy and Combs at that year's Source Awards; announcing to the assembly of artists and industry figures: \"Any artist out there that want to be an artist and stay a star, and don't have to worry about the executive producer trying to be all in the videos ... All on the records ... dancing, come to Death Row! Which Suge Knight was referring to Puff Daddy on Being on Notorious BIG’s music videos.\"[15]\n\nIt was a direct reference to Combs' tendency of ad-libbing on his artists' songs and dancing in their videos.[16] With the ceremony being held in New York, to the audience, Knight's comments seemed a slight to the entire East Coast hip-hop scene, and resulted in boos from the crowd.[17]\n\nProblems continued when Knight later attended a party for producer Jermaine Dupri in Atlanta. During the bash, a close friend of Knight's (Jake Robles) was fatally shot.[18] Knight accused Combs (also in attendance) of having something to do with the shooting.[9][19][20] The same year, Knight posted the $1.4 million bail of the then-incarcerated 2Pac, in exchange for his signing with Death Row Records.[21] Shortly after the rapper's release for five counts of sexual abuse in October 1995, he proceeded to join Knight in furthering Death Row's feud with Bad Boy Records.[22]\n\nTha Dogg Pound's single \"New York, New York\", supported by a music video featuring a gigantic Snoop Dogg destroying various NYC buildings, was interpreted as a direct insult towards New York and the East Coast. Tha Dogg Pound was allegedly even shot at while making the video in New York City.\n\n2Pac vs. The Notorious B.I.G. [ edit ]\n\n\"Who Shot Ya?\"[22] C'mere c'mere ... open your fucking mouth ... Didn't I tell you not to fuck with me? ... Can't talk with a gun in your mouth huh? ... Bitch-ass nigga, what? - The Notorious B.I.G.\n\n\"Hit 'Em Up\" Who shot me? But ya punks didn't finish now you 'bout to feel the wrath of a menace nigga, I hit 'em up! - 2Pac\n\nAfter the release of \"Who Shot Ya?\", which Shakur interpreted as a diss song mocking his robbery/shooting,[23] 2Pac appeared on numerous tracks aiming threatening or antagonistic insults at Biggie, Bad Boy as a label, and anyone affiliated with them from late 1995 to 1996. Examples include the songs \"Against All Odds\", \"Bomb First (My Second Reply)\" and \"Hit 'Em Up\".[24][25] During this time the media became heavily involved and dubbed the rivalry a coastal rap war, reporting on it continually.[26][27] This caused fans from both scenes to take sides.[6]\n\nAnother song that was interpreted by Shakur around this time as a diss song was \"I Shot Ya (remix)\", a B-side by LL Cool J that was released on his Mr. Smith album in the year of 1995.[28] Sometime in the following year of 1996, Tupac Shakur confronted featured artist Keith Murray at the California House Of Blues, wanting to know if the record was a diss to him. Upon questioning, Murray made it clear that the record was not about Shakur, and has continued to reiterate this in several interviews over the following years.[29]\n\nAlthough an official retaliation record was never released by the Brooklyn MC in response to Shakur's slurs, a certain number of Biggie's lyrics were interpreted by listeners as subliminal shots aimed at Shakur, in particular the track \"Long Kiss Goodnight\", which Lil' Cease claimed was about 2Pac in an XXL interview. Puffy, however, steadfastly denied this theory, affirming that if Biggie were to diss 2Pac, he would have called him out by name.[30]\n\nOn September 7, 1996, Tupac Shakur was shot in a drive-by shooting at the intersection of Flamingo Road and Koval Lane in Las Vegas, Nevada.[31] He was taken to the University Medical Center of Southern Nevada, where he died six days later. In 2002, Chuck Phillips wrote the article \"Who Killed Tupac Shakur?\"[32] reporting that, \"the shooting was carried out by a Compton gang called the Southside Crips to avenge the beating of one of its members by Shakur a few hours earlier ... Orlando Anderson, the Crip whom Shakur had attacked, fired the fatal shots. Las Vegas police discounted Anderson as a suspect and interviewed him only once, briefly. He was later killed in an \"unrelated gang shooting\" nearly 2 years later on May 29, 1998. The Phillips article and its follow-up, \"How Vegas Police Probe Floundered in Tupac Shakur Case\"[33] also implicated East Coast rappers including Biggie Smalls.\n\nSix months after Tupac's death, on March 9, 1997, The Notorious B.I.G. was killed in a drive-by shooting by an unknown assailant in Los Angeles, California.\n\nHip-hop peace summits [ edit ]\n\nOn September 22, 1996, a peace summit was convened at Mosque Maryam by Louis Farrakhan in the wake of the murder of Tupac Shakur,[34] and another after the shooting of Biggie Smalls.[35][36] Minister Farrakhan continues these summits, which have been held since the 1980s,[37] where he calls for peace.[38][39][40]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/24px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Sean_Combs.jpg/161px-Sean_Combs.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/East_Coast%E2%80%93West_Coast_hip_hop_rivalry", "title": "East Coast–West Coast hip hop rivalry", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}