{"url": "https://www.bustle.com/p/is-chris-hemsworth-done-playing-thor-after-avengers-4-hes-had-such-mixed-feelings-about-the-role-9122256", "text": "The dust has finally begun to settle following the intense events of Avengers: Infinity War, leaving fans wondering about the future of Earth's Mightiest Heroes. With the next film the last he's officially signed up for, is Chris Hemsworth done playing Thor after Avengers 4, or will the God Of Thunder strike again in the Marvel Comic Universe?\n\nUnlike his brashly confident alter-ego, Hemsworth seems hesitant about picking up the hammer again. Though he's enjoyed working on the films so far, speaking with USA Today he confirmed, \"this is it. I’m done. I won’t be playing the character again.\" Yet moments later he admitted that he and Thor: Ragnarok director Taita Waititi had loads of fun tossing around potential ideas for a fourth Thor film. \"I felt like we re-invented [Thor]. There is a bigger platform now to continue if we want to.\"\n\nAnd yet it's that \"if\" that has fans holding their breath as to whether they'll see Hemsworth onscreen with the Marvel team again. Originally, the actor signed on for a total of four films, with the as-yet untitled Avengers 4 the last he's both contractually obliged to make and confirmed for. MCU mastermind Kevin Feige only adds to the uncertainty, playing coy in an interview with Observer. \"With Infinity War, it’s coming to a climax... and with Untitled Avengers a year later, bringing what will be that first 22 movie arc to a finality,\" Feige confirmed, before adding, \"those stories will continue. I think they’ll continue in surprisingly different and unexpected ways after these two Avengers films…”\n\nFeige is quick to knock the idea that finality equals death; if the storytelling's anything like the comics the Marvel films are based on, some characters bow off stage for a while, only to rejoin the fray when there's a compelling reason to bring them back. Continuing with floating thoughts about possibilities for Thor's future, Hemsworth told IGN that when he worked on his franchise's films, \"I was enjoying it but I was like... I felt a little restricted. And after this last experience with Taika, and actually these last two Avengers, I feel like we’ve reinvented the character a number of times...I definitely feel a renewed sense of excitement and enthusiasm, and more so than ever, I think.\"\n\nIt's a bummer that Hemsworth felt a renewed sense of fun about the franchise just as his contract was coming to an end, but at the same time the actor seems to be painfully aware of the stakes of signing up for another round of superhero action. \"I want to be able to take the kids to school. I may even be off all year,\" he said, speaking with The Times. \"My wife and I were talking the other day about how the years are flying by: our daughter is five and a half and the boys are three and a half, and however much time you do have together, it never seems like enough.\"\n\nStill, the lure of playing a god would be a lot to turn down for any mere mortal. In a recent Instagram post, Hemsworth thanked his fans directly in what sounded like a fond farewell. Instead of just shouting audiences out for making Avengers: Infinity War one of the biggest box-office smashes in recent history, the video also featured Hemsworth saying, \"Thank you so much, everyone who continues to support these characters and the Marvel Universe. We're going to keep trying to crank them out for you, if you let us.\"\n\nDoes that include himself as Thor, or is it a general nod to the entire Avengers team? It's unknown, but what's clear is that despite years of playing Thor, Hemsworth still seems unsure of how he feels about portraying the hero on-screen. The fact that the actor's films outside the Marvel Universe have done less than stellar at the box office makes the God of Thunder, for better or worse, the defining role of Hemsworth's career; it's a solid reason for him to have mixed feelings about taking on the role again.\n\nSo, it seems, whether fans will get to see Hemsworth as Thor again will depend on the kind of future Marvel filmmakers can come up with for the character, and if it's interesting enough for the actor to deem it worth picking up the hammer once more.", "images": ["https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2018/5/17/108c1a80-7f76-4d57-b2a7-60c915e02e26-avengers-infinity-wars.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/9/f58e3a36-05cb-4bbd-96f1-fd325efe6a6a-jk.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/3/99943db3-98ad-4042-b38f-ae81222aa490-4760f1ee6d7382e3cb38e88f2f0e730f22ed4a2be805d0f20e1dcfac5e38ac5703ead59ce6e6f4f1f2c0b00b5c40d34d.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/16/c046b701-5293-4a48-9511-754066590440-screenshot-588.png?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/5/17/108c1a80-7f76-4d57-b2a7-60c915e02e26-avengers-infinity-wars.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/15/bdb0f12d-3fc5-4f54-9148-62a9337bc4d5-getty-1199620322.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/5/17/108c1a80-7f76-4d57-b2a7-60c915e02e26-avengers-infinity-wars.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/is-chris-hemsworth-done-playing-thor-after-avengers-4-hes-had-such-mixed-feelings-about-the-role-9122256", "title": "Is Chris Hemsworth Done Playing Thor After 'Avengers 4'? He's Had Such Mixed Feelings About The Role", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/is-chris-hemsworth-done-playing-thor-after-avengers-4-hes-had-such-mixed-feelings-about-the-role-9122256", "type": "article", "title": "These Chris Hemsworth Comments About Why He's Probably Done Playing Thor Will Break Your Heart", "description": "The dust has finally begun to settle following the intense events of Avengers: Infinity War, leaving fans wondering about the future of Earth's Mightiest Heroes. With the next film the last he's officially signed up for, is Chris Hemsworth done…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/5/17/108c1a80-7f76-4d57-b2a7-60c915e02e26-avengers-infinity-wars.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "The dust has finally begun to settle following the intense events of Avengers: Infinity War, leaving fans wondering about the future of Earth's Mightiest Heroes. With the next film the last he's officially signed up for, is Chris Hemsworth done…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}