{"url": "https://www.inquisitr.com/4375756/chrisley-knows-best-star-julie-chrisley-connects-with-late-brother-on-hollywood-medium-ghost-apologizes/", "text": "The stars of Chrisley Knows Best have been in the news for all the right — and all the wrong — reasons as of late, and they’re back in the news again today for a much different (albeit interesting) reason.\n\nAccording to Us Weekly, Chrisley Knows Best star Julie Chrisley — who is Todd’s second wife — appeared on the hit show Hollywood Medium to connect with her late brother from the great beyond.\n\nJulie’s brother, whose name was Trey, committed suicide when he was 25-years-old.\n\nIn the sneak peek of the show, Tyler Henry — the titular Hollywood Medium — made the connection with Trey by feeling like he was “electrocuted,” only to find out that it was an obscure reference to the last job Trey did with their father, Harvey.\n\nJulie explains that one of the last moments her father and brother had together was doing a job on a lake that almost resulted in a severe electrical mishap. “No one would have any way of knowing that,” she says in a confessional interview. “That’s what’s so bizarre.”\n\nHenry begins to connect to Trey and relays the message he receives. “He comes through very very peaceful,” Henry says. “But he is making a very profound connection to your dad. The feeling is that dad never recovers or gets over this.”\n\nTodd also appeared with Julie in the clip, which you can see below.\n\nMy heart! Love these two munchkins! Always and forever! pic.twitter.com/53KrwUV2VQ — Julie Chrisley (@JulieChrisley) August 20, 2016\n\nAnd there was more that Trey wanted to tell the Chrisley Knows Best star, according to E!.\n\nSuicide is never an easy thing to go through, and Julie Chrisley proved that on the show’s sneak peek.\n\nTyler Henry went on to tell the couple that there was a feeling that Julie’s father, Harvey, never got over the death of Trey, and that when Trey went, a part of Harvey went with him.\n\nWith that in mind, Henry went on to say that Trey’s ghost wanted to apologize to Julie.\n\nTyler went on, “So for him, he’s apologizing almost like ‘I’m sorry that I went when I did because I didn’t know that this was going to impact dad so much.'” Julie then breaks down in tears while talking about how Trey’s death affected Harvey and how different her father was after her brother’s death.”\n\nGuys...I AM SO LOVING THE T-SHIRT THAT IM WEARING!! It's from my new line! Can't wait for you all to experience! Stay tuned these next couple of weeks...and you'll be able to purchase!! A post shared by Savannah Faith Chrisley (@savannahchrisley) on Jun 28, 2017 at 11:42am PDT\n\nIn happier news, there’s another Chrisley Knows Best star that’s currently making the press rounds; Savannah Chrisley!\n\nAccording to People Magazine, the young starlet is in the news because of the success of her clothing line, Faith Over Fear, which just premiered on HSN.\n\nAnd there’s one person that Savannah credits with the success more than anyone; Chrisley Knows Best patriarch Todd Chrisley.\n\n“He has been absolutely amazing,” Savannah says. “My dad has been the biggest supporter of me throughout. He’s my best friend and without him I couldn’t have made it happen. He loves all of the pieces I have in the line. I just love all the fabrics and so does he. So he’s extremely happy with it.”\n\nLeave your thoughts about Chrisley Knows Best in the comments below.\n\n[Featured Image by Frazer Harrison/Getty Images]", "images": ["https://secure.gravatar.com/avatar/d2d313805acdf2ac7f03549ff1ebea35?s=250&d=mm&r=g", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://cdn.inquisitr.com/wp-content/uploads/2017/06/Chrisley-Knows-Best-Fake-Marriage.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png"], "top_img": "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Bernadette Giacomazzo"], "canonical_link": "https://www.inquisitr.com/4375756/chrisley-knows-best-star-julie-chrisley-connects-with-late-brother-on-hollywood-medium-ghost-apologizes/", "title": "‘Chrisley Knows Best’ Star Julie Chrisley Connects With Late Brother On ‘Hollywood Medium,’ Ghost Apologizes", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": ["https://www.youtube.com/embed/il4YY5I3RRs?feature=oembed"], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}