{"url": "https://en.wikipedia.org/wiki/Time%27s_Up_(movement)", "text": "Movement against sexual harrassment\n\nTime's Up is a movement against sexual harassment and was founded on January 1, 2018, by Hollywood celebrities[2] in response to the Weinstein effect and #MeToo. As of December 2018 , it has raised more than $22 million for its legal defense fund, and gathered nearly 800 volunteer lawyers.[3]\n\nHistory\n\nIn November 2017, the Alianza Nacional de Campesinas wrote a letter of solidarity to the Hollywood women involved in exposing the sexual abuse allegations against Harvey Weinstein. The letter, published in Time, described experiences of assault and harassment among female farmworkers. The letter stated that it was written on behalf of the approximately 700,000 female farmworkers in the United States.[4]\n\nPartly in response, Time's Up was announced in The New York Times on January 1, 2018. The announcement cited the letter of support from the Alianza Nacional de Campesinas and the desire to support women, men, people of color, and the LGBT community who have less access to media platforms and funds to speak up about harassment.[1] At its founding, the following initiatives were announced:\n\nA $13-million legal defense fund, administered by the National Women's Law Center, to support lower-income women seeking justice for sexual harassment and assault in the workplace\n\nAdvocating for legislation to punish companies that tolerate persistent harassment\n\nA movement toward gender parity in studio and talent agencies\n\nCalling for women and men on the red carpet at the 75th Golden Globe Awards to wear black and speak out about sexual harassment and assault.\n\nMark Wahlberg and William Morris Endeavor, his talent agency, donated more than $2 million to Time's Up in early January 2018 in the name of Wahlberg's co-star Michelle Williams from All the Money in the World. This occurred after it was revealed that Williams (who is represented by the same agency) received $800 for 10 days to redo certain scenes in the movie, while Wahlberg received $1.5 million for the same 10 days of work.[5]\n\nAttendees of the 2018 Grammys including Lady Gaga, Lana Del Rey, Kesha and Cyndi Lauper wore white roses or all-black outfits to express solidarity with the Time's Up movement.[6] Lorde wore an excerpt from a work by Jenny Holzer, printed on a card stitched onto the back of her dress; the excerpt read, \"Rejoice! Our times are intolerable. Take courage, for the worst is a harbinger of the best. Only dire circumstance can precipitate the overthrow of oppressors. The old & corrupt must be laid to waste before the just can triumph. Contradiction will be heightened. The reckoning will be hastened by the staging of seed disturbances. The apocalypse will blossom.\"[7][6] Lorde wrote, \"My version of a white rose — THE APOCALYPSE WILL BLOSSOM — an excerpt from the greatest of all time, Jenny Holzer.\"[6]\n\nAt the 2018 Grammy's Kesha performed her song \"Praying\", while she stood in unity with fellow female songwriters/artists all wearing white to show their alliance in believing women, and that women will no longer be silenced.[8]\n\nAt the 2018 BAFTA Film Awards in London, attendees wore black and Time’s Up pins.[9]\n\nIn late 2018, Lisa Borders, former president of the WNBA and former Coca-Cola executive, was named the organization's first president and chief executive officer.[10] On February 18, 2019, she stepped down due to her son being accused of sexual misconduct.[11] Tina Tchen was named as chief executive in October of 2019.[12]\n\nIn January 2019, the organization launched its 4% challenge, asking production companies to show their commitment to working with a female director on a feature production in the next 18 months. Universal Pictures, MGM Studios, Paramount Pictures and Amazon Studios were among a number of prominent entertainment companies to pledge their support for the challenge.[13][14]\n\nFounding signatories\n\nOn the website is an open letter to women of the world, standing in solidarity and affirming the signatories' action to tackle sexual harassment and assault. The letter was signed by almost 400 predominantly British and American women in the entertainment industry and the DMK cosmetics foundation.[15] Signatories include Shonda Rhimes and the actresses from her headliner ABC shows Grey's Anatomy and Scandal, including Jessica Capshaw as well as her mother, Kate Capshaw, who has individually spoken out with husband Steven Spielberg on the \"national and global problem\" that needs to be tackled \"as an imperative.\"[16]\n\nLegal defense fund\n\nLawyers Roberta Kaplan and Tina Tchen co-founded the Time’s Up legal defense fund, which had raised $22 million as of October 2018 to provide legal defense for sexual violence victims, especially those who experienced misconduct in the workplace.[17][18] It has access to over 780 attorneys. According to the National Women’s Law Center (NWLC) which administers the fund, about 40% of those requesting help are women of color and 65% of them are low-income, from industries like construction, food services, and the military.[18]\n\nWebsite\n\nThe first thing listed on the Time's Up movement website is a statement that reads, \"The clock has run out on sexual assault, harassment, and inequality in the workplace. It's time to do something about it.\" Under the statement is a letter of solidarity, donations to the Time's Up Legal Defense Fund are asked for and if donation is given, signing of the letter of solidarity is permitted. Located a little further down is some statistical information about sexual assault and harassment against women as well as inequalities in the work place. What follows is information about the Time's Up Legal Defense Fund which money raised from this fund will assist in covering legal and public relations expenses in some cases where individuals have experienced instances of sexual harassment or retaliation in the workplace relating to such issues. The Time's Up Legal Defense fund is administered by the National Women's Law Center which is a national women's rights legal organization. This organization connects sexual harassment victims with attorneys who can provide legal assistance. The last thing listed on the website is other resources such as BetterBrave, Equal Employment Opportunity Commission (EEOC), and Equal Rights Advocates all of which are equipped to handle issues regarding sexual harassment or inequalities of women in the workplace.\n\nCriticism\n\nAs a movement focused on combatting sexual harassment in the workplace across many industries,[19] the Time's Up movement has received external criticism from a variety of sources. These critiques largely focus on the hypocrisy of the movement and its spokespeople, as well as the general response of Hollywood elites. Many writers have criticized Hollywood for espousing the messages of the movement without making the necessary changes in the industry that the movement is calling for. During awards season, writers called out the industry for \"leaning hardest on the very women it has exploited\" in order to convert their critiques and testimonies into \"inspirational messages and digestible branding exercises\".[20] Others criticize the movement for a lack of diversity in its spokespeople. The majority of Time's Up representatives are notably wealthy and of celebrity status. Many progressive commentators criticize the movement for its entrenchment in celebrity culture. They claim celebrities are not committed to the cause beyond their superficial involvement in the Time's Up organization and that these (mostly) women do not represent the interests of women in real communities.[21]\n\nAs a movement intended to combat sexual harassment across many industries, critics fear that its focus on Hollywood detracts from other industries. As a counterpoint, many bring attention to the fact that the Movement allies itself with Alianza Nacional de Campesinas.[22] Additionally, many cite that Time's Up draws inspiration from the #MeToo movement, a campaign started and organized by activists of color like Tarana Burke. Similar critiques came to light during the Golden Globes in January 2018, when many actresses and signatories of the movement dressed in black brought prominent activists as their dates; for example, Burke arrived with Michelle Williams, and Meryl Streep brought Ai-jen Poo, director of the National Domestic Workers Alliance as her date. Other activists in attendance included Rosa Clemente, Saru Jayaraman, Billie Jean King, Marai Larasi, Calina Lawrence, and Mónica Ramírez, co-founder of Alianza Nacional de Campesinas.[23] Though many praised this choice as an opportunity to lend voices to prominent activists in the field, others heavily criticized these and other actresses for showcasing activists of color as moral accessories.[20] In an interview with Variety, however, Burke herself commented that once she received an invitation from Michelle Williams to attend the awards, she thought this choice was \"brilliant\".[24]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Woman-power_emblem.svg/13px-Woman-power_emblem.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Time%27s_Up_logo.svg/180px-Time%27s_Up_logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Time%27s_Up_logo.svg/1200px-Time%27s_Up_logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Time%27s_Up_logo.svg/1200px-Time%27s_Up_logo.svg.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Time%27s_Up_(movement)", "title": "Time's Up (movement)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.27", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Time%27s_Up_logo.svg/1200px-Time%27s_Up_logo.svg.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}