{"url": "www.thecut.com/2018/06/sofia-richie-scott-disick-dating-again.html", "text": "Photo: Getty Images\n\nWelcome to You Know What I Heard, the Cut’s weekly celebrity gossip column about the peregrinations of the rich and famous.\n\nGet the best celebrity gossip in your inbox every week. Receive alerts every time there's more news from You Know What I Heard. Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.\n\nI am devastated to report that Sofia Richie, 19, broke up with Scott Disick, 35, but the separation only lasted for two days. There have been a lot of conflicting reports about the state of the couple’s tortured relationship in the last week, but I trust the Kardashians’ official news network, E!, to have the most honest version of events.\n\nE! reported yesterday that Richie ended things with Disick after he was spotted getting handsy with a “mystery blonde” at Kanye West’s album release party in Wyoming. (It’s interesting that Richie, who has been dating Disick for over a year — my God — wasn’t invited to the release party in the first place. I think that shows the Kardashians still have a long way to go in terms of accepting the relationship.) The breakup, however, lasted just 48 hours, as Disick quickly won Richie back with promises to “change.”\n\nAccording to E!, Richie has been living at Disick’s house in L.A., but she stayed at her father Lionel Richie’s house during the short separation. “Lionel and her family encouraged the split and are very upset and disappointed that she decided to get back with him,” a source told the site.\n\nUs Weekly reported last week that Lionel threatened to cut Sofia out of his will if she continued her relationship with Disick. But Sofia seems committed: She referred to Disick as her “whole [heart emoji]” on Instagram yesterday. Please pray that all relevant parties see reason soon.\n\nKendall Jenner, who once comically referred to Richie as one of Disick’s children, kissed someone in public. That someone is Anwar Hadid, the 18-year-old model brother of Jenner’s friends Gigi and Bella Hadid. TMZ got a photo of the pair making out at an after-party for the CFDAs Monday night. According to the gossip site, “Kendall was hangin’ with Anwar at Socialista New York for about 2 hours — kissing, cuddling and drinking with the youngest Hadid sibling the whole time.”\n\nWill Gigi and Bella be upset? Who cares! Jenner never does anything fun, and this sounds fun. She also never shows PDA with anyone she reportedly dates. (Blake Griffin, Ben Simmons, A$AP Rocky …) Maybe Anwar is the one.\n\nGigi Hadid, meanwhile, looks to be back together with her ex-boyfriend Zayn Malik. And Bella has been spotted hanging out several times with her ex-boyfriend the Weeknd. Everyone is happy.\n\nIn other new celeb relationship news, Jennifer Lawrence reportedly has a new boyfriend. According to “Page Six,” his name is Cooke Maroney, and he is a director at New York’s Gladstone Gallery. A source told the gossip site, “They met through Jen’s friend Laura … The relationship has been going on a few weeks. But they have been very private and careful not to be seen together.” This is exactly the thing a “source” would say before a new couple is about to be seen together. Keep your eyes on the Daily Mail!\n\nPhoto: Getty Images\n\n“Page Six” says that Maroney is 33, which is great. It’s a nice age for a boyfriend to be, when you’re 27, which Lawrence is. A terrible age for a boyfriend to be is: 49.\n\nOne Small Blessing\n\n“Audrina Patridge is the happiest she’s ever been since reuniting with Ryan Cabrera.”\n\nBlind Item of the Week\n\nAnd here’s an interesting blind item from this week, care of Enty at the best site for blind items, Crazy Days and Nights:\n\n“I don’t think he acts enough any longer to be permanently A or A- list, but this former A+ list mostly movie actor cheated on his wife the night before they got married. He called it a cleanse. Uh huh.”\n\nWho could it be? Richard Gere recently got married. So did Hugh Grant. Put your guess in the comments or speak it to the wind!\n\nFinally, I’ll leave you with this photo of Emma Stone and Justin Theroux “hanging out” in a bungalow at the Hotel du Cap Eden Roc in the south of France last week. Both stars, who have been rumored to be dating since they left Rihanna’s Met Gala after-party together, were in town for the Louis Vuitton cruise show. Stone told reporters Theroux was like her “brother” at the show. Does this look like a brother-sister relationship to you? Let me know!\n\nPhoto: SAUD/One Shot / BACKGRID\n\nThanks so much for gossiping this week. If you’d like to get this column in your inbox every week, subscribe in the box up top, and don’t forget to email me at allie.jones@nymag.com, send me a message on Twitter, or contact me on Signal, if you’d like to chat.", "images": ["https://pixel.nymag.com/imgs/fashion/daily/2018/06/06/gossip/cooke-maroney-jennifer-lawrence.nocrop.w710.h2147483647.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/06/06/gossip/lede.w1200.h630.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/06/06/gossip/lede.w700.h700.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/06/06/gossip/justin-theoroux-emma-stone.nocrop.w710.h2147483647.jpg"], "top_img": "https://pixel.nymag.com/imgs/fashion/daily/2018/06/06/gossip/lede.w1200.h630.jpg", "keywords": [], "authors": ["Allie Jones"], "canonical_link": "https://www.thecut.com/2018/06/sofia-richie-scott-disick-dating-again.html", "title": "Why Did Sofia Richie, 19, Take Scott Disick, 35, Back?", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Why Did Sofia Richie, 19, Take Scott Disick, 35, Back?", "url": "https://www.thecut.com/2018/06/sofia-richie-scott-disick-dating-again.html", "description": "And more in this week’s celebrity gossip column.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/06/06/gossip/lede.w1200.h630.jpg", "site_name": "The Cut", "type": "article"}, "twitter": {"title": "Why Did Sofia Richie, 19, Take Scott Disick, 35, Back?", "description": "And more in this week’s celebrity gossip column.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/06/06/gossip/lede.w600.h315.2x.jpg", "card": "summary_large_image", "creator": "@allierileyjones", "site": "@TheCut"}, "article": {"published_time": "2018-06-06T14:54:59.401-04:00", "tag": "you know what i heard, celebrity, culture, gossip, sofia richie, scott disick, kendall jenner, anwar hadid, jennifer lawrence, emma stone, justin theroux", "publisher": "https://www.facebook.com/cut"}, "description": "In this week’s celebrity column, we look into why Sofia Richie and Scott Disick got back together, Kendall Jenner’s make-out session with Gigi Hadid’s younger brother, J.Law’s new boyfriend, and Emma Stone’s ‘brotherly’ love towards Justin Theroux.", "sailthru.tags": "you know what i heard, celebrity, culture, gossip, sofia richie, scott disick, kendall jenner, anwar hadid, jennifer lawrence, emma stone, justin theroux", "author": "Allie Jones", "fb": {"app_id": 343556435754245}, "type": "Article", "vertical": "The Cut", "apple-mobile-web-app-title": "The Cut", "application-name": "The Cut", "msapplication-TileColor": "#ff5656", "msapplication-TileImage": "https://assets.nymag.com/media/sites/thecut/icon.144x144.png"}, "movies": [], "publish_date": 1528311299.401, "source": "http://www.thecut.com", "summary": ""}