{"url": "https://en.wikipedia.org/wiki/Once_Upon_a_Time_(season_7)", "text": "No.\n\noverall No. in\n\nseason Title Directed by Written by Original air date US viewers\n\n(millions)\n\nIn a flashback, an 18-year-old Henry says goodbye to Regina as he departs Storybrooke on a trip to new realms, in hopes of finding his own story. Many years later, Henry runs into Cinderella's carriage in the New Enchanted Forest and, after a string of events that almost get them captured at a ball, he offers her the chance at a new start back in Storybrooke, as he is due to return through a portal that evening. When Henry finds a glass slipper left for him at their meeting spot, he decides to stay behind. In present-day Seattle, an older Henry is reunited with his daughter Lucy, whom he does not remember because of a curse. In hopes of breaking it, Lucy leads him to her neighborhood of Hyperion Heights, home to many other cursed fairytale characters including Jacinda, Lucy's down-on-her-luck single mother who is in a contentious relationship with her powerful stepmother Victoria. Others include Roni (Regina Mills), a bar owner who is struggling with having to sell her establishment to Victoria, and Rogers (Captain Hook from the Wish Realm), a cop who gets promoted to detective and is introduced to his new partner, Weaver (Rumplestiltskin).\n\nIn flashback to Storybrooke, Hook is training an 18 year old Henry as Emma watches on. She confesses to Hook that she worries Henry is about to leave on his own. In order to comfort her, Hook shows her a bottle Henry can use to call on them if he gets into trouble. Many years later, as Henry is about to be captured by Lady Tremaine, he uses the bottle to call on Emma, Hook, and Regina for help. In the present, Victoria hires Rogers and Weaver to drive Henry out of the neighborhood. Rogers does not agree with Weaver's methods and helps Henry instead. Rogers, Henry, and Roni end up forming an alliance against Victoria. Meanwhile, Jacinda has to find another way to be at Lucy's ballet recital after Victoria makes things difficult for her.\n\nIn a flashback, Cinderella arrives at the spot in the forest where she is supposed to meet Henry, but does not find him there. She then meets Princess Tiana, who recruits her to be part of the resistance against Lady Tremaine. She leaves one of her glass slippers behind for Henry to find. A short while later, Henry, Regina, and Hook arrive at their campsite and join the efforts. Later, Cinderella sneaks into Tremaine's castle alone, where Tremaine reveals that she has kept her almost-deceased daughter Anastasia preserved since her \"death\" at age 14 and needs a pure heart to revive her. She tasks Cinderella with stealing Henry's, since he has the heart of the truest believer. In the present day, Jacinda tries to save Lucy's beloved community garden from Victoria, while Lucy takes a skeptical Henry on a trip under the garden lot in hopes of finding proof of everyone's fairytale pasts. Meanwhile, Henry, Roni, and Rogers find their first lead against Victoria. Rogers captures the man working with her, but is irritated to find Weaver setting the man free to use him as a future connection. Also, it is revealed that Victoria is not cursed and has been keeping a witch as her prisoner at the top of Belfrey Towers.\n\n137 4 \"Beauty\" Mick Garris Dana Horgan & Leah Fong October 27, 2017 ( ) 2.44[60]\n\nIn a flashback to Gideon's first birthday, Rumple and Belle decide to leave Storybrooke to travel the world. Years later, Rumple tells Belle that he wants to stop being the Dark One so he can be mortal again and live out one single life with her. Over the years, they search for ways to get rid of his Darkness. When Gideon is 18, Belle comes across a prophecy that leads them to the Edge of Realms, where they must wait for the sun's brightest set before they can be guided to the path Rumple must take to get rid of the Darkness. They build a home there as they wait for the event to occur. However, an aging Belle eventually admits that the \"sun\" of which the prophecy spoke was actually herself and that her death will mark the start of his journey. When Belle dies, Rumple sets off to search for a Guardian who will be able to take the Darkness from him so that he can ultimately be reunited with Belle. In the present day, Tilly, who is actually Alice, begins to wake up from the curse after she stops taking pills given to her by Victoria and, after several attempts, manages to get Weaver to remember his true identity.\n\n138 5 \"Greenbacks\" Geofrey Hildrew Christopher Hollier & Adam Karp November 3, 2017 ( ) 2.29[61]\n\nIn flashbacks, Tiana seeks a prince to help save her kingdom and is guided by Dr. Facilier to a man named Robert. She soon realizes that Facilier had enlisted Robert to steal a magical ruby from her in exchange for reuniting him with his lover who had been turned into a frog. In the present day, Tiana decides to run a pop-up beignet shop out of Mr. Cluck's with Jacinda's help. Victoria sends someone to burn the place down, which then causes friction between the two roommates. Rogers comes across a detainee at the police station who he thinks is connected to Eloise Gardener, the missing girl he's trying to find. Meanwhile, Roni decides to investigate Ivy's interest in helping Henry. Ivy takes her to the top of the towers and Roni finds a photo of herself and a young Henry taken in Storybrooke. However, it is later revealed that Ivy hasn't been cursed either and has her own dealings with the witch of which her mother is unaware.\n\n139 6 \"Wake Up Call\" Sharat Raju Jerome Schwartz & Jane Espenson November 10, 2017 ( ) 2.37[62]\n\nIn a flashback, Regina comes across Drizella, who is looking for magic to escape from her mother. When she reveals that she was actually born with magic, Regina begins to train her. However after Regina runs into Rumple, who tells her that Lady Tremaine must have been aware of the magic lessons, the two women realize that Lady Tremaine was counting on using Drizella's heart to revive Anastasia. Drizella ends up blackening her own heart by killing the prince, making it unusable for revival, and vows to cast a Curse like Regina's to make her mother suffer. In the present day, Roni struggles with what to believe about the mysterious photo, which is complicated by newly discovered information about \"Regina Mills\" into which Lucy encouraged her to look. Drizella gathers the ingredients for a plant that the witch then cultivates and, when she serves its essence to Roni, she wakes up and remembers her life as Regina. Drizella then reveals that she cast the curse and blackmails Regina into keeping Henry and Jacinda apart, reminding her of a special contingency that was put into the Curse that would hurt her family if she didn't comply.\n\n140 7 \"Eloise Gardener\" Alex Kalymnios David H. Goodman & Brigitte Hales November 17, 2017 ( ) 2.28[63]\n\nIn a flashback in the Wish Realm, shortly after the Charmings stopped Regina from casting her Curse, Hook agrees to grant her passage on the Jolly Roger in exchange for leading him to powerful magic guarded by a witch. When he arrives at the witch's tower, he finds Rapunzel instead. She instructs him to retrieve a golden flower from the witch's garden. When he returns with it to help her, they spend the night together. The next morning, it is revealed that Rapunzel is actually Gothel and their night together produced a baby, whom Gothel leaves behind so she can escape the tower. Hook gives the Jolly Roger to Smee and decides to stay with his daughter, who is unable to leave due to the tower's spell. He names her Alice after his own mother. In the present day, Rogers is on a mad hunt for Eloise with help from Henry and Tilly. Tilly later informs him that Eloise has died, but it turns out that the news was planted by Weaver to throw him off the case. When Rogers finds Gothel, he believes that she is Eloise and frees her from Victoria, who gets locked up for kidnapping.\n\n141 8 \"Pretty in Blue\" Ralph Hemecker Dana Horgan & Leah Fong November 17, 2017 ( ) 2.28[63]\n\nIn flashbacks, Hook is reunited with Alice, who claims that they have been cured of their curse. However, when they try to embrace, Hook gets hurt, and Alice runs away in fear. Henry and Cinderella chase her back t Wonderland, a place where Cinderella reveals her mother Cecilia ran to after abandoning her and her stepfather. She takes a shrinking potion and leaves Henry, heading into the Infinite Maze alone to find answers. She finds Alice, who tells her that she met Cecilia before and that she was also afflicted with the Curse of the Poisoned Heart. Drizella appears in Wonderland with a plan to curse Henry, but Alice and Cinderella are able to save him. Henry and Cinderella then share their first kiss. In the present day, Jacinda contacts Nick (Jack in Fairy Tale Land), a lawyer whom she has been cursed to believe is Lucy's father. He agrees to help her regain custody of Lucy, to Henry's dismay, and Lucy encourages Henry to fight for Jacinda. Meanwhile, Drizella and Gothel plan to revive Anastasia, but when they open her coffin, her body is missing. After Regina confronts Weaver, who refuses to confirm that he has woken up from the curse, she announces to Henry that she's heading to San Francisco, to meet with someone who was pushed out of town by Victoria. He agrees to join her on the trip.\n\n142 9 \"One Little Tear\" Steve Pearlman Christopher Hollier & Adam Karp December 8, 2017 ( ) 2.45[64]\n\nVictoria strikes a deal with Weaver, in an attempt to free herself from jail and wake Anastasia. In flashbacks, Rapunzel steals from Mother Gothel's garden to save her family, and is trapped in a tower in exchange. After six years of captivity, Rapunzel escapes using her hair, but finds her husband Marcus has married Cecilia, gaining a stepdaughter, Ella. Gothel tempts Rapunzel with a Wonderland mushroom, which she uses to poison Cecilia's heart, and leads to Cecilia running away. One day, Anastasia and Ella fall through thin ice but, to Rapunzel's disbelief, their father only manages to save Ella. Rapunzel seeks Gothel's help, who magically seals Anastasia's last breath with the price of keeping Anastasia in the tower. However, Rapunzel tricks Gothel who becomes trapped in her own tower until someone in her bloodline takes her place. In the present, Victoria strangely gives full custody of Lucy to Jacinda, claiming to be a changed person. Victoria retrieves the Once Upon a Time book and shows Lucy her unfortunate life story as Rapunzel, convincing Lucy to give up her belief in happy endings. As Lucy sheds a tear, Victoria uses it to awaken Anastasia, while Lucy collapses into unconsciousness.\n\n143 10 \"The Eighth Witch\" Ralph Hemecker Jane Espenson & Jerome Schwartz December 15, 2017 ( ) 2.29[65]\n\nIn a flashback, baby Lucy is born just as Drizella appears to deliver a prophecy about a curse. The heroes are able to turn Drizella to stone. Eight years later, everyone is celebrating Lucy's birthday when Gothel appears with her coven of witches, recruiting Drizella to join them as she is finally freed. With the curse looming, Regina heads off to get help from Zelena. Later, when the heroes confront the witches, Gothel reveals that they have poisoned Henry and Regina is forced to cast Drizella's curse in order to save his life. In the present day, Regina has located a cursed Zelena in San Francisco, who is now known as Kelly. Regina is able to give Zelena her memories back and the two head back to Seattle, knowing that breaking the curse to help Lucy will hurt Henry. Rumple tests Anastasia to see if she is the Guardian. However, Gothel also wants Anastasia and severs her alliance with Drizella after the girl is brought to her, deeming Anastasia to be more useful in her coven. Gothel tells her that they need to find their fellow witches.\n\n144 11 \"Secret Garden\" Mick Garris Edward Kitsis & Adam Horowitz March 2, 2018 ( ) 2.14[66]\n\nIn a flashback, an 18-year-old Robin has been secretly dabbling in magic against her mother's wishes. After attempting a spell that leads her to Gothel, Robin disappears from Storybrooke and Zelena arrives in the New Enchanted Forest looking for her. Robin is excited to apprentice under the powerful witch but soon finds out that Gothel only wants her to be the sacrifice needed for a resurrection amulet to bring Madame Leota back to the land of the living. In the present day, Regina and Zelena seek the resurrection amulet in hopes of finding another way to save Lucy. However, Tremaine gets a hold of the amulet and hands it over to Gothel, not realizing that Gothel intends to use Drizella as the sacrifice this time around. As the amulet's magic begins to take Drizella's life, Tremaine decides to sacrifice herself to save her daughter and dies as Lucy begins to awaken. Elsewhere, it is revealed that there is a killer on the loose in Hyperion Heights, as a doctor who finds out about Lucy's true paternity is poisoned by a mysterious figure.\n\n145 12 \"A Taste of the Heights\" Nina Lopez-Corrado David H. Goodman & Brigitte Hales March 9, 2018 ( ) 2.22[67]\n\nIn a flashback to the day of Tiana's coronation, Facilier appears to warn her of a danger to her kingdom, which ends up sending her on a hunt for a giant alligator. She meets Prince Naveen at the wreckage site and while the two don't get along, they agree to search for it together. When the alligator attacks them on a lake, Tiana is able to kill it but Naveen is left gravely injured. When Facilier reappears to claim a necklace from inside of the beast, Tiana gets him to revive Naveen, but on a previously undisclosed condition that the prince is to be enslaved to him until further notice. In the present day, Sabine is excited to participate in a food truck festival until an anonymous tip to the cops leaves her unable. She accuses Drew, a former classmate-turned-food truck rival, of sabotage. However, it is revealed that Drew is under orders from Samdi, a mysterious investor, to get close to her for his own purposes. Regina figures out that Facilier isn't really cursed and it is revealed that they have a history tracing back to the Enchanted Forest. Meanwhile, Lucy discovers upsetting information about the current curse, while Rogers and Weaver discover that the neighborhood killer is going after witches in particular.\n\n146 13 \"Knightfall\" Steve Miner Jerome Schwartz & Miguel Ian Raya March 16, 2018 ( ) 2.38[68]\n\nIn the flashbacks, after a young Alice has been receiving frightening visions of Gothel attacking her and Hook in the tower, Hook vows to help her escape and seeks help from the Rumplestiltskin in the Wish Realm. Rumple tells him to procure a magical fish hook from Captain Ahab. He wins it from Ahab over a die roll, however, when Ahab comes back to taunt him about his former pirate status, Hook agrees to a pistol duel. When he returns to the tower, Hook and Alice find themselves branded and cursed by Gothel, who had poisoned the bullet that hit him. In the present day, Rogers and Weaver interrogate Eloise about her cult, though she is only interested in playing mind games with Rogers. Tilly, who is experiencing a manic episode, desperately tries to convince the detectives to see Eloise for who she really is. When they deduce that Eloise was trying to mislead them about the case, they check up on Hilda in the hospital, only to find her dead, with Tilly holding a scalpel in the room.\n\n147 14 \"The Girl in the Tower\" Antonio Negret Dana Horgan & Leah Fong March 23, 2018 ( ) 2.11[69]\n\nIn a flashback, Alice makes a birthday wish to get out of the tower and shortly after, a troll appears and helps her escape. Years later, Alice is caught spying on the resistance group by Robin, who had just recently arrived to the New Enchanted Forest. Robin intends to honor her father's legacy by hunting down Alice's troll, who has since been destroying villages, but Alice goes after her to protect it. In the present day, Rogers, Henry, and Tilly are looking for evidence of Tilly being elsewhere during the time of the baker's murder to clear her name. As she retraces her steps, Tilly grows frustrated when she finds that no one can remember seeing her at the places she had visited. Meanwhile, Regina asks Facilier out on a date so that Lucy can break into his suite to look for clues as to what he seeks in Hyperion Heights.\n\n148 15 \"Sisterhood\" Ellen S. Pressman Christopher Hollier & Adam Karp March 30, 2018 ( ) 2.03[70]\n\nIn a flashback, Gothel recruits Drizella to compete for one of two spots in her coven. Drizella strikes a partnership with Gretel and they agree to help each other out on the course, however, it turns out that real test was that one would have to kill the other to win. In the present day, Drizella is attacked by the neighborhood \"Candy Killer.\" Facilier offers her a way to escape to her home realm, though it would be at the expense of Anastasia's life. Initially, Drizella lures Anastasia in under the guise of wanting to rekindle their sisterhood and brings her to Facilier to perform the ritual. When Anastasia unexpectedly awakens, she must choose between Drizella or Gothel, and ultimately chooses her sister. The two are able to open a portal and leave Hyperion Heights to start over together in the New Enchanted Forest. Meanwhile, Lucy organizes a boys night out for Henry, Rogers, and Nick, which ends with the revelation that Nick is the Candy Killer.\n\n149 16 \"Breadcrumbs\" Ron Underwood Jane Espenson & Jerome Schwartz April 6, 2018 ( ) 2.15[71]\n\nIn a flashback, Henry expresses his desire to find his own story, as he feels unworthy of Ella. When he mentions to Hook that he wants to propose with a special ring like the one of his grandparents, Hook suggests that they retrieve one from Davy Jones' locker and the two sneak aboard the Jolly Roger to overtake it from Blackbeard. However, it is revealed that it was all a set-up by Hook so that Henry could feel like he partook in an epic adventure. A little while later, Henry ends up proposing to Ella anyway. In the present day, Henry lands a job interview in New York but before he can leave, Weaver finds his novel at the crime scene and insists that he help the police identify the Candy Killer, whom they conclude is a man who believes he is the \"Hansel\" of the story. When Henry gets a flat tire driving to the airport, Nick offers him a ride, which ends with Henry getting kidnapped by Nick, who confirms the former's suspicions of him being Hansel and the Candy Killer. As this is happening, Zelena is horrified to find that she is the killer's next target.\n\n150 17 \"Chosen\" Lana Parrilla Paul Karp & Brian Ridings April 13, 2018 ( ) 2.18[72]\n\nIn a flashback, another witch, who is in possession of Hansel and Gretel, has settled into Oz, to Zelena's disdain. After Zelena refuses to help the kids, she is magically weakened by the witch, and faints in the forest. She is taken in by a blind man named Ivo, who happens to be Hansel and Gretel's father. When Zelena decides to go back for the children, she finds that they had already escaped and told their father about their encounter with her. When the family refuses to give her a second chance, Zelena angrily burns Hansel. In the present day, Jack tells Henry everything about their fairytale pasts, but Henry is still a nonbeliever. Jack kidnaps Chad to lure in Zelena to get his revenge. Zelena ends up having to tell Chad her real name and hints at her wicked past, though he doesn't care and the two decide to move back to San Francisco together. Meanwhile, Facilier uses Naveen, who is actually not cursed, to get magic for a voodoo doll that he uses to kill Jack.\n\n151 18 \"The Guardian\" Geofrey Hildrew David H. Goodman & Brigitte Hales April 20, 2018 ( ) 2.12[73]\n\nIn the past, Mr. Gold, still dealing with the loss of Belle, is challenged by Facilier to rid himself of the Dagger by seeking out the Guardian, who is able to free him of the Darkness. When Gold finds Alice and believe her to be the person he was looking for, he test out the theory on Facilier by pulling his heart out and his hunch was correct, but then has a change of heart by withholding transfer of his power to Alice so she can be happy with Robin and not dealing with the burden she would carry. Alice also convinced Hook that Rumpelstiltskin is not a villain and the two became friends. In the present, Nick’s death has Weaver suspecting Samdi of stealing the Dagger, but Samdi says he had no involvement with taking the latter. Weaver also betrayed Roni by using the magic needed to save Henry in order to track down the Dagger, which lead it to Tilly, whose first date with Margot is distracted by the voices from the Dagger itself, but in the end Margot does see a soulmate in Tilly. When Rogers discovers Drew was the last person who might have known what happened to Nick, Drew warns him about Samdi and how Nick died. Henry discovers that Nick/Hansel was telling him the truth about the blood test results that confirmed him as Lucy’s father and shares the results with a stunned Jacinda.\n\n152 19 \"Flower Child\" Tessa Blake Edward Kitsis & Adam Horowitz April 27, 2018 ( ) 1.98[74]\n\nIn a flashback, young tree nymph Gothel yearns for interaction with humans. Though warned against it by her nymph family, she explores a house and meets a group of ladies who appear accepting of her magic, who then invite her to a ball. It turns out that the girls only sought out to humiliate her and stole her key to enter the nymphs' grove to destroy everything and everyone in it. Avenging the death of her kind, Gothel goes on a destructive rampage and it is revealed that Gothel had turned her home realm into what we now know as the Land Without Magic. In the present day, Gothel tells Tilly that she is her mother and Tilly goes to Rogers with this information. The two of them go to Henry, who has already begun to seriously consider that the stories in his book are actually real. Lucy and Facilier manage to cure Henry of his pre-curse ailments, however, when her parents finally share a kiss, the curse doesn't break. Meanwhile, Rogers and Tilly's stakeout on Eloise ends with Tilly being blackmailed into becoming the final member of Gothel's revived coven. The sisterhood then releases their magic back into the land.\n\n153 20 \"Is This Henry Mills?\" Ron Underwood Dana Horgan & Leah Fong May 4, 2018 ( ) 1.98[75]\n\nIn the flashbacks to Henry's senior year of high school, Henry ponders over what his next step should be and tells Regina that he wants to explore colleges outside of Storybrooke. He ends up being accepted to every college he applied to, however, having to lie about his life experiences on the applications gave him doubts about leaving town after all. In the present day, Regina and Lucy try to break the curse before the coven fully gives their magic to Gothel's doomsday plot to wipe out mankind. After multiple failed attempts to wake Henry, Regina reveals that the curse had actually taken them back in time. When a disbelieving Henry decides to call a phone number listed on his supposed adoption papers, a young Henry picks up on the other line and it is revealed that the curse took them back to the same time period shown in the flashbacks and it is currently Henry's graduation night. The adult Henry gives his younger self some advice, which gives him the push he needs to be okay with leaving home. When Henry finds that Regina has been hurt by Gothel, he is able to give her true love's kiss, which breaks the curse on the entire neighborhood. Alice finds the strength to defeat Gothel, with her father and Robin by her side. At the end of the episode, Weaver pays a visit to Facilier's office, and their standoff halts when his Wish Realm counterpart suddenly appears and kills Facilier.\n\n154 21 \"Homecoming\" Steve Pearlman David H. Goodman May 11, 2018 ( ) 2.26[76]\n\nCelebrations over breaking the Dark Curse are cut short when Wish Realm Rumplestiltskin sends Jacinda and Lucy to the Wish Realm, and attempts to blackmail Henry into obtaining the Dark One Dagger for him. Henry, along with Roni, Weaver, and Rogers, enters a portal to the Wish Realm to find his family. Once on the other side, the group has been split, with Henry and Roni sent to the Dark Castle, while Weaver and Rogers are sent to Rumple's old hovel. Wish Rumple reveals that he has trapped Jacinda and Lucy in a snowglobe that will count down to their deaths by midnight. A desperate Henry obtains the Wish Realm's version of the Author's Pen in hopes of freeing them, but it turns out that Wish Rumple was after the pen all along, not the dagger. He then presents it to Wish Henry, who is more than willing to help him rewrite some stories after losing his mother and grandparents. He ends up erasing the Guardian's powers, and Wish Rumple then sends Henry, Weaver, and Rogers into the snowglobe. Roni is left behind, as Wish Henry desires revenge after their last encounter. Meanwhile, Tilly feels that her father is in danger, and Sabine helps her and Margot obtain a magic bean after regaining her confidence as queen of her people. The two then reveal that they're making a pit stop to find help before heading to the Wish Realm, and they drive through the portal into Storybrooke.\n\n155 22 \"Leaving Storybrooke\" Ralph Hemecker Edward Kitsis & Adam Horowitz May 18, 2018 ( ) 2.27[77]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c4/Once_Upon_a_Time_Season_7.jpg/220px-Once_Upon_a_Time_Season_7.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/c/c4/Once_Upon_a_Time_Season_7.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/c/c4/Once_Upon_a_Time_Season_7.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Once_Upon_a_Time_(season_7)", "title": "Once Upon a Time (season 7)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/c/c4/Once_Upon_a_Time_Season_7.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}