{"url": "https://www.yahoo.com/entertainment/hoda-kotb-gives-haley-joy-185300465.html", "text": "Jennifer: You believe in judging people on the things that they've done, Ms Johnson? Please allow me apologize for all who criticize the outstanding public service of Mr. Trump. I’m sorry Mr. Trump suggested he had damaging information on Cohen's father-in-law, one of several overt extortions. I’m sorry he has attacked freedom of religion, freedom of peaceful protest, freedom of the press. I’m sorry he has attacked and slandered every citizen and political representative, foreign and domestic, that has questioned him, that he has inspired pipe bombing, murder, assault and hate throughout the country. I’m sorry he has relentlessly slandered truth, violated ethic standards, moral standards, and legal standards, alienated life long allies and supported a group of people who proudly wear symbols representing a movement that killed hundreds of thousands of our fathers and grandfathers and summarily murdered millions of men, women and children. I’m sorry his university and his charity were so corrupt they had to be dissolved. I’m sorry he has separated children from mothers in a move precisely reminiscent of 30’s Germany. I’m sorry he has refused to ethically examine any of his revolving door appointees, and has slandered our most respected government agencies. I’m sorry he has obstructed justice at every turn. I’m sorry he refused to serve his country, and has mocked those who have served with the greatest personal sacrifice. I’m sorry that as a private citizen, he participated, by proxy, in meeting with representatives of a murderous totalitarian adversary having a dispute with United States, to acquire covertly obtained information, to corrupt an American election, and I’m sorry he went to a Russian satellite to do it again. I’m sorry he’s condoned the murder and dismemberment of a journalist. I’m sorry he’s bargained with the lives of American working families to build an unnecessary monument to himself to resolve a national crisis that did not exist prior to him, and I’m sorry that national crisis will exist if he continues to destroy their countries of origin. I’m sorry for the dozens more examples of his vile nature and I’m sorry his behavior is that of a criminal, and as a father, he has raised the same. I’m sorry he is not a good man, an honest man, a fair man, a compassionate man, a law abiding man, a dignified man, an honorable man or a man displaying any character other than bad. He didn’t know what Stone was doing, he didn’t know what Manafort was doing, he didn’t know what Cohen was doing, he didn’t know what Flynn was doing, he didn’t know what Bannon was doing, he didn’t know what Giuliani was doing, he didn’t know what his son-in-law was doing, he didn’t know what his son was doing.... no citizen of competent intelligence believes that, and I’m sorry anyone who doesn’t believe that and still supports him is dangerously lacking in character themselves. On the heals of Trumps 8,900+ lies since taking office and Mr Jordan exclaims, “We are legitimizing dishonesty” in reference to Mr Cohen’s testimony. I’m sorry I honestly don’t think I’ve ever heard a better, or more disturbing, ‘pot kettle’ example in my life. I’m sorry the Muller report, declared by Mr. Trump to totally exonerate himself, is so damning that its true content must be summarily ignored by the Republican congress, along with his taxes. I'm sorry his inept, incompetent handling of a deadly virus, known to him for months, ignored dispite clear example and medical expert advice, will kill tens of thousands more americans than otherwise might have been. I’m sorry the value of what is said rests entirely on the character of who said it, and I’m sorry everything he says has no place to rest. I’ve been a registered republican for 50 years, but I’ve never been a fascist. Finally, I’m sorry we can’t all say the same. Trump supporters and I have no reason to quibble. They want a criminal, an extortionist, a serial adulterer, a man whose hate mongering has caused murder, pipe bombing, assault and unparalleled division of citizens and allies, a service dodging, self-serving, greedy pathological liar and slanderer, a man void of dignity, ethics, honesty, honor and compassion to lead them and provide example to our children. I don’t. You are what you vote for. When you endorse a liar, Ms Johnson, you are a liar, pardoned or not. This is no longer a question of Republican or Democrat. This is a question of Democracy or totalitarianism. Say it to yourself as many times as is necessary for you to comprehend; It is a fact.", "images": ["https://s.yimg.com/ny/api/res/1.2/AaB4lw2m4bRlxExj35rxgA--~A/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9NjQw/http://media.zenfs.com/es-US/homerun/yahoo_view_839/8d8a12bc7a0b4b1e07ead9128791129f", "https://s.yimg.com/uu/api/res/1.2/3Kfd4tEKSp2yOlpOZAIVqQ--~B/aD0yODg7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/es-US/homerun/yahoo_view_839/179d68abf42f9ce14227ab0e2e39cf40", "https://s.yimg.com/ny/api/res/1.2/6e0wkXnSiaWztDSJ8gnuxw--~A/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9NjQw/http://media.zenfs.com/es-US/homerun/yahoo_view_839/934586bdd6c30e497a1f7387c9b10dd0", "https://s.yimg.com/ny/api/res/1.2/E5rh2wg_iZimn2zUQSMcRA--~A/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9NjQw/http://media.zenfs.com/es-US/homerun/yahoo_view_839/f7539331368c2c6a73cacc70fbbf98c6", "https://s.yimg.com/g/images/spaceball.gif"], "top_img": "https://s.yimg.com/uu/api/res/1.2/3Kfd4tEKSp2yOlpOZAIVqQ--~B/aD0yODg7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/es-US/homerun/yahoo_view_839/179d68abf42f9ce14227ab0e2e39cf40", "keywords": [], "authors": [], "canonical_link": "https://www.yahoo.com/entertainment/hoda-kotb-gives-haley-joy-185300465.html", "title": "Hoda Kotb Gives Update on Haley Joy: \"She's Everything\"", "meta_data": {"oath": {"guce": {"consent-host": "guce.yahoo.com"}}, "msapplication-TileColor": "#6e329d", "msapplication-TileImage": "https://s.yimg.com/rz/p/yahoo_frontpage_en-US_s_f_w_bestfit_frontpage.png", "msvalidate.01": "A9862C0E6E1BE95BCE0BF3D0298FD58B", "referrer": "unsafe-url", "theme-color": "#400090", "twitter": {"dnt": "on", "site": "@YahooEnt", "card": "summary_large_image", "description": "The \"Today\" cohost gushes over her infant daughter and shares one of Haley Joy's latest milestones! Take a look.", "image": {"identifier": "https://s.yimg.com/uu/api/res/1.2/3Kfd4tEKSp2yOlpOZAIVqQ--~B/aD0yODg7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/es-US/homerun/yahoo_view_839/179d68abf42f9ce14227ab0e2e39cf40", "src": "https://s.yimg.com/uu/api/res/1.2/3Kfd4tEKSp2yOlpOZAIVqQ--~B/aD0yODg7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/es-US/homerun/yahoo_view_839/179d68abf42f9ce14227ab0e2e39cf40"}, "title": "Hoda Kotb Gives Update on Haley Joy: \"She's Everything\""}, "application-name": "Yahoo Entertainment", "news_keywords": "Yahoo", "apple-itunes-app": "app-id=304158842,app-argument=yahoo://article/view?uuid=1b19f5fb-b006-39b9-ab5e-540ecdbba645&src=web", "description": "The \"Today\" cohost gushes over her infant daughter and shares one of Haley Joy's latest milestones! Take a look.", "og": {"type": "article", "image": "https://s.yimg.com/uu/api/res/1.2/3Kfd4tEKSp2yOlpOZAIVqQ--~B/aD0yODg7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/es-US/homerun/yahoo_view_839/179d68abf42f9ce14227ab0e2e39cf40", "description": "The \"Today\" cohost gushes over her infant daughter and shares one of Haley Joy's latest milestones! Take a look.", "title": "Hoda Kotb Gives Update on Haley Joy: \"She's Everything\"", "url": "https://www.yahoo.com/entertainment/hoda-kotb-gives-haley-joy-185300465.html"}, "fb": {"pages": 73756409831, "app_id": 458584288257241}, "al": {"android": {"app_name": "Yahoo", "package": "com.yahoo.mobile.client.android.yahoo", "url": "yahoo://article/view?uuid=1b19f5fb-b006-39b9-ab5e-540ecdbba645&src=web"}, "ios": {"app_name": "Yahoo", "app_store_id": 304158842, "url": "yahoo://article/view?uuid=1b19f5fb-b006-39b9-ab5e-540ecdbba645&src=web"}}}, "movies": [], "publish_date": 1508439180.0, "source": "https://www.yahoo.com", "summary": ""}