{"url": "https://lonewolfmag.com/ageism-in-hollywood/", "text": "At the time of filming Silver Linings Playbook Jennifer Lawrence portrayed a thirty-nine year old widow, but was herself barely old enough to drink legally in the US. Similarly, in Joy Lawrence played a women in her mid-forties, while in American Hustle she played a middle-aged love interest to a nearly forty year old Christian Bale. Strange as these casting decisions look, no one really noticed, let alone asked the burning question: why cast someone barely over her teens to play a woman in her mid-30s, especially when there are so very many talented older actresses sitting on the sidelines? It has become unheard of to cast an actual thirty-five year old to play a thirty-five year old onscreen. It would seem that pop culture is slowly killing off the adult female, effectively erasing any visual onscreen age differences between a woman pushing 20 and a woman pushing 40. The mature woman has all but disappeared from film.\n\nIt’s no secret that Hollywood has a serious problem with representation. There’s really only one way for a woman to look in Hollywood – white, usually blond, baby-faced and somewhere between 18 to 25 years old. There are no parts for actresses who fall outside of those absurdly narrow parameters. But it wasn’t always this way. During Hollywood’s Golden Age, starlets were revered for their woman-ness. There was a certain powerful comfort and elegance in their age that no amount of youthful charm could emulate. Back then it wasn’t about being sexy as much as it was about being sophisticated, and it’s harder to put an expiration date on sophistication. So, when did becoming a grown woman stop being aspirational? And what does this gaping representational void in the media mean for how we, as women, come to terms with the process of aging?\n\nThe age breakdown in Hollywood today goes something like this: If you’re a woman in her 20s, you’re good for pretty much any role (again, especially if you’re white and blonde). If you’re a woman in her 40s and 50s however, you’ll exclusively play grandmothers and witches, and if you’re unfortunate enough to be a woman in her 30s, you’re basically shit out of luck. As a 30-something year old actress you’re too young to play really old parts, and too old for everything else. In Hollywood it’s virtually unheard of for a 35 year old to actually play a 35 year old onscreen.\n\nWhy is a 40 year old man allowed to be merely human onscreen, while she must forever retain her mystical impossibility, a level of angel-like perfection only attainable by those who have only recently lost their baby teeth?\n\nWhen at 28 years old Olivia Wilde auditioned for the role of Leonardo DiCaprio’s wife in Wolf of Wall Street, she was dismissed for being “too old” for the part, despite the fact that she was over a decade younger than Leo. The film’s producers chose to cast 22 year old Margot Robbie for the role instead. Scarlett Johansson was just 19 years old when she played a young married woman opposite 55 year old Bill Murray in Lost in Translation, while Maggie Gyllenhaal was, at 37 years old, turned down for a role because she was deemed “too old to play the lover of a man who was 55.”\n\nWe see this kind of age bias between leading men and their female costars literally everywhere. It’s business as usual…except, of course, for the young women who are essentially forced to play opposite men old enough to be their fathers. When 22 year old Kristen Stewart dropped her leading role in Focus because she was uncomfortable about the age difference between herself and her 44 year old co-star (and love interest) Will Smith, the news was completely dismissed. No one saw anything unusual about the onscreen pairing, nor did they note the disturbing ageist subtext in Stewart’s discomfort. It was business as usual in Hollywood.\n\nWhat is the underlying message here? That strength and maturity of any kind in a woman isn’t sexy. That an aging woman has no value at all unless she remains fuckably innocent. That a woman older than 25 is no longer a woman at all, but an asexual phantom to be pitied for her loss of collagen rather than admired for any acting abilities. Why is a 40 year old man allowed to be merely human onscreen, crumpled and imperfect, while she must forever retain her mystical impossibility, a level of angel-like perfection only attainable by those who have only recently lost their baby teeth.\n\nKatharine Hepburn was 42 years old when she played in Adam’s Rib, a romantic comedy with heavy feminist undertones that brought us lines like, “There are lots of things that a man can do and in society’s eyes, it’s all hunkey-dory, but when a woman does the same thing she’s an outcast.” Similarly, at the age of 50 Hepburn starred in Desk Set, a movie in which the actress was romantically pursued by two male leads. In both movies Hepburn not only plays a strong and well-rounded female protagonist, she embodies a wonderfully, glamorously, mature woman. Today, she would be deemed too old for both parts.\n\nSimilarly, Bette Davis was 34 years old when she gave birth to the makeover genre in Now Voyager (1942). In the film Davis’s transformation goes far beyond the typical stereotypes we usually associate with the genre today. Her metamorphosis from insecure girl to confident self-possessed woman truly embodies what it means to grow older, stand up to those who try to dominate you and take control over your own life. Her’s is the kind of character that shows how age can come with it’s own brand of personal power, and it’s precisely the kind of character we never see in film anymore. If Now, Voyager were filmed and cast today, the lead would very likely be played by a teenager.\n\nToday, women in their late 30s and beyond are slowly fading from view. We don’t see them in starring roles, we don’t see them on ads and they’re certainly not opening any shows at fashion week. If we were to go on media presence alone, you would have to assume that women showing any signs of aging whatsoever are more offensive than even the worst kind of violence. The latter gets way more airtime in film and advertising. And in this too representation is critically important because studies reveal that humans are by nature more aggressive towards the things they do not recognize as familiar. One of the best ways to reset the way people feel about anything is to change the way that thing is represented in the media\n\nWomen over 40 make up 39 percent of the total female adult population in the United States. Ignoring them is like manufacturers choosing to produce shoes up to size 6, or restaurants only serving baby formula. Given the staggering market size, it’s impossible to chalk this industry-wide casting aside of older women to anything other than cruelly sexist beauty standards.\n\nAnd it doesn’t stop in Hollywood either. If you’re very young it’s a question of who you’re going to grow into, and how you will feel when you inhabit your own skin on your 30th birthday. And if you’re already over 30, it’s about the creeping feeling that human beings who look like you are already fading from view. By consistently casting extremely young actresses to play mature women we are not only infantaizing women and eroticizing that infancy, not to mention setting extremely negative expectations for what mid-life should look like for a woman. Even Jennifer Lawrence herself won’t be immune to this kind of ageism, and will be phased out of the best roles by the time she is 31.\n\nThere are approximately 97 million people over the age of 44 in America. Women in that age group make up 39 percent of the total female adult population in the United States. Ignoring them is like manufacturers choosing to only produce shoes up to a size 6, or restaurants only serving baby formula. Given that staggering market size of women over 40, it’s impossible to chalk this industry-wide casting aside of older women to anything other than cruelly sexist beauty standards.\n\nSo how did we get here? There simply aren’t enough female decision-makers in Hollywood. Everyone from the producers to the casting directors is predominantly male, and male Hollywood executives are not exactly tuned into the needs of their female demographic. Unless they’re filming a romance, the target audience is predominantly male. Consider the last time you saw a movie starring middle aged women making important world-altering decisions, like in The Big Short, or going on epic adventures, like in The Secret Life of Walter Mitty, or being badass and fighting evil, like in the James Bond films, or just doing a bunch of really cool risky shit like in Ocean’s 11. By and large, women are the arm candy, they’re not in the movie to make important decisions, or save anyone, they’re there to look good. That’s it.\n\nWe need new role models…hell, as I get older I need new role models. I need to see actors like Ingrid Bergman and Katharine Hepburn, I want to see stories told about the lives of women beyond their quarter-life crisis years. I need to feel like, the more distance life puts between me and the day I was born the more, not less relevant I become. It’s a scary feeling knowing that you’ve come so far only to become culturally invisible simply because Hollywood deems women your age unsexy.\n\nTo age, to mature, to grow into your skin is part of the process of becoming the person you were always meant to be. By diverting precious energy from that natural growth process to focus instead on maintaining any semblance of youth, you sacrifice a critical sense of self. This is the natural trajectory of identity formation. We all start off as clean slates, moldable, open to suggestion, only to become more and more truly ourselves as we age, shedding our naiveté and childish passivity along with our youth. In the words of Amy Poehler, “It takes years for a woman to unlearn what you have been taught to feel sorry for.”\n\nA fully formed mature woman is at the peak of her sense of self. She is literally the best self she will ever be – she is less likely to be pushed around, she knows what she needs to be happy and how to negotiate for those things. What are we telling young women when we suppress this incredibly vibrant and important phase in a woman’s life, writing it off as unimportant because of, what, a few wrinkles?\n\nI know there’s this collective itch to write all this off as unimportant (it’s just Hollywood, let’s just all chill out) but the stories we produce as a culture are incredibly powerful. Our stories give us a sense of identity as a species. Without them we have no history, no sense of place, and no sense of destiny. Think about it. The only reason we know to aspire to anything at all is because of the stories we’ve been told about regular people who, against all odds, built an extraordinary life for themselves. The only reason you love what you love, (art, fashion, entrepreneurship, graphic design etc) is because somewhere along the way, you heard or saw a story about it that touched your heart.\n\nOur stories matter more than many of us realize. They help shape our reality. And it’s vital that we hear the stories of all kinds of people, the young and old, rich and poor, the ordinary and the extraordinary. As it stands today, Hollywood tells only one story: that the most exciting things only happen to men, that being a grown woman means being culturally irrelevant, that a man can be anything he damn well wants to be, but a woman’s whole existential worth hinges on her fuckability, and that with age a woman ceases to matter at all. There are so many stories still left to be told.", "images": ["https://static-wp.lonewolfmag.com/buy-lone-wolf.jpg", "https://static-wp.lonewolfmag.com/katherine-hepburn.jpg", "https://static-wp.lonewolfmag.com/ingrid-bergman-1.jpg", "https://static-wp.lonewolfmag.com/bette-davis.jpg", "https://secure.gravatar.com/avatar/0ce905a87b1e7cc4b126e72cfc580e9c?s=56&d=mm&r=g", "https://static-wp.lonewolfmag.com/look-alike-actresses2-700x474.jpg", "https://secure.gravatar.com/avatar/2a68dd72b1b831c8ee530255f64766da?s=56&d=mm&r=g", "https://secure.gravatar.com/avatar/1855c43d67a89e046d75c75d1be80e5a?s=56&d=mm&r=g", "https://static-wp.lonewolfmag.com/a37c19c3135c444e6512fb83c47231e4.jpg", "https://static-wp.lonewolfmag.com/katharine-700x295.jpg", "https://static-wp.lonewolfmag.com/lw-cover-13.jpg", "https://static-wp.lonewolfmag.com/2b2948dcdd23578f720bc658b4bd3a0c.jpg", "https://secure.gravatar.com/avatar/32e331a128e09d92f970836da31135d2?s=56&d=mm&r=g", "https://secure.gravatar.com/avatar/1f1f32b0fc1ea79aea4e36974c7caf15?s=164&d=mm&r=g", "https://static-wp.lonewolfmag.com/liz-taylor.jpg", "https://static-wp.lonewolfmag.com/food-editorial-title-3-320x380.jpg", "https://static-wp.lonewolfmag.com/photoshoot-ideas-title-320x380.jpg", "https://static-wp.lonewolfmag.com/aging-in-hollywood-200x200.jpg", "https://secure.gravatar.com/avatar/1f1f32b0fc1ea79aea4e36974c7caf15?s=56&d=mm&r=g", "https://secure.gravatar.com/avatar/543458398ae73763b87ffd74965403f6?s=56&d=mm&r=g", "https://static-wp.lonewolfmag.com/city2-1-320x380.jpg", "https://secure.gravatar.com/avatar/dd8ed2e3370b9170f74b291582bb0c0a?s=56&d=mm&r=g"], "top_img": "https://static-wp.lonewolfmag.com/aging-in-hollywood-200x200.jpg", "keywords": [], "authors": ["Natalia Borecka"], "canonical_link": "https://lonewolfmag.com/ageism-in-hollywood/", "title": "Age in Crisis, How Hollywood Killed Female Adulthood", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no", "apple-mobile-web-app-capable": "yes", "apple-touch-fullscreen": "yes", "HandheldFriendly": "True", "msapplication-TileImage": "https://static-wp.lonewolfmag.com/cropped-favacon-logo1.png", "og": {"title": "Age in Crisis, How Hollywood Killed Female Adulthood", "description": "At the time of filming Silver Linings Playbook Jennifer Lawrence portrayed a thirty-nine year old widow, but was herself barely old enough to drink legally in the US. Similarly, in Joy Lawrence played a women in", "image": {"identifier": "https://static-wp.lonewolfmag.com/older-actresses-title.jpg", "width": 800, "height": 600}, "url": "https://lonewolfmag.com/ageism-in-hollywood/", "type": "article", "site_name": "Lone Wolf Magazine", "updated_time": "2017-04-04T23:39:11+00:00"}, "article": {"author": "https://www.facebook.com/natalia.borecka.923", "publisher": "https://www.facebook.com/lonewolfmag/", "published_time": "2016-11-03T18:30:20+00:00", "modified_time": "2017-04-04T23:39:11+00:00"}, "twitter": {"card": "summary_large_image", "title": "Age in Crisis, How Hollywood Killed Female Adulthood", "description": "At the time of filming Silver Linings Playbook Jennifer Lawrence portrayed a thirty-nine year old widow, but was herself barely old enough to drink legally in the US. Similarly, in Joy Lawrence played a women in", "image": "https://static-wp.lonewolfmag.com/aging-in-hollywood.jpg", "site": "@lonewolfmag", "creator": "@https://twitter.com/nataliaborecka"}, "description": "At the time of filming Silver Linings Playbook Jennifer Lawrence portrayed a thirty-nine year old widow, but was herself barely old enough to drink legally", "robots": "noodp", "generator": "Powered by Visual Composer - drag and drop page builder for WordPress."}, "movies": [], "publish_date": 1478197820.0, "source": "https://lonewolfmag.com", "summary": ""}