{"url": "https://lidblog.com/illegal-immigrant-mexican-kids/", "text": "It was June 2014 when the Washington Post reported that illegal immigrants, “including thousands of women and children, stream into south Texas. It was nine months late when the same paper reported that Obama’s border agents were tossing some of those kids into internment camps as an experiment.\n\nIt was called the Juvenile Referral Process, and it worried human rights groups Mexican officials who feared that it put the kids at risk. The program was the creation of Robert Harris who at the time U.S. Customs and Border Protection commander of the Laredo sector. Harris believed holding certain young Mexicans, believed to be working for cartels in detention serves to get these kids out of the smuggling enterprise. Believed is the operative word, There were no judges, no charges– no trial–just belief.\n\nHis intelligence analysts estimated that 78 percent of the guides smuggling other migrants were Mexicans younger than 18 — teenagers often hired or conscripted by drug cartels that knew they would not be prosecuted if caught — and he wanted to attack this loophole. Trending: How Can We Have Two Systems of Justice in This Country? “Why don’t we remove these juveniles from the smuggling cycle?” Harris, the outgoing commander of the Laredo sector of U.S. Customs and Border Protection, recalled thinking. take our poll - story continues below Trump or Biden, who will win? Why wait until November 3? Show all of America who you're voting for in 2020\n\nTRUMP or BIDEN You Decide * Donald J. Trump Joe Biden Undecided\n\nEmail *\n\nPhone This field is for validation purposes and should be left unchanged. Completing this poll grants you access to The Lid updates free of charge. You may opt out at anytime. You also agree to this site's Privacy Policy and Terms of Use. Now, as a result of that decision, young Mexicans are being held for months without charge in shelters across the United States, sometimes without their parents’ knowledge. Since the program began in May, 536 juveniles have been held — 248 of whom have been deported to Mexico after an average stay of 75 days, according to Border Patrol statistics. Mexican authorities say some of these repeat border-crossers have spent as much as six months in U.S. custody while they await an appearance before an immigration judge. During their detention, they are questioned by U.S. authorities and then transferred to a network of facilities run by the Office of Refugee Resettlement, part of the Department of Health and Human Services, across 15 states.\n\nLets put this in perspective, under Trump children are separated from their parents because they don’t want the kids going to jail with their parents. Under Obama, young illegal immigrants were put in “facilities” so they could be squeezed for any information they may or may not have about drug cartels.\n\n“Our concern is that the program’s real intent is to interrogate the kids,” said Maureen Meyer, an expert on Mexico and migrants at the Washington Office on Latin America (WOLA). The kids are “often questioned about the criminal groups they are working for and then subsequently returned to Mexico with no apparent concern about the implications for them.” While in custody last year [2014], one Mexican boy who worked as a guide shared information with U.S. authorities about the location of stash houses used by migrants as they move through the United States, according to his lawyer’s written summary of his case. When he returned to Mexico, he learned that armed men had forced their way into his home and killed a relative’s son. The men told the family that there had been raids on cartel hideouts and arrests and that they believed the boy was responsible. His half-brother was later killed by the same group. The boy, his lawyer said, has since been in hiding. Harris said the Border Patrol does not have a system to track what happens to the juveniles once they return to Mexico. The program does appear to be discouraging them from returning illegally to Texas, he said. The patrol calculates that just 7 percent of the children who have gone through the program has been picked up again crossing the border.\n\nBut the program was a surprise to Mexico\n\n“The moment it started, it took us all by surprise, because there wasn’t an announcement,” said Reyna Torres Mendívil, director general of the Mexican Foreign Ministry’s office for protection of Mexicans abroad. “Where were they taking these children?”\n\nRegarding preventing kids from becoming repeat offenders, the Juvenile Referral Process worked, But why is it okay to incarcerate kids based on a belief without a judge or knowledge of their parents? The only reason I can think of is that a program to detain kids is okay under a Democratic Party president, but preventing kids from going to jail with their parents is considered unAmerican when the president is a Republican.\n\nBelow is a video of an Illegal Immigrant child detention center published in July 2014.\n\n﻿\n\nNote: The picture in the post may or may not be of the Mexican children discussed above. Based on the Washington Post we know that the detention center in McAllen, TX was one of the locations used and July 2014 is during the active period of the Juvenile Referral Process.\n\nillegal immigrants\n\nillegal immigrants\n\nillegal immigrants", "images": ["https://lidblog.com/wp-content/plugins/api-by-klicked-master/assets/reverereport.png", "https://flagandcross.com/wp-content/uploads/2020/04/QhBf5DgR-200x160.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=22315475&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel/p-5uGb3auy8aqru.gif", "https://lidblog.com/wp-content/uploads/2020/04/flynn425-425x239-1-200x160.jpg", "https://trueconservativepundit.com/wp-content/uploads/2017/10/Greg-Laurie-devotion-2.jpg", "https://lidblog.com/wp-content/uploads/2018/06/2cd1h2.jpg", "https://lidblog.com/wp-content/uploads/2018/10/Whatfinger250x250.jpg", "https://lidblog.com/wp-content/uploads/2020/04/Screen-Shot-2020-04-16-at-9.15.18-PM-400x250.png", "https://lidblog.com/wp-content/uploads/2018/06/thelid-logo.png", "https://lidblog.com/wp-content/uploads/2020/04/flynn425-425x239-1-400x250.jpg", "https://rightwingtribune.com/wp-content/uploads/2019/05/Capture1474-200x160.jpg", "https://clashdaily.com/wp-content/uploads/2020/04/external-content.duckduckgo-3-1-200x160.jpg", "https://pixel.quantserve.com/pixel/p-52ePUfP6_NxQ_.gif", "https://lidblog.com/wp-content/uploads/2020/04/3wvu54-400x250.jpg", "https://lidblog.com/wp-content/uploads/2018/06/2cd1h2-1200x630.jpg", "https://lidblog.com/wp-content/uploads/2020/04/vernon-jones-endorses-trump-400x250.jpg"], "top_img": "https://lidblog.com/wp-content/uploads/2018/06/2cd1h2.jpg", "keywords": [], "authors": ["Jeff Dunetz"], "canonical_link": "https://lidblog.com/illegal-immigrant-mexican-kids/", "title": "Obama Administration Kept Illegal Mexican Kids In Detention Camps As “Experiment”", "meta_data": {"fb": {"pages": 961038380624167, "app_id": 1642164452726811}, "description": "Obama's border agents were tossing some child illegal immigrants into internment camps as an experiment, without charges, judges, or a trial", "robots": "noimageindex", "og": {"locale": "en_US", "type": "article", "title": "Obama Administration Kept Illegal Mexican Kids In Detention Camps As \"Experiment\"", "description": "Obama's border agents were tossing some child illegal immigrants into internment camps as an experiment, without charges, judges, or a trial", "url": "https://lidblog.com/illegal-immigrant-mexican-kids/", "site_name": "The Lid", "updated_time": "2018-06-17T12:24:26+00:00", "image": {"identifier": "https://lidblog.com/wp-content/uploads/2018/06/2cd1h2.jpg", "secure_url": "https://lidblog.com/wp-content/uploads/2018/06/2cd1h2.jpg", "width": 600, "height": 338}}, "article": {"publisher": "https://www.facebook.com/jeffrey.dunetz", "author": "https://www.facebook.com/jeffrey.dunetz", "section": "Crime", "published_time": "2018-06-17T01:59:11+00:00", "modified_time": "2018-06-17T12:24:26+00:00"}, "twitter": {"card": "summary_large_image", "description": "Obama's border agents were tossing some child illegal immigrants into internment camps as an experiment, without charges, judges, or a trial", "title": "Obama Administration Kept Illegal Mexican Kids In Detention Camps As \"Experiment\"", "site": "@yidwithlid", "image": "https://lidblog.com/wp-content/uploads/2018/06/2cd1h2.jpg", "creator": "@yidwithlid"}, "generator": "WordPress 5.3.2", "viewport": "initial-scale=1,maximum-scale=1,user-scalable=no", "onesignal": "wordpress-plugin", "googlebot": "noimageindex"}, "movies": ["https://www.youtube.com/embed/6UhnHxyn4hU"], "publish_date": 1529200751.0, "source": "https://lidblog.com", "summary": ""}