{"url": "http://www.newslocker.com/en-us/news/celebrity/peta-murgatroyd-maksim-chmerkovskiy-and-heather-morris-shocking-dancing-with-the-stars-elimination-is-awful/", "text": "Gage Edward Talks About How He Is Parenting Daughter Monroe After Split from Jeff Lewis Gage Edward is opening up about how he is parenting his 3-year-old daughter Monroe as a single father.\n\nEdward gave a rare public address during an Instagram Live on Friday amid his tumultuous custody battle with ex Jeff Lewis and discussed his relationship with Monroe, sharing that it’s “an amazing thing to watch” her learn and grow.\n\n“I think it’s just interesting to watch how a kid learns. I think that Monroe’s smart,” the former Flipping Out star, 35, Read more\n\nVanessa Bryant Shares Emotional Tribute to Late Daughter Gianna After Her WNBA Honor Vanessa Bryant is bursting with pride as she celebrates her late daughter Gianna Bryant‘s honorary draft into the WNBA.\n\nNearly three months after the tragic helicopter crash that killed Gianna, her father Kobe Bryant and seven others, the 13-year-old and her two Mamba Academy teammates Alyssa Altobelli and Payton Chester, who also died in the crash, were named honorary picks during the WNBA draft on Friday.\n\nOn Saturday, Vanessa, 37, posted an emotional tribute to Gianna, sharing how proud Read more\n\nWatch 'One World' Special for Free at Home - Live Stream Video! The day has come for the One World: Together at Home special and you can watch the live stream video right here!\n\nThe eight-hour marathon begins with six hours of content that is only being presented via the digital stream on YouTube, Facebook, Prime Video, and other places.\n\nAt 8pm EST, the television special hosted by Jimmy Kimmel, Stephen Colbert, and Jimmy Fallon will air on ABC, CBS, and NBC.Lady Gaga curated the special for Global Citizen and the World Health Organization and she got an inc Read more\n\nVictoria Beckham Celebrates a 'Stranger Birthday Than Usual' at Home amid Coronavirus Pandemic Victoria Beckham is spicing up another year of life!\n\nThe former Spice Girl singer celebrated her 46th birthday on Friday, and expressed how she’s feeling grateful to be surrounded by family as her husband David Beckham and three of their four kids are self-isolating together in their U.K. home.\n\nBeckham documented her special day on social media, sharing with fans that she went for a family bike ride, hosted a virtual dance party on Instagram Live and topped off the evening with a chocolate Read more\n\nSam Smith Shares Thoughts on Demi Lovato's New Boyfriend! Sam Smith is opening up about getting to know Demi Lovato‘s new boyfriend Max Ehrich!\n\nThe 27-year-old singer was a guest on Andy Cohen‘s SiriusXM radio show on Friday (April 17) and they talked about getting to meet Max over FaceTime this week.\n\n“We met last night, actually on FaceTime,” Sam said. “We all went live.”\n\nAndy asked Sam if they approve and the response was, “I don’t know — I haven’t met them [in person]. I don’t know a Read more\n\nGabrielle Union Rocks a Bikini for Poolside Photo Shoot by Zaya Wade! Gabrielle Union has shared some great photos that were taken by her step-daughter Zaya Wade by the pool at their house!\n\nThe 47-year-old actress put her fit figure on display while wearing a bikini for the sunset photo shoot.\n\n“Time for the Wine Down! Cheers to the weekend good people,” Gabrielle wrote on Instagram. She is seen drinking wine created by her husband Dwyane Wade‘s label D Wade Cellars. You can get your own bottle here!\n\nAfter the photo shoot, Gabrielle and the famil Read more\n\nTom Brady and Gisele Bündchen Fund Over 10 Million Meals amid Coronavirus Pandemic Tom Brady and Gisele Bündchen are doing their part to help those in need during the coronavirus (COVID-19) pandemic.\n\nThe NFL star, 42, partnered with Wheels Up to donate 10 million meals to Feeding America, he announced earlier this month. “Happy to support those in need and we all must continue to support each other,” Brady wrote on his Instagram Story Friday.\n\nBündchen, 39, also spoke about giving back and supporting others amid the global health crisis. “I’ve Read more\n\nGaga's 'One World' Special - Full Performers Lineup & Schedule Revealed! Lady Gaga is working with Global Citizen and the World Health Organization to curate the One World: Together at Home special and here is the full lineup of performers who are participating!\n\nThe special was initially going to be just a two-hour special on television, but so many stars joined the lineup that it grew into an eight-hour marathon.\n\nThe first six hours of the special are going to be live streamed on YouTube while the main show will begin at 8/7c\n\nGlobal Citizen has revealed a schedule Read more\n\nAndy Cohen Says Lockdown Is Longest He's Gone Without Sex Andy Cohen is revealing a pretty candid detail about his sex life… well, rather a lack of it right now.\n\nThe 51-year-old Watch What Happens Live host says that the five weeks he’s been in lockdown because of the ongoing health crisis marks the longest he’s gone without sex since college.\n\nAndy and Kelly Ripa discussed their love lives during an appearance on friend Bruce Bozzi‘s Radio Andy show Quarantined with Bruce.\n\n“This is the longest I’ve gone since colle Read more\n\nSean Penn Pictured Getting a Coronavirus Test at His Organization's Testing Center Sean Penn tilts his head back as he prepares to be given a coronavirus test at an outdoor testing facility on Friday (April 17) in Malibu, Calif.\n\nBefore you start wondering why Sean has access to a test while many people are still having trouble getting one… he has been working daily on the frontlines of the virus to set up testing centers around Los Angeles.\n\nSean and his organization CORE (Community Organized Relief Effort) have sponsored several testing centers and he has been on-site Read more\n\nVanessa Bryant Reveals Details About Kobe & Gigi Bryant WNBA Advocacy Award Kobe and Gianna Bryant are being immortalized by the WNBA in a big way.\n\nDuring the WNBA draft on Friday (April 17), it was revealed that there will be a new scholarship award for a future player on the league named for Kobe and his daughter, Gianna, who both passed away in January.\n\nIt will be called the Kobe & Gigi Bryant Advocacy Award.\n\nThe release, shared by Vanessa Bryant, reveals that the award will be presented to “a tireless advocate for women’s basketball and foster the h Read more\n\nSophie, Countess of Wessex, Cooks Meals For NHS Workers Amid Coronavirus Pandemic Sophie, Countess of Wessex, is giving back to the NHS by cooking them meals!\n\nThe 55-year-old royal and wife of Prince Edward, Earl of Wessex, volunteered in the kitchens of hospitality group Rhubarb earlier this week and made meals for frontline workers.\n\n“We were humbled and delighted to welcome HRH Countess of Wessex @RoyalFamily to rhubarb yesterday,” the company shared on Twitter with a few pics of Sophie cooking up some pasta.\n\nThey added, “Together we cooked thousands of m Read more\n\nKatie Holmes Wishes Suri Cruise A Happy Birthday With Sweet Instagram Post Katie Holmes shared the sweetest birthday wish for her daughter Suri Cruise.\n\nThe 41-year-old actress hopped on social media with her birthday wishes for Suri, who turns 14 on Saturday, April 18.\n\n“💕Happy Birthday Sweetheart!!!!!!! 💕 I am so blessed to be your mom. May this year be incredible! 💕💕💕💕,” Katie wrote with an image of a banner spelling out “Happy Birthday”.\n\nSuri lives full time with Katie, and gushed about her in a Read more\n\nHugh Jackman Shares Cute Story of His & Wife Deborra Lee-Furness's First Date Hugh Jackman takes his dogs on a brief walk around the block in new York City on Friday (April 17).\n\nThe 51-year-old actor joined his family later on in the day as they loaded up some essentials and bags to a car before heading to their home in The Hamptons.\n\nPHOTOS: Check out the latest pics of Hugh Jackman\n\nHugh also appeared on The Tonight Show with Jimmy Fallon, and shared a fun story of his first date with wife, Deborra Lee-Furness.\n\nTurns out that Deborra had gotten a call from a girlfriend w Read more\n\nHailey Bieber Reacts To Sister Alaia's Pregnancy Announcement & Gender Reveal: 'Screaming!!!!' Hailey Bieber is celebrating her sister Alaia‘s pregnancy announcement!\n\nThe 23-year-old model was one of the first to comment on Alaia‘s Instagram, where she showed off her growing baby bump with husband Andrew Aronow kissing it.\n\n“I made something extra special for @andrewaronow’s birthday this year….. #BABYARONOW coming to ya August 2020,” Alaia captioned, along with revealing that the baby is a girl with a bunch of pink bow emojis.\n\nHailey reacted to the an Read more\n\nLady Gaga Calls Boyfriend Michael Polansky the 'Love of My Life' Lady Gaga isn’t afraid to declare her “Stupid Love”!\n\nThe pop star, 34, revealed her love for boyfriend Michael Polansky during an appearance on MSNBC’s Morning Joe on Friday, where she discussed the upcoming One World: Together At Home concert on Saturday night.\n\nWhile discussing mental health and the novel coronavirus (COID-19) pandemic with hosts Mika Brzezinski and Joe Scarborough, Gaga casually called Polansky the “love” of her life.\n\n“With Born This W Read more\n\nShailene Woodley Belts Out Karaoke Tunes With 'Endings, Beginnings' Co-Star Sebastian Stan Shailene Woodley and Sebastian Stan are karaoke buddies!\n\nThe 28-year-old actress shared a fun throwback video of the two showing off their singing chops during some downtime in filming Endings, Beginnings.\n\n“sometime around 3am during weekend 2 or 3 of filming, @imsebastianstan snuck us through some top secret doorway and … and … well,” Shailene wrote in the caption, recalling the fun night.\n\nSebastian and Shailene were heard singing “Hungry Eyes” from Dirty Read more\n\nJamie Dornan Reveals The Story Behind His Iconic Blue Instagram Jamie Dornan is opening up about his first ever Instagram post – the one of him covered in what looks like blue paint.\n\nSpeaking with Variety while promoting his new film, Endings, Beginnings, the 37-year-old actor revealed what was really going on with that image.\n\n“It was for a job. It wasn’t in the present,” Jamie explained. “It’s something that I had done in the past that I haven’t even shot yet, to be honest.”\n\nHe adds that it was an “excr Read more\n\nJonas Brothers & Billie Eilish Perform on John Krasinski's Virtual Prom for High School Grads The Jonas Brothers were looking sharp for John Krasinski‘s virtual prom tonight!\n\nThe 40-year-old Quiet Place star and host of Some Good News threw a virtual party, where he was the DJ, and invited some big celeb performers for the event, thrown in honor of the high school grads who are unable to attend their own due to school closings.\n\nWhile John tried his best to DJ, he admitted that he had no clue how to – before bringing in Nick, Joe and Kevin Jonas for a performance of “Su Read more\n\nSam Smith & Andy Cohen Share Thoughts on Dating Apps Sam Smith and Andy Cohen are getting candid about their thoughts on various dating apps and finding love on your phone.\n\nThe 51-year-old talk show host told Sam, 27, that he would set them up with the person at Tinder who makes verified profiles.\n\n“It’s kind of cool because I feel like I meet people that I wouldn’t normally meet, you know what I mean?” Andy said. Sam responded, “That’s what I like. When I date normally, I just date from being in bars and meetin Read more\n\nReese Witherspoon Looks Back at Her Arrest, Seven Years Later Reese Witherspoon is opening up about her arrest in 2013 in a new interview for Jameela Jamil‘s I Weigh podcast.\n\nThe Oscar-winning actress and her husband Jim Toth were arrested after he was pulled over by a cop under the suspicion of DUI. Reese was put into handcuffs on a disorderly conduct charge after she disobeyed an officer’s order to stay in the car. Jim pleaded guilty to first offense DUI.\n\nNow, seven years later, Reese is getting candid about that moment. Jameela praised her Read more\n\nReese Witherspoon and Lucy Hale Love to Wear This Hands-Free Bag Trend It’s no secret that we’re all trying to touch fewer things these days. That’s why it should come as no surprise that certain hands-free accessories, like fanny packs, have been on the uptick.\n\nRELATED: Reese Witherspoon, Jennifer Garner, and Taraji P. Henson All Agree on This Controversial Leggings Trend\n\nPeople certainly have their own opinions about the fanny pack, but the controversial throwback trend seems all the more relevant right now. And we’re not the only ones who Read more\n\nGianna Bryant, Alyssa Altobelli and Payton Chester Honored During WNBA Draft Gianna Bryant‘s dreams of being drafted into the WNBA came true on Friday, nearly three months after the tragic helicopter crash that killed the 13-year-old, her father Kobe Bryant and seven others.\n\nDuring the WNBA draft on Friday, commissioner Cathy Englebert named Gianna and her Mamba Academy teammates Alyssa Altobelli and Payton Chester, who also died in the crash, honorary draftees.\n\nEnglebert read out the three girls’ names just as she would announce any other draftee in a t Read more\n\nGianna Bryant Becomes Honorary Pick for WNBA Draft, Vanessa Bryant Gives Thanks Gianna Bryant, the 13-year-old daughter of Kobe Bryant, who perished alongside her father in a helicopter crash in January, has been made an honorary pick for the WNBA draft.\n\nThe upcoming basketball star was made an honorary pick alongside Alyssa Altobelli and Payton Chester, who also died in the helicopter crash on their way to a basketball game and clinic.\n\nWNBA Commissioner Cathy Engelbert began the draft with the tribute to the fallen stars.\n\n“They represented the next generation of sta Read more", "images": ["https://img.newslocker.com/2020/04/18/205344390_725.jpg", "https://img.newslocker.com/2020/04/18/205343235_725.jpg", "https://img.newslocker.com/2020/04/18/205344396_725.jpg", "https://img.newslocker.com/2020/04/18/205339055_725.jpg", "https://img.newslocker.com/2020/04/18/205344389_725.jpg", "http://www.newslocker.com/images/share-linkedin.png", "https://img.newslocker.com/2020/04/18/205344397_725.jpg", "https://img.newslocker.com/2020/04/18/205295865_725.jpg", "https://img.newslocker.com/2020/04/18/205344393_725.jpg", "https://img.newslocker.com/2020/04/18/205344387_725.jpg", "http://www.newslocker.com/images/share-twitter.png", "https://img.newslocker.com/2020/04/18/205344385_725.jpg", "https://img.newslocker.com/2020/04/18/205345208_725.jpg", "https://img.newslocker.com/2020/04/18/205344399_725.jpg", "https://img.newslocker.com/2020/04/18/205344386_725.jpg", "https://img.newslocker.com/2020/04/18/205344382_725.jpg", "https://img.newslocker.com/2020/04/18/205296608_725.jpg", "https://img.newslocker.com/2020/04/18/205334704_725.jpg", "https://img.newslocker.com/2020/04/18/205340976_725.jpg", "http://www.newslocker.com/images/newslocker-logo.png", "https://img.newslocker.com/2020/04/18/205344383_725.jpg", "https://img.newslocker.com/2020/04/18/205344392_725.jpg", "https://img.newslocker.com/2020/04/18/205344384_725.jpg", "https://img.newslocker.com/2020/04/18/205297947_725.jpg", "https://img.newslocker.com/2020/04/18/205344395_725.jpg", "http://www.newslocker.com/images/rss.png", "https://img.newslocker.com/2020/04/18/205344388_725.jpg", "http://www.newslocker.com/images/newslocker-cube.png", "https://img.newslocker.com/2020/04/18/205344394_725.jpg", "https://img.newslocker.com/2020/04/18/205345902_725.jpg", "https://static.addtoany.com/buttons/share_save_120_16.gif", "https://img.newslocker.com/2020/04/18/205344398_725.jpg", "http://akns-images.eonline.com/eol_images/Entire_Site/2017227/rs_600x600-170327073535-600-1.nick-dwts-2.ch.032717.jpg?downsize=450:*&crop=450:350;left,top", "http://www.newslocker.com/images/share-facebook.png", "https://img.newslocker.com/2020/04/18/205339054_725.jpg", "https://img.newslocker.com/2020/04/18/205340596_725.jpg"], "top_img": "http://akns-images.eonline.com/eol_images/Entire_Site/2017227/rs_600x600-170327073535-600-1.nick-dwts-2.ch.032717.jpg?downsize=450:*&crop=450:350;left,top", "keywords": [], "authors": [], "canonical_link": "https://www.newslocker.com/en-us/news/celebrity/peta-murgatroyd-maksim-chmerkovskiy-and-heather-morris-shocking-dancing-with-the-stars-elimination-is-awful/", "title": "Peta Murgatroyd: Maksim Chmerkovskiy and Heather Morris' Shocking Dancing With the Stars Elimination Is \"Awful\"", "meta_data": {"description": "He got it, the right stuff: Nick Viall has some serious boy band dance moves. The Bachelor star did the jive with Peta Murgatroyd to The Beach Boys' Fun, Fun, Fun and received a 28...", "og": {"title": "Peta Murgatroyd: Maksim Chmerkovskiy and Heather Morris' Shocking Dancing With the Stars Elimination Is Awful - Celebrity news - NewsLocker", "description": "He got it, the right stuff: Nick Viall has some serious boy band dance moves. The Bachelor star did the jive with Peta Murgatroyd to The Beach Boys' Fun, Fun, Fun and received a 28...", "type": "website", "url": "https://www.newslocker.com/en-us/news/celebrity/peta-murgatroyd-maksim-chmerkovskiy-and-heather-morris-shocking-dancing-with-the-stars-elimination-is-awful/", "image": "http://akns-images.eonline.com/eol_images/Entire_Site/2017227/rs_600x600-170327073535-600-1.nick-dwts-2.ch.032717.jpg?downsize=450:*&crop=450:350;left,top", "site_name": "Newslocker"}, "fb": {"admins": 1335791813}, "robots": "index", "google-site-verification": "wAInSoPxz3OEgOXCHtETx-x7ukmlX40FRoiPZpO7ww4", "msvalidate.01": "2F0DB39856FAA0E47C70E9E1FF8653AA"}, "movies": [], "publish_date": 1493128800.0, "source": "http://www.newslocker.com", "summary": ""}