{"url": "www.npr.org/templates/transcript/transcript.php?storyId=136284673", "text": "TERRY GROSS, host:\n\nThis is FRESH AIR. I'm Terry Gross.\n\nOur guest, actor Bradley Cooper, became widely known to film audiences last year, with the release of \"The Hangover.\" He starred with Ed Helms and Zach Galifianakis as a crude, wisecracking guy whose trip to Vegas with his buddies for a bachelor party goes very wrong.\n\nBefore that, he played the contemptible fiance of Rachel McAdams' character in \"Wedding Crashers,\" and earlier this year, he got his shot at a leading role in \"Limitless,\" where he played a struggling writer who takes a drug that dramatically expands his brainpower.\n\nThough Cooper's acquired an image as a Hollywood hunk, he's an honors graduate in English from Georgetown who didn't get into acting until after college, when he attended the Actors Studio in New York. He grew up in a suburb of Philadelphia, and when he showed up at our studio, he brought along his mom.\n\nCooper has reunited with most of the original cast of \"The Hangover\" for \"The Hangover Part II,\" where another crazy bachelors' weekend unfolds, this time in Thailand. Bradley Cooper spoke with FRESH AIR contributor Dave Davies.\n\nDAVE DAVIES, host:\n\nBradley Cooper, welcome to FRESH AIR.\n\nMr. BRADLEY COOPER (Actor): Thank you for having me.\n\nDAVIES: The heart of this, of course, is the relationship between you and Ed Helms and Zach Galifianakis. And I thought we'd listen to a scene from \"The Hangover,\" that's the first one.\n\nMr. COOPER: Great.\n\nDAVIES: And this is a moment when you've just gotten into Vegas for what will be a bachelor party couple of days, and you're there in the room with Stu, Ed Helms' character, who has this domineering girlfriend that your character, Phil, absolutely can't stand. And Stu announces to the group that - he pulls out a ring and says he's going to propose.\n\nAnd Doug, the groom, Justin Bartha, is there. And at the end, we'll hear Zach Galifianakis' character Alan come in. Let's listen.\n\n(Soundbite of film, \"The Hangover\")\n\nMr. COOPER: (As Phil) What the hell is that?\n\nMr. ED HELMS (Actor): (As Stu) What do you think it is?\n\nMr. COOPER: (As Phil) Well, if it's what I think it is, I think it's a big (BEEP) mistake.\n\nMr. HELMS: (As Stu) I'm going to propose to Melissa at your wedding, after the ceremony.\n\nMr. JUSTIN BARTHA (Actor): (As Doug) Stewie, congratulations.\n\nMr. HELMS: (As Stu) Thank you, Doug.\n\nMr. BARTHA: (As Doug) That's a beautiful ring.\n\nMr. HELMS: (As Stu) Yeah, it's my grandmother's. She made it all the way through the Holocaust with that thing. It's legit.\n\nMr. COOPER: (As Phil) I don't get it. Wait, have you not listened to anything I have ever said?\n\nMr. HELMS: (As Stu) Phil, we've been dating for three years. It's time. This is how it works.\n\nMr. COOPER: (As Phil) A, that is bull(BEEP); and B, she is a complete (BEEP).\n\nMr. BARTHA: (As Doug) Hey. That's his fiance.\n\nMr. COOPER: (As Phil) It's true. You know it's true. She beats him.\n\nMr. HELMS: (As Stu) That was twice, and I was out of line. She's strong-willed, and I respect that.\n\nMr. COOPER: (As Phil) Wow, wow. He's in denial. Not to mention she (BEEP) a sailor.\n\nMr. BARTHA: (As Doug) Hey, he wasn't a sailor. He was a bartender on a cruise ship. You know that.\n\nMr. HELMS: (As Stu) Guys, just, I'm standing right here. So I can hear everything that you're saying.\n\nMr. ZACH GALIFIANAKIS (Actor): (As Alan) Hey, guys, are you ready to let the dogs out?\n\nMr. COOPER: (As Phil) What, do what?\n\nMr. GALIFIANAKIS: (As Alan) Let the dogs out, you know, like who let the dogs out. Who? Who?\n\nMr. COOPER: (As Phil) Who brought this guy along?\n\nMr. BARTHA: (As Doug) Yes, Alan, we are ready to let the dogs out. Hey, congrats.\n\nMr. HELMS: (As Stu) Thank you.\n\n(Soundbite of song, \"Who Let the Dogs Out?\")\n\n(Soundbite of laughter)\n\nDAVIES: And that's from \"The Hangover\" with our...\n\nMr. COOPER: That plays well as a radio play.\n\nDAVIES: It does, doesn't it?\n\n(Soundbite of laughter)\n\nDAVIES: Our guest, Bradley Cooper, along with Ed Helms and Justin Bartha and Zach Galifianakis in \"The Hangover.\"\n\nNow, your character is a guy who's crude, self-confident, outgoing. He's the sort of leader, he's the guy if he found a rattlesnake in his Corn Flakes would say: Guys, we'll work with this.\n\n(Soundbite of laughter)\n\nDAVIES: That's not like you, huh?\n\nMr. COOPER: No, I would be - I wouldn't be so bold to say that I'm as at ease with myself in life as Phil is. Phil just has this sort of hermeneutic that causes him no stress. He really just knows what is and what isn't, and with that comes a tremendous amount of confidence and ease.\n\nAnd you could question his ethics. You know, he has an interesting moral compass. But the things that I - I love Phil, and I think he's the coolest guy. I'd say besides wanting to have fun and complain about his life, he will do anything for his friends, and that's clear, you know, especially in the second one. I mean, he just stays cool and has to try to figure a way out through the whole movie.\n\nAnd the wonderful thing about the first one is as crude as it was, if you boil the story down, these three guys just don't want a girl to miss her wedding day. That's it.\n\nYou know, so it's a very forgivable - there's sort of a very childlike, boyish quality to what these guys are doing, but it's so surrounded and peppered with these very sort of morose, lurid incidents. But at the crux, they just don't want a girl to miss her wedding day.\n\nDAVIES: Now, when Ed Helms was on the show, it was interesting to hear that, you know, one of the things in the first, in \"The Hangover\" is that Mike Tyson's tiger is in the bathroom, the hotel bathroom when you wake up. And you actually do have to work with a live tiger.\n\nMr. COOPER: Right.\n\nDAVIES: And it's Ed that goes in and delivers the meat to the tiger in the bathroom to drug him.\n\nMr. COOPER: That's right.\n\nDAVIES: You didn't have to deal with the tiger?\n\nMr. COOPER: No, we all had to deal with the tiger. In fact, I think I had the riskiest move. One of the stills that never made it into the edit of the movie was the tiger at the party the night before, hanging out with everybody.\n\nSo we shot these stills, and there was one still where they wanted somebody to feed the tiger. And I for some reason said I'd do it. And so I had - it was a baby's, you know, a binkie with a bottle, and it was chicken blood, and I was literally putting it - and the trainer said to me: Now, in order to feed a tiger, you have to press your hand up against its mouth because if you don't, it won't know where your hand is, and it'll try to bite it.\n\nSo if you at all, you know, loosen up on the tension pressing against its mouth, it's going to do that. So it's this weird sort of illogical move that you do that you're actually pushing into the tiger's snout, I guess, or whatever you would call it, nose and teeth while it's sucking on this binkie.\n\nI was terrified. But I was petting it. I got to pet it, actually, as I did that, which was kind of cool to actually really feel - it was a female. She was 15 years old.\n\nNow, she was pretty tame. I mean, that said, let's qualify it, not tame at all. She's a tiger. But there were two younger tigers whenever she would get tired or something, and they were just completely out of control. I could have never done that to those tigers.\n\n(Soundbite of laughter)\n\nDAVIES: Now, the animal in \"The Hangover Part II\" is a monkey.\n\nMr. COOPER: Yeah, oh, God love her, Crystal, who I worked with six years prior in a movie called \"Failure to Launch,\" if you can believe that.\n\nDAVIES: Wow.\n\nMr. COOPER: Yeah.\n\nDAVIES: Reunited with a monkey.\n\nMr. COOPER: Reunited with Crystal, who, God, she's gotten better.\n\n(Soundbite of laughter)\n\nDAVIES: But no mishaps with the monkey, no scratches, bites...\n\nMr. COOPER: Oh, I got tons of scratches. I mean, as you could tell, Phil and the drug-dealing monkey become quite close physically throughout the movie. And we sort of liked this idea of, like, for some reason it just gravitates towards Phil, and Alan loves the monkey and loves Phil. So it's this weird thing.\n\nDAVIES: Right, Phil your character.\n\nMr. COOPER: Phil, yeah, the character I play. And there was this one scene, where we were in the streets of Bangkok, and there was an elephant as an extra in the background. Now, a monkey and an elephant, you know, hopefully the two will never meet because every time that elephant came within 10 to 15 feet, Crystal would just claw into my shoulder. I mean, I was like bleeding, and I mean, I had scars the entire time I was doing the movie. And we kept saying: She has her shots, right?\n\nDAVIES: Wow.\n\nMr. COOPER: Yeah, it was pretty intense.\n\nDAVIES: Our guest is Bradley Cooper. He stars in the new film \"The Hangover Part II.\"\n\nSo you grew up in a Philly suburb, and I think a lot of people who see you in \"The Hangover\" and some of your other roles would assume that you were the most popular guy at school, charming, self-assured. Was that you?\n\nMr. COOPER: No, and my mother would beg to disagree, but not at all. In fact, quite the opposite.\n\nYou know, look, I had great parents and a wonderful upbringing, but like many adolescents, was stuck in my head for most of that period of time worrying about who - you know, if I'm cool, what I'm supposed to be like, how I'm supposed to sound, what is it to be a man, what's happening in my body, you know, girls, mind-altering substances, all that kind of stuff, how to escape, basically, in order to feel better, you know, never really feeling like I fit into a group, a clique, very empathetic as a kid, throughout my whole life, which has really been a wonderful asset. But it's tough when you're so empathetic, sort of living in a high school environment.\n\nDAVIES: Yeah, that's not a high school male trait that's valued particularly.\n\nMr. COOPER: No, not really, yeah.\n\nDAVIES: Now, you went to - you did a year of college at Villanova, which is in the Philly area, and then went to Georgetown.\n\nMr. COOPER: That's right.\n\nDAVIES: Finished there, got a degree in English. And I read that you did no drama there. You didn't want to be in front of an audience?\n\nMr. COOPER: Well, I always was scared, as you can tell by the way I describe my mental state in high school. The idea of being in front of people terrified me. That said, I always knew I wanted to be an actor. So in there lies a huge dilemma.\n\n(Soundbite of laughter)\n\nDAVIES: Yeah.\n\nMr. COOPER: I remember I did senior skits. That was one thing I did in high school, the only thing. And then when I got to college, you couldn't even minor in theater at Georgetown. There was no theater program.\n\nThere were two theater troupes, the Nomadic Theatre Company and then another theater company called The Mask & Bauble. I also didn't feel at all comfortable with the theater crowd as I saw it when I was in high school. I never felt any connection to those students, and so too was it true in Georgetown.\n\nDAVIES: Why?\n\nMr. COOPER: I don't know. I felt like I just had nothing in common with them. Maybe I was intimidated by them. To me, they seemed very theatrical. In the years, I was a lover of film. Film is what was my avenue into acting. So I didn't even know anything about theater, and they were much more theater-oriented.\n\nBut then there was this group called the Nomadic Theatre Troupe that I kind of felt like okay, I can jive with these guys. So I auditioned for some plays. And I played Azolan the servant in \"Dangerous Liaisons.\" It was the first thing I had done. And then \"Camino Real,\" the play by Tennessee Williams, I played Casanova.\n\nDAVIES: You applied to the Actors School at the New...\n\nMr. COOPER: Yeah, the Actors Studio MFA program, yeah, which is not at Pace University, but was at the New School when I applied.\n\nDAVIES: And this is the one that people know from the public TVs with James...\n\nMr. COOPER: Lipton, right.\n\nDAVIES: Yeah, right, right. And I read that to do the audition to get in, you got a professor from Georgetown...\n\nMr. COOPER: A priest, yeah.\n\nDAVIES: To drive up to New York to do a...\n\nMr. COOPER: A Carmelite priest named Andrew Skanikki(ph), who I had had three courses with and became a great friend of mine. But, you know, a prerequisite was that you'd have to pass this audition-like scene. So I asked Andrew if he would - I said: What if we do the scene from \"Mass Appeal,\" where he plays a monsignor, a drunk monsignor who hits his deacon, and it's a great scene.\n\nAnd so he and I took a train from D.C. to New York and walked down to the New School on 12th and Sixth Avenue, and then we auditioned. And then we went to the Triple Crown bar, drank our butts off, and then got on the train and came back. It was great.\n\nDAVIES: And you got in.\n\nMr. COOPER: And I got in.\n\nDAVIES: And after you had some success in your career, you went back and did a guest appearance with James Lipton and the Actors Studio.\n\nMr. COOPER: That's right, yeah.\n\nDAVIES: And I've watched that, and you're - it's a very emotional reunion for you.\n\nMr. COOPER: Yeah, it really is.\n\nDAVIES: And what was interesting that you said that your teacher there, Elizabeth Kemp I believe, you could almost - you had trouble getting the words out, but I believe you said that in her class was the first time you ever felt comfortable.\n\nMr. COOPER: Yes, she taught me how to relax. Yeah, that's true. She's incredible. And I was so happy to be able to - for people to even hear that, people in the audience and for you to hear that because she's really an incredible teacher.\n\nShe was my basic technique teacher. It was a three-year program. And that year was all about using what has happened in your life as tools to enter into do an imaginary circumstance and play an imaginary character.\n\nAnd I thought: Oh, you mean, like, all these insecurities that I have, all of these things that I thought or things I'd have to hide are actually ammunition? They're actually, you know, nutrition for this work. It was mind-blowing.\n\nDAVIES: So you actually got your first movie role I think while you were still in school, \"Wet Hot American Summer,\" where you played a gay camp counselor, and you had a sex scene with Michael Ian Black.\n\nMr. COOPER: Yeah.\n\nDAVIES: And you got a lot of TV work, and you kind of developed your craft. You had a recurring role on \"Alias\" opposite Jennifer Garner.\n\nMr. COOPER: I was actually a series regular on that, yeah. I shot the pilot, and that was a huge break. That was basically where I was sort of piecemealing checks together from jobs to - wow, you can actually maybe put down a mortgage on a small house. And, you know, you're making a paycheck every week, and you know you're going to make 22 episodes. And it was like: Wow, I can actually make a living as an actor.\n\nIt was pretty incredible. I could pay off my student loans.\n\nDAVIES: And then comes \"Wedding Crashers,\" 2005, and your character is the obnoxious fiance of Rachel McAdams, the guy that Owen Wilson, you know, hopes to woo in the film.\n\nYour guy's character's name is Sack Lodge. He is such a jerk. And we're going to listen to a little piece of the film. This is a moment where your character, Sack Lodge, has actually - he's sick in the bathroom because the Owen Wilson character has slipped something into his drink, and Rachel McAdams comes upon him bent over the toilet. Let's listen.\n\n(Soundbite of film, \"Wedding Crashers\")\n\n(Soundbite of music)\n\nMs. RACHEL McADAMS (Actor): (As Claire Cleary) Oh, no. Are you okay?\n\nMr. COOPER: (As Sack Lodge) Well, Claire, my head's buried in a toilet. What do you think? Why don't you do the math, okay?\n\nMs. McADAMS: (As Claire) Honey, it's okay to be vulnerable sometimes. It's just me.\n\nMr. COOPER: (As Sack) Yeah, you can just cut that psychobabble (BEEP) that your mom tells you, okay?\n\n(Soundbite of laughter)\n\nMs. McADAMS: (As Claire) Right.\n\nMr. COOPER: (As Sack) Hey, you want to help me out? Do you? Do you, kid? Why dont you go get me a 7-Up, okay? All right? Because I think I might get vulnerable again.\n\nDAVIES: And that's our guest Bradley Cooper from \"Wedding Crashers,\" being quite the jerk.\n\nMr. COOPER: What a jerk.\n\nDAVIES: Yeah, what a jerk.\n\nMr. COOPER: Oh, my God, wow. It's so great. I mean, she's just trying to help him, and it's so psychotic. There's nothing malicious at all.\n\nDAVIES: And that demonic cackle that you have there, right. I'm going to - I mean this as a compliment when I say that when I saw you in \"The Hangover,\" at some point, somebody said: Yeah, he was the guy in the \"Wedding Crashers.\" And I thought really? Because - and you look pretty much the same. I mean, you don't have like a big beard or anything. But they are such completely different human beings, I mean, this jerk in \"Wedding Crashers.\" Where did you get this character? Was he anybody you knew?\n\nMr. COOPER: He was definitely a composite of about three or four guys that I went to high school with, I think, without naming names. And the thing about these types of guys, for me, I was completely infatuated with them in the sense that how they go about living their life so seemingly carefree. And they're so despicable yet people gravitate towards them. And women like them, yet they're so demeaning towards women. And I find myself fascinated by them.\n\nI just always have a weird quandary about this type of man. And so I studied them in high school. And by the way, and it was also my idea of who they are. I mean, of course they are much more complicated. But definitely having spent so much time observing these guys in high school, wanting to be them in many ways, it was very easy to inhabit that role and by the way very therapeutic.\n\n(Soundbite of laughter)\n\nDAVIES: Oh, really? In what way?\n\nMr. COOPER: Well, yeah, it's almost like, you know, wearing the skin that sort of plagued you for so many years, you know.\n\nDAVIES: Yeah, and knowing it ain't all that good, right.\n\nMr. COOPER: That's true. You know what? Yeah, that is true.\n\nDAVIES: We're speaking with Bradley Cooper. He stars in the new film \"The Hangover Part II.\" More after a break. This is FRESH AIR.\n\n(Soundbite of music)\n\nDAVIES: If you're just joining us, our guest is actor Bradley Cooper. He stars in the new film \"The Hangover Part II.\"\n\nWell, after \"The Hangover,\" which was just this phenomenal success, you did \"Limitless.\" Well, you did some other stuff, too, but \"Limitless\" was a film where you really carried it. I mean, you are the lead.\n\nThe premise is there's this struggling writer in New York, that's you, Eddie, and from a former drug dealer, he finds this drug that will allow him to essentially use the full capacity of his brain, remember everything he's ever heard, analyze situations with laser-like intensity.\n\nLet's listen to a scene. I mean, this is a scene kind of early in the film, when you've just taken this drug. It mixes voiceover and dialogue because the film is sort of told from your perspective. So we have you describing what's happening, and then we hear you in a scene.\n\nIn this particular scene, you've just taken this drug. It's kicking in, and you're discovering these amazing mental powers. And you have this hallway encounter with your landlord's wife, and you happen to notice in her bag that she's carrying a book from a law school course. Let's listen.\n\n(Soundbite of film, \"Limitless\")\n\nMr. COOPER: (As Eddie Morra) Something wrong in law school?\n\nMs. T.V. CARPIO (Actor): (As Valerie) How do you know I'm in law school?\n\nMr. COOPER: (As Eddie) People who aren't usually don't carry around dry, academically constipated books about a dead Supreme Court justice.\n\nMs. CARPIO: (As Valerie) You're a (unintelligible).\n\nMr. COOPER: (As Eddie) No, I just noticed the book.\n\nMs. CARPIO: (As Valerie) You just saw the corner of it. How did you know that?\n\nMr. COOPER: (As Eddie) I'd seen it before, 12 years ago in college. I\n\nIf you're writing a paper, that's not the book I'd use.\n\nMs. CARPIO: (As Valerie) Well, who asked you?\n\nMr. COOPER: (As Eddie) Hastings has his oral history. I'd start there. Interesting point, grammatically, this guy was an idiot, which sort of gives credence to the theory that one of the clerks he had fired actually wrote most of this guy's major opinions. You can Google the clerk's sons. They'd love to talk to you, exonerate their dad. That'd give you something that no one else has...\n\nInformation from the odd museum show, a half-read article, some PBS documentary was all bubbling up in my frontal lobes, mixing itself together into a sparkling cocktail of useful information.\n\n(Soundbite of laughter)\n\nMr. COOPER: (As Eddie) She didn't have a chance.\n\nMs. CARPIO: (As Valerie) What are you suggestions?\n\nDAVIES: And that's my guest, Bradley Cooper, with the actress T.V. Carpio from the film \"Limitless.\"\n\nYou know, making a movie is such a weird process, I'm sure, in that, you know, you inhabit the character. You do your best. But so much of what actually happens after that, and even during it, you have little control over. You don't control the camera angles or the cinematography or how it's edited or then how it gets promoted afterwards.\n\nAnd when you did \"Limitless,\" I mean, in some respects, this was like a big opportunity for you to really carry a film.\n\nMr. COOPER: Yeah.\n\nDAVIES: Did it feel like a risk? Did you worry about that?\n\nMr. COOPER: Not when I was filming it. It wasn't until Relativity started to re-envision the movie as a potential really box-office earner.\n\nDAVIES: That's the production company.\n\nMr. COOPER: That's the studio that made the movie. And I thought -because I always sort of saw it as this - I had never been to a film festival, and I thought, oh, \"Dark Fields\" would be a movie I'd be able to take to a film festival, which would be a great experience.\n\nAnd then it was like no, no, no, this is going to be a 2,500-theater release minimum, and we're going to try to - you know, this is - we're going to put this out there and put some money behind it.\n\nAnd then I thought: Oh, wow, this is actually shot, meaning, you know, you get a couple shots up at - swings at bat after you're part of a big hit like \"The Hangover,\" and if it doesn't work, you know, because it's a transition.\n\nIt's a transition as to be going from an ensemble work to a guy who's, you know, you're carrying the burden of a narrative on your shoulders. So I was trepidatious leading up to it. Promoting the movie, you know, I still remember that Friday, getting on a plane headed to L.A., talking to Tucker Tooley, who runs Relativity Media.\n\nAnd he said: Look, it's going to be a four-horse race that weekend with \"The Lincoln Lawyer\" and \"Paul\" and \"Limitless\" and then \"Battle L.A.\" in the second weekend. And we may come in fourth.\n\nAnd I thought: Well, that's it. I really did. And I remember, and then four hours into the plane ride, the Wi-Fi was working, and all of a sudden it said: Do things change? And they said: You know what? It looks like we're going to take the weekend, and we may make $18, $19 million that weekend, which was just so absurd.\n\nIf we made $40 for the run, $40 million, that would be, you know, a hit. That would be okay. But we made - you know, it's up to $77 million domestic and $140-something worldwide. I mean, it's so far exceeded anything we could have even dreamed. So that was just - you know, I was just over the moon about that.\n\nGROSS: Bradley Cooper will talk more with FRESH AIR contributor Dave Davies in the second half of the show. Cooper starred in the film \"Limitless\" and co-stars in the new movie \"The Hangover Part II.\" Im Terry Gross, and this is FRESH AIR.\n\n(Soundbite of music)\n\nGROSS: This is FRESH AIR. I'm Terry Gross, back with more of the interview that actor Bradley Cooper recorded with FRESH AIR contributor Dave Davies. Cooper is reunited with Ed Helms and Zach Galifianakis in the new sequel to their hit movie \"The Hangover.\" When we left off, Cooper was talking about his first starring role in \"Limitless,\" which opened over earlier this year and co-starred Robert De Niro. The film did much better at the box office than Cooper ever dreamed.\n\nDAVIES: So how has it affected your career? Do you even have to audition anymore, for a role?\n\nMr. COOPER: Oh, God. It's so funny you say that, because...\n\n(Soundbite of laughter)\n\nMr. COOPER: ...this is why the businesses is just the greatest in an awful way. So Monday comes around, and it won the weekend, and this is the thing, it's like if you can headline a movie and it wins the weekend, I mean, that's huge. And I'm talking to Dave Mize, and I said, buddy, I said, what do we got? What do we got today? And he goes all man, let's see. Well, nothing yet.\n\n(Soundbite of laughter)\n\nMr. COOPER: And then 4 PM rolls around, and I call Dave, hey, what do we got, guy? What do we got? This is fun, this is nothing. And then, literally, nothing changed.\n\n(Soundbite of laughter)\n\nMr. COOPER: And I thought, oh, it was just so funny and, you know, not that much changed at all. And, you know, I just tried to get this other movie and, you know, begged the director to let me audition and I just put myself on movie in my kitchen last week with my buddy Wes, you know, literally in the kitchen, doing two scenes and sending it to a director. So, you know, it's funny.\n\nDAVIES: You videotaped an audition scene in your kitchen with a friend?\n\nMr. COOPER: Yeah, with a flip camera, and then we emailed it to the director.\n\n(Soundbite of laughter)\n\nDAVIES: This is not how I pictured your...\n\nMr. COOPER: I know. I know. It's great.\n\n(Soundbite of laughter)\n\nMr. COOPER: But luckily, I love acting so much that I will do anything if I feel a connection to a role. So hopefully that will never change.\n\nDAVIES: Well, one thing that has that I know has to have changed in your life is just your visibility.\n\nMr. COOPER: Yeah.\n\nDAVIES: I don't read a lot of celebrity stuff, but my daughter assures me that, if I did, I would see you plenty.\n\nMr. COOPER: Right.\n\nDAVIES: That there's a lot of stuff about you and people that you date. And you know, I'm picturing you working for 10 years as an actor -trying to get better, doing stuff. And now you're still that guy, you're still working as an actor, and suddenly people really care about every detail about your life and the paparazzi want to get your picture.\n\nMr. COOPER: Right.\n\nDAVIES: Do you have any kind of rules or guidelines you've set for yourself on how to deal with all that?\n\nMr. COOPER: Definitely. Yeah, I mean, I definitely have one rule that I've adhered to. And if you can get through 15 minutes of Howard Stern, without doing it...\n\n(Soundbite of laughter)\n\nMr. COOPER: ...you know that you're solid. I just don't talk about my personal life, in terms of relationships. I just won't ever talk about it. Well, first of all, in a broad sense, ideally, you don't - I don't want to know too much about the actors I love, because then I'm going to have to somehow deflect all of that when I'm watching them perform. Because I want to see what they're doing their, you know - I love that I hear that Daniel Day Lewis, you know, worked as a shoemaker, but I don't really know about Rebecca Miller and his two kids.\n\nI mean, I do because I'm saying it. But, you know, but I don't really know about him. I don't want to know about him too much because I want to see Bill, the butcher, you know; I want to see Daniel Plainview. That's - I want to sink my teeth into what he's doing. So ideally, you know, I wouldn't want anybody to know anything about me.\n\nBut here's the dilemma, I'm sitting here talking to you because got to promote a movie. So it's this weird thing that you do - that I do in that way, because you - I do believe you - I want to promote a movie that I'm doing. That said, you know, two things that I've had to deal with. The paparazzi, the first month, I'd say, after \"The Hangover,\" my instinct was to go after them, physically, because it's a very intrusive thing. And then you realize that's exactly what they want. Now it's effortless, I just, it is a part. It won't be there forever, it'll go away, and I feel pretty at ease with the paparazzi. But then the tabloid stuff is tough. You know, because it's incredible that they actually fabricate huge stories. And look, that said, they've aligned me with some wonderful women, so, you know, they've done well by me in terms of what they've fabricated.\n\nDAVIES: Accurately and in accurately?\n\nMr. COOPER: Inaccurately. Yeah, inaccurately is what I'm saying, you know. But, you know, I should be so lucky. But it's just it's incredible that they just literally make up stuff. And unfortunately, you know, people that are close to you that didn't ask for this get wound up -like my mother for example, you know, has to do with it. And people that are just my friends, have to do with it sometimes. But that all said, look, I mean, I get a chance to work with Robert De Niro. I get a chance to sit here with you today, you know, on a show that I've loved since I was an adolescent. There's nothing compared to this.\n\nDAVIES: I read that you said, once, how brutal the business can be and that you've just tried to focus on getting better. What kind of feedback did you get - in the early years - on your auditions?\n\nMr. COOPER: I've gotten everything that. You know, I've gotten that he's not F-able. You can insert the word, you know.\n\nDAVIES: Really?\n\nMr. COOPER: Yeah, yeah. There was a movie called \"My Little Eye.\" And I still remember it, which was so odd, because I wound up getting this role - but a guy does come in and has sex with a woman. But I remember auditioning for it and that that was the feedback. And I was at the Sundance film Festival, with \"Wet Hot American Summer,\" trying to get into the movie and I couldn't even get into the movie I was in.\n\n(Soundbite of laughter)\n\nMr. COOPER: And I remember talking to my agent at the time. She said, do you want to know the truth? I said, yeah. She goes. Here's what they said, and then she said that. And I thought, man this business sucks.\n\n(Soundbite of laughter)\n\nMr. COOPER: This is just the worst. But you know, I've always yeah, you hear everything. And then certainly, if you don't hear it you can at any time hop on the Internet and hear whatever your biggest fear is of all.\n\nDAVIES: Well, Bradley Cooper, it's been fun. Thanks so much.\n\nMr. COOPER: Oh, thank you. It's a real honor to be on the show.\n\nGROSS: Bradley Cooper spoke with FRESH AIR contributor Dave Davies. He's reunited with Ed Helms and Zach Galifianakis in the new movie \"The Hangover: Part II.\"\n\nComing up, our critic-at-large John Powers tells us about the prize-winning films at the Cannes Film Festival.\n\nThis is FRESH AIR.\n\nCopyright © 2011 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\n\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.", "images": ["https://media.npr.org/assets/img/2020/03/24/undefined_sq-63f9f4b46bb9031d67f9785b66818f4befbab8bc.jpg?s=100", "https://media.npr.org/chrome_svg/music-logo-dark.svg", "https://media.npr.org/assets/img/2011/05/13/ho2-01928rv2_wide-678885ad44b7bbf0413543777c679de24b547c45.jpg?s=1400", "https://media.npr.org/assets/img/2019/02/26/we_otherentitiestemplatesun_sq-4a03b35e7e5adfa446aec374523a578d54dc9bf5-s100-c85.png", "https://www.facebook.com/tr?id=1621557368158968&ev=PageView&noscript=1", "https://media.npr.org/chrome/programs/logos/morning-edition.jpg", "https://media.npr.org/chrome/programs/logos/up-first.jpg?version=2", "https://media.npr.org/assets/img/2020/03/17/coronavirus_daily_final__sq-2aca96317281db7f8671e5bf24e68fb77b66bbed.png?s=100", "https://media.npr.org/assets/img/2020/02/21/invisibiliapodcasttile-3000x3000_sq-3cea16f264a5ecd812496bd930d38c4f54102d6e.png?s=100", "https://media.npr.org/chrome_svg/music-logo-light.svg", "https://media.npr.org/assets/img/2020/03/09/trh_podcast-tile_sq-c05fb259465d433a5cf8a21248b8fa209a6b7690.png?s=100", "https://media.npr.org/chrome/programs/logos/all-things-considered.png", "https://media.npr.org/assets/img/2019/02/26/we_otherentitiestemplatesat_sq-cbde87a2fa31b01047441e6f34d2769b0287bcd4-s100-c85.png", "https://media.npr.org/chrome_svg/npr-logo.svg", "https://media.npr.org/chrome/programs/logos/fresh-air.png"], "top_img": "https://media.npr.org/assets/img/2011/05/13/ho2-01928rv2_wide-678885ad44b7bbf0413543777c679de24b547c45.jpg?s=1400", "keywords": [], "authors": [], "canonical_link": "https://www.npr.org/2011/05/25/136284673/bradley-cooper-a-wild-hangover-set-in-bangkok", "title": "Bradley Cooper On His Role In The New Comedy 'The Hangover: Part II\" : NPR", "meta_data": {"google-site-verification": "1VqzbDm4ukeFVHOoq5LjIKA2fVKZD-EYv8cXZhKXSfU", "robots": "noarchive,index,follow", "Rating": "General", "viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "date": "2011-05-13", "description": "Bradley Cooper starred as a schoolteacher heading to Vegas for a wild bachelor party in the 2009 raunchy bromance The Hangover. He reprises his role for the sequel, alongside actors Zach Galifianakis and Ed Helms — and a drug-dealing monkey named Crystal.", "og": {"title": "Bradley Cooper: A Wild 'Hangover' Set In Bangkok", "url": "https://www.npr.org/2011/05/25/136284673/bradley-cooper-a-wild-hangover-set-in-bangkok", "type": "article", "description": "Bradley Cooper starred as a schoolteacher heading to Vegas for a wild bachelor party in the 2009 raunchy bromance The Hangover. He reprises his role for the sequel, alongside actors Zach Galifianakis and Ed Helms — and a drug-dealing monkey named Crystal.", "image": "https://media.npr.org/assets/img/2011/05/13/ho2-fp-001br2_wide-c2598c30b6c35630fe1d5df77af15eff85e0e0d0.jpg?s=1400", "site_name": "NPR.org"}, "fb": {"app_id": 138837436154588, "pages": 10643211755}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "title": "Bradley Cooper: A Wild 'Hangover' Set In Bangkok", "site": "@NPR", "domain": "npr.org", "image": {"src": "https://media.npr.org/assets/img/2011/05/13/ho2-01928rv2_wide-678885ad44b7bbf0413543777c679de24b547c45.jpg?s=1400"}}}, "movies": [], "publish_date": null, "source": "http://www.npr.org", "summary": ""}