{"url": "https://people.com/tv/bachelor-finale-arie-luyendyk-chooses-between-lauren-becca/", "text": "Bachelor Nation, we made it to the finish line.\n\nOn Monday’s three-hour season finale, Arie Luyendyk Jr., 36, made his final choice between publicist Becca Kufrin, 27, and sales executive Lauren Burnham, 26 — but how he came to his decision was unlike anything we’ve seen before.\n\nGet push notifications with news, features and more.\n\nSPOILER WARNING: The following contains major spoilers from Monday’s finale. Read on at your own risk.\n\nThe final week of dates opens in Cusco, Peru, where Arie is still torn between his finalists. Making the situation even stickier is the fact that he’s told both women he loves them — but neither of them knows he’s also professed his love to the other.\n\n“I’m in love with Becca and I’m in love with Lauren, and I told them both that I love them — so I don’t even know how I’m going to deal with that,” he says. “At the end of all this, I have to break someone’s heart. And that makes that decision very tough.”\n\nOn the one hand, there’s Becca. She’s been a frontrunner from the beginning — landing the first one-on-one date of the season — and their relationship has remained solid throughout.\n\n“With Becca, I know who she is,” explains Arie. “She’s laid all the cards out on the table. She’s got great values, she loves her family, she’s funny and goofy and sexy at the same time. It’s so comfortable with her. I don’t really have any worries about us after this, and that really gives me a lot of comfort.”\n\nThen there’s Lauren. One of four Laurens cast this season, she’s been one of the most quiet and reserved contestants this franchise has ever seen — but all along, Arie has been drawn to her.\n\n“With Lauren, there’s a little bit more of a risk just because I feel like through this whole thing she’s been so reserved,” he says. “There were always these intense feelings, from the moment I met her, and I was sort of peeling back these layers of someone and figuring them out. But I can see how much she loves me, and that gives me a lot of confidence.”\n\nRELATED VIDEO: The Bachelor‘s Caroline Goes After Arie During Women Tell All — ‘I Know What You Did’\n\nLAUREN MEETS THE PARENTS\n\nArie’s family travels to Peru to help guide him through the decision. He introduces them to Lauren first, and his main concern is that she’s going to be shy and closed off. Though things get off to a slightly stilted start, Lauren eventually manages to win the family over, even shedding a few tears with Arie’s mom.\n\n“I would think she’s the one,” says Arie’s mom. “But maybe tomorrow we’ll think Becca is the one.”\n\nBECCA MEETS THE PARENTS\n\nThe very next day, it’s Becca’s turn. Even though the family definitely takes a liking to her, the misfortune of going second means being inevitably compared to the first woman — and Arie’s family certainly doesn’t gloss over the awkwardness of the situation. Instead, they openly and repeatedly bring Lauren up, which shakes Becca.\n\n“Arie’s dad said he would be happy with either one of us — that wasn’t fun to hear at all,” she admits later. “Lauren and I are so different. It’s like trying to compare an apple to a starfish. And I don’t want to be compared to her in any way, because she’s still a huge threat to me.”\n\n“I swear to God, if I have to hear the name Lauren one more time, I’m going to lose it,” she says. “It makes me want to puke thinking about them together. I hate talking about Lauren.”\n\nAfter Becca leaves, Arie regroups with his family to discuss how things went. They loved both girls and don’t exactly think there’s a “wrong choice” — but ultimately, they all swayed toward Becca.\n\n“I love Lauren — but I think Becca would be better for your future,” says Arie’s mom. “Because I think you have to reassure Lauren all the time about your love, and Becca stands on her own.”\n\nFINAL DATE WITH LAUREN\n\nThe morning of his very last date with Lauren, Arie wakes up having more or less made up his mind about picking Becca — but after spending the day exploring Machu Picchu with Lauren, everything gets turned upside down.\n\n“It’s hard because I thought I really had my feeling sorted out, but today Lauren has found her way into my heart,” he says. “Lauren’s amazing. I can tell you that she has a little speckle on her left eye, and there are just little things about her that I find so endearing and sweet and amazing. It’s crazy to think I could say goodbye to someone like that.”\n\nImage zoom Arie and Lauren Paul Hebert/ABC\n\nImage zoom Arie and Lauren Paul Hebert/ABC\n\nOn their final evening together, Lauren makes a point to lay all her cards out on the table.\n\n“I’m so in love with you,” she says. “I’m not scared of anything. I’m so excited and I’m ready to spend the rest of my life with you.”\n\nThey spend the next few hours cuddling on the couch, envisioning their future together and wondering whether their dogs will get along. Arie provides constant reassurance to Lauren, telling her how much he loves her over and over again — and in her mind, she’s got this in the bag.\n\n“I don’t think Arie would have let me tell him all of those things about how much I care about him and talk about our future all day if he knew he was picking Becca,” she says.\n\nAs for Arie? He seems pretty sold on Lauren at this point, too.\n\n“This is all I’ve ever wanted from her since the moment I fell in love with her,” he says. “If I had to propose this second, it would be her, right now. Lauren could be my wife. I feel really good about us, and I love her.”\n\nFINAL DATE WITH BECCA\n\nAfter an emotionally charged day with Lauren, Arie heads right into his last date with Becca. They spend the day exploring Cusco, shopping and taking in the sights. And even though he seemed so confident in his decision mere hours ago, he flip-flops once again.\n\n“Going into today, I was just thinking about Lauren — but now I’m conflicted,” he admits. “After spending the day with Becca, it really reminded me of all of her amazing qualities and why I was so attracted to her from the beginning.”\n\nImage zoom Arie and Becca Paul Hebert/ABC\n\nImage zoom Arie and Becca Paul Hebert/ABC\n\nBecca, meanwhile, is also feeling uncertain — and begins to speculate that Arie might be equally in love with Lauren.\n\n“I feel like Lauren is everything he’s probably dated in the past,” she says. “So I don’t know if he’s going to go with something that he’s more used to — or me, who I think would challenge him a lot more and really want an equal partnership. I can’t picture my future without him. Losing him in one day, to somebody who is so different than I am, to me right now is unimaginable.”\n\nImage zoom Arie and Becca Paul Hebert/ABC\n\nThat night, Becca brings up some of her fears to Arie. While he confesses that he’s conflicted in his decision, he still ends up providing her with constant reassurance, repeatedly telling her how much he loves her. And when Becca surprises him with a scrapbook of their journey together, he’s clearly overwhelmed.\n\n“I’m in love with Becca, and tonight I could really feel how much she loved me and how much she wanted us,” he says. “I needed today to really help me make this decision — and I really realized Becca could be my wife.”\n\nWatching Arie bounce back and forth between both women is exhausting, even just as a viewer — but it’s also weighing heavily on Arie himself, especially considering he only has one night to make up his mind before the proposal.\n\n“Tomorrow I have to make the biggest decision of my life and I’m struggling,” he admits. “I’m in love with two women and I just don’t know what to do. Both Becca and Lauren feel good about our relationships, and that’s my fault, because I said ‘I love you’ to both of them. It makes me feel guilty, because the hardest breakups are the breakups you don’t see coming.”\n\nTHE BUILDUP\n\nBy the next morning, Arie claims to have made up his mind for once and for all.\n\n“These two relationships are very different, these two women are very different, and so I had to look inward and see what’s important,” he says. “Now I finally realize who I can see myself growing old with. It feels so good to have that clarity. I couldn’t have pictured a better women for me.”\n\nHe picks out a ring with famed jeweler Neil Lane — and braces himself for what’s to come.\n\n“I’m getting engaged today. On the one hand, this is the best day of my life,” he reflects. “But on the other hand, it kills me inside to know that I’m going to have to say goodbye to someone that I’m in love with. She’s not going to see this coming.”\n\nTHE BREAKUP\n\nFinally, the moment we’ve all been waiting for: At the bottom of a hill, Arie anxiously awaits the arrival of his runner-up … and out of the limo comes Lauren.\n\n“I’ve been through that breakup and I think the one thing you want is answers on why,” Arie says as she makes her way towards him. “I want to tell her something that could really help her through this, but I have no real reason to give her.”\n\nMaking matters even worse is the fact that Lauren is fully expecting a proposal.\n\n“I’m very, very excited and I don’t have any doubts,” she gushes. “I can’t imagine him not proposing to me today. He makes me feel very safe, and he loves me in a way I’ve never known. I think Arie and I have a connection that’s far beyond anything most people even have in their lifetime. It’s just something so special and so rare — I do feel like he is my one true love.”\n\nImage zoom Lauren Paul Hebert/ABC\n\nOnce she gets to him, she takes his hands in hers and launches into her speech. Arie, clearly emotional, finally shakes his head to stop her.\n\n“I was awake all night thinking about this moment,” he tells her. “And I wanted it so bad for us. But there was something that was holding me back, and I just can’t go through with it. It’s not anything that I can explain other than that I gave it everything I had to see if it could work. I did fall in love with you.”\n\nLauren is utterly speechless, and, in her own words, “extremely confused.” In silence and hand-in-hand, they make their way to the top of the hill, where a black SUV is waiting to whisk her away.\n\n“Why did you do that?” she finally asks him.\n\n“I didn’t know. I didn’t know, fully, until this morning,” he says. “I was in love with her, I was in love with you. I’m sorry to put you through this.”\n\n“I still love you,” she says.\n\n“I love you, too,” he responds.\n\nAnd just like that, the car door slams shut. She’s gone, and Arie is left to face the consequences of his actions.\n\n“I feel a little bit like a monster right now,” he says. “All I really wanted to tell Lauren was ‘I love you.’ But I’m saying goodbye.”\n\n“I feel betrayed,” Lauren, in tears, says as she’s driven away. “I mean, how could you do that to somebody? I don’t get it. He just completely blindsided me. I let my guard down, I let someone in, and it still didn’t work out. I wholeheartedly believed that he was going to be the one. I was wrong.”\n\n“He said he’s in love with me and he’s in love with her and he had no idea what he was going to do until this morning,” she continues, still reeling. “Did that not terrify him? How can you get down on one knee if you weren’t sure until like, three hours ago? I really think he made a mistake.”\n\nTHE PROPOSAL\n\nImage zoom Arie proposes to Becca ABC\n\nAfter witnessing such a brutal breakup, it’s hard to imagine that Arie would be able to propose to someone else just minutes later. But even though he looks visibly shaken, somehow, he still goes through with it.\n\n“When I met you, I was taken aback,” he says to Becca. “You are beautiful and elegant and in that first conversation, I knew that you were an incredible woman. I think back on our dates and I think back on meeting your family and I think back on all the moments that we shared, and the thing that stands out is that we’re a team. I am very lucky that you’ve been on this journey with me, and through all of it, you’ve given me so much confidence along the way. Because of that, my love for you is immeasurable.”\n\n“This morning, I woke up and I thought about you,” he continues, getting down on one knee. “I thought about you and our kids together, I thought about us when we’re old, and I choose you today. But I choose you every day from here on out. I love you so much. Becca, will you marry me?”\n\nImage zoom Becca Paul Hebert/ABC\n\nBecca, of course, says yes, and he slides the ring on her finger. As the camera pans out, they’re the ultimate picture-perfect couple, newly engaged, kissing and twirling each other around in the Peruvian countryside.\n\n“Rebecca Jill Kufrin Luyendyk,” she squeals to the camera. “It’s got a ring to it!”\n\n“When are we going to start having babies?” he asks, turning to face her.\n\n“Tonight?” she suggests. “I’m the happiest girl in the world right now. What is life?!”\n\nTHE CHANGE OF HEART\n\nWhat is life, indeed. While a usual Bachelor finale ends there, Arie’s journey did not. What happens next is equal parts fascinating, twisted, and, quite simply, brutal. First, we’re privy to a montage of footage Becca and Arie filmed after taping their November engagement in Peru. We witness them kissing, goofing around making pizza, playing chess — from the outside, they seem like a blissful, newly engaged pair.\n\n“We’re here, we’re enjoying our time — alone,” Arie says in one shot as the two cuddle in a hammock.\n\n“Alone and in love,” adds Becca.\n\n“Finally,” says Arie. “It feels good, and we love everyone and we want to say thank you. This journey has been amazing.”\n\nBut behind closed doors, Arie is wrestling with his decision.\n\n“Sometimes when I’m on these little getaways with Becca I think about, What would this be like with Lauren?” he admits. “It just kills me, because I have a great woman next to me. I go to bed and I think about Lauren. I wake up and I think about Lauren. And I know Becca sees when I struggle. She sees the fact that my mind is somewhere else. She knows that I think about Lauren.”\n\nArie explains that he thought his feelings for Lauren would have subsided over time — except they didn’t.\n\n“With Becca, I just feel an immense amount of guilt,” he says. “It’s not fair for her to be in a relationship where someone is half in. I told Becca that I would choose her every day. I know I made that commitment, and it kills me that I’m going back on that. But I have to follow my heart.”\n\nAnd in case there was any doubt about what that meant, Arie lays it out for us, plain and simple: He’s decided to call off the engagement and break up with Becca.\n\n“Just thinking about the possibility of something with Lauren is making me want to risk it all,” he says. “Because I really feel like I made a mistake. I’ve had a change of heart. Look, I know this isn’t going to be a popular decision. But it’s worth it to me. I’m doing it because I love Lauren.”\n\nRELATED: The Bachelor‘s Arie Luyendyk Jr. Says He’s ‘Prepared for the Backlash’ After the Dramatic Finale\n\nAt this point, however, Becca was completely unaware of Arie’s plans to end things — which makes what happens next even more painful. One weekend in mid-January, Becca shows up at a house in Los Angeles, where she thinks she’s going to get to spend a “happy couple” weekend with Arie. There’s a camera crew, and she clearly assumes they’re taping some sort of post-finale special.\n\n“The past few months have been such a whirlwind,” she gushes. “I didn’t think I would leave The Bachelor an engaged woman, but I’m so excited. I can see a future so clearly with Arie. I really just want to get to the point where the show is done and we can finally start our life together. I miss him when I’m not with him!”\n\nIt’s excruciating to watch, really. While she waits for Arie to arrive, she happily shows off the huge ring — “he did very well with the selection,” she says, beaming.\n\nRELATED VIDEO: Arie Luyendyk Jr. Says He Fell for Two Women on the Show — ‘I Didn’t Know I Was Capable of That’\n\nFinally, Arie shows up and nervously shuffles Becca over to the couch. A crew scrambles to set up cameras on both sides of the room to capture every second of the conversation, from all angles. From there, we get to watch a split screen of the entire agonizing confrontation.\n\n“How do I start this?” Arie begins, looking visibly uncomfortable. “You know that I’ve been struggling a little bit. I think over the last couple of times we’ve been hanging out, I’ve been really trying to sort my feelings out and trying to grasp this whole thing. The reality of it is that being with you, although it’s been everything that I wanted, I still think about her. I think you sense that.”\n\nAs Becca sits in silence, Arie tries to justify his decision, explaining that the longer he stays with Becca, the more he feels like his window of opportunity for reconciliation with Lauren is narrowing.\n\n“So what? Do you want to be back with her?” Becca asks.\n\n“I want to see if there’s that possibility,” he says.\n\n“Are you f—ing kidding me?” she responds.\n\nImage zoom Arie and Becca ABC\n\nIt’s the first outburst of emotion Becca shows. Throughout the whole exchange, she’s actually relatively composed — though it’s obvious her silence isn’t due to a lack of anger, but rather due to the fact that she’s deeply mortified at the way this is all unfolding.\n\nFrom here on out, it doesn’t get any better. It becomes apparent that Lauren has indeed been an issue in their relationship and Arie has already had some sort of “conversation” with her, though it’s unclear when or under what circumstances. At one point, Becca calls Arie out for leading her to believe he wasn’t serious about Lauren.\n\n“You’ve got to be kidding me,” she says. “Everything that you told me about her, your relationship with her — you flat-out said you couldn’t see a future with her, you couldn’t quantify why you fell in love with her. Was that just words to me? You said you still had feelings for her that you were struggling with and I was trying to do what I could to help you. What did I do wrong?”\n\n“You didn’t do anything wrong,” responds Arie. “You were extremely patient with me, you allowed me to work through those feelings. I didn’t really let you know to the extent.”\n\nIn between long, painful silences, Becca eventually becomes resigned to the fact that it’s over. She takes off her ring and tells him he should never have gotten down on one knee in the first place, then gets up and retreats to the bathroom to cry. Arie awkwardly follows her from room to room until she gives in and sits back down on the couch with him.\n\n“I feel like my future was ripped away,” she says, crying. “Like, I love you. I obviously want you to be happy, and it’s not me. I can’t imagine my life without you.”\n\n“I wanted those things for us, too,” he says. “And I just can’t give those to you if I’m in love with someone else. I’m so sorry. I’m so sorry we’re here right now.”\n\nFinally, after what feels like hours, she tells him to leave for once and for all. He obliges, and Becca is left crying and shaking on the couch, curled over in a puddle of tears.\n\nBut that wasn’t the last we saw of her: After the episode concluded, franchise host Chris Harrison brought Becca out on stage in front of the live studio audience to share her thoughts. The first word that came to mind?\n\n“Brutal,” she said. “It’s brutal. I mean, when it all happened I feel like I kind of blacked out and so much was going through my mind that I couldn’t take it all in or really focus on even what I wanted to say. To watch that back now, of course I had feelings for him and I loved him, so it’s a hard heartbreak. … I was ready to do it all.”\n\nShe also revealed that she and Arie haven’t interacted since that day.\n\n“I haven’t heard anything,” she said. “After he left, I went through all the motions. I was sad, I stayed in L.A. for a few days and cried for probably four days straight and grieved the loss of that relationship and the future that I thought were were going to have. I am angry at times, I feel betrayed a lot of the time just because I feel like I was lied to for so long.”\n\nAs for what she has to say to him?\n\n“I have a ton of questions,” she said. “But at this point, it’s like, anything I ask him — will I get a true answer?”\n\nWe won’t know the outcome of Arie’s relationship with Lauren until Tuesday, when The Bachelor concludes with a two-hour live After the Final Rose special, starting at 8 p.m. ET on ABC. One thing’s for sure, though: Arie, you’ve got a lot of explaining to do.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fbachelor-becca-ring-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fbachelor-8-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fbachelor-becca-arie-breakup-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fbachelor-6-1-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fbachelor-4-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fbachelor-2-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fbachelor-9.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fbachelor-3-3-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fbachelor-7-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fbachelor-5-2000.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fbachelor-9.jpg", "keywords": [], "authors": ["Aurelie Corinthios"], "canonical_link": "https://people.com/tv/bachelor-finale-arie-luyendyk-chooses-between-lauren-becca/", "title": "The Bachelor Finale: Arie Proposes to Becca Then Dumps Her for Lauren", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Arie Luyendyk Jr.,Becca Kufrin,Lauren Burnham,News,Recap,The Bachelor,TV", "news_keywords": "Arie Luyendyk Jr.,Becca Kufrin,Lauren Burnham,News,Recap,The Bachelor,TV", "description": "Stay tuned for the two-hour live After the Final Rose special, airing Tuesday at 8 p.m. ET on ABC", "og": {"title": "The Bachelor's Shocking Finale: Arie Luyendyk Jr. Proposes to Becca Before Dumping Her for Lauren", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/bachelor-finale-arie-luyendyk-chooses-between-lauren-becca/", "description": "Bachelor&nbsp;Nation, we made it to the finish line. On Monday’s three-hour season finale, Arie Luyendyk Jr., 36, made his final choice between publicist&nbsp;Becca Kufrin, 27,&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fbachelor-9.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/bachelor-finale-arie-luyendyk-chooses-between-lauren-becca/", "description": "Stay tuned for the two-hour live After the Final Rose special, airing Tuesday at 8 p.m. ET on ABC", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fbachelor-9.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/bachelor-finale-arie-luyendyk-chooses-between-lauren-becca/", "title": "The Bachelor's Shocking Finale: Arie Luyendyk Jr. Proposes to Becca Before Dumping Her for Lauren", "description": "Stay tuned for the two-hour live After the Final Rose special, airing Tuesday at 8 p.m. ET on ABC", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fbachelor-9.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}