{"url": "https://people.com/sports/serena-williams-dad-wedding-walk-down-aisle/", "text": "Serena Williams was a stunning bride when she walked down the aisle at her Nov. 16 wedding to Alexis Ohanian. However, her father, Richard Williams, was not by her side.\n\nThe tennis star revealed in the third episode of the HBO documentary Being Serena that Richard told her via text just one hour before the ceremony that he didn’t feel able to escort her on her wedding day.\n\nGet push notifications with news, features and more.\n\n“He was in New Orleans, he had a suit, and I know he was really excited,” she explained. “But then he wrote me and said: ‘Serena, I don’t want you to be mad at me, but I just can’t walk you down the aisle. I’m not myself anymore. I’m just too nervous.’ ”\n\nSerena reacted with complete understanding, writing back, “Daddy, it’s okay, if you don’t want to come to the wedding at all, that’s okay too. I’m not going to be upset with you about it, so I don’t want you to be upset about it.”\n\nThe 36-year-old athlete — who welcomed daughter Alexis Olympia just two months before tying the knot with the Reddit co-founder — explained that she recognized why her father felt uncomfortable.\n\n“Maybe a lot of daughters wouldn’t react the same way, but I know the struggles he’s had these last few years. His health is better now, but I know he still doesn’t feel like himself, doesn’t feel like he’s perfect,” Serena said. “And if he doesn’t want to be up there in front of a lot of people, I completely understand. Look, when we first came on the scene, there were a lot of people who didn’t get him. I don’t think a lot of them wanted to get him. I don’t think a lot of him could have anyway.”\n\nShe continued, “Our family knows what we have. We just want each other to be happy. That’s what matters. I don’t think anything could ever change that.”\n\nSerena ended up walking down the aisle at the Contemporary Art Center of New Orleans solo as violinists performed “How Far I’ll Go” from the movie Moana.\n\nImage zoom Serena Williams and her father, Richard Sang Tan/AP/REX/Shutterstock\n\nAlexandra Macon, a Vogue editor who covered the wedding for the magazine, revealed that Serena completely kept her composure despite the sudden change of plans.\n\n“I can only imagine how all over the place her emotions must have been, but she radiated a sense of calm, even when things went wrong,” Macon wrote for Vogue.com. “Unbeknownst to me at the time, her father and longtime coach, Richard, texted her an hour before the wedding was supposed to start, saying that he didn’t feel comfortable walking her down the aisle.”\n\nRELATED VIDEO: Serena Williams Gives Her Best Wedding Advice For Friend Meghan Markle: ‘Eat Cake!’\n\nSerena’s friend Meghan Markle will also be without her father on her upcoming wedding day. The actress confirmed, Wednesday, that Thomas Markle will not be at her wedding to Prince Harry this Saturday.\n\n“Sadly, my father will not be attending our wedding. I have always cared for my father and hope he can be given the space he needs to focus on his health,” she said in a statement from Kensington Palace. “I would like to thank everyone who has offered generous messages of support. Please know how much Harry and I look forward to sharing our special day with you on Saturday.”\n\nDon’t miss out! Tune in to Meghan and Harry – a Fairy-Tale Wedding on Saturday, May 19, starting at 6 a.m. ET/ 3 a.m. PT on PeopleTV — now available on PeopleTV and on your favorite streaming device.\n\nFollowing a week of statements about his health, on Wednesday Thomas told TMZ that he successfully completed heart surgery and his doctors implanted multiple stents in his blood vessels. He remains hospitalized, according to TMZ.\n\nA royal source couldn’t confirm the operation to PEOPLE, but said of Meghan’s father, “He has told Meghan he cannot attend due to medical reasons.”\n\nMeghan, 36, and Harry, 33, are due to wed at St. George’s Chapel at Windsor Castle on Saturday.\n\nThe decision on who will walk Meghan down the aisle will be made “in due course,” a palace source told PEOPLE.\n\nWilliams has previously shared her wedding day advice for Meghan, telling ABC News, “I think it’s so important to enjoy the moment and eat cake.\n\n“I didn’t get to eat mine at the wedding. We were just having so much fun!”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fserena-williams1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fserena-williams1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fserena-williams1.jpg", "keywords": [], "authors": ["Stephanie Petit"], "canonical_link": "https://people.com/sports/serena-williams-dad-wedding-walk-down-aisle/", "title": "Serena Williams' Dad Pulled Out of Wedding One Hour Before", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Celebrity Weddings,News,Royal Wedding,Serena Williams,Sports", "news_keywords": "Celebrity Weddings,News,Royal Wedding,Serena Williams,Sports", "description": "Serena Williams was a stunning bride when she walked down the aisle at her Nov. 16 wedding — however, her father, Richard Williams, was not by her side", "og": {"title": "Serena Williams Found Out That Her Father Wouldn't Walk Her Down Aisle Via Text on Her Wedding Day", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/sports/serena-williams-dad-wedding-walk-down-aisle/", "description": "Serena Williams&nbsp;was a stunning bride when she walked down the aisle&nbsp;at her Nov. 16 wedding to Alexis Ohanian. However, her&nbsp;father, Richard Williams, was not by&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fserena-williams1.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/sports/serena-williams-dad-wedding-walk-down-aisle/", "description": "Serena Williams was a stunning bride when she walked down the aisle at her Nov. 16 wedding — however, her father, Richard Williams, was not by her side", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fserena-williams1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/sports/serena-williams-dad-wedding-walk-down-aisle/", "title": "Serena Williams Found Out That Her Father Wouldn't Walk Her Down Aisle Via Text on Her Wedding Day", "description": "Serena Williams was a stunning bride when she walked down the aisle at her Nov. 16 wedding — however, her father, Richard Williams, was not by her side", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fserena-williams1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}