{"url": "newslit.org/get-smart/rumor-review-denzel-washington-supports-trump-false/", "text": "This meme — the notion that in 2016 actor Denzel Washington publicly supported then-presidential candidate Donald Trump — is an example of a false claim that has evolved over time as it has spread across social media and on a variety of unreliable websites. Other iterations of this rumor falsely quoted Washington as saying that when Hillary Clinton lost the 2016 presidential election, “we avoided a war with Russia, and we avoided the creation of an Orwellian police state.”\n\nThis rumor first went viral in the final weeks of the 2016 presidential campaign. It resurfaced in February 2018 when Washington was nominated for an Oscar — and appeared yet again in April 2018, after musician Kanye West tweeted a statement of support for Trump, reigniting longstanding discussions about the political loyalties of black American voters.\n\nInsight: Viral rumors often recirculate when new contexts for them emerge.\n\nWhat can we learn?\n\nLet’s start with an instance of this viral meme that was included in a post on a highly suspect website — USALibertyPress.com — in February 2018:\n\nNote: The link in the previous paragraph is to an archive of the “fake news” website. That avoids linking to the site itself and giving it additional web traffic and ad revenue.\n\nThe first step we should take is to do a little lateral reading on the claim itself. So let’s do a quick search:\n\nAll the top results for this search are from fact-checking organizations, so we can safely assume that this is a questionable claim. A quick read of the fact checks confirms that the claims in both the headline and the meme on the Liberty Press website are false. PolitiFact traced the headline claim to a well-known “fake news” website, YourNewsWire.com, and Snopes shows that the quote attributed to Washington was actually said by Charles Evers, the brother of slain civil rights leader Medgar Evers, in an interview with the New York Post.\n\nNote: Like pieces of quality journalism, good fact checks and debunking articles are transparent. They don’t ask you to trust them; they show you why you should trust them.\n\nBut this still leaves us with questions about the source of the information. The source we started with is USALibertyPress.com, so let’s begin there.\n\nSince the site does not have an “About” section — a red flag in itself — we can try to see who might have established it by searching the WHOIS registry, a database of website registration information.\n\nTool: WHOIS is a database of website domain registration information that you can search using any number of free portals, such as whois.net and GoDaddy’s WHOIS search portal.\n\nA quick search for “USALibertyPress.com” on GoDaddy’s WHOIS search portal gave us this*:\n\nAs the highlighted areas show, this site was registered by someone at an address in Veles, Macedonia — a hub for “fake news” purveyors. A quick search for Veles confirms its infamy:\n\nWe now have all we need to confirm that not only is this a false claim, but at least one website pushing it is part of a network of “fake news” sites based in Macedonia.\n\nFinally, you could use Google Street View to see the physical address in Veles that was used to register this site:\n\nThere is quite a bit more you could do with this example — see this tweet thread for more ideas — but these three steps (reading laterally for additional information, searching the WHOIS registry for a website’s origin and using Google Street View to check out the location) are important skills that will help you sort fact from fiction in the future.\n\n*UPDATE (Aug. 28, 2018): The domain registration for www.usalibertypress.com was updated on July 28, 2018, and no longer includes information about the registrant in Macedonia. The site itself is now offline.", "images": ["https://newslit.org/wp-content/uploads/2018/05/Denzel-gif-1-1.gif", "https://newslit.org/wp-content/uploads/2019/10/guidestarseals_gold_med_150.png", "https://newslit.org/wp-content/uploads/2019/11/FALSE-Ilhan-Omar-fire-800x470.png", "https://newslit.org/wp-content/uploads/2018/05/Denzel-gif-2.gif", "https://newslit.org/wp-content/uploads/2018/05/RR2-04-800x470.png", "https://newslit.org/wp-content/uploads/2018/05/WHOIS.png", "https://newslit.org/wp-content/uploads/2020/03/lightbox-right-2.svg", "https://newslit.org/wp-content/uploads/2018/05/Denzel-gif-3.gif", "https://newslit.org/wp-content/uploads/2018/05/Rumor-Review-Denzel-300x156.png", "https://newslit.org/wp-content/uploads/2019/12/Gratarumorreview-800x470.png", "https://newslit.org/wp-content/uploads/2019/01/shutterstock_578817004-800x470.jpg", "https://newslit.org/wp-content/uploads/2019/05/Thumbnails-02-800x470.jpg", "https://newslit.org/wp-content/uploads/2018/05/DenzelMeme2-300x273.png", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://newslit.org/wp-content/uploads/2020/04/lightbox-left-3-810x810.jpg", "https://newslit.org/wp-content/uploads/2019/11/brexit-800x470.png"], "top_img": "https://newslit.org/wp-content/uploads/2019/05/Thumbnails-02-800x470.jpg", "keywords": [], "authors": [], "canonical_link": "https://newslit.org/get-smart/rumor-review-denzel-washington-supports-trump-false/", "title": "Rumor Review: Denzel Washington Supports President Trump (FALSE)", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "The notion that Denzel Washington publicly supported then-presidential candidate Donald Trump is an example of a false claim that has evolved over time…", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Rumor Review: Denzel Washington Supports President Trump (FALSE)", "description": "The notion that Denzel Washington publicly supported then-presidential candidate Donald Trump is an example of a false claim that has evolved over time…", "url": "https://newslit.org/get-smart/rumor-review-denzel-washington-supports-trump-false/", "site_name": "News Literacy Project", "image": {"identifier": "https://newslit.org/wp-content/uploads/2019/05/Thumbnails-02-800x470.jpg", "secure_url": "https://newslit.org/wp-content/uploads/2019/05/Thumbnails-02-800x470.jpg", "width": 800, "height": 470}}, "article": {"publisher": "https://www.facebook.com/TheNewsLiteracyProject"}, "twitter": {"card": "summary_large_image", "description": "The notion that Denzel Washington publicly supported then-presidential candidate Donald Trump is an example of a false claim that has evolved over time…", "title": "Rumor Review: Denzel Washington Supports President Trump (FALSE)", "site": "@NewsLitProject", "image": "https://newslit.org/wp-content/uploads/2019/05/Thumbnails-02-800x470.jpg", "creator": "@NewsLitProject"}}, "movies": [], "publish_date": null, "source": "http://newslit.org", "summary": ""}