{"url": "http://disney.wikia.com/wiki/Bernard_(Santa_Clause)", "text": "Bernard The Arch Elf Background information Feature films The Santa Clause The Santa Clause 2 Portrayed by David Krumholtz Character information Personality Beautiful, elfin, bossy, feisty, loud-mouthed, responsible, kind, patient Appearance Slender elf, medium length dark brown hair, chocolate brown eyes, fair skin, red striped tunic, dark brown trousers, forest green velvet hat with ribbon on the hem, various necklaces, brown coat with red scarf Occupation Scott's (Santa's) elf lieutenant, Curtis' boss head-elf, arch-elf Alignment Good Goal To have Scott become Santa (first film), to get Santa get married by Christmas Day (second film), to keep the workshop running and make sure the elves are working hard Home North Pole Allies Scott Calvin, Carol Newman-Calvin, Charlie Calvin, Lucy Miller, Laura Miller, Neil Miller , Quentin, Comet , Chet Minions Curtis and the elves Enemies Toy Santa Likes Pita Dislikes Curtis playing music on the job, slackers, not getting things done Powers and abilities Christmas magic Paraphernalia Snowballs\n\nFate Unknown Quote \"In putting on the suit and entering the sleigh, the wearer waives any and all right to any previous identity, real or implied, and fully accepts the duties and responsibilities of Santa Claus, in perpetuity to which some time the wearer becomes unable to do so, by either accident or design.\" Source\n\nContents show]\n\nPersonality\n\nis an elf and one of the main protagonists from Disney's 1994 filmand its first sequel\n\nBernard is a stickler for getting things done that are necessary. He can tend to be very grumpy, and less cheerful than the other elves, but he acts how he does to keep the other elves working. Being the head-elf (or Arch-elf), he has the responsibility of looking after the workshop and the other elves.\n\nAppearances\n\nBernard is first seen watching and smiling as Scott Calvin and his son, Charlie, arrive at the North Pole. Introducing himself as the head elf, Bernard explains that Scott has assumed the duties of Santa Claus by putting on Santa's suit, which he proves by showing a clause written on the former Santa's business card. Though Scott immediately denies this, Bernard explains that Scott will have until Thanksgiving to get his affairs in order before returning to become Santa full-time. Bernard also bonds with Charlie, giving him a snow globe (while also calling him \"sport\" as Scott does). Charlie thanks Bernard for the snow globe and promises to take good care of it, and Bernard replies with \"Make sure you do\".\n\nDuring the year, Scott begins transforming into Santa. At some point, Bernard sends Santa's list to Scott's home address.\n\nAround Thanksgiving, Bernard arrives at the home of Charlie's mother and stepfather, Laura and Neil Miller, where Scott is trying to visit Charlie despite the previous suspension of Scott's visitation rights. By this point, Scott has been inspired by Charlie to become Santa, and Bernard takes them both to the North Pole. Bernard and the other elves help with the preparations for Christmas. However, on Christmas Eve, Scott is arrested on the belief that he kidnapped Charlie. In response, Bernard sends E.L.F.S to rescue him.\n\nAfter the rescue, Bernard suddenly appears at the Millers, shocking them both, who have accepted Scott as Santa by this time. When Charlie learns he must stay with his mother and stepfather instead of his father, Bernard reveals that the snow globe he gave Charlie will allow him to summon Scott whenever he wants to see him. It is presumed that Bernard returns to the North Pole afterward.\n\nEight years after the first film, Bernard and his assistant, Curtis, discover a hidden clause that states that Santa must be married before or within the first eight years of assuming the role. If not, then Santa will lose his power and Christmas will end. Scott returns to his hometown to try to find a wife before the deadline. Meanwhile, Curtis creates a \"Toy Santa\" to cover for the absence of the real one, much to Bernard's horror, but he reluctantly plays along and tells the other elves that Santa changed his looks, so the other elves won't question the different appearance. However, Toy Santa is much more strict and evil and locks up Bernard when he attempts to alert the others that he is fake.\n\nBernard is eventually freed by a returning Scott and helps Scott, Charlie, and Scott's girlfriend, Carol, in stopping Toy Santa.\n\nBernard does not appear in this film, as due to his actor being in a TV series. His absence goes unmentioned and Curtis is head-elf in his place.\n\nGallery\n\n\n\n", "images": ["https://vignette.wikia.nocookie.net/hildatheseries/images/0/01/Community-Page-Header.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20190914140704", "https://vignette.wikia.nocookie.net/adoptme/images/6/61/Wikia_from_DreamCraft.png/revision/latest/zoom-crop/width/100/height/56?cb=20200324164245", "https://vignette.wikia.nocookie.net/disney/images/4/45/Disney_The_Santa_Clause_Logo.png/revision/latest/scale-to-width-down/300?cb=20150401023242", "https://vignette.wikia.nocookie.net/disney/images/8/8c/9635-16553.jpg/revision/latest?cb=20140524020842", "https://vignette.wikia.nocookie.net/bourne/images/6/68/Treadstone_Banner_%281%29.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20191125210358", "https://slot1-images.wikia.nocookie.net/__cb1586975593232/common/extensions/wikia/WikiaBar/images/wikiabarIcon.png", "https://vignette.wikia.nocookie.net/disney/images/6/6d/Bernard-Santa_Clause.jpg/revision/latest/scale-to-width-down/134?cb=20110828191113", "https://vignette.wikia.nocookie.net/disney/images/8/89/Wiki-wordmark.png/revision/latest?cb=20200101223559", "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D", "https://static.wikia.nocookie.net/274624f0-64b8-42b8-8f5d-1b0f0529c3bb"], "top_img": "https://vignette.wikia.nocookie.net/disney/images/8/8c/9635-16553.jpg/revision/latest?cb=20140524020842", "keywords": [], "authors": [], "canonical_link": "https://disney.fandom.com/wiki/Bernard_(Santa_Clause)", "title": "Bernard (Santa Clause)", "meta_data": {"viewport": "width=device-width, user-scalable=yes", "generator": "MediaWiki 1.19.24", "keywords": "Disney Wiki,disney,Bernard (Santa Clause),Infobox character,The Santa Clause,David Krumholtz,North Pole,Scott Calvin,Carol Newman-Calvin,Charlie Calvin,Lucy Miller,Laura Miller,Neil Miller", "description": "Bernard is an elf and one of the main protagonists from Disney's 1994 film The Santa Clause and its first sequel. Bernard is a stickler for getting things done that are necessary. He can tend to be very grumpy, and less cheerful than the other elves, but he acts how he does to keep the other...", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://disney.fandom.com/wiki/Bernard_(Santa_Clause)", "title": "Bernard (Santa Clause) | Disney Wiki | Fandom", "description": "Bernard is an elf and one of the main protagonists from Disney's 1994 film The Santa Clause and its first sequel. Bernard is a stickler for getting things done that are necessary. He can tend to..."}, "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "Disney Wiki", "title": "Bernard (Santa Clause)", "description": "Bernard is an elf and one of the main protagonists from Disney's 1994 film The Santa Clause and its first sequel. Bernard is a stickler for getting things done that are necessary. He can tend to be very grumpy, and less cheerful than the other elves, but he acts how he does to keep the other elves working. Being the head-elf (or Arch-elf), he has the responsibility of looking after the workshop and the other elves.", "url": "https://disney.fandom.com/wiki/Bernard_(Santa_Clause)", "image": "https://vignette.wikia.nocookie.net/disney/images/8/8c/9635-16553.jpg/revision/latest?cb=20140524020842"}, "apple-itunes-app": "app-id=422467074, app-arguments=https://disney.fandom.com/wiki/Bernard_(Santa_Clause)"}, "movies": [], "publish_date": null, "source": "http://disney.wikia.com", "summary": ""}