{"url": "https://abcnews.go.com/Entertainment/matt-damon-opens-harvey-weinstein-sexual-harassment-confidentiality/story?id=51792548", "text": "\u0097 -- Matt Damon addressed the sexual allegations against Harvey Weinstein, saying, “I knew I wouldn’t want him married to anyone close to me.”\n\n“But that was the extent of what we knew. I mean, and that wasn’t a surprise to anybody. So when you hear Harvey this, Harvey that — I mean, look at the guy. Of course he’s a womanizer,” Damon continued in an interview for ABC News’ “Popcorn With Peter Travers.”\n\nDamon, who stars in the upcoming film “Downsizing,” worked with Weinstein on his Oscar-winning film “Good Will Hunting,” which was produced by Weinstein’s production company Miramax.\n\nIn the past year, several women have publicly accused Weinstein of sexual misconduct. Weinstein has acknowledged inappropriate behavior but has denied any allegations of nonconsensual sex.\n\n“Any allegations of nonconsensual sex are unequivocally denied by Mr. Weinstein. Mr. Weinstein has further confirmed that there were never any acts of retaliation against any women for refusing his advances,” his spokesman previously said.\n\nIn a wide-ranging discussion with Travers on Tuesday, Damon opened up about Weinstein and others inside and outside the entertainment world who have been publicly accused of sexual misconduct this year.\n\nRead part of Damon’s conversation with Travers below.\n\nIn an overarching discussion with Peter Travers on ABC News' \"Popcorn With Peter Travers,\" Dec. 12, 2017, Matt Damon opened up about Harvey Weinstein, sexual harassment and confidentiality agreements. Maryellen McGrath/ABC\n\nPeter Travers: We live now in a different age, in a political age. There’s a lot of dissidence that goes on in the world that could affect you as an actor. We’re also in the age of people charged with sexual misconduct. This is everywhere. How do you react to that? Especially you, as the father of four girls.\n\nMatt Damon: I think we’re in this watershed moment. I think it’s great. I think it’s wonderful that women are feeling empowered to tell their stories, and it’s totally necessary … I do believe that there’s a spectrum of behavior, right? And we’re going to have to figure — you know, there’s a difference between, you know, patting someone on the butt and rape or child molestation, right? Both of those behaviors need to be confronted and eradicated without question, but they shouldn’t be conflated, right? You know, we see somebody like Al Franken, right? — I personally would have preferred if they had an Ethics Committee investigation, you know what I mean? It’s like at what point — you know, we’re so energized to kind of get retribution, I think.\n\nAnd we live in this culture of outrage and injury, and, you know, that we’re going to have to correct enough to kind of go, “Wait a minute. None of us came here perfect.” You know what I mean? … The Louis C.K. thing, I don’t know all the details. I don’t do deep dives on this, but I did see his statement, which kind of, which [was] arresting to me. When he came out and said, “I did this. I did these things. These women are all telling the truth.” And I just remember thinking, “Well, that’s the sign of somebody who — well, we can work with that” … Like, when I’m raising my kids, this constant personal responsibility is as important as anything else they learn before they go off in the world.\n\nAnd the fear for me is that right now, we’re in this moment where at the moment — and I hope it doesn’t stay this way — the clearer signal to men and to younger people is, deny it. Because if you take responsibility for what you did, your life’s going to get ruined …\n\nI mean, look, as I said, all of that behavior needs to be confronted, but there is a continuum. And on this end of the continuum where you have rape and child molestation or whatever, you know, that’s prison. Right? And that’s what needs to happen. OK? And then we can talk about rehabilitation and everything else. That’s criminal behavior, and it needs to be dealt with that way. The other stuff is just kind of shameful and gross, and I just think … I don’t know Louis C.K.. I’ve never met him. I’m a fan of his, but I don’t imagine he’s going to do those things again. You know what I mean? I imagine the price that he’s paid at this point is so beyond anything that he — I just think that we have to kind of start delineating between what these behaviors are.\n\nPT: It’s harder, isn’t it, though, when you actually know someone who gets accused? We both know Harvey Weinstein. I’ve worked with him. But I didn’t see any of this.\n\nMD: When you see Al Franken taking a picture putting his hands on that woman’s flak jacket and mugging for the camera, going like that, you know, that is just like a terrible joke, and it’s not funny. It’s wrong, and he shouldn’t have done that … But when you talk about Harvey and what he’s accused of, there are no pictures of that. He knew he was up to no good. There’s no witnesses. There’s no pictures. There’s no braggadocio … So they don’t belong in the same category.\n\nPT: I think it becomes for all of us, too, that are in any way around it, even though we’re not seeing it, is, what’s our responsibility to make sure it doesn’t happen?\n\nMD: A lot of people said, ‘Well, Harvey — everybody knew.’ As you were saying, that’s not true. Everybody knew what kind of guy he was in the sense that if you took a meeting with him, you knew that he was tough and he was a bully, and that was his reputation. And he enjoyed that reputation, because he was making the best movies out there …\n\n[With regard to the rape allegations,] nobody who made movies for him knew … Any human being would have put a stop to that, no matter who he was. They would’ve said absolutely no. You know what I mean? … I knew I wouldn’t want him married to anyone close to me. But that was the extent of what we knew, you know? And that wasn’t a surprise to anybody. So when you hear Harvey this, Harvey that — I mean, look at the guy. Of course he’s a womanizer … I mean, I don’t hang out with him.\n\nPT: But you can’t live his life for him. Or be responsible for his life.\n\nMD: Right. So the question is, at what point does somebody’s behavior that you have a professional relationship with … away from the profession bother enough that you don’t want to work with them? For me, I’ve always kind of, you know, as long as nobody’s committing a crime — well, that’s your life, and you go live it. I don’t need to be spending time with you, away from my professional life, at least.\n\nMatt Damon appears on \"Popcorn with Peter Travers\" at ABC News studios, Dec. 12, 2017, in New York City. Maryellen McGrath/ABC\n\nPT: [We’ve seen] Ridley Scott, who directed you in “The Martian,” having to erase Kevin Spacey from “All the Money in the World” and having to replace him with Christopher Plummer.\n\nMD: That was smart. That was a total business decision by Ridley. I haven’t talked to him, but … it wasn’t a creative choice for Ridley. Ridley has a big movie coming out … and nobody right now is in the mood to see a Kevin Spacey movie.\n\nAnd I think he’s right about that. He’s one of the few directors who could just turn on a dime and shoot for a week a month before a movie comes out and, you know, expunge an actor. And I don’t disagree with his decision to do that. I mean, that movie, I think, will do much better without Kevin in it.\n\n[Editor’s note: In response to the allegations against him made by Anthony Rapp, Kevin Spacey released a statement on Oct. 29, saying, in part, “I’m beyond horrified to hear his story. I honestly do not remember the encounter … But if I did behave then as he describes, I owe him the sincerest apology for what would have been deeply inappropriate drunken behavior.” In November a spokesperson for Spacey said he was “taking the time necessary to seek evaluation and treatment.”]\n\nPT: When it’s in that gray area and it’s friends of yours or people that you do know, do you try to talk to them afterwards and say, “What’s going on? Can I help?”\n\nMD: It depends on what the accusation is. It depends what’s going on. If it’s a friend of mine, I’m always talking to them. I know the real story if it’s my friend. If it’s a colleague … I don’t know … I guess it depends on the situation and the allegation and how believable I think it is.\n\nPT: We’re going to see the change in the making of movies now with people being so aware.\n\nMD: I also think the day of the confidentiality agreements is over. I think it’s just completely over. Ten years ago, you made a claim against me and I had a big movie coming out, OK? I have $100 million or I have a movie that is personally important to me coming out, and close to the release of that film, you say, “Matt Damon grabbed my butt and stuck his tongue down my throat.” We would then go to mediation and organize a settlement. I’d go, “I don’t want this out there. Peter’s going to go out and talk to the press and run his mouth, and it’s going to be overshadowing the opening of this movie. How much money do you want?” The lawyers would get together, and they do this cost-benefit analysis, and they’d go, “Oh, this is what it’s worth.” And I look at the number and go, “OK, I’ll pay it, but you can never talk about this again. You’re f------ lying about this, but never talk about this again.\n\nNow … with social media, these stories get — it’s like they get gasoline poured on them. So the moment a claim is made, if you make that same claim today to me, I would be scorched earth. I’d go, “I don’t care if it costs $10 million to fight this in court with you for 10 years, you are not taking my name from me. You are not taking my name and my reputation from me. I’ve worked too hard for it. And I earned it. You can’t just blow me up like that.” So I think once a claim is made, there will no longer be settlements. That’s just my prediction, I mean, just based on what I’ve seen.\n\nPT: Isn’t that a good thing? Women have been doing it, and they’ve been told they can’t express what happened to them.\n\nMD: One hundred percent … I think that it’s important, especially in that, you know, we believe every woman who’s coming forward with one of these stories needs to be listened to and heard. I think one of the surprising things for me has been the extent to which my female friends, as, I think, of all the ones I’ve talked to in the last year since all this stuff started happening — I can’t think of any of them who don’t have a story at some point in their life. And most of them have more than one.\n\nPT: I don’t know how old your daughters are, but how do you deal with them living in this world where even they, whatever ages they are, can’t escape this in the headlines?\n\nMD: You just have to raise children with, like, self-esteem, because you’re not going to be there to make all of their decisions for them. And you have to just hope that they have enough self-respect to make the best decisions they can. I mean, the Harvey situation is particularly horrible, because, you know, those women — when you say, “Hey, let’s take a meeting in a hotel room.” I mean, we auditioned, you know, for “Good Will Hunting” in a hotel room. Like, it’s common to take meetings in a hotel room.\n\nAnd this is the most powerful man in the movie business at the time, like in the ’90s, like Harvey was. That was the place to be. And if you get a thing from your agent on the letterhead of your agency that says, “Go meet Harvey Weinstein, the rainmaker, the guy that makes these great movies, at the Peninsula Hotel,” you’re going to that meeting … You don’t go into that meeting thinking something bad is going to happen to you … I don’t know who’s taking meetings in hotel rooms now. I mean, sometimes you’re in a different city and you just don’t have anywhere to meet. But, so no matter how smart my daughters are, no matter how prepared they are, there’s still those situations that that’s the nightmare kind of scenario.\n\n0:00\n\nPT: Do you worry about your daughters less because of the change in the industry?\n\nMD: With social media, you know, and a Twitter account, you have the same platform as The New York Times now, so there aren’t secrets. It’s harder to do this type of thing. I would like to point out, though, that even though it feels like there’s this avalanche of men … Well here’s my optimistic spin, this is like 1 percent of the guys who are losing their careers. It’s not everybody. It just feels like it. There’s so many great men and women in the movie business. So many great people. It’s such a wonderful collection of people overall. And these rotten horrible apples are getting weeded out right now.\n\nAnd that’s fine. That’s a good thing. That’s progress. But again, when we go back to talking about our own growth and development as human beings. We have to get to a place where we’re looking at one end of the spectrum and saying, “Well, let’s deal with this with some reflection and dialogue and some reconciliation, and let’s all grow together and move on.” And then I’ll think we’ll be making progress.\n\nWatch part of Matt Damon’s interview in the video above, and tune in for the full ABC News’ “Popcorn With Peter Travers” interview on Dec. 27, on ABCNews.com.\n\nDownload the \"Popcorn With Peter Travers\" podcast on Apple Podcasts, Spotify, Tunein, Google Play Music and Stitcher.\n\nEditor’s note: This interview has been edited for length and clarity.", "images": ["https://s.abcnews.com/images/Entertainment/matt-damon-gty-jt-171214_16x9_992.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://s.abcnews.com/images/Entertainment/matt-damon-gty-jt-171214_16x9_992.jpg", "keywords": [], "authors": ["Abc News", "Alexa Valiente", "Angela Williams", "December", "Min Read"], "canonical_link": "https://abcnews.go.com/Entertainment/matt-damon-opens-harvey-weinstein-sexual-harassment-confidentiality/story?id=51792548", "title": "Matt Damon opens up about Harvey Weinstein, sexual harassment and confidentiality agreements", "meta_data": {"description": "Matt Damon opened up about Harvey Weinstein and others on \"Popcorn With Peter Travers.\"", "keywords": "matt damon, harvey weinstein, sexual harassment, louis c.k., al franken, kevin spacey, abc news, popcorn with peter travers", "copyright": "2020 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "Matt Damon opens up about Harvey Weinstein, sexual harassment and confidentiality agreements", "og": {"site_name": "ABC News", "url": "https://abcnews.go.com/Entertainment/matt-damon-opens-harvey-weinstein-sexual-harassment-confidentiality/story?id=51792548", "title": "Matt Damon opens up about Harvey Weinstein, sexual harassment and confidentiality agreements", "description": "Matt Damon opened up about Harvey Weinstein and others on \"Popcorn With Peter Travers.\"", "image": "https://s.abcnews.com/images/Entertainment/matt-damon-gty-jt-171214_16x9_992.jpg", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2017-12-14T20:27:00Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,51792548", "ipad": "abcnewsipad://link/story,51792548", "googleplay": "https://abcnews.go.com/Entertainment/matt-damon-opens-harvey-weinstein-sexual-harassment-confidentiality/story?id=51792548"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "Matt Damon opens up about Harvey Weinstein, sexual harassment and confidentiality agreements", "description": "Matt Damon opened up about Harvey Weinstein and others on \"Popcorn With Peter Travers.\"", "url": "https://abcnews.go.com/Entertainment/matt-damon-opens-harvey-weinstein-sexual-harassment-confidentiality/story?id=51792548", "image": {"identifier": "https://s.abcnews.com/images/Entertainment/matt-damon-gty-jt-171214_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,51792548", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,51792548", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/Entertainment/matt-damon-opens-harvey-weinstein-sexual-harassment-confidentiality/story?id=51792548", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/Entertainment/matt-damon-opens-harvey-weinstein-sexual-harassment-confidentiality/story?id=51792548"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "https://abcnews.go.com", "summary": ""}