{"url": "https://en.wikipedia.org/wiki/Manushi_Chhillar", "text": "Indian actress, model, and beauty queen\n\nManushi Chhillar (born 14 May 1997) is an Indian actress, model and the winner of Miss World 2017. She represented the state of Haryana at the Femina Miss India 2017 pageant in which she won. Chhillar is the sixth representative from India to win the Miss World pageant. She has endorsed Club Factory and Malabar Gold and Diamonds, as a brand ambassador. Chhillar will make her Bollywood debut in the historical drama film Prithviraj.\n\nEarly life and education [ edit ]\n\nChhillar was born on 14 May 1997[3] in Rohtak, Haryana.[4][5] Her father, Mitra Basu Chhillar, is a scientist at Defence Research and Development Organisation (DRDO), while her mother, Neelam Chhillar, is an associate professor and departmental head of neurochemistry at the Institute of Human Behaviour and Allied Sciences.[6][7]\n\nChhillar studied at St. Thomas' School in New Delhi and was all India CBSE topper in English subject in class 12 and scored 96 percent in her boards.[8] She studied at Miranda House for one year and then cleared the All India Pre Medical Test in her first attempt[9] and is pursuing a medical degree (MBBS) at the Bhagat Phool Singh Medical College in Sonipat.[10][11] She has also attended the I.P.G.H.S, Bengaluru while her father was working in the Bengaluru wing of Defense Research and Development Organization. She is a trained Kuchipudi dancer, and has trained under Raja and Radha Reddy and Kaushalya Reddy.[12]\n\nPageantry [ edit ]\n\nChhillar's journey in pageantry began with Fbb Campus Princess 2016, where she was crowned as one of the finalists from All India Institute of Medical Sciences in December 2016 conducted by Miss India Organization.[13] Thereafter, she went on to win the title of fbb Femina Miss India Haryana in April 2017. Chhillar represented the state of Haryana in annual Femina Miss India competition and was crowned Femina Miss India 2017 in the finale held on 25 June 2017.[14] During the competition, Chhillar was crowned Miss Photogenic,[15] and went on to win the competition as well, earning the right to represent India at the Miss World 2017 competition.[16][17][18][19]\n\nMiss World 2017 [ edit ]\n\nChhillar represented India at Miss World 2017, where she became a semifinalist in the Top Model, People's Choice, and Multimedia competitions, and was the winner of the Head-to-Head Challenge from Group Nine and co-winner of the Beauty with a Purpose competition. She is fourth Beauty with a Purpose winner at Miss World from India and first Indian to win Miss World and Beauty with a Purpose jointly. She won the competition after stating that the job of a mother is the one that deserves the highest salary. Chhillar's Beauty with a Purpose project was Project Shakti. The campaign's goal is to spread awareness about menstrual hygiene.[20] She visited about 20 villages for the project and treated over 5,000 women.[21]\n\nOn 18 November 2017, Chhillar was crowned Miss World 2017 by outgoing titleholder Miss World 2016 Stephanie Del Valle from Puerto Rico in the finals in Sanya, China. She became the sixth Indian woman to win the crown, and the first since Priyanka Chopra won Miss World 2000.[22][23][24][25]\n\nReign as Miss World [ edit ]\n\nAs Miss World 2017, Chhillar returned to India on 26 November, where she was greeted by a large crowd.[26] A homecoming press conference was arranged for Chhillar at St Regis Hotel, Mumbai.[27] She was one of the celebrity speakers at the 2017 Global Entrepreneurship Summit in Hyderabad.[28] Chhillar was announced as the brand ambassador for Anaemia Free Haryana.[29] Her Beauty with a Purpose campaign, 'Project Shakti' was given government aid of ₹18 crore (approximately $2.8 million), ensuring free availability of sanitary napkins for all girls in the government schools of Haryana by Chief Minister of the state Manohar Lal Khattar.[30] She was honoured with the Special Achievement Award at the 2017 CNN-IBN Indian of the Year Awards for winning Miss World.[31] She was also India's top trending personality on Google search in 2017.[32] She received Proud Maker of India award at Six Sigma Healthcare Leadership Summit 2017 in New Delhi.[33] She was also guest speaker at the 10th C4IO by Hewlett-Packard Enterprise at Pushkar.[34]\n\nShe made a debut in 2018 edition of annual celebrity calendar by leading Indian fashion photographer Dabboo Ratnani.[35] She made an appearance in special show Super Nights With Padman to promote her Beauty with a purpose project on menstrual hygiene in association with Akshay Kumar's Pad Man (film).[36] She graced the covers of Cosmopolitan (magazine) India mag February 2018 edition,[37] Grazia India, March 2018 edition,[38] L'Officiel India April 2018 edition[39] and an Indonesian lifestyle magazine HighEnd[40]\n\nAfter her homecoming ceremony, Chhillar's first visit was to London along with Julia Morley, the Chairman and CEO of Miss World.[41] They joined the royal honouring ceremony of Marsha Rae Ratcliff OBE, the Past Master of The Worshipful Company of Carmen. The ceremony took place at the historic landmark of Trinity House directly opposite to the Tower of London.[42][43][43] During her stay in the United Kingdom, Chhillar visited the Warner Bros. Harry Potter Studio in Leavesden, where all the eight movies of the Harry Potter film series was filmed.[44]\n\nChhillar returned to India and attended the launch event of Audi Q5 cars held in Delhi.[45] Later, she reached the Bennett University in Greater Noida and interacted with its faculty.[46][47] In a session organised by the University, she answered the questions put forward by the students.[48]\n\nIn February 2018, she started the first leg of her Beauty With A Purpose tour with Miss World 2017 continental winners - Magline Jeruto (Africa), Ha Eun Kim (Asia), Annie Evans (Oceania), Stephanie Hill (Europe), Solange Sinclair (Caribbean), Andrea Meza (Americas) and Miss World 2016 Stephanie Del Valle at the 1st global edition of 'Feminine Hygiene Awareness' campaign in Hyderabad in collaboration with Government of Telangana.[49] They continued the campaign at Kolkata, where Bengal Chamber of Commerce and Industry hosted a special adda session on Feminine Hygiene in association with Miss World Beauty With a Purpose world tour team.[50] They visited \"New Light\" NGO in slum area of Kolkata and also learnt to make low cost biodegradable sanitary pads at the Jute Industries Research Association.[51] The team further worked on spreading awareness about menstruation and ensuring the availability of sanitary pads in rural areas.[52] They joined hands with Aakar Innovations, an NGO that works on the same issue, to create more low cost, biodegradable sanitary napkins.[53] She also visited Mumbai's Dharavi slum for 'Save the Girl Child' event.[54]\n\nManushi, along with the Miss World team, also met Muppavarapu Venkaiah Naidu, the Vice-President of India, and Sushma Swaraj, Minister of External Affairs, to discuss her beauty with a purpose project.[55] She visited Indian cities Hyderabad, Kolkata, Mumbai and Delhi for her 42-day beauty with a purpose tour. Chhillar then reached Hong Kong city[56] and was later invited by China Central Television to star in the biggest live event Chinese New Year's Gala at China. The Miss World team landed in Indonesia in continuation with the humanitarian tour.[57] During her stay in Indonesia, Manushi visited The Golden Bridge, a Beauty with a Purpose project which was completed by Miss Indonesia 2014, Maria Rahajeng, participated in humanitarian activities and also crowned Miss Indonesia 2018, the representative of Indonesia for Miss World 2018.[58]\n\nAfter this, Chhillar along with the Miss World team landed in the British Virgin Islands. They met the governor of British Virgin Islands and worked to raise funds for the beauty with the purpose project of Miss British Virgin Islands 2017, Helina Hewlet.[59] They were physically involved in the cleaning campaign of Eslyn Henley Richiez School, the only school for differently abled children in British Virgin Islands territory which was destroyed by Hurricane Maria and raised money for its restoration.[60]\n\nHer next stop was the USA, where she was a presenter and performer for a 16-hour TV show on channel ABC, the 44th Variety Children's Charity Telethon held at Iowa.[61] They raised $3.76 million in association with Variety Telethon team for the annual fundraiser which donates its proceeds to underprivileged children.[62] She was felicitated at South Asian Women Empowerment gala held on International Women's Day in New York along with other women achievers[63] and also joined as a presenter for \"South Asian Empowerment Awards\".[64] The first part of her beauty with a purpose tour ended with her United States visit.[65] After returning to India, she was one of the guest speakers at The Economic Times Women's Forum 2018.[66]\n\nIn April 2018, she was announced as the brand ambassador for one of the world's largest retail jewellery groups Malabar Gold and Diamonds.[67] She was also featured in a television commercial for Malabar Gold and Diamonds beside the Bollywood actress Kareena Kapoor.[68]\n\nManushi reached Brazil in continuation of her humanitarian tour. She visited the Government Palace in the State of São Paulo, where she was welcomed by First Lady of the State, Professor Lucia Franca. She discussed various social projects supported by the state of São Paulo with Manushi.[69] Chhillar, along with Gabrielle Vilela, Miss World Brazil 2017, initiated an awareness program to prevent and fight against leprosy. According to Chhillar, the aim was to teach people about the early signs of the disease and the ways to seek treatment.[70] She also met and interacted with the children from the APAE, an organization that primarily works towards the welfare of children suffering from Down Syndrome.[71]\n\nShe attended the Charity Gala arranged by APAE and gave a presentation on behalf of the organization to the Governor Of the Federal District Of Brasília, Rodrigo Rollemberg.[70] She highlighted the works done by the organization and requested the Governor to help build a new third floor to the APAE building, so that all the children with Down Syndrome in the state could be helped.[71][72] Manushi walked the ramp with one of the students suffering from Down Syndrome during the event.[73]\n\nChhillar walks the ramp alongside a person with Down Syndrome at the APAE Charity Gala, in Brasília\n\nChhillar was invited by Foreign Affairs Chairman, Congressman Nielson Pinto and the National Defense Committee and was honored by the Parliament of Brazil for her humanitarian works.[70][71]\n\nOn 1 May 2018, Manushi landed in the Ninoy Aquino International Airport in Manila, Philippines, where she was welcomed by Arnold L. Vegafria, the National Director of Miss World Philippines.[74] She was then joined by Laura Lehmann, Miss World Philippines 2017 and Rohit Khandelwal for the press presentation and inauguration of the Mister World 2019 contest to be held in the Philippines.[75] Chhillar and Khandelwal were invited by the CNN Philippines broadcast channel for an interview.[76]\n\nChhillar was voted as the Most Desirable Woman of India and she ranked No.1 in the Times 50 Most Desirable Women 2017 list.[77]\n\nAt the World Menstrual Hygiene Day on 28 May, Chhillar joined hundreds of women in a 3 km walk through the streets of Delhi, to create social awareness.[78] The walk was organised by sustainable sanitary pad manufacturers 'Aakar', in association with the Municipal Corporation of Delhi.[79][80] On 3 July, thousands of cyclists made it to the streets of Delhi celebrating the World Bicycle Day.[81] Chhillar stood along with the Vice President of India, Venkaiah Naidu and Minister of Science and Technology, Harsh Vardhan as they waved the flag at the starting line.[82]\n\nChhillar reached New Zealand as part of the Beauty with a Purpose campaign. She landed in the Auckland International Airport and was welcomed by Māori tribal dancers.[83][84] Chhilar, along with the Miss World team reached Ronald McDonald House in Auckland, a non-profit organization that aids support for children suffering from illness. She joined the volunteers at the charity house for a 'Kids Cook In'.[85][86]\n\nAt Miss India 2018 sub contest ceremony, Manushi was felicitated with the 'Pride of India' award for her accomplishments in an international pageant.[87] She was named as a judge for the Femina Miss India 2018 contest held on 19 June 2018. She crowned her national successor, Anukreethy Vas at the end of the event.[88] In July 2018, she was featured in a television commercial for Club Factory alongside Ranveer Singh.[89][90]\n\nManushi reached South Africa to take her project on menstrual hygiene forward.[91] During the first day of the visit, she along with the Miss World team visited the Metro Radio in Johannesburg to commemorate the Nelson Mandela cenetary celebrations.[92] As a result of Manushi Chhillar's Beauty With A Purpose Project on feminine hygiene, machines that manufacture low cost and compostable sanitary pads were installed in Nelson Mandela's birthplace Mvezo.[93] The President of South Africa, Cyril Ramaphosa, led the official ceremony of unveiling the first Sanitary Pads Unit, on 18 July 2018, which marked the 100th birth anniversary of Nelson Mandela. Chhillar, along with Miss World 2014, Rolene Strauss, inaugurated the first sanitary pad manufacturing unit set up by them in South Africa.[94] Chhillar, overwhelmed by the success of her project stated - “Witnessing my project cross continents in such a short period of time is like a dream come true! Nelson Mandela said that poor Menstrual hygiene was one of the three reasons why girls were facing inequality as compared to boys. It was an honour to inaugurate the first sanitary pad manufacturing unit set up by us in South Africa”[94]\n\nApart from the launch of the sanitary pad unit, Mandela's birthday was celebrated by handing out more than 200 blankets and winter hats to the elderly at the newly opened 'Nosekeni Nongaphi Health Center'.[95] The Miss World team also donated 100 bicycles to school children in Mvezo, Mandela's home village.[96][97]\n\nChhillar reached London and met the contestants of Miss England 2018.[98] She joined Stephanie Hill, Miss World Europe 2017 for the presentation of £15,000 raised by the charity projects of Miss England contestants. It was donated to the Mid Derbyshire Riding School for the disabled.[99] Chhillar and Hill also met the Lord Mayor of Liverpool, Christine Banks.[100]\n\nDuring her reign, she suffered a leg injury and was unable to perform her duties for a month.[101][102] After her recovery, she landed in Los Angeles, California, United States.[103][104] Manushi along with the Miss World team were invited to the sets of Ellen DeGeneres Show.[105]\n\nChhillar reached Sri Lanka and met John Amaratunga, the Minister of Tourism Development of Sri Lanka.[106] She later visited the Philippines for the second time to attend the coronation event of Miss World Philippines 2018, as one of the judges.[107] She reached France to attend the presentation event of 'Beauty with a Purpose' documentary at the resort town of Cannes in the French Riviera.[108] Chhillar then landed in Sanya, China and was a member of the jury in Miss China World 2018.[109] She inaugurated the 'Haryana Film Policy' in the Indian city of Gurgaon, along with the Chief Minister of Haryana, Manohar Lal Khattar.[110][111] She was invited to the Belgium King's Day celebration gala as a special guest.[112][113]\n\nDuring her reign as Miss World, she lived in England and visited China (three times), Hong Kong, Indonesia, the British Virgin Islands, the Philippines (twice), Sri Lanka, South Africa, New Zealand, Brazil, the United States (twice), France and her native country, India.\n\nManushi Chhillar crowned her successor Vanessa Ponce of Mexico at the end of Miss World 2018 pageant which took place in Sanya, China on 8 December 2018.[114] She donned a Sabyasachi lehenga during her final night as Miss World.[115][116]\n\nChillar also visited Singapore post her reign in September 2019 to attend a Miss World charity event.[117]\n\nActing [ edit ]\n\nChhillar will make her acting debut in the 2020 historical period drama film Prithviraj, directed by Chandraprakash Dwivedi.[118][119] The film is based on the life of Prithviraj Chauhan, a Rajput king from the Chahamana dynasty, and the Princess of Kannauj, Samyukta.[120] After several auditions and trails, Chhillar was casted alongside Akshay Kumar to portray the respective lead roles.[121][122] Elaborating her role, Chhillar stated - “It is a huge responsibility to play princess Samyukta. She was a powerful personality and stood up for what is right and took the most important decisions of her life herself. Her life is an extremely important chapter in Indian history, and I will try my best to play her as accurately as possible.”[123]\n\nFilmography [ edit ]\n\nKey Denotes films that have not yet been released\n\nAwards [ edit ]\n\nMedia Honours [ edit ]\n\nYear Title Awarding Organisation Ref. 2017 Most Desirable Woman of India The Times of India [77] 2019 India's Hottest Vegetarian PETA [128]\n\nReferences [ edit ]\n\nManushi Chhillar on Facebook", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Canada_%28Pantone%29.svg/15px-Flag_of_Canada_%28Pantone%29.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Manushi-Chhillar_snapped_at_a_press_meet_in_St._Regis%2C_Mumbai.jpg/250px-Manushi-Chhillar_snapped_at_a_press_meet_in_St._Regis%2C_Mumbai.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/b/be/Flag_of_England.svg/15px-Flag_of_England.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Flag_of_Guatemala.svg/15px-Flag_of_Guatemala.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Flag_of_Ukraine.svg/15px-Flag_of_Ukraine.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Norway.svg/15px-Flag_of_Norway.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Anukreethy_Vas_and_Manushi_Chhillar_%28cropped%29.jpg/222px-Anukreethy_Vas_and_Manushi_Chhillar_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/3/37/Dagger-14-plain.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Flag_of_Mexico.svg/23px-Flag_of_Mexico.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Flag_of_Panama.svg/15px-Flag_of_Panama.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/70px-Flag_of_India.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Flag_of_Venezuela.svg/15px-Flag_of_Venezuela.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Flag_of_France.svg/15px-Flag_of_France.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Flag_of_Bangladesh.svg/15px-Flag_of_Bangladesh.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Flag_of_Portugal.svg/15px-Flag_of_Portugal.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Flag_of_Botswana.svg/15px-Flag_of_Botswana.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Flag_of_Greece.svg/15px-Flag_of_Greece.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Governador_participa_de_noite_solid%C3%A1ria_da_Apae_%2839741917070%29.jpg/1200px-Governador_participa_de_noite_solid%C3%A1ria_da_Apae_%2839741917070%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Flag_of_Serbia.svg/15px-Flag_of_Serbia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Governador_participa_de_noite_solid%C3%A1ria_da_Apae_%2827680575678%29.jpg/270px-Governador_participa_de_noite_solid%C3%A1ria_da_Apae_%2827680575678%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Flag_of_Vietnam.svg/15px-Flag_of_Vietnam.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Flag_of_Indonesia.svg/15px-Flag_of_Indonesia.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f3/Flag_of_Russia.svg/15px-Flag_of_Russia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Flag_of_Australia_%28converted%29.svg/15px-Flag_of_Australia_%28converted%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Flag_of_Scotland.svg/15px-Flag_of_Scotland.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/Flag_of_Nepal.svg/15px-Flag_of_Nepal.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/15px-Flag_of_India.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Flag_of_Belgium_%28civil%29.svg/15px-Flag_of_Belgium_%28civil%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Flag_of_the_People%27s_Republic_of_China.svg/15px-Flag_of_the_People%27s_Republic_of_China.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/15px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/9e/Flag_of_Japan.svg/15px-Flag_of_Japan.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/59/Flag_of_Lebanon.svg/15px-Flag_of_Lebanon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Flag_of_the_Philippines.svg/15px-Flag_of_the_Philippines.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Flag_of_Puerto_Rico.svg/23px-Flag_of_Puerto_Rico.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Flag_of_Thailand.svg/15px-Flag_of_Thailand.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Governador_participa_de_noite_solid%C3%A1ria_da_Apae_%2839741917070%29.jpg/220px-Governador_participa_de_noite_solid%C3%A1ria_da_Apae_%2839741917070%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Flag_of_Mexico.svg/15px-Flag_of_Mexico.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Governador_participa_de_noite_solid%C3%A1ria_da_Apae_%2839741917070%29.jpg/1200px-Governador_participa_de_noite_solid%C3%A1ria_da_Apae_%2839741917070%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Manushi_Chhillar", "title": "Manushi Chhillar", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Governador_participa_de_noite_solid%C3%A1ria_da_Apae_%2839741917070%29.jpg/1200px-Governador_participa_de_noite_solid%C3%A1ria_da_Apae_%2839741917070%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}