{"url": "http://www.nytimes.com/2009/09/10/us/politics/10obama.text.html", "text": "Well the time for bickering is over. The time for games has passed. Now is the season for action. Now is when we must bring the best ideas of both parties together, and show the American people that we can still do what we were sent here to do. Now is the time to deliver on health care.\n\nThe plan I'm announcing tonight would meet three basic goals:\n\nIt will provide more security and stability to those who have health insurance. It will provide insurance to those who don't. And it will slow the growth of health care costs for our families, our businesses, and our government. It's a plan that asks everyone to take responsibility for meeting this challenge – not just government and insurance companies, but employers and individuals. And it's a plan that incorporates ideas from Senators and Congressmen; from Democrats and Republicans – and yes, from some of my opponents in both the primary and general election.\n\nHere are the details that every American needs to know about this plan:\n\nFirst, if you are among the hundreds of millions of Americans who already have health insurance through your job, Medicare, Medicaid, or the VA, nothing in this plan will require you or your employer to change the coverage or the doctor you have. Let me repeat this: nothing in our plan requires you to change what you have.\n\nWhat this plan will do is to make the insurance you have work better for you. Under this plan, it will be against the law for insurance companies to deny you coverage because of a pre-existing condition. As soon as I sign this bill, it will be against the law for insurance companies to drop your coverage when you get sick or water it down when you need it most. They will no longer be able to place some arbitrary cap on the amount of coverage you can receive in a given year or a lifetime. We will place a limit on how much you can be charged for out-of-pocket expenses, because in the United States of America, no one should go broke because they get sick. And insurance companies will be required to cover, with no extra charge, routine checkups and preventive care, like mammograms and colonoscopies – because there's no reason we shouldn't be catching diseases like breast cancer and colon cancer before they get worse. That makes sense, it saves money, and it saves lives.\n\nThat's what Americans who have health insurance can expect from this plan – more security and stability.\n\nNow, if you're one of the tens of millions of Americans who don't currently have health insurance, the second part of this plan will finally offer you quality, affordable choices. If you lose your job or change your job, you will be able to get coverage. If you strike out on your own and start a small business, you will be able to get coverage. We will do this by creating a new insurance exchange – a marketplace where individuals and small businesses will be able to shop for health insurance at competitive prices. Insurance companies will have an incentive to participate in this exchange because it lets them compete for millions of new customers. As one big group, these customers will have greater leverage to bargain with the insurance companies for better prices and quality coverage. This is how large companies and government employees get affordable insurance. It's how everyone in this Congress gets affordable insurance. And it's time to give every American the same opportunity that we've given ourselves.\n\nFor those individuals and small businesses who still cannot afford the lower-priced insurance available in the exchange, we will provide tax credits, the size of which will be based on your need. And all insurance companies that want access to this new marketplace will have to abide by the consumer protections I already mentioned. This exchange will take effect in four years, which will give us time to do it right. In the meantime, for those Americans who can't get insurance today because they have pre-existing medical conditions, we will immediately offer low-cost coverage that will protect you against financial ruin if you become seriously ill. This was a good idea when Senator John McCain proposed it in the campaign, it's a good idea now, and we should embrace it.", "images": ["https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png"], "top_img": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "keywords": [], "authors": [], "canonical_link": "https://www.nytimes.com/2009/09/10/us/politics/10obama.text.html", "title": "Obama’s Health Care Speech to Congress", "meta_data": {"article": {"published": "2009-09-09T23:59:10.000Z", "modified": "2009-09-10T00:15:28.000Z", "section": "U.S.", "opinion": "false", "content_tier": "metered"}, "robots": "noarchive", "articleid": 1247464489433, "nyt_uri": "nyt://article/7e1e717d-f82a-5bcc-a9a1-d8676599d86d", "pubp_event_id": "pubp://event/86ee286a23fe464e998862ac901d8321", "description": "The following is the prepared text of President Obama’s speech to Congress on the need to overhaul health care, as released by the White House.", "image": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "thumbnail": "https://static01.nyt.com/newsgraphics/images/icons/defaultCrop.png", "pdate": 20090909, "og": {"url": "https://www.nytimes.com/2009/09/10/us/politics/10obama.text.html", "type": "article", "title": "Obama’s Health Care Speech to Congress", "image": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "description": "The following is the prepared text of President Obama’s speech to Congress on the need to overhaul health care, as released by the White House."}, "twitter": {"url": "https://www.nytimes.com/2009/09/10/us/politics/10obama.text.html", "title": "Obama’s Health Care Speech to Congress", "description": "The following is the prepared text of President Obama’s speech to Congress on the need to overhaul health care, as released by the White House.", "image": "https://static01.nyt.com/newsgraphics/images/icons/defaultCrop.png", "card": "summary_large_image", "app": {"name": {"googleplay": "NYTimes"}, "id": {"googleplay": "com.nytimes.android"}, "url": {"googleplay": "nyt://article/7e1e717d-f82a-5bcc-a9a1-d8676599d86d"}}, "site": "@nytimes"}, "CG": "us", "SCG": "politics", "PT": "article", "PST": "Text", "url": "https://www.nytimes.com/2009/09/10/us/politics/10obama.text.html", "msapplication-starturl": "https://www.nytimes.com", "al": {"android": {"url": "nyt://article/7e1e717d-f82a-5bcc-a9a1-d8676599d86d", "package": "com.nytimes.android", "app_name": "NYTimes"}, "iphone": {"url": "nytimes://www.nytimes.com/2009/09/10/us/politics/10obama.text.html", "app_store_id": 284862083, "app_name": "NYTimes"}, "ipad": {"url": "nytimes://www.nytimes.com/2009/09/10/us/politics/10obama.text.html", "app_store_id": 357066198, "app_name": "NYTimes"}}, "viewport": "width=device-width, initial-scale=1", "fb": {"app_id": 9869919170}}, "movies": [], "publish_date": 1252512000.0, "source": "http://www.nytimes.com", "summary": ""}