{"url": "https://abcnews.go.com/GMA/Culture/kate-upton-love-brought-justin-verlander-back-brink/story?id=57134535", "text": "How Kate Upton, love, brought Justin Verlander back from the brink \"She was what I needed,\" the pitcher gushes about his amazing wife.\n\nAstros ace and World Series champ Justin Verlander is having one of the best years of his illustrious career at the age of 35, but the All-Star pitcher says it was love and his wife Kate Upton that brought him back from the brink.\n\nIn a new interview with Bleacher Report, Verlander looks back at the lowest point of his career just four years ago and admits, \"Who knows if I’m even here if it wasn’t for her?”\n\nAfter a groin injury which required surgery years ago, Verlander says it was Upton that helped bring him back to 100 percent; being the first to visit him during recovery, always there for both the mental and physical aspects of when your body fails you and later on, coming up with the idea that would save his career.\n\nShortly after his surgery, Verlander's shoulder started to give out, something pitchers who throw as fast as Verlander often deal with and he admits that at the age of 31 at the time, \"I really thought it was the end.\"\n\nWith yet another possible surgery on the horizon in such a short time span, Verlander tells Bleacher Report, it was love and Upton, who was \"instrumental in me not … like, jumping off a bridge. I was depressed and kind of just upset at the world.\"\n\n\"She was what I needed,\" he added. \"She was someone I could talk to. I mean, basically a therapist. Somebody I could trust with … Worries about, Can I make it? Worries about what I’m going through to get back.\"\n\nJustin Verlander and Kate Upton attend Maxim Hot 100 Experience in Los Angeles, July 21, 2018. Broadimage/REX via Shutterstock\n\nBut as grateful as he is for his wife, he's also in awe of what she's had to go through as a supermodel and actress.\n\n\"I mean, being a woman? Being in that industry? Being that famous? That was a level I hadn’t dealt with,\" he said.\n\nAlong with a blossoming romance, Verlander got great news around that time four years ago, he didn't need surgery, but yet the pain continued. It was Upton who suggested an idea that was out of the box.\n\n\"As a woman, you learn to always question everything everyone is telling you. My industry? My perspective of things? We can’t depend on anyone. Everything is our responsibility,\" she said, adding she told him to find help outside of his baseball trainers.\n\nAfter finding Dr. Annie Gow, she discovered that his problem wasn't in his shoulder at all, but that he wasn't flexible after his groin surgery. Basically he had changed his throwing motion to compensate for years and says, \"My body was a disaster.\"\n\nFor three months, the doctor and the pitcher worked on changing his whole technique.\n\nFast forward a couple of years and a new team in the Houston Astros, Verlander was back and better than ever exciting. But Verlander had also proposed to the love of his life and a run at the World Series would interfere with the duo's dream wedding.\n\nSo, in storybook fashion, Verlander and the Houston Astros won the series in seven games, then hopped on a jet to their wedding destination.\n\nVerlander and Upton said in hindsight, they wouldn't have planned it any other way.", "images": ["https://s.abcnews.com/images/GMA/justin-verlander-kate-upton-gty-ml-180810_hpMain_16x9_992.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://s.abcnews.com/images/GMA/justin-verlander-kate-upton-gty-ml-180810_hpMain_16x9_992.jpg", "keywords": [], "authors": ["Abc News", "Michael Rothman", "August", "Min Read"], "canonical_link": "https://goodmorningamerica.com/culture/story/kate-upton-love-brought-justin-verlander-back-brink-57134535", "title": "How Kate Upton, love, brought Justin Verlander back from the brink", "meta_data": {"keywords": "kate upton, justin verlander", "copyright": "2020 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "How Kate Upton, love, brought Justin Verlander back from the brink", "og": {"site_name": "ABC News", "url": "https://goodmorningamerica.com/culture/story/kate-upton-love-brought-justin-verlander-back-brink-57134535", "title": "How Kate Upton, love, brought Justin Verlander back from the brink", "image": "https://s.abcnews.com/images/GMA/justin-verlander-kate-upton-gty-ml-180810_hpMain_16x9_992.jpg", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2018-08-10T19:23:30Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,57134535", "ipad": "abcnewsipad://link/story,57134535", "googleplay": "https://goodmorningamerica.com/culture/story/kate-upton-love-brought-justin-verlander-back-brink-57134535"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "How Kate Upton, love, brought Justin Verlander back from the brink", "url": "https://goodmorningamerica.com/culture/story/kate-upton-love-brought-justin-verlander-back-brink-57134535", "image": {"identifier": "https://s.abcnews.com/images/GMA/justin-verlander-kate-upton-gty-ml-180810_hpMain_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,57134535", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,57134535", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/goodmorningamerica.com/culture/story/kate-upton-love-brought-justin-verlander-back-brink-57134535", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://goodmorningamerica.com/culture/story/kate-upton-love-brought-justin-verlander-back-brink-57134535"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "https://abcnews.go.com", "summary": ""}