{"url": "https://en.wikipedia.org/wiki/Dakota_Meyer", "text": "United States Marine Corps Medal of Honor recipient\n\nDakota Louis Meyer (born June 26, 1988)[1] is a United States Marine. A veteran of the War in Afghanistan, he was awarded the Medal of Honor for his actions during the Battle of Ganjgal on 8 September 2009, in Kunar Province, Afghanistan. Meyer is the second-youngest living Medal of Honor recipient, the third living recipient for either the Iraq War or the War in Afghanistan[2] and the first living U.S. Marine in 38 years to be so honored.[3]\n\nEarly life and education [ edit ]\n\nMeyer was born and raised in Columbia, Kentucky, the son of Felicia \"Killy\" Gilliam and Michael Meyer.[4][5] In 2006, after graduation from Green County High School, he enlisted in the Marine Corps at a recruiting station in Louisville, Kentucky and completed basic training at Marine Corps Recruit Depot Parris Island.[4]\n\nMilitary service [ edit ]\n\nMeyer in Afghanistan\n\nMeyer deployed to Fallujah, Iraq in 2007 as a scout sniper with 3rd Battalion, 3rd Marines. He gained national attention for his actions in Afghanistan during his second deployment in Kunar Province with Embedded Training Team 2-8.[6][7]\n\nOn 8 September 2009, near the village of Ganjgal, Meyer learned that three Marines and a Navy Corpsman, who were members of Meyer's squad and his friends, were missing after being ambushed by a group of insurgents. Under enemy fire, Meyer entered an area known to be inhabited by insurgents and eventually found the four missing servicemen dead and stripped of their weapons, body armor and radios. There he saw a Taliban fighter trying to take the bodies. The fighter tackled Meyer, and after a brief scuffle, Meyer grabbed a baseball-sized rock and beat the fighter to death.[8] With the help of Afghan soldiers, he moved the bodies to a safer area where they could be extracted.[9] During his search, Meyer \"personally evacuated 12 friendly wounded and provided cover for another 24 Marines and soldiers to escape likely death at the hands of a numerically superior and determined foe.\"\n\nFour U.S. servicemen died in the ambush:\n\n1st Lt. Michael Johnson, 25, of Virginia Beach, Virginia\n\nStaff Sgt. Aaron Kenefick, 30, of Roswell, Georgia\n\nGunnery Sgt. Edwin Wayne Johnson Jr., 31, of Columbus, Georgia\n\nHospital Corpsman Third Class James R. Layton, 22, of Riverbank, California.\n\nA fifth man, Army SFC Kenneth W. Westbrook, 41, of Shiprock, New Mexico, later died from his wounds.[10]\n\nMeyer stands at attention after receiving the Medal of Honor from U.S. President Barack Obama during the Medal of Honor presentation ceremony in the East Room of the White House , Washington, D.C., 15 September 2011.\n\nOn 6 November 2010, the Commandant of the Marine Corps, General James Amos, told reporters during a visit to Camp Pendleton, California that a living U.S. Marine had been nominated for the Medal of Honor. Two days later, Marine Corps Times, an independent newspaper covering Marine Corps operations, reported that the unnamed person was Meyer, citing anonymous sources. CNN confirmed the story independently two days later.[11]\n\nOn 9 June 2011, the Marine Corps announced that two other Marines on Meyer's team in Ganjgal would receive the Navy Cross, the second-highest award for valor a Marine can receive. Capt. Ademola D. Fabayo and Staff Sgt. Juan J. Rodriguez-Chavez were recognized for their roles in retrieving the bodies of the fallen Marines and Corpsman. Before Meyer began searching for the missing servicemen on foot, Rodriguez-Chavez drove a gun truck into the kill zone with Fabayo manning the truck's machine gun.[12]\n\nWhen President Barack Obama's staff called Meyer to set up a time for the president to inform him that his case for the Medal of Honor had been approved, they were told Meyer was working at his construction job and were asked to call again during his lunch break.[13]\n\nMeyer was awarded the Medal of Honor in a ceremony on 15 September 2011.[14] When a White House staffer contacted Meyer to arrange the ceremony, Meyer asked if he could have a beer with the president.[15] He received an invitation to the White House for the afternoon before the ceremony. Meyer also requested that when he was honored, simultaneous commemorative services should be held at other associated locations to honor the memory of his colleagues who died or were mortally wounded during the ambush and his rescue attempts.[16]\n\nCivilian [ edit ]\n\nA year after the Battle of Ganjgal, after drinking at a friend's house, Meyer attempted to commit suicide using a Glock pistol kept in his truck's glove compartment. The gun was not loaded. Meyer later sought help for post-traumatic stress disorder.[17]\n\nIn September 2011, Kentucky Governor Steve Beshear bestowed upon Meyer the honorary title of Kentucky Colonel during an event in his hometown of Greensburg in which Meyer served as grand marshal.[18]\n\nMeyer filed a lawsuit against his former employer, defense contractor BAE Systems, alleging the company and his supervisor punished him for his opposition to a weapons sale to Pakistan.[19] The lawsuit claimed that BAE Systems ridiculed Meyer's Medal of Honor, called him mentally unstable and suggested he had a drinking problem, thereby costing him a job.[20] On 15 December 2011, BAE announced that the parties resolved their dispute out of court.[21]\n\nOn 14 December 2011, McClatchy news outlets published an article which questioned the actual number of lives Meyer saved. The article stated that \"crucial parts that the Marine Corps publicized were untrue, unsubstantiated or exaggerated,\" but that Meyer \"by all accounts deserved his nomination.\"[22]\n\nMeyer and Bing West wrote the book Into the Fire: A Firsthand Account of the Most Extraordinary Battle in the Afghan War, about the Battle of Ganjgal. It was published on 25 September 2012.[23] In the book, Meyer makes a case for Army Captain William D. Swenson to be awarded the Medal of Honor;[17] Swenson had criticized Army officers at the nearby Forward Operating Base Joyce for not providing fire support, the resulting political fallout not conducive to awarding him the medal. Those same officers were later cited following a military investigation for \"negligent\" leadership leading \"directly to the loss of life\" on the battlefield.[24] Swenson was awarded the Medal of Honor on 15 October 2013.[25]\n\nIn 2013, Meyer participated in the fourth season of Maximum Warrior,[26] a TV competition among U.S.-military operators, featuring 10 military-inspired challenges. Meyer, eliminated on the eighth episode, \"Night Hostage Rescue\", airing 26 November 2013, finished in fourth place. As of 2015, Meyer sits on the advisory board for VETPAW,[27] an organization of U.S. military veterans dedicated to protecting African wildlife.\n\nMeyer is a proponent of legalizing the medical use of cannabis, which he says can help veterans suffering from PTSD while also reducing usage of opioid drugs.[28] In March 2018, Meyer co-authored an op-ed calling for medical cannabis to be legalized in Kentucky.[29]\n\nPersonal life [ edit ]\n\nOn March 13, 2015, Meyer became engaged to Bristol Palin, daughter of former Alaska Governor Sarah Palin.[30] On 18 May 2015, Sarah and Bristol Palin announced that the wedding, originally scheduled for May 23, 2015, had been called off.[31] On June 25, 2015, Bristol Palin announced that she was pregnant for a second time.[32] She gave birth to a daughter, Sailor Grace, on December 23, 2015.[33] On 6 January 2016, People reported that Meyer is the biological father of the child, and that Meyer had filed legal documents asking for joint legal and physical custody of the newborn as well as child support from Palin.[34] In March 2016, an interim joint legal and physical custody agreement was reached between Palin and Meyer.[35] On 23 May 2016, Palin and Meyer were married.[36] In December 2016, Palin announced that she was expecting her third child, the second with Meyer.[37] On May 8, 2017, she gave birth to a daughter they named Atlee Bay.[38] On January 29, 2018, Meyer filed for divorce from Palin, citing a \"conflict of personalities\".[39] On August 1, 2018, Palin confirmed that her divorce from Meyer was finalized.[40]\n\nBooks [ edit ]\n\nInto the Fire: A Firsthand Account of the Most Extraordinary Battle in the Afghan War[23]\n\nHonors and awards [ edit ]\n\nMilitary awards [ edit ]\n\nMedal of Honor [ edit ]\n\nMedal of Honor citation [ edit ]\n\n\n\n\"The President of the United States in the name of The Congress takes pleasure in presenting the MEDAL OF HONOR to\n\n\n\nCORPORAL DAKOTA L. MEYER\n\nUNITED STATES MARINE CORPS\n\nFor service as set forth in the following:\n\n\n\nFor conspicuous gallantry and intrepidity at the risk of his life above and beyond the call of duty while serving with Marine Embedded Training Team 2-8, Regional Corps Advisory Command 3-7, in Kunar Province, Afghanistan, on 8 September 2009. Corporal Meyer maintained security at a patrol rally point while other members of his team moved on foot with two platoons of Afghan National Army and Border Police into the village of Ganjgal for a pre-dawn meeting with village elders. Moving into the village, the patrol was ambushed by more than 50 enemy fighters firing rocket propelled grenades, mortars, and machine guns from houses and fortified positions on the slopes above. Hearing over the radio that four U.S. team members were cut off, Corporal Meyer seized the initiative. With a fellow Marine driving, Corporal Meyer took the exposed gunner's position in a gun-truck as they drove down the steeply terraced terrain in a daring attempt to disrupt the enemy attack and locate the trapped U.S. team. Disregarding intense enemy fire now concentrated on their lone vehicle, Corporal Meyer killed a number of enemy fighters with the mounted machine guns and his rifle, some at near point blank range, as he and his driver made three solo trips into the ambush area. During the first two trips, he and his driver evacuated two dozen Afghan soldiers, many of whom were wounded. When one machine gun became inoperable, he directed a return to the rally point to switch to another gun-truck for a third trip into the ambush area where his accurate fire directly supported the remaining U.S. personnel and Afghan soldiers fighting their way out of the ambush. Despite a shrapnel wound to his arm, Corporal Meyer made two more trips into the ambush area in a third gun-truck accompanied by four other Afghan vehicles to recover more wounded Afghan soldiers and search for the missing U.S. team members. Still under heavy enemy fire, he dismounted the vehicle on the fifth trip and moved on foot to locate and recover the bodies of his team members. Meyer's daring initiative and bold fighting spirit throughout the 6-hour battle significantly disrupted the enemy's attack and inspired the members of the combined force to fight on. His unwavering courage and steadfast devotion to his U.S. and Afghan comrades in the face of almost certain death reflected great credit upon himself and upheld the highest traditions of the Marine Corps and the United States Naval Service.[41]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/Iraq_Campaign_Medal_ribbon.svg/106px-Iraq_Campaign_Medal_ribbon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/%22V%22_device%2C_gold.svg/22px-%22V%22_device%2C_gold.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/USMC_Pistol_Expert_badge.png/120px-USMC_Pistol_Expert_badge.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Navy_and_Marine_Corps_Achievement_Medal_ribbon.svg/106px-Navy_and_Marine_Corps_Achievement_Medal_ribbon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/USMC_Rifle_Expert_badge.png/120px-USMC_Rifle_Expert_badge.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Dakota_L._Meyer.JPG/220px-Dakota_L._Meyer.JPG", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/28px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Medal_of_Honor_ribbon.svg/23px-Medal_of_Honor_ribbon.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Medal_of_Honor_ribbon.svg/106px-Medal_of_Honor_ribbon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Navy_and_Marine_Corps_Achievement_Medal_ribbon.svg/23px-Navy_and_Marine_Corps_Achievement_Medal_ribbon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Purple_Heart_ribbon.svg/23px-Purple_Heart_ribbon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Moh_right.gif/55px-Moh_right.gif", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/NATO_Medal_ribbon_%28Non-Article_5%29.svg/106px-NATO_Medal_ribbon_%28Non-Article_5%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/USMC-E5.svg/25px-USMC-E5.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Navy_and_Marine_Corps_Commendation_Medal_ribbon.svg/23px-Navy_and_Marine_Corps_Commendation_Medal_ribbon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/U.S._Marine_Corps_Good_Conduct_Medal_ribbon.svg/106px-U.S._Marine_Corps_Good_Conduct_Medal_ribbon.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Bronze-service-star-3d-vector.svg/18px-Bronze-service-star-3d-vector.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Purple_Heart_ribbon.svg/106px-Purple_Heart_ribbon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Combat_Action_Ribbon.svg/106px-Combat_Action_Ribbon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/3rd_Battalion_3rd_Marines_2017.jpg/25px-3rd_Battalion_3rd_Marines_2017.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Defense.gov_photo_essay_110915-M-AR635-157.jpg/220px-Defense.gov_photo_essay_110915-M-AR635-157.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Flickr_-_DVIDSHUB_-_Sgt._Dakota_Meyer_%28Image_4_of_15%29.jpg/170px-Flickr_-_DVIDSHUB_-_Sgt._Dakota_Meyer_%28Image_4_of_15%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Global_War_on_Terrorism_Service_Medal_ribbon.svg/106px-Global_War_on_Terrorism_Service_Medal_ribbon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Afghanistan_Campaign_Medal_ribbon.svg/106px-Afghanistan_Campaign_Medal_ribbon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Flag_of_the_United_States_%28Pantone%29.svg/23px-Flag_of_the_United_States_%28Pantone%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/National_Defense_Service_Medal_ribbon.svg/106px-National_Defense_Service_Medal_ribbon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Navy_and_Marine_Corps_Sea_Service_Deployment_Ribbon.svg/106px-Navy_and_Marine_Corps_Sea_Service_Deployment_Ribbon.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Dakota_L._Meyer.JPG/1200px-Dakota_L._Meyer.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Flag_of_the_United_States_Marine_Corps.svg/23px-Flag_of_the_United_States_Marine_Corps.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Navy_and_Marine_Corps_Commendation_Medal_ribbon.svg/106px-Navy_and_Marine_Corps_Commendation_Medal_ribbon.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Dakota_L._Meyer.JPG/1200px-Dakota_L._Meyer.JPG", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Dakota_Meyer", "title": "Dakota Meyer", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.27", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Dakota_L._Meyer.JPG/1200px-Dakota_L._Meyer.JPG"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}