{"url": "www.independent.co.uk/life-style/kylie-jenner-travis-scott-kardashian-curse-billionaire-stormi-a8452981.html", "text": "Billionaire beauty mogul Kylie Jenner and her boyfriend Travis Scott discussed the rumoured “Kardashian Curse” in a recent interview - and it looks like there may be some truth to it.\n\nThe “Kardashian Curse” was coined when Scott Disick, a former boyfriend of Kourtney Kardashian, recruited a medium to help rid him of the bad luck which he says accompanies men who date a Kardashian.\n\nAccording to Disick, the curse affects men who try to date any of the clan - with all of them eventually finding themselves single once again.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nNow, in a new interview with GQ, Jenner admitted that the curse, which the sisters used to find offensive, may have some accuracy.\n\nHaving a lot to do with the incredible celebrity of the Kardashians, and the constant scrutiny that comes with such fame, 20-year-old Jenner revealed that men come “and can’t handle it.”\n\nHowever, it is not just men who fall victim to the “curse” - friends do as well.\n\nThe fame is just one part of the problem, with the negative parts of being in the public eye making up the other.\n\n“But it’s not just men - it’s friends. It’s people who come and just don’t know how to handle it. It’s the negative. There’s a lot of people who love us, but there’s also a huge handful of people who don’t like us,” Jenner explained.\n\nAs for 27-year-old rapper Scott, with whom Jenner had daughter Stormi earlier this year, he seems relatively unconcerned by the threat of a curse.\n\nAlthough the pair has been dating for just over a year, after meeting at the music festival Coachella, Scott is confident in the relationship he’s built with Forbes self-made billionaire Jenner.\n\n“Kylie actually likes me for me,” the rapper told the magazine.\n\nThe couple may not have been dating long, but they know the importance of love and family.\n\n“He deals with it because we love each other and we have a family,” the youngest of the Kardashian family said.", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/07/18/14/gettyimages-634632744.jpg", "http://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/07/18/14/gettyimages-634632744.jpg", "keywords": [], "authors": ["Chelsea Ritschel"], "canonical_link": "https://www.independent.co.uk/life-style/kylie-jenner-travis-scott-kardashian-curse-billionaire-stormi-a8452981.html", "title": "Kylie Jenner and Travis Scott discuss the 'Kardashian Curse' in new GQ interview", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "https://www.independent.co.uk/life-style/kylie-jenner-travis-scott-kardashian-curse-billionaire-stormi-a8452981.html", "title": "This is what Kylie Jenner thinks of the 'Kardashian Curse'", "description": "The couple appear on August's cover of GQ in their first-ever joint photo shoot", "updated_time": "2018-07-18T15:46:16+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/07/18/14/gettyimages-634632744.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/8452981"}, "description": "Billionaire beauty mogul Kylie Jenner and her boyfriend Travis Scott discussed the rumoured “Kardashian Curse” in a recent interview - and it looks like there may be some truth to it. The “Kardashian Curse” was coined when Scott Disick, a former boyfriend of Kourtney Kardashian, recruited a medium to help rid him of the bad luck which he says accompanies men who date a", "keywords": "Kylie Jenner, Travis Scott, Stormi, Kardashian, Lifestyle", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Kylie Jenner", "published_time": "2018-07-18T15:45:00+01:00", "modified_time": "2018-07-18T15:46:16+01:00", "section": "Lifestyle", "author_name": "Chelsea Ritschel", "content_type": "story", "word_count": 385, "image_count": 2, "video_count": 0, "embed_count": 0, "internal_link_count": 1, "external_link_count": 5}, "twitter": {"title": "This is what Kylie Jenner thinks of the 'Kardashian Curse'", "description": "Billionaire beauty mogul Kylie Jenner and her boyfriend Travis Scott discussed the rumoured “Kardashian Curse” in a recent interview - and it looks like there may be some truth to it. The “Kardashian", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1531925100.0, "source": "http://www.independent.co.uk", "summary": ""}