{"url": "https://web.archive.org/web/20180702032513/http://wesupportdonaldtrump.com:80/mexico-next-president-invasion-1-a/", "text": "For the mainstream media to say that illegal immigration isn’t an issue they really need to look at the world around them and see how things really are out there.\n\nFor decades there have been people that came to the United States illegally, but it’s only in the past year or so that it seems that people have been doing it just to spite the system.\n\nPeople don’t mass organize like this without someone leading the charge.\n\nCurrently, ahead of all other candidates, Andres Manuel Lopez Obrador will likely be the next President of Mexico.\n\nAndres Manuel Lopez Obrador, also known as “AMLO,” has been openly telling his people to flood the U.S. border. What AMLO is asking his people is not a surprise…\n\nHe has an actual strategic policy behind his plan.\n\nApparently, he has been planning this for years but nobody really cared to pay attention.\n\nAMLO’s key economic plan for Mexico is to become wealthy, and recently he has received a broad mainstream Mexican understanding.\n\nConservatives in the U.S. have no idea about Mexico’s plan, but the far-left and democratic immigration radicals sure do.\n\nReported by 100percentfedup: Well…at least a leader of Mexico is admitting what’s been going on for a loooong time. The radical open borders element on both sides has been welcoming millions of illegals for decades. Yes, decades…\n\nOpen borders advocates on the left see policing the border as a form of cruelty and American imperialism. There are also radical organizations that feel Mexico deserves a southern portion of America.\n\nLa Raza aka “The Race” is a radical organization seeking open borders along with many of the George Soros-funded open borders groups:\n\nGEORGE SOROS’S OPEN BORDER FOUNDATIONS: An inside look at the machinations of the multibillionaire and his mission to destroy national sovereignty.\n\nTHE FUTURE PRESIDENT OF MEXICO… Andrés Manuel López Obrador aka AMLO:\n\n(From the Daily Caller) […] “And soon, very soon — after the victory of our movement — we will defend all the migrants in the American continent and all the migrants in the world,” Obrador said, adding that immigrants “must leave their towns and find a life in the United States.” He then declared it as “a human right we will defend.”\n\nThe Conservative Treehouse warns: It would take Mexico several decades to achieve a level of wealth even close to the U.S., and they have no structural (political) systems in place to form the foundation of such an approach. So, AMLO’s faster plan is to use migration into the U.S. to break down barriers, collapse the economic dam and allow the natural flood of U.S. wealth to flow into Mexico.\n\nFrom the Mexican perspective this is a pretty solid economic approach that just might work; and they have open-border comrades within the progressive, democrat, republican and corporate political systems (all over the U.S) who already support such a strategy.\n\nRead More", "images": ["https://web.archive.org/web/20180702032513im_/http://wesupportdonaldtrump.com/wp-content/uploads/2018/02/WeSupportDT-HeaderSmallHeight.jpg", "https://web.archive.org/web/20180702032513im_/https://i0.wp.com/www.americanjournalreview.com/wp-content/uploads/2018/06/Screen-Shot-2018-06-23-at-7.17.45-AM.png?resize=771%2C514", "https://web.archive.org/web/20180702032513im_/http://wesupportdonaldtrump.com/wp-content/uploads/2018/06/Screen-Shot-2018-06-23-at-7.13.46-AM.png", "https://web.archive.org/web/20180702032513im_/http://wesupportdonaldtrump.com/wp-content/uploads/2018/06/next-signal-1-1-1-1-1-1-1-1-2.png", "https://web.archive.org/web/20180702032513im_/http://wesupportdonaldtrump.com/wp-content/uploads/2018/06/Screen-Shot-2018-06-23-at-7.13.46-AM-300x169.png"], "top_img": "https://web.archive.org/web/20180702032513im_/http://wesupportdonaldtrump.com/wp-content/uploads/2018/06/Screen-Shot-2018-06-23-at-7.13.46-AM.png", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20180702032513/http://wesupportdonaldtrump.com/mexico-next-president-invasion-2-b/", "title": "MEXICO’S NEXT PRESIDENT Calls for An Invasion Of The US….", "meta_data": {"og": {"type": "article", "url": "https://web.archive.org/web/20180702032513/http://wesupportdonaldtrump.com/mexico-next-president-invasion-2-b/", "title": "MEXICO’S NEXT PRESIDENT Calls for An Invasion Of The US….", "description": "We are literally under attack...", "site_name": "We Support Donald Trump", "image": "https://web.archive.org/web/20180702032513im_/http://wesupportdonaldtrump.com/wp-content/uploads/2018/06/Screen-Shot-2018-06-23-at-7.13.46-AM.png"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}