{"url": "https://en.wikipedia.org/wiki/Ciara", "text": "Ciara Princess Harris-Wilson ( see-ERR-ə; born October 25, 1985)[1][2] is an American singer, songwriter, dancer, and model. Born in Austin, Texas, she traveled around the world during her childhood, eventually moving to Atlanta, Georgia where she joined the girl group Hearsay. She later signed a publishing deal, and befriended producer Jazze Pha, who recorded demos that would appear on her debut album. With his help, Ciara signed a record deal with LaFace Records.\n\nIn 2004, Ciara released her debut studio album Goodies, which spawned four singles: \"Goodies\", \"1, 2 Step\", \"Oh\" and \"And I\". \"Goodies\" topped the Billboard Hot 100 chart. The album was certified triple platinum by the Recording Industry Association of America (RIAA) and garnered four nominations at the 48th Annual Grammy Awards. Ciara was also featured on Missy Elliott's \"Lose Control\" and Bow Wow's \"Like You\", both of which reached number three on the Billboard Hot 100. In 2006, Ciara released her second studio album, Ciara: The Evolution, which spawned the hit singles \"Get Up\", \"Promise\", \"Like a Boy\" and \"Can't Leave 'em Alone\". The album reached number one in the U.S. and was certified platinum.\n\nCiara's third studio album, Fantasy Ride (2009) was less successful than her first two albums. However, it produced the international top-ten single \"Love Sex Magic\", featuring Justin Timberlake, which received a Grammy Award nomination for Best Pop Collaboration with Vocals. The following year, Ciara released her fourth studio album Basic Instinct, which included the R&B top-five single \"Ride\", but was met with low sales, continuing a downward trend in her commercial performance. Ciara signed a new record deal with Epic Records in 2011. In 2013, she released her fifth studio album, Ciara, which spawned the R&B top-ten single \"Body Party\". Her sixth album, Jackie (2015), included the singles \"I Bet\" and \"Dance like We're Making Love\".\n\nIn 2006, Ciara made her film debut in All You've Got, and later appeared in the films Mama, I Want to Sing! (2012) and That's My Boy (2012). In 2013, she had a recurring role in the US TV series, The Game. In 2016, Ciara signed a signed a modeling contract with IMG.[3] That year, she became a Global Brand Ambassador for the cosmetics giant Revlon.[4] Since making her musical debut in 2004, Ciara has attained eight Billboard Hot 100 top-ten singles. She has also received many awards, including three BET Awards, three MTV Video Music Awards, three MOBO Awards, and one Grammy Award. As of 2015, Ciara has sold over 23 million records worldwide.[5] In 2016, she married quarterback Russell Wilson.\n\nEarly life\n\nCiara Princess Harris was born in Austin, Texas, on October 25, 1985,[1] the only child of Jackie and Carlton Clay Harris.[6] An army brat, she grew up in Germany, New York, Utah, California, Arizona, and Nevada.[7] She was named after the Revlon fragrance Ciara which was introduced in 1973 and is still sold today.[8] During her teens, Ciara and her family settled in Atlanta, Georgia.[7]\n\nIn her mid-teens, Ciara formed the all-girl group Hearsay with two of her friends.[who?] The group recorded demos, but as time went on, they began to have differences and eventually parted ways.[7] Despite this setback, Ciara was still determined to reach her goal and signed a publishing deal as a songwriter.\n\nHer first writing credit was on Blu Cantrell’s debut album, So Blu for the song “10,000 Times.” She also wrote the song \"Got Me Waiting\" for R&B singer Fantasia Barrino's debut album, Free Yourself.[7] It was when she was writing songs that she met music producer, Jazze Pha, whom she called her \"music soulmate.\" In 2002, the two recorded four demos, \"1, 2 Step\", \"Thug Style,\" \"Pick Up the Phone,\" and \"Lookin' at You,\" which all appeared on her debut album, which was released two years later. \"1, 2 Step\" was the second single released from it and became a hit.[7]\n\nCareer\n\n2003–2005: Goodies\n\nAfter graduating from Riverdale High School in Riverdale, Georgia in 2003, she was signed by LaFace Records executive, L.A. Reid, whom she was introduced to by Jazze Pha.[9] She began production on her debut album later that year. In early 2004, she wrote a demo with record producer, Sean Garrett, which came to the attention of Lil Jon and became her debut single \"Goodies\". Lil Jon stated later that he knew it would be big seeing how it sounded similar to Usher's international hit, \"Yeah!.\"[7]\n\nCiara released her debut album Goodies on September 28, 2004. The album debuted at number three on the U.S. Billboard 200, selling 124,750 copies in its initial week[10] and topped the Top R&B/Hip-Hop Albums chart. Following the release of the album, Ciara was hailed as the \"First Lady of Crunk&B\". Goodies had a seventy-one-week run on the Billboard 200, and was certified three times-platinum by the Recording Industry Association of America on October 10, 2006.[11] The album has sold around nearly 3 million copies in the United States as of June 2010.[12] Charting at twenty-two on the Canadian Albums Chart, it was certified Platinum by the Canadian Recording Industry Association.[13] The album charted at twenty-six on the UK Albums Chart, and spent twenty weeks on the chart.[14] It was certified Silver by the British Phonographic Industry, remaining to be Ciara's sole certified album in the UK.[14]\n\nGoodies' lead single, the title track, featuring Petey Pablo, was released on June 8, 2004. Conceived as a crunk female counterpart to Usher's \"Yeah!\", the lyrical content goes against the grain, speaking of abstinence, rejecting advances because \"the goodies will stay in the jar.\" Critics hailed it as an \"anthem of the summer\" and one of the best singles of the year, complementing its dance-feel and beat, and the irony of the \"clever\" lyrics. The single performed well worldwide, topping the charts in Canada, the United States and the United Kingdom, and charting in the top ten of other charts, receiving Platinum certification in the United States.[15][16] \"1, 2 Step\" featuring Missy Elliott was released as the album's second single.[17] The song peaked in the top ten of many countries, topping the charts in Canada, and went on to become Platinum or Gold in many countries.[15][16] \"Oh\" featuring Ludacris was released as the third single on March 5, 2005. The song performed well worldwide, appearing in the top ten of seven charts, and certified either Platinum or Gold in multiple regions.[15][16]\n\nFollowing the success of the album, Ciara released a CD/DVD entitled Goodies: The Videos & More in the United States on July 12, 2005 which featured remixes to \"1, 2 Step\" and \"Oh\", as well as two new songs. The release was certified platinum in the United States. She made guest appearances on Missy Elliott's single \"Lose Control\" and on Bow Wow's single \"Like You\", which both peaked at number three in the United States and obtained worldwide success. She was an opening act for Gwen Stefani's Harajuku Lovers Tour 2005 and went on tour with Chris Brown and Bow Wow on the Holiday Jam Tour in December 2005. At the 48th Annual Grammy Awards, Ciara received four nominations for Best New Artist, Best Rap/Sung Collaboration for \"1, 2 Step\", Best Rap Song for Missy Elliott's single \"Lose Control\", and won her last nomination, Best Short Form Music Video for Lose Control.[18]\n\n2006–2007: Ciara: The Evolution and acting debut\n\nOn December 5, 2006, Ciara released her second studio album, Ciara: The Evolution. According to the singer, the title of the album is \"about so much more than just my personal growth – it's about the evolution of music, the evolution of dance, the evolution of fashion.\"[19] The source of the album's creativity such as the sound and edge comes from Ciara in general.[20] Ciara: The Evolution became Ciara's first number one album on the U.S. Billboard 200 and second on the Top R&B/Hip-Hop Albums charts with sales of more than 338,000 becoming her highest first week of sales to date. The album went on to be certified platinum by the RIAA in the United States, within only five weeks of its release, and has sold 1.3 million copies according to Nielsen SoundScan.[12] It sold over two million copies worldwide.[21]\n\nThe album's international lead single, \"Get Up\", which features Chamillionaire, reached number seven in the United States and gained a platinum accreditation. It reached number five in New Zealand.[22] The song was used for the film Step Up (2006) and featured on the film's soundtrack. The album's US lead single, \"Promise\", reached number eleven on the Billboard Hot 100 and became her third number one single on the Hot R&B/Hip-Hop Songs chart. \"Like a Boy\" was released as the second international single which reached within the top twenty in the UK,[23] Finland,[24] France, Ireland, Sweden[25] Switzerland, and also in the United States.[26] The fourth and final single from the album, \"Can't Leave 'em Alone\", reached number 10 on the Hot R&B/Hip-Hop Songs chart and number 40 on the Billboard Hot 100.[27] The song became Ciara's fifth single to peak in the top in New Zealand, peaking at number 4.[28] The song achieved moderate success in other international markets.\n\nIn support of the album, Ciara went on her first headlining tour in October 2006. The tour went to seventeen different clubs in cities throughout the United States. The tour was met with mixed to positive reviews; critics were divided regarding the pre-recorded backing tracks and remarked that Ciara was slightly under-prepared to host her headlining tour, but ultimately praised her energetic choreography. In August 2007, she headlined the Screamfest '07 tour with fellow rapper, T.I.. Critics praised her performance for her gracious dancing and being able to command a sold-out arena.[29] Ciara, along with Chris Brown and Akon, was a support act for Rihanna's Good Girl Gone Bad Tour in the United Kingdom. She made a guest appearance on \"So What\" by Field Mob. The single went on to become a top 10 hit on the Billboard Hot 100. She also appeared on Tiffany Evans' single \"Promise Ring\". The song achieved little success on the Hot R&B/Hip-Hop Songs chart.\n\nIn addition to her music, Ciara made her acting debut in the MTV Films production All You've Got in May 2006. In the movie she played Becca Whiley, a teenager who is competing in a volleyball tournament. The movie received mixed to positive reviews; critics said the movie was predictable but still enjoyable.[30]\n\n2008–2011: Fantasy Ride, Basic Instinct and label change\n\nCiara at the Maxim Magazine's 10th Annual Hot 100 Celebration in 2009\n\nIn October 2008, Ciara was honored as Billboard's \"Woman of the Year\", because of her success as a recording artist and leadership in embracing the changing music business.[31] Although her third album was originally scheduled for a September 2008 release, Fantasy Ride was released after several delays in May 2009. The album combines her R&B and hip hop sound from her previous albums along with a new pop and dance sound. While talking to MTV News, Ciara said, \"I'm having a bit more fun with my lyrics. I'm not afraid. In the beginning, I was conscious and really protective and somewhat scared about doing some things. With this album I'm not holding back, there's freedom. It's just the space I'm in right now.\"[32] It became Ciara's first top ten album in the UK and Canada. In the United States, Fantasy Ride debuted at number three on the Billboard 200, becoming Ciara's third consecutive album to debut within the top three on the chart. To date,[when?] it has sold 193,000 copies, according to Nielsen SoundScan.[12]\n\n\"Go Girl\" was the first single released from the album. It was originally the lead single from the album, but the single achieved minimum success and was later deemed a promo single. However, the single managed to reach the top of the charts in Japan. The album's official lead single, \"Never Ever\", which features Young Jeezy, was released in the United States in January 2009 and reached a peak of number nine on the U.S. Hot R&B/Hip-Hop Songs. The second single, \"Love Sex Magic\", featuring Justin Timberlake, became a worldwide hit, peaking within the top ten in twenty countries including the U.S., where it peaked at number ten on the Billboard Hot 100. It went on to be certified platinum in Australia[33] and received a gold accreditation in New Zealand.[34] It received a nomination for \"Best Pop Collaboration with Vocals\" at the 52nd Annual Grammy Awards and also for Best Choreography in a Video at the 2009 MTV Video Music Awards. \"Like A Surgeon\" was the fourth single from the album. The song received no promotion and no single cover nor music video was released. However, the song did manage to peak at number fifty-nine on the Hot R&B/Hip-Hop Songs chart from airplay alone.[35] \"Work\", the final single, achieved moderate success in international markets.\n\nIn July 2009, Ciara headlined the Jay-Z & Ciara Live tour with Jay-Z. Her performance received mixed reviews; critics said although her dancing was top-notch, she seemed disconnected from the crowd.[36] She was also the support act for Britney Spears's Circus tour, where she performed eight nights at London's prestigious O2 Arena during June 2009.[37] Her performance received rave reviews from critics and fans alike, who noted her dancing skills as being spectacular and arguably better than Britney Spears'.[38] Ciara made a guest appearance on Nelly's single \"Stepped On My J'z\" from his album Brass Knuckles. The song achieved minimal success in the U.S.. Ciara was also featured on Enrique Iglesias' single, \"Takin' Back My Love\", from his Greatest Hits album. The song became an international hit, peaking in the top ten of over fifteen countries, and being certified Gold in Russia, with sales of over 100,000. In February 2010, Ciara along with Pitbull was featured on the remix to Ludacris' hit single \"How Low\". The following month, Ciara made a cameo appearance in the music video of Usher's single, \"Lil' Freak\".\n\nCiara released her fourth studio album, Basic Instinct, on December 14, 2010. She told Pete Lewis of Blues & Soul magazine that the album is about her trusting her instinct and going back to the R&B/urban basics, in the days of \"Goodies\" and \"1, 2 Step\".[39] It was executively produced by the singer alongside her A&R agent Mark Pitts and writing/production duo Tricky Stewart and The-Dream who also produced records for her previous album, Fantasy Ride. Basic Instinct debuted at number forty-four on the U.S. Billboard 200 chart, with first-week sales of 37,000 copies, becoming her only album to not peak within the top three.[40] On the U.S. R&B/Hip-Hop Albums chart, the album opened at number eleven,[41] her only album to not peak within the top two of the chart. The lead single, \"Ride\", which features Ludacris, was released on April 26, 2010. It peaked at number forty-two on the U.S. Billboard Hot 100, number three on the U.S. Hot R&B/Hip-Hop Songs chart,[42] becoming her twelfth top ten hit on the chart,[43] and number seventy-five on the UK Singles Chart.[44] The accompanying music video won the award for \"Best Dance Performance\" at the 2010 Soul Train Music Awards.[45] \"Speechless\" was released as the second single from the album and achieved minimal success, peaking at only number seventy-four on the Hot R&B/Hip-Hop Songs chart.[26] \"Gimmie Dat\", the third single from the album was praised by critics but failed to become a hit, peaking at only sixty-three on the Hot R&B/Hip-Hop Songs chart,[26] and number twenty-seven on the urban charts in the UK.[46] In November 2010, Ciara performed at the Summerbeatz tour alongside Flo Rida, Jay Sean, Akon, Travie McCoy and Ja Rule.[47] In the summer of 2011, Ciara was a part of the Malibu Rum Tour. She performed in seven shows across the US.[48]\n\nIn February 2011, following rumors that Ciara had been dropped by Jive Records, she released an official statement to her Facebook page complaining of inadequate promotion and funding from the label. She stated that she received a lack of support from the label, and even paid for the promotion of some singles, such as \"Gimmie Dat\", herself. The frustration she felt while working with her third and fourth albums led her to request that she be released from her contract.[49] In May 2011, Ciara was removed from the Jive Records website roster.[50] On July 12, 2011, it was reported that she had reunited with L.A. Reid by signing with his record label Epic Records,[51] and was confirmed in September 2011.[52]\n\n2012–2013: Ciara and further acting\n\nCiara in 2012\n\nDuring an interview with Sway in the Morning in February 2012, Ciara revealed that she would be taking her time recording her fifth studio album, stating: \"It's just really about the vibe, and I'll just tell you that it's a good vibe going. It's really important for me to take my time with this record and it's important for the whole team. It's really, really good energy.\"[53] She has been working on the album with a number of producers and songwriters, including Hit-Boy, Soundz, Diane Warren, Tricky Stewart, and The Underdogs.[54][55][56] In an interview, Ciara said \"I worked with some people that are very fresh, which I'm excited about... When it comes to artists, when it comes to writers, when it comes to producers, I really wanted to push. We pretty much reached out and worked with a lot of people that I've never worked with before, which is really fun.\"[57]\n\nDuring a press conference with MTV in May 2012, Ciara announced her fifth studio album would be titled One Woman Army and said the lead single, \"Sweat\", would be out very soon.[58][59] The single, which features rapper 2 Chainz, premiered online on June 4, 2012, and was to be released via iTunes on June 19, 2012.[60] However, the release of the single was scrapped at the last minute for unknown reasons. On August 13, 2012, Ciara revealed that the official lead single for the album would be titled \"Sorry\".[61] On September 13, 2012, the official music video for \"Sorry\" was premiered on BET's 106 & Park as well as VEVO. \"Sorry\" was made available for purchase as a digital download on September 25, 2012, and impacted U.S. Urban contemporary and Rhythmic radio stations on October 9, 2012.[62] In the United States, \"Sorry\" reached a peak at forty on the U.S. Billboard Hot R&B/Hip-Hop Songs chart[63] while charting at No 22 on Billboard's Bubbling Under Hot 100 Singles chart listing of the top 25 songs that have yet to enter the Billboard Hot 100.\n\nOn October 21, 2012, Rap-Up magazine posted a behind-the-scenes sneak peek of \"Got Me Good\", the second single from the album. The song and video, which was directed by Joseph Kahn, premiered on the Sony JumboTron in Times Square in New York City on October 25, 2012. The single was released via digital download on November 6, 2012.[64] \"Got Me Good\" impacted rhythmic radio on November 13,[65] and mainstream radio on December 4.[66]\n\nOn April 15, 2013, the same day the album's track listing was revealed, it was also announced that the album is not titled One Woman Army anymore and that the new title is Ciara. Due to their low performance on the charts, the label decided not to include \"Sweat\", \"Sorry\", and \"Got Me Good\" on the tracklist. Instead, it was later announced that a new song titled \"Body Party\" would serve as the lead single. It was released in March 2013 and so far-reaching number 22 on the Billboard Hot 100 and number two on the U.S. Billboard \"Hot R&B/Hip-Hop Songs\" chart. The second single is \"I'm Out\" featuring Nicki Minaj. The album was released on July 9, 2013.[67] The album debuted at number two on the Billboard 200 chart, with first-week sales of 59,000 copies in the U.S.[68] The album became Ciara's fourth album to chart within the top three of the Billboard chart.[68] The album charted at number two on the Top R&B/Hip-Hop Albums[69]\n\nAside from music in 2012, Ciara also starred in two movies during this time. She starred in the straight-to-DVD film, Mama, I Want to Sing!. She played Amara Winter, a preacher's daughter who was discovered by a well-established musician.[70] She appeared as Brie in the 2012 comedy film, That's My Boy. Ciara made an appearance as herself playing Lauren London's best friend on the Season 6 premiere of BET's The Game which aired on March 26, 2013, she continued to be a recurring cast member throughout the season.[71]\n\n2014–present: Jackie and Beauty Marks\n\nIn September 2013, producer Mike WiLL Made It revealed that Ciara had begun work on her sixth studio album.[72] In December 2013, Ciara confirmed she was in the process of making a new album.[73] During an interview with Rap-Up magazine Ciara revealed that recording for her sixth album began around Thanksgiving of 2013 and she would be releasing new music \"really soon\".[74] In late January 2014, Ciara premiered a live version of a song entitled \"Anytime\" at the Degree Women Grammys Celebration in Los Angeles, on February 2, 2014, Ciara premiered the studio version produced Boi-1da and Katalyst featuring her then-boyfriend and rapper Future.[75] After her engagement to Future, Ciara revealed to W in April 2014 that her sixth studio album would be predominantly inspired by her then-fiancé.[76] Ciara gave birth to her first child in May 2014. After claims of Future's infidelity during their relationship had surfaced, it was reported that the couple's engagement had been called off.[77] Following their very public break-up, Ciara's album release was further postponed to 2015,[76] and during this time the singer \"quietly\" recorded new music, while concentrating on motherhood.[78]\n\n\"I Bet\", the lead single from her upcoming album Jackie, was released on January 26, 2015.[79][80] In May 2015, Ciara embarked on her first headlining tour in six years. The month-long Jackie Tour kicked off on May 3, 2015 in Chicago and included stops in New York, Boston, New Orleans, Dallas, and Los Angeles. The first round of US dates wrapped May 31 in San Francisco.[81][82] Ciara's sixth album, Jackie, was released on May 1, 2015.[83] It includes the singles \"I Bet\" and \"Dance like We're Making Love\". The album debuted at number 17 on the Billboard 200 with 25,000 equivalent album units (19,900 in sales) and has the lowest first-week sales amongst her first six albums.[84]\n\nCiara is currently working on a seventh studio album and has stated that the album will feature her undertaking a new musical direction.[85] On January 27, 2017, it was announced that Ciara had signed a deal with Warner Bros. Records.[86][87] On July 17, 2018, Ciara released her new single and its accompanying music video, \"Level Up\". The song is the first single from her upcoming seventh studio album.[88] Ciara announced her seventh studio album, Beauty Marks, is set to be released on May 10, 2019.[89] In addition to \"Level Up\", the album has spawned the singles \"Freak Me\", \"Dose\", \"Greatest Love\" and \"Thinkin Bout You\".[90] Ciara performed \"Thinkin Bout You\" at the 2019 Billboard Music Awards.[91]\n\nIn 2019, Ciara will judge alongside David Dobrik and Debbie Gibson in a new musical competition on Nickelodeon titled America's Most Musical Family.[92]\n\nArtistry\n\nVocals and musical style\n\nCiara is known for her often \"breathy soprano\" vocals.[93][94] With the release of her debut single \"Goodies\", Ciara was referred to as the Princess of Crunk&B.[95] Allison Stewart of The Washington Post commented that she has a \"reedy, agile voice, capable of conveying the only three emotions (sexy, sassy, sad) an R&B singer needs.[96] Randall Roberts of the Los Angeles Times said that she \"has been the most synthetic of the R&B divas over the past decade, an electro-leaning vocalist whose instrumental palate has heavily favored stark 808 beats, sassy and seductive vocal lines.\"[97] In reviewing her second album Ciara: The Evolution, Jody Rosen of Entertainment Weekly wrote: \"Ciara's comfort with rave-inspired beats sets her apart from Cassie, Amerie, Rihanna, and other would-Beyoncés...[Her] singing is nimble throughout: She whispers, coos, wails, and reels off speedy syncopations worthy of Beyoncé herself.\"[98] Her third album, Fantasy Ride, saw the singer showcasing a new pop and dance direction. Ciara's music is generally contemporary R&B, but it also incorporates other genres including hip hop, crunk, dance-pop, electropop and funk. Critics have described her singles \"Goodies\", \"1, 2 Step\", \"Get Up\", and \"Go Girl\" as club bangers.[99]\n\nCiara's debut album featured production from Jazze Pha who discovered her. Critics compared the album to late singer Aaliyah[100][101] and said it had qualities of Destiny's Child.[101]\n\nInfluences\n\nCiara has cited Michael Jackson as one of her biggest influences.\n\nCiara said that watching Destiny's Child and Janet Jackson perform on television inspired her to pursue a career in music,[7] and cites Jackson and her brother Michael as her biggest inspirations.[102] Ciara considered herself to reach \"a career pinnacle\" when she featured on Janet Jackson's 2008 album Discipline. She has cited Beyoncé as an influence, citing her career longevity as an influence continuing to say \"I have a lot of respect for her. I respect any woman that works hard and gets success from the hard work that they put into it\".[103]\n\nCiara spoke of Michael Jackson's legacy, \"Whenever someone asks me who inspires me to do what I do, I always say Michael. That's it for me. He's everything to me. He's really a part of the reason why. He's going to be remembered in so many ways for me. I feel it's important for me to continue to let my generation know how important he was to music.\"[104] Ciara also cites Whitney Houston, Aaliyah, TLC, SWV, Monica and Salt-N-Pepa, as influences.[105] Her second studio album Ciara: The Evolution (2006) was influenced by Michael Jackson, Prince, and pop singer Madonna.[106] During the recording of her fifth self-titled album Ciara (2013), she was inspired by Al Green and Missy Elliott.[107]\n\nStage presence\n\n\"Super C is a character that people will learn more about on this record. That is my alter ego. Super C doesn't hold back. She is definitely aggressive. She goes hard. Super C can do some magical and funky things. She works hard. She dances to the 10th power. She does everything to the 10th power.\" — Ciara, speaking on her alter ego Super C.[108]\n\nCiara has received praise for her stage presence and routines during live performances. Dalondo Moultrie of The Morning Call's praised Ciara's stage presence saying that she \"put on one of the best performances I have seen yet at [Crocodile Rock]\".[109] Moultrie continued to call her dance steps \"incredible\", noting that it was in sync with the music, \"each pelvic thrust or body-bending twist\" and the periodic bursts of light. In conclusion, Moultrie praised Ciara's live performances and their \"high-energy songs, sexy dance moves, flawless vocals, and a top-flight light show\".[109]\n\nSia Michel of The New York Times praised Ciara's relentless professional presence stating: \"Ciara led a squad of hip-hop dancers through stylishly choreographed routines. Striding about in a headset, she was a commanding and relentlessly professional presence.\"[110]\n\nAt the time of the release of Fantasy Ride (2009) Ciara introduced her alter ego \"Super C\". Ciara said that Super C is her \"inner strength and aggressive persona\" – a futuristic, superhero-esque woman, loosely based on the robotic character Ciara portrayed in the \"Go Girl\" music video. Ciara described her reasoning for developing an alter ego, \"There's so much negative energy in the world, especially within the blogging world, they try so hard to tear you down. [With the superhero concept] it's like, 'I refuse to let you and that negative energy tear me down or stop any blessing that I know is there for me.' That's when the inner superhero comes out.\"[111]\n\nLegacy and impact\n\nWith the release of her debut single \"Goodies\", Ciara was referred to as the Princess of Crunk&B.[95] Allison Stewart of The Washington Post commented that she has a \"reedy, agile voice, capable of conveying the only three emotions (sexy, sassy, sad) an R&B singer needs.[96] Randall Roberts of Los Angeles Times commented that \"Ciara has been the most synthetic of the R&B divas over the past decade, an electro-leaning vocalist whose instrumental palate has heavily favored stark 808 beats, sassy and seductive vocal lines.\"[112] In the early to mid-2000s, some crunk music hits like \"Get Low\", \"Goodies\", \"Yeah!\" and \"Freek-a-Leek\" produced by Lil Jon climbed to the Top 10 of the Billboard Hot 100 charts. Both \"Yeah!\" and \"Goodies\" were the first tracks to introduce the substyle of crunk music and contemporary R&B, called crunk&B, to the public. Both of those tracks (performed by Usher and Ciara, respectively) were the main mainstream hits of 2004.[113] Since then, crunk&B has been one of the most popular genres of sung African-American music, along with electropop, the genre that replaced crunk and crunk&B in the charts in 2008. After the album's lead single reached the summit of the US Billboard Hot 100, it spent seven weeks at number one, becoming the longest-running number-one debut single by a female artist since 1977[114]\n\nThe album's lead single's success exemplified urban music's commercial dominance during the early 2000s, which featured massive crossover success on the Billboard charts by R&B and hip hop artists.[115] In 2004, all 12 songs that topped the Billboard Hot 100 were African-American recording artists and accounted for 80% of the number-one R&B hits that year.[115] Along with Usher's streak of singles, Top 40 radio and both pop and R&B charts were topped by OutKast's \"Hey Ya!\", Snoop Dogg's \"Drop It Like It's Hot\", Terror Squad's \"Lean Back\", and Ciara's \"Goodies\".[115] Chris Molanphy of The Village Voice later remarked that \"by the early 2000s, urban music was pop music.\"[115]\n\nPersonal life\n\nCiara is married to Seattle Seahawks quarterback Russell Wilson. They began dating in early 2015 and announced their engagement on March 11, 2016.[116][117] They were married on July 6, 2016, at Peckforton Castle in Cheshire, England, where Ciara wore a dress designed by Roberto Cavalli’s Peter Dundas. [118][119] Together, Ciara and Wilson have one child, a daughter, born on April 28, 2017.[120] In January 2020, Ciara announced they were expecting their second child together.[121]\n\nCiara also has a son, born on May 19, 2014, from her previous relationship with Future.[122] Ciara and Future were engaged in October 2013, but ended the engagement in August 2014.[123]\n\nOther ventures\n\nCiara became the face of Jay-Z's Rocawear clothing line and spokesperson for the women campaign entitled \"I Will Not Lose\", which debuted in the summer of 2007. In the October issue of Vibe Magazine, she appeared, apparently nude, on the magazine cover but claimed Vibe had airbrushed her clothes off. She told MTV News that she was hurt by the photos and was quite shocked when she finally got her hands on the month's issue. She later confirmed that she was in fact clothed.[124] In September 2008, Ciara contributed to the song \"Just Stand Up!\" with fifteen other female artists, who shared the stage to perform the song live on September 5, 2008 during the \"Stand Up to Cancer\" television special. The proceeds from the single were given to the fundraiser.[125] The television special helped raise $100 million for cancer research.[126]\n\nIn 2009, Ciara became the face of Dosomething.org's \"Do Something 101\" campaign to raise school supplies for those in need at the start of the school year.[127] She filmed a public service announcement to endorse the campaign.[128]\n\nIn 2009, Ciara signed a multimillion-dollar deal with the modeling agency Wilhelmina Models. After signing the deal she has been in many magazine spreads. In addition to that, she also has her eyes set on beginning a new clothing line. In June 2008, she was in talks with the department store Steve & Barry's to create an affordable clothing line,[129] but it never happened. On November 9, 2009, it was announced that Ciara would be modeling in the German edition of Vogue.[130] During that time, it was also announced that Ciara would be the new face of a major multimedia ad campaign for Verizon's smartphone the LG Chocolate Touch. Ciara filmed a commercial for the campaign, which features her dancing to her 2009 single, \"Work\".[131] In March 2010, it was officially confirmed and announced that Ciara was the spokesperson in the new ad campaign for Adidas Originals. A commercial for the campaign was released the same month, featuring numerous other celebrities.[132]\n\nOn May 12, 2016, it was announced that Ciara signed a modeling contract with IMG.[3] Later that year, she became a Global Brand Ambassador for the cosmetics giant Revlon.[4]\n\nIn August 2019, she and her husband Russell Wilson became part of the ownership group of Seattle Sounders FC in Major League Soccer.[133]\n\nDiscography\n\nTours\n\nFilmography\n\nSee also", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/3/33/Ciara_AMAs_2019.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Obama_%26_Abe_Greet_Russell_Wilson_%26_Ciara_2015.jpg/220px-Obama_%26_Abe_Greet_Russell_Wilson_%26_Ciara_2015.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/Ciara_2009.jpg/220px-Ciara_2009.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Ciara_AMAs_2019.png/220px-Ciara_AMAs_2019.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Ciara_Live_2.jpg/250px-Ciara_Live_2.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Ciara_2012.png/220px-Ciara_2012.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Michael_Jackson1_1988.jpg/170px-Michael_Jackson1_1988.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/Ciara_Opening_for_Bruno_Mars_at_the_Prudential_Center_in_Newark_%2831196092508%29.jpg/220px-Ciara_Opening_for_Bruno_Mars_at_the_Prudential_Center_in_Newark_%2831196092508%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/3/33/Ciara_AMAs_2019.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Ciara", "title": "Wikipedia", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/3/33/Ciara_AMAs_2019.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}