{"url": "www.usmagazine.com/celebrity-news/news/a-history-of-kanye-west-kardashians-feuds-with-amber-rose-blac-chyna-w162785/", "text": "In the immortal words of Hilary Duff, “Let’s go back, back to the beginning.” January 2016 played host to a series of Kardashian-Jenner-West-Rose-Chyna feuds that have been years in the making.\n\nFrom “cool pants” to clover emojis, there’s a lot of backstory that needs explaining in order to completely understand everything that went down among Kanye West and Wiz Khalifa and Rob Kardashian and Blac Chyna.\n\nTo keep you informed, Us Weekly has broken it down with a comprehensive timeline of events.\n\nKanye West Dates Amber Rose\n\nIn 2008, the Grammy-winning rapper started a relationship with unknown model Rose after spotting her in Ludacris’ “What Them Girls Like” music video. The pair had a public two-year romance.\n\nAmber Rose Breaks Up With Kanye West\n\nIn mid-2010, Rose called things off with West. A year after the split, Rose appeared on The Wendy Williams Show, noting, “[Kanye] said that he was an a-hole and he was mean to me and he didn’t treat me the way he was supposed to. I accepted his apology because I feel like he’s remorseful for how he treated me.”\n\nBlac Chyna and Tyga Have a Son, Get Engaged\n\nMeanwhile, an up-and-coming rapper named Tyga welcomed a baby boy named King Cairo Stevenson with his then-girlfriend, model Blac Chyna, in October 2012. “Most amazing feeling ever. #Blessed #2Kings,” Tyga captioned a Twitter photo cradling his little boy. That December, the couple confirmed they were engaged in an Instagram post featuring Chyna’s giant diamond ring.\n\nKanye West Starts Dating Kim Kardashian\n\nFresh off his split from Rose, West set his sights on his longtime friend and crush Kim Kardashian in early 2012. The pair were spotted out together and Kardashian’s famous family even started pressing the reality star for details on her new romance (remember when he let her borrow his car?!).\n\nKanye West Raps About Wiz Khalifa, Amber Rose\n\nAs West’s romance with Kardashian blossomed, so did that of his ex Rose and her new rapper fiancé, Wiz Khalifa. In April 2012, West released the song “Cold” in which he rapped, “Only n—a I got respect for is Wiz / And I’ll admit, I had fell in love with Kim around the same time she had fell in love with him.”\n\nAmber Rose Marries Wiz Khalifa After Welcoming Son Sebastian\n\nIn February 2013, Rose and Khalifa had their first child, son Sebastian, announcing the news on Twitter. In July 2013, the couple secretly wed; the next month, they had a big ceremony in which Rose wore a stunning Pnina Tornai for Kleinfeld gown. She didn’t share photos from the private event until their one-year anniversary.\n\nNorth West Is Born\n\nFollowing a difficult pregnancy, Kim gave birth to her daughter, North West, in June 2013. West penned the song “Only One” for his little girl. Click here to see the most adorable pics of Nori.\n\n🙏 A post shared by Kim Kardashian West (@kimkardashian) on Jan 4, 2014 at 6:20pm PST\n\nBlac Chyna Befriends Kim Kardashian\n\nChyna started making regular appearances in Kardashian’s Instagram photos in early 2014. As new mom Kim worked hard to get back to her pre-baby weight in time for her wedding to West, she posted selfies in workout clothes with Chyna by her side.\n\nKanye West Marries Kim Kardashian\n\nAfter gracing the cover of Vogue in wedding couture, the A-list couple tied the knot in an elaborate European wedding weekend that began in Paris and ended with an Italian ceremony in May 2014.\n\nRob Kardashian Skips the Wedding, Remains Under the Radar\n\nThings got awkward when Kim’s younger brother, Rob Kardashian, left Kim’s wedding festivities early. His exit followed months of erratic behavior: avoiding appearances on the family’s reality series, Keeping Up With the Kardashians, significant weight gain and depression. He’s stayed out of the public eye ever since. “He sent me a long email the morning of [saying] that he was going to leave,” Kim later said on Watch What Happens Live. “There was no fight.”\n\nBlac Chyna and Tyga Split\n\nIn August 2014, the parents called it quits. “They are trying to keep it amicable,” an insider told Us Weekly at the time. “They also have a lot of friends in common — Tyga is Kanye [West’s] boy and Blac Chyna got close to [his wife] Kim [Kardashian] — so they don’t want to make it weird.”\n\nAmber Rose Splits From Wiz Khalifa\n\nDespite previously saying she wanted to be with Khalifa “for the rest of my life,” Rose filed for divorce in September 2014, just 14 months after they tied the knot. “I never knew what a true heartache felt like until now,” Rose tweeted several weeks later.\n\nTyga Starts Dating Kylie Jenner\n\nIn the fall of 2014, Tyga and the youngest of the Kardashian-Jenner clan sparked a series of dating rumors after they were seen hanging out together regularly. In August 2014, Tyga hosted Kylie Jenner’s 17th birthday party, and they continued to be spotted out together as the months went on. However, due to Jenner’s underage status, the couple never publicly acknowledged their romance.\n\nAmber Rose Slams Kylie Jenner and Tyga\n\nFresh off her split from Khalifa, Rose befriended Chyna, who was now estranged from Kim after the Tyga/Kylie dating rumors. In February 2015, Rose appeared on The Breakfast Club radio show, where she gave her unfiltered thoughts on Jenner’s relationship with Tyga. “She’s a baby, she needs to go to bed at 7 o’clock and relax,” Rose said of Jenner. “That’s ridiculous. [Tyga] should be ashamed of himself. For sure. He has a beautiful woman and a baby and left that for a 16-year-old who just turned 17.”\n\nKhloé Kardashian Sparks Twitter Feud With Amber Rose\n\nNot willing to let her little sister get thrown under the bus, Khloé Kardashian weighed in on the feud on Twitter. “’I was a stripper since I was 15 years old,’ Amber Rose told Foxx. Please don’t worry about my sister who has a career & her s–t together at ONLY 17 people who live in glass houses shouldn’t throw stones,” Khloé tweeted, making note of Rose’s past as a stripper. “Please stop talking about us in interviews mama. None of us talk about you.” Her comments prompted an intense back-and-forth between the two.\n\nKanye West Gets Involved in Twitter Feud\n\nRose responded to Khloé’s tweets with a series of West-inspired memes. One read, “When ur sister in law calls out ur ex for being a stripper but ur wife has a sex tape,” referencing Kim’s sex tape with singer Ray J. West shot back a few days later, making his own appearance on The Breakfast Club. “She’s just soakin’ in the moment. If Kim had dated me when I first wanted to be with her, there wouldn’t be an Amber Rose,” West said of his ex. “It’s very hard for a woman to want to be with someone that’s with Amber Rose. … I had to take 30 showers before I got with Kim.”\n\n💋 A post shared by Blac Chyna (@blacchyna) on Apr 21, 2015 at 4:34pm PDT\n\nBlac Chyna Mocks Kylie Jenner Online\n\nAs Jenner’s romance with Tyga continued, his ex posted several telling photos via Instagram in April 2015, making light of the new relationship. While the #KylieJennerChallege started trending, Chyna shared a photo of herself wearing giant fake lips. Then she posted screengrabs, which she alleged were from Tyga. One such text read: “I want to be with u.”\n\nKylie Jenner Goes Public With Tyga on 18th Birthday\n\nIn August 2015, Jenner finally turned 18 and, now legal, went public with Tyga. The social media starlet had a blowout birthday bash, and her new official beau gifted her with two cars, including a $260,000 Ferrari.\n\nTyga Feuds With Blac Chyna Over Kylie Jenner’s Ferrari\n\nThe pricey purchase sparked a fresh feud between Tyga, Chyna and Rose. TMZ reported that Tyga had leased the swanky gift, which Tyga claimed was a lie. “When the hating don’t work they start telling lies. #WhereYoFerarriTho?” he captioned an Instagram selfie. Naturally, Rose chimed in, defending her friend with a photo of her own pink Ferrari. “She don’t need a Ferrari she can Drive mine,” she captioned the shot.\n\nKylie Jenner and Tyga Split, Get Back Together\n\nOn Tyga’s 26th birthday in November 2015, the couple split and Jenner deleted almost all mentions of her flame from her Instagram account. But days later they made up, and Jenner described the rekindling romance as “Chaos” in a new post.\n\n#nofilter A post shared by Annalu (@annalucardosod) on Dec 11, 2015 at 3:39pm PST\n\nTyga Has a Fling With a Brazilian Model\n\nUs exclusively broke the story in January 2016 that Tyga had been cheating on Jenner with Brazilian model Annalu Cardoso for months. The pair started texting in late 2014 and had “hooked up a couple of times,” an insider told Us. Around the same time, 14-year-old model Molly O’Malia also accused the “Stimulated” rapper of sending her “uncomfortable” messages.\n\nhttps://www.instagram.com/p/BA9v0LFxvip/\n\nBlac Chyna Posts Photo With Rob Kardashian\n\nRumors abounded on January 25, 2016, when Chyna posted a black-and-white Instagram of herself in the loving embrace of Rob Kardashian with the caption “The beginning.”\n\nKhloé Kardashian Seemingly Reacts to Rob’s News\n\nShortly after the photo was posted, Khloé tweeted a telling quote from The Godfather: “You can do anything. But never go against the family.” After followers noted her quote was likely about Rob and Chyna, the reality star replied, “You guys do know I have about 100 family members correct? I was referring to a family member who just bailed out of doing my talk show today. But hey, maybe my quote can go towards a few people today.”\n\nRob Kardashian Confirms the Relationship\n\nA day after Chyna’s Instagram post, Rob reposted a meme of his new love holding a car seat. “Blac Chyna probably out shopping rite now as she plan to give birth to the only next generation of the Kardashian Name! #BabyKardashian.” He captioned the meme with the clover emoji, which became a secret symbol between the pair. Twitter users pointed out that Rob’s birthday is on March 17, a.k.a. St. Patrick’s Day.\n\n“The family is in a bind trying to be supportive of Rob’s life while being sensitive of Kylie’s relationship with Tyga,” a source explained to Us at the start of the romance.\n\nKanye West Goes Off on Wiz Khalifa on Twitter\n\nThe same week — but on an unrelated note — West took aim at former pal Khalifa and ex Rose in a headline-making Twitter rant. It started when Khalifa dissed the title of West’s upcoming album, Waves. “Please don’t take the wave,” he tweeted. “Max B is the wavy one. He created the wave. There is no wave without him.”\n\nHe then went on to write, “Hit this kk and become yourself.” Misunderstanding Khalifa’s reference to Khalifa Kush weed, West then started ranting against the rapper on Twitter. “Like, oh that’s Ye and I can put his wife’s initials on my twitter @WizKhalifa,” West wrote. “You have distracted from my creative process. I went to look at your twitter and you were wearing cool pants.”\n\nAs the tweets raged on, West slammed his ex Rose, writing, “4th you let a stripper trap you. 5th I know you mad every time you look at your child that this girl got you for 18 years.”\n\nAmber Rose Weighs In on Kanye/Wiz Twitter Beef\n\nNot willing to let her ex’s insults slide, Rose responded with the tweet, “Awww @kanyewest are u mad I’m not around to play in ur a–hole anymore? #FingersInTheBootyAssBitch.” West later deleted his tweets, apologizing for the misunderstanding about Kim’s initials, to which Rose replied, “Lol @kanyewest Now u wanna delete ur tweets cuz Muva has arrived? #TwitterFingers #UrGettingBodiedByAStripperN—a.”", "images": ["https://www.usmagazine.com/wp-content/uploads/kylie-tyga-inline-a53fbbfc-5241-4b0e-8a1a-37bcfb261654.jpg", "https://www.usmagazine.com/wp-content/uploads/tyga-kylie-birthday-inline-fc8baa32-5c85-45c7-9f3f-94c898c1fa1f.jpg", "https://www.usmagazine.com/wp-content/uploads/tyga-blac-inline-d93f416b-a8fa-45af-9079-2e5187b59453.jpg", "https://www.usmagazine.com/wp-content/uploads/wiz-amber-inline-74c183a9-6522-4e06-897b-643a1407977d.jpg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/bg-subscribe.png", "https://www.usmagazine.com/wp-content/uploads/2020/04/Screen-Shot-2020-04-09-at-11.48.30-AM.png?w=100&h=100&crop=1", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered-green.svg", "https://www.usmagazine.com/wp-content/uploads/kanye-wiz-split-zoom-9e879ac8-7f7a-490e-8098-bf0e519044ee.jpg", "https://i2.wp.com/www.usmagazine.com/wp-content/uploads/kim-kanye-amber-wiz-split-zoom-18487661-19e0-4f94-9826-405b8c8b4218.jpg?crop=0px%2C0px%2C1200px%2C630px&resize=1200%2C630&ssl=1", "https://www.usmagazine.com/wp-content/uploads/kanye-amber-inline-82ea63a7-8fa9-4143-b23d-a2658cc1c6fb.jpg", "https://www.usmagazine.com/wp-content/uploads/kourtney-amber-split-zoom-b27a2617-2d3f-4ca4-b197-55d29154ee16.jpg", "https://www.usmagazine.com/wp-content/uploads/2020/04/woman-eating-bar1-1.jpg?w=100&h=100&crop=1", "https://www.usmagazine.com/wp-content/uploads/kim-kanye-wedding-zoom-726106d8-89e7-4e92-8f2d-aec6ae4b10ea.jpg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/icon-download.svg", "https://www.usmagazine.com/wp-content/uploads/2020/04/shutterstock_1701843913-1.jpg?w=100&h=100&crop=1"], "top_img": "https://i2.wp.com/www.usmagazine.com/wp-content/uploads/kim-kanye-amber-wiz-split-zoom-18487661-19e0-4f94-9826-405b8c8b4218.jpg?crop=0px%2C0px%2C1200px%2C630px&resize=1200%2C630&ssl=1", "keywords": [], "authors": ["Rachel Mcrady"], "canonical_link": "https://www.usmagazine.com/celebrity-news/news/a-history-of-kanye-west-kardashians-feuds-with-amber-rose-blac-chyna-w162785/", "title": "A History of Kanye West's, Kardashians’ Feuds With Amber Rose, Blac Chyna", "meta_data": {"viewport": "width=device-width, initial-scale=1", "ir-site-verification-token": "-206090124", "fo-verify": "49e6fc6a-c68d-447f-9978-70e3eac455ac", "msvalidate.01": "097DBAAF43A9B61E9E4259AA7D75B069", "description": "Following Rob Kardashian and Blac Chyna’s dating news and Kanye West’s Twitter fight with Wiz Khalifa and Amber Rose, stay informed with this detailed timeline of their beef!", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Get the Comprehensive History of Kanye West's and the Kardashians’ Feuds", "description": "Following Rob Kardashian and Blac Chyna’s dating news and Kanye West’s Twitter fight with Wiz Khalifa and Amber Rose, stay informed with this detailed timeline of their beef!", "url": "https://www.usmagazine.com/celebrity-news/news/a-history-of-kanye-west-kardashians-feuds-with-amber-rose-blac-chyna-w162785/", "site_name": "Us Weekly", "updated_time": "2017-10-23T18:49:37+00:00", "image": {"identifier": "https://i2.wp.com/www.usmagazine.com/wp-content/uploads/kim-kanye-amber-wiz-split-zoom-18487661-19e0-4f94-9826-405b8c8b4218.jpg?crop=0px%2C0px%2C1200px%2C630px&resize=1200%2C630&ssl=1", "secure_url": "https://i2.wp.com/www.usmagazine.com/wp-content/uploads/kim-kanye-amber-wiz-split-zoom-18487661-19e0-4f94-9826-405b8c8b4218.jpg?crop=0px%2C0px%2C1200px%2C630px&resize=1200%2C630&ssl=1", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/UsWeekly", "tag": "Video", "section": "Celebrity News", "published_time": "2017-10-20T16:52:00+00:00", "modified_time": "2017-10-23T18:49:37+00:00"}, "fb": {"app_id": 1785612128341436}, "twitter": {"card": "summary_large_image", "description": "Following Rob Kardashian and Blac Chyna’s dating news and Kanye West’s Twitter fight with Wiz Khalifa and Amber Rose, stay informed with this detailed timeline of their beef!", "title": "Get the Comprehensive History of Kanye West's and the Kardashians’ Feuds", "site": "@usweekly", "image": "https://i2.wp.com/www.usmagazine.com/wp-content/uploads/kim-kanye-amber-wiz-split-zoom-18487661-19e0-4f94-9826-405b8c8b4218.jpg?crop=0px%2C0px%2C1200px%2C630px&resize=1200%2C630&ssl=1", "creator": "@usweekly"}, "generator": "WordPress 5.4"}, "movies": [], "publish_date": 1508518320.0, "source": "http://www.usmagazine.com", "summary": ""}