{"url": "https://www.vulture.com/2017/12/the-disaster-artist-an-oral-history.html", "text": "When the people behind The Disaster Artist spoke to Vulture about how they re-created the most iconic scenes from The Room, they didn’t just talk about those four scenes. Much like The Room itself, these conversations spiraled in many directions — enough, it turns out, to create an entire oral history of the project. (Unlike The Room, no one mentioned breast cancer.) Below, director/star James Franco, and actors Dave Franco, Ari Graynor, and Josh Hutcherson discuss how they brought the story behind the 21st century’s biggest cult film to life, while the real Tommy Wiseau and Greg Sestero also pop in to give their thoughts. If you don’t like it, leave your stupid comments in your pocket.\n\nInspiration\n\nIn which James Franco decides to become Tommy Wiseau.\n\nJames Franco (Tommy Wiseau/Johnny): I had not seen The Room before deciding to make The Disaster Artist, which is crazy. I lived in L.A. when The Room came out and I saw the very strange, slightly scary billboard with Tommy’s phone number on it, but I had no idea what it was. I drove by it all the time and I must’ve thought it was like … in L.A. we have this woman named Angelyne, this blonde woman that drives around in a pink Corvette. She had some billboards that said, “Angelyne” and there was a phone number. I think I might’ve thought it was like that. Like, If you want Angelyne, the woman who drives the Barbie car in your movie, call that number, and if you want this scary-looking guy with long black hair and a lazy eyelid in your movie, call this number.\n\nThe infamous Room billboard.\n\nJonah Hill and Paul Rudd and Michael Cera and all those people were going to screenings. It was a thing. I never got invited or, I don’t know, it just never penetrated into my consciousness. But then The Disaster Artist came out on The New York Times Book Review and I read the book, and before I was halfway done, I just knew that this was the story for me.\n\nI didn’t write the script and the movie didn’t come fully baked in my brain, but there were a few things I knew right away. I knew that I wanted to direct it. I had to play Tommy Wiseau. My brother would be perfect for Greg. We had the right dynamic for those characters. My brother’s seven years younger than I am. The way I perceived him growing up was this easy-go-lucky kinda guy, had a lot of friends. I was the firstborn and I always felt like I was the brooding one. And then, even more than that, I had done a lot of what my brother considers strange things, made weird choices artistically.\n\nMy brother and I hadn’t done that much together as actors, but we had done this series of short videos for Funny or Die where I played this wacky acting teacher who gave him ridiculous, inane advice. That was on my mind when I was reading the book. That’s sort of the seed of the dynamic between Tommy and Greg.\n\nDave Franco (Greg Sestero/Mark): In both cases I am looking at him like he’s a crazy person. It worked out pretty well.\n\nJF: I also knew that it had to be the story of an artist. Not a project that spoofed Tommy. We had to treat him like we would any other artist. Whether he intended The Room to be a comedy or not, it doesn’t really matter. The thing is made. It’s there. It’s this undeniably magical, fascinating, multi-layered thing that people have been watching for 14 years. It’s got something. I came around to really regard him as some sort of strange outsider artist.\n\nTommy Wiseau: One thing I noticed from the beginning, what James did — his craft, his approach — is not a parody. He approaches it in a respectful way.\n\nJF: With Tommy, I really think underneath everything, he wanted two things, and they overlap: He wanted to express himself as an artist, and he wanted a family. He wanted friends. He wanted acceptance. That drive to make a movie, be an artist and have a family, in a strange way, is sort of parallel to James Dean. When James Dean was young, his mom died and his father sent him away to live with his aunt and uncle. Hollywood movies were the things he thought would bring him the love that would fill that hole.\n\nMaking The Room was an incredibly meaningful endeavor for Tommy. It was gonna save his life. I think Tommy was really depressed before he wrote The Room, and you can see him channeling all of that rejection and betrayal into The Room. This all-American guy Johnny, the guy that Tommy’s trying to be all his life, is betrayed by his best friend and his girlfriend, then he commits suicide. Tommy was expressing all the rejection that he felt his whole life and then instead of committing suicide in real life, he channeled it into his movie! That’s the definition of an artist!\n\nPreparation\n\nFranco begins to assemble the cast. His brother Dave comes onboard to play Sestero, while Josh Hutcherson and Ari Graynor sign on to play The Room’s other stars.\n\nJames Franco in The Disaster Artist. Photo: Justina Mintz/A24\n\nJosh Hutcherson (Philip Haldiman/Denny): My biggest trepidation before doing the movie was, I had zero desire to make fun of anybody. I’m not into bullying, I don’t think it’s cool. These people, this whole crew and cast, they set out to make a movie. It’s a very hard endeavor, and they did it.\n\nDF: I wanted to talk to Greg as much as possible. I was very curious about whether, during the production of The Room, Greg ever believed that The Room could be a good movie. He claims that he did not ever think that The Room had a chance at being of quality. But I don’t fully believe him. When you’re a young actor, getting onto a movie set is the most exciting thing in the world. Whatever you’re working on, you almost have to believe that it could be good. I have been on movie sets where everyone involved is hyping the movie to the point that they were talking about potential awards. And then the movie would come out, and not only was it not good, it was a piece of shit.\n\nJF: There were two people I considered for the Juliette Danielle role. The other person I considered for a second was Britney Spears, because Juliette the actress sorta has a Britney Spears thing going on. Britney’s a great performer, but I knew that Ari Graynor was such a solid actress.\n\nAri Graynor (Juliette Danielle/Lisa): I got a text from James Franco that said, “Hey, this is James Franco.” I had a new phone and I thought it was a joke. He said, “Watch The Room, I want you to play Lisa.” I watched The Room alone in my apartment, which is 1,000 percent not the way you want to watch The Room for the first time. But my jaw was on the floor. I instantly felt like it would be the greatest honor of my career to play Lisa.\n\nFranco, too, had to figure out how to embody Tommy Wiseau.\n\nJF: For Tommy’s voice, basically I did exactly what I did with James Dean. I would drive around in my car and listen to interviews or the audio of his movies. I had something even better with Tommy because Tommy used to record every single phone conversation he ever had. Like in The Room, that’s based on what Tommy actually did! And not only would he record phone conversations, he would drive around in his car talking to himself and record it. Greg had taken some of these tapes and digitized them, and he gave me those recordings. Tommy knows now; it’s not completely unethical. I have Tommy 20 years ago, before The Room, driving around Los Angeles talking about his acting classes. Even then he had the seeds of making his own movie. [In Tommy voice] “Nobody understand me. The teacher don’t understand me. I think he intimidated by my power.” I remember one of his recordings being like, “Maybe I just do my own movie or maybe I do rock and roll album. I don’t know, one or the other.” It was such an amazing glimpse into his private thoughts.\n\nProduction\n\nThe cast and crew begin the task of painstakingly re-creating all of The Room’s idiosyncrasies.\n\nSeth Rogen and James Franco in “Bound 3.” Photo: Seth Rogan and James Franco\n\nJF: I had a sense that re-creating scenes from The Room would be a part of our movie, obviously. Around the time I was reading the book, Seth Rogen and I had done a shot-for-shot re-creation of Kanye’s “Bound 2” video with Kim Kardashian on the set of The Interview. And we learned, when you’re doing that, you look at each shot and the DP lights it as it was, and the costume designer will make sure that looks right, and then the actors just watch, and get all the movements down, and practice it almost like a dance or a song. That was our dry run.\n\nTommy gave Chris Spellman, the production designer, the blueprints for the set. He built them exactly to the blueprint. He matched all the bad sets and the props and the picture frames in the back. Our DP Brandon Trost spent as much time re-creating the bad lighting in The Room as he did doing his good lighting for the rest of the movie. There’s a lot of weird shit, like shadows all over the fuckin’ place. I remember Brandon obsessing over some horrible shadow from a lamp in the middle of the frame, or a shadow going across the actor’s face. He was baffled. Like, How would you even get it that bad?\n\nGreg Sestero: I went one of the times they re-created The Room set. I got to go back and sit inside the room. It was an out-of-body experience. I couldn’t speak for about ten minutes.\n\nJF: Brenda Abbandandolo, the costume designer, went out and tried to match all the things exactly, the right flowered dress and all that stuff. She did an incredible job, not only in the Room costumes, but also creating this insane wardrobe for me to wear as Tommy in the scenes outside The Room. It would take me 20 or 30 minutes just to get dressed because of all the belts. It was like four belts or five belts a day and they were all connected by different straps. It was a whole ordeal to just go to the bathroom.\n\nEarly in the process, Tommy was still sort of skeptical of the whole thing. He offered to loan us like, a door, a lamp, or a chair from the original set, but it would cost like three grand for each item. There was something about that idea that sounded great — like, you know, some sort of spiritual connection to the original set. But it was highway robbery. And we had the blueprints, so …\n\nGreg Sestero’s beard, a plot point in both The Room and The Disaster Artist, was an area of particular focus.\n\nDF: I have difficulty growing a full beard, which is unfortunate. I spent two and a half months growing out my beard in an effort to make it as real as possible. Unfortunately, I can only grow a strong goatee. We shot the film completely out of order, so at a certain point they had to shave the goatee, and we had to go full, full fake beard. I would not put a fake beard on my worst enemies. You’re literally putting glue on your face. It was extremely uncomfortable and I hope I never have to do it ever again.\n\nGS: I have no idea why I grew the beard. It’s the only time I’ve ever done it. I’m sorry that I had to make Dave go through that.\n\nJames Franco on the set of The Disaster Artist. Photo: Justina Mintz/A24\n\nBesides nailing the look of the movie, the actors labored intensely to mirror the performances.\n\nJF: We were doing the words like we were singing a song. We had this song of the dialogue as the original people had said it and we would try to sing it like they sang it. Then we had the dance of their movements, so we’d choreograph our movements like they did it. How do we get this song and dance down as closely to the original as we can? It was really a matter of watching. You’re looking for every little twitch of the mouth, if the hand was cocked at a certain angle. We’d have these iPads with the scenes and watch them over and over again together.\n\nDF: We really tried to match it beat for beat, even down to the details of what angles their heads were turning. Every physical movement, every angle, every breath, every pause. We did our best.\n\nGS: It’s unfair how good of a job they did. It’s so dead-on, it’s scary.\n\nSome scenes took more effort than others.\n\nJF: One of the reasons that I was drawn to Tommy is that his heroes were my heroes! We had different exteriors, we had different life paths, but underneath there’s some weird similarities. I played James Dean and I just love the connection that happened when I knew I was gonna do the “You’re tearing me apart, Lisa!” scene. Tommy was inspired by James Dean, I had played James Dean, and now I’m playing Tommy. It was like this weird triangulation of influences, each one of us trying to play the other, level upon level.\n\nAG: The first thing I shot for The Disaster Artist was the “three’s a crowd” scene with Denny and Lisa. And so there I am in that red dress with James and Josh, and Josh is in that ridiculous mushroom wig and the three of us are in this bed on the set of The Room that is exactly like the real set, having the world’s most uncomfortable pillow fight. There is no way to describe how quiet that room feels when you’re doing it, how totally bizarre it is. There’s so many pauses. You only realize how many weird pauses there are in that movie when you start doing it.\n\nJH: I remember I wanted to nail the apple bite correctly. When Denny is downstairs, he turns and then takes a bite while looking up. The specificity of that moment, I really wanted to get that right. There’s a certain pacing: He walks over, steps on the mark awkwardly, looks up awkwardly, takes a bite, a few chews, and then without really having a decision of moving, he walks out of frame. It’s very strange when they say “cut” and you know you did a bad job acting.\n\nDF: It’s funny bouncing back and forth between Greg and Mark. When I’m playing Greg, I’m hoping it comes across very natural and real. When I’m playing Mark, I’m supposed to be acting poorly. But I didn’t want to overdo it, because Greg was an actor who I’m sure was really giving it his best.\n\nJames Franco and Ari Graynor in The Disaster Artist. Photo: Justina Mintz/Courtesy of A24\n\nIn The Disaster Artist, production on the movie’s infamous sex scene occurs during a tense moment in production, just as in real life.\n\nJF: We realized it would be even more powerful if we showed how Tommy and Greg’s personal lives had an influence on the making of the movie. So in our film right before he goes into the scene where he’s directing the love scene and walking around set in nothing but a cock sock — which I was told he did — Tommy and Greg have a rift in their relationship. Suddenly it becomes about more than Tommy trying to direct the best sex scene possible. It becomes about his anger. It’s potentially really tricky material, you know? On any movie that I’ve been on, that behavior just would not fly. That was the hardest scene to score. You couldn’t go comedic ’cause it would just make it silly, and we couldn’t go creepy beyond redemption. But I think it works in the context of the movie. There’s so many levels happening at once: It’s funny, it’s disturbing, it’s a guy having a breakdown, it’s the first break with the crew — and it’s all because he’s losing his best friend, Greg!\n\nAG: It’s easy to stay present when James Franco is running around with a Tommy voice and that hair and only a cock sock. You are pretty in the moment.\n\nJF: I had learned a lot on The Deuce about how to portray the shooting of gratuitous sex scenes. The scene could be a critique of a guy being completely inappropriate while directing a sex scene, but that we ourselves would not be inappropriate in any way while making it. Tommy might have thought he needed his butt to sell his movie but we don’t need breasts to sell our movie.\n\nAG: What’s hilarious about remaking any of the scenes of The Room is that every beat of it goes against your instincts. It’s like a kind of jazz you’ve never heard before. When you try to do them, it’s so deliciously uncomfortable because you’re doing things in ways that feel totally unnatural. In the sex scene, it was really trying to be as meticulous about the details as possible: “Move the hand slightly more like this and the finger looks more like this on the back.” It was like a bizarre kind of surgery — really silly surgery.\n\nJF: The cast that was playing the actors in The Room and re-creating the scenes with me, they were so into it. There is nothing like re-creating bad acting but doing it with the same amount of dedication and meticulousness that you would use for good acting. It’s almost like an excuse to play. And Ari just got it. Having her and Jackie Weaver and Josh Hutcherson as bad actors gives those renditions an extra bit of electricity. They’re doing it almost exactly, but there’s a little more pathos or something underneath. It’s like getting Brando to go do a kid’s birthday party. You’ve got too much talent being funneled into something that is just like a smaller container than the talent. The talent is overflowing out of the container.\n\nRe-creating the movie’s football-in-tuxedos scene was a particular pleasure.\n\nTW: [Why are they wearing tuxedos?] Good question, but at the same time it’s a lousy question. Sorry, I won’t indulge you.\n\nJF: It feels like this weird, kind of innocent thing. Tommy wants to be this kind of all-American guy that plays all-American sports with his buddies, but that’s not his history really. That’s not really his roots. It’s sort of this creation.\n\nJH: That was something I was excited to do because it’s such an iconic scene. The throwing of the football was so awkward and weird and they were really close to each other, physically.\n\nDF: None of us could keep a straight face.\n\nJH: Fortunately, they weren’t, like, throwing 20-yard bombs, or doing anything that was actually like good football-throwing.\n\nDF: Greg actually has pretty good form when it comes to throwing a football so it wasn’t too hard for me to match. As opposed to my brother, who was trying to match Tommy’s extremely awkward football-throwing form.\n\nTW: Johnny or Tommy does not throw the football the way he threw the football. It should be much more manhood, you know what I’m saying?\n\nGS: I’ll give Tommy credit: He can actually throw a decent spiral now. When I first met him, it was a little bit rough. I think he forgets.\n\nThe filmmakers were so impressed by the job they’d done that they added a montage over the credits, where scenes from The Room play alongside their re-creations. The effect is uncanny.\n\nJF: It was sort of a tricky thing to figure out which Room scenes to include. Originally we were strictly going to use them for the premiere scene at the end of our movie. But because we were so happy with our work, we were like, We should flaunt how well we did this and put it in the credits! And that’s a whole story. In the original contract, Tommy’s main stipulation was that, in addition to being paid for his life rights, he would have a scene in the movie. He kept insisting that he have a scene opposite me.\n\nIn the initial cut we watched Tommy’s scene and we were like, There’s no way that scene’s gonna go in the movie. But then, when we realized we wanted to do the side-by-side because we were so happy with our re-creations, we had to renegotiate with Tommy because we hadn’t negotiated for footage from The Room. During that renegotiation he had asked somebody, “How my scene in the movie?” and they told him it’s not in there. So to get The Room footage for the side-by-sides, we had to put the scene back in. At first, we were like, Oh man. What are we gonna do? And then we realized, Oh, we can put Tommy’s scene at the end of the credits like a Marvel tag. It worked out perfectly.\n\nReception\n\nWiseau premiered his film at a two-week, Oscar-qualifying run at two theaters in Los Angeles. Franco’s premiered at South by Southwest, an experience that was no less nerve-racking.\n\nDave Franco and James Franco in The Disaster Artist. Photo: Justina Mintz/A24\n\nJF: We offered to show Tommy the movie. He didn’t wanna watch it until we premiered it in front of an audience as South by Southwest. We were nervous. Fortunately it was the best screening of my life. We kept looking out over at Tommy down the row to gauge his reactions. He wasn’t really laughing. He was kinda whispering to Greg every once in a while; I learned later he was saying to Greg, “Did that happen? That really happened?”\n\nTW: I remember The Room like I did yesterday. If you talk to Greg, he will tell you the same thing.\n\nJF: Afterwards I asked him, “What do you think, Tommy? And he was like, “I approve. 99.9 percent.” And I was like, “What’s the .1 percent?” He goes, “I think you should look at the lighting in the beginning of your film, a little bit off.” I told that story to a couple outlets and he must have read it, because by the time TIFF came around he’s like, “You know that story you tell, I never say the lighting.” I’m like, “Tommy, come on! I didn’t make that up.” And he’s like, “I disagree. I never say that.” And I’m like, “Okay, what’s the .1 percent? And he said, “The way you throw a football, that not how I throw football.” And I’m like, “Because you’re an all-American boy, you were raised throwing a football and you know how to throw it.” And he’s like, “Yeah, exactly.” So … I don’t know.\n\nTW: Overall he did a good job. I’m not here to criticize him. I don’t want to praise him.", "images": ["https://pyxis.nymag.com/v1/imgs/d7d/7f7/37ef5ad3e9a03923b749a4f58688034126-29-bound-3.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg", "https://pyxis.nymag.com/v1/imgs/fd0/be8/bd5b864721d33c38bede0727864b919502-21-disaster-artist-oral-history-feature.w1600.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2017/11/21/21-disaster-artist-oral-history-feature.w1200.h630.jpg", "https://pyxis.nymag.com/v1/imgs/cc2/c22/b901b0694266043071ee9c1c20063189f2-27-disaster-artist-lede.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/0eb/fcb/83d052dcb3293cd3ca75d0d2b593f3086a-29-the-room-billboard.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/f94/272/3c95c87c29ebd642c08092ed027b6335e0-29-the-disaster-artist-bts.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/f5a/601/f53aeca21ad3bd2569fe952eab1162f50c-27-francos-the-disaster-artist.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/4f7/39f/741f59fc43badf600eda378e5619213989-29-the-disaster-artist-bts-2.rhorizontal.w710.jpg"], "top_img": "https://pixel.nymag.com/imgs/daily/vulture/2017/11/21/21-disaster-artist-oral-history-feature.w1200.h630.jpg", "keywords": [], "authors": ["Nate Jones"], "canonical_link": "https://www.vulture.com/2017/12/the-disaster-artist-an-oral-history.html", "title": "‘The Disaster Artist:’ An Oral History", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "The Disaster Artist: An Oral History", "url": "https://www.vulture.com/2017/12/the-disaster-artist-an-oral-history.html", "description": "How James Franco and friends brought the story behind the 21st century’s biggest cult film to life.", "image": "https://pixel.nymag.com/imgs/daily/vulture/2017/11/21/21-disaster-artist-oral-history-feature.w1200.h630.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "The Disaster Artist: An Oral History", "description": "How James Franco and friends brought the story behind the 21st century’s biggest cult film to life.", "image": "https://pixel.nymag.com/imgs/daily/vulture/2017/11/21/21-disaster-artist-oral-history-feature.w600.h315.2x.jpg", "card": "summary_large_image", "site": "@vulture"}, "article": {"published_time": "2017-12-01T09:00:02.726-05:00", "tag": "oral history, oral histories, the room, the disaster artist, movies, james franco, tommy wiseau, dave franco, josh hutcherson, ari graynor, greg sestero, vulture homepage lede", "publisher": "https://www.facebook.com/Vulture"}, "description": "How James Franco and friends turned the story behind “The Room,” the 21st-century’s biggest cult film, to life.", "sailthru.tags": "oral history, oral histories, the room, the disaster artist, movies, james franco, tommy wiseau, dave franco, josh hutcherson, ari graynor, greg sestero, vulture homepage lede", "author": "Nate Jones", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://cache.nymag.com/media/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1512136802.726, "source": "https://www.vulture.com", "summary": ""}