{"url": "www.newidea.com.au/angelina-jolie-hell-as-custody-battle-against-brad-pitt-backfires", "text": "With the fear of losing custody of her kids, friends are worried for Ange’s health after recent photos showed her looking gaunt.\n\nWith the fear of losing custody of her kids, friends are worried for Ange’s health after recent photos showed her looking gaunt.\n\nHowever, after a spate of erratic behaviours, it appears the courts are now weighing in, in favour of Brad who may get joint custody after all.\n\nAngelina now wants a truce with Brad, sources claim, so she can maintain her relationship with the children.\n\n‘She says her anger is dissolving and she wants to reach a peaceful truce with Brad – if his side are keen,’ a source told Daily Mail.\n\nBut according to insiders, Brad’s furious Ange aired their dirty laundry in public, and all he’s ever wanted was to keep things amicable and put the kids first.\n\nEarlier this month, Ange launched a blistering attack, accusing Brad of being a ‘deadbeat dad’ and not fulfilling his financial duties.\n\n‘For Brad, it’s all-out war. Ange has muddied his name too much and he’s livid,’ an insider told New Idea.\n\nGetty\n\nLast week, Brad and Ange reached an interim agreement, meaning the couple have agreed temporary custody issues for one month as an evaluation continues in Los Angeles.\n\n‘The interim arrangement was agreed upon by both parties after it was recommended by their custody evaluator,’ a source explains.\n\nBut now experts claim that it may be too late, and Angelina’s behaviour may have put the children at risk and created tension within the family unit.\n\n‘The children will definitely be affected. They will feel anxious and insecure from the ongoing conflict and lack of a clear outcome,’ clinical psychologist and parenting specialist Renee Mill tells New Idea.\n\n‘They will feel unsafe because of the hostility and aggression around them, which doesn’t bode well for their ongoing mental health. Under these circumstances, they will begin to lose trust in their father.’\n\nFurthermore, Renee says Angelina may be alienating the children and even suffering narcissistic and borderline personality traits. ‘This is called parental alienation syndrome. Interestingly, the parent who alienates is commonly found to have narcissistic and borderline personality features,’ says the expert.\n\n‘She appears selfish and intent on taking the kids wherever and whenever she wants. She is demanding, and doesn’t consider the amount of money Brad has allegedly given to be enough, even though she has enough. She seems set out to destroy him and in her fervour, she is destroying her children’s ability to form a healthy relationship with their father, which would give them balance.\n\n‘Borderline personality disorder people love to stir up arguments and have difficulty self-regulating, which also is tough on the kids,’ Renee adds.\n\nClinical and paediatric psychologist Ernest R. Katz, agrees, saying that Ange’s behaviour would have had a negative impact on the children.\n\n‘In general, kids feel very connected to, and remain in contact with, both parents even during a divorce. If one parent is speaking negatively about the other, the children will feel stressed and conflicted,’ Ernest told Hollywood Life.\n\n‘Kids will feel pressured and be put in a difficult position if they are being told not to spend time with one parent.\n\n‘These conflicted feelings can stay with children for a long time, and even through adulthood. It can impact their ability to live a happy, well-adjusted life,’ Ernest adds. ‘When one parent makes a child feel like they have to choose, it can lead to children having anxiety, depression, and traumatic stress reactions.’\n\nFor the full story see this weeks issue of New Idea, on sale now.", "images": ["http://www.newidea.com.au/Branding/newidea/images/brand-logo-gray.svg", "https://snowplow.swm.digital/i?e=se&se_ca=ping&tv=http-get-0.1.0&dtm=0&stm=0&tna=pac&p=web", "http://www.newidea.com.au/media/73139/ni4619_cover_nobc_bws.png?height=158", "http://www.newidea.com.au/Branding/newidea/Images/idm-error-icon.svg", "http://www.newidea.com.au/Branding/newidea/images/gmail.svg", "http://secure-gl.imrworldwide.com/cgi-bin/m?ci=au-pacmags&cg=0&cc=1&ts=noscript", "http://www.newidea.com.au/Branding/NewIdea/images/brand-logo-footer-new.svg", "http://www.newidea.com.au/media/32125/untitled-design.png", "http://www.newidea.com.au/Branding/newidea/images/idm-thanks-icon.svg", "http://www.newidea.com.au/Branding/NewIdea/images/enhanced-header-logo.svg"], "top_img": "http://www.newidea.com.au/media/32125/untitled-design.png", "keywords": [], "authors": ["Nikki Black", "Nikki Is Obsessed With All Things Celebrity", "Dreams She Is A Long-Lost Kardashian. You'Ll Find Her Binging Netflix'S Latest 'Must-Watch' Show With A Jar Of Nutella Her Side."], "canonical_link": "https://www.newidea.com.au/angelina-jolie-hell-as-custody-battle-against-brad-pitt-backfires", "title": "Angelina's hell as custody battle backfires", "meta_data": {"language": "en-us", "description": "Amid an increasingly bitter and public custody battle with ex-husband Brad Pitt, those closest to Angelina Jolie say the star is under immense pressure, and the trauma of the past two years is finally taking its toll on the fragile star.", "news_keywords": "angelina jolie, brad pitt, Shiloh Nouvel Jolie Pitt, Zahara Marley Jolie Pitt, Maddox Chivan Jolie Pitt, Pax Thien Jolie Pitt, Knox Leon Jolie Pitt, Vivienne Marcheline Jolie Pitt, brad pitt angelina jolie custody, brad and angelina custody, brangelina, custody, divorce, news, celeb news, celebrity news, latest celeb news, latest celebrity news, celeb goss, celebrity goss", "robots": "index, follow", "og": {"site_name": "New Idea", "type": "article", "url": "https://www.newidea.com.au/angelina-jolie-hell-as-custody-battle-against-brad-pitt-backfires", "title": "Angelina's hell as custody battle backfires", "description": "Amid an increasingly bitter and public custody battle with ex-husband Brad Pitt, those closest to Angelina Jolie say the star is under immense pressure, and the trauma of the past two years is finally taking its toll on the fragile star.", "image": {"identifier": "http://www.newidea.com.au/media/32125/untitled-design.png", "width": 1500, "height": 800}}, "twitter": {"title": "Angelina Jolie's hell as custody battle against Brad Pitt backfires", "description": "Amid an increasingly bitter and public custody battle with ex-husband Brad Pitt, those closest to Angelina Jolie say the star is under immense pressure, and the trauma of the past two years is finally taking its toll on the fragile star.", "image": "http://www.newidea.com.au/media/32125/untitled-design.png", "url": "https://www.newidea.com.au/angelina-jolie-hell-as-custody-battle-against-brad-pitt-backfires"}, "fb": {"admins": 863618607005758, "pages": 140279489324860}, "msvalidate.01": "3BD3CB44DC500E9821E82E085D0F0D13", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1535492111.353, "source": "http://www.newidea.com.au", "summary": ""}