{"url": "https://en.wikipedia.org/wiki/Chris_Pratt", "text": "For other people with the same name, see Christopher Pratt (disambiguation)\n\nAmerican actor\n\nChristopher Michael Pratt (born June 21, 1979)[1] is an American actor, known for a combination of primarily comedic roles on television, and action roles – often with comedic overtones – in big-budget feature films.\n\nHe rose to prominence for his television roles, particularly as Andy Dwyer in the NBC sitcom Parks and Recreation (2009–2015), for which he received critical acclaim and was nominated for the Critics' Choice Television Award for Best Supporting Actor in a Comedy Series in 2013. He also starred earlier in his career as Bright Abbott in The WB drama series Everwood (2002–2006) and had roles in Wanted (2008), Jennifer's Body (2009), Moneyball (2011), The Five-Year Engagement (2012), Zero Dark Thirty (2013), Delivery Man (2013), and Her (2013).\n\nPratt achieved leading man status in 2014, starring in two critically and commercially successful films: Warner Animation Group's The Lego Movie as Emmet Brickowski, and Marvel Studios' Guardians of the Galaxy as Star-Lord. In 2015, Time named Pratt one of the 100 most influential people in the world on the annual Time 100 list.[2] He starred in Jurassic World (2015) and Jurassic World: Fallen Kingdom (2018), and he reprised his Marvel role in Guardians of the Galaxy Vol. 2 (2017), Avengers: Infinity War (2018), Avengers: Endgame (2019), and the planned Guardians of the Galaxy Vol. 3. Meanwhile, in 2016 he was part of an ensemble cast in The Magnificent Seven and the male lead in Passengers. He is performing a lead role in the military sci-fi war film The Tomorrow War, in which he is making his debut as a film producer.\n\nEarly life\n\nChristopher Michael Pratt was born in Virginia, Minnesota[3] the youngest child of Kathleen Louise (née Indahl), who worked at a Safeway supermarket, and Daniel Clifton Pratt, who worked in mining and later remodeling houses.[4][5][6] Pratt's father died in 2014 from multiple sclerosis.[7] His mother is of Norwegian descent.[8] When Pratt was seven years old, the family moved to Lake Stevens, Washington.[9] Pratt placed fifth in a high school state wrestling tournament;[4][10] he later recalled that when his wrestling coach asked him what he wished to do with his life, he said \"'I don't know, but I know I'll be famous and I know I'll make a shit ton of money.' I had no idea how. I'd done nothing proactive.\"[4] He graduated from Lake Stevens High School in 1997.[11]\n\nPratt dropped out of community college halfway through the first semester and, after working as a discount ticket salesman and daytime stripper, he ended up homeless in Maui, Hawaii, sleeping in a van and a tent on the beach. He told The Independent, \"It's a pretty awesome place to be homeless. We just drank and smoked weed and worked minimal hours, just enough to cover gas, food, and fishing supplies.\"[4][12] He recalled listening to the Dr. Dre album 2001 daily, to the point where he knew every lyric; years later, he rapped Eminem's verses from the song \"Forgot About Dre\" extemporaneously during an interview.[13] During his time in Maui, he worked for Christian missionary organization Jews for Jesus.[14]\n\nCareer\n\n2000–2012: Career beginnings and breakthrough\n\nAt 19 years old, Pratt was waiting tables at the Bubba Gump Shrimp Company restaurant in Maui when he was discovered by actress and director Rae Dawn Chong. She cast him in her directorial debut, the short horror film Cursed Part 3, which was filmed in Los Angeles.[3][4][15] Pratt's first regular television role was as Harold Brighton \"Bright\" Abbott on the series Everwood.[4][16] After Everwood's cancellation, he joined the cast of The O.C. for its fourth season, playing activist Winchester \"Ché\" Cook.[4] He also had an appearance in the 2008 action film Wanted, where James McAvoy hits him with a keyboard.\n\nParks and Recreation in April 2009 Pratt at the premiere ofin April 2009\n\nIn 2009, Pratt began playing Andy Dwyer on the NBC comedy series Parks and Recreation. Originally meant to be a temporary character, producers liked Pratt so much they asked him to become a series regular.[4][17] This would become his breakout character.\n\nPratt portrayed Oakland Athletics first baseman/catcher Scott Hatteberg in the 2011 film Moneyball. He was initially told that he was too fat to play Hatteberg, as he had gained 40 pounds (18 kg), which Pratt attributed to the cooking of his then-girlfriend, actress Anna Faris. Deciding to lose weight, he worked out continuously, regularly checking to see if the part was cast, losing a total of 30 pounds (14 kg). When he felt he had lost enough, he sent a photo of himself to the casting director and won the part. Prior to the release of Moneyball, Pratt was typecast as youthful and somewhat immature characters. In Moneyball, he played a dramatic role as a father and dejected baseball player who once feared his career was over and who had the difficult task of learning a new defensive position.[4][18]\n\nHe gained back the weight he had lost to appear in the film 10 Years (2011), then lost it again to portray a Navy SEAL in the film Zero Dark Thirty (2012).[4] He played the co-worker of Joaquin Phoenix character in Spike Jonze's sci-fi romance Her in December 2013.[19]\n\n2013–present: Worldwide recognition and franchise work\n\nAlthough Pratt had been known until that point for playing supporting characters,[4] and was best known as his portly Parks and Recreation character, he headlined two feature films in 2014: Emmet Brickowski in The Lego Movie,[4][12] which grossed $469.1 million;[20] and Peter Quill / Star-Lord in Marvel Studios' Guardians of the Galaxy, which grossed $773.3 million.[21] Pratt had initially turned down the role of Peter Quill in 2013, explaining that he did not \"want another Captain Kirk or Avatar moment\" (after humbling auditions for both[22]). The film's casting director, Sarah Finn, suggested Pratt to director James Gunn, who had struggled to cast that role and dismissed the idea. Despite this, Finn arranged for a meeting between the two, at which point Gunn was convinced that Pratt was perfect for the role. Pratt also won over Marvel Studios President Kevin Feige, despite having gained weight again for the comedy film Delivery Man.[4][23] The role was part of a multi-film deal that Pratt signed with Marvel.[24] Bruce Diones of The New Yorker noted, \"Pratt, overflowing with charisma, plays the leader of the pack of misfits, and his blissed-out space cowboy (with a love for seventies music) is so full of good will that he buoys the film and its requisite whizbang special effects.\"[25]\n\nIn November 2013, Pratt, an avid fan of Jurassic Park, who has referred to that film as \"my Star Wars\",[4] replaced Josh Brolin as the lead in the film Jurassic World (2015). He played Owen Grady, who works training velociraptors.[26][27][28][29] Jurassic World grossed $652.3 million in North America and $1.018 billion overseas for a worldwide total of $1.670 billion.[30] His performance was praised, with Peter Travers from Rolling Stones writing that Pratt \"ace[d] it as an action hero and invests his sexual banter with a comic flair the movie could have used more of.\"[31] He reprised the role in the sequel, Jurassic World: Fallen Kingdom, which was released on June 22, 2018.[32] Though the sequel was a commercial success,[33] the film received mixed reviews, with Brian Lowry from CNN criticizing it for \"largely neutralizing [...] Pratt's charm and comedic skills.\"[34]\n\nHis next film role was as Josh Faraday, a gambler, in The Magnificent Seven, a remake of the 1960 Western with the same name, in which he starred alongside Denzel Washington. The film was released on September 23, 2016.[35] Pratt's second 2016 release was Passengers, a science fiction film which opened in December, and co-starred Jennifer Lawrence. Pratt played a character described as \"a mechanic, who wants to get off an Earth that no longer seems to value a guy who works with his hands\".[36]\n\nPratt reprised his role as Peter Quill / Star-Lord in the Guardians of the Galaxy sequel Guardians of the Galaxy Vol. 2, which was released in May 2017. The film focuses on Quill's and his team's search for his father.[37] Pratt also portrayed the character in Avengers: Infinity War, which was released in April 2018,[38] and reprised the role in Avengers: Endgame, which was released on April 26, 2019.[39]\n\nAdditionally, Pratt reprised his role as Emmet in The Lego Movie 2: The Second Part along with another character Rex Dangervest. In August 2017, Pratt was confirmed to star in the western drama The Kid.[40] He is also set to appear as Duncan in the action film Cowboy Ninja Viking alongside Priyanka Chopra.[41] Initially the movie was decided to be released in June 2019, however, on August 7, 2018, the film was pulled from the release list, nullifying the previous release date.[42] In December 2018, Pratt signed on to the Pixar animated film Onward, alongside Avengers: Infinity War co-star Tom Holland.[43]\n\nPublic image\n\nIn March 2014, Pratt was awarded the CinemaCon Award for Breakthrough Performer.[44][45] In 2014, he was ranked at No. 2 on People magazine's annual list of Sexiest Men Alive.[46] Pratt was the featured cover story of the July 18 Entertainment Weekly, which documented the evolution of Pratt's physique over the course of the previous 12 years, going from 220 pounds (100 kg) for his role on Everwood to 295 pounds (134 kg) for Delivery Man, to 225–230 pounds (102–104 kg) for his roles in Zero Dark Thirty and Guardians of the Galaxy.[4] Pratt poked fun at his fluctuating physique in a musical number he performed during his monologue when he hosted the September 27, 2014, episode of Saturday Night Live.[47] On April 21, 2017, Pratt received a star on the Hollywood Walk of Fame for his achievements in motion pictures, located at 6834 Hollywood Boulevard.[48][49]\n\nPersonal life\n\nIn 2007, on the set of Take Me Home Tonight, Pratt met actress Anna Faris, who played his love interest in the film.[4][50] They were engaged in late 2008[51] and married in Bali, Indonesia on July 9, 2009,[52] eloping on a whim after a friend's wedding.[53] They lived in the Hollywood Hills neighborhood of Los Angeles, California.[54][55] Their son, Jack, was born in August 2012,[56] nine weeks premature and weighing only 3 pounds 12 ounces (1.7 kg).[57] Pratt stated that the birth of his preterm son \"really defined\" his faith in God, after both he and his wife \"prayed a lot\" as they were initially afraid of the baby's prognosis.[58] The two separated in 2017[59][60] and finalized their divorce the following year.[61]\n\nPratt began a relationship with author Katherine Schwarzenegger in June 2018.[62][63] On January 13, 2019, Pratt announced through Instagram that he and Schwarzenegger were engaged.[64][65] They were married on June 8, 2019 in Montecito, California.[66]\n\nPratt was raised Lutheran and later worked for Jews for Jesus, eventually becoming a non-denominational Christian.[67]\n\nPolitically, Pratt has stated that he does not feel represented by either side of the political spectrum and has expressed a desire to find common ground.[68] Pratt donated over $1,000 to Barack Obama's 2012 campaign.[69]\n\nFilmography\n\nFilm\n\nTelevision\n\nVideo games\n\nTheme park attractions\n\nAwards and nominations", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/24px-Blank_television_set.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/24px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Chris_Pratt_2018.jpg/220px-Chris_Pratt_2018.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/SMirC-laugh.svg/21px-SMirC-laugh.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Chris_Pratt_2018.jpg/1200px-Chris_Pratt_2018.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/Nuvola_apps_package_graphics.png/21px-Nuvola_apps_package_graphics.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Speech_balloon.svg/24px-Speech_balloon.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/21px-Video-x-generic.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Signature_of_Chris_Pratt.svg/150px-Signature_of_Chris_Pratt.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/Chris_Pratt_2009.jpg/170px-Chris_Pratt_2009.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/21px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/fd/Portal-puzzle.svg/24px-Portal-puzzle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Chris_Pratt_by_Gage_Skidmore_2.jpg/170px-Chris_Pratt_by_Gage_Skidmore_2.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/Coat_of_Arms_of_John_F._Kennedy.svg/75px-Coat_of_Arms_of_John_F._Kennedy.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Chris_Pratt_2018.jpg/1200px-Chris_Pratt_2018.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Chris_Pratt", "title": "Chris Pratt", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Chris_Pratt_2018.jpg/1200px-Chris_Pratt_2018.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}