{"url": "https://ew.com/tv/2018/08/07/the-100-season-5-finale-postmortem-new-planet-monty/", "text": "Image zoom Katie Yu/The CW; Inset: Dia Dipasupil/Getty Images\n\nThe 100 type TV Show network The CW genre Sci-fi\n\nWarning: The following contains spoilers for the season 5 finale of The 100. Read at your own risk!\n\nWell… after multiple apocalypses, nuclear wars, and environmental disasters, it’s finally time to leave the ravaged and barren trash planet once known as Earth behind. In the season 5 finale of the CW’s The 100, Clarke (Eliza Taylor), Bellamy (Bob Morley), and the survivors of the human race made it off the planet just in time to escape nuclear fallout.\n\nBut their plan to go to cryo-sleep and wake up when Earth is habitable again failed, and Monty (Christopher Larkin) secretly charted a new course for his sleeping friends after figuring out the Eligius’s real mission: to find and settle on a different planet light-years away, nestled in a binary star system. And so, when Clarke and Bellamy wake, they find themselves headed for a completely new home — a home that may not be ready for them to call it home just yet.\n\nBelow, The 100 showrunner Jason Rothenberg discusses how the writers decided to move on from Earth entirely; where Clarke, Bellamy, and Octavia (Marie Avgeropoulos) can go from here; and what “End of Book One” meant for the series.\n\nENTERTAINMENT WEEKLY: What inspired this ending, to leap forward 125 years, to lose Monty and Harper, to introduce us to their son, and to effectively start all over, but with a new planet and two suns?\n\nJASON ROTHENBERG: There was a confluence of things we were trying to solve. One of them was we didn’t know whether it was going to be a season or a series finale, so I needed the ending to be a satisfying piece of storytelling, and at the same time tee up something that was really mysterious and enticing for the audience and, to be honest with you, for the powers that be at the network and studio.\n\nThat’s part of the dance, from an inside-baseball perspective. But [our narrative] threads — the spaceship with cryo-sleep on it that had come back from an interstellar mission, the two armies fighting over this one valley — naturally led us to this idea of going to explore another world. It was in the DNA of The 100 that when we say something bad’s gonna happen, it happens. So as I was breaking the season with the writers last year, they were like, “We have to destroy the Valley.” That just made the most logical sense.\n\nRight, humans would squabble over something so pivotal that they end up destroying it. Was that what you were hoping people took away from this ending?\n\nYeah. I mean, we’re all on this planet together, and yet we don’t care what we’re doing to the atmosphere. One of the things we were trying to say — and it’s a little bit of a nihilistic opinion of the human race — is that man couldn’t overcome their innate instincts to make war.\n\nThe last shot has a card saying, “End of Book One.” We’ve never seen anything like that before — what did you mean by that?\n\nIt also could have said, “End of Planet One.” We have the opportunity to create a new world, literally in this case, and it’s a binary star system, so we’re gonna play with what that means in an interesting way. There’s definitely life on that planet. We can see that from space in the finale.\n\nBattlestar Galactica is a huge influence of mine, and so is Interstellar, and I was also really influenced by the movie Annihilation, which I thought was great. It’s inspiring us. The idea is we can really do anything, because life takes endless forms and environmental threats can come from anywhere. Some of it is beautiful and some of it isn’t, just like on our planet.\n\nInteresting! And what are you calling the planet?\n\nI can’t tell you — that’s a spoiler for next season. But we are going in search of Eligius III, with the hope that Eligius III made it to this planet and populated it and were able to survive. We’ll join what is essentially the next outpost for humanity. The story for season 6 is in many ways about what happened to Eligius III and how we interact with what happened to Eligius III. Are there survivors? What are the threats in the woods? Are there woods here? Are there things that don’t exist on Earth? You better believe there are. We’re going to really lean into sci-fi world-building with this planet.\n\nImage zoom Diyah Pera/The CW\n\nSadly, in order for the survivors to find this new planet, Monty and Harper had to say goodbye. How did actors Christopher Larkin and Chelsey Reist react to leaving their characters behind?\n\nIt’s always hard to write a character that’s beloved off a show, and in this case two of them. Chris and I had big, long conversations about it before we started — I have sit-downs with all the series regulars at the start of the season — but Chelsey, who wasn’t a series regular but was certainly a huge part of our show’s family, when I finally figured out what the ending was going to be, I called her.\n\nShe was on her way to work, and I remember she kind of knew what the call was about — they all know when that call comes in, it’s not like we talk on the phone very often — and she had to pull over. She was sad, and it was a hard conversation, but then I pitched her what it was, and I sensed a shift in her on that call. Like, she realized how potentially powerful and emotional and beautiful it would be, giving these two people a happily-ever-after, which is not something the show traffics in, you know? And once we started doing it, it was the most emotional day I’ve ever experienced on set. I think it was for everybody involved.\n\nIt’s a shock for Bellamy and Clarke, certainly, but at least they’ve reconciled. What is their dynamic going to be like going forward? In a way, they now have Madi and Jordan to take care of as, like, their kids.\n\n[Laughs] That’s a funny way to think about that. Jordan is a child in many ways, even though biologically he’s as old as they are, but he’s experienced nothing. Madi’s far more developed emotionally. And Bellamy and Clarke have always been the center of the show, and their relationship is so important to everything we do. When they’re in alignment and have the same goal, things work out; when they’re on opposite sides, it’s usually a s—show. [Laughs]\n\nSo right now, they’re back to being in alignment, but a lot of other characters are not going to forgive Clarke as readily as Bellamy has, and that is something we’re going to keep an eye on as season 6 begins. But they will go forward with Monty’s wish for them to do better. They’ll be committed to that course — Clarke, I think, even more strongly than Bellamy going forward.\n\nWhat makes their relationship so unique at this point in the series?\n\nAt the moment, they’re in their development as people. They are partners, and sometimes I say they’re best friends. They’re certainly not romantic yet. I think personally that that is unique and rare and different than what you normally see in opposite-sex leading roles in television shows, you know? And obviously a lot of people in our fandom still ask that question and yearn for that, and I get that and appreciate that and love that they watch the show, but I can’t make any promises one way or another. Where they are right now is my favorite place for them to be, which is non-romantic partners and soulmates aligned, going in the same direction.\n\nImage zoom Diyah Pera/The CW\n\nBellamy and Octavia, though, still have a ways to go. What kept you from giving them a scene where they completely patched things up?\n\nI feel like that relationship took a while to break, and it’s going to take a while for it to recover. Octavia has not yet really reconciled with what she’s done. She was going to sacrifice herself for them, and she got that taken away from her. On some level, we’re going to play with this a lot in season 6. She’s kind of pissed off and still bitter that people don’t accept that she did keep them alive, that she took on all of that misery so the people in the bunker wouldn’t break. To me, she’s going to need to come out of that on the other side before Bellamy can fully accept her.\n\nAlso, part of Bellamy’s journey is that [his sister] was always his touchstone. No matter what he did, we were going to forgive him because it was for her, for the sister he loved, and we loved. He needs to move on from that too — that’s not owning your own life — so he needs to figure out who he is independent of that. The two of them need to come back together and have a grown-up relationship. He’s lived as her father his whole life, but he’s her brother, and she’s her own person too. That’s where the journey begins for them next season.\n\nNow, just to clarify: Is McCreary dead?\n\nClarke squashed his melon, but that said, you didn’t see a body at the end. So… I suppose the door is open.\n\nUh oh. What about Kane? He’s in a medically induced coma, and actor Henry Ian Cusick is on a new series. Should we brace ourselves for an exit?\n\nI think it’s too early to say. For sure he’s in The 100 next season as we begin the journey, and I love him as an actor and what he’s brought to the show. He’ll always be a core member of The 100 family, and we’re going to figure out [his schedule].\n\nWhat about Diyoza and her baby? Her fetus is now, what, the oldest fetus in the world?\n\nIt’s 200 years old! [Laughs] Two hundred years old and five months. And yes, everybody who’s alive at the end of season 5 is in season 6.\n\nFianlly, with the “End of Book One” card and this reset in mind, how long do you see The 100 going on for?\n\nThe truth is that I used to have an ending in mind, but we passed that ending a while ago, and yet the show keeps staying, for me, creatively challenging and exciting. As long as it is that for me, I will stay on this show, and the show will stay on the air, given [the CW boss] Mark Pedowitz’s desires. For me, shows should have an ending, and they should not go on forever, and when you start repeating yourself too much, then that’s time to walk away. But at this point, that’s one of the reasons we put “End of Book One” on that screen, because it really is the end of one adventure and the beginning of another.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F08%2Fhu412a_0201b-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F13%2Fbetter-call-saul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2Frhbh-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F08%2Fthe-100-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F09%2Flennykravitz.jpg%3Fw%3D768", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F115093_46282_b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F09%2FHomeland_810_4979_R.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F115093_48676b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F11%2Frolestout.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F17%2FNUP_189932_0195.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2FListen-to-Your-Heart.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F10%2Fcelebrity-binge.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F116494_0767b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F08%2Fthe-100-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-voice-rec.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Frhony.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2067'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2064'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F12%2Fsnl.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2Fdee-rogan-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F03%2Fgreys-anatomy-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Fevan-rachel-wood-aaron-paul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-challenge-b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Foutlander-sea5.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F116400_1225b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F08%2Fhun503a_0247b-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2FRVD417d_0162b.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F08%2Fthe-100-2000.jpg", "keywords": [], "authors": ["Shirley Li", "Seija Rankin", "Jodi Walker", "Maureen Lee Lenker", "Andy Hoglund", "Dalton Ross", "Chancellor Agard", "Samantha Highfill", "Sydney Bucksbaum", "James Hibberd"], "canonical_link": "https://ew.com/tv/2018/08/07/the-100-season-5-finale-postmortem-new-planet-monty/", "title": "The 100 boss breaks down season 5 finale, why it was time to say goodbye to [SPOILER]", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Bob Morley,Eliza Taylor,Jason Rothenberg,Marie Avgeropoulos", "news_keywords": "Bob Morley,Eliza Taylor,Jason Rothenberg,Marie Avgeropoulos", "description": "Showrunner Jason Rothenberg talks Clarke and Bellamy's dynamic, Bellamy and Octavia's near-reconciliation, and how 'Annihilation' inspired the last twist.", "og": {"title": "'The 100' boss breaks down season 5 finale, why it was time to say goodbye to [SPOILER]", "type": "article", "site_name": "EW.com", "url": "https://ew.com/tv/2018/08/07/the-100-season-5-finale-postmortem-new-planet-monty/", "description": "Warning: The following contains spoilers for the season 5 finale of&nbsp;The 100. Read at your own risk! Well… after multiple apocalypses, nuclear wars, and environmental&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F08%2Fthe-100-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://ew.com/tv/2018/08/07/the-100-season-5-finale-postmortem-new-planet-monty/", "description": "Showrunner Jason Rothenberg talks Clarke and Bellamy's dynamic, Bellamy and Octavia's near-reconciliation, and how 'Annihilation' inspired the last twist.", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F08%2Fthe-100-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/tv/2018/08/07/the-100-season-5-finale-postmortem-new-planet-monty/", "title": "'The 100' boss breaks down season 5 finale, why it was time to say goodbye to [SPOILER]", "description": "Showrunner Jason Rothenberg talks Clarke and Bellamy's dynamic, Bellamy and Octavia's near-reconciliation, and how 'Annihilation' inspired the last twist.", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F08%2Fthe-100-2000.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}}, "movies": [], "publish_date": 1533571200.0, "source": "https://ew.com", "summary": ""}