{"url": "nypost.com/2000/07/24/mom-bares-her-soul-on-meg-of-her-heart-hopes-rift-is-healed-by-actress-split-with-quaid/", "text": "TO MOVIEGOERS, Meg Ryan conjures up images of hearts, flowers and a perpetually pretty pout.\n\nBut to her mother, Susan Jordan, Meg is something less than the cute-as-a-button queen of romantic comedies.\n\nIn fact, she says, America’s sweetheart is a down and dirty liar.\n\n“I began reading all these falsehoods and lies about me in the press after she met Dennis Quaid,” the 60-year-old former schoolteacher said from her summer house in North Carolina.\n\n“These were lies constructed by my daughter in order to enhance her image – and certainly to protect Dennis Quaid.”\n\nJordan’s shot at Ryan is the latest volley in the mother of all battles between her and her daughter.\n\nBut, with the Ryan-Quaid marriage in tatters, and with Meg drifting off to find true love with “Gladiator” hunk Russell Crowe, Jordan hopes the rift with her daughter may soon be a thing of the past, too.\n\nThe two have not spoken for a decade. Jordan maintains the break was sparked by a 1990 confrontation over Quaid’s drug use.\n\nRyan, 38, implies that the problems with her mother go back much further – to the time, 23 years ago, when Susan walked out on her marriage. Ryan refused to comment for this story.\n\n“Everyone knows Meg as this wonderful persona, the saving angel for poor Dennis,” Jordan says, her voice trembling.\n\n“But I think it was a very handy thing for her to do, to present herself as a savior of this troubled soul who was a drug addict. How would it have looked if it came out that I had noticed this first? She had to discredit me to preserve her image.”\n\nAnd, while Ryan may be estranged from Jordan, she is eerily following in her mother’s footsteps with a similar marriage breakup.\n\nRYAN is about the same age as Jordan was when she left Meg’s father, Harry Hyra, driving away from Bethel, Conn., in her old Ford Pinto in search of a career 50 miles away in Manhattan.\n\n“Trust me, I know what it’s like to be lonely in a marriage,” Jordan says now.\n\n“I don’t know Russell Crowe from a hole in the wall, but I see them together in pictures and I can tell there is something there. I wish she finds the love she so desperately wants from him, and that she is finally happy.”\n\nQuaid has reportedly threatened Ryan that he will do everything he can to keep their 8-year-old son, Jack. That leaves Ryan in much the same position her mother was when she and Hydra decided it was better for their three children to stay with their father until Jordan had the money to support them.\n\nThe children remained with Harry Hyra until the early 1980s, when Ryan went off to the University of Connecticut and the other children joined their mother, who was then teaching at a tony Connecticut prep school, Choate Rosemary Hall. Around that same time, Susan remarried, to journalist Pat Jordan, a man she calls the love of her life.\n\nRyan has said in interviews that her mother abandoned her kids to pursue an acting career in New York – something Jordan hotly denies.\n\nInstead, she maintains, she worked as an assistant to a casting director for about a year while waiting for a job to open up at Choate Rosemary Hall.\n\n“One of the main reasons I took that job was so I could meet all the agents and introduce them to Peggy,” she says, using the family nickname for Ryan, who was then in high school.\n\n“I tried out once for a part in a TV commercial to help pay for basic expenses that my job couldn’t cover.”\n\nAfter Ryan’s graduation, Jordan began taking Ryan to casting agents, introducing her as a young actress, and Ryan began to get roles in commercials.\n\nIn 1978, when she received her Screen Actors Guild membership card, she took her mother’s maiden name as her surname. In 1980, also through her mother’s connections, Ryan won her first part in a feature film – “Rich and Famous,” starring Candice Bergen and Jacqueline Bisset.\n\nFor her part in Ryan’s rise to fame, Jordan says she got small thanks from her daughter.\n\n“When I was diagnosed with breast cancer in 1979, every member of my family came to see me in the hospital after my mastectomy except for Peggy,” Jordan says, her voice quivering.\n\n“She wouldn’t take one day off from college to come see me. She didn’t even call. She said she just didn’t feel comfortable.”\n\nBUT the real rift, Jordan maintains, came in 1990, when she first met Dennis Quaid.\n\n“Meg asked me what I thought of him, and I asked her, ‘Do you want me to tell you what I think, or what you want to hear?’\n\n“She said, ‘Oh, no, Mom. I want to know your honest opinion.’ I said, ‘Well, he strikes me as being childish, undisciplined – but maybe that’s just Hollywood.’\n\n“I didn’t understand him, but I could see what Meg was attracted to. He has a certain boyishness and charm that is very sexy.”\n\nWhat began as a mother’s disapproval turned into a mother’s worst nightmare when Jordan and her second husband, Pat, accepted an invitation from Ryan and Quaid to visit their home in Montana for Thanksgiving a little over a decade ago.\n\n“I noticed some very strange behavior on the part of Dennis. He was jumpy, jittery, red faced, constantly rushing into the bathroom, coming back calm, getting up and rushing to the bathroom or outdoors again. I thought, God, what is wrong here?” she recalls.\n\nJordan claims Quaid’s behavior got even stranger during that visit. When she asked his advice about a trip to Florence, he became enraged.\n\n“I spread some things on the kitchen countertop in an attempt to show Dennis, and he just shoved them off of the counter, snapping, ‘I don’t have time for this right now.’\n\n“I was so shocked I just stood there with my mouth open. Pat rose up from his chair – I thought he was going to grab Dennis by the shirt, he was so angry. I kept saying, ‘No, no, it’s OK,’ to Pat, but I don’t even think Dennis noticed.\n\n“I suspect he didn’t even know what he was doing. I just knew there was something terribly, terribly wrong with his behavior.”\n\nTHE final straw came during Thanksgiving dinner, a meal punctuated with frequent silences – and one final creepy moment.\n\n“The Berlin Wall was just coming down, and Dennis made some crazy comment, and I remember piping up, ‘Dennis, that is just ridiculous!’ and he just stared at me with this incredibly jittery, almost wild look in his eyes.\n\n“Pat stood up at the table and said, ‘Susan, come on, let’s go.’ Peggy looked terrified that I was leaving.\n\n“I had no idea why until months later I thought she might have thought I knew about this [Quaid’s] drug problem. Did she think, what is it going to look like if America’s sweetheart is engaged to a drug addict?”\n\nUpon returning to her home in Fort Lauderdale, Fla., Jordan says she worried about Quaid’s behavior for months before confronting Ryan.\n\n“I called a dear friend who is a physician, who told me Dennis’ behavior sounded like cocaine addiction. I said, ‘Oh my God, can you get over it?'”\n\nThe final straw, Jordan says, was when she read a newspaper story report of Quaid attempting to kick a photographer at the premiere of “Joe Versus the Volcano,” causing Ryan to burst into tears.\n\n“I called Peggy and asked, ‘Is it possible Quaid has a problem with cocaine?’ With that, she started to cry and said she didn’t want to talk about it. I left it at that. I was very worried, but how can you intrude on a grown child?”\n\nTension flared again on the eve of Ryan’s planned wedding to Quaid in 1990. Jordan had phoned her daughter, who later called her back.\n\n“I have no idea to this day what prompted her to call me back that afternoon,” says Jordan. “She demanded to know why I thought Dennis was a drug addict. I said, ‘I never said I thought he was a drug addict, I asked you if he had a problem with cocaine.’\n\n“Peggy said, ‘Who are you to even ask me that?’ I said, ‘I’m your mother! I have to ask you. I love you. I am concerned.’ She slammed the phone down.\n\n“She called me back later that evening to tell me the wedding was off. I tried to say, ‘Oh my goodness,’ but she hung up on me. Those were the last words I heard from her.\n\n“Then I began to read how I was the mother who had abandoned Peggy, that I was the woman who had left my marriage so I could pursue a coffee commercial. I never did say anything about Quaid’s drug addiction, but shortly after our argument he went into a drug rehab program.”\n\nRYAN and Quaid married in 1991 – but Jordan wasn’t invited.\n\nAlthough she tried to make contact with her daughter, Ryan refused her phone calls and eventually instructed her siblings and handlers not to reveal her address and phone number to her.\n\nJordan claims Quaid contacted her right before Jack was born.\n\n“He told me I’d never be able to see my grandson,” she recalls sadly.\n\nOver the years, Ryan and Jordan grew more estranged. A 1992 article in Special Reports magazine in which Pat Jordan wrote about the family feud only exacerbated their problems.\n\nHis vengeful expose, titled “The Meg Ryan Nobody Knows” portrayed the actress as a cold, spiteful child.\n\nIn it, he said: “Meg is an ungrateful, manipulative, envious daughter who wouldn’t take one day off school to look after her cancer-stricken mother.”\n\nHe also wrote about Dennis Quaid’s cocaine addiction. Ryan has told journalists she never read the piece.\n\nNow, Jordan says she wants to set the record straight – and someday make amends with Ryan.\n\n“If she called me now, I would tell her that I love her. It would give me peace to know that she is leading a happy life. She has always been a positive person – always the happiest and most generous child.\n\n“This is why I have been so befuddled all these years and why our estrangement has been so painful.\n\n“I can’t blame Dennis Quaid, but I think it’s strange it all started with him. Now, I hope it’s not to much to pray that this separation ends with him, as well.”", "images": ["https://s0.wp.com/wp-content/themes/vip/plugins/vip-do-not-include-on-wpcom/vip-powered-wpcom/images/vip-powered-dark-small.png", "https://pixel.wp.com/b.gif?v=noscript", "https://thenypost.files.wordpress.com/2020/04/dogears_133x41_right-1.png", "https://thenypost.files.wordpress.com/2020/04/spanx-sale.png?w=300&h=200&crop=1", "http://googleads.g.doubleclick.net/pagead/viewthroughconversion/988380111/?value=0&guid=ON&script=0", "https://thenypost.files.wordpress.com/2020/04/dogears_133x41_left.png", "https://s2.wp.com/wp-content/mu-plugins/post-flair/sharing/images/loading.gif", "https://thenypost.files.wordpress.com/2020/02/knewz_300x250.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://s2.wp.com/wp-content/themes/vip/nypost-2016/static/images/apple-icons/nypost/apple-icon.png"], "top_img": "https://s2.wp.com/wp-content/themes/vip/nypost-2016/static/images/apple-icons/nypost/apple-icon.png", "keywords": [], "authors": ["July"], "canonical_link": "https://nypost.com/2000/07/24/mom-bares-her-soul-on-meg-of-her-heart-hopes-rift-is-healed-by-actress-split-with-quaid/", "title": "MOM BARES HER SOUL ON MEG OF HER HEART – HOPES RIFT IS HEALED BY ACTRESS’ SPLIT WITH QUAID", "meta_data": {"viewport": "width=device-width, initial-scale=1", "copyright": "Copyright 2020 NYP Holdings. All rights reserved.", "p": {"domain_verify": "44b526edc36ffbcc163412ee9fe42833"}, "description": "TO MOVIEGOERS, Meg Ryan conjures up images of hearts, flowers and a perpetually pretty pout.\n  But to her mother, Susan Jordan, Meg is something less than the...", "generator": "WordPress.com", "og": {"type": "article", "title": "MOM BARES HER SOUL ON MEG OF HER HEART – HOPES RIFT IS HEALED BY ACTRESS’ SPLIT WITH QUAID", "url": "https://nypost.com/2000/07/24/mom-bares-her-soul-on-meg-of-her-heart-hopes-rift-is-healed-by-actress-split-with-quaid/", "description": "TO MOVIEGOERS, Meg Ryan conjures up images of hearts, flowers and a perpetually pretty pout. But to her mother, Susan Jordan, Meg is something less than the cute-as-a-button queen of romantic comed…", "site_name": "New York Post", "image": {"width": 200, "height": 200}, "locale": "en_US"}, "article": {"published_time": "2000-07-24T04:00:00+00:00", "modified_time": "2000-07-24T04:00:00+00:00", "publisher": "https://www.facebook.com/nypost", "opinion": "false", "content_tier": "free"}, "twitter": {"creator": "@nypost", "site": "@nypost", "text": {"title": "MOM BARES HER SOUL ON MEG OF HER HEART – HOPES RIFT IS HEALED BY ACTRESS’ SPLIT WITH QUAID"}, "card": "summary_large_image", "title": "MOM BARES HER SOUL ON MEG OF HER HEART - HOPES RIFT IS HEALED BY", "description": "TO MOVIEGOERS, Meg Ryan conjures up images of hearts, flowers and a perpetually pretty pout.\n  But to her mother, Susan Jordan, Meg is something less than the cute-as-a-button queen of romantic"}, "fb": {"pages": 225343690812937}, "nypost-section": "News", "parsely-metadata": "{\"post_id\":\"nypost-90037\"}", "keywords": "News", "google-site-verification": "eyT36MjcFGn_qzUdS9VyWVb89Lq2f8-ItpI8WRksiyw", "msvalidate.01": "8188997BC82071CE07AB711B5675CE54", "application-name": "New York Post", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Your source for breaking news, news about New York, sports, business, entertainment, opinion, real estate, culture, fashion, and more.", "msapplication-task": "name=Subscribe;action-uri=https://nypost.com/feed/;icon-uri=https://secure.gravatar.com/blavatar/0b14d9dbf0c711522a906102b60f3da0?s=16"}, "movies": [], "publish_date": 964368000.0, "source": "http://nypost.com", "summary": ""}