{"url": "http://us3.campaign-archive1.com/?u=468d5dc43334640650b81443f&id=711f7c7ca0&e=6d7cef570b", "text": "BOB SCHIEFFER INTERVIEWS\n\nREP. MICHAEL McCAUL (R-TX)\n\nJANUARY 11, 2014\n\nHEADLINES\n\n\n\nOn what needs to be focused on and done in the U.S. to prevent small scale terrorist attacks from occurring:\n\n\n\n\"..it's this foreign fighter piece that disturbs me greatly. Because we don't have a good handle intelligence-wise who was on the ground in Syria, and Iraq, and Yemen to identify them, to put them on no-fly lists so they can't get in the country.\"\n\n\n\n\"I think Europe has to strengthen and tighten its travel restrictions. But we need to look at protecting this country. Because I see it as a real threat.\"\n\n\n\n\"And I think there's been in this administration a tendency to not call it that [terrorism] and to sort of have a false narrative that everything's okay when in fact the threat, I believe, is not diminishing. It's getting greater in northern Africa and the Middle East. And as that threat becomes greater, so, too, is the threat to the United States.\"\n\n\n\n\n\n***FULL TRANSCRIPT BELOW***\n\n\n\nBOB SCHIEFFER: And we turn now to the chairman of the House Homeland Security Committee here in the United States, Congressman Mike McCaul of Texas. You just heard Mike Morell saying how, you know, the intelligence services in France, and that their budget's cut, and then cut, and cut some more. I understand that the Homeland Security budget is being cut, especially as far as the T.S.A., all the people who guard our airports. Is that so? And are you good with that?\n\n\n\nREP. MIKE MCCAUL: Well, we plan to vote on Tuesday on a measure that would actually increase spending within the department.\n\n\n\nBOB SCHIEFFER: But you're cutting T.S.A. funds, right?\n\n\n\nREP. MIKE MCCAUL: My understanding is there are (UNINTEL) in many areas of the department. And I think that T.S.A. obviously who oversees travel is very important. Look, this is a threat that happened in Paris. It could happen anywhere. And I think we need to be focused on that threat. This is a different style attack in the sense that you had foreign fighters that went to Yemen to train in the art of warfare and then bring that war back home to where they lived in France.\n\n\n\nThat could happen here in the United States. We've had thousands of these Western travelers that have become foreign fighters in Syria, Iraq, and Yemen that pose a threat and a risk of returning to where they came from and to do the same thing that we saw in Paris.\n\n\n\nIn addition, you hear a lot about the homegrown and violent extremist, the lone wolf if you will. We've heard a lot about that and radicalizing over the internet. But it's this foreign fighter piece that disturbs me greatly. Because we don't have a good handle intelligence-wise who was on the ground in Syria, and Iraq, and Yemen to identify them, to put them on no-fly lists so they can't get in the country.\n\n\n\nThese individuals were actually on a no-fly list and still traveled to Yemen and back. We had the woman, the female terrorist, leave and go to Syria. But she's on a no-fly list. So I think Europe has to strengthen and tighten its travel restrictions. But we need to look at protecting this country. Because I see it as a real threat.\n\n\n\nBOB SCHIEFFER: Well, what do we need to do that we're not doing here?\n\n\n\nREP. MIKE MCCAUL: Again, I think a couple things. I think our no-fly lists are working, I think, well. But you don't know what you don't know. We need to identify who has gone over there, traveled over there to fight this fight. And then how do we keep them off of airplanes and restrict their travel?\n\n\n\nWestern Europe, again, is more lenient in their travel restrictions. And we have a visa waiver-free system where they can fly in the United States without even having a visa. We need to look at all sorts of things like that. But mainly, it's driven by intelligence. I'm launching an investigation on my committee to look at security and defense gaps that may exist as it pertains to foreign fighters. This is the most successful foreign fighter terrorist attack that we have seen to date.\n\n\n\nBOB SCHIEFFER: Well, how much of a threat does Al Qaeda in Yemen pose now? Because we see now that they're taking credit for this attack. You heard Mike Morell say, \"When they say they take credit for it, it generally proves to be true.\"\n\n\n\nREP. MIKE MCCAUL: Well, let's remember, this is Awlaki who inspired a major (UNINTEL) at Fort Hood. These two brothers traveled to Yemen and trained under Awlaki in the art of warfare and took that back. So you mentioned the war on terror to General Holder. And I think there's been in this administration a tendency to not call it that and to sort of have a false narrative that everything's okay when in fact the threat, I believe, is not diminishing. It's getting greater in northern Africa and the Middle East. And as that threat becomes greater, so, too, is the threat to the United States. And that's what we have to be prepared for.\n\n\n\nBOB SCHIEFFER: So you think these are more dangerous times than before?\n\n\n\nREP. MIKE MCCAUL: I believe with small-scale attacks, like, the larger scale 9/11-style more difficult to pull off. A bigger cell we can detect. A small cell like this one, very difficult to detect, deter, and disrupt, which is really our goal. And I think we're going to see more and more of these taking place, whether it be foreign fighters going to the warfare and return or whether it be someone who's getting on the internet, as John Miller talked about, and this very sophisticated social media program, and then radicalizing over the internet.\n\n\n\nBOB SCHIEFFER: Congressman McCaul, thank you for joining us. And we'll be back in one minute with more on all this.\n\n\n\n***END OF TRANSCRIPT***\n\nPRESS CONTACT:\n\nJackie Berkowitz, berkowitzj@cbsnews.com\n\n(202) 600-6407\n\n", "images": ["https://gallery.mailchimp.com/468d5dc43334640650b81443f/images/FTN_2014_logo.5.jpg"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "", "title": "Rep. Michael McCaul (R-TX) Appears on Face the Nation", "meta_data": {"og": {"title": "Rep. Michael McCaul (R-TX) Appears on Face the Nation"}, "fb": {"page_id": 43929265776}, "viewport": "width=device-width, initial-scale=1.0", "referrer": "origin"}, "movies": [], "publish_date": null, "source": "http://us3.campaign-archive1.com", "summary": ""}