{"url": "https://ew.com/movies/2017/11/20/armie-hammer-casey-affleck-nate-parker-double-standard/", "text": "In a new interview with the Hollywood Reporter, Armie Hammer said that Nate Parker was held to a double standard last year when allegations of sexual misconduct against both him and Casey Affleck resurfaced, but only Parker suffered a career-affecting backlash.\n\nParker, who directed and starred in The Birth of a Nation, appeared destined for Oscar glory after his film received a rapturous response upon its Sundance Film Festival premiere in 2016. However, an allegation of rape made against him during his time at Penn State, in 1999, was made public months later. Parker was acquitted in 2001, but another man involved, his roommate Jean Celestin, was initially convicted. (The verdict was later overturned on appeal.) The alleged victim later dropped out of school, before dying by suicide in 2012. Parker apologized and expressed regret for his accuser’s death, but drew criticism for attempts to deflect attention from the topic.\n\nHammer, who costarred in The Birth of a Nation, claimed Parker’s alleged rape making the headlines as Oscar season approached was “orchestrated for sure.” He added, “There was another person in the industry, who had a competing film for the Academy Awards, who decided to release all of the phone records and information.” (Hammer explained several people have told him who the person was, but declined to identify him.)\n\nAffleck, meanwhile, went on to win best actor at the Oscars for his turn in Manchester by the Sea. While he was on the campaign circuit, however, Affleck’s alleged sexual misconduct also resurfaced. He was sued in 2010 by two women who worked on the film I’m Still Here for sexual harassment; both cases were settled out of court. Affleck has denied the allegations. “It was settled to the satisfaction of all,” Affleck told the Times last year. “I was hurt and upset — I am sure all were — but I am over it. It was an unfortunate situation — mostly for the innocent bystanders of the families of those involved.”\n\nPer Hammer, the difference in treatment between the two men, with Parker’s movie ultimately underperforming at the box office and being completely snubbed by awards bodies, was unfair. “Nate had the stuff in his past, which is heinous and tough to get beyond. I get that,” he said. “But that was when he was 18, and now he’s in directors jail. At the same time, the guy who went and won an Academy Award has three cases of sexual assault against him.” (Affleck’s sexual misconduct suits were settled out of court, and no accusations of assault have been publicly made against him.) Hammer continued, “It just doesn’t make sense.”\n\nWhen pressed to acknowledge the difference in severity between the two sets of allegations — Parker was accused of rape by a woman who later killed herself; Affleck allegedly used abusive language and, at one point, was claimed to have gotten into bed drunkenly with a woman without consent — Hammer acquiesced but while maintaining his point. “I’m not saying Nate should not have been in trouble,” he said, dubbing Parker’s alleged behavior “heinous and atrocious.” “I’m saying that they got in different levels of trouble. And that’s the disparity. It’s like there are two standards for how to deal with someone who has this kind of issue in their past, you know?”\n\nHammer is currently receiving Oscar buzz for his performance in Call Me by Your Name, which hits theaters on Friday.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F09%2Flennykravitz.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F11%2Frolestout.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F11%2Fgettyimages-874733124-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F10%2Fcelebrity-binge.jpg%3Fw%3D768"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F11%2Fgettyimages-874733124-2000.jpg", "keywords": [], "authors": ["David Canfield"], "canonical_link": "https://ew.com/movies/2017/11/20/armie-hammer-casey-affleck-nate-parker-double-standard/", "title": "Armie Hammer calls out double standard between Casey Affleck and Nate Parker", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Armie Hammer,Casey Affleck,Nate Parker", "news_keywords": "Armie Hammer,Casey Affleck,Nate Parker", "description": "Hammer starred in 'The Birth of a Nation,' the film which Nate Parker directed", "og": {"title": "Armie Hammer calls out double standard between Casey Affleck and Nate Parker", "type": "article", "site_name": "EW.com", "url": "https://ew.com/movies/2017/11/20/armie-hammer-casey-affleck-nate-parker-double-standard/", "description": "In a new interview with the Hollywood Reporter, Armie Hammer said that Nate Parker&nbsp;was&nbsp;held to a double standard last year when allegations of sexual misconduct&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F11%2Fgettyimages-874733124-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://ew.com/movies/2017/11/20/armie-hammer-casey-affleck-nate-parker-double-standard/", "description": "Hammer starred in 'The Birth of a Nation,' the film which Nate Parker directed", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F11%2Fgettyimages-874733124-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/movies/2017/11/20/armie-hammer-casey-affleck-nate-parker-double-standard/", "title": "Armie Hammer calls out double standard between Casey Affleck and Nate Parker", "description": "Hammer starred in 'The Birth of a Nation,' the film which Nate Parker directed", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F11%2Fgettyimages-874733124-2000.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}}, "movies": [], "publish_date": 1511107200.0, "source": "https://ew.com", "summary": ""}