{"url": "https://web.archive.org/web/20181224182313/https://www.forbes.com/sites/scottmendelson/2018/12/24/how-aquaman-saved-the-dc-films-universe-and-redeemed-batman-v-superman/", "text": "Barring a fluke, Aquaman will probably cross $500 million worldwide sometime today or very early tomorrow. The DC Films superhero flick has earned $483m worldwide, including $72.7m in its domestic debut, so it should be over/under $80m domestic by the end of today. For reference, National Treasure fell 40% on its first Monday on Christmas Eve after a $44m debut weekend in 2007 while The Hobbit: An Unexpected Journey, which opened a week earlier in 2012, fell 60% on day four after a then-record $84m Fri-Sun haul. So, yeah, barring an unexpected collapse, the Jason Momoa/Amber Heard adventure is already a sizable hit for the Dream Factory, and it’s on course to be their biggest domestic and global grosser of 2018.\n\nIt is standard practice after any DC Films movie to examine what its success (or relative failure) means for the brand as a whole. It may be too early to explore the long-term impact, but at a glance, DC Films is now in a position where not every film has to justify the entire IP or the overall fate of the studio. Warner Bros. had a pretty damn good 2018, offering a slew of mid-priced domestic winners (A Star Is Born, Crazy Rich Asians, Ocean’s 8) and big-budget tentpoles that did okay in North America and broke big overseas (Ready Player One, The Meg, Rampage) and thus finally declaring that they won’t be entirely defined by DC Films and the J.K. Rowling brand.\n\nOne thing the relative commercial and critical success of Aquaman means is that the series won’t necessarily live or die by the fate of each movie. Maybe Shazam will be another goofy treat, and since it’s from New Line as well as Warner Bros., I’m presuming it’s budgeted closer to The Fellowship of the Ring than The Hobbit: An Unexpected Journey. Maybe Todd Phillips' Joker will be a halfway-decent 1980s crime drama that happens to be a Joker origin story. Or perhaps not. But each new film will, as long as some of them are decent (and WB has other IP and non-IP hits to crow about), be allowed to stand on its own without much concern about the overall fate of the brand being taken into account.\n\nCoincidentally enough, today marks 33 months since the release of Zack Snyder’s Batman v Superman: Dawn of Justice. After Snyder’s Man of Steel earned mixed reviews and grossed “just” $668 million worldwide, Man of Steel 2 morphed first into a Superman sequel that happened to involve Batman and eventually into an official backdoor pilot for the DC Films franchise. So the poor reviews and quick-kill box office ($873m but from a $422m global launch) wasn’t just about whether the movie made money (it did) or justified itself artistically (that’s a coin toss, especially in its compromised theatrical cut), but how it laid the groundwork for the sequels and spin-offs to come. Much of the conversation revolved around what the film said about the overall DC Comics film franchise.\n\nThis is what happens when a studio positions a new biggie as not just a big movie (or even a big sequel) but as a launching pad for a would-be cinematic universe. It was a distinctly less stand-alone movie than, for example, Sony’s The Amazing Spider-Man 2 (whose marketing emphasized the barely-there cinematic universe implications). Superman (Henry Cavill) met Batman (Ben Affleck), Wonder Woman (Gal Gadot) and Lex Luthor (Jesse Eisenberg). We briefly met The Flash (Ezra Miller), Aquaman (Jason Momoa) and Cyborg (Ray Fisher). The film set up a looming threat from Apokolips and hinted at an endgame similar to Injustice: Gods Among Us (a popular DC Comics fighting video game where Superman goes world-crushingly rogue after Lois Lane is murdered).\n\nOh, and it ended with Clark Kent perishing in battle with the presumption that he would be resurrected in Justice League. The grim, hyper-violent and barely comprehensible sequel was discussed in terms of its quality and in terms of what it meant for the overall DC Films franchise. It earned nearly $900 million but was so divisively received that it caused significant changes for Suicide Squad (which ended up being recut by the company that produced the first crowd-pleasing theatrical trailer) and Justice League (where Joss Whedon eventually took over from Zack Snyder and delivered a soft remake of The Avengers). As a backdoor pilot for a cinematic universe that was intended to replace WB’s Harry Potter grosses and stand toe-to-toe with the MCU, it was a disaster.\n\nBut the success of James Wan’s Aquaman, both critically and (thus far) commercially, means two big things for the DC Films franchise. First, it means that they can keep the established continuity intact while going in a different direction (or many different directions) for the likes of Cathy Yan's Birds of Prey, David Sanberg's Shazam and Patty Jenkins' Wonder Woman 1984. It may not have “saved the DCEU,” but it most certainly saved the DC Films continuity and prevented a more overt reboot. Ditto (presumably) Shazam, whose trailer explicitly references the events of Batman v Superman even while telling a more kid-friendly adventure fantasy. Secondly, for what it’s worth, it means we can now judge Dawn of Justice as its own thing instead of a foundation for a rickety house.\n\nAs a stand-alone film, even the 180-minute (and R-rated) “ultimate edition” has many of the same problems it did 2.5-years-ago. The critical title fight is still based on miscommunication and misdirection, so it’s not really the Man of Steel and the Dark Knight wanting to beat the hell out of each other. The first two hours is mostly just Lex Luthor (an underrated turn from Eisenberg) slaughtering innocents behind the scenes while Batman and Superman blame each other and brood. The desire to make Luthor into a full-blown puppet master makes the plot more complicated and confusing than it needed to be. And, like Man of Steel (and Chris Nolan’s The Dark Knight Rises), the film’s first plot-filled/character-centric half is more compelling than its action-packed second half.\n\nAbsent the misguided notion of introducing a four-quadrant super-franchise with a film like Batman v Superman, the picture works as an Elseworlds movie. It is still one of the most beautiful-looking superhero movies I’ve ever seen, and how I wish Larry Fong had shot Justice League too. While too many superhero team-up movies and shows tend to isolate their heroes and minimize their contact with the outside world, Batman v Superman has a sprawling supporting cast and is as much about the regular people as it is about Batman and Superman. As a visually-majestic and highly quotable superhero drama that blends gritty realism with apocalyptic fantasy while trying to examine Superman’s role in a world where his every action is politicized, it’s at worst a noble failure.\n\nLike Ang Lee’s Hulk or even Jon Favreau’s Iron Man 2 (which is a superhero sequel as a sitcom bottle episode), Zack Snyder’s second DC Films movie is an engrossing misfire both for what it attempts and beautiful it often looks and sounds. There’s certainly nothing else like it in the sub-genre. It will likely age well as its own thing now that it no longer carries the burden of an entire cinematic universe (and arguably an entire movie studio) on its doomed, misguided shoulders. That it turned out to be the most potent (and sadly accurate) political metaphor for the 2016 presidential election (Batman = Sanders, Superman = Clinton, Luthor = Trump) of that year only adds to its skewed legacy. And now Aquaman has set it free.", "images": ["https://web.archive.org/web/20181224182313im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fscottmendelson%2Ffiles%2F2016%2F03%2Fbatman-v-superman-dawn-of-justice-wonder-woman-1200x503.jpg", "https://web.archive.org/web/20181224182313im_/https://secure.gravatar.com/avatar/5e0887272964be6b258946209a00ffa2?s=400&d=mm&r=g"], "top_img": "https://web.archive.org/web/20181224182313im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fscottmendelson%2Ffiles%2F2016%2F03%2Fbatman-v-superman-dawn-of-justice-wonder-woman-1200x503.jpg", "keywords": [], "authors": ["Scott Mendelson", "Senior Contributor"], "canonical_link": "https://web.archive.org/web/20181224182313/https://www.forbes.com/sites/scottmendelson/2018/12/24/how-aquaman-saved-the-dc-films-universe-and-redeemed-batman-v-superman/", "title": "How 'Aquaman' Saved The DC Films Universe And Redeemed 'Batman V Superman'", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1,maximum-scale=2,user-scalable=yes", "apple-itunes-app": "app-id=588647136", "fb": {"app_id": 123694841080850}, "og": {"site_name": "Forbes", "title": "How 'Aquaman' Saved The DC Films Universe And Redeemed 'Batman V Superman'", "image": "https://web.archive.org/web/20181224182313im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fscottmendelson%2Ffiles%2F2016%2F03%2Fbatman-v-superman-dawn-of-justice-wonder-woman-1200x503.jpg", "updated_time": "2018-12-24T10:10:50-05:00", "url": "https://web.archive.org/web/20181224182313/https://www.forbes.com/sites/scottmendelson/2018/12/24/how-aquaman-saved-the-dc-films-universe-and-redeemed-batman-v-superman/", "description": "'Aquaman's success means that the DC Films continuity can remain intact and that its most controversial movie can be judged on its own merits.", "type": "article"}, "twitter": {"site": "@forbes", "card": "summary_large_image", "title": "How 'Aquaman' Saved The DC Films Universe And Redeemed 'Batman V Superman'", "description": "'Aquaman's success means that the DC Films continuity can remain intact and that its most controversial movie can be judged on its own merits.", "image": "https://web.archive.org/web/20181224182313im_/https://thumbor.forbes.com/thumbor/600x300/https%3A%2F%2Fblogs-images.forbes.com%2Fscottmendelson%2Ffiles%2F2016%2F03%2Fbatman-v-superman-dawn-of-justice-wonder-woman-1200x503.jpg", "creator": "@scottmendelson"}, "description": "'Aquaman's success means that the DC Films continuity can remain intact and that its most controversial movie can be judged on its own merits.", "author": "Scott Mendelson", "article": {"publisher": "https://www.facebook.com/forbes", "author": "Scott Mendelson", "section": "Consumer", "section_url": "https://www.forbes.com/hollywood-entertainment//", "id": "blogAndPostId/blog/post/2595-54935", "published": "2018-12-24", "modified": "2018-12-24"}}, "movies": [], "publish_date": 1545580800.0, "source": "https://web.archive.org", "summary": ""}