{"url": "https://www.cosmopolitan.com/entertainment/tv/a15925589/rose-mcgowan-citizen-rose-review/", "text": "There’s a scene in the new docuseries Citizen Rose where Rose McGowan, the former actress turned activist/artist who says she was raped by Hollywood producer Harvey Weinstein in 1997, has just learned that Weinstein’s people have gotten a hold of 125 pages of her new memoir, Brave.\n\n“When I found out that the monster stole the first 125 pages of my book to discredit and destroy my voice, I can’t tell you how violating it felt,” she says in a voiceover as she paces, frenzied, around the room, her friend Tamara sitting by, quietly watching. “It was like being back in that room with him all over again, only this time it was the inside of my mind and not my body.”\n\nThe objective of the project is to show and exalt McGowan specifically — and that might test some viewers’ patience. But beneath the surface is where the audience can better understand the larger conversation McGowan is trying to move forward. For all who see themselves — personally, intimately, unexpectedly — in the #MeToo movement, it’s often impossible to find the words for what these men have taken. She’s offering up her own.\n\nThe objective of the project is to show and exalt McGowan specifically — and that might test some viewers' patience.\n\nThe 90-minute docuseries follows McGowan over the course of three months — from October, when the first accusations against Weinstein were published by the New York Times, to the Women’s Convention in Detroit, to her experience in November learning that, through a published report by Ronan Farrow in the New Yorker, Weinstein had hired a private intelligence agency to spy on her.\n\nThroughout the documentary, Weinstein’s name is scrambled and his face is obscured, only being referred to by McGowan as her “monster.” The series premieres on the same day as the release of her memoir, where she explicitly details what she says Weinstein did to her at Sundance in 1997, never having formally shared her story as a result of accepting a settlement from Weinstein. There is biographical context throughout, establishing McGowan’s youth growing up in a cult with a domineering father and a mother she says failed her. The viewer is invited to a Thanksgiving dinner at McGowan’s brother James’s house, and is witness to an uncomfortable confrontation with her mother, Terri, who McGowan consistently interrupts as the woman — who has also experienced abuse at the hands of men — tries to explain her feelings about the movement that McGowan has heralded.\n\nFor this reason, Citizen Rose can be frustrating to watch. While the documentary is clearly positioned as a focused piece on McGowan, the viewer yearns to hear from more women’s voices in the ongoing battle against abuse of power that McGowan talks about. In occasions where the struggles of other women are introduced — in one scene, McGowan holds a conversation circle with women who were victims of domestic violence, without explaining who they are or why they are there — there is a centering on McGowan that feels ill-conceived. When McGowan says in the beginning of the documentary, “Do I make you uncomfortable?” one wonders if this is what she meant.\n\nBut, for all the moments where we are unsettled by reminders of McGowan’s confidence in her own heroism, we are given equal chances to reflect on our own bristling toward it. There is no perfect activist. There is no blueprint for this watershed moment, the likes of which we have never seen before. The violation that McGowan, and so many other women, have lived through does not and could not ever come with an easy and seamless healing. In a way, that is what McGowan is trying to communicate with this documentary: her “monster” robbed her of so much, and as a result, she was shut down, dismissed, and called crazy. Several times in the docuseries, we see McGowan spontaneously break into tears, and these moments shatter the viewer’s heart. “I got really interrupted, you have to understand,” she says, crying to her mother. “I didn’t get to be me for seventeen years.”\n\nThere is no blueprint for this watershed moment, the likes of which we have never seen before.\n\nMcGowan, as well, admits briefly in the documentary that there have been times when she went too far. After accusing actress Meryl Streep and others of hollow support of the movement by wearing black to the Golden Globes, McGowan apologized, saying, “There is no map for this road I’m on, I will fuck up.” In another instance, McGowan responded to James Corden’s Weinstein joke at the AmfAR gala in October by suggesting you could replace “women” with the “n-word,” and it would feel the same. “And, please, to anyone POC I offended with my stupidity lapse, know that I am profoundly sorry. I hear you,” she tweeted. McGowan is learning in real time not only what it means to tell the truth and be heard, but how privilege, and sometimes ignorance, affords her the opportunity to do this in the first place. The docuseries is an opportunity for her to bring her experiences, voice, and truth to a larger audience.\n\nThe most powerful scene comes when Italian director Asia Argento — another one of Weinstein’s outspoken accusers — talks to McGowan about what happened to her after she had been assaulted. “I wish I was softer,” Argento says. “It made me hard toward the world. It made me worse as a person.” The pair cry together, and McGowan tells her, “Asia, you are an incredibly brave soul. You have persevered. You have fought to be here.” It’s then that the message of the series truly permeates: women like Argento and McGowan, Tarana Burke and Suzette Wright, and countless unnamed others have persevered to tell the truth. No matter how uncomfortable and painful and messy it might be, we owe it to all of them to listen.\n\nFollow Dayna on Twitter and Cosmo Celeb on Facebook.\n\nCitizen Rose premieres tonight at 8 p.m. ET on E!.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/meryl-streep-rose-mcgowan-1513704128.png?crop=1.00xw:1.00xh;0,0&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-626363072-1517412424.jpg?crop=1.00xw:0.788xh;0,0.0705xh&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-626363072-1517412424.jpg?crop=1.00xw:0.788xh;0,0.0705xh&resize=1200:*", "keywords": [], "authors": ["Dayna Evans"], "canonical_link": "https://www.cosmopolitan.com/entertainment/tv/a15925589/rose-mcgowan-citizen-rose-review/", "title": "Rose McGowan’s Citizen Rose Will Rub Some People the Wrong Way. Too Bad.", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "Rose McGowan’s \"Citizen Rose\" Will Rub Some People the Wrong Way. Too Bad.", "description": "The docuseries positions McGowan as a confident leader. If that makes you bristle, you should ask yourself why.", "url": "https://www.cosmopolitan.com/entertainment/tv/a15925589/rose-mcgowan-citizen-rose-review/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-626363072-1517412424.jpg?crop=1.00xw:0.788xh;0,0.0705xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2018-01-31 04:22:39", "published_time": "2018-01-30 07:38:00", "section": "TV", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-626363072-1517412424.jpg?crop=1.00xw:0.788xh;0,0.0705xh&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Rose McGowan's Citizen Rose Review -  E! Documentary Recap", "description": "Rose McGowan's E! docuseries 'Citizen Rose' might rub some viewers the wrong way, but it's important to watch.", "keywords": "rose mcgowan, citizen rose, what happens in citizen rose, citizen rose recap, citizen rose review, e!, rose mcgowan documentary, rose mcgowan docuseries", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-626363072-1517412424.jpg?crop=0.639xw:1.00xh;0.181xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrities & Entertainment,entertainment,tv", "sailthru.date": "2018-01-30T19:38:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-626363072-1517412424.jpg?crop=1.00xw:0.788xh;0,0.0705xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-626363072-1517412424.jpg?crop=0.639xw:1.00xh;0.181xw,0", "sailthru.socialtitle": "Rose McGowan’s \"Citizen Rose\" Will Rub Some People the Wrong Way. Too Bad.", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1517269080.0, "source": "https://www.cosmopolitan.com", "summary": ""}