{"url": "http://www.economist.com/Trumptranscript", "text": "DONALD TRUMP, the President of the United States, along with Steve Mnuchin, the treasury secretary, and Gary Cohn, the director of the National Economic Council, sat down for a conversation with editors from The Economist on May 4th, 2017. What follows is a lightly edited transcript.\n\nThe Economist: Could we start with the economy?\n\nDonald Trump: Sure.\n\nWhat is Trumponomics and how does it differ from standard Republican economics?\n\nWell it’s an interesting question. I don’t think it’s ever been asked quite that way. But it really has to do with self-respect as a nation. It has to do with trade deals that have to be fair, and somewhat reciprocal, if not fully reciprocal. And I think that’s a word that you’re going to see a lot of, because we need reciprocality in terms of our trade deals. We have nations where…they’ll get as much as 100% of a tax or a tariff for a certain product and for the same product we get nothing, OK? It’s very unfair. And the very interesting thing about that is that, if I said I’m going to put a tax on of 10%, the free-traders, somewhat foolishly, they’ll say “Oh, he’s not a free-trader”, which I am, I’m absolutely a free-trader. I’m for open trade, free trade, but I also want smart trade and fair trade. But they’ll say, “He’s not a free-trader,” at 10%. But if I say we’re putting a reciprocal tax on, it may be 62% or it may be 47%, I mean massive numbers, and nobody can complain about it. It’s really sort of an amazing thing.\n\nSo that’s the story. It very much has to do with trade. We have so many bad trade deals. To a point where I’m not sure that we have any good trade deals. I don’t know who the people are that would put us into a NAFTA, which was so one-sided. Both from the Canada standpoint and from the Mexico standpoint. So one-sided. Wilbur [Ross, the secretary of commerce] will tell you that, you know, like, at the court in Canada, we always lose. Well, the judges are three Canadians and two Americans. We always lose. But we’re not going to lose any more. And so it’s very, very unfair.\n\nTrump on Trumponomics:Nationalism plus flexibility\n\nLeader:The impulsiveness and shallowness of America’s president threaten the economy as well as the rule of law\n\nBriefing 1:Donald Trump’s economic strategy\n\nBriefing 2:The contradiction at the heart of Trumponomics\n\nBriefing 3:What Donald Trump means by fair trade\n\nNow at the same time I have a very good relationship with Justin [Trudeau, the Canadian prime minister] and a very good relationship with the president of Mexico. And I was going to terminate NAFTA last week, I was all set, meaning the six-month termination. I was going to send them a letter, then after six months, it’s gone. But the word got out, they called and they said, we would really love to…they called separately but it was an amazing thing. They called separately ten minutes apart. I just put down the phone with the president of Mexico when the prime minister of Canada called. And they both asked almost identical questions. “We would like to know if it would be possible to negotiate as opposed to a termination.” And I said, “Yes, it is. Absolutely.” So, so we did that and we’ll start.\n\nWe have a problem because we have a ridiculous provision in NAFTA that we have, you know, to go on the fast track. Fast track is the slowest track I’ve ever seen. To go on the fast track you have to give notice. Well we gave notice 70 days ago. It’s called a cooling-off period, OK? But that’s not the way life works because when they call and they want to make a deal, I don’t want to have to wait a hundred days. So I put the papers in almost 70 days ago, to get the approval for fast track in Congress. And they still haven’t given me approval. And the reason they haven’t is because our trade negotiator, who, as you know, the provision goes with your negotiator. It doesn’t go from the time you put it in, it goes with your negotiator. So he just got approved. He’ll be in sometime, I guess next week?\n\nSteve Mnuchin: Yep, yep.\n\nPresident Trump: And the clock starts ticking. But here you have two people calling saying, “Can we negotiate?” I say yes and I have to wait for a hundred days. I don’t know what a hundred days is going to be like. What’s it going to be like? So NAFTA’s a horrible one-sided deal that’s cost us millions and millions of jobs and cost us tens of billions of dollars.\n\nIt sounds like you’re imagining a pretty big renegotiation of NAFTA. What would a fair NAFTA look like?\n\nBig isn’t a good enough word. Massive.\n\nHuge?\n\nIt’s got to be. It’s got to be.\n\nWhat would it look like? What would a fair NAFTA look like?\n\nNo, it’s gotta be. Otherwise we're terminating NAFTA.\n\nWhat would a fair NAFTA look like?\n\nI was all set to terminate, you know? And this wasn’t like…this wasn’t a game I was playing. I’m not playing…you know, I wasn’t playing chess or poker or anything else. This was, I was, I’d never even thought about…it’s always the best when you really feel this way. But I was…I had no thought of anything else, and these two guys will tell you, I had no thought of anything else but termination. But because of my relationship with both of them, I said, I would like to give that a try too, that’s fine. I mean, out of respect for them. It would’ve been very disrespectful to Mexico and Canada had I said, “I will not.”\n\nBut Mr President, what has to change for you not to withdraw?\n\nWe have to be able to make fair deals. Right now the United States has a 70—almost a $70bn trade deficit with Mexico. And it has about a $15bn dollar trade deficit with Canada. The timber coming in from Canada, they’ve been negotiating for 35 years. And it’s been…it’s been terrible for the United States. You know, it’s just, it’s just been terrible. They’ve never been able to make it.\n\nDoes that $70bn deficit have to come to zero to be fair?\n\nNot necessarily. And certainly it can come over a, you know, fairly extended period of time, because I’m not looking to shock the system. But it has to become at least fair. And no, it doesn’t have to immediately go to zero. But at some point would like to get it at zero, where sometimes we can be up and sometimes they can be up.\n\nYou’ve talked about reciprocal taxes. Do you imagine that with lots of countries on lots of products or is that a negotiating tool?\n\nNo, I think it can be conceivably with lots of countries. The thing that’s bad about the hundred days is, I said the other day, I said, “When do we start this negotiation?” They said, “Sir, it hasn’t kicked in yet” because it goes with [Robert] Lighthizer, who’s our, you know, our representative, who I think is going to do a very good job. I said, “You must be kidding.” So it’s a real deficit. Now that’s a NAFTA thing. Because everything in NAFTA is bad. That’s bad, everything’s bad. But in the case of South Korea we have a deal that was made by Hillary Clinton, it’s a horrible deal. And that is the five-year anniversary and it’s up for renegotiation and we’ve informed them that we’ll negotiate. And again, we want a fair deal. We don’t want a one-sided deal our way but we want fair deals. And if we can have fair deals our country is going to do very well.\n\nSome people think this is a negotiating tactic—that you say very dramatic things but actually you would settle for some very small changes. Is that right?\n\nNo, it’s not, really not a negotiation. It’s really not. No, will I settle for less than I go in with? Yes, I mean who wouldn’t? Nobody, you know, I always use the word flexibility, I have flexibility. [Goes off the record.] [Our] relationship with China is long. Of course by China standards, it’s very short [laughter], you know when I’m with [Xi Jinping], because he’s great, when I’m with him, he’s a great guy. He was telling me, you know they go back 8,000 years, we have 1776 is like modern history. They consider 1776 like yesterday and they, you know, go back a long time. They talk about the different wars, it was very interesting. We got along great. So I told them, I said, “We have a problem and we’re going to solve that problem.” But he wants to help us solve that problem.\n\nNow then you never know what’s going to happen. But they said to me that on the currency manipulation, “Donald Trump has failed to call China a currency manipulator”. Now I have to understand something. I’m dealing with a man, I think I like him a lot. I think he likes me a lot. We were supposed to meet for ten minutes and they go to 40-person meetings, OK, in Mar-a-Lago, in Palm Beach. And the ten minutes turned out to be three hours, alone, the two of us. The next day it was supposed to be ten minutes and then we go to our 40-person meeting. That, too, he was, no…because you guys were waiting for a long time. That ten minute meeting turned out to be three hours. Dinner turned out to be three hours. I mean, he’s a great guy.\n\nNow, with that in mind, he’s representing China and he wants what’s best for China. But so far, you know, he’s been, he’s been very good. But, so they talk about why haven’t you called him a currency manipulator? Now think of this. I say, “Jinping. Please help us, let’s make a deal. Help us with North Korea, and by the way we’re announcing tomorrow that you’re a currency manipulator, OK?” They never say that, you know the fake media, they never put them together, they always say, he didn’t call him a currency [manipulator], number one. Number two, they’re actually not a currency [manipulator]. You know, since I’ve been talking about currency manipulation with respect to them and other countries, they stopped.\n\nMr Mnuchin: Right, as soon as the president got elected they went the other way.\n\nOne last question on trade. Do you think you’ve permanently changed the Republican Party’s position on trade?\n\nNo. Because there’ll always be someone that comes along with another idea but it’s not a better idea. We have the better idea. But yeah, I think that a lot of the, like for instance today, health care. Very big thing. Very big. And it wasn’t two bites of the apple. It was one bite. Somebody set a time limit and that was mistake, I said never set a time limit but somebody set a time limit. So when they didn’t meet that time limit they said, “We didn’t get it there”, well, they shouldn’t have set a time limit.\n\nOn another element of Trumponomics, immigration…\n\nRight.\n\nDo you want to curb legal immigration?\n\nOh sure, you know, I want to stop illegal immigration.\n\nAnd what about legal immigration? Do you want to cut the number of immigrants?\n\nOh legal, no, no, no. I want people to come into the country legally. No, legally? No. I want people to come in legally. But I want people to come in on merit. I want to go to a merit-based system. Actually two countries that have very strong systems are Australia and Canada. And I like those systems very much, they’re very strong, they’re very good, I like them very much. We’re going to a much more merit-based system. But I absolutely want talented people coming in, I want people that are going to love our country coming in, I want people that are going to contribute to our country coming in. We want a provision at the right time, we want people that are coming in and will commit to not getting…not receiving any form of subsidy to live in our country for at least a five-year period.\n\nBut the numbers of those people could be as high as the numbers that are coming in legally now? You’re not looking to reduce the numbers?\n\nOh yeah, no, no, no, no, we want people coming in legally. No, very strongly. Now they’re going to be much more strongly vetted as you see. You know, we’ve broken the all-time record [of detentions at the border] by many times, 73, we’re up to 73, it’s going to go up to almost 80% at the border, we’ve…you know, really stopped it. We also want farm workers to be able to come in. You know, we’re going to have work visas for the farm workers. If you look, you know we have a lot of people coming through the border, they’re great people and they work on the farms and then they go back home. We like those people a lot and we want them to continue to come in.\n\nAnother part of your overall plan, the tax reform plan. Is it OK if that tax plan increases the deficit? Ronald Reagan’s tax reform didn’t.\n\nWell, it actually did. But, but it’s called priming the pump. You know, if you don’t do that, you’re never going to bring your taxes down. Now, if we get the health-care [bill through Congress], this is why, you know a lot of people said, “Why isn’t he going with taxes first, that’s his wheelhouse?” Well, hey look, I convinced many people over the last two weeks, believe me, many Congressmen, to go with it. And they’re great people, but one of the great things about getting health care is that we will be saving, I mean anywhere from $400bn to $900bn.\n\nMr Mnuchin: Correct.\n\nPresident Trump: That all goes into tax reduction. Tremendous savings.\n\nBut beyond that it’s OK if the tax plan increases the deficit?\n\nIt is OK, because it won’t increase it for long. You may have two years where you’ll…you understand the expression “prime the pump”?\n\nYes.\n\nWe have to prime the pump.\n\nIt’s very Keynesian.\n\nWe’re the highest-taxed nation in the world. Have you heard that expression before, for this particular type of an event?\n\nPriming the pump?\n\nYeah, have you heard it?\n\nYes.\n\nHave you heard that expression used before? Because I haven’t heard it. I mean, I just…I came up with it a couple of days ago and I thought it was good. It’s what you have to do.\n\nIt’s…\n\nYeah, what you have to do is you have to put something in before you can get something out.\n\nMr Mnuchin: And as we talked about, economic growth under the Trump administration could increase revenues as much as $2trn over the ten-year period of time. So priming the pump in the short term leads to growth.\n\nSo you would have a bigger deficit, a stimulus, to prime the pump that would lead to faster growth?\n\nSo I happen to think that 3% is low. But you can’t do it if your companies are leaving the country because taxes are too high. Now, I’m going to do something there too. If our companies leave the country, number one they’re leaving for numerous reasons but one of the big reasons is the taxes are so high. When they leave—go back to trade for a second, when they leave the country, go to a certain country wherever it may be, and they fire all their workers in the United States and on the assumption they build cars or air conditioners or whatever they’re building, and they open a plant someplace else and then they send the air conditioner or the car into our country with no tax, that’s not going to happen anymore. They’re going to have a very large tax to pay, in the vicinity of 35%.\n\nNow when you do that, number one they're not leaving the country anyway. So we’re not leaving. I don’t know if you saw what’s happening. Ford has announced massive expansions in the United States. General Motors cancelled a big plant in Mexico and a big plant in Europe. They’re all cancelling plans because I told them, I said…I get along with them great. But I said, “Look, we don’t mind if you leave the country. You can build all you want out of country, I hope you enjoy your plant. But when you build your car, you’re going to have a 35% tax when you bring it back in. And if your numbers work, we wish you well. But that’s what you’re going to have. You’re going to have a 35% tax.”\n\nSo I mean, I have, it has, I haven’t been given massive credit for it yet, but I have been given some because I just see polls out in Michigan and different places, that really are affected by this, have been unbelievable, you know, much bigger than election day. But that’s not a tax increase, that’s no tax. In other words, all you have to do is don’t leave and you won’t have a…but we’re bringing our taxes down so low that you won’t even need the barrier because the taxes are so low, that people are going to stay.\n\nThe other thing, just in case we…I believe it could be anywhere from $4trn to $5trn outside, you know don’t forget we’ve been talking about $2.5trn for four years now. I’ve been using $2.5trn, the same number we’ve all been using for years. Well, you know, it grows. I think it…I wouldn’t be surprised if it was $5trn but, you know, we’re close. We’re letting that money come back in. And that has two barriers which you have to watch. It’s got a barrier of the tax, which we will take care of. We’re going to make it 10%. Now it’s 35%...\n\nSorry, 10%? The repatriation taxes?\n\nThe repatriation. Inversion. The corporate inversions, which is a disaster, with the companies leaving. But they want to bring back their money. Number one, the tax is too high but the other thing that’s too high is the bureaucracy.\n\nMr Mnuchin: Correct.\n\nPresident Trump: I have a friend who said even if you wanted to bring it back in you can’t because you have to go through so many papers, so many documents, so many…\n\nMr Mnuchin: We’re going to make it simple\n\nPresident Trump: You have to do…Steve, they told me you’ve got to sign books and books of stuff, you pay millions of dollars in legal fees and they almost don’t allow you to bring it back in.\n\nCan I ask you a question about the politics of tax?\n\nIt should be like one page.\n\nThe politics of this? Do you need to get Democratic support to get this tax plan passed?\n\nUm. Little bit.\n\nAnd to get Democratic support, they prefer…\n\nDepending. It depends on which plan, you know, which concept we’ve got to…but it could be. But I think the Democrats are going to like it. We may align it with infrastructure, which they like. They like it as much as the Republicans like it. We need infrastructure in our country. This country has wasted $6trn in the Middle East. Wasted. Like taking it and throwing it right out that window. Right in to the Rose Garden. See that beautiful Rose Garden? Look at those very nicely dressed people. It’s religious liberty out there. [NB. Immediately after this interview, President Trump was due to sign an executive order promoting religious liberty.]\n\nMr President, can I just try you on a deal-making question? If you do need Democratic support for your tax plan, your ideal tax plan, and the price of that the Democrats say is for you to release your tax returns, would you do that?\n\nI don’t know. That’s a very interesting question. I doubt it. I doubt it. Because they’re not going to…nobody cares about my tax return except for the reporters. Oh, at some point I’ll release them. Maybe I’ll release them after I’m finished because I’m very proud of them actually. I did a good job.\n\nHope Hicks [White House director of strategic communication]: Once the audit is over.\n\nPresident Trump: I might release them after I’m out of office.\n\nMr Mnuchin: Just so you know, I’ve already started meeting with Democratic senators and, you know, the support has been pretty interesting. I mean, I think a lot of the Democratic senators actually believe we’re on to the right tax plan to bring back business to America, and that’s what they’re all about, they want to grow jobs in their states, just like the president does.\n\nMs Hicks: And our plan has things like child-care tax credits which have never been presented before…\n\n\n\nPresident Trump: By the way, so as you know I’m under routine audit, so they’re not going to be done. But you know, at a certain point, that’s something I will consider. But I would never consider it as part of a deal.\n\nRight, got that.\n\nI would never do it. That would be…I think that would be unfair to the deal. It would be disrespectful of the importance of this deal. Because the only people that find that important are the reporters.\n\nWell, the Democrats say it’s important.\n\nWell, don't forget I got elected without it. Somebody said, “Oh but you have to do it,” I said, “Look where I am”. I was, you know, I was out front, I was asked that question, every debate, I said, you know, I’m under routine audit.\n\nMr Mnuchin: And the president’s financial disclosure has been longer than any…\n\n\n\nPresident Trump: Plus my financial disclosure is 104 pages.\n\nMs Hicks: I think when people say that that makes it about the president and the politics versus the people, which is what we’re focused on.\n\nPresident Trump: Right.\n\nCan I ask you about the focus of the tax cut because you’ve spoken about a massive tax cut for ordinary workers…\n\nRight, this would be the biggest tax cut in the history of the country.\n\nBut the biggest winners from this tax cut, right now, look as though they will be the very wealthiest Americans.\n\nWell, I don’t believe that. Because they’re losing all of their deductions, I can tell you.\n\nBut something like eliminating the estate tax.\n\nI get more deductions, I mean I can tell you this, I get more deductions, they have deductions for birds flying across America, they have deductions for everything. There are more deductions…now you’re going to get an interest deduction, and a charitable deduction. But we’re not going to have all this nonsense that they have right now that complicates things and makes it…you know when we put out that one page, I said, we should really put out a, you know, a big thing, and then I looked at the one page, honestly it’s pretty well covered. Hard to believe.\n\nWill you keep interest deduction in the corporate tax? Will corporate interest payments…\n\nDo you want to answer?\n\nMr Mnuchin: We’re contemplating it. We’re contemplating it.\n\nContemplating getting rid of it?\n\nMr Mnuchin: No, we’re contemplating keeping it. That’s our preference. But we’ll look at everything.\n\nSo what would your preference be Mr President? You know about that very well.\n\nNo, I would say probably…I think we’re contemplating is the word. And it hasn’t been determined yet, but we’re contemplating.\n\nContemplating…\n\nWe’re contemplating various…I have to say, we’re contemplating various things, but one of the things that’s very important is simplicity. We want to keep it as simple as possible. Because even if you do, it’s complicated. I mean even if you keep it simple with taxes it gets complicated.\n\nAnd are you contemplating things outside of corporate income tax? For example a VAT, which many countries have?\n\nWell, you know, a lot of people consider the border tax a form of VAT.\n\nAre you still…\n\nPart of the problem with NAFTA is that Mexico’s a VAT. So Mexico is paying almost…we pay 17%. So we are now down 17%, going into Mexico when we trade. So that’s like, you have a football team and every time they play a game, they’re down, you know, 25 points. How can you possibly do good?\n\nBut would you consider…\n\nYou could actually make the case, that the 17 is doubled. You can make that case. You know, it’s 17 and it’s really 17 and it’s a double.\n\nMr Mnuchin: Right\n\nWould you consider a VAT for the United States?\n\nWell the concept of VAT I really like. But let me give you the bad news. I don’t think it can be sold in this country because we’re used to an income tax, we’re used to a…people are used to this tax, whether they like it or don't like, they’re used to this tax. I fully understand because I have a lot of property in the UK. And it’s, sort of, not a bad tax. And every time I pay it, they end up sending it back to me. In fact, my accountant is always saying…\n\nThat’s a good tax.\n\nNo, it’s really not so bad. Like, I own Turnberry in Scotland. And every time I pay they say, “Yes sir, you pay it now but you get it back next year.” I said, “What kind of tax is this, I like this tax.” But the VAT is…I like it, I like it a lot, in a lot of ways. I don’t mean because of, you know, getting it back, you don’t get all of it back, but you get a lot of it back. But I like a VAT. I don’t think it can be sold in this country, I think it’s too much of a shock to this system. I can tell you if we had a VAT it would make dealing with Mexico very much easier. Because it could neutralise. And I really mean that. Part of the problem with NAFTA, the day they signed it, it was a defective deal. Because Mexico has almost a 17% VAT tax and it’s very much of a hidden tax, people don’t see it. So, but these guys, instead of renegotiating the following week…many years ago, how old is that? 35?\n\nMr Mnuchin: 35 years ago.\n\nPresident Trump: But instead of negotiating, we suffered with this for, you know, for decades.\n\nBut as you said Mr President, a border-adjustment tax has some similarities to that. Are you still considering a border-adjustment tax?\n\nWe are dealing with Congress…because it’s not really what I’m considering. I mean look, on health care, I think we have a great bill and there’s still a little bit further to go because we’re also dealing with the Senate, but the Senate I believe really wants to get something done because Obamacare is dead, just so we understand. Obamacare is absolutely dead. The insurance companies are leaving. Yesterday Aetna just announced they’re pulling out. You have states that aren’t going to have any insurance companies. You know when people say, “Oh, Obamacare is so wonderful,” there is no Obamacare, it’s dead. Plus we’re subsidising it and we don’t have to subsidise it. You know if I ever stop wanting to pay the subsidies, which I will.\n\nYou’d pull the plug on that? If this bill doesn’t go through you’d stop those subsidies?\n\nNo, this bill only gives them one month. They don’t realize that, that’s another thing. Good point. This bill gives them one month, it gave, you know the subsidy…\n\nThe continuation of the subsidy?\n\nThe subsidy to the insurance companies, yes. Anytime I want because actually…\n\nBut my question is if the bill doesn’t pass…\n\nIn actuality Congress has to approve it. Congress…\n\nIf the bill doesn’t pass would you cut the subsidies?\n\nIf the bill doesn’t pass, I’d be in a different position. Because, if the bill didn’t pass the Republicans would have let me down. And then I’d have to decide what I want to do because I want people to have health care. Our health care is much better than Obamacare. It’s going to be much less expensive. We’re going to have competition, we’re getting rid of the state lines, etc etc. The premiums are going to be low, the deductibles are going to be low. If it didn’t pass…it’s a great question, I don’t want to think about that but the answer is…I would do something to make sure the people have health care, as bad as Obamacare is.\n\nOne of the things that was so different about your campaign message compared to other Republicans was, you said things like “I want everyone to be covered”.\n\nWe’re not going to let people die on the streets.\n\nBut some people will look at this bill and say, hang on, a lot of people are going to lose their coverage.\n\nOK. So we have a pool for people that are having difficulty. We have got a pool. It’s a high-risk pool. And this pool we just funded yesterday, we’re putting in $8bn, into the pool. So depending on what states do…because I would like to see states taking over health care, I think they could do a better job than the federal government. Now in some cases that’ll be great, like in Florida that works fantastically with Rick Scott, and a couple of others. And in some states it isn’t, where they’re not equipped to do it. But ultimately, you know I use the expression, “If you have a bad knee, I would rather have the federal government focus on North Korea than fixing your knee.”\n\nThe state governments are in much better position to, you know, help people. In terms of, you know, just the size, the mere size of it. But we’re putting in $8bn and you’re going to have absolute coverage. You’re going to have absolute guaranteed coverage. You’re going to have it if you’re a person going in…don’t forget, this was not supposed to be the way insurance works. Insurance is, you’re 20 years old, you just graduated from college, and you start paying $15 a month for the rest of your life and by the time you’re 70, and you really need it, you’re still paying the same amount and that’s really insurance.\n\nBut I believe it’s very important to have this. Because one thing Obamacare did, is it gave that and it was a concept that people hadn’t heard of. And now I don't want to end it. I don’t want to end it for somebody that…first of all I don’t want to end it for the people that already have it. And I don’t want to end it for somebody that hasn’t been buying insurance for all of his life where he has a guarantee that for all of his life he’s been buying the insurance and he can buy it inexpensively when he turns 65 or 70 years old. So we put in a tremendous amount and we’re…you know, for the pre-existing conditions. We are going to have a great pool for pre-existing conditions.\n\nNow, that will even get better as it’s going along, it’s going to get better. But in a way you could say, that’s not really insurance, but it's there. And I want to make it as…I want to make it actually better than what they have in Obama[care]. Now, Obama[care] has something that’s very, very bad. Where you have to pay a penalty. And people don't realise, how many people are forced to pay a penalty and they don’t get any benefit out of it. We don’t have that. We’re going to have much lower premiums and we’re going to have much lower deductibles.\n\nBut when you used to say the hard right of the Republicans can’t be trusted to look after people…\n\nThey came through.\n\nThey came through? So do you still have to keep them in line.\n\nI’ll be honest with you…Did anybody ever hear of a guy named Mike Pence? Vice-president of the United States?\n\nMike Pence, the vice-president, enters the room: Morning all.\n\nPresident Trump: Central casting.\n\nMr Pence: Please sit, sit, sit.\n\nMs Hicks: We got about two more minutes. So just one more question.\n\nPresident Trump: So I know exactly the speeches you’re talking about. I said, “I’m not going to allow people to die on the streets”, and I said it over and over and I meant it more than anything and I probably mean it more now than even when I made the speech. We’re talking about the high-risk pools, Mike, and we just added $8bn to the high-risk pools.\n\nMr Pence: Yes, sir.\n\nPresident Trump: People are going to have…they’re going to have great insurance. Now, we have one more step to go. You know we have to go through the Senate and we’re refining it even further. But I will tell you, Mike, I just spoke to a few of the senators and they have some great ideas also and they want to get it there.\n\nSo, the problem with Obamacare? He rushed it through, he wanted…although, when I say rushed it through, at the end. They were giving up everything, they were taking out everything. It wasn’t a pure form of what they wanted anyway. They did the Nebraska trade where basically it was, you know, the whole thing was given away.\n\nLook, Obamacare was a disaster. Under Obamacare, you get your doctor; that was a lie. You get your plan; that was a lie. With us, you get your doctor. You get your plan. With us you’ll get hundreds and hundreds of plans. You know, one of the insurance companies, one of the big ones came to see me yesterday. They’re so anxious to start going crazy and you know it’s going to be like life insurance. People that buy life insurance they’re inundated with carriers. All different plans. That’s what this is going to be like. And I said to them, “What do you think the good plans are going to look like?” He said, “Mr President, we’re going to have so many plans. We’re going to have the low version, the high version”, he used the word Cadillac. I won’t tell you what car he used for the low version because I don’t want you to write it because they happen to be friends of mine, you know, the head people. [Goes off the record.]\n\nMr President, in business you keep score of your profits. How do you keep score in Trumponomics and in politics?\n\nWell I think the score is going to be the end of the game. To me the score is going to have to be at the end of the game. I was saying, Mike, that we’re going to prime the pump with the taxes because we’re going to take in perhaps a little bit less, but we’re going to have a lot more business, we’re going to have companies coming back into the country.\n\nI know a lot of companies that want to come back in but they’re not going to come back in because of taxes. And we have a lot of companies that will come back into the country. They were forced out of the country because the taxes were too high. Many, many. You look at what’s going on in certain countries. In fact I own a lot of property in certain countries where they were forced out.\n\nYou look at Ireland. I own great property in Ireland that I bought during their downturn. And I give the Irish a lot, a lot of credit. They never raised their taxes. You know you would have thought when they were going through that really…they would’ve double and tripled their taxes. They never raised it a penny. And they got through it and they are thriving now. Ireland’s done an amazing job. A lot of companies have moved to Ireland and they like it.\n\nBut we’re going to be getting a lot of companies moving back and we’re going to get very few companies leaving the United States because we went from the highest tax rate of…not only major, you know they always say major countries, just about the highest tax rate period. And then when you add all the other things. And then when you add the regulations to the tax…I’ve had people tell me, because I’ve cut massive regulations and we’ve just started, believe me. But we’ve cut regulations massively.\n\nI’ve had people tell me that the cutting of those regulations is more important to them than bringing it down from 35% to 15%. And if you would have told me that, if I had a guess one before I knew the answer, I would’ve said, nobody would’ve taken the regulations. 90% of the people would rather have the regulations cut. So when you talk about the tax cut, the regulation cut, Dodd-Frank, you’ll be doing a story on that fairly soon because we’re doing a very massive overhaul on Dodd-Frank. We’re doing things that are going to keep people real happy.\n\nAnd then ultimately, when I leave office, on the assumption [Mike Pence] doesn’t follow me, but he will. But when I leave office what happens is slowly they’ll nip away at it, nip away, nip away and then in 40, 50 years somebody else will come along and bring it back. But we’re bringing back entrepreneurship. We’re bringing back enthusiasm. And if you look at the people that read your magazine, that are in this country, the enthusiasm levels, and you know this because you see it, are the highest they've even been. The enthusiasm levels for manufacturers went up 27 points in two months. If it goes up a quarter of point it’s like a massive…it went up 27% in two months, up to 93%, they’ve never been even close. The enthusiasm for business is the highest it’s ever been.\n\nMs Hicks: And we’ll have you guys back to talk about it. Sorry\n\nThank you so much, Mr President.\n\nI hope you had enough time.\n\nYou’ve been very kind.", "images": ["http://www.economist.com/static/illustration/newsletter-signup.svg", "https://www.economist.com/sites/default/files/images/print-edition/20200418_USP003_0.jpg", "https://www.economist.com/sites/default/files/images/2017/05/articles/main/20170513_blp520.jpg", "https://www.economist.com/sites/default/files/20200418_USP501.jpg", "https://www.economist.com/sites/default/files/images/print-edition/20200418_USP002_0.jpg"], "top_img": "https://www.economist.com/sites/default/files/images/2017/05/articles/main/20170513_blp520.jpg", "keywords": [], "authors": ["The Economist"], "canonical_link": "https://www.economist.com/united-states/2017/05/11/transcript-interview-with-donald-trump", "title": "Q&A - Transcript: Interview with Donald Trump", "meta_data": {"viewport": "width=device-width", "theme-color": "#E3120B", "msapplication-TileColor": "#E3120B", "msapplication-TileImage": "/static/ico/tile-144.png", "application-name": "The Economist", "msapplication-tooltip": "The Economist", "description": "The Economist talks to the President of the United States about economic policy", "og": {"site_name": "The Economist", "title": "Transcript: Interview with Donald Trump", "type": "Article", "url": "https://www.economist.com/united-states/2017/05/11/transcript-interview-with-donald-trump", "description": "The Economist talks to the President of the United States about economic policy", "image": "https://www.economist.com/sites/default/files/images/2017/05/articles/main/20170513_blp520.jpg"}, "twitter": {"site": "@TheEconomist", "description": "The Economist talks to the President of the United States about economic policy", "card": "summary_large_image", "image": "https://www.economist.com/sites/default/files/images/2017/05/articles/main/20170513_blp520.jpg"}, "fb": {"app_id": 193926687345108, "pages": "6013004059,1487031108050752"}, "next-head-count": 21}, "movies": [], "publish_date": null, "source": "http://www.economist.com", "summary": ""}