{"url": "https://www.townandcountrymag.com/leisure/arts-and-culture/a18729402/ashley-judd-interview-salma-hayek-april-2018/", "text": "Ashley Judd has never been one for anonymity. She grew up the daughter and sister of country music superstars, and found her own fame first as an actress, earning Golden Globe and Emmy nominations for her roles in projects like Ruby in Paradise, De-Lovely, and Missing, and later as an activist focused on human rights both in her home state of Tennessee and around the world.\n\nIn 2017 she made headlines speaking out against sexual harassment and assault in the entertainment industry—she was one of the first women to publicly make accusations against the now disgraced movie producer Harvey Weinstein—and she has been a leading voice in the battle for gender equality in Hollywood and beyond.\n\nHere, Judd talks candidly with her longtime friend Salma Hayek (who herself spoke out against Weinstein in a New York Times op-ed) in Hayek’s home—where Judd frequently shacks up when she’s in L.A.—about finding her courage and raising her voice, and about what the future holds both for herself and the movement with which she is inextricably linked.\n\nGIAMBATTISTA VALLI DRESS ($5,300); GIUSEPPE ZANOTTI SHOES ($695); MARTIN KATZ EARRINGS ($22,500) AND RING (PRICE ON REQUEST); FRETTE SHEET SET ($1,195). ROCHE BOBOIS COURCHEVEL HEADBOARD Victor Demarchelier\n\nSALMA HAYEK: Do you remember how we met?\n\nASHLEY JUDD: We were at an event, and somebody literally took my hand and took your hand...and brought us together. You asked me, “Where are you staying? You have to stay with me!” And here I am, 20 years later.\n\nSH: Maybe I met you in another life. I felt differently about you from the beginning.\n\nAJ: We’ve been really consistent, and we’ve shared facets of our art and our lifestyles, but there’s always been something about our relationship that was enduring. It wasn’t tied to a specific job or event; it’s been a life friendship. We traveled together on humanitarian trips to do work in brothels and other sites where sex trafficking takes place. You know, you are the only person of my friends and family who has ever come with me.\n\nSalma Hayek and Ashley Judd wear black in solidarity with Times Up at the 2018 Golden Globes. Getty Images\n\nSH: I’ve experienced danger with you! I remember we were trying to lobby the president of a Latin American country, and I’m moving around in a diplomatic way, but you just [claps hands] go for his throat! You didn’t care if he was the president—you let him have it!\n\nAJ: I’ve always been a fighter. I’ve always been very devoted to the cause, whatever that cause may be. I think I was born with a healthy sense of righteous indignation, but I’m definitely a product of my environment and my childhood. I’ve acquired a lot of resilience.\n\nSH: In my observation you have always stayed a little bit of an outsider in Hollywood. And that an outsider has come into the industry and somehow inspired this coming together—I find that interesting.\n\n\n\nAJ: I have bifurcated my life by choosing to live in Tennessee, so in many ways I’ve been isolated from the community in Hollywood. I have a very sweet, stable, and what one might call normal life there. I meditate, read, work, watch Kentucky basketball, and spend time with my friends and with my folks. I host a picnic every Sunday for my biological and my chosen families; I host a lot of dance parties. I get over to Great Smoky Mountains National Park as often as I can; I was there camping alone when the New York Times article came out [last October]. I didn’t know to what kind of world I would be returning. I was maybe going to be ostracized for it, but I was at peace with that.\n\n\n\nSH: You came to me about telling my Harvey story when the New York Times article was first being reported—and I chickened out.\n\nMy dad was with me that day, and he could tell by the look on my face, to use his words, that something devastating had happened.\n\nAJ: I didn’t feel afraid. But remember, I’ve told this story from literally the moment I left that hotel room with Harvey. My dad was with me that day, and he could tell by the look on my face, to use his words, that something devastating had happened, and I told him. And both the producer and director of Kiss the Girls said recently that when I went to the set that night, I told them what had happened. I’ve been telling this story—but the seismic shift is that now everyone is willing to hear it. The tweak was naming Harvey, and I felt comfortable doing that.\n\nVALENTINO GOWN ($3,690); GIANVITO ROSSI SHOES ($675); MARTIN KATZ EARRINGS ($15,000) AND RING ($90,000). ROCHE BOBOIS FURTIF TABLE, COLETTE BRIDGE CHAIR, AND QUADRO LAMP. Victor Demarchelier\n\nSH: It was a longer process for me because I had never dealt with it. It took me a couple of months in my head, because I had never told anyone. Just thinking about it weakened me emotionally. And if it affected me in such a way just to think about it, why would I say it out loud? The hard part was to tell my husband, because I had said, “Oh, Harvey was a bully,” but I had never told him all of it. Penélope [Cruz] was really angry at me, because I didn’t tell her what was going on while it was happening. But, you know, I didn’t realize Harvey was doing it to other people, too, so I thought, Why dump your stuff on someone and take away from their professional relationship with him? At that time Harvey was doing the best movies. You told me that I could tell my story to the Times without giving my name. But I was going back and forth in my mind, yes and no. I felt so many things.\n\nAJ: I think that ultimately the timing of the article you wrote about your experience and the way you wrote it were perfect and poetic, the way it was meant to be. It reignited the movement.\n\nSH: The only reason I was able to finally do it was your loving hand. If it weren’t for you, this story wouldn’t have come out. But also, if it weren’t for you, Frida itself would have never been made. [Editor’s note: According to Hayek’s op-ed, Weinstein threatened to pull funding for Frida unless she could get top talent to play smaller roles. Judd, among others, came to the rescue.]\n\nYou were filming a movie, and let’s not forget that at that time you were one of the biggest stars in the world, one of the highest-paid actresses. And I was no one. I called and said, “Ashley, do you have a minute?” And you said, “They’re about to call me to set any minute—but, of course, what do you need?” I was so embarrassed. I don’t like to ask anyone for anything. “Remember my movie, Frida? Well, I want to ask you a favor.” “Oh, they’ve come to get me! The answer is yes. You can count on me.” “But I was wondering if you could do one part? And there is no money! I have to send you the script. Maybe you will think it’s too small?” \"I have to go. Just tell me where and when and I’m there, 100 percent, whatever you need.”\n\nAnd you just hung up. I started crying, and Edward [Norton] walks in and goes, “What is wrong with you?” I said to him that I just could not imagine the sensation one can have as a receiver of this amount of loving generosity and support from someone. You don’t understand how overwhelming this beautiful sensation of gratitude can be. I was crying from happiness.\n\nVictor Demarchelier\n\nAJ: Well, first of all, you have to understand what a gift it is to me to have someone in my life about whom I feel this way. Like, reciprocally, what a gift it is to get a phone call and to know without hesitation that whatever it is the answer is yes. It’s a two-way street. But really I emphasize what a joy it is for me to know that.\n\nIt’s like the end of Marvin’s Room, when Diane Keaton’s character is dying of cancer and Meryl Streep’s character says to her, “They love you so much,” and she says, “I’ve been so lucky to have been able to love someone so much.” She sort of flips it. That touched me very deeply, because that’s the way I feel. I feel so blessed that I have all this love to give and friendships and people and children all over the world and movements to which I can give it. That really fills me up.\n\nSH: Have you noticed a change in the way women now interact with each other in Hollywood, with a greater sense of loyalty and unity? I think that has changed.\n\nAJ: Now that I’m more connected to this community again, I feel a shift and a sense of real discovery about female alliances. My favorite conversation recently was with Joan Collins—what a gentle and lovely person!—who immediately started telling me about the sexual harassment she experienced when she was 17 years old on her first set. And I feel really loved and appreciated right now. In these Time’s Up meetings, when I speak I notice that everyone really pays very close attention to what I say, so that’s a really sweet experience for me to have, like I have earned my stripes.\n\n[Work would be] the greatest amends that Hollywood can make to me for having maliciously blacklisted me for something that was patently false and promulgated by a sexual predator and alleged rapist.\n\nI also hope to have more opportunities now; it would feel exceedingly nice at this particular juncture to be offered more work. I’m going to be doing a show on Broadway this fall. I was offered a romantic comedy. And that is the greatest amends that Hollywood can make to me for having maliciously blacklisted me for something that was patently false and promulgated by a sexual predator and alleged rapist. [Editor’s note: Weinstein reportedly spread rumors throughout Hollywood that Judd was impossible to work with as a result of her rebuffing his advances.]\n\nAnd I’ve had people text me and say, “I knew you personally, and I knew that you weren’t difficult, but I couldn’t figure out why it was something that I heard about you.” And now we know.\n\nSH: Do you think such terrible behavior ever warrants forgiveness?\n\nAJ: Well, forgiveness is no favor. I do it for myself, and so I’ve already forgiven—it’s the easier way to live. I have to forgive myself for being young and vulnerable, for being in the room. A woman came up to me the other day in Franklin, Tennessee, at Whole Foods, and said, “You know, once, you were walking out of Harvey’s room and I was walking in.”\n\nSH: I mean, he gets around!\n\nAJ: Somebody was telling me last night that when they were filming the sequel to Crouching Tiger, Hidden Dragon, Harvey was all over them about the budget, and yet he was flying someone whom he was harassing on a private plane to do a nonspeaking part. So, anyway, that’s kind of going onto the laundry list of bad behavior.\n\nForgiveness is no favor. I do it for myself—I have to forgive myself for being young and vulnerable, for being in the room.\n\nBut forgiveness, first of all, implies that I’ve judged someone, and that’s not a really healthy and appropriate place for me to be. I can certainly evaluate, but I guess the distinction I’m making is that condemnation is really not an energy that I want to keep inside of myself. Forgiveness just cuts those things—I can prosecute and forgive at the same time.\n\nPart of why the movement has such guts and teeth is that we’re writing codes of conduct that will be across our industry, across all the unions and agencies: Meetings happen between 9 a.m. and 6 p.m., they happen in an office, they happen with at least one other person present. No more of this meeting in hotel rooms, no more meeting at homes—it’s over.\n\nAnd my experiences talking about this with men, too, have been overwhelmingly positive. I think that there’s a curiosity, a natural tentativeness that’s understandable. And openheartedness, a desire to learn—definitely some fear and some shame. We’re all doing the best we can, and the best I can do is to remind myself that I live with entitlement and privilege, because I can’t always see it.\n\nAnd so being able to talk with men about that helps us realize that we’re working within a similar paradigm and that we’re probably more alike than we are different. I think this is as good for boys and men as it is for girls and women. I really do.\n\nGIVENCHY DRESS ($6,990); MARTIN KATZ EARRINGS ($68,000); OLAY CLEANSING INFUSION HYDRATING GLOW FACIAL CLEANSER ($7). Victor Demarchelier\n\nSH: This is our time to represent womanhood in a way it’s never been represented before. So let’s not use all of this as a tool for revenge, for hate, or for attention to ourselves. I think you and I are very similar in our approach, and we have been doing this kind of work for a long time and know there are certain codes of conduct. It has to be about humility.\n\nAJ: It’s refreshing to see other people in our community doing so much of the heavy lifting. I look at Brie Larson, whom I’ve met at Time’s Up meetings. She is a wildly intelligent and really motivated firecracker, and I’m like [stretches her arms, puts her feet up], Hey, you can carry that torch.\n\nSH: It is such an exciting time. It’s like an awakening. It’s a privilege to be able as a woman to live through it.\n\nAJ: I’m really soaring. I feel good. Everyone is a changemaker in her own life.\n\nPhotographs by Victor Demarchelier, Styled by Nicoletta Santoro\n\nHair by Didier Malige. Makeup by Moyra Mulholland using Jane Iredale cosmetics. Manicure by Gina Viviano using Chanel Le Vernis. Tailoring by Yasmina Oezelli for Lars Nord. Floral design by Justin Giunta. Produced by Vivian Song at krankyproduktions.com.\n\nThis interview appears in the April 2018 issue of Town & Country. Subscribe Today", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/ashley-judd-salma-hayek-1519840081.jpg?crop=1.00xw:0.335xh;0,0.0174xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/ashley-judd-salma-hayek-1519840081.jpg?crop=1.00xw:0.335xh;0,0.0174xh&resize=1200:*", "keywords": [], "authors": ["Salma Hayek"], "canonical_link": "https://www.townandcountrymag.com/leisure/arts-and-culture/a18729402/ashley-judd-interview-salma-hayek-april-2018/", "title": "Ashley Judd Is Reclaiming Her Time", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#BE3E19", "og": {"type": "article", "site_name": "Town & Country", "title": "Ashley Judd Is Reclaiming Her Time", "description": "The actress, activist, and Weinstein whistleblower opens up to Salma Hayek about friendship, fear, and a path to forgiveness.", "url": "https://www.townandcountrymag.com/leisure/arts-and-culture/a18729402/ashley-judd-interview-salma-hayek-april-2018/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/ashley-judd-salma-hayek-1519840081.jpg?crop=1.00xw:0.335xh;0,0.0174xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 526594570689062, "pages": 344794953432}, "article": {"publisher": "https://www.facebook.com/TownandCountryMagazine", "modified_time": "2018-05-07 06:18:30", "published_time": "2018-03-01 12:55:00", "section": "Arts & Culture", "opinion": "false"}, "twitter": {"site": "@TandCmag", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/ashley-judd-salma-hayek-1519840081.jpg?crop=1.00xw:0.335xh;0,0.0174xh&resize=640:*"}, "google-site-verification": "musQPiBADe3f4WpT4JNcg9uUChC3qnOhhPLSR4n1urM", "title": "Ashley Judd Interviewed By Salma Hayek About Harvey Weinstein, Me Too, Sexual Harassment and the Times Up Movement", "description": "Ashley Judd talks candidly with her longtime friend Salma Hayek (who herself spoke out against Weinstein in a New York Times op-ed) in Hayek’s home about finding her courage and raising her voice, and about what the future holds both for herself and the movement with which she has become inextricably linked.", "keywords": "ashley judd, salma hayek, time's up, #metoo, salma hayek new york times, ashley judd 2018, ashley judd now, ashley judd news, ashley judd films, judd actress, ashley judd harvey weinstein, salma hayek harvey weinstein, salma hayek 2018, salma hayek news, salma hayek frida, harvey weinstein frida", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/ashley-judd-salma-hayek-1519840081.jpg?crop=1.00xw:0.668xh;0,0&resize=320:*", "sailthru.contenttype": "long-form-article", "sailthru.tags": "Leisure,leisure,arts-and-culture", "sailthru.date": "2018-03-01T12:55:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/ashley-judd-salma-hayek-1519840081.jpg?crop=1.00xw:0.335xh;0,0.0174xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/ashley-judd-salma-hayek-1519840081.jpg?crop=1.00xw:0.668xh;0,0", "sailthru.socialtitle": "Ashley Judd Is Reclaiming Her Time", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1519880100.0, "source": "https://www.townandcountrymag.com", "summary": ""}