{"url": "https://www.digitalspy.com/showbiz/a842751/taylor-swift-new-album-reputation-reviews-fan-reactions/", "text": "Taylor Swift is officially out of her self-imposed media exile and her latest album Reputation is out along with her, so what does everybody think?\n\nWell, very good things, as it turns out.\n\nYep, the old Taylor might be dead, but her star power and her ever-reliable ability to churn out hit after hit certainly isn't – and that's something both fans and critics seem to agree on.\n\nRelated: Ed Sheeran joins Taylor Swift for this year's Capital Jingle Bell Ball\n\nAlthough a departure from her older work, the general consensus is, sure, Reputation might be different, but in an entirely good way.\n\nDespite leaking a day ahead of its release online, fans are still going wild over Reputation's long-awaited drop, and have even called it a sure-fire winner of Grammy's next Album of the Year.\n\nIn an era where pop is dying, Taylor is thriving. She is one of the last big pop girls out there doing it (Gaga & Beyoncé too). It's crucial we all must support them. Pop girls are going extinct, the charts are indicative of a new wave of music & male dominance. #reputation — Joshua 🤮 (@jaehyunswift) November 10, 2017\n\n#reputation will win AOTY at the Grammys, won’t it? ‘Cause, what can be better than this? Who’s gonna drop a better album than this one in 2018? I DON’T SEE ANYONE DOING IT. — vicky (@IKTayWT) November 10, 2017\n\nI've listened to the album 4 times through so far and I regret nothing #reputation — Anna (@lovinghmwasred) November 10, 2017\n\nGod I want to be in a club that’s playing #reputation exclusively. Nothing else. Just Reputation. @taylorswift13 what have you done to me 😂😂🎉🥂 — Whitney (@whitneylou13) November 10, 2017\n\nNow that's all well and good, but what do the all-important critics think?\n\nHere's a brief round-up of Reputation's (glowing) reviews so far. We think it's fair to say that Tay has done good, don't you?\n\nThe Independent\n\n\"One of Swift's greatest talents as a songwriter is to encapsulate those small moments, often in a new relationship, that you as a listener cannot.\n\n\"Each of the 15 songs on Reputation tackles how she is perceived by the people who know her and the people who don't. She acknowledges that even those closest to her will have differing ideas. A lover, a friend, a parent who has to see another Taylor Swift takedown online.\"\n\nRolling Stone\n\n\"From the sounds of her excellent sixth album, Swift spent that time going into deeper, darker, more introspective places. Reputation is her most intimate album – a song cycle about how it feels when you stop chasing romance and start letting your life happen.\n\n\"As one of the all-time great pop masterminds, she's trying something new, as she always does. But because she's Taylor Swift, she can't stop being her own turbulent, excessive, exhausting and gloriously extra self.\"\n\nThe Guardian\n\n\"At their best, these songs have a fizzing, pugilistic energy that recalls Britney Spears' brilliant, mid-breakdown, screw-you-all 2007 album Blackout (in another reference to Spears, the brilliant chorus of 'Don't Blame Me' features a chord progression that recalls '...Baby, One More Time').\n\n\"At their least appealing, they're still decent pop songs, but they feel generic: they could be by Rihanna or Rita Ora.\"\n\nThe New York Times\n\n\"The bombastic, unexpected, sneakily potent Reputation is many things: It's the first album on which Ms Swift has cursed (\"damn\" doesn't count); it's the first time she has sung about consuming alcohol (and repeatedly at that); and it's the vehicle for her most overt songs about sexual agency.\n\n\"But it is also Ms Swift chasing that good feeling, pushing back against a decade of following her own instincts. And it works.\"\n\nThe Telegraph\n\n\"Reputation is a big, brash, all-guns-blazing blast of weaponised pop that grapples with the vulnerability of the human heart as it is pummelled by 21st century fame... Reputation sees the savvy Swift turn crisis into opportunity. This is an album with blockbuster event status.\"\n\nWant up-to-the-minute entertainment news and features? Just hit 'Like' on our Digital Spy Facebook page and 'Follow' on our @digitalspy Twitter account and you're all set.", "images": ["https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/38/1506041663-taylor.gif?crop=1xw:0.8888888888888888xh;center,top&resize=1200:*", "https://www.digitalspy.com/sites/digitalspy/assets/images/logos/ipso_regulated_hires.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/38/1506041663-taylor.gif?crop=1xw:0.8888888888888888xh;center,top&resize=1200:*", "keywords": [], "authors": ["Rianne Houghton", "Rianne Houghton Is A Freelance News Writer At Digital Spy."], "canonical_link": "https://www.digitalspy.com/showbiz/a842751/taylor-swift-new-album-reputation-reviews-fan-reactions/", "title": "Taylor Swift's new album Reputation is finally out", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#e94114", "og": {"type": "article", "site_name": "Digital Spy", "title": "Taylor Swift's new album Reputation gets RAVE reviews", "description": "Fans love it. Critics love it. Job done.", "url": "http://www.digitalspy.com/showbiz/a842751/taylor-swift-new-album-reputation-reviews-fan-reactions/", "image": {"identifier": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/38/1506041663-taylor.gif?crop=1xw:0.8888888888888888xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 131928163488848}, "article": {"publisher": "https://www.facebook.com/digitalspyuk/", "modified_time": "2018-12-01 02:55:24", "published_time": "2017-11-10 12:32:00", "section": "Showbiz", "opinion": "false"}, "twitter": {"site": "@digitalspy", "card": "summary_large_image", "image": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/38/1506041663-taylor.gif?crop=1xw:0.8888888888888888xh;center,top&resize=640:*"}, "google-site-verification": "yOsKGKJADzRcnlk-FrptJIoYYaNs5pgoJx2J0ie4bWE", "title": "Taylor Swift's new album Reputation is finally out", "description": "Taylor Swift's new album Reputation is finally here, and fans are going crazy for it.", "keywords": "taylor swift reputation album, taylor swift songs, taylor swift new album, reputation review", "thumbnail": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/38/1506041663-taylor.gif?crop=0.5625xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Showbiz,showbiz,Taylor Swift", "sailthru.date": "2017-11-10T12:32:00Z", "sailthru.image.full": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/38/1506041663-taylor.gif?crop=1xw:0.8888888888888888xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/38/1506041663-taylor.gif?crop=0.5625xw:1xh;center,top", "sailthru.socialtitle": "Taylor Swift's new album Reputation gets RAVE reviews", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1510288320.0, "source": "https://www.digitalspy.com", "summary": ""}