{"url": "https://www.vanityfair.com/hollywood/2018/08/harvey-weinstein-another-lawsuit-alleged-rape", "text": "Harvey Weinstein just got hit with another lawsuit. On Monday, German actress Emma Loman filed a suit in Los Angeles against the disgraced producer, alleging that he raped her in 2006 at the Cannes Film Festival. She also claims that he threatened to ruin her career if she dared to come forward with the allegations. Loman is suing for assault, violation of human-trafficking laws, battery, and false imprisonment, according to the Guardian.\n\n“Fearful both that no one would believe her and the potential retaliation from such a powerful figure, Loman stayed silent,” the lawsuit reads, per the Guardian. “It was only upon the late 2017 revelation of the scope of Weinstein’s wrongful actions . . . that Loman felt safe coming forward to seek redress for Weinstein’s rape of her.”\n\nIn the suit, Loman claims she first met Weinstein in 2004 at the Venice Film Festival and that he later invited her to Cannes as his guest. He was relentless, she claims, having his assistant allegedly call her up to 30 times a day, the Guardian reports. After finally agreeing to meet, Loman claims that Weinstein behaved professionally for several meetings. However, that changed when he later allegedly invited her to his hotel suite at Cannes to discuss roles. That’s when he allegedly “overpowered Loman and raped her,” the suit reads.\n\nWeinstein’s lawyer Phyllis Kupferstein sent Vanity Fair the following statement: “This lawsuit is an attempt to continue the legal barrage and public attention on Mr. Weinstein. The allegations are untrue and the claims are barred by the statute of limitations. We intend to immediately move to dismiss the complaint.”\n\nThe producer has previously, through a spokesperson, denied all allegations of nonconsensual acts. He has been accused of sexual misconduct by over 80 women.\n\nThis is far from the first lawsuit to be filed against the ousted mogul, who has been mired in a sexual misconduct scandal since last October. Weinstein is currently out on bail, shuffling back and forth to the Manhattan State Supreme Court to battle various sex-crime charges issued by Manhattan District Attorney Cyrus Vance Jr. Power attorney Gloria Allred has sat in on all the Manhattan hearings, as she is also representing Weinstein accusers. Last November, Allred filed a suit against Weinstein in which an unnamed actress claims that he raped her at the Montage Hotel in Beverly Hills in 2016. Weinstein has also been served three class-action lawsuits in the past year, the most recent of which was also filed against Weinstein’s brother, Bob, and board members of the Weinstein Company, among others. Neither Weinstein brother released a statement in response to the latest suit; neither did the board members.\n\nWeinstein’s also being sued by Ashley Judd, who filed a defamation suit against him in April. Judd was one of the first women to accuse Weinstein of sexual harassment in The New York Times’ initial bombshell report, claiming that he tried to damage her career because she denied his sexual advances. Weinstein’s legal team has denied Judd’s claims, and alleges that the producer was actually trying to advance her career, doing everything in his power to earn her an Academy Award. Judd’s attorney Theodore J. Boutrous responded, calling it an “offensive” suggestion. “We look forward to opposing his flawed motion, moving forward with discovery into his outrageous behavior, and proving to a jury that Mr. Weinstein maliciously damaged Ms. Judd’s career because she resisted his sexual advances.”\n\nWeinstein is also facing a lawsuit from Marco Polo producer Alexandra Canosa, who claims that the disgraced mogul raped her, threatened her, and sexually abused her numerous times over the course of five years. “Harvey Weinstein created an environment in which there was no choice but to do his bidding or suffer dire consequences both physically and to plaintiff’s career,” Canosa’s attorneys write in the suit.\n\nKupferstein, Weinstein’s attorney, denied the allegations, claiming that Canosa and the former Weinstein Company boss had a consensual relationship. “From someone who has been thought of as a good friend, involved only in a consensual relationship, these claims are not only mystifying to Mr. Weinstein, but deeply upsetting, and they are not supported by the facts,” Kupferstein said.\n\nAnd now, Loman’s suit will be added to this pile.", "images": ["https://media.vanityfair.com/photos/5b3a548bacd469252aac1274/1:1/w_350%2Ch_350%2Cc_limit/harvey-weinstein-criminal-sex-act-charge.jpg", "https://www.vanityfair.com/verso/static/hwd/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg", "https://media.vanityfair.com/photos/5b48ed50f66ae968d819b95c/16:9/w_1280,c_limit/harvey-weinstein-new-interview.jpg", "https://media.vanityfair.com/photos/59ea71be59227820827d16a2/1:1/w_350%2Ch_350%2Cc_limit/Asia-Argento-Escape.jpg", "https://www.vanityfair.com/verso/static/hwd/assets/logo-header.7b6624f3aa336c67441a33a3e19289ee14eaf5c7.svg", "https://media.vanityfair.com/photos/5a4d37931f2f4325736cd84d/master/w_1600%2Cc_limit/MAG-0218-Rose-McGowan-SS01-WM.jpg", "https://media.vanityfair.com/photos/5b4ce04bfde90b0b82d2f2df/1:1/w_350%2Ch_350%2Cc_limit/GettyImages-93100522.jpg", "https://media.vanityfair.com/photos/5a4d378f8ae8fd2b3a999eb0/master/w_1600%2Cc_limit/MAG-0218-Rose-McGowan-SS02-WM.jpg", "https://media.vanityfair.com/photos/5b48ed50f66ae968d819b95c/master/w_2560%2Cc_limit/harvey-weinstein-new-interview.jpg", "https://media.vanityfair.com/photos/5a4d3792f504972c1f3e6b13/master/w_1600%2Cc_limit/MAG-0218-Rose-McGowan-SS03-WM.jpg"], "top_img": "https://media.vanityfair.com/photos/5b48ed50f66ae968d819b95c/16:9/w_1280,c_limit/harvey-weinstein-new-interview.jpg", "keywords": [], "authors": ["Yohana Desta", "Yohana Dest", "Julie Mille"], "canonical_link": "https://www.vanityfair.com/hollywood/2018/08/harvey-weinstein-another-lawsuit-alleged-rape", "title": "Yet Another Accuser Has Filed a Lawsuit Against Harvey Weinstein for Alleged Rape", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Yohana Desta", "copyright": "Copyright (c) Condé Nast 2020", "description": "The disgraced producer is swimming in legal battles.", "id": "5b7d4cf946c5985ef3f5c500", "keywords": "hollywood,movies,harvey weinstein accusers list,harvey weinstein,sexual misconduct", "news_keywords": "hollywood,movies,harvey weinstein accusers list,harvey weinstein,sexual misconduct", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5b7d4cf946c5985ef3f5c500", "parsely-metadata": "{\"description\":\"The disgraced producer is swimming in legal battles.\",\"image-16-9\":\"https://media.vanityfair.com/photos/5b48ed50f66ae968d819b95c/16:9/w_1000,c_limit/harvey-weinstein-new-interview.jpg\",\"image-1-1\":\"https://media.vanityfair.com/photos/5b48ed50f66ae968d819b95c/1:1/w_1000,c_limit/harvey-weinstein-new-interview.jpg\"}", "og": {"description": "The disgraced producer is swimming in legal battles.", "image": "https://media.vanityfair.com/photos/5b48ed50f66ae968d819b95c/16:9/w_1280,c_limit/harvey-weinstein-new-interview.jpg", "site_name": "Vanity Fair", "title": "Yet Another Accuser Has Filed a Lawsuit Against Harvey Weinstein for Alleged Rape", "type": "article", "url": "https://www.vanityfair.com/hollywood/2018/08/harvey-weinstein-another-lawsuit-alleged-rape"}, "article": {"content_tier": "metered", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@VanityFair", "description": "The disgraced producer is swimming in legal battles.", "domain": "https://www.vanityfair.com", "image": {"src": "https://media.vanityfair.com/photos/5b48ed50f66ae968d819b95c/16:9/w_1280,c_limit/harvey-weinstein-new-interview.jpg?mbid=social_retweet"}, "site": "@VanityFair", "title": "Yet Another Accuser Has Filed a Lawsuit Against Harvey Weinstein for Alleged Rape"}, "fb": {"app_id": 305927716147259, "pages": 8810407571}, "google-signin-client_id": "1065629119444-svrqo31taikd2j0ji4dgjs9q3vul4133.apps.googleusercontent.com"}, "movies": [], "publish_date": null, "source": "https://www.vanityfair.com", "summary": ""}