{"url": "https://comicbook.com/dc/2018/03/21/henry-cavill-mustache-shaved-video/", "text": "It's time to say goodbye to a dear friend. We may not have known him for long, but he certainly made an impact on us while he was here. Farewell, King Stache.\n\nEarlier today, Henry Cavill shaved off his beloved mustache, the source of so much controversy late last year. As a tribute, the Justice League and Mission Impossible star posted a video on his Facebook page to honor his former facial hair.\n\nThe video features Cavill in a bath robe telling fans that King Stache is indeed gone. He shared it to his page with the simple message \"#ShavedButNotForgotten.\"\n\nYou can watch the full video above!\n\n\"I know, it's hard to recognize me without King Stache,\" Cavill said to the camera, before turning his attention to himself in the mirror. \"Sometimes, I have a hard time recognizing myself.\"\n\nIt was only a matter of time before Cavill threw some shade onto the infamous mustache incident. As you surely recall, the actor had the mustache while filming Mission: Impossible - Fallout and was brought back to the set of Justice League for extensive reshoots. Since he wasn't allowed to shave the facial hair due to his obligations to Mission: Impossible, the mustache had to be removed from Justice League via CGI. We all know how that went.\n\nStaring right into the soul of the camera, Cavill said, \"It's hard for me to admit, this it NOT CGI.\"\n\nThe video concludes with Sarah McLachlan's \"I Will Remember You\" playing over a montage of photos featuring King Stache. Of course, one of these images is the Cavill's CGI'd face, showing how terrible it looked without the mustache.\n\nFans have mourned the loss of the beautiful stache all morning. Popular fan artist BossLogic even paid tribute to King Stache by creating a poster, bidding goodbye to the facial hair.\n\nSo long, King Stache. You may be gone, but you'll never be forgotten.", "images": ["https://media.comicbook.com/2018/03/henry-cavill-mustache-video-1095282-640x320.jpeg", "https://www.gamespot.com/bundles/phoenixsite/images/core/loose/logo-gamespot-clear.png"], "top_img": "https://media.comicbook.com/2018/03/henry-cavill-mustache-video-1095282-640x320.jpeg", "keywords": [], "authors": [], "canonical_link": "https://comicbook.com/dc/2018/03/21/henry-cavill-mustache-shaved-video/", "title": "Henry Cavill Bids Goodbye to His Mustache in Hilarious Tribute Video", "meta_data": {"description": "It's time to say goodbye to a dear friend. We may not have known him for long, but he certainly made an impact on us while he was here. Farewell, King Stache.Earlier today, Henry Cavill shaved off his beloved mustache, the source of so much controversy late last year. As a tribute, the Justice [...]", "keywords": "Henry Cavill,Justice League", "news_keywords": "Henry Cavill,Justice League", "twitter": {"card": "summary", "site": "ComicBook", "creator": "charlieridgely", "title": "Henry Cavill Bids Goodbye to His Mustache in Hilarious Tribute Video", "description": "It's time to say goodbye to a dear friend. We may not have known him for long, but he certainly [...]", "image": "https://media.comicbook.com/2018/03/henry-cavill-mustache-video-1095282-640x320.jpeg"}, "og": {"title": "Henry Cavill Bids Goodbye to His Mustache in Hilarious Tribute Video", "type": "article", "url": "https://comicbook.com/dc/2018/03/21/henry-cavill-mustache-shaved-video/", "image": {"identifier": "https://media.comicbook.com/2018/03/henry-cavill-mustache-video-1095282-640x320.jpeg", "width": 640, "height": 320}, "site_name": "DC", "description": "It's time to say goodbye to a dear friend. We may not have known him for long, but he certainly [...]"}, "fb": {"app_id": 231517050198188, "pages": 1075190092524035}, "p": {"domain_verify": "5ad45d41467dc74340d8100ffa0f2a73"}, "google-site-verification": "x7hVrjifSfYWJfj0-FWACv2DSoXFbHhXgJ62RjFIkgs", "viewport": "width=device-width, initial-scale=1, maximum-scale=5,user-scalable=0"}, "movies": [], "publish_date": 1521561600.0, "source": "https://comicbook.com", "summary": ""}