{"url": "https://www.bustle.com/p/britney-spears-brought-andy-cohen-on-stage-but-may-have-forgotten-his-name-video-9880610", "text": "Well, this is kind of awkward — but also kind of hilarious. As Entertainment Tonight pointed out, Britney Spears brought Andy Cohen on stage at her Radio City Music Hall concert in New York City on Tuesday night, and it seems like she either forgot his name or doesn't know who the Watch What Happens Live With Andy Cohen host actually is. Whatever the case, the footage of Cohen crawling around on stage in a harness with Spears is something Bravo fans need to see.\n\nIn addition to sharing a video of himself at the concert on Instagram on Wednesday, Cohen explained in detail how he scored this amazing opportunity during his Wednesday Sirius XM Radio Andy show. But first, let's talk about the video. As you can see below, Cohen is ecstatic to be on stage wearing a harness and leash and having Spears whip him to her song \"Freakshow.\" He can't help but smile. At one point, the 50-year-old gets on his knees and bows down to the singer.\n\nAt the end of the performance, Spears says to the audience, \"I think you all know who this is. Give it up for him!\" Take note, she did not refer to Cohen by name. Then, after signing a T-shirt of herself for Cohen, she declares, \"[My] ears, he's loud!\"\n\nOf course, Cohen had a deep discussion about the experience and even explained how he was chosen to be Spears' \"victim\" on stage. According to Cohen, they call the person they bring on stage during \"Freakshow\" the \"victim.\" He said, \"I knew I was going to be the victim. They called me that day and said, 'We want to run you through what's gonna happen.' I said, 'I don't want to know a thing.'\"\n\nCohen explained how the evening went and what it was like being on stage with Queen Britney. He even commented on the moment where people think Spears forgot his name. \"I said I was Mariah Carey'd,\" Cohen joked. He, of course, is referring to Mariah Carey famously saying \"I don't know her\" about Jennifer Lopez.\n\nBelieve it or not, but the Real Housewives executive producer is totally fine if Spears forgot his name or doesn't know who he is. \"My take on this is, first of all, why would Britney know my name? She's Britney, b*tch. Like, I have no expectations, it's why I have no expectations that Madonna should ever know who I am. I am a mortal and Britney is Britney.\"\n\nHe even said he really doesn't think she knows who he is. He's happy he was given the opportunity to stand next to the Glory artist. \"She gave me what I want,\" he said. \"I like it she's like, 'I think you know who this is, give it up for him.' It's pretty funny, right?\"\n\nRadio Andy on YouTube\n\nCohen also said someone tweeted him saying, \"Britney doesn't love it when people bow down to her,'\" which is exactly what he did. \"Someone said it makes her uncomfortable when people do that and I would imagine that in Britney's life people do go up to her and bow down a lot. It might get kind of annoying.\"\n\nAs for her calling Cohen \"loud,\" he doesn't remember yelling. \"To what she was referring, I don't know,\" he said. \"I was not being [loud]. I really didn't speak. I was mouthing, 'I love you,' to her.\" But, the fact that Spears recognized how loud Cohen can be, he said, \"So that says to me Britney definitely knew who I am, because I am loud!\"\n\nWhen he was on stage, Cohen noted he didn't hear anything Spears was saying in the moment, because he was in his element and so excited.\n\nTo be fair, Spears could very well know who Cohen is and just didn't refer to him by name. He is pretty famous, so maybe Spears didn't think she needed to mention his name to the audience. Who knows what she was thinking, but Cohen being invited on stage turned out to be better than he probably ever imagined.", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/16/524f5e1d-2c9d-4f80-9ca8-84c34bffd783-getty-451431999.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2018/7/25/b5b5b6c9-51be-42a9-a882-fe996f994d3d-getty-945529540.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2018/7/25/b5b5b6c9-51be-42a9-a882-fe996f994d3d-getty-945529540.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/16/15a1f2f4-ea42-4f95-87bf-1968752f2ced-gettyimages-74684761.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/9/89f57d06-71ec-4e6e-b575-9f78e16c7332-getty-1209533990.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/7/25/591ffa7e-d342-468c-8eef-231eeafd112d-fangirls1-2.png?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/14/425d3f49-8085-49ab-a268-0780ebd7917a-getty-1209305858.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/7/25/b5b5b6c9-51be-42a9-a882-fe996f994d3d-getty-945529540.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/britney-spears-brought-andy-cohen-on-stage-but-may-have-forgotten-his-name-video-9880610", "title": "Britney Spears Brought Andy Cohen On Stage, But May Have Forgotten His Name — VIDEO", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/britney-spears-brought-andy-cohen-on-stage-but-may-have-forgotten-his-name-video-9880610", "type": "article", "title": "Britney Spears Might've Pulled A Mariah Carey When Andy Cohen Was On Stage At Her Show", "description": "Well, this is kind of awkward — but also kind of hilarious. As Entertainment Tonight pointed out, Britney Spears brought Andy Cohen on stage at her Radio City Music Hall concert in New York City on Tuesday night, and it seems like she either forgot…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/7/25/b5b5b6c9-51be-42a9-a882-fe996f994d3d-getty-945529540.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Well, this is kind of awkward — but also kind of hilarious. As Entertainment Tonight pointed out, Britney Spears brought Andy Cohen on stage at her Radio City Music Hall concert in New York City on Tuesday night, and it seems like she either forgot…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}