{"url": "https://www.mercurynews.com/2018/07/18/did-queen-elizabeth-wage-brooch-warfare-against-donald-trump/", "text": "Is there a chance that Queen Elizabeth understands the verb troll in its 21st-century iteration? Is there such a thing as the Royal Urban Dictionary?\n\nQEII might not be able to define troll, but it seems the 92-year-old monarch may be well-versed in executing it. And her victim might have been one Donald J. Trump.\n\nThe president, of course, paid Queen Elizabeth a visit last week at Windsor Castle during his controversial visit to London, where hundreds of thousands of Brits took to the streets to protest his presence.\n\nTrump, who was accompanied by first lady Melania Trump, didn’t exactly endear himself to the queen when he broke protocol and walked ahead of her. Video of the breach of etiquette went viral.\n\nBritain’s Queen Elizabeth walks around US President Donald Trump as they inspect the guard at Windsor Castle pic.twitter.com/2DWfIlTeMT — RTÉ News (@rtenews) July 13, 2018\n\nThe Trumps were also late for their scheduled tea with the queen. Bloody hell!\n\nBut it seems Her Royal Highness might have gotten revenge preemptively. According to E!News, Queen Elizabeth wore different brooches during Trump’s three days in the United Kingdom, with each broach having special significance, as described on the blog From Her Majesty’s Jewel Vault.\n\nA Twitter user who goes by the handle @SamuraiKnitter tweeted extensively about the “brooch warfare.”\n\nQueen Elizabeth “does hundreds and hundreds of appearances, and maybe 95% or high, she wears a brooch. And the brooch is ALWAYS significant. Badges of military regiments – she inspects some troops, she wears the badge of them to do it,” @SamuraiKnitter wrote.\n\nQE also does hundreds and hundreds of appearances, and maybe 95% or higher, she wears a brooch. And the brooch is ALWAYS significant. Badges of military regiments – she inspects some troops, she wears the badge of them to do it. — Bitch. STILL my superhero name. (@SamuraiKnitter) July 15, 2018\n\nOn Trump’s arrival in London on July 12, Queen Elizabeth’s choice of brooch was gifted to her by Barack and Michelle Obama during their last visit to London as president and first lady. The brooch was not a state gift, according to @SamuraiKnitter, as the Obamas paid for it themselves.\n\n“The US has given QE jewelry before over the years and I bet her dresser could put hands on any and all of it given five minutes,” said @SamuraiTwitter. “But she chose the most SENTIMENTAL piece in the collection, the one that was given OUT OF FRIENDSHIP WITH THE OBAMAS AS PEOPLE.”\n\nThe US has given QE jewelry before over the years and I bet her dresser could put hands on any and all of it given five minutes. But she chose the most SENTIMENTAL piece in the collection, the one that was given OUT OF FRIENDSHIP WITH THE OBAMAS AS PEOPLE. — Bitch. STILL my superhero name. (@SamuraiKnitter) July 15, 2018\n\nGet more celebrity news and photos delivered to your inbox for free on weekdays.\n\nSign up for our Coffee Break newsletter here.\n\nOn Day 2 of Trump’s visit, the queen wore a brooch from new U.S. frenemy Canada.\n\nPlease explain, @SamuraiKnitter.\n\n“It’s called the Sapphire Jubillee Brooch, and it was given to the Queen of England as a gift for ruling eleventy billion (okay, 66 years). From Canada. You know, who Trump’s been screaming about and insulting. The commonwealth country and of the UK’s greatest allies. Them.”\n\nIt's called the Sapphire Jubillee Brooch, and it was given to the Queen of England as a gift for ruling for eleventy billion (okay, 65). From Canada. You know, who Trump's been screaming about and insulting. The commonwealth country and one of the UK's greatest allies. Them. — Bitch. STILL my superhero name. (@SamuraiKnitter) July 15, 2018\n\nFor tea with the Trumps, Queen Elizabeth forewent the brooch altogether and safety-pinned a flamin’ hot Cheeto to her lapel.\n\nOK, we kid about that last one.\n\nWhat she actually wore was a brooch handed down from her mother — the very same one that the Queen Mother wore to the funeral of King George VI, Queen Elizabeth’s father.\n\n“QE rolled up to tea with the tRUmps wearing the brooch her mother wore to her father’s STATE FUNERAL,” tweeted @SamuraiKnitter.\n\nQE rolled up to tea with the tRUmps wearing the brooch her mother wore to her father's STATE FUNERAL. pic.twitter.com/NjeiP8w1hV — Bitch. STILL my superhero name. (@SamuraiKnitter) July 15, 2018", "images": ["https://www.mercurynews.com/wp-content/uploads/2018/07/uktrump1.jpg?w=1024&h=683", "https://www.mercurynews.com/wp-content/themes/mercurynews/static/images/noimage.jpg", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://secure.gravatar.com/avatar/020bf2b94c0fb6ac1f396598e197cf31?s=85&d=mm&r=g", "https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2018/07/uktrump1.jpg?w=1024&h=683", "keywords": [], "authors": ["Cicero Estrella", "Online Producer", "Cicero Estrella Is The Bay Area News Group'S Entertainment", "Lifestyles Producer. He Has Worked Previously As A Sports", "Features", "News Reporter."], "canonical_link": "https://www.mercurynews.com/2018/07/18/did-queen-elizabeth-wage-brooch-warfare-against-donald-trump/", "title": "Did Queen Elizabeth wage brooch warfare against Donald Trump?", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "Queen Elizabeth wore different brooches -- each with significant meaning -- during Donald Trump's three-day visit to the United Kingdom.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Did Queen Elizabeth wage brooch warfare against Donald Trump?", "url": "https://www.mercurynews.com/2018/07/18/did-queen-elizabeth-wage-brooch-warfare-against-donald-trump/", "description": "Queen Elizabeth wore different brooches — each with significant meaning — during Donald Trump’s three-day visit to the United Kingdom.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2018/07/uktrump1.jpg?w=1024&h=683", "width": 1024, "height": 683}, "locale": "en_US"}, "article": {"published_time": "2018-07-18T13:00:31+00:00", "modified_time": "2018-07-20T20:56:05+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Did Queen Elizabeth wage brooch warfare against Donald Trump?"}, "image": "https://www.mercurynews.com/wp-content/uploads/2018/07/uktrump1.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1531843200.0, "source": "https://www.mercurynews.com", "summary": ""}