{"url": "www.washingtonpost.com/politics/2018/08/26/whether-he-wanted-or-not-john-mccain-played-an-outsized-role-trumps-political-narrative/", "text": "Let's start from the beginning. Barely a month into then-candidate Donald Trump's presidential run, McCain almost inadvertently ended it. Or so many thought.\n\nAD\n\n“He’s not a war hero,” Trump said. “He’s a war hero because he was captured. I like people that weren’t captured, okay? I hate to tell you. He’s a war hero because he was captured, okay?”\n\nAD\n\nWell, that was it. You can't disparage a war hero who has become a living legend in Washington and expect to win the Republican presidential nomination.\n\nMcCain said he was “surprised” Trump went after him but referred to a famous Theodore Roosevelt quote about the difference between talkers and doers. “I'm in the arena, as T.R. used to say.” In other words: Trump ain't nothing to me.\n\nHe soon would be. Trump won the Republican nomination. And McCain, whether he wanted to or not, would go on to play a central role in the rest of Trump’s political narrative, a symbol of the establishment Republican Party that Trump stomped on to snatch victory.\n\nAD\n\nMcCain may not have liked the guy (he questioned his fitness to be commander in chief), but like most dutiful Republicans, he respected what Trump had done. He endorsed Trump for president.\n\nAD\n\nThe decision would test McCain many more times. Weeks later, Trump battled a Gold Star parent who spoke at the Democrats' nominating convention. McCain was fuming.\n\n“I cannot emphasize enough how deeply I disagree with Mr. Trump’s statement,” McCain's Senate campaign said in a statement. “I hope Americans understand that the remarks do not represent the views of our Republican Party, its officers, or candidates.”\n\nTrump predictably didn't like that. He told The Washington Post that he might or might not support McCain, who was running for a sixth term in the Senate, in his primary. He said he had no interest in apologizing to McCain for the war hero spat.\n\nAD\n\nTrump's threat to undermine McCain, among other GOP leaders, would later be remembered as a giant middle finger to the Republican Party that had just swallowed its pride and given him the nomination.\n\nAD\n\nAt this point, McCain's Democratic opponent was running ads tying McCain to Trump's most controversial comments about immigrants and women.\n\nAnd the rest of us were asking: How in the world is McCain still supporting Trump anyway?\n\n(Because, politics, surmised The Fix's Aaron Blake: “If McCain wants to be renominated, it's perhaps best not to alienate the many Arizona Republicans that backed Trump and turn this into a Trump vs. McCain primary.\")\n\nMcCain did win that primary. Literally a day later, he ditched Trump. Given that McCain had gritted through Trump’s pummeling for more than a year without saying much, it was a high-profile defection.\n\nAD\n\nIn a gauzy, five-minute video, he basically acknowledged that he thought Hillary Clinton was going to win and pitched himself as a bulwark against a Democratic president.\n\nAD\n\n“If Hillary Clinton is elected president, Arizona will need a senator who will act as a check — not a rubber stamp — for the White House,” he said.\n\nOnce again, McCain didn't get what he wanted. Trump is now President Trump.\n\nBut both safely elected and back in Washington, McCain let his true colors fly. He became Trump's chief Republican antagonist in the Senate.\n\nShortly after Trump got elected, McCain was one of the first GOP senators to express reservations about Trump’s Cabinet nominees. When “pigs fly,” McCain said when asked if he would support Rex Tillerson for secretary of state. (He eventually did but since said he sometimes regrets it.)\n\nAD\n\nMcCain was one of the first senators of either party to demand an independent investigation into Russia meddling.\n\nLast summer came the moment Trump will never forget. After announcing his diagnosis of brain cancer, McCain gave a surprise \"no\" vote that ended Republicans' efforts to repeal Obamacare. Trump has brought up that \"no\" vote every chance he gets.\n\nAD\n\nMcCain used his last few months in Washington to deliver series of speeches with increasingly alarmist language about Trump.\n\n\"We're getting nothing done,\" he scolded his colleagues on the Senate floor.\n\n“We have to fight [against Trumpism],” McCain told Naval Academy midshipmen, describing Trump’s foreign policy as nothing more than “crackpot conspiracy theories.”\n\nAD\n\n“We are not his subordinates,” he warned his party in an op-ed, referring to the president.\n\nAt the end of 2017, McCain left Washington for treatment of his cancer. But even from his home in Arizona, he continued to poke Trump where it hurt. At a critical moment this spring when Trump’s CIA nominee was on thin ice to get approved by the Senate, McCain publicly engineered a bid to try to tank her confirmation by urging his colleagues to vote against her.\n\nAD\n\nThe last major public spat between the two was ugly. Trump and his White House refused to publicly apologize for a crude comment a former aide made about McCain’s imminent death. McCain’s daughter, Meghan McCain, said people who defend that aide “are going to have to answer for their own conscience.”\n\nAD\n\nMcCain's last defiant act of the Trump era was to write a book. It was a memoir that mourned for a time past in politics and compared Trump to a despot.\n\n“I would like to see us recover our sense that we are more alike than different,” he wrote. “Even in times of political turmoil such as these, we share that awesome heritage and the responsibility to embrace it.”\n\nIn the beginning, McCain was caught off guard by how Trump's nascent and chaotic presidential campaign sucked him into the center of its vortex. He wrote in his memoir that he didn't know what to make of Trump's convictions.\n\nAD\n\nIn the last year of his life, McCain transformed himself into a willing leader of the resistance.", "images": ["https://www.washingtonpost.com/resizer/bIJdcfWe_XMR8LCGQSW192EehYA=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2ZAI2TVJFEI6RGT5ZUYFAT7ZAI.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/52a8b622-9ef2-441d-9b33-b369eeff1bc9.png&w=90&h=90", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2ZAI2TVJFEI6RGT5ZUYFAT7ZAI.jpg&w=150"], "top_img": "https://www.washingtonpost.com/resizer/bIJdcfWe_XMR8LCGQSW192EehYA=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2ZAI2TVJFEI6RGT5ZUYFAT7ZAI.jpg", "keywords": [], "authors": ["Amber Phillips", "Reporter For The Fix Covering Congress"], "canonical_link": "https://www.washingtonpost.com/politics/2018/08/26/whether-he-wanted-or-not-john-mccain-played-an-outsized-role-trumps-political-narrative/", "title": "Whether he wanted to or not, John McCain played an outsize role in Trump’s political narrative", "meta_data": {"description": "In the last year of his life, McCain was leading the battle for the soul for the Republican Party.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/politics/2018/08/26/whether-he-wanted-or-not-john-mccain-played-an-outsized-role-trumps-political-narrative/", "image": "https://www.washingtonpost.com/resizer/bIJdcfWe_XMR8LCGQSW192EehYA=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2ZAI2TVJFEI6RGT5ZUYFAT7ZAI.jpg", "title": "Analysis | Whether he wanted to or not, John McCain played an outsize role in Trump’s political narrative", "description": "In the last year of his life, McCain was leading the battle for the soul for the Republican Party."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Analysis | Whether he wanted to or not, John McCain played an outsize role in Trump’s political narrative", "description": "In the last year of his life, McCain was leading the battle for the soul for the Republican Party."}, "last_updated_date": "2018-08-27T17:34:35.818Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1535212800.0, "source": "http://www.washingtonpost.com", "summary": ""}