{"url": "www.inquisitr.com/4908361/gwen-stefani-pregnant-rumors-dont-bother-blake-shelton-says-source/", "text": "Rumors suggesting that Gwen Stefani is pregnant do not bother Blake Shelton anymore, a source close to him told Gossip Cop.\n\nShelton has often found himself confronting untrue reports about his relationship with Gwen Stefani ever since the two got together a few years ago. Almost on a constant basis, one can find false reports claiming that Blake and Gwen are getting married, or that they have already split up. Initially, Shelton found these reports so infuriating that they would get “under his skin,” making him feel angry about how the media was exploiting their relationship for their interests.\n\nBut it appears Shelton cannot be bothered anymore. The source close to him said that one day he “just decided he can’t be bothered,” and that he has become “immune” to Gwen Stefani pregnancy rumors. He has reportedly adopted a view that most of the stories about the couple are patently untrue and it is not something which he should actually get worked up about.\n\nEven a brief glance into news stories about Gwen Stefani and Blake Shelton’s relationship justifies this behavior. Just a few days into the new year, OK! Magazine published a story in which it was reported that the couple got married in an “intimate backyard ceremony just days before Christmas.” Moreover, the magazine asserted that the marriage had “just 27 of the couple’s nearest and dearest gathered in Gwen’s back garden,” and only cost the couple $23,000.\n\nBlake Shelton “Can’t Be Bothered” By Marriage Or Baby Rumors https://t.co/RiEfs8Z5wQ — Gossip Cop (@GossipCop) May 21, 2018\n\nLater, the same magazine wrongly claimed that Gwen Stefani was pregnant with Shelton’s child — a story which was debunked by other news sites. Such false reports about the couple led Shelton to tweet out to his fans, asking them not to believe everything that they read about the pair in the media.\n\n“99 percent of the things you read about [me] on social media or the internet isn’t true. It’s actually disturbing. I rarely even look at it anymore because I know it’s mostly fake.”\n\nIn his tweet, he wrote that he felt “disturbed” with the false news reports, now the change in his attitude is evident from the fact that while performing at his restaurant Ole Red in Tishomingo, Oklahoma, he joked with audience members about them being “very lucky” that particular night because Gwen Stefani was joining him for a duet, even though she “actually gave birth to twins yesterday.”", "images": ["http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://secure.gravatar.com/avatar/7c3ead8875ffda193b78228399febdd4?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2018/05/Blake-Shelton-and-Gwen-Stefani.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Mohit Priyadarshi"], "canonical_link": "https://www.inquisitr.com/4908361/gwen-stefani-pregnant-rumors-dont-bother-blake-shelton-says-source/", "title": "Gwen Stefani Pregnancy Rumors Don’t Bother Blake Shelton, Says Source", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}