{"url": "https://uproxx.com/tv/shows-canceled-end-2017/", "text": "\n\nWe lost some good shows this year. We lose some good shows every year, though, so I guess it’s not a huge surprise. The worst in recent memory was 2015, probably. We lost Mad Men, Justified, and Parks and Recreation that year. That was not great and felt at the time like an attack on me, personally. This year wasn’t that bad. Most of the shows that ended this year were short-lived, critically acclaimed shows with tiny audiences, or long-running shows like Bones or Pretty Little Liars that had passionate fanbases that did not include many critics. And a bunch of the ones that ended went out on a high note, with historically great final seasons and moments in those final seasons that will stay burned in viewers’ brains forever. Things could be worse, is what I’m saying. Let’s say our goodbyes.\n\nThe Leftovers The Leftovers came to an end after three seasons and boyyyyy did it ever go out swinging. By the end of the show’s run it had somehow become the most accurate and heartbreaking depiction of grief and tragic loss and also a fanciful joyride where entire episodes are devoted to lion sex cults on Australian cruise ships and throwaway jokes about Perfect Strangers eventually lead to eye-opening revelations about the show’s main characters. It was beautiful and sad and funny and unlike anything else on television this year, or any other year for that matter. And also unlike a lot of other shows, it feels like it ended at the perfect time. Would I have liked another season or two of the show, just to see where Damon Lindelof and company took it? Well, yeah, probably, just out of curiosity. But sustaining this level of intense emotion and high-concept plot acrobatics for even three seasons is damn near impossible, so the fact that it did that and went out at its creative peak, Wu-Tang tattoos and goats and all, is a gift we should cherish as is. The Leftovers was a good show. Halt and Catch Fire The history of Halt and Catch Fire, in short: A B- version of Mad Men about the tech industry in the 1980s somehow morphed into a stunning workplace drama about people and relationships and relentless creativity. The fourth and final season was honestly one of the best seasons of television I’ve ever seen. It moved me to tears a bunch of times, in a bunch of different ways, with sad moments leading to sweet and setbacks leading to triumphs. It is at the very top of my “No, really, the whole series is on Netflix and you should check it out if you’re looking for a binge-watch” list.\n\nUnderground Underground came to an end after two seasons. A probable end. Producer John Legend is still trying to find a home for the Underground Railroad historical drama now that WGN pulled the plug, so this might not be a goodbye forever as much as a brief see ya. Either way, the show was made incredibly well and told an important story and was one of the things it feels like we should have on television if we’re gonna have 8,000 shows on 450 channels. Fingers crossed for its return, but if not, here’s hoping it at least opened a door for more stories like this. Playing House Playing House was a very fun USA comedy from creators and stars Jessica St. Clair and Lennon Parham, who fans of the Comedy Bang Bang podcast will recognize as frequent fictional guests Marissa Wompler and Miss Listler. Losing it is bad because we need more fun comedies. A lot of comedies are too serious these days. Bring back Playing House.\n\nThe Mindy Project The Mindy Project bounced from Fox to Hulu midway through its run and stuck around the streaming service for its last few seasons, until its series finale earlier this year. It kind of got lost once it switched over, with diehard fans still tuning in (or whatever the streaming equivalent of “tuning in” is) while the public at large moved on. But it will always be a notable show for at least two reasons, in addition to being funny: It was a show created by and starring an Indian-American woman and it was one of the first to get “saved” by a deep-pocketed streaming service. It was a double pioneer. Gotta count for something. In any event, Mindy Kaling is super talented and I’m sure we’ll see her back on TV at some point. Review Review is impossible to describe in a blurb, but let’s try anyway. Andy Daly played Forrest MacNeil, the host of a show-within-the-show who reviewed life experiences. He was so committed to this project that he repeatedly ruined his life, sometimes in dramatic and painful ways. He got divorced and burned down his house and got more than a few people killed. And it was hilarious. Weird as all heck, and often disturbing if you stopped to think about any of it for like 20 minutes, but absolutely hilarious. It was another show that ended after a short run, burning hot and fast across the sky like a meteor, and it left a crater in my heart when it went away. If you watched and loved Review, you and I would probably be friends.\n\nOrphan Black Orphan Black was not a show I watched with any real regularity, but the main takeaway I got from my few viewings and talking to my superfan coworkers was this: Tatiana Maslany is crazy talented. Playing one character is hard. Playing two characters is harder, even if it was a bit of a trend this year (James Franco on The Deuce, Ewan McGregor on Fargo). Playing a ton of characters, each different in ways ranging from subtle to a lot? That’s almost an athletic feat. She got an Emmy for it, sure, but I think an Olympic medal might have been just as appropriate.\n\nGirls Girls was wild because you didn’t even have to watch to have a firm and extreme opinion about things that happened or things that didn’t happen but you assume happened based on what you thought the shoe was. It was also, at times, a critically adored show that covered issues and topics that no other show on television did, and it created a space for shows that came later to do more of that. Maybe it wasn’t for you. That’s okay. Not every show has to be for you. But Girls did a bunch of important things and you can’t go back and take any of that away from it. The Carmichael Show As I’ve pointed out, some of the shows on this list went out at what felt like the right time, on their own terms, or at least something close to that. The Carmichael Show is one that ended with a lot more to say, I think. That sucks. The ratings were never great and television is a business first and foremost, but the show was having tough conversations about real topics every week in a funny way. That’s rare, especially on a network. Even when I missed an episode here or there, it was still comforting to know that was happening. That someone was trying it. I can respect that. In hindsight, it’s crazy The Carmichael Show even existed. It mixed and matched things in a way that probably shouldn’t have worked. It was a network show that dove face-first into hot-button topics at a time when that type of thing is usually done on cable. It was a critically respected multi-camera show with a live audience laughing along at a time when most critically respected comedies use a single camera format. It was something new and exciting and yet its closest comparison is the collection Norman Lear sitcoms from 40 years ago. But it all worked anyway because it was really good. That’s probably the lesson in all of this. Anything can work if you do it well enough.", "images": ["https://uproxx.com/wp-content/uploads/2020/03/market-grid-uproxx.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2020/04/newmusic-grid.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2020/04/YT_thumb_full4.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2020/04/pop-grid-uproxx-2.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/themes/uproxx/assets/images/logo.svg?v=1.0.8", "https://uproxx.com/wp-content/uploads/2019/07/peoples-party-2.jpg?w=719&h=272&crop=1", "https://uproxx.com/wp-content/uploads/2020/04/1takejay-sessions.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2020/04/rb-grid-uproxx-1.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2020/04/drink-grid-uproxx.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2020/04/kenny-sailors.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2020/04/jidsaba-grid-uproxx.jpg?w=328&h=185&crop=1", "https://sb.scorecardresearch.com/p?c1=2&c2=8430760&c3=&c4=&c5=&c6=&c15=&cj=1", "https://uproxx.com/wp-content/uploads/2017/12/tv-grid.jpg?w=650", "https://uproxx.com/wp-content/themes/uproxx/assets/images/section-icons/tv.png?v=1.0.8", "https://uproxx.com/wp-content/uploads/2020/04/fionna-grid-uproxx.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2020/04/porkys-grid-uproxx-1.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2020/04/trolls2-grid-uproxx.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2020/04/michaelb-grid-uproxx.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2020/04/bcs-grid-uproxx-3.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2020/04/pat-grid-uproxx.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2020/04/flight-grid-uproxx.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2020/04/sp-grid-uproxx.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2020/04/resto-grid-uproxx.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2020/04/chella-perf-grid-uproxx.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2020/04/hike-grid-uproxx-1.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2020/03/resturant-grid-uproxx-1.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2020/04/wg-grid-uproxx.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2020/04/idontknowjeffery.jpg?w=328&h=185&crop=1", "https://pixel.quantserve.com/pixel/p-73t-O7FWprUTo.gif", "https://uproxx.com/wp-content/uploads/2020/04/yt_thumb_full.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2020/04/GettyImages-1186448881.jpg?w=328&h=185&crop=1", "https://uproxx.com/wp-content/uploads/2014/04/bg-photo.jpg?w=37"], "top_img": "https://uproxx.com/wp-content/uploads/2017/12/tv-grid.jpg?w=650", "keywords": [], "authors": ["Brian Grubb", "Cherise Johnson", "Andre Gee", "Zac Gelfand", "Carolyn Droke", "Derrick Rossignol"], "canonical_link": "https://uproxx.com/tv/shows-canceled-end-2017/", "title": "In Memoriam: A Tribute To The TV Shows We Lost For Good In 2017", "meta_data": {"description": "From \"The Leftovers\" to \"Halt and Catch Fire\" to \"The Carmichael Show,\" here are the shows we lost in 2017.", "keywords": "entertainment, home page, tv, best of 2017, best of tv 2017, the leftovers", "viewport": "width=device-width, initial-scale=1", "robots": "index,follow", "twitter": {"card": "summary_large_image", "site": "@UPROXX", "creator": "@UPROXX", "widgets": {"csp": "on"}, "title": "In Memoriam: A Tribute To The TV Shows We Lost In 2017"}, "google-site-verification": "370ZQZwYhpp3OFLpudIZ11ONRN8X1ZhGglPMAFJ6GKw", "qc": {"post": "shows-canceled-end-2017", "author": "Brian Grubb", "section": "tv", "primary_tag": "best-of-2017"}, "generator": "WordPress 5.4", "og": {"type": "article", "title": "Shows We Said Goodbye To In 2017", "url": "https://uproxx.com/tv/shows-canceled-end-2017/", "description": "From ’The Leftovers’ to ’Halt and Catch Fire’ to ’The Carmichael Show,’ here are the shows we lost in 2017.", "site_name": "UPROXX", "image": {"identifier": "https://uproxx.com/wp-content/uploads/2017/12/tv-grid.jpg?w=650", "width": 650, "height": 360}, "locale": {"identifier": "en_US", "alternate": "en_GB"}}, "article": {"published_time": "2017-12-19T14:35:00+00:00", "modified_time": "2019-03-19T10:44:34+00:00", "publisher": "https://www.facebook.com/UPROXX"}, "fb": {"admins": "680207693,2208604", "app_id": 117400151618132, "pages": 116548701336}}, "movies": [], "publish_date": 1513694100.0, "source": "https://uproxx.com", "summary": ""}