{"url": "https://www.bustle.com/p/kim-kardashians-birthday-messages-from-her-family-will-remind-you-just-how-close-the-kardashian-jenners-are-12633636", "text": "It's the end of Libra season, and that means it's time for one of the biggest reality-television stars to celebrate her birthday. On Sunday, Kim Kardashian received birthday messages from her family on social media, and their wishes show that this family is still so close. On Instagram, both Khloé Kardashian and Kendall Jenner took the time to post a message for Kim, who celebrated her 38th birthday on October 21. Meanwhile, Kylie Jenner shared her bday message to her big sister via an Instagram Story, while their mom penned a beautiful ode to her daughter.\n\nThe family was sure to share the love online with throwback pictures and special messages. Khloé shared a slideshow of photos with Kim, and included a long message for her sister about how she continues to be impressed by her. The Good American founder wrote:\n\nHappy birthday sweet Kimberly!!! My entire life, you've always been someone that I look up to. To me, You are super woman!! I'm not sure how you do it all and make everything look so easy. People have no idea how selfless of a human being you are. With no credit wanted either.\n\nHer message went on to acknowledge how much the sisters have been through over the years, and how they are lucky to be able to be there for each other, even when their lives take unexpected turns. Khloé continued:\n\nI am so impressed by the woman, wife and mother you have become. I'm so thankful for us getting closer over the last year. You're a f****** rider! Without you I would be lost! Crazy sh*t happens to us all of the time, but how f****** lucky are we that we get to experience this crazy thing called life with one another? I know for certain, that no matter what happens to any of us, we will always be OK because we have one another. I hope you have the happiest of birthdays Keeks! I pray that every wish you have, it comes true. You are so deserving! I love you!! Until the end of time, I love you!!!\n\nThe sweet message definitely seems to allude to how motherhood has brought Khloé and Kim closer since the birth of little True earlier this year.\n\nOf course, Khloé wasn't the only family member to send Kim a happy birthday message. Kylie shared a video from the Kim X Kylie makeup collaboration to her Instagram Story, captioning the photo: \"HAPPY BIRTHDAY KIMMY I LOVE YOU\" with a party hat emoji.\n\nKris Jenner also shared a collage of photos on Instagram, and included a note about the special day as well. She wrote:\n\n\"Happy birthday Kim Kardashian!!! My beautiful girl, I love and adore you and wish for you the most amazing day and year...you have brought all of us such love, joy, and happiness. You are the best mom, wife, sister, daughter and friend and i am beyond blessed to be your Mom.\"\n\nOn her Instagram Story, Kris also shared a preview for a Keeping Up With the Kardashians birthday marathon.\n\nFinally, Kendall honored her big sister by sharing clips from Kanye West's iconic (and super nostalgic) birthday video that he made for his wife in 2016. Kendall captioned her post with, \"happy birthday to my beautiful sister @kimkardashian.\"\n\nWest was all about spreading the birthday love this year too. He shared his surprise gift for Kim — stunning flowers — on social media. The Kardashian-West family is known for pulling out all the stops when it comes to presents. In August, West surprised Kim with a lime green Mercedes SUV she'd fallen in love with driving while on vacation. It must have been difficult to pick yet another meaningful gift, but he managed to pick the perfect thing. Instead of buying a normal bouquet of flowers, West decked their home out with unique floral arrangements that hung from the ceiling.\n\nThere was more to the birthday present: West also had a pianist waiting to play music when she woke up. On Twitter, he shared a video of the scene, writing:\n\n\"You’re stunning. I will keep trying to make things that can express how beautiful you are inside and out and how much I love you and our family.\"\n\nKim loved the present, and she shared the video of the birthday surprise on Twitter. She wrote: \"The most beautiful birthday flowers in the world!!!!! I have the sweetest most creative husband! Thank you babe love you so much!!!\"\n\nThe Kardashian-Wests went out of their way to celebrate Kim's special day. From the extravagant flowers to best wishes on social media, the whole crew came together to send their best to Kim on her birthday. It's clear that no matter how much drama fans see on Keeping Up With the Kardashians, this family is all about the love.", "images": ["https://imgix.bustle.com/uploads/image/2018/10/21/a6bff75f-b0b1-416c-886d-7646eb5d2068-img_0892.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2018/10/21/87053b85-1f2a-48e0-a04b-8fd3b3284545-getty-1048501618.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/3/194ae6f8-bcef-4f14-b94e-ad8aa42bad93-getty-1181741946.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/12/2fca4db2-2ed7-40f0-a1a6-5f2e7b6be519-getty-1181489072.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/1/58c1a92f-54bc-4064-9ab9-38ee62d2cd4b-screen-shot-2020-04-01-at-114400-am.png?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/4/143448e3-4aad-4671-9733-857842778d0d-getty-1094888054.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2018/10/21/87053b85-1f2a-48e0-a04b-8fd3b3284545-getty-1048501618.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/10/21/87053b85-1f2a-48e0-a04b-8fd3b3284545-getty-1048501618.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/kim-kardashians-birthday-messages-from-her-family-will-remind-you-just-how-close-the-kardashian-jenners-are-12633636", "title": "Kim Kardashian's Birthday Messages From Her Family Will Remind You Just How Close The Kardashian-Jenners Are", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/kim-kardashians-birthday-messages-from-her-family-will-remind-you-just-how-close-the-kardashian-jenners-are-12633636", "type": "article", "title": "Kim Kardashian Received The Sweetest Birthday Message From Her Family", "description": "It's the end of Libra season, and that means it's time for one of the biggest reality-television stars to celebrate her birthday. On Sunday, Kim Kardashian received birthday messages from her family on social media, and their wishes show that this…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/10/21/87053b85-1f2a-48e0-a04b-8fd3b3284545-getty-1048501618.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "It's the end of Libra season, and that means it's time for one of the biggest reality-television stars to celebrate her birthday. On Sunday, Kim Kardashian received birthday messages from her family on social media, and their wishes show that this…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}