{"url": "www.imdb.com/name/nm0000123/bio", "text": "Overview (4)\n\nBorn May 6, 1961 in Lexington, Kentucky, USA Birth Name George Timothy Clooney Nickname Gorgeous George Height 5' 11\" (1.8 m)\n\nMini Bio (1)\n\nSpouse (2)\n\nTrade Mark (6)\n\nOften plays scoundrels that are likable and have redeeming qualities\n\n\n\nHis movies often reflect his liberal political beliefs\n\n\n\nSilver/grey hair\n\n\n\nSmooth, resonant voice\n\n\n\nOften works with Brad Pitt and Matt Damon\n\n\n\nFrequently works with Joel Coen and Ethan Coen\n\n\n\nTrivia (126)\n\n\n\nBest man at the wedding of Richard Kind\n\nTried out for a position on the Cincinnati Reds baseball team.\n\n\n\n\n\nDuring the 1990s, Clooney often publicly asserted that he would never get remarried or have any children, but Michelle Pfeiffer and Nicole Kidman both bet $10,000 each that he would be a father before he turned 40. They were both wrong, and each sent him a check. He returned the money, betting double or nothing that he wouldn't have kids by age 50. At age 53, he broke his vows to never marry again when he wed human rights lawyer Amal Clooney (née Alamuddin) in 2014. In early 2017, news broke that the couple were pregnant with twins.\n\n\n\nWaged war against the paparazzi by boycotting Entertainment Tonight (1981), the sister show of Hard Copy (1989), which had filmed Clooney without his permission.\n\nWas voted \"Sexiest Man Alive\" by People Magazine. [1997]\n\n\n\nWas voted \"Best Dressed Male Television Star.\" [1997]\n\n\n\nChosen by People (USA) magazine as one of the \"50 Most Beautiful People in the World.\" [1996]\n\n\n\n\n\nUncle is the late actor José Ferrer\n\nEducated at Northern Kentucky University.\n\n\n\n\n\nOwned a pet pig named Max, given to him by Kelly Preston , for eighteen years. Max died on December 1, 2006.\n\nStudied acting at The Beverly Hills Playhouse.\n\n\n\n\n\nCoincidentally, his first steady TV role was in the medical sitcom E/R (1984) that was based in Chicago and co-starred Elliott Gould Mary McDonnell and Jason Alexander . Ten years later it would take another TV series ER (1994) (also based in Chicago) to finally launch him into the galaxy of superstardom.\n\n\n\nCommitted to O Brother, Where Art Thou? (2000) before even reading a script, because of his wish to work with the Coen brothers. He even accepted a significantly lower salary than usual.\n\n\n\nReportedly got into a fistfight with Three Kings (1999) director David O. Russell on the set. Russell had yelled and derided a few extras out of frustration and Clooney didn't appreciate it. Russell has since said, \"I wouldn't make another George Clooney movie if they paid me $20 million.\"\n\nHas stated in several interviews that he has suffered from bleeding stomach ulcers and is still on medication for stomach pain.\n\n\n\nRanked #27 on Premiere's 2002 Power 100 List.\n\n\n\n\n\nFirst cousin once removed of Gabi Ferrer\n\nOne of People Magazine's \"Top 50 Bachelors\" (2002).\n\n\n\n\n\nWas a pallbearer at the funeral of his late aunt, Rosemary Clooney\n\n\n\nHe got his start in a movie starring his cousin, Miguel Ferrer . Later, after Clooney had established himself on ER (1994), Ferrer made a guest appearance on the very first show. George's aunt, Rosemary Clooney , made guest appearances on two shows the first month ER (1994) aired.\n\nRanked #29 in Premiere's 2003 annual Power 100 List.\n\n\n\nIs the sixth actor to play Batman.\n\n\n\nNo. 3 of 10 Top Sexiest Men in People magazine. (2003)\n\n\n\n\n\nHis voice was dubbed for the singing moments in O Brother, Where Art Thou? (2000).\n\nHeads his own film and television production company, Maysville Pictures.\n\n\n\n\n\nShared an apartment with actor Thom Mathews during the early 1980s.\n\n\n\nWas the second man, after Richard Gere , to make an appearance on the cover of Vogue magazine.\n\nRanked #16 on VH1's \"100 Hottest Hotties.\"\n\n\n\nRode a bicycle to get to auditions as a struggling actor.\n\n\n\n\n\nSon of actor and AMC host Nick Clooney and Nina Warren Clooney.\n\n\n\nHe loves the show South Park (1997). He got a hold of Trey Parker , the creator of the series, and asked for a part in an episode. He was given the role of \"Sparky,\" the gay dog, which involved little more than panting and yelping. However, when it was time for South Park to go to the big screen, Clooney got a full speaking part, as an ER surgeon.\n\nHe has Irish, English, German, and smaller amounts (to varying degrees) of Scots-Irish, Scottish, Welsh, Dutch, and French Huguenot, roots.\n\n\n\nAt 43, he was voted sexiest male celebrity in a 'Naughty Forties' poll conducted for UK television station FX.\n\n\n\n\n\nShared an L.A. home with Kelly Preston when both were struggling actors.\n\nBorn 2:48 AM, EST.\n\n\n\n\n\nHe loves beer. He does voiceovers for Budweiser TV commercials and allegedly had a beer keg installed in his dressing room during filming of Ocean's Eleven (2001).\n\nLived in a friend's closet while struggling as an actor in L.A., early in his career.\n\n\n\nIs a Dallas Mavericks fan.\n\n\n\nReceived the first \"Spirit of Independence Award\" of the Los Angeles Film Festival and Find Independent (FIND). [June, 2005]\n\n\n\nAppears on the cover of the first Men's Vogue. (2005)\n\n\n\n\n\nIn October 2005, after an accident on the set of his movie Syriana (2005), he suffered from back pain, bad headaches, and memory loss. After several spine surgeries, he fully recovered.\n\n\n\nSought the role of Jack in Sideways (2004). However, the film's director, Alexander Payne , felt that he was too big a star, and turned him down in favor of Thomas Haden Church\n\nOwns a villa in Laglio at Lake Como, Italy, where he lives several months of the year.\n\n\n\n\n\nIn winning the Best Supporting Actor Oscar for Syriana (2005), he becomes the second generation of his family to win an Oscar. His uncle, José Ferrer , won a Best Actor Oscar for playing in Cyrano de Bergerac (1950). Also appearing in Syriana (2005) was Christopher Plummer , who once played Christian to Ferrer's Cyrano in a subsequent production, and later succeeded Ferrer as Cyrano as well.\n\nRanked #21 on Premiere's 2006 \"Power 50\" list. Had ranked #43 in 2005.\n\n\n\n\n\nAs of 2006, he is the only regular cast member from ER (1994) to win an Oscar (for Best Supporting Actor in Syriana (2005)).\n\n\n\nIn August 2006, he and his producing partner Steven Soderbergh decided to close down their Section Eight production company after a 6-year working partnership.\n\n\n\nHe and Grant Heslov founded production company Smoke House after his production company Section Eight closed down.\n\n\n\nHe auditioned for the role of Mr. Blonde/Vic Vega in Reservoir Dogs (1992), but was turned down.\n\nIn 2006, voted People Magazine's \"Sexiest Man Alive\".\n\n\n\n\n\nFrom 1996 through 2003, stuntman Brad Martin served as Clooney's personal stunt double.\n\n\n\nHis famed \"Roman haircut\" was actually an accident. While filming From Dusk Till Dawn (1996), he wanted to make his character Seth Gecko look really crazy with a chopped off hairstyle. But the haircut became popular and turned into a positive.\n\nSuffered from Bell's palsy for a time while he was in high school.\n\n\n\nIn December 2006, he traveled to China and Egypt to make a personal plea to Chinese and Egyptian officials to use their ties with the Sudanese government to help stop the violence in the Darfur region.\n\n\n\n\n\nWas considered for the part of Reed Richards in Fantastic Four (2005).\n\n\n\nHis The Peacemaker (1997) co-star Nicole Kidman presented him his Best Supporting Actor Oscar in 2006.\n\nIn 2001 was voted Most Eligible Bachelor by People Magazine.\n\n\n\nClooney grew up working in tobacco fields. In his late teens, he took up smoking and continued to do so through his late 20's. A decision he regrets and has discussed in numerous interviews. He finally decided to quit when his favorite Uncle died after a long battle with lung cancer. Clooney's parents were non-smokers, although many of his Aunts and Uncles smoked.\n\n\n\nIn September 2006 he addressed the United Nations Security Council, urging it to act over Darfur.\n\n\n\n\n\nHelped celebrate a plan to rebuild a hospital in hurricane-devastated Louisiana alongside former President George Bush . The pair appeared outside the courthouse in Cameron Parish, the only surviving building in the town following Hurricane Rita. Bush presented local officials with a check for $2 million from the Bush-Clinton Katrina fund. The money will help run South Cameron Memorial Hospital once it has been rebuilt. Former ER (1994) star Clooney quipped, \"There is good news in all of this, which is that when the hospital gets up and running, I will not be doing any of the medical procedures\" (20 December 2006).\n\nIn 2007, he was ranked #13 on Entertainment Weekly's 'The 50 Smartest People in Hollywood'.\n\n\n\nIn 2007, Forbes Magazine estimated his earnings for the year at $25 million.\n\n\n\n\n\nSupported Senator Barack Obama 's bid to win the Democratic nomination for the 2008 presidential election.\n\n\n\nHe and his girlfriend, Sarah Larson , had an accident in 2007 while riding a motorcycle. She broke some toes, and Clooney broke a rib.\n\n\n\nMerited a place in Time magazine's \"100 Most Influential People in the World\" (Artists & Entertainers section) with a tribute written by Roseanne Barr (Issue May 12, 2008).\n\n\n\nHis palatial estate \"Villa Oleandra\" in Laglio overlooking Italy's Lake Como comprises 15 rooms, a wine cellar, and a master bedroom suite atop three floors. In his garage, Clooney keeps his collection of Piaggio motorbikes. Docked at his pier is a Colombo classic powerboat. Previously owned by philanthropist Drue Heinz, the former mother-in-law of Teresa Heinz Kerry , wife of US Secretary of State John Kerry , Clooney discovered the property when the was tossed from his Harley-Davidson motorcycle near the gates of the villa while touring the region in 2001. He purchased the estate for a reported EUR11.7 million in 2002.\n\n\n\nQuit the WGA in April 2008 after the union turned down his wish to be credited as a co-writer for Leatherheads (2008). He felt that he was let down by the union.\n\n\n\nHis favorite song is \"Destination Moon\" by Dinah Washington\n\n\n\nOn the DVD commentary for Good Night, and Good Luck. (2005), George Clooney says that shortly after he met Grant Heslov in 1982, Heslov loaned Clooney $200.00 to buy his first set of headshots, and they have been friends ever since (and later writing and producing partners).\n\n\n\nHis production company, Section 8 Productions, is named after Jamie Farr 's M*A*S*H (1972) character \"Maxwell Q Klinger\" (Klinger tried to get out of the army via a section 8).\n\nLives in Los Angeles, California.\n\n\n\n\n\nHe is known for his self-mocking sense of humor. The creators of South Park (1997) spoofed his Oscar acceptance speech in a South Park episode, and his political views in Team America: World Police (2004). Clooney commented that he would have been really disappointed, had he not been spoofed in the latter.\n\n\n\nHas an older sister named Adelia \"Ada\" Clooney Zeidler. She married the late Norman Monroe Zeidler, an artist and U.S. Army captain, who died of a heart attack in 2004. They have two children, Allison and Nick, who (until the 2017 birth of Amal and George Clooney's twins) were the only grandchildren of Nina and Nick Clooney\n\n\n\nAppeared on the cover of GQ magazine four times: March '95, October '97, November '98 (with Harrison Ford and Chris Rock ) and January '03.\n\n\n\nWas in a 2-year relationship with Italian actress Elisabetta Canalis (2009-2011).\n\nDuring the 2012 Newsweek Magazine Oscar roundtable, Clooney told a story about working for the women's shoe department of a Cincinnati, Ohio, department store in 1979. He said that it was fashionable at that time for some women to have their fourth toe surgically removed so that they could more easily fit into tight pumps and heels. He came to know which women had had this procedure done, and he always tried to pass those customers of onto his coworkers, since he found the sight of the deliberately missing toe so disturbing.\n\n\n\n\n\nHe and his father, Nick Clooney , were arrested, on March 16, 2012, for participating in a staged protest outside the Sudanese embassy in Washington, D.C.\n\n\n\nIs supporting President Barack Obama 's 2012 reelection campaign, and hosted a fundraiser for the President at his home on May 10, 2012. A record $15 million in contributions was raised.\n\n\n\nHas been friends with Sandra Bullock for around 25 years. They appear in a movie together for the first time in Gravity (2013).\n\nSuffers from a form of malaria that surfaces from time to time; he has to live with it for the rest of his life.\n\n\n\n\n\nIn Amsterdam (Netherlands) filming for Ocean's Twelve (2004). [May 2004]\n\nAppointed a U.N. \"Messenger of Peace\". [January 2008]\n\n\n\n\n\nIn 2002, he made a controversial joke about Charlton Heston getting Alzheimer's disease; for which he refused to apologize.\n\n\n\nIn the process of setting the mood at his home for his marriage proposal to fiancée Amal, George programmed a playlist of his legendary aunt Rosemary Clooney 's records including the apt, \"Why Shouldn't?\" (first verse: Why shouldn't I take a chance when romance passes by? / Why shouldn't I know of love? / Why wait around when each age has a sage who has sung / That upon this earth love is all that is really worth thinking of?).\n\n\n\nIs very closely related to the noted Republican president Abraham Lincoln. Lincoln's aunt is George Clooney's great-great-great-great grandmother. Which also makes him a distant cousin of Tom Hanks , via Lincoln's mother Nancy Hanks.\n\n\n\nHe gained 30 pounds for his Oscar winning role as Bob Barnes in Syriana (2005).\n\n\n\nHis wedding to Amal Clooney (Amal Alamuddin) cost an estimated $4.6 million.\n\n\n\nContinues to be good friends with Charlotte Rae\n\n\n\nExpecting twins with his wife, Amal Clooney [February 2017].\n\nIs the only person to have been nominated for an Oscar in 6 different categories. Best Picture for Argo (2013), Best Actor for The Descendents (2011), Up In The Air (2009) and Michael Clayton (2007), Best Adapted Screenplay for The Ides Of March (2011), Best Supporting Actor for Syriana (2005), and finally Best Director and Best Original Screenplay for Good Night And Good Luck (2005).\n\n\n\n\n\nCo-founded the popular drink brand \"Casamigos Tequila\" (house of friends) with friend and business partner Rande Gerber in 2013.\n\nAt 8 weeks he unknowingly and accidentally broke the \"12 week pregnancy rule\" when he told friend Matt Damon that he and his wife were expecting twins.\n\n\n\nAnnounced that he will co produce with John Madden, who will direct, Gates of Fire, based on the epic Greek Battle of Thermopylae in 480BC when 300 Spartan warriors held back rampaging soldiers from the Persian Empire for six days before being slaughtered.\n\n\n\nPlayed two unrelated movie characters with the last name Gates. Portrayed Lee Gates in \"Money Monster\" (2016) and Archie Gates in \"Three Kings\" (1999).\n\n\n\nGeorge and Amal Clooney welcomed 2 babies on 6th June 2017, Girl and boy Ella and Alexander Clooney.\n\n\n\nA renowned practical joker, of whom Brad Pitt is often a target, George Clooney revealed on The Graham Norton Show, that he had replaced the license plate frame on Brad Pitt's car with one that said, \"Fuck Cops.\" Of course, Pitt was pulled over by the LAPD.\n\n\n\nWith his partners sold their tequila brand Casamigos to Diageo Plc, a British multinational alcoholic beverages company for $1 Billion. [June 2017]\n\n\n\nHe is the only actor to have played Batman who hasn't also played a figure from The Bible.\n\n\n\nHe is close friends with Ben Affleck. Both have played Batman in live-action films.\n\n\n\nClooney was once related by marriage to the actor Dick Van Patten. Van Patten's younger sister, Joyce Van Patten, is the mother of Clooney's first wife, Talia Balsam.\n\n\n\nAs of November 2019, twelve of George Clooney's 91 acting credits on IMDb are for appearing in Nespresso commercials.\n\n\n\nPersonal Quotes (80)\n\n\n\n[discussing casting choices Mel Gibson and Nicolas Cage for Three Kings (1999) before he had signed] Luckily, both those guys were tied and gagged in my apartment, and that was a problem for the casting department.\n\nI don't like to share my personal life... it wouldn't be personal if I shared it.\n\n\n\n\n\n[on the fact he had nothing to do with the breakup of Julia Roberts and Benjamin Bratt ] I was too busy breaking up Tom and Nicole's marriage.\n\n\n\n[speaking about the 2003 start to the Iraq war] You can't beat your enemy anymore through wars; instead you create an entire generation of people revenge-seeking. These days it only matters who's in charge. Right now that's us -for a while, at least. Our opponents are going to resort to car bombs and suicide attacks because they have no other way to win. . . . I believe [Secretary of Defense Donald Rumsfeld ] thinks this is a war that can be won, but there is no such thing anymore. We can't beat anyone anymore.\n\nIt's not about an opening weekend. It's about a career, building a set of films you're proud of. Period.\n\n\n\nNinety percent of films are pretty mediocre, but they have a built-in audience and open on 3,000 screens.\n\n\n\n\n\nConfessions of a Dangerous Mind (2002) bombed. But I can take it. Most of the films I've done haven't done particularly well. I'm surprised I'm continuing to work.\n\nDirecting is really exciting. In the end, it's more fun to be the painter than the paint.\n\n\n\nI don't believe in happy endings, but I do believe in happy travels, because ultimately...you die at a very young age, or you live long enough to watch your friends die. It's a mean thing, life.\n\n\n\n\n\nWe've been trying to push our involvement within the studio system, sort of push the things that we've learned from foreign and independent films through the '80s and push those things back into the studio system. Like Out of Sight (1998) isn't your standard studio film by any means; Three Kings (1999) wasn't the standard Warner Bros. kind of film.\n\nDirectors are the captains of the ship, and it's your job as the lead actor to make sure that the rest of the cast understand that by doing whatever he says.\n\n\n\n\n\nSee, the first thing about actors is, you're just trying to get a job; and you audition and audition and you finally get them. And you still consider yourself an auditioning actor. I auditioned for One Fine Day (1996), I wasn't offered that. So you're still in that 'Hey, I'm just trying to get a job' thing. Then, you get to the point where, if you decide to do it, then they'll make the film. That's a different kind of responsibility, and it usually takes a couple of films to catch up. And then you have to actually pay attention to the kind of films that you're making.\n\n\n\nYou got to think of things at their worst, not at their best. And Out of Sight (1998) was the first time where I had a say, and it was the first good screenplay that I'd read where I just went, 'That's it.'And even though it didn't do really well box office-wise-we sort of tanked again-it was a really good film. And I realized from that point on that it was strictly screenplay first. And then it becomes easier, because once you eliminate the idea of doing a vehicle. . . believe me, there's nobody who's encouraging us to make these films, not agents, not . . . we're not getting paid for these things, and it's not like we're going to make a mint.\n\n\n\n[on making Ocean's Eleven (2001)] It was the easiest shoot ever for any actor, and we all knew it when we were doing it. We were like, it's never going to be better than this. He [director Steven Soderbergh ] was in hell because it was a really complicated film to put together. We were like, we're in Las Vegas, we go to work at one in the afternoon, and we gotta be done by six at night. Six hours of work. Steven was editing all night.\n\n\n\nI'm a hybrid. I succeed in both worlds. I hope that selling out on Ocean's Eleven (2001) is not such a bad deal. The trade-off is, I get to go make something uncommercial that will probably lose money.\n\n\n\nSteven [ Steven Soderbergh ] and I have a great relationship inside the studio system. We make the kinds of films we want and commercial films at the same time. Steven and I have lost a lot of money. We are way in the hole. But this is not a day job. I've got some cash. I have a nice house in Italy. I do OK.\n\nIt's true information is harder to get these days. When I was growing up there were three networks - three news shows, delivering the same information. You took that information into your home and you formed your own opinions. Now we have 130 channels. You go to the channel that plays to your belief pattern. We start with different sets of facts, it's more polarizing.\n\n\n\n\n\n[on Good Night, and Good Luck. (2005)] I'm not a snob, I like entertaining films as well. But when you do a film like this, or like Three Kings (1999) - films that get you in a bit of trouble - it's fun to open up a debate.\n\n[Responding to media reports that he had contemplated suicide following surgery] I think, if you listen to the piece, I certainly did not talk about wanting to kill myself. I was talking about the idea of living for years in that kind of pain. Please don't use my words out of context.\n\n\n\nAn acting career usually has about a shelf life of ten years before people get sick of seeing you. It's a good thing to have a job to fall back on and I really do enjoy directing.\n\n\n\nI doubt anybody gets taken seriously for very long. I'll be on some reality show in about six years going, Hey, I had a great year in 2006.\n\n\n\nPeople thought I was Tom and Nicole's bodyguard. They'd come up and go, \"Is it okay if I go up and ask for an autograph?' It was good. I'd charge 'em three bucks a person. Yeah, you gotta make some money off of that.\n\n\n\nI'm the flavor of the month.\n\n\n\nRun for office? No. I've slept with too many women, I've done too many drugs, and I've been to too many parties.\n\n\n\nI know what my limitations are as an actor, but my strength is putting myself into a well-written part. When I get in trouble is when I have to fix it, or when I have to carry it on personality.\n\n\n\n\n\nHere is my theory in debunking photographs in magazines. You know, the paparazzi photographs. I want to spend every single night for three months going out with a different famous actress. You know, Halle Berry one night, Salma Hayek the next, and then walk on the beach holding hands with Leonardo DiCaprio . People would still buy the magazines, they'd still buy the pictures, but they would always go, 'I don't know if these guys are putting us on or not.'\n\nYou never really learn much from hearing yourself talk.\n\n\n\nI don't live at full tilt the way I used to. You begin to hate waking up with the kind of hangover you get from going on huge benders with your buddies. Also, since my neck surgeries, I've been forced to take things easier and not beat up my body the way I used to. I'm more cautious.\n\n\n\nThe idea that every time you do a film you're supposed to be tortured confuses me. I mean, guys who say \"Oh, it's really tough, my character is really suffering\" - come on. For us, even in the rotten ones, we've had a good time. I don't think you have to suffer.\n\n\n\n\n\nWe're the ones who talked about AIDS when it was just being whispered. And we talked about civil rights when it wasn't really popular. This academy - this group of people - gave Hattie McDaniel an Oscar in 1939 when blacks were still sitting in the backs of theaters. I'm proud to be a part of this academy, proud to be part of this community, and proud to be out of touch.\n\nYou can only get so far without discernible talent - then you either work, or use cheap publicity tricks to keep the public's attention. Paris (Hilton) has no reason to complain if she is on the end of bad publicity.\n\n\n\n[on what makes a man stylish] For me, a sense of humor is number one. It's certainly what's most attractive. It's not the first thing you notice at 21, but it's the first thing you notice now. If celebrity is a credit card, I'm using my credit. My job is to try and find ways of talking about issues that move us forward. I don't make policy, but I can shine a light on faulty or good policy. The Not On Our Watch launch reached more than 9 million people. We need to focus global attention on the plight of the 2.5 million civilians who have fled their homes. Rather than talk about who I'm dating, let's talk about saving lives.\n\n\n\n[on celebrity activism] You don't want to be a spokesperson unless you are absolutely committed to a cause because you can hurt it. I've been asked to help represent environmental groups. I'm a big proponent of cleaning up the environment. I have two electric cars. But I also have a big weak spot because I've flown on private jets. However, I welcome any of these dumb pundits who make celebrities out to be bad guys to a discussion about Darfur. Because I've been there and I've met all the players, and I guarantee you the pundits haven't.\n\n\n\n\n\n[on who will win the Best Actor Oscar in 2008] If you want my honest opinion, I think it's going to be Daniel Day-Lewis [for There Will Be Blood (2007)]. He sort of irritates all of us because he's so good. I'll tell you right now, I don't like him!\n\n[on films made between 1964 and 1976] It's 12 years and you could find ten films a year that are masterpieces. They don't make those films anymore. You couldn't come near making those films.\n\n\n\n\n\nHad I not got the Thursday night ten o'clock slot at ER (1994), if they'd put us on Friday night, then I wouldn't have a film career. That's luck, not my own genius, though I like to think it was.\n\nI'm protected as an actor by a really good screenplay, number one; and then a really good director, number two; and then really good actors, number three - but first and foremost a good screenplay. You cannot make a good film out of a bad script. You can make a bad film out of a good script - easily. I've seen that happen before, but you can't do it the other way around; it always has to be the screenplay.\n\n\n\nI didn't become really successful until I was in my thirties. I can still remember sitting on the closet floor of my buddy's house, completely broke. My friends would want to go out to dinner, to get a hamburger, and I couldn't afford to go. They had the money to pay, but I didn't want them to pay. That happened a lot. At one point, I remember my buddy Brad loaning me a hundred dollars. He's now running our production company. I'm still paying that debt off, you know?\n\n\n\nHere's your options: Live long enough to watch your friends die, or die young. Now, I'm not pessimistic at all. I'm just saying I realize that's true. I don't want to see any of my buddies die, and I don't have any interest in dying young, either. But I had to come to terms with what I'm not going to do.\n\n\n\n\n\nI never thought Batman & Robin (1997) was going to be a great film. I thought it was a great opportunity for me. And suddenly we're filming. The script isn't together. I'm just miserable in the suit, trying to make scenes work. That's not the way to make a movie. The thing is, it took \"Batman & Robin\" to get to the point where I am now. When I got in a position to greenlight a picture and get the picture made, I really had to adjust my thinking. Because when you're an actor, you're thinking about getting good roles. You go, \"That's a great part!\" And you sign on to make the movie. Only now, those movies are being greenlit because you're doing them, and when the reviews come out, you're being held responsible not just for what you did in the film, but for the entire film. From here on in, I realised, it's my responsibility. If I'm going to blow it, if I'm going to bomb, it's going to be on my taste. So I started out doing Out of Sight (1998) and Three Kings (1999) and O Brother, Where Art Thou? (2000) and making only films I'd go see. Now, that doesn't always end well. Sometimes a movie doesn't work. But the lesson of \"Batman & Robin\" was a great one.\n\nI'd rather have a rectal examination on live TV by a fellow with cold hands than have a Facebook page!\n\n\n\nIf the movie makes money, I make money. If I don't, I've still made the movie I wanted to make.\n\n\n\nI never wear makeup for movies and now it's starting to show. It's funny, because most male actors work with actresses who are considerably younger. But earlier in my career I was working with a lot of actresses who were my age or older so people always thought I was older anyway; and now I'm going through this thing with people thinking I'm about 60. But I'm kind of comfortable with getting older because it's better than the other option, which is being dead. So I'll take getting older.\n\n\n\n[on the paranormal] I'm not a big believer in much of that. Everybody goes through déjà vu and things like that, but I don't really go for that stuff. I find it mostly to be coincidence.\n\n\n\n\n\n[on his friends keeping him grounded] I've got eight buddies: The Boys. They've been my friends for 20 years. Every Sunday we ride motorcycles and play basketball together. For Christmas this year, the boys came out and there were new bikes sitting out there-new Indians for each of them. The best part of having money is sharing it with your buddies. I lived on their closet floors when I was broke and they had money and were working. They've been through this whole ride with me. So now, when someone comes up to me and says, \"You're so brilliant,\" they look over at me and go, \"Man, can you believe that shit?\" I met them when I first moved out here, in acting classes. Richard Kind , who's on Spin City (1996), is one of them. When his father died of a heart attack, Richard called and said he was going to Trenton for the funeral. All the boys were immersed in work at that point and had no time, but I called them up and told them what happened. There were no commercial flights available, so I chartered a jet. We didn't tell him we were coming. We sat in the back of the synagogue and Richard was in front with his back to us. When he got up and started to talk about his dad, he saw us and started sobbing. He said, \"I'm sorry, but I just saw my best friends back there.\" There was this amazing feeling that every one of these guys had dropped everything just to be there. That's what it's like. People like that keep you sane. [2000]\n\nThe truth is, most actors I know aren't assholes. They often get that reputation because people around them are assholes. The people around you can treat people like shit and pretend they are doing it to protect you. Once, my assistant was rude to someone. I said, \"You know, you represent me when you talk to people.\" So you have to be careful. And that's not to say people don't treat people badly in this business. I once had lunch with a movie producer who was completely dismissive and rude to our waiter, which told me all I needed to know about him. I know that someone like that will be nice to me right now - I'm in a position where he wants to be nice to me, since he needs something from me. But what happens if I'm not in that position anymore? If he treats everyone else dismissively, he'll treat me dismissively. He isn't the type of person you want to work with. [2000]\n\n\n\n\n\n[n the downside of fame] In Los Angeles, there are a million famous people around, so you are left alone. They see Mel Gibson at the grocery store, so they're not impressed with me. But if you go to any other town and walk into a bar, you can never have a normal experience. Once people have a few drinks, they get brave. All of a sudden, there is a crowd of guys going, \"Dude!\" and hanging on to me. They want to buy me a drink and sit down and talk. But I've got my friends, see. I don't want a bunch of guys coming over to buy me drinks. The funny part is what I end up doing: I'm polite and I sit and talk to them. I wind up doing the things a girl would do in the same sort of situation at a bar. [2000]\n\nI'm different from a lot of guys. I don't go up to girls I don't know in a bar and ask them to dance. I never have. Never. I've never gone up to somebody I don't know and asked them out. I just won't do it and never did, because I never wanted to take my ego, as fragile as any guy's, and hand it to some girl so that she could demolish it. To me it has always seemed like a stupid thing to do. So in terms of, like, \"Hey, you want to go out?\" I don't do it. [2000]\n\n\n\n\n\n[on fame] Here's an example of how it works. I had never been to the Playboy Mansion and really wanted to go. When I finally did, it was for one of the Mansion's pajama parties, where I was hanging out with Leonardo DiCaprio and Jim Carrey . We were all sort of protecting one another; you don't want to seem like you're desperate. I grew up with the magazine, so naturally I wanted to see the Grotto. When I got there, I was cornered by about 15 people, most of them pretty girls. But it's not like you might imagine. Instead, they all wanted to have their picture taken with me. When that happens, it's like you're a cardboard cutout for people to stand next to. It's not like talking to a girl and getting to know her. At the height of it, when there were people pulling at me from every direction and it was at its most embarrassing, some guy comes over and says, \"Look at this shit, man! You got it made! Chicks are all over you.\" Meanwhile, I was thinking how much easier it was before this. Then it was just about being a guy talking to a girl and all the other stuff that's so interesting about dating-that dance you do. You see somebody at a party and lock eyes and eventually get closer and closer to each other. Somehow you find a way to talk and maybe-all that stuff. That's a turn-on. That has been taken away from me. If you were to ask what I miss about the anonymity that I used to have, it's that experience, that slow and natural getting to know someone - that kind of electricity. [2000]\n\nI'm a 39-year-old man. In the way I was raised, this is the time when you make your mark. In your 20s, you figure out what it is you're going to be. You do a lot of different jobs. By your late 20s, you sort of have some idea of what it is. Then you spend your 30s and a lot of your 40s making your mark. You spend your 50s being able to reap the benefits of the work that you've done. [2000]\n\n\n\nIn college, I basically partied a lot. You gotta understand. We're a very strict Catholic family. Curfew was at nine p.m. when I was a senior in high school. So I got out of the house and thought, Oh my God! People don't ever really like to talk about this anymore, but there was a period of time when blow was considered OK, like it won't hurt you at all. It was almost mainstream. All the designer drugs were OK-Quaaludes and blow. So that was the time in college for me: Drugs and chasing girls. I came from a town of 1500 people to Cincinnati. I would visit class every once in a while and stop by and go, \"How's everybody doing?\" I was still a responsible kid, but I didn't take school seriously. I had jobs. I sold men's suits and shoes and worked in stockrooms of department stores, and I cut tobacco when it was the season. I was paying for my thing along the way. But I quit school.\n\n\n\n\n\n[on a part he wished he had gotten] The part that Brad Pitt played in Thelma & Louise (1991). It was down to three actors, including Brad and me, at one time. I read about five times with Geena Davis . I thought I was going to get it, but Brad did. The part catapulted him. I didn't watch the movie for a couple of years and then rented it on tape one night. I watched it and, of course, he's perfect in the role, better than I would have been. [2000]\n\n\n\n[on working with David O. Russell on Three Kings (1999)] He'd throw off his headset and scream, \"Today the sound department fucked me!\" For me, it came to a head a couple of times. Once, he went after a camera-car driver who I knew from high school. I had nothing to do with his getting his job, but David began yelling and screaming at him and embarrassing him in front of everybody. I told him, \"You can yell and scream and even fire him, but what you can't do is humiliate him in front of people. Not on my set, if I have any say about it\". Another time, he screamed at the script supervisor and made her cry. I wrote him a letter and said, \"Look, I don't know why you do this. You've written a brilliant script, and I think you're a good director. Let's not have a set like this. I don't like it and I don't work well like this\". I'm not one of those actors who likes things in disarray. He read the letter and we started all over again. But later, we were three weeks behind schedule, which puts some pressure on you, and he was in a bad mood. These army kids, who were working as extras, were supposed to tackle us. There were three helicopters in the air and 300 extras on the set. It was a tense time, and a little dangerous, too. David wanted one of the extras to grab me and throw me down. This kid was a little nervous about it, and David walked up to him and grabbed him. He pushed him onto the ground. He kicked him and screamed, \"Do you want to be in this fucking movie? Then throw him to the fucking ground!\" The second assistant director came up and said, \"You don't do that, David. You want them to do something, you tell me\". David grabbed his walkie-talkie and threw it on the ground. He screamed, \"Shut the fuck up! Fuck you\", and the AD goes, \"Fuck you! I quit\". He walked off. It was a dangerous time. I'd sent him this letter. I was trying to make things work, so I went over and put my arm around him. I said, \"David, it's a big day. But you can't shove, push or humiliate people who aren't allowed to defend themselves\". He turned on me and said, \"Why don't you just worry about your fucked-up act? You're being a dick. You want to hit me? You want to hit me? Come on, pussy, hit me\". I'm looking at him like he's out of his mind. Then, he started banging me on the head with his head. He goes, \"Hit me, you pussy. Hit me\". Then, he got me by the throat and I went nuts. Waldo, my buddy, one of the boys, grabbed me by the waist to get me to let go of him. I had him by the throat. I was going to kill him. Kill him. Finally, he apologized, but I walked away. By then, the Warner Bros. guys were freaking out. David sort of pouted through the rest of the shoot and we finished the movie, but it was truly, without exception, the worst experience of my life.\n\n\n\nWhen I first started out in television, I took any job that came along. It was, 'Let's just get a job, any job'. I fought to get ER (1994) and I got it and it changed my life. Then, when I started doing movies, the same thing happened. At first, I did anything that I could get. But I learned. In TV, I learned to focus on the script, but I didn't apply that lesson to movies. But the cliché is true: You can take a good script and make a bad movie. But you can't take a bad script and make a good movie. [2000]\n\n\n\nI love Spencer Tracy . Love him. He's a hero of mine. I heard he never wore makeup, so I've never worn makeup, ever. I won't put it on in any movie. I'm dark complexioned, so I can get away with it. I cut my own hair. It's sort of still being scrappy. It makes you feel like a guy still. I still can take my motorcycle apart and put it back together again. It keeps you feeling like you're still a guy. You have to fight for that. What happens when you're famous is that you get a flat tire and come back and your assistants have fixed it for you. You'll come into a bar and it's really fun and exciting and a guy comes over and says, \"Mr. Clooney, come with us\", and they take you to a private room in the back. You're thinking, I don't want to be in here. I want to be out there. What the fuck am I doing in here? So you have to fight it as much as you can. It's possible to be a guy with your friends. You get on your motorcycles, you head out on the road. It's as good as it gets. [2000, Playboy Magazine]\n\n\n\n[on The Ides of March (2011)] It's not a bad thing to hold a mirror up and look at some of the things we're doing [politically]. Everybody makes moral choices that better themselves and hurt someone else. And then we look at whether the means justify the ends. So The Ides of March could've been literally set in Wall Street.\n\nThat ego issue, which is always an interesting thing. What happens is, you get a modicum of success, and then it becomes about the strangest shit you've ever seen. I am from Kentucky, okay? We try not to live in trailers. That is not something that...we don't brag about being in a double wide, or the largest trailer. And all of a sudden, somebody will come up on the set--and I've had this happen, where it's like, they're upset because their trailer isn't the same size. And you go, 'take my trailer,' because, honestly, that's not what I would consider something to brag about. And it becomes about certain things, and oftentimes it is people who haven't experienced it for a period of time, or people who are trying to hold on to something...being in a trailer is not fun. [2012, Newsweek Magazine Oscars Roundtable]\n\n\n\n\n\n[on Paul Newman 's performance in The Verdict (1982)] That was the first time I was very aware of good acting.\n\n[on his support for President Obama's reelection] I fund raised for him [in 2008] I didn't do any campaigning. I really don't think it helps to have well-known, famous people campaigning for you, but you can do fund raisers. I'm a Democrat, I'm a believer in him, I feel like he's done a wonderful job and I think he's having a tough time in a very difficult environment. So I root for him, I root for the President of the United States.\n\n\n\n[on working with the Coen Brothers] There's rarely a re-write on a Coen brother movie. The script they write is what we shoot. And it's great.\n\n\n\nI'm trying to make movies in my life... that last longer than opening weekend. That's it, that's my whole goal. I don't have to make money; I do films for scale and then, you know, I go do coffee commercials overseas, and I make a lot of money so I get to live in a nice house. ... And I don't give a shit. And people will go, 'Oh that's a sellout.' And you know what? Fuck you.\n\n\n\n[on funding a spy satellite to monitor the activities of Sudanese president Omar al-Bashir] I want the war criminal to have the same amount of attention that I get.\n\n\n\nIt's hard when you get thumped. I've been proficient at failure. But the only thing you can do is say, \"Here's what I won't do next time.\" I was a baseball player in school. I had a good arm, I could catch anything, but I was having trouble hitting. I would be like, \"I wonder if I'll hit it; just let me hit the ball.\" And then I went away for the fall, learned how to hit, and by my sophomore year I'd come to the plate and think, \"I wonder *where* I want to hit the ball, to the left or right?\" Just that little bit of skill and confidence changed everything. Well, I had to treat acting like that. I had to stop going to auditions thinking, \"Oh, I hope they like me.\" I had to go in thinking I was the answer to their problem. You could feel the difference in the room immediately. The greatest lesson I learned was that sometimes you have to fake it. And you have to be willing to fail.\n\n\n\nI did not attend a private boys' school, I worked in tobacco fields and in stock rooms, and construction sites. I've been broke more of my life than I have been successful, and I understand the meaning of being an employee and how difficult it is to make ends meet.\n\n\n\nWhen you're young you believe it when people tell you how good you are. And that's the danger, you inhale. Everyone will tell you you're a genius, which you are not, and if you understand that, you win.\n\n\n\n\n\nI watch Batman & Robin (1997) from time to time. It's the worst movie I ever made, so it's a good lesson in humility.\n\n[on Britain's Daily Mail] The worst kind of tabloid. One that makes up its facts to the detriment of its readers and to all the publications that blindly reprint them.\n\n\n\n\n\n[on his marriage to Amal Clooney ] I have someone who I can talk to about anything and someone who I care more about than I've cared about anybody, so it's really nice.\n\n\n\n[his response to the question asked by a student on Inside the Actors Studio (1994): \"When you first started out and you were getting rejected what did you find was the most effective method for you to prove that you were the right person for the role?\"] That's the funny thing, you can't prove you are the right person for the role, that's one thing actors can never understand and I couldn't either what you have to remember about this is: the product you're selling is \"you\", this is the difference to any other business we're all salesmen the product you're selling is extremely and completely personal, it's you, if you're selling vacuum cleaners, you can say \"I have another one here if you don't like that one\" or if you're selling suits you'd say, \"if you don't like that suit here's another suit\", so when they say \"they don't want you\", it literally means they don't want \"you\" personally, and it hurts and it costs you something every time, the reason why actors are celebrated when they become celebrities is because they're taking risks that other people wouldn't take because it's embarrassing and humiliation is one of the greatest fears in the world actors risk humiliation every time they audition so you're going to have a tough thick skin and keep telling yourself \"I still think I'm on the right track and I'm going the right way\", you'll succeed as long as you're confident because you're also selling your coincidence, so good luck.\n\n[describing his work ethic] When I make a movie, it,s four months out of my life. If I'm directing, it's a year or two out of my life. I'm going to enjoy what I do for a living first and foremost: I want to make a good film, secondly, I'm not going to work on a set where people are yelling, screaming and unhappy, thirdly, I am in the luckiest business in the world I'm very aware of \"catching the brass ring\". I'm very aware of the fact that if not for a Thursday night time slot on ER, I would't have this career, I'm very aware of that so I'm going to enjoy it to push the limits as much as I can, in terms of the kind of work I can do, the kind of films I can make.\n\n\n\nI always apologize for Batman!\n\n\n\n\n\n[2016, when Bernie Sanders supporters protested outside his fundraiser for Hillary Clinton ] Their T-shirts said, you know, 'You sucked as Batman.' And I was like, 'Well, you kind of got me on that one.'\n\nAt 52 I found the love of my life, I've never been happier in a relationship by any stretch of the imagination. Oftentimes, I feel like an idiot talking to my own wife.\n\n\n\nOver the last week photographers from Voici magazine scaled our fence, climbed our tree and illegally took pictures of our infants inside our home. Make no mistake the photographers, the agency and the magazine will be prosecuted to the full extent of the law. The safety of our children demands it.[July 2017]\n\n\n\n\n\n[on being criticized as 'Hollywood elite' by Donald Trump and his supporters] Here's the thing: I grew up in Kentucky. I sold insurance door-to-door. I sold ladies' shoes. I worked at an all-night liquor store. I would buy suits that were too big and too long and cut the bottom of the pants off to make ties so I'd have a tie to go on job interviews. I grew up understanding what it was like to not have health insurance for eight years. So this idea that I'm somehow the 'Hollywood elite' and this guy [Trump] who takes a s--- in a gold toilet is somehow the man of the people is laughable. People in Hollywood, for the most part, are people from the Midwest who moved to Hollywood to have a career. So this idea of 'coastal elites' living in a bubble is ridiculous. Who lives in a bigger bubble? He [Trump] lives in a gold tower and has 12 people in his company. He doesn't run a corporation of hundreds of thousands of people he employs and takes care of. He ran a company of 12 people! When you direct a film you have seven different unions all wanting different things, you have to find consensus with all of them, and you have to get them moving in the same direction. He's never had to do any of that kind of stuff. I just look at it and I laugh when I see him say 'Hollywood elite.' Hollywood elite? I don't have a star on Hollywood Boulevard, Donald Trump has a star on Hollywood Boulevard! [Sept. 2017]\n\n[2012] My grandparents back in Kentucky owned a tobacco farm. So to make money in the summer we could cut and chop and top and house and strip the tobacco. It sure made you not want to smoke. [Norman Lear: You never smoked?] No, never. You know I had 10 great aunts and uncles on my father's side, and six of them died of lung cancer. Rosemary [Clooney's aunt] died of lung cancer, too, and she has emphysema. Both of my grandparents died of lung cancer. So I got quite a lesson in the payback later in life of smoking, and if you keep it up how bad it can be.\n\n\n\nThere's not going to be a President Donald Trump. Fear is not going to drive our country. We're not afraid of Muslims or immigrants or women. We're not going to be afraid of anything.\n\n\n\n[on Harvey Weinstein's alleged sexual misconduct] It's disturbing on a whole lot of levels, because there had to be a lot of people involved in covering that up\n\n\n\n[on Harvey Weinstein's alleged sexual misconduct] It's indefensible. A lot of people are doing the 'you had to know' thing right now, and yes, if you're asking if I knew that someone who was very powerful had a tendency to hit on young, beautiful women, sure. But I had no idea that it had gone to the level of having to pay off eight women for their silence, and that these women were threatened and victimized\n\n\n\nSalary (19)", "images": ["http://fls-na.amazon.com/1/batch/1/OP/A1EVAM02EL8SFB:134-6880919-1355941:V5PW2MGJA3Q8R07P0SGH$uedata=s:%2Fgp%2Fuedata%3Fstaticb%26id%3DV5PW2MGJA3Q8R07P0SGH:0", "https://m.media-amazon.com/images/M/MV5BMjEyMTEyOTQ0MV5BMl5BanBnXkFtZTcwNzU3NTMzNw@@._V1_UY1200_CR126,0,630,1200_AL_.jpg", "https://m.media-amazon.com/images/G/01/imdb/IMDbConsumerSiteNameProViews/images/icons/link-287357576._CB466942446_.png", "https://m.media-amazon.com/images/M/MV5BMjEyMTEyOTQ0MV5BMl5BanBnXkFtZTcwNzU3NTMzNw@@._V1_UY98_CR2,0,67,98_AL_.jpg", "https://m.media-amazon.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB466677935_.png", "http://fls-na.amazon.com/1/batch/1/OP/A1EVAM02EL8SFB:134-6880919-1355941:V5PW2MGJA3Q8R07P0SGH$uedata=s:%2Fgp%2Fuedata%3Fnoscript%26id%3DV5PW2MGJA3Q8R07P0SGH:0"], "top_img": "https://m.media-amazon.com/images/M/MV5BMjEyMTEyOTQ0MV5BMl5BanBnXkFtZTcwNzU3NTMzNw@@._V1_UY1200_CR126,0,630,1200_AL_.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.imdb.com/name/nm0000123/bio", "title": "George Clooney", "meta_data": {"apple-itunes-app": "app-id=342792525, app-argument=imdb:///name/nm0000123?src=mdot", "og": {"url": "http://www.imdb.com/name/nm0000123/bio", "image": "https://m.media-amazon.com/images/M/MV5BMjEyMTEyOTQ0MV5BMl5BanBnXkFtZTcwNzU3NTMzNw@@._V1_UY1200_CR126,0,630,1200_AL_.jpg", "type": "actor", "title": "George Clooney - IMDb", "site_name": "IMDb", "description": "George Timothy Clooney was born on May 6, 1961, in Lexington, Kentucky, to Nina Bruce (née Warren), a former beauty pageant queen, and Nick Clooney, ..."}, "theme-color": "#000000", "pageId": "nm0000123", "pageType": "name", "subpageType": "bio", "fb": {"app_id": 115109575169727}, "title": "George Clooney - IMDb", "description": "George Timothy Clooney was born on May 6, 1961, in Lexington, Kentucky, to Nina Bruce (née Warren), a former beauty pageant queen, and Nick Clooney, ...", "keywords": "Biography, Photos, Awards, News, Message Boards", "request_id": "V5PW2MGJA3Q8R07P0SGH"}, "movies": [], "publish_date": null, "source": "http://www.imdb.com", "summary": ""}