{"url": "time.com/5040781/megyn-kelly-matt-lauer-fired/", "text": "NBC anchor Megyn Kelly opened the top of her show on Today Wednesday by addressing the termination of her colleague Matt Lauer for sexual misconduct allegations, acknowledging the shock of the announcement but highlighting the bravery of those who came forward.\n\nBefore Kelly spoke about her personal experience with Lauer, she read the official statement from the network and showed the comments from Lauer’s former co-host Savannah Guthrie and Hoda Kotb, who was hosting in place of Lauer on Wednesday.\n\n“This one does hit close to home,” Kelly said, referring to Lauer’s firing. “I too have known Matt for a long time, and he has been a friend, and kind and supportive to me in my transition to NBC News and I see the anguish on my colleague’s faces.”\n\n“But when this happens,” Kelly continued, “What we don’t see is the pain on the faces of the women who found the courage to come forward. And it is a terrifying thing to do. We don’t see the career opportunities women lose because of sexual harassment or the intense stress it causes a woman dealing with it when she comes to work each day. I am thinking of those women this morning and hoping they are okay. The days to come will not be easy.”\n\nNBC News announced Wednesday morning that Lauer, who had anchored the Today Show for more than two decades, had been fired following accusations of sexual misconduct. “While it is the first complaint about his behavior in the over twenty years he’s been at NBC News, we were also presented with reason to believe this may not have been an isolated incident,” NBC News Chairman Andrew Lack said in a statement.\n\nKelly, who was at Fox when sexual harassment allegations against now deceased chairman Roger Ailes emerged, said she is confident NBC will weather the storm.\n\n“The good [news organizations] stay standing and forge forward, fulfilling their core mission: Journalism,” she said.\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Alana Abramson at Alana.Abramson@time.com.", "images": ["https://api.time.com/wp-content/uploads/2017/11/matt-lauer-megyn-kelly.jpg?quality=85&w=1200&h=628&crop=1", "https://api.time.com/wp-content/uploads/2020/04/THTH_103_Portraits_01423R2.jpg?quality=85&w=600", "https://api.time.com/wp-content/uploads/2020/04/cnn-chris-cuomo-interview.jpg?quality=85&w=600", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2017/11/matt-lauer-megyn-kelly.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Alana Abramson"], "canonical_link": "https://time.com/5040781/megyn-kelly-matt-lauer-fired/", "title": "Megyn Kelly Reacts to NBC Firing Today Show's Matt Lauer", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "matt lauer, megyn kelly, matt lauer fired, matt lauer terminated, what did matt lauer do, matt lauer nbc, matt lauer today show, matt lauer savannah guthrie, matt lauer megyn kelly, megyn kelly today", "news_keywords": "matt lauer, megyn kelly, matt lauer fired, matt lauer terminated, what did matt lauer do, matt lauer nbc, matt lauer today show, matt lauer savannah guthrie, matt lauer megyn kelly, megyn kelly today", "description": "Megyn Kelly opened her Today show by addressing the termination of her colleague Matt Lauer, who was accused of sexual misconduct", "og": {"title": "Megyn Kelly Reacts to Matt Lauer's Termination From NBC", "type": "article", "site_name": "Time", "url": "https://time.com/5040781/megyn-kelly-matt-lauer-fired/", "description": "\"This one does hit close to home\"", "image": {"identifier": "https://api.time.com/wp-content/uploads/2017/11/matt-lauer-megyn-kelly.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5040781/megyn-kelly-matt-lauer-fired/", "description": "Megyn Kelly opened her Today show by addressing the termination of her colleague Matt Lauer, who was accused of sexual misconduct", "media": "https://api.time.com/wp-content/uploads/2017/11/matt-lauer-megyn-kelly.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5040781/megyn-kelly-matt-lauer-fired/", "title": "Megyn Kelly Reacts to Matt Lauer's Termination From NBC", "description": "\"This one does hit close to home\"", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2017/11/matt-lauer-megyn-kelly.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}