{"url": "https://www.usatoday.com/story/life/movies/2018/02/19/exclusive-set-visit-wrinkle-time-oprah-winfrey/340011002/", "text": "SANTA CLARITA, Calif. – Oprah Winfrey, Reese Witherspoon and Mindy Kaling, bejeweled and festooned in fantastical garb, are peering over a young teen who lies crumpled on the ground.\n\n“She’s giving in to the darkness,” says a hushed Winfrey, whose eyebrows have been replaced with clusters of purple gemstones.\n\n“Breathe, sweetie,” coaxes a flame-haired Witherspoon, as a regally costumed Kaling looks on, worried. Storm Reid, then 13 and playing A Wrinkle in Time’s protagonist, Meg Murry, flutters her eyes.\n\nMore:These images from 'A Wrinkle in Time' will make you emotional\n\nRelated:10 books to read before they become movies in 2018\n\n“This is a life or death situation,\" calls out director Ava DuVernay from behind a monitor. \"And, action!”\n\nA Wrinkle in Time, the sci-fi adventure about a teen who combs the universe for her missing father, will hit theaters March 9 — 56 years after author Madeleine L'Engle debuted her sci-fi novel, a work that defied skeptics by featuring both quantum physics and a young girl at its center.\n\nL'Engle's mind-bending fantasy, which employs three astral travelers as the girl's guides (Mrs. Which, played by Winfrey; Mrs. Whatsit, played by Witherspoon; and Mrs. Who, played by Kaling), went on to become Newbery Medal-winning required reading in many schools.\n\nNow, Disney's Wrinkle is cracking Hollywood’s glass ceiling, marking the first time any studio handed a budget of $100 million or more to a woman of color.\n\nDuVernay’s inclusive worldview is reflected throughout Wrinkle. In L'Engle's book, Meg Murray is a white teenager from Connecticut; in the film she's an African-American girl from South Central L.A. who comes from an interracial family. The latter is “never commented on, which I think is great,” says a bearded Chris Pine, who plays Meg’s astrophysicist father.\n\nThe director also shifted away from the all-white Mrs. characters in L'Engle's book, instead assembling Winfrey, Kaling and Witherspoon as Meg's galactic guides. “I just started to think about really wanting to represent different kinds, cultures, sizes, ages of women,” DuVernay says.\n\nWhen Winfrey read the script by Frozen's Jennifer Lee, she was taken with \"Ava’s idea for inclusion, diversifying, opening it up so that the Mrs. are not all like Mrs. Doubtfire, little New England biddies, but this eclectic group of star angels who have their own way of being in the world. That was really kind of thrilling to me.\"\n\nKaling, DuVernay adds, “is a piece of the puzzle that is so important, because when we talk about inclusion in this country we say black and white, and we forget all the other people. The three of them together are quite formidable in what they represent for women at large.”\n\nToday, a Girl Scout cookie drive adds an earthly touch on a soundstage cloaked in massive, saturated blue sheets, onto which the computer-generated world of Wrinkle will be overlaid. (DuVernay tosses a box of cookies to Reid once the scene wraps.)\n\nCameras roll, and Reid pretends to struggle to breathe as Winfrey and cast stand in position on sheets of glass made to look like an iceberg.\n\nDuVerney squints at the screen.\n\n“You’ve got fingerprints I can see all around her,” she says. “It’s supposed to be ice.” A female production assistant runs in, wiping the surface down. The director, dressed in jeans and a black sweatshirt, joins in on hands and knees, pointing out prints to wipe.\n\nMore:Oprah wears the most amazing outfits in 'Wrinkle in Time' trailer\n\nAlso:10 must-see films of 2018, from the new 'Fantastic Beasts' to 'Mary Poppins'\n\nDuVernay stays on the floor with Reid, softly talking to the young actress, who is playing her first major role. “All right?” she says. The teen nods. “Let’s get another (take),\" says the director.\n\nOnce they wrap, Winfrey regally ambles by in her metallic blue lipstick, a blond curly wig and a massive geometric skirt. Today is the second day Pine has worked alongside the mogul. “It’s so cool, man,” he says. “We talked books together the other day,\" trading recommendations. (His was Anthony Doerr's All the Light We Cannot See.)\n\nEmbodying Mrs. Which is no joke: It takes two aides to hold Winfrey up as she inches in platform heels toward her tent. “It is a THING,” she says a few minutes later of her getup, while leaning precariously on a stool. “Two people have to help me sit. Three people help me get dressed. Or was it four this morning?”\n\nAt night, she says, \"it takes me at least a half-hour just to get (Mrs. Which's makeup) off. See, my own eyebrows are covered, they’re glued down. Those makeup removal pads, I use like 10 of those first, then a makeup remover thing, and then you start the whole washing process.\"\n\nGet down to brass tacks, and Winfrey acknowledges she didn’t expect to be here. “I never planned on being in A Wrinkle in Time. It came about because Ava said (the movie was) going to be shooting in New Zealand,\" where production moves the following week. \"I always wanted to go to New Zealand!”\n\nMore:10 major milestones for women behind the camera in Hollywood\n\nEarlier:Reese Witherspoon: 'I have 3 legs'; Oprah Winfrey: 'I know you accept my 3d hand'\n\nSo much so that Winfrey blocked out Wrinkle’s shooting dates on her calendar to hang out and be a spectator. It was only then that DuVernay, who generally avoids asking Winfrey for favors, asked her to read the script. Winfrey fell for Mrs. Which, a character she calls sort of a Glinda the Good Witch imbued with the wisdom of Maya Angelou.\n\nAnd now, she’s stuck. Literally.\n\n“I can’t move my arms. Oh, I’m caught,” Winfrey sighs. “This happens all day long.”\n\nWhat does Winfrey do when she goes home after a day on set in full hair and makeup?\n\n\"I will open the refrigerator in my hotel and get a bad glass of wine. You know, the kind with the cap on it.\" She laughs. \"And take a hot bath and (the next day) start all over again.\"", "images": ["https://media.gannett-cdn.com/29906170001/29906170001_5700444258001_5700406105001-vs.jpg?pubId=29906170001&width=660&height=372&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/13e91021ee7e2fe7c62a54fe4ec9f15d9f63fecc/c=0-0-2996-1693/local/-/media/2018/02/18/USATODAY/USATODAY/636545819819330174-AWIT-05462.jpg?width=2996&height=1693&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/13e91021ee7e2fe7c62a54fe4ec9f15d9f63fecc/c=0-0-2996-1693/local/-/media/2018/02/18/USATODAY/USATODAY/636545819819330174-AWIT-05462.jpg?width=2996&height=1693&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/movies/2018/02/19/exclusive-set-visit-wrinkle-time-oprah-winfrey/340011002/", "title": "Exclusive: Go behind the scenes of 'A Wrinkle in Time' with Oprah Winfrey", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Exclusive: Go behind the scenes of 'A Wrinkle in Time' with Oprah Winfrey", "description": "Ava DuVernay's sci-fi adventure, adapted from the beloved Madeleine L'Engle novel, hits theaters March 9. We've got your exclusive access.", "url": "https://www.usatoday.com/story/life/movies/2018/02/19/exclusive-set-visit-wrinkle-time-oprah-winfrey/340011002/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/13e91021ee7e2fe7c62a54fe4ec9f15d9f63fecc/c=0-0-2996-1693/local/-/media/2018/02/18/USATODAY/USATODAY/636545819819330174-AWIT-05462.jpg?width=2996&height=1693&fit=crop&format=pjpg&auto=webp", "width": 2996, "height": 1693}, "type": "article"}, "article": {"author": "Andrea Mandell", "content_tier": "free", "opinion": "false"}, "description": "Ava DuVernay's sci-fi adventure, adapted from the beloved Madeleine L'Engle novel, hits theaters March 9. We've got your exclusive access.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/13e91021ee7e2fe7c62a54fe4ec9f15d9f63fecc/c=0-0-2996-1693/local/-/media/2018/02/18/USATODAY/USATODAY/636545819819330174-AWIT-05462.jpg?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Exclusive: Go behind the scenes of 'A Wrinkle in Time' with Oprah Winfrey", "description": "Ava DuVernay's sci-fi adventure, adapted from the beloved Madeleine L'Engle novel, hits theaters March 9. We've got your exclusive access."}}, "movies": [], "publish_date": 1518969600.0, "source": "https://www.usatoday.com", "summary": ""}