{"url": "https://www.fastcompany.com/40581074/oceans-8-star-awkwafina-is-stealing-the-show-on-all-fronts", "text": "It’s poetic justice that the pickpocket in Ocean’s 8 handily steals every scene she’s in. Constance has a few killer moments in a crowded heist movie, and leaves the audience wanting more.\n\nadvertisement\n\nadvertisement\n\nThey won’t be waiting long. At a recent Ocean’s 8 screening in Manhattan, the performer who plays Constance, Awkwafina, described herself as “the least important person in this room.” (In her defense, said room also contained Mindy Kaling, Cate Blanchett, Sandra Bullock, and Anne Hathaway.) Awkwafina (real name Nora Lum) thrives on self-deprecating humor, but even she seems aware that her perceived importance is surging by the day. Beyond the powerhouse, Bechdel Test-obliterating Ocean’s 11 reboot, the well-hyphened Awkwafina is blowing up in every direction, with new movies, music, and a TV show on the way. Pretty soon, there will be far fewer rooms she enters in which she isn’t the attentional bullseye dead center. The room where I meet Lum is tucked inside the lavish Whitby Hotel in midtown. It’s nearly big enough to run laps in. She seems laid back and comfortable occupying this space and holding court with interviewers, though, even if she quickly cops to being stunned by the star treatment. “Yesterday, I had a designated security guard named Phil,” she says, shaking her head in a mild daze. “This whole thing has been insane.” The Queens native first began to sow her creative oats at LaGuardia High School, forever known as the Fame school, where she dabbled in a little bit of everything artistic. Going to the school also opened up the city for her beyond Queens, exposing New York’s heavy-beating cultural heart. Lum came up with the sobriquet Aquafina at 16, just because she liked the way it sounded. She wouldn’t actually adopt it (or change the spelling for legal purposes) until years later. She also started making beats on her MacBook around this time, influenced by hometown heroes like A Tribe Called Quest. Today, Lum seems half-proud, half-embarrassed that the thing that ultimately changed her life was a three-minute rap called “My Vag.” Considering that her breakout movie role is in a gender-flipped reboot, it’s fitting that her first song was a feminized reimagining of Mickey Avalon’s raunch-rap anthem, “My Dick.” She wrote “My Vag” early in college, then kept it on ice for five years, as she tried to figure out what to do with her life.\n\nadvertisement\n\n“I was just kind of slumming it,” she says. “I didn’t know if I could make ‘Awkwafina’ work.” She spent time behind the counter of a bodega. She worked for a while at an air conditioning company. She did a bunch of under-the-table odd jobs, and had stints at a major Japanese restaurant and in a publishing house publicity department. She was stationed at her most comfortable office job yet when, in 2012, she finally decided to make a real run at Awkwafina. Lum worked with director Court Dunn to make the legit-looking video for “My Vag.” Awkwafina’s debut is a delightful absurdity that alternates between rooftop stunting and a G-rated gynecological excavation, where the star extracts a Big Gulp and way too much police tape from a woman in stirrups. Worried that her employers would recognize her, Lum donned a pair of disco glasses to obscure her face, creating part of what became her signature look. She comes across in the video as equal parts ultrahip NYC club kid and approachable goofball. When “My Vag” came out, the creator sat watching viewer stats rise like a stock ticker: 100, 4000, 70,000. Perhaps they’d climb high enough to lead to something, the demand for more music at the very least. (The tally now stands at 2.4 million views.) Before she could figure out her next move, though, her employer did recognize her from the viral video and she got fired. It was more of a boost than a blow, injecting Lum with a no-plan-B sense of urgency. She had a brand now, and a calling card. Awkwafina was a go. “It all happened very quickly,” she says. “My phone just started ringing. That video hit way harder than I ever thought.” Other videos followed, but Lum didn’t wait long before seizing her first opportunity to branch out. The production company Astronauts Wanted, which worked with Vine celebrities like Cameron Dallas and Nash Grier, reached out and asked if she had any ideas. She did. She imagined an Awkwafina talk show, where she would vamp around New York City, interviewing homeless people and prostitutes. Astronauts Wanted assured her that was not possible. They compromised, though, and created Tawk, a show for Verizon go90 where Lum interviewed comedians and actors like Phoebe Robinson and Alia Shawkat in between sketches and rap interludes. The roving talk show filmed in bodegas on the Lower East Side or laundromats in Bushwick. It gave fans of her rapping a chance to hear her sandpaper-raspy speaking voice and see her ecstatic, IDGAF dance moves.\n\nadvertisement\n\nLum quickly became super busy, making her 2014 album, Yellow Rangers, while also working on her talk show and somehow finding the time to write a book, Awkwafina’s NYC. She also got cast on MTV’s comedy advice show, Girl Code. From an early age, Lum had always wanted to be on television; now she was. She hadn’t really considered acting as a career possibility, though, at least not until Seth Rogen and some fellow producers saw the video for “My Vag,” and thought Lum should be in Neighbors 2: Sorority Rising. It was a level-jump that seemed to come out of nowhere. “I just never expected that I would be needed for acting,” she says. “But when I was on air for Tawk or for Girl Code, I was able to harness this kind of creative ability that I couldn’t do in lyrics or a musical setting and acting bleeds into that. I’m able to give something else to this collaborative project I couldn’t really do musically and I love that shit.” The opportunities continued pouring in after she got cast in Neighbors 2–just not exactly the right ones. Lum was proud of her heritage (she’s the product of a South Korean immigrant mother and a first-generation Chinese-American father) and she didn’t want to compromise its integrity based on whatever Hollywood happened to be seeking at the moment. “I started to get a lot of auditions that were really weird side roles for Asian characters, where either they brought out all those old tropes or they were just an added Benetton effect, a visual thing,” she says. “Those roles I didn’t take to, they just weren’t for me, so I chose other ones very quickly.” Her next two projects proved pivotal. One was Salima Koroma’s documentary, Bad Rap, which placed Awkwafina within the broader context of the Asian-American hip-hop community, and the other was the Kush-scented coming-of-age comedy, Dude, which is out now on Netflix. The latter project introduced Lum to its up-and-coming writer/director Olivia Milch, who at the time was also penning the screenplay for Ocean’s 8, a film with an open role perfect for a plucky ingenue. The Ocean’s 8 character Lum ended up playing has an identity that has nothing to do with her ethnicity. She’s a blink-and-you’ve-been-robbed pickpocket, and a woman after the star’s own heart.\n\nadvertisement\n\n“What I liked about Constance and what drew me in is that she’s not just a New Yorker, she’s from Queens and her fiber is very much a product of that environment,” Lum says. “Her hustle–dreaming of a better life and how to hustle your way into it–that is Awkwafina’s story too, and it bled very well into my own life.” In the film, we meet Constance while she is scamming Queens pedestrians at Three-card Monte. To prepare for the scene, Lum studied auctioneers and street hustlers religiously (though she once saw her own dad get duped at the game.) She was also paired with a sleight-of-hand coach for the film, who she inevitably befriended and cadged some David Blaine secrets from. (“I can entertain kids for days now,” she notes.) Later this summer, Lum will also appear in Crazy Rich Asians, a comedy her costar Jimmy O. Yang describes as “the Asian Black Panther.” In a sprawling cast, Lum plays headliner Constance Wu’s quirky best friend, Goh Peik Lin, who gets all the hot lines. As a big fan of the popular Kevin Kwan book the film is based on, Lum felt like she was in a Harry Potter movie, more or less. She worried about shattering the image of the character fans had in their heads. By the time she got on set, though, she was feeling confident about her acting. “One thing that’s cool about both Crazy Rich Asians and Ocean’s 8, is that both directors trusted in my ability to improv and that trust leads me to trust myself even more and whatever I’m doing,” says Lum. Her confidence will be put to the test soon as she puts the finishing touches on the show she’s currently developing for Comedy Central. (A new rap EP is on the way as well. It is not clear when, if ever, Lum actually sleeps.) Awkwafina, which the star is writing and producing with Teresa Hsiao and showrunner Karey Dornetto, is a narrative series steeped in the ridiculousness of growing up in Queens and trying to make it big. After years of living through that process, Lum is ready to look back and wring some well-earned laughs from it. “I wanted it to be a story about New York told by a POC New Yorker, which is something you don’t see,” she says. “You see some POC-led shows that take place in New York but not by someone who’s actually from there. Especially Queens. It’s such a different existence and such a different cast of people out there, and you never see them reflected on TV. I know that I’m searching for that and I wanted the show to reflect it.”\n\nadvertisement\n\nWith all of these projects bubbling up, the hype around Lum is now in dangerous proximity to her head. At the moment, though, she’s not personally buying into it–private security guards named Phil, be damned. “I will never believe that I’m as cool as some people have made it out to be,” she vows. “But I think that’s a good thing, because then I’d be an asshole.”", "images": ["https://images.fastcompany.com/image/upload/v1576118408/insta-icon-circle-in.svg", "https://secure-us.imrworldwide.com/cgi-bin/m?ci=us-805310h&cg=0&cc=1&ts=noscript", "https://images.fastcompany.com/image/upload/v1576118408/fb-icon-circle-fb.svg", "http://b.scorecardresearch.com/p?c1=2&c2=6916907&cv=2.0&cj=1", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAwAAAANCAAAAAC4QtCeAAAABGdBTUEAALGPC/xhBQAAAAFzUkdCAK7OHOkAAAAgY0hSTQAAeiYAAICEAAD6AAAAgOgAAHUwAADqYAAAOpgAABdwnLpRPAAAAAJ0Uk5TAAB2k804AAAAAmJLR0QAAKqNIzIAAAAJcEhZcwAAAEgAAABIAEbJaz4AAACASURBVAjXYyir3PaDAQby09KL9/2FcjIWf1mbVX0Mwklfw8DwbF5awzkwZzXDjco/j/vTuq+COe93APXcLE5bCeKczvzOwPCoPG0xiHMq6/f9SWkdF4HK1jKcyepJazgFNnrBpwtpVUchRuempR17+htqaU/55l9w5xzf+RHOBgC94zlXyQTR6wAAACV0RVh0ZGF0ZTpjcmVhdGUAMjAxMy0wMy0wOFQxOToxMDo0NC0wNTowMNnS5vEAAAAldEVYdGRhdGU6bW9kaWZ5ADIwMTMtMDMtMDhUMTk6MTA6NDQtMDU6MDCoj15NAAAAAElFTkSuQmCC", "https://grunerandjahr.112.2o7.net/b/ss/gjincfastcoprod/1/H.24.4--NS/0/5658306", "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2018/06/p-1-get-ready-for-awkwafina-the-and8220oceanand8217s-8and8221-rapperactor-you-need-to-know-1.jpg", "https://images.fastcompany.com/image/upload/v1576118408/linkedin-icon-circle-li.svg", "https://images.fastcompany.com/image/upload/v1576118408/tw-icon-circle-tw.svg", "https://www.facebook.com/tr?id=1389601884702365&ev=PageView&noscript=1"], "top_img": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2018/06/p-1-get-ready-for-awkwafina-the-and8220oceanand8217s-8and8221-rapperactor-you-need-to-know-1.jpg", "keywords": [], "authors": ["About The Author"], "canonical_link": "https://www.fastcompany.com/40581074/oceans-8-star-awkwafina-is-stealing-the-show-on-all-fronts", "title": "“Ocean’s 8” star Awkwafina is stealing the show on all fronts", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "description": "The rapper-actor-TV-show creator is about to be everywhere. Here’s how she got there.", "og": {"type": "article", "title": "“Ocean’s 8” star Awkwafina is stealing the show on all fronts", "url": "https://www.fastcompany.com/40581074/oceans-8-star-awkwafina-is-stealing-the-show-on-all-fronts", "locale": "en_US", "description": "The rapper-actor-TV-show creator is about to be everywhere. Here’s how she got there.", "image": {"identifier": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2018/06/p-1-get-ready-for-awkwafina-the-and8220oceanand8217s-8and8221-rapperactor-you-need-to-know-1.jpg", "width": 1280, "height": 720}, "site_name": "Fast Company"}, "fb": {"app_id": 178479832213933, "admins": 100000062710915}, "twitter": {"card": "summary_large_image", "title": "“Ocean’s 8” star Awkwafina is stealing the show on all fronts", "description": "The rapper-actor-TV-show creator is about to be everywhere. Here’s how she got there.", "url": "https://www.fastcompany.com/40581074/oceans-8-star-awkwafina-is-stealing-the-show-on-all-fronts", "site": "@fastcompany", "image": "https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2018/06/p-1-get-ready-for-awkwafina-the-and8220oceanand8217s-8and8221-rapperactor-you-need-to-know-1.jpg", "domain": "fastcompany.com"}, "theme-color": "#ffffff", "google-site-verification": "rU5yl8EMHvPkTmEeqiqqeEVmNz4eTxaV_Zw8-tr26VA", "article": {"publisher": "https://www.facebook.com/FastCompany", "published_time": "2018-06-08T12:38:37", "modified_time": "2018-06-11T12:19:58", "tag": "awkwafina"}, "author": "Joe Berkowitz", "news_keywords": "Creativity, awkwafina"}, "movies": ["https://www.youtube.com/embed/z726OPwCnjE?feature=oembed", "https://www.youtube.com/embed/fw4DmP9B2IA?feature=oembed", "https://www.youtube.com/embed/MFWF9dU5Zc0?feature=oembed", "https://www.youtube.com/embed/ZQ-YX-5bAs0?feature=oembed"], "publish_date": 1528432717.0, "source": "https://www.fastcompany.com", "summary": ""}