{"url": "www.yourtango.com/2018313569/are-selena-gomez-and-justin-theroux-dating-new-details-about-their-secret-relationship", "text": "Jennifer Aniston is not happy.\n\nAre Selena Gomez and Justin Theroux dating? It's only been three months since 46-year-old actor and screenwriter Justin Theroux split from his 49-year-old wife Jennifer Aniston. Now, he's linked to 25-year-old Selena Gomez and if the gossip sites are to be believed, Jennifer is seriously angry. And while she is entitled to whatever emotion she wants to feel, we're wondering if these rumors about Gomez and Theroux are true. Let's look at the facts.\n\n1. Selena is fresh off a breakup, too.\n\nReports are that Aniston can't believe Theroux would move on so quickly but Gomez is doing the same thing. She's fresh off her breakup from Justin Bieber. And before her most recent reunion with Bieber, she was dating The Weeknd.\n\nA post shared by Delena (@dearestdelena) on Nov 13, 2017 at 2:17pm PST\n\n2. Justin Theroux has known Selena for years.\n\nTheroux and Gomez have known each other for years through their manager.\n\nA post shared by Life & Style Weekly (@lifeandstyleweekly) on May 17, 2018 at 10:27am PDT\n\n3. They're bonding over their breakups.\n\nDespite their more than 20-year age difference, Theroux and Gomez are connecting and bonding over their recent breakup. Reportedly, when they're together, sparks fly.\n\nA post shared by HOT 99.5 (@hot995) on May 17, 2018 at 8:27am PDT\n\n4. Jen knows Selena, too.\n\nJennifer Aniston isn't just mad that Theroux has moved on, or that he's moved on to someone nearly 25 years younger than her. She's mad because she has been a mentor to Selena for a number of years. Gomez captioned the photo below: \"I have not only been following her career as a fan since I was 8 and now get to watch her completely transform in her new movie CAKE, I have gotten to have real conversations with such a real heart, made my entire year. #cake #goseeit\"\n\nA post shared by Selena Gomez (@selenagomez) on Dec 6, 2014 at 12:07am PST\n\n5. Justin and Selena have been spotted together.\n\nWhether they are dating or falling for each other or not, Theroux and Selena have been spending time together. Earlier this month, the two were spotted in New York City together as a part of a group that included Paul Rudd and his wife, Rooney Mara, and the photographer Petra Collins, who is a friend of both Theroux and Gomez.\n\nA post shared by Justifer (@justiferdaily) on May 7, 2018 at 6:46am PDT\n\n6. They started out friends.\n\nLife & Style magazine quoted a source that said they started hanging out to lean on each other but it has taken a more serious turn in recent weeks.\n\n\"Initially, they leaned on each other for emotional support after going through messy breakups.\" Justin announced his split from wife Jennifer Aniston in February while Selena parted ways — again — with pop star Justin Bieber in March.\"\n\nA post shared by www.choteame.tv (@choteametv) on May 17, 2018 at 7:33am PDT\n\n7. The triangle.\n\nSelena Gomez, Justin Theroux and Jennifer Aniston all share the same manager, Aleen Keshishian.\n\nA post shared by text_photo_news (@mango_news) on May 17, 2018 at 10:12am PDT\n\n8. Justin has been flirting with Selena for years.\n\nJustin Theroux is a well known ladies man who prefers nights out on the town to quiet nights at home, something that reportedly was an issue during his marriage to Aniston. Theroux even flirted with Jennifer's friends. At a Golden Globes after party a couple of years ago, Theroux turned his attention to Gomez, who at that point had been friends with Aniston for a number of years. Reportedly, Theroux wouldn't stop complimenting Gomez and that made her nervous.\n\nA post shared by Selenagomezofficialfans (@selenagomezofficialfanz) on May 14, 2018 at 11:28am PDT\n\n9. They stay up all night texting and FaceTiming.\n\nAccording to Life & Style magazine, Theroux and Gomez stay up all night texting and FaceTiming each other. Reportedly they are getting to know each other, talking about their careers, and talking about how they'd both like to be parents one day.\n\nA post shared by ♪ Aries ♪ fb or unf (@tattooingomez) on May 15, 2018 at 1:49pm PDT\n\nIf Theroux and Gomez are dating, we can see why Aniston is mad. It's a betrayal by a friend.\n\nAmy Lamare is a Los Angeles based freelance writer covering entertainment, pop culture, beauty, fashion, fitness, technology, and the intersection of technology, business, and philanthropy. She is deeply devoted to her chocolate Labrador and an avid long distance runner. You can find her on Instagram and Facebook.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6035233&cv=2.0&cj=1", "https://www.yourtango.com/sites/all/themes/ytpurple/img/logo-150.png?v2", "https://www.yourtango.com/sites/default/files/styles/header_slider/public/image_blog/selena.png?itok=6CJfCyko", "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/selena.png?itok=gkMNYRAx"], "top_img": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/selena.png?itok=gkMNYRAx", "keywords": [], "authors": [], "canonical_link": "https://www.yourtango.com/2018313569/are-selena-gomez-and-justin-theroux-dating-new-details-about-their-secret-relationship", "title": "Are Selena Gomez And Justin Theroux Dating? New Details About Their Secret Relationship", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "fb": {"app_id": 102332647006, "pages": 39475817260}, "keywords": "entertainment and news, Buzz", "article": {"author": "https://www.facebook.com/AmyLamareWriter/", "published_time": "2018-05-18T14:00:45", "modified_time": "2018-05-18T14:00:45"}, "og": {"site_name": "YourTango", "type": "article", "url": "https://www.yourtango.com/2018313569/are-selena-gomez-and-justin-theroux-dating-new-details-about-their-secret-relationship", "title": "Are Selena Gomez And Justin Theroux Dating? New Details About Their Secret Relationship", "description": "Jennifer Aniston is not happy.", "updated_time": "2018-05-18T14:00:45", "image": {"identifier": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/selena.png?itok=gkMNYRAx", "width": 620, "height": 309}}, "description": "Is 46-year-old Justin Theroux dating 25-year-old Selena Gomez fresh off his split from 49-year-old Jennifer Aniston? Sources say the pair, who are both fresh off breakups, have been a source of comfort for each other. Are Selena Gomez and Justin Theroux Dating? New details about their secret romance.", "abstract": "It has only been three months since 46-year-old actor and screenwriter Justin Theroux split from his 49-year-old wife Jennifer Aniston. Now, he's", "robots": "follow, index, noodp, noydir", "news_keywords": "selena gomez, justin theroux, are justin and selena dating, are selena gomez and justin theroux dating, justin selena, justin theroux selena gomez, justin theroux selena gomez dating, justin theroux selena gomez relationship, selena gomez justin", "generator": "Drupal 7 (http://drupal.org)", "twitter": {"card": "summary_large_image", "creator": {"identifier": "@yourtango", "id": 17490866}, "url": "https://www.yourtango.com/2018313569/are-selena-gomez-and-justin-theroux-dating-new-details-about-their-secret-relationship", "title": "Are Selena Gomez And Justin Theroux Dating? New Details About Their Secret Relationship", "image": {"src": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/selena.png?itok=gkMNYRAx", "width": 60, "height": 60}}}, "movies": [], "publish_date": 1526623245.0, "source": "http://www.yourtango.com", "summary": ""}