{"url": "https://www.entrepreneur.com/article/197558", "text": "October 9, 2008 7 min read\n\nOpinions expressed by Entrepreneur contributors are their own.\n\nOprah Winfrey\n\nFounder of Harpo Productions Inc.\n\nFounded: 1986\n\n\"I don't think of myself as a poor, deprived ghetto girl who made good. I think of myself as somebody who from an early age knew she was responsible for herself-and I had to make good.\"-Oprah Winfrey\n\nOprah Winfrey is living proof that the American dream is alive and well. The illegitimate daughter of a Mississippi sharecropper, she overcame poverty, parental neglect, sexual abuse and racism to become one of the richest and most powerful women in the entertainment industry. Through sheer force of her personality and by simply being herself, she reinvented the talk show and still reigns as the undisputed champ of daytime television.\n\nWinfrey was born in 1954 on a farm in Kosciusko, Mississippi. Her unmarried parents drifted apart and moved elsewhere shortly after her birth, leaving her in the care of her maternal grandmother, a harsh but loving disciplinarian whom Winfrey credits with fostering her outgoing personality and precociousness. Under her grandmother's tutelage, she learned to read by the age of 2, and by the time she was 3, her speaking talents had already begun to emerge. She was often invited to recite poetry at social clubs and church teas, where they referred to her as \"the little speaker.\"\n\nAt age 6, Winfrey moved to Milwaukee, Wisconsin, to live with her mother, who was working as a domestic. Adjusting to life in the urban ghetto after enjoying the peace of a Mississippi farm proved to be a difficult challenge for Winfrey. To make matters worse, her mother was so preoccupied with her own problems that she had little time for Winfrey. This lack of parental supervision left her vulnerable, and beginning when she was 9 and continuing for several years thereafter, Winfrey was sexually abused by several different men, including a teenage cousin and her mother's boyfriend. (Years later, during a show she was doing on incest, Winfrey burst into tears and shared with her audience the story of her ordeal.)\n\nConfused, ashamed, guilt-ridden and afraid to tell anyone what was being done to her, Winfrey began to act out. Her increasing belligerence and delinquency proved too much for her mother to handle. She tried to put Winfrey in a detention center, but the institution didn't have enough beds, so instead she sent her to live with her father in Nashville, Tennessee. A strict disciplinarian, Winfrey's father changed the course of her life. \"My father turned my life around by insisting that I be more than I was and by believing I could be more,\" Winfrey told Good Housekeeping magazine. \"His love of learning showed me the way.\"\n\nUnder her father's guidance, Winfrey became an honor student and rediscovered her flair for public speaking, emerging as a standout orator. Her speaking skills earned her a scholarship to Tennessee State University, where she majored in speech and drama. In 1973, while only a sophomore, the 19-year-old Winfrey was offered a job as co-news anchor at Nashville's CBS affiliate, WTVF-TV, and became not only Nashville's first female co-anchor but the first black co-anchor as well.\n\nInspired by her success at WTVF-TV, Oprah left college during her senior year to accept a position in Baltimore with WJZ-TV as co-anchor of the evening news. But she soon found that hard news wasn't truly her forte. Deeply empathetic, she had difficulty distancing herself from her work, often having to fight back tears while reporting stories that touched her. Unable to get past this emotional connection to her subjects, she was fired.\n\nFortunately, a new manager at the station saw a way to make a virtue of Winfrey's reporting shortcomings. Phil Donahue's nationally syndicated talk show had won a large following in Baltimore, and the manager wanted to tap the market with a local version. In 1977, \"People Are Talking\" aired with Winfrey as co-host. Oprah had found her niche. Her uncommon ability to connect intellectually and emotionally with a wide variety of topics made the show an instant success. \"I came off the air,\" she says of her first show, \"and said to myself, 'This is what I should be doing. It's like breathing.'\"\n\n\"People Are Talking\" rocketed up the ratings chart, eventually becoming the top show of its genre in the Baltimore market. Winfrey's success attracted the attention of Chicago-based WLS-TV, which offered her a chance to anchor the station's floundering talk show \"AM Chicago.\" Winfrey's earthy, down-home, comfortable style captivated audiences, and the show became an instant smash hit. It bested even hometown-boy Phil Donahue in the ratings, and was quickly syndicated in 120 cities.\n\nBut Winfrey's biggest break came in 1985, when producer Quincy Jones offered her a role in the screen adaptation of Alice Walker's The Color Purple. Winfrey's acting debut garnered rave reviews, won her nominations for both a Golden Globe and an Academy Award, and catapulted her to national stardom. Riding this wave of publicity, \"The Oprah Winfrey Show\" made its national debut in 1986, and within five months became the third-highest rated show in syndication and the No. 1 talk show, reaching upwards of 10 million people daily in 192 cities.\n\nTo further capitalize on her success, in 1986, Oprah formed Harpo (\"Oprah\" spelled backwards) Productions Inc. In 1988, she purchased a state-of-the-art production studio in Chicago and took over ownership and production of \"The Oprah Winfrey Show.\" The move made Winfrey only the third woman in history-behind Mary Pickford and Lucille Ball-to own and produce her own show as well as the first African-American, male or female, to own her own entertainment production company.\n\nDuring the 1990s, the airwaves became flooded with talk shows, but Winfrey's ratings continued to soar despite the increased competition. Part of the reason for her success is that she has avoided the tabloid \"nuts and sluts\" approach many of her competitors adopted. Choosing to take the high road, she empathized with people in trouble and emphasized solutions to the problems her show revealed, instead of wallowing in the mire of sensationalism. Even more so, she went beyond being merely a talk-show host to become a shaper of American culture. The books she likes invariably become bestsellers. The records of musicians she invites on her show shoot up the charts. And diets concocted by her personal cook have influenced the eating habits of millions.\n\nBy the end of the 1990s, Winfrey's $415 million talk empire had made her the wealthiest woman in show business and one of the most powerful figures in the television industry. Her recipe for success is simple: \"Follow your instincts,\" she says in a Ladies Home Journal magazine article. \"That's where true wisdom manifests itself.\"\n\nComic Relief\n\nTo polish her instinctive flair for entertainment and improve her spontaneity, Oprah Winfrey once studied improvisation with Chicago's Second City comedy troupe, whose alums include such famous comedians as Dan Aykroyd, John Belushi and John Candy.\n\nA Really Bad Hair Day\n\nWhile Oprah Winfrey was co-anchoring the evening news in Baltimore, an assistant news director decided that her hair was \"too thick\" and sent her to an expensive New York City salon for a makeover-with disastrous results. A botched permanent left her completely but temporarily bald, and she was forced to cover her scalp with a scarf. Although she cried \"constantly,\" she found in the ordeal an opportunity for self-discovery, admitting in a Ms. magazine interview, \"You learn a lot about yourself when you're bald.\"", "images": ["https://assets.entrepreneur.com/static/20180405100041-entrepreneur-asia-pacific-white.svg", "https://assets.entrepreneur.com/static/20190305095801-ENT-Product-Promo-Biz-Planning-Plus-3-2-2000x1334.png?format=jpg&width=700&crop=16:9", "https://assets.entrepreneur.com/content/3x4/600/20200307084422-EntrepreneurMarchCover.jpeg?width=150&quality=15", "https://assets.entrepreneur.com/static/20190601122201-Insider-Bottom-Article-Promo-v4a.jpg?format=jpg&width=700&crop=16:9", "https://assets.entrepreneur.com/i/images/misc/greatminds/oprah-winfrey.jpg", "https://assets.entrepreneur.com/content/3x2/2000/20160408155709-default-hero-entrepreneur.png", "https://assets.entrepreneur.com/static/20191004063004-EP-BOTW-Promo-Image-2000x1334.jpg?format=jpg&width=700&crop=16:9", "https://assets.entrepreneur.com/static/20160721060814-ENT-logo-white.svg"], "top_img": "https://assets.entrepreneur.com/content/3x2/2000/20160408155709-default-hero-entrepreneur.png", "keywords": [], "authors": [], "canonical_link": "https://www.entrepreneur.com/article/197558", "title": "Oprah Winfrey", "meta_data": {"copyright": "Copyright 2020 Entrepreneur Media, Inc. All rights reserved.", "viewport": "width=device-width,initial-scale=1.0,maximum-scale=3.0", "apple-mobile-web-app-capable": "yes", "robots": "index,follow,NOODP", "googlebot": "index,follow,NOODP", "msvalidate.01": "54B5AAADAA61BB7748D0BA219F04B657", "msapplication-config": "none", "article": {"publisher": "https://www.facebook.com/EntAsiaPacific", "published_time": "2008-10-09T00:00:00Z", "modified_time": "2015-12-11@15:58:26 UTC", "tag": "Oprah Winfrey,Radicals & Visionaries,Grow Your Business"}, "theme-color": "#131318", "verify-v1": "VytPswCXjUV52BPf9/JrqfKb64cLEpXc4JqfxtlVlME=", "google-site-verification": "j89zX5NotAYNRfZwuCAeYpH7TnOCKSFupnj9FrMps0E", "linkedin": {"owner": "mid:21884750"}, "fb": {"app_id": 279152967822, "page_id": 138707266963787}, "og": {"site_name": "Entrepreneur", "title": "Oprah Winfrey", "description": "The queen of talk didn't let sexual abuse, poverty or racism hold her back. She's a media mogul with a soft spot for people and a penchant for following her instincts.", "url": "https://www.entrepreneur.com/article/197558", "image": {"identifier": "https://assets.entrepreneur.com/content/3x2/2000/20160408155709-default-hero-entrepreneur.png", "width": 2000, "height": 1333}, "type": "article"}, "edition": "us", "contentEdition": "us", "description": "The queen of talk didn't let sexual abuse, poverty or racism hold her back. She's a media mogul with a soft spot for people and a penchant for following her instincts.", "keywords": "Oprah Winfrey,Radicals & Visionaries,Grow Your Business", "unitName": "/6280/Entrepreneur/article", "original-source": "https://www.entrepreneur.com/article/197558", "sailthru.date": "2008-10-09T00:00:00Z", "sailthru.title": "Oprah Winfrey", "sailthru.tags": "Oprah Winfrey,Radicals & Visionaries,Grow Your Business", "sailthru.vars": "edition:us", "twitter": {"card": "summary_large_image", "site": "@Entrepreneur", "title": "Oprah Winfrey | Visionaries", "description": "The queen of talk didn't let sexual abuse, poverty or racism hold her back. She's a media mogul with a soft spot for people and a penchant for following her instincts.", "url": "https://www.entrepreneur.com/article/197558", "image": {"src": "https://assets.entrepreneur.com/content/3x2/2000/20160408155709-default-hero-entrepreneur.png"}, "domain": "entrepreneur.com"}}, "movies": [], "publish_date": 1223510400.0, "source": "https://www.entrepreneur.com", "summary": ""}