{"url": "http://runninglip.com/celebrity/ryan-seacrest-and-other-celeb-pranksters-on-april-fools-day-2018/", "text": "April fool’s day is a day characterized by practical jokes and hoaxes. People from all over the world spread hoaxes and play practical jokes on one another on April 1st. Although April fools has been popular globally for over a century, it is not an official public holiday anywhere in the world. The day is just meant for playing harmless pranks which are usually explained shortly after or the next day. On the top of the list of people who love to play pranks, practical jokes and hoaxes on April fool’s day are celebrities. This year, celebrities hit up social media with numerous pranks and practical jokes ranging from fake media statements to pregnancy news. Here are the top 2018 April fool’s day celeb pranksters.\n\n1. Ryan Seacrest and Chris Harrison\n\nABC had fun with viewers on 1st April 2018 by staging a surprising crossover between two of its biggest reality shows; American Idol and The Bachelor. When the all-new American Idol episode began on Sunday, the host, Ryan Seacrest was missing in action momentarily. Chris Harrison, The Bachelor show host introduced the episode instead with a dramatic voice over and music throwing the audience into a frenzy. Ryan Seacrest then jumped in appreciating his co-host’s effort before handing him the Trademark rose from “The Bachelor” and then saying “Goodbye.” Chris Harrison then revealed the intro as an April fools prank.\n\nKeep up ABC’s American Idol and more by following Ryan Seacrest on Facebook and Twitter\n\n2. Lin-Manuel Miranda\n\nCelebrated American lyricist, composer, playwright and actor, Lin-Manuel Miranda also had his fair share of April Fool’s fun. Miranda joined in on an April fool’s prank initiated by Theater Mania via a tweet that announced a Broadway Musical of Tommy Wiseau’s “The Room” by Miranda giving an official song and cast list. Miranda went along with Theater Mania’s joke by tweeting in support before revealing it was an April fool’s joke later in another tweet.\n\n3. Arie Luyendyk Jr. & Lauren Burnham\n\nThe Bachelor star Arie Luyendyk sparked some backlash on April fool’s day when he posted (on Instagram stories and Twitter), a picture of a woman (Lauren Burnham) with a baby bump followed by a message mentioning the two were having a baby. Despite following it up with an “April Fool’s” message, many fans/followers didn’t interpret the photo as a harmless joke resulting in a serious backlash branding the celebrated reality TV star as insensitive towards couples/women struggling with infertility.\n\n4. Princess Love\n\nRay J’s wife Princess Love also got in the April fool’s day bandwagon with a pregnancy prank. The reality TV Star who is currently pregnant made an Instagram post pretending her water broke. The video prank which was filmed in the presence of Ray J was meant to freak him out. The carefully choreographed video featured friends as accomplices and a distressed Ray J asking what he should do.\n\n5. Netflix (Jareth Chumley)\n\nNetflix joined on the 1st April pranks via a lengthy press release claiming to have “taken over” Seth Rogen’s mind. According to the press release, Netflix stated that Seth Rogen had entered a lifetime deal transferring full ownership of his mind (personal autonomy) to Netflix, INC. The press release had a personal statement from Jareth Chumley, Netflix’s Development Executive stating that the deal was materialized in a 2017 wrap party after Seth approached Chumley, a long-time friend, and suggested he would sell his soul for an enchilada.\n\nIt appears someone at Netflix took April fool’s day pranking too far!\n\n6. Todd Kraines\n\nIf you are a fan of one of the most popular reality show of all times Keeping up With the Kardashians by creator Ryan Seacrest, you’ve most probably heard of Todd Kraines, the person behind Scott Disick’s notorious prank call. Todd Kraines finally got some well-deserved revenge on Scott’s ex, Kourtney Kardashian in an E! News April fool’s PSA video.\n\nTodd called Kourtney on April fool’s in typical fashion, and she answered without realizing she was getting tricked. The call included a question addressed to Kourtney on if she thought the harmless Todd Kraines phone pranks could have an impact on his real life. Kourtney replied, “NO.”\n\nAs part of the PSA video, Todd made a statement to raise awareness on the effects of seemingly harmless pranks on people’s lives in the long-term. His statement was in honor of 1st April. Todd finally got his payback!", "images": ["http://runninglip.com/wp-content/themes/Newspaper/images/no-thumb/td_100x70.png", "http://runninglip.com/rl/media/2018/04/Ryan-Seacrest-American-Idol-April-Fools-696x817.jpg", "http://runninglip.com/rl/media/2018/04/Arie-Luyendyk-prank.jpg", "http://runninglip.com/rl/media/2015/06/justin-bieber-where-are-u-now-video.jpg", "http://runninglip.com/rl/media/2020/03/GettyImages-187481662-1-218x150.jpg", "http://runninglip.com/rl/media/2018/04/Ryan-Seacrest-American-Idol-April-Fools.jpg", "http://runninglip.com/rl/media/2017/03/Logo_for_mobile_white.png", "http://runninglip.com/rl/media/2018/04/Netflix-640x474.jpg", "http://runninglip.com/rl/media/2017/03/Logo_desktop_white.png", "http://runninglip.com/rl/media/2020/02/a5a1dbb6b65a58b309a3b2bc6d50c6ed696903ee-218x150.jpg", "http://runninglip.com/rl/media/2020/01/960x0-218x150.jpg"], "top_img": "http://runninglip.com/rl/media/2018/04/Ryan-Seacrest-American-Idol-April-Fools.jpg", "keywords": [], "authors": [], "canonical_link": "http://runninglip.com/celebrity/ryan-seacrest-and-other-celeb-pranksters-on-april-fools-day-2018/", "title": "Ryan Seacrest and Other Celeb Pranksters on April Fool’s Day 2018", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "verifyownership": "f0bcafb5d6c23d139ebe43e7d7450911", "og": {"image": {"identifier": "http://runninglip.com/rl/media/2018/04/Ryan-Seacrest-American-Idol-April-Fools.jpg", "width": 872, "height": 1024}, "locale": "en_US", "type": "article", "title": "Ryan Seacrest and Other Celeb Pranksters on April Fool's Day 2018 - Running Lip", "description": "April fool’s day is a day characterized by practical jokes and hoaxes. People from all over the world spread hoaxes and play practical jokes on one another on April 1st. Although April fools has been popular globally for over a century, it is not an official public holiday anywhere in the world. The day is …", "url": "http://runninglip.com/celebrity/ryan-seacrest-and-other-celeb-pranksters-on-april-fools-day-2018/", "site_name": "Running Lip", "updated_time": "2018-04-03T11:57:11-04:00"}, "author": "Ole", "article": {"section": "Celebrity", "published_time": "2018-04-03T11:53:31-04:00", "modified_time": "2018-04-03T11:57:11-04:00"}, "twitter": {"card": "summary_large_image", "description": "April fool’s day is a day characterized by practical jokes and hoaxes. People from all over the world spread hoaxes and play practical jokes on one another on April 1st. Although April fools has been popular globally for over a century, it is not an official public holiday anywhere in the world. The day is […]", "title": "Ryan Seacrest and Other Celeb Pranksters on April Fool's Day 2018 - Running Lip", "image": "http://runninglip.com/rl/media/2018/04/Ryan-Seacrest-American-Idol-April-Fools.jpg"}, "generator": "Powered by Visual Composer - drag and drop page builder for WordPress."}, "movies": [], "publish_date": 1522770811.0, "source": "http://runninglip.com", "summary": ""}