{"url": "https://en.wikipedia.org/wiki/Keeping_Up_with_the_Kardashians", "text": "American reality television series\n\nKeeping Up with the Kardashians (often abbreviated KUWTK) is an American reality television series that airs on the E! cable network. The show focuses on the personal and professional lives of the Kardashian–Jenner blended family. Its premise originated with Ryan Seacrest, who also serves as an executive producer. The series debuted on October 14, 2007, and has subsequently become one of the longest-running reality television series in the country. The eighteenth season premiered on March 26, 2020.[2] Also, on February 27, Kris Jenner confirmed on the Ellen show that filming for season 19 has begun.\n\nThe series focuses mainly on sisters Kim, Kourtney, and Khloé and their half-sisters Kendall and Kylie. It also features their parents Kris and Caitlyn, and brother Rob. The significant others of the Kardashian sisters have also appeared on the show, including Kourtney's ex-boyfriend Scott Disick, Kim's ex-husband Kris Humphries, and current husband Kanye West, Khloé's ex-husband Lamar Odom, ex-boyfriend French Montana, and ex-boyfriend Tristan Thompson along with Rob's ex-girlfriend Adrienne Bailon and ex-fiancé Blac Chyna. Caitlyn's son Brody Jenner made a cameo in season 1, before appearing regularly between the 8th and 11th seasons, along with brother Brandon and Brandon's wife Leah. Kim's friend Jonathan Cheban and Khloé's friend Malika Haqq have also been part of the show.\n\nKeeping Up with the Kardashians has been critically panned since its premiere. It is often criticized for the high degree of emphasis on the \"famous for being famous\" concept, and for appearing to fabricate some aspects of its storylines. Several critics also noted the show's lack of intelligence.[3] However, some critics recognized the reality series as a \"guilty pleasure\" and acknowledged the family's success. Despite the negative reviews, Keeping Up with the Kardashians has attracted high viewership ratings, becoming one of the network's most successful shows and winning several audience awards.\n\nThe series' success has led additionally to the creation of numerous spin-off series, including: Kourtney and Kim Take Miami, Kourtney and Kim Take New York, Khloé & Lamar, Kourtney and Khloé Take The Hamptons, Dash Dolls, Rob & Chyna, Life of Kylie, and Flip It Like Disick. The network has also broadcast several television specials featuring special events involving members of the family and friends.\n\nBackground [ edit ]\n\nRobert Kardashian (1944–2003) and Kristen Houghton (born 1955) married in 1978, and had four children together: daughters Kourtney (born 1979), Kim (born 1980), and Khloé (born 1984), and son Rob (born 1987). The couple divorced in 1991. In 1994, Robert entered the media spotlight when he defended O. J. Simpson for the murders of Nicole Brown Simpson and Ronald Goldman during the O.J. Simpson trial.[4][5] In 1991, Kris married retired Olympic decathlon champion Caitlyn Jenner (born 1949; formerly known as Bruce Jenner before undergoing a gender transition in 2015).[6] Kris and Caitlyn had two daughters together, Kendall (born 1995) and Kylie (born 1997). Robert died in 2003, eight weeks after being diagnosed with esophageal cancer.[7]\n\nThe Kardashian sisters began appearing in the media spotlight more often. In the early 2000s Kim worked as a personal assistant for hotel heiress and reality TV star, Paris Hilton.[8] During her employment for Hilton, Kim briefly developed a very close friendship with Hilton during a high point in Hilton's fame. This friendship helped boost Kim's personal fame by allowing her to occasionally appear in episodes of Hilton's TV show The Simple Life. Furthermore, Kim and Hilton's close friendship ensured that Kim would appear in public, notably in paparazzi shots, with Hilton. Kim also worked for several other celebrities in the early 2000s, further boosting her fame and connections.[9] Notably, in 2004, Kim became a personal stylist for singer Brandy Norwood. She eventually developed into a full-time stylist, and was a personal shopper and stylist for actress and singer Lindsay Lohan.[10]\n\nKhloé, Kim, and Kourtney ventured further into fashion, opening a high fashion boutique Dash in Calabasas, California. Throughout Kim's early career, she was involved in some high-profile relationships including Brandy Norwood's brother, singer Ray J, and later, singer Nick Lachey.[10] In 2006, Kourtney starred in her first reality television series, Filthy Rich: Cattle Drive.[11]\n\nIn February 2007, a home sex tape that Kim made with Ray J years earlier was leaked.[12] Vivid Entertainment bought the rights for $1 million and released the film as Kim Kardashian, Superstar on February 21.[12] Kim sued Vivid for ownership of the tape, but dropped the suit in April 2007, settling with Vivid Entertainment for $5 million.[13] The release of the sex tape was a major contributor to the rising fame of Kim Kardashian and her family.[14]\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nThe Osbournes was popular. I had seen The Osbournes and thought to myself—because I had formed a production company—I thought we should find something in this vein. And at the time, we had heard that Kris was interested in doing something with the family, so it was me and one other guy at the company. […] We had no idea it would become the monster pop culture business that it is.\" \"[Kris] was interested in doing a television show and this was in the time thatwas popular. I had seenand thought to myself—because I had formed a production company—I thought we should find something in this vein. And at the time, we had heard that Kris was interested in doing something with the family, so it was me and one other guy at the company. […] We had no idea it would become the monster pop culture business that it is.\" —Ryan Seacrest on developing the idea for the reality series.[15]\n\nThe idea of creating a reality series originated in 2006 when Kris Jenner showed an interest in appearing on a television show together with her family.[16] Jenner commented: \"Everybody thinks that [my children] could create a bunch of drama in their lives, but it's something that I felt I didn't even have to think about. It would be natural.\"[17] Producer Ryan Seacrest, who had his own production company, decided to develop the idea, having the popular family-based show The Osbournes in mind. He hired a camera man to visit the Kardashian's family home to film them having a Sunday barbeque: \"They were all together—as crazy and as fun as loving as they are,\" Seacrest described the family after seeing the tape. He later initiated the series by sharing the tape with E!, an American cable network which features mostly entertainment-related programming, and reality television series; the show was eventually picked up.[15][18] In August 2007, it was announced that the Kardashian and Jenner families would star in a yet-to-be-titled reality show on E! described as a \"new non-scripted family sitcom\", being produced by Ryan Seacrest and Bunim/Murray Productions. The series' announcement came one week after Paris Hilton and her friend Nicole Richie announced that their popular E! series, The Simple Life, was ending.[19]\n\nThe show, titled Keeping Up with the Kardashians, premiered on October 14, 2007.[20] The reality series centers around the members of the Kardashian-Jenner blended family, focusing on the sisters Kourtney, Kim and Khloé. Most episodes have very similar structure: the family \"show[s] off their privileged lifestyle and maybe get into one or two minor family squabbles before ultimately wrapping things up with a monologue that reinforces the importance of family,\" as noted by Caroline Siede of Quartz.[21] Harriet Ryan and Adam Tschorn of the Los Angeles Times described the reality series as a: \"Hollywood version of The Brady Bunch -- the harmless high jinks of a loving blended family against a backdrop of wealth and famous connections\".[22] Kim Kardashian described the beginning of filming the show, \"When we first started [the show], we came together as a family and said, 'If we're going to do this reality show, we're going to be 100 percent who we really are.'\".[23] She further commented on the show's authenticity by saying that the network \"has never once put anything out there that we haven't approved of or accepted\".[23] The series was renewed for a second season one month after its premiere due to high ratings.[20] Seacrest described the show's success: \"At the heart of the series—despite the catfights and endless sarcasm—is a family that truly loves and supports one another […] The familiar dynamics of this family make them one Hollywood bunch that is sure to entertain.\"[11]\n\nThe following year, Keeping Up with the Kardashians was picked up for a third season.[24] In April 2012, E! signed a three-year deal with the Kardashian family that kept the series airing through seasons seven, eight and nine.[25] Keeping up with the Kardashians was later renewed for a tenth season which premiered on March 15, 2015.[26] In February 2015, it was announced that the show had been renewed for four more years, along with an additional spin-off series, making it one of the longest-running reality television series in the country.[27][28] In terms of the show's future, Kim Kardashian has commented that the reality series could go for an indefinite number of seasons saying that she: \"hope[s] it goes on for as long as it can.\"[29] Keeping Up with the Kardashians, including its spin-off series, has become the cable network's flagship show and its most lucrative franchise. \"It has changed the face of E!\" said Lisa Berger, the network's executive producer. \"We were a place to report on celebrity; we weren't a place to break and make celebrity, which is now the whole idea of the E! brand.\"[30] The show's success contributed significantly towards building the \"Kardashian brand\", or \"Kardashian Inc.\" as it is called by The Hollywood Reporter. \"These shows are a 30-minute commercial,\" Khloé Kardashian admitted in 2011, in response to a suggestion that the television series is used to promote their retail stores and endorsement deals.[30]\n\nOn August 3, 2017, it was announced the show's 10 year anniversary will premiere on September 24, 2017, following the show's season 14 premiere.[31]\n\nOn August 24, 2017, it was announced the family had signed a $150 million deal with E!.[32]\n\nOn August 20, 2018, Kim Kardashian announced on Twitter that the family would begin filming Season 16 the following week.[33]\n\nCast [ edit ]\n\nThe reality series revolves around the children of Kris Jenner, and originally focused mainly on the children from her first marriage to deceased attorney Robert Kardashian: Kourtney, Kim, Khloé, and Rob. Kris' children Kendall and Kylie from her subsequent marriage to American athlete Caitlyn (formerly Bruce) Jenner have also been featured on the show since its beginning.[34][35] Kourtney's boyfriend Scott Disick has also been appearing frequently on the show since the first season, as well as on the show's spin-offs.[34] Cast members also include numerous friends and other acquaintances of the family members, most notably Malika Haqq and Jonathan Cheban who joined Keeping Up with the Kardashians in the second and third seasons, respectively.[36][37]\n\nMost of the Kardashian sisters' significant others have appeared on the reality series. Kim's relationship with football player Reggie Bush was featured on the early seasons of the show when they were dating; after the breakup, Bush commented on appearing on the show saying that he never felt comfortable being followed by cameras, adding: \"I do it because it's important to [Kim].\"[38] Rob's relationship with singer Adrienne Bailon has also been documented on the show when they were dating from 2007 to 2009; although Bailon later admitted that the decision to appear on the show, and be associated with the family, hurt her career.[39] Kim's eventual husband Kris Humphries first appeared on the show during the premiere of the sixth season; their relationship was chronicled throughout the season and ended with the couple's wedding special \"Kim's Fairytale Wedding: A Kardashian Event\".[40] They eventually went through a highly publicized divorce; Kardashian's former publicist later claimed that Humphries was allegedly set up to be portrayed on the show in a negative way and that the short-lived marriage was staged for the cameras as a ploy to generate money.[41][42]\n\nKhloé married basketball player Lamar Odom during a fourth-season premiere aired in 2009. He later had a major role as part of the supporting cast from the fourth series, though he ceased appearing following the breakdown of the marriage.[43] He later returned to the show during the conclusion of the eleventh series and subsequent twelfth season following his collapse. Kim's current husband Kanye West made his first appearance on Keeping Up with the Kardashians in July 2012 during the seventh season when he started dating Kim.[44] However, West initially did not continue to appear. He explained the reasons for not appearing on the show later: \"You know, the amount of backlash I got from it is when I decided to not be on the show anymore. And it's not that I have an issue with the show; I just have an issue with the amount of backlash that I get.\"[45] He also criticized the show for its cinematography and further complained about the way how the show is filmed.[46] Despite this, West increased his appearances from the twelfth season onwards and undertook a more prominent position from Season 16 onwards. Rob's fiancé Blac Chyna undertook a recurring role throughout the twelfth season. In the eighth season, Caitlyn Jenner's sons Brandon and Brody Jenner, as well as Brandon's wife at the time Leah, joined the cast for regular appearances following Brody's cameo in season 1 and Kim’s Fairytale Wedding.[47] Khloe's boyfriend Tristan Thompson made recurring appearances on the show whilst they were together from Season 13 to 16.\n\nCast overview [ edit ]\n\nThe success of the reality series resulted in the development of several spin-off shows and other related programming. In April 2009, E! announced the first spin-off of Keeping Up with the Kardashians titled Kourtney and Khloé in Miami, which was later renamed Kourtney and Khloé Take Miami. The series followed the sisters who moved to Miami to open a new Dash boutique. Ted Harbert, president and CEO of Comcast Entertainment Group, considered the sisters capable of handling their own standalone series. \"It's a very simple formula that we took from scripted TV and applied to a reality show. […] There are a lot of family sitcom elements to 'Kardashians,' and we think that humor and warmth will carry over to Miami,\" Harbert added.[48] The show premiered on August 16, 2009, to very high ratings; the first episode brought in 2.7 million total viewers and then became the most-watched show on the network since The Anna Nicole Show in 2002.[49] The spin-off was subsequently renewed for a second season which premiered on June 13, 2010,[50] and later returned as Kourtney and Kim Take Miami for a third season on January 20, 2013.[51] Additionally, a series of webisodes titled Lord Disick: Lifestyles of a Lord were released following the show, which showcased Disick as he informed viewers how to live like a \"king\".[52]\n\n\"Khloé and Lamar are such a dynamic couple that we just knew we had to give them their own series. […] They are funny, dramatic, opinionated, and we intend to capture all this, along with the unvarnished reality of their lives together and apart, since each is constantly followed by their own celebrity spotlight.\" —Lisa Berger, the executive vice president of the network.[53]\n\nIn October 2010, the network announced another spin-off called Kourtney and Kim Take New York which followed the same format as its predecessor. The show debuted on January 23, 2011, and followed the sisters who opened a Dash location in New York City.[54] The series returned for another season which premiered on November 27 the same year.[55] In January 2011, Khloé & Lamar, which featured Khloé and her husband Lamar Odom, became the third spin-off of Keeping Up with the Kardashians.[56] The show premiered on April 10, 2011, and lasted two seasons.[57] In March 2014, E! announced the fourth spin-off titled Kourtney and Khloé Take The Hamptons.[58] The series premiered on November 2, 2014, and followed Kourtney and Khloé who relocated to the Hamptons to work on opening a new Dash pop-up store.[59] The fifth spin-off series called Dash Dolls premiered on September 20, 2015. The reality series chronicles the daily life of the employees of the Dash boutique in Los Angeles.[60] In June 2016, the network announced another show titled Rob & Chyna which premiered on September 11 the same year, and follows the relationship of Rob Kardashian and Blac Chyna as they prepare to welcome their first child.[61] The show was later renewed for a second season.[62] In July 2017, E! confirmed the series was put on hold, and not on their current schedule.[63]\n\nThe network has also aired several television specials featuring important family events. A two-part television event called \"Kim's Fairytale Wedding: A Kardashian Event\", showcasing the wedding between Kim and Kris Humphries, was broadcast on October 9 and 10, 2011, as part of the sixth season; the special was highly successful with a combined 10.5 million viewers.[64] A few days after Caitlyn Jenner (then Bruce) came out as a trans woman during a 20/20 interview with Diane Sawyer in May 2015, E! aired a two-part special on Keeping Up with the Kardashians titled \"About Bruce\", in which another side of the story was told featuring family members who were not involved in the previous interview on 20/20.[65] The first part of the special debuted on May 17, 2015, and attracted 2.92 million total viewers, a 40% increase from the previous episode, while the second part aired the following day with similar viewership.[66] I Am Cait, a separate documentary series, was announced immediately after the 20/20 interview. Jeff Olde, head of programming at E! network, said that the series is \"not at all a Kardashian spin-off\", and that \"we will not resort to spectacle,\" trying to emphasize its distinct format that is entirely different from most programming on the network, including Keeping Up with the Kardashians.[67] The eight-part, one-hour docuseries debuted on July 26, 2015, on E!, and focused on how Jenner was handling the aftermath of the transition; it also attempted to deal with various LGBT-related issues.[68][69] It was later cancelled after two seasons.[70] In April 2017, it was announced E! had ordered an 8-episode spin-off Life of Kylie revolving around Kylie Jenner. It premiered on August 6, 2017.[71]\n\nEpisodes [ edit ]\n\nSeason Episodes Originally aired First aired Last aired 1 8 October 14, 2007 ( ) December 2, 2007 ( 2007-12-02 ) 2 11 March 9, 2008 ( ) May 26, 2008 ( 2008-05-26 ) 3 12 March 8, 2009 ( ) May 25, 2009 ( 2009-05-25 ) 4 11 November 8, 2009 ( ) February 21, 2010 ( 2010-02-21 ) 5 12 August 22, 2010 ( ) December 20, 2010 ( 2010-12-20 ) 6 16 June 12, 2011 ( ) December 19, 2011 ( 2011-12-19 ) 7 19 May 20, 2012 ( ) October 28, 2012 ( 2012-10-28 ) 8 21 June 2, 2013 ( ) December 1, 2013 ( 2013-12-01 ) 9 20 January 19, 2014 ( ) September 1, 2014 ( 2014-09-01 ) 10 17 March 15, 2015 ( ) October 11, 2015 ( 2015-10-11 ) 11 13 November 15, 2015 ( ) February 21, 2016 ( 2016-02-21 ) 12 21 May 1, 2016 ( ) November 20, 2016 ( 2016-11-20 ) 13 14 March 12, 2017 ( ) June 11, 2017 ( 2017-06-11 ) 14 19 October 1, 2017 ( ) March 4, 2018 ( 2018-03-04 ) 15 16 August 5, 2018 ( ) December 9, 2018 ( 2018-12-09 ) 16 12 March 31, 2019 ( ) June 30, 2019 ( 2019-06-30 ) 17 12 September 8, 2019 ( ) December 15, 2019 ( 2019-12-15 ) 18 TBA March 26, 2020 ( ) 2020 ( 2020 )\n\nReception [ edit ]\n\nCritical response [ edit ]\n\n\"The Kardashians are the last ladies standing in reality TV because they've simply always believed they were celebrities – endlessly amused with themselves, endlessly oblivious to one another. Their vanity is impervious to the outside world, which is how many of us often wish our own personal vanity worked. Their gargantuan egos, their petty jealousies, their catty feuds, the effort-vs.-eye-roll they put into reciting their lines, their commitment to frivolity at all costs – these are seductive qualities in a reality-TV star, however repugnant they might be in real life. Whatever it is you watch reality TV for, the Kardashians just have a lot more of it.\" —Rob Sheffield from Rolling Stone[72]\n\nKeeping Up with the Kardashians has been the subject of constant panning by critics since its inception. Brian Lowry, reviewing the show for Variety, said that the network: \"widens its lens to encompass the whole irritating brood—including Kim's sisters Khloé and Kourtney, mom-manager Kris and stepdad Bruce Jenner, who now has the distinction of having two sets of useless rich kids featured in pointless reality shows.\"[73] Ginia Bellafonte of The New York Times compared the show to reality series Gene Simmons Family Jewels and exclaimed that: \"the Kardashian show is not about an eccentric family living conventionally; it is purely about some desperate women climbing to the margins of fame, and that feels a lot creepier.\"[74] Laura Burrows of IGN criticized the family for being too self-seeking and using the given platform only to gain more notoriety for themselves. Following the conclusion of the second season of the series, Burrows wrote: \"Those of us who watch this show […] want to believe that these whores of attention have souls and would actually do something for their fellow man and not reap the benefits of their service, but two seasons' worth of self-absorbed egocentrism speaks to the contrary.\"[75]\n\nRoxana Hadadi, reviewing Keeping Up with the Kardashians for The Washington Post, was extremely negative towards the reality series due to its absurdity, and commented that the show: \"firmly captures all of Kim and Co.'s dumbest instances from the series' debut—from the simply self-absorbed to the downright despicable.\"[76] Amaya Rivera, writing about the series for Popmatters, noted: \"Indeed, there is something disturbing about the Kardashians' intense hunger for fame. But even worse—it is downright boring to watch this family live out their tedious lives.\"[77] John Kubicek, the senior writer of BuddyTV, reviewed the premiere of the third season of the show and discussed the reason for the family's success by saying that: \"the Kardashians' fame is a lot like Möbius strip or an M. C. Escher painting.\"[78] Harriet Ryan and Adam Tschorn of the Los Angeles Times described Keeping Up with the Kardashians as a: \"Hollywood version of The Brady Bunch -- the harmless high jinks of a loving blended family against a backdrop of wealth and famous connections\".[22] Jessica Chasmar of The Washington Times said that series: \"illustrates our nation's moral, spiritual and cultural decay.\" Chasmar emphasized its negative influence and noted: \"America of 50 years ago would regard Ms. Kardashian with a mixture of disdain and pity, embarrassed by the very idea of a young lady's most private moments being broadcast for all the world to see.\"[79]\n\nGoal Auzeen Saedi, reviewing Keeping Up with the Kardashians for Psychology Today, emphasized the show's influence saying that: \"The Kardashians become more relatable the more famous they become.\" Saedi also questioned their decision to appear on the show and added: \"But if living life in the spotlight is so taxing and demands multiple justifications for the way your life is being lived and criticized, perhaps you can take the cameras out of your house.\"[80] Vinnie Mancuso, writing for New York Observer, criticized the show and felt: \"roughly one iota of shadenfreudic pleasure from this endeavor, but for the most part this show is the 100% drizzling poops.\"[81] David Hinckley of the New York Daily News, reviewing the tenth season, said that \"even when you think something about the Kardashians could be interesting, it's not,\" adding that the \"entertainment value [of the show] is like having spent 10 years in Rapid City, S.D., watching the traffic lights change.\"[82] Amy Amatangelo of The Hollywood Reporter said that \"in true Kardashian fashion, they managed to make everything about them,\" after Caitlyn Jenner came out as a trans woman to her family in the \"About Bruce\" special aired as part of the tenth season. Amatangelo felt that the conversations \"seemed a little too staged, too controlled\", and noted that \"there was no attempt to educate the viewers about transgender issues.\"[83]\n\nKeeping Up with the Kardashians has me imagining the raven-haired siblings being tracked by a slobbering pack of hunting dogs. Sadly, the reality is much more mundane. The best we can hope for is a peek into the crazy chaos of life on the \"The title of the show is misleading –has me imagining the raven-haired siblings being tracked by a slobbering pack of hunting dogs. Sadly, the reality is much more mundane. The best we can hope for is a peek into the crazy chaos of life on the A-list . […] The Kardashians would be the first to admit that their notoriety has little to do with any discernible talent, beyond an alarming capability for self-promotion.\" —Gareth Dimelow from Sabotage Times[84]\n\nHowever, several critics were more positive towards the show. A number of publications welcomed the show as \"guilty pleasure\", including The Huffington Post, The Atlantic, and The Week.[85][86][87] Tim Stack, writing for Entertainment Weekly, described the reality series as: \"my favorite little slice of reality TV spongecake.\"[88] Lauren Le Vine of Refinery29 appreciated the success of the family which \"achieved the American dream of making something out of nothing,\" using the given platform.[89] Libby Hill of The A.V. Club also acknowledged the show's success and said: \"Keeping Up With The Kardashians gives us real, joyous, ugly, unsavory, hilarious life, with all the polished sitcom trappings. And though the latter may have launched a multimedia empire, the former has made it last\".[90] Maura Kelly of The Guardian evaluated the aftermath of the failed wedding of Kim Kardashian and Kris Humphries, which was documented on Keeping Up with the Kardashians, and subsequently caused public outrage, including an online protest petition to cancel the show. \"Since Kim doesn't exactly seem to be an exemplar of self-awareness, I suppose it's possible that she really believed she and Humphries would live happily ever after,\" Kelly speculated whether or not the marriage was a publicity stunt. \"But more likely, she and E! are laughing all the way to the bank – 10.5 million viewers tuned into \"Kim's Fairytale Wedding: A Kardashian Event\", after all,\" Kelly summarized the controversy.[91] Josh Duboff, writing for Vanity Fair, commented on the show's long run and said that \"it is near impossible to argue that their continued relevance, 10 years later, is anything other than awe-inspiring and remarkable\".[92]\n\nViewership [ edit ]\n\n\"At their core, the Kardashians are an incredibly bonded, loving, large family who live an incredibly large life. And if you actually look at the history of television, there's a pretty large number of families with that blend resonating with viewers. This just happens to be the first reality show that does it. […] It's just an incredibly fascinating drama that's played out. But at its core, you know that they're going to end up around that dinner table together.\" —E! President Suzanne Kolb discusses the popularity of the series in an interview with The Wrap.[93]\n\nKeeping Up with the Kardashians has been a ratings success for E! – in its first month it became the highest-rated series aired on Sunday nights for adults 18–34 and was seen by 1.3 million total viewers, according to Nielsen Media Research.[20][94] Lisa Berger, executive vice president of original programming and series development for E!, said: \"The buzz surrounding the series is huge, and viewers have clearly fallen for the Kardashians. […] Seacrest and Bunim-Murray's unique ability to capture this family's one-of-a-kind dynamics and hilarious antics has made the series a fantastic addition to our prime-time lineup.\"[20] The second season continued the success and was viewed by 1.6 million viewers on average, which led to a third season renewal.[95] The two-hour fourth-season premiere, which aired on November 8, 2009, and featured the wedding ceremony of Khloé and Lamar Odom, brought in then-record ratings with 3.2 million viewers.[96] The subsequent season debuted with nearly 4.7 million total viewers, which ranked as the highest-rated season premiere of the show, as of August 2015.[97] It was also the second highest-rated episode of Keeping Up with the Kardashians, second only to the previous season's record-breaking finale with 4.8 million viewers.[98]\n\nThe seventh-season premiere of the series, which aired on May 20, 2012, in its earlier timeslot, continued to deliver high ratings attracting almost three million total viewers which exceeded the premiere of the previous season by 16%.[99] Kim Kardashian has explained the success of the show by saying that people tune in to watch the series because they can relate themselves to the members of the family; in an interview with the V magazine she said: \"You can see that soap operas aren't on the air as much anymore. I think reality shows are taking over that genre, but I think the draw to our show is that we are relatable.\"[100] The eighth season debuted to 3 million viewers, up 6% from the previous season, while the subsequent ninth season's premiere was down by 20%.[101][102] The ninth season averaged 3.3 million total viewers and almost 2.2 million in the 18–49 years adult demographic, the most sought after by advertisers. It was the highest rated cable show in its timeslot.[26] The series finished as the most-social ad-supported cable program and, as of March 2015, Keeping Up with the Kardashians is the most-watched show on E! network.[103] The first episode of the tenth season averaged 2.5 million viewers, slightly less than the premiere of the ninth season.[104] In 2016, a New York Times study of the 50 TV shows with the most Facebook Likes found that Keeping Up with the Kardashians \"tends to most popular in areas with large Hispanic populations, particularly in the Southwest\".[105]\n\nAwards and nominations [ edit ]\n\nDespite negative reviews from critics, Keeping Up with the Kardashians has been nominated for, and won, several television awards. The reality series has received nominations for a Teen Choice Award in the Choice TV: Celebrity Reality Show category nine consecutive times between 2008 and 2016, winning the award in 2010, 2013, 2014 and 2016. The show also won a People's Choice Award as Favorite TV Guilty Pleasure in 2011. The Kardashian sisters have been nominated as part of the cast for five awards, winning four times; Kim Kardashian has been nominated for three awards winning one in 2012. In 2010, Kris and Caitlyn Jenner received a Teen Choice Award nomination in a one-time Choice TV: Parental Unit category.\n\nBroadcast history [ edit ]\n\nThe title card of the show that was used in seasons 1–10\n\nKeeping Up with the Kardashians premiered on October 14, 2007, in the United States on the E! cable network at 10:30/9:30 pm ET/PT. The half-hour reality series continued to air every Sunday night in the same time slot, and the eight-episode first season of the show concluded on December 2. The subsequent season premiered the following year on March 9 in an earlier time slot at 10:00/9:00 pm with a repeated episode airing immediately afterwards.[120] The season ended on May 26, 2008, with an episode \"Junk in the Trunk\", which featured the Kardashian siblings sharing the most memorable moments of the season.[121] The third season commenced airing on March 8, 2009, and concluded with two back-to-back episodes which aired on May 25. The subsequent season premiered with a two-hour long episode entitled \"The Wedding\" on November 8, and ended on February 21, 2010;[120] some of the episodes aired throughout the season were extended to a full hour.[122]\n\nThe fifth season of Keeping Up with the Kardashians began airing on August 22, 2010, and concluded with another \"Junk in the Trunk\" episode on December 20.[121] The sixth season commenced on June 12, 2011, and ended with a television special \"Kim's Fairytale Wedding: A Kardashian Event\" which aired two extended episodes on October 9 and 10. The show later returned on December 19 with the episode \"Kendall's Sweet 16\".[120] Starting with the seventh season, which premiered on May 20, 2012, the half-hour reality series was extended to a full hour in a new 9:00/8:00 pm time slot.[123] The season concluded on October 28. The eighth season of the series started airing on June 2, 2013; it became the longest season with 21 episodes and ended on December 1. The ninth and tenth seasons aired in 2014 and 2015, respectively. The latter season included a television special entitled \"About Bruce\" which aired on May 17 and 18, 2015.[120] The eleventh season premiered on November 15, one month after the previous season finished.[120] The twelfth season of the show debuted on May 1, 2016.[124] The thirteenth season premiered on March 12, 2017.[125] The sixteenth season premiered on March 31, 2019.[126]\n\nIn the United States, episodes are aired in a censored form with stronger swearwords and sex references bleeped or removed. In the UK, episodes are broadcast uncensored after the watershed.[127][128]\n\nHome video releases and streaming [ edit ]\n\nIn North America, the first three seasons of the reality series were distributed on DVD.[129] The first season was released on October 7, 2008, by Lions Gate Entertainment which obtained the home entertainment distribution rights for a variety of programming from Comcast Entertainment Group, including Keeping Up with the Kardashians.[130] The second and third seasons of the series were released on November 10, 2009, and August 17, 2010, respectively.[129] In Australia, all seasons are released on DVD by Universal Sony Pictures. The latest addition, which includes the eleventh season of the show, was released on April 28, 2016.[131] In the United Kingdom, the reality series is distributed by Universal Pictures UK. The DVD set of the seventh season, the latest addition, was released on June 24, 2013.[132] The episodes of Keeping Up with the Kardashians are also available on numerous streaming video on demand services, such as Amazon Video, iTunes, Google Play, Microsoft Movies & TV,[133] Hulu,[134] and Vudu,[135] as well as the E! network's own streaming service.[136]\n\nSee also [ edit ]\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b7/Pending-protection-shackle.svg/20px-Pending-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Keeping_Up_with_the_Kardashians_s11_logo.png/250px-Keeping_Up_with_the_Kardashians_s11_logo.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/32px-Blank_television_set.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/19px-Symbol_support_vote.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Kim_Kardashian_signature.svg/80px-Kim_Kardashian_signature.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/32px-Flag_of_the_United_States.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Ryan_Seacrest_in_parade.jpg/180px-Ryan_Seacrest_in_parade.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/e/ec/KUWtK_titlecard.png/220px-KUWtK_titlecard.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikibooks-logo.svg/27px-Wikibooks-logo.svg.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Keeping_Up_with_the_Kardashians", "title": "Keeping Up with the Kardashians", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}