{"url": "http://toofab.com/2018/04/04/jon-hamm-reflects-on-soft-core-porn-past-and-stupid-fraternity-hazing-incident/", "text": "Jon Hamm got pretty candid about his life before breaking big on \"Mad Men\" in a new cover story for Esquire's The Big Black Book.\n\nReflecting on his career, the actor looked back at his oh-so-humble beginnings working in the soft-core porn industry (no, not on camera), and a fraternity hazing incident that made headlines after he became a household name.\n\nWhile Hamm has played many different roles over the years -- from Don Draper to a ruthless assassin in \"Baby Driver\" -- they don't compare to what he did before success. Moving from Missouri to Los Angeles at 25, Hamm struggled to find work and ended up getting finding employment in the adult entertainment industry.\n\n\"I got that job because of a friend of mine, this girl who was like our stage manager in college, I was hanging out with her and another friend of ours from Mizzou, commiserating at a potluck,\" he explained. \"None of us had any money. I'd lost my catering gig. I was like, 'I need a job.' My friend said, 'You can have my job. I'm doing set dressing.'\"\n\n\"I said, ‘I don't know how to do that,'\" Hamm continued, \"'It's not that hard. They'll hire anybody.' She says, 'It's just soul-crushing for me. I can't do it.' I said, 'Soul-crushing: That sounds amazing. I'll do it.' And she’s like, 'It's for these Skinemax soft-core titty movies.' I asked, 'What do you do?' She hands me this bucket with all of her tools in it and says, ‘You just move shit around. Do whatever they want you to do.' I went in the following Monday and said, 'I'm the new set dresser.' Literally, no one blinked.\"\n\nAfter acting in small roles, the actor got his big break in 2007 when he was cast as the lead in AMC's \"Mad Men,\" a role that would win him two Golden Globe awards and an Emmy. With the success of the show, media started digging into his past, uncovering a hazing incident from his time at the University of Texas in the 90s.\n\n\"Everything about that is sensationalized. I was accused of these things I don't … It's so hard to get into it,\" Hamm told the mag about the incident. \"I don't want to give it any more breath. It was a bummer of a thing that happened. I was essentially acquitted. I wasn't convicted of anything. I was caught up in a big situation, a stupid kid in a stupid situation, and it's a f-cking bummer. I moved on from it.\"\n\nAccording to the AP, Hamm's name was \"linked to a lawsuit filed by a Sigma Nu pledge who said he was severely beaten, dragged by a hammer and had his pants lit on fire ... he was charged with hazing and received deferred adjudication, which under Texas law means he had to successfully complete probation.\"\n\nThe actor later entered rehab in 2015 for alcohol abuse, right at the same time \"Mad Men\" ended and he split from his longtime girlfriend Jennifer Westfeldt.\n\n\"I had a lot of shifts in my life. A lot of rearranging of priorities,\" Hamm said while discussing that moment in his life. \"I don't think it was conscious, but it was necessary. It was tricky, and the dust is still settling in many ways.\"\n\nThe Spring + Summer issue of Esquire’s Big Black Book is available nationwide on Tuesday, April 10.\n\nThis Week in Celebrity Pictures Getty", "images": ["https://ll-assets.tmz.com/www.tmz.com/main/default/cache/images/feedlogo2.v2014_05_09_134122.gif", "https://assets.toofab.com/toofab.com/main/default/img/toofab-logo-white.svg", "https://toofab.akamaized.net/2019/04/06/elite-daily-logo-1.png", "https://assets.toofab.com/toofab.com/main/default/img/skeleton.svg", "https://toofab.akamaized.net/2018/04/04/jon-hamm-main-esquire-1200x630.jpg", "https://ll-media.tmz.com/2013/04/26/partner-rsss-justjared-logo-cut-v2.gif", "https://ssl-cdn-media.tmz.com/2013/04/26/partner-rss-fox-b-w.png", "https://toofab.akamaized.net/2019/04/06/cdl-260x30-for-tmz3-1.png", "https://toofab.akamaized.net/2018/12/19/newsletter-logo-v2-1.png", "https://ll-media.tmz.com/2013/04/26/partner-rss-thestir-logo-cut-v2-1.png"], "top_img": "https://toofab.akamaized.net/2018/04/04/jon-hamm-main-esquire-1200x630.jpg", "keywords": [], "authors": ["Toofab Staff"], "canonical_link": "https://toofab.com/2018/04/04/jon-hamm-reflects-on-soft-core-porn-past-and-stupid-fraternity-hazing-incident/", "title": "Jon Hamm Reflects on Soft-Core Porn Past and 'Stupid' Fraternity Hazing Incident", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "twitter": {"toofab": 116547240, "card": "summary_large_image", "site": "@toofab", "title": "Jon Hamm Reflects on Soft-Core Porn Past and 'Stupid' Fraternity Hazing Incident", "description": "The \"Mad Men\" star says he took over this \"soul-crushing\" job from one of his friends after moving to Los Angeles.", "image": "https://toofab.akamaized.net/2018/04/04/jon-hamm-main-esquire-1200x630.jpg"}, "verify-v1": "Wtpd0N6FufoE2XqopQJoTjWV6Co/Mny9BTaswPJbPPA=", "msvalidate.01": "AFEB17971BCF30779AEA662782EF26F4", "y_key": "14cb04e4656b0c58", "description": "The \"Mad Men\" star says he took over this \"soul-crushing\" job from one of his friends after moving to Los Angeles.", "robots": "index,follow", "referrer": "unsafe-url", "og": {"url": "https://toofab.com/2018/04/04/jon-hamm-reflects-on-soft-core-porn-past-and-stupid-fraternity-hazing-incident/", "site_name": "toofab", "type": "article", "title": "Jon Hamm Reflects on Soft-Core Porn Past and 'Stupid' Fraternity Hazing Incident", "description": "The \"Mad Men\" star says he took over this \"soul-crushing\" job from one of his friends after moving to Los Angeles.", "image": "https://toofab.akamaized.net/2018/04/04/jon-hamm-main-esquire-480x360.jpg"}, "fb": {"app_id": 116046798441464, "pages": 324392354652}, "article": {"publisher": "https://www.facebook.com/TooFab"}}, "movies": [], "publish_date": 1522771200.0, "source": "http://toofab.com", "summary": ""}