{"url": "https://www.inquisitr.com/4923985/dove-cameron-says-she-hates-how-social-media-makes-her-feel/", "text": "Dove Cameron is sharing her candid thoughts on her love-hate relationship with social media and she did so, ironically enough, on social media. In a lengthy series of videos posted on Thursday night, Cameron opened up about the sometimes dark side of social media and how it makes her feel. As reported by E!, the 22-year-old Descendants 3 actress voiced her thoughts, made in a series of selfie videos on her Instagram Stories on how lousy social media makes her feel at times.\n\n“I really hate how Instagram makes me feel, I think, and I hate how Twitter and any kind of social media makes me feel. “Whether I’m looking at other people’s lives or how I portray my life, I just hate the whole thing. I hate it. I think that they’re something super wrong with staring at other people that much and I think there’s something really wrong with staring at yourself that much. It’s like walking around with a mirror up to yourself all day long. You don’t even look at people’s eyes. You look at how you come off to them, like you’re watching yourself in a dream.”\n\nCameron’s recent declaration of the dark side of social media comes amid several polls that were carried out in recent years that shows what appears to be a growing social media fatigue worldwide, more specifically amongst the 22-year-old’s millennial generation, the first to be born while the internet was mainstream. While Cameron expressed her discomfort, she also let her fans know that sometimes social media can be a “really beautiful thing.”\n\nday off ☁️ A post shared by ♡DOVE♡ (@dovecameron) on May 31, 2018 at 12:49pm PDT\n\n“I’m not, like, condemning social media,” she went on to say. “I think that there are loads of you know, examples of when it’s been used for good and when it’s brought people together and blah blah blah and I know all of that. But I don’t think that that’s- that’s not exclusively what it is.”\n\nAs reported by Just Jared, who posted the series of videos via a fan account of Cameron, the actress also acknowledged the complete irony of her discussing her thoughts on social while being on social media.\n\n“And I supposed it’s all about defining, ’cause like, why am I even making this video right now if I’m talking about social media in this kind of light. And I guess it’s all about kind of finding your way of positively using something that can be super insidious. But then, how do you keep the insidious thing at the door? It’s just like, way too much information.”\n\n@bellamihair #dovexbellami ???? A post shared by ♡DOVE♡ (@dovecameron) on May 30, 2018 at 1:44pm PDT\n\nCameron went on to liken social media connections to a “group depression.” Research conducted over the past couple of years suggests that social media use is associated with increased depression and anxiety, although the cause and effect are still unclear.\n\nBack in 2016, Cameron revealed on Twitter that she battled with anxiety her whole life.\n\n“I can’t decide if I want to delete everything or if I want to just be like real and open and honest and live my life like this, because I don’t know what’s more important; for me to feel connected to everybody else or to myself. Can I do both? I can’t decide if I can do it all or if I have to pick and choose. And I guess that’s kind of like growing up. I can’t decide if not being able to do it all is me being afraid of my own abilities or being honest.”\n\nCameron said that at the end of it all, it boils down to individual perception, as “whatever turns out to be true for you is what’s true for you because you’re the one perceiving the world.”\n\nAt the end of her stories, Cameron also offered her fans some advice.\n\n“If there’s a way that I can say this without sounding like I’m telling you what to do, don’t put any stake on any of this. This doesn’t mean anything, doesn’t define you, doesn’t have any bearing on our soul or your worth or your self-worth. You have to find that for yourself. It’s not here. It’s not on here.”", "images": ["https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://secure.gravatar.com/avatar/3bd1a3d2c01a173ca477b7aa4785d73d?s=250&d=mm&r=g", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "https://cdn.inquisitr.com/wp-content/uploads/2018/06/GettyImages-9522791002.jpg"], "top_img": "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Tiffani Cordner"], "canonical_link": "https://www.inquisitr.com/4923985/dove-cameron-says-she-hates-how-social-media-makes-her-feel/", "title": "Dove Cameron Says She Hates How Social Media Makes Her Feel", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}