{"url": "www.tvinsider.com/696360/tom-selleck-reacts-magnum-pi-reboot-cbs/", "text": "Yes, Tom Selleck wishes the new Thomas Magnum well. No, he won’t have anything to do with it.\n\nIf you haven’t heard yet, CBS has ordered their Magnum P.I. reboot to series. If you’re a millennial who doesn’t pay attention to old stuff, that’s the loosey-goosey detective show starring the irresistibly charming Tom Selleck that ran on CBS from 1980-1988 and earned him a Best Actor Emmy.\n\nPeter Lenkov, the redo specialist responsible for updating Hawaii Five-O and MacGyver is the guy in charge. He’s hired Jay Hernandez (The Expanse, Suicide Squad) to play Thomas Magnum, like his predecessor, a former Navy Seal turned private investigator who lives in Hawaii.\n\nSo what does Selleck, now happily playing NYPD commissioner Frank Reagan in Blue Bloods, another long-running series — it will beat Magnum’s length of service next season — have to say about the new version? He chose to share his feelings for the first time to TV Guide Magazine and TV Insider.\n\nThe actor says when he was in L.A. (he lives on a ranch north of the city when he’s not shooting Blue Bloods) he was asked to come to CBS’s West Coast HQ for a meeting with Lenkov and David Stapf, the CBS TV Studios president.\n\n“CBS is kind of my home network,” says Selleck. “I’ve done The Young and the Restless and (most of) the Jesse Stone movies as well as Magnum and Blue Bloods with them.” They told him if he “had a problem” with the remake, their relationship was important enough that they wouldn’t do it. \"Peter was very effusive about the project; he grew up with Magnum and this was his dream,” he adds.\n\nStapf suggested that he talk to Les Moonves, CBS Corporation’s CEO and Chairman of the Board. According to Selleck, Moonves talked about how, since Universal owned the show, they could “do whatever they want with it,” the actor recalls. “Les said, ‘We’d like to control the show We think we can do a better job.’\"\n\n\"I went home,” Selleck continues, “and thought about it for about a day. In the end, I thought, ‘We couldn’t have a better bow tied around our show. We went off with our final episode as the number one show on all of television. We’re in the Smithsonian for recognizing Vietnam veterans in a positive light, the first show to really do that. And it led to countless other opportunities. I just felt success is so hard to come by in this business, why do I want to root for somebody to fail. I just stepped back, and said, ‘I won’t get in your way.'”\n\nHe also won’t be involved in any way. “They asked and I said, ‘Absolutely not. I’m busy with Blue Bloods.’” But more than that, he concedes, “It will never be what in my fantasy world, I would make it to be.”\n\nDon’t expect a fun guest spot either. “I told them that I won’t do some cameo guest spot to let the audience know I approve.” He’s aware that could disappoint some fans of his and the shows. “I’m sure they’d like it, but I have an obligation to my version. And Peter’s going to do his take on what a Magnum under some similar circumstances should be about.”\n\nThis isn’t the first time that Selleck turned down a TV offer concerning the ionic role. In the early ‘90s, Selleck was working with big fan and best-selling author Tom Clancy — just off the success of The Hunt for Red October — on a Magnum movie. “Tom and I worked on a story — a good story for a movie. The character wasn’t done; when we left him, he went back into the Navy. I thought it was time because I was having success with features. Three Men and a Baby had been the number one movie in the world.”\n\nUniversal Studio chief Sidney Sheinberg had other ideas, Selleck says. He wanted to use Magnum in a wheel of rotating mysteries. “I had no interest; they weren’t thinking big enough and they really blew it.”\n\nOver the years, Selleck says he heard rumors about other movies and TV ideas. He didn’t speak ill of them, but he “wasn’t particularly thrilled,\" he admits. \"This seemed okay because it’s probably going to happen sooner or later. Why choose to be offended? This is Peter’s dream, let him run with it. He’s a nice man.”\n\nFor lots more from our chat with Tom Selleck, pick up the June 25 issue of TV Guide Magazine.", "images": ["https://www.tvinsider.com/wp-content/uploads/2018/06/112315_0574b-1-819x570.jpg", "https://www.tvinsider.com/wp-content/uploads/2018/06/111719_234b-1014x570.jpg", "https://www.tvinsider.com/wp-content/uploads/2017/04/Untitled-1-234x155.jpg", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner2.png", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner3.png", "http://b.scorecardresearch.com/p?c1=2&c2=19587797&cv=2.0&cj=1", "https://www.tvinsider.com/wp-content/uploads/2017/02/logo-tvinsider.png", "https://www.tvinsider.com/wp-content/uploads/2020/04/comfort-tv-logo.gif?x=1", "https://www.tvinsider.com/wp-content/uploads/2018/05/18-22-2499-234x155.jpg", "https://www.tvinsider.com/wp-content/uploads/2018/06/112001_2639b-855x570.jpg", "https://www.tvinsider.com/wp-content/uploads/2018/01/magnum-pi_34e8f280-848x570.jpg", "https://www.tvinsider.com/wp-content/uploads/2017/01/logo-footer.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://www.tvinsider.com/wp-content/uploads/2020/03/tvi-white.png", "https://www.tvinsider.com/wp-content/uploads/2018/04/18-18-5074-234x155.jpg", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner1-38x32.png", "https://www.tvinsider.com/wp-content/uploads/2020/04/Bosch-Season-6-304x195.jpg", "https://www.tvinsider.com/wp-content/uploads/2017/08/OnDISH_Mini-Logo.png", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner6.png", "https://www.tvinsider.com/wp-content/uploads/2018/12/TVG52_C1_TheGoodPlace_News_HR.jpg", "https://www.tvinsider.com/wp-content/uploads/2017/01/partner4.png", "https://www.tvinsider.com/wp-content/uploads/2017/01/whats-on.png", "http://pixel.quantserve.com/pixel/p-sRxQ0qKU4hQu4.gif"], "top_img": "https://www.tvinsider.com/wp-content/uploads/2018/06/111719_234b-1014x570.jpg", "keywords": [], "authors": ["Ileane Rudolph", "Tv Insider Staff", "Meaghan Darwish", "Meredith Jacobs", "Matt Roush", "Ryan Berenz", "Dan Clarendon"], "canonical_link": "https://www.tvinsider.com/696360/tom-selleck-reacts-magnum-pi-reboot-cbs/", "title": "Tom Selleck Weighs In on the 'Magnum P.I.' Reboot — And If He'll Make a Cameo", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "google-site-verification": "it2r-MRipevefeCYWkPlW540pNwHDj9JpbST3-LAA-o", "pocket-site-verification": "c2d9d3d73032bf0b0959f31688efb2", "fb": {"pages": 112199118797264, "app_id": 2128917200700396}, "og": {"site_name": "TV Insider", "description": "For the first time, the 'Blue Bloods' star shared with us his feelings on his show being remade.", "url": "https://www.tvinsider.com/696360/tom-selleck-reacts-magnum-pi-reboot-cbs/", "title": "Tom Selleck Weighs In on the 'Magnum P.I.' Reboot — And If He'll Make a Cameo", "type": "article", "image": {"identifier": "https://www.tvinsider.com/wp-content/uploads/2018/06/111719_234b-1014x570.jpg", "width": 1014, "height": 570}}, "theme-color": "#00aeef", "title": "Tom Selleck Weighs In on the 'Magnum P.I.' Reboot — And If He'll Make a Cameo", "description": "For the first time, the 'Blue Bloods' star shared with us his feelings on his show being remade.", "author": "Ileane Rudolph", "twitter": {"site": "@tvinsider", "url": "https://www.tvinsider.com/696360/tom-selleck-reacts-magnum-pi-reboot-cbs/", "title": "Tom Selleck Weighs In on the 'Magnum P.I.' Reboot — And If He'll Make a Cameo", "creator": "@tvinsider", "description": "For the first time, the 'Blue Bloods' star shared with us his feelings on his show being remade.", "image": "https://www.tvinsider.com/wp-content/uploads/2018/06/111719_234b-1014x570.jpg?249", "card": "summary_large_image"}}, "movies": [], "publish_date": null, "source": "http://www.tvinsider.com", "summary": ""}