{"url": "https://people.com/tv/complicated-duggar-births/", "text": "With 19 kids and 10 grandkids, Jim Bob and Michelle Duggar are no strangers to the experience of childbirth — and its complications.\n\nOn Monday, TLC aired a one-hour Counting On special chronicling the couple’s daughter Joy-Anna‘s journey to becoming a first-time mom. The 20-year-old was rushed to the hospital for an emergency C-section after discovering her baby was breech — but that’s not the first time a Duggar woman has faced challenges bringing a child into the world. Here’s a look back at some of their most intense labors.\n\nGet push notifications with news, features and more.\n\nMICHELLE\n\nPerhaps the most harrowing birth experience in the family was when matriarch Michelle, now 51, welcomed her youngest child, daughter Josie, nearly three months premature on Dec. 10, 2009. Born at 25 weeks by emergency C-section after Michelle was diagnosed with preeclampsia, Josie weighed only 1 lb., 6 oz. (Michelle’s condition was discovered when she was admitted to the hospital to evaluate pain related to a gall bladder problem. Preeclampsia causes high blood pressure, which meant an emergency C-section was needed to ensure the elevated blood pressure would not be detrimental to her or the baby.)\n\nEight days later, Josie’s bowel perforated. The micro-preemie was rushed from the University of Arkansas for Medical Sciences in Little Rock, Arkansas, the hospital where she was born, to Arkansas Children’s Hospital, her parents at her side. At the time, her physician Dr. Robert Arrington, co-director of the neonatal intensive care unit, told PEOPLE that Josie “developed a spontaneous bowel perforation.” She responded to placement of an abdominal drain, plus antibiotics, and did not require an open operation — wonderful news for her frightened parents.\n\n“Josie is walking a daily tightrope to keep her vitals stable and the nurses and the whole team here has been wonderful,” said Jim Bob at the time. “Years ago, a baby this small wouldn’t have lived an hour. We are so grateful for the ability to help her.”\n\n“It is incredible what the doctors and nurses can do to save the life of this little person,” added Michelle.\n\nAfter nearly four months in neonatal intensive care, Josie left the hospital — only to be rushed back a few days later after her vital signs dropped. She finally returned home for good two months later, once she had grown to a “chunky” 9 lbs., 1 oz.\n\n“We’re so happy that she’s doing so well,” Michelle told PEOPLE at the time. “She’s finally home, home, home. She has a double chin now. It is so precious.”\n\nJILL\n\nJim Bob and Michelle’s daughter Jill, 26, welcomed her first child with husband Derick Dillard, 29, on April 6, 2015 — after close to three days in labor with intermittent contractions that sometimes were right on top of one another, within a minute apart.\n\nJill shared the intimate details of her son Israel David’s birth with PEOPLE exclusively. Her water broke in the early hours of Saturday, April 4, and the Duggar family — including Michelle and sister, Jana, 28 — all pitched in to help her during labor. Though Jill was hoping for a natural delivery at her home in Rogers, Arkansas, Israel’s birth “didn’t go as expected.”\n\nAfter her March 24 due date passed, Jill’s water finally broke 41 weeks and five days into her pregnancy, but complications followed. The mom-to-be tested positive for strep B, a common bacteria that can be transferred from mom to baby during birth, and began taking antibiotics via an IV. After 20 hours in labor and little progression, Jill saw a faint stain of meconium (the earliest waste of an unborn infant, often a sign of fetal distress) and decided it was time to move to the hospital.\n\nOnce there, Jill initially declined Pitocin (a hormone that greatly speeds up labor) and pain medication — but after 70 hours in labor, the baby had flipped into a transverse breech position (sideways and upside down), was experiencing irregular heart rates and had not yet descended. Upon hearing the doctors’ concerns, the couple decided to move forward with a C-section and finally welcomed their long-awaited 9-lb., 10-oz. baby boy.\n\n“I love our birth story because it bonded us so well,” said Jill at the time. “Having him here — it’s worth all of it. I wouldn’t do anything differently.”\n\nJill and Derick welcomed their second child, son Samuel Scott, on July 8, 2017. After 40 hours of labor he was delivered via C-section at the hospital, weighing 9 lbs. and 10 oz.\n\n“There’s a level of ease that comes with your second pregnancy,” Jill told PEOPLE before Samuel’s birth. “Derick and I have been down this road together, so we’re comfortable. I’m just going to see how it goes, try to be healthy and prepare as much as I can. But this time I know that labor is unpredictable.”\n\nJESSA\n\nJill’s sister Jessa, 25, welcomed her first child with husband Ben Seewald, 22, on Nov. 5, 2015. Originally due to deliver on Nov. 1 (coincidentally her one-year anniversary with Ben), Jessa went through 10 hours of contractions that almost forced her to change her plan of having an all-natural home birth.\n\n“Labor is hard,” she later told PEOPLE. “It was very intense, very long. Everything was different than I expected. I said, ‘That’s it! I’m done! I am going to the hospital and I’m going to get an epidural.’ They asked me if I really wanted to do that and I said, ‘No, I don’t, but I do.’ I wanted to try natural if at all possible.”\n\nTheir son Spurgeon Elliot finally arrived, weighing 9 lbs. and 11 oz. — but their joy was soon interrupted by a surprisingly scary moment as Jessa began bleeding so much that her midwife became concerned. Michelle called 911, and the new mom was rushed to hospital. After nearly fainting, Jessa had to undergo a blood transfusion and stay overnight. (Her son was later brought to her side.)\n\n“I had dreamed about those first moments, getting to breastfeed right away, all that — and so when I had to go to the hospital, it was a shock,” she admitted.\n\nBut looking back on the nearly 48-hour delivery, Jessa was all smiles.\n\n“I can’t believe he’s really ours,” she said. “It is so amazing. He’s a miracle.”\n\nRELATED: Gideon! Israel! Spurgeon! Your Official Guide to the Next Generation of Duggars\n\nJessa had a much more relaxed experience welcoming her second child, son Henry Wilberforce, on Feb. 6, 2017. Opting once again for a home birth and enlisting the same midwife and assistant, Jessa’s water broke just before midnight on Feb. 5, and within two hours she was experiencing strong contractions.\n\nThe TLC star later told PEOPLE she and her husband were “surprised at how fast it went,” and baby Henry was born at 4:26 a.m., weighing 8 lbs., 11 oz. — arriving so quickly that Michelle and Jana nearly missed the birth.\n\n“They came at the very end,” recalled Jessa. “I was already pushing when they walked in the door!”\n\nJOY-ANNA\n\nThe youngest Duggar mom, Joy-Anna, welcomed her first child with husband Austin Forsyth on Feb. 23: a healthy baby boy named Gideon Martyn Forsyth. Like her sister Jessa, Joy-Anna was set on a home birth.\n\nRELATED: Joy-Anna Duggar Gave Birth in a Hospital Instead of at Home — Why Home Births Can Be Risky\n\n“I decided to have a home birth, just because I know that it’s more comfortable being at home,” she explained on Counting On. “I really wanted to at least try it, and we’re only about 30 minutes from the hospital, so it’s not too bad in case of an emergency or a change of plans.”\n\nBut after being in labor for over 20 hours at home, Joy-Anna’s midwife determined the baby was breech. She was rushed to the hospital, where she learned that she needed an emergency C-section. “Huge” baby Gideon arrived at 3:39 p.m., measuring 22 inches long and weighing 10 lbs., 3 oz.\n\n“I think it’s pretty amazing,” said new dad Austin. “God is good.”\n\n“He’s got Austin’s nostrils,” added Joy-Anna. “We are doing well. Love you guys, thank you for your prayers. We are so happy that our little one has finally arrived and we’re parents.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F05%2Fduggar1-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F05%2Fduggar1-1-2000.jpg", "keywords": [], "authors": ["Aurelie Corinthios"], "canonical_link": "https://people.com/tv/complicated-duggar-births/", "title": "Emergency C-Sections, Days-Long Labor and Breech Babies: The Most Complicated Duggar Births", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Jessa Duggar,Jill Duggar,Joy-Anna Duggar,Michelle Duggar,News,The Duggars,TV", "news_keywords": "Jessa Duggar,Jill Duggar,Joy-Anna Duggar,Michelle Duggar,News,The Duggars,TV", "description": "With 19 kids and 10 grandkids, Jim Bob and Michelle Duggar are no strangers to the experience of childbirth — and its challenges", "og": {"title": "Emergency C-Sections, Days-Long Labor and Breech Babies: The Most Complicated Duggar Births", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/complicated-duggar-births/", "description": "With 19 kids and 10 grandkids, Jim Bob and Michelle Duggar&nbsp;are no strangers to the experience of childbirth — and its complications. On Monday, TLC&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F05%2Fduggar1-1-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/complicated-duggar-births/", "description": "With 19 kids and 10 grandkids, Jim Bob and Michelle Duggar are no strangers to the experience of childbirth — and its challenges", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F05%2Fduggar1-1-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/complicated-duggar-births/", "title": "Emergency C-Sections, Days-Long Labor and Breech Babies: The Most Complicated Duggar Births", "description": "With 19 kids and 10 grandkids, Jim Bob and Michelle Duggar are no strangers to the experience of childbirth — and its challenges", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F05%2Fduggar1-1-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": ["https://www.youtube.com/embed/_PAaQ9Tcxdo", "https://www.youtube.com/embed/OZ7BLiJ8lxI", "https://www.youtube.com/embed/-BdwkEZNNAI"], "publish_date": null, "source": "https://people.com", "summary": ""}