{"url": "https://variety.com/2018/digital/news/13-reasons-why-season-2-premiere-date-netflix-1202791730/", "text": "Netflix will premiere “13 Reasons Why” Season 2, the next chapter in its controversial hit teen-suicide drama, on May 18.\n\nThe streamer announced the premiere date on social media, with the caption, “The tapes were just the beginning.” That came after it teased the reveal in posts earlier Monday saying “The truth is developing” and a live-stream showing two Polaroid photos — leaving fans on tenterhooks for several hours.\n\nThe tapes were just the beginning. May 18. pic.twitter.com/MZczjM1fP3 — 13 Reasons Why (@13ReasonsWhy) April 30, 2018\n\nNetflix announced the renewal of “13 Reasons” last May, after the freshman season debuted in March 2017 and quickly captured widespread buzz.\n\nThe first season of the series, based on Jay Asher’s young-adult book by the same name, centers around the death a high-school girl, Hannah, played by Katherine Langford, who has left behind a series of 13 cassette tapes for her friend and crush Clay (Dylan Minnette) explaining what led her to suicide. The show also stars Christian Navarro, Alisha Boe, Brandon Flynn, Justin Prentice, Miles Heizer, Brian d’Arcy James, and Kate Walsh.\n\nSeason 2 picks up in the aftermath of Hannah’s death, as the other characters start their journeys toward healing and recovery. In the upcoming season, Hannah’s parents file a lawsuit against Liberty High School. But, according to Netflix, “A series of ominous Polaroids lead Clay and his classmates to uncover a sickening secret and a conspiracy to cover it up.”\n\n“13 Reasons Why” season 2 is being produced for Netflix by Paramount Television. The show is also executive produced by Selena Gomez, along with Mandy Teefey, Kristel Laiblin, Joy Gorman Wettels, Michael Sugar and Steve Golin.\n\nThe first season of the show stimulated discussions about teen suicide — and controversy. After its release Netflix added more viewer warnings to “13 Reasons Why,” which is rated TV-MA, and included links to suicide-prevention resources in the documentary the accompanies the series. It ranked as the fourth most-tweeted-about TV show of 2017 (after “Game of Thrones,” “Stranger Things” and “Big Brother”).\n\nNetflix said season 2 of “13 Reasons Why” will carry a new warning video in front of each episode telling viewers about how to get help and pointing them to resources on the website 13reasonswhy.info. It also plans an after-show, “Beyond the Reasons,” with the show’s actors, experts, and educators breaking down the series.\n\nThe season 2 announcement trailer features Depeche Mode’s 1993 single “I Feel You”:", "images": ["https://pmcvariety.files.wordpress.com/2017/01/13-reasons-why-netflix.jpg?w=608", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Fdigital%2Fnews%2F13-reasons-why-season-2-premiere-date-netflix-1202791730%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202791730", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pmcvariety.files.wordpress.com/2017/01/13-reasons-why-netflix.jpg?w=608&h=342&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2017/01/13-reasons-why-netflix.jpg?w=608", "keywords": [], "authors": ["Todd Spangler"], "canonical_link": "https://variety.com/2018/digital/news/13-reasons-why-season-2-premiere-date-netflix-1202791730/", "title": "‘13 Reasons Why’ Season 2 Premiere Date, Teaser Trailer Revealed", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Netflix will premiere \"13 Reasons Why\" Season 2, the next chapter in its controversial hit teen-suicide drama, on May 18. The streamer announced the premiere date on social media, with the caption, \"The tapes were just the beginning.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202791730, "author": "Todd Spangler", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-04-30T15:01:49"}, "pmc-tag": "13 Reasons Why,Netflix", "title": "‘13 Reasons Why’ Season 2 Premiere Date, Teaser Trailer Revealed", "pageclass": "article", "pmc-vertical": "digital,tv", "pmc-primary-category": "News", "pmc-primary-vertical": "digital", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "‘13 Reasons Why’ Season 2 Premiere Date, Teaser Trailer Revealed", "url": "https://variety.com/2018/digital/news/13-reasons-why-season-2-premiere-date-netflix-1202791730/", "description": "Netflix will premiere “13 Reasons Why” Season 2, the next chapter in its controversial hit teen-suicide drama, on May 18. The streamer announced the premiere date on social media, with …", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/01/13-reasons-why-netflix.jpg?w=608", "width": 608, "height": 342, "alt": "13 Reasons Why Netflix"}, "locale": "en_US"}, "article": {"published_time": "2018-04-30T22:01:49+00:00", "modified_time": "2018-05-21T16:08:24+00:00"}, "twitter": {"creator": "@https://twitter.com/xpangler", "site": "@variety", "text": {"title": "‘13 Reasons Why’ Season 2 Premiere Date, Teaser Trailer Revealed"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/01/13-reasons-why-netflix.jpg?w=608", "alt": "13 Reasons Why Netflix"}, "card": "summary_large_image", "title": "‘13 Reasons Why’ Season 2 Premiere Date, Teaser Trailer Revealed", "description": "Netflix will premiere “13 Reasons Why” Season 2, the next chapter in its controversial hit teen-suicide drama, on May 18. The streamer announced the premiere date on social media, with …"}, "author": "Todd Spangler", "content_type": "Article", "post_id": 1202791730, "title": "‘13 Reasons Why’ Season 2 Premiere Date, Teaser Trailer Revealed", "published_at": "2018-04-30 15:01:49", "image": "https://pmcvariety.files.wordpress.com/2017/01/13-reasons-why-netflix.jpg?w=608", "comment_count": 0, "tags": "Netflix", "topics": "News", "appeared_in_print": "No", "body": "Netflix will premiere \"13 Reasons Why\" Season 2, the next chapter in its controversial hit teen-suicide drama, on May 18.\r\n\r\nThe streamer announced the premiere date on social media, with the caption, \"The tapes were just the beginning.\" That came after it teased the reveal in posts earlier Monday saying \"The truth is developing\" and a live-stream showing two Polaroid photos — leaving fans on tenterhooks for several hours.\r\n\r\nhttps://twitter.com/13ReasonsWhy/status/991074716348768256\r\n\r\nNetflix announced the renewal of \"13 Reasons\" last May, after the freshman season debuted in March 2017 and quickly captured widespread buzz.\r\n\r\nThe first season of the series, based on Jay Asher's young-adult book by the same name, centers around the death a high-school girl, Hannah, played by Katherine Langford, who has left behind a series of 13 cassette tapes for her friend and crush Clay (Dylan Minnette) explaining what led her to suicide. The show also stars Christian Navarro, Alisha Boe, Brandon Flynn, Justin Prentice, Miles Heizer, Brian d’Arcy James, and Kate Walsh.\r\n\r\nSeason 2 picks up in the aftermath of Hannah’s death, as the other characters start their journeys toward healing and recovery. In the upcoming season, Hannah's parents file a lawsuit against Liberty High School. But, according to Netflix, \"A series of ominous Polaroids lead Clay and his classmates to uncover a sickening secret and a conspiracy to cover it up.\"\r\n\r\n\"13 Reasons Why\" season 2 is being produced for Netflix by Paramount Television. The show is also executive produced by Selena Gomez, along with Mandy Teefey, Kristel Laiblin, Joy Gorman Wettels, Michael Sugar and Steve Golin.\r\n\r\nThe first season of the show stimulated discussions about teen suicide -- and controversy. After its release Netflix added more viewer warnings to “13 Reasons Why,” which is rated TV-MA, and included links to suicide-prevention resources in the documentary the accompanies the series. It ranked as the fourth most-tweeted-about TV show of 2017 (after \"Game of Thrones,\" \"Stranger Things\" and \"Big Brother\").\r\n\r\nNetflix said season 2 of \"13 Reasons Why\" will carry a new warning video in front of each episode telling viewers about how to get help and pointing them to resources on the website 13reasonswhy.info. It also plans an after-show, “Beyond the Reasons,” with the show's actors, experts, and educators breaking down the series.\r\n\r\nThe season 2 announcement trailer features Depeche Mode's 1993 single \"I Feel You\":\r\n\r\nhttps://www.youtube.com/watch?v=O92pekaban8", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": ["https://www.youtube.com/embed/O92pekaban8?version=3&enablejsapi=1&origin=https://pmcvariety.wordpress.com&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": 1525125709.0, "source": "https://variety.com", "summary": ""}