{"url": "https://fierce.wearemitu.com/entertainment/internet-slamming-roselyn-sanchez-hosting-latin-grammys-weeks-giving-birth-just-shut/", "text": "Are working women supposed to surrender to the limits society shoves onto them the minute they become moms? Roselyn Sánchez certainly doesn’t think so. The Puerto Rican actress recently came under fire from fans who criticized her for hosting the Latin Grammys just weeks after giving birth to her son, Dylan Gabriel.\n\nIn a post to her Instagram page, the “Devious Maids” star reminded social media that she’s got the whole “working mom” thing on lock, is a bit too busy for their opinions.\n\nThe whole thing started when Sánchez posted a photo of herself glamming and ramping up to host the Latin Grammy Awards.\n\nAmanecida.. acabada! Con ojeras y stress.. pero ahí vamos ?? Getting ready to host the Latin Grammy’s. Vegas here we come.. con bebé y to’! pic.twitter.com/u4Ba09O2vG — Roselyn Sanchez (@Roselyn_Sanchez) November 13, 2017\n\nTons flooded her Twitter and Instagram with comments of how excited they were for her.\n\nAhhh y yo estoy súper contenta que tu eres una de las presentadoras, boricua power. — pam.?? (@demilyangels) November 13, 2017\n\n“I’m super happy you’re one of the presenters. Boricua Power,” wrote a fan.\n\nBella! Eres una inspiración! Arriba Boricua con bebe y to’!!?? — Yari Juliano Chaar (@Yariju) November 14, 2017\n\nAnother celebrated Sánchez, saying, “Beautiful! You’re an inspiration! Arriba Boricua, and with a baby and everything!”\n\nStill, some were quick to remind her that she’d been in the delivery room just two weeks before and told her to stay home.\n\n??? niñaaa acabas de tener al bebé , quédate tranquila en casa. — Giannina Antinori (@Giannin93046740) November 14, 2017\n\n“Niña, you just had the baby, stay relaxed at home,” one fan wrote to the actress.\n\nIt wasn’t long before Sánchez reacted to the comments with a video telling fans there’s no reason to worry.\n\nEverything under control! Don’t worry mi gente… It’s going to be great and a lot of fun. Pasito a pasito suave suavecito! Promise!! Baby Dylan Gabriel está conmigo!! Tranquilito… ?? A post shared by roselyn sanchez (@roselyn_sanchez) on Nov 15, 2017 at 12:29pm PST\n\nI mean, just because she’s the mom of a newborn it doesn’t mean she has to stop the hustle.\n\nSánchez patiently took some time from rehearsals to explain to fans and critics that she and baby Dylan are totally fine, and she’s ready to host the show.\n\n“I have read comments on my social media that show there are a lot of people worried. They tell me, ‘Roselyn, take care of yourself. You just had a baby and it’s dangerous. You have to rest for 40 days.’ You are absolutely right, but I already committed,” say says in the video.\n\n“I’m here. I’m not 100 percent recovered, but I feel good. I promise you that I’m taking care of myself. The baby is at the hotel with his two nannies and he is calm. Everything is Okay, so don’t worry. We are going to do the show tomorrow. It’s going to come out great. I’m doing it with a lot of love for all my people in Puerto Rico. To represent my country, I’ll make the sacrifice. Pray for me. The show will be spectacular,” she continues.\n\nIn the lead up to the awards show, Sánchez has been flaunting her #workingmom skills and ability to get back in the saddle.\n\nToday is going to be crazy amazing!! Pero lo primero es primero… nursing baby Dylan to start my day right! ???? #latingrammys #workingmom #agradecida #pa’lante #?? A post shared by roselyn sanchez (@roselyn_sanchez) on Nov 16, 2017 at 7:35am PST\n\nBefore the show, Sánchez posted a photo of her nursing (because clearly anyone’s opinion about where/how she breastfeeds doesn’t phase her in the least bit).\n\n“Today is going to be crazy amazing! Pero lo primero es primero… [but first things first] nursing baby Dylan to start my day right! #latingrammys #workingmom,” Sanches wrote in the post.\n\nSánchez’s response to critics is a reflection of the various expectations that tend to hold back so many of today’s working moms. In a world where things like the motherhood penalty and the fatherhood bonus are very much alive and well, Sánchez serves as a face representing millions of women dispelling the harmful patterns that prevent mothers from getting paid equally and moving forward in their careers. Gotta love a badass Latina who knows how to juggle many hats and keep up the good fight!\n\n\n\n\n\nRecommend this story to your friends by clicking the share button below!", "images": ["https://www.facebook.com/tr?id=981841528666204&ev=PageView&noscript=1", "https://d18ufwot1963hr.cloudfront.net/wp-content/uploads/sites/2/2017/09/26090201/BHlogo.png", "https://d18ufwot1963hr.cloudfront.net/wp-content/uploads/sites/2/2017/11/17231154/Woman.jpg", "https://dd2d9j2i66w9u.cloudfront.net/wp-content/uploads/2019/01/02103344/banner-05.png", "https://pixel.quantserve.com/pixel/p-KNDAJyf-PrtnR.gif", "https://d18ufwot1963hr.cloudfront.net/wp-content/uploads/sites/2/2017/09/26094737/mitu_logo.png", "https://d18ufwot1963hr.cloudfront.net/wp-content/uploads/sites/2/2017/09/26090015/MiTu_logo_black-1.png"], "top_img": "https://d18ufwot1963hr.cloudfront.net/wp-content/uploads/sites/2/2017/11/17231154/Woman.jpg", "keywords": [], "authors": ["Alex Portée"], "canonical_link": "https://fierce.wearemitu.com/entertainment/internet-slamming-roselyn-sanchez-hosting-latin-grammys-weeks-giving-birth-just-shut/", "title": "Roselyn Sánchez Criticized For Hosting Latin Grammys After Giving Birth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0", "description": "The Puerto Rican actress recently came under fire from fans who criticized her for hosting the Latin Grammys last night just weeks after giving birth", "og": {"locale": "en_US", "type": "article", "title": "The Internet Came For Roselyn Sánchez For Hosting The Latin Grammys Weeks After Giving Birth And She Graciously Shut It Down", "description": "Are working women supposed to surrender to the limits society shoves onto them the minute they become moms? Roselyn Sánchez certainly doesn't think so. The Puerto Rican actress recently came under fire from fans who criticized her for hosting the Latin Grammys just weeks after giving birth to her so", "url": "https://fierce.wearemitu.com/entertainment/internet-slamming-roselyn-sanchez-hosting-latin-grammys-weeks-giving-birth-just-shut/", "site_name": "Fierce", "updated_time": "2017-11-17T23:12:05+00:00", "image": {"identifier": "https://d18ufwot1963hr.cloudfront.net/wp-content/uploads/sites/2/2017/11/17231154/Woman.jpg", "url": "https://d18ufwot1963hr.cloudfront.net/wp-content/uploads/sites/2/2017/11/17231154/Woman.jpg", "secure_url": "https://d18ufwot1963hr.cloudfront.net/wp-content/uploads/sites/2/2017/11/17231154/Woman.jpg", "width": 700, "height": 450}}, "article": {"tag": "birth", "section": "Entertainment", "published_time": "2017-11-17T22:50:20+00:00", "modified_time": "2017-11-17T23:12:05+00:00"}, "twitter": {"card": "summary_large_image", "description": "Are working women supposed to surrender to the limits society shoves onto them the minute they become moms? Roselyn Sánchez certainly doesn't think so. The Puerto Rican actress recently came under fire from fans who criticized her for hosting the Latin Grammys just weeks after giving birth to her so", "title": "The Internet Came For Roselyn Sánchez For Hosting The Latin Grammys Weeks After Giving Birth And She Graciously Shut It Down", "image": "https://d18ufwot1963hr.cloudfront.net/wp-content/uploads/sites/2/2017/11/17231154/Woman.jpg", "url": "https://fierce.wearemitu.com/entertainment/internet-slamming-roselyn-sanchez-hosting-latin-grammys-weeks-giving-birth-just-shut/", "site": "@fiercebymitu"}, "fb": {"app_id": 214730639036713, "use_automatic_ad_placement": "true"}}, "movies": [], "publish_date": 1510959020.0, "source": "https://fierce.wearemitu.com", "summary": ""}