{"url": "https://www.harpersbazaar.com/celebrity/latest/a21937228/meghan-markle-prince-harry-queens-young-leaders-awards-photos/", "text": "The Duchess of Sussex has joined her husband and the Queen for the Queen's Young Leaders Awards in Buckingham Palace. This marks her first time attending the ceremony, which honors young people for leadership and service in their communities.\n\nFor the event, Meghan Markle donned a light pink Prada short sleeve top and skirt set adorned with double-breasted button down the front. The Italian designer is a departure from her go-to label, Givenchy, who she previously wore at royal events including her wedding to Prince Harry. She accessorized today's look with black Aquazzura pumps and a Prada clutch.\n\nFacebook\n\nWATCH: The Queen, Sir John Major and the Duke and Duchess of Sussex (wearing @Prada) arrive for the #QueensYoungLeaders awards ceremony: pic.twitter.com/myMV3RmaaS — Emily Nash (@emynash) June 26, 2018\n\nMarkle's neutral look was a hushed contrast to the Queen's bright yellow and green dress. It's the latest in impressive looks from the Duchess, who continues to impress even without a stylist, Vanity Fair reports. However, she does get style advice from Prince Harry, who occasionally weighs in on her looks.\n\nYouTube\n\nGetty Images\n\nThe Duchess sat intently in the front row as her husband gave a speech and while the Queen honored the young recipients. As the Duke of Sussex addressed the crowd, he mentioned that his wife would be joining in on the work.\n\n\"I, together with my wife Meghan, look forward to convening young people from around The Commonwealth to hear your ideas, work with you to build platforms for you to collaborate and form partnerships, as we travel around in our work, he said, per royal commentator Omid Scobie.\n\nGetty Images\n\nToday's awards also marks another event hosted by the Queen and Markle, following their day of joint engagements in Chester, England earlier this month. That time, however, Prince Harry wasn't present.\n\nAside from official business, Markle has also attended events with the Queen and the rest of the royal family, such as the Royal Ascot last week and Trooping the Colour, which honors Her Majesty's birthday, earlier this month.\n\nThe @QueensLeaders award winners arrive in the ballroom: pic.twitter.com/avQEhtf0Ay — Emily Nash (@emynash) June 26, 2018\n\nThe Queen's Young Leaders Awards were created in 2014 to honor exceptional young people across the 52 nations of the Commonwealth, according to the royal family's website. Hundreds of people apply every year. By now, the program has created a community of 240 individuals.\n\nHer Majesty awards the recipients with medals then hosts a reception at Buckingham Palace. At last year's awards, a dinner followed at London's Australia House, which Prince Harry attended. Perhaps this time Markle will be by his side.\n\nFrom fighting for gender equality to tackling climate change, the #queensyoungleaders have received their Awards from HM The Queen for the amazing things they’re doing to improve the lives of others. Congratulations to each and every one of them. pic.twitter.com/O31SSRBAg4 — DiamondJubileeTrust (@qejubileetrust) June 26, 2018\n\nThe Sussexes weren't the only celebrities at the event; David Beckham was also in tow, looking dapper as ever. The last time we saw him at a royal event was at Harry and Meghan's wedding last month.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-meghan-harry-queen-shutterstock-index-1530038854.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-meghan-harry-queen-shutterstock-index-1530038854.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": ["Erica Gonzales"], "canonical_link": "https://www.harpersbazaar.com/celebrity/latest/a21937228/meghan-markle-prince-harry-queens-young-leaders-awards-photos/", "title": "Meghan Markle Wears Prada with the Queen and Prince Harry at the Queen's Young Leaders Awards", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#606060", "og": {"type": "article", "site_name": "Harper's BAZAAR", "title": "Meghan Markle Wears Prada with the Queen and Prince Harry at the Queen's Young Leaders Awards", "description": "The Duchess of Sussex stuns once again.", "url": "https://www.harpersbazaar.com/celebrity/latest/a21937228/meghan-markle-prince-harry-queens-young-leaders-awards-photos/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-meghan-harry-queen-shutterstock-index-1530038854.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "modified_time": "2018-06-26 07:18:13", "published_time": "2018-06-26 05:34:00", "section": "Celebrity News", "opinion": "false"}, "twitter": {"site": "@harpersbazaarus", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-meghan-harry-queen-shutterstock-index-1530038854.jpg?crop=1.00xw:1.00xh;0,0&resize=640:*"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "title": "Meghan Markle Wears Prada with Prince Harry at The Queen's Young Leaders Awards", "description": "Meghan Markle attends the Queen's Young Leaders Awards with her husband Prince Harry and grandmother-in-law Queen Elizabeth II. This marks another rare joint event with Her Majesty for the Duchess of Sussex.", "keywords": "meghan markle, prince harry, queens young leaders, the queen, queen elizabeth, meghan markle and the queen, meghan markle prince harry, meghan markle young leaders awards, young leaders awards, the queens young leaders", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-meghan-harry-queen-shutterstock-index-1530038854.jpg?crop=0.502xw:1.00xh;0.0849xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrity,celebrity,latest,queen's young leaders,the queen,Prince Harry,Meghan Markle", "sailthru.date": "2018-06-26T17:34:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-meghan-harry-queen-shutterstock-index-1530038854.jpg?crop=1.00xw:1.00xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-meghan-harry-queen-shutterstock-index-1530038854.jpg?crop=0.502xw:1.00xh;0.0849xw,0", "sailthru.socialtitle": "Meghan Markle Wears Prada with the Queen and Prince Harry at the Queen's Young Leaders Awards", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1529962440.0, "source": "https://www.harpersbazaar.com", "summary": ""}