{"url": "https://en.wikipedia.org/wiki/Invasion!_(Arrowverse)", "text": "\"Invasion!\" is the third annual Arrowverse crossover event, with episodes of the television series The Flash, Arrow and Legends of Tomorrow on The CW, and is inspired by the 1989 comic miniseries Invasion!. Events at the end of the Supergirl episode \"Medusa\" on November 28, 2016, marked the beginning of the crossover, which began on November 29 with The Flash, continued on Arrow on November 30, and concluded on Legends of Tomorrow on December 1. Each of the main three episodes were titled \"Invasion!\". In the crossover, Barry Allen recruits Kara Danvers / Supergirl from Earth-38 to Earth-1 to help his team, Oliver Queen and his team, and the Legends to defeat the alien race known as the Dominators.\n\nDevelopment of a crossover between the three series and Supergirl began in May 2016, when it was learned that Supergirl would move to The CW from CBS for its second season. By the following September the scripts for each episode were written, and were filmed in October 2016. The premise and episode titles were also announced in September. In \"Invasion!\", the main cast members of each series appear in (at least) their own series; Melissa Benoist appears as Supergirl in the entire crossover. A number of actors and characters from previous Arrow seasons returned to reprise their roles, since Arrow's episode doubled as its 100th.\n\nThe three episodes of the crossover received positive reviews, with critics praising the interaction among the actors in each series and each episode's advancing season storylines as part of the crossover. The Dominators storyline was regarded as its weakest link, with reviewers finding the alien race's motivations unclear. Ratings for the episodes were high, with each breaking records in viewership and the 18–49 rating and contributing to the most-watched week on The CW in six years. A fourth crossover, \"Crisis on Earth-X\", occurred the following year.[1]\n\nPlot [ edit ]\n\nBarry Allen investigates a meteor crash outside Central City which is a spaceship from which aliens emerge. Lyla Michaels tells the team that the Dominators had landed during the 1950s, but mysteriously departed. Barry assembles the original members of Team Arrow, Thea Queen, the Legends, and Kara Danvers, Supergirl of Earth-38. The team begins training at a S.T.A.R. Labs facility, sparring with Supergirl to prepare for the aliens. Kara struggles to earn Oliver Queen's trust. Cisco Ramon finds and reveals a message Barry's future self sent to Rip Hunter, which exposes Barry's manipulation of the timeline and its effect on other team members. As a result, only Oliver, Kara, Felicity Smoak, Martin Stein, Jefferson \"Jax\" Jackson, and Caitlin Snow still trust Barry.\n\nAfter the Dominators abduct the President of the United States, the team goes to rescue him; however, Barry remains behind since most of them distrust him with Oliver staying behind in support of Barry. Kara leads the group, but the Dominators kill the President and activate a mind control device to take over the group. The controlled heroes return and attack S.T.A.R. Labs, where Barry and Oliver confront them. While Oliver holds them off, Barry lures Kara to the device and manipulates her into destroying it, freeing everyone from the Dominators' control. When the team regroups, Ray Palmer tells Barry that everyone forgives and trusts him. Sara Lance, Ray, John Diggle, Thea, and Oliver are then abducted by the Dominators.\n\nThey are held in pods on a Dominators' ship, each one unconscious except for a shared hallucination of simulated reality. In the hallucination, Oliver is living at Queen Manor, having never gotten on the Queen's Gambit, and is about to be married to Laurel Lance. His parents are alive, and Diggle is operating as the vigilante the Hood, instead of Oliver. The captives begin seeing flashes of their real lives, and realize what the Dominators have done to them. Their escape attempt is blocked by personifications of their enemies: Malcolm Merlyn, Deathstroke and two of his Mirakuru soldiers (who killed Ray's fiancée Anna Loring), and Damien Darhk and two of his H.I.V.E. soldiers. The adversaries are defeated, and the five awaken in the Dominators' ship and escape in a shuttle. Felicity, Curtis Holt, and Cisco try to hack into the Dominators' mainframe. Aided by Barry and Kara, they recover a device to locate the captives, who are rescued by Nate Heywood in the time ship, Waverider. Aboard the Waverider, Ray deduces that the Dominators were gathering information about metahumans, using the hallucination as a distraction, to help them build a special \"weapon\". Meanwhile, the Dominator mothership heads towards Earth.\n\nNate says that the first Dominator invasion occurred in 1951 in Redmond, Oregon. He goes there with fellow Legends Mick Rory and Amaya Jiwe and Felicity and Cisco to kidnap a Dominator for information. Although they are successful, the three Legends and their alien captive are taken prisoner by N.S.A. agents. The Legends learn from the Dominator that the aliens have arrived to assess humanity's threat, now that metahumans have appeared and formed the Justice Society of America. Felicity and Cisco rescue the Legends, and also set the Dominator free, carelessly altering history. In 2016 Central City, the team learns that the Dominators know about Barry's manipulation of the timeline, deem him a threat, and are demanding his surrender in exchange for peace. After the Legends return, the team discovers that the Dominators' weapon is a bomb that will kill all metahumans on Earth, with millions of collateral human casualties. The teams dissuade Barry from surrendering, and he and Cisco reconcile. The team manage to destroy the bomb and force the Dominators to retreat with a pain-inflicting nano-weapon. As the heroes celebrate their victory, Oliver offers Kara his friendship; Cisco gives her a device which will enable her to interdimensional travel and communicate between Earth-1 and Earth-38. Martin persuades Jax not to tell the others that his daughter Lily's existence is the result of a temporal paradox he inadvertently caused when the Legends were in 1987.\n\nCast and characters [ edit ]\n\nMain and recurring [ edit ]\n\nNote: Despite being credited, Josh Segarra does not appear in the Arrow episode.[2]\n\na b Supergirl episode \"[3] Barry and Cisco both appear at the end of theepisode \" Medusa \", to recruit Supergirl.\n\nGuests [ edit ]\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nIn May 2016, after it was announced that Supergirl would air its second season on The CW instead of CBS, CW president Mark Pedowitz said that all four series—Arrow, The Flash, Legends of Tomorrow, and Supergirl—would cross over during the 2016–17 television season.[14] In September 2016, Greg Berlanti, creator and executive producer of all four series, said that the crossover event would only involve The Flash, Arrow, and Legends of Tomorrow;[15] the event begins at the end of the Supergirl episode \"Medusa\", with Barry and Cisco Ramon arriving on Supergirl's Earth to recruit her.[3] Andrew Kreisberg, executive producer on Arrow, The Flash, and Supergirl, explained why the crossover did not include Supergirl: since \"Medusa\" was the mid-season finale for Supergirl and the other three series had theirs in episodes after the crossover, they \"wanted to make sure that [\"Medusa\"] spoke to what had been happening on the first seven episodes of Supergirl and not just as a tie in\". He added that it would have been logistically difficult to incorporate the four series, noting that finding the time for Melissa Benoist to shoot material for the other three series was complicated. Benoist did not appear in much of \"The Darkest Place\", the episode before \"Medusa\", to make her available to appear in each of the crossover episodes.[16] He expanded on the difficulties, saying that \"built-in shut-down days\" for Supergirl were not planned on, in part because the series switched from CBS to The CW, and that this inability to shut down normal production prevented it from having a larger role in the crossover.[17]\n\nIt was announced the following September that the villains in the event would be the Dominators, in a story inspired by the 1989 comic miniseries Invasion![18] The Dominators were chosen because the writers \"collectively wanted the superheroes to face an external threat,\" meaning \"a threat that came from outside of the shows\", rather than extraterrestrial.[19] The following month, Arrow and Legends of Tomorrow creator and executive producer Marc Guggenheim said that the title of each episode of the crossover would be \"Invasion!\".[20]\n\nIn November 2016, Kreisberg said that the Dominators would appear during the later part of Supergirl's season after the crossover event.[21] Guggenheim said that in the initial script for The Flash, Lynda Carter appeared as the Vice President (becoming President after his death in the episode); Carter appears as President Olivia Marsdin on Supergirl. This did not occur because a note from the studio felt it would have been too confusing, having Marsdin appear as president on one series (and another Earth) and vice president on the others. Guggenheim added, \"In the midst of time travel and aliens, it was just one sci-fi problem too much\" and conceded that \"if people at the studio were confused by the script, it was probably not particularly friendly to casual fans.\"[22]\n\nWriting [ edit ]\n\nScripts for \"Invasion!\" were written in mid-September 2016, with Berlanti creating the story for the event and Kreisberg helping to craft the story of The Flash episode.[23][24][25] The teleplay for The Flash was written by showrunners Aaron and Todd Helbing;[25] Arrow's was written by showrunners Guggenheim and Wendy Mericle,[23] and showrunners Phil Klemmer and Guggenheim wrote the teleplay for Legends of Tomorrow.[24] When the Dominators were chosen as the threat for the crossover, the writers were able to justify the heroes' uniting; since Supergirl \"is knowledgeable about these particular enemies, the Legends can help better understand the last time the Dominators visited Earth thanks to their time travel capabilities, and both Teams Flash and Arrow have a diverse array of capable heroes who are able to understand and counter just about every imaginable threat.\"[19]\n\nArrow's episode in the crossover was also the series' 100th. Guggenheim said that Berlanti's idea for the episode \"allow[ed] us to have our cake and eat it too\" in respecting Arrow as a whole and incorporating it into the crossover, with Guggenheim calling it \"a love letter\" to the series as a whole. The producers were able to incorporate many actors from earlier in the series, with others who could not appear because of scheduling conflicts still represented.[3] At the end of The Flash episode, Oliver, Thea, Sara, Diggle, and Ray are captured by the Dominators and held in stasis with their minds experiencing a \"shared hallucination\"; this allowed the writers \"to revisit footage from the previous 99 episodes\" in the characters' memory flashes.\n\nFilming [ edit ]\n\nThe three episodes were filmed from September 23 to October 12, 2016.[23][24] They were filmed concurrently, with some cast members shooting scenes for several series each day. Filming was done at the Boundary Bay Airport.[27] The Flash's episode was directed by Dermott Downs,[28][25] Arrow's by James Bamford,[23] and Legend of Tomorrow's by Gregory Smith.[24]\n\nVisual effects [ edit ]\n\nThe crossover's visual effects were by Encore Post and Zoic Studios.[29][13] The Dominators were created with \"cutting-edge prosthetics and computer effects ... to achieve a feature film-quality look which is faithful to Invasion! artist Todd McFarlane's interpretation of the characters.\"[18] Although they originally wore the green robes of the comics, Guggenheim said that when it was decided to create the species in CGI, the robes \"made animating them prohibitively impossible\".[30]\n\nThe S.T.A.R. Labs facility where the heroes initially meet was made to look like the Hall of Justice in the Super Friends animated series. Stock footage of the building in Cincinnati that was used as the basis for the Hall of Justice, Union Terminal, was altered by Encore for the crossover.[29]\n\nColin Donnell and Colton Haynes appear as holograms, reprising their roles as Tommy Merlyn and Roy Harper, at the end of the Arrow episode. They appeared as holograms (not physically) due to other commitments which prevented their being re-shot. Guggenheim said that Zoic Studios had to rotoscope them from older episodes noting \"It was hard, obviously because they had to work with preexisting footage. Yes, they had [many] episodes to choose from, but it was a lot harder than that makes it sound.\"[13]\n\nMarketing [ edit ]\n\nHome media cover art for \"Invasion!\"\n\nDespite \"Invasion!\" only occurring on three of the four CW series, the event, marketed as \"Heroes v Aliens\", was called a \"four-night crossover event\" beginning with the Supergirl episode.[31] In Canada, where The Flash, Arrow and Legends air on CTV Television Network, the crossover was marketed as a three-night event entitled \"Heroes United\".[32] A faux classified U.S. government video was released, set about 70 years in the past, detailing the Dominators' first attempt to conquer Earth.[33] The crossover's trailer was released on November 23, 2016.[34]\n\nRelease [ edit ]\n\nBroadcast [ edit ]\n\nAfter beginning in the final scene of the November 28, 2016, episode of Supergirl, the first part on The Flash aired on November 29, followed by part two on Arrow on November 30, and concluding with part three on Legends of Tomorrow on December 1, all on The CW.[28]\n\nHome media [ edit ]\n\nThe episodes, the rest of Legends of Tomorrow's second season, The Flash's third season and Arrow's fifth season were released separately on Blu-ray and DVD in Region 1 on August 15, 2017,[35] September 5[36] and September 19, respectively.[37] The three episodes, accompanied by three \"Allied: The Invasion Complex\" behind-the-scenes featurettes (included separately in each series' home media release), were released together on a separate DVD on August 17, 2017 in Region 2[38] and September 20 in Region 4.[39] The episodes are available for streaming on Netflix and The CW app in the United States.[40][41]\n\nReception [ edit ]\n\nRatings [ edit ]\n\nNo. Series Air date Rating/share\n\n(18–49) Viewers\n\n(millions) DVR\n\n(18–49) DVR viewers\n\n(millions) Total\n\n(18–49) Total viewers\n\n(millions) 1 The Flash November 29, 2016 1.5/5 4.15[42] 0.9 2.17 2.4 6.31[43] 2 Arrow November 30, 2016 1.3/5 3.55[44] 0.7 1.80 2.0 5.34[43] 3 Legends of Tomorrow December 1, 2016 1.2/4 3.39[45] 0.7 1.84 1.9 5.24[43]\n\n\"Invasion!\" gave the CW its most-watched week in six years.[46] The Flash episode had a season-three-high viewership (the series' largest since December 9, 2014) and a season-three-high 18–49 rating, the highest since February 16, 2016. The episode improved 40 and 36 percent in viewership and the 18–49 rating, respectively, on the previous episode, \"Killer Frost\".[47] It increased by five percent in total viewers and seven percent in the 18–49 demographic from the previous year's crossover with Arrow.[48] The Arrow episode had a season-five-high viewership and 18–49 rating, with viewership on a par with the previous year's crossover and the 18–49 rating the best since then.[49] The episode improved by 120 and 86 percent in viewership and the 18–49 rating, respectively, from the previous episode, \"Vigilante\". The Legends of Tomorrow episode had a series-high viewership and a season-two-high 18–49 rating, which tied the rating set by the pilot on January 21, 2016.[46] The episode improved by 80 and 83 percent in viewership and the 18–49 rating, respectively, from the previous episode, \"Outlaw Country\",[50] and contributed to the most-watched Thursday on The CW in four years.[51]\n\nCritical response [ edit ]\n\nAbout the crossover as a whole, Oliver Sava of The A.V. Club said that the episodes did \"admirable work advancing the overarching narrative while maintaining each show's distinct perspective\" along with being \"a hell of a lot of fun, and it's significantly expanded the scope of the Arrowverse by bringing in an extraterrestrial enemy ... There's an entire universe to explore, and this crossover has opened the door for the CW's DC shows to go cosmic in the future.\"[52] According to Ed Gross of Empire felt \"Invasion!\" was a \"proverbial mixed bag\". He felt \"Invasion!\" did an effective job of bringing the characters from each series together since \"the rapport between them feeling natural and oftentimes genuinely funny\". Gross took issue to how the crossover was promoted as \"a massive adventure\" when it turned out to be \"rather underwhelming. Part of that is creative—it would have been better to get a fuller understanding of who these beings really are and how they're able to know the long-term effects of Flashpoint; plus the resolution seems awfully pat ... and lacks the resolutionary scope that was expected.\" Gross gave the crossover four out of five stars.[2] Collider's Allison Keene enjoyed the interaction of the cast members between the four shows, with The Flash setting the tone of the crossover, with the others incorporating \"its light-hearted, witty banter and a fast-paced action and editing\". However, the crossovers also have the ability to \"starkly highlight each show's weaknesses.\" Keene concluded, \"There are things \"Invasion!\" as a whole did really well, and others it didn't, with each series' strengths and weaknesses being highlighted and tested. But with each new expansion, there are things the shows can learn from, and it remains fun for fans\".[53]\n\nThe Flash [ edit ]\n\nThe review aggregator website Rotten Tomatoes reported a 100% approval rating, based on 10 reviews for the episode. The website's critical consensus reads, \"The CW marshals its lovable roster of superheroes all together to quell an Invasion! in a sprawling crossover event that makes great use of each series headliners' charms.\"[54]\n\nJesse Schedeen of IGN gave The Flash episode an 8.4 out of 10, noting the appeal of seeing many of the Arrowverse characters joining forces. He was critical of the Dominators, feeling they were not \"well-defined... to unify these heroes\", resulting in the Flashpoint-related character drama to propel the first act. Schedeen continued, \"Everyone had their moment to shine, even more minor players like Felicity and Thea. But if there was one subplot that felt unnecessary and out of place, it was Wally's\", calling it \"forced\". Schedeen appreciated the focus on the fallout from Flashpoint, calling it \"one of the biggest flaws of Season 3 so far\" on The Flash, and hoped that more of the Dominators' comic backstory would appear in the crossover's other two episodes.[55] The A.V. Club's Scott Von Doviak gave the episode a B+, calling the episode an \"absurdly overstuff kickoff\" to \"Invasion!\" He enjoyed that the episode \"continues to advance the story arcs of this season of The Flash and finds a way to weave those ongoing conflicts into the multi-series story of an alien invasion.\" Von Doviak questioned some of the episode's events, such as Barry's knowledge of the Legends adventures and his not caring about secret identities, and said that viewers \"who don't necessarily follow the other three shows religiously are at a disadvantage\".[56]\n\nOn Collider.com, Carla Day gave The Flash episode five out of five stars and called it \"brilliant\", saying, \"With so many characters on the scene, it would have been easy for the show to get overwhelmed by them all and lose The Flash's unique look and tone. But the writers effectively incorporated the other DC series' characters into the episode while keeping the show's light-hearted and funny demeanor.\" Day's only complaint was about the Dominators' unclear motivations.[57] Entertainment Weekly's Chancellor Agard gave The Flash episode an A−, feeling \"Based on tonight's episode alone, this year's crossover is looking like it'll be the best one yet... This is really the first time Berlanti and Co. can tell a cohesive story, and it seems like it's paying off.\" Agard felt the focus on the Team Flash drama made the episode \"drag a bit\" and, like Schedeen, his \"biggest problems were with the Wally stuff\" but conceded it was included \"for viewers who might only watch The Flash, and the episode does a good job of appeasing both kinds of fans.\"[9]\n\nArrow [ edit ]\n\nRotten Tomatoes reported an 86% approval rating, based on 7 reviews for the episode.[58]\n\nSchedeen gave Arrow's episode an 8.7 out of 10, saying \"This Arrow episode worked much better as a 100th episode celebration than it did the middle act of the \"Invasion\" crossover,\" calling the shared hallucination premise \"an emotionally rich and action-packed way to celebrate the show's first 100 episodes.\" Schedeen was critical of the Cisco and Team Arrow subplot that \"did little to advance the larger narrative\", as well as the overall pacing of the crossover up to this point.[59] Alasdair Wilkins of The A.V. Club gave Arrow an A, stating that while \"Invasion!\" could have been \"an unholy mess\" trying to fit Arrow's 100th episode celebration in the middle of the crossover, by focusing on Arrow's past and including former cast members \"ends up giving the show a way to develop the power and the threat of the Dominators without this crossover just being three straight episodes of heroes and aliens punching each other.\" Wilkins concluded, \"If this is how Arrow marks 100 episodes, then here's to 100 more. If this isn't the best episode in Arrow's history, it's damn close.\"[60]\n\nCollider.com's Kayti Burt said that the Arrow episode \"gets enough nostalgic hits in to make it work, while also giving us an exciting (batshit crazy) final act to launch us into the final part of the superhero crossover.\" Burt felt the shared hallucination \"works because of the performance of all of the actors (including many returning ones) and the sentiment that this show has genuinely inspired in people.\" Burt \"was a bit sad\" that the series would not have the opportunity to have a 100th episode outside the crossover, with the demands of moving the crossover \"sometimes at odds with what this episode was trying to do ... This episode was trying to do far too much and was therefore a bit of a mess, but it's hard to dislike an hour of TV that is earnestly trying to please its fans in so many different ways\". She gave the episode three out of five stars.[61] Sara Netzley of Entertainment Weekly gave the episode an A, saying, \"We get enough cross-team action to make it a treat for viewers of the Berlanti-verse while still forwarding the \"Invasion\" story line—and honoring the characters, plots, and themes that have made Arrow such a satisfying show over the last four and a half seasons. It was a tall order, but the episode pulled it off.\"[62]\n\nLegends of Tomorrow [ edit ]\n\nRotten Tomatoes reported a 100% approval rating, based on 9 reviews for the episode. The website's critical consensus reads, \"The Arrowverse gang is back together. What more could you want?\"[63]\n\nRating the episode an 8.8 out of 10, Schedeen said the crossover \"ended on a strong note. This episode delivered the most on the promise of superheroes joining forces to battle alien invaders. And even if there were a few points of frustration (mainly involving a lack of Supergirl early on), it made the most of the premise and delivered a rousing final battle.\" He enjoyed the final back story of the Dominators, which gave them clearer motivations so they no longer felt like \"a completely faceless, generic alien threat\", and Cisco's creation of a device for Supergirl to travel between universes, which would allow for more frequent crossovers between the characters.[64] Sava graded the Legends of Tomorrow episode A-, feeling it did not have the same \"emotional punch\" of Arrow's episode, but was still \"a strong conclusion that has the good guys saving the day and learning more about themselves in the process.\" He called the final battle \"anticlimactic\", noting it would have been more satisfying if there was a \"more creative use of all the different powers in this group working together, and... a stronger sense of collaboration among the human/metahuman fighters.\"[52]\n\nEntertainment Weekly's Shirley Li gave the episode a B+, as \"it didn't feel at all like a Legends of Tomorrow episode, despite all the quips from Mick and the blue chyron and the time traveling\"; she said that it was more like a second Flash episode. Li also added that the \"budgetary constraints were glaring\", and gave as examples Thea's failure to appear in the episode and Kara's absence from the confrontation with the elderly glasses-wearing official after Oliver lashed out at her. Despite this, Li felt much of the episode worked, with each character getting a chance to shine \"and though the Dominators' motive [was] still somewhat muddled, the invasion sparked fun rapport among the teams... This might not drive any non-Legends viewers to watch Legends, but the episode gave plenty to Arrowverse fans.\"[65]\n\nAccolades [ edit ]\n\nComic Book Resources ranked The Flash, Arrow, and Legends of Tomorrow episodes 2016's 16th, 10th, and 3rd best episodes of comic book-related television series, respectively.[66]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/19px-Symbol_support_vote.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/9f/Invasion_Arrowverse.jpg/275px-Invasion_Arrowverse.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/7/7c/Invasion_home_media.jpg/150px-Invasion_home_media.jpg", "https://upload.wikimedia.org/wikipedia/en/9/9f/Invasion_Arrowverse.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/9/9f/Invasion_Arrowverse.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Invasion!_(Arrowverse)", "title": "Invasion! (Arrowverse)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/9/9f/Invasion_Arrowverse.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}