{"url": "https://www.thisisinsider.com/chris-evans-jenny-slate-breakup-getting-back-with-ex-2018-3", "text": "Chris Evans and Jenny Slate have broken up again, according to the New York Times .\n\nEvans and Slate had an on-again, off-again relationship that the internet loved.\n\nINSIDER spoke with relationship experts to find out why getting back together with an ex is almost always a bad idea.\n\n\n\nOnce again, Chris Evans and Jenny Slate have broken up, according to a recent New York Times profile of Evans.\n\nThe profile doesn't go into too much detail as to what caused the breakup. In fact, it is only mentioned at all because Evans refers to a feminist text, \"The Mother of All Questions\" by Rebecca Solnit, that he read while dating Slate. But anyone who has ever experienced any sort of on-again-off-again relationships like Evans and Slate's likely has some inkling as to what happened. After all, getting back with an ex rarely, if ever, works out quite the way you'd like it to.\n\nINSIDER spoke with relationship experts to find out why.\n\nIt encourages an unhealthy behavior pattern.\n\n\"Jenny Slate and Chris Evans have broken up before, and there is a really good chance they're going to get back together — and break up again,\" relationship expert April Masini, who hosts an online relationship advice forum, told INSIDER. \"When breakups become the way that you deal with relationship conflicts, you're in a bad behavioral pattern.\"\n\nThis can become a source of strain in one's daily life. \"Drama replaces problem solving and breakups become a very disruptive part of the relationship dynamic,\" Masini said.\n\nIt makes everything more confusing.\n\nOften, ending a relationship isn't as clear-cut as many of us would like it to be — if you care about someone deeply, the act of breaking up with them isn't going to change that. This can make it easy to think that getting back with an ex is a good idea.\n\n\"When a couple does get back together, what it tells you is that there is a lot that's good and a lot that works,\" Susan Winter, a relationship expert and best-selling author, told INSIDER. \"But there are also issues that haven't been fixed. Chances are, [Evans and Slate] like each other as people, which makes this tough.\"\n\nAs anyone who has reunited with an ex can probably attest, it also tends to be more trouble than it's worth.\n\n\"Unless values, priorities, or the person in general has significantly shifted, restarting an ended relationship is typically not worthwhile,\" relationship expert Rachel DeAlto told INSIDER. \"In this case, the issues that appeared to exist (differences in levels of fame and insecurities) didn't change. Love can't conquer everything.\"\n\nEvans and Slate reportedly started their relationship while filming the movie \"Gifted.\" Fox Searchlight\n\nIt's possible that the reconciliation is to benefit outside sources, rather than the ones in the relationship.\n\nHave you ever gotten back together with an ex simply because you're in the same friend group, and your friends think you were so great together, and, well, it's just easier to be together? Evans and Slate may have been following the same line of thinking.\n\n\"They're a great odd couple, and Hollywood loves an odd couple romance,\" Masini told INSIDER. \"And they're not insusceptible to what fans love to see, which makes their issues even tougher.\"\n\nNot everyone has fans, of course, but most people have outside influences — like friends and family — who can shape our thinking and behavior without us realizing it. So, if you're ever thinking about getting back together with an ex, think about if it's something that you really want, or just something you have been told to want.\n\nA breakup can incite positive change — if you stick to it.\n\nThe good news? As tough as they are, breakups can often lead to some positive change.\n\n\"A breakup can be an enormous motivator to improve ourselves,\" Winter said. \"The clients that come to me and tell me they've lost somebody they love are so incredibly motivated to correct and change things about themselves and their personality. I've seen it help people get into sobriety, I've seen it make philanderers get clear on the reason why they couldn't commit, I've seen people take anger management and sensitivity courses. I've seen all types of change.\"\n\nNo word yet on if Evans and Slate will heed this advice — but, chances are, it's something that we can all benefit from hearing.", "images": ["https://i.insider.com/5ab4166e095b1120008b4575?width=1200&format=jpeg", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1 1'%3E%3C/svg%3E", "https://www.thisisinsider.com/chris-evans-jenny-slate-breakup-getting-back-with-ex-2018-3?width=600&format=jpeg&auto=webp", "https://i.insider.com/59f8ce2571389e21008b4610?width=600&format=jpeg&auto=webp", "https://i.insider.com/59f8ce2571389e21008b4610?width=24&format=jpeg&auto=webp", "https://i.insider.com/5ab407d0095b1121008b45fc?width=600&format=jpeg&auto=webp"], "top_img": "https://i.insider.com/5ab4166e095b1120008b4575?width=1200&format=jpeg", "keywords": [], "authors": ["Sara Hendricks"], "canonical_link": "https://www.insider.com/chris-evans-jenny-slate-breakup-getting-back-with-ex-2018-3", "title": "Chris Evans and Jenny Slate broke up again — and it proves why you should never get back together with your ex", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "Chris Evans and Jenny Slate broke up again — and it proves why you should never get back together with your ex", "date": "2018-03-22", "news_keywords": "Relationship, Chris Evans, Jenny Slate, Breakups, Sara Hendricks", "description": "Chris Evans and Jenny Slate's breakup proves that getting back together with an ex is never a great idea. Here's what relationship experts have to say.", "author": "Sara Hendricks", "article": {"publisher": "insider", "content_tier": "free", "opinion": "false"}, "tbi-vertical": "Health", "og": {"title": "Chris Evans and Jenny Slate broke up again — and it proves why you should never get back together with your ex", "description": "Chris Evans and Jenny Slate's breakup proves that getting back together with an ex is never a great idea. Here's what relationship experts have to say.", "type": "article", "url": "https://www.insider.com/chris-evans-jenny-slate-breakup-getting-back-with-ex-2018-3", "image": "https://i.insider.com/5ab4166e095b1120008b4575?width=1200&format=jpeg", "site_name": "Insider"}, "sailthru.title": "Chris Evans and Jenny Slate broke up again — and it proves why you should never get back together with your ex", "sailthru.date": "2018-03-22", "sailthru.tags": "Relationship, Chris Evans, Jenny Slate, Breakups, Sara Hendricks", "sailthru.description": "Chris Evans and Jenny Slate's breakup proves that getting back together with an ex is never a great idea. Here's what relationship experts have to say.", "sailthru.author": "Sara Hendricks", "sailthru.verticals": "health, culture", "sailthru.image.full": "https://i.insider.com/59f8ce2971389e55008b462e?width=1200&format=jpeg", "sailthru.image.thumb": "https://i.insider.com/59f8ce2971389e55008b462e?width=160&format=jpeg", "twitter": {"card": "summary_large_image", "site": "@thisisinsider"}, "Insider": "Snapchat", "Chris Evans and Jenny Slate broke up again — and it proves why you should never get back together with your ex": "The Fastest Way to Share a Moment!", "fb": {"pages": 1413475698959824}, "linkedin": {"owner": "mid:1d5f7b"}, "ii-ab-test": {"bi8-lazy-load": "control", "back-to-top": "variant", "sticky-section-titles": "variant", "post-breadcrumbs": "control", "tabbed-homepage": "variant", "expanded-coverage-module": "control", "subscribe-smallest-price": "control"}, "viking-id": "5ab3f8cb095b1128008b45e2", "env": "prod", "msapplication-config": "//www.insider.com/public/assets/INSIDER/US/favicons/browserconfig.xml?12-31-19", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1521648000.0, "source": "https://www.thisisinsider.com", "summary": ""}