{"url": "https://www.allure.com/story/dot-eyeliner-instagram-trend", "text": "Dot eyeliner has slowly infiltrated our Instagram feeds, runways, and, most recently, celebrities' lids. When we say slowly, we mean, like, since the '60s. Back when fangirls lined up for the Beatles and women wore white platform boots, Twiggy dotted her lower lash line to emphasize her lashes. A couple decades later, the look hit the runway with a minimalist approach. In 2012, Pat McGrath placed a single cornflower-blue dot in the middle of the lower lash lines of models walking in an Anna Sui show. However, the dot-liner look didn't quite catch on like wildfire the way her glitter lips have. Then, the haute couture version of undereye circles made another appearance on the runway in 2014. Lucia Pieroni created his own version of the look for the Rochas spring/summer 2015 show. History lesson aside, we've been feeling the dot fantasy for years now, so of course we're pumped that beauty bloggers and celebs (like Emma Roberts and Zoe Kravitz) are bringing dot eyeliner into 2017 in a big way. We talked to professional makeup artists to find out how to pull off the look and what tools to use to create perfect little circles.\n\nWhat's the deal with dots?\n\nThe first person we think of when it comes to dot liner is professional makeup artist Katie Jane Hughes. She knows firsthand how to make the look incredibly wearable. You can see her mastering the sophisticated spots in up-close selfies on Instagram. She tells Allure that the liner trend is a fun way of mixing up makeup and dots draw attention to your eyes in a new way. \"Lately, people have been embracing details on the lower lash lines,\" she adds. Take the blue waterline trend among celebs lately, for example. Janelle Monáe, in particular, has basically taken it on as her signature look.\n\nSave these ideas for later—and follow Allure on Pinterest!\n\nOn Instagram, you may have seen your favorite beauty bloggers create looks inspired by Dominique D'Angelo, a professional makeup artist with about 244,000 followers on Instagram. She tells Allure that not only is dotted liner a way of adding texture to your look in a nontraditional way, it is a \"comfortable step toward wearing something more daring than a classic liner. It can be as bold or as discreet as you'd like.\"\n\nWhat other makeup should you have on when you're wearing dot eyeliner?\n\nHughes recommends keeping the rest of your makeup low-key with a fresh face and groomed brows, so the dots don't look \"too theatrical.\" Instead, keeping your skin matte and your brows natural creates a perfect balance—you know, kind of like a hamburger with salad, Hughes explains. She even compared the vibe you should go for to Alicia Keys's appearance on our February cover. As for lips, you have free reign to top with whatever color you want. \"It's like pairing black liner with any lip color,\" Hughes says. Greta Agazzi, a professional makeup artist based in Italy, agrees. She tells Allure that she's into the minimalist look because it gives her \"mime vibes.\" She's so right—in the best way possible. You might not want to wear a black-and-white striped shirt, though. You know, just in case.\n\nFor Emma Robert's look, professional makeup artist Kara Yoshimoto Bua kept her look, which was inspired by Coco Chanel BTW, supersimple with neutral eye-shadow shades on the actress's lids. First, Bua smudged the taupe shade from the Tisse Camelia\n\nChanel Quadra Eyeshadow in Tissé Gabrielle An eye-shadow palette with four cool, shimmery gray-based shades\n\nonto the lower lash lines. Next, she brushed a shimmery brown onto the outer part of Roberts's upper lash line for \"soft, natural definition,\" Bua says. Then, Bua swept a champagne powder on Roberts's upper lids, inner eyes, and brow bones to give her a lit-from-within glow. (These Best of Beauty-winning products can help you get there, too.) Then, she finished off with the petal pink shade on Roberts's creases.\n\nAnd just how do you get those damn dots so precise?\n\nJust last week, Flirt Cosmetics launched the Dot Dot Dot Dual Ended Liner ($22), which makes things hella easier. One side has your classic felt-tipped liner. The other has a special dotting applicator. Revlon also has a ball-point liner that has literally a ball point. Both option create the perfect spots. Hughes and D'Angelo also suggest using the round end of a makeup brush. You can dip it into a black liquid lipstick (we like the one from Sephora Collection), gel liner or create your own mixture with some setting spray and black eye shadow like Hughes does. The latter lets you be \"in control of the consistency,\" Hughes says. \"A watery one works best.\"\n\nAs for placement, use your pupils for alignment. Then, create dots either right below your lower lash lines, like Roberts's look, or below the folds and fine lines of your undereye area. Agazzi likes to wear them almost on top of her cheeks, so don't afraid to stray from your waterlines. And remember, as D'Angelo says, 'Dot liner is fun, hard to mess up, and it washes off at the end of the day!'\"\n\nMore beauty looks you'll love:\n\nNow, learn more about the dot eyeliner look Pat McGrath created for Anna Sui:", "images": ["https://media.allure.com/photos/589cf2dad1f9dd0d0ceee827/master/w_1600%2Cc_limit/pinnable-3-Dot-Eyeliner-Trend.jpg", "https://www.allure.com/verso/static/allure/assets/logo-header.95d6522119a7e0c0674f96017a219339528c048d.svg", "https://media.allure.com/photos/58828054fd6e05e715a9737b/master/w_1600%2Cc_limit/dot%252520liner%252520comp.jpg", "https://www.allure.com/verso/static/allure/assets/logo-reverse.7c3ec9af78d5f39e36d039cb1f9fef504150550e.svg", "https://media.allure.com/photos/5e84c19041364700089bfefe/master/h_180%2Cc_limit/laura-mercier-translucent-loose-setting-powder-gwp.jpg", "https://media.allure.com/photos/5880dfa588083ccc3bd2b08e/16:9/w_1280,c_limit/emma-roberts-dot-eyeliner.jpg", "https://media.allure.com/photos/57e3d367d20277447bdad4fe/master/w_775%2Cc_limit/BREAKTHROUGHS%252520Chanel%252520Eyeshadow%252520in%252520Tisse%2525CC%252581%252520Gabrielle.jpg"], "top_img": "https://media.allure.com/photos/5880dfa588083ccc3bd2b08e/16:9/w_1280,c_limit/emma-roberts-dot-eyeliner.jpg", "keywords": [], "authors": ["Devon Abelman", "Devon Abelma", "Fiona Gibb"], "canonical_link": "https://www.allure.com/story/dot-eyeliner-instagram-trend", "title": "The Dot Eyeliner Trend: Here's Exactly How to Pull It Off", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Devon Abelman", "copyright": "Copyright (c) Condé Nast 2020", "description": "We chatted with professional makeup artists about dot eyeliner, how to create precise circles, and what other makeup to pair the look with.", "id": "587ff50c4d2ce4e43c8d0471", "keywords": "eyes,emma roberts,eye liner,flirt cosmetics,revlon,chanel,pinterest", "news_keywords": "eyes,emma roberts,eye liner,flirt cosmetics,revlon,chanel,pinterest", "robots": "index, follow", "content-type": "article", "parsely-post-id": "587ff50c4d2ce4e43c8d0471", "parsely-metadata": "{\"description\":\"We chatted with professional makeup artists about dot eyeliner, how to create precise circles, and what other makeup to pair the look with.\",\"image-16-9\":\"https://media.allure.com/photos/5880dfa588083ccc3bd2b08e/16:9/w_1000,c_limit/emma-roberts-dot-eyeliner.jpg\",\"image-1-1\":\"https://media.allure.com/photos/5880dfa588083ccc3bd2b08e/1:1/w_1000,c_limit/emma-roberts-dot-eyeliner.jpg\"}", "og": {"description": "Connect the dots.", "image": "https://media.allure.com/photos/5880dfa588083ccc3bd2b08e/16:9/w_1280,c_limit/emma-roberts-dot-eyeliner.jpg", "site_name": "Allure", "title": "This Unexpected Eyeliner Trend Is About to Blow Up Instagram", "type": "article", "url": "https://www.allure.com/story/dot-eyeliner-instagram-trend"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@Allure_magazine", "description": "Connect the dots.", "domain": "https://www.allure.com", "image": {"src": "https://media.allure.com/photos/5880dfa588083ccc3bd2b08e/16:9/w_1280,c_limit/emma-roberts-dot-eyeliner.jpg?mbid=social_retweet"}, "site": "@Allure_magazine", "title": "This Unexpected Eyeliner Trend Is About to Blow Up Instagram"}, "fb": {"app_id": 100614276777478, "pages": 24810773606}}, "movies": [], "publish_date": null, "source": "https://www.allure.com", "summary": ""}