{"url": "people.com/royals/mom-of-3-who-suffered-same-morning-sickness-as-princess-kate-shares-her-survival-tips-its-miserable/", "text": "Princess Kate knew what was coming.\n\nHaving battled severe pregnancy sickness, or Hyperemesis Gravidarum (HG), while expecting her first two children, Prince George and Princess Charlotte, the royal mom would have been told by her medical team that the odds meant she would likely have the debilitating condition again.\n\nGet push notifications with news, features and more.\n\nCaitlin Dean, who is chairperson of the U.K.’s Pregnancy Sickness Support, is also a mother of three who suffered from HG in each of her pregnancies.\n\n“A lot of people go into the second [pregnancy] hoping that it will not happen again, thinking [HG] will be one pregnancy and that every pregnancy is different,” says Dean. “But once you have it twice, that delusion is pretty much blown out of the water. So you have to prepare and be ready for this.\n\n“For myself, I found it mentally and physically easier [during subsequent pregnancies] because I knew that I was going to have this and I knew what to expect from the treatment and what to expect generally.”\n\nImage zoom Lia Toby/WENN\n\nOn the flip side, she notes, for some women the symptoms “get worse each time.”\n\nDean says that for women who have previously battled HG, there’s a trepidation mixed in with the joy of anticipating a new baby.\n\n“You know it’s coming, and it’s quite a scary prospect knowing you’re going to put yourself through that again. Certainly for me and my husband that was a huge decision. Not so much, ‘Let’s have a third kid,’ but, ‘Can we go through HG again?’ It’s certainly something that limits a lot of people who cannot go beyond two because of the condition.\n\n“Preparing makes a huge amount of difference,” she adds. “What we suspect from experience is that if you prepare, you can start pre-emptive treatment and can prepare your household and your finances. The average woman doesn’t have the life that Kate has with people to cook meals and people to do their cleaning for them and look\n\nafter their children. For regular women that preparation is absolutely key.”\n\nSuch advance preparation, she adds, “doesn’t necessarily improve the sickness, although there is evidence that earlier treatment can reduce the overall impact of the symptoms. It isn’t a cure, but it makes it easier to have done that preparation. Then, if you don’t have HG on the third time, you haven’t lost anything. [That scenario] would be brilliant. Very occasionally women don’t get it again, but most of the time they do.”\n\nPreparing also means keeping your younger children informed, says Dean, who wrote How To Be an HG Hero aimed at children of expectant moms.\n\nImage zoom Photo by Samir Hussein/WireImage\n\n“The idea with that is to help children understand why Mummy’s not in the picture and why she’s potentially in and out of hospital and how they can help,” says Dean. “My key thing is honesty. A lot of people try to hide the fact they’re pregnant in the first 12 weeks, because they’re worried about having to explain a miscarriage if it happens. If you are going in and out of hospital and lying in bed day after day and not telling your kids the reason why, they’re just going to worry about it and make up in their own heads why that is. Kids are resilient and they get on with that as long as you tell them the truth.\n\n“It is debilitating and miserable and hopefully [Kate’s] children will not be worrying about it and understand that Mummy’s poorly.”\n\nImage zoom Samir Hussein/WireImage\n\nOf course, it’s also tough on moms. “You have the fact that your other children are going to lose out on Mummy, and you have that guilt at not being able to spend so much time with them.”\n\nAs for treatment, guidelines from the Royal College of Obstetricians and Gynecologists include a first line of medication like Cyclizine, which is an anti-histamine and works to combat vomiting, and Ondansetron to prevent nausea and vomiting.\n\n“On top of that, it is IV fluids ­if she’s not keeping food or fluids down,” says Dean, who is not involved in Kate’s treatment. “The main things is to keep her hydrated and able to eat. We know that malnutrition and dehydration can have a negative effect on the fetus. The idea that baby’s fine with a starving mum just isn’t true. It is important to keep mums hydrated so that they can eat as much as they need to or are able to.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2015%2F04%2Fkate-middleton-3-435-31.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fcharlotte-william-kate-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fgettyimages-545630546-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1582&h=828&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fkate-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1582&h=828&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fkate-2.jpg", "keywords": [], "authors": ["Simon Perry"], "canonical_link": "https://people.com/royals/mom-of-3-who-suffered-same-morning-sickness-as-princess-kate-shares-her-survival-tips-its-miserable/", "title": "Expert on Kate Middleton's Severe Morning Sickness", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Kate Middleton,Princess Kate,The Royals", "news_keywords": "Kate Middleton,Princess Kate,The Royals", "description": "Caitlin Dean, an expert on Hyperemesis Gravidarum (HG), or severe morning sickness, offers her advice to Kate Middleton for her third pregnancy", "og": {"title": "Expert on Kate Middleton's Severe Morning Sickness", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/royals/mom-of-3-who-suffered-same-morning-sickness-as-princess-kate-shares-her-survival-tips-its-miserable/", "description": "Princess Kate knew what was coming. Having battled severe pregnancy sickness, or Hyperemesis Gravidarum (HG),&nbsp;while expecting her first two children, Prince George and Princess&nbsp;Charlotte,&nbsp;the royal&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1582&h=828&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fkate-2.jpg", "width": 1582, "height": 828}}, "pinterest": {"url": "https://people.com/royals/mom-of-3-who-suffered-same-morning-sickness-as-princess-kate-shares-her-survival-tips-its-miserable/", "description": "Caitlin Dean, an expert on Hyperemesis Gravidarum (HG), or severe morning sickness, offers her advice to Kate Middleton for her third pregnancy", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fkate-2.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/royals/mom-of-3-who-suffered-same-morning-sickness-as-princess-kate-shares-her-survival-tips-its-miserable/", "title": "Expert on Kate Middleton's Severe Morning Sickness", "description": "Caitlin Dean, an expert on Hyperemesis Gravidarum (HG), or severe morning sickness, offers her advice to Kate Middleton for her third pregnancy", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1582&h=828&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fkate-2.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}