{"url": "www.harpersbazaar.com/celebrity/latest/a19599697/khloe-kardashian-baby-bump-photo-timeline/", "text": "Khloé Kardashian is due any day now with her first child with Tristan Thompson. But before we can start gushing over mommy-and-me selfies or indulgent baby pics, we can turn our attention to the expectant mom's baby bump, which we've seen grow as she's documented it on social media.\n\n\n\nFrom her pregnancy announcement to the latest (steamy) post, below are all the posts where Khloé has flaunted her growing belly.\n\nApril 9, 2018\n\nKhloé plants a kiss on Tristan in another outtake from her maternity photoshoot. \"We are ready whenever you are little mama,\" she wrote.\n\nApril 8, 2018\n\nThe mom-to-be, ready to have her baby girl, flaunts her bump while sitting on a birthing ball.\n\nMarch 26, 2017\n\nKhloé's most intimate pregnancy photo yet may be this image from her maternity shoot with Tristan Thompson. The parents-to-be look off into the distance while Thompson caresses Kardashian's baby bump.\n\nMarch 23, 2018\n\nThe expectant mom strikes a pose in a pair of Good American maternity jeans and a cropped turtleneck. Who says pregnant women can't rock crop tops?\n\nMarch 21, 2018\n\nKhloé shares the first pic from her official maternity photoshoot, captured by Sasha Samsonova. The mom-to-be wears nothing but lingerie and a black duster in the shot.\n\nMarch 20, 2018\n\nKhloé goes topless in a Good American shoot to promote maternity jeans.\n\nMarch 17, 2018\n\nKhloé throws it back to her Japan trip with Kourtney and Kim.\n\nMarch 15-16, 2018\n\nAhead of Good American's maternity label launch, Kardashian previewed new pieces with a series of bump-focused Instagram photos.\n\nMarch 12, 2018\n\nKhloé teases the arrival of Good American's maternity line with a silhouette pic.\n\nMarch 10, 2018\n\nIn honor of Tristan's birthday, the couple steps out for dinner at Beauty & Essex in LA.\n\nGetty Images\n\nMarch 10, 2018\n\nKardashian sported a silk minidress and pink duster for her baby shower. The mom-to-be caressed her bump while posing with her family members and baby daddy.\n\nMarch 8, 2018\n\nThe Revenge Body star shares a photo with her two sisters, Kourtney and Kim, while rocking a skin-tight brown mini dress in Japan.\n\nView this post on Instagram OGs A post shared by Khloé (@khloekardashian) on Mar 9, 2018 at 7:00am PST\n\nMarch 7, 2018\n\nKardashian dresses up in nudes whiles shopping in LA.\n\nGetty Images\n\nMarch 2, 2018\n\nKhloé dresses up in baby pink (perhaps as a nod to her incoming baby?) in Kyoto during family trip to Japan. However, the star received backlash for traveling abroad while eight months pregnant.\n\nFebruary 28, 2018\n\nKoKo gets glam in a glittery minidress, cardigan, and teal statement earrings.\n\nFebruary 21, 2018\n\nKardashian again rocks winter whites the maternity way.\n\nFebruary 17, 2018\n\nExpecting parents Khloé and Tristan attend a dinner at Beauty & Essex in LA.\n\nGetty Images\n\nFebruary 16, 2018\n\nKhloé shares a photo from Valentine's Day as she and Tristan, both clutching her bump, pose in front of a balloon arrangement.\n\nFebruary 6, 2018\n\nThe expectant mom rings in 29 weeks with an all-neutral shoot.\n\nFebruary 4, 2018\n\nTo celebrate the birth of her niece, Stormi Webster (Kylie Jenner's baby), Khloé shared an intimate pic of her and Kylie flaunting their bumps together.\n\nJanuary 4, 2018\n\nKhloé dressed in a glam, silky number for her guest appearance on Jimmy Kimmel Live.\n\nAnd she dressed in all white for her appearance on The Ellen Show.\n\nJanuary 2, 2018\n\nThe mom-to-be rings in the new year with a new baby bump photo and announces she's officially six months pregnant, hinting that she's due sometime in March or April.\n\nShe shared a PDA photo with Tristan, too.\n\nDecember 25, 2017\n\nKhloé celebrates Christmas Day with her second baby bump Instagram, where she's dressed up in a silver tasseled jumpsuit.\n\nDecember 20, 2017\n\nAfter about two months of baby rumors, Khloé officially confirms that she is expecting her first child with Tristan Thompson.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-khloe-tristan-930538166-1522172729.jpg?crop=1xw:1xh;center,top&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-khloe-tristan-930538166-1522172729.jpg?crop=1xw:1xh;center,top&resize=1200:*", "keywords": [], "authors": ["Erica Gonzales"], "canonical_link": "https://www.harpersbazaar.com/celebrity/latest/a19599697/khloe-kardashian-baby-bump-photo-timeline/", "title": "Khloé Kardashian Baby Bump Photo Timeline", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#606060", "og": {"type": "article", "site_name": "Harper's BAZAAR", "title": "Khloé Kardashian Newest Baby Bump Photo Is Surprisingly Steamy", "description": "She and Tristan Thompson look so in love in the latest pic.", "url": "https://www.harpersbazaar.com/celebrity/latest/a19599697/khloe-kardashian-baby-bump-photo-timeline/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-khloe-tristan-930538166-1522172729.jpg?crop=1xw:1xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "modified_time": "2018-04-09 01:50:07", "published_time": "2018-04-09 01:50:00", "section": "Celebrity News", "opinion": "false"}, "twitter": {"site": "@harpersbazaarus", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-khloe-tristan-930538166-1522172729.jpg?crop=1xw:1xh;center,top&resize=640:*"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "title": "Khloé Kardashian Baby Bump Photo Timeline - Best Khloé Kardashian Pregnant Instagrams", "description": "A baby bump photo evolution of the mom-to-be Khloé Kardashian, who's expecting her first child soon.", "keywords": "khloe kardashian, khloe kardashian baby bump, khloe kardashian baby bump photos, khloe kardashian due date, khloe kardashian instagram, khloe kardashian pregnant, khloe kardashian tristan thompson, khoe kardashian pregnancy, tristan thompson, khloe kardashian pregnant photos", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-khloe-tristan-930538166-1522172729.jpg?crop=0.5xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrity,celebrity,latest,khloe kardashian baby bump instagram,khloe kardashian instagram,khoe kardashian pregnancy,khloe kardashian due date,khloe kardashian tristan thompson,tristan thompson,khloe kardashian baby bump,khloe kardashian pregnant,khloe kardashian", "sailthru.date": "2018-04-09T13:50:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-khloe-tristan-930538166-1522172729.jpg?crop=1xw:1xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-khloe-tristan-930538166-1522172729.jpg?crop=0.5xw:1xh;center,top", "sailthru.socialtitle": "Khloé Kardashian Newest Baby Bump Photo Is Surprisingly Steamy", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1523209800.0, "source": "https://www.harpersbazaar.com", "summary": ""}