{"url": "www.thesun.co.uk/tvandshowbiz/4214748/the-kardashians-are-desperately-trying-to-rescue-kylie-jenners-new-show-after-its-slammed-as-the-fakest-reality-show-ever/", "text": "Kylie Jenner’s new TV show has been slammed by critics and fans as “fake” and “boring” – and now the Kardashians are desperately trying to rescue the show.\n\nThe Life Of Kylie only managed to draw in half the viewers that brother Rob Kardashian’s reality series Rob & Chyna managed to on it's debut – and The Sun Online can exclusively reveal that the second episode is being re-cut to make it more exciting.\n\n2 In Kylie's show, she agonises over taking the perfect selfie Credit: E! Networks\n\n“The show was a disaster – no-one liked it,” says an LA TV source. “The whole family is panicking and the rest of the series is now being recut to make it more exciting.”\n\n“The ending of the second episode needed more ‘bang’ – like Keeping Up With The Kardashians, you need something that viewers want to come back for.”\n\n“Everyone’s worried that Kylie’s life isn’t exciting enough for viewers who want drama and fighting.”\n\n“They want to include more footage of her sister, Kim, as they think people will tune in to watch then.”\n\n“They’re also telling Kylie to get out there any promote it,” says the insider.\n\nFans have dismissed Kylie’s reality show about her life – in which she admits to being jealous of model sister Kendall and wanting to “run away” from fame - as “unrelatable”, with one saying “a lot of pressure to post a selfie, oh god” and another calling her “a superficial idiot.”\n\n2 Kylie attends a prom in her new show - and viewers weren't impressed Credit: E! Networks\n\nTV reviewers weren’t much kinder. CNN said that the show saw Kylie “combine self-pity with a lack of self-awareness.”\n\n“It makes Kylie look shallow” said Business Insider, while Complex called it “the fakest reality show ever”.\n\n“She’s so rich she can’t even invent a convincing obstacle to surmount on her reality TV show — when Jenner and her gang get devastating news that the private jet they’re supposed to take to Sacramento has broken down, they just call and ask for a different private jet,” said The Daily Beast.\n\nTOON TOT Cheryl shares first video of son Bear, 3, talking - with adorable Geordie accent cosy costars Sons of Anarchy star, 70, seen with new love, 47, after ditching wife of 38yrs CENSORED! Myleene Klass shares X-rated message her boyfriend hid in her lunch PRICE'S POSH PAD Inside Katie Price's new home 10mins from ex Peter Andre beck home The Beckhams have not moved home during lockdown after accusations from fans Exclusive KNEAD YOU HERE Paul Hollywood asks girlfriend of five months to move in & self-isolate\n\nBefore the show started, Kim Kardashian posted a sweet Instagram saying she was “so proud” of her little sister.\n\nThe criticism doesn’t seem to have affected Kylie much – she’s been back on Instagram posting a series of seriously hot selfies.\n\nAnd last night, Kylie’s family – including sisters Khloe and Kim and mum Kris – threw her a surprise 20th birthday party.\n\nWe think she’s going to be alright, guys.\n\nThe Life of Kylie is streaming on hayu from Monday 7th August & premiering Sunday 13th August at 9.00pm on E!\n\nGot a story? email digishowbiz@the-sun.co.uk or call us direct on 02077824220", "images": ["http://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.8 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.thesun.co.uk/wp-content/uploads/2017/08/rr-composite-kylie.jpg?strip=all&quality=100&w=750&h=500&crop=1"], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2017/08/rr-composite-kylie.jpg?strip=all&quality=100&w=750&h=500&crop=1", "keywords": [], "authors": ["Issy Sampson"], "canonical_link": "https://www.thesun.co.uk/tvandshowbiz/4214748/the-kardashians-are-desperately-trying-to-rescue-kylie-jenners-new-show-after-its-slammed-as-the-fakest-reality-show-ever/", "title": "The Kardashians are ‘desperately’ trying to rescue Kylie Jenner’s new show after it’s slammed as ‘the fakest reality show ever’", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "The Kardashians are 'desperately' trying to rescue Kylie Jenner's new show after it's slammed as 'the fakest reality show ever'", "url": "https://www.thesun.co.uk/tvandshowbiz/4214748/the-kardashians-are-desperately-trying-to-rescue-kylie-jenners-new-show-after-its-slammed-as-the-fakest-reality-show-ever/", "description": "Kylie Jenner’s new TV show has been slammed by critics and fans as “fake” and “boring” – and now the Kardashians are desperately trying to rescue the show. The Life Of Kylie only managed to draw in…", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2017/08/rr-composite-kylie.jpg?strip=all&quality=100&w=750&h=500&crop=1", "width": 750, "height": 500}, "locale": "en_GB"}, "article": {"published_time": "2017-08-10T13:00:44+00:00", "modified_time": "2017-08-11T13:40:26+00:00", "publisher": 161385360554578, "tag": "Kim Kardashian, Kylie Jenner, Keeping Up with the Kardashians", "author": "https://www.facebook.com/thesunshowbiz/"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "description": "Kylie Jenner’s new TV show has been slammed by critics and fans as “fake” and “boring” – and now the Kardashians are desperately trying to rescue the show. The Life Of Kylie only managed to draw in half the viewers that brother Rob Kardashian’s reality series Rob& Chyna managed to – and The Sun Online can exclusively reveal that the second episode is being re-cut to make it more exciting.", "keywords": "Kylie Jenner, Kardashians, Kim Kardashian, Keeping Up With The Kardashians, Kris Jenner, The Life Of Kylie", "news_keywords": "Kylie Jenner, Kardashians, Kim Kardashian, Keeping Up With The Kardashians, Kris Jenner, The Life Of Kylie", "twitter": {"text": {"title": "The Kardashians are ‘desperately’ trying to rescue Kylie Jenner’s new show after it’s slammed as ‘the fakest reality show ever’"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "THE STRIFE OF KYLIE", "headline": "The Kardashians are 'desperately' trying to rescue Kylie Jenner's new show after it's slammed as 'fake'", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2017/08/rr-composite-kylie.jpg?strip=all&quality=100&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2017/08/rr-composite-kylie.jpg?strip=all&quality=100&w=620&h=413&crop=1"}}, "parsely-post-id": 4214748, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1502370044.0, "source": "http://www.thesun.co.uk", "summary": ""}