{"url": "https://web.archive.org/web/20171106195452/http://www.newsweek.com/donna-brazile-book-seth-rich-dnc-murder-conspiracy-702838", "text": "A new book by Donna Brazile, the former interim chairwoman of the Democratic National Committee (DNC), has been making headlines for its controversial claims about the 2016 presidential election and the Hillary Clinton campaign. But the provocative points start even before the first chapter, as Brazile reportedly dedicated the book in part to Seth Rich, the DNC staffer whose murder launched a conspiracy theory.\n\nAxios reported on Sunday that the book's dedication reads, “In loving memory of my father, Lionel Brazile Sr.; my beloved sister, Sheila Brazioutlanle; my fearless uncles Nat, Floyd, and Douglas; Harlem’s finest, my aunt Lucille; my friend and mentor, David Kaufmann; my DNC colleague and patriot, Seth Rich; and my beloved Pomeranian, Chip Joshua Marvin Brazile (Booty Wipes). I miss y’all.”\n\nRelated: TV Ad With Russian Subtitles Questions Seth Rich’s Murder\n\nKeep up with this story and more by subscribing now\n\nRich, 27, was fatally shot in July 2016 while walking home late at night in Washington, D.C. The police believe the shooting was a robbery gone wrong. But Rich worked for the DNC, and WikiLeaks published thousands of emails from the committee two weeks after his death. That timeline provoked theories that Rich had given the materials to WikiLeaks and that his death was an attempt to stop him from doing so, or to punish him for it.\n\nMedia reports had characterized Rich as a low-level staffer, and his parents wrote in an opinion piece for The Washington Post in May, “Those who have suggested that Seth’s role as a data analyst at the DNC gave him access to a wide trove of emails are simply incorrect.”\n\nSAUL LOEB/AFP/Getty\n\nRich appears elsewhere in Brazile’s book, as the Post reported earlier in the weekend. She wrote that Rich’s murder haunted her and that she'd installed surveillance cameras at her home and would keep the blinds in her office window closed so she could not be seen by snipers, according to the Post.\n\nBrazile talked about Rich on ABC News’s This Week with George Stephanopoulos on Sunday. She told the host about her critics: “They don’t know what it was like to be over the DNC during this hacking. They don’t know what it’s like to bury a child. I did: Seth Rich.”\n\nBrazile had spoken publicly about Rich’s death before. In March, she said she was going to an Omaha, Nebraska, synagogue to speak about him. In May, she tweeted, “Seth Rich was a hard worker and proud to be an American. This desire to scar Seth’s legacy to his country and party is shameful.” About two months later, after Fox News published a since debunked story about the case, she tweeted, “Seth was a good soul and look at this shameful act.”\n\nThrough spokesman Brad Bauman, the Rich family said in a statement, “Since Seth was murdered, Donna Brazile has been a great friend to the Rich family and has been extremely supportive of the family’s efforts to find Seth’s killers.”\n\nIn the book, out Tuesday, Brazile also writes that she weighed the possibility of replacing Clinton as the Democratic presidential nominee with former Vice President Joe Biden, according to the Post. She also reportedly wrote that Clinton’s campaign headquarters seemed “antiseptic, like a hospital,” and that she felt as though the Clinton campaign was treating her like a “slave.” In an excerpt that Politico published on November 2, she wrote about how the Clinton campaign worked out a fundraising agreement with the DNC and exercised control over the party long before Clinton became the nominee.\n\nFormer aides to the Clinton campaign have challenged Brazile’s claims. In a November 4 open letter, more than 100 former top aides wrote, “It is particularly troubling and puzzling that she would seemingly buy into false Russian-fueled propaganda, spread by both the Russians and our opponent, about our candidate’s health.”\n\nBrazile was not available for comment through her publisher, Hachette Book Group, or through Georgetown University, where she is a faculty member. The publisher was unavailable to verify the reported wording of the book dedication.", "images": ["https://web.archive.org/web/20171106195452im_/http://s.newsweek.com/sites/www.newsweek.com/files/styles/thumbnail/public/2017/05/16/0516sethrichwikileaks.jpg", "https://web.archive.org/web/20171106195452im_/http://s.newsweek.com/sites/www.newsweek.com/files/styles/thumbnail/public/2017/06/20/0620sethrichprofilingproject.jpg", "https://web.archive.org/web/20171106195452im_/http://s.newsweek.com/sites/www.newsweek.com/files/2017/11/06/1106donnabrazilesethrich.jpg", "https://web.archive.org/web/20171106195452im_/http://s.newsweek.com/sites/www.newsweek.com/files/styles/embed-lg/public/2017/11/06/1106donnabrazilesethrich.jpg", "https://web.archive.org/web/20171106195452im_/http://s.newsweek.com/sites/www.newsweek.com/files/styles/thumbnail/public/2017/05/19/0519sethrichrussiatweet.jpg", "https://web.archive.org/web/20171106195452im_/http://s.newsweek.com/sites/www.newsweek.com/files/styles/thumbnail/public/2017/05/23/0523kimdotcomsethrich.jpg"], "top_img": "https://web.archive.org/web/20171106195452im_/http://s.newsweek.com/sites/www.newsweek.com/files/2017/11/06/1106donnabrazilesethrich.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20171106195452/http://www.newsweek.com/donna-brazile-book-seth-rich-dnc-murder-conspiracy-702838", "title": "DNC’s Donna Brazile Dedicated Her Book to ‘Patriot’ Seth Rich, Whose Death Made Her Fear for Her Own Life", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1, user-scalable=no", "news_keywords": "donna, brazile, chairwoman, chair, chairperson, chairman, democratic, national, committee, dnc, book, hack, hillary, clinton, 2016, presidential, election, campaign, seth, rich, staffer, wikileaks, murder, murdered, killed, theory, suspect, conspiracy", "fb": {"app_id": 245537789135954, "pages": 18343191100}, "og": {"type": "article", "site_name": "Newsweek", "url": "https://web.archive.org/web/20171106195452/http://www.newsweek.com/donna-brazile-book-seth-rich-dnc-murder-conspiracy-702838", "title": "DNC’s Donna Brazile dedicated her book to “patriot” Seth Rich", "description": "Rich’s mysterious death was the subject of conspiracy theories.", "image": "https://web.archive.org/web/20171106195452im_/http://s.newsweek.com/sites/www.newsweek.com/files/2017/11/06/1106donnabrazilesethrich.jpg"}, "article": {"publisher": "https://www.facebook.com/Newsweek", "section": "U.S.", "modified_time": "2017-11-06T12:05:56-05:00", "published_time": "2017-11-06T11:38:11-05:00"}, "twitter": {"site": "@newsweek", "card": "summary_large_image", "title": "DNC’s Donna Brazile dedicated her book to “patriot” Seth Rich", "url": "https://web.archive.org/web/20171106195452im_/http://www.newsweek.com/donna-brazile-book-seth-rich-dnc-murder-conspiracy-702838", "description": "Rich’s mysterious death was the subject of conspiracy theories.", "image": "https://web.archive.org/web/20171106195452im_/http://s.newsweek.com/sites/www.newsweek.com/files/styles/full/public/2017/11/06/1106donnabrazilesethrich.jpg"}, "msapplication-TileColor": "#ff0000", "msapplication-TileImage": "http://s.newsweek.com/sites/www.newsweek.com/themes/newsweek/favicons/mstile-144x144.png", "msapplication-config": "http://s.newsweek.com/sites/www.newsweek.com/themes/newsweek/favicons/browserconfig.xml", "com.silverpop.brandeddomains": "www.pages06.net,aidataconf.com,amp.ibtimes.co.uk,e-amp.newsweek.com,e-sns.newsweek.com,europe.newsweek.com,events.newsweek.com,ibt-dev.co.uk,ibtimes.co.uk,ibtimes.com,idigitaltimes.com,latintimes.com,medicaldaily.com,newsweek.com,player.one,sns.europe.newsweek.com,sns.ibtimes.co.uk,subscription.newsweek.com,www.ibt-dev.co.uk,www.ibtimes.co.uk,www.ibtimes.com", "description": "Rich’s mysterious death was the subject of conspiracy theories."}, "movies": [], "publish_date": 1509986291.0, "source": "https://web.archive.org", "summary": ""}