{"url": "https://people.com/music/aaron-carter-makes-mistakes-says-doesnt-drink-alcohol-dui-arrest/", "text": "Aaron Carter is opening up about what he claims really happened during his DUI arrest on Saturday night in Habersham County, Georgia.\n\nThe 29-year-old singer sat down for a tearful interview with Entertainment Tonight on Tuesday to discuss his arrest and refusal to undergo a breathalyzer and drug test to determine whether or not he was under the influence. He was found in possession of less than one ounce of marijuana and drug-related objects, according to a report obtained by PEOPLE.\n\nGet push notifications with news, features and more.\n\n“Basically, I’ve been listening to America and Stevie Wonder and the O Brother, Where Art Thou? soundtrack,” Carter says about how he’s carrying on after the incident.\n\nImage zoom Allen Berezovsky/Getty Image\n\nRELATED: Carter Family Woes: The Music Clan’s Troubled History\n\nCarter’s girlfriend, Madison Parker, was in the car with him and was also arrested. Just before the arrest, the pair was in North Carolina for a club appearance on Friday. Carter claims he decided to purchase an inexpensive car to avoid wasting money on rentals because he suffers from severe anxiety over flying stemming from watching the 9/11 terrorist attacks.\n\n“I opened for Michael Jackson Sept. 9 and 10 in 2001. We all left the morning of Sept. 11 and watched the Trade Centers get hit across the Hudson River, and I saw it with my own eyes and I saw people jumping out of the buildings and burned,” says Carter.\n\nCarter says the car he bought was “a lemon, so the alternator was shot, and then it kept dying.” After discovering the windows were stuck in the down position and the car’s locking system gave out, Carter “put my girlfriend in the back of the car and I guarded the car all night for eight hours,” he claims.\n\nAfter tweeting about missing his Saturday show with Flo Rida in Kansas City, Missouri, due to “transportation issues,” Carter says he changed routes to head to Alabama, and that’s when he was stopped at an AutoZone in Georgia to fix his alignment after getting a new tire. He was then approached by police after a motorcyclist had reported him for reckless driving.\n\n“[They] forcefully grabbed me out,” claims Carter. “[I] stepped outside. I say, ‘I invoke the right to speak to my attorney,’ and they disregarded that, they revoked that immediately. They said, ‘Is there anything illegal in the car?’ I said, ‘I have marijuana in the car.'”\n\nRELATED VIDEO: Aaron Carter Hits Back at Brother Nick After DUI Arrest and Alleges He Was Targeted Because He’s Famous\n\nGeorgia authorities previously refuted Carter’s claims of police aggression to PEOPLE. “The incident report reads that [Carter] was cooperate with the deputies and there was no incident between him and the deputies during arrest,” said Capt. Floyd Canup of the Habersham County Sheriff’s Office.\n\nHowever, Canup said that Carter’s girlfriend – who was in the car at the time – failed to follow deputies’ commands and was arrested for obstruction of law enforcement officers, as well as possession of drug-related objects and possession of marijuana.\n\nCarter’s rep, Jonathan Ward, previously told PEOPLE exclusively that the star has “nothing against the police” and understands they were doing their job. “Madison has never been arrested … she was scared, as anyone would be. She apologizes, in particular to Aaron’s fans,” Ward added.\n\nCarter claims he did not have any alcohol or drugs in his system at the time of his arrest, though he admitted to smoking marijuana “nine hours before that” for his anxiety, chronic pain and to increase his appetite.\n\nImage zoom ET\n\n“I do not drink alcohol at all,” says Carter, who claims he suffers from a medical condition called hiatal hernia that prevents him from consuming any type of alcohol. However, he added he will occasionally enjoy beer.\n\n“I’ll occasionally have a sip of a beer or something like that, but I can’t even drink IPAs,” he says. “I can’t drink anything like that. I have to drink the lightest beer possible that’s not hoppy. I don’t drink any hard liquor.”\n\nRELATED VIDEO: Aaron Carter Opens Up About Eating Disorder & Slams Hard Drug Rumors\n\nDuring the interview, Carter also admitted to previously being on pain medication — which he has since stopped taking — due to a jaw injury and claims he is not taking any other drugs.\n\n“No. Nothing. Zero. I am willing to do a polygraph test,” he says. “I take Xanax, Propranolol for high blood pressure medication and I took oxycodones for my mouth.”\n\nAnd he’s hoping to get a message across to his fans claiming he needs to seek professional help for drug addiction.\n\n“It hurts real bad because people don’t know me, and I have no control over it, and this is the way I am,” he says. “I have a medical condition. When I was 19 years old, I got an endoscopy done in Tennessee and I was diagnosed with a hiatal hernia. The doctor told me I have to keep stress out of my life, or else it’s gonna take a toll on me and I can develop cancer.”\n\n“I don’t need help,” he adds. “What I need is for people to understand that I’m human and that I make mistakes just like every other human in this world, but I would never risk my life or my girlfriend’s life.”\n\nWhile Carter forcefully denies he’s ever smoked crack cocaine, meth or taken heroin, he says his biggest mistake is trying ecstasy “a couple of times” when he was 16 years old.\n\n“I do not drink,” he says, again. “Hire a polygraph person, a professional. Strap me up.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Faaron-carter.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Faaron-carter.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Faaron-carter-a.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Faaron-carter.jpg", "keywords": [], "authors": ["Nicole Sands"], "canonical_link": "https://people.com/music/aaron-carter-makes-mistakes-says-doesnt-drink-alcohol-dui-arrest/", "title": "Aaron Carter Speaks Out Following DUI Arrest", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Aaron Carter,Music News,News", "news_keywords": "Aaron Carter,Music News,News", "description": "\"I do not drink alcohol at all,\" Carter tells Entertainment Tonight in a new interview", "og": {"title": "Tearful Aaron Carter Says 'I'm Human and I Make Mistakes' Following Arrest", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/music/aaron-carter-makes-mistakes-says-doesnt-drink-alcohol-dui-arrest/", "description": "Aaron Carter is opening up about what he claims&nbsp;really happened during his DUI arrest on Saturday night in Habersham County, Georgia. The 29-year-old singer sat&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Faaron-carter.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/music/aaron-carter-makes-mistakes-says-doesnt-drink-alcohol-dui-arrest/", "description": "\"I do not drink alcohol at all,\" Carter tells Entertainment Tonight in a new interview", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Faaron-carter.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/music/aaron-carter-makes-mistakes-says-doesnt-drink-alcohol-dui-arrest/", "title": "Tearful Aaron Carter Says 'I'm Human and I Make Mistakes' Following Arrest", "description": "\"I do not drink alcohol at all,\" Carter tells Entertainment Tonight in a new interview", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F07%2Faaron-carter.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}