{"url": "www.independent.co.uk/news/world/americas/matt-damon-publicist-moving-australia-donald-trump-good-will-hunting-jason-bourne-hillary-clinton-a8261126.html", "text": "Matt Damon’s publicist has moved to deny reports that the actor is moving to Australia with his family over anger with Donald Trump.\n\nThe Daily Telegraph newspaper in Sydney had reported Damon was buying a home in Byron Bay near actor Chris Hemsworth. The two recently appeared in Thor: Ragnarok together.\n\nDamon spokeswoman Jennifer Allen said Damon has been to Australia a lot recently. But Damon has not bought a home there nor is he relocating there, she said.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nThe New York Post’s Page Six gossip site, citing an unnamed source, said the Good Will Hunting and Jason Bourne star told friends and colleagues he wanted to leave the country because he disagrees with Mr Trump’s policies.\n\nWhen asked about Damon’s rumoured motivation, Ms Allen wrote in an email, “he’s not moving out of the US”. Damon has publicly supported Democrats, including Mr Trump’s rival in the 2016 presidential election, Hillary Clinton.\n\nThe reports first emerged on Thursday and claimed Damon was moving to Australia along with his four daughters and wife, Luciana Barroso.\n\nDamon has previously shown his lack of support for the President. In January last year, during a panel in Davos, he said America was heading into “new territory” with the President.\n\nMeanwhile, during the 2016 US presidential elections Damon expressed he was “nervous” about the prospect of a Trump presidency. “There’s no way we can let this guy be the [president]. To let that dude have the nuclear football, are you kidding me? He’s impulsive and rash and doesn’t seem to think deeply about too many things,” he said in an interview on ABC’s Popcorn With Peter Travers.\n\nEarlier this week, Damon and Ben Affleck announced they will implement inclusion riders and will employ diverse casts and crews to work on their upcoming projects. The pair, founded Pearl Street Films in 2012 and have followed Ghostbusters director Paul Fieg and Michael B Jordan in championing social inclusion within the film industry.\n\nAdditional reporting from AP", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/03/17/15/matt-damon.jpg", "http://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/03/17/15/matt-damon.jpg", "keywords": [], "authors": ["Daniel Khalili-Tari"], "canonical_link": "https://www.independent.co.uk/news/world/americas/matt-damon-publicist-moving-australia-donald-trump-good-will-hunting-jason-bourne-hillary-clinton-a8261126.html", "title": "Matt Damon’s publicist forced to deny reports actor is moving to Australia because he can't stand Donald Trump", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "https://www.independent.co.uk/news/world/americas/matt-damon-publicist-moving-australia-donald-trump-good-will-hunting-jason-bourne-hillary-clinton-a8261126.html", "title": "Matt Damon forced to deny he's moving to Australia to escape Trump", "description": "Press agent debunks rumours previously circulated by news outlets claiming Hollywood star intended to leave with family because he disapproved of President's policies", "updated_time": "2018-03-17T16:17:57+00:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/03/17/15/matt-damon.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/8261126"}, "description": "Matt Damon’s publicist has moved to deny reports that the actor is moving to Australia with his family over anger with Donald Trump.  The Daily Telegraph newspaper in Sydney had reported Damon was buying a home in Byron Bay near actor Chris Hemsworth. The two recently appeared in Thor: Ragnarok together.", "keywords": "Matt Damon, Donald Trump, Australia, Sydney, Good Will Hunting, Jason Bourne, Americas, World, News", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Matt Damon", "published_time": "2018-03-17T16:17:57+00:00", "modified_time": "2018-03-17T16:17:57+00:00", "section": "Americas", "author_name": "Daniel Khalili-Tari", "content_type": "story", "word_count": 394, "image_count": 1, "video_count": 0, "embed_count": 0, "internal_link_count": 9, "external_link_count": 1}, "twitter": {"title": "Matt Damon forced to deny he's moving to Australia to escape Trump", "description": "Matt Damon’s publicist has moved to deny reports that the actor is moving to Australia with his family over anger with Donald Trump.  The Daily Telegraph newspaper in Sydney had reported Damon was", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1521303477.0, "source": "http://www.independent.co.uk", "summary": ""}