{"url": "www.nscdscamps.org/blog/category/parenting/467344/update-second-roy-moore-accuser-works-for-michelle-obama-right-now-departed", "text": "Read original article here\n\nLiberals sure are afraid of Roy Moore. Not only did they push a woman in front of the cameras to cry and lie about some stuff that allegedly happened 35 years ago she’s just now remembering to mention (we refuse to repeat the salacious allegations because they are 100% verifiable fake news) but when the fake 14-year-old didn’t work for them, the Democrat Party did something even worse: they doubled down on the story, introduced a new actress, and had her tell an even more horrible lie.\n\n\n\nFiona Dourif says she was 11 years old when Moore “groped her in the alley behind the” church they both attended in 1957. “It was the most horrifying moment of my life,” she told MSNBC’s Rachel Maddow on Friday night. She then described the series of events that allegedly happened, including the obviously false allegation that he baited her into the alley with candy. “Roy Moore definitely did all of those things and more,” she said looking into the camera, dry-eyed.\n\n\n\nMaddow then interviewed Dourif’s parents, who said that they knew of the alleged abuse but didn’t say anything until he was running for Senator because they “feared for their lives.” Of course, if that was the case they would not have waited until he had more political power and wealth than he did when this allegedly happened.\n\n\n\nOne piece of information Dourif failed to mention is that she is currently employed as a housekeeper for Michelle Obama at the D.C. mansion “she” and her “husband” Barack share. This information was uncovered by Gateway Pundit’s Charles C. Johnson, who notes in his report that “Dourif is paid extremely well according to public documents, which report a $250,783.33 annual salary for Dourif.”\n\n\n\n“Why would Barack and Michelle Obama’s housekeeper suddenly remember that she was molested by someone who is running for public office – someone of the opposing party,” Johnson writes. “This stinks more than Malia Obama’s dorm room after one of her reefer parties.”\n\n\n\nWhat exactly is going on? Ever since it her employer was revealed, Dourif has gone dark, removing all of her social media presences and refusing to respond to interview requests from any source.", "images": ["https://i0.wp.com/departedme.com/wp-content/uploads/2017/11/111-15.png?fit=678%2C381", "https://www.nscdscamps.org/wp-content/uploads/2019/12/logo.png"], "top_img": "https://i0.wp.com/departedme.com/wp-content/uploads/2017/11/111-15.png?fit=678%2C381", "keywords": [], "authors": [], "canonical_link": "https://www.nscdscamps.org/blog/category/parenting/467344", "title": "UPDATE: Second Roy Moore Accuser Works For Michelle Obama Right NOW - Departed", "meta_data": {"viewport": "width=device-width, initial-scale=1", "twitter": {"card": "summary_large_image", "description": "Liberals sure are afraid of Roy Moore. Not only did they push a woman in front of the cameras to cry...", "title": "UPDATE: Second Roy Moore Accuser Works For Michelle Obama Right NOW - Departed", "image": "https://i0.wp.com/departedme.com/wp-content/uploads/2017/11/111-15.png?fit=678%2C381"}, "description": "Liberals sure are afraid of Roy Moore. Not only did they push a woman in front of the cameras to cry and lie about some stuff that allegedly happened ...", "fb": {"app_id": 1403473566365645}, "og": {"type": "article", "title": "UPDATE: Second Roy Moore Accuser Works For Michelle Obama Right NOW - Departed", "description": "Liberals sure are afraid of Roy Moore. Not only did they push a woman in front of the cameras to cry...", "url": "https://www.nscdscamps.org/blog/category/parenting/467344", "site_name": "Blog - North Shore Country Day School", "image": {"identifier": "https://i0.wp.com/departedme.com/wp-content/uploads/2017/11/111-15.png?fit=678%2C381", "url": "https://i0.wp.com/departedme.com/wp-content/uploads/2017/11/111-15.png?fit=678%2C381", "secure_url": "https://i0.wp.com/departedme.com/wp-content/uploads/2017/11/111-15.png?fit=678%2C381", "width": 678, "height": 381}}}, "movies": [], "publish_date": null, "source": "http://www.nscdscamps.org", "summary": ""}