{"url": "entertainment.inquirer.net/156463/chris-nolan-explains-why-he-kept-actors-casting-a-secret", "text": "LOS ANGELES—(Spoiler alert: This column has spoilers about the movie, “Interstellar.”) Why was Matt Damon’s casting in “Interstellar” kept under wraps until recently? This question and more were answered by spouses Christopher Nolan and Emma Thomas, director and producer, respectively, of the sci-fi/adventure/drama.\n\n“Interstellar,” written by Chris and his brother Jonah, follows a team of explorers as they travel beyond the galaxy to find another home for humankind since Earth is nearing its end.\n\nADVERTISEMENT\n\nWhile “Interstellar” features some stunning visual images of the voyage, the film succeeds more when it delves into relationships through a family, that of Cooper (Matthew McConaughey), an experienced pilot, and his two children, Murph (Mackenzie Foy) and Tom (Timothee Chalamet).\n\nJessica Chastain and Ellen Burstyn portray Murph at various ages while Casey Affleck plays the older Tom. Anne Hathaway, Wes Bentley, Michael Caine, John Lithgow and Topher Grace round out the cast.\n\nExcerpts from our interview:\n\nWhy did you keep Matt Damon’s casting a secret?\n\nChris Nolan (C): I imagined Doctor Mann a bit like from Joseph Conrad’s “Heart of Darkness.” You have Kurtz, this character that you hear about. Everybody says, “Oh, he’s great. Maybe you’ll get to meet him.” I really love the idea for an audience to go, when they see him, “Oh, it’s Matt Damon. It’s going to be okay.”\n\nMatt very graciously agreed to do it. He didn’t have to shoot for long. So we didn’t want to market the film using him because he’s not in it very much. We didn’t want to mislead people. But Matt is a very important part of the movie. It’s fun to watch with an audience who doesn’t know because they haven’t heard about it.\n\nMatt has the most amazing ability to project integrity and warmth. So he turns up in the film and he’s got a plan and it’s all going to be okay. For me, to realize that he’s a frail human being and subject to cowardice and all the terrible weaknesses that we all have… he loved that challenge. I loved what he did with it.\n\nEmma Thomas (E): If people get to watch the film twice, it’s so great watching Matt when you know what’s really going on.\n\nC: When people see Matt’s face, they are like, oh, okay. It’s the lift that the movie needs at that point. Structurally, you have a lot of talk in the 20 minutes before. There’s a lot of negativity, a lot bad things happening. The film is very much going to a dark place at that point. So getting that lift in that way with a great actor and movie star coming on screen, is a good thing.\n\nADVERTISEMENT\n\nHow has the dynamics between the two of you evolved over the years?\n\nE: (Laughs.) We love working together— obviously, with Jonah as well—in a large part because, when you are working with somebody whom you are tied to beyond by blood or marriage, there’s a lack of agenda. Or as Chris once said, I (Emma) have an agenda. He knows what it is. (Laughs.)\n\nBut there’s a level of trust that is fantastic, particularly when you are making a big movie like this one. I am often asked as a producer and when Chris is the director, “When do you tell Chris, no, he can’t have that?” The truth is, I am very lucky because Chris is also a producer. He takes every aspect of the filmmaking process very seriously.\n\nHe is very helpful in terms of trying to figure out how we make the film for the correct budget, and so on. To me, it’s never absolutely saying no. I tell Chris [how I feel about] certain things. We have discussions. But ultimately, it’s Chris’ vision. He always has a very strong idea of what a film is going to be. He’s the director and it’s very much his film.\n\nI see my job as being very much a facilitator for that, filtering out the things that he doesn’t have to worry about so he can concentrate on getting the film made.\n\nC: It’s fantastic working with people you have worked with a long time and have a high degree of trust in. Emma is always very objective, which is great… I consider Emma a very good gauge (from a moviegoer perspective) because she’s not particularly interested in science-fiction or science. (Laughs.)\n\nI show her the film and ask, “Are you following the emotional threads?” What’s wonderful about working with someone like Emma is that I get an honest opinion, good or bad, instantly. There are no politics to it.\n\nThis film’s working title or code name was “Flora’s Letter,” a cinematic letter to your daughter. How is your relationship with your kids reflected in the story?\n\nC: The relationship between a father and his children was clearly something I related to very strongly in the script. Murph was originally written as a boy in my brother’s draft. I changed the character to a girl—just instinctively. It may well be because Flora, my eldest, is a girl.\n\nYou do have different relationships with sons and daughters. It really paid off with Matthew because what he was very determined about was that his character’s love for his children should be equal for both. The character having a girl and a boy took the burden off the idea of favoritism. It’s not that he loves Murph more than he loves Tom. There’s just a different relationship. And Murph is more interested in science and the things that have driven her father’s life.\n\nE: Girls are much more complicated, I feel. And boys are rather…\n\nC: Simple.\n\nE: I wouldn’t say simple.\n\nC: That’s what you were thinking, though.\n\nE: It’s complicated. It’s one of my favorite things about the film. I almost don’t think of it as a big, spectacular space movie. I really love the relationships. They feel very real to me as the mother of a girl and boys.\n\nWhen I watch Mackenzie’s performance, she feels incredibly real to me. I [see] my own daughter in her. Going back to the code name question, I will just say that we have always had code names for our films—our kids’ names. It was just Flora’s turn (laughs).\n\nWhat are the kids’ ages?\n\nE: Now that’s a difficult question (laughs). They are 12, 11, 9 and 7. Flora is the oldest.\n\nEmma, you were quoted as saying that Chris could not have done this film 12 years ago when you didn’t have kids. Can you both talk about that?\n\nE: I am not saying that Chris couldn’t have made this film 12 years ago. But there’s such a heart, such a reality to the relationships in the movie. The reason we pick a movie to make—because it’s a long process—is that you have to feel an affinity for the story. You have to want to put that story up on the screen.\n\nThe place that Chris and I are in now is very different from where we were 12 years ago. This is a story that we are interested in telling. It’s also a movie that is fun to watch with our kids. We watch different movies now than we did 12 years ago because the kids came along.\n\nC: The simple answer is, I don’t know if I couldn’t [have done this movie 12 years ago], but I wouldn’t have and I didn’t. Becoming a father was a very big change in my life, something that affected my outlook and the kind of stories that I am interested in telling and in ways that I would have never been able to predict and not in simple ways.\n\nWe did a press conference yesterday and Matthew was asked about being a father. He said he could have played the part even before he had kids. What I didn’t say to him because I didn’t want to embarrass him—but I am going to embarrass him now—is that I would have found it very difficult to cast someone who wasn’t a father. Matthew was absolutely the right person to play the role. He’s a terrific father.\n\nWhy did you choose a Dylan Thomas poem to use in the film?\n\nC: Those lines at the end—“Do not go gentle into that good night… Rage, rage against the dying of the light”—I have [not] heard a better way of expressing the sentiment of death, dying, the end of the world, any of those things. There’s such a raw emotion in those words; they speak to me so strongly. I didn’t want to write my own version of that. Another example, which I didn’t use, would be of TS Elliot saying, “This is the way the world ends/Not with a bang but a whimper.”\n\n(E-mail the columnist at [email protected] Follow him at www.twitter.com/nepalesruben.)\n\nRead Next\n\nEDITORS' PICK\n\nMOST READ", "images": ["https://entertainment.inquirer.net/single2017/images/inquirerdotnet_2016.svg", "https://entertainment.inquirer.net/single2017/images/sm_share_fb.svg", "https://entertainment.inquirer.net/landing2017/images/ch-follow-us.svg", "https://entertainment.inquirer.net/single2017/images/inquirerdotnet_2016_white.svg", "https://entertainment.inquirer.net/landing2017/images/ch-like-us.svg", "https://entertainment.inquirer.net/single2017/images/fb-icon-blank.svg", "https://entertainment.inquirer.net/single2017/images/sm-share-email2.svg", "https://entertainment.inquirer.net/single2017/images/sm_share_twt.svg", "https://entertainment.inquirer.net/files/2014/11/1114interstellar-3.jpg", "https://d5nxst8fruw4z.cloudfront.net/atrk.gif?account=EEzxg1aAQ700y0", "http://amplifypixel.outbrain.com/pixel?mid=00a51dfd915770a7547723911a319f366a", "https://entertainment.inquirer.net/files/2014/11/1113INTERSTELLAR-6-300x171.jpg", "https://entertainment.inquirer.net/files/2014/11/1114interstellar-3-600x402.jpg", "https://entertainment.inquirer.net/files/2014/11/1114interstellar2-300x373.jpg", "https://www.facebook.com/tr?id=2004610026278274&ev=PageView \n&noscript=1", "https://www.facebook.com/tr?id=767727496894134&ev=PageView&noscript=1", "https://entertainment.inquirer.net/single2017/images/sm_share_bookmark.svg", "https://entertainment.inquirer.net/single2017/images/twitter-icon-blank.svg"], "top_img": "https://entertainment.inquirer.net/files/2014/11/1114interstellar-3-600x402.jpg", "keywords": [], "authors": ["Ruben V. Nepales"], "canonical_link": "https://entertainment.inquirer.net/156463/chris-nolan-explains-why-he-kept-actors-casting-a-secret", "title": "Chris Nolan explains why he kept actor’s casting a secret", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "og": {"ttl": 345600, "title": "Chris Nolan explains why he kept actor’s casting a secret", "description": "(Spoiler alert: This column has spoilers about the movie, “Interstellar.”) Why was Matt Damon’s casting in “Interstellar” kept under wraps until recently? This question and more were answered by spouses Christopher Nolan and Emma Thomas, director and producer, respectively, of the sci-fi/adventure/drama.", "url": "https://entertainment.inquirer.net/156463/chris-nolan-explains-why-he-kept-actors-casting-a-secret", "image": "https://entertainment.inquirer.net/files/2014/11/1114interstellar-3-600x402.jpg", "type": "article"}, "fb": {"app_id": 175228195865217, "pages": 142802334452}, "author": "Ruben V. Nepales", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "twitter": {"card": "summary_large_image", "description": "(Spoiler alert: This column has spoilers about the movie, “Interstellar.”) Why was Matt Damon’s casting in “Interstellar” kept under wraps until recently? This question and more were answered by spouses Christopher Nolan and Emma Thomas, director and producer, respectively, of the sci-fi/adventure/drama.", "title": "Chris Nolan explains why he kept actor’s casting a secret | Inquirer Entertainment", "image": "https://entertainment.inquirer.net/files/2014/11/1114interstellar-3.jpg"}}, "movies": [], "publish_date": null, "source": "http://entertainment.inquirer.net", "summary": ""}