{"url": "https://www.cheatsheet.com/health-fitness/inside-jay-z-and-beyonces-family-including-the-most-beautiful-thing-blue-ivy-ever-said-to-her-father.html/", "text": "They may be picture perfect, but even the Knowles-Carter family has their troubles. Beyoncé and Jay-Z, powerhouse performers, have recently garnered a ton of media attention for their marital troubles and three adorable children.\n\nThe family of five may seem like an enigma, but we have some details about the couple, their kids, and the heartwarming thing that Blue Ivy told her father (page 6). Plus, Jay-Z credits this one trip as the thing that saved his life (page 7).\n\n1. They keep things pretty private\n\nBeyoncé and Jay-Z share private details about their lives only when they feel ready. | Beyoncé and Jay-Z share private details about their lives only when they feel ready. | Beyoncé via Instagram\n\nIt’s a long-standing joke with a level of truth to it: Beyoncé controls the media. She released a visual album without so much as a single leak or peep and spread the news of Disney’s live-action remake of The Lion King before the multibillion-dollar company could.\n\nThis privacy extends to her personal life. She and husband Jay-Z welcomed twins Rumi and Sir into the world in 2017. We know next to nothing about the twins short of their birth announcement and Beyoncé’s internet-breaking photos.\n\nNext: How the couple does choose to share their story\n\n2. They lay everything out through their music\n\nThey leave hidden clues in their music. | Jason Miller/Getty Images They leave hidden clues in their music. | Jason Miller/Getty Images\n\nUntil his recent interview with David Letterman, the world only assumed Jay-Z cheated on Beyoncé by deciphering their music with a fine-toothed comb. In early 2017, Jay-Z released 4:44 and Beyoncé released Lemonade.\n\nHer song “Hold Up” gave the most obvious clues with the lyrics; “What a wicked way to treat the girl that loves you/I smell your secrets and I’m not too perfect to ever feel this worthless.” Jay-Z nearly confirmed the adultery on his track “4:44” claiming “And if my children knew, I don’t even know what I would do.”\n\nNext: What we know for sure about the family\n\n3. Jay-Z cheated on Beyonce\n\nJay-Z admitted to doing this. | Stephen Lovekin/Getty Images Jay-Z admitted to doing this. | Stephen Lovekin/Getty Images\n\nThe singers both referenced a “Becky” on their albums — alluding to the woman Jay-Z allegedly had an affair with. Jay-Z spoke with late-night talk show host David Letterman to clear up the rumors surrounding his alleged affair.\n\n“I want to have the emotional tools that it takes to keep my family together,” Jay-Z told Letterman on an episode of the Netflix show My Guest Needs No Introduction. “And, much like you, I have a beautiful wife who is understanding and knew that I’m not the worst of what I’ve done.”\n\nNext: One of Jay-Z’s kids already takes after him\n\n4. Sir already takes after Jay-Z\n\nThe proud grandma shared some sweet information about their twins. | Emma McIntyre/Getty Images The proud grandma shared some sweet information about their twins. | Emma McIntyre/Getty Images\n\nBeyonce’s mother, Tina Knowles-Lawson, couldn’t help but fawn over her grandchildren. Sir, her only grandson and twin to Rumi, apparently “twins” with another member of the family — Jay-Z.\n\n“Other than the boy [Sir] has a stare, like a mean mug, like Jay sometimes, which is so cute, and the girl [Rumi], she’s just so happy all the time and so sweet. They are just adorable!” Knowles-Lawson also called the twins’ personalities “so different” and “wonderful.”\n\nNext: One of their kids is already a style star.\n\n5. Blue Ivy has become a child fashion icon of sorts\n\nBlue Ivy’s outfits make fashion lovers go crazy. | Christopher Polk/Getty Images Blue Ivy’s outfits make fashion lovers go crazy. | Christopher Polk/Getty Images\n\nMajor fashion publications — Vogue, Elle, and Harper’s Bazaar among them — have deemed Blue Ivy Carter “best dressed” and a style star, even compared to full-grown women. She even has her own section on InStyle.com!\n\nThe six-year-old wears custom Gucci dresses, Dior to the Grammys, and gets to match Beyoncé on a regular basis. What more could you want?\n\nNext: The heartwarming thing Blue Ivy told Jay-Z.\n\n6. She told her father how she felt\n\nA touching and memorable moment for Jay-Z. | Robyn Beck/Getty Images A touching and memorable moment for Jay-Z. | Robyn Beck/Getty Images\n\nJay-Z expressed frustration at Blue Ivy one morning before school. “She was asking a thousand questions and we had to leave for school,” he told Letterman during their interview. He recalled hearing a “little voice” while driving.\n\n“‘Dad?’ I turn around and she’s like, ‘I didn’t like when you told me to get in the car the way you told me. It hurt my feelings,'” she said. “That’s the most beautiful thing you ever said to me,” Jay-Z responded.\n\nNext: The trip Jay-Z believes changed his life.\n\n7. Jay-Z believes a trip to London spared him from jail\n\n| Mark Davis/Getty Images | Mark Davis/Getty Images\n\nJay-Z traveled to London in 1989 to visit EMI Records. He told Letterman the label “wanted the association” but for that very reason, the deal couldn’t go through. When Carter realized it “wasn’t about the music,” he was out.\n\n“During that time,” he said, “there was a secret indictment and they swept up and grabbed 30 of my friends. Everyone got locked up and went to jail.” Par for the course, Jay-Z used music to tell the story long before an interview. He raps in Pusha T’s song Drug Dealers Anonymous; “Google me, baby, you crazy/’89 in London pull the Benz up.”\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2018/04/Beyonce-holding-her-twins.png", "https://www.cheatsheet.com/wp-content/uploads/2018/04/Tina-knowles-640x434.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/04/Beyonce-looks-at-Blue-Ivy-640x418.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/08/JayZBlueIvy-640x320.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/04/Beyonce-holding-her-twins.png?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.cheatsheet.com/wp-content/uploads/2017/06/BeyonceJayZgame-640x300.png?x62514", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2017/06/JayZ-640x300.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/04/Blue-Ivy-and-Jay-Z-640x407.png?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/04/Beyonce-holding-her-twins.png", "keywords": [], "authors": ["Emma Bleznak"], "canonical_link": "https://www.cheatsheet.com/health-fitness/inside-jay-z-and-beyonces-family-including-the-most-beautiful-thing-blue-ivy-ever-said-to-her-father.html/", "title": "Inside Jay-Z and Beyoncé’s Family of 5, Including the ‘Most Beautiful’ Thing Blue Ivy Ever Said to Her Father", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/health-fitness/inside-jay-z-and-beyonces-family-including-the-most-beautiful-thing-blue-ivy-ever-said-to-her-father.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "The power couple has one of the most talked-about families in the world, but how much do you really know about them? You won't want to miss the touching thing Blue Ivy said to her father, either.", "og": {"locale": "en_US", "type": "article", "title": "Inside Jay-Z and Beyoncé’s Family of 5, Including the 'Most Beautiful' Thing Blue Ivy Ever Said to Her Father", "description": "The power couple has one of the most talked-about families in the world, but how much do you really know about them? You won't want to miss the touching thing Blue Ivy said to her father, either.", "url": "https://www.cheatsheet.com/health-fitness/inside-jay-z-and-beyonces-family-including-the-most-beautiful-thing-blue-ivy-ever-said-to-her-father.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-06-23T13:50:04-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2018/04/Beyonce-holding-her-twins.png", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2018/04/Beyonce-holding-her-twins.png"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "parenting", "section": "Health & Fitness", "published_time": "2018-06-23T13:50:00-04:00", "modified_time": "2018-06-23T13:50:04-04:00"}, "twitter": {"card": "summary_large_image", "description": "The power couple has one of the most talked-about families in the world, but how much do you really know about them? You won't want to miss the touching thing Blue Ivy said to her father, either.", "title": "Inside Jay-Z and Beyoncé’s Family of 5, Including the 'Most Beautiful' Thing Blue Ivy Ever Said to Her Father", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/04/Beyonce-holding-her-twins.png", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1529776200.0, "source": "https://www.cheatsheet.com", "summary": ""}