{"url": "https://www.standard.co.uk/news/uk/princess-eugenie-proposal-was-a-complete-surprise-a3746836.html", "text": "ES News email The latest headlines in your inbox twice a day Monday - Friday plus breaking news updates Enter your email address Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid You already have an account. Please log in Register with your social account or click here to log in I would like to receive lunchtime headlines Monday - Friday plus breaking news alerts, by email Update newsletter preferences\n\nPrincess Eugenie has spoken of her “complete surprise” when her now fiancé Jack Brooksbank got down on one knee.\n\nSpeaking to the BBC’s The One Show, she said that she cried when he popped the question and described the proposal as an “incredible moment\".\n\nThe couple who have been together for 7 years, met on a skiing trip and said that it was “love at first sight”.\n\nThe Princess told the One Show presenter Matt Baker: \"We met when I was 20 and Jack was 24, fell in love, and we have the same passions and drive for life. So nice we get to share this moment with everyone and you get to meet Jack.\"\n\nPrincess Eugenie, 27, and Mr Brooksbank, 31, got engaged in Nicaragua earlier this month during a private holiday, the palace revealed.\n\nThe couple said the proposal took place near an undisclosed lake.\n\nThe princess said: \"The lake was so beautiful, the light was a special light I've never seen.\n\n\"I actually said, 'This is an incredible moment' and then he popped the question, which was really surprising even though we've been together seven years - a complete surprise.\n\n\"It was like this perfect moment, we couldn't be happier because we knew it was going to end up this way.\"\n\nShe added \"I was over the moon, crying,\" and when asked if she saw the proposal coming, replied it was a \"complete surprise\".\n\nDuring the brief TV interview Princess Eugenie's fiance said he helped design his bride-to-be's engagement ring: \"I went and found an amazing padparadscha sapphire but didn't want to do anything until Eugenie had signed off on it.\"\n\nWhen Mr Baker asked if the princess was going for a \"straight\" or \"meringue\"-style wedding dress she joked: \"Maybe a mix of both if there's such a thing. No meringue shoulders, that's a little bit out of fashion. We'll see what happens but planning will start as of tomorrow, I assume.\"\n\nThe princess said only their parents, siblings and the Queen and Philip knew before Monday's big announcement.\n\nThe engagement has been greeted with joy by her parents the Duke and Duchess of York, with Prince Andrew summing up the feelings of the royal family with the words: \"I'm absolutely overjoyed. I'm thrilled.\"\n\nThe Queen and Duke of Edinburgh also expressed their delight at the news, wishing their granddaughter and her fiance \"all the best\".\n\nPrime Minister Theresa May said of the announcement in a tweet: \"My very best wishes to Princess Eugenie and Jack Brooksbank on their engagement - congratulations to the happy couple.\"\n\nMr Brooksbank's parents said in a short statement: \"We could not be more delighted with the news of the engagement.\n\n\"We are completely over the moon and are very excited for them both.\"\n\nThey plan to marry this autumn in St George's Chapel at Windsor Castle - the same venue as Prince Harry and Meghan Markle's wedding in May - but Prince Andrew said a date had yet to be chosen.", "images": ["https://static.standard.co.uk/s3fs-public/thumbnails/image/2018/01/22/21/princess-eugenie.jpg"], "top_img": "https://static.standard.co.uk/s3fs-public/thumbnails/image/2018/01/22/21/princess-eugenie.jpg", "keywords": [], "authors": ["Alexandra Richards"], "canonical_link": "https://www.standard.co.uk/news/uk/princess-eugenie-proposal-was-a-complete-surprise-a3746836.html", "title": "Princess Eugenie says proposal from Jack Brooksbank was a 'complete surprise'", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#dc062b", "og": {"url": "https://www.standard.co.uk/news/uk/princess-eugenie-proposal-was-a-complete-surprise-a3746836.html", "title": "Princess Eugenie: proposal was a 'complete surprise'", "description": "Princess Eugenie has spoken of her “complete surprise” when her now fiancé Jack Brooksbank got down on one knee. Speaking to the BBC’s The One Show, she said that she cried when he popped the question and described the proposal as an “incredible moment\". The couple who have been together for 7 years, met on a skiing trip and said that it was “love at first sight”.", "updated_time": "2018-01-23T08:56:14+00:00", "image": "https://static.standard.co.uk/s3fs-public/thumbnails/image/2018/01/22/21/princess-eugenie.jpg", "site_name": "Evening Standard", "type": "article", "locale": "en_GB", "video": {"identifier": "https://f1.media.brightcove.com/4/1348423965/1348423965_5716539048001_5716539401001.mp4?pubId=1348423965&videoId=5716539401001", "type": "application/octet-stream"}}, "fb": {"pages": 165348596842143, "app_id": 193840110715213, "admins": 36903991}, "ia": {"markup_url": "https://www.standard.co.uk/pwamp/fbi/3746836"}, "description": "Princess Eugenie has spoken of her “complete surprise” when her now fiancé Jack Brooksbank got down on one knee. Speaking to the BBC’s The One Show, she said that she cried when he popped the question and described the proposal as an “incredible moment\". The couple who have been together for 7 years, met on a skiing trip and said that it was “love at first sight”.", "keywords": "Royal Wedding, Princess Eugenie, UK, News", "article": {"tag": "Royal Wedding", "published_time": "2018-01-22T21:59:00+00:00", "modified_time": "2018-01-23T08:56:14+00:00", "publisher": 165348596842143, "section": "UK", "subsection": "Video", "author_name": "Alexandra Richards", "content_type": "story", "word_count": 550, "image_count": 2, "video_count": 0, "embed_count": 0, "internal_link_count": 1, "external_link_count": 1}, "twitter": {"title": "Princess Eugenie: proposal was a 'complete surprise'", "description": "Princess Eugenie has spoken of her “complete surprise” when her now fiancé Jack Brooksbank got down on one knee. Speaking to the BBC’s The One Show, she said that she cried when he popped the", "card": "summary_large_image", "site": "@standardnews"}, "google-site-verification": "fI_fn7lv1QlqGWXMIJoqDICBG1ynAC0UDsrriO8e_m8", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Evening Standard"}, "movies": [], "publish_date": 1516658340.0, "source": "https://www.standard.co.uk", "summary": ""}