{"url": "www.cheatsheet.com/entertainment/the-voice-things-we-know-about-gwen-stefani-and-blake-sheltons-relationship.html/", "text": "Singer Blake Shelton performs on the Honda Stage at the iHeartRadio Theater on May 9, 2016, in Burbank, California. | Kevin Winter/Getty Images for iHeartMedia Singer Blake Shelton performs on the Honda Stage at the iHeartRadio Theater on May 9, 2016, in Burbank, California. | Kevin Winter/Getty Images for iHeartMedia\n\nThe Voice will soon be back for another season. This time around Adam Levine, Alicia Keys, Blake Shelton, and Gwen Stefani are the show’s coaches. Gwen’s return as a coach should be interesting now that she and Blake are further into their relationship. There are reports that this has had an effect on their contracts with The Voice and what the couple is planning next for their relationship.\n\nCurious about what’s going on between them? Here are 10 things we know about their relationship.\n\n1. They have recently released music about their divorces\n\nMiranda Lambert and Blake Shelton attend the BMI 2014 Country Awards. | Rick Diamond/Getty Images Miranda Lambert and Blake Shelton attend the BMI 2014 Country Awards. | Rick Diamond/Getty Images\n\nGwen and Blake were both recently divorced when they got together. Blake got a divorce from Miranda Lambert. And his new album, If I’m Honest, purposely starts off with a party song and then goes into sadder music, a transition that reflects his personal life. “That’s when it became painfully obvious that it wasn’t going to work out in my ­marriage,” he told Billboard. Although the singer has made a new album about the end of the relationship, there is still mystery surrounding what caused the divorce.\n\nGwen had a messy divorce from Gavin Rossdale after she reportedly found out he cheated. She came out with a new album that includes a single titled, “Used To Love You.”\n\n“It was really a life-saver record for me,” she told Time. “It wasn’t until I had to go through the worst tragedy that it really opened up a channel for me to be like, ‘God gave me a gift. I’m going to use it now. Because if I don’t, I’m going to die.'”\n\n2. Blake’s divorce announcement on The Voice brought them closer\n\nGwen Stefani, Craig Wayne Boyd, and Blake Shelton on The Voice | NBC Gwen Stefani, Craig Wayne Boyd, and Blake Shelton on The Voice | NBC\n\nWhen the two started working together they had no clue they were both going through the same thing. Then, Blake decided to announce his divorce.\n\n“We were all mic-ed up and everything, and Blake’s like, ‘I gotta talk to you guys.’ And he basically made his announcement,” Gwen told Howard Stern. “He basically told me what was going on with him. We just started this friendship. I wasn’t trying to start a relationship. I was just trying to not die. There was no plan. It was an incredible gift to be able to have a friend.”\n\n3. Gwen had no clue who Blake was before going on the show\n\nBlake Shelton and Gwen Stefani on The Voice | NBC Blake Shelton and Gwen Stefani on The Voice | NBC\n\nThis is probably the case for many fans of The Voice who aren’t country music lovers. But it’s a little more surprising for someone in the industry to admit. Gwen revealed on Late Night with Seth Meyers, “I didn’t even know that Blake Shelton existed in the world! I had no idea.” She also had no clue what he sounded like.\n\nHe sent me this song in an email, and I was so scared because at that point I really didn’t know even what his voice really sounded like. Like, I’d heard it on the show, but I wasn’t paying attention. I was like, ‘Whatever, country guy’s on. When’s Pharrell coming on?’\n\n4. They didn’t confirm they were dating until November 2015\n\nGwen Stefani and Blake Shelton on The Voice | NBC Gwen Stefani and Blake Shelton on The Voice | NBC\n\nIn the beginning, there were rumors the two were dating, but they still kept it secret. Still, it was badly kept because there were photos of them getting cozy together at a Halloween party. Finally, in November, Blake’s rep confirmed they were dating to E! News.\n\n\n\n5. Gwen and Blake are actually working like a team this season\n\nGwen Stefani and Blake Shelton on The Voice | NBC Gwen Stefani and Blake Shelton on The Voice | NBC\n\nIt seemed unclear whether the couple’s romantic relationship would make them more competitive with each other or whether they would work together. It looks like the latter will be happening.\n\n“We’ll be driving home at night, and I’ll be like, ‘Do you think I should put these two people against each other?’ and he’ll be like, ‘Yeah, yeah, yeah,'” Gwen revealed to ET. “I was like, ‘I don’t believe you! I think you’re trying to trick me right now!'”\n\n6. They’re reportedly being paid more because of their relationship\n\nBlake Shelton, Gwen Stefani, Adam Levine, and Alicia Keys on The Voice | NBC Blake Shelton, Gwen Stefani, Adam Levine, and Alicia Keys on The Voice | NBC\n\nIt’s possible The Voice might see a ratings boost from fans hoping to get a look into the couple’s relationship on the show. Because of this, they are reportedly getting paid more.\n\n“[Blake and Gwen] are getting paid an exceptional bonus that is significantly higher than the other judges to keep the spark alive on-camera,” a production source told Radar Online. “The producers really want to see Gwen and Blake in competition more often this upcoming season, versus working with each other like they have in the past.”\n\n7. But they do have a breakup clause in their contracts\n\nGwen Stefani on The Voice | NBC Gwen Stefani on The Voice | NBC\n\nOf course there is a risk this plan could backfire. Instead of the couple being cute on screen, they could end up breaking up and might not want to work with each other. Well, the producers have a safety net in place in case of a break-up.\n\n“And, of course, there is a stipulation in their contract, which is more of a break-up clause,” the production source told Radar Online. “If, for some reason, they call it quits, they are both required to finish out the remainder of their existing contracts.”\n\n8. They have reportedly already finalized their wedding plans\n\nBlake Shelton performs on the Honda Stage at the iHeartRadio Theater. | Kevin Winter/Getty Images Blake Shelton performs on the Honda Stage at the iHeartRadio Theater. | Kevin Winter/Getty Images\n\nThis couple is all in when it comes to their relationship. They reportedly have already made their wedding arrangements. “They’ve met with vendors,” a source told Us Weekly in 2016. The source also claimed they want to get married “before the end of the year.” So even though we didn’t see a 2016 wedding, one might be on the horizon.\n\n\n\n9. It will reportedly be a $3 million Beverly Hills wedding\n\nGwen Stefani and Blake Shelton backstage at the People’s Choice Awards 2017 | Christopher Polk/Getty Images Gwen Stefani and Blake Shelton backstage at the People’s Choice Awards 2017 | Christopher Polk/Getty Images\n\nThere have been reports the couple decided to get married in Beverly Hills on May 5, 2017. According to OK! Magazine, they sent out invitations that said the ceremony would be at the Church of the Good Shepherd. Other stars, including Mark Wahlberg, Elizabeth Taylor, Frank Sinatra, and Judy Garland, have gotten hitched there previously.\n\n10. They are putting the wedding on hold (for now)\n\nBlake Shelton and Gwen Stefani during the NFL game at the University of Phoenix Stadium | Christian Petersen/Getty Images Blake Shelton and Gwen Stefani during the NFL game at the University of Phoenix Stadium | Christian Petersen/Getty Images\n\nThe celebrity couple has reportedly been making big plans for their wedding in hopes to tie the knot this year. However, it looks like those plans are on hold. According to Life & Style, they want to do one more thing first.\n\n“They’re trying to have a baby first,” a source close to Gwen revealed. “That’s their main focus right now. She’s determined to have another baby and carry it herself, even though Blake has said it doesn’t matter if they adopt or get a surrogate.” This actually might be a challenging endeavor considering Gwen had her three kids through vitro treatments. “Physically and emotionally, it was just a lot for her,” continued the source. “So she’s trying to get pregnant naturally for the time being.”\n\nFollow Nicole Weaver on Twitter @nikkibernice\n\nCheck out Entertainment Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2017/02/Blake-Shelton-and-Gwen-Stefani.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2014/09/gwen-stefani-the-voice-season-7-640x360.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2016/10/the-voice.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/02/Blake-Shelton-1024x720.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/02/Blake-Shelton-and-Gwen-Stefani-.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/02/gwen-stefani-craig-blake-shelton-the-voice-1.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/02/Gwen-Stefani-and-Blake-Shelton-Peoples-Choice-Awards-1.jpg?x62514", "http://www.cheatsheet.com/wp-content/uploads/2017/02/Blake-Shelton-1024x720.jpg", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.cheatsheet.com/wp-content/uploads/2017/02/blake-shelton-and-gwen-stefani-the-voice-1.jpg?x62514", "http://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2017/02/the-voice-season-12.jpg?x62514", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2017/02/go-ahead-and-break-my-heart-blake-shelton-gwen-stefani-lifeunderaluckystar-kriscondebolos.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/02/Blake-Shelton-and-Miranda-Lambert-1.jpg?x62514"], "top_img": "http://www.cheatsheet.com/wp-content/uploads/2017/02/Blake-Shelton-1024x720.jpg", "keywords": [], "authors": ["Nicole Weaver"], "canonical_link": "https://www.cheatsheet.com/entertainment/the-voice-things-we-know-about-gwen-stefani-and-blake-sheltons-relationship.html/", "title": "'The Voice': 10 Things We Know About Gwen Stefani and Blake Shelton's Relationship", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/the-voice-things-we-know-about-gwen-stefani-and-blake-sheltons-relationship.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "The couple is back for Season 12 of \"The Voice.\" Find out what they have in store for the upcoming season and their relationship.", "og": {"locale": "en_US", "type": "article", "title": "'The Voice': 10 Things We Know About Gwen Stefani and Blake Shelton's Relationship", "description": "The couple is back for Season 12 of \"The Voice.\" Find out what they have in store for the upcoming season and their relationship.", "url": "https://www.cheatsheet.com/entertainment/the-voice-things-we-know-about-gwen-stefani-and-blake-sheltons-relationship.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2017-08-04T14:10:04-04:00", "image": "http://www.cheatsheet.com/wp-content/uploads/2017/02/Blake-Shelton-1024x720.jpg"}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "The Voice", "section": "Entertainment", "published_time": "2017-08-04T14:10:00-04:00", "modified_time": "2017-08-04T14:10:04-04:00"}, "twitter": {"card": "summary_large_image", "description": "The couple is back for Season 12 of \"The Voice.\" Find out what they have in store for the upcoming season and their relationship.", "title": "'The Voice': 10 Things We Know About Gwen Stefani and Blake Shelton's Relationship", "site": "@cheatsheet", "image": "http://www.cheatsheet.com/wp-content/uploads/2017/02/Blake-Shelton-1024x720.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1501870200.0, "source": "http://www.cheatsheet.com", "summary": ""}