{"url": "https://www.etonline.com/chrissy-metz-talks-kates-challenging-but-relatable-this-is-us-pregnancy-journey-exclusive-114153", "text": "Kate Pearson's journey is only just beginning on This Is Us.\n\nIt's been a roller-coaster of a ride for Kate, who, after suffering a miscarriage in season two and taking a calculated risk to undergo IVF this season, learned the treatments had been successful and that she was indeed pregnant with Toby's baby. The news came at an inopportune time, however, as Toby's worsening depression formed a dark cloud over what should have been a celebratory time. For Chrissy Metz, exploring Kate's pregnancy this time has been particularly fulfilling, because of the trials and tribulations that have come with it.\n\n\"It's very exciting to not only see a character who struggles with infertility and conception, but that there's a woman who is very relatable, who is just going through what so many women go through and that we get to see it unfold in a very specific way, as opposed to, 'I'm having a hard time getting pregnant,'\" Metz tells ET. \"How does it affect her relationship? How does it affect her and her mental and emotional state? How is she going to react to it? How do they move through all of the difficulties and come out of the other side of it?\"\n\nThe 38-year-old actress admitted that it's been \"a challenge\" for her to delve into the intricacies of a complex pregnancy like Kate's because she doesn't have real-life experiences to draw from -- yet.\n\nChrissy Metz Is Dating Music Composer Hal Rosenfeld This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart Chrissy Metz Is Dating Music Composer Hal Rosenfeld\n\n\"I've never had children; I have many nieces and nephews, and I taught preschool. I'm looking forward to that [having kids in real life], but I also love the fact that Kate really loves her mother and really wants to share something with her, whether it was music and now being pregnant and having children, and the love for her father and Rebecca's husband,\" she says. \"There are all these special layers of bonds that her and her mom have, but I think it's a beautiful connection that might be a byproduct of her being pregnant. Of course, wanting to see them as parents -- Kate and Toby and how much fun they might be or what challenges might be up ahead. There's a lot to uncover. All of it is exciting.\"\n\nMetz expressed optimism that through this experience, Kate will create a stronger bond with her mother, Rebecca, which has been contentious at times, because of the ups and downs she will be going through during her pregnancy.\n\n\"What's so interesting about their relationship and most relationships is we learn from each other. Kate is going to understand her mother a much different way being a mother herself and understanding how difficult it is to want to please your husband or please yourself or please your child and still have a foundation of respect, and what's right and what's wrong,\" Metz teases. \"There's no handbook for being a parent and I think that Kate will understand her mom in a very different way. Hopefully, it'll bring them together in the sense that Kate knows deep down that her mom always meant well. But she can take into her new motherhood a different perspective and trying things a different way because she understands her mom differently [and] because she understands herself differently.\"\n\nWith Kate's fertility doctor warning her early on about the potential health risks of an IVF pregnancy, will she be more pro-active in maintaining her health now that she is carrying a bun in the oven?\n\n\"What's interesting is there are a lot of plus-size women who have perfect pregnancies and perfect children, and there's not a glitch or any sort of issues to overcome. While she may be dealing with some things or adverse reactions about being plus-size, that's not always the case. In Kate's particular case, overall mentally, emotionally and physically, she wants to be in a good state because it's a pregnancy that was difficult to come by,\" Metz says.\n\n\"You can look at it from both sides. She'll be diligent in making sure that everything's right, but also just because you're plus-size doesn't mean you're going to have a difficult pregnancy. There are these ideas of what it's supposed to look like and how much you should weigh and these stipulations put upon you,\" she adds. \"In Kate's case, it's very, very important to her. Her baby is her priority and she'll definitely make sure of that.\"\n\nThis Is Us airs Tuesdays at 9 p.m. ET/PT on NBC.\n\nRELATED CONTENT:\n\n'This Is Us' Newcomer Michael Angarano Warns Nicky's Death Is 'Tragic' (Exclusive)\n\n'This Is Us' Emotionally Honors Pittsburgh After Deadly Synagogue Shooting\n\n'This Is Us' Sneak Peek: Kevin Can't Stop Obsessing Over Jack's Mystery Woman (Exclusive)", "images": ["https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2018-11/this_is_us_kate_tgiving.jpg?h=29dd2f9f&itok=ck5YBhyH", "https://www.etonline.com/themes/custom/et/img/watch-now.png", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-11/this_is_us_kate_tgiving.jpg?h=29dd2f9f&itok=Lym1slIR", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/rupauls_drag_race__E_1208_droop_sneak_1920x1080.jpg?h=70217200&itok=U94nGmuG", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/gettyimages-692085362.jpg?h=c673cd1c&itok=TnqSx9El"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-11/this_is_us_kate_tgiving.jpg?h=29dd2f9f&itok=Lym1slIR", "keywords": [], "authors": ["Philiana Ng"], "canonical_link": "https://www.etonline.com/chrissy-metz-talks-kates-challenging-but-relatable-this-is-us-pregnancy-journey-exclusive-114153", "title": "Chrissy Metz Talks Kate's Challenging, But 'Relatable' 'This Is Us' Pregnancy Journey (Exclusive)", "meta_data": {"article": {"opinion": "false"}, "title": "Chrissy Metz Talks Kate's Challenging, But 'Relatable' 'This Is Us' Pregnancy Journey (Exclusive)  | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/chrissy-metz-talks-kates-challenging-but-relatable-this-is-us-pregnancy-journey-exclusive-114153", "title": "Chrissy Metz on Kate's 'Relatable''This Is Us' Pregnancy Journey", "description": "The 38-year-old actress opens up to ET about exploring the intricacies of Kate's new life chapter.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-11/this_is_us_kate_tgiving.jpg?h=29dd2f9f&itok=Lym1slIR", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "The 38-year-old actress opens up to ET about exploring the intricacies of Kate's new life chapter.", "title": "Chrissy Metz on Kate's 'Relatable''This Is Us' Pregnancy Journey", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Philiana Ng‍", "url": "https://www.etonline.com/chrissy-metz-talks-kates-challenging-but-relatable-this-is-us-pregnancy-journey-exclusive-114153", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-11/this_is_us_kate_tgiving.jpg?h=29dd2f9f&itok=Lym1slIR"}, "description": "The 38-year-old actress opens up to ET about exploring the intricacies of Kate's new life chapter.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "TV, News, Chrissy Metz, This Is Us, Wellness", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}