{"url": "https://web.archive.org/web/20100405072544/http://demint.senate.gov:80/public/index.cfm?p=JimsBlog", "text": "A day after the Senate adjourned for Easter recess President Obama said he was going to appoint 15 of his nominees during the break, depriving the Senate the opportunity to vet and vote on any of them.\n\n\n\nCircumventing constitutional Senate vetting is dangerous because President Obama’s track record in vetting nominees and other high-level appointees has been very poor. At least 10 of them have already resigned or withdrawn in disgrace.\n\n\n\nJust yesterday, Maj. Gen. Robert A. Harding withdrew his nomination to become the director of the Transportation Security Administration after it was discovered he claimed “service disabled veteran” status for sleep apnea. President Obama’s first nominee for that position, Erroll Southers, withdrew after refusing to respond to requests relating to false testimony he gave to Congress and his censure by the FBI for improperly accessing files.\n\n\n\nMany of the people President Obama is granting recess appointments will hold high level positions that will greatly influence job creation in this country.\n\n\n\nOne of them, Craig Becker, is a former super lawyer for the AFL-CIO and Service Employees International Union.\n\n\n\nBecker supports union-friendly, job-killing “card check” legislation to eliminate the secret ballot requirement to organize a workplace. Now, President Obama is installing him into a position to do it administratively, as Mr. Becker has advocated doing in the past.\n\n\n\nThis is being done over the will of the Senate. On February 9, on a bipartisan vote the Senate rejected Becker’s nomination to the 5-member National Labor Relations Board (NLRB). Democrat Senator Ben Nelson (D-Nebraska) said at the time that Mr. Becker, \"would take an aggressive personal agenda to the NLRB, and that he would pursue a personal agenda there.\" Moreover, all 41 Republican senators wrote President Obama a letter earlier this week asking him not to overturn this vote and give Becker a recess appointment.\n\n\n\nYet, President Obama is ramming his “card check czar” through the Senate, just like he did with health care earlier this month.\n\n\n\nThere are many unanswered questions and concerns about the other 14 nominees as well. That’s why it’s critical that the Senate have the opportunity to vet and vote on nominees.\n\n\n\nBelow is the “Top 10” list of President Obama’s nominees and appointees who have resigned in disgrace.\n\n\n\n1. Obama’s nominee to chair the National Intelligence Council, Chas Freeman, withdrew over questions about payments from the Saudi Arabian government, business ties to the state-owned China National Offshore Oil Corp., and negative statements he made about U.S. support for Israel. After he resigned he issued a combative public statement blaming the “Israel lobby” for “character assassination.”\n\n\n\n2. White House “Green Jobs” czar Van Jones resigned after he it was discovered he signed a statement in support of a 9/11 “Truther” group.\n\n\n\n3. Former Sen. Tom Daschle (D-South Dakota) withdrew his nomination to become Health and Human Services Secretary after it was discovered he failed to properly pay his taxes.\n\n\n\n4. Nancy Killefer, Obama’s nominee to serve as the government’s chief performance officer, withdrew due to tax problems.\n\n\n\n5. Governor Bill Richardson (D-New Mexico) withdrew his nomination to become Commerce Secretary because of an ongoing investigation into whether he doled out government contracts in exchange for campaign money.\n\n\n\n6. White House Social Secretary Desiree Rogers resigned after posing for photos at a White House dinner that a couple crashed through security to attend.\n\n\n\n7. Jonathan Z. Cannon, nominated to serve as deputy director at the Environmental Protection Administration, withdrew over questions about a defunct non-profit, America’s Clean Water Foundation, where he served as a board member. In 2007, EPA auditors accused the non-profit of mismanaging $25 million in taxpayer funding.\n\n\n\n8. Jide Zeitlin, Obama’s nominee to serve as U.S ambassador to the United Nations for management and reform withdrew his name while being accused of identify fraud and improper business practices.\n\n\n\n9. Erroll Southers, Obama’s nominee to serve as director of the Travel Security Administration, withdrew after refusing to answer questions about collective bargaining and false testimony he presented to Congress.\n\n\n\n10. Maj. Gen. Robert A. Harding, Obama’s second nominee to service as director of the Travel Security Administration, withdrew his name after it was discovered he received “service disabled veteran” status for sleep apnea.\n\n", "images": ["https://web.archive.org/web/20100405072544im_/http://demint.senate.gov/public/_skins/default/images/template/icon_rss.png", "https://web.archive.org/web/20100405072544im_/http://farm5.static.flickr.com/4066/4425089308_a21361094e.jpg", "https://web.archive.org/web/20100405072544im_/http://demint.senate.gov/public/_skins/default/images/template/icon_facebook.png", "https://web.archive.org/web/20100405072544im_/http://demint.senate.gov/public/_skins/default/images/favicon.ico", "https://web.archive.org/web/20100405072544im_/http://demint.senate.gov/public/_skins/default/images/template/icon_youtube.png", "https://web.archive.org/web/20100405072544im_/http://s7.addthis.com/static/btn/lg-bookmark-en.gif", "https://web.archive.org/web/20100405072544im_/http://demint.senate.gov/public/_skins/default/images/template/icon_twitter.png", "https://web.archive.org/web/20100405072544im_/http://farm5.static.flickr.com/4058/4424320121_d4117cae21.jpg"], "top_img": "https://web.archive.org/web/20100405072544im_/http://demint.senate.gov/public/_skins/default/images/favicon.ico", "keywords": [], "authors": ["Jim'S Staff", "Senator Jim Demint"], "canonical_link": "", "title": "United States Senator Jim DeMint", "meta_data": {}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}