{"url": "https://popculture.com/celebrity/2018/03/30/john-goodman-alcoholism-battle-drinking-at-work-roseanne-emmys/", "text": "With the success of Roseanne's revival and recent news that the ABC sitcom has now been renewed for a second season, 65-year-old series star, John Goodman is opening up about a darker time during his career.\n\nGoodman, who is celebrating 10 years of sobriety, admitted in an interview with Willie Geist on Sunday TODAY that his alcoholism got so bad at one point, that he found himself in the habit of drinking at work.\n\n\"I got so lucky because I was still getting hired for things, but the fact is, I was drinking at work,\" Goodman said. \"My speech would be slurred. I thought I was fooling people. My cheeks would turn bright red when I was liquored up and I just looked like a stop sign.\"\n\nGoodman finally entered rehab to combat his alcoholism in 2007 a month after he finished filming, Speed Racer. He claims his tipping point came after \"a long weekend playing golf with my friends,\" which was the same weekend he won the only Emmy Award of his career for a guest role on Studio 60 on the Sunset Strip.\n\nGoodman admitted he missed rehearsals for the show because he was too drunk.\n\n\"By the time Sunday morning rolled around, I was shaking, I was still drinking but I was still drinking,\" Goodman said. \"I called my wife, which is like, turning myself in to the Gestapo, and she made some phone calls. We got me into a treatment center and I detoxed there and decided I like the feeling. And it's been 10 years.\"\n\nGoodman admitted in a 2016 interview on The Howard Stern Show that he drank on the set of The Big Lebowski, as well as on the set of Roseanne during its original run.\n\n\"You're...losing a lot of other things like brain function, memory function, inhibition, control,\" he said. \"You wind up doing things you'll regret later and develop an attitude. But I use to think I was free and clear, nobody knew I was drinking, I was living on Altoids. My cheeks had turned bright red.\"\n\nGoodman credits his wife, Annabeth Hartzog, with helping him clean up his act. According to an interview with Vulture in 2012, he got into the habit of attending an Alcoholics Anonymous meeting every morning to help others combat their addiction.\n\nRoseanne's new season airs episodes every Tuesday night on ABC.", "images": ["https://media.popculture.com/2018/03/roseanne-john-goodman-dan-conner-abc-20030393-640x320.jpeg"], "top_img": "https://media.popculture.com/2018/03/roseanne-john-goodman-dan-conner-abc-20030393-640x320.jpeg", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/celebrity/2018/03/30/john-goodman-alcoholism-battle-drinking-at-work-roseanne-emmys/", "title": "John Goodman Recalls Drinking at Work While Battling Alcoholism", "meta_data": {"description": "With the success of Roseanne's revival and recent news that the ABC sitcom has now been renewed for a second season, 65-year-old series star, John Goodman is opening up about a darker time during his career.Goodman, who is celebrating 10 years of sobriety, admitted in an interview with Willie [...]", "keywords": "John Goodman,Roseanne,Alcoholism", "news_keywords": "John Goodman,Roseanne,Alcoholism", "twitter": {"card": "summary", "site": "@PopCulture", "creator": "@PopCulture", "title": "John Goodman Recalls Drinking at Work While Battling Alcoholism", "description": "With the success of Roseanne's revival and recent news that the ABC sitcom has now been renewed [...]", "image": "https://media.popculture.com/2018/03/roseanne-john-goodman-dan-conner-abc-20030393-640x320.jpeg"}, "og": {"title": "'Roseanne' Star Opens up About Drinking at Work While Battling Alcoholism", "type": "article", "url": "https://popculture.com/celebrity/2018/03/30/john-goodman-alcoholism-battle-drinking-at-work-roseanne-emmys/", "image": {"identifier": "https://media.popculture.com/2018/03/roseanne-john-goodman-dan-conner-abc-20030393-640x320.jpeg", "width": 640, "height": 320}, "site_name": "Celebrity", "description": "With the success of Roseanne's revival and recent news that the ABC sitcom has now been renewed [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1522339200.0, "source": "https://popculture.com", "summary": ""}