{"url": "https://en.wikipedia.org/wiki/Travis_Scott", "text": "American rapper, singer, and record producer from Texas\n\nJacques Berman Webster II[4] (born April 30, 1992),[1] known professionally as Travis Scott (formerly stylized as Travi$ Scott), is an American rapper, singer, songwriter, and record producer. In 2012, Scott signed his first major-label deal with Epic Records. In November of the same year, Scott signed a deal with Kanye West's GOOD Music, as part of its production wing Very GOOD Beats. In April 2013, Scott signed a record deal with T.I.'s Grand Hustle imprint.\n\nScott's first full-length project, the mixtape Owl Pharaoh, was self-released in 2013. It was followed with a second mixtape, Days Before Rodeo, in August 2014. His debut studio album, Rodeo (2015), was led by the hit single \"Antidote\". His second album, Birds in the Trap Sing McKnight (2016) became his first number one album on the Billboard 200. The following year, Scott released a collaborative album with Quavo titled Huncho Jack, Jack Huncho under the group name Huncho Jack. In 2018, his highly anticipated Astroworld was released to widespread critical acclaim and produced his first Billboard Hot 100 number one single, \"Sicko Mode\".[5] In late 2019, Scott's record label Cactus Jack Records released the compilation album JackBoys which became the first number one album on the Billboard 200 of the 2020s.\n\nScott's musical style has been described as a fusion of traditional hip hop, lo-fi and ambient. Scott has sold over 45 million certified records in the US alone.[6] He has been nominated for six Grammy Awards and won a Billboard Music Award.\n\nEarly life\n\nJacques Berman Webster II[4] was born in Houston, Texas. From ages one through six, Webster lived with his grandmother in South Park, Houston. Located in south-central Houston, the neighborhood was notorious for crime and had an impact on a young Webster, \"Growing up, my grandmother stayed in the 'hood so I seen random crazy shit. [I saw] mad bums and crazy spazzed out motherfuckers, I saw people looking weird, hungry, and grimey [sic]. I was always like, ‘I gotta get the fuck out this shit.’ It gave me my edge—[it made me] who I am right now.\"[7] Webster moved to Missouri City, a middle-class suburban area bordering southwest Houston, to live with his parents. His mother worked for Apple and his father ran his own business.[8] Webster's father is also a soul musician and his grandfather was a jazz composer.[9] Webster attended Elkins High School and graduated at seventeen.[10] Webster then attended the University of Texas San Antonio, before dropping out his sophomore year to fully pursue his music career.[11][12][13][14][15][16]\n\nAfter dropping out, Webster immediately moved to New York City in an attempt to start his music career. His parents, frustrated that he had dropped out of school, eventually cut him off financially.[17]\n\nCareer\n\n2008–12: Career beginnings and record deals\n\nWebster formed a duo with his longtime friend Chris Holloway known as The Graduates. In 2008, the duo released their untitled first EP on social networking website Myspace.\n\nThe following year, Scott and OG Chess, one of Scott's schoolmates, formed the group The Classmates. The Classmates released two projects, with Buddy Rich in 2009 and Cruis'n USA in 2010.[18] Scott mainly handled production work on both projects. The duo remained together until late 2012, when personal conflicts and financial disputes led to the disbandment of the group.[19]\n\nAfter leaving college, Scott moved from Houston to Washington Heights in New York City where Scott began working with friend Mike Waxx, who owned the music website Illroots. After moving to New York, Scott slept on the floor at his friend's house and spent most of his time at Just Blaze's studio. Eventually frustrated in New York and the lack of progression,[17] Scott moved to Los Angeles, California, after only four months in the state.\n\nIn Los Angeles, Webster was abandoned by his friend who had promised to help him by providing housing. His parents cut him off financially and he eventually was forced to relocate back to Houston, where his parents kicked him out of their home. Webster moved back to Los Angeles once again and began to sleep on the couch of a friend who studied at University of Southern California.[20] Atlanta-based rapper and owner of Grand Hustle Records, T.I. would later hear one of Webster's productions, titled \"Lights (Love Sick)\". While in Los Angeles, T.I.'s representative contacted Webster, asking him to attend a studio for a meeting. During the meeting, T.I. freestyled over \"Animal\", one of Webster's productions.\n\n2012–14: Owl Pharaoh and Days Before Rodeo\n\nScott performing in 2013.\n\nScott's first solo full-length project is a mixtape titled Owl Pharaoh, which was set to be released as a free download in 2012. However, the project was delayed, and was announced to be slated for a later release. The project was later re-created[21] by Kanye West and Mike Dean, and was then again delayed for sample clearance issues. In promotion Scott would release the track, \"Blocka La Flame\", a remix of fellow GOOD Music label-mate Pusha T's single \"Blocka\" (which features production and vocals from Scott). The song was produced by Young Chop, with additional production by Scott himself, alongside Mike Dean. On March 22, 2013, Scott released the music video for a song titled \"Quintana\", set to appear on Owl Pharaoh. The mixtape's version of the song features guest vocals from fellow American rapper Wale, while the production was handled by Scott himself, alongside Sak Pase and Mike Dean. On March 27, XXL revealed that Scott was a member of their Freshman Class of 2013.[22] On March 29, 2013, following his interview with British disc jockey, DJ Semtex, Scott premiered a snippet of his commercial debut single, titled \"Upper Echelon\", featuring 2 Chainz and T.I. On April 2, 2013, Scott stated Owl Pharaoh was his official debut mixtape and would be released on the iTunes Store on May 21, 2013.[23] On April 23, 2013, \"Upper Echelon\" was sent to urban contemporary radio.[24] The EP was released for free download.\n\nScott performing in 2014.\n\nOn March 13, 2014, Scott performed a new song, tentatively titled \"1975\" featuring Big Sean, from his upcoming project at the time, at the Texan music festival South by Southwest (SXSW).[25] Scott later confirmed via his Twitter account that the song is not called \"1975\", and would be included on his second mixtape, titled Days Before Rodeo.[26] He would later take to his Twitter account to announce Rodeo, as the official title for his major-label debut studio album.[27][28][29] On May 5, 2014, Scott released the full version of the song, with its new title \"Don't Play\", featuring a sample of the song \"M.O.N.E.Y\" by the English rock band the 1975.[30][31] On July 11, 2014, \"Don't Play\" was officially released as the lead single from Days Before Rodeo, via digital distribution.[32]\n\nFollowing the success of Days Before Rodeo, Scott announced that he would headline a concert tour, called The Rodeo Tour, with rapper Young Thug and producer Metro Boomin.[33] The tour started on March 1, 2015, in Santa Ana, California, and ended on April 1, 2015, in Portland, Oregon. The tour ran through major cities such as Denver, Colorado, Houston, Texas, Chicago, Illinois, Detroit, Michigan, New York City, Atlanta, Georgia, Philadelphia, San Diego, Los Angeles, San Francisco, California and Seattle, Washington. Second shows were added to some cities such as Los Angeles and New York City, after his first shows had sold out too quickly towards the eyes of his fans. Artists such as Kanye West, Chris Brown, Wale and Birdman made special guest appearances in certain cities.[34][35]\n\n2015–16: Rodeo and Birds in the Trap Sing McKnight\n\nRodeo was released on September 4, 2015, by Grand Hustle and Epic Records. The album features guest appearances from Quavo, Juicy J, Kanye West, The Weeknd, Swae Lee, Chief Keef, Justin Bieber, Young Thug and Toro y Moi, Big Buck and includes production from Mike Dean, Kanye West, WondaGurl, Suber, DJ Dahi, Metro Boomin, 1500 or Nothin', Sonny Digital, Southside, Terrace Martin, Zaytoven, Pharrell Williams and Scott himself, among others. The album was supported by two singles: \"3500\" featuring Future and 2 Chainz, and \"Antidote\". The latter became his highest-charting single on the US Billboard Hot 100 chart, peaking at number 16. Rodeo received generally positive reviews from critics and debuted at number three on the US Billboard 200 chart. It also debuted at number one on the Billboard Rap Albums chart.[36]\n\nScott performing in August 2015\n\nOn January 4, 2016, Scott would announce that he has a new studio album on the way. On February 8, 2016, it was announced that iLoveMakonnen, Vic Mensa and Scott would be a part of the \"WANGSQUAD\", an Alexander Wang campaign.[37] On March 29, 2016, 300 Entertainment executive Lyor Cohen, revealed that Scott and Young Thug were releasing a single together and called Scott's upcoming album a \"classic\".[38] On April 7, 2016, Scott previewed a single with Young Thug at one of his shows.[39] On May 17, 2016, Scott announced that the title of his second album would be Birds in the Trap Sing McKnight, while also confirming the title for his third album to be Astroworld.[40] On June 3, 2016, the collaborative single between Thug and Scott was released, titled \"Pick Up the Phone\". The single, which also features vocals from Quavo of Atlanta-based rap trio Migos, reached number 43 on the Billboard Hot 100 and was certified double platinum by the Recording Industry Association of America (RIAA).\n\nOn August 31, 2016, Scott announced that Birds in the Trap Sing McKnight was finally finished in a post on Instagram.[41] Scott premiered the album on his third episode of .wav radio on September 2, 2016,[42] and was later released on iTunes and Apple Music. On September 11, 2016, the album became Scott's first number one album on the US Billboard 200.[43] On September 12, 2016, Universal Music Publishing Group's CEO, Jody Gerson announced that the label signed a worldwide deal with Scott.[44]\n\nIn the same episode Scott premiered Birds in the Trap Sing McKnight, he also announced that he would be executive producing on Kanye West's Cruel Winter, a follow up to his G.O.O.D. Music label's debut compilation Cruel Summer.[45] In the episode he described the upcoming album as, \"very youthful, straight to the point, like the illest ever, man, like the illest album.\"\n\n2017–2018: Cactus Jack Records, Huncho Jack, Jack Huncho, and Astroworld\n\nScott performed at All-Star Weekend on February 16, 2017, in New Orleans at Champion Square.[46] He also performed at New Orleans BUKU Music + Art Project festival on March 10, 2017.[47] On March 5, Scott announced a concert tour called \"Birds Eye View\".[48] The next day, the dates and cities for the tour were unveiled, with it beginning on March 10, in New Orleans, Louisiana, and coming to an end on June 2, in Eugene, Oregon.[49] In March 2017, Scott announced he would be launching his own imprint, under the name of Cactus Jack Records.[2] During an interview, Scott said, \"I'm not doing it to have financial control over my music. I want first and foremost to help other artists, launch new names, to provide opportunities. I want to do for them what happened to me, but better. By better I mean no bullshit. No lying to the artists about album release dates or the budgets of videos and albums.\"[2] On June 15, 2017, Scott announced he would be doing a European leg of the \"Birds Eye View Tour\". The European leg started on the June 23 in Paris, and concluded on July 9 in Turku, Finland. This leg was mainly festival sets or in smaller club settings.\n\nOn April 3, 2017, it was reported Scott had been working on a collaborative album with Atlanta-based rapper Quavo of Migos, potentially to be released later in 2017.[50][51] Speaking to GQ, he confirmed: 'The Quavo album is coming soon. I'm dropping new music soon. You know how I do it though: I like surprises.[52] In addition to the collaborative album, Scott announced his third studio album Astroworld, named after the defunct Houston theme park of the same name, is nearing completion and would most likely be released in 2017.[53][54] Scott was also featured on a track from Canadian rapper Drake's project More Life (2017), titled \"Portland\". The song peaked at number nine on the US Billboard Hot 100, becoming his first top ten song as a featured artist.[55]\n\nOn May 16, 2017, Scott released three new tracks on SoundCloud, after teasing on social media for some time. The tracks were named \"A Man\", \"Green & Purple (featuring Playboi Carti)\", and \"Butterfly Effect\". The latter was also released on every other streaming service, as the only track. The music video for \"Butterfly Effect\" was released on July 14, 2017. On August 10, 2017, Scott tweeted \"ALBUM MODE\" as he had just finished the \"DAMN. Tour\" as a supporting act for Kendrick Lamar, the night before. This tweet signified that he was now working on his album AstroWorld full-time. On August 27, 2017, Scott performed with Thirty Seconds to Mars at the 2017 MTV Video Music Awards on their single \"Walk On Water\".\n\nOn September 18, 2017, Quavo and the Migos did an interview. Quavo stated that his album with Scott is coming \"real soon\". He also stated that he and Scott have over 20 records ready.[56] In October 2017, Scott was featured in a special piece titled \"Deserve\", by Chinese born Canadian rapper Kris Wu.[57] On December 7, 2017, a clip of Quavo being interviewed by Zane Lowe was posted on the official Twitter account for Beats 1. When asked about the title of their upcoming project, he confirmed it would be Huncho Jack, Jack Huncho.[58]\n\nScott was featured on Trippie Redd's \"Dark Knight Dummo\" on December 6, 2017. The song peaked at 72 on the Billboard Hot 100.[59] On December 21, 2017, Webster and Quavo released their collaborative album, Huncho Jack, Jack Huncho. The album debuted at number 3 on the Billboard 200 and had seven tracks chart on the Billboard Hot 100.[60] After the release of Huncho Jack, Jack Huncho, Webster was spotted in the studio a lot more frequently and Billboard slated an expected first quarter release for AstroWorld.[61][62]\n\nOn May 4, 2018, four days after his 26th birthday, Scott released a single titled \"Watch\" featuring Lil Uzi Vert and Kanye West.[63] The single was released as promotional material for his third studio album Astroworld.[64] Astroworld was released on August 3, 2018 to critical acclaim,[65] and debuted at number one on the Billboard 200.[66] \"Sicko Mode\", the album's second single, peaked at number one on the Billboard Hot 100, becoming Scott's highest charting solo single.[67] Scott was featured on five tracks of Metro Boomin's Not All Heroes Wear Capes.[68] In December, Billboard reported that Scott was to make a guest appearance at the Super Bowl LIII halftime show during Maroon 5's set.[69] This performance was met with major backlash.[70]\n\n2019–present: Look Mom I Can Fly and JackBoys\n\nOn April 18, 2019, Scott accompanied by The Weeknd and SZA released a track for the popular HBO series Game of Thrones.[71] The track is titled \"Power is Power,\" and is a reference to a scene that took place in the first episode of the show's second season[72] The track is the second song on the Game of Thrones upcoming album entitled For the Throne.[73] In August 2019, Scott's documentary film Look Mom I Can Fly was released on Netflix.[74] Scott released a single, \"Highest in the Room\", which debuted and peaked at number one on the Hot 100,[75] being his first song to debut at the top and his second number one following \"Sicko Mode\" in 2018. The same month, Scott featured on the remix of Young Thug's single, \"Hot\" with Gunna, who was featured on the original song as well. The song was added to the deluxe edition of Thug's debut studio album, So Much Fun.[76] On December 2, Scott announced a compilation album with his Cactus Jack label members, consisting of Don Toliver, Sheck Wes and producer Chase B, titled JackBoys.[77] Scott revealed the album would be released on December 26 via Instagram.[78] The album featured a remix of \"Highest in the Room\" featuring Spanish singer Rosalía and American rapper Lil Baby,[79] the latter's verse being leaked months prior.[80] On December 27, 2019, Scott released the music video for \"Gang Gang\" performed by Wes, with uncredited vocals and cameo appearances from Scott, Toliver, and rapper Luxury Tax 50.[81] On December 30, 2019, Scott released the music video for \"Gatti\", performed with the now-late Pop Smoke.[82] The lyrics of \"Gatti\" references Scott's breakup with his ex-girlfriend Kylie Jenner.[83] On March 20, 2020, Scott released the music video for \"Out West\", performed featuring Young Thug.[84]\n\nArtistry\n\nScott performing in 2017\n\nScott has stated that he is influenced by Bon Iver, Kid Cudi, M.I.A., Kanye West, Toro y Moi, Tame Impala, T.I., and Thom Yorke.[85][86] Spin magazine compared his 2013 mixtape Owl Pharaoh to Kid Cudi's Man on the Moon II: The Legend of Mr. Rager.[87]\n\nScott makes heavy use of audio manipulation effects such as Auto-Tune, phasing, delays, and stereo-sculpted chorusing and harmony structures,[88] predominantly influenced by producers Mike Dean and Alex Tumay.[89] Scott's musical style has been described as a \"blend between traditional hip-hop and lo-fi\"[90] and often characterized as \"ambient\";[88][91] Scott himself has said \"I'm not hip-hop\".[86] Vulture described Scott's sound as \"unremittingly dark, syncretic, hi-res, and above all unnatural.\"[92]\n\nScott has said that he is a fan of Broadway theatre and would like to do an album of show tune covers. He has said that he would like to write his own musical in the future.[93][94][95]\n\nPersonal life\n\nScott began dating reality television star and entrepreneur Kylie Jenner in April 2017.[96] On February 1, 2018, Jenner gave birth to their first child, daughter Stormi Webster.[97][98] The couple broke up in September 2019.\n\nDiscography\n\nStudio albums\n\nCollaborative albums\n\nMixtapes\n\nAwards and nominations\n\nGrammy Awards\n\nThe Grammy Awards are awarded annually by the National Academy of Recording Arts and Sciences. Scott has seven nominations.[113]\n\nConcert tours\n\nHeadlining\n\nSupporting\n\nReferences\n\nMedia related to Travis Scott at Wikimedia Commons", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Travi%24_Scott_2014_2.jpg/170px-Travi%24_Scott_2014_2.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Travis_Scott_-_Openair_Frauenfeld_2019_08.jpg/1200px-Travis_Scott_-_Openair_Frauenfeld_2019_08.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Basel_Castle_2013.jpg/180px-Basel_Castle_2013.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Travis_Scott_-_Openair_Frauenfeld_2019_08.jpg/220px-Travis_Scott_-_Openair_Frauenfeld_2019_08.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Travis_Scott_-_Openair_Frauenfeld_2019_17.jpg/220px-Travis_Scott_-_Openair_Frauenfeld_2019_17.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/12px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Travis_Scott_2015_2.jpg/180px-Travis_Scott_2015_2.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/Travis_Scott_The_DAMN._Tour_%40_TD_Garden_%28Boston%2C_MA%29_%2835709832840%29.jpg/250px-Travis_Scott_The_DAMN._Tour_%40_TD_Garden_%28Boston%2C_MA%29_%2835709832840%29.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Travis_Scott_-_Openair_Frauenfeld_2019_08.jpg/1200px-Travis_Scott_-_Openair_Frauenfeld_2019_08.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Travis_Scott", "title": "Travis Scott", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Travis_Scott_-_Openair_Frauenfeld_2019_08.jpg/1200px-Travis_Scott_-_Openair_Frauenfeld_2019_08.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}