{"url": "https://www.bustle.com/p/the-photos-of-ariana-grande-supporting-pete-davidson-after-wisdom-teeth-surgery-are-so-relatable-it-almost-hurts-9764615", "text": "Celebrities: They're just like you. They need to make appointments for maxillofacial surgeries that require intense aftercare, too. Ariana Grande supported Pete Davidson after wisdom teeth surgery, and the resulting photos are hilarious. It's not currently known how many teeth the comedian had pulled, but it was obviously enough to make him a little more groggy than usual. Grande and Davidson, true to form, documented the entire experience on social media, and honestly? It's the most relatable the couple has seemed yet. Unlike so many aspects of their relationship, this one brings out a resounding #beenthere from fans.\n\nGrande began to nurse Davidson to health after his surgery on Friday, July 13 according to their Instagram posts. They took a few goofy photos of Davidson with filters, but he napped through most of the day. This gave Grande the opportunity to post extensive photos of him sleeping. Not in a creepy way! Just in a, Aww, my poor baby, look at him type of way. True to his nature, Davidson joked his way through it all — though there's no way he wasn't in pain. \"Why did the doctor put this thing around my face like it's the 1920s?\" Davidson asked on Instagram, accompanied by a photo of him asleep with his mouth fully open while Grande looks on, sympathetic.\n\nTake a look at some photos from Ariana Grande nursing Pete Davidson back to health after surgery, and side note: Please enjoy the variety of celebrities that have commented on the saga.\n\nPete Davidson/Instagram; Bustle/Screenshot\n\nIn case you're just skimming the comments, know Judd Apatow, Jonathan Van Ness, Tan France, and Academy Award nominee Taraji P. Henson, have all weighed in on Davidson's healing process. Davidson has worked with Apatow before, and has grown close to the Queer Eye stars in the last few months, but Taraji P. Henson? How did that relationship happen — was it just her amazing job hosting Saturday Night Live? That friendship is incredible, and weirdly charming and the Grande-Davidson household needs to hit the town with Henson immediately. After Davidson is healed, of course. Because, uh, that's gonna take more than an afternoon of napping.\n\nDavidson and Grande is spending a lot of time together these days — they're seemingly inseparable — and it's still cute AF. Depending on how long you believe they've been together, you might think this public tour of affection is either their honeymoon phase or sweet relief at finally being able to go public. In addition to getting through the major surgery — presumably scheduled over the summer so as not to conflict with Davidson's rigorous SNL schedule — the pair just went for new tattoos together again. Grande added the numbers \"8418\" to her foot, which corresponds to the numbers Davidson already has on his arm. (8418 was the badge number of his late father, a firefighter who passed away on September 11th, 2001.) They also have matching cloud tattoos and tattoos for each other, including one on Grande that is reportedly in Davidson's handwriting.\n\nAriana Grande / Instagram Story\n\nAnyone that's had even one wisdom tooth extracted knows it's not a pleasant experience. Having any type of surgery isn't exactly a day at the beach, but there's something about intense oral surgery that just takes a little more out of you. There's painkillers and drooling and the soft-foods-only rule, and that's all before the face swelling that — as unpleasant as it is hilarious — indicates that you're healing properly. The surgery also marks the first time most people will learn of \"dry socket,\" a terrifying and legitimate medical concern brought on by using straws too soon after surgery. Most people would be achy and woozy and unattractive to anyone in the vicinity, but most people are not Pete Davidson, aka the love of Ariana Grande's life.", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/10/ee5b8174-ed13-40e6-b2ba-0f42eb8f2fc4-getty-1189431708.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/5/b0bf5cb6-b5af-4e69-8d33-cf7cd23e6591-getty-1183188965.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/11/0f7a80ac-064e-4a6d-96c1-28b7f37266ba-getty-1191681897.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/7/14/d76cf114-f995-4713-9c8b-e40243c7af62-screenshot_20180714-080530_instagram-1.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/7/14/abc044ae-ef69-4d2b-b45b-afe6d5e937d2-ariana-pete-1-3.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2018/7/14/ac68f0e4-1ec0-4092-9f4f-9323e5377f46-20180714_081622-3.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/7/14/abc044ae-ef69-4d2b-b45b-afe6d5e937d2-ariana-pete-1-3.png?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/7/14/07013d32-e1a6-48b0-9f7d-8194604e6278-something-new-cta-all-articles.png?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2020/4/13/2e02ef07-df0b-4131-b10f-90f9cbb6ea0c-getty-1208849329.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/7/14/abc044ae-ef69-4d2b-b45b-afe6d5e937d2-ariana-pete-1-3.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/the-photos-of-ariana-grande-supporting-pete-davidson-after-wisdom-teeth-surgery-are-so-relatable-it-almost-hurts-9764615", "title": "The Photos Of Ariana Grande Supporting Pete Davidson After Wisdom Teeth Surgery Are So Relatable It Almost Hurts", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/the-photos-of-ariana-grande-supporting-pete-davidson-after-wisdom-teeth-surgery-are-so-relatable-it-almost-hurts-9764615", "type": "article", "title": "You NEED To See How Ariana Grande Sweetly Supported Pete Davidson After Wisdom Teeth Surgery", "description": "Celebrities: They're just like you. They need to make appointments for maxillofacial surgeries that require intense aftercare, too. Ariana Grande supported Pete Davidson after wisdom teeth surgery, and the resulting photos are hilarious. It's not…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/7/14/abc044ae-ef69-4d2b-b45b-afe6d5e937d2-ariana-pete-1-3.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Celebrities: They're just like you. They need to make appointments for maxillofacial surgeries that require intense aftercare, too. Ariana Grande supported Pete Davidson after wisdom teeth surgery, and the resulting photos are hilarious. It's not…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}