{"url": "https://www.bustle.com/p/archie-jugheads-riverdale-road-trip-will-be-a-buddy-comedy-but-not-for-long-say-cole-sprouse-kj-apa-13190965", "text": "Spoilers ahead for Riverdale Season 3, Episode 6: \"Chapter Forty-One: Manhunter.\" Archie Andrews (KJ Apa) is alive and well on Riverdale, and he's officially a free man now that all the murder charges against him were dropped. But despite his expunged record, Archie still abruptly left Riverdale to make sure Hiram Lodge (Mark Consuelos) couldn't continue to ruin his life. Plus, he broke up with Veronica (Camila Mendes), cutting ties just to keep her safe. All in all, not the happy ending fans were expecting from Archie's long-awaited release from prison.\n\nBut at least there's one bright spot to Archie skipping town: Jughead (Cole Sprouse) decided to go with him. That's right, it's time for a buddy road trip. Since Archie and Jughead have been separated for the whole season thus far, Sprouse promises that the upcoming episode delivers exactly what fans have been craving.\n\n\"It's really an Archie-Jughead narrative, which is kind of in rare supply,\" Sprouse tells Bustle along with a group of reporters on set in Vancouver. \"So you get that for a good chunk of episodes. It's really just Archie and Jughead for a little bit and it's a lot of fun and they’re on the lam and they're running away, kind of Stand By Me.\"\n\nThe CW\n\nSprouse then drops even better news. \"By the time [Jughead] goes with Archie, [his obsession with Gryphons and Gargoyles] is pretty much gone.\" Now that's a relief! Both Sprouse and Apa say that filming Archie and Jughead's road trip was some of the most fun that they've had on this show so far, and that's going to translate onscreen as well. But the fun times don't last forever, unfortunately.\n\n\"Eventually, they end up finding themselves [at] the fork in the road,\" Apa reveals. \"They have to go their separate ways at some point. You'll see why they have to go their separate ways.\"\n\nThe CW\n\nWhen pressed for more details about what causes the two friends to split, Sprouse wouldn't budge. But Apa adds that Archie's journey solo is pretty meandering. \"He's trying to be undercover and not be seen by people, and I think that's frustrating for Archie,\" Apa says. \"He is angry at the world for him being in this position. He is kind of just chilling.\"\n\nBut that doesn't mean things will be uneventful. \"A lot of weird sh*t happens to you 'cause you've got no one else to talk to,\" Apa warns. \"It is fun but at the same time, I do miss doing scenes with the guys,\" he adds. \"But, you know, it doesn't last. He can't be isolated forever.\"\n\nBefore his time on the road ends, fans will see Archie struggling with what he experienced behind bars and how it's changed his life. \"[He's] trying to come to terms with not being able to be in Riverdale, the one place that he feels like he belongs,\" Apa says. \"Which is interesting because when he leaves, the town isn't really the same without Archie. The town needs Archie ... [and] there may be a little bit of post-traumatic stress [for him] after coming out of prison.\"\n\nWhen Archie finally does reunite with his friends back in Riverdale, he'll be a changed man. Apa reveals that Archie will go back to high school eventually, but \"it's not going to be easy and we do explore that.\"\n\nThe CW\n\n\"He comes back and the high school problems seem ridiculous when compared to what he went through in prison,\" Apa says. \"Because of that, and because of not being able to settle that well, we see him turn to other options, which are not good. It creates a huge divide [between him and his friends] for a while. He is kind of just spiraling into a dark kind of place, but is saved by a person and by music.\"\n\nAs for Archie breaking up with Veronica, don't worry: This isn't the true end of Varchie.\n\n\"Archie being in Riverdale puts [Veronica] in danger because of Hiram and stuff like that... but that being the reason for them having to part ways means that there is still something there,\" Apa says. \"You know what I mean? They didn't part ways because of someone doing something.\"\n\nApa promises that neither of the two of them are giving up on their relationship so easily. \"At the moment, it's just the best thing for them.\" Although if you ask Twitter, that remains to be seen.", "images": ["https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2018/11/24/51a7a064-20b9-4f68-bc21-a96cc0d5f054-rvd302a_0302b.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2018/11/24/51a7a064-20b9-4f68-bc21-a96cc0d5f054-rvd302a_0302b.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/8/46bff3b9-f7d0-42e8-a4ca-271dd8ec5b37-screen-shot-2020-04-08-at-41442-pm.png?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/14/74bf26f7-328c-46f7-87e6-e27523f13d7d-getty-167930183.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/14/2cea261f-221d-4c14-8796-78e3b1d00383-155251_9180.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/11/24/974fc66f-3ee7-4e5d-b49d-2b390565db38-rvd301a_0317b.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/15/0b325359-1a6c-454b-8418-13e86ed9cbd1-4aad7429-d341-48a8-b630-5ccb68968373-mando_106-5_18194c1a.jpeg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/11/24/f1e29ea4-5730-41dc-ab6b-209b9b3c233e-rvd302b_0146b.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/11/24/1cfb71af-46a5-4c9f-8890-2fc235b1bcc5-rvd301a_0268b.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70"], "top_img": "https://imgix.bustle.com/uploads/image/2018/11/24/51a7a064-20b9-4f68-bc21-a96cc0d5f054-rvd302a_0302b.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/archie-jugheads-riverdale-road-trip-will-be-a-buddy-comedy-but-not-for-long-say-cole-sprouse-kj-apa-13190965", "title": "Archie & Jughead's 'Riverdale' Road Trip Will Be A Buddy Comedy — But Not For Long, Say Cole Sprouse & KJ Apa", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/archie-jugheads-riverdale-road-trip-will-be-a-buddy-comedy-but-not-for-long-say-cole-sprouse-kj-apa-13190965", "type": "article", "title": "Cole Sprouse & KJ Apa On What's Ahead On Archie & Jughead's Epic 'Riverdale' Road Trip", "description": "Spoilers ahead for Riverdale Season 3, Episode 6: \"Chapter Forty-One: Manhunter.\" Archie Andrews (KJ Apa) is alive and well on Riverdale, and he's officially a free man now that all the murder charges against him were dropped. But despite his…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/11/24/51a7a064-20b9-4f68-bc21-a96cc0d5f054-rvd302a_0302b.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Spoilers ahead for Riverdale Season 3, Episode 6: \"Chapter Forty-One: Manhunter.\" Archie Andrews (KJ Apa) is alive and well on Riverdale, and he's officially a free man now that all the murder charges against him were dropped. But despite his…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}