{"url": "www.inquisitr.com/4414388/did-blac-chyna-give-custody-of-daughter-dream-to-rob-kardashian-report-claims-chyna-wants-to-twerk-instead/", "text": "Did Blac Chyna give up custody of her daughter, Dream Kardashian, because she prefers twerking in the club over parenting? That’s the claim coming from an article in Media Take Out (MTO) about the former stripper and her custody battle with reality TV star, Rob Kardashian.\n\nBut Gossip Cop, a site that’s become known for debunking celebrity rumors is on the case, and they say that the article has no basis in truth.\n\nMedia Take Out has a history of reporting fake news stories about Chyna and Rob, according to Gossip Cop. They’ve previously reported that Rob wasn’t Dream’s father and that Chyna was pregnant with his second child. Both of those stories have been debunked. With MTO’s less than stellar record, it’s easy to question the truthfulness of their story about which parent currently has legal custody of Dream Kardashian.\n\nGossip Cop says that they looked into the story and found that it was untrue. Sources close to both Chyna and Rob confirm that Dream Kardashian does spend more time with Rob, but that isn’t because her mother has given up legal custody.\n\nThe reason that Dream is with Rob more could be that Chyna is the parent who works and makes more money than Rob. TMZ reports that court documents filed in their custody negotiations reveal that Chyna is the breadwinner in this situation. Her money comes from hosting gigs and club appearances. Rob has little other income other than what’s derived from his family’s reality TV show. According to TMZ, those checks are chump change compared to what Chyna rakes in on a regular basis.\n\n???? A post shared by Blac Chyna (@blacchyna) on Aug 4, 2017 at 2:29pm PDT\n\nChyna is set to make even more bread if reports that she could be getting a record deal turn out to be true. HipHopDX reports that the former King Of Diamonds stripper wants to follow in the footsteps of Cardi B to become a dancer turned rapper. She’s reportedly met with executives at Capitol Records among other labels.\n\nDo you think that Blac Chyna will get a record deal? Should Rob Kardashian be concerned about a possible diss track about him and the revenge porn, he released during his social media rant against Chyna. Let us know what you think in the comments below.\n\nRELATED POSTS ON THE INQUISITR\n\nWhy Kim Kardashian And Rob Should Be Worried About Blac Chyna’s New Venture [Opinion]\n\nRob Kardashian Reportedly Slams Blac Chyna’s Record Deal\n\nRob Kardashian’s Baby Mama, Blac Chyna, Makes More Money Than Him? Ex-Couple Settles Custody Battle Over Dream\n\nCould Rob Kardashian Request Child Support From Blac Chyna For Baby Dream Kardashian?\n\n[Featured Image by Alberto E. Rodriguez/Getty Images]", "images": ["https://secure.gravatar.com/avatar/dee9f0b262b2cc498f0c56b5221d31a3?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2017/08/Blac-Chyna-2.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Patricia Grannum"], "canonical_link": "https://www.inquisitr.com/4414388/did-blac-chyna-give-custody-of-daughter-dream-to-rob-kardashian-report-claims-chyna-wants-to-twerk-instead/", "title": "Did Blac Chyna Give Custody Of Daughter Dream To Rob Kardashian? Report Claims Chyna Wants to Twerk Instead", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}