{"url": "https://www.digitalspy.com/tv/ustv/a828677/once-upon-a-time-season-7-release-date-cast-spoilers/", "text": "ABC's popular Once Upon a Time is coming back – but not as you know it.\n\nThe fantastical fairy tale series is hitting the reset button for season seven, resulting in a significantly different cast, among other things. Here is everything you need to know about the impending reboot.\n\nOnce Upon a Time season 7 release date: When is it on?\n\nOnce Upon a Time was renewed for a seventh season on May 11, 2017, with ABC ordering 22 episodes.\n\nAt Comic-Con 2017, ABC confirmed that the show will return on Friday, October 6 as part of the network's 2017-18 autumn schedule – yes, Friday nights as opposed to Sunday nights in previous seasons.\n\nABC\n\nFriday is traditionally a tough night for TV ratings, but ABC is confident the show can perform.\n\n\"We've turned Friday into more of a destination for our fantasy and science fiction fans,\" ABC entertainment president Channing Dungey explained.\n\nOn June 20, co-creator, showrunner, and writer Adam Horowitz posted a snap of the writers' room whiteboard on Instagram – indicating that work on the seventh season had begun:\n\nAnd on July 6, Horowitz confirmed the start of filming:\n\nHowever, could it be the final ever season? Jamie Chung (who plays recurring character Mulan) claimed that she heard one of the show bosses talking about season seven as if it's the last.\n\nBut she did add that the drama is probably \"just going to keep on going\". So don't worry just yet.\n\nOnce Upon a Time season 7 cast: Who will be back?\n\nSeason six had nine series regulars, but only three will be back in a regular capacity in the new season. They are:\n\n• Lana Parrilla (The Evil Queen / Regina Mills)\n\n• Robert Carlyle (Rumplestiltskin / Mr Gold)\n\n• Colin O'Donoghue (Captain Hook / Killian Jones)\n\nABC\n\nThat means the following actors are no longer series regulars :\n\n• Jennifer Morrison (Emma Swan)\n\n• Ginnifer Goodwin (Snow White / Mary Margaret Blanchard)\n\n• Josh Dallas (Prince Charming / David Nolan)\n\n• Emilie de Ravin (Belle / Belle Gold)\n\n• Jared S Gilmore (Henry Mills)\n\n• Rebecca Mader (Wicked Witch of the West / Zelena)\n\nThat's right: Hook but no Emma Swan for season seven. Jennifer Morrison, who plays Emma, was offered an extension to her contract as well, but she turned it down citing personal reasons.\n\n\"As much as I love the show, I ultimately had to do what was right for me, and I need to be home,\" she said. \"I need to be in New York, in LA [the show is filmed in Vancouver], I need to be around my family and friends and have a chance at a personal life, and to have opportunities to do new things creatively.\"\n\nFans will definitely see Emma at least one more time, though. She has agreed to appear in one episode early this new season (7.02, to be precise), and filmed her scenes in mid-July.\n\nRebecca Mader (Zelena) was the second star to confirm her exit, explaining that she was dropped for creative reasons as part of the reboot.\n\nThen, showrunners Edward Kitsis and Adam Horowitz confirmed that Ginnifer Goodwin, Josh Dallas, Emilie de Ravin and Jared S Gilmore will all also not be back as regulars – announcing this just two days before the season six finale aired.\n\nDe Ravin responded to the announcement on social media, saying that she \"would have loved to continue exploring Belle's journey\" but that it has also \"been an honour and privilege to bring Belle to life\".\n\nABC\n\nAfter the finale aired, Goodwin described Snow and Charming's happy ending as a \"bittersweet decision\" and said that she would be keen to return as Snow in the future.\n\nThe showrunners have said that the departures of these beloved characters will be referenced in the new season.\n\nThey later confirmed that Gilmore will make an appearance in the season seven premiere to bridge the time gap between the season six finale and the events of season seven.\n\nDe Ravin will feature in episode four, to provide an \"update\" on her character Belle, while Mader too will pop up in \"multiple\" episodes. Wicked always wins...\n\nABC\n\nOf course, in light of the mass departure, there will be some brand new additions people can look forward to seeing, as the show relocates from Storybrooke to Hyperion Heights.\n\nHere are the stars joining the show for season seven as new series regulars:\n\n• Andrew J West (Adult Henry Mills)\n\n• Alison Fernandez (Lucy)\n\n• Gabrielle Anwar (Lady Tremaine / Victoria Belfrey)\n\n• Dania Ramirez (Cinderella / Jacinda)\n\n• Mekia Cox (Tiana / Sabine)\n\nAnd notable recurring characters include:\n\n• Adelaide Kane (Drizella / Ivy)\n\n• Rose Reynolds (Alice / Tilly)\n\nJared S Gilmore may be young Henry, but scenes in the season six finale revealed a time jump as an adult Henry was seen living in a Seattle apartment – numbered 815, obviously. Adult Henry is portrayed by Andrew J West, who fans of The Walking Dead may remember as cannibal Gareth.\n\nThe scenes also introduced adult Henry's daughter Lucy, played by Alison Fernandez (Jane the Virgin, Orange Is the New Black).\n\nABC\n\nGabrielle Anwar (Burn Notice) and Dania Ramirez (Heroes, Devious Maids) were announced to be joining the cast in early July. Ramirez will be playing Cinderella – a role previously inhabited by Jessy Schram – who is also Lucy's mother, while Anwar has been cast as Lady Tremaine, Cinderella's wicked stepmother.\n\nLady Tremaine (aka Victoria Belfrey in Hyperion Heights) has been described as being even more ruthless than the Evil Queen, and is the one who is behind the new curse.\n\n\"Why it's important for her to be royal, why it's important for her to crush everyone else, is the story of the year. In true Once Upon a Time fashion, evil isn't born – it's made, and we'll see that with her as well,\" explained showrunner Edward Kitsis.\n\nABC/Eike Schroter\n\nRelated: Here's how Once Upon a Time season 7 might introduce new versions of classic characters\n\nIt's unclear how the different Cinderellas will play out exactly, but showrunner Edward Kitsis teased: \"New books could have different versions of some stories and ways of looking at them that maybe we've seen before, maybe some new characters as well.\"\n\nAlso in July, Rose Reynolds (Poldark), Adelaide Kane (Reign), and Mekia Cox (Chicago Med) boarded as recurring characters. In August, Cox was upped to series regular.\n\nReynolds will be picking up the role of Alice from Alice in Wonderland, while Kane and Cox have been confirmed to be playing Drizella (one of Cinderella's evil stepsisters) and Tiana (from The Princess and the Frog) respectively.\n\nABC\n\nThe cursed counterpart of Ramirez's Cinderella is called Jacinda, while Tiana goes by Sabine. Drizella and Alice go by the names Ivy and Tilly in Hyperion Heights.\n\nKane gave a little tease about Drizella / Ivy, describing her character as \"buttoned-up and bitchy\".\n\n\"She seems like a very high-strung, slightly ditzy young woman, and she's just very petty and she's like that awful bully in high school, except that she doesn't know how to win people to her side,\" she shared. \"So she's just alone, snappy, snarky, sarcastic, and miserable all the time.\"\n\nOn the other hand, Alice is somebody who appears to be working for Rumplestiltskin / Weaver – both in the Enchanted Forest and in Hyperion Heights.\n\nABC\n\nElsewhere, Once Upon a Time is bringing back Giles Matthey as Gideon for one episode, Robin Givens has been cast as Tiana's mother Eudora, described as a \"benevolent noblewoman\", and Meegan Warner will play a new and different version of Rapunzel.\n\nOne character who is not expected to be returning is Sean Maguire's Robin Hood.\n\n\"Never say never, but not in the immediate run of episodes,\" said showrunner Adam Horowitz.\n\nOnce Upon a Time season 7 trailer: 'A New Curse Awakens'\n\nThe Once Upon a Time panel at Comic-Con 2017 dropped a quick tease about what to expect from the rebooted series, premiering two scenes from the upcoming season as well as a new trailer.\n\nThe trailer quickly recapped the series so far before replaying the end of season six, which saw the adult Henry visited by his daughter as Henry visited Emma Swan in the pilot.\n\nAdditionally, the two scenes that aired at the panel featured Jared S Gilmore's young version of Henry as he goes to explore new fairy tales, while a second showed adult Henry is crashing into Cinderella's horse-drawn carriage.\n\nTeasing what's next for the show, showrunner Edward Kitsis said: \"What we're going to do now is go on a new adventure.\"\n\nOnce Upon a Time season 7 spoilers: Plot details revealed\n\nThe sixth season finale offered a tease as to what to expect for season seven, as it appears that adult Henry has lost his belief in fairy tales – a clear (and intentional) parallel to the start of Emma's journey in the pilot episode all those years ago.\n\n\"Come on. Your family needs you,\" Lucy tells a very puzzled and sceptical Henry.\n\nABC/Jack Rowand\n\nPrevious fan theories speculated that Lucy's mother could be Disney's Moana or Narnia's Lucy Pevensie, but she is actually none other than Cinderella (Dania Ramirez). Co-creators Edward Kitsis and Adam Horowitz have promised that it will be a proper love story and plays a huge part in the story for season seven.\n\n\"Henry has left home and he wants to go and see other Storybrookes with different stories and different characters, and he obviously falls in love with Cinderella,\" showrunner Edward Kitsis shared.\n\n\"Much like the romance his grandparents [Snow and Charming] had, what happens is what always happens, is he gets into trouble. And he calls up help from his family [Evil Queen, Hook, Rumplestiltskin].\"\n\nABC\n\nDespite Henry having aged several years, Kitsis and Horowitz all but confirmed that returning characters Regina, Mr Gold, and Hook will remain the same age as before.\n\n\"The age and how Henry is as old as he is without everyone else is dealt with right away as we set up the new paradigm,\" they said. \"I think it was purposefully oblique [in the season six finale] but we have a plan in place and we're also allowing Rumple, Hook and the Evil Queen to be in it.\"\n\nRegina, Mr Gold and Hook have had their happy endings, but what drags them back into the action? ABC released a statement as to what season seven will look like, promising that they will \"join forces\" with Henry and Lucy on another \"epic quest\".\n\nGetty Images/Digitalspy.com ABC\n\n\"Fairy tale characters new and old search for true love, find adventure, and once again take sides in the struggle of good against evil, as classic tales are once more twisted and reimagined,\" the description added.\n\nAnd ABC exec Channing Dungey teased that Regina, Mr Gold and Hook will \"return but with new identities in a new city, facing a new curse\".\n\nIndeed. That new city is Seattle, and we know bits and pieces about the trio's new personas.\n\nThe cursed Regina is called Roni in Seattle, and she runs a bar.\n\nABC\n\n\"I'm in denim and rock T-shirts,\" Parrilla said in an interview. \"When we meet her, this other version of Regina, she's working in a bar. She's a bar owner. She's a little rough around the edges… This version feels really different. She's no longer in charge.\n\n\"I'm having a blast playing her. We're all still discovering who she is. It's refreshing, it's different.\"\n\nRoni will be getting a love interest, but it won't be the most integral part of her arc this year.\n\nWe know much less about who Rumplestiltskin is, but Horowitz had this to say: \"He's involved in many of the goings on in this neighbourhood in Seattle. We don't want to say too much of the specifics of it, but it's a lot of fun, and it's another layer and colour for [Carlyle] to play.\"\n\nABC\n\nAs for Hook, he's a cop named Rogers.\n\nO'Donoghue said: \"I describe that there's a sense of loss there in the guy and he just doesn't know what it is that's missing. He's striving in some way to find who he is still, yet the Hook that we meet is trying to be the best uniform cop that he can be and do the right thing.\"\n\nBut wait, how are the writers going to explain why Emma is not alongside Hook? Some fans are fearing that Emma will be killed off (especially since Jennifer Morrison will be back for one episode – the second episode). Is there any truth to that? Kitsis and Horowitz are remaining coy.\n\n\"There's nothing to say,\" Kitsis said. \"That is correct, she is coming back for an episode. Their happiness is real, and people should enjoy that.\"\n\nABC\n\nWhatever happens, Hook will not be having a new love interest anytime soon.\n\n\"I think that Emma is absolutely Hook's soulmate that we saw – so the Hook we all know and love, how could he look elsewhere?\" Kitsis added at Disney's D23 expo in July, while Horowitz interestingly teased: \"We can't say whether or not they have a child, but we can tell you we answer that question in the beginning of the season.\"\n\nBut the showrunners have assured fans that the show will have a very familiar feel to it, even with the cast shake-up and a move away from Storybrooke.\n\nABC/Jack Rowand\n\n\"We're trying to tell the same kind of stories and honor the DNA of what Once Upon a Time was from the very start,\" Horowitz explained. \"While there are some characters returning and some not returning, it's still the same universe, and it's still the same kind of storytelling.\n\n\"It's just that we're going to be coming at it from a little bit of a different angle. It's not going to be necessarily Storybrooke-based.\"\n\nHorowitz later said that flashbacks will remain a significant part of the show. \"That's one of the great advantages of having characters who can be hundreds of years old, we can span different eras and do many different things,\" he said.\n\nABC\n\nMeanwhile, there will be a \"prominent\" LGBTQ storyline this season, which sounds awesome.\n\n\"It's going to look like any other relationship we've had on the show,\" Horowitz told BuzzFeed. \"It's not going to be any different other than the fact that it's LGBT. It's important to us that it [Hyperion Heights] does reflect the world that exists. It feels normal.\"\n\nLana Parrilla has said that she'd be interested in seeing Star Wars invade the Once universe, adding that she would love to face off against Darth Vader, one of cinema's most iconic villains.\n\n\"It would just be fun, I think, to just battle him,\" she said. \"I've seen crazy fan art with the Evil Queen versus Darth Vader and they're both holding lightsabers. I would just love that.\"\n\nBut don't expect the Evil Queen's infertility to be revisited. Parrilla shut down that fan theory at Comic-Con.\n\nABC/DigitalSpy Disney\n\nLastly, there's a fan campaign – retweeted by de Ravin – to dedicate the season seven premiere to Georgina Callander, one of the victims in the devastating Manchester Arena terror attack on May 22, 2017.\n\nGeorgina, 18, was a Once Upon a Time superfan and met stars including Parrilla, de Ravin, and Mader one month before she tragically lost her life.\n\nOnce Upon a Time season 7 episodes\n\nSeason 7 episode 1: What happened in 'Hyperion Heights'?\n\nJared S Gilmore briefly reprises his role as young Henry – hopping on August's motorcycle and insisting to Regina that he will be fine, as he sets off to explore new realms.\n\nA few years pass, with Andrew J West playing the adult version of Henry. In the Magical Forest, a near-collision on the road causes Henry and a previously-unseen version of Cinderella (Dania Ramirez) to meet.\n\nCinderella takes Henry's bike and dagger in a quest to kill the prince for revenge. Henry tries to convince her to come with him to his realm. Cinderella backs out of killing the prince, but her evil stepmother Lady Tremaine does it anyway and frames Cinderella for the crime.\n\nHenry decides to stay in the Magical Forest realm after finding one of Cinderella's glass slippers just before he is set to leave.\n\nABC\n\nIn the present day, Henry lives in a Seattle neighbourhood named 'Hyperion Heights' while affected by a new curse.\n\nRegina (Roni), Hook (Rogers), and Rumplestiltskin (Weaver) are all victims of the curse as well, having had their memories wiped, as Henry's daughter Lucy (and also the daughter of Jacinda – Cinderella's alter ego in Hyperion Heights) pays a visit in an attempt to break the spell.\n\nMeanwhile, Victoria Belfrey (aka Cinderella's wicked stepmother Lady Tremaine) is looking to gentrify the neighbourhood and attempts to pressure Roni into selling her bar. Roni resists.\n\nSeason 7 episode 2: What happened in 'A Pirate's Life'?\n\nFlashbacks see Jennifer Morrison reprise her role as Emma Swan, and the episode reveals why Hook is in Hyperion Heights but not Emma. It turns out that the Hook in Hyperion Heights is actually the Hook from the Wish Realm.\n\nWhen Henry uses a magic bottle to ask Emma, Hook, and Regina for help, Wish Hook also answers Henry's call and initially takes original Hook's place.\n\nBut after Emma arrives and reveals that she is pregnant, Wish Hook comes clean and reveals the truth about his daughter: she has been trapped in a tower by a witch.\n\nHenry decides to continue on his journey – accompanied by Wish Hook and Regina – while Emma and original Hook return to Storybrooke.\n\nABC\n\nIn Hyperion Heights, Victoria hires Rogers and Weaver to force Henry out of Hyperion Heights – but Rogers helps Henry instead. Rogers, Henry, and Roni agree to form an alliance to put an end to Victoria's scheming.\n\nSeason 7 episode 3: What happened in 'The Garden of Forking Paths'?\n\nIn flashbacks, Cinderella, Henry, Regina, and Hook team up with Princess Tiana (the leader of a resistance group) in the fight against Lady Tremaine.\n\nCinderella secretly confronts Lady Tremaine. Tremaine reveals that she has preserved the body ofher own daughter Anastasia, and that she hopes to revive Anastasia with the heart of the truest believer. That heart is, of course, Henry's. Tremaine says that she will spare Cinderella (and the resistance) if Cinderella deliver's Henry's heart.\n\nRegina stops Cinderella from acting on this before it's too late.\n\nIn Hyperion Heights, Victoria has plans to replace the community garden with a new building, and Jacinda attempts to stop this by getting people to sign a petition.\n\nLucy believes Victoria is looking for something at the garden, and her suspicions seem to be well-founded when she finds a piece of Cinderella's glass slipper in the tunnels, which she gives to Henry as proof that Jacinda is Cinderella.\n\nVictoria/Tremaine – who it turns out isn't cursed – eventually finds Anastasia's preserved body. It is also revealed that she is holding a witch captive and demands her to use a spell to take Lucy's belief away in order to resurrect Anastasia. The witch says no, saying there would be consequences.\n\nSeason 7 episode 4: What happened in 'Beauty'?\n\nIn flashbacks, Rumplestiltskin and Belle spend a number of years looking for a way to lift the Dark One curse from Rumplestiltskin, so he can become mortal and they can live the rest of their lives together.\n\nBelle finds a prophecy, leading them to build a home at a place called the Edge of Realms. Rumplestiltskin and Belle live together here, but Belle – ageing and dying – reveals that she figured out a while ago that the prophecy actually means that her death will lead Rumplestiltskin to begin his journey to rid himself of the Darkness.\n\nABC\n\nAfter Belle's death, Rumplestiltskin sets off to find the person who he can pass the Darkness onto – a mysterious Guardian.\n\nIn Hyperion Heights, Tilly (Alice in Wonderland) briefly wakes up from the curse and tries to convince Weaver that he is Rumplestiltskin, even shooting him to prove that he is immortal. Weaver remembers, and believe that Tilly will play an important part in reuniting him with Belle.\n\nSeason 7 episode 5: What happened in 'Greenbacks'?\n\nIn the past, Tiana helps a man named Robert to reunite with his lover: a frog. The true love's curse is broken as Robert kisses the frog. In a slight twist, Robert is actually a frog, and transforms back into one to be with his true love.\n\nIn Hyperion Heights, Rogers gets a lead on his missing daughter, whose name is Eloise Gardener. He interrogates a man with a tattoo that is linked to Eloise, but is forced to release him. This man is later on the phone, informing a mystery person that somebody is looking for the girl.\n\nAlso, Ivy turns out not to be cursed. She is plotting with the witch in the tower against her mother Victoria.\n\nWant up-to-the-minute entertainment news and features? Just hit 'Like' on our Digital Spy Facebook page and 'Follow' on our @digitalspy Twitter account and you're all set.", "images": ["https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/19/1494422122-once-upon-a-time.jpg?crop=1xw:0.780837636259323xh;center,top&resize=300:*", "https://www.digitalspy.com/sites/digitalspy/assets/images/logos/ipso_regulated_hires.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/04/1485434468-rumpelstiltskin-once-upon-a-time.png?crop=1xw:0.8888888888888888xh;center,top&resize=1200:*"], "top_img": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/04/1485434468-rumpelstiltskin-once-upon-a-time.png?crop=1xw:0.8888888888888888xh;center,top&resize=1200:*", "keywords": [], "authors": ["Ben Lee"], "canonical_link": "https://www.digitalspy.com/tv/ustv/a828677/once-upon-a-time-season-7-release-date-cast-spoilers/", "title": "Once Upon a Time season 7 release date, cast, spoilers, and everything you need to know", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#e94114", "og": {"type": "article", "site_name": "Digital Spy", "title": "Once Upon a Time season 7: Everything you need to know", "description": "Magic always comes with a price.", "url": "http://www.digitalspy.com/tv/ustv/a828677/once-upon-a-time-season-7-release-date-cast-spoilers/", "image": {"identifier": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/04/1485434468-rumpelstiltskin-once-upon-a-time.png?crop=1xw:0.8888888888888888xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 131928163488848}, "article": {"publisher": "https://www.facebook.com/digitalspyuk/", "modified_time": "2018-12-01 02:34:19", "published_time": "2017-11-07 06:28:00", "section": "US TV", "opinion": "false"}, "twitter": {"site": "@digitalspy", "card": "summary_large_image", "image": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/04/1485434468-rumpelstiltskin-once-upon-a-time.png?crop=1xw:0.8888888888888888xh;center,top&resize=640:*"}, "google-site-verification": "yOsKGKJADzRcnlk-FrptJIoYYaNs5pgoJx2J0ie4bWE", "title": "Once Upon a Time season 7 release date, cast, spoilers and everything you need to know", "description": "Once Upon a Time season 7 release date, cast, spoilers and everything else you need to know about ABC and Netflix's magical fantasy drama.", "keywords": "Once Upon a Time season 7, Once Upon a Time season 7 release date, Once Upon a Time season 7 cast, Once Upon a Time season 7 spoilers, Once Upon a Time season 7 Netflix, Once Upon a Time season 7 episodes, Once Upon a Time season 7 start date, Once Upon a Time season 7 episode 1", "thumbnail": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/04/1485434468-rumpelstiltskin-once-upon-a-time.png?crop=0.5625xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "TV,tv,ustv,Andrew J West,Alison Fernandez,lana parrilla,Emilie de Ravin,Colin O'Donoghue,Jennifer Morrison,Robert Carlyle", "sailthru.date": "2017-11-07T18:28:00Z", "sailthru.image.full": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/04/1485434468-rumpelstiltskin-once-upon-a-time.png?crop=1xw:0.8888888888888888xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/04/1485434468-rumpelstiltskin-once-upon-a-time.png?crop=0.5625xw:1xh;center,top", "sailthru.socialtitle": "Once Upon a Time season 7: Everything you need to know", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1510007280.0, "source": "https://www.digitalspy.com", "summary": ""}