{"url": "http://www.whitehouse.gov/the-press-office/2011/05/10/remarks-president-comprehensive-immigration-reform-el-paso-texas", "text": "1:21 P.M. MDT\n\n\n\nTHE PRESIDENT: Hello, El Paso! (Applause.) Well, it is wonderful -- wonderful to be back with all of you in the Lone Star State. (Applause.) Everything is bigger in Texas. (Applause.)\n\n\n\nAUDIENCE MEMBER: We love you!\n\n\n\nTHE PRESIDENT: I love you back! (Applause.) Even the welcomes are bigger. (Applause.) So, in appreciation, I wanted to give a big policy speech outside on a really hot day. (Laughter.) Those of you who are still wearing your jackets, feel free to take them off. I hope everybody is wearing sunscreen.\n\n\n\nAUDIENCE MEMBER: We live here.\n\n\n\nTHE PRESIDENT: You say you live here? You don’t need it, huh? (Laughter.) Well, it is a great honor to be here. And I want to express my appreciation to all of you for taking the time to come out today.\n\n\n\nAUDIENCE MEMBER: We love you!\n\n\n\nTHE PRESIDENT: Thank you. I appreciate it. Thank you. (Applause.)\n\n\n\nYou know, about a week ago, I delivered a commencement address at Miami Dade Community College, which is one of the most diverse schools in the nation. The graduates were proud that their class could claim heritage from 181 countries around the world -- 181 countries. (Applause.)\n\n\n\nMany of the students were immigrants themselves, coming to America with little more than the dream of their parents and the clothes on their back. A handful had discovered only in adolescence or adulthood that they were undocumented. But they worked hard and they gave it their all, and so they earned those diplomas.\n\n\n\nAnd at the ceremony, 181 flags -- one for every nation that was represented -- was marched across the stage. And each one was applauded by the graduates and the relatives with ties to those countries. So when the Haitian flag went by, all the Haitian kids -- Haitian American kids shouted out. And when the Guatemalan flag went by, all the kids of Guatemalan heritage shouted out. And when the Ukrainian flag went by, I think one kid shouted out. (Laughter.) This was down in Miami. (Laughter.) If it had been in Chicago, there would have been more.\n\n\n\nBut then, the last flag, the American flag, came into view. And everyone in the room erupted in applause. Everybody cheered. (Applause.) So, yes, their parents and grandparents -- some of the graduates themselves -- had come from every corner of the globe. But it was here that they had found opportunity. It was here that they had a chance to contribute to the nation that is their home.\n\n\n\nAnd it was a reminder of a simple idea, as old as America itself: E pluribus unum. Out of many, one. We define ourselves as a nation of immigrants -- a nation that welcomes those willing to embrace America’s ideals and America’s precepts. That’s why millions of people, ancestors to most of us, braved hardship and great risk to come here -- so they could be free to work and worship and start a business and live their lives in peace and prosperity. The Asian immigrants who made their way to California’s Angel Island. The German and Scandinavians who settled across the Midwest. The waves of Irish, and Italian, and Polish, and Russian, and Jewish immigrants who leaned against the railing to catch their first glimpse of the Statue of Liberty.\n\n\n\nThis flow of immigrants has helped make this country stronger and more prosperous. (Applause.) We can point to the genius of Einstein, the designs of I. M. Pei, the stories of Isaac Asimov, the entire industries that were forged by Andrew Carnegie.\n\n\n\nAnd then when I think about immigration I think about the naturalization ceremonies that we’ve held at the White House for members of our military. Nothing could be more inspiring. Even though they were not yet citizens when they joined our military, these men and women signed up to serve.\n\n\n\nWe did one event at the White House and a young man named Granger Michael from Papua New Guinea, a Marine who had been deployed to Iraq three times, was there. And you know what he said about becoming an American citizen? He said, “I might as well. I love this country already.” That’s all he said. Marines aren’t big on speeches. (Laughter.)\n\n\n\nAnother was a woman named Perla Ramos who was born and raised in Mexico and came to the United States shortly after 9/11, and joined the Navy. And she said, “I take pride in our flag and the history we write day by day.”\n\n\n\nThat’s the promise of this country -- that anyone can write the next chapter in our story. It doesn’t matter where you come from -- (applause) -- it doesn’t matter where you come from; it doesn’t matter what you look like; it doesn’t matter what faith you worship. What matters is that you believe in the ideals on which we were founded; that you believe that all of us are created equal, endowed by our Creator with certain inalienable rights. (Applause.) All of us deserve our freedoms and our pursuit of happiness. In embracing America, you can become American. That is what makes this country great. That enriches all of us.\n\n\n\nAnd yet, at the same time, we’re here at the border today -- (applause) -- we’re here at the border because we also recognize that being a nation of laws goes hand in hand with being a nation of immigrants. This, too, is our heritage. This, too, is important. And the truth is, we’ve often wrestled with the politics of who is and who isn’t allowed to come into this country. This debate is not new.\n\n\n\nAt times, there has been fear and resentment directed towards newcomers, especially in hard economic times. And because these issues touch deeply on what we believe, touch deeply on our convictions -- about who we are as a people, about what it means to be an American -- these debates often elicit strong emotions.\n\n\n\nThat’s one reason it’s been so difficult to reform our broken immigration system. When an issue is this complex, when it raises such strong feelings, it’s easier for politicians to defer until the problem the next election. And there’s always a next election.\n\n\n\nSo we’ve seen a lot of blame and a lot of politics and a lot of ugly rhetoric around immigration. And we’ve seen good faith efforts from leaders of both parties -- by the way, I just noticed, those of you who have chairs, if you want to sit down, feel free. There’s no rule about having to stand when I’m --\n\n\n\nAUDIENCE MEMBER: -- we love you! (Applause.)\n\n\n\nTHE PRESIDENT: But we’ve seen leaders of both parties who try to work on this issue, but then their efforts fell prey to the usual Washington games. And all the while, we’ve seen the mounting consequences of decades of inaction.\n\n\n\nToday, there are an estimated 11 million undocumented immigrants here in the United States. Some crossed the border illegally. Others avoid immigration laws by overstaying their visas. Regardless of how they came, the overwhelming majority of these folks are just trying to earn a living and provide for their families. (Applause.)\n\n\n\nBut we have to acknowledge they’ve broken the rules. They’ve cut in front of the line. And what is also true is that the presence of so many illegal immigrants makes a mockery of all those who are trying to immigrate legally.\n\n\n\nAlso, because undocumented immigrants live in the shadows, where they’re vulnerable to unscrupulous businesses that skirt taxes, and pay workers less than the minimum wage, or cut corners with health and safety laws, this puts companies who follow the rules, and Americans who rightly demand the minimum wage or overtime or just a safe place to work, it puts those businesses at a disadvantage.\n\n\n\nThink about it. Over the past decade, even before the recession hit, middle-class families were struggling to get by as the costs went up for everything, from health care, to college tuition, to groceries, to gas. Their incomes didn’t go up with those prices. We’re seeing it again right now with gas prices.\n\n\n\nSo one way to strengthen the middle class in America is to reform the immigration system so that there is no longer a massive underground economy that exploits a cheap source of labor while depressing wages for everybody else. I want incomes for middle-class families to rise again. (Applause.) I want prosperity in this country to be widely shared. (Applause.) I want everybody to be able to reach that American dream. And that’s why immigration reform is an economic imperative. It’s an economic imperative. (Applause.)\n\n\n\nAnd reform will also help to make America more competitive in the global economy. Today, we provide students from around the world with visas to get engineering and computer science degrees at our top universities. (Applause.)\n\n\n\nBut then our laws discourage them from using those skills to start a business or a new industry here in the United States. Instead of training entrepreneurs to stay here, we train them to create jobs for our competition. That makes no sense. In a global marketplace, we need all the talent we can attract, all the talent we can get to stay here to start businesses -- not just to benefit those individuals, but because their contribution will benefit all Americans.\n\n\n\nLook at Intel, look at Google, look at Yahoo, look at eBay. All those great American companies, all the jobs they’ve created, everything that has helped us take leadership in the high-tech industry, every one of those was founded by, guess who, an immigrant. (Applause.)\n\n\n\nSo we don’t want the next Intel or the next Google to be created in China or India. We want those companies and jobs to take root here. (Applause.) Bill Gates gets this. He knows a little something about the high-tech industry. He said, “The United States will find it far more difficult to maintain its competitive edge if it excludes those who are able and willing to help us compete.”\n\n\n\nSo immigration is not just the right thing to do. It’s smart for our economy. It’s smart for our economy. (Applause.) And it’s for this reason that businesses all across America are demanding that Washington finally meet its responsibilities to solve the immigration problem. Everybody recognizes the system is broken. The question is, will we finally summon the political will to do something about it? And that’s why we’re here at the border today.\n\n\n\nAnd I want to say I am joined today by an outstanding Secretary of the Department of Homeland Security, Janet Napolitano, who’s been working tirelessly on this issue. (Applause.) Our commissioner who’s working diligently on border issues, Alan Bersin, is there, and we appreciate him -- Bersin. (Applause.)\n\n\n\nSo they’re doing outstanding work. And in recent years, among one of the greatest impediments to reform were questions about border security. And these were legitimate concerns. What was true was a lack of manpower and a lack of resources at the border, combined with the pull of jobs and ill-considered enforcement once folks were in the country.\n\n\n\nAll this contributed to a growing number of undocumented people living in the United States. And these concerns helped unravel a bipartisan coalition that we had forged back when I was in the United States Senate. So in the years since, “borders first, borders first,” that's become the common refrain, even among those who were previously supportive of comprehensive immigration reform.\n\n\n\nBut over the last two years, thanks to the outstanding work of Janet and Alan and everybody who’s down here working at the border, we’ve answered those concerns. Under their leadership, we have strengthened border security beyond what many believed was possible. They wanted more agents at the border. Well, we now have more boots on the ground on the southwest border than at any time in our history. (Applause.)\n\n\n\nThe Border Patrol has 20,000 agents -- more than twice as many as there were in 2004. It’s a build-up that began under President Bush and that we’ve continued, and I had a chance to meet some of these outstanding agents, and actually saw some of them on horseback who looked pretty tough. (Laughter.) So we put the agents here.\n\n\n\nThen they wanted a fence. Well, the fence is --\n\n\n\nAUDIENCE: Booo!\n\n\n\nTHE PRESIDENT: The fence is now basically complete.\n\n\n\nAUDIENCE MEMBER: Tear it down!\n\n\n\nTHE PRESIDENT: Then we’ve gone further. We tripled the number of intelligence analysts working at the border. I’ve deployed unmanned aerial vehicles to patrol the skies from Texas to California. We have forged a partnership with Mexico to fight the transnational criminal organizations that have affected both of our countries. (Applause.) And for the first time -- for the first time we’re screening 100 percent of southbound rail shipments to seize guns and money going south even as we go after drugs that are coming north. (Applause.)\n\n\n\nSo, here’s the point. I want everybody to listen carefully to this. We have gone above and beyond what was requested by the very Republicans who said they supported broader reform as long as we got serious about enforcement. All the stuff they asked for, we’ve done. But even though we’ve answered these concerns, I’ve got to say I suspect there are still going to be some who are trying to move the goal posts on us one more time.\n\n\n\nAUDIENCE MEMBER: They’re racist!\n\n\n\nTHE PRESIDENT: You know, they said we needed to triple the Border Patrol. Or now they’re going to say we need to quadruple the Border Patrol. Or they’ll want a higher fence. Maybe they’ll need a moat. (Laughter.) Maybe they want alligators in the moat. (Laughter.) They’ll never be satisfied. And I understand that. That’s politics.\n\n\n\nBut the truth is the measures we’ve put in place are getting results. Over the past two and a half years, we’ve seized 31 percent more drugs, 75 percent more currency, 64 percent more weapons than ever before. (Applause.) And even as we have stepped up patrols, apprehensions along the border have been cut by nearly 40 percent from two years ago. That means far fewer people are attempting to cross the border illegally.\n\n\n\nAnd also, despite a lot of breathless reports that have tagged places like El Paso as dangerous, violent crime in southwest border counties has dropped by a third. El Paso and other cities and towns along this border are consistently among the safest in the nation. (Applause.) Of course, we shouldn’t accept any violence or crime. And we’ve always got more work to do. But this progress is important and it’s not getting reported on.\n\n\n\nAnd we’re also going beyond the border. Beyond the border, we’re going after employers who knowingly exploit people and break the law. (Applause.) And we are deporting those who are here illegally. And that’s a tough issue. It’s a source of controversy.\n\n\n\nBut I want to emphasize we’re not doing it haphazardly. We’re focusing our limited resources and people on violent offenders and people convicted of crimes -- not just families, not just folks who are just looking to scrape together an income. And as a result, we’ve increased the removal of criminals by 70 percent. (Applause.)\n\n\n\nThat’s not to ignore the real human toll of a broken immigration system. Even as we recognize that enforcing the law is necessary, we don’t relish the pain that it causes in the lives of people who are just trying to get by and get caught up in the system.\n\n\n\nAnd as long as the current laws are on the books, it’s not just hardened felons who are subject to removal, but sometimes families who are just trying to earn a living, or bright, eager students, or decent people with the best of intentions. (Applause.)\n\n\n\nAnd sometimes when I talk to immigration advocates, they wish I could just bypass Congress and change the law myself. But that’s not how a democracy works. What we really need to do is to keep up the fight to pass genuine, comprehensive reform. That is the ultimate solution to this problem. That's what I’m committed to doing. (Applause.)\n\n\n\nAUDIENCE MEMBER: Yes, we can! Yes, we can!\n\n\n\nTHE PRESIDENT: Yes, we can. We can do it. (Applause.)\n\n\n\nAUDIENCE: Yes, we can! Yes, we can! Yes, we can!\n\n\n\nTHE PRESIDENT: The most significant step we can now take to secure the borders is to fix the system as a whole so that fewer people have the incentive to enter illegally in search of work in the first place. This would allow agents to focus on the worst threats on both of our -- both sides of our borders, from drug traffickers to those who would come here to commit acts of violence or terror. That’s where our focus should be.\n\n\n\nSo, El Paso, the question is whether those in Congress who previously walked away in the name of enforcement are now ready to come back to the table and finish the work that we’ve started. (Applause.) We’ve got to put the politics aside. And if we do, I’m confident we can find common ground.\n\n\n\nWashington is lagging behind the country on this. There is already a growing coalition of leaders across America who don’t always see eye-to-eye, but are coming together on this issue. They see the harmful consequences of a broken immigration system for their businesses and for their communities, and they understand why we need to act.\n\n\n\nThere are Democrats and Republicans, people like former Republican Senator Mel Martinez; former Bush administration Homeland Security Secretary Michael Chertoff; leaders like Mayor Michael Bloomberg of New York; evangelical ministers like Leith Anderson and Bill Hybels; police chiefs from across the nation; educators; advocates; labor unions; chambers of commerce; small business owners; Fortune 500 CEOs.\n\n\n\nI mean, one CEO had this to say about reform: “American ingenuity is a product of the openness and diversity of this society. Immigrants have made America great as the world leader in business, in science, higher education and innovation.” You know who that leader was? Rupert Murdoch, who owns FOX News, and is an immigrant himself. I don’t know if you’re familiar with Rupert Murdoch’s views, but let’s just say he doesn’t have an Obama sticker on his car. (Laughter.) But he agrees with me on this. (Applause.)\n\n\n\nSo there is a consensus around fixing what’s broken. And now we need Congress to catch up. Now we need to come together around reform that reflects our values as a nation of laws and a nation of immigrants; reform that demands that everybody take responsibility. So what would comprehensive reform look like?\n\n\n\nFirst, we know that government has a threshold responsibility to secure our borders and enforce the law. And that’s what Janet and all her folks are doing. That’s what they’re doing. (Applause.)\n\n\n\nSecond, businesses have to be held accountable if they exploit undocumented workers. (Applause.)\n\n\n\nThird, those who are here illegally, they have a responsibility as well. So they broke the law, and that means they’ve got to pay their taxes, they’ve got to pay a fine, they’ve got to learn English. And they’ve got to undergo background checks and a lengthy process before they get in line for legalization. That’s not too much to ask. (Applause.)\n\n\n\nAnd fourth, stopping illegal immigration also depends on reforming our outdated system of legal immigration. (Applause.) We should make it easier for the best and the brightest to not only stay here, but also to start businesses and create jobs here. In recent years, a full 25 percent of high-tech startups in the U.S. were founded by immigrants. That led to 200,000 jobs here in America. I’m glad those jobs are here. I want to see more of them created in this country. We need to provide them the chance. (Applause.)\n\n\n\nWe need to provide our farms a legal way to hire workers that they rely on, and a path for those workers to earn legal status. (Applause.) And our laws should respect families following the rules -- reuniting them more quickly instead of splitting them apart. (Applause.)\n\n\n\nToday, the immigration system not only tolerates those who break the rules, but it punishes folks who follow the rules. While applications -- while applicants wait for approval, for example, they’re often forbidden from visiting the United States. Even husbands and wives may have to spend years apart. Parents can’t see their children. I don’t believe the United States of America should be in the business of separating families. That’s not right. That’s not who we are. We can do better than that. (Applause.)\n\n\n\nAnd we should stop punishing innocent young people for the actions of their parents. (Applause.) We should stop denying them the chance to earn an education or serve in the military. And that’s why we need to pass the DREAM Act. (Applause.) Now, we passed the DREAM Act through the House last year when Democrats were in control. But even though it received a majority of votes in the Senate, it was blocked when several Republicans who had previously supported the DREAM Act voted no.\n\n\n\nThat was a tremendous disappointment to get so close and then see politics get in the way. And as I gave that commencement at Miami Dade, it broke my heart knowing that a number of those promising, bright students -- young people who worked so hard and who speak about what’s best in America -- are at risk of facing the agony of deportation. These are kids who grew up in this country. They love this country. They know no other place to call home. The idea that we’d punish them is cruel. It makes no sense. We’re a better nation than that. (Applause.)\n\n\n\nSo we’re going to keep fighting for the DREAM Act. We’re going to keep up the fight for reform. (Applause.) And that’s where you come in. I’m going to do my part to lead a constructive and civil debate on these issues. And we’ve already had a series of meetings about this at the White House in recent weeks. We’ve got leaders here and around the country helping to move the debate forward.\n\n\n\nBut this change ultimately has to be driven by you, the American people. You’ve got to help push for comprehensive reform, and you’ve got to identify what steps we can take right now -- like the DREAM Act, like visa reform -- areas where we can find common ground among Democrats and Republicans and begin to fix what’s broken.\n\n\n\nSo I’m asking you to add your voices to this debate. You can sign up to help at whitehouse.gov. We need Washington to know that there is a movement for reform that’s gathering strength from coast to coast. That’s how we’ll get this done. That’s how we can ensure that in the years ahead we are welcoming the talents of all who can contribute to this country and that we’re living up to the basic American idea that you can make it here if you try. (Applause.)\n\n\n\nThat’s the idea that gave hope to José Hernández. Is José here? Where’s -- José is right over there. (Applause.) I want you to hear -- I want you to think about this story. José’s parents were migrant farm workers. And so, growing up, he was too. He was born in California, though he could have just as easily been born on the other side of the border, if it had been a different time of year, because his family moved around with the seasons. So two of his siblings were actually born in Mexico.\n\n\n\nSo they traveled a lot, and José joined his parents picking cucumbers and strawberries. And he missed part of school when they returned to Mexico each winter. José didn’t learn English until he was 12 years old. But you know what, José was good at math and he liked math. And the nice thing is that math was the same in every school, and it’s the same in Spanish as it is in English.\n\n\n\nSo José studied, and he studied hard. And one day, he’s standing in the fields, collecting sugar beets, and he heard on a transistor radio that a man named Franklin Chang-Diaz -- a man with a surname like his -- was going to be an astronaut for NASA. So José decided -- right there in the field, he decided -- well, I could be an astronaut, too.\n\n\n\nSo José kept on studying, and he graduated high school. And he kept on studying, and he earned an engineering degree. And he kept on studying, and he earned a graduate degree. And he kept on working hard, and he ended up at a national laboratory, helping to develop a new kind of digital medical imaging system.\n\n\n\nAnd a few years later, he found himself more than 100 miles above the surface of the Earth, staring out of the window of the shuttle Discovery, and he was remembering the boy in the California fields with that crazy dream that in America everything is possible. (Applause.)\n\n\n\nThink about that, El Paso. That’s the American Dream right there. (Applause.) That's what we’re fighting for. We are fighting for every boy and every girl like José with a dream and potential that's just waiting to be tapped. We are fighting to unlock that promise, and all that holds not just for their futures, but for America’s future. That's why we’re going to get this done. And that's why I’m going to need your help.\n\n\n\nThank you. God bless you. And may God bless the United States of America. (Applause.)\n\nEND\n\n1:56 P.M. MDT", "images": ["https://obamawhitehouse.archives.gov/sites/whitehouse.gov/files/images/twitter_cards_default.jpg", "https://obamawhitehouse.archives.gov/profiles/forall/modules/custom/gov_whitehouse_www/images/icons/wh_logo_seal.png"], "top_img": "https://obamawhitehouse.archives.gov/sites/whitehouse.gov/files/images/twitter_cards_default.jpg", "keywords": [], "authors": [], "canonical_link": "https://obamawhitehouse.archives.gov/the-press-office/2011/05/10/remarks-president-comprehensive-immigration-reform-el-paso-texas", "title": "Remarks by the President on Comprehensive Immigration Reform in El Paso, Texas", "meta_data": {"msapplication-square70x70logo": "https://obamawhitehouse.archives.gov/profiles/forall/themes/custom/fortyfour/images/fortyfour/favicons/mstile-70x70.png", "msapplication-TileImage": "https://obamawhitehouse.archives.gov/profiles/forall/themes/custom/fortyfour/images/fortyfour/favicons/mstile-70x70.png", "msapplication-square150x150logo": "https://obamawhitehouse.archives.gov/profiles/forall/themes/custom/fortyfour/images/fortyfour/favicons/mstile-150x150.png", "msapplication-wide310x150logo": "https://obamawhitehouse.archives.gov/profiles/forall/themes/custom/fortyfour/images/fortyfour/favicons/mstile-310x150.png", "msapplication-square310x310logo": "https://obamawhitehouse.archives.gov/profiles/forall/themes/custom/fortyfour/images/fortyfour/favicons/mstile-310x310.png", "msapplication-TileColor": "#003C80", "application-name": "Whitehouse", "msapplication-config": "https://obamawhitehouse.archives.gov/profiles/forall/themes/custom/fortyfour/browserconfig.xml", "generator": "Drupal 7 (http://drupal.org)", "og": {"site_name": "whitehouse.gov", "type": "article", "title": "Remarks by the President on Comprehensive Immigration Reform in El Paso, Texas", "url": "https://obamawhitehouse.archives.gov/the-press-office/2011/05/10/remarks-president-comprehensive-immigration-reform-el-paso-texas", "description": "1:21 P.M. MDT", "updated_time": "2011-05-10T17:37:55-04:00", "image": {"identifier": "https://obamawhitehouse.archives.gov/sites/whitehouse.gov/files/images/twitter_cards_default.jpg", "secure_url": "https://obamawhitehouse.archives.gov/sites/whitehouse.gov/files/images/twitter_cards_default.jpg", "type": "image/jpeg", "width": 240, "height": 240}}, "twitter": {"card": "summary", "site": "@WhiteHouse", "creator": "@WhiteHouse", "title": "Remarks by the President on Comprehensive Immigration Reform in El", "url": "https://obamawhitehouse.archives.gov/the-press-office/2011/05/10/remarks-president-comprehensive-immigration-reform-el-paso-texas", "image": {"identifier": "https://obamawhitehouse.archives.gov/sites/whitehouse.gov/files/images/twitter_cards_default.jpg", "width": 240, "height": 240}}, "article": {"published_time": "2011-05-10T17:33:00-04:00", "modified_time": "2011-05-10T17:37:55-04:00"}, "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width"}, "movies": [], "publish_date": 1304956800.0, "source": "http://www.whitehouse.gov", "summary": ""}