{"url": "http://uk.businessinsider.com/rob-kardashian-apology-blac-chyna-revenge-porn-2017-7", "text": "Rob Kardashian has allegedly apologized to his mom and sisters for posting explicit photos of Blac Chyna. AP The INSIDER Summary:\n\nRob Kardashian has reportedly apologized to his family for posting explicit images of his ex-fiancee Blac Chyna on social media.\n\nThe Kardashians have stayed silent since the drama erupted on July 5.\n\nSources close to the Kardashian family told E! News that Rob apologized to his sisters and mom, and regrets his actions.\n\nAccording to a source, Kris Jenner is said to have \"really put [Rob] in his place.\"\n\nDespite apologizing, Rob denies Chyna's accusations that he abused her in April.\n\n\n\nRob Kardashian's family hasn't made any official comments about the reality star's July 5 social media attack of Blac Chyna, in which he shared explicit photos of his ex-fiancée with millions of followers on Instagram and Twitter.\n\nAfter Chyna was granted a temporary restraining order against Rob, E! News has confirmed an earlier report from TMZ that cited sources who said that Rob has apologized to his family for his behavior, citing sources close to the Kardashian family.\n\n\"Rob did apologize to the family and has major regrets over the way he acted,\" one source told E! News. \"He is very remorseful and upset with himself over what he did.\" The source added that \"he is embarrassed [by his actions] and knows he needs to be better for [his and Chyna's daughter] Dream.\"\n\nA separate source told the website that when Rob apologized over the phone to his mom, Kris Jenner, she \"really put him in his place.\" He allegedly offered multiple apologies, according to E! News, but Jenner \"told [Rob] that this was going to affect Dream in many ways if he didn't get his act together.\"\n\nThe Kardashians have still not spoken publicly about the scandal. Ethan Miller/Getty Images\n\nThe same source said that the family members \"are all not pleased with the incident, but they have let Rob figure it out on his own,\" and that they \"really want nothing to do with\" the situation, claiming that they \"hated\" Chyna. (If this is true, and you watch \"Keeping Up With the Kardashians,\" this won't come as a surprise; the show documented the ups and downs of the family's relationship with Chyna.)\n\nSources also told the website that Rob's family encouraged him to stop using his social media accounts.\n\nBut, according to E! News, the first source mentioned above said Rob denies Chyna's allegations that he hit her in April. She accused him of domestic abuse in two now deleted Snapchat posts, and later mentioned an incident that she said occured in April during her July 10 interview with ABC's \"Good Morning America.\"\n\nThe same source told the website that Rob \"is taking responsibility\" for his actions. \"He also realizes that there could be consequences and that he won't be able to see Dream. That is what's most important to him and not being able to be with her is what scares him the most,\" adding that \"he is trying to learn from this and move forward. He just wants to be a good dad and focus on that.\"\n\nFollowing the July 10 court hearing that resulted in a temporary restraining order against Rob, Chyna's lawyer told Page Six that she will be working with Rob's lawyers to formalize a co-parenting agreement for their 8-month-old daughter, Dream.\n\nBefore Rob was hit with a restraining order — which prohibits him from contacting Chyna — the reality star hadn't offered a direct apology to his former partner. Rob's lawyer Robert Shapiro has issued an apology on his client's behalf, however.\n\n\"I personally on Robert Kardashian's behalf apologized and offered our regrets for what has taken place in the past couple of days, and now we move forward to do one thing and one thing only: whatever's in the best interest of this child,\" he said in a press conference following the hearing.\n\nA TMZ report also quoted Shapiro saying that Rob's social media activity was \"a spontaneous reaction that he regrets.\"\n\nThe only hint of a public comment from Rob's family since the scandal came in the form of a nondisclosure agreement sent to ABC News by Kim Kardashian's representatives after the network contacted the family for comment following its \"Good Morning America\" interview with Chyna.\n\nChyna signed a nondisclosure agreement before appearing on \"KUWTK\" and \"Rob & Chyna\" under her legal name, Angela White. ABC News/Nightline\n\nThe agreement signed by Chyna on June 10, 2016 stipulates that she agreed not to divulge any information about the Kardashian family; by sending the NDA, Kim's representatives seem to suggest that Chyna breached the contract in revealing details about her relationship with Rob. This is particularly troubling, however, given Chyna's allegations of domestic abuse and the fact that she didn't consent to having her naked photos shared on the internet.\n\nIn our coverage of the Rob and Chyna feud, INSIDER reached out repeatedly to both Rob and Chyna's lawyers as well as representatives for Rob Kardashian for further comment. We will update this story with any developments.", "images": ["https://static.businessinsider.com/image/5bd375adcd6f3842155a1a29", "https://i.insider.com/5966a6419d0918042313bcf8?width=1200&format=jpeg", "https://i.insider.com/5966a6429d0918042313bcfa?width=600&format=jpeg&auto=webp", "https://i.insider.com/5966a6429d0918042313bcf9?width=600&format=jpeg&auto=webp", "https://static3.businessinsider.com/assets/images/careerbuilder.png", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1 1'%3E%3C/svg%3E", "http://uk.businessinsider.com/rob-kardashian-apology-blac-chyna-revenge-porn-2017-7?width=600&format=jpeg&auto=webp", "https://i.insider.com/596656c0dde1890085679a15?width=600&format=jpeg&auto=webp"], "top_img": "https://i.insider.com/5966a6419d0918042313bcf8?width=1200&format=jpeg", "keywords": [], "authors": ["Chloe Pantazi"], "canonical_link": "https://www.insider.com/rob-kardashian-apology-blac-chyna-revenge-porn-2017-7", "title": "Kris Jenner reportedly put Rob Kardashian 'in his place' after he apologized for Blac Chyna scandal", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "Kris Jenner reportedly put Rob Kardashian 'in his place' after he apologized for Blac Chyna scandal", "date": "2017-07-12", "news_keywords": "Rob Kardashian, Kris Jenner, Kardashians, Kim Kardashian, Blac Chyna, Revenge Porn, Social Media, Instagram, Twitter, Chloe Pantazi", "description": "Sources close to the Kardashian family told E! News that Rob apologized to his sisters and mom, and regrets his actions.", "author": "Chloe Pantazi", "article": {"publisher": "businessinsider", "content_tier": "free", "opinion": "false"}, "tbi-vertical": "Insider", "og": {"title": "Kris Jenner reportedly put Rob Kardashian 'in his place' after he apologized for Blac Chyna scandal", "description": "Sources close to the Kardashian family told E! News that Rob apologized to his sisters and mom, and regrets his actions.", "type": "article", "url": "https://www.businessinsider.com/rob-kardashian-apology-blac-chyna-revenge-porn-2017-7", "image": "https://i.insider.com/5966a6419d0918042313bcf8?width=1200&format=jpeg", "site_name": "Business Insider"}, "sailthru.title": "Kris Jenner reportedly put Rob Kardashian 'in his place' after he apologized for Blac Chyna scandal", "sailthru.date": "2017-07-12", "sailthru.tags": "Rob Kardashian, Kris Jenner, Kardashians, Kim Kardashian, Blac Chyna, Revenge Porn, Social Media, Instagram, Twitter, Chloe Pantazi", "sailthru.description": "Sources close to the Kardashian family told E! News that Rob apologized to his sisters and mom, and regrets his actions.", "sailthru.author": "Chloe Pantazi", "sailthru.verticals": "insider", "sailthru.image.full": "https://i.insider.com/5966a6419d0918042313bcf7?width=1200&format=jpeg", "sailthru.image.thumb": "https://i.insider.com/5966a6419d0918042313bcf7?width=160&format=jpeg", "twitter": {"card": "summary_large_image"}, "fb": {"pages": 20446254070}, "apple-itunes-app": "app-id=554260576", "linkedin": {"owner": "mid:1d5f7b"}, "ii-ab-test": {"mobile-sticky": "control", "pfi-wider-content": "variant", "back-to-top": "variant", "sticky-section-titles": "variant", "post-breadcrumbs": "variant", "tabbed-homepage": "variant", "expanded-coverage-module": "variant", "subscribe-smallest-price": "control"}, "viking-id": "5966a6429d0918042313bcfb", "env": "prod", "msapplication-config": "//www.businessinsider.com/public/assets/BI/US/favicons/browserconfig.xml?12-31-19", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1499788800.0, "source": "http://uk.businessinsider.com", "summary": ""}