{"url": "https://en.wikipedia.org/wiki/El_Dorado_(Shakira_album)", "text": "2017 studio album by Shakira\n\nEl Dorado (As the mythical golden city \"El Dorado\") is the eleventh studio album by Colombian singer Shakira, released on 26 May 2017, by Sony Music Latin. The album is mainly sung in Spanish, with three songs in English. After her self-titled tenth studio album (2014), Shakira had her second child, suffered from writer's block and was uncertain about the future of her career. However, her collaboration on \"La Bicicleta\" with Carlos Vives and support from her boyfriend, Gerard Piqué, encouraged Shakira to continue to work on music.\n\nInspired by her personal life and experiences, El Dorado primarily features songs about the singer's relationship with Piqué. Shakira enlisted longtime collaborator Luis Fernando Ochoa, as well as new producers Supa Dups, Rude Boyz and The Arcade. Sonically, the album is a mixture of Latin pop and reggaeton, with influences from bachata, vallenato and electronic pop. The album features six vocal collaborations: two with Colombian singer Maluma, and one each with Nicky Jam, Vives, Prince Royce, Black M, and Magic!.\n\nMusic critics commended the album's coherency, and its fun yet mature nature. Other critics felt El Dorado lacked creativity and relied too heavily on previously-released collaborations. The album debuted in the top ten of album charts in Argentina, Austria, France, Spain and Switzerland. It also peaked at number one on the US Top Latin Albums and number fifteen on the Billboard 200 chart. \"Chantaje\" was the album's first single. It became a global success, topping Billboard's Hot Latin Songs chart for eleven non-consecutive weeks and becoming certified sixteen times platinum by the Recording Industry Association of America (RIAA). The second and third single, \"Me Enamoré\" and \"Perro Fiel\", both achieved commercial success as well. In early 2018, \"Trap\" was released as the album's fourth single. While the album was accompanied by minimal promotion, a concert tour to support it has been confirmed. In 2018, the album won the Grammy Award for Best Latin Pop Album, making it Shakira's third Grammy win. To promote the album, Shakira embarked on her El Dorado World Tour. Initially would start on November 2017, but due to a vocal chord hemorrhage she suffered, she postponed the tour, starting in June 2018.\n\nBackground [ edit ]\n\nIn October 2015, Shakira announced that she was going back to the recording studio \"soon\" to record what was going to be her eleventh studio album, but emphasized that her priority was her family, saying: \"By the end of this year or the beginning of the next year I will start working on my new album in the studio. Now I want to be first and foremost a mother, because after three months I will no longer have a baby. He will be grown up as a healthy one years old boy.\"[2] During that time, Shakira started questioning herself if she would ever make an album again, stating: \"I was full of doubts, and I thought I was never going to make good music again.\" She also recalled that she wondered when she was going to retire, to which her boyfriend, Spanish footballer Gerard Piqué, replied: \"When you don't have anything to say. But that moment hasn't come yet.\"[3] She added that \"[t]he creator inside of me was in desperate need of attention. But also my 2-year-old was in the same need. The person, the mother, the creator — all of those little Shakiras were fighting inside of me, so it was very tumultuous.\"[3] In February 2016, during an interview for the animated movie Zootopia (2016), where she voiced the character Gazelle, Shakira commented about the early stages of the record, saying: \"I'm starting to write again and ideas are starting to flow...In Spanish, I have a lot of things to say in Spanish this time.\" [4]\n\nRecording [ edit ]\n\nShakira began working on the album in the beginning of 2016.[5] In March 2016, she posted various images on her Instagram account of her writing songs with her longtime collaborator Luis Fernando Ochoa and drumming for the new album.[6]\n\nIn August 2016, Jamaican singer Sean Paul said that he worked with Shakira in a song produced by David Guetta titled \"Temple\", which he described as a \"dancehall EDM type thing,\" while also revealing that she was \"working with one of my old producers from Jamaica trying to find something that's hot and dancehall is hot again. It's a great resurgence.\"[7] During the album's recording process, it was rumoured that Shakira had also collaborated with record producers Calvin Harris and Stargate, though it was never officially confirmed.[8][9]\n\nComposition [ edit ]\n\nEl Dorado is primarily a Spanish album,[3][10][11] with three songs in English,[12] while also featuring Shakira singing a few words in Anglo-French.[13] Sonically, as stated by Shakira herself, the album has songs \"with differen[t] influences from reggaeton, bachata, straight pop songs and very personal songs especially.\"[14] The album opens with \"Me Enamoré\" (\"I Fell in Love\"), a \"bouncy pop [song] infused with electronica,\"[15] with \"digitally-stuttered lyrical breakdown.\"[16] Lyrically, the song tells the story of how she met Gerard Piqué, giving details about \"the instant connection between them when she least expected it.\"[17] According to Shakira, \"[t]his song narrates a moment in my life when I was so in love that I was literally climbing trees.\"[18] \"Nada\" (\"Nothing\") follows \"Me Enamoré\", and is a power ballad[15] that talks about loneliness and missing a loved one.[12] According to Rolling Stone's Sarah Grant, the song \"features the familiar gallop Shakira has honed in songs as early as 2001's 'Poem to a Horse,' to her 2014 hit, 'Empire'.\"[19] \"Chantaje\" (\"Blackmail\") is the first duet with Maluma and is an electronic reggaeton song[13][15] about a chase \"between a lustful man and an unattainable woman.\"[20] Regarding its lyrics, Shakira explained: \"I wanted to give it a different spin, where the girl is the mean one, because I’m tired of hearing songs where women complain about how mistreated they feel. This time, I wanted to take control. I wanted to represent the mean one in the relationship — the careless one, the free-spirited one.\"[3]\n\n\"When a Woman\", the first track sung in English, is an electronic pop song with synths and shuffling beats.[21] Its lyrics detail \"a romance that hurts so good.\"[21] \"Amarillo\" (\"Yellow\") is a Europop track, with its chorus being compared to that of a \"Disney-esque anthem\".[15] Lyrically, it has Shakira making a juxtaposition between her feelings and colors.[12] Sheila Cuartero from Europa FM's radio program Vamos Tarde analyzed the lyrics of the song and stated that it addresses Shakira's love and feelings towards \"a supreme God\".[22] Its initial verse-section was also compared to the verse melody of Madonna's \"Papa Don't Preach\".[13][16] The song \"Perro Fiel\" (\"Faithful Dog\") is a pop-reggaeton duet with the reggaeton singer Nicky Jam.[3] During the song, both singers try to fight their feelings towards each other, despite their sexual tension.[21] It was compared to Enrique Iglesias' \"Duele el Corazón\", \"but in a slower version\".[23] \"Trap\" is the second duet with Maluma and was considered \"a whispery ballad that fuses Spanish-language pop with the brittle R&B rhythms of trap.\"[3] It was noted that during the track, Maluma \"coat[s] his voice with electro effects.\"[16] Lyrically, the song talks about heartbreak and was described as an ode to desire and casual sex.[12] \"Coconut Tree\" is the second song in English and channels Australian synthpop band Empire of the Sun.[13] Lyrically, the midtempo \"guitar-driven\" \"folky\" track[14][21] has Shakira longing for a personal \"romantic escape.\"[13][15] The album closes with the piano ballad \"Toneladas\" (\"Tons\"),[13] with lyrics about unconditional love.[12]\n\nIn addition to the nine original tracks, the album also includes four duets, with three of them being previously released as singles and included on the collaborators' albums, and one being an English version of one of the duets. The first track, \"Comme Moi\" (\"Like Me\") is a duet with French rapper and singer Black M and was included on his third studio album, Éternel insatisfait (2017).[16] During the track, Black M sings and raps in French, while Shakira sings in English.[12] The track also has a new and English version titled \"What We Said\" and it features Canadian band Magic!.[13] Both tracks have a reggaeton beat.[3] Shakira's duet with Carlos Vives on \"La Bicicleta\" (\"The Bicycle\") is also included on the album. The track, which is a vallenato and reggaeton song[24] about biking around childhood haunts,[13] was the turning point for Shakira as she revisited her Colombian roots and felt inspired,[3] coming up with the song's refrain and its title.[3] El Dorado also features Shakira's duet with American singer Prince Royce on the bachata love song \"Deja Vu\", which was first included on his fifth studio album Five (2017).[21] The song was also described as a \"salsa-flavored percussive\" track[15] about falling in and out of love and being delusional towards love.[3]\n\nRelease and promotion [ edit ]\n\nTo promote the album, Shakira partnered with geolocation platform Landmrk to mobilise her fans to unlock digital 'treasures' at physical locations across the globe on the website, Shakiraeldorado.com.[25] Her fans visited over 1,000 locations in 99 countries to unlock exclusive content, including the track listing, videos of recording sessions, and clips of her new songs.[25] A week ahead of the album's release, Shakira released the song \"Nada\" along with the album's track listing and its pre-order.[20] On 16 May 2017, Shakira performed \"Me Enamoré\" at Univision's Upfront.[26] On 25 May 2017, a day before the album's release, Shakira held an album's release party at The Temple House in Miami, where she performed five songs, including duets with Prince Royce (on \"Deja Vu\") and Nicky Jam (on \"Perro Fiel\"), as well as \"Nada\" and the singles \"Chantaje\" and \"Me Enamoré\".[27] A day after its release, on 27 May 2017, Shakira gave a free concert at The Wynwood Yard, where she performed \"Me Enamoré\" and \"Toneladas\".[28]\n\nSingles [ edit ]\n\n\"Chantaje\" was released as the lead single on 28 October 2016.[29] The song became a massive hit in Latin America and Spanish-speaking territories,[3][30] peaking at number one in Spain, Guatemala, Mexico, Ecuador, Uruguay and on the Hot Latin Songs in the United States, where it remained at the top for 11 weeks.[31] It also achieved moderate success worldwide, reaching top 10 positions in Switzerland, Israel, Romania, Bulgaria and other countries, as well as top twenty positions in Italy, France, Germany and Belgium.[32] On the US Billboard Hot 100, \"Chantaje\" peaked at number 51, becoming her highest Hot 100 Spanish-language single after \"La Tortura\" (2005).[33] It was certified 16× Platinum by the Recording Industry Association of America in the Latin field for exceeding sales of 960,000 copies.[34] The music video for the song has accumulated more than 2.4 billion views on YouTube and the song has gathered over 600 million plays on Spotify.[3]\n\n\"Me Enamoré\" was released as the album's second single on 7 April 2017.[35] The song reached number three in Spain, as well as the top ten in Argentina, Chile, Guatemala, Mexico and Uruguay.[36] In the United States, it has peaked at number 83 on the Billboard Hot 100, and has reached number 4 on the Hot Latin Songs, being Shakira's 26th top ten hit on the chart.[37] The music video for the song garnered media attention due to the appearance of Gerard Piqué.[38]\n\n\"Perro Fiel\" was originally released as a promotional single for the album on 25 May 2017.[39] Its official release as the third single took place on 15 September 2017, the same date its music video was released.[40] which was filmed in Barcelona on 27 July 2017.[41] Before being released as single, was certified gold in Spain for selling over 20,000 copies on 30 August 2017.[42] The song peaked at number three in Spain and as topped the charts in Argentina, Mexico, Uruguay and various other Latin American countries.[36] In the United States, the song peaked at number 100 on the Billboard Hot 100, and has reached number six on the Hot Latin Songs, becoming Shakira's 27th top ten hit on the chart.[37]\n\n\"Trap\" was released as the album's fourth single on 26 January 2018.[1] The song features guest vocals from Colombian singer Maluma; the black-and-white music video for the song was released on 26 January 2018 and it was directed by Jaume de Laiguana.[43][44] \"Trap\" debuted at number 45 on Billboard's Hot Latin Songs the same week El Dorado was released and later peaked at number 17 in the week ending on the 10 February 2018.[37]\n\n\"Nada\" was released as the album's fifth single on 3 November 2018.\n\nCritical reception [ edit ]\n\nUpon its release, El Dorado was given three-and-a-half out of five stars by AllMusic's Stephen Thomas Erlewine, who praised the album for being \"coherent and mature in its understated -- but not boring -- control of mood\".[11] Si Hawkins of The National was positive towards its content, noting that El Dorado is \"a summer treat for her Latino fans,\" highlighting that \"the album's hispanic focus allows its star to have some fun, rather than follow North American chart trends\" and that it \"breaks new ground for this global icon\".[13] In another positive review, Chuck Campbell of Knoxville News Sentinel considered it \"a solid hodgepodge of trendy and classic tracks,\" while praising her longtime collaborator Luis Fernando Ochoa and noting that her \"distinctive voice\" is \"the not-so-secret weapon, and she’s supported by crisp arrangements that reflect her heritage as well as the current state of pop music.\"[15]\n\nFor Allan Raible of ABC News, El Dorado \"finds Shakira continuing to grow as a performer, even if she’s sticking to club tracks and love ballads. She's developing a fitting, casual subtlety.\"[16] Joan Wallace of Latin Times felt that the album \"seems to be a forced compilation of featuring songs we have already listened plus five other not-so-great new tracks.\" Wallace also criticized the lack of creativity that was found on her records such as Pies Descalzos (1995) and Laundry Service (2001).[23]\n\nAccolades [ edit ]\n\nCommercial performance [ edit ]\n\nEl Dorado debuted at number 15 on the US Billboard 200, with 29,000 album-equivalent units.[51] It was the sixth best-selling album of the week, selling 20,000 copies in its first week.[51][52] The album debuted at number 2 on the Top Latin Albums chart,[53] Although it was her first album to not debut at number-one on the Top Latin Albums since Pies Descalzos (1995), the album debuted at number-one on the Latin Pop Albums, becoming her seventh and holding the record for most number-one Latin Pop Albums among women.[51] The album however topped the Top Latin Albums chart the following week, making it Shakira's sixth number 1 on the chart.[54] El Dorado was also the biggest sales week for a Latin album in more than two years, with Gerardo Ortiz's Hoy Mas Fuerte (2015), being the last one to do so.[51] It is also the best-selling Latin album for the first half year of 2017 in the US, with overall sales of 131,000 album-equivalent units.[55] In Nielsen's 2017 year-end report, El Dorado is noted as having accumulated combined sales and track streams of 246,000 units in the United States.[56] In May 2018, the album was certified nine-times platinum (Latin) in the country by the RIAA.[57] In August 2018 Shakira received a plaque from Sony ATV Latin in Sunrise, Florida for achieving multiple number one singles throughout her career, and certifying the album as a Diamond record based on RIAA's Latin program.[58] In France El Dorado peaked at number 4, and by the end of 2017 the album sold over 33,000 copies.[59] It was later certified Gold in the country for 50,000 copies sold.[60]\n\nIt also debuted at number 92 in Australia and at number 54 in the United Kingdom,[61][62] becoming her first Spanish album to chart in the former and her highest charting Spanish album in both countries. El Dorado also debuted atop the albums chart in Romandy, the French-speaking part of Switzerland.[63] It entered the Spanish albums chart at number 2,[64] at number 3 in Switzerland,[65] at number 4 in France, at number 10 in Austria,[66] at number 12 in Italy,[67] at number 19 in Germany,[68] at number 32 in Finland,[69] and at number 20 in the Netherlands.[70]\n\nTrack listing [ edit ]\n\nNotes\n\nCredits adapted from album booklet\n\n^a signifies a co-producer\n\nsignifies a co-producer ^b signifies an additional producer\n\nCharts [ edit ]\n\nCertifications [ edit ]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/a/a7/Shakira_El_Dorado_cover.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Star_full.svg/11px-Star_full.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Star_empty.svg/11px-Star_empty.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Star_half.svg/11px-Star_half.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a7/Shakira_El_Dorado_cover.png/220px-Shakira_El_Dorado_cover.png", "https://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/a/a7/Shakira_El_Dorado_cover.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/El_Dorado_(Shakira_album)", "title": "El Dorado (Shakira album)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/a/a7/Shakira_El_Dorado_cover.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}