{"url": "www.vanityfair.com/style/2014/04/sergey-brin-amanda-rosenberg-affair", "text": "The suburb of Los Altos, dotted with sequoia trees and apricot orchards, resembles most wealthy areas in Northern California’s Silicon Valley, with a main street of shops selling hyper-athletic offerings, like fleeces for hiking nearby mountains, and Francophile designs to decorate Provençal-influenced homes (sterling-silver trivets, champagne flutes imported from Paris). But look a bit closer and there’s something different about this particular town. A stone’s throw from the Tesla and McLaren car dealerships of Palo Alto, Los Altos has an inordinate, almost absurd number of services that cater to children. A toy store is stuffed with puffy glitter stickers and neon science projects for kid geniuses. A farm-to-fork restaurant includes a nanny-staffed room for children so you can enjoy your meal in peace, and a 5,000-square-foot kids’ science center with an electromagnetic ring toss and an exhibition about the way the wind moves on the ocean opened its doors in December.\n\nThis childhood fantasia didn’t happen by accident: some of it is the result of urban-design investments made by Sergey Brin, the co-founder of Google, and his wife, Anne Wojcicki (pronounced Wo-jit-skee), the most important couple in town—and perhaps the most prominent young couple in Silicon Valley. With more than $30 billion in wealth—much of it in special B-class stock that allows Brin to retain a good share of his voting power in Google—they were ranked ninth among U.S. families in charitable giving last year, on their way to becoming Generation X’s answer to Bill and Melinda Gates.\n\n“Sergey is a beloved oddball of a guy, and unlike [Google’s current and former C.E.O.’s] Larry Page and Eric Schmidt, he’s the one who gets to do the cool stuff at Google,” says an industry observer. “He said, ‘Larry, you do the hard, prestigious work, and at the end of your life you’ll do the fun stuff, like Bill Gates. But I’m cutting out the bullshit and Davos and doing the fun stuff right now.’ ” Wojcicki, in her professional life as well as her personal one, is a powerful woman with ambitions that are enormous, which she funnels into her genetic-testing company, 23andMe. Last fall, Fast Company put her on the cover as “The Most Daring CEO in America.”\n\nWith two kids under six years old (hence the strong commitment to child-oriented activities in their town, even if the enterprise seems a bit Truman Show-like), the couple were widely seen as perfect for each other. Some people even called them “twins”: they’re the same age (40), went to elite universities, and are fanatical about the outdoors, yoga, and athletics. Brin likes springboard diving; Wojcicki rides an elliptical bike to work. Among the foremost examples of Silicon Valley’s data-driven pragmatism and optimism, they fervently believe the world can be a better place and have devoted themselves to making it so through their many interlocking ventures and family foundation, to which they contributed $187 million last year.\n\nBut romantic scandals can happen even to those for whom “good fortune arrives in fairytale-like flurries,” as The New York Times once wrote. The pair separated about 10 months ago. Last year Brin, a handsome, compact man with a toned physique, an enviable head of hair, and sparkling brown eyes, left the family’s spread on a $7 million Los Altos lot while dating a Google employee in her mid-20s, Amanda Rosenberg—who, in turn, ditched her boyfriend, then a prized executive at Google’s Android arm, for Brin. Gossip about the situation ricocheted quickly among the upper echelons of the wealthy fortysomethings leading Silicon Valley. Making things even more complicated, Wojcicki, says a friend of the couple’s, considered Rosenberg “a friend.”", "images": ["https://media.vanityfair.com/photos/54cac008b624d691057695ee/master/w_1600%2Cc_limit/image.jpg", "http://www.vanityfair.com/verso/static/vanity-fair/assets/logo-header.b6748104d0d362745b508aebea5a86c913809200.svg", "https://media.vanityfair.com/photos/54cac008b8f23e3a03159023/master/w_1600%2Cc_limit/image.jpg", "https://media.vanityfair.com/photos/54cac008494254fc09974003/16:9/w_1280,c_limit/image.jpg", "https://media.vanityfair.com/photos/54cac00851062027081ff7a4/master/w_2560%2Cc_limit/image.jpg", "http://www.vanityfair.com/verso/static/vanity-fair/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg"], "top_img": "https://media.vanityfair.com/photos/54cac008494254fc09974003/16:9/w_1280,c_limit/image.jpg", "keywords": [], "authors": ["Vanessa Grigoriadis", "Vanessa Grigoriadi"], "canonical_link": "https://www.vanityfair.com/style/2014/04/sergey-brin-amanda-rosenberg-affair", "title": "Sergey Brin and Amanda Rosenberg: Inside the Google Co-Founder’s Romance with the Google Glass Marketing Manager", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Vanessa Grigoriadis", "copyright": "Copyright (c) Condé Nast 2020", "description": "The high-profile love triangle involving Sergey Brin, Anne Wojcicki, and Amanda Rosenberg has Silicon Valley facing emotional issues, from office romance to fear of mortality.", "id": "54cb02145106202708207238", "keywords": "society,google,technology,magazine,april 2014 issue", "news_keywords": "society,google,technology,magazine,april 2014 issue", "robots": "index, follow", "content-type": "article", "parsely-post-id": "54cb02145106202708207238", "parsely-metadata": "{\"description\":\"The high-profile love triangle involving Sergey Brin, Anne Wojcicki, and Amanda Rosenberg has Silicon Valley facing emotional issues, from office romance to fear of mortality.\",\"image-16-9\":\"https://media.vanityfair.com/photos/54cac008494254fc09974003/16:9/w_1000,c_limit/image.jpg\",\"image-1-1\":\"https://media.vanityfair.com/photos/54cac008494254fc09974003/1:1/w_1000,c_limit/image.jpg\"}", "og": {"description": "The high-profile love triangle involving Sergey Brin, Anne Wojcicki, and Amanda Rosenberg has Silicon Valley facing emotional issues, from office romance to fear of mortality.", "image": "https://media.vanityfair.com/photos/54cac008494254fc09974003/16:9/w_1280,c_limit/image.jpg", "site_name": "Vanity Fair", "title": "Sergey Brin and Amanda Rosenberg: Inside the Google Co-Founder’s Romance with the Google Glass Marketing Manager", "type": "article", "url": "https://www.vanityfair.com/style/2014/04/sergey-brin-amanda-rosenberg-affair"}, "article": {"content_tier": "metered", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@VanityFair", "description": "The high-profile love triangle involving Sergey Brin, Anne Wojcicki, and Amanda Rosenberg has Silicon Valley facing emotional issues, from office romance to fear of mortality.", "domain": "https://www.vanityfair.com", "image": {"src": "https://media.vanityfair.com/photos/54cac008494254fc09974003/16:9/w_1280,c_limit/image.jpg?mbid=social_retweet"}, "site": "@VanityFair", "title": "Sergey Brin and Amanda Rosenberg: Inside the Google Co-Founder’s Romance with the Google Glass Marketing Manager"}, "fb": {"app_id": 305927716147259, "pages": 8810407571}, "google-signin-client_id": "1065629119444-svrqo31taikd2j0ji4dgjs9q3vul4133.apps.googleusercontent.com"}, "movies": [], "publish_date": null, "source": "http://www.vanityfair.com", "summary": ""}