{"url": "https://www.theguardian.com/film/2017/dec/14/star-wars-the-last-jedi-mark-hamill-carrie-fisher-good-kisser", "text": "Luke Skywalker is back in The Last Jedi – and it’s a triumphant return. The Star Wars actor recalls the shock of finding out about Fisher and Harrison Ford’s secret affair and the pain of losing his longtime friend\n\nHan Solo is dead and Princess Leia, heartbreakingly, died almost a year ago, when Carrie Fisher died after becoming ill on a flight from London, as she was going home for Christmas. Which means, out of the original Star Wars trio, the most holy of cinematic trinities, Luke Skywalker is the last one standing. This is not how anyone expected it to end, least of all Luke himself, Mark Hamill. So, while the latest entry in the Star Wars canon, The Last Jedi, written and directed by Rian Johnson, is great fun – as exciting and inspired as its predecessor, JJ Abrams’ The Force Awakens, but a lot funnier and without all the heavy-lifting of exposition and character setup that Abrams’s film had to cram in – it is also very poignant.\n\nNo one could have foreseen Fisher’s death and, in fact, she was going to be the centre of the next movie, just as Ford was the heart of The Force Awakens, and The Last Jedi is very much Hamill’s film. But there are moments in this movie that feel, in retrospect, breathtakingly prescient. The scenes between Luke and Leia after their long separation made my throat catch. I cannot imagine what it must be like for Hamill to watch them, his last on-screen moments with the woman who, for 40 years, was his on-screen sister and his off-screen friend.\n\n“It’s devastating and I still haven’t come to terms with it,” he says, when we meet in a hotel in central London, hours before the UK premiere. “Gosh darn it, I still think of her in the present tense, you know? If she were here right now, she’d be behind you giving you bunny ears and me the middle finger because she was all about having fun all the time. Whenever I was on set, I would go straight to her trailer with my dog and hang out with her and her dog.”\n\nFacebook Twitter Pinterest Hamill with Carrie Fisher in the first Star Wars film in 1977. Photograph: Pi/Rex/Shutterstock\n\nHamill and Fisher bonded almost instantly when they met, after being cast in Star Wars, and Hamill suggested the two of them go out for supper to get to “know each other a bit”. Within 10 minutes, Fisher, who would become one of Hollywood’s consummate memoirists, was telling him such intimate details about her father Eddie Fisher’s infamous affair with Elizabeth Taylor that Hamill felt the hairs on his arms stand up.\n\nShortly before she died, Fisher published her memoir about making the Star Wars movies, in which she revealed that she had had an intense and rather tragic affair with Ford, when she was 19 and riddled with insecurities, and he was 33 and married. Did Hamill know what was going on?\n\n“Marcia [Lucas, Star Wars’ editor and George Lucas’s then wife] told me after we finished filming. I’m glad I didn’t know before, as it probably really would have affected me. By the time I found out, I just thought it was hilarious. But you know men – even if we don’t want to have a relationship, it’s just in our nature to jockey for affection,” he says.\n\nBut it sounds like there was some jockeying going on anyway, even if neither of the men was aware of the game. It turns out that Fisher kept one last secret.\n\n“Carrie and I were attracted to one another, but I knew from previous jobs that it would have been a bad idea [to get involved with someone on set]. But Carrie and I found pretexts. I remember one time – I’m sure alcohol was involved – we were talking about kissing techniques. I said: ‘Well, I think I’m a fairly good kisser. I like to let the women come to me rather than be aggressive.’ And she said: ‘What do you mean?’ Well, next thing you know we’re making out like teenagers!”\n\nWait a minute. Luke and Leia – got it on? During the filming of the first Star Wars?\n\nFacebook Twitter Pinterest Hamill as Luke Skywalker in the latest in the canon, Star Wars: The Last Jedi. Photograph: John Wilson/AP\n\n“Oh, yeah! Are you kidding me? We were all over each other!” he cackles. “But the one thing that drew Carrie and me back from the precipice was we kind of became aware of what we were doing and just burst out laughing. Which was unfortunate for me because the rocket launch sequence had been initiated,” he grins. And just like that, I spit my water all over Luke Skywalker’s knee.\n\nWhereas in his 70s youth, Hamill, who was born and raised in California, was bright-eyed and blond, like Björn Borg’s earnest younger brother, he now has a handsome grizzle to him, with a rather endearing paunch. He is a little shambly and a lot rambly, and where he once looked callow, he now looks kind. Which he is, urging me to have the comfortable armchair while he takes the desk chair and sweetly encouraging my hackneyed Star Wars analogies about Donald Trump and Darth Vader, all of which he must have heard a million times before. (Hamill is a very vocal Trump critic, a fighter in the resistance both on and off-screen.)\n\nHe is a testament to the value of the quieter life: while Ford and Fisher went on to become Hollywood superstars, and had the requisite Hollywood divorces along the way, Hamill lives with his wife of 40 years and their three children in a house in Malibu, and he looks happy and healthy. While he has done theatre and voiceover work, including playing the Joker in Batman: the Animated Series, he is only known, really, for one movie character, and he is good with that. Ford generally looks as if he would rather have a root canal without anaesthetic than talk about Star Wars, but Hamill is as much of a nerd as the fans, and could talk about it all day. Yet our conversation keeps going back to Fisher.\n\nAfter they got their make out session “out of our system”, he says, they became lifelong friends.\n\nFacebook Twitter Pinterest Hamill with Yoda in Star Wars – The Empire Strikes Back, 1980. Photograph: Allstar/Cinetext/LucasFilm\n\n“I wasn’t her best friend – she had so many friends and I’d go to parties with her and I would be the only one there I’d never heard of. But there was a comfort level that we’d achieved because she knew I wasn’t ever angling for a favour or trying to get her to introduce me to this agent or this director. We became like real siblings over the years,” he says.\n\nAnd just like siblings, they could also infuriate one another. He would occasionally accuse her of being self-centred (“Although, come on, what actor isn’t,” he concedes), while she sometimes thought he could be a bit of a stick-in-the-mud. When George Lucas told them that Disney was making another trilogy, Fisher immediately slammed her hand down on the table and announced, “I’m in!” (She then asked if there were any roles in it for her daughter, Billie Lourd, a hustling stage mom to the end.) When Lucas left the room, Hamill turned to her and hissed: “Carrie! Poker face!”\n\n“But, as usual, she was miles ahead of me because she said to me: ‘Mark, what kind of roles do you think there are in Hollywood for women over 50?’ And I thought: ‘She’s right again.’ Women have it so much harder,” he says.\n\nAs time has passed, it has become only more apparent how much Hamill, Fisher and Ford resemble their Star Wars characters. “George [Lucas] casts people who are so close to what he wants so he doesn’t have to go in and do a lot of backstory and motivation,” Hamill says. “Carrie was Hollywood royalty, Harrison had been around and was” – he now breaks off to do a bang-on imitation of a grumpy and mumbling Ford – “an excellent eye-roller. And I was bright and bouncy, and fairly clueless.”\n\nBut when they were cast, it was Hamill who was seen as the bigger star as he had more acting experience. So, whereas Ford got a grand total of $10,000 for Star Wars, Hamill got $650,000 plus 0.025% of the movie’s profits (which presumably explains the massive Malibu house). Forty years later, when they reunited for The Force Awakens, their pay cheques reflected how the situation had changed: Ford reportedly got $25m plus 0.5% of the profit and Hamill got what was described as “a low seven-figure salary”.\n\nThe general theory about why Hamill’s career didn’t take off the way many expected after Star Wars is that directors couldn’t see past Luke Skywalker. When he asked Miloš Forman if he could audition to play Amadeus, after having played the role on stage, Forman laughed and – according to Hamill, who does a very funny imitation of the Czech director – said: “No, no, no! Because the people are not to be believing that the Luke Skywalker is the Mozart!” And yet the people are to be believing that the Han Solo is anyone he wants to be. Surely Hamill must have found this infuriating?\n\nFacebook Twitter Pinterest Hamill in Star Wars, 1977. Photograph: Allstar/LucasFilm\n\n“Well, it is what it is. It’s been so illuminating to me that I don’t need the spotlight, you know, and the bows and all that. I was just grateful to get the opportunities,” he shrugs.\n\nReally?\n\n“Sure! I look at how Star Wars has become a part of the pop culture and it is just astonishing to me. People tell me stories about getting through their mother’s terminal illness or naming their kids Luke and Leia and I’m just taken aback at how it’s inspired people,” he says with so much wide-eyed sweetness that I actually believe him.\n\nBut being known for one character has made Hamill, understandably, protective of the franchise. Although he knows it now has to be handed down to the younger generation, the “irrational side” of him winces a little: “Once I was the orphan discovering hidden powers, but that’s someone else now. I was the cocky pilot, but they got that covered, too. Once I was sneaking around in enemy territory, now it’s other characters. It’s not rational, but I feel like a bunch of strangers are rummaging around in my toy box, playing with my toys,” he says.\n\nGiven that he is now acting in movies written by Johnson and Abrams, who were kids when the original movies came out, does he feel as if he is acting in their fan fiction?\n\n“Yeah, kinda!” he laughs. “I said to Rian: ‘I’m sure 30 years ago you were playing with little figures of me, making up stories on a little play set. And now here it is, writ large.’”\n\nStar Wars: The Last Jedi review – an explosive thrill-ride of galactic proportions Read more\n\nBut Johnson’s toys presumably didn’t argue back, as Hamill made a point of doing. When he first read the script, he disagreed with “almost everything” Johnson had written, starting with Luke’s self-imposed isolation on an island on the planet of Ahch-To.\n\n“Even if I was traumatised by something, I might take a year of meditation, but he would double down and come back harder. Jedis don’t give up!” he says, switching, as he often does when talking about Luke, between the first and third person. “But it’s not my story any more and I just have to accept that. And I then bonded very deeply with Rian, but I had to let him know how I felt.”\n\nYet, whether it is Johnson’s script or Hamill’s maturity, he has never been better than he is in the new movie, playing the grumpy elder statesman, alternating easily between solemnity and wisecracks. It is a truly triumphant comeback, and, given that Fisher won’t be back in the next Star Wars, it seems a safe bet that Hamill will be, although he is coy about answering. But the question makes him think, inevitably, about Fisher again.\n\n“You know, as tough and verbally caustic as she was, the way she used words as a weapon, there was also a side to her that was really vulnerable, like a little girl. And that brought out the protectiveness in me,” he says. “I was just appalled that they didn’t let it rest in peace and they were talking about her autopsy and all of that stuff. When I think of her I don’t think of her … of her … failings. I think of how triumphant she was. She could be completely infuriating, but she could also make you feel like the most important person in the world. I mean, if I’d had a relationship with her, it would have been like a full-time activity because she was too much for me in every regard: she was too creative, she was too smart. She was just the best.” And he suddenly looks completely stricken, like a brother who has lost his sister, a man who has lost his friend.\n\nStar Wars: The Last Jedi is in cinemas now", "images": ["https://i.guim.co.uk/img/uploads/2017/10/06/Hadley-Freeman,-R.png?width=300&quality=85&auto=format&fit=max&s=4d844b0898c9843e66953e28eb8b0133", "https://i.guim.co.uk/img/media/c2a42be9788c99e606d23a3463c42b23ade929d9/0_0_1806_1199/master/1806.jpg?width=300&quality=85&auto=format&fit=max&s=8e4037dec01fde0091aa0c19fbab148f", "https://i.guim.co.uk/img/media/a23aeb1f7ff20bb80f68852da17743b0e557f8ed/0_0_3504_2359/master/3504.jpg?width=300&quality=85&auto=format&fit=max&s=261bc427e9a8b4252dd03a78d6949306", "https://i.guim.co.uk/img/media/f1b504cce2df8327b03ec71f4e0faf29cd8f9cdb/0_18_4621_2772/master/4621.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ca0b62e68c0353fcf8d1c2527743987a", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Star+Wars%3A+The+Last+Jedi%2CMark+Hamill%2CCarrie+Fisher%2CHarrison+Ford%2CRian+Johnson%2CFilm%2CScience+fiction+and+fantasy+films%2CCulture%2CStar+Wars", "https://i.guim.co.uk/img/media/a3f93781f46f2d5fc5225bb80ea6977f73fd3494/0_196_2880_1728/master/2880.jpg?width=300&quality=85&auto=format&fit=max&s=c5387150189dc332ebb62e18927788f5", "https://phar.gu-web.net/count/pv.gif", "https://phar.gu-web.net/count/pvg.gif", "https://i.guim.co.uk/img/media/358ca4830d5f68c4a8f76e9da17d7347d921a805/0_0_4240_2832/master/4240.jpg?width=300&quality=85&auto=format&fit=max&s=ffd3d0623d8d0a7b05c12a9ccbec29c0", "https://i.guim.co.uk/img/media/f1b504cce2df8327b03ec71f4e0faf29cd8f9cdb/0_18_4621_2772/master/4621.jpg?width=300&quality=85&auto=format&fit=max&s=eb5e7474bad23de3193cf17233a39127"], "top_img": "https://i.guim.co.uk/img/media/f1b504cce2df8327b03ec71f4e0faf29cd8f9cdb/0_18_4621_2772/master/4621.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ca0b62e68c0353fcf8d1c2527743987a", "keywords": [], "authors": ["Hadley Freeman"], "canonical_link": "https://www.theguardian.com/film/2017/dec/14/star-wars-the-last-jedi-mark-hamill-carrie-fisher-good-kisser", "title": "Star Wars' Mark Hamill – ‘I said to Carrie Fisher: I’m a good kisser – next, we’re making out like teenagers!’", "meta_data": {"description": "Luke Skywalker is back in The Last Jedi – and it’s a triumphant return. He recalls the shock of finding out about Fisher and Harrison Ford’s secret affair and the pain of losing his longtime friend", "format-detection": "telephone=no", "HandheldFriendly": "True", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "apple-mobile-web-app-title": "Guardian", "application-name": "The Guardian", "msapplication-TileColor": "#052962", "theme-color": "#052962", "msapplication-TileImage": "https://assets.guim.co.uk/images/favicons/023dafadbf5ef53e0865e4baaaa32b3b/windows_tile_144_b.png", "author": "Hadley Freeman", "thumbnail": "https://i.guim.co.uk/img/media/f1b504cce2df8327b03ec71f4e0faf29cd8f9cdb/0_18_4621_2772/master/4621.jpg?width=620&quality=85&auto=format&fit=max&s=bd0ec6e59e511cd5f059206bb371112e", "keywords": "Star Wars: The Last Jedi,Mark Hamill,Carrie Fisher,Harrison Ford,Rian Johnson,Film,Science fiction and fantasy films,Culture,Star Wars", "news_keywords": "Star Wars: The Last Jedi,Mark Hamill,Carrie Fisher,Harrison Ford,Rian Johnson,Film,Science fiction and fantasy films,Culture,Star Wars", "og": {"url": "http://www.theguardian.com/film/2017/dec/14/star-wars-the-last-jedi-mark-hamill-carrie-fisher-good-kisser", "image": "https://i.guim.co.uk/img/media/f1b504cce2df8327b03ec71f4e0faf29cd8f9cdb/0_18_4621_2772/master/4621.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ca0b62e68c0353fcf8d1c2527743987a", "description": "Luke Skywalker is back in The Last Jedi – and it’s a triumphant return. He recalls the shock of finding out about Fisher and Harrison Ford’s secret affair and the pain of losing his longtime friend", "type": "article", "title": "Star Wars' Mark Hamill – ‘I said to Carrie Fisher: I’m a good kisser – next, we’re making out like teenagers!’", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/hadleyfreeman", "publisher": "https://www.facebook.com/theguardian", "section": "Film", "published_time": "2017-12-15T07:23:09.000Z", "tag": "Star Wars: The Last Jedi,Mark Hamill,Carrie Fisher,Harrison Ford,Rian Johnson,Film,Science fiction and fantasy films,Culture,Star Wars", "modified_time": "2018-12-03T15:16:16.000Z"}, "al": {"ios": {"url": "gnmguardian://film/2017/dec/14/star-wars-the-last-jedi-mark-hamill-carrie-fisher-good-kisser?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287, "pages": 516977308337360}, "twitter": {"app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"ipad": "gnmguardian://film/2017/dec/14/star-wars-the-last-jedi-mark-hamill-carrie-fisher-good-kisser?contenttype=Article&source=twitter", "googleplay": "guardian://www.theguardian.com/film/2017/dec/14/star-wars-the-last-jedi-mark-hamill-carrie-fisher-good-kisser", "iphone": "gnmguardian://film/2017/dec/14/star-wars-the-last-jedi-mark-hamill-carrie-fisher-good-kisser?contenttype=Article&source=twitter"}}, "image": "https://i.guim.co.uk/img/media/f1b504cce2df8327b03ec71f4e0faf29cd8f9cdb/0_18_4621_2772/master/4621.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=d020b242dd23c95151fa9bceaf57f91b", "site": "@guardian", "card": "summary_large_image", "creator": "@HadleyFreeman", "dnt": "on"}, "robots": "max-image-preview:large"}, "movies": [], "publish_date": 1513180800.0, "source": "https://www.theguardian.com", "summary": ""}