{"url": "https://www.glamourmagazine.co.uk/article/makeup-worn-by-celebs-red-carpet", "text": "All products are independently selected by our editors. If you buy something, we may earn an affiliate commission.\n\nNo matter what award show it is, the beauty desk at GLAMOUR UK is always waiting with baited breath to see the jaw-dropping hair and makeup looks. Last night's Oscars were no exception.\n\nFrom punchy red-pink lips to sleek updos and shimmery smoky eyes, the red carpet inspiration keeps us going long after the show is over. And thanks to the makeup artists and hair stylists Instagramming behind-the-scenes, we know exactly what products have been used on our favourite faces...\n\nOscars 2018: The red carpet moments that took our breath away Fashion Oscars 2018: The red carpet moments that took our breath away\n\nAdvertisement\n\nEmma Stone's rosy glow\n\nWhen? 2018 Oscars\n\nRead next Spike Lee touchingly paid tribute to Kobe Bryant with his Oscars suit Oscars Spike Lee touchingly paid tribute to Kobe Bryant with his Oscars suit RIP.\n\nEmma was all flushed and pretty in pink for the Oscars, with a navy liner used for subtle definition on the eyes. But the real jaw-dropper was when makeup artist Rachel Goodwin made us go ga-ga over the pretty cheek palette used – a newbie from Nars – Wanted Blush. Feast your eyes...\n\nAdvertisement\n\nTaraji P. Henson's badass lip look\n\nWhen? 2018 Oscars\n\nTaraji looked fierce in a keyhole black gown, but it was the lip look that had us quickly Googling who her makeup artist was. Ashunta Sheriff provided the goods, revealing that she mixed two shades from The Lip Bar together – Liquid Matte Creme in Savage and Drama Queen. And of course, Vaseline's Intensive Care Cocoa Radiant Lotion, £5.99, was used to give her skin that extra glow.\n\nRead next Priyanka Chopra paid tribute to NBA star Kobe Bryant with this subtle, sentimental nail art Priyanka Chopra Priyanka Chopra paid tribute to NBA star Kobe Bryant with this subtle, sentimental nail art Subtle tributes.\n\nElizabeth Moss's punchy pink lip\n\nWhen? 2018 Oscars\n\nAdvertisement\n\nElizabeth Moss was all class in a rose gold sequinned gown but turned up the heat with a hot fuschia lip. We spotted the bullet via makeup artist's Daniel Martin's Instagram, and our guess is Dior's Addict Lacquer Stick, in Diablo 684, £27.50.\n\nRita Ora's vampy lip\n\nWhen? 2018 GRAMMY Awards\n\nTrust our London-look girl Rita Ora to be wearing Rimmel on the red carpet. Her make-up artist revealed the product behind her perfect purple-red lip – Stay Matte Liquid Lip Colour in 810 Plum This Show £5.99.\n\nRead next A £12 nail polish, a £13 eye liner and an £8 shine mist: Here are the secret Grammy Awards 2020 beauty products used by the pros Grammy Awards A £12 nail polish, a £13 eye liner and an £8 shine mist: Here are the secret Grammy Awards 2020 beauty products used by the pros We virtually rifle through their makeup bags...\n\nThe GRAMMYs 2018 hair and makeup looks that left us speechless Grammy Awards The GRAMMYs 2018 hair and makeup looks that left us speechless\n\nBeyoncé's skin & makeup\n\nWhen? 2018 GRAMMY Awards\n\nWe all want to be using the same products as Queen Bey and this flatlay from her makeup artist Sir Jon gets us pretty close. We can spot 24k Gold Hydra-Gel Eye Patches £53 Peter Thomas Roth, Lumi Glotion (yet to be released in the UK) L'Oréal Paris, Rouge Pur Couture £28 YSL (our guess is the shade Le Nu) Cloud Paint £15 and Boy Brow £28 from Glossier – and makeup brushes by NARS.\n\nRead next Billy Porter gave 'light shade' & Nick Jonas had something in his teeth. Here are the best viral moments from the Grammys 2020... Entertainment Billy Porter gave 'light shade' & Nick Jonas had something in his teeth. Here are the best viral moments from the Grammys 2020... The hilarious, the emotional and the down-right awkward...\n\nGRAMMYs 2018: Everything you need to know - including the winners, best dressed and stand-out performances Grammy Awards GRAMMYs 2018: Everything you need to know - including the winners, best dressed and stand-out performances\n\nLady Gaga's starry night makeup\n\nWhen? 2018 GRAMMY Awards\n\nLady Gaga's dark, shimmery eye makeup had us floored. The genius behind her statement eye was makeup artist Sarah Nicole Tanno, who blessed us with the full product list on her Instagram.\n\nHero products? Highliner Gel Crayon\n\n£20 in Blaquer, Magic Marc'er £23 in Blaquer, Glambition Eyeconic palette £39, Edgitorial palette £39, Velvet Noir mascara £22 – all from Marc Jacobs – and loose silver glitter from Lit.\n\nRead next Lana Del Rey purchased her Grammy awards dress from an actual mall & is joined by her police officer BF Lana Del Rey Lana Del Rey purchased her Grammy awards dress from an actual mall & is joined by her police officer BF We stan\n\nWatch all the best performances from the 2018 GRAMMYs Grammy Awards Watch all the best performances from the 2018 GRAMMYs\n\nMargot Robbie's nude lipstick\n\nWhen? 2018 SAG Awards\n\nMargot's soft and simple look at the SAGs was absolutely flawless. If, like us, you need that nude lipstick in your makeup bag asap, it's Rouge Allure Luminous Intense Lip Colour £28 Chanel – in the shade 174 Rouge Angelique. You can thank Pati Dubroff, Margot's makeup artists for sharing the shade via her Instagram.\n\nNicole Kidman's lips and lashes\n\nWhen? 2018 SAG Awards\n\nRead next Camila Cabello wore a necklace worth £1.5 million with an £11 foundation to the Grammys Grammy Awards Camila Cabello wore a necklace worth £1.5 million with an £11 foundation to the Grammys Give me diamonds and a discount.\n\nNicole Kidman had a certain glow about her at this year's SAG awards, featuring a berry pout and fully loaded lashes. The lip colour in question turned out to be Neutrogena's Hydro Boost Hydrating Lip Shine in Velvet Wine and the mascara was also Neutrogena - a new product called the Hydro Boost Plumping Mascara. Both are yet to launch in the UK, but fingers crossed these affordable buys will make it to our shores soon.\n\nMargot Robbie's lip colour\n\nWhen? 2018 Golden Globes\n\nMakeup artist Pati Dubroff mixed two shades of lipstick to create Margot's perfect pout: Rouge Allure Velvet Luminous Matte Lip Colour in La Sensuelle and La Romanesque £28 Chanel.\n\nAlessandra Mastronardi's eyes and cheeks\n\nWhen? 2018 Golden Globes\n\nMakeup artist Kate Lee shared her smokey eye technique with her followers. She used Stylo Yeux Water-Proof Long-Lasting Eyeliner in Ardroise £19 Chanel to line the upper and lower waterline, and Les 9 Ombres Eyeshadow in Alfresco Chanel (not yet available in the UK) to blend into the eye socket. She finished with a flush of colour on the cheeks using Rouge Coco Lip Blush in Tender Rose Chanel.\n\nRead next Billie Eilish, Lizzo & Michelle Obama (yes, REALLY!) just won Grammy 2020 Awards. Here's the full list of winners in an epic year for women Grammy Awards Billie Eilish, Lizzo & Michelle Obama (yes, REALLY!) just won Grammy 2020 Awards. Here's the full list of winners in an epic year for women Who run the world? Girls.\n\nGal Gadot's lip colour\n\nWhen? 2018 Golden Globes\n\nGal wowed us with her bold lashes, chic updo and berry lip. The latter of which you can pick up for under eight quid at Boots. Makeup artist Sabrina Bedrani told Allure, she used Super Lustrous Lipstick in Bombshell Red £7.49 Revlon, saying: \"Instead of being a classic red, this is like deeper — almost like a wine — red. It felt more modern and fresh.\"\n\nREX\n\nEmma Stone's lilac pout\n\nWhen? 2018 Golden Globes\n\nEmma's makeup artist, Rachel Goodwin, posted a stunning photo of the actress before she hit the red carpet, sending followers mad with the same question: \"what shade of lipstick did you use?\". Turns out it was Audacious Lipstick in Dominique £26 NARS.\n\nIssa Rae's full face\n\nWhen? 2018 Golden Globes\n\nIssa's skin looked absolutely flawless thanks to makeup artist, Joanna Simkin. Speaking to Allure, Joanna explained how she created the actress's glowing look, starting with Vitalist Foundation in Soft Sable Covergirl, \"I love how moist the foundation looks on her.\"\n\nFor Issa's eyes, she used Aubergine from the TruNaked Roses Palette and Jet from the TruNaked Smoky Palette, finishing with Melting Pouts Metallic in Unlpugged on the lips – all Covergirl.\n\nAdvertisement\n\nZuri Hall's fierce look\n\nWhen? 2018 Golden Globes\n\nZuri's amazing electric blue eyeshadow was thanks to a Stila Cosmetics palette, as revealed by her makeup artist Niki Metz on Instagram. Her base was perfected using Fenty foundation and a Sephora lip colour gave the finishing glossy touch.", "images": ["https://gl-images.condecdn.net/image/jyLZ5gz7MEq/crop/200/square/f/sp20_digital_mu_dwsiplifestylestills_f_main_0157_1080x1080_sq.jpg", "https://gl-images.condecdn.net/image/dWEeD7D74Gq/crop/200/square/f/1567637093-class_hero_no_gradient_l_sf_sq.jpg", "https://gl-images.condecdn.net/image/MrQByeOzvXq/crop/200/square/f/gettyimages-1202191268_sq.jpg", "https://gl-images.condecdn.net/image/mz6JL7p7747/crop/200/square/f/gettyimages-1202155352_sf_sq.jpg", "https://gl-images.condecdn.net/image/mM9LVVAl1M7/crop/405/f/zuri-hall_glamour_7jan18_gettyimages-902326710_p.jpg", "https://gl-images.condecdn.net/image/QvMkezZEEQ9/crop/200/square/f/gettyimages-1202156006_sf.jpg", "https://gl-images.condecdn.net/image/4JM4Me0y3Vw/crop/200/square/f/bruno-mars_glamour_29jan18_gettyimages-911550272_l.jpg", "https://gl-images.condecdn.net/image/keAbzJlR17e/crop/200/square/f/gettyimages-1202157108_sf.jpg", "https://gl-images.condecdn.net/image/LRDRZD6b5Ko/crop/200/square/f/shutterstock_editorial_10550156fq_sq.jpg", "https://gl-images.condecdn.net/image/b5VrGl3pkAD/crop/200/square/f/gettyimages-1202147634_sf_sq.jpg", "https://gl-images.condecdn.net/image/bAqvEKGp5bL/crop/200/square/f/priyanka-chopra-kobe-bryant-grammys-glamour-27th-jan-2020-square.jpg", "https://gl-images.condecdn.net/image/qw3b31BZOaJ/crop/200/square/f/rihanna_glamour_29jan18_gettyimages-911538872_l.jpg", "https://gl-images.condecdn.net/image/YkY607Ra8Pa/crop/405/f/gal-gadot_glamour_8jan18_gettyimages-902349090_p.jpg", "https://gl-images.condecdn.net/image/nZDP1nKaGJE/crop/200/square/f/shutterstock_editorial_10552749as_sf.jpg", "https://gl-images.condecdn.net/image/8RkJxBXGXVk/crop/1440/0.5235602094240838/f/rachelgoodwinmakeup_glamour_5mar18_insta_sq.jpg", "https://gl-images.condecdn.net/image/9rQ7PG31Yjw/crop/200/square/f/img_3929.jpg", "https://gl-images.condecdn.net/image/1bpdZMmopvP/crop/200/square/f/screen.jpg", "https://gl-images.condecdn.net/image/ynZXK1Qwy4y/crop/200/square/f/jennifer-lawrence_glamour_5mar18_rexfeatures_9446174ef_l.jpg", "https://www.glamourmagazine.co.uk/static/img/tiny.gif", "https://gl-images.condecdn.net/image/ZmjwbwWqR77/crop/200/square/f/hailee_glamour_29jan18_gettyimages-911502822_l.jpg"], "top_img": "https://gl-images.condecdn.net/image/8RkJxBXGXVk/crop/1440/0.5235602094240838/f/rachelgoodwinmakeup_glamour_5mar18_insta_sq.jpg", "keywords": [], "authors": ["Samantha Mcmeekin", "Monday March", "Sagal Mohammed", "In Partnership With", "Estée Lauder"], "canonical_link": "https://www.glamourmagazine.co.uk/article/makeup-worn-by-celebs-red-carpet", "title": "The exact makeup products worn by celebrities on the red carpet", "meta_data": {"description": "Makeup products worn by celebs on the 2018 red carpets. Featuring all the star's favourite products, from Margot Robbie's two lipstick shades to Gal Gadot's pharmacy brand pout...", "GENERATOR": "Macromedia Dreamweaver", "viewport": "width=device-width, initial-scale=1", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Glamour UK", "apple-mobile-web-app-status-bar-style": "translucent black", "application-name": "Glamour UK", "og": {"site_name": "Glamour UK", "locale": "en_GB", "title": "The exact makeup products worn by celebrities on the red carpet", "url": "https://www.glamourmagazine.co.uk/article/makeup-worn-by-celebs-red-carpet", "type": "article", "article": {"publisher": 103165711773}, "description": "The NARS palette used on Emma Stone is insanely pretty...", "image": "https://gl-images.condecdn.net/image/8RkJxBXGXVk/crop/1440/0.5235602094240838/f/rachelgoodwinmakeup_glamour_5mar18_insta_sq.jpg"}, "fb": {"app_id": 589577624418454, "pages": 103165711773}, "twitter": {"site": "@GlamourMagUK", "account_id": 34258758, "title": "The exact makeup products worn by celebrities on the red carpet", "card": "summary_large_image", "description": "The NARS palette used on Emma Stone is insanely pretty...", "image": "https://gl-images.condecdn.net/image/8RkJxBXGXVk/crop/810/landscape/f/rachelgoodwinmakeup_glamour_5mar18_insta_sq.jpg"}, "theme-color": "#000", "article": {"section": "Grammy Awards", "tag": "Grammy Awards,Golden Globes,Celebrity Beauty,Award Season,Red Carpet,Makeup,Beauty"}, "author": "Samantha McMeekin", "snippet": {"image": "https://gl-images.condecdn.net/image/8RkJxBXGXVk/crop/405/0.75/f/rachelgoodwinmakeup_glamour_5mar18_insta_sq.jpg"}}, "movies": [], "publish_date": null, "source": "https://www.glamourmagazine.co.uk", "summary": ""}