{"url": "www.theguardian.com/world/2018/jun/17/fathers-day-gift-jay-z", "text": "Can growing up without a father be a gift? That’s how Jay-Z counterintuitively described it, in his autobiography. “We were kids without fathers … and in a way, that was a gift,” the rapper and businessman writes in Decoded. “We got to pick and choose the ancestors who would inspire the world we were going to make for ourselves.”\n\nLow-income black fathers want to be good dads. The system won't let them | Kirk E Harris Read more\n\nIf you choose the right inspirations, growing up without a dad can be a gift. But, as the title of Jay-Z’s album Blueprint 2: The Gift and the Curse suggests, there’s a flip side. Many of us who spend Father’s Day wishing we had somebody to celebrate with haven’t chosen the right influences as substitutes. We might not be making many choices at all.\n\nI grew up without a father regularly in my life. I would leave my mom’s house every morning searching for what was missing at home – the role models who could show me how to be a man. Like many kids in the same situation – and many of my peers were fatherless – I found those role models on television and in music.\n\nJay-Z was one of them: the pre-Beyoncé Jay-Z of the late 1990s and early 2000s, big pimpin’ and trading disses with fellow New York rapper Nas. His tough-guy bravado, glorification of crime, flashy jewelry and videos full of dancing women captivated me. I tried my best to emulate him and other rappers. My friends and I wanted to use drugs and thought selling them was cool; we got into fights, skipped classes and in some cases dropped out altogether. Studying seemed boring when compared with the gangster fairytales we shared. Delayed gratification, which is vital to living life with long-term benefits in mind, was a foreign concept.\n\nMy father didn’t know how to be a husband to my mom or a dad to me. He had no examples from his past or his present\n\nI have no interest in blaming Jay-Z – or any other man – for playing a role in my life he didn’t ask for. My father uniquely carried the responsibility of setting an example for me. But he, too, had fallen to the curse of fatherlessness. Born an orphan in Kenya, he was re-orphaned at 14 when his adoptive parents passed away. He persevered, working his way from an apprentice at the Hilton Hotel in Nairobi to a chef at the Hilton Hotel in London by the time he was 21. When the time came for him to have a family of his own, however, the curse caught up with him. He didn’t know how to be a husband to my mom or a dad to me. He had no examples from his past or his present to provide guidance. Unlike the years my father spent training with other chefs to learn how to succeed in the kitchen, he had no role models to show him how to be a family man. It didn’t take long for my father to give up and disappear.\n\nMy family is not alone in experiencing the curse of growing up without a dad in the house. Fatherless children are more likely to use drugs or alcohol, repeat grades in school, become teenage parents, go to prison and engage in criminal or other delinquent behaviours. A 2013 literature review by researchers from Princeton, Cornell and Berkeley universities concluded: “We find strong evidence that father absence negatively affects children’s social-emotional development, particularly by increasing externalizing behavior [such as aggression and attention seeking].” The review also notes these affects may be more pronounced for boys than girls.\n\n\n\nEvidently, it’s not easy to fill the void – but even easier to find the wrong influences. Kids today are exposed to a much broader range of media technologies than I was in the 1990s through which to find examples for what a “man” is. Online communities formed through social media and discussion boards can exert their own kind of masculine peer pressure: incel (“involuntarily celibate”) culture, which became the subject of international media coverage after this year’s mass murders in Parkland, Florida, and my hometown, Toronto, is an example of how young men can develop resentful, angry and self-victimizing masculine identities while having these identities reinforced by an online peer group.\n\nFacebook Twitter Pinterest Barack Obama greets attendees at a My Brother’s Keeper Summit in Washington, in 2016. Photograph: Yuri Gripas/Reuters\n\nAs president, Barack Obama made it a priority to deliberately and strategically steer vulnerable young men away from the negative influences that affect fatherless kids. His initiative My Brother’s Keeper (MBK) galvanized foundations, businesses, local governments and community groups to promote a milestones-based example for young men to follow, including reading at grade level by grade three, attending postsecondary education and staying out of the criminal justice system.\n\nMBK offered a way to identify healthy role models at different stages of a young man’s life without being overly exclusive in defining who and what a man can be. MBK was renamed just before Obama left the White House and seems to have gone quiet as a federal government initiative. It continues as a non-governmental organization.\n\nMy search for role models wasn’t as deliberate or strategic as Obama advocates for, but after years of trial and error I was able to find positive role models in community college and then university. In particular, professors showed me how learn to read and write effectively, built my self-esteem and encouraged me to find new peer groups. Professors also connected me with role models in books, such as Martin Luther King Jr, Malcolm X, Booker T Washington, Marcus Garvey and WEB Du Bois, who demonstrated the diversity of ways men can and do exist in the world. With the right support, not having a dad became an opportunity for me to choose positive inspirations.\n\nKnowing that others are fighting a legacy of fatherlessness in their own lives motivates me to continue believing\n\nA few weeks into my first semester at Yale law school, Jay-Z published his autobiography. It turned out he had transformed over the same period of time I had. In an interview about his book, he recalled the lyrics to one of his songs that I loved as a kid (Big Pimpin’) and confessed: “I can’t believe I said that. And kept saying it. What kind of animal would say this sort of thing?”\n\nToday, Jay-Z’s example as a husband and father, detailed in last year’s album 4:44, helps me when thinking about how to be a good partner to my girlfriend and a good father figure to her son, responsibilities for which I often feel deeply unprepared. Knowing that others are fighting a legacy of fatherlessness in their own lives motivates me to continue believing, trying and learning.\n\n\n\nFor those of us lucky enough to eventually see growing up without a dad as a positive opportunity, the challenge remains for us to help more fatherless kids find life’s gifts and escape its curses.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Father%27s+Day%2CCanada%2CJay-Z%2CLife+and+style", "https://i.guim.co.uk/img/media/e4dbf938b8ef22490460dda43bc34d9c0afeba58/0_152_4380_2627/master/4380.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=49d361f3c9096bdca4fba1da8660b0a0", "https://i.guim.co.uk/img/media/e4dbf938b8ef22490460dda43bc34d9c0afeba58/0_152_4380_2627/master/4380.jpg?width=300&quality=85&auto=format&fit=max&s=90e38734631b95062e28b4b0b6e09121", "https://i.guim.co.uk/img/media/4e4208f8de2d8fe1940626fad69084c5bb12e512/0_60_3500_2101/master/3500.jpg?width=300&quality=85&auto=format&fit=max&s=0e4a19561b7162d83e950a44ce27f487", "http://phar.gu-web.net/count/pvg.gif", "http://phar.gu-web.net/count/pv.gif"], "top_img": "https://i.guim.co.uk/img/media/e4dbf938b8ef22490460dda43bc34d9c0afeba58/0_152_4380_2627/master/4380.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=49d361f3c9096bdca4fba1da8660b0a0", "keywords": [], "authors": ["Jamil Jivani"], "canonical_link": "https://www.theguardian.com/world/2018/jun/17/fathers-day-gift-jay-z", "title": "Can growing up without a father be a gift? Jay-Z thinks so", "meta_data": {"description": "For boys trying to learn to be men, the rapper and businessman’s autobiography can provide a guide", "format-detection": "telephone=no", "HandheldFriendly": "True", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "apple-mobile-web-app-title": "Guardian", "application-name": "The Guardian", "msapplication-TileColor": "#052962", "theme-color": "#052962", "msapplication-TileImage": "https://assets.guim.co.uk/images/favicons/023dafadbf5ef53e0865e4baaaa32b3b/windows_tile_144_b.png", "thumbnail": "https://i.guim.co.uk/img/media/e4dbf938b8ef22490460dda43bc34d9c0afeba58/0_152_4380_2627/master/4380.jpg?width=620&quality=85&auto=format&fit=max&s=3a959c9a2cf51125ffc5036a02647075", "keywords": "Father's Day,Canada,Jay-Z,Life and style", "news_keywords": "Father's Day,Canada,Jay-Z,Life and style", "og": {"url": "http://www.theguardian.com/world/2018/jun/17/fathers-day-gift-jay-z", "image": "https://i.guim.co.uk/img/media/e4dbf938b8ef22490460dda43bc34d9c0afeba58/0_152_4380_2627/master/4380.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=49d361f3c9096bdca4fba1da8660b0a0", "description": "For boys trying to learn to be men, the rapper and businessman’s autobiography can provide a guide", "type": "article", "title": "Can growing up without a father be a gift? Jay-Z thinks so", "site_name": "the Guardian"}, "article": {"author": "Jamil Jivani", "publisher": "https://www.facebook.com/theguardian", "section": "World news", "published_time": "2018-06-17T12:30:02.000Z", "tag": "Father's Day,Canada,Jay-Z,Life and style", "modified_time": "2018-06-18T15:04:45.000Z"}, "al": {"ios": {"url": "gnmguardian://world/2018/jun/17/fathers-day-gift-jay-z?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287, "pages": 516977308337360}, "twitter": {"app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"ipad": "gnmguardian://world/2018/jun/17/fathers-day-gift-jay-z?contenttype=Article&source=twitter", "googleplay": "guardian://www.theguardian.com/world/2018/jun/17/fathers-day-gift-jay-z", "iphone": "gnmguardian://world/2018/jun/17/fathers-day-gift-jay-z?contenttype=Article&source=twitter"}}, "image": "https://i.guim.co.uk/img/media/e4dbf938b8ef22490460dda43bc34d9c0afeba58/0_152_4380_2627/master/4380.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=21a59499401828c1c17a88c57d5cd693", "site": "@guardian", "card": "summary_large_image", "dnt": "on"}, "robots": "max-image-preview:large"}, "movies": [], "publish_date": 1529164800.0, "source": "http://www.theguardian.com", "summary": ""}