{"url": "https://www.bbc.com/news/world-us-canada-40108959", "text": "Image copyright CNN Image caption Kathy Griffin and Anderson Cooper have co-hosted CNN's New Year programme for years\n\nUS broadcaster CNN has ditched a comedienne from its New Year programme after she posed with a fake decapitated head of President Donald Trump.\n\n\"CNN has terminated our agreement with Kathy Griffin to appear on our New Year's Eve program\" it said in a tweet.\n\nGriffin apologised after it provoked outrage - her New Year's Eve co-host Anderson Cooper said he was appalled.\n\nMr Trump had said it was \"sick\" and his wife Melania called the photo \"disturbing\".\n\n\"Kathy Griffin should be ashamed of herself,\" said the president. \"My children, especially my 11 year old son, Barron, are having a hard time with this.\"\n\nIn a video message posted on Twitter, Griffin \"begged\" for forgiveness and said she had \"crossed a line\".\n\nThe 56-year-old Emmy award-winner said she was asking celebrity photographer Tyler Shields to delete the photo from the internet.\n\nImage copyright Tyler Shields Image caption The image sparked outrage\n\nThe gruesome image brought a storm of online criticism, including from Chelsea Clinton, daughter of Mr Trump's 2016 election rival Hillary.\n\n\"It is never funny to joke about killing a president,\" she tweeted.\n\nFirst Lady Melania Trump said it made her \"wonder about the mental health of a person who did it,\" she said in a statement, according to NBC News.\n\nImage copyright Getty Images Image caption \"As a mother, a wife, and a human being, that photo is very disturbing,\" said First Lady Melania Trump, pictured here with son Barron\n\nFormer Republican presidential candidate Mitt Romney also chimed in, tweeting: \"Our politics have become too base, too low, & too vulgar, but Kathy Griffin's post descends into an even more repugnant & vile territory.\"\n\nMr Trump's son, Donald Trump Jr, tweeted: \"Disgusting but not surprising. This is the left today. They consider this acceptable.\"\n\nImage copyright Twitter\n\nGriffin, who has been a staunch critic of President Trump, posted the image in a tweet on Tuesday.\n\nShe added the comment: \"I caption this: 'There was blood coming out of his eyes, blood coming out of his … wherever.'\"\n\nAs it became clear not everyone found it funny, she tweeted again: \"OBVIOUSLY, I do not condone ANY violence by my fans or others to anyone, ever! I'm merely mocking the Mocker in Chief.\"\n\nImage copyright Getty Images Image caption Kathy Griffin has been a staunch critic of President Trump\n\nIn her video apology, she said: \"I'm just now seeing the reaction of these images. I'm a comic, I crossed the line. I moved the line and then I crossed it. I went way too far.\n\n\"The image is too disturbing. I understand how it affects people. It wasn't funny, I get it. I beg for your forgiveness.\"\n\nImage copyright Twitter\n\nOne company has already cut ties with Griffin.\n\nThe Utah-based makers of Squatty Potty toilet stools said they were cancelling an ad campaign featuring the comic because of the \"deeply inappropriate\" image.\n\nChief executive Bobby Edwards said in a statement: \"We have acted swiftly and decisively to demonstrate our commitment to a culture of decency, civility, and tolerance.\"\n\nImage copyright Facebook Image caption Critics pointed out Mr Trump hosted a musician who called for Barack Obama to be killed\n\nUnicorn Gold bathroom products also suspended an ad campaign starring Griffin.\n\nHowever, others pointed out that Mr Trump had hosted a controversial musician who called for former President Barack Obama to be killed.\n\nTed Nugent had said President Obama should be \"tried for treason and hung\", called him a \"subhuman mongrel\" and invited him to \"suck on my machine-gun\".\n\nMr Trump welcomed Nugent to the White House in April.", "images": ["https://a1.api.bbc.co.uk/hit.xiti?&col=1&from=p&ptag=js&s=598253&p=world::us_and_canada::news.world.us_and_canada.story.40108959.page&x1=[urn:bbc:cps:3fce2b59-fc05-8c4a-b116-6266559210e4]&x2=[responsive]&x3=[bbc_website]&x4=[en]&x7=[article]&x8=[reverb-1.4.0-nojs]&x11=[NEWS_GNL]&x12=[NEWS]", "https://ssc.api.bbc.com/?c1=2&c2=19293874&ns_site=bbc&name=", "https://ichef.bbci.co.uk/news/1024/branded_news/0B85/production/_96294920_griffin_976cnn.jpg", "https://ichef.bbci.co.uk/news/320/cpsprodpb/0B85/production/_96294920_griffin_976cnn.jpg"], "top_img": "https://ichef.bbci.co.uk/news/1024/branded_news/0B85/production/_96294920_griffin_976cnn.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bbc.com/news/world-us-canada-40108959", "title": "Kathy Griffin: CNN drops comic after 'sick' Trump stunt", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Comedienne Kathy Griffin will no longer host CNN's New Year show after a severed head photo.", "x-country": "hk", "x-audience": "Asia", "CPS_AUDIENCE": "Asia", "CPS_CHANGEQUEUEID": 0, "og": {"title": "CNN drops Griffin after 'sick' Trump stunt", "type": "article", "description": "Comedienne Kathy Griffin will no longer host CNN's New Year show after a severed head photo.", "site_name": "BBC News", "locale": "en_GB", "url": "https://www.bbc.com/news/world-us-canada-40108959", "image": {"identifier": "https://ichef.bbci.co.uk/news/1024/branded_news/0B85/production/_96294920_griffin_976cnn.jpg", "alt": "BBC News. Kathy Griffin and Anderson Cooper"}}, "article": {"author": "https://www.facebook.com/bbcnews", "section": "US & Canada"}, "fb": {"pages": "1143803202301544,317278538359186,1392506827668140,742734325867560,185246968166196,156060587793370,137920769558355,193435954068976,21263239760,156400551056385,929399697073756,154344434967,228735667216,80758950658,260212261199,294662213128,1086451581439054,283348121682053,295830058648,239931389545417,304314573046,310719525611571,647687225371774,1159932557403143,286567251709437,1731770190373618,125309456546,163571453661989,285361880228,512423982152360,238003846549831,176663550714,260967092113,118450564909230,100978706649892,15286229625,122103087870579,120655094632228,102814153147070,124715648647,153132638110668,150467675018739", "app_id": 1609039196070050, "admins": 100004154058350}, "twitter": {"card": "summary_large_image", "site": "@BBCWorld", "title": "CNN drops Griffin after 'sick' Trump stunt", "description": "Comedienne Kathy Griffin will no longer host CNN's New Year show after a severed head photo.", "creator": "@BBCWorld", "image": {"src": "https://ichef.bbci.co.uk/news/1024/branded_news/0B85/production/_96294920_griffin_976cnn.jpg", "alt": "Kathy Griffin and Anderson Cooper"}, "domain": "www.bbc.com"}, "apple-itunes-app": "app-id=364147881, app-argument=https://www.bbc.com/news/world-us-canada-40108959?utm_medium=banner&utm_content=apple-itunes-app", "apple-mobile-web-app-title": "BBC News", "application-name": "BBC News", "msapplication-TileImage": "BBC News", "msapplication-TileColor": "#bb1919", "mobile-web-app-capable": "yes", "robots": "NOODP,NOYDIR", "theme-color": "#bb1919"}, "movies": [], "publish_date": null, "source": "https://www.bbc.com", "summary": ""}