{"url": "http://www.wrestling-online.com/wwe/total-divas-s7-e11-episode-recap-lets-get-naked/", "text": "This episode began with more drama For Lana and Rusev. It seems as though Lana has not learned from her previous experiences this season, and is continuing to act in ways that upset her extremely conservative husband.\n\nThis time, Rusev objected to Lana wearing a bikini while standing in their front yard in full view of the neighbors. Lana insisted that she was only trying to get a tan, but Rusev seem to think that Lana was trying to give their male neighbors a great view of her impressive body. While Lana is extremely attractive, I agree with Rusev that Lana should try to respect her husband’s feelings a little more.\n\nIn order to show Lana how it felt to have your significant others’ body on full display, Rusev mowed their lawn wearing only his underwear. This didn’t phase Lana, however, she even took a picture to post on social media. So, in order to continue to prove his point Rusev showed up to a barbecue completely nude. So, Lana had to finally admit that maybe Rusev had a point and she would try to be more respectful of him when dressing.\n\nMeanwhile, another couple had their own drama this week. In order to try to be more romantic, Naomi’s husband, WWE Superstar, Jey Uso planned a romantic getaway in their home state of Florida. He rented a large hotel suite and even hired two massage therapists to give them a couples massage.\n\nThe only problem was that Naomi was feeling sick that weekend. However, rather than inform her husband of the situation, and perhaps reschedule their getaway for another time, Naomi chose to remain at the hotel while feeling completely miserable ruining both her and her husband’s good time. Maybe it just me, but I thought a husband was supposed to love his wife in sickness and in health, which is hard for him to do if he doesn’t know about the sickness. Naomi made it up to Jey with a costumed bedroom romp.\n\nNaomi and Jey weren’t the only couple who were traveling this week. Brie Bella and her husband, Daniel Bryan were finally making their long-awaited move from Phoenix, Arizona to Aberdeen, Washington. They decided that the trip would be so much more fun if they did it road trip style renting a large RV and hiring two longtime friends of Natalya to drive them.\n\nBut it seems that the couple’s daughter, Birdie, isn’t fond of road trips. The baby refused to nap for the two-day RV stint and her parents weren’t too keen on their chauffeurs. So, Brie made the executive decision that the family should catch a flight from Sacramento to Washington. I guess that there are just some things that you can’t do with a baby in tow.\n\nAnother WWE couple will soon find out what life is like with a baby. The Miz and Maryse discovered that they are expecting at the end of this episode and a second bundle of joy added to the cast should make for plenty of drama on upcoming seasons of Total Divas.\n\nCatch the season finale next week on E!", "images": ["https://www.wrestling-online.com/News/wp-content/uploads/totaldivaslogo-576x288.jpg", "https://www.wrestling-online.com/News/wp-content/uploads/smackdown3.jpg", "https://www.wrestling-online.com/News/wp-content/uploads/totaldivas7-822x482.jpg", "https://www.wrestling-online.com/News/wp-content/uploads/728x90ios.jpg", "https://www.wrestling-online.com/News/wp-content/uploads/impactwrestling3.jpg", "https://www.wrestling-online.com/News/wp-content/uploads/totaldivas3-2-576x288.jpg", "https://secure.gravatar.com/avatar/783f152bc40602faf6c9cbba8e5dc101?s=28&d=mm&r=g", "https://www.wrestling-online.com/News/wp-content/uploads/totaldivas6-576x288.jpg", "https://www.wrestling-online.com/News/wp-content/uploads/totalbellas4.jpg", "https://www.wrestling-online.com/News/wp-content/uploads/logo.png", "https://www.wrestling-online.com/wordpress/betway300x250.jpg", "https://www.wrestling-online.com/News/wp-content/uploads/wm37.jpg", "https://www.wrestling-online.com/News/wp-content/uploads/bayley4.jpg", "https://www.wrestling-online.com/News/wp-content/uploads/totaldivas7.jpg"], "top_img": "https://www.wrestling-online.com/News/wp-content/uploads/totaldivas7.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.wrestling-online.com/wwe/total-divas-s7-e11-episode-recap-lets-get-naked/", "title": "Total Divas S7 E11 episode recap: Let’s Get Naked!", "meta_data": {"viewport": "width=device-width, initial-scale=1", "google-site-verification": "uk7jHzAx2vIt-sWt3PQ3p3ydDz-LHeQF3B_JFeLAi70", "msvalidate.01": "6009DBAA4F6CC4EB717A2739A0567C06", "generator": "Powered by WPBakery Page Builder - drag and drop page builder for WordPress.", "og": {"type": "article", "title": "Total Divas S7 E11 episode recap: Let’s Get Naked!", "url": "https://www.wrestling-online.com/wwe/total-divas-s7-e11-episode-recap-lets-get-naked/", "description": "This episode began with more drama For Lana and Rusev. It seems as though Lana has not learned from her previous experiences this season, and is continuing to act in ways that upset her extremely c…", "site_name": "Wrestling-Online.com", "image": {"identifier": "https://www.wrestling-online.com/News/wp-content/uploads/totaldivas7.jpg", "width": 1024, "height": 600}, "locale": "en_US"}, "article": {"published_time": "2018-01-26T19:42:17+00:00", "modified_time": "2018-01-26T19:42:40+00:00"}, "twitter": {"widgets": {"link-color": "#000000", "border-color": "#000000"}, "partner": "tfwp", "card": "summary", "title": "Total Divas S7 E11 episode recap: Let’s Get Naked!", "site": "@wrestlingonline", "description": "This episode began with more drama For Lana and Rusev. It seems as though Lana has not learned from her previous experiences this season, and is continuing to act in ways that upset her extremely conservative husband. This time, Rusev objected to Lana wearing a bikini while standing in their front yard in full view of the neighbors. Lana insisted that she was only trying to get a tan, but Rusev seem to think that Lana was trying to give their male neighbors a great view of her impressive body. While Lana is extremely attractive, I agree with Rusev that Lana should try to respect her husband's feelings a little more. In order to show Lana how it felt to have your significant others' body on full display, Rusev mowed their lawn wearing only his underwear. This didn't phase Lana, however, she even took a picture to post on social…", "image": "https://www.wrestling-online.com/News/wp-content/uploads/totaldivas7.jpg"}, "msapplication-TileImage": "https://www.wrestling-online.com/News/wp-content/uploads/cropped-favico-300x300.png"}, "movies": [], "publish_date": 1516995737.0, "source": "http://www.wrestling-online.com", "summary": ""}