{"url": "https://www.inquisitr.com/4230622/kendall-jenner-nude-outfit-airport-met-gala-gown/", "text": "Kendall Jenner wore a nude see-through outfit to the airport after she sported a barely-there gown that left little to the imagination at the Met Gala earlier this month. Is this the supermodel taking a page out of her sister Kim Kardashian’s book?\n\nAirport attire?\n\nKendall Jenner, 21, wore matching nude-colored see-through leggings and a long-sleeve top in a crotchet-like pattern to the airport on Thursday, E! News reported.\n\nThe supermodel went sans bra to LAX, leaving her breasts exposed by the bright flashes of the paparazzi cameras. The pants revealed a nude-colored pair of briefs underneath and her long legs.\n\nThe Keeping Up With The Kardashians model seems to have gotten her inspiration from her older sister, Kim Kardashian, who is often wearing revealing clothing and daring ensembles.\n\nKendall tucked her see-through pants into a pair of beige heeled Yeezy ankle boots, which Kim Kardashian has also been spotted doing recently. She also appeared to have gone without makeup for her travels.\n\nKendall was flying to Nice for the annual Cannes Film Festival, according to Daily Mail.\n\nThe model made her way to a car waiting upon her arrival before heading off to the luxury 5-star Eden Roc Hotel in Antibes.\n\nalways been an OG #TBT A post shared by Kendall (@kendalljenner) on May 18, 2017 at 9:20am PDT\n\nKendall Jenner teases her saucy lingerie as she lands in Nice for Cannes Film Festival appearance https://t.co/gF2R2SMPKV — Daily Mail Celebrity (@DailyMailCeleb) May 19, 2017\n\nShe carried a bright mustard-colored tote bag and covered her eyes with oversized black aviators.\n\nSo, Kendall Jenner wore see-through pants to the airport https://t.co/dIngwhOmCS pic.twitter.com/IlAl7QkiOz — Who What Wear (@WhoWhatWear) May 19, 2017\n\nStyle evolution.\n\nJenner’s style has evolved over the years since gaining more experience in the fashion world. Kendall is one of the highest-earning supermodels in the world and is the face of multiple reputable brands.\n\nThe reality star also started a line with her sister called Kendall and Kylie. They are about to launch the second drop for the clothing line on May 22.\n\nDropTwo coming May 22 @kendallandkylie pic.twitter.com/SmvHJe9kSI — Kendall (@KendallJenner) May 19, 2017\n\nRELATED POSTS BY THE INQUISITR\n\nKim Kardashian Voted ‘Most Annoying Celebrity,’ Snapchats Watching The ‘Family Feud’ Episode\n\nKardashian BFF Jonathan Cheban Brings Them To A Mexican Restaurant After A Cockroach Infestation\n\nKim Kardashian Former Assistant Stephanie Shepherd Spills Insider Details, Who Will Replace Her?\n\nKylie Jenner Reveals She ‘Can’t Do It Forever’ In First Trailer For ‘Life Of Kylie’\n\nThe once shy, timid teenager fans saw on Keeping Up With The Kardashians in the early 2000’s is no longer here. Kendall has been showing up on red carpets looking confident and glamorous.\n\nThe Estee Lauder model certainly has not been afraid to show off her body recently. Kendall wore a La Perla Haute Couture dress made of some thread and a few less than 100,000 crystals.\n\nThe designer gown showed off quite the view of the 21-year-old’s backside. Her gown was definitely one of the highlights of the event.\n\nA post shared by Kendall (@kendalljenner) on May 2, 2017 at 8:57am PDT\n\nJenner has also been a fan of going without a bra for a while now. She has been photographed wearing shirts that have left her nipples practically completely exposed and seems totally comfortable and confident in what she is wearing.\n\nEarlier in the day on Thursday, Kendall Jenner shared a throwback photo of herself wearing an Adidas t-shirt with pigtails and a missing front tooth.\n\nalways been an OG #TBT A post shared by Kendall (@kendalljenner) on May 18, 2017 at 9:20am PDT\n\nWhat do you think about Kendall Jenner’s see-through style? Do you like it? Do you think she is getting inspiration from Kim Kardashian’s daring outfits? Let us know what you think in the comments section below.\n\n[Featured Image by Mike Coppola / Staff / Getty Images]", "images": ["https://secure.gravatar.com/avatar/24774fc25d8eabdc10ed03eabe81d7f9?s=250&d=mm&r=g", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://cdn.inquisitr.com/wp-content/uploads/2017/05/kendall-jenner-goes-to-the-airport-in-see-through-outfit.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png"], "top_img": "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Amanda Katherine"], "canonical_link": "https://www.inquisitr.com/4230622/kendall-jenner-nude-outfit-airport-met-gala-gown/", "title": "Kendall Jenner Wears Nude See-Through Outfit To The Airport After Barely-There Met Gala Gown", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}