{"url": "https://web.archive.org/web/20190418090049/https://en.wikipedia.org/wiki/The_Flash_(season_5)", "text": "No.\n\noverall No. in\n\nseason Title Directed by Written by Original air date Prod.\n\ncode U.S. viewers\n\n(millions)\n\n93 1 \"Nora\" David McWhirter Todd Helbing & Sam Chalsen October 9, 2018 ( ) T27.13751 2.08[2]\n\nTeam Flash meet Nora, Barry and Iris' daughter from the future. While Iris expresses excitement, Barry is concerned that she could alter the timeline based on his own mistakes with time travel. When Barry tries to send Nora home, Wally reveals that Nora's blood is saturated with negative tachyons, which prevents her from using the Speed Force or the Legends' Waverider to time travel. Barry asks Nora what happens to him in the future, so she reveals that he never returned after disappearing in 2024 and that she traveled back in time to meet him. A new metahuman named Gridlock, who is able to harness kinetic energy, causes a plane to fall, so Barry, Nora, Wally, and Cisco team up to save it, with Nora providing Barry a Flash ring suit. They phase the plane through the buildings so it lands safely in the river. While Gridlock is being transported to prison, the convoy is attacked by a masked individual, who tells Gridlock that he plans to wipe out all metahumans before approaching him with a lightning-shaped dagger.\n\n94 2 \"Blocked\" Kim Miles Eric Wallace & Judalina Neira October 16, 2018 ( ) T27.13752 1.69[3]\n\nBarry struggles to train the overeager Nora, who gets herself hired as a CSI intern to spend more time with her father, much to Iris' discomfort. Caitlin and Ralph try to help Cisco in the aftermath of his breakup with Gypsy, with Cisco eventually accepting that Gypsy is not who he is meant to be with. Caitlin refuses to pursue the idea that her father might still be alive, despite Ralph's insistence. Cecile starts to lose her telepathy and struggles to connect with her child without being able to know her thoughts. Meanwhile, a new meta called \"Block\", who can create blocks of dense air, steals weapons from her old gang, and while trying to stop her, the team has their first encounter with Cicada; the masked man who killed Gridlock. He stabs Block, but Nora manages to speed her away from the scene. Cicada then uses his dagger to neutralize the team's powers, beat them severely, slash Cisco's hands, and nearly kill Barry before Nora drives him off. Cisco vibes Caitlin, learning that her mother is involved with her father's disappearance. Iris reveals that she has been investigating the masked individual, and the team discovers that Nora already knows about him.\n\n95 3 \"The Death of Vibe\" Andi Armaganian Jonathan Butler & Gabriel Garza October 23, 2018 ( ) T27.13753 1.87[4]\n\nThe team recruits Harrison Sherloque Wells to help them catch Cicada, who Nora reveals is unstoppable in the future. Caitlin and Ralph confront Caitlin's mother, who denies forging her husband's death certificate. They later break into her files and find a suicide note from Caitlin's father. Sherloque pinpoints Cicada as David Hersch, as he was previously correct 37 times. As a result of Nora's tampering with the timeline however, his identity on Earth-1 is different. Cicada attacks Joe to lure out Vibe and when Cisco arrives, Cicada stabs him and breaks his arm. Barry arrives, but is easily defeated. Nora enacts an explosion to drive Cicada off, which results in Cisco's apparent death. However, Cisco reappears, having used a breach machine to escape. With the public and Cicada believing that Vibe is dead, Sherloque agrees to help the team. Caitlin deciphers a hidden message from her father, Thomas, asking her to come find him. Cicada visits his comatose niece in the hospital. Nora agrees to stay with her parents, despite her seemingly strained relationship with Iris. Sherloque begins to suspect that Nora is not in 2018 for the reasons she gave.\n\n96 4 \"News Flash\" Brent Crowell Kelly Wheeler & Lauren Certo October 30, 2018 ( ) T27.13754 1.75[5]\n\nThe team discover articles about XS, written by one of Iris' former colleagues, Spencer Young, which are all published just before the events take place. Iris contacts Spencer to ask her to refrain from putting XS in her articles in order to protect Nora, but fails. Spencer is revealed to be in possession of a phone that allows her to control people's minds so she can create articles for her blog. Iris learns from Nora that she does not like her because in the future, the former implanted her with a meta dampening chip that disabled her powers. Barry and Nora go to the stadium when a bomb threat is reported, where Spencer uses her tech to hypnotize XS into trying to kill the Flash. Iris eventually stops XS by shooting her with a tranquilizer dart, allowing Nora to regain her mind and Barry to arrest Spencer. The team discover that Spencer's phone and Cicada's dagger have meta abilities, created from DeVoe's satellite explosion, meaning meta-tech could be in the hands of anyone. It is later revealed that Cicada has acquired super-strength.\n\n97 5 \"All Doll'd Up\" Philip Chipera Thomas Pound & Sterling Gates November 13, 2018 ( ) T27.13755 1.73[6]\n\nBarry and Nora go to stop some art thieves, with Iris getting frustrated when Nora cuts her off. Nora reveals that in the future, Iris is cold, distant, and critical of her actions. Nora goes to spend some time with Cecile, finding out more about Iris from her. Later, a new meta called Rag Doll attacks an architect and destroys his office, though the Flash saves him. Iris and Barry try to investigate the new meta, but the latter gets captured by Rag Doll and held hostage on a rooftop with power dampening cuffs (though the villain's unaware of Barry's abilities). Ralph and Iris go to save Barry, with Iris jumping off the building to remove Barry's cuffs while he's falling and allowing him to save them just as Ralph defeats Rag Doll. Iris later reconciles with Nora, and the two start to grow closer. Meanwhile, Cisco, Caitlin, Ralph, and Sherloque investigate Caitlin's father and track him to a university office and a chem lab before Cisco suddenly collapses. As his damaged hands negatively affect his health while using his powers, Cisco takes control of DeVoe's satellites so he can try and find both Thomas and Cicada.\n\n98 6 \"The Icicle Cometh\" Chris Peppe Kristen Kim & Joshua V. Gilbert November 20, 2018 ( ) T27.13756 1.60[7]\n\nBarry, Cisco and Caitlin find her father, Thomas, in an arctic facility and bring him to S.T.A.R. Labs, where he reveals that both he and Caitlin developed ice powers as a result of his experiments in trying to treat their ALS gene. Thomas claims he is dying as a result of never having manifested an alternate personality like Killer Frost, but Cisco is suspicious. He teleports back to Thomas' lab, where he discovers \"Thomas\" is actually an alternate personality wearing skin grafts to pose as him. Caitlin realizes that a serum she created to cure her father would actually kill his human side. Cornered, Thomas' alter ego, \"Icicle\", emerges and attempts to kill Team Flash with absolute zero temperatures, but Caitlin proves to be immune. With the rest of the team incapacitated, Killer Frost returns and defeats Icicle, forcing him to flee. Team Flash determines that Dominic Lanse / Brainstorm's powers caused Killer Frost's disappearance and they also learn the name of Cicada's niece, Grace.\n\n99 7 \"O Come, All Ye Thankful\" Sarah Boyd Jonathan Butler & Gabriel Garza November 27, 2018 ( ) T27.13757 1.79[8]\n\nBarry attempts to see Grace, but Dr. Ambres impedes him. Barry and Nora later stop a freak lightning storm from hitting the city's power grid. Team Flash suspect Mark Mardon, even though he's in jail, but Nora and Barry instead encounter his estranged daughter, Joss Jackam / Weather Witch, who wields a weather control staff like her father. Barry and Nora bring Mardon to her in order to appease her, but to no avail. An angered Joss attacks an airport with a lightning tornado, so Barry uses Mardon's wand to absorb Joss' lightning and subdue her. Team Flash finally discovers Cicada's identity: Orlin Dwyer. In flashbacks, Orlin is shown adopting Grace after her mother's death in a metahuman attack and while bonding, debris from DeVoe's satellite put Grace in a coma and impaled Orlin with shrapnel that would later become his dagger. Blaming metahumans for what happened, Orlin vows to exterminate them all on Grace's behalf.\n\nBarry and Nora time travel to gather items needed to stop Cicada; a highly magnetic alloy from Savitar's armor, Harry Wells' Speed Force transmitter, and dark matter. They first travel to Team Flash's final battle with Savitar. After a Time Wraith appears, Barry distracts it so Nora can retrieve a piece of the armor. They next travel to when Zoom stole Barry's speed for the transmitter, which Barry obtains from Harry. Zoom discovers Barry and Nora and gives chase before he is stopped by the Time Wraith; though this breaks the transmitter in the process. Even though he is reluctant, Nora convinces Barry to ask Eobard Thawne for help. Despite some initial difficulty, Barry convinces Thawne to fix the transmitter by claiming he will never get home if he does not. Finally, Barry and Nora travel to the night of the particle accelerator explosion. In the Time Vault, Gideon reroutes part of the dark matter through the shard and transmitter, and Barry reveals to Nora that Thawne killed his mother. Back in the present, Team Flash separates Cicada from his dagger temporarily before he escapes. Nora returns to 2049 to confront Thawne at Iron Heights.\n\nOn a decimated Earth-90, the Flash is seen crawling towards a book, but a mysterious stranger picks it up and uses it to destroy that reality; though the Flash escapes. On Earth-1, the stranger presents the book to Arkham Asylum psychiatrist Dr. John Deegan, and instructs him to rewrite reality as he sees fit. The following morning, under threatening red skies, Oliver Queen and Barry discover that they have swapped lives, with everyone believing they are each other. When they seek the assistance of Team Flash, they do not believe them and lock Barry and Oliver in the pipeline. Barry and Oliver use each other's abilities to escape and convince a reluctant Iris to allow them to flee to Earth-38 to enlist the help of Kara Danvers / Supergirl and her cousin, Clark Kent / Superman. Back on Earth-1, the heroes join forces to stop A.M.A.Z.O., an android that can copy their abilities. They stop the android and, after seeing a vision of the stranger from Cisco, they realize they must travel to Gotham City. This episode begins a crossover event that continues on Arrow season 7 episode 9, and concludes on Supergirl season 4 episode 9.\n\n102 10 \"The Flash & the Furious\" David McWhirter Kelly Wheeler & Sterling Gates January 15, 2019 ( ) T27.13760 1.64[11]\n\nNora refuses to continue working with Thawne upon learning he killed her grandmother. Barry and Nora encounter a new villain, Silver Ghost, who possesses meta tech allowing her to access any car. An encounter with her and her tech leaves Barry phasing uncontrollably, so Nora and Team Flash help him into the pipeline, where he can stabilize for 24 hours. Silver Ghost frees Joss Jackam from CCPD's custody so she can help her steal a WayneTech car in A.R.G.U.S.'s possession. Silver Ghost uses the car's tech to evade capture, until Cisco patches Nora's voice into the radio, urging Joss for a second chance and to turn herself in. Joss secretly disables the car, before escaping with Silver Ghost. Caitlin helps heal Cisco's hands and they agree to try to develop a meta cure with the caveat that it is never forced on anyone. Nora returns to the future and reluctantly agrees to help Thawne, who has less than an hour left to live. Sherloque gains access to the Time Vault, but discovers the files on Nora West-Allen have been deleted by her.\n\n103 11 \"Seeing Red\" Marcus Stokes Judalina Neira & Thomas Pound January 22, 2019 ( ) T27.13761 1.88[12]\n\nCicada returns, killing metahumans from an arrest log provided by someone inside CCPD. When Team Flash tries to stop him, the villain paralyzes Nora and slows down her speed healing. Once the team determines Cicada's pattern, Cecile tracks down the informant while the rest round up the remaining metas on the log. Caitlin continues working on the metahuman cure, but needs blood from a recently created one. Cicada finds the meta group protected by Team Flash. While Ralph helps the metas escape, Flash and Killer Frost distract Cicada; the latter drawing blood from him for the cure. Incensed from what happened to Nora, Flash nearly kills Cicada before she rushes over to stop him; inadvertently allowing the killer to escape. Sherloque ignores Iris' order to stop investigating Nora and discovers two handwriting styles in her journal. While having dinner with Iris and Nora, Barry comes up with the idea to appeal to Cicada's heart by trying to wake Grace up.\n\n104 12 \"Memorabilia\" Rebecca Johnson Sam Chalsen & Kristen Kim January 29, 2019 ( ) T27.13762 2.04[13]\n\nThe team plan to wake Grace up using a Memory Machine Sherloque had sent over from Earth-221. Despite his instructions however, Nora enters Grace's memories by herself to prevent the others from learning about her secret alliance with Thawne, which goes awry when she ends up trapped. To her horror, she discovers that Grace was consciously aware of Orlin's actions while in her comatose state and wholeheartedly supports him in his anti-metahuman agenda before she is attacked by a female version of Cicada. Meanwhile, Barry and Iris discover what Nora did and go in after her, only to end up in her memories of the Flash Museum and attacked by the Reverse-Flash exhibit. Despite heavy resistance, Barry and Iris manage to escape Nora's memories and save her from Cicada. But they are unable to bring Grace as she refuses to wake up and believes Nora is a liar. Upon further review of their adventure, Caitlin learns that a satellite shard became lodged in Grace's brain and created a barrier around it, meaning they can't try again. Iris establishes the Central City Citizen, which Nora reveals was originally founded in 2021; meaning Iris is changing the future. Cisco makes some headway on the meta cure, which Barry decides to use on Cicada.\n\n105 13 \"Goldfaced\" Alexandra LaRoche Jonathan Butler & Gabriel Garza February 5, 2019 ( ) T27.13763 1.89[14]\n\nTeam Flash completes the metahuman cure, but require Cicada to hold still long enough for it to take effect. Ralph finds a device capable of doing so in the hands of a metahuman crime boss called Goldface. Despite Barry's hesitation, he and Ralph go undercover as criminals to retrieve it from him. Though he is suspicious, Goldface decides to take the heroes on a job to steal a 3-D printer from Ivo Labs in exchange for the device. Even though they are discovered, Barry and Ralph are able to stop Goldface and his men. Elsewhere, Iris starts investigating Cicada for the Central City Citizen and discovers where he lives. She is able to get inside, but he sees through her and tries to kill her. After a protracted fight, she discovers his weakness; but when Team Flash investigate, they find Cicada gone. Under orders from Thawne, Nora tries to help Sherloque fall in love to steer him away from her. Despite a bad first meeting and little help from four of his ex-wives, Sherloque succeeds in love with the woman, Renee Adler. After he discovers she is a meta, however, he devotes all of his attention to protecting her from Cicada.\n\n106 14 \"Cause and XS\" Rachel Talalay Todd Helbing & Jeff Hersh February 12, 2019 ( ) T27.13764 1.71[15]\n\nBarry takes the meta cure into the Speed Force for an hour to help speed up the synthesizing process, leaving an uneasy Nora behind. Elsewhere, Cicada kidnaps Iris, but she manages to alert Nora and Killer Frost to her location. They arrive, but Cicada slays Killer Frost, distressing Nora to the point where she runs so fast, she resets the timeline. When Nora tries to prevent Iris' death, Cicada ends up kidnapping Ralph instead, and although the situation plays out like last time, Ralph dies instead. Nora repeatedly resets the timeline, but on each new attempt, someone on Team Flash always gets killed. Finally, Cisco reveals the loops to the team, forcing Nora to confess what has happened. Cisco consoles her, and together with the rest of the team, works on a new plan to stop Cicada. This time, they make it so that Cicada accidentally stabs himself with his dagger, forcing him to flee. Once Barry returns and learns what Nora has done, he warns her against altering time any further. Elsewhere, Sherloque manages to decode Nora's entire journal using symbols she unwittingly revealed during the meeting with the team.\n\n107 15 \"King Shark vs. Gorilla Grodd\" Stefan Pleszczynski Eric Wallace & Lauren Certo March 5, 2019 ( ) T27.13765 1.67[16]\n\nThe metahuman cure is finally finished and Team Flash decides that King Shark would be the ideal subject to test it on. The team travels to A.R.G.U.S. and ask Lyla to get in contact with King Shark, who aggressively attacks the team under the mind-control of Gorilla Grodd. Barry reacts by injecting the cure into King Shark, turning him back into his human form - Shay Lamden. Back at S.T.A.R. Labs, Caitlin discovers that although the cure worked, there is still dark matter in Shay's pituitary gland and his body rapidly changes back and forth between his human and shark forms. Shay's wife, of Earth-1, Tanya, is convinced by Sherloque to talk with Shay. Later, Grodd mind-controls Cisco and Caitlin to steal Dr. Lamden's telepathy-crown to amplify his powers so he can control all of Central City. Seeing no other option and wanting to make amends for his crimes as King Shark, Shay gives up his chance of being human to help Team Flash stop Grodd; even in spite of the possibility of never being human again. Meanwhile, Joe returns home to Cecile and trains Iris to overcome Cicada who Barry suggests they offer the cure to instead of forcing it on him.\n\n108 16 \"Failure Is an Orphan\" Viet Nguyen Zack Stentz March 12, 2019 ( ) T27.13766 1.55[17]\n\nIn 2049, Thawne warns Nora that they have to act fast to stop Cicada once and for all because a new timeline is trying to push its way into being -- and bring something really big with it. In the present, Nora and Barry confront a new metahuman, Acid Master, whose burn mark was on a newspaper article shown to Nora in the future, which leads her to deduce that the final confrontation with Cicada is upon them. Meanwhile, Joe and Cecile interrogate Dr. Ambres about working with Dwyer. She then reveals to them that Dwyer's niece Grace is a metahuman now. Barry reveals this to Dwyer, which makes him reconsider his whole vendetta, and successfully convinces him to take the metahuman cure by bringing up the possibility of curing Grace. Dwyer is taken to S.T.A.R. Labs and given the cure, but during the operation the facility is attacked by a new Cicada, who kills Dr. Ambres and abducts Dwyer. At a cabin in the woods, the new Cicada unmasks herself to reveal an adult Grace.\n\n109 17 \"Time Bomb\" Rob Greenlea Kristen Kim & Sterling Gates March 19, 2019 ( ) T27.13767 1.64[18]\n\nIn 2049, Thawne is surprised by the appearance of a new Cicada and with no other options, asks Nora to reveal the relationship between them to her father. The adult Grace comes from a future where metahumans thrive to complete what she believes is still her uncle's mission. Team Flash discovers that the new Cicada arrived in a Time Sphere, stolen from S.T.A.R. Labs' storage in the future. Following some leads, including a police file stolen by the new Cicada, they correctly deduce her identity. Cicada targets Vickie Bolen, a metahuman who accidentally caused an explosion that killed her parents, but Team Flash intervenes. Orlin arrives and tries to talk his niece into abandoning her vendetta, which leads to her killing him. Meanwhile, Sherloque finds out that Thawne, when he was posing as Dr. Wells, cracked a source code for the multiverse. Identifying Thawne as the second person who wrote in Nora's journals, Sherloque exposes her partnership in front of the team, and Barry locks his daughter in the pipeline.\n\n110 18 \"Godspeed\" Danielle Panabaker Judalina Neira & Kelly Wheeler April 16, 2019 ( ) T27.13768 1.31[19]\n\nTeam Flash read Nora's journal and learn that she discovered her powers and relation to the Flash after subsequent encounters with two speedsters: August Heart / Godspeed and Thawne. Flash-forwards show Nora working as a forensic scientist like her father. After being hit by Godspeed, Nora discovers she had a chip implanted into her that dampened her powers, which causes a rift between her and her mother. After Godspeed's citywide rampage kills Nora's best friend and co-worker Lia, Thawne helps Nora control her newfound powers and defeat the rampaging speedster; after which, Thawne becomes her mentor as he did with Barry. With Thawne's help, Nora finds the Time Vault, where she learns that her father was the Flash. In the present, Iris releases Nora out of guilt after learning of her future self's deception, but Barry sends her home out of distrust and without Iris's consent. Barry then visits Thawne at Iron Heights, glad that he is awaiting execution for his crimes.\n\n111 19 \"Snow Pack\"[20] Jeff Cassidy Jonathan Butler & Gabriel Garza April 23, 2019 ( ) TBA TBD", "images": ["https://web.archive.org/web/20190418090049im_/https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://web.archive.org/web/20190418090049im_/https://en.wikipedia.org/static/images/wikimedia-button.png", "https://web.archive.org/web/20190418090049im_/https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://web.archive.org/web/20190418090049im_/https://upload.wikimedia.org/wikipedia/en/thumb/a/ad/The_Flash_season_5.jpg/220px-The_Flash_season_5.jpg", "https://web.archive.org/web/20190418090049im_/https://upload.wikimedia.org/wikipedia/en/a/ad/The_Flash_season_5.jpg"], "top_img": "https://web.archive.org/web/20190418090049im_/https://upload.wikimedia.org/wikipedia/en/a/ad/The_Flash_season_5.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20190418090049/https://en.wikipedia.org/wiki/The_Flash_(season_5)", "title": "The Flash (season 5)", "meta_data": {"generator": "MediaWiki 1.33.0-wmf.25", "referrer": "origin-when-cross-origin", "og": {"image": "https://web.archive.org/web/20190418090049im_/https://upload.wikimedia.org/wikipedia/en/a/ad/The_Flash_season_5.jpg"}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}