{"url": "www.nationalenquirer.com/photos/kate-middleton-weight-bulimia-crisis/", "text": "The Duke and Duchess of Cambridge and Prince Harry join a London Marathon training day Prince William during a recent royal appearance. Shocked eyewitnesses saw how even tight leggings were hanging off the shrinking princess — as Kate Middleton is battling a killer eating disorder — as the stick-thin princess compulsively forces herself to throw up after every meal! The Duchess of Cambridge's shocking secret is getting tougher to hide, too, as seen when Kate showed off her frail body while playfully running along with husbandduring a recent royal appearance. Shocked eyewitnesses saw how even tight leggings were hanging off the shrinking princess — as The National ENQUIRER exposed tell-tale signs of her vomiting after every meal! Photo credit: MEGA\n\nWilliam, Kate and Harry join a London Marathon training day Princess Diana, who also suffered from bulimia in secret. But, as seen in shocking photos unearthed by The ENQUIRER, Kate's fragile hands keep her from hiding her sickly secret! The beloved 5'9\" royal is now down to a disturbing 89 lbs., as even sickly Queen Elizabeth reportedly fears for the beauty’s survival. Kate’s skeletal appearance has triggered gut-wrenching memories of the mother-in-law she never knew — the late, who also suffered from bulimia in secret. But, as seen in shocking photos unearthed by The ENQUIRER, Kate's fragile hands keep her from hiding her sickly secret! Photo credit: MEGA\n\nRoyal Visit to Norfolk Photos such as this image from Jan. 2017 show how Kate is keeping Band-Aids wrapped around her fingers and thumbs — indicators of what mental health experts call “Russell’s signs,” meaning cuts or callouses caused by weight- obsessed bulimics sticking fingers down their throat to force themselves to vomit up unwanted calories. After examining more than a year of photos showing Kate with bandaged knuckles, weight loss expert Dr. Stuart Fischer told The ENQUIRER her behavior is “highly suspicious.” Photo credit: InStar\n\nThe Duke and Duchess of Cambridge and Prince Harry join a Christmas Party The author of “The Park Avenue Diet” noted: “It’s very common for women who suffer from bulimia to have such cuts on their fingers and hands. They bite down on their fingers and knuckles while putting their fingers down their throat. It’s extremely unlikely she would be injured repetitively in these places. Kate would have to be a carpenter or shuck oysters and clams for a living!” Photo credit: MEGA\n\nThe Duchess of Cambridge visits The Hague “It’s a frightful and damaging way to lose weight,” added Dr. Fischer, who has not treated Kate. “She might feel immense pressure under the spotlight in the royal family, but she has to stop!” And insiders told The ENQUIRER that the mother of two did seek help from a leading British medical expert for the early stages of anorexia a couple of years back. Photo credit: AKM-GSI\n\nWilliam, Kate and Harry attend a Heads Together briefing A doctor made several visits to Anmer Hall on Queen Elizabeth’s country estate, Sandringham, where Kate and William live with Prince George and Princess Charlotte. The expert told Kate she must enter a residential treatment facility to beat her eating disorder, the source said. Photo credit: MEGA", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAUEBAAAACwAAAAAAQABAAACAkQBADs=", "https://cdn-neq0.heartyhosting.com/wp-content/themes/vip/am-neq/images/svg/logo-tag-registered-green.svg", "https://cdn-neq0.heartyhosting.com/wp-content/themes/vip/am-neq/images/svg/logo-tag-registered.svg", "https://secure.gravatar.com/avatar/04f082eec183205c28a957949c1a0389?s=64&d=identicon&r=g", "https://i0.heartyhosting.com/www.nationalenquirer.com/wp-content/uploads/2017/02/kate-middleton-bulimia-health-crisis-F.jpg?fit=640%2C420&ssl=1", "https://i0.heartyhosting.com/www.nationalenquirer.com/wp-content/uploads/2020/02/Hot-pics-feb-2020-jlo-shakira-n.jpg?resize=300%2C194&ssl=1", "https://i0.heartyhosting.com/www.nationalenquirer.com/wp-content/uploads/2017/02/kate-middleton-bulimia-health-crisis-F.jpg?resize=540%2C400&ssl=1", "https://i0.heartyhosting.com/www.nationalenquirer.com/wp-content/uploads/2017/02/kate-middleton-bulimia-health-crisis-F.jpg?resize=408%2C229&ssl=1", "https://cdn-neq0.heartyhosting.com/wp-content/themes/vip/am-neq/images/nationalenquirer-logo.svg"], "top_img": "https://i0.heartyhosting.com/www.nationalenquirer.com/wp-content/uploads/2017/02/kate-middleton-bulimia-health-crisis-F.jpg?fit=640%2C420&ssl=1", "keywords": [], "authors": ["National Enquirer Staff"], "canonical_link": "https://www.nationalenquirer.com/photos/kate-middleton-weight-bulimia-crisis/", "title": "Princess Kate Bulimia Battle: Shocking New Photos", "meta_data": {"viewport": "width=device-width, user-scalable=0", "msapplication-TileColor": "#da532c", "msapplication-TileImage": "/images/favicon/mstile-144x144.png", "msapplication-config": "https://cdn-neq0.heartyhosting.com/wp-content/themes/vip/am-neq/images/favicon/browserconfig.xml", "theme-color": "#ffffff", "google-site-verification": "kONM_PqGX8Za53dFcExSTIIPZxxN_S4QtvDlONzzdA0", "description": "Kate Middleton is battling a tragic eating disorder — as shocking new photos show the sick secrets of her weight-loss obsession!", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "news_keywords": "kate middleton", "generator": "WordPress 5.3.2", "og": {"type": "article", "title": "Princess Kate Bulimia Battle: Shocking New Photos", "url": "https://www.nationalenquirer.com/photos/kate-middleton-weight-bulimia-crisis/", "description": "Visit the post for more.", "site_name": "National Enquirer", "image": "https://i0.heartyhosting.com/www.nationalenquirer.com/wp-content/uploads/2017/02/kate-middleton-bulimia-health-crisis-F.jpg?fit=640%2C420&ssl=1"}, "article": {"published_time": "2017-02-06T14:58:59+00:00", "modified_time": "2017-02-06T16:13:59+00:00", "author": "https://www.nationalenquirer.com/author/nestaff/"}, "fb": {"app_id": 953902771314199}, "twitter": {"card": "summary_large_image", "title": "Princess Kate Bulimia Battle: Shocking New Photos", "description": "Visit the post for more.", "image": "https://i0.heartyhosting.com/www.nationalenquirer.com/wp-content/uploads/2017/02/kate-middleton-bulimia-health-crisis-F.jpg?fit=640%2C420&ssl=1"}}, "movies": [], "publish_date": 1486393139.0, "source": "http://www.nationalenquirer.com", "summary": ""}