{"url": "time.com/4653873/donald-trump-immigration-ban/", "text": "President Trump’s executive order temporarily suspending travel from seven Muslim-majority nations drew swift criticism from musicians, actors and other celebrities.\n\nIt was the latest in the long and sometimes troubled relationship Trump has with other famous people, who have appeared on his reality show The Apprentice and tangled with him on political issues.\n\nStill, he had some support, including actor Scott Baio, rapper Azealia Banks and former Alaska Gov. Sarah Palin.\n\nSee what 50 celebrities had to say about Trump’s immigration ban below.\n\nRapper Nicki Minaj referenced her own immigration from Trinidad in a tweet.\n\nBlackish star Yara Shahidi shared that the concern touched her on a personal and global level.\n\nSilicon Valley star and comedian Kumail Nanjiani, who was born in Pakistan, shared his concern that the ban would encourage hateful attitudes.\n\nDirector Ava DuVernay pointed out that Asghar Farhadi, an Iranian director nominated for an Oscar at this year’s Academy Awards, would be unable to travel to the ceremony under the immigration ban.\n\nMusician Kirk Franklin emphasized that religious freedom was related to other civil liberties.\n\nActor Mindy Kaling referenced her book, where she details her parents’ experience as immigrants.\n\nGrey’s Anatomy‘s Jesse Williams pointed out that many of the country’s accomplishments were due to immigrants and refugees.\n\nGaycation star Ellen Page attended a protest at John F. Kennedy International Airport.\n\nMusician Sia told her followers that she would match their donations to the ACLU up to $100k.\n\nActor Rosie O’Donnell pledged to match Sia’s donation to the ACLU in turn.\n\nEven director Judd Apatow followed suit.\n\nPop star Miley Cyrus pledged her support to immigrants in the country.\n\nScandal star Kerry Washington encouraged her followers to remember American history.\n\nMusician Bruce Springsteen called America a “nation of immigrants” during a concert.\n\nPop star Rihanna, who was born in Barbados, candidly shared her thoughts on the matter via Twitter.\n\nMoonlight and Hidden Figures star Mahershala Ali used his Screen Actors Guild acceptance speech to speak out against the persecution of communities.\n\nSupermodel sisters Bella and Gigi Hadid protested the executive order in New York City.\n\nMeanwhile, the stars of How to Get Away With Murder took to LAX to protest.\n\nActor Alyssa Milano pointed out that the immigration ban can affect everyone on a very personal level.\n\nA sentiment that entertainment legend Bette Midler echoed.\n\nTalk show host Ellen DeGeneres riffed on Trump’s campaign slogan while critiquing his executive order.\n\nSinger and actor Barbra Streisand urged her followers to consider the determining factors in the immigration ban.\n\nStar Trek star George Takei also echoed Streisand’s concerns with the countries selected for the immigration ban.\n\nAuthor J.K. Rowling weighed in with her own thoughts on Trump’s meeting with Theresa May.\n\nActor Julianne Moore referenced the Constitution following the immigration ban.\n\nActor Jessica Chastain pointed out that the history of the country has hinged on immigration.\n\nWhile actor Nick Offerman didn’t mince his words while expressing how he felt about the immigration ban.\n\nActor Mark Hamill used a single hashtag to show his feelings about the matter.\n\nVeep‘s Julia Louis-Dreyfus used her acceptance speech at the SAG Awards as a platform for immigrants.\n\nFresh Off the Boat star Constance Wu took to Twitter to voice her opinion on the detainment of green card holders at airports.\n\nThe Tipping Point author Malcom Gladwell relayed his own experience as an immigrant, post-immigration ban.\n\nModel Chrissy Teigen has long been an outspoken critic of Trump and this occasion was no exception.\n\nSinger Cher showed her support of the protests about the immigration ban.\n\nFun. musician Jack Antonoff made a donation to the ACLU to support those affected by Trump’s executive orders.\n\nThis Is Us‘ Mandy Moore thanked the ACLU and protestors for the work that they did.\n\nActor Mark Ruffalo tweeted about the many protests at airports across America.\n\nWhile pop star J. Lo wondered how immigrant became a “bad word.”\n\nOne Tree Hill‘s Sophia Bush encouraged her followers to continue protesting\n\nAnd actor Olivia Wilde showed her support for the protestors.\n\nDirector Michael Moore offered apologies to those primarily affected by the immigration ban.\n\nWhile Designated Survivor‘s Kal Penn chose to take the high road towards an Internet hater.\n\nFormer Punk’d host Ashton Kutcher took to his Twitter to speak about the policy.\n\nHappy Days star Scott Baio had alternative thoughts when it came to the issue.\n\nPolitical personality Sarah Palin also chimed in calling the backlash to the executive order, “phony.”\n\nIn a now-deleted Instagram post, rapper Azealia Banks appeared to say she wanted Rihanna to “shut up and sit down” after the latter appeared to tweet her disapproval about Donald Trump’s immigration ban, according to People.\n\nActor Jennifer Lawrence wrote on Facebook that “someone’s race and religion should never keep them in harm’s way.”\n\nActor Seth Rogen shared his family’s story immigrating to the U.S. from Russia.\n\nHidden Figures and Moonlight star Janelle Monae put her money where her mouth was.\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Cady Lang at cady.lang@timemagazine.com.", "images": ["https://api.time.com/wp-content/uploads/2020/03/american-war-mobilization-industrial.jpg?quality=85&w=517", "https://api.time.com/wp-content/uploads/2017/01/celebrities-respond-donald-trump-muslim-ban.jpg", "https://api.time.com/wp-content/uploads/2020/04/OPEC-deal-trump.jpg?quality=85&w=600", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2017/01/celebrities-respond-donald-trump-muslim-ban.jpg?quality=85&w=1200&h=628&crop=1", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2017/01/celebrities-respond-donald-trump-muslim-ban.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Cady Lang"], "canonical_link": "https://time.com/4653873/donald-trump-immigration-ban/", "title": "50 Celebrities React to Donald Trump's Immigration Order", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Celebs immigration Ban, Celebrity responses to Donald Trump Immigration Ban, Celebs Twitter Muslims, Celebs Instagram Muslim Ban, Celebs protest muslim ban, Immigration Ban Donald Trump, Celebrities Immigration Ban", "news_keywords": "Celebs immigration Ban, Celebrity responses to Donald Trump Immigration Ban, Celebs Twitter Muslims, Celebs Instagram Muslim Ban, Celebs protest muslim ban, Immigration Ban Donald Trump, Celebrities Immigration Ban", "description": "Celebrities are responding to Donald Trump's executive order preventing entry from seven countries, including Syria and Iraq.", "og": {"title": "50 Celebrities React to Donald Trump's Immigration Order", "type": "article", "site_name": "Time", "url": "https://time.com/4653873/donald-trump-immigration-ban/", "description": "From Barbra Streisand to Rihanna.", "image": {"identifier": "https://api.time.com/wp-content/uploads/2017/01/celebrities-respond-donald-trump-muslim-ban.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/4653873/donald-trump-immigration-ban/", "description": "Celebrities are responding to Donald Trump's executive order preventing entry from seven countries, including Syria and Iraq.", "media": "https://api.time.com/wp-content/uploads/2017/01/celebrities-respond-donald-trump-muslim-ban.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/4653873/donald-trump-immigration-ban/", "title": "50 Celebrities React to Donald Trump's Immigration Order", "description": "From Barbra Streisand to Rihanna.", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2017/01/celebrities-respond-donald-trump-muslim-ban.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}