{"url": "https://www.independent.co.uk/life-style/women/meghan-markle-serena-williams-friendship-jacket-royal-wedding-super-bowl-a8590056.html", "text": "Over the past eight years, the Duchess of Sussex and Serena Williams’ friendship has gone from strength to strength.\n\nHaving first met in 2010, the pair have since formed a very close connection, supporting each other through thick and thin and bonding over life spent in the limelight.\n\nWilliams recently revealed that she and the duchess have been relying on each other a great deal in recent times, texting each other regularly for support and advice about coping with intense media scrutiny.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nFrom a Super Bowl party in Florida to a royal wedding in Windsor, here’s a timeline of their sweet and enduring friendship:\n\nMeeting at the Super Bowl\n\nThe duchess and Williams first met in 2010 during a party celebrating the Super Bowl, one of the most highly anticipated annual American sporting events.\n\nWhile the New Orleans Saints may have won the championship game that year, for Meghan and Williams, the event symbolised something that was arguably far more significant: the beginning of their friendship.\n\nThe pair immediately hit it off, keeping in touch after their first meeting.\n\nThey crossed paths again at the Super Bowl in 2014, when they both took part in a flag football match at DirectTV’s Celebrity Beach Bowl, playing on the same team alongside Hannah Jeter, Nina Agdal and Shay Mitchell.\n\nFriendly advice\n\nWhen the news broke that Meghan, formerly an actor on US drama Suits, had begun dating Prince Harry, the media went into a frenzy.\n\nMeghan sought Williams’ advice at the time, asking her what she should do to deal with the unrelenting paparazzi.\n\n“I told her, ‘You’ve got to be who you are, Meghan. You can’t hide,’”, Williams said in a profile of the duchess that was published in Vanity Fair in 2017.\n\nThis year, both Meghan and Williams were thrust into the spotlight to an even greater degree than usual, what with the duchess becoming a member of the royal family and Williams becoming embroiled in a widely discussed row with US Open umpire Carlos Ramos.\n\nWilliams spoke to Lisa Wilkinson of The Sunday Project about her friendship with Meghan, and the way in which it’s evolved as of late.\n\n“We were actually just texting each other this morning,” she said when Wilkinson asked how often they correspond.\n\n“We have known each other for a long time, but we really are relying on each other a lot recently.”\n\nShowing their support\n\nThe royal family often visits Wimbledon during the annual tennis championships.\n\nHowever, this year when Meghan took her seat in the royal box alongside her sister-in-law the Duchess of Cambridge, she did so both as a tennis fan and as a supporter of her close friend, 23-time Grand Slam winner Serena Williams.\n\nMeghan watched as her friend lost the Women’s Singles Final to Angelique Kerber, who won the match in straight sets.\n\nA couple of months later, it was revealed that Meghan had been involved in the creation of the Together: Our Community Cookbook, a recipe book produced with the aim of supporting families affected by the tragic Grenfell Tower fire.\n\nWilliams tweeted her support of Meghan’s first solo project as a member of the royal family, writing: “I used to call you Meghan (and I still do) but dear Duchess of Sussex your first project ‘Together’ a cookbook bringing women of all cultures together.\n\n“I could not be more excited about it and proud of you,” she continued. “It’s beautiful - diversity, inclusivity, coming together in grief and joy.”\n\nWhile Williams may be regarded as one of the greatest athletes of all time, she also has another pastime that she’s very passionate about: fashion.\n\nEarlier this year, she revealed the launch of her very own eponymous fashion line, which features a variety of casual, smart and sportswear.\n\nWhile in Australia with Prince Harry as part of a 16-day tour, Meghan wore a piece from Williams’ clothing collection: the ‘Serena Boss Blazer’.\n\n“The face you make when you and the Duchess of Sussex Meghan have matching @serena blazers,” Williams wrote on Instagram.\n\nGlitz and glam\n\nOn May 19 when Meghan and Prince Harry married at St George’s Chapel in Windsor, many people were enthralled by the sheer volume of A-list celebrities who attended the ceremony, including the likes of Amal and George Clooney, Victoria and David Beckham and Oprah Winfrey.\n\nWilliams attended the nuptials with her husband Alexis Ohanian, wearing a blush pink Versace wrap dress and Bulgari jewellery.\n\nFor the evening reception, William changed into a Pierpaolo Piccioli black and floral gown, which she paired with a pair of comfortable, Valentino trainers.\n\n“Little known fact: I often wear sneakers under my evening gown,” she wrote on Instagram.\n\n“These @maisonvalentino @pppiccioli gave to me last min. I told him be careful I tend to be comfy for long nights.\"", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/10/18/13/meghan-serena.jpg", "https://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/10/18/13/meghan-serena.jpg", "keywords": [], "authors": ["Sabrina Barr"], "canonical_link": "https://www.independent.co.uk/life-style/women/meghan-markle-serena-williams-friendship-jacket-royal-wedding-super-bowl-a8590056.html", "title": "Meghan Markle and Serena Williams: A timeline of the duchess' friendship with the tennis superstar", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "https://www.independent.co.uk/life-style/women/meghan-markle-serena-williams-friendship-jacket-royal-wedding-super-bowl-a8590056.html", "title": "A timeline of Meghan Markle’s friendship with Serena Williams", "description": "The pair have bonded over the trials and tribulations of being in the public eye", "updated_time": "2018-10-18T14:30:38+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/10/18/13/meghan-serena.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB", "video": {"identifier": "https://f1.media.brightcove.com/4/624246174001/624246174001_5839318610001_5839318643001.mp4?pubId=624246174001&videoId=5839318643001", "type": "application/octet-stream"}}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/8590056"}, "description": "Over the past eight years, the Duchess of Sussex and Serena Williams’ friendship has gone from strength to strength. Having first met in 2010, the pair have since formed a very close connection, supporting each other through thick and thin and bonding over life spent in the limelight.", "keywords": "Meghan Markle, Serena Williams, duchess of sussex, Female friendship, Friendship, Women, Lifestyle", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Meghan Markle", "published_time": "2018-10-18T13:38:00+01:00", "modified_time": "2018-10-18T14:30:38+01:00", "section": "Women", "subsection": "Video", "author_name": "Sabrina Barr", "content_type": "story", "word_count": 901, "image_count": 2, "video_count": 0, "embed_count": 0, "internal_link_count": 9, "external_link_count": 5}, "twitter": {"title": "A timeline of Meghan Markle’s friendship with Serena Williams", "description": "Over the past eight years, the Duchess of Sussex and Serena Williams’ friendship has gone from strength to strength. Having first met in 2010, the pair have since formed a very close connection,", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1539866280.0, "source": "https://www.independent.co.uk", "summary": ""}