{"url": "http://transcripts.cnn.com/TRANSCRIPTS/1003/21/sotu.01.html", "text": "\n\n\n\nReturn to Transcripts main page\n\nSTATE OF THE UNION WITH CANDY CROWLEY\n\nInterview With Congressmen Larson, Pence; Interview With Senators Hatch, Feinstein\n\nAired March 21, 2010 - 09:00 ET\n\nTHIS IS A RUSH TRANSCRIPT. THIS COPY MAY NOT BE IN ITS FINAL FORM AND MAY BE UPDATED.\n\n\n\nCROWLEY: Normally, on Sundays, we take a reflective look at the past week and set the agenda for the coming days, but today is no normal Sunday. We are four hours away from a showdown in the House of Representatives, a series of votes that will determine the future of health care reform, impact the economy, influence this November's election and set the stage for the rest of President Obama's agenda. Today is no normal Sunday. Today is game day. I am Candy Crowley and this is State of the Union.\n\n\n\nThis morning, health reform from all angles. Two House leaders, John Larson and Mike Pence, on today's vote. Two senior senators, Dianne Feinstein, and Orrin Hatch, on the week ahead. And analysis from Donna Brazile and Bill Bennett.\n\n\n\nWe have heard the words \"end game\" so many times in this health care debate, I wouldn't try it now. That said, it would in fact be the end if Republicans prevailed in today's vote. For Democrats, the magic number is 216. That's how many yeas needed to pass the health care bill in the House, 216 votes among the 253 Democratic members. It has been a struggle all week to get there. We begin with seven days in two minutes.\n\n\n\n(BEGIN VIDEOTAPE)\n\n\n\nDAVID AXELROD, SR. ADVISER TO THE PRESIDENT: I think we will have the votes.\n\n\n\nREP. JOHN A. BOEHNER, R-OHIO: If she had 216 votes, this bill would be long gone.\n\n\n\nPRESIDENT BARACK OBAMA: Hello, Ohio!\n\n\n\nREP. NANCY PELOSI, D-CALIF., SPEAKER OF THE HOUSE: When we bring the bill to the floor, we will have the votes.\n\n\n\nREP. JAMES E. CLYBURN, D-S.C., MAJORITY WHIP: We need to get to 216. And we are still tweaking stuff.\n\n\n\nOBAMA: Your own congressman, who is tireless on behalf of the working people, Dennis Kucinich.\n\n\n\nROBERT GIBBS, WHITE HOUSE PRESS SECRETARY: It is an important trip that the president will take. And I think he looks forward to it. REP. ERIC CANTOR, R-VA.: I mean, it is clear. They don't have the votes, because the American people can't stand this bill.\n\n\n\nREP. DENNIS J. KUCINICH, D-OHIO: I've decided to cast a vote in favor of the legislation.\n\n\n\nGIBBS: That he must postpone his planned visits for a later date.\n\n\n\nREP. BART STUPAK, D-MICH.: As of today, I am still voting no. Yes, I am still standing with this principle, protecting the sanctity of life. Yes.\n\n\n\nOBAMA: Hello, George Mason!\n\n\n\n(UNKNOWN): Yes. I will be voting yes for the bill.\n\n\n\nPELOSI: Right now, we are just getting votes to pass a bill.\n\n\n\nOBAMA: And in just a few days, a century-long struggle will culminate in a historic vote.\n\n\n\nBOEHNER: We are about 24 hours from Armageddon.\n\n\n\nCROWD: Kill the bill, kill the bill, kill the bill!\n\n\n\nREP. ANH \"JOSEPH\" CAO, R-LA.: Tomorrow will be a sad day for me as I cast a no vote against something I believe we need.\n\n\n\n(UNKNOWN): I will be a proud supporter of health care reform.\n\n\n\nREP. STENY H. HOYER, D-MD., MAJORITY LEADER: Clearly, we believe we have the vote.\n\n\n\n(UNKNOWN): We feel like we have been pregnant for 17 months. Let's get on with it already.\n\n\n\nOBAMA: We have been debating health care for decades. It has now been debated for a year. It is in your hands.\n\n\n\n(END VIDEOTAPE)\n\n\n\nCROWLEY: Here to look ahead to today's vote and the high stakes politics surrounding it, House Democratic Caucus Chairman, John Larson of Connecticut, and the House Republican Conference Chairman Mike Pence of Indiana. Gentlemen, thank you both for joining me.\n\n\n\nPENCE: Thank you, Candy.\n\n\n\nLARSON: Great to be with you, Candy.\n\n\n\nCROWLEY: State of play, where are you? 216, do you have it locked in?\n\n\n\nLARSON: This is a historic day. And we are happy warriors. We are so proud of the Democratic caucus, that we will be a part of history, joining Franklin Delano Roosevelt's passage of Social Security, Lyndon Johnson's passage of Medicare, and now Barack Obama's passage of health care reform.\n\n\n\nCROWLEY: So you have got the 216?\n\n\n\nLARSON: We've got the votes. And the reason for that, Candy, I think it started earlier this week with Natoma Canfield becoming the poster child for -- or lady for health care reform. And that struck such a cord within our caucus. And Dennis Moore standing up to give a speech in the caucus was Blackberried by a woman who works with him in Kansas. She said thank you for voting for this. I know I am losing my job at the end of this year, and unfortunately, I have just been diagnosed with cancer. Without this bill, I'm lost. Dennis ended by saying, and she is 24. You could have heard a pin drop.\n\n\n\nThis is about whose side you are on. And clearly, this historic moment in the people's chamber, we are on the side of the American people and those that have been denied access to health care, and those who have pre-existing conditions who have been denied, and those who have had their policies rescinded.\n\n\n\nCROWLEY: Congressman Pence, I think that puts you on the side not of the people, if we take his calculation. What is left for Republicans to do? Congressman Larson says they have the 216. So it is all over but the shouting? You guys vote no and move on?\n\n\n\nPENCE: Well, I don't know if they have the votes. House Republicans are going to use every means at our disposal.\n\n\n\nCROWLEY: What is that?\n\n\n\nPENCE: Well, stay tuned, Candy. It's going to be an interesting day.\n\n\n\nCROWLEY: Can you disrupt the vote? I mean, what's available?\n\n\n\nPENCE: We are going to use every means at our disposal to oppose this government takeover of health care. Because quite frankly, as thousands gather at rallies all across this country and here in the nation's capital, yesterday, you know, the American people are sick and tired of runaway federal spending by both parties, of borrowing and bailouts and takeovers. And I believe this is going to be a historic weekend.\n\n\n\nLARSON: It is.\n\n\n\nPENCE: But I think it is going to be different from the way John thinks it is going to be. I think this is going to be a historic weekend because I think this weekend is going to be the beginning of the end of business as usual in Washington, D.C. I think the American people see an administration and see a Congress that are in a headlong rush to confront the very real challenges that we have in health care with more government instead of more freedom.\n\n\n\nThey know -- the Republicans have been offering solutions from the beginning. Let people purchase health insurance across state lines, pass malpractice reform, cover preexisting conditions. All of that can be done without a massive, trillion-dollar expansion of the federal government and burdening future generations with more deficits and more debt.\n\n\n\nCROWLEY: But the reality of this day is that you don't have the votes to stop it. You may have the means to delay it. PENCE: Right. You know, the Republicans, it shouldn't be a news flash to anybody, Republicans don't have the votes to stop anything in the House of Representatives. We are in a decisive minority.\n\n\n\nCROWLEY: (inaudible) politically.\n\n\n\nPENCE: But what's remarkable about this one-year debate has proven my point, that a minority in Congress plus the American people equals a majority. Republicans -- the reason they weren't able to do this last year -- remember all the deadlines? We had deadlines in the summer, we had deadlines in the fall, we had deadlines at the end of the year. The American people don't want this government takeover of health care. And I don't know if they have the votes today, but I guarantee you, the American people know they have the votes in America.\n\n\n\nLARSON: The American people who are already on Medicare, all of our veterans who already receive Tricare, understand the importance and the value of having insurance coverage. For 47 million Americans who have none, 31 million will now be able to have access to insurance, lowering costs, lowering costs for small businesses, lowering the national debt. First, $138 billion, and then $1.2 trillion. We can't afford not to do this. And taking care of those people--\n\n\n\n(CROSSTALK)\n\n\n\nCROWLEY: I want to talk about the debt. Hang on one second. I have got to take a small break--\n\n\n\n(CROSSTALK)\n\n\n\nCROWLEY: We will come back. I do want to talk about the costs. There are some figures out there floating. I'll do that, we'll be back with Congressmen Larson and Pence right after this.\n\n\n\n(COMMERCIAL BREAK)\n\n\n\nCROWLEY: We are back with Democratic Congressman John Larson of Connecticut and Republican Congressman Mike Pence of Indiana. We were talking about the cost of this. The CBO has said over 10 years this health care bill will reduce the deficit by $143 billion.\n\n\n\nHowever, that doesn't include what might come and what has been promised, with more than a wink and a nod to doctors, which is to up their Medicare payments, their reimbursements, which would cost $208 million, which then means it actually would be -- would add to the deficit.\n\n\n\nIs that -- is my math correct there? LARSON: Well, if that were to be true. But here is the thing, there is no question about the fact that we need to take care of the docs and we need to emphasize primary care. But also what never gets discussed, Candy, is something that Reuters came out with earlier this year, $700 billion annually in inefficiencies in this system, lack of interoperability in hospitals, lack of a continuum of care, and fraud and abuse -- $700 billion.\n\n\n\nI think that we're going to -- that's $7 trillion over a 10-year period. I think that we're more than going to be able to wring out the cost in there. I think that's why the president brought people down to Washington, to the White House, that's why he brought the six (ph) in to try to wring out those costs as we go forward.\n\n\n\nYou know, we spend 20 percent of gross domestic product. The closest country to us is Switzerland. I can't believe that we can't get that money out of there.\n\n\n\nCROWLEY: Can't we get that money out of there?\n\n\n\nPENCE: Yes, yes, we do such a great job here in Washington wringing out the cost.\n\n\n\nLARSON: Now that's in the private sector.\n\n\n\nPENCE: One-point-six trillion dollar deficit this year, you know, only in Washington D.C. could you say with a straight face that you are going to spend $1 trillion and save tax-payers money. Look, you point out the doc fix. This is a total fraud. The Democrats are leaving out $200 billion in spending that the speaker of the house committed again this week to spend, which makes this -- even using this CBO's numbers, it makes it a bill that adds to the deficit in the short term and in the long term.\n\n\n\nBut look, even beyond that, Candy, the American people know that you expand the federal government's role in health care without giving the American people more health care choices by purchasing across state lines, without passing any medical malpractice reform at all -- roughly a third of health care costs in this country I hear are actually defensive medicine driven by junk lawsuits.\n\n\n\nThe American people know this is going to cost more and add more to the deficit, add more to the debt, cost higher taxes even than the rosiest scenarios that are presented...\n\n\n\nLARSON: The CBO is the bible. The CBO says...\n\n\n\nCROWLEY: It is, but it's not always accurate, as you know.\n\n\n\nLARSON: We have arguments with them all of the time, but...\n\n\n\nCROWLEY: Somebody once told me that predicting...\n\n\n\nLARSON: ... that's all that we can -- that's all that we can vote on.\n\n\n\nCROWLEY: Sure, absolutely. But it still is one of those things that we might not find out...\n\n\n\nPENCE: And the president...\n\n\n\nCROWLEY: ... except for 10 years from now.\n\n\n\nLARSON: And the president has put in numerous reforms that are going to take effect, including the inability to rescind your insurance policy, pre-existing conditions. For women across this country, Candy, I mean, there birth is a pre-existing condition, domestic violence is a pre-existing condition, a C-section is a pre- existing condition, in-vitro fertilization, come on.\n\n\n\n(CROSSTALK)\n\n\n\nPENCE: My wife had to -- John, my wife had a pre-existing condition. I lost my job about 15 years ago. My wife had a pre- existing condition. She was pregnant with our daughter Audrey. We went to the state guarantee fund, a fund that would be replenished if we passed medical malpractice reform, we could use the savings to strengthen those funds to cover people like my wife was covered.\n\n\n\nYou don't need a government takeover of health care. You don't need to mandate that every American purchase health insurance whether they want it or need it or not, and you don't need to put us on a pathway towards socialized medicine.\n\n\n\nLARSON: Where is the takeover by the government?\n\n\n\nPENCE: And that's what this crowd is doing today.\n\n\n\nLARSON: Where is the takeover by the government? CROWLEY: Let me ask you something, just turn...\n\n\n\nLARSON: Humana runs Medicare currently. Tricare is run by them. Where is the takeover of government?\n\n\n\nPENCE: Well, I'll break it down. John, if you mandate that every American purchase health insurance, you mandate that every business provide it...\n\n\n\nLARSON: Do we mandate that people get car insurance?\n\n\n\nPENCE: ... you create a...\n\n\n\n(CROSSTALK)\n\n\n\nPENCE: ... so that people end up in government-run insurance, and you provide public funding for abortion, you mandate insurance plans, cover it within the exchange...\n\n\n\nLARSON: There is no funding for abortion in this bill.\n\n\n\nPENCE: It is a government takeover of health care.\n\n\n\nLARSON: There is no funding for abortion in this bill. It follows Hyde. That's not -- that's the case. PENCE: John, you know that is not true. The Catholic Church...\n\n\n\nLARSON: I know it's absolutely true.\n\n\n\nPENCE: ... the Catholic bishops, the right to life says...\n\n\n\nLARSON: Sixty thousand nuns can't be wrong.\n\n\n\nPENCE: ... public funding for abortions is in this bill.\n\n\n\nLARSON: Thank God for the sisters of Notre Dame, that's what I think.\n\n\n\nCROWLEY: Let me call a time here, because we are out of time. But for more of this, our audience can tune into the House debate starting this afternoon. And I suspect that pass or not pass, this debate continues as we watch how it goes.\n\n\n\nLARSON: That's right. Very strong disagreements. But Mike Pence is an honorable man. And I look forward to this debate, and as are our colleagues. I hope that we do ratchet down the conversation though, because when two of our colleagues are spat on and hurled racial slurs, it is time...\n\n\n\nCROWLEY: It did indeed happen.\n\n\n\nLARSON: ... it's time to ratchet down things a little bit.\n\n\n\nPENCE: Well, I'll tell you, I was in Selma with John Lewis, if what is reported to have happened was reported is contemptible, I denounce it in the strongest terms. But I assure you, this debate will not end today.\n\n\n\nLARSON: I agree with that.\n\n\n\nCROWLEY: Or probably on this show.\n\n\n\nLARSON: I agree with that.\n\n\n\nCROWLEY: Thank you very much, I appreciate it.\n\n\n\nLARSON: There is going to be a lot of work to go to...\n\n\n\nCROWLEY: If health care reform wins passage in the House today, the measure heads back to the Senate. Up next, a quick tutorial on what happens next. And then a conversation with Democratic Senator Dianne Feinstein and Republican Senator Orrin Hatch.\n\n\n\n(COMMERCIAL BREAK)\n\n\n\nCROWLEY: A quick reality check for those who today's House votes will bring us to the finish line, not quite, not yet. If House Democrats muster the votes today, two things happen. First the Senate version of health care reform will be passed by the House and will then be ready for the president to sign into law. Second, House Democrats will pass a fix-it bill, a companion measure of sorts to correct the things they don't like about the Senate measure. That bill has to go to the Senate. If the Senate goes the easy route, they will pass the fixes without change and send it off to the president. But if the Senate changes anything, if it adds or subtracts from the House measure, it must go back to the House for another vote before it goes to the president.\n\n\n\nSenate Republicans have some options which could delay or change the bill, including parliamentary challenges to any part of it as unrelated to the budget. Why didn't the \"Schoolhouse Rock\" teach us about this? We will do our best to get answers on what comes next from senators Orrin Hatch and Dianne Feinstein right after the break.\n\n\n\n(COMMERCIAL BREAK)\n\n\n\nCROWLEY: As we explained, even if the health care reform bill wins passage in the House later today, it still has another legislative hurdle to clear, back to the Senate for those changes or fixes, if you will, that House Democrats want.\n\n\n\nJoining us, Democratic Senator Dianne Feinstein of California and Republican Senator Orrin Hatch of Utah.\n\n\n\nSo the other day I noticed, Senator Hatch, that you said it would be nuts for anyone to believe that this is the House's last word on this. You think the Senate will change the fix-it bill that's coming over to you?\n\n\n\nHATCH: Well, if the rules are followed, they'd have to. Because there is a Social Security component. And you can't do that on reconciliation. There's also an appropriations component as well.\n\n\n\nSo if -- if the parliamentarian upholds that and Joe Biden doesn't overrule the parliamentarian, which would be a first, then it seems to me that it's going to have to be sent back to the House. So anybody that thinks that this is only going to be a one-time deal today in the House, I think, is grossly mistaken.\n\n\n\nCROWLEY: Senator Feinstein, do you think it's possible for the Senate to take that bill and just go, OK, fine with us?\n\n\n\nFEINSTEIN: Yes, I do. And I think that's exactly what we'll do. And I really disagree with my friend and colleague. I believe there are at least 51 votes there. I think the bill has been carefully vetted with the parliamentarian. I believe he will stand for each part of it.\n\n\n\nAnd the bill that the House passes today goes to the president. He signs it. Then the reconciliation bill comes over to us. We'll probably begin debate on Tuesday. It will be posted -- it takes some time -- begin debate on Tuesday.\n\n\n\nNow, I'm sure what Senator Hatch's party will do is submit a whole host of amendments. We'll have a major vote-a-thon. And this will go on for several days. And I believe, at the end, more than 51 Democrats will hold firm and will pass the reconciliation bill and we will have health care reform. I can say, for my state, the reconciliation bill is very important. Because we have now 8 million people without any insurance in California. The number has gone up 1 million people a year for the last two years. So this bill is necessary.\n\n\n\nCROWLEY: Senator Hatch, I want to ask you about the vote-a-thon, but I first want to play something Senator Reid said recently.\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nSEN. HARRY REID, D-NEV., SENATE MAJORITY LEADER: We're in the last minute of play. The shot clock is turned off. The other side knows what the outcome will be. So they're trying to foul us and foul us and foul us and foul us again, just to keep the clock from reading zero. They're not just delaying the inevitable; they're delaying the imperative.\n\n\n\n(END VIDEO CLIP)\n\n\n\nCROWLEY: Are you going on after -- after the shot clock has...\n\n\n\n(LAUGHTER)\n\n\n\nI mean, you know, Senator Feinstein calls it a vote-a-thon. I mean, is this the Republican approach to this now, is just to delay the inevitable?\n\n\n\nHATCH: Well, not really. I think it's to try and get amendments passed that really are valid amendments. I think, if you have a Social Security component in it, it has -- it has to come back to the House. And a parliamentarian has to rule the right way.\n\n\n\nBut who knows? I don't know what the parliamentarian is going to do. All I can say is this. You know, as I walk around this country, and I've been all over the country, people come up to me from everywhere, Democrats, Republicans, saying, we can't afford this; we can't do this. We do not even have solid, final scoring on this.\n\n\n\nAs a matter of fact, the actuary at CMS said he cannot get the final scoring. They also don't include the doc fix in it, which is $371 billion, and that's at present worth. And that doesn't even take care of Medicaid.\n\n\n\nOf the 31 million people you're going to cover, 16 million are pushed into Medicaid.\n\n\n\nI mean, let me just tell you, we're coming to a Europeanization of America. And the American people sense it. They feel it. They know that we can't afford this.\n\n\n\nAnd, frankly, the doc fix that they have on Medicaid...\n\n\n\n(CROSSTALK) HATCH: He's a letter -- here's a letter from my governor saying -- now, for two years, they say they'll hold the states free. But then you go off the clip because they cannot afford to pay for it in the federal government.\n\n\n\nAnd -- and Medicaid, they're paying -- the doctors are getting 66 percent of what the private sector pays doctors. And they're up in arms. They're not going to take patients now. You can imagine how bad this is going to be if this bill goes through.\n\n\n\nCROWLEY: Senator Feinstein, do you worry about either unintended consequences or changes in the economy that could, in the end, if this is made into law, really ruin some aspects of health care?\n\n\n\nFEINSTEIN: Well, of course. This isn't the perfect bill. We all know that.\n\n\n\nHATCH: Well, that's for sure.\n\n\n\nFEINSTEIN: We all know that there are going to have to be fixes down the road, just as every major program has had; Medicare has had; Social Security will likely have because of the explosion of costs.\n\n\n\nHaving said that, you have to look at the basics. And the basics are that we pay far more than European nations do for health care. And they have a much better performance.\n\n\n\nWe're about 15 percent; France is 10 percent. And in overall performance by the World Health Organization, France is ranked number one. I think we're ranked 17.\n\n\n\nWe spend a lot of money, but we don't necessarily spend it in the right way or the right places.\n\n\n\nNow, let me just finish. This bill is really important. Because, if we don't pass it now, you can forget health care reform forever after, I believe. So this is the opportunity. We're right at the goal line. I believe it's going to pass the House. It will be signed by the president. We should pass a reconciliation bill.\n\n\n\nAnd I would really appeal to my good friend, Senator Hatch. Let this reconciliation bill get passed. Then, you can see. If it's wrong, you'll certainly say so. If it works, hopefully, you'll say so as well.\n\n\n\nCROWLEY: And we'll get your answer right after this, because I've got to take a break. And we'll find out if you listened to her appeal, right after this.\n\n\n\n(COMMERCIAL BREAK)\n\n\n\nCROWLEY: We are back with two top senators, Democrat Dianne Feinstein and Republican Orrin Hatch.\n\n\n\nWhen last we met, she was asking if you would just let this reconciliation bill go through and see what happens. FEINSTEIN: Suggesting.\n\n\n\n(LAUGHTER)\n\n\n\nHATCH: Well, let me tell you, Republicans are dedicated against this bill. We consider it an awful bill.\n\n\n\nDo you realize they're going to subsidize families that make over -- families of four that make over $80,000 a year?\n\n\n\nI mean, we're getting to where 50 percent of the people in this country are going to depend on subsidies. And, of course, I know Dianne can't agree with that or doesn't believe in that.\n\n\n\nBut -- and all I can say is -- is, everywhere I go, people say, how do we pay for this? You know, in all honesty, they have jacked up the costs of Medicare. They're going to take better than $500 billion, now, out of Medicare. They're going to increase taxes by over $500 billion. They're going to sock it to individuals who don't -- who can't afford to buy insurance. They're going to have to pay 2.5 percent of their gross income.\n\n\n\nBusinesses are now going to have to pay up to $3,000 per employee if they don't provide health insurance.\n\n\n\nYou reach a point where you say, who is going to pay for all of this? And it's going to come down to us taxpayers. And like I say, it's the Europeanization of America, and that's the worst thing that could possibly happen to our country.\n\n\n\nCROWLEY: You -- you said earlier that, of course, there were things that worried you about the bill. If you looked at in the totality, what worries you the most?\n\n\n\nIs there anything that he says that you think, you know, yes, that is a worry of mine?\n\n\n\nFEINSTEIN: Well, there -- the bill is a combination of a number of different things designed to cover more people. The bill has very big strong points. For example, right away, there's a $5 billion fund for people with pre-existing conditions who can't get health insurance today.\n\n\n\nHATCH: We're both for that. We're both for that.\n\n\n\nFEINSTEIN: That's a very positive thing.\n\n\n\nHATCH: Sure.\n\n\n\nFEINSTEIN: So the bill, when really accumulated, the Congressional Budget Office says, will save, over 10 years, $138 billion.\n\n\n\nNow, Orrin will say, well, it's not this; it's not that; it's not the other thing. But that's the fact that we go on when we assess a bill. CROWLEY: But isn't also true, Senator...\n\n\n\nFEINSTEIN: So over 10 years, this bill, I'm confident, will not cost more.\n\n\n\nNow, as I said, are there certain parts that may have to be tweaked, that don't work exactly right? But he has given a litany of complaints about the bill. The thrust of the bill is to provide more people with coverage.\n\n\n\nOne of the good things the bill does is it reduces the nonpremium costs for those 85 percent of people that have medical health insurance. It reduces it from 20 percent to 15 percent so that more money from insurance companies will actually go for medical care. And I think that's important.\n\n\n\nCROWLEY: Politically, isn't it going to be hard to argue, should this bill pass, and we think it will, just given the numbers, to say, listen, people are now going to be -- not be thrown off their insurance because they got sick. There will be no more caps.\n\n\n\nFEINSTEIN: Exactly.\n\n\n\nCROWLEY: There will be help for people down the road, to help subsidize it. How can you argue against that? Isn't that a pretty political powerful package?\n\n\n\nHATCH: Well, I'm not arguing -- I'm not arguing against that. I think Republicans certainly -- we could agree on a large percentage of things together. But there was really no effort to get us involved.\n\n\n\nAll I can say is this, is that everywhere I go -- and I've said it over and over -- people say, how are you going to pay for this? How do you pay for it?\n\n\n\nNow, the CMS actuary -- that's the actuary for the administration -- says the cost curve will not be bent, that premiums are going to go up. I have to say that I believe that -- that CBO -- of course they have to decide these budgetary matters based upon the papers given them by the House of Representatives and by the Senate, and those papers are stacked in favor of trying to live within our means, but they don't.\n\n\n\nThe fact is that they double-count in this bill. They have all kinds of other gimmicks in this bill that try to get this bill down to -- everybody knows that this, extrapolated over 10 years, is going to be $2.5 trillion more on top of what we're already spending, $2.4 trillion.\n\n\n\nYou cannot tell me that this country can afford to do that and that we can't find a way, by working together, to really come up with a health care system that will work and work within financial means.\n\n\n\nCROWLEY: I'm going to give you the last short word. And that is, are you comfortable with the cost of this bill...\n\n\n\nFEINSTEIN: Yes.\n\n\n\nCROWLEY: ... and comfortable the country can afford it?\n\n\n\nFEINSTEIN: Yes. I believe we can. And I believe that will be sorted out over time.\n\n\n\nI think there's one thing that isn't in the bill, that the president was good enough to take my bill, which would give the secretary of health and human services some control over the rate of premiums to ensure that they are reasonable for people who have private-sector insurance. Unfortunately, the parliamentarian said that could not be added to the reconciliation bill. I have introduced it as a separate bill.\n\n\n\nI believe this is a huge problem out there. You have Anthem in California and 800,000 policies just jacking up premiums up to 39 percent in California and then saying there may be another increase in the middle of the year.\n\n\n\nAnd so people are being pushed off of their health insurance because of the cost of premiums. And this is one thing we need to strengthen, in my view, and hopefully will as a separate piece of legislation.\n\n\n\nCROWLEY: Senator Dianne Feinstein, Senator Orrin Hatch, I can't thank you both enough for coming. I appreciate it.\n\n\n\nFEINSTEIN: Thank you.\n\n\n\nHATCH: Thank you.\n\n\n\nCROWLEY: More of this on the Senate floor next week...\n\n\n\nFEINSTEIN: Oh, you bet.\n\n\n\nCROWLEY: ... we promise. (LAUGHTER)\n\n\n\nFEINSTEIN: Thank you.\n\n\n\nCROWLEY: Up next, in our \"American Dispatch,\" why, despite the claims of some politicians, it's hard to say exactly how most Americans feel about the health reform bill. And then Donna Brazile and Ben Bennett on the potential fallout for both Democratic and Republican lawmakers up for re-election this fall.\n\n\n\n(COMMERCIAL BREAK)\n\n\n\nCROWLEY: Our \"American Dispatch\" looks at a central question. What do Americans think?\n\n\n\nHouse Republican Leader John Boehner answers for Republicans.\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nBOEHNER: Because the American people are saying \"Stop,\" and they're screaming at the top of their lungs. (END VIDEO CLIP)\n\n\n\nCROWLEY: But are they? Two polls released this week leave lots of room for debate. A Pew poll released Thursday asks, \"Do you favor or oppose the current bill?\"\n\n\n\nOnly 38 percent said they favor it. So is Minority Leader Boehner right?\n\n\n\nA Wall Street Journal/NBC poll asks, \"Is it better to pass the Obama plan or keep the current system?\"\n\n\n\nThe respondents were split right down the middle.\n\n\n\nIs it in the way the question is asked? Are more people more likely to support it when it's called the Obama plan or is it that people think some change is better than no change?\n\n\n\nYou be the judge. We will sort through the complicated politics of all this with Donna Brazile and Bill Bennett after a short break.\n\n\n\n(COMMERCIAL BREAK)\n\n\n\nCROWLEY: Joining me here in Washington, two of my favorite people, CNN political contributor and Democratic strategist Donna Brazile and CNN political contributor and host of \"Morning in America,\" Bill Bennett, who is also author of the new book \"A Century Turns.\" These authors and stuff, OK.\n\n\n\nThe politics of all this. John Larson, head of the Democratic caucus, says they've got the 216, done deal, goes over to the Senate, Dianne Feinstein all confident they're going to pass it. It's going to be law. How does this all play out politically? I want to play you something the -- two things, actually, the president said yesterday. First, there was this.\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nOBAMA: I am actually confident -- I've talked to some of you individually -- that it will end up being the smart thing to do politically, because I believe that good policy is good politics.\n\n\n\n(END VIDEO CLIP)\n\n\n\nCROWLEY: OK, now, about two minutes later, he had this to say.\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nOBAMA: Now, I can't guarantee that this is good politics. Every one of you know your districts better than I do.\n\n\n\n(END VIDEO CLIP)\n\n\n\nCROWLEY: So, let's see, I'm thinking we're not really sure how the politics are going to play out. What do you think? BENNETT: Yes, well, as a former teacher of logic, he didn't contradict himself, because he said I believe this will be good politics because it's good policy, but I can't guarantee it. OK, we've heard that before.\n\n\n\nI think it's bad politics, because I think it's bad policy, and not just from a partisan point of view, but let me just do it analytically. You would not have so many nervous Democrats if this looked like it was really good politics. I don't think it is.\n\n\n\nAnd, again, I think, when we see how this plays out, one play will be in November with the midterm elections. Another play, we'll see what happens with budget issues.\n\n\n\nAnd since misrepresentations are all over the place in this -- in this proposal, and you look at a state like Massachusetts, which is a state closest to what this federal program is, I think they're going to regret it. Be careful what you wish for, Richard Butler (ph) said, because you may get it.\n\n\n\nCROWLEY: You know, Donna, what the White House is counting on -- what Democrats are counting on is that, after this is signed into law, people will go, \"Oh, you mean I won't be thrown my\" -- that there will be things in there, and their argument has always been, \"Well, they don't really know what it's in this bill.\" Is that going to work?\n\n\n\nBRAZILE: Well, it's true, Candy, that only 15 percent of voters understand what's inside the bill because we've been talking about the pie crust and not what's in the filling. And I think as soon as they understand that children with pre-existing conditions will not be kicked off their policies, small businesses will have access to an exchange that will help lower their costs and provide better coverage for their employees, I think as soon as they learn the details of this proposal, they will become very comfortable with it.\n\n\n\nAnd we all know that the -- that the price that the American people will pay if Congress fails to act is that their premiums will continue to rise $10,000 over the next 15 years. This is good policy, is good politics, it's good for the American people, it's good for the economy. There's no reason for Democrats to run away from this bill.\n\n\n\nCROWLEY: So you don't think that the Democrats are going to lose seats this November because of the health care bill?\n\n\n\nBRAZILE: Democrats will lose seats, Republicans will lose seats simply because there are open seats that will no longer go into the Democratic column. They will lose seats...\n\n\n\nCROWLEY: But not because of health care?\n\n\n\nBRAZILE: Well, health care, Candy -- and some Democrats might lose because the voters are simply tired of that Democrat and may be tired of Republicans, too. I don't think we should judge this bill based on who will win and who will lose if we're doing what's right for the American people, we're doing what's right for taxpayers. This is a good approach to trying to solve a very longstanding problem in this country.\n\n\n\nCROWLEY: And that's how the president sold it, right? It was like, don't...\n\n\n\nBENNETT: Sure.\n\n\n\nCROWLEY: ... Don't do this on politics. Do this because it's the right thing to do.\n\n\n\nBENNETT: Look, that's fine. Pericles says courage is the secret of democracy. The president has said something like that, too, do the courageous thing. I think some members of Congress, some Democrats have heard that as, \"Do what my conscience tells me,\" people like Bart Stupak, so we shall -- we shall see.\n\n\n\nBut hold the tape, this tape. Not to be mean, but Democrats will lose seats on this. They will lose a lot of seats. Again, this is what the nervousness is about.\n\n\n\nNow, if this turns out to surprise me and surprise a lot of people and be profoundly good policy, save the tape for that, too, because I will say to so. But look what happened in Massachusetts. You only had 4 percent uninsured. This thing opened the floodgates. What happens when you nationalize this kind of issue? You have states like Texas and California with 25 percent and 30 percent uninsured. This could bust the budget and really hurt the country.\n\n\n\nBRAZILE: Well, you know, what's disingenuous about the arguments that the opponents of health care reform will constantly give is that they're worried about the deficit, they're worried about the deficit. Well, if we do nothing, health care will...\n\n\n\n(CROSSTALK)\n\n\n\nBRAZILE: ... consume about 20 percent to 25 percent of our GDP. If we do nothing, individuals like myself and others who have individual policies will see their premiums continue to rise.\n\n\n\nIf the Republicans would like to somehow or another defend 39 percent increase in health care costs, children getting kicked off their policies simply because they have asthma, let them go out and defend that. Democrats will defend the substance of this and let the politics play out, you know, in November.\n\n\n\nBENNETT: Obamacare and doing nothing are not the only options. There are lots of other plans and lots of other ideas fully fleshed out, as Paul Ryan's plan that he wrote with Tom Coburn. This is a plan that never got to see the light of day, never allowed a scoring by CBO. We may revisit it again in the future when we see what this one wreaks.\n\n\n\nCROWLEY: Is this -- is health care the election issue, or is it really the economy?\n\n\n\nBRAZILE: It's the economy. It's the economy. It's jobs. It's people feeling secure about their own livelihood. It's the American dream that's at stake. And, look, Paul Ryan had a plan that covered 3 million Americans, reduced the deficit by $30 billion. This is a plan that will cover 32 million additional Americans and reduce the deficit over $138 billion in the next 10 years and, of course, $1.2 trillion over the next 20 years.\n\n\n\nIf this -- this is good policy. Republicans who are concerned about the deficit, like Democrats and independents, should get behind this bill.\n\n\n\nCROWLEY: Bottom line, Ryan won't pass. Is it...\n\n\n\nBENNETT: Right.\n\n\n\nCROWLEY: So it will be this. But is this the election-year issue or is it jobs?\n\n\n\nBENNETT: It's a big part of it, and jobs is a big part of it, but there's a larger thing, too, which is Washington and distrust of government. And who do they think they are? And don't they know, can't they read that a majority of us said we were opposed to this, we really don't like this?\n\n\n\nAnd when the costs start coming in -- and, by the way, when they count the doctor fix, which is going to put this in deficit, they will see it's more cost to the government, more cost to the taxpayer, higher taxes. It's going to cost the Democrats. It's bad policy, bad politics.\n\n\n\nBRAZILE: Let me -- let me quote -- let me -- let me quote Janet Jackson.\n\n\n\nCROWLEY: Make it a short quote.\n\n\n\nBRAZILE: What have you done for me lately? You've done nothing on jobs. You've done nothing on health care. You've done nothing to help fix this economy. The American people like to vote for something, not just against something.\n\n\n\nBENNETT: Well, they'll have the chance. They'll have the chance. And you will have your way, and the Democrats will rule on this, and probably get it, and then they will own the store.\n\n\n\nBRAZILE: Well, we're going to still love you, though.\n\n\n\nBENNETT: Well, I hope so.\n\n\n\nCROWLEY: The love-fest will continue. And they will be back, I promise you.\n\n\n\nBENNETT: We'll still be your favorites? We'll still be your favorites?\n\n\n\nCROWLEY: Still my favorites, I promise.\n\n\n\nBRAZILE: Thank you.\n\n\n\nCROWLEY: Ahead, my colleague and former \"State of the Union\" host John King is back here for a Sunday chat about his new show.\n\n\n\n(COMMERCIAL BREAK)\n\n\n\nCROWLEY: Let's check some of the stories breaking this Sunday.\n\n\n\nCongressman John Larson said earlier on this program that Democrats have the 216 votes necessary to pass health care reform in the House of Representatives. The vote is scheduled for later this afternoon. Republican Congressman Mike Pence said that his party will use every means at their disposal to oppose the measure.\n\n\n\nIt is a weekend of protests here in Washington. Opponents of the health care reform bill gathered outside the U.S. Capitol Saturday demanding that lawmakers kill the bill.\n\n\n\nAlso yesterday, hundreds held a demonstration to mark the seventh anniversary of the Iraq war.\n\n\n\nAnd today, as the House votes on health care reform, thousands are expected to gather here in the nation's capital to call on President Obama and Congress to take up immigration reform.\n\n\n\nNorth Dakota's Red River is expected to crest today. Several hundred thousand sandbags have been placed along the river's banks to keep the water at bay. So far, flooding has not been as bad as feared.\n\n\n\nTwo weeks after parliamentary elections in Iraq, the vote remains too close to call. Iraqi Prime Minister Nouri al-Maliki wants a manual recount. He says he's asking for it to preserve the integrity of the electoral process. So far, preliminary results show the prime minister's coalition is leading in seven of Iraq's 18 provinces.\n\n\n\nAnd Israeli Prime Minister Benjamin Netanyahu says his government will not stop building more Jewish settlements in disputed East Jerusalem. Announcement of the move during a recent visit to Israel by Vice President Joe Biden has called a strain in U.S.-Israeli relations. The Obama administration says additional settlements will undermine the Israeli-Palestinian peace process. Prime Minister Netanyahu is set to arrive in the U.S. for talks tomorrow.\n\n\n\nThose are your top stories here on \"State of the Union.\" Up next, John King, the man who used to sit in this very room, will be here for a preview of his new 7 p.m. show, \"John King, USA.\"\n\n\n\n(COMMERCIAL BREAK)\n\n\n\nCROWLEY: Loyal followers of \"State of the Union\" will want to watch -- in fact, I demand that they watch my colleague, John King's, new broadcast, \"John King, USA.\" It premiers tomorrow evening. It's a program with a distinctive look and feel. But this guy, who they're familiar with, let me first -- to start you, though, because you're going to be following this all next week...\n\n\n\n(CROSSTALK)\n\n\n\nCROWLEY: We hear -- and probably the week after.\n\n\n\nKING: And the week after.\n\n\n\nCROWLEY: John Larson says they got the votes. Do they?\n\n\n\nKING: Well, one of the deputy whips also said this morning not quite. I believe that -- you know how this works. We will see. Just as they're casting the votes, in the final minutes, there will be three or four people standing in a cluster over here and three or four standing in a cluster over there. They'll be talking to the whips and the leadership sources.\n\n\n\nAnd a few of them said, Madam Speaker, if you need me, I'll vote yes, but I'd like to keep my job and I'd prefer to vote no. And so they'll figure it out to the very end. So there -- they would not be doing this if they weren't confident they would get there at the end. There's always a few -- little bit of trading at the end.\n\n\n\nAnd then -- and you have had a fascinating discussion about it this morning -- then this becomes a Washington conversation from now to November and, more importantly, an American conversation between now and November. In this midterm election season, you know, sometimes we say this isn't about anything. This is going to be about something huge.\n\n\n\nCROWLEY: It's amazing, because you really could hear the campaigns revving up, sitting here, because everybody knows this train is -- has left the station and is about to pull up someplace.\n\n\n\nOK, tell me about the show. I mean, first of all, a whole -- I did watch it online when you did your -- your soft -- what do they call it, soft rollout or whatever that is? Just tell me about it and, like, what the feel is you're going for and what you're hoping to do.\n\n\n\nKING: On the set, we're trying to be a little bit more relaxed and casual, a little more personal. All my things are on the set. You'll see campaign buttons that I've collected for the last 25 years. You'll see a couple of Fenway Park signs and Red Sox logos. That's who I am.\n\n\n\nCROWLEY: Surprising.\n\n\n\nKING: Surprising. But it's like trying to bring somebody in your home or your place in a relaxed way to hopefully have more open and candid conversations. Day-to-day television is a little different from Sunday television. And, you know, I love what you've done with this space on Sunday.\n\n\n\nAnd, look, the mission of the program is to do -- take where you start here on Sundays and then project it out in the country. When these guys talk about we're on the side of the American people, let's see if the House and the Senate pass this bill if the American people feel that way between now and November, so we'll go to their communities. We're in their communities this week watching the protests, watching the debates, the phone calls come in to all these offices. We'll do it between now and November. This is one of the things in Washington that can seem like it's an all-Washington confrontation. Health care reform affects everybody; 309 million people in the United States of America will be affected one way or another by this bill, whether they like it or not. So let's cover the big debates here in Washington, but connect them to the impact out in the country. And that's what we're going to try to do.\n\n\n\nCROWLEY: So when I looked at it online, it really was -- it seems like you're going more for that conversational. It's not your sort of evening news broadcast. Is that the feel of it?\n\n\n\nKING: I think that's exactly right. It's a news program. It's not a traditional newscast. We want it to be a community and a conversation, not cable conflict, people going at it.\n\n\n\nIf you want to come in -- you can be on the far left and the far right, but come in to have a conversation that is about what's in the bill. Object to the specifics of the policy we're discussing -- discussing, not, say, because you're a D and I'm an R, you're evil and we're just going to yell at each other. Let's come in and let's have a conversation, keep it civil, but it can still be about something.\n\n\n\nAnd also we're going to reach out to people who don't live, breathe, eat, and sleep politics in Washington, D.C., but are involved in the process, people who are motivating all those conservatives. Maybe they're tea party people. Maybe they're new faces who are organizing the conservative community.\n\n\n\nAnd the same is on the left. As you know, one of the fascinating questions in this campaign, Republicans have the intensity right now, and conservatives -- not always the same thing. Can the left, if they pass this bill -- and that's what a lot of what this is about -- the president trying to say, look, we will lose if we don't get our base back in this election season. One way to try to get them back is to make the tough votes and pass this bill. So that's what we want to track.\n\n\n\nCROWLEY: \"John King, USA,\" 7 p.m. Eastern tomorrow night. Be sure and watch.\n\n\n\nKING: Thank you.\n\n\n\nCROWLEY: We will be there, as well. John and the rest of the best political team on television will also be here this afternoon for today's coverage of the health care vote. And until then, for our international viewers, \"World Report\" is next. For everybody else, \"Fareed Zakaria GPS\" starts right now.\n\n\n\n", "images": ["http://i.cdn.turner.com/cnn/.element/img/3.0/global/header/hdr-close.jpg", "http://cdn.cnn.com/cnn/images/1.gif", "http://i.cdn.turner.com/cnn/.element/img/3.0/global/header/nav-arrow.gif", "http://i.cnn.net/cnn/.element/img/1.0/sect/TRANSCRIPTS/header.transcripts.gif", "http://i.cnn.net/cnn/images/1.gif", "http://i.cdn.turner.com/cnn/.element/img/3.0/global/header/hdr-main.gif", "http://i.a.cnn.net/cnn/images/1.gif", "http://i.cnn.net/cnn/.element/img/1.0/sect/TRANSCRIPTS/shows_by_cat_white_header.gif", "http://i.cdn.turner.com/cnn/.element/img/3.0/global/header/hdr-arrow.jpg"], "top_img": "http://i.cdn.turner.com/cnn/.element/img/3.0/global/header/hdr-main.gif", "keywords": [], "authors": [], "canonical_link": "", "title": "Transcripts", "meta_data": {}, "movies": [], "publish_date": null, "source": "http://transcripts.cnn.com", "summary": ""}