{"url": "https://www.usatoday.com/story/life/movies/2018/11/30/netflix-christmas-prince-royal-wedding-sequel-awesomely-bad/2067396002/", "text": "If you thought Netflix's \"A Christmas Prince\" was awesomely bad, get ready for an awesomely worse sequel.\n\n\"A Christmas Prince: The Royal Wedding\" (available for streaming Friday) is the latest title that finds Netflix trying out the Hallmark Channel's signature brand of predictable holiday-movie schmaltz. It's up there along with Netflix movies such as \"The Princess Switch\" (which goes meta and even has one of its identical \"Let's swap lives\" strangers watch \"A Christmas Prince\") and \"The Holiday Calendar\" (about a magical Advent calendar).\n\nBut \"The Royal Wedding\" is the most awesomely bad of the bunch. It plays like a piece of Prince Harry and Duchess Meghan fan fiction, written by a child who actually doesn't know who they are but has watched the \"Princess Diaries\" films.\n\nI’m far from the first person to be delighted (while simultaneously horrified) by the “A Christmas Prince” movies. After the first film's release last year, \"Christmas Prince\" became everything from a social-media punchline to a hit (as far as we can tell, because Netflix doesn't share numbers), with the streaming service joking about how 53 people watched it 18 days in a row, and many people admitting they've seen it.\n\nHere’s why the \"Royal Wedding\" sequel is the best movie to mock this holiday season:\n\nIt has no idea what a journalist does.\n\nIn the first \"Christmas Prince,\" Amber (\"iZombie\" star Rose McIver) broke every ethical code of conduct on her first major writing assignment: to get intel on the bad-boy-who's-not-actually-bad Richard (Ben Lamb), the Aldovian (yes, sounds like \"Princess Diaries\" Genovian) prince reluctant to take his father's crown.\n\nShe took notes on Google Docs that included, literally, \"The prince still reluctant – WHY??? It's more than just nerves. Have to find out!!\"\n\nThough taking imbecilic typed notes is not a crime, this has to be: Amber sneaks into the castle after a news conference is canceled, then pretends to be young Princess Emily's tutor while secretly following the prince around. (Of course, she and the royal fall in love and get engaged after about a week of her lying to him. He becomes king after a scandal about adoption that we won't bore you with here.)\n\nAmber certainly didn't learn common journalism practices by the next movie.\n\nIn \"The Royal Wedding,\" wary of the fact that her fiancé's great plans for infrastructure seem to be angering Aldovians who are out of work, Amber decries, \"When numbers don’t add up, there’s usually a reason!\" She's on the case.\n\nBut instead of consulting her future husband or looking at public records about who the kingdom is employing (there are some shady employment practices going on), she has little Emily, her future sister-in-law, hack into a public works website's server to get information. Instead of talking to her husband and getting public records.\n\nDon't re-read that previous paragraph. It won't make any more sense the second time around.\n\nThere's a Meghan Markle reference that makes things even worse and therefore better.\n\nAside from the fact that Meghan and the fictional Amber are both Americans marrying royals, they also seem to have a total of one other thing in common: They were asked to shut down their blogs.\n\nThough Duchess Meghan seemed to have no problem with shutting down her lifestyle site, Amber objects. She says that her blog (which features stories that apparently weren't good enough for her old magazine employer to publish, because they fired her) is her \"living.\" By the way, her livelihood is made up of stories about the royal family that she at first exploited and now is a member of.\n\n“I never agreed to my work being censored,” Amber objects when her blog post is taken down because, um, it invades the privacy of the royal family. \"It was trending with tons of positive comments!\" the future queen whines. Meanwhile, she's also annoyed that people are overhearing her conversations and she can't have any privacy of her own.\n\nThe wedding is unexceptional.\n\nThis event will also call to mind the real-life royals. Like Meghan, Amber wears a long-sleeve white wedding gown and a simple updo. Unlike every other chick flick, the wedding is boring. There's no lavish decor and the food is catered by Amber's New Yawker dad, who says things such as \"Put 'er there.\"\n\nIn fact, unlike most movies with a wedding, Amber gets something like a make-under. Fortunately, her eye makeup was toned down from the first movie. Unfortunately, Richard's beard didn't grow back.\n\nThere are bunch of unintentionally funny moments.\n\nThe script includes lines probably meant to show that Amber is plucky and charming. They don't, but they're silly enough to make you giggle.\n\nAmber, frustrated that she's being followed around (forgetting that she stalked Richard while she was pretending to be a tutor): \"Seems like we need royal decree to go to the loo!\"\n\nAmber, unironically tracking down the right Christmas tree and not realizing she barely knows her fiancé: \"Finding the perfect tree is like finding the perfect man. It takes time.\"\n\nYou'll also laugh at the terrible green screen behind a toboggan and Richard's pretend piano playing, which doesn't come close to matching the music that viewers hear.\n\nIt's fun to recap for your friends.\n\nEven more fun than enduring a 90-minute story that proves its star is unfit to be queen? Retelling the plot to your friends over spiked cider and determining that you could write something far better.\n\nAfter all, Netflix's \"The Kissing Booth\" was inspired by a teenager's Wattpad story.\n\nSeriously, write something better. I'll watch it.", "images": ["https://www.gannett-cdn.com/presto/2020/04/16/USAT/4d8a8908-57d6-4c34-a2cc-f44dd8502152-b51007f0-adff-4d31-842a-49bf32e1ad1b_thumbnail.png?width=660&height=372&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/presto/2018/11/20/USAT/f4427e50-e438-4633-af32-4090aa880c8c-CPRW_004.jpg?crop=3839,2159,x0,y0&width=3200&height=1800&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/presto/2018/11/20/USAT/f4427e50-e438-4633-af32-4090aa880c8c-CPRW_004.jpg?crop=3839,2159,x0,y0&width=3200&height=1800&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/movies/2018/11/30/netflix-christmas-prince-royal-wedding-sequel-awesomely-bad/2067396002/", "title": "'A Christmas Prince: The Royal Wedding' is so awesomely bad, you must watch it", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "'A Christmas Prince: The Royal Wedding' is so awesomely bad, you must watch it", "description": "'A Christmas Prince' was terrible, and you watched it. Why stop now? Netflix sequel 'The Royal Wedding' is the best movie to mock this holiday season.", "url": "https://www.usatoday.com/story/life/movies/2018/11/30/netflix-christmas-prince-royal-wedding-sequel-awesomely-bad/2067396002/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/presto/2018/11/20/USAT/f4427e50-e438-4633-af32-4090aa880c8c-CPRW_004.jpg?crop=3839,2159,x0,y0&width=3200&height=1800&format=pjpg&auto=webp", "width": 3200, "height": 1800}, "type": "article"}, "article": {"author": "Carly Mallenbaum", "content_tier": "free", "opinion": "false"}, "description": "'A Christmas Prince' was terrible, and you watched it. Why stop now? Netflix sequel 'The Royal Wedding' is the best movie to mock this holiday season.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/presto/2018/11/20/USAT/f4427e50-e438-4633-af32-4090aa880c8c-CPRW_004.jpg?crop=3839,2159,x0,y0&width=1600&height=800&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "'A Christmas Prince: The Royal Wedding' is so awesomely bad, you must watch it", "description": "'A Christmas Prince' was terrible, and you watched it. Why stop now? Netflix sequel 'The Royal Wedding' is the best movie to mock this holiday season."}}, "movies": [], "publish_date": 1543507200.0, "source": "https://www.usatoday.com", "summary": ""}