{"url": "http://www.pethealthnetwork.com/dog-health/dog-diseases-conditions-a-z/cleft-lip-and-palate-puppies", "text": "Cleft lip (often referred to incorrectly as a “hair lip” or more appropriately as palatoschisis or congenital oronasal fistula) and cleft palate are birth defects that occur when a puppy’s lip or mouth do not form properly during pregnancy. Together, these birth defects commonly are called “orofacial clefts.” These birth defects happen early during pregnancy. A newborn dog can have a cleft lip, a cleft palate, or both a cleft lip and cleft palate. The word “cleft” pertains to split or partially divided in two.\n\nCause of cleft lip and palate\n\nCleft lip occurs if the tissue that makes up the lip does not join completely before birth. This results in an opening in the upper lip. The defect that results can be a very small slit or may be a large opening that extends into the nose. Puppies with a cleft lip can also have a cleft palate.\n\nCleft palate happens if the tissue that makes up the roof of the mouth does not join together completely during pregnancy. The result is a defect between the mouth and the nasal sinus area. Cleft palate may involve any part or all of the palate. It may be quite small or extend the entire length of the palate. The cleft, or opening, can extend along the bony portion (hard palate), the flexible portion used in swallowing (soft palate), or both.\n\nIncidence of clefts\n\nThe incidence of orofacial clefts occurs more commonly in purebred dogs and brachycephalic breeds, with their short stubby faces, such as Beagle, Dachshund, English bulldog and Shih Tzu1.\n\nClinical signs of clefts\n\nClinical signs of cleft palates may vary. Those involving the lip and front of the palate (primary clefts) are fairly obvious since the lips, nose and teeth are divided left and right and are readily visible. Those involving the palate farther to the rear may be less apparent. Sneezing, passage of milk through the nostrils when nursing, coughing, chronic infections in the sinuses and failure to grow or “thrive” may all be associated with cleft palate2.\n\nDiagnosis of clefts\n\nThe diagnosis of orofacial clefts is generally direct observation and so is only a matter of being thorough. Examination of the soft palate may require anesthesia to visualize the entire palate. x-rays may be indicated to check for the presence of pneumonia.\n\nPrognosis of clefts\n\nSmall clefts of the lips rarely cause troubles but may be cosmetically unacceptable.\n\nLarge clefts or those involving the palate often result in an inability to eat normally and therefore a failure to grow and develop normally. They often result in chronic nasal infections, sinus infections and pneumonia. Surgical repair is indicated but difficult in so young and so tiny a patient. Feeding is best accomplished using an oral feeding tube which is readily learned by pet owners.\n\nTreatment of clefts\n\nThe only effective treatment for clefts involving the lips and palate is surgical closure. Depending on the extent of the cleft this repair may be relatively simple or may be complex particularly in puppies. If possible, the puppy should be supported by feeding with a tube until 3-4 months of age to allow the opening to grow smaller and the oral cavity larger.\n\nPrevention of clefts\n\nGenetics is considered the main cause of this problem, but nutritional deficiencies, viruses, and poisons that affect the mother during pregnancy may also increase the risk of cleft palates. There is evidence that excess doses of Vitamin A may increase the risk of the syndrome1.\n\nCortisone drugs should be avoided during early pregnancy in particular Hydroxyurea -- a drug used to treat cancer -- should be avoided1.\n\nBecause of the likely genetic involvement in this condition, affected dogs should not be used for breeding3.\n\nAlways consult with your veterinarian about issues involving nutrition and breeding.\n\nQuestions to ask your veterinarian\n\nOne puppy in my new litter of Boston terriers blows milky bubbles out of her nostril when she nurses. Is that normal?\n\nI am a believer in vitamins to prevent problems. Should I give my pregnant dog high doses of vitamins to assure healthy puppies?\n\nIf you have any questions or concerns, you should always visit or call your veterinarian -- they are your best resource to ensure the health and well-being of your pets.", "images": ["http://www.pethealthnetwork.com/sites/default/files/phnlogo_5_1_0_1.png", "http://www.pethealthnetwork.com/sites/default/files/styles/thumbnail/public/drmikepaul_2.jpg?itok=4fA2_FPV", "http://www.pethealthnetwork.com/sites/default/files/content/images/cleft-lip-and-palate-puppies-fb-185139420.jpg", "http://www.pethealthnetwork.com/sites/default/files/cleft-lip-and-palate-puppies-185139420.jpg", "http://www.pethealthnetwork.com/sites/default/files/steve-dale-covid-banner.png", "http://www.pethealthnetwork.com/sites/all/modules/revslider/images/transparent.png"], "top_img": "http://www.pethealthnetwork.com/sites/default/files/content/images/cleft-lip-and-palate-puppies-fb-185139420.jpg", "keywords": [], "authors": [], "canonical_link": "http://www.pethealthnetwork.com/dog-health/dog-diseases-conditions-a-z/cleft-lip-and-palate-puppies", "title": "Cleft Lip and Palate in Puppies", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "og": {"image": "http://www.pethealthnetwork.com/Property%20field_image", "site_name": "Pet Health Network", "type": "article", "url": "http://www.pethealthnetwork.com/dog-health/dog-diseases-conditions-a-z/cleft-lip-and-palate-puppies", "title": "Cleft Lip and Palate in Puppies", "description": "Cleft lip and cleft palate are common birth defects in puppies. Learn more about the cause and treatment of this oral deformity."}, "msvalidate.01": "16E38BE15F1C35903C8CAAEF94426418", "google-site-verification": "6Fl1-Wc8J-xnApTeCx21Q1YrHKxZ7mdk5DlnDZYijv0", "shareaholic": {"site_name": "Pet Health Network", "language": "en", "site_id": "04281b0a2d6f0cd33c50330280db7242", "drupal_version": "7.x-3.28", "url": "http://www.pethealthnetwork.com/dog-health/dog-diseases-conditions-a-z/cleft-lip-and-palate-puppies", "article_published_time": "2015-03-05T13:03:11-05:00", "article_modified_time": "2015-03-06T17:15:13-05:00", "article_author_name": "amarathe", "keywords": "dogs, site sections, puppies, genetics, pregnancy, beagle, dachshund, english bulldog, shih tzu, mouth, dog diseases & conditions a-z, site topics", "image": "http://www.pethealthnetwork.com/sites/default/files/content/images/cleft-lip-and-palate-puppies-fb-185139420.jpg"}, "description": "Cleft lip and cleft palate are common birth defects in puppies. Learn more about the cause and treatment of this oral deformity.", "generator": "Drupal 7 (http://drupal.org)"}, "movies": [], "publish_date": null, "source": "http://www.pethealthnetwork.com", "summary": ""}