{"url": "https://en.wikipedia.org/wiki/Big_Little_Lies_(TV_series)", "text": "American television series\n\nBig Little Lies is an American drama television series based on the novel of the same name by Liane Moriarty. Created by David E. Kelley, it premiered on HBO on February 19, 2017. The seven-episode first season was written by Kelley and directed by Jean-Marc Vallée. Despite being originally billed as a miniseries, HBO renewed the series for a second season.[2] Production on the second season began in March 2018 and it premiered on June 9, 2019.[3] All seven episodes were written by Kelley and directed by Andrea Arnold.[5]\n\nBig Little Lies stars Reese Witherspoon, Nicole Kidman, Shailene Woodley, Laura Dern, and Zoë Kravitz, and tells the story of five women in Monterey, California who become embroiled in a murder investigation. Alexander Skarsgård, Adam Scott, James Tupper, Jeffrey Nordling, Kathryn Newton, and Iain Armitage feature in supporting roles. Meryl Streep joined the main cast for the second season.\n\nThe series has received critical acclaim, particularly for its writing, directing, acting, cinematography, and soundtrack. Its first season received 16 Primetime Emmy Award nominations and won eight, including Outstanding Limited Series and acting awards for Kidman, Skarsgård, and Dern. The trio also won Golden Globe Awards in addition to a Golden Globe Award for Best Miniseries or Television Film win for the series. Kidman and Skarsgård also received Screen Actors Guild Awards for their performances.\n\nCast and characters [ edit ]\n\nMain [ edit ]\n\nRecurring [ edit ]\n\nEpisodes [ edit ]\n\nOverview of Big Little Lies Season Episodes Originally aired First aired Last aired 1 7 February 19, 2017 ( ) April 2, 2017 ( 2017-04-02 ) 2 7 June 9, 2019 ( ) July 21, 2019 ( 2019-07-21 )\n\nSeason 1 (2017) [ edit ]\n\nBig Little Lies season 1 episodes No.\n\noverall No. in\n\nseason Title Directed by Written by Original air date U.S. viewers\n\n(millions) 1 1 \"Somebody's Dead\" Jean-Marc Vallée David E. Kelley February 19, 2017 ( ) 1.13[6] At a public school in Monterey, California, a murder suddenly occurs on trivia night, but neither the victim nor the murderer is revealed. Backtracking to the first day of school, the families of five first-graders are introduced. Madeline Martha Mackenzie is a strong-willed, wealthy, and feared alpha female in town with a first-grade daughter and teenage daughter from an earlier marriage. Secrets are revealed, including that Madeline is struggling to cope with her ex-husband Nathan's marriage to a yoga instructor named Bonnie and also trying to build a relationship with her older daughter. Her friend, Celeste Wright, is a retired lawyer and the mother of twin sons who are also beginning at the same school. New to town is Jane Chapman – a young single mother raising her son, Ziggy. Madeline and Celeste befriend Jane. The equally wealthy and feared Renata Klein's daughter Amabella accuses Ziggy of attempting to choke her, which he denies. Celeste appears to have a very happy life with her husband Perry, but he starts to show signs of being violent. Jane's motives for moving to Monterey are unknown. 2 2 \"Serious Mothering\" Jean-Marc Vallée David E. Kelley February 26, 2017 ( ) 0.56[7] Perry lashes out at Celeste when he discovers he missed orientation at the school, but she lets it slide. Jane looks for work with little success, and Madeline goes on the warpath against Renata when it is revealed Renata did not invite Ziggy to Amabella's birthday party. Ed questions Madeline's devotion to him when she continues to complain about seeing Nathan with Bonnie all the time, and Madeline is further disturbed when Bonnie takes Abigail, Madeline's oldest daughter, to Planned Parenthood. Nathan tries to come to a peaceful resolution with Ed about their parenting of Abigail, but Ed senses Nathan trying to intimidate him and stands firm. Madeline's younger daughter, Chloe, and Bonnie's daughter, Skye, attempt to mend the wounds between Ziggy and Amabella but it leads to an incident of unwanted affection and the parents of the four children are called into the principal's office, leading Jane to have a flashback of an unwanted episode. 3 3 \"Living the Dream\" Jean-Marc Vallée David E. Kelley March 5, 2017 ( ) 1.04[8] Perry chokes Celeste when he believes she deliberately left him out of a family gathering, after which Celeste threatens to leave him. Renata's party for Amabella is a huge success but she is ultimately upset when Madeline invited Amabella's closest friends and Ziggy to Disney on Ice on the same day. At therapy, Perry claims his outbursts are out of fear that Celeste does not love him, which Celeste attempts to deny. When Abigail's academic performance begins to decline, her guidance counselor suggests it is being caused by stress at home, so she decides to live with Nathan, much to Madeline's dismay. Jane gets Ziggy involved with more extracurricular activities and helps him construct a family tree for school with Madeline's help. However, Jane opposes Ziggy’s insistence upon putting his father's name on the tree, and she ultimately confides to Madeline that Ziggy was the result of rape by a man named Saxon Banks, whom she has not seen since. 4 4 \"Push Comes to Shove\" Jean-Marc Vallée David E. Kelley March 12, 2017 ( ) 1.04[9] Abigail moves in with Nathan and Bonnie. Celeste legally represents Joseph and Madeline in a meeting with the Mayor regarding the controversial Avenue Q, and successfully persuades the Mayor to allow the play to proceed. In the process, Celeste realizes her desire to return to work. She asks her therapist how to best convince Perry but Dr. Reisman is more concerned with why she is afraid to do so. At home, Perry tells Celeste not to attend any future meetings. When she refuses, he grabs her by the throat but quickly relinquishes when one of their boys enters the room. Joseph and Madeline kiss and it is revealed they had an affair a year ago. Madeline locates a man online whom she believes to be Saxon Banks. She informs Jane and Celeste, and they plan to travel to San Luis Obispo to confront him. Ms. Barnes, the teacher, suspects Amabella is still being bullied. Despite Amabella's assertions that she and Ziggy are friends, Ms. Barnes requests Jane to have Ziggy psychologically evaluated, but the psychologist believes that Ziggy is innocent and that he may actually be being bullied himself. 5 5 \"Once Bitten\" Jean-Marc Vallée David E. Kelley March 19, 2017 ( ) 1.17[10] Nathan spots Jane at the gun range and tells Madeline. Although Jane reassures Madeline that she carries a gun solely for its psychological benefits, Madeline begins to regret tracking down Saxon Baker, the man whom she believes to be Saxon Banks. Renata discovers a bite mark on Amabella's arm, but Amabella refuses to disclose who bit her. Renata assumes it is Ziggy and a meeting is held between Jane and the school principal. Joseph is convinced Madeline still has feelings for him but she maintains that their affair is over. While they argue, a teenage distracted driver crashes into their car. Madeline is uninjured, while Joseph is hospitalized. The incident raises suspicion from Ed and Joseph's wife, Tori. Perry is angered when Celeste does not ask the twins to tidy their toys. A confrontation triggers further violence from Perry, followed by aggressive sex. Later, Dr. Reisman confronts Celeste with the belief that she is being abused; Celeste eventually reveals that she has previously feared for her life and had considered leaving Perry. Dr. Reisman urges her to do so. Jane secretly travels to San Luis Obispo to confront Saxon Baker, taking her gun with her. 6 6 \"Burning Love\" Jean-Marc Vallée David E. Kelley March 26, 2017 ( ) 1.39[11] Jane reveals to Madeline that she went to confront Saxon Baker, who turned out to be the wrong man. Madeline attempts to convince Jane to give up the search. Ms. Barnes relays to Jane that a petition has begun to have Ziggy suspended. Although Renata did not start it, Jane confronts her and accidentally gouges her eye. She later apologizes, realizing that they both want to protect their children. Renata forgives Jane and reveals her plan to schedule play-dates with each of Amabella's classmates to discover who is hurting her. Celeste's therapist advises her to prepare to leave Perry by renting an apartment and disclosing the abuse to friends. Later, Perry tries to initiate sex with Celeste, who defensively fractures his penis with a tennis racket. Returning from the hospital, Perry tells Celeste that she is \"lucky\" that he did not kill her. The following day she begins looking for an apartment. At the opening night of Avenue Q, Tori confronts Madeline about having an affair with Joseph. At home, Madeline and Ed have another argument about her lack of passion toward him, which culminates in her alluding to having made a \"terrible mistake\". Bonnie tells Nathan that Abigail's \"secret project\" is auctioning her virginity to raise money for Amnesty International. At their couples dinner, the two reluctantly tell Madeline and Ed. Madeline furiously confronts Abigail, disclosing her affair in the process. 7 7 \"You Get What You Need\" Jean-Marc Vallée David E. Kelley April 2, 2017 ( ) 1.86[12] Following another beating, Celeste decides to leave Perry the day after trivia night. Ziggy confesses to Jane that it was Max, one of Celeste's sons, who choked Amabella. Madeline talks to Joseph about his wife knowing about their affair, and Jane woefully tells Celeste that her son is the bully. Celeste realizes that Max was emulating Perry’s abuse, having overheard it while he was playing a video game. When preparing to leave for trivia night, Perry sees a text message on Celeste's phone from the landlady of her new apartment. He confronts her on the way to the party, but is interrupted by Renata. At the party, Celeste tells Renata that Max is the bully and Amabella framed Ziggy out of fear of Max. Meanwhile, a drunk Madeline runs away during Ed's singing performance after realizing just how much he loves her and how little she gives him in return. Jane goes after her and finds her atop stairs at the back of the venue. Madeline tells Jane that she cheated on Ed. Renata also goes after them and apologizes to Jane for having blamed Ziggy. Celeste joins the women, followed by Perry. Bonnie follows them and watches the group from afar. Jane sees Perry and realizes that he is Saxon Banks. Perry pleads with Celeste to come back home with him and when she declines, he viciously attacks her. The group unsuccessfully fights Perry off until Bonnie rushes in and pushes him down the stairs, killing him. In police interviews, the women confirm that there was a fight with Perry but claim he fell accidentally. Later, the five women and their children lounge at the beach, where Detective Quinlan continues to watch them.\n\nSeason 2 (2019) [ edit ]\n\nBig Little Lies season 2 episodes No.\n\noverall No. in\n\nseason Title Directed by Written by Original air date U.S. viewers\n\n(millions) 8 1 \"What Have They Done?\" Andrea Arnold Teleplay by : David E. Kelley\n\nStory by : David E. Kelley and Liane Moriarty June 9, 2019 ( ) 1.42[13] In the aftermath of Perry's death, Celeste, Madeline, Jane, and Renata try to move on with their lives, while Bonnie considers turning herself in to the police. It is the first day of second grade for the children, and the five women reunite. Perry's mother, Mary Louise, who is staying with Celeste, begins asking questions about her son's death, and clashes with Madeline. Nathan worries about how distant Bonnie has been with him and asks Ed for help. Abigail decides she will not go to college, to Madeline's disapproval. At the beach, Corey, a co-worker of Jane's, asks her if she is one of the \"Monterey Five\". Jane tells the other women (apart from Bonnie) about this, and Renata assures them that the police have nothing. Celeste has nightmares about Perry and Mary Louise questions her about them. 9 2 \"Tell-Tale Hearts\" Andrea Arnold Teleplay by : David E. Kelley\n\nStory by : David E. Kelley and Liane Moriarty June 16, 2019 ( ) 1.47[14] Celeste crashes her car while on Ambien, with no recollections of what happened. A worried Nathan calls Bonnie's parents to town. Gordon is arrested for insider trading and stock fraud by the FBI. Renata is dumbfounded that he is playing with an expensive train set while he has lost all of their money. Mary Louise finds out about Ziggy's parentage from Max and Josh. She refuses to believe that Perry raped Jane by victim blaming her. Madeline grounds Chloe after finding out that she told Max, Josh, and Ziggy that the three boys share the same father. Jane reluctantly tells Ziggy about how he is the product of a rape. Ed discovers Madeline's infidelity. 10 3 \"The End of the World\" Andrea Arnold Teleplay by : David E. Kelley\n\nStory by : David E. Kelley and Liane Moriarty June 23, 2019 ( ) 1.62[15] Bonnie clashes with her mother, and remembers traumatic incidents from her childhood. Amabella has an anxiety attack during a lesson about climate change. Renata hires a child psychologist and finds out Amabella is worried about the planet dying, her father going to jail as well as Renata's mental state. Renata blames Gordon for it and confronts Principal Nippal and Mr. Perkins about teaching second graders about climate change. Mary Louise approaches Jane at work and requests for a paternity test be done, which Jane refuses. Mary Louise then lurks in the parking lot of Jane's apartment to take a look at Ziggy. She finds similarities between Ziggy and Perry's twin brother, who died as a child, but refuses to accept the fact that Perry was abusive and a rapist. To save their marriage, Madeline and Ed visit Celeste's therapist. During a parents meeting at Otter Bay Elementary, Madeline breaks down while speaking. Jane and Corey go on a date, but she is unable to be intimate with him. 11 4 \"She Knows\" Andrea Arnold Teleplay by : David E. Kelley\n\nStory by : David E. Kelley and Liane Moriarty June 30, 2019 ( ) 1.61[16] During a pumpkin carving party at Madeline's house, Mary Louise turns up uninvited. Mary Louise gets an apartment in the same building as Jane, which Celeste deems overstepping her boundaries. When Mary Louise subtly insinuates that Perry was womanizing to seek refuge from Celeste, Celeste slaps her. The next day, over coffee with Celeste, Mary Louise admits her husband left her after the death of Perry's brother and that she deserved the blame. Mary Louise approaches lawyer Ira Farber to gain custody of her grandchildren, citing negligence by Celeste. Madeline and Ed's marriage continues to deteriorate. Renata and Gordon have a disastrous bankruptcy hearing when she refuses to cooperate. At Amabella's birthday party, Jane tells Corey about her rape and Bonnie's mother has a stroke after seeing a vision of Bonnie drowning. 12 5 \"Kill Me\" Andrea Arnold Teleplay by : David E. Kelley\n\nStory by : David E. Kelley and Liane Moriarty July 7, 2019 ( ) 1.77[17] Celeste refuses a settlement offer from Mary Louise’s lawyer for joint custody of the boys, and the case goes to trial. Renata tries to get Mary Louise to drop the case, who in turn taunts her for being a working mother. Ziggy is bullied by a boy, who calls him a mistake and that his father is a rapist; Max and Josh defend him and the three of them beat up the bully, leading to their suspension. Jane tries to be intimate with Corey but the trauma causes her to break down. Celeste, Jane, Corey and the three boys go on a kayak trip during their suspension, while Renata and Amabella make use of this opportunity to bond as mother and daughter at the pool. Ed and Madeline go to couples therapy, where Madeline promises that she will not make the same mistakes again. Later, Tori hits on Ed at a bar, with Joseph staring at them from a nearby table. At the hospital, Bonnie's mother asks her to pull the plug. A distraught Bonnie once again considers turning herself in to the police, but on her way to a police station spots Corey leaving it. 13 6 \"The Bad Mother\" Andrea Arnold Teleplay by : David E. Kelley\n\nStory by : David E. Kelley and Liane Moriarty July 14, 2019 ( ) 1.63[18] Celeste and Mary Louise go to trial to battle for the custody of Max and Josh. Celeste is completely shocked and hurt when Mary Louise's lawyer asks her a wide array of personal questions. Celeste explains that she is coping with grief and intends to improve herself and get better. Just before the judge announces the verdict, Celeste interrupts to say that Mary Louise never took the stand and that isn't fair. Celeste herself wants to question Mary Louise and the judge agrees. Ed meets with Tori, who comes on to him and tells him that she has fantasized about him. Madeline approaches Ed again and says that she wants to try to work it out. Jane questions Corey about his presence at the police station and he tells her that he was just called in for questioning by the detective, who asked him if Jane has ever talked with him about the night Perry died. Corey claims that he told the detective nothing. Though mildly reassured, Jane stops answering his calls and texts because she says she isn't ready for something new just yet. Bonnie confesses everything (including pushing Perry and her resentment towards her mother) to her mom, while she is in a coma. as she thinks her mother is going to die soon and that this may be her last chance to say anything. 14 7 \"I Want to Know\" Andrea Arnold Teleplay by : David E. Kelley\n\nStory by : David E. Kelley and Liane Moriarty July 21, 2019 ( ) 1.98[19] Mary Louise is questioned in court by Celeste, where Mary Louise is asked about Perry's brother's death and how he coped and how she treated him. Later Celeste shows a video that her son took of Perry physically abusing her, and claims that Mary Louise would raise her own sons to be similar abusers. Celeste ends up with full custody, and Mary Louise leaves Monterey Bay. Bonnie tells her mother she loves her just before she dies and tells Nathan she doesn't love him. Ed and Madeline renew their vows. Jane and Corey progress in their relationship with Ziggy's approval. Gordon arranges to keep his train set despite the repossession of their other property, to the disapproval of Renata who furiously destroys it and leaves him. Finally, Bonnie texts the rest of the Monterey Five that she is going to confess, in response to which all four women accompany her to the police station.\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nOn August 6, 2014, it was announced Nicole Kidman and Reese Witherspoon had optioned the screen rights to Liane Moriarty's novel Big Little Lies. The actresses were expected to develop the project as a film in which they would both star. Bruna Papandrea and Per Saari were set to executive produce alongside Kidman and Witherspoon. Moriarty was also expected to produce as well.[20] On November 25, 2014, it was announced that Kidman and Witherspoon had decided to develop the project into a limited television series instead of the originally planned film. Additionally, it was announced that television series would be written by David E. Kelley.[21] On May 8, 2015, it was announced that HBO had given the production a series order and that in addition to writing, Kelley would also executive produce.[22] On October 23, 2015, it was reported that Jean-Marc Vallée was in talks to direct the first episode of the series with the potential to direct more.[23] On December 17, 2015, it was announced that Vallée would direct all seven episodes of the series.[24] On November 28, 2016, it was announced that the series would premiere on February 19, 2017.[25]\n\nThe show was initially conceived of and billed as a miniseries[26] of seven episodes. In the wake of the Emmy nominations, Reese Witherspoon said: \"As of right now, I think it's pretty whole. I feel really good about where it is, and if this is all it ever was, it's a beautiful thing we all accomplished together\",[27] while Vallée came out strongly against the idea of producing a second season: \"There's no reason to make a season two. That was meant to be a one-time deal, and it's finishing in a way where it's for the audience to imagine what can happen. If we do a season two, we'll break that beautiful thing and spoil it\".[28] Later, when the show garnered an array of critical accolades, he changed his mind: \"It'd be great to reunite the team and to do it. Are we going to be able to do it, altogether? I wish.\"[29]\n\nSecond season [ edit ]\n\nIn July 2017, two weeks after the series was nominated for the Primetime Emmy Award for Outstanding Limited Series, HBO revealed that a second season was possible, and that Moriarty had been asked to write a story for it.[30] In December 2017, after the Critics' Choice Television Award and Golden Globe Award nomination voting periods were over,[31] HBO officially renewed the series for a seven-episode second season to be written by Kelley, directed by Andrea Arnold,[32] and based on a new novella by Moriarty.[26] Vallée remains an executive producer of the series.[33] Meryl Streep joined the cast as the mother of Alexander Skarsgård's character.[34]\n\nThe announcement of the second season, and—specifically—its timing, enraged the producers of rival shows that were competing for award nominations in the limited series category, particularly since the announcement was made after voting for the Critics' Choice Awards and Golden Globe Awards had ended. The Producers Guild of America restarted voting for the 2018 PGA Awards, reclassifying the show from a limited series to a drama series.[35][36]\n\nIn July 2019, it was reported by IndieWire that director Andrea Arnold lost creative control after filming had completed, and it was given to season 1 director Jean-Marc Vallée in an attempt to unify the style between the seasons. Arnold was initially promised by HBO that the show would be done in her vision, including post-production, and was unaware that Vallée would edit the footage she had shot. Once Vallée completed his work on Sharp Objects, he took over the editing process along with his own editorial team in Montreal. HBO also ordered 17 more days of additional photography, to be filmed by Arnold, but were overseen by Vallée. Significant reworking of the episodes also took place, where episodes were shortened.[37] In response, HBO programming president Casey Bloys stated, \"There's a lot of misinformation around that subject\" and \"the director typically does not have final creative control\". Bloys clarified that Vallée came back to \"hone the episodes\" after being asked by the entire producing team, including Reese Witherspoon and Nicole Kidman, and that they were clear with Arnold about how the process would work from the start.[38]\n\nFuture [ edit ]\n\nHBO president Casey Bloys said a third season of the show was \"not realistic\" due to scheduling the show's actors. However, Bloys mentioned that HBO is more than willing to greenlight a third season if the cast are able to work out their schedules.[39]\n\nCasting [ edit ]\n\nSeason 1 [ edit ]\n\nAlongside the initial announcement of the production's development, it was reported that Kidman and Witherspoon would also star in the adaptation.[21][22] In December 2015, it was announced that Shailene Woodley, Adam Scott, Laura Dern, and Zoë Kravitz had joined the cast in lead roles.[40][41][42][43] On January 5, 2016, it was announced that Alexander Skarsgard and James Tupper had joined the main cast and that Jeffrey Nordling, Santiago Cabrera, P. J. Byrne, Kelen Coleman, Sarah Burns, Darby Camp, Cameron and Nicholas Crovetti, Ivy George, Chloe Coleman, Virginia Kull, Sarah Baker, Kathreen Khavari, Larry Bates, Hong Chau, and Gia Carides had joined the show's supporting cast.[44] A few days later, it was reported that Iain Armitage had joined the cast in the role of Woodley's character's son.[45] Soon after that, it was reported that Merrin Dungey, Larry Sullivan, and David Monahan had also joined the cast.[46]\n\nSeason 2 [ edit ]\n\nOn January 24, 2018, it was announced that Meryl Streep had joined the main cast in the role of Mary Louise Wright, the mother of Perry (played by Alexander Skarsgard in Season 1).[47] In February 2018, it was confirmed that Shailene Woodley, Laura Dern, Zoë Kravitz, Adam Scott, James Tupper, Jeffrey Nordling and Iain Armitage were returning for the second season.[48][49][50] On March 27, 2018, it was announced that Douglas Smith had joined the cast in a recurring role.[51][52] On April 3, 2018, it was confirmed that Kathryn Newton, Robin Weigert, Merrin Dungey, and Sarah Sokolovic were returning for the second season. Newton and Sokolovic have been upped from recurring roles to series regulars. Additionally, it was announced that Crystal Fox had joined the cast in a main role and that Mo McRae would appear in a recurring capacity.[53] On April 10, 2018, it was announced that Martin Donovan had been cast in a recurring role.[54] In May 2018, it was reported that Poorna Jagannathan had joined the cast in a recurring capacity. Additionally, it was confirmed that P.J. Byrne would reprise his role of Principal Nippal.[55][56] On June 15, 2018, it was announced that Denis O'Hare had been cast in a recurring role.[57]\n\nFilming [ edit ]\n\nThe series was shot with an Arri Alexa digital camera. Jean-Marc Vallée, who directed the entirety of the first season, preferred using natural lighting and handheld shooting style to allow actors to move freely around the set.[27]\n\nMuch of the series was filmed on location on the Monterey Peninsula and Big Sur. Several scenes were shot in Pacific Grove and Carmel Highlands as well.[58]\n\nSoundtrack [ edit ]\n\nA soundtrack for the series was released on Google Play and iTunes on March 31, 2017.[59]\n\nRelease [ edit ]\n\nBroadcast [ edit ]\n\nOn February 7, 2017, the series held its official premiere at the TCL Chinese Theatre in Los Angeles, California.[60][61] Internationally, the series premiered on February 20, 2017, in Australia on Showcase,[62] and on March 13, 2017, in the United Kingdom and Ireland on Sky Atlantic.[63]\n\nMarketing [ edit ]\n\nOn October 16, 2016, HBO released the first teaser trailer for the series.[64] On December 5, 2016, HBO released a full length trailer for the series.[65]\n\nHome media [ edit ]\n\nThe first season was released on Blu-ray and DVD on August 1, 2017.[66] The second season was released on January 7, 2020, on DVD and manufacture-on-demand Blu-ray by Warner Home Entertainment and Warner Archive Collection respectively.[67]\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nAggregated reviews for Big Little Lies Season Critical response Rotten Tomatoes Metacritic 1 93% (123 reviews) 75 (42 reviews) 2 86% (99 reviews) 82 (34 reviews)\n\nThe first season of Big Little Lies was met with a positive response from critics. On the review aggregation website Rotten Tomatoes, the first season holds a 93% \"certified fresh\" rating with an average rating of 8.05 out of 10 based on 123 reviews. The website's critical consensus reads, \"Bitingly funny and highly addictive, Big Little Lies is a twisty, thrilling, enlightening ride led by a first-rate cast.\"[68] Metacritic, which uses a weighted average, assigned the first season a score of 75 out of 100, based on 42 critics, indicating \"generally favorable reviews\".[69] Time magazine listed Big Little Lies as one of its top ten television shows of 2017.[70]\n\nThe second season has received critical acclaim. On Rotten Tomatoes, the season holds an 86% \"certified fresh\" rating with an average rating of 7.71 out of 10 based on 99 reviews. The website's critical consensus reads, \"Gorgeous and gripping, Big Little Lies' second season doubles down on the dark humor and gives its impressive cast even more juicy drama to chew on – especially an excellent Meryl Streep.\"[71] On Metacritic, the season has a score of 82 out of 100, based on 34 critics, indicating \"universal acclaim\".[72] Ben Travers of IndieWire wrote a positive review giving it a \"B+\" grade, concluding that Season 2 is a \"wholly different beast\" and \"doesn’t feel like a necessary addition so much as an enjoyable epilogue\", yet it is \"still very, very good\".[73]\n\nRatings [ edit ]\n\nSeason 1 [ edit ]\n\nSeason 2 [ edit ]\n\nAccolades [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Big_Little_Lies_Logo.png/250px-Big_Little_Lies_Logo.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Shailene_Woodley_March_18%2C_2014_%28cropped%29.jpg/112px-Shailene_Woodley_March_18%2C_2014_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Reese_Witherspoon_at_TIFF_2014.jpg/118px-Reese_Witherspoon_at_TIFF_2014.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Nicole_Kidman_Cannes_2017_2.jpg/110px-Nicole_Kidman_Cannes_2017_2.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Big_Little_Lies_(TV_series)", "title": "Big Little Lies (TV series)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}