{"url": "https://www.vulture.com/2018/01/erykah-badu-in-conversation.html", "text": "“I’m gathering ideas,” says Erykah Badu, talking over dinner at a vegan restaurant in midtown Manhattan. “I’m uploading.” Badu, in a baggy sweater, oversized eyeglasses, and giant fedora, is talking about why she hasn’t released an album of new material since 2010’s New Amerykah Part Two — and why she isn’t particularly concerned about it. “I’ll download new ideas at some point.”\n\nHer old ones are still making the rounds: The R&B singer’s debut album, 1997’s Baduizm, is tentatively slated for reissue as a set of vinyl 45s in February, and she performs live around the world eight months out of every year. And anyway, it’s what she might do with the other four months that’s most interesting to her lately. “I want to have a variety show,” she muses. “I want to get my midwifery certification in direct-entry midwifery. I want to build schools. I want to join the Peace Corps. I want to paint more seriously. I want to help my children with their dreams.” But for now, she’s “happy to be here talking with you in the present.” She gives a knowing smile. “Because that’s all there is.”\n\nYou’re one of the rare musicians who manages to stay relevant with listeners younger than themselves. How much of that that is because you’re good on social media?\n\nIf it’s anything, it’s that I understand where young people are coming from. I don’t try and fight it. What’s interesting to me about music and the younger generation is that what we hear on the radio is more about frequency and sound than words. People talk about “mumble rap,” but that’s because they don’t understand that the important thing is the vibration, not the words. The kids need vibrations, because their attention span is about three seconds.\n\nDoes that mean lyrics are less important than they used to be?\n\nI think so.\n\nSo what accounts for the success of someone like Kendrick Lamar?\n\nYou named a hip-hop artist and hip-hop is the people. Hip-hop is not separate from the people. It goes to where the people go, and part of what moves people is vibration. People pray for that kind of movement, they pray for a Kendrick. Kendrick getting his thoughts out plays a big role in other people’s thoughts. That thinking becomes a collective thing, something that comes out of a need, and that exchange is a vibration, too.\n\nHow has hip-hop changed in the two decades since Baduizm?\n\nAs much as the people have changed. We’re in such a different place. My son, Seven, is 19. I’m seeing him evolve into this creature that I never thought I could create. Without even trying, he’s an improvement on his father’s design. His thinking. His logic. His compassion. It’s an evolutionary cycle. People acted out in new ways when rock and roll first came out, and the blues, and bebop. Here’s how I think of it: My favorite cartoon is The Flintstones. It’s the funniest thing to me. But when my children are sitting with me trying to watch it, the whole frequency is too slow for them. Everything has sped up and recalibrated; the children are vibrating faster. They’re way ahead of us. That’s how hip-hop has changed.\n\nIs anything being lost in how younger people absorb music?\n\nYou can’t roll a joint on the cover of a digital download.\n\nWhat music is exciting you right now?\n\nI’m listening to new things I’ve recorded — seeing if they might lead to bigger ideas. I’m also listening to D.R.A.M. and Lil Uzi Vert. All new stuff because of Seven. XXXTentacion is another one.\n\nDo all the allegations against XXXTentacion affect how you think about his music? Or similarly, you just curated a great box set of Fela Kuti albums, and he’s someone who it seems had retrograde attitudes about women.\n\nI would never suggest that I have the popular opinion on this. Because I don’t.\n\nWhat’s your opinion on this larger discussion happening now about whether we can separate the art from the artist, be it XXXTentacion or Fela or Louis C.K. or Bill Cosby or whomever?\n\nIt takes me back to a story my grandmother told me about Jesus and Barabbas. Jesus is standing on one side, Barabbas is standing on the other side, and the people have to choose which one of them could go free. Some people started yelling, “Barabbas! Barabbas! Barabbas!” Then so many people were doing that that the others found safety in numbers, and they also started yelling, “Barabbas! Barabbas! Barabbas!” People walked up who didn’t even know what was going on and they also started yelling for Barabbas to go free. I always think about that. It’s so important to me.\n\nI think I follow, but can you tell me more about how that parable applies here?\n\nThat I don’t want to get scared into not thinking for myself. I weigh everything. Even what you just asked me, I would have to really think about it and know the facts in each of those situations before I made a judgment. Because I love Bill Cosby, and I love what he’s done for the world. But if he’s sick, why would I be angry with him? The people who got hurt, I feel so bad for them. I want them to feel better, too. But sick people do evil things; hurt people hurt people. I know I could be crucified for saying that, because I’m supposed to be on the purple team or the green team. I’m not trying to rebel against what everybody’s saying, but maybe I want to measure it. Somebody will call me and ask me to come to a march because such and such got shot. In that situation I want to know what really happened. I’m not going to jump up and go march just because I’m green and the person who got shot is green. The rush to get mad doesn’t make sense to me.\n\nWell, I agree that as a culture right now, we’re better at mobilizing out of a sense of injustice or anger than we are at figuring out what to do next.\n\nPeople can be bad for certain things. They could be bad around children. They could be bad with power. Are those people all “bad”? Could be. Maybe they need to get kicked off the planet. I don’t know. Each thing is individual. There aren’t rules for how we can or should think about something. We don’t have to believe everything we’re hearing. At least I don’t think we do. I’m glad I don’t watch this stuff.\n\nThe news, you mean?\n\nEverything. I read the description of an empath and I think I fit the description pretty well. It’s about absorbing people’s feelings.\n\nBut does that mean we shouldn’t speak up when people, even good ones, do bad things or express hurtful ideas? When I was doing research for this interview — this is a slightly awkward question.\n\nYou can ask me anything.\n\nOkay, thank you. I know this is maybe a weird pivot, but I think it’s relevant. When I was doing research for this interview I came across an article from after you’d gone to Israel, where the Israeli press was linking you to Louis Farrakhan and his alleged anti-Semitism and it seemed that you were being criticized for defending him rather than denouncing anti-Semitism. I don’t know if those reports were accurate, but isn’t it valid to criticize the hurtful idea in an instance like that? Even if you respect the person who holds that idea?\n\nAbsolutely. But I never made a statement about Louis Farrakhan — ever. What you’re talking about happened in Palestine. At the time, the working title of my album was Saviours’ Day — which is a holiday for the Nation of Islam but also my birthday. So I’d gone to Palestine and journalists asked me, “Do you believe in Louis Farrakhan? Do you follow him?” Sure I do. I’ll follow anyone who has positive aspects. He single-handedly changed half of the Nation of Islam to clean eating, clean living, caring for their families. He has flaws — like any man — but I’m not responsible for that. I said I’ve appreciated what he’s done for a lot of black Americans. I mean, I’m not Muslim, I’m not Christian, I’m not anything; I’m an observer who can see good things and bad things. If you say something good about someone, people think it means that you’ve chosen a side. But I don’t choose sides. I see all sides simultaneously.\n\nThat’s not something most of us are good at.\n\nWe’re not, and I’m okay with that. I’m also okay with anything I had to say about Louis Farrakhan. But I’m not an anti-Semitic person. I don’t even know what anti-Semitic was before I was called it. I’m a humanist. I see good in everybody. I saw something good in Hitler.\n\nCome again?\n\nYeah, I did. Hitler was a wonderful painter.\n\nNo, he wasn’t! And even if he was, what would his skill as a painter have to do with any “good” in him?\n\nOkay, he was a terrible painter. Poor thing. He had a terrible childhood. That means that when I’m looking at my daughter, Mars, I could imagine her being in someone else’s home and being treated so poorly, and what that could spawn. I see things like that. I guess it’s just the Pisces in me.\n\nI’m perfectly willing to accept that you might be operating on a higher moral plane than I am, but I think going down the route of “Hitler was a child once too” is maybe turning the idea of empathy into an empty abstraction.\n\nMaybe so. It doesn’t test my limits — I can see this clearly. I don’t care if the whole group says something, I’m going to be honest. I know I don’t have the most popular opinion sometimes.\n\nBut don’t you think that someone as evil as Hitler, who did what he did, has forfeited the right to other people’s empathy?\n\nWhy can’t I say what I’m saying? Because he did such terrible things?\n\nWell, yes. But it’s also disheartening to hear you say that at a time, like now, when racism and anti-Semitism are so much in the air. Why would you want to risk putting fuel on that fire?\n\nYou asked me a question. I could’ve chosen not to answer. I don’t walk around thinking about Hitler or Louis Farrakhan. But I understand what you’re saying: “Why would you want to risk fueling hateful thinking?” I have a platform, and I would never want to hurt people. I would never do that. I would never even imagine doing that. I would never even want a group of white men who believe that the Confederate flag is worth saving to feel bad. That’s not how I operate.\n\nI appreciate that. But I really struggle with the idea of how much we’re supposed to make an effort to understand or have empathy for people who have dangerously backwards or hateful thinking. You want to take the moral high ground, but sometimes that also feels the same as ceding territory.\n\nYou got that Pisces in you, that two-fish.\n\nI am a Pisces, actually.\n\nI thought so. So am I. One fish is swimming upstream, one’s swimming downstream. We are all living in a cognitive-dissonance reality. We want to live a certain way or do a certain thing, and we don’t because we are emotionally attached to how the group thinks. The hive mentality takes over. But you know what’s right in your mind and your heart, and if you’re strong enough to detach from the hive then sometimes, just sometimes, you may be able to do the right thing.\n\nWhen did you realize you didn’t see the world like most people?\n\nBack in Catholic school in Dallas. I was raised Baptist, but I went to Catholic school because it was better than the public school where I grew up. When I was there I thought it was odd that we didn’t question what we were doing. What is this “blood of the lamb”? What does this mean? And whenever I would ask questions, I would either get manufactured answers or get in trouble for asking questions. I just thought I was not fit for society.\n\nAnd when did you realize you were?\n\nI guess at the time I discovered psychology in high school. I came across a sociologist named Irving Janis.\n\nGroupthink.\n\nYeah. Coming across his work, I realized what was happening to the other people and wasn’t necessarily happening to me. That’s when I said, “Okay, I am a part of this, but a different part.”\n\nErykah Badu. Photo: Rondo Estrello taken in Osaka Japan\n\nI was listening to the interview you did recently with Joe Budden, and he brought up the recurring cartoonish image of you as this sort of quasi-mystical sorceress who’s always playing mind games with rappers.\n\nThe Erykah Badu legend.\n\nIs it frustrating to have that kind of legend follow you around? It seems pretty clearly rooted in a kind of sexism.\n\nI take advantage of it. It’s a good thing if people think I’m supposed to be some mystical creature that controls people’s minds.\n\nHow do you take advantage of it?\n\nI keep the prestige going. I keep up the idea that I’m mystical. The thing about this legend is, I get blamed if rappers do good or do bad — people think these rappers get all confused by my presence.\n\nCan you characterize that presence?\n\nThat I take rappers to the sunken place. I don’t think that’s what I do. I hope it’s not.\n\nIs positive projection just as silly to you as that kind of negative projection? Your fans often talk about you online as if you’re something closer to a magical unicorn rather than a living, breathing human being.\n\nIt’s all part of the same thing. In both ways — whether it comes from men or women — some people talk about me like I’m a sex goddess, a magical creature, a unicorn. Those things are part of how people perceive me. I never think of it as derogatory. Even when there is an element of sexism to it I find it all hilarious. It means you’re powerful — in a loving way.\n\nIt’s been eight and ten years since your last two studio albums, which were both fairly political. Now we’re here, in this political moment. Are you feeling at all inspired to make new music?\n\nYou know what’s funny? I’m thinking about music, but it’s all about tuning forks, singing bowls, bells, drums. I went to South Africa and recorded drums from Soweto, from Johannesburg, just gathering sounds. That’s what I’m interested in right now — sound vibration. If I put out another project, it’ll be like that. Maybe I’m humming or primal wailing or tribal moaning. You know, I haven’t written anything in five years.\n\nYou mean no new proper songs? You did put out that mixtape a couple years back.\n\nThat’s right. If I’m not inspired to write, I don’t. Whether it’s me as a singer or a dancer or a writer or a painter or a filmmaker or on Instagram or a mixtape, everything I do is coming out of a real need. I think Joni Mitchell is the one who said that singing, laughing, and crying come up out of the same need: to get stuff out. I just haven’t had anything to say. I can’t really force it. If I did, what I’d be saying wouldn’t be coming from an honest place. Or maybe I’ve said all the things I feel like saying.\n\nWhat about performing live? Have your feelings about that changed?\n\nThey haven’t. I feel the most like me when I perform. That’s why I do it so much — never had a vacation. No matter what’s going on in my life or the world, performing feels new every time, and I can get to where I need to be to have a good show every single night.\n\nWhere do you need to to be?\n\nIt’s about becoming a living, breathing organism with the people. And it always happens. I never have a bad show.\n\nYour situation is different, but what you were saying a minute ago about how you can’t create new music unless you feel an honest compulsion to do it is making me think about how some of the most important musicians of your generation — people like Lauryn Hill, André 3000, D’Angelo — had long periods where they went silent. Do you think they felt the same way you do?\n\nI don’t want to speak for those people. I know all of them, and there are individual circumstances for why each of them were quiet in different moments.\n\nIs there any unfulfilled potential among that group?\n\nWhen you say unfulfilled potential, wouldn’t that have to be determined by the person? Whose fulfillment are we talking about?\n\nI know what you mean, but to go years without hearing —\n\nD’Angelo did what he came to do. He never had to make another record. Lauryn continues to make music. I don’t think she’s putting it out, but she’s always recording. I think we have something in common, us neo-soul musicians, and that’s honesty. Making music hurts, or it feels good, and we do it when we have to. And sometimes we don’t.\n\nJust as a selfish fan, it’s hard not to wonder about what music someone like D’Angelo could’ve been making all those years he was away.\n\nLife happens. Shit happens. Family members die. Your relationship gets fucked up. Your record label does some shit. Lauryn has six children. There are so many different circumstances why someone might not make music. It is selfish of you to want more from those people, and that’s fine. Everybody has their own shit.\n\nWhat’s your shit?\n\nI don’t have no shit right now, and I’m so fucking happy about it. I don’t have a lot of needs, so maybe that’s why I don’t have any shit.\n\nI saw a story the other day that said that in 2017, for the first time, hip-hop passed rock as the most popular style of music. Is it hard to square the cultural movement we’ve undergone as a country with the political backsliding we’re in the middle of?\n\nThat conflict makes sense, because change is hard. The culture is changing and people are resisting that. The world is sick of the old shit. The people are sick of being angry. They’re sick of hate. They’re sick of color. They’re sick of race. They’re sick of age. But you’re always going to have people who are resistant to progress. People have such a hard time being uncomfy for a minute.\n\nHow do you talk with your younger children about politics?\n\nThey talk with me about it. They say the typical little girl things like “Trump’s a mean man and he wants to send my friends back to Mexico.” We don’t elaborate any more than that, because that’s all that they need to be preoccupied with right now. But I’m not a political chick at all. I’m macrocosmic in lieu of microcosmic. I see a whole big picture. I see freedom for the slaves and the slave masters. For everybody. We’re just emerging into a new state of being altogether, and the anger now is about people scared of that change. What I’m talking about is Baduizm, and I see Trump as part of the resistance to that.\n\nWhat’s Baduizm?\n\nThe way I see things.\n\nDoes Baduizm now mean the same thing as it did when Baduizm came out 20 years ago?\n\nI’ve learned so many things since then. I’ve changed in a way that involves elimination for the sake of evolution. There’s less emphasis on trying to figure things out. It’s about letting things be. I’m focusing on listening to the silence underneath everything. That’s what I try to connect with. I can listen to the silence right here, right now while we’re talking, and it feels so good. I’m in love with the silence.\n\nSo you see Trumpism as a short-term reactionary thing?\n\nThe thing about Trump is that he’s a bad guy to the point where it looks manufactured. Are we playing games here? He can’t really be that bad. I’m not a conspiracy theorist at all — I don’t give a shit about that stuff — but it looks like Trump’s just trying to spark division. It looks like a game. Why are we being toyed with?\n\nDoes feeling like you’re being toyed with make you want to disengage?\n\nWe can’t help but to engage. There’s no way I can live without engaging and doing service for others. I’m a doula. I’m a health practitioner and a Reiki master. These things come easy to me.\n\nYou actively work as a doula?\n\nYeah.\n\nHow do you find the families you work with?\n\nSerendipity. It’s always easy to find someone pregnant that needs me. It just happens, you know? I met one lady I worked with at a restaurant. I’ve assisted births at home, at birthing centers, at a hospital, in the woods. It all depends on the person and their story. Like Bruce Lee says, you have to be like water, and fit in any container. I also sit at the bedside of people who are dying. So I do the opposite of birth work — it’s beings coming in and beings going out.\n\nWhat do you do at the bedside of someone who’s dying?\n\nDepends on the person. Some want to listen to Richard Pryor. Some want to listen to gospel. Some want to talk. Some want to cry. Some haven’t seen their children in a long time; I’ll go find those children and let them know what’s going on. Whatever service is needed, that’s what I’ll do. I just want people to be at peace.\n\nI’ve read you describe yourself as a “spiritual” person. What does that mean to you?\n\nI lead with my emotions, my feelings, and my thoughts — I like to describe that as spirit. When I’m meeting people, it’s about the spirit first. I think in the Hindu religion it’s called Namaste: the divine in me recognizes the divine in you. No matter what our background was or what we were programmed to think or what our egos want us to believe about each other, there’s something about looking in someone’s eyes and connecting with them, their struggle, their whole shit — that’s what I want to do. That’s spiritual to me.\n\nYou’re your own manager, which is extremely rare for a musician at your level. Wouldn’t it be easier to have someone else dealing with the business side?\n\nI’ve never had a manager, and it’s so I could be as lazy as I want and procrastinate whenever I want. I also want to be able to live outside of the music business. If I want to take off a year and raise my child, or pace myself in some other way, I can do it without having to explain it to anyone. And I’ve been blessed with organizational skills. I’m always late, though.\n\nI noticed. I was sitting here for like an hour-and-a-half before you showed up.\n\n[Laughs] I know. I’m sorry. When it comes to my business, though, I’m very organized. I just want to be able to do things without guilt. I used to operate out of guilt.\n\nWhat did you feel guilty about?\n\nWhen I first got a record deal, I felt guilty that I was able to do certain things that the people I grew up with were not able to do. It was no fun going back home to Dallas and driving a new car. It was always a heavy, nervous feeling all over my body when I’d come home, feeling like I’d be judged by the people in town if I was seen as flaunting my success. Or people would expect you to do something for them, or think you weren’t doing enough. Oh, you know what? I spun out of that when I went to Cuba, illegally, in 2000.\n\nWhat happened?\n\nThat trip was the trip where I left behind the big headwrap I used to wear. I got a story about that. Want to hear it?\n\nYeah, of course.\n\nI was dating Common. After André [Benjamin] and I split, Common and I fused into a couple in some kind of way. And he took me to Cuba. He said he wanted me to get a Santería reading there.\n\nI can’t believe you fell for that line.\n\n[Laughs] That line works! I was into Candomblé back then too. And La Regla de Ifá. That kind of thing was so exciting to me. And at that time, I was wearing all white, with a towering white headwrap — I thought that if people saw white, it would attract great energy. So Common took me to Cuba, and we went to meet an interpreter named Pablo who led us to where the Santería reading was. And we got there and were waiting in line on the curb with everyone else who was there for a reading. On my right was this man smoking a cigar, and he had on the dirtiest Pumas I had ever seen in my life. On my left was a man who had on the tightest white shorts — you could see his nuts. I was okay with that. I wasn’t okay with those two passing a cigarette back and forth over the white shit I was wearing. But we were in Cuba, and it was their home, so I went with it. Finally, this short little lady in a long yellow dress came out and said it was my turn.\n\nThen what happened?\n\nSo she brought me into a little room in a house with no ceiling. I was kneeling on the floor and she was washing my headwrap; it was a ritual, to soften my spirit. Pablo was explaining everything to me. Then a girl came in, without knocking, and reached over me to grab something off a clothesline. And I’m thinking, This reading is a dream for me, and people are just coming in like that? So we kept going, and then the man with the Pumas came in and was just standing there with a beer. And I’m like, Wait a minute, this is not what I had in mind. And Pablo turns to me and says, “He’s the priest.” Then I changed. I didn’t need the headwrap anymore.\n\nWhat exactly was the epiphany?\n\nIn that moment, I realized that you don’t have to meet anyone else’s expectations. You don’t have to conform to anything other than who you are. The guy in the Pumas came from a long line of healers, and he didn’t have to look like one to be one.\n\nDo you remember the actual reading?\n\nI don’t. Maybe it was something like “Don’t get with Common.”\n\nWhat’s a more recent epiphany?\n\nOne of my children was asking me, “Mom, when we die, do we come back?” And I said, “I don’t know. But that sounds good.” “Do we choose the people we want to be with when we come back?” I said, “I don’t know. But maybe we do.” She said, “Well, when I die, I’m going to choose to be with you again.” It was easy tears. It made me think that all that matters is how she sees me. But, I’m sorry, did I offend you in any way earlier when you thought I was defending anti-Semitism?\n\nI wasn’t offended. It’s more that I was worried —\n\n“Is she about to get in here and Black Power me to death?”\n\nNo no, not that at all. But I think partly it’s that, as a Jew —\n\nOkay, I could tell.\n\nIs it my schnoz?\n\nJust, you got a whole Jewish thing.\n\nI’ll take that as a compliment.\n\nIt is. A sexy Jewish thing.\n\nBut no, I wasn’t offended.\n\nOh good. That makes me happy.\n\nIt’s more that I think having empathy for people with harmful ideas but not sympathy for the ideas themselves is maybe an impossible needle to thread. But what do I know? Maybe I’m rigid. I wasn’t trying to put you in a difficult spot.\n\nAnd I wasn’t trying to put you in one. I was so surprised when I read that people thought I’d said something anti-Semitic. I went to Palestine because I cared about the Palestinian children, and I was there doing work for them. Then someone twisted what I’d said around and made me into a villain or something.\n\nIt’s striking to me that even when you’re talking about sensitive subjects like this, you’re so calm and self-possessed. What makes you nervous?\n\nI’m over being scared. When I feel the heart rate going or the palms getting sweaty, I start looking for the silence. And when I’m calmed down, I realize I’ve been thinking about the past or the future, which is not even here. I just come back to the moment. I remember watching Star Wars —\n\nWhich one?\n\nOne of the ones from the ’90s. This relates to what we’re talking about. I saw this one scene in Star Wars — the guy was fighting the Sith Lord with the red and black face.\n\nDarth Maul. That was The Phantom Menace.\n\nYeah, you know what I’m talking about. There was one scene where they were fighting, and they got to these doors that would close and then open up 30 seconds later. So at one point, the guy — who am I talking about?\n\nIt was Liam Neeson’s character who was fighting Darth Maul — Qui-Gon Jinn.\n\nYeah, and he turned and flipped and he and Darth Maul were on opposite sides of a door. So you have Darth Maul standing there, ready for that door to open, and Qui-Gon Jinn does this [Badu briefly kneels on the ground with her eyes closed] just for a few seconds, then he gets up. He took a deep breath and then started back fighting. That must’ve been the scariest moment of that man’s life and this motherfucker just got down on one knee and took a breath? That’s some Jedi shit! I fell in love with that. Whenever I’m afraid, I do that: Take a minute and breathe. No matter how scary something is, doing that helps it go away. So it’s not that I don’t have fear, but I manage fear pretty fucking well.\n\nWhat’s something you’re still learning to do?\n\nYou can build a whole fucking world on the shit I don’t know. I used to want to appear like I knew everything, and now my favorite answer to give is “I don’t know.” I just love to say, “I don’t know.” It makes life a whole lot easier.\n\nThis interview has been edited and condensed.\n\nAnnotations by Matt Stieb\n\n*A version of this article appears in the February 5, 2018, issue of New York Magazine.", "images": ["https://pixel.nymag.com/imgs/daily/vulture/2018/01/19/19-erykah-babu.w1200.h630.jpg", "https://pyxis.nymag.com/v1/imgs/6a1/636/c87a3f57e12e1f387307e4e36ee59dabce-19-erykah-babu.2x.h600.w512.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/01/19/19-erykah-babu-1.nocrop.w710.h2147483647.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pixel.nymag.com/imgs/daily/vulture/2018/01/19/19-erykah-babu.w1200.h630.jpg", "keywords": [], "authors": ["David Marchese", "Rondo Estrello"], "canonical_link": "https://www.vulture.com/2018/01/erykah-badu-in-conversation.html", "title": "Erykah Badu, In Conversation", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Erykah Badu on Jedi Mind Tricks and How Millennials Hear Music", "url": "https://www.vulture.com/2018/01/erykah-badu-in-conversation.html", "description": "“You can’t roll a joint on the cover of a digital download.”", "image": "https://pixel.nymag.com/imgs/daily/vulture/2018/01/19/19-erykah-babu.w1200.h630.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "In Conversation: Erykah Badu", "description": "“You can’t roll a joint on the cover of a digital download.”", "image": "https://pixel.nymag.com/imgs/daily/vulture/2018/01/19/19-erykah-babu.w600.h315.2x.jpg", "card": "summary_large_image", "site": "@vulture"}, "article": {"published_time": "2018-01-24T08:00:03.455-05:00", "tag": "in conversation, erykah badu, music, vulture homepage lede, new york magazine", "publisher": "https://www.facebook.com/Vulture"}, "description": "Talking to R&B singer Erykah Badu about  Jedi mind tricks, how millennials hear music, and not taking rappers to the sunken place.", "sailthru.tags": "in conversation, erykah badu, music, vulture homepage lede, new york magazine", "author": "David Marchese", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://cache.nymag.com/media/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1516798803.455, "source": "https://www.vulture.com", "summary": ""}