{"url": "https://variety.com/2018/film/news/quentin-tarantino-roman-polanski-rape-1202692027/", "text": "Quentin Tarantino has apologized to Samantha Geimer after suggesting that she wanted to have sex with Roman Polanski when she was 13.\n\nIn a resurfaced 2003 interview with Howard Stern, Tarantino said Geimer “wanted to have it and dated the guy.” He also called Geimer a “party girl” and said that sex with a minor doesn’t rise to the level of rape.\n\nFacing an online backlash, Tarantino has changed his position and called his remarks “cavalier.”\n\n“Fifteen years later, I realize how wrong I was,” Tarantino said. “Ms. Geimer WAS raped by Roman Polanski.”\n\nIn an interview with the Daily News, Geimer said, “I’m not upset, but I would probably feel better if he realizes now that he was wrong, after 15 years, after hearing the facts. Nobody has to be pissed off on my behalf. I’m okay.”\n\nPolanski was arrested in 1977 for five offenses following the alleged assault, including rape by use of drugs, perversion, sodomy, and lewd and lascivious acts upon a child under 14. He fled the country after pleading guilty to unlawful sex with a minor.\n\nTarantino has been engulfed in controversy in recent days. In a New York Times article, Uma Thurman said the director pressured her to perform a dangerous car stunt during the shooting of “Kill Bill” that led to an injury to the actress. The “Pulp Fiction” director has also been highly scrutinized over his professional relationship with Harvey Weinstein, the indie mogul who has been accused of assault and rape by dozens of women. The director acknowledged that he knew that his ex-girlfriend Mira Sorvino was assaulted by Weinstein, but continued to make movies for the producer for decades.\n\n“I knew enough to do more than I did,” Tarantino told the New York Times in October shortly after reports of Weinstein’s abuse and harassment broke. “There was more to it than just the normal rumors, the normal gossip. It wasn’t secondhand. I knew he did a couple of these things. I wish I had taken responsibility for what I heard. If I had done the work I should have done then, I would have had to not work with him.”\n\nTarantino has a number of high-profile films in the works that could be derailed by the backlash. He’s directing Leonardo DiCaprio in a drama sat against the backdrop of the Charles Manson murders and is developing a “Star Trek” movie for Paramount. The Manson film is being backed by Sony Pictures. Manson’s followers murdered Polanski’s wife Sharon Tate in 1969.\n\nHere’s Tarantino’s full statement, first reported by Indiewire:\n\nI want to publicly apologize to Samantha Geimer for my cavalier remarks on “The Howard Stern Show” speculating about her and the crime that was committed against her. Fifteen years later, I realize how wrong I was. Ms. Geimer WAS raped by Roman Polanski. When Howard brought up Polanski, I incorrectly played devil’s advocate in the debate for the sake of being provocative. I didn’t take Ms. Geimer’s feelings into consideration and for that I am truly sorry.\n\nSo, Ms. Geimer, I was ignorant, and insensitive, and above all, incorrect.\n\nI am sorry Samantha.\n\nQuentin Tarantino", "images": ["https://pixel.wp.com/b.gif?v=noscript", "https://pmcvariety.files.wordpress.com/2018/02/quentin-tarantino-apology.jpg?w=1000", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Ffilm%2Fnews%2Fquentin-tarantino-roman-polanski-rape-1202692027%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202692027&comment_count=81", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2018/02/quentin-tarantino-apology.jpg?w=1000", "keywords": [], "authors": ["Brent Lang"], "canonical_link": "https://variety.com/2018/film/news/quentin-tarantino-roman-polanski-rape-1202692027/", "title": "Quentin Tarantino Apologizes to Roman Polanski Rape Victim", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Quentin Tarantino has apologized to Samantha Geimer after suggesting that she wanted to have sex with Roman Polanski when she was 13.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202692027, "author": "Brent Lang", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-02-08T09:14:16"}, "pmc-tag": "Quentin Tarantino,Roman Polanski", "title": "Quentin Tarantino Apologizes to Roman Polanski Rape Victim", "pageclass": "article", "pmc-vertical": "film", "pmc-primary-category": "News", "pmc-primary-vertical": "film", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "Quentin Tarantino Apologizes to Roman Polanski Rape Victim", "url": "https://variety.com/2018/film/news/quentin-tarantino-roman-polanski-rape-1202692027/", "description": "Quentin Tarantino has apologized to Samantha Geimer after suggesting that she wanted to have sex with Roman Polanski when she was 13. In a resurfaced 2003 interview with Howard Stern, Tarantino sai…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/02/quentin-tarantino-apology.jpg?w=1000", "width": 1000, "height": 562, "alt": "Quentin Tarantino Apology"}, "locale": "en_US"}, "article": {"published_time": "2018-02-08T17:14:16+00:00", "modified_time": "2018-02-08T20:00:08+00:00"}, "twitter": {"creator": "@https://twitter.com/BrentALang", "site": "@variety", "text": {"title": "Quentin Tarantino Apologizes to Roman Polanski Rape Victim"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/02/quentin-tarantino-apology.jpg?w=1000", "alt": "Quentin Tarantino Apology"}, "card": "summary_large_image", "title": "Quentin Tarantino Apologizes to Roman Polanski Rape Victim", "description": "Quentin Tarantino has apologized to Samantha Geimer after suggesting that she wanted to have sex with Roman Polanski when she was 13."}, "author": "Brent Lang", "content_type": "Article", "post_id": 1202692027, "title": "Quentin Tarantino Apologizes to Roman Polanski Rape Victim", "published_at": "2018-02-08 09:14:16", "image": "https://pmcvariety.files.wordpress.com/2018/02/quentin-tarantino-apology.jpg?w=1000", "comment_count": 81, "tags": "Roman Polanski", "topics": "News", "appeared_in_print": "No", "body": "Quentin Tarantino has apologized to Samantha Geimer after suggesting that she wanted to have sex with Roman Polanski when she was 13.\r\n\r\nIn a resurfaced 2003 interview with Howard Stern, Tarantino said Geimer \"wanted to have it and dated the guy.\" He also called Geimer a \"party girl\" and said that sex with a minor doesn't rise to the level of rape.\r\n\r\nFacing an online backlash, Tarantino has changed his position and called his remarks \"cavalier.\"\r\n\r\n\"Fifteen years later, I realize how wrong I was,\" Tarantino said. \"Ms. Geimer WAS raped by Roman Polanski.\"\r\n\r\nIn an interview with the Daily News, Geimer said, \"I'm not upset, but I would probably feel better if he realizes now that he was wrong, after 15 years, after hearing the facts. Nobody has to be pissed off on my behalf. I'm okay.\"\r\n\r\nPolanski was arrested in 1977 for five offenses following the alleged assault, including rape by use of drugs, perversion, sodomy, and lewd and lascivious acts upon a child under 14. He fled the country after pleading guilty to unlawful sex with a minor.\r\n\r\nTarantino has been engulfed in controversy in recent days. In a New York Times article, Uma Thurman said the director pressured her to perform a dangerous car stunt during the shooting of \"Kill Bill\" that led to an injury to the actress. The \"Pulp Fiction\" director has also been highly scrutinized over his professional relationship with Harvey Weinstein, the indie mogul who has been accused of assault and rape by dozens of women. The director acknowledged that he knew that his ex-girlfriend Mira Sorvino was assaulted by Weinstein, but continued to make movies for the producer for decades.\r\n\r\n\"I knew enough to do more than I did,\" Tarantino told the New York Times in October shortly after reports of Weinstein's abuse and harassment broke. \"There was more to it than just the normal rumors, the normal gossip. It wasn't secondhand. I knew he did a couple of these things. I wish I had taken responsibility for what I heard. If I had done the work I should have done then, I would have had to not work with him.\"\r\n\r\nTarantino has a number of high-profile films in the works that could be derailed by the backlash. He's directing Leonardo DiCaprio in a drama sat against the backdrop of the Charles Manson murders and is developing a \"Star Trek\" movie for Paramount. The Manson film is being backed by Sony Pictures. Manson's followers murdered Polanski's wife Sharon Tate in 1969.\r\n\r\nHere's Tarantino's full statement, first reported by Indiewire:\r\nI want to publicly apologize to Samantha Geimer for my cavalier remarks on “The Howard Stern Show” speculating about her and the crime that was committed against her. Fifteen years later, I realize how wrong I was. Ms. Geimer WAS raped by Roman Polanski. When Howard brought up Polanski, I incorrectly played devil’s advocate in the debate for the sake of being provocative. I didn’t take Ms. Geimer’s feelings into consideration and for that I am truly sorry.\r\nSo, Ms. Geimer, I was ignorant, and insensitive, and above all, incorrect.\r\nI am sorry Samantha.\r\nQuentin Tarantino", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1518110056.0, "source": "https://variety.com", "summary": ""}