{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/05/03/camille-cosby-in-the-case-of-bill-cosby-unproven-accusations-evolved-into-lynch-mobs/", "text": "“We the people” are the first three words of our nation’s Constitution, but who were those people in 1787? Dr. Howard Zinn, the renowned, honest historian, states in his best-selling book, A People’s History of the United States: “The majority of the 55 men who framed the Constitution were men of wealth in land, slaves, manufacturing or shipping.” Clearly, most people were not included in that original draft of the Constitution; no women, Native Americans, poor white men; and, absolutely, no enslaved Africans.\n\nWhat have the masses of people done who are treated as outcasts by “we the people”? They, through the purity of the unceasing human spirit, forced 27 amendments to the Constitution that have guaranteed fundamental rights to all people…finally doing what the framers should have done in 1787.\n\nNow enters an American citizen, Bill Cosby. The overall media, with their frenzied, relentless demonization of him and unquestioning acceptance of accusers’ allegations without any attendant proof, have superseded the Fifth and Fourteenth Amendments, which guarantee due process and equal protection, and thereby eliminated the possibility of a fair trial and unbiased jury. Bill Cosby was labelled as guilty because the media and accusers said so… period. And the media ensured the dissemination of that propaganda by establishing barricades preventing the dissemination of the truth in violation of the protections of the First Amendment. Are the media now the people’s judges and juries?\n\nSince when are all accusers truthful? History disproves that…for example, Emmett Till’s accuser immediately comes to mind. In 1955, she testified before a jury of white men in a Mississippi courtroom that a 14-year-old African American boy had sexually assaulted her, only to later admit several decades later in 2008 that her testimony was false. A more recent example is the case of Darryl Hunt, an African American who in 1984 was wrongfully convicted for the rape and murder of a white woman, only to have DNA evidence establish in 1994 that he did not commit the crime. Nonetheless he was held in prison until 2004, serving almost twenty years behind bars, until the true rapist confessed to the crimes. These are just two of many tragic instances of our justice system utterly and routinely failing to protect African Americans falsely accused in so-called courts of law and the entirely unfair court of public opinion.\n\nIn the case of Bill Cosby, unproven accusations evolved into lynch mobs, who publicly and privately coerced cancellations of Bill Cosby’s scheduled performances; syndications of “The Cosby Show”; rescissions of honorary degrees and a vindictive attempt to close an exhibition of our collection of African American art in the Smithsonian Museum of African Art. Although the Smithsonian’s hierarchy did not capitulate, a disclaimer was posted on the exterior of that Museum. And all of that occurred before the trial even started.\n\nThe worst injustices, however, have been carried out in the Pennsylvania Montgomery County Courthouse. Three criminal charges, promised during an unethical campaign for the district attorney’s office, were filed against my husband…all based on what I believe to be a falsified account by the newly elected district attorney’s key witness. I firmly believe her recent testimony during trial was perjured; as was shown at trial, it was unsupported by any evidence and riddled with innumerable, dishonest contradictions. Moreover, Bill Cosby’s defense team introduced the testimony of a witness who confirmed that the district attorney’s witness admitted that she had not been sexually assaulted, but that she could say she was and get money … which is exactly what she did.\n\nI am publicly asking for a criminal investigation of that district attorney and his cohorts. This is a homogeneous group of exploitive and corrupt people, whose primary purpose is to advance themselves professionally and economically at the expense of Mr. Cosby’s life. If they can do this to Mr. Cosby, they can do so to anyone.\n\nHow much longer will we, the majority of the people, tolerate judicial, executive, legislative, media and corporate abuses of power? We, the majority of the people, must make America what it has declared itself to be….a democracy…not to be destroyed by vicious, lying, self-absorbed paradigms of evilness.\n\nOnce again, an innocent person has been found guilty based on an unthinking, unquestioning, unconstitutional frenzy propagated by the media and allowed to play out in a supposed court of law. This is mob justice, not real justice. This tragedy must be undone not just for Bill Cosby, but for the country.\n\nI wish to thank the witnesses who courageously came forward at trial to testify as to the truth, as well as those witnesses who would have done so but for the judge preventing them from testifying. Someday the truth will prevail, it always does.", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/0b7de3ac-b862-48a5-bb93-6712a604874c.png&w=90&h=90", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UEHY23V5GEYSTFREHGNKIZE7PE.jpg&w=150", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/9624aab6-2742-4553-9ae0-96a331f3e138.png&w=90&h=90", "https://www.washingtonpost.com/resizer/NDg9CzKWgkMY9UJViM5u4MsohHc=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/JTDP76AIAU6ZROSBROEBNCJVOY.jpg"], "top_img": "https://www.washingtonpost.com/resizer/NDg9CzKWgkMY9UJViM5u4MsohHc=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/JTDP76AIAU6ZROSBROEBNCJVOY.jpg", "keywords": [], "authors": ["Cleve R. Wootson Jr.", "National Political Reporter Covering The Presidential Campaign.", "Sonia Rao", "Pop Culture Reporter"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/05/03/camille-cosby-in-the-case-of-bill-cosby-unproven-accusations-evolved-into-lynch-mobs/", "title": "Camille Cosby on her husband’s conviction: ‘This is mob justice, not real justice’", "meta_data": {"description": "\"Bill Cosby was labelled as guilty because the media and accusers said so,” Camille Cosby wrote a week after her husband's sexual assault conviction.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/05/03/camille-cosby-in-the-case-of-bill-cosby-unproven-accusations-evolved-into-lynch-mobs/", "image": "https://www.washingtonpost.com/resizer/NDg9CzKWgkMY9UJViM5u4MsohHc=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/JTDP76AIAU6ZROSBROEBNCJVOY.jpg", "title": "Camille Cosby on her husband’s conviction: ‘This is mob justice, not real justice’", "description": "\"Bill Cosby was labelled as guilty because the media and accusers said so,” Camille Cosby wrote a week after her husband's sexual assault conviction."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Camille Cosby on her husband’s conviction: ‘This is mob justice, not real justice’", "description": "\"Bill Cosby was labelled as guilty because the media and accusers said so,” Camille Cosby wrote a week after her husband's sexual assault conviction."}, "last_updated_date": "2018-05-03T16:56:16.407Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1525276800.0, "source": "https://www.washingtonpost.com", "summary": ""}