{"url": "https://www.rollingstone.com/music/music-news/gregg-allman-laid-to-rest-at-macon-funeral-194309/", "text": "Gregg Allman was laid to rest Saturday afternoon in Macon, Georgia, where the Allman Brothers Band singer was buried near his brother Duane Allman and band mate Berry Oakley.\n\nFormer president Jimmy Carter, Peter Frampton, ex-wife Cher and many of Allman’s bandmates like Jaimoe, Dickey Betts and Derek Trucks were among those that attended the private ceremony at Snow’s Memorial Chapel in Macon. Allman’s children Devon, Layla and Delilah Island, his niece (and Duane’s daughter) Galadrielle, his lifelong friend Chank Middleton and his manager Michael Lehmen delivered eulogies at the service.\n\nAs requested by Allman’s estate, mourners wore jeans to the funeral instead of suits. Following the private service, hundreds of fans, many wearing Allman Brothers shirts and listening to the band’s music, lined the route along the funeral procession to nearby Rose Hill Cemetery, where Allman was buried close to Duane, who died in a 1971 motorcycle accident.\n\nWhile the burial was also private, hundreds of fans gathered on a hill overlooking Allman’s grave while the rocker was taken to his final resting place.\n\nIronically, Allman was scheduled to perform Saturday night at Macon’s Grand Opera House before he canceled his 2017 tour plans as he battled health issues.\n\nIn a statement Friday, the 92-year-old Carter said he would attend Allman’s funeral to “pay his respects” to the singer.\n\n“Rosalynn and I were deeply saddened when we learned that Gregg Allman had passed. Gregg and the Allman Brothers Band were very helpful to me in my 1976 presidential campaign. Gregg Allman was better known than I was at that time,” Carter said. “Gregg Allman was there when I needed him and Rosalynn and I have always been grateful to him.”\n\nIn 2016, Carter was on hand to give Allman an honorary doctorate of humanities degree at Macon’s Mercer University.\n\nAllman died May 27th at the age of 69 at his home near Savannah, Georgia following a battle with liver cancer.\n\nAllman’s manager Michael Lehman said Allman spent his final night listening to tracks off his upcoming solo LP Southern Blood; a rep told Rolling Stone the album would arrive in September.\n\n“He said the last few days he was just, you know, tired,” Lehman said told the Associated Press. He was looking forward to sharing it with the world and that dream is going to be realized. I told him that his legacy is going to be protected, and the gift that he gave to the music world will continue to live on forever.”\n\nGregg Allman, Southern rock pioneer, fused country blues with San Francisco-style improvisation, creating a template for countless jam bands to come. Watch here.", "images": ["https://www.rollingstone.com/wp-content/uploads/2018/06/ap_17154669952234-6892b4c2-4d48-4810-9f02-708ea199407f.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fmusic%2Fmusic-news%2Fgregg-allman-laid-to-rest-at-macon-funeral-194309%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=194309"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/ap_17154669952234-6892b4c2-4d48-4810-9f02-708ea199407f.jpg", "keywords": [], "authors": ["Daniel Kreps", "Daniel Kreps'S Most Recent Stories", "Taylor Swift Delivers Moving", "Soon You Ll Get Better", "On", "Together At Home", "See Kacey Musgraves Perform", "Rainbow", "One World", "Watch Paul Mccartney S Heartfelt"], "canonical_link": "https://www.rollingstone.com/music/music-news/gregg-allman-laid-to-rest-at-macon-funeral-194309/", "title": "Gregg Allman Laid to Rest at Macon Funeral", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "Gregg Allman was laid to rest Saturday afternoon in Macon, Georgia, where the Allman Brothers Band singer was buried near his brother Duane Allman.", "news_keywords": "Gregg Allman, The Allman Brothers Band", "og": {"type": "article", "title": "Gregg Allman Laid to Rest at Macon Funeral", "url": "https://www.rollingstone.com/music/music-news/gregg-allman-laid-to-rest-at-macon-funeral-194309/", "description": "Cher, former president Jimmy Carter, Allman Brothers band mates attend private service", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/ap_17154669952234-6892b4c2-4d48-4810-9f02-708ea199407f.jpg", "width": 1024, "height": 683, "alt": "ss"}, "locale": "en_US"}, "article": {"published_time": "2017-06-03T18:28:00+00:00", "modified_time": "2018-06-25T13:10:24+00:00"}, "twitter": {"text": {"title": "Gregg Allman Laid to Rest at Macon Funeral"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/ap_17154669952234-6892b4c2-4d48-4810-9f02-708ea199407f.jpg?w=1024", "alt": "ss"}, "card": "summary_large_image", "site": "@RollingStone", "title": "Gregg Allman Laid to Rest at Macon Funeral", "description": "Gregg Allman was laid to rest Saturday afternoon in Macon, Georgia, where the Allman Brothers Band singer was buried near his brother Duane Allman."}, "generator": "WordPress 5.4", "author": "Daniel Kreps", "content_type": "Article", "post_id": 194309, "title": "Gregg Allman Laid to Rest at Macon Funeral", "published_at": "2017-06-03 18:28:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/ap_17154669952234-6892b4c2-4d48-4810-9f02-708ea199407f.jpg?w=1024", "comment_count": 0, "tags": "The Allman Brothers Band", "topics": "Music News", "body": "Gregg Allman was laid to rest Saturday afternoon in Macon, Georgia, where the Allman Brothers Band singer was buried near his brother Duane Allman and band mate Berry Oakley.Former president Jimmy Carter, Peter Frampton, ex-wife Cher and many of Allman's bandmates like Jaimoe, Dickey Betts and Derek Trucks were among those that attended the private ceremony at Snow's Memorial Chapel in Macon. Allman's children Devon, Layla and Delilah Island, his niece (and Duane's daughter) Galadrielle, his lifelong friend Chank Middleton and his manager Michael Lehmen delivered eulogies at the service.As requested by Allman's estate, mourners wore jeans to the funeral instead of suits. Following the private service, hundreds of fans, many wearing Allman Brothers shirts and listening to the band's music, lined the route along the funeral procession to nearby Rose Hill Cemetery, where Allman was buried close to Duane, who died in a 1971 motorcycle accident. While the burial was also private, hundreds of fans gathered on a hill overlooking Allman's grave while the rocker was taken to his final resting place.Ironically, Allman was scheduled to perform Saturday night at Macon's Grand Opera House before he canceled his 2017 tour plans as he battled health issues.In a statement Friday, the 92-year-old Carter said he would attend Allman's funeral to \"pay his respects\" to the singer.\"Rosalynn and I were deeply saddened when we learned that Gregg Allman had passed. Gregg and the Allman Brothers Band were very helpful to me in my 1976 presidential campaign. Gregg Allman was better known than I was at that time,\" Carter said. \"Gregg Allman was there when I needed him and Rosalynn and I have always been grateful to him.\"In 2016, Carter was on hand to give Allman an honorary doctorate of humanities degree at Macon's Mercer University.Allman died May 27th at the age of 69 at his home near Savannah, Georgia following a battle with liver cancer.Allman's manager Michael Lehman said Allman spent his final night listening to tracks off his upcoming solo LP Southern Blood; a rep told Rolling Stone the album would arrive in September.\"He said the last few days he was just, you know, tired,\" Lehman said told the Associated Press. He was looking forward to sharing it with the world and that dream is going to be realized. I told him that his legacy is going to be protected, and the gift that he gave to the music world will continue to live on forever.\"Gregg Allman, Southern rock pioneer, fused country blues with San Francisco-style improvisation, creating a template for countless jam bands to come. Watch here.", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1496514480.0, "source": "https://www.rollingstone.com", "summary": ""}