{"url": "https://web.archive.org/web/20170302215858/http://theseattletribune.com/trumps-unsecured-android-device-believed-to-be-source-of-recent-white-house-leaks/", "text": "Initial reports from two such agencies, A.R.H. Intelligence and Z|13 Security, suspect the source of the recent White House leaks to be President Trump’s unsecured Android device.\n\nIf you’ve recently seen the hashtag – #DitchTheDevice trending on social media, it’s because, according to several private intelligence reports, the source of the multiple recent leaks within the White House is President Trump’s unsecured Android device.\n\nThroughout the past several weeks President Trump and his administration have expressed extreme frustration over the multiple leaks provided to members of the press from inside the White House.\n\nThe recent leaks range from information regarding his executive orders (before he issued them), fighting and chaos among White House staffers, classified conversations with foreign leaders (specifically Australian Prime Minister Malcolm Turnbull & Mexican President Enrique Peña Nieto), White House staffers conducting meetings in the dark because they can’t figure out how the lights work, and President Trump wandering the White House in his bathrobe.\n\nPresident Trump has repeatedly dismissed the leaks and has referred to the leaked information as – “Illegal Leaks” while vowing to go after those revealing sensitive information to the press.\n\nAccording to information from an unconnected Washington insider, President Trump, who remains leery of the federal intelligence community and is suspicious enough of career politicians that he’s accused holdovers from the Obama Administration as being the ones responsible for leaking information, decided to contract multiple private intelligence agencies to investigate the leaks.\n\nInitial reports from two such agencies, A.R.H. Intelligence and Z|13 Security, indicate they suspect the source of the recent White House leaks to be President Trump’s unsecured Android device.\n\nPresident Trump has received fierce criticism since his inauguration for refusing to part with his personal, consumer-grade Android smartphone while in the White House. The primary concern with President Trump maintaining his personal Android device while serving as the POTUS, is that the phone in question is probably not being aggressively protected from malware or phishing attacks/attempts.\n\nAccording to security experts, clicking on just one malicious link (often disguised to look as if it was sent from a trusted source) could easily compromise the device – giving hackers free-reign over the phone’s microphone, camera, contacts, stored data, and browser history.\n\nInvestigators from A.R.H. Intelligence and Z|13 Security believe that the unsecured Android device was most likely compromised by a suspicious animated GIF that was sent to President Trump via text message.\n\nAccording to information from Thomas McDowell, an associate at A.R.H. Intelligence, the text message containing the GIF (which reportedly displayed an animated cartoon-like image of Trump giving Russian President, Vladimir Putin, a friendly hug) appeared to have been sent to President Trump as a joke by a long-time friend/acquaintance.\n\nMcDowell believes that the animated GIF could have contained spyware and could have been sent by an unknown hacker who coded the text message to appear as if it was sent by a trusted source – an (unnamed) long-time friend and acquaintance of President Trump.\n\nIf a hacker did gain access to the unsecured Android device, it’s possible they activated the device’s built-in microphone and camera and in-turn leaked the sensitive information gathered to members of the press.\n\nIt’s currently unclear if the president intends to rid himself of the unsecured smartphone, however, many of President Trump’s supporters and critics alike have taken to social media websites such as Twitter and Facebook to encourage the president to trade in his unsecured Android phone for a standard White House approved communication device by using the hashtag – #DitchTheDevice\n\nWe’ll provide updates to this developing story as we receive them.", "images": ["https://web.archive.org/web/20170302215858im_/http://0.gravatar.com/avatar/fc136edbb112e19349dffe0c5c6ad70d?s=96&d=mm&r=g", "https://web.archive.org/web/20170302215858im_/http://theseattletribune.com/wp-content/uploads/2017/02/Trump-Phone-2.jpg"], "top_img": "https://web.archive.org/web/20170302215858im_/http://theseattletribune.com/wp-content/uploads/2017/02/Trump-Phone-2.jpg", "keywords": [], "authors": ["Lucas Bagwell"], "canonical_link": "https://web.archive.org/web/20170302215858/http://theseattletribune.com/trumps-unsecured-android-device-believed-to-be-source-of-recent-white-house-leaks/", "title": "Trump’s Unsecured Android Device Source Of Recent White House Leaks", "meta_data": {"og": {"image": {"identifier": "https://web.archive.org/web/20170302215858im_/http://theseattletribune.com/wp-content/uploads/2017/02/Trump-Phone-2.jpg", "width": 1193, "height": 768}, "locale": "en_US", "type": "article", "title": "Trump’s Unsecured Android Device Source Of Recent White House Leaks", "description": "According to intelligence reports, the source of the multiple recent leaks within the White House is President Trump’s unsecured Android device.", "url": "https://web.archive.org/web/20170302215858/http://theseattletribune.com/trumps-unsecured-android-device-believed-to-be-source-of-recent-white-house-leaks/", "site_name": "The Seattle Tribune", "updated_time": "2017-02-27T14:03:58+00:00"}, "author": "Lucas Bagwell", "description": "According to intelligence reports, the source of the multiple recent leaks within the White House is President Trump’s unsecured Android device.", "robots": "noodp", "article": {"tag": "white house leaks", "section": "Uncategorized", "published_time": "2017-02-26T13:55:11+00:00", "modified_time": "2017-02-27T14:03:58+00:00"}, "twitter": {"card": "summary", "description": "According to intelligence reports, the source of the multiple recent leaks within the White House is President Trump’s unsecured Android device.", "title": "Trump’s Unsecured Android Device Source Of Recent White House Leaks", "image": "https://web.archive.org/web/20170302215858im_/http://theseattletribune.com/wp-content/uploads/2017/02/Trump-Phone-2.jpg"}, "generator": "Powered by Visual Composer - drag and drop page builder for WordPress."}, "movies": [], "publish_date": 1488117311.0, "source": "https://web.archive.org", "summary": ""}