{"url": "en.wikipedia.org/wiki/Emily_Blunt", "text": "English-American actress\n\nEmily Olivia Leah Blunt (born 23 February 1983)[1] is a British-American actress.[2] She is the recipient of several accolades, including a Golden Globe Award and a Screen Actors Guild Award, in addition to nominations for two British Academy Film Awards.\n\nEducated at Hurtwood House in Dorking, Blunt made her acting debut in a 2001 stage production of The Royal Family. She went on to appear in the television film Boudica (2003) and portrayed Queen Catherine Howard in the miniseries Henry VIII (2003). She made her feature film debut in the drama My Summer of Love (2004). Blunt's breakthrough came in 2006 with her starring roles in the television film Gideon's Daughter and the highly successful comedy-drama film The Devil Wears Prada. The former won her a Golden Globe Award for Best Supporting Actress and the latter earned her a nomination for the BAFTA Award for Best Actress in a Supporting Role.\n\nBlunt's profile continued to grow with starring roles in the period film The Young Victoria (2009), the romantic comedy Salmon Fishing in the Yemen (2011), the science fiction films The Adjustment Bureau (2011), Looper (2012), and Edge of Tomorrow (2014), and the musical films Into the Woods (2014) and Mary Poppins Returns (2018). She garnered acclaim for her performances as a principled FBI agent in the crime film Sicario (2015), an alcoholic in the thriller The Girl on the Train (2016), for which she received a nomination for the BAFTA Award for Best Actress in a Leading Role, and a survivalist mother in the horror film A Quiet Place (2018). For the lattermost, which was directed by her husband John Krasinski, she won the Screen Actors Guild Award for Best Supporting Actress.\n\nEarly life [ edit ]\n\nBlunt was born in Wandsworth, London.[3][4] She is the second of four children[5] born to Joanna, a former actress and teacher,[6][7] and barrister Oliver Simon Peter Blunt, QC.[8][9][10] Her siblings are Felicity, Sebastian, and Susannah.[8][11] Her grandfather was Major General Peter Blunt, and one of her paternal uncles is Crispin Blunt,[12] Conservative Member of Parliament for Reigate.\n\nFrom the age of seven to 14, Blunt struggled with stuttering.[13] She credits a school teacher for helping her overcome the stutter through acting.[14] She went on to sit on the board of directors for the American Institute for Stuttering.[15] Blunt attended Ibstock Place School in Roehampton, southwest London and, at the age of 16, went to Hurtwood House in Dorking, Surrey, a private sixth form college known for its performing arts programme. There, she was discovered and signed by an agent.[16]\n\nCareer [ edit ]\n\n2001–2004: Career beginnings [ edit ]\n\nIn November 2001, Blunt made her professional debut in Sir Peter Hall's production of the play The Royal Family, in which she played the role of the granddaughter Gwen to Dench's Fanny Cavendish. Critic Tom Keatinge hailed the production, writing that \"Peter Hall's direction and Anthony Ward's tremendous set combine with all this to make The Royal Family a terrific night's entertainment\", and that \"it provides a vehicle for acting of the finest quality, with strong performances from the whole ensemble\".[17] For her performance, Blunt was named \"Best Newcomer\" by the Evening Standard. She went on to perform as Eugenie in Nicholas Wright's Vincent in Brixton at the National Theatre, and as Juliet in Indhu Rubasingham's production of Romeo and Juliet at Chichester Festival Theatre, both in 2002.[18] In 2003, Blunt made her screen debut in the British television drama Boudica, about the life of the ancient Celtic warrior-queen who fought the Romans. That same year, she was praised for her performance as the 16th-century Queen Catherine Howard in the two-part British television drama Henry VIII.[18]\n\nIn 2004, Blunt received considerable attention for her performance as Tamsin in the independent British drama My Summer of Love, a love story revolving around two young women from different social and economic backgrounds in the English countryside.[18] Director Paweł Pawlikowski gave high praise to Blunt and co-star Natalie Press, stating in an interview that \"Both Natalie and Emily were extremely different and very original, which is a rare thing nowadays. They avoid the obvious, and are capable of playing complex and conflicting attitudes. Above all, they had energy, which is key for a movie.\" James Berardinelli of ReelViews praised the film, calling it a \"gem\" lost in the \"hype\" of Hollywood blockbusters, and noted that \"Both Natalie Press and Emily Blunt [...] are superlative. They nail their cinematic alter-egos effortlessly, using verbal and non-verbal cues to tap into their emotions. They understand their characters and use their talents to bring them to life.\"[19] She shared the Evening Standard British Film Award for Most Promising Newcomer with Press.[20]\n\n2005–2010: The Devil Wears Prada and breakthrough [ edit ]\n\nBlunt starred in the British television drama Gideon's Daughter,[18] based on an original screenplay written and directed by Stephen Poliakoff, where she played the troubled only child of New Labour spin doctor Gideon Warner. The film premiered at the Hamptons International Film Festival in 2005, and debuted on British television in February 2006. The drama was praised for its overall \"sterling performances,\"[21] and Blunt won the Golden Globe Award for Best Supporting Actress – Series, Miniseries or Television Film.[22]\n\nShe then featured in the comedy-drama The Devil Wears Prada, set in the fashion world in New York City. Blunt played Emily, the senior assistant of Runway magazine editor-in-chief Miranda Priestly. The film was a commercial and critical success, grossing $326,551,094.[23] Though co-star Meryl Streep garnered most of the attention for her role, Blunt's performance was equally praised, with Clifford Pugh of the Houston Chronicle asserting that \"[Blunt] has many of the movie's best lines and steals nearly every scene she's in.\"[24] Blunt was nominated the BAFTA Award for Best Actress in a Supporting Role and Golden Globe Award for Best Supporting Actress – Motion Picture for her performance. She attended the 79th Academy Awards where she co-presented the award for best costume design with Hathaway, with both acting as their characters from the film.[25] Blunt then appeared in the independent mystery drama Irresistible.\n\nBlunt's profile continued to rise, and in 2007, she appeared in four films: the horror film Wind Chill, the romantic drama The Jane Austen Book Club, the comedy-drama Dan in Real Life, and the biographical comedy-drama Charlie Wilson's War.[18] In 2008, Blunt appeared in two films, Sunshine Cleaning in the role of Norah Lorkowski, an underachiever who starts a crime-scene clean-up business with her sister Rose, played by Amy Adams. The film premiered at the 2008 Sundance Film Festival, where it received positive reviews, particularly for Adams' and Blunt's performances. Peter Travers of Rolling Stone magazine commented \"This funny and touching movie depends on two can-do actresses to scrub past the biohazard of noxious clichés that threaten to intrude. Adams and Blunt get the job done.\"[26] A. O. Scott of The New York Times agreed, stating \"Amy Adams and Emily Blunt [...] attack their roles with vivacity and dedication...\"[27] She then starred in The Great Buck Howard as Valerie Brennan, which premiered at the same festival.[18]\n\nIn 2009, Blunt portrayed Queen Victoria in the independent period drama The Young Victoria, directed by Jean-Marc Vallée and written by Julian Fellowes, which focused primarily on her early life and reign, as well as her marriage to Prince Albert of Saxe-Coburg and Gotha.[28] Blunt admitted to having little prior knowledge of the Queen, but after consulting her mother, found her to be \"remarkable\" and \"a very 21st century sort of woman.\"[29] Blunt's performance earned critical accolades, and she was nominated for the Golden Globe Award for Best Actress in a Motion Picture – Drama[30] and Critics' Choice Movie Award for Best Actress,[31] among others. Owen Gleiberman of Entertainment Weekly concluded that \"Director Jean-Marc Vallée's images have a creamy stateliness, but this is no gilded princess fantasy – it's the story of a budding ruler who learns to control her surroundings, and Blunt makes that journey at once authentic and relevant.\"[32] That same year, Blunt received the BAFTA Britannia Award for British Artist of the Year.[33]\n\nShe starred in the Toby Spanton-directed short film Curiosity, and was director Jon Favreau's first choice to play Natasha Romanoff / Black Widow in Iron Man 2, but due to scheduling conflicts with her role in the comedy Gulliver's Travels, she was forced to yield the role to Scarlett Johansson.[34] She also voiced Matilda Mouseling, the mother of the titular character, in the television series Angelina Ballerina: The Next Steps. In 2010, Blunt co-starred in the horror film The Wolfman, a re-adaptation of the classic 1941 film of the same name. The film received mainly negative reviews, and according to the Los Angeles Times, was one of the largest box-office failures of all time.[35][36] Her performance in the thriller The Adjustment Bureau (2011) fared better: in the film, Blunt played a dancer who is \"being mysteriously kept apart\" from a politician. The film earned generally positive reviews, with critics praising Blunt and co-star Matt Damon's chemistry.[37] Blunt was offered the role of Agent Peggy Carter in Captain America: The First Avenger, but like the offer for Iron Man 2, she turned it down.[38]\n\n2011–2014: Science fiction and comedies [ edit ]\n\nIn 2011, Blunt starred in the British romantic comedy-drama Salmon Fishing in the Yemen, directed by Lasse Hallström and co-starring Ewan McGregor. She played a financial adviser who recruits a fisheries expert, played by McGregor, to help realise a sheikh's vision of bringing the sport of fly fishing to the Yemen desert, resulting in a spiritual journey for both in the process.[39] The film premiered at the 2011 Toronto International Film Festival,[40] receiving positive reviews, as did Blunt's and McGregor's performances. Kenneth Turan of the Los Angeles Times noted \"Blunt and McGregor are two of the most gifted and attractive actors working today, able to play off each other with great style...\"[41] Blunt was nominated the Golden Globe Award for Best Actress – Motion Picture Comedy or Musical for her performance. Also that year, she made a cameo appearance in Disney's The Muppets, as Miss Piggy's receptionist, and starred in the independent comedy-drama Your Sister's Sister.[42] In November 2011, Blunt was named the ambassador of the new Yves Saint Laurent fragrance Opium.[43]\n\nIn 2012, Blunt starred in the romantic comedy The Five-Year Engagement, directed by Nicholas Stoller and co-starring Jason Segel, in which she and Segel played a couple whose relationship becomes strained when their engagement is continually extended. The film earned positive reviews, with Elizabeth Weitzman of the New York Daily News remarking that \"Blunt has never been more relaxed, and she and Segel have a believably warm chemistry.\"[44] She then starred in Looper, a science fiction action film directed by Rian Johnson. Blunt played Sara, a tough farm woman and single mother, who aids and falls in love with a time-traveller. The film premiered at the 2012 Toronto International Film Festival, where it served as the opening film, and earned highly positive feedback. Todd McCarthy of The Hollywood Reporter credited Blunt for \"effectively [revealing] Sara's tough and vulnerable sides.\"[45] Also that year, she starred in the comedy-drama Arthur Newman as the troubled Charlotte, who is trying to run away from her past.[46] The film received generally mixed to negative reviews.[47][48]\n\nIn 2014, Blunt starred in Edge of Tomorrow, a film adaptation of the Japanese novel All You Need Is Kill, written by Hiroshi Sakurazaka.[49] Blunt played Sergeant Rita Vrataski, a Special Forces warrior tasked with training a public relations officer to defeat invading extraterrestrials. Blunt trained three months for her role, \"focusing on everything from weights to sprints to yoga, aerial wire work and gymnastics\", and studying Krav Maga.[50] The film was commercially successful, grossing $370,541,256,[51] and earned positive reviews. Many critics took note of the atypically dominating role portrayed by Blunt, and Justin Chang of Variety noted that \"Blunt is alert, energized and emotionally present in a none-too-taxing role.\"[52] For her performance, Blunt won the Critics' Choice Movie Award for Best Actress in an Action Movie.[53] A sequel is currently in development, with Blunt expected to reprise her role.[54]\n\nBlunt then played the role of the Baker's Wife in The Walt Disney Company's film adaptation of Stephen Sondheim's musical Into the Woods, directed by Rob Marshall and featuring an ensemble cast.[55][56] Ironically, Blunt was pregnant throughout filming, while playing a character who is barren throughout the film's first act.[57][58] The film was a commercial success and earned generally positive reviews, with Blunt earning praise for her acting and singing. Lou Lumenick of the New York Post felt it was one of the best female performances of the year,[59] while Richard Corliss of Time remarked that \"When Blunt is onscreen, these woods are alive with the magic of a fractured fairy tale...\"[60] She was nominated for her second Golden Globe Award for Best Actress – Motion Picture Comedy or Musical for her performance.[61]\n\n2015–present: Dramatic expansion and recognition [ edit ]\n\nIn 2015, Blunt starred in the crime thriller Sicario, directed by Denis Villeneuve. Blunt played Kate Macer, a principled FBI agent assigned to take down the leader of a powerful Mexican drug cartel. The film was selected to compete for the Palme d'Or at the 2015 Cannes Film Festival, where it received critical acclaim. Blunt received considerable praise for her performance, with Dan Jolin of Empire magazine calling it \"nuanced\", and stating that \"Her straight-arrow-sharp determination becomes painfully dulled,\"[62] and while Peter Bradshaw of The Guardian found her character implausible, he praised Blunt for \"[brazening] out any possible absurdity with great acting focus and front.\"[63] Blunt was nominated for her second consecutive Critics' Choice Movie Award for Best Actress in an Action Movie.[64]\n\nIn 2016, Blunt co-starred in The Huntsman: Winter's War, which serves as both a prequel and sequel to Snow White and the Huntsman (2012). The film, directed by Cedric Nicolas-Troyan, was a box-office bomb and was mostly dismissed by critics.[65][66] Blunt then headlined the mystery thriller The Girl on the Train, directed by Tate Taylor. Based on the best-selling novel of the same name, written by Paula Hawkins, Blunt plays Rachel Watson, an alcoholic who becomes involved in a missing persons investigation. Though the film earned mixed reviews from critics, who felt that it failed to live up to the novel, Blunt received unanimous praise for her performance. Peter Travers of Rolling Stone remarked that \"the movie gives away the game faster than the novel, but Emily Blunt digs so deep into the role of a blackout drunk and maybe murderer that she raises Girl to the level of spellbinder.\"[67] For her work in The Girl on the Train, she received nominations for the BAFTA Award for Best Actress and Screen Actors Guild Award (SAG) for Outstanding Female Actor.[68][69]\n\nBlunt in 2018\n\nAfter providing her voice for the 2017 animated films My Little Pony: The Movie and Animal Crackers, Blunt made her return to the screen, in husband John Krasinski's 2018 horror film A Quiet Place, which centers on a family being tormented by monstrous creatures that hunt by sound.[70] Neither Krasinski nor Blunt had any initial plans for Blunt to co-star in the film with him; upon reading the script, Blunt persuaded Krasinski to cast her.[71] A Quiet Place served as the opening night film at the South by Southwest Film Festival, where it generated critical acclaim.[72][73] Eric Kohn of IndieWire applauded the cast for contributing \"credible intensity to their scenes with a degree of sophistication rare for this type of material,\" while Laura Prudom of IGN noted that, \"Blunt, in particular, is put through the wringer in ways that would seem almost farcical, if she didn't play them with such compelling conviction\".[74][75]\n\nThat same year, Blunt played the title character in Rob Marshall's musical fantasy film Mary Poppins Returns, which served as a sequel to the 1964 film, in which Poppins was played by Julie Andrews.[76] Writing for Variety, Owen Gleiberman found Blunt to be \"practically perfect in every way\" and added that she \"inhabits Mary Poppins' snappishly entrancing spirit, and in the musical numbers she generates her own spit-spot radiance\".[77] She received SAG nominations for both A Quiet Place and Mary Poppins Returns, winning for the former, and was nominated for a Golden Globe for the sixth time, for the latter.[78][79]\n\nIn 2020, Blunt will reprise her role in the horror sequel A Quiet Place Part II. She will also co-star in Jungle Cruise, a film adaptation of the eponymous attraction in Adventureland[80][81] and star in the romantic drama Wild Mountain Thyme, based on John Patrick Shanley's play Outside Mullingar, and in the BBC television series The English, a western from Hugo Blick.[82][83]\n\nPersonal life [ edit ]\n\nBlunt had a three-year relationship with Canadian singer Michael Bublé. They met in 2005, while backstage at the Australian television Logie Awards in Melbourne. They later shared a home in Vancouver, British Columbia, before breaking up in 2008.[84]\n\nIn November 2008, Blunt began dating American actor John Krasinski. They became engaged in August 2009,[85] and married on 10 July 2010 in Como, Italy.[86] They have two daughters together.[87][88][89][90][91]\n\nBlunt's brother-in-law is her The Devil Wears Prada co-star Stanley Tucci. In 2012, Tucci married Blunt's sister Felicity, who works as a literary agent. Blunt introduced the couple.[92][93] Her brother Sebastian is also an actor.[94]\n\nIn August 2015, Blunt became a naturalised citizen of the United States.[95] She took dual citizenship in the United States, suggesting the status helped her tax and visa situation. She said she felt conflicted over abandoning her sole allegiance to the United Kingdom.[96]\n\nIn 2015, Blunt was listed 98th in FHM's Sexiest Women of 2015.[97]\n\nActing credits and awards [ edit ]\n\nAccording to the review aggregator site Rotten Tomatoes and the box-office site Box Office Mojo, Blunt's most critically acclaimed and commercially successful films include the comedy-drama The Devil Wears Prada (2006), the science fiction films Looper (2012) and Edge of Tomorrow (2014), the musical fantasy Into the Woods (2014), the crime thriller Sicario (2015), the mystery thriller The Girl on the Train (2016), the horror film A Quiet Place (2018), and the musical fantasy Mary Poppins Returns (2018).[98][99]", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Emily_Blunt_%2832056670378%29_%28cropped%29.jpg/170px-Emily_Blunt_%2832056670378%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/2/23/Emily_Blunt_SAG_Awards_2019.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Emily_Blunt_and_John_Krasinski.jpg/220px-Emily_Blunt_and_John_Krasinski.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Josh_Brolin_Emily_Blunt_Cannes_2015_%28cropped%29.jpg/170px-Josh_Brolin_Emily_Blunt_Cannes_2015_%28cropped%29.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/EmilyBluntTIFFSept2012.jpg/170px-EmilyBluntTIFFSept2012.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Emily_Blunt_SAG_Awards_2019.png/220px-Emily_Blunt_SAG_Awards_2019.png", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Emily_Blunt_at_the_Orange_British_Academy_Film_Awards_%28cropped%29.jpg/170px-Emily_Blunt_at_the_Orange_British_Academy_Film_Awards_%28cropped%29.jpg", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/2/23/Emily_Blunt_SAG_Awards_2019.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Emily_Blunt", "title": "Emily Blunt", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/2/23/Emily_Blunt_SAG_Awards_2019.png"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}