{"url": "https://en.wikipedia.org/wiki/That_Thing_You_Do!", "text": "1996 film\n\nThat Thing You Do! is a 1996 American music comedy film starring, written and directed by Tom Hanks, in his directorial debut. It tells the story of the rise and fall of a fictional 1960s one-hit wonder pop band, and it also stars Tom Everett Scott, Liv Tyler, Johnathon Schaech, Steve Zahn and Ethan Embry. The film also resulted in a musical hit with the song \"That Thing You Do\", which was nominated for an Academy Award and a Golden Globe Award for Best Original Song.[2]\n\nPlot [ edit ]\n\nIn the summer of 1964, in Erie, Pennsylvania, Guy Patterson is working in his family's appliance store when he is asked by acquaintances James \"Jimmy\" Mattingly and Lenny Haise to sit in with their band at an annual talent show after their regular drummer Chad breaks his arm trying to jump over a parking meter. The band adopts the name \"The Oneders\" (pronounced \"wonders\", but often mispronounced \"oh-NEE-ders\") because of Jimmy's predilection for misspelled names. Even though they practiced the song, at the talent show Guy launches into a faster tempo than intended for the ballad, \"That Thing You Do\". Since he wrote the song, Jimmy is upset but Guy's version wins them the talent show.\n\nThe Oneders' performance at the talent show earns them a paying gig at Villapiano's, a local pizza place. When their earnest fan asks for a record, they decide to record the song and sell 45s of it since Guy's uncle is a church music producer. They are soon noticed by talent promoter Phil Horace, who approaches Guy at work. When the whole group meets him, he promises to get their record played on the radio within 10 days. Although Jimmy is apprehensive since it's his music, Lenny convinces them to sign with him. Guy's girlfriend, Tina, who tacitly supported him at first, dumps him after falling for her handsome dentist.\n\nHorace achieves the promised radio airplay for the song and books the band at a rock & roll showcase concert in Pittsburgh, Pennsylvania. However, the band encounters technical difficulties and nervousness on stage during the showcase, and this causes them to be booed by the audience. After the showcase, Phil brings a dispirited Guy to meet with Mr. White, an A&R representative for Playtone Records, who offers the band a contract. Mr. White takes over Phil's job as the new manager of the band. White changes the band's name to \"The Wonders\" and they join a Midwestern Play-Tone tour. Mr. White says Faye (Jimmy's girlfriend) can join them as their official \"costume mistress\", and throws Guy a pair of sunglasses to wear.\n\nDuring the tour, they meet other acts, learn about the business, and become better performers. Jimmy spends time with a female solo act while the bass player falls for a member of a female group. \"That Thing You Do\" garners national radio airplay and the band's popularity soars. Jimmy isn't content to simply tour and is itching to get back in the studio while the remainder of the band enjoys their time in the spotlight. Their song reaches the top 10. When a frenzied audience makes it all but impossible for the group to get to their car, they need a police escort. The police almost bar Faye from getting into the car, but Guy ensures she gets in while Jimmy forgets about her.\n\nWhen the song enters the Top 10 on the Billboard charts, the band is taken off the tour and sent to Los Angeles, California for a television appearance. Guy nurses a sick Faye on the flight to L.A. when she falls ill, while Jimmy is preoccupied with convincing White and Play-Tone to let them get back in the studio. After a publicity tour, radio interviews, and a film appearance, the band is set to appear on The Hollywood Television Showcase, a nationally televised live variety show. Jimmy continues to vent frustration at White over the band's direction, while the rest of the band is having the time of their lives. The bass player (who had enlisted before the band's success and is leaving to join the United States Marine Corps in a few weeks) meets some active Marines and abandons Guy to hang out with them. Alone, Guy enjoys an evening out at a jazz club where he meets his idol, jazz pianist Del Paxton. Over drinks, Del shares his band experiences.\n\nA hungover Guy is woken by White via phone and he arrives to the set with the band in chaos. The still missing bass player (last seen at Disneyland with the Marines) is replaced with an older, experienced session bassist, Wolfman; Jimmy is throwing up due to nerves, Lenny is preoccupied with his new girlfriend and impending trip to Las Vegas, and Faye is off at the beauty salon. Back in Erie, Guy's family and Chad (who now works for them in Guy's absence) have fun watching the band. Guy is introduced as \"Shades\", the older Wolfman is quickly passed by, Lenny is called Leo and Jimmy's caption reads, \"Careful girls, he's engaged!\". After the successful performance, Jimmy fumes in the dressing room while insinuating that Faye set his caption up. When he tells everyone that they're not engaged and that he has no intention of buying her a ring, a heartbroken and weary Faye calls Jimmy out and ends their relationship. When she leaves, Jimmy yells after her that he should have dumped her in Pittsburgh. When Jimmy turns his anger on Guy by telling him to take his sunglasses off, he responds by asking \"Why couldn't you have dumped her in Pittsburgh?\", and promptly leaves the dressing room, leaving Jimmy all alone.\n\nThe next day at a scheduled recording session, Jimmy and White have an argument, Lenny is still missing from a trip to Vegas (where he married his new girlfriend) and Wolfman is still standing in for the bass player. Jimmy explodes when White refuses to allow any more than two of his original songs on the band's album and insists that those songs must be upbeat. He then quits the band on the spot, breaching their contract. White assures a crestfallen Guy that such things are common and calls the band the one hit Wonders, telling him that he must be out of the hotel that afternoon. He commends Guy for his smarts and integrity before commenting how Faye is \"special\", having caught on to their growing mutual attraction. Lingering in the studio since its time was already paid for, Guy plays a swinging, jazzy drum routine of his. Del Paxton enters the sound booth, hears him and is impressed enough to invite him to have an impromptu jam session.\n\nAfter being told by Paxton that he could have a real career in music if he stayed, Guy returns to the hotel for his things. Bell captain Lamarr informs him that Jimmy (\"the one with all the attitude\") has checked out, but Faye is alone at the coffee shop counter. Guy tells Faye his plan to stay in L.A. to work as a studio musician with Paxton's references. She asks him if he was in love with his girlfriend in Erie and he says \"[I thought so]\", to which she tells him she wasn't right for him. Before leaving, she tells him that none of the band's success would have happened without him. After watching her for a few seconds, Guy goes out and asks her when the last time she was decently kissed. When she reveals it was several years before (not with Jimmy), he kisses her. After asking Lamarr to watch their things, they walk back into the hotel.\n\nIn the epilogue, it is revealed that Jimmy went back to Play-Tone where he formed another hit-making band, the Heardsmen (a name Jimmy tinkered with before the Wonders), and then had a successful career as a record producer; Lenny became a divorced hotel and casino manager in Nevada; the bass player earned a Purple Heart for injuries suffered at Khe Sanh in Vietnam, then began a career in construction in Orlando; and Guy and Faye married and raised four children in Venice, California, then moved to Bainbridge Island in Washington, where Guy teaches jazz composition at a music conservatory that they founded.\n\nCast [ edit ]\n\nProduction and music [ edit ]\n\nThe movie features original music by Tom Hanks, Adam Schlesinger, Rick Elias, Scott Rogness, Mike Piccirillo, Gary Goetzman and Howard Shore. In the movie, The Wonders rise to brief stardom on the strength of \"That Thing You Do\", a song written as a wistful ballad but which becomes an uptempo rocker during the band's first performance at a talent show. Written and composed for the film by Adam Schlesinger, bassist for Fountains of Wayne and Ivy and released on the film's soundtrack, the song became a genuine hit for The Wonders in 1996 (the song peaked at #41 on the Billboard Hot 100, #22 on the Adult Contemporary charts, #18 on the Adult Top 40, and #24 on the Top 40 Mainstream charts). The track was nominated for a 1996 Golden Globe Award as well as a 1996 Academy Award for Best Original Song. Mike Viola of The Candy Butchers provided the lead vocals for the Wonders.\n\nIn the film, the title song is referenced with \"All My Only Dreams\" as the B-side. The actual 45 RPM single, released to record stores in North America, features \"Dance With Me Tonight\" as its B-side. The song has since been recorded by The Knack and Bubblegum Lemonade. The Wonders are also seen playing the song \"Little Wild One.\" This was written by the band Gigolo Aunts as a \"faux-Beatles\"-style tune at the request of their record label to be submitted for consideration for inclusion in the film.[3]\n\nFor the purpose of being able to convincingly perform The Wonders' songs on-camera, Scott, Schaech, Zahn and Embry took several weeks of individual lessons, followed by daily practice as a group. Of the four, only Zahn and Embry had any prior experience of playing their assigned instruments. They eventually honed their performance to the point where extras on the set thought they were actually playing the songs, when in reality they were miming along to recordings by professional musicians.[4]\n\nThe song that plays during the film's opening credits, \"Lovin' You Lots and Lots,\" is credited to the fictitious Norm Wooster Singers and was actually written by Hanks. This song is a send-up of Ray Conniff, Mitch Miller, and other practitioners of the \"beautiful music\" or proto-Muzak formats that were a staple of adult radio during the early '60s such as on KPOL (AM)1540 in Los Angeles.[5][6] Hanks also composed Guy's jazzy signature drum solo, \"I Am Spartacus.\"\n\nThe ballad \"My World Is Over\" by Diane Dane seems inspired by the compositions of Burt Bacharach and Hal David; the vocal performance is reminiscent of Jackie DeShannon.\n\nThe Wonders' bassist (played by Ethan Embry) is unnamed in the film; he is credited simply as 'T.B. Player' (for The Bass Player). This is a joke based on the perception that bass players are often unknown and unappreciated. Embry later provided his own take on the character's real name: \"I just said my name was Tobias, because he’s \"such\" a Tobias. You just take the vowels out [and it's T.B.] His nickname was Toby, but his mom calls him Tobias. And his last name actually was Player, because he was a player, dude! That carousel ride with the Chantrellines? Total player.\"[4]\n\nThe tour and TV appearance are done in the authentic style of rock bands of the mid-1960s, including Go-Go girls, elaborate sharing of microphones, and formal clothing in various matching colors.\n\nThe song \"Voyage Around the Moon\" by the fictional band Saturn 5 closely resembles \"Pipeline\" by The Chantays. The scene where The Wonders are miming the instrumental tune \"Shrimp Shack\" during the filming of a beach party film titled Weekend at Party Pier is an overt reference to the scene in Pajama Party wherein The Nooney Rickett 4 play the instrumental Beach Ball.[7][better source needed]\n\nThe movie was written at a time when Hanks was dealing with his own issues with increasing successes in his career. During his appearance on Inside the Actors Studio, Hanks said he told the studio, \"I'm a big honkin' star and you have to let me do what I want to do,\" to which the studio replied, \"You're absolutely right.\"\n\nThe (real) Wonders [ edit ]\n\nThere were at least two real bands named the Wonders who made the record charts at various radio stations in the early 1960s. One had a ballad titled \"With These Hands\" (b/w \"Please Don't Cry\"; Bamboo 523) that was played by KCRG in Cedar Rapids, Iowa, in the fall of 1962.[8]\n\nThe other Wonders had a regional hit record called \"Say There\" (b/w \"Marilyn\"; Colpix 699), released by Colpix Records in August 1963.[9] Little is known about these Wonders, except that they were probably from Ohio or Pennsylvania; \"Say There\" hit the Top 20 at WCOL in Columbus, Ohio, and made the Top 30 at KQV in Pittsburgh.[10] (There is a scene in the film in which a disc jockey at WCOL is seen playing \"That Thing You Do!\")[11]\n\nThe name \"The Oneders\" references the Beatles' purposeful misspelling in their name.\n\nBoth bands lost their original bass player and replaced their original drummer (in the Beatles' case, Stuart Sutcliffe and Pete Best, respectively).\n\nThe song \"That Thing You Do\" is portrayed as a ballad that was sped up and became a hit; the Beatles' \"Please Please Me\" started as a ballad, was sped up, and became the group's first No. 1. [12]\n\nWhite is allegedly modeled on Beatles' manager Brian Epstein.\n\nAccording to Tom Hanks, the film grew out of the idea of the Beatles' breakthrough after Pete Best's firing. [13]\n\nThe \"Careful girls, he's engaged\" caption under Mattingly's name is a reference to the \"Sorry girls, he's married\" caption under John Lennon's name when the Beatles appeared on The Ed Sullivan Show .\n\n. Faye is mistaken for a fan and is prevented by the police from following the band. A similar incident happened to Cynthia Lennon, John Lennon's first wife.\n\nWhen Guy and Tina meet after she arrives at Villapiano's for the group's paying gig, the owner of the restaurant mockingly refers to Guy as 'Ringo' and tells him that the group should have started their performing 'five minutes ago'.\n\nWhen the band are guests on radio station KMPC Los Angeles, the dj, as part of his introduction, says \"But hey! I got some exciting guests on my show today. Makers of a hit record - visitors from the east....oops, hold on girls. Not THOSE mop-tops!\"\n\nWaiting for the nationally televised presentation of the group, former drummer Chad wonders about how many viewers would be watching and Guy's father answers asking him how many people saw the Beatles on The Ed Sullivan Show .\n\n. At the fictitious west-coast television broadcast the Hollywood Television Showcase , guest host Troy Chesterfield introduces The Wonders by saying, \"The latest rock and roll group to challenge The Beatles to a hair-combing contest,\" referencing the similarity in both bands' unusual hair styles.\n\n, guest host Troy Chesterfield introduces The Wonders by saying, \"The latest rock and roll group to challenge The Beatles to a hair-combing contest,\" referencing the similarity in both bands' unusual hair styles. In the extended version of the film, the act \"Paul Pope's Primitive Primates,\" which is only briefly mentioned in the theatrical cut, portrays four chimpanzees dressed up in suits and wigs, along with British accents, instruments, and the similar name \"The Chimples\" to mimic The Beatles.\n\nSoundtrack [ edit ]\n\nThe soundtrack album (released under the Play-Tone name in conjunction with Epic Records) was also a hit, peaking at #21 on the Billboard 200 albums chart. The CD artwork is a replica of the fictional Play-Tone label used in the movie, and the liner notes are done in a mockumentary style, as if the Wonders had been a real group and the events of the film had actually happened. Hanks later used the success of That Thing You Do! as a springboard to launch the actual Playtone Records label, through which the soundtracks of all his subsequent films, and other films like Bring It On and television programs like The Sopranos, were released as albums.\n\nTrack listing [ edit ]\n\nNo. Title Music Artist Length 1. \"Lovin' You Lots and Lots\" Tom Hanks The Norm Wooster Singers 1:54 2. \"That Thing You Do!\" Adam Schlesinger The Wonders 2:47 3. \"Little Wild One\" David Gibbs, Steve Hurley, Phil Hurley, Fred Elringham The Wonders 2:30 4. \"Dance With Me Tonight\" Scott Rogness, Rick Elias The Wonders 2:05 5. \"All My Only Dreams\" Rogness, Elias The Wonders 2:54 6. \"I Need You (That Thing You Do)\" (The movie credits list this song as being from 'The Heardsmen'.) Rogness, Elias, Linda Elias The Wonders 2:53 7. \"She Knows It\" Rogness, Elias The Heardsmen 3:01 8. \"Mr. Downtown\" Hanks, Gary Goetzman, Mike Piccirillo Freddy Fredrickson 2:32 9. \"Hold My Hand, Hold My Heart\" Hanks, Goetzman, Piccirillo The Chantrellines 3:11 10. \"Voyage Around The Moon\" Hanks, Goetzman, Piccirillo The Saturn 5 3:04 11. \"My World Is Over\" Piccirillo Diane Dane 3:01 12. \"Drive Faster\" Rogness, Elias The Vicksburgs 2:48 13. \"Shrimp Shack\" Piccirillo Cap'n Geech & The Shrimp Shack Shooters 2:22 14. \"Time To Blow\" Steve Tyrell, Robert Mann Del Paxton 4:20 15. \"That Thing You Do! (Live at the Hollywood Television Showcase)\" Schlesinger The Wonders 2:54 Total length: 42:09\n\nReception [ edit ]\n\nThe film was well received by critics and currently holds a 93% fresh rating at the film review aggregator Rotten Tomatoes, based on 56 reviews with an average rating of 7.2/10. The site's consensus reads, \"A light, sweet, and thoroughly entertaining debut for director Tom Hanks, That Thing You Do! makes up in charm what it lacks in complexity\". On Metacritic the film has a score of 71 based on 22 critics, indicating \"generally favorable reviews\". The film debuted at No. 3.[14] The film grossed $25,857,416 domestically and $8,728,000 abroad for a worldwide gross of $34,585,416.[1]\n\nThe film is recognized by the American Film Institute in this list:\n\nHome media [ edit ]\n\nInitial release [ edit ]\n\nThat Thing You Do! was first released in mid-1997 on VHS. In 1998, the film became available in the DIVX format (as with all 20th Century Fox films), rather than DVD.\n\nFirst DVD [ edit ]\n\nAfter DIVX failed, the film was released onto DVD on June 5, 2001. It included the featurette \"The Making of That Thing You Do!,\" and two music videos.\n\nExtended Edition DVD [ edit ]\n\nOn May 8, 2007, Tom Hanks' Extended Edition was released on DVD. The film's theatrical cut and an extended cut with 39 additional minutes of deleted scenes are included.\n\nMany of the deleted scenes are devoted to character development. A tastefully steamy look at Guy's \"make-out\" session with Tina at his apartment is included. The extended version also goes more in-depth with Guy's developing relationship with Faye (via mild flirting) and his deteriorating relationship with Tina, as well as Tina's budding relationship with her dentist, Dr. Collins. It also suggests that the character portrayed by Tom Hanks (Mr. White) is not only gay but in a relationship with a man played by former NFL defensive lineman Howie Long.[16]\n\nMore camera time is also devoted to the tryst between the bass player and one of the singers of the Chantrellines. In the theatrical cut, this romance was depicted mainly as an unrequited crush on the part of the bass player; in the extended cut it is clearly shown that his efforts were successful.\n\nAt the end of the Extended Edition, rather than becoming a studio drummer on the recommendation of Del Paxton, Guy becomes a disc jockey for the jazz station KJZZ and records a documentary series of interviews with legendary jazz musicians.\n\n2007 DVD repackage re-release [ edit ]\n\nThat Thing You Do! was packaged with Bachelor Party and The Man with One Red Shoe in the Tom Hanks Triple Feature DVD anthology set. The actual DVD appears to be the original 2001 disc, with the featurette and music videos.\n\nBlu-ray release [ edit ]\n\n20th Century Fox Home Entertainment released the film on Blu-ray on April 2, 2013. The Blu-ray includes the Theatrical and Extended cuts as well as all of the bonus features found on the 2-Disc DVD.\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/5/51/That_Thing_You_Do%21_film_poster.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/5/51/That_Thing_You_Do%21_film_poster.jpg/220px-That_Thing_You_Do%21_film_poster.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/6/6c/Wiki_letter_w.svg/40px-Wiki_letter_w.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/5/51/That_Thing_You_Do%21_film_poster.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/That_Thing_You_Do!", "title": "That Thing You Do!", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/5/51/That_Thing_You_Do%21_film_poster.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}