{"url": "https://fashionista.com/2018/07/kristin-cavallari-fashion-style", "text": "Kristin Cavallari. Photo: Courtesy\n\nWe all buy clothes, but no two people shop the same. It can be a social experience, and a deeply personal one; at times, it can be impulsive and entertaining, at others, purpose-driven, a chore. Where do you shop? When do you shop? How do you decide what you need, how much to spend and what's \"you\"? These are some of the questions we're putting to prominent figures in our column \"How I Shop.\"\n\nEveryone's favorite drama (\"drama, drama, dramaaa\") queen, Kristin Cavallari, is back on TV. It's been over a decade since she slowly walked out of an infinity pool and into our lives on \"Laguna Beach: The Real Orange County,\" and made the bossest of boss moves by being the only one to wear white to Lauren Conrad's \"Black and White Affair\" party. (And who can forget when she, again, stole L.C.'s thunder on spin-off \"The Hills\" by surprise-sauntering into Speidi's wedding in 2009?)\n\nThis time around, Cavallari moves into another life via reality TV fishbowl, set not in Southern California, but her new home of Nashville, Tenn. \"Very Cavallari\" showcases the titular star's home life, with NFL quarterback husband Jay Cutler and her three kids, and professional responsibilities running Uncommon James, her recently launched jewelry and lifestyle line, opening its flagship store and overseeing a team of TV-ready staffers at the company HQ. Cavallari has been stacking her fashion resumé since \"The Hills\" by curating a NFL-themed runway show at New York Fashion Week, designing her eponymous shoe line in collaboration with Chinese Laundry, commenting on red carpet fashion for E! and, of course, launching Uncommon James.\n\n\"I design everything that I love and want to wear,\" she tells Fashionista over the phone from Nashville. \"It's a great representation of my style because everything is effortless and dainty and simple.\"\n\nSince \"Very Cavallari\" is largely set in a retail and fashion environment, we took the opportunity of its launch to ask the reality show star, designer and entrepreneur about her shopping habits, from her teen years to today. So read on to learn about her first big splurge as a reality star, when she knows a look in her closet is officially \"dunzo\" (sorry, couldn't help it) and how her DGAF attitude toward fashion dates back to her \"Laguna Beach\" days. Cue up the Hilary Duff song and prepare for some on-brand Cavallari one-liners.\n\nStephen \"Steph-EEEN\" Colletti, Cavallari and Talan \"ta-LAN\" Torriero at a Bongo Jeans at Kohl's Orange County store appearance in 2006. Photo: David Livingston/Getty Images\n\n\"On 'Laguna Beach' — I mean I was 17 — so I didn't care [laughs]. I didn't even know what fashion was. I just wore what everyone in Laguna Beach was wearing and what I liked. I mean I wore jeans first with Ugg boots and I thought that was the coolest thing ever. What was so great about season one of 'Laguna Beach' was none of us knew what we were getting into and so we didn't care. Or I know I didn't care about about my outfits or my hair and my makeup. I was just living my life. I've never been a huge fan of putting a lot of time in everyday to get ready. I really enjoy it when it's once in awhile, but everyday I find it's just exhausting. So I've just always been that way: I care, but not that much.\n\nIt's funny in the sense that now people ask 'go back and comment on your outfits from 10 years ago' and it's like, 'oh god.' Of course, they're all awful! It's just the evolution of everybody and what I wore, let's say, when I was 18, was probably cool at that point. But now, of course, looking back, I cringe. There's always going to be that element of, 'let's go back in time and can you comment on this picture,' which most people don't have to do. I don't mind it necessarily. I'm just living my life, and so I'm not really reading blogs and reading comments about what people think about my outfits, so it doesn't affect me one way or the other, really.\n\nI'd say [I found my personal style] in the last couple years. It wasn't like this 'ah ha' moment. I mean I've worked with many, many stylists over the years and because I wasn't really sure of my own personal style, like in my early 20s, I was just trying to bend to whatever my stylist was kind of putting me in. Whereas now, I feel like I really have a grasp of who I am and what I'm drawn to, so I'm more likely to say 'no' to things that maybe I wouldn't have before because I was just figuring out my style. So now my stylist [Dani Michelle, who also styles Kourtney Kardashian] that I've been working with for the past year, really gets me.\n\nI did work with Dani, my stylist, for some looks [to wear on 'Very Cavallari']. Because I'm in Nashville and Dani's out in L.A., it's not like she's going to pop over whenever. So we put some looks together when I saw her before we started shooting. But then of course, since she's not here, I had to do a little bit myself, as well. But I actually found, to be honest, for filming a show like that, doing it myself made more sense because it's a reality show and I don't work with a stylist every day. So I just felt more authentic when I was putting my outfits together and I was doing my own hair and makeup. That's just who I am, so that just made more sense to me.\n\nI always would know my schedule and exactly what we were shooting the next day, so I would take time the night before to figure out what I was going to wear. It would never be just five minutes before we start filming, just throwing on an outfit together. I really did try to put some thought into it. If I was just at home cooking dinner, obviously I'm not decked out and it's really true to what I would wear — like little shorts and a tank top or something — but if it's me going to the office or me doing whatever, yeah, I definitely put thought into it.\n\nBecause I have an office that I go to, I need clothes I can to wear to an office, which I didn't have to do for.. forever... I've never had to do that. I'm all of a sudden having to get more professional kinds of clothes and dresses and pants and stuff like that. I really like A.L.C. and L'Agence and Veronica Beard for great blazers. I like Helmut Lang and Frame Denim. I would wear jeans with heels and a blazer. I think that's a great classic look that you can get away with. None of my outfits look like I spent a lot of time on them, I hope, but effortless and sophisticated. So hopefully, if we get season two, I think I'll do everything myself.\n\nThe perfect outfit for me is: jeans, a great pair of booties, some sort of a basic, like a tank top or a tee, a really cool blazer and a hat. I'm all about basics and I really think that accessories can make or break an outfit. The whole point of Uncommon James is to have a line that's easy for the modern woman. I want you to throw these pieces on and never take them off. I want you to mix and match them with what you already have or within each of the collections. That's really how my style is. I want to throw things on and go.\n\nI'm also a quick shopper. I know either exactly what I want — or I know what's going to look good on me and what's not — so I get in, I get out, whether it's in-store or online. I can't spend hours and hours. I can't drag it on. If I go into a store, I'm in and out in five minutes. I hate trying things on. I primarily shop online and I shop at Intermix.com and Revolve.com and that's kind of it, to be honest. Dani will get me some stuff sometimes, but those are my two go-tos.\n\nCavallari at the 22nd Annual Elton John AIDS Foundation Academy Awards Viewing Party in 2014. Photo: Jamie McCarthy/Getty Images for EJAF\n\nOne of my favorites outfits was from the [2014] Oscars. I was doing commentary for E! and I wore an Alexander McQueen — just very simple, beautiful white dress with these beaded cap sleeves and I was pregnant so it was one of those really special moments. It was one of my first times wearing McQueen and so I just felt like a princess. Afterwards, I changed into a Balmain dress to go to an Elton John party [above] and same thing: my first time wearing Balmain. [The experience] made me step up my game. If I'm gonna be out there commenting on fashion, I gotta know my shit, so it's really made me put more thought into it and care more, to be totally honest.\n\nBut I really don't have a lot of designer stuff. That's probably a misconception about me, but I just don't care enough. This is so horrible, but I just don't. I'm not buying, like, Chloé shirts and sweaters and I kind of think it's silly, to be completely honest. I'm more about spending money on, okay, a great pair of shoes. I'll shell out some money on a purse. I bought a little baby Céline that has yellow on the sides. That's kind of like a risky move for me — buying anything with yellow — and so that was a big splurge for me not too long ago and I've only used it one time, which really sucks. There's not like one item that I've splurged a lot on. It's more like I'll get a lot of items, so it'll be like one big overall splurge.\n\nRELATED ARTICLES\n\nI'm the opposite of a hoarder. I love getting rid of stuff. I donate a ton or I still send my stuff to [consignment store] Luxury Garage Sale in Chicago. But only like my really good stuff. I go through my closet all the time. For sure, if I haven't worn it in six months, but there are times where I'm like, 'well, maybe I'll wear it.' I always make up some sort of excuse and then I never end up wearing it. So if it goes through a cycle of me debating whether I want to get rid of it, then the next cycle, if I still haven't worn it, then I'll for sure get rid of it. Sometimes I'll wear something a couple times and then I'm like, 'actually, I don't know, I don't like it.' That sounds like I'm constantly shopping and getting rid of stuff. But I really only shop a couple times a year.\n\nI don't have a lot of sentimental or just meaningful things that I've just had forever [laughs]. Well, okay, I have the first pair of Louboutins that I ever bought. That was a really big moment for me to buy my own pair when I was 18 and because I'm such a shoe girl — I just love shoes — they're so beat up. But it's just black sling-backs, peep-toe heels. But I still have them and I still love them. I'm sure they're in some paparazzi pictures. I know they're in paparazzi pictures.\"\n\nThis interview has been edited and condensed for clarity.\n\n'Very Cavallari' airs on Sundays at 10 p.m. on E!", "images": ["https://fashionista.com/.image/t_share/MTU2NzMwOTM1MTAwODQzNjMy/kristin-cavallari-leopard-print-coat.jpg", "https://fashionista.com/.image/t_share/MTU2ODkxNzQ0MzEzNTUwNDQ4/kristin-cavallari-shop.jpg", "https://fashionista.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTYwNjc1Mjc3OTA5Nzk2ODM5/main-ja-rule-ashanti-paper-magazine-party-miss-circle.jpg", "https://fashionista.com/.image/t_share/MTU2ODkxNzU2MTI0NzEwNTEy/kristin-cavallari-shop.png", "https://fashionista.com/.image/c_fill%2Ccs_srgb%2Cfl_progressive%2Cq_auto:good%2Cw_1280/MTQ3MzQzMTc3NTg0NDg2MzU3/fashionista-hub-thebusines-1.jpg", "https://fashionista.com/.image/t_share/MTU2NzMxMDA2MjM2MjM5NDcy/kristin-cavallari-blazer-jeans-chanel-bag.jpg", "https://fashionista.com/.image/cs_srgb%2Cq_auto:good/MTQ1NTQ5OTY2NzI5ODE1NjA3/mtqwndi3ntcznze1oda1njgw-1.svg", "https://fashionista.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTU4NTg4Mzg2MzE4MjMwOTYx/dilone-model-fashion-clothes-style-th.jpg", "https://fashionista.com/.image/cs_srgb%2Cq_auto:good/assets/MTM0MTYyNjUxNDg2OTMwOTU0/site-nav-logo.svg", "https://fashionista.com/.image/t_share/MTU2NzMxMTE5Nzg0NDM3MzYw/kristin-cavallari-balmain-lace-dress-elton-john-oscars-party-2014.jpg", "https://fashionista.com/.image/t_share/MTU2NzMwODQzNTY0MzUzMTM2/stephen-colletti-kristin-cavallari-talan-torriero-bongo-laguna-beach-2006.jpg"], "top_img": "https://fashionista.com/.image/t_share/MTU2ODkxNzU2MTI0NzEwNTEy/kristin-cavallari-shop.png", "keywords": [], "authors": ["Fawnia Soo Hoo"], "canonical_link": "https://fashionista.com/2018/07/kristin-cavallari-fashion-style", "title": "How I Shop: Kristin Cavallari", "meta_data": {"referrer": "unsafe-url", "HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1", "apple-mobile-web-app-capable": "no", "apple-mobile-web-app-status-bar-style": "black", "format-detection": "address=no", "google-site-verification": "TUkwvpzHc7_80yJEnb9HCoPrp2jYlkLlZrEIu53H66o", "msvalidate.01": "565AA37CB662E60BF24DDCABEC686D8F", "generator": "Tempest - www.saymedia.com", "pinterest": "nohover", "author": "Fawnia Soo Hoo", "description": "\"I didn't care,\" says the star of E's 'Very Cavallari' about her mid-aughts 'Laguna Beach' wardrobe. \"I didn't even know what fashion was.\"", "keywords": "The Hills,Laguna Beach,Network,how i shop,Fashionistagram,Kristin Cavallari,Shopping,Balmain,ALC", "section": "Shopping", "pagetype": "article", "item-id": "ci022ccdd290002536", "published": "2018-07-09T12:30:00Z", "modified": "2018-07-11T20:18:25Z", "dcterms.rightsHolder": "Breaking Media, Inc. All rights reserved.", "dcterms.dateCopyrighted": 2020, "twitter": {"card": "summary_large_image", "site": "@Fashionista_com", "url": "https://fashionista.com/2018/07/kristin-cavallari-fashion-style", "image": "https://fashionista.com/.image/t_share/MTU2ODkxNzU2MTI0NzEwNTEy/kristin-cavallari-shop.png", "description": "\"I didn't care,\" says the star of E's 'Very Cavallari' about her mid-aughts 'Laguna Beach' wardrobe. \"I didn't even know what fashion was.\"", "domain": "fashionista.com"}, "og": {"type": "article", "url": "https://fashionista.com/2018/07/kristin-cavallari-fashion-style", "title": "How I Shop: Kristin Cavallari", "description": "\"I didn't care,\" says the star of E's 'Very Cavallari' about her mid-aughts 'Laguna Beach' wardrobe. \"I didn't even know what fashion was.\"", "image": "https://fashionista.com/.image/t_share/MTU2ODkxNzU2MTI0NzEwNTEy/kristin-cavallari-shop.png", "site_name": "Fashionista"}, "fb": {"pages": 93829151519, "app_id": 143200122371223}, "p": {"domain_verify": "32a1f0a80abfeb4896ddfda6220640f7"}, "pinterest-rich-pin": "true", "apple-mobile-web-app-title": "Fashionista", "parsely-title": "How I Shop: Kristin Cavallari - Fashionista", "parsely-link": "https://fashionista.com/2018/07/kristin-cavallari-fashion-style", "parsely-image-url": "https://fashionista.com/.image/c_fill%2Ccs_srgb%2Ch_400%2Cq_auto:good%2Cw_620/MTU2ODkxNzU2MTI0NzEwNTEy/kristin-cavallari-shop.png", "parsely-post-id": "ci022ccdd290002536", "parsely-pub-date": "2018-07-09T12:30:00Z", "parsely-section": "Shopping", "parsely-author": "Fawnia Soo Hoo", "parsely-tags": "The Hills,Laguna Beach,Network,how i shop,Fashionistagram,Kristin Cavallari,Shopping,Balmain,ALC", "sailthru.title": "How I Shop: Kristin Cavallari", "sailthru.image.full": "https://fashionista.com/.image/t_share/MTU2ODkxNzU2MTI0NzEwNTEy/kristin-cavallari-shop.png", "sailthru.date": "2018-07-09T12:30:00Z", "sailthru.author": "Fawnia Soo Hoo", "sailthru.tags": "The Hills,Laguna Beach,Network,how i shop,Fashionistagram,Kristin Cavallari,Shopping,Balmain,ALC", "sailthru.description": "\"I didn't care,\" says the star of E's 'Very Cavallari' about her mid-aughts 'Laguna Beach' wardrobe. \"I didn't even know what fashion was.\"", "phx": {"content-item-id": "ci022ccdd290002536", "content-object-type": "ContentArticle"}, "ir-site-verification-token": 666366253}, "movies": [], "publish_date": 1531139400.0, "source": "https://fashionista.com", "summary": ""}