{"url": "www.businessinsider.com/gwyneth-paltrow-chris-martin-divorce-financial-breakdown-who-makes-what-2014-3", "text": "Chris Martin breaks down his Coldplay pay structure, while Gwyneth Paltrow has plenty of dough thanks to her \"Iron Man\" paycheck. Charley Gallay/Getty Gwyneth Paltrow, 41, and Chris Martin, 37, announced their split Tuesday on her website, Goop, in a civilized blog post titled \"Conscious Uncoupling.\"\n\nThe couple have two children.\n\nAfter 10 years, the Oscar-winning actress and Coldplay frontman have amassed quite an empire — but what exactly is at stake if the two proceed with the divorce?\n\nE! Online estimates that Paltrow and Martin are worth $140 million each, making their combined fortune a whopping $280 million. But reports of their wealth vary widely, with Britain's Sunday Times pegging their combined net worth at nearly $120 million in 2012.\n\nIn 2013, Paltrow and Martin both appeared on Forbes magazine's list of the 100 highest-earning celebrities. Paltrow landed at No. 71 with $10 million and Coldplay came in at No. 14 with $64 million.\n\nSo where's all the dough coming from? Let's break it down.\n\nChris Martin:\n\nChris Martin, who makes most of his money off concert tours, just joined NBC's \"The Voice.\" Facebook/The Voice \"Chris Martin is clearly the bigger earner in the relationship,\" Dorothy Pomerantz, L.A. bureau chief for Forbes, told E! News. \"With musicians like Coldplay it depends on touring, which is where they make the big money. So every year these guys go out on tour, they will sell out giant arenas and will make tons of money. It doesn't really come from the album sales. It comes from the touring.\"\n\n\n\nIndeed, Martin has admitted that Coldplay owns only a piece of its publishing rights, while the band's Universal Music label owns its catalogue.\n\nMartin discussed the matter with Howard Stern in a 2011 interview. \"No, we don't own hardly any of it … You'll have to talk to my manager, but we don't own it for at least 20 years or something.\n\n\"We own quite a lot of the publishing but we don't own much of the recording,\" he said. \"That's why people always think bands are a lot richer than they are because they never remember that bit.\"\n\nMartin doesn't have to worry, though. He told Stern that the four members split their earnings \"20-20-20-40,\" with the largest share going to him as the lead singer-songwriter.\n\nThat breakdown fares well for Martin, whose band sold more than 60 million albums worldwide and whose last 2012 \"Mylo Xyloto\" concert tour grossed more than $170 million, according to The New York Times.\n\nGwyneth Paltrow:\n\nThanks to Gwyneth Paltrow's Goop website, best-selling cookbooks, and endorsement deals, the actress has turned into a lucrative lifestyle brand. Kevin Winter/Getty According to Bloomberg Businessweek, Paltrow's films have grossed more than $3.9 billion worldwide. \"Iron Man\" accounts for $1.2 billion of that.\n\n\"When you are in a movie like 'Iron Man,' even if you are not the star and it makes so much money you get some of that back end,\" says Forbes' Dorothy Pomerantz. \"She is not getting Robert Downey Jr. money but she gets a taste of it. She gets money from Goop, from her cookbooks, and from her TV work ... She has money coming from several different sources now, because she really is a brand and when you put it all together, it is around $10 million.\"\n\nIn addition to Paltrow's 150,000 Goop subscribers and her newest cookbook, 2013's \"It's All Good,\" debuting at No. 1 on The New York Times best-seller list, the 41-year-old has lucrative endorsement deals.\n\nPeople magazine reported that Paltrow's portfolio includes Max Factor's Modern Icon campaign ($4.9 million), Boss perfume ($1.9 million), and Estée Lauder ($8.2 million).\n\nIn 2008, the year she became a face of Estée Lauder and the first \"Iron Man\" came out, Forbes estimated she made $25 million.\n\nReal Estate:\n\nThe couple's kitchen in their Los Angeles home. Veranda Unveils The couple's real-estate portfolio has five properties around the world — a \"home they bought in 2012 in L.A.'s Brentwood neighborhood, a Manhattan apartment, a Hamptons estate and a mansion in London's upscale Belsize Park neighborhood, which they bought from Kate Winslet in 2004. Additionally, they purchased the property next door and combined the two into a single large estate,\" according to People.\n\nEarlier this month, the Los Angeles Times said the couple paid $14 million for a Malibu home, which will now reportedly be used as Martin's \"bachelor pad.\"\n\nThe couple likely have a prenuptial agreement, but if not, California — the state in which they were married — is a community property state, meaning marital property is divided in half in the event of a divorce.", "images": ["https://static3.businessinsider.com/assets/images/careerbuilder.png", "https://i.insider.com/53344ba06bb3f7405412cef2?width=1200&format=jpeg", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1 1'%3E%3C/svg%3E", "https://i.insider.com/5329b5f6eab8eae875be2966?width=600&format=jpeg&auto=webp", "https://i.insider.com/53345c5069bedddd2c184b2a?width=600&format=jpeg&auto=webp", "https://i.insider.com/53344bb5eab8ea923a12cef6?width=600&format=jpeg&auto=webp", "https://i.insider.com/53345cc4eab8eaae0512ceef?width=600&format=jpeg&auto=webp", "http://www.businessinsider.com/gwyneth-paltrow-chris-martin-divorce-financial-breakdown-who-makes-what-2014-3?width=600&format=jpeg&auto=webp"], "top_img": "https://i.insider.com/53344ba06bb3f7405412cef2?width=1200&format=jpeg", "keywords": [], "authors": ["Aly Weisman"], "canonical_link": "https://www.businessinsider.com/gwyneth-paltrow-chris-martin-divorce-financial-breakdown-who-makes-what-2014-3", "title": "Here's What's At Stake In Gwyneth Paltrow And Chris Martin's Multimillion-Dollar Divorce", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "Here's What's At Stake In Gwyneth Paltrow And Chris Martin's Multimillion-Dollar Divorce", "date": "2014-03-27", "news_keywords": "People, Gwyneth Paltrow, Chris Martin, Divorce, Assets, Aly Weisman", "description": "Chris Martin breaks down his Coldplay pay structure, while Gwyneth Paltrow has plenty thanks to her \"Iron Man\" paycheck.", "author": "Aly Weisman", "article": {"publisher": "businessinsider", "content_tier": "free", "opinion": "false"}, "tbi-vertical": "Entertainment", "og": {"title": "Here's What's At Stake In Gwyneth Paltrow And Chris Martin's Multimillion-Dollar Divorce", "description": "Chris Martin breaks down his Coldplay pay structure, while Gwyneth Paltrow has plenty thanks to her \"Iron Man\" paycheck.", "type": "article", "url": "https://www.businessinsider.com/gwyneth-paltrow-chris-martin-divorce-financial-breakdown-who-makes-what-2014-3", "image": "https://i.insider.com/53344ba06bb3f7405412cef2?width=1200&format=jpeg", "site_name": "Business Insider"}, "sailthru.title": "Here's What's At Stake In Gwyneth Paltrow And Chris Martin's Multimillion-Dollar Divorce", "sailthru.date": "2014-03-27", "sailthru.tags": "People, Gwyneth Paltrow, Chris Martin, Divorce, Assets, Aly Weisman", "sailthru.description": "Chris Martin breaks down his Coldplay pay structure, while Gwyneth Paltrow has plenty thanks to her \"Iron Man\" paycheck.", "sailthru.author": "Aly Weisman", "sailthru.verticals": "thewire", "sailthru.image.full": "https://i.insider.com/53344b866da811bc28fec9ca?width=1200&format=jpeg", "sailthru.image.thumb": "https://i.insider.com/53344b866da811bc28fec9ca?width=160&format=jpeg", "twitter": {"card": "summary_large_image", "site": "@EntInsider"}, "fb": {"pages": 20446254070}, "apple-itunes-app": "app-id=554260576", "linkedin": {"owner": "mid:1d5f7b"}, "ii-ab-test": {"mobile-sticky": "variant", "pfi-wider-content": "variant", "back-to-top": "variant", "sticky-section-titles": "control", "post-breadcrumbs": "variant", "tabbed-homepage": "control", "expanded-coverage-module": "variant"}, "viking-id": "533442aa6bb3f7ce3712cef3", "env": "prod", "msapplication-config": "//www.businessinsider.com/public/assets/BI/US/favicons/browserconfig.xml?12-31-19", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1395849600.0, "source": "http://www.businessinsider.com", "summary": ""}