{"url": "https://en.wikipedia.org/wiki/List_of_Roseanne_episodes", "text": "No.\n\noverall No. in\n\nseason Title Directed by Written by Original air date Prod.\n\ncode US viewers\n\n(millions)\n\n199 1 \"Call Waiting\" Mark K. Samuels Drew Ogier and Allan Stephan Blasband September 17, 1996 ( ) 1001 18.9[ citation needed ]\n\nRegretting breaking the rules and fighting with Roseanne, Dan fixes the house after the huge fight and leaves a ton of messages on Jackie's answering machine. Roseanne finds herself in front of Jackie's TV, watching notable past sitcoms like That Girl, I Dream of Jeannie, and The Mary Tyler Moore Show (Cameo appearance by Ed Asner on the latter show), eventually finding her and Dan playing the roles of Ann & Don, Mary and Lou Grant, and Jeannie and Tony. Later, Jackie convinces Roseanne that Dan and Roseanne were meant for each other and, when she is finally alone with Andy and Jerry, makes a shocking discovery about her lottery ticket after watching the lottery drawings on TV.\n\n200 2 \"Millions from Heaven\" Mark K. Samuels Nancy Steen and Cynthia Mort September 24, 1996 ( ) 1002 17.6[ citation needed ]\n\nThe lottery ticket mentioned in the last episode is a winner. Roseanne has won $108 million. Amid the press bombardment, the family ponders what to do with all that money.\n\n201 3 \"What a Day for a Daydream\" Mark K. Samuels Richard Kaplan and Garland Testa October 1, 1996 ( ) 1003 18.6[ citation needed ]\n\nWith a full dinner table and a home-cooked meal, Roseanne daydreams about the lottery winnings; from a riot on the Jerry Springer Show to a glamorous photo shoot with Jackie and Hugh Hefner.\n\n202 4 \"Honor Thy Mother\" Mark K. Samuels Bob Nickman and Amy Welsh October 8, 1996 ( ) 1004 16.9[ citation needed ]\n\nDan announces that he's going to visit his mother in California. Jackie and Roseanne wait out the Conner house's renovation at a spa.\n\n203 5 \"Someday My Prince Will Come\" Mark K. Samuels Carrie Snow and Janet Leahy October 15, 1996 ( ) 1005 15.7[ citation needed ]\n\nPrince Carlos Charmaine (Jim Varney) from Moldavia, visits Jackie, with whom he's enamored after seeing her on television. Roseanne warns Jackie to remain distant, until Leon discovers that he's really a prince. The family are invited on a trip to New York with Leon in place of Dan, who's still in California.\n\n204 6 \"Pampered to a Pulp\" Mark K. Samuels Stacie Lipp October 22, 1996 ( ) 1006 15.3[ citation needed ]\n\nRoseanne and Jackie's spa trip subjects them to a strict diet, acid peels, skin toxins, and exhausting hikes. Tammy Faye Messner appears in this episode.\n\n205 7 \"Satan, Darling\" Roseanne Story by : Roseanne and Ellen Quigley\n\nTeleplay by : Roseanne and Jennifer Saunders October 29, 1996 ( ) 1007 17.7[ citation needed ]\n\nRoseanne, Jackie, and Nancy visit New York City's Upper West Side, where they meet celebrities and are invited to Martha's Vineyard by a woman named Astrid Wentworth. After getting drunk with Edina Monsoon (Jennifer Saunders) and Patsy Stone (Joanna Lumley) of Absolutely Fabulous, Roseanne has a Rosemary's Baby-parody nightmare of Darlene giving birth to Satan.\n\n206 8 \"Hoi Polloi Meets Hoiti Toiti\" Mark K. Samuels Leif Sandaas and Debbie Kasper November 12, 1996 ( ) 1008 13.3[ citation needed ]\n\nRoseanne, Jackie, DJ, Mark, Bev, Becky, Andy, and Jerry go to the Wentworth estate to meet Astrid's family, who aren't impressed at Roseanne's trashy ways. When she finds the family's stash of \"happy pills,\" Roseanne teaches them to scream out their anger. Dana Gould appears in this episode.\n\n207 9 \"Roseambo\" Gary Halvorson R. Gaylor and Betsy Salkind November 19, 1996 ( ) 1009 12.2[ citation needed ]\n\nIn a parody of Dark Territory (starring Steven Seagal), Roseanne meets First Lady Hillary Clinton (Teresa Barnwell), after saving her family and Dr. Bakshmi from women-hating terrorists on a train to Washington D.C. Steven Seagal appears in this episode.\n\n208 10 \"Home Is Where the Afghan Is\" Gary Halvorson Lawrence Broch November 26, 1996 ( ) 1010 15.0[ citation needed ]\n\nRoseanne, Jackie, and the family finally arrive home after all the excitement. Roseanne is disappointed that Dan has not returned from his trip. Her Thanksgiving dinner is being catered, so she and Jackie open the Lunch Box as a soup kitchen. Bev reveals more than she intended during the Thanksgiving feast.\n\n209 11 \"Mothers and Other Strangers\" Gary Halvorson Roseanne and Cynthia Mort December 3, 1996 ( ) 1011 15.4[ citation needed ]\n\nDan still is not home, and Roseanne worries about how he will react to all the changes she has made to the house. Elsewhere, Bev seeks answers from her free-spirited mother, Mary, who finally mends her relationship with her daughter.\n\n210 12 \"Home for the Holidays\" Mark K. Samuels Story by : Roseanne\n\nTeleplay by : Lawrence Broch December 17, 1996 ( ) 1012 N/A\n\nDan returns home, but he treats Roseanne coolly. Jackie overhears him having an intimate conversation on the phone with his mother's nurse.\n\n211 13 \"Say It Ain't So\" Mark K. Samuels Nancy Steen January 7, 1997 ( ) 1013 18.1[ citation needed ]\n\nRoseanne kicks out Dan over his affair with his mother's nurse, though her decision devastates her.\n\n212 14 \"Hit the Road, Jack\" Mark K. Samuels Roseanne January 14, 1997 ( ) 1014 18.8[ citation needed ]\n\nA depressed Roseanne avoids Dan and drives around town eating fast food and listening to radio shows. She believes Dan had an affair because of her appearance. As Dan packs his bags to leave, he and D.J. have a huge fight. An angry D.J. goes to a video store and meets his soul mate, Heather (Heather Matarazzo). Dan is about to head back to California, but cancels his flight and moves into a motel.\n\n213 15 \"The War Room\" Mark K. Samuels Bob Nickman January 28, 1997 ( ) 1015 16.3[ citation needed ]\n\nA depressed Roseanne locks herself and Jerry in her bedroom, drowning her sorrow with fattening foods, trashy magazines, and TV. Friends and family attempt to get her out, but they ultimately fail until Mark tells her that Dan has not left town and wants her back.\n\n214 16 \"Lanford's Elite\" Gary Halvorson Story by : Allan Stephan Blasband\n\nTeleplay by : Richard Whitley and Bob Rubin February 11, 1997 ( ) 1016 13.5[ citation needed ]\n\nRoseanne and Jackie attend an exquisite luncheon where they discuss politics and other topics with Lanford's elite. Roseanne meets Edgar Wellman (James Brolin), son of the owner of Roseanne and Jackie's former workplace, and Edgar asks Roseanne for money to help keep Wellman Plastics open--it fell into decline after the sisters left in 1989.\n\n215 17 \"Some Enchanted Merger\" Gary Halvorson April Winchell February 11, 1997 ( ) 1017 13.5[ citation needed ]\n\nJackie believes that Roseanne and Edgar Wellman are an item for real--they are not, although Roseanne wishes they were. Roseanne claims their relationship is only about business; Jackie does not believe her. Roseanne dreams that the couple are from the movie Evita.\n\n216 18 \"A Second Chance\" Mark K. Samuels Cynthia Mort February 18, 1997 ( ) 1018 16.3[ citation needed ]\n\nReluctant to leave, Dan asks Jackie about Edgar Wellman's relationship with Roseanne. Jackie confirms it, but Roseanne returns to Dan. As they reconcile, they receive a call from Jackie: Darlene is in labor and has been given a drug to stop her from delivering a premature baby.\n\n217 19 \"The Miracle\" Gary Halvorson Story by : Roseanne\n\nTeleplay by : Drew Ogier February 25, 1997 ( ) 1019 16.2[ citation needed ]\n\nDarlene gives birth to a dangerously premature baby girl, Harris Conner Healy. Roseanne consults other doctors from around the world, but what ultimately keeps the baby alive is Roseanne's own grandmotherly love and nurturing.\n\n218 20 \"Roseanne-Feld\" Mark K. Samuels April Winchell and Richard Whitley March 4, 1997 ( ) 1020 N/A\n\nJackie and Mark attend a wrestling match, where Jackie ends up fighting the Black Widow (Dot Jones). D.J.'s first sexual experience looms and he consults Mark, who is not too helpful.\n\n219 21 \"The Truth Be Told\" Mark K. Samuels Lawrence Broch and April Winchell March 18, 1997 ( ) 1021 12.9[ citation needed ]\n\nRoseanne and Jackie learn that producers want to make a TV-movie about the Conners, but also find out that they want to make distressingly drastic changes: gorgeous actors to play the Conners, fewer blue-collar plot twists, etc. Meanwhile, Bev, Leon, and Joyce naively reveal all kinds of information about Roseanne's life and past to a tabloid reporter.\n\n220 22 \"Arsenic and Old Mom\" Mark K. Samuels Carrie Fisher May 13, 1997 ( ) 1022 14.7[ citation needed ]\n\nDan's mother Audrey (now played by Debbie Reynolds, before played by Ann Wedgeworth in the 1989 Thanksgiving episode), visits unexpectedly and keeps trying to kill her son for putting her away for so many years. Roseanne finally decides to end it all with a simple backyard battle.\n\n221 222 23 24 \"Into That Good Night\" Gary Halvorson Story by : Roseanne\n\nTeleplay by : Jessica Pentland & Jennifer Pentland Roseanne and Allan Stephan Blasband May 20, 1997 ( ) 1023 1024 16.6[ citation needed ]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/images/wikimedia-button.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_Roseanne_episodes", "title": "List of Roseanne episodes", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}