{"url": "https://www.hollywoodreporter.com/news/writer-jenny-lumet-russell-simmons-sexually-violated-me-guest-column-1062934", "text": "The screenwriter of 'Rachel Getting Married' and 'The Mummy' (and the daughter of filmmaker Sidney Lumet) details a terrifying encounter with the legendary music producer, who says he is stepping down from his businesses in the wake of the new claims.\n\nRussell Simmons, a prolific music and TV producer and co-founder of Def Jam Recordings, was accused of sexual assault and harassment by model Keri Claussen Khalighi in a Nov. 19 article in the Los Angeles Times. Simmons then denied the incident in a letter published Nov. 22 by The Hollywood Reporter. The letter prompted Jenny Lumet — an award-winning screenwriter (Rachel Getting Married, The Mummy), the daughter of filmmaker Sidney Lumet, and granddaughter of singer/activist Lena Horne — to pen a response detailing her own experience with Simmons.\n\nOn Nov. 22, 2017, Russell Simmons wrote:\n\n\"I have never committed any acts of aggression or violence in my life. I would never knowingly cause fear or harm to anyone.\"\n\nDear Russell:\n\nI met you around 1987, through Rick Rubin, who has always been kind to me. Rick knew my sister through NYU and asked me, at the upstairs bar in a nightclub called the Palladium, to be in a movie you were producing that Rick was directing, starring RUN DMC. It was, frankly, a lousy movie, and I was terrible in it.\n\nOver the next three or four years, I would see you out and about, at a nightclub called Nell's mostly. I don't recall you and I ever just going out to dinner, or having a one-to-one experience; we were always in groups, and we had many, many mutual friends. You were charming and funny and charismatic and self-deprecating. Not being in the music business made it possible for me to relax around you. And you were a fan of my grandmother, respected her, and told me so. You seemed sincere.\n\nYou pursued me, lightly, on and off, over a course of years, saying you had a thing for a \"little yellow girl\" (me). I rebuffed. It wasn't deep, as far as I knew. It was never a big deal. You had, I assumed, many women in your orbit.\n\nOnce you sent me 250 balloons with the note \"Please baby, please baby, baby, baby, baby\" after a character in a Spike Lee movie. It was light, fun and flattering. We continued to socialize in the same places. We continued to have a large group of mutual friends.\n\nOne night circa 1991, when I was around 24, I was at a restaurant called Indochine. I had worked there when I was 17, as the coat check girl, and I enjoyed returning. I still knew some of the staff at this point and felt quite comfortable there. I remember I was wearing one of the Azzedine Alaia tops that were everywhere that year. And hoop earrings. I think it was cool enough for a jacket. Because I remember being glad I had a jacket by the end of that night.\n\nYou had a car and a driver that evening. Sometime later, you offered me a ride to my home. I said, \"Sure.\" During the making of the RUN DMC movie, I had been in vans with you and other crew members. I don't recall having accepted a ride home alone with you before that night.\n\nAt no time that night did I say: \"Russell, I will go home with you.\" Or \"Come home with me.\" Or \"I will have sex with you.\" Or \"I have the desire to have sex with you.\"\n\nI believe it was an SUV, because I recall having to step up into the car. I don't know about makes or models. I think the driver was already in the car.\n\nI got into the car with you. The driver began to drive. I assumed you knew where I lived, because you had sent me 250 balloons, but I gave the driver my address on 19th Street and 2nd Avenue.\n\nYou said to the driver: \"No.\"\n\nI didn't understand, so I said: \"Russell?\"\n\nI said, again, to the driver: \"19th Street.\"\n\nAgain you said to the driver: \"No.\"\n\nThen the car doors locked. It was loud. The noise made me jump.\n\nI didn't recognize you at that moment. It was disorienting. It was disorienting. I say it twice now because you said \"No\" twice then.\n\nI couldn't open the doors. I couldn't open the windows. The car was moving. The driver did not stop. He did not take me to 19th Street. He took me to your apartment.\n\nI didn't try to kick the windows out. I didn't punch or kick. I didn't say, \"What are you doing?\" My voice left me after the second \"No.\"\n\nI felt dread and disorientation. I wanted to go home. I said I wanted to go home. I didn't recognize the man next to me. I didn't know if the situation would turn violent. I remember thinking that I must be crazy. I remember hoping that the Russell I knew would return any moment.\n\nThe car stopped at the curb. I don't recall the street. I recall the driver opening the door from the outside, and you behind me. I was between the two of you. Not wedged, just in the space between you. I remember exchanging a look with the driver. He was unreadable. It was chilly out. It was me and these two men.\n\nI felt dread. I was tremulous. Off my feet. I felt an intense need to keep both of you calm. Was there a time or a space to run? I have no idea. Would somebody else have run? I have no idea. There were two men. One of whom obeyed the other. It was an overwhelming feeling.\n\nThere was no well-lit lobby or doorman at the entrance we used. I would guess it was not the main entrance to the building. I believe there was a door from street level that opened into a space beneath the residential area of the building, in which there was a small back elevator. If I am wrong about the layout, then I am wrong. There were two men, and I was afraid.\n\nYou didn't punch me, drag me or verbally threaten me. You used your size to maneuver me, quickly, into the elevator. I said, \"Wait. Wait.\" I felt dread. I was very, very sad. I didn't know if the driver was a further threat, or an ally. I was both relieved and terrified when he did not get into the elevator. Alone in the elevator, you pressed me into the corner with your body, your hands and your mouth.\n\nThe elevator did not stop on the way up to your apartment. I was moved very quickly inside. I recall hearing the apartment door closing behind us.\n\nI saw no one else. I recall you were behind me. I was still hoping the Russell I knew would reappear, as I could not recognize the man moving me deeper into the apartment — the man who had said \"No\" to his driver. Twice.\n\nYou moved me into a bedroom. I said, \"Wait.\" You said nothing.\n\nI made the trade in my mind. I thought, \"Just keep him calm, and you'll get home.\" Maybe another person would have thought differently, or not made the trade.\n\nIt was dark but not pitch-dark. You closed the door.\n\nAt that point, I simply did what I was told.\n\nThere was penetration. At one point you were only semi-erect and appeared frustrated. Angry? I remember being afraid that you would deem that my fault and become violent. I did not know if you were angry, but I was afraid that you were.\n\nI desperately wanted to keep the situation from escalating. I wanted you to feel that I was not going to be difficult. I wanted to stay as contained as I could.\n\nYou told me to turn over on my stomach. You said something about a part of my body. You did not ejaculate inside me.\n\nWhen it was over, I got my clothes and quickly went down in the elevator by myself. You didn't try to stop me. I went home in a taxi. I was grateful to be secure in my home. I never told anyone this story until October 27 of this year (after the Harvey Weinstein story was in the news but weeks before the first public claims were made against you), when I told a girlfriend from childhood.\n\n\"Abusing women in any way, shape or form violates the very core of my being.\" — Russell Simmons\n\nWe encountered each other socially many times after that night. We had a score of mutual friends. We may have been photographed proximately, or together. The dynamic between us was different, muted. I never sought you out, nor did I run from a place or event upon seeing you. I feel confident in saying we nodded at each other, said hello. I strove for an affect of normalcy. And I never said anything to you about that night. You have never said anything to me.\n\nSpecifically, we saw each other at the Vanity Fair Party after the Academy Awards in 2005, the year my father won the Lifetime Achievement Award. I saw you again at the NAACP Image Awards, briefly, in 2009. I believe you were there with your daughters. We both accepted awards that night. I encountered you at a party in Los Angeles before the 2011 Academy Awards, during which there was a planned tribute to my grandmother, who had just passed away. These were events that were supposed to be happy, and they were tainted.\n\nI don't recall ever meeting any of the women who have spoken out against you, Russell. But I can't leave those women twisting in the wind. Maybe the recalling of this incident can be helpful. I don't know if it can.\n\nI have built a life in the past 25 years and a reputation in my industry. I need no one to have this visualization of me. I will, like the others, lose work because of this. I realize how privileged I am to be able to risk that. I have children. I'm aware that every mistake, act of thoughtlessness, hypocrisy or cruelty I've committed in my 50 years will be excavated, and they'll see all of it.\n\nThere is so much guilt, and so much shame. There is an excruciating internal reckoning. As a woman of color, I cannot express how wrenching it is to write this about a successful man of color. Again, shame about who I was years ago, choices made years ago. In this very moment, I feel a pang to protect your daughters. I don't think you are inclined to protect mine.\n\nIn response to this article, Simmons responded that he is stepping down from his various businesses to \"commit myself to continuing my personal growth, spiritual learning and above all to listening.\" His full statement is below.\n\nI have been informed with great anguish of Jenny Lumet's recollection about our night together in 1991. I know Jenny and her family and have seen her several times over the years since the evening she described. While her memory of that evening is very different from mine, it is now clear to me that her feelings of fear and intimidation are real. While I have never been violent, I have been thoughtless and insensitive in some of my relationships over many decades, and I sincerely apologize.\n\nThis is a time of great transition. The voices of the voiceless, those who have been hurt or shamed, deserve and need to be heard. As the corridors of power inevitably make way for a new generation, I don't want to be a distraction, so I am removing myself from the businesses that I founded. The companies will now be run by a new and diverse generation of extraordinary executives who are moving the culture and consciousness forward. I will convert the studio for yogic science into a not-for-profit center of learning and healing. As for me, I will step aside and commit myself to continuing my personal growth, spiritual learning and above all to listening.", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/landscape_928x523/2017/11/russell_simmons_and_jenny_lumet_-_inset_-_getty_-_h_2017.jpg", "https://cdn1.thr.com/sites/default/files/2017/11/russell_simmons_and_jenny_lumet_-_inset_-_getty_-_h_2017.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/11/russell_simmons_and_jenny_lumet_-_inset_-_getty_-_h_2017.jpg", "keywords": [], "authors": ["Jenny Lumet", "Thrnews Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/news/writer-jenny-lumet-russell-simmons-sexually-violated-me-guest-column-1062934", "title": "Writer Jenny Lumet: Russell Simmons Sexually Violated Me (Guest Column)", "meta_data": {"viewport": "width=device-width", "description": "The screenwriter of 'Rachel Getting Married' and 'The Mummy' (and the daughter of filmmaker Sidney Lumet) details a terrifying encounter with the legendary music producer, who says he is stepping down from his businesses in the wake of the new claims.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/news/writer-jenny-lumet-russell-simmons-sexually-violated-me-guest-column-1062934", "domain": "https://www.hollywoodreporter.com/", "title": "Writer Jenny Lumet: Russell Simmons Sexually Violated Me (Guest Column)", "description": "The screenwriter of 'Rachel Getting Married' and 'The Mummy' (and the daughter of filmmaker Sidney Lumet) details a terrifying encounter with the legendary music producer, who says he is stepping down from his businesses in the wake of the new claims.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/11/russell_simmons_and_jenny_lumet_-_inset_-_getty_-_h_2017.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Writer Jenny Lumet: Russell Simmons Sexually Violated Me (Guest Column)", "description": "The screenwriter of 'Rachel Getting Married' and 'The Mummy' (and the daughter of filmmaker Sidney Lumet) details a terrifying encounter with the legendary music producer, who says he is stepping down from his businesses in the wake of the new claims.", "url": "https://www.hollywoodreporter.com/news/writer-jenny-lumet-russell-simmons-sexually-violated-me-guest-column-1062934", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/11/russell_simmons_and_jenny_lumet_-_inset_-_getty_-_h_2017.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Writer Jenny Lumet: Russell Simmons Sexually Violated Me (Guest Column)", "sailthru.description": "The screenwriter of 'Rachel Getting Married' and 'The Mummy' (and the daughter of filmmaker Sidney Lumet) details a terrifying encounter with the legendary music producer, who says he is stepping down from his businesses in the wake of the new claims.", "sailthru.author": "Jenny Lumet", "sailthru.vertical": "Culture", "sailthru.date": "2017-11-30 06:30:00", "sailthru.tags": "Music,Culture,Russell Simmons,nsfs"}, "movies": [], "publish_date": 1511994600.0, "source": "https://www.hollywoodreporter.com", "summary": ""}