{"url": "tasteofcountry.com/miranda-lambert-anderson-east-relationship-timeline/", "text": "Miranda Lambert and Anderson East were pretty adorable during their two-year-long relationship. If PDA nauseates you, rumors of a breakup are the antacid you need. But if you love love? The dozens of photos, videos, onstage moments and ugga muggas they shared are a reminder of what it can be like to catch lightning in a bottle.\n\nThis timeline of Lambert and East's romance starts with a broken heart and might end with one, too, if you believe everything you read at the grocery store. The pile of sources confirming their breakup grows taller and taller, but neither singer has spoken up (they have stopped following each other on Instagram, and though Lambert still follows East on Twitter, he does not reciprocate). Quietly they loved on, until they didn't.\n\nJuly 20, 2015 — Shock and heartbreak. Lambert and husband Blake Shelton get divorced, ending country music's highest-profile marriage after just four years.\n\nSept. 12, 2015 — Exactly when Lambert started dating East wasn't clear until she shared this photo two years into the relationship, celebrating Sept. 12 as an anniversary. That's 54 days after her divorce from Shelton. She references the song \"Pushin' Time,\" a song she would later confirm she wrote about East.\n\nDuring a taping for PBS' Front and Center Lambert would later reveal that the song was actually inspired by an early argument. \"It was all lovey-dovey and then we got in a fight, ’cause that’s how it goes,\" she says. \"And I was pissed, ’cause that’s also how it goes. He tried to smooth it over with me. I said, ‘Are you going to break up with me?’ He said, ‘I think I’ll wait 60 years.’ So, sweet.\"\n\nJan. 1, 2016 — After weeks of speculation, the couple go public with a New Year's Day photo of them cuddling together on a couch and the caption: \"The snuggle is real.\"\n\nFeb. 14, 2016 — During their two years together (and some change), one half of this couple would often storm the other's stage to sing a song or two. This Valentine's Day performance of \"Always Be My Baby\" (yes, the Mariah Carey hit) is the first documented time it happened. A Taste of Country News video also recalls how deep in it the country singer was. She wore a University of Alabama hat for him, which is saying something for a Texas girl!\n\nApril 2, 2016 — At the ACM Awards Lambert and East walk the red carpet for the very first time together. Her dress remains our favorite of her many glam looks. As for East, he'd only get one more shot on awards show carpet. In total, they hit six red carpets together.\n\nJuly 17, 2016 — Lambert shares a photo of the couple kissing on Instagram with a caption that reads, \"Happy Birthday to my favorite 'Bama' boy!\" Photos of the two together were not rare by this point. East would also regularly Insta-flirt with his girlfriend of 10 months.\n\nOct. 31-Nov. 1, 2016 — The couple walk the BMI Awards and CMA Awards red carpet together and looked great. \"I was the big winner last night,\" East would later say on Instagram.\n\nA few days later, Lambert responded to trolls who criticized her appearance with a sharply-worded post on Instagram that quoted Maya Angelou: \"Cowardly people hiding behind a keyboard or a cell phone writing their useless comments about our eyes and clothes and body language. What a bunch of bull s--t.\"\n\nMarch 12, 2017 — Still dueting, still happy! East joins Lambert onstage during a Highway Vagabond Tour stop in Bossier, City, La., singing the Faces' \"Stay With Me.\" The song is unabashedly sexual, and Lambert and East definitely play on that in their performance, turning in a flirtatious, touchy-feely performance that lets their real-life chemistry shine through.\n\nApril 1, 2017 — After the ACM Awards in Las Vegas, the pair share Instagram messages in reference to Lambert's Female Vocalist of the Year win. \"Couldn't be more proud of this little lady and the amazing art she brings with her,\" East says on Instagram. Lambert follows with this:\n\nJuly 16, 2017 — One day before East's 30th birthday, Lambert grabs his microphone in New York and delivers a slow, sultry version of \"Happy Birthday.\" The crowd joins in, and it's magical:\n\nJune 6-7, 2017 — Lambert and East make two appearances together at the 2017 CMA Music Festival, including her MuttNation March and the CMT Awards. Lambert then flies solo to the 2017 Taste of Country Music Festival.\n\nPublic appearances together slow after this. In fact, we found only one more.\n\nNov. 8, 2017 — At the 2017 CMAs, Lambert sparkles like a princess next to East in his usual black and white ensemble. The walk united and speak united after Garth Brooks lip syncs during his performance. First East blasted the Entertainer of the Year on Instagram, and she responded in the comments:\n\nInstagram\n\nJanuary 12, 2018 — Lambert shares what seems to be the last public photo of the couple together, though she continues to like his photos on social media through February 18. They no longer follow each other on Instagram.\n\nMarch 3, 2018 — Tabloids started reporting a breakup in February, but it was Lambert's comments during a March show in Knoxville, Tenn., that truly stir the pot.\n\n\"I want you to feel sad, mad, happy and nostalgic and really pissed sometimes,\" she said, according to the Knoxville News Sentinel. \"That's my favorite. And part of feelings is also heartbreak unfortunately, but fortunately for me, I can use it for my art or whatever. I like to write sad songs. I like to listen to sad songs, so I want to sing y'all one.\"\n\nLambert's representatives did not respond to Taste of Country's request for comment at the time, and East's rep refused to talk about his personal life. Credit Us Weekly with reigniting the breakup rumors in April, citing \"many sources.\" There is no new information.", "images": ["https://townsquare.media/site/204/files/2018/04/Anderson-Miranda-Kissing.jpg?w=600&h=0&zc=1&s=0&a=t&q=89", "http://townsquare.media/site/204/files/2018/04/toc-logo-high-rez.png", "https://sb.scorecardresearch.com/p?c1=2&c2=6665296&cv=2.0&cj=1"], "top_img": "https://townsquare.media/site/204/files/2018/04/Anderson-Miranda-Kissing.jpg?w=600&h=0&zc=1&s=0&a=t&q=89", "keywords": [], "authors": ["Billy Dukes"], "canonical_link": "https://tasteofcountry.com/miranda-lambert-anderson-east-relationship-timeline/", "title": "Miranda Lambert, Anderson East: A Timeline of Love and Heartbreak", "meta_data": {"instagram_profile": "tasteofcountry", "description": "This timeline of Miranda Lambert and Anderson East's romance starts with a broken heart and might end with one, too.", "keywords": "miranda lambert, anderson east, miranda lambert breakup, anderson east breakup, did miranda and anderson breakup, miranda lambert anderson east photos, pictures of miranda lambert with anderson east, miranda lambert divorce, when did miranda lambert anderson east start dating,", "fb": {"app_id": 193351250697247, "admins": 8802808, "pages": 173910492638623}, "og": {"title": "Miranda Lambert, Anderson East: A Timeline of Love and Heartbreak", "description": "This timeline of Miranda Lambert and Anderson East's romance starts with a broken heart and might end with one, too.", "url": "https://tasteofcountry.com/miranda-lambert-anderson-east-relationship-timeline/", "site_name": "Taste of Country", "type": "article", "image": "https://townsquare.media/site/204/files/2018/04/Anderson-Miranda-Kissing.jpg?w=600&h=0&zc=1&s=0&a=t&q=89"}, "twitter": {"card": "summary_large_image", "site": "@tasteofcountry"}, "sailthru.description": "This timeline of Miranda Lambert and Anderson East's romance starts with a broken heart and might end with one, too.", "sailthru.date": "2018-04-09 15:29:00", "sailthru.title": "Miranda Lambert + Anderson East: A Timeline of Love and Heartbreak", "sailthru.tags": "tsmsite-tasteofcountry, tsmmarket-national, tsmtype-national, anderson-east, miranda-lambert, country-music-news, original-features", "sailthru.author": "billydukesgmail-com", "sailthru.image.full": "https://townsquare.media/site/204/files/2018/04/Anderson-Miranda-Kissing.jpg", "sailthru.image.thumb": "https://townsquare.media/site/204/files/2018/04/Anderson-Miranda-Kissing.jpg", "msvalidate.01": "38FB0DB5D97FA0CEE1853CB708082BF1", "google-site-verification": "e19BTQtucrkVk-O5axdlPIIJWMrqGU-QRWcldJZvxnA", "viewport": "width=1286, initial-scale=1.0"}, "movies": [], "publish_date": 1523258940.0, "source": "http://tasteofcountry.com", "summary": ""}