{"url": "https://discussion.femalefirst.co.uk/viewtopic.php?t=752808", "text": "Postby Guest » Wed Jul 11, 2018 6:26 am\n\nShould Brad Pitt be interested in entering the dating game in earnest, he knows who to call.\n\n\n\nA chance meeting in an elevator weeks before this year's Academy Awards, led to the strangest of pacts with Hollywood's latest darling, Tiffany Haddish. \"He said in one year if he's single and I'm single we gonna do it,\" she revealed to Kelly Ripa in a backstage interview at the show, \"so you know what that means.\"\n\n\n\nAsked why the need to put off their first date for some 12 months, Haddish was admittedly in the dark. \"I don't know,\" she said, \"he told me to wait a year.\"\n\n\n\nWell, if anyone knows the supremely awesome power of time, it's Pitt. Not even two years ago today, the movie star's sterling reputation seemed irreparably tarnished. His wife, Angelina Jolie, the woman he'd famously moved on with in the wake of his last shocking split from Jennifer Aniston, had dropped a surprise divorce filing and request for full custody of their six kids—and all signs pointed at Pitt being to blame.\n\n\n\nAs fans scrambled to figure out what could have caused the end of Brangelina, once thought to be the most unshakeable of power couples, reports emerged accusing the actor of everything from substance abuse to an affair with Allied costar Marion Cotillard (a claim they both firmly denied). And then there were the whispers of what happened on the plane—the altercation between Pitt and then 15-year-old Maddox Jolie-Pitt that landed the Oscar winner under investigation by both the FBI and the Los Angeles Country Department of Children and Family Services.\n\n\n\nFacing the biggest scandal in his storied three-decade career, the 54-year-old turned inward, relying on therapy, a newfound sobriety and plenty of solitude to \"strip down to the foundation and break out the mortar,\" as he put it in a surprisingly candid interview with GQ Style. Some 22 months later he's a new man with a still red hot career. And while his custody situation with Jolie is still very much in flux with no official divorce in sight, he feels confident they'll reach a détente. \"They had a pretty dramatic year,\" an insider tells E! News, \"and he wants things to remain calm in the future.\"\n\n\n\nThat's a wish that at times seemed impossibly lofty. Even after Pitt was was cleared by the FBI and the Department of Children and Family Services in November 2016, reaching a temporary agreement with Jolie that granted him \"therapeutic visitation,\" it seemed their separation was destined to become one of the most contentious of all times.\n\n\n\nJust days into 2017, Jolie claimed in court documents that her ex was \"terrified the public will learn the truth\", a shot fired after the actor's lawyers requested to seal the records in their custody hearing. \"There is little doubt that [Pitt] would prefer to keep the entire case private, particularly given the detailed investigations by the Federal Bureau of Investigation and the Dept. of Children and Family Services into allegation of abuse,\" her lawyer stated in the filing. Jolie's most obviously hostile comment to date, it seemed the kind likely to set off a new avalanche of negative reports.\n\n\n\n\n\n\n\nInstead it became the first step in the pair's still-unending journey to a custody agreement. Jolie settled into a $25 million Hollywood mansion, a little more than a mile from their old family house where Pitt still lived, and, as their public drama subsided, the World War Z star began having more frequent interactions with the kids.\n\n\n\nCustody negotiations over Pax, 14, Zahara, 13, Shiloh, 12, and 10-year-old twins Vivienne and Knox (at 16, Maddox is deemed old enough to decide which parents he prefers to spend his time with) hit a snag this spring when Jolie wanted to take the kids to Europe for the duration of her Maleficent 2 shoot in London. Originally, a source told Us Weekly, the plan was for the brood to spend just two weeks in England, then return home to L.A. Pitt, had even thoughtfully chosen his next project—Quentin Tarantino's Once Upon a Time in Hollywood about the 1969 Manson family murders—because filming would be contained to California.\n\n\n\nWhen Jolie tried to pull a switch, a source told E! News, Pitt made a move to block her: \"Brad will be filming in L.A. for the summer and wants to see the kids on his regular custody schedule.\"\n\n\n\nWhile he was more than fine with Jolie traveling with the kids for short trips—she took Shiloh and Zahara to visit a refugee camp in Jordan in January and brought the entire brood to Paris that same month—\"He's not OK with his kids being away for months,\" says the source. \"He feels that Los Angeles is their home base and this is where it is best for them to be.\"\n\n\n\nHis argument won over the judge. With what we can only assume was a protracted negotiation, Pitt and Jolie carefully constructed a detailed plan for the summer that involved Pitt slowly increasing his time with the brood from four hours per day up to 10—culminating in eight straight days with the kids at the end of July.\n\n\n\n\"They worked out an agreement that was mutually acceptable,\" an insider tells E! News, adding Pitt \"felt like he actually had a say and that the court was seeing his side of things.\"\n\n\n\nThough the schedule requires the kids to travel back and forth, notes the insider, Pitt, who spent Father's Day in London with his expansive brood, is stoked to score so much face time.\n\n\n\n\"He is thrilled that the summer schedule for the kids is figured out and that he will be seeing them regularly,\" an insider tells E! News. \"He feels this is a huge victory. It's a big step and he hopes to continue getting back on track with each of the kids.\"\n\n\n\nHe knows a large part of that is on him. As he fought to earn time with his kids, Pitt also set upon a self-improvement crash course designed to transform him into the type of dad he wanted to be. \"I grew up with a Father-knows-best/war mentality—the father is all-powerful, super strong—instead of really knowing the man and his own self-doubt and struggles,\" he offered by way of explanation to GQ Style. \"And it's hit me smack in the face with our divorce: I gotta be more. I gotta be more for them. I have to show them. And I haven't been great at it.\"\n\n\n\nSave from a Golden Globe appearance that proved the bulk of Hollywood was still in his corner, the actor dipped underground for several months, committing himself to a life of cranberry juice and fizzy water—\"I was boozing too much. It's just become a problem,\" he said of what he called his ability to drink a Russian under the table with his own vodka—and therapy.\n\n\n\n\"For me this period has really been about looking at my weaknesses and failures and owning my side of the street,\" he noted in the 2017 profile. \"I'm an a--hole when it comes to this need for justice. I don't know where it comes from, this hollow quest for justice for some perceived slight. I can drill on that for days and years. It's done me no good whatsoever. It's such a silly idea, the idea that the world is fair. And this is coming from a guy who hit the lottery, I'm well aware of that. I hit the lottery, and I still would waste my time on those hollow pursuits.\"\n\n\n\n\n\n\n\nAnd while there's no denying the process of analyzing his flaws was painful, \"For me every misstep has been a step toward epiphany, understanding, some kind of joy,\" he told the mag. \"Yeah, the avoidance of pain is a real mistake. It's the real missing out on life. It's those very things that shape us, those very things that offer growth, that make the world a better place, oddly enough, ironically. That make us better.\"\n\n\n\nBy the time The Lost City of Z producer emerged—at the April 2017 premiere of the adventure drama—he'd constructed a whole new existence for himself, one that revolved around choosing projects to shepherd (his sci-fi thriller Ad Astra comes out in January and he has producer credits on a slew of upcoming films, including Beautiful Boy and Backseat) and making art in British sculptor Thomas Houseago's studio.\n\n\n\n\"I think it was Picasso who talked about the moment of looking at the subject, and paint hitting canvas, and that is where art happens,\" he detailed. \"For me I'm having a moment of getting to feel emotion at my fingertips. But to get that emotion to clay—I just haven't cracked the surface. And I don't know what's coming. Right now I know the manual labor is good for me, getting to know the expansiveness and limitations of the materials. I've got to start from the bottom, I've got to sweep my floor, I've got to wrap up my s--t at night, you know?\"\n\n\n\nThe final stage of his renovation would involve constructing a new relationship. Though that's not a top priority for the heartthrob who romanced Gwyneth Paltrow, Juliette Lewis and Christina Applegate before his first marriage to Aniston.\n\n\n\n\"He has been on a few dates,\" a source told E! News. (Page Six reported the Missouri native has been charming women by humbly introducing himself as William, his given first name.) But while the source notes Pitt is \"flirty by nature,\" often holding the door for women or allowing them to cut in line, he hasn't keyed in on anyone serious as of late.\n\n\n\nThat includes his rumored paramour, MIT professor Neri Oxman. Having visited one of her classes last fall, Pitt found the attractive architect with a PhD in design computation to be brilliant, a source tells E! News, and was left intrigued. His passion for housing well-documented, says the source, \"He's interested in getting to know her more and learning from her. But they're strictly friends.\"\n\n\n\nSuch pals have proven crucial for Pitt as he found his way back to relative normalcy. When not working—he's currently filming Once Upon a Time in Hollywood with Leonardo DiCaprio—or logging precious hours with his children, Pitt maintains \"an active social life,\" an insider tells E! News. \"He goes out to dinner a lot and enjoys being out and doing different things.\"\n\n\n\nAfter all, he spent more than enough time in solitude.\n\n\n\n\"Brad spent a lot of time alone and in private looking at himself and reevaluating what was most important and who he wanted to be,\" says the insider. \"Now he's in a place where he's implemented those changes and has a lot more clarity. He's come out of that dark time and is in a much better place.\"", "images": ["https://www.femalefirst.co.uk/image-library/partners/bang/square/250/k/knife-322808f87044c4eed4d3f820b0d9d516785eb2db.jpg", "https://discussion.femalefirst.co.uk/images/smilies/icon_rolleyes.gif", "https://www.femalefirst.co.uk/image-library/square/250/i/image001-7.jpg", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/b/baby-in-blanket-d9f538e519d4a1a6b0ea54a26a9a8316f1843d15.jpg", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/l/lightning-7027059984b9945d9a0fb63a76cf3a332c79bc2f.jpg", "https://www.femalefirst.co.uk/assets/gfx/ff/logos/femalefirst.png", "https://discussion.femalefirst.co.uk/images/smilies/icon_twisted.gif", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/t/tiger-5117e3f2cb071e456e3d5fc7d5872570741e2150.jpg", "https://discussion.femalefirst.co.uk/images/smilies/eusa_clap.gif", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/s/seagulls-32b6c85d8065e4adbb2d87a1bbb9e9a15dc0ab54.jpg", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/j/james-gandolfini-as-mafia-boss-tony-soprano-4448d33c9c8e614f.jpg", "https://a.collective-media.net/seg/etu/1b", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/f/fighter-jet-081b86e576474c00b187601078a4027476a9c19c.jpg", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/z/zebra-6a816e66761bf274817e7d770bc3c715fc9e5cf3.jpg", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/c/cat-breaks-into-couples-home-ef4a392f7387557515cfffa911a82ff.jpg"], "top_img": "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/k/knife-322808f87044c4eed4d3f820b0d9d516785eb2db.jpg", "keywords": [], "authors": [], "canonical_link": "https://discussion.femalefirst.co.uk/viewtopic.php?t=752808", "title": "Female First Forum", "meta_data": {"viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": null, "source": "https://discussion.femalefirst.co.uk", "summary": ""}