{"url": "http://time.com/5328337/prince-louis-christening-dress/", "text": "Here's Everything You Need to Know About the Fascinating History of Royal Babies' Christening Dresses\n\nRoyal baby Archie had his christening on Saturday, July 6, and he wore a christening gown with a fascinating history.\n\nThe first son of Meghan, Duchess of Cambridge and Harry, Duke of Cambridge celebrated his christening in an elaborate white gown. Archie, who was born on May 6, was baptized into the Church of England in the traditional christening ceremony in the Private Chapel at Windsor Castle.\n\nArchie wore the same gown that his cousin, Prince Louis of Cambridge, wore last summer on July 9 for his christening at the Chapel Royal in St. James's Palace in London. Prince Louis' older siblings, Prince George of Cambridge and Princess Charlotte of Cambridge, also wore the article of clothing that carries the weight of history in their respective baptisms.\n\nHere's the story behind the christening gown royal baby Archie wore for his big day.\n\nWhat did Archie Harrison Mountbatten-Windsor wear to his christening?\n\nRoyal baby Archie wore the same gown in his christening as his cousins did, but i t's much more than just a casual hand-me-down: the gown, handcrafted in 2004 of lace and satin, is a replica of a historic garment that dates back to the Victorian era.\n\nThe Archbishop of Canterbury, Justin Welby, presided over Archie's christening on Saturday. The first two pictures from the event were shared later that day on the Sussex Royal Instagram page. \"The Duke and Duchess of Sussex are so happy to share the joy of this day with members of the public who have been incredibly supportive since the birth of their son,\" the caption said. \"They thank you for your kindness in welcoming their first born and celebrating this special moment.\"\n\nWhat’s the history behind the gown that was used since 1841?\n\nThe tradition of this particular christening gown harkens back to Queen Victoria, who commissioned the garment for the royal baptism of her daughter Victoria in 1841; you can glimpse one of its earliest representations in a painting of the event from the era. White gowns, or \"robes,\" were christening fashion going back to the 1700s, according to the archives at the Victoria and Albert Museum . The elaborate gown commissioned by Queen Victoria — made of \"a white Honiton point lace robe and mantle over white satin,\" as she is said to have described it in her personal diary — was ultimately worn for more than 60 baptisms by children in the ensuing decades, including Princess Victoria's little brother Edward, who would go on to become King Edward VII in 1901 . As the palace further explains , \"the original gown was subsequently worn for all Royal christenings, including The Queen, her children and her grandchildren.\"\n\nWith both fabrics sourced from U.K. locations, and a local seamstress chosen to craft the piece, Queen Victoria supported local industries through her fashion choice. Meanwhile the design, although reminiscent of a lady's flowing dress (and reportedly made to reflect Queen Victoria's own wedding gown ), was considered unisex and graced both male and female babies. It was carefully washed with spring water after use and stored in a dark room, the Telegraph reported , to keep it in its best condition. But ultimately time got the best of it.\n\nSo in 2004 one of Queen Elizabeth's aides was tasked with coming up with a replica to match the original, which required working with a team of expert craftspeople to recreate the garment, hewing as closely as possible to the now-traditional fabrics and design. The first baby to wear the new version was James, Viscount Severn, at his christening in 2008, the palace noted ; he is the youngest of the Queen's eight grandchildren.\n\n“It was made from scratch, from sketching it out, to embroidering the lace on a special silk-based tulle,” aide Angela Kelly told PEOPLE. On Monday just before the christening, the palace confirmed that the gown would be worn by Louis once more to continue the royal tradition.\n\nWhat did Prince Louis wear?\n\nIn 2018, Prince Louis was decked out in that same iconic christening gown.\n\nThe Duke and Duchess of Cambridge have released four official photographs to mark the christening of Prince Louis on Monday 9th July.\n\n\n\nThe photographs were taken by Matt Holyoak at Clarence House, following Prince Louis's christening. pic.twitter.com/v6mN6QDgrr - Kensington Palace (@KensingtonRoyal) July 15, 2018\n\nLike his brother George in 2013, Louis wore his wearing his finery to the Chapel Royal at St. James Palace; and like with George, Charlotte and Archie's ceremonies, the Archbishop of Canterbury Justin Welby performed the christening honors. (Charlotte's ceremony took place at St. Mary Magdalene Church, in Sandringham, instead.) Kate Middleton herself also received communion at the Chapel Royal just before her wedding to Prince William.\n\nWhat did Princess Charlotte wear?\n\nCatherine, Duchess of Cambridge and Princess Charlotte of Cambridge arrive at the Church of St Mary Magdalene on the Sandringham Estate for the Christening of Princess Charlotte on July 5, 2015. WPA Pool—Getty Images\n\nAt her christening on July 5, 2015 at the Church of St. Mary Magdalene on the Sandringham Estate in Norfolk, Princess Charlotte wore the very same christening gown. (This church has its own significance for the royal family: it was where Charlotte's late grandmother, Princess Diana, was herself baptized .) Also at her christening, Charlotte's five godparents were officially named, including some of her parents' nearest friends and relative.\n\nWhat did Prince George wear?\n\nThe Duke of Cambridge and his wife Catherine, Duchess of Cambridge, arrive with their son Prince George at Chapel Royal in St James's Palace in central London on October 23, 2013, ahead of the christening of the three month-old prince. AFP—AFP/Getty Images\n\nAt his christening on Oct. 23, 2013 at the Chapel Royal at St. James's Palace in London, Prince George was dressed up in the newly made replica of the classic Victorian christening gown. He was accompanied by his parents, of course. During the ceremony, his seven godparents were also named, including Prince William's cousin Zara Tindall and many of their closest friends.", "images": ["https://time.com/wp-content/uploads/2018/07/princess-charlotte-christening.jpg?w=560", "https://time.com/wp-content/uploads/2018/07/prince-george-christening.jpg?w=560", "https://api.time.com/wp-content/uploads/2020/04/AP20107844691161.jpg?h=52", "https://api.time.com/wp-content/uploads/2020/04/GettyImages-1209895131.jpg?h=52", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://api.time.com/wp-content/uploads/2020/04/AP20109136135111.jpg?h=52", "https://api.time.com/wp-content/uploads/2018/07/archie-christening-gown-dress.jpg?w=720"], "top_img": "https://api.time.com/wp-content/uploads/2018/07/archie-christening-gown-dress.jpg?w=720", "keywords": [], "authors": [], "canonical_link": "https://time.com/5328337/royal-baby-archie-christening-dress/", "title": "Royal Baby Christening Outfit: All the Details Explained", "meta_data": {"description": "Royal baby Archie wore the same christening gown as Prince George and his siblings did. Here’s the history behind the christening gown.", "keywords": "the christening pictures of prince louis, prince louis christening gown, prince louis Christening outfit, prince louis christening photos, prince louis christening gown, princess charlotte christening dress, princess charlotte christening gown, princess charlotte christening outfit, christening gown for prince louis", "news_keywords": "the christening pictures of prince louis, prince louis christening gown, prince louis Christening outfit, prince louis christening photos, prince louis christening gown, princess charlotte christening dress, princess charlotte christening gown, princess charlotte christening outfit, christening gown for prince louis", "og": {"site_name": "Time", "type": "article", "locale": "en_US", "url": "https://time.com/5328337/royal-baby-archie-christening-dress/", "title": "Here's the Deal With the Royal Baby's Christening Dress", "description": "All eyes on Archie this weekend", "image": "https://api.time.com/wp-content/uploads/2018/07/archie-christening-gown-dress.jpg?w=720"}, "author": "Raisa Bruner, Rachel E. Greenspan", "fb": {"app_id": 53177223193}, "twitter": {"site": "@TIME", "title": "Here's the Deal With the Royal Baby's Christening Dress", "description": "All eyes on Archie this weekend", "card": "summary_large_image"}, "article": {"author": "https://time.com/author/rachel-e-greenspan/"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}