{"url": "https://www.thecut.com/2018/05/meghan-markle-prince-harry-royal-wedding-reception.html", "text": "Meghan Markle and Prince Harry en route to their wedding reception. Photo: WPA Pool/Getty Images\n\nMeghan Markle and Prince Harry were (finally) married in a very royal wedding ceremony on Saturday, which was attended by 600 invited guests, a ton of members of the public, and, oh, just an estimated 1.9 billion people watching worldwide.\n\nAfterward, the newly married Duke and Duchess of Sussex celebrated their nuptials away from the cameras during a private lunch for the invited ceremony guests. Then, there was another private evening reception for 200 close friends and family, hosted by Prince Charles at Frogmore House on the Windsor estate. Thankfully for those of us who (for some reason) were not on the guest list, reports about what went down at the exclusive affairs have emerged.\n\nWhat Does It Take To Be A Duchess? Inside A Royal Etiquette Class\n\nDuring the lunch, Prince Harry reportedly gushed about Meghan in a speech.\n\nAfter the ceremony, guests of the fancy nuptials headed to a lunch reception. There, Prince Harry reported gave an emotional speech, during which he professed his love and admiration for his new wife. According to the Sun, Prince Harry told Meghan (and the room) that they make “great team.” He added that she “navigated everything with such grace,” and then said, “I can’t wait to spend the rest of my life with you.” Oh, we know.\n\nThe couple after the wedding ceremony. Photo: Leon Neal/Getty Images\n\nPrince Charles also gave a nice speech.\n\nPrince Charles, who escorted his new daughter-in-law part of the way down the aisle on Saturday, also reportedly gave a nice speech at the afternoon reception. The Mirror notes that Prince Charles spoke of the man his “darling old Harry” had grown into, but he also cracked a joke about changing Prince Harry’s diapers as a kid. One guest told the Daily Mail, “Prince Charles made a really gracious speech, it was amazingly endearing. He’s got a wonderfully dry sense of humor.”\n\nGuests got to swap their heels for slippers.\n\nPretty Little Liars star Troian Bellisario, who is married to Meghan’s Suits onscreen husband Patrick J. Adams, showed on Instagram that guests at the afternoon reception were given very fancy slippers to change into if their heels were hurting them. How thoughtful.\n\nTroian Bellisario showing the slippers people were given. Photo: sleepnthegardn/Instagram\n\nElton John Performed.\n\nHe apparently sang “Your Song” and “Tiny Dancer,” which is nice, as well as “Circle of Life,” which is from The Lion King.\n\nAnd there was cake.\n\nThe lemon elderflower cake Meghan and Prince Harry selected looked amazing. Baker Claire Ptak shared a pic of the cake on social media.\n\nThen, guests (and also Meghan and Prince Harry) changed before the evening reception.\n\nWe’ve already seen (and memorized) pictures of Meghan and Prince Harry in their evening reception attire (for reference, look at the pic above). Meghan swapped her Clare Waight Keller for Givenchy ceremony gown for a minimal Stella McCartney dress for the party, while Prince Harry donned a fancy tuxedo. The pair drove off to Frogmore House in a Jaguar convertible.\n\nThe Duke and Duchess of Sussex depart Windsor Castle for a reception hosted by The Prince of Wales at Frogmore House, in a silver blue Jaguar E-Type Concept Zero. This vehicle was originally manufactured in 1968, and has since been converted to electric power #RoyalWedding pic.twitter.com/hRrxEUlFlJ — Kensington Palace (@KensingtonRoyal) May 19, 2018\n\nBut the happy couple weren’t the only reception attendees to change into different attire. Luckily, some of the VIP guests (and the people working with them) posted their outfit changes on social media.\n\nSerena Williams, one of the greatest athletes of all time, revealed that she changed into a Valentino gown — with sneakers underneath for maximum comfort (smart):\n\nPriyanka Chopra changed into a Dior gown:\n\nJessica Mulroney — Meghan’s best friend, a Canadian stylist, the (secret) wedding planner, and the mother of two of the royal wedding pageboys and an adorable bridesmaid — also changed into something fancy (and glittery):\n\nBen and Jessica Mulroney. Photo: rachelrenna/Instagram\n\nThere was apparently a fancy separate invitation for the evening event.\n\nArgentinian polo player Nacho Figueras showed off the separate evening invitation on Instagram.\n\nThe evening royal wedding reception invitation. Photo: nachofigueras/Instagram\n\nThe evening reception was more of a party.\n\nThe private reception at Frogmore House was much more of a party than the more formal lunch reception at Windsor Castle following the ceremony. We had already heard that Prince Harry reportedly wanted a “carnival and festival-themed” after-party reminiscent of his favorite London night clubs, complete with vodka-filled ice luges, Wagyu beef, a steel band, and frozen tropical drinks. And according to a report by Daily Mail, it sounds like he had just that.\n\nThe after-party at Frogmore apparently featured DJ Sam Totolee, who also played at Pippa Middleton’s wedding last May (during which he apparently played “I Took a Pill In Ibiza). Meghan and Prince Harry reportedly had their first dance to Whitney Houston’s “I Wanna Dance With Somebody.” Prince William is said to have given a “naughty” best man speech, Meghan gave a speech thanking the royal family for welcoming her, and there was some “unknown” gift from James Corden (who is said to have been the host and entertainer for the evening).\n\nThere was also an organic sit down dinner that apparently lasted from 7:30 to 10 p.m. And the event did, in fact, have a specialty cocktail (at, least including to a Daily Mail source): a drink called “When Harry Met Meghan,” made with ginger and rum.\n\nAnd eventually, there were fireworks.\n\nOf course! The fireworks apparently went down at 11 p.m.\n\nThen there was apparently another after-party in London.\n\nThe Daily Mail reports guests from the 200-person reception in Windsor later returned to London to continue the celebration at the exclusive Chiltern Firehouse restaurant. There was also reportedly a different party in a “soundproofed private home” in Chelsea as well.", "images": ["https://pixel.nymag.com/imgs/fashion/daily/2018/05/20/GettyImages-960174034.w1200.h630.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg", "https://pyxis.nymag.com/v1/imgs/d11/902/312105a5406ffb3d7252b421c7f57eb8bc-IMG-1361.w710.png", "https://pixel.nymag.com/imgs/fashion/daily/2018/05/20/GettyImages-960174034.w330.h412.jpg", "https://pyxis.nymag.com/v1/imgs/fcc/fd1/7d066c059a17d3d72ae20d4c5199720c84-IMG-1364.w710.png", "https://pyxis.nymag.com/v1/imgs/ad1/0de/98a84b48f0ed66241059ae8ab3e48a58f4-IMG-1360.h473.w710.png", "https://pyxis.nymag.com/v1/imgs/733/45a/670c3611447c31cc71c8730471c6f0c3d9-19-harry-meghan-3.h473.w710.jpg"], "top_img": "https://pixel.nymag.com/imgs/fashion/daily/2018/05/20/GettyImages-960174034.w1200.h630.jpg", "keywords": [], "authors": ["Lisa Ryan"], "canonical_link": "https://www.thecut.com/2018/05/meghan-markle-prince-harry-royal-wedding-reception.html", "title": "Inside Meghan Markle, Prince Harry’s Royal Wedding Reception", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Inside Meghan Markle and Prince Harry’s Private Royal Wedding Reception", "url": "https://www.thecut.com/2018/05/meghan-markle-prince-harry-royal-wedding-reception.html", "description": "Everything we know about the afternoon lunch and exclusive evening party.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/05/20/GettyImages-960174034.w1200.h630.jpg", "site_name": "The Cut", "type": "article"}, "twitter": {"title": "Inside Meghan Markle, Prince Harry’s Royal Wedding Reception", "description": "Everything we know about the afternoon lunch and exclusive evening party.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/05/20/GettyImages-960174034.w600.h315.2x.jpg", "card": "summary_large_image", "creator": "@lisarya", "site": "@TheCut"}, "article": {"published_time": "2018-05-20T11:24:06.817-04:00", "tag": "royal wedding 2.0, meghan markle, prince harry, culture, celebrity", "publisher": "https://www.facebook.com/cut"}, "description": "Meghan Markle and Prince Harry were married on Saturday in a very royal wedding, followed by a lunch reception and an exclusive evening party. Here, everything we know about the two receptions.", "sailthru.tags": "royal wedding 2.0, meghan markle, prince harry, culture, celebrity", "author": "Lisa Ryan", "fb": {"app_id": 343556435754245}, "type": "Article", "vertical": "The Cut", "apple-mobile-web-app-title": "The Cut", "application-name": "The Cut", "msapplication-TileColor": "#ff5656", "msapplication-TileImage": "https://assets.nymag.com/media/sites/thecut/icon.144x144.png"}, "movies": [], "publish_date": 1526829846.817, "source": "https://www.thecut.com", "summary": ""}