{"url": "https://www.express.co.uk/news/royal/1030560/princess-eugenie-wedding-dress-pictures-latest-royal-wedding-news-peter-pilotto", "text": "The radiant bride beamed as the world caught a glimpse of the dress royal watchers and fashionistas had been waiting for ahead of tying the knot to her long-term boyfriend Jack Brooksbank. The intricately designed wedding dress is desgined by Peter Pilotto and Christoper De Vos, featuring an off the shoulder design, with a flowing skirt and delicate lace prints. Until now the designer of Princess Eugenie’s wedding dress was a heavily-guarded secret kept by Buckingham Palace, with the creators working behind blacked out windows and sworn to silence. It has become a royal trend for brides to have two separate wedding dresses for their big day. Royal wedding LIVE: Princess Eugenie FIRST KISS as she marries Jack Brooksbank at Windsor\n\n\n\nPeter Pilotto and Christopher De Vos founded the London-based label, Peter Pilotto in 2017. The fashion brand is known for their modern and feminine designs, intricately fabricating dresses in classic silhouette shapes. Princess Eugenie met the brand designers when she co-hosted an event in support of women artists, and has been a fan of the brand ever since. She has notably worn several Peter Pilotto pieces throughout the years, and worked with the designers to create her own bespoke wedding dress.\n\nPrincess Eugenie's wedding dress is designed by Peter Pilotto and Christopher De Vos\n\nMr Pilotto and Mr De Vos, studied Royal Wedding dresses throughout the years to perfect the silhouette of the dress. Eugenie's gown was developed layer by layer in intricate fabric work, to carefully construct a fitted bodice and full pleated skirt. The beautiful ensemble features a folded neckline along the shoulders, with an open back and a full length trail. The low back on the dress was Eugenie's idea, reflecting her long-standing battle against scoliosis.\n\nPrincess Eugenie chose a low back dress to reflect her battle with scoliosis\n\nWhen she was 12, Eugenie had corrective surgery to fix her back leaving her with a scar down her spine. She told ITV This Morning: \"I had an operation when I was 12 on my back, and you'll see on Friday [at the wedding], but it's a lovely way to honour the people who looked after me and a way of standing up for young people who also go through this,\" she told ITV's This Morning. \"I think you can change the way beauty is, and you can show people your scars and I think it's really special to stand up for that.\" Princess Eugenie topped her outfit off with the stunning Greville Emerald Kokoshnik Tiara, lent to her by Her Majesty The Queen.\n\nEugenie arrived with her father, Prince Andrew, who walked her down the aisle\n\nEugenie arrived at St George's Chapel in Windsor to marry her fiancé Jack Brooksbank\n\nThe tiara consists of rose cut diamonds set in platinum with six emeralds embedded on each side, designed in a \"kokoshnik\" style popularised in the Russian Imperial Court. The dazzling piece was made for Mrs Greville in 1919, and passed on to Queen Elizabeth in 1942. Eugenie paired up her tiara with matching emerald drop-earings, a wedding gift from her husband, Jack. Eugenie’s decision to opt for a British designer to make her stunning outfit follows in the footsteps of her mother, Sarah Ferguson, whose dress was designed by Lindka Cierach, British couturier and fashion designer.\n\nPrincess Eugenie's bouquet consists of roses, pips, thistles and Lily of the Valley\n\nEugenie's wedding dress contains a number of meaningful symbols\n\nFergie's flamboyant gown was made from ivory duchesse satin and heavily beaded, especially over the bodice, with symbols including hearts to represent love and waves, a homage to Prince Andrew’s career in sailing. Like Meghan Markle and Kate, the Duchess of Cambridge, Princess Eugenie is likely to unveil another reception dress later today. Eugenie's wedding dress contains a number of meaningful symbols that are close to her heart. The gown includes a thistle for Scotland, to represent Eugenie and Jack's love for Balmoral.\n\nPrincess Eugenie's wedding dress was carefully designed and crafted layer by layer\n\nEmbedded in the dress is a shamrock for Ireland, as a nod to Eugenie's mother Sarah Ferguson's Irish side of the family, along with the York Rose and ivy, representing the royal couple's home. She finished off her ensemble with a pair of satin heels by Charlotte Olympia. Today, 850 guests have gathered at St George's chapel to attend Princess Eugenie and Jack Brooksbank's wedding. Eugenie and Jack have invited 1,200 members of the public, who will catch a glimpse of the Royal Family.\n\nEugenie's father, Prince Andrew, walked her down the aisle\n\nPrincess Eugenie and Jack will read their wedding vows\n\nThe wedding includes a star-studded guest list, which include Kate Moss, Robbie Williams, Cara Delevingne, Demi Moore, George and Amal Clooney. Robbie Williams daughter, Ayda Williams will be one of Eugenie's bridesmaids for the day. Eugenie's wedding bouquet includes Lily of the Valley, Stephanotis pips, hints of baby blue thistles, white spray roses and trailing ivy, designed by Patrice Van Helden Oakes.\n\nSprigs of myrtle from Osbourne House were also added to the bouquet, a tradition which was started by Queen Victoria.\n\nEugenie and Jack exchanged their vows\n\nEugenie's wedding dress featured a full length trail\n\nPrince Albert's grandmother gave Queen Victoria a nosegay containing myrtle, and in the same year, she planted a myrtle plant in her garden which still thrives today. In 1858, Queen Victoria gave her daughter, Princess Victoria a sprig of myrtle for her wedding bouquet - a tradition that continued in every Royal Wedding since. Eugenie's father, Prince Andrew, walked her down the aisle where she exchanged vows with her husband, Jack. Jack was overwhelmed with emotion, and was seen crying tears of joy before his bride walk down the aisle.\n\nEugenie and Jack walked down the steps of St George's Chapel, with bridesmaids and pageboys behind\n\nEugenie and Jack shared a kiss on the steps of St George's chapel", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6035737&cv=2.0&cj=1", "https://cdn.images.express.co.uk/img/dynamic/106/285x190/1030639_1.jpg", "https://cdn.images.express.co.uk/img/dynamic/106/285x190/1030536_1.jpg", "https://googleads.g.doubleclick.net/pagead/viewthroughconversion/1068671835/?value=0&label=u9gYCOmHtQYQ28bK_QM&guid=ON&script=0", "https://cdn.images.express.co.uk/img/page/placeholder-horizontal.gif", "https://cdn.images.express.co.uk/img/covers/70x91/front_2020-04-18.jpg", "https://analytics.twitter.com/i/adsct?txn_id=l4f18&p_id=Twitter", "https://cdn.images.express.co.uk/img/page/preloaderbig.gif", "https://t.co/i/adsct?txn_id=l4f18&p_id=Twitter", "https://cdn.images.express.co.uk/img/dynamic/106/750x445/1030560.jpg"], "top_img": "https://cdn.images.express.co.uk/img/dynamic/106/750x445/1030560.jpg", "keywords": [], "authors": ["Latifa Yedroudj"], "canonical_link": "https://www.express.co.uk/news/royal/1030560/princess-eugenie-wedding-dress-pictures-latest-royal-wedding-news-peter-pilotto", "title": "Princess Eugenie wedding dress REVEALED: First picture of Peter Pilotto gown", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "PRINCESS Eugenie’s wedding dress has been seen by the world as Sarah Ferguson and Prince Andrew’s daughter gave Royal Wedding watchers their first glimpse of her eagerly anticipated gown, designed by Peter Pilotto and Christopher De Vos.", "fb": {"pages": 129617873765147, "app_id": 823607694325129}, "og": {"title": "Princess Eugenie wedding dress REVEALED: First picture of Peter Pilotto gown", "type": "article", "url": "https://www.express.co.uk/news/royal/1030560/princess-eugenie-wedding-dress-pictures-latest-royal-wedding-news-peter-pilotto", "image": "https://cdn.images.express.co.uk/img/dynamic/106/750x445/1030560.jpg", "site_name": "Express.co.uk", "language": "en", "tags": "ctp_video,princess eugenie,princesse eugenie wedding,princess eugenie dress,eugenie,eugenie wedding,eugenie dress,royal wedding live,royal wedding news,princess eugenie jack brooksbank", "section": "Royal", "description": "PRINCESS Eugenie’s wedding dress has been seen by the world as Sarah Ferguson and Prince Andrew’s daughter gave Royal Wedding watchers their first glimpse of her eagerly anticipated gown, designed by Peter Pilotto and Christopher De Vos."}, "news_keywords": "ctp_video,princess eugenie,princesse eugenie wedding,princess eugenie dress,eugenie,eugenie wedding,eugenie dress,royal wedding live,royal wedding news,princess eugenie jack brooksbank", "article": {"tag": "princess eugenie jack brooksbank", "published_time": "2018-10-12T10:48:00+01:00", "modified_time": "2018-10-12T13:29:26+01:00", "expiration_time": "2018-11-11", "section": "Royal", "image_count": 13, "video_count": 1, "word_count": 1185, "internal_link_count": 3, "external_link_count": 0}, "author": "Latifa Yedroudj", "twitter": {"card": "summary_large_image", "image": {"src": "https://cdn.images.express.co.uk/img/dynamic/106/750x445/1030560.jpg"}, "title": "Princess Eugenie wedding dress REVEALED: First picture of Peter Pilotto gown", "description": "PRINCESS Eugenie’s wedding dress has been seen by the world as Sarah Ferguson and Prince Andrew’s daughter gave Royal Wedding watchers their first glimpse of her eagerly anticipated gown, designed by Peter Pilotto and Christopher De Vos."}, "video_autoplay": "true", "headline_short": "Princess Eugenie wedding dress REVEALED: First picture of Peter Pilotto gown", "verify-v1": "EGl3XPBuem43awGwLC1rXGpRHRnmNSwp7VZfnCAAcKE=", "msvalidate.01": "1960193A20395DAD3FCB640BCB0D91D7", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "robots": "noodp,noydir,all"}, "movies": [], "publish_date": 1539337680.0, "source": "https://www.express.co.uk", "summary": ""}