{"url": "www.thesun.co.uk/tvandshowbiz/6922995/lamar-odom-turns-down-celebrity-big-brother-2018-khloe-kardashian/", "text": "LAMAR Odom has turned down a massive payday to appear on Celebrity Big Brother and spill secrets from his relationship with Khloe Kardashian.\n\nThe former NBA player, 38, was lined up to star in the reality show that has a retribution theme this year – after he confessed to having “multiple affairs” behind ex-wife Khloe’s back.\n\n5 Lamar Odom has turned down a massive payday to appear on the upcoming series of Celebrity Big Brother\n\nA TV source said: “Bosses were really keen on signing Lamar as their star contestant for this year’s line-up.\n\n“The upcoming series is all about celebrities facing their demons and there’s no better character than Lamar in terms of someone who’s gone through a journey of redemption.\n\n“He had a massively successful career as a sportsman and a beautiful wife but it all came crashing down due to his infidelities and drug and drink addictions.\n\n“Lamar was offered a huge fee to take part in the series – but eventually turned down the opportunity.”\n\nKhloe Kardashian makes Snapchat debut with Lamar Odom\n\n5 Bosses were keen to sign the ex-husband of Khloe Kardashian for their redemption themed series but he turned down the offer\n\n5 The ex-basketball player was offered a lump sum to star in the show and follow in the footsteps of Khloe's best pal Malika Haqq\n\nIn 2015 Lamar came close to death after he was found unconscious at a brothel following a drugs binge.\n\nKhloe, who divorced Lamar in 2016, said making medical decisions for her ex while he was in a coma was the most emotionally stressful time of her life.\n\nSpeaking in 2015 she said: “They told me he had four hours. It’s a horrible call to get.\n\n“Having to run these tests or make medical decisions, it’s terrifying.”\n\nKhloe Kardashian reveals she was told Lamar Odom had died after his overdose in 2015\n\n5 Lamar almost lost his life in 2015 when he was found unconscious at a brothel following a drugs binge\n\n5 Khloe was there by his side during the tough time but the pair eventually divorced in 2016\n\nMOST READ IN TV & SHOWBIZ cosy costars Sons of Anarchy star, 70, seen with new love, 47, after ditching wife of 38yrs PRICE'S POSH PAD Inside Katie Price's new home 10mins from ex Peter Andre BECK HOME The Beckhams post pics proving they didn't move back to London HOT STUFF Too Hot To Handle stars had sex despite needing to go celibate for £80k prize GUESS THAT CELEB Celebrities post their #MeAt20 pics - but can you guess who is who? Exclusive Show me the money Bra tycoon Michelle Mone in secret talks to join Dragon’s Den Exclusive CHUM-IN-LAW MasterChef's Gregg laughs more with mum-in-law than wife who's 22yrs his junior VIRAL HIT Sam Smith says they 'definitely' had coronavirus - despite not being tested BRAVE BATTLE Kate Garraway's husband Derek Draper still in 'deeply critical condition' TOON TOT Cheryl shares first video of son Bear, 3, talking - with adorable Geordie accent\n\nLamar made a miraculous recovery and later admitted to being unfaithful on Khloe, who's now in a relationship with Tristan Thompson.\n\nIn an interview last year he said: “When I became Khloe Kardashian’s man and on TV, it made me look more enticing.\n\n“That wasn’t the stand-up thing to do. I wish I could have kept my d*** in my pants.”\n\nLast year's Khloe best pal Malika Haqq appeared on the reality series but refrained from telling secrets about The Kardashians.", "images": ["data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.2 1\"%3E%3C/svg%3E", "http://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "https://www.thesun.co.uk/wp-content/uploads/2018/08/AssetAccess32.jpg?strip=all&quality=100&w=812&h=702&crop=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.4 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.7 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2018/08/AssetAccess32.jpg?strip=all&quality=100&w=812&h=702&crop=1", "keywords": [], "authors": ["Sarah Packer"], "canonical_link": "https://www.thesun.co.uk/tvandshowbiz/6922995/lamar-odom-turns-down-celebrity-big-brother-2018-khloe-kardashian/", "title": "Lamar Odom turns down massive payday to appear on Celebrity Big Brother and spill secrets of the Kardashians", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Lamar Odom turns down massive payday to appear on Celebrity Big Brother and spill secrets of the Kardashians", "url": "https://www.thesun.co.uk/tvandshowbiz/6922995/lamar-odom-turns-down-celebrity-big-brother-2018-khloe-kardashian/", "description": "LAMAR Odom has turned down a massive payday to appear on Celebrity Big Brother and spill secrets from his relationship with Khloe Kardashian. The former NBA player, 38, was lined up to star in the …", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2018/08/AssetAccess32.jpg?strip=all&quality=100&w=812&h=702&crop=1", "width": 812, "height": 702}, "locale": "en_GB"}, "article": {"published_time": "2018-08-02T11:17:33+00:00", "modified_time": "2018-08-02T13:31:03+00:00", "publisher": 161385360554578, "tag": "Khloe Kardashian, Lamar Odom", "author": "https://www.facebook.com/thesunshowbiz/"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "description": "Lamar Odom turns down massive payday to appear on Celebrity Big Brother and spill secrets of the Kardashians", "keywords": "Lamar Odom, Khloe Kardashian", "news_keywords": "Lamar Odom, Khloe Kardashian", "twitter": {"text": {"title": "Lamar Odom turns down massive payday to appear on Celebrity Big Brother and spill secrets of the Kardashians"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "ODOM AND OUT", "headline": "Lamar Odom turns down huge offer to appear on CBB and spill all on Kardashians", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2018/08/AssetAccess32.jpg?strip=all&quality=100&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2018/08/AssetAccess32.jpg?strip=all&quality=100&w=620&h=413&crop=1"}}, "parsely-post-id": 6922995, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1533208653.0, "source": "http://www.thesun.co.uk", "summary": ""}