{"url": "https://en.wikipedia.org/wiki/The_People_v._O._J._Simpson:_American_Crime_Story", "text": "The People v. O. J. Simpson: American Crime Story is the first season of the FX true crime anthology television series American Crime Story. The season, which debuted on February 2, 2016, revolves around the O. J. Simpson murder case and is based on Jeffrey Toobin's book The Run of His Life: The People v. O. J. Simpson (1997).[1]\n\nThe season received critical acclaim, with praise for most of the performances, directing and writing. For the 68th Primetime Emmy Awards, the season received 22 Primetime Emmy Award nominations, in 13 categories, winning nine, more than any other show, including Outstanding Limited Series.[2] It also won the Golden Globe Awards for Best Miniseries or Television Film and Best Actress – Miniseries or Television Film for Sarah Paulson.\n\nCast [ edit ]\n\nMain [ edit ]\n\nRecurring [ edit ]\n\nGuest [ edit ]\n\nMarguerite Moreau as Laura McKinny\n\nAngie Patterson as Paula Barbieri\n\nKwame Patterson as Michael Darden\n\nRomy Rosemont as Jill Shively\n\nDuane Shepard Sr. as Mr. Darden\n\nBeau Wirick as Allan Park\n\nKen Lerner as Howard Weitzman\n\nArchive audio of O. J. Simpson and Nicole Brown Simpson is heard through Nicole's 9-1-1 calls.\n\nEpisodes [ edit ]\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nOn October 7, 2014, it was announced that FX had ordered a 10-episode season of American Crime Story, developed by Scott Alexander and Larry Karaszewski, and executive produced by Alexander and Karaszewski, as well as Ryan Murphy and Brad Falchuk, who co-created such series as Nip/Tuck, Glee, American Horror Story, and Scream Queens. Murphy also directed the pilot episode. Other executive producers are Nina Jacobson and Brad Simpson.[13] Co-executive producers are Anthony Hemingway and D. V. DeVincentis. All 10 episodes were expected to be written by Alexander and Karaszewski.[1][14] The series was previously in development at Fox but since moved to the company's sibling cable network FX. Murphy and others wanted to create an unbiased account of the trial by doing “certain takes guilty, certain takes innocent” according to Cuba Gooding Jr so that they would have a “plethora of emotions to play with”.[15]\n\nCasting [ edit ]\n\nCuba Gooding Jr. and Sarah Paulson were the first to be cast as Simpson and Marcia Clark, respectively.[16] Subsequently, David Schwimmer was cast as Robert Kardashian.[17] In January 2015, it was reported that John Travolta had joined the cast as Robert Shapiro; he would also serve as producer.[18] In February 2015, Courtney B. Vance joined the series as Johnnie Cochran.[19] In March 2015, it was announced that Connie Britton would co-star as Faye Resnick.[20] April 2015 saw the casting of Sterling K. Brown as Christopher Darden,[21] Jordana Brewster as Denise Brown,[22] and Kenneth Choi as Judge Lance Ito.[23] In May 2015, it was confirmed Selma Blair would be portraying Kris Kardashian Jenner.[24] In July 2015, it was announced Nathan Lane had joined the cast as F. Lee Bailey.[25]\n\nFilming [ edit ]\n\nPrincipal photography began on May 14, 2015, in Los Angeles, California.[22][26]\n\nPromotion [ edit ]\n\nIn October 2015, FX released its first promotional trailer for The People v. O. J. Simpson, showing an Akita dog whining, walking from its residence onto a sidewalk to bark, then walking back to its residence, leaving behind bloody paw prints.[27] Later that month another teaser was released, wherein the first actual footage of Travolta as Shapiro was shown. In the teaser, Shapiro is about to ask Simpson (whose face is unseen) if he is responsible for the murder of Simpson's ex-wife. In the next short teaser that was released, Simpson (again unseen) is taking a lie detector test.\n\nIn November, two new teasers were released. The first shows Simpson writing his attempted suicide letter, while a voice-over by Gooding, Jr. narrates. The second shows the police chasing Simpson's white Ford Bronco, while dozens of fans cheer for him.[28]\n\nThe first full trailer was released in December, along with a poster for the season. The trailer included Simpson sitting in the childhood bedroom of Kim Kardashian and contemplating suicide while Robert Kardashian tries to stop him.[29]\n\nReception [ edit ]\n\nReviews [ edit ]\n\nThe People v. O.J. Simpson received acclaim from critics. The review aggregator Rotten Tomatoes gave the season an approval rating of 97%, based on 89 reviews, with an average rating of 8.74/10. The site's critical consensus reads, \"The People v. O. J. Simpson: American Crime Story brings top-shelf writing, directing, and acting to bear on a still-topical story while shedding further light on the facts—and provoking passionate responses along the way.\"[30] On Metacritic, the season has a score of 90 out of 100, based on 45 critics, indicating \"universal acclaim.\"[31]\n\nMany critics singled out many cast members for the performances, particularly Paulson and Vance.[32][33][34] Dan Feinberg of The Hollywood Reporter praised the performances of Paulson and Vance, writing: \"As Clark's discomfort grows, Paulson's collection of tics seem more and more human, [...] Vance's Cochran is sometimes hilarious, but he has a dynamic range such that he's occasionally introspective and always intelligent as well.\"[33] Brian Lowry of Variety praised the casting of the smaller roles, particularly Connie Britton as Faye Resnick and Nathan Lane as F. Lee Bailey.[35]\n\nTravolta and Gooding's respective portrayals of Shapiro and Simpson were met with mixed reviews by critics. Brian Lowry of Variety called Travolta \"awful\" in the role, adding: \"Yes, Shapiro spoke in stiff, measured tones, but the actor's overly mannered line readings turn the attorney into a buffoon, in sharp contrast to the more nuanced portrayals around him.\"[35] Nicole Jones of Vanity Fair called his performance \"campy and calculated.\"[36] Dan Feinberg of The Hollywood Reporter also criticized his performance, calling it \"a mesmerizingly bad performance from the eyebrows down.\" He also wrote that \"His unnecessary accent varies by episode, and Travolta's laser intensity feels arch and almost kabuki at times, turning Shapiro into a terrifying character from the next American Horror Story installment, rather than a part of this ensemble.\"[33]\n\nMaureen Ryan of Vanity Fair, conversely, became more impressed with Travolta as the season progressed: \"I started in the realm of puzzled disbelief, arrived at amusement, and ultimately traveled to a place of sincere appreciation. You simply can't take your eyes off Travolta, and that is a form of enchantment.\"[37] Elisabeth Garber-Paul of Rolling Stone also called it \"arguably [Travolta's] best performance since Tarantino brought him back from the dead.\"[38] Robert Bianco of USA Today wrote that Travolta's was the show's \"broadest performance.\"[39]\n\nDave Schilling of The Guardian panned Gooding's performance, writing: \"his whiny, gravely voice sounds absolutely nothing like the real O. J. Simpson's deep, commanding tones.\"[40] Michael Starr of New York Post also was highly critical of Gooding's performance, saying that he \"portrays Simpson as a hollow, sad-sack cipher who speaks in a high-pitched whine and sleepwalks in a fog he never shakes after being arrested for the brutal double murder of ex-wife Nicole Brown and Ron Goldman. He's a forgettable, annoying presence in what should be a showcase role for Gooding—who, to be fair, is reciting lines written for him, so he can only do so much with the material.\"[41]\n\nOn the other hand, Joe McGovern was more positive on Gooding's performance, writing that his casting \"takes a risk and pulls it off.\"[42] Elisabeth Garber-Paul of Rolling Stone described his performance as \"an unnervingly believable take on a potential psychopath with teetering sanity.\"[38] Nick Venable of Cinema Blend also opined that Gooding's turn as Simpson \"could indeed get him on a shortlist of Emmy nominees.\"[43]\n\nIn spite of the mixed reviews for their performances, Gooding and Travolta received Emmy nominations. Travolta was also nominated as one of the producers of the show in the Outstanding Limited Series category, which he ultimately won. Gooding's nomination was criticized by some reviewers.[44]\n\nReaction from individuals involved [ edit ]\n\nMark Fuhrman, who is portrayed by Steven Pasquale, refused to watch the series and called his portrayal untruthful. In an interview with New York Post, he said, \"The last 20 years, I have watched the facts dismissed by the media, journalists and the public simply because it does not fit within the politically correct narrative. At this late date, FX is attempting to establish a historical artifact with this series without reaching out to any prosecution sources. In a time when Americans read less and less and investigative journalism is on vacation, it is sad that this movie will be the historical word on this infamous trial. After all, it was 'based on a true story.'\"[45]\n\nMarcia Clark praised the series and called Sarah Paulson's portrayal of her \"phenomenal.\"[46] During an interview on The Wendy Williams Show, Clark admitted that she watched the series with friends \"to keep me from jumping off the balcony\", and that she was emotionally unable to watch the series' recreation of Fuhrman's testimony. Clark also said her sons were only able to watch the first episode.[47] Clark went to the Emmys with Sarah Paulson, who won that night for her performance.[48]\n\nThe families of Brown and Goldman expressed anger at the show. Nicole Brown's sister, Tanya Brown, lashed out at the cast members for what she saw as a lack of consultation with the families.[49] Ron Goldman's father, Fred Goldman, had numerous criticisms of the series even though they were portrayed sympathetically.[50] He felt that there was not enough material about Ron, who is only depicted on the show as a corpse even though the Goldmans on the show mentioned his modeling career and his work on children with cerebral palsy. He expressed concern that the generations of people who were too young to understand the events at the time would consider everything to be accurate. Goldman's family also criticized the series for not depicting the murders, as they believe that Goldman died trying to save Brown from her attacker and that he was the man who eyewitnesses heard shouting that night.[50] Goldman's sister, Kim, criticized the series for sympathetic portrayals of Simpson and Kardashian (despite Kardashian in real life admitting to having had actual doubts about Simpson's innocence and eventually severing his ties with him).[51]\n\nRatings [ edit ]\n\nAccolades [ edit ]\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/7/7c/The_People_v._O._J._Simpson_-_American_Crime_Story_poster.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/7/7c/The_People_v._O._J._Simpson_-_American_Crime_Story_poster.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_People_v._O._J._Simpson:_American_Crime_Story", "title": "The People v. O. J. Simpson: American Crime Story", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/7/7c/The_People_v._O._J._Simpson_-_American_Crime_Story_poster.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}