{"url": "people.com/parents/kim-kardashian-west-everything-she-has-said-baby-pregnancy/", "text": "After two high-risk pregnancies, Kim Kardashian West took a different route for baby no. 3, whom she welcomed in January 2018, with Kanye West: surrogacy.\n\nThe news comes hot on the heels of the last season of Keeping Up with the Kardashians, which explored the reality star’s desire to have another child despite the significant health challenges she faces.\n\nGet push notifications with news, features and more.\n\nAlready mother to daughter North, 4½, and son Saint, 2, here’s a look back at what Kardashian West, 37, has said about wanting to expand her family in recent years.\n\nWant all the latest pregnancy and birth announcements, plus celebrity mom blogs? Click here to get those and more in the PEOPLE Babies newsletter.\n\nA Pregnancy Scare\n\nIn May 2016, just five months after Saint was born, Kardashian West bought three pregnancy tests and took one in a cramped airplane bathroom during a flight, taking to Snapchat to share the experience with her fans.\n\nImage zoom Kim Kardashian/Snapchat\n\n“I’m legit in the airplane bathroom taking a pregnancy test because I’m having a little bit of a scare,” she said in one video.\n\nAfter her frantic message, the star snapped a pic of the clear “not pregnant” result.\n\nImage zoom Kim Kardashian/Snapchat\n\nThe next day, Kardashian West took to Snapchat yet again, this time to explain her decision to document the experience.\n\n“Let’s discuss,” she started. “Some people were asking me why I would Snapchat the pregnancy test on the airplane. And I just thought it was funny, because I’ve been so private before — and what do I really care if I was pregnant again?”\n\n“I didn’t get my period this month, so I was just really confused,” she added. “And I couldn’t stand to be on a flight for 10 hours not knowing.”\n\nRELATED VIDEO: Kim Kardashian West Is Trying for a Third Baby — But Doctors Warn It’s Not Safe\n\nExploring Other Options\n\nA few months later, in a November 2016 episode of KUWTK, Kardashian West broached the possibility of having someone else carry her third child.\n\nKardashian West then met with two fertility specialists, including Dr. Wong, who was on board with the option considering the medical risks of a third pregnancy for the star.\n\n“Using a surrogate is not an unreasonable option,” he said. “If our goal is to grow your family like you want to, then a surrogate makes sense.”\n\n“If the two doctors that I trust have told me it wouldn’t be safe for me to get pregnant again, I have to listen to that,” said Kardashian West. “But because I don’t know anyone that has been a surrogate or used one, I didn’t really think about that as an option for me.”\n\nImage zoom Kim Kardashian West/Instagram\n\nAt sister Kourtney Kardashian‘s suggestion, Kardashian west met with a woman named Natalie who had both carried a pregnancy herself and used a surrogate.\n\n“I’m more worried because I gave birth to two [children] — there’s a sense in me that because I went through all that pain for these two babies and that I know we did this together … There’s no one that would feel your love [like that],” she said. “They are literally near your heart and inside of you.”\n\n“My bond with my kids is so strong,” she continued. “I think my biggest fear if I had a surrogate is: Would I love them the same? That’s the main thing I keep thinking about.”\n\nNatalie reassured the star that the bond is just as strong, and Kardashian West sat down with momager Kris Jenner to discuss the news.\n\n“So I’ve come to the conclusion that I can’t carry another one,” she said. “I want to explore surrogacy.”\n\n“That scares me for you,” said Jenner. “What if she gives birth and then grabs the baby and makes a run for it?”\n\n“I don’t think she can,” said Kardashian West. “Also, the best thing is I could have a new baby and have no one know and live my life for a good year before we announce it.”\n\nFROM PEN: Katherine Heigl Reveals the Emotional Way She Told Her Daughters She Was Pregnant\n\nBaby Fever Hits Hard\n\nIn an April episode of the most recent season of KUWTK, the reality star revealed that she and West, 40, are trying to conceive again despite their challenging pregnancies.\n\n“I want my kids to have siblings, but the doctors don’t feel like it’s safe for me,” she said, telling sister Kourtney and Khloé Kardashian that she’s “going to try to have one more baby.”\n\n“I’d love nothing more than to expand my family and just know that I have this world at home that’s safe,” she said. “And if for some reason I left this earth sooner than I really wanted to, then my kids would have a support system at home — so that I know that they would be okay if I wasn’t here.”\n\n“Kanye and I have always talked about having more kids,” she admitted. “But after what I went through in Paris, the urgency is even greater.”\n\nAt the time, Kardashian West and her husband had been working hard on their relationship, having finally settled into a good place after enduring a period of marital strain sparked by her Paris robbery last October, followed swiftly by the rapper’s hospitalized for exhaustion in November.\n\n“Everyone knows she had major medical complications during her other two pregnancies,” a source told PEOPLE. “But whenever things are going great with Kanye, Kim talks about having another baby.” (The insider also acknowledged that a third baby would be “a great storyline for the show.”)\n\nImage zoom Source: Kim Kardashian Instagram\n\nGetting Serious About Surrogacy\n\nIn the same April KUWTK episode, Kardashian West underwent a procedure in an attempt to help her become able to carry another child — but it wasn’t successful.\n\n“I can’t carry anymore kids … it’s the worst,” she confessed. “I give up.”\n\nAs a result, the star decided it was time to revisit the option of hiring a surrogate.\n\n“Kanye was really nervous about the surgery … but I know he would want to have more kids,” she said. “I feel like surrogacy is the only option for me. Kanye and I are going to look into other options and see what we are comfortable with … but I’m definitely leaning towards [surrogacy].”\n\n“I always knew surrogacy was an option — now it’s my reality,” she eventually concluded. “Whatever is meant to be will be.”\n\nA Plan in Motion\n\nIn June 2017, a source confirmed to PEOPLE that the stars had hired a surrogate. TMZ was the first to report the news.\n\nIt’s a Girl!\n\nThe soon-to-be mother of three told host Ellen DeGeneres that her 4-year-old daughter North had taken to calling the unborn child, “Baby Sister” during an October 2017 appearance on the talk show. “My daughter thinks she’s tricky,” Kardashian West said. “We had a baby shower over the weekend, and I thought, ‘You know, I really do want to have a baby shower because I want [North] to feel that something’s coming and for her to really understand it.’ ”\n\nA New Experience\n\nWhile she was excited to share the news with the rest of the Kardashian crew, Kardashian West admitted the situation felt different than when she was pregnant the first two times. “It’s kind of weird when it’s not you, so I don’t know whether I should start eating donuts and celebrate like I would like old times or just go to the gym,” Kardashian West told sister Kourtney on a December 2017 episode of Keeping Up with the Kardashians. “I’m totally gonna forget and then a month before I’m gonna be like holly sh—, we need to get a nursery.”\n\nShe’s Here!\n\nThe couple’s second daughter has arrived via surrogate, Kardashian West shared via her website on January 16, 2018. The baby girl was born Jan. 15, at 12:47 a.m., weighing 7 lbs., 6 oz. “Kanye and I are happy to announce the arrival of our healthy, beautiful baby girl,” she wrote in a post titled ‘She’s Here!’.\n\n“We are incredibly grateful to our surrogate who made our dreams come true with the greatest gift one could give and to our wonderful doctors and nurses for their special care.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1620&h=848&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkim-kardashian-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkim-kardashian-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F02%2Fkim-kardashian-20001.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F05%2Fkim-kardashian-1-435-49.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fkim-kardashian-2-435-113-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1620&h=848&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkim-kardashian-2.jpg", "keywords": [], "authors": ["Stephanie Petit", "Aurelie Corinthios"], "canonical_link": "https://people.com/parents/kim-kardashian-west-everything-she-has-said-baby-pregnancy/", "title": "Everything Kim Kardashian West Has Said About Baby No. 3", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Babies,Kanye West,Kim Kardashian,News,Pregnancy,TV", "news_keywords": "Babies,Kanye West,Kim Kardashian,News,Pregnancy,TV", "description": "Kim Kardashian West and Kanye West have welcomed their third child", "og": {"title": "Everything Kim Kardashian West Has Said About Baby No. 3", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/parents/kim-kardashian-west-everything-she-has-said-baby-pregnancy/", "description": "After two high-risk pregnancies,&nbsp;Kim Kardashian West&nbsp;took a different route for baby no. 3, whom she welcomed in January 2018, with Kanye West: surrogacy. The news&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1620&h=848&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkim-kardashian-2.jpg", "width": 1620, "height": 848}}, "pinterest": {"url": "https://people.com/parents/kim-kardashian-west-everything-she-has-said-baby-pregnancy/", "description": "Kim Kardashian West and Kanye West have welcomed their third child", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkim-kardashian-2.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/parents/kim-kardashian-west-everything-she-has-said-baby-pregnancy/", "title": "Everything Kim Kardashian West Has Said About Baby No. 3", "description": "Kim Kardashian West and Kanye West have welcomed their third child", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1620&h=848&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkim-kardashian-2.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}