{"url": "https://www.mjsbigblog.com/headlines-chris-blue-davon-fleming-jordin-sparks-celebrate-mlk.htm", "text": "Scoop: THE VIEW 1/15 – 1/19 on ABC – Monday, Jan. 15 – “The View” honors Dr. Martin LUTHER King Jr.’s birthday with guest co-host Jordin Sparks; U.S. Representative John Lewis; Common (“The Chi”); Mayor of Charlottesville Nikuyah Walker – Read more at BroadwayWorld\n\nDavon Fleming Grand Marshall Baltimore MLK Day\n\nToday I announced that Baltimore’s own Davon Fleming will serve as Grand Marshall for the 18th Annual Dr. Martin Luther King, Jr. Parade! There is also still time to register for the Inaugural Dr. Martin Luther King, Jr. Day of Service. To register, go to https://t.co/UrASzmeXA3 pic.twitter.com/K4itwot8Ns — Mayor Catherine Pugh (@MayorPugh50) January 10, 2018\n\n‘Voice’ winner Chris Blue Led MLK Day Parade – But Saturday, Blue makes a homecoming of sorts. He’ll be the grand marshal in the 39th annual Winter Haven Dr. Martin Luther King Jr. Parade. After moving from Winter Haven, the Blue family – his mother, Janice Blue Williams, two sisters and four brothers – moved to Knoxville, Tenn. Speaking from there Thursday, he said he is excited to get back to Polk County for a mini-vacation, see family, friends and fans and be front and center as grand marshal. “I’m grateful; I’m honored by that,” he said. “It’s phenomenal to be asked. I absolutely love Polk County, Florida. It’s my ‘for sure’ home – it’s where it all started.” – Read more at NewsCheif.com\n\nBowersox helps mom recover from house fire – “I called my mom and she didn’t answer,” Bowersox told The Blade in a phone interview Saturday evening. “I called my brother and he didn’t answer. There was a 90-minute waiting period where I didn’t know if my mom was alive.” Her mother, Kelly Lynn Bowersox, 55, was alive and well. In fact, the elder Bowersox was staying at a friend’s house the night of the fire. But the home, a two-story rustic farmhouse built more than a century ago that was a significant part of Bowersox’s childhood, is a total loss, she said. “I asked my brother if there was even any salvageable wood so that maybe I could build a memorial art piece,” Bowersox said. “He doesn’t know if there’s anything good enough for that.” – Read more at Toledo Blade\n\nCamila Cabello is the American Sweetheart 2018 needs – The two parties had been giving differing accounts of the split in the months prior to the awards: Fifth Harmony claimed they only found out about Cabello leaving via her management, but in a response on Instagram, Cabello said that was “simply not true.” She also told Billboard: “I was always super open [that] I couldn’t just sing other people’s words [in Fifth Harmony songs] and be totally happy with that.” It could have been the next big pop beef, but as Elvis Duran, host of Z100’s “Morning Show,” tells The Post, Cabello always strives to take the high road. “She didn’t come out and bad-mouth anyone, or throw any punches — that’s not really what she’s about,” he says. – Read more at New York Post\n\nCamila Cabello Is In Control: ‘I Express Myself However I Want’ – Camila Cabello got her start as one-fifth of Fifth Harmony, a group formed by music impresario Simon Cowell from girls who had auditioned for the music competition show The X Factor. The experience forced a teenage Cabello out of her shell and propelled her and her bandmates to pop stardom. – Read more at NPR\n\nQ&A with Chase Goehring, America’s Got Talent star – What went through your head the moment that DJ Khaled hit the golden buzzer? As the night went on, we were getting down to the last few people. He hadn’t hit his golden buzzer yet. So when I was performing, I was like, “There’s a chance he could hit it. Hmm, maybe it’ll happen.” But was I expecting it? Not at all. When I finished performing, people started chanting, “Hit that buzzer! Hit that buzzer!” He was looking at it, and I was like, “What is gonna happen?” And then he hit it. The rest is history. – Read more at Vanderbilt Hustler.com\n\nSheryl Crow Condemns The Four as a ”Bogus Pretentious TV Talent Show” – The singer-songwriter took to Twitter Thursday evening with a message regarding FOX’s new singing competition, and her apparent distaste for one of the show’s panelists, Republic Records president Charlie Walk. “Seriously!! Who the heck is Charlie Walk?” Crow wrote. “An artist is not a brand, Charlie. That is what is wrong with the music industry. Bogus pretentious TV talent show.” – Read more at EOnline\n\n‘Step Up: High Water’ Team Credits Reality Competitions, ‘Glee’ With TV Interest In Dance – Based on the Step Up film franchise that grossed $650 million at the global box office, YouTube’s drama, Step Up: High Water focuses on several ambitious young dancers in a contemporary performing arts school in Atlanta. Dance dramas are a cyclical thing, series EP/director Adam Shankman insisted at TCA on Saturday, noting there have been “long periods” when there were no “dance-driven things being made for screen.” Shankman credits competition reality series Dancing with the Stars and So You Think You Can Dance, and “in no small way, Glee” with changing ideas about performance and music in scripted television. – Read more at Deadline", "images": ["data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%22125%22%20height%3D%22125%22%3E%3C%2Fsvg%3E", "data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%22635%22%20height%3D%22300%22%3E%3C%2Fsvg%3E", "data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%22960%22%20height%3D%22960%22%3E%3C%2Fsvg%3E", "https://pixel.quantserve.com/pixel/p-31iz6hfFutd16.gif?labels=Domain.mjsbigblog_com,DomainId.86320", "data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%22678%22%20height%3D%22381%22%3E%3C%2Fsvg%3E", "https://sb.scorecardresearch.com/p?c1=2&c2=20015427&cv=2.0&cj=1", "data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%221024%22%20height%3D%22819%22%3E%3C%2Fsvg%3E", "https://mjsbigblog.wpengine.com/wp-content/uploads/2018/01/Chris-Blue-MLK-Day.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20width%3D%2287%22%20height%3D%2218%22%3E%3C%2Fsvg%3E"], "top_img": "https://mjsbigblog.wpengine.com/wp-content/uploads/2018/01/Chris-Blue-MLK-Day.jpg", "keywords": [], "authors": ["About Mj Santilli", "Founder", "Editor Of Mjsbigblog.Com", "Home Of The Awesomest Fan Community On The Net. I Love Cheesy Singing Shows Of All Kinds", "Whether Reality Or Scripted.", "I Adore American Idol", "But Also Love The Voice", "Glee", "X Factor", "More"], "canonical_link": "https://www.mjsbigblog.com/headlines-chris-blue-davon-fleming-jordin-sparks-celebrate-mlk.htm", "title": "Headlines: Chris Blue, Davon Fleming, Jordin Sparks Celebrate MLK", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "og": {"title": "Headlines: Chris Blue, Davon Fleming, Jordin Sparks Celebrate MLK", "description": "MLK Day: Chris Blue headed Winter Haven Parade, Davon Fleming set to Grand Marshal Baltimore parade, Jordin Sparks guest hosts The View on Monday.", "image": "https://mjsbigblog.wpengine.com/wp-content/uploads/2018/01/Chris-Blue-MLK-Day.jpg", "locale": "en_US", "type": "article", "url": "https://www.mjsbigblog.com/headlines-chris-blue-davon-fleming-jordin-sparks-celebrate-mlk.htm", "site_name": "mjsbigblog"}, "description": "MLK Day: Chris Blue headed Winter Haven Parade, Davon Fleming set to Grand Marshal Baltimore parade, Jordin Sparks guest hosts The View on Monday.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "article": {"publisher": "https://www.facebook.com/mjsbigblog", "section": "Headlines", "published_time": "2018-01-14T10:51:07+00:00"}, "twitter": {"card": "summary_large_image", "description": "MLK Day: Chris Blue headed Winter Haven Parade, Davon Fleming set to Grand Marshal Baltimore parade, Jordin Sparks guest hosts The View on Monday.", "title": "Headlines: Chris Blue, Davon Fleming, Jordin Sparks Celebrate MLK", "site": "@mjsbigblog", "image": "https://www.mjsbigblog.com/wp-content/uploads/2018/01/Chris-Blue-MLK-Day.jpg", "creator": "@mjsbigblog"}, "fb": {"pages": 149167088472346}, "google-site-verification": "wdTD6pJAxAL5RV6bl6UFLJnMpNriD1vZNzZpCgHcAho", "msapplication-TileImage": "https://www.mjsbigblog.com/wp-content/uploads/2017/03/cropped-mjsbigblog-icon-2-270x270.jpg"}, "movies": [], "publish_date": 1515927067.0, "source": "https://www.mjsbigblog.com", "summary": ""}