{"url": "www.cosmopolitan.com/uk/entertainment/a13450106/kardashians-caitlyn-jenner-feud-timeline/", "text": "Remember when all the Kardashians and Jenners got on and life was much simpler?\n\nUs too. But now the back-and-forth shade between the three Kardashian sisters, Kris Jenner and her ex-husband Caitlyn Jenner is at an all time high.\n\nThrough a timeline of shade, we look back at what's been going on with America's most famous reality show family.\n\nThe family in 1995 Getty Images\n\nJune 2015: It all starts with the internet-breaking Vanity Fair interview - where she reveals her identity as Caitlyn to the world for the first time. Among the iconic pictures shot by Annie Leibowitz are comments about her relationship with Kris.\n\nVanity Fair\n\nFirstly the two disagree on how much Caitlyn had told Kris about her gender identity issues, the fact she had taken female hormones in the 1980s and also dabbled with cross-dressing.\n\nShe also says the breakdown of their 23-year marriage was down to \"20 per cent gender and 80 per cent [was] the way I was treated\".\n\nKris tells the magazine Caitlyn was \"miserable\" and \"pissed off\" during the last years of their marriage.\n\nAugust 2015: On Caitlyn's new E! show, I Am Cait, Khloe is seen visiting Caitlyn where she takes issue with her comments about Kris.\n\nCaitlyn tells Khloe sent her \"tough\" text messages, to which Khloe responds: \"I said we don't care what you're doing... we want to be there and support you but we don't think that entails you speaking negatively about my mum. In our opinion you don't even need to mention my mum. Let's focus on the actual cause here and not drag my mum through the mud.\"\n\nOctober 2015: Season 10 of Keeping up with the Kardashians shows Kris' reaction to the Vanity Fair interview and she is, shall we say, more explicit with her wording.\n\n\"He can go f*** himself,\" she cries down the phone to a deadpan Kim. \"I honestly wish I never met this man. I mean, just f*** you, Bruce.\"\n\nCaitlyn and Kris Jenner at the 2015 Victoria’s Secret show Getty Images\n\nKim tells the camera: \"All Caitlyn can talk about is that my mum mistreated her and was awful and all these really rude things, when there's no reason to bash my mum.\"\n\nNovember 2015: Khloe appears on the Ellen Show saying she had a particularly hard time accepting Caitlyn's transition because she found out on camera.\n\n\n\n\"We kept asking him, 'Bruce, like what's going on? We're hearing all these rumours?' and he kept telling us one thing but really he knew he was transitioning and wouldn't be honest with us.\n\n\"So really we felt like the last to know so that was hard for us, especially me.\"\n\nJanuary 2016: Khloe appears on the Howard Stern Show where she is very candid about a whole lot of things, including Caitlyn.\n\nSaying she found out about Caitlyn's transition at the same time that \"business people\" knew, despite repeatedly asking her whether the rumours about her transgender identity were true, she says she felt \"betrayed\".\n\n\"We felt so like, 'what the f***? We've been asking you and why do business people know?' I never want someone to feel like they have one-up on our family. We are a family. We've never turned our backs on each other yet with all the clusterf***s of s*** that's happened in our lives, why would we now?\n\n\"I don't give a f*** what you want to do - just stop lying to us about things... Just lay it on the table, what are we doing? What's happening? Even then he didn't tell us... we didn't know when he was going to start fully dressing as Caitlyn.\"\n\nMay 2016: It later turns out that Caitlyn was not ok with what Khloe said on Howard Stern, as was revealed on the season 12 premiere of KUWTK.\n\nAccording to Khloe, she was inundated with angry messages from Caitlyn after the interview so naturally she vented to matriarch Kris:\n\n\"I said, 'You slaughtered my mother and you have the nerve to say, 'What happened to family sticking together?' You jumped that ship as soon as you did Diane Sawyer and attacked my mum', and instead, [she] tells me to 'get a life' and 'shut up' and I'm like, 'you shut up and you get a f***ing life.\n\n\"... She can tell me to f*** off all she wants. I don't have a relationship with her. I'm done.\"\n\nLater in the episode, Kris is seen on the phone to Caitlyn trying to sort out the drama.\n\n\"She's out there talking s*** about me,\" Caitlyn vents to Kris about Khloe (bear with us). \"I don't want her talking about me, ok? You don't go on Howard Stern and call me a liar.\"\n\nAugust 2016: Caitlyn spends Father's Day with her youngest daughter Kylie watching basketball games. All seems well until she takes to Snapchat to joke about why Kylie is her favourite daughter.\n\nCaitlyn and Kylie in November, 2015 Getty Images\n\n\"Why, because it's Father's Day and she's the only one that invited me over,\" she tells her followers.\n\nAccording to Mail Online, Kim later said the rumours that all the siblings had abandoned Caitlyn on Father's Day were not true and that she had actually invited her for brunch.\n\nOctober 2016: Kris and Kim have an almighty row on KUWTK when Kris finds out that her daughter helped Caitlyn get ready for the ESPY awards in July, 2016.\n\nWhen Kim tells her mother she wanted to stay neutral between the estranged couple, Kris yells: \"I want loyalty. I don't want f***ing neutral. I'm trying to be as gracious as I can, I'm trying to be as understanding as I can. I'm betrayed. I've been f***ed over on so many levels that your head would spin.\"\n\nApril 2017: Things well and truly kick off when Caitlyn Jenner's tell-all book The Secrets of My Life is released.\n\nHere's a very brief rundown of the biggest reveals in it:\n\nCaitlyn says Kris had control over all the money the couple made from the show.\n\nApparently it was Caitlyn who came up with the idea of the show, not Kris. Ouch.\n\nShe says Kendall is the most down-to-earth of all the girls.\n\nThe Kardashians were not largely included in the Diane Sawyer documentary - which saw Caitlyn come out as transgender for the first time - because \"research shows that whenever a Kardashian is on television, many in the public tend to think it is a publicity stunt to make money\". Eek.\n\nThe Kardashians read the memoir and are not at all happy. In an episode of KUWTK Kris claims: \"Everything that she says is made up\" and claims the only nice thing Caitlyn had to say about her is that she's great at parties.\n\n\"I've never been so angry and disappointed in somebody in my whole life,\" Kris vented.\n\nAppearing on Late Night with Seth Meyers to promote the book, the co-author Buzz Bissinger responds, saying: \"Kris is full of s***\".\n\nLater in the month, Kim wades in telling The Ellen DeGeneres Show Caitlyn was not honest in the book about certain things to do with her mother.\n\n\"It's taken her a really long time to be honest with herself so I don't expect her to be honest with my Mum now. It's just so hurtful. I wish her all the success in the world but not at our expense,\" she says.\n\nCaitlyn also does another show with Diane Sawyer, where she says: \"Some [of my children] I have remained very close to. A couple of them... I'm a little more distant. I have to admit, I'll sit here and wonder, 'Is it because of my transitioning? Or is it because their life is so busy that they don't call, like all the time?'... Nobody calls that much. I mostly reach out to them. Obviously the Jenner side call more, but they have their own lives.\"\n\nMay 2017: Kim appears on 'Plead the Fifth' on Watch What Happens Live where Andy Cohen asks her the chances of Kris and Caitlyn ever speaking again.\n\n\"Zero, one, no, two per cent and those are Kendall and Kylie. All fair, I think,\" she said casually.\n\nOn KUWTK later in the month, Kim tells Kourtney that, in her book, Caitlyn is \"so angry with mum for no reason\".\n\nKourtney chimes in on Caitlyn's claim that the Kardashians were excluded from the Diane Sawyer documentary because the name is associated with publicity stunts, adding: \"That sounds pathetic.\"\n\nJune 2017: For the first time, Caitlyn's daughter Kendall also wades in on the book on KUWTK where she's seen slamming the table in frustration.\n\n\"I spoke to Kim about Dad's book and heard about all the stuff she was saying in it and how a lot of it is so not true,\" Kendall tells her mum Kris. \"The weird part is I don't think it's purposeful lying, I think she really just thinks that's what happened... and then she goes around dissing the Kardashians but those are the kids that you raised, if you have a problem with them you raised them.\n\n\"It makes no sense to me that she would go around bashing them for no reason, that's insane.\"\n\nKris calls the book a \"fabrication\" a few times, too.\n\nKim is also back again on the book, saying she has \"no respect\" for Caitlyn anymore.\n\nKendall, Caitlyn and Kylie Jenner in June, 2017 Getty Images\n\nAugust 2017: In an interview with The Hollywood Reporter, Kris rebukes the claim that it was Caitlyn who came up with the premise for the reality show that made the family the superstars they are today.\n\n\"It's so absurd,\" Kris says. \"I'm not sure what the motivation was for her to say something like that. Maybe somebody should remind her it's called Keeping up with the Kardashians.\"\n\nOooo. Burn.\n\nSeptember 2017: In the premiere of season 14 of KUWTK, Kim takes aim with another part of Caitlyn's book which suggested that her dad - the late Robert Kardashian who defended his friend OJ Simpson in the infamous 1992 murder trial - at one point believed OJ to be guilty.\n\n\"I have always had Caitlyn's back,\" Kim says. \"She is a liar. She is not a good person.\"\n\n\n\nCaitlyn then tells Good Morning Britain that she and Kim have not spoken in nine months.\n\n\"I love Kim so much, it's such a huge loss in my life not having her there anymore,\" she tells Piers Morgan and Susanna Reid. \"It's really sad.\"\n\nShe adds that \"the Kardashians, particularly Kris, didn't react that way [being proud of her book] even though I went overboard to be nice and friendly\".\n\nOctober 2017: The Kardashian siblings continue airing their thoughts on Caitlyn's book on KUWTK when Kim finds out about Caitlyn's gender reassignment surgery through the media.\n\nKhloe does not hold back with her comments - while on a private jet flying to Cleveland (as they do) - claiming that Caitlyn plays the victim.\n\n\"I'm the victim, I'm the victim, they don't want to see me. Oh f*** off and it's not because you're trans,\" Khloe vents. \"That's not why I'm not talking to you. I'm not talking to you because you're a bad, mean person.\"\n\nOoof.\n\nNovember 2017: Caitlyn's Jenner gives a talk at Cambridge University's union, and says the Kardashians have hurt her badly.\n\n\"It's been a little bit tough over the last couple of years on the Kardashian side,\" she says - which, in light of the above, is a bit of an understatement. She says she hasn't spoken to Kim in over a year and other recent reports in the The Sun claim she hasn't talked to Khloe in two years.\n\n\"They don't want me in their lives, they bashed me pretty badly. It's devastating when your kids do that. It really hurt... In the book I express some opinions and got shot down. It was not about the Kardashians. They were only mentioned on 20 pages. They made it more about them on television. The book was about my life. That's caused a lot of the separation between us.\"\n\nDecember 2017: Caitlyn reveals on Piers Morgan's Life Stories that she didn't trust his ex-wife or step-children with news of her gender reassignment surgery, as she thought they'd leak it to the press.\n\n\"They didn’t know that you had actually had the surgery?\", Morgan asked, when Jenner admitted to sending Kim a preview copy of her memoir The Secrets Of My Life, but removing the section about her surgery.\n\n\"No I didn’t tell anybody. Why? It’s none of their business\", Jenner responded. \"It’s not that big a deal. Nobody knows. I had to be honest, the book is about honesty. It’s called The Secrets Of My Life. No it really wasn’t a big deal. I had already been living as Caitlyn for a year and a half, ok, nobody knows anything. Because I didn’t want them to leak it to the press. There was no reason for them to know about it.\n\nAsked if she didn’t trust the Kardashians, she replied: ‘Of course not – of course I didn’t trust them.’\n\n", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2018-01-05-at-11-51-07-1515153081.jpg?crop=1.00xw:0.892xh;0,0.0313xh&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "http://www.cosmopolitan.com/sites/cosmopolitan/assets/images/logos/ipso_regulated_hires.png", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/caitlyn-kardashians-1510242218.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/caitlyn-kardashians-1510242218.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": ["Olivia Blair", "Digital News Editor", "Olivia Is Elle'S Digital News Editor Covering Pop Culture", "Royal", "Lifestyle", "Women'S News"], "canonical_link": "https://www.cosmopolitan.com/uk/entertainment/a13450106/kardashians-caitlyn-jenner-feud-timeline/", "title": "All the times Caitlyn Jenner has shaded the Kardashians and they've shaded her right back", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "All the times Caitlyn Jenner has shaded the Kardashians and they've shaded her right back", "description": "A lot of it centres around that memoir", "url": "https://www.cosmopolitan.com/uk/entertainment/a13450106/kardashians-caitlyn-jenner-feud-timeline/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/caitlyn-kardashians-1510242218.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 211620818858710}, "article": {"publisher": "https://facebook.com/cosmopolitanuk", "modified_time": "2018-03-27 05:14:38", "published_time": "2018-01-05 11:46:00", "section": "Entertainment", "opinion": "false"}, "twitter": {"site": "@CosmopolitanUK", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/caitlyn-kardashians-1510242218.jpg?crop=1.00xw:1.00xh;0,0&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "The Kardashians and Caitlyn Jenner - A timeline of them shading each other", "description": "A look at all the insults, shades and snide comments the Kardashian family and Caitlyn Jenner have exchanged over recent years/", "keywords": "Caitlyn Jenner feud with Kardashians, Caitlyn Jenner, Kardashians Caitlyn Jenner feud, Kendall Jenner, Khloe Kardashian, Kim Kardashian, Kourtney Kardashian, Kris Jenner, Kylie Jenner, Keeping up with the Kardashians", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/caitlyn-kardashians-1510242218.jpg?crop=0.501xw:1.00xh;0,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Entertainment,entertainment,Kardashians Caitlyn Jenner feud,Caitlyn Jenner,Khloé Kardashian,kris jenner,kendall jenner,kylie jenner,kim kardashian,kourtney kardashian", "sailthru.date": "2018-01-05T11:46:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/caitlyn-kardashians-1510242218.jpg?crop=1.00xw:1.00xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/caitlyn-kardashians-1510242218.jpg?crop=0.501xw:1.00xh;0,0", "sailthru.socialtitle": "All the times Caitlyn Jenner has shaded the Kardashians and they've shaded her right back", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1515123960.0, "source": "http://www.cosmopolitan.com", "summary": ""}