{"url": "https://www.elitedaily.com/p/kim-kardashian-tweeted-about-this-is-us-justin-hartley-had-a-hilarious-response-8314751", "text": "Is there anything better than a celebrity Twitter interaction? On Wednesday, we were treated to just that when Kim Kardashian tweeted about This Is Us and Justin Hartley, the man behind the very handsome Kevin Pearson, responded in the cutest way possible. Clearly, Hartley knows that a Kardasian-Pearson get together is the only thing that can make us feel better about This Is Us' Olympics hiatus.\n\n\"I'm starting to watch This Is Us. Who watches it? Is it good?\" tweeted the reality star and makeup mogul late Wednesday night. Kim is obviously a little late to the game here — This Is Us premiered in the fall of 2016 and the entire world has been obsessed with it ever since — but can you blame her? I mean, she's got a new baby, a new niece, and a very pregnant sister, so Kim doesn't really have a lot of time for TV.\n\nBut in came Hartley, who was ready to answer all of Kim's questions like the Scott Rogowsky of TV trivia. Hartley quote tweeted Kim's original question, writing, \"I watch it. I think it's worth a look. If it were me, I would watch it from the beginning. A good time to start if you ask me. Not too along in the series yet enough episodes to binge if you feel. You’ll laugh, you’ll cry…#ThisIsUs.\" Well played, Justin, well played.\n\nThis isn't Kevin Pearson's first interaction with the Kardashian family, either. Remember the line about the Kardashians in the This Is Us Season 2 premiere?\n\nThe Kardashians aren’t going anywhere… I promise. They're like gremlins — there will be a million more of them tomorrow.\n\nKevin's comment was both a serious prediction — maybe he can make some money on the side as a fortune teller? — and a jab at his then-girlfriend Sophie's Kardashian-loving tendencies. Of course, Twitter freaked out at the time, especially because the Big Three, Kevin, Kate, and Randall, were celebrating their birthday in an episode that premiered during peak Kardashian pregnancy mania. September was a crazy time.\n\nThere seems to be a lot of Kardashian-This Is Us crossover these days, but don't expect to see any of the sisters (or Rob — you can't forget about Rob!) in the rest of Season 2. There are only three episodes of This Is Us left this season, and the producers have a lot to explain after the devastating Super Bowl episode that finally told us how Jack dies. The post-Olympics promo promises fans that Jack's story is just beginning, and Milo Ventimiglia has echoed this sentiment. Ventimiglia told Entertainment Weekly that \"there's still so much more to know about this guy,\" and he promised that as the show moves forward, so will Jack:\n\nThis is episode 14, so that’s only the 32nd hour we’ve ever known this family. So now, if Jack died in 1998, when the kids are 17, there’s still a lot to know — different sides of him, what made him, what shaped him, what inspired his romance with his wife, what happened with he and his brother in war…. That we’ve invested as much as we have as an audience in 32 hours is pretty remarkable. There’s a lot of life left in him — even in death, there’s a lot of life left in Jack.\n\nWhew. A world without Jack Pearson is not a world we want to live in.\n\nIn addition to learning about Jack's Vietnam War experience with his brother, we'll also see Kate and Toby throw their bachelor and bachelorette parties, and from the look of the promo, things are going to get rowdy. After the Super Bowl episode, we wouldn't mind a little more fun and a little less heartbreak on This Is Us.\n\nThis Is Us on YouTube\n\nThis Is Us returns on Tuesday, Feb. 27 at 9 p.m. ET on NBC.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/image/2020/4/7/e1a899a8-84f5-4f2d-aa3a-0f268919da9f-screen-shot-2020-04-07-at-80218-am.png?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/2/23/82d607b0-449f-4f39-ba3d-e454d7099a51-screen-shot-2018-02-23-at-35813-pm.png?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/8/0401853e-e9ba-4e6b-b450-eed46d27aaed-lead-image-5.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2018/2/23/82d607b0-449f-4f39-ba3d-e454d7099a51-screen-shot-2018-02-23-at-35813-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/9/069fdfe3-d829-477e-9562-dcba704bddcb-getty-530047400.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/uploads/image/2018/2/23/82d607b0-449f-4f39-ba3d-e454d7099a51-screen-shot-2018-02-23-at-35813-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/kim-kardashian-tweeted-about-this-is-us-justin-hartley-had-a-hilarious-response-8314751", "title": "Kim Kardashian Tweeted About 'This Is Us' & Justin Hartley Had A Hilarious Response", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/kim-kardashian-tweeted-about-this-is-us-justin-hartley-had-a-hilarious-response-8314751", "type": "article", "title": "Kim Kardashian Tweeted About 'This Is Us' & Justin Hartley Had A Hilarious Response", "description": "Is there anything better than a celebrity Twitter interaction? On Wednesday, we were treated to just that when Kim Kardashian tweeted about This Is Us and Justin Hartley, the man behind the very handsome Kevin Pearson, responded in the cutest way…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/2/23/82d607b0-449f-4f39-ba3d-e454d7099a51-screen-shot-2018-02-23-at-35813-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "Is there anything better than a celebrity Twitter interaction? On Wednesday, we were treated to just that when Kim Kardashian tweeted about This Is Us and Justin Hartley, the man behind the very handsome Kevin Pearson, responded in the cutest way…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}