{"url": "www.mercurynews.com/2018/04/12/alex-rodriguez-slams-report-hes-threatening-to-cut-child-support-payments/", "text": "Alex Rodriguez flatly denied a report that claimed he was threatening to cut child-support payments for his two daughters over a legal dispute with his ex-wife’s brother.\n\n“I have always paid far more than the maximum in child support and that will never change,” the former New York Yankees star said in a statement to Page Six.\n\n“It’s highly offensive to me that my former brother-in-law, who has been trying to pursue a frivolous case against me for four years and has gotten absolutely nowhere with it in court, is misrepresenting my relationship with my daughters to manipulate the public’s opinion,” he added.\n\nThe report Wednesday in the New York Daily News came soon after it was learned that A-Rod had just purchased a $15 million Manhattan apartment with girlfriend Jennifer Lopez.\n\nAccording to the Daily News report, Rodriguez told his ex-wife Cynthia that he would cut his support payments for daughters Natasha, 13, and Ella, 9, over a legal dispute with her brother, Constantine Scurtis.\n\nA-Rod’s alleged threat was meant to send a message to Scurtis, the Daily News added.\n\nCynthia had texted her brother, explaining: “I’m just trying to defend my child support situation … and it’s terrible.”\n\nShe continued, “I have an email from (Rodriguez) telling me that he’s basically making me pay for not stopping you and telling you that I hate you.”\n\nThe tension Cynthia is referring to is a four-year legal battle between Rodriguez and her brother.\n\nScurtis sued his ex brother-in-law in 2014, claiming he was pushed out of the real estate company they founded together when his sister’s marriage began to fail, the Daily News said. The lawsuit accuses Rodriguez of mortgage and insurance fraud, among other things.\n\n“He’s totally out of control,” Cynthia said in another text, “but I share 2 kids with him so I try to keep e (sic) everything good for them.”\n\n“I hope it all ends soon. It’s revolting,” Cynthia added.\n\nRodriguez and Cynthia divorced in 2008 after six years of marriage. The Daily News pointed out that Rodriguez definitely isn’t hurting for cash. He was paid $21 million by the Yankees in 2016 — the final year of his 10-year, $275 million contract — without having to play. He currently has a gig as part of ESPN’s “Sunday Night Baseball” team.\n\nIt’s unclear how much money Rodriguez is required to pay each month for child support, the Daily News said.\n\nHe and Lopez started dating in February 2017, and the two have been high-profile about their coupledom. They sometimes post photos of their newly blended family which consists of his kids and hers; she has 10-year-old twins Max and Emme with her ex-husband Marc Anthony.\n\nRodriguez expressed disgust at the way his former brother-in-law was using his daughters in an effort to turn the media against him for his own gain. Related Articles Ah, Bennifer! Ben Affleck and Jennifer Lopez still like to vent about their infamous tabloid romance\n\nJennifer Lopez pledges $1 million to help Puerto Rico recover from Hurricane Maria\n\nJennifer Lopez hired private detective to check out Alex Rodriguez cheating allegations, report says\n\nAlex Rodriguez was nice but not ‘intellectual,’ Anne Wojcicki’s mom says in interview\n\nJennifer Lopez and Alex Rodriguez on romantic getaway\n\nHe told the Post: “I may have not been perfect in the past, but I am very proud of who I am, and how I live my life now and it is important to me that my daughters feel the same way.”\n\nHe said he wouldn’t have even responded to such “false” accusations were it not for his daughters. “I would never want them to think this is true,” he said. “Unfortunately, however, there are some people who would do anything for money, except work.”", "images": ["https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg", "https://www.mercurynews.com/wp-content/uploads/2018/04/rodriguezlopez.jpg?w=1024&h=683", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2018/04/rodriguezlopez.jpg?w=1024&h=683", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2018/04/12/alex-rodriguez-slams-report-hes-threatening-to-cut-child-support-payments/", "title": "Alex Rodriguez slams report he’s threatening to cut child support payments", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "Alex Rodriguez, who recently purchased a $15 million apartment with Jennifer Lopez, slammed report he's trying to cut child support for his two daughters.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Alex Rodriguez slams report he’s threatening to cut child support payments", "url": "https://www.mercurynews.com/2018/04/12/alex-rodriguez-slams-report-hes-threatening-to-cut-child-support-payments/", "description": "Alex Rodriguez, who is dating Jennifer Lopez, said his two daughters are his no. 1 priority.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2018/04/rodriguezlopez.jpg?w=1024&h=683", "width": 1024, "height": 683}, "locale": "en_US"}, "article": {"published_time": "2018-04-12T13:37:14+00:00", "modified_time": "2018-04-12T17:15:10+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Alex Rodriguez slams report he’s threatening to cut child support payments"}, "image": "https://www.mercurynews.com/wp-content/uploads/2018/04/rodriguezlopez.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1523462400.0, "source": "http://www.mercurynews.com", "summary": ""}