{"url": "https://www.hollywoodreporter.com/live-feed/agents-shield-season-5-finale-explained-is-coulson-dead-clark-gregg-interview-1113016", "text": "[This story contains spoilers from Agents of SHIELD's season five finale, \"The End.\"]\n\nThere is no Agents of SHIELD without Phil Coulson ... or is there? Clark Gregg's fan-favorite character from the Marvel Cinematic Universe helped launch the comic book powerhouse on TV with the ABC drama five years ago. But Friday's season five finale seemingly did the unthinkable and killed off the SHIELD agent turned director in a move that many expected but few thought would come to pass.\n\nFaced with an impossible choice in \"The End,\" Coulson opted to sacrifice his life and succumb to the fate he accepted when he made a deal with Ghost Rider (Gabriel Luna) in season four. He knew his body was dying yet refused to take the Centipede serum that would have saved him. Instead, he gave the lone dose to Daisy (Chloe Bennet) to use in order to defeat Talbot (Adrian Pasdar) and save the world from being cracked to pieces. (For those keeping score at home, that was the future that SHIELD saw in the first half of the season.) Coulson was resigned to his fate. But just as viewers were coming to terms with the loss of SHIELD's star, the Marvel drama delivered a second blow that decimated the team.\n\nIn the chaos caused by Talbot in his mission to obtain more gravitonium by sucking it out from underneath the Earth's crust, Fitz (Iain De Caestecker) turned hero as Chicago was attacked. However, he suffered a fatal injury and died as Mack (Henry Simmons) and May (Ming-Na Wen) could only watch. Simmons (Elizabeth Henstridge) had to learn of her husband's fate from Mack.\n\nThe hour ended on an emotional note as Coulson said his goodbyes to the team before stepping onto the sand in Tahiti to live out his final weeks with May before his body died. Daisy handed the reins of SHIELD to Mack, and the new, smaller team set out on its next adventure.\n\n\n\nSHIELD went into Friday's season finale promising one death but delivered two. With Coulson possibly still alive before his clock runs out — depending on if the series employs a time jump for its recently ordered sixth (and abbreviated) season, THR spoke with Gregg about his future with the Marvel drama and how the MCU may play a larger role.\n\nThe golden rule of TV is if a character dies but it isn't shown onscreen, then they're not really dead. That said, is Coulson really dead or is there a way that he can be cured in time for the abbreviated sixth season next year?\n\nMy understanding is that Phil Coulson is no longer alive. He's been brought back, he's been really clear that he didn't want supernatural measures used again. I always felt like he thought almost like he wasn't supposed to be here. That got more complicated for him when he started to form this new family and to have this surrogate daughter that he probably always wanted and to, in the most recent weeks of this SHIELD timeline, really opened himself up to his feelings for Melinda May. But I don't think there is a real buy-back for the fact that this deal he made with the Ghost Rider is killing his body.\n\nHow much have you discussed your future on the series with producers?\n\nI have a meeting with [executive producers] Jed Whedon and Maurissa Tancharoen and the showrunners and I know there is some interest in having me involved in this 13-episode season six. I don't know in what form that will take, whether that will be flashbacks or hopefully some sexy dreams that Melinda May is having. [Laughs.] That would be nice. But that's all I know so far. There is some desire that is going to be explained to me but it's why this finale is so deep and emotional. I knew by then that this was really a farewell to that character and his life. It was also before we knew anything about whether or not we were picked up so the scene where he is saying goodbye to people was a scene that we couldn't even rehearse or read aloud successfully. We just had to figure out where we were going to stand and start shooting it because it was just so emotional for me and everybody there.\n\nWith these plans to continue having Coulson on the series in some capacity, does that mean you'll be returning as a series regular next season?\n\nThat's all what's going to be part of this discussion and working it out. I'm available for whatever they need me to do and we'll just be figuring it out. We just got picked up a few days ago. That's what we'll have to figure out going forward. I hope to be involved, maybe I'll be an LMD or maybe I'll be in a C3P0 suit and I'll be everybody's starchy Brit robot.\n\nWhat did you think of Coulson's goodbye in the finale, where he finally got to go to Tahiti and share that experience with May?\n\nI found it all so moving. I've been playing this guy for 10 years now. In between shooting that stuff I was back shooting Captain Marvel with Brie Larson and Sam Jackson and playing him again in the '90s so extending his timeline even further, and the membrane between the two of us, although we're in some ways very different, it's very thin. And my connection with the people on Agents of SHIELD and the number of hours we've all put in together and what we've all been through together, it feels very real. All of it, saying goodbye to those people, was very heavy. And then to step out onto the sands of Tahiti, I really have to thank ABC again for giving us the Disney jet and letting us have this really magical weekend in Tahiti. I'm just kidding. [Laughs] But that would have been nice. I loved the way they did it. I really thought it was a masterful idea by the writers of SHIELD and a really beautifully executed script by Jed and Maurissa and really beautifully directed by Jed.\n\nUnlike Coulson's sunny yet bittersweet goodbye and ambiguous ending, Fitz died onscreen in a traumatic, sudden fashion. Coulson's death has been hinted at all season, yet no one saw this coming. What did you think of how the producers wrote in that twist?\n\nIt really caught us all by surprise. Even in the table read, we read the scripts together before we start shooting them and it was one where we just had to say it like robots and move through it. We knew how devastating it would be. Everyone shooting it and fans, no one sees it coming. Iain has created this incredibly complex and beloved character in Fitz that everyone cares about so much. We were rooting for him and Simmons, they just got married. I think it's going to really knock people down. I'm scared to watch it. I haven't seen it yet and I'm nervous about watching this episode.\n\nSHIELD won't return until summer 2019 — which is after Avengers 4 comes out. How might that affect the story that SHIELD can tell? Can it connect with the MCU, especially knowing how Infinity War ended with that game-changing cliffhanger?\n\nIt's a relief in a way because at some point, if it wasn't done that way, they were going to have to deal with the devastating snap of Thanos' [Josh Brolin] fingers. I don't know what happens in the second half [in Avengers 4]. As a fan I'm eager to know. We've got Ant-Man and the Wasp, Captain Marvel coming out and the second Infinity War before Agents of SHIELD becomes a summer show. There are so many unknown quantities in that question that I don't really have a good answer.\n\nRegardless of what happens with you on SHIELD, this isn't the last time you're playing Coulson since you're returning to the MCU with Captain Marvel. What was that like playing a younger version of Coulson in the '90s and giving him an origin story in the film universe after inhabiting this more experienced character on a weekly basis?\n\nIt was such a gift, such a sweet gift, from [Captain Marvel directors] Anna Boden and Ryan Fleck and [Marvel's] Kevin Feige and Louis Esposito to get this call saying Coulson is very much around in this story and get to spend time as this guy in a completely different phase in his career with such an incredible bunch of characters and storyline that includes Skrulls, which is a really cool thing from the comics. So I was thrilled about it. I'm having the time of my life.\n\nWhat was your favorite part about the Agents of SHIELD finale?\n\nIt's a really full-circle conclusion that I think will be heartbreaking but really powerful for the people who have gone on the ride with us from the beginning.\n\nAgents of SHIELD will return for season six in 2019.", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/09/qd3ii-x2.jpeg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/01/greg_berlanti_sharon_horgan_alex_kurtzman_and_dwayne_johnson_-_getty_-_h_2020.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/2018/05/marvels_agents_of_s.h.i.e.l.d._s05e21_still.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/03/mrs._america_-_publicity_still_1-_h_2020_.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/blogicon_livefeed-black2.png", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2018/05/marvels_agents_of_s.h.i.e.l.d._s05e21_still.jpg"], "top_img": "https://cdn1.thr.com/sites/default/files/2018/05/marvels_agents_of_s.h.i.e.l.d._s05e21_still.jpg", "keywords": [], "authors": ["Sydney Bucksbaum", "Thrnews Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/live-feed/agents-shield-season-5-finale-explained-is-coulson-dead-clark-gregg-interview-1113016", "title": "'Agents of SHIELD' Star Clark Gregg on the Tragic Season 5 Finale", "meta_data": {"viewport": "width=device-width", "description": "The star of ABC's Marvel drama weighs in on if he'll return for the recently announced sixth season, coming next year.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/live-feed/agents-shield-season-5-finale-explained-is-coulson-dead-clark-gregg-interview-1113016", "domain": "https://www.hollywoodreporter.com/", "title": "'Agents of SHIELD' Star Clark Gregg on the Tragic Season 5 Finale", "description": "The star of ABC's Marvel drama weighs in on if he'll return for the recently announced sixth season, coming next year.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2018/05/marvels_agents_of_s.h.i.e.l.d._s05e21_still.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "'Agents of SHIELD' Star Clark Gregg on the Tragic Season 5 Finale", "description": "The star of ABC's Marvel drama weighs in on if he'll return for the recently announced sixth season, coming next year.", "url": "https://www.hollywoodreporter.com/live-feed/agents-shield-season-5-finale-explained-is-coulson-dead-clark-gregg-interview-1113016", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2018/05/marvels_agents_of_s.h.i.e.l.d._s05e21_still.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "'Agents of SHIELD' Star Clark Gregg on the Tragic Season 5 Finale", "sailthru.description": "The star of ABC's Marvel drama weighs in on if he'll return for the recently announced sixth season, coming next year.", "sailthru.author": "Sydney Bucksbaum", "sailthru.channel": "Live Feed", "sailthru.vertical": "Live Feed", "sailthru.date": "2018-05-18 19:00:00", "sailthru.tags": "Live Feed, Television, Clark Gregg, Marvel&#39;s Agents of S.H.I.E.L.D."}, "movies": [], "publish_date": 1526641200.0, "source": "https://www.hollywoodreporter.com", "summary": ""}