{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/06/03/bill-maher-faces-calls-for-firing-after-using-the-n-word-on-his-hbo-show/", "text": "Maher’s apology, sent through his publicist, was over an exchange he had with Sen. Ben Sasse (R-Neb.) on his show “Real Time.” Maher was talking to Sasse about the senator’s book, “The Vanishing American Adult,” which explores why today’s young people are unable to survive in a competitive global economy. The conversation drifted to Halloween and how dressing up is no longer just a children’s tradition. Sasse said adults don’t do that quite as much in his state because it’s frowned upon. In response, Maher said he should visit Nebraska more.\n\nAD\n\nAD\n\n“We’d love to have you work in the fields with us,” Sasse said.\n\n“Work in the fields? Senator, I’m a house n—–,” Maher said, raising both of his hands up. “No it’s — it’s a joke.”\n\nBill Maher just said the n word, @BenSasse didn't look horrified, and the audience applauded. pic.twitter.com/kFAs1S3dyM — Yashar Ali 🐘 (@yashar) June 3, 2017\n\nThe audience cheered. A smiling Sasse didn’t say anything about the comments, and the conversation moved forward.\n\nIn a statement sent to media outlets, HBO called Maher’s remarks “inexcusable and tasteless” and said the cable network will remove that segment from future airings of the show.\n\nBlack Lives Matter activist DeRay Mckesson and Jack Posobiec, a Trump supporter who wrote for the right-wing site Rebel Media, have called for Maher to be fired. #FireBillMaher is circulating on Twitter.\n\nAD\n\nAnd why did the audience think it was okay to laugh? And Ben Sasse doesn't even flinch. What is happening in the world? — deray (@deray) June 3, 2017\n\nOther personalities who’ve weighed in, however, came to his defense. CNN host Larry King said he’s been Maher’s friend for years and assured “there’s not a racist bone” in the comedian’s body.\n\nAD\n\n“Let’s accept his apology and move on,” King added.\n\nJust saw @billmaher \"racist joke\" and I have to say...fuck everybody who's pissed. Comedians save us, jokes. politicians kill us. Wars, laws — Christopher Titus (@TitusNation) June 3, 2017\n\nSinger-songwriter Duncan Sheik implored on Maher to learn from his mistake.\n\nI Love the @billmaher show and watch it \"religiously\". Bill, please see the error of your glib quip. Not remotely funny or cool, mate. — Duncan Sheik (@TheDuncanSheik) June 4, 2017\n\nSome turned to humor:\n\nToday is the day Bill Maher became president. — Michael Ian Black (@michaelianblack) June 3, 2017\n\nSasse also was criticized for his reaction, or lack thereof. In a series of tweets Saturday, Sasse talked about how he should’ve reacted.\n\n“Here’s what I wish I’d been quick enough to say in the moment: “Hold up, why would you think it’s OK to use that word? The history of the n-word is an attack on universal human dignity. It’s therefore an attack on the American Creed. Don’t use it,” Sasse wrote.\n\nAD\n\nBut he also said that he’s a strong advocate of the First Amendment, and comedians “get latitude to cross hard lines.”\n\nAm walking off a redeye from LAX.\n\n3 reflections on @billmaher\n\n1. I’m a 1st Amendment absolutist. Comedians get latitude to cross hard lines. — Ben Sasse (@BenSasse) June 3, 2017\n\nMaher, who’s on his 15th season hosting “Real Time,” drew criticism earlier this year when he interviewed Milo Yiannopoulos, the controversial former Breitbart editor known for making inflammatory comments about Muslims, women and minorities. Maher had defended his decision, saying inviting Yiannopoulos on his show brought his views under scrutiny, according to the Los Angeles Times.\n\nAD\n\nIn 2014, Maher was accused of hate speech when he said it’s wrong to say only “a few bad apples” in the Muslim community have extremist beliefs.\n\nIslam is “the only religion that acts like the mafia, that will f—— kill you if you say the wrong thing, draw the wrong picture, or write the wrong book,” Maher said during an episode on “Real Time” with atheist scholar Sam Harris and actor Ben Affleck.\n\nAD\n\nFollowing his comments, students at the University of California in Berkeley petitioned to get Maher disinvited as a commencement speaker at a graduation in December 2014. Thousands signed an online petition calling his remarks bigoted and racist and pushing for Maher’s removal as speaker.\n\nIn response to the students, Maher said he still planned to go.\n\nPlease @HBO Do Not Air Another Episode Of Real Time With Bill Maher. — Chance The Rapper Owbum 📅 (@chancetherapper) June 3, 2017\n\n“Whoever told you you only had to hear what didn’t upset you?” Maher said, adding later: “I promise this will be your day. This is a commencement speech. The issue is you … My reputation isn’t on the line. Yours is.”\n\nAD\n\nIn 2001, Maher apologized after a controversial comment he made on his ABC show prompted companies to pull their ads. In criticizing United States military action after the Sept. 11, 2001 attacks, he said, “We have been the cowards lobbing cruise missiles from 2,000 miles away. That’s cowardly.”\n\nAD\n\nMaher later said he was referring to the government, not to individual soldiers.\n\n“In no way was I intending to say, nor have I ever thought, that the men and women who defend our nation in uniform are anything but courageous and valiant, and I offer my apologies to anyone who took it wrong,” he said.\n\nABC fired Maher afterward.\n\nCritics of Maher’s most recent comments were quick to draw parallels between him and another comedian, Kathy Griffin, who was recently slammed for a photo of her holding a mask resembling President Trump’s bloody, severed head.\n\nAD\n\nBill Maher and Kathy Griffin showed this week that racism can't be hidden as \"comedy\" and stupidity can't be hidden as \"art\". — Tony Posnanski (@tonyposnanski) June 3, 2017\n\nGriffin has since removed the image and apologized, saying she went too far. But five employers had canceled shows, and CNN had fired Griffin from her longtime New Year’s Eve co-host job.\n\nAD\n\nOn Friday, a defiant and tearful Griffin said that although she regretted the photo, she wasn’t going to stop criticizing the president.\n\n“A sitting president of the United States and his grown children and the first lady are personally trying to ruin my life forever,” Griffin said. “You guys know him, he’s not going to stop.”\n\nIn a tweet addressing Maher and Griffin, Cornell William Brooks, president of the NAACP, said: “Great comedians make us think & laugh. When our humanity is the punchline, it hurts too much to think or laugh.”\n\nThis story, originally published on June 3, 2017, has been updated.\n\nKatie Mettler and Cleve Wootson Jr. contributed to this story.\n\nAD\n\nAD", "images": ["https://www.washingtonpost.com/resizer/0DnRxFJTQWn0hBEedElEzbHSxQM=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DBQIEPERQE3MRBXVXJX3ZHMQQY.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/c6a5c81c-3382-40e6-8231-fcfb2d41a328.png&w=90&h=90"], "top_img": "https://www.washingtonpost.com/resizer/0DnRxFJTQWn0hBEedElEzbHSxQM=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DBQIEPERQE3MRBXVXJX3ZHMQQY.jpg", "keywords": [], "authors": ["Kristine Phillips", "Reporter Covering National", "Breaking News"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/06/03/bill-maher-faces-calls-for-firing-after-using-the-n-word-on-his-hbo-show/", "title": "Bill Maher says he is ‘very sorry’ for using a racial slur on his HBO show", "meta_data": {"description": "\"The word was offensive and I regret saying it and am very sorry,\" Bill Maher said in a statement.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/06/03/bill-maher-faces-calls-for-firing-after-using-the-n-word-on-his-hbo-show/", "image": "https://www.washingtonpost.com/resizer/0DnRxFJTQWn0hBEedElEzbHSxQM=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DBQIEPERQE3MRBXVXJX3ZHMQQY.jpg", "title": "Bill Maher says he is ‘very sorry’ for using a racial slur on his HBO show", "description": "\"The word was offensive and I regret saying it and am very sorry,\" Bill Maher said in a statement."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Bill Maher says he is ‘very sorry’ for using a racial slur on his HBO show", "description": "\"The word was offensive and I regret saying it and am very sorry,\" Bill Maher said in a statement."}, "last_updated_date": "2019-04-21T21:38:57.261Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1496419200.0, "source": "https://www.washingtonpost.com", "summary": ""}