{"url": "https://www.thedailybeast.com/is-elsa-really-getting-a-girlfriend-in-frozen-2-dream-on-disney-fans", "text": "There is a snowman’s chance in hell that Disney will give Elsa a girlfriend in Frozen 2.\n\nAnd yet, thanks to a vague new comment from Frozen 2 co-director Jennifer Lee, LGBT Disney fans are probably going to get their hopes up once again, only to watch them melt.\n\n“I love everything that people are saying [and] people are thinking about with our film—that it’s creating dialogue, that Elsa is this wonderful character that speaks to so many people,” Lee told HuffPost in a recent interview, when asked about the prospect of Elsa getting a girlfriend. “It means the world to us that we’re part of these conversations.”\n\nLee followed up that response with a lengthy comment that barely amounts to a “maybe” when read carefully: “Where we’re going with it, we have tons of conversations about it, and we’re really conscientious about these things. For me…Elsa’s every day telling me where she needs to go, and she’ll continue to tell us. I always write from character-out, and where Elsa is and what Elsa’s doing in her life, she’s telling me every day. We’ll see where we go.”\n\nHuffPost correctly labeled that noncommittal response a “glimmer of hope” for the #GiveElsaAGirlfriend campaign, which sprouted up on social media in 2016. Others have been more generous in their assessment: “Ring The Alarm!” BuzzFeed declared. “Elsa Might Have A Girlfriend In The ‘Frozen’ Sequel.” But it’s safe to say that we can un-ring that bell. If you think there’s a serious chance Elsa will find same-sex love in Arendelle, it’s probably best to let that hope go. Disney has been down this road before.\n\n“ For the last few years now, Disney has walked a delicate tightrope between not shutting down LGBT fans who want to see better representation in their films and not pissing off homophobic viewers. ”\n\nRemember when eagle-eyed fans spotted a lesbian-looking couple in the Finding Dory trailer, creating mounting speculation that we’d see definitively LGBT representation in a Pixar movie, only for the film’s co-director to give the cop-out answer, “They can be whatever you want them to be?”\n\nOr when the director of the live-action Beauty and the Beast remake promised an “exclusively gay moment,” angering social conservatives, only for Gaston’s sidekick LeFou to be briefly spotted dancing with another man in the film’s finale? (As my Daily Beast colleague Kevin Fallon wrote, “Truth be told, the most exclusively gay moment in this new Beauty and the Beast is my dramatic eye roll after seeing the actual thing.”)\n\nDisney’s biggest PG-13 property has disappointed LGBT fans as well.\n\nIn 2016, director J.J. Abrams told The Daily Beast that he “would love it” if there were a gay character in Star Wars and that “it seems insanely narrow-minded and counterintuitive to say that there wouldn’t be a homosexual character in that world.” Yet there are still no confirmed gay people to be found in the new films—despite some fans’ rigorous shipping of Finn and Poe. (And now that yet another Star Wars trilogy has been announced, there will be three more opportunities to depict a galaxy far, far away where, apparently, gay people either do not exist or live in hiding.)\n\nFor the last few years now, Disney has walked a delicate tightrope between not shutting down LGBT fans who want to see better representation in their films and not pissing off homophobic viewers. There’s no reason to expect them to stop toeing that line until it’s safe for the film giant to throw their full weight behind the LGBT community.\n\nAs the LGBT media advocacy group GLAAD noted in 2017, Walt Disney Studios “has the weakest historical record when it comes to LGBTQ-inclusive films” out of all the big studios. Disney’s got a family-friendly reputation to protect, and at a time when many Americans still think that children need to be protected from LGBT “corruption”—37 percent of respondents to one recent GLAAD survey, for example, said they would be uncomfortable with their child learning about LGBT history in school—a lesbian or bisexual Snow Queen is probably perceived as an unnecessary financial risk.\n\nAccording to Fast Company writer Joe Berkowitz, the “most family-friendly studio on the planet would be inviting a boycott” if they gave Elsa a girlfriend—so why sell fewer tickets to a guaranteed smash hit when you can sell more?\n\nAnd when Disney already caused an uproar among anti-LGBT evangelicals five years ago with Elsa’s nonspecific, feel-good song lyrics about “let[ting] it go” and “break[ing] through,” why would they double down this time around when they are sure to be under scrutiny?\n\nThe parallel isn’t perfect, of course, but I always think about the interracial couple in The Princess and the Frog whenever LGBT fans seem to think the moment for a queer Disney character has finally arrived. According to Gallup polling data, a majority of Americans have approved of marriage between black people and white people since 1997, and over 75 percent have approved since 2004, but Disney still waited until 2009, when support was over 80 percent, to tell the story of Tiana and her prince. That’s the definition of playing it safe.\n\nSo, if we speculate that Disney would wait to include an LGBT main character in an animated film until they only risked angering fewer than 20 percent of American viewers, then we’ve still got a ways to go yet. As of 2017, according to Gallup, only 64 percent of Americans now support same-sex marriage, up from 42 percent in 2004. If approval continues to climb at that exact same rate, it will hit the 80 percent mark in…17 years—probably about the same time that Frozen 7: Olaf’s Revenge comes out.\n\nIt would be nice if Disney, like Elsa, could proclaim, “Let the storm rage on” and march forward. But if history is any indication, Frozen 2 will almost certainly give hopeful LGBT fans the cold shoulder.", "images": ["https://img.thedailybeast.com/image/upload/c_fill,h_200,w_200,x_0,y_0/v1489782093/author/140730-samantha-allen-author.jpg", "https://img.thedailybeast.com/image/upload/v1550872986/White2x_hcwpd6.png", "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1520022307/180302-allen-elsa-tease_toxvif", "https://img.thedailybeast.com/image/upload/v1549916286/logo_km2qs4.png", "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_1.5/c_limit,w_1044/fl_lossy,q_auto/v1520022307/180302-allen-elsa-tease_toxvif"], "top_img": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1520022307/180302-allen-elsa-tease_toxvif", "keywords": [], "authors": ["Samantha Allen"], "canonical_link": "https://www.thedailybeast.com/is-elsa-really-getting-a-girlfriend-in-frozen-2-dream-on-disney-fans", "title": "Is Elsa Really Getting a Girlfriend in ‘Frozen 2?’ Dream On, Disney Fans", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "title": "Is Elsa Really Getting a Girlfriend in ‘Frozen 2?’ Dream On, Disney Fans", "keywords": "LGBT, Disney, Star Wars, Opinion", "og": {"title": "Is Elsa Really Getting a Girlfriend in ‘Frozen 2?’ Dream On, Disney Fans", "description": "Walt Disney Studios has the weakest LGBT record among the major studios. So don’t fall for the promises of gay characters in ‘Frozen 2’ and ‘Star Wars.’", "url": "https://www.thedailybeast.com/is-elsa-really-getting-a-girlfriend-in-frozen-2-dream-on-disney-fans", "site_name": "The Daily Beast", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1520022307/180302-allen-elsa-tease_toxvif"}, "description": "Walt Disney Studios has the weakest LGBT record among the major studios. So don’t fall for the promises of gay characters in ‘Frozen 2’ and ‘Star Wars.’", "authors": "Samantha Allen", "wrap": "/content/dailybeast/entertainment", "article": {"section": "entertainment", "published_time": "2018-03-02T20:15:36.000Z", "author": "https://www.thedailybeast.com/authors/samantha-allen"}, "fb": {"app_id": 189930913679}, "twitter": {"card": "summary_large_image", "site": "@thedailybeast", "creator": "@SLAwrites", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_600/f_jpg/fl_lossy,q_auto/v1520022307/180302-allen-elsa-tease_toxvif"}, "sailthru.date": "2018-03-02T20:15:36.000Z", "sailthru.expire_date": "2018-03-16T20:15:36.000Z", "publicationDate": 201803022015, "parsely-page": "{\"author\":\"Samantha Allen\",\"link\":\"https://www.thedailybeast.com/is-elsa-really-getting-a-girlfriend-in-frozen-2-dream-on-disney-fans\",\"metadata\":{\"articleType\":\"article\",\"rubric\":\"WISHFUL THINKING\"},\"post_id\":\"is-elsa-really-getting-a-girlfriend-in-frozen-2-dream-on-disney-fans\",\"pub_date\":\"2018-03-02T20:15:36+00:00\",\"section\":\"Entertainment\",\"tags\":[\"LGBT\",\"Disney\",\"Star Wars\",\"Opinion\",\"typeArticle\"],\"title\":\"Is Elsa Really Getting a Girlfriend in ‘Frozen 2?’ Dream On, Disney Fans\",\"type\":\"post\"}"}, "movies": [], "publish_date": 1520021736.0, "source": "https://www.thedailybeast.com", "summary": ""}