{"url": "www.inquisitr.com/4934020/kim-kardashian-never-said-she-and-kanye-west-barely-made-it-this-year-despite-report/", "text": "Kim Kardashian and Kanye West have been plagued by divorce rumors for years, but they’ve defied the naysayers and held on to their marriage so far. But now a tabloid has claimed that the Wests “barely made it this year” and that Kim Kardashian said that herself. While the story could sound credible to some because of the drama that Kim and Kanye have been involved in this year, celebrity rumor watchdog, Gossip Cop, says that the story is untrue.\n\nAs Gossip Cop reports, OK! Magazine recently reported that Kim confessed that her and her husband’s relationship almost didn’t survive this year. They based their reporting on a tweet that Kim posted to celebrate Kanye’s Birthday.\n\n“Kim Kardashian Wishes Kanye A Happy Birthday — Says They Barely Made It This Year,” one headline for the article declared. Another headline read, “Marital Problems? Kim Kardashian Wishes Kanye A Happy Birthday — Hints They Barely Made It Through The Year.”\n\nBut that’s not what Kim tweeted at all. Here’s what she said:\n\n“Happy Birthday babe @kanyewest!!!!! It’s been a wild year but we’re here & life is good! So proud of you dropping back to back albums & fulfilling your dreams. You inspire me to make the impossible always become a reality. Love you.”\n\nHappy Birthday babe @kanyewest !!!!! It’s been a wild year but we’re here & life is good! So proud of you dropping back to back albums & fulfilling your dreams. You inspire me to make the impossible always become a reality. Love you ???? pic.twitter.com/lflFE6ePdQ — Kim Kardashian West (@KimKardashian) June 8, 2018\n\nAs you can see, Kim never mentions that they barely made it this year. In fact, the message is pretty positive, which isn’t surprising since it was sent on her husband’s birthday. Kim does say that it’s been “a wild year,” but it’s a stretch to say that she really meant that their marriage was so fraught with turmoil that she didn’t think they’d make it through 2018.\n\nWhile the tabloids keep speculating that a Kim and Kanye divorce is on the horizon, the rapper and the reality TV star have been showing that they at least have an affection/admiration for each other.\n\nAs People Magazine reports, Kanye was part a tribute video for his wife to commemorate her Influencer Award from the CFDA.\n\n“Say ‘Hi!’ We are making this video for the most influential person on the planet,” the Ye rapper said as he held their son, Saint, in the short video.\n\nGossip Cop notes that the husband and wife duo went to Japan this year after they took a trip to the Bahamas with their family. Just last month, they were filmed kissing with a friend in the background calling them “the best married couple” they knew.\n\nDespite these outward displays of a affection, there’s a chance that Kim and Kanye could get divorced in the future. That’s a possibility that faces all married couples. But, contrary to that OK! Magazine cover, Kim Kardashian never said that it could have happened to her marriage this year.", "images": ["https://secure.gravatar.com/avatar/dee9f0b262b2cc498f0c56b5221d31a3?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2018/06/kim-kardashian-kanye-west-divorce-rumors-saint-north-chicago.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Patricia Grannum"], "canonical_link": "https://www.inquisitr.com/4934020/kim-kardashian-never-said-she-and-kanye-west-barely-made-it-this-year-despite-report/", "title": "Kim Kardashian Never Said She And Kanye West ‘Barely Made It’ This Year, Despite ‘OK! Magazine’ Report", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}