{"url": "http://time.com/4782337/heath-ledger-documentary/", "text": "The closing credits to the new documentary I Am Heath Ledger are accompanied by a recording of its subject, being asked by an interviewer what he would make of a movie about his life. “I think it would be a pretty boring movie,” he responds with a laugh. Nine years after the actor’s untimely death at 28 from an accidental, lethal combination of prescription medications, such a movie has arrived, and it is hardly boring.\n\nDirected by Derik Murray and Adrian Buitenhuis, the film paints a portrait of the Australian actor through footage he took himself — he seemed always to have a camera in hand — and interviews with his family, friends and colleagues. Among the talking heads are childhood friends, his ex-girlfriend Naomi Watts, his longtime agent and friend Steve Alexander and directors including Ang Lee (Brokeback Mountain) and Catherine Hardwicke (Lords of Dogtown).\n\nThe documentary, which airs tonight on Spike at 10 p.m. EST and will be available on iTunes and Amazon on May 23, aims to reveal the person behind not only the roles but also the ravenous tabloid coverage that followed his death. Through the memories of those closest to him, Ledger is resurrected as a devoted father, an actor whose constant striving was often fueled by self-doubt, a lover of music, chess and Burning Man, and a talent whose future seemed boundless.\n\nHere are some of the lesser-known elements of Ledger’s story which the film brings into focus:\n\nHe was certain he had flubbed a major screen test with his idol, Mel Gibson.\n\nLedger grew up idolizing the Mad Max actor, who was once the biggest Australian movie star. When he went to do a screen test for the 2000 Gibson starrer The Patriot, he flubbed his lines, then stopped the audition and apologized to Gibson and director Roland Emmerich for wasting their time. But Gibson and Emmerich saw something in the young actor and took a chance on him, giving him his first big role since breaking out in 10 Things I Hate About You.\n\nMORE: Jake Gyllenhaal on How Heath Ledger’s Death Affected Him\n\nIt was during the promotion of A Knight’s Tale that Ledger began to really struggle with fame.\n\nLedger’s next move after The Patriot was the medieval adventure film A Knight’s Tale. His ruggedly handsome face and tousled hair — accompanied by the promise, “He will rock you” — was plastered all over Los Angeles, and he was set to tour the U.S. as the film’s “secret weapon.” But the role of salesman didn’t sit well with the actor. As his friend, the director Matt Amato, puts it in the documentary, “He wanted fame. And then when he got it, he didn’t want it. He was mortified, and he felt owned.”\n\nHeath Ledger in 2006. Sarah Rhodes—Getty Images\n\nAng Lee cast Heath Ledger in Brokeback Mountain because of his performance in Monster’s Ball.\n\nLee says that initially he wasn’t sure if Ledger could carry the film. He ended up hiring him based on his work in Monster’s Ball, in which he plays a corrections officer opposite Billy Bob Thornton. Lee adds that Ledger is the only actor he has ever allowed to look at the monitor after takes. Rather than making him overly self-aware, as Lee feared such self-observation might, Ledger used the process to reflect on his performance and turn out even better takes.\n\nLedger’s romantic interest in his Brokeback costar Michelle Williams became clear after she got injured on set.\n\nWhile filming a scene in which Ennis (Ledger) and Alma (Williams) go sledding, the toboggan flipped and Williams needed to be taken to the hospital. “When we reached the hospital we saw Heath holding her hand trying to comfort her,” Lee recalls in the film. “It was pretty obvious he was interested in her.” Their daughter Matilda was born the following year, and they remained together until 2007.\n\nHe once surprised his friend, the musician Ben Harper, with a grand piano, asking for a lullaby in return.\n\nAfter a night playing music with Ledger on the actor’s grand piano, Harper went home to get some rest. He awoke to hear a commotion outside: the piano had arrived on his doorstep, a gift from Ledger. When Harper protested his friend’s generosity, Ledger told him, “It’s supposed to be with you.” A few weeks later, Ledger, who was expecting a child with Williams, asked Harper to write a lullaby they could play for their daughter when she was born. “Nothing has ever been asked of me that’s that precious,” Harper says in the documentary.\n\nOne of his trademarks as the Joker was the result of challenges in the makeup room.\n\nLedger did much of his own makeup for his role as the Joker in Christopher Nolan’s The Dark Knight, a part for which he would go on to win a posthumous Oscar for Best Supporting Actor. He wore a prosthetic on his mouth to create the illusion of the villain’s famous scarring, but it frequently became detached when he spoke. Rather than repeatedly returning to the makeup room to have it re-glued, explains his dialogue coach Gerry Grennell, Ledger began licking his lips to keep it in place. As he repeated the motion, he began to incorporate it into the character.\n\nAn avid chess player and aspiring director, he was planning to direct a movie about the game.\n\nLedger loved chess from a young age, and he was good at it: his father Kim says that by the time his son was 10 or 11, he was difficult to beat, and he was only a few points away from achieving Grand Master status when he died. He was also an aspiring director, having directed music videos for Harper and the hip hop artist N’fa, a childhood friend. He planned to combine those loves by directing an adaptation of The Queen’s Gambit, a novel about a chess player who is addicted to pills, but Ledger died before production began.\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Eliza Berman at eliza.berman@time.com.", "images": ["https://api.time.com/wp-content/uploads/2020/04/Sergio_00_45_10_00C1.jpg?quality=85&w=600", "https://api.time.com/wp-content/uploads/2017/05/heath-ledger-fb.jpg?quality=85", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2020/04/fiona-4.jpg?quality=85&w=400", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://api.time.com/wp-content/uploads/2017/05/heath-ledger.jpg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2017/05/heath-ledger-fb.jpg?quality=85", "keywords": [], "authors": ["Eliza Berman"], "canonical_link": "https://time.com/4782337/heath-ledger-documentary/", "title": "Heath Ledger Documentary: What We Learned From I Am Heath Ledger", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "i am heath ledger, heath ledger, heath ledger death, heath ledger documentary, heath ledger family, heath ledger michelle williams, heath ledger australia, how did heath ledger die, heath ledger cause of death, heath ledger joker", "news_keywords": "i am heath ledger, heath ledger, heath ledger death, heath ledger documentary, heath ledger family, heath ledger michelle williams, heath ledger australia, how did heath ledger die, heath ledger cause of death, heath ledger joker", "description": "A new documentary about the actor Heath Ledger, who died in 2008, tells his story through the people closest to him.", "og": {"title": "7 Things We Learned From the New Heath Ledger Documentary", "type": "article", "site_name": "Time", "url": "https://time.com/4782337/heath-ledger-documentary/", "description": "From his skill at chess to his final, unfinished project", "image": {"identifier": "https://api.time.com/wp-content/uploads/2017/05/heath-ledger-fb.jpg?quality=85", "width": 1024, "height": 538}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/4782337/heath-ledger-documentary/", "description": "A new documentary about the actor Heath Ledger, who died in 2008, tells his story through the people closest to him.", "media": "https://api.time.com/wp-content/uploads/2017/05/heath-ledger-fb.jpg?quality=85"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/4782337/heath-ledger-documentary/", "title": "7 Things We Learned From the New Heath Ledger Documentary", "description": "From his skill at chess to his final, unfinished project", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2017/05/heath-ledger-fb.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}