{"url": "en.wikipedia.org/wiki/List_of_Punk%27d_episodes", "text": "No. in\n\nseries No. in\n\nseason Original air date Celebrity/Victim Notes\n\n25 1 March 6, 2005 Salma Hayek Penélope Cruz helps punk her friend Salma Hayek, who is accused of making a large fecal mess in a women's bathroom, causing a toilet to overflow.\n\nEva Longoria Eva Longoria and co-star Jesse Metcalfe are leaving the set of Desperate Housewives, when they get pulled over by the police. Metcalfe flees the scene, leaving the police to discover a false identity and a large amount of cash, implicating Longoria.\n\nMario 18-year-old Mario thinks he's going to meet a friend in a hotel room, but instead opens the door to a half-naked elderly woman. The hotel manager tries to get to the bottom of the situation and ends up making Mario upset.\n\n26 2 March 13, 2005 Kirsten Dunst While having dinner at a restaurant, Kirsten Dunst and her two friends are given fake drinks. Later they are stopped at a sobriety checkpoint, where Kirsten's friend hits the front end of a police squad car.\n\nJesse Metcalfe Jesse Metcalfe, previously the accomplice of Eva Longoria in the Season 4 premiere is now asked to audition for a supervillain role in a fictitious Spider-Man film. Jesse puts on tights and recites lines for the audition. He follows the casting director's advice for his movements, but this displeases the technician. The equipment breaks and it looks like Jesse is blamed for it.\n\nMichelle Rodriguez Michelle Rodriguez and her friend Giancarlo go to a convenient store. While there, they start horseplaying. When Michelle Rodriguez pushes her friend into one of the shelves, they all topple over, leaving one man trapped underneath. They lift the shelves, exposing a mess of broken bottles, spilled liquids and an injured man.\n\n27 3 March 20, 2005 Zach Braff Zach Braff's Scrubs co-star Donald Faison feels that Braff is so protective of his Porsche that he helps punk him. After Braff refuses a group of children's request to buy them beer at a liquor store, they spray paint Braff's car with graffiti, but the children deny it.\n\nZoe Saldana Saldana discovers Chris and Julia in a romantic embrace, despite the fact that Chris is dating Saldana's friend Kellee. Despite Saldana's relating this information to Kellee, Kellee is reluctant to break up with Chris, because she feels he is \"the one\" for her, much to Saldana's outrage.\n\nSerena Williams Serena Williams and her friend stop at a supermarket, and park next to a woman who is having difficulty with her willfully disobedient nephew Rob. When the woman goes into the store and asks Serena to look after the boy, he drives off with the car, leading to a chase by Serena, her friend and the woman. Williams appeared again in Season 6, Episode 6.\n\n28 4 March 27, 2005 Rachel Bilson Rachel Bilson and her dog are being blamed for the tipping of a mail delivery truck and the breaking of a water main.\n\nJadakiss Jadakiss is a passenger in a car that is suddenly stuck in traffic. After motorists yell at him to move the car, he abandons the car and hops in a taxi, driven by Field Agent Chris. When he goes the wrong way, Jadakiss hops out and starts heading down the street on foot.\n\nDirk Nowitzki Rob Pinkston plays a fan who asks Dirk Nowitzki, who is eating dinner at a restaurant, to sign a shirt, which he gladly does. But the young fan then requests he sign a large collection of other memorabilia, which Nowitzki does, despite his friends' insistence that he decline. When the fan returns with a second bag filled with memorabilia, Nowitzki declines, but is later told by the Maitre D that he and his party are no longer welcome there.\n\n29 5 April 3, 2005 Marques Houston Omarion sets up Marques Huston. Omarion brings his girlfriend to meet Marques, but also to break up with her. She reveals to Marques that she's pregnant. Omarion insists that there's no baby and she's making it up. After a while, her ex-boyfriend shows up and he looks angry. He wants to know whose baby it is. He insists that heads are gonna roll, but Marques keeps it pretty cool. Finally the Punk'd crew shows up to slow the roll.\n\nAndy Roddick Andy Roddick has to get to The Tonight Show with Jay Leno and the driver, Chris, decides to take a shortcut. They hit a roadblock that is set up because of the 2005 Los Angeles mudslides, but cannot go back, and the car is stuck. When the police arrive, an argument breaks out and suddenly Andy is blamed for the matter. The police make him sit there in this no-pass zone, intending to keep him there until 4pm.\n\nJamie-Lynn Sigler When Sigler and her husband are given the check after dining at a restaurant, the waitress, Dana, asks for a tip to cover the expense of things accidentally left out of the check, and is fired by her manager, Chris, when he hears about this \"tip-begging\". Feeling guilty over the woman's need to support her children, Sigler asks that the manager reconsider.\n\n30 6 April 10, 2005 Chingy Chingy is questioned by police after two of his bodyguards are accused of beating up a fan who approached Chingy as he dined in a restaurant to ask about making a record deal.\n\nJon Heder Jon Heder learns that a restaurant he has gone to under the coaxing of his twin brother is actually a high-end brothel when the Los Angeles Police Department Vice Squad raids the establishment.\n\nJoss Stone Joss Stone is going to a clothing store, and young Rob Pinkston walks in, nervous because he can't find his mom. Joss is asked by the boy's mom to keep after him until she arrives. Rob is troubled and quite mad, as he starts breaking things in the store. He storms out and runs away, but when his mother arrives, everything is blamed on Joss.\n\n31 7 April 17, 2005 Vanessa Carlton Vanessa Carlton is preparing for a visit on The Tonight Show with Jay Leno, but is assisted by an incompetent back-up band that is really trying her patience.\n\nCiara Ciara is being driven to an event when the driver, Jordan, has an altercation with another driver. They engage in typical road-rage activities, until the other car hits several water barrels and leaps off a dirt embankment. The police arrive and start to question Ciara.\n\nNicole Richie Nicole Richie and her fiancée go out to eat. The waiter, Chris, takes a liking to Nicole and later asks for her number while the fiancée is using the restroom. Nicole is patient and very kind and takes his number anyway. When Chris comes back, constantly with his hands on Nicole's arm or shoulder, the fiancée takes great offense and starts an argument with the waiter. When the manager gets involved, Richie is blamed for taking the waiter's number.\n\n32 8 April 25, 2005 \"Stone Cold\" Steve Austin Kutcher, curious if Stone Cold Steve Austin really is the defender of \"the little guy\", leads him to believe that he is responsible for losing someone's job, which occurs when a valet manager, Chris, blames one of his employees for stealing Austin's cell phone. Austin excoriates Chris for his refusal to rehire the valet, even after the phone is located.\n\nBizarre When Bizarre withdraws money from an ATM, it gives him much more than he asks for. He is then confronted by a policeman (Steve), who questions him about the ATM.", "images": ["http://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "http://en.wikipedia.org/static/apple-touch/wikipedia.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "http://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_Punk%27d_episodes", "title": "List of Punk'd episodes", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}