{"url": "https://heightline.com/matt-rife-kate-beckinsale-zendaya/", "text": "Matt Rife is a stand-up comedian who featured on season seven of MTV’s Wild ‘N Out. Matt became the youngest member of the cast on the show. He was also recognized as the youngest person ever featured on the comic-based BET series.\n\nQuick Bio, Who is Matt Rife?\n\nMatt was born on the 10th of September 1995 in Columbus, Ohio and was raised in a small town in the Midwest, his birth sign is Virgo. Matt began performing as a stand-up comedian at the early age of 15. He has always regarded himself comically as the Justin Bieber of comedy. He was first given a regular gig at the Laugh Factory in Los Angeles, California.\n\nMatt has always said that his comedy was inspired by Dave Cook after he realized in his seventh grade that he wanted to be a comedian. Rife revealed in a video interview with Thisis50 in 2015 that his desire for comedy as a career began while he was watching Comedy Central and Dane Cook. Matt actually confessed that during his earlier career he stole materials from every comedian. He went on to live his dream by hosting the comedy show headlined by his idol Dane Cook.\n\nMatt realized that not everyone is a fan of his comedy when came he under serious scrutiny in 2016 over some offensive tweets.\n\nHis Relationship with Zendaya\n\nZendaya is a popular American actress who came to prominence as a result of her performance in Disney Channels’ Shake It Up. She is also credited with songs like Swag It Out and Watch Me.\n\nIt is no surprise that Rife has always had a major crush on the former Disney superstar Zendaya, who doesn’t? During one of his comedy sketches the comedian attempted to get a little too close to Zendaya on Nick Cannon‘s Wild N’ Out Show, and what he got was a very cold shoulder. Apparently, Zendaya was having none of his attempts at getting too comfortable.\n\nMatt’s Relationship with Kate Beckinsale\n\nKate Beckinsale is a 43-year-old British actress who entered into full Cougar mode when she began dating the 21-year-old comedian Matt Rife. It was confirmed sometime in June 2017 when E! got photos of the comedian and the underworld star sharing a passionate kiss in the West of Hollywood.\n\nThroughout the duration of the relationship, the couple never confirmed their relationship. Rumors of the relationship came just 12 months after Beckinsale’s ex Len Wiseman filed for a divorce from her after 12 years of marriage.\n\nThe relationship between the pair was based on the cliché that age is just a number. He was caught on Instagram posting “Age is just a number, Find someone you love and take their breath away…. Even if that means putting a kink in their oxygen tank cord. #LifeAlertTypeOfLove.” Matt later deleted the post.\n\nBeckinsale is a huge fan of Matt’s brand of stand-up comedy and has been occasionally spotted at comedy clubs. It was largely known that Kate considered Matt to be her toyboy lover, a label Matt got fed up with. The 44-year-old actress set tongues wagging in June when the relationship began but sources close to the pair have disclosed that the romance has now fizzled out just a couple of months after the pair started going on fun dates together.\n\nAlso Read: Andy Richter Wife, Family, Brothers, Height, Net Worth, Is He Gay?\n\nSources close to Kate also claimed that the romance ended because she didn’t prioritize it and instead her commitment was to her 18-year-old daughter Lily whom she had with actor Michael Sheen. Her commitment to her daughter and her tight and busy work schedule where the major factors which stifled the relationship.\n\nAlthough Kate refused to take to social media to announce their Break up, Matt Rife hinted on both his Instagram and Twitter accounts. During the cause of the affair, neither Matt nor Kate ever seemed to be shaken over the enormous age gap between the pair, with Kate being two years older than Matt’s mother while Matt is three years older than Kate’s daughter.\n\nThough the couple seemed resolute and resilient at first, the wide age gap led to the split with Matt being ultimately immature and Kate more focused on career and her family.", "images": ["https://heightline.com/wp-content/uploads/matt-rife-e1527553340356.jpg", "https://heightline.com/wp-content/plugins/wp-user-avatar/images/wpua-96x96.png", "https://heightline.com/wp-content/uploads/matt-rife-e1527553340356-696x392.jpg", "https://heightline.com/wp-content/uploads/20190617170853f7-01fe-66c8-8451-7a1b6c56aced.jpg", "https://heightline.com/wp-content/uploads/logo_heightline.png", "https://heightline.com/wp-content/uploads/kate-rife-e1527553697523.jpg"], "top_img": "https://heightline.com/wp-content/uploads/matt-rife-e1527553340356.jpg", "keywords": [], "authors": [], "canonical_link": "https://heightline.com/matt-rife-kate-beckinsale-zendaya/", "title": "Who is Matt Rife? Relationship With Kate Beckinsale and Zendaya", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Matt Rife is a fast-rising stand-up comedian who has performed on MTV's Wild N' Out. Besides his comedy, Matt is popular for his on and off romance with Kate Beckinsale. Find out more about his relationships and other interesting details.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Who is Matt Rife? Relationship With Kate Beckinsale and Zendaya", "description": "Matt Rife is a fast-rising stand-up comedian who has performed on MTV's Wild N' Out. Besides his comedy, Matt is popular for his on and off romance with Kate Beckinsale. Find out more about his relationships and other interesting details.", "url": "https://heightline.com/matt-rife-kate-beckinsale-zendaya/", "site_name": "Heightline - Celebrity Biographies, Height, Weight, Bios of Famous People", "updated_time": "2018-05-31T14:40:50+00:00", "image": {"identifier": "https://heightline.com/wp-content/uploads/matt-rife-e1527553340356.jpg", "secure_url": "https://heightline.com/wp-content/uploads/matt-rife-e1527553340356.jpg", "width": 1024, "height": 576}}, "article": {"section": "Comedians", "published_time": "2018-05-31T14:32:43+00:00", "modified_time": "2018-05-31T14:40:50+00:00"}, "twitter": {"card": "summary", "description": "Matt Rife is a fast-rising stand-up comedian who has performed on MTV's Wild N' Out. Besides his comedy, Matt is popular for his on and off romance with Kate Beckinsale. Find out more about his relationships and other interesting details.", "title": "Who is Matt Rife? Relationship With Kate Beckinsale and Zendaya", "image": "https://heightline.com/wp-content/uploads/matt-rife-e1527553340356.jpg"}, "generator": "Powered by WPBakery Page Builder - drag and drop page builder for WordPress."}, "movies": [], "publish_date": 1527777163.0, "source": "https://heightline.com", "summary": ""}