{"url": "https://www.si.com/mlb/2017/10/24/houston-astros-sports-illustrated-world-series-prediction", "text": "In 2014, SI made the bold claim that the Houston Astros would be the 2017 World Series champions. Here's why we made that claim ... and why we're four wins away from being vindicated.\n\nWhen I first walked into the Astros’ offices, which are located in the shell of Houston’s old Union Station abutting Minute Maid Park, on the morning of June 4, 2014, the club was still the laughingstock of baseball. Since the start of the 2011 season, the Astros had lost nearly twice as many games, 358, as they had won, 187. Worse, they were run by executives who were still viewed as know-it-all baseball outsiders—like the G.M., former management consultant Jeff Luhnow, and the so-called Director of Decision Sciences, the former NASA engineer Sig Mejdal—even though the men had at that point worked within the game for a decade. Worst of all, Luhnow and his execs were openly violating the baseball compact by which rebuilding teams were supposed to obscure their long-term plan by maintaining the illusion that they were genuinely trying to win each and every year, even if it meant losing just a little less.\n\n“When you’re in 2017, you don’t really care that much about whether you lost 98 or 107 in 2012,” Luhnow said back then. “You care about how close we are to winning a championship in 2017.” In other words, they were entirely focused on several years down the line, which meant shedding every one of their expensive assets and starting from scratch. People hated it.\n\nStill, a few days later I flew back to New York with the makings of a 5,000-word story that would appear in the June 24 issue Sports Illustrated, with a bold cover line: YOUR 2017 WORLD SERIES CHAMPS featuring the sorry Astros. SI’s editor Chris Stone and I, along with baseball editor Emma Span, had consulted on the proper year to choose. We settled on 2017 because the Astros’ young nucleus would by then be reaching its prime, because it seemed to more or less hew to the front office’s own timeline—which, they promised, would eventually include a payroll hike—and because three years, in baseball, is actually not the blink of an eye.\n\nEnemy Lines: A Rival Scout Breaks Down the Astros Ahead of the World Series\n\nBut many people, including some within our own office, hated the cover, too. Even the club’s own hometown paper, the Houston Chronicle, called it “more of an attention-grabbing, perhaps even tongue-in-cheek projection than a prediction.”\n\nIt was certainly a long shot, but so is everything in baseball. Vegas usually assigns a given season’s spring favorite less than a 20% chance of winning that fall’s World Series. What it wasn’t was empty clickbait, or a hot take. While we’re never above generating interesting conversations, my editors and I genuinely believed that what I saw down in Houston could result in a ring in three seasons. Now, the Astros are four games away from coming through on that prediction.\n\nOf course, immediately after the issue reached mailboxes and newsstands, the Astros seemed to draw further away from the meeting the deadline we’d publicly set for them, in ways I described last month in an SI feature which focused on their recent last second trade for Justin Verlander. The 2015 Rookie of the Year, shortstop Carlos Correa, spent the second half of the season on the bench with a broken leg. George Springer, who had appeared on the cover, hit the DL. Their proprietary database, Ground Control, was revealed to have been hacked—by, it turned out, the former Cardinals scouting director Chris Correa, a former coworker of Luhnow’s and of several other Houston executives when they were all with St. Louis. (Correa—who, court documents suggested, was driven to increase his hacking efforts out of jealousy spurred by the SI cover, is now serving a 46-month prison sentence for unauthorized access of a protected computer.) Luhnow failed to sign the No. 1 pick in the 2014 draft, high school lefthander Brady Aiken, after the club detected an issue with Aiken’s elbow and decreased its offer to him. One of the Astros’ minor league stadiums flooded, and another caught on fire.\n\nThere were other mishaps and missteps along the way. “If we ever catch ourselves feeling smart, all we have to do is turn on SportsCenter,” Mejdal told me. There, as often as not, they could catch J.D. Martinez hitting another home run—the same J.D. Martinez whom Houston cut outright in March 2014, and who since then has an OPS (.936) higher than all but six other hitters in the majors. If Martinez wasn’t homering that night, then Kris Bryant probably was, the same Kris Bryant on whom the Astros passed with the top overall pick in 2013, in favor of the polished college pitcher Mark Appel. Appel had a 5.60 ERA in Triple-A this season—in the Phillies organization, where he was traded in December of 2015. Bryant, whom the Cubs picked No. 2 in `13, is the reigning NL MVP.\n\nThe Astros, though, never claimed to own a crystal ball, or that they would never make a mistake. They always expected to make many of them. Their goal was to make marginally more correct decisions than their competitors, in the long haul, and to do so they implemented an analytically rigorous system that not only processed all of the bleeding edge metrics they could find or create, but also heavily incorporated data from old fashioned sources: scouts, who could see things about a player’s potential and character that numbers couldn’t.\n\nMany of those decisions have now paid off. Such as surprising baseball by drafting Correa—Carlos, not Chris—with the top pick in 2012, a move heavily endorsed by current assistant G.M. Mike Elias and one which not only gave them a star shortstop but also the financial room to choose starter Lance McCullers 41st overall. In McCullers’ most recent appearance, he shut out the Yankees over the final four innings of Game 7 of the ALCS. And declining to sign Aiken—who would indeed blow out his elbow nine months after the draft—and thus receiving a compensatory pick that they would use the next year on third baseman Alex Bregman, who has emerged as the star of the 2015 draft and was last seen making the pivotal and most risky defensive play of Game 7, nailing Greg Bird at home to keep the Yankees scoreless.\n\nHow about trading for Verlander, even though their metrics didn’t at all favor sacrificing three promising prospects for a 34-year-old with a contract guaranteeing him $28 million a year? It’s virtually impossible to imagine them making the World Series without the ALCS MVP. Or signing expensive free agents this past winter, like Carlos Beltran (one year, $16 million), Charlie Morton (two years, $14 million) and Josh Reddick (four years, $52 million)? Or hanging on to selected young players they’d inherited from the previous front office, particularly Springer, Jose Altuve and Dallas Keuchel?\n\nForget the Underdog Label—the Astros Got to the World Series by Tanking\n\nLuck played its role, too—but the Astros’ plan, and the extended timeframe for their rebuilding effort permitted by owner Jim Crane, allowed room for good fortune. In the first season after Luhnow and his crew took over, 2012, Keuchel was a clean-shaven 24-year-old rookie who walked more batters (39) than he struck out (38), and Altuve was an undersized slap-hitter with nine career home runs. The front office had no idea that Keuchel would develop a devastating breaking ball and a more athletic delivery, as well as extraordinary facial hair, to become a Cy Young winner, or that Altuve, though still undersized, would develop into a power hitting, probable MVP. What they had was time to allow unexpected things like that to happen, as well as the analytical horsepower to expose players to every conceivable pathway by which they might improve.\n\nNow they’re on the cusp of doing a few of the most unexpected thing of all: no, not making it seem as if we at Sports Illustrated know what we’re talking about—though, thanks for that—but winning the World Series just three years after completing their sixth straight losing season.\n\nThey’re still the underdog. Of eight SI baseball staffers who on Monday predicted the World Series’ outcome, just one picked the Astros to beat the Dodgers, and you can probably guess who that was without clicking that link. But even if they don’t do it this year, they are a team built to win in the long haul, as was always the plan. Just four members of the World Series roster—DH Carlos Beltran, outfielder Cameron Maybin and relievers Luke Gregerson and Francisco Liriano—will be free agents after the season, and none of them is nearly as vital as, say, Altuve, Correa, Keuchel, Springer or Verlander. And, with a payroll that still ranks around the league average of $150 million—an increase from a last-place $36 million just four years ago—they will have the wherewithal to spend more, too.\n\nThe most remarkable thing of all about the Astros is this: they told everyone exactly what they were going to do—and then they did it. That sort of confidence might not make them beloved within certain baseball circles. But whether they win or lose in the next nine days, it’s now impossible to doubt that they’ve been on to something all along.", "images": ["https://www.si.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTY4MTAyMjcyNTQwOTQzNzQ0/astros-clinch-game7jpg.jpg", "https://www.si.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTY4MTAyNTc3MjA3MzIxODcz/astros-world-series-sports-illustrated-cover-salejpg.jpg", "https://www.si.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTY4MTAyMzc1NjEwOTgzNjk3/astros-game7-winitjpg.jpg", "https://www.si.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTY4MTA3MDMxODg5ODQ3Njgw/gettyimages-869169116jpg.jpg", "https://www.si.com/.image/t_share/MTY4MTA0NDQwNDE0OTM4NDk2/screen-shot-2017-10-24-at-91203-ampng.png", "https://www.si.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTY4MDI3MjcwODU2OTEwMjA4/george-springer-sad-astrosjpg.jpg", "https://www.si.com/.image/c_fit%2Ccs_srgb%2Ch_60%2Cq_auto:good%2Cw_600/MTY3NDcxMDIwMjQ3MDk4OTky/si_logo_60x600_red.png", "https://www.si.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTY4MTAyODc4NjU3MDYyMTYx/houston-astros-reiter-leadjpg.jpg", "https://www.si.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTY4MDI3MDk0MjM1ODgyODgw/astroball-topperjpg.jpg", "https://www.si.com/.image/cs_srgb%2Cq_auto:good/MTY3NDQ0MjMyMjY3NjM4Mzg0/si_mobile_sticky_nav_logo_435x100-1.svg", "https://www.si.com/assets-global/play-button-blk.svg?v=2020-04-17-205441-3d5ce40-015427", "https://www.si.com/.image/t_share/MTY4MTA0NDQwNjgyMTk0MzA0/gettyimages-857995246jpg.jpg", "https://www.si.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTY4MTA0NTQ4NTk1MjEzNjk2/houston-astros-world-series-prediction-sijpg.jpg"], "top_img": "https://www.si.com/.image/t_share/MTY4MTA0NDQwNDE0OTM4NDk2/screen-shot-2017-10-24-at-91203-ampng.png", "keywords": [], "authors": ["Ben Reiter"], "canonical_link": "https://www.si.com/mlb/2017/10/24/houston-astros-sports-illustrated-world-series-prediction", "title": "In 2014, SI predicted the Astros would win the 2017 World Series.", "meta_data": {"referrer": "unsafe-url", "HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1", "apple-mobile-web-app-capable": "no", "apple-mobile-web-app-status-bar-style": "black", "format-detection": "address=no", "google-site-verification": "Zxtw3BlUC0tAgI2yiNKzgXU8BuqxJ_-54-jrOZ6BN1E", "generator": "Tempest - www.saymedia.com", "pinterest": "nohover", "author": "Ben Reiter", "description": "In 2014, SI made the bold claim that the Houston Astros would be the 2017 World Series champions. Here's why we made that claim ... and why we're four wins away from being vindicated.", "keywords": "world series,si prediction,Houston Astros,2017 world series champs,MLB,si astros cover", "section": "MLB", "pagetype": "article", "item-id": "ci02553a2950002580", "published": "2017-10-24T12:06:12Z", "dcterms.rightsHolder": "ABG-SI LLC. SPORTS ILLUSTRATED is a registered trademark of ABG-SI LLC. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy", "dcterms.dateCopyrighted": 2020, "twitter": {"card": "summary_large_image", "url": "https://www.si.com/mlb/2017/10/24/houston-astros-sports-illustrated-world-series-prediction", "image": "https://www.si.com/.image/t_share/MTY4MTA0NDQwNDE0OTM4NDk2/screen-shot-2017-10-24-at-91203-ampng.png", "description": "In 2014, SI made the bold claim that the Houston Astros would be the 2017 World Series champions. Here's why we made that claim ... and why we're four wins away from being vindicated.", "domain": "www.si.com"}, "og": {"type": "article", "url": "https://www.si.com/mlb/2017/10/24/houston-astros-sports-illustrated-world-series-prediction", "title": "Why did SI predict the Astros would win the 2017 World Series in 2014?", "description": "In 2014, SI made the bold claim that the Houston Astros would be the 2017 World Series champions. Here's why we made that claim ... and why we're four wins away from being vindicated.", "image": "https://www.si.com/.image/t_share/MTY4MTA0NDQwNDE0OTM4NDk2/screen-shot-2017-10-24-at-91203-ampng.png", "site_name": "Sports Illustrated"}, "pinterest-rich-pin": "true", "apple-mobile-web-app-title": "Sports Illustrated", "parsely-title": "Why did SI predict the Astros would win the 2017 World Series in 2014? - Sports Illustrated", "parsely-link": "https://www.si.com/mlb/2017/10/24/houston-astros-sports-illustrated-world-series-prediction", "parsely-image-url": "https://www.si.com/.image/c_fill%2Ccs_srgb%2Ch_400%2Cq_auto:good%2Cw_620/MTY4MTA0NDQwNDE0OTM4NDk2/screen-shot-2017-10-24-at-91203-ampng.png", "parsely-post-id": "ci02553a2950002580", "parsely-pub-date": "2017-10-24T12:06:12Z", "parsely-section": "MLB", "parsely-author": "Ben Reiter", "parsely-tags": "world series,si prediction,Houston Astros,2017 world series champs,MLB,si astros cover", "sailthru.title": "Why did SI predict the Astros would win the 2017 World Series in 2014?", "sailthru.image.full": "https://www.si.com/.image/t_share/MTY4MTA0NDQwNDE0OTM4NDk2/screen-shot-2017-10-24-at-91203-ampng.png", "sailthru.date": "2017-10-24T12:06:12Z", "sailthru.author": "Ben Reiter", "sailthru.tags": "world series,si prediction,Houston Astros,2017 world series champs,MLB,si astros cover", "sailthru.description": "In 2014, SI made the bold claim that the Houston Astros would be the 2017 World Series champions. Here's why we made that claim ... and why we're four wins away from being vindicated.", "phx": {"content-item-id": "ci02553a2950002580", "content-object-type": "ContentArticle"}}, "movies": [], "publish_date": 1508774400.0, "source": "https://www.si.com", "summary": ""}