{"url": "https://www.brides.com/story/miley-cyrus-wishes-parents-a-happy-anniversary-with-throwback-photo", "text": "The bride, groom, and their family members have finally begun to post photos from the event, giving fans a pretty solid picture of what this intimate affair was like. According to People, the event took place at the Cyrus’s Franklin, Tennessee, home, which was transformed for the big day. Proud mom Tish Cyrus took to Instagram to share some family photos from her daughter's wedding. She posted one photo alongside her husband Billy Ray Cyrus and their daughter Miley standing at what appears to be the altar—AKA the fireplace—covered in an archway of roses and baby’s breath. “This makes my heart so happy,” she captioned it, alongside a fluttering heart emoji. Tish also posted a solo shot of just Miley and her dad, showing off Miley's stunning wild flower bouquet.\n\nBetween the mother-of-the-bride's photos and the bride's own posting, fans can almost get a 360-degree look at Miley's gorgeous Vivienne Westwood gown. According to USA Today, the “Nothing Breaks Like A Heart” singer wore the The Long Cocotte Dress from the designer's made to order line. The off-the-shoulder frock was finished in a ivory silk satin and reportedly costs $8,600.\n\nDespite the price tag on Miley's dress, the evening looked pretty relaxed. People points out Tish even changed into jeans after the ceremony. (E! News reports the entire wedding likely cost the couple around $17,500.)\n\nThe groom opted for a more casual look as well, pairing his black tux with white sneakers, which is apparently just what Miley likes. Under a photo of Miley and Hemsworth kissing, a commenter wrote, “Congratulations you married the hottest man on Hollywood,” and the singer responded saying “I knooooowwwww right,” further confirming the two did indeed tie the knot.\n\nIf that comment wasn't enough, another post from the bride reveals Hemsworth's new accessory—his wedding band!\n\nAccording to more posts from family and friends, everyone close to the couple was in attendance. Billy Ray posted a photo of the cake cutting to Instagram—the confectionary wonder had two tiers and floral designs—featuring Miley's brother Braison Cyrus, and sisters Brandi Cyrus and Noah Cyrus. \"Wedding wouldn't be complete without one shot from Dads out dated blackberry camera,\" the country star captioned the photo. \"Love seeing all so happy.\"\n\nIn addition to the cake, there were plenty of other desserts and treats on display, all of which, according to Us Weekly, were vegan. “I made vegan truffle mac and cheese, vegan fried chicken, chicken and dumplings, barbecue baked beans, chicken buffalo, egg rolls, Caesar salad, a crudités platter, homemade corn muffins, and one of [Miley’s] favorites is homemade vegan biscuits with apple butter,” a source told the magazine. “Dessert was vegan banana pudding and vegan vanilla cupcakes.”\n\nBraison's fiancé Stella McBride posted her own series of photos revealing more of the decor. In addition to the flower arch, the home was decorated with a beautiful archway of pastel colored balloons. And with the holidays right around the corner, there was also a festive Christmas tree on display.\n\nVroom Vroom Balloon reposted McBride's photo announcing that they created the beautiful installation. \"Love this gorgeous photo of @stylesofstella and @braisonccyrus under the massive pastel balloon installation we created for @mileycyrus & @liamhemsworth this past weekend,\" the company wrote in the caption. \"All balloons used were custom colors and 100% organic, plus the addition of floral, which made for one of our most magical installations yet.\"\n\nAccording to People, the decorations also included rose gold \"Mr. & Mrs.\" balloons and a decorated entry table, which was seen in a now- deleted Instagram post by the company. It was reportedly covered with candles, a sign-in book, an oversized balloon with their wedding date and two photos of Cyrus and Hemsworth. Another now-deleted photo showed off the reception area where two long tables were surrounded by string lights. Floral centerpieces decorated the tables and warm blankets were set on the chairs for each of their guests.\n\n“She wanted something very pastel and sweet,” Vroom Vroom Balloon owner Sunny Becks told People. “She was doing something different than her typical, really bright-colored way of doing things. She had a really specific vision of something very charming. They were amazing to work with.”\n\nThe rest of their wedding night was reportedly full of fun entertainment. Hemsworth did a \"shotski\" with his brothers, according to a clip by the couple's friend Conrad Carr, and the bride made a dance floor for herself in front of the Christmas tree. Miley posted a video of her getting down in her wedding dress to Mark Ronson’s and Bruno Mars’ “Uptown Funk.”", "images": ["https://www.brides.com/thmb/nAJJkVXCfCgOkCy2mDiKwrq_mf4=/500x350/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__5c23f0f35deaa32e6176e5fb__11-acd2cd1f7b8b4945a40b6ddf8769c40d.jpeg", "https://www.brides.com/thmb/Y2bUnsN8QmFODutKlHExPClQgrQ=/3600x2025/filters:fill(auto,1)/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__5c23f0f35deaa32e6176e5fb__169-2d7e1d487931468e85ac35c79d30bec8.jpeg", "https://:0"], "top_img": "https://www.brides.com/thmb/Y2bUnsN8QmFODutKlHExPClQgrQ=/3600x2025/filters:fill(auto,1)/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__5c23f0f35deaa32e6176e5fb__169-2d7e1d487931468e85ac35c79d30bec8.jpeg", "keywords": [], "authors": ["Jenna Milliner-Waddell"], "canonical_link": "https://www.brides.com/story/details-miley-cyrus-liam-hemsworth-wedding", "title": "All the Details From Miley Cyrus and Liam Hemsworth's Intimate Wedding", "meta_data": {"robots": "NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Miley Cyrus and Liam Hemsworth's at-home wedding in Tennessee was filled with balloons, flowers and, of course, cake", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "BRIDES", "sailthru.author": "Jenna Milliner-Waddell", "sailthru.tags": "news,weddings-and-celebs", "article": {"section": "Brides"}, "fb": {"app_id": 785196361567992}, "og": {"type": "article", "site_name": "Brides", "url": "https://www.brides.com/story/details-miley-cyrus-liam-hemsworth-wedding", "title": "All the Details From Miley Cyrus and Liam Hemsworth's Intimate Wedding", "description": "Miley Cyrus and Liam Hemsworth's at-home wedding in Tennessee was filled with balloons, flowers and, of course, cake", "image": "https://www.brides.com/thmb/Y2bUnsN8QmFODutKlHExPClQgrQ=/3600x2025/filters:fill(auto,1)/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__5c23f0f35deaa32e6176e5fb__169-2d7e1d487931468e85ac35c79d30bec8.jpeg"}, "twitter": {"card": "summary", "site": "@Brides", "title": "All the Details From Miley Cyrus and Liam Hemsworth's Intimate Wedding", "description": "Miley Cyrus and Liam Hemsworth's at-home wedding in Tennessee was filled with balloons, flowers and, of course, cake", "image": "https://www.brides.com/thmb/znoB3oPdiWTntgFmp2Vkok6PKPI=/2400x2400/filters:fill(auto,1)/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__5c23f0f35deaa32e6176e5fb__11-acd2cd1f7b8b4945a40b6ddf8769c40d.jpeg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.56.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.56.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.56.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.56.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.56.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://www.brides.com", "summary": ""}