{"url": "https://web.archive.org/web/20170605012647/http://www.cosmopolitan.com:80/uk/entertainment/a9961424/zayn-gigi-hadid-dating-timeline", "text": "Zayn Malik and Gigi Hadid remain one of the strongest young couples in Hollywood. They’ve come a long way since their first Instagram together in late 2015. They've appeared in one Vogue photo shoot, starred in a music video together, and appeared on each other's social media accounts countless times. Here is their story.\n\n\n\nAdvertisement - Continue Reading Below\n\nNovember 2015: Zayn and Gigi first spark romance rumours a few short weeks after she ends thing with Joe Jonas. Photographs of them leaving Justin Bieber’s American Music Awards after-party in L.A. surface, causing millions of Zayn fans to weep rivers.\n\nAccording to an Us Weekly source, the rumoured new couple aren’t using “boyfriend and girlfriend” terms just yet. “But seeing each other? Definitely. He’s chuffed.”\n\nDays later, Zayn stirs more romance rumours when he takes a selfie wearing what appears to be Gigi’s glasses.\n\nOn Nov. 29, Zayn and Gigi make things official by holding hands while leaving The Nice Guy together. This remains the most wonderful day for longtime ZiGi fans.\n\nAdvertisement - Continue Reading Below\n\nBefore the month wraps, Joe Jonas quietly unfollows Gigi on Instagram and Twitter and deletes a #squad photo of himself with Zayn and Kanye West from earlier in the year.\n\nR.I.P., this image and Joe and Zayn’s friendship. Screenshot | Twitter\n\nAdvertisement - Continue Reading Below\n\nGigi, meanwhile, posts and deletes four tweets likely directed at Joe. “Sometimes life just happens.. For whatever reason in whatever timing. And sometimes it doesn’t make sense 'til it does. That’s it,” reads one of the tweets.\n\nScreenshot | Twitter\n\nShe also posts this extremely suggestive “CHILL” photo for Joe and everyone because it’s less than one month into this new relationship, OK?\n\nAdvertisement - Continue Reading Below\n\nDecember 2015: *CUTE PHOTO BREAK*.\n\n\n\nA post shared by Zayn Malik (@zayn) on Dec 20, 2015 at 3:53am PST\n\nJanuary 2016: Gigi takes things to the next level with a “Z” necklace. It first appears on her Instagram in a blink-and-you’ll-miss-it moment.\n\nAdvertisement - Continue Reading Below\n\nInstagram\n\nNext up: Zayn's photo is spotted as Gigi’s background image on her phone after she touches down at Charles de Gaulle Airport in Paris ahead of Paris Fashion Week.\n\nAnd because teasing is better than the real thing (?), Zayn says he and Gigi are “good friends, yeah” while appearing on Apple’s Beats 1 radio show. Um, excuse me?\n\nMeanwhile, Gigi and Zayn star in his new music video for 'PILLOWTALK.' It’s his first music video as a solo artist and it’s so hot. Let's watch this video. Again.\n\nAdvertisement - Continue Reading Below\n\nGigi solidifies herself as Zayn’s biggest fan by singing along to 'PILLOWTALK' en route to somewhere nice in the wee hours of the morning.\n\nIt's confirmed, Gigi is Zayn's biggest fan pic.twitter.com/oXokPirovF — Nicole (@gigimypassion) January 29, 2016\n\nAdvertisement - Continue Reading Below\n\nHe returns the gesture by commenting on her work in the music video.\n\n@zaynmalik nah musta missed it 😏😜\n\n\n\nJokes.. I wasn't looking at myself, trust me 😻🔥🔥🔥🔥🔥 — Gigi Hadid (@GiGiHadid) January 29, 2016\n\nFeb 2016: *CUTE PHOTO BREAK*.\n\nA post shared by Zayn Malik (@zayn) on Feb 23, 2016 at 1:04pm PST\n\nAdvertisement - Continue Reading Below\n\nApril 2016: Zayn and Gigi appear in their first photo shoot together as a couple for Vogue. They are so in love in Naples it hurts.\n\nCourtesy of Vogue\n\nThere’s a behind-the-scenes video too and yes, it’s also very pretty.\n\nAdvertisement - Continue Reading Below\n\nMeanwhile, Gigi’s ex Joe Jonas weighs in on ZiGi, telling the Daily Mirror, “I think it’s interesting that she moved on so quickly. I mean, it was definitely very quick.” He also notes that people have been comparing him and Zayn “for years.”\n\nMay 2016: Zayn and Gigi walk the red carpet together at the Met Gala and are the beau and belle of the ball in Versace and Tommy Hilfiger, respectively.\n\nGetty\n\nGetty\n\nAdvertisement - Continue Reading Below\n\nJune 2016: E! News reports that Gigi and Zayn have ended their relationship after seven months of dating. Sources claim that they’ve actually broken up and reunited “multiple times,” with the latest due to communication problems.\n\nThree days later, Gigi is spotted out in West Hollywood wearing her “Z” necklace, which could mean all is right in the world again.\n\nGetty\n\nAdvertisement - Continue Reading Below\n\nThere is also this:\n\n#GigiHadid Pillow Talk 👀😍❤ A post shared by Hadid News (@hadidnews) on Jun 4, 2016 at 12:25am PDT\n\nTo further squash breakup rumours, Zayn and Gigi reveal his-and-hers Nutella containers in their New York kitchen via Gigi’s Snapchat. It’s the sweetest thing (get it?):\n\n#GigiHadidSnapchat @gigihadid @zayn A post shared by Gigi Hadid Snapchat Updates (@gigihadidsnapchat) on Jun 10, 2016 at 7:48pm PDT\n\nAdvertisement - Continue Reading Below\n\nJuly 2016: *CUTE PHOTO BREAK*.\n\nsquish ya A post shared by Gigi Hadid (@gigihadid) on Jul 8, 2016 at 2:55pm PDT\n\nSeptember 2016: Zayn wishes Gigi good luck ahead of her Gigi X Tommy capsule show in NYC.\n\nGood luck tonight baby. @gigihadid A post shared by Zayn Malik (@zayn) on Sep 9, 2016 at 4:45pm PDT\n\nAdvertisement - Continue Reading Below\n\nTwo days later, Taylor Swift is spotted third-wheeling on a ZiGi night out. Is this where Zayn and Taylor's Fifty Shades Darker song idea first started?\n\nGetty\n\nZayn and Gigi jet off to London for Fashion Week, where they sit front row for the Versus Versace show.\n\nGetty\n\nAdvertisement - Continue Reading Below\n\nGetty\n\nOctober 2016: *CUTE PHOTO BREAK*.\n\nA post shared by Zayn Malik (@zayn) on Oct 7, 2016 at 3:54pm PDT\n\nAdvertisement - Continue Reading Below\n\nNovember 2016: Nearly one year to the day ZiGi was born, Zayn tells ES Magazine that he and Gigi met in early November 2015 at a Victoria’s Secret party.\n\nHe approached her after recognising her “from her picture” and proceeded to ask her out, taking her to The Bowery Hotel’s restaurant Gemma in New York City. “She’s a very intelligent woman,” he says of Gigi. “She knows how to carry herself. She’s quite classy and that. She’s not, like, arrogant in any way. She's confident. She carries it well. She’s cool.”\n\nDecember 2016: In an interview on Sirius XM’s Morning Mash Up, Zayn continues the ZiGi origin story. “I just asked her [out]. It was pretty straight up,” he said. “I just asked her if she wanted to go on a date. I was in New York.”\n\nAdvertisement - Continue Reading Below\n\nZayn shares this Polaroid with Taylor and one of her cats while promoting 'I Don’t Wanna Live Forever,' their new collaboration for Fifty Shades Darker. (The cat unfortunately does not appear on the track).\n\n#idontwannaliveforever A post shared by Zayn Malik (@zayn) on Dec 8, 2016 at 8:08pm PST\n\nJanuary 2017: Zayn and Gigi spark ~ENGAGEMENT RUMOURS after Gigi is spotted with a pretty gold ring on that finger while out in New York City. The next day, Zayn reveals a new tattoo – LOVE – written in cursive on his right hand. What does it all mean?\n\nGetty\n\nAdvertisement - Continue Reading Below\n\nGetty\n\nShould we take a *CUTE PHOTO BREAK*?\n\nA post shared by Zayn Malik (@zayn) on Jan 3, 2017 at 2:58pm PST\n\nAdvertisement - Continue Reading Below\n\nMeanwhile, in an interview with British Vogue, Gigi reveals her typical night in with Zayn when she’s in L.A. For starters, they love “doing art” and cooking. “We like late-night movies and we order from this amazing place that does lattes and gingerbread cookies. I need coffee to stay up. I’m always like, ‘Babe, let’s go to a movie.’ Then I fall asleep halfway through and he’s like, ‘You’ve seen the first half of every movie out there and you have no idea how any of them end.’”\n\nFebruary 2017: ZiGi spend their second Valentine’s Day together and yes, there’s a cute Instagram in honour of the big day.\n\neveryday 💘 A post shared by Gigi Hadid (@gigihadid) on Feb 14, 2017 at 6:31pm PST\n\nAdvertisement - Continue Reading Below\n\nShe also calls him “Love of my life” in an Instagram story. Open your eyes Zayn! They’re pretty and the world needs to see them.\n\nInstagram\n\nMarch 2017: Zayn and Gigi appear in a video together after he wins the Best Music Video award at the iHeartRadio Music Awards. The clip exists because he couldn’t accept the award in person. It all worked out though, because even his co-star got to squeeze in a cute thank-you.\n\nAdvertisement - Continue Reading Below\n\nGigi photographs Zayn for the spring 2017 Versus Versace campaign, along with model Adwoa Aboah.\n\nGigi Hadid for Versus Versace\n\nAdvertisement - Continue Reading Below\n\nGigi Hadid for Versus Versace\n\nSpeaking to the Sunday Times Style, Zayn reveals the couple’s nicknames for each other. “I call her Gee, she calls me Zee. There’s some other nicknames too, but I’ll keep those private,” he said.\n\nApril 2017: Zayn calls Gigi “my everything” in a birthday Instagram post.\n\nhappy birthday to my everything ❤️ A post shared by Zayn Malik (@zayn) on Apr 23, 2017 at 9:32pm PDT\n\nFollow Peggy on Twitter and Cosmo Celeb on Facebook.", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://web.archive.org/web/20170605012647im_/https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-607336872-1496331188.jpg?crop=1.00xw:0.402xh;0,0.0482xh&resize=1200:*"], "top_img": "https://web.archive.org/web/20170605012647im_/https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-607336872-1496331188.jpg?crop=1.00xw:0.402xh;0,0.0482xh&resize=1200:*", "keywords": [], "authors": ["Peggy Truong"], "canonical_link": "https://web.archive.org/web/20170605012647/http://www.cosmopolitan.com/entertainment/celebs/a9957861/zayn-gigi-hadid-dating-timeline/", "title": "A definitive timeline of Zayn Malik and Gigi Hadid's relationship", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "A definitive timeline of Zayn Malik and Gigi Hadid's relationship", "description": "ZiGi forever.", "url": "https://web.archive.org/web/20170605012647/http://www.cosmopolitan.com/uk/entertainment/a9961424/zayn-gigi-hadid-dating-timeline/", "image": {"identifier": "https://web.archive.org/web/20170605012647im_/https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-607336872-1496331188.jpg?crop=1.00xw:0.402xh;0,0.0482xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 211620818858710}, "article": {"publisher": "https://facebook.com/cosmopolitanuk", "modified_time": "2017-06-01 03:44:42", "published_time": "2017-06-01 03:44:41", "section": "Entertainment"}, "twitter": {"site": "@CosmopolitanUK", "card": "summary_large_image", "image": "https://web.archive.org/web/20170605012647im_/https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-607336872-1496331188.jpg?crop=1.00xw:0.402xh;0,0.0482xh&resize=640:*"}, "google-site-verification": "OgzSrVaVV7yFKzGAbRMcXSJRgdDAbANPEE4HCHyKkdM", "title": "Zayn and Gigi Hadid Relationship Timeline - Zayn and Gigi Dating News", "description": "From their first date to their numerous Instagrams, here are Zayn and Gigi Hadid's key moments from their relationship.", "keywords": "zayn malik, gigi hadid, zayn and gigi, zayn malik girlfriend, gigi hadid boyfriend, zayn gigi dating, zayn gigi timeline, zayn gigi relationship, zayn gigi first date", "auto-publish": "timely", "robots": "noindex", "sailthru.contenttype": "standard-article", "sailthru.tags": "Entertainment,Gigi Hadid", "sailthru.date": "2017-06-01T15:44:41Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-607336872-1496331188.jpg?crop=1.00xw:0.402xh;0,0.0482xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-607336872-1496331188.jpg?crop=0.632xw:0.506xh;0.163xw,0.0183xh", "sailthru.socialtitle": "A definitive timeline of Zayn Malik and Gigi Hadid's relationship"}, "movies": [], "publish_date": 1496259881.0, "source": "https://web.archive.org", "summary": ""}