{"url": "https://web.archive.org/web/20040317211254/http://en.wikipedia.org:80/wiki/Charlie_and_the_Chocolate_Factory", "text": "Charlie and the Chocolate Factory\n\nFrom Wikipedia, the free encyclopedia.\n\nCharlie and the Chocolate Factory is a book for children by Roald Dahl. The book is noted for its casual, easy language, its detailed descriptions, and what can only be described as science fiction for kids. The same sort of style is maintained for most of his other children's books.\n\nWarning: Plot details follow\n\nIt concerns a boy, Charlie Bucket, whose background is based on one of poverty, living in a small, single-roomed house, which is also shared with his four grandparents. Charlie is the kind, sweet, caring boy most children's book heroes are. However, Charlie's greatest love in life is chocolate. He receives a bar twice a year, at Christmas and on his birthday.\n\nNearby Charlie's house sits the largest chocolate factory in the world, owned by a Mr. Willy Wonka. Wonka is the largest and most inventive and innovative producer of chocolate, producing all kinds of wonderful and delicious candy. Due to the nature of secrecy around the chocolate, the factory is never opened to the public, and houses mysterious workers within.\n\nWonka, in a surprise move, decides to open his factory to the public, by initiating a lottery. Inside five Wonka Bar wrappers, lies concealed a Golden Ticket which will admit two people into the factory.\n\nCharlie manages to find a Golden Ticket and he and his Grandpa Joe enter Willy Wonka's factory, where they encounter Wonka's many wondrous confectionery creations - including some prototypes which cause rather hair-raising side effects. The other Golden Ticket winners misbehave one by one and end up in bizarre predicaments which require removing them from the premises.\n\nIt turns out that the factory workers are the \"Oompa Loompas\" - a group of people from Loompaland who agree to shift and become Wonka's workforce because of his ability to supply unlimited quantities of their greatest delicacy, the cocoa bean, the raw ingredient in chocolate. Through the book, they occasionally break into verse en masse to comment on the misbehaviour of the other children and its deleterious effects.\n\nAt the end of the story, it is revealed that the lottery was a ploy for Willy Wonka to choose his successor. As the last Golden Ticket winner left standing, Charlie inherits the factory and goes on a trip in a glass elevator with Willy Wonka, the story continuing in the sequel Charlie and the Great Glass Elevator.\n\nThe book was filmed as Willy Wonka and the Chocolate Factory.", "images": ["https://web.archive.org/web/20040317211254im_/http://en.wikipedia.org/favicon.ico", "https://web.archive.org/web/20040317211254im_/http://en.wikipedia.org/upload/wiki.png"], "top_img": "https://web.archive.org/web/20040317211254im_/http://en.wikipedia.org/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Charlie and the Chocolate Factory", "meta_data": {"robots": "index,follow"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}