{"url": "http://web.archive.org/web/20060228220724/http:/energycommerce.house.gov/108/News/02152006_1778.htm", "text": "Barton: Medicare Drug Program Drawing Participants by the Thousands WASHINGTON - U.S. Rep. Joe Barton, R-Texas, chairman of the House Energy and Commerce Committee, made the following statement today during the full committee hearing on the Administration's FY '07 Health Care Priorities: \"Good afternoon. Let me begin by welcoming Secretary Michael Leavitt today to the Energy and Commerce Committee. We look forward to hearing him testify about the Administration's Fiscal Year 2007 Health Care Priorities. \"First, Mr. Secretary, I want to thank you for your assistance in developing the important reforms we put into place for the Medicaid program starting this year. As a former governor yourself, you understood and appreciated the need to improve this program. Through passage of the Deficit Reduction Act, we will sustain Medicaid for those people who most often need health care and to get good get their health care through good jobs in a thriving economy instead of from a government welfare program. The reforms we adopted recently are beginning to rescue the program from the threat of financial collapse. I look forward to working with you to see that the governors get the tools they need to better manage the program and deliver its benefits to the poor of their states. \"I want to briefly highlight at least some of the changes in the law that have not recently received the public attention that they deserve. According to the Congressional Budget Office, 115,000 disabled children covered by the Family Opportunity Act will receive improved health care services as a result of the recently passed Deficit Reduction Act. The new law will provide access to new home and community based care to 120,000 individuals; and it will facilitate 100,000 nursing home residents to return to their communities through the Administration's Money Follows the Person Demonstration. These are the true results of Medicaid reform - better access to better care for those who most need our assistance. \"There is still much to be done to improve long-term care service delivery and financing as well as to promote Medicaid managed care. I have received the administration's proposals regarding additional improvement to the Medicaid program and I look forward to working with you this year on them. \"This year the secretary and the administration also are required to administer the new Medicare prescription drug benefit. Making this program succeed is a high priority of yours, and it is a high priority of this committee that I chair. \"Since it began, critics have tried to make patients believe that they are not smart enough to understand the new Medicare drug benefit, that it provides inadequate coverage, and that signing up isn't worth their time because it cannot save them any money. The critics are simply wrong. They were wrong when they complained about the Medicare prescription drug card. They were wrong when they said nobody would offer any insurance plans. And they are wrong now. \"Some sense political advantage in condemning the program and others can't bring themselves to admit that free markets actually work. Transparency and competition will drive down prices and provide lower costs to consumers. Even if the critics don't get it, Medicare beneficiaries certainly do. That is why over 3.6 million Medicare beneficiaries have already signed up for the new benefit. You told me earlier today that there are close to 24 million Americans that have been enrolled in the program, through one means or another, and enrollment is increasing at approximately 250,000 people per week. That sounds like a success story to me. If you add that to the fact that the premiums which we estimated at $37 a month is now down to an average $27 per month, that appears to me to be a successful program. \"This is a huge undertaking and there are going to be glitches. My goal is the same as yours: Get rid of the glitches. The committee will work closely with yourself and Dr. Mark McClellan at CMS to get problems noticed and solved. We will have the first of what will likely be several hearings on this topic on March 1, when Dr. McClellan will testify before the Health subcommittee. I expect that we ask him very direct questions about where the problems are and what CMS is doing to fix them. \"Another high priority for the committee will be the reauthorization of the National Institutes of Health (NIH) and related programs. I want to restate my deep commitment to reauthorizing the NIH and would ask for the secretary's assistance in working out the technical details so that we can enact this long overdue legislation. In addition, the authorization for the Ryan White CARE Act has now lapsed. I believe that funding unauthorized programs is not a responsible practice, and I anticipate that the committee will work to reauthorize these programs this year. \"I also intend to work with you this year on ways to reform Medicare reimbursement, and particularly focus on physician payment reform. In order to preserve access to Medicare services for future generations, we must look at how we are spending our Medicare dollars today and what are the incentives are for our physician community to continue providing quality health care. \"Another top priority of the committee will be to work with you on the proposals outlined in the Administration's budget to provide consumers with greater access to comparative price and quality data about their health care providers. I could go on, but my time has expired.\" ####", "images": ["http://web.archive.org/web/20060228220724im_/http://energycommerce.house.gov/108/images/tipline_small.jpg", "http://web.archive.org/web/20060228220724im_/http://energycommerce.house.gov/108/images/aggiecorner_3.gif", "http://web.archive.org/web/20060228220724im_/http://energycommerce.house.gov/109/images/barton2.gif", "http://web.archive.org/web/20060228220724im_/http://energycommerce.house.gov/108/images/aggiecorner_2.gif", "http://web.archive.org/web/20060228220724im_/http://energycommerce.house.gov/108/images/aggiecorner_small.gif", "http://web.archive.org/web/20060228220724im_/http://energycommerce.house.gov/107/images/Committee_Seal_Small.jpg"], "top_img": "http://web.archive.org/web/20060228220724im_/http://energycommerce.house.gov/107/images/Committee_Seal_Small.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "The Committee on Energy and Commerce", "meta_data": {"GENERATOR": "Microsoft FrontPage 4.0", "ProgId": "FrontPage.Editor.Document"}, "movies": [], "publish_date": null, "source": "http://web.archive.org", "summary": ""}