{"url": "www.rollingstone.com/culture/culture-news/las-vegas-shooting-john-mayer-lady-gaga-other-celebs-call-for-gun-control-196544/", "text": "Following the deadliest mass shooting in American history, in which at least 58 people were killed and 500 wounded at a musical festival in Las Vegas on Sunday night, artists, actors and other celebrities from around the country are now using their platform in the hopes of advancing the conversation about gun control.\n\nSince identified as Stephen Paddock, the shooter opened fire on a crowd from the 32nd floor of the Mandalay Bay hotel, stationed across the street from the outdoor venue where country singer Jason Aldean was performing at the time. The police uncovered at least 10 rifles in Paddock’s room, including hundreds of rounds of ammunition. Eric Paddock, the brother of the suspect, told reporters on Monday that Stephen Paddock legally owned “a couple” of handguns and may have owned one long gun, “but he had them in a safe.” It’s still unclear how Paddock came into possession of so many rifles.\n\nIn a ten-tweet-long thread, John Mayer laid out a passionate argument for immediate change with regards to gun control. “I’m going to state my thoughts without the words ‘gun control’ ‘assault rifles’ and others that stoke reflexive debate,” he began. “I’m a logic and reason guy. I like to remove emotion (impossible today) and look at an issue in a theoretical vacuum to make sense of it. Lawmakers and influencers: if you’re not doing everything in your power to at least *reassess* the threat of mass murder, why can’t you come out and tell us that this is the life we’re going to have to accept? That these are the new terms? That it’s a fact of modern day life that from time to time we’ll lose dozens of people in seconds? That daily life is a lottery system? And if you can’t say that, if it’s just too cold and brutal a thought to bear, then isn’t that proof you haven’t solved the problem yet?\n\nHe continue: “If you’re not at least trying to fix this, you’re effectively telling the country in your (in)actions that this somehow acceptable. There’s two moralities: morality identity and morality-in-action. Our greater moral identity doesn’t match our actions so far.9) If you’re not open minded to solving this, you’re morally surrendering us all to a very certain fate. There is no in between here. **Please use the energy normally allotted to fighting this argument to rethinking this problem.** Unless you don’t think there is one…”\n\nBilly Eichner was likewise outspoken. After tweeting “enough already” in all caps, the Difficult People and American Horror Story: Cult star questioned why congress hasn’t been pushed more on the matter since Sandy Hook.\n\nGUN CONTROL NOW. ENOUGH ALREADY. GROW THE FUCK UP. THE AVERAGE PERSON DOESN’T NEED A FUCKING MACHINE GUN. ENOUGH ALREADY. ENOUGH. ENOUGH. — billy eichner (@billyeichner) October 2, 2017\n\nAND DON’T TALK ABOUT THE 2ND AMENDMFNT. THEY WEREN’T TALKING ABOUT AUTOMATIC WEAPONS & ANYONE WHO SAYS THAT NONSENSE IS ENABLING MASS MURDER — billy eichner (@billyeichner) October 2, 2017\n\nCongress did nothing after Sandy Hook. NOTHING. Think about how INSANE that is. We’re calling Congress about everything else, why not this?? — billy eichner (@billyeichner) October 2, 2017\n\nLady Gaga shared a similar message, asking Democrats and Republicans to unite to bring an end to “terrorism.” She then directed a tweet towards Paul Ryan and Donald Trump, urging them to “act quickly” on gun control.\n\nThis is terrorism plain and simple. Terror bares no race, gender or religion. Democrats & Republicans please unite now #guncontrol ?? — xoxo, Gaga (@ladygaga) October 2, 2017\n\nPrayers are important but @SpeakerRyan @realDonaldTrump blood is on the hands of those who have power to legislate. #GunControl act quickly. https://t.co/bXZQ7enuEp — xoxo, Gaga (@ladygaga) October 2, 2017\n\nEmmy Rossum, best known for playing the character Fiona Gallagher on Shameless, also tweeted at Trump calling for action.\n\nDear @realDonaldTrump, the people of Las Vegas don’t need your hashtags and empty tweets about “warmest condolences”. They need action. — Emmy Rossum (@emmyrossum) October 2, 2017\n\nI believe in prayer, but it’s not enough by itself. We need better LAWS. In no world does a CIVILIAN need a MACHINE GUN. Let’s fix this. — Emmy Rossum (@emmyrossum) October 2, 2017\n\nJohn Legend said the news was “heartbreaking” and “devastating” in his own tweet before retweeting Hillary Clinton and Joe Biden on the need for gun control.\n\nThe crowd fled at the sound of gunshots. Imagine the deaths if the shooter had a silencer, which the NRA wants to make easier to get. — Hillary Clinton (@HillaryClinton) October 2, 2017\n\nOur grief isn’t enough. We can and must put politics aside, stand up to the NRA, and work together to try to stop this from happening again. — Hillary Clinton (@HillaryClinton) October 2, 2017\n\nHow long do we let gun violence tear families apart? Enough. Congress & the WH should act now to save lives. There’s no excuse for inaction. — Joe Biden (@JoeBiden) October 2, 2017\n\nGaga’s fellow pop star Ariana Grande, whose concert in Manchester, England earlier this year was the target of a bombing that killed 22 people, called for “love, unity, peace, gun control.”\n\nMy heart is breaking for Las Vegas. We need love, unity, peace, gun control & for people to look at this & call this what it is = terrorism. — Ariana Grande (@ArianaGrande) October 2, 2017\n\nMark Ruffalo (as well as Julianne Moore, in a similar message) encouraged everyone to join the movement to end gun violence by texting Everytown for Gun Safety, an organization that works with lawmakers to pass “common-sense laws and policies that save lives.”\n\nToday we mourn for Las Vegas, tomorrow we fight for them.\n\nJoin the movement to end gun violence: Text ACT to 64433. pic.twitter.com/yNmPeBjrFB — Mark Ruffalo (@MarkRuffalo) October 2, 2017\n\nTwo-time Olympian Aly Raisman said she was “disgusted” by the news and questioned why it is “so easy for crazy people to have guns.”\n\nWHY is this horrible person allowed to have a gun? WHY. This has to stop. Why is it so easy for crazy people to have guns? I’m disgusted. — Alexandra Raisman (@Aly_Raisman) October 2, 2017\n\nComedian Michael Ian Black called the National Rifle Association (NRA) a terrorist organization. “There’s no other way to say it,” he tweeted before responding to criticism.\n\nThe NRA is a terrorist organization. There’s no other way to say it. — Michael Ian Black (@michaelianblack) October 2, 2017\n\nHere is the definition of a terrorist organization/terrorism. This is the NRA. pic.twitter.com/BxdcQpeuKt — Michael Ian Black (@michaelianblack) October 2, 2017\n\nI know you weren’t talking to me & I love you, but the NRA are accessories to murder for this and for the nation’s insane gun violence rate. https://t.co/F0uXS7BCt2 — Michael Ian Black (@michaelianblack) October 2, 2017", "images": ["http://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.rollingstone.com/wp-content/uploads/2018/06/lady-gaga-ariana-grande-artists-react-gun-control-76cd281d-e1d4-47de-a852-0601a782dcc2.jpg", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fculture%2Fculture-news%2Flas-vegas-shooting-john-mayer-lady-gaga-other-celebs-call-for-gun-control-196544%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=196544", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/lady-gaga-ariana-grande-artists-react-gun-control-76cd281d-e1d4-47de-a852-0601a782dcc2.jpg", "keywords": [], "authors": ["Scott Rafferty", "Scott Rafferty'S Most Recent Stories", "Vikings", "Minneapolis Miracle", "Touchdown Gets The", "Titanic", "Mets Invite Cent To", "Redeem", "Himself With Ceremonial First Pitch", "Winter Olympics"], "canonical_link": "https://www.rollingstone.com/culture/culture-news/las-vegas-shooting-john-mayer-lady-gaga-other-celebs-call-for-gun-control-196544/", "title": "Las Vegas Shooting: Celebrities Call for Gun Control", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "\"If you're not at least trying to fix this, you're effectively telling the country in your (in)actions that this somehow acceptable,\" Mayer tweets", "news_keywords": "Las Vegas", "og": {"type": "article", "title": "Las Vegas Shooting: John Mayer, Gaga, Others Call for Gun Control", "url": "https://www.rollingstone.com/culture/culture-news/las-vegas-shooting-john-mayer-lady-gaga-other-celebs-call-for-gun-control-196544/", "description": "“If you’re not at least trying to fix this, you’re effectively telling the country in your (in)actions that this somehow acceptable,” Mayer tweets", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/lady-gaga-ariana-grande-artists-react-gun-control-76cd281d-e1d4-47de-a852-0601a782dcc2.jpg", "width": 1024, "height": 576, "alt": "lady gaga ariana grande artists react to vegas gun control"}, "locale": "en_US"}, "article": {"published_time": "2017-10-02T18:13:00+00:00", "modified_time": "2018-06-25T13:51:33+00:00"}, "twitter": {"text": {"title": "Las Vegas Shooting: John Mayer, Lady Gaga, Other Celebs Call for Gun Control"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/lady-gaga-ariana-grande-artists-react-gun-control-76cd281d-e1d4-47de-a852-0601a782dcc2.jpg?w=1024", "alt": "lady gaga ariana grande artists react to vegas gun control"}, "card": "summary_large_image", "site": "@RollingStone", "title": "Las Vegas Shooting: John Mayer, Lady Gaga, Other Celebs Call for Gun Control", "description": "\"If you're not at least trying to fix this, you're effectively telling the country in your (in)actions that this somehow acceptable,\" Mayer tweets"}, "generator": "WordPress 5.4", "author": "Scott Rafferty", "content_type": "Article", "post_id": 196544, "title": "Las Vegas Shooting: John Mayer, Lady Gaga, Other Celebs Call for Gun Control", "published_at": "2017-10-02 18:13:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/lady-gaga-ariana-grande-artists-react-gun-control-76cd281d-e1d4-47de-a852-0601a782dcc2.jpg?w=1024", "comment_count": 0, "tags": "Las Vegas", "topics": "Culture News", "body": "Following the deadliest mass shooting in American history, in which at least 58 people were killed and 500 wounded at a musical festival in Las Vegas on Sunday night, artists, actors and other celebrities from around the country are now using their platform in the hopes of advancing the conversation about gun control.Since identified as Stephen Paddock, the shooter opened fire on a crowd from the 32nd floor of the Mandalay Bay hotel, stationed across the street from the outdoor venue where country singer Jason Aldean was performing at the time. The police uncovered at least 10 rifles in Paddock’s room, including hundreds of rounds of ammunition. Eric Paddock, the brother of the suspect, told reporters on Monday that Stephen Paddock legally owned \"a couple\" of handguns and may have owned one long gun, \"but he had them in a safe.\" It’s still unclear how Paddock came into possession of so many rifles.In a ten-tweet-long thread, John Mayer laid out a passionate argument for immediate change with regards to gun control. \"I'm going to state my thoughts without the words 'gun control' 'assault rifles' and others that stoke reflexive debate,\" he began. \"I'm a logic and reason guy. I like to remove emotion (impossible today) and look at an issue in a theoretical vacuum to make sense of it. Lawmakers and influencers: if you're not doing everything in your power to at least *reassess* the threat of mass murder, why can't you come out and tell us that this is the life we're going to have to accept? That these are the new terms? That it's a fact of modern day life that from time to time we'll lose dozens of people in seconds? That daily life is a lottery system? And if you can't say that, if it's just too cold and brutal a thought to bear, then isn't that proof you haven't solved the problem yet? He continue: \"If you're not at least trying to fix this, you're effectively telling the country in your (in)actions that this somehow acceptable. There's two moralities: morality identity and morality-in-action. Our greater moral identity doesn't match our actions so far.9) If you're not open minded to solving this, you're morally surrendering us all to a very certain fate. There is no in between here.  **Please use the energy normally allotted to fighting this argument to rethinking this problem.** Unless you don't think there is one…\"Billy Eichner was likewise outspoken. After tweeting \"enough already\" in all caps, the Difficult People and American Horror Story: Cult star questioned why congress hasn't been pushed more on the matter since Sandy Hook.GUN CONTROL NOW. ENOUGH ALREADY. GROW THE FUCK UP. THE AVERAGE PERSON DOESN'T NEED A FUCKING MACHINE GUN. ENOUGH ALREADY. ENOUGH. ENOUGH.— billy eichner (@billyeichner) October 2, 2017\nAND DON'T TALK ABOUT THE 2ND AMENDMFNT. THEY WEREN'T TALKING ABOUT AUTOMATIC WEAPONS & ANYONE WHO SAYS THAT NONSENSE IS ENABLING MASS MURDER— billy eichner (@billyeichner) October 2, 2017\nCongress did nothing after Sandy Hook. NOTHING. Think about how INSANE that is. We're calling Congress about everything else, why not this??— billy eichner (@billyeichner) October 2, 2017\nLady Gaga shared a similar message, asking Democrats and Republicans to unite to bring an end to \"terrorism.\" She then directed a tweet towards Paul Ryan and Donald Trump, urging them to “act quickly” on gun control.This is terrorism plain and simple. Terror bares no race, gender or religion.  Democrats & Republicans please unite now #guncontrol ??— xoxo, Gaga (@ladygaga) October 2, 2017\nPrayers are important but @SpeakerRyan @realDonaldTrump blood is on the hands of those who have power to legislate. #GunControl act quickly. https://t.co/bXZQ7enuEp— xoxo, Gaga (@ladygaga) October 2, 2017\nEmmy Rossum, best known for playing the character Fiona Gallagher on Shameless, also tweeted at Trump calling for action.Dear @realDonaldTrump, the people of Las Vegas don't need your hashtags and empty tweets about \"warmest condolences\". They need action.— Emmy Rossum (@emmyrossum) October 2, 2017\nI believe in prayer, but it's not enough by itself.  We need better LAWS.  In no world does a CIVILIAN need a MACHINE GUN. Let's fix this.— Emmy Rossum (@emmyrossum) October 2, 2017\nJohn Legend said the news was “heartbreaking” and “devastating” in his own tweet before retweeting Hillary Clinton and Joe Biden on the need for gun control.The crowd fled at the sound of gunshots. Imagine the deaths if the shooter had a silencer, which the NRA wants to make easier to get.— Hillary Clinton (@HillaryClinton) October 2, 2017\nOur grief isn't enough. We can and must put politics aside, stand up to the NRA, and work together to try to stop this from happening again.— Hillary Clinton (@HillaryClinton) October 2, 2017\nHow long do we let gun violence tear families apart? Enough. Congress & the WH should act now to save lives. There's no excuse for inaction.— Joe Biden (@JoeBiden) October 2, 2017\nGaga's fellow pop star Ariana Grande, whose concert in Manchester, England earlier this year was the target of a bombing that killed 22 people, called for \"love, unity, peace, gun control.\"My heart is breaking for Las Vegas. We need love, unity, peace, gun control & for people to look at this & call this what it is = terrorism.— Ariana Grande (@ArianaGrande) October 2, 2017\nMark Ruffalo (as well as Julianne Moore, in a similar message) encouraged everyone to join the movement to end gun violence by texting Everytown for Gun Safety, an organization that works with lawmakers to pass \"common-sense laws and policies that save lives.\"Today we mourn for Las Vegas, tomorrow we fight for them.Join the movement to end gun violence: Text ACT to 64433. pic.twitter.com/yNmPeBjrFB— Mark Ruffalo (@MarkRuffalo) October 2, 2017\nTwo-time Olympian Aly Raisman said she was \"disgusted\" by the news and questioned why it is “so easy for crazy people to have guns.”WHY is this horrible person allowed to have a gun? WHY. This has to stop. Why is it so easy for crazy people to have guns? I'm disgusted.— Alexandra Raisman (@Aly_Raisman) October 2, 2017\nComedian Michael Ian Black called the National Rifle Association (NRA) a terrorist organization. “There’s no other way to say it,” he tweeted before responding to criticism.The NRA is a terrorist organization. There's no other way to say it.— Michael Ian Black (@michaelianblack) October 2, 2017\nHere is the definition of a terrorist organization/terrorism. This is the NRA. pic.twitter.com/BxdcQpeuKt— Michael Ian Black (@michaelianblack) October 2, 2017\nI know you weren't talking to me & I love you, but the NRA are accessories to murder for this and for the nation's insane gun violence rate. https://t.co/F0uXS7BCt2— Michael Ian Black (@michaelianblack) October 2, 2017", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1506967980.0, "source": "http://www.rollingstone.com", "summary": ""}