{"url": "http://easydamus.com/alignmenttest.html", "text": "Alignment Test\n\nAnswer each question by choosing the response that best describes your character's belief or most likely action.\n\nBefore submitting your responses, make sure JavaScript is enabled, and that all pop-up window-managers are disabled! If you are not sure if your browser will work, scroll to the bottom and click on the \"What is my Alignment?\" button to test before filling out all of the questions.\n\nIf you'd like to find out what sort of Dungeons & Dragons character you would be (with ability scores, race, classes, level, and alignment), please see this survey:\n\n1. Family elders are expressing disapproval of you to the rest of the family. Do you:\n\n\n\nAccept the criticism and change your ways?\n\nSeek a compromise with them?\n\nBesmirch the reputation of those expressing disapproval as you ignore their scorn?\n\nSilence them any way you can?\n\n\n\n2. Would you give up a promising career to aid the family in time of need?\n\n\n\nIn a heartbeat.\n\nYes, with some reluctance.\n\nOnly if I was certain I'd be able to return to my career soon.\n\nNo.\n\n\n\n3. Would you betray a family member to advance your own career?\n\n\n\nYes, without a twinge of guilt.\n\nYes, if I could do it secretly.\n\nI'd resist the temptation.\n\nI find the very idea abhorrent.\n\n\n\n4. Do you respect the leaders of your family?\n\n\n\nTheir words guide my actions.\n\nThey're role models for me.\n\nThey're often out of touch with my life.\n\nThey're out of touch with reality.\n\n\n\n5. If your family had arranged your marriage to someone loathsome, would you:\n\n\n\nGo through with it, proud to serve your family?\n\nAgree, hiding your reluctance?\n\nSubtly work against the union?\n\nFlee?\n\n\n\n6. You're estranged from a family member. On his deathbed, he seeks reconciliation. Do you:\n\n\n\nSpeak to him, but hold your ground?\n\nRefuse to speak to him?\n\nDiscuss your estrangement openly and without rancor?\n\nActively seek reconciliation, and heed his dying words?\n\n\n\n7. A powerful but corrupt judge offers you wealth if you'll testify against your friend. Do you:\n\n\n\nCondemn your friend and take the money?\n\nTake the money and testify, but try to keep your testimony ineffective?\n\nRefuse the offer and refuse to testify?\n\nTestify on your friend's behalf, no matter the consequences?\n\n\n\n8. Do you become close to friends, or hold most people at a safe distance?\n\n\n\nI have an abundance of close friends.\n\nI have some close friends.\n\nI have few close friends.\n\nI try to keep people at a distance.\n\n\n\n9. Have you ever betrayed a friend?\n\n\n\nI've done so more than once, and I sometimes get away with it.\n\nI've done so once.\n\nI've been tempted to do so, but I've never gone through with it.\n\nI'd never contemplate such a thing.\n\n\n\n10. How do you view lifelong commitment to a single romantic partner?\n\n\n\nI have or want such a romance.\n\nSuch a romance would be ideal--if it's achievable.\n\nI worry I'd miss out on what others have to offer.\n\nTie yourself to one person? Huge mistake.\n\n\n\n11. Do you insist on repayment when lending money to friends?\n\n\n\nYes, and I write up a contract so there's no misunderstanding.\n\nYes, but I try to be flexible about the exact terms.\n\nNo, although it's sure nice to be repaid.\n\nNo, they just owe me a favor.\n\n\n\n12. Are you still in touch with childhood friends?\n\n\n\nYes, we correspond regularly.\n\nYes, we try to keep in touch.\n\nNo, I move around too much.\n\nNo, I don't have anything in common with them anymore.\n\n\n\n13. Do you donate time and money to improve the local community?\n\n\n\nYes, the needs of the community are my top priority.\n\nYes, I donate as much as I can once my own needs are met.\n\nNo, I don't have enough time or money to spare.\n\nNo, my local community would be a waste of time and money.\n\n\n\n14. Your community is threatened with invasion. Do you:\n\n\n\nHelp defend it to your last breath?\n\nDefend the area with the rest of your community?\n\nFlee as soon as things look grim?\n\nCut a deal with the enemy to act as a spy?\n\n\n\n15. If you were injured and required immediate assistance, would members of your home town agree to help?\n\n\n\nYes, because they know I'd do the same for them.\n\nYes, because I'm generally well liked in my home town.\n\nProbably not, because I'm distrusted in my home town.\n\nDefinitely not, I've made some enemies in my home town.\n\n\n\n16. Do you respect the laws and authorities of the community?\n\n\n\nYes, without question.\n\nYes, they're generally the best way to govern.\n\nWhen it suits me--there are some laws I just don't agree with.\n\nI don't pay attention to the authorities; they've got no hold on me.\n\n\n\n17. Do members of your home town shun, avoid, or mock you?\n\n\n\nYes, their small minds can't handle anyone outside the norm.\n\nSome do, because I don't always fit in.\n\nNo, I'm generally seen as normal.\n\nNo, I set the standard for what is normal in my community.\n\n\n\n18. Would you stand for office or seek to represent the interests of the community in some public manner?\n\n\n\nTo do so would be an honor I'd joyously accept.\n\nOf course. It's everyone's duty to do so.\n\nOnly if no one else could handle the job.\n\nNo, I don't want to be responsible for the community's welfare.\n\n\n\n19. Your country is wracked with famine. Would you:\n\n\n\nShare what food you had with others?\n\nEat as little as possible yourself, and share the rest?\n\nSteal what food you needed to survive?\n\nSteal as much food as possible, then sell it back to the community at a high price?\n\n\n\n20. If offered enough money, would you slip a poison into your king's drink?\n\n\n\nYes, I've done similar things before.\n\nYes, if I thought I could get away with it.\n\nNo, although a vast sum of money would tempt me.\n\nNo, and I'd warn the king of the plot.\n\n\n\n21. A plague is sweeping across your country. Would you:\n\n\n\nUndertake a dangerous mission to find the cure?\n\nHeal the sick as best you can?\n\nAvoid contact with the sick?\n\nFlee the country?\n\n\n\n22. Do you respect the lawful authority of the rulers of the land?\n\n\n\nYes, Long live the queen!\n\nYes, our rulers are generally fair and just.\n\nNo, a ruler is no better than anyone else.\n\nNo, rulers are invariably corrupted by power.\n\n\n\n23. If you were offered a reasonably lucrative deal, would you spy for a hostile foreign power?\n\n\n\nYes, because this nation could stand to be knocked down a peg.\n\nYes, because the nation's secrets mean little to me.\n\nNo, because I might get caught.\n\nNo, because I'd never violate the trust my nation puts in me.\n\n\n\n24. Do you rely on the government to enforce contracts and property rights?\n\n\n\nYes, because maintaining the rule of law is more important than any individual dispute.\n\nYes, because the courts are best equipped to handle such disputes.\n\nAre you kidding me? The government can't even pave roads.\n\nAbsolutely not. If I can't defend it myself, I don't deserve to have it.\n\n\n\n25. If imprisoned, would you injure or kill others to escape?\n\n\n\nYes. Serves 'em right for locking me up.\n\nYes. They knew the risks when they took the job.\n\nNo, except for minor wounds that will heal easily.\n\nNo. Those guards are just doing their jobs.\n\n\n\n26. Do you accept a noble's right to treat badly the serfs who work on his land?\n\n\n\nYes. They're lucky they're not slaves.\n\nYes, because sometimes only fear will motivate them.\n\nNo, nobles should rule as kindly as possible.\n\nNo one has any \"right\" to treat another badly. Period.\n\n\n\n27. You have accidentally committed a crime. Do you:\n\n\n\nTurn yourself in, and attempt to make restitution to the victim?\n\nTurn yourself in, throwing yourself on the mercy of the court?\n\nHide your involvement, lying if you have to?\n\nTry to pin the crime on another?\n\n\n\n28. If guilty, would you confess to a crime?\n\n\n\nYes, because it is my duty to do so.\n\nYes, because it might get me a lighter sentence.\n\nNo, I'd make the magistrates prove my guilt.\n\nNo, and I'd try to \"prove\" my own innocence.\n\n\n\n29. Would you express a revolutionary political opinion if threatened with punishment?\n\n\n\nYes, I'd rather be punished than remain silent.\n\nYes. Somebody's got to speak the truth.\n\nNo, although I might privately express my opinion to friends.\n\nNo, politics aren't worth getting worked up about.\n\n\n\n30. While traveling, you witness an assault. You are ordered to testify, which will delay your travel significantly. Do you:\n\n\n\nSlip out of town at night to avoid testifying.\n\nDeny you saw anything.\n\nRemain reluctantly, testify, and leave.\n\nRemain until the trial's conclusion in case further testimony is needed.\n\n\n\n31. What is the best use of wealth?\n\n\n\nTo help the destitute and less fortunate.\n\nProvide for the needs of friends and family.\n\nTo stay on top of the heap yourself.\n\nTo not only stay on top, but keep others from climbing to your level.\n\n\n\n32. When confronted by beggars, do you:\n\n\n\nGive generously?\n\nGive moderately?\n\nGive only what you wouldn't miss anyway--a dollar or two at the most?\n\nIgnore them as you walk by?\n\n\n\n33. By using magic, you could fool village merchants into thinking your copper pieces were made of gold. Do you?\n\n\n\nYes, and I'll buy as much as I can.\n\nYes, but I'll only cheat the rich merchants.\n\nNo, it's too risky.\n\nNo, those merchants have families to feed.\n\n\n\n34. You have two job offers. One pays more, but the other is secure and steady. Which do you choose?\n\n\n\nDefinitely the lucrative job; steady work sounds like drudgery.\n\nProbably the lucrative job, although I'd look into the secure job.\n\nThe secure job, unless the other job was outrageously lucrative.\n\nDefinitely the secure job, because I plan for the long term.\n\n\n\n35. What's the best path to wealth?\n\n\n\nIt's a matter of luck and being in the right place at the right time.\n\nStaying flexible so you can take advantage of good opportunities.\n\nFollowing a long-term plan that incorporates a comfortable level of risk.\n\nHard work and perseverance.\n\n\n\n36. If you accepted a job or contract, would you try to finish the task even if it got much more dangerous?\n\n\n\nYes, my word is my bond.\n\nYes, because it's good to have a reputation for dependability.\n\nYou can bet I'd be renegotiating.\n\nIf it's no longer a good deal, then the deal is off.\n\n\n\n\n\n\n\nBefore clicking, make sure JavaScript is enabled, and that all pop-up window-managers are disabled!\n\n\n\n", "images": [], "top_img": "", "keywords": [], "authors": [], "canonical_link": "", "title": "Alignment Test", "meta_data": {"keywords": "d20, alignment, what, am, I, dungeons, dragons", "description": "A survey to determine what your Dungeons and Dragons alignment is."}, "movies": [], "publish_date": null, "source": "http://easydamus.com", "summary": ""}