{"url": "https://www.usmagazine.com/entertainment/news/the-bachelor-premiere-recap-who-got-aries-first-impression-rose/", "text": "“This is the most important race of my life.” That’s how racecar driver-turned-realtor and season 22 Bachelor Arie Luyendyk Jr. kicked off his journey to find love. During the Monday, January 1, premiere of The Bachelor, Arie met the lovely ladies vying for his heart, and as with any installment of the show, the episode was not without its quirks.\n\nReintroducing Arie\n\nThe two-hour premiere began by reacquainting us with Arie, considering he’s been out of Bachelor Nation’s consciousness for five years. We got an abbreviated review of his time on Emily Maynard’s season of The Bachelorette and rehashed his heartbreak. Today, Arie still races cars but also sells real estate. Oddly enough, real estate was one of the most discussed topics of the night … and if you think that sounds boring, you’re absolutely right.\n\nOne of the few successful Bachelor couples, Sean and Catherine Lowe, stopped by the mansion with their son Samuel to give Arie some advice. Sean and Arie have been friends since they both appeared on Emily’s season so the former Bachelor shared the generic tips he’s been dishing out for years — even he admitted they haven’t been working, but apparently, he signed his life over to this franchise a long time ago so it’s too late for him. However, this segment was really all about watching Arie awkwardly hold Samuel. We may have just figured out why he’s still single.\n\nMeet (Some of) the Ladies\n\nNext, we saw short pre-taped intro packages of some of the contestants. The women did a lousy job of pretending to be excited about Arie, but we did learn a couple of interesting tidbits of information.\n\nContestant Tia is friends with Raven Gates — who competed on Nick Viall’s season of The Bachelor and season 4 of Bachelor in Paradise — as if you couldn’t tell based solely on their identical accents.\n\nThere’s also a girl who collects taxidermy animals. Kendall called herself a “weird soul” and really drove that point home by singing to a dead seal. You do you, Kendall.\n\nUnforgettable Limo Entrances\n\nThe Bachelor limo entrances seem to get crazier every season, and Arie’s premiere certainly had some doozies — both of the uniquely sweet and jaw-dropping variety.\n\nMany of the women’s introductions were inspired by Arie’s racing background. Brittane stuck a “nice butt” bumper sticker on The Bachelor’s derriere. Bekah drove a ’65 cherry red Mustang up to the mansion. Maquel arrived in a race car, and somehow her waves remained intact after she removed her helmet. Ali asked Arie to smell her armpits as a cheeky reference to the many “pit stops” he’s made in his racing career.\n\nBecca kept it more traditional by luring Arie into a proposal. She guided him down on one knee and prompted him to ask her, “Are you ready to do the damn thing?” Tia, who lives in Weiner, Arkansas, gave a “little wiener” to Arie, while asking if he had one. Wow. Very uncomfortable. Speaking of uncomfortable, did we mention there are four Laurens this season? We’re not even going to try to learn all those last name initials.\n\nA Villainous First Impression\n\nOnce inside, the women had a chance to talk to Arie so he could get to know them better. Single mom Chelsea was the first to steal the Bachelor away, but according to her, her time was cut short. Chelsea gave off a villainous vibe throughout the night, talking trash about the other women and justifying her behavior by claiming she’s not a rude or competitive person.\n\nMany of her fellow contestants labeled her “aggressive” and took issue with her talking to Arie for a second time. She also stole a kiss from him — this wasn’t the first kiss of the night, though; Brittany T. received the first smooch.\n\nWhether she was teeing herself up as this season’s villain or not, Chelsea’s approach obviously worked because Arie gave her the first impression rose.\n\nRose Ceremony\n\nArie whittled the 29 women down to 21 by the end of the rose ceremony, sending Amber, Jessica, Brittane J., Ali, Bri, Lauren J., Nysha and Olivia home.\n\nThe Bachelor airs on ABC Mondays at 8 p.m. ET.", "images": ["https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered-green.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/bg-subscribe.png", "https://www.usmagazine.com/wp-content/uploads/2020/04/Screen-Shot-2020-04-09-at-11.48.30-AM.png?w=100&h=100&crop=1", "https://www.usmagazine.com/wp-content/uploads/2017/12/arie-luyendyk-jr-bachelor-night-one-chelsea-maquel-interrupt.jpg?w=300", "https://i2.wp.com/www.usmagazine.com/wp-content/uploads/2017/12/arie-luyendyk-jr-bachelor-premiere-night-one.jpg?crop=0px%2C6px%2C2000px%2C1051px&resize=1200%2C630&ssl=1", "https://www.usmagazine.com/wp-content/uploads/2020/04/woman-eating-bar1-1.jpg?w=100&h=100&crop=1", "https://www.usmagazine.com/wp-content/uploads/2017/12/arie-luyendyk-jr-bachelor-night-one-brittany-t-kiss.jpg?w=300", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/icon-download.svg", "https://www.usmagazine.com/wp-content/uploads/2020/04/shutterstock_1701843913-1.jpg?w=100&h=100&crop=1"], "top_img": "https://i2.wp.com/www.usmagazine.com/wp-content/uploads/2017/12/arie-luyendyk-jr-bachelor-premiere-night-one.jpg?crop=0px%2C6px%2C2000px%2C1051px&resize=1200%2C630&ssl=1", "keywords": [], "authors": ["Erin Crabtree"], "canonical_link": "https://www.usmagazine.com/entertainment/news/the-bachelor-premiere-recap-who-got-aries-first-impression-rose/", "title": "‘The Bachelor’ Premiere Recap: Who Got Arie’s First Impression Rose?", "meta_data": {"viewport": "width=device-width, initial-scale=1", "ir-site-verification-token": "-206090124", "fo-verify": "49e6fc6a-c68d-447f-9978-70e3eac455ac", "msvalidate.01": "097DBAAF43A9B61E9E4259AA7D75B069", "description": "Did Arie Luyendyk Jr. give his first impression rose to this season’s villain during the Monday, January 1, premiere of ‘The Bachelor’? – read Us Weekly’s recap", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "‘The Bachelor’ Premiere Recap: Who Got Arie’s First Impression Rose?", "description": "Did Arie Luyendyk Jr. give his first impression rose to this season’s villain during the Monday, January 1, premiere of ‘The Bachelor’? – read Us Weekly’s recap", "url": "https://www.usmagazine.com/entertainment/news/the-bachelor-premiere-recap-who-got-aries-first-impression-rose/", "site_name": "Us Weekly", "updated_time": "2018-01-02T16:31:10+00:00", "image": {"identifier": "https://i2.wp.com/www.usmagazine.com/wp-content/uploads/2017/12/arie-luyendyk-jr-bachelor-premiere-night-one.jpg?crop=0px%2C6px%2C2000px%2C1051px&resize=1200%2C630&ssl=1", "secure_url": "https://i2.wp.com/www.usmagazine.com/wp-content/uploads/2017/12/arie-luyendyk-jr-bachelor-premiere-night-one.jpg?crop=0px%2C6px%2C2000px%2C1051px&resize=1200%2C630&ssl=1", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/UsWeekly", "tag": "Video", "section": "Entertainment", "published_time": "2018-01-02T03:01:14+00:00", "modified_time": "2018-01-02T16:31:10+00:00"}, "fb": {"app_id": 1785612128341436}, "twitter": {"card": "summary_large_image", "description": "Did Arie Luyendyk Jr. give his first impression rose to this season’s villain during the Monday, January 1, premiere of ‘The Bachelor’? – read Us Weekly’s recap", "title": "‘The Bachelor’ Premiere Recap: Who Got Arie’s First Impression Rose?", "site": "@usweekly", "image": "https://i2.wp.com/www.usmagazine.com/wp-content/uploads/2017/12/arie-luyendyk-jr-bachelor-premiere-night-one.jpg?crop=0px%2C6px%2C2000px%2C1051px&resize=1200%2C630&ssl=1", "creator": "@usweekly"}, "generator": "WordPress 5.4"}, "movies": [], "publish_date": 1514862074.0, "source": "https://www.usmagazine.com", "summary": ""}