{"url": "en.wikipedia.org/wiki/Ocean%27s_8", "text": "2018 film by Gary Ross\n\nOcean's 8 (stylized onscreen as Ocean's Eight) is a 2018 American heist comedy film directed by Gary Ross and written by Ross and Olivia Milch. The film is both a continuation and a spin-off from Steven Soderbergh's Ocean's trilogy and features an ensemble cast including Sandra Bullock, Cate Blanchett, Anne Hathaway, Mindy Kaling, Sarah Paulson, Rihanna, Helena Bonham Carter, and Awkwafina. The film follows a group of women led by Debbie Ocean, the sister of Danny Ocean, who plan a sophisticated heist of the annual Met Gala at the Metropolitan Museum of Art in New York City.\n\nAfter the release of Ocean's Thirteen in 2007, Soderbergh stated he had no intentions of making a fourth film, citing his desire to have the series \"go out on top\". However, an all-female spin-off was announced in October 2015, with much of the cast signing on by August 2016. Filming took place from October 2016 to March 2017 around Manhattan.\n\nOcean's 8 premiered at Alice Tully Hall on June 5, 2018, and was released by Warner Bros. Pictures in the United States on June 8, 2018, 11 years to the day of the release of Ocean's Thirteen. The film grossed $297 million worldwide and received a lukewarm response from critics, who applauded the chemistry of the cast but found the movie undemanding and less consistent than the films in Soderbergh's trilogy.\n\nPlot [ edit ]\n\nNewly paroled con artist Debbie Ocean (Sandra Bullock), the late Danny Ocean's younger sister, convinces former partner-in-crime Lou (Cate Blanchett) to join her in a new heist. They assemble their team: bankrupt fashion designer Rose Weil (Helena Bonham-Carter), jewelry maker Amita (Mindy Kaling) who is eager to move out of her mother's house, security hacker Nine Ball (Rihanna), street hustler and skilled pickpocket Constance (Awkwafina), and profiteer Tammy (Sarah Paulson), who fences stolen goods out of her suburban home.\n\nDebbie plans to steal the Toussaint, a $150 million Cartier necklace, during the upcoming Met Gala and use movie star Daphne Kluger (Anne Hathaway) as a mule. The team manipulates Daphne into hiring Weil and convince Cartier to loan Daphne the Toussaint. They digitally scan the necklace to manufacture a worthless cubic zirconia replica. Tammy secures a job at Vogue and gains access to the gala, and Debbie leads Daphne to invite art dealer Claude Becker (Richard Armitage), whose betrayal sent Debbie to prison, as her date. Lou confronts Debbie for planning revenge against Becker, but Debbie reassures her this is not the case.\n\nWhen Rose learns the Toussaint can only be unclasped by a special magnet carried by Cartier's bodyguards, Nine Ball enlists her younger sister Veronica's help in solving the mechanism. At the gala, Lou spikes Daphne's soup, causing her to vomit in the restroom, a blind spot to the Met's cameras created by Nine Ball. Constance removes the necklace and sneaks it to Amita, who splits it into smaller pieces of jewelry. The Toussaint's disappearance triggers the museum's evacuation, but the search ends when Tammy \"finds\" the duplicate necklace. Constance slips the Toussaint pieces to the team to smuggle out; Debbie plants a piece on Becker. After the heist, Debbie and Lou reveal Daphne had been in on the plan.\n\nCartier discovers the recovered necklace is a fake and dispatches insurance investigator John Frazier. Having crossed paths with the Oceans before, Frazier immediately suspects Debbie, but her careful presence on the gala's video footage gives her an unbeatable alibi. She tells Frazier she may know who stole the necklace. Daphne visits Becker and sends Frazier a picture of the jewel Debbie planted. To further frame Becker, Debbie hires actresses posing as elderly socialites to sell the Toussaint off piece-by-piece and deposit the money into an account in Becker's name. Frazier takes Becker into custody.\n\nAs the eight celebrate their success, Lou reveals the heist's true target: while the gala was being evacuated, she and \"The Amazing\" Yen replaced a Met display of royal jewels with replicas, escaping with gems even more valuable than the Toussaint. With a larger-than-expected share of the score, each member of the team goes her separate way: Amita travels to Paris with a man she meets on Tinder, Weil pays off her debts and opens her own store, Constance buys a spacious loft in the city and becomes a YouTuber, Tammy expands her business in stolen goods, Nine Ball opens a pool hall, Daphne becomes a film director, Lou takes her motorcycle on a cross-country road trip, and Debbie visits Danny's tomb and enjoys a martini knowing he would be proud of her.\n\nCast [ edit ]\n\nAdditionally, Dakota Fanning appears as Penelope Stern, a celebrity who Kluger is jealous of, and Nathanya Alexander appears as Veronica, Nine Ball's younger sister.[4] Elliott Gould and Qin Shaobo reprise their roles from the previous films as Reuben Tishkoff and \"The Amazing\" Yen, respectively. Matt Damon and Carl Reiner were also set to reprise their respective characters Linus Caldwell and Saul Bloom, but their scenes were cut.[5][6] Marlo Thomas, Dana Ivey, Mary Louise Wilson and Elizabeth Ashley appear as elderly actresses who help the crew shift their stolen gems.[7] Celebrities who cameo as themselves in the film include Anna Wintour, Zayn Malik, Katie Holmes, Maria Sharapova, Serena Williams, Kim Kardashian West, Common, Adriana Lima, Desiigner, Kylie Jenner, Alexander Wang, Kendall Jenner, Ira Glass, Gigi Hadid, Lily Aldridge, Olivia Munn, Jaime King, Zac Posen, Hailey Bieber, Derek Blasberg, Sofia Richie, Heidi Klum, Kelly Rohrbach, and Lauren Santo Domingo.[8][9]\n\nProduction [ edit ]\n\nAfter the release of Ocean's Thirteen, Steven Soderbergh stated that there would not be an Ocean's Fourteen, noting that George Clooney wanted \"to go out strong\" with the third film.[10] In December 2008, Soderbergh again said that a fourth film in the franchise was unlikely, this time citing the recent death of Bernie Mac, who had appeared in the earlier films.[11] However, a female focused spin-off starring Sandra Bullock was in development as of October 2015.[12][13] Helena Bonham Carter, Cate Blanchett, Mindy Kaling, and Elizabeth Banks were later announced to star in the film,[14] though Banks' presence turned out to be a rumor that did not materialize.[15]\n\nIn August 2016, Bullock, Blanchett, Bonham Carter and Kaling were confirmed to star, with Anne Hathaway, Rihanna, Awkwafina, and Sarah Paulson closing deals to fill the cast.[16][17] During production on the film, Dakota Fanning and Damian Lewis were spotted on set, with Lewis's casting being confirmed in December 2016 and Fanning confirming her casting in March 2017. However, Lewis does not appear in the finished film.[18][19]\n\nOn November 11, 2016, Richard Robichaux was also cast in the film.[20] That same month, Matt Damon stated he would appear in the film, reprising his role from the Ocean's Trilogy;[21][22][23] however, his scene was not included in the finished film. In January 2017, James Corden joined the cast as an insurance broker who begins to grow suspicious of the group.[24] That same month, it was revealed Anna Wintour, Alexander Wang, Zac Posen, Derek Blasberg, Lauren Santo Domingo, Kim Kardashian West, Kendall Jenner, Kylie Jenner, Katie Holmes, Olivia Munn, Hailey Baldwin and Zayn Malik were announced to cameo in the film.[25][26][27][28] That same month, Richard Armitage joined the cast of the film.[29]\n\nPrincipal photography on the film began on October 25, 2016, in New York City.[30][31] In March 2017, Blanchett said production had officially been completed.[32]\n\nOn May 5, 2017, it was announced that filming would continue on Staten Island at the former Arthur Kill Correctional Facility, which Broadway Stages was in the process of acquiring after an initial rejection.[33]\n\nBox office [ edit ]\n\nAfter premiering at Alice Tully Hall in New York City on June 5, 2018,[34] Ocean's 8 was released by Warner Bros. to theaters in North America on June 8.[35][36] Ocean's 8 grossed US$140.2 million in the United States and Canada, and US$157.5 million in other territories, for a total worldwide gross of US$297.7 million, against a production budget of $70 million.[3]\n\nIn the United States and Canada, Ocean's 8 was released alongside Hotel Artemis and Hereditary, and was projected to gross around US$45 million from 4,145 theaters in its opening weekend, although some tracking firms had it debuting with as low as $30 million. Deadline Hollywood noted that it was tracking on-par with the 2016 all-female Ghostbusters reboot (which opened to $46 million), and had more interest from audiences than the likes of fellow female-led comedies The Heat ($39.1 million debut), Spy ($29.1 million) and Girls Trip ($31.2 million).[37] The film made $4 million from Thursday night previews, including $100,000 from additional early screenings Wednesday night, and $15.8 million on its first day (including previews). It went on to debut to $41.6 million, 69% of its audience was female.[38][39] In its second weekend the film made $19 million, finishing second behind newcomer Incredibles 2.[40] In its third weekend the film earned $11.7 million, finishing third behind Jurassic World: Fallen Kingdom and Incredibles 2.[41]\n\nOverseas the film was released in 16 countries alongside the United States and made $12.2 million in its opening weekend. Its largest markets were Australia ($4.7 million), Mexico ($2.6 million) and Brazil ($1.7 million).[42] By its third week of release (where it made $26.9 million), the film had an international total of $70.9 million. Its largest markets were United Kingdom ($14 million), Australia ($13.6 million), Japan ($11.7 million), South Korea ($10.8 million), Germany ($7.4 million), Mexico ($6.3 million), and Brazil ($5.6 million).[43]\n\nHome media [ edit ]\n\nOcean's 8 was first released on Digital HD on August 21, 2018.[44] Warner Bros. Home Entertainment then released the film on DVD, Blu-ray, and 4K UHD Combo Pack on September 11, 2018.[45] The film debuted at the top of the NPD VideoScan First Alert chart for the week ending on September 15, 2018.[46]\n\nCritical reception [ edit ]\n\nAccording to several media outlets, Ocean's 8 received a generally lukewarm response from critics.[47] On review aggregation website Rotten Tomatoes, the film holds an approval rating of 69% based on 347 reviews, and an average rating of 6.27/10. The website's critical consensus reads, \"Ocean's 8 isn't quite as smooth as its predecessors, but still has enough cast chemistry and flair to enjoyably lift the price of a ticket from filmgoers up for an undemanding caper.\"[48] At Metacritic, which assigns a normalized rating to reviews, the film has a weighted average score of 61 out of 100, based on reviews from 50 critics, indicating \"generally favorable reviews\".[49] According to BBC News, while critical reviews of the film were \"broadly positive\", \"most had some reservations\".[50] Audiences polled by CinemaScore gave the film an average grade of \"B+\" on an A+ to F scale, the same score earned by Ocean's Eleven and Thirteen.[38]\n\nWriting for Rolling Stone, Peter Travers gave the film 3 out of 4 stars and praised the cast (namely Bullock, Blanchett and Hathaway), saying, \"Ocean's 8 is a heist caper that looks gorgeous, keeps the twists coming and bounces along on a comic rhythm that's impossible to resist. What more do you want in summer escapism?\"[51] Alonso Duralde of TheWrap called the film \"slick, charming and funny,\" though added it never quite kicks into high gear\" and said, \"Cinematographer Eigil Bryld gives the proceedings the high-gloss of a SkyMall catalog, which is appropriate for a movie about robbing a legendary Cartier necklace at fashion's most exclusive event...And between the sheen and the talented performers, Ocean's 8 does eventually coast on froth and good will.\"[52]\n\nVariety's Owen Gleiberman said it is \"clever enough to get by\" and wrote \"Ocean's 8 is a casually winning heist movie, no more and no less, but like countless films devoted to the exploits of cool male criminals, it lingers most...as a proudly scurrilous gallery of role models.\" He found Hathaway \"commanding at every moment\" and believed Bullock projected \"the debauched insolence\" and ideological drive of \"a hungry criminal\", but lamented the scarcity of impressive dialogue for Paulson and Blanchett, who \"don't get a chance to create indelible characters\".[53] In The Boston Globe, Ty Burr was more impressed by Blanchett's performance (\"the Boss of This Movie\") and said, apart from Hathaway, the film largely depended on the \"established personas\" of the actors.[54]\n\nMichael Phillips of the Chicago Tribune gave the film 2 out of 4 stars and said, \"Some movies are more about parallel play than actual playground interaction, and despite a screenful of terrifically skillful talents, Ocean's 8 never quite gets its ensemble act together. It's smooth, and far from inept. But it isn't much fun. That's all you want from a certain kind of heist picture, isn't it? Fun?\"[55] Writing for the Chicago Sun-Times, Richard Roeper said the cast \"banters beautifully, but the heist is a bit too breezy\", lacking a \"formidable, hiss-worthy villain\" and \"darker, more challenging, more nuanced adventure\".[56]\n\nResponse from actors [ edit ]\n\nKaling and Blanchett attributed the lukewarm reception to the dominance of male critics and a lack of diversity among mainstream film reviewers. In an interview with Yahoo! Movies, Kaling cited actress Meryl Streep's criticism of Rotten Tomatoes and said, \"There is obviously an audience out there who want to watch things like [Ocean's 8], what I work on, what Sarah [Paulson] works on ... I think white men, critics would enjoy [the movie], would enjoy my work, but often I think there is a critic who will damn it in a way because they don't understand it, because they come at it at a different point of view, and they're so powerful, Rotten Tomatoes.\"[47]\n\nSeveral film journalists strongly disagreed with claims that the reception had been dictated by the gender and ethnicity of the critics. Guy Lodge, a chief film critic for Variety, highlighted the fact that several female reviewers, including Emily Yoshida from Vulture and Time magazine's Stephanie Zacharek, concurred with the general lukewarm response.[47] Justin Chang, an Asian-American critic for the Los Angeles Times, argued that film criticism needed increased diversity, but \"We negate the possibility of sympathetic imagination when we assume that someone’s particular affinity for a work of art will be dictated in advance by specifics of race, gender and age.\" He instead argued that the benefits would be a broader pool of talent and perspectives.[57] Donald Clarke from The Irish Times pointed out that film had received a \"fresh\" rating on Rotten Tomatoes, and a better score than Ocean's Twelve.[58]\n\nAccolades [ edit ]\n\nSee also [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Anne_Hathaway_in_2017.png/111px-Anne_Hathaway_in_2017.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/13/SandraBullockMay09.jpg/130px-SandraBullockMay09.jpg", "https://upload.wikimedia.org/wikipedia/en/d/dd/OceansEightPoster.jpeg", "http://upload.wikimedia.org/wikipedia/en/d/dd/OceansEightPoster.jpeg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Cate_Blanchett_2011.jpg/122px-Cate_Blanchett_2011.jpg", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/d/dd/OceansEightPoster.jpeg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Ocean%27s_8", "title": "Ocean's 8", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/d/dd/OceansEightPoster.jpeg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}