{"url": "www.theatlantic.com/family/archive/2018/05/prince-harry-meghan-markle-royal-wedding/560681/", "text": "For those aspiring fairy-tale brides unable to shell out $180,000—which is what Disney’s ultimate fairy tale will set you back—there are other, cheaper ways to feel like a princess. After their weddings, according to Otnes, Princess Diana and Kate Middleton each transformed the wedding-dress industry. “Diana got married in a big, poofy dress with puffed sleeves, Kate in a lacy, fitted gown. The dresses became immediate sources of emulation. There is a reason everyone is waiting with bated breath to find out what Meghan will wear,” said Otnes (who will be celebrating the wedding with her colleagues, wearing fascinator hats and enjoying a British high tea).\n\nThe fairy-tale wedding dates back to 15th-century Venice, when a writer named Giovanni Francesco Straparola invented what is now recognized as the standard happy ending. “Before this point, at the end of fairy tales, you had the prince and princess living as hermits, not getting married, waiting to receive their ultimate rewards in heaven,” said Ruth Bottigheimer, a professor at Stony Brook University who specializes in fairy tales. “The new happy ending takes place here on earth, and it takes the shape of a wedding.” Classic fairy-tale weddings involve at least one royal, Bottigheimer said, “because that’s where the money is—the power.” In mid-19th-century Germany, the era of the Brothers Grimm, fairy tales were widely taught in schools. At that point, Bottigheimer said, “the happily-ever-after plot gets injected into the whole European population.”\n\nThe fairy-tale wedding—as a consumable good, not a fictional happy ending—arrived in the United States in the 1950s, says Stephanie Coontz, a professor of marriage and family history at Evergreen State College. When World War II ended, marriage rates skyrocketed. Women, employed during the war while the men were away, left the workplace in droves and got married. In 1950, the average age of marriage for women was 20. “If you waited four or five years after that, you’d be labeled a spinster,” Coontz said. In the midst of that pressure, the wedding industry identified an enormous opportunity, using ads to convince women that their wedding would be the biggest day of their lives. At the same time, Disney debuted its rendition of the world’s most famous fictional princess: When it came out in 1950, Cinderella—which ends, of course, in a gilded royal wedding—was, by one count, the highest-grossing film of the year. And so began what Coontz calls “the relentless pursuit of the princess.”\n\nThere was something special about Cinderella. In the sweet girl next door who talks to birds and sleeps in the kitchen, Coontz told me, women saw themselves. “This idea that someone who can support you at that level of opulence chooses you, instead of a blue blood … that is a very attractive fantasy,” Coontz says. Particularly after Grace Kelly—another “commoner” (who, yes, happened to be a wildly famous actress)—married Prince Rainier of Monaco in 1956, the fairy-tale wedding suddenly felt, well, if not within reach, then at least something worth fantasizing about. The most recent royal marriages, according to Coontz, have been so popular because they play out the same storyline: Rich, royal dude swoops in to save a regular girl from a lifetime of oppressive normality. (Both Middleton and Markle were considered “commoners” at the time of their engagements, though genealogists have since claimed distant royal ties.) “In the past, kings and princes couldn’t marry commoners, so there was no point in fantasizing about it much,” Coontz said. “Now we’ve seen the idea of a ‘love match’ become a reality.”", "images": ["https://cdn.theatlantic.com/thumbor/INGJwI0sdlSuWNEQ_8n4YU6O71U=/988x0:4444x3456/200x200/media/None/IMG_9419-2/original.jpg", "https://cdn.theatlantic.com/assets/media/files/nav-crossword.png", "https://cdn.theatlantic.com/thumbor/ifR4XGeXKWnBDokH-pOGleoEvOc=/0x43:2000x1084/960x500/media/img/mt/2018/05/RoyalWedding/original.jpg", "https://atlanticmedia.122.2o7.net/b/ss/atlanticprod/1/H.22--NS/0", "https://cdn.theatlantic.com/thumbor/EQHKeKKEggnumXpcZS4ObspsCdg=/27x15:1974x1110/720x405/media/img/mt/2018/05/RoyalWedding/original.jpg"], "top_img": "https://cdn.theatlantic.com/thumbor/ifR4XGeXKWnBDokH-pOGleoEvOc=/0x43:2000x1084/960x500/media/img/mt/2018/05/RoyalWedding/original.jpg", "keywords": [], "authors": ["Caroline Kitchener"], "canonical_link": "https://www.theatlantic.com/family/archive/2018/05/prince-harry-meghan-markle-royal-wedding/560681/", "title": "The Enduring Appeal of the Fairy-Tale Wedding", "meta_data": {"viewport": "width=device-width,initial-scale=1", "description": "Even in this modern age, many brides still just want to feel like princesses.", "theme-color": "#000000", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-status-bar-style": "black", "apple-mobile-web-app-title": "The Atlantic", "referrer": "unsafe-url", "og": {"site_name": "The Atlantic", "locale": "en_US", "title": "The Enduring Appeal of the Fairy-Tale Wedding", "type": "article", "url": "https://www.theatlantic.com/family/archive/2018/05/prince-harry-meghan-markle-royal-wedding/560681/", "image": "https://cdn.theatlantic.com/thumbor/ifR4XGeXKWnBDokH-pOGleoEvOc=/0x43:2000x1084/960x500/media/img/mt/2018/05/RoyalWedding/original.jpg", "description": "Even in this modern age, many brides still just want to feel like princesses."}, "fb": {"pages": "29259828486,1468531833474495,1061579677251147,457711054591520,370457103090695,1631141167169115,148681772342453,1510507419185410,128344747344340,128377530562508,236061986423933", "admins": "577048155,17301937", "app_id": 100770816677686}, "p": {"domain_verify": "68e1a0361a557708fefc992f3309ed70"}, "twitter": {"site": "@theatlantic", "domain": "theatlantic.com", "card": "summary_large_image", "image": {"src": "https://cdn.theatlantic.com/thumbor/ifR4XGeXKWnBDokH-pOGleoEvOc=/0x43:2000x1084/960x500/media/img/mt/2018/05/RoyalWedding/original.jpg"}}, "application-name": "theatlantic", "msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "https://cdn.theatlantic.com/assets/static/b/theatlantic/img/lacroix/apple-touch-icon-iphone.50541ad29f2c.png", "ROBOTS": "INDEX, FOLLOW", "krux": {"title": "The Enduring Appeal of the Fairy-Tale Wedding", "description": "Even in this modern age, many brides still just want to feel like princesses."}, "author": "Caroline Kitchener", "ia": {"markup_url": "https://www.theatlantic.com/facebook-instant/article/560681/"}, "article": {"publisher": "https://www.facebook.com/TheAtlantic/", "opinion": "false", "content_tier": "metered", "tag": "family", "section": "Family", "published_time": "2018-05-18T06:00:00-04:00", "modified_time": "2018-05-18T13:27:35-04:00"}, "keywords": "fairy tale, fairy-tale wedding, Classic fairy-tale weddings, fairy tales, Prince William marry, fairy tale wedding, royal wedding, ultimate fairy tale, premium wedding line, princess, famous fictional princess, Kate Middleton, Walt Disney World, life-size cardboard cutouts, planning viewing parties, fairy-tale brides, royal dude swoops, recent royal marriages, pumpkin-inspired plastic sphere, fairy-tale wedding—as, distant royal ties, standard happy ending, British high tea, Stony Brook University, Giovanni Francesco Straparola, Evergreen State College, wildly famous actress, fairy-tale fixation, Disney princess, Appalachian State University, Henry-Meghan viewing party, word princess, certain gender stereotypes, Princess Diana, Coontz, Lavish Wedding, Meghan Markle, Prince Charles, wedding industry, princess narratives, Meghan accoutrements, ‘fairy-tale wedding, Prince Harry, princess-inspired wedding, women, Stephanie Coontz, marry commoners, Cele Otnes, royal weddings, gilded royal", "news_keywords": "fairy tale, fairy-tale wedding, Classic fairy-tale weddings, fairy tales, Prince William marry, fairy tale wedding, royal wedding, ultimate fairy tale, premium wedding line, princess, famous fictional princess, Kate Middleton, Walt Disney World, life-size cardboard cutouts, planning viewing parties, fairy-tale brides, royal dude swoops, recent royal marriages, pumpkin-inspired plastic sphere, fairy-tale wedding—as, distant royal ties, standard happy ending, British high tea, Stony Brook University, Giovanni Francesco Straparola, Evergreen State College, wildly famous actress, fairy-tale fixation, Disney princess, Appalachian State University, Henry-Meghan viewing party, word princess, certain gender stereotypes, Princess Diana, Coontz, Lavish Wedding, Meghan Markle, Prince Charles, wedding industry, princess narratives, Meghan accoutrements, ‘fairy-tale wedding, Prince Harry, princess-inspired wedding, women, Stephanie Coontz, marry commoners, Cele Otnes, royal weddings, gilded royal"}, "movies": [], "publish_date": 1526637600.0, "source": "http://www.theatlantic.com", "summary": ""}