{"url": "https://web.archive.org/web/20091229194623/http://www.bobmcdonnell.com/index.php/press_releases/details/mcdonnell_letter_urges_no_delay_in_virginia_offshore_energy_exploration_and/", "text": "McDonnell Letter Urges No Delay in Virginia Offshore Energy Exploration and Development\n\nGovernor-elect writes Secretary of the Interior Ken Salazar McDonnell: “….it is time to develop our offshore energy resources to create new jobs and provide necessary new revenue for schools, roads, public safety and alternative energy research and development in Virginia.”\n\nRICHMOND- Virginia Governor-elect Bob McDonnell expressed his continued strong support of offshore energy exploration and development off the coast of Virginia in a letter sent to United States Secretary of the Interior Ken Salazar this past Wednesday. In the letter, McDonnell cautioned against any further delay in the Virginia offshore lease sale scheduled for 2011, and presented the Secretary with the position of his incoming Administration on the issue. The text of the Governor-elect’s full letter is below.\n\n\n\n\n\nDecember 23, 2009\n\nThe Honorable Ken Salazar\n\nSecretary of the Interior\n\nDepartment of the Interior\n\n1849 C Street, N.W\n\nWashington DC 20240\n\nDear Secretary Salazar,\n\nLast month I had the honor of being elected Governor of Virginia commencing January 16, 2010. A key priority for us here in Virginia is the development of the full range of energy resources, both traditional and renewable, to foster energy independence, national security and economic development.\n\nMore than fifteen months have passed since the United States Congress allowed the federal moratorium on exploration and development of oil and natural gas resources off the Atlantic Coast to expire, and President Bush repealed a similar executive order banning such action. This cleared the way for Virginia to be the first state on the Atlantic seaboard to explore and drill beginning in 2011. Virginia is eager to get started. Nearly a year ago the public comment period for the potential lease sale offshore Virginia (Lease Sale 220) ended. Unfortunately it appears that virtually no progress has been made at the federal level to get this process rolling.\n\nI am requesting that Virginia remain in the current five-year plan and that the federal administrative process move forward with Lease Sale 220 immediately. Any effort to remove or delay Virginia’s participation in the lease sale would significantly hamper our efforts to create jobs, eliminate much-needed new revenue, and undermine support for President Obama’s stated commitment to make the United States more energy secure.\n\nThe opportunity to explore and develop oil and natural gas resources off the coast of Virginia, miles out of sight from our beaches in an environmentally sound manner, is timely for both our nation and our Commonwealth. Like every other state, Virginia is struggling with the high unemployment that accompanies the current tough economic environment. Some parts of our state have an unemployment rate as high as 19 percent. Additionally, America needs secure and diverse energy sources that do not leave us dependent on foreign governments adverse to our national interests.\n\nA 2005 study by a former president at Old Dominion University forecast that offshore natural gas production alone off of the Atlantic coast near Virginia would, over a 10-year period, likely create at least 2,578 new jobs, induce capital investment of $7.84 billion, yield $644 million in direct and indirect payroll, and result in $271 million in state and local taxes. The study also estimated that there could be up to 500 million barrels of oil in this lease area – enough to fuel all four million cars in Virginia for more than four years.\n\nThese economic projections, combined with tremendous technological advancements that have transformed the offshore oil and natural gas industry and make exploration and development environmentally sound, make it clear that there is no reasonable basis for further delays in beginning the leasing process. The Gulf States have been safely exploring and drilling for oil and natural gas for years, and have done so safely despite hurricanes passing over the platforms in the Gulf.\n\nAdditionally, it is critically important as a matter of equity that the Commonwealth receive the same royalties, rentals, and bonus bid payments as do all the other states which currently allow energy exploration and production off of their coasts. I implore you to work with Congressional leaders, as I will, for passage of legislation to ensure that Virginia participates in a fair and equitable distribution of future offshore revenues.\n\nOffshore energy exploration and production will be a priority in my administration. I would like to work with you and the President to make Virginia an international leader in offshore energy exploration and production on the Atlantic coast. It is important for both our Commonwealth and our country. We also intend to aggressively pursue offshore renewable energy sources such as wind farms, and will be asking for your assistance at that appropriate time.\n\nI ask you today to do everything in your power to ensure Lease Sale 220 stays on schedule, including the prompt completion of an environmental impact statement and the processing of all other administrative steps necessary for holding the lease sale in 2011. I am aware of several major energy companies that are ready to bid for the leasehold rights, generating hundreds of millions of dollars for the state and federal governments. Virginia stands ready to help address America’s energy needs while creating badly needed good-paying jobs for our citizens.\n\nMr. Secretary, it is time to develop our offshore energy resources to create new jobs and provide necessary new revenue for schools, roads, public safety and alternative energy research and development in Virginia. I respectfully request that you direct the U.S. Minerals Management Service to expedite its preparatory work in support of the lease sale in 2011. The leasing process should not be further delayed.\n\nThank you for your attention to this critical matter. I am committed to working with you as we move forward with this tremendous opportunity for the Commonwealth of Virginia and the United States of America.\n\nWith warm personal regards, I remain\n\nSincerely,\n\nRobert F. McDonnell\n\ncc: The Honorable Tim Kaine\n\nGovernor of the Commonwealth of Virginia\n\nThe Honorable James H. Webb, Jr\n\nMember, United State Senate\n\nThe Honorable Mark R. Warner\n\nMember, United States Senate\n\nVirginia Delegation to the U.S. House of Representatives\n\nThe Honorable Steven Chu\n\nU.S. Secretary of Energy\n\nThe Honorable William Howell\n\nSpeaker, Virginia House of Delegates\n\nThe Honorable Richard Saslaw\n\nMajority Leader, Virginia State Senate\n\nThe Honorable Ward Armstrong\n\nMinority Leader, Virginia House of Delegates\n\nThe Honorable Thomas Norment\n\nMinority Leader, Virginia State Senate", "images": ["https://web.archive.org/web/20091229194623im_/http://www.bobmcdonnell.com/images/site_images/home/house.jpg", "https://web.archive.org/web/20091229194623im_/http://www.bobmcdonnell.com/favicon.ico"], "top_img": "https://web.archive.org/web/20091229194623im_/http://www.bobmcdonnell.com/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "McDonnell Letter Urges No Delay in Virginia Offshore Energy Exploration and Development", "meta_data": {}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}