{"url": "www.newidea.com.au/brad-pitt-jennifer-aniston-wed-in-missouri", "text": "Reverend Swadley – the local wedding priest and friend of the Pitt family – has confirmed to friends that the A-list couple recently spent a week with Brad’s family, discussing detailed plans for a wedding.\n\nIt’s believed the loved-up stars had flown to Missouri because Jen was desperate to reconnect with Brad’s mum, Jane, who she’d developed a very close bond with throughout the time of their first marriage.\n\nDuring the seven-day visit, it’s been revealed that Jane orchestrated a meeting with the family priest Reverend Swadley – hoping it would be the gentle push Brad and Jen would need to make their reignited relationship official once again.\n\n‘Reverend Swadley met Jen recently at a family function that Brad’s mum, Jane, threw at their family home in Missouri,’ a close friend of the pastor’s told New Idea exclusively.\n\n‘Jen accompanied Brad home on the trip and attended church services with the family as well as joining Brad at meetings at the now-retired reverend’s home, who Brad reconnected with after he decided to find himself and renew his faith, following his split from Ange.\n\n‘He remarked at how at ease Jen was with his family, who clearly adore her, and how everyone said how much she’s been missed and how happy they all were to have her back in Brad’s – and their – lives.’\n\nThe source goes on to reveal that Reverend Swadley spoke at length with Brad and Jen about getting married as soon as possible, in Missouri, in a small ceremony, with just local friends and family present.\n\n‘Reverend Swadley revealed how in love Brad and Jen were and how they planned to officially wed as soon as their divorces were finalised, with him agreeing to conduct the ceremony and welcome them both back into the church,’ the friend of the pastor told New Idea.\n\nReverend Swadley revealed to our source that it was clear Jen loved seeing Brad’s family again, spending long days talking and laughing for the first time since their 2005 divorce.\n\n‘Jen spent five days reconnecting with Brad’s parents, brother and sister and many of his childhood friends who he remains close to,’ a friend of the pastor reveals.\n\nBrad Pitt's parents are nothing but supportive Getty\n\n‘He said Jen kept saying how grateful she was that they’d been brought back together. And how they’ll both be baptised later this year before they officially wed – with Jen’s father, John, vowing to be at her side for the service and give her away again at their wedding, which will hopefully take place shortly after and be far more low-key than their original star-studded nuptials in Malibu.’\n\nIt’s the latest chapter in the pair’s rekindled romance since Jen announced her split from estranged husband Justin Theroux in February. She has wasted no time in rebuilding her relationship with ex-husband Brad, spending time with his six children, and developing a unique and special bond with his 11-year-old daughter Shiloh.\n\nIt’s that close relationship between Jen and his kids that has prompted Brad to want to marry Jen as soon as soon as possible.\n\n‘Brad’s mum Jane was all over them to get married as soon as possible, but the truth is Brad needs no convincing,’ says a source close to Brad. ‘They still want to keep this relationship close to their chest and out of the public eye, but behind closed doors they couldn’t be happier.\n\n‘And for Brad, seeing how much his children – especially Shiloh – love Jen has just made his heart soar. He knows he wants Jen to be his wife again.\n\n‘We’re pretty sure they’ll be married in Missouri before the end of the year, Brad and Jen are both keen to push through their divorces as soon as possible so they can walk down the aisle together. That’s all that they want.’\n\nFor the full story see this weeks issue of New Idea - out now!", "images": ["http://www.newidea.com.au/Branding/newidea/images/brand-logo-gray.svg", "https://snowplow.swm.digital/i?e=se&se_ca=ping&tv=http-get-0.1.0&dtm=0&stm=0&tna=pac&p=web", "http://www.newidea.com.au/media/73139/ni4619_cover_nobc_bws.png?height=158", "http://www.newidea.com.au/Branding/newidea/Images/idm-error-icon.svg", "http://www.newidea.com.au/Branding/newidea/images/gmail.svg", "http://secure-gl.imrworldwide.com/cgi-bin/m?ci=au-pacmags&cg=0&cc=1&ts=noscript", "http://www.newidea.com.au/Branding/NewIdea/images/brand-logo-footer-new.svg", "http://www.newidea.com.au/media/25428/brad-and-jen-pre.jpg", "http://www.newidea.com.au/Branding/newidea/images/idm-thanks-icon.svg", "http://www.newidea.com.au/Branding/NewIdea/images/enhanced-header-logo.svg"], "top_img": "http://www.newidea.com.au/media/25428/brad-and-jen-pre.jpg", "keywords": [], "authors": ["Faye James"], "canonical_link": "https://www.newidea.com.au/brad-pitt-jennifer-aniston-wed-in-missouri", "title": "Brad Pitt and Jennifer Aniston married in Missouri!", "meta_data": {"language": "en-us", "description": "Brad Pitt's family priest has sensationally confirmed that he and Jennifer Aniston will marry in the actor's US home town of Missouri 'as soon as possible.'", "news_keywords": "Brad Pitt, Jennifer Aniston, Brad Pitt and Jennifer Aniston, Jen and Brad, Jen and Brad wedding, Jen Aniston wedding, Brad Pitt wedding, Jen Aniston and Brad Pitt back together, celebrity weddings, celeb weddings, celebrity news, celeb news, latest celebrity news, latest celeb news", "robots": "index, follow", "og": {"site_name": "New Idea", "type": "article", "url": "https://www.newidea.com.au/brad-pitt-jennifer-aniston-wed-in-missouri", "title": "Brad Pitt and Jennifer Aniston married in Missouri!", "description": "Brad Pitt's family priest has sensationally confirmed that he and Jennifer Aniston will marry in the actor's US home town of Missouri 'as soon as possible.'", "image": {"identifier": "http://www.newidea.com.au/media/25428/brad-and-jen-pre.jpg", "width": 1500, "height": 800}}, "twitter": {"title": "Brad Pitt and Jennifer Aniston wed in Missouri, wedding priest coming forward", "description": "Brad Pitt's family priest has sensationally confirmed that he and Jennifer Aniston will marry in the actor's US home town of Missouri 'as soon as possible.'", "image": "http://www.newidea.com.au/media/25428/brad-and-jen-pre.jpg", "url": "https://www.newidea.com.au/brad-pitt-jennifer-aniston-wed-in-missouri"}, "fb": {"admins": 863618607005758, "pages": 140279489324860}, "msvalidate.01": "3BD3CB44DC500E9821E82E085D0F0D13", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1523220561.663, "source": "http://www.newidea.com.au", "summary": ""}