{"url": "https://people.com/tv/inside-bethenny-frankel-relationship-dennis-shields/", "text": "Image zoom Bravo\n\nBethenny Frankel and late love Dennis Shields took their romance public in June 2016, but the pair had actually known each other for nearly 30 years.\n\nOn Friday, the Real Housewives of New York City reality star’s on-off again boyfriend was found dead in his Trump Tower apartment of a suspected overdose.\n\nGet push notifications with news, features and more.\n\nFrankel and Shields’ relationship was at the center of some controversy when they first started dating because the N.Y.C. banker was still legally married at the time.\n\nIn 1990, he wed Jill Schwartzberg, who went to the same high school as Frankel. But the couple separated in 2016, several months before he began dating the SkinnyGirl mogul. (In a statement to PEOPLE, Jill said, “We are all heartbroken. Dennis was, and will always be, the love of my life. His spirit lives on in our children. Please respect our family’s privacy at this time.”)\n\nIn 2013, Frankel filed for divorce from ex-husband Jason Hoppy, with whom she shares 8-year-old daughter Bryn.\n\nOn camera, Frankel always seemed hesitant to define the nature of her relationship with Shields.\n\nImage zoom Alessio Botticelli/GC\n\n“Dennis and I have a very independent relationship. Everyone wants us to define what it is, it’s not definable,” Frankel said during the fourth episode of the current RHONY season, in which Shields made a cameo.\n\n“We love each other but the two of us have schedules that are off the charts insane. I’m okay with it being totally gray,” the mother of one said of her boyfriend, who told her costars that they met in 1988.\n\nIn this week’s episode, the couple seemed to be on a break.\n\n“I didn’t say this to Dennis, but in my own mind I said 90 days. I’m not saying a word to Dennis for 90 days,” Frankel told friend Dorinda Medley. “It’s a really hard thing to realize that someone you love doesn’t mean they’re the right person. I wish he was.”\n\nImage zoom Bravo\n\nIn May, Frankel opened up about their complex relationship — without naming Shields — on Steve Harvey‘s talk show.\n\n“I’ve been with someone on and off for years,” she said. “It’s like a partnership where if we’re not being teammates and it’s not working and one man is down, then the other man is down. We’re trying to really kind of be good partners and be good teammates and I think relationships oddly are — and this sounds cold — but a little bit like business.”\n\nFrankel added, “If both people aren’t happy about it but slightly uncomfortable and giving up something or giving in [to] something, it doesn’t work. So both partners have to say, ‘All right, I’m in it for this.’ And I think we might be at that point, believe it or not,” she added. “I haven’t said that to anyone yet.”\n\nImage zoom Bethenny Frankel and Dennis Shields in December 2016 Josiah Kamau/BuzzFoto via Getty\n\nDespite multiple breakups throughout the years, Frankel and Shields remained close friends.\n\n“Bethenny and her daughter Bryn love Dennis and his family and they have been a support system during her negative divorce and a positive influence in Bryn’s life,” a source previously told PEOPLE.\n\n“They had a 27-year friendship before they dated so they picked that up where they left off once they realized they didn’t work as a couple,” the source said. “Her daughter adores him and his family, and she comes first above all.”\n\nWATCH: Bethenny Frankel Says She ‘Never Knows Exactly’ Where Relationship Stands with On-Again, Off-Again Boyfriend\n\nFrankel and Shields’ relationship was also a talking point during the two most recent RHONY reunions.\n\nIn 2016, Luann de Lesseps criticized Frankel for dating a married man, and in 2017, Frankel confirmed she was dating Shields again after a five-month break.\n\n“I am with Dennis,” she told Andy Cohen and the rest of the ladies during the season 9 reunion. “It’s more than giving it another shot. Things had to be dealt with and sort of a gauntlet needed to be gotten through and it happened. I’m in a better place. And I’m in a better place to make a sane decision.”\n\nAs for why they split in early 2017, Frankel explained, “I rightfully ended the relationship because of some of the circumstances surrounding my divorce and surrounding his divorce. A person that’s been married that many years needs to go through a certain cycle. I think that I needed him to make changes that I really didn’t think he would make. And I think that thinking the possibility of losing me really scared him straight, to be honest.”", "images": ["data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2058'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fbethenny-frankel11.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fgettyimages-628698852-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fdennis-shields1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fdennis-shields2-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fdennis-shields1-2000.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fdennis-shields1-2000.jpg", "keywords": [], "authors": ["Karen Mizoguchi"], "canonical_link": "https://people.com/tv/inside-bethenny-frankel-relationship-dennis-shields/", "title": "Inside Bethenny Frankel's 'Very Independent' Relationship with Late Boyfriend Dennis Shields", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Bethenny Frankel,Death,News,Real Housewives of New York City,TV", "news_keywords": "Bethenny Frankel,Death,News,Real Housewives of New York City,TV", "description": "Bethenny Frankel's on-off boyfriend Dennis Shields was reportedly found dead of a suspected overdose on Friday", "og": {"title": "Inside Bethenny Frankel's 'Very Independent' Relationship with Late Boyfriend Dennis Shields", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/inside-bethenny-frankel-relationship-dennis-shields/", "description": "Bethenny Frankel&nbsp;and late love&nbsp;Dennis Shields&nbsp;took&nbsp;their romance public in June 2016, but the pair had actually known each other for nearly 30 years. On Friday, the&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fdennis-shields1-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/inside-bethenny-frankel-relationship-dennis-shields/", "description": "Bethenny Frankel's on-off boyfriend Dennis Shields was reportedly found dead of a suspected overdose on Friday", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fdennis-shields1-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/inside-bethenny-frankel-relationship-dennis-shields/", "title": "Inside Bethenny Frankel's 'Very Independent' Relationship with Late Boyfriend Dennis Shields", "description": "Bethenny Frankel's on-off boyfriend Dennis Shields was reportedly found dead of a suspected overdose on Friday", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fdennis-shields1-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}