{"url": "https://en.wikipedia.org/wiki/Fyre_Festival", "text": "This article is about the 2017 music festival. For the annual literary festival, see Frye Festival . For other uses, see Fyre (disambiguation)\n\n2017 fraudulent \"luxury\" music festival\n\nFyre Festival was a fraudulent \"luxury\" music festival founded by Billy McFarland, CEO of Fyre Media Inc, and rapper Ja Rule. It was created with the intent of promoting the company's Fyre app for booking music talent. The festival was scheduled to take place on April 28–30 and May 5–7, 2017, on the Bahamian island of Great Exuma.\n\nThe event was promoted on Instagram by \"social media influencers\" including Kendall Jenner, Bella Hadid, Hailey Baldwin and Emily Ratajkowski, many of whom did not initially disclose they had been paid to do so.[1] During the Fyre Festival's inaugural weekend, the event experienced problems related to security, food, accommodation, medical services and artist relations, resulting in the festival being postponed indefinitely. Instead of the luxury villas and gourmet meals for which festival attendees paid thousands of dollars, they received prepackaged sandwiches and FEMA tents as their accommodation.[2]\n\nIn March 2018, McFarland pleaded guilty to one count of wire fraud to defraud investors and ticket holders, and a second count to defraud a ticket vendor that occurred while out on bail.[3] In October 2018, McFarland was sentenced to six years in prison and ordered to forfeit US $26 million.[3] The organizers became the subject of at least eight lawsuits, several seeking class action status, and one seeking more than $100 million in damages. The cases accuse the organizers of defrauding ticket buyers.\n\nTwo documentaries about the events of the festival were released in 2019: Hulu's Fyre Fraud,[4] and Netflix's Fyre: The Greatest Party That Never Happened.[5][6]\n\nPlanning and organization [ edit ]\n\nBilly MacFarland and Ja Rule at the 2016 Web Summit\n\nAn aircraft featuring Fyre Festival branding, used to transport attendees to the festival.\n\nThe festival was organized by Billy McFarland and Ja Rule,[2] to promote the Fyre music booking app.[1] Ja Rule had come to know McFarland through regular visits to events McFarland hosted at his previous venture, Magnises. During a flight to the Bahamas, McFarland and Ja Rule's private plane touched down on a lightly populated island which they later discovered was Norman's Cay, the former private island of Carlos Lehder Rivas, a kingpin of the Medellín Cartel.[7] McFarland then leased the island from the current owners, with the owners giving the strict condition that McFarland make no reference to the Pablo Escobar connection in any marketing materials.[8]\n\nPromotional footage with hired supermodels was shot on Norman's Cay, and planning for the festival went ahead. In early 2017, after a promotional video was released on social media advertising Norman's Cay as \"once owned by Pablo Escobar\", the owners immediately cancelled the arrangement with McFarland.[9] In reality, Pablo Escobar never owned Norman's Cay. When they were kicked off of Norman's Cay, they only had four months before their inaugural festival on April 28–30th. After several small islands that seemed like likely venues were turned down, and with only two months to go before the Fyre Festival, the Bahamian government gave McFarland a permit to use a site set aside for development at Roker Point (Coordinates: ) on Great Exuma, just north of the Sandals Resort.[10] Material released on social media continued to promote the falsehood that the Festival was being hosted on Pablo Escobar's private island, with maps of the site altered to make it appear as if Roker Point was an island unto itself.[8]\n\nIn reality, the Festival was in a remote parking lot north of a Sandals Resort and a nearby marina where locals' boats were stored.[citation needed] Furthermore, Great Exuma was not a private or remote island. Instead, the festival was scheduled to take place in an abandoned resort development. McFarland never announced the change; he just simply renamed the island \"Fyre Cay\". With no infrastructure and no villas, the team had just under two months to turn Roker Point into Fyre Cay.\n\nOn December 12, 2016, Kendall Jenner, Emily Ratajkowski and other influencers paid by Fyre simultaneously posted to their Instagram feeds a video with a thumbnail consisting of an orange square and a logo made of stylized flames. Clicking the thumbnail played the video, showing Bella Hadid and other models represented by her agency running around a tropical beach. Text with the video promised \"an immersive music festival ... two transformative weekends ... on the boundaries of the impossible\". This was the beginning of the Fyre Festival's promotional campaign.[10]\n\nAn investor, fashion executive Carola Jain, reportedly arranged for Fyre to receive a $4 million loan, which the company used most of to rent luxurious offices in Manhattan's Tribeca neighborhood. With no experience staging an event of the proposed festival's scale, McFarland began approaching companies that did, and was reportedly taken aback when informed the event would cost at least $50 million to stage in the time available as he had promised. Furthermore, the more experienced consultants told them that in addition to the cost, an event of this magnitude would have needed an extra year to plan. He and his associates at Fyre believed it would cost far less and continued with their plans under that assumption. The organizers tried to do things themselves where possible; McFarland supposedly learned how to rent the stage by doing a Google Search.[10]\n\nIn the days leading up to the festival, they cut expenses extensively, having learned that the luxury villas were going to cost $10 million alone, and targeted deposits for the bands, food, infrastructure and staff.[11]\n\nScheduled for two weekends in April and May 2017, the event sold day tickets from US$500 to US$1,500, and VIP packages including airfare and luxury tent accommodation for US$12,000. Customers were promised accommodation in \"modern, eco-friendly, geodesic domes\"[12] and meals from celebrity chefs.[13] The final advertised lineup was for 33 groups, including Pusha T, Tyga, Desiigner, Blink-182, Major Lazer, Disclosure, Migos, Rae Sremmurd, Kaytranada, Lil Yachty, Matoma, Klingande, Skepta, Claptone, Le Youth, Tensnake, Blond:ish, and Lee Burridge.[14] In the days leading up to the festival, all of the aforementioned acts pulled out, with Major Lazer never confirming their attendance despite being advertised. To make matters worse, organizers of the Fyre Festival planned their first event for April 28–30th, the same weekend as the Exuma Regatta, a Bahamian sailing race series that utilized all of the island’s hotels, vacation rentals and resources.\n\nWhile the festival's promotional material kept claiming that the festival would be held on a remote private island that once belonged to drug trafficker Pablo Escobar, workers were busy preparing Roker Point for the festival, scattering sand over its rocks and improving a road to a nearby beach, where they built some cabanas and installed swing sets.[10]\n\nOn the mainland, 5,000 tickets had been sold, and an air service was hired to charter festival-goers from Miami. A medical-services company and caterer were also hired, but the latter withdrew a few weeks before the festival.[10] With only two weeks to go, a new catering service with a $1 million total budget was hired, drastically reduced from the $6 million originally allocated to provide for what was promised as \"uniquely authentic island cuisine...local seafood, Bahamian-style sushi and even a pig roast\".[8][15]\n\nIn March 2017, Fyre also hired a veteran event producer, Yaron Lavi, who saw that it was impossible to hold the sort of event McFarland and Ja Rule envisioned at the site. He assumed they would postpone the event to November as they had been discussing since they were not ready. However, when Fyre told him they would stage the event in the spring anyway, Lavi told them to abandon plans for temporary villas and instead erect tents, the only accommodation that could be delivered in the time remaining. Lavi advised Fyre to make this clear to those who had already bought tickets, as otherwise it would be damaging to their brand. He says the company assured him that an email was being prepared, but he was not sure if it was sent.[10]\n\nComcast Ventures considered investing $25 million in the Fyre app, which McFarland apparently hoped would allow him to finance the festival, but declined days beforehand.[16] Reportedly, McFarland had valued Fyre Media at $90 million but was unable to provide sufficient proof of that when Comcast requested it.[10]\n\nWriting for New York magazine, one of the event organizers later noted that since at least mid-March there were significant problems with the planning, and at one point it was suggested they reschedule the 2017 festival until 2018.[17]\n\nThese plans, however, were revoked at the last minute with the decision to go on with the event as planned. \"Let's just do it and be legends, man,\" one of the organizers is reported to have said.[17] Later that month, Page Six began reporting rumors that the festival organizers were too disorganized and \"in over their heads.\"[18]\n\nAfter the Comcast deal fell through, McFarland obtained some temporary financing for Fyre through investor Ezra Birnbaum that required the company repay at least US$500,000 of the loan within 16 days.[10]\n\nIn order to raise quick cash for the event, and with under two weeks to go before the inaugural event, Fyre informed ticket-holders that the event would now be \"cashless (and cardless),\" and encouraged attendees to put up thousands of dollars in advance on a digital Fyre Band to cover purchases at the festival, according to one lawsuit. Each attendee would be issued an RFID-equipped, smartwatch-like ID to use during the festival;[19] this was despite warnings that such digital bracelets would be useless because of the poor Wi-Fi connection at the site.[8]\n\nMcFarland, who signed the email, suggested that attendees upload $300–500 for every day they planned to attend. About $2 million was uploaded to these bracelets, 40% of which, according to a lawsuit later filed by Birnbaum, was used by McFarland to pay off the short-term loan.[10][20]\n\nFestival events and attendee experiences [ edit ]\n\nEarly in the morning of April 27, heavy rain fell on Great Exuma, soaking the open tents and mattresses piled out in the open air for guest arrivals later that day.\n\nThe first flights from Miami International Airport to Exuma International Airport, operated by Swift Air and Xtra Airways, landed at 6:20 a.m.[8] That afternoon, Blink-182 announced that it was withdrawing from the festival, stating in a Twitter post that: \"We're not confident that we would have what we need to give you the quality of performances we always give our fans.\"[8]\n\nInitial arrivals were brought to an \"impromptu beach party\" at a beachside restaurant, where they were plied with alcohol and kept waiting for around six hours while frantic preparations at the festival site continued.[8] McFarland had hired hundreds of local Bahamian workers to help build the site. Meanwhile, organizers had to renegotiate the guarantees they offered to the people who would be playing at the festival as costs spiraled out of control. Later arrivals were brought directly to the grounds by school bus where the true state of the festival's site became apparent: their accommodations were little more than scattered disaster relief tents with dirt floors, some with mattresses that were soaking wet as a result of the morning rain. The gourmet food accommodations were nothing more than inadequate and poor quality food (including cheese sandwiches served in foam containers).[21][22]\n\nFestival-goers were dropped off at the production bungalow where McFarland and his team were based so they could be registered, but after hours of waiting in vain, people rushed to claim their own tents.[8] Although there were only about 500 people, there were not enough tents and beds for the guests, so they wound up stealing from others. Attendees were unable to leave the festival for the nearby Sandals resorts as it was peak season, with almost every hotel on Great Exuma already fully booked for the annual Exuma Regatta. Around nightfall, a group of local musicians took to the stage and played for a few hours, the only act to perform at the event. In the early morning, it was announced that the festival would be postponed and that the attendees would be returned to Miami as soon as possible.\n\nReports from the festival mentioned various other problems, such as the mishandling or theft of guests' baggage, no lighting to help people find their way around, an unfinished gravel lot, a lack of medical personnel or event staff, no cell phone or internet service, portable toilets,[23] no running water and heavy-handed security. These problems were exacerbated as the festival had been promoted as a cashless event, leaving many attendees without money for taxi fare or other expenses.\n\nMany attendees were reportedly stranded, as flights to and from the island were cancelled after the Bahamian government issued an order that barred any planes from landing at the airport.[24][2]\n\nThe first flight back to Miami boarded at 1:30 a.m. on April 28, but was delayed for hours due to issues with the flight's manifest. It was cancelled after sunrise, and passengers were locked in the Exuma Airport terminal with no access to food, water[25] or air conditioning; a passenger recalled that at least one person passed out from the heat and had to be hospitalized.[10]\n\nThe flight eventually left Exuma that morning, and more charter flights to Miami departed from Exuma throughout the day. One attendee who was stuck in Miami reported that the pilot of their airplane had told them to get off so they could turn the plane around for immediate departure, as they were now serving as a rescue aircraft to get attendees off Great Exuma Island.[26]\n\nInvolved parties [ edit ]\n\nOrganizers [ edit ]\n\nWith US$3,100,000 (equivalent to about $3,400,000 in 2019) in venture capital and 25 employees, McFarland also founded a card company called Magnises in 2013,[27] which promised members paying an annual $250 fee that they could \"unlock their cities and take their lives to the next level\", including \"private members-only concerts, tastings with notable chefs, and exclusive art previews at top galleries\". The Washington Post reported that \"some of those benefits never materialized or were far from what was advertised\".[28] \"They send the same email for every problem, but it's like fill-in-the-blanks for what the problem is\", a member reported to Business Insider.[29] Magnises reportedly became profitable in 2015.[29]\n\nThe Washington Post also reported that McFarland \"has a history of overpromising\" in his previous business ventures, and cited multiple examples, including McFarland selling VIP tickets to the musical Hamilton for $430 then cancelling at the last minute. In a complaint to the Better Business Bureau, one customer seeking a refund reported getting no response to multiple queries for over a month and a half.[28]\n\nCelebrity and social media promoters [ edit ]\n\nThe event was promoted on Instagram by Kardashian family socialite Kendall Jenner (who was paid $250,000 and has since deleted the post), Bella Hadid, Emily Ratajkowski, Hailey Baldwin, Elsa Hosk, Chanel Iman, Lais Ribeiro, Alessandra Ambrosio, Shanina Shaik, Nadine Leopold, Rose Bertram, Gizele Oliveira, Hannah Ferguson, and other niche-actresses and media personalities.[1] Ratajkowski was reportedly the only actress or model to use the hashtag #ad,[30] but has also since deleted the post.[31] Only later was it reported that Jenner and the others had been paid to make the posts, something they were required under federal law to disclose. The Federal Trade Commission said #ad only worked at the beginning of paid posts, and that the hashtag alone was not a sufficient disclaimer.[31][32]\n\nHadid has acknowledged and apologized for participating in the promotion.[33] Baldwin revealed that she donated her entire payment to charity after seeing the aftermath of the event.[34]\n\nFuckJerry and Jerry Media were partially responsible for promotions and social media marketing, and were possibly responsible for the post-event Netflix documentary that neglected to acknowledge their involvement and participation in the event marketing. [35]\n\nAftermath [ edit ]\n\nJa Rule posted a note on Twitter that said \"it was NOT A SCAM\" and \"this is NOT MY FAULT\".[36]\n\nFyre Festival posted a statement on their website:\n\nFyre Festival set out to provide a once-in-a-lifetime musical experience on the Islands of the Exumas. Due to circumstances out of our control, the physical infrastructure was not in place on time and we are unable to fulfill on that vision safely and enjoyably for our guests. At this time, we are working tirelessly to get flights scheduled and get everyone off of Great Exuma and home safely as quickly as we can. We ask that guests currently on-island do not make their own arrangements to get to the airport as we are coordinating those plans. We are working to place everyone on complimentary charters back to Miami today; this process has commenced and the safety and comfort of our guests is our top priority. The festival is being postponed until we can further assess if and when we are able to create the high-quality experience we envisioned. We ask for everyone's patience and cooperation during this difficult time as we work as quickly and safely as we can to remedy this unforeseeable situation. We will continue to provide regular updates via email to our guests and via our official social media channels as they become available.[37]\n\nMany news organizations compared the chaos to William Golding's novel Lord of the Flies and Suzanne Collins's novel The Hunger Games.[38][39][40][41] The Bahamas Ministry of Tourism apologized on behalf of the nation, and denied having any responsibility for how the events unfolded.[42] The workers who constructed the site, and the restaurant that provided meals for festival staff, were never paid, leading to the restaurant owner appealing for assistance on the crowdfunding platform GoFundMe.[43]\n\nFyre Festival announced that it would offer all attendees a choice between a full refund or VIP tickets to the following year's festival (which was proposed, but never eventuated).[44][45]\n\nLawsuits [ edit ]\n\nAs a result of the festival, McFarland and Ja Rule are the subject of a $100 million lawsuit in the state of California. It was filed on behalf of plaintiff Daniel Jung by entertainment lawyer Mark Geragos, who is seeking class action status for the lawsuit with more than 150 plaintiffs.[46] Per the filing, Jung's lawsuit alleges fraud, breach of contract (partly because of the decision by the organizers to make the festival cashless so that attendees didn't bring money for taxis), breach of covenant of good faith (partly due to the inadequate catering and the incident where attendees were locked in the airport) and negligent misrepresentation.[47] Ben Meiselas of Geragos's firm pledged to hold \"all those who recklessly and blindly promoted the festival\" accountable, which was interpreted as being directed at Jenner, Hadid, and other social media influencers.[48] A Geragos lawyer stated that Fyre Festival sent cease and desist letters to whistleblowers.[49]\n\nA second class action lawsuit against Fyre Media, McFarland, Ja Rule, and the event promoters identified as \"Does 1–100\" was filed in Los Angeles by personal injury lawyer John Girardi on behalf of three attendees.[50] The plaintiff alleges that they deceived patrons into attending the festival by paying more than 400 social media personalities and celebrities to promote it. The parties are accused of breach of contract, negligent misrepresentation, and fraud.[51] A Bloomberg reporter filed a FOIA request to the FTC regarding their Instagram knowledge, after the second class action lawsuit.[50]\n\nA third lawsuit was filed in New York federal court against Ja Rule, McFarland, Fyre Media, and chief marketing officer Grant Margolin. Plaintiffs Matthew Herlihy and Anthony Lauriello accused the festival organizers of \"false representations, material omissions... negligence, fraud, and violations of consumer protection statutes.\"[52] \"Upon the arrival of guests to the island of Great Exuma for the first weekend, the island was lacking basic amenities, was covered in dirt, and guests had to sleep in tents with wet blankets,\" the suit claims. \"There were no communal showers or bathrooms as promised; instead there were porta potties (only about one for every 200 yards) that were knocked down and only three showers although there were hundreds of people arriving.\"\n\nOn May 4, another lawsuit was filed by National Event Services (NES), which provided medical services for the festival and claimed to have suffered $250,000 in damages, alleging breach of contract, fraud, and negligence by the organizers. The suit alleged that Fyre \"failed and/or refused\" to buy cancellation insurance and \"failed to secure a contract with a medical evacuation helicopter or plane.\" NES employees reported that the local medical clinic was closed and the accommodation was \"uninhabitable\" with \"bug infestation, bloodstained mattresses, and no air conditioning.\"\n\nAlso in May, festival attendee Andrew Petrozziello filed a lawsuit in New Jersey federal court alleging that the organizers violated the state's consumer fraud act and committed breach of contract.[53]\n\nA sixth lawsuit, filed in Florida federal court as a class action suit, alleged violations that include fraud, negligence, and breach of contract. The plaintiffs, Kenneth and Emily Reel, accused the organizers of sending cease and desist letters to people who criticized the festival on social media.[54]\n\nA seventh lawsuit was filed in Manhattan federal court as a class action suit on behalf of Sean Daly and Edward Ivey. In addition to the infractions mentioned in the other lawsuits, this suit alleges unjust enrichment and violation of New York state business law, claiming that the organizers continued to offer VIP upgrades and opportunities to deposit money into the \"Fyre Band\" payment system after the festival had been canceled.[55]\n\nAn eighth lawsuit was filed in Suffolk County Superior Court in Boston on behalf of ticketing vendor Tablelist. The company is alleging that the festival organizers and financial backers committed breach of contract and fraudulently deceived Tablelist and ticket purchasers. Tablelist is seeking $3.5 million to refund customers, as well as damages resulting from loss of business after being forced to lay off 40% of their workforce to focus on the litigation.[56]\n\nOn July 3, 2018, two North Carolina attendees, Seth Crossno and Mark Thompson, were awarded $5 million in damages. The judgment was granted against Billy McFarland in absentia after he failed to respond to the court proceedings. Ja Rule was initially named as a co-defendant, but was later removed from the suit after an undisclosed private agreement with the two attendees' attorney.[57]\n\nCriminal investigation [ edit ]\n\nOn May 21, 2017, The New York Times reported McFarland and his associates were under an active federal criminal investigation by the Federal Bureau of Investigation for mail fraud, wire fraud, and securities fraud. The case was overseen by the United States Attorney for the Southern District of New York.[58] On June 30, 2017, McFarland was arrested and charged with one count of wire fraud.[59]\n\nIn March 2018, McFarland pleaded guilty to one count of wire fraud in what the U.S. Justice Department called a scheme to defraud investors, as well as a second count of wire fraud related to a scheme to defraud a ticket vendor. In October 2018, McFarland was sentenced to six years in prison and ordered to forfeit US $26 million.[3][60][61]\n\nOn July 24, 2018, the Securities and Exchange Commission (SEC) announced that McFarland, two companies he founded, a former senior executive, and a former contractor agreed to settle charges arising out of an extensive, multi-year offering fraud that raised at least $27.4 million from over 100 investors. McFarland admitted to the SEC's allegations against him, agreed to a permanent director-and-officer bar, and agreed to disgorgement of $27.4 million. Grant H. Margolin, Daniel Simon, Fyre Media, and Magnises, Inc. agreed to the settlement without admitting or denying the charges. Margolin has agreed to a seven-year director-and-officer bar and must pay a $35,000 penalty, and Simon has agreed to a three-year director-and-officer bar and must pay over $15,000 in disgorgement and penalty. The settlements are subject to court approval.[62]\n\nFilms [ edit ]\n\nIn 2019, two documentary films were released that covered the Fyre Festival and McFarland.\n\nFyre Fraud, an American documentary film directed by Jenner Furst and Julia Willoughby Nason, premiered on January 14, 2019, on Hulu. Fyre Fraud's press release describes it as a \"true-crime comedy bolstered by a cast of whistleblowers, victims, and insiders going beyond the spectacle to uncover the power of FOMO and an ecosystem of enablers, driven by profit and a lack of accountability in the digital age.\"[63] The film was met with a positive response from critics upon its premiere. On the review aggregation website Rotten Tomatoes, the series holds a 79% approval rating with an average rating of 6.41 out of 10 based on 28 reviews. The website's critical consensus reads, \"In the battle over Fyre Festival content, Fyre Fraud comes out swinging with a questionable interview of conman Billy McFarland and a thoughtful exploration of nefarious social strategy.\"[64] Metacritic, which uses a weighted average, assigned the film a score of 66 out of 100 based on 12 critics, indicating \"generally favorable reviews.\"[65]\n\nOn January 18, 2019, Netflix released the film Fyre. Directed by Chris Smith, the film features interviews with event organizers and festival attendees. Like Fyre Fraud, the film received positive reviews. On Rotten Tomatoes, the film holds a 90% rating, with an average rating of 7.54 out of 10, based on 73 reviews.[66] On Metacritic, the film holds a score of 76 based on 26 critical reviews.[67]\n\nIn popular culture [ edit ]\n\nIn a 2017 tweet, Seth Rogen stated that The Lonely Island comedy trio were planning a movie about a failed music festival.[68] In 2019, Jorma Taccone confirmed that the parody film was still in process.[69]\n\nOn October 29, 2017, a short film named The Failure of Fyre Festival was released on the YouTube channel Internet Historian, detailing the failure of the festival, along with the aftermath of the festival.\n\nIn 2018, American punk band Alkaline Trio – whose singer and guitarist Matt Skiba also plays in Blink-182, who were among the first acts to cancel their planned performance at the festival – released the song \"Goodbye Fire Island\", which was inspired by Blink-182's involvement with the festival.[70]\n\nIn 2019, Ryan Reynolds featured Andy King and his signature quote from the Fyre documentary in an advertisement for his gin brand.[71]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Audio-input-microphone.png/21px-Audio-input-microphone.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Relief_Map_of_Caribbean.png/24px-Relief_Map_of_Caribbean.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Web_Summit_2016_-_MusicNotes_-_Nov_10_-_Day_3_DSC0839_%2830810709661%29_%28cropped%29.jpg/220px-Web_Summit_2016_-_MusicNotes_-_Nov_10_-_Day_3_DSC0839_%2830810709661%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/N458UW_-_Swift_Air_-_Boeing_737-400_-_Fyre_Festival.jpg/220px-N458UW_-_Swift_Air_-_Boeing_737-400_-_Fyre_Festival.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/c/cd/Fyre_festival.png/220px-Fyre_festival.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Guitar_%281867%29_-_The_Noun_Project.svg/21px-Guitar_%281867%29_-_The_Noun_Project.svg.png", "https://upload.wikimedia.org/wikipedia/en/c/cd/Fyre_festival.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/c/cd/Fyre_festival.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Fyre_Festival", "title": "Fyre Festival", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/c/cd/Fyre_festival.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}