{"url": "https://www.etonline.com/kim-kardashian-says-she-was-starstruck-by-white-house-visit-with-president-trump-103804", "text": "For once, it was Kim Kardashian who was starstruck as she walked into the White House to meet with President Donald Trump earlier this week.\n\nKardashian appeared on CNN Tonight with Don Lemon on Wednesday, where she sat down with Van Jones to talk about her work to get executive clemency for Alice Marie Johnson, a 63-year-old Alabama inmate who was serving life without parole for a first-time, non-violent drug offense. Kardashian's meeting with Trump led to a mixed bag of reactions, with some mocking it as a summit between two reality stars, while others praised the mother of three for making a successful push for meaningful social justice.\n\nTrump granted Johnson clemency and she was released on Wednesday -- a goal Kardashian told Jones that she'd has been working seven months for, contrary to portrayals of the meeting as a flippant stunt.\n\n\"I saw this seven months ago and I have [had] daily phone calls with the White House, maybe a dozen emails a day trying to get letters from the warden,\" she said, though she was quick to credit Johnson's supporters as well. \"I have to get credit to where Alice’s whole team had been working on this for years. I mean, I did step in late in the game. So I don’t want to take away from [that].”\n\nSo grateful to @realDonaldTrump, Jared Kushner & to everyone who has showed compassion & contributed countless hours to this important moment for Ms. Alice Marie Johnson. Her commutation is inspirational & gives hope to so many others who are also deserving of a second chance. — Kim Kardashian West (@KimKardashian) June 6, 2018\n\nAs for the meeting itself? Kardashian said she was positively floored to find herself in the White House lobbying for something so weighty.\n\n\"I never get starstruck,\" she admitted to Jones. \"I was starstruck over the Oval Office... It really felt powerful, and felt like, you can just feel the history in there... I just took a second to take it all in, and then we talked about it.\"\n\nShe said Trump was compassionate and sympathetic during their meeting.\n\nKim Kardashian Slams Donda House Co-Founder Rhymefest for Alleging Kanye West 'Abandoned' Chicago This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart Kim Kardashian Slams Donda House Co-Founder Rhymefest for Alleging Kanye West 'Abandoned' Chicago\n\n\"He said, 'You know, this is a really long time that she’s been in here, right? This just isn’t fair,'\" Kardashian recalled. \"He knew that this is the right thing to do, and he said that from the start after he had heard her whole story and situation and he knew it was the right thing to do... And he wanted to make it happen.”\n\nJones asked Kardashian about some celebrities' unwillingness to visit the Trump White House and the possibility that she was being used as a pawn for political game. The reality star answered by saying that she respects celebrity refusals and recognizes the optics of her meeting with Trump. But she said the results were what mattered most.\n\n\"I think Kanye’s already given him legitimacy... you know, in that way,\" she added of husband Kanye West's public support of the controversial commander in chief. \"I don’t think I would be used... And, at the end of the day, he heard me out. We got the job done.\"\n\n\"I just have to stay focused, and I have to know that if [he] is the only person in the world that could have done this for her, why wouldn’t I go talk to that person, if I had the opportunity to? Forget about my fears. Forget about my life. That was the right thing to do,\" she continued. \"I mean, there’s over 3,000 people in this same exact situation as Alice... But it doesn’t mean that we’re going to stop here.\"\n\nFor more on the famous family, watch the video below.\n\nKim Kardashian Jokes That Kanye West's Recent Antics Gave Her Her 'First Grey Hair' This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRELATED CONTENT:\n\nSamantha Bee Addresses Controversial Ivanka Trump Remarks on Her Show\n\nKim Kardashian Breaks News to Inmate That President Donald Trump Granted Her Clemency\n\nKathy Griffin Reflects On Bloody Trump Photo Controversy in Lengthy Twitter Essay\n\nRelated Gallery", "images": ["https://www.etonline.com/themes/custom/et/img/watch-now.png", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2018-05/kim_kardashian_donald_trump_oval_office_twitter_1280.jpg?h=c673cd1c&itok=90oSV9N9", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2018-06/amy-adams-blue-suit-1280.jpg?h=c673cd1c&itok=qOfma5Tg", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/rupauls_drag_race__E_1208_droop_sneak_1920x1080.jpg?h=70217200&itok=U94nGmuG", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-05/kim_kardashian_donald_trump_oval_office_twitter_1280.jpg?h=c673cd1c&itok=VgK6PdT3", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/gettyimages-692085362.jpg?h=c673cd1c&itok=TnqSx9El"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-05/kim_kardashian_donald_trump_oval_office_twitter_1280.jpg?h=c673cd1c&itok=VgK6PdT3", "keywords": [], "authors": ["Brian Haas"], "canonical_link": "https://www.etonline.com/kim-kardashian-says-she-was-starstruck-by-white-house-visit-with-president-trump-103804", "title": "Kim Kardashian Says She Was 'Starstruck' by White House Visit With President Trump", "meta_data": {"article": {"opinion": "false"}, "title": "Kim Kardashian Says She Was 'Starstruck' by White House Visit With President Trump | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/kim-kardashian-says-she-was-starstruck-by-white-house-visit-with-president-trump-103804", "title": "Kim Kardashian Says She Was 'Starstruck' by White House Visit With President Trump", "description": "The 37-year-old model said she found the president compassionate and sympathetic.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-05/kim_kardashian_donald_trump_oval_office_twitter_1280.jpg?h=c673cd1c&itok=VgK6PdT3", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "The 37-year-old model said she found the president compassionate and sympathetic.", "title": "Kim Kardashian Says She Was 'Starstruck' by White House Visit With President Trump", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Brian Haas‍", "url": "https://www.etonline.com/kim-kardashian-says-she-was-starstruck-by-white-house-visit-with-president-trump-103804", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-05/kim_kardashian_donald_trump_oval_office_twitter_1280.jpg?h=c673cd1c&itok=VgK6PdT3"}, "description": "The 37-year-old model said she found the president compassionate and sympathetic.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, Kim Kardashian, Donald Trump", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}