{"url": "https://www.bustle.com/p/is-dorothy-wang-single-after-famously-single-she-isnt-the-shows-star-student-68339", "text": "Famously Single locks eight single, well-known individuals in a Los Angeles loft and forces them to confront why they haven't been able to find love. They go to individual therapy, group therapy and participate in mandatory dating exercises that push them outside their comfort zone. The show is about finding what's keeping these famous faces single. Last year, Aubrey O'Day and DJ Pauly D found love with each other and left the loft no longer free agents This season, Rich Kids Of Beverly Hills star Dorothy Wang is looking to dissect her own dating issues. So, is Dorothy dating anyone after Famously Single? All signs point to her still being on the market.\n\nDorothy has created quite the brand for herself since being on Rich Kids Of Beverly Hills. With almost a million Instagram followers, her own line of jewelry and champagne, and a growing list of reality show appearances, Dorothy is forging a career path in the spotlight. Famously Single explores how dating becomes difficult for people with these types of careers. While there is a chance that Dorothy leaves in a relationship (her fellow castmate Calum Best left her with a goodnight kiss one evening), the following evidence suggests that she's still flying solo and looking for \"the one.\"\n\nShe Had Difficulty With The Exercises\n\nThe dating exercises are supposed to push the singles to try new things, but many of the famous singles tend to push back against the exercises. In a recent episode, Dorothy had some trouble approaching men on the street to ask out. While it is hilarious to watch her laugh through the odd exercise, it shows she still has a lot of work to do to get confident chatting up strangers.\n\nShe's Set A High Bar\n\nWith a high net worth and a increasingly public career, Dorothy isn't looking to settle into a relationship with the first guy she meets. This isn't a bad thing! Over the first few days, while many of her castmates were pairing up, she was left a bystander. Perhaps she entered the loft for a bit of self reflection and an elevated platform, rather than to immediately find someone. Only time will tell if she remains single for the entire experience.\n\nShe's Hilariously Out Of Her Element\n\nDorothy has provided the show with so much funny commentary and a slew of awkward, gif-able moments. She provides narration for all the hookups and love connections in the house, remaining a viewer rather than a participant. She still may find love, but my guess is that it happens outside the show.\n\nOnly Time Will Tell\n\nE! Entertainment on YouTube\n\nThe truth is, we still have many episodes left for Dorothy to really click with someone. She could either discover a connection in the loft or meet someone on the many dating exercises that are required. It would be fun to watch her let her guard down and open herself up to it.\n\nWhile my prediction is that Dorothy leaves the loft single, it is just a guess. I'm merely collecting the evidence I see in front of me — including a lack of an obvious partner on her busy social media accounts — the signs pointing to a (famously) single departure.", "images": ["https://imgix.bustle.com/uploads/image/2020/4/12/cec610e3-7a33-40f7-9f56-34706bee5b47-screen-shot-2020-04-12-at-10607-pm.png?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2020/4/17/a046bcf1-39af-46f7-a66c-72e9d21fbeed-mando_105-1_3a338e00.jpeg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/10/fcba4ee7-ea37-4fd4-8c6f-8b173c126c40-image_1.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2017/7/5/f1d849f7-f31e-466b-a096-376c7fc2708b-getty-655673258.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/16/d8fec873-a804-4b2b-9d39-50d108c82869-getty-1206490175.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2017/7/5/f1d849f7-f31e-466b-a096-376c7fc2708b-getty-655673258.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2017/7/5/f1d849f7-f31e-466b-a096-376c7fc2708b-getty-655673258.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/is-dorothy-wang-single-after-famously-single-she-isnt-the-shows-star-student-68339", "title": "Is Dorothy Wang Single After 'Famously Single'? She Isn't The Show's Star Student", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/is-dorothy-wang-single-after-famously-single-she-isnt-the-shows-star-student-68339", "type": "article", "title": "'Famously Single' Probably Hasn't Tamed Dorothy Wang", "description": "Famously Single locks eight single, well-known individuals in a Los Angeles loft and forces them to confront why they haven't been able to find love. They go to individual therapy, group therapy and participate in mandatory dating exercises that…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2017/7/5/f1d849f7-f31e-466b-a096-376c7fc2708b-getty-655673258.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Famously Single locks eight single, well-known individuals in a Los Angeles loft and forces them to confront why they haven't been able to find love. They go to individual therapy, group therapy and participate in mandatory dating exercises that…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}