{"url": "https://people.com/tv/kim-zolciak-biermann-claims-racism-wasnt-real/", "text": "Kim Zolciak-Biermann was far from happy with how her appearance on the Real Housewives of Atlanta reunion went.\n\nAt the end of Sunday’s season 10 reunion part 3, the mother of six called longtime host Andy Cohen into the bathroom for a private meeting with him and complained about the way she was treated by him and Atlanta Housewives NeNe Leakes, Cynthia Bailey, Kenya Moore, Kandi Burruss, Porsha Williams and Shereé Whitfield\n\nGet push notifications with news, features and more.\n\nDuring the episode of the hit Bravo show, Leakes and most of the Housewives banded together and railed against Zolciak-Biermann as they recalled the way she behaved during her return to RHOA.\n\nThe biggest hot-button issue of the season, of course, had to do with Zolciak-Biermann saying Leakes was “sick and disgusting” for living in a “roach nest” — a term many of the women told Zolciak-Biermann on Sunday they felt was racist for its cultural implications of impoverished black women living in the projects.\n\n“You’re reaching. Reaching,” Zolciak-Biermann said in her defense. “Don’t try it. It has nothing to do with the projects or none of that s—. A roach is a roach.”\n\nImage zoom Moses Robinson/Bravo\n\nRELATED: ‘Close Your Legs to Married Men’: A Brief History of Kim Zolciak-Biermann & NeNe Leakes’ Rocky Friendship\n\nThough she appeared to shrug off the negativity during the ferocious fight, rolling her eyes and calming walking off set after it was done, Zolciak-Biermann broke down in tears while talking to Cohen after the show’s wrap.\n\n“That bitch knows I’m not racist. NeNe knows I’m not racist,” Zolciak-Biermann told Cohen. “You know why you have not found another white woman to [join the cast]? Because nobody is dumb enough to do that! Put yourself in my shoes — five African-American women — just hammered! I couldn’t even speak, my mind’s a f—— whirlwind!”\n\nWant to keep up on the latest from PEOPLE? Sign up for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\nShe then continued to deny claims that she was racist, explaining that she felt racism as a whole was only something being magnified by social media.\n\n“This whole racism thing in this day in age is b——. Everyone of those m———— on that couch owe this world a f—— apology for this racism s—,” Zolciak-Biermann said. “They already tried to claim that s— long ago. Nobody bought into it then because the social media wasn’t there and racism wasn’t f—— all that real. You know it.”\n\nImage zoom Charles Sykes/Bravo/NBCU Photo Bank via Getty Images; Paras Griffin/Getty Images\n\nIn the wake of #RoachGate, as it was come to be known, Leakes had responded with her own slams — calling Zolciak-Biermann “racist” and claiming she and her daughter Brielle “don’t like black people.\n\n“Kim & her daughter oops whole family are racists! What her daughter did at my home… was racist, learned behavior etc,” Leakes, 50, alleged in a comment on Instagram, adding, “Kim is a calculating bio polar racist with a horrible mouth, who uses black folks for her come up.”\n\n“That word ‘roach’ just ain’t the word I needed to hear her saying,” Leakes said on a RHOA episode. “It sounds very racial when you are speaking to an African-American person and talk about roaches. Because people feel like you associated that with the ghetto or trash. Black people do not receive that very well.”\n\nRELATED VIDEO: RHOA‘s Kim Zolciak Says She Received Death Threats After NeNe Leakes Called Her ‘Racist’\n\nZolciak-Biermann didn’t take Leakes’ claims lightly. As #RoachGate played out on social media, the “Tardy for the Party” singer obtained legal counsel against Leakes.\n\n“She put #KKK on the Instagram post. I’ve hired legal counsel at this point. It’s just that bad,” Zolciak-Biermann told Larry King on Larry King Now in October. “It’s inappropriate. In this day and age, people are dying over racism. I’m on a show with all African-American women and I’m the only one that’s ever been on the show that’s Caucasian, so it’s the card that sometimes they play and it’s gross. And I won’t allow it.”\n\nThe Don’t Be Tardy star later revealed on RHOA that she received death threats after Leakes’ racist claims. “She wants to pull the race card. That’s the devil, bitch,” Zolciak-Biermann said. “There’s not a racist bone in my body. Not me, my husband, or my children see color. Never have.”\n\nImage zoom Moses Robinson/Bravo\n\nApologies and cease fire requests have since been made by Zolciak-Biermann, though Leakes hasn’t accepted them.\n\nBy episode’s end on Sunday, it was clear the two would never be mending their relationship and that Zolciak-Biermann’s time on RHOA was done for good (Zolciak-Biermann confirmed the latter recently, saying she was never returning again).\n\nIt was sad to see for fans of the show, who remember Zolciak-Biermann giving RHOA some of its most iconic moments when it first premiered in October 2008.\n\nBut as Zolciak-Biermann claimed when she left RHOA halfway through season 5, the show became too negative. And judging from the way season 10 went, that never fixed itself.\n\nImage zoom Alex Martinez/Bravo\n\nWho’s to blame for that? In the Atlanta Housewives eyes, it was Zolciak-Biermann.\n\nAt the reunion, Leakes, Burruss, Moore, and Bailey all slammed her for starting feuds and spreading hate. “It’s all me, it’s all me,” Zolciak-Biermann shrugged off. “Sure. Sure.”\n\n“How much can a person take?” Zolciak-Biermann asked Cohen in the show’s final moments. “There wasn’t even one positive question for me. I was hammered! … There wasn’t a positive question. I have a very success marriage, I have beautiful children, there was nothing positive.”\n\nCohen, though, appeared to agree with the RHOA cast.\n\n“There was nothing positive, unfortunately, in your story from the season,” he told her. “It was all combative, it was. Because your whole time on the show as combative, it was.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fkim-zolciak1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnene-leakes-2-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnene-leakes-1-3.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnene-leakes-2-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnene-leakes1-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnene-leakes-2-1.jpg", "keywords": [], "authors": ["Dave Quinn"], "canonical_link": "https://people.com/tv/kim-zolciak-biermann-claims-racism-wasnt-real/", "title": "RHOA Reunion: Kim Zolciak-Biermann Angry Over Racist Claims", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Andy Cohen,Cynthia Bailey,Kandi Burruss,Kenya Moore,Kim Zolciak Biermann,NeNe Leakes,News,Porsha Williams,Real Housewives,Real Housewives of Atlanta,Sheree Whitfield", "news_keywords": "Andy Cohen,Cynthia Bailey,Kandi Burruss,Kenya Moore,Kim Zolciak Biermann,NeNe Leakes,News,Porsha Williams,Real Housewives,Real Housewives of Atlanta,Sheree Whitfield", "description": "Kim Zolciak-Biermann was far from happy with how her appearance on the Real Housewives of Atlanta reunion went", "og": {"title": "RHOA's Kim Zolciak-Biermann Claims Racism 'Wasn't Real' and Is Magnified by Social Media", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/kim-zolciak-biermann-claims-racism-wasnt-real/", "description": "Kim Zolciak-Biermann&nbsp;was far from happy with how her appearance on the&nbsp;Real Housewives of Atlanta&nbsp;reunion went. At the end of Sunday’s&nbsp;season 10&nbsp;reunion part 3, the mother&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnene-leakes-2-1.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/kim-zolciak-biermann-claims-racism-wasnt-real/", "description": "Kim Zolciak-Biermann was far from happy with how her appearance on the Real Housewives of Atlanta reunion went", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnene-leakes-2-1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/kim-zolciak-biermann-claims-racism-wasnt-real/", "title": "RHOA's Kim Zolciak-Biermann Claims Racism 'Wasn't Real' and Is Magnified by Social Media", "description": "Kim Zolciak-Biermann was far from happy with how her appearance on the Real Housewives of Atlanta reunion went", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnene-leakes-2-1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}