{"url": "https://people.com/celebrity/leonardo-dicaprio-nina-agdal-relationship-timeline/", "text": "Leonardo DiCaprio and Nina Agdal have split after a year together, and a source tells PEOPLE that the breakup is “amicable” and that the two “remain friends.”\n\nThe split caps a blissful year during which the two captured headlines — and photographers’ lenses — with their glamorous, globe-trotting romance, which spanned posh locales like Ibiza, St. Bart’s and the Bahamas.\n\nGet push notifications with news, features and more.\n\nThe Sports Illustrated swimsuit model, 25, and Oscar-winning actor, 42, had mostly kept their relationship – which kicked off last summer – out of the spotlight. Here’s a look back at everything we know that’s happened since they first linked up.\n\nMay 2016\n\nDiCaprio and Agdal were first spotted together in May at Up & Down club in New York City. The actor arrived at the nightclub with Agdal and a group of friends, before partying the night away in the VIP section.\n\nJune 2016\n\nThe next month, the pair were spotted together on a weekend getaway in Montauk, New York.\n\nDuring the trip, DiCaprio and Agdal were seen enjoying a few local hot spots together, including picking up breakfast at Goldberg’s Famous Bagels. They also visited the Montauk Point Lighthouse, according to Page Six.\n\nJuly 2016\n\nThe Revenant star and the supermodel were merely a “fast fling” as of July, a source told PEOPLE after the duo vacationed together with friends on the private Bahamian island Over Yonder Cay.\n\nLater that month, DiCaprio was photographed locking lips with Agdal as they lounged in the sand during a romantic beach day in Malibu, California.\n\nImage zoom AKM-GSI\n\n“It was just the two of them at the beach,” a source told PEOPLE at the time. “They enjoyed the beach and had fun swimming. They also took a kayak out in the ocean.”\n\nNear the end of July, the duo were spotted partying in Ibiza, Spain, with DiCaprio’s longtime pal Tobey Maguire and a yacht full of their closest friends.\n\nAugust 2016\n\nDiCaprio and Agdal were involved in a car accident in late August. Luckily, the Hamptons crash was minor, and a source quickly confirmed that both were “doing great” following the fender-bender.\n\nImage zoom Jackson Lee/Splash News Online\n\nSeptember 2016\n\nAfter lying low for a few weeks, DiCaprio and Agdal were spotted on a romantic date at Gotham Bar and Grill in New York City’s Greenwich Village – and a source told PEOPLE that they couldn’t keep their hands off each another.\n\nThe insider said that the two dined at the restaurant with a small group around 9:30 p.m. and were seen “canoodling” at their table. “They were kissing,” the source revealed. “Like, right out in the open at the table.”October 2016\n\nBy October, a source told PEOPLE that the coupled seemed “more serious.”\n\n“Leo seems very into her,” the source said. “He constantly holds her hand and kisses her. Nina seems to enjoy Leo’s company too. She acts very giddy around him. She has great energy and seems to make Leo very happy.”\n\nThe source added, “Whenever they spend time together, Leo acts very happy. For Leo, Nina seems like a breath of fresh air.”\n\nNovember 2016\n\nWhen DiCaprio turned 42 in November, Agdal was on hand for a special trip to French Polynesia with him and his mother, Irmelin Indenbirken, PEOPLE confirmed.\n\nThe group – which also included film producer Mike Medavoy and his wife – stayed at The Brando on Tetiaroa, reported Page Six.\n\nLater in November, Agdal and DiCaprio were seen spending Thanksgiving Eve together in Charleston, South Carolina.\n\nThe pair enjoyed lunch at popular eatery Butcher & Bee, and then were seen walking through downtown Charleston together.\n\nDecember 2016\n\nThe jet-setting duo fled to warmer weather once again in the final month of 2016, traveling to Cancun with Lukas Haas and a mystery brunette.\n\nFROM COINAGE: See Where 6 Stars Were Before They Were Famous\n\nJanuary 2017\n\nDiCaprio and the model reunited at Jimmy Fallon’s private Golden Globes afterparty at L.A. hot spot Delilah in January – and weren’t shy about PDA.\n\n“Leo was in a booth next to the deejay and basically gazing longingly into Nina’s eyes,” a partygoer told PEOPLE. “At one point, she leaned into him for a cuddle. They were very relaxed together.”\n\nFebruary 2017\n\nThough DiCaprio flew solo at the Oscars on Feb. 26, he did meet up with his girlfriend at one of Hollywood’s exclusive afterparties later that night: a private bash hosted by Madonna and her manager.\n\nA source told PEOPLE at the time that DiCaprio and Agdal were closer than ever.\n\nMarch 2017\n\nImage zoom AKM-GSI; Inset: Gregg DeGuire/WireImage\n\nJust this week, Agdal’s famous boyfriend jetted off with her to St. Bart’s to celebrate her birthday. There, they met up with Orlando Bloom and a group of friends including tech mogul Jim Clark’s model wife, Kristy Hinze-Clark.\n\nThe group spent time together on Clark’s yacht. “They are having fun,” and insider told PEOPLE.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F03%2Fnina-agdal2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F07%2Fleonardo-dicaprio-c-1024.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fagdal-dicaprio-3-2000x1333.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F08%2Fdicaprio-agdal-435t.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fagdal-dicaprio-3-2000x1333.jpg", "keywords": [], "authors": ["Lindsay Kimble"], "canonical_link": "https://people.com/celebrity/leonardo-dicaprio-nina-agdal-relationship-timeline/", "title": "Leonardo DiCaprio and Nina Agdal Dating: Relationship Timeline", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Celebrities,Couples,Leonardo DiCaprio,Movie Celebrities,Movie News,News,Nina Agdal", "news_keywords": "Celebrities,Couples,Leonardo DiCaprio,Movie Celebrities,Movie News,News,Nina Agdal", "description": "A source tells PEOPLE that the breakup is \"amicable\" and that the two \"remain friends\"", "og": {"title": "Leonardo DiCaprio and Nina Agdal Dating: Relationship Timeline", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/celebrity/leonardo-dicaprio-nina-agdal-relationship-timeline/", "description": "Leonardo DiCaprio and Nina Agdal have split after a year together, and a source tells PEOPLE that the breakup is “amicable” and that the two&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fagdal-dicaprio-3-2000x1333.jpg", "width": 1200, "height": 628}}, "pinterest": {"url": "https://people.com/celebrity/leonardo-dicaprio-nina-agdal-relationship-timeline/", "description": "A source tells PEOPLE that the breakup is \"amicable\" and that the two \"remain friends\"", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fagdal-dicaprio-3-2000x1333.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/celebrity/leonardo-dicaprio-nina-agdal-relationship-timeline/", "title": "Leonardo DiCaprio and Nina Agdal Dating: Relationship Timeline", "description": "A source tells PEOPLE that the breakup is \"amicable\" and that the two \"remain friends\"", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fagdal-dicaprio-3-2000x1333.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}