{"url": "www.goal.com/en-us/news/david-beckham-allegations-deliberately-innacurate-says-spokesman-/9g7uk3r8nldk1nd2ouz4jupo1", "text": "Beckham allegations 'deliberately inaccurate', says spokesman\n\nNewspaper allegations made against the ex-Man Utd star paint a \"deliberately inaccurate picture\" of the former England captain, a spokesman has said\n\nA spokesperson for David Beckham has labelled newspaper allegations as being drawn from \"hacked and doctored private emails\" in order to give a \"deliberately inaccurate picture\" of the former captain.\n\nA report on Friday in The Sun, who claim the information was obtained by the European Investigative Collaborations network and then published across Europe, alleged Beckham carried out work for global children's charity UNICEF as a means to gain favour under the UK honours system and reacted angrily when he was not granted a knighthood.\n\nBut a representative of the 41-year-old ex- and midfielder insists the information published should be treated with due scepticism in light of how it was obtained and presented.\n\n\"This story is based on outdated material taken out of context from hacked and doctored private emails from a third party server and gives a deliberately inaccurate picture,\" read a statement released to Omnisport.\n\nBeckham: Man Utd almost sold be to Barcelona\n\n\"David Beckham and UNICEF have had a powerful partnership in support of children for over 15 years. The David Beckham 7 Fund specifically has raised millions of pounds and helped millions of vulnerable children around the world. David Beckham has given significant time and energy and has made personal financial donations to the 7 Fund and this commitment will continue long term.\n\n\"Before establishing the 7 Fund, David had supported UNICEF and a number of other charities over many years, including donating his entire earnings from PSG during his time playing there.\n\n\"David and UNICEF are rightly proud of what they have and will continue to achieve together and are happy to let the facts speak for themselves.”\n\nUNICEF issued a release of their own, detailing and praising Beckham's work for charity.\n\nThe statement read: \"UNICEF has become aware of media reports relating to 7: The David Beckham UNICEF Fund. Some reports relate to alleged private correspondence between our ambassador and other parties, which we have not seen and cannot comment upon.\n\n\"David Beckham has been a UNICEF Goodwill Ambassador since 2005, and as well as generously giving his time, energy and support to help raise awareness and funds for UNICEF’s work for children, David has given significant funds personally.\n\nBeckham returns to Paris Saint-Germain\n\n\"The 7 Fund supports programmes for children, tackling issues such as malnutrition, violence, AIDS and emergencies. For example, in June 2016 David visited Swaziland to raise awareness of the devastating drought affecting Eastern and Southern Africa, helping UNICEF reach people around the world with important messages about the need for urgent action.\n\n\"UNICEF works closely with high profile personalities in good faith to fundraise, advocate and make long-term change for children in danger around the world. Our ambassadors support UNICEF in a voluntary capacity, receiving no fee for their time and commitment. They contribute greatly to UNICEF’s work for children.\"\n\n\"We are extremely proud of the 7 Fund and all it has achieved for children. Since it launched in February 2015 it has raised millions of pounds for UNICEF programmes and reached millions of people around the world with crucial messages about our work for very vulnerable children.\"", "images": ["http://www.goal.com/assets/low-end/ltr/img/goal-logo.014394eb2f.png", "https://www.goal.com/analyticsproxy?v=1&tid=UA-62411523-1&dh=www.goal.com&dp=%2Fen-us%2Fnews%2Fdavid-beckham-allegations-deliberately-innacurate-says-spokesman-%2F9g7uk3r8nldk1nd2ouz4jupo1&t=pageview&cd1=soccer&cd2=Mobile&cd3=Dom%20Farrell&cd4=Beckham%20allegations%20%27deliberately%20inaccurate%27%2C%20says%20spokesman&cd5=David%20Beckham%3AArticle%3ANews%3ABeckham%20allegations%20%27deliberately%20inaccurate%27%2C%20says%20spokesman&cd8=David%20Beckham%2CManchester%20United%2CPremier%20League%2CPrimera%20Divisi%C3%B3n%2CReal%20Madrid%2CLigue%201&cd9=Article&cd10=en-us&cd11=Mobilenojs&cd13=David%20Beckham&cd14=9g7uk3r8nldk1nd2ouz4jupo1&cd16=Embed&cd17=eP3&cd18=2017-02-04T12%3A01%3A07%2B00%3A00&cd20=en&cd23=News&cd26=David%20Beckham&cd27=Player&cd28=Manchester%20United&cd29=Team&cd12=r", "http://www.goal.com/assets/low-end/ltr/favicon-16x16.png", "https://images.daznservices.com/di/library/omnisport/1e/f6/davidbeckham-cropped_1kbzrlw1k1r391k4a7w5nmejgb.jpg?t=144404786&quality=60&w=190"], "top_img": "http://www.goal.com/assets/low-end/ltr/favicon-16x16.png", "keywords": [], "authors": [], "canonical_link": "https://www.goal.com/en-us/news/david-beckham-allegations-deliberately-innacurate-says-spokesman-/9g7uk3r8nldk1nd2ouz4jupo1", "title": "Beckham allegations from 'hacked and doctored emails'", "meta_data": {"description": "Newspaper allegations made against David Beckham paint a \"deliberately inaccurate picture\" of the ex-England and Manchester United star, a spokesman said.", "keywords": "David Beckham,Manchester United,Premier League,Primera División,Real Madrid,Ligue 1", "viewport": "width=device-width, initial-scale=1", "robots": "NOINDEX, NOFOLLOW"}, "movies": [], "publish_date": null, "source": "http://www.goal.com", "summary": ""}