{"url": "www.independent.co.uk/arts-entertainment/music/manchester-attack-read-ariana-grandes-full-statement-benefit-concert-a7758621.html", "text": "Ariana Grande has penned a heartfelt letter to her fans urging bravery and compassion just days after the tragic attack in Manchester that left 22 people dead and scores more injured.\n\nIn the letter, Grande painted a picture of her fans as a resilient network of diverse people with diametrically opposed values to those of the type of individual who would strap a bomb to their chests and attack an innocent crowd.\n\nMusic, she wrote, is a great unifying force in the world, and terrorist attacks and hate shouldn't stop the joy that it brings to people.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nGrande's letter follows just days after a suicide bomber posted up outside of a concert of hers in Manchester. The concert had just ended, and the blast occurred in an area where parents were waiting for their children to exit the arena. Grande's crowd is known to skew younger, and is particularly attractive to young women.\n\nRead the whole text of her letter below.\n\nShape Created with Sketch. Manchester explosion in pictures Show all 37 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Manchester explosion in pictures 1/37 People running down stairs as they attempt to exit the Manchester Arena after a blast, where U.S. singer Ariana Grande had been performing, in Manchester Twitter/@ZACH_BRUCE/ via REUTERS 2/37 Helpers attend to people inside the Manchester Arena after a suspected suicide bomber detonated an explosive device at the end of an Ariana Grande concert, killing 22 people PA wire 3/37 Armed officers guard outside a hotel near the Manchester Arena following reports of an explosion, in Manchester, Britain EPA 4/37 Police officers are seen outside the Manchester Arena, where U.S. singer Ariana Grande had been performing, in Manchester, northern England Reuters 5/37 Getty Images 6/37 Getty Images 7/37 Getty Images 8/37 AFP/Getty Images 9/37 Police and fans close to the Manchester Arena, after reports of an explosion Getty Images 10/37 There have been reports of explosions at Manchester Arena where Ariana Grande had performed Getty Images 11/37 Police deploy at scene of explosion in Manchester, England, at a concert in Manchester Arena AFP/Getty Images 12/37 Police stand by a cordoned off street close to the Manchester Arena Getty Images 13/37 Police deploy at scene of explosion in Manchester, England AFP/Getty Images 14/37 Police deploy at scene of a reported explosion during a concert in Manchester, England, on May 23, 2017. British police said early May 23 there were \"a number of confirmed fatalities\" after reports of at least one explosion during a pop concert by US singer Ariana Grande. Ambulances were seen rushing to the Manchester Arena venue and police added in a statement that people should avoid the area AFP/Getty Images 15/37 An ambulance drives away from the Manchester Arena, where U.S. singer Ariana Grande had been performing, in Manchester Reuters 16/37 Police escort members of the public from the Manchester Arena in Manchester, England. Getty Images 17/37 A woman sits in the street in a blanket near the Manchester Arena as police guard the area following reports of an explosion, in Manchester, Britain EPA 18/37 Two women wrapped in thermal blankets stand near the Manchester Arena, where US singer Ariana Grande had been performing, in Manchester Reuters 19/37 A Royal Logistic Corps (RLC) bomb disposal robot is unloaded outside the Manchester Arena following reports of an explosion, in Manchester. At least 19 people have been confirmed dead and others 50 were injured, authorities said. It is being treated as a terrorist incident until police know otherwise EPA 20/37 A Royal Logistic Corps (RLC) bomb disposal robot is unloaded outside the Manchester Arena following reports of an explosion, in Manchester EPA 21/37 Members of the public receive treatment from emergency service staff at Victoria Railway Station close to the Manchester Arena on May 23, 2017 in Manchester, England. There have been reports of explosions at Manchester Arena where Ariana Grande had performed this evening. Greater Manchester Police have have confirmed there are fatalities and warned people to stay away from the area Getty Images 22/37 Armed police after a suspected terrorist attack at the Manchester Arena at the end of a concert by US star Ariana Grande left 19 dead PA wire 23/37 Emergency services arrive close to the Manchester Arena in Manchester Getty Images 24/37 An amoured police vehicle patrols near Manchester Arena in Manchester Getty Images 25/37 A man carries a young girl on his shoulders near Victoria station in Manchester AFP/Getty Images 26/37 Police officers stand at the Miller Street and Corporation Street Crossroads, in front of the Manchester Arena in Manchester, England Getty Images 27/37 Police block a road near to the Manchester Arena in central Manchester, England AP 28/37 Armed police patrol near Victoria station in Manchester, northwest England. Twenty two people have been killed and dozens injured after a suspected suicide bomber targeted fans leaving a concert of US singer Ariana Grande in Manchester Getty Images 29/37 Police forensic officers leave the Manchester Arena as they investigate the scene of an explosion in Manchester Getty Images 30/37 A forensic officer collects evidence on a walkway between Victoria station and Manchester Arena following a deadly terror attack in Manchester, Getty Images 31/37 A woman and a young girl wearing a t-shirt of US singer Ariana Grande talks to police near Manchester Arena following a deadly terror attack in Manchester, Getty 32/37 EPA 33/37 Mayor of Greater Manchester Andy Burnham and Manchester City Council Leader Sir Richard Leese speak to the media outside Manchester Town Hall after a suicide bomber killed 22 people, including children, as an explosion tore through fans leaving a pop concert in Manchester Dave Higgens/PA Wire 34/37 The media gather behind a police cordon in Manchester Getty Images 35/37 Flowers left close to the Manchester Arena, the morning after a suicide bomber killed 22 people, including children, as an explosion tore through fans leaving a pop concert in Manchester Danny Lawson/PA Wire 36/37 Ariana Grande concert attendees Karen Moore and her daughter Molly Steed, aged 14, from Derby, leave the Park Inn where they were given refuge after last night's explosion at Manchester Arena Getty 37/37 Signs saying 'We love Manchester' are displayed in a window in Manchester, England Getty Images 1/37 People running down stairs as they attempt to exit the Manchester Arena after a blast, where U.S. singer Ariana Grande had been performing, in Manchester Twitter/@ZACH_BRUCE/ via REUTERS 2/37 Helpers attend to people inside the Manchester Arena after a suspected suicide bomber detonated an explosive device at the end of an Ariana Grande concert, killing 22 people PA wire 3/37 Armed officers guard outside a hotel near the Manchester Arena following reports of an explosion, in Manchester, Britain EPA 4/37 Police officers are seen outside the Manchester Arena, where U.S. singer Ariana Grande had been performing, in Manchester, northern England Reuters 5/37 Getty Images 6/37 Getty Images 7/37 Getty Images 8/37 AFP/Getty Images 9/37 Police and fans close to the Manchester Arena, after reports of an explosion Getty Images 10/37 There have been reports of explosions at Manchester Arena where Ariana Grande had performed Getty Images 11/37 Police deploy at scene of explosion in Manchester, England, at a concert in Manchester Arena AFP/Getty Images 12/37 Police stand by a cordoned off street close to the Manchester Arena Getty Images 13/37 Police deploy at scene of explosion in Manchester, England AFP/Getty Images 14/37 Police deploy at scene of a reported explosion during a concert in Manchester, England, on May 23, 2017. British police said early May 23 there were \"a number of confirmed fatalities\" after reports of at least one explosion during a pop concert by US singer Ariana Grande. Ambulances were seen rushing to the Manchester Arena venue and police added in a statement that people should avoid the area AFP/Getty Images 15/37 An ambulance drives away from the Manchester Arena, where U.S. singer Ariana Grande had been performing, in Manchester Reuters 16/37 Police escort members of the public from the Manchester Arena in Manchester, England. Getty Images 17/37 A woman sits in the street in a blanket near the Manchester Arena as police guard the area following reports of an explosion, in Manchester, Britain EPA 18/37 Two women wrapped in thermal blankets stand near the Manchester Arena, where US singer Ariana Grande had been performing, in Manchester Reuters 19/37 A Royal Logistic Corps (RLC) bomb disposal robot is unloaded outside the Manchester Arena following reports of an explosion, in Manchester. At least 19 people have been confirmed dead and others 50 were injured, authorities said. It is being treated as a terrorist incident until police know otherwise EPA 20/37 A Royal Logistic Corps (RLC) bomb disposal robot is unloaded outside the Manchester Arena following reports of an explosion, in Manchester EPA 21/37 Members of the public receive treatment from emergency service staff at Victoria Railway Station close to the Manchester Arena on May 23, 2017 in Manchester, England. There have been reports of explosions at Manchester Arena where Ariana Grande had performed this evening. Greater Manchester Police have have confirmed there are fatalities and warned people to stay away from the area Getty Images 22/37 Armed police after a suspected terrorist attack at the Manchester Arena at the end of a concert by US star Ariana Grande left 19 dead PA wire 23/37 Emergency services arrive close to the Manchester Arena in Manchester Getty Images 24/37 An amoured police vehicle patrols near Manchester Arena in Manchester Getty Images 25/37 A man carries a young girl on his shoulders near Victoria station in Manchester AFP/Getty Images 26/37 Police officers stand at the Miller Street and Corporation Street Crossroads, in front of the Manchester Arena in Manchester, England Getty Images 27/37 Police block a road near to the Manchester Arena in central Manchester, England AP 28/37 Armed police patrol near Victoria station in Manchester, northwest England. Twenty two people have been killed and dozens injured after a suspected suicide bomber targeted fans leaving a concert of US singer Ariana Grande in Manchester Getty Images 29/37 Police forensic officers leave the Manchester Arena as they investigate the scene of an explosion in Manchester Getty Images 30/37 A forensic officer collects evidence on a walkway between Victoria station and Manchester Arena following a deadly terror attack in Manchester, Getty Images 31/37 A woman and a young girl wearing a t-shirt of US singer Ariana Grande talks to police near Manchester Arena following a deadly terror attack in Manchester, Getty 32/37 EPA 33/37 Mayor of Greater Manchester Andy Burnham and Manchester City Council Leader Sir Richard Leese speak to the media outside Manchester Town Hall after a suicide bomber killed 22 people, including children, as an explosion tore through fans leaving a pop concert in Manchester Dave Higgens/PA Wire 34/37 The media gather behind a police cordon in Manchester Getty Images 35/37 Flowers left close to the Manchester Arena, the morning after a suicide bomber killed 22 people, including children, as an explosion tore through fans leaving a pop concert in Manchester Danny Lawson/PA Wire 36/37 Ariana Grande concert attendees Karen Moore and her daughter Molly Steed, aged 14, from Derby, leave the Park Inn where they were given refuge after last night's explosion at Manchester Arena Getty 37/37 Signs saying 'We love Manchester' are displayed in a window in Manchester, England Getty Images\n\nMy heart, prayers and deepest condolences are with the victims of the Manchester Attack and their loved ones.\n\nThere is nothing I or anyone can do to take away the pain you are feeling or to make this better.\n\nHowever, I extend my hand and heart and everything I possibly can give to you and yours, should you want or need my help in any way.\n\nThe only thing we can do now is choose how we let this affect us and how we live our lives from here on out.\n\nI have been thinking of my fans, and of you all, non stop over the past week. The way you have handled all of this has been more inspiring and made me more proud than you’ll ever know.\n\nThe compassion, kindness, love, strength and oneness that you’ve shown one another this past week is the exact opposite of the heinous intentions it must take to pull off something as evil as what happened Monday.\n\nYOU are the opposite.\n\nI am sorry for the pain and fear that you must be feeling and for the trauma that you, too, must be experiencing.\n\nWe will never be able to understand why events like this take place because it is not in our nature, which is why we shouldn’t recoil.\n\nWe will not quit or operate in fear.\n\nWe won’t let this divide us.\n\nWe won’t let hate win.\n\nI don’t want to go the rest of the year without being able to see and hold and uplift my fans, the same way they continue to uplift me.\n\nOur response to this violence must be to come closer together, to help each other, to love more, to sing louder and to live more kindly and generously than we did before.\n\nI’ll be returning to the incredibly brave city of Manchester to spend time with my fans and to have a benefit concert in honor of and to raise money for the victims and their families. I want to than my fellow musicians and friends for reaching out to be a part of our expression of love for Manchester. I will have details to share with you as soon as everything is confirmed.\n\nFrom the day we started putting the Dangerous Woman Tour together, I said that this show, more than anything else, was intended to be a safe space for my fans. A place for them to escape, to celebrate, to heal, to feel safe and to be themselves. To meet their friends they’ve made online. To express themselves.\n\nThis will not change that.\n\nWhen you look into the audience at my shows, you see a beautiful, diverse, pure, happy crowd.\n\nThousands of people, incredibly different, all there for the same reason, music.\n\nMusic is something that everyone on Earth can share.\n\nMusic is meant to heal us, to bring us together, to make us happy.\n\nSo that is what it will continue to do for us. We will continue in honor of the ones we lost, their loved ones, my fans and all affected by this tragedy. They will be on my mind and in my heart everyday and I will think of them with everything I do for the rest of my life.\n\nAri", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/05/26/14/an122729873flowers-and-mess.jpg", "http://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/05/26/14/an122729873flowers-and-mess.jpg", "keywords": [], "authors": ["Clark Mindock"], "canonical_link": "https://www.independent.co.uk/arts-entertainment/music/manchester-attack-read-ariana-grandes-full-statement-benefit-concert-a7758621.html", "title": "Manchester attack: Read Ariana Grande's statement in full as she announces benefit concert", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "http://www.independent.co.uk/arts-entertainment/music/manchester-attack-read-ariana-grandes-full-statement-benefit-concert-a7758621.html", "title": "Read Ariana Grande's fresh statement about the Manchester attack in full", "updated_time": "2017-05-26T21:20:09+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/05/26/14/an122729873flowers-and-mess.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/7758621"}, "description": "Ariana Grande has penned a heartfelt letter to her fans urging bravery and compassion just days after the tragic attack in Manchester that left 22 people dead and scores more injured. In the letter, Grande painted a picture of her fans as a resilient network of diverse people with diametrically opposed values to those of the type of individual who would strap a bomb to their", "keywords": "Ariana Grande, Manchester, Manchester attack, Music, Culture", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Ariana Grande", "published_time": "2017-05-26T20:01:00+01:00", "modified_time": "2017-05-26T21:20:09+01:00", "section": "Music", "author_name": "Clark Mindock", "content_type": "story", "word_count": 762, "image_count": 2, "video_count": 0, "embed_count": 0, "internal_link_count": 5, "external_link_count": 0}, "twitter": {"title": "Read Ariana Grande's fresh statement about the Manchester attack in …", "description": "Ariana Grande has penned a heartfelt letter to her fans urging bravery and compassion just days after the tragic attack in Manchester that left 22 people dead and scores more injured. In the letter,", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1495825260.0, "source": "http://www.independent.co.uk", "summary": ""}