{"url": "https://torontosun.com/entertainment/television/the-crown-season-2-accentuates-how-todays-prince-harry-is-yesterdays-princess-margaret", "text": "BEVERLY HILLS, Calif. — You don’t hear the term “royal boob” very often in casual conversation.\n\nBut “royal boob” apparently was a prime topic of discussion on the set of The Crown as Season 2 was being filmed.\n\n“We had a big debate whether or not to show ‘royal boob,’” said Vanessa Kirby, who plays Princess Margaret.\n\nThe verdict? We’ll get to that.\n\nThe subject came up while Kirby and former Doctor Who Matt Smith, who plays Prince Philip, were being interviewed together to promote Season 2 of The Crown, which debuts Dec. 8 on Netflix. The series, of course, follows the long reign of Queen Elizabeth II, played by Claire Foy.\n\nWith Season 2 picking up where Season 1 left off — in the mid-1950s — Smith was talking about how the changing times really started affecting the relationships and inner workings of the royal family as the swinging ’60s approached.\n\nAnd when you think about it, that has been one of the consistent struggles for the royal family ever since, hasn’t it? Should you modernize? Can you modernize? How much? Does modernization potentially expose uncomfortable ironies, leaving you vulnerable to obsolescence?\n\nToday’s Prince Harry — who is getting married to TV actress and humanitarian Meghan Markle, as was announced in the past week — is the Princess Margaret of the ’50s and ’60s. You know, the younger sibling of the monarch, the “spare” who follows the heir, with a form of limited freedom that expands once the heir starts pumping out kids, each one of which moves the “spare” further away from the actual throne.\n\n“Margaret, she’s the one character who really embraces the ’60s,” Smith pointed out, as Kirby nodded her head in agreement. “The rest of the royal family don’t quite know what to be.\n\n“The perception of them changes so greatly, and then Maggie gets on with it, doesn’t she, with Tony (Margaret’s eventual husband Antony Armstrong-Jones, played by Matthew Goode). It’s quite interesting.\n\n“There’s sex in it. I’m just saying.”\n\nThat’s when Kirby recalled there had been a debate about whether or not to show “royal boob” in a sex scene featuring Margaret and Tony. But beyond those physical concerns, Kirby acknowledged the emotional trap Margaret finds herself in, both as a young woman in Season 1 and continuing into full adulthood in Season 2.\n\n“In the first season Margaret was really kind of combative with (Elizabeth),” Kirby said. “And then (in Season 2), as Margaret looks elsewhere for reassurance, and for identity and for a sense of self, in Tony and that world, I think she kind of grows with confidence.\n\n“But wounds don’t heal that easy.”\n\nWith the royal sisters still in opposition in many ways in Season 2, Kirby found herself increasingly protective of Margaret.\n\n“Playing it with Claire (Foy), I felt like in fact Margaret had to step up even more,” Kirby said. “Margaret had to define who she isn’t, meaning, ‘I’m not you, I’m free to break away, I’m free to live, I’m free to love, I know who I am now, I’m a woman for the modern age, i.e., you’re not.’”\n\nSmith agreed that Queen Elizabeth must have felt somewhat abandoned by her husband Philip and her sister Margaret in the late ’50s and into the ’60s, at least in terms of the vibrant social scene.\n\n“Elizabeth is sort of left behind, because she can’t go to the theatre in quite the same way, she can’t engage culturally with the world around her in quite the same way that Philip and Margaret do,” Smith said. “They go and they live their lives a bit more.”\n\nI must admit, there were times in Season 1 of The Crown when I felt sorry for the young Elizabeth, dealing with her bratty sister and pouty husband. Hey, Elizabeth didn’t ask for any of this. Her uncle abdicated and her dad died. Suddenly she was Queen. How about a little understanding and co-operation, huh?\n\nBe that as it may, Kirby and Smith had a fun exchange when asked if they had heard anything about how the real royal family has reacted to The Crown.\n\n“I might have,” Smith said playfully.\n\n“I haven’t,” Kirby replied.\n\nSmith said to Kirby, “I don’t know about you. We have heard, but I think it’s prudent and respectful of us not to say anything.”\n\nKirby added, “The only reason I’ve heard from another route is that an American friend of mine was in London and happened to be chatting to Princess Beatrice.”\n\n“I’m talking about the big guns,” said Smith, prompting laughter.\n\n“But (Princess Beatrice) was talking about her granny, in context of The Crown, and my American friend was like, ‘Who is this girl talking about her granny?’ ” Kirby explained. “And then later (my American friend) was like, ‘Oh my God, it’s the Queen!’ ”\n\n“Oh wow, really? That’s funny,” Smith said. “(Princess Beatrice) sent us a lovely email, actually. She’s nice, Princess Beatrice.”\n\nBut back to the question. What do the “big guns” among the royals think of The Crown?\n\n“Um, yeah, we’ve heard,” Smith repeated. “Philip hasn’t watched it.”\n\nWell, if any or all of the royals watch Season 2, they obviously will see some new characters, including U.S. President John F. Kennedy and his wife Jackie. The glamorous American couple is played by Michael C. Hall (best known for his roles in Dexter and Six Feet Under) and Jodi Balfour (a South African actress best known to Canadian TV audiences for her role in the series Bomb Girls).\n\nIt’ll be close to an entirely new cast in Season 3 of The Crown, even with regard to the principals. Creator Peter Morgan’s plan is for The Crown to run for six seasons, covering Queen Elizabeth’s entire reign, so the main characters have to age relatively briskly. To this point, the only official casting news is that Olivia Colman will take over from Foy to play Queen Elizabeth in Seasons 3 and 4.\n\nKirby joked that maybe she isn’t quite done yet. “Can I just wear a different wig and come back as Margaret Thatcher?”\n\nThis seems like an odd place to revive the debate about “royal boob,” but we can’t leave it unanswered. So what was the final determination?\n\n“At the beginning, we were like, ‘Should we?’ ” Kirby said. “But we decided we don’t want to see royal boob, thank God.”\n\n“I think that’s probably a good idea,” Smith said.\n\n“Probably,” repeated Kirby with a hint of comic uncertainty in her voice.\n\n“So there’s no royal boob?” Smith asked again, just to make sure.\n\n“No royal boob,” Kirby confirmed. “It wasn’t raunchy at all, in the end. It was respectful.”\n\nThat’s the royal family for you. Respectful on the outside, raunchy on the inside.\n\nTwitter: @billharris_tv\n\nbillharristv@gmail.com", "images": ["https://postmediacanoe.files.wordpress.com/2020/04/secondcity.jpg?w=107&h=80&crop=1&quality=80&strip=all", "https://postmediatorontosun.files.wordpress.com/2020/04/jon-roche-500d4654-cf24-4058-befa-dee46a2fb8d5-e1587142593459.jpeg?quality=80&strip=all&w=365&h=273&crop=1", "https://postmediatorontosun.files.wordpress.com/2017/09/toronto-desktop.png", "https://postmediatorontosun.files.wordpress.com/2020/04/health-coronavirus-canada-banks-e1587174436594.jpg?quality=80&strip=all&w=205&h=153&crop=1", "https://api.pymx5.com/v1/sites/track?event_type=PAGE_VIEW&noscript=1", "https://googleads.g.doubleclick.net/pagead/viewthroughconversion/990309138/?value=0&guid=ON&script=0", "https://postmediatorontosun.files.wordpress.com/2020/04/modern-family-abc.jpg?quality=80&strip=all&w=365&h=273&crop=1", "https://postmediatorontosun.files.wordpress.com/2020/04/christine2-e1587160520269.jpg?quality=80&strip=all&w=205&h=153&crop=1", "https://postmediatorontosun.files.wordpress.com/2020/04/jon-roche-500d4654-cf24-4058-befa-dee46a2fb8d5-e1587142593459.jpeg?quality=80&strip=all&w=107&h=80&crop=1", "https://postmediacanoe.files.wordpress.com/2020/04/146292_0337-e1587076947758.jpg?w=107&h=80&crop=1&quality=80&strip=all", "https://postmediatorontosun.files.wordpress.com/2017/12/claire-foy-matt-smith-1-e1512005953905.jpg", "https://pixel.wp.com/b.gif?v=noscript", "https://postmediatorontosun.files.wordpress.com/2019/11/doctor.jpg?quality=80&strip=all&w=205&h=153&crop=1", "https://postmediacanoe.files.wordpress.com/2020/04/dylan-colbert.jpg?w=107&h=80&crop=1&quality=80&strip=all", "https://secure.gravatar.com/avatar/?s=96&d=identicon&r=g", "https://postmediatorontosun.files.wordpress.com/2020/04/streaming-gettyimages-1078740886.jpg?quality=80&strip=all&w=365&h=273&crop=1"], "top_img": "https://postmediatorontosun.files.wordpress.com/2017/12/claire-foy-matt-smith-1-e1512005953905.jpg", "keywords": [], "authors": [], "canonical_link": "https://torontosun.com/entertainment/television/the-crown-season-2-accentuates-how-todays-prince-harry-is-yesterdays-princess-margaret", "title": "'The Crown' Season 2 accentuates how today's Prince Harry is yesterday's Princess Margaret", "meta_data": {"robots": "noarchive", "description": "BEVERLY HILLS, Calif. &mdash; You don&rsquo;t hear the term &ldquo;royal boob&rdquo; very often in casual conversation.But &ldquo;royal boob&rdquo; apparently was a prime topic of discussion on the set of The Crown as Season 2 was being filmed.", "news_keywords": "The Crown Season 2, The Crown, The Crown Netflix, Netflix, Matt Smith, Claire Foy, Vanessa Kirby, royals", "generator": "WordPress.com", "og": {"type": "article", "title": "‘The Crown’ Season 2 accentuates how today’s Prince Harry is yesterday’s Princess Margaret", "url": "https://torontosun.com/entertainment/television/the-crown-season-2-accentuates-how-todays-prince-harry-is-yesterdays-princess-margaret", "description": "BEVERLY HILLS, Calif. — You don’t hear the term “royal boob” very often in casual conversation.But “royal boob” apparently was a prime topic of discussion on the…", "site_name": "Toronto Sun", "image": {"identifier": "https://postmediatorontosun.files.wordpress.com/2017/12/claire-foy-matt-smith-1-e1512005953905.jpg", "width": 200, "height": 200}, "locale": "en_US"}, "article": {"published_time": "2017-12-02T14:00:05+00:00", "modified_time": "2017-12-02T14:00:09+00:00", "publisher": "https://www.facebook.com/torontosun"}, "twitter": {"site": "@TheTorontoSun", "text": {"title": "‘The Crown’ Season 2 accentuates how today’s Prince Harry is yesterday’s Princess Margaret"}, "image": "https://postmediatorontosun.files.wordpress.com/2017/12/claire-foy-matt-smith-1-e1512005953905.jpg", "card": "summary_large_image", "title": "No royal boob on 'The Crown' Season 2", "description": "BEVERLY HILLS, Calif. — You don’t hear the term “royal boob” very often in casual conversation."}, "stats-full-init": "0.013", "stats-postmedia_theme_pre_initialize": "0.001", "stats-initialize": "0.011", "stats-postmedia_theme_post_initialize": "0.000", "stats-vip_load_plugins": "0.001", "stats-load_plugins": "0.008", "stats-register_widgets": "0.001", "fb": {"pages": 1910312429243234, "app_id": 1910312429243234, "page_id": 189526659635, "admins": 100002625504753}, "ia": {"markup_url": "https://torontosun.com/entertainment/television/the-crown-season-2-accentuates-how-todays-prince-harry-is-yesterdays-princess-margaret?ia_markup=1"}, "ROBOTS": "NOARCHIVE", "google-site-verification": "kK9JgWClNj_xPmY-xEXJ8C95PgC_s3Ax12Qq6Wkqh88", "msvalidate.01": "82AAA33807D8EF7E8A26FD0304CB4F2B", "application-name": "Toronto Sun", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Toronto News | Latest Headlines & Breaking News", "msapplication-task": "name=Subscribe;action-uri=https://torontosun.com/feed;icon-uri=https://postmediatorontosun.files.wordpress.com/2018/05/cropped-sun-512x512.png?w=16", "msapplication-TileImage": "https://postmediatorontosun.files.wordpress.com/2018/05/cropped-sun-512x512.png?w=270"}, "movies": ["https://www.youtube.com/embed/ME2umFQ_xBA?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/dasSmCKNlRE?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/OteHE_IuZ-k?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": 1512223205.0, "source": "https://torontosun.com", "summary": ""}