{"url": "https://ftw.usatoday.com/2018/07/danica-patrick-host-espys-monologue-jokes-best-worst-nascar-awards-2018", "text": "Danica Patrick hosted the 2018 ESPYS on Wednesday night in Los Angeles, opening the show with a seven-minute monologue that received mixed reviews from the internet.\n\nShe nailed several jokes, but her comedic timing was a little off on others and led to a few awkward moments. And it probably didn’t help that the audience didn’t seem settled in their seats and fully into the routine.\n\nPrior to the show, Patrick told For The Win she prepped by practicing her monologue to ensure the jokes were delivered in her voice. She took plenty of shots at other athletes — including LeBron James, Tiger Woods and the U.S. men’s soccer team — and said that when she was often the target of jokes, she took it as a compliment because she was “important enough” to be thought of.\n\n“I loved the creative process and coming up with ideas and jokes and putting in my two cents there, along with the help of a dozen highly qualified writers,” Patrick told FTW by phone Saturday.\n\nSo because there were some highs and lows at the show, here are Patrick’s best and worst jokes.\n\nThe Best\n\n1. A topical joke, for the win\n\n“The Caps won their first Stanley Cup in franchise history. And Alex Ovechkin couldn’t be any happier. I haven’t seen a Russian this pleased with Washington since, well, two days ago.”\n\n2. Tiger back?\n\nThrough the self-deprecating humor Patrick promised, she took a shot at Tiger Woods and herself — but also her trolls on social media who constantly questioned why people cared about her NASCAR and IndyCar careers when she only won one race in 14 years on the track.\n\n“Tiger Woods is back. Sort of I guess. I mean, why do people keep talking about this guy who isn’t winning? Who does he think he is? Me?”\n\n3. Sorry, Cleveland\n\n“No matter what else is going on in the world, sports have always had the power to inspire and give hope… unless those people are from Cleveland.”\n\n4. Another punch\n\nFollowing an awkward joke about LeBron James’ hair (see below in The Worst), Danica made a great joke about poor J.R. Smith not knowing what the score was during Game 1 of the NBA Finals.\n\n“That’s OK. LeBron, when he hosted, he made fun of me too. I’d say we’re even. J.R. Smith would say we’re up by one!”\n\nThat one was met with heavy applause. And she continued…\n\n“Yeah, he made quite the little oopsie in the playoffs this year. You know, it’s not good when you have 100 tattoos and none of them are your biggest mistake.”\n\n5. Keeping Up with the Kardashians\n\nPhiladelphia 76s star Ben Simmons is reportedly dating Kendall Jenner, so who could resist an easy target?\n\n“So many big NBA moves this offseason. Kawhi Leonard went to the Raptors, Dwight Howard went to the Wizards and Ben Simmons went to the Kardashians.”\n\n6. Adam Rippon’s Instagram stardom\n\nWhile highlighting the amazing performances by Team USA in the 2018 Winter Olympics, Patrick said:\n\n“Our gold-medal winning women’s hockey team is here, gold medalist Chloe Kim is here and Instagram’s Adam Rippon is here… I’m told he also won a medal.”\n\nCut to Rippon — who won a figure skating bronze medal in South Korea — who was hilariously posing like he would for his Instagram account, which is spectacularly entertaining. He stole the show briefly with this joke, but it was cute all around.\n\n7. A short joke\n\nDanica is only about 5-foot-2, so she doesn’t have much of a leg to stand on here when teasing Houston Astros’ All-Star second baseman José Altuve. But as someone who’s in the same height range, this writer always appreciates short jokes.\n\n“World Series champion José Altuve is here. And when I say it’s incredible that José can reach the top of his profession without being able to reach the top shelf of his locker, it’s out of respect.”\n\nThe Worst\n\n1. It started off fine…\n\nPatrick threw a jab at the NFL’s new policy that players must stand for the national anthem if they’re on the field, which the players themselves found ridiculous and pointed out how it still misses the point of the peaceful protests. But then the joke continued as she addressed “the elephant in the room” with the national anthem controversy, and an image of Fergie appeared on the screen behind her.\n\n“Give it up for the U.S. men’s curling team, they also took home gold. And for those unfamiliar, curling is the sport where you are allowed to kneel. It’s encouraged. “That’s right, we have to mention the elephant in the room. It’s time to talk about the national anthem controversy. (Cut to an image of Fergie.) I don’t know what Fergie was thinking either.”\n\nThis was just a bad joke involving serious issues, like of racial injustice and police brutality, and Philadelphia Eagles’ Chris Long — one of the leading advocates for peaceful protests — was seen saying it was bad. However, it turns out he was talking about Fergie’s terrible performance from the NBA All-Star Game.\n\nFor the record geniuses I was talking about Fergie https://t.co/sZN4tyw9Rz — Chris Long (@JOEL9ONE) July 19, 2018\n\n2. Odell Beckham Jr.’s hair\n\n“Odell is, once again, healthy and will return to the field next season, but his hair style’s still listed as questionable.”\n\nWe’ve heard this one before, and Patrick’s delivery was a little bit off. However, Patrick also appeared on stage wearing a shorts suit, saying she borrowed it from OBJ. He seemed to enjoy that quip a little more.\n\n3. And then LeBron James’ hair\n\nThis one just straight up fell flat, and the timing was all kinds of off.\n\n“Who doesn’t love LeBron James? He’s one of the greatest basketball players of all time, and now, LeBron is the newest Los Angeles transplant. Los Angeles transplant is also what he Googles when he needs new hair.”\n\n4. No, the USMNT wasn’t in the World Cup\n\nIf you haven’t heard by now, the soccer tournament that started more than a month ago and ended last weekend didn’t include the U.S.\n\n“Congratulations to France on winning the World Cup. I’d make a joke about the U.S. soccer team, but they didn’t qualify for this monologue.”\n\n5. KD’s burners\n\nPatrick closed her monologue with one final joke, this one aimed at Kevin Durant. It was funny, but not new and seemed like a missed opportunity to throw a punch at the 76ers.\n\n“It’s time to give out some awards tonight. Remember, the ESPYS are voted on by all of you. And there’s no greater honor than being recognized by actual fans. This year, millions of them cast their votes on Twitter, and only 1,000 were from Kevin Durant’s burner accounts.”\n\nBonus:\n\nThis wasn’t part of her monologue, but the costumes were great for Patrick and Kareem Abdul-Jabbar’s Game of Thrones non-sketch.", "images": ["https://usatftw.files.wordpress.com/2015/11/logo-ftw.png", "https://usatftw.files.wordpress.com/2017/02/headshot.jpg?w=48&h=48&crop=1", "https://usatftw.files.wordpress.com/2020/04/butler.jpg?w=100&h=60&crop=1", "https://usatftw.files.wordpress.com/2018/07/gty-1001462466_101577557-e1531969040196.jpg?w=100&h=70#038;h=709", "https://usatftw.files.wordpress.com/2020/04/warriors.jpg?w=34&h=20&crop=1", "https://usatftw.files.wordpress.com/2020/04/pjimage-94-e1587064131765.jpg?w=100&h=60&crop=1", "https://usatftw.files.wordpress.com/2018/02/usp_nba__all_star_game-team_lebron_at_team_stephen_97671794-e1519144246714.jpg?w=1000&h=555", "https://usatftw.files.wordpress.com/2015/11/logo-usat-bar.png", "https://usatftw.files.wordpress.com/2015/11/ftw-icon-section-head.png", "https://usatftw.files.wordpress.com/2018/07/ap-2018-espy-awards-show_101575967-e1531968479379.jpg?w=1000&h=640", "https://usatftw.files.wordpress.com/2020/04/usp-nascar_-media-day-2.jpg?w=100&h=60&crop=1", "https://usatftw.files.wordpress.com/2019/05/usp-nba_-playoffs-boston-celtics-at-milwaukee-buck-e1557406697527.jpg?w=24&h=24&crop=1", "https://usatftw.files.wordpress.com/2020/04/zabit.jpg?w=34&h=20&crop=1", "https://usatftw.files.wordpress.com/2020/02/ap-celtics-bucks-basketball.jpg?w=24&h=24&crop=1", "https://usatftw.files.wordpress.com/2018/07/ap-2018-espy-awards-show_101575967-e1532014590823.jpg?w=1024&h=576&crop=1", "https://usatftw.files.wordpress.com/2018/07/ap-2018-espy-awards-show_101575967-e1531968479379.jpg?w=100&h=64#038;h=640", "https://usatftw.files.wordpress.com/2018/02/usp_nba__all_star_game-team_lebron_at_team_stephen_97671794-e1519144246714.jpg?w=100&h=55#038;h=555", "https://usatftw.files.wordpress.com/2019/12/gty-1001452154-e1575297703217.jpg?w=24&h=24&crop=1", "https://usatftw.files.wordpress.com/2018/07/lebron-jr-smith.jpg?w=100&h=70#038;h=703", "https://usatftw.files.wordpress.com/2020/04/lamartrump.jpg?w=34&h=20&crop=1", "https://usatftw.files.wordpress.com/2018/07/ap-2018-espy-awards-show_101577561.jpg?w=100&h=66#038;h=666", "https://usatftw.files.wordpress.com/2018/07/gty-1001462466_101577557-e1531969040196.jpg?w=1000&h=709", "https://usatftw.files.wordpress.com/2020/04/fifa.png?w=34&h=20&crop=1", "https://usatftw.files.wordpress.com/2018/07/lebron-jr-smith.jpg?w=1000&h=703", "https://pixel.wp.com/b.gif?v=noscript", "https://usatftw.files.wordpress.com/2020/04/screen-shot-2020-04-18-at-5.44.02-pm.jpg?w=34&h=20&crop=1", "https://usatftw.files.wordpress.com/2018/07/ap-2018-espy-awards-show_101577561.jpg?w=1000&h=666"], "top_img": "https://usatftw.files.wordpress.com/2018/07/ap-2018-espy-awards-show_101575967-e1532014590823.jpg?w=1024&h=576&crop=1", "keywords": [], "authors": ["Michelle R. Martinelli", "Nick Schwartz", "July"], "canonical_link": "https://ftw.usatoday.com/2018/07/danica-patrick-host-espys-monologue-jokes-best-worst-nascar-awards-2018", "title": "12 of Danica Patrick's best and worst jokes from the 2018 ESPYS", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Danica nailed several jokes, but her comedic timing was a little off on others.", "keywords": "danica patrick, espys, monologue, jokes, watch, lebron james, kevin durant, tiger woods, alex ovechkin, putin, washington, caps, trump, chris long, nfl, national anthem protest, game of thrones, odell beckham jr., adam rippon, chloe kim, fergie, nba, nascar, golf, sports", "fb": {"app_id": 451360081611296, "admins": 1651440013}, "google-site-verification": "no3A69hVM5ut63_reMWqC5VegUmDtCMsgeO4Wh_iBY8", "msvalidate.01": "6C7AFE373C691E833D6444FFA7F6E8A2", "generator": "WordPress.com", "og": {"type": "article", "title": "12 of Danica Patrick's best and worst jokes from the 2018 ESPYS", "url": "https://ftw.usatoday.com/2018/07/danica-patrick-host-espys-monologue-jokes-best-worst-nascar-awards-2018", "description": "Danica nailed several jokes, but her comedic timing was a little off on others.", "site_name": "For The Win", "image": {"identifier": "https://usatftw.files.wordpress.com/2018/07/ap-2018-espy-awards-show_101575967-e1532014590823.jpg?w=1024&h=576&crop=1", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2018-07-19T11:37:27+00:00", "modified_time": "2018-07-19T15:38:31+00:00", "publisher": "https://www.facebook.com/usatodayftw"}, "twitter": {"creator": "@ForTheWin", "site": "@forthewin", "text": {"title": "12 of Danica Patrick's best and worst jokes from the 2018 ESPYS"}, "image": "https://usatftw.files.wordpress.com/2018/07/ap-2018-espy-awards-show_101575967-e1532014590823.jpg?w=640", "card": "summary_large_image"}, "gdpr": "false", "sop-property": "581b62d42a2cc300124a6a6e", "application-name": "For The Win", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "What fans are talking about.", "msapplication-task": "name=Subscribe;action-uri=https://ftw.usatoday.com/feed;icon-uri=https://secure.gravatar.com/blavatar/2ef498b87825ac1e90fb08b478c63932?s=16"}, "movies": [], "publish_date": 1532000247.0, "source": "https://ftw.usatoday.com", "summary": ""}