{"url": "https://birthmoviesdeath.com/2016/05/03/marvel-v-dc-dawn-of-rivalry", "text": "DC came first. That's the most important thing to know, that DC was there first. They were called Detective Comics, Inc, later to be called National Publications, later to be called DC, and they invented superheroes with Action Comics #1. They reinvented superheroes with Showcase #4 in 1956, when they introduced a new version of the 1940s character The Flash and kickstarted The Silver Age of Comics. There are no superheroes without DC, and for decades they weathered any and all competition - in fact, they absorbed some of them. At one point they essentially sued Fawcett Comics out of existence, going after the popular Captain Marvel, aka SHAZAM!, who they claimed was a rip-off of Superman. When the dust had settled Fawcett had agreed to never again publish Captain Marvel stories; twenty years later DC added insult to injury by licensing the character from Fawcett and adding him to their DC Universe. That's how DC rolled, with power across the landscape, its stable of iconic, parental superheroes thundering across the sky.\n\nEnter Marvel. They had been there before - as Atlas, as Timely - but they had not truly made a mark. Atlas had high points in the 40s, like Captain America, the Sub-Mariner and the Human Torch, but when they became Timely in the 50s they were just a trend-chasing factory, coming in second with romance comics (which had been invented by Captain America creators Joe Simon and Jack Kirby), Westerns, scifi and horror and even attempting a little superhero revival early in the 50s. In 1961 they became Marvel Comics and nothing had changed - they were still chasing trends. Which is why the publisher asked editor/writer Stan Lee to come up with a riff on the Justice League, the popular team-up comic that DC had in 1960 after revamping many of its heroes.\n\nHere's where the rivalry comes in. Tasked with replicating the success of Justice League, Lee did something very different. Working with Jack Kirby he created a team group that had its own dynamics, had its own feel. And he decided to aim the comic not at kids but at the 'all ages' category. He and Kirby invented The Fantastic Four, and the Marvel Age was off with a bang. And the rivalry came soon after.\n\nMarvel was a scrappy, small operation trying to change things up. Part of the way Lee accomplished this was to give the whole company a unique feel - what we would call 'branding' in these base, trying times. Part of that feel was a direct connection with the readers in the form of \"Bullpen Bulletins,\" full page missives from Stan 'The Man' Lee to his growing legions of Marvel Zombies. The attitude of the Bullpen Bulletins were fresh and unique, a hep older guy talking to cool kids. It was very different from the stentorian approach of DC, whose Silver Age titles had Batgirl struggling with a run in her stocking on one Batman cover. This was part of the all ages approach - treating kid stuff like it was smart, and treating kids like they were teens. While other superhero comics had been chasing the tone and feel of what DC had done, Marvel staked out its corner of the market by being totally different.\n\nWithin those Bullpen Bulletins Stan would take shots at the \"Distinguished Competition.\" Sometimes he would refer to them as \"Brand Echh,\" a play on the then-current advertising term 'Brand X' referring to a competing product. Brand Echh took off enough to become a comic itself, Not Brand Echh, which was a satire magazine - Mad if it focused almost entirely on superheroes. Not Brand Echh took plenty of shots at DC, but also parodied the hipper Marvel characters.\n\nAs Marvel grew, DC took notice. The landscape changed around the company. In 1972 a small thing happened that always felt indicative of the larger picture - now licensing old Captain Marvel, the Fawcett hero DC had vanquished, the Distinguished Competition found themselves unable to call him Captain Marvel, as Marvel Comics had laid claim to the name. His comics would be titled SHAZAM!, after the magic word he cried to transform himself into Captain Marvel. The character who had once represented DC's domination of the superhero world now represented the way they had been undercut by the whippersnappers (I use that term loosely. Stan Lee was in his 40s when the Marvel Age began).\n\nEven the methodology of the two companies was different; Stan Lee pioneered a form of comic book writing that became known as The Marvel Method. The writer and artist would collaborate on a story outline, the artist would go off and draw the pages fitting the outline (more or less) and then the writer would come to those pages and add dialogue.\n\nOf course the two publishers were operating in a small world; they were both in Midtown Manhattan and both were often interested in the same talent. There was plenty of friendly back and forth, and Marvel and DC even instituted an annual softball game against each other (one that continues to this very day, or at least did until DC moved to California this year), but it wasn't until 1975 that they worked together. That year the two companies came together to produce MGM'a Marvelous Wizard of Oz, an adaptation of the classic movie. Both had been working on their own separate Oz books and at some point - probably over a friendly drink where editors commiserated with each other - it was decided that it made more sense to team up. That spirit of cooperation led to The Amazing Spider-Man vs Superman in 1976, another treasury-sized edition that pitted the two most popular superheroes against one another. Yes, Superman was more popular than Batman in the 70s.\n\nThat's a weird book because it posits a world where Superman and Spider-Man live side-by-side. It's a one off where Doctor Octopus and Lex Luthor get together to plan evil, and it ends with Clark Kent and Lois Lane going out on a double date with Peter Parker and Mary Jane Watson. While this book was a strange one off, it did pave the way for more to come.\n\nFrom a fan perspective the rivalry looked pretty one-sided throughout the late 1970s. DC struggled to keep up with what Marvel was doing, and they made changes like turning Clark Kent into a TV anchor in order to get more 'modern.' DC hit on the idea of aiming their books at a more adult audience in the 80s (sort of a follow-up to Marvel's black and white magazine sized books in the late 70s) and they made early and smart headway into the burgeoning direct market. Seeing the newsstand distribution of comics drying up, DC went for the comic book store crowd, printing fan-favorite title Teen Titans on high quality Baxter paper. The Teen Titans, by the way, was one of the most popular comics at the time, rivaling and even surpassing The X-Men. In 1982 those titles crossed over in a truly great comic book written by the legendary Chris Claremont, and it was a huge hit. A second issue, to be written by Titans writer Marv Wolfman, was planned for later in the year. And then it all fell apart.\n\nThe source of the friction seemed to be a JLA/Avengers title that was to be penciled by George Perez. That book was scuttled after Perez had done a ton of work on it, and he was furious. He had been scheduled to draw the second Teen Titans/X-Men crossover (as he was the Titans' artist), but it all fell apart after JLA/Avengers became the victim of editorial arguments between the companies. And there were no more crossovers for a decade.\n\nBut the rivalry continued! A couple of years after that crossover, DC rebooted their universe with Crisis on Infinite Earths, a huge success that gave their main line a massive creative bump. In a reversal of what had happened at the beginning of the Silver Age, Marvel paved the way for this - their Secret Wars was the first major company-wide crossover, but it was dictated by the demands of toy companies. While Secret Wars is, against all odds, great, Crisis on Infinite Earths was a better story, one rooted in the mythos of the DC Universe, and being motivated by continuity and storytelling.\n\nAt the same time DC was killing it with their more serious titles. They had the foresight to reach across the Atlantic and snatch up a number of emerging British writers, as well as the will to steal Frank Miller, who had redefined Daredevil for Marvel, to their side of the street. Miller went on to redefine Batman and one of those British writers, Alan Moore, went on to redefine superheroes in general with Watchmen. DC, once the company lagging behind innovative Marvel, was totally upending the comic book landscape. We had entered peak usage of the term 'graphic novel.'\n\nFor my money DC creatively won through the late 80s and early 90s. Marvel, rattled by numerous financial problems and almost constant trading of corporate hands, struggled to keep up. Where DC was doubling down on their moody, adult stuff, Marvel went for the new again, discovering a whole generation of talent who would go on to redefine the comic industry. Todd McFarlane, Rob Liefeld and Jim Lee all hit Marvel like bombs, and everything changed. Meanwhile, the two companies came back together for a couple of crossover events - DC vs Marvel, where battles between heavy-hitting heroes were decided by fan votes, and Amalgam Comics, where the two universes collided, resulting in mash-up versions of your favorite characters (ie, Darkclaw, a mash-up of Batman and Wolverine).\n\nAll of that goes back and forth. It seems like, ever since Crisis, when one company is at a creative high the other is at a creative ebb. The dynamic seems to continue today, as DC Comics struggles to figure out a direction, rebooting (hard and soft) its universe again and again while chasing and then abandoning new, younger and less traditional audiences. Marvel, meanwhile, seems to have effortlessly tapped into the zeitgeist and has brought a whole new fanbase to the world of comic book superheroes. I'm sure that will eventually flip, and we'll all be bemoaning the state of Marvel while rallying around DC's iconic heroes, but at the moment, as DC enters a \"Rebirth\" intended to mitigate the damage of its most recent reboot, it's hard to see that future.\n\nMeanwhile, the rivalry has come off the page. DC, long owned by Time Warner, has always had a head start at the movies. Ignoring old serials and silly cartoons and live action kiddie shows, Richard Donner's Superman set the stage for what superhero movies would be. Its first half, an earnest examination of both the sciif and human elements of the Man of Steel, truly informed how superhero movie adaptations worked. Then came Tim Burton's Batman, which also sent shock waves through the pop culture. All the while Marvel was hanging back, coming from a position of weakness. They didn't have a studio, and they had sold off most of their properties to all different production companies. There were endless rumors about a possible Spider-Man movie, and Stan in his Bullpen Bulletins talked about casting Danny DeVito as Wolverine (seriously), but it was the DC characters who ruled the screen.\n\nThen came the X-Men. While DC had ruled screens for almost a decade, they truly flamed out in 1997 with the one-two punch of Steel and Batman and Robin. Shit was looking grim. And then in 2000 Bryan Singer, a promising young director, brought Marvel's mighty mutants to the screen and opened the floodgates. Spider-Man came next, and all bets were off - while X-Men had done well, Spider-Man was a mega-hit. The superhero renaissance was on.\n\nDC took an early lead. Christopher Nolan's reboot of Batman scored with Batman Begins but went absolutely next level with The Dark Knight. DC was doing Oscar-worthy stuff with their properties, and meanwhile the newbie Marvel Studios was bringing their C-list characters to screens. A couple of months before The Dark Knight came out Iron Man hit, a movie that did really well - far, far better than anyone had expected, in fact - but was crushed in all other aspects by The Dark Knight, which earned two hundred million more dollars domestically and which won Heath Ledger a posthumous Oscar.\n\nBut The Dark Knight would be DC's onscreen high point. Marvel Studios had a plan, and it was one that didn't seem feasible when announced - all of their B and C-list characters (seriously, Captain America was getting a movie?) would join forces in a big team-up film to be called The Avengers. They were rolling the dice that these individual films would work enough to make that big movie worth it. And it wasn't clear it would work out - The Incredible Hulk, released after Iron Man, stumbled.\n\nHere's the thing: it was the Silver Age all over again. DC had led the way, but Marvel subverted everything. Nolan demanded his Batman be alone in the universe. There would be no Superman or Justice League. Nolan's attitude may have been more highbrow than DC's Silver Age editors, but it was no less stentorian. Meanwhile Marvel was doing what Marvel had done from the start - the created a world where their characters all lived side-by-side (DC's heroes met as part of the Justice League but each patroled their own individual made-up city) and where things could be loose and fun. Nolan's Bat films were less silly than DC's Silver Age books, but they were no less straight laced. Marvel's films, with their humor and relatable characters, felt fresher and more fun.\n\nThe movie situation sort of played out like the Silver Age Comics situation - the smaller company did something new and found success, slowly growing to eclipse the bigger, more established company. In the 60s and 70s Marvel's cast of colorful characters flowed into the world of Pop Art and became beloved of the freewheeling youth, while DC's stodgy defenders of the status quo represented outdated American ideals. As Marvel Studios grew in size and popularity their films, like the new wave of Marvel Comics energized by them, clearly began to speak to new audiences - younger, hipper, less traditional, more likely to be female or queer. The DC movies have become more masculinized, more overblown, full of more sturm und drang. Where the Marvel films nimbly pivot between humor and pathos, the DC films stomp forward in an aggressive blitzkrieg.\n\nWhich leads us to today. The rivalry has never been hotter, although it exists almost entirely outside of the comic book store. Sure, DC has chased Marvel in the comics recently (see the DC You initiative), but the comic book world is an increasingly insular one. The real action is at the box office, and on the internet. When Captain America: Civil War opens in the US this week it will be the latest blow in a competition that has seen two mega studios vying for release dates and talent, that has become somehow central to our pop consciousness. Twenty years ago your average person couldn't tell you which character was Marvel and which was DC, but today those lines of demarcation are clear for most general audiences. They understand what Batman v Superman is, and they understand what Civil War is.\n\nWhat's crazy is how directly BvS and Civil War are related. They are, in many ways, the same movie. Thematically, conceptually and even in terms of expanding their respective universes, each film is trying similar things. And yet they couldn't be more different, and I mean that not only in terms of approach but also of quality. My friend - and confirmed DC Comics fanboy - Jordan Hoffman put it best in a recent piece in The Guardian:\n\nWe have reached a point where it must be put it in the most blunt, playground-ready of terms: Marvel films can beat up DC films.\n\nThere's no question that we're in the Marvel Age of movies, but looking back at the history of the two companies reminds us that these things change. Marvel seemed unbeatable in the mid-80s, but for my money DC was producing some of the best, smartest and freshest stuff in the 90s while Marvel went chasing an X-Treme trail of tears. At one point Marvel wasn't even playing the movie game, and DC was setting the standard for superhero cinema. Even today there are places where the balance shifts - DC's broadcast TV shows are far superior to the stuff Marvel is passing off on ABC.\n\nStill, if there's going to be a change, it's not happening any time soon. Phase Three shows Marvel Studios in a position of peak creativity and confidence, while Warner Bros continues to struggle in the aftermath of Batman v Superman, which is the worst kind of success - a middling one almost nobody liked.\n\nIn the meantime: how about Marvel Studios and DC Films get together and schedule a softball game?", "images": ["https://birthmoviesdeath.com/assets/img/ui/loader-500x281.gif", "https://birthmoviesdeath.com/assets/img/ui/bmd-logo-footer.png", "https://birthmoviesdeath.com/assets/img/ui/bmd-logo-tall.png", "https://s3.birthmoviesdeath.com/images/made/photo_6_200_200_81_s_c1.jpg", "https://birthmoviesdeath.com/assets/img/ui/bmd-logo-small-new.png", "https://s3.birthmoviesdeath.com/images/made/Marvel-vs-DC-Wallpaper_1050_591_81_s_c1.jpg"], "top_img": "https://s3.birthmoviesdeath.com/images/made/Marvel-vs-DC-Wallpaper_1050_591_81_s_c1.jpg", "keywords": [], "authors": ["Devin Faraci", "Jm Mutore", "Scott Wampler"], "canonical_link": "https://birthmoviesdeath.com/2016/05/03/marvel-v-dc-dawn-of-rivalry", "title": "Marvel v DC: Dawn of Rivalry", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "A look at five decades of competition.", "author": "Devin Faraci", "news_keywords": "dc comics, dc films, marvel comics, marvel studios", "twitter": {"card": "summary_large_image", "url": "https://birthmoviesdeath.com/2016/05/03/marvel-v-dc-dawn-of-rivalry", "site": "@bmoviesd", "title": "Marvel v DC: Dawn of Rivalry", "description": "A look at five decades of competition.", "creator": "@bmoviesd", "image": {"src": "https://s3.birthmoviesdeath.com/images/made/Marvel-vs-DC-Wallpaper_1050_591_81_s_c1.jpg"}}, "og": {"title": "Marvel v DC: Dawn of Rivalry", "type": "article", "url": "https://birthmoviesdeath.com/2016/05/03/marvel-v-dc-dawn-of-rivalry", "image": "https://s3.birthmoviesdeath.com/images/made/Marvel-vs-DC-Wallpaper_1050_591_81_s_c1.jpg", "description": "A look at five decades of competition.", "site_name": "Birth.Movies.Death."}, "article": {"publisher": "https://facebook.com/birthmoviesdeath", "tag": "Marvel Studios", "section": "The Devin's Advocate", "published_time": "2016-05-03T13:38:00-05:00", "modified_time": "2016-05-03T14:14:45-05:00"}, "fb": {"app_id": 851495914925867, "pages": 123392074385324}, "apple-mobile-web-app-title": "B.M.D.", "application-name": "Birth.Movies.Death.", "msapplication-TileColor": "#000000", "msapplication-TileImage": "https://birthmoviesdeath.com/assets/img/favicons/mstile-144x144.png?v=E6vLOx77wd", "msapplication-config": "https://birthmoviesdeath.com/assets/img/favicons/browserconfig.xml?v=E6vLOx77wd", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1462204800.0, "source": "https://birthmoviesdeath.com", "summary": ""}