{"url": "https://www.bustle.com/p/e-true-hollywood-story-is-returning-to-tv-with-a-modern-twist-8958540", "text": "Who else spent a solid chunk of their formative years unearthing lesser-known tidbits about their favorite celebrities by way of E! True Hollywood Story? Fans of the original docu-series — which saw its heyday during the late-90s, early-2000s era — will probably be pretty pumped to learn that E! True Hollywood Story is coming back, per a recent announcement from the network revealing its current roster of forthcoming programming. On Tuesday, May 1, E! unveiled its plans for a revamp of the popular documentary-style syndicate in a statement, saying,\n\nE! True Hollywood Story will return with a fresh approach and new episodes that dive deep into the most compelling personalities and stories that are shaping headlines.\n\nWhile E! hasn't released too many details regarding the specifics of its upcoming True Hollywood Story revamp, if its Tuesday statement is any indication, it certainly looks like the reboot series has some serious nostalgia in store for fans of the original show. That being said, per the network's recent statement, E! True Hollywood Story also seems poised to tout some additional contemporary flair — an inevitable byproduct, it would seem, of changing tides in Hollywood, as well as pop culture at large.\n\nSpeaking to that point, Amy Introcaso-Davis, the Executive VP of production and development over at E!, called E! True Hollywood Story \"a beloved franchise that has never been more timely and relevant\" in the network's recent statement about its upcoming programming slate. While Introcaso-Davis didn't elaborate on that particular comment, it's not too difficult to understand what she might have been getting at. Given the truth-telling trend that has cropped up across the film and television industry over the last eight months or so (largely in conjunction with the rise of the Time's Up movement), it seems like there's arguably no better time to revive a franchise whose original M.O. aimed to provide viewers with the \"inside scoop\" as to what's really going on in Hollywood.\n\nJust in case anyone out there needs a little brush-up on their THS knowledge, here's a quick history lesson: E! True Hollywood Story kicked off its original run in early 1996 with an hour-long documentary-style episode that delved into the infamous murder of actress and model Rebecca Schaeffer. The show was originally billed for a series of periodic tv specials, though it was quickly picked up as a regular weekly series.\n\nThroughout its proximate near-decade run, E! True Hollywood Story covered a whole host of celebrity-centric topics, including industry scandals, notorious Hollywood mysteries, and \"Where are they now?\" pieces examining the current lives of former child stars. (Anyone else remember that heartbreaking Macaulay Culkin episode?) Besides Culkin, the original series' biopic-like episodes explored the so-called \"behind-the-scenes\" lives of a roster of the era's A-list Hollywood luminaries, including Lindsay Lohan, Drew Barrymore, and Britney Spears, among many, many others.\n\nIn its Tuesday statement, the network offered a glimpse (albeit, in pretty broad strokes) into what a revamped episode of True Hollywood Story might look like. Because, while the upcoming revamped series sounds like its going to operate under the same general parameters as the original, E!'s statement said that the new series will be taking a \"modern approach\" to its narratives — a conceivable attempt to do what the network described in its statement as \"providing a voice to the moments that are reshaping popular culture.\"\n\nExpanding on that idea a bit, the network also offered a slightly more robust explanation as to how True Hollywood Story's newly-minted episodic structure is going to work, saying,\n\nEach self-contained documentary will explore a topic, headline, or person that became the ground zero for a revolution, change or shift in culture, told by the people who were on the front lines of the story.\n\nAt this point, it's difficult to theorize about which buzzing Hollywood-centric topics the upcoming E! True Hollywood Stories revamp will choose to focus on, especially considering the vast scope of potential avenues to pursue. That being said, if the updated docu-series is anything like the original, it certainly seems poised to gift eager viewers with the pop cultural intel they've been craving since 2015 — at least.", "images": ["https://imgix.bustle.com/uploads/image/2020/4/8/630a9d05-b742-4adb-82c5-030cd815d6dc-fh_101_02597r1.JPG?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/12/a050599c-0f91-449c-a680-e88ed10034ae-getty-1202992300.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2018/5/1/0e1e2f9e-7957-4dd4-a7c0-67bba3e47510-screen-shot-2018-05-01-at-35418-pm.png?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/5/1/0e1e2f9e-7957-4dd4-a7c0-67bba3e47510-screen-shot-2018-05-01-at-35418-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/14/2956127a-2dc3-49d5-9022-8e866922d0bb-getty-833926804.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/3/30/03f83cfa-f58a-46f3-9458-f89e3a878b8b-getty-1211408233.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/5/1/0e1e2f9e-7957-4dd4-a7c0-67bba3e47510-screen-shot-2018-05-01-at-35418-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/e-true-hollywood-story-is-returning-to-tv-with-a-modern-twist-8958540", "title": "'E! True Hollywood Story' Is Returning To TV With A Modern Twist", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/e-true-hollywood-story-is-returning-to-tv-with-a-modern-twist-8958540", "type": "article", "title": "'E! True Hollywood Story' Is Returning To TV With A Modern Twist", "description": "Who else spent a solid chunk of their formative years unearthing lesser-known tidbits about their favorite celebrities by way of E! True Hollywood Story? Fans of the original docu-series — which saw its heyday during the late-90s, early-2000s era —…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/5/1/0e1e2f9e-7957-4dd4-a7c0-67bba3e47510-screen-shot-2018-05-01-at-35418-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Who else spent a solid chunk of their formative years unearthing lesser-known tidbits about their favorite celebrities by way of E! True Hollywood Story? Fans of the original docu-series — which saw its heyday during the late-90s, early-2000s era —…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}