{"url": "http://americanidol.wikia.com/wiki/Season_3", "text": "The third season ofpremiered on January 19, 2004 and continued until May 26, 2004. The third season was won by Fantasia Barrino , who defeated Diana DeGarmo by an approximate margin of 2% (1.3 million votes); the vote total (65 million votes) was the highest recorded vote total in the show's history until the May 23, 2007 finale of American Idol 6. This season also featured Academy Award-winning actress and Grammy Award-winning singer Jennifer Hudson\n\nThe third season is the only season where both the winner and the runner-up ended up in the bottom 2 or 3 prior to the finale. It is the first season to have a finale with two female contestants(season 12 is the second) while the second, seventh, and eighth seasons had a finale with two male contestants.\n\nContents show]\n\nAuditions Edit\n\nAuditions were held in New York, Los Angeles, San Francisco, Houston, Atlanta, and Honolulu.\n\nThe early part of the season became well-known for the introduction of William Hung, a University of California, Berkeley student, who became popular following his rendition of Ricky Martin's \"She Bangs\". His performance as well as his attitude facing judge Simon Cowell's criticisms (which was a stark contrast to other contestants' confrontational, angry reactions) made him instantly popular, and landed him a record deal with Koch Records.\n\nDuring the audition round in Houston, Texas, auditioner Jonathan Rey threw a cup of water at Simon, who moments earlier commented that he was terrible and \"there's not a song in the world you could sing.\" Security quickly escorted Jonathan out, and Houston police questioned him, but released him after Simon decided against pressing assault charges on him. The entire incident was caught on tape and was broadcast.\n\nHollywood rounds contestant Taryn Southern later appeared on the Project My World series and wrote and performed the 2007 \"Hott4Hill\" viral video.\n\nHollywood Edit\n\nThere were 117 contestants in the first Hollywood round which was held at the Pasadena Civic Center in Pasadena, California. The contestants first came onto the stage in groups but each performed solo and talked briefly about themselves. Simon Cowell was not impressed with their performances. They were also asked to write original lyrics and melody for one of ten song titles given and perform their song the next day. After their performance, they were divided into four groups and one groups is eliminated. In the next round, the remaining 87 contestants performed in groups in three. The girls and boys were separate and they were each given 3 different songs to choose - Girls with The Supremes' You Can't Hurry Love, Vonda Shepard's \"Tell Him\", Candi Staton's Young Hearts Run Free, the boys with Billy Joel's Tell Her About It, Rick Astley's Never Gonna Give You Up, The Drifters's Up on the Roof. 30 contestants were cut and 57 then advanced to the next stage where they performed solo. The contestants were then divided into 3 group and placed in separate rooms, with one group sent home. 32 contestants remained for the semi-finals. Hollywood rounds contestant Taryn Southern later appeared on the Project My World series and wrote and performed the 2007 \"Hott4Hill\" viral video.\n\nThe contestants who reached this stage were referred to in the show as the Top 32 finalists. This is the first time that two contestants who previously tried out for American Idol (Matthew Metzger and Lisa Leuschner) made it to the top 3 of their semifinals group. Both contestants were eliminated during Hollywood round in the previous season. George Huff replaced Donnie Williams in Semifinal Round 4 after Williams was disqualified following a DUI arrest. Unlike previous seasons, this season the contestants performed in front of a small studio audience, with orchestra accompaniment on backing tape. As with the second season, in these rounds, two from each group were selected by public vote to proceed on to the Top 12, and those who failed at any of the previous stages were given a second chance in the wild-card show.\n\nWild Card Round Edit\n\nAfter 8 singers advanced on to the Top 12, eight contestants were chosen by the judges to compete in the Wild Card Round. The eight competing were Jennifer Hudson, George Huff, Leah LaBelle, Elizabeth LeTendre, Jon Peter Lewis, Matthew Metzger, Suzy Vulaca & Katie Webber. In the end the Judges chose, Hudson, Huff and LaBelle to continue on in the competition as of Lewis was chosen by public vote.\n\nTop 12 Edit\n\nThe following contestants were Season 3's Top 12\n\nFinals Edit\n\nTop 12 perform Edit\n\nDuring the first round of the finals, the Top 12 performed a Soul song for a spot in the Top 11.\n\nEliminated Contestant Edit\n\nLeah LaBelle was the first contestant to be eliminated on March 17, 2004 bringing the total down to 11 remaining contestants.\n\nTop 11 Edit\n\nThe following contestants were safe from that round and advanced on to the Top 11.\n\nPerformances Edit\n\nThe contestants performed in the following order:\n\nGroup Performance:\n\nSoul Medley\n\nTop 11 perform Edit\n\nDuring the first round of the finals, the Top 10 performed a Country song for a spot in the Top 10.\n\nEliminated Contestant Edit\n\nMatthew Rogers was the second contestant to be eliminated on March 24, 2004 bringing the total down to 10 remaining contestants.\n\nTop 10 Edit\n\nThe following contestants were safe from that round and advanced on to the Top 10.\n\nPerformances Edit\n\nThe contestants performed in the following order:\n\nTop 10 perform Edit\n\nDuring this round of the finals, the Top 10 performed a song from the Motor City for a spot in the Top 9.\n\nEliminated Contestant Edit\n\nAmy Adams was the eliminated contestant on March 31, 2004, bringing the total down to 9 remaining contestants.\n\nTop 9 Edit\n\nThe following contestants were safe from that round and advanced on to the Top 9.\n\nPerformances Edit\n\nGroup Performance:\n\n\"Ain't No Mountain High Enough\" by Marvin Gaye and Tammi Terrell\n\nTop 9 perform Edit\n\nDuring this round of the finals, the Top 9 performed a song from Elton John for a spot in the Top 8.\n\nEliminated Contestant Edit\n\nCamile Velasco was the eliminated contestant on April 7, 2004, bringing the total down to 8 remaining contestants.\n\nTop 8 Edit\n\nThe following contestants were safe from that round and advanced on to the Top 8.\n\nPerformances Edit\n\nThe contestants performed in the following order:\n\nGroup Performance:\n\nBoys - \"Daniel\"\n\nGirls - \"Bennie and the Jets\"\n\nGroup - \"Saturday Night's Alright for Fighting\"\n\nTop 8 perform Edit\n\nDuring this round of the finals, the Top 8 performed a song from a soundtrack of a movie for a spot in the Top 7.\n\nEliminated Contestant Edit\n\nJon Peter Lewis was the eliminated contestant on April 15, 2004, bringing the total down to 7 remaining contestants.\n\nTop 7 Edit\n\nThe following contestants were safe from that round and advanced on to the Top 7.\n\nPerformances Edit\n\nThe contestants performed in the following order:\n\nTop 7 perform Edit\n\nDuring this round of the finals, the Top 7 performed a song from Barry Manilow for a spot in the Top 6.\n\nEliminated Contestant Edit\n\nJennifer Hudson was the eliminated contestant on April 21, 2004, bringing the total down to 6 remaining contestants.\n\nTop 6 Edit\n\nThe following contestants were safe from that round and advanced on to the Top 6.\n\nPerformances Edit\n\nThe contestants performed in the following order:\n\nGroup Performance:\n\nGroup feat. Barry Manilow - \"Let Freedom Ring\"\n\nTop 6 perform Edit\n\nDuring this round of the finals, the Top 6 performed a song from Gloria Estefan for a spot in the Top 5.\n\nEliminated Contestant Edit\n\nJohn Stevens was the eliminated contestant on April 28, 2004, bringing the total down to 5 remaining contestants.\n\nTop 5 Edit\n\nThe following contestants were safe from that round and advanced on to the Top 5.\n\nPerformances Edit\n\nThe contestants performed in the following order:\n\nGroup Performance:\n\nGloria Estefan medley\n\nTop 5 perform Edit\n\nDuring this round of the Finals, each contestant will perform two songs from big bands for a spot in the Top 4.\n\nEliminated Contestant Edit\n\nGeorge Huff was the eliminated contestant on May 5, 2004, bringing the total down to 4 remaining contestants.\n\nTop 4 Edit\n\nThe following contestants were safe from that round and advanced on to the Top 4.\n\nPerformances Edit\n\nThe contestants performed in the following order:\n\nDiana DeGarmo - \"Someone to Watch Over Me\" by Gertrude Lawrence, \"Get Happy\" by Ruth Etting\n\nGeorge Huff - \"Cheek to Cheek\" by Fred Astaire, \"What a Wonderful World\" by Louis Armstrong\n\nLaToya London - \"Too Close for Comfort\" by Eydie Gormé, \"Don't Rain on My Parade\" by Barbra Streisand\n\nJasmine Trias - \"The Way You Look Tonight\" by Fred Astaire, \"Almost Like Being in Love\" by Nat King Cole\n\nFantasia Barrino - \"Crazy Little Thing Called Love\" by Queen, \"What Are You Doing the Rest of Your Life? by Julie Andrews\n\nTop 4 perform Edit\n\nDuring this round of the finals, each contestant will perform a two disco songs for a spot in the Top 3.\n\nEliminated Contestant Edit\n\nLaToya London was the eliminated contestant on May 12, 2004, bringing the total down to 3 remaining contestants.\n\nTop 3 Edit\n\nThe following contestants were safe from that round and advanced on to the Top 3.\n\nPerformances Edit\n\nThe contestants performed in the following order:\n\nGroup Performance:\n\n\"Bad Girls\"/\"Hot Stuff\"/\"Heaven Knows\"/\"She Works Hard for the Money\" by Donna Summer\n\nTop 3 perform Edit\n\nDuring this round of the finals, the Top 3 performed a song of their choice, a song picked by the judges and a song picked by Clive Davis for a spot in the Top 2.\n\nEliminated Contestant Edit\n\nJasmine Trias was the eliminated contestant on May 19, 2004, bringing the total down to 2 remaining contestants.\n\nTop 2 Edit\n\nThe following contestants were safe from that round and advanced on to the Top 2.\n\nPerformances Edit\n\n(The first round of performances was the contestant's choice, the second round were chosen by the judges and the final round was chosen by Clive Davis). The contestants performed in the following order:\n\nTop 2 perform Edit\n\nDuring the final round of the finals, the Top 2 performed their first winning single and two of their previous songs from the past round for a spot as Season 4's American Idol.\n\nDiana DeGarmo was the runner-up of Season 3. Fantasia Barrino being the winner.\n\nPerformances Edit\n\nThe contestants performed in the following order:\n\nWinner Edit\n\nFantasia Barrino was the winner of American Idol Season 3 on May 26, 2004.\n\nResults Performances Edit\n\nNotable past Idol contestants Edit\n\nJon Peter Lewis, who finished in 8th place, later auditioned for season 4 of the NBC show The Voice in 2013 as part of the duo Midas Whale with Maroon 5 lead singer Adam Levine as their mentor. The duo were eliminated in the Knockout Rounds.\n\nControversy Edit\n\nWild card eliminations Edit\n\nViewers raised many complaints when, during the semifinal Wild Card round, 4 of the contestants were eliminated on the spot without being given a chance to sing, leaving only eight out of 12 contestants fighting for a chance to earn a spot in the top 12 that season. Singer Marque Lynche, brother of season 9 finalist Michael Lynche, walked out after being eliminated while the other 3 stayed behind.\n\non", "images": ["https://vignette.wikia.nocookie.net/american-idol/images/b/ba/S3finalists8.PNG/revision/latest/scale-to-width-down/100?cb=20130420231234", "https://vignette.wikia.nocookie.net/hildatheseries/images/0/01/Community-Page-Header.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20190914140704", "https://vignette.wikia.nocookie.net/american-idol/images/2/27/Amlogo.png/revision/latest?cb=20090304233827", "https://vignette.wikia.nocookie.net/101dalmatianstreet/images/0/0e/Community-header-background/revision/latest/zoom-crop/width/100/height/56?cb=20200106151802", "https://vignette.wikia.nocookie.net/american-idol/images/1/15/S3finalists12.PNG/revision/latest/scale-to-width-down/100?cb=20130420231131", "https://vignette.wikia.nocookie.net/american-idol/images/8/89/Wiki-wordmark.png/revision/latest?cb=20200111053739", "https://vignette.wikia.nocookie.net/american-idol/images/e/e6/S3finalists10.PNG/revision/latest/scale-to-width-down/100?cb=20130420231158", "https://vignette.wikia.nocookie.net/american-idol/images/a/ae/S3finalists4.PNG/revision/latest/scale-to-width-down/100?cb=20130420231644", "https://vignette.wikia.nocookie.net/american-idol/images/4/46/S3finalists6.PNG/revision/latest/scale-to-width-down/100?cb=20130420231326", "https://vignette.wikia.nocookie.net/american-idol/images/5/50/S3finalists3.PNG/revision/latest/scale-to-width-down/100?cb=20130420231708", "https://vignette.wikia.nocookie.net/wubbzy/images/7/7e/Me_and_My_Friends_-_128.png/revision/latest/zoom-crop/width/100/height/56?cb=20180423181936", "https://slot1-images.wikia.nocookie.net/__cb1586975593232/common/extensions/wikia/WikiaBar/images/wikiabarIcon.png", "https://vignette.wikia.nocookie.net/american-idol/images/2/23/S3finalists9.PNG/revision/latest/scale-to-width-down/100?cb=20130420231219", "https://vignette.wikia.nocookie.net/american-idol/images/f/f5/S3finalists2.PNG/revision/latest/scale-to-width-down/100?cb=20130420231739", "https://vignette.wikia.nocookie.net/american-idol/images/0/00/S3_finalists.JPG/revision/latest/scale-to-width-down/240?cb=20130414052332", "https://vignette.wikia.nocookie.net/american-idol/images/0/06/S3finalists7.PNG/revision/latest/scale-to-width-down/100?cb=20130420231249", "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D", "https://vignette.wikia.nocookie.net/american-idol/images/c/c0/S3finalists11.PNG/revision/latest/scale-to-width-down/100?cb=20130420231146", "https://vignette.wikia.nocookie.net/american-idol/images/1/11/S3finalists.PNG/revision/latest/scale-to-width-down/100?cb=20130420231804", "https://vignette.wikia.nocookie.net/american-idol/images/6/65/S3finalists5.PNG/revision/latest/scale-to-width-down/100?cb=20130420231629"], "top_img": "https://vignette.wikia.nocookie.net/american-idol/images/2/27/Amlogo.png/revision/latest?cb=20090304233827", "keywords": [], "authors": [], "canonical_link": "https://americanidol.fandom.com/wiki/Season_3", "title": "Season 3", "meta_data": {"viewport": "width=device-width, user-scalable=yes", "generator": "MediaWiki 1.19.24", "keywords": "American Idol Wiki,american idol,Season 3,I Believe,Simon Cowell,Randy Jackson,Paula Abdul,Ryan Seacrest,Season 2,Season 1,Season 4,Season 5,Season 6", "description": "American Idol Season 3 Winner Fantasia Barrino Coronation Song I Believe Created by Simon Fuller Directed by Bruce Gowers Ken Warwick Judges Simon Cowell Paula Abdul Randy Jackson Host Ryan Seacrest Country of Origin United States Channel Fox Held from January 19, 2004 – May 26, 2004 Previous...", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://americanidol.fandom.com/wiki/Season_3", "title": "Season 3 | American Idol Wiki | Fandom", "description": "American Idol Season 3 Winner Fantasia Barrino Coronation Song I Believe Created by Simon Fuller Directed by Bruce Gowers Ken Warwick Judges Simon Cowell Paula Abdul Randy Jackson Host Ryan..."}, "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "American Idol Wiki", "title": "Season 3", "description": "American Idol Season 3 Winner Fantasia Barrino Coronation Song I Believe Created by Simon Fuller Directed by Bruce Gowers Ken Warwick Judges Simon Cowell Paula Abdul Randy Jackson Host Ryan Seacrest Country of Origin United States Channel Fox Held from January 19, 2004 – May 26, 2004 Previous Season Season 2 Next Season Season 4 The third season of American Idol premiered on January 19, 2004 and continued until May 26, 2004. The third season was won by Fantasia Barrino, who defeated Diana...", "url": "https://americanidol.fandom.com/wiki/Season_3", "image": "https://vignette.wikia.nocookie.net/american-idol/images/2/27/Amlogo.png/revision/latest?cb=20090304233827"}, "apple-itunes-app": "app-id=422467074, app-arguments=https://americanidol.fandom.com/wiki/Season_3"}, "movies": [], "publish_date": null, "source": "http://americanidol.wikia.com", "summary": ""}