{"url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DisposingOfABody", "text": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DisposingOfABody\n\nRobert Boyd, Very Bad Things \"Take away the horror of the situation. Take away the tragedy of her death. Take away all the moral and ethical considerations you've had drummed into you since childhood, and what are you left with? A 105 lb. problem.\"\n\nAdvertisement:\n\nFollowing a death, either accidental or deliberate, no matter how skilfully the responsible party covers it up, there remains the problem of disposing of the most obvious and most damning piece of evidence for the crime: the body itself. (There have been jurisdictions where no corpse means no murder.)\n\nA well-designed Death Trap may include it's own way to eliminate the victim's corpse, thus combining the two tropes.\n\nThere are numerous popular methods for doing this:\n\nA common way to indicate that a bad guy is not to be messed with is if they have an original and well-thought-through method in place to entirely obliterate a human body if needed. This indicates either that they're Crazy-Prepared, or that it's something they frequently find themselves having to do.\n\nAdvertisement:\n\nPretty much any action movie with a significant body count won't even bother with this trope; the exception is if it's supposed to be taking place under The Masquerade, in which case The Men in Black may send in a Cleanup Crew to do the job.\n\nSee Bury Me Not on the Lone Prairie, in which any post-mortem hijinks are the direct request of the deceased, and Of Corpse He's Alive, when someone tries to pretend a dead body... isn't.\n\nContrast Dead Guy on Display, when the body is deliberately put somewhere it will be seen, often to send a message to the person who finds it.\n\nThis is a Death Trope; spoilers ahoy.\n\nExamples:\n\nopen/close all folders\n\nAdvertising\n\nA Doritos ad has a man see his dog burying something, which he quickly recognizes as the family cat's collar. Then the dog is up in his face, growling, and pushes a bag of Doritos with a note reading \"You didn't see nuthin\" towards him. At the end of the ad, we hear the man's wife asking \"Have you seen the cat?\"; the man looks up and sees the dog, outside the door, another bag of Doritos in his mouth.\n\nAnime and Manga\n\nComic Books\n\nThe EC Comics story \"Cold Cuts.\" Likewise in \"...And All Through the House\" wherein the matter is somewhat more pressing, due to the presence of a Serial Killer outside the house who our matricidal \"heroine\" can't simply call the police about.\n\nThe \"Kitchen Irish\" arc in Garth Ennis' The Punisher MAX has an old guy who used to do this for the old Irish mob - his method being cutting the body into lots and lots of little pieces. For example, he points out the importance of covering the entire work area with trash bags prior to cutting - as well as doing it naked so as not to catch evidence in one's clothing.\n\nIn both the comic and the film version of the Sin City story \"The Big Fat Kill,\" after Dwight and the girls of Old Town learn that the abusive scumbag that they just killed was a hero cop , they set about disposing of him and his buddies by having Dwight dump them into the Santa Yolanda Tar Pits. Things... don't go to plan.\n\n, they set about disposing of him and his buddies by having Dwight dump them into the Santa Yolanda Tar Pits. Things... don't go to plan. Transmetropolitan: When Spider Jerusalem realizes that he's inspired The Smiler to murderous rage, he acquires Nanomachines designed to break human tissues and clothing down to monoatomic vapor, knowing he'll have to kill more than a few CIA assassins. Parodied in a one-shot Sinister Dexter strip. The duo disposes of the bodies of their kills in one place so many times that they're visibly piling up. They note that they need to find somewhere new.\n\nFan Fiction\n\nCamp Nightmare turns this Up to Eleven: the staff bathroom houses dozens of child bodies.\n\nIn Black Queen, Red King, the Earth Changelings eat their kin's dead bodies and those of the humans they kill in order to keep the police and other humans from finding them. The main character also eats his own severed arm to keep it from being found. note And because he needed the nutrients.\n\nIn the Harry Potter fanfic \"Bolts From The Blue'' after seeing the end result of a werewolf attack on the several Hogwarts students. Madame Bones and Head Auror Rufus Scrimigeor decide that in anyone from the Ministry was responsible for the bloodshed they would personally help Harry Potter dispose of the bodies of the perpetrators.\n\nFilms — Animated\n\nThe Simpsons Movie has a gag where dumping in Lake Springfield was prohibited just as Fat Tony and his goons were about to dump a bag with a dead body inside into it. Fat Tony: Very well, I shall put my yard trimmings in a car compactor. Lou: Chief, I think there was a dead body in there. Chief Wiggum: I thought so too until he said \"yard trimmings\". You gotta learn to listen, Lou.\n\nFilms — Live-Action\n\nLiterature\n\nLive-Action TV\n\nMusic\n\n\"Dead Body Disposal\" by Necro gives various advice on how to dispose of a body and make it harder to find.\n\nThe Dixie Chicks \"Goodbye Earl\" uses a tarp and a remote, rural lake to get rid of Wanda's abusive ex-husband.\n\nThe music video for \"Lay It Down (Saturday Night)\" by Samantha Fish features Fish in the woods, digging a grave for the body of a man who tried to cheat her in a poker game.\n\n\"Arthur, où t'as mis le corps ?\" (\"Arthur, where didja put the body ?\"), written by Boris Vian and sung by Serge Reggiani, starts off like this: a band of thug murder an antiquarian to steal his stock. One of them, Arthur, is tasked with disposing of the body. Problem is, he can't manage to remember what he's done of it.\n\nGrupa Operacyjna: \"Pomocy\" has Mieszko considering getting rid of his ex-patient by throwing her out a window, but decides against it as she wouldn't fit in it.\n\nPinball\n\nIn Stern Pinball's The Sopranos, shooting the ball up the Meadowlands lane is required to get rid of dead bodies.\n\nRadio\n\nOur Miss Brooks: In the penultimate radio episode, \"New Girl in Town,\" Harriet Conklin tricks the eponymous \"new girl's\" mother into believing Mr. Boynton and Miss Brooks are burying Mr. Boynton's old girlfriends in the athletic field. In reality, Mr. Boynton and Miss Brooks are only burying the bodies of Mr. Boynton's dead lab mice.\n\nIn the Suspense episode \"The Pasteboard Box,\" a man murders his twin brother and dismembers the body to dispose of it more easily, but just can't get rid of the pasteboard box containing the head.\n\nTabletop Games\n\nDelta Green operations will usually leave bodies behind, and often it's better getting rid of them than explaining to the authorities. The \"Tradecraft\" chapter on the Agent's Handbook rulebook has a quick guide on the rules for different methods of getting rid out of of bodies, from dissolving in a polypropylene barrel to dumping the body into the water.\n\nVideo Games\n\nVisual Novels\n\nIn Dayshift at Freddy's, this is one of your tasks in the first game's Purple Guy route.\n\nIn the case of the Urashima Woman from Spirit Hunter: NG, her swollen stomach was filled with rocks to weigh her down, then she was stuffed into a suitcase and thrown into the Urashima Lake. The killer disposed of dead fetuses in the same lake, which went on to haunt the place just like the Urashima Woman herself.\n\nWebcomics\n\nWestern Animation\n\nThis has happened enough times on Archer that \"I shall fetch a rug\" has become a Running Gag. \"Training Day\" had Archer and Cyril planning to bury a dead hooker ( who was just paralyzed ) after smuggling her body out in a rug. \"Killing Utne\" had Malory taking care of a dead UN official and his high-class call girl companion by breaking into her hated neighbor's apartment, staging the scene to look like a murder-suicide, then burning the bodies. Probably reached its peak with \"Lo Scandalo\", in which Mallory ropes in Archer, Lana, and Dr. Krieger to help her dispose of the body of the Italian Prime Minister, who's been assassinated in her apartment. Krieger's solution is to hack the body up in a bathtub and use the rest of the agents to dispose of the pieces in separate trashcans spread out across the city. In the end, we're left wondering whether it was actually Mallory who killed him.\n\nOne episode of Family Guy had Lois attempting to dump a body in the river in order to protect her son Chris (who she thought killed the man, but in reality, he didn't). Things got complicated when a policeman came by, but Stewie handled the situation by sliding himself into the collar of the man's shirt and acting like it was his body.\n\nSpongeBob SquarePants, \"The Nasty Patty\": Spongebob and Mr. Krabs think they killed the health inspector (he's just unconscious) and try to dispose of the \"body\". Burying doesn't work because of the rain (underwater, I know, just go with it), and two cops arrive on the scene to give them a ride back to the Krusty Krab, so they hide it in the trunk of the squad car and then hide it in the freezer (but not before Spongebob has to bring him through the front door, hidden under his hat, because the back door was locked). And then the cops ask for ice...\n\nRocko's Modern Life episode \"Ed is Dead: A Thriller\", in which Rocko thought he saw Bev Bighead murdering Ed Bighead (she was actually working on a sculpture of him and it fell over and broke), gave many Red Herrings on how she supposedly did this: first Rocko saw her throw a bag (actually containing her failed art project) into a hole shaped like Mr. Bighead (Ed gave her a shovel with a head molded in his likeness for their anniversary), then he saw her take a suitcase out of the house ala Rear Window (but was actually going to the dry cleaners with it), and finally Rock found what he at first thought was Mr. Bighead's preserved body in the basement (like in Psycho), but was actually the neighborhood mad dog that who proceeded to rip him apart.\n\nIn 1978 short Special Delivery, a mailman slips and dies on an icy porch. The panicked homeowner has to figure out how to get rid of the body.\n\nReal Life", "images": ["https://static.tvtropes.org/pmwiki/pub/external_link.gif", "https://static.tvtropes.org/images/logo-white-big.png", "https://static.tvtropes.org/pmwiki/pub/images/bodybagging.jpg", "https://static.tvtropes.org/img/howlandsc-side.jpg", "https://tvtropes.org/images/play-button-logo.png", "https://static.tvtropes.org/images/communityShowcase-echochamber.jpg", "https://static.tvtropes.org/img/tvtropes-footer-logo.png"], "top_img": "https://static.tvtropes.org/pmwiki/pub/images/bodybagging.jpg", "keywords": [], "authors": [], "canonical_link": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DisposingOfABody", "title": "Disposing of a Body", "meta_data": {"description": "The Disposing of a Body trope as used in popular culture. Following a death, either accidental or deliberate, no matter how skilfully the responsible party …", "twitter": {"card": "summary_large_image", "site": "@tvtropes", "owner": "@tvtropes", "title": "Disposing of a Body - TV Tropes", "description": "The Disposing of a Body trope as used in popular culture. Following a death, either accidental or deliberate, no matter how skilfully the responsible party …", "image": {"src": "https://static.tvtropes.org/pmwiki/pub/images/bodybagging.jpg"}}, "og": {"site_name": "TV Tropes", "locale": "en_US", "title": "Disposing of a Body - TV Tropes", "type": "website", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DisposingOfABody", "image": "https://static.tvtropes.org/pmwiki/pub/images/bodybagging.jpg", "description": "Following a death, either accidental or deliberate, no matter how skilfully the responsible party covers it up, there remains the problem of disposing of the most obvious and most damning piece of evidence for the crime: the body itself. (There …"}, "article": {"publisher": "https://www.facebook.com/tvtropes"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": null, "source": "https://tvtropes.org", "summary": ""}