{"url": "https://variety.com/2017/tv/news/scandal-season-6-finale-bellamy-young-interview-1202435074/", "text": "SPOILER ALERT: Do not read ahead if you have not watched the two-hour season finale episode of “Scandal,” which aired on Thursday, May 18.\n\nHail to the Chief: Madam President Mellie Grant has officially been sworn into office on “Scandal.” Though that historic moment was inevitable, there were plenty of shocking developments in Thursday night’s Season 6 finale, which will have a major impact on what happens in the seventh-and-final season of the Shonda Rhimes drama.\n\nWhat are those new developments? Well, for starters, Fitz (Tony Goldwyn) and Olivia (Kerry Washington) will head up a new — and improved? — B613. The person who had Frankie Vargas killed was actually his wife, a.k.a. the new vice president Luna Vargas (Tessie Santiago), leading Olivia and Jake (Scott Foley) to force her to kill herself. And Cyrus (Jeff Perry) might not have made the actual call to hire Frankie’s killer, but he’s the one who planted the seeds in Luna’s mind — and now he’s going to be the vice president.\n\nHere, Bellamy Young, who plays the new president, chats with Variety about the episode’s cliffhangers, Mellie’s new administration, and wrapping up “Scandal” with Season 7.\n\nDo you think it’s a little bit of wish fulfillment to have a female president on “Scandal”?\n\nWell, I cannot speak for Shonda or the writers’ minds, but I do think it’s important for us, as a country, to be able to have in our living room, get you through the idea of female leadership. We’re way behind the rest of the world in that regard. And definitely in terms of people who will be wonderful presidents, people who have earned it, I think Mellie is in line regardless of her gender. I think it’s all good storytelling.\n\nMellie has always vacillated between being really confident in her abilities and doubting everything. What’s her mindset as she’s going to start her presidency?\n\nI think this last chapter with Peus and Mystery Woman has really burned away any frivolity and really sealed her resolve. [Before their involvement], it was still a dream. She had unrealistic notions about being president. She just knew she wanted to be president, had trained all her life, thought she would be good at it and, of course, had watched Fitz. But whenever you’re not in the driver’s seat, you are not having an authentic experience. I think this new chapter we’re in with Mellie as president, she’s a whole different Mellie. I think a lot of her floating above her power has all gone away. I like to think she’s opened up and rooted down, and we’re really coming from a place of true strength. It’s Mellie, so I know she’ll make a lot of mistakes as well.\n\nHow much do you think Mellie will learn about Luna’s involvement in the conspiracy?\n\nIt’s inevitable that she’ll find out to some extent — not inevitable that she ever finds out that Olivia was at the bottom of it.\n\n“Scandal” has always been about who you can and can’t trust. Do you think that’s going to affect how Mellie approaches her new role?\n\nI think life has taught Mellie to be a pragmatist, but Mellie has a romantic heart. That’s where she stumbles. She has a very romantic idea of people, and they so often fail her. It will be really interesting to see, especially since Olivia has been set up to have so much power, both for the good in the White House and for dark with B613. I think it’s going to be very interesting to see Mellie grapple with that and find her true strength, true integrity, true voice in the midst of all that.\n\nHow will Mellie and Cyrus’ dynamic be as president and VP? Will Mellie be okay with Cyrus’ part in the assassination?\n\nI think inasmuch as Mellie is quite naïve to Olivia’s potential for darkness — she always sees Olivia as the moral barometer, the person you can ask the hard questions and she’ll always give you the honest answer — she is not at all naïve about who Cyrus is. You cannot trust him even as you’re looking him straight in the face. I think Mellie remains quite awake, on guard, and ready whenever she’s with Cyrus. There’s no greater partner in politics than Cyrus. She knows that he can lift you up to the absolute heavens, but she knows that he’ll tear you down in an instant. It’s making a deal with the devil, which has always been what our show’s been about.\n\nWas it bittersweet when you found out that Season 7 is going to be the final season?\n\nIt was heartbreaking. I wouldn’t even say bittersweet. Bittersweet in that we are so grateful to have another whole year to really bring this story to it’s resting point, to its landing point, because we’re all so interested to see where that is. It really would have killed us to have heard after we wrapped that season six had been our last season. That would have been really devastating. We’re really grateful to have this final year. It wasn’t an unexpected announcement by any measure, but it was still so hard to hear. Kerry was the amazing leader that she always is, and was really the only one of us that could muster eloquence in the moment. Rather than ask anything about “Where’s it going?” or “Why did you make this choice?” all we could think to do was love each other and thank Shonda and pledge to be a family forever. It really has been a journey of love.\n\nWhat’s something you would like to see Mellie accomplish in the final season?\n\nI really want to see her lose her self-doubt, come into her powers and her presidency. I think it’s of course important for her, but also important for our nation that she be a great leader. I think she realizes that. That the mission is bigger than her vanity. I’d also love her to get the chance to love and be loved in return. I think that would also heal a piece of her soul that is deeply wounded.\n\nDo you think Season 7 of “Scandal” will incorporate any of the headlines coming from real-life Washington D.C. every day?\n\nI don’t have any idea what they’re planning for season seven. We are never a part of those conversations, so I don’t know. All I can say is that I know scenes in season six changed completely, utterly, based on the change in the world after our American election. I have to think, we all live in the real world, and they’re writing in response to the situation at hand. They’re always, of course, taking our wonderful gladiators into consideration. They know what their day is like, and then they sit down and watch TV, and you want to be aware of the opportunity you have with a forum such as this political television show. What comment you’re making, what conversations you’re participating in, what editorial comments you might be making. With that being said, Shonda’s a once-in-a-generation storyteller. She’s always said she knows where these characters are going, and it would take something seismic to alter the essence of someone … Even if the world has changed how it’s going to [end], I have to trust that Shonda’s always known what is going to happen.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://pmcvariety.files.wordpress.com/2017/05/scandal-finale.jpg?w=1000", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2017%2Ftv%2Fnews%2Fscandal-season-6-finale-bellamy-young-interview-1202435074%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202435074&comment_count=6"], "top_img": "https://pmcvariety.files.wordpress.com/2017/05/scandal-finale.jpg?w=1000", "keywords": [], "authors": ["Jean Bentley"], "canonical_link": "https://variety.com/2017/tv/news/scandal-season-6-finale-bellamy-young-interview-1202435074/", "title": "‘Scandal’ Finale: New President Dishes on Cliffhangers and ‘Heartbreaking’ Final Season (SPOILERS)", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Bellamy Young talks to Variety about the Season 6 finale of \"Scandal,\" plus why the show is ending after its seventh season.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202435074, "author": "Jean Bentley", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-05-18T20:00:03"}, "pmc-tag": "ABC,Bellamy Young,Scandal", "title": "‘Scandal’ Finale: New President Dishes on Cliffhangers and ‘Heartbreaking’ Final Season (SPOILERS)", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "‘Scandal’ Finale: New President Dishes on Cliffhangers and ‘Heartbreaking’ Final Season (SPOILERS)", "url": "https://variety.com/2017/tv/news/scandal-season-6-finale-bellamy-young-interview-1202435074/", "description": "SPOILER ALERT: Do not read ahead if you have not watched the two-hour season finale episode of “Scandal,” which aired on Thursday, May 18. Hail to the Chief: Madam President Mellie Gran…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/05/scandal-finale.jpg?w=1000", "width": 1000, "height": 653, "alt": "Scandal Season 6 finale"}, "locale": "en_US"}, "article": {"published_time": "2017-05-19T03:00:03+00:00", "modified_time": "2017-05-19T03:00:04+00:00"}, "twitter": {"creator": "@Variety", "site": "@variety", "text": {"title": "‘Scandal’ Finale: New President Dishes on Cliffhangers and ‘Heartbreaking’ Final Season (SPOILERS)"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/05/scandal-finale.jpg?w=1000", "alt": "Scandal Season 6 finale"}, "card": "summary_large_image", "title": "‘Scandal’ Finale: New President Dishes on Cliffhangers and ‘Heartbreaking’ Final Season (SPOILERS)", "description": "Bellamy Young talks to Variety about the Season 6 finale of \"Scandal,\" plus why the show is ending after its seventh season."}, "author": "Jean Bentley", "content_type": "Article", "post_id": 1202435074, "title": "'Scandal' Finale: New President Dishes on Cliffhangers and 'Heartbreaking' Final Season (SPOILERS)", "published_at": "2017-05-18 20:00:03", "image": "https://pmcvariety.files.wordpress.com/2017/05/scandal-finale.jpg?w=1000", "comment_count": 6, "tags": "Scandal", "topics": "News", "appeared_in_print": "No", "body": "SPOILER ALERT: Do not read ahead if you have not watched the two-hour season finale episode of \"Scandal,\" which aired on Thursday, May 18.\r\n\r\nHail to the Chief: Madam President Mellie Grant has officially been sworn into office on \"Scandal.\" Though that historic moment was inevitable, there were plenty of shocking developments in Thursday night's Season 6 finale, which will have a major impact on what happens in the seventh-and-final season of the Shonda Rhimes drama.\r\n\r\nWhat are those new developments? Well, for starters, Fitz (Tony Goldwyn) and Olivia (Kerry Washington) will head up a new -- and improved? -- B613. The person who had Frankie Vargas killed was actually his wife, a.k.a. the new vice president Luna Vargas (Tessie Santiago), leading Olivia and Jake (Scott Foley) to force her to kill herself. And Cyrus (Jeff Perry) might not have made the actual call to hire Frankie's killer, but he's the one who planted the seeds in Luna's mind -- and now he's going to be the vice president.\r\n\r\nHere, Bellamy Young, who plays the new president, chats with Variety about the episode's cliffhangers, Mellie's new administration, and wrapping up \"Scandal\" with Season 7.\r\n\r\n\r\n\r\nDo you think it's a little bit of wish fulfillment to have a female president on \"Scandal\"?\r\n\r\nWell, I cannot speak for Shonda or the writers' minds, but I do think it's important for us, as a country, to be able to have in our living room, get you through the idea of female leadership. We're way behind the rest of the world in that regard. And definitely in terms of people who will be wonderful presidents, people who have earned it, I think Mellie is in line regardless of her gender. I think it's all good storytelling.\r\n\r\nMellie has always vacillated between being really confident in her abilities and doubting everything. What's her mindset as she's going to start her presidency?\r\n\r\nI think this last chapter with Peus and Mystery Woman has really burned away any frivolity and really sealed her resolve. [Before their involvement], it was still a dream. She had unrealistic notions about being president. She just knew she wanted to be president, had trained all her life, thought she would be good at it and, of course, had watched Fitz. But whenever you're not in the driver's seat, you are not having an authentic experience. I think this new chapter we're in with Mellie as president, she's a whole different Mellie. I think a lot of her floating above her power has all gone away. I like to think she's opened up and rooted down, and we're really coming from a place of true strength. It's Mellie, so I know she'll make a lot of mistakes as well.\r\n\r\nHow much do you think Mellie will learn about Luna's involvement in the conspiracy?\r\n\r\nIt's inevitable that she'll find out to some extent -- not inevitable that she ever finds out that Olivia was at the bottom of it.\r\n\r\n\"Scandal\" has always been about who you can and can't trust. Do you think that's going to affect how Mellie approaches her new role?\r\n\r\nI think life has taught Mellie to be a pragmatist, but Mellie has a romantic heart. That's where she stumbles. She has a very romantic idea of people, and they so often fail her. It will be really interesting to see, especially since Olivia has been set up to have so much power, both for the good in the White House and for dark with B613. I think it's going to be very interesting to see Mellie grapple with that and find her true strength, true integrity, true voice in the midst of all that.\r\n\r\nHow will Mellie and Cyrus' dynamic be as president and VP? Will Mellie be okay with Cyrus' part in the assassination? \r\n\r\nI think inasmuch as Mellie is quite naïve to Olivia's potential for darkness -- she always sees Olivia as the moral barometer, the person you can ask the hard questions and she'll always give you the honest answer -- she is not at all naïve about who Cyrus is. You cannot trust him even as you're looking him straight in the face. I think Mellie remains quite awake, on guard, and ready whenever she's with Cyrus. There's no greater partner in politics than Cyrus. She knows that he can lift you up to the absolute heavens, but she knows that he'll tear you down in an instant. It's making a deal with the devil, which has always been what our show's been about.\r\n\r\nWas it bittersweet when you found out that Season 7 is going to be the final season?\r\n\r\nIt was heartbreaking. I wouldn't even say bittersweet. Bittersweet in that we are so grateful to have another whole year to really bring this story to it's resting point, to its landing point, because we're all so interested to see where that is. It really would have killed us to have heard after we wrapped that season six had been our last season. That would have been really devastating. We're really grateful to have this final year. It wasn't an unexpected announcement by any measure, but it was still so hard to hear. Kerry was the amazing leader that she always is, and was really the only one of us that could muster eloquence in the moment. Rather than ask anything about \"Where's it going?\" or \"Why did you make this choice?\" all we could think to do was love each other and thank Shonda and pledge to be a family forever. It really has been a journey of love.\r\n\r\nWhat’s something you would like to see Mellie accomplish in the final season?\r\n\r\nI really want to see her lose her self-doubt, come into her powers and her presidency. I think it's of course important for her, but also important for our nation that she be a great leader. I think she realizes that. That the mission is bigger than her vanity. I'd also love her to get the chance to love and be loved in return. I think that would also heal a piece of her soul that is deeply wounded.\r\n\r\nDo you think Season 7 of \"Scandal\" will incorporate any of the headlines coming from real-life Washington D.C. every day?\r\n\r\nI don't have any idea what they're planning for season seven. We are never a part of those conversations, so I don't know. All I can say is that I know scenes in season six changed completely, utterly, based on the change in the world after our American election. I have to think, we all live in the real world, and they're writing in response to the situation at hand. They're always, of course, taking our wonderful gladiators into consideration. They know what their day is like, and then they sit down and watch TV, and you want to be aware of the opportunity you have with a forum such as this political television show. What comment you're making, what conversations you're participating in, what editorial comments you might be making. With that being said, Shonda's a once-in-a-generation storyteller. She's always said she knows where these characters are going, and it would take something seismic to alter the essence of someone ... Even if the world has changed how it's going to [end], I have to trust that Shonda's always known what is going to happen.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1495162803.0, "source": "https://variety.com", "summary": ""}