{"url": "https://www.etonline.com/kim-kardashian-and-kanye-west-welcome-baby-no3-surrogate-91499", "text": "The West family is one bigger!\n\nKim Kardashian and Kanye West welcomed their third child on Monday, as their surrogate gave birth to a baby girl, Kardashian shared on her website.\n\n\"Kanye and I are happy to announce the arrival of our healthy, beautiful baby girl,\" the mom of three wrote, adding \"we're so in love\" in the post titled, \"she's here.\"\n\nA source tells ET that Kim and Kanye were in the delivery room when their surrogate gave birth to their baby girl at Cedars Sinai Medical Center in Los Angeles. The couple was joined by Kris Jenner and Kim's sisters at the hospital, however, the family was not in the delivery room.\n\n\"We are incredibly grateful to our surrogate who made our dreams come true with the greatest gift one could give and to our wonderful doctors and nurses for their special care. North and Saint are especially thrilled to welcome their baby sister.\"\n\nTheir new bundle of joy weighed in at 7lbs, 6 oz and was born at 12:47 am. Kardashian has yet to reveal her name.\n\nBaby No. 3 joins older siblings, 4-year-old North and 2-year-old Saint. Kim and Kanye opted for a surrogate to have their third child, after Kim's first two notoriously difficult pregnancies.\n\n\"They are fully prepared and can't wait to bring their baby home,\" a source told ET earlier this week. The name of their baby has not yet been revealed.\n\n\"If they've chosen a name, they're keeping it very private,\" the source revealed. \"They may not even have one yet -- and might not choose something until they meet the baby!\"\n\nThough both the Keeping Up With the Kardashians star and the 40-year-old rapper were in the delivery room, the birth of the baby was not filmed for their E! reality show. In fact, the surrogate's privacy has been extremely important to the husband-and-wife duo, a source told ET back in September.\n\n\"This was always the plan. After the complications with the other pregnancies, they knew they wanted to go the surrogacy route for the next baby,\" the source added.\n\nLast fall, Kim admitted to ET that the surrogate experience has been \"really different.\"\n\n\"Anyone that says or thinks it is just the easy way out is just completely wrong,\" the KUWTK star said. \"I think it is so much harder to go through it this way, because you are not really in control. And, you know, obviously you pick someone that you completely trust and that you have a good bond and relationship with, but... knowing that I was able to carry my first two babies and not my baby now, it's hard for me. So, it's definitely a harder experience than I anticipated just in the control area.\"\n\nMeanwhile, one thing to look forward to with another Kimye-baby -- more adorable family photos on Kim's Instagram!\n\nCongrats, Kim and Kanye!\n\nRELATED CONTENT:\n\nKim Kardashian Explains Why She Didn't Invite Her Surrogate to Baby Shower\n\nKeeping Up With the Kardashian-Jenner Pregnancies: A Breakdown of Kim, Khloe & Kylie's Babies on the Way\n\nKim Kardashian Accidentally Reveals Gender of Baby No. 3, Says North Is ‘So Excited’\n\nKim Kardashian Says She's Taken Over One of Mom Kris Jenner's Most Important Roles (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRelated Gallery", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2019-05/1280kimye.jpg?h=22ac7b99&itok=ePtSOVy2", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-10/gettyimages-597560444.jpg?h=4c04e91b&itok=TPWN7qGB", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/rupauls_drag_race__E_1208_droop_sneak_1920x1080.jpg?h=70217200&itok=U94nGmuG", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/gettyimages-692085362.jpg?h=c673cd1c&itok=TnqSx9El"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-10/gettyimages-597560444.jpg?h=4c04e91b&itok=TPWN7qGB", "keywords": [], "authors": ["Alex Ungerman"], "canonical_link": "https://www.etonline.com/kim-kardashian-and-kanye-west-welcome-baby-no3-surrogate-91499", "title": "Kim Kardashian and Kanye West Welcome Baby No.3 Via Surrogate", "meta_data": {"article": {"opinion": "false"}, "title": "Kim Kardashian and Kanye West Welcome Baby No.3 Via Surrogate  | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/kim-kardashian-and-kanye-west-welcome-baby-no3-surrogate-91499", "title": "Kim Kardashian and Kanye West Welcome Baby No.3 Via Surrogate", "description": "North and Saint West have a new baby sister!", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-10/gettyimages-597560444.jpg?h=4c04e91b&itok=TPWN7qGB", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "North and Saint West have a new baby sister!", "title": "Kim Kardashian and Kanye West Welcome Baby No.3 Via Surrogate", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Alex Ungerman‍", "url": "https://www.etonline.com/kim-kardashian-and-kanye-west-welcome-baby-no3-surrogate-91499", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-10/gettyimages-597560444.jpg?h=4c04e91b&itok=TPWN7qGB"}, "description": "North and Saint West have a new baby sister!", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, Kim Kardashian, Kanye West, North West", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}