{"url": "https://espnmediazone.com/us/press-releases/2017/06/nominees-announced-25th-espys-fan-voting-begins/", "text": "Chicago Cubs, Cristiano Ronaldo, Kevin Durant, Michael Phelps, Roger Federer, Serena Williams, Simone Biles, and Tom Brady are all among nominees for The 25th ESPYS on ABC, hosted by Peyton Manning\n\nWHAT:\n\nNominees for The 25th ESPYS were revealed today and fan voting has begun.\n\nWHERE:\n\nFans can cast their vote at ESPYS.com and a list of The 25th ESPYS nominees is available to members of the media at: http://bit.ly/2017ESPYnom.\n\nWHEN:\n\nVoting is underway and all categories will close when the live show starts on Wednesday, July 12, at 8 p.m. ET.\n\nPardon the Interruption’s Tony Kornheiser and Michael Wilbon will host The ESPY Nomination Special on Sunday, July 2, at 3 pm ET on ESPN.\n\nHOW:\n\nFans will determine the winners in most ESPYS categories by voting online at ESPYS.com up to the start of The 25th ESPYS.\n\n2017 ESPYS FACTS & FIGURES:\n\nIn Best Male Athlete, 2009 winner Michael Phelps is joined by three newcomers to the category – Sidney Crosby, Russell Westbrook, and Kris Bryant. Westbrook has history working in his favor, given that the award has gone to an NBA player every year since 2011.\n\nOklahoma softball’s Shay Knighten and Clemson football’s Deshaun Watson are both nominated for Best Championship Performance, the first time since 2005 that multiple college athletes have competed for the honor. They are joined by NBA Finals MVP Kevin Durant and Super Bowl MVP Tom Brady.\n\nMichael Phelps is chasing a third ESPY for Best Record-Breaking Performance, an honor he earned following both the Beijing and London Olympics. He is joined in the category by the NFL head coach with the most Super Bowl rings ever, Bill Belichick, the WNBA all-time scoring leader, Diana Taurasi, and the spoiler of Oscar Robertson’s 55-year triple double record, Russell Westbrook.\n\nThe Pittsburgh Penguins are the only Best Team nominee returning from 2016. They are joined by six other impressive squads, including US women’s gymnastics “Final Five.”\n\nDefending “Best NBA Player” LeBron James graces the category for the 13th-straight year, a streak he has maintained since 2005. The competitive field of challengers includes Finals MVP Kevin Durant, triple-double machine Russell Westbrook, two-way star Kawhi Leonard, and league-leading distributor James Harden.\n\nGymnast Simone Biles, sprinter Allyson Felix, and swimmers Katie Ledecky and Simone Manuel gathered a collective haul of 12 gold medals at the Rio Olympics. Now they’re competing against one another for Best Female US Olympic Athlete.\n\nThe 25th ESPYS return to ABC for the third year with a star-studded evening celebrating major sports achievements, reliving unforgettable moments, and saluting the leading performers and performances of the past year in sports.\n\nTop celebrities from sports and entertainment will gather to recognize nominees and honor winners in categories such as “Best Game,” “Best Team,” “Best Female Athlete,” “Best Upset,” “Best Male U.S. Olympic Athlete” and more. The 25th ESPYS will also showcase inspiring human stories through three pillar awards – the Arthur Ashe Courage Award, the Jimmy V Perseverance Award and the Pat Tillman Award for Service. The show supports ESPN’s ongoing commitment to The V Foundation for Cancer Research, launched by ESPN with the late Jim Valvano in 1993.\n\nThe 25th ESPYS will be hosted by five-time NFL MVP and two-time Super Bowl champion Peyton Manning. The 25th ESPYS will be broadcast live on ABC Wednesday, July 12, at 8 p.m. ET from the Microsoft Theater in Downtown Los Angeles. More information can be found in the ESPYS media kit: http://bit.ly/1Qfu16d.\n\n-30-", "images": ["https://espnpressroom.com/us/files/2019/07/Tracy-release-photo-390x220.jpg", "https://secure.gravatar.com/avatar/3f7a91346012ef5b7dab423d9dc7d0e8?s=140&d=mm&r=g", "https://espnpressroom.com/us/files/2019/02/espn.png", "https://espnpressroom.com/us/files/2014/07/EI_186044_20130715_RA1_8203-scr-780x405.jpg", "https://secure.gravatar.com/avatar/3f7a91346012ef5b7dab423d9dc7d0e8?s=180&d=mm&r=g", "https://espnpressroom.com/us/files/2019/02/Untitled-1.png", "https://espnpressroom.com/us/files/2014/07/EI_186044_20130715_RA1_8203-scr.jpg"], "top_img": "https://espnpressroom.com/us/files/2014/07/EI_186044_20130715_RA1_8203-scr.jpg", "keywords": [], "authors": ["Jennifer Cingari Christie", "Based In New York City", "Jennifer Cingari Christie Is A Communications Manager For Espn Films", "Original Content. Her Projects Include The Critically-Acclaimed For Documentary Series", "Espn The Magazine", "The Espys", "Among Others."], "canonical_link": "https://espnpressroom.com/us/press-releases/2017/06/nominees-announced-25th-espys-fan-voting-begins/", "title": "Nominees Announced for The 25th ESPYS as Fan Voting Begins", "meta_data": {"robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Nominees Announced for The 25th ESPYS as Fan Voting Begins - ESPN Press Room U.S.", "description": "Chicago Cubs, Cristiano Ronaldo, Kevin Durant, Michael Phelps, Roger Federer, Serena Williams, Simone Biles, and Tom Brady are all among nominees for The 25th ESPYS on ABC, hosted by Peyton Manning", "url": "https://espnpressroom.com/us/press-releases/2017/06/nominees-announced-25th-espys-fan-voting-begins/", "site_name": "ESPN Press Room U.S.", "image": {"identifier": "https://espnpressroom.com/us/files/2014/07/EI_186044_20130715_RA1_8203-scr.jpg", "secure_url": "https://espnpressroom.com/us/files/2014/07/EI_186044_20130715_RA1_8203-scr.jpg", "width": 850, "height": 566}}, "article": {"publisher": "https://www.facebook.com/ESPN", "tag": "The 2017 ESPYS", "section": "ESPYS", "published_time": "2017-06-21T04:00:00+00:00"}, "generator": "Powered by WPBakery Page Builder - drag and drop page builder for WordPress.", "google-site-verification": "sGvmcdHX_PEgfaPM-FCERO9Rd_l6aRLX1bkpcrOzlOA", "theme-color": "#ba1f24", "viewport": "width=device-width, initial-scale=1.0", "msapplication-TileImage": "https://espnpressroom.com/us/files/2019/03/LargeSquareImages-espnAppIcon-2x.png"}, "movies": [], "publish_date": 1498017600.0, "source": "https://espnmediazone.com", "summary": ""}