{"url": "https://guestofaguest.com/los-angeles/award-shows/tracee-ellis-rosss-sag-awards-joke-actually-made-an-important-point-about-feminism", "text": "While the SAG Awards red carpet was noticeably devoid of any fashion protests, Hollywood's Time's Up initiative remained at the forefront of the ceremony. Besides having Kristen Bell as the show's first-ever host, the evening featured an all-female bill of presenters and the famous \"I Am An Actor\" introduction only highlighted leading ladies, including Allison Janney, Millie Bobby Brown, and the inimitable Tracee Ellis Ross.\n\nRoss, who's been a comedic force for decades, naturally cracked a joke during her moving monologue. Surely it lightened the mood, but it also hit upon an important point when it comes to feminism - and any sort of social activism in general.\n\n\"When I was a little girl, I dreamt of growing up and being a courageous woman who could use my voice for important issues that affect all of us...and have a lot of shoes. I am happy to report that both are true. I utilize my agency and my voice for equity and justice in our industry and beyond, and I have so many shoes. Like, I have a lot of shoes. I am Tracee Ellis Ross, and I am an actor.\"\n\n\n\nThe shoe bit got a lot of laughs (we're sure her cheeky delivery didn't hurt), but let's consider her statement in a more serious light. At a time when such significant social change is at hand, everything outside of a movement gets criticized as trivial. Not to mention an overarching dismissal of traditionally \"feminine\" interests like shopping.\n\nCan you be a feminist and love fashion? Should you feel guilty about it? According to Ross, and many other vocal, well-heeled women around the world, no, you shouldn't. If you're a forward thinker when it comes to social justice and politics, why can't you be fashion forward as well? After all, feeling your best in this uneasy climate is an act of feminism in itself - if a new pair of shoes helps you accomplish that, go right ahead and get 'em.\n\n[Photo via Twitter/Variety]\n\n", "images": ["https://media.guestofaguest.com/t_card_large/gofg-media/2018/01/1/50286/dugolqou0aa_dm-.jpg", "https://guestofaguest.com/img/gofg-mark.svg", "https://media.guestofaguest.com/t_article_content/gofg-media/2018/01/1/50286/dugolqou0aa_dm-.jpg", "https://guestofaguest.com/img/gofg-logo.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://media.guestofaguest.com/t_card_large/gofg-media/2018/01/1/50286/dugolqou0aa_dm-.jpg", "keywords": [], "authors": ["Stephanie Maida"], "canonical_link": "https://guestofaguest.com/los-angeles/award-shows/tracee-ellis-rosss-sag-awards-joke-actually-made-an-important-point-about-feminism", "title": "Tracee Ellis Ross's SAG Awards Joke Actually Made An Important Point About Feminism", "meta_data": {"og": {"site_name": "Guest of a Guest", "title": "Tracee Ellis Ross's SAG Awards Joke Actually Made An Important Point About Feminism", "url": "https://guestofaguest.com/los-angeles/award-shows/tracee-ellis-rosss-sag-awards-joke-actually-made-an-important-point-about-feminism", "description": "Let's talk about shoes.", "image": "https://media.guestofaguest.com/t_card_large/gofg-media/2018/01/1/50286/dugolqou0aa_dm-.jpg", "type": "article"}, "fb": {"admins": 1020659762}, "description": "Let's talk about shoes.", "manifest": {"id": "post", "section": "news", "city": "Los Angeles", "author": "Stephanie Maida", "post_date": "2018-01-22"}, "viewport": "user-scalable=0, initial-scale=1.0", "msapplication-TileColor": "#da532c", "msapplication-TileImage": "/mstile-144x144.png", "theme-color": "#ffffff"}, "movies": [], "publish_date": null, "source": "https://guestofaguest.com", "summary": ""}