{"url": "https://www.moviequotesandmore.com/fifty-shades-of-grey-quotes/", "text": "Fifty Shades of Grey Quotes – ‘I exercise control in all things, Miss Steele.’\n\nStarring: Dakota Johnson, Jamie Dornan, Jennifer Ehle, Eloise Mumford, Victor Rasuk, Luke Grimes, Marcia Gay Harden, Rita Ora, Max Martini, Keith Rennie, Andrew Airlie, Dylan Neal, Elliat Albrecht, Rachel Skarsten, Emily Fonda, Anthony Konechny, Bruce Dawson\n\nOUR RATING: ★★☆☆☆\n\nStory:\n\nErotic romantic drama directed by Sam Taylor-Johnson, based on the novel by E. L. James. The story centers on literature student Anastasia Steele (Dakota Johnson) who after accepting to do a favor for her sick friend ends up interviewing enigmatic billionaire Christian Grey (Jamie Dornan) after which they soon end up in a strange relationship where Christian introduces Ana to a world of submission.\n\nBest Quotes (Total Quotes: 127)\n\n[first lines; Ana is getting ready in her apartment that she shares with Kate who’s lying sick on the couch]\n\nKate: Ana, take my car. I gave you the recorder right?\n\nAnastasia Steele: Uh, yes.\n\nKate: And you have all the questions?\n\nAnastasia Steele: Yes.\n\nKate: And you know where you’re going?\n\nAnastasia Steele: Yes, I do have a GPS, and a four point O GPA. I can figure it out.\n\nKate: You’re wearing that?\n\nAnastasia Steele: Okay, maybe a little less talking, more eating. Bye.\n\n[she kisses Kate’s forehead before leaving]\n\n[Ana pulls up outside Grey Enterprises building, gets out of her car and looks up at the building before entering]\n\nReceptionist #1: Miss Kavanagh? May I take your coat?\n\nAnastasia Steele: Oh, yeah\n\n[Ana takes off her coat to give to the receptionist]\n\nAnastasia Steele: Um, uh, okay.\n\nReceptionist #2: Mr. Grey will see you now.\n\nAnastasia Steele: Okay.\n\n[Christian’s secretary, Andrea approaches Ana]\n\nAndrea: This way please.\n\nAnastasia Steele: Okay.\n\n[Ana follows Andrea]\n\n[Andrea takes Ana to Christian’s office]\n\nAndrea: Right this way.\n\n[as Andrea opens the door, Ana stumbles and falls forward on her hands, Christian walks over to her]\n\nChristian Grey: Miss Kavanagh. Are you alright?\n\n[he helps Ana stand]\n\nChristian Grey: Christian Grey.\n\nAnastasia Steele: I’m Anastasia Steele. Um, Miss Kavanagh has the flu, so she asked me to fill in.\n\nChristian Grey: I see. So you’re studying journalism as well.\n\nAnastasia Steele: No, English Lit. Um, Kate’s my roommate.\n\nChristian Grey: As I said, I only have ten minutes. Please, have a seat, Miss Steele.\n\n[Christian takes sits behind his desk as Ana takes the seat opposite]\n\n[as Ana has forgot her pen, she notices pencils on Christian’s desk, Christian gets up, picks up a pencil and gives it to Ana]\n\nAnastasia Steele: Thank you. Ready?\n\nChristian Grey: Whenever you are.\n\nAnastasia Steele: Uh, okay.\n\n[Ana looks down at the paper with her questions on them]\n\nAnastasia Steele: Um, so this is for the special graduation issue of the student newspaper.\n\nChristian Grey: Yes, I’m giving the commencement address at this year’s ceremony.\n\nAnastasia Steele: You are? I mean, um, I know.\n\n[Ana looks down at her questions]\n\nAnastasia Steele: Uh, you are very young to have amassed such an empire. To what do you owe your…\n\nChristian Grey: To what do I owe my success?\n\nAnastasia Steele: Yep.\n\nChristian Grey: Seriously?\n\nAnastasia Steele: Yes.\n\nChristian Grey: Business is about people, and I’ve always been good at people. What motivates them, what incentivizes them, what inspires them.\n\nAnastasia Steele: Maybe you’re just lucky.\n\nChristian Grey: I’ve always found that the harder I work the more luck I seem to have. The key to my success has been in identifying talented individuals and harnessing their efforts.\n\nAnastasia Steele: So you’re a control freak?\n\nChristian Grey: Oh, I exercise control in all things, Miss Steele.\n\n[Ana looks at her questions again]\n\nAnastasia Steele: Okay. Um, uh, your company is involved primarily in the telecommunications sector. Yet you also invest in numerous agricultural projects, including several in Africa. Is that something that you feel passionate about? Feeding the world’s poor?\n\nChristian Grey: It’s smart business.\n\n[Ana looks at him disapprovingly]\n\nChristian Grey: You don’t agree?\n\nAnastasia Steele: I don’t know enough about it. I just wonder if perhaps your heart might be a bit bigger than you want to let on.\n\nChristian Grey: There’s some people that say I don’t have a heart, at all.\n\nAnastasia Steele: Why would they say that?\n\nChristian Grey: Because they know me well.\n\nChristian Grey: Go on.\n\n[Ana looks at her questions]\n\nAnastasia Steele: Um, do you have any interests outside of work?\n\nChristian Grey: I enjoy various physical pursuits.\n\n[looking at her notes]\n\nAnastasia Steele: You’re unmarried, oh, you were adopted at age four.\n\nChristian Grey: That’s a matter of public record.\n\nAnastasia Steele: I’m sorry I didn’t…\n\nChristian Grey: Do you have an actual question, Miss Steele?\n\nAnastasia Steele: Yeah, sorry.\n\n[looking down at the questions]\n\nAnastasia Steele: Are you gay?\n\n[realizing what she’s just read Ana chuckles nervously]\n\nAnastasia Steele: It’s written here, I’m just…\n\nChristian Grey: No, Anastasia. I’m not gay.\n\nAnastasia Steele: I apologize, Mr. Grey, Kate can be a little…\n\nChristian Grey: Intrusive?\n\nAnastasia Steele: Curious.\n\nChristian Grey: What about you?\n\n[he takes the seat next to Ana]\n\nChristian Grey: Why don’t you ask me something that you want to know?\n\nAnastasia Steele: Earlier you said that there are some people who know you well. Why do I have the feeling that that is not true?\n\n[just then Andrea opens the office door]\n\nAndrea: Mr. Grey, your next meeting is in the conference room.\n\nChristian Grey: Cancel it, please. We’re not finished here.\n\nAndrea: Yes, sir.\n\n[Andrea closes the door]\n\nAnastasia Steele: No, I, um, I can go. It’s fine.\n\nChristian Grey: I would like to know more about you.\n\nAnastasia Steele: There’s really not much to know about me.\n\nChristian Grey: You said you’re in English major? Tell me was it Charlotte Brontë, Jane Austen or Thomas Hardy, who first made you fall in love with literature?\n\nAnastasia Steele: Hardy.\n\nChristian Grey: I would’ve guessed Jane Austen.\n\n[Ana smiles at him]\n\nChristian Grey: What are your plans for after you graduate?\n\nAnastasia Steele: I’m just trying to get through finals right now.\n\nChristian Grey: And then?\n\nAnastasia Steele: And then I was planning on moving here to Seattle with Kate.\n\nChristian Grey: We offer an excellent internship program.\n\nAnastasia Steele: I don’t think I’d fit in here.\n\n[Ana laughs]\n\nAnastasia Steele: Look at me.\n\nChristian Grey: I am.\n\n[Christian escorts Ana to the elevator]\n\nChristian Grey: I hope you got everything you needed.\n\nAnastasia Steele: I think you only answered four questions.\n\n[as the elevator arrives, Ana turns to step into it, Christian notices the piece of paper containing her questions sticking out of her notebook and quickly grabs it]\n\nChristian Grey: Anastasia.\n\nAnastasia Steele: Christian.\n\n[as Ana steps out of the building and into the rain, she takes deep breaths]\n\nAnastasia Steele: Holy cow.\n\n[Ana enters the apartment to find Kate sitting at the table looking at her laptop]\n\nAnastasia Steele: Um, before you say anything…\n\nKate: You’re a goddess, this is perfect.\n\nAnastasia Steele: What?\n\nKate: I just got his email, he answered every question. So? What was he like?\n\nAnastasia Steele: Uh, he was fine.\n\nKate: Fine? Just fine?\n\nAnastasia Steele: Um, he was really polite, and he was courteous, and very formal and clean.\n\nKate: Clean?\n\nAnastasia Steele: I mean, he was very, you know, smart and intense. It was kind of intimidating. I can understand the fascination.\n\nKate: Uh-huh!\n\nAnastasia Steele: Why are you looking at me like that?\n\nKate: Like what?\n\nAnastasia Steele: Okay.\n\nAnastasia Steele: I’m going to make a sandwich, do you want one?\n\nKate: No, thanks.\n\n[looking at Christian’s photos on her laptop]\n\nKate: You have to admit, he’s ridiculously hot.\n\nAnastasia Steele: I’m sure if you are attracted to that sort of human, then…\n\nKate: The hot type of human?\n\nAnastasia Steele: I asked him if he was gay, that was in your questions. Why would you do that to me?\n\nKate: Because whenever he’s in the society pages, he’s never been photographed with a woman. So naturally…\n\nAnastasia Steele: Well maybe he just wants to keep his private life private, Kate.\n\nKate: And now you’re defending him.\n\nAnastasia Steele: I’m terminating this conversation.\n\nKate: Too bad we don’t have some original stills of your hot, clean, twenty-seven year old billionaire. The camera loves him almost as much as you do.\n\n[Ana gives her a disapproving look]\n\nKate: Okay, I wasn’t hungry, but now I am.\n\n[Kate takes the sandwich that Ana had just made]\n\nKate: Thank you.\n\n[she bites into the sandwich]\n\nKate: I love you.\n\n[as Kate walks away, Ana sits by the laptop and look at Christian’s photos]\n\n[after her class Ana walks over to her car in the parking lot when her friend, Jose, comes over to her]\n\nJose: Ana, I’ve been looking for you.\n\nAnastasia Steele: What’s up?\n\nJose: Guess what?\n\nAnastasia Steele: What?\n\nJose: Portland’s Place is going to exhibit my photographs next month.\n\nAnastasia Steele: Oh, my God!\n\n[Ana hugs Jose]\n\nAnastasia Steele: Congratulations, that’s so good!\n\nAnastasia Steele: Can we celebrate later? Cause I’m really late for work.\n\nJose: Yeah, yeah, yeah. You got it, you got it.\n\n[as Ana goes to open her car door]\n\nJose: Hold on. Hold on, hold on.\n\n[Jose opens the car door for Ana]\n\nAnastasia Steele: Thank you, you’re my hero.\n\n[Ana gets into her car]\n\nJose: See you later.\n\nAnastasia Steele: Okay.\n\n[Jose waves goodbye to Ana as she drives off]\n\n[Ana is at work at a hardware store when she gets a call from her mother, Carla]\n\nAnastasia Steele: Mom, I’m at work can I call you back?\n\nCarla: Oh, no, wait. Wait, wait. I called for a reason. Bob broke his foot playing golf of all things.\n\nAnastasia Steele: God, is he okay? Is he in a lot of pain?\n\nCarla: Who can tell? The man calls the paramedics for a blister. It means though, we won’t be able to fly in for graduation.\n\nAnastasia Steele: Really? I mean, you don’t want to just come alone? You don’t have to bring Bob.\n\nCarla: And leave Tiger Woods to fend for himself? You understand, don’t you, darling?\n\n[Ana looks visibly upset]\n\nAnastasia Steele: Yeah. Yeah, it’s fine. I really have to go, okay?\n\nCarla: I love you, Ana.\n\nAnastasia Steele: I know. I love you too.\n\n[Ana ends the call]\n\nAnastasia Steele: God.\n\n[Ana’s manager, Paul, comes over to her]\n\nPaul Clayton: Ana, could you give me a hand out back?\n\nAnastasia Steele: Uh, yeah, yeah. I’ll be right there.\n\n[as Ana walks by an aisle she’s suddenly startled to find Christian standing there]\n\nChristian Grey: I thought it was you.\n\nAnastasia Steele: What the…?\n\nChristian Grey: What a pleasant surprise, Miss Steele.\n\nAnastasia Steele: Just Ana. Just Ana. You’re in here.\n\nChristian Grey: I was in the area on business, needed to pick up a few things. Are you free?\n\nAnastasia Steele: Yeah. What can I help you with?\n\nChristian Grey: Do you stock cable ties?\n\nAnastasia Steele: Cable ties, yes, we do. I can show you, if you want.\n\nChristian Grey: Please, lead the way, Miss Steele.\n\nAnastasia Steele: Just Ana.\n\n[Ana takes Christian to the cable ties]\n\nAnastasia Steele: Is that it?\n\nChristian Grey: Masking tape.\n\nAnastasia Steele: Are you redecorating?\n\n[Ana takes Christian to the masking tapes]\n\nChristian Grey: No.\n\nAnastasia Steele: Um, we have two inch and one inch. But the truly self-respecting handyman will have both in his tool box.\n\nChristian Grey: Of course he will.\n\nAnastasia Steele: It’s rare to find a connoisseur these days. Do you want anything else?\n\nChristian Grey: Yes, rope.\n\n[as Ana is getting Christian some rope]\n\nChristian Grey: That’s impressive. Are you a girl scout?\n\nAnastasia Steele: Um, no. Organized group activities aren’t really my thing.\n\nChristian Grey: So what is your thing?\n\nAnastasia Steele: Um, I don’t know. Books?\n\n[Ana chuckles]\n\nAnastasia Steele: Okay. Rope, tape, cable ties. You’re the complete serial killer.\n\nChristian Grey: Not today.\n\nAnastasia Steele: Anything else?\n\nChristian Grey: What would you recommend?\n\nAnastasia Steele: For a do-it-yourselfer? Um, maybe coveralls so you protect your clothes?\n\nChristian Grey: I could just take all my clothes off.\n\nAnastasia Steele: Okay, no clothes. I mean, no coveralls. You, I can’t really think of anything else.\n\nChristian Grey: Well, I guess that’s it then.\n\nAnastasia Steele: Cool.\n\n[at the cash register Ana bags up Christian’s things]\n\nAnastasia Steele: Thank you for answering Kate’s questions by the way, she was thrilled.\n\nChristian Grey: Well I hope she’s feeling better.\n\nAnastasia Steele: She is, yeah, much. She’s just having a hard time clearing a photo of you.\n\nChristian Grey: If she’d like an original, I’m around tomorrow.\n\nAnastasia Steele: You’d be willing to do that?\n\nChristian Grey: Yeah.\n\n[just then Paul comes up behind Ana and puts his hands on her shoulders]\n\nPaul Clayton: Want me to bag for you, Ana?\n\nAnastasia Steele: Oh. Uh, no, no, no. I’m good. Thanks though, Paul.\n\n[Christian gives Paul a cold look and Paul walks away]\n\nAnastasia Steele: Okay.\n\n[Christian places his business card on the counter]\n\nChristian Grey: I’m staying locally at the Heathman. Call me before ten.\n\n[Ana looks at him confused]\n\nChristian Grey: About the photos.\n\nAnastasia Steele: Oh. Yeah, I will.\n\n[Ana takes the business card]\n\nAnastasia Steele: Enjoy your…\n\n[Christian turns and leave the shop, Ana watches him through the window as he gives his bag to his driver, Taylor, and get into his car]\n\n[Jose is taking pictures of Christian as Kate and Ana watch from the side]\n\nKate: Thanks again for doing this, Mr. Grey.\n\nChristian Grey: I’m happy to help.\n\n[to Christian]\n\nJose: Uh, how about if we try a few with a smile?\n\n[Jose takes more photos but Christian still doesn’t smile]\n\nJose: Or not.\n\n[as they watch Christian being photographed]\n\nKate: You do realize that he hasn’t stopped looking at you?\n\nAnastasia Steele: He asked me to go for coffee afterwards.\n\nKate: What?\n\n[Kate starts to laugh]\n\nAnastasia Steele: Kate, shh.\n\n[after the photo shoot, as they walk down the hotel corridor]\n\nChristian Grey: So is he your boyfriend?\n\nAnastasia Steele: Who?\n\nChristian Grey: The photographer.\n\n[Ana laughs]\n\nAnastasia Steele: Jose? No.\n\nChristian Grey: I saw the way he was smiling at you.\n\nAnastasia Steele: No, Jose is more like family. He’s not my boyfriend.\n\nChristian Grey: And the guy at the store?\n\n[looking at Christian with shock]\n\nAnastasia Steele: Paul? No.\n\n[Ana and Christian are sat at the coffee shop, Christian pours Ana some tea]\n\nAnastasia Steele: Thank you.\n\nChristian Grey: You seem nervous.\n\nAnastasia Steele: I find you intimidating.\n\nChristian Grey: You should.\n\n[he places a muffin in front of Ana]\n\nChristian Grey: Eat.\n\nAnastasia Steele: Not to mention high-handed.\n\nChristian Grey: I’m used to getting my own way.\n\nAnastasia Steele: Well it must get very boring.\n\nChristian Grey: Tell me about your family.\n\nAnastasia Steele: My family? Um, okay. My dad died when I was a baby, so I was raised by my step-father Ray. He’s amazing.\n\nChristian Grey: And your mother?\n\nAnastasia Steele: Um, my mother is on husband number four. She’s an incurable romantic.\n\nChristian Grey: And you?\n\nAnastasia Steele: Am I a romantic?\n\n[Christian nods his head]\n\nAnastasia Steele: Well I study English Lit, so I kind of have to be.\n\nAnastasia Steele: Thought the photo shoot went well. Right? Kate seems to be really happy…\n\nChristian Grey: I’m sorry, I can’t.\n\nAnastasia Steele: What?\n\nChristian Grey: I’ll walk you out.\n\n[Christian gets up; outside Christians walks beside Ana]\n\nAnastasia Steele: Do you have a girlfriend, is that it?\n\nChristian Grey: I don’t do the girlfriend thing.\n\nAnastasia Steele: What does that even mean?\n\n[as they go to cross the street Ana is almost hit by a biker when suddenly Christian pulls her out of the way]\n\nChristian Grey: Watch it!\n\n[he holds onto Ana and touches her face tenderly]\n\nChristian Grey: I’m not the man for you. You should steer clear of me. I have to let you go.\n\n[Ana clearly looks hurt]\n\nAnastasia Steele: Goodbye, Mr. Grey.\n\n[Ana walks away]\n\n[after finishing their final exam Kate goes over to Ana]\n\nKate: Hey, you all good?\n\nAnastasia Steele: Yeah, why wouldn’t I be?\n\nKate: We are so partying tonight.\n\n[Ana chuckles]\n\nAnastasia Steele: Oh, my God.\n\n[later Kate helps Ana put makeup on her face]\n\nAnastasia Steele: This is way too much. You’re getting it…\n\nKate: No, this is exactly the right amount.\n\nAnastasia Steele: All over my face?\n\nKate: That’s the idea.\n\n[Ana looks in the mirror]\n\nAnastasia Steele: Wow. No, Kate.\n\n[just then their doorbell rings]\n\nKate: Cab’s early. Let’s go.\n\nKate: Ana, there’s a package for you.\n\n[Kate reads the note on the package]\n\nKate: “Why didn’t you tell me there was danger? Why didn’t you warn me? Ladies know what to guard against because…\n\nKate, Ana: …they read novels that tells them of these tricks.”\n\nAnastasia Steele: That’s a quote from Tess of the d’Urbervilles.\n\n[Ana opens the package to find three books]\n\nAnastasia Steele: Oh, my God. These must be from Christian.\n\n[Ana opens one book]\n\nAnastasia Steele: Do you…? I mean these are incredible.\n\nKate: Wow, great.\n\nAnastasia Steele: Kate, these are first editions. I can’t, this is too much. I can’t accept these, I have to send them back.\n\n[they hear a car honking its horn]\n\nKate: That’s the cab. Okay, are you ready?\n\nAnastasia Steele: Yes.\n\nKate: Are you really though?\n\nAnastasia Steele: Yes, very.\n\nKate: Let’s get out of here.\n\n[later at the club after drinking a shot; to Ana]\n\nKate: Did you do it all?\n\n[Ana shakes her head]\n\nJose: Alright! With my right eye closed and left handed, I can get this in. Ready? One, two…\n\n[Ana turns to go]\n\nKate: What?\n\nAnastasia Steele: I got to pee.\n\nKate: Okay.\n\nJose: Where you going?\n\nAnastasia Steele: I got to go. I got to pee.\n\n[Ana gets up and leaves]\n\n[standing in line for the ladies a drunk Ana decides to call Christian]\n\nChristian Grey: Anastasia?\n\nAnastasia Steele: Yeah, this is me. I’m sending back your expensive books, cause I already have copies of those. Thanks though for the kind gesture.\n\nChristian Grey: You’re welcome. Where are you?\n\nAnastasia Steele: Oh, I’m in line, cause I have to pee really bad.\n\nChristian Grey: Anastasia, have you been drinking?\n\n[Ana chuckles]\n\nAnastasia Steele: Yeah, I have, Mr. Fancy Pants. You hit the hail, hail on the nead. I mean the head on the nail.\n\nChristian Grey: Listen to me, I want you to go home right now.\n\nAnastasia Steele: You’re so bossy!\n\n[doing a mocking impression of Christian’s voice]\n\nAnastasia Steele: Ana, let’s go for coffee. Ana, let’s go for coffee. No, stay away from me, Ana. I don’t want you. Get away. Come here, come here. Go away.\n\nChristian Grey: That’s it. Tell me where you are.\n\nAnastasia Steele: A long way from Seattle. Long way from you.\n\nChristian Grey: Which bar, what’s it called?\n\nAnastasia Steele: I don’t know, I got to go though.\n\nChristian Grey: Which bar, Ana?\n\n[Ana ends the call; to the girl next to her in line]\n\nAnastasia Steele: I told him, right?\n\n[Christian calls Ana back]\n\nAnastasia Steele: I’m sorry I didn’t mean…\n\nChristian Grey: Stay where you are, I’m coming to get you.\n\nAnastasia Steele: What?\n\n[Christian ends the call]\n\nAnastasia Steele: Hello?\n\n[Ana goes outside the club and Jose finds her]\n\nJose: Hey.\n\n[he puts her jacket on her]\n\nAnastasia Steele: Oh, thanks.\n\nJose: You okay?\n\nAnastasia Steele: Yeah, I’m just feeling a little more drunk than…\n\n[Jose chuckles when she can’t finish her sentence]\n\nJose: Come here stay warm.\n\n[Jose pulls Ana close into his arms]\n\nAnastasia Steele: Oh, that’s cool. I’m good, Jose. I got it.\n\n[Ana tries to pull away]\n\nJose: I don’t know when I’ll have the courage to do this.\n\nAnastasia Steele: Do what?\n\nJose: Ana…\n\nAnastasia Steele: No.\n\nJose: I like you.\n\nAnastasia Steele: You do?\n\nJose: Very much.\n\nAnastasia Steele: Oh, my God.\n\nJose: Look, please, one kiss.\n\nAnastasia Steele: No. No, no, no. Jose, I don’t, I’m sorry, no.\n\n[as Jose leans in to kiss her suddenly Christian appears and pushes Jose away from Ana]\n\nChristian Grey: Dude, she said no.\n\nAnastasia Steele: Christian?\n\n[Ana pukes and Christian holds her hair back]\n\nAnastasia Steele: Don’t look at me.\n\n[he gives Ana his handkerchief]\n\nChristian Grey: Here.\n\n[after wiping her mouth Ana looks at the handkerchief]\n\nAnastasia Steele: Nice touch. I will launder this item.\n\nChristian Grey: Let’s get you home.\n\nAnastasia Steele: I’m with Kate.\n\nChristian Grey: I’ll have Elliot tell her.\n\nAnastasia Steele: Who’s Elliot?\n\nChristian Grey: He’s my brother. He’s inside talking to her right now.\n\nAnastasia Steele: How, I don’t…?\n\nChristian Grey: He’s at my hotel with me.\n\nAnastasia Steele: You’re still at the Heathman?\n\nChristian Grey: Yeah. Come.\n\n[back inside the club, Kate is dancing with Elliot, Ana watches as Christian goes over to Elliot to speak with him for a moment before heading back to her]\n\nAnastasia Steele: That’s your brother?\n\nChristian Grey: Not by choice. Let’s go.\n\nAnastasia Steele: Wait what did Kate say?\n\nChristian Grey: She warned me to be on my best behavior. More like threatened me.\n\n[Ana laughs]\n\nAnastasia Steele: She threatened you?\n\n[Ana looks at Christian]\n\nAnastasia Steele: You’re spinning. I think I’m going to faint.\n\nChristian Grey: What, now?\n\n[just then Ana passes out, Christian holds onto her to stop her from falling]\n\n[Ana wakes up in Christian’s hotel room, she sees some pills and glass of orange juice on the bedside table with the notes “Eat me”, “Drink me” next to each, as she takes the pills Christian enters the room after his morning run]\n\nChristian Grey: Good morning, Anastasia. How are you feeling?\n\nAnastasia Steele: Better than I deserve. Did you put me to bed?\n\nChristian Grey: Mm-hmm.\n\nAnastasia Steele: You undressed me?\n\nChristian Grey: I didn’t have much choice.\n\nAnastasia Steele: Where did you sleep?\n\n[he points to the space next to her in bed]\n\nAnastasia Steele: Oh, my God. Did we…? We didn’t…?\n\nChristian Grey: Necrophilia is not my thing.\n\nAnastasia Steele: So we just slept then?\n\nChristian Grey: It was a novelty for me too.\n\n[Christian goes over to her and gives her some toast]\n\nChristian Grey: You need to eat. I had Taylor pick you up some clothes.\n\nAnastasia Steele: Who’s Taylor?\n\nChristian Grey: My driver.\n\nAnastasia Steele: Thank you, but you didn’t have to do that.\n\nChristian Grey: Yes, I did. Yours were covered in vomit. You shouldn’t get drunk like that. I’m all for testing the limits, but you put yourself at risk last night.\n\nAnastasia Steele: I know.\n\n[Christian takes off his t-shirt]\n\nChristian Grey: If you were mine you wouldn’t be able to sit down for a week.\n\n[Christian goes over to her and sits opposite it her on the bed]\n\nAnastasia Steele: What?\n\n[Christian takes a bite out of her toast]\n\nChristian Grey: I got to go take a shower.\n\n[Christian walks to the bathroom]\n\nAnastasia Steele: Why am I here, Christian?\n\n[Christian stands by the bathroom doorway]\n\nChristian Grey: You’re here because I’m incapable of leaving you alone.\n\nAnastasia Steele: Then don’t. Why did you send me those books?\n\nChristian Grey: I thought I owed you an apology.\n\nAnastasia Steele: For what? For letting you believe that I… Listen to me.\n\n[he sits next to her on the bed]\n\nChristian Grey: I don’t do romance. My tastes are very singular. You wouldn’t understand.\n\nAnastasia Steele: Enlighten me then.\n\n[he touches her face tenderly, he leans in to kiss her but stops himself and instead walks into the bathroom]\n\n[Ana walks out of the bathroom wearing the clothes Taylor had bought her]\n\nChristian Grey: You look beautiful.\n\nAnastasia Steele: Taylor has good taste.\n\nChristian Grey: What are you doing later?\n\nAnastasia Steele: I’m working at the hardware store till seven.\n\nChristian Grey: I’ll have Taylor pick you up then.\n\n[Ana bites her lip and looks down]\n\nChristian Grey: I’d like to bite that lip.\n\nAnastasia Steele: I think I’d like that too.\n\nChristian Grey: I’m not going to touch you, not until I have your written consent.\n\nAnastasia Steele: What?\n\nChristian Grey: I’ll explain later. Come, I’ll take you home.\n\n[Christian and Ana enter the elevator, he sees Ana bite her lip again]\n\nChristian Grey: Fuck the paperwork.\n\n[he suddenly takes a hold of Ana and kisses her passionately, just as they are getting into it the elevator doors open and a group of business men enter, Christian looks at Ana]\n\nChristian Grey: What is it about elevators?\n\n[Ana smiles]\n\n[Ana and Christian enter her apartment to find Elliot and Kate naked on the couch, Elliot gets up to get dressed]\n\nElliot Grey: Hey.\n\nAnastasia Steele: Hey.\n\nElliot Grey: Hi, you must be Ana.\n\n[they shake hands]\n\nAnastasia Steele: You must be Elliot.\n\nElliot Grey: And we must be going, Elliot.\n\n[to Ana]\n\nElliot Grey: So awesome to meet you. Kate’s told me a lot about you.\n\nChristian Grey: Elliot, find your shoes. Some of us have work to attend to.\n\nElliot Grey: What are you doing with Mr. Warmth here, I have no idea.\n\n[Ana smiles]\n\n[Ana and Christian watch uncomfortably as Elliot kisses Kate goodbye]\n\nElliot Grey: Laters, baby.\n\n[Elliot walks out of the apartment; to Ana]\n\nChristian Grey: I’ll see you tonight. Email me if something changes.\n\nAnastasia Steele: My computer’s broken.\n\nChristian Grey: Well call then, you know you have my number.\n\n[he touches her face]\n\nChristian Grey: Laters, baby.\n\n[Christian leaves]\n\nAnastasia Steele: Elliot seems really nice.\n\n[Ana laughs]\n\nKate: No, no. We’re starting with you. If you’re seeing him again tonight, that means that something happened. Ana?\n\n[Ana avoids answering and starts to walk away]\n\nAnastasia Steele: I have to get ready for work.\n\n[they both laugh]\n\nAnastasia Steele: We just kissed. Once.\n\nKate: Only once? That’s odd.\n\nAnastasia Steele: Mm. Odd doesn’t even cover it.\n\nKate: Uh-huh.\n\n[Ana turns and starts walking to her room]\n\nKate: And a new jacket. Hm.\n\n[after finishing work, Ana walks out of the store to see Taylor waiting for her]\n\nAnastasia Steele: Hi. It’s Taylor, right?\n\nTaylor: Good evening, Miss Steele. Mr. Grey will be joining us there.\n\n[he takes Ana to meet Christian on the roof of a building standing next to his helicopter]\n\nChristian Grey: Good evening, Anastasia.\n\n[he opens the helicopter door for Ana and she gets in, Christian takes the pilot’s seat]\n\nAnastasia Steele: Are you flying this?\n\n[Christian straps the seat belts around her]\n\nChristian Grey: No escaping now.\n\n[into the radio as he gets ready to take off]\n\nChristian Grey: November 1-2-2-4. Charlie Tango. Ready to depart.\n\nControl Center: Roger that, Charlie Tango. Your flight plan from Portland to Seattle is cleared.\n\nChristian Grey: Seattle? That’s where we’re going?\n\n[Ana smiles as they take off and Christian flies them to Seattle]\n\n[Christian takes Ana his apartment in Seattle]\n\nChristian Grey: Would you like a drink?\n\nAnastasia Steele: Yes, please.\n\n[Christian goes to get her a drink, Ana is shocked at the expensive looking apartment]\n\nAnastasia Steele: Wow.\n\n[she walks over to the piano]\n\nAnastasia Steele: Do you play?\n\nChristian Grey: Yes.\n\n[Ana chuckles to herself]\n\nAnastasia Steele: Of course you do.\n\n[referring to the piece of paper on the table]\n\nAnastasia Steele: What’s this?\n\nChristian Grey: It’s a non-disclosure agreement. It means that you cannot discuss anything about us with anyone. I’m afraid my lawyer insists on it.\n\nAnastasia Steele: I’d never talk to anyone about us anyway.\n\n[Ana signs the agreement]\n\nAnastasia Steele: Are you going to make love to me now?\n\nChristian Grey: Two things: First, I don’t make love. I fuck, hard.\n\nAnastasia Steele: And the second thing?\n\nChristian Grey: Come.\n\n[he holds out his hand for Ana to take]\n\n[Christian escorts Ana towards a room]\n\nChristian Grey: It’s just around this door.\n\nAnastasia Steele: What is?\n\nChristian Grey: My playroom.\n\nAnastasia Steele: Like your Xbox and stuff?\n\nChristian Grey: It’s important that you know that you can leave at any time.\n\nAnastasia Steele: Why? What’s in there?\n\nChristian Grey: I meant what I said. The helicopter is on standby to take you whenever you want to go.\n\nAnastasia Steele: Christian, just open the door.\n\n[he unlocks the door, as they step inside Ana is visibly shocked at what she sees]\n\nAnastasia Steele: Oh, my God.\n\n[the room is filled with BDSM stuff like ropes, chains, whips and floggers]\n\n[Ana touches one of the floggers]\n\nChristian Grey: It’s called a flogger.\n\n[Ana walks silently to touch another item]\n\nChristian Grey: Say something, please.\n\nAnastasia Steele: Do women do this to you or do you…?\n\nChristian Grey: I do this to women. With women. Women who want me to.\n\nAnastasia Steele: You’re a sadist?\n\nChristian Grey: I’m a dominant.\n\nAnastasia Steele: What does that mean?\n\nChristian Grey: It means I want you to willingly surrender yourself to me.\n\nAnastasia Steele: Why would I do that?\n\nChristian Grey: To please me.\n\nAnastasia Steele: To please you? How?\n\nChristian Grey: I have rules, if you follow them, I’ll reward you. If you don’t, I’ll punish you.\n\nAnastasia Steele: You’d punish me, like you’d use this stuff on me?\n\nChristian Grey: Yes.\n\nAnastasia Steele: What would I get out of this?\n\nChristian Grey: Me.\n\n[Christian escorts Ana to another room]\n\nChristian Grey: If we were to do this, this would be your room. You can decorate it however you like.\n\nAnastasia Steele: You want me to move in?\n\nChristian Grey: Not full-time, just Friday through to Sunday. We can negotiate the particulars.\n\nAnastasia Steele: So, I, so, I’d sleep in here with you?\n\nChristian Grey: No, I’d be downstairs. I told you I don’t sleep with anyone.\n\n[Christian escorts Ana downstairs]\n\nAnastasia Steele: What if I don’t want anything to do with that?\n\nChristian Grey: I would understand completely.\n\nAnastasia Steele: But then we wouldn’t have any sort of relationship at all?\n\nChristian Grey: This is the only sort of relationship I have.\n\nAnastasia Steele: Why?\n\nChristian Grey: It’s the way I am.\n\nAnastasia Steele: When you said negotiate, what did you mean?\n\nChristian Grey: I already have a contract prepared. It’s fairly detailed. You would review it and we would negotiate what you are and are not willing to try.\n\nAnastasia Steele: How could I know what I’d be willing to try?\n\nChristian Grey: Well when you’ve had sex, was there anything you didn’t like doing? We have to be honest with each other for this to work, okay?\n\n[Ana down in embarrassment]\n\nAnastasia Steele: I wouldn’t know.\n\nChristian Grey: What do you mean?\n\nAnastasia Steele: Because I haven’t, I haven’t…\n\nChristian Grey: You’re still a virgin? I’ve just shown you…\n\nAnastasia Steele: I know, I just…\n\nChristian Grey: You’ve done other things, right?\n\nAnastasia Steele: No.\n\n[Christian touches her face tenderly]\n\nChristian Grey: Where have you been?\n\nAnastasia Steele: Waiting.\n\nChristian Grey: Men must throw themselves at you.\n\nAnastasia Steele: Never what I’ve wanted.\n\n[Ana looks down, biting on her lip]\n\nChristian Grey: You’re biting your lip.\n\n[he kisses her]\n\nAnastasia Steele: What are you doing?\n\nChristian Grey: Rectifying the situation.\n\nAnastasia Steele: I’m a situation?\n\n[he takes Ana to his bedroom, slowly undresses, kisses her and proceeds to have sex with her; later Ana wakes when she hears Christian playing the piano downstairs, Ana goes over to him, they start kissing, he picks her up and takes her back to the bedroom]\n\n[the next morning Christian walks in on Ana dancing as she fixes breakfast, startling her]\n\nChristian Grey: You’re energetic this morning.\n\nAnastasia Steele: You hungry?\n\nChristian Grey: Very.\n\n[Ana smiles]\n\nAnastasia Steele: Cause I’m making pancakes.\n\n[after eating breakfast Christian kisses Ana’s hand]\n\nChristian Grey: Let’s get you cleaned up.\n\n[in the bathroom Ana shyly undresses and they have a bath together]\n\n[after bathing together Christian kisses Ana]\n\nChristian Grey: Do you trust me?\n\n[Christian removes the towel from Ana’s body and let’s down her hair]\n\nChristian Grey: Stay here.\n\n[he goes to his closet and gets one of his ties]\n\nChristian Grey: Hold out your wrists.\n\n[Ana holds out her wrists, Christian ties them together with his tie then drops her onto his bed, with her arms above her head as he lies on top of her]\n\nChristian Grey: Hold them there, understand?\n\n[Ana smiles at him]\n\nChristian Grey: Tell me you understand.\n\nAnastasia Steele: I won’t move my arms.\n\nChristian Grey: Good girl.\n\n[as Christian moves gently down her body, Ana moves her arms but Christian quickly pushes them over head again]\n\nChristian Grey: Stay still.\n\nAnastasia Steele: Okay.\n\n[Christian moves down her body again]\n\nChristian Grey: Say yes.\n\nAnastasia Steele: To what?\n\nChristian Grey: To being mine.\n\n[just as he’s about to go down on her Christian’s adoptive mother, Grace, calls out]\n\nMrs. Grey: Christian!\n\nChristian Grey: Shit. It’s my mother.\n\n[Ana starts to laugh as Christian starts to untie her wrists]\n\nAnastasia Steele: I’m naked.\n\nChristian Grey: Get dressed.\n\n[downstairs in Christian’s apartment Taylor is with Mrs. Grey]\n\nMrs. Grey: Taylor, there’s no need to show me around. And there’s no need to hover.\n\nTaylor: He’s still sleeping, Dr. Grey.\n\nMrs. Grey: He’s still sleeping? But he never sleeps in. Certainly not at this hour. Unless of course he’s ill is he?\n\n[just then Christian walks in]\n\nMrs. Grey: Ah.\n\nTaylor: Sorry, Mr. Grey.\n\nChristian Grey: It’s fine, I know how she can be.\n\n[he kisses Mrs. Grey’s cheeks]\n\nMrs. Grey: She? Oh, well if you’re trying to avoid me, the very least you can do is call me by my correct name, which would be “mama.”\n\n[Ana joins Mrs. Grey and Christian]\n\nAnastasia Steele: Hi.\n\nMrs. Grey: Oh, dear God.\n\nChristian Grey: Mother, Anastasia Steele. Ana, meet my mother. Dr. Grace Trevelyan Grey.\n\n[Ana and Mrs. Grey shake hands]\n\nMrs. Grey: You have no idea how delighted I am to meet you.\n\nAnastasia Steele: It’s nice to meet you too, Dr. Grey.\n\nMrs. Grey: Grace. She’s very pretty. You are very pretty.\n\nAnastasia Steele: Thank you.\n\nChristian Grey: What happened to calling before dropping by?\n\nMrs. Grey: Oh, and have your henchman give me the run around? No, thank you. I’ll take my chances. Well, I was in the neighborhood and I thought perhaps we could have lunch.\n\nChristian Grey: I can’t today, I have to drive Ana home.\n\n[just then Ana’s phone rings]\n\nChristian Grey: It’s okay, take it. I was just showing mother out.\n\nAnastasia Steele: Excuse me.\n\n[Ana rushes to answer her phone]\n\nMrs. Grey: Anastasia!\n\n[Ana answers her phone]\n\nAnastasia Steele: Kate, hold on.\n\n[Ana faces Mrs. Grey]\n\nMrs. Grey: It was a joy to meet you. And I’m having the whole family for dinner next week at my house. Christian’s sister Mia is back from Paris, you must come.\n\nChristian Grey: We’ll see mother.\n\n[Christian escorts his mother to the elevator]\n\nAnastasia Steele: Nice to meet you.\n\nMrs. Grey: You too.\n\n[Christian kisses Mrs. Grey goodbye as she steps into the elevator with Taylor]\n\nMrs. Grey: Thank you.\n\n[upstairs Ana talks on the phone with Kate]\n\nAnastasia Steele: I can’t talk about it right now, Kate.\n\n[she walks into the bedroom he showed her last night]\n\nAnastasia Steele: I got to go. I’ll call you back, okay?\n\n[Ana ends the call, walks into the room and sits on the bed]\n\nChristian Grey: Everything okay with the phone call?\n\nAnastasia Steele: Yeah, nothing important. I liked your mom.\n\nChristian Grey: She’s excited. She’s never seen me with a woman before. You’re the first.\n\nChristian Grey: What is it Ana?\n\nAnastasia Steele: Um, I just, how many women have stayed in here?\n\nChristian Grey: Fifteen.\n\nAnastasia Steele: That’s a lot of women.\n\nChristian Grey: I told you before, if you want out…\n\nAnastasia Steele: I don’t want out. I’m just, I’m not exactly jumping at the opportunity to get whipped and tortured in your red room of pain.\n\nChristian Grey: The room is much more about pleasure. I promise you.\n\nAnastasia Steele: Would we still go out to dinner, and movies and…?\n\nChristian Grey: That’s not really my thing. Try to keep an open mind.\n\nChristian Grey: If you agree to be my submissive, I will be devoted to you. This is what I want. I want it with you.\n\nAnastasia Steele: Why do I have to sleep in here? We slept in the same bed last night, like normal people.\n\nChristian Grey: Try not to get hung up on the sleeping arrangements. If you agree to do this, you’re going to want your own room.\n\nAnastasia Steele: Why, cause I’ll be your sex slave?\n\nChristian Grey: I don’t want to do this here, let’s talk downstairs.\n\nAnastasia Steele: No. You know what, I think I’ll hold on to my freewill a little while longer, thank you. Actually, you know what? I would like to go home, can I go home?\n\n[referring to the cars as they walk through the basement car park]\n\nAnastasia Steele: Which one’s yours?\n\nChristian Grey: All of them.\n\n[Christian drives them to the woods and wakes up Ana from her nap]\n\nChristian Grey: Let’s go for a walk.\n\n[as they walk in the woods]\n\nAnastasia Steele: How did you start doing this?\n\nChristian Grey: One of my mother’s friends. I was fifteen.\n\nAnastasia Steele: She seduced you?\n\nChristian Grey: I was her submissive for six years.\n\nAnastasia Steele: Seriously? Does your mother know that?\n\nChristian Grey: Of course not. No one in my family knows about this part of me.\n\nAnastasia Steele: So she introduced you to all this? Mrs. Robinson?\n\nChristian Grey: Mrs. Robinson. I’ll tell her you said that, she’ll love it.\n\nAnastasia Steele: You still talk to her?\n\nChristian Grey: On occasions. We’re friends.\n\nTotal Quotes: 127", "images": ["https://www.moviequotesandmore.com/wp-content/uploads/MQM-Logo-2.png", "https://www.moviequotesandmore.com/wp-content/uploads/jojo-rabbit-1.jpg", "https://www.moviequotesandmore.com/wp-content/uploads/fifty-shades-of-grey-2.jpg"], "top_img": "https://www.moviequotesandmore.com/wp-content/uploads/fifty-shades-of-grey-2.jpg", "keywords": [], "authors": ["Parissa Janaraghi"], "canonical_link": "https://www.moviequotesandmore.com/fifty-shades-of-grey-quotes/", "title": "Fifty Shades of Grey Quotes – ‘I exercise control in all things, Miss Steele.’", "meta_data": {"description": "Best quotes from erotic romantic drama, Fifty Shades of Grey, starring Dakota Johnson, Jamie Dornan, Jennifer Ehle, Eloise Mumford, Victor Rasuk, Luke Grimes, Marcia Gay Harden, Rita Ora...", "generator": "WordPress 5.4", "viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0", "msapplication-TileImage": "https://www.moviequotesandmore.com/wp-content/uploads/cropped-favicon-2-270x270.png", "og": {"locale": "en_US", "site_name": "MovieQuotesandMore", "title": "Fifty Shades of Grey Quotes - 'I exercise control in all things, Miss Steele.'", "url": "https://www.moviequotesandmore.com/fifty-shades-of-grey-quotes/", "type": "article", "description": "Erotic romantic drama directed by Sam Taylor-Johnson, based on the novel by E. L. James. The story centers on literature...", "image": {"identifier": "https://www.moviequotesandmore.com/wp-content/uploads/fifty-shades-of-grey-2.jpg", "url": "https://www.moviequotesandmore.com/wp-content/uploads/fifty-shades-of-grey-2.jpg", "secure_url": "https://www.moviequotesandmore.com/wp-content/uploads/fifty-shades-of-grey-2.jpg"}, "updated_time": "2019-06-21T17:03:02+01:00"}, "article": {"published_time": "2019-03-26T18:47:05+00:00", "modified_time": "2019-06-21T17:03:02+01:00", "section": "Movie Quotes", "publisher": "https://www.facebook.com/moviequotesandmore"}, "twitter": {"title": "Fifty Shades of Grey Quotes - 'I exercise control in all things, Miss Steele.'", "url": "https://www.moviequotesandmore.com/fifty-shades-of-grey-quotes/", "description": "Erotic romantic drama directed by Sam Taylor-Johnson, based on the novel by E. L. James. The story centers on literature...", "image": "https://www.moviequotesandmore.com/wp-content/uploads/fifty-shades-of-grey-2.jpg", "card": "summary_large_image", "site": "@MovieQuotesMore"}, "norton-safeweb-site-verification": "g8v1e9s-s0onzwsrmg5ce1qxoxq66hd-8pz0gji0xypequbl908ypqh593ihlqhn4dof8odwuzx5d6jhw68xmpj5fyp8dbz96q5iztbgur03qn5r73lxag-u6y8i2bjk"}, "movies": [], "publish_date": 1553626025.0, "source": "https://www.moviequotesandmore.com", "summary": ""}