{"url": "https://www.usatoday.com/story/life/2018/07/13/trumps-meet-queen-elizabeth-ii-treated-royal-pomp-pageantry-and-tea/782250002/", "text": "WINDSOR, England — President Donald Trump and first lady Melania Trump arrived at Windsor Castle Friday evening outside London to meet Queen Elizabeth II and be treated to the kind of royal pomp-and-ceremony the president loves and the British love staging.\n\nThe presidential couple arrived at the massive 900-plus-year-old fortress just miles west of London at about 5 p.m. local time, and shook hands with Her Majesty, 92, who was meeting her 12th sitting president and the fourth she has hosted at her weekend residence since the 1980s.\n\nThe first lady, her hair up in a low chignon, wore a conservative pale pink Dior skirt suit with a narrow belt and a high collar.\n\nThe queen wore her usual royal outfit, a periwinkle blue coat over a patterned blue-and-yellow dress with a matching blue hat, plus white gloves, sensible black shoes and her ever-present black handbag.\n\nHer husband, Prince Philip, 97, has retired from public life and was not there.\n\nThe weather was cooperative: The temperature was 79 degrees, with the sun peeking though a partly cloudy light blue sky.\n\nThe Trumps, who had arrived via Marine One landing on the grass east of the castle, were driven into the castle Quadrangle and greeted the queen. Then they stood under a covered dais as a Coldstream Guard of Honor played the U.S. national anthem. The Trumps stood with hands over hearts; the queen with her white-gloved hands folded.\n\nAs per usual in a royal welcoming ceremony, the monarch and the president inspected the Guard of Honor as a medley of U.S. service hymns were played. The diminutive monarch and the tall president walked slowly past each file three ranks deep, then watched scarlet-clad troops in bearskin hats march around the Quadrangle.\n\nAlthough reporters couldn't hear what they said, the queen and the Trumps were seen to have exchanged some remarks during the ceremonies, and at one point Her Majesty and Melania Trump exchanged warm smiles.\n\nAbout 10 minutes after the Trumps arrived, they went inside the castle (which has about 1,000 rooms and occupies 13 acres) to join the queen for tea. The palace did not release details about which room or what was served, but later a picture of the three of them posing in the Grand Corridor of the castle was released.\n\nThe royal handshakes followed the president's meeting earlier Friday with Prime Minister Theresa May at Chequers, the PM's country retreat.\n\nAlso earlier, Melania Trump, dressed in a Victoria Beckham dress of boldly colorful stripes, visited the Royal Chelsea Hospital in London where she tried her hand at bowls with aging British Army veterans.\n\nMeanwhile, at almost exactly the same time as the pageantry in Windsor unfolded, back in Washington Deputy Attorney General Rod Rosenstein announced charges against 12 Russian intelligence officers for hacking offenses during the 2016 presidential election. The indictments are part of the ongoing special counsel probe into potential coordination between the Trump campaign and Russia – a probe regularly denounced by the president.\n\nThe meeting between the Trumps and the queen took place against a backdrop of the president's critical comments about Prime Minister Theresa May and London Mayor Sadiq Khan, the teetering Tory government, its ongoing infighting over Brexit and Trump's own suggestions to May about how to achieve the divorce from the European Union.\n\nBut he had nothing but gushing praise for the queen in his headline-making interview Friday with The Sun, Britain's largest-circulation newspaper owned by Trump's media mogul pal, Rupert Murdoch.\n\nTrump described the queen as “a tremendous woman” in the interview.\n\n\"I really look forward to meeting her. I think she represents her country so well,\" Trump said. “If you think of it, for so many years she has represented her country, she has really never made a mistake. You don’t see, like, anything embarrassing. She is just an incredible woman.\"\n\nThe queen hosts multiple foreign dignitaries every week, though usually at her working residence at Buckingham Palace in London. But an audience between the United Kingdom's head of state with the head of state of Britain's closest ally is considered crucial for both sides.\n\nCertainly, President Trump was keen on it, according to the U.S. ambassador to Britain speaking the week before the Trumps arrived. Doing it at Windsor also had advantages in that it got him out of London where massive anti-Trump demonstrations are taking place, complete with a giant Trump \"baby\" blimp balloon aimed at mocking him.\n\nNo such derision will be heard from Her Majesty.\n\nUnder the British constitutional monarchy, the figurehead monarch is \"above\" politics, and the queen has been scrupulous during her 66-year reign in keeping her opinions to herself, no matter the controversies swirling around whoever is presented to her.\n\nThus, the times when her views do become known are rare and memorable, as when she was overheard at a 2016 garden party criticizing Chinese officials for being \"very rude\" during a state visit to Britain by President Xi Jinping the year before. Her remark was huge news because it was unprecedented, uncharacteristic and undiplomatic.\n\nAlthough there were advance calls in Britain from some quarters to cancel the meeting between the queen and the Trumps, that was never going to happen. When it comes to these meetings, the monarch follows the instructions from the government of the day.\n\nMay was the one who issued the invitation to Trump when she met him at the White House soon after he took office. Initially, it was supposed to be a \"state visit\" featuring even more elaborate ceremony, but that was later downgraded to an audience as it became clearer that Trump's presence in London would be less than welcome.\n\nInstead, an elaborate banquet was staged Thursday night by May when she hosted the Trumps at a black-tie dinner with British business leaders at Blenheim Palace, the home of the Dukes of Marlborough in Oxfordshire west of London where Winston Churchill was born.\n\nThe teatime meeting with the queen lasted less then an hour; afterwards, the Trumps were scheduled to depart for a weekend in Scotland where the half-Scots president (on his mother's side) owns two golf courses.\n\nNext week, they will travel to Finland where the president will meet Russian President Vladimir Putin at a summit in Helsinki on Monday.", "images": ["https://www.gannett-cdn.com/-mm-/b7f7362251e9c98cca7c5d99f2c021f693dd7d40/c=1618-756-4328-2287/local/-/media/2018/07/13/USATODAY/USATODAY/636670869442637544-AFP-AFP-17K94N.jpg?width=660&height=373&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/b7f7362251e9c98cca7c5d99f2c021f693dd7d40/c=1618-756-4328-2287/local/-/media/2018/07/13/USATODAY/USATODAY/636670869442637544-AFP-AFP-17K94N.jpg?width=2710&height=1531&fit=crop&format=pjpg&auto=webp", "http://www.gannett-cdn.com/-mm-/394666748ca0c0b3076b36aea47453e49595fb26/c=0-123-4678-2766&r=1280x720/local/-/media/2018/07/13/USATODAY/USATODAY/636670864463021784-AP-Britain-Trump-Visit.1.jpg?width=660&height=372&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/b7f7362251e9c98cca7c5d99f2c021f693dd7d40/c=1618-756-4328-2287/local/-/media/2018/07/13/USATODAY/USATODAY/636670869442637544-AFP-AFP-17K94N.jpg?width=2710&height=1531&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/2018/07/13/trumps-meet-queen-elizabeth-ii-treated-royal-pomp-pageantry-and-tea/782250002/", "title": "Trumps meet Queen Elizabeth II, treated to royal pomp, pageantry and tea", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Trumps meet Queen Elizabeth II, treated to royal pomp, pageantry and tea", "description": "The Trumps meet Queen Elizabeth II at her massive castle hours after President Trump described the 92-year-old monarch as a \"tremendous' and \"incredible\" woman.", "url": "https://www.usatoday.com/story/life/2018/07/13/trumps-meet-queen-elizabeth-ii-treated-royal-pomp-pageantry-and-tea/782250002/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/b7f7362251e9c98cca7c5d99f2c021f693dd7d40/c=1618-756-4328-2287/local/-/media/2018/07/13/USATODAY/USATODAY/636670869442637544-AFP-AFP-17K94N.jpg?width=2710&height=1531&fit=crop&format=pjpg&auto=webp", "width": 2710, "height": 1531}, "type": "article"}, "article": {"author": "Maria Puente and Gregory Korte", "content_tier": "free", "opinion": "false"}, "description": "The Trumps meet Queen Elizabeth II at her massive castle hours after President Trump described the 92-year-old monarch as a \"tremendous' and \"incredible\" woman.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/b7f7362251e9c98cca7c5d99f2c021f693dd7d40/c=1618-756-4328-2287/local/-/media/2018/07/13/USATODAY/USATODAY/636670869442637544-AFP-AFP-17K94N.jpg?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Trumps meet Queen Elizabeth II, treated to royal pomp, pageantry and tea", "description": "The Trumps meet Queen Elizabeth II at her massive castle hours after President Trump described the 92-year-old monarch as a \"tremendous' and \"incredible\" woman."}}, "movies": [], "publish_date": 1531411200.0, "source": "https://www.usatoday.com", "summary": ""}