{"url": "https://www.elitedaily.com/p/the-new-venom-trailer-finally-shows-tom-hardy-fully-transformed-omg-9951210", "text": "When Sony agreed to make a deal allowing the rights to Spider-Man extend to the Marvel Cinematic Universe, owned by rival Disney, they only signed over the Spider-Man character, not the Spiderverse. So though Spider-Man: Far From Home will be a co-production with the MCU, Sony still can make standalone superhero films of its own. The first, Venom, is heading into theaters this coming October, with Tom Hardy starring as the anti-hero lead. How does a superhero movie work with the villain as the protagonist? The new Venom trailer takes a deep dive into the monster hiding inside.\n\nFor those who have been trying to keep track of which Spider-Man character is which, Sony has introduced Venom before, about two rebooted Spideys ago, in the Toby McGuire-era Spider-Man 3. There, he was played by Topher Grace, who looked enough like McGuire to be his evil nemesis semi-doppelganger.\n\nSince then Sony rebooted Spider-Man twice, once by itself with Andrew Garfield, and now a second time with the MCU and Tom Holland. It makes a sort of twisted sense it can reboot villains too, and even make them the hero of their own story.\n\nCheck out the trailer and the symbiote who takes over star Tom Hardy's character, reporter Eddie Brock and turns him (them?) into Venom.\n\nSony Pictures Entertainment on YouTube\n\nIt's a clever angle in a movie landscape where the MCU releases no less than three superhero movies a year, and 20th Century FOX has their own schedule of X-Men and X-Men spin-off films. (At least, they do until the Disney-FOX merger is completed in 2019, and probably for another year or two after as the two companies sort things out.) That's not to say the market is saturated yet, but the tagline \"The World Has Enough Superheroes\" is both a smart one for the film, with the benefit of also being correct in 2018.\n\nThere's a good way to take a villain and turn him into the protagonist: set him up against someone even worse. Brock doesn't mean to be terrible, he just has a parasite he's currently self-medicating. Compare to Riz Ahmed's character, who's company Brock is investigating when the film begins. He embraces everything evil about the symbiote he's joined with and happily joins others with the alien parasite without so much as a by-your-leave. Ahmed's evil antagonist is still unnamed, but fans are guessing will turn out to be Carlton Drake, the evil head of the Life Foundation.\n\nSony Pictures Entertainment on YouTube\n\nThis new trailer also gives us a look at Brock's love interest, Ann Weying, played by Michelle Williams. The movie also stars Jenny Slate and Woody Harrelson, as well as Reid Scott, Scott Haze, and Kelly Marcel.\n\nAs for whether Tom Holland will be eventually showing up in a Venom sequel, that's still up in the air. The MCU doesn't currently think the co-production characters should mix with Sony's stand-alone films. (Considering how confusing having three different studios making three different Marvelverse series is already, this is understandable.) But no one should ever say never. If Venom turns out to be a massive hit, Holland's Spider-Man might just find himself dropping in.\n\nVenom arrives in theaters on October 5, 2018.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/image/2020/4/14/656ef444-3f0d-4f32-bcf9-dd8b2fd5643a-wf_unit_02465.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/7/31/20746489-8d93-4cf1-9d92-8a9cc89832cc-r4d7nhyvon3phsqfzjkj.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2020/4/15/d649de75-52b5-4afc-a566-b7c60bc47b7d-1544493357930.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/7/31/20746489-8d93-4cf1-9d92-8a9cc89832cc-r4d7nhyvon3phsqfzjkj.png?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/15/c56da371-d3f8-401f-82e9-7e36b9e0e518-getty-1205151618.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/uploads/image/2018/7/31/20746489-8d93-4cf1-9d92-8a9cc89832cc-r4d7nhyvon3phsqfzjkj.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/the-new-venom-trailer-finally-shows-tom-hardy-fully-transformed-omg-9951210", "title": "The New 'Venom' Trailer Finally Shows Tom Hardy Fully Transformed & OMG", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/the-new-venom-trailer-finally-shows-tom-hardy-fully-transformed-omg-9951210", "type": "article", "title": "The New 'Venom' Trailer Finally Shows Tom Hardy Fully Transform & OMG", "description": "When Sony agreed to make a deal allowing the rights to Spider-Man extend to the Marvel Cinematic Universe, owned by rival Disney, they only signed over the Spider-Man character, not the Spiderverse. So though Spider-Man: Far From Home will be a…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/7/31/20746489-8d93-4cf1-9d92-8a9cc89832cc-r4d7nhyvon3phsqfzjkj.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "When Sony agreed to make a deal allowing the rights to Spider-Man extend to the Marvel Cinematic Universe, owned by rival Disney, they only signed over the Spider-Man character, not the Spiderverse. So though Spider-Man: Far From Home will be a…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}