{"url": "https://web.archive.org/web/20181219233043/https://screenrant.com/orville-fox-seth-macfarlane-season-2-merchandise-holidays/", "text": "It’s the time of year for people to exchange shiny trinkets and baubles with one another, and just in time, The Orville has a line of merchandise inspired by the show for those last-minute gift givers or super-fans looking to treat themselves. Season 2 of the Star Trek-inspired sci-fi sorta-comedy from Seth MacFarlane is headed to FOX just before 2018 calls it a day, and the folks from NECA, Rizolli, Ripple Junction, Titan, Kidrobot, Dark Horse, Rittenhouse (not the evil organization from NBC’s Timeless) and Think Geek are ready with a ton of merchandise to help mark the occasion.\n\nThe Orville is full of otherworldly possibilities when it comes to merch, but the abovementioned companies have mostly kept things terrestrial in design, with a variety of T-shirts and coffee mugs emblazoned with the show’s logo or versions of the badges worn by various members of the crew — Engineer, Security, Medical, etc. Meanwhile, for those who don’t necessarily want to wear their love for the show, there are plenty of toys and other collectibles ready to eat up some shelf space in your home.\n\nOne of the more interesting offerings from The Orville Catalog of Stuff is The World of the Orville book from Titan, which delivers a look behind the scenes of the series, and offers a glimpse at some of the concept art from the show, so curious fans can see what went into bringing the series to life. Check out the EXCLUSIVE full list of The Orville-inspired merchandise below:\n\n“Emblazed with the Engineer, Medical, Officer, Science and Security logo, the metal prop replica badges from Kidrobot were first revealed at 2018 New York Comic Con -- and are now exclusively available only at the official Fox Shop Fans of “The Orville” will be treated to the first-ever collector’s edition of The Orville Season One Trading Cards -- available in early 2019. Fans will have the option to purchase cards by the pack or the 24-pack box from Rittenhouse. This first-edition card collection will be a must-have for fans of “The Orville,” as there will be 2 randomly inserted cast autograph cards in every 24-pack box. The World of The Orville (SRP $39.95) -- Now available from Titan, discover behind the scenes moments of “The Orville”. Filled with alien species, exotic worlds, futuristic technology and awe-inspiring spaceships, this lavish companion to “The Orville” takes you behind the scenes through concept art, on-set photography and technical schematics to explore the show’s production design, costumes, makeup prosthetics and visual effects. This is the ultimate guide to this new space-faring epic adventure.\n\nFox Consumer Products teams with key retail partners GameStop and Think Geek! to offer unique T-shirt designs celebrating “The Orville” from Ripple Junction. The Orville Krill Symbols Tee, The Orville Planetary Union Tee, and The Orville Ship Tee (SRP: $14.99) are now available at Think Geek! Plus, a wide selection of T-shirts are coming soon to GameStop. Compliments of NECA, soon you can own a set of “The Orville” HeroClix Starter Set (SRP $29.99), coming in February 2019.\n\nThe latest collaboration with Rizolli offers fans “The Orville” 2019 Calendar (SRP: $14.99), celebrating moments from the hit premiere season of the FOX series. The calendar, available now, features photos of all the series stars, including Seth MacFarlane as the ship’s Commanding Officer, Adrianne Palicki as his ex-wife, who’s assigned as his First Officer, and their fellow crew members Penny Johnson Jerald, Scott Grimes, Peter Macon, Halston Sage, J. Lee, Mark Jackson and Chad L. Coleman. And coming soon, stay tuned for details of “The Orville” Season 1.5 from Dark Horse Comics which launches in 2019.”\n\nWhether as a last-minute gift, proof of your own super-fandom, or just an overwhelming fear that extra money will literally burn a hole in your pocket, there’s probably something of interest in this lineup of The Orville-inspired merchandise.\n\nThe Orville season 2 premieres Sunday, December 30 @8pm on FOX.\n\nThe Mandalorian Reportedly Features Classic Star Wars Bounty Hunters", "images": ["https://web.archive.org/web/20181219233043im_/https://www.facebook.com/tr?id=297467373958238&ev=PageView&noscript=1", "https://web.archive.org/web/20181219233043im_/https://screenrant.com/public/build/images/tt-logo-full-white.04a6f0d4.svg", "https://web.archive.org/web/20181219233043im_/https://screenrant.com/public/build/images/cb-logo-full-white.afca2e29.svg", "https://web.archive.org/web/20181219233043im_/https://screenrant.com/public/build/images/tv-logo-full-white.642d3d01.svg", "https://web.archive.org/web/20181219233043im_/https://screenrant.com/public/build/images/sr-logo-full-white.b0cc2b44.svg", "https://web.archive.org/web/20181219233043im_/https://screenrant.com/public/build/images/mm-logo-full-white.fe72c74c.svg", "https://web.archive.org/web/20181219233043im_/https://screenrant.com/public/build/images/th-logo-full-white.7684e614.svg", "https://web.archive.org/web/20181219233043im_/https://screenrant.com/public/build/images/ts-logo-full-white.54beb4cf.svg", "https://web.archive.org/web/20181219233043im_/https://screenrant.com/public/build/images/bg-logo-full-white.8242bbb9.svg", "https://web.archive.org/web/20181219233043im_/https://screenrant.com/public/build/images/tg-logo-full-white.fc9e742a.svg", "https://web.archive.org/web/20181219233043im_/https://static0.srcdn.com/wordpress/wp-content/uploads/2018/12/Seth-MacFarlane-and-Adrianne-Palicki-in-The-Orville.jpg", "https://web.archive.org/web/20181219233043im_/https://screenrant.com/public/build/images/tr-logo-full-white.090c581a.svg", "https://web.archive.org/web/20181219233043im_/https://screenrant.com/public/build/images/hc-logo-full-white.5f66cfe4.svg", "https://web.archive.org/web/20181219233043im_/http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1", "https://web.archive.org/web/20181219233043im_/https://screenrant.com/public/build/images/tq-logo-full-white.7436bde3.svg", "https://web.archive.org/web/20181219233043im_/https://q.quora.com/_/ad/91f52889f6a04390a65ad2591c59986e/pixel?tag=ViewContent&noscript=1"], "top_img": "https://web.archive.org/web/20181219233043im_/https://static0.srcdn.com/wordpress/wp-content/uploads/2018/12/Seth-MacFarlane-and-Adrianne-Palicki-in-The-Orville.jpg", "keywords": [], "authors": ["Becca Bleznak", "Dan Zinski", "Michael Kennedy", "Robin Burks", "Derek Stauffer"], "canonical_link": "https://web.archive.org/web/20181219233043/https://screenrant.com/orville-fox-seth-macfarlane-season-2-merchandise-holidays/", "title": "The Orville Merchandise For Last-Minute Gifts", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "description": "FOX’s Star Trek-inspired The Orville gets a line of merchandise that’ll work for a last-minute gift or for the the fan who can’t wait for season 2.", "og": {"title": "Need A Gift? Check Out The Orville's Line Of Merchandise", "type": "article", "image": {"identifier": "https://web.archive.org/web/20181219233043im_/https://static0.srcdn.com/wordpress/wp-content/uploads/2018/12/Seth-MacFarlane-and-Adrianne-Palicki-in-The-Orville.jpg", "width": 2000, "height": 1000}, "url": "https://web.archive.org/web/20181219233043/https://screenrant.com/orville-fox-seth-macfarlane-season-2-merchandise-holidays/", "locale": "en_US", "description": "Even The Orville is here to sell you some shiny trinkets.", "site_name": "ScreenRant"}, "article": {"published_time": "2018-12-19T09:12:00Z", "section": "TV News"}, "fb": {"app_id": 822150531210883, "pages": 10765693196}}, "movies": [], "publish_date": 1545210720.0, "source": "https://web.archive.org", "summary": ""}