{"url": "www.southernliving.com/culture/celebrities/tim-mcgraw-faith-hill-love-story", "text": "Image zoom Jeff Kravitz/ACMA2017/Getty Images\n\nTim McGraw and Faith Hill have one of the most iconic love stories in country music. A true musical power couple, this Tennessee duo is incredibly strong together – as we've seen with their decades of duets and their consistently growing Soul2Soul world tour. Not to mention their ever-present, electric chemistry.\n\nBut this road to being one of our favorite couples to watch hasn't always been a straight line for Tim and Faith. Yes, they now have an exhibit at the Country Music Hall of Fame (aptly subtitled Mississippi Woman/Louisiana Man), three gorgeous daughters, and countless Grammy, CMA, ACM, and Billboard awards – but they've also experienced some detours.\n\nHowever, the end result for team McGraw-Hill is still the same: Tim and Faith love each other more than ever.\n\nTheir journey began back in 1994, when the two met backstage at a Country Radio seminar in Nashville. The sparks between them were instant – much to the chagrin of Tim's then-girlfriend, as he told Billboard in a recent cover story. \"For me, there was an intense physical attraction. I guess my girlfriend saw it in my eyes. She said, ‘I don't want you around her.'\"\n\nDuring a visit to The Bobby Bones Show in Nashville, the two talked about how they started dating. \"It took a bunch of times [of asking her out],\" Tim said. But, the \"official\" first time, as Faith describes, was something out of a Southern storybook.\n\n\"[Tim] brought me chicken and dumplings. [He] came to my house [unannounced]. He knocked on my door, and he had a bowl of homemade chicken dumplings.\"\n\n\"And cornbread!\" Tim chimed in.\n\n\"He said, 'I made these myself. They're homemade from scratch.' He had the bowl covered in aluminum foil, and he had a spoon and a fork on top of the bowl. He said, 'I didn't know if you liked to eat your dumplings with a spoon or a fork.'\"\n\n\"You make up for your inadequacies,\" Tim laughed.\n\nIn 1996, when Tim decided to ask a then-engaged Faith to open for him on his first headlining tour. Just a few months later, the country lovebirds were dueting together onstage and shared a not-so-subtle kiss. In a whirlwind romance, the two married in October 1996.\n\nAlthough the couple was seemingly meant to be, there was one part of their story that connected them very strongly – both had family backgrounds that left them searching for a missing piece of the puzzle.\n\nFor Tim, that came in the route of his famous baseball father, Tug McGraw, who denied paternity after Tim's mother became pregnant coming into her senior year of high school. With an abusive stepfather and a biological father who wouldn't acknowledge him, Tim struggled with filling that gap.\n\nFaith's search, as an adopted child, was in her \"gypsy\" spirit that didn't seem to fit in with the rest of her family. She told Billboard, \"I used to think there was some kind of conspiracy, that I must be the daughter of one of my aunts. And of course I used to dream I was Elvis' daughter. I have a great family: salt of the earth, hardworking. But I'm a gypsy at heart. I had a spirit that was completely outside what my family was. I didn't know anyone I was related to, biologically, which gives you a sense of not ­knowing who you are.\"\n\nMcGraw summed up their connection through these family issues perfectly. \"I knew I had that ­instability and dysfunction in me, from the way I grew up. And when I met Faith, I knew I needed her in my life–to keep me stable, solid and on track.\"\n\nWATCH: Tim & Faith Announced A New Joint Album\n\nAnd on track the two have stayed, even through Tim's drug and alcohol abuse in the mid-2000s. Faith gave Tim – father to Gracie, Maggie Elizabeth, and Audrey – an ultimatum. With the choice to keep his family intact, Tim shed forty pounds and started training with a martial arts master.\n\nAnd we're so glad he did. The 50-year-olds couldn't be happier as they show up hand-in-hand at award shows, post beautiful tributes to each other online, and spend time on the road together. With the announcement of their new joint album, we can only imagine what is to come for this Mississippi girl and Louisiana man.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F24%2F2017%2F10%2FGettyImages-663907914-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F24%2F2017%2F10%2FGettyImages-663907914-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F24%2F2019%2F10%2Fsenior_woman_on_sofa_with_dog_gettyimages-200572869-018-2000.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2067'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F24%2F2019%2F11%2Fchoppy-lob.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F24%2F2018%2F09%2F2561101_regio_3146_1-2000.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F24%2F2017%2F10%2FGettyImages-663907914-2000.jpg", "keywords": [], "authors": ["Abigail Wilt"], "canonical_link": "https://www.southernliving.com/culture/celebrities/tim-mcgraw-faith-hill-love-story", "title": "Tim McGraw Asked Faith Hill Out Over A Bowl Of Chicken And Dumplings", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Southern Living", "news_keywords": "Southern Living", "description": "These country music stars have one of the most iconic loves in the business – and it started over a bowl of chicken and dumplings.", "og": {"title": "Tim McGraw Asked Faith Hill Out Over A Bowl Of Chicken And Dumplings", "type": "article", "site_name": "Southern Living", "url": "https://www.southernliving.com/culture/celebrities/tim-mcgraw-faith-hill-love-story", "description": "Tim McGraw and Faith Hill have one of the most iconic love stories in country music. A true musical power couple, this Tennessee duo is&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F24%2F2017%2F10%2FGettyImages-663907914-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://www.southernliving.com/culture/celebrities/tim-mcgraw-faith-hill-love-story", "description": "These country music stars have one of the most iconic loves in the business – and it started over a bowl of chicken and dumplings.", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F24%2F2017%2F10%2FGettyImages-663907914-2000.jpg"}, "twitter": {"card": "summary", "url": "https://www.southernliving.com/culture/celebrities/tim-mcgraw-faith-hill-love-story", "title": "Tim McGraw Asked Faith Hill Out Over A Bowl Of Chicken And Dumplings", "description": "These country music stars have one of the most iconic loves in the business – and it started over a bowl of chicken and dumplings.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F24%2F2017%2F10%2FGettyImages-663907914-2000.jpg"}, "fb": {"app_id": 137828809622141, "pages": 8855481462}}, "movies": [], "publish_date": null, "source": "http://www.southernliving.com", "summary": ""}