{"url": "https://variety.com/2017/tv/news/bachelor-in-paradise-demario-jackson-lawyer-interview-1202469321/", "text": "“Bachelor In Paradise” contestant DeMario Jackson has been thrust into the spotlight ever since production was shut down on ABC’s dating series, due to allegations of “misconduct” that launched an ongoing investigation by Warner Bros. Television. Jackson is at the center of the scandal along with fellow contestant Corinne Olympios, amid tabloid reports about an inappropriate sexual encounter. Jackson broke his silence earlier this week, saying, “My character and family name has been assassinated this past week with false claims and malicious allegations.”\n\nIn an exclusive interview with Variety, Jackson’s lawyer Walter Mosley says his client has suffered because of the recent swirl of coverage.\n\n“This has caused a lot of trauma — both physical and emotional injury,” says Mosley. “It’s been difficult for DeMario and his family. He’s a celebrity for all the wrong reasons.”\n\nMosley says his focus is on clearing his client’s name, and then exploring any legal remedies. While he declined to say whether he will be taking legal action against the studio, network or Olympios, Mosley did say that a potential case may came after he views the footage from “Bachelor In Paradise,” which neither he nor Jackson have yet seen. “I have requested the tapes and I’m hoping to see the tapes next week,” he says. “The tapes are the real facts needed to vindicate DeMario’s name.”\n\nGiven the serious nature of the complaints, Mosley says he supports the investigation, but says he questions the process given that the tapes should provide a clear answer.\n\n“As a lawyer, oftentimes, you’re in a case where it’s a he-said-she-said and there are parties with conflicting stories, and every once in a while, you’re gifted with a story that the entire thing is caught on camera,” he says. “This is one of those rare occasions because they were shooting a reality television show. For 20 or 30 people to get it wrong or to miss something, for seasoned professionals over at Warner Bros. and ABC to get it wrong and for some third party who never saw the tape and who wasn’t on set at the time of the incident to make an accusation — as a lawyer, it’s like Christmas.”\n\nOlympios, who hired attorney Marty Singer earlier this week, says she has “little memory” of the night in question. “As a woman, this is my worst nightmare and it has now become my reality,” she said in a statement earlier this week. Olympios’ publicist Stan Rosenfield tells Variety, “Corinne has not seen the tapes.”\n\nMosley says he is “not at liberty” to share Jackson’s side of the story, but says “there’s no criminal investigation and we don’t fear any criminal investigation.” He wouldn’t say whether he has heard from Olympios’ camp, but said, “DeMario is not the big fish in this situation.”\n\nMosley also declined to share Jackson’s version of the night’s events, but he did challenge the timeline. He pointed to Olympios’ statement, which reads, “I am a victim and have spent the last week trying to make sense of what happened the night of June 4,” and explains that Jackson was not actually with Olympios during the “night.”\n\nAccording to Mosley, Jackson’s “very limited interaction” with her happened around 5 p.m. “That’s not at night — that’s early evening,” says Mosley. “If you read the account [in tabloids], they suggest that there were three other people who had similar hookups with Corinne throughout the night, after DeMario — none of which have been perceived like my client has, but those hookups would have happened at night.”\n\nJackson’s attorney would not say whether his client has been in touch with Olympios since the scandal broke, but says Jackson has her best interests in mind. “He has a great deal of respect for Corinne,” Mosley says. “They were as friendly as castmates could be.”\n\nBefore the “Bachelor In Paradise” scandal, Jackson was portrayed as the villain on the current season of “The Bachelorette.” A woman from his past was brought back on the show, and he was ultimately sent home.\n\nAsked if Jackson was put in a staged situation, Mosley says, “I’m sure if you asked him that, he’d say they brought a girl from my past who I never knew and had a few text messages exchanged, but they paid her to come on and say that she’s my girlfriend — she wasn’t. But that’s part of reality TV. You sign up for that, and that’s the producers’ job to find a girl that would come on and do that.”\n\nMosley would not confirm whether Jackson lost his job this week, as has been reported, but says the combination of “The Bachelorette” and “Bachelor In Paradise” has “seriously damaged” his client’s reputation, due to a series of “missteps.”\n\n“It’s been a real joy working with DeMario. He’s super smart, very witty, well educated, comes from a really great family,” Mosley says. “You might read something or see him on ‘The Bachelorette,’ but the first thing about him is that he’s just a good kid from a really good family. He has no record, has never been accused of anything like this, and no one that knows him would ever think he would be in this type of situation.”", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2017%2Ftv%2Fnews%2Fbachelor-in-paradise-demario-jackson-lawyer-interview-1202469321%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202469321&comment_count=15", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pmcvariety.files.wordpress.com/2017/06/demario-jackson-bachelor-in-paradise.jpg?w=1000", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2017/06/demario-jackson-bachelor-in-paradise.jpg?w=1000", "keywords": [], "authors": ["Elizabeth Wagmeister"], "canonical_link": "https://variety.com/2017/tv/news/bachelor-in-paradise-demario-jackson-lawyer-interview-1202469321/", "title": "‘Bachelor In Paradise’ Contestant DeMario Jackson’s Lawyer Speaks Out (EXCLUSIVE)", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Exclusive interview with DeMario Jackson's attorney Walter Mosley about \"Bachelor In Paradise\" scandal.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202469321, "author": "Elizabeth Wagmeister", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-06-16T21:15:03"}, "pmc-tag": "Bachelor in Paradise,Corinne Olympios,DeMario Jackson", "title": "‘Bachelor In Paradise’ Contestant DeMario Jackson’s Lawyer Speaks Out (EXCLUSIVE)", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "‘Bachelor In Paradise’ Contestant DeMario Jackson’s Lawyer Speaks Out (EXCLUSIVE)", "url": "https://variety.com/2017/tv/news/bachelor-in-paradise-demario-jackson-lawyer-interview-1202469321/", "description": "“Bachelor In Paradise” contestant DeMario Jackson has been thrust into the spotlight ever since production was shut down on ABC’s dating series, due to allegations of “misco…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/06/demario-jackson-bachelor-in-paradise.jpg?w=1000", "width": 1000, "height": 563, "alt": "DeMario Jackson Bachelor In Paradise"}, "locale": "en_US"}, "article": {"published_time": "2017-06-17T04:15:03+00:00", "modified_time": "2017-06-17T04:15:03+00:00"}, "twitter": {"creator": "@EWagmeister", "site": "@variety", "text": {"title": "‘Bachelor In Paradise’ Contestant DeMario Jackson’s Lawyer Speaks Out (EXCLUSIVE)"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/06/demario-jackson-bachelor-in-paradise.jpg?w=1000", "alt": "DeMario Jackson Bachelor In Paradise"}, "card": "summary_large_image", "title": "‘Bachelor In Paradise’ Contestant DeMario Jackson’s Lawyer Speaks Out (EXCLUSIVE)", "description": "Exclusive interview with DeMario Jackson's attorney Walter Mosley about \"Bachelor In Paradise\" scandal."}, "author": "Elizabeth Wagmeister", "content_type": "Article", "post_id": 1202469321, "title": "'Bachelor In Paradise' Contestant DeMario Jackson's Lawyer Speaks Out (EXCLUSIVE)", "published_at": "2017-06-16 21:15:03", "image": "https://pmcvariety.files.wordpress.com/2017/06/demario-jackson-bachelor-in-paradise.jpg?w=1000", "comment_count": 15, "tags": "DeMario Jackson", "topics": "News", "appeared_in_print": "No", "body": "\"Bachelor In Paradise\" contestant DeMario Jackson has been thrust into the spotlight ever since production was shut down on ABC's dating series, due to allegations of \"misconduct\" that launched an ongoing investigation by Warner Bros. Television. Jackson is at the center of the scandal along with fellow contestant Corinne Olympios, amid tabloid reports about an inappropriate sexual encounter. Jackson broke his silence earlier this week, saying, \"My character and family name has been assassinated this past week with false claims and malicious allegations.\"\r\n\r\nIn an exclusive interview with Variety, Jackson's lawyer Walter Mosley says his client has suffered because of the recent swirl of coverage.\r\n\r\n\"This has caused a lot of trauma -- both physical and emotional injury,\" says Mosley. \"It's been difficult for DeMario and his family. He's a celebrity for all the wrong reasons.\"\r\n\r\nMosley says his focus is on clearing his client's name, and then exploring any legal remedies. While he declined to say whether he will be taking legal action against the studio, network or Olympios, Mosley did say that a potential case may came after he views the footage from \"Bachelor In Paradise,\" which neither he nor Jackson have yet seen. \"I have requested the tapes and I'm hoping to see the tapes next week,\" he says. \"The tapes are the real facts needed to vindicate DeMario's name.\"\r\n\r\n\r\n\r\nGiven the serious nature of the complaints, Mosley says he supports the investigation, but says he questions the process given that the tapes should provide a clear answer.\r\n\r\n\"As a lawyer, oftentimes, you're in a case where it's a he-said-she-said and there are parties with conflicting stories, and every once in a while, you're gifted with a story that the entire thing is caught on camera,\" he says. \"This is one of those rare occasions because they were shooting a reality television show. For 20 or 30 people to get it wrong or to miss something, for seasoned professionals over at Warner Bros. and ABC to get it wrong and for some third party who never saw the tape and who wasn't on set at the time of the incident to make an accusation — as a lawyer, it's like Christmas.\"\r\n\r\nOlympios, who hired attorney Marty Singer earlier this week, says she has \"little memory\" of the night in question. \"As a woman, this is my worst nightmare and it has now become my reality,\" she said in a statement earlier this week. Olympios' publicist Stan Rosenfield tells Variety, \"Corinne has not seen the tapes.\"\r\n\r\nMosley says he is \"not at liberty\" to share Jackson's side of the story, but says \"there's no criminal investigation and we don't fear any criminal investigation.\" He wouldn't say whether he has heard from Olympios' camp, but said, \"DeMario is not the big fish in this situation.\"\r\n\r\n\r\n\r\nMosley also declined to share Jackson's version of the night's events, but he did challenge the timeline. He pointed to Olympios' statement, which reads, \"I am a victim and have spent the last week trying to make sense of what happened the night of June 4,\" and explains that Jackson was not actually with Olympios during the \"night.\"\r\n\r\nAccording to Mosley, Jackson's \"very limited interaction\" with her happened around 5 p.m. \"That's not at night -- that's early evening,\" says Mosley. \"If you read the account [in tabloids], they suggest that there were three other people who had similar hookups with Corinne throughout the night, after DeMario -- none of which have been perceived like my client has, but those hookups would have happened at night.\"\r\n\r\nJackson's attorney would not say whether his client has been in touch with Olympios since the scandal broke, but says Jackson has her best interests in mind. \"He has a great deal of respect for Corinne,\" Mosley says. \"They were as friendly as castmates could be.\"\r\n\r\nBefore the \"Bachelor In Paradise\" scandal, Jackson was portrayed as the villain on the current season of \"The Bachelorette.\" A woman from his past was brought back on the show, and he was ultimately sent home.\r\n\r\nAsked if Jackson was put in a staged situation, Mosley says, \"I'm sure if you asked him that, he'd say they brought a girl from my past who I never knew and had a few text messages exchanged, but they paid her to come on and say that she's my girlfriend -- she wasn't. But that's part of reality TV. You sign up for that, and that's the producers' job to find a girl that would come on and do that.\"\r\n\r\nMosley would not confirm whether Jackson lost his job this week, as has been reported, but says the combination of \"The Bachelorette\" and \"Bachelor In Paradise\" has \"seriously damaged\" his client's reputation, due to a series of \"missteps.\"\r\n\r\n\"It's been a real joy working with DeMario. He's super smart, very witty, well educated, comes from a really great family,\" Mosley says. \"You might read something or see him on 'The Bachelorette,' but the first thing about him is that he's just a good kid from a really good family. He has no record, has never been accused of anything like this, and no one that knows him would ever think he would be in this type of situation.\"", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1497672903.0, "source": "https://variety.com", "summary": ""}