{"url": "https://www.etonline.com/ben-higgins-reveals-why-lauren-bushnell-split-broke-him-after-bachelor-winter-games-exit-exclusive", "text": "Ben Higgins still hasn't recovered from his breakup with Lauren Bushnell.\n\nThe Bachelor couple went their separate ways last May after a year and a half together, and by December, Higgins thought he was up to find love again on The Bachelor Winter Games. But as Tuesday's episode of The Bachelor spinoff showed, the 29-year-old reality star wasn't ready for romance.\n\n'Bachelor Winter Games' Sneak Peek: Ben Higgins in Tears Over Ex Lauren B (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart 'Bachelor Winter Games' Sneak Peek: Ben Higgins in Tears Over Ex Lauren B (Exclusive)\n\n\"To try to engage in relationships here, and know that the last time I did this, it was one of the best moments of my life... my fear is not entering into a relationship. My fear is not pursuing somebody. My fear is that if I were to be broken again, I'm not full enough right now to recover from that,\" Higgins cried in a heart-to-heart with Chris Harrison before packing his bags and heading home.\n\nMonths after filming ended, Higgins has no regrets about leaving the show early, telling ET's Lauren Zima at the Winter Games World: Tells All taping last week that \"it was the right time\" for him to go.\n\n\"I was sitting on the couch and all the couples were making out around me at different places around the living room, and I was like, 'Yeah, I don't think it's my time here anymore.' Like, Yuki and I had too many snowball fights and it's time for me to go,\" he confessed. \"I feel really good about that decision.\"\n\nAnd despite letting the tears flow during his emotional conversation with Harrison, Higgins said the moment didn't come \"from hurt.\"\n\n\"There's moments in this experience that really transcend even reality. There's moments that all of a sudden you're like, 'I haven't been able to express this or communicate this in a year and now I'm doing it on a television show. What in the heck happened?'\" Higgins explained. \"These shows kind of put you in this environment where you really have to dig deep and you have to talk about relationships and love. You start to realize things you never knew you felt, and my emotion was coming from this.\"\n\n\"As soon as [Bushnell and I] broke up, I was getting questions,\" he said, revealing that he read comments from fans asking if he really loved Bushnell, or expressing their wishes that he would have chosen someone else in his finale. \"I was finding myself either protecting Lauren, defending our relationship or having to respond to the fact that they love Lauren. I would say, 'Yeah, I did to. I do to.'\"\n\nBushnell has since moved on with a new man, Devin Antin, but it's not her new relationship that's been hard for Higgins -- because the former Bachelor said he's still been focusing on his own relationship with her.\n\n\"It broke me, because something that was really personal and really real and really hard was something that I also had to relive every day and still do to this day,\" he shared. \"There's not a day that goes by that Lauren isn't brought into my life, and as you're trying to heal from a breakup... it crushes you.\"\n\nMonths earlier, Higgins told ET that he was \"excited\" to fall in love again, and felt \"more ready today than I did two years ago.\" Watch below.\n\nThe finale of The Bachelor Winter Games airs Thursday at 8 p.m. ET/PT on ABC, with the World Tells All special airing right after.\n\nRELATED CONTENT:\n\n'Bachelor Winter Games' Sneak Peek: Ben Higgins Breaks Down in Tears Over Lauren Bushnell Breakup (Exclusive)\n\n'Bachelor Winter Games': Ben Higgins' Meltdown Sets Off a String of Tearful Goodbyes\n\nEXCLUSIVE: Lauren Bushnell Opens Up About Feeling 'Alone' After Ben Higgins Split, Why She's 'Very Happy' Now", "images": ["https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-12/lauren_bushnell_ben_higgins_getty887983450.jpg?h=c673cd1c&itok=ITB7uchr"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-12/lauren_bushnell_ben_higgins_getty887983450.jpg?h=c673cd1c&itok=ITB7uchr", "keywords": [], "authors": ["Jennifer Drysdale"], "canonical_link": "https://www.etonline.com/ben-higgins-reveals-why-lauren-bushnell-split-broke-him-after-bachelor-winter-games-exit-exclusive", "title": "Ben Higgins Reveals Why Lauren Bushnell Split 'Broke' Him After 'Bachelor Winter Games' Exit (Exclusive)", "meta_data": {"article": {"opinion": "false"}, "title": "Ben Higgins Reveals Why Lauren Bushnell Split 'Broke' Him After 'Bachelor Winter Games' Exit (Exclusive) | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/ben-higgins-reveals-why-lauren-bushnell-split-broke-him-after-bachelor-winter-games-exit-exclusive", "title": "Ben Higgins Reveals Why Lauren Bushnell Split 'Broke' Him After 'Bachelor Winter Games' Exit (Exclusive)", "description": "The former Bachelor says appearing on the 'Bachelor' spinoff helped him face his true feelings.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-12/lauren_bushnell_ben_higgins_getty887983450.jpg?h=c673cd1c&itok=ITB7uchr", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "The former Bachelor says appearing on the 'Bachelor' spinoff helped him face his true feelings.", "title": "Ben Higgins Reveals Why Lauren Bushnell Split 'Broke' Him After 'Bachelor Winter Games' Exit (Exclusive)", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Jennifer Drysdale‍", "url": "https://www.etonline.com/ben-higgins-reveals-why-lauren-bushnell-split-broke-him-after-bachelor-winter-games-exit-exclusive", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-12/lauren_bushnell_ben_higgins_getty887983450.jpg?h=c673cd1c&itok=ITB7uchr"}, "description": "The former Bachelor says appearing on the 'Bachelor' spinoff helped him face his true feelings.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "TV, News, Ben Higgins, The Bachelor, Bachelor Winter Games, Lauren Bushnell", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}