{"url": "https://en.wikipedia.org/wiki/Leonardo_(Teenage_Mutant_Ninja_Turtles)", "text": "Leonardo, nickname Leo, is a fictional character and one of the four main characters in the Teenage Mutant Ninja Turtles comics and related media.[2][3]\n\nHe is often depicted wearing a blue eye mask. His signature weapons are two ninjatōs (commonly confused as Katanas). Leonardo is the eldest brother and the leader of the group. He is the most skilled, the most serious, the most spiritual, the most disciplined, and the most in-line with Splinter's teachings and thoughts. Like all of the brothers, he is named after a Renaissance artist, in this case Leonardo da Vinci.\n\nComics [ edit ]\n\nMirage [ edit ]\n\nLeonardo is depicted as the main protagonist of the turtles. He never explicitly referred to himself as leader in the early stories, except in issue #44 (\"The Violent Underground\"). He is the one to usually take charge of the turtles when Master Splinter is not present. He is often at odds with his more hot-headed younger brother Raphael.\n\nIn Leonardo #1, Leonardo goes out for a run on the rooftops of New York City and is ambushed by the Foot Clan. He puts up an admirable fight against an army of Foot Ninja, but is eventually overwhelmed. Beaten to near unconsciousness, he is thrown through April O'Neil's apartment window. The remaining Turtles and Splinter are forced to continue the fight, but even with the aid of Casey Jones, the odds are against them. In the end, the building catches fire and the police arrive, but they secretly escape to Northampton. During this time, Leonardo recovers from his physical wounds. However, he lost a great deal of confidence. He repeatedly attempts, unsuccessfully, to hunt for deer. While out hunting, he sees April fall through ice into a lake, and he rescues her. In subsequent issues, it is implied that Leonardo has regained most of his confidence.\n\nIn the Return to New York storyline (Teenage Mutant Ninja Turtles (vol. 1) #19-21), Raphael demands that the Turtles return to New York to confront the Foot Clan and the Shredder. He accuses Leonardo of cowardice, and the arguing brothers soon come to blows. Leonardo is beaten by Raphael, who throws Leonardo through the wall of the barn and leaves alone. Along with his younger brother Donatello and his youngest brother Michelangelo, Leonardo returns to New York and reunites with his wayward brother in the old sewer lair. The three go along with Raphael's plan to storm the Foot Headquarters, where once again Raphael goes off on his own to fight the Shredder. However, he is ambushed and beaten by the Shredder's Elite guard, but is rescued by Leonardo. This prompts Raphael to finally cede to Leonardo's leadership, leaving him to fight the Shredder. Leonardo engages in a bloody battle with Shredder that spills out onto the rooftop of the building. Leonardo ends the battle by decapitating the Shredder just as the building implodes. The Turtles later burn the Shredder's corpse in a funeral pyre in a nearby Manhattan harbor.\n\nLeonardo captured by Karai on the cover of issue #57 (art by A. C. Farley)\n\nIn the City at War storyline (Teenage Mutant Ninja Turtles (vol. 1) #50-62), a feud between various factions of the Foot Clan over leadership breaks out. As fighting ensues in the streets of New York, the Turtles and the civilian populace get caught in the middle. Leonardo grows weary of constant battle with the Foot Clan and seems fraught with indecision. The Turtles are approached by Karai, the leader of the Foot Clan in Japan who has come to New York to unite the Foot. She presents the Turtles with an offer of a truce between the Foot and the Turtles if they help her kill Shredder's Elite Guards, which are a major obstacle to her reorganizing the Foot. Despite Raphael's objections, Leonardo persuades his brothers to accept Karai's offer and all four Turtles successfully work with Karai to eliminate the Elite Guard.\n\nIn Volume 2 of the Mirage Studios comic, the turtles begin living in separate places. Leonardo decides to live in a newfound sewer lair. Michelangelo and Raphael notice a change in Leonardo and note that he seems more easygoing, though Raphael points out that his and Leonardo's natural order is to be \"buttin' heads.\"\n\nYears later in Volume 4, Leonardo still leads his brothers (all four now in their thirties) in fights against crime. Leonardo and Raphael's conflict seems to have greatly lessened. When the Utroms make a very public arrival on Earth and reveal alien life to humans, however, the Turtles become free to mingle in everyday society. The Turtles also help the Utroms acclimate to life on Earth and work alongside the Foot Clan as security. One Foot Clan member is Cha Ocho, who Leonardo has a rivalry with due to an encounter years earlier. Karai approaches Leonardo for help when a mysterious force begins attacking various Foot Clans; only the New York branch is left intact. His investigation takes him to the Battle Nexus, where he meets Oroku Yoshi (who wears armor similar to the Shredder's).\n\nThis incarnation of Leonardo makes an appearance in the Turtles Forever crossover special voiced by Jason Griffith.\n\nImage Comics [ edit ]\n\nIn Volume 3 of the Image Comics series, Leonardo was initially portrayed as similar to his Mirage counterpart (at the time, Image was picking up where Volume 2 left off). In the later issues, he lost a hand when it was eaten by King Komodo, although this did not seem to deter him significantly. He tried initially to use a prosthetic hand, which was given to him by Donatello, but he much preferred to wear a steel cap which came with a retractable blade.\n\nArchie Comics [ edit ]\n\nThe Archie Comics series initially began as an adaptation of 1987 animated series, so Leonardo was naturally portrayed like his animated counterpart. As the series progressed, it began telling original stories. Leonardo demonstrated a rather strong dislike for firearms. Also, a future version of Leonardo was depicted, having founded a ninja school. Four of his top students were depicted: Nobuko, possibly his love interest; Miles, a young black man; Carmen, a Latina woman and possibly his love interest; and Bob, an anthropomorphic baboon. These students seemed to have an \"extended family\" relationship with the Turtles, Bob in particular referring to them as uncles.\n\nIDW Comics [ edit ]\n\nAlthough the IDW series is a complete comic re-imagination of the franchise, Leonardo is initially portrayed as similar to his Mirage counterpart. Leonardo is the eldest brother and the leader of the four. In the Cityfall saga, he gets himself captured by the Foot and is taken to a Shinto witch by the name of Kitsune, who uses her strong dark magic to brainwash him into working for Shredder as his chunin (second-in-command), which infuriated Karai. He is later saved by his brothers and their allies, however, after the death of the Shredder at the hands of his father, Splinter, who took over the Foot Clan after the battle, Leo once again became the chunin, but, like last time, it didn't last. The relationship between Splinter and his sons deteriorated after he decided to take another life, going against the very philosophy he taught them to always follow. He revealed that this was, in fact, an intentional way of pushing them away from him, as he believes being around him would be too much of a threat to them, as shown during the events of the comic book. Leonardo assumed leadership over the Clan Hamato, and since then, they've come into conflict with the Foot Clan several times.\n\nTelevision [ edit ]\n\n1987 animated series [ edit ]\n\nIn the 1987 TV series' theme song lyrics, Leonardo is said outright to be the leader of the TMNT, and there is little disputing this; his orders are usually followed, and he is a very serious do-gooder who hardly ever makes wise cracks. He was attracted to a young kunoichi named Lotus, a swordswoman prodigy from Japan who was hired by Krang to replace Shredder, whom she easily defeated (along with Rocksteady and Bebop). She and Leonardo dueled to a standstill before she resorted to a trick sword to knock him out. When they met the second time, she tried to convince him to join her as \"ninja for hire\", but he refused. She turned on Krang and escaped to continue her mercenary lifestyle, telling Leonardo that there was little good in goodness, though she hoped that they would one day be on the same side.\n\nLeonardo takes his role of being a leader very seriously. However he can be very bossy which annoys his brothers. Mostly they will obey, sometimes they won’t. In a Season 4 episode “Leonardo lightens up”, his brothers got so annoyed that they used a personality alternator to make him loosen up, which lead into huge problems, but ended up going back to normal in the end.\n\nWhen the cartoon series starts out, he is shown with having a very level head, akin to his leadership qualities in the comic. However, as the series carried on, he became more of a hero of a group of superheroes and spoke in a high pitched voice, which was very different from the original, deeper pitch in the first season. He probably got more confident.\n\nLeonardo also seems to enjoy reading. For example, many times when the Turtles are at home, Leo is reading a book. In the episode Four Musketurtles, he is the only Turtle that read The Three Musketeers. Another good example is in \"Leonardo is Missing\"; while the other Turtles go to an arcade, Leonardo stays at the lair and reads. In the Season 6 episode \"Snakes Alive\", it is revealed that Leonardo has Ophidiophobia, but confronted it later.\n\nIn the Season 3 episode \"Take Me to Your Leader!\", Leonardo gives up his leadership and walks away after a dream he believes convinces him he is no longer a good leader. The others have to find him, and stop Shredder, Krang, and Bebop and Rocksteady from draining energy from the Sun with a Solar Siphon and store it in solar batteries.[4] However, Leonardo returns when he spots a bridge collapsing due to snow. After a man says that everybody talks about the weather but nobody does anything, Leonardo realizes his responsibility and begins to search for his brothers. He later finds them, and together they save the Earth.\n\nLeonardo's voice actor was Cam Clarke, in the actor's \"breakout role\" and is still one of his best-known roles in the original 1987 cartoon. In the crossover movie Turtles Forever, this version of Leonardo is voiced by Dan Green in the original English version. Leonardo also made a couple of appearances in the 2012 series in the episode, The Manhattan Project. He and the other turtles along with Casey and April are seen through a portal by their 2012 counterparts walking on a road and he made a speaking cameo along with the other turtles at the end of the episode when a space worm from the 2012 dimension started terrorizing the street. All four turtles see the worm and spring into action while shouting their famous catchphrase, 'Cowabunga'. Cam Clarke reprised his role as Leonardo for the cameo. This would mark the first time in over 28 years the 1987 TMNT cast would return to their roles. With exception of Rob Paulsen who returned to the TMNT franchise as Donatello in the 2012 series. The 1987 turtles then had a crossover with the 2012 turtles in the season 4 episode, \"Trans-Dimensional Turtles\".[5]\n\n1997 live-action series [ edit ]\n\nIn 1997-1998, Leonardo along with the other Ninja Turtles were featured in a short-lived live-action series Ninja Turtles: The Next Mutation, as well as a crossover episode with Power Rangers in Space. In it, he carried one double bladed ninjaken instead of two and his sibling rivalry with Raphael drove many episodes. In one episode where they were sparring, Raphael took advantage of Leo's apparent physical weakening, insulting, mocking and taunting his brother to make him more reckless, until finally Leo lost his temper and angrily kicked Raph so hard that he sent Raph flying across the sewer den. They spent the rest of the episode arguing and challenging each other to tests of skill (some of them quite absurd) until finally using arm wrestling to decide who would live in the sewer and who would leave. Although Leo won, it was decided that Raph should stay. In this series, Leonardo was portrayed by Gabe Khouth and voiced by Michael Dobson.\n\n2003 animated series [ edit ]\n\nIn the Mirage Studios and 4Kids Entertainment 2003 animated TV series, Leonardo is voiced by Michael Sinterniklaas in the English version, Tetsuya Kakihara in the Japanese version, and Samuel Harjanne (seasons 1 and 2) and Markus Blom in the Finnish version. Leonardo is the eldest brother, and leader of the group, quiet and the most serious of the four. He has a very close bond with Splinter, and has a strong sense of honor, ethics, and Bushidō. Leonardo's twin swords are slung across his back. Episodes that deal with the Shredder and honor usually also focus on Leonardo, and he is often the Turtle who \"saves the day\". Leonardo is a more sensitive, self-doubting character than in previous incarnations. His younger brother Raphael often quarrels with him and resents his leadership, sarcastically calling Leonardo \"Fearless Leader\", although the two are shown to be very close at times. Though Leonardo's relationships with his younger brothers Donatello and Michelangelo are not as volatile, both have made comments alluding to the high standards the former has set, and his tendency to make them look bad. Despite this, his brothers view him as a pillar of strength and are at a loss when he is injured or absent. One of Leonardo's most prominent qualities is his determination to believe in the good and the best in people, even potential enemies; such as Karai.\n\nAt times, Leonardo is shown to be very hard on himself, as he feels that a lot is expected of him. As in the Mirage comics, Leonardo is ambushed and seriously injured by the Foot Clan and he feels he let his family and himself down. He has the same feelings after the final battle with the Shredder-his anger and self-doubt was caused by Karai, who he believed was an honorable ally, but she was unable to go against her master's orders, eventually causing her to stab Leonardo (albeit unintentionally). Leonardo also feels extremely inadequate, as he believes that again, he let himself and his family down, this time by finding no other way to destroy the Shredder than to blow up the spaceship that both the Turtles and the Shredder were on; the Turtles and Splinter would have perished if they had not been rescued by Utroms. Eventually, Leonardo finds inner peace under the guidance of the Ancient One, who trained Splinter's sensei, Hamato Yoshi. From their final battle with the Shredder, Leonardo was the only Turtle to sustain truly lasting damage; part of his shell on his upper left shoulder had its edge shorn. Nevertheless, he is the most skilled of the Turtles, being the only one trained by two ninja masters, capable of facing and defeating Karai, the new Shredder, in a one-on-one fight, as well as defeating all three of his brothers at once in a sparring match.\n\nThrough much of the fourth season, while the other turtles are fully healed and recovered from their battle with the Shredder, Leonardo still could not get over his failure. He becomes bitter and increasingly stern with himself and adopts a greatly aggressive personality, which has been likened to Raph's previous impulsive and hotheaded ways on many occasions. Leonardo also shows considerably less reluctance in using violence to interrogate people, and devotes himself to even greater lengths of training in order to protect his family. Not wanting his family to worry about him, Leonardo chose to never tell them about his true feelings about their final battle against the Shredder, although he open up to April and Usagi about his problems. However, Leonardo ended up making his brothers worry for him anyway and Splinter feels he must move on. It comes to a head when Leonardo loses his temper and nearly causes Splinter a serious injury during a training session. Leonardo was sent by Splinter to find Master Yoshi's own sensei, The Ancient One, since there is nothing more he could do for his troubled son. Leonardo encounters a strange short man, as well as obstacles that echo his own anger. In the end, Leonardo admits that he was angry over failing his family while fighting the Shredder and that his only option was to self-destruct the ship to stop him. Leonardo comes to terms with his anger, accepting he did every thing in his power, and begins training under the short man, who turns out to be the Ancient One. Leonardo only leaves when he learns that his family is in danger, a result of Karai's vengeance, which destroys the lair and presumably eliminates them. Leonardo returns to the city, reunites his family in a safe location, and confronts Karai. He defeats her, but after Karai tells him to finish her, he refuses. Leo magnanimously gives her one last chance to leave the Turtles in peace, believing there is still good in her.\n\nIn the fifth season, of the eight acolytes under the Tribunal's training, Leonardo is the only one who doesn't receive a weapon from the Spirit Forge. It is implied that his spirit is his weapon, and anything he holds is merely an extension. (This was hinted at in previous seasons.) His otherworldly form is that of a dragon, a rare form, unheard of in someone his age. It is shown destroying evil guarding the second artifact. This avatar is first shown in \"More Worlds Than One\". His brothers later exhibit dragon avatars as well. In the fifth episode \"Beginning of the End\", he is given the sword \"Gunjin\" (one of the Fangs of the Dragon that commands the \"White Flame of the Dragon King\") by the wounded Faraji, who believes the sword was meant to be Leo's. Leo returns Gunjin in episode 12 \"Enter the Dragons\" when Faraji returns to help battle the Tengu Shredder, because he believes the sword truly belongs to Faraji.\n\nIn the Fast Forward season, and the Back to the Sewers season, the damage that occurred to Leonardo's shell as stated above has somehow been repaired.\n\nLeonardo is trained not just by Master Splinter but the Ancient One himself, Hamato Yoshi's trainer and adoptive father. From then on, Leonardo is far more experienced and skillful at even more complex ninjitsu moves than even Splinter, Raph, Mikey, and Donnie all at once. In the third part of the first season episode series \"Return to New York\", he cuts the Shredder's head off in a one-on one-duel in Shredder's domain.\n\nLeonardo is the most skilled at ninjutsu and other forms of hand-to-hand combat he all learned from his adopted father and master, Splinter. As his weapons are dual katanas, he is proficient in \"the ways of the sword\" and basic knife-throwing techniques. If need be, he can use Qi Qong to slow his own bodily functions to survive temporarily without oxygen. After training sessions with \"the Ancient One\" he developed an intuitive/psionic-like ability to see what has previously transpired by \"allowing thought to flow out and within.\"\n\n2012 animated series [ edit ]\n\nLeonardo, as depicted in the 2012 Nickelodeon series\n\nLeonardo again leads the team in Nickelodeon's 3D computer-animated series. He was voiced by actor Jason Biggs up until \"The Wrath of Tiger Claw\", Dominic Catrambone for the remainder of the second season and Seth Green beginning in the third season. In this latest version, Leonardo seems to be less experienced and still perfecting his fighting skills and leadership abilities to make more solid decisions and gain more trust from his three younger brothers. He regularly watches an animated science fiction show called Space Heroes (a parody of Star Trek: The Animated Series) and uses it as a guide for his leadership skills, often attempting to quote from the show in an attempt to sound intimidating and heroic, even if most of his attempts fall flat due to him sounding overly cliché.\n\nLeonardo immediately developed romantic feelings for Karai since their first encounter, even though she is his adoptive sister by Splinter; she was taken in by the Shredder after her mother's death and was tasked with destroying her birth family (including Leo) before changing sides upon discovering her true heritage as his adopted sister. His weapons here are purely dual katanas, which he uses in the Niten Ryu style of kenjutsu, making him an excellent swordsman. Despite the fact the other three turtles have added traits in this series, Leonardo is almost completely normal but now has blue eyes. Upon the sudden demise of his adopted father and master, he reluctantly steps up as sensei in addition to being leader, which puts even more pressure on him. He is visited, on occasion, by the spirit of Splinter who encourages him to lead his family and friends to stopping new evils.\n\nIn addition to his natural ninjitsu skills, he eventually developed the strong innate ability to heal via an enchanted mantra known as \"the healing hands.\" By chanting the incantation and making the right hand seals, Leo is fully capable of revitalizing his inner strength and counteract even the most lethal of poisons and venom of \"the healing hands.\" He managed to develop and utilize it to counteract the lethal venom of Karai, and attempted to use it on her to release her from the Shredder's control but failed. He then succeeded in saving Casey and Michelangelo from death. According to Splinter, he shows great gifts as a healer, and that being at the edge of his life had given him \"a power that few martial artists can tap.\"\n\n2018 animated series [ edit ]\n\nIn the 2018 animated series, Rise of the Teenage Mutant Ninja Turtles, Ben Schwartz voices \"Leonardo, the self-professed ‘coolest’ brother possesses irreverent charm and a rebel heart.\"[6] Unlike past versions, he is not the leader of the turtles, and boasts a less serious, more laidback, charming, sardonic, and joke-cracking personality. This incarnation of Leo is a 14 year old twin (Donnie is his twin brother). Despite not being the leader, he is still quick-witted and strategic by nature. He also initiatively leads his brothers whenever something has happened to Raphael (who is the leader in this incarnation). He can be arrogant about things, but he also demonstrates insecurity and self-doubt.\n\nFilms [ edit ]\n\nOriginal trilogy [ edit ]\n\nIn Teenage Mutant Ninja Turtles, Leonardo was fairly modest and sensitive, rarely issuing direct commands and seemingly much more relaxed around his brothers thinking of himself as more of an equal than a leader. It was he who first communicated telepathically with a kidnapped Splinter and seems the most anxious about Raphael's health after his ambush by the Foot Clan. He fought alongside his brothers against The Shredder in the climatic battle and was the only one of the four to actually injure The Shredder, but, like his brothers, could not defeat him. Due to the focus on Raphael in the film's plot, Leonardo's personality was rarely explored and his leader position in the team took a back seat. Leonardo was portrayed by David Forman and voiced by Brian Tochi.\n\nIn The Secret of the Ooze, Leonardo was much more prominent and his leader position was brought to focus. He is seen on many occasions bickering with Raphael as their sibling rivalry begins to become much more serious. He, like his brothers, was astonished at the return of the Foot but he found that their current homelessness due to their last battle was a more pressing issue and soon he convinced his brothers that they needed to move. Leonardo is once again sensitive, caring, and humorous in this adaption but he now appears much more bossy and controlling.\n\nIn Teenage Mutant Ninja Turtles III, after traveling back in time to feudal Japan, Leonardo leads his brothers to help a village in trouble from the villainous weapons trader, Walker, and to return home.\n\n2007 film [ edit ]\n\nIn TMNT, Leo was sent away by Master Splinter to hone his skills in becoming a more efficient leader after Shredder's defeat. April finds him in Central America and while he was hesitant to return to New York City, he does at the right time to take on a new force of evil.\n\nHis brotherly relationship with Raphael is strained due to Raphael feeling abandoned by Leo as well as feeling less appreciated by Splinter. Leonardo's vision of the world is perhaps wider than Raph's. In the first movie prequel comic, Leo becomes angry with Raph for trying to leave them in order to save a man from being mugged because there are 4 heavily armed Triceratons in the sewers who could cause devastation to the city. He becomes further angered when Raphael deserts them mid-battle to help an old man. This conflict suggests that the two brothers operate on different levels of morality, though neither is necessarily wrong. Raph states in the comic that he was tired of waiting for disaster to fall on his family and tired of fighting aliens while people in their own neighborhood are being mugged and murdered. Leo, on the other hand, believes that the world of men is the responsibility of the police, while Utroms and Triceratons are their domain… that they should fight only when there is no one else to solve the problem. This also engages Leo in a contradiction when he stays in Central America, using violence to fight local lawlessness and effectively deserting his brothers because he believes as Raph believes, that others need him more. Such parallels suggest that the two brothers are experiencing the same dedication to justice but in a different mentality, albeit in very different locales and using different tactics. In fact, when Leo tracks down and scolds the Nightwatcher (not knowing that he is Raphael), he remarks that he is well aware of the Nightwatcher's good intentions but cannot simply approve of the latter's methods.\n\nRaph challenges Leonardo after arguing of their own individual sense of justice and the reasons for their actions. Leonardo discovers that Raphael is the Nightwatcher and the two engage in an emotional fight. Raph almost kills Leo out of anger and then retreats due to shame and his brother's deep and confused stare. Leo is captured by the Stone Generals and the Foot Clan but is rescued by his family later before the final battle where Leo and Raph finally resolve their differences, Raph accepting Leo as their leader while Leo confesses to needing Raph. Leo is voiced by James Arnold Taylor in this film.[7][8]\n\nReboot series [ edit ]\n\nLeonardo appears in Teenage Mutant Ninja Turtles, portrayed by Pete Ploszek in motion capture and voiced by Johnny Knoxville.[9][10][11] In this movie, he is dedicated to perfecting his ninjutsu skills and will stop at nothing to defend his brothers and the entire city. There are times where his cautious nature makes him clash with his brothers. Leonardo firmly believes it's his ninja duty to protect all people. He tends to have a similar personality to his '87 counterpart where he is determined to help people and keep his brothers in line. He and Raphael unlike in their other adaptions don't fight over leadership although they have a brief argument over the Hamatshi and Raphael talking about leaving which Leo debunks Raph's claim. In the movie he, like Donnie and Raph, doesn't seek April's attention unlike Mikey who does. He also appears in the sequel, Out of the Shadows, although Knoxville didn't return to voice him, and Ploszek provided both motion-capture and voice.[12]\n\nDC crossover film [ edit ]\n\nLeonardo appears in the direct-to-video crossover film Batman vs. Teenage Mutant Ninja Turtles, voiced by Eric Bauza.[13]\n\nVideo games [ edit ]\n\nIn the video games, Leonardo is portrayed as well-balanced, having strong but not extreme abilities in all areas and no glaring weaknesses. His range is rather long, but not as long as Donatello's; however, Leonardo can usually inflict more damage. In the Tournament Fighters games, his moves are the closest to a Ryu/Ken archetype from the Street Fighter franchise. He appears in Teenage Mutant Ninja Turtles: Smash-Up as a playable character, with Michael Sinterniklaas reprising the role.\n\nLeonardo is one of the main playable characters in Teenage Mutant Ninja Turtles: Out of the Shadows video game, where he is voiced by Scott Whyte. Leonardo also appears in the 2014 film-based game, voiced again by Cam Clarke.\n\nLeonardo is featured as one of the playable characters from Teenage Mutant Ninja Turtles as DLC in Injustice 2, voiced by Corey Krueger. He is the default turtle outside the gear loadout, while the rest of his brothers, Michelangelo, Raphael and Donatello can only be picked through the said loadout selection, similar to premier skin characters. In their single player ending, Krang had sent them to the world where the war between the Insurgency and Regime was taking place. After the victory over Brainiac, Harley Quinn serves some pizza with 5-U-93-R. With this, they became powerful enough to return home and defeat Krang and Shredder.", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/e/ed/Leonardo_%28Teenage_Mutant_Ninja_Turtles%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/ca/TMNT_Image_1_57.jpg/170px-TMNT_Image_1_57.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Wiki_letter_w_cropped.svg/20px-Wiki_letter_w_cropped.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/2/28/TMNTLeo2012.png/170px-TMNTLeo2012.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/e/ed/Leonardo_%28Teenage_Mutant_Ninja_Turtles%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Leonardo_(Teenage_Mutant_Ninja_Turtles)", "title": "Leonardo (Teenage Mutant Ninja Turtles)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/e/ed/Leonardo_%28Teenage_Mutant_Ninja_Turtles%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}