{"url": "https://www.thedailybeast.com/on-set-with-will-and-grace-how-this-became-the-one-tv-revival-that-actually-works", "text": "Eric McCormack and Sean Hayes are, very methodically, tripping balls.\n\nIt’s a careful dance. How spacey should they be? How much do they caress each other? How big is funny and how big is too much?\n\nIt’s run-through day for a season 10 episode of Will & Grace—the second season of the show’s successful revival—and the series’ Emmy-winning four leads are workshopping a characteristically loony-poignant outing of the series, which has finally settled back into a familiar groove following all of the pomp, circumstance, and hand-wringing hoopla surrounding last year’s comeback after 11 years off the air.\n\nMcCormack’s Will and Hayes’s Jack accidentally chug milk laced with a hallucinogen, thrusting the actors into choreography for the kind of broad physical comedy that few sitcoms get away with anymore, but which Will & Grace specializes in.\n\nThere’s more evidence of the NBC sitcom’s familiar signature—memorable performances from huge guest stars—five minutes later as Debra Messing, who plays Grace, gamely stifles laughter as Chelsea Handler lands take after take playing a demanding new design client. And then there’s some of the surprise poignance that’s underscored the revival of the series, especially, as the whole thing is soundtracked by Megan Mullally standing at a piano and belting “The Man That Got Away,” rehearsing for what promises to be a rare emotional moment for her lovable kook, Karen Walker.\n\n“We were all a little exhausted last year promoting this thing and talking, talking, talking about it,” McCormack tells me, as Mullally’s vibrato echoes off the walls of the Studio City soundstage where the series shoots. “That always makes me nervous. Like, let’s just show you what we’ve got.”\n\nWhat they had was a revival that emerged from a din of thinkpiece debate and fan fretting—How political should it be? Would the gay jokes be “woke”? And what about that original series finale?—with a clear identity of the show it wanted to be, which was very much the show it always was. Well, just a little bit older, and with a renewed resonance in 2018, 20 years after the sitcom broke ground by featuring a gay male lead, but in the thick of a dizzying Trump administration.\n\nCritics loved it. Ratings were a boon for NBC. Award nominations followed. And what the reunited cast, co-creators Max Mutchnick and David Kohan, and the legendary James Burrows, who has directed every episode of the show’s original run and revival, had figured out was a reboot that felt crucially familiar, but also proved its value in its big TV comeback.\n\nAt a time when revivals continue to sprout up like weeds around Will & Grace—Murphy Brown! Magnum, P.I.! Charmed!—and, in some cases, die just as quickly—cough, Roseanne, cough—the show is now largely seen as a model for getting the TV reboot right. It found a way to inject both pathos and timely politics into the nostalgia of a beloved show without betraying the original fabric of the series and its characters, alienating its fans, and imploding entirely. (Roseanne, cough-cough.)\n\nWill & Grace & Jack & Karen...11 Years Later\n\nAs has been well-documented by this point, there was never supposed to be a Will & Grace revival.\n\nThe cast and creative team had reunited for an election-themed sketch titled “Vote Honey,” which proved the show was, for one, still relevant but also, as the clip quickly went viral, that there was a viewer appetite for these characters to come back in the present day. What was announced as a 10-episode limited run became a three-season order before the revival’s premiere even aired.\n\nThrough all that planning, one creative decision mattered the most. Everything that happened in the series finale—both Will and Grace were married, had kids, and had, over the years, fallen out of touch—was going to have to be ignored.\n\n“We thought, ‘I don’t think that’s what people want,” Kohan tells me. “People don’t necessarily want to see what Will’s like as a dad, or Grace as a mom. So we didn’t do it. It was a great way to end the show, but it’s not what we want to see now.”\n\nThat left the world—or at least Will & Grace’s fictionalized version of Manhattan’s Upper West Side—as Kohan and Mutchnick’s creative oyster when it came to figuring out where these characters would be 11 years after we last saw them. Will and Grace, they decided, would be divorced and living together again. Jack, no longer a gay Peter Pan, is finally able to open himself up to real, adult relationships. And Karen, when not palling around at Mar-a-Lago with the Trumps, finds her marriage to Stanley Walker nearing its end.\n\n“The thing I wanted most for Grace was for her to be a more vocal feminist,” Messing says about the reboot. “I think it made sense for the character that we knew 20 years ago, and it felt very relevant and of the moment. ”\n\nThe episode “Sweatshop Annie & The Annoying Baby Shower,” in which Grace is forced to confront her decision not to have kids, is the one Messing said she’s most proud of. “She was able to articulate if she wanted to be a mother she would be, and this is her choice and she’s happy. That it’s OK to be a working woman who chooses not to be a mother, and it’s also great to fully support and celebrate women who decide to stay home and be a full-time mom. That felt new to me in the primetime space.”\n\nMcCormack thought there was similar power in checking back in with Will as a single gay man in his 40s, and, while still neurotic as hell, finally comfortable with himself and where he is in life.\n\n“At the same time, he had three or four good dates last year,” he says. “Good dates! They ended funny, but there was some sexuality and suggestion of actual sex in his life, and that he was getting a little less one-man man and a little more adventurous. I loved that.”\n\nThe revival’s first season ended with two relationship bombshells but, for once, neither had anything to do with Will or Grace. Jack became engaged to Stefan, a flight attendant he met in Ibiza, while Karen got caught cheating on Stanley with Malcolm (Alec Baldwin). When the new season premieres Thursday night, Jack and Stefan are still happily together, while Karen is rattled by her impending divorce—not to mention the discovery that a plastic surgeon is peddling the “Karen Walkers,” breast implants modeled after her own.\n\n“For me, it felt like Karen, and that was the only thing that was important,” Mullally says. “I remember at one point during the first eight seasons, we had a temporary showrunner who just wasn’t getting our characters in the way everybody always had. It was later on in the show, and it was only a short amount of time. But that was terrifying because it was like, wait a minute, Karen would never do or say that. Everyone felt that way. So thank God when we came back it just felt right.”\n\nGetting Older...\n\nIf erasing the events of the series finale was the first important creative decision, then the second was one that might seem obvious but which other comedies may not have confronted so head-on: These characters have gotten older.\n\n“I love that everyone was self-aware enough to make the characters self-aware,” Hayes says. “That goes with being aware of our age and our place in the world, as well as the gay lifestyle and what that means to Will and Jack, who are of a certain age.”\n\nKohan points to the episode in which Ben Platt starred as a millennial love interest for an out-of-touch Will, while Jack attempts to hide his age from younger men at a gay bar, as one of his favorites. Mutchnick agrees. “They’re 11 years older,” he says. “Let’s talk about those things. If we went in another direction it would have been tone-deaf.”\n\nFreed from last season’s burden of having to spend time establishing where these characters are at this point in their lives, Mutchnick promises that this upcoming season is the one in which the characters will make major changes in their lives.\n\nJack’s engagement will have ramifications in his friendships with Will and Karen. Karen’s divorce will rattle her in as human a way as that character is capable of. Will will begin teaching law instead of practicing it. And Grace will start dating a character played by David Schwimmer, a Twitter celebrity known as “The West Side Curmudgeon.” (To Will and Grace, that’s a good thing: “He doesn’t like the same things we don’t like!”)\n\n“We got the thing going again and told everybody where these characters are and how they’re doing,” Mutchnick says. “But I think we’ve set it up so that big changes come this season. This is the year everybody in the cast ends up at a different place in their lives at the end of the year.”\n\n...And Getting Political\n\nAsked if there’s anything that’s felt different about doing the show in 2018 as opposed to when the original run aired, Jim Burrows, who relishes in the familiar routine of having directed every episode of Will & Grace ever (and over 1,000 episodes of TV classics like Cheers, Frasier, and Friends), points to just one thing: “There’s a lot more political references.”\n\nThe revival premiered last fall prepared to address the elephant in the room. Its first episode was entirely Trump-focused, to the point that its final scenes were even set at the White House. While the political focus dialed back considerably after that—Mutchnick, Kohan, and Burrows say they felt like the best route was to get it all out of the way up front—jokes about the administration would continue throughout the season, with the show even filming additional scenes in the week new episodes aired to keep jokes up to date with the frantically moving news cycle.\n\nIn some respects, they are responding to audiences’ different attitudes towards TV. They want this material, and maybe even expect it. For a large swath of Will & Grace fans, it’s satisfying to see these characters deliver a Trump dig.\n\n“But it needs to be a dig,” Kohan says. “It’s the low-hanging fruit that’s like, eh, everybody does that. But the conceit here is that these are people living in the real world in New York. It can be heightened and is certainly broad, but they’re still people who live in 2018 in New York City and they have opinions, because the world and certainly America and certainly New York is more political than it was when the show went off air. Every action feels like it has political overtones to it. You can’t avoid it. I think that’s just a function of the national discourse.”\n\nIt’s new territory for Burrows, the director admits. “We’ve always been a pop culture show and made those references, but things are slightly more political,” he says. “I worked on Cheers for 11 years, and there were never references like these at all. We wrote jokes about Chopin, Auer, and Kierkegaard. Then you come to this show and it’s almost entirely pop culture and politics.”\n\nBut also setting the revival apart from the series’ original run is how political things have gotten off screen. Social media exists now, which wasn’t the case 20 years ago. Messing has taken full of advantage of that, whether tweeting in support of Hillary Clinton during the campaign (she even spoke at the Democratic convention), blasting the Trump administration on a regular basis, or dressing down actress Susan Sarandon over her defense of the president.\n\nTwenty years ago when Will & Grace premiered, Messing wasn’t a politically active actress with a headline-making social media account while simultaneously starring on a culturally important show. What has this experience been like for her, then?\n\n“In the discussion of whether we come back or not, my caveat was that I will only come back if we were supported in being the show we always were, which is a show that pushes the boundaries and makes jokes about what is happening right now, today, in pop culture,” she tells me. “There were many reasons to believe that perhaps the network might have concern with us doing what we always had done. So I articulated that and said I need confirmation that you will fully support the creative team here to do what we always did. Once I got that confirmation, I was always in.”\n\nAnd as for her own political activism? “No one in my professional world has asked me to stop being outspoken. Which is great.”\n\nBut as much talk as there is surrounding the politics of Will & Grace, or any show that wades into Trump-infested waters for that matter, everyone stresses that no one would watch if their top agenda was not to be funny. “It’s the funniest show I ever did,” Burrows swears. And, should there be confusion, he settles it: “Cheers was not as funny.”\n\nMullally brings up the fact that this is a show that happens to be making noise amid the over 500 scripted series on TV.\n\n“So many of them are really good,” she says. “But all those other shows i’m thinking about, they’re all on some cable channel or streaming service. They’re not on network. They can say anything and can do anything and can address any subject matter and can really like hunker down and go deep. I feel like we’re really lucky to get to do Will & Grace right now on network television. Because there’s a giant swath of the audience that are not watching all that groovy stuff. They’re not watching the very profound, great, pushing-the-envelope shows that we’re watching. So to have this show plunk right down in the middle of a Thursday night on network is so great. I feel really lucky about that.”\n\nMcCormack cycles through the variety of episodes the revival launched with: a heavily political premiere, then funny commentary on gay dating in your forties, then more slap-sticky throwback episodes, a fantasy Christmas episode, and then back to politics again with an episode in which Grace fights with a baker who won’t put a political message on a cake.\n\n“We can do these three or four things and we can do them well,” he says. “But mostly we have to be true to the audience and give them a show they love, and make sure it’s fucking funny. Because if it’s not funny than we have nothing to talk about.” And with that, he heads back to the iconic apartment set, where he and Hayes lay over each other on the couch and proceed to hallucinate butterflies.", "images": ["https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1538434110/181001-fallon-will-grace-tease2_qekwcd", "https://img.thedailybeast.com/image/upload/v1550872986/White2x_hcwpd6.png", "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_1.5/c_limit,w_1044/fl_lossy,q_auto/v1538434110/181001-fallon-will-grace-tease2_qekwcd", "https://img.thedailybeast.com/image/upload/c_fill,h_200,w_200,x_0,y_0/v1489779074/author/Kevin-Fallon.jpg", "https://img.thedailybeast.com/image/upload/v1549916286/logo_km2qs4.png"], "top_img": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1538434110/181001-fallon-will-grace-tease2_qekwcd", "keywords": [], "authors": ["Kevin Fallon", "Senior Entertainment Reporter"], "canonical_link": "https://www.thedailybeast.com/on-set-with-will-and-grace-how-this-became-the-one-tv-revival-that-actually-works", "title": "On Set With ‘Will & Grace’: How This Became the One TV Revival That Actually Works", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "title": "On Set With ‘Will & Grace’: How This Became the One TV Revival That Actually Works", "keywords": "LGBT, Television, Megan Mullally", "og": {"title": "How ‘Will & Grace’ Became the One TV Revival That Actually Works", "description": "A little older, a little gayer, a little more woke, and a little more political. The cast and crew of ‘Will & Grace’ spill the secrets to the revival’s unlikely success.", "url": "https://www.thedailybeast.com/on-set-with-will-and-grace-how-this-became-the-one-tv-revival-that-actually-works", "site_name": "The Daily Beast", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1538434110/181001-fallon-will-grace-tease2_qekwcd"}, "description": "A little older, a little gayer, a little more woke, and a little more political. The cast and crew of ‘Will & Grace’ spill the secrets to the revival’s unlikely success.", "authors": "Kevin Fallon", "wrap": "/content/dailybeast/entertainment", "article": {"section": "entertainment", "published_time": "2018-10-02T08:42:38.513Z", "author": "https://www.thedailybeast.com/authors/kevin-fallon"}, "fb": {"app_id": 189930913679}, "twitter": {"card": "summary_large_image", "site": "@thedailybeast", "creator": "@kpfallon", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_600/f_jpg/fl_lossy,q_auto/v1538434110/181001-fallon-will-grace-tease2_qekwcd"}, "sailthru.date": "2018-10-02T08:42:38.513Z", "sailthru.expire_date": "2018-10-16T08:42:38.513Z", "publicationDate": 201810020842, "parsely-page": "{\"author\":\"Kevin Fallon\",\"link\":\"https://www.thedailybeast.com/on-set-with-will-and-grace-how-this-became-the-one-tv-revival-that-actually-works\",\"metadata\":{\"articleType\":\"article\",\"rubric\":\"OH, HONEY\"},\"post_id\":\"on-set-with-will-and-grace-how-this-became-the-one-tv-revival-that-actually-works\",\"pub_date\":\"2018-10-02T08:42:38+00:00\",\"section\":\"Entertainment\",\"tags\":[\"LGBT\",\"Television\",\"Megan Mullally\",\"typeArticle\"],\"title\":\"On Set With ‘Will & Grace’: How This Became the One TV Revival That Actually Works\",\"type\":\"post\"}"}, "movies": ["https://www.youtube.com/embed/3x6nay26Blw?&enablejsapi=1&playsinline=0&autoplay=0", "https://www.youtube.com/embed/UlSjHpLJ9A4?&enablejsapi=1&playsinline=0&autoplay=0", "https://www.youtube.com/embed/BoHDadIfPa4?&enablejsapi=1&playsinline=0&autoplay=0", "https://www.youtube.com/embed/fVxVLQfC2zY?&enablejsapi=1&playsinline=0&autoplay=0"], "publish_date": 1538469758.513, "source": "https://www.thedailybeast.com", "summary": ""}