{"url": "www.newidea.com.au/meghan-markle-prince-harry-expecting-a-baby-erin-specht", "text": "Sister-in-law Erin Specht has revealed the bombshell pregnancy news in an exclusive interview with New Idea, announcing that she believes the newlyweds will try for a baby straight away on their honeymoon.\n\nRevealing that Meghan is ‘desperate to have a family of her own’, Erin adds: ‘She wants kids. She will be an amazing mother.\n\n‘Meghan will get pregnant in her first year of marriage if she can. For certain she will be trying for a baby on their honeymoon – she is going to be a brilliant mum.\n\nErin Specht\n\n‘Having a family is going to be a priority for her in their first year of marriage. She also has the pressure of being a royal now as well!\n\n‘But being a mum is something which she really wants and she has all the perfect qualities. Patience, kindness and a wonderful nature. And she is just great with kids already.’\n\nErin reveals that she’s seen Meghan’s beautiful and intuitive maternal side in person, impressed as she watched the actress play with her young nephews Ty and TJ.\n\n‘She was great with them, playing games, running around,’ Erin tells New Idea. ‘She was a teenager at the time. They adored her and she was clearly a great aunty. She has a good heart.’\n\nWhile Erin says Meghan has always loved children, it’s only since meeting Harry that she’s had her heart set on becoming a mum.\n\nThe actress was married to film producer Trevor Engelson for two years, but Erin says it wasn’t the time to start a family.\n\n‘He just wasn’t the right man for her – when you know you know,’ Erin says. ‘And then being a mum was not something she talked about really when they were together.\n\n‘She said she wanted a family, but never in the way she wanted it now. I think she knew it wasn’t right at that time, which is why she concentrated on work.\n\n‘Now she is with the right person. She really wants a family and Harry is perfect for her.\n\nThey are going to be great parents together.’ Erin – who dated Meghan’s brother Tom for 16 years – says she first met Meghan at Easter in 2001 at a family gathering, just after she started dating the royal-to-be’s brother, commenting that she was immediately struck by her poise and grace.\n\n‘Meghan was sweet and kind and had a lovely graceful manner about her,’ says Erin, adding that the former Suits actress was immediately drawn to her pet bunnies.\n\n‘I kind of go by how my animals react to people. She had all the bunnies sitting out here with her nephews. You know when somebody naturally mothers something?\n\n‘You could just feel someone, feel their heart, their nurturing, their cuddling.’\n\nAnd it’s that nurturing spirit that is sure to make Meghan a wonderful royal mum, says Erin – and an even better “people’s princess”.\n\n‘The royal family is lucky to have her,’ Erin says of Meghan.\n\n‘She absolutely could be more popular than Diana.\n\n‘Meghan is just a normal, everyday person who’s gotten to live a fairytale – not because she chased that or made it, it just came true for her.\n\n‘It couldn’t have happened to a better person.’\n\nFor the full story see this weeks issue of New Idea - out now!", "images": ["http://www.newidea.com.au/Branding/newidea/images/brand-logo-gray.svg", "https://snowplow.swm.digital/i?e=se&se_ca=ping&tv=http-get-0.1.0&dtm=0&stm=0&tna=pac&p=web", "http://www.newidea.com.au/media/73139/ni4619_cover_nobc_bws.png?height=158", "http://www.newidea.com.au/Branding/newidea/Images/idm-error-icon.svg", "http://www.newidea.com.au/media/23888/meghan-markle-prince-harry-1.jpg", "http://www.newidea.com.au/Branding/newidea/images/gmail.svg", "http://secure-gl.imrworldwide.com/cgi-bin/m?ci=au-pacmags&cg=0&cc=1&ts=noscript", "http://www.newidea.com.au/Branding/NewIdea/images/brand-logo-footer-new.svg", "http://www.newidea.com.au/Branding/newidea/images/idm-thanks-icon.svg", "http://www.newidea.com.au/Branding/NewIdea/images/enhanced-header-logo.svg"], "top_img": "http://www.newidea.com.au/media/23888/meghan-markle-prince-harry-1.jpg", "keywords": [], "authors": ["New Idea"], "canonical_link": "https://www.newidea.com.au/meghan-markle-prince-harry-expecting-a-baby-erin-specht", "title": "Meghan and Harry: We're having a baby already!", "meta_data": {"language": "en-us", "description": "Kensington Palace is preparing to hear the pitter patter of royal feet, with confirmation a baby is on the way for Prince Harry and Meghan Markle.", "news_keywords": "Prince Harry, Meghan Markle, Prince Harry and Meghan Markle, Prince Harry wedding, Meghan Markle wedding, Prince Harry and Meghan Markle royal baby, Meghan Markle pregnant, royal baby, royal baby news, latest royal baby, Meghan Markle pregnancy, pregnancy, the royal family, royal family news, latest royal family news, Meghan Markle baby, Prince Harry dad, Prince Harry to be a dad, pregnant royal, royal preganancy announcement", "robots": "index, follow", "og": {"site_name": "New Idea", "type": "article", "url": "https://www.newidea.com.au/meghan-markle-prince-harry-expecting-a-baby-erin-specht", "title": "Meghan and Harry: We're having a baby already!", "description": "Kensington Palace is preparing to hear the pitter patter of royal feet, with confirmation a baby is on the way for Prince Harry and Meghan Markle.", "image": {"identifier": "http://www.newidea.com.au/media/23888/meghan-markle-prince-harry-1.jpg", "width": 1500, "height": 800}}, "twitter": {"title": "Prince Harry and Meghan Markle reportedly having a baby", "description": "Kensington Palace is preparing to hear the pitter patter of royal feet, with confirmation a baby is on the way for Prince Harry and Meghan Markle.", "image": "http://www.newidea.com.au/media/23888/meghan-markle-prince-harry-1.jpg", "url": "https://www.newidea.com.au/meghan-markle-prince-harry-expecting-a-baby-erin-specht"}, "fb": {"admins": 863618607005758, "pages": 140279489324860}, "msvalidate.01": "3BD3CB44DC500E9821E82E085D0F0D13", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1520194058.942, "source": "http://www.newidea.com.au", "summary": ""}