{"url": "https://comicbook.com/marvel/2018/09/05/captain-marvel-movie-2019-brie-larson-entertainment-weekly/", "text": "It looks like something major for Captain Marvel could be fast approaching.\n\nBrie Larson, who will star in the upcoming Marvel Studios film as Carol Danvers/Captain Marvel, recently teased that she and Entertainment Weekly will \"break the Internet\" sometime tomorrow.\n\nHey @EW I’m bored. Wanna break the Internet tomorrow? — Brie Larson (@brielarson) September 5, 2018\n\nEntertainment Weekly has since responded to Larson's tweet, hinting that the surprise will be happening at 12 p.m. ET.\n\nYes! Meet us here at noon ET. We’ve got something Marvel-ous in mind. ? — Entertainment Weekly (@EW) September 5, 2018\n\nIt's anyone's guess as to exactly what reveal will be breaking the internet, whether its a few official promo photos — similarly to how the magazine has covered upcoming releases Aquaman and Shazam! — or something else entirely. But with rumors swirling around that the film's first trailer could arrive sometime this month, fans will surely be excited to see the promotional campaign officially beginning.\n\nCaptain Marvel will see Larson's Carol Danvers making her highly-anticipated big screen debut, as she becomes a superhero in the 1990s amid the Kree-Skrull War. The film is co-directed by Mississippi Grind and It's Kind of a Funny Story's Anna Boden and Ryan Fleck, and will also star Samuel L. Jackson, Ben Mendelsohn, Jude Law, and Lashana Lynch.\n\n\"We really were bringing so much of what was already in the comics onto the screen, it felt like, in terms of the amazing character who’s so funny and sassy and talks back, and she’s fearless,\" screenwriter Geneva Robertson-Dworet said in a previous interview. \"I love that Carol Danvers is so funny. She has a blast when she kicks ass. Those comics are amazing! It’s an amazing world and sandbox to play in. You’re working with incredible creative people, every day. I had a total dream experience.\"\n\n\"I think the way the film opens is much different than an origin movie, and because she is a heroine that you haven't seen before, we're able to tell this story structurally in a way that will feel unexpected and hopefully will keep audiences off balance,\" producer Nate Moore said of the 1990s-set adventure. \"Still balanced enough that they can enjoy the film, but even just making it a period film is sort of interesting in that it's not just a function of the world as we know it in the MCU today.\"\n\nAre you excited by Larson's Captain Marvel tease? What do you think the surprise could be? Let us know what you think in the comments below.\n\nAvengers: Infinity War is now available on digital platforms, DVD, and Blu-ray. Ant-Man and the Wasp is in theaters now. Other upcoming Marvel Cinematic Universe movies include Captain Marvel on March 8, 2019; the fourth Avengers movie on May 3, 2019; and Spider-Man: Far From Home on July 5, 2019.", "images": ["https://media.comicbook.com/2017/11/captain-marvel-filming-january-avengers-4-1059837-640x320.jpg", "https://www.gamespot.com/bundles/phoenixsite/images/core/loose/logo-gamespot-clear.png"], "top_img": "https://media.comicbook.com/2017/11/captain-marvel-filming-january-avengers-4-1059837-640x320.jpg", "keywords": [], "authors": [], "canonical_link": "https://comicbook.com/marvel/2018/09/05/captain-marvel-movie-2019-brie-larson-entertainment-weekly/", "title": "Brie Larson Teases Massive 'Captain Marvel' Debut Tomorrow", "meta_data": {"description": "It looks like something major for Captain Marvel could be fast approaching.Brie Larson, who will star in the upcoming Marvel Studios film as Carol Danvers/Captain Marvel, recently teased that she and Entertainment Weekly will 'break the Internet' sometime tomorrow.Hey @EW I’m bored. Wanna break [...]", "keywords": "Captain Marvel,Brie Larson,Marvel Cinematic Universe,Marvel Studios", "news_keywords": "Captain Marvel,Brie Larson,Marvel Cinematic Universe,Marvel Studios", "twitter": {"card": "summary", "site": "ComicBook", "creator": "ComicBook", "title": "Brie Larson Teases Massive 'Captain Marvel' Debut Tomorrow", "description": "It looks like something major for Captain Marvel could be fast approaching.Brie Larson, who will [...]", "image": "https://media.comicbook.com/2017/11/captain-marvel-filming-january-avengers-4-1059837-640x320.jpg"}, "og": {"title": "Brie Larson Teases Massive 'Captain Marvel' Debut Tomorrow", "type": "article", "url": "https://comicbook.com/marvel/2018/09/05/captain-marvel-movie-2019-brie-larson-entertainment-weekly/", "image": {"identifier": "https://media.comicbook.com/2017/11/captain-marvel-filming-january-avengers-4-1059837-640x320.jpg", "width": 640, "height": 320}, "site_name": "Marvel", "description": "It looks like something major for Captain Marvel could be fast approaching.Brie Larson, who will [...]"}, "fb": {"app_id": 231517050198188, "pages": 1075190092524035}, "p": {"domain_verify": "5ad45d41467dc74340d8100ffa0f2a73"}, "google-site-verification": "x7hVrjifSfYWJfj0-FWACv2DSoXFbHhXgJ62RjFIkgs", "viewport": "width=device-width, initial-scale=1, maximum-scale=5,user-scalable=0"}, "movies": [], "publish_date": 1536076800.0, "source": "https://comicbook.com", "summary": ""}