{"url": "https://en.wikipedia.org/wiki/Robert_Kardashian", "text": "American attorney and businessman\n\nThis article is about the attorney. For his son, the television personality, see Rob Kardashian\n\nRobert George Kardashian (February 22, 1944 – September 30, 2003) was an American attorney and businessman. He gained national recognition as O. J. Simpson's friend and defense attorney during Simpson's 1995 murder trial. He had four children with his first wife, Kris Kardashian (née Houghton, later Jenner): Kourtney, Kim, Khloé, and Rob, who appear on their family reality television series, Keeping Up with the Kardashians, and its spinoffs.\n\nEarly life\n\nKardashian was born in Los Angeles, California. He has a sister and brother, Barbara and Tom Kardashian.[2][3] His great-grandparents, Saghatel (\"Sam\") and Harom Kardaschoff, were ethnic Armenian Spiritual Christian Prygun[4] immigrants from Karakale (now: Merkezkarakale), Kars Oblast of the Russian Empire (now Kars Province in Turkey). The family, known at the time by the surname Kardaschoff, in Russian style, made their way from their home village of Karakale probably to Bremerhaven, Germany, a popular emigration port. From there, they traveled to a new life in America. Their son Tatos anglicized his name to Tom, started a business in garbage collection in Los Angeles, and married another Kars-Karakale immigrant, Hamas Shakarian.[citation needed]\n\nGrowing up in the Baldwin Hills area of Los Angeles, Kardashian attended Susan Miller Dorsey High School and the University of Southern California, from which he graduated in 1966 with a B.S. degree in business administration.[5] He earned a J.D. degree from the University of San Diego School of Law and practiced for about a decade; after that, he went into business. In 1973, Kardashian was one of the co-founders of the trade publication Radio & Records, which he and his partners sold for a large profit in 1979.[5] Kardashian also pioneered the idea of playing music between movies in theaters. He subsequently parlayed the concept into a business, starting a company called Movie Tunes.[6][7][8][9] He served as President and CEO of the firm and later invested in Juice Inc., a frozen yogurt company, and in a music video business called Concert Cinema.[10][11]\n\nO. J. Simpson case\n\nKardashian and Simpson first met around 1967 while both of them were at USC and became close friends.[12] Simpson was the best man at Robert Kardashian and Kris Jenner's wedding in 1978. Robert was the water boy for the USC Trojans football team which would be ranked #1 in the nation in the AP Poll.[citation needed]\n\nFollowing the June 12, 1994, murder of Nicole Brown Simpson and Ronald Goldman, Simpson stayed in Kardashian's house to avoid the media. Kardashian was the man seen carrying Simpson's garment bag the day that Simpson flew back from Chicago. Prosecutors speculated that the bag may have contained Simpson's bloody clothes or the murder weapon.[13] When Simpson failed to turn himself in at 11 a.m. on June 17, 1994, Kardashian read a letter by Simpson to the assembled media. This letter was interpreted by many as a suicide note.[14]\n\nSimpson was charged with the murders and subsequently acquitted of all criminal charges in a controversial criminal trial. Kardashian had let his license to practice law become inactive before the Simpson case but reactivated it to aid in Simpson's defense as a volunteer assistant on his legal team, alongside Simpson's main defense attorneys, Robert Shapiro and Johnnie Cochran. As one of Simpson's lawyers and a member of the defense \"Dream Team\", Kardashian could not be compelled or subpoenaed to testify against Simpson in the case, which included Simpson's past history and behavior with his ex-wife Nicole, and as to the contents of Simpson's garment bag.[15] He sat by Simpson throughout the trial.[16]\n\nThe New York Times reported that Kardashian said in a 1996 ABC interview with Barbara Walters that he had begun to question Simpson's innocence: \"I have doubts. The blood evidence is the biggest thorn in my side; that causes me the greatest problems. So I struggle with the blood evidence.\"[15] Kardashian and Simpson ultimately stopped speaking to each other.\n\nIllness and death\n\nKardashian was diagnosed with esophageal cancer in July 2003. He died two months later, on September 30, 2003, at age 59,[17] and was buried at Inglewood Park Cemetery in Inglewood, California.[18]\n\nIn popular culture\n\nKardashian was portrayed by David Schwimmer in the 2016 FX miniseries American Crime Story: The People v. O. J. Simpson. Schwimmer was nominated for the Primetime Emmy Award for Outstanding Supporting Actor in a Limited Series or Movie for his performance, but lost to Sterling K. Brown, who portrayed Christopher Darden in the same series. In 2016, ESPN Films and their 30 for 30 series produced a five-part miniseries called O.J.: Made in America, produced by Ezra Edelman, in which Kardashian was featured heavily through archive footage.\n\nIn 2017, Kardashian was the subject of the pilot episode of the TV comedy series Over My Dead Body on Amazon Prime.[19]\n\nPersonal life\n\nKardashian had four children with his first wife, Kris Kardashian (née Houghton, subsequently Jenner): Kourtney, Kimberly, Khloé, and Rob.[20]\n\nShortly after separating from his first wife in 1991, Kardashian became engaged to Denice Shakarian Halicki, widow of movie producer H.B. Halicki.[21][22] The couple never married. In 1998, Kardashian married Jan Ashley; however, the marriage ended in annulment 30 days later. Ashley later claimed frequent upset and turmoil related to Kardashian's ex-wife Kris and their children \"were instrumental\" in the demise of the relationship.[23][24][25] After dating for three years and proposing in 2001, Kardashian married his third wife, Ellen Pierson (née Markowitz), six weeks prior to his death.[26][16]\n\nSee also", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Wikisource-logo.svg/26px-Wikisource-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/28px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/en/7/72/Robert_Kardashian_Sr.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Wikinews-logo.svg/27px-Wikinews-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Wikiversity-logo-en.svg/27px-Wikiversity-logo-en.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Johnny-automatic-scales-of-justice.svg/32px-Johnny-automatic-scales-of-justice.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/06/Wiktionary-logo-v2.svg/27px-Wiktionary-logo-v2.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/LA_Skyline_Mountains2.jpg/32px-LA_Skyline_Mountains2.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikibooks-logo.svg/27px-Wikibooks-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/7/72/Robert_Kardashian_Sr.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Robert_Kardashian", "title": "Robert Kardashian", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/7/72/Robert_Kardashian_Sr.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}