{"url": "https://en.wikipedia.org/wiki/Fredrik_Eklund", "text": "Fredrik Eklund (born April 26, 1977) is a Swedish New York City-based real estate broker, a Bravo TV reality star, a former IT entrepreneur in his native Sweden, and the author of The Sell.[1][2]\n\nEarly life and education [ edit ]\n\nEklund is the brother of author Sigge Eklund and the son of Klas Eklund, who is a senior economist at Swedish bank SEB.[3] His paternal grandparents were Swedish-Danish-Irish-Russian actors Bengt Eklund and Fylgia Zadig.[4][5]\n\nEklund had his first American experience as a foreign exchange student in Edina, Minnesota, where he attended Edina High School. After finishing high school, Eklund studied at the Stockholm School of Economics, but never graduated.[6] He has worked for the financial newspaper Finanstidningen. At the age of 23, Eklund founded an Internet company with over 45 employees, and went on to work for the investment bank SEB in Stockholm, London, Singapore and Tokyo before beginning his work in New York City.[7]\n\nFilm career [ edit ]\n\nIn 2004, before arriving in New York City, Eklund acted in a number of pornographic films under the pseudonym Tag Eriksson (or Tag Ericsson).[8] In an interview with Out Magazine, Eklund has said of this period, \"It was only a week of my life, accumulated. It was spread out over a few months, so it was a very short period of my life. It was something that I tried and quickly decided that I was done with.\" Eklund went on to say in the interview that he is proud of who he is, that he does not regret anything, and that his past involvement in the pornographic film industry has not negatively affected his career.[8]\n\nReal estate career [ edit ]\n\nEklund has closed over five billion dollars in residential real estate.[9] Eklund became Managing Director at the New York City real estate firm CORE Group Marketing and in 2010, alongside his business partner John Gomes, Managing Director at Prudential Douglas Elliman, the largest real estate brokerage on the East Coast. Eklund also started the top-selling team at Elliman.[9]\n\nEklund is the founder of Eklund Stockholm New York,[10] Scandinavia's most high-end residential real estate brokerage with 50 employees and $1 billion in closed sales in 2014.[9] He is an active member of the Real Estate Board of New York.[7]\n\nMillion Dollar Listing New York [ edit ]\n\nThe New York Times featured Eklund on the front page of the \"Sunday Style\" section in November 2010.[3] He is one of five New York City brokers starring in Bravo's Million Dollar Listing New York.[11]\n\nPersonal life [ edit ]\n\nOn February 9, 2013, Eklund married artist Derek Kaplan on Little Palm Island in the Florida Keys.[12] The couple lived in New York with their dogs Mouse and Fritzy until 2016.[13] They have since moved to Roxbury, Connecticut, to live in a mansion Eklund purchased.[14] Eklund and Kaplan attempted to have children through surrogacy, but the surrogate suffered a miscarriage.[15]\n\nIn November 2017, Eklund and Kaplan had twins via surrogate: daughter Milla and son Fredrik Jr.[16]\n\n\n\n", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Fredrik_Eklund", "title": "Fredrik Eklund", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}