{"url": "deadline.com/2017/05/brad-grey-dead-hollywood-reactions-paramount-1202093717/", "text": "UPDATED with more reactions: Refresh for latest… Hollywood is waking up to the news that Brad Grey, who ran Paramount Pictures for 12 years as chairman and CEO and before that was a partner in the powerhouse management/production company Brillstein-Grey Entertainment, has died of cancer at 59. Grey exited Paramount officially in February.\n\nHere are some reactions to the death of the man who oversaw a number of Paramount franchises including Transformers, Star Trek, Mission: Impossible, Paranormal Activity and Jackass. And before that at Brillstein, he worked on The Sopranos, Real Time with Bill Maher, The Steve Harvey Show and, of course, Garry Shandling’s The Larry Sanders Show.\n\nHere is what Hollywood is saying. Check back for updates.\n\nRelated Story Brad Grey Dies OF Cancer: Former Paramount Chief Was 59\n\nDavid Chase, The Sopranos creator:\n\n“Brad was a grand partner and colleague. His taste was exquisite, he was so intelligent. When you went to pitch with Brad, it was actually fun. He had such confidence underneath a cool, amused exterior. The thing I will remember most about Brad is his generosity. He loved movies, he loved entertainment, he loved life. He loved his success and he made sure to share it with the people who surrounded him. I’m going to miss him terribly.”\n\nMartin Scorsese, Oscar-winning filmmaker:\n\n“Brad Grey was a true friend, and he genuinely loved movies. Our professional relationship started with The Departed, which he basically shepherded into existence —sadly, he is uncredited as a producer on that picture, but that’s the title he deserved. He and I worked together on every picture I made since, all the way through Silence, and he was always extremely protective of the creative process, very careful to keep it separate from all infighting and financial entanglements — in other words, the business. Like so many of Brad’s friends, I’m in a state of shock.”\n\nJim Gianopulos, Chairman & CEO of Paramount Pictures:\n\nAll of us at Paramount are deeply saddened by the news of Brad Grey’s passing. He was at the helm of the studio for over a decade and was responsible for so many of it’s most beloved films. We extend our deepest sympathies to Cassandra, Max, Sam, Emily and Jules Grey, along with Brad’s mother, brother and sister. I was proud to call Brad a friend, and one I greatly admired. He will be missed by us all, and left his mark on our industry and in our hearts.\n\nI am devastated over the loss of my best friend since I was twenty-two, Brad Grey. My heart is with his family, who are my family. — bob saget (@bobsaget) May 15, 2017\n\nBrillstein Entertainment Group:\n\nBrad was a unique force in our business and a self-made man. Brad helped forge a new paradigm in representing artists and worked to reinvent how a management company can serve its clients. Our hearts go out to his family, whom he loved dearly. As a company, we are indebted to his legacy.\n\nJim Berkus, UTA chairman:\n\n“Brad Grey was a colleague, collaborator and, most importantly, a great friend. As a talent executive, he fought for his clients and helped stretch the boundaries of tradition to enable his clients to do great things. As a studio executive, he was committed to making movies that would stand the test of time. He created a legacy in our industry that will have a lasting impact. All of UTA mourns his loss, and we will miss him greatly.”\n\nAt Bernie Brillstein memorial Brad said to me, \"In the blink of an eye John, it goes so fast, enjoy it all\" I'm in shock. #BradGrey pic.twitter.com/Lw6Fw7WeT9 — John Stamos (@JohnStamos) May 15, 2017\n\nHBO:\n\nAll of us at HBO are heartsick to learn of the passing of our colleague and friend Brad Grey. From his early days as a founding partner of Brillstein-Grey, he brought many great comedic artists to HBO, and of course one of TV’s most iconic shows, The Sopranos, for which he served as Executive Producer. More importantly he was a friend, supporter and cheerleader for all of us for many years. We will miss him very much. Our heart goes out to his entire family.\n\nBob Iger, Chairman and CEO of the Walt Disney Company:\n\nI was stunned and saddened to learn of Brad Grey’s passing. He was a dear friend, a respected colleague, and a great guy. He will be sorely missed by everyone who had the privilege of knowing him. My thoughts are with his wife Cassandra, his children, and his entire family.\n\nBob Weinstein, Co-Chairman of the Weinstein Company:\n\nI knew Brad for over 40 years. He started out as me and my brother’s assistant and within 6 months it was clear that we should be working for him and not the other way around. He was destined for great things in this business, but more importantly on a personal level, I knew him as a family man and nothing was more important to him than that. My condolences to his family and he will be missed.\n\nFilmmaker Ava Duvernay:\n\nBefore Selma was released, he invited me to dinner. Fab stories. Good laughs. And shrewd advice that I still use. May his soul be at rest.\n\nRest In Peace, Brad Grey. He was always good to me, in the small passing moments we had. My heart goes out to his family and loved ones. — James Gunn (@JamesGunn) May 15, 2017\n\nI was lucky to be represented by Brad Grey early in my career. He was kind and brilliant, always genuine and always there. A huge loss. — Christian Slater (@ChristianSlater) May 15, 2017\n\nGary Barber, Chairman and CEO of MGM :\n\n“I am deeply devastated by the untimely passing of Brad. My thoughts and prayers are with his family during this difficult time.”\n\nShocked &saddened by the loss of Brad Grey. He was a really good man. Kind &classy and a helluva boss. Oh man the world has lost a gentleman — Jon M. Chu (@jonmchu) May 15, 2017\n\nMPAA Chairman & CEO Chris Dodd:\n\n“I was deeply saddened to learn of the passing of Brad Grey, a colleague and friend. As a producer and industry leader, Brad brought great storytelling to audiences around the world, and his contributions to the creative community will be enjoyed for years to come. Our thoughts and prayers are with his family.”\n\nSad to hear about ex-Paramount chief Brad Grey. A genuinely smart, genuinely nice man. — Mark Millar (@mrmarkmillar) May 15, 2017\n\nStunned and saddened at passing of Brad Grey, fmr head of @ParamountPics Too soon to lose him Condolences to Cassandra and his family 🙏 #rip — DeborahNorville (@DeborahNorville) May 15, 2017\n\n#BradGrey and #BernieBrillstein had a company called Brillstein/Gray. Bernie was one of the funniest men I ever knew. Now Brad is gone. — Chuck Woolery (@chuckwoolery) May 15, 2017\n\nBrad Grey – my manager, my producer, my friend. R.I.P. — Alan Zweibel (@AlanZweibel) May 15, 2017\n\nNo. Saw the trend… the new \"call in the middle of the night.\" #RIP #BradGrey. You were a gentleman & a true lover of talent. A great loss. — Will Scheffer (@schefferwill) May 15, 2017\n\nBrad Grey has passed! So so sad. Sending love and respect to family and loved ones. — Marsha Mason (@Seriouslyperky) May 15, 2017\n\n#BREAKING: Saddened to learn former Paramount/CEO Brad Grey has died of cancer at 59. Met a few times, very kind. #BradGrey #Paramount — Kyle Hunter (@KyleHunter) May 15, 2017\n\nSorry to hear about the death of Brad Grey. His fingerprints are on a lot of great stuff, and his loyalty to Scorsese was a blessing. — Glenn Kenny (@Glenn__Kenny) May 15, 2017\n\nWriter-director Dan Hannon:\n\nNot long after taking the reins at Paramount, he bought a script of mine. It was my first sale in the biz. Thanks again. RIP Brad Grey.", "images": ["https://pmcdeadline2.files.wordpress.com/2017/05/brad-grey-david-chase.jpg?w=201&h=300", "https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=deadline.com&path=%2F2017%2F05%2Fbrad-grey-dead-hollywood-reactions-paramount-1202093717%2F&ct=article&lob=deadline&loc=us&env=desktop&post_id=1202093717&comment_count=12", "https://pmcdeadline2.files.wordpress.com/2016/10/brad-grey.jpg?w=1024", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1", "http://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://s0.wp.com/wp-content/themes/vip/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript"], "top_img": "https://pmcdeadline2.files.wordpress.com/2016/10/brad-grey.jpg?w=1024", "keywords": [], "authors": ["Patrick Hipes Erik Pedersen", "Patrick Hipes", "Erik Pedersen"], "canonical_link": "https://deadline.com/2017/05/brad-grey-dead-hollywood-reactions-paramount-1202093717/", "title": "Brad Grey: Hollywood Reacts To Death Of Former Paramount Chief", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Deadline", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "Friends and colleagues in Hollywood and around the industry are reacting to the death of former Paramount chief Brad Grey, who died of cancer at 59.", "news_keywords": "Brad Grey, Paramount Pictures, The Larry Sanders Show", "apple-itunes-app": "app-id=533209613", "generator": "WordPress.com", "og": {"type": "article", "title": "Brad Grey: Hollywood Reacts To Death Of Former Paramount Chief", "url": "https://deadline.com/2017/05/brad-grey-dead-hollywood-reactions-paramount-1202093717/", "description": "UPDATED with more reactions: Refresh for latest… Hollywood is waking up to the news that Brad Grey, who ran Paramount Pictures for 12 years as chairman and CEO and before that was a partner i…", "site_name": "Deadline", "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2016/10/brad-grey.jpg?w=1024", "width": 1200, "height": 800}, "locale": "en_US"}, "article": {"published_time": "2017-05-15T22:36:42+00:00", "modified_time": "2017-05-16T00:11:47+00:00"}, "twitter": {"site": "@Deadline", "text": {"title": "Brad Grey: Hollywood Reacts To Death Of Former Paramount Chief"}, "image": "https://pmcdeadline2.files.wordpress.com/2016/10/brad-grey.jpg?w=1024", "card": "summary_large_image", "title": "Brad Grey: Hollywood Reacts To Death Of Former Paramount Chief", "description": "Friends and colleagues in Hollywood and around the industry are reacting to the death of former Paramount chief Brad Grey, who died of cancer at 59."}, "author": "Erik Pedersen", "content_type": "Article", "post_id": 1202093717, "title": "Brad Grey: Hollywood Reacts To Death Of Former Paramount Chief", "published_at": "2017-05-15 15:36:42", "image": "https://pmcdeadline2.files.wordpress.com/2016/10/brad-grey.jpg?w=296&h=166&crop=1", "comment_count": 12, "tags": "The Larry Sanders Show", "topics": "TV", "body": "UPDATED with more reactions: Refresh for latest... Hollywood is waking up to the news that Brad Grey, who ran Paramount Pictures for 12 years as chairman and CEO and before that was a partner in the powerhouse management/production company Brillstein-Grey Entertainment, has died of cancer at 59. Grey exited Paramount officially in February.\r\n\r\nHere are some reactions to the death of the man who oversaw a number of Paramount franchises including Transformers, Star Trek, Mission: Impossible, Paranormal Activity and  Jackass. And before that at Brillstein, he worked on The Sopranos, Real Time with Bill Maher, The Steve Harvey Show and, of course, Garry Shandling's The Larry Sanders Show.\r\n\r\nHere is what Hollywood is saying. Check back for updates.\r\n\r\n\r\n\r\nDavid Chase, The Sopranos creator:\r\n\"Brad was a grand partner and colleague. His taste was exquisite, he was so intelligent. When you went to pitch with Brad, it was actually fun. He had such confidence underneath a cool, amused exterior. The thing I will remember most about Brad is his generosity. He loved movies, he loved entertainment, he loved life. He loved his success and he made sure to share it with the people who surrounded him. I'm going to miss him terribly.\"\r\n\r\nMartin Scorsese, Oscar-winning filmmaker:\r\n\"Brad Grey was a true friend, and he genuinely loved movies. Our professional relationship started with The Departed, which he basically shepherded into existence —sadly, he is uncredited as a producer on that picture, but that’s the title he deserved. He and I worked together on every picture I made since, all the way through Silence, and he was always extremely protective of the creative process, very careful to keep it separate from all infighting and financial entanglements — in other words, the business. Like so many of Brad’s friends, I’m in a state of shock.\"\r\n\r\nJim Gianopulos, Chairman & CEO of Paramount Pictures:\r\nAll of us at Paramount are deeply saddened by the news of Brad Grey's passing. He was at the helm of the studio for over a decade and was responsible for so many of it's most beloved films. We extend our deepest sympathies to Cassandra, Max, Sam, Emily and Jules Grey, along with Brad's mother, brother and sister. I was proud to call Brad a friend, and one I greatly admired. He will be missed by us all, and left his mark on our industry and in our hearts.\r\n\r\nhttps://twitter.com/bobsaget/status/864189370827390977\r\n\r\nBrillstein Entertainment Group:\r\nBrad was a unique force in our business and a self-made man. Brad helped forge a new paradigm in representing artists and worked to reinvent how a management company can serve its clients.  Our hearts go out to his family, whom he loved dearly. As a company, we are indebted to his legacy.\r\n\r\nJim Berkus, UTA chairman:\r\n“Brad Grey was a colleague, collaborator and, most importantly, a great friend. As a talent executive, he fought for his clients and helped stretch the boundaries of tradition to enable his clients to do great things. As a studio executive, he was committed to making movies that would stand the test of time. He created a legacy in our industry that will have a lasting impact. All of UTA mourns his loss, and we will miss him greatly.\"\r\n\r\nhttps://twitter.com/JohnStamos/status/864195704377401344\r\n\r\nHBO:\r\nAll of us at HBO are heartsick to learn of the passing of our colleague and friend Brad Grey.  From his early days as a founding partner of Brillstein-Grey, he brought many great comedic artists to HBO, and of course one of TV’s most iconic shows, The Sopranos, for which he served as Executive Producer. More importantly he was a friend, supporter and cheerleader for all of us for many years. We will miss him very much. Our heart goes out to his entire family.\r\n\r\nBob Iger, Chairman and CEO of the Walt Disney Company:\r\nI was stunned and saddened to learn of Brad Grey’s passing. He was a dear friend, a respected colleague, and a great guy. He will be sorely missed by everyone who had the privilege of knowing him. My thoughts are with his wife Cassandra, his children, and his entire family.\r\n\r\nBob Weinstein, Co-Chairman of the Weinstein Company: \r\nI knew Brad for over 40 years. He started out as me and my brother's assistant and within 6 months it was clear that we should be working for him and not the other way around.  He was destined for great things in this business, but more importantly on a personal level, I knew him as a family man and nothing was more important to him than that.  My condolences to his family and he will be missed.\r\n\r\nFilmmaker Ava Duvernay:\r\nBefore Selma was released, he invited me to dinner. Fab stories. Good laughs. And shrewd advice that I still use. May his soul be at rest.\r\n\r\nhttps://twitter.com/JamesGunn/status/864126818122579970\r\n\r\nhttps://twitter.com/ChristianSlater/status/864198805423521792\r\n\r\nGary Barber, Chairman and CEO of MGM :\r\n“I am deeply devastated by the untimely passing of Brad. My thoughts and prayers are with his family during this difficult time.”\r\n\r\nhttps://twitter.com/jonmchu/status/864135182206484481\r\n\r\nMPAA Chairman & CEO Chris Dodd:\r\n“I was deeply saddened to learn of the passing of Brad Grey, a colleague and friend. As a producer and industry leader, Brad brought great storytelling to audiences around the world, and his contributions to the creative community will be enjoyed for years to come. Our thoughts and prayers are with his family.”\r\n\r\nhttps://twitter.com/mrmarkmillar/status/864132617934917632\r\n\r\nhttps://twitter.com/DeborahNorville/status/864142913323900928\r\n\r\nhttps://twitter.com/chuckwoolery/status/864178647019778048\r\n\r\nhttps://twitter.com/AlanZweibel/status/864135689264390144\r\n\r\nhttps://twitter.com/schefferwill/status/864132818728648704\r\n\r\nhttps://twitter.com/Seriouslyperky/status/864202417688035328\r\n\r\nhttps://twitter.com/KyleHunter/status/864128761599451136\r\n\r\nhttps://twitter.com/Glenn__Kenny/status/864137914372018176\r\n\r\nWriter-director Dan Hannon:\r\nNot long after taking the reins at Paramount, he bought a script of mine. It was my first sale in the biz. Thanks again. RIP Brad Grey.", "application-name": "Deadline", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Hollywood Entertainment Breaking News", "msapplication-task": "name=Subscribe;action-uri=https://deadline.com/feed/;icon-uri=https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!", "fb": {"page_id": 105558754896}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1494887802.0, "source": "http://deadline.com", "summary": ""}