{"url": "http://www.today.com/popculture/sinister-truth-about-jim-carrey-wbna17116833", "text": "Ah, the January-February doldrums, when all that Hollywood has to offer is Oscar contenders from last year, inane horror flicks and movies with Eddie Murphy in multiple roles. Truly, this is the cruelest season.\n\nAnd now here we are again, staring down the barrel of yet another Jim Carrey movie. This time he’s starring in thriller “The Number 23” as a guy who starts reading a book called “The Number 23” and discovers that everything in his life is somehow connected numerically to the titular digits. He also starts to suspect that the book might be directly written about him (hello, “Stranger Than Fiction”), which ain’t great news, considering that it ends in murder and bloodshed.\n\nNeedless to say, Carrey’s character begins to lose a few of his marbles, scribbling numbers on walls like Russell Crowe in “A Beautiful Mind” and generally foaming at the mouth and frightening those around him. And he has good cause to be worried; the number 23 consists of a two and a three, and as we discover in the film, two divided by three is 0.666, “the number of the devil.” (I suppose there’s no point in mentioning here that two divided by three is actually 0.6666666… which would really be rounded up to the less-than-Satanic 0.667.)\n\nObviously, the lesson here — apart from “never read a book” — is “numerology has many things to teach us.” I was skeptical, but then I took a good long numerological look at the man once dubbed America’s rubber-faced fartsmith and uncovered a shocking truth: Jim Carrey is the devil. And I don’t mean “devil” in the sense of “lowbrow actor who talks out of his ass.” I mean the actual, literal, capital-D Devil.\n\nLet’s start simply: Take the number of letters in Carrey’s first and last name and you get three and six. Three sixes. 666. Coincidence? Methinks not. He was born in Newmarket, Canada, which is nine letters and then six letters. Add nine and six and you get 15. One plus five is six. You see how this works?\n\nTrending stories,celebrity news and all the best of TODAY. This site is protected by recaptcha\n\nWatch as things turn sinisterCarrey was born on Jan. 17, 1962 — which is, not coincidentally, 13 years to the day after the birth of comedian Andy Kaufman, whom Carrey would play in a 1999 biopic (turn the three nines in 1999 upside down and you get 666). Carrey’s birth date can be written as 1/17/1962, and when you add all the numbers in his birth year (1+9+6+2), you get 18, the same thing you get when you add one (his birth month) and 17 (his birth date). Take the numbers in Carrey’s current age (4+5) and add the number of letters in his hometown, and you again get 18. And what is 18 really? Three sixes.\n\n26 photos Slideshow Celebrity Sightings Jake Johnson and Damon Wayans Jr. on the \"Let's Be Cops,\" red carpet, Selena Gomez is immortalized in wax and more.\n\nMore recently, the actor has had a spate of bad luck, with three upcoming projects he was at one point attached to getting nixed for one reason or another. There was “A Little Game” (11 letters), which would have found James Carrey (11 letters) reteaming with his “Mask” co-star, Cameron Diaz (11 letters). Add those three 11s and you get 33. Three plus three is six.\n\nAnother flick that didn’t seem to get off the ground was “Used Guys” (eight letters) in which Carrey was to star with Ben Stiller (10 letters). Eight plus 10 is 18, and we all know what 18 is — three sixes.\n\nThe third movie, “Ripley’s Believe It or Not,” may be alive and breathing again, but I’ll believe it when I see it. Until then, it’s worth noting that attached director Tim Burton, like Carrey, has three letters in his first name and six in his last (easy multiplication gives us 18 again), and that Carrey would play a character named Robert Ripley (two names of six letters each).\n\nEven more reasons to be suspiciousHad enough? Of course not. Carrey’s breakout year was 1994, which saw the release of three movies of his that turned out to be huge and cemented his career: “Ace Ventura: Pet Detective,” “The Mask” and “Dumb & Dumber.” The sum of the digits in the year (1+9+9+4) is 23. Multiply two by three and you get six, which gives you one six for each movie he released that year — 666. Oh, and since “Ace Ventura,” Carrey’s made (you guessed it) 18 movies.\n\nWhen faced with this mounting heap of evidence, I was left with two possible explanations: Jim Carrey is closely connected to the number of the beast, or numerology is preposterous nonsense and I’d been wasting my time like those conspiracy nuts who claim to draw incontrovertible parallels between John F. Kennedy and Abraham Lincoln.\n\nThe obvious conclusion is that Carrey is Satan. QED.\n\nThe doubting Thomases among you may be inclined to dismiss this kind of highly scientific analysis as mere data cherry-picking or superstitious hocus pocus. And true, it’s probably too early to start eyeing the skies for a rain of blood or a plague of locusts. But it’s worth pointing out that Mr. Carrey himself has had a keen interest in numerology and the number 23 particularly, since long before he signed on to make the film. He even named his production company JC23 because of his belief in the power of those particular digits. If he buys into it when it comes to his life, why can’t you?\n\nAnd finally, I’ll leave you with one last bit of telling evidence: An anagram of “Lucifer” is “rice flu.” An anagram of “Jim Carrey” is “my rice jar.” This means something. Think about it.\n\nPatrick Enright is a freelance writer and editor whose work has appeared in MSNBC.com, Mr. Showbiz, Wall of Sound, Movies.com and Seattle Weekly.", "images": ["https://media3.s-nbcnews.com/j/newscms/2019_18/1432044/today-3rd-hour_9370906f7c40d78db8842bc0c3e628a7.10000;74;7;80;3.png", "https://media4.s-nbcnews.com/j/newscms/2020_03/1529838/weekend-today-menu_94be02e0ac821819fdb22a090c28163f.10000;74;7;80;3.png", "https://media4.s-nbcnews.com/j/newscms/2018_52/2696426/food_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2019_18/1432043/hodaandjenna_00d9547321553d5a5f55c2b3973c514b.10000;74;7;80;3.png", "https://media4.s-nbcnews.com/j/newscms/2018_52/2696446/shop_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696466/wellness_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media4.s-nbcnews.com/j/newscms/2018_52/2696481/today_4bc7d2146c228dd9a02a3c15b38527d0.10000;74;7;80;3.png", "https://media3.s-nbcnews.com/j/MSNBC/Components/Slideshows/_production/TODAY-ready/ss-140808-twics/ss-140808-twics-tease.focal-600x300.jpg", "https://media2.s-nbcnews.com/j/newscms/2018_52/2696456/style_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696461/videos_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media2.s-nbcnews.com/j/newscms/2018_52/2696491/williegeist_4bc7d2146c228dd9a02a3c15b38527d0.10000;74;7;80;3.png", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696431/home_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696436/parenting_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media2.s-nbcnews.com/j/newscms/2019_01/2705201/today-social-default_b6fa4fef0d31ca7e8bc7ff6d117ca9f4.social_share_1200x630_center.png", "https://media2.s-nbcnews.com/j/newscms/2018_52/2696441/popculture_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg"], "top_img": "https://media2.s-nbcnews.com/j/newscms/2019_01/2705201/today-social-default_b6fa4fef0d31ca7e8bc7ff6d117ca9f4.social_share_1200x630_center.png", "keywords": [], "authors": ["Getty Images North America"], "canonical_link": "https://www.today.com/popculture/sinister-truth-about-jim-carrey-wbna17116833", "title": "The sinister truth about Jim Carrey", "meta_data": {"msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/today/all-other-sizes-PNG.ico/ms-icon-144x144.png", "msapplication-config": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/today/all-other-sizes-PNG.ico/browserconfig.xml", "fb": {"app_id": 122384521533, "admins": 100001657893615, "pages": 157687092983}, "og": {"site_name": "TODAY.com", "locale": "en_US", "url": "http://www.today.com/popculture/sinister-truth-about-jim-carrey-wbna17116833", "title": "The sinister truth about Jim Carrey", "description": "‘The Number 23’ isn’t just a movie title when it comes to this former rubber-faced comedian. By Patrick Enright", "image": {"identifier": "https://media2.s-nbcnews.com/j/newscms/2019_01/2705201/today-social-default_b6fa4fef0d31ca7e8bc7ff6d117ca9f4.social_share_1200x630_center.png", "secure_url": "https://media2.s-nbcnews.com/j/newscms/2019_01/2705201/today-social-default_b6fa4fef0d31ca7e8bc7ff6d117ca9f4.social_share_1200x630_center.png", "type": "image/png", "width": 1200, "height": 630}, "type": "article"}, "twitter": {"site": "@TodayShow", "creator": "TodayShow", "image": "https://media2.s-nbcnews.com/j/newscms/2019_01/2705201/today-social-default_b6fa4fef0d31ca7e8bc7ff6d117ca9f4.social_share_1024x512_center.png", "title": "The sinister truth about Jim Carrey", "description": "‘The Number 23’ isn’t just a movie title when it comes to this former rubber-faced comedian. By Patrick Enright", "card": "summary_large_image"}, "viewport": "width=device-width, initial-scale=1", "description": "‘The Number 23’ isn’t just a movie title when it comes to this former rubber-faced comedian. By Patrick Enright", "article": {"opinion": "false", "content_tier": "free"}, "thumbnail": "https://media2.s-nbcnews.com/j/newscms/2019_01/2705201/today-social-default_b6fa4fef0d31ca7e8bc7ff6d117ca9f4.social_share_1024x768_scale.png", "apple-itunes-app": "app-id=416357699"}, "movies": [], "publish_date": 1171999985.0, "source": "http://www.today.com", "summary": ""}