{"url": "https://en.wikipedia.org/wiki/Nikki_Reed", "text": "The Young and the Restless, see This article is about the American actress. For the fictional character on the soap opera, see Nikki Newman\n\nAmerican actress\n\nNicole Houston Reed (born May 17, 1988)[1] is an American actress, screenwriter, singer-songwriter, and model. She is known for playing vampire Rosalie Hale in The Twilight Saga (2008–2012). She became known in 2003, after the release of the film Thirteen, directed by Catherine Hardwicke, for which she was credited with Hardwicke as a co-writer of the screenplay, and in which she played a lead role. The film earned Reed an Independent Spirit Award for Best Debut Performance, as well as several nominations.\n\nEarly life [ edit ]\n\nReed was born in West Los Angeles, California, the daughter of Cheryl Houston, a beautician, and Seth Reed, a production designer. She has an older brother, Nathan August Reed, and a younger half-brother, Joey Reed. Her mother is a Christian of Cherokee and Italian descent, and her father is Jewish.[2] Reed was raised without religion[3] and has identified as Jewish.[4][5] She grew up around some Jewish practices, as her brother had a Bar Mitzvah.[6]\n\nReed has said in numerous interviews that her early home life was \"complicated\". Her parents divorced when Reed was two, and she was raised by her mother.[7] In 2002, when Reed was 14 years old, she moved out of her mother's house and began living on her own, mainly in apartments in the Los Angeles area.[8] After Thirteen's success, Reed returned to Alexander Hamilton High School in Los Angeles, but dropped out again after a year. She said that \"mothers who were sneaking into the school at lunchtime to confront and harass her about the film\" were the reason for her departure.[7] She earned a high school diploma through homeschooling.[7] She is a vegetarian.\n\nCareer [ edit ]\n\nCatherine Hardwicke, a friend of her mother's,[9] invited her to work on a script with her, when Reed said she was interested in acting. They finished the script for the semi-autobiographical film Thirteen in six days. Producers asked Reed to play a role in the film because they had trouble casting it, as it was an \"uncomfortable\" role for most young actresses.[7]\n\nOndine at the 2010 Tribeca Film Festival. Reed at the premiere ofat the 2010 Tribeca Film Festival.\n\nThe film, starring Evan Rachel Wood, was released in 2003 to positive reviews, gaining Reed some recognition in Hollywood as both a screenwriter and an actress. Following this, Reed was invited to appear on The Ellen DeGeneres Show and serve as host on a number of award shows, including the Young Hollywood Awards (2003) and the Independent Spirit Awards Nomination Show, followed by the West Independent Spirits Awards, both in 2004. Reed has repeatedly been cast as sexually advanced, precocious teenagers, including her character in Lords of Dogtown (2005), also directed by Hardwicke. In early 2006, she appeared on the series The O.C., playing Sadie, a new love interest for the character Ryan Atwood. Reed later appeared on The O.C. at the same time as future Twilight co-stars Cam Gigandet and Jackson Rathbone.[10]\n\nReed said that her early decision to avoid acting in television series or in mainstream cinema was naïve. She had thought at the time they were not right for her, but had since gained valuable experience in them.[11] She had a lead role in Mini's First Time, which received a limited release in the United States on July 14, 2006. Reed played a teenager who, through seduction, involves her stepfather in a plot to murder her mother. Reed has noted that her character does not \"understand the weight of consequence\". She said she had enjoyed playing someone who she describes as \"crass\" and having a \"trucker's mouth\".[12] Reed's character has sex scenes. As Reed was 16 at the time and legally unable to film such scenes in an explicit way, she was filmed from the back to hide her face.[7] On February 12, 2008, it was announced that Reed would portray Rosalie Hale in the film adaption of Twilight, the first book of a popular four-novel series. Directed by Catherine Hardwicke, it became an international success.\n\nIn 2010, Jason Mewes said that he was doing a movie called K-11 with Reed and Kristen Stewart, also of Twilight.[13] The film, directed by Stewart's mother, takes place in a dorm of the Los Angeles County Jail. It was to feature both Stewart and Reed as female characters.[14][15] Later that year, Reed said that she was no longer part of the project.[16]\n\nIn July 2010, Reed joined the cast of the lady assassin action-drama Catch .44, alongside Bruce Willis, Forest Whitaker and Malin Akerman.[17] In November 2010, it was announced that Reed would star with Hayden Panettiere in the film Downers Grove, a movie adaptation of Michael Hornburg's novel.[18] The screenplay was written by Bret Easton Ellis, the novelist who wrote The Rules of Attraction and American Psycho.[19]\n\nIn December 2011, it was announced that Reed joined the cast of Pawn, an indie crime thriller directed by David A. Armstrong. The film also stars Forest Whitaker, Ray Liotta, Common, Michael Chiklis, Sean Faris, Stephen Lang, Marton Csokas and Jessica Szohr.[20] In July 2013, Reed joined the cast of the independent sports comedy Balls Out, alongside Jake Lacy, Kate McKinnon, Beck Bennett and Jay Pharoah. The film is about a group of college friends who get together in their final year to play a game of intramural football.[21]\n\nMusic [ edit ]\n\nReed recorded a song, \"Now That I've Found You\", with her then-husband Paul McDonald, which debuted on Ryan Seacrest's radio show on November 15, 2011.[22] The couple released their first EP, The Best Part, on October 29, 2012.[23] Their song \"All I've Ever Needed\" is on The Twilight Saga: Breaking Dawn – Part 2 soundtrack.[24]\n\nIn January 2013, Reed filmed Hanson's 2013 music video for their single, \"Get the Girl Back\",[25] also with McDonald. The video was released in April 2013. Other well-known figures in the video include Kat Dennings, Drake Bell, Drew Seeley, Amy Paffrath, and Alex Beh.\n\nWriting and directing [ edit ]\n\nReed wrote a script set in New Zealand between the 1960s and the 1980s. She has said she feels more versatile than her typecasting in roles of \"sexy bad girls.\" She has sometimes been told by producers that she is too \"sexy\" for a particular part.[7] In November 2009, Reed directed a music video for her friend Sage while in London. Reed stated that they didn't have much time, or money, but she takes great pride in it.[26][27] Reed also intends to direct a music video for the independent rock band 100 Monkeys,[28] which is fronted by her Twilight co-star, Jackson Rathbone.\n\nPersonal life [ edit ]\n\nReed met Paul McDonald, a singer-songwriter and former American Idol contestant, on the red carpet at the premiere of Red Riding Hood in March 2011. This moment was broadcast on an American Idol episode as part of a segment that showed the contestants attending the premiere.[29] The couple began dating,[30] and moved in together not long after.[31] They confirmed their engagement in June 2011,[32] and married on October 16, 2011, in Malibu, California.[33] In March 2014, Reed and McDonald announced that they had separated after living apart for the previous six months due to \"work obligations\".[34] Reed filed for divorce in May 2014, and the divorce was finalized on January 2, 2015.[35]\n\nReed began dating actor Ian Somerhalder in mid-2014.[36] They confirmed their engagement in February 2015,[37] and married on April 26, 2015, in Malibu, California.[38] On May 4, 2017, the couple announced via Instagram that Reed was pregnant with their first child.[39] They had their child, a daughter in July 2017.[40]\n\nReed is close friends with her Twilight co-star Jackson Rathbone[41][42] and Spy Kids actress Alexa Vega, who was her matron of honor at her first wedding.[43]\n\nActivism [ edit ]\n\nReed teamed up with Staples and Do Something for their third Annual School Supply Drive in the summer of 2011. She is also an animal rights advocate. She volunteers at animal shelters in her free time and she designed a limited edition collar and leash for Gilt to benefit Aspca. On October 22, 2014, she was honored with the ASPCA Compassion Award for her contributions to animal welfare.[44]\n\nReed endorsed Senator Bernie Sanders for President in the 2016 U.S. presidential election.[45]\n\nBaYou With Love [ edit ]\n\nIn 2017, Reed and friend Morgan Bogle set up a sustainable jewelry brand BaYou With Love. The company works with Dell into turning recycled technology into jewelry.[46]\n\nFilmography [ edit ]\n\nTelevision Year Title Role Notes 2006 Sadie Campbell 6 episodes 2006 Justice Molly Larusa 1 episode 2015–2016 Sleepy Hollow Betsy Ross 15 episodes 2019 Dollface Bronwyn 1 episode 2019 V-Wars Rachel 5 episodes\n\nAwards and nominations [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Nikki_Reed%2C_Kellan_Lutz_%26_Ashley_Greene_%287585875756%29.jpg/220px-Nikki_Reed%2C_Kellan_Lutz_%26_Ashley_Greene_%287585875756%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Nikki_Reed_2_by_David_Shankbone.jpg/183px-Nikki_Reed_2_by_David_Shankbone.jpg", "https://upload.wikimedia.org/wikipedia/commons/0/0b/Nikki_Reed_Oct_%28cropped%29.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Nikki_Reed_Comic-Con_4%2C_2012.jpg/210px-Nikki_Reed_Comic-Con_4%2C_2012.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Nikki_Reed_Oct_%28cropped%29.jpg/220px-Nikki_Reed_Oct_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Nikki_Reed_Oct_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Nikki_Reed", "title": "Nikki Reed", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Nikki_Reed_Oct_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}