{"url": "https://www.vanityfair.com/hollywood/2015/08/zac-efron-we-are-your-friends", "text": "For Efron, every film post High School Musical has been a total re-invention, a death of the Old Zac and a rebirth of the New Zac. Every part has been a stretch—the type of stretch that incites critics to wonder aloud, “Er, can Zac Efron do [X]?,” that is: “Can Zac Efron believably hang out with Orson Welles in the 1930s?” “Can Zac Efron be trusted to headline a beloved Dr. Seuss classic?” “Can Zac Efron convincingly play an angsty race-car-driver-cum-farmer-cum-son-of-Dennis-Quaid?” And, again, coming up Friday, there’s We Are Your Friends, starring Efron as a young man who wants nothing more from life than to mash up house tracks for college students rolling on ecstasy. “Can Zac Efron make us care about D.J.s?”\n\nThe answer to all of these questions is yes, even when it's technically no. Because Zac Efron can make us care about anything, even if that thing is terrible.\n\nHe is wildly attractive and desperately charming, but also, somehow, extremely attainable in an Old-Hollywood-meets-New-Jersey way that makes you (the royal you, but also me) feel like he is going to sweep you off your feet, carry you up a winding staircase, make enthusiastic love to you in his four-poster bed, then order pizza and play Call of Duty with you and wink at you when you have a particularly clutch kill. He is the Everyman and Superman at the same time. It’s a quality his That Awkward Moment co-star Miles Teller described as follows: “With the right lighting, that movie star thing happens. It’s like a falling star just happened in his eyes.” It’s a quality that made Matt Lauer blush and giggle and write off that aforementioned red-carpet condom drop as a safe-sex promo. It’s a quality that made it impossible for Seth Rogen to hate him, even though Seth Rogen really, really wanted to hate him, but instead went ahead and cast him as his co-star in Neighbors (and in the upcoming sequel). It’s a quality that made us all forget about that time he got into a “tussle” with a homeless dude.\n\nWe love Efron because he’s got the bone structure of an Italian statue but the palpable confusion of an Italian tourist; because he’s a walking contradiction. In other words, he’s just a human. He’s us. What better proof than the fact that Efron prefers playing characters who are trying to improve, who just want to break free? “I’m constantly searching for characters that are about betterment of self and betterment of others,” he told T.H.R. “And I’m searching for those parts because those are the ones that make me happy. They’re the ones that fulfill me personally.”\n\nSo, in the spirit of infinite chances, let’s say this about Efron’s next attempt to keep his head above water: We Are Your Friends may be a bad film, but it could also be his last one, the true start of something new. With a sequel to Neighbors, a spring-break movie with Robert De Niro, and a Baywatch movie with The Rock on the way, his upcoming work is targeted at a frat-bro audience, but with a prestige that seems purposeful. And it cannot be a coincidence that the year of We Are Your Friends is also the year that Efron engaged in the act of, as he put it, “Taking over my social. Get ready.” (This means that previous tweets and Instagrams—including this one and this one—were posted by his shills in hopes of shaping an image that had been fractured many times over.) Is there any better proof that Zac Efron is taking ownership of his career than the fact that he’s finally confident enough to star exclusively in films that see him shirtless throughout and to post his own heavily filtered photos?\n\nIt’s hard to know for sure where We Are Your Friends will take Efron, but what I do know is that we’ll all be there, watching, waiting, as he valiantly tries to re-invent himself yet again. Because we are your friends, Zac. We’re all in this together.", "images": ["https://www.vanityfair.com/verso/static/hwd/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg", "https://media.vanityfair.com/photos/53d7e6b3f447d4ab3b000649/master/w_1600%2Cc_limit/zb_wormfeeds.gif", "https://www.vanityfair.com/verso/static/hwd/assets/logo-header.7b6624f3aa336c67441a33a3e19289ee14eaf5c7.svg", "https://media.vanityfair.com/photos/53d7e670a923ddc66900064f/master/w_1600%2Cc_limit/zb_parachute.gif", "https://media.vanityfair.com/photos/53d7e8c1f447d4ab3b00064a/master/w_1600%2Cc_limit/zb_firsthighfive.gif", "https://media.vanityfair.com/photos/55d4cfb5169027501c6fa14d/16:9/w_1280,c_limit/zac-efron-high-school-musical-paper-boy-we-are-your-friends.jpg", "https://media.vanityfair.com/photos/55d4cfb5169027501c6fa14d/master/w_2560%2Cc_limit/zac-efron-high-school-musical-paper-boy-we-are-your-friends.jpg", "https://media.vanityfair.com/photos/55d4ed6c169027501c6fa598/master/w_1600%2Cc_limit/zac-efron-we-are-your-friends.jpg"], "top_img": "https://media.vanityfair.com/photos/55d4cfb5169027501c6fa14d/16:9/w_1280,c_limit/zac-efron-high-school-musical-paper-boy-we-are-your-friends.jpg", "keywords": [], "authors": ["Rachel Handler", "Rachel Handle"], "canonical_link": "https://www.vanityfair.com/hollywood/2015/08/zac-efron-we-are-your-friends", "title": "Why We Keep Loving Zac Efron, No Matter How Many Times He Fails", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Rachel Handler", "copyright": "Copyright (c) Condé Nast 2020", "description": "Whether or not We Are Your Friends is a hit, it fits the narrative that has made Efron’s career a success, even when it doesn’t seem to be.", "id": "55d4d10d8fbf768838dcfa58", "keywords": "movies,zac efron,we are your friends", "news_keywords": "movies,zac efron,we are your friends", "robots": "index, follow", "content-type": "article", "parsely-post-id": "55d4d10d8fbf768838dcfa58", "parsely-metadata": "{\"description\":\"Whether or not We Are Your Friends is a hit, it fits the narrative that has made Efron’s career a success, even when it doesn’t seem to be.\",\"image-16-9\":\"https://media.vanityfair.com/photos/55d4cfb5169027501c6fa14d/16:9/w_1000,c_limit/zac-efron-high-school-musical-paper-boy-we-are-your-friends.jpg\",\"image-1-1\":\"https://media.vanityfair.com/photos/55d4cfb5169027501c6fa14d/1:1/w_1000,c_limit/zac-efron-high-school-musical-paper-boy-we-are-your-friends.jpg\"}", "og": {"description": "Whether or not We Are Your Friends is a hit, it fits the narrative that has made Efron’s career a success, even when it doesn’t seem to be.", "image": "https://media.vanityfair.com/photos/55d4cfb5169027501c6fa14d/16:9/w_1280,c_limit/zac-efron-high-school-musical-paper-boy-we-are-your-friends.jpg", "site_name": "Vanity Fair", "title": "Why We Keep Loving Zac Efron, No Matter How Many Times He Fails", "type": "article", "url": "https://www.vanityfair.com/hollywood/2015/08/zac-efron-we-are-your-friends"}, "article": {"content_tier": "metered", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@VanityFair", "description": "Whether or not We Are Your Friends is a hit, it fits the narrative that has made Efron’s career a success, even when it doesn’t seem to be.", "domain": "https://www.vanityfair.com", "image": {"src": "https://media.vanityfair.com/photos/55d4cfb5169027501c6fa14d/16:9/w_1280,c_limit/zac-efron-high-school-musical-paper-boy-we-are-your-friends.jpg?mbid=social_retweet"}, "site": "@VanityFair", "title": "Why We Keep Loving Zac Efron, No Matter How Many Times He Fails"}, "fb": {"app_id": 305927716147259, "pages": 8810407571}, "google-signin-client_id": "1065629119444-svrqo31taikd2j0ji4dgjs9q3vul4133.apps.googleusercontent.com"}, "movies": [], "publish_date": null, "source": "https://www.vanityfair.com", "summary": ""}