{"url": "en.wikipedia.org/wiki/Katie_Holmes", "text": "This article is about the American actress. For the historian, see Katie Holmes (historian)\n\nAmerican actress, producer, and director\n\nKate Noelle Holmes (born December 18, 1978)[3] is an American actress, producer, and director. She first achieved fame as Joey Potter on the television series Dawson's Creek (1998–2003).\n\nShe made her feature film debut in Ang Lee's The Ice Storm in 1997.[9] Subsequent film roles include: Go, Teaching Mrs. Tingle (both 1999), Wonder Boys, The Gift (both 2000), Abandon, Phone Booth (both 2002), The Singing Detective, Pieces of April (both 2003), Batman Begins, Thank You for Smoking (both 2005), Mad Money (2008), Don't Be Afraid of the Dark (2010), Jack and Jill (2011), Miss Meadows (2014), Woman in Gold, Touched with Fire (both 2015) and Logan Lucky (2017).\n\nIn 2008, she made her Broadway theatre debut in a production of Arthur Miller's All My Sons. In 2011, she played Jacqueline Kennedy in the TV miniseries The Kennedys, a role she reprised in The Kennedys: After Camelot (2017). She made her directorial debut with the 2016 film All We Had, in which she also starred.\n\nHer marriage to actor Tom Cruise,[10] which lasted from 2006 to 2012, led to a great deal of media attention, with the pair being called a supercouple and being given the nickname \"TomKat\" in various countries.\n\nEarly life [ edit ]\n\nHolmes was born in Toledo, Ohio.[11] She is the youngest of five children born to Kathleen, a homemaker and philanthropist, and Martin Joseph Holmes Sr., an attorney who played basketball at Marquette University under coach Al McGuire.[12][13][14][15] She has three sisters and one brother. Holmes was baptized a Roman Catholic and attended Christ the King Church in Toledo.[16]\n\nShe graduated from the all-female Notre Dame Academy in Toledo (also her mother's alma mater), where she was a 4.0 student.[17][18] At St. John's Jesuit and St. Francis de Sales, nearby all-male high schools, Holmes appeared in school musicals, playing a waitress in Hello, Dolly! and Lola in Damn Yankees.[19] She scored 1310 out of 1600 on her SAT and was accepted to Columbia University (and attended for a summer session);[11][17] her father wanted her to become a doctor.[18]\n\nAt age 14, she began classes at a modeling school in Toledo which led her to the International Modeling and Talent Association (IMTA) Competition held in New York City in 1996. Eventually, Holmes was signed to an agent after performing a monologue from To Kill a Mockingbird.[8] An audition tape was sent to the casting director for the 1997 film The Ice Storm, directed by Ang Lee, and Holmes made her big-screen debut in the role of Libbets Casey in the film, opposite Kevin Kline and Sigourney Weaver.[19]\n\nCareer [ edit ]\n\n1997–2003: Dawson's Creek and career development [ edit ]\n\nHolmes in May 2006\n\nIn January 1997, Holmes went to Los Angeles for pilot season, when producers cast and shoot new programs in the hopes of securing a spot on a network schedule. The Toledo Blade reported she was offered the lead in Buffy the Vampire Slayer but she turned it down in order to finish high school.[19] Columbia TriStar Television, producer of a new show named Dawson's Creek that was created by screenwriter Kevin Williamson, asked her to come to Los Angeles to audition, but there was a conflict with her schedule. \"I was doing my school play, Damn Yankees. And I was playing Lola. I even got to wear the feather boa. I thought, 'There is no way I'm not playing Lola to go audition for some network. I couldn't let my school down. We had already sold a lot of tickets. So I told Kevin and The WB, 'I'm sorry. I just can't meet with you this week. I've got other commitments.'\"[7][19][20]\n\nThe producers permitted her to audition on videotape. Holmes read for the part of Joey Potter, the tomboy best friend of the title character Dawson, on a videotape shot in her basement, her mother reading Dawson's lines.[7][21]\n\nThe Hollywood Reporter claimed the story of Holmes's audition \"has become the stuff of legend\" and \"no one even thought that it was weird that one of the female leads would audition via Federal Express.\"[22] Holmes won the part. Paul Stupin, executive producer of the show, said his first reaction on seeing her audition tape was \"That's Joey Potter!\"[23] Creator and executive producer Kevin Williamson said Holmes has a \"unique combination of talent, beauty and skill that makes Hollywood come calling. But that's just the beginning. To meet her is to instantly fall under her spell.\"[24] Williamson thought she had exactly the right look for Joey Potter. \"She had those eyes, those eyes just stained with loneliness.\"[25] While Dawson's Creek was met with mixed reviews,[26] Holmes attained national attention.[27][28] Holmes was soon on the covers of magazines such as Seventeen, TV Guide, and Rolling Stone. Jancee Dunn, an editor at Rolling Stone said she was chosen for the cover because \"every time you mention Dawson's Creek you tend to get a lot of dolphin-like shrieks from teenage girls. The fact that she is drop-dead gorgeous didn't hurt either.\"[29]\n\nDuring her time as a series regular on Dawson's Creek, Holmes first leading role in a film came in 1998's Disturbing Behavior, a Scream-era Stepford Wives-goes-to-high school thriller, where she was a loner from the wrong side of the tracks. The film was recut from what the director intended. Roger Ebert of the Chicago Sun-Times wrote of her character, Rachel, \"dresses in black and likes to strike poses on the beds of pickup trucks and is a bad girl who is in great danger of becoming a very good one.\"[30][31] Despite the fact that it received mixed reviews and was not a huge financial success, the actress won a MTV Movie Award for Best Breakthrough Performance for the role and also received a Saturn Award nomination for the part. Holmes, though, said the film was \"just horrible.\"[18] In 1999, she played a disaffected supermarket clerk in Doug Liman's ensemble piece Go.[32] The film received excellent reviews and made a profit, and Holmes herself was liked by critics. The same year, in Kevin Williamson's Teaching Mrs. Tingle, which he wrote and directed, Holmes played a straight-A student whose vindictive teacher (Helen Mirren) threatens to keep her from a desperately needed scholarship.[33] Also in 1999, she had an uncredited cameo with Dawson's Creek co-star Joshua Jackson in Muppets from Space, which was filmed in Wilmington where Dawson's Creek also filmed.[34]\n\nThe year 2000 saw Holmes feature in two film roles. The first was in Wonder Boys, directed by Curtis Hanson from the novel by Michael Chabon. The film told the story of a creative writing teacher at a university, with Michael Douglas in the leading role. Holmes had a small role (six and one-half minutes of screen time) as Hannah Green, the talented student who lusts after Professor Grady Tripp (Douglas's character, who is her instructor and landlord). Many leading critics at the time took favorable notice to Holmes in the film. Kenneth Turan of the Los Angeles Times said she was \"just right as the beauty with kind of a crush on the old man.\"[25][35][36] Her second feature film during 2000 was The Gift, a Southern Gothic story directed by Sam Raimi and starring Cate Blanchett, she played the antithesis of Joey Potter: a promiscuous rich girl having affairs with everyone from a sociopathic wife-beater (Keanu Reeves) to the district attorney (Gary Cole), and is murdered by her fiancé (Greg Kinnear). Holmes did her first nude scene for the film, in a scene where her character was about to be murdered. Her appearance was lamented by Variety's Steven Kotler.[37] In Ohio, the scene met with disapproval from Russ Lemmon writing in the Toledo Blade.[38]\n\nHolmes hosted Saturday Night Live on February 24, 2001, participating in a send-up of Dawson's Creek where she falls madly in love with Chris Kattan's Mr. Peepers character and singing \"Big Spender\" from Sweet Charity. In the 2002 film Abandon, written by Oscar winner Stephen Gaghan, Holmes plays a delusional, homicidal college student named \"Katie\". Todd McCarthy of Variety and Roger Ebert commended her performance,[39] but other critics savaged it.[40] During the final season of Dawson's Creek, Holmes played the mistress of the public relations flack played by Colin Farrell in Phone Booth, which was both critically and financially successful. She also appeared as Robert Downey, Jr.'s nurse in The Singing Detective (2003). Dawson's Creek ended its run in 2003, and Holmes was the only actor to appear in all 128 episodes. \"It was very difficult for me to leave Wilmington, to have my little glass bubble burst and move on. I hate change. On the other hand it was refreshing to play someone else\", she said in 2004.[41]\n\n2003–2009: Focus on film career, brief hiatus, and theatre work [ edit ]\n\nHolmes' first starring role post-Dawson's Creek was in 2003's Pieces of April, a gritty comedy about a dysfunctional family on Thanksgiving. Many critics and audiences agreed that Holmes had given her best performance in the film as April. Variety said it was \"one of her best film performances.\"[42] \"Each actor shines\", wrote Elvis Mitchell, \"even Ms. Holmes, whose beauty seems to have fogged the minds of her previous directors\" in playing \"a brat who is slaving to find her inner decency and barely has the equipment for such an achievement, let alone to serve a meal whose salmonella potential could claim an entire borough. Yet it is her surliness, as well as her intransigent determination to make Thanksgiving work, that keeps the laughs coming.\"[43] Holmes also received a Satellite Award for Best Actress for the role. On the November 9, 2003 episode, she was Punk'd by Ashton Kutcher and the next year she was the subject of an episode of the MTV program Diary.[44]\n\nHolmes was a contender for the role of Christine Daaé in 2004's The Phantom of the Opera,[45] but lost the role to Emmy Rossum. That year, she starred as the U.S. President's daughter in First Daughter, which was originally slated to be released in January 2004 on the same day as Chasing Liberty, another film about a president's daughter, but was ultimately released in September 2004, to negative reviews and low ticket sales. First Daughter, directed by Forest Whitaker, also starred Michael Keaton as her character's father and Marc Blucas as her love interest. The Hollywood Reporter's critic called her character Samantha Mackenzie \"a startling example of how a studio film can dumb down and neutralize the comic abilities of a lively young star.\"[46] In the 2005 film Batman Begins she played Rachel Dawes, an attorney in the Gotham City district attorney's office and the childhood sweetheart of the title character. Variety was unenthusiastic. \"Holmes is OK\", was its critic's sole remark on her performance.[47] She was nominated for a Golden Raspberry for \"worst supporting actress\" for the film.[48]\n\nIn 2005, Holmes characterised her film career as being a string of \"bombs.\" \"Usually I'm not even in the top ten\", she said, the highest-grossing film of her career then being Phone Booth.[5] She lamented \"It's not like I have a lot of stuff that's great just waiting for me to sign on to.\"[49] She also appeared in the film version of Christopher Buckley's satirical novel Thank You for Smoking about a tobacco lobbyist played by Aaron Eckhart, whom Holmes's character, a Washington reporter, seduces. Variety wrote one of the film's \"sole relatively weak notes [came] from Holmes, who lacks even a hint of the wiliness of a ruthless reporter\" and The New York Times said the cast was \"exceptionally fine\" except for Holmes, who \"strain[ed] credulity\" in her role.[50][51] The film ended up a success, even earning a nomination for the Golden Globe Award for Best Motion Picture - Musical or Comedy. Also in 2005, Holmes had agreed to play in Shame on You, a biopic about the country singer Spade Cooley written and directed by Dennis Quaid, as the wife whom Cooley (played by Quaid) stomps to death. But the picture, set to shoot in New Orleans, Louisiana, was delayed by Hurricane Katrina, and Holmes dropped out due to her pregnancy.[52][53][54] After her daughter, Suri Cruise, was born in April 2006, Holmes took a hiatus from her acting career until 2008.[citation needed]\n\nAfter speculation about Holmes reprising her role in The Dark Knight, the sequel to Batman Begins, it was finally confirmed that she would not appear. Her role was later recast with Maggie Gyllenhaal in her place.[55] Instead, Holmes decided to star in the comedy Mad Money, opposite Diane Keaton and Queen Latifah in 2008. The film flopped.[56] The Canadian Press criticized Holmes's performance, \"While Keaton has long done zany and giddy well, and she and Latifah have an interesting contrast of personalities, Holmes' presence feels like an afterthought.\"[57] The New York Post, The New York Times and Variety also criticized Holmes' performance in the film, and The New York Times called Holmes \"the movie's weakest link\".[58][59]\n\nReturning to television in 2008, Holmes appeared in an episode of Eli Stone as Grace, a lawyer, and her singing and dancing was praised by Tim Stack of Entertainment Weekly.[60] Holmes made her Broadway debut in the revival of Arthur Miller's All My Sons[61] in October 2008. She opened to mixed reviews. Ben Brantley of The New York Times claimed \"the neophyte Ms. Holmes\" is a \"sad casualty\" of director Simon McBurney's \"high concept approach\" to the play. He adds that \"Ms. Holmes delivers most of her lines with meaningful asperity, italicizing every word.\"[62] Clive Barnes of the New York Post was similarly unimpressed by Holmes – and had few compliments for her co-stars. He wrote, \"John Lithgow starts in a sunny, benign fashion, but eventually finds himself screeching alongside Holmes, looking tough under a glossy wig.\"[63] However, the New York Daily News' Joe Dziemianowicz took a more positive view of her stage debut, writing, \"Holmes, a TV and film vet, makes a fine Broadway debut. Her rather grand speech pattern takes getting used to, but she seems comfortable and adds a fitting glint of glamour.\"[64] In 2009, Holmes appeared in the National Memorial Day Concert on the Mall in Washington, D.C. in a dialogue with Dianne Wiest celebrating the life of an American veteran seriously wounded in Iraq, José Pequeño.[65]\n\n2010–present: Television work and return to film [ edit ]\n\nIn 2009, Holmes began filming a remake of the 1970s ABC telemovie Don't Be Afraid of the Dark; the film was released in August 2011.[66] Also in 2011, Holmes played the role of Jackie Kennedy in the TV miniseries The Kennedys. In October 2011, she also portrayed \"Slutty Pumpkin\" (Naomi), in the TV show How I Met Your Mother, episode \"The Slutty Pumpkin Returns\".[citation needed]\n\nIn 2012, Holmes appeared in Theresa Rebeck's new comedy Dead Accounts on Broadway.[67] Holmes and Chace Crawford were reportedly cast as the leads in the romantic comedy Responsible Adults, to begin shooting in Los Angeles in \"Fall 2011\".[68][69][70] In 2015, Holmes joined the third season of Ray Donovan.[71]\n\nHolmes directed a short 2015 documentary for ESPN about Olympic gymnast Nadia Comăneci entitled, Eternal Princess, that premiered at the Tribeca Film Festival.[72][73]\n\nShe directed her first movie All We Had.[74] The film stars Katie Holmes, Stefania LaVie Owen, Luke Wilson, Richard Kind, Mark Consuelos, Judy Greer and Eve Lindley. The film was released on December 9, 2016, by Gravitas Ventures.[75]\n\nIn 2017, Holmes starred in the heist comedy Logan Lucky, directed by Steven Soderbergh. The film received positive reviews, with many critics praising the cast's performances and Soderbergh's direction, and grossed $48 million worldwide.[76]\n\nIn 2018, she appeared in the satirical comedy Dear Dictator, opposite Michael Caine.[77] The same year, she made a cameo in the movie Ocean's 8, starring Sandra Bullock, Cate Blanchett, Anne Hathaway, Mindy Kaling, Sarah Paulson, Rihanna, Helena Bonham Carter, and Awkwafina. The film follows a group of women led by Debbie Ocean, the sister of Danny Ocean, who plan a sophisticated heist of the annual Met Gala at the Metropolitan Museum of Art in New York City, United States. Ocean's 8 premiered at Alice Tully Hall on June 5, 2018, and was released by Warner Bros. Pictures in the United States on June 8, 2018, 11 years to the day of the release of Ocean's Thirteen. The film has grossed over $297 million worldwide and received a lukewarm response from critics, who applauded the chemistry of the cast but found the movie undemanding and less consistent than the films in Soderbergh's trilogy.\n\nIn a September 2016 Elle interview, Holmes stated that she is in the process of adapting the Kathleen Tessaro novel Rare Objects into a screenplay and will direct the film.[78] It was announced Holmes will also be leading a feature film based around the self-help book, The Secret, by Rhonda Byrne.[79]\n\nPublic image [ edit ]\n\nHolmes was annually named by both the British and American editions of FHM magazine as one of the sexiest women in the world from 1999 onward. She was named one of People's \"50 Most Beautiful People\" in 2003; its sibling Teen People declared her one of the \"25 Hottest Stars Under 25\" that year;[80][81] and in 2005, People said she was one of the ten best dressed stars that year.[82] She has appeared in advertisements for Garnier Lumia haircolor, Coach leather goods, and clothing retailer Gap.[83]\n\nIn November 2008, it was confirmed that she would be the new face of the spring 2009 campaign for the high-end fashion line Miu Miu.[84] In 2008, Holmes started a high fashion clothing line called Holmes & Yang with longtime stylist Jeanne Yang.[85] Model Heidi Klum is a fan of the line.[86] In July 2009, Holmes, Nigel Lythgoe, Adam Shankman, and Carrie Ann Inaba announced the launch of a dance scholarship fund called the Dizzy Feet Foundation.[87]\n\nBeginning January 2011, she became the new face of Ann Taylor Spring 11 collection.[88] Holmes & Yang presented their fashion line at New York Fashion Week for the first time in September 2012.[89][90] Holmes acted as the face for the Bobbi Brown Cosmetics brand in spring 2013 and Holmes had her own capsule collection of color cosmetics in fall of that year.[91] In 2013, she appeared in an advertising campaign for IRIS Jewelry.[92] In January 2013, Holmes was announced as the brand ambassador and co-owner of Alterna Haircare.[93]\n\nPersonal life [ edit ]\n\nHolmes with Tom Cruise in May 2009\n\nHolmes dated her Dawson's Creek co-star Joshua Jackson early in the show's run.[94] She met actor Chris Klein in 2000. They were engaged in late 2003, but in early 2005 ended their relationship.[95][96][97][98] They have remained friends to varying degrees since the breakup.[99]\n\nHolmes began dating actor Tom Cruise in April 2005. Holmes, who was raised a Catholic,[100][101] began studying Scientology shortly after the couple began dating.[102] They got engaged in June 2005, only seven weeks after meeting.[103] The couple's daughter, Suri, was born on April 18, 2006, the first anniversary of their first date. The name \"Suri\" supposedly derives from the Persian meaning \"red rose\" and the Hebrew as a derivative of Sarah meaning princess.[104] On November 18, 2006, Holmes and Cruise were married in a Scientologist ceremony at the 15th-century Odescalchi Castle in Bracciano, Italy.[10] The actors' publicist said the couple had \"officialized\" their marriage in Los Angeles the day before the Italian ceremony.[105]\n\nIn early March 2011, Holmes filed a $50-million libel lawsuit against Star magazine following a cover story which insinuated that she took drugs.[106] The suit was settled on April 27, 2011, after which Star wrote a public apology in the May 6, 2011, issue and made an \"undisclosed substantial donation\" to Holmes's charity, Dizzy Feet Foundation.[107]\n\nHolmes and Cruise were last photographed together in Iceland on June 16, 2012. On June 29, Holmes filed for divorce from Cruise in New York after five-and-a-half years of marriage.[108][109] Following the announcement, those close to Holmes stated that she believed she had reason to fear that Cruise would abduct Suri, and also feared intimidation by the Church of Scientology.[110][111]\n\nTen days after Holmes filed for divorce, on July 9, 2012, attorneys for the couple announced that the couple had signed a divorce settlement.[112] This was the first divorce for Holmes and the third for Cruise.[113][114] Holmes has custody of Suri.[115]\n\nFollowing her divorce from Cruise, Holmes returned to the Roman Catholic Church and began attending St. Francis Xavier Church.[116]\n\nHolmes dated actor and musician Jamie Foxx until the couple split up in 2019.[117]\n\nAwards [ edit ]\n\nIn June 2011, Holmes received the Women in Film Max Mara Face of the Future Award.[118] In 2005, TV Guide ranked Holmes No. 38 on its \"50 Sexiest Stars of All Time\" list.[119]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nVideo games [ edit ]\n\nYear Title Role Notes 2005 Batman Begins Rachel Dawes Voice\n\nNotes [ edit ]\n\nReferences [ edit ]\n\nBibliography [ edit ]\n\nScott Lyle Cohen. \"Home Sweet Holmes\". Giant . Issue 5. June–July 2005. 52+.\n\n. Issue 5. June–July 2005. 52+. Darren Crosdale. Dawson's Creek: The Official Companion . Kansas City, MO: Andrews McMeel, 1999. ISBN 0-7407-0725-6.\n\n. Kansas City, MO: Andrews McMeel, 1999. ISBN 0-7407-0725-6. Janice Dunn. \"Katie Holmes: A girl on the verge\". Rolling Stone . Issue 795. September 17, 1998. 44.\n\n. Issue 795. September 17, 1998. 44. Caroline Graham. \"What Katie Did Next\". The Mail on Sunday (London). November 9, 2003. 30.\n\n(London). November 9, 2003. 30. Robert Haskell. \"Holmes Sweet Holmes: She's landed the role of a lifetime—beautiful bride of the world's biggest movie star. What's so weird about that?\" W . August 2005. 164+\n\n. August 2005. 164+ \"Katie Holmes\". Current Biography . On-line database accessed February 8, 2006.\n\n. On-line database accessed February 8, 2006. \"Katie Holmes to Wed Actor Chris Klein\". Toledo Blade . December 31, 2003. D3.\n\n. December 31, 2003. D3. Marilyn Johnson and Andrew Southam. \"Nice Girls Finish First: So what does it mean that a very nice girl playing a very thoughtful girl has become TV's teen idol? Consider it a good sign\". Life . March 1999.\n\n. March 1999. Tahree Lane. \"Paris proposal latest plot twist to Holmes-Cruise romance: Toledo native agrees to take on role of wife\". Toledo Blade . June 18, 2005. A1.\n\n. June 18, 2005. A1. Judith Newman. \"The Last Girl Scout\". Allure. v. 13, n. 6. June 2003. 182–189.", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Katie_Holmes%2C_2009.jpg/220px-Katie_Holmes%2C_2009.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Tom_Cruise_%26_Katie_Holmes_WHCAD.jpg/170px-Tom_Cruise_%26_Katie_Holmes_WHCAD.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Katie_Holmes%2C_2009.jpg/1200px-Katie_Holmes%2C_2009.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Katie_Holmes.jpg/200px-Katie_Holmes.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Katie_Holmes%2C_2009.jpg/1200px-Katie_Holmes%2C_2009.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Katie_Holmes", "title": "Katie Holmes", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.27", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Katie_Holmes%2C_2009.jpg/1200px-Katie_Holmes%2C_2009.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}