{"url": "https://web.archive.org/web/20080619025707/http://www.tampabay.com:80/news/politics/elections/article628630.ece", "text": "Fill out this form to email this article to a friend Your name Your email Recipient email\n\nYou may enter up to 20 multiple email addresses, separated by commas.\n\nYour message\n\n\n\nClick here to try again. We were unable to send your email. In reversal, McCain says lift ban on offshore drilling By Wes Allison, Times Staff Writer\n\nIn print: Tuesday, June 17, 2008 Story Tools E-mail this story Contact the editor Print this story Comment on this story Social Bookmarking Digg Facebook Stumbleupon Reddit Del.icio.us Newsvine ADVERTISEMENT WASHINGTON — In a break with his past policy and his allies in the environmental movement, Republican presidential candidate John McCain on Monday called for ending the federal ban on offshore oil and natural gas exploration so coastal states could decide whether to permit drilling. And as an incentive to boost domestic energy production, states that do approve exploration off their shores should be paid \"tangible financial benefits,\" McCain said. \"I think that this … would be very helpful in the short term in resolving our energy crisis,\" he told reporters at his Arlington, Va., campaign headquarters. He plans to expound on his plan today in Houston. \"We've (seen the rising costs of energy) in the form of food prices, in the form of gasoline, in the form of threats of inflation. … And we must — we must — embark on a national mission to eliminate our dependence on foreign oil and reduce greenhouse gases through the development of alternate energy sources,\" he said. \"And, as I said, exploration is a step toward the longer-term goal.\" Gov. Charlie Crist, a close ally of McCain's who has long opposed drilling off Florida's coasts, said he loved the idea of giving states control, and he didn't rule out allowing exploration off Florida. \"It's the last thing in the world I'd like to do, but I also understand what people are paying at the pump, and I understand the drag it is on our economy,\" Crist told the St. Petersburg Times Monday night. \"Something has to be done in a responsible, pragmatic way.\" McCain has supported the moratorium on offshore drilling in the past and has touted his position during campaign stops in Florida. The Arizona senator also opposes drilling in Alaska's Arctic National Wildlife Refuge. But with the price of gasoline topping $4 per gallon, the pressure on him and other politicians to act is enormous, though there is little any of them can do to ease prices in the near term. Environmentalists worry that state legislatures would be unduly influenced by the promise of cash and heavy lobbying by well-financed business groups, such as the Associated Industries of Florida, which supports drilling off Florida. \"It would be hard for state legislatures in Florida and anywhere else to resist a big pot of money being dangled in front of their nose, especially states that are facing big budget shortfalls,\" said Holly Binns, field director of Environment Florida. In calling for states to decide, McCain has laid out a politically cautious position: He moved closer to conservative leaders and his Republican colleagues on Capitol Hill, who have been demanding more offshore drilling. Just last week, Democrats on a House subcommittee narrowly defeated a Republican attempt to overturn the 26-year-old moratorium. Yet by giving states the final say, McCain also is less likely to alienate voters in Florida and other coastal states who fear drilling will bring pollution. Asked how far offshore states should be able to control, McCain said: \"I think that's a subject of negotiation and discussion. But right now, as you know, there's a moratorium, and those … moratoria have to be lifted. And they have to be lifted so that states can make those decisions.\" Crist said the idea was \"brilliant\" because \"it leaves it up to the states to decide what's best for themselves.\" As for whether he could see Florida allowing drilling under McCain's plan, Crist said it depends on \"how far (from shore), how safe, how protective of our environment it would be — there are many contingencies that would have to go into it.\" Since 1982, a congressional moratorium renewed each year has closed most of the U.S. coastline to drilling, with the exception of waters off Alaska and in the western and central Gulf of Mexico. A presidential moratorium enacted by the first President George Bush in 1990 also prohibits drilling. The federal Minerals Management Service estimates that 86-billion barrels of oil and 420-trillion cubic feet of natural gas lie in undiscovered reserves off the U.S. coast, though the agency could not say how much of it is now off-limits. Considering the United States uses about 20-million barrels of oil each day — 60 percent of it imported — that is about 11 years worth of oil, and Republicans in Congress have been clamoring lately to tap it. But there's no guarantee most of that oil is even accessible, and finding and drilling those reserves would take years, experts say. In late 2006, McCain supported a congressional compromise for the eastern Gulf of Mexico that bars drilling within about 230 miles of Tampa Bay through 2022, while opening 8.3-million acres to drilling. The government estimates the area contains 1.26-billion barrels of oil and 5.8-trillion cubic feet of natural gas. Production there has not yet begun. Several East Coast states, especially Virginia, have expressed interest in allowing drilling off their shores in return for a share of the money that oil companies pay the federal government for drilling rights. A spokesman for McCain's Democratic opponent, Sen. Barack Obama of Illinois, said Obama opposes McCain's idea and instead would make \"significant investments in alternative forms of energy.\" Sen. Bill Nelson, D-Fla., a leading opponent of offshore drilling, called the idea \"irresponsible.\" \"There isn't enough oil in the U.S. to make even the smallest dent in world oil prices,\" said Nelson, who on Monday introduced a bill to ban unregulated speculative trading of oil, which some experts blame for the sharp price increases. \"To curb prices in the short run, we need to regulate oil traders. For the long term, we need to break America's oil addiction,\" he said. Wes Allison can be reached at allison@sptimes.com or (202) 463-0577.\n\n\n\n[Last modified: Jun 18, 2008 12:02 PM]\n\n\n\n\n\n\n\nShare your thoughts on this story Read our guidelines for comments First Name (only)\n\n\n\nLocation\n\nComment (May be published online and/or in print)\n\n\n\nYou have 250 characters left to comment.\n\nComments on this article by Issywise Jun 17, 2008 12:03 PM The reality will never change-we can't drill our way out of the need to get off dependence on oil. Globs of petro-tar on Pinellas beaches will cost tourist dollars, tax revenue and housing values. You'll pay many ways for your love of easy oil. by mike Jun 17, 2008 12:03 PM \"He moved closer to conservative leaders\" YES McCain moved a lot closer, just shortly after a recent big campaign fundraiser with Texas oilmen. Coincidence? I think not. We'll not see the oil because it goes to the highest bidder. WAKE UP Folks. by Fuming Jun 17, 2008 12:02 PM This is ridiculous. Letting each state decide will only add to the enormous water quality problem that we're already leaving our children. It won't provide any kind of meaningful relief at the pump. We all need to ratchet back our oil consumption. by Charles Jun 17, 2008 11:06 AM Its time we move past oil. We need the ANWR and clean beaches now. Wind,solar,food friendly ethanol. Let our descendants not drill. The future is now and oil is on its way out. Americans don't panic, we dump the oil/war based Government and grow. by Holly Jun 17, 2008 11:03 AM I think we need to start \"sticking it\" to the oil companies; let us get new technology going today and get rid of the Exxon type mentality...they are only interested in getting filthy rich off us! by Mike Jun 17, 2008 11:01 AM Looks like Florida is in play for Obama after all. by joe tampa Jun 17, 2008 11:01 AM Anyone remember the McCain Amnesty Scam of 2007? And how much it will cost to continue the Iraq fiasco? by Rick Jun 17, 2008 11:00 AM Talk about clueless, Mike there is no addiction. The oil companies and most of our government set the stage for us to be hooked, and then slammed us. If not we would have had better public transportation and access, but that would not be a profit. by Jack Jun 17, 2008 9:17 AM Evidently, those who are against drilling don't understand the influence commodity speculators have in the current cost of a barrel of oil. If Bush were to issue an Executive Order today to drill in ANWR, the price would drop $30-$4o overnight. by Jack Jun 17, 2008 9:16 AM It would take at least 2 - 4 years before any new wells began producing, and even so, there's no guarantee that oil would not be sold in the USA. Right now a lot USA made biodiesel is sold in Europe, not kept here. People need to ask better questions by Scott Jun 17, 2008 9:13 AM The price of oil is not being driven by supply issues. The Saudis confirmed that a couple weeks ago. Big oil is using their profits to bid up the price of oil. Regulate the futures market and watch the price of oil plummet. Oil spill=tourism disaster by Sean Jun 17, 2008 9:13 AM McCain's short term solution will only lead to a long term problem. Alternative energy investment is the only feasible choice. by Barb Jun 17, 2008 9:12 AM The length of time/cost of finding that 1st barrel of oil will not influence the price we pay at the pump or the grocery store. Then there is the idea of 1 State, with the chance to make a lot of money, deciding the fate of the ocean's health. by Kay Jun 17, 2008 9:12 AM Think about it. Eventually, other country's oil will run dry. We will still have our our untapped oil. by sam Jun 17, 2008 8:50 AM The public likes to believe by not drilling in the gulf we are saving something. The hundreds of rigs in the northern gulf you never hear about doesn't seem to be causing a problem. WAKE UP AMERICA !! Quit sending all our money to the Arabs. by Ray Jun 17, 2008 8:50 AM Drilling is NOT the answer. It's like giving more crack to a drug addict. Converting to 4 day workweek, getting rid of your SUV's, and getting rid of drive-thru lines at businesses are the proper steps to take. by Winston Jun 17, 2008 8:50 AM Charlie Christ (aka the perfect politician) can change gears faster than an Indy driver. YAHOO go Charlie. OH! and thanks for the help with my homeowners. haha by jb Jun 17, 2008 8:50 AM Hey McCain,(aka\"old goat\"),why don't we start using the the oil we already refine,instead of selling it overseas,then we won't need to ruin our beaches,it will just be more oil that the oil companies can sell overseas,instead of helping,America by Sean Jun 17, 2008 8:50 AM McCain's short term solution will only lead to a long term problem. Alternative energy investment is the only feasible choice. by darryl Jun 17, 2008 8:26 AM when are all the morons gonna realize even if there is a lot of oil there.it isnt gonna lower the price of gas that much,but instead just tear up something nice.use the costs for this to make alternative fuel,and energy. by Linda Jun 17, 2008 8:26 AM Bill Nelson needs to get another soap box to preach from!!! We, the American people, desperately need new oil fields and offshore drilling. We may not see the results, but our children will!! Get with it Nelson!!! by Parker Jun 17, 2008 8:26 AM it is about time someone stands up against the environmental lobbyists. thank you McCain. if states want to drill for oil, then let them. that is why Alaska became a state in the first place. by sheila Jun 17, 2008 8:26 AM Here we go another republican trying to get more oil to fatten his pockets.yeehaw by JM Jun 17, 2008 8:26 AM About time we woke up.We nrrd to drill in the Gulf.And Bill Nelson needs to get with the program.I'm sure he can afford these priges but the average person can't.And it is obvious he doesn't care.Typical Democrat all about themselves. by H MAN Jun 17, 2008 8:26 AM Yeah ruin Florida's tourist industry with the first oil spill accident. Brilliant. by Regina Jun 17, 2008 8:26 AM He just lost my vote. by Robert Jun 17, 2008 8:26 AM Bill Nelson needs to get his head out of the sand and realize that there is no way we are going to make a dent in oil consumption through conservation. WE NEED OIL! He's wrong--the US has lots of it, and we should get it now! by Georgette Jun 17, 2008 8:26 AM WHY NOT DRILL OFF THE COAST AS WELL AS ANWA ALASKA....FLORIDA NEEDS TO BUILD SOME REFINERIES AS WELL AS IN THE REST OF THE USA.McCain has my vote!! by Kathleen Jun 17, 2008 8:25 AM Charlie, think about it. The US oil companies are benefiting from the rising Mideast oil prices. Do you really think that even if we could free ourselves from foreign oil, the US oil companies would reduce their prices? by David Jun 17, 2008 8:25 AM McCain is more concerned about pandering to big oil than in solving our energy crisis, and he's undercutting his own position on fighting global warming. Crist is also reversing course on the environment, in his desperate ploy to be McCain's VP. Sad. by Mikes Jun 17, 2008 8:25 AM Addiction is difficult to break free from.At the pump last week I saw two motorists pumped $20 worth; one pumped $78 worth and another pumped $128! Who do you think was more addicted to oil? $20, $78 or $128 buyers? by Edward Jun 17, 2008 8:25 AM Hard to disagree with giving states a choice (NOT HERE PLEASE)... but any notion this might provide short-term relief at the pump is baloney, it takes *years* for a new well to supply product that makes it to the pump. by JH Jun 17, 2008 8:25 AM So it's okay to keep sending dollars to people who hates us? We should've been drilling years ago. Instead Clinton/Gore gave us the SUV tax credit and our addiction grew.Mccain is pulling a kerry but at least he finally gets it.Obama=clueless. by greg Jun 17, 2008 8:25 AM this is leadership? caving in to his right wing and the oil lobby? for all of his experience, mr.mccain shows extremely poor judgement, again. by jill Jun 17, 2008 8:25 AM Letting each state decide is a great idea. It would not affect Florida and would decrease our dependence on foreign oil.", "images": ["https://web.archive.org/web/20080619025707im_/http://www.sptimes.com/News/webspecials/multimedia/icons-2008/hank-earl-carr.jpg", "https://web.archive.org/web/20080619025707im_/http://www.tampabay.com/resource/images/comment.gif", "https://web.archive.org/web/20080619025707im_/http://www.tampabay.com/universal/nav/images/baybuzzblog.gif", "https://web.archive.org/web/20080619025707im_/http://www.tampabay.com/resource/images/stumble.gif", "https://web.archive.org/web/20080619025707im_/http://www.tampabay.com/resource/images/template/favicon.ico", "https://web.archive.org/web/20080619025707im_/http://www.tampabay.com/resource/images/template/logo_sptimes_lrail.gif", "https://web.archive.org/web/20080619025707im_/http://www.tampabay.com/universal/nav/images/down-pointer.gif", "https://web.archive.org/web/20080619025707im_/http://sptmain.122.2o7.net/b/ss/sptmain/1/H.1--NS/0", "https://web.archive.org/web/20080619025707im_/http://www.tampabay.com/resource/images/email.gif", "https://web.archive.org/web/20080619025707im_/http://www.tampabay.com/resource/images/newsvine.gif", "https://web.archive.org/web/20080619025707im_/http://www.tampabay.com/universal/graphics/logos/footer-partners.gif", "https://web.archive.org/web/20080619025707im_/http://www.tampabay.com/resource/images/editor-icon.gif", "https://web.archive.org/web/20080619025707im_/http://www.tampabay.com/universal/nav/images/politifact-130.gif", "https://web.archive.org/web/20080619025707im_/http://digg.com/img/badges/16x16-digg-guy.png", "https://web.archive.org/web/20080619025707im_/http://www.tampabay.com/universal/nav/images/shoplocal-95.gif", "https://web.archive.org/web/20080619025707im_/http://www.tampabay.com/resource/images/delicious.gif", "https://web.archive.org/web/20080619025707im_/http://www.tampabay.com/resource/images/fbook.jpeg", "https://web.archive.org/web/20080619025707im_/http://www.tampabay.com/resource/images/print.gif", "https://web.archive.org/web/20080619025707im_/http://www.tampabay.com/universal/nav/images/buzzblog.gif", "https://web.archive.org/web/20080619025707im_/http://www.sptimes.com/News/webspecials/multimedia/icons-2008/rays-walk.jpg", "https://web.archive.org/web/20080619025707im_/http://www.tampabay.com/universal/nav/images/itsyourtimes-115.gif", "https://web.archive.org/web/20080619025707im_/http://www.sptimes.com/spacer.gif", "https://web.archive.org/web/20080619025707im_/http://www.sptimes.com/News/webspecials/multimedia/icons-2008/paycheck-video.jpg", "https://web.archive.org/web/20080619025707im_/http://www.tampabay.com/resource/images/reddit.gif"], "top_img": "https://web.archive.org/web/20080619025707im_/http://www.tampabay.com/resource/images/template/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "In reversal, McCain says lift ban on offshore drilling", "meta_data": {"description": "Tampa Bay's news, shopping and information source brought to you by the St. Petersburg Times and tbt*.", "keywords": "Tampa Bay, St. Petersburg Times, tbt*, Tampa news, Tampa newspaper, Tampa Bay news, world news, local news, obituaries, Tampa, St. Petersburg, Cleawater, Pinellas County, Hillsborough County, Hernando County, Pasco County, www.tampabay.com"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}