{"url": "http://abcnews.go.com/ThisWeek/bill-clinton-rush-limbaugh-mistakes-supreme-court-middle/story?id=10406757", "text": "Bill Clinton on Rush Limbaugh, His Own Mistakes, the Supreme Court, Middle East Peace Former President Bill Clinton discusses the issues on \"This Week.\"\n\nApril 18, 2010 \u0097 -- Bill Clinton made mistakes as president on financial regulation, he admitted in an exclusive \"This Week\" interview, but Clinton stood his ground regarding the dangers of overheated political rhetoric, saying Rush Limbaugh's accusation Clinton \"set the stage for violence\" with a recent speech on the subject \"doesn't make any sense.\"\n\nIn his first \"This Week\" interview since the passage of health care reform, Clinton reflected on how the bill's success made him feel like Teddy Roosevelt to Obama's FDR. And Clinton offered advice and thoughts on some of Obama's next issues -- a Supreme Court nomination, the Middle East peace process and the midterm elections.\n\nAnchor Jake Tapper asked Clinton about Limbaugh's criticism of his speech marking the upcoming 15th anniversary of the Oklahoma City bombing. In that speech, Clinton warned that \"the words we use really do matter, because there's this vast echo chamber, and they go across space and they fall on the serious and delirious alike. They fall on the connected and the unhinged alike.\"\n\nOn \"This Week,\" Clinton said, \"The only point I tried to make was that we ought to have a lot of political dissent -- a lot of political argument. Nobody is right all the time. But we also have to take responsibility for the possible consequences of what we say.\"\n\nClinton said he worries about threats against President Obama and the Congress. And, he worries \"about more careless language ... some of which we've seen against the Republican governor in New Jersey, Gov. Christie.\"\n\nA recently leaked memo from a New Jersey teacher joked about Christie dying.\n\n\"I think we all have to be careful,\" Clinton said. \"We ought to remember [that] after Oklahoma City we learned something about the difference in disagreement and demonization.\"\n\nOn Derivatives: 'I Was Wrong'\n\nClinton acknowledged that he was wrong to take what he now views as bad advice from his Treasury secretaries, Robert Rubin and Larry Summers, who told him the market for complex financial instruments known as derivatives ought to remain unregulated.\n\n\"On derivatives, yeah, I think they were wrong and I think I was wrong to take [their advice],\" Clinton said, \"because the argument on derivatives was that these things are expensive and sophisticated and only a handful of investors will buy them, and they don't need any extra protection and any extra transparency. The money they're putting up guarantees them transparency.\n\n\"The flaw in that argument,\" Clinton added, \"was that first of all sometimes people with a lot of money make stupid decisions and make it without transparency.\"\n\nThe former president said he also was wrong in his understanding of what a collapse in the derivative market could do to the economy.\n\n\"The most important flaw,\" he said, \"was even if less than 1 percent of the total investment community is involved in derivative exchanges, so much money was involved that if they went bad, they could affect 100 percent of the investments, and indeed 100 percent of the citizens in countries, not investors. And I was wrong about that.\"\n\nHe now wishes he had tried to regulate derivatives while in office, but he doesn't think he would have been successful.\n\n\"Now, I think if I had tried to regulate them, because the Republicans were the majority in the Congress, they would have stopped it,\" he said. \"But I wish I should have been caught trying. I mean, that was a mistake I made.\"\n\nBill Clinton's Supreme Court Nominee Advice: Robe Not Required\n\nClinton said a robe isn't necessarily a requirement for being nominated to the Supreme Court.\n\nAsked about his advice for President Obama as he selects a nominee to be the next Supreme Court justice, Clinton said he hopes the president will \"take a look at somebody who hasn't been a judge.\"\n\n\"The important thing,\" Clinton said, \"is that you think they're smart and they're competent and they understand the lives of ordinary people.\"\n\nWhen asked if he or his wife, Secretary of State Hillary Clinton, would be suited for the job, Clinton said at 63, he's too old and, \"I'd like to see him put someone in their late 40s, early 50s on the court and someone with a lot of energy for the job.\"\n\nHillary Clinton, he said, would have the same advice.\n\nDiversity, he suggested, should also be a consideration.\n\n\"My advice to him would be to first of all see what the court is missing,\" Clinton said. \"Does it matter if he puts a Catholic or a Jewish person or someone of another faith on a court? ... There would be no Protestants on the Supreme Court. Does that matter? Does there need to be another woman on the court? Should there be some other group represented?\"\n\nEcstatic Over Health Care Passage: Felt Like Teddy Roosevelt\n\nOn the recent health care reform bill, Clinton said he felt like \"Teddy Roosevelt would have felt if he'd still been alive in the 1930s seeing his cousin Franklin being able to sign legislation in areas that he had advocated.\"\n\nClinton was thrilled that it passed and that he and Hillary Clinton personally lobbied for passage before the final vote on the bill.\n\n\"She and I were ecstatic,\" he said.\n\nClinton expects more changes in the bill.\n\n\"They'll have to keep working on it and putting more cost drivers in it to take the cost down,\" he said. \"But it's a big, big step. And it's a wonderful thing for the country.\"\n\nMidterm Elections: Another 1994?\n\nClinton said the current political environment reminds him \"a little bit\" of 1994, a year in which Democrats lost majorities in both houses of Congress in a Republican landslide.\n\n\"I think that the dissent is just as intense, if not more intense,\" he said. \"But I think the outcome of the election is likely to be far less dramatic than it was in '94.\"\n\nClinton expects Republicans to make some gains, but \"I don't think they'll win either house.\"\n\nBack in 1994, congressional Democrats put their jobs on the line to vote for President Clinton's economic package. The recent health care vote, he said, was similar, but the country is different now.\n\n\"We are culturally a different country,\" he said. \"We are more diverse. We're more communitarian. That is, we understand we have to solve a lot of these problems together.\"\n\nMiddle East Peace Process\n\nClinton said he was reluctant to offer public advice to President Obama regarding the Middle East peace process, so as not to foreclose his options.\n\nBut he added, \"We need to do something to deprive both sides of any excuse not to engage in serious negotiations.\"\n\nIf President Obama puts a peace plan on the table, Clinton said he will \"strongly support it.\"\n\nThe argument against the administration putting forward a peace plan, Clinton said, is that the current Israeli government \"almost certainly would reject it.\" That, he said, could \"make us look weak.\"\n\nBut the Obama administration, Clinton said, \"may decide it's more important to have clarity and to do something that will be an action-forcing event to put them back to the table.\"", "images": ["http://abcnews.go.com/ThisWeek/bill-clinton-rush-limbaugh-mistakes-supreme-court-middle/null", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "http://abcnews.go.com/ThisWeek/bill-clinton-rush-limbaugh-mistakes-supreme-court-middle/null", "keywords": [], "authors": ["Abc News", "Jack Date", "April", "Min Read"], "canonical_link": "https://abcnews.go.com/ThisWeek/bill-clinton-rush-limbaugh-mistakes-supreme-court-middle/story?id=10406757", "title": "Bill Clinton on Rush Limbaugh, His Own Mistakes, the Supreme Court, Middle East Peace", "meta_data": {"description": "Jake Tapper interviews former President Bill Clinton on ABC News' \"This Week.\"", "keywords": "Bill Clinton, Jake Tapper, Middle East, Financial Regulation", "copyright": "2020 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "Bill Clinton on Rush Limbaugh, His Own Mistakes, the Supreme Court, Middle East Peace", "og": {"site_name": "ABC News", "url": "https://abcnews.go.com/ThisWeek/bill-clinton-rush-limbaugh-mistakes-supreme-court-middle/story?id=10406757", "title": "Bill Clinton on Rush Limbaugh, His Own Mistakes, the Supreme Court, Middle East Peace", "description": "Jake Tapper interviews former President Bill Clinton on ABC News' \"This Week.\"", "image": "null", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2010-04-21T13:59:44Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,10406757", "ipad": "abcnewsipad://link/story,10406757", "googleplay": "https://abcnews.go.com/ThisWeek/bill-clinton-rush-limbaugh-mistakes-supreme-court-middle/story?id=10406757"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "Bill Clinton on Rush Limbaugh, His Own Mistakes, the Supreme Court, Middle East Peace", "description": "Jake Tapper interviews former President Bill Clinton on ABC News' \"This Week.\"", "url": "https://abcnews.go.com/ThisWeek/bill-clinton-rush-limbaugh-mistakes-supreme-court-middle/story?id=10406757", "image": {"identifier": "null", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,10406757", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,10406757", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/ThisWeek/bill-clinton-rush-limbaugh-mistakes-supreme-court-middle/story?id=10406757", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/ThisWeek/bill-clinton-rush-limbaugh-mistakes-supreme-court-middle/story?id=10406757"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "http://abcnews.go.com", "summary": ""}