{"url": "www.yourtango.com/2018311123/7-cringey-details-about-katy-perry-orlando-blooms-relationship-breakup-marriage-rumors", "text": "What's up with the infamous naked paddleboarding pic?\n\nKaty Perry and Orlando Bloom are a celeb couple that no one saw coming, and yet... they totally make sense.\n\nThe two lovebirds both have an extensive celebrity dating and marriage history, with Perry being linked to stars like John Mayer, Robert Pattinson, and of course ex-husband Russell Brand. Meanwhile, Orlando has been with stars like Kate Bosworth, Selena Gomez, and ex-wife Miranda Kerr.\n\nPerry and Bloom started dating in early 2016 after meeting at a Golden Globes after party. And although there were reports that they were breaking up in early 2017, it seems the couple may have reconciled and are giving love another go — and according to some sources, may have already gotten eloped! Their relationship is not without its drama, though.\n\n1. Bloom infamously went paddleboarding naked with Perry.\n\nWhile on a romantic getaway to Italy with Perry, Bloom left nothing to the imagination and stripped naked for a paddleboard ride and of course, the paps were there to snap some photos. Unsurprisingly, these photos spread over the internet like wildfire.\n\nIn an interview with Elle UK, Bloom admitted he had no idea there was paparazzi following them. \"I've been photographed a million times in a million ways. I have a good radar,\" he stated. \"We'd been completely alone for five days. Nothing around us. There was no way anyone could get anything. So I had a moment of feeling free.\"\n\nAfter seeing the photo, Bloom admitted to Elle that had he known he was being watched and photographed, \"I wouldn't have put myself in that position if I'd thought it would happen.\"\n\n2. Russell Brand divorced Perry for being \"vapid.\"\n\nPerry was previously married to actor and comedian Russell Brand for almost two years before sadly splitting. In this article from E! Online, Perry admitted the split was difficult on her, stating, \"He's a very smart man, a magical man and I was in love with him when I married him. Let's just say I haven't heard from him since he texted me saying he was divorcing me December 31, 2011.\" Ouch.\n\nAccording to E! News, in his 2015 documentary BRAND: The Second Coming, Brand allegedly mocks his relationship with Perry. \"I'm living this life of the very thing I detest,\" he says before the footage cuts to images of him and Perry. \"Vapid, vacuous celebrity.\"\n\n3. Bloom allegedly cheated on ex-wife Miranda Kerr.\n\nBloom was married to Victoria's Secret model Miranda Kerr for three years, whom he shares a son with. The couple shared a rough split in 2013 after reports surfaced of Bloom cheating on Kerr with a 21-year-old waitress in London.\n\nDespite the harsh accusations, the two now have a good friendship and co-parenting skills. Kerr opened up to Marie Clare UK about her relationship with Bloom, stating the divorce was the \"the right thing to do,\" explaining, \"we weren't bringing out the best in each other.\" She continued, saying, \"There’s no hostility there, we’ll always be friends.\"\n\n4. Bloom reportedly cheated on Perry with Selena Gomez.\n\nPhoto: Hollywood Life\n\nWhile Bloom and Perry were reportedly still together, Bloom was spotted out with pop princess Selena Gomez — and they reportedly got very close and comfortable with each other.\n\nAccording to TMZ, Bloom made a surprise appearance at Gomez's afterparty for a 2016 concert in Vegas. Photos taken of the two show they were all over each other. Just a week prior, Orlando was spotted out with Katy at a Met Gala afterparty leading most to believe that they were still together while he was out with Gomez.\n\nAnother theory brought up was the fact that Bloom might have been getting cozy with Gomez to get back at his ex Kerr, who was rumored to have dated Selena's ex Justin Bieber. Back in 2012, Bloom and Bieber reportedly got in a fight while in Ibiza due to the rumors about Bieber and Kerr. Bloom reportedly threw a punch at Bieber after some words were exchanged. Kerr has stated publicly that she never had sex with or dated Justin.\n\n5. Perry and Bloom broke up for a year.\n\nAfter 10 months of dating, Perry and Bloom confirmed via a joint statement that they were indeed breaking up. In an article from E! News, their rep stated, \"Before rumors or falsifications get out of hand we can confirm that Orlando and Katy are taking respectful, loving space at this time.\" According to the source, Perry was the one who decided to end things between them but another source reported that the split was mutual and that things between them hadn't been good for months.\n\n\"It was a few events that happened over the past few months. They both still love each other very much, though, and getting back together could happen once they have some space\", the rep stated to E!.\n\nIn an interview with Elle UK, Bloom stated that he and Perry were still friends after their break up. He said, \"It's good. We're all grown-up. She happens to be someone who is very visible, but I don't think anybody cares what I'm up to. Nor should they. It's between us. It's better to set an example for kids and show that breakups don't have to be about hate.\"\n\n6. The couple reportedly reunited in 2018.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6035233&cv=2.0&cj=1", "https://www.yourtango.com/sites/default/files/styles/body_image_default/public/2016%20Oct/selenaorlando.jpg", "https://www.yourtango.com/sites/default/files/styles/body_image_default/public/2016%20Oct/katy%205.jpg", "https://www.yourtango.com/sites/default/files/styles/header_slider/public/image_blog/katy.jpg?itok=9IqU9tyS", "https://www.yourtango.com/sites/default/files/styles/body_image_default/public/2016%20Oct/Katy%20perry.jpg", "https://www.yourtango.com/sites/all/themes/ytpurple/img/logo-150.png?v2", "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/katy.jpg?itok=EB0CNLbN"], "top_img": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/katy.jpg?itok=EB0CNLbN", "keywords": [], "authors": [], "canonical_link": "https://www.yourtango.com/2018311123/7-cringey-details-about-katy-perry-orlando-blooms-relationship-breakup-marriage-rumors", "title": "7 Cringey Details About Katy Perry & Orlando Bloom's Relationship, Including Rumors They've Already Eloped", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "fb": {"app_id": 102332647006, "pages": 39475817260}, "keywords": "katy perry, Orlando Bloom, entertainment and news, Buzz", "article": {"author": "https://www.yourtango.com/users/brittany-white", "published_time": "2018-03-14T14:30:00", "modified_time": "2018-03-14T14:30:00"}, "og": {"site_name": "YourTango", "type": "article", "url": "https://www.yourtango.com/2018311123/7-cringey-details-about-katy-perry-orlando-blooms-relationship-breakup-marriage-rumors", "title": "7 Cringey Details About Katy Perry & Orlando Bloom's Relationship, Including Rumors They've Already Eloped", "description": "What's up with the infamous naked paddleboarding pic?", "updated_time": "2018-03-14T14:30:00", "image": {"identifier": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/katy.jpg?itok=EB0CNLbN", "width": 620, "height": 309}}, "description": "Katy Perry and Orlando Bloom reportedly broke up in 2017, but rumors are flying that they're back together — and married! Here are the strangest details about their relationship.", "abstract": "Katy Perry and Orlando Bloom are a celeb couple that no one saw coming, and yet they totally make sense.The two started dating in early 2016 after", "robots": "follow, index, noodp, noydir", "news_keywords": "katy perry, katy perry boyfriend, katy perry dating, orlando bloom, orlando bloom dating, katy perry and orlando bloom", "generator": "Drupal 7 (http://drupal.org)", "twitter": {"card": "summary_large_image", "creator": {"identifier": "@yourtango", "id": 17490866}, "url": "https://www.yourtango.com/2018311123/7-cringey-details-about-katy-perry-orlando-blooms-relationship-breakup-marriage-rumors", "title": "7 Cringey Details About Katy Perry & Orlando Bloom's Relationship, Including Rumors They've Already Eloped", "image": {"src": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/katy.jpg?itok=EB0CNLbN", "width": 60, "height": 60}}}, "movies": ["https://www.youtube.com/embed/wcGPnErN9-Y"], "publish_date": 1521009000.0, "source": "http://www.yourtango.com", "summary": ""}