{"url": "https://www.indiewire.com/2017/05/unbreakable-kimmy-schmidt-rape-season-3-spoilers-1201829912/", "text": "Tina Fey and Robert Carlock's complicated Netflix comedy took a big swing with an offhand joke, but reminded us just how important this character's journey is.\n\n[Editor’s note: Spoilers for Season 3 of “Unbreakable Kimmy Schmidt” follow.]\n\nThe most important, intriguing, and controversial moment of “Unbreakable Kimmy Schmidt” Season 3 happens so fast that you might have missed it: In Episode 3, “Kimmy Can’t Help You!,” Kimmy Schmidt (Ellie Kemper) finally uses the word “rape” in reference to her 15 years spent stuck underground as the prisoner of Reverend Richard Wayne Gary Wayne (Jon Hamm).\n\nREAD MORE: ‘Unbreakable Kimmy Schmidt’ Season 3 Review: Kimmy Goes to College, Tackles the Patriarchy, and Gets Stronger\n\nSpecifically, here’s what happens: Wendy (very special guest star Laura Dern) has come to Kimmy and Titus’s apartment with a set of divorce papers, as she and the Reverend are hoping to get married, but Kimmy and the Reverend are still legally man and wife.\n\nWendy doesn’t reveal right away that she’s hoping to marry the Reverend, but quickly we discover that this otherwise normal-seeming woman has, at the very least, a very poor understanding of what kind of monster “Richard” is, something that pisses Kimmy off — and may be why she (and the show) crossed a line they’ve up until now avoided.\n\nPopular on IndieWire\n\n“It’s kind of sophisticated, if you think about it,” Wendy practically giggles. “An evening in Manhattan with my lover’s wife. It sounds like a Noel Coward play.”\n\nSnaps Kimmy in reply: “If Noel Coward was really a coward who rapes everybody.”\n\nFrom the beginning of the series, creators Tina Fey and Robert Carlock have hinted at some of the darker elements of Kimmy’s abduction and imprisonment, most notably with this line in the pilot: “Yes, there was weird sex stuff in the bunker.” Otherwise, the show has shown a preference for show over tell, specifically in how Kimmy’s trauma interferes with her attempts to pursue any sort of romantic relationship.\n\nKimmy’s love interests have included several nice gentlemen over the past three seasons, such as tutor Charles (Andrew Ridings), rich guy Logan (Adam Campbell), Vietnamese immigrant Dong (Ki Hong Lee), PTSD-afflicted veteran Keith (Sam Page), and this season, the lovely Daveed Diggs as philosophy student Perry. All of them have initially seemed like a potential fit for Kimmy, and all of them haven’t worked out – much of the time because when she finds herself in an intimate situation, Kimmy’s instinctual reaction is to lash out with violence in order to protect herself.\n\nAt times, Kimmy’s over-the-top physical reaction to these moments is played for comedy, to a degree where it’s a bit uncomfortable to watch her constantly slamming telephones on Dong’s head as he attempts to kiss her.\n\nAnd of all her love interests, Dong is the one she’s gone furthest with. While they struggle to connect in Season 2 Episode 8, “Kimmy Goes To A Hotel,” the final scene indicates that as they’re trapped in the back of a police car, Kimmy finally feels capable of pursuing more with him. “You’re in handcuffs, which is making my brain feel calm for more totally normal reasons…” she says. “It’s never going to be perfect.”\n\nThat last comment feels like a nice overall statement for what life is like as a survivor of trauma, and “Kimmy Schmidt” has always been sure to keep an element of humanity in its exploration of what Kimmy’s time in the bunker did to her as a person. It’s also one of the trickiest hurdles the show has had to navigate, because the established tone of a light, bubbly comedy about a woman who now fully admits to over a decade of rape and abuse is at times a real brain-teaser.\n\nOne interesting twist came in Season 3, Episode 11, “Kimmy Googles the Internet!” — in which Kimmy learned that many of the people in her life are more than aware of her mole woman past, thanks to Google. It’s a harsh moment of awareness for the character, as her relative naïveté when it comes to technology has kept her shielded from the fact that so much of our lives can be hunted down with some strategic search engine terms.\n\nBut it also led to a character arc that honestly felt a little formless, but still intriguing. Season 1 was about Kimmy confronting what, exactly, happened to her. Season 2 was about acknowledging she needed help and getting it. But Season 3 was about her working to own that experience, rather than hide it.\n\nAnd a big part of that? Finally using the “R-word.” It’s unlikely that “Kimmy Schmidt” will ever push past a PG-13 rating, despite its subject matter and Netflix’s loose content restrictions — Tina Fey has said that she likes that families can still watch the show together. But now that the show is slightly more comfortable with being honest about what happened to Kimmy, maybe she, and the show, can actually move on in a real, healthy way.\n\n“Unbreakable Kimmy Schmidt” has done a lovely job over the past three seasons of creating its own little world. There’s plenty to explore still as Kimmy fills her Google results with what she does now — not so much burying what was done to her, but proving that as a female who’s “strong as hell,” she’s far more than that one experience.\n\n“Unbreakable Kimmy Schmidt” Season 3 is streaming now on Netflix.\n\nStay on top of the latest film and TV news! Sign up for our film and TV email newsletter here.\n\nSign Up: Stay on top of the latest breaking film and TV news! Sign up for our Email Newsletters here.", "images": ["https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.indiewire.com&path=%2F2017%2F05%2Funbreakable-kimmy-schmidt-rape-season-3-spoilers-1201829912%2F&ct=article&lob=indiewire&loc=us&env=desktop&post_id=1201829912&comment_count=2", "https://i1.wp.com/www.rollingstone.com/wp-content/uploads/2020/04/elton-billie-paul-mccartney.jpg?resize=230%2C135&ssl=1&w=300", "http://www.indiewire.com/wp-content/uploads/2017/05/uks_306_unit_00336_r.jpg?w=780", "http://www.indiewire.com/wp-content/uploads/2017/05/uks_301_unit_00836_r.jpg?w=780", "https://www.indiewire.com/wp-content/themes/indiewire/sprites/logo/Logo_IndieWire.png", "https://www.indiewire.com/wp-content/themes/indiewire/images/indiewire-color.png", "https://i1.wp.com/www.indiewire.com/wp-content/uploads/2016/05/lizmiller-indiewire.jpg?resize=96%2C96&ssl=1", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY", "https://www.indiewire.com/wp-content/uploads/2017/05/uks_301_unit_00344_r_crop.jpg?w=780", "https://www.indiewire.com/wp-content/uploads/2017/05/uks_301_unit_00344_r_crop.jpg", "https://pmcdeadline2.files.wordpress.com/2020/02/drew-carey-e1587181608936.jpg?resize=230%2C135&w=300", "https://pmcvariety.files.wordpress.com/2020/04/cranberries-zombie.png?resize=230%2C135&w=300", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://i2.wp.com/www.goldderby.com/wp-content/uploads/2020/03/Rupauls-drag-race-non-eliminations.jpg?resize=230%2C135&ssl=1&w=300", "http://www.indiewire.com/wp-content/uploads/2017/05/uks_303_unit_00196_r_crop.jpg?w=780", "https://pmctvline2.files.wordpress.com/2020/04/potw-5.jpg?resize=230%2C135&w=300"], "top_img": "https://www.indiewire.com/wp-content/uploads/2017/05/uks_301_unit_00344_r_crop.jpg", "keywords": [], "authors": ["Liz Shannon Miller"], "canonical_link": "https://www.indiewire.com/2017/05/unbreakable-kimmy-schmidt-rape-season-3-spoilers-1201829912/", "title": "‘Unbreakable Kimmy Schmidt’ Season 3 Finally Used the Word ‘Rape’: Why It’s a Big Deal", "meta_data": {"fb": {"pages": 9800035481}, "msvalidate.01": "87B78205BB25666E656DA3EB49F3FD42", "viewport": "width=device-width, initial-scale=1", "st": {"robots": "follow, index"}, "description": "Tina Fey and Robert Carlock's complicated Netflix comedy took a big swing with an offhand joke.", "news_keywords": "Ellie Kemper, Jon Hamm, Tina Fey, Unbreakable Kimmy Schmidt", "apple-itunes-app": "app-id=1400654071", "generator": "WordPress 5.4", "author": "Liz Shannon Miller", "content_type": "Article", "post_id": 1201829912, "title": "'Unbreakable Kimmy Schmidt' Season 3 Finally Used the Word 'Rape': Why It's a Big Deal", "published_at": "2017-05-22 11:00:42", "image": "https://www.indiewire.com/wp-content/uploads/2017/05/uks_301_unit_00344_r_crop.jpg?w=300", "comment_count": 2, "tags": "Unbreakable Kimmy Schmidt", "topics": "Television", "body": "[Editor's note: Spoilers for Season 3 of \"Unbreakable Kimmy Schmidt\" follow.]\r\n\r\nThe most important, intriguing, and controversial moment of \"Unbreakable Kimmy Schmidt\" Season 3 happens so fast that you might have missed it: In Episode 3, \"Kimmy Can't Help You!,\" Kimmy Schmidt (Ellie Kemper) finally uses the word \"rape\" in reference to her 15 years spent stuck underground as the prisoner of Reverend Richard Wayne Gary Wayne (Jon Hamm).\r\n\r\nREAD MORE: ‘Unbreakable Kimmy Schmidt’ Season 3 Review: Kimmy Goes to College, Tackles the Patriarchy, and Gets Stronger\r\n\r\nSpecifically, here's what happens: Wendy (very special guest star Laura Dern) has come to Kimmy and Titus's apartment with a set of divorce papers, as she and the Reverend are hoping to get married, but Kimmy and the Reverend are still legally man and wife.\r\n\r\nWendy doesn't reveal right away that she's hoping to marry the Reverend, but quickly we discover that this otherwise normal-seeming woman has, at the very least, a very poor understanding of what kind of monster \"Richard\" is, something that pisses Kimmy off — and may be why she (and the show) crossed a line they've up until now avoided.\r\n\r\n\r\n\r\n\"It's kind of sophisticated, if you think about it,\" Wendy practically giggles. \"An evening in Manhattan with my lover's wife. It sounds like a Noel Coward play.\"\r\n\r\nSnaps Kimmy in reply: \"If Noel Coward was really a coward who rapes everybody.\"\r\n\r\nFrom the beginning of the series, creators Tina Fey and Robert Carlock have hinted at some of the darker elements of Kimmy's abduction and imprisonment, most notably with this line in the pilot: \"Yes, there was weird sex stuff in the bunker.\" Otherwise, the show has shown a preference for show over tell, specifically in how Kimmy's trauma interferes with her attempts to pursue any sort of romantic relationship.\r\n\r\nKimmy's love interests have included several nice gentlemen over the past three seasons, such as tutor Charles (Andrew Ridings), rich guy Logan (Adam Campbell), Vietnamese immigrant Dong (Ki Hong Lee), PTSD-afflicted veteran Keith (Sam Page), and this season, the lovely Daveed Diggs as philosophy student Perry. All of them have initially seemed like a potential fit for Kimmy, and all of them haven't worked out – much of the time because when she finds herself in an intimate situation, Kimmy's instinctual reaction is to lash out with violence in order to protect herself.\r\n\r\n\r\n\r\nAt times, Kimmy's over-the-top physical reaction to these moments is played for comedy, to a degree where it's a bit uncomfortable to watch her constantly slamming telephones on Dong's head as he attempts to kiss her.\r\n\r\nAnd of all her love interests, Dong is the one she's gone furthest with. While they struggle to connect in Season 2 Episode 8, \"Kimmy Goes To A Hotel,\" the final scene indicates that as they're trapped in the back of a police car, Kimmy finally feels capable of pursuing more with him. \"You're in handcuffs, which is making my brain feel calm for more totally normal reasons...\" she says. \"It's never going to be perfect.\"\r\n\r\nThat last comment feels like a nice overall statement for what life is like as a survivor of trauma, and \"Kimmy Schmidt\" has always been sure to keep an element of humanity in its exploration of what Kimmy's time in the bunker did to her as a person. It's also one of the trickiest hurdles the show has had to navigate, because the established tone of a light, bubbly comedy about a woman who now fully admits to over a decade of rape and abuse is at times a real brain-teaser.\r\n\r\nOne interesting twist came in Season 3, Episode 11, \"Kimmy Googles the Internet!\" — in which Kimmy learned that many of the people in her life are more than aware of her mole woman past, thanks to Google. It's a harsh moment of awareness for the character, as her relative naïveté when it comes to technology has kept her shielded from the fact that so much of our lives can be hunted down with some strategic search engine terms.\r\n\r\n\r\n\r\nBut it also led to a character arc that honestly felt a little formless, but still intriguing. Season 1 was about Kimmy confronting what, exactly, happened to her. Season 2 was about acknowledging she needed help and getting it. But Season 3 was about her working to own that experience, rather than hide it.\r\n\r\nAnd a big part of that? Finally using the \"R-word.\" It's unlikely that \"Kimmy Schmidt\" will ever push past a PG-13 rating, despite its subject matter and Netflix's loose content restrictions — Tina Fey has said that she likes that families can still watch the show together. But now that the show is slightly more comfortable with being honest about what happened to Kimmy, maybe she, and the show, can actually move on in a real, healthy way.\r\n\r\n\"Unbreakable Kimmy Schmidt\" has done a lovely job over the past three seasons of creating its own little world. There's plenty to explore still as Kimmy fills her Google results with what she does now — not so much burying what was done to her, but proving that as a female who's \"strong as hell,\" she's far more than that one experience.\r\n\r\n\"Unbreakable Kimmy Schmidt\" Season 3 is streaming now on Netflix. \r\n\r\nStay on top of the latest film and TV news! Sign up for our film and TV email newsletter here.", "onesignal": "wordpress-plugin", "og": {"site_name": "IndieWire", "type": "article", "locale": "en_US", "url": "https://www.indiewire.com/2017/05/unbreakable-kimmy-schmidt-rape-season-3-spoilers-1201829912/", "title": "‘Unbreakable Kimmy Schmidt’ Season 3 Finally Used the Word ‘Rape’: Why It’s a Big Deal", "description": "Tina Fey and Robert Carlock's complicated Netflix comedy took a big swing with an offhand joke, but reminded us just how important this character's journey is.", "image": {"identifier": "https://www.indiewire.com/wp-content/uploads/2017/05/uks_301_unit_00344_r_crop.jpg", "width": 780, "height": 520}}, "article": {"published_time": "2017-05-22T15:00:42+00:00", "modified_time": "2017-05-23T15:15:14+00:00", "author": "https://www.indiewire.com/author/lizshannonmiller/", "section": "Television", "tag": "Unbreakable Kimmy Schmidt"}, "fragment": "!", "msapplication-TileImage": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=270"}, "movies": [], "publish_date": 1495465242.0, "source": "https://www.indiewire.com", "summary": ""}