{"url": "abcnews.go.com/GMA/Culture/brad-pitt-fires-back-angelina-jolie-claims-paid/story?id=57114183", "text": "Brad Pitt fires back at Angelina Jolie, claims he paid more than $1.3 million in child support He also stated that he loaned his estranged wife $8 million to buy her home.\n\nAfter Angelina Jolie claimed in court documents that her estranged husband, Brad Pitt, hadn't paid \"meaningful\" formal child support since their split about two years ago, the actor's attorneys fired back in a new filing of their own Wednesday, asserting that Pitt has contributed more than $1.3 million in bills for Jolie and their six children and loaned the actress $8 million to help her buy her current home.\n\nIn the court documents, obtained by \"Good Morning America,\" Pitt's lawyers also contend that at a hearing last week, Jolie's attorney did not mention any child support issues and claim that asking to schedule a new hearing on the subject is \"calculated to increase conflict.\"\n\nPitt's lawyers also slammed Jolie's filing as a \"thinly-veiled effort to manipulate media coverage.\"\n\nJolie's spokeswoman, Mindy Nyby, addressed those claims on Tuesday.\n\n\"The aim of Angelina’s routine court filing is to provide closure to the marriage in a way that clears a path toward the next stage of their lives and allows her and Brad to recommit as devoted co-parents to their children,\" Nyby said.\n\nJolie's attorneys also released a statement explaining her filing.\n\n\"Angelina’s filing of yesterday was both legally appropriate and factually accurate in all respects. What has been filed by Brad’s side today is a blatant attempt to obfuscate the truth and distract from the fact that he has not fully met his legal obligations to support the children. Following the incident of September 2016, Angelina and the children needed to move from the family home, which Brad chose to keep, including all of its contents. Brad was asked to assist in the expense of a new home for Angelina and the children, but instead he loaned Angelina money, for which he is charging her interest on a payment plan. Angelina will of course honor that loan. A loan is not, however, child support and to represent it as such is misleading and inaccurate.\n\n\"Angelina is asking Brad to pay 50% of the children’s expenses. He has not. Angelina has had to shoulder the majority of those without his contribution for the past two years. Child support is not optional in California. Typically a father of means would pay these expenses voluntarily without the need for a request or court order. We are hopeful that this can be resolved without further delay or posturing,\" the statement read.\n\nIt’s deplorable that someone for their own selfish reasons leaked selective portions of the confidential and sealed court record...\n\nJolie, 43, filed for divorce from Pitt, 53, in 2016, after two years of marriage and more than a decade as a couple. The actress has primary custody of the their six children: Maddox, 17; Pax, 14; Zahara, 13; Shiloh, 12, and twins Knox and Vivienne, 10.\n\nYet in June, a judge in the divorce case made several stipulations to ensure that Pitt maintains a close relationship with them. Those demands include a new visitation schedule for the summer and for Jolie to arrange a phone call between their kids and the children's doctors in which it would be explained that \"the court has determined each of them are safe with their father.\"\n\nThe actress and her team were furious about the release of those documents, which were obtained by The Blast and reviewed by ABC News, calling them \"misleading\" and \"not in the best interest of the children.\"\n\nIn a statement released at the time, Jolie's team insisted that the family court negotiations remain private.\n\n\"From the start, Angelina has been focused on their health and needs, which is why it was so important that this last court hearing be conducted privately.\"\n\n\"It’s deplorable that someone for their own selfish reasons leaked selective portions of the confidential and sealed court record to create an inaccurate and unfair picture of what is really happening.\"", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://s.abcnews.com/images/US/brad-pitt-gty-jef-180719_hpMain_2_16x9_992.jpg"], "top_img": "https://s.abcnews.com/images/US/brad-pitt-gty-jef-180719_hpMain_2_16x9_992.jpg", "keywords": [], "authors": ["Abc News", "Sabina Ghebremedhin", "Lesley Messer", "August", "Min Read"], "canonical_link": "https://goodmorningamerica.com/culture/story/brad-pitt-fires-back-angelina-jolie-claims-paid-57114183", "title": "Brad Pitt fires back at Angelina Jolie, claims he paid more than $1.3 million in child support", "meta_data": {"keywords": "children, lawyer, Angelina Jolie, Brad Pitt, legal trial, child support, wages, Good Morning America", "copyright": "2020 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "Brad Pitt fires back at Angelina Jolie, claims he paid more than $1.3 million in child support", "og": {"site_name": "ABC News", "url": "https://goodmorningamerica.com/culture/story/brad-pitt-fires-back-angelina-jolie-claims-paid-57114183", "title": "Brad Pitt fires back at Angelina Jolie, claims he paid more than $1.3 million in child support", "image": "https://s.abcnews.com/images/US/brad-pitt-gty-jef-180719_hpMain_2_16x9_992.jpg", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2018-08-09T12:57:57Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,57114183", "ipad": "abcnewsipad://link/story,57114183", "googleplay": "https://goodmorningamerica.com/culture/story/brad-pitt-fires-back-angelina-jolie-claims-paid-57114183"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "Brad Pitt fires back at Angelina Jolie, claims he paid more than $1.3 million in child support", "url": "https://goodmorningamerica.com/culture/story/brad-pitt-fires-back-angelina-jolie-claims-paid-57114183", "image": {"identifier": "https://s.abcnews.com/images/US/brad-pitt-gty-jef-180719_hpMain_2_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,57114183", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,57114183", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/goodmorningamerica.com/culture/story/brad-pitt-fires-back-angelina-jolie-claims-paid-57114183", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://goodmorningamerica.com/culture/story/brad-pitt-fires-back-angelina-jolie-claims-paid-57114183"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "http://abcnews.go.com", "summary": ""}