{"url": "https://web.archive.org/web/20181217170305/https://www.forbes.com/sites/erikkain/2018/12/17/this-former-the-walking-dead-star-has-some-harsh-words-for-rick-grimes/", "text": "Former The Walking Dead star Michael Cudlitz, better known to fans of the show as Abraham Ford, has some harsh words for the show he used to be a part of. Abraham met his end alongside Glenn (Steven Yeun) when Negan took his bat Lucille to both their skulls at the beginning of Season 7. In retrospect, it was a pretty good time to leave The Walking Dead.\n\nIt was the beginning of the end for AMC's zombie drama, at least until its surprising revival in Season 9 under the welcome stewardship of new showrunner Angela Kang. But the sad fact remains: Seasons 7 and 8 were horrible, no good lousy seasons of television that made so many poor choices I couldn't list them all if I tried.\n\nAnd the show has suffered for it, with ratings collapsing even as it finally drags itself back from the brink. Indeed, both myself and my colleague Paul Tassi agree that Season 9 is one of the best so far (we talk at length about this in our Walking Dead podcast here.)\n\nIn any case, I'm not alone in thinking the past two seasons were hot garbage. Abraham actor Michael Cudlitz had some choice words recently for the show and its lead protagonist, Rick Grimes. Speaking at the Atlanta Walker Stalker Con, Cudlitz laid down some hard truths:\n\n“Let’s be real clear, if he was gonna kill anyone other than me and I had a choice, it would be Rick. Because how many more people was that a—hole gonna get killed?” Cudlitz said, according to ComicBook.com. And while the audience was apparently shocked by this statement, he's not wrong. Rick led his people into one disaster after another. This started long before the disastrous Negan storyline, but Rick reached new heights of recklessness and stupidity as the show's writing quality plummeted.\n\nMore Cudlitz:\n\n“’Hey, I got a plan, let’s show up to where all the Saviors are with 500 weapons, have them step 15 feet out into the balcony unarmed, and shoot the windows out above his head.’ You all know that sucked [...] It was like the A-Team showed up.\"\n\nApparently at this point the actor started \"miming stray firing before imitating the showy Savior leader.\"\n\nCudlitz again, mocking the terribleness of this scene which, if Rick had simply shot Negan when he first swaggered out the door, would have put a blessed end to this whole nonsensical plot:\n\n“He’s right there! He’s right there! He walks out the door. It’s not even like he peeks out. He’s like ‘Well, Rick! Ha ha ha! We better run!’”\n\nThis is all too hilarious to me, as it really brings me back to my own review of that episode:\n\nEarlier, in Rick's speech, he made clear that only one Savior had to die: Negan. (They go and kill several lookouts right after that speech, so it's more like \"only five people have to die\" but who's counting?) And who should walk out onto his doorstep in plain view of all these heavily armed rebels? Who gives them all the perfect chance to take him out then and there? Who swaggers like he's the king of all he sees, never once worried that maybe Rick had given orders to shoot him on sight? If you guessed Negan, you win. The Big Bad walks right out there like he hasn't got a care in the world. He's soon followed by his lieutenants, including the coward, Eugene, and the traitor, Dwight. It turns out, he had nothing to be afraid of. Despite being heavily armed, despite having multiple weapons with scopes and a clear shot, despite coming to do this very thing, nobody opens fire on Negan. Why? This is one of those incredibly frustrating moments that have come more and more to define The Walking Dead. Because there's really no good explanation as to why nobody shoots Negan the moment he showed his smug face. There's no reason one of the dozens of rebels couldn't have popped him at such close range.\n\nI should point out that Rick also had snipers that expertly took out the Savior lookouts just before all this (so more like 7 or 8 people had to die, just none of them ended up being Negan because Rick eventually spared him out of mercy moments after murdering other Saviors who had helped him.)\n\nIn any case, it's quite hilarious to see Cudlitz lay into the show with such naked honesty. Season 8 was just so horrendously awful it very nearly killed the show entirely. For instance, that Season 8 premiere review I linked to up above? That got 424,000 views. My Season 7 premiere review got over 700,000 views. Fast forward to my Season 9 premiere review? 125,000 views, and a steady drop in views ever since.\n\nThis isn't just people not watching the show the night of, it's people running for the hills. And it's come to this because nobody at AMC had the nerve to step in and save the show from its incredible mismanagement, terrible writing and lousy direction. I'm not sure where all the blame should sit, and I'm sure fingers could point in many directions, but it's still baffling just how bad it got, and how much better it's gotten thanks to Angela Kang's new leadership.\n\nAnother actor present at the convention was Josh McDermitt who plays Eugene and who, as insane as this sounds, probably had the most interesting arc in Season 8, mostly demurred: “I disagree, only because I’m still on the show and like my job,” he said.\n\nPerhaps the most important quote from Cudlitz, or at least the one that speaks to me the most, is this: “It’s like one of those things where you’re so into something and then you’re like, ‘really, guys?’” Cudlitz said. “I get pissed off because I love it.”\n\nI've received so much anger and hate from The Walking Dead fans who said that I was trying to ruin their beloved show, when the whole time I was the one raising the red flags, saying \"Really guys?\" because I am a fan. I am a critic, yes, and it's my job to point out when a show goes astray like this. I feel like finally in Season 9, many of my criticisms of the show have finally been heard and we've seen a remarkable uptick in quality. That's fantastic! (Though now I'm being accused of having turned into a shill or, worse, a taking bribes to say nice things about the show because that's the sad truth about fandom. If you say something critical you're a monster and if you say something nice you're a patsy. Oy vey.)\n\nIn any case, bravo to Michael Cudlitz for speaking out. I still wish he'd been the choice for the Fear The Walking Dead crossover, but I think he dodged a bullet there. Or a bat, as the case may be.\n\nAs a side note, I think Rick getting killed at the beginning of Season 7 would have been an amazing creative decision and would have, potentially, made for a much more interesting story arc for all involved. Oh well.", "images": ["https://web.archive.org/web/20181217170305im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Ferikkain%2Ffiles%2F2018%2F12%2Fabraham-ford-cover-1038861.jpg", "https://web.archive.org/web/20181217170305im_/https://secure.gravatar.com/avatar/0b95268a1a76ca3c83a2112b38af5958?s=400&d=mm&r=g"], "top_img": "https://web.archive.org/web/20181217170305im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Ferikkain%2Ffiles%2F2018%2F12%2Fabraham-ford-cover-1038861.jpg", "keywords": [], "authors": ["Erik Kain", "Senior Contributor"], "canonical_link": "https://web.archive.org/web/20181217170305/https://www.forbes.com/sites/erikkain/2018/12/17/this-former-the-walking-dead-star-has-some-harsh-words-for-rick-grimes/", "title": "This Former 'The Walking Dead' Star Has Some Harsh Words For Rick Grimes", "meta_data": {"viewport": "width=device-width,initial-scale=1", "apple-itunes-app": "app-id=588647136", "fb": {"app_id": 123694841080850}, "og": {"site_name": "Forbes", "title": "This Former 'The Walking Dead' Star Has Some Harsh Words For Rick Grimes", "image": "https://web.archive.org/web/20181217170305im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Ferikkain%2Ffiles%2F2018%2F12%2Fabraham-ford-cover-1038861.jpg", "updated_time": "2018-12-17T08:30:19-05:00", "url": "https://web.archive.org/web/20181217170305/https://www.forbes.com/sites/erikkain/2018/12/17/this-former-the-walking-dead-star-has-some-harsh-words-for-rick-grimes/", "description": "Former 'The Walking Dead' star Michael Cudlitz doesn't mince words about the horribleness of the last two seasons.", "type": "article"}, "twitter": {"site": "@forbes", "card": "summary_large_image", "title": "This Former 'The Walking Dead' Star Has Some Harsh Words For Rick Grimes", "description": "Former 'The Walking Dead' star Michael Cudlitz doesn't mince words about the horribleness of the last two seasons.", "image": "https://web.archive.org/web/20181217170305im_/https://thumbor.forbes.com/thumbor/600x300/https%3A%2F%2Fblogs-images.forbes.com%2Ferikkain%2Ffiles%2F2018%2F12%2Fabraham-ford-cover-1038861.jpg", "creator": "@erikkain"}, "description": "Former 'The Walking Dead' star Michael Cudlitz doesn't mince words about the horribleness of the last two seasons.", "author": "Erik Kain", "article": {"publisher": "https://www.facebook.com/forbes", "author": "Erik Kain", "section": "Innovation", "section_url": "https://www.forbes.com/games/", "id": "blogAndPostId/blog/post/1360-53203", "published": "2018-12-17", "modified": "2018-12-17"}}, "movies": [], "publish_date": 1544976000.0, "source": "https://web.archive.org", "summary": ""}