{"url": "www.newidea.com.au/furious-portia-de-rossi-warns-jennifer-aniston-to-stay-away-from-wife-ellen-degeneres", "text": "‘Tensions have been rising between Jen and Portia for a while now, and things definitely came to a head during their meal,’ spills the insider.\n\n‘Everything started off great at the start of the night, but it wasn’t long before things became very heated between Jen and Portia.’\n\nAccording to the source, Jen and Ellen spent a long time away from the table engrossed in a conversation, and Portia clearly began to get suspicious.\n\n‘Jen and Ellen had been talking away from the group for a while and Portia didn’t like it.\n\nAfter a while Portia confronted Jen and accused her of being a bad influence on Ellen, and it just took off from there.\n\nJen is always going to stick up for herself – especially when she’s not doing anything wrong – and things got pretty tense.\n\n‘Everyone was talking about it. It was a pretty dramatic end to the night and Portia seemed pretty angry,’ the source adds.\n\nSince Jen’s recent split from Justin, 46, in February, along with rumoured troubles with Jen’s ex-husband Brad Pitt, 54, Portia knows that Jen isn’t very positive about relationships at the moment and she doesn’t feel comfortable with Jen hanging around with Ellen.\n\n‘At the end of the day, Portia just doesn’t trust Jen around Ellen. She is convinced that Jen is turning Ellen against her.\n\n‘They’ve never seen eye to eye and Portia is convinced that Jen badmouths her to Ellen, and it drives her wild with anger and jealousy,’ the source adds.\n\nReports that Portia’s nine-year marriage to Ellen is in trouble have surfaced repeatedly, with Life & Style claiming the couple were fighting non-stop last year.\n\nOne Craig’s staffer admitted to the publication that the couple didn’t seem happy at all while they were dining at the eatery.\n\n‘Ellen seemed miserable and Portia just looked sad,’ the staffer said. ‘“Happy” isn’t the first word I would use to describe them,’ they added.\n\nAnd according to New Idea’s source, Portia is concerned that Ellen is saying negative things about her to Jen, and the Friends actress is just adding fuel to the fire, especially as she’s had such a bad run in her own love life.\n\n‘Portia knows that Ellen talks to Jen about her and their marriage – especially their relationship troubles – and she can only imagine what Jen has to say about that,’ the source says.\n\nPortia’s biggest fear is that Jen will advise Ellen to simply throw in the towel – like she did with Justin – and give her the wrong message.\n\n‘The fact that Jen is pretty down on love and negative about marriage at the moment, after her relationship to Justin ended so abruptly, makes it worse in Portia’s eyes. She and Ellen have ups and downs like any married couple, but she’s worried that Jen has given up on marriage and is telling Ellen to do the same.’\n\nBut despite troubles behind closed doors, Portia and Ellen remain publicly united.\n\n‘We’re just really good friends and we talk about everything, and we never, ever, ever lie to each other, like, not even the tiniest lies,’ Portia told ET. ‘And she’s the only person I want to hang out with. Like, she is my best friend and I just want to be with her all the time.’\n\nFor the full story see this weeks issue of New Idea - out now!", "images": ["http://www.newidea.com.au/Branding/newidea/images/brand-logo-gray.svg", "https://snowplow.swm.digital/i?e=se&se_ca=ping&tv=http-get-0.1.0&dtm=0&stm=0&tna=pac&p=web", "http://www.newidea.com.au/media/73139/ni4619_cover_nobc_bws.png?height=158", "http://www.newidea.com.au/Branding/newidea/Images/idm-error-icon.svg", "http://www.newidea.com.au/Branding/newidea/images/gmail.svg", "http://secure-gl.imrworldwide.com/cgi-bin/m?ci=au-pacmags&cg=0&cc=1&ts=noscript", "http://www.newidea.com.au/Branding/NewIdea/images/brand-logo-footer-new.svg", "http://www.newidea.com.au/media/28041/ellen-jen-portia-feud.jpg", "http://www.newidea.com.au/Branding/newidea/images/idm-thanks-icon.svg", "http://www.newidea.com.au/Branding/NewIdea/images/enhanced-header-logo.svg"], "top_img": "http://www.newidea.com.au/media/28041/ellen-jen-portia-feud.jpg", "keywords": [], "authors": ["Faye James", "Faye James Is A Regular Contributor At New Idea", "Who", "Practical Parenting", "Works Across Health", "Beauty", "Celebrity", "Royal Content. She Has Over Years Of Experience Spanning Across The Uk", "Middle East"], "canonical_link": "https://www.newidea.com.au/furious-portia-de-rossi-warns-jennifer-aniston-to-stay-away-from-wife-ellen-degeneres", "title": "Furious Portia warns Jen: 'Stay away from Ellen!'", "meta_data": {"language": "en-us", "description": "Portia de Rossi is reportedly furious with her wife Ellen DeGeneres’ pal Jennifer Aniston.", "news_keywords": "Portia De Rossi, Ellen Degeneres, Jennifer Aniston, Furious Portia De Rossi warns Jennifer Aniston to stay away from wife Ellen Degeneres, Portia De Rossie feud Jennifer Aniston, courtney cox, celebrity feuds, The Ellen Show, Jennifer Aniston and Ellen Degeners feud, Ellen feud Jen Aniston, Jen Aniston latest, biggest celebrity feuds, celeb feuds, celebrity gossip, latest celebrity gossip, celeb goss, latest celeb goss, celeb gossip, latest celebrity gossips", "robots": "index, follow", "og": {"site_name": "New Idea", "type": "article", "url": "https://www.newidea.com.au/furious-portia-de-rossi-warns-jennifer-aniston-to-stay-away-from-wife-ellen-degeneres", "title": "Furious Portia warns Jen: 'Stay away from Ellen!'", "description": "Portia de Rossi is reportedly furious with her wife Ellen DeGeneres’ pal Jennifer Aniston.", "image": {"identifier": "http://www.newidea.com.au/media/28041/ellen-jen-portia-feud.jpg", "width": 1500, "height": 800}}, "twitter": {"title": "Furious Portia De Rossi warns Jennifer Aniston to stay away from wife Ellen Degeneres", "description": "Portia de Rossi is reportedly furious with her wife Ellen DeGeneres’ pal Jennifer Aniston.", "image": "http://www.newidea.com.au/media/28041/ellen-jen-portia-feud.jpg", "url": "https://www.newidea.com.au/furious-portia-de-rossi-warns-jennifer-aniston-to-stay-away-from-wife-ellen-degeneres"}, "fb": {"admins": 863618607005758, "pages": 140279489324860}, "msvalidate.01": "3BD3CB44DC500E9821E82E085D0F0D13", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1526952762.649, "source": "http://www.newidea.com.au", "summary": ""}