{"url": "http://blog.feelingthevibe.com/archives/recap-of-the-arrangement-season-2-episodes/", "text": "E!’s hit show, The Arrangement has aired two of its episodes from the second season, and from the looks of it, the drama is just getting started! Check out the recaps of episodes 1 and 2 below!\n\nEpisode 1 – “The Long Game” Recap from 3/11/2018\n\nIn the first episode of season 2, viewers are brought back to a seemingly happy Megan Morrison (Christine Evangelista) as she and her fiancé Kyle West (Josh Henderson) attend their engagement party. Not all is as it seems though, as Megan continues to have flashbacks to her horrible time in the Institute. That’s the Institute for the Higher Mind – you know, the place that Kyle’s mentor Terence (Michael Vartan) founded.\n\nMegan’s flashbacks and way of “faking it” in all aspects of life have led to rifts in her relationships with Kyle and her agent Leslie (Autumn Reeser). Yet she continues her plan to take down the Institute, with the help of her friend Shaun (Carra Patterson) – because sometimes, the only way to take something down, is to take it over from the inside.\n\n\n\n\n\nThe Arrangment Episode 1 Photos\n\nEpisode 2 – “Surface Tension” Recap from 3/18/2018\n\nIn the second episode, there’s another red carpet and even more drama as Megan collapses during the event. But who’s – or what’s – to blame? Kyle’s insistent that it’s not drugs; but Terence seems to be indifferent. Could he somehow be involved? It wouldn’t be that far of a stretch considering the hold he already has over Kyle. I wonder if DeAnn (Lexa Doig) will ever draw a line between the two of them before it gets out of hand.\n\nKyle’s movie on the other hand, has one kind of issue: his worries about being a first-time director. Kyle reveals to Megan that he’s unsure of who he is as a director, since he’s always been “hiding behind characters.” He doesn’t know how to feel about being so exposed. So what will all this mean for ‘Technicolor Highway?’ Guess we’ll have to wait and see!\n\nThe Arrangement Episode 2 Photos\n\nEpisode 3 – “The Sessions” Recap from 3/25/18\n\nIn this episode, Megan (Christine Evangelista) and Terence (Michael Vartan) seem to grow closer during their one-on-one sessions. During their first meeting, they delve into their pasts. Well, actually Terence does most of the talking, while Megan’s the one prying him with questions. She’s pulling a “Terence” on Terence himself!\n\n\n\n\n\nThe second meeting sees them acting way more casual, almost like they’re friends or oddly close pals. These meetings are obviously limiting Megan’s time with Kyle, and that can’t be good given their track record this season alone. Megan’s always with Terence, while Kyle takes his lead actor, Xavier (Ruffin Prentiss) under his wing.\n\nWe all know that Kyle just wants his first movie to be great, but how far will he go to make sure that happens? He seems to be very “on edge” in this episode – which has led to yet another argument between he and Megan. Megan thinks Kyle’s “projecting his fears” onto her by not trusting her with this movie role; he thinks she’s wrong. Never fear though, KyGan fans: they do make up. And Megan gave a killer performance her first day on set, I might add.\n\nOne relationship that’s being further torn apart? Terence and DeAnn. Terence’s time is being taken up by Megan and Shaun (Carra Patterson); while DeAnn (Lexa Doig) makes a decision regarding her affair with Mason (Garcelle Beauvais). But when DeAnn calls Mason to tell her the news, she receives some devastating news. But what exactly happened to Mason? Guess we’ll have to wait and see!\n\nThe Arrangement Episode 3 Photos\n\nEpisode 4 – “Scene 23” Recap from 4/1/18\n\nThere’s tons of romance and revelations in this latest episode. You see Terence and DeAnn finally taking strides in their marriage as well as Kyle and Megan opening up to one another. Then it gets passionate as the vision Kyle has for “Technicolor Highway” being brought to life. All while the ratings are starting to come in for his latest film, “The Kill Plan.” Add in a new and old character and there you have episode 4 of “The Arrangement.”\n\nLet’s start with Terence and DeAnn. They seem to be on the same page now in terms of what they want: a child! Can you believe it? Well, they sealed the deal, and they seem happy with their life right now. On the other side of things, DeAnn finally met her lover’s son, Wes (played by newcomer Jacob Artist). Mason has unfortunately passed, and DeAnn has a hard time dealing with it. Wes comes into play to help her talk through it and be there for her. Things get a little weird though when he kisses DeAnn. Oops.\n\nKyle’s got quite the duality going on right now: his latest film, “The Kill Plan” is released to the fans, but critics aren’t having it. It’s sinking fast, and it causes Kyle to lose focus on his current project, “Technicolor Highway.” Good thing Megan is there to help calm him. They finally get honest with each other on set and things seem better for them. Plus, Megan performs a killer scene for Kyle’s movie, so it’s a win-win!\n\nAs for the old character that comes back? Hope (Katharine Isabelle) – Megan’s ex-friend. Megan asks Hope to meet with her because she believes Hope can get her more dirt on the Institute. Shaun doesn’t approve, but Megan goes along with it anyway. Bad thing is, nothing pans out from Hope’s tip. At least, not yet. Speaking of Shaun, she’s been a bit preoccupied with Terence lately….well, his seminar, that is. Shaun strips down (literally and figuratively) and shows a side of herself viewers haven’t seen before. Makes for an interesting scene – definitely a standout.\n\nSo will Megan finally get the dirt she needs to bring IHM down? And what about this Wes character? Will DeAnn have even more drama in her life? And what about Kyle’s movie, will it keep running smoothly? Tune in next week to find out.\n\nThe Arrangement Episode 4 Photos\n\nEpisode 5 – “You Are Not Alone” Recap from 4/8/18\n\nThis episode has so many plots for each character or relationship, it’s hard to keep track! First up: Kyle and Megan meet with Terence and DeAnn at a party, where all seems romantic for each couple. Although, according to DeAnn, “marriage is just temporary…a negotiation.” Megan and Kyle don’t ever want to end up like that, but a rumor rocks their world and makes them question each other. Apparently, tabloids have reported that “Kygan” is fake, and that Megan is in love with her co-star, Xavier. Both of which aren’t true, but you know how it is in Hollywood. Causing even more tension for Kygan is the fact that Megan’s been trying to convince Kyle that Terence has just been riding his coattails. Kyle still feels as though he owes Terence for making him what he is, so it’s difficult for him to get out of Terence’s control.\n\nSpeaking of control, Terence feels like he’s losing it with DeAnn. You’ve got DeAnn admitting her past with Mason (DeAnn’s ex-girlfriend), which leaves Terence angry that DeAnn has such a love for her instead of him. Terence and DeAnn are hitting a wall, Terence is not able to get a handle on Megan, and Terence is losing grip on Kyle because of Megan. Sounds like things aren’t good for Terence right now. One thing though that keeps coming around is Shaun. I don’t know if their relationship is going to go past professional or not, but if it does, could Megan’s plan for IHM’s takedown be on the line? And what does Xavier supposedly being in love with Megan mean for Kyle’s movie? Can Terence and DeAnn finally pull themselves together enough to bring a kid into the world?\n\nThe Arrangement Episode 5 Photos\n\nEpisode 6 – “The Break Up” Recap from 4/15/18\n\nThis episode is special in a number of ways. First, you’ve got the start of it with a flashback to Kyle’s relationship with Lisbeth. Viewers see Kyle pacing back and forth, trying to get in contact with his then-girlfriend, only to find that she’s left him because “she got lost in his world.” Then we’re brought back to the present day, where the flashback connects to Kyle talking about how his failed relationship relates to his parents’ deaths (his mother from cancer and his father in a car accident). You’ve got Kyle feeling on edge because of this interview he’s conducting for IHM and because his movie isn’t going as well as he’d like. Terence isn’t helping the situation by spewing his “give IHM energy and it’ll give it back to you” advice – and you can see that the relationship between he and Kyle is strained.\n\nMeanwhile, you’ve got Kyle and Xavier in some weird competition to see who’s the best, or who is right and wrong. This leads to Kyle and Megan fighting, as well as Kyle being jealous over Megan and Xavier spending time together. Viewers then get a look, presumably inside Kyle’s head, as to why he feels this way: his arguments with Lisbeth over her last relationship with Gavin. You see a whole new side of Kyle that’s dark and full of rage. We then cut to Megan’s interview, where she seems to be all happy-go-lucky and sings the Institute’s praises (as does her movie co-star, Xavier). Beneath the surface though, you can tell she wants to expose Terence, which is where Shaun came in to try and find info on the Institute. Yet there’s no such animal (or so it seems), which leaves Megan internally frustrated.\n\nProbably one of the most jarring scenes is Kyle on his motorbike interspersed with flashbacks to his – surprise! – drug addiction. This ultimately led to a showdown between Kyle and Terence, that involved a gun. We see that Kyle was desperate and felt unloved, but Terence managed to talk him down. Another intense scene? A flashback from Terence’s POV showed that he and Lisbeth were together – while she was still engaged to Kyle! They hooked up, and Terence even admitted to being in love with her for a long while. After their escapade, Terence goes to see Kyle and gets him to go to the Facility. What’s crazy about this episode though is that during Kyle’s interview about IHM, he sounds like a robot, repeating word for word what Terence told him about why he needed to go to the Facility. The episode closes with Kyle firing Xavier and Kyle thinking that he’s got it all figured out. Little does he know, things haven’t even begun to go down.\n\nThe Arrangement Episode 6 Photos\n\nEpisode 7 – “On Location” Recap from 4/22/18\n\nWe start out with seeing the Kyle has in fact taken Xavier’s part in “Technicolor Highway”, alongside his fiancé Megan. Then, Megan goes into an audition where she runs into her former agent, Leslie. Leslie tries to see through to Megan’s real being, but she misses the mark when Megan puts up her “everything is fine” wall. As for her audition? Megan didn’t get the part, and it’s all because the director didn’t want IHM to bring drama to her set. In the first twist of the episode, the real reason Megan didn’t get the part? Her team at Creative Partners pulled her out of the running! This revelation causes a huge fight between Megan and Kyle, because Kyle knew about the “non-compete” agreement in the contract, but didn’t inform Megan.\n\n\n\n\n\nThey eventually make up by finally telling each other the truth about the contract…. or so they thought. Turns out Kyle lied about the real reason behind the contract, per Terence’s coaching. It’s insane how much control he has over their whole relationship.\n\nAnother obstacle occurs when Kyle (along with half the crew) get food poisoning. Since he’s unable to direct, it’s up to DeAnn and Megan to make sure his vision stays alive. DeAnn even gets Leslie to help out since they’re so short on camera assistants! DeAnn eventually listens to Leslie’s advice, and it seems as though they finish the scene without any more disasters. A toast by the fireside and they (Leslie, DeAnn and Megan) leave all their issues behind.\n\nBack in LA, Shaun and Terence are still buddy-buddy, except for the fact that Terence is being sneaky with meetings and Shaun is lying to Zach about finding one of the victims of IHM’s Facility. Terence is still trying to pitch this new idea of a “magic potion” that supposedly gives this promise of immortality. He’s even going the extra mile as to dig up dirt on investors in order to get them to sign off! The episode ends with Kyle and Megan truthfully making up when Megan spills that she wouldn’t sign the contract if asked again. And Terence tells Shaun that he “loves” that she’s completely herself…. just as she breaks into the IHM database to find out where Julie Woolth (one of the IHM victims) is hiding. So, will Shaun be able to really help Megan? And what about Terence – will his reign over Kyle’s life be broken down? Or will Kyle continue to follow his lead?\n\nThe Arrangement Episode 7 Photos\n\nEpisode 8 – “Paso Robles” Recap from 4/29/18\n\nThis episode is full of untold truths and so much drama. First, Kyle runs into Detective Gaffey – if you remember, he slept with her per Terence’s convincing to keep things quiet regarding the IHM investigation – while Megan is right there. Talk about awkward. Also odd? The fact that Kyle then keeps having a recurring nightmare about someone trying to kill him. He seems to think it’s related to Detective Gaffey, but Terence seems to think it’s about “someone close betraying him.” Which is it: a guilty conscience or a sign that something else is wrong?\n\nMeanwhile, Megan and Shaun go to Paso Robles, aka: “wine country” under the guise of her bachelorette party; when in reality, they’re going to investigate Julie Woolth. When they meet her, she seems all too happy about her experience with IHM. But Megan doesn’t seem to buy her story. Another story that might not be bought? Zach’s reason for using a burner phone! Kyle caught him talking about “Julie” but Zach lies to him and Terence about who Julie is. Since Zach was really talking to Megan, she’s freaking out because she assumes that Terence is going to find out the truth and ruin her.\n\nIn the biggest bombshell of the night, Julie’s brother Aaron tells Megan the truth about IHM. Yes, the payments they got from Terence were hush money; but Kyle was the one who put Aaron in the wheelchair. He lost his ability to walk because Kyle lost out to a part in a movie. Terence covered it all up in his own twisted version of an “arrangement.” What will this mean for Megan and Kyle? And what about Terence: will this be enough to finally take him down?\n\nThe Arrangement Episode 8 Photos\n\nEpisode 9 – “Truth” Recap from 5/6/18\n\nWe pick up right where we left off: Kyle comes clean about the night of Aaron’s attack. Megan comes to the realization that the contract wasn’t about her; it was about Kyle. As Kyle put it: “Self-preservation…it’s human nature.” Megan finally told Kyle the truth about why she needed to find Julie: to ruin Terence. The new plan? To move Aaron and Julie into a new house to keep them away from Terence and IHM. Kyle finally comes to face to face with Aaron and ends up telling Megan that he’ll always choose her. In a bombshell move, Kyle tells Terence and DeAnn (at the rehearsal dinner no less!) that he’s leaving IHM.\n\nTerence gave a nice speech at the dinner, but it wasn’t enough to make Kyle come crawling back. Or so Megan thought. Kyle really did get Zach out of the Facility; but Megan also thinks that Kyle was the one who told Terence where to find Julie and Aaron. Terence has made them disappear, but will Megan fall back into line like he wants? As for Kyle and Megan, they had a screaming match saying they can’t trust each other anymore. Kyle tells Megan he had nothing to do with Aaron and Julie, but Megan’s not buying it. Course, with each of them having lied so many times, how are they to know what the truth really is? What will that mean for the wedding?\n\nThe Arrangement Episode 9 Photos\n\nEpisode 10 (Season Finale) – “Suite Revenge” Recap from 5/13/18\n\nMegan wishes she could wake up in a different life….and her night with Xavier didn’t make that happen. After talking with Xavier, she still doesn’t know where she stands with everything. So when DeAnn reaches out saying she can “get [Megan] out of this” – Megan’s all ears. Turns out, Leslie wasn’t the one who got Megan that first audition with Kyle – DeAnn did. Megan goes through with the wedding – lovely gown and all – and becomes Mrs. Kyle West. Kyle and Megan share their first dance as a married couple and then run off together. It doesn’t last long as Megan tells Kyle she only came back for the wedding, not for their relationship. She ends up escaping the limo and jetting off with Leslie. Talk about a runaway bride!\n\nThey come back together the next morning, although their relationship is still very strained by all the lies they’ve told each other. To make matters worse, Terence and DeAnn have come up with a plan to make Megan disappear. And by disappear, they mean kill. Terence reiterates the plan to DeAnn, saying that they’ll catch Megan as she comes into the hotel for a (fake) meeting and inject her, making everyone think she died of a drug overdose. The twist? DeAnn records Terence’s admission and sends it to Megan.\n\nMeanwhile, Kyle comes clean on who he really is. Oh, and as for getting blamed for moving Aaron and Julie? Not Kyle’s fault. So, if not him, then who? Shaun. She confesses this to Megan, as well as the news that she’s staying with IHM. The insane bombshell ending to this finale? Kyle finds out about Megan and Xavier, which leads him to come to a decision. He confronts Megan, telling her that she’s going to follow the contract “to the letter.” As in, he has all the power now. Yeah, good luck with that. Megan has shown viewers that she can’t be tamed.\n\nHere’s to hoping this show gets a season 3, because Kygan’s got a lot more in store.\n\nThe Arrangement Episode 10 (Season Finale) Photos\n\nCheck back to this article for more recaps as the season continues. Be sure to watch The Arrangement as new episodes air Sundays at 9pm on E!", "images": ["https://www.feelingthevibe.com/wp-content/uploads/2017/05/makeup-tutorial-green-banner-300x250.png", "http://blog.feelingthevibe.com/wp-content/uploads/fbrfg/apple-touch-icon.png?v=00zGnW6Ol6", "https://secure.gravatar.com/avatar/6decf5af606ec2c04ffdeed753d26139?s=100&d=mm&r=g", "https://www.feelingthevibe.com/wp-content/uploads/2019/03/cropped-FTVLogo.png", "https://www.feelingthevibe.com/wp-content/uploads/2019/10/hallmark-movie-clothing.jpg"], "top_img": "http://blog.feelingthevibe.com/wp-content/uploads/fbrfg/apple-touch-icon.png?v=00zGnW6Ol6", "keywords": [], "authors": [], "canonical_link": "https://www.feelingthevibe.com/archives/recap-of-the-arrangement-season-2-episodes/", "title": "Recap of “The Arrangement” Season 2 Episodes", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "Updates, recaps and photos on season 2 of E!'s hit show, \"The Arrangement.\"", "keywords": "the arrangement season 2,the arrangement e!,christine evangelista and josh henderson,the arrangement recap,the arrangement new episodes", "generator": "WooCommerce 4.0.1", "msapplication-TileColor": "#da532c", "msapplication-config": "/wp-content/uploads/fbrfg/browserconfig.xml?v=00zGnW6Ol6", "theme-color": "#ffffff", "referrer": "always", "msapplication-TileImage": "https://www.feelingthevibe.com/wp-content/uploads/2019/09/cropped-FTV-Favicon1-270x270.png", "numberOfItems": 3, "itemListOrder": "Ascending"}, "movies": [], "publish_date": null, "source": "http://blog.feelingthevibe.com", "summary": ""}