{"url": "https://web.archive.org/web/20180313005506/https://en.wikipedia.org/wiki/Game_of_Thrones_(season_8)", "text": "The eighth and final season of the fantasy drama television series Game of Thrones was announced by HBO in July 2016.[1][2] Unlike the first six seasons that each had ten episodes and the seventh that had seven episodes, the eighth season will have only six episodes. Like the previous season, it will largely consist of original content not found currently in George R. R. Martin's A Song of Ice and Fire series, and will instead adapt material Martin has revealed to showrunners about the upcoming novels in the series, The Winds of Winter and A Dream of Spring.[3]\n\nThe season will be adapted for television by David Benioff and D. B. Weiss. Filming officially began on October 23, 2017. The season is scheduled to premiere in 2019.\n\nEpisodes [ edit ]\n\nCast [ edit ]\n\nMain cast [ edit ]\n\nSupporting cast [ edit ]\n\nProduction [ edit ]\n\nCrew [ edit ]\n\nSeries creators and executive producers David Benioff and D. B. Weiss will serve as showrunners for the eighth season. The directors for the eighth season were announced in September 2017. Miguel Sapochnik, who previously directed \"The Gift\" and \"Hardhome\" on season 5, as well as \"Battle of the Bastards\" and \"The Winds of Winter\" on season 6 will return as director. He will divide up direction of the first five episodes with David Nutter, who had directed two episodes on seasons two, three and five. The final episode of the show will be directed by Benioff and Weiss, who have previously directed one episode each.[4]\n\nAt the show's South by Southwest panel on March 12, 2017, Benioff and Weiss announced the writers for the show to be Dave Hill (episode 1) and Bryan Cogman (episode 2). The showrunners will then divide up the screenplay for the remaining four episodes amongst themselves.[20]\n\nWriting [ edit ]\n\nWriting for the eighth season started with a 140-page outline. Benioff said that the divvying up process and who should write what section became more difficult, being that \"this would be the last time that we would be doing this.\"[21]\n\nFilming [ edit ]\n\nIn an interview with Entertainment Weekly, HBO programming president Casey Bloys stated that instead of the series finale being a feature film, the final season would be \"six one-hour movies\" on television. He continued, \"The show has proven that TV is every bit as impressive and in many cases more so, than film. What they're doing is monumental.\"[22] Filming officially began on October 23, 2017.[23]\n\nEpisodes [ edit ]\n\nCo-creators David Benioff and D. B. Weiss have said that the seventh and eighth season would likely consist of fewer episodes, stating that after season six, they were \"down to our final 13 episodes after this season. We're heading into the final lap.\"[24][25] Benioff and Weiss stated that they were unable to produce 10 episodes in the show's usual 12 to 14 month time frame, as Weiss said, \"It's crossing out of a television schedule into more of a mid-range movie schedule.\"[24] HBO confirmed in July 2016, that the seventh season would consist of seven episodes, and would premiere later than usual in mid-2017 because of the later filming schedule.[26] Benioff and Weiss later confirmed that the eighth season will consist of six episodes, and is expected to premiere later than usual for the same reason.[27]\n\nBenioff and Weiss spoke about the end of the show, saying, \"From the beginning we've wanted to tell a 70-hour movie. It will turn out to be a 73-hour movie, but it's stayed relatively the same of having the beginning, middle and now we're coming to the end. It would have been really tough if we lost any core cast members along the way, I'm very happy we've kept everyone and we get to finish it the way we want to.\"[27] The season is set to air in 2019.[7]\n\nMusic [ edit ]\n\nRamin Djawadi is set to return as the composer of the show for the eighth season.[28]", "images": ["https://web.archive.org/web/20180313005506im_/https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://web.archive.org/web/20180313005506im_/https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://web.archive.org/web/20180313005506im_/https://upload.wikimedia.org/wikipedia/en/thumb/e/e0/Game_of_Thrones_Season_8.png/220px-Game_of_Thrones_Season_8.png", "https://web.archive.org/web/20180313005506im_/https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Peter_Dinklage_by_Gage_Skidmore.jpg/100px-Peter_Dinklage_by_Gage_Skidmore.jpg", "https://web.archive.org/web/20180313005506im_/https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://web.archive.org/web/20180313005506im_/https://upload.wikimedia.org/wikipedia/en/e/e0/Game_of_Thrones_Season_8.png", "https://web.archive.org/web/20180313005506im_/https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/Lena_Headey_Primetime_Emmy_Awards_2014.jpg/100px-Lena_Headey_Primetime_Emmy_Awards_2014.jpg", "https://web.archive.org/web/20180313005506im_/https://en.wikipedia.org/static/images/wikimedia-button.png", "https://web.archive.org/web/20180313005506im_/https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Emilia_Clarke.jpg/100px-Emilia_Clarke.jpg", "https://web.archive.org/web/20180313005506im_/https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Nikolaj_Coster-Waldau_by_Gage_Skidmore.jpg/100px-Nikolaj_Coster-Waldau_by_Gage_Skidmore.jpg", "https://web.archive.org/web/20180313005506im_/https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png"], "top_img": "https://web.archive.org/web/20180313005506im_/https://upload.wikimedia.org/wikipedia/en/e/e0/Game_of_Thrones_Season_8.png", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20180313005506/https://en.wikipedia.org/wiki/Game_of_Thrones_(season_8)", "title": "Game of Thrones (season 8)", "meta_data": {"generator": "MediaWiki 1.31.0-wmf.24", "referrer": "origin-when-cross-origin", "og": {"image": "https://web.archive.org/web/20180313005506im_/https://upload.wikimedia.org/wikipedia/en/e/e0/Game_of_Thrones_Season_8.png"}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}