{"url": "www.elitedaily.com/p/are-stella-maxwell-kristen-stewart-still-dating-heres-everything-we-know-5493753", "text": "Kristen Stewart is like a unicorn in Hollywood. She always looks absurdly cool and rebellious, but stays away from getting herself into trouble. She is seemingly down-to-earth despite the fact that she’s worth millions; and, oh yeah, she’s been linked to dating some seriously gorgeous-looking humans. From Robert Pattinson to St. Vincent, this girl has a pretty envious list of exes. But most recently, people are wondering if Kristen Stewart and Stella Maxwell are still dating since the two have been linked to each other for about a year now (and that's a looong time in Hollywood).\n\nThe couple keeps their relationship pretty low-key, and, considering Stewart's social media presence is barely existent, creeping on the actress and her Victoria's Secret model girlfriend is a big undertaking. Stewart, who has no Facebook or Twitter, technically has an Instagram account, but it's private, telling USA Today:\n\nI have a private Instagram so I can keep in touch with my friends because I’m always away. That’s not social media. We have a shared photo stream.\n\nUgh. And if you think you can sleuth your way through Stella Maxwell's Instagram account, think again, as her posts are mainly photos of her looking flawless. So how are we, as a nation, supposed to learn if the two are still together?\n\nThat's where I come in, folks. I've done the dirty work for you. You're welcome.\n\nWhen Kristen Stewart came out as bisexual, I literally bowed down, because this girl was so effortless about her sexuality. In an interview with The Guardian, she explains her perspective:\n\nBut it’s cool that you don’t have to nail everything down any more. That whole certainty about whether you’re straight or gay or whatever ... You’re not confused if you’re bisexual. It’s not confusing at all. For me, it’s quite the opposite.\n\nAnd who can forget her cameo on SNL, when she was, \"like, so gay\":\n\nSee? Bow down, people.\n\nSo when Stewart started hooking up with Maxwell, people definitely approved, because, I mean, LOOK AT THEM.\n\nThe celebrity relationship gods did good with this pairing.\n\nBut, let's also remember that it isn't every day that these two are spotted out together, and that can make fans worried. Are they in a fight? Have they broken up? What will happen to their dog? Can I... can I take him?\n\nRelax, people! It seems that the couple is still going strong, since they've been photographed being cute AF in matching leather jackets this past August, and most recently, Stewart and Maxwell were spotted hanging together in what seems like the same leather jackets. Wearing the same clothes twice: Stars, they're just like us!\n\nIt's clear that the couple are going strong, even ex-boyfriends be damned –particularly Robert Pattinson. This past July, Stewart and Maxwell were apparently on the same flight from France with Pattinson. Eesh. Insert awkward polite head nod here.\n\nGuys, I'm just going to say this: if you're current partner can keep their chill while sharing a flight with someone you've previously dated, you guys are going to have a lasting, loving relationship. (I mean, probably. I'm not an expert.)\n\nBut if you're worried that Stewart and Maxwell have called it quits – psh. Please. They're totally good! They have a dog together, and they basically match every outfit together. If that doesn't signify a relationship that's cruising on easy, glassy waters, then I've clearly been navigating things with my husband very, very wrong.\n\nSo let's all take a minute to appreciate K-Stew's low-key, edgy, cool, relationship with her ridiculously beautiful girlfriend, while also taking some time for ourselves to Google where to buy those badass leather jackets.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2020/4/16/555700cf-c269-4ba5-9ad4-004df0469bc7-getty-1170538224.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/16/7136529d-01cd-4144-849c-502e8ab4a6e6-getty-1176988943.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/15/6020d905-531a-4969-84d2-f3c3ca4938de-getty-1193835672.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2017/11/16/3eb0c7ec-a313-4b32-9222-760e738a1264-getty-632217740.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2017/11/16/3eb0c7ec-a313-4b32-9222-760e738a1264-getty-632217740.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/uploads/getty/2017/11/16/3eb0c7ec-a313-4b32-9222-760e738a1264-getty-632217740.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/are-stella-maxwell-kristen-stewart-still-dating-heres-everything-we-know-5493753", "title": "Are Stella Maxwell & Kristen Stewart Still Dating? Here's Everything We Know", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/are-stella-maxwell-kristen-stewart-still-dating-heres-everything-we-know-5493753", "type": "article", "title": "Stella Maxwell & Kristen Stewart Are Still The Cutest Couple In Existence – PHOTOS", "description": "Kristen Stewart is like a unicorn in Hollywood. She always looks absurdly cool and rebellious, but stays away from getting herself into trouble. She is seemingly down-to-earth despite the fact that she’s worth millions; and, oh yeah, she’s been…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2017/11/16/3eb0c7ec-a313-4b32-9222-760e738a1264-getty-632217740.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "Kristen Stewart is like a unicorn in Hollywood. She always looks absurdly cool and rebellious, but stays away from getting herself into trouble. She is seemingly down-to-earth despite the fact that she’s worth millions; and, oh yeah, she’s been…"}, "movies": [], "publish_date": null, "source": "http://www.elitedaily.com", "summary": ""}