{"url": "https://www.bustle.com/p/will-the-royals-return-for-season-5-this-story-is-far-from-over-9063472", "text": "With a royal wedding and a coup all occurring during the Season 4 finale of The Royals, viewers are going to want to see what's next for this TV monarchy. But whether The Royals will return for Season 5 hasn't been announced yet, because the series has yet to be renewed. If it does come back, though, it will be with a new showrunner.\n\nShowrunner Mark Schwahn was fired in December due to allegations of sexual assault against him. (Bustle reached out to Schwahn's rep for comment regarding his firing at the time, but did not receive an immediate response). At the time, Season 4 had already been completed and aired as scheduled. So, someone new would need to be brought in for future episodes — which fans will surely hope for. The royal family's story will be far from wrapped up after the Season 4 finale on May 13.\n\nWhile The Royals had previously always been renewed for its next season before the finales aired, that's not the case for Season 5. And in an interview with E! News that was published on May 5, Liam and Eleanor actors William Moseley and Alexandra Park still didn't know the fate of their show. But Moseley certainly seemed optimistic. Although he tried to be vague, he made it clear that the Season 4 finale, \"With Mirth in Funeral and With Dirge in Marriage,\" should not be the end of The Royals. \"We don't know yet [about Season 5]. We're very excited to find out and we feel the show can't end the way it ends? I'm not going to give anything away,\" Moseley told E!. \"It's only just the beginning.\"\n\nWhen Bustle spoke to Moseley and Park before the Season 4 premiere, the actors said something similar. \"I think it's such a strong season and a cliffhangery season that I don't know how they could finish it,\" Moseley said about The Royals ending after Season 4. Park added, \"The end of Season 4, it's a massive ending. Like, it's a huge ending. And I think the fans and the Loyals will be pretty upset if that's the end.\"\n\nThe past few episodes have certainly set the show up to have a \"massive ending\" to this season. Liam, Kathryn, Cyrus, Helena, Eleanor, and Jasper are all conspiring to bring down the tyrannical King Robert. And Willow will need to decide if she wants to go through with marrying Robert now that she knows he hasn't been genuine about his feelings for her. With a rebellion and a runaway bride on the table in \"With Mirth in Funeral and With Dirge in Marriage,\" the series being canceled now would disappoint a lot of people.\n\nE!\n\nIf you're worried that a next season won't happen, take comfort from the fact that Park told Bustle that a Season 5 had initially been in the cards for E!'s first scripted show. \"We've always talked about it with everyone else that five seasons was what was the hope that we would do. And I think that was from speaking to the writers and stuff,\" Park said. That could mean that a potential fifth season would also be the last for The Royals. But it would at least allow the writers to finish the show on their terms with a satisfactory ending that gives viewers closure.\n\nAs for when a potential Season 5 could air, past seasons of The Royals haven't had consistent premiere dates. The first two seasons aired within the same year. Then Season 3 premiered in December 2016 and Season 4 premiered 15 months later in March 2018. Considering that — and that the show hasn't even been renewed yet — a Season 5 probably wouldn't air until after spring 2019. But, if the Season 4 finale of The Royals is as shocking as Park and Moseley have teased, it certainly will be worth the wait. And until then, you can keep up with the real royals who have their own royal wedding to attend.\n\nIf you or someone you know has been sexually assaulted, call the National Sexual Assault Telephone Hotline at 800-656-HOPE (4673) or visit online.rainn.org.", "images": ["https://imgix.bustle.com/uploads/image/2018/5/11/e5d1e751-494e-40d9-8da4-e32444bd17f5-screen-shot-2018-05-10-at-34603-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2020/4/16/88c2d6dc-b9de-443f-afd2-44e50bc498d3-screen-shot-2020-04-16-at-160117.png?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/15/249ef55e-cc74-41ae-84ed-182c2d2a0d35-the-english-game-1-t-1.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/5/11/e5d1e751-494e-40d9-8da4-e32444bd17f5-screen-shot-2018-05-10-at-34603-pm.png?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/6/e868b5a2-05d6-450f-9598-b6e0b0cdc0df-tr-310_scn50_gd0309.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2018/5/11/9df9017b-b836-40ea-b706-b028503d4e3c-screen-shot-2018-05-10-at-34918-pm-2.png?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/6/85c45ddb-d7e4-41c5-b566-051d56a5691e-nup_189463_1076.JPG?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/5/11/e5d1e751-494e-40d9-8da4-e32444bd17f5-screen-shot-2018-05-10-at-34603-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/will-the-royals-return-for-season-5-this-story-is-far-from-over-9063472", "title": "Will 'The Royals' Return For Season 5? This Story Is Far From Over", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/will-the-royals-return-for-season-5-this-story-is-far-from-over-9063472", "type": "article", "title": "'The Royals' Cast Dishes On Whether Season 5 Will Happen", "description": "With a royal wedding and a coup all occurring during the Season 4 finale of The Royals, viewers are going to want to see what's next for this TV monarchy. But whether The Royals will return for Season 5 hasn't been announced yet, because the series…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/5/11/e5d1e751-494e-40d9-8da4-e32444bd17f5-screen-shot-2018-05-10-at-34603-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "With a royal wedding and a coup all occurring during the Season 4 finale of The Royals, viewers are going to want to see what's next for this TV monarchy. But whether The Royals will return for Season 5 hasn't been announced yet, because the series…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}