{"url": "www.inquisitr.com/4777312/brad-pitt-reportedly-locked-out-by-shiloh-jolie-pitt-after-angelina-jolie-split-says-radar/", "text": "Angelina Jolie and Brad Pitt have been living in separate homes since their split more than a year ago. The six children (Maddox, Pax, Zahara, Vivienne, Knox, and Shiloh Jolie-Pitt) are residing with Jolie while reportedly enjoying private visits with Pitt. However, according to Radar Online, a recent visit to Paris for Angelina and the children offered a shocking insight into Brad’s relationship with the kids, particularly his look-alike first biological child, Shiloh Jolie-Pitt.\n\nBrad Pitt Reportedly Suffers “Every Father’s Worst Nightmare”\n\nPitt’s children allegedly locked him out by creating a message that contained the first initials of every family member except Brad, claimed the publication. Shiloh reportedly was the one who created the actual message and omitted Pitt’s name.\n\n“Shiloh [left Brad Pitt’s] name off [a message on the] Paris Bridge Of Love.”\n\nRadar Online claimed to have “exclusive” photos that showed Jolie vacationing with all six kids in Paris. As part of their visit, Shiloh reportedly participated in a tradition that the media outlet described as heartbreaking for her dad. The 11-year-old allegedly was seen with a lock that she had marked up with the initials of her closest relatives with the exception of her famous father, Brad.\n\nPitt’s first biological child then fastened the lock onto a bridge that overlooks the River Seine. Shiloh reportedly took the key for that lock and tossed it into the water.\n\nShiloh Jolie-Pitt reportedly participated in a tradition in Paris that broke her father Brad Pitt's heart. Featured image credit: Jordan Strauss Invision/AP Images\n\nRadar Online pointed out that the photos obtained by the publication seemed “innocent” at first. Later, however, after seeing that Brad’s initials were allegedly missing from the lock, the media outlet questioned Pitt’s relationship with his kids.\n\n“Shocking new photos exclusively obtained by Radar Online of [Brad Pitt’s] estranged wife, Angelina Jolie, vacationing with their six kids in Paris appeared innocent but later proved to be every father’s worst nightmare!”\n\nAsked about the reason why Shiloh would put all the family members’ initials on a lock, fasten it to the bridge, and then throw away the key, a source told Radar Online that it is a “French tradition.” Visitors to the bridge from other countries, as well as Paris residents, take time to write down their names with a date on padlocks. As for why Shiloh allegedly tossed the key into the water, the source explained that the gesture symbolizes that every person named on the lock is locked in love forever.\n\nShiloh Jolie-Pitt’s Gesture Has Shocking Interpretation By Insider\n\nBut Brad reportedly was the only family member left out when Shiloh wrote down the names of her closest relatives, according to Radar. A source described as someone close to Angelina Jolie’s and Pitt’s family offered a shocking interpretation of what the lock scenario means.\n\n“It’s as if Shiloh was disowning her dad!”\n\nWhile Jolie frequently has been seen on the red carpet and shopping with one or more of her children, Brad reportedly sees the kids behind closed doors, according to the media outlet. A parenting expert, Dr. Kerby T. Alvy, told Radar that it might be helpful if Pitt attended some of the public events with Angelina and the kids. Dr. Alvy expressed concern that the situation “sends a very negative message” to the kids that Brad “is no longer a part of their family.”\n\nAnother mental health expert, Dr. Gilda Carle, told the media outlet that Jolie and Pitt should find a way to “reinforce” to their kids that although their parents are no longer together, the children will “always” have him in their lives as their father.\n\nHowever, Vogue pointed out that Angelina and Brad’s split has been challenging for Jolie as well as her six kids and their dad. Admitting that she has gone through her “ups and downs,” Angelina revealed that she has prioritized her children.\n\n“We all have our difficult times, but as a mother you also have a responsibility first and foremost towards the kids.”\n\nJolie revealed that she feels her six children currently are in their “formative years.” As a result, Angelina believes that “everything” in her life should take second place to her kids. She took time away from work for more than a year in order to focus on them. Jolie also shared the reason for that trip to Paris.\n\n“We’ve all been a bit in lock-down,” admitted Angelina. “I think they’re itching to get out in the world again.”", "images": ["http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "https://secure.gravatar.com/avatar/fa8aa86244d76bf2aee7e2fb5b934ea3?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2018/02/Brad-Pitt-Shiloh-Jolie-Pitt-Kids.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "https://cdn.inquisitr.com/wp-content/uploads/2018/02/Shiloh-Jolie-Pitt-Angelina-Jolie-Brad-Pitt-Split.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Joanne Eglash"], "canonical_link": "https://www.inquisitr.com/4777312/brad-pitt-reportedly-locked-out-by-shiloh-jolie-pitt-after-angelina-jolie-split-says-radar/", "title": "Brad Pitt Reportedly ‘Locked Out’ By Shiloh Jolie-Pitt After Angelina Jolie Split, Says ‘Radar Online’", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}