{"url": "http://time.com/5092574/gianni-versace-andrew-cunanan/", "text": "Investigators still don’t know why Andrew Cunanan killed Gianni Versace.\n\nOn July 15, 1997, Cunanan approached the famed Italian designer as he returned to his Miami Beach mansion after a morning trip to a nearby café. Cunanan opened fire at point-blank range, shooting Versace twice in the back of the head, according to FBI records.\n\nAt the time of his death, Versace was one of the most high-profile fashion designers in the world, dressing the likes of Princess Diana, Madonna and Elton John. His murder, which shocked the nation, is the focus of FX’s The Assassination of Gianni Versace: American Crime Story. It premieres Wednesday.\n\nWhat is known about Cunanan and Versace is that the fashion mogul was not Cunanan’s first victim. Cunanan was a serial killer, suspected in four other deaths. He was on the FBI’s Ten Most Wanted Fugitives list, the subject of a national manhunt, and was hiding out in Miami Beach’s gay scene at the time he killed Versace.\n\nAuthorities believe Cunanan’s killing spree before Versace targeted ex-lovers, including some he may have believed may have given him HIV.\n\nHere’s what to know about suspected serial killer Andrew Cunanan:\n\nFour mug shots of Andrew Cunanan, who shot and killed fashion designer Gianni Versace. Time Life Pictures—The LIFE Picture Collection/Getty Images\n\nWho was Andrew Cunanan?\n\nHours after Versace’s shooting death, authorities identified Andrew Cunanan as the prime suspect. The 27-year-old was on the FBI’s Ten Most Wanted Fugitives list, suspected in the killings of four other people in Minnesota, Illinois and New Jersey. The FBI painted Cunanan as a highly intelligent and dangerous man who desired a life of luxury. The California native, who could speak two languages, dropped out of college and funded his lifestyle thanks to relationships with older, wealthier gay men, federal investigations found. The FBI believes that in addition to working odd jobs, Cunanan was a prostitute.\n\nIn The Assassination of Gianni Versace, Cunanan is played by Glee star Darren Criss.\n\nDiners at the Edgewater Hotel on Miami Beach sit under a large wanted poster of Andrew Cunanan in July 1997 ROBERT SULLIVAN - AFP/Getty Images\n\nWhy did Andrew Cunanan kill Gianni Versace?\n\nTwenty years after the murder, Cunanan’s motive is still unclear. Cunanan and Versace did not know each other, according to People, although they may have briefly met prior to the killing. Federal investigators believed Cunanan may have been targeting gay men. Versace had a longtime boyfriend, Antonio D’Amico. The FBI believed Cunanan may have been seeking revenge on former lovers or clients who may have given him HIV, records show.\n\nDesigner Gianni Versace appearing at a fashion show. Time Life Pictures—The LIFE Picture Collection/Getty Images\n\nWho else did Andrew Cunanan kill?\n\nCunanan’s killing spree began in late April 1997 when he used a hammer to fatally beat Jeffrey Trail, a 28-year-old former naval officer he knew, in Minneapolis, “for reasons that remain unclear,” the FBI said. Days later, Cunanan shot and killed his former lover David Madson, 33, and dumped his body near a lake in Minnesota. Then in May, Cunanan repeatedly stabbed Lee Miglin, a 72-year-old Chicago real estate developer and wealthy businessman, according to authorities. He killed William Reese, a 45-year-old cemetery worker in New Jersey, less than a week later. Authorities believe Cunanan targeted Reese so that he could steal his truck.\n\nHow did the hunt for Andrew Cunanan end?\n\nThe investigation into Versace’s murder ended July 23, 1997 — eight days after the designer’s death — when Cunanan apparently shot himself to death on a boat house, about two miles away from Versace’s house in Miami Beach. The suicide ended the high-profile manhunt that followed the global news coverage of Versace’s murder.\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nContact us at editors@time.com.", "images": ["https://api.time.com/wp-content/uploads/2018/01/gianni-versace.jpg", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2018/01/andrew-cunanan.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://api.time.com/wp-content/uploads/2018/01/andrew-cunanan-wanted-poster-e1515697655355.jpg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2018/01/andrew-cunahan-darren-criss.jpg?quality=85&w=1200&h=628&crop=1"], "top_img": "https://api.time.com/wp-content/uploads/2018/01/andrew-cunahan-darren-criss.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": [], "canonical_link": "https://time.com/5092574/gianni-versace-andrew-cunanan/", "title": "Why Andrew Cunanan Killed Guianni Versace", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Gianni Versace, Gianni Versace killer, who killed Gianni Versace, Andrew Cunanan, Andrew Cunanan Versace, Assassination of Gianni Versace, Assassination of Gianni Versace American Crime Story, who was Andrew Cunanan, why did Andrew Cunanan kill versace", "news_keywords": "Gianni Versace, Gianni Versace killer, who killed Gianni Versace, Andrew Cunanan, Andrew Cunanan Versace, Assassination of Gianni Versace, Assassination of Gianni Versace American Crime Story, who was Andrew Cunanan, why did Andrew Cunanan kill versace", "description": "Serial killer Andrew Cunanan's murder of Gianni Versace is the focus of FX's The Assassination of Gianni Versace: American Crime Story.", "og": {"title": "Why Andrew Cunanan Killed Gianni Versace", "type": "article", "site_name": "Time", "url": "https://time.com/5092574/gianni-versace-andrew-cunanan/", "description": "The real story behind 'The Assassination of Gianni Versace'", "image": {"identifier": "https://api.time.com/wp-content/uploads/2018/01/andrew-cunahan-darren-criss.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5092574/gianni-versace-andrew-cunanan/", "description": "Serial killer Andrew Cunanan's murder of Gianni Versace is the focus of FX's The Assassination of Gianni Versace: American Crime Story.", "media": "https://api.time.com/wp-content/uploads/2018/01/andrew-cunahan-darren-criss.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5092574/gianni-versace-andrew-cunanan/", "title": "Why Andrew Cunanan Killed Gianni Versace", "description": "The real story behind 'The Assassination of Gianni Versace'", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2018/01/andrew-cunahan-darren-criss.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}