{"url": "https://www.dailymail.co.uk/news/article-4665390/Taylor-Swift-skips-annual-Fourth-July-party-RI.html", "text": "Advertisement\n\nWhat a difference a year makes.\n\nIt was 52 weeks ago that the tiny and tranquil village of Watch Hill, Rhode Island was descended upon by some of the biggest names in the entertainment world as Taylor Swift hosted her third annual Fourth of July bash.\n\nHollywood stars Blake Lively and Ryan Reynolds, supermodels Karlie Kloss and Gigi Hadid, Emmy-winning actress Uzo Adubo, model-turned-actress Cara Delevingne and the singing sisters of Haim were just a few of the celebrity pals that showed up for the festivities, which lasted five days.\n\nThis year however, Watch Hill is a celebrity ghost town.\n\nAnd while there was no sign of Swift, there did appear to be a number of music industry heavy hitters staying at the property, with individuals resembling Apple exec Jimmy Iovine and WME exec Marc Geiger seen in Watch Hill over the weekend.\n\nSwift's father Scott, who was seen with the men, is a part owner of her label Big Machine Records.\n\nCeleb haven: Taylor Swift did not host her annual Fourth of July celebration in Watch Hill, Rhode Island at her $17.75 million estate (above)\n\nCozy cottage on the beach: The home was still under extremely tight security however throughout the weekend, and the pop star's parents Andrea and Scott were seen in town\n\nSlip and slide: Swift's now iconic red-white-and-blue inflatable water slide was also out over the weekend, having been a staple at her summer parties since 2015 (right)\n\nStyle: Andrea was seen shopping at a boutique on Bay Street, a short walk down the hill from her daughter's home, on Monday morning (above)\n\nShake it off: Scott went out on a charter fishing trip with some friends on Tuesday (above) before celebrating the holiday at his daughter's home\n\nBefore the colonies split: Swift, 27, hosted British boy toy Tom Hiddleston at her beachfront home last year (above)\n\nSwift learned all about the makings if a classic Fourth of July party when she spent time with the Kennedys back in 2012 and briefly dated Conor (left); Three years later she welcomed a Scotsman to her celebration of America's independence from the British crown (right)\n\nLast year, the up and coming stars in the fields of music, film and fashion were also joined by a heartthrob hailing from across the pond as per tradition, with Swift welcoming then boy-toy Tom Hiddleston to spent some time with her sacred squad for the holiday weekend.\n\nAnd while their relationship may be no more, the images of Hiddleston, 36, and his decade-younger lover cavorting in the surf while he wears a skin-tight tank reading 'I heart T.S.' will live on forever.\n\nCalvin Harris had been the chosen beau back in 2015, and back in 2014 Andrew Garfield played the role of English rose when he accompanied his then-girlfriend Emma Stone.\n\nNo famous faces or British-born beaus made the journey East to the smallest state in the union for the biggest party of the year this Fourth of July though, as even Swift, skipped the annual trip to the Ocean State.\n\nShe did not forego all tradition however, as she likely spent Fourth of July with her latest boyfriend, Joe Alwyn.\n\nThe 26-year-old star of 'Billy Flynn's Long Halftime Walk' was born and raised in the suburbs of London.\n\nOne out of every three relationships in this photo are over: Swift and Hiddleston, Blake Lively and Ryan Reynolds and Britany and Benjamin LaManna during the 2016 festivities in Watch Hill\n\nStars, stripes, an Australian and a Brit: Harley Gusman, Ruby Rose, Halston Sage, Swift, Uzo Adubo, Lively, Cara Delevingne, Gigi Hadid (back row l to r): Rachel Plateen and Alana Haim (front row l to r)\n\nBathing beauties: Alana Haim, Rachel Plateen, Martha Hunt, Halston Sage, Cara Delevingne, Swift Britany Maack, Abigail Anderson, Rose, Harley Gusman, Lively, Gigi Hadid, and Karlie Kloss in 2016\n\n2016 Swimsuit models: Hadid, Delevingne and Swift in match suits; Kloss and Swift go for broke on the famed water slide\n\nLoki lets loose: Hiddleston with Swift, Haidid and Delevingne back in 2016 at the singer's Watch Hill home\n\nTwo happy couples: Swift's newly engaged pal Abigail Anderson and her beau Matt Lucier a few days after their big news back in 2016, with Ed Sheeran PDA'ing in the background\n\nThe decision to avoid the hoards of paparazzi and fans eagerly awaiting a glimpse of the 27-year-old did not come as a huge surprise given Swift's steadfast dedication to keeping a low profile this year.\n\nAs a result, this year's festivities were attended by the most exclusive group yet, as only Swift's parents Andrea and Scott managed to snag an invite to hang at the $17.75 million oceanfront estate.\n\nThey were joined by just a few friends and family members for the weekend, and quickly made it clear that they would be celebrating the birth of America in a far more low-key manner than years past.\n\nScott, a financial adviser, chatted with a friend on Sunday afternoon, with the two men photographed sitting among a sea of empty Adirondack chairs and chaise lounges on the property's immaculate lawn.\n\nThat same day, he and wife Andrea, who was a mutual fund executive herself, also took some time to gaze out at the Atlantic in their beach wear.\n\nA chorus line: Swift, Uzo Aduba and Danielle Haim perform while at Swift's home back in 2016\n\nWho's Kevin?: Joe and Nick Jonas take in the fireworks back in 2015 at Swift's second annual Fourth of July celebration\n\nYounger brothers trends: Swift and her baby bro Austin display Ina Garten's famed red, white and blue cake (above)\n\nAnother Brit: Swift and Sheeran hang out back in 2015, with the British singer opting for a heavy band jacket\n\nParticipation is required: Hadid, Serayah, Swift, Hunt, Amanda Griffith, Este, Alana and Danielle Haim jump for perfectly-photographed joy back in 2015\n\nIndie production: An uncertain Emma Stone perches on the far right of the frame looking at Swift's inaugural squad of: Amanda Griffith, King, Swift and Ingrid Michelsen (back row l to r): Lena Dunham, Jessica Szohr, Jessica Stam, Odeya Rush and friend (front row l to r)\n\nMeanwhile, on the other side of the home, the giant red-white-and-blue inflatable slide that last year played host to Loki, Deadpool and Enchantress sat ignored and unused by the still waters of Swift's pool.\n\nAnother young man spotted on the property looked liked son Austin, but it was hard to confirm if it was in fact Taylor's little brother as he was dressed in a dark polo shirt and sunglasses like the security guards who keep watch over the home.\n\nAndrea also took some time over the holiday weekend to enjoy the local shopping on Watch Hill's main strip, which is located just down the hill from her daughter's home.\n\nThe 59-year-old was seen emerging from one of the boutiques on Bay Street on Monday, blending in with the ritzy crowd in her over-sized designer shades and stylish black top.\n\nIt was back in 2012 that Swift was first introduced to the charms of the New England coast by another former paramour, Conor Kennedy.\n\nRest and relaxation: Two men lounge on Swift's Adirondack chairs on Monday ahead of the big holiday (above)\n\nGrabbing dinner: Scott brought along a cooler for the fishing trip on Tuesday afternoon in Watch Hill (above)\n\nFishing threads: Scott wore a pair of loose-fitting jeans along with a striped polo shirt for the fishing excursion on Tuesday (above)\n\nDepleted squad: A security guard talks with a guest who looks similar to Apple executive Jimmy Iovine on the property Monday\n\nLooking out: Swift's father and an unidentified women look out to the ocean on Monday afternoon\n\nPlayers: There did appear to be a number of music industry heavy hitters staying at the property, with Swift's father Scott (center in red hat) a part owner of her record label Big Machine Records ( a man who looks similar to WME execuitve Marc Geiger on right in blue hat)\n\nThe lovebirds actually met over Fourth of July weekend when Conor's aunt Rory, a documentary filmmaker, invited Swift to the family compound.\n\nThe two were frequently photographed together the rest of the summer as they spent time on the Cape and near Conor's home in Mount Kisco, New York.\n\nSwift even bought a house near the Kennedy family compound weeks after meeting Conor, plunking down a reported $4.8million for an oceanfront residence boasting seven bedrooms and stunning views.\n\nThey couple split however, and while Swift lost the boy and the house - managing to make a tidy $1million profit despite her quick offloading of the property - she did keep the Kennedy's Fourth of July tradition.\n\nPalatial escape: Swidt purchased the home in Westerly, Rhode Island back in 2013, a year after dating Conor Kennedy\n\nStones: The home has beach access and a poll in the exclusive and old-moneyed Rhode Island hamlet, located on the state's southernmost point\n\nPlenty of space: The home boasts includes eight bedrooms and eight fireplaces for those chilly new England winters\n\nTake the money and run: Swift put down the total sale amount on the home in cash when she made the purchase\n\nViews for days: The property is just a shirt walk from Bay Street, the main strip in the quiet and idyllic village of Watch Hill\n\nPerfect place: The inflatable water slide emerges from the pool house each summer, just in time for the Fourth of July\n\nHer inaugural event set the tone for that special Swift mix of guests, which always includes a standout television star, catwalk beauty approaching supermodel status, a model-turned-actress, assorted singers, a handful of heartthrobs, Hollywood headliners and her lifelong gal pals.\n\nIn 2014 there was 'Girls' creator Lena Dunham, Canadian stunner Jessica Stam, former supermodel and then-WB star Jaime King, indie-label chanteuse Ingrid Michelson and the aforementioned Stone and Garfield, who did their best to avoid the group photos.\n\nGarfield's aim to keep a low profile was aided by the beard he was growing at the time for his role in last year's 'Silence.'\n\nJessica Szohr, Odeya Rush, King's hubby Kyle Newman, Amanda Griffith and some of Swift's lifelong pals rounded out the group, who were forced to use a regular slip-and-slide for their holiday festivities.\n\nPlans: Gigi Hadid spent this year enjoying some time to herself, and posted a photo of Zayn Malik playing with her dog on Sunday (above)\n\nFashion first: Hadid was out and about in NYC last Thursday (left) while Kloss has been bust at Paris Haute Couture week (right at Dior event on Monday)\n\nSquad 2.0: Delevingne returned to her fashion roots as well on Monday at the Chanel show with Katy Perry, Karl Lagerfeld, and Claudia Schiffer\n\nReunited: On Tuesday night, Delevingne (left) and Kloss (right) reunited at a Vogue party in Paris\n\nAction-packed summer: Reynolds could not make the trek out East as he is busy filming the sequel to Deadpool (above)\n\nLearning and keeping safe: Lively meanwhile is raising her son and daughter and squeezing in some CPR classes (above)\n\nSwift stuck to a similar formula the following year, with an even more celeb-packed invite list.\n\nThere was Scottish DJ Harris and Joe Jonas, who attended alongside baby brother Nick and then-girlfriend Gigi Hadid.\n\nEste, Danielle and Alana made their first appearance that year too, with Haim and Ed Sheeran representing that singers in attendance during the 2015 fete.\n\nActress, singer and 'Empire' breakout Serayah, Swift's best bud Brit LaManna, and Victoria's Secret beauty Martha Hunt also scored a golden ticket that year.\n\nMost importantly, 2015 marked the first appearance of what may be the most iconic and recognizable inflatable water slide on the East Coast of America.\n\nThe number of attendees doubled in 2016, with a strong emphasis on couples, as in addition to Swift and Hiddleston and Reynolds and Lively, three of the models in attendance also took someone special for the weekend.\n\nDelevingne attended with Annie Clark (a.k.a St. Vincent), Hunt brought photographer Jason McDonald and Kloss was accompanied by Joshua Kushner.\n\nThat second pairing was confirmed by paparazzi shots taken on the property, with the venture capitalist never appearing in any of the social media posts that were shared by members of the group.\n\nActresses Halston Sage and Ruby Rose, Sheeran, the sisters Haim were also all at Swift's shindig last year.\n\nAnd, to top it all off, there was even an engagement party for Swift's closet friend, Abigail Anderson.\n\nEven better: A new law in Rhode Island now prohibits people from stepping foot on the beach in front of Swift's home\n\nEnjoy the view: Swift has made a point of spending summer weekends in Watch hill in the past, but not this year\n\nEmpty space: Swift has yet to visit her Watch Hill property once this year, and was last seen there in November for Thanksgiving\n\nDining option: Swift's home is located next door to the swank Ocean House, which is a Relaux & Chataux property\n\nEmpty driveway: Only a handful of cars filled the driveway on Monday, one day before the holiday\n\nTowels all aligned: The poolside chairs were still perfectly maintained, perhaps for Swift's industry guests\n\nSunshine: Windows surround all of Swift's home, keeping the massive home well lit during the summer months\n\nThat may be why there was no choice but to take a break this year, with nowhere to go but down after the 2016 party.\n\nNot helping matters is the bust schedule many of the ladies have, with Haim set to release their second studio album next week, Kloss and Delevingne busy in Paris at the haute couture shows, and Reynolds filming the 'Deadpool' sequel.\n\nHadid and Lively meanwhile are just enjoying some time out of the limelight it seems, with Lively raising her two children and sneaking in a CPR class while the daughter of Yolanda Foster spends some quality time with her pup and her man Zayn Malik.\n\nSwift meanwhile is busy at work on her follow-up to '1989,' her most successful album to date both critically and in terms of sales.\n\nIn a little less than three years, '1989' has sold an impressive 9.5 million copies worldwide and earned Swift 10 Grammy nominations, with the singer winning three including Album of the Year back in 2016, making her the first female to win that honor twice.\n\nShe was topped back in February when Adele became the first singer to win Song, Record and Album of the year twice.", "images": ["https://i.dailymail.co.uk/i/furniture/misc/logo_cookie_reg.png", "https://i.dailymail.co.uk/1s/2020/04/17/20/27331384-0-image-a-22_1587150056520.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/4206E39700000578-4665390-image-a-293_1499202710138.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/4206E39B00000578-4665390-image-a-286_1499202709893.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/4206E36E00000578-4665390-image-a-287_1499202709901.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/4208A52100000578-4665390-image-a-276_1499202709571.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/4206E35F00000578-4665390-Before_the_colonies_split_Swift_27_hosted_British_boy_toy_Tom_Hi-a-330_1499202711550.jpg", "https://i.dailymail.co.uk/1s/2020/04/18/19/27359308-0-image-m-8_1587234508438.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/05/13/42038C7A00000578-4665390-image-a-4_1499256839714.jpg", "https://i.dailymail.co.uk/1s/2020/04/19/08/27374116-0-image-a-7_1587283128224.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/05/13/4201A5A300000578-4665390-image-a-21_1499256840490.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/4206E38F00000578-4665390-image-a-318_1499202711067.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/05/05/420A2E7100000578-0-image-a-34_1499227463324.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/42038E5600000578-4665390-image-a-279_1499202709572.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/05/13/4206E3C300000578-4665390-Action_packed_summer_Reynolds_could_not_make_the_trek_out_East_a-a-1_1499256839518.jpg", "https://i.dailymail.co.uk/i/sitelogos/logo_mol.gif", "https://i.dailymail.co.uk/i/pix/2017/07/05/13/4201A48300000578-4665390-image-a-11_1499256840013.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/4206E3BF00000578-4665390-Style_Andrea_was_seen_shopping_at_a_boutique_on_Bay_Street_a_sho-a-283_1499202709795.jpg", "https://i.dailymail.co.uk/1s/2020/04/19/05/27370602-0-image-a-12_1587271097646.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/42038CC400000578-4665390-image-a-280_1499202709572.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/15/27321548-0-image-a-37_1587134123891.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/4206E3A300000578-4665390-image-a-272_1499202709570.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/42038D6600000578-4665390-Cozy_cottage_on_the_beach_The_home_was_still_under_extremely_tig-a-268_1499202709568.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/42038CF900000578-4665390-image-a-281_1499202709573.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/42038CCF00000578-4665390-image-a-295_1499202710236.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.dailymail.co.uk/i/pix/2017/07/04/18/4202F39C00000578-0-image-m-40_1499189794808.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/4206E3A700000578-4665390-image-a-285_1499202709855.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/05/13/420881E800000578-4665390-Cara_Delevingne-a-2_1499256839561.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/4205573400000578-4665390-image-a-319_1499202711179.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://i.dailymail.co.uk/i/pix/2017/07/05/13/4206E36300000578-4665390-Learning_and_keeping_safe_Lively_meanwhile_is_raising_her_son_an-a-3_1499256839571.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/42025EFA00000578-4665390-image-a-277_1499202709572.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/4206E38B00000578-4665390-image-a-323_1499202711302.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/4206E35B00000578-4665390-image-a-328_1499202711475.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/42025F4700000578-4665390-image-a-289_1499202710035.jpg", "https://i.dailymail.co.uk/i/furniture/facebook/DailyMail/DailyMail.png", "https://i.dailymail.co.uk/1s/2020/04/18/14/27352766-0-image-a-6_1587217905034.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/4206E3BB00000578-4665390-image-a-292_1499202710122.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/42038D2100000578-4665390-image-a-294_1499202710176.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/4206E3C700000578-4665390-image-a-327_1499202711446.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/4206E37B00000578-4665390-image-a-320_1499202711200.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/05/13/4201A52E00000578-4665390-image-a-12_1499256840015.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/05/13/4201A46E00000578-4665390-image-a-10_1499256839951.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/4206E3B300000578-4665390-image-a-274_1499202709571.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/42089D7500000578-4665390-image-a-288_1499202710005.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/05/13/42038CDB00000578-4665390-image-a-7_1499256839930.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/05/13/4201A51D00000578-4665390-Empty_driveway_Only_a_handful_of_cars_filled_the_driveway_on_Mon-a-17_1499256840343.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/05/13/4201A44600000578-4665390-Empty_space_Swift_has_yet_to_visit_her_Watch_Hill_property_once_-a-15_1499256840252.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/05/13/4201A37600000578-4665390-Enjoy_the_view_Swift_has_made_a_point_of_spending_summer_weekend-a-16_1499256840329.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/17/4206FB6B00000578-0-image-m-35_1499186282500.jpg", "https://i.dailymail.co.uk/1s/2020/04/18/18/27358006-0-image-m-1_1587232038519.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/05/13/42038C9400000578-4665390-image-a-6_1499256839743.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/05/13/4201A53E00000578-4665390-image-a-24_1499256840710.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/05/13/4201A54E00000578-4665390-image-a-22_1499256840701.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/05/13/4201A57A00000578-4665390-image-a-25_1499256840714.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/4206E3B700000578-4665390-image-m-331_1499204159774.jpg", "https://i.dailymail.co.uk/1s/2020/04/19/09/27374260-0-image-m-6_1587283353969.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/42038D8200000578-4665390-image-a-278_1499202709572.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/05/13/42038C0F00000578-4665390-image-a-9_1499256839949.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/4208A2DB00000578-4665390-image-a-291_1499202710118.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/05/13/42038C8200000578-4665390-image-a-8_1499256839931.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/42089E4600000578-4665390-Shake_it_off_Scott_went_out_on_a_charter_fishing_trip_with_some_-a-282_1499202709794.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/4206E35700000578-4665390-Taylor_and_Calvin_Harris-a-329_1499202711527.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/4206E3AF00000578-4665390-image-a-273_1499202709570.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/05/13/4201A41E00000578-4665390-image-a-19_1499256840358.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/05/13/4201A54F00000578-4665390-Towels_all_aligned_The_poolside_chairs_were_still_perfectly_main-a-18_1499256840352.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/05/13/4202DFD300000578-4665390-Sunshine_Windows_surround_all_of_Swift_s_home_keeping_the_massiv-a-20_1499256840372.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/05/13/4201A37200000578-4665390-Even_better_A_new_law_in_Rhode_Island_now_prohibits_people_from_-a-13_1499256840150.jpg", "https://i.dailymail.co.uk/1s/2020/04/19/05/27370626-0-image-a-9_1587269645516.jpg", "https://i.dailymail.co.uk/1s/2020/04/19/05/27370602-0-image-a-6_1587269338476.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/05/13/4201A55600000578-4665390-image-a-23_1499256840710.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/05/13/4208967700000578-4665390-Karlie_Kloss-a-5_1499256839730.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/05/13/4201A4B400000578-4665390-Dining_option_Swift_s_home_is_located_next_door_to_the_swank_Oce-a-14_1499256840172.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/4206E37300000578-4665390-image-a-271_1499202709569.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/20/42076ACE00000578-0-image-m-125_1499197060936.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/42038C8700000578-4665390-Celeb_haven_Taylor_Swift_did_not_host_her_annual_Fourth_of_July_-a-284_1499202709815.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/42038C1800000578-4665390-Slip_and_slide_Swift_s_now_iconic_red_white_and_blue_inflatable_-a-269_1499202709569.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/20/27332258-0-image-a-25_1587151978215.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/4206E38000000578-4665390-image-a-321_1499202711214.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/42025EFE00000578-4665390-image-a-290_1499202710070.jpg", "https://i.dailymail.co.uk/1s/2020/04/19/09/27375614-0-image-a-10_1587286777554.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/04/22/4206E3AB00000578-4665390-image-a-270_1499202709569.jpg"], "top_img": "https://i.dailymail.co.uk/i/pix/2017/07/05/05/420A2E7100000578-0-image-a-34_1499227463324.jpg", "keywords": [], "authors": ["Chris Spargo", "Chris Spargo For Dailymail.Com"], "canonical_link": "https://www.dailymail.co.uk/news/article-4665390/Taylor-Swift-skips-annual-Fourth-July-party-RI.html", "title": "Taylor Swift skips annual Fourth of July party in RI", "meta_data": {"keywords": "dailymail,news,Taylor Swift", "news_keywords": "dailymail,news,Taylor Swift", "original-source": "https://www.dailymail.co.uk/news/article-4665390/Taylor-Swift-skips-annual-Fourth-July-party-RI.html", "description": "It was 52 weeks ago that the village of Watch Hill, Rhode Island was descended upon by some of the biggest names in the entertainment world as Taylor Swift hosted her Fourth of July bash.", "channel": "News", "doc-class": "Living Document", "verify-v1": "DXwlrsxbqxSv+FTFkWUfgflBvFJfx2YbNf/HmABrVyY=", "msvalidate.01": "12E6B4B813EB44C9BFC8F6A21F1D01F5", "y_key": "1a7e912afbfcab2f", "MSSmartTagsPreventParsing": "true", "twitter": {"account_id": 15438913, "card": "summary_large_image", "title": "Taylor Swift skips annual Fourth of July party in Rhode Island", "description": "It was 52 weeks ago that the village of Watch Hill, Rhode Island was descended upon by some of the biggest names in the entertainment world as Taylor Swift hosted her Fourth of July bash.", "url": "https://www.dailymail.co.uk/news/article-4665390/Taylor-Swift-skips-annual-Fourth-July-party-RI.html", "image": "https://i.dailymail.co.uk/i/pix/2017/07/05/05/420A2E7100000578-0-image-a-34_1499227463324.jpg", "app": {"id": {"iphone": 384101264, "ipad": 400442503}}}, "articleid": 4665390, "author": "Chris Spargo", "divclasspage": "articlePage", "mol": {"headline": "Blank space: Taylor Swift skips annual Fourth of July party as her parents take over Rhode Island beach house a year after pop star hosted Blake, Cara, Gigi, Karlie and Brit boy toy Tom Hiddleston"}, "article": {"publisher": "https://www.facebook.com/DailyMail", "published_time": "2017-07-04T22:01:51+0100", "modified_time": "2017-07-05T23:47:56+0100", "section": "News", "tag": "Taylor Swift skips annual Fourth July party RI", "author": "https://www.facebook.com/DailyMail"}, "mobile-web-app-capable": "yes", "fb": {"app_id": 146202712090395, "pages": "1622758588037001,164305410295882"}, "og": {"site_name": "Mail Online", "title": "Taylor Swift skips annual Fourth of July party in Rhode Island", "type": "article", "description": "It was 52 weeks ago that the village of Watch Hill, Rhode Island was descended upon by some of the biggest names in the entertainment world as Taylor Swift hosted her Fourth of July bash.", "url": "http://www.dailymail.co.uk/~/article-4665390/index.html", "image": {"identifier": "https://i.dailymail.co.uk/i/pix/2017/07/05/05/420A2E7100000578-0-image-a-34_1499227463324.jpg", "width": 636, "height": 382}, "video": {"identifier": "https://videos.dailymail.co.uk/video/mol/2016/06/17/1297288364472185052/1024x576_1297288364472185052.mp4", "type": "video/mp4", "width": 636, "height": 358}}, "al": {"android": {"url": "dailymail-fb://article/4665390/", "package": "com.dailymail.online", "app_name": "Daily Mail Online"}, "ios": {"url": "dailymail-fb://article/4665390/", "app_store_id": 384101264, "app_name": "MailOnline"}}}, "movies": [], "publish_date": 1499202111.0, "source": "https://www.dailymail.co.uk", "summary": ""}