{"url": "www.inquisitr.com/3859342/kendall-jenner-not-the-boss-from-hell-who-mistreats-her-employees-debunked/", "text": "While known as the reserved one in the clan, Kendall Jenner has allegedly morphed into a terrifying employer. The latest report from OK! via Gossip Cop alleges that the Victoria’s Secret model is a “boss from hell” who makes life tough for the people who work for her.\n\n“Everyone thinks she’s the sweetest, shyest Kardashian sister, but over the last year she’s made so much money and won so much praise that it’s gone to her head.”\n\nThe magazine’s so-called insider recalled an instance when Kendall’s assistant served her the wrong kind of iced tea and instead of being grateful, Kendall reportedly “made her pay for a new one out of pocket.” The insider also purported that the runway model would fire employees who would attempt to talk about her behind her back. What she allegedly does is to tell her mother, Kris Jenner, that the employee is incompetent.\n\nKendall Jenner prepares backstage prior to the Victoria's Secret Fashion Show on November 30, 2016 in Paris, France. [Image by Pascal Le Segretain/Getty Images]\n\nHowever, Gossip Cop shed some light on the issue and confirmed through a source close to Kendall that the magazine’s claims are unfounded. As someone who has firsthand experiences of bullying, it isn’t fair if Kendall would do the same to her team.\n\nJust last month, Victoria’s Secret Angel Adriana Lima defended Kendall from bullies and acknowledged her pleasant attitude. She told E! Online that Kendall works just as hard as other models in the industry.\n\n“I have worked with Kendall on runways before when we were in Europe, like Versace and also with Victoria’s Secret. Kendall is very sweet and very nice, and it’s always pleasant to work with someone like that. You know, she works as hard as we do, so I give her credit for all the effort. And I think she is going to do great because Victoria’s Secret is all about personality, and she has her own personality.”\n\nIn a previous interview with Garage magazine via E! Online, Kendall also revealed that she’s been following the Golden Rule since she was young.\n\n“I aim to treat others as I want to be treated. I know that sounds slightly basic, but when it comes to humans and human nature, the simplest answer is usually the right one. It really is as easy as that.”\n\nShe understands that everyone is entitled to have an opinion, but she chooses not to focus her energy on dealing with the ruthless things said about her.\n\nWhen she was still starting, some models allegedly bullied Kendall as they believed that it was only because of her famous last name that she managed to get a spot in the competitive industry. Some were reportedly complaining that she only bought her career, and she was undeserving of the special treatment from major designers.\n\nKendall Jenner walks in the 2015 Victoria's Secret Fashion Show on November 10, 2015 [Image by Jamie McCarthy/Getty Images]\n\nThe Keeping Up with the Kardashians star then opted to drop her last name and simply go by “Kendall” when working. As much as possible, she also does want her family members to watch her shows.\n\nLast year, Kendall admitted through the reality show that she’s having a difficult time working because of her sleep paralysis. Since the paralysis often happens when she’s on the plane, she’s starting to develop a fear of traveling; something which Kris finds alarming.\n\n“The nature of what you do for a living and your career is flying around the world. You have designers that have already booked you and are counting on you to show up,” she told her daughter. Kendall responded that perhaps her health is more significant than those jobs.\n\nApart from meeting with a therapist, Kim Kardashian also arranged a meditation for her younger sister upon learning about Kendall’s dilemma.\n\n[Featured Image by Pascal Le Segretain/Getty Images for Vogue]", "images": ["http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "https://cdn.inquisitr.com/wp-content/uploads/2016/12/kendall-jenner-dating-1.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "https://cdn.inquisitr.com/wp-content/uploads/2017/01/kendall-1.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://secure.gravatar.com/avatar/4d7f0328d739a74db78ea761cebdd9fc?s=250&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "https://cdn.inquisitr.com/wp-content/uploads/2017/01/Kendall-Jenner.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Eunice Alcala"], "canonical_link": "https://www.inquisitr.com/3859342/kendall-jenner-not-the-boss-from-hell-who-mistreats-her-employees-debunked/", "title": "Kendall Jenner Not The ‘Boss From Hell’ Who Mistreats Her Employees [Debunked]", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}