{"url": "https://web.archive.org/web/20170314174618/http://wbn12.com/rosenberg-tx/new-star-wars-movie-filming-near-rosenberg-texas-large-number-of-extras-needed/", "text": "ROSENBERG, Texas – Reports out of Hollywood this morning are confirming that a portion of the next Star Wars movie will be filmed near Rosenberg, Texas. The undisclosed location near Rosenberg will represent a previously unknown planet in the Star Wars universe.\n\nNo details were released as to exactly when production would take place in the Rosenberg area but they stated that it should begin no later than this fall. A casting call for extras will be announced well before that time period, however. Local fans of the film series were understandably excited about the news and especially excited about the prospect of becoming an extra in the film after producers made this short statement released to the press earlier today:\n\n“We think that Rosenberg is a great place to find the hundreds of extras for our alien population and we’re very excited about filming here.”\n\nLet us know what you think about this exciting news in the comments section below.\n\nphoto by Gage Skidmore / CC BY-SA 3.0 / cropped & photo by Gage Skidmore / CC BY-SA 3.0 / cropped", "images": ["https://web.archive.org/web/20170314174618im_/http://wbn12.com/wp-content/uploads/2017/03/star-wars-1.jpg"], "top_img": "https://web.archive.org/web/20170314174618im_/http://wbn12.com/wp-content/uploads/2017/03/star-wars-1.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20170314174618/http://wbn12.com/rosenberg-tx/new-star-wars-movie-filming-near-rosenberg-texas-large-number-of-extras-needed/", "title": "New Star Wars Movie Filming Near Rosenberg, Texas, Large Number of Extras Needed – WBN 12 News", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "generator": "WordPress 4.7.3"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}