{"url": "https://web.archive.org/web/20090820185138/http://www.foxnews.com:80/story/0,2933,539893,00.html", "text": "The following is a rush transcript of the August 16, 2009, edition of \"FOX News Sunday With Chris Wallace.\" This copy may not be in its final form and may be updated.\n\nCHRIS WALLACE, HOST: The debate over health care reform continues to dominate the national conversation. Much of the argument is about philosophy: What should government's role be? But amid all the heated rhetoric, there's also the question: What's true and what's not?\n\nWell, today we bring together four experts for a fact check to try to sort out what's really in the various Democratic plans and what isn't.\n\nDemocratic Senator Kent Conrad, who's part of the Gang of Six trying to negotiate a bipartisan compromise. He's in his home state of North Dakota.\n\nRepublican Senator Richard Shelby, a leading critic of the president's plan, comes to us from Boston.\n\nJ. James Rohack, president of the American Medical Association, which supports the Obama plan.\n\nAnd John Rother, executive vice president of the AARP, which has not endorsed any plan.\n\nGentlemen, let's start with a central question in this debate, and here is how President Obama framed it this week.\n\n(BEGIN VIDEO CLIP)\n\nPRESIDENT BARACK OBAMA: If you like your health care plan, you can keep your health care plan. This is not some government takeover. If you like your doctor, you can keep seeing your doctor. This is important.\n\n(END VIDEO CLIP)\n\nWALLACE: And that's our first fact check. Will the Democrats' plan lead to a government takeover of health care?\n\nSenator Shelby, health secretary Sebelius says today that perhaps the public option is not, quote, \"essential\" and that they might be willing to consider public nonprofit co-ops.\n\nIf they went that route, co-ops instead of the public option, would that persuade you that this was not a government takeover?\n\nSEN. RICHARD SHELBY: Well, that would be government involvement, but it would be a — I believe a step in the right direction, away from a government takeover of our health care in this country.\n\nI think that the Democratic administration, President Obama and his cabinet, have read the tea leaves that — of America right now. They see that the American people are basically satisfied with their health insurance. They like their programs. They know it could be improved, but they don't want a government-run program.\n\nWALLACE: Do you think, Senator Shelby, we need public co-ops at all?\n\nSHELBY: Well, I think that's something we should look at. We already have a lot of those, or something like them, nonprofit, basically, that seem to work. I don't know if it will do everything people want, but we ought to look at it. I think it's a far cry from the original proposals.\n\nWALLACE: Senator Conrad, you have been one of the Democrats who has been critical of the public option, and perhaps the leading Democrat in pushing the idea of a public co-op.\n\nExplain briefly why the co-op would not be a government takeover and perhaps the public option would.\n\nSEN. KENT CONRAD: You know, Chris, I was given the responsibility to try to come up with something that would bridge the differences between those who are very much for a public option and those who are very much opposed to it. And what I came up with was a cooperative plan.\n\nCo-ops are very prevalent in our society. They've been a very successful business model, of course. We have hundreds of them here in my home state of North Dakota. We have rural electric cooperatives in 47 states.\n\nLand O'Lakes is a cooperative. Ace Hardware is a cooperative. The Associated Press is a cooperative. We have successful cooperatives in health care. Group Health in Seattle has 600,000 people and it's the most highly rated plan in the state of Washington.\n\nSo this is a model that works. It's not government-run and government-controlled. It's membership-run and membership-controlled. But it does provide a nonprofit competitor for the for-profit insurance companies, and that's why it has appeal on both sides. It's the only plan that has bipartisan support in the United States Senate.\n\nWALLACE: All right. Let me bring in Dr. Rohack.\n\nThe AMA is supporting a public option, but can the president keep the promise that we just heard, under the public option, that if you like your health care plan, you like your doctor, you can keep it? I want to put up on the screen a study by the non-partisan Congressional Budget Office which found that by 2016, 9 million people will no longer have their employer-based plan under health care reform because businesses would decide in many cases that it's cheaper simply to pay the penalty and push people into a public plan.\n\nJ. JAMES ROHACK, PRESIDENT OF THE AMA: Well, we know that — regardless of what's going to happen, we don't know what a final public option is. What the AMA wants to be sure is whatever comes out that we have affordable coverage for every American and the freedom that doctors and the patients can decide what's best for them.\n\nWhether there's an interference right now with the private insurers, an interference right now with the government — we want to get rid of that so that the patient is the one that decides, with the physician, what's best care for them and get it paid for.\n\nWALLACE: Mr. Rother, instead of this massive overhaul, instead of a public option, or instead of even public co-ops, if you really want competition, why not remove the restriction which now says that if I live in Washington, D.C. I've got to buy a D.C. health plan, and instead create a national market for health care, so — or health insurance, so that if there's a cheaper plan in Pennsylvania, I could buy in Pennsylvania?\n\nJOHN ROTHER, EXECUTIVE VICE PRESIDENT OF THE AARP: Well, there are states and localities where health care is much less expensive than others, and if we allow people to buy all their insurance from those places, it will raise the rates there. And it's called risk selection.\n\nIt's a real problem, given the fact that health care costs can vary substantially from one place to another. So I think while the idea sounds appealing, the consequence would be it would make health care more expensive for those people who live in those low-cost areas.\n\nWALLACE: Senator Conrad, as a practical matter, especially given what Secretary Sebelius says, is the public option dead?\n\nCONRAD: Well, there are not the votes in the United States Senate for the public option. That's why I was asked to come up with an alternative. And I want to just make a tweak to what you've referred to as the cooperative plan.\n\nYou call it a public cooperative plan. It's not a public plan at all in the sense that government runs it. Government has nothing to do with it. Once it's established, it is run by the members. That's why it is appealing to some on the...\n\nWALLACE: But it would — it would put up some seed money, wouldn't it?\n\nCONRAD: ... Republican side.\n\nWALLACE: Senator, it would put up some of the seed money.\n\nCONRAD: Yes. Yes, because there is a requirement to have reserves for any new health insurer, so the idea is the government would front-end some of the money, and we have yet to discuss whether all of that or some of that gets paid back. But there would be that amount of involvement.\n\nBut then it would be membership-run, membership-controlled. The government wouldn't have any ongoing obligation or any control.\n\nWALLACE: And real quickly, Senator Conrad, because I want to move on to the next fact check, would the president be better off just taking the public option off the table right now?\n\nCONRAD: Look, the fact of the matter is there are not the votes in the United States Senate for the public option. There never have been. So to continue to chase that rabbit, I think, is just a wasted effort.\n\nWALLACE: All right. Let's move to the second issue, and here is how the president has discussed this.\n\n(BEGIN VIDEO CLIP)\n\nOBAMA: I said I won't sign a bill that adds to the deficit or the national debt, okay? So this will have to be paid for.\n\n(END VIDEO CLIP)\n\nWALLACE: And that's our second fact check. Will the plan add to the deficit? Will it cut health care costs?\n\nDr. Rohack, again, the CBO has been very clear about this. Let's put the facts up on the screen. It says that House Bill 3200 would increase the deficit by $239 billion over the next 10 years.\n\nAnd given the fact that tax increases start in 2011 but the coverage doesn't start till 2013, House Republican staff says health care reform — that the health care reform deficit will balloon to $760 billion by 2024. That doesn't seem to be paying for itself.\n\nROHACK: Well, we know that unnecessary costs are present in the American health care system, and defensive medicine is one example of large unnecessary costs.\n\nJust to ignore it doesn't mean that that goes away. And so at least the House recognized that by amending the original proposed bill, by looking at some medical liability reform.\n\nYou know, physicians — we're willing to reduce the variation in care. We're looking at medication reconciliation. We're looking at trying to make sure that when the patient goes home, they don't have to come back to the hospital.\n\nThe CBO doesn't score some of that. The CBO doesn't even score prevention. If a person stops smoking, the way the CBO looks at it, you've got a decrease in your tax revenue from cigarette tax. And while you've prevented health disease, they won't score it.\n\nWALLACE: Yeah, but — but, wait. Wait. There's a big argument, Doctor, about prevention, whether it actually saves money.\n\nThere was — the CBO says that they think that, in fact, a big prevention program might actually add to costs because of the fact there's a lot of the people that you're preventing from having a disease are never going to get the disease in the first place.\n\nAnd the journal \"Circulation\" found that if you were going to provide all kinds of vascular prevention and diabetes prevention, it would actually cost 10 — it might be good medicine, but it would — in terms of cost savings, cost 10 times as much as just letting the people get diabetes and deal with it.\n\nROHACK: Well, as a cardiologist, I take care of patients all the time. And if they take their statins and they take their aspirin, they're productive. They don't come into the hospital with heart disease.\n\nAnd as a result of that, they are not a burden on society. They're a productive member of society. So we believe that, again, the CBO looks at things in a different way than we as doctors. We're here to take care of patients. We want to make sure that the patients are incented to keep themselves healthy. And clearly, diabetes is a risk that can be prevented when patients take care of themselves.\n\nWALLACE: Okay. Let me bring in Senator Shelby here.\n\nDoes the Democrats' overall health care reform plan cut federal spending? Does it bend that famous curve of health care costs? And what about the point that Dr. Rohack mentioned? Would you actually save a lot more money if there was serious medical malpractice reform?\n\nSHELBY: Well, first of all, just about any government plan I've ever known dealing with health care — they always low-balled it as far as the numbers and they spiraled much higher.\n\nI believe the costs will be very expensive. It will go into the hundreds of billions, if not trillions, of dollars down the road.\n\nI think a lot of the proponents of this health care plan want to get the government involved one way or the other, want to ration this care one way or the other, and a lot of people don't want to do that.\n\nYou mentioned malpractice reform. I think that has to be part of any real reform. I do believe that letting small businesses access an individual — access something like an insurance exchange to bring down the rates — that would help.\n\nThere are a lot of things we could do. Chris, we have the best health care system in the world. We need to expand it, but we do not need to destroy it.\n\nWALLACE: Mr. Rother, one of the things that the Gang of Six that Senator Conrad is a member of is considering is $500 billion in Medicare savings, including charging wealthy seniors more for their Medicare prescription drug benefit. Can AARP support that?\n\nROTHER: Well, that's something that we've consistently opposed. But we've looked at all of the savings proposals in this legislation very carefully, and we're convinced that they actually do target efficiencies rather than beneficiaries.\n\nSo in our view, beneficiaries would not be harmed by these legislative changes. One example is many hospitals, when they discharge people, are not committed to follow-up care, and as a result people have to be re- hospitalized. If we did a better job on follow- up care, we could save money and improve health at the same time.\n\nWALLACE: All right. Talk of cost and savings brings us to our next issue. Let's watch.\n\n(BEGIN VIDEO CLIP)\n\nOBAMA: If a family care physician works with his or her patient to — I recognize there's an underlying fear here that people somehow won't get the care they need. You will have not only the care you need, but also the care that right now is being denied to you.\n\n(END VIDEO CLIP)\n\nWALLACE: And that's our third fact check. Will the plan lead to the rationing of care?\n\nMr. Rother, when we're talking about half a trillion dollars in Medicare savings, when the president talks about creating a Medicare panel, which may impose new restrictions, how can you guarantee to your AARP members that this won't end up as rationing of care?\n\nROTHER: I think the first thing to acknowledge is that many people, even on Medicare, can't afford the care available to them today, particularly, for instance, in prescription drugs, which once people hit the infamous doughnut hole, they have to pay full price.\n\nWALLACE: Well, that's going to be fixed, supposedly.\n\nROTHER: Well, I hope so, so that this plan would actually make medicines more affordable to seniors and help them stay out of the hospital. So we don't see rationing in this plan. What we see are efficiencies that actually could improve care, not deny care.\n\nWALLACE: But when you're cutting half a trillion dollars out, and you've got a government panel that's going to impose restrictions, how — and I mean, when you've got on the one hand medical treatment, and on the other hand government spending and concerns about spending, doesn't something have to give, and couldn't that be treatment?\n\nROTHER: I don't think so. And if we had savings that were many times this, perhaps that would be the case. But this is actually a small percentage of the total that will be spent for Medicare over the coming 10 years.\n\nAnd certainly, there's enough waste in the system that by smart savings we can save money and improve care at the same time, no question.\n\nWALLACE: Senator Shelby, what about that argument that this isn't going to result in rationing of treatment for seniors and for all of us?\n\nSHELBY: Well, I think rationing is underlying all of this. There's a lot of denial out there, but you look at the other plans — you look at the Canadian plan, the British plan and so forth, and you have long lines.\n\nPeople decide who's going to get treatment and when. That's rationing health care. If you don't get health care when you need it, you know, ultimately it's going to affect your life.\n\nWALLACE: Dr. Rohack, I want to turn to the — perhaps the most explosive charge about rationing, and that is that the Democrats, in these various plans, create death panels. They're going to pull the plug on seniors. Is there any truth to that?\n\nROHACK: That's absolutely wrong. It's a falsehood. You know, right now the law says that when a patient comes into the hospital, a clerk, a hospital clerk, has to give them the information on advance directives. Well, you know, we think that's crazy.\n\nWALLACE: Advanced directives...\n\nROHACK: Meaning living wills.\n\nWALLACE: ... living wills, do not resuscitate.\n\nROHACK: That's a decision that we as the AMA have been very forceful about. The decisions on what a patient needs should be between the patient and the physician. And it takes an act of Congress to get anything paid for.\n\nWe advocated for screening mammograms, and immunizations, and screening colonoscopies. This is another example where we have to go to Congress to say, \"This ought to be paid for.\" The decision should be between the patient and the physician when the patient's healthy, not when they show up at the hospital.\n\nWALLACE: And what about the argument, \"Well, maybe now it's just a voluntary consultation, but when you've got all these cost considerations from the government, eventually it is going to lead to rationing, and perhaps saying in the last year of life that's just not something we're going to pay for?\"\n\nROHACK: Well, there's a myth that rationing doesn't occur right now. In the United States, if a woman's pregnant and on the individual market tries to get health insurance, that's called a pre- existing condition and it's not paid for. That's why this bill's important.\n\nIt gets rid of some of the rationing that's occurring right now. And as far as end-of-life care, that's just so important to have a discussion with the patient and the family and the physician while the person's healthy.\n\nRight now we're backwards. We're doing this when they hit the hospital. That's too late. We want to make it up front, when the patient can decide what do they want to do at their end of life.\n\nWALLACE: Senator Shelby, for all of the criticism from your side of the aisle, the fact is that the 2003 Medicare bill, which was passed by a Republican Congress and signed by President George w. Bush, had an end-of-life consultation provision in there. Is there some hypocrisy from the GOP on this issue?\n\nSHELBY: Well, I'm sure that there are conflicting views on everything, but let's be honest. When you start rationing health care and you start counseling people too far in their advanced ages, I think you're going to create problems, and you've created a lot of fear in this country.\n\nWALLACE: Let me bring Senator Conrad in, because one of your colleagues in the Gang — the so-called Gang of Six — and this is going to become quite famous by the end of this broadcast — that's three Republicans, three Democrats on Senate Finance trying to come up with a bipartisan plan.\n\nOne of your colleagues, Republican senator Charles Grassley, says that you guys have already dropped the end-of-life consultation. That's no longer part of your discussion. Is that true?\n\nCONRAD: That's correct. And, Chris, if I could go back to one other point on the cost issue, I didn't have a chance on that. I called a special hearing of the Senate Budget Committee to ask the Congressional Budget Office director are these other plans paid for and do they bend the cost curve in the right way.\n\nAnd I think it's important to emphasize there really is no House plan. There's a House committee plan. There are several different committees in the House that have reported plans. The House itself has not.\n\nThe committee on which I serve has rejected the notion of any specific timetable. We think it's more important to get this right. And in terms of what we've submitted to the Congressional Budget Office, they have come back and said that our plan does bend the cost curve in the right way and is paid for.\n\nSo there is going to be an alternative out there for our colleagues that will be paid for, that will bend the cost curve in the right way, and it's the only plan that's been done on a bipartisan basis — three Democrats, three Republicans, who have been given the responsibility to come up with a proposal for our colleagues.\n\nWALLACE: Senator Conrad, I — we've got to move along, but I do want to ask you a couple of questions. You said that there's no deadline. I thought that the president and Senator Baucus had agreed on a September 15th deadline, or the negotiations in the Senate Finance Committee end.\n\nCONRAD: What we have agreed to is that we are going to be ready when we're ready. And we are working. We hope to be able to reach conclusion by the middle of September.\n\nBut we have agreed that if we still don't have all of the answers back from CBO that we will not be bound by any deadline, that the most important thing is to get this right.\n\nThis affects every American person. It affects one-sixth of the American economy. This is not something that should be held hostage to any specific deadline.\n\nWALLACE: And let me ask you, Senator Conrad, just to button up the issue of end-of-life consultations, you say that you've dropped that. Is that, as far as your committee's concerned, dead? And would the president aid the overall process to drop that, to just end the controversy?\n\nCONRAD: Look, what we have said — that there should be no mandatory requirement for end-of-the-life — end-of-life counseling. I just went through this with my sister-in-law, who just passed away two weeks ago of ovarian cancer.\n\nEnd-of-life counseling was very, very valuable to the family, very important. The people at hospice were — really treated her with loving care. But there should be no mandatory requirement. That should be...\n\nWALLACE: Well, I don't think it is mandatory.\n\nCONRAD: ... a decision for the family.\n\nWALLACE: I think it's voluntary in the House bill.\n\nCONRAD: It is. But there are some who are asserting that there would be — there could be — mandatory requirements. There are not now and there will not be.\n\nWALLACE: All right. Let me — let me take up one final controversy about health care reform, and this is one that the president has largely ducked so far. Here it is.\n\n(BEGIN VIDEO CLIP)\n\nOBAMA: I think that it's appropriate for us to figure out how to just deliver on the cost savings and not get distracted by the abortion debate at this stage.\n\n(END VIDEO CLIP)\n\nWALLACE: And this is our fourth fact check. Will the plan lead to taxpayer-funded abortions?\n\nSenator Shelby, Democratic plans say that no public money will pay for abortions, that if you're getting an abortion through either a public plan or a private plan, you have to pay for it through your own private premium. Is that — does that satisfy you?\n\nSHELBY: Well, I believe that the taxpayers shouldn't be called upon to pay for abortions, period.\n\nWALLACE: And as you read these Democratic plans, do you see the taxpayer as paying for abortions?\n\nSHELBY: I'm not sure, because as Senator Conrad said, we don't know what plan is anywhere, because some people talk about the House plan. They talk about the committee plan. We talk about some of the plans in the Senate. Nothing's crystallized yet.\n\nBut I can tell you we better be careful in what we legislate and how we legislate. The American people have already, I believe, began to speak on this issue, and I hope the Congress is going to listen. I hope the president is, too.\n\nWALLACE: Senator Conrad, let's try to clear this up, because if you've got a public plan, or if you've got a private plan but people are getting public subsidies to pay for that plan, can you really say there's a firewall?\n\nIf people end up getting an abortion through a public plan or through a private payment of their premium, part of their premium, to a private plan, doesn't that end up kind of blurring the lines on this question of taxpayer-funded abortions?\n\nCONRAD: Look, I can only speak to the plan that we're working on in the Finance Committee. And the six of us, three Democrats, three Republicans, who have been given the responsibility to come up with a proposal for our colleagues have committed that there'll be no government funding of abortion.\n\nWe have a Hyde amendment that is in effect now that prevents federal funding of abortion. That will be continued in any plan that we come out with. We are working right now with a task force to try to make certain that we can deliver on that promise, on that commitment.\n\nWALLACE: Let's try to sum up where we are at this point.\n\nDr. Rohack, could we achieve many of these same reforms much more cheaply and much more simply, make some reforms in health insurance, such as banning the practice of dropping people for pre-existing conditions, give the uninsured a government subsidy so that they can buy insurance, but don't overhaul the whole system the way the president and Democrats intend to?\n\nROHACK: Well, clearly, the AMA, because we represent physicians, have to deal with this every day, 24/7 — is that we want to make sure that everyone has affordable quality health insurance, that they have the security if they have their health insurance they won't lose it if they lose their job.\n\nAnd let's take a look at ways that we can reduce unnecessary cost. We think we can do this, and defensive medicine is one thing that we have to decide...\n\nWALLACE: But could you do it with less of a drastic overhaul that leads people to think, \"I'm going to lose my private health care, I'm going to be forced into a public health plan?\" Couldn't this be done by — in a sort of a rifle shot attacking specific problems?\n\nROHACK: There are some moving parts that if you just do one and you don't do the other, you're going to have unintended consequences.\n\nThat's why there has to be looking at all the parts that go into health care, so we don't have the problem where you've fixed just one thing and then the next thing becomes more of a problem down the road.\n\nSo that's why we have to sit down and say, \"Do we need to do this?\" And if the answer's yes, which we believe, and that's the reason why we're fighting for this, how do we do it so that everyone has — the doctor, the patient making the decisions, and we get government and private insurance out of the problem of interfering with what's best for the patient.\n\nWALLACE: Mr. Rother?\n\nROTHER: Well, I think we could all agree health care costs too much. There's too much waste. It's not — we're not doing as good a job with the dollars we have.\n\nTo fix that problem, we do have to address health delivery as well as insurance coverage. And the two actually go together. We have to keep the system more efficient and at the same time bring more people in. That's what this legislation's trying to do.\n\nWALLACE: Senator Conrad, we've obviously seen a real public furor at these town hall meetings over the last month. Is that going to make it harder for moderate Democrats to vote for health care reform? Could that move some votes away from the president's plan?\n\nCONRAD: You know, in truth, there's not a president's plan. You know, the president has said to Congress, \"You come up with the details.\" He's said, \"Look, we want to expand coverage. I want to contain costs. I want to improve quality.\" But he has not provided a specific plan.\n\nIn terms of the meetings, I can speak to mine. I've had 14 meetings so far. They have been tremendous turnouts, people actively engaged, lots of questions. People want to know more. They are concerned because they know this affects every American person and affects one-sixth of the economy. They should be — they should be actively engaged in this discussion, and they are.\n\nI don't think that is going to change the fact that we simply cannot continue on the course we're on. It's unsustainable. It's not stable. We are spending twice as much per person as any other country in the world — one in every six dollars in this economy.\n\nAnd on the current trend line, we're headed for a circumstance in which we'll spend one in every three dollars on health care in this economy. That would be a disaster for our families, our businesses and the government itself.\n\nWALLACE: And let me bring in Senator Shelby, because we've got about 30 seconds left.\n\nSenator Shelby, how much trouble is — and Senator Conrad's right, the president doesn't have a plan, but the Democrats have floated, certainly, some ideas and a couple of specific plans. How much trouble is health care reform in?\n\nSHELBY: I think a lot of the proposals that the president's talked about and some of the Democrats have talked about are in deep trouble. The American people are figuring it out. They're speaking now, and I believe Congress is beginning to listen.\n\nWALLACE: Gentlemen, I want to thank you all for helping us check some of the facts in health care reform and try to separate out what's true and what isn't.\n\nThank you all, gentlemen.\n\nContent and Programming Copyright 2009 FOX News Network, LLC. ALL RIGHTS RESERVED. Transcription Copyright 2009 CQ Transcriptions, LLC, which takes sole responsibility for the accuracy of the transcription. ALL RIGHTS RESERVED. No license is granted to the user of this material except for the user's personal or internal use and, in such case, only one copy may be printed, nor shall user use any material for commercial purposes or in any fashion that may infringe upon FOX News Network, LLC'S and CQ Transcriptions, LLC's copyrights or other proprietary rights or interests in the material. This is not a legal transcript for purposes of litigation.", "images": ["https://web.archive.org/web/20090820185138im_/http://www.foxnews.com/i/mkt/mkt_nationwide.gif", "https://web.archive.org/web/20090820185138im_/http://www.foxnews.com/i/mkt/mkt_bankrate.jpg", "https://web.archive.org/web/20090820185138im_/http://www.foxnews.com/images/columns/col_head_fnsinterview04.gif", "https://web.archive.org/web/20090820185138im_/http://www.foxnews.com/i/mkt/mkt_31credit.gif", "https://web.archive.org/web/20090820185138im_/http://www.foxnews.com/i/mkt/mkt_freecredit.gif", "https://web.archive.org/web/20090820185138im_/http://www.foxnews.com/ucat/images/98282_ureport_90.JPG", "https://web.archive.org/web/20090820185138im_/http://www.foxnews.com/i/mkt/mkt_fnshop.gif", "https://web.archive.org/web/20090820185138im_/http://www.foxnews.com/i/new/feat-shows-blue.gif", "https://web.archive.org/web/20090820185138im_/http://www.foxnews.com/i/mkt/mkt_fnradio.gif", "https://web.archive.org/web/20090820185138im_/http://www.foxnews.com/i/mkt/mkt_people.gif", "https://web.archive.org/web/20090820185138im_/http://www.foxnews.com/i/new/close.jpg", "https://web.archive.org/web/20090820185138im_/http://www.foxnews.com/i/mkt/mkt_imag.jpg", "https://web.archive.org/web/20090820185138im_/http://www.foxnews.com/i/mkt/mkt_carsdirect.jpg", "https://web.archive.org/web/20090820185138im_/http://www.foxnews.com/images/foxnews_story.gif", "https://web.archive.org/web/20090820185138im_/http://pix01.revsci.net/E05510/a3/0/0/0/0/0/0/0/0/0/noscript.gif", "https://web.archive.org/web/20090820185138im_/http://www.foxnews.com/i/new/fn-header.jpg"], "top_img": "https://web.archive.org/web/20090820185138im_/http://www.foxnews.com/ucat/images/98282_ureport_90.JPG", "keywords": [], "authors": [], "canonical_link": "", "title": "Transcript: Blue-Ribbon Panel on Health Care - FOX News Sunday", "meta_data": {"description": "'FNS' Interview: Transcript: Blue-Ribbon Panel on Health Care, 'FOX News Sunday' gets straight answers on health care's critical questions", "keywords": "fox news sunday,health care,reform,obama, fox news sunday, chris wallace", "storyid": 553026, "publish_date": "2009-08-17", "section_name": "FNS w/ Chris Wallace", "dart_sitezone": "fnc/shows/fns"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}