{"url": "https://people.com/tv/married-at-first-sight-season-6-cast/", "text": "Married at First Sight returns in January to once again take love at first sight to the next level.\n\nLifetime’s hit reality show (produced by Kinetic Content) — in which six singles meet their spouses for the first time as they exchange vows on their wedding day — is headed to Boston for season 6, and PEOPLE is sharing the exclusive first look at the new cast of couples in this week’s issue, on stands now.\n\nGet push notifications with news, features and more.\n\nAs usual, fans will see the first moment the newlyweds meet, their honeymoon and their daily struggles as they move in with a complete stranger who is now legally tied to them. At the end of the experiment, each couple will decide if they want to remain married or file for divorce.\n\nMolly Duff and Jonathan Francetic\n\nImage zoom Courtney Hizey Photography & Emily Maultsby\n\nDuff is a commercial insurance adjuster from the suburbs of Boston. The 25-year-old has always looked to her parent’s marriage as a great example of love and devotion. When her father passed away six years ago, she grew closer than ever to her mother and two sisters. Duff has been in several long-term relationships over the past few years, but she has yet to find “the one.” She’s looking for a man who is funny, hard-working and loyal.\n\nAn Army veteran and financial associate, Francetic grew up in Florida with his parents but now lives in the suburbs of Boston. Though his parents divorced when he was a teenager, the 28-year-old learned how to be independent from his mother, who also instilled in him the importance of compromise and unconditional love in a marriage. While many of his close family and friends view him as a pragmatic soldier, Francetic admits to having a romantic and sensitive side. His perfect match is a woman who is energetic and driven with a sense of humor and passion for adventure.\n\nShawniece Jackson and Jephte Pierre\n\nImage zoom Courtney Hizey Photography & Emily Maultsby\n\nJackson, a 29-year-old entrepreneur and cosmetologist, is the eldest of 10 brothers and sisters and loves having a big family. Although her parents never married, Jackson witnessed what a healthy relationship looks like through her mother’s marriage to her stepfather. Laziness is an absolute deal-breaker for Jackson, who values hard work and determination. She wants to be with a man who can keep up with her fun and energetic personality, make her laugh and keep her grounded.\n\nAs the eldest of fourteen children, Pierre is a natural leader and took on the role of a father figure to his younger siblings growing up. Although his parents are still together, he doesn’t exactly admire their marriage and looks to others for relationship inspiration and advice. The 26-year-old second grade school teacher lives in Boston and has found dating extremely difficult. He’s looking for an outgoing, mature and confident woman and is not interested in anyone with baggage from a past relationship. Like Jackson, Pierre finds laziness to be a big turn off.\n\nJaclyn Schwartzberg and Ryan Buckley\n\nImage zoom Courtney Hizey Photography & Emily Maultsby\n\nSchwartzberg is a 29-year-old teacher turned sales representative living in the suburbs of Boston. She grew up with two siblings and parents whose relationship she describes as “perfect.” After the devastating and sudden loss of her boyfriend — who she believed to be her soulmate — almost two years ago, Schwartzberg hopes to find another man whom she can connect with on the same level. At this point, none of the men she has dated since have been able to compare. She is looking for someone who is funny, passionate and ready to commit.\n\nGrowing up, Buckley was surrounded by a loving family and calls his childhood with his three sisters and parents the quintessential American dream. The 29-year-old’s parents are still very much in love, and he has the upmost respect and admiration for their marriage. Buckley loves serving his community as a firefighter in the Boston area and enjoys cooking for his buddies at the station. Although most of what he hoped for in life has been achieved, Ryan is missing that special someone to spend it with and admits that it’s because, in part, he can be picky at times. He’s looking for a woman who is energetic, thoughtful and sincere.\n\nFor more on Married at First Sight, pick up this week’s issue of PEOPLE, on stands Friday\n\nImage zoom\n\nThis season, Dr. Jessica Griffin, a psychologist based in Boston, will be featured on the show along with sociologist Dr. Pepper Schwartz and Pastor Calvin Roberson as the series’ panel of experts.\n\nMarried at First Sight’s sixth season premieres Jan. 2 at 9 p.m. ET after the Married at First Sight: Matchmaking Special.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fmarried-at-first-sight-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmarried-at-first-sight.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fmarried-at-first-sight-3.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fcover1-3.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1546&h=809&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fmarried-at-first-sight-3.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1546&h=809&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fmarried-at-first-sight-3.jpg", "keywords": [], "authors": ["Brianne Tracy"], "canonical_link": "https://people.com/tv/married-at-first-sight-season-6-cast/", "title": "Meet the Married at First Sight Season 6 Cast", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Exclusive,Married at First Sight,News,Rollout,TV,TV Watch", "news_keywords": "Exclusive,Married at First Sight,News,Rollout,TV,TV Watch", "description": "The sixth season premieres on Tuesday, Jan. 2 at 9 p.m. EST", "og": {"title": "An Army Vet and a Cosmetologist with a Deal-Breaker: Meet Married at First Sight's New Cast", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/married-at-first-sight-season-6-cast/", "description": "Married at First Sight&nbsp;returns in January to once again take love at first sight to the next level. Lifetime’s hit reality show (produced by Kinetic&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1546&h=809&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fmarried-at-first-sight-3.jpg", "width": 1546, "height": 809}}, "pinterest": {"url": "https://people.com/tv/married-at-first-sight-season-6-cast/", "description": "The sixth season premieres on Tuesday, Jan. 2 at 9 p.m. EST", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fmarried-at-first-sight-3.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/married-at-first-sight-season-6-cast/", "title": "An Army Vet and a Cosmetologist with a Deal-Breaker: Meet Married at First Sight's New Cast", "description": "The sixth season premieres on Tuesday, Jan. 2 at 9 p.m. EST", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1546&h=809&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fmarried-at-first-sight-3.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}