{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/02/10/kim-cattrall-rejects-sarah-jessica-parkers-condolences-stop-exploiting-our-tragedy/", "text": "AD\n\n“If somebody in your life, whether you’re in touch with them or not, is suffering for any reason, it’s involuntary that you want to convey condolences or sadness or just let someone know you’re thinking about them,” Parker told “Entertainment Tonight.”\n\nAD\n\nCattrall wasn’t having it, clapping back by suggesting Parker was a “hypocrite” and saying even her mother wondered when she would leave Cattrall alone.\n\n“Your continuous reaching out is a painful reminder of how cruel you really were then and now,” Cattrall wrote Saturday. “Let me make this VERY clear. (If I haven’t already) You are not my family. You are not my friend. So I’m writing to tell you one last time to stop exploiting our tragedy in order to restore your ‘nice girl’ persona.”\n\nAD\n\nTo drive her point home, Cattrall pasted a link to an article by the New York Post’s Paula Froelich from last October, which alleged a “mean-girls culture” that ultimately destroyed the franchise.\n\nPublicists for Cattrall and Parker did not immediately respond to requests for comment Saturday.\n\nOn screen, Cattrall and Parker — along with Kristin Davis and Cynthia Nixon — portrayed best friends navigating their 30s (or, in Cattrall’s case, her early 40s) while pursuing careers, romance and an endless parade of brunches in New York. The “Sex and the City” franchise was a hit for HBO, spanning six seasons, inspiring two movies and garnering dozens of award nominations.\n\nAD\n\nAD\n\nOff-screen, however, there were persistent rumors of tension on set. For years, all four stars brushed off any ideas they were feuding, dancing around the issue with oblique quotes about occasional clashes.\n\n“When you’re on set, you’re working 90-hour weeks, you’re never home, you’re exhausted,” Parker told the Daily Mail in 2010. “There are times when all of us have been sensitive and sometimes feelings get hurt.”\n\nCattrall, who played publicist Samantha Jones in the series, appeared to agree.\n\n“Nineteen-hour workdays are stressful, whether you’re driving a truck, working in a coal mine or on a set and trying to be your brightest at 4 o’clock in the morning,” Cattrall told the Daily Mail. “But there’s a camaraderie that happened through all of that. . . . The chemistry among the four of us is very strong.”\n\nAD\n\nAD\n\nBut euphemisms couldn’t hide the undeniable tension between the two after reports surfaced last fall that Cattrall wasn’t interested in participating in a “Sex in the City 3” movie. Citing unnamed sources, a Daily Mail “exclusive” blamed the botched sequel plans on Cattrall’s “ridiculous demands.”\n\nWoke 2 a @MailOnline 💩storm! The only 'DEMAND' I ever made was that I didn't want to do a 3rd film....& that was back in 2016 — Kim Cattrall (@KimCattrall) September 29, 2017\n\nCattrall categorically denied that, tweeting that she had made clear she didn’t want to do a third “Sex and the City” movie back in 2016. In a subsequent interview with Piers Morgan, Cattrall also said she and her co-stars had “never been friends,” despite their on-screen bond.\n\n“We’ve been colleagues — and in some ways that’s a very healthy place to be,” Cattrall told Morgan. “The common ground that we had was the series and the series is over. . . . Sarah Jessica, she could have been nicer, she could have in some way. I don’t know what her issue is. I never have.”\n\nAD\n\nAD\n\nParker recently appeared on “Watch What Happens Live!” to say she was “just heartbroken” over Cattrall’s comments.\n\n“I found it very upsetting because that’s not the way I recall our experience,” Parker told host Andy Cohen. “It’s sad . . . It was a professional experience, but it became personal, because it was years and years of our lives.”", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/5IYWEC63AUZTVP545UAWLW2SW4.jpg&w=150", "https://www.washingtonpost.com/resizer/r4xN1JiGvLFD8allaLkCF9KHXRI=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OJOVP4LGQU7VVN6QYMIRDMW26Y.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/9deae4bf-86c8-4f49-8658-ce5f2f4b2a30.png&w=90&h=90"], "top_img": "https://www.washingtonpost.com/resizer/r4xN1JiGvLFD8allaLkCF9KHXRI=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OJOVP4LGQU7VVN6QYMIRDMW26Y.jpg", "keywords": [], "authors": ["Amy B Wang", "National Politics Reporter Covering Presidential Campaigns"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/02/10/kim-cattrall-rejects-sarah-jessica-parkers-condolences-stop-exploiting-our-tragedy/", "title": "Kim Cattrall rejects Sarah Jessica Parker’s condolences: ‘Stop exploiting our tragedy’", "meta_data": {"description": "Cattrall blasted her former “Sex and the City” co-star, putting an end to any doubt about whether the two are friends.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/02/10/kim-cattrall-rejects-sarah-jessica-parkers-condolences-stop-exploiting-our-tragedy/", "image": "https://www.washingtonpost.com/resizer/r4xN1JiGvLFD8allaLkCF9KHXRI=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OJOVP4LGQU7VVN6QYMIRDMW26Y.jpg", "title": "Kim Cattrall rejects Sarah Jessica Parker’s condolences: ‘Stop exploiting our tragedy’", "description": "Cattrall blasted her former “Sex and the City” co-star, putting an end to any doubt about whether the two are friends."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Kim Cattrall rejects Sarah Jessica Parker’s condolences: ‘Stop exploiting our tragedy’", "description": "Cattrall blasted her former “Sex and the City” co-star, putting an end to any doubt about whether the two are friends."}, "last_updated_date": "2018-02-26T00:14:15.910Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1518192000.0, "source": "https://www.washingtonpost.com", "summary": ""}