{"url": "www.mercurynews.com/2018/07/12/brad-pitts-hurricane-katrina-homes-are-falling-apart-residents-say-in-new-report/", "text": "CLICK HERE if you are having a problem viewing the photos on a mobile device\n\nBrad Pitt’s image as the architectural savior of New Orleans after Hurricane Katrina’s destruction is being questioned in a new report that alleges that a number of homes built by his nonprofit in the Lower Ninth Ward are falling apart.\n\nThe report by the Daily Mail also suggests that the actor, in the wake of his nasty breakup from Angelina Jolie, has lost his passion for fulfilling his original commitment to build 150 affordable, durable and environmentally efficient homes.\n\nThe Daily Mail recently visited New Orleans’ Lower Ninth Ward, where many homes belonging to black and low-income families were swept away after levees of the city’s industrial canal were breached during the hurricane 13 years ago.\n\nPost-Katrina, the humanitarian-minded Pitt and Jolie swooped in to the city and bought their own elegant French Quarter mansion, while Pitt set up the nonprofit Make it Right to help regenerate the Lower Ninth Ward.\n\nArchitectural enthusiast Pitt, 54, promised the nonprofit would build 150 new homes using cutting-edge design that would emphasize safety and adherence to LEED platinum building standards.\n\nMake it Right spent at a minimum of $25 million to build brightly painted, architecturally distinct homes that were sold to Lower Ninth Ward residents at a discount, though residents told the Daily Mail they cost around $150,000 each — or market value.\n\nNow, residents are telling the Daily Mail that some of the homes didn’t live up to the promise offered by Pitt or by his nonprofit, saying that the homes contain structural flaws and are now falling apart.\n\nDaily Mail published photos showing some of those homes, with roofs caving in, wood rotting and walls collapsing or falling away from the house. Some residents used their life savings, combined with federal relief funding, to buy the homes. But some found they couldn’t keep up with the repairs and have abandoned them, the Daily Mail added.\n\nResident Constance Fowler told the Daily Mail that her next-door neighbors in a Make it Right home had to move out because the wife was getting sick from the mold. Make it Right promised to renovate the house, but workers found its roof was beyond repair, Fowler said. The house was left unoccupied and rotting away. Fowler told the Daily Mail she had to repeatedly petition Make it Right and the city to tear it down.\n\n“Make It Right says this is the largest green community in the United States,” Fowler said to the Daily Mail. “Look how many are boarded up now or abandoned.”\n\n“People have problems with porches, roofs, walls falling apart,” she added. “There’s six out of seven homes right next to me that have had significant repairs.”\n\nAnother resident, Doris Wyman, said she and her husband Henry are only able to stay in their Make it Right home because Henry is a skilled handyman.\n\n“I’m concerned about neighbors’ homes,” she said. “Just because mine is holding up, I know others are falling apart, their walls, roofs and porches.”\n\nWyman said Make it Right may have brought people back to the Lower Ninth Ward, but ultimately failed in its mission if people can’t stay in their homes. She acknowledged that the intention probably was “beautiful” but asked, “Where did they go wrong?”\n\nPitt used to be a regular presence in the neighborhood and at the Make it Right headquarters, the Daily Mail said. But residents told the Daily Mail they haven’t seen him for a couple of years.\n\nThe New Orleans Times-Picayune reported in May 2015 that Pitt and Jolie, then Hollywood’s premier globe-trotting super couple, were selling their New York Orleans mansion for $6.5 million.\n\nA representative for the couple insisted at the time that the sale didn’t mean that the couple were wavering in their commitment to the Lower Ninth Ward.\n\n“Yes they are letting go of this property and will look for something more off the beaten path down the road,” the rep said told the Times-Picayune. “In the meantime, they remain committed to, and infatuated as ever with the city of New Orleans, and will continue to focus on growth in the Lower Ninth through the Make It Right Foundation.”\n\nJolie filed for divorce from Pitt in September 2016, and the couple have since been locked in a bitter, high-profile battle over their divorce and custody of their six children, ages 10 to 16. Pitt also was initially hit with allegations that he was drinking too much and had become violent with their oldest son, Maddox, 16, during a flight from Europe in 2016.\n\nPitt, facing the biggest scandal of his three-decade career, “turned inward,” E! News recently reported. In a candid 2017 interview with GQ Style, Pitt used an architectural metaphor to describe his recovery from the breakup of his family, saying he relied on therapy, a newfound sobriety and plenty of solitude to strip down “to the foundation and break out the mortar.”\n\nWith regard to his focus on Make it Right, a source close to Pitt insisted to the Daily Mail that the actor has visited New Orleans several times over the past few years and continues to make the organization a priority.\n\n“In addition to personally being there, he continues to dedicate significant time and financial support to this project,” the source said. “This is an ongoing project for both Make It Right and for Brad — who has personally donated his time and millions of his own dollars to ensure the community is revitalized and the project continues as scheduled.”\n\nIn a phone interview from Los Angeles with the New Orleans Times-Picayune in 2015 — the 10th anniversary of Hurricane Katrina — Pitt said he had recently visited the Lower Ninth Ward. He delighted in how the neighborhood had become an “oasis of color and the solar panels.”\n\nPitt told the Times-Picayune he also had talked to residents sitting on their front porch. He asked them how their new homes were working out.\n\n“Good,” he said they told him. “And I say what’s your utility bill? And they’ll throw something out like, ’24 bucks’ or something, and I feel fantastic.”\n\nAt the same time, Pitt admitted to the Times-Picayune that he and the organization had been “incredibly naive” in understanding what it really takes to rebuild a community.\n\n“We went into it incredibly naive,” he told the newspaper, “just thinking we can build homes — how hard is that? — and not understanding forgivable loan structures and family financial counseling and getting the rights to lots and HUD grants and so on and so forth. So it’s been a big learning curve.”", "images": ["https://www.mercurynews.com/wp-content/uploads/2018/07/PittNOLA2.jpg?w=1024&h=639", "https://i0.wp.com/www.mercurynews.com/wp-content/uploads/2018/07/PIttNOLA3.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://i0.wp.com/www.mercurynews.com/wp-content/uploads/2018/07/PittNOLA1.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2018/07/PittNOLA2.jpg?w=1024&h=639", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2018/07/12/brad-pitts-hurricane-katrina-homes-are-falling-apart-residents-say-in-new-report/", "title": "Brad Pitt’s Hurricane Katrina homes are falling apart, residents say in new report", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "A report says that homes built by Brad Pitt's Make it Right nonprofit in New Orleans' Lower Ninth Ward have a number of structural problems.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Brad Pitt’s Hurricane Katrina homes are falling apart, residents say in new report", "url": "https://www.mercurynews.com/2018/07/12/brad-pitts-hurricane-katrina-homes-are-falling-apart-residents-say-in-new-report/", "description": "A report suggests Brad Pitt may have lost focus on rebuilding durable, affordable homes in New Orleans’ devastated Lower Ninth Ward, following his high-profile breakup from Angelina Jolie.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2018/07/PittNOLA2.jpg?w=1024&h=639", "width": 1024, "height": 639}, "locale": "en_US"}, "article": {"published_time": "2018-07-12T15:22:20+00:00", "modified_time": "2018-08-30T20:32:42+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Brad Pitt’s Hurricane Katrina homes are falling apart, residents say in new report"}, "image": "https://www.mercurynews.com/wp-content/uploads/2018/07/PittNOLA2.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1531324800.0, "source": "http://www.mercurynews.com", "summary": ""}