{"url": "https://en.wikipedia.org/wiki/Fantastic_Beasts_and_Where_to_Find_Them_(film)", "text": "2016 film directed by David Yates\n\nFantastic Beasts and Where to Find Them is a 2016 fantasy film directed by David Yates. A joint British and American production, it is a spin-off of and prequel to the Harry Potter film series. It was produced and written by J. K. Rowling in her screenwriting debut, inspired by her 2001 \"guide book\" of the same name. The film features an ensemble cast that includes Eddie Redmayne, Katherine Waterston, Dan Fogler, Alison Sudol, Ezra Miller, Samantha Morton, Jon Voight, Carmen Ejogo, and Colin Farrell. It is the first installment in the Fantastic Beasts film series, and ninth overall in the Wizarding World franchise that began with the Harry Potter films.\n\nFantastic Beasts and Where to Find Them premiered in New York City on 10 November 2016 and opened in cinemas worldwide on 18 November 2016 in 3D, IMAX 3D 4K Laser and other large-format cinemas. It received generally positive reviews from critics and emerged a commercial success after grossing $814 million worldwide, making it the eighth highest-grossing film of 2016.\n\nThe film was nominated for five BAFTAs, including Best British Film, and won for Best Production Design. It was nominated for two Academy Awards and won for Best Costume Design, becoming the first Wizarding World film to win an Academy Award.[9] The first sequel, Fantastic Beasts: The Crimes of Grindelwald, was released on 16 November 2018.[10] Filming for a second sequel, as yet unnamed, will begin in spring 2020, with a projected release date in November 2021.[11]\n\nPlot [ edit ]\n\nIn 1926, British wizard and \"magizoologist\" Newt Scamander arrives in New York, en route to Arizona. He encounters Mary Lou Barebone, a non-magical woman (\"No-Maj\" or \"Muggle\") who heads the New Salem Philanthropic Society. As Newt listens to her speaking about witches and wizards being real and dangerous, a Niffler escapes from Newt's magically expanded suitcase, which houses various magical creatures. As Newt attempts to capture the Niffler, he meets No-Maj cannery worker and aspiring baker Jacob Kowalski, and they unwittingly swap suitcases. Demoted Auror (hunter of dark wizards) Tina Goldstein arrests Newt for the chaos caused by the Niffler and takes him to the Magical Congress of the United States of America (MACUSA) headquarters, hoping to regain her former position. However, as Jacob's suitcase contains only baked goods, Newt is released. At Jacob's tenement apartment, several creatures escape from Newt's suitcase.\n\nAfter Tina and Newt find Jacob and the suitcase, Tina takes them to her apartment and introduces them to Queenie, her Legilimens sister. Jacob and Queenie are mutually attracted, though American wizards are forbidden to have any contact with No-Majs. Newt takes Jacob inside his magically expanded suitcase, where Jacob encounters a contained Obscurus, a parasite that develops inside magically gifted children if they suppress their magical abilities. Newt extracted it from a young girl who died: Those afflicted rarely live past the age of ten. Newt persuades Jacob to help search for the missing creatures. After they re-capture two of the three escaped beasts, Tina returns the suitcase to MACUSA. Officials arrest them, believing one of Newt's beasts to be responsible for killing Senator Henry Shaw, Jr.. The Director of Magical Security, Percival Graves accuses Newt of conspiring with the infamous dark wizard Gellert Grindelwald, and decides to destroy Newt's suitcase and erase Jacob's recent memories of magic. Newt and Tina are sentenced to immediate death in secret, but they escape, aided by Queenie and Jacob, who also retrieve Newt's suitcase. Following a tip from Tina's old goblin informant Gnarlack, the foursome find and re-capture the last of the escaped creatures.\n\nMeanwhile, Graves approaches Mary Lou's adopted son Credence and offers to free him from his abusive mother. In exchange, Graves wants Credence to find an Obscurus that he believes has caused the mysterious destructive incidents around the city. Credence finds a wand under his adopted sister Modesty's bed. Mary Lou assumes it is Credence's wand, but Modesty says it is hers. When Modesty is about to be punished, the Obscurus kills Mary Lou and her eldest daughter Chastity. Graves arrives, and after Credence leads him to Modesty, who he assumes is the Obscurus's host, he dismisses Credence as being a Squib and refuses to teach him magic as he had previously promised. Credence reveals he is the real host, having lived longer than any other host due to the intensity of his magic. In a fit of rage, Credence transforms and attacks the city.\n\nNewt finds Credence hiding in a subway tunnel, but he is attacked by Graves. Tina, who knows Credence (she lost her job trying to protect him from Mary Lou) arrives and attempts to calm him, while Graves tries to convince Credence to listen to him. As Credence begins to settle back into human form, Aurors arrive and apparently disintegrate him to protect the magical society. However, a tiny Obscurus fragment escapes. Graves admits his plan to unleash the Obscurus, expose the magical community to the No-Majs and frame Newt for it. He angrily claims that MACUSA protects the No-Majs more than themselves. As the president orders the Aurors to apprehend Graves, he attacks and begins to defeat all of them. Newt manages to subdue him with one of his beasts, and uses a revealing spell to expose Graves as Grindelwald in disguise; he is taken into custody.\n\nMACUSA fears their secret world has been exposed, but Newt releases his Thunderbird to disperse a potion as rainfall over the city, erasing all New Yorkers' recent memories while MACUSA wizards repair the destruction. Queenie kisses Jacob goodbye as the rain erases his memories.\n\nJacob and the rest of the No-Majs are obliviated with the help of the Thunderbird, and Newt returns to England. Jacob opens a bakery: Some of his products look like the beasts he met. Queenie enters, and Jacob smiles at her.\n\nCast [ edit ]\n\nFantastic Beasts and Where to Find Them panel at the 2016 panel at the 2016 San Diego Comic Con International (left to right): director Yates; actors Redmayne, Waterston, Sudol, Fogler, Farrell, Miller.\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nFantastic Beasts and Where to Find Them is mentioned several times as a school textbook in the Harry Potter book series, although Scamander himself does not appear in any of the books. In 2001, Rowling published an edition of the \"textbook\" to be sold to raise money for the British charity Comic Relief. The book is a directory of magical creatures with an introduction by its author, Newt Scamander: It does not contain a narrative.\n\nFirst announced in September 2013, the Fantastic Creatures project marked Rowling's debut as a screenwriter.[30] The film sees the return of producer David Heyman, as well as writer Steve Kloves, both veterans of the Potter film franchise.[31] There were rumors that Alfonso Cuarón would direct, which he refuted in May 2014.[32][33] Warner Bros. announced that David Yates would direct at least the first instalment of a planned trilogy.[34] James Newton Howard was brought on board to score the film.[35]\n\nFilming [ edit ]\n\nPrincipal photography began on 17 August 2015, at Warner Bros. Studios, Leavesden, in Hertfordshire, England and wrapped in January 2016.[20][22][36][37] Several scenes were shot on location in London.[38] After two months, the production moved to the Cunard Building and St George's Hall in Liverpool, which was transformed into 1920s New York City.[39] Framestore in London produced the visual effects for the film.[40]\n\nMusic [ edit ]\n\nOn 9 April 2016, the film's website announced that James Newton Howard would write and compose the score.[41] On 24 October 2016, Pottermore published an official first look at the film's main theme composed by Howard.[42] The main theme incorporated John Williams' themes from earlier films, such as \"Hedwig's Theme\".[43] The soundtrack was released by WaterTower Music on 18 November 2016, coinciding with the film's release worldwide.[44]\n\nVisual effects [ edit ]\n\nThe visual effects were provided by Cinesite, DNEG, Framestore, Image Engine, Moving Picture Company, Milk VFX and Rodeo FX.[45]\n\nRelease [ edit ]\n\nFantastic Beasts and Where to Find Them had its world premiere at Alice Tully Hall in New York City on 10 November 2016. The film was released worldwide on 18 November 2016, in 2D, 3D and the new IMAX 3D 4K Laser system.[12][46] It would premiere one day earlier in a number of other countries, including Argentina, Australia, Brazil, Germany and Italy, on 17 November. The film would be released to a total of 1,028 IMAX 3D screens worldwide (388 screens in the United States and Canada, 347 screens in China, 26 screens in Japan and 267 screens in other countries). This marked the second time—after Doctor Strange—that a film secured a release in more than 1,000 IMAX 3D screens worldwide.[47][48]\n\nMarketing [ edit ]\n\nPublicity [ edit ]\n\nOn 4 November 2015, Entertainment Weekly released the first official publicity shots of the film, including pictures of characters Newt, Tina, and Queenie, and behind-the-scenes shots of production and filming on various sets designed to mirror 1920s New York City. On 10 December 2015, @Fantastic Beasts announced on Twitter that an \"announcement trailer\" would be released on 15 December.[49] A teaser poster was also released along with the one-minute trailer.[50][51]\n\nDuring \"A Celebration of Harry Potter\" at Universal Orlando Resort in February 2016, a featurette was released showcasing several interviews with various cast and crew members, as well as the first official behind-the-scenes footage.[52] On 10 April 2016, the first \"teaser trailer\" was released during the MTV Movie Awards.[53] On 10 August 2016, more information and publicity shots for the film were released through Entertainment Weekly, with new information on Ezra Miller's character, Credence Barebone, and the news that Zoë Kravitz would have a role in the series.[54][55] New images released at the time include the quartet running down a New York City alleyway; David Yates chatting to stars Katherine Waterston and Eddie Redmayne on the set in front of a blown out subway station; Colin Farrell's character, Percival Graves, interrogating an arrested and handcuffed Newt; and Graves and Credence putting up anti-magic propaganda.[54][56]\n\nTie-in literature and merchandise [ edit ]\n\nThe film's script was published in book form on 18 November 2016. Fantastic Beasts and Where to Find Them: The Original Screenplay was written by Rowling herself.[57][58]\n\nOn 7 March 2016 a trailer-preview was released about the History of Magic in North America as it is in the Harry Potter universe.[59] On 7 October 2016, Rowling also released on Pottermore four pieces of writing exclusively as an introduction to the film Fantastic Beasts and Where to Find Them, titled History of Magic in North America. It includes information about scourers in North America, brutal and violent magical mercenaries who played a significant role in the historic Salem witch trials of the 1600s, as well as info about various American wand makers; the role magic played in World War I; Native American magic; the foundation of MACUSA; the harsh enforcement No-Maj/Wizarding segregation; and life in 1920s Wizarding America; with info about wand permits and prohibition.[60][61]\n\nOn 28 June 2016, Rowling released a second part to her History of Magic in North America series, concerning the fictitious Ilvermorny School of Witchcraft and Wizardry, detailing the founding of the pre-eminent American Wizarding academy and allowing users to sort themselves into one of the four houses of the school. The school itself is mentioned in the film.[62]\n\nA \"story pack\" based on Fantastic Beasts and Where to Find Them was released for the video game Lego Dimensions by WB Games and TT Games. The pack includes a constructible model of MACUSA, figures of Newt Scamander and a Niffler, and a six-level game campaign that adapts the film's events. The pack was released on the same day as the film, alongside a \"fun pack\" containing figures of Tina Goldstein and a Swooping Evil. The cast of the film reprises their roles in the game.[63]\n\nHome media [ edit ]\n\nFantastic Beasts was released on Digital HD on 7 March 2017, and on 4K UHD, 3D Blu-ray, Blu-ray and DVD on 28 March 2017.[64]\n\nReception [ edit ]\n\nBox office [ edit ]\n\nFantastic Beasts and Where to Find Them grossed $234 million in the United States and Canada and $580 million in other countries for a total of $814 million.[8] The film was made on a budget of $180 million, with an additional $150 million spent on marketing.[6][65] Worldwide, the film grossed $219.9 million during its opening weekend in around 64 markets on 24,200 screens, both the fifth-biggest in Rowling's wizarding cinematic universe, and the seventh-biggest for the month of November 2016.[7][66] IMAX totalled $15 million from 605 screens.[47] Deadline Hollywood calculated the net profit of the film to be $164 million, when factoring together all expenses and revenues for the film, making it the ninth-most profitable release of 2016.[67]\n\nUnited Kingdom and Ireland [ edit ]\n\nFantastic Beasts went on general release in the United Kingdom and Ireland on 18 November 2016. It debuted with £15.33 million ($19.15 million) from 666 cinemas, the biggest debut of any film in 2016, ahead of the previous record holder, Batman v Superman: Dawn of Justice (£14.62 million).[47][68] The film vied with Bridget Jones' Baby and briefly won first place, only to be surpassed during the last days of 2016 by Rogue One: A Star Wars Story.[69]\n\nUnited States and Canada [ edit ]\n\nIn the United States and Canada, estimates predicted that the film would gross $68–85 million—or more—in its opening weekend. The film was released on 18 November in 4,143 cinemas, of which 388 were IMAX screens, and more than 3,600 were showing the film in 3D[70][71] It grossed $29.7 million on its first day, the second-lowest opening day among Rowling's adaptations (behind the $29.6 million Friday of Harry Potter and the Chamber of Secrets).[72] This included $8.75 million it earned from Thursday-night preview screenings beginning at 6 p.m. in 3,700 cinemas.[73] In total, the film earned $74.4 million in its opening weekend, falling in line with projections and finishing first at the box office, but it recorded the lowest opening among films in Rowling's Harry Potter universe.[7][74] It made $8 million from 388 IMAX screens, $9 million from 500 premium large-format locations and $1.75 million from Cinemark XD.[7]\n\nThe film's opening was considered a hit, taking into account the fact that the story was not based on an existing, popular source, and the film itself was missing the franchise's main character, Harry Potter.[65] It was the top choice among moviegoers, representing 47% of the weekend's total $157.6 million tickets sales.[75] On its second Friday, it had a gradual drop of 37% ($18.5 million) from the week before, the second-best Friday drop for any Harry Potter film, behind The Philosopher's Stone. This was in part due to Black Friday, the most lucrative day of the Thanksgiving Day stretch.[76] It ended up grossing $45.1 million in its second weekend (a drop of just 39.4%), finishing 2nd at the box office behind newcomer Moana.[77]\n\nOther markets [ edit ]\n\nOutside North America, the film debuted day-and-date in 63 countries, along with its North American release, where it was projected to gross $90–125 million in its opening weekend.[78][79] It opened 16 November 2016 in 9 countries, earning $6.9 million from 5,070 screens.[80][81] It opened in 38 more countries on 18 November, earning $16.6 million for a total of $23.5 million in two days.[80] In three days, it made $53.6 million.[82] Through Sunday, 20 November, the film had a five-day opening weekend of $145.5 million from 63 countries, above the initial projections.[47] It earned another $132 million in its second weekend after a large debut in China and Japan.[48]\n\nIt recorded the biggest opening day of all time among the Harry Potter franchise in Korea ($1.7 million), the Philippines ($1.2 million),[83] the UAE ($429,000) and Ukraine, the second biggest in Mexico ($1.8 million), Russia and the CIS ($1.7 million), Brazil ($1.3 million) and in Indonesia ($480,000), all behind Harry Potter and the Deathly Hallows – Part 2 and the third biggest in the United Kingdom ($5.4 million), behind Part 1 and Part 2.[80] It also scored the second-biggest Warner Bros. opening of all-time in the Czech Republic and Slovakia.[80] Notably, France opened with $1.8 million, Spain with $1.4 million, and Germany with $1 million ($2 million including paid previews).[80] In terms of opening weekends, the film posted the biggest opening among the Harry Potter franchise in 16 markets, including South Korea ($14.2 million, also the third-biggest opening for the studio), Russia ($9.8 million) and Brazil ($6.4 million), the biggest opener of the year in Germany ($10.2 million), Sweden, Belgium and Switzerland and the biggest Warner Bros. debut in those along with France ($10.2 million), Holland and Denmark. Italy debuted with $6.6 million, the biggest for a U.S. film in the country. Australia opened with $7.4 million, followed by Mexico ($5.8 million) and Spain ($4.5 million).[47]\n\nIt opened in China on 25 November alongside Disney's animated Moana but did not face significant competition from it. It earned $11.2 million on its opening day from 11,600 screens, the best among the Rowlings cinematic universe.[84][85] In total, it had an opening weekend of $41.1 million, dominating 60% of the top five films with 70,000 screenings per day. This alone surpassed the entire lifetime total of all Harry Potter films save the last one.[48][86] Similarly in Japan—typically the biggest or second biggest market for the previous Harry Potter films—it debuted with $15.5 million, besting the total lifetime of all the previous films except for Harry Potter and the Half-Blood Prince and Deathly Hallows – Part 2.[48]\n\nThe film also set a number of IMAX records. In total, the opening weekend was worth $7 million from 276 screens, which is the second-highest ever in the Wizarding World, behind Deathly Hallows – Part 2. In 33 territories, it opened at number one. Moreover, it's also the third-highest-grossing November international IMAX opening ever, and the No. 1 start for IMAX in November in 19 countries including Japan ($1.1 million), the UK, Russia, Germany, and the Netherlands.[47] In China, it had the biggest IMAX opening among the franchise with $5.1 million from 347 IMAX screens.[48] Overall, the film has earned a global cumulative total of $19.1 million from the format.[48]\n\nIt has become the highest-grossing film in Rowling's cinematic universe in Russia ($16.7 million) and the second-highest in South Korea ($24.6 million). China ($41.1 million) the United Kingdom ($37.6 million), followed by Germany ($18.4 million), France ($16.7 million), and Spain ($13.3 million) are the film's biggest-earning markets.[48]\n\nCritical response [ edit ]\n\nThe review aggregator website Rotten Tomatoes sampled 331 critics and judged 74% of the reviews as positive, with an average rating of 6.82/10. The website's critical consensus reads, \"Fantastic Beasts and Where to Find Them draws on Harry Potter's rich mythology to deliver a spin-off that dazzles with franchise-building magic all its own.\"[87] Metacritic, which assigns a normalised rating to reviews, gives the film a score 66 out of 100, based on 50 critics, indicating \"generally favorable reviews\".[88] Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale, while PostTrak reported filmgoers gave it a 90% positive score and a 74% \"definite recommend\".[7][89]\n\nPeter Bradshaw of The Guardian gave the film five out of five stars, hailing it as \"a rich, baroque, intricately detailed entertainment\" and a \"terrifically good-natured, unpretentious and irresistibly buoyant film\".[90] NME's Larry Bartleet also gave it five out of five, calling it \"more enchanting to your inner kid than the Potter films ever were\".[91] IndieWire's Eric Kohn gave the film a B+ saying that it \"delivers the most satisfying period fantasy since Tim Burton's Sweeney Todd: The Demon Barber of Fleet Street \", and that its layers of sophistication made it one of the best Hollywood blockbusters of the year.[92]\n\nMike Ryan of Uproxx gave the film a positive review, writing \"Newt Scamander is nothing like Harry, but it has to be this way. It all has to be different. And it is, but, again, with just enough 'sameness' to make us feel like we are at home again. I'm looking forward to wherever these movies are taking us\".[93] John DeFore of The Hollywood Reporter wrote that the film is \"likely to draw in just about everyone who followed the Potter series and to please most of them\".[94] However, New York Magazine's David Edelstein deemed the film a \"distinctly unmagical slog\", remarking that the beasts \"aren’t especially fantastic and the effects are too blandly corporate to be exhilarating\".[95] In a mixed review, Ignatiy Vishnevetsky of The A.V. Club found the film \"patchy but occasionally charming.\"[96]\n\nAccolades [ edit ]\n\nNotes\n\nSequels [ edit ]\n\nInitially, in October 2014, the studio announced the film would be the start of a trilogy. In July 2016, David Yates confirmed that Rowling had written the screenplay for the second film and had ideas for the third.[115] In October 2016, Rowling announced that the series would comprise five films.[116]\n\nThe first sequel, titled Fantastic Beasts: The Crimes of Grindelwald, was released on 16 November 2018.[117][118][119] The film's script, Fantastic Beasts—The Crimes of Grindelwald: The Original Screenplay, was published on 16 November 2018.[120][121]\n\nOn 4 November 2019, Wizarding World officially announced that production of the as-yet-unnamed third picture is slated to begin in Rio de Janeiro, Brazil, in Spring 2020, with a release date of 12 November 2021.[122]\n\nReferences [ edit ]\n\nLiterature [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Wiki_letter_w_cropped.svg/20px-Wiki_letter_w_cropped.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/59/Fantastic_Beasts_%26_Where_to_Find_Them_Cast_%28Cropped%29.jpg/400px-Fantastic_Beasts_%26_Where_to_Find_Them_Cast_%28Cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/5/5e/Fantastic_Beasts_and_Where_to_Find_Them_poster.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/5/5e/Fantastic_Beasts_and_Where_to_Find_Them_poster.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Fantastic_Beasts_and_Where_to_Find_Them_(film)", "title": "Fantastic Beasts and Where to Find Them (film)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/5/5e/Fantastic_Beasts_and_Where_to_Find_Them_poster.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}