{"url": "https://www.etonline.com/emmys-2018-tituss-burgess-kimmy-schmidt-best-tv-performance-103671", "text": "Tituss Burgess delivered one of ET's Standout Performances of the 2017-18 season.\n\n\n\nFor four seasons (and a possible movie), Tituss Burgess has embodied Titus Andromedon, the unapologetically loud and proud roommate to Kimmy Schmidt (Ellie Kemper) on Netflix’s Unbreakable Kimmy Schmidt. He’s flamboyant. He’s verbose. He’s nothing short of snarky. He’s a struggling actor -- rather, an “undercover superstar” -- who has a tendency to get in the way of his own success. He emotes through Beyonce, hiding nothing from his friend Kimmy, landlord Lillian (Carol Kane), agent Jacqueline White (Jane Krakowski) or ex-lover Mikey (Mike Carlsen).\n\n“Playing him is exhausting,” Burgess tells ET by phone. It’s the day of the Royal Wedding, but the actor is as far removed from the day’s festivities -- he’s traveling to Washington, D.C., where he’s set to perform at the 2018 WNO Opera Gala Concert the next day -- as he is from his onscreen persona. “I don't live in that space. My energy hovers around a two or three on a scale of one to 10.” That’s not to say the actor hasn’t enjoyed playing the character -- in fact, it’s been a career-making moment -- but when it’s 5 a.m. on set and he has to deliver all of Titus’ eccentricities, “it takes a toll.”\n\nBurgess recalls being on set the day before with Kemper as the two filmed scenes from the show’s final episodes when it dawned on both of them that this journey was coming to an end. “She and I looked at each other and realized how blessed we were and what an unusual experience we got to have and what an unusual show we got to do,” he says of the series that has been anything but typical.\n\nTelling the story of a young woman who moves to New York City after being forced to live in an underground bunker for the past 15 years, the incredibly quirky series co-created by Tina Fey and Robert Carlock was slated for a 13-episode run on NBC before unexpectedly being sold to Netflix, which picked it up for an initial two seasons. Kimmy Schmidt became the streaming network’s first original half-hour comedy and was met with critical acclaim, as well as 16 Primetime Emmy nominations in its first three seasons. Now, the show is drawing to a close with a final fourth season that's broken up into two parts -- the second half of season four premieres Jan. 25, 2019 -- and a reported movie. (While Burgess confirms that a movie has been proposed, Netflix has yet to make an official announcement or respond to requests for comment about it.)\n\n“I think Kimmy began to sync up with Ellie and both of them began to have the same experience of gratitude, zooming out and being able to see the larger picture. I think the same happened with Titus and myself,” Burgess recalls. (The plot of the final episodes, he teases, mirrors both the real-life and onscreen journeys for Kemper and Burgess.)\n\nThe gratitude also extends not only to the Emmys, which has nominated Burgess for three consecutive Outstanding Supporting Actor in a Comedy Series awards, but to the streaming platform, which has introduced the actor (and character) to an international audience. “Nothing will match this experience because it put me on the map,” he says.\n\nTituss Burgess in a scene from 'Unbreakable Kimmy Schmidt.' Netflix\n\nAs to why Titus has continuously resonated with voters and viewers alike, he says it’s because of how unique the character is. “I didn’t have that type of representation when I was growing up,” Burgess says. “By the sheer fact that he was new made for something to latch onto. It represented how the landscape in television was and is changing.” There’s also a vicarious experience audiences get by watching someone who is as unfiltered as Titus is, the actor muses, adding that if the show debuted today, he might not have had the same impact. “Titus wouldn’t pop as much under this current administration. People would see it as one of the many unfiltered, loud voices we hear today. Four years ago, believe it or not, was a far more civilized time. Titus up against that backdrop had more of an impression on people.”\n\nWith the show wrapping production, Burgess is now in a unique position in his career where he says he’ll literally be able to create opportunities for himself -- “what it will look like and what I want it to be.” He’s not as worried about what comes next or distancing himself from Titus as he is about tapping into new personalities. “There are many people and many spirits I know and I’m able to download, and the world only saw one of those,” Burgess says. “I’m excited to display other parts of my schizophrenia.”\n\nHe’s working on a new album. He has several upcoming film roles, including one as a creepy elevator operator in Netflix’s Set It Up. The others, he says, haven’t been announced, but he “was shocked” when he got one of them. There’s the musical adaptation of ThePreacher’s Wife, which he hopes to bring to Broadway, and which held a reading in December featuring Loretta Devine. “That is shaping up very nicely,” he says.\n\n“I will miss it dearly,” Burgess says of playing Titus, acknowledging that “it's going to feel strange not waking up and putting on those clothes, but my whole world will be just as colorful as the one I just played.”\n\nMORE STANDOUT PERFORMANCES OF THE SEASON:\n\nEmmys 2018: How Janet Saved ‘The Good Place’ Breakout D’Arcy Carden’s Career (Exclusive)\n\nEmmys 2018: Why Sara Gilbert Was Really the Heart of ‘Roseanne’ Revival (Exclusive)\n\nEmmys 2018: Walton Goggins, Hollywood’s Ultimate Journeyman, Is Finally a Breakout Star (Exclusive)", "images": ["https://www.etonline.com/themes/custom/et/img/watch-now.png", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2018-06/emmys2_1.jpg?h=c673cd1c&itok=dgdachr0", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-06/uks_401_unit_00021r_copy.jpg?itok=iDNYBDv9", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-06/emmys2_1.jpg?h=c673cd1c&itok=GY_qX0w3"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-06/emmys2_1.jpg?h=c673cd1c&itok=GY_qX0w3", "keywords": [], "authors": ["Stacy Lambe"], "canonical_link": "https://www.etonline.com/emmys-2018-tituss-burgess-kimmy-schmidt-best-tv-performance-103671", "title": "Emmys 2018: Tituss Burgess on Doing ‘Kimmy Schmidt’ for Four Seasons and a Movie (Exclusive)", "meta_data": {"article": {"opinion": "false"}, "title": "Emmys 2018: Tituss Burgess on Doing ‘Kimmy Schmidt’ for Four Seasons and a Movie (Exclusive)  | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/emmys-2018-tituss-burgess-kimmy-schmidt-best-tv-performance-103671", "title": "Emmys 2018: Tituss Burgess on Doing ‘Kimmy Schmidt’ for Four Seasons and a Movie (Exclusive)", "description": "The actor reflects on his time playing Titus Andromedon, why the role connected with audiences (and the Academy) and what he’s looking forward to doing next.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-06/emmys2_1.jpg?h=c673cd1c&itok=GY_qX0w3", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "The actor reflects on his time playing Titus Andromedon, why the role connected with audiences (and the Academy) and what he’s looking forward to doing next.", "title": "Emmys 2018: Tituss Burgess on Doing ‘Kimmy Schmidt’ for Four Seasons and a Movie (Exclusive)", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Stacy Lambe‍", "url": "https://www.etonline.com/emmys-2018-tituss-burgess-kimmy-schmidt-best-tv-performance-103671", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-06/emmys2_1.jpg?h=c673cd1c&itok=GY_qX0w3"}, "description": "The actor reflects on his time playing Titus Andromedon, why the role connected with audiences (and the Academy) and what he’s looking forward to doing next.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "Features, Awards, News, TV, Tituss Burgess, Unbreakable Kimmy Schmidt, Emmys", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}