{"url": "https://www.reviewjournal.com/crime/shootings/1-year-after-las-vegas-shooting-survivors-still-seek-help/", "text": "One year after the worst mass shooting in modern U.S. history, the Las Vegas Review-Journal examined how the 10-minute attack changed the community. And how it didn’t.\n\nLas Vegas police officers are silhouette during 58 seconds of silence in memory of the victims of the Oct. 1 attack, displayed above, during the Best of the Badge gala held by the Metropolitan Police Department Foundation at Red Rock Resort in Las Vegas on Friday, Sept. 14, 2018. Chase Stevens Las Vegas Review-Journal @csstevensphoto\n\nDeb Dailey, president of the EMS Training Center of Southern Nevada, hugs Chris Philippsen at the conclusion of a local Route 91 survivors support group on Wednesday, Sept. 26, 2018, at Stoney's Rockin' Country, in Las Vegas. Benjamin Hager Las Vegas Review-Journal @benjaminhphoto\n\nDeb Dailey, second from left, president of the EMS Training Center of Southern Nevada, Chris Philippsen and Kristine Schalk discuss the steps of healing at a local Route 91 survivors support group on Wednesday, Sept. 26, 2018, at Stoney's Rockin' Country, in Las Vegas. Benjamin Hager Las Vegas Review-Journal @benjaminhphoto\n\nDeb Dailey, left, president of the EMS Training Center of Southern Nevada, and Chris Philippsen discuss the steps of healing at a local Route 91 survivors support group on Wednesday, Sept. 26, 2018, at Stoney's Rockin' Country, in Las Vegas. Benjamin Hager Las Vegas Review-Journal @benjaminhphoto\n\nDeb Dailey, left, president of the EMS Training Center of Southern Nevada, Chris Philippsen and Kristine Schalk discuss their anxieties leading up to the anniversary of October 1 during a local Route 91 survivors support group on Wednesday, Sept. 26, 2018, at Stoney's Rockin' Country, in Las Vegas. Benjamin Hager Las Vegas Review-Journal @benjaminhphoto\n\nYvette Archuleta, middle, talks about her lingering anxiety leading up to the anniversary of Oct 1 during a local Route 91 survivors support group on Wednesday, Sept. 26, 2018, at Stoney's Rockin' Country, in Las Vegas. Benjamin Hager Las Vegas Review-Journal @benjaminhphoto\n\nYvette Archuleta talks about her lingering anxiety leading up to the anniversary of Oct 1 during a local Route 91 survivors support group on Wednesday, Sept. 26, 2018, at Stoney's Rockin' Country, in Las Vegas. Benjamin Hager Las Vegas Review-Journal @benjaminhphoto\n\nDeb Dailey, left, president of the EMS Training Center of Southern Nevada, shares a moment with Chris Philippsen during a local Route 91 survivors support group on Wednesday, Sept. 26, 2018, at Stoney's Rockin' Country, in Las Vegas. Benjamin Hager Las Vegas Review-Journal @benjaminhphoto\n\nYvette Archuleta talks about her lingering anxiety leading up to the anniversary of Oct 1 during a local Route 91 survivors support group on Wednesday, Sept. 26, 2018, at Stoney's Rockin' Country, in Las Vegas. Benjamin Hager Las Vegas Review-Journal @benjaminhphoto\n\nDeb Dailey, left, president of the EMS Training Center of Southern Nevada, Chris Philippsen and Kristine Schalk discuss their anxieties leading up to the anniversary of October 1 during a local Route 91 survivors support group on Wednesday, Sept. 26, 2018, at Stoney's Rockin' Country, in Las Vegas. Benjamin Hager Las Vegas Review-Journal @benjaminhphoto\n\nDeb Dailey, left, president of the EMS Training Center of Southern Nevada, and Chris Philippsen discuss the steps of healing at a local Route 91 survivors support group on Wednesday, Sept. 26, 2018, at Stoney's Rockin' Country, in Las Vegas. Benjamin Hager Las Vegas Review-Journal @benjaminhphoto\n\nDeb Dailey, left, president of the EMS Training Center of Southern Nevada, shares a moment with Chris Philippsen during a local Route 91 survivors support group on Wednesday, Sept. 26, 2018, at Stoney's Rockin' Country, in Las Vegas. Benjamin Hager Las Vegas Review-Journal @benjaminhphoto\n\nKristine Schalk reads a diagram addressing self care during a local Route 91 survivors support group on Wednesday, Sept. 26, 2018, at Stoney's Rockin' Country, in Las Vegas. Benjamin Hager Las Vegas Review-Journal @benjaminhphoto\n\nDeb Dailey, second from left, president of the EMS Training Center of Southern Nevada, Chris Philippsen and Kristine Schalk discuss the steps of healing at a local Route 91 survivors support group on Wednesday, Sept. 26, 2018, at Stoney's Rockin' Country, in Las Vegas. Benjamin Hager Las Vegas Review-Journal @benjaminhphoto\n\nYvette Archuleta, middle, talks about her lingering anxiety leading up to the anniversary of Oct 1 during a local Route 91 survivors support group on Wednesday, Sept. 26, 2018, at Stoney's Rockin' Country, in Las Vegas. Benjamin Hager Las Vegas Review-Journal @benjaminhphoto\n\nDeb Dailey, left, president of the EMS Training Center of Southern Nevada, Chris Philippsen and Kristine Schalk discuss the steps of healing at a local Route 91 survivors support group on Wednesday, Sept. 26, 2018, at Stoney's Rockin' Country, in Las Vegas. Benjamin Hager Las Vegas Review-Journal @benjaminhphoto\n\nThe Remembrance Wall at Las Vegas Community Healing Garden on South Casino Center Boulevard in downtown Wednesday, Sept. 5, 2018. K.M. Cannon Las Vegas Review-Journal @KMCannonPhoto\n\nAfter belting out the familiar, moody guitar riff,country music star Jason Aldean reached for his microphone on the final night of the Route 91 Harvest festival.\n\n“Some days it’s tough just gettin’ up,” he said to the 22,000 concertgoers.\n\nFollow the Review Journal Coverage of Oct. 1 Anniversary\n\nAs the world now knows all too well, high above him, to the west, a man with 23 rifles shattered a window in his Mandalay Bay suite, beginning an attack that would not end until the shooter took his own life.\n\nFifty-eight died. More than 800 were injured.\n\nNearly a year has passed, yet so many questions remain. Las Vegas police couldn’t name a motive. The FBI is still trying to figure it out.\n\nSurvivors continue to seek mental health services and struggle with medical bills, even after receiving donation payouts in March.\n\nA new memorial is in the pipeline, but no information has been released about where it will be or what it will look like.\n\nCasino security policies have changed, but they’re not obvious, and officials are guarded about sharing details.\n\nAnd bump stocks — the devices the gunman used to replicate automatic fire — remain legal in most states, including Nevada.\n\nAs the one-year milestone of the worst mass shooting in modern American history approaches, the Las Vegas Review-Journal examined how the 10-minute attack changed the community. And how it didn’t.\n\nMental health services\n\nOn Wednesday evenings, Stoney’s Rockin’ Country is silent save for the grumble of ceiling fans and the “how are you’s” of a hodgepodge of Route 91 shooting survivors.\n\n“How was this week?” Deb Dailey, president of the EMS Training Center of Southern Nevada and the group’s leader, asked four attendees who had gathered on an August evening. “Good stuff? Bad stuff?”\n\nThe four are regulars in a group of anywhere from five to 20 survivors who meet weekly at the country music club to connect with others who were there that night.\n\n“I always feel like I’m in a safe place when I’m with another survivor, when I’m in this room,” one attendee said. That day, all declined to share their names because of privacy concerns.\n\nThough therapeutic, the Stoney’s group isn’t technically therapy. Members have access to counselors through partners at Desert Parkway Behavioral Health Hospital, but often they just find solace in the comfort of knowing they’re not alone.\n\nIn other parts of the city, mental health professionals continue to help those struggling with the traumas of Oct. 1. Bridge Counseling, for example, cares for people who survived the shooting or were traumatized secondarily, like helping a struggling loved one.\n\nIn recent months, CEO David Robeck said, more survivors are coming in, especially first responders who might be feeling less shame or stigma about getting help.\n\n“We’re seeing more people who thought they had it under control but now realize they need help,” Robeck said.\n\nThat’s a common trauma response, according to Jordan Soper, a Henderson psychologist and secretary for the Nevada Psychological Association.\n\n“Many people are very resilient and will say, ‘I can do it myself with self-medication and avoidance and distraction,’” Soper said, adding that many people first seek help up to a decade after their trauma. “Over time, those avoidance techniques don’t have the same influence.”\n\nAnniversaries and holidays could cause those feelings to boil over, too, Soper said. She expects more survivors to reach out after this weekend’s memorials and events.\n\n“Being almost a year later, it still shocks me that things still come up,” one survivor said.\n\nIn the wake of the attack, UNLV researcher Stephen Benning conducted a study on Las Vegans who both were and were not at the festival.\n\nSix months later, he found that communitywide levels of post-traumatic stress and depression had returned to “normal,” but he couldn’t say the same for attendees.\n\n“About one-third of those in our sample still (showed) post-traumatic stress symptom levels consistent with PTSD,” Benning said.\n\nThe venue\n\nA year later, there’s no word on what, if anything, will happen to the Las Vegas Village grounds, where Route 91 took place.\n\nWill the festival ever come back to another location?\n\nShould it come back?\n\nConcert promoter Live Nation and MGM Resorts International, the two companies behind the festival, declined to comment about any future plans.\n\nEvents that once took place at the Village, like the iHeartRadio Music Festival’s annual outdoor show in September, have since moved down the Strip to the Las Vegas Festival Grounds, which MGM also owns.\n\n“I’m all for it coming back, especially for the people who truly love that event,” said William King, 39, a Route 91 survivor. “I think it would help out peoples’ hearts and minds.”\n\nAnother survivor, Jonathan Watkins, 26, said attending Route 91 again would be no riskier than getting in his car and navigating valley traffic.\n\n“I always rhapsodize about seeing Route 91 return in some form,” he said.\n\nAfter all, he said, a new tower was eventually built on the site of the Sept. 11, 2001, terrorist attack on the World Trade Center, “and people enter it every day.”\n\nA place to mourn\n\nA sweeping memorial also was built after the the twin towers were destroyed.\n\nIn Las Vegas, discussions about a Route 91 memorial remain in the early stages. Gov. Brian Sandoval announced in July that he would chair a committee to create one, but no further details have been released.\n\nDowntown, the Las Vegas Community Healing Garden will remain indefinitely.\n\nThe garden was organized and opened within a week of the attack. Since then, a more permanent wall honoring those killed has replaced the original.\n\nA committee made up of landscapers and nursery owners also selected a company, Get Outdoors Nevada, to manage the memorial. The company has experience maintaining parks and trails, Executive Director Mauricia Baca said.\n\n“This is a small project but a very impactful one, so there was an interest in having a group that was experienced,” Baca said.\n\nThe previous, temporary wall built out of wooden pallets was saved and stored, part of the collective memory of Oct. 1.\n\nMoney, money, money\n\nThe Las Vegas Victims’ Fund collected $31.4 million from donors between Oct. 2 and February.\n\nIn March, that money was distributed to 532 people, including relatives of those killed and people who were injured.\n\nThe Victims’ Fund included money that was donated through GoFundMe, the National Compassion Fund and an account at Nevada State Bank. The fund has since shut down.\n\nSeparately, the Nevada Victims of Crime program is helping with everything from medical bills to counseling costs, regardless of where survivors live. The only requirement is that applicants were at Route 91 when the attack occurred.\n\nThe program has received more than 5,300 applications for financial assistance related to the Oct. 1 shooting, which accounts for about a quarter of the people who were in attendance that night. The majority of those claims, 4,013, were filed within the first three months of the tragedy.\n\nBut it’s not too late: The deadline to apply is 11:59 p.m. on Oct. 1.\n\n“We are still extremely busy and expect to be for the foreseeable future,” program manager Rebecca Salazar said.\n\nCalifornia’s victims-of-crime program has been augmenting Nevada’s program, which means California residents were eligible for funding from both state’s programs.\n\nIn November, representatives of similar programs in Pennsylvania and New Mexico said they “potentially” would be able to augment Nevada’s program. But no other states ended up assisting, Salazar said.\n\nChanges in casino security\n\nAfter the attack, the security policies of Strip resorts were scrutinized, and executives grappled with how to enhance guest safety without diminishing the carefree appeal of a resort.\n\nDo you install metal detectors? Inspect bags? Check occupied rooms on a daily basis?\n\nResort officials do not generally comment on security strategy. But Mandalay Bay and other Strip casinos have made changes, former Las Vegas police Detective Phil Ramos said.\n\nThe properties have hired additional security staff, improved training, employed new high-tech equipment and increased ‘’low-level’’ guest profiling, he said.\n\nMGM Resorts also created an emergency response team to address security risks. At least nine former military and SWAT officers make up the new armed rapid-response unit, a study of LinkedIn profiles showed.\n\nRamos described it as a civilian SWAT team. Caesars Entertainment Corp. also has created such a team.\n\nStrip operators do not inspect arriving guest’s luggage , but some have tightened up policies regarding inspecting rooms if guests leave a “Do Not Disturb” sign on their door for more than 24 hours.\n\nGun control\n\nIn the days following the Las Vegas shooting, lawmakers filed a flurry of bills to ban bump stocks.\n\nThe Las Vegas gunman used the devices on 13 of his semiautomatic rifles, allowing them to fire rapidly like automatic weapons.\n\nPresident Donald Trump and congressional Republicans called for an administrative rule change through the Bureau of Alcohol, Tobacco, Firearms and Explosives to tighten regulations on bump stocks, a measure also endorsed by the National Rifle Association.\n\nA year after the shooting, the ATF has closed a public comment period on the matter and is expected to finalize its review of bump stock regulation by early next year. On Friday, the White House said it is moving forward with a proposed regulation to ban bump stocks.\n\nBipartisan legislation in the House and Senate to ban or tighten regulations on bump stocks is bottled up in committees, unlikely to be heard in the 115th Congress, which ends in early January when the 116th Congress is sworn in.\n\nBy contrast, congressional failure to address bump stocks in legislation has been picked up by states. Eight states have passed legislation to ban the devices. Nevada is not one of them, but some local retailers have stopped stocking them.\n\nGunshot detection\n\nIn November, the Metropolitan Police Department announced it would begin using ShotSpotter, acoustic technology that alerts authorities to gunshots.\n\nThe technology was first deployed in northeast valley neighborhoods as part of a pilot program, Capt. James LaRochelle told news media.\n\nHe said that the sensor system was not a result of Oct. 1, but that the department would examine the viability of installing similar sensors on the Strip and Fremont Street.\n\nSince then, though, no sensors have been installed at either location, said Metro Lt. Dori Koren, who works in Metro’s technical operations division.\n\nKoren said ShotSpotter is most valuable in neighborhoods with a high frequency of violence, improving police response times.\n\n“In comparison, we are not sure if the technology would be as valuable in preventing low frequency but high impact events such as mass attackers or sniper situations,” Koren said in a statement to the Las Vegas Review-Journal. “These types of events often occur in unique environments that are difficult to assess with any one technology solution. However, we are still evaluating the gunshot detection system, as well as other options for improving our ability to combat all forms of crime.”\n\nInvestigation\n\nIn August, Las Vegas police released a final report on the wide-reaching investigation, but investigators were unable to determine a motive. The shooter had no known connection or affiliation with any sort of extremist ideology, authorities have said.\n\nThe FBI is expected to release its own report sometime after the anniversary. Special Agent Aaron Rouse told the Las Vegas Review-Journal in December that the report will try to surmise motive, “which is what everybody wants to know.”\n\nHe said the FBI interviewed more than 400 people who knew or interacted with the gunman. He also said the agency has “various psychological and sociological experts” working the case.\n\n“As I sit here today, I believe that we are learning as much as we possibly can about why the subject did what they did,” Rouse said.\n\nContact Rachel Crosby at rcrosby@reviewjournal.com or 702-387-5290. Follow @rachelacrosby on Twitter. Contact Jessie Bekker at jbekker@reviewjournal.com or 702-380-4563. Follow @jessiebekks on Twitter. Review-Journal staff writers Jason Bracelin, Michael Scott Davidson, Nicole Raz, Gary Martin, Mike Shoro and Todd Prince contributed to this report.", "images": ["https://www.reviewjournal.com/wp-content/uploads/2020/04/13640140_web1_nlvcityhall.jpg?w=480&h=320&crop=1", "https://www.reviewjournal.com/wp-content/uploads/2020/04/13623575_web1_Metro.jpg?w=480&h=320&crop=1", "https://res.cloudinary.com/stephens-media/image/upload/v1538082179/RJ/ONE_YEAR_LATER.jpg", "https://www.reviewjournal.com/wp-content/uploads/2019/05/skyline_w_logo.png?w=410", "https://www.reviewjournal.com/wp-content/uploads/2018/09/11160309_web1_WILDART-HEALING-GARDEN-SEP05-18_090518kc_006.jpg", "https://www.reviewjournal.com/wp-content/uploads/2018/09/11160309_web1_SHOOT-ANNIV-OVERVIEW-SEP30-18-BH-006.jpg", "https://www.reviewjournal.com/wp-content/uploads/2018/09/11160309_web1_SHOOT-ANNIV-OVERVIEW-SEP30-18-BH-015.jpg", "https://www.reviewjournal.com/wp-content/uploads/2020/04/13641382_web1_Virus-Outbreak-Nevada-1-1-4.jpg?w=150&h=100&crop=1", "https://www.reviewjournal.com/wp-content/uploads/2020/04/13640796_web1_NEAVADA-FIRST_001.jpg?w=150&h=100&crop=1", "https://www.reviewjournal.com/wp-content/uploads/2020/04/13643485_web1_SPearson.jpg?w=480&h=320&crop=1", "https://www.reviewjournal.com/wp-content/uploads/2020/04/13627171_web1_brandon_coristine.jpg?w=480&h=320&crop=1", "https://www.reviewjournal.com/wp-content/uploads/2018/09/11160309_web1_SHOOT-ANNIV-OVERVIEW-SEP30-18-BH-002.jpg", "https://www.reviewjournal.com/wp-content/uploads/2020/04/2czNKa9I-1920.jpg?w=150&h=100&crop=1", "https://www.reviewjournal.com/wp-content/uploads/2018/09/11160309_web1_SHOOT-ANNIV-OVERVIEW-SEP30-18-BH-005.jpg", "https://www.reviewjournal.com/wp-content/uploads/2018/09/11160309_web1_SHOOT-ANNIV-OVERVIEW-SEP30-18-BH-007.jpg", "https://www.reviewjournal.com/wp-content/uploads/2020/04/LXsTulcE-1280.jpg?w=150&h=100&crop=1", "https://www.reviewjournal.com/wp-content/uploads/2018/09/11160309_web1_SHOOT-ANNIV-OVERVIEW-SEP30-18-BH-013.jpg", "https://www.reviewjournal.com/wp-content/uploads/2020/04/13613687_web1_jones.malik_-12.jpg?w=480&h=320&crop=1", "https://www.reviewjournal.com/wp-content/uploads/2018/09/11160309_web1_dewfef.jpg", "https://www.reviewjournal.com/wp-content/uploads/2020/04/13630190_web1_arana_jorge_final.jpg?w=480&h=320&crop=1", "https://www.reviewjournal.com/wp-content/uploads/2020/04/13615486_web1_Vailes1.jpg?w=480&h=320&crop=1", "https://www.reviewjournal.com/wp-content/uploads/2020/04/13644859_web1_mohave_sheriff.jpg?w=480&h=320&crop=1", "https://www.reviewjournal.com/wp-content/uploads/2018/02/rachel_crosby_3729839.jpg?w=100&h=100&crop=1", "https://www.reviewjournal.com/wp-content/uploads/2019/05/rj_logo_black_400.png", "https://www.reviewjournal.com/wp-content/uploads/2018/09/11160309_web1_SHOOT-ANNIV-OVERVIEW-SEP30-18-BH-004.jpg", "https://www.reviewjournal.com/wp-content/uploads/2018/09/11160309_web1_SHOOT-ANNIV-OVERVIEW-SEP30-18-BH-009.jpg", "https://www.reviewjournal.com/wp-content/uploads/2018/09/11160309_web1_SHOOT-ANNIV-OVERVIEW-SEP30-18-BH-001.jpg", "https://www.reviewjournal.com/wp-content/uploads/2020/04/13592191_web1_MACAO_IAG_001.jpg?w=150&h=100&crop=1", "https://res.cloudinary.com/stephens-media/image/upload/f_auto,q_auto/c_scale,w_900/v1538320256/RJ/SHOOT-ANNIV-OVERVIEW-SEP30-18-BH-011.jpg", "https://www.reviewjournal.com/wp-content/uploads/2018/09/11160309_web1_SHOOT-ANNIV-OVERVIEW-SEP30-18-BH-010.jpg", "https://www.reviewjournal.com/wp-content/plugins/rj/includes/../library/weather/darksky_icon/partly-cloudy-day.png", "https://www.reviewjournal.com/wp-content/uploads/2018/09/11160309_web1_SHOOT-ANNIV-OVERVIEW-SEP30-18-BH-016.jpg", "https://www.reviewjournal.com/wp-content/uploads/2019/02/rj_logo_black.png?w=400", "https://www.reviewjournal.com/wp-content/uploads/2018/09/11160309_web1_SHOOT-ANNIV-OVERVIEW-SEP30-18-BH-012.jpg", "https://www.reviewjournal.com/wp-content/uploads/2020/04/13645530_web1_Metro-Stock.jpg?w=480&h=320&crop=1", "https://www.reviewjournal.com/wp-content/uploads/2018/09/11160309_web1_SHOOT-ANNIV-OVERVIEW-SEP30-18-BH-003.jpg", "https://www.reviewjournal.com/wp-content/uploads/2020/04/13614022_web1_d_shores_shooting-1.jpg?w=480&h=320&crop=1", "https://www.reviewjournal.com/wp-content/uploads/2018/09/11160309_web1_SHOOT-ANNIV-OVERVIEW-SEP30-18-BH-014.jpg", "https://www.reviewjournal.com/wp-content/uploads/2018/09/11160309_web1_SHOOT-ANNIV-OVERVIEW-SEP30-18-BH-008.jpg"], "top_img": "https://www.reviewjournal.com/wp-content/uploads/2018/09/11160309_web1_dewfef.jpg", "keywords": [], "authors": ["Las Vegas Review-Journal"], "canonical_link": "https://www.reviewjournal.com/crime/shootings/1-year-after-las-vegas-shooting-survivors-still-seek-help/", "title": "1 year after Las Vegas shooting, survivors still seek help", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "google-site-verification": "AITU7N4mIKhMm3SZLODmtXsbFcjBhPEYsQ6t2-e38h8", "generator": "WordPress 5.4", "fb": {"pages": 57639415551}, "description": "One year after the worst mass shooting in modern U.S. history, the Las Vegas Review-Journal examined how the 10-minute attack changed the community. And how it didn’t.", "rj": {"id": "post_id-1490890", "paywall": "private"}, "og": {"site_name": "Las Vegas Review-Journal", "type": "article", "title": "1 year after Las Vegas shooting, survivors still seek help", "url": "https://www.reviewjournal.com/crime/shootings/1-year-after-las-vegas-shooting-survivors-still-seek-help/", "description": "One year after the worst mass shooting in modern U.S. history, the Las Vegas Review-Journal examined how the 10-minute attack changed the community. And how it didn’t.", "image": {"identifier": "https://www.reviewjournal.com/wp-content/uploads/2018/09/11160309_web1_dewfef.jpg", "width": 1050, "height": 700}}, "article": {"published_time": "2018-09-30T15:11:47+00:00", "modified_time": "2018-09-30T19:56:11+00:00"}, "twitter": {"card": "summary_large_image", "site": "@reviewjournal", "title": "1 year after Las Vegas shooting, survivors still seek help", "description": "One year after the worst mass shooting in modern U.S. history, the Las Vegas Review-Journal examined how the 10-minute attack changed the community. And how it didn’t.", "image": "https://www.reviewjournal.com/wp-content/uploads/2018/09/11160309_web1_dewfef.jpg"}, "msapplication-config": "https://www.reviewjournal.com/wp-content/themes/rjth2019/favicons/browserconfig.xml", "theme-color": "#ffffff", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1538320307.0, "source": "https://www.reviewjournal.com", "summary": ""}