{"url": "https://www.etonline.com/kuwtk-kim-kardashian-mocks-scott-disick-taking-bella-thorne-cannes-they-looked-so-desperate-90077", "text": "Scott Disick has never handled his breakup with Kourtney Kardashian particularly well, but on Sunday's Keeping Up With the Kardashians, viewers got a look at just how crazy their relationship drama can get.\n\nIn an effort to get out of Los Angeles and take in some foreign culture, Kourtney decided to fly to France for the annual Cannes Film Festival, where she'd also get a chance to enjoy an idyllic getaway with her new man, Younes Bendjima.\n\nBut for Scott, the trip seemed to be more of a slap in the face, and he went a little too far with his reaction to the news that Kourtney was going on a romantic getaway.\n\n\"We got into like, a full war,\" Kourtney revealed to her sisters, Kim and Khloe Kardashian, recounting a series of phone calls and text message conversations the former couple had recently had.\n\nWATCH: 'KUWTK': Scott Disick Admits He's Been 'Out of Control' in the Past, Kourtney Kardashian Moves On\n\n\"He was like, 'You're gonna have a great time,'\" Kourtney said, imitating Scott's sarcastic tone. \"And then he's threatening me now. He's like, 'Your little friend is gonna get beat up every single day when we're there.' He goes, 'Enjoy yourself. Walking around, you better watch your back.'\"\n\n\"'I'm like, 'Oh, are you gonna have people attack me?'\" she continued. \"And he's like, 'You're the love of my life. Why would I have anyone attack you?... Just don't expect anywhere you go will be easy now.'\"\n\nThese threats were not something Kourtney was willing to put up with, and the 38-year-old reality star put her foot down.\n\n\"I said, 'I will actually never speak to you again with your threats, you psychopath,'\" she shared. \"'If you threaten me and my friends, it's over. That's not how I will be treated. You've treated me horrible for years.'\"\n\nNEWS: 'KUWTK': Scott Disick Says He's 'Jealous' of Kourtney's Partying\n\nAccording to Kourtney, Scott also messaged her saying, \"Anyone who gets in the middle [between us] will not be pleased with the outcome.\"\n\nIn a separate interview with the KUWTK cameras, Kim and Khloe said that Scott's behavior surprised them, even after all the drama he's stirred up in the past.\n\n\"I just can't believe that he would stoop this low and speak to her like this,\" Khloe said. \"At the end of the day, she's still the mother of his children. So to say that he's gonna have people get beat up? That's disgusting. So I really hope he was out of his right mind… It's just so childish.\"\n\nScott and Kourtney share three young children -- 7-year-old son Mason, 5-year-old daughter Penelope and 2-year-old son Reign -- and while Scott has been pining for her since their split in July 2015, his reckless and demanding behavior has been a source of drama between the two for years.\n\nWATCH: Scott Disick Says He Still Hits on Kourtney Kardashian 'About Once a Week,' But Will They Ever Reconcile?\n\nAfter he seemingly ignored several of Khloe's phone calls, Scott did sit down for a solo interview with the show, and admitted that he went too far with his intimidating remarks.\n\n\"You know, when Kourtney was telling me that she was going, she was kinda being a drop condescending and I think I got defensive, and just said, like, 'OK great, if you're gonna be in Cannes with another guy, have fun, but just know that it's probably not gonna be that fun if you run into me and my friends,'\" Scott shared.\n\n\"The fact of the matter is she's allowed to live her life. She's a single girl and obviously we all know that I do what I want so she should be able to do what she wants,\" he continued. \"But there's a lot of anger. Like, wow, it's really real, us not being together.\"\n\nNEWS: Kardashian Family Reportedly Re-Signs With E! For $150 Million\n\nLater in the episode, as Kourtney and sister Kendall Jenner were getting ready to head to France, Khloe finally got through to Scott, who admitted that he had made a mistake.\n\n\"It's just hard, you know? I never thought I'd go through anything like this,\" he said over the phone.\n\nScott and Khloe, who have always been close friends, sat down together for the KUWTK cameras and Scott acknowledged that he \"was acting a bit immature.\"\n\n\"I said a few things that weren't appropriate,\" he said. \"I'm not gonna regret that, because it was like, that's how I felt at the time. You can understand that we have a lot of history. So it's hard.\"\n\nPHOTOS: The Kardashian Family's Famous Exes\n\nUltimately, Scott did stop sending Kourtney texts threatening her boyfriend, but that didn't stop him from heading out to Cannes to party as well. The reality star made headlines and sparked romance rumors when he flew to the French vacation destination with then-19-year-old actress Bella Thorne.\n\nHowever, Kim thought Scott was only spending time with Bella in an attempt to get back at Kourtney for her relationship with Younes, scoffing at the unfolding drama when Kendall called her and mom Kris Jenner from Cannes.\n\n\"[Scott and Bella] looked so desperate at the airport, like, who goes to LAX together?\" Kim said, with Kendall on speakerphone. \"It's not a good look for Scott, at all.\"\n\n\"He talked to me about it. He thinks it is,\" Kendall explained. \"He was like, 'I'm doing it to make Kourtney mad.\"\n\nWATCH: Kourtney Kardashian Slams Scott Disick, Says 'He Needs to Get a F**king Life'\n\n\"I think it's clear to everyone that Scott is doing this just to try to one-up Kourtney, and that seems super malicious,\" Kim reflected. \"Kourtney is genuinely trying to go away and have a good time and he's trying to like, freak her out and make Kourtney think that there's gonna be some crazy drama running. It's just so ridiculous.\"\n\nWhile Kourtney spent time on a yacht with her boyfriend in Cannes, Scott was spotted getting friendly with a number of women other than Bella.\n\nIn the few days that he was in France, Scott was spotted spending time with 18-year-old Sofia Richie, 19-year-old British model Ella Ross and his former fling Chloe Bartoli, among others. He was also photographed kissing an unknown brunette woman.\n\nWATCH: Scott Disick and Bella Thorne Kiss Poolside While Kourtney Kardashian Jumps on Jet Ski With Younes Bendjima\n\n\"It's all a jealousy thing.\" Kourtney said, before introducing Khloe and Kris to her new boyfriend for the first time.\n\nKhloe was clearly impressed by Younes' physique, but the conversation quickly turned back to Scott's attempts get a reaction out of Kourtney.\n\n\"To me, I feel like I'm watching a ping-pong match,\" Khloe quipped.\n\n\"Yeah, but it's weird because I'm, like, not in the tournament,\" Kourtney replied.\n\nWATCH: Kourtney Kardashian and Younes Bendjima Continue Their Paris PDA -- See the Pics!\n\nKourney didn't let Scott get to her, and she ended up having a fun time partying with her boyfriend, which she said made it one of the first times she was \"really able to have an amazing time and not be worried about what [Scott] was up to.\"\n\n\"I'm not trying to throw anything in anyone's face,\" she said in a solo interview at the end of the episode. \"But I'm also not gonna hide.\"\n\nFor more on Scott's wild week at the Cannes Film Festival in May, check out the video below.\n\nScott Disick Gets Cozy With 2 More Women in Cannes After Bella Thorne and Ex Chloe Bartoli This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRelated Gallery", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/et_bellascott_103017.jpg?h=e2317ce8&itok=aMGqgxtB", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2016-10/1280_khloe_kardashian_lamar_odom_reggie_bush_kim_kardashian_2pic.jpg?itok=XOeuaIFg", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/rupauls_drag_race__E_1208_droop_sneak_1920x1080.jpg?h=70217200&itok=U94nGmuG", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/gettyimages-692085362.jpg?h=c673cd1c&itok=TnqSx9El"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/et_bellascott_103017.jpg?h=e2317ce8&itok=aMGqgxtB", "keywords": [], "authors": ["Zach Seemayer"], "canonical_link": "https://www.etonline.com/kuwtk-kim-kardashian-mocks-scott-disick-taking-bella-thorne-cannes-they-looked-so-desperate-90077", "title": "'KUWTK': Kim Kardashian Mocks Scott Disick for Taking Bella Thorne to Cannes: 'They Looked So Desperate'", "meta_data": {"article": {"opinion": "false"}, "title": "'KUWTK': Kim Kardashian Mocks Scott Disick for Taking Bella Thorne to Cannes: 'They Looked So Desperate' | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/kuwtk-kim-kardashian-mocks-scott-disick-taking-bella-thorne-cannes-they-looked-so-desperate-90077", "title": "'KUWTK': Kim Kardashian Mocks Scott Disick for Taking Bella Thorne to Cannes: 'They Looked So Desperate'", "description": "The drama between Kourtney and Scott got more heated than ever when Scott tried to threaten his ex's new man on Sunday's 'Keeping Up With the Kardashians.'", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/et_bellascott_103017.jpg?h=e2317ce8&itok=aMGqgxtB", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "The drama between Kourtney and Scott got more heated than ever when Scott tried to threaten his ex's new man on Sunday's 'Keeping Up With the Kardashians.'", "title": "'KUWTK': Kim Kardashian Mocks Scott Disick for Taking Bella Thorne to Cannes: 'They Looked So Desperate'", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Zach Seemayer‍", "url": "https://www.etonline.com/kuwtk-kim-kardashian-mocks-scott-disick-taking-bella-thorne-cannes-they-looked-so-desperate-90077", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/et_bellascott_103017.jpg?h=e2317ce8&itok=aMGqgxtB"}, "description": "The drama between Kourtney and Scott got more heated than ever when Scott tried to threaten his ex's new man on Sunday's 'Keeping Up With the Kardashians.'", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "TV, News, Scott Disick, Kourtney Kardashian, Kim Kardashian, Khloe Kardashian, Kris Jenner, Kendall Jenner, Bella Thorne, Sofia Richie, Keeping Up With The Kardashians, Younes Bendjima", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}