{"url": "https://www.bustle.com/p/the-real-housewives-of-new-jersey-reunion-includes-accidental-phone-call-from-ramona-singer-7870981", "text": "Those who watched Real Housewives of New Jersey Season 8 know the reunion is going to be super dramatic. Based on the recently released trailer, that's definitely true, but, believe it or not, a certain Real Housewives of New York City star makes a surprise appearance and totally steals the spotlight. Just who is it? The RHONJ Season 8 reunion features Ramona Singer. Oh, yes, the woman also known as \"The Apologizer\", interrupts the madness of the RHONJ (executive producer: Lucilla D'Agostino) reunion and it is uh-mazing.\n\nTo be clear, she doesn't actually show up in person, but makes a cameo via phone. That may sound disappointing, but it's still beyond satisfying. As Housewives fans know, one of the cardinal rules of reunion filming is \"no phones allowed.\" Well, Melissa Gorga apparently forgot to put her phone on silent, because, as seen in the trailer, it starts to vibrate and she gets quite the look of disapproval from host Andy Cohen. \"I put it on airplane mode,\" Melissa promises him.\n\nMelissa hands the phone to Andy, and he asks, \"Is this Ramona Singer?\" He, of course, answers and puts it on speaker. He says, \"Ramona!\" To that, Ramona answers with such attitude, \"Yes, whom am I speaking with?\" Andy responds, \"You're speaking with Andy Cohen.\" Ramona is shocked and says, \"Oh my God, Andy! Why are you answering the phone?\" Then, he delivers the best answer ever: \"Because, we're in the middle of the f*cking Jersey Housewives reunion.\" (The full trailer can be viewed here.)\n\nIt's not made clear why Ramona is calling Melissa at that moment, but they are friends. They've posted a lot of Instagrams together and they've also partied together a few times. Based on an Instagram Ramona shared in November 2016 with herself, Melissa, and Dorinda Medley, it appears they've been friends for awhile now. She captioned it, \"Two of my favs.\" It also seems like Ramona has a relationship with Teresa Giudice, because they and Melissa grabbed a bite to eat in May 2017.\n\nWhatever type of relationship they have, it's one that Ramona feels comfortable enough calling Melissa. Thank goodness they are close, because otherwise Ramona never would've interrupted the reunion like she so wonderfully did. Also, Melissa deserves some praise for leaving her phone on vibrate or fans probably would've never seen Andy yelling at Ramona — and giving Melissa major side-eye.\n\nIn addition to Ramona's phone call, the RHONJ reunion looks like one for the books. There is a lot of screaming, but especially between Margaret Josephs and Siggy Flicker, who have been at odds pretty much since day one. At one point, they even argue about their foyers. Yes, their foyers! It's ridiculous as it sounds. As Melissa yells, \"Oh, my God, we're talking about motherf*cking foyers!\"\n\nThen, the \"old\" Teresa comes out as soon as Kim DePaola, aka Kim D., enters the room. Did you really think Kim D. would stay away? Andy tells Teresa, \"Don't get off that couch.\" She promises she won't, but, oh, yeah, she definitely does. Fans remember what happened that one time Teresa got off the couch at the Season 2 reunion. Yeah, Andy ended up being collateral damage.\n\nThe Season 8 reunion definitely looks like it's going to be epic. Yes, there is all the expected drama, but it's Ramona's unexpected phone call that takes it up a level. There seems to be more to the phone call than what's shown, so fans will have to wait until the reunion airs Wednesday, Jan. 17 at 9 p.m. ET on Bravo to see how it all goes down.", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/14/efcd4f59-9964-4c6d-a6ad-4634b0b09f8a-getty-1156675580.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2020/4/14/1da7b35e-7e55-4806-af9d-3280aa32eb53-getty-1173358504.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/1/12/92895f5c-ca1f-4740-b7af-8510cfdd4b0a-rhonj-s8-reunion-andy-melissa-ramona.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/15/37f4f60e-5d87-4523-9a7d-39f782b3c0e4-getty-1209799355.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/15/0da7790c-e1c6-4938-8b28-31640686b33f-getty-1209799362.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/1/12/92895f5c-ca1f-4740-b7af-8510cfdd4b0a-rhonj-s8-reunion-andy-melissa-ramona.png?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/1/12/92895f5c-ca1f-4740-b7af-8510cfdd4b0a-rhonj-s8-reunion-andy-melissa-ramona.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/the-real-housewives-of-new-jersey-reunion-includes-accidental-phone-call-from-ramona-singer-7870981", "title": "The ‘Real Housewives Of New Jersey’ Reunion Includes An Accidental Phone Call From Ramona Singer", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/the-real-housewives-of-new-jersey-reunion-includes-accidental-phone-call-from-ramona-singer-7870981", "type": "article", "title": "The ‘RHONJ’ Reunion Features An Amazing Accidental Phone Call From Ramona Singer", "description": "Those who watched Real Housewives of New Jersey Season 8 know the reunion is going to be super dramatic. Based on the recently released trailer, that's definitely true, but, believe it or not, a certain Real Housewives of New York City star makes a…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/1/12/92895f5c-ca1f-4740-b7af-8510cfdd4b0a-rhonj-s8-reunion-andy-melissa-ramona.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Those who watched Real Housewives of New Jersey Season 8 know the reunion is going to be super dramatic. Based on the recently released trailer, that's definitely true, but, believe it or not, a certain Real Housewives of New York City star makes a…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}