{"url": "https://www.romper.com/p/what-are-kylie-jenners-nicknames-for-stormi-travis-scott-theyre-pretty-adorable-9789736", "text": "In a video released by GQ on Tuesday, Kylie Jenner quizzed her boyfriend, Travis Scott, with several questions about herself. One of the questions she asked was \"What nickname do we call Stormi?\" In case you don't keep up with the Kardashians, Stormi is Jenner and Scott's infant daughter. Kylie also asked, \"What's one of the nicknames I call you?\" So, what are Kylie Jenner's nicknames for Stormi and Travis Scott? They're actually pretty cute.\n\nIn a joint video interview for GQ, Kylie quizzed Scott on everything from her family, to how many tattoos she has, to her favorite color, and more. It was basically an adorable test of how well the rapper knows his makeup empire businesswoman girlfriend, and to his credit, he got 20 out of 23 questions correct in the end.\n\nSpecifically, Kylie asked Scott what they call their 5-month-old daughter, Stormi Webster, as a nickname. And apparently, the famous couple has more than one nickname for the baby girl. Scott and Kylie both came up with Storm Storm, Burrito, and Peanut, as Us Weekly reported. Nothing out of the ordinary as a nickname for a little girl named Stormi, but adorable nonetheless.\n\nNot about to leave the rapper out of the nickname reveal fun, in the video below, Kylie also asked Scott, \"What's one of the nicknames I call you?\"\n\nGQ on YouTube\n\nScott initially struggled with the answer, and Kylie admitted, \"I don't really call you any nicknames.\" \"Yea,\" Scott replied, \"You just call me baby.\"\n\nHowever, Scott then added that Kylie calls him \"Daddy\" sometimes, with a quick smirk at the camera. Kylie laughed it off, but she didn't deny the nickname.\n\nInitially, some fans thought Stormi actually was a nickname, and maybe short for something else. But the official name listed on the baby's birth certificate is Stormi Webster, according to ELLE. Her surname is the same as her father's — Scott's real name is actually Jacques Bermon Webster II.\n\nIn an Instagram post back in April, Kylie called her daughter \"angel baby,\" but that doesn't mean it's a usual nickname she uses for her baby girl. If there are other nicknames Kylie and Scott use for Stormi besides Storm Storm, Burrito, or Peanut, they haven't shared them with the public.\n\nInterestingly enough, Kylie's sister, Khloé Kardashian also calls her daughter True Thompson \"Peanut,\" according to E! News. The truth is, it's really not that uncommon a nickname for a baby (I personally have several mom friends who use it for their kids, boy or girl).\n\nKylie's sister, Kourtney Kardashian, has three kids: Mason, Penelope, and Reign. But we don't know if any of their nicknames are Peanut as well. Same with her sister Kim Kardashian West's children, North, Saint, and Chicago. Brother Rob Kardashian has just one little girl, Dream, and sister Kendall Jenner doesn't have any kids who could have a nickname like Peanut in the first place.\n\nIn the GQ interview, Kylie and Scott covered a lot of other topics besides nicknames as well. Scott, for instance, didn’t remember the names of three of Kylie's dogs when he was asked, according to Cosmopolitan. Oops.\n\nBut he did know the location of Jenner’s biggest scar — her left leg. Scott also knew how long it takes Kylie to do her makeup (two hours) and her favorite color (black), according to Us Weekly. He also remembered her biggest craving while she was pregnant, which was In-N-Out Burger.\n\nBut in a longer profile of Kylie and Scott for GQ, Kylie revealed that Scott actually doesn't like the attention that her whole family seems to attract, so there's probably a lot of things about them and their relationship he's just chosen not to reveal to the public. That might just include more nicknames that Kylie has for their daughter, or for Travis Scott himself.", "images": ["https://imgix.bustle.com/uploads/image/2018/7/17/7f54bb3b-028d-4a82-acc0-98c284f9d1be-screen-shot-2018-07-17-at-30102-pm.png?w=960&h=540&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/9/68c997a3-93e3-41e2-b6de-0f2dc95adf2c-screen-shot-2020-04-09-at-13106-pm.png?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.romper.com/uploads/image/2018/7/17/5e599226-56ce-4538-bed1-4baf8db90dce-unnamed-1.png?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/6/2b4b42d3-4475-4d32-af08-89bbe2575aa3-getty-1200433192.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/6/15155e54-1e2c-439c-870e-2ae9587ae2e8-getty-1169525359.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=932972280084675&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2018/7/17/7f54bb3b-028d-4a82-acc0-98c284f9d1be-screen-shot-2018-07-17-at-30102-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/7/17/7f54bb3b-028d-4a82-acc0-98c284f9d1be-screen-shot-2018-07-17-at-30102-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.romper.com/p/what-are-kylie-jenners-nicknames-for-stormi-travis-scott-theyre-pretty-adorable-9789736", "title": "What Are Kylie Jenner's Nicknames For Stormi & Travis Scott? They're Pretty Adorable", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@romper", "card": "summary_large_image"}, "og": {"site_name": "Romper", "url": "https://www.romper.com/p/what-are-kylie-jenners-nicknames-for-stormi-travis-scott-theyre-pretty-adorable-9789736", "type": "article", "title": "Kylie Jenner & Travis Scott Revealed Baby Stormi's Super Cute Nicknames", "description": "In a video released by GQ on Tuesday, Kylie Jenner quizzed her boyfriend, Travis Scott, with several questions about herself. One of the questions she asked was \"What nickname do we call Stormi?\" In case you don't keep up with the Kardashians,…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/7/17/7f54bb3b-028d-4a82-acc0-98c284f9d1be-screen-shot-2018-07-17-at-30102-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 510210782483125}, "description": "In a video released by GQ on Tuesday, Kylie Jenner quizzed her boyfriend, Travis Scott, with several questions about herself. One of the questions she asked was \"What nickname do we call Stormi?\" In case you don't keep up with the Kardashians,…"}, "movies": [], "publish_date": null, "source": "https://www.romper.com", "summary": ""}