{"url": "www.thesun.co.uk/news/3856958/next-line-throne-prince-harry-royal-family-charles-king/", "text": "QUEEN Elizabeth II is the longest reigning monarch in British history, having served the country for an amazing 65 years.\n\nBut with Prince Charles next in line to the throne, who will reign after him and where does baby Archie appear on the family tree?\n\n8 The Queen is the longest reigning monarch in the history of Great Britain Credit: News Group Newspapers Ltd\n\nWho is next in line to the throne?\n\nThe throne will pass on to Prince Charles if the Queen abdicates, retires or dies.\n\nAccording to reports, abdication could be a real possibility.\n\nHer Majesty is said to have told her inner circle that if she is still on the throne at the age of 95, she will ask for a piece of legislation to grant her eldest son full power to reign while she is alive.\n\nRoyal commentator Robert Jobson told the Mail On Sunday he has spoken to a number of high-ranking courtiers who say preparations for the transition of the Crown are gaining pace.\n\n8 Prince Charles is the next in line to the throne Credit: PA:Press Association\n\nAnd at the 2018 Commonwealth Heads of Government meeting, the Queen said she wished for Charles to succeed her as head of the group of countries.\n\nNext in line after Charles is eldest son Prince William, the Duke of Cambridge, and then his children Prince George, Princess Charlotte and Prince Louis.\n\nPrince Harry - who was third in line to the throne in 2013 - is now sixth in line.\n\n8\n\nWhere does Prince Harry and Meghan's royal baby boy come in the royal line of succession?\n\nArchie Harrison Mountbatten-Windsor, born on May 6, 2019, is seventh place in the queue for the throne, bumping Prince Andrew, the Duke of York down to eighth place.\n\nThis moves Princess Beatrice and Eugenie down to ninth and tenth respectively.\n\nBut who was dropped from the top ten?\n\nPrince Edward, Earl of Wessex, lost his top ten seat.\n\n8 Meghan and Harry christened their baby boy Archie on July 6 Credit: PA:Press Association\n\nHow does royal succession work?\n\nThe rules of royal succession have changed significantly in recent years.\n\nLeaders of 16 British Commonwealth countries (including Australia, Canada, New Zealand and Jamaica) voted in 2011 to alter the centuries-old tradition to include daughters as well as sons.\n\nPreviously daughters could only inherit the throne if there were no living sons.\n\nThe line of succession SOVEREIGN\n\n1. The Prince of Wales (Prince Charles)\n\n2. The Duke of Cambridge (Prince William)\n\n3. Prince George of Cambridge\n\n4. Princess Charlotte of Cambridge\n\n5. Prince Louis of Cambridge\n\n6. Prince Henry of Wales (Prince Harry)\n\n7. Archie Harrison Mountbatten-Windsor\n\n8. The Duke of York (Prince Andrew)\n\n9. Princess Beatrice of York\n\n10. Princess Eugenie of York\n\n11. The Earl of Wessex (Prince Edward)\n\n12. James, Viscount Severn\n\n13. The Lady Louise Mountbatten-Windsor\n\n14. The Princess Royal (Princess Anne)\n\n15. Mr Peter Phillips\n\n16. Miss Savannah Phillips\n\n17. Miss Isla Phillips\n\nSource: www.royal.uk/succession\n\nThis system, which dated back 300 years, is based on the rules of primogeniture which gives preference to the firstborn male heirs of a king or queen.\n\nThis change in royal succession means Princess Charlotte, as William and Kate's daughter, is ahead of her younger brother.\n\nPreviously if the third child was male he would leap the princess in the line of succession.\n\nThis new rule only takes into account children born after 2011, meaning Prince Edward's youngest child, James, born in 2007, is ahead of his older sister, Louise, born in 2003.\n\n8 Baby Archie was introduced to the world two days after he was born on May 6 - he is seventh in line to the throne Credit: PA:Press Association\n\nCan the monarch marry a Catholic?\n\nCommonwealth leaders also decided in 2011 to remove the rule that no heir could assume the throne if he or she married a Roman Catholic.\n\nThen Prime Minister David Cameron said at the time: “The idea that a younger son should become monarch instead of an elder daughter, simply because he is a man just isn’t acceptable anymore.\n\n\"Nor does it make any sense that a potential monarch can marry someone of any faith other than Catholic.\n\n“The thinking behind these rules is wrong.\"\n\nThe Roman Catholic rule can be traced to the 16th-century reign of Henry VIII.\n\nThe King broke with the Roman Catholic Church so he could divorce his wife, Queen Catherine, and marry Anne Boleyn after the Pope refused his divorce request.\n\n8\n\nThe changes, under the Succession to the Crown Act 2013, came into force in March 2015 but apply to people born after October 28, 2011.\n\nLive Science reported that because one of the duties of the British monarch is to head the Church of England, no Roman Catholic can hold the crown.\n\nThe basis for the succession was determined in the 17th century.\n\nWhen James II fled the country in 1688, Parliament held that he had \"abdicated the government\" and that the throne was vacant.\n\nThe throne was then offered, not to James's young son, but to his daughter Mary and her husband William of Orange, as joint rulers, following the \"Glorious Revolution\".\n\n8 Prince William with his son Prince George, then two, snapped after the Christening of Princess Charlotte on July 5, 2015 Credit: Getty Images\n\nWill Prince Charles step aside and let Prince William become King?\n\nAt 70-years-old, Prince Charles is the longest-serving heir in UK history - having been first in line from the age of three - and would become the oldest ever British monarch to take the throne.\n\nSome royalists have argued that Prince Charles should step aside to allow Prince William to become King because he enjoys better approval ratings with the public based on a 2016 poll.\n\nPrince Charles has faced controversy over his divorce from Princess Diana and his affair during their marriage with now-wife Camilla, the Duchess of Cornwall.\n\nHe has also been accused of “meddling” in politics by stating his opinion on issues like the environment and farming, alternative medicine and architecture in private letters to Government ministers.\n\nIn 1936, Edward VIII - the Queen's uncle - famously abdicated after less than a year on the throne so he could marry divorcee Wallis Simpson.\n\n8 Prince Harry has said that the country still needs the 'magic' of the monarchy Credit: Getty Images - WireImage\n\nWhat has Prince Harry said about becoming King?\n\nPrince Harry says no royal wants to be King or Queen — but they would do it for “the greater good”.\n\nThe 34-year-old said: “Is there any one of the Royal Family who wants to be king or queen?\n\n\"I don’t think so, but we will carry out our duties at the right time.”\n\nHe told Newsweek magazine: “We are involved in modernising the British monarchy.\n\n\"We are not doing this for ourselves but for the greater good of the people.”\n\nAnd he insisted the royals were still vital, adding: “We don’t want to dilute the magic.\n\n“The British public and the whole world need institutions like it.”\n\nlatest on the royals HEIR THIS Meghan hints at having second baby as 'she wants a pint-sized buddy' for Archie Exclusive ROYAL HIKENESS Meghan and Harry hike in LA lockdown with their faces covered by bandanas SCHOOL'S NOT OUT Kate ‘guilty’ about homeschool lie she told George & Charlotte over Easter fund of him Captain Tom Moore hails 'my super Prince' as Will honours 'fundraising machine' 'INCREDIBLE' Harry and Meg hailed after secretly delivering free meals to the needy in LA BIG DAY DASHED Princess Beatrice's wedding 'officially cancelled' due to coronavirus crisis PALACE PRESENT Celebs & fans call for nation to sing Happy Birthday to Queen on Tuesday GIVING BACK Mum who joined 'lovely' Prince Harry on video call says 'it came at right time' IMAJ-INE THAT Queen’s baths are only 7 inches deep & measured precisely by member of staff GIVING BACK Harry & Meghan pledge £90,000 to a hunger charity during the Coronavirus crisis\n\nWhy could Prince Philip never become King?\n\nThe long-serving royal has stepped back from a public role after 65 years of royal duties.\n\nHis final solo engagement was The Captain General’s Parade in August 2017, when he saluted the Royal Marines at Buckingham Palace.\n\nDue to English common laws, he cannot become king.\n\nThe wife of a king is known as a Queen Consort, and takes the title of Queen – although she doesn’t rule as the monarch.\n\nBut if a female royal marries a man with a title below her own - as in the case of Queen Elizabeth and Prince Philip - she will retain the title while her husband will not be entitled to it.\n\nHe is known as Prince Consort.", "images": ["data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.5 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.5 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.3 1\"%3E%3C/svg%3E", "http://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.7 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.8 1\"%3E%3C/svg%3E", "https://i1.wp.com/www.thesun.co.uk/wp-content/uploads/2019/05/NINTCHDBPICT000503033753.jpg?crop=2080px%2C340px%2C3151px%2C2100px&resize=1200%2C800&ssl=1", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.6 1\"%3E%3C/svg%3E", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg"], "top_img": "https://i1.wp.com/www.thesun.co.uk/wp-content/uploads/2019/05/NINTCHDBPICT000503033753.jpg?crop=2080px%2C340px%2C3151px%2C2100px&resize=1200%2C800&ssl=1", "keywords": [], "authors": ["Lauren Bell", "Paul Harper"], "canonical_link": "https://www.thesun.co.uk/news/3856958/next-line-throne-harry-megan-archie/", "title": "Who’s next in line to the throne, where is baby Archie in the royal succession and when will Charles be King?", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Here's where Harry and Meghan's newborn will fit into the royal line of succession", "url": "https://www.thesun.co.uk/news/3856958/next-line-throne-harry-megan-archie/", "description": "QUEEN Elizabeth II is the longest reigning monarch in British history, having served the country for an amazing 65 years. But with Prince Charles next in line to the throne, who will reign after hi…", "site_name": "The Sun", "image": {"identifier": "https://i1.wp.com/www.thesun.co.uk/wp-content/uploads/2019/05/NINTCHDBPICT000503033753.jpg?crop=2080px%2C340px%2C3151px%2C2100px&resize=1200%2C800&ssl=1", "width": 1200, "height": 800}, "locale": "en_GB"}, "article": {"published_time": "2019-07-29T19:24:09+00:00", "modified_time": "2019-07-29T19:29:41+00:00", "publisher": 161385360554578, "tag": "Archie Harrison Mountbatten-Windsor, Meghan Markle, Prince Charles, Prince Harry, Prince Louis, Prince William, The Queen, Explainers, Royal Family", "author": "https://www.facebook.com/thesun"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "description": "The line of royal succession has reshuffled since Prince Harry and Meghan have announced the birth of their son Archie", "keywords": "Prince Charles, the Queen, Royal Family, Prince William, line of succession, Meghan, Harry, pregnant, baby, future king, future queen, royal blood", "news_keywords": "Prince Charles, the Queen, Royal Family, Prince William, line of succession, Meghan, Harry, pregnant, baby, future king, future queen, royal blood", "twitter": {"text": {"title": "Who’s next in line to the throne, where is baby Archie in the royal succession and when will Charles be King?"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "BORN TO SUCCEED", "headline": "Here's where Harry and Meghan's baby will fit into the line of succession", "image": {"medium": "https://i1.wp.com/www.thesun.co.uk/wp-content/uploads/2019/05/NINTCHDBPICT000503033753.jpg?crop=2126px%2C355px%2C2986px%2C1993px&resize=300%2C192&ssl=1", "large": "https://i1.wp.com/www.thesun.co.uk/wp-content/uploads/2019/05/NINTCHDBPICT000503033753.jpg?crop=2126px%2C355px%2C2986px%2C1993px&resize=620%2C413&ssl=1"}}, "parsely-post-id": 3856958, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1564428249.0, "source": "http://www.thesun.co.uk", "summary": ""}