{"url": "https://people.com/tv/dancing-with-the-stars-season-25-winner-jordan-fisher/", "text": "Dancing with the Stars has crowned its season 25 winner!\n\nOn Tuesday night, Jordan Fisher, Lindsey Stirling and Frankie Muniz went head-to-head on the season finale of the reality dancing competition series, but it was Fisher who was victorious and took home the coveted Mirrorball Trophy after earning overall perfect scores for his final two dances. Stirling was runner-up and Muniz was second runner-up.\n\nGet push notifications with news, features and more.\n\nSpeaking moments after his big win, Fisher was lost for words to describe what it felt like to win, but had plenty to say about his partner Lindsay Arnold.\n\nImage zoom Eric McCandless via Getty Images\n\n“We’re both just sort of blinded and perma-smile and stoked about everything right now,” Fisher, 23, said.\n\n“There aren’t words you can use to express — there’s something about putting in 12 weeks of work and time and energy and blood and sweat and tears into something and being rewarded like this at the end of the day,” he continued.\n\n“The Mirrorball is so amazing. This is so freaking cool. But the coolest part is having what we got to establish, a bond and trust and love for each other that exceeds so much in life and that’s a thing that I’m taking away from this for sure.”\n\nHe plans to put his trophy in the center of his family’s Thanksgiving table.\n\nIt is also the first Mirrorball Trophy win for Arnold, who has competed as a pro dancer since season 16.\n\nCalling winning “insane’, Arnold praised her celebrity partner. “It’s beyond anything I could have ever imagined. I’ve come close and to finally take it with Jordan means more than I could ever say,” she said.\n\nImage zoom David Livingston/Getty Images\n\nImage zoom Adam Rose via Getty Images\n\nFisher suffered a scratched cornea two weeks ago and Arnold has injured her leg so badly it was feared she would have to drop out of the competition.\n\nThe actor said the lead up to the final had been very hard going. “Yesterday was definitely one of the hardest days I’d say after our crazy team fall apart injury day between the knee and the eye that was rough,” he said after his win.\n\n“I think that yesterday was a day when we both realized we just had to leave it all on the floor and that was going to be one of those moments that really counted and today was kind of about figuring out how to be as zen and calm as possible and realize that it’s out of our hands and hopefully America saw our journey and was a part of it and supported us and voted for us and they did!”\n\nImage zoom Eric McCandless via Getty Images\n\nBut their hard work paid off in the end.\n\n“Your skills are just ridiculously out of this world. But what’s amazing is you’re an incredible dancer, an incredible performer, but what I’ve noticed the most that makes you stand out to me is what you’ve done with Lindsay,” judge Carrie Ann Inaba said after Fisher’s final number. “Lindsay has actually grown as a pro with you and that is a testament to you. You are spectacular. And Lindsay, you made him spectacular.”\n\nHead judge Len Goodman also praised Fisher’s talent and dancing skills: “I think you are the most complete male celebrity ever on Dancing with the Stars.”\n\nAlthough 23-year-old Fisher was the front-runner all season, Goodman admitted ahead of the finale that he had “no clue” who would be named champion.\n\nImage zoom Eric McCandless via Getty Images\n\n“This is becoming the war on the floor because I’m so excited about tomorrow evening because I have no clue who’s going to win! It’s just become a fantastic competition,” Goodman said after Stirling performed her freestyle dance Monday, when she earned two perfect scores.\n\nFisher, who previously starred in Hamilton and Grease Live!, admitted earlier in the season that he credits actor Corbin Bleu for inspiring him to pursue a career in the entertainment industry.\n\nBleu, who was the runner-up on season 17 of the ABC show, was paired with Fisher and Arnold for their Trio Night salsa number.\n\n“From career to the look to the personality, it’s kind of like looking in a mirror. I remember watching High School Musical, he came on and I was like, ‘Whoa! He looks like me! I’ve never seen a mixed kid doing film and TV,’ ” Fisher said of Bleu, who starred as Chad Danforth on the Disney Channel production.\n\n“That was the moment where I went, ‘That’s what I want to do. That’s what I want to do,’ ” said Fisher.\n\nWATCH: The Cost of Dancing With the Stars’ Mirrorball Trophy\n\nWhile Fisher continues to amaze audiences both in front of the camera and on the dance floor, his ultimate goal is to be a husband and father one day.\n\nThe triple threat, who was adopted by his maternal grandmother and stepgrandfather — whom he calls his mom and dad — told PEOPLE that his close-knit family has inspired him to one day start a family of his own.\n\n“My adoption journey fully fuels my inspiration, my drive, what my vision of success is. My ultimate goal in my life is to have a family,” he shared with PEOPLE.\n\n“I want to be an incredible father, an incredible husband and take great care of my wife and all my kids and do what I love to do during the day to provide for them,” Fisher said. “That, ultimately, is what I see as being successful. I just aspire to be even half of how wonderful as my parents are.”\n\nBut the DWTS journey is not over for Fisher and Muniz. Both the finalists will head out on the Dancing with the Stars Live! tour, which kicks off Dec. 30. Tickets are available online at www.dwtstour.com.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Fdwts-final-contestants-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Farnold-fisher-5-2000-1.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Farnold-fisher-2-2000-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F11%2Farnold-fisher-3-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Farnold-fisher-4-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Farnold-fisher-4-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Farnold-fisher-4-2000.jpg", "keywords": [], "authors": ["Natalie Stone", "Patrick Gomez"], "canonical_link": "https://people.com/tv/dancing-with-the-stars-season-25-winner-jordan-fisher/", "title": "DWTS Season 25 Winner: Jordan Fisher Crowned Mirrorball Champ", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Dancing with the Stars,Frankie Muniz,Jordan Fisher,Lindsey Stirling,News,TV,TV Watch", "news_keywords": "Dancing with the Stars,Frankie Muniz,Jordan Fisher,Lindsey Stirling,News,TV,TV Watch", "description": "Dancing with the Stars crowned its season 25 Mirrorball Trophy winner on Tuesday evening", "og": {"title": "Dancing with the Stars Crowns Its Season 25 Winner! And the Mirrorball Champion Is ...", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/dancing-with-the-stars-season-25-winner-jordan-fisher/", "description": "Dancing with the Stars has crowned its season 25 winner! On Tuesday night, Jordan Fisher, Lindsey Stirling and Frankie Muniz went head-to-head on the season&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Farnold-fisher-4-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/dancing-with-the-stars-season-25-winner-jordan-fisher/", "description": "Dancing with the Stars crowned its season 25 Mirrorball Trophy winner on Tuesday evening", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Farnold-fisher-4-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/dancing-with-the-stars-season-25-winner-jordan-fisher/", "title": "Dancing with the Stars Crowns Its Season 25 Winner! And the Mirrorball Champion Is ...", "description": "Dancing with the Stars crowned its season 25 Mirrorball Trophy winner on Tuesday evening", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Farnold-fisher-4-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}