{"url": "https://en.wikipedia.org/wiki/Wonder_Woman_(2017_film)", "text": "American superhero film directed by Patty Jenkins\n\nWonder Woman is a 2017 American superhero film based on the DC Comics character of the same name, produced by DC Films in association with RatPac Entertainment and Chinese company Tencent Pictures, and distributed by Warner Bros. Pictures. It is the fourth installment in the DC Extended Universe (DCEU).[6] Directed by Patty Jenkins from a screenplay by Allan Heinberg and a story by Heinberg, Zack Snyder, and Jason Fuchs, Wonder Woman stars Gal Gadot in the title role, alongside Chris Pine, Robin Wright, Danny Huston, David Thewlis, Connie Nielsen, and Elena Anaya. It is the second live action theatrical film featuring Wonder Woman following her debut in 2016's Batman v Superman: Dawn of Justice.[7] In Wonder Woman, the Amazon princess Diana sets out to stop World War I, believing the conflict was started by the longtime enemy of the Amazons, Ares, after American pilot and spy Steve Trevor crash-lands on their island Themyscira and informs her about it.\n\nDevelopment of a live action Wonder Woman film began in 1996, with Ivan Reitman to produce and possibly direct. The project floundered in development hell for many years; Jon Cohen, Todd Alcott, and Joss Whedon, among others, were also attached to the project at various points. Warner Bros. announced the film in 2010 and Jenkins signed on to direct in 2015. Inspiration for Wonder Woman was drawn from Wonder Woman creator William Moulton Marston's 1940s stories and George Pérez's 1980s stories about Wonder Woman, as well as the New 52 incarnation of the character. Principal photography began on November 21, 2015, with filming taking place in the United Kingdom, France, and Italy before finishing on May 6, 2016, the 123rd anniversary of Marston's birth. Additional filming took place in November 2016.\n\nWonder Woman had its world premiere in Shanghai on May 15, 2017, and was released in the United States on June 2, 2017, in 2D, Real D 3D, and IMAX 3D by Warner Bros. Pictures. The film received largely positive reviews, with praise for its direction, acting, visuals, action sequences, and musical score. [8] However, it also received criticism for the main villain and the climax. The film set several box office records,[9] and became the fifth highest-grossing superhero film domestically and 20th highest-grossing film in the United States overall. It grossed over $821 million worldwide, making it the tenth highest-grossing film of 2017 as well as the highest-grossing film by a solo female director. As of August 2019, Rotten Tomatoes has listed the film fourth on its list of the \"Best Superhero Movies of All Time\",[10][note 1] and the American Film Institute selected it as one of the top 10 films of 2017.[11] A sequel, Wonder Woman 1984, is scheduled to be released on August 14, 2020, with Jenkins returning as director, and Gadot and Pine reprising their roles.\n\nPlot [ edit ]\n\nIn present-day Paris, Diana receives a photographic plate from Wayne Enterprises of herself and four men taken during World War I, prompting her to recall her past. The daughter of Queen Hippolyta, Diana is raised on the hidden island of Themyscira, home to the Amazonian women warriors created by Zeus to protect mankind. Hippolyta explains the Amazonian history to Diana, including how Ares became jealous of humanity and orchestrated its destruction. When the other gods attempted to stop him, Ares killed all but Zeus, who used the last of his power to wound Ares and force his retreat. Before dying, Zeus left the Amazons the island and a weapon, the \"Godkiller\", to prepare them for Ares's return.\n\nAlthough she initially forbids Diana to be trained as a warrior, Hippolyta reluctantly agrees to let General Antiope, Hippolyta's sister and Diana's aunt, train her, only more rigorously than any other warrior.\n\nIn 1918, Diana, now a young woman, rescues US pilot Captain Steve Trevor when his plane crashes off the Themysciran coast. The island is soon invaded by German soldiers that had been pursuing Steve. The Amazons kill the crew, but Antiope sacrifices herself to save Diana. Steve is interrogated with the Lasso of Hestia and reveals that a great war is consuming the outside world and that he is an Allied spy. He has stolen a notebook of the chief chemist Dr. Isabel Maru, who is attempting to engineer a deadlier form of mustard gas under the orders of General Erich Ludendorff from a weapon facility in the Ottoman Empire. Believing Ares to be responsible for the war, Diana arms herself with the \"Godkiller\" sword, the lasso, and armor before leaving Themyscira with Steve to locate and stop Ares for good.\n\nIn London, they deliver Maru's notebook to the Supreme War Council, where Sir Patrick Morgan is trying to negotiate an armistice with Germany. Diana translates Maru's notes and reveals that the Germans plan to release the deadly gas at the Western Front. Although forbidden by his commander to act, Steve, with secret funding from Morgan, recruits Moroccan spy Sameer, Scottish marksman Charlie, and Native American smuggler Chief Napi to help prevent the gas from being released. The team reaches the front in Belgium. Diana goes alone through No Man's Land and captures the enemy trench, allowing the Allied forces to help her liberate the nearby village of Veld. The team briefly celebrates, taking a photograph in the village, where Diana and Steve fall in love.\n\nThe team learns that a gala will be held at the nearby German High Command. Steve and Diana separately infiltrate the party, with Steve intending to locate the gas and destroy it, and Diana hoping to kill Ludendorff, believing that he is Ares and thus killing him will end the war. Steve stops her to avoid jeopardizing his mission, but this allows Ludendorff to unleash the gas on Veld, killing its inhabitants. Blaming Steve for intervening, Diana pursues Ludendorff to a base where the gas is being loaded into a bomber aircraft bound for London. Diana fights and kills him, but is confused and disillusioned when his death does not stop the war.\n\nMorgan appears and reveals himself as Ares. He tells Diana that although he has subtly given humans ideas and inspirations, using Ludendorff and Maru as pawns in the process, it is ultimately their decision to resort to violence as they are inherently corrupt. When Diana attempts to kill Ares with the \"Godkiller\" sword, he destroys it, then reveals to Diana that she herself is the \"Godkiller\", as the daughter of Zeus and Hippolyta. He fails to persuade Diana to help him destroy mankind in order to restore paradise on Earth. While the two battle, Steve's team destroys Maru's laboratory. Steve hijacks and pilots the bomber carrying the poison to a safe altitude and detonates it, blowing up the plane and himself. Ares attempts to direct Diana's rage and grief at Steve's death by convincing her to kill Maru, but the memories of her experiences with Steve cause her to realize that humans have good within them. She spares Maru and redirects Ares's lightning into him, killing him for good. Later, the team celebrates the end of the war.\n\nIn the present day, Diana sends an email to Bruce Wayne thanking him for the photographic plate of her and Steve. She continues to fight and give on the world's behalf, understanding that only love can truly save the world.\n\nCast [ edit ]\n\nAdditionally, Mayling Ng, Florence Kasumba, Madeleine Vall Beijner, Hayley Jane Warnes and Ann Wolfe portray Orana, Acantha, Egeria, Aella and Artemis, respectively, all of whom are Amazons.[60][61][62][63] James Cosmo appears as Douglas Haig, Steffan Rhodri appears as Darnell, and Dutch supermodel Doutzen Kroes portrays the Amazon Venelia.[62] Samantha Jo was cast as the Amazonian Euboea, and previously played the Kryptonian, Car-Vex, in Man of Steel.[64] Zack Snyder also makes a brief cameo appearance in the film as an unnamed soldier.[65]\n\nProduction [ edit ]\n\nBackground [ edit ]\n\nDevelopment for a live action Wonder Woman feature film began in 1996, with Ivan Reitman attached as producer and possible director.[66] In 1999 the project became attached to Jon Cohen, who adapted Wonder Woman for producer Joel Silver, with the hope that Sandra Bullock would star.[67] By 2001, Todd Alcott was hired to write the screenplay, with Silver Pictures backing the project.[68] At that time, performers such as Mariah Carey and Catherine Zeta-Jones were also rumored to be possible candidates for the role of Wonder Woman.[69] Leonard Goldberg focused on Bullock[70] who said that she was approached for the role. Lucy Lawless, the star of Xena: Warrior Princess, was also under consideration, though she stated that she would have been more interested if Wonder Woman was portrayed as a \"flawed hero\".[71] The screenplay went through various drafts written by Alcott, Cohen, Becky Johnston, and Philip Levens,[72] and by August 2003, Levens had been replaced by screenwriter Laeta Kalogridis.[73]\n\nIn March 2005, Warner Bros. and Silver Pictures announced that Joss Whedon would write and direct the film.[74] Early drafts of his screenplay included Steve Trevor as the narrator, a fierce battle between Diana and her mother over Trevor's welfare, and after leaving Themyscira, his need to frequently rescue a Diana rendered helpless by the modern world.[75] Whedon was not able to complete a final version of his screenplay, and left the project in 2007.[76][77]\n\nAlthough Whedon stated in May 2005 that he would not cast the part of Wonder Woman until he finished the script,[78] Kate Beckinsale was linked to the part.[79] In 2010, Whedon admitted that he did have an actress in mind for the part, stating that \"Wonder Woman was basically Angelina Jolie.\"[75][80]\n\nA day before Whedon's departure from Wonder Woman, Warner Bros. and Silver Pictures purchased a spec script for the film written by Matthew Jennison and Brent Strickland. Set during World War II, the script impressed executives at Silver Pictures.[77] However, Silver stated that he had purchased the script because he did not want the rights reverting; while stating the script had good ideas, Silver did not want the film to be a period piece.[81] By April 2008, Silver hired Jennison and Strickland to write a new script set in contemporary times that would not depict Wonder Woman's origin, but explore Paradise Island's history.[82]\n\nDevelopment [ edit ]\n\nIn 2010, Warner Bros. stated that a Wonder Woman film was in development, along with films based on DC Comics superheroes the Flash and Aquaman.[83] Both Wonder Woman and Aquaman were still under consideration for solo film subjects as of June 2013.[84] DC Entertainment president Diane Nelson said Wonder Woman \"has been, since I started, one of the top three priorities for DC and for Warner Bros. We are still trying right now, but she's tricky.\"[85] On October 5, 2013, WB chairman and CEO Kevin Tsujihara said he wanted to get Wonder Woman in a film or on TV.[86] Shortly afterward, Paul Feig said he had pitched the studio an idea for Wonder Woman as an action-comedy film.[87][88] The studio then began to search for female directors to direct the film.[89] While Michelle MacLaren was the studio's initial choice to direct (and while she initially indicated interest),[90][91][92] she eventually left the project due to creative differences.[93]\n\nIn 2015, Patty Jenkins accepted an offer to direct Wonder Woman,[94] based on a screenplay by Allan Heinberg and a story co-written by Heinberg, Zack Snyder, Geoff Johns and Jason Fuchs.[95] Of this version, Gadot stated that,\n\nfor a long time, people didn't know how to approach the story. When Patty and I had our creative conversations about the character, we realized that Diana can still be a normal woman, one with very high values, but still a woman. She can be sensitive. She is smart and independent and emotional. She can be confused. She can lose her confidence. She can have confidence. She is everything. She has a human heart.[7]\n\nThis version was conceived of as a prequel to the first live-action, theatrical appearance of Wonder Woman, in the 2016 film, Batman v Superman: Dawn of Justice,[96] placing Wonder Woman in the 1910s and World War I (a decision which differs from her comic book origins as a supporter of the Allies during World War II).[97] As for story development, Jenkins credits the stories by the character's creator William Moulton Marston in the 1940s and George Perez's seminal stories in the 1980s in which he modernized the character.[98] In addition, it follows some aspects of DC Comics' origin changes in The New 52 reboot, where Diana is the daughter of Zeus.[12][99] Jenkins cited Richard Donner's Superman as an inspiration.[100]\n\nCasting [ edit ]\n\nI remember when I read in the news that Wonder Woman had been cast and my heart sank ... I'm sure we wouldn't have made the same choice. And then I started paying attention to her, and watching her and looking at her and it was just unbelievable. Frankly, I think they did a better job than I could have because I don't know that I would have scoured the earth as hard to find her ... They were looking for all the same things I would have looked for—all the values that Wonder Woman stands for exuding from someone in an honest way, and boy did they find it ... She shares every quality with Wonder Woman and that's no joke. It's one of those rare things. You need someone who can appear to be Wonder Woman on screen ... Every once in a while, there's superhero casting that transcends, because that person is so authentic to the character that it becomes identified with them, like Lynda Carter or Christopher Reeve – Director Patty Jenkins[101] in response to the interview questions: \"Let's talk a bit about Gal. You inherited her from Zack Snyder. Was it difficult to not get to choose your own Wonder Woman?\" and \"What is it about Gal that makes her such a good fit?\"\n\nIn late 2013, Zack Snyder cast Gal Gadot in the role of Wonder Woman for the 2016 film, Batman v Superman: Dawn of Justice over Élodie Yung and Olga Kurylenko.[102][103][104][105] Some fans initially reacted to this choice by criticizing Gadot's appearance.[106] Snyder would later comment on his decision to cast Gadot, stating that he tested a \"bunch of actresses, as you can imagine. But the thing with Gal is that she's strong, she's beautiful, and she's a kind person, which is interesting, but fierce at the same time. It's that combination of being fierce but kind at the same time that we were looking for.[107] Gadot described Diana as having \"the heart of a human so she can be emotional, she's curious, she's compassionate, she loves people. And then she has the powers of a goddess. She's all for good, she fights for good.\"[7] She also said that Diana has \"many strengths and powers, but at the end of the day she's a woman with a lot of emotional intelligence\".[108] As to how her character is different from her appearance in Batman v Superman: Dawn of Justice, Gadot said \"We go back 100 years to when she's more naive\", further explaining, \"She's this young idealist. She's pure. Very different to the experienced, super-confident, grown-up woman you've seen\".[109] Gadot underwent a diet and training regimen, practiced different martial arts and gained 17 pounds of muscle for the role.[110][111] Gadot was previously offered a different role (as a villain) in Man of Steel, which she declined because she was pregnant at the time; this allowed her to later be cast as Wonder Woman in the film's follow-up.[112] Gadot signed a three-picture deal.[104] She was paid a base salary of $300,000 for the film itself.[113]\n\nChris Pine was cast as Steve Trevor,[21][114] a character he described as a \"rogue-ish, cynical realist who's seen the awful brutish nature of modern civilization\" and added that he is a \"worldly guy, a charming guy\".[115] He signed a multi-picture deal.[21] Lucy Davis' performance as Etta Candy is the first live-action cinematic portrayal of the character.[116] As well, Elena Anaya's performance as Doctor Poison is the cinematic debut of that character. Nicole Kidman was in negotiations for the role of Queen Hippolyta, but was forced to drop out due to scheduling conflicts with Big Little Lies.[117][118]\n\nFilming [ edit ]\n\nPrincipal photography on the film began on November 21, 2015,[119][120] under the working title Nightingale.[121][122] Among the film sets were Lower Halstow, Kent,[123] and Australia House[124] in England and the Sassi di Matera,[125] Castel del Monte[125] and Camerota[126] in Southern Italy. Matthew Jensen was the director of photography,[127] filming in the United Kingdom, France and Italy.[128] Production in London concluded on March 13, 2016.[129] On March 20, 2016, filming was underway in Italy. In late April, filming took place at the Louvre Museum in Paris, France, where a Wayne Enterprises truck was spotted alongside Gadot.[130] Principal photography finished on May 9, 2016.[131] Patty Jenkins and director of photography Matt Jensen said that the film's look was inspired by painter John Singer Sargent.[132] Jenkins said she shot the movie on film instead of digital video \"because there's a certain type of epic grander escapism that film gives you that you cannot – you will struggle very hard – to get that on video\".[133] Reshoots took place in November 2016, while Gadot was five months pregnant. A green cloth was placed over her stomach to edit out her pregnancy during post-production.[134]\n\nTo find the perfect location to shoot the Amazon island of Themyscira, the birthplace of Wonder Woman herself, the film's producers searched all over the world, finally settling on the Cilentan Coast: a stretch of coastline on the Tyrrhenian Sea, located in the Province of Salerno in Southern Italy.[135] It was chosen because most beaches in the world that sit below big cliffs disappear beneath the tide for part of every day. Production designer Aline Bonetto and her location manager Charles Somers considered 47 countries and visited several of them before they found what they were looking for. Bonetto explained that, \"Italy had beautiful weather, a beautiful blue-green sea, not too much tide, not too much wave. Our effects team added some cliffs in post-production, and it was the perfect way to go\".[136] The estuary at Lower Halstow in Kent is featured in the scene in which Diana arrives at a Belgian creek to make her way to the warfront.[137] Bill Westenhofer served as the visual effects supervisor for the film[138] and Martin Walsh served as editor.[127]\n\nMusic [ edit ]\n\nOn November 3, 2016, Rupert Gregson-Williams was hired to write and compose the film's music.[139][140] He was joined by Evan Jolly, Tom Howe,[141] Paul Mounsey,[142] and Andrew Kawczynski,[143] who provided additional music. The soundtrack was released on CD, digital, and vinyl the same day as the film.[144] Australian musician Sia sang a song for the film, titled \"To Be Human\", featuring English musician Labrinth. Written by Florence Welch and Rick Nowels, the track is also featured on the soundtrack.[145] The soundtrack also features samples from Wonder Woman's theme \"Is She with You\" from the Batman v Superman: Dawn of Justice soundtrack composed by Hans Zimmer and Junkie XL.\n\nAdditional music featured in the film are: \"Another Little Drink Wouldn't Do Us Any Harm\" by Clifford Grey and Nat Ayer and performed by Edgar Trevor and Cecil Cooper; \"Molly O'Morgan\" written by Fred Godfrey and Will Letters and performed by Ella Retford; \"It's a Long Way to Tipperary\" written by Jack Judge and Harry Williams; \"Sous les ponts de Paris\" written by Jean Rodor and Vincent Scotto and performed by Lucienne Delyle; \"I'll Walk Beside You\" written by Edward Lockton and Alan Murray and performed by Ewen Bremner; \"Green Grow the Rushes, O\" written by Robert Burns and performed by Ewen Bremner; and \"Schatzwalzer Op. 4\" written by Johann Strauss II and performed by the Berlin String Quartet.[146]\n\nRelease [ edit ]\n\nWonder Woman had its world premiere on May 15, 2017, in Shanghai. It premiered on May 25, 2017, in Los Angeles.[147] The film's London premiere, which was scheduled to take place on May 31 at the Odeon Leicester Square, was cancelled due to the Manchester Arena bombing.[148] The film had its Latin America premiere in Mexico City on May 27. It was released in most of the world, including in IMAX,[149] on June 2, 2017, after originally being scheduled for June 23.[150][151] Belgium, Singapore and South Korea received the film first, with May 31 openings.[152][153][154] On April 17, it was announced that Wonder Woman would be released in China on June 2, the same day as its North American release.[155]\n\nMarketing [ edit ]\n\nRussian promotion at IgroMir 2016\n\nThe success of the superhero television series Supergirl informed the marketing and promotion strategy used for Wonder Woman.[156] According to Time Warner chief marketing officer Kristen O'Hara, they wanted to approach the Wonder Woman marketing campaign in a light manner, similar to how they did with Supergirl. O'Hara elaborated that the modest campaign route they took for Supergirl aided in establishing a large central fanbase among women well in advance of the series, which reportedly generated 5 million female superhero fans in one week.[156] They were then able to model over time, and grow that audience leading up to the 15-months-later release of Wonder Woman.[156] Though neither the film nor the series are aimed exclusively at women, the latter's campaign gave them their first opportunity to begin collecting data about female superhero fans.[156] In May 2017, a promo for Wonder Woman was released during the season finale of Supergirl, featuring a remix of the song \"These Boots Are Made for Walkin'\" and Supergirl (Melissa Benoist) wearing Wonder Woman's boots.[157] The promo included an appearance by Lynda Carter, star of the 1970s Wonder Woman, who plays the American president on Supergirl.[157]\n\nThe costs for television advertisements for Wonder Woman are higher in comparison to that of previous DCEU film Suicide Squad. Warner Bros. has spent over $3 million on advertisements for Wonder Woman, whereas they spent $2.6 million on advertisements for Suicide Squad.[158] Ticket selling site Fandango reported that Wonder Woman rounded the final leg of its marketing campaign as the most anticipated blockbuster of summer 2017, according to a poll conducted by 10,000 voters, the biggest survey in company history.[159] Separately, Fandango also found that 92% of people surveyed said that they are looking forward to seeing a film that features a standalone woman superhero, and 87% wished Hollywood would make more women-led superhero films.[160] In May 2017, NASCAR driver Danica Patrick drove her No. 10 car with a Wonder Woman paint scheme at the Go Bowling 400 in Kansas and at the Monster Energy Open in Charlotte.[161]\n\nHome media [ edit ]\n\nWonder Woman was released on Digital HD on August 29, 2017, and on Blu-ray, Blu-ray 3D, 4K Ultra-HD Blu-ray and DVD on September 19, 2017.[162] The film debuted at the top spot of both the NPD VideoScan overall disc sales chart and the Blu-ray Disc sales chart.[163]\n\nControversies [ edit ]\n\nArab countries ban [ edit ]\n\nOn May 31, Wonder Woman was banned in Lebanon after the Campaign to Boycott Supporters of Israel asked the Lebanese government's Ministry of Economy and Trade to block the film because its star, Gal Gadot, is Israeli.[164] The Lebanese government did not ban Gadot's Fast & Furious films which did screen in Lebanon.[165][166] On June 6, Variety reported that Algiers, the capital of Algeria, pulled the film from the \"Nuits du Cinéma\" film festival.[167] On June 7, Variety also reported that a Tunisian court suspended the theatrical release of Wonder Woman after a lawsuit brought by the Al-Chaab party and the Tunisian Association of Young Lawyers to have the film blocked due to Gadot's Israeli citizenship, military service, and public comments in support of the Israeli military during the 2014 war in Gaza.[168] Jordan was reportedly also considering a ban of the film and suspended screenings pending a decision,[169] but on June 11, it was reported that the government decided not to do so, as there was no legal precedent for it.[170] On June 30, Qatar issued a ban on the film.[171]\n\nWomen-only screenings [ edit ]\n\nSome men were unhappy with women-only screenings held at the Alamo Drafthouse Cinema in Austin, with some opponents of the gender-restricted screening stating on platforms such as Facebook that such screenings were discriminatory against men.[172][173][174] A gay Albany Law School professor initiated a complaint with Austin's Equal Employment and Fair Housing Office claiming discrimination against male prospective customers and employees of the theater.[175] The chain responded with an online statement saying the event \"may have created confusion—we want everybody to see this film\" and announced a similar event at their Brooklyn location. Tickets sold out in less than an hour, prompting the chain to schedule additional screenings.[172] On July 18, Alamo Drafthouse proposed settlement offers of a Wonder Woman DVD to the complainants, stating \"Respondent did not realize that advertising a 'women's only' screening was a violation of discrimination laws.\"[176]\n\nReception [ edit ]\n\nBox office [ edit ]\n\nWonder Woman grossed $412.6 million in the United States and Canada and $409.3 million in other territories for a worldwide total of $821.8 million, against an estimated production budget of $120–150 million.[5] Estimates for the number the film needed to surpass internationally in order to cover its production and promotional costs and break even ranged from $300 million[177] to $460 million.[178] Deadline Hollywood calculated the net profit of the film to be $252.9 million, when factoring together all expenses and revenues, making it the 6th most profitable release of 2017.[179]\n\nUnited States and Canada [ edit ]\n\nIn May 2017, early tracking had Wonder Woman opening with $65–75 million, and possibly as high as $105 million.[180][181][182][183][177] The film opened Friday, June 2, 2017, across 4,165 theaters and made $38.7 million on its opening day, including $3.7 million in IMAX. It was the biggest single-day gross for a woman-directed film, ahead of the $35.9 million opening Friday of Catherine Hardwicke's Twilight in 2008 and the biggest opening day for a woman-led comic book superhero film, ahead of Ghost in the Shell ($7 million).[184] This included $11 million it made from Thursday previews, also the best start for a film directed by a woman, surpassing Fifty Shades of Grey's $8.6 million which was directed by Sam Taylor-Johnson, and the third-biggest of the year, behind Beauty and the Beast and Guardians of the Galaxy Vol. 2. Of that, $1.5 million came from IMAX screenings.[185][186]\n\nEarning a total of $103.3 million on its opening weekend, the film recorded a number of records: the biggest domestic opening of all time for a female director (surpassing previous record holder Fifty Shades of Grey), the biggest DC Comics release without Batman or Superman (ahead of Constantine), the sixth-biggest non-sequel comic book superhero debut ever, as well as the sixth-biggest June debut weekend.[187] Its three-day opening alone made it the highest-grossing woman-led comic book superhero film ever (surpassing Ghost in the Shell).[188] It was also the 16th superhero film to cross $100 million in its domestic box office launch.[189] About 9% ($9 million) of the opening weekend came from IMAX screenings from 343 theaters.[190] In its second week the film grossed $58.5 million, again topping the box office. It marked a 43.3% drop for its second weekend at the box office, better than the average 50–60% decline superhero films tend to see, and was a better second weekend than Batman v Superman: Dawn of Justice ($51.3 million) and Suicide Squad ($43.5 million).[191] In its third weekend it grossed $40.8 million, finishing second behind newcomer Cars 3 ($53.5 million). It was the second-best third weekend ever for Warner Bros. and was nearly double what Batman v Superman ($23.3 million), Suicide Squad ($20.9 million) and Man of Steel ($20.7 million) made in their third weekends. It earned $24.9 million and $15.7 million in its fourth and fifth weekends, respectively, dropping just 39% and 36% despite facing rough competition from opening films Transformers: The Last Knight and Despicable Me 3.[192] It eventually became the highest-grossing film directed by a woman, surpassing the previous records of Jennifer Yuh Nelson's Kung Fu Panda 2 and Phyllida Lloyd's Mamma Mia!.[9] By August 8, the film had garnered $400 million in ticket sales, becoming the second female-fueled film (after Disney's Beauty and the Beast), Warner Bros.' third-biggest movie (after Christopher Nolan's The Dark Knight and The Dark Knight Rises), holding the record of the highest-earning superhero origin film, replacing the previous record held by Spider-Man (2002). It also becoming the highest-earning film with a female director in terms of domestic earnings—surpassing Frozen (2013).[193][194][195]\n\nOther countries [ edit ]\n\nBeyond the US and Canada, the film was released day-and-date with its North American debut in 55 markets (72% of its total release), and was projected to debut with anywhere between $92–118 million.[177] It ended up opening to $125 million, including $38 million in China, $8.5 million in Korea, $8.4 million in Mexico, $8.3 million in Brazil and $7.5 million in the UK.[196] In its second week of release, the film brought in another $60 million, including holding the top spot on France, the UK, Australia and Brazil.[197] In the Philippines, it broke 2017 box office record for highest-earning non-holiday opening day—earning $4.7 million and becoming the 9th-most successful commercial film of all time as well overtaking the record set by Batman v Superman: Dawn of Justice.[198][199][200] The film opened in its last market, Japan, on August 25 and debuted to $3.4 million, helping the international gross cross the $400 million mark.[201] The biggest markets of Wonder Woman outside North America are China (US$90 million) followed by Brazil (US$34 million), UK (US$28 million), Australia($23 million) and Mexico($22 million).[202]\n\nCritical response [ edit ]\n\nWonder Woman received a largely positive response from critics, with some calling it the DC Extended Universe's best film, praising Jenkins's direction and the acting, chemistry between Gadot and Pine, musical score, and action sequences.[8][206] On the review aggregator Rotten Tomatoes, the film holds an approval rating of 93% based on 444 reviews, with an average rating of 7.64/10. The website's critical consensus reads, \"Thrilling, earnest, and buoyed by Gal Gadot's charismatic performance, Wonder Woman succeeds in spectacular fashion.\"[207] It is the fourth highest-rated superhero film on the site.[10][note 1] On Metacritic, the film has a weighted average score of 76 out of 100, based on 50 critics, indicating \"generally favorable reviews\".[208] Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale, while PostTrak reported filmgoers gave it an 85% overall positive score and a 73% \"definite recommend\".[209] In 2018, the film was awarded The ReFrame Stamp in the category for 2017 Narrative & Animated Feature.[210]\n\nCritics commented favorably on Gadot's performance of the titular character and Chris Pine's Steve Trevor.[211][212][205] Andrew Barker of Variety found the film to be more lighthearted than recent DC Comics films:\n\nNever prone to stewing in solitude, and taking more notes from Richard Donner than from Christopher Nolan, Patty Jenkins' Wonder Woman provides a welcome respite from DC's house style of grim darkness—boisterous, earnest, sometimes sloppy, yet consistently entertaining—with star Gal Gadot proving an inspired choice for this avatar of truth, justice, and the Amazonian way.[213]\n\nVox stated \"Trevor is the superhero girlfriend comic book movies need\".[214] The San Francisco Chronicle's Mick LaSalle lauded the performances of Gadot, Pine, Huston, and Thewlis while commending the film's \"different perspective\" and humor.[215] Richard Roeper of Chicago Sun-Times described Gadot's performance as inspirational, heroic, heartfelt and endearing and the most \"real\" Wonder Woman portrayal.[216]\n\nA. O. Scott of The New York Times wrote that it \"briskly shakes off blockbuster branding imperatives and allows itself to be something relatively rare in the modern superhero cosmos. It feels less like yet another installment in an endless sequence of apocalyptic merchandising opportunities than like ... what's the word I'm looking for? A movie. A pretty good one, too.\"[217] Michael Phillips of Chicago Tribune compared the film to Captain America: The First Avenger, noting that as with \"the first Captain America movie over in the Marvel Comics universe, DC's Wonder Woman offers the pleasures of period re-creation for a popular audience. Jenkins and her design team make 1918-era London; war-torn Belgium; the Ottoman Empire; and other locales look freshly realized, with a strong point of view. There are scenes here of dispossessed war refugees, witnessed by an astonished and heartbroken Diana, that carry unusual gravity for a comic book adaptation.\"[218] Katie Erbland of IndieWire commended its thematic depth, explaining that \"Wonder Woman is a war movie. Patty Jenkins' first—and we hope not last—entry into the DC Expanded Universe is primarily set during World War I, but while the feature doesn't balk at war-time violence, it's the internal battles of its compelling heroine that are most vital.\"[219] Alonso Duralde of TheWrap similarly felt that, \"Diana's scenes of action are thrilling precisely because they're meant to stop war, not to foment it; the idea of a demi-god using love to fight war might sound goofy in the abstract, but Jenkins makes the concept work.\"[220] Ann Hornaday of The Washington Post praised Gadot and Pine's performances as well the film's detailed plot and narrative while comparing of some slow-motion action sequences to The Matrix.[221] Stephanie Zacharek of Time magazine hailed the film as a \"cut above nearly all the superhero movies that have been trotted out over the past few summers\" while praising Gadot's performance as \"charming\" and \"marvelous\" and commending Jenkins's direction of the film as a step forward for women directors in directing big-budget blockbuster films in Hollywood.[222]\n\nElise Jost of Moviepilot observed that \"Gadot's take on Wonder Woman is one of those unique cases of an actor merging with their story, similar to Robert Downey Jr.'s Tony Stark. Gal Gadot is Wonder Woman, and Wonder Woman is Gal Gadot.\"[205] Jost praised Gadot's interpretation of Wonder Woman as the one in which Gadot \"absolutely nails the character's unwaveringly positive outlook on life. She's a force of nature who believes in the greater good; her conviction that she's meant to save the world is stronger than her bullet-deflecting shield. She's genuine, she's fun, she's the warm source of energy at the heart of the movie.\"[205] The Federalist suggests that Wonder Woman is \"a story of Jesus\". \"The movie is wrapped up in faux Greek mythology, true, but there's no mistaking the Christology here.\"[223] \"Perhaps Christ in the form of a beautiful and kick-ass Amazon is all that our contemporary society can handle right now\", stated M. Hudson, a Christian feminist.[223] On HuffPost cultural critic, G. Roger Denson, who regards the superhero genre as a source of contemporary \"Mainstream Mythopoetics\" (\"the making of new yet vitally meaningful, if not symbolic, stories filled with imagery reflecting, yet also shaping and advancing, the political, legal, moral and social practices of today\"), wrote that the \"No Man's Land\" scene \"that people are crying over in theaters and raving about afterward happens to be among the most powerfully mythopoetic scenes ever filmed at the same time it is one of the oldest myths to have been utilized by artists and writers after it had been invented by early military strategists and leaders.\" Specifically \"used by director Patty Jenkins\", the scene raises \"the esteem for powerful yet compassionate women as heroes and leaders to a level equal with that of men for having won over a huge and adoring popular audience around the world\".[224]\n\nSteve Rose in The Guardian criticized the film for failing to explore the material's potential for \"patriarchy-upending subversion\".[225] Peter Travers of Rolling Stone criticized the film's over-reliance on exposition: \"Wonder Woman is hobbled by a slogging origin story and action that only comes in fits and starts. Just when Gadot and director Patty Jenkins...are ready to kick ass, we get backstory.\"[226]\n\n\"Gas was intended to win the war. On that much Wonder Woman is absolutely right.\" said David Hambling in Popular Mechanics.[227] Rachel Becker of The Verge stated that despite the scientific liberties of using a \"hydrogen-based\" chemical weapon as a plot device, the film succeeds in evoking real and horrifying history. \"First off, mustard gas is such a horrible, terrifying weapon, it doesn't need to be made more potent. But if you were a chemist bent on raining destruction on the Allied forces, you wouldn't do it by replacing the sulfur atom in mustard gas with a hydrogen atom. You'd know that sulfur is the linchpin holding together this poisonous molecule.\"[228]\n\nCultural impact [ edit ]\n\nWonder Woman has been the subject of a discussion regarding the appearance and representation of female power in general, and of female action heroes in particular[229] since her initial 1941 appearance in Sensation Comics,[229] as she was created to document \"the growth in the power of women\", while wearing \"a golden tiara, a red bustier, blue underpants and knee-high, red leather boots.\"[230] She was blacklisted a year later in 1942 in the \"Publications Disapproved for Youth\" because, the group behind the list argued, she was \"not sufficiently dressed\".[230][231]\n\nA few decades later, second-wave feminist Gloria Steinem's[232] Ms. Magazine debuted in 1972 with an image of Wonder Woman on the cover. Historian Tim Hanley suggests that this move shifted \"the focus away from female superiority to sisterhood and equality, essentially making her a mascot of the women's movement\".[229][233][234] This perception shifted over the years, as demonstrated in December 2016 when the United Nations decided to drop the title of \"honorary ambassador for the empowerment of women and girls\" which it had given to the comic book character Wonder Woman a few months prior, in a ceremony attended by the actors who had portrayed her (Lynda Carter and Gal Gadot).[235] The title was eliminated in response to a petition signed by 44,000 people which argued that Wonder Woman undermines female empowerment due to her costume, described as a \"shimmery, thigh-baring bodysuit with an American flag motif and knee-high boots\". The petition stated that \"it is alarming that the United Nations would consider using a character with an overtly sexualised image at a time when the headline news in United States and the world is the objectification of women and girls\".[236][237][233] Wonder Woman director Patty Jenkins responded to both the petition and to the U.N.'s decision by stating that she thinks \"that that's sexist. I think it's sexist to say you can't have both. I have to ask myself what I would apply to any other superhero\".[238]\n\nThe debate continued with the release of Jenkins's 2017 film, Wonder Woman, which according to the BBC had \"some thinking it's too feminist and others thinking it's not feminist enough\".[239] Kyle Killian found an inherent contradiction in the construction of Wonder Woman as \"a warrior\" who, she states, is also highly sexualized. Killian thus suggests that these elements \"should not be the focus of a kickass heroine—her beauty, bone structure, and sexiness—if she is to be a feminist icon\".[240] Theresa Harold concurred, comparing Wonder Woman to Katniss Everdeen (of The Hunger Games), who \"didn't have to wear a teenager's wet dream of a costume to fight in\".[241] Christina Cauterucci also felt that Wonder Woman's ability to be considered a \"feminist antidote\" was undermined by her \"sex appeal\".[242] Other critics refer to the construction of Wonder Woman in the film as \"an implausible post-feminist hero\".[231][243]\n\nJenkins disagrees with this line of critique. She has stated that she was raised by a second-wave \"feminist mother\",[244][245] who taught her to be \"both super aware that there had been sexism but also: 'Congratulations—thank you, now I get to do whatever I want, Mom!'\"[244] Jenkins thus notes that it is this upbringing which has led her to question a feminist critique of Wonder Woman's costume.[246] When she was working on her own version of Wonder Woman's \"Gladiator\" re-design of the outfit (in the 2016 film Batman v Superman: Dawn of Justice)[247] Jenkins decided that Wonder Woman (as well as the other Amazons) \"shouldn't be dressed in armor like men ... It should be different ... I, as a woman, want Wonder Woman to be hot as hell, fight badass, and look great at the same time—the same way men want Superman to have huge pecs and an impractically big body.\"[17] Jenkins also notes that she is \"frustrated\" by the critique of Wonder Woman's appearance, stating \"when people get super critical about her outfit, who's the one getting crazy about what a woman wears? That's who she is; that's Wonder Woman.\"[245] Gal Gadot concurred with Jenkins, arguing that the character \"is a feminist\"[248] as \"feminism is about equality and choice and freedom. And the writers, Patty and myself all figured that the best way to show that is to show Diana as having no awareness of social roles. She has no gender boundaries. To her, everyone is equal.\"[249]\n\nCritics such as Valerie Estelle Frankel support Jenkins's vision. Frankel argues that the film subverts the male gaze,[246] stating that the construction of Wonder Woman tends to shift every few decades as it reflects the state of feminism during different time periods, including third-wave feminism (which reflects Jenkins's approach).[246][250][251] Zoe Williams offers a similar argument, stating that while Wonder Woman \"is sort of naked a lot of the time,\" that is not, at the same time, \"objectification so much as a cultural reset: having thighs, actual thighs you can kick things with, not thighs that look like arms, is a feminist act\".[252] Williams then juxtaposes Wonder Woman to past female action heroes such as Sarah Connor, Ellen Ripley, and Lara Croft, whom she suggests were all constructed for the male gaze, in which a \"female warrior becomes a sex object\", (a point which she argues that Jenkins directly references in the film).[252]\n\nGloria Steinem also liked the film, stating that she felt it made the \"Amazon origin story clear; [Wonder Woman] was stopping war, not perpetuating it.\" Steinem also noted that she knew \"some women were disappointed by all the makeup, but I may be desperate—I was just happy that the Amazons had wild hair!\" Her only complaint lay in the choice to eliminate the World War II setting as the Wonder Woman comic book developed in response to existing comics that were \"so sadistic and racist that there was a congressional hearing on the subject\".[253] Steinem also gave Hillary Clinton the first Wonder Woman Award in October 2017 during the Women's Media Center's \"Speaking Truth to Power Awards\" (an organization created by Steinem, Jane Fonda, and Robin Morgan). Upon receiving the award, Clinton noted that she had seen Jenkins's Wonder Woman film and that she \"loved the outfit\". She also said that as her granddaughter was \"really keen\" on Wonder Woman, Clinton \"thought maybe I could borrow something from her for the night. It didn't quite work for me, but I will say that this award means a lot to me because as a little girl, and then as a young woman, and then as a slightly older woman, I always wondered when Wonder Woman would have her time, and now that has happened.\"[254] Clinton had previously praised Jenkins's film, in a public August 2017 message, stating that \"it was just as inspirational as I'd suspected a movie about a strong, powerful woman in a fight to save the world from international disaster would be.\"[255][256][257]\n\nDirector James Cameron continued this debate, through his critique of the representation of female power in Jenkins's film. In an August 2017 interview with The Guardian, Cameron qualifies Jenkins's vision of Wonder Woman as \"an objectified icon\" and called the film \"a step backwards\". In contrast, he states, his character Sarah Connor (from his Terminator films) \"was not a beauty icon. She was strong, she was troubled, she was a terrible mother, and she earned the respect of the audience through pure grit.\"[258] Jenkins stated in response that Cameron's \"inability to understand what 'Wonder Woman' is, or stands for, to women all over the world is unsurprising as, though he is a great filmmaker, he is not a woman\". She further argued \"there is no right and wrong kind of powerful woman\" because \"if women have to always be hard, tough and troubled to be strong, and we aren't free to be multidimensional or celebrate an icon of women everywhere because she is attractive and loving, then we haven't come very far have we.\"[259] Reaction to this debate was mixed. Julie Miller sided with Cameron, whom she states refers to himself as \"a pretty hardcore feminist\" and who told Vulture that \"I have no problem writing a script in which the males become subservient to the females, which is what happens in Aliens ... It's up to Ripley to win the day.\" In contrast, Miller argues that Jenkins and Gadot envisioned Wonder Woman as \"a woman who exuded both femininity and strength, along with genuine confusion as to why men would treat women differently than they do other men\".[260] Susannah Breslin also agreed with Cameron, describing Jenkins's Wonder Woman as \"a Playmate with a lasso\" and \"female power with no balls\".[261] Others were more critical of Cameron's critique.[262] An article in Newsweek suggests that in contrast to his criticism of Jenkins, Cameron's own films include \"lot of objectification\" and quotes a few Hollywood celebrities who echoed this view. One of the quotes came from Jesse McLaren who states that \"James Cameron's just confused there's a female hero whose motivations aren't centered around motherhood.\"[263] Noah Berlatsky found areas of agreement between both Cameron and Jenkins, stating that while Cameron's objection is \"an old point that's been made over and over for decades\", Jenkins's film is not \"solely focused on objectifying Gal Gadot for a male audience\".[264]\n\nA few weeks later in September, Cameron reiterated his criticism in an interview with The Hollywood Reporter. He compared Gal Gadot's representation of the character to Raquel Welch films of the 1960s,[265] and reinforced a comparison with Linda Hamilton's portrayal of Sarah Connor. He argued that Connor was \"if not ahead of its time, at least a breakthrough in its time\" because though she \"looked great\", she \"wasn't treated as a sex object\".[265] He also stated that he while he \"applaud[s] Patty directing the film and Hollywood, uh, 'letting' a woman direct a major action franchise, I didn't think there was anything groundbreaking in Wonder Woman. I thought it was a good film. Period.\"[265] Former Wonder Woman actress Lynda Carter responded to Cameron's The Hollywood Reporter interview by asking him to \"Stop dissing WW.\" Like Jenkins, she suggests that while Cameron does \"not understand the character\", she does. She also refers to Cameron's critiques as \"thuggish jabs at a brilliant director\" that are as \"ill advised\" as the \"movie was spot on.\" Carter also states that she has the authority to make these observations because she has \"embodied this character for more than 40 years\".[266][267][268] A month later, Jenkins responded to Cameron's comments once again in an interview with Variety, stating that she \"was not upset at all\", as \"everybody is entitled to their own opinion. But if you're going to debate something in a public way, I have to reply that I think it's incorrect.\"[269] Tricia Ennis was also critical of Cameron's statements, arguing that \"while he may consider himself a feminist and an ally to women, [he] is not very good at it\" as being an ally means using his position of privilege \"without silencing the voices of those you're trying to help\". She also states that it \"is not enough to simply call yourself a feminist. It's not even enough to create a strong female character ... You have to bring women to the table. You have to let them speak. You cannot speak for them. But speaking for women is exactly what Cameron is doing through his comments ... Cameron is using his position of power as a respected producer and director to silence women.\"[270]\n\nAccolades [ edit ]\n\nFuture [ edit ]\n\nSequel [ edit ]\n\nOriginally signed for three feature films, with Wonder Woman and Justice League being her second and third films, Gadot signed an extension to her contract for additional films.[317] Jenkins initially signed for only one film,[318] but in an interview with Variety, Geoff Johns revealed that he and Jenkins were writing the treatment for a Wonder Woman sequel and that he has a \"cool idea for the second one\". At the 2017 San Diego Comic Con, Warner Bros. officially announced a sequel would be released on December 13, 2019, and would be titled Wonder Woman 2; the date was later moved up to November 1, 2019, to avoid competition with Star Wars: The Rise of Skywalker.[320][321] Later, Jenkins was officially signed to return as director, with confirmation that Gadot will be returning as the titular role.[322] Days later, the studio hired Dave Callaham to co-write the film's script with Jenkins and Johns.[323] On March 9, 2018, Kristen Wiig was confirmed to play Cheetah, the villain of the film.[324] Later that month, it was announced that Pedro Pascal would have a key role in the film.[325] In May 2018, long-time DCEU producer Zack Snyder confirmed on social media platform Vero that he, along with wife Deborah Snyder, will serve as producers on the Wonder Woman sequel.[326] In June 2018, the title of the film was announced to be Wonder Woman 1984.[327] A third film was announced in January 2019 to be taking place in the present.[328] Wonder Woman 1984 was then pushed back to August 14, 2020, as a result of the 2019–20 coronavirus pandemic.\n\nIt was announced that an Amazons spin-off film is in the works with Patty Jenkins executive producing the film.[329]\n\nNotes [ edit ]\n\na b This is by an adjusted Rotten Tomatoes rating with at least 20 reviews each that, uses a weighted Bayesian based formula to account for the differences in ratings.", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/24px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/en/e/ed/Wonder_Woman_%282017_film%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Geoff_Johns_%26_Patty_Jenkins_%2833733608431%29.jpg/220px-Geoff_Johns_%26_Patty_Jenkins_%2833733608431%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Igromir_2016_%2829756516910%29.jpg/170px-Igromir_2016_%2829756516910%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/20px-Edit-clear.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/13px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/21px-Video-x-generic.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Dragon-149393.svg/20px-Dragon-149393.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Gal_Gadot_cropped_lighting_corrected_2b.jpg/192px-Gal_Gadot_cropped_lighting_corrected_2b.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Chris_Pine_by_Gage_Skidmore.jpg/192px-Chris_Pine_by_Gage_Skidmore.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/e/ed/Wonder_Woman_%282017_film%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Wonder_Woman_(2017_film)", "title": "Wonder Woman (2017 film)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/e/ed/Wonder_Woman_%282017_film%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}