{"url": "https://www.mercurynews.com/2017/12/26/wheres-pregnant-kylie-jenner-fans-outraged-shes-not-on-kardashian-christmas-card/", "text": "(If you’re having trouble viewing this video on a mobile device, click here.)\n\nWhere’s Kylie? That’s the question Kardashian fans were asking when the reality TV family finally unveiled their annual Christmas card Monday afternoon but a reportedly pregnant Kylie Jenner was noticeably absent.\n\nIn fact, fans were fuming on Twitter and elsewhere that they had fallen for what turned out to be a 25-day-long tease to the card’s release.\n\nEach day, starting Dec. 1, Kim Kardashian and other members of the clan released a photo from the family’s Christmas card photo shoot, showing different group shots, including of Kim and Kanye West with their two kids, North and Saint.\n\nFans had expected that 20-year-old Kylie, reported to be well into her first pregnancy with her rapper boyfriend Travis Scott, would finally display her baby bump on the Dec. 25 card.\n\nInstead, the card showed nearly all the Kardashian-Jenner women and grandchildren, including Kris Jenner and grandmother Mary Jo “M.J.” Houghton. But there was no Kylie Jenner.\n\nKhloe Kardashian was there, though with no baby bump yet visible, possibly because the photo shoot took place sometime in early November, E! News reported. She already had confirmed her pregnancy on Dec. 20 with a baby bump photo posted to her Instagram account.\n\nKhloe’s long-expected public acknowledgement that, yes, she is having a baby with NBA star Tristan Thompson raised fans’ expectations that Kylie would use the family’s annual card to publicly confirm her pregnancy as well.\n\nBut when Kylie didn’t, fans seemed ready to declare a national state of emergency or a state of something related to the family.\n\n“Maybe we should call the authorities because @KylieJenner is still missing from the damn Kardashian Christmas card,” one fan tweeted.\n\n“I need to see the BELLY,” wrote another.\n\n“I hate that I am so invested in Kylie Jenner’s alleged pregnancy,” another tweeted.\n\nOthers grew more belligerent and hurled expletives:\n\n“Lmaoooooo THEY MIND F—KED US ALL MONTH LONG!!!!” one put it bluntly. “What is this total f—kery they have done to us!!! C’mon @KylieJenner @KimKardashian we wanted Kylie on the damn 25th day!!!”\n\nBut the young lip kit mogul wasn’t in total hiding on Christmas Day. She and big brother Rob Kardashian, who also was absent from the family holiday card photos, appeared on Khloe’s Snapchat on Monday. Kylie also shared a photo of herself on the cover of Love magazine, though the photo only showed her face.\n\nStill her absence from the Christmas card itself left fans wondering if she’ll ever confirm her pregnancy or what other occasion she’s holding out for — perhaps for the next season of “Keeping Up With the Kardashians.”\n\nHere are some more fan reactions:\n\nthis would’ve been the perfect marketing ploy. so why didn’t they use it? where is kylie and that bump? pic.twitter.com/E77ur2KJnY — 💿 (@squareups) December 26, 2017\n\nShe must be behind that tree — 🌻📷 (@IviweVikki) December 26, 2017", "images": ["https://www.mercurynews.com/wp-content/themes/mercurynews/static/images/noimage.jpg", "https://www.mercurynews.com/wp-content/uploads/2017/12/kardashiancardday24.jpg?w=450&h=297", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg", "http://thumbnail.newsinc.com/33377251.sf.jpg"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2017/12/kardashiancardday24.jpg?w=450&h=297", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2017/12/26/wheres-pregnant-kylie-jenner-fans-outraged-shes-not-on-kardashian-christmas-card/", "title": "Where’s pregnant Kylie Jenner? Fans outraged she’s not on Kardashian Christmas card", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "Fans had expected that Kylie Jenner would finally confirm her pregnancy by showing a baby bump on the Kardashian family Christmas card released Monday.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Where’s pregnant Kylie Jenner? Fans outraged she’s not on Kardashian Christmas card", "url": "https://www.mercurynews.com/2017/12/26/wheres-pregnant-kylie-jenner-fans-outraged-shes-not-on-kardashian-christmas-card/", "description": "Fans had expected that Kylie Jenner would finally confirm her pregnancy by showing a baby bump on the annual Kardashian family Christmas card released Monday.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2017/12/kardashiancardday24.jpg?w=450&h=297", "width": 450, "height": 297}, "locale": "en_US"}, "article": {"published_time": "2017-12-26T13:34:51+00:00", "modified_time": "2017-12-26T20:21:47+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Where’s pregnant Kylie Jenner? Fans outraged she’s not on Kardashian Christmas card"}, "image": "https://www.mercurynews.com/wp-content/uploads/2017/12/kardashiancardday24.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1514217600.0, "source": "https://www.mercurynews.com", "summary": ""}