{"url": "projectbritain.com/royal/succession.htm", "text": "The Line of Succession to the British Throne\n\nWho will be the next King or Queen?\n\nHRH Prince Charles, The Prince of Wales\n\nPrince Charles is presently heir (next in line) to the British throne. He will not become king until his mother, Queen Elizabeth, abdicates (gives up the throne), retires or dies. When either of these happen, Prince Charles may abdicate and pass the throne to his eldest son Prince William. What is the title of the heir to the British throne? The heir to the throne is always called the Prince of Wales. The title was introduced by King Edward l in 1301, after the conquest of Wales. If the eldest child of the monarch is female, will she become heir to the throne? Yes, if she does not have any brothers. No, if she has a brother. In Britain the crown was normally passed from monarch to eldest son. As King George VI had no son, it passed to his elder daughter, now Queen Elizabeth II. If a monarch had sons, they took precedence over daughters: thus, although HR The Princess Royal is older than her brothers HRH The Duke of York and HRH The Earl of Wessex, they (and their children) precede her in the order of succession. From 2013, this all changes. Now the oldest child in herit the throne regardless of being a daughter or a son. This means that if William and Kate had had a daughter she would have inherited the throne even if she had a younger brother. The Succession to the Crown Act 2013 Succession to the Crown not to depend on gender\n\nIn determining the succession to the Crown, the gender of a person born after 28 October 2011 does not give that person, or that person's descendants, precedence over any other person (whenever born). Who can be heir to the British throne? Up until 2013, the succession in the United Kingdom was governed by the Act of Union 1800, which restated the provisions of the Act of Settlement 1701 and the Bill of Rights (1689). Pre 2013 'Only Protestant heirs of Princess Sophia, granddaughter of James I, may succeed to the British throne. Neither Catholics, nor those who marry a Catholic, nor those born out of wedlock, may remain in the line of succession.' The Succession to the Crown Act 2013 2. Removal of disqualification arising from marriage to a Roman Catholic\n\nA person is not disqualified from succeeding to the Crown or from possessing it as a result of marrying a person of the Roman Catholic faith.\n\nThe current Royal Line of Succession is:\n\n(see also the Royal Family Tree ) HRH The Prince Charles, The Prince of Wales (1948), eldest son of HM Queen Elizabeth II HRH Prince William of Wales (1982), elder son of HRH The Prince Charles, The Prince of Wales Prince George of Cambridge (b 2013), son of Prince William, Duke of Cambridge\n\nHRH Prince Henry of Wales (popularly referred to as Prince Harry), (1984), younger son of HRH The Prince Charles, The Prince of Wales HRH The Prince Andrew, The Duke of York (1960), second son of HM Queen Elizabeth II HRH Princess Beatrice of York (1988), elder daughter of HRH The Prince Andrew, The Duke of York HRH Princess Eugenie of York (1990), younger daughter of HRH The Prince Andrew, The Duke of York HRH The Prince Edward, The Earl of Wessex (1964), youngest son of HM Queen Elizabeth II James Windsor, Viscount Severn (2007), son of HRH The Prince Edward, The Earl of Wessex Lady Louise Windsor (2003), daughter of HRH The Prince Edward, The Earl of Wessex HRH The Princess Anne, The Princess Royal (1950), only daughter of HM Queen Elizabeth II Peter Phillips (1977), son of HRH The Princess Anne, The Princess Royal Zara Phillips (1981), daughter of HRH The Princess Anne, The Princess Royal David Armstrong-Jones, Viscount Linley (1961), son of HRH The Princess Margaret, Countess of Snowdon The Honourable Charles Armstrong-Jones (1999), son of David Armstrong-Jones, Viscount Linley The Honourable Margarita Armstrong-Jones (2002), daughter of David Armstrong-Jones, Viscount Linley Lady Sarah Chatto (1964), daughter of HRH The Princess Margaret, Countess of Snowdon Samuel Chatto (1996), son of Lady Sarah Chatto Arthur Chatto (1999), son of Lady Sarah Chatto HRH Prince Richard, The Duke of Gloucester (1944), son of HRH The Prince Henry, Duke of Gloucester, 3rd son of HM King George V\n\nRoyal Family Tree", "images": ["http://projectbritain.com/royal/family/charles.jpg", "http://projectbritain.com/images/titlepages/year.jpg", "http://projectbritain.com/images/titlepages/history.jpg", "http://projectbritain.com/images/titlepages/royal.jpg", "http://projectbritain.com/customs/template/ba_top.jpg", "http://projectbritain.com/images/titlepages/london.jpg", "http://projectbritain.com/template/googlepluslogo.jpg", "http://projectbritain.com/images/titlepages/british.jpg", "http://www.projectbritain.com/Favicon.ico", "http://projectbritain.com/template/email.png", "http://projectbritain.com/template/m_twitter.gif", "http://projectbritain.com/images/titlepages/thames.jpg", "http://projectbritain.com/template/n_twitter.gif", "http://projectbritain.com/template/spacer.gif", "http://projectbritain.com/customs/template/royal.jpg"], "top_img": "http://www.projectbritain.com/Favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Order of Succession to the British Throne", "meta_data": {"description": "The Royal Family line of succession - the frequently asked questions about who will be the next British king or queen", "keywords": "line of succession royal family, British Royal Family, Queen Elizabeth, Prince Charles, Prince William, Prince Harry"}, "movies": [], "publish_date": null, "source": "http://projectbritain.com", "summary": ""}