{"url": "https://web.archive.org/web/20080623122709/http://www.sciam.com/article.cfm?id=a-solar-grand-plan", "text": "Spacer\n\nBack\n\nIMAGE 1 of 8\n\nof 8 Next\n\n\n\nKey Concepts A massive switch from coal, oil, natural gas and nuclear power plants to solar power plants could supply 69 percent of the U.S.’s electricity and 35 percent of its total energy by 2050.\n\nA vast area of photovoltaic cells would have to be erected in the Southwest. Excess daytime energy would be stored as compressed air in underground caverns to be tapped during nighttime hours.\n\nLarge solar concentrator power plants would be built as well.\n\nA new direct-current power transmission backbone would deliver solar electricity across the country.\n\nBut $420 billion in subsidies from 2011 to 2050 would be required to fund the infrastructure and make it cost-competitive. —The Editors\n\nHigh prices for gasoline and home heating oil are here to stay. The U.S. is at war in the Middle East at least in part to protect its foreign oil interests. And as China, India and other nations rapidly increase their demand for fossil fuels, future fighting over energy looms large. In the meantime, power plants that burn coal, oil and natural gas, as well as vehicles everywhere, continue to pour millions of tons of pollutants and greenhouse gases into the atmosphere annually, threatening the planet.\n\nWell-meaning scientists, engineers, economists and politicians have proposed various steps that could slightly reduce fossil-fuel use and emissions. These steps are not enough. The U.S. needs a bold plan to free itself from fossil fuels. Our analysis convinces us that a massive switch to solar power is the logical answer.\n\nSolar energy’s potential is off the chart. The energy in sunlight striking the earth for 40 minutes is equivalent to global energy consumption for a year. The U.S. is lucky to be endowed with a vast resource; at least 250,000 square miles of land in the Southwest alone are suitable for constructing solar power plants, and that land receives more than 4,500 quadrillion British thermal units (Btu) of solar radiation a year. Converting only 2.5 percent of that radiation into electricity would match the nation’s total energy consumption in 2006.\n\nTo convert the country to solar power, huge tracts of land would have to be covered with photovoltaic panels and solar heating troughs. A direct-current (DC) transmission backbone would also have to be erected to send that energy efficiently across the nation.\n\nThe technology is ready. On the following pages we present a grand plan that could provide 69 percent of the U.S.’s electricity and 35 percent of its total energy (which includes transportation) with solar power by 2050. We project that this energy could be sold to consumers at rates equivalent to today’s rates for conventional power sources, about five cents per kilowatt-hour (kWh). If wind, biomass and geothermal sources were also developed, renewable energy could provide 100 percent of the nation’s electricity and 90 percent of its energy by 2100.\n\nThe federal government would have to invest more than $400 billion over the next 40 years to complete the 2050 plan. That investment is substantial, but the payoff is greater. Solar plants consume little or no fuel, saving billions of dollars year after year. The infrastructure would displace 300 large coal-fired power plants and 300 more large natural gas plants and all the fuels they consume. The plan would effectively eliminate all imported oil, fundamentally cutting U.S. trade deficits and easing political tension in the Middle East and elsewhere. Because solar technologies are almost pollution-free, the plan would also reduce greenhouse gas emissions from power plants by 1.7 billion tons a year, and another 1.9 billion tons from gasoline vehicles would be displaced by plug-in hybrids refueled by the solar power grid. In 2050 U.S. carbon dioxide emissions would be 62 percent below 2005 levels, putting a major brake on global warming.\n\nPhotovoltaic Farms\n\nIn the past few years the cost to produce photovoltaic cells and modules has dropped significantly, opening the way for large-scale deployment. Various cell types exist, but the least expen­sive modules today are thin films made of cadmium telluride. To provide electricity at six cents per kWh by 2020, cadmium telluride modules would have to convert electricity with 14 percent efficiency, and systems would have to be installed at $1.20 per watt of capacity. Current modules have 10 percent efficiency and an installed system cost of about $4 per watt. Progress is clearly needed, but the technology is advancing quickly; commercial efficiencies have risen from 9 to 10 percent in the past 12 months. It is worth noting, too, that as modules improve, rooftop photovoltaics will become more cost-competitive for homeowners, reducing daytime electricity demand.", "images": ["https://web.archive.org/web/20080623122709im_/http://www.sciam.com/assets/img/interface/toolTextSize.gif", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/assets/img/interface/alsoOnSciAm.gif", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/assets/img/global_elements/share_3.gif", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/assets/img/interface/font_minus_off.gif", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/assets/img/interface/toolPrint.gif", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/assets/img/headers/sub/also-in-this.gif", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/assets/img/interface/SAOn.gif", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/media/inline/A2B9DE5C-DF8C-28C4-F7FC2BDB6A4338D9_1.jpg", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/assets/img/global_elements/popularstories.gif", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/assets/img/global_elements/lateststories.gif", "https://web.archive.org/web/20080623122709im_/http://pixel.quantserve.com/pixel/p-8dwHOLIwK6auU.gif", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/assets/img/global_elements/mixx-button4.png", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/assets/img/interface/articleEnvelope.gif", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/assets/img/interface/font_plus.gif", "https://web.archive.org/web/20080623122709im_/http://sciam.vo.llnwd.net/o16/20080620T103408Z-P-TNS-RCON-C513-NVO-CHINABOTTLES_lg.jpg", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/assets/img/global_elements/fromreuters.gif", "https://web.archive.org/web/20080623122709im_/http://sciam.vo.llnwd.net/o16/20080619T100041Z-P-TNS-RCON-C410-NVO-CHINAEVACUATION_lg.jpg", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/assets/img/interface/alsoInSA.gif", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/assets/img/headers/subCtrHdr.gif", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/assets/img/global_elements/newstrust.gif", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/media/inline/A31B0D53-B03B-C170-E7FABF0D0412506A_1.jpg", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/assets/img/global_elements/clear.gif", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/media/inline/A6E8FDDD-9037-C7E2-7A1A76E24FE6D809_1.jpg", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/assets/img/interface/toolEmail.gif", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/assets/img/global_elements/facebook_share_icon.gif", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/assets/img/interface/MindOff.gif", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/assets/img/global_elements/latestnews_rss.jpg", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/media/inline/A2F191C5-D749-40FB-3F1E3391A0E46DAA_1.jpg", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/media/expiredImg_320x320.gif", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/assets/img/global_elements/60SS_320.jpg", "https://web.archive.org/web/20080623122709im_/http://sciam.vo.llnwd.net/o16/20080619T160906Z-P-TNS-RCON-C422-NVO-USAMIDWESTFLOODS_lg.jpg", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/assets/img/global_elements/latestvideos.gif", "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/assets/img/interface/DigOff.gif"], "top_img": "https://web.archive.org/web/20080623122709im_/http://www.sciam.com/media/expiredImg_320x320.gif", "keywords": [], "authors": [], "canonical_link": "", "title": "A Solar Grand Plan: Scientific American", "meta_data": {"description": "By 2050 solar power could end U.S. dependence on \nforeign oil and slash greenhouse gas emissions"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}