{"url": "https://www.instyle.com/news/peoples-choice-awards-2018-best-moments", "text": "Image zoom Todd Williamson/E! Entertainment/Getty Images\n\nThe E! People's Choice Awards brought together plenty of star power. Reality royalty rubbed shoulders with fashion royalty and even though the headlines seemed to cast a shadow over the night's festivities, there was plenty of applause for the night's winners. Here's what you missed — and what everyone will be talking about tomorrow.\n\nThe Shoutouts To Veterans and First Responders\n\nAttendees and honorees alike thanked first responders, firefighters, police officers, and volunteers. On the red carpet, Mila Kunis made sure that everyone was aware that the awards show was happening during something much larger — the fires raging across California. And the stars gave America's veterans some love, too. The show fell on Veteran's Day, so the homage was fitting.\n\nAccording to E!, when they accepted the award for Movie of 2018, Avengers: Infinity War co-stars Pom Klementieff, Scarlett Johansson, and Danai Gurira, mentioned the hard work taking place throughout California to contain the flames.\n\n\"We want to take the moment to dedicate this to the great state of California,\" Gurira said. \"The devastation and the turmoil that we are going through right now, we are with you, our thoughts and our prayers and our hearts are with you.\"\n\nNicki's Thirsty for Michael B. Jordan, Proving She's Just One of Us\n\nDuring her acceptance speech for Album of the Year, Nicki Minaj gave viewers a bit of inspiration, dedicating her award to anyone out there chasing their dreams.\n\n\"Thank you to all of the queens around the world that are maybe not at the place they want to be in their lives, but the fact that you are pushing and you are not being lazy and not complaining but going for your dreams every day, shout out to you,\" she said.\n\n. @NickiMinaj takes home the award for Female Artist and says in her speech: “Shout out to Donatella for making me this custom Versace, and shout out to Michael B. Jordan who is gonna be taking it off me tonight.” #PCAs pic.twitter.com/95pkzTFM3a — Ashley Lee (@cashleelee) November 12, 2018\n\nHowever, the kicker came when she got another award: Favorite Female Artist. At the podium, she thanked Donatella Versace for the gown she was wearing and gave a little wink before giving a little lip service to Michael B. Jordan.\n\n\"I can't imagine my life without you. I love you to pieces. I can't wait to see you guys on tour,\" she said to her fans, before adding, \"Shout out to Michael B. Jordan because he's going to be taking this [dress] off of me tonight.\"\n\nThe Kardashians Came Out in Full Force\n\nImage zoom Todd Williamson/E! Entertainment/Getty Images\n\nThe Kardashians spent much of the last few days worrying about whether or not their homes would survive the flames. But they were up for an award for Favorite Reality Show and Khloé was up for Favorite Reality Star, so duty called. Kim, Khloé, and Kourtney were all in attendance, as well as Kendall and Kris Jenner. During her acceptance speech, Kim thanked first responders and dedicated her family's award — Keeping Up with the Kardashians ended up winning — to everyone working to contain the fires.\n\nOnce a Spice Girl, Always a Spice Girl\n\nVictoria Beckham isn't going on tour with her Spice sisters, but she'll always be Posh Spice. During her speech, she didn't just offer words of gratitude, she let everyone out there that their dreams are attainable, even if they seem too out of reach.\n\nVIDEO: Victoria Beckham Needed an Outfit for the People's Choice Awards, So She Made It Herself\n\n\"If you really, really want it,\" she said after model Amber Valetta handed her the Fashion Icon Award. \"If you really, really put your head down and you focus and you work hard and you believe in yourself, what you can achieve is incredible. Many years ago, I started with girl power and now that message is still strong as ever.\" She concluded by saying that women everywhere have the power to achieve anything, even if they're struggling. \"If you've ever been doubted, this award tonight is for all of us.\"\n\nCrusoe Steals the Spotlight\n\nEven with all the star power on the red carpet, one attendee stole the show. Crusoe the dachshund, Winner of Animal Star 2018, arrived in high style wearing a bow tie and polka-dot shirt. E! even gave him a shoutout on Twitter, congratulating him on his award and posting a glam-cam GIF that will have everyone forgetting about the night's other award winners.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fimages%2F2018%2F02%2Fellen-pompeo-5.jpg&q=85&w=200", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fimages%2F2018%2F02%2F022318-danielle-brooks-baw-lead.jpg&q=85&w=200", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fimages%2F2018%2F08%2Farticles_african-hair.jpg&q=85&w=200", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F684xflex%2Fpublic%2Fimages%2F2018%2F11%2Fgettyimages-1060536928.jpg%3Fitok%3D59UGv7Ma", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F622x350%2Fpublic%2Fimages%2F2018%2F11%2Fgettyimages-1060536928.jpg%3Fitok%3DMw0GkoU7"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F622x350%2Fpublic%2Fimages%2F2018%2F11%2Fgettyimages-1060536928.jpg%3Fitok%3DMw0GkoU7", "keywords": [], "authors": ["Christopher Luu"], "canonical_link": "https://www.instyle.com/news/peoples-choice-awards-2018-best-moments", "title": "Everything You Missed at the People's Choice Awards", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "latest,Celebrity,People's Choice Awards,Nicki Minaj,Mila Kunis,Victoria Beckham,Kim Kardashian West", "news_keywords": "People's Choice Awards, Peoples Choice, Kim Kardashian, Kardashians, Nicki Minaj, Victoria Beckham", "description": "From vets and first responders to a very glamorous pet.", "og": {"title": "Everything You Missed at the People's Choice Awards", "type": "article", "site_name": "InStyle", "url": "https://www.instyle.com/news/peoples-choice-awards-2018-best-moments", "description": "From vets and first responders to a very glamorous pet.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F622x350%2Fpublic%2Fimages%2F2018%2F11%2Fgettyimages-1060536928.jpg%3Fitok%3DMw0GkoU7"}, "pinterest": {"url": "https://www.instyle.com/news/peoples-choice-awards-2018-best-moments", "description": "From vets and first responders to a very glamorous pet.", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F622x350%2Fpublic%2Fimages%2F2018%2F11%2Fgettyimages-1060536928.jpg%3Fitok%3DMw0GkoU7"}, "twitter": {"card": "summary_large_image", "url": "https://www.instyle.com/news/peoples-choice-awards-2018-best-moments", "title": "Everything You Missed at the People's Choice Awards", "description": "From vets and first responders to a very glamorous pet.", "site": "@InStyle", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F622x350%2Fpublic%2Fimages%2F2018%2F11%2Fgettyimages-1060536928.jpg%3Fitok%3DMw0GkoU7"}, "fb": {"app_id": 1846286175658788, "pages": 18938064984}}, "movies": [], "publish_date": null, "source": "https://www.instyle.com", "summary": ""}