{"url": "https://www.elle.com/fashion/shopping/a23413717/naked-wardrobe-affordable-kardashians-j-lo-lady-gaga/", "text": "Shida Kaviani, Shirin Kaviani, Shideh Kaviani. Those names probably don't immediately ring any bells, but a mention of the sisters' popular and super affordable clothing brand, Naked Wardrobe, should do the trick. The label, whose Instagram page boasts over 1.1 million followers, was founded in 2012 on the desire to create basic wardrobe essentials—bodysuits, biker shorts, and figure-hugging dresses, all of which fall under the $100 price point—that not only \"look good, but feel good and makes customers happy, all at an affordable price.\" In six years, Naked Wardrobe's initial collection has expanded to include luxe faux fur coats, sexy (thong) bathing suits, and other late-night-ready pieces.\n\nWith fast-fashion brands and influencers dominating our social feeds, loyalty is the hardest thing for a brand to obtain and the easiest thing for them to lose. But Naked Wardrobe doesn't seem to have that problem, especially when the Kardashian/Jenner sisters, Jennifer Lopez, Lady Gaga, and Beyonce (!) are pretty much the brand's unofficial brand ambassadors.\n\n\n\nWe caught up with the founders of Naked Wardrobe to get the scoop on how they got their start, the secret to running their cult-favorite brand, and how they've built their celebrity clientele.\n\nNaked Wardrobe is six this year! How'd it all start?\n\nShideh: We started out of our parents’ house six years ago. It all started because we all have a shopping addiction. We have a passion for fashion and for ordering stuff online and having them be delivered to our door. Back then, when we first started doing e-comm, people were really hesitant to shop online. It just wasn’t the norm back then and social media was different. But social media allowed us to have this platform to really grow our business.\n\n\n\nDid you all study any fashion in school?\n\nShideh: Yeah! I studied Fashion design at FIDM and I got a bachelors in business managemen,t so I definitely had some direction and insight when it came to fashion and the business side of things.\n\nShida: I studied communications and PR and I worked in PR. I got my feet wet at Capitol records and Warner Brother’s PR and learned the ropes in that aspect.\n\nShirin: I studied graphic design and I have a little bit of a computer science background. I work well with a computer—I’m a little bit of a geek—so an online shop was kind of the way to go for that and is what pushed us to launch one.\n\nWhat was the initial reason you all launched Naked Wardrobe?\n\nShideh: High quality fashion at an affordable price. Either it was high quality and you had to pay like $100 for a t-shirt, or get something that was not as high quality and more on the disposable end for $15-$25. There weren't many affordable options then, and at that time, the recession was still impacting the economy. I felt like it was important to introduce a line that was really high in quality but still affordable for the masses.\n\n\n\nShirin: We’re aware that the majority of the world can’t afford $100 pieces and we wanted to make sure that if we bring out a line that you can wash x amount of times, it’s still not going to get damaged; that when you wear it you feel great and comfortable, the fabric feels amazing and that’s why a lot of celebrities gravitate towards it. Whether they wear it or someone who's interning wears it, we’re all the same in the end and it’s nice that everyone from different spectrums can wear the brand.\n\nHow long after you launched did business really start to pick up?\n\nShideh: When we first started, we really didn’t know where it would go. We thought we would be able to wear a bunch of free clothes that we were selling ourselves. But from the first day we launched, we started to bring in the revenue, and it’s just been growing ever since.\n\nWalk me through the creative process.\n\nShideh: When it comes to designing, I want it to be something that’s comfortable, sexy, that people feel good in. My sister Shirin is really adamant about us creating trends and starting things and revolutionizing different fashions. So she helps me to put out pieces that are innovative but still basic at the same time. When you think basics, you think, “God, it must be so easy to find because it’s something simple,” but it’s truly harder to find something so simple, so we really strive to do that. When it comes to our color palette, we like to test the waters, but we’re true neutral lovers. We’re very black, white, brown, and grey, but people like color so we like to incorporate some pieces with color throughout the years.\n\nWe’re in the age of fast-fashion, so when it comes to manufacturing and production on our end, we try to do 90% of it here, locally, so that we can have more control. Our typical turnaround is anywhere from two to four weeks and if something sells out we’re able to replenish in a timely manner. We don’t have many production issues, and I think that’s our strong suit.\n\nCustomers are a lot more conscious when it comes to brands who push for inclusivity. How do you make sure every woman is represented?\n\nShideh: I think something that’s really important to us and has been from the start is the fabric choices. The last thing we want is for them to order the garments, get it, and then it doesn’t fit in specific places. We wanted the main selling point to be when they receive the product, it looks good, but feels good and makes customers happy, all at an affordable price. We really think about those things in the initial design state and when we’re selecting the design fabric. If something doesn’t have enough stretch, it’s not gonna fit everybody type. We owe it all to our fabric.\n\nShirin: The three of us have different body types as well, so we think about that when we design.\n\nWith 1.2 million followers and a booming clothing label, what are some of the challenges you all face?\n\nShideh: Social media.\n\nReally?\n\nShideh: We owe all our success to social media because it provided us a platform to reach everyone in the world, but Instagram has definitely changed over the years. All these brands came onto the platform and saw the power Instagram had and wanted to get a piece of the pie. A lot of brands came and changed things around, so it’s been quite challenging learning how to maneuver and what it’s going to take for people to engage more or bring our following up. Something we don’t do with our brand in particular is paid advertisements. We’re all about having organic traffic, so we don’t do any paid posts at all—on social media or any avenue. So where most brands are paying influencers to market their products, our challenge is targeting more people and growing the brand organically.\n\nWhy take that approach instead of just going the easy route and paying these influencers?\n\nShideh: Influencers are running Instagram and we know a lot of people look at brands that pay influencers to promote like, “Can we trust this brand?” It’s really hard for us to stay away from that type of marketing, especially when we can see our competitors doing that, but for us it’s so important for people to truly like the brand and for them to buy the products themselves.\n\nHow else would you say Naked Wardrobe has set themselves apart from its competitors?\n\nShideh: I think we just really created this cult following because people truly love the product and it really speaks for itself. Even though the economy has changed and everything is a lot more expensive, we never bring our prices up while continuing to maintain the same quality.\n\nShirin: It’s really the product. We do have customers that write, ‘We see your clothes on J. Lo. Thank you for not raising your prices even though all these celebrities are wearing your brand.' We make it a point to stay true to the brand no matter who’s wearing it and people appreciate that.\n\nWhy is it important for you all to keep Naked Wardrobe at an affordable price point, even with all the recognition the brand has received?\n\n\n\nShideh: The majority of our followers don’t have millions of dollars to spend on clothing. It’s really important to us to cater to that group instead of the celebrities.\n\nShida: From day one, we wanted to create an affordable, high-quality line, it’s always been our vision and we never had any intention of changing. That really is our mission and it’s something we have to stay true to. Do we take a lot of losses on our end because of it? Sure, absolutely. But we do whatever we can to please our customers.\n\nShirene: If we could give away clothes for free we would. We actually donate a ton of clothing at the end of each year.\n\n\n\nWhen people hear Naked Wardrobe, what type of woman do you want them to envision?\n\nShideh: Every woman. It’s the woman going to the club, going on a date, going to the store, or even the one at the gym.\n\nShida: Well that’s your interpretation. When I think about the girl who wears Naked Wardrobe, I think about a fabulous, sexy woman who also loves to be comfortable. She’s your everyday girl who loves to look amazing while doing her day-to-day tasks.\n\nShirin: She’s just a bad bitch. Simple.\n\nHow did Naked Wardrobe first land on the KarJenner sisters' radar?\n\nShideh: One of our models, who was a part of our team, was affiliated with the sisters because she used to work for Fashion Police on E!. One day we decided that we were going to send a package out to Khloe, not knowing whether or not she was going to wear it or whether she was going to like it, but we sent it anyways. It’s been love ever since then. Really the product speaks for itself, so when we send out these packages to the celebs, we just bite the bullet and hope they’ll wear at least one thing. Every time we introduce Naked Wardrobe to a new celebrity client, they keep wearing the pieces for like the next few weeks. We’re been fortunate to connect with so many celebrity stylists and they’ve been so gracious enough to respond to us and they have become fans of the brand very organically.\n\nJennifer Lopez and Lady Gaga are also fans of the brand.\n\nShideh: It’s surreal. Beyonce has Naked Wardrobe as well. Her stylist hit us up and told us she loves the brand so it’s just a matter of time before she wears us out in public. Our line is affordable and you wouldn’t think that these celebs, who have access to all the brands in the book, would choose to wear our this budget friendly brand. Why would they wear a $30 dress when they can wear a Saint Laurent gown for thousands of dollars? We say this a lot but I think that’s the most rewarding part about this.\n\n", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/unnamed-1537818560.jpg?crop=0.756xw:0.567xh;0.0609xw,0.0817xh&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/unnamed-1537818560.jpg?crop=0.756xw:0.567xh;0.0609xw,0.0817xh&resize=1200:*", "keywords": [], "authors": ["Nerisha Penrose", "Assistant Editor", "Nerisha Is The Assistant Editor At Elle.Com", "Covering All Things Beauty"], "canonical_link": "https://www.elle.com/fashion/shopping/a23413717/naked-wardrobe-affordable-kardashians-j-lo-lady-gaga/", "title": "Naked Wardrobe Is the Affordable Basics Brand the Kardashians and J. Lo Can't Stop Wearing", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "These Three Sisters Turned a Shopping Addiction Into a Multi-Million Dollar Empire", "description": "Yes, even Beyoncé owns Naked Wardrobe.", "url": "https://www.elle.com/fashion/shopping/a23413717/naked-wardrobe-affordable-kardashians-j-lo-lady-gaga/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/unnamed-1537818560.jpg?crop=0.756xw:0.567xh;0.0609xw,0.0817xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "modified_time": "2018-09-25 09:51:14", "published_time": "2018-09-25 09:34:00", "section": "Shopping", "opinion": "false"}, "twitter": {"site": "@ELLEmagazine", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/unnamed-1537818560.jpg?crop=0.756xw:0.567xh;0.0609xw,0.0817xh&resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "Naked Wardrobe Is the Affordable Basics Brand the Kardashians and J. Lo Can't Stop Wearing", "description": "The Kaviani sisters turned their shopping addiction into a multi-million dollar company that celebrities from The Kardashians to Jennifer Lopez and Lady Gaga can't stop wearing.", "keywords": "Naked Wardrobe", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/unnamed-1537818560.jpg?crop=0.668xw:1.00xh;0.167xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Fashion,fashion,shopping,Instagram shopping,The Kardashian Sisters,Shirin Kaviani,Shida Kaviani,Shideh Kaviani,Naked Wardrob,Jennifer Lopez,Fast Fashion,lady gaga", "sailthru.date": "2018-09-25T21:34:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/unnamed-1537818560.jpg?crop=0.756xw:0.567xh;0.0609xw,0.0817xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/unnamed-1537818560.jpg?crop=0.668xw:1.00xh;0.167xw,0", "sailthru.socialtitle": "These Three Sisters Turned a Shopping Addiction Into a Multi-Million Dollar Empire", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1537839240.0, "source": "https://www.elle.com", "summary": ""}