{"url": "https://web.archive.org/web/20060225224223/http://www.foxnews.com/story/0,2933,183845,00.html", "text": "Monday, February 06, 2006\n\nPHOTOS VIDEO STORIES ARCHIVE SHOW INFO\n\nThe following is a partial transcript of the Feb. 5, 2006 edition of \"FOX News Sunday\":\n\nCHRIS WALLACE, HOST: There were political shock waves on Capitol Hill Thursday when House Republicans elected John Boehner as their new majority leader. So now what's his plan to clean up the GOP's image and keep control of the House this November? For answers, we turn to Congressman Boehner.\n\nAnd congratulations. Welcome back to \"FOX News Sunday\".\n\nHOUSE MAJORITY LEADER JOHN BOEHNER, R-OHIO: Chris, it's good to be here.\n\nWALLACE: Especially in this position, huh?\n\nBOEHNER: It's been a long way back, but I'm certainly glad the race went well. But we have a lot of work ahead of us.\n\nWALLACE: Well, let's talk about that. After you won this week, you said Republicans are looking at their own re-election and the environment right now is not real good.\n\nHow much trouble are Republicans in, in terms of maintaining their control of the House in November?\n\n(Story continues below)\n\nADVERTISEMENTS Advertise Here\n\nBOEHNER: I think that we've got challenges ahead of us. The president's numbers have been down. But the economy is good. And I think the effort in Iraq continues to go well.\n\nBut what we need to do is to address the anxieties that the American people are feeling about the economy, their own personal security, their jobs. And if we're able to address those anxieties that they're feeling, I think we'll do well in November.\n\nWALLACE: Did you win because House Republicans wanted to signal a clear break with the era of Tom DeLay ?\n\nBOEHNER: I think I won because I was presenting to my colleagues that we needed to really work on a common vision of who are we, why are we here, and what is it that we hope to accomplish on behalf of the American people, and that out of that vision we can develop an agenda.\n\nSo I think it was more about management and leadership than it was about any other issue.\n\nWALLACE: Job one, clearly, at least in terms of the public perception, is lobbying reform. Speaker Hastert just came out with a package that would ban almost all gifts and privately funded travel, but you said on Friday there is no package. So is the Hastert plan inoperative?\n\nBOEHNER: There is a package. Speaker Hastert and the chairman of the Rules Committee, David Dreier , have been working on a package. Democrat leadership's been working on a package. And what's going on right now is that Mr. Dreier, who's been heading up this effort, is working on a bipartisan basis to try to bring this package together.\n\nI think it's important that the members be very involved in the development of this package, and so you're going to see conversations going on within our caucus, within the Democrat caucus, and efforts between the two to develop this bipartisan package over the coming weeks.\n\nWALLACE: But you have indicated — in fact, at one point, you used and then took back the word \"childish\" to describe this idea of all these bans on gifts and travel. Do you feel, in fact, that bans make less sense than just more disclosure of what happens?\n\nBOEHNER: I think that some of the proposals that were out there — and there have been a lot of proposals offered by members, by outside groups. And I thought some of the proposals were outright childish, treating members like kids.\n\nI think that what we need to do is we need to deal with the underlying problems that we have today. And I believe that disclosure of the relationship between those who lobby us, whether they be paid lobbyists here in Washington, those from agencies, or others — disclosure of those relationships — and let the American people take a look at how this relationship works.\n\nSunlight's the best disinfectant. I think it will help.\n\nWALLACE: So you're OK with some of these privately funded trips?\n\nBOEHNER: I think on the privately funded trips, if there is approval by the Ethics Committee that it's an appropriate trip, that it meets the rules of the House, then we ought to allow members to do it.\n\nWe can't lock members up in a cubbyhole here in Washington and never let them see what's going on around the country and around the world. Members need to be educated. They need to be kept up to speed on what's happening. And these trips to a large extent help educate members.\n\nWALLACE: But let me ask you about that, Congressman. You are known, fairly or not, as a frequent flyer on a lot of these privately funded trips. If lobbyists want to make their case, why do they have to take you, as they have, to Europe or to Pebble Beach Golf Course?\n\nI mean, aren't they, in effect, buying a kind of access to you or other legislators that the average citizen back home can't hope to get?\n\nBOEHNER: It's not about lobbyists on many of these trips in terms of making their case. It's about going to an industry meeting. It's going to look at a nuclear energy system in Spain, as an example, to gain an appreciation of what's happening in that industry, or — the Aspen Institute , going to an education seminar.\n\nThese are worthy activities that help educate members, but they ought to be approved before members go.\n\nWALLACE: During your campaign for leader, you proposed a ban on earmarks , these provisions, pork provisions, that are snuck into bills by legislators. But I want to show you something that Speaker Hastert said recently about bans — about earmarks, rather. Take a look. \"Who knows best where to put a bridge or a highway or a red light in their district?\"\n\nQuestion, who speaks for Republicans, you or Speaker Hastert?\n\nBOEHNER: Denny Hastert and I have been friends for 15 years. We've worked together. We're good friends. And we are working together. He's the boss. He is the speaker of the House.\n\nI've never called for an outright ban on earmarks. I've never asked for one in the 15 years that I've been in Congress. I told my constituents in 1990 that if they thought my job was to go to Washington and rob the federal treasury on their behalf, they're voting for the wrong guy. And so I've never asked for one.\n\nBut I don't think I want to hold all my colleagues to that same standard. There's an appropriate place for some of these earmarks, but we need less numbers of earmarks and more transparency and more accountability. Members' names ought to be associated with them. They ought to be visible. And members ought to have a chance to see these before they become law.\n\nWALLACE: If I were a Democrat listening to what you've been saying today — you're talking about well, we're not going to ban earmarks, we're not going to ban private travel — I think I could probably make a campaign ad saying business as usual.\n\nBOEHNER: Well, listen, in the past, when these scandals have erupted, what's happened is Congress has overreacted, and two days later nobody knew what happened. And what I want to do is to work with the members to address where the problems are.\n\nUnderstand that all the activities associated with Jack Abramoff , Duke Cunningham , former member who resigned in disgrace, and other members who have problems — they've already violated the law and/or they violated the rules of the House.\n\nBringing more transparency to this relationship I think is the best way to control it. But taking...\n\nWALLACE: Not bans.\n\nBOEHNER: ... taking actions to ban this and ban that, when there's no appearance of a problem, there's no foundation of a problem, I think, in fact, does not serve the institution well.\n\nWALLACE: You are known as a Republican who can work with Democrats. Do you want to see an end to the hyper-partisanship of the DeLay era, when Democrats were often just shut out of legislating?\n\nBOEHNER: I've worked with Democrats on many occasions. I've stood up to them and gone toe to toe with them. But there are a lot of issues in the national interest that Democrats and Republicans can work together on. And I believe that — look at George Miller , my colleague from California. He's as liberal as I am conservative.\n\nWALLACE: He's the ranking Democrat on your committee, the Education Committee.\n\nBOEHNER: On my committee. And we've had our disagreements. We've had our fights, if you will. But there are a lot of other issues where we've worked closely together, and trying to improve education in America is a good example.\n\nNow, I do believe that we ought to have a more open process. The Democrats ought to be able to play. This is the United States of America. This is democracy. And all members should be allowed to have their say. And they can't win. You know, I'm not saying they're going to win everything, but they ought to be able to have their say.\n\nWALLACE: Let me ask you about an issue, Medicare prescription drug benefit. How do you think it's working? Does Congress need to fix it?\n\nBOEHNER: The implementation of the Medicare plan has been horrendous. We've made it far more complicated than it should be.\n\nThe good news is that the competition that's being created has lowered premiums significantly below where Congress thought they'd be when we put the bill together, so the competition side is good. I think the implementation side continues to need to be improved.\n\nWALLACE: You've been called more of a chamber of commerce Republican than a social conservative. Are you going to emphasize — in your job as leader, are you going to emphasize meat and potato issues?\n\nBOEHNER: Chris, I've got 11 brothers and sisters, and my dad owned a bar. I worked my way through school. I started my own business. And if it weren't for the free enterprise system in America, I wouldn't be here.\n\nI came here because I thought government was too big, that it spent too much and was too intrusive into our lives. And I do believe that we've got to gain control of this government. And so there's not an issue here between the fiscal side and the social side.\n\nYou grow up with 11 brothers and sisters, you learn an awful lot about social issues and being a family, and all of these issues are important. So I don't think we need to pick sides one way or the other.\n\nWALLACE: Finally, let's talk a little bit about John Boehner. I want to show you something that The New York Times wrote about you this week. Here, take a look. \"Easy-going and well-liked, with a perpetual tan, a low golf handicap and an ever-present Barclay cigarette between his fingers, Mr. Boehner looks like a throwback to the '50s — Dean Martin comes to Washington.\" Any problems with that?\n\nBOEHNER: Chris, I'm an ordinary guy with a big job. And while I take my work very serious, I don't take myself very serious. And I don't allow my staff to call me Congressman or Mr. Leader. They call me John, or most of them just refer to me as hey, Boehner.\n\nI'm just open. You know, what you see is what you get. I've got a very good relationship with the media, with my colleagues, frankly, the people downtown, and my constituents, because this is the way I am.\n\nWALLACE: I do have to ask you the one question that a lot of people asked me this week. How do you keep that tan?\n\nBOEHNER: I was born dark, but I do like to play a little golf, and it's my escape from all of the pressures of my job.\n\nWALLACE: Six handicap?\n\nBOEHNER: I do have a six handicap.\n\nWALLACE: Well, that's going to go up now with this new job.\n\nBOEHNER: I'm sure my colleagues are hoping so.\n\nWALLACE: Congressman Boehner, we want to thank you, especially for joining us on your very first weekend as leader. Please come back.", "images": ["https://web.archive.org/web/20060225224223im_/http://pix01.revsci.net/E05510/a3/0/0/0/0/0/0/0/0/0/noscript.gif", "https://web.archive.org/web/20060225224223im_/http://www.foxnews.com/images/foxnews_story.gif", "https://web.archive.org/web/20060225224223im_/http://www.foxnews.com/images/clear_dot.gif", "https://web.archive.org/web/20060225224223im_/http://www.foxnews.com/images/headers/fnc_logo05.gif", "https://web.archive.org/web/20060225224223im_/http://www.foxnews.com/images/btn_home.gif", "https://web.archive.org/web/20060225224223im_/http://www.foxnews.com/images/btn_top.gif", "https://web.archive.org/web/20060225224223im_/http://www.foxnews.com/images/right_nav/300x50_wallace_character.jpg"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "", "title": "Transcript: House Majority Leader Boehner on 'FNS'", "meta_data": {"description": "FOXNews.com - FNS w/ Chris Wallace - 'FNS' Interview - Transcript: House Majority Leader Boehner on 'FNS'. Rep. John Boehner discusses what reforms he'd like to offer to strengthen line between lobbyists gift-giving and favorable action for their clients..", "keywords": "Fox News Channel, Foxnews, FOX News Channel, fox news, fox news cable, fnc, fnc tv, fn, foxnews.com, FNS w/ Chris Wallace, 'FNS' Interview, house majority leader, boehner, ethics, republicans, lobbying reform, dreier, hastert"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}