{"url": "https://www.today.com/news/prince-harry-engaged-meghan-markle-here-are-details-t109215", "text": "One of the world's most eligible bachelors just took himself off the market.\n\nPrince Harry is engaged to American actress Meghan Markle, Kensington Palace announced in a statement Monday.\n\n“His Royal Highness The Prince of Wales is delighted to announce the engagement of Prince Harry to Ms. Meghan Markle,” according to the palace statement. The couple got engaged earlier this month in London. Prince Harry also \"sought and received the blessing of Ms. Markle's parents,\" the palace said.\n\nSeveral hours later, the couple appeared hand-in-hand for a brief photo opportunity in the gardens of Kensington Palace, where a beaming prince said he realized Markle was the one for him \"the first time we met.\"\n\nThe Prince of Wales is delighted to announce the engagement of Prince Harry to Ms. Meghan Markle. pic.twitter.com/zdaHR4mcY6 — Clarence House (@ClarenceHouse) November 27, 2017\n\nThe couple plan to get married next May at St. George’s Chapel inside Windsor Castle. They will live in Nottingham Cottage, Harry's apartment at Kensington Palace.\n\nMarkle is a 36-year-old California native emerged from relative obscurity after news began to leak in the fall of 2016 that she was dating Prince Harry, 33.\n\nThe couple dated for more than a year before making their first official appearance together this past September at the Invictus Games in Toronto.\n\nTrending stories,celebrity news and all the best of TODAY. This site is protected by recaptcha\n\nThe newly betrothed couple, during their first public appearance together on Sept. 25, 2017, at the Invictus Games in Toronto, Canada. Chris Jackson / Getty Images\n\nThe pair met in early July 2016 after being set up on a blind date set up by a mutual friend, the couple told the BBC in a joint interview. The prince had never heard of the actress, who in turn knew only superficially about the royal.\n\nThe happy couple, at a photo call with reporters Monday after news broke about their engagement. Chris Jackson / Getty Images\n\nThe couple kept quiet about their relationship until Prince Harry issued a rare statement last November scolding paparazzi for endangering the safety of his girlfriend and blasting coverage he found racist and sexist.\n\nBut even after that announcement, the couple did not make any public appearances together until this past May when the two appeared at a polo match benefiting two of Prince Harry’s charities. Markle cheered on Harry as he played, but the two did not arrive or leave the event together.\n\nShutterstock / MEGA\n\nFor the September opening ceremony for this year's Invictus Games, the two originally sat several rows apart, but the couple stepped out publicly for the first time just days later, when they arrived, holding hands, for a wheelchair tennis match. They were seen laughing and being affectionate with each other throughout the event.\n\nPrince Harry proposed to Markle in early November, while the couple enjoyed a “cozy” night in at his Kensington Palace apartment, where the two were roasting a chicken.\n\n“It was just an amazing surprise. It was so sweet and natural and very romantic. He got on one knee,” Markle said in a BBC interview following the announcement of their engagement.\n\nThe impending nuptials will be the biggest royal wedding since Harry's older brother, Prince William, married the former Kate Middleton on April 29, 2011.\n\nThe Duke and Duchess of Cambridge said in a statement they were “very excited for Harry and Meghan.”\n\nThe Duke and Duchess of Cambridge said of the engagement:\n\n'We are very excited for Harry and Meghan. It has been wonderful getting to\n\nknow Meghan and to see how happy she and Harry are together.' — Kensington Palace (@KensingtonRoyal) November 27, 2017\n\n“It has been wonderful getting to know Meghan and see how happy she and Harry are together,” they said.\n\nPrince Harry's grandmother, Queen Elizabeth, also issued congratulations through Twitter.\n\n\"The Queen and The Duke of Edinburgh are delighted for the couple and wish them every happiness,\" Buckingham Palace said in a statement.\n\nThe Queen and The Duke of Edinburgh are delighted for the couple and wish them every happiness. https://t.co/aAJ23uSbao — The Royal Family (@RoyalFamily) November 27, 2017\n\nPrince Harry proposed to Markle with an engagement ring he designed with a center diamond from Botswana, where the two visited on vacation shortly after they met, and two outside diamonds from the personal collection of the Harry’s mother, the late Princess Diana.\n\nIt also will be the first time an American has married a British royal since King Edward VIII abdicated the throne in December 1936 to marry Wallis Simpson, a twice-divorced socialite. Like Simpson, Markle also is a divorcee. She was previously married to American film producer Trevor Engelson for nearly two years, divorcing in 2013.\n\nIn May, Prince Harry brought Markle as his date to the wedding reception of Kate's younger sister, Pippa Middleton. Royal watchers believe their attendance signaled how serious the relationship had become since it marked the first time Markle had mingled at a large gathering of royal family members.\n\nPrince Harry is the fifth in line to the throne, behind the two children of his brother, Prince William, who is second in the line of succession behind their father. He will be bumped to sixth in line following the birth of William's third child next year.\n\nBefore he began dating Markle, the prince's romantic life had been calm and quiet for the past several years after a string of high-profile relationships. His most recent serious relationship, with model Cressida Bonas, ended in 2014 after two years together.\n\nFollow Eun Kyung Kim on Twitter or Facebook.", "images": ["https://media3.s-nbcnews.com/j/newscms/2019_18/1432044/today-3rd-hour_9370906f7c40d78db8842bc0c3e628a7.10000;74;7;80;3.png", "https://media4.s-nbcnews.com/j/newscms/2020_03/1529838/weekend-today-menu_94be02e0ac821819fdb22a090c28163f.10000;74;7;80;3.png", "https://media4.s-nbcnews.com/j/newscms/2018_52/2696426/food_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2019_18/1432043/hodaandjenna_00d9547321553d5a5f55c2b3973c514b.10000;74;7;80;3.png", "https://media1.s-nbcnews.com/j/MSNBC/Components/Video/201711/tdy_news_kelly_harry_engagement_171127_1920x1080.focal-760x428.jpg", "https://media4.s-nbcnews.com/j/newscms/2018_52/2696446/shop_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696466/wellness_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media4.s-nbcnews.com/j/newscms/2018_52/2696481/today_4bc7d2146c228dd9a02a3c15b38527d0.10000;74;7;80;3.png", "https://media2.s-nbcnews.com/j/newscms/2018_52/2696456/style_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696461/videos_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media2.s-nbcnews.com/j/newscms/2018_52/2696491/williegeist_4bc7d2146c228dd9a02a3c15b38527d0.10000;74;7;80;3.png", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696431/home_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/MSNBC/Components/Video/201709/1920markleharryScreen_Shot_2017-09-25_at_3-02-19_PM__212750.focal-760x428.jpg", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696436/parenting_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media2.s-nbcnews.com/j/newscms/2017_39/1284633/meghan-markle-prince-harry-today-170925-tease-03_3c3ac88f93d8cf220f145c3f894d9cab.social_share_1200x630_center.jpg", "https://media2.s-nbcnews.com/j/newscms/2018_52/2696441/popculture_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg"], "top_img": "https://media2.s-nbcnews.com/j/newscms/2017_39/1284633/meghan-markle-prince-harry-today-170925-tease-03_3c3ac88f93d8cf220f145c3f894d9cab.social_share_1200x630_center.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.today.com/news/prince-harry-engaged-meghan-markle-here-are-details-t109215", "title": "Prince Harry is engaged to Meghan Markle: Here are the details", "meta_data": {"msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/today/all-other-sizes-PNG.ico/ms-icon-144x144.png", "msapplication-config": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/today/all-other-sizes-PNG.ico/browserconfig.xml", "fb": {"app_id": 122384521533, "admins": 100001657893615, "pages": 157687092983}, "og": {"site_name": "TODAY.com", "locale": "en_US", "url": "https://www.today.com/news/prince-harry-engaged-meghan-markle-here-are-details-t109215", "title": "Prince Harry is engaged to Meghan Markle! Here are the details", "description": "Prince Harry is engaged to American actress Meghan Markle, Kensington Palace announced in a statement.", "image": {"identifier": "https://media2.s-nbcnews.com/j/newscms/2017_39/1284633/meghan-markle-prince-harry-today-170925-tease-03_3c3ac88f93d8cf220f145c3f894d9cab.social_share_1200x630_center.jpg", "secure_url": "https://media2.s-nbcnews.com/j/newscms/2017_39/1284633/meghan-markle-prince-harry-today-170925-tease-03_3c3ac88f93d8cf220f145c3f894d9cab.social_share_1200x630_center.jpg", "type": "image/jpeg", "width": 1200, "height": 630}, "type": "article"}, "twitter": {"site": "@TodayShow", "creator": "TodayShow", "image": "https://media2.s-nbcnews.com/j/newscms/2017_39/1284633/meghan-markle-prince-harry-today-170925-tease-03_3c3ac88f93d8cf220f145c3f894d9cab.social_share_1024x512_center.jpg", "title": "Prince Harry is engaged to Meghan Markle! Here are the details", "description": "Prince Harry is engaged to American actress Meghan Markle, Kensington Palace announced in a statement.", "card": "summary_large_image"}, "viewport": "width=device-width, initial-scale=1", "description": "Prince Harry is engaged to American actress Meghan Markle, Kensington Palace announced in a statement.", "article": {"opinion": "false", "content_tier": "free"}, "thumbnail": "https://media2.s-nbcnews.com/j/newscms/2017_39/1284633/meghan-markle-prince-harry-today-170925-tease-03_3c3ac88f93d8cf220f145c3f894d9cab.social_share_1024x768_scale.jpg", "apple-itunes-app": "app-id=416357699"}, "movies": [], "publish_date": 1511781300.0, "source": "https://www.today.com", "summary": ""}