{"url": "https://yournewswire.com/broward-county-sheriff-fired/", "text": "Broward County Sheriff Scott Israel has been fired for covering-up the truth about what happened during the Parkland shooting.\n\nAccording to reports, following a criminal investigation by Florida Governor Rick Scott, Sheriff Israel will be replaced as early as next week.\n\nFrom Big League Politics: Sheriff Israel is being removed from office for criminal issues, not malfeasance, following an investigation conducted by the office of Florida Governor Rick Scott. The source exclusively revealed to Big League Politics that Sheriff Israel is also allegedly being investigated by the IRS.\n\nThe high-level police source within the Sheriff’s Office disclosed that over the last several months, four candidates have been interviewed to refill the position of Broward County Sheriff. One of the candidates who were interviewed is Emery Giany, a Republican Florida law enforcement official who is closely associated with Florida Attorney General Pam Bondi.\n\nDuring the IG’s testimony last week, FBI director Christopher Wray was asked about the Parkland school shooting. When asked, Wray declined to answer any questions about the shooting and Sheriff Israel, citing that it was an active FBI investigation. Following the Parkland shooting, Governor Scott called for Director Wray to resign over the FBI’s failure to properly investigate Nikolas Cruz, 19, the school shooter whose plans to carry out a school shooting were reported to the FBI twice prior to the shooting on Valentine’s Day.\n\n“We constantly promote ‘see something, say something,’ and a courageous person did just that to the FBI. And the FBI failed to act. ‘See something, say something’ is an incredibly important tool and people must have confidence in the follow through from law enforcement. The FBI Director needs to resign,” Governor Scott said.\n\nAccording to the source in the Broward Sheriffs office, Sheriff Israel’s removal revolves around a criminal matter that the FBI is aware of. Although his failures surrounding the Parkland shooting initially sparked the investigation, it isn’t the sole reason why he is being removed.\n\nThe high-level source who wished to remain anonymous told Big League Politics that Sheriff Israel is already aware of the fact that he is being removed from office next week.\n\nSheriff Israel has been under heavy criticism for his handling of the of the Parkland school shooting, which left 17 people dead. Following the Valentine’s Day school massacre at Marjory Stoneman Douglas High School, it was revealed that police officers under Sheriff Israel’s order were called to the home of the Parkland shooter 45 times prior to the school shooting.\n\nIt is unclear why law enforcement officials law enforcement at the Broward County Sheriff’s office and FBI failed to properly investigate Cruz, but their massive failure has been directly attributed to the loss of 17 lives in Parkland, FL.\n\nSince the Parkland shooting, a lot of unflattering information has come out regarding Sheriff Israel. Along with being a mouthpiece for Democratic politicians and gun control advocates, like Hillary Clinton and Debbie Wasserman Schultz who he has been photographed with, Sheriff Israel and his department have recently made headlines for more controversy.\n\nIn May, it was revealed that Marjory Stoneman Douglas high school and the Broward County Sheriff’s office were keeping quiet the fact that Sheriff Israel’s son, Brett, had allegedly assaulted a 14 year old student on campus in an act of bullying.\n\nShortly after the Parkland shooting, cell phone video filmed by Cruz himself revealed that he himself felt bullied, which lead him to carry out a massacre on February 14, 2018 in a targeted attack against his former classmates.\n\nMost recently, Sheriff Israel received a massive amount of backlash after the Broward County Sheriff’s office tweeted a picture of a new custom made Broward sheriff’s car that read, “Our new #dodge #charger. Do you like the paint job?”\n\nThe tweet sparked outrage online from Republicans and Democrats alike who quipped that the Broward Sheriff’s office should use the funds to pay for better officer training, not new cars. Leaders on both sides of the aisle have called for Sheriff Israel to resign or be removed by the Governor for his extreme dereliction of duty and failure to prevent one of the worst schools shootings in US history.\n\nDuring the Florida GOP Primary debate in Florida last week, Florida Agriculture Commissioner Adam Putnam and Rep. Ron DeSantis were asked about the Parkland school shooting. Both Putnam and DeSantis called for the removal of Scott Israel while asserting their support of the Second Amendment.\n\n“I would have removed that sheriff from Broward County. He failed his citizens and he should have been removed,” DeSantis said.\n\n“Sheriff Israel is under investigation and he needs to go,” Putnam said.\n\nGovernor Scott is expected to release a statement in the coming week when Sheriff Israel is removed from office. Scott is currently running for US Senate in Florida, and news of Sheriff Israel’s removal is sure to boost his approval rating in what is gearing up to be one of the most important Senate races in the country.\n\nIn the days following the Parkland shooting, Sheriff Scott Israel was confronted and asked about his support of and affiliation with the Democratic Party and why he chose to blame guns instead of holding his department and the FBI accountable. Unable to withstand tough questioning, Sheriff Israel became flustered and ended the interview after saying, “the only person accountable for this killing is the detestable, cowardly, murderer. He is solely responsible for this horrific act.” However, as the investigation into Parkland has shown, both Sheriff Israel and the FBI dropped the ball and are to blame for their failure to prevent the shooting despite receiving multiple warning signs.", "images": ["https://cdn.newspunch.com/wp-content/uploads/2018/10/MAGA-florida-80x60.jpg.optimal.jpg", "https://cdn.newspunch.com/wp-content/uploads/2018/07/snopes-mikkelson-censoring-conservatives-80x60.jpg.optimal.jpg", "https://cdn.newspunch.com/wp-content/uploads/2016/05/2016-05-09_142344-80x60.jpg.optimal.jpg", "https://cdn.newspunch.com/wp-content/uploads/2019/09/Trump-arrest-schiff-for-treason-80x60.jpg.optimal.jpg", "https://cdn.newspunch.com/wp-content/uploads/gravatar/1511651_10152594103870715_1942518842_o.jpg.optimal.jpg", "https://cdn.newspunch.com/wp-content/uploads/2018/07/mueller-nra-80x60.png", "https://cdn.newspunch.com/wp-content/uploads/2020/02/Boris-Johnson-80x60.jpeg.optimal.jpeg", "https://cdn.newspunch.com/wp-content/uploads/2018/07/fbi-leak-buzzfeed-80x60.jpg.optimal.jpg", "https://cdn.newspunch.com/wp-content/uploads/2016/09/czechs-implant-bitcoin-80x60.jpg.optimal.jpg", "https://cdn.newspunch.com/wp-content/uploads/2018/11/news_punch_logo.png", "https://cdn.newspunch.com/wp-content/uploads/2018/07/broward-sheriff-fired-678x381.jpg.optimal.jpg", "https://cdn.newspunch.com/wp-content/uploads/2015/05/advanced-civilisation-comet-80x60.jpg.optimal.jpg", "https://cdn.newspunch.com/wp-content/uploads/2018/07/peter-strzok-cia-1-80x60.jpg.optimal.jpg", "https://cdn.newspunch.com/wp-content/uploads/2019/05/immigrant-arrested-80x60.jpg.optimal.jpg", "https://cdn.newspunch.com/wp-content/uploads/2016/09/Hillary-nuclear-war-with-Putin-80x60.jpg.optimal.jpg", "https://cdn.newspunch.com/wp-content/uploads/2018/07/broward-sheriff-fired-800x450.jpg.optimal.jpg", "https://cdn.newspunch.com/wp-content/uploads/2019/09/robert-de-niro-80x60.jpg.optimal.jpg", "https://cdn.newspunch.com/wp-content/uploads/2016/07/Shadow-NSA-80x60.jpg.optimal.jpg", "https://cdn.newspunch.com/wp-content/uploads/2016/04/P2230002b-80x60.jpg.optimal.jpg", "https://cdn.newspunch.com/wp-content/uploads/2020/04/Coronavirus-80x60.jpg.optimal.jpg", "https://cdn.newspunch.com/wp-content/uploads/2016/02/obama-murdered-scalia-80x60.jpg.optimal.jpg", "https://cdn.newspunch.com/wp-content/uploads/2019/05/adam-schiff-80x60.jpg.optimal.jpg", "https://cdn.newspunch.com/wp-content/uploads/2018/07/broward-sheriff-fired-1200x630-cropped.jpg.optimal.jpg", "https://cdn.newspunch.com/wp-content/uploads/2014/10/screenings-80x60.jpg.optimal.jpg", "https://cdn.newspunch.com/wp-content/uploads/2015/04/bobbi-kristina-80x60.jpg.optimal.jpg", "https://cdn.newspunch.com/wp-content/uploads/2016/02/McCain-Putin-80x60.jpg.optimal.jpg", "https://cdn.newspunch.com/wp-content/uploads/2018/07/rand-paul-hillary-collusion-russia-80x60.jpg.optimal.jpg"], "top_img": "https://cdn.newspunch.com/wp-content/uploads/2018/07/broward-sheriff-fired-1200x630-cropped.jpg.optimal.jpg", "keywords": [], "authors": ["Sean Adl-Tabatabai"], "canonical_link": "https://newspunch.com/broward-county-sheriff-fired/", "title": "Broward County Sheriff Fired For Lying About Parkland", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Broward County Sheriff Scott Israel has been fired for covering-up the truth about what happened during the Parkland shooting.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "generator": "WPSSO UM 2.8.0/S", "article": {"author": "https://www.facebook.com/SeanAdlTabatabai/", "publisher": "https://www.facebook.com/thepeoplesvoicetv", "published_time": "2018-07-03T18:23:41+00:00", "modified_time": "2018-07-04T15:22:54+00:00", "section": "News"}, "onesignal": "wordpress-plugin", "fb": {"admins": "seantut", "app_id": 187101705057657}, "og": {"type": "article", "url": "https://newspunch.com/broward-county-sheriff-fired/", "locale": "en_US", "site_name": "News Punch", "title": "Broward County Sheriff Fired For Lying About Parkland", "description": "Broward County Sheriff Scott Israel has been fired for covering-up the truth about what happened during the Parkland shooting.", "updated_time": "2018-07-04T15:22:54+00:00", "image": {"identifier": "https://cdn.newspunch.com/wp-content/uploads/2018/07/broward-sheriff-fired-1200x630-cropped.jpg.optimal.jpg", "width": 1200, "height": 630, "alt": "Broward County Sheriff Scott Israel fired for covering-up truth about Vegas shooting"}}, "twitter": {"domain": "newspunch.com", "site": "@yournewswire", "title": "Broward County Sheriff Fired For Lying About Parkland", "description": "Broward County Sheriff Scott Israel has been fired for covering-up the truth about what happened during the Parkland shooting.", "creator": "@seanshhh", "card": "summary_large_image", "image": {"identifier": "https://cdn.newspunch.com/wp-content/uploads/2018/07/broward-sheriff-fired-600x338.jpg.optimal.jpg?p=173615", "alt": "Broward County Sheriff Scott Israel fired for covering-up truth about Vegas shooting"}}, "author": "Sean Adl-Tabatabai", "thumbnail": "https://cdn.newspunch.com/wp-content/uploads/2018/07/broward-sheriff-fired-600x315-cropped.jpg.optimal.jpg"}, "movies": [], "publish_date": 1530642221.0, "source": "https://yournewswire.com", "summary": ""}