{"url": "www.thesun.co.uk/tvandshowbiz/1917422/kanye-west-net-worth-kim-kardashian-songs/", "text": "KANYE West is a larger than life rapper and the husband of reality TV star Kim Kardashian.\n\nThe star rose to fame with his hit albums but has found himself remaining in the headlines thanks to his controversial opinions and he's caused further fury for his support of Donald Trump. Here's everything you need to know about his life and career so far...\n\n5 Kanye West is one of the most influential musicians in the business Credit: Getty Images - FilmMagic\n\nWho is Kanye West and how much is he worth?\n\nKanye Omari West, 41, was born June 8, 1977, and is an American rapper, singer, songwriter, record producer, entrepreneur and fashion designer.\n\nBorn in Atlanta and raised in Chicago, Kanye first became known as a producer for Roc-A-Fella Records in the early 2000s before becoming an international superstar.\n\nThe name Kanye means \"Let's give\" or to \"give honour\".\n\nKanye West’s net worth is $160 million (£120 million).\n\nKanye married American reality TV star Kim in 2014.\n\n5 Kimye purchased this lush £8.6 million property in Los Angeles Credit: Splash News\n\nHowever, Kanye shocked fans in 2016 by making the announcement that he was in a whole load of debt.\n\nHe confessed: “I write this to you my brothers while still 53 million dollars in personal debt… Please pray we overcome… This is my true heart…\n\n“My dreams brought me into debt and I’m close to seeing the light of day.”\n\nHowever, declaring bankruptcy in the US doesn't necessarily mean you are completely broke.\n\nSometimes, it is simply used to manage debt or as an accounting procedure and shouldn't be interpreted as meaning the debtor has no money.\n\nMany people, including the new US President Donald Trump, have filed for bankruptcy multiple times.\n\nWhy did Kanye change his name to Ye?\n\nThe rapper stunned fans on September 29, 2018, when he made a dramatic announcement on Twitter.\n\nHe said he would be shortening his name – a bit like how wife Kimberly Kardashian calls herself Kim.\n\n“The being formally known as Kanye West,” the Jesus Walks star began.\n\nHe then dramatically announced: “I am YE.”\n\nHe added: \"I believe 'ye' is the most commonly used word in the Bible, and in the Bible it means 'You'.\n\n\"So I'm you, I'm us, it's us. It went from Kanye, which means the only one, to just Ye - just being a reflection of our good, our bad, our confused, everything.\n\n\"The album is more of a reflection of who we are.\"\n\nWhen did Kanye West meet Kim Kardashian?\n\nKanye first started dating Kim in April 2012, six months after she split from NBA player Kris Humphries.\n\nAt the time, Kim was still married to Humphries – her second husband, the first being Damon Thomas – because her divorce wasn’t finalised until June 2013.\n\nThis divorce came less than a fortnight before the birth of North West, her and Kanye’s first child.\n\nWhen North was eleven months old, parents Kim and Kanye got married in a lavish ceremony on May 24, 2014.\n\nThe couple have two other children - Saint, 2, and one-year-old Chicago.\n\n5 Kim Kardashian, Kanye West and their kids pose for a family photo Credit: Instagram\n\nWhat are Kanye's biggest hits?\n\nGold Digger\n\nAll Mine\n\nFade\n\nHeartless\n\nStronger\n\nFourFiveSeconds\n\nLift Yourself\n\nFamous\n\nYikes\n\nAll of the Lights\n\n5 Kanye regularly splurges on gifts for Kim Kardashian and his family Credit: GC Images\n\nHow much property does Kanye West own?\n\nIn 2013, Kim and Kanye both moved into a £7million mansion, spending over £1.5million on renovations alone.\n\nIt was also reported that they purchased a £15.6million pad in Hidden Hills, California, which is still in the re-vamping process.\n\nThe couple also own homes in Paris and New York City.\n\n5 Kanye West met Donald Trump at the White House in October 2018 Credit: Reuters\n\nDoes Kanye West support Donald trump and is he running for US president?\n\nIn April 2018 Kanye suggested that he could be running for US president in 2024 by posting a tweet which showed him mocked-up campaign posters with the hashtag 2024.\n\nHe has also come under fire after publicly expressing his love for Donald Trump.\n\nThe US president signed Kanye's Make America Great Again hat and called him \"very cool.\"\n\nKim Kardashian has defended her husband after some suggested he could be mentally ill.\n\nShe said on Twitter: \"He’s a free thinker, is that not allowed in America?\n\n\"Because some of his ideas differ from yours you have to throw in the mental health card? That’s just not fair.\"\n\nIn October 2018 Yeezy visited The Donald at the White House resplendent in his MAGA hat.\n\nDonald Trump stunned into silence as Kanye West rants in the White House\n\nThe rapper and the President chatted in front of reports on a wide range of topics including trade policy and air travel.\n\nAccording to ABC News, he told reporters witnessing the meeting at the White House: “You are tasting a fine wine” as he knelt in front of Trump’s desk, adding, “it has complex notes to it”.\n\nThe topic of West’s potential future presidential career was also raised – with the star suggesting that could happen “only after 2024”.\n\n“Let’s stop worrying about the future, all we have is today. Trump is on his hero’s journey right now. He might not have thought he’d have a crazy motherf***** like [me],” the musician added.\n\nThe president – who remained silent for several minutes during West’s rant – remarked: “I tell you what, that was pretty impressive folks… that was quite something.”\n\nWest replied: “It was from the soul, I just channelled it.”\n\nMORE ON KANYE WEST KIM'S HELL Kanye admits he was an 'alcoholic' who drank in the morning but no longer drinks KID-DASHIANS Who are the Kardashian and Jenner grandkids? From North West to Stormi Webster KARN'T KEEP UP? Kardashian and Jenner baby names - what are the meanings behind the names? ‘GIVE ME 2 SECONDS!’ Kim Kardashian’s daughter North crashes social distancing PSA JESUS IS KING Kanye West and Mariah Carey will join Joel Osteen's virtual Easter service KIM'S ON THE KASE Kim Kardashian helps free convicted killer Momolu Stewart in documentary\n\nWhat is the feud between Jay Z and Kanye West about?\n\nAfter having his talent discovered by New York rap king Jay Z, eccentric Chicago-born Kanye was mentored by him for many years.\n\nMr West worked as a producer for Jay’s Rock-A-Fella Records before being signed as a rapper to the same label.\n\nJay and Kanye recorded numerous tracks together including Paris, Monster, Run This Town and Diamonds From Sierra Leone.\n\nBut tensions between the men began to rise after Kanye earned ridicule at the 2009 VMAs by upstaging both Taylor Swift and Jay’s wife Beyonce.\n\nSince then, Jay has failed to attend Kanye’s wedding or offer him support in his hour of need – and last year, Kanye made several rants about his former friend on stage, suggesting he’s keen to have him shot by one of his “killas”.\n\nThe feud intensified in the summer of 2017 when Jay Z dissed Kanye on his album and Kanye retaliated by removing all his music from Jay's streaming service Tidal.", "images": ["data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.5 1\"%3E%3C/svg%3E", "http://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 2.7 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.7 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.7 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.thesun.co.uk/wp-content/uploads/2016/10/nintchdbpict0002723664641.jpg?strip=all&quality=100&w=1200&h=800&crop=1"], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2016/10/nintchdbpict0002723664641.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "keywords": [], "authors": ["Joanne Kavanagh", "Sophie Roberts"], "canonical_link": "https://www.thesun.co.uk/tvandshowbiz/1917422/did-kanye-west-change-name-net-worth-kim-kardashian-songs/", "title": "What is Kanye West’s net worth, has he changed his name to Ye and when did he marry Kim Kardashian", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "What is Kanye West’s net worth, has he changed his name to Ye and when did he marry Kim Kardashian", "url": "https://www.thesun.co.uk/tvandshowbiz/1917422/did-kanye-west-change-name-net-worth-kim-kardashian-songs/", "description": "KANYE West is a larger than life rapper and the husband of reality TV star Kim Kardashian. The star rose to fame with his hit albums but has found himself remaining in the headlines thanks to his c…", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2016/10/nintchdbpict0002723664641.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "width": 1200, "height": 800, "alt": "Kanye West met Donald Trump at the White House in October 2018"}, "locale": "en_GB"}, "article": {"published_time": "2018-10-12T10:52:26+00:00", "modified_time": "2018-10-12T11:00:46+00:00", "publisher": 161385360554578, "tag": "Kanye West, Kim Kardashian, Explainers, Keeping Up with the Kardashians", "author": "https://www.facebook.com/thesunshowbiz/"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "description": "Kanye West is a US rapper and is married to reality TV star Kim Kardashian. He has been at the centre of several controversies including upstaging Taylor Swift at the 2009 VMAs.", "keywords": "kanye west, rapper, kim kardashian, kim kardashian robbery, US president, Donald Trump, MAGA, make america great again", "news_keywords": "kanye west, rapper, kim kardashian, kim kardashian robbery, US president, Donald Trump, MAGA, make america great again", "twitter": {"text": {"title": "What is Kanye West’s net worth, has he changed his name to Ye and when did he marry Kim Kardashian"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "Kanye believe it?", "headline": "All you need to know about Kanye West – here's how much he's REALLY worth", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2016/10/nintchdbpict0002723664641.jpg?strip=all&quality=100&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2016/10/nintchdbpict0002723664641.jpg?strip=all&quality=100&w=620&h=413&crop=1"}}, "parsely-post-id": 1917422, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1539341546.0, "source": "http://www.thesun.co.uk", "summary": ""}