{"url": "https://www.billboard.com/articles/columns/rock/8279737/jesus-christ-superstar-live-behind-the-scenes", "text": "Jesus Christ Superstar Live In Concert aired on NBC on Easter Sunday (April 1), resurrecting Andrew LLoyd Webber and Tim Rice’s Biblical rock opera for 2018. As Jesus Christ, John Legend was, fittingly, divine; Alice Cooper was hysterically villainous as King Herod; Sara Bareilles was flawless and captivating as Mary Magdalene; and Hamilton veteran Brandon Victor Dixon was jaw-droppingly electric as Judas Iscariot.\n\nBroadcast from the Williamsburg Armory in Brooklyn in front of an ecstatic audience, Billboard was lucky enough to attend the live concert event. From glittery garbage to dancers climbing the scaffolding with glee, here are seven things you didn’t see on the TV broadcast.\n\nCelebrities\n\nNaturally Legend’s wife Chrissy Teigen was in attendance, in addition to some NBC royalty: Jerry Seinfeld and Zach Braff. Seinfeld’s entrance in particular caused a minor stir, with one woman loudly exclaiming, “Oh MY GAWD Jerry Seinfeld, we love you Jerry!” Seinfeld politely waved and quickly moved on.\n\nPep Talk\n\nProducer Marc Platt came out before the broadcast began to hype the crowd and ensure the actors would be met with “generous applause” when they took the stage. He needn’t have worried. When the overture kicked in, the crowd exploded with excitement so much that you could feel the stadium style seating literally shaking.\n\nCommercial Breaks\n\nDuring the first commercial break, there were a lot of relieved shoulder squeezes between Legend and the dancers. While the main cast went backstage during the commercial breaks, much of the supporting cast stayed on stage, running through their choreography and stretching (there was some up dog, down dog yoga) as stage hands changed the set. About halfway through the show, as the cast became more comfortable and confident, the backup dancers walked up to the foot of the seated audience to scan for friends and family, waving and throwing kisses (one dancer cheekily flashed his skirt at a friend in the audience).\n\nGlitter Dump\n\nAfter the glitter-strewn temple sequence, 5-6 people had the damn near impossible task of cleaning up a mountain of glitter in just a few minutes. Brooms pushed the glitter into one massive pile, which was then shoveled into a trash can. But as anyone experienced with glitter knows, one cleanup never does the trick. They were still sweeping up a substantial amount of glitter the commercial break after that one.\n\nStanding Ovations\n\nThe first standing O of the night was Legend’s, after his stunning “Gethsemane (I Only Want to Say)” in the garden. The next belonged to Alice Cooper after his perfectly scene-chewing turn as a self-obsessed King Herod.\n\nSelfies With Alice\n\nWhen the audience in the “mosh pit” section was ushered out to join the cast at the finale, a few fans couldn’t let the opportunity pass without approaching Alice Cooper for a pic, who generously obliged.\n\nThe Aftermath\n\nAfter the broadcast wrapped, much of the supporting cast stuck around on stage, hugging each other and trading high fives with people in the front rows. One long-haired actor, clearly still buzzing from the high of the performance, climbed up the scaffolding and started swinging from it with a massive smile plastered across his face. Which, honestly, was pretty much how the entire crowd felt after that knockout finale.", "images": ["https://www.billboard.com/assets/1586539892/images/Billboard-white.svg?4863e69cb9d656c61185", "https://static.billboard.com/files/2020/04/Billie-Eilish-Where-Do-We-Go-World-Tour-Kick-Off-Miami-2020-billboard-1548-1587151378-compressed.jpg", "https://static.billboard.com/files/2020/03/radio-city-music-hall-covid19-2020-billboard-1500x845-1584562361-compressed.jpg", "https://static.billboard.com/files/media/05-Brandon-Victor-Dixon-and-john-legend-JESUS-CHRIST-SUPERSTAR-LIVE-IN-CONCERT-2018-billboard-1548-1024x677.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://static.billboard.com/files/2020/04/miley-cyrus-april-2019-uu-billboard-z-1548-1585925327-compressed.jpg", "https://static.billboard.com/files/2020/03/7cover_Coronavirus_Touring_WEB-1585231399-220x286.jpg", "https://static.billboard.com/files/2020/03/GettyImages-1144319419-1583448877-compressed.jpg"], "top_img": "https://static.billboard.com/files/media/05-Brandon-Victor-Dixon-and-john-legend-JESUS-CHRIST-SUPERSTAR-LIVE-IN-CONCERT-2018-billboard-1548-1024x677.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.billboard.com/articles/columns/rock/8279737/jesus-christ-superstar-live-behind-the-scenes", "title": "'Jesus Christ Superstar Live': 7 Things You Didn't See on the TV Broadcast", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2018-04-02T00:27:14-04:00", "published_time": "2018-04-02T00:27:14-04:00"}, "og": {"image": {"identifier": "https://static.billboard.com/files/media/05-Brandon-Victor-Dixon-and-john-legend-JESUS-CHRIST-SUPERSTAR-LIVE-IN-CONCERT-2018-billboard-1548-1024x677.jpg", "height": 677, "width": 1024}, "title": "'Jesus Christ Superstar Live': 7 Things You Didn't See on the TV Broadcast", "type": "article", "url": "http://www.billboard.com/articles/columns/rock/8279737/jesus-christ-superstar-live-behind-the-scenes", "site_name": "Billboard"}, "title": "'Jesus Christ Superstar Live': 7 Things You Didn't See on the TV Broadcast", "twitter": {"card": "summary_large_image", "image": "https://static.billboard.com/files/media/05-Brandon-Victor-Dixon-and-john-legend-JESUS-CHRIST-SUPERSTAR-LIVE-IN-CONCERT-2018-billboard-1548-1024x677.jpg", "title": "'Jesus Christ Superstar Live': 7 Things You Didn't See on the TV Broadcast", "site": "@billboard"}}, "movies": [], "publish_date": 1522643234.0, "source": "https://www.billboard.com", "summary": ""}