{"url": "https://www.thesun.co.uk/tvandshowbiz/3636769/ariana-grande-boyfriend-mac-miller-manchester-suicide-bombing/", "text": "SHATTERED Ariana Grande was “praying for ­Manchester” yesterday following the deadly suicide attack at the end of her concert.\n\nThe singer was consoled by her boyfriend Mac Miller as she returned to the US after the suicide bombing at her concert in Manchester on Monday night.\n\n16 Ariana Grande has been reunited with her boyfriend Mac Miller after the Manchester attack Credit: Splash News/Backgrid\n\nThe pop star was spotted for the first time since 22 gig-goers were killed at the Manchester Arena, prompting her to postpone the rest of her world tour.\n\nAfter the atrocity, Ariana, 23, quit Britain and flew back to the US with her mum Joan, who accompanied her on tour.\n\nShe was pictured getting off the private plane in Florida and walking down the steps into the arms of her rapper boyfriend Mac.\n\n16 The singer was seen stepping off a private plane in Florida Credit: Splash News/Backgrid\n\n16 Ariana looked tearful as she hugged a blanket in her arms Credit: Splash News/Backgrid\n\nSHOW YOUR SUPPORT FOR THE VICTIMS OF THE MANCHESTER ARENA ATTACK Today we launch a Together With Manchester appeal – to raise money for families of the victims of the Arena bomb. News UK, publisher of The Sun, has made a corporate donation of £100,000 to the appeal. Here's how you can show your support.... ONLINE: www.justgiving.com/TogetherWithManchester TEXT: Text TWMC50 and amount to 70070 – eg TWMC50 £5\n\n(you can donate £1, £2, £3, £4, £5 or £10)\n\nMost Read In TV &Showbiz GUESS THAT CELEB Celebrities post their #MeAt20 pics - but can you guess who is who? MAN'S BEST FRIEND Paul O'Grady reveals new puppy Nancy after announcing death of older dog cosy costars Sons of Anarchy star, 70, seen with new love, 47, after ditching wife of 38yrs HOT STUFF Too Hot To Handle stars had sex despite needing to go celibate for £80k prize TOON TOT Cheryl shares first video of son Bear, 3, talking - with adorable Geordie accent RULE BREAKERS Gogglebox fury as Ellie and Izzi break lockdown rules and reunite on the show\n\n16 The private plane touched down in Boca Raton in Florida Credit: Splash News/Backgrid\n\n16 The pop star walked down the steps of the jet and into the arms of Mac Credit: Splash News/Backgrid\n\n16 She was left heartbroken by the loss of life at her concert in Manchester Credit: Splash News/Backgrid\n\n16 The couple embraced for a long kiss on the steps of the plane Credit: Splash News/Backgrid\n\n16 In an emotional moment, she flung her arms around her boyfriend's neck and planted a kiss on his face Credit: Splash News/Backgrid\n\nHe was seen cuddling the tearful pop star and giving her a kiss as they reunited for the first time since the horror bombing.\n\nThey were they seen getting into a car together and heading off to the home of a family member.\n\nHer dad Edward Butera, 58, and mum Joan, 59, are supporting the singer.\n\nEdward said: “Our thoughts and prayers go out to the victims and their families of Manchester.”\n\nAriana called off a European tour, including gigs at London’s O2 tonight and tomorrow.\n\nA statement by her management said: “Due to the tragic events in Manchester the tour has been suspended up to June 5.”\n\n16 The singer couldn't hide her emotions as she made her first appearance since the terror attack Credit: Splash News/Backgrid\n\n16 Mac brought one of the singer's dogs to the airport to greet her Credit: Splash News/Backgrid\n\nFollowing the slaughter – carried out by Brit-born terrorist Salman Abedi – Ariana wrote an emotional post on social media saying she was “broken”.\n\nA representative from the singer’s label confirmed the 23-year-old was “OK”, although was reportedly left “in hysterics” following the bombing.\n\n16 Mac was seen giving a big hug to the singer's mum Joan, who was at the Manchester Arena with her daughter during the attack Credit: Splash News/Backgrid\n\n16 Ariana's canine companion waited patiently as the pop star hugged her man Credit: Splash News/Backgrid\n\n16 Reports suggest the plane was loaned to Ariana by fellow pop star Taylor Swift Credit: Splash News/Backgrid\n\n16 Joan was seen getting a big hug as the family reunited in Florida Credit: Splash News/Backgrid\n\nAriana's mum Joan reportedly escorted petrified fans to safety backstage moments after the attack.\n\nTMZ reported that Joan came to the aid of youngsters after leaving her front row seat following the gig.\n\nThe US site quotes eyewitnesses who saw Joan lead a group of fans into the backstage area where she comforted them until they were safely evacuated by police.\n\n16 Ariana and her rapper boyfriend have collaborated many times Credit: Getty Images\n\n16 Tributes have been left in Manchester to the 22 who died in the terror attack Credit: AP:Associated Press\n\nAriana's drummer has also spoken about the terrifying moment the bomb detonated as they made their way back to their dressing room after the show.\n\nSpeaking to Fox News, Aaron said the “painful memory will live with us all for ever”.", "images": ["data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.5 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.3 1\"%3E%3C/svg%3E", "https://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "https://www.thesun.co.uk/wp-content/uploads/2017/05/pmcomposite-twin-up-insetariana.jpg?strip=all&quality=100&w=750&h=500&crop=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.9 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.4 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.8 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2017/05/pmcomposite-twin-up-insetariana.jpg?strip=all&quality=100&w=750&h=500&crop=1", "keywords": [], "authors": ["James Beal", "Louise Randell"], "canonical_link": "https://www.thesun.co.uk/tvandshowbiz/3636769/ariana-grande-boyfriend-mac-miller-manchester-suicide-bombing/", "title": "Ariana Grande ‘praying for Manchester’ as she reunites with boyfriend Mac Miller after touching down in the US following concert terror attack", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Ariana Grande 'praying for Manchester' as she reunites with boyfriend Mac Miller", "url": "https://www.thesun.co.uk/tvandshowbiz/3636769/ariana-grande-boyfriend-mac-miller-manchester-suicide-bombing/", "description": "SHATTERED Ariana Grande was “praying for ­Manchester” yesterday following the deadly suicide attack at the end of her concert. The singer was consoled by her boyfriend Mac Miller as she returned to…", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2017/05/pmcomposite-twin-up-insetariana.jpg?strip=all&quality=100&w=750&h=500&crop=1", "width": 750, "height": 500}, "locale": "en_GB"}, "article": {"published_time": "2017-05-24T17:00:10+00:00", "modified_time": "2017-06-02T15:39:34+00:00", "publisher": 161385360554578, "tag": "Ariana Grande, Manchester terror attack 2017", "author": "https://www.facebook.com/thesunshowbiz/"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "description": "Pop star has been spotted for the first time since 22 people were killed at her concert on Monday night", "keywords": "Ariana Grande, Mac Miller, Manchester suicide bombing, manchester", "news_keywords": "Ariana Grande, Mac Miller, Manchester suicide bombing, manchester", "twitter": {"text": {"title": "Ariana Grande ‘praying for Manchester’ as she reunites with boyfriend Mac Miller after touching down in the US following concert terror attack"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "home comforts", "headline": "Ariana Grande 'praying for Manchester' after touching down in the US following concert terror attack", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2017/05/pmcomposite-twin-up-insetariana.jpg?strip=all&quality=100&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2017/05/pmcomposite-twin-up-insetariana.jpg?strip=all&quality=100&w=620&h=413&crop=1"}}, "parsely-post-id": 3636769, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1495645210.0, "source": "https://www.thesun.co.uk", "summary": ""}