{"url": "time.com/4939749/emmys-2017-political-moments/", "text": "Whenever an awards show takes place in the midst of a charged political climate, it’s always the topical speeches that define the night.\n\nThis year’s Emmy Awards honored TV’s current politicized landscape, so naturally winners from The Crown’s John Lithgow to Master of None’s Lena Waithe embraced the opportunity to make a statement on Sunday night. The most common target was, unsurprisingly, the president, who has had a troubled relationship with celebrities and awards shows — including the Emmys. Some went hard against the Trump administration, while others skipped the takedowns, and instead highlighted causes and marginalized groups.\n\nHere are all the moments when honorees and presenters got topical:\n\nStephen Colbert was right at home\n\nThe evening’s host had a prescription for those struggling with the tumultuous news cycle: watch TV! He opened the ceremony with the musical number “Everything Is Better on TV,” running through this year’s sizable roster of options for escapism with cameos from the likes of Julia Louis-Dreyfus and Chance the Rapper. Of course there were digs about how House of Cards is beginning to feel like real life. The big finish: a battalion of Handmaid’s Tale showgirls topped off the spectacle.\n\nColbert even looked at the camera and addressed President Trump directly. “Hello sir. Thank you for joining us. Looking forward to the tweets,” he said. The hits only got more pointed from there.\n\n“However you feel about the president, every show was influenced by Trump in some way. All the late night shows, obviously. House of Cards, the new season of American Horror Story, and of course next year’s Latin Grammys hosted by Sheriff Joe Arpaio.”\n\nPredictably, Colbert made a meal out of Trump complaining about his failure to snag an Emmy for his reality TV series Celebrity Apprentice.\n\n“If he had won an Emmy I bet he wouldn’t have run for president. So in a way, this was all your fault,” Colbert said. “I thought you people loved morally compromised anti-heroes. You loved Walter White. He’s just Walter much whiter.”\n\nColbert hit Trump’s “The Emmys are rigged” gripe hard by playing actual footage from the presidential debate when Trump peppered in his remark that “I should have gotten it,” while Hillary Clinton was attacking Trump about his Emmy snub complaints.\n\nBut Trump doesn’t have an Emmy, because as the host explained to huge applause, “Unlike the presidency, Emmys go to the winner of the popular vote.”\n\nSean Spicer rolled onstage\n\nColbert then segued into the cameo of the night. “Of course what really matters to Trump is ratings. You got to have the big numbers. We have no way of knowing how big our audience is. Sean, do you know?”\n\nThe audience lost it as Trump’s former White House Press Secretary Sean Spicer came out to assess the crowd size. When asked about how many eyeballs were on the show, Spicer delivered: “This will be the largest audience to witness an Emmys period — both in person and around the world,” referencing his own controversial responses to contested reports about Trump’s inauguration crowd size.\n\nTargets who weren’t Trump\n\nColbert also went after Senator Ted Cruz’s recent Twitter debacle. “Everyone loves streaming video. Just ask Ted Cruz,” he said, referencing the fact that Cruz’s Twitter account recently “liked” a tweet from a porn account. “But knock first. You don’t want to just walk in.”\n\nIt wasn’t all about politicians, though. Colbert also blasted Real Time host and Emmy nominee Bill Maher for his controversial use of the N-word.\n\nJohn Lithgow nods to history\n\nThe Crown’s Lithgow praised his character Winston Churchill’s leadership in his supporting actor acceptance speech. “In these crazy times, his life reminds us what courage and leadership in government looks like.”\n\nSaturday Night Live players address their political counterparts\n\nA tearful Kate McKinnon thanked Hillary Clinton, the main subject of her own political satire on Saturday Night Live, for her “grace and grit.”\n\nAlec Baldwin opened his acceptance speech, for his SNL performance as Trump, with a dig about POTUS: “At long last I suppose I should say, here, Mr. President, is your Emmy.”\n\n9 to 5 Reunion\n\nThe cast of the 1980 movie 9 to 5 — Lily Tomlin, Dolly Parton and Jane Fonda — used their platform as presenters to take a stab at Trump, too. “In 1980, we refused to be controlled by a sexist, egotistical, lying, hypocritical bigot boss,” Fonda opened. “And in 2017 we still refuse to be controlled by a sexist, egotistical, lying, hypocritical bigot boss,” Tomlin added.\n\nLena Waithe’s emotional speech\n\nAfter a standing ovation, Master of None’s Lena Waithe accepted the award for Outstanding Writing of a Comedy Series with a message for her “LGBTQIA family:” “I see each and every one of you. The things that make us different, those are our superpowers — every day when you walk out the door and put on your imaginary cape and go out there and conquer the world because the world would not be as beautiful as it is if we weren’t in it. And for everybody out there that showed so much love for this episode, thank you for embracing a little Indian boy from South Carolina and a little queer black girl from the South Side of Chicago.”\n\nDonald Glover actually thanked POTUS in his second speech\n\nAtlanta auteur Glover gave Trump a shout-out for activating him. “I wanna thank Trump for making black people the number one most oppressed group. He’s the reason I’m probably up here.”\n\nVeep‘s political moment\n\nEmmy darling Julia Louis-Dreyfus won for her leading role on Veep, the HBO comedy about incompetence in the White House, and included a reference to POTUS. “We did have a whole storyline about impeachment but we abandoned that because we were worried someone else might get to it first.”\n\nRiz Ahmed gave his causes a powerful dose of publicity\n\nWhen Ahmed won the Emmy for Lead Actor in a Limited Series or TV Movie for The Night Of, he used his speech to drive home a point. “If this show has shone a light on some of the prejudice in our societies, Islamophobia, some of the injustice in our justice system, maybe that’s something. I will shout out South Asian Youth Action for helping me prepare for this, and the Innocence Project.”\n\nNicole Kidman propelled domestic violence to the top of the agenda\n\nAfter winning an Emmy for her powerful portrayal of a domestic abuse survivor on Big Little Lies, Kidman closed her acceptance speech with a call to action. “We shone a light on domestic abuse. It is a complicated, insidious disease. It exists far more than we allow ourselves to know, it is filled with shame and secrecy and by you acknowledging me with this award it shines a light on it even more.”\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Ashley Hoffman at Ashley.Hoffman@time.com.", "images": ["http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/2017-emmy-awards-stephen-colbert-opening.jpg?quality=85&w=1200&h=628&crop=1", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2020/02/jr-oseary-oscar-party-featured.jpg?quality=85&w=600", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2020/02/bong-joon-ho.jpg?quality=85&w=600"], "top_img": "https://api.time.com/wp-content/uploads/2017/09/2017-emmy-awards-stephen-colbert-opening.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Ashley Hoffman"], "canonical_link": "https://time.com/4939749/emmys-2017-political-moments/", "title": "Every Political Moment at the 2017 Emmy Awards", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "emmys, emmys 2017, emmys donald trump, Lena Waithe, sean spicer emmys, sean spicer, emmys opening 2017, colbert trump jokes, best emmys moments, nicole kidman emmy", "news_keywords": "emmys, emmys 2017, emmys donald trump, Lena Waithe, sean spicer emmys, sean spicer, emmys opening 2017, colbert trump jokes, best emmys moments, nicole kidman emmy", "description": "The most charged political moments at the 2017 Emmy Awards.", "og": {"title": "Every Political Moment at the 2017 Emmy Awards", "type": "article", "site_name": "Time", "url": "https://time.com/4939749/emmys-2017-political-moments/", "description": "From Sean Spicer's grand entrance to the most charged speeches", "image": {"identifier": "https://api.time.com/wp-content/uploads/2017/09/2017-emmy-awards-stephen-colbert-opening.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/4939749/emmys-2017-political-moments/", "description": "The most charged political moments at the 2017 Emmy Awards.", "media": "https://api.time.com/wp-content/uploads/2017/09/2017-emmy-awards-stephen-colbert-opening.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/4939749/emmys-2017-political-moments/", "title": "Every Political Moment at the 2017 Emmy Awards", "description": "From Sean Spicer's grand entrance to the most charged speeches", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2017/09/2017-emmy-awards-stephen-colbert-opening.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}