{"url": "https://fashionista.com/2014/02/new-york-fashion-week-cost", "text": "How much does it cost a designer to show at New York Fashion Week? The short answer: It depends.\n\nWith the exception of select fashion insiders -- those directly involved in negotiating each component that goes into a fashion show (and maybe some of the people who compile their invoices and expense reports) -- few people actually know how much it costs to show at New York Fashion Week. While Lincoln Center recently disclosed the costs of its various show spaces, there are a slew of other expenses that factor into a designer's final tally: There are models, PR, production, styling, hair and makeup, at a minimum. And most of those costs vary based on several factors.\n\nWe spoke with a few of our industry friends to get the real scoop on how much showing at fashion week can cost. Here's the rundown.\n\nVenue: Venues, on average, can range from $15,000 to $60,000. The latter is what it costs to show at the Theater at Lincoln Center (its largest venue). Lincoln Center's other venues range in price from $15,000 for The Hub, to $47,500 for The Stage. Off-site venues can in some cases cost less, say, if it's a small off-the-beaten path gallery space. Or it can be more if, for example, it's a custom space at Skylight Studios, which Ralph Lauren spends two to three weeks constructing every season.\n\nStyling: Most designers place a lot more importance (and cash) on stylists than you might think. Of course, this varies -- some designers may style a show themselves, or have someone in-house do it. Others may use stylists they have on retainer throughout the year. But, a top-tier stylist can earn as much as $8,000 per day to style a show -- which can potentially be a 10 to 14-day job. Of course, not all stylists command those types of fees. A designer could secure someone less in-demand for around $10,000 total.\n\nProduction and PR: We're told production is typically in the $10,000 to $20,000 range, though sometimes that is included in PR, or a designer's PR company hires a producer. PR can cost in the $5,000 to $15,000 range. Additionally, a show fee for a designer may be less if the designer is on retainer with the firm.\n\nHair and Makeup: Here is where a designer can save -- and sometimes even make -- money. Both are usually sponsored by beauty companies. According to one source, a brand can even be paid between $5,000 to $15,000 to be chosen as its hair/makeup sponsor.\n\nModels: Models can vary quite a bit too depending on a company's strategy. But most of our sources said they have become one of their biggest money-suckers. While many designers used to just pay models in trade (clothes) instead of cash, models and organizations like the Model Alliance have been advocating for real payment, and it's started to work. According to a report by Amy Odell in BuzzFeed earlier this year, smaller labels will pay around $150 per model, while slightly bigger companies will pay around $200 to $500, which, when you factor in all that goes into being a model during fashion week -- castings, fittings, transportation -- is still not a ton. International mass brands might pay as much as $800 to $1,000, a model told Refinery29, and we've also heard that $1,000 is a normal amount. But at 10 to 20 models (depending on if models are repeating looks), it's a significant expense for brands.\n\nCelebrities: A decreasingly common, and less necessary expense that a few designers still shell out for is front-row celebrities. The amount a celebrity can command depends on a mix of how famous they are, how much their photos get picked up, how good a fit that celebrity is for the brand, and whether or not the celebrity is attending other shows. We reported last year that an A-lister exclusive can cost a company as much as $100,000, a lesser-known fashion darling who isn't an exclusive $15,000, and others might be paid in clothes or simply have travel and accommodations covered. And those numbers seem to be going down.\n\nLivestreaming: A relatively new and increasingly common component to a designer's runway show is a livestream. Costs can vary. According to Mashable, a livestream may be included in designers' show packages if they're showing somewhere like Lincoln Center or Milk Studios. Otherwise, it could cost a designer $20,000 to $50,000. Streaming itself costs around $12,000.\n\nDisclaimer: Personal relationships and how much a producer/stylist/venue owner/beauty brand/model wants to work with a brand, factor into and can drive down the cost of all of the above.\n\nThe Grand Total: Excluding celebrities, $200,000 is a reasonable amount a brand might spend on a basic runway show. But the above components are the bare necessities. Big brands like Marc Jacobs, Burberry and Chanel, all known for staging over-the-top spectacles, are spending way more. In 2011, Marc Jacobs president Robert Duffy told the New York Times that Jacobs' fall 2011 show cost at least $1,000,000 (or $1,750 per second). And we've heard that Burberry, with its custom-built space in London's Hyde Park, spends close to that.", "images": ["https://fashionista.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTMxNTYyODM1MDM2NjEzMjUx/gettyimages-463276328jpg.jpg", "https://fashionista.com/.image/c_fill%2Ccs_srgb%2Cfl_progressive%2Cq_auto:good%2Cw_1280/MTQ3MzQzMTc3NTg0NDg2MzU3/fashionista-hub-thebusines-1.jpg", "https://fashionista.com/.image/cs_srgb%2Cq_auto:good/MTQ1NTQ5OTY2NzI5ODE1NjA3/mtqwndi3ntcznze1oda1njgw-1.svg", "https://fashionista.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_60%2Cq_auto:good%2Cw_60/MTE5NTU2MzE5NTUyNjM2NDI3/dhani-mau-300x448jpg.jpg", "https://fashionista.com/.image/cs_srgb%2Cq_auto:good/assets/MTM0MTYyNjUxNDg2OTMwOTU0/site-nav-logo.svg", "https://fashionista.com/site/images/apple-touch-icon.png?v=2020-04-17-205441-3d5ce40-015427"], "top_img": "https://fashionista.com/site/images/apple-touch-icon.png?v=2020-04-17-205441-3d5ce40-015427", "keywords": [], "authors": ["Dhani Mau"], "canonical_link": "https://fashionista.com/2014/02/new-york-fashion-week-cost", "title": "How Much It Costs to Show at New York Fashion Week", "meta_data": {"referrer": "unsafe-url", "HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1", "apple-mobile-web-app-capable": "no", "apple-mobile-web-app-status-bar-style": "black", "format-detection": "address=no", "google-site-verification": "TUkwvpzHc7_80yJEnb9HCoPrp2jYlkLlZrEIu53H66o", "msvalidate.01": "565AA37CB662E60BF24DDCABEC686D8F", "generator": "Tempest - www.saymedia.com", "pinterest": "nohover", "author": "Dhani Mau", "description": "How much does it cost a designer to show at New York Fashion Week? The short answer: It depends.", "keywords": "Fashion Week,Fashion Week,Fall 2014,News,Fall 2014 New York,new york fashion week", "section": "Fashion Week", "pagetype": "article", "item-id": "ci01ada8f14001f41e", "published": "2014-02-05T14:11:43Z", "modified": "2014-04-11T11:31:32Z", "dcterms.rightsHolder": "Breaking Media, Inc. All rights reserved.", "dcterms.dateCopyrighted": 2020, "twitter": {"card": "summary_large_image", "site": "@Fashionista_com", "creator": "@DhaniMau", "url": "https://fashionista.com/2014/02/new-york-fashion-week-cost", "description": "How much does it cost a designer to show at New York Fashion Week? The short answer: It depends.", "domain": "fashionista.com"}, "og": {"type": "article", "url": "https://fashionista.com/2014/02/new-york-fashion-week-cost", "title": "How Much It Costs to Show at New York Fashion Week", "description": "How much does it cost a designer to show at New York Fashion Week? The short answer: It depends.", "site_name": "Fashionista"}, "fb": {"pages": 93829151519, "app_id": 143200122371223}, "p": {"domain_verify": "32a1f0a80abfeb4896ddfda6220640f7"}, "pinterest-rich-pin": "true", "apple-mobile-web-app-title": "Fashionista", "parsely-title": "How Much It Costs to Show at New York Fashion Week - Fashionista", "parsely-link": "https://fashionista.com/2014/02/new-york-fashion-week-cost", "parsely-post-id": "ci01ada8f14001f41e", "parsely-pub-date": "2014-02-05T14:11:43Z", "parsely-section": "Fashion Week", "parsely-author": "Dhani Mau", "parsely-tags": "Fashion Week,Fashion Week,Fall 2014,News,Fall 2014 New York,new york fashion week", "sailthru.title": "How Much It Costs to Show at New York Fashion Week", "sailthru.date": "2014-02-05T14:11:43Z", "sailthru.author": "Dhani Mau", "sailthru.tags": "Fashion Week,Fashion Week,Fall 2014,News,Fall 2014 New York,new york fashion week", "sailthru.description": "How much does it cost a designer to show at New York Fashion Week? The short answer: It depends.", "phx": {"content-item-id": "ci01ada8f14001f41e", "content-object-type": "ContentArticle"}, "ir-site-verification-token": 666366253}, "movies": [], "publish_date": 1391609503.0, "source": "https://fashionista.com", "summary": ""}