{"url": "https://en.wikipedia.org/wiki/Tiffany_Pollard", "text": "Tiffany Pollard (born January 6, 1982),[1][2] is an American television personality and actress. She first achieved public recognition for her participation in VH1's Flavor of Love (2006-2007) and I Love New York (2007-2008).\n\nPollard was given the nickname \"New York\" by rapper Flavor Flav. She is also known colloquially by her self-proclaimed nickname, the \"HBIC (Head Bitch In Charge)\",[3] which she exclaimed in the Flavor of Love series to taunt her competitors.[4]\n\nIn 2016, Pollard took part in the seventeenth series of Celebrity Big Brother, finishing in fourth place. Pollard was also a cast member in the television series The Next:15 (2016). She and her mother were main cast members in the first series of Family Therapy with Dr. Jenn (2016). Pollard also appeared in the second season of E! reality show Famously Single (2016-2017).\n\nPersonal life [ edit ]\n\nPollard was born in Utica, New York to Michelle Rothschild-Patterson (also known as \"Sister Patterson\") and Alex Pollard.[5] Pollard has used the surnames of both her parents, who are unmarried.[6] She attended John F. Kennedy Middle School and graduated from Thomas R. Proctor High School.[7]\n\nPollard was engaged to the I Love New York season 1 winner Patrick \"Tango\" Hunter for a six-month period until Hunter called off the engagement on the reunion show.[8] She was also engaged to George \"Tailor Made\" Weisgerber, the winner of I Love New York 2. On September 8, 2008, she announced on episode 6 of her show, New York Goes to Hollywood, that she had officially separated from Weisgerber.[9]\n\nIn an episode of Brunch with Tiffany, Pollard revealed that she has bipolar disorder.[10]\n\nTelevision appearances [ edit ]\n\n2006: Breakthrough with Flavor of Love [ edit ]\n\nFlavor of Love [ edit ]\n\nPollard (then age 23) clashed with virtually all the other contestants. Although these feuds were, in general, nothing more than screaming matches, an incident in the penultimate episode of season one led to violence. After her elimination, an outraged Brooke \"Pumkin\" Thompson spat on Pollard after the two had exchanged words.[11] Pollard vowed to \"whoop Pumkin's ass\", and attempted to do so at the season one reunion.[12] The moment was rated number one on various VH1 and MTV reality show specials, including VH1's 20 Greatest Celebreality Fights.[citation needed] The final two contestants journeyed to Puerto Vallarta, Mexico where Flavor Flav chose Nicole \"Hoopz\" Alexander over Pollard, to be his mate.[13]\n\nFlavor of Love 2 [ edit ]\n\nAfter his relationship did not work out with Alexander, Flavor Flav chose to do a second season of his dating show and invited Pollard (then age 24) to help him eliminate contestants halfway through the season. She agreed and was later added as a participant.[14] In the finale, Flav chose Deelishis over Pollard.[15] Pollard verbally fought with Flav in the season finale, asking why he had brought her back only to be ultimately eliminated.[16]\n\n2007–2009: VH1 Spinoffs [ edit ]\n\nI Love New York [ edit ]\n\nI Love New York was Tiffany Pollard's first reality television series on VH1. The series is a spin-off of another relationship competition series, the Flavor of Love, which featured Pollard as a finalist in two consecutive seasons. In July 2006, VH1 published a casting call for contestants for a new series tentatively titled The Flavorette. Various blogs speculated that the star of this program could be Flavor of Love season 1 contestant Rain, Hoopz (Nicole Alexander) or Pollard. Before the season 2 Flavor of Love finale, Pollard denied having her own show but after the finale aired, she confirmed she was the \"Flavorette\" and that she was already down to the final three contestants. The show premiered on Monday, January 8, 2007 and was the most-watched series debut in VH1 history with 4.426 million viewers.[17] Its season 1 finale brought in 4.8M million viewers and its reunion show ratings held 5.01 million viewers. Spin-offs from the series include I Love Money, New York Goes to Hollywood, Real Chance of Love, New York Goes to Work, and Frank the Entertainer in a Basement Affair.\n\nI Love New York 2 [ edit ]\n\nI Love New York 2 premiered October 8, 2007 on VH1.[18] In the finale of I Love New York 2, contestant \"Tailor Made\" (real name George Weisgerber) proposed to Pollard, but was turned down. The finale earned 5.4 million viewers. During the I Love New York 2 reunion special, Tailor Made proposed a second time and Pollard accepted. The reunion special earned 4.86 million viewers.[19][20]\n\nNew York Goes to Hollywood [ edit ]\n\nNew York Goes to Hollywood premiered August 4, 2008 on VH1. The eight episode season follows Pollard as she tries to establish herself as an actress in Hollywood, California.\n\nNew York Goes to Work [ edit ]\n\nNew York Goes to Work premiered on May 4, 2009. The reality show followed Pollard as she searches for a regular job.[21] The jobs were selected by fans (via text messaging) from a list of three possible jobs for each episode. Pollard would receive a $10,000 bonus each week if she were able to impress her employer. However, if she quit, failed, or was fired, she would not receive a bonus for the week. Pollard won $45,000 over the series, and earned bonuses in four jobs (in episodes 1, 2, 5, and 6); she lost, failed in, or quit four jobs (in episodes 3, 4, 7, and 8); and come to a draw in the season finale. At the end of the series, a mobile poll was presented giving three choices for New York's next task, and the most votes were cast for I Love New York 3.\n\nI Love New York 3 [ edit ]\n\nProduction for I Love New York 3 was set to kick off sometime in the first quarter of 2010; however, prior to that time frame, VH1 requested immediate cancellation of the \"celebreality\" franchise and shelved plans for I Love New York 3. In the summer of 2011, Pollard hinted that I Love New York 3 was cancelled due to the murder-suicide case of Ryan Jenkins, who was a former contestant of Megan Wants a Millionaire.[22]\n\n2015–present: Reality television comeback [ edit ]\n\nOn April 14, 2015, Pollard appeared on an episode of the E! Network's series, Botched, where she detailed her botched surgeries that have left her breasts sagging with extra skin. She appeared on the show in hopes of getting them corrected, so she could resume her reality TV career.[3][23][24]\n\nOn January 5, 2016, Pollard entered the Celebrity Big Brother house in the United Kingdom to participate in the show's seventeenth season. She was involved in an infamous misunderstanding in which Pollard believed that David Gest had died of cancer inside the house; it subsequently turned out the deceased was David Bowie, the ex-husband of Pollard's fellow housemate Angie Bowie.[citation needed]\n\nThroughout her time on the show, Pollard proved popular with the British public and achieved the most votes to save her over her fellow contestants on at least one occasion. On February 5, Pollard made the final and came in fourth place, ranking higher than any other American female who had been on the show.[25] Due to her popularity on the show, Pollard appeared in many UK publications including New! magazine. She also became a regular fixture on the Big Brother spin off show Big Brother's Bit on the Side, during Big Brother 17 (UK).\n\nIn January 2016, Pollard was announced as a main cast member on TV One's The Next :15, which premiered on February 10, 2016.[26] In February 2016, Pollard was announced as a cast member on the first season of Family Therapy with Dr. Jenn, which premiered on March 16, 2016 on VH1. In August 2016, it was announced that Pollard would host new gay dating show, The Ex, for which she also served as executive producer. The show hasn't been picked up by a network yet.[27][28]\n\nOn February 9, 2017, Tiffany's VH1 digital series Brunch with Tiffany premiered. The series follows Tiffany as she informally interviews a celebrity guest over brunch. The pilot featured The Real Housewives of New York star Sonja Morgan.[29]\n\nIn August 2017, it was announced that Pollard would compete in the first season of VH1's Scared Famous, which premiered on October 23, 2017.[30]\n\nSeveral images and GIFs of Pollard, taken from her various VH1 appearances, have developed into internet memes on social network sites such as Tumblr and Twitter.[31] A notable example includes \"New York on a Bed,\" which became a popular meme on Twitter used to express emotions of frustration and discomfort as well as moments of awkwardness.[32]\n\nIn 2019, Pollard was a guest judge for an episode of RuPaul's Drag Race season 11. [33]\n\nActing career [ edit ]\n\nPollard's first movie role was in the comedy First Sunday (2008). She appeared in a supporting role, acting alongside Ice Cube, Regina Hall, and C. J. Sanders.\n\nPollard participated in a 2009 national tour of the Vagina Monologues with an all-black cast, most of whom are also former reality show contestants.[34] Pollard also appeared in a play called The Clean Up Woman in 2009, and in The Trial of The Chicago 7 in 2010.\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nYear Title Role Notes 2008 First Sunday Client As Omunique's Client 2014 The Shop Kiana\n\nTelevision [ edit ]\n\nTheater [ edit ]\n\nWeb [ edit ]\n\nYear Title Notes 2017–present Brunch with Tiffany Host; on VH1's YouTube channel for 3 seasons Oct. 16, 2019 People TV \"Tiffany Pollard Takes Us Behind The Scenes Of Her Greatest 'HBIC' Moments\"\n\nAwards and nominations [ edit ]\n\nYear Result Award Category Recipient 2006 Won Fox Reality Awards Favorite Fight Flavor of Love 2006 Won Fox Reality Awards Favorite Villain Flavor of Love 2007 Nominated Fox Reality Awards Most Memorable Reality Performer Flavor of Love, Flavor of Love 2 & I Love New York", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Tiffany_Pollard_for_wiki.png/220px-Tiffany_Pollard_for_wiki.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Tiffany_Pollard_for_wiki.png/1200px-Tiffany_Pollard_for_wiki.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Tiffany_Pollard_for_wiki.png/1200px-Tiffany_Pollard_for_wiki.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Tiffany_Pollard", "title": "Tiffany Pollard", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Tiffany_Pollard_for_wiki.png/1200px-Tiffany_Pollard_for_wiki.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}