{"url": "https://www.washingtonpost.com/news/fact-checker/wp/2016/05/18/clinton-campaigns-claim-that-trump-would-force-schools-to-allow-guns-in-classrooms/", "text": "That’s largely because Trump himself hasn’t talked about it much publicly. His campaign, as usual, didn’t respond to our request for more information, and doesn’t seem to have answered other media outlets’ requests, either.\n\nAD\n\nPerhaps Trump is saving the details until his May 20 speech at the National Rifle Association leadership event. (The NRA wants to repeal gun-free zones.) In the meantime, we took a look at the few instances he’s described his plan to see what he intends to do about school gun-free zones.\n\nAD\n\nThe Facts\n\nCongress enacted the Gun-Free School Zones Act in 1990, under President George H. W. Bush, as a part of a larger crime bill, in response to school shootings in the 1980s. It was struck down by the Supreme Court because of violations under the Commerce Clause but was reenacted under President Bill Clinton with a list of exceptions supported by the NRA.\n\nAD\n\nThe law makes it illegal under federal law for people to carry or discharge a firearm in a school zone, but states can decide whether to allow concealed carry at K-12 schools or colleges. Most states prohibit concealed carry. There is a dispute between gun-rights and gun-control advocates as to whether the law enacted to prevent shootings on school grounds actually motivates people to target schools, since the victims would be unarmed. (We plan to explore this in a future fact-check.)\n\nAD\n\nAfter the 2012 shooting at Sandy Hook Elementary School, states began introducing legislation to arm teachers and staff at K-12 schools. In 2013 alone, at least 33 states introduced more than 80 bills to authorize school districts to allow certain teachers and staff to carry concealed firearms, according to the National Conference of State Legislatures. Since 2013, more states have considered laws allowing guns on college campuses.\n\nThat year, seven bills were signed into law allowing limited concealed carry with a permit at K-12 schools (mostly applicable to private schools). Some states have specific exemptions for guns in school zones with a concealed-carry permit, such as guns carried by security or law enforcement or unloaded firearms locked in a vehicle on school property.\n\nAD\n\nTrump has argued against gun-free zones at military bases since last October, but he has been less vocal about repealing gun-free zones at schools.\n\nAD\n\nThe one time he talked about it publicly was at a January 2016 rally in Vermont: “I will get rid of gun-free zones on schools — you have to — and on military bases. My first day, it gets signed, okay? My first day. There’s no more gun-free zones.” His campaign did not respond to requests by the media to clarify his proposal.\n\nOur colleague Jenna Johnson reported at the time that the proposal “raises a number of questions, such as: Would this apply to all public schools, from elementary to college? How would schools deal with the likely logistical and safety concerns created by having guns on the grounds?”\n\nAD\n\nTrump was asked similar questions a few weeks later during an interview with the Outdoor Channel. This seems to be one of the only times he was ever asked directly about his proposal: How would you mandate that legislation? By executive order? Since public schools are legislated by the states, how could you make such an order stick? Would this legislation apply just to public schools, or private as well?\n\nAD\n\nTrump’s answer was still devoid of specifics:\n\n“I’m going to get rid of the gun-free zones on the military bases. I’m also going to do it in schools. You say you have a school, and it’s gun-free. The criminals are out there saying, ‘This is incredible. This is perfect. There’s no guns in there. I’m the only one that’s going to have guns.’ You can’t do it. I’m going to work with the states, and if I have to, I’m going to try and perhaps override the states if I have to, if I’m allowed to do that. . . . But we can’t have gun-free zones where, I see schools advertise, ‘We are a gun-free zone.’ And then you have these crazy people out there saying, ‘Boy, this is the most incredible thing,’ and that’s happening.”\n\nThe Pinocchio Test\n\nTrump hasn’t offered many details of his proposal, but it is clear that he wants to force states to allow guns in schools. Would he propose that Congress repeal the federal ban? Would it become illegal for states to pass laws to prohibit concealed carry at schools? The specifics aren’t clear yet.\n\nAD\n\nTrump said he would “work with the states” but that he would “override the states if I have to.” Based on what he has said publicly so far, Trump indeed would force schools to allow guns. And he wants to make it happen on his first day as president.\n\nThe Geppetto Checkmark\n\nSend us facts to check by filling out this form\n\nCheck out our 2016 candidates fact-check page", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/a372c7f2-5bfd-4015-bff0-0143ab0022ca.png&w=90&h=90", "https://www.washingtonpost.com/resizer/75shtX7HtDdbbqO23X5BhWMxSEY=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ISY5EJVLGAYIZAQRH3YVJLOKG4.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RCHXPWSLFYY2VK6FIRASM5D2FQ.jpg&w=150"], "top_img": "https://www.washingtonpost.com/resizer/75shtX7HtDdbbqO23X5BhWMxSEY=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ISY5EJVLGAYIZAQRH3YVJLOKG4.jpg", "keywords": [], "authors": ["Michelle Ye Hee Lee", "National Political Enterprise", "Accountability Reporter Covering Money", "Influence In Politics"], "canonical_link": "https://www.washingtonpost.com/news/fact-checker/wp/2016/05/18/clinton-campaigns-claim-that-trump-would-force-schools-to-allow-guns-in-classrooms/", "title": "Clinton campaign’s claim that Trump would ‘force schools to allow guns in classrooms’", "meta_data": {"description": "We look into what exactly Donald Trump has said about getting rid of gun-free zones in schools.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/fact-checker/wp/2016/05/18/clinton-campaigns-claim-that-trump-would-force-schools-to-allow-guns-in-classrooms/", "image": "https://www.washingtonpost.com/resizer/75shtX7HtDdbbqO23X5BhWMxSEY=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ISY5EJVLGAYIZAQRH3YVJLOKG4.jpg", "title": "Analysis | Clinton campaign’s claim that Trump would ‘force schools to allow guns in classrooms’", "description": "We look into what exactly Donald Trump has said about getting rid of gun-free zones in schools."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Analysis | Clinton campaign’s claim that Trump would ‘force schools to allow guns in classrooms’", "description": "We look into what exactly Donald Trump has said about getting rid of gun-free zones in schools."}, "last_updated_date": "2018-08-15T19:23:26.602Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1463500800.0, "source": "https://www.washingtonpost.com", "summary": ""}