{"url": "https://www.papercitymag.com/culture/ellen-degeneres-donates-one-million-hurricane-harvey-devastated-high-school-rockport-surprise/", "text": "Ellen DeGeneres is donating a whopping $1 million to a Hurricane Harvey devastated high school. DeGeneres teamed up with Lowe’s to give the largest gift in her show’s history to Texas’ own Rockport-Fulton High School. The gift was revealed in a segment on DeGeneres’ popular syndicated daytime TV show.\n\nThe money will be used to rebuild the high school’s Harvey destroyed gym. It means the world to Rockport-Fulton’s student-athletes.\n\n“I spend more time in that gym than I do at home,” senior volleyball player Allison Sanders said on The Ellen DeGeneres Show. “Losing it was devastating.”\n\nJ.J. Watt — the man who raised $37 million for Hurricane Harvey relief — weighed in with his own gushing praise for DeGeneres.\n\nLast August, DeGeneres committed $50,000 of her own money to Harvey relief and presented a $1 million check from Walmart to J.J. Watt’s fundraising efforts.\n\nWhen the Category 4 storm made landfall in Rockport on August 25, Aransas County ISD suffered some of the most devastating damage of any of the Texas school districts. The eye of the storm passed directly over Rockport. The area was severely impacted, with $55 million in damages. Rockport-Fulton is the only high school in the town — and its gym nicknamed Gold Gym was leveled by the storm.\n\nDeGeneres surprised the high school’s students on her show after playing a special video. Five Rockport-Fulton girl volleyball players shared their painful stories and commitment to helping their community.\n\n“The moment I realized how bad it was when we got pictures of our gym and realized it was just everywhere. It was like a second home for us, and to see it destroyed was so devastating,” one student said.\n\nScenes of the girls playing volleyball were mixed in with Harvey footage, both of the storm itself and the entire town banding together to rebuild.\n\n“Because Rockport is such a tight-knit community, I think the need to help was so much greater,” one student said in the video. It was that resiliency and determination that caught DeGeneres’ eye. Student Sydney Macha first contacted the show’s producers. Skype meetings with the program heads kicked off in February.\n\nAfter the video played, DeGeneres revealed that the high school students and volleyball coaches had gathered in the middle school. They believed they would be recording for Ellentube. You could say they were in for a surprise.\n\nDeGeneres recognized that the significance of the high school gym to all of Rockport’s resilient citizens. “I know that your gym was more than a gym to you,” she noted. “It was important to your entire community.”\n\nThe volleyball players updated DeGeneres on Rockport’s progress, some through tears and others nervous about speaking to the celebrity. “It’s Ellen!” one laughed. She described the situation, with people still displaced eight months later and many out of jobs.\n\n“We have our friends, we have our family, we have our team. So we’re OK.”\n\nBut OK wasn’t good enough for DeGeneres. “That’s what I love. I mean you’ve lost so much and yet everyone overcame together to help the community,” she said. Right before the commercial break, the host teased that she had a big announcement.\n\nAs soon as the break was over, DeGeneres revealed the $1 million gift. The gym erupted in cheers, with students jumping up and down with joy as green and white confetti poured down — Rockport-Fulton’s school colors.\n\nWith the donation, Lowe’s Heroes from stores in the area will help build a new gym. Soon, it’ll be good as Gold.", "images": ["https://3q87le1gsko01ibim33e4wib-wpengine.netdna-ssl.com/apple-touch-icon.png", "https://3q87le1gsko01ibim33e4wib-wpengine.netdna-ssl.com/wp-content/uploads/2020/03/300x120.jpg", "https://padmin.papercitymag.com/assets/useradds/logos/ulterre-logo-min.png?1560466079254", "https://3q87le1gsko01ibim33e4wib-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/ellen-degeneres-love.jpg", "https://3q87le1gsko01ibim33e4wib-wpengine.netdna-ssl.com/wp-content/uploads/2020/03/1200x150.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://3q87le1gsko01ibim33e4wib-wpengine.netdna-ssl.com/apple-touch-icon.png", "keywords": [], "authors": ["Annie Gallay"], "canonical_link": "https://www.papercitymag.com/culture/ellen-degeneres-donates-one-million-hurricane-harvey-devastated-high-school-rockport-surprise/", "title": "Ellen DeGeneres Donates $1 Million to Hurricane Harvey Devastated High School: Its Students Are Floored by the Surprise — and Even J.J. Watt is Impressed", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "description": "Ellen DeGeneres sent plenty of love — and a million dollars — to a Hurricane Harvey devastated school. DeGeneres teamed up with Lowe's to give the largest gift in her show's history to Texas’ own Rockport-Fulton High School. Even J.J. Watt is impressed. As surprises go, it doesn't get better than this.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Ellen DeGeneres Donates $1 Million to Hurricane Harvey Devastated High School: Its Students Are Floored by the Surprise — and Even J.J. Watt is Impressed | PaperCity Magazine", "description": "Ellen DeGeneres sent plenty of love — and a million dollars — to a Hurricane Harvey devastated school. DeGeneres teamed up with Lowe's to give the largest gift in her show's history to Texas’ own Rockport-Fulton High School. Even J.J. Watt is impressed. As surprises go, it doesn't get better than this.", "url": "https://www.papercitymag.com/culture/ellen-degeneres-donates-one-million-hurricane-harvey-devastated-high-school-rockport-surprise/", "site_name": "PaperCity Magazine"}, "article": {"publisher": "https://www.facebook.com/PaperCityMag", "section": "Culture", "published_time": "2018-04-17T19:14:05+00:00"}, "fb": {"app_id": 416722705173450}, "twitter": {"card": "summary_large_image", "description": "Ellen DeGeneres sent plenty of love — and a million dollars — to a Hurricane Harvey devastated school. DeGeneres teamed up with Lowe's to give the largest gift in her show's history to Texas’ own Rockport-Fulton High School. Even J.J. Watt is impressed. As surprises go, it doesn't get better than this.", "title": "Ellen DeGeneres Donates $1 Million to Hurricane Harvey Devastated High School: Its Students Are Floored by the Surprise — and Even J.J. Watt is Impressed | PaperCity Magazine", "site": "@papercitymag", "image": "https://www.papercitymag.com/wp-content/uploads/2018/04/ellen-degeneres-love.jpg", "creator": "@papercitymag"}, "google-site-verification": "7e65PyTcjjTX6KBhkv1D3pM5h3E7eOkVKEsVfJ87D0U"}, "movies": [], "publish_date": 1523992445.0, "source": "https://www.papercitymag.com", "summary": ""}