{"url": "https://people.com/tv/lena-dunham-apologizes-defending-girls-writer-accused-rape/", "text": "Lena Dunham is opening up about her “terrible mistake.”\n\nIn her guest editor letter for The Hollywood Reporter‘s Women in Entertainment issue, Dunham, 32, once again apologized for having previously defended Murray Miller, a Girls writer who was accused of sexual assault by actress Aurora Perrineau.\n\nGet push notifications with news, features and more.\n\n“I made a terrible mistake. When someone I knew, someone I had loved as a brother, was accused, I did something inexcusable: I publicly spoke up in his defense,” she wrote. “There are few acts I could ever regret more in this life. I didn’t have the ‘insider information’ I claimed but rather blind faith in a story that kept slipping and changing and revealed itself to mean nothing at all.”\n\n“I wanted to feel my workplace and my world were safe, untouched by the outside world (a privilege in and of itself, the privilege of ignoring what hasn’t hurt you) and I claimed that safety at cost to someone else, someone very special,” she continued.\n\nDunham also apologized directly to Perrineau, 24.\n\n“To Aurora: You have been on my mind and in my heart every day this year,” she said. “I love you. I will always love you. I will always work to right that wrong. In that way, you have made me a better woman and a better feminist.”\n\n“You shouldn’t have been given that job in addition to your other burdens, but here we are, and here I am asking: How do we move forward? Not just you and I but all of us, living in the gray space between admission and vindication,” she continued.\n\nDunham said that it was “painful to realize” that she “had actually internalized the dominant male agenda that asks us to defend it no matter what, protect it no matter what, baby it no matter what.”\n\n“There are some who will think I am writing this to curry public favor (that’s OK, though, I stopped thinking that was an option for me somewhere around 2014, and that’s some kind of freedom),” she added. “I have the only women I want or need in my life. And this is the Women in Entertainment issue, and women in entertainment need healing. Sometimes healing starts with the words: I’m sorry.”\n\nImage zoom Jay L. Clendenin/Contour/Getty\n\nPerrineau, daughter of Lost star Harold Perrineau, alleged Miller sexually assaulted her in 2012 when she was only 17. She filed a complaint last year about the alleged attack with the Los Angeles County Sheriff’s Office, claiming that she met Miller at L.A.’s Standard Hotel with friends in 2012 and “consumed some alcoholic beverages.” She alleged Miller, then 35, asked them for a ride home, where they all went inside, reluctantly on her part, after arriving.\n\nIn her statement for a polygraph test taken in September 2017, she claimed she awoke naked in his bed where he was “having sexual intercourse” with her, against her consent.\n\nMiller’s attorney, Matthew Walerstein, told The Wrap at the time he “categorically and vehemently denies Ms. Perrineau’s outrageous claims,” adding that his legal team had “gathered overwhelming evidence directly contradicting these false and offensive claims.”\n\nDunham and alongside Girls co-creator Jenni Konner then released a statement in which they voiced their support for Miller and insinuated that Perrineau “misreported” the rape. The statement was met with serious backlash, and Dunham later issued an apology on Twitter.\n\nIn an interview with New York Magazine last month, Dunham said Perrineau’s allegations went public two days after she had undergone an elective total hysterectomy in the hopes of treating her chronic pain caused by endometriosis, and she was she was “high as a f—ing kite” from the surgery.\n\nWhen she was asked to comment on the allegations, Dunham — who has been public about her experiences with sexual assault — said she recalling thinking: “Well, people know that I’m an advocate for these issues, so if I say this, they’ll know I’m not coming from X or Y place. … I think I was just like, F— everyone else. This is my tribe. Let’s keep it safe.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Flena-dunham-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Flena-dunham-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Flena-dunham-1-2000.jpg", "keywords": [], "authors": ["Aurelie Corinthios"], "canonical_link": "https://people.com/tv/lena-dunham-apologizes-defending-girls-writer-accused-rape/", "title": "Lena Dunham Apologizes for Defending Girls Writer Accused of Rape", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Girls,Lena Dunham,News,Sexual Assault,TV", "news_keywords": "Girls,Lena Dunham,News,Sexual Assault,TV", "description": "Actress Aurora Perrineau previously accused Girls writer Murray Miller of sexually assaulting her when she was 17", "og": {"title": "Lena Dunham on Defending Girls Writer Accused of Rape: 'I Did Something Inexcusable'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/lena-dunham-apologizes-defending-girls-writer-accused-rape/", "description": "Lena Dunham&nbsp;is opening up about her “terrible mistake.” In her guest editor letter for The Hollywood Reporter‘s Women in Entertainment issue, Dunham, 32, once again&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Flena-dunham-1-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/lena-dunham-apologizes-defending-girls-writer-accused-rape/", "description": "Actress Aurora Perrineau previously accused Girls writer Murray Miller of sexually assaulting her when she was 17", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Flena-dunham-1-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/lena-dunham-apologizes-defending-girls-writer-accused-rape/", "title": "Lena Dunham on Defending Girls Writer Accused of Rape: 'I Did Something Inexcusable'", "description": "Actress Aurora Perrineau previously accused Girls writer Murray Miller of sexually assaulting her when she was 17", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Flena-dunham-1-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}