{"url": "www.theguardian.com/tv-and-radio/2017/jan/28/gavin-rossdale-the-voice-gwen-stefani", "text": "Better known as Gwen Stefani’s ex than as a rock singer, he’s now trying his hand as a judge on The Voice UK. He discusses Marilyn, Bush and a private life in the public eye\n\nAbout an hour into Gavin Rossdale’s new job as a judge on The Voice UK, the ITV producers had a word in his ear.\n\n“They asked me to up the energy, because I was a bit laidback,” he admits. “But then I’ve been told that for years on TV. I’d meet these presenters that were really loud and I’d think: ‘Why are you being so annoying?’ And then I’d watch it on TV and I’d look half-dead and they look normal.”\n\nIt’s understandable if Rossdale seems slightly low-energy today. He has been working since 5am, and for a large part of that time he has been forced to interact with the British press. For years, the UK music mags tore into his band Bush – mocking his private school upbringing and his embracing of angsty American grunge just as Britpop was sweeping that sound away over here. More recently, Rossdale has been tabloid gossip fodder – the ex-husband of Gwen Stefani who allegedly wronged her by sleeping with the nanny. And yet here he is, having to play nice for the same publications.\n\n“I felt like a rag doll” is how he describes the experience. “I was not really saying anything and just waiting for them to cut me up like a sushi chef one more time.”\n\nIt hasn’t escaped my mind that Rossdale is sitting here talking to … a member of the British press. He’s polite and engaged, but he doesn’t trust me very much. Most journalists, he says, are nice to his face – “because I’m bigger than they think I am” – but end up stitching him up when they get behind their keyboard. I glance at the gleaming triangular ring on his finger, which would double neatly as a knuckle duster, and wonder how this encounter might go …\n\nFacebook Twitter Pinterest Will.i.am, Jennifer Hudson, Sir Tom Jones and Gavin Rossdale. Photograph: Joel Anderson/ITV\n\nRossdale was not an obvious choice for the UK version of The Voice. A massive rock star in the US who has shifted about 20m albums, he has been a comparative flop back home. He admits he was shocked to get the call – “I thought I was being punk’d!” – and a fair few “Who is Gavin Rossdale?” pieces made their way to publication.\n\nDoes he see the irony in being asked to coach UK pop stars when he struggled to make an impact here?\n\n“For sure,” he says, grinning. “The reason why Bush never got signed at first was always that I couldn’t sing. But I believe great singers become great singers.”\n\nRossdale is a quiet presence on the show – perhaps a little nervous at first – but he scares the other judges with his smooth talk and his ability to win over contestants and convince them to join his team. In a canny twist by the show’s producers, his ex-wife judges on the US version. But Rossdale says other reasons are behind his desire to appear on it. Bush have a new album out in early 2017; this could be one last, unexpected, opportunity to try to break Britain. “I was clearly at peace with not having [done so],” he says, “but I always felt it was unfortunate we weren’t given the exposure that could have led to a few more people knowing about us,” he says.\n\nI wonder what it must have been like, playing enormodomes in the US and then returning home to play pub shows to nobody, but Rossdale says it wasn’t like that: “We were having really killer shows [in the UK], but then getting destroyed in the reviews.” I never played shows here that weren’t packed, that weren’t full of people having an amazing time … well, apart from whoever was writing the review.”\n\nFacebook Twitter Pinterest Swallowed, Bush’s biggest hit in the UK.\n\nWhat was the worst thing anyone ever wrote about him?\n\n“Oh, God, it just went on and on,” he says. “I stopped reading it, which was a much better decision by me. I still don’t. I had to tell my new manager to stop sending me press cuttings recently, but he’s still doing it.”\n\nEven in the US, the press could be snarky. When Rossdale made the cover of Rolling Stone in 1996, the topless shot of him ran alongside the cover line: “Why won’t anyone take Gavin Rossdale seriously?” Is it true he had the cover framed, but pointedly crossed out the cover line? “It’s the only cover I’ve ever seen them insult anyone,” he sighs. “But I’m sorry, that’s not true. I wouldn’t bother framing a Rolling Stone magazine, although people do still ask me to sign it occasionally. And I always sign over the word ‘seriously’ and replace it with ‘to lunch’.”\n\nThe next morning, I meet Rossdale after another early start – he has just finished a This Morning interview, in which he seemed overjoyed to have met Philip Schofield (“He’s been on screen all my life!”). There’s no low energy today. We zip through Rossdale’s early life as a “painfully shy” outsider living out various dual roles simultaneously: he schooled at the ultra-posh Westminster College, yet hung around with football casuals from the estates near his Swiss Cottage home. He spent a couple of teenage weekends in an East End pub, serving jellied eels to gangsters and learning to double-salt the crisps so that punters drank more. Yet by 16 he had run away to start a new life – music was his main solace and he ended up frequenting hedonistic clubs such as Taboo and the Wag Club.\n\nFacebook Twitter Pinterest Photograph: Graeme Robertson/The Guardian\n\nIt was around this time that he met the popstar Marilyn, who has said they had a love affair he never got over, although Rossdale describes the suggestions it lasted for five years as “complete nonsense”. He continues: “I knew him for five minutes. You hang out with people and, when you’re young, you find out what you want … and that just wasn’t my world. I’m the biggest libertarian on earth, I have no qualms with anyone doing anything ... I couldn’t care less if you want to sleep with a telephone.”\n\nBeing asked about Marilyn is the closest Rossdale gets to angry during the interview – he says he’s fed up having to talk about something he considers inconsequential that happened decades ago. I notice he’s still wearing the spiked ring from yesterday.\n\n“I wear it as my armour against you!” He swivels it around so that the spike is within his hand. “This is the friendly side,” he says – symbolically, I think, but then he swivels it back into spike mode.\n\n“I’m not actually a violent person,” he says. “And I am fully aware that I have an incredible life and I should be grateful and shut the fuck up. I have no complaints, really. I mean, of course I have complaints, I have loads of complaints – I got divorced! It was the worst time of my life ever!”\n\nFacebook Twitter Pinterest Gavin Rossdale, Nigel Pulsford, David Guy Parsons and Robin Goodridge of Bush. Photograph: Mick Hutson/Redferns\n\nWas he aware of how negative the press was about him?\n\n“Well, if you divorce America’s sweetheart, you’re in trouble. Or rather, if she divorces me. So … I don’t read that stuff, but I know I’ve been portrayed as a bad guy.” Rossdale says his priority is his kids, so he would never say anything bad about her publicly. “She’s the mother of my children and one of the most incredible girls in the world.”\n\nAre they still talking?\n\n“She has a boyfriend and she’s busy … but I wish her all the happiness in the world, and that’s the true sign of love. As I’m sure your favourite artist Sting said: ‘If you love someone, set them free.’” Last year, Stefani released This Is What The Truth Feels Like, which dealt with their split in forensic detail: “I don’t know why I cry/ But I think it’s ’cause I remembered for the first time/ Since I hated you/ That I used to love you”, she sang on Used To Love You. Has Rossdale heard it?\n\n“Erm,” he says, pausing for a while. “You know, I did hear it the other day in an airport.” He trails off for a moment. “Now I’m talking about Gwen more than I intended to. Fucking journalists! But, yeah, I walked through the airport and they had one of those little kiosks playing it and I heard the song about how she used to love me. So I stood in the store and listened to it from beginning to end going: ‘Okaaaay.’”\n\nFacebook Twitter Pinterest Rossdale with Gwen Stefani. Photograph: Charbonneau/BEI/BEI/Shutterstock\n\nWhat did he think?\n\n“As a songwriter, I thought it was an interesting lyrical twist.” I assume he’s being evasive, but then I notice his eyes are filling up a bit: “It’s a lot,” he says. “Divorce is a lot.”\n\nWas it horrible to hear Stefani singing about it?\n\n“Well, I’m not sure what the parameters are,” he says, composing himself again. “It could only really be horrible, tragic or terrible, right? That’s the range. It never really moves into joy or satisfaction, does it?”\n\nIt might move into anger …\n\n“Oh, no. Because I live in a glass house in a glass room in a glass bed with a glass bathroom. So I don’t say anything about anyone. If she had to do that, if she needed to do it, that’s her perspective and everyone has that. It’s just that … look, it’s bad enough getting divorced, but getting divorced publicly from her was fucking next level. But what do I know? Here we are discussing this against the Oxo Tower, and London is beautiful, the sun is shining and it’s the worst thing if you think about suicide, because people pass, they die and they go, and yet life goes on …”\n\nI’m taken aback. Suicide?\n\n“Life is like waterskiing,” he continues – and I’m not sure either of us know where he’s going at this point – “in the sense that you’ve got to make sure you don’t let go of the rope. And I didn’t let go of the rope. But if one year ago you said I’d be doing this, and I’d have a record that I have and the support that I have … it’s been a dark time.”\n\nFacebook Twitter Pinterest Photograph: Graeme Robertson/The Guardian\n\nDid he consider suicide?\n\n“No, because I have children … but there were times when I 100% understood why people do it.”\n\nDespite not trusting journalists, Rossdale turns out to be good company – funny and full of statements suitably ludicrous for a pop star (“Was I tired yesterday? No, because I’m a fucking warrior and I will outlast anyone at anything”) yet vulnerable and far more self-aware than I’d anticipated (“It’s all you want to know, really, let’s face it,” he says after the barrage of questions about Stefani. “I mean, what’s the new record like? Yawn!”).\n\nI wonder if this more relaxed, honest version of Rossdale is one that not many people get to see. As we leave, he tells me that Stefani often didn’t want him opening up to the press, so he learned to stay guarded. But now he has a degree of freedom to do what he wants – he mentions on a couple of occasions about wanting to “become 3D”, so that people can go beyond the headlines and see who he really is: “And then be like … yeah, now I really don’t like him,” he laughs.\n\nAnd how would he feel if people still didn’t like him? Or if the Bush album doesn’t take off? If all this amounts to nothing in the end?\n\n“I just got divorced and I’m still alive,” he says. “So nothing can crush me. Nothing!”\n\nThe Voice UK is on Saturdays, 8pm, ITV", "images": ["https://i.guim.co.uk/img/media/b2a3d3e0830291beadf14323a07eddd6c6dab09e/122_0_1127_676/master/1127.jpg?width=300&quality=85&auto=format&fit=max&s=79405b35f321e1093188f985daa13cbd", "https://i.guim.co.uk/img/media/83a0084d583b0e264af2865946df0d8a47b9d8bd/823_0_4742_2845/master/4742.jpg?width=300&quality=85&auto=format&fit=max&s=c7277f5c23562e28c940651c249bdc93", "https://i.guim.co.uk/img/media/d4166c2c3e4f3dc11ef96a9f6c762451a8e5e7a7/0_227_1429_857/master/1429.jpg?width=300&quality=85&auto=format&fit=max&s=4b6fd228a9c5d7ad87a3e7624a67be2f", "https://i.guim.co.uk/img/media/3966a53dd654db3da1bf7b894ca7a344c778e17f/0_50_3703_2223/master/3703.jpg?width=300&quality=85&auto=format&fit=max&s=58398945e853251e157bc537ddbc3f55", "https://i.guim.co.uk/img/uploads/2017/10/09/Tim-Jonze,-L.png?width=300&quality=85&auto=format&fit=max&s=227ac2bee52a5fa87926df8146593c7d", "https://i.guim.co.uk/img/media/a18a231e45985ce7bcba1fbca3e2ebabd780eb50/0_0_5760_3456/master/5760.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=75aa52927cc7afe8e0dc3bf8c1a9c0ce", "https://i.guim.co.uk/img/media/8c5fc29b7a7733ecaf96c0719f5874e45da40dfc/2445_1130_5840_3504/master/5840.jpg?width=300&quality=85&auto=format&fit=max&s=665ccb81270939bb7bffb7e2b83abe63", "https://i.guim.co.uk/img/media/b1e9d5cfafa1e23f3b52419588ad1e62f7f6e0a9/238_194_2323_1393/master/2323.jpg?width=300&quality=85&auto=format&fit=max&s=a3a858cc35f5b68ae4679b4ed5f23013", "https://i.guim.co.uk/img/media/53f187f12da162d30e5d9f03347f4de07d600f91/0_429_2506_1503/master/2506.jpg?width=300&quality=85&auto=format&fit=max&s=c9e390d18c41a844530b807a8708342c", "http://phar.gu-web.net/count/pvg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Television%2CTelevision+%26+radio%2CCulture%2CThe+Voice%2CGwen+Stefani%2CIndie", "https://i.guim.co.uk/img/media/c0493a924e2cff8c1c556650bcc76bbf50a018ca/0_1219_3840_2304/master/3840.jpg?width=300&quality=85&auto=format&fit=max&s=757cd6d897bfd5d24aaba2c6250320c0", "http://phar.gu-web.net/count/pv.gif", "https://i.guim.co.uk/img/media/9a78344c24d0843c22387c610fed972dcd3e5b4c/0_1400_3840_2304/master/3840.jpg?width=300&quality=85&auto=format&fit=max&s=561d9be0bcf29e3e5bd02bfa23de3322", "https://i.guim.co.uk/img/media/a18a231e45985ce7bcba1fbca3e2ebabd780eb50/0_0_5760_3456/master/5760.jpg?width=300&quality=85&auto=format&fit=max&s=9c3a860ca84b8fe2778b8173aedb8ade"], "top_img": "https://i.guim.co.uk/img/media/a18a231e45985ce7bcba1fbca3e2ebabd780eb50/0_0_5760_3456/master/5760.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=75aa52927cc7afe8e0dc3bf8c1a9c0ce", "keywords": [], "authors": ["Tim Jonze"], "canonical_link": "https://www.theguardian.com/tv-and-radio/2017/jan/28/gavin-rossdale-the-voice-gwen-stefani", "title": "Gavin Rossdale: ‘If you divorce America's sweetheart, you're in trouble’", "meta_data": {"description": "Better known as Gwen Stefani’s ex than as a rock singer, he’s now trying his hand as a judge on The Voice UK. He discusses Marilyn, Bush and a private life in the public eye", "format-detection": "telephone=no", "HandheldFriendly": "True", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "apple-mobile-web-app-title": "Guardian", "application-name": "The Guardian", "msapplication-TileColor": "#052962", "theme-color": "#052962", "msapplication-TileImage": "https://assets.guim.co.uk/images/favicons/023dafadbf5ef53e0865e4baaaa32b3b/windows_tile_144_b.png", "author": "Tim Jonze", "thumbnail": "https://i.guim.co.uk/img/media/a18a231e45985ce7bcba1fbca3e2ebabd780eb50/0_0_5760_3456/master/5760.jpg?width=620&quality=85&auto=format&fit=max&s=097a6ef78fac702f874d41c13294a5e6", "keywords": "Television,Television & radio,Culture,The Voice,Gwen Stefani,Indie", "news_keywords": "Television,Television & radio,Culture,The Voice,Gwen Stefani,Indie", "og": {"url": "http://www.theguardian.com/tv-and-radio/2017/jan/28/gavin-rossdale-the-voice-gwen-stefani", "image": "https://i.guim.co.uk/img/media/a18a231e45985ce7bcba1fbca3e2ebabd780eb50/0_0_5760_3456/master/5760.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=75aa52927cc7afe8e0dc3bf8c1a9c0ce", "description": "Better known as Gwen Stefani’s ex than as a rock singer, he’s now trying his hand as a judge on The Voice UK. He discusses Marilyn, Bush and a private life in the public eye", "type": "article", "title": "Gavin Rossdale: ‘If you divorce America's sweetheart, you're in trouble’", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/timjonze", "publisher": "https://www.facebook.com/theguardian", "section": "Television & radio", "published_time": "2017-01-28T06:00:47.000Z", "tag": "Television,Television & radio,Culture,The Voice,Gwen Stefani,Indie", "modified_time": "2018-02-22T11:20:32.000Z"}, "al": {"ios": {"url": "gnmguardian://tv-and-radio/2017/jan/28/gavin-rossdale-the-voice-gwen-stefani?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287, "pages": 516977308337360}, "twitter": {"app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"ipad": "gnmguardian://tv-and-radio/2017/jan/28/gavin-rossdale-the-voice-gwen-stefani?contenttype=Article&source=twitter", "googleplay": "guardian://www.theguardian.com/tv-and-radio/2017/jan/28/gavin-rossdale-the-voice-gwen-stefani", "iphone": "gnmguardian://tv-and-radio/2017/jan/28/gavin-rossdale-the-voice-gwen-stefani?contenttype=Article&source=twitter"}}, "image": "https://i.guim.co.uk/img/media/a18a231e45985ce7bcba1fbca3e2ebabd780eb50/0_0_5760_3456/master/5760.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=1b3f6f0efc5e93407fc3bd167e82e591", "site": "@guardian", "card": "summary_large_image", "creator": "@timjonze", "dnt": "on"}, "robots": "max-image-preview:large"}, "movies": ["https://www.youtube-nocookie.com/embed/9FI63lu5i_E?wmode=opaque&feature=oembed"], "publish_date": 1485532800.0, "source": "http://www.theguardian.com", "summary": ""}