{"url": "https://www.cosmopolitan.com/sex-love/a22131627/why-justin-doesnt-follow-hailey-on-instagram/", "text": "The Internet went wild for Justin Bieber's engagement to Hailey Baldwin—and equally as wild when people realized he doesn't even follow his fiancée back on Instagram.\n\nThe idea of a partner NOT following you back is suspect by nature: Do they not care about your life? Are they trying to hide that they're actually dating you? Did they really just forget, which honestly is more insulting than the other two?\n\nAlas, social media isn't always a solid barometer for relationship health—and besides, when it comes to celebs, they don't exactly use Instagram the way we do. Here are three very solid explanations for why Biebz wouldn't follow the woman he's going to marry on Insta:\n\n1. He just wants a little more privacy.\n\nThe one recent comment Justin left on Hailey's account became a news item (and he didn't even go to Pete Davidson-lengths in his PDA). If he actually followed her and commented more often, his relationship would be even more public.\n\n\"We should empathize with the high intensity spotlight that shines on celebs,\" says Dr. Suzanne Degges-White, chair and professor of counseling and counselor education at Northern Illinois University. \"If most of us felt that every tweet or public appearance we made was going to be picked apart by strangers, we might want to lay low, too!\"\n\n\n\nHailey also had mentioned that the last time they dated, she felt like it was too much of a high-profile relationship. This also was, coincidentally, when they both posted a lot more of themselves as a couple on social media.\n\n2. He's been afraid to jinx his relationship with Hailey, which is still new.\n\nLet's face it: Justin and Hailey's engagement is shocking, because they haven't really been dating for that long (and weren't in a long-term relationship the last time, either). Justin only posted the one photo only after his proposal was all over the news, which may mean that he's reluctant to go too hard on the Insta PDA right now. The lack of a follow-back could just be a habit of, \"We just started dating, and I don't want to over-commit on social media.\"\n\n\"As for the fear of 'jinxing' a relationship, that might be reflected in [his] hesitation to intermingle [their lives], including [in] social media posts,\" Dr. Degges-White says. \"It’s always a pain to have to cope with trying to edit or delete past public posts.\" Especially if, you know, you're a celebrity whose photos and captions would be screenshotted within seconds.\n\n\n\n3. He actually feels confident about the relationship.\n\nThe irony is that Justin Bieber being nonchalant about following his partner on social media might demonstrate that he's actually feeling pretty good about where he stands with Hailey.\n\n\"Research actually tells us that couples who frequently post pictures together use it perhaps as a mechanism to mask their insecurities in the relationship, depending on their attachment style,\" says Dr. Mariana Bockarova, Ph.D., who teaches the course \"Psychology of Relationships\" at the University of Toronto.\n\n\"If you were an anxiously attached person, who often feels worried about your partner leaving you, you might increase your relationship visibility and be more likely to post photos together to solidify your relationship together in the public sphere.\"\n\nJustin may forego hitting that \"follow\" button for one simple reason: He feels secure in his attachment to Hailey and doesn't need to keep tabs on her, or prove to anyone else that he's keeping tabs on her. Romantic vacations will do just fine.\n\n4. He's Justin Bieber. Does he look like he cares?\n\nThis is the theory ~I~ personally believe the most. I mean, this is a man who strolls the streets of NYC in hotel slippers. He also recently skipped out on a bunch of award shows—regardless of how many times he was nominated—so he could keep working on his album.\n\nAll to say, Justin Bieber has spent a long chunk of his life in the spotlight. And, if his recent behavior indicates anything, it's that he's starting to care a bit less about what people think of him, especially on social media. So what if he doesn't follow Hailey? He's not thinking about whether you care. Maybe he especially won't follow her back now just to assert his independence over what everyone expects him to do.\n\n\"Without knowing Justin or Hailey, it may just be a matter of social media not being important to their personal lives,\" Dr. Bockarova says. She also adds that caring a lot about how your partner interacts with you on social media, whether they like all your photos or post enough selfies with you, might be a problem. \"If you are feeling the need to compare yourself to others, which might include comparing your partner with others, there's much more at stake than just a healthy relationship.\"\n\n\"The 'virtual world' is still just virtual—we can attribute all sorts of nefarious motivations or perceived signs into others’ behavior,\" Dr. Degges-White says. \"But when it comes down to it, what really matters is how two people treat each other when no one is watching.\"\n\nIs Justin Bieber a good partner to Hailey? Time will tell, and the only person who knows that is her—not anyone checking his profile to see if he's following her back yet.\n\n\n\nFollow Julia on Twitter.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/selena-justin-comp-1531398226.jpg?crop=1xw:1xh;center,top&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2018-07-12-at-4-38-41-pm-1531427947.png?crop=1.00xw:0.505xh;0,0.0871xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hailey-justin-signs-1531192334.jpg?crop=1xw:1xh;center,top&resize=300:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2018-07-12-at-4-38-41-pm-1531427947.png?crop=1.00xw:0.505xh;0,0.0871xh&resize=1200:*", "keywords": [], "authors": ["Julia Pugachevsky", "Sex", "Relationships Editor", "I'M A Sex", "Relationships Editor For Cosmo'S Snapchat Discover", "Which You Should Definitely Subscribe To"], "canonical_link": "https://www.cosmopolitan.com/sex-love/a22131627/why-justin-doesnt-follow-hailey-on-instagram/", "title": "All the Possible Reasons Justin Isn't Following Hailey on Instagram", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "All the Possible Reasons Justin Isn't Following Hailey on Instagram", "description": "Is it too late for him to say sorry???", "url": "https://www.cosmopolitan.com/sex-love/a22131627/why-justin-doesnt-follow-hailey-on-instagram/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2018-07-12-at-4-38-41-pm-1531427947.png?crop=1.00xw:0.505xh;0,0.0871xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2018-07-12 10:06:34", "published_time": "2018-07-12 09:14:00", "section": "Sex & Relationships", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2018-07-12-at-4-38-41-pm-1531427947.png?crop=1.00xw:0.505xh;0,0.0871xh&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Why Justin Won't Follow Hailey on Instagram - Justin Bieber Hailey Baldwin Instagram", "description": "Is it too late for him to say sorry???", "keywords": "justin bieber, hailey baldwin, instagram, engaged, engagement, follow back, social media, justin bieber hailey baldwin", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2018-07-12-at-4-38-41-pm-1531427947.png?crop=0.995xw:1.00xh;0.00321xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Sex & Relationships,sex-love", "sailthru.date": "2018-07-12T21:14:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2018-07-12-at-4-38-41-pm-1531427947.png?crop=1.00xw:0.505xh;0,0.0871xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2018-07-12-at-4-38-41-pm-1531427947.png?crop=0.995xw:1.00xh;0.00321xw,0", "sailthru.socialtitle": "All the Possible Reasons Justin Isn't Following Hailey on Instagram", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1531358040.0, "source": "https://www.cosmopolitan.com", "summary": ""}