{"url": "https://www.bustle.com/p/benedict-cumberbatch-saved-a-delivery-person-from-being-mugged-in-a-true-superhero-move-9275390", "text": "When you've spent years portraying both a famed detective and a comic book superhero onscreen, you seem to learn a thing or two about leaping to action to fend off bad guys. The was the case when Benedict Cumberbatch saved a delivery cyclist from muggers, as reported by UK newspaper The Sun on Saturday, June 2.\n\nThe British actor — who has starred as both Sherlock Holmes in BBC's crime drama Sherlock and Doctor Strange in several Marvel films (most recently, this year's hit Avengers: Infinity War) — was reportedly in an Uber with wife Sophie Hunter in London last November when he spotted four men attacking a food delivery cyclist, according to Reuters..\n\n“One of the males attempted to grab the victim’s cycle ... He was then punched in the face, struck on the head and hit with his helmet,” the Metropolitan Police confirmed to Reuters in a statement.\n\nSpeaking to The Sun, the actor's Uber driver, Manuel Dias, further detailed the incident, which ironically took place near Sherlock Holmes fictional residence at 221B Baker Street, saying that the actor leapt from the car and shouted “leave him alone,” before dragging the men off of the victim.\n\nDias, who claimed he wasn't aware of the actor's identity at first, says he joined Cumberbatch in defending the delivery man from the attackers, who ultimately fled the scene: “It was only then I recognized Benedict. Then it all got a bit surreal. Here was Sherlock Holmes fighting off four attackers just round the corner from Baker Street.\"\n\nDavid Livingston/Getty Images Entertainment/Getty Images\n\nAccording to Reuters, the police said that no arrests have been made, but, fortunately, nothing was stolen and the victim did not require hospital treatment.\n\nStill, the driver had nothing but praise for the passenger he said he was taking to a London club that night. “The cyclist was lucky, Benedict’s a superhero,” he added. “Benedict was courageous, brave and selfless. If he hadn’t stepped in the cyclist could have been seriously injured.”\n\nIn a stroke of pure modesty, the highly respected star, who's currently playing the title character in Showtime's drama miniseries Patrick Melrose, saw things a little bit differently though, insisting his actions weren't extraordinary. “I did it out of, well, I had to, you know ,” Cumberbatch told The Sun. You know, in case his fans weren't already swooning a ton.\n\nThe company that employed the cyclist, Deliveroo, tweeted their thanks to the father of two. \"Thank you Benedict Cumberbatch for your brave actions,\" the restaurant delivery service posted on their official account June 2. Deliveroo riders are heroes - their safety is our priority and any violence against them is totally unacceptable. So on behalf of everyone at deliveroo: thank you,\"\n\nMany other fans took to Twitter to praise Cumberbatch, noting how swoon-worthy his heroics truly were.\n\nYet others weren't exactly surprised that the Oscar nominee \"fought off some muggers\" because what can't Cumberbatch do, after all?\n\nAnother user pointed out how surreal the situation must have been for the cyclist: \"Can you imagine ... you look up and Benedict Cumberbatch has come to your rescue?\"\n\nSuggesting the muggers clearly weren't aware of his abilities, one tweeter added that it was a stupid idea for the muggers to attempt to commit a crime when \"Sherlock Holmes\" was nearby.\n\nAnother fan boldly suggested that the valiant \"#heroofthepeople\" be dubbed \"patron saint of cyclists.\"\n\nFinally, one satirical account joked that \"94% of Britons\" are considering a career change in hopes of also being rescued by the star. (Wait, what about the other 6%?)\n\nWhether he considers his brave actions to be praiseworthy or not, many agree that Cumberbatch is living proof that not all superheros wear capes — well, not when they're not working anyway.", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/1/96fb3bb8-267e-4bc6-bb1b-c18c1dce2f0f-getty-1205320565.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/6/2/27cab8fa-79e8-400f-a7db-db3bfdb3deb9-getty-951357186.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/8/2fb229f6-96f6-4740-8129-16ea777d54b0-getty-1205199899.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/13/997344fe-abd7-491d-8a56-6a90e03842d5-getty-1200661159.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2018/6/2/51bc3417-225f-42b8-abb6-8717b371d828-getty-950878664.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/6/2/51bc3417-225f-42b8-abb6-8717b371d828-getty-950878664.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/10/14a8d2bf-6a64-40cc-a104-034fe33752a4-getty-1188778598.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/6/2/51bc3417-225f-42b8-abb6-8717b371d828-getty-950878664.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/benedict-cumberbatch-saved-a-delivery-person-from-being-mugged-in-a-true-superhero-move-9275390", "title": "Benedict Cumberbatch Saved A Delivery Person From Being Mugged In A True Superhero Move", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/benedict-cumberbatch-saved-a-delivery-person-from-being-mugged-in-a-true-superhero-move-9275390", "type": "article", "title": "Benedict Cumberbatch Saved A Delivery Person From Being Mugged Like A True Superhero", "description": "When you've spent years portraying both a famed detective and a comic book superhero onscreen, you seem to learn a thing or two about leaping to action to fend off bad guys. The was the case when  Benedict Cumberbatch saved a delivery cyclist from…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/6/2/51bc3417-225f-42b8-abb6-8717b371d828-getty-950878664.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "When you've spent years portraying both a famed detective and a comic book superhero onscreen, you seem to learn a thing or two about leaping to action to fend off bad guys. The was the case when  Benedict Cumberbatch saved a delivery cyclist from…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}