{"url": "http://transcripts.cnn.com/TRANSCRIPTS/1207/08/sotu.01.html", "text": "\n\n\n\nReturn to Transcripts main page\n\nSTATE OF THE UNION WITH CANDY CROWLEY\n\nInterview with Mitch McConnell; Interview with Robert Gibbs\n\nAired July 8, 2012 - 09:00 ET\n\nTHIS IS A RUSH TRANSCRIPT. THIS COPY MAY NOT BE IN ITS FINAL FORM AND MAY BE UPDATED.\n\n\n\nCANDY CROWLEY, CNN ANCHOR: June disappoints with weak job numbers. Today, unemployment and the presidential race.\n\n\n\n(BEGIN VIDEOTAPE)\n\n\n\nBARACK OBAMA, PRESIDENT OF THE UNITED STATES: But it is still tough out there.\n\n\n\nFORMER GOV. MITT ROMNEY, R-MASS., PRESIDENTIAL CANDIDATE: This kick in the gut has got to end.\n\n\n\nCROWLEY: Exclusive interviews with Senate Republican leader Mitch McConnell and Obama campaign senior adviser Robert Gibbs. Then the numbers and the politics of a sputtering economy with economist Douglas Holtz-Eakin, Mark Zandi, and CNN senior congressional correspondent, Dana Bash.\n\n\n\nBILL BRADLEY, FORMER DEMOCRATIC SENATOR: If we are going to succeed, we have to face our problems squarely.\n\n\n\nFormer Democratic senator Bill Bradley on how to fix a broken Washington and what we can all do better. I'm Candy Crowley and this is STATE OF THE UNION.\n\n\n\n(END VIDEOTAPE)\n\n\n\nCROWLEY: Not the best of weeks for the Romney campaign. It was already under fire from friendly sources as not ready for prime time when a senior adviser said that ObamaCare is fine, for not buying insurance is not a penalty, not a tax. A big oops in political world because Republicans have used the Supreme Court decision to argue that ObamaCare is a tax hike on the middle class. Reset.\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nROMNEY: The Supreme Court has the final word, right? Is it the highest court in the land? They said it was a tax, didn't they?\n\n\n\nUNIDENTIFIED FEMALE: So what do you --\n\n\n\nROMNEY: It's a tax. Of course, you --\n\n\n\nCROWLEY: Too late for the conservative \"Wall Street Journal,\" which blistered the Romney campaign for looking confused and politically dumb. \"Mr. Romney,\" it read, \"promised Republicans he was the best man to make the case against President Obama, whom they desperately want to defeat. So far, Mr. Romney is letting them down.\"\n\n\n\nJoining me is Senate Republican leader Mitch McConnell. There are few people in Washington with a larger stake in seeing that Mitt Romney does well than you do, because you would like to go from minority leader in the Senate to majority. How do you think he has been doing? MCCONNELL: Well, the race is very, very close. I mean I think the best evidence of that is a Gallup tracking poll that has had it consistently very close. People are unhappy with the economy. They know that Mitt Romney is a job creator and I think he has got a great chance of being elected.\n\n\n\nCROWLEY: But his campaign, as you know, has come under fire from Republicans, first as being not ready for prime time, as we said, that he needs a steady, sort of more national hand in this.\n\n\n\nDo you have any complaints, first of all, about how they handled this whole Supreme Court tax issue, which is a major issue for you all?\n\n\n\nMCCONNELL: Well, I think a better use of my time is to criticize the guys we are running against. I'm not here to critique the Romney campaign. I do think that we've got plenty to run against. The president has got a very, very poor record. That is why he does not want to talk about it.\n\n\n\nI mean, take Friday's job figure, for example. You can go back two years ago and the job figure was better and the president said we are turning the -- we are turning it around. You know, clearly what they are doing is not working. And I think that is what this campaign needs to be about.\n\n\n\nCROWLEY: And yet, we did look at the figures for this year, and you know that there were great advances in job creation in the first quarter. It's been minimal in the second quarter.\n\n\n\nNonetheless, still job creation. When you average out the first six months, it is something like 125,000-130,000 jobs have been created on average. That's not too bad considering where we came from, is it?\n\n\n\nMCCONNELL: It is terrible. We have got 41 straight months now of unemployment above 8 percent, 41 straight months. Candy, this is the most tepid recovery -- if it is a recovery -- from a deep recession in American history.\n\n\n\nThe economy is just sputtering along and the reason for that, in my judgment, is because of what the administration chose to do: spend, borrow, pass this new ObamaCare law with its penalty tax in it, its mandate tax. All of this is slowing the economy down.\n\n\n\nCROWLEY: Let me ask you about the president's jobs plan that was introduced last September, I think. And something -- this is what he is saying on the campaign trail. This was in Columbus, Ohio, in an interview with WBNS.\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nOBAMA: -- making sure that we're rebuilding the infrastructure, our roads, our bridges, our runways, all those things that could put construction workers back to work right now and would lift the entire economy and then, as I said, refocusing on manufacturing. That's the recipe for growth over the long term.\n\n\n\n(END VIDEO CLIP)\n\n\n\nCROWLEY: So what's wrong with any of that? Shouldn't Congress, at this point, be saying the American people want this economy to be better? Isn't it incumbent on you all to find something you can agree on in the long list of things the president put in that jobs package and move it forward?\n\n\n\nMCCONNELL: Well, we just passed a transportation bill, so we were addressing an issue that we had broad agreement on, that transportation is important to our economy.\n\n\n\nBut look, the way we're going to get the private sector going again is to change the way the government is treating the private sector. Things like ObamaCare, things like overregulation are causing companies not to hire. And we have got the fiscal cliff coming at the end of the year.\n\n\n\nYou know, what we ought to be doing is extend the current tax rates for another year with a hard requirement to get through comprehensive tax reform one more time. I negotiated with Vice President Biden the two-year extension of the current tax rates that we're in right now.\n\n\n\nThe president signed it because he argued that to let taxes going up would make the economy worse. We have a slower growth rate today than we had then. That would settle at least part of the problem.\n\n\n\nCROWLEY: Let me ask you though, because they are doing nothing because you all are at odds over what you should do, is in fact, a lot of people argue, slowing the growth of the economy here in the U.S. and adding to the jobless rate, which is pretty tepid.\n\n\n\nI want to play you something from the managing director of the IMF.\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nCHRISTINE LAGARDE, MANAGING DIRECTOR, IMF: The threat, only the threat of the delay in raising the debt ceiling and of the fiscal cliff could weaken growth already later this year, and should they materialize because no agreement can be reached, the domestic effects would be severe with negative spillovers to the rest of the world.\n\n\n\n(END VIDEO CLIP)\n\n\n\nCROWLEY: So basically IMF is saying if you don't come off this fiscal cliff -- and by you, I mean Congress -- it is going to add to the uncertainty. There are certain things -- ObamaCare, you've mentioned it; regulations, that's fine.\n\n\n\nYou're not going to the Democrats to agree on it, but something that Congress could do is something about this oncoming train, which everyone sees coming, and yet there's no action. MCCONNELL: Well, what we could do and is what the House is going to do this week, I believe, is go ahead and extend the current tax rates for another year. That deals with part of the fiscal cliff.\n\n\n\n(CROSSTALK)\n\n\n\nCROWLEY: The president said he would veto that, so --\n\n\n\nMCCONNELL: The president shouldn't veto that. This is the same president who signed the very same thing two years ago with the argument --\n\n\n\nCROWLEY: I understand.\n\n\n\nMCCONNELL: -- to do otherwise would make the economy worse.\n\n\n\nCROWLEY: Yes.\n\n\n\nMCCONNELL: I mean, look, the principal reason that we're having this economic trough is what the government is doing to the private sector. Now the president keeps talking about public sector employees.\n\n\n\nUnemployment in the public sector is 4.2 percent. We've got to get the private sector going. That is only the way you have job growth, which creates revenue for the government. Everything this administration has done, Candy, has taken us in the wrong direction.\n\n\n\nCROWLEY: But they would argue that the stimulus plan and other things they've done since and investing in infrastructure, getting construction jobs going, hiring the teachers, policemen, that that has kept this economy from being even worse over a longer period of time.\n\n\n\nAnd I think, you know, again, we are seeing the same arguments we have seen now --\n\n\n\nMCCONNELL: Yes, I know.\n\n\n\nCROWLEY: -- for a year and a half. And I sense out there in the country -- and now we're seeing from the IMF -- that what is really worrying people is that you do nothing. It is almost not the something that you do, it is that you look up to Capitol Hill for some sort of guidance. When was the last time that you sat down with the Senate majority leader and said. how can we do this?\n\n\n\nMCCONNELL: We have passed 11 different things the president has asked us to pass in the last six months. That is not the point.\n\n\n\nThe point is this: for two years the administration was able to do everything they wanted to. They borrowed. They spent. They had the government take over American health care. That's all in place, and the question the American people should be asking is how is that working?\n\n\n\nNow the president would like to do more of the same. We don't think that makes sense. Why don't we try doing things that get the private sector -- which is the only way we're going to ever (inaudible) going again.\n\n\n\nCROWLEY: We don't try, because you are in the minority and not a majority in the Senate, and yet the minority in the Senate can stop things, so, you know, the fact of the matter is don't you and Senator Reid need to sit down and say, here is how we can help the economy? Here's what we can agree on? Have you all done that?\n\n\n\nMCCONNELL: We have, as I just indicated, passed a number of things the president's asked for.\n\n\n\nCROWLEY: Have you sat down with senator Reid looking forward?\n\n\n\n(CROSSTALK)\n\n\n\nMCCONNELL: Sure. We -- every day we talk about the way forward and we have passed a number of pieces of legislation that are important and are helpful. But the primary problem is the president would like for us to keep doing more of what he was able to do the first two years when he had total control of Congress.\n\n\n\nThe American people have looked at the results of that. It clearly has not worked.\n\n\n\nCROWLEY: Let me turn you to the Senate race races that are out there. Sitting here today and looking at the landscape, do you believe you will be the majority leader next year?\n\n\n\nMCCONNELL: 50-50. I think it is going to be a very close, competitive election. There are a number of places where we have opportunities for pickups, not many places where we have much chance of losing a seat. I think at the end of the day, we will have a very narrow Senate one way or the other.\n\n\n\nCROWLEY: And looking at the Virginia race and the Massachusetts race?\n\n\n\nMCCONNELL: Two close races. Good candidates --\n\n\n\n(CROSSTALK)\n\n\n\nCROWLEY: You could lose as easily as you could win?\n\n\n\nMCCONNELL: I'm sorry?\n\n\n\nCROWLEY: You could lose as easily as you could win?\n\n\n\nMCCONNELL: Well, they are close races. We expect to win them both, but they are close races. CROWLEY: And as you look at the Supreme Court decision over the past week and the reaction to it, and you read, I'm assuming Justice Roberts', Chief Justice Roberts' opinion on that -- are you sorry you voted for him?\n\n\n\nMCCONNELL: No, I'm not, but I was extremely disappointed. The chief justice, however, did make it clear that the mandate is a tax, and if I may make an observation about that, Candy, you know, the mandate tax, 77 percent of it will be levied on people making $120,000 and less. And interestingly enough, that produces more tax revenue for the government than the so-called Buffett tax which the president tried to get us to pass to raise taxes on high income people.\n\n\n\nCROWLEY: And yet there is 330 million-plus population in the U.S. or around in there, we are talking about maybe about 3 million people, at least according to the CBO, how this would -- I mean the congressional folks, according to them, this would affect maybe 3 million people. That is not that much to get 30 million people covered, is it?\n\n\n\nMCCONNELL: Well, look, the question is the law in its entirety. The president said it would not raise taxes. It is raising taxes.\n\n\n\nCROWLEY: On very few people, though, you would concede that.\n\n\n\nMCCONNELL: Well, it is important to those people, and they are middle-income people. More tax revenue raised from middle-income people than the Buffett tax would raise from high-income people from a president who promised not to raise taxes on anyone. It is also driving premiums up. The cost of health care is going up. It cut Medicare by half a trillion dollars over the next ten years. Nothing that was said in connection with passing this health care bill is working out.\n\n\n\nCROWLEY: Senator, I want you thank you for joining us this morning. I hope you will come back.\n\n\n\nMCCONNELL: I will.\n\n\n\nCROWLEY: Jobs and the president's plan for winning the battleground states with Obama campaign senior adviser Robert Gibbs when we come back.\n\n\n\n(COMMERCIAL BREAK)\n\n\n\nCROWLEY: I'm joined by Obama campaign senior adviser Robert Gibbs. Good to see you, Robert.\n\n\n\nI want to run you through a series of economic figures and polls, and then get your comment at the end. First of all, when you ask folks what are economic conditions like today -- good, 27 percent. Poor, 73 percent. When you say, how important is the economy to your vote? 92 percent say it is either very or extremely important to their vote.\n\n\n\nGIBBS: Who are the other 8 percent? CROWLEY: Exactly. To their vote. And then finally, who would better handle the economy. Romney 48 percent, Obama 47 percent. If the economy is doing better, as the president argues, not as good as you want but better, why are those numbers like that?\n\n\n\nGIBBS: Well, look, I think we are coming out of the hardest economic time in our country's history. CROWLEY: Which we have been doing for four years.\n\n\n\nGIBBS: We have been, and typically when you come out of the recession, the depths that we were in, that's caused by a financial crisis, which is what happened, it takes a while to dig out of that hole. We saw on Friday that our economy is growing and we are adding jobs. The president believes that --\n\n\n\nCROWLEY: Not enough jobs.\n\n\n\nGIBBS: We are not growing fast enough and we're not adding enough jobs.\n\n\n\nCROWLEY: So what is the argument to, like, after four years, what is then the argument that re-elect me?\n\n\n\nGIBBS: Well, Candy, we have made progress, but we have got a long way to go, and this is going to be an election about two different visions. You heard part of it here just a minute ago with Senator McConnell and you hear it with Mitt Romney every day. The best way to create jobs is to provide millionaires and billionaires with greater tax cuts, take financial regulations off of things like banks and Wall Street, and somehow we will see jobs flourish for years and years to come. The problem with that is that it is not a theory. We tried it for eight years, and it ended in this huge economic calamity and this financial mess.\n\n\n\nCROWLEY: But the jobs are not flourishing now, and folks don't actually seem to think that the president would handle it better than Mitt Romney, so I'm just trying to figure out what the sales pitch is here.\n\n\n\nGIBBS: Well, the other vision is that we have to grow this economy like we did for years and years and decades from the middle- class out. Let's continue to add opportunity, let's bring this American dream back, let's guarantee that if you work hard and play by the rules, you will have a chance to get ahead, that your children will have a chance to get ahead. And again, we have tried these different philosophies before. We know what tax breaks and tax cuts for the wealthy and financial regulations off of Wall Street mean. They mean economic calamity, they mean what we are dealing with now, versus a vision where we add jobs and build out of the middle-class. People take responsibility, they work hard, but they get ahead. And that is what we need to do.\n\n\n\nCROWLEY: I think, you know, even the Republicans would, you know, that you think have this different version, would say, we want to grow the middle-class, that is where our aim is.\n\n\n\nGIBBS: That is not their primary aim. Their primary aim is to give tax breaks to the very wealthy.\n\n\n\nCROWLEY: That is what you think their primary aim is, but --\n\n\n\nGIBBS: Let's look at the central plank in Mitt Romney's so- called economic plan. And granted, this is -- most of his economic plans and most of his plans are secret, but the one thing that he has fleshed out is to take the Bush tax cuts, which disproportionately impact millionaires and billionaires, and add to them. Candy, do you think we are a Bush tax away for a millionaire away from a flourishing economy? Or should we protect and keep taxes low for middle-class families and give them a chance?\n\n\n\nCROWLEY: Do you think the president will do anything other than veto a bill that would keep those Bush tax cuts for everyone intact?\n\n\n\nGIBBS: We should protect the tax cuts for the middle-class, and we should let tax cuts for millionaires and billionaires expire.\n\n\n\nCROWLEY: Even though recovery is not that great, and people say don't take money out of this economy, it is not the time for a tax hike, you would go ahead and do it for those making $250,000 and above.\n\n\n\nGIBBS: We ought to do something about this deficit, and we ought to protect middle class tax cuts, and the best way to do that is to let the upper-end tax cuts expire, let the wealthy in this country that had been doing fine for years and years and years begin to pay their fair share, and make sure that we protect the tax rate that middle-class families have had for the past many years.\n\n\n\nCROWLEY: So the president is totally committed to getting rid of the tax cut for those making $250,000 and above.\n\n\n\nGIBBS: Let's make some progress on our spending by doing away with tax cuts for people who quite frankly don't need them, tax cuts that have not worked, and have them pay their fair share.\n\n\n\nCROWLEY: So is that a yes or a no? The president is completely committed to this, he won't allow it to happen?\n\n\n\nGIBBS: He is 100 percent committed to it.\n\n\n\nCROWLEY: OK. I want to play an ad that you all have been running, and then ask you about it.\n\n\n\nOr not.\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nUNIDENTIFIED MALE: Mitt Romney campaigned as a job creator.\n\n\n\nROMNEY: I know how jobs are created.\n\n\n\nUNIDENTIFIED MALE: But as a corporate raider, he shipped jobs to China and Mexico. As a governor, he did the same thing, outsourcing state jobs to India. Now he is making the exact same pitch. ROMNEY: I know why the jobs come and why they go.\n\n\n\nUNIDENTIFIED MALE: Outsourcing jobs, Romney economics, it didn't work then and it won't work now.\n\n\n\n(END VIDEOTAPE)\n\n\n\nCROWLEY: You all have invested very heavily in the Bain Capital element of trying to convince people of what Mitt Romney is about. And yet, this particular ad got four pinocchios from the Washington Post, which is not true. And this is what Factcheck.org had to say. \"We found no evidence to support the claim that Romney, while he was still running Bain Capital, shipped American jobs overseas.\" You now have a similar ad out. Why do you keep with that?\n\n\n\nGIBBS: Well, I've got to say factcheck.org ought to read the Washington Post, which is the one that came up with a report that said looking at SEC filings that Mitt Romney and Bain Capital were pioneers in outsourcing. They shipped jobs all over the world that could and should have been--\n\n\n\nCROWLEY: You say that Romney was, but the point, their point is that in fact, Mitt Romney was not running Bain. He had cut ties and gone off.\n\n\n\nGIBBS: That also is not true, because Mitt Romney was the head and sole owner of Bain longer than Mitt Romney has admitted to being the sole owner of Bain.\n\n\n\nBut let's understand this, because we saw this a little bit again this week. We have got a guy who believes and has been a pioneer in outsourcing jobs, and quite frankly, he offshores most of his own personal investments, presumably to shield them from taxes.\n\n\n\nCandy, I don't know about you, I pick a bank because there is an ATM near my home, right? Mitt Romney has a bank account in Switzerland. He's got a shell company--\n\n\n\nCROWLEY: Nothing illegal, right? You are not charging that he has done anything illegal with any of this? GIBBS: Candy, nobody knows why he has a corporation in Bermuda, why he failed to disclose that on seven different financial disclosures, why he transferred it to somebody else's purview the day before he became governor of Massachusetts. The one thing he can do, Candy, to clear up whether or not he's done anything illegal, whether he's shielding his income from taxes in Bermuda or Switzerland, is to do what every other presidential candidate has done, and that is release a series of years of their own tax returns. Mitt Romney's father was the pioneer for releasing a series of tax returns. The best way to figure out if Mitt Romney is complying with American tax law is to have him release more of his tax returns.\n\n\n\nThis is a guy whose slogan is believe in America, and it should be business in Bermuda, that is what Mitt Romney is all about.\n\n\n\nCROWLEY: Which is a great line, but again, there is no evidence here that any of the fact check organizations have found that A, he outsourced jobs, or was president of Bain when it happened, and B, that he has done anything illegal. You have had a lot of advice from folks, Democrats saying get off of this particular Bain thing. There is obviously some polling that shows in fact it's having some effect in some of the battleground states, but why--\n\n\n\nGIBBS: Again, this is an ad that's based on a report that the Washington Post did. OK? So I would encourage everyone go to Washingtonpost.com and read that report. The reason that we'll keep talking about this is, this is important. Are we going to create jobs here in America, we're going to bring them back from overseas, we're going to do away with tax breaks for companies that ship jobs overseas, or are we going to invest in manufacturing here in this country? You know, we have created half a million manufacturing jobs. More manufacturing jobs have been created in the last few years than since the mid-90s. Mitt Romney famously said we ought to let Detroit and the auto industry go bankrupt. Again, I go back to two very different visions about this economy.\n\n\n\nCROWLEY: Right. I have to end it there, I'm sorry, I hope you come back. Robert Gibbs, senior adviser to the Obama campaign. Thanks.\n\n\n\nGIBBS: Thank you.\n\n\n\nCROWLEY: Four more jobs reports before the election, the problems and the solutions when we come back.\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nROMNEY: The president's policies have not gotten America working again.\n\n\n\nOBAMA: Businesses have created 4.4 million new jobs over the past 28 months.\n\n\n\n(END VIDEO CLIP)\n\n\n\n(COMMERCIAL BREAK) CROWLEY: With me now, Mark Zandi, chief economist of Moody's Analytics, former Congressional Budget Office Director Douglas Holtz- Eakin, and CNN senior congressional correspondent Dana Bash. So let's just straighten out this economy thing. And have you all tell me, A, what was the most worrisome thing in the economic report we got, the jobless report, and what makes you think, OK, we can still survive this. Let's start with you.\n\n\n\nZANDI: Well, 80,000 jobs is pretty disappointing. If we stick at 80,000, if that is the reality of what is going on, then unemployment is going to rise, and we have an 8.2 percent unemployment rate, and that is a problem. So that is the most worrisome aspect of the report.\n\n\n\nBut there were some positives -- hours worked increased. That's a good leading indicator. Businesses will ask workers to work longer hours before they hire. And we did see--\n\n\n\nCROWLEY: So that is a precursor to new jobs.\n\n\n\nZANDI: It is.\n\n\n\nCROWLEY: Sometimes.\n\n\n\nZANDI: Generally is. And hours worked were actually at a pretty high level, so any pickup of activity will probably translate into more jobs, and we got a big increase in wages, which was encouraging. I had been nervous that wage growth had been slowing, but that does not appear to be the case. It is pretty solid.\n\n\n\nCROWLEY: Douglas, what do you think?\n\n\n\nHOLTZ-EAKIN: Well, those points are right. One of the real disappointing characteristics of this recovery has been not just the jobs, but the lack of income growth, and that has hurt the ability of households to spend, and to see some strength in wages was a very important part of this report.\n\n\n\nI think the really troubling issue is that this report came on the heels of some other reports that showed manufacturing slowing, the service sector slowing, and to the extent that employment is a lagging sort of indicator, that we could have further trouble down the road. And I'm worried about the outlook for that reason.\n\n\n\nCROWLEY: I tried to get Robert Gibbs to tell us how the president plays this at this point, because I think people look and think, we just thought we'd be so much further along. How do the Romney folks play this, and is there any sign that it is working, and what can the president do?\n\n\n\nBASH: Well, the Romney folks, what they think their message is going to be going forward isn't so much the Reagan, are you better off now than you were four years ago? It's what we all witnessed four years ago, the high expectations, the soaring rhetoric, the -- you know, as Sarah Palin would say, the \"hopey-changey\" thing. Do you feel that? Or do you feel like -- ?\n\n\n\nCROWLEY: Consumer confidence?\n\n\n\nBASH: What happened? What happened?\n\n\n\nCROWLEY: Yes.\n\n\n\nBASH: So it's not -- it's that the expectations were set so high, and that is what the Romney campaign wants to hit big time going forward.\n\n\n\nHaving said that, there was some criticism, sort of friendly fire, from Republican editorial boards -- you showed some of the quotes to Mitch McConnell. That's a concern because Mitt Romney should be doing very well against somebody with 8.2 percent unemployment. And the concern is, especially given the fact that his calling card is business acumen, why isn't he doing better?\n\n\n\nCROWLEY: Let me read you something from Brian Cropp (ph) -- I don't know if either one of you know him -- he is on the corporate executive board, a managing director here, and here is what he had to say about a two-tiered job market.\n\n\n\n\"We continue to hear from companies that it's a two-tiered labor market. For people who have been employed with professional and technical skills, it's a decent job market. But for the rest of the workforce, it's still very difficult.\"\n\n\n\nIs that accurate that we're getting a sort of a two Americas when you look at the jobless rate?\n\n\n\nHOLTZ-EAKIN: I think there's an element or two to it. But to say that there is two Americas is too strong. I mean, it is always the case that during expansions, some skills and some sectors do better than others, and we are seeing that right now. There's no question. High school people have done better, and that is not unusual, especially in tough economic times.\n\n\n\nSo the challenge is to have enough economic growth that the people who have -- at the moment have sort of a relatively low-skilled job can get in, get the kind of experience that allows them to turn into the other part of America, and we're just not seeing that right now.\n\n\n\nZANDI: I am sympathetic to that description. I mean, I think if you have education, if you've gone to college, if you have the skills, you are doing OK. You're doing pretty well. If you look at the unemployment rates for people with college degrees and lots of skills, very -- it is really quite low.\n\n\n\nCROWLEY: (Inaudible).\n\n\n\nZANDI: (Inaudible). And those folks that don't have skills and education, they are getting creamed in this economy.\n\n\n\nCROWLEY: And that --\n\n\n\nHOLTZ-EAKIN: I think the key here is the income. I think -- they might have jobs, but they're not getting college and skilled level incomes out of this recovery, and the other guys are getting creamed.\n\n\n\nBASH: And that does feed into the political divide of the two Americas, Candy, no question, that President Obama historically has struggled with the sort of uneducated voter or the voter who doesn't have the high education, and he struggles with the lunch bucket voter, and this feeds right into that.\n\n\n\nZANDI: I want to push back on your point about people expecting this to be better than it is. The reality is that, after financial crises, like the one we went through -- and it was a devastating crisis -- you just look at the string of financial institutions that just are no longer with us, you always have very weak economic recovery. This is the history of economics, all the way back to the 1400s.\n\n\n\nSo it's not atypical that an economy would struggle like it is, and we have made improvements. I mean --\n\n\n\n(CROSSTALK)\n\n\n\nCROWLEY: You would know that because you know stuff like that, but --\n\n\n\nHOLTZ-EAKIN: And the president and his advisers pooh-poohed that research early on, said no, no, no, that's not true. We can do this and get out quicker and they sold it politically that they would get out quicker, and they were probably wrong.\n\n\n\nZANDI: And, Doug, I think we are going to get out quicker than what has happened typically in history, but in history, it has been a decade before economies get out. And we're going to get out a lot faster than that, but, you know, we're only three years, four years after the nadir of all of this.\n\n\n\nAnd to say we have created 4 million jobs in the last couple of years, I think that's actually quite an improvement.\n\n\n\nBut you are right, Candy, I'm talking as an economist. I'm not talking as a person on the street who has been nailed by this.\n\n\n\nBASH: And we are in a fast food nation right now. We're in the Twitter nation, where three years is six lifetimes, where everything happens very, very fast. And that's the problem (inaudible).\n\n\n\nCROWLEY: I want you all to stick with me. We've talked about the problems. After the break, we want to talk about some solutions.\n\n\n\nAnd later, solving Washington's problems may be easier than you might think.\n\n\n\nBILL BRADLEY, FORMER DEMOCRATIC SENATOR: It is not a quick fix, but it begins essentially by people telling you the truth.\n\n\n\n(COMMERCIAL BREAK)\n\n\n\nCROWLEY: With me now, Mark Zandi, chief economist of Moody Analytics, former Congressional Budget Office director Douglas Holtz- Eakin, and CNN senior congressional correspondent Dana Bash.\n\n\n\nI have talked to folks, like you all, that have said, you know, the truth is, there is not a whole lot the president or even the Fed can do to make a major change in the state of the economy, that we are now looking at a kind of a new normal with above 6 percent unemployment for the out years, as they say, maybe a decade or so to come. Do you go with that?\n\n\n\nZANDI: Not me. No, I disagree totally with that. I think our economy is on the precipice of very strong economic growth. I think that American companies have restructured, they've gotten their cost structures down, they've reduced debt, they have lots of cash. It's a matter of confidence. It's not a matter of ability to go out and expand. And I think they will. And I think there's a lot that the Federal Reserve and the administration and Congress can do, most importantly -- you were talking about this with senator McConnell -- is we have got to nail down this fiscal cliff because this is making business people nervous and it's the reason why they are not taking that step to hire more workers.\n\n\n\nSo I don't think we're in a new normal.\n\n\n\nCROWLEY: Are you bullish about the future?\n\n\n\nHOLTZ-EAKIN: We get to dictate the normal. In the '60s and '70s, we took a series of policy steps that left us with chronic high inflation, chronic high unemployment. And then we changed course in the '80s and '90s, and we got a much better performance.\n\n\n\nSo I'm with Mark. We can do much better than we're doing now. I don't think that if you round up the usual cast of characters -- this is a lot like \"Casablanca\" -- that you look at the Fed, I actually don't think there's much they can do right now.\n\n\n\nThey can stop more bad news, but they can't really push the economy much. I'm -- think we've seen enough of temporary targeted policies of the type in the past couple of years. It's time to do the things we haven't done, which is serious tax reform, serious entitlement reform, and a serious single to the business community that this is how we are going to live our lives. Go do your thing.\n\n\n\nCROWLEY: OK. So Dana, from your years on Capitol Hill, how likely is all of that?\n\n\n\nBASH: Zero percent before -- I mean, I'm sorry to say, but it's just -- and you all know this -- between now and November, it is just not. And as I was listening --\n\n\n\nCROWLEY: I'm talking about the fiscal cliff before the election.\n\n\n\nBASH: About this -- correct. And listening to you all talk, I'm thinking that -- my wheels were turning, thinking how easy it would be for Congress to give some confidence to employers, to give some confidence to Wall Street by saying, you know what, we're going to come together and decide, for example, how we are going to deal with the Bush tax cuts that are going to expire at the end of the year.\n\n\n\nThey are not going to do it. There's no way, because those are political clubs that each side is using to hit the other with, and they think, in a strong way, before November. It is actually sad, but it's a cult of our political fact.\n\n\n\nZANDI: Can I say I don't think it matters before the election, because I don't think anyone on the planet thinks it is going to happen. No business person --\n\n\n\n(CROSSTALK)\n\n\n\nCROWLEY: Do you believe that, though, by December 31st or are we going to get one of those -- the next three months, let's keep things how they are --\n\n\n\nZANDI: No, I think what people -- generally business people are expecting is that they'll get it together before it really matters and that is before the next debt ceiling hits. And that's probably next February or March. So we may actually go into -- early next year tax rates rise, but that may be the thing that actually is the catalyst for generating a solution here.\n\n\n\nHOLTZ-EAKIN: This is a longer debate, but I think that's really a dangerous way to think. I mean, it is, in fact, going to matter if they get it before the election, because we're going to start to see equity markets get nervous about the inability to get this done.\n\n\n\nWe're going to see dividend tax rates potentially going from 15 to 45 and it'll bleed over into the last half of 2012. And this economy does not need more problems.\n\n\n\nAnd if you get to the end and let the taxes go up, the only way you can get through that successfully is have the markets believe that there is a deal out there that brings them back down, and they don't believe there is a deal anywhere.\n\n\n\nBASH: No. And guess what, rightly so at this point.\n\n\n\nYou know, I just want to say one thing. One thing I was thinking about, because, Doug, of course, you were the economic adviser to John McCain.\n\n\n\nHOLTZ-EAKIN: Yes, I remember that.\n\n\n\n(LAUGHTER)\n\n\n\nBASH: Was when the whole financial market collapsed in September of 2008, you saw his poll numbers collapse with it, and you never recovered.\n\n\n\nHOLTZ-EAKIN: Yes. No.\n\n\n\nBASH: And so they just go hand in glove -- and they have historically, but I think even more in current times.\n\n\n\nCROWLEY: But then why -- we are not seeing the same thing, actually, with the president, as the -- I mean, there is a continuing crisis in households, even if we think, overarchingly, the economy is on its way to growth, as you think it is. And both of you think it is eventually.\n\n\n\nUNIDENTIFIED MALE: Sure.\n\n\n\nCROWLEY: So why has the president been able to sustain his popularity, really? I mean, he may become -- obviously we haven't had the election -- but he may become the first president to be re-elected with that kind of, you know, an 8 percent unemployment rate, basically.\n\n\n\nHOLTZ-EAKIN: Remember, in 2008, John McCain held in there, even though the economy was not doing that great and Republicans owned the economy at that point, and we had oil prices at $140 a barrel.\n\n\n\nThe economy was suffering from a lot of distress. It was hardly a great summer. But he did find until there was clear indications of bad news, is that the risk of the president is further bad news out of Europe or the global slowing or the impact of the fiscal cliff. If there's a notable downturn, I think you will run into that scenario.\n\n\n\nZANDI: OK, can I say two things? One is, I think people realize how bad it was. I mean, it was really bad and I don't think people are not forgetting that. I think that is one of the reasons why businesses aren't hiring, they can't get over that nightmare -- yeah, it's so vivid in their memory.\n\n\n\nThe second thing is there are some good things that are happening in our economy. The stock market is 10 percent away from its previous all-time high, house prices are starting to rise again. And we are creating jobs. We're not creating them fast enough, but we are creating them.\n\n\n\nCROWLEY: Mark Zandi, Dana Bash, Douglas Holtz-Eakin, thank you all for being here.\n\n\n\nA check of the morning's headlines is next. And later, what is a presidential campaign without a bus tour?\n\n\n\n(COMMERCIAL BREAK)\n\n\n\nCROWLEY: Time for a check of today's top stories. Another day of extreme heat for much of the U.S. at least 30 deaths are being blamed on triple-digit temperatures. To make matters worse some 300,000 people are without air conditioning because of power outages. Weather forecasters are expecting cooler temperatures over the next couple of days. Secretary of State Hillary Clinton says Syrian President Bashar al-Assad's days are numbered. At a press conference in Tokyo, Clipton cited the growing strength of Syria's opposition forces and high level defections from the Assad regime. Clinton is in the midst of a 13-day trip that includes stops in France, Afghanistan, Egypt, and several Asian countries.\n\n\n\nFloods have killed at least 150 people in southern Russia. Heavy rains that began Friday flooded homes while most people were asleep. Survivors were rescued after climbing into trees and on rooftops. Some 12,000 residents have been displaced.\n\n\n\nAnd in Jordan, a political debate gone wild: the man on the right in this picture is a member of parliament. He throws his shoe and then pulls a gun on the man on the left who had called the lawmaker a thief and accused him of buying votes. The two were eventually separated and no one was hurt.\n\n\n\nIt has not gotten that bad here yet, but sometimes it gets pretty tense on Capitol Hill, former Senator Bill Bradley shares his thoughts on getting the nation back on track next.\n\n\n\n(COMMERCIAL BREAK) CROWLEY: Former New Jersey Senator Bill Bradley is the author of a new book \"We Can All do Better\" which I will just agree with on general principle. He talks about politics and how the government runs or doesn't run depending on your point of view. I began by asking about his inspiration for writing this book.\n\n\n\n(BEGIN VIDEOTAPE) BRADLEY: Well, last summer when the debt limit debacle took place and when we were still in two wars and when the middle income people were still facing stagnant incomes I, as a citizen, said what can I do? And so I decided to write a book. And my hope and my desire was to give people hope that we have faced difficult problems in the past, and we have overcome them. I wanted to remind them our political institutions have the capacity to deal with the situation and also to remind them of something that we frequently forget, and that is that there is a goodness in the American people, and there is a selflessness is all around us. We could find the foundation upon which policy can be built.\n\n\n\nCROWLEY: And yet we hear -- I mean, honestly on this show, we have had any number of senators and congressmen who come on and what they speak to is a system that is broken. I mean, a complete sort of meltdown. First of all the budgetary process which is sort of at the heart of what they are supposed to be doing, that is not a quick fix.\n\n\n\nBRADLEY: It is not a quick fix, but it begins essentially by people telling you the truth. It also begins by...\n\n\n\nCROWLEY: Isn't that deadly for a politician to say to the American people, we are going to have to raise -- and a lot of people say to me, it is not just the taxes on the rich that have to be increased, it's taxes on everybody who has to be increased, but who says that?\n\n\n\nBRADLEY: Well, no one is saying that right now, and someone has to say it. And one of the points I try to make in the book is that if we are going to succeed, we have to face our problems squarely, and the deficit is one problem and that requires taxes on a lot of people not just the wealthy, and entitlements, defense, but the real issue is that we need more people working in America, and we need higher incomes for Americans. And that requires a couple of steps to take, and I outline them in book as to how I think in the short, mid, and long term we could actually get our economy growing again and middle income people believing that their children will have a higher standard of living than they've had, upward mobility will return, and America will be what it once was.\n\n\n\nCROWLEY: And in short term, just give me the quick rendition of what you think we can do in the short-term, because you're right I think the dream itself has died for so many people believing oh my kids are going to do better, we're all going to be doing this, that sort of upward mobility that you talk about is gone.\n\n\n\nBRADLEY: Well, it's pretty clear. First, if we're going to want people to work immediately, what I say is we should say if you hire a worker and don't lay anybody off, the federal government ought to pay 30 percent of that cost for two years, limit it to $50 billion, first come, first served. And not one taxpayer dollar would be spent that didn't create a job.\n\n\n\nNext what I'd say is take a look at corporate America today. There's $1.8 trillion in cash and liquid assets on the books of corporations today.\n\n\n\nCROWLEY: Sitting there.\n\n\n\nBRADLEY: Sitting there. If 20 percent of that was used to hire workers at a median wage of $49,000, unemployment would be 5 percent.\n\n\n\nSo how do we get them to do that? If you talk to CEOs, they say uncertainty about the future, I need a rainy day fund and not enough demand. You deal with uncertainty with the deficit reduction, out years, not now, dealing with the issues that I mentioned earlier.\n\n\n\nAnd then if you're able to do that, you stimulate demand with a massive, massive infrastructure program, $1 trillion over five years. And you say, well --\n\n\n\nCROWLEY: Bridges, roads, schools, that kind of repair and building you're talking about?\n\n\n\nBRADLEY: I think it's got to be more specific. It should be 50 high-priority projects. The problem with shovel-ready projects is whoever -- whatever mayor has it, they do it. It doesn't help the country. We need to do it for all the people. So we need nationally significant projects.\n\n\n\nAnd you say, well, how do I get the money for that? Well, if we already reduced the deficit in the out years, the Chinese have already lent us $1.4 trillion, and I think they could be anchor investors in that trillion-dollar infrastructure fund.\n\n\n\nCROWLEY: You say in your book that government is not the problem. Yet so many people don't trust government. They think it's broken.\n\n\n\nHow do you restore trust enough so that people will look to their government as making good decisions rather than, oh, that's (inaudible)?\n\n\n\n(CROSSTALK)\n\n\n\nBRADLEY: Well, I think it's by telling people the truth. That's what I think. And, yes, I mean, we know that the Tea Party thinks that rollback government is the answer. But we also know that government is central to our lives.\n\n\n\nI mean, you ever go to an airport and fly? Well, it's the Federal Aviation Administration that makes sure it's safe.\n\n\n\nYou ever take medicine? FDA. You ever go to national parks? Forget -- in addition to Social Security and Medicare, I mean, the highways of this country, the mass transit systems, the Coast Guard, I mean, government is the foundation of this country. And what happens, because politicians are unwilling to deal with, say, entitlements and taxes, is we cut the things that are the foundation of our country, like infrastructure, education.\n\n\n\nCROWLEY: Americans Elect was a group that wanted to start sort of an online -- get itself on the ballot and have an online sort of alternative elect primary that would put somebody on the ballot in all 50 states. It failed, as so many third party efforts have. Why?\n\n\n\nBRADLEY: Americans Elect was not a party, it was a process. It was a little bit like \"Field of Dreams.\" If you build it, they will come. The people who were behind it wanted innovation and democracy. They built it. Nobody came. Why? Nobody knew about it, first of all.\n\n\n\nSecond, I think the parties acted to prevent certain people from running, submitting themselves to the process. And, however, it does -- forms a very good foundation for a potential congressional party in 2014.\n\n\n\nCROWLEY: Former Senator Bill Bradley, thank you for stopping by. The book is \"We Can All Do Better.\" How can any of us argue with that?\n\n\n\nBRADLEY: That's you, me, everybody.\n\n\n\nCROWLEY: Thank you so much for stopping by.\n\n\n\nBRADLEY: Thank you, Candy.\n\n\n\nCROWLEY: Up next, campaigning on wheels.\n\n\n\n(COMMERCIAL BREAK)\n\n\n\nCROWLEY: Presidents have lots of headaches, but transportation is not one of them. Air Force One, Marine One, and of course The Beast, that heavily fortified presidential limo. So what's with the bus?\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nCROWLEY (voice-over): In his first buscapade of the general election season, the president rolled into 11 stops in two states over two days. Dubbed \"Ground Force One,\" this black behemoth is one of two Secret Service-approved buses costing $1.1 million per, outfitted in Tennessee, built in Canada. Duly noted.\n\n\n\nSEN. JOHN MCCAIN (R), ARIZ.: I've never seen an uglier bus than the Canadian one. He's traveling around on a Canadian bus touting American jobs.\n\n\n\nCROWLEY (voice-over): And Senator McCain knows his buses. His Straight Talk Express was among the most notable in campaign bus history, not for its creature comforts. In 2000, reporters were cheek-to-jowl aboard the Straight Talk. It was kind of a moving fire hazard, but a wildly successful campaign gimmick because it featured a candidate who never stopped talking.\n\n\n\nIn '08, John Edwards' bus, Main Street Express, broke down on an icy Iowa road. It has us wondering whether there is such a thing as pre-karma. The Mittmobile made its first appearance four years ago. Too, this time around, Romney is a lot farther down the road.\n\n\n\nUNIDENTIFIED FEMALE: Favorite stop so far?\n\n\n\nROMNEY: That's an absolute no-win question to answer.\n\n\n\nUNIDENTIFIED FEMALE: No!\n\n\n\nROMNEY: They're all my favorite.\n\n\n\nCROWLEY (voice-over): Probably the most successful bus tour ever, 1992, Bill and Al's Excellent Adventure, eight states in an eight-bus motorcade that took them all the way to the White House.\n\n\n\nA bus is the ultimate campaign prop in a ride that offers endless Norman Rockwellish photo ops, diners, farmers' markets, convenience stores. The whole \"On the Road Again\" feel of the bus just oozes Americana. On a bus, a guy who regularly flies \"Air Force One\" and \"Marine One\" can relate to what Washington calls real people.\n\n\n\nOBAMA: The best vacation I had when I was a kid was we -- my grandmother and my mom and my sister, we traveled around the country on Greyhound buses and on trains and we stayed at Howard Johnsons.\n\n\n\n(END VIDEO CLIP)\n\n\n\nCROWLEY: And that's why the wheels on the bus go 'round and 'round every time an election comes 'round. Thanks for watching STATE OF THE UNION. I'm Candy Crowley in Washington. Head to CNN.com/sotu for analysis and extras, and if you missed any part of today's show, find us on iTunes. Just search \"State of the Union.\"\n\n\n\n\"FAREED ZAKARIA GPS\" is next for our viewers in the United States.\n\n\n\n", "images": ["http://i.cdn.turner.com/cnn/.element/img/3.0/global/header/hdr-close.jpg", "http://cdn.cnn.com/cnn/images/1.gif", "http://i.cdn.turner.com/cnn/.element/img/3.0/global/header/nav-arrow.gif", "http://i.cnn.net/cnn/.element/img/1.0/sect/TRANSCRIPTS/header.transcripts.gif", "http://i.cnn.net/cnn/images/1.gif", "http://i.cdn.turner.com/cnn/.element/img/3.0/global/header/hdr-main.gif", "http://i.a.cnn.net/cnn/images/1.gif", "http://i.cnn.net/cnn/.element/img/1.0/sect/TRANSCRIPTS/shows_by_cat_white_header.gif", "http://i.cdn.turner.com/cnn/.element/img/3.0/global/header/hdr-arrow.jpg"], "top_img": "http://i.cdn.turner.com/cnn/.element/img/3.0/global/header/hdr-main.gif", "keywords": [], "authors": [], "canonical_link": "", "title": "Transcripts", "meta_data": {}, "movies": [], "publish_date": null, "source": "http://transcripts.cnn.com", "summary": ""}