{"url": "https://people.com/tv/megyn-kelly-addresses-jane-fonda-plastic-surgery-question/", "text": "Nearly four months after Jane Fonda shut down a question about her plastic surgery on NBC’s Megyn Kelly Today but days after she continued to reference the awkward moment,the former Fox News anchor addressed the actress’s controversial past while claiming she was not “in the market for a lesson from Jane Fonda on what is and is not appropriate.”\n\n“When she first complained publicly after the program — and repeatedly — I chose to say nothing, as my generally philosophy is what other people think of me is none of my business,” Kelly said on her show Monday. “However, Fonda was at it again last week, including here on NBC and then elsewhere, so it’s time to address the ‘poor me’ routine.”\n\nGet push notifications with news, features and more.\n\nLast week, Fonda and Grace and Frankie costar Lily Tomlin joked about the awkward moment from September on Today‘s earlier hour: When Hoda Kotb asked how long they’ve known each other, Fonda estimated 50 years. Tomlin had a sharper guess: “I think before your first face lift!” Fonda then joked to Tomlin, “Who are you, Megyn Kelly?”\n\nOn Monday, Kelly, 47, reminded her audience that the actress had appeared on her show to promote Our Souls at Night, a movie about aging.\n\n“The truth is, most older women look nothing like Fonda, who is now 80,” the host said. “And if Fonda really wants to have an honest discussion about older women’s cultural face, then her plastic surgery is tough to ignore. Fonda herself knows this, and that is why — to her credit — she’s discussed her cosmetic surgery pretty much everywhere before coming on our show.”\n\nImage zoom Jane Fonda and Megyn Kelly\n\nAfter showing a reel of Fonda openly talking about having work done in other interviews over the years, Kelly continued that there was no way for her to know that suddenly the topic was taboo.\n\n“Look, I gave her a chance to empower other women, young and old, on a subject which she purports to know well, and she rejected it — that’s okay,” she explained. “But I have no regrets about that question, nor am I in the market for a lesson from Jane Fonda on what is and is not appropriate. After all, this is a woman whose name is synonymous with outrage. ”\n\nKelly then addressed Fonda’s controversial actions during the Vietnam War, including calling prisoners of wars “hypocrites and liars” whose torture was “understandable,” attempting to shame troops through radio broadcasts and posing on an anti-aircraft gun used against American pilots. Kelly also noted that Fonda apologized years later for the gun photo but claimed she still says she’s not proud of the country, causing many veterans to refer to the actress as “Hanoi Jane.”\n\n“The moral indignation is a little much,” Kelly concluded. “She put her plastic surgery out there. She said she wanted to discuss the plight of older women in America. And honestly, she has no business lecturing anyone on what qualifies as offensive.”\n\nIn 2015, Fonda apologized for the incendiary photo.\n\n“Whenever possible I try to sit down with vets and talk with them, because I understand and it makes me sad,” she said. “It hurts me and it will to my grave that I made a huge, huge mistake that made a lot of people think I was against the soldiers.”\n\nRELATED VIDEO: Megyn Kelly Asked Jane Fonda About Plastic Surgery – and Jane Was Not Having It\n\nSpeaking with Variety about her new documentary, Jane Fonda in Five Acts, Fonda addressed the awkward moment when Kelly attempted a line of questioning about going under the knife. Fonda appeared uncomfortable by the question, staring back Kelly with bewilderment and pausing for a few seconds before finally asking, “We really want to talk about that right now?”\n\n“It wasn’t like I was upset. I was stunned,” Fonda explained in the new interview. “It was so inappropriate. It showed that she’s not that good of an interviewer.”\n\nFonda also said she wouldn’t rule out another chat with Kelly “if she comes around and learns her stuff.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F11%2Fjanefondamegynkelly3-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F11%2Fjanefondamegynkelly3-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F11%2Fjanefondamegynkelly3-2000.jpg", "keywords": [], "authors": ["Stephanie Petit"], "canonical_link": "https://people.com/tv/megyn-kelly-addresses-jane-fonda-plastic-surgery-question/", "title": "Megyn Kelly Claps Back at Jane Fonda Over Plastic Surgery Question, References 'Hanoi Jane'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Jane Fonda,Megyn Kelly,News,Plastic Surgery,TV", "news_keywords": "Jane Fonda,Megyn Kelly,News,Plastic Surgery,TV", "description": "Nearly four months after Jane Fonda shut down a question about her plastic surgery, Megyn Kelly addressed Fonda's own controversial past", "og": {"title": "Megyn Kelly Claps Back at Jane Fonda Over Plastic Surgery Question, References 'Hanoi Jane'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/megyn-kelly-addresses-jane-fonda-plastic-surgery-question/", "description": "Nearly four months after&nbsp;Jane Fonda&nbsp;shut down a question about her plastic surgery on&nbsp;NBC’s&nbsp;Megyn Kelly Today&nbsp;but days after she continued to reference the awkward moment,the&nbsp;former Fox&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F11%2Fjanefondamegynkelly3-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/megyn-kelly-addresses-jane-fonda-plastic-surgery-question/", "description": "Nearly four months after Jane Fonda shut down a question about her plastic surgery, Megyn Kelly addressed Fonda's own controversial past", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F11%2Fjanefondamegynkelly3-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/megyn-kelly-addresses-jane-fonda-plastic-surgery-question/", "title": "Megyn Kelly Claps Back at Jane Fonda Over Plastic Surgery Question, References 'Hanoi Jane'", "description": "Nearly four months after Jane Fonda shut down a question about her plastic surgery, Megyn Kelly addressed Fonda's own controversial past", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F11%2Fjanefondamegynkelly3-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}