{"url": "https://web.archive.org/web/20080213201909/http://facts.hillaryhub.com/archive/?id=4497", "text": "Fact Check: Hillary’s Iowa Remarks\n\nAfter months of character attacks from her opponents, Hillary responded with the facts. The following is a rundown of some of the contrasts that Hillary highlighted in her speech today in Iowa:\n\nHillary: “A couple of my leading opponents, directly and through surrogates, have spent months criticizing me without having to answer any of their own questions. They’ve been attacking my character. As I have said repeatedly, I prefer to attack the problems of the country and let my opponents run their own campaigns.”\n\nSen. Obama attacked Hillary. [Fact Hub, 12/3/07]\n\nSen. Edwards criticized Hillary for using doubletalk in the debate. \"The Democratic debate on Tuesday was a defining moment in this election. From my perspective it is important for the next president of the United States to be honest and sincere and trust-worthy given what's happened with Bush over the last seven years. Instead of straight talk, there was a lot of doubletalk in the debate from Senator Clinton on some of the most important issues facing the American people.\" [Edwards Statement, 11/3/07]\n\nHillary: “When it comes to health care, one of my opponents believes it’s acceptable to leave out 15 million Americans. That would be 100,000 here in Iowa. Leave them out from his health care plan because universal coverage might be too hard to achieve. I disagree. I don’t think we should start by giving up on 15 million Americans. That’s why my health care plan covers everyone.”\n\nSen. Obama’s health care plan would leave 15 million uninsured. [Fact Hub, 11/19/07]\n\nHillary: “When it comes to social security, one of my opponents uses the Republican talking points and has been open to raising the retirement age and cutting benefits. Now he says he is for lifting the payroll tax, which would be a trillion dollar tax increase. Again, I disagree. I don’t think we should fix Social Security on the backs of our seniors and the middle class. I have always fought for Social Security, I have always stood up against privatization and as president, I will restore fiscal responsibility so we can keep Social Security as a sacred promise to our seniors.”\n\nSen. Obama refused to rule out raising the retirement age and cutting benefits for social security. [Fact Hub, 11/20/07]\n\nSen. Obama conceded that his plan on raising the cap for social security could impact middle income people. Sen. Obama said, “Well, when I—I am going to be listening to any ideas that are presented, but I think that the best way to approach this is to adjust the cap on the payroll tax.” When pressed on how he would structure the tax increase, “Well, it—you know, I have not specified exactly how we would structure it. Conceivably, you might have the equivalent of a doughnut hole, although this one would be a good one, as opposed to the bad doughnut hole that Bush set up for, for prescription drugs where you have a gap between people who are of middle income and very wealthy people.” [Meet the Press, 11/11/07]\n\nHillary: “When it comes to Iran, I took a stand for aggressive diplomacy. One of my opponents made a different choice: He didn’t show up for the vote. He didn’t speak out during a presidential debate that night. And finally, he decided to play politics and claim that the vote he missed – a vote for diplomacy – was really a vote for war. Well if he really thought it was a rush to war, why did he rush to campaign and miss the vote?”\n\nSen. Obama missed vote, and failed to speak out during a presidential debate. [Fact Hub, 11/20/07]\n\nSen. Obama criticized Hillary for voting to give George Bush the green light for Iran. Sen. Obama wrote, “Even worse, the Bush administration could use the language in Lieberman-Kyl to justify an attack on Iran as a part of the ongoing war in Iraq…I strongly differ with Sen. Hillary Clinton, who was the only Democratic presidential candidate to support this reckless amendment.” [New Hampshire Union Leader, 10/11/07]\n\nHillary: “Now, there’s been a lot of talk about yes or no answers to complex questions. But most people don’t know that for legislators who don’t want to take a stand, there’s a third way to vote. Not yes, not no, but ‘present’ – which is kind of like voting ‘maybe.’ Well, in the Illinois State Senate, on issue after issue, my opponent voted ‘present,’ instead of yes or no. Seven of those votes were on a women’s right to choose. Two of those votes were on measures to protect families from gun violence—one of which was a measure about firing guns on or near school grounds.”\n\nAs a state senator, Sen. Obama voted 'present' on seven abortion bills, including a ban on 'partial birth abortion,' two parental notification laws and three 'born alive' bills. [HB382, Passed 49-3-4, 5/13/1997; SB230, Passed, 44-7-5, 3/18/1997; HB1900, Passed 38-10-9, 5/16/2001; SB562, Passed 39-7-11, 4/6/2001; SB1093, Passed 34-6-12, 3/30/2001; SB1094, Passed 33-6-13, 3/30/2001; SB1095, Passed 34-5-13, 3/30/2001]\n\nAs a state senator, Sen. Obama voted 'present' on a bill that would increase penalties for the use of a firearm within 1,000 feet of a school: The bill called for the mandatory adult persecution of a minor at least 15 years of age being tried for using a firearm within 1,000 feet of a school. [SB759, Passed 52-1-5, 3/25/1999]\n\nAs a state senator, Sen. Obama voted 'present' on a bill that would reduce the penalty for carrying a concealed weapon from a felony to a misdemeanor. [Concurrence in House Amendments 1 and 2 to SB71, Passed 36-14-9, 5/21/1997]\n\nHillary: “A president can’t vote ‘present.’ A president can’t pick and choose which challenges he or she will face. My opponent’s campaign said that voting ‘present’ was a strategy to provide political cover. The Chicago Tribune said the present votes were the equivalent of taking a pass. Well, instead of looking for political cover or taking a pass, we need a president who will take a stand. And stand there and do whatever is necessary for their country.”\n\nChicago Tribune: Sen. Obama’s explanation for 'present' votes is questionable; 'few of the other Democrats who voted ‘present’ on abortion bills recall such a strategy' as Sen. Obama did. Sen. Obama \"said he worked out an arrangement with abortion-rights advocates to encourage Democrats to vote ‘present’ on some bills if they feared a ‘no’ would look insensitive and endanger their re-election. But few of the other Democrats who voted ‘present’ on abortion bills recall such a strategy. And, like Obama, they weren't politically vulnerable.\" [Chicago Tribune, 05/03/07]", "images": ["https://web.archive.org/web/20080213201909im_/http://facts.hillaryhub.com/_images/label_videofacts.png", "https://web.archive.org/web/20080213201909im_/http://facts.hillaryhub.com/_images/thumbnail_cnn.jpg", "https://web.archive.org/web/20080213201909im_/http://facts.hillaryhub.com/_images/banner_hillaryhub.jpg", "https://web.archive.org/web/20080213201909im_/http://facts.hillaryhub.com/_images/logo.jpg", "https://web.archive.org/web/20080213201909im_/http://facts.hillaryhub.com/_images/label_issuestatements.png", "https://web.archive.org/web/20080213201909im_/http://facts.hillaryhub.com/_images/feed-icon-14x14.png", "https://web.archive.org/web/20080213201909im_/http://facts.hillaryhub.com/_images/thumbnail_15.jpg", "https://web.archive.org/web/20080213201909im_/http://facts.hillaryhub.com/_images/attacktimeline.jpg", "https://web.archive.org/web/20080213201909im_/http://s20.sitemeter.com/meter.asp?site=s20imdugndjgh", "https://web.archive.org/web/20080213201909im_/http://facts.hillaryhub.com/_images/fact_header.png", "https://web.archive.org/web/20080213201909im_/http://facts.hillaryhub.com/_images/label_latestfacts.png"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "", "title": "The Fact Hub", "meta_data": {}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}