{"url": "https://ew.com/recap/the-flash-season-5-episode-5/", "text": "Image zoom Robert Falconer/The CW\n\nThe Flash S 5 E 5 type TV Show network The CW genre Superhero Where to watch Close Streaming Options\n\nThe Flash can do funny. It can do lighthearted, heartwarming, and even dark sometimes. But the one thing I don’t think it has ever truly done is creepy. Yet, somehow it pulled off in last night’s “All Doll’d Up,” which featured a truly creeptastic villain in Rag Doll. Watching actor Troy James contort his very bendy body while wearing a clown mask was unexpectedly unsettling. It was also entertaining, too, which helped a lot.\n\nBeyond the creepy villain, though, “All Doll’d Up” was mainly concerned with family drama, as has been the case with most of this season’s episodes. Iris and Nora were still at odds, and Candice Patton and Jessica Parker Kennedy continued to turn in great performances that helped us come as close to empathizing with their very comic book-y situation. Meanwhile, Caitlin, Ralph, Sherloque, and an injured Cisco made some headway on finding her father. Somehow the family stuff never felt completely at odds with the Rag Doll of it all. Anyway, let’s dive in!\n\nPicking up two weeks after the last episode, “All Doll’d Up” begins with Barry and Iris seeing their daughter for the first time since she moved in with Joe and Cecile. But it’s not a family reunion because Nora messed up in the field, which means Barry and Iris go into parent mode and scold her for it. Of course, Nora isn’t too jazzed about her parents being, well, parents and storms off. She particularly doesn’t appreciate Iris giving her advice since she thinks her mom just sits behind a desk and doesn’t do anything.\n\nBarry pleads with Nora to at least try and understand who her mother is today instead of focusing on who she becomes, but Nora ignores her father’s advice and simply returns to the West household to complain about Iris’ “shrap” to Cecile. Our favorite D.A. has no patience for this kind of disrespect and uses her time with Nora as an opportunity to tell her stories about all of the times Iris has saved Barry. Thankfully, The Flash doesn’t forget the old cliché saying “show don’t tell,” and puts some effort into showing just how heroic Iris can be, too.\n\nWhile Nora receives a history lesson, Barry and Iris team up to investigate Rag Doll, a metahuman thief who can contort his body and fit through tiny spaces. As I mentioned before, he’s a pretty creepy villain, especially since the actor is doing most of the body-twisting, crab-walking himself (Doug Jones is shaking!). That being said, the show never does too much with him beyond the physical and his motivations end up being underdeveloped and shallow. Barry and Iris discover Rag Doll is Peter Merkel, the son of a wealthy billionaire who had him arrested when he broke into their home. Apparently, Rag Doll got his powers on the night of the Enlightenment and wants to cause people the pain that he felt when his family abandoned him. The episode, however, never explains the journey that led him to want to take his pain out on the world.\n\nNext: Watch as Iris dives in\n\nHowever, what Barry and Iris learn about Rag Doll from his mother does have an effect on Iris, who can’t help but draw parallels between this and her issues with Nora. As we learned last episode, Nora, too, feels like Iris turned her back on her, and knowing that hurts Iris deeply. As I said before, though, the situation between Nora and Iris is so far removed from anything we’ll ever experience (unless time travel is invented!) and comparing it to Rag Doll’s nebulous relationship with his wealthy mom isn’t enough to make us empathize. But, there are two things working in The Flash’s favor: First, there’s obviously Patton’s heartbreaking performance; and secondly, the show connects Iris’ feelings about the Nora drama to her estranged relationship with her mother, which is a great use of the show’s history. Iris was estranged from her mom, and now she’s worried that she’s repeating the same thing with her daughter. Thankfully, Barry comes through again as a supportive husband and advises her to stop focusing on who she becomes and to turn her attention to who she is. As Team Flash learned before, the future can change, and Iris has the power to make different choices.\n\nAfter that pep talk, Iris has an epiphany and decides to track down a lead. Meanwhile, Barry returns home, and gets kidnapped by Rag Doll, who saw Iris and Barry talking at his mother’s gala. Unfortunately, Barry can’t fight back because Rag Doll snaps the cuffs on him.\n\nAlas, Team Flash is rather crippled at the moment and can’t speed off to help Barry: Nora isn’t answering her phone; Sherloque broke the extrapolator; and Cisco has a seizure every time he uses his powers because he still shards from Cicada’s dagger embedded in his hands. Thankfully, Ralph has the brilliant idea to Spider-Man swing himself and Iris to Rag Doll’s location, which might be The Flash’s most gloriously cartoony sequence ever. It’s the sort of endearingly goofy Silver Age goodness we’ve come to expect from the show.\n\nRemember how I said the show makes sure to show us Iris being a hero? Well, this is where it happens. When she and Ralph show up, Rag Doll pushes Barry off of a rooftop. Without hesitating for a second, Iris follows Barry off the roof (watch as she dives in!) and starts falling through the sky like she’s a lyric sung by Jeremy Jordan (sorry for mixing song references, but couldn’t resist). She meets Barry in midair, frees him from the cuffs with the keys, and he super speeds them to safety. I don’t want to use the word glorious again, but that’s the only way to describe this truly superheroic moment. Nora arrives in time watch it all go down, which is the visceral experience she needed to witness in order to truly change how she feels about her mother after hearing all of Cecile’s stories. By the end of the episode, the chilliness between Iris and Nora starts to thaw.\n\nWhile Barry and Iris had their hands full with Rag Doll, Caitlin, Cisco, Ralph, and Sherloque continued to search for Thomas Snow. Unfortunately, their little adventure lands Cisco in the medbay because the injuries he sustained fighting Cicada cause him to have a seizure. In one of the episode’s tenderest moments, Caitlin chastises him for risking his life like that for her, but Cisco admits he did it because he’s worried about his value on the team without his powers. Caitlin reminds him that his other superpower is his intellect, which inspires Cisco to hijack the four other satellites DeVoe shot up into space for S.T.A.R. Labs’ purposes.\n\nWall of Weird:\n\nHonestly, at this point, I have to praise The Flash’s tendency for revisionism. There are several scenes in this episode where people talk about how Iris has always wanted to be a journalist and we learn that she worked on her school newspaper and did some junior investigative reporting, which directly contradicts everything that happened with Iris in like the first three episodes of the series. Remember how it seemed like Iris was just taking journalism as an elective and kind of fell into it? Remember, when Iris was just like “I’ll make up a quote” when she failed to get a quote from Simon Stagg in “Fastest Man Alive”?\n\nBarry and Iris dancing at the Ms. Merkel’s charity gala was unnecessary, but I loved it because it was so cute and they both look amazing black tie.\n\nAt one point in the episode, Barry saves an architect, who was designing a building in Gotham City — which we’ll visit for the first time in this year’s crossover.\n\nOne development in the Killer Frost mystery: Caitlin, Cisco, Ralph, and Sherloque realize Thomas Snow is hiding out in one of Catilin’s mom’s abandoned buildings.\n\nRelated content:", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F13%2Fbetter-call-saul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2Frhbh-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F09%2Flennykravitz.jpg%3Fw%3D768", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F115093_46282_b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F09%2FHomeland_810_4979_R.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F115093_48676b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F11%2Frolestout.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F17%2FNUP_189932_0195.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2FListen-to-Your-Heart.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F09%2Ffla505a_0264b1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F07%2Ffla423b_0449b-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F10%2Fcelebrity-binge.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F116494_0767b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-voice-rec.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Frhony.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2067'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2064'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2Fdee-rogan-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F12%2Fsnl.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F03%2Fgreys-anatomy-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Fevan-rachel-wood-aaron-paul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F09%2Ffla505a_0264b1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-challenge-b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Foutlander-sea5.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F116400_1225b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2FRVD417d_0162b.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F09%2Ffla505a_0264b1-2000.jpg", "keywords": [], "authors": ["Chancellor Agard", "Seija Rankin", "Jodi Walker", "Maureen Lee Lenker", "Andy Hoglund", "Dalton Ross", "Samantha Highfill", "Sydney Bucksbaum", "James Hibberd", "Maggie Fremont"], "canonical_link": "https://ew.com/recap/the-flash-season-5-episode-5/", "title": "The Flash recap: A creepy villain draws out Iris' inner superhero", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Candice Patton,CW Superheroes,Grant Gustin,TV Recaps", "news_keywords": "Candice Patton,CW Superheroes,Grant Gustin,TV Recaps", "description": "Barry and Iris face the freakishly bendy metahuman Rag Doll.", "og": {"title": "'The Flash' recap: A creepy villain draws out Iris' inner superhero", "type": "article", "site_name": "EW.com", "url": "https://ew.com/recap/the-flash-season-5-episode-5/", "description": "The Flash can do funny. It can do lighthearted, heartwarming, and even dark sometimes. But the one thing I don’t think it has ever truly&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F09%2Ffla505a_0264b1-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://ew.com/recap/the-flash-season-5-episode-5/", "description": "Barry and Iris face the freakishly bendy metahuman Rag Doll.", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F09%2Ffla505a_0264b1-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/recap/the-flash-season-5-episode-5/", "title": "'The Flash' recap: A creepy villain draws out Iris' inner superhero", "description": "Barry and Iris face the freakishly bendy metahuman Rag Doll.", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F09%2Ffla505a_0264b1-2000.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}}, "movies": [], "publish_date": null, "source": "https://ew.com", "summary": ""}