{"url": "https://www.thisisinsider.com/nick-lachey-interview-2017-10", "text": "Singer, actor, and TV personality Nick Lachey is currently competing on the 25th season of ABC's \"Dancing With the Stars\" alongside his wife, Vanessa. Between practicing for the live shows and raising three kids, Lachey is also gearing up to reunite with his band 98 Degrees for a 31-city tour in November of their new Christmas album, \"Let it Snow.\"\n\nLachey spoke with INSIDER recently for a peek behind the curtain at \"DWTS,\" the supposed feud between his wife and dance partner Maks Chmerkovskiy (there's nothing there, he says), why he really went on the show, and why he's glad he's not part of a boy band today.\n\nKirsten Acuna: Let’s talk about \"Dancing With the Stars.\" You made it to Disney night. What has this journey been like so far?\n\nNick Lachey: [Laughter] It’s been wild. I think I went into it knowing it was going to be a lot of work and appreciating the physical component of it, but I don’t know that I was prepared for the mental, emotional exhaustion that comes with it as well. So, it’s definitely been a lot of work. But at the same time, it’s been a lot of fun and I wouldn’t change doing it for the world. I just have a whole new appreciation for what it takes to do the show at this point.\n\nAcuna: Certainly. And what is it like competing against your wife Vanessa? Is it hard or is it adding some healthy competition to your relationship?\n\nVanessa Lachey and Nick on \"DWTS.\" ABC/Eric McCandless\n\nLachey: You know what? Honestly, although we are technically competing on the show, it feels much more like a support system to be honest with you. As I was just saying, it’s such a grind at times, and it’s helpful to go home at the end of the day and have somebody there who had a similar experience that day and understands what I’m going through. We can lean on each other, support each other, and encourage each other. More than anything it’s been helpful, to be honest with you, more than it’s felt like a competition, you know what I mean?\n\nAcuna: For sure. Vanessa’s been performing wonderfully. Are you surprised or impressed by her routines each week?\n\nLachey: I’m not surprised, because she loves to dance. She’s a perfectionist — she works super hard at anything she does. I’ve been incredibly proud of her, obviously. I know how hard she’s been working because I talk to her about it every day, but it’s great to see all that hard work pay off. I’m certainly not surprised, but I’m very, very proud of what she’s doing and I hope it continues.\n\nAcuna: Vanessa performed a rumba October 9 to you singing after sharing such a powerful story about your [third son’s premature birth]. When the camera cut to your face, you were visibly emotional. What was going through your mind in that moment? You seemed so proud of her.\n\nNick Lachey looks down at his wife after her rumba. Frankie Muniz is alongside him clapping. ABC\n\nLachey: I was. It obviously brought back a lot of memories. It was an emotional night across the board for everybody. It was kind of a special night to be a part of and hear everybody's stories and learn what they had gone through at different times in their lives.\n\nFor me, it brought back a lot of memories of that time. It’s almost a year ago at this point when [Vanessa] went into the hospital and then her water broke. So, just the hopeless feeling that I had. You had that kind of dynamic of all those memories flooding back, but then, of course, to your point, I knew how emotional she was about sharing that story and I’m very proud of her for doing it and for performing so well in the midst of it. It was just a really special night for all of us.\n\nI’m glad that we got to share that story and do it in that way because so many people have gone through similar things. It’s a scary thought. It’s nice to know that it can turn out well in the end. I’m glad we were able to share that story and get that message across.\n\nAcuna: Yeah, I think it probably resonated with a lot of people who have experienced and gone through similar events. It’s not an easy thing to share. I’m sure it was appreciated.\n\nLachey: Yeah.\n\nAcuna: You mentioned that you sort of have an idea of what Vanessa’s dances are kind of like. Do you see her dances performed for the first time when everyone else is seeing it or do you guys watch each other practice at all? Or Is that not allowed — do you guys have to keep things secret from one another on the show?\n\nLachey: No, you just don’t get a chance to see very many of the dances because you’re so hyper-focused on your own. We rehearse, for the most part, in the same studio. Occasionally, you’ll see what someone else is doing or you’ll hear their song, but until you get into dress rehearsal and blocking rehearsal, you really don’t see what other people are doing. It’s fun in dress rehearsal to kind of, for the first time, see what everyone’s dance is and, of course, everyone’s surveying the landscape or [seeing] who’s got a good dance this week, and what [you’re] up against.\n\nNick Lachey performing on \"DWTS.\" ABC/Eric McCandless\n\nFor me, I knew about [Vanessa’s] dance [from October 9]. She talked to me about what she was doing. Occasionally, she showed me a video or something they took in rehearsal, but I’m pretty much seeing it for the first time along with everyone else.\n\nAcuna: OK. Could you give us a little taste of what it’s like to be on the show? All we’re seeing is what’s shown on TV each week. How much are you actually training? What is your schedule like?\n\nLachey: You’re training a lot. You have to imagine — for those who are good dancers, maybe they don’t have to train as much — but for me at least, not being a very good dancer you have to hit the reset button every week and come in on Tuesday, the day after the live show, and start all over and learn a whole new dance with a whole new set of emphasis. Some weeks, you want to have body doing one thing. The next week, it’s a totally different thing. You always have to relearn everything on a weekly basis and it takes a lot of work mentally and physically. It’s a lot. Then you have all the video packages and all the interviews and all the things that go into making the show as well.\n\nNick trains with dance partner Peta Murgatroyd for an upcoming dance. ABC\n\nIt’s a lot more time intensive than I probably thought going in. It’s been tricky with both of us being on the show at the same time having three kids and trying to balance all that. I think that’s probably been the most difficult part of the who process for me, feeling like I’ve been an absentee father to an extent because we’ve been so busy with the show. But, at the same time, it’s been a lot of fun. At least you feel like, in the end, hopefully the work pays off and it’s all worth it.\n\nAcuna: You have been the last to be called safe twice now. Is that nerve-racking?\n\nLachey: It's not fun. I'll tell you that much. I’d much rather be safe than have to worry about it. But, you know, it is what it is. You gotta keep fighting, keep scrapping. I’m a big fan of having a “never say die” attitude. So until I’m out of it, I’m not out of it and we’ll keep scrapping and keep doing what we’re doing and hope that it translates to judges’ scores.\n\nNick Lachey and Peta Murgatroyd wait to hear that they're not eliminated from \"DWTS.\" ABC/Eric McCandless\n\nAt the end of the day, I didn’t do the show because I wanted to win necessarily or thought I would win. I did it more because I was, frankly, very uncomfortable dancing for my entire life. I’m a big believer in trying to challenge yourself to step outside of your comfort zone and try new things. I was petrified of sharks in the ocean so I got certified in scuba because I don’t like settling for being afraid of things and being uncomfortable with things. At the end of the day, the scores are the score, the results are the results, but I feel like I’ve gotten what I’ve wanted out of this experience no matter what. That feels good.\n\nAcuna: And I think that’s all that matters despite what anyone else may say. As long as you feel like you’ve proven something to yourself.\n\nLachey: Yeah, that’s all you can do. I equate this experience to golf. You’re competing against yourself really. You can’t compete against other people because there’s certainly people on this season [of \"DWTS\"] who are incredibly accomplished dancers. Jordan is an incredible dancer. You can’t compete against that. You have to compete against yourself and challenge yourself to be the best that you can be and that’s really the kind of barometer you have to use.\n\nNick Lachey and Peta Murgatroyd dance for \"Most Memorable Year\" night on \"DWTS.\" ABC/Eric McCandless\n\nAcuna: That’s a great way of looking at it. This may roll into a little of what you just said, but are there any lessons you have learned from being on \"DWTS\" so far — whether it may be with your relationship or what you will take away from this experience?\n\nLachey: For me, it’s been a great lesson in how to maintain a good attitude because it’s hard sometimes when you’re getting a little beat up on the scoring on a weekly basis. It’s easy to fall into a negative state of mind and feel like, \"What’s the point?\" It’s been good for me, on a mental level, to remind myself, \"Hey, this is not why you did it. You stay after it and do the best you can.\"\n\nNick Lachey and Peta Murgatroyd wait to hear their scores. ABC/Eric McCandless\n\nAs a father, you find yourself telling this to your kids a lot. My son, when he didn’t want to play baseball, I was like, \"Buddy, try it. Try playing baseball and if you don’t like it, that’s fine. But I want you to try it. I want you to try as hard as you can at it. And then we’ll talk about it.\" You kind of have to give yourself the same pep talk. As a 43-year-old, you’re like, \"You know what? Just, try it. Try as hard as you can, give it everything you got and then accept the results.\" It’s been a good lesson for me in life to remind myself that on a daily basis as far as doing the show.\n\nAcuna: And as you said, that has to be great for your kids to have as an example to look up to.\n\nLachey: I think as parents you want to at least try to provide a good example to your kids. So yeah, I feel like a complete hypocrite if I’m telling [my son] to try new things and not be afraid and I’m shying away from doing a dancing show for Pete’s sake. On some level, you’re at least being a good example for your kids.\n\nAcuna: Yeah. Well, let’s talk a little bit about you and Vanessa. You have been married for six years. How do you guys make it work between three kids and \"Dancing With the Stars\" right now? You mentioned that’s a bit challenging.\n\nLachey: It’s a matter of just time management. You only have so much time in the day. At the end of the day, you don’t want to see the thing that suffers be your family, or your kids, or your home life. It’s hard to balance, but that’s not anything unique to us and that’s probably true for most busy, active, working parents. You know, it’s just about finding time, it’s about balance, it’s about walking the line and making sure you’re keeping your priorities in order.\n\nI've been waiting for years to ride a rollercoaster with my son! Thank You @disneyland for making this happen! #ThunderMountain #Matterhorn #SpaceMountain A post shared by Nick Lachey (@nicklachey) on Oct 19, 2016 at 7:57pm PDT Oct 19, 2016 at 7:57pm PDT\n\nI don’t think we’re any different than anybody else out there. You just have to make time for each other and continue to respect each other. Anybody who tells you that being married and having kids is a walk in the park — it’s a beautiful thing. It’s the best thing I’ve ever done in my life — but it’s definitely work. You have to work at it like you do anything else you care about in life. It takes commitment and it takes work, and that’s all part of it, but in the end there’s nothing more worthwhile than working on your family. It’s just the best thing in the world.\n\nAcuna: Is there anything that you found that is really difficult about raising three children? Is there any advice you have for anyone raising three children?\n\nLachey: Whether it’s one or 15, patience. Kids will try you in ways you didn’t imagine and you just have to be patient. The thing I like the best, especially being a parent of so many kids, Is that they’re all so different. You love them all equally, but they’re all so different from each other and that’s the cool thing, to see their personalities start to develop and see how unique and different they all are and to be able to love them in their own unique ways. It’s really, really, really special.\n\nHappy Easter! Love, The Lacheys A post shared by Nick Lachey (@nicklachey) on Apr 16, 2017 at 7:35pm PDT Apr 16, 2017 at 7:35pm PDT\n\nThat and I’m starting to see the dynamics between my daughter and my older son and how they play together, fight together. [As] someone who grew up with siblings, you start to appreciate how that relationship starts to take form. It’s cool. Every day is something new. My only piece of advice would be patience. You have to have a lot of that, and, if you don’t, you’ll figure it out.\n\nAcuna: Later this month, your band 98 Degrees will be releasing another Christmas album, \"Let It Snow.\" What inspired the album?\n\nLachey: It's our 20th anniversary of our first release on Motown, which is '97. We wanted to commemorate that with a new project. Collectively speaking, our favorite project that we've done to this point was our first Christmas record. We just loved it. We're very proud of it. [We] felt like it was kind of timeless and we wanted to revisit that and do another record. We decided that the best thing to do was the Christmas thing again and do a volume two, if you will. We went to the studio this summer and knocked it out. [We] couldn't be more proud of it, couldn't be happier with it. It really came out great and [we're] excited for all our fans to hear it.\n\nThe group's 1999 Christmas album vs. their upcoming 2017 album which will be released October 20. Universal Pictures, UME\n\nAcuna: Yeah, and what is it like to be going on tour with them again for the album?\n\nLachey: Tour starts November 9. It's great. We toured last summer together and toured four years ago with Boyz II Men and New Kids on the Block. The touring thing I think we're having more fun and we're having more appreciation for being together, performing together than we even did 20 years ago. Touring itself is a little harder because everyone has kids. You hate to be away and it definitely puts a strain on things. But as far as touring itself and performing together, we love it. We love it probably more now than we did back in the day. Very, very grateful that we get the chance to do it.\n\nAcuna: Since the tour starts November 9, did you ever think of how that may possibly impede with \"Dancing With the Stars\"? Is that a conflict at all?\n\nLachey: It could potentially be. We actually had to move a couple tour dates before we put them on sale to accommodate the schedule for \"Dancing\" should I make it through to the finals. Yeah, we took all of that into account. Look, if I'm lucky enough to still be around in the competition at that point, it'll be chaotic and Peta and I will be doing a lot of rehearsing on the road. It is what it is. We'll figure it out.\n\nAcuna: You'll make it work. So, I've been listening to the album and I love the new song you guys have, \"Season of Love.\" Especially now, between politics and everything else in the news, it has a message of what people need right now — an upbeat song about keeping joy and love in your heart year round. What was the inspiration behind that song?\n\nLachey: I'm very glad you said that, because that's exactly what our inspiration was in writing it. Christmas is such a feel-good time of year, and despite what's going on, it's about love and it's about celebration and just the holidays in general. It's like, why can't we carry that through the rest of the year? Why does it have to be just now? Let's make the entire year a season of love.\n\nSo, yes, that was really it. It's us just trying to convey a message of love and togetherness and, hey let's carry this feeling on for all 365 days not just one little month of the year. Very, very glad that that's what you got out of it. That was exactly what we were aiming for.\n\nNick Lachey and the members of 98 Degrees. From left to right: Jeff Timmons, Nick Lachey, Drew Lachey, and Justin Jeffre. Courtesy UMe\n\nAcuna: That's good to hear. Well, I wanted to ask, as a member of a popular boy band from the '90s, what do you make of the state of boy bands today? We had One Direction. Now it's Sam Smith, Justin Bieber, Harry Styles. Is the boy band dead?\n\nLachey: I don't think you're ever post-boy band. If we see anything, it's that music is cyclical and boy bands will come back around. One Direction just wrapped up last year. You've got 5 Seconds of Summer. You've got boy bands that are going to be coming up again, I'm sure. As long as there are teenage girls, there will be boy bands. It's a question of how long it takes them to get their music together to come out.\n\nI was very impressed. I actually had a chance to interview the guys of One Direction for \"Good Morning America\" last year. I didn't really know them that well before that interview, but I came away really impressed with how great of singers they all were in their own independent right and how together they were. They all seemed pretty well together and had good heads on their shoulders.\n\nBut boy bands — they evolve, they change, but they'll always be there. There will be good ones. There will be not so good ones. For the most part, I've been very impressed, specifically with those guys. 'NSync, Backstreet, our era of boy bands, we all kind of filled a different niche, if you will. That was our mentality: there's room for everybody. There will always be boy bands.\n\nAcuna: Did you feel like that was a full circle moment for you? Interviewing a boy band after being in a band yourself? (Well, still technically in a band.)\n\nLachey: Yeah, I guess in my mind I'm still in a \"boy band.\" It's a little full circle. It's cool when you get a chance to interview people. I hosted a show for VH1 for a year and a half. When you've been in the other chair and you've been interviewed, lived that part of the equation, it gives you a unique perspective to be on the other side and ask the questions. I always really enjoyed that because I felt like I could kind of identify with what a lot of people I had the chance to interview were going through or have gone through.\n\nOne Direction. Eamonn M. McCormack/Getty\n\nBut, yeah, I don't want to say it was a passing of the baton kind of thing, but you do appreciate and kind of identify with what it's like to be in a boy band and what it's like to go through that stuff or be in a band in general.\n\n#Repost @98official 26 days until #98christmas Get your tickets from the link in my bio! 🎫 A post shared by Nick Lachey (@nicklachey) on Oct 14, 2017 at 1:23pm PDT Oct 14, 2017 at 1:23pm PDT\n\nAcuna: Of course. So, I know you have \"Let It Snow,\" but is Nick Lachey himself working on anything else? Are there any thoughts of another solo album?\n\nLachey: Yeah, I am. I'm actually going into the studio next week to start working on another solo project. [There's] not a whole heck of a lot to talk about yet. We're in early stages of it, but music's always going to be my passion. [It] always has been, always will be. I will continue to work on music as long as people continue to listen to it.\n\nThis interview has been shortened and edited for clarity.", "images": ["https://i.insider.com/59e4d3fd88415e99088b46d0?width=1200&format=jpeg", "https://www.thisisinsider.com/nick-lachey-interview-2017-10?width=600&format=jpeg&auto=webp", "https://i.insider.com/59e4c8af88415e1d008b46f3?width=600&format=jpeg&auto=webp", "https://i.insider.com/59e4254c88415e2f008b46cc?width=600&format=jpeg&auto=webp", "https://i.insider.com/59e4264fef52e24b008b468e?width=600&format=jpeg&auto=webp", "https://i.insider.com/59e42adc42261671098b4690?width=600&format=jpeg&auto=webp", "https://i.insider.com/59e4c7464226163c008b46ef?width=600&format=jpeg&auto=webp", "https://i.insider.com/59e4d3f588415e65008b46fa?width=600&format=jpeg&auto=webp", "https://i.insider.com/59e4c7e788415e67008b46be?width=600&format=jpeg&auto=webp", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1 1'%3E%3C/svg%3E", "https://i.insider.com/59e4c89688415e09098b46aa?width=600&format=jpeg&auto=webp", "https://i.insider.com/59e4cf2642261640008b470a?width=600&format=jpeg&auto=webp", "https://i.insider.com/59e4c60542261646008b46b4?width=600&format=jpeg&auto=webp", "https://i.insider.com/59e4c59242261622008b46de?width=600&format=jpeg&auto=webp", "https://i.insider.com/59e4d3f588415e65008b46fa?width=24&format=jpeg&auto=webp"], "top_img": "https://i.insider.com/59e4d3fd88415e99088b46d0?width=1200&format=jpeg", "keywords": [], "authors": ["Kirsten Acuna"], "canonical_link": "https://www.insider.com/nick-lachey-interview-2017-10", "title": "Nick Lachey: 'I didn't do \"Dancing With the Stars\" because I thought I would win'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "Nick Lachey: 'I didn't do \"Dancing With the Stars\" because I thought I would win'", "date": "2017-10-16", "news_keywords": "98 Degrees, bands, Music, Dancing with the Stars, DWTS, Kirsten Acuna", "description": "Nick Lachey speaks with INSIDER about competing on \"DWTS,\" balancing work and family, and reuniting with 98 Degrees for an upcoming tour and album.", "author": "Kirsten Acuna", "article": {"publisher": "insider", "content_tier": "free", "opinion": "false"}, "tbi-vertical": "Culture", "og": {"title": "Nick Lachey: 'I didn't do \"Dancing With the Stars\" because I thought I would win'", "description": "Nick Lachey speaks with INSIDER about competing on \"DWTS,\" balancing work and family, and reuniting with 98 Degrees for an upcoming tour and album.", "type": "article", "url": "https://www.insider.com/nick-lachey-interview-2017-10", "image": "https://i.insider.com/59e4d3fd88415e99088b46d0?width=1200&format=jpeg", "site_name": "Insider"}, "sailthru.title": "Nick Lachey: 'I didn't do \"Dancing With the Stars\" because I thought I would win'", "sailthru.date": "2017-10-16", "sailthru.tags": "98 Degrees, bands, Music, Dancing with the Stars, DWTS, Kirsten Acuna", "sailthru.description": "Nick Lachey speaks with INSIDER about competing on \"DWTS,\" balancing work and family, and reuniting with 98 Degrees for an upcoming tour and album.", "sailthru.author": "Kirsten Acuna", "sailthru.verticals": "culture", "sailthru.image.full": "https://i.insider.com/59e4cf0188415e1d008b46ff?width=1200&format=jpeg", "sailthru.image.thumb": "https://i.insider.com/59e4cf0188415e1d008b46ff?width=160&format=jpeg", "twitter": {"card": "summary_large_image", "site": "@thisisinsider"}, "Insider": "Snapchat", "Nick Lachey": {" 'I didn't do \"Dancing With the Stars\" because I thought I would win'": "The Fastest Way to Share a Moment!"}, "fb": {"pages": 1413475698959824}, "linkedin": {"owner": "mid:1d5f7b"}, "ii-ab-test": {"bi8-lazy-load": 300, "back-to-top": "variant", "sticky-section-titles": "variant", "post-breadcrumbs": "variant", "tabbed-homepage": "variant", "expanded-coverage-module": "control", "subscribe-smallest-price": "control"}, "viking-id": "59e3f90988415e99088b468d", "env": "prod", "msapplication-config": "//www.insider.com/public/assets/INSIDER/US/favicons/browserconfig.xml?12-31-19", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1508083200.0, "source": "https://www.thisisinsider.com", "summary": ""}