{"url": "https://www.radiotimes.com/news/on-demand/2018-12-24/stranger-things-season-3-netflix-release-date-cast-plot-trailer-spoilers-new-characters/", "text": "Netflix’s Stranger Things season three was a dead cert even before the second season dropped to widespread hysteria in October 2017, and the company made it official late in 2017.\n\nAdvertisement\n\nWhile it has been a longer time coming compared to previous instalments, the hype is well and truly ramping up as summer 2019 approaches. Find out everything we know about Stranger Things 3 below.\n\nWhen is Stranger Things 3 released on Netflix?\n\nNetflix confirmed at the start of 2019 that the new third season would be released on 4th July 2019 – Independence Day in the USA.\n\nDavid Harbour (Chief Jim Hopper) had already indicated that season three probably wouldn’t arrive until 2019. Netflix’s vice president of original programming Cindy Holland then confirmed that season three would not be released until summer 2019, saying however that the delay will be “worth the wait”.\n\n“[Creators] The Duffer Brothers and [producer] Shawn Levy, they understand the stakes are high,” she said. “They want to deliver something bigger and better than last year. I think it’s going to be a fantastic season. It will be worth the wait.”\n\nOn 10 November 2018, David Harbour confirmed that he had finished filming – and that he was looking forward to shaving off his moustache.\n\nThe summer 2019 release ties in with the show’s initial ‘mall teaser’, which first hinted at a summer release.\n\nIn September 2018, executive producer and director Shawn Levy said during the Emmys that “cinematically, it’s our biggest season yet”, which perhaps goes some way to explain the additional time required to film season three.\n\nIs there a trailer?\n\nYES. Netflix unveiled the first full trailer for Stranger Things’ summery season three on 20th March. Set to The Who’s Baba O’Reilly, it’s clear the Stranger Things kids are starting to grow up – but the terrors of the Upside Down haven’t gone away…\n\nA couple of months later, Netflix released another full-length trailer that revealed the return of season two’s monstrous Mind Flayer, who now appears to be possessing Dacre Montgomery’s character Billy.\n\nCheck out our full breakdown of the trailer here.\n\nNetflix had previously released a short teaser in the form of an ad for a new mall in Hawkins, which features ice cream vendors Steve Harrington (Joe Keery) and newcomer Robin (Maya Thurman-Hawke). Watch it below.\n\nAnd on 20th May, we got our first look at a full scene from the series, in a promo entitled “Summer in Hawkins”. It sees Billy – now a lifeguard at the local pool – and Mrs Wheeler having a flirt. Check it out below.\n\nWho is in the cast?\n\nThe good news is that all of the original cast are on board for the new episodes. That means: Millie Bobby Brown’s Eleven, Finn Wolfhard’s Mike, Winona Ryder’s Joyce, Noah Schnapp’s Will, Caleb Mclaughlin’s Lucas, Gaten Matarazzo’s Dustin, Natalia Dyer’s Nancy, Charlie Heaton’s Jonathan and fan favourite Joe Keery (Steve) are all set to return.\n\nPromo posters for Stranger Things season 3! pic.twitter.com/m6fgSPPevN — Stranger Things Posts (@ST_Posts) May 20, 2019\n\nSeason two additions Max (Sadie Sink) and Billy (Dacre Montgomery) will return, but sadly Sean Astin’s Bob… We’re still not ready to talk about it.\n\nAs for new additions: fresh off last year’s BBC adaptation of Little Women, Maya Thurman-Hawke (daughter of Uma and Ethan) will join up with the main cast as Robin, a new character who uncovers a “dark secret” in Hawkins.\n\nConsidering Thurman-Hawke’s age (she’s 19), we’re guessing that she’ll be part of the older kids’ peer group alongside characters like Jonathan and Nancy – but what could this “dark secret” be? Is it just that she uncovers the events of the first two Stranger Things seasons, or something new? And could her character end up being a new love interest for jilted Steve?\n\nStorm Troopers star Jake Busey and Cary Elwes (The Princess Bride) have also been added to the line-up as new characters Bruce and Mayor Kline, respectively, and Haters Back Off’s Francesca Reale will feature as Heather, a lifeguard at the community pool who becomes the focal point of a “dark mystery”.\n\nPlus, Lucas’ sarky little sister Erica (played by Priah Ferguson) is set to play a much bigger role. According to a release from Netflix, season three will see her embark on a “wild mission to save Hawkins from a dangerous and unexpected new threat”.\n\nCheck out a beautiful poster for the new season below\n\none question: does the Starcourt Mall have a Nando's? pic.twitter.com/FNOMKWub9D — Netflix UK & Ireland (@NetflixUK) June 4, 2019\n\nWhat happened in Stranger Things 1 & 2?\n\nNetflix got the cast together to explain what happened in the first two seasons – check the video out below.\n\nThe cast of #StrangerThings tells you everything you need to remember about @Stranger_Things Seasons 1 and 2 to prepare for Season 3! https://t.co/IOiPEkDssK pic.twitter.com/szdXraDW8w — See What's Next (@seewhatsnext) June 24, 2019\n\n*Spoilers for Stranger Things 2 to follow*\n\nNetflix released the official synopsis for Stranger Things 3 in June.\n\n“It’s 1985 in Hawkins, Indiana, and summer’s heating up. School’s out, there’s a brand new mall in town, and the Hawkins crew are on the cusp of adulthood,” it reads. “Romance blossoms and complicates the group’s dynamic, and they’ll have to figure out how to grow up without growing apart. Meanwhile, danger looms.”\n\n“When the town’s threatened by enemies old and new, Eleven and her friends are reminded that evil never ends; it evolves. Now they’ll have to band together to survive, and remember that friendship is always stronger than fear.”\n\nYou can also check out the episode titles for the eight episodes of season three below.\n\nSuzie, Do You Copy?\n\nThe Mall Rats\n\nThe Case Of The Missing Lifeguard\n\nThe Sauna Test\n\nThe Source\n\nThe Birthday\n\nThe Bite\n\nThe Battle of Starcourt\n\nIn recent interviews, the cast has hinted that there’s going to be more horror and gore than ever before.\n\n“It’s definitely gorier,” Gaten Matarazzo said. “If you don’t like gore stuff, I mean, watch it anyway. It’s not for the faint of heart, as some would say.”\n\nNoah Schnapp also revealed that Will Byers is not quite over his stint in the Upside Down…\n\n“Will still has the presence of the monster left, and you kind of see what happens there,” said actor Noah Schnapp. “People have asked, ‘Does Will get a break this season?’ and I’m like, ‘Yeah, sure, for the first two episodes. And then no one really gets a break.’”\n\nSeason two of Stranger Things tied up a LOT more loose ends than the first, with the portal to the Upside Down now sealed off, Hawkins lab apparently closed for good and Jonathan and Nancy finally getting together (poor Steve).\n\nHowever, the kids’ Snow Ball idyll was marred by the final shot of the series, which saw the devilish Smoke Monster that had been terrorising our heroes (aka the Mind Flayer) land on the roof of the school in the parallel Upside Down dimension, ready to get revenge for his defeat in the season finale.\n\nWe do know that there’s a new mall in Hawkins, which will likely become a hangout for the kids in season 3. Steve Harrington has gone and got himself a job in an ice cream parlour there, alongside new girl Robin – and you can cut the sexual tension between them with a knife in this teaser (ok, you can’t – but we reckon there’s a strong chance these two will be romantically entangled in the new season).\n\nA new behind-the-scenes book meanwhile, Worlds Turned Upside Down, confirms that the series will be set in 1985, less than a year after the events of season two.\n\n“It’s really the final summer of their childhood,” Ross Duffer says in the book. “They’re dealing with growing up, with these complicated new relationships. They’re starting to fall apart a little bit, and maybe they don’t love playing Dungeons & Dragons as much as they used to. Naturally, that’s going to generate conflict.”\n\nExecutive Producer Shawn Levy told Glamour back in January that season three would “deal with forces of evil that are new”, but an interview with the Duffer brothers suggests that the usual Upside Down monsters will likely still be in the picture.\n\n“They’ve shut the door on the Mind Flayer, but not only is it still there in the Upside Down, it’s very much aware of the kids, and particularly Eleven,” Ross Duffer told The Hollywood Reporter.\n\n“It had not encountered her and her powers until that final episode. Now, it knows that she’s out there. We wanted to end on a little bit of an ominous note.”\n\nIt also seems very likely that we haven’t seen the last of Eleven’s “sister” Kali/Eight, with the superpowered illusionist escaping the police at the end of episode seven and apparently still keen on taking Eleven on a mission of vengeance against the men who wronged them.\n\nIn fact, given how abruptly her story ends, we wouldn’t be surprised if Kali and her Warriors-esque gang turned up in Hawkins to cause trouble in the next season – and with her mindbending powers, we’re betting she could cause a lot of damage. Plus – what of numbers 1-7, 9-10 and beyond?\n\nSeason three will be preceded by a new novel, Darkness on the Edge of Town, which will explore the backstory of Chief Jim Hopper as he served as a homicide detective in New York City in 1977.\n\nAccording to a tweet from Netflix, the book from author Adam Christopher will feature stories that Hopper tells Eleven.\n\n“When Eleven gets curious about unanswered questions, Hopper is forced to reckon with some long-buried secrets,” it read. This book – which is released on 4th June – could contain vital information for season three…\n\nHere's some big @StrangerThings news. The REAL (official, canonical!) story of Jim Hopper is coming to a bookstore near you. When Eleven gets curious about unanswered questions, Hopper is forced to reckon with some long-buried secrets. And, you know me. I love secrets. pic.twitter.com/CSGdkCVyaj — NX (@NXOnNetflix) February 8, 2019\n\nAs for the action in season three itself, Hopper struggles with being a single parent of a telekinetic teenager, which sees him seek advice from Joyce (Winona Ryder).\n\n“She’s able to offer me some advice on how to deal with being a single parent and how to, like, you know, stop being so damn controlling,” actor David Harbour tells Entertainment Weekly.\n\nIt also seems that raising Eleven has brought on a new bad habit for Hopper: stress eating.\n\n“This season, Hopper does a lot of really big, like, action-y things. But he’s fatter than you’ve ever seen him and less capable of hurting people, but a little more capable because he’s just like a big elephant,” Harbour said\n\nAnd, last but not least, we’ve been promised more “dad Steve”, and the continuation of his bromance with Dustin.\n\n“We’ll definitely get to see some more of Steve Harrington in season three, and I’ll just say we won’t be abandoning the Dad Steve magic,” Levy told The Hollywood Reporter.\n\n“I don’t want to say much more, but I literally feel that we were walking along and we stumbled onto a gold mine with Dad Steve.”\n\n“You definitely see more of that,” added Gaven Matarazzo (Dustin) in an interview with Entertainment Weekly. “That’s what I really like about Matt and Ross: They know what fans like and they roll with it.”\n\nWhich films inspired Stranger Things 3?\n\nIn an interview with Entertainment Weekly, the Duffers detailed the films which they looked to for inspiration when creating the new season. They include:\n\nFast Times at Ridgemont High\n\nThe Thing\n\nRomancing the Stone\n\nMidnight Run\n\nIndiana Jones\n\nJurassic Park\n\nThe films of David Cronenberg\n\nSounds like a crazy mix – we can’t wait to see how this plays out on screen.\n\nIs there really going to be a Stranger Things video game?\n\nThere will indeed. To coincide with the series release, a suitably retro beat-em-up video game will also be unveiled on 4th July.\n\nThe game is set to be available on the Nintendo Switch, with other platforms still to be confirmed. Check out a clip of the in-game action below.\n\nExplore the world of the @netflix original series in the official game for Stranger Things 3! Battle the emerging evils of the Upside Down alongside a friend in two-player co-op when @BonusXP brings Stranger Things 3: The Game to #NintendoSwitch on July 4. #st3game #Nindies pic.twitter.com/Qc6xOCbGSb — Nintendo of America (@NintendoAmerica) March 20, 2019\n\nAdvertisement\n\nStranger Things 3 will arrive on Netflix on 4th July 2019", "images": ["https://images.immediate.co.uk/production/volatile/sites/3/2017/08/cropped-radiotimes-header-logo-ad1202c.png?quality=90&resize=265,55", "https://images.immediate.co.uk/production/volatile/sites/3/2019/03/ST3-Production-Still-1-adbfeed.jpg?quality=45&crop=312px,0px,1877px,1250px&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2018/05/ST33-a54b3f8.jpg?quality=90&lb=620,413&background=white", "https://images.immediate.co.uk/production/volatile/sites/3/2018/05/A-Very-English-Scandal-1e55e95.jpg?quality=90&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2020/03/hamnet-2916df2.png?quality=90&resize=100,100", "https://images.immediate.co.uk/production/volatile/sites/3/2017/10/stranger-things-watching-79d3c6a.jpg?quality=90&crop=64px,0px,640px,426px&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2019/07/H5_promo_stills_022519.0053_R-b9d9d84.jpg?quality=90&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2017/12/TheCrown_210_Unit_00197_R-a6b2b25.jpg?quality=45&resize=556,556", "https://images.immediate.co.uk/production/volatile/sites/3/2020/04/Spring_Brandsite_1200x800_RTv2-da3a75a.jpg?quality=45&resize=1200,800", "https://images.immediate.co.uk/production/volatile/sites/3/2018/02/GettyImages-633169770-8d5819f.jpg?quality=90&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2020/03/001-SE-14-3-Cover-footer-47186e2.png?quality=90&resize=100,100", "https://images.immediate.co.uk/production/volatile/sites/3/2018/05/wv_publicity_post_launch_still_25.000001-60dec31.jpg?quality=45&crop=1208px,0px,5585px,3720px&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2018/05/wv_publicity_post_launch_still_10.000001-ab20a52.jpg?quality=45&crop=1394px,0px,5585px,3720px&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2019/08/python-for-article-0f0e8fe.png?quality=90&resize=100,100", "https://images.immediate.co.uk/production/volatile/sites/3/2017/10/Will-Stranger-Things-cdadd27.jpg?quality=90&lb=620,413&background=white", "https://images.immediate.co.uk/production/volatile/sites/3/2018/02/DSC7203-1-93d2c96.jpg?quality=45&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2019/12/ipso-sq-7800070.png?quality=90&resize=150,150"], "top_img": "https://images.immediate.co.uk/production/volatile/sites/3/2019/03/ST3-Production-Still-1-adbfeed.jpg?quality=45&crop=312px,0px,1877px,1250px&resize=620,413", "keywords": [], "authors": ["Ben Allen"], "canonical_link": "https://www.radiotimes.com/news/on-demand/2019-07-25/stranger-things-season-3-netflix-release-date-cast-plot-trailer-spoilers-new-characters/", "title": "When is Stranger Things 3 on Netflix? Who is in the cast, and what is going to happen?", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "Stranger Things season 3 Netflix release date CONFIRMED, cast, plot, trailer, news, characters: Everything you need to know", "og": {"site_name": "Radio Times", "title": "When is Stranger Things 3 on Netflix? Who is in the cast, and what is going to happen?", "url": "https://www.radiotimes.com/news/on-demand/2019-07-25/stranger-things-season-3-netflix-release-date-cast-plot-trailer-spoilers-new-characters/", "image": "https://images.immediate.co.uk/production/volatile/sites/3/2019/03/ST3-Production-Still-1-adbfeed.jpg?quality=45&crop=312px,0px,1877px,1250px&resize=620,413", "description": "Everything you need to know about the upcoming third season of Netflix's sci-fi hit", "type": "article"}, "twitter": {"title": "When is Stranger Things 3 on Netflix? Who is in the cast, and what is going to happen?", "card": "summary_large_image", "site": "RadioTimes", "creator": "RadioTimes", "image": "https://images.immediate.co.uk/production/volatile/sites/3/2019/03/ST3-Production-Still-1-adbfeed.jpg?quality=45&crop=312px,0px,1877px,1250px&resize=620,413", "description": "Everything you need to know about the upcoming third season of Netflix's sci-fi hit"}, "fb": {"pages": "u4ylx6xopb5vy1edoq8hy242v9y83x"}, "google-site-verification": "iUM5QciI_0yvO6R3xDcoZPgevG7nfNhNsNv6zOjlvpU", "description": "Everything you need to know about the upcoming third season of Netflix's sci-fi hit", "robots": "index,follow", "msapplication-TileImage": "https://images.immediate.co.uk/production/volatile/sites/3/2016/11/cropped-RT-logo-2.png?quality=90&resize=270,270"}, "movies": ["https://www.youtube.com/embed/4XdZ1GGobpo?feature=oembed", "https://www.youtube.com/embed/YEG3bmU_WaI?feature=oembed", "https://www.youtube.com/embed/XcnHOQ-cHa0?feature=oembed", "https://www.youtube.com/embed/aXyju7zFwyE?feature=oembed", "https://www.youtube.com/embed/V3L1qrisKFE?feature=oembed", "https://www.youtube.com/embed/xAkp0rAUHhw?feature=oembed", "https://www.youtube.com/embed/aXyju7zFwyE?feature=oembed"], "publish_date": 1545580800.0, "source": "https://www.radiotimes.com", "summary": ""}