{"url": "https://deadline.com/2017/03/this-is-us-season-2-spoilers-mandy-moore-milo-ventimiglia-chrissy-metz-1202043607/", "text": "The following article contains spoilers about tonight’s season one finale for This Is Us.\n\nAfter last week’s episode of This Is Us, we were expecting to finally see how Jack Pearson (Milo Ventimiglia) dies, the parting shot of the family patriarch driving away, drunk in his vehicle.\n\n“We’ve been teasing that in the press, but you’re all going to have to wait a little while longer,” said Ventimiglia tonight at the packed-house season finale screening of “Moonshadow” at the Directors Guild Theater on Sunset Blvd. Various guild attendees arrived an hour in advance to grab a seat at the packed screening. The episode was followed by a Q&A with This Is Us castmembers Ventimiglia, Mandy Moore, Justin Hartley, Chris Sullivan, Chrissy Metz, Susan Kelechi Watson and Ron Cephas Jones as well as recently promoted Season 2 showrunners Isaac Aptaker and Elizabeth Berger.\n\nWhile Jack and Rebecca didn’t eternally breakup forever, we saw a different kind of split between the Pearsons, with Rebecca saying it was time for them to take a rest. Jack stumbled drunk into her club performance and punched her ex-boyfriend and fellow band member Ben (Sam Trammell). Rebecca returned home heartbroken, the singing career she’d been trying to reboot in shambles – not just because of Jack, but Ben also made a pass at her. A fight broke out between Jack and Rebecca and she was none too happy about Jack’s alcoholism returning just as she was trying to pursue her lifelong dream.\n\nIn regards to how audiences will still have to wait to see Jack’s death, Sullivan joked to Metz, “We could stretch this out like the Neil Patrick Harris show and call it How You Killed Your Father,” a reference to Metz’s younger Kate Pearson confessing that she was an integral part of her father’s death. The actress also added that in Season 2 “we might be hearing wedding bells soon” between Kate and her boyfriend Toby.\n\n“Let’s focus on how he lived, that’s the most important lesson than anything,” chimed in Ventimiglia.\n\nAnother big reveal at the end of tonight’s episode is that Sterling K. Brown’s Randall Pearson tells his wife Beth (Watson), that he wants to adopt a kid. But, he hasn’t even told her he quit his job yet. “I think she’s OK with him quitting his job,” said Watson, “but I think her supporting him with the adoption might be an issue.” That is especially after she had the pregnancy scare earlier in the season.\n\nRon Cephas Jones, who plays Randall’s deceased father William, then dropped a heavy hint: “She might have to go out in the workforce while Randall stays home.”\n\nWith This Is Us known as the show that makes America cry on Tuesday night, Berger and Aptaker say that they’ve spoken with This Is Us creator Dan Fogelman about lightening things up a bit in Season 2. “It’s always beautiful when there’s birthday parties and people are enjoying each other. We want to find a balance,” said Berger.\n\nJim Smeal/BEI/Shutterstock\n\nBerger mentioned that Fogelman had been building up toward this season finale, with hints of the emotional breakup hinted earlier in the season.\n\n“We knew a fight was coming, Dan cornered us and excitedly said, ‘I just wrote six pages!'” Moore added. Prepping for the scene, she mentioned that she and Ventimiglia got together with the finale’s director and series EP Ken Olin to hammer out the choreography of the scene so that it didn’t take up a lot of head space on the day of the shoot.\n\nIn “Moonshadow” we see an earlier, shady side of Jack post Vietnam. Ventimiglia said that Fogelman told him before the finale, “‘People are going to hate you! But there will be a redemptive moment.'”", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=deadline.com&path=%2F2017%2F03%2Fthis-is-us-season-2-spoilers-mandy-moore-milo-ventimiglia-chrissy-metz-1202043607%2F&ct=article&lob=deadline&loc=us&env=desktop&post_id=1202043607&comment_count=6", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://pmcdeadline2.files.wordpress.com/2017/03/this-is-us.jpg?w=1024", "https://s0.wp.com/wp-content/themes/vip/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://pmcdeadline2.files.wordpress.com/2017/03/nup_177078_0397.jpeg?w=301&h=202&crop=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pmcdeadline2.files.wordpress.com/2017/03/this-is-us1.jpg?w=301&h=202&crop=1"], "top_img": "https://pmcdeadline2.files.wordpress.com/2017/03/this-is-us.jpg?w=1024", "keywords": [], "authors": ["Anthony D'Alessandro"], "canonical_link": "https://deadline.com/2017/03/this-is-us-season-2-spoilers-mandy-moore-milo-ventimiglia-chrissy-metz-1202043607/", "title": "‘This Is Us’ Season Finale: Cast & EPs Talk Jack’s Fate, Randall’s Future & More", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Deadline", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "The following article contains spoilers about tonight's season one finale for This Is Us. After last week's episode of This Is Us, we were expecting to finally see how Jack Pearson (Milo Ventimiglia) dies, the parting shot of the family patriarch driving away, drunk in his vehicle.", "news_keywords": "Chrissy Metz, Mandy Moore, Milo Ventimiglia, NBC, This Is Us", "apple-itunes-app": "app-id=533209613", "generator": "WordPress.com", "og": {"type": "article", "title": "‘This Is Us’ Season Finale: Cast & EPs Talk Jack’s Fate, Randall’s Future & More", "url": "https://deadline.com/2017/03/this-is-us-season-2-spoilers-mandy-moore-milo-ventimiglia-chrissy-metz-1202043607/", "description": "The following article contains spoilers about tonight’s season one finale for This Is Us. After last week’s episode of This Is Us, we were expecting to finally see how Jack Pearson (Mil…", "site_name": "Deadline", "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2017/03/this-is-us.jpg?w=1024", "width": 1200, "height": 803}, "locale": "en_US"}, "article": {"published_time": "2017-03-15T04:29:50+00:00", "modified_time": "2017-03-15T04:48:16+00:00"}, "twitter": {"site": "@Deadline", "text": {"title": "‘This Is Us’ Season Finale: Cast & EPs Talk Jack’s Fate, Randall’s Future & More"}, "image": "https://pmcdeadline2.files.wordpress.com/2017/03/this-is-us.jpg?w=1024", "card": "summary_large_image", "creator": "@AwardsTony", "title": "‘This Is Us’ Season Finale: Cast & EPs Talk Jack’s Fate, Randall’s Future & More", "description": "The following article contains spoilers about tonight’s season one finale for This Is Us. After last week’s episode of This Is Us, we were expecting to finally see how Jack Pearson (Mil…"}, "author": "Anthony D'Alessandro", "content_type": "Article", "post_id": 1202043607, "title": "'This Is Us' Season Finale: Cast & EPs Talk Jack's Fate, Randall's Future & More", "published_at": "2017-03-14 21:29:50", "image": "https://pmcdeadline2.files.wordpress.com/2017/03/this-is-us.jpg?w=296&h=166&crop=1", "comment_count": 6, "tags": "This Is Us", "topics": "TV", "body": "The following article contains spoilers about tonight's season one finale for This Is Us.\r\n\r\nAfter last week's episode of This Is Us, we were expecting to finally see how Jack Pearson (Milo Ventimiglia) dies, the parting shot of the family patriarch driving away, drunk in his vehicle.\r\n\r\n\"We've been teasing that in the press, but you're all going to have to wait a little while longer,\" said Ventimiglia tonight at the packed-house season finale screening of \"Moonshadow\" at the Directors Guild Theater on Sunset Blvd. Various guild attendees arrived an hour in advance to grab a seat at the packed screening. The episode was followed by a Q&A with This Is Us castmembers Ventimiglia, Mandy Moore, Justin Hartley, Chris Sullivan, Chrissy Metz, Susan Kelechi Watson and Ron Cephas Jones as well as recently promoted Season 2 showrunners Isaac Aptaker and Elizabeth Berger.\r\n\r\n\r\n\r\nWhile Jack and Rebecca didn't eternally breakup forever, we saw a different kind of split between the Pearsons, with Rebecca saying it was time for them to take a rest. Jack stumbled drunk into her club performance and punched her ex-boyfriend and fellow band member Ben (Sam Trammell). Rebecca returned home heartbroken, the singing career she'd been trying to reboot in shambles – not just because of Jack, but Ben also made a pass at her. A fight broke out between Jack and Rebecca and she was none too happy about Jack's alcoholism returning just as she was trying to pursue her lifelong dream.\r\n\r\nIn regards to how audiences will still have to wait to see Jack's death, Sullivan joked to Metz, \"We could stretch this out like the Neil Patrick Harris show and call it How You Killed Your Father,\" a reference to Metz's younger Kate Pearson confessing that she was an integral part of her father's death. The actress also added that in Season 2 \"we might be hearing wedding bells soon\" between Kate and her boyfriend Toby.\r\n\r\n\"Let’s focus on how he lived, that's the most important lesson than anything,\" chimed in Ventimiglia.\r\n\r\nAnother big reveal at the end of tonight's episode is that Sterling K. Brown's Randall Pearson tells his wife Beth (Watson), that he wants to adopt a kid. But, he hasn't even told her he quit his job yet. \"I think she's OK with him quitting his job,\" said Watson, \"but I think her supporting him with the adoption might be an issue.\" That is especially after she had the pregnancy scare earlier in the season.\r\n\r\nRon Cephas Jones, who plays Randall's deceased father William, then dropped a heavy hint: \"She might have to go out in the workforce while Randall stays home.\"\r\n\r\nWith This Is Us known as the show that makes America cry on Tuesday night, Berger and Aptaker say that they've spoken with This Is Us creator Dan Fogelman about lightening things up a bit in Season 2. \"It's always beautiful when there's birthday parties and people are enjoying each other. We want to find a balance,\" said Berger.\r\n\r\n\r\n\r\nBerger mentioned that Fogelman had been building up toward this season finale, with hints of the emotional breakup hinted earlier in the season.\r\n\r\n\"We knew a fight was coming, Dan cornered us and excitedly said, 'I just wrote six pages!'\" Moore added. Prepping for the scene, she mentioned that she and Ventimiglia got together with the finale's director and series EP Ken Olin to hammer out the choreography of the scene so that it didn't take up a lot of head space on the day of the shoot.\r\n\r\nIn \"Moonshadow\" we see an earlier, shady side of Jack post Vietnam. Ventimiglia said that Fogelman told him before the finale, \"'People are going to hate you! But there will be a redemptive moment.'\"", "application-name": "Deadline", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Hollywood Entertainment Breaking News", "msapplication-task": "name=Subscribe;action-uri=https://deadline.com/feed/;icon-uri=https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!", "fb": {"page_id": 105558754896}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1489552190.0, "source": "https://deadline.com", "summary": ""}