{"url": "https://web.archive.org/web/20090612021235/http://www.talkingpointsmemo.com:80/photofeatures/2009/06/more-czars-than-the-romanovs.php?img=1", "text": "Meet Obama's Czars\n\nWith the Obama Administration's latest creation of a new czar position - the pay czar, announced Wednesday - TPM decided to take a look at just how many have been named so far.\n\n\n\nWhen he announced his 9th czar, Obama already had more than any other President. We gave him a break and didn't include the special envoys - like George Mitchell to the Middle East - considered czars by some. Despite that, there are still upwards of 20 (and more to come, for cyber security and intellectual property). John McCain's words ring true: Obama has more czars than the Romanovs.\n\nDrug Czar\n\nCzar R. Gil Kerlikowske\n\n\n\nWhat it means:\n\n\n\nThe former police chief of Seattle, Kerlikowske was sworn in as the the Director of the Office of National Drug Control Policy on May 7. According to the official website, he \"coordinates all aspects of Federal drug control programs and implementation of the President's National Drug Control Strategy.\"\n\nEnergy Czar\n\nCzar Carol Browner\n\n\n\nWhat it means:\n\n\n\nOfficially the Assistant to the President for Energy and Climate Change, this is what Obama said at the press conference announcing her nomination: \"Carol understands that our efforts to create jobs, achieve energy security and combat climate change demand integration among different agencies, cooperation between federal, state and local governments and partnership with the private sector.\"\n\nAuto Recovery Czar\n\nCzar Ed Montgomery\n\n\n\nWhat it means:\n\n\n\nMontgomery is the director of recovery for auto communities and workers - he's spent time in Detroit at workshops \"on applying for federal grants and other financial assistance.\" The title can possibly be shared with Steve Rattner, who the NYT calls the \"car czar lite\" - \"one of 14 people on a committee that is orchestrating the rescue of the giant automakers.\"\n\nUrban Affairs Czar\n\nCzar Adolfo Carrion, Jr.\n\n\n\nWhat it means:\n\n\n\nAs head of the new White House Office of Urban Affairs, this former Bronx Borough President is in charge of the planning and execution of all urban affairs policy and programs. According to the National Journal, Carrion will also \"work across traditional Cabinet divisions to coordinate health, education and environmental initiatives in American's cities.\"\n\nInformation Czar\n\nCzar Vivek Kundra\n\n\n\nWhat it means:\n\n\n\nOfficially the Federal Chief Information Officer at the White House, Kundra \"directs the policy and strategic planning of federal information technology investments and is responsible for oversight of federal technology spending.\"\n\nTechnology Czar\n\nCzar Aneesh Chopra\n\n\n\nWhat it means:\n\n\n\nOfficially the Chief Technology Officer at the White House, Chopra will \"promote technological innovation to help achieve our most urgent priorities -- from creating jobs and reducing health care costs to keeping our nation secure,\" as Obama said at his press conference introduction. Chopra works with Kundra and Chief Performance Officer (or Performance Czar) Jeffrey Zients, not pictured.\n\nGreat Lakes Czar\n\nCzar Cameron Davis\n\n\n\nWhat it means:\n\n\n\nAppointed by Obama to oversee the cleanup of the Great Lakes.\n\nIntelligence Czar\n\nCzar Dennis Blair\n\n\n\nWhat it means:\n\n\n\nCharged with filling the seats on Obama's National Intelligence Council and coordinating among agencies.\n\nHealth Czar\n\nCzar Nancy-Ann DeParle\n\n\n\nWhat it means:\n\n\n\nAs TIME puts it, DeParle is \"behind the scenes but leading the charge\" on health care, working alongside Secretary of Health and Human Services Kathleen Sebelius.\n\nEconomic Czar\n\nCzar Paul Volcker\n\n\n\nWhat it means:\n\n\n\nOften referred to as Obama's \"big-picture\" economic czar, Volcker is charged with coordinating with the Treasury Department and other relevant agencies.\n\nRegulatory Czar\n\nCzar Cass Sunstein\n\n\n\nWhat it means:\n\n\n\nThe White House Office of Information and Regulatory Affairs \"oversees regulations throughout the government, from the Environmental Protection Agency to the Occupational Safety and Health Administration...the job will be crucial as the new administration overhauls financial-services regulations, attempts to pass universal health care and tries to forge a new approach to controlling emissions of greenhouse gases.\"\n\nBailout Czar (or TARP Czar)\n\nCzar Herb Allison\n\n\n\nWhat it means:\n\n\n\nThis former Fannie Mae CEO is overseeing the Troubled Assets Relief Program, the $700 billion bank bailout that happened under Bush.\n\nStimulus Accountability Czar\n\nCzar Earl Devaney\n\n\n\nWhat it means:\n\n\n\nDevaney oversees the $787 billion stimulus package passed earlier this year (\"the kind of guy you'd want guarding your cash,\" Devaney is a former Secret Service agent who investigated Jack Abramoff).\n\nBorder Czar\n\nCzar Alan Bersin\n\n\n\nWhat it means:\n\n\n\nBersin, who had a similar position under the Clinton Administration, is working with Homeland Security Secretary Janet Napolitano to curb the violence and trafficking of drugs along the U.S.-Mexico border.\n\nNon-Proliferation Czar\n\nCzar Gary Samore\n\n\n\nWhat it means:\n\n\n\nSamore, also known as the WMD Czar, is Obama's point man for ensuring the proliferation of such weapons doesn't occur. Samore has already said back in January that he wanted \"immediate talks\" with Iran and that he wanted to \"manage North Korea until it collapsed.\"\n\nGuantanamo Closure Czar\n\nCzar Danny Fried\n\n\n\nWhat it means:\n\n\n\nFried has the unenviable task of \"plead[ing] individual war on terror detainee cases in Europe and the Middle East.\"\n\nTerrorism Czar\n\nCzar John Brennan\n\n\n\nWhat it means:\n\n\n\nBrennan, a veteran of the CIA, is President Obama's top adviser on counterterrorism.\n\nFaith-Based Czar\n\nCzar Joshua DuBois\n\n\n\nWhat it means:\n\n\n\nThe 26-year-old DuBois is heading up the faith-based office created under former President Bush, which is concentrating on these issues, according to TIME: \"domestic poverty, responsible fatherhood, reducing the need for abortion and preventing unintended pregnancy, and interreligious dialogue and cooperation.\"\n\nWeapons Czar\n\nCzar Ashton Carter\n\n\n\nWhat it means:\n\n\n\nAlso known as the Pentagon Acquisition Czar, Carter is in charge of improving the Pentagon's system for the procurement of weapons.\n\nGreen Jobs Czar\n\nCzar Van Jones\n\n\n\nWhat it means:\n\n\n\nJones is the special adviser for green jobs, enterprise and innovation in the Obama administration, tasked with creating and managing various green jobs-related initiatives among different agencies.\n\nScience Czar\n\nCzar John Holdren\n\n\n\nWhat it means:\n\n\n\nAs head of the White House Office of Science and Technology Policy, Holdren is Obama's primary science adviser.\n\nAIDS Czar\n\nCzar Jeffrey Crowley\n\n\n\nWhat it means:\n\n\n\nAs the Director of the Office of National AIDS Policy (ONAP), Crowley has much work to catch up on - the Bush Administration didn't even fill this slot for the last 2 years.\n\nPay Czar\n\nCzar Kenneth Feinberg\n\n\n\nWhat it means:\n\n\n\nThe White House announced Wednesday, June 10 that Feinberg - who oversaw the 9/11 victims' compensation fund - is the new pay czar, or Special Master of Compensation. \"Feinberg will have broad authority to set pay limits for the top 100 employees of institutions that have received a substantial amount of TARP funds,\" says MarketWatch, including GM, Bank of America, and AIG.", "images": ["https://web.archive.org/web/20090612021235im_/http://tpmdc.talkingpointsmemo.com/tpm_siteimages/favicon.ico", "https://web.archive.org/web/20090612021235im_/http://www.talkingpointsmemo.com/images/delicious-button.png", "https://web.archive.org/web/20090612021235im_/http://www.talkingpointsmemo.com/images/hed-cafe-small.png", "https://web.archive.org/web/20090612021235im_/http://www.talkingpointsmemo.com/images/hed-archive.png", "https://web.archive.org/web/20090612021235im_/http://www.talkingpointsmemo.com/images/twitter-button.png", "https://web.archive.org/web/20090612021235im_/http://www.talkingpointsmemo.com/images/hed-search.png", "https://web.archive.org/web/20090612021235im_/http://pixel.quantserve.com/pixel/p-e4jyI3LvAd-Dc.gif", "https://web.archive.org/web/20090612021235im_/http://www.talkingpointsmemo.com/images/photo-features-hed.png", "https://web.archive.org/web/20090612021235im_/http://www.talkingpointsmemo.com/images/reddit-button.png", "https://web.archive.org/web/20090612021235im_/http://www.talkingpointsmemo.com/images/hed-rss.png", "https://web.archive.org/web/20090612021235im_/http://www.talkingpointsmemo.com/images/hed-tv-small.png", "https://web.archive.org/web/20090612021235im_/http://www.talkingpointsmemo.com/images/hed-muck-small.png", "https://web.archive.org/web/20090612021235im_/http://www.talkingpointsmemo.com/images/hed-about.png", "https://web.archive.org/web/20090612021235im_/http://www.talkingpointsmemo.com/images/hed-dc-small.png", "https://web.archive.org/web/20090612021235im_/http://www.talkingpointsmemo.com/images/photofeature-obamaczars1.jpg", "https://web.archive.org/web/20090612021235im_/http://www.talkingpointsmemo.com/images/logo_223.png", "https://web.archive.org/web/20090612021235im_/http://www.talkingpointsmemo.com/images/facebook-button.png"], "top_img": "https://web.archive.org/web/20090612021235im_/http://tpmdc.talkingpointsmemo.com/tpm_siteimages/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "More Czars Than the Romanovs", "meta_data": {}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}