{"url": "www.kidney.org/newsletter/selena-gomez-announced-she-had-kidney-transplant", "text": "Although the leading causes of chronic kidney disease are mainly diabetes or high blood pressure, other related conditions, such as Lupus, can also impact the kidneys. Kidneys play a critical role in the body—acting as the body's filtering system, removing wastes, and controlling blood pressure--and once they fail dialysis or a kidney transplant are needed just to stay alive.NKF CEO, Kevin Longino, said, “Kidney disease has been part of my own life for as long as I can remember, affecting three generations of my family. I am alive today because of the kidney transplant I received 13 years ago from an anonymous deceased donor—and there isn’t a day that goes by when I do not give thanks to the family who, despite their tragic loss, allowed me to live.I would like to extend my heartfelt support to Selena as she continues her journey towards kidney health. Finding a match is not easy; and I am sure she feels immensely blessed and grateful to her dear friend, Francia Raisa for the gift of life. To all of us, she is nothing short of a hero.”There are currently more than 100,000 people on the kidney transplant wait list –and the average wait time is long, three to five years or longer. But many kidney patients never get a transplant because they are afraid to ask their family members and friends for help. National Kidney Foundation can help people start the conversation through a special free program called The Big Ask: The Big Give . Our goal is to get as many people off the waiting list as possible and help all of them find a second chance at life.Ms. Gomez’s brave public acknowledgement of the battle she’s been privately facing, and the gift of life she received, will give strength to others to do the same.", "images": ["https://www.kidney.org/profiles/kidneys_distro/themes/custom/nephron/img/NKFLogo.svg", "https://www.kidney.org/sites/default/files/Selena Instagram.JPG", "https://www.kidney.org/sites/default/files/Selena_Gomez_Stars_Dance_San_Diego_IMG_0407_%2810915821835%29%20fb.jpg"], "top_img": "https://www.kidney.org/sites/default/files/Selena_Gomez_Stars_Dance_San_Diego_IMG_0407_%2810915821835%29%20fb.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.kidney.org/newsletter/selena-gomez-announced-she-had-kidney-transplant", "title": "Selena Gomez Reveals She Had a Kidney Transplant", "meta_data": {"description": "Selena Gomez took to Instagram this morning to reveal that she received the ultimate gift of life from her best friend, Francia Raisa. The actress and award-winning artist announced she had a kidney transplant over the summer due to complications from Lupus, an autoimmune disease that causes harm to organs and tissues. She said, “It was what I needed to do for my overall", "generator": "Drupal 7 (https://www.drupal.org)", "og": {"site_name": "National Kidney Foundation", "type": "article", "url": "https://www.kidney.org/newsletter/selena-gomez-announced-she-had-kidney-transplant", "title": "Selena Gomez Reveals She Had a Kidney Transplant", "description": "Selena Gomez took to Instagram this morning to reveal that she received the ultimate gift of life from her best friend, Francia Raisa. The actress and award-winning artist announced she had a kidney transplant over the summer due to complications from Lupus, an autoimmune disease that causes harm to organs and tissues. She said, “It was what I needed to do for my overall health.”", "updated_time": "2017-09-14T10:36:05-04:00", "image": {"identifier": "https://www.kidney.org/sites/default/files/Selena_Gomez_Stars_Dance_San_Diego_IMG_0407_%2810915821835%29%20fb.jpg", "url": "https://www.kidney.org/sites/default/files/Selena_Gomez_Stars_Dance_San_Diego_IMG_0407_%2810915821835%29%20fb.jpg", "secure_url": "https://www.kidney.org/sites/default/files/Selena_Gomez_Stars_Dance_San_Diego_IMG_0407_%2810915821835%29%20fb.jpg"}}, "twitter": {"card": "photo", "creator": "@NKF", "url": "https://www.kidney.org/newsletter/selena-gomez-announced-she-had-kidney-transplant", "title": "Selena Gomez Reveals She Had a Kidney Transplant", "description": "Selena Gomez took to Instagram this morning to reveal that she received the ultimate gift of life from her best friend, Francia Raisa. The actress and award-winning artist announced she had a kidney", "image": "https://www.kidney.org/sites/default/files/Selena_Gomez_Stars_Dance_San_Diego_IMG_0407_%2810915821835%29%20tw.jpg"}, "article": {"published_time": "2017-09-14T09:35:52-04:00", "modified_time": "2017-09-14T10:36:05-04:00"}, "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1", "application-name": "", "msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "/profiles/kidneys_distro/themes/custom/nephron/icons/mstile-144x144.png", "msapplication-square70x70logo": "/profiles/kidneys_distro/themes/custom/nephron/icons/mstile-70x70.png", "msapplication-square150x150logo": "/profiles/kidneys_distro/themes/custom/nephron/icons/mstile-150x150.png", "msapplication-wide310x150logo": "/profiles/kidneys_distro/themes/custom/nephron/icons/mstile-310x150.png", "msapplication-square310x310logo": "/profiles/kidneys_distro/themes/custom/nephron/icons/mstile-310x310.png"}, "movies": [], "publish_date": 1505396152.0, "source": "https://www.kidney.org", "summary": ""}