{"url": "www.romper.com/p/people-are-accusing-meghan-markle-of-starving-herself-for-the-wedding-its-hugely-problematic-9087529", "text": "It's not uncommon for women to lose weight before their wedding days. But tabloids are accusing Meghan Markle of starving herself for the royal wedding, and it's hugely problematic. According to Star, Markle is a \"shadow of her former self,\" and she \"caused a stir\" when she attended an Invictus Games reception with Prince Harry last month because she \"couldn’t hide her frail frame and pin-thin legs.\" Now, the tabloid reported, that she's \"wasting away\" and friends and family are \"fretting\" that she's \"starving herself into emaciation.\"\n\nThe fact is that many women work out and change up their diets to feel their healthiest before their nuptials. And this is nothing new. A 2007 Cornell University study found that 70 percent of 272 engaged women said they wanted to lose weight — typically 20 pounds, according to The New York Times.\n\nIn the two months of fittings before most clients’ weddings at Kleinfeld Bridal in New York, for example, one seamstress told The New York Times that she's kept busy taking in gowns. That's because brides-to-be say, “I don’t want the size 16; I want the 14 or the 12,’\" Jennette Kruszka, Kleinfeld’s marketing director, reportedly told the outlet in 2007.\n\nBut none of this means that these women are starving themselves.\n\nWPA Pool/Getty Images Entertainment/Getty Images\n\nMarkle's wedding dress also had to be altered several times due to weight loss, according to The Sun, but that doesn't mean that she has been \"starving herself to emancipation\" either. Rather, the article plainly said, \"Like most brides, Meghan has been on a bit of a health kick.\"\n\nNonetheless, Star reported that an \"insider\" claims she has \"lost a shocking amount of weight in just the last two weeks\" and that she \"seems obsessed with losing even more before the big day.\" The magazine reported that she \"appears to have dropped 23 pounds,\" and claimed that her purported weight loss is the result of a \"drastic diet\" that consists of cleansing juices and ice chips.\n\nRegardless, eating disorders are no joke, and throwing around accusations about them is totally uncalled for. Anorexia is the third most common chronic disease among young people, after asthma and type 1 diabetes, according to the National Eating Disorders Association. Between 0.9 percent and 2 percent of females will develop anorexia in their lifetimes. And, at any given point in time, 1 percent of young women will meet diagnostic criteria for bulimia nervosa.\n\nAnd many brides-to-be do indeed suffer from eating disorders. According to Shape, many women get so caught up in losing weight that it becomes unhealthy. A report from Moneyish actually suggested that \"proposal shape\" is the latest fitness trend that encourages people to double down on their usual workout and diet habits so that they'll be \"fit enough\" for the proposal and, eventually, the wedding. Thanks, unrealistic beauty standards!\n\nThe actress will marry Prince Harry on Saturday, according to Express, and she may actually be aiming to feel healthy and fit for the important day through a certain exercise, \"royal expert\" Julie Montagu reportedly told the outlet.\n\nMontagu holds the official title of Viscountess Hinchingbrooke, since she married Luke Montagu, Viscount of Hinchingbrooke. She is also a London-based yoga teacher, and she reportedly told Express that Markle has been practicing yoga to get herself ready for the wedding.\n\nRegardless of how Markle chooses to prepare for her wedding day, it's about time we stop body shaming women for both their weight gain and their weight loss. So long as Markle is healthy (and she's got a fiancé and a royal family to look out for her there), it's no one's business what size she'll be wearing.", "images": ["https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2020/4/15/a6c7516f-17d9-49a4-be4c-2d2441831e4c-getty-960075454.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.romper.com/uploads/getty/2018/5/15/09b86b82-f68f-465c-a14f-0878cf4a42f5-getty-951114896.jpg?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/14/9c30c48d-75d0-442f-af7a-e1190e8618a2-getty-1177044869.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/5/15/f222eb46-969c-44cb-af6a-3bf341fe28dd-getty-951088706.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/16/98b27883-e6c5-4cf9-9a31-7f69760b36d8-getty-1052729732.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=932972280084675&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2018/5/15/f222eb46-969c-44cb-af6a-3bf341fe28dd-getty-951088706.jpg?w=960&h=540&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.romper.com/uploads/image/2018/5/15/ed58807e-0e6e-4521-bda2-a573c74e8c51-bodybuilders_cta_hubs.png?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/5/15/f222eb46-969c-44cb-af6a-3bf341fe28dd-getty-951088706.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.romper.com/p/people-are-accusing-meghan-markle-of-starving-herself-for-the-wedding-its-hugely-problematic-9087529", "title": "People Are Accusing Meghan Markle Of Starving Herself For The Wedding, & It's Hugely Problematic", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@romper", "card": "summary_large_image"}, "og": {"site_name": "Romper", "url": "https://www.romper.com/p/people-are-accusing-meghan-markle-of-starving-herself-for-the-wedding-its-hugely-problematic-9087529", "type": "article", "title": "People Are Accusing Meghan Markle Of Starving Herself For The Wedding", "description": "It's not uncommon for women to lose weight before their wedding days. But tabloids are accusing Meghan Markle of starving herself for the royal wedding, and it's hugely problematic. According to Star, Markle is a \"shadow of her former self,\" and she…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/5/15/f222eb46-969c-44cb-af6a-3bf341fe28dd-getty-951088706.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 510210782483125}, "description": "It's not uncommon for women to lose weight before their wedding days. But tabloids are accusing Meghan Markle of starving herself for the royal wedding, and it's hugely problematic. According to Star, Markle is a \"shadow of her former self,\" and she…"}, "movies": [], "publish_date": null, "source": "http://www.romper.com", "summary": ""}