{"url": "https://www.usmagazine.com/celebrity-news/news/jesse-williams-estranged-wife-aryn-drake-lee-requests-sole-custody-of-kids-w497967/", "text": "Jesse Williams’ estranged wife, Aryn Drake-Lee, is requesting sole legal custody of the couple’s two kids, Sadie and Maceo, citing the actor’s unpredictable work schedule, a dangerous driving incident and his alleged “revolving door” of women.\n\nIn court documents filed on Friday, August 11, and obtained by Us Weekly, the real estate broker claims that she is responsible for the day-to-day care of the kids because of the Grey’s Anatomy star’s busy schedule. “Jesse would ‘join in’ when he was available and home, but he rarely took care of the children without my or [the nanny] Martiza’s help and presence,” the documents say. “Jesse became distant, secretive and was home less and less, traveling for unexplained reasons while telling the kids, ‘Daddy is at work.’ We tried marriage counseling in the fall of 2016, but were unsuccessful. Jesse eventually moved out at the end of March 2017.”\n\nDrake-Lee claims in the documents that her partner of 13 years has “not recognized and prioritized the children’s schedule over his own and their need to maintain it daily, even on weekends, whether or not a parent is working.” She also claims that her ex does not make the children’s school pick-up and drop-off a priority, and tries to make the nanny drive the kids, although that’s not what she was hired to do.\n\nDrake-Lee alleges that she’s concerned about what the 36-year-old actor defines as business. “His ‘work’ has allegedly included, so far, trips to Paris, New York, Florida and within California, and activities including giving a graduation speech, attending an awards show, attending a celebrity soccer game in Miami, or doing something undisclosed,” the documents say.\n\nHowever, in previous court documents Williams has claimed that Drake-Lee has declined his requests to spend more time with the children. “Aryn restricts my time with the children and decides when, and for how long I may have them,” Williams claimed in the June documents obtained by Us. “She has rejected, without any reason, each and every request I have made to have the children sleepover at my residence. On the few days that I have the children, Aryn has insisted that my time with the children be limited during the week to approximately two-and-a-half hours per day, despite my requests for more time, including overnights with the children.”\n\nDrake-Lee also cites a July 18 incident in which Williams flipped off another driver in the latest documents. “The other driver aggressively pursued him in his car, bringing his car so close that he was afraid the other driver would hit him and cause an accident,” the documents allege. “I was so alarmed that Jesse exposed our children to danger, unpredictability of the situation and aggression with two vehicles, knowing that this person lives directly next door and we have to encounter him regularly. Jesse knows this neighbor and his state-of-mind.”\n\nAnother reason for Drake-Lee’s request is that she doesn’t want Williams introducing the kids to his sexual partners. “Another factor in their stability is to prevent the children from seeing a revolving door of intimate partners,” the documents claim. “Jesse has shared his time with the children with intimate partner(s).”\n\nAs Us Weekly exclusively revealed in July, the Cabin the Woods actor has been dating Minka Kelly for several months. “They’re legit,” a source told Us.\n\nThe Band Aid star recently addressed his split and shut down cheating rumors in Jay-Z’s “Footnotes” video for his “4:44” track. “I was in a relationship 13 years, 13 real years, not five years, not seven years, 13 years,” Williams said in the video, “and all of a sudden motherf–kers are writing think-pieces that I somehow threw a 13-year relationship — like the most painful experience I’ve had in my life, like with a person I’ve loved with all of my heart — that I threw a person and my family in the trash because a girl I work with is cute.”\n\nUPDATE: Williams’ rep has released a statement to Us, saying, “These are\n\nmatters for the court to decide. Jesse has been working tirelessly to\n\nmaintain his bond with their children and it is important to note that\n\nthe dramatizations made in Aryn’s declaration are a one-sided account\n\nmade with a specific goal in mind. The judge is fully informed on both\n\nsides of the story and will be making the final decision.”", "images": ["https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered-green.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/bg-subscribe.png", "https://www.usmagazine.com/wp-content/uploads/2020/04/Screen-Shot-2020-04-09-at-11.48.30-AM.png?w=100&h=100&crop=1", "https://i2.wp.com/www.usmagazine.com/wp-content/uploads/jesse-williams-and-aryn-drake-lee-eea2023e-c6f6-4984-aadf-2cc2147ce00c.jpg?crop=0px%2C0px%2C1800px%2C1012px&resize=200%2C113&ssl=1", "https://www.usmagazine.com/wp-content/uploads/2020/04/woman-eating-bar1-1.jpg?w=100&h=100&crop=1", "https://i2.wp.com/www.usmagazine.com/wp-content/uploads/jesse-williams-and-aryn-drake-lee-eea2023e-c6f6-4984-aadf-2cc2147ce00c.jpg?crop=0px%2C0px%2C1800px%2C944px&resize=1200%2C630&ssl=1", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/icon-download.svg", "https://www.usmagazine.com/wp-content/uploads/2020/04/shutterstock_1701843913-1.jpg?w=100&h=100&crop=1"], "top_img": "https://i2.wp.com/www.usmagazine.com/wp-content/uploads/jesse-williams-and-aryn-drake-lee-eea2023e-c6f6-4984-aadf-2cc2147ce00c.jpg?crop=0px%2C0px%2C1800px%2C944px&resize=1200%2C630&ssl=1", "keywords": [], "authors": ["Megan French"], "canonical_link": "https://www.usmagazine.com/celebrity-news/news/jesse-williams-estranged-wife-aryn-drake-lee-requests-sole-custody-of-kids-w497967/", "title": "Jesse Williams’ Estranged Wife Aryn Drake-Lee Requests Sole Legal Custody of Kids", "meta_data": {"viewport": "width=device-width, initial-scale=1", "ir-site-verification-token": "-206090124", "fo-verify": "49e6fc6a-c68d-447f-9978-70e3eac455ac", "msvalidate.01": "097DBAAF43A9B61E9E4259AA7D75B069", "description": "Jesse Williams’ estranged wife, Aryn Drake-Lee, is requesting sole legal custody of the kids, claiming he put the kids in a dangerous driving situation and has a ‘revolving door’ of women around the children — read more", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Jesse Williams’ Estranged Wife Requests Sole Legal Custody of Kids", "description": "Jesse Williams’ estranged wife, Aryn Drake-Lee, is requesting sole legal custody of the kids, claiming he put the kids in a dangerous driving situation and has a ‘revolving door’ of women around the children — read more", "url": "https://www.usmagazine.com/celebrity-news/news/jesse-williams-estranged-wife-aryn-drake-lee-requests-sole-custody-of-kids-w497967/", "site_name": "Us Weekly", "updated_time": "2018-02-08T21:40:47+00:00", "image": {"identifier": "https://i2.wp.com/www.usmagazine.com/wp-content/uploads/jesse-williams-and-aryn-drake-lee-eea2023e-c6f6-4984-aadf-2cc2147ce00c.jpg?crop=0px%2C0px%2C1800px%2C944px&resize=1200%2C630&ssl=1", "secure_url": "https://i2.wp.com/www.usmagazine.com/wp-content/uploads/jesse-williams-and-aryn-drake-lee-eea2023e-c6f6-4984-aadf-2cc2147ce00c.jpg?crop=0px%2C0px%2C1800px%2C944px&resize=1200%2C630&ssl=1", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/UsWeekly", "section": "Celebrity News", "published_time": "2017-08-17T20:35:00+00:00", "modified_time": "2018-02-08T21:40:47+00:00"}, "fb": {"app_id": 1785612128341436}, "twitter": {"card": "summary_large_image", "description": "Jesse Williams’ estranged wife, Aryn Drake-Lee, is requesting sole legal custody of the kids, claiming he put the kids in a dangerous driving situation and has a ‘revolving door’ of women around the children — read more", "title": "Jesse Williams’ Estranged Wife Requests Sole Legal Custody of Kids", "site": "@usweekly", "image": "https://i2.wp.com/www.usmagazine.com/wp-content/uploads/jesse-williams-and-aryn-drake-lee-eea2023e-c6f6-4984-aadf-2cc2147ce00c.jpg?crop=0px%2C0px%2C1800px%2C944px&resize=1200%2C630&ssl=1", "creator": "@usweekly"}, "generator": "WordPress 5.4"}, "movies": [], "publish_date": 1503002100.0, "source": "https://www.usmagazine.com", "summary": ""}