{"url": "en.wikipedia.org/wiki/Prince_Harry,_Duke_of_Sussex", "text": "Duke of Sussex\n\nDuke of Sussex (more)\n\nPrince Harry, Duke of Sussex,[fn 2] (Henry Charles Albert David;[fn 1] 15 September 1984)[1] is the younger son of Charles, Prince of Wales and Diana, Princess of Wales and is sixth in the line of succession to the British throne.\n\nHarry was educated at Wetherby School, Ludgrove School, and Eton College. He spent parts of his gap year in Australia and Lesotho. He then underwent officer training at the Royal Military Academy Sandhurst. He was commissioned as a cornet (second lieutenant) into the Blues and Royals, serving temporarily with his brother Prince William, and he completed his training as a troop leader. In 2007–08, he served for over ten weeks in Helmand, Afghanistan, but was pulled out after an Australian magazine revealed his presence there. He returned to Afghanistan for a 20-week deployment in 2012–13 with the Army Air Corps. He left the army in June 2015.\n\nHarry launched the Invictus Games in 2014 and remains patron of its foundation. He also gives patronage to several other organisations, including the HALO Trust, the London Marathon Charitable Trust, and Walking With The Wounded.[2] On 19 May 2018, he married American actress Meghan Markle. Hours before the wedding, his grandmother Queen Elizabeth II made him Duke of Sussex. The couple's son Archie Mountbatten-Windsor was born on 6 May 2019. In January 2020, the couple announced their intention to step back as senior members of the royal family and split their time between the UK and North America.\n\nEarly life\n\nHarry was born in the Lindo Wing of St Mary's Hospital in Paddington, London, on 15 September 1984 at 4:20 pm as the second child of Charles, Prince of Wales—heir apparent to Queen Elizabeth II—and Diana, Princess of Wales.[3][4][fn 3] He was baptised with the names Henry Charles Albert David, on 21 December 1984, at St George's Chapel, Windsor Castle, by the Archbishop of Canterbury, Robert Runcie.[fn 4]\n\nHis parents announced their second son's name would officially be Prince Henry Charles Albert David, but that he would be known as Harry to his family and friends. As the prince grew up, he was referred to by Kensington Palace, and therefore the Press and the public at large, as Prince Harry.[10] As a son of the Prince of Wales, he was called Prince Henry of Wales. Diana wanted Harry and his older brother, Prince William, to have a broader range of experiences and a better understanding of ordinary life than previous royal children. She took them to venues that ranged from Walt Disney World and McDonald's to AIDS clinics and homeless shelters.[11] Harry began accompanying his parents on official visits at an early age; his first overseas tour was with his parents to Italy in 1985.[12]\n\nHarry's parents divorced in 1996. His mother died in a car crash in Paris the following year. Harry and William were staying with their father at Balmoral at the time, and the Prince of Wales told his sons about their mother's death.[13] At his mother's funeral, Harry, then 12, accompanied his father, brother, paternal grandfather, and maternal uncle, Charles Spencer, 9th Earl Spencer, in walking behind the funeral cortège from Kensington Palace to Westminster Abbey.[14] In a 2017 interview with The Daily Telegraph, the prince acknowledged that he sought counselling after two years of \"total chaos\" while struggling to come to terms with the death of his mother.[15]\n\nEducation\n\nLike his father and brother, Harry was educated at independent schools. He started at London's Jane Mynors' nursery school and the pre-preparatory Wetherby School.[16] Following this, he attended Ludgrove School in Berkshire. After passing the entrance exams, he was admitted to Eton College. The decision to place Harry at Eton went against the past practice of the Mountbatten-Windsors to send children to Gordonstoun, which Harry's grandfather, father, two uncles, and two cousins had attended. It did, however, see Harry follow in the Spencer family footsteps, as both Diana's father and brother attended Eton.[11]\n\nIn June 2003, Harry completed his education at Eton with two A-Levels,[17] achieving a grade B in art and D in geography, having decided to drop history of art after AS level.[18] He excelled in sports, particularly polo and rugby union.[19] One of Harry's former teachers, Sarah Forsyth, has asserted that Harry was a \"weak student\" and that staff at Eton conspired to help him cheat on examinations.[20][21] Both Eton and Harry denied the claims.[20][22] While a tribunal made no ruling on the cheating claim, it \"accepted the prince had received help in preparing his A-level 'expressive' project, which he needed to pass to secure his place at Sandhurst.\"[20][23]\n\nAfter school, Harry took a gap year, during which he spent time in Australia working (as his father had done in his youth) on a cattle station, and participating in the Young England vs Young Australia Polo Test match.[24] He also travelled to Lesotho, where he worked with orphaned children and produced the documentary film The Forgotten Kingdom.[11]\n\nMilitary career\n\nSandhurst; Blues and Royals; deployment to Afghanistan\n\nOfficer Cadet Wales (standing to attention next to the horse) on parade at Sandhurst , 21 June 2005\n\nHarry entered the Royal Military Academy Sandhurst on 8 May 2005, where he was known as Officer Cadet Wales, and joined the Alamein Company.[25] In April 2006, Harry completed his officer training and was commissioned as a Cornet (second lieutenant) in the Blues and Royals, a regiment of the Household Cavalry in the British Army. On 13 April 2008, when he reached two years' seniority, Harry was promoted to lieutenant.[26]\n\nIn 2006, it was announced that Harry's unit was scheduled to be deployed in Iraq the following year. A public debate ensued as to whether he should serve there. Defence Secretary John Reid said that he should be allowed to serve on the front line of battle zones. Harry agreed saying, \"If they said 'no, you can't go front line' then I wouldn't drag my sorry ass through Sandhurst and I wouldn't be where I am now.\"[27] The Ministry of Defence and Clarence House made a joint announcement on 22 February 2007 that Harry would be deployed with his regiment to Iraq, as part of the 1st Mechanised Brigade of the 3rd Mechanised Division – a move supported by Harry, who had stated that he would leave the army if he was told to remain in safety while his regiment went to war.[28] He said: \"There's no way I'm going to put myself through Sandhurst and then sit on my arse back home while my boys are out fighting for their country.\"[29]\n\nThe head of the British army at the time, General Sir Richard Dannatt, said on 30 April 2007 that he had personally decided that Harry would serve with his unit in Iraq,[30] and Harry was scheduled for deployment in May or June 2007, to patrol the Maysan Governorate.[31] By 16 May, however, Dannatt announced that Harry would not serve in Iraq;[32] concerns included Harry being a high-value target (as several threats by various groups had already been made against him) and the dangers the soldiers around him would face should any attempt be made on his life or if he was captured. Clarence House made public Harry's disappointment with the decision, though he said he would abide by it.[33]\n\nIn early June 2007, it was reported that Harry had arrived in Canada to train alongside soldiers of the Canadian Forces and British Army, at CFB Suffield, near Medicine Hat, Alberta. It was said that this was in preparation for a tour of duty in Afghanistan, where Canadian and British forces were participating in the NATO-led Afghan War.[34]\n\nThis was confirmed in February of the following year, when the British Ministry of Defence revealed that Harry had been secretly deployed as a Forward Air Controller to Helmand Province in Afghanistan for the previous ten weeks.[35][36] The revelation came after the media – notably, German newspaper Bild and Australian magazine New Idea[37][38] – breached the blackout placed over the information by the Canadian and British authorities.[39] It was later reported that Harry helped Gurkha troops repel an attack from Taliban insurgents,[40] and performed patrol duty in hostile areas while in Afghanistan.[41][42][43]\n\nHis tour made Harry the first member of the British royal family to serve in a war zone since his uncle, Prince Andrew, who flew helicopters during the Falklands War. For his service, his aunt, Princess Anne, presented Harry with an Operational Service Medal for Afghanistan at the Combermere Barracks in May 2008.[44]\n\nArmy Air Corps and second deployment to Afghanistan\n\nIn October 2008, it was announced that Harry was to follow his brother, father and uncle in learning to fly military helicopters. After passing the initial aptitude test, he was to undertake a month-long course; if he passed that, he would begin full flight training in early 2009.[45]\n\nHarry had to pass his flying assessment at the Army Air Corps Base (AAC), Middle Wallop, the result of which would determine whether he would continue on to train as a pilot of the Apache, Lynx, or Gazelle helicopter.[46] Having reached the requisite standard, Harry attended the Defence Helicopter Flying School at RAF Shawbury, where he joined his brother.[47]\n\nPrince Charles presented him with his flying brevet (wings) on 7 May 2010 at a ceremony at the Army Air Corps Base (AAC), Middle Wallop. Harry had let it be known he intended to fly Apache attack helicopters if he was successful in passing the rigorous Apache training course. This would allow him to see active military service again on the frontline in Afghanistan.[48]\n\nOn 10 March 2011, it was revealed that Harry had passed his Apache flying test and he was awarded his Apache Flying Badge on 14 April 2011.[49] There was speculation he would return to Afghanistan before the withdrawal in 2015. On 16 April 2011, it was announced that Harry had been promoted to captain.[50]\n\nIn June 2011, Clarence House announced that on completion of his training conversion course to use Apache helicopters in the war arena, Harry would be available for deployment, including in current operations in Afghanistan, as an Apache helicopter pilot. The final decision rested with the Ministry of Defence's senior commanders, including principally the Chief of the Defence Staff in consultation with the wishes of Harry, the Prince of Wales, and the Queen.[51] In October, he was transferred to a US military base in California to complete his helicopter gunship training.[52] This final phase included live-fire training and \"environmental and judgment training\" at naval and air force facilities in California and Arizona. Most of those completing the two-month Apache training were deployed to the front lines in Afghanistan.[53] In the same month, it was reported that Harry was said to be a natural pilot who was top of his class in the extensive training he had undertaken at the Naval Air Facility, El Centro, California;[54] while training in Southern California, he spent time in San Diego.[55] In November 2011, Harry returned to England. He went to Wattisham Airfield in Suffolk, in the east of England, to complete his training to fly Apache helicopters.[56]\n\nOn 7 September 2012, Harry arrived at Camp Bastion in southern Afghanistan as part of the 100-strong 662 Squadron, 3 Regiment, Army Air Corps,[57] to begin a four-month combat tour as a co-pilot and gunner for an Apache helicopter.[58] On 10 September, within days of arriving in Afghanistan, it was reported that the Taliban had threatened his life. Taliban spokesman Zabiullah Mujahid spoke to Reuters and was quoted as saying: \"We are using all our strength to get rid of him, either by killing or kidnapping.\" He added, \"We have informed our commanders in Helmand to do whatever they can to eliminate him.\"[59]\n\nOn 21 January 2013, it was announced that Harry was returning from a 20-week deployment in Afghanistan,[60] where he served as an Apache co-pilot/gunner. On 8 July 2013, the Ministry of Defence announced that Harry had successfully qualified as an Apache aircraft commander.[61] Harry compared operating the Apache's weapons systems in Afghanistan to playing video games.[62][63]\n\nHQ London District and Invictus Games\n\nOn 17 January 2014, the Ministry of Defence announced that Harry had completed his attachment to 3 Regiment Army Air Corps, and would take up a staff officer role, SO3 (Defence Engagement), in HQ London District. His responsibilities would include helping to co-ordinate significant projects and commemorative events involving the Army in London. He was based at Horse Guards in central London.[64]\n\nOn 6 March 2014, Harry launched Invictus Games, a Paralympic-style sporting event for injured servicemen and women, which was held on 10–14 September 2014.[65] Harry met British hopefuls for the Invictus Games at Tedworth House in Wiltshire for the start of the selection process on 29 April 2014.[66] On 15 May 2014, Harry attended a ticket sale launch for Invictus Games at BT Tower, from where he tweeted on the Invictus Games' official Twitter account as the president of the Games.[67] To promote the Games, he was interviewed by BBC Radio 2's Chris Evans along with two Invictus Games hopefuls. He said: \"This (Invictus Games) is basically my full-time job at the moment, making sure that we pull this off.\" The show aired on 31 July 2014.[68] Harry later wrote an article in The Sunday Times about his experiences in Afghanistan: how they had inspired him to help injured personnel and how, after the trip to the Warrior Games, he had vowed to create the Invictus Games.[69] Harry and officials attended the British Armed Forces Team announcement for Invictus Games at Potters Field Park in August 2014.[70][71] As president of the Invictus Games, he attended all events related to the Games from 8 to 14 September 2014.[72]\n\nIn January 2015, it was reported that Harry would take a new role in supporting wounded service personnel by working alongside members of the London District's Personal Recovery Unit for the MOD's Defence Recovery Capability scheme to ensure that wounded personnel have adequate recovery plans. The palace confirmed weeks later[73] that the scheme was established in partnership with Help for Heroes and the Royal British Legion.[74]\n\nIn late January 2015, Harry visited The Battle Back Centre[75] set up by the Royal British Legion, and Fisher House UK at the Queen Elizabeth Hospital Birmingham. A partnership between Help for Heroes, the Fisher House Foundation and the Queen Elizabeth Hospital Birmingham (QEHB) Charity created the Centre.[76] Fisher House Foundation is one of the Invictus Games' sponsors.[77]\n\nIn February and March 2015, Harry visited Phoenix House in Catterick Garrison, North Yorkshire, a recovery centre run by Help for Heroes. He also visited Merville Barracks in Colchester, where Chavasse VC House Personnel Recovery Centre is located, run by Help for Heroes in partnership with the Ministry of Defence and Royal British Legion.[78]\n\nSecondment to Australian Defence Force and end of active service\n\nOn 17 March 2015, Kensington Palace announced that Harry would leave the Armed Forces in June.[79] Before then, he would spend four weeks throughout April and May at army barracks in Darwin, Perth and Sydney whilst seconded to the Australian Defence Force (ADF). After leaving the Army, while considering his future, he would return to work in a voluntary capacity with the Ministry of Defence, supporting Case Officers in the Ministry's Recovery Capability Programme. He would be working with both those who administer and receive physical and mental care within the London District area.[80][81]\n\nOn 6 April 2015, Harry reported for duty to Australia's Chief of the Defence Force, Air Chief Marshal Mark Binskin at the Royal Military College, Duntroon in Canberra, Australia.[82] Harry flew to Darwin later that day to begin his month-long secondment to the ADF's 1st Brigade. His visit included detachments to NORFORCE as well as to an aviation unit.[83] While in Perth, he trained with Special Air Service Regiment (SASR), participating in the SASR selection course, including a fitness test and a physical training session with SASR selection candidates. He also joined SASR members in Perth for live-fire shooting exercises with numerous Special Forces weapons at a variety of ranges. Harry completed an insertion training exercise using a rigid-hull inflatable boat. In Sydney, he undertook urban operations training with the 2nd Commando Regiment. Training activities included remotely detonating an Improvised Explosive Device (IED) and rappelling from a building. He also spent time flying over Sydney as co-pilot of an Army Black Hawk helicopter and participated in counter-terrorism training in Sydney Harbour with Royal Australian Navy clearance divers.[84]\n\nHarry's attachment with the ADF ended on 8 May 2015,[85] and on 19 June 2015 he resigned his short service commission.[86][87]\n\nPost-active service\n\nSince leaving active service with the army, Harry has been closely involved with the armed forces through the Invictus Games, honorary military appointments and other official engagements. On 19 December 2017, he succeeded his grandfather Prince Philip as the Captain General of the Royal Marines.[88] In May 2018, he was promoted to the substantive ranks of Lieutenant Commander of the Royal Navy, Major of the British Army and Squadron Leader of the Royal Air Force.[89]\n\nPersonal life\n\nHarry (right) talking to an opponent during a volleyball competition between American and British injured soldiers, 13 May 2013\n\nHarry enjoys playing many sports, including competitive polo, skiing, and motocross.[24] He is a supporter of Arsenal Football Club.[90] Harry is also a keen Rugby football fan and supported England's bid to host rugby union's 2015 Rugby World Cup,[91] and presented the trophy at rugby league's 2019 Challenge Cup finals.[92]\n\nIn his youth Harry earned a reputation for being rebellious, leading the tabloid press to label him a \"wild child\".[93] At age 17 he was seen smoking cannabis, drinking underage with friends, and clashing physically with paparazzi outside nightclubs.[93] He was photographed at Highgrove House at a \"Colonial and Native\" themed costume party wearing a Nazi German Afrika Korps uniform with a swastika armband.[94] He later issued a public statement apologising for his behaviour.[95]\n\nIn January 2009, the British tabloid, the News of the World, revealed a video made by Harry three years earlier in which he referred to a Pakistani fellow officer cadet as \"our little Paki friend\" and called a soldier wearing a cloth on his head a \"raghead\". These terms were described by Leader of the Opposition David Cameron as \"unacceptable\", and by The Daily Telegraph as \"racist\". A British Muslim youth organisation called Harry a \"thug\".[97] Clarence House immediately issued an apology from Harry, who stated that no malice was intended in his remarks.[98] Former British MP and Royal Marine, Rod Richards, said that such nicknames were common amongst military comrades, stating \"in the Armed Forces people often used to call me Taffy. Others were called Yankie, Oz or Kiwi or whatever. I consider Paki as an abbreviation for Pakistani. I don't think on this occasion it was intended to be offensive.\"[99]\n\nWhile on holiday in Las Vegas in August 2012, Harry and an unknown young woman were photographed naked in a Wynn Las Vegas hotel room, reportedly during a game of strip billiards. The pictures were leaked by American celebrity website TMZ on 21 August 2012,[100] and reported worldwide by mainstream media on 22 August 2012.[101][102][103] The photographs were shown by the American media, but British media were reluctant to publish them.[104] Royal aides suggested Clarence House would contact the Press Complaints Commission (PCC) if British publications used the pictures.[105] St James's Palace confirmed that Harry was in the photographs, saying that he was essentially a victim whose privacy had been invaded and contacted the PCC upon hearing that a number of British newspapers were considering publishing the photographs.[106] On 24 August 2012, The Sun newspaper published the photographs.[107]\n\nPolls conducted in the United Kingdom in November 2012 showed Harry to be the third-most popular member of the royal family, after William and the Queen.[108]\n\nBachelorhood\n\nChelsy Davy, the daughter of Zimbabwean, South Africa-based businessman Charles Davy, was referred to as Harry's girlfriend in an interview conducted for his 21st birthday, and Harry said he \"would love to tell everyone how amazing she is but once I start talking about that, I have left myself open.... There is truth and there is lies and unfortunately I cannot get the truth across.\"[109] Davy, who is a businesswoman and lawyer, was present when Harry received his Operational Service Medal for Afghanistan[44] and also attended his graduation ceremony when he received his flying wings from his father.[48] In early 2009, it was reported the pair had parted ways after a relationship that had lasted for five years.[110]\n\nIn May 2012, Harry was introduced to Cressida Bonas, an actress and model who is granddaughter of Edward Curzon, 6th Earl Howe, by his cousin Princess Eugenie.[111] On 30 April 2014, it was reported that the couple had parted amicably.[112]\n\nMarriage and fatherhood\n\nPrince Harry and Markle attending church at Sandringham on Christmas Day, 2017\n\nOn 8 November 2016, Kensington Palace confirmed that Harry was \"a few months\" into a relationship with American actress Meghan Markle, in a statement from the prince asking for the \"abuse and harassment\" of Markle and her family to end.[113] In September 2017, they made their first public appearance at an official royal engagement, the opening ceremonies of the Invictus Games in Toronto.[114][115]\n\nOn 27 November 2017, Clarence House and Kensington Palace announced that Harry and Markle were engaged.[116] The engagement announcement prompted much comment about the possible social significance of Meghan Markle becoming a mixed-race[117] royal.[118][119][120][121] The couple married at St George's Chapel, Windsor Castle, on 19 May 2018.[122][123]\n\nThe Duke and Duchess initially lived at Nottingham Cottage in London, on the grounds of Kensington Palace.[124] The couple later moved to the more than two-centuries-old Frogmore Cottage in the Home Park of Windsor Castle.[125][126] The Crown Estate refurbished the cottage at a cost of £2.4 million, paid out of the Sovereign Grant, with the couple picking up expenses beyond restoration and ordinary maintenance.[127][128] Their office was moved to Buckingham Palace.[129]\n\nOn 6 May 2019, the couple's first child Archie Mountbatten-Windsor was born, who is seventh in line to the throne.[130]\n\nWealth and inheritance\n\nAt the time of the announcement of Harry and Meghan's decision to \"step back\" as senior members of the royal family in 2020, 95% of the couple's income derived from the £2.3 million given to them annually by Harry's father, Charles, as part of his income from the Duchy of Cornwall.[131]\n\nHarry and his brother William inherited the \"bulk\" of the £12.9 million left by their mother on their respective 30th birthdays, a figure that had grown since her 1997 death to £10 million each in 2014.[132][133] In 2002 The Times reported that Harry and William would also share a payment of £4.9 million from trust funds established by their great-grandmother, Queen Elizabeth The Queen Mother, on their respective 21st birthdays and would share a payment of £8 million upon their respective 40th birthdays.[134] Harry's personal wealth was estimated at £30 million by The Daily Telegraph in 2020.[131]\n\nIn 2014 Harry and William inherited their mother's wedding dress along with many other of her personal possessions including dresses, diamond tiaras, jewels, letters, and paintings. The brothers also received the original lyrics and score of \"Candle in the Wind\" by Bernie Taupin and Elton John as performed by John at Diana's funeral.[133]\n\nPublic life\n\nOn 6 January 2009, the Queen granted Harry and William their own royal household. Previously, William and Harry's affairs had been handled by their father's office at Clarence House in central London. The new household released a statement announcing they had established their own office at nearby St James's Palace to look after their public, military and charitable activities.[135]\n\nIn March 2012, Harry led an official visit to Belize as part of the Queen's Diamond Jubilee celebrations.[136] He continued to the Bahamas and Jamaica, where the Prime Minister, Portia Simpson-Miller, was considering initiating a process of turning Jamaica into a republic.[137] He then visited Brazil to attend the GREAT Campaign.[138]\n\nBetween 9 and 15 May 2013, he made an official visit to the United States. The tour promoted the rehabilitation of injured American and UK troops, publicised his own charities and supported British interests. It included engagements in Washington, DC, Colorado, New York, New Jersey, and Connecticut. He met survivors of Hurricane Sandy in New Jersey.[139][140] In October 2013, he undertook his first official tour of Australia, attending the International Fleet Review at Sydney Harbour.[141] He also paid a visit to the Australian SAS HQ in Perth.[142]\n\nIn May 2014, he visited Estonia and Italy. In Estonia, he visited Freedom Square in the capital Tallinn to honour fallen Estonian soldiers. He also attended a reception at the Estonian Parliament[143] and a NATO military exercise.[144] In Italy, Harry attended commemorations of the 70th anniversary of the Monte Cassino battles, in which Polish, Commonwealth and British troops fought.[145][146] On 6 November 2014, he opened the Field of Remembrance at Westminster Abbey,[147] a task usually performed by Prince Philip.[148]\n\nBefore reporting for duty to the Australian Defence Force (ADF), Harry visited the Australian War Memorial in Canberra on 6 April 2015.[82] On 7 May 2015, he made a farewell walkabout at the Sydney Opera House and visited Macquarie University Hospital.[149][150] On 24–25 April 2015, he joined his father in Turkey to attend commemorations of the centenary of the Gallipoli Campaign.[151]\n\nFrom 30 November to 3 December 2015, he made an official visit to South Africa.[152] He visited Cape Town, where he presented the insignia of the Order of the Companions of Honour to the Archbishop on behalf of the Queen.[153]\n\nHe visited Nepal 19–23 March 2016.[154] He stayed until the end of March 2016 to help rebuild a secondary school with Team Rubicon UK, and visited a Hydropower Project in Central Nepal.[155]\n\nIn April 2018, he was appointed Commonwealth youth ambassador.[156] Also that month, Harry became a patron of Walk of America, a campaign which brings together a number of veterans who will take part in a 1,000-mile expedition across the US in mid-2018.[157][158] The Prince was appointed the president of the Queen's Commonwealth Trust, which focuses on projects involving children and welfare of prisoners, in April.[159] Also in April 2018, Harry was selected as one of the 100 Most Influential People in the World by Time magazine.[160]\n\nIn April 2019, it was announced that he was working on a documentary series about mental health together with Oprah Winfrey, which is set to air in 2020 on Apple TV+. He will serve as co-creator and executive producer for the series.[161]\n\nThe Sussexes' discontent with their public roles and media scrutiny grew in 2019.[162] In May 2019, Splash News issued a formal apology to Harry and his wife for sending photographers to their Cotswolds residence, which put their privacy at risk. The agency also agreed to pay a \"substantial\" sum of damages and legal costs associated with the case.[163][164] At the end of their tour of Southern African countries in September–October 2019, Harry issued a statement mentioning that his wife was \"one of the latest victims of a British tabloid press\".[165] Later in October, it was announced that Harry had sued The Sun, the Daily Mirror and the now-defunct News of the World \"in relation to alleged phone-hacking\".[166] On 30 January 2020, the Independent Press Standards Organisation sided with the Mail on Sunday over a dispute between the Duke and the newspaper over an Instagram photo involving Harry in which, according to the newspaper, elephants were in fact \"tranquilized\" and \"tethered\" during a relocating process. The IPSO rejected Harry's claim that the paper's description was \"inaccurate\" or \"misleading\".[167]\n\nIn January 2020, the Duke and Duchess announced that they were stepping back from their role as senior members of the royal family, and would balance their time between the United Kingdom and North America.[168] The couple also announced that they would seek financial independence while continuing to support their charities and assist the Queen in royal duties.[169] In the same month, the couple's lawyers issued a legal warning to the press after paparazzi photos of Meghan and their son in Canada were published in the media.[170] In March 2020, Harry attended the opening of the Silverstone Experience in Silverstone Circuit together with racing driver Lewis Hamilton. Harry's appearance at the museum was his final solo engagement as a senior royal before he and his wife officially stepped down on 31 March.[171]\n\nCivic and philanthropic work\n\nSentebale\n\nAt the age of 21, Harry was appointed a Counsellor of State and began his duties in that capacity. In 2006, he was in Lesotho to visit Mants'ase Children's Home near Mohale's Hoek, which he first toured in 2004. Along with Prince Seeiso of Lesotho, he launched Sentebale: The Princes' Fund for Lesotho, a charity to aid children orphaned by HIV/AIDS. He has granted his patronage to organisations including WellChild, Dolen Cymru, and MapAction.[172]\n\nOn 26 November 2015, as patron of Sentebale, Harry travelled to Lesotho to attend the opening of the Mamohato Children's Centre.[173] Two days later Harry played the Sentebale Royal Salute Polo Cup, at Val de Vie Estate in Cape Town, South Africa, fundraising for Sentebale.[174]\n\nSport\n\nSport has been a way that Harry has helped charities and other organisations. This has included training as a Rugby Development Officer for the Rugby Football Union in 2004 and coaching students in schools to encourage them to learn the sport. He is the patron of the Rugby Football League, Rugby League's governing body in England.[175] Like his brother and father, he has participated in polo matches to raise money for charitable causes.[24][176]\n\nPrince Harry discusses the topic of post-traumatic stress during the 2016 Invictus Games Symposium on Invisible Wounds with former US president George W. Bush , two veterans and moderator Jeremy Schaap\n\nIn 2012, together with the Duke and Duchess of Cambridge, Harry launched Coach Core. The program was set up following the 2012 Olympics and provides apprenticeship opportunities for people who desire to pursue a career as a professional coach.[177] As patron of Walk of Britain, he walked with the team on 30 September[178] and 20 October 2015.[179] On 28 October 2015, he carried out one day of engagements in the US. He launched the Invictus Games Orlando 2016 with First Lady Michelle Obama and Dr. Jill Biden at Fort Belvoir.[180] He later attended an Invictus Games board meeting and a reception to celebrate the launch at the British Ambassador's Residence.[181]\n\nIn June 2019, the Duke was present at the launch of Made by Sport, a charity coalition set to raise money to boost sport in disadvantaged communities. In his statement, he lent his support to the charity by arguing that its role in bringing sport into the life of disadvantaged people would save \"hundreds of millions of pounds\" towards treating the issues among young people.[182] In February 2020, Harry recorded a new version of the song \"Unbroken\" with Jon Bon Jovi. The new version features backing vocals from members of the Invictus Choir.[183] The song was released on 27 March 2020, the proceeds of which were donated to the Invictus Games Foundation.[184]\n\nThe Royal Foundation\n\nIn September 2009, William and Harry set up The Foundation of Prince William and Prince Harry to enable the princes to take forward their charitable ambitions.[185][186][187] In June 2019, it was announced that the Duke and Duchess of Sussex would split from the charity and establish their own charity foundation by the end of 2019. The couples will reportedly collaborate on mutual projects, such as the mental health initiative Heads Together.[188][189] In July 2019, Harry and Meghan's new charity was registered in England and Wales under the title \"Sussex Royal The Foundation of The Duke and Duchess of Sussex\".[190] However, on 21 February 2020 it was confirmed that \"Sussex Royal\" would not be used as a brand name for the couple following their withdrawal from public life.[191] In April 2020, responding to inquiries from The Telegraph, the couple confirmed their new foundation would be called \"Archewell\".[192] The name stems from the Greek word \"arche\", which means \"source of action\"; it is the same word that inspired the name of the couple's son, Archie.[192]\n\nHIV/AIDS\n\nTo raise awareness for HIV testing, Harry took a test live on the royal family Facebook page on 14 July 2016.[193] He later attended the 21st International AIDS Conference in Durban, South Africa, on 21 July 2016.[194][195] On World Aids Day, Harry and Rihanna helped publicise HIV testing by taking the test themselves.[196] Since 2016, Harry has been working with Terrence Higgins Trust to raise awareness about HIV and sexual health.[197][198]\n\nIn July 2018, the Elton John AIDS Foundation announced that the Duke of Sussex and British singer Elton John were about to launch a global coalition called MenStar that would focus \"on treating HIV infections in men\".[199][200] During his trip to Angola in 2019, the Duke visited the Born Free to Shine project in Luanda, an initiative by First Lady Ana Dias Lourenço which aims to \"prevent HIV transmission from mothers to babies\" through education, medical testing and treatment. He also met HIV+ youth and teenagers during his visit.[201] In November 2019, to mark the National HIV Testing Week, the Duke interviewed HIV+ Rugby player Gareth Thomas on behalf of the Terrence Higgins Trust.[202]\n\nNatural environment and climate change\n\nOn 27 December 2017, Harry was officially appointed the new president of African Parks, a conservation NGO.[203] He previously spent three weeks in Malawi with African Parks where he joined a team of volunteers and professionals to carry out one of the largest elephant translocations in history. The effort to repopulate areas decimated due to poaching and habitat loss moved 500 elephants from Liwonde and Majete National Parks to Nkhotakota Wildlife Reserve.[204]\n\nIn March 2019 Prince Harry gave a speech at WE Day UK, an annual event organised by We Charity to inspire young people to become more active towards global social and environmental change.[205] He discussed mental health, climate change and the importance of social participation.[206] Harry attended a Google summit in August 2019 and gave a speech on the importance of tackling climate change in Sicily. He explained that he and Meghan plan to have no more than 2 children to help sustain the environment.[207] Later that month, the Duke and Duchess of Sussex were criticised by environmental campaigners for using private jets regularly when taking their personal trips abroad, which would leave more carbon footprint per person compared to commercial planes. The criticism was in line with the reactions the royal family faced in June 2019, after it was revealed that they \"had doubled [their] carbon footprint from business travel.\"[208][209] In September, the Duke launched Travalyst during his visit to the Netherlands after two years of development. The initiative is set \"to encourage sustainable practices in the travel industry\" and \"tackle climate change and environmental damage\", in collaboration with a number of companies.[210]\n\nDuring his visit to the Luengue-Luiana National Park in Angola in September 2019, the Duke unveiled an initiative by the Queen's Commonwealth Canopy to help with protecting \"an ancient elephant migration route\" by proving safe passage for them in the forest.[211]\n\nTitles, styles, honours and arms\n\nThe Duke of Sussex's Monogram\n\nTitles and styles\n\n1984–2018: His Royal Highness Prince Henry of Wales\n\nPrince Henry of Wales 2018–present: His Royal Highness The Duke of Sussex In Scotland : The Earl of Dumbarton [212]\n\nThe Duke of Sussex\n\nOn the morning of his wedding[213] he was granted by the Queen the Dukedom of Sussex, in the Peerage of the United Kingdom, first conferred in 1801 upon Prince Augustus Frederick, the sixth son of King George III, referring to the English county. At the same time he was also granted two subsidiary titles, both also in the Peerage of the United Kingdom: Earl of Dumbarton, a recreated ancient title formerly in the Peerage of Scotland, and Baron Kilkeel, a new title providing the Prince with a nominal territorial link to Northern Ireland, one of the four constituent countries of the United Kingdom. He is usually known as Prince Harry.\n\nBefore his marriage, Harry used Wales as his surname for military purposes and was known as Captain Harry Wales in such contexts.[214]\n\nOn 4 June 2015, as part of the 2015 Special Honours, Harry was knighted by his grandmother, the Queen, for \"services to the sovereign\", being appointed a Knight Commander of the Royal Victorian Order (KCVO).[215]\n\nOn 18 January 2020, Buckingham Palace announced that, following their decision to step back from royal duties, from 31 March 2020 Harry and his wife have agreed not to use their Royal Highness styles, but as a British prince he will not be stripped of his style and titles.[216][217]\n\nMilitary ranks\n\nHonours\n\nOrders\n\nMedals\n\nThe prince wearing his medals, 2013\n\nForeign honours\n\nAppointments\n\nFellowships\n\nHonorary military appointments\n\nOn 18 January 2020 it was announced that all of Harry's honorary military appointments would be relinquished on 31 March 2020 in accordance with his wish to step back from his role as a senior royal.[216]\n\nHumanitarian awards\n\nHarry's charitable efforts have been recognised three times by the international community. In December 2010, the German charity Ein Herz für Kinder (\"A Heart for Children\") awarded him the Golden Heart Award, in recognition of his \"charitable and humanitarian efforts\".[231][232] On 7 May 2012, the Atlantic Council awarded him its Distinguished Humanitarian Leadership Award.[233] In August 2018, the Royal Canadian Legion granted him the 2018 Founders Award for his role in founding the Invictus Games.[234]\n\nArms\n\nAncestry\n\nAgnatically, Harry is a member of the House of Glücksburg, a cadet branch of the House of Oldenburg, one of Europe's oldest royal houses. Harry's paternal grandmother, Queen Elizabeth II, issued letters patent on 8 February 1960 declaring his father to be a member of the House of Windsor.[237]\n\nAncestors on Harry's father's side include most of the royal families of Europe,[237] and on his mother's side, the Earls Spencer.[238]\n\nSee also", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Royal_Standard_of_Prince_Harry%2C_Duke_of_Sussex.svg/50px-Royal_Standard_of_Prince_Harry%2C_Duke_of_Sussex.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Prince_Harry_%2817396840192%29.jpg/170px-Prince_Harry_%2817396840192%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Sound-icon.svg/45px-Sound-icon.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Coat_of_Arms_of_Harry%2C_Duke_of_Sussex.svg/220px-Coat_of_Arms_of_Harry%2C_Duke_of_Sussex.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/9/9a/Flag_of_Spain.svg/23px-Flag_of_Spain.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/a/ae/Flag_of_the_United_Kingdom.svg/23px-Flag_of_the_United_Kingdom.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Naval_Ensign_of_the_United_Kingdom.svg/23px-Naval_Ensign_of_the_United_Kingdom.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Prince_Harry_talks_to_an_injured_soldier.jpg/170px-Prince_Harry_talks_to_an_injured_soldier.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Saint_Patrick%27s_Saltire.svg/23px-Saint_Patrick%27s_Saltire.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Flag_of_the_Canadian_Army.svg/23px-Flag_of_the_Canadian_Army.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/a/ae/Flag_of_the_United_Kingdom.svg/24px-Flag_of_the_United_Kingdom.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Royal_Monogram_of_Prince_Harry%2C_Duke_of_Sussex.svg/130px-Royal_Monogram_of_Prince_Harry%2C_Duke_of_Sussex.svg.png", "http://upload.wikimedia.org/wikipedia/commons/3/35/Shoulder_Flash.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Prince_Harry%27s_medals.jpg/170px-Prince_Harry%27s_medals.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Harry_and_Meghan_on_Christmas_Day_2017_%28cropped%29.jpg/220px-Harry_and_Meghan_on_Christmas_Day_2017_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Prince_Henry_playing_volleyball.jpg/220px-Prince_Henry_playing_volleyball.jpg", "http://upload.wikimedia.org/wikipedia/commons/d/da/Royal_Victorian_Order_UK_ribbon.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Crown_of_Saint_Edward.svg/24px-Crown_of_Saint_Edward.svg.png", "http://upload.wikimedia.org/wikipedia/commons/7/7d/Queen_Elizabeth_II_Golden_Jubilee_Medal_ribbon.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Sound-icon.svg/20px-Sound-icon.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/66/OSM_for_Afghanistan_w_bar.svg/100px-OSM_for_Afghanistan_w_bar.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/Inspection-New-Colours.JPG/290px-Inspection-New-Colours.JPG", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Lancering_Invictus_Games_2020-7_%28cropped%29.jpg/220px-Lancering_Invictus_Games_2020-7_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Flag_of_Scotland.svg/23px-Flag_of_Scotland.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Flag_of_Jamaica.svg/23px-Flag_of_Jamaica.svg.png", "http://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/3/32/Lancering_Invictus_Games_2020-7_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Army_Air_Corps_brevet.jpg/250px-Army_Air_Corps_brevet.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/7/78/QEII_Diamond_Jubilee_Medal_ribbon.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Crown_of_Saint_Edward_Heraldry.svg/22px-Crown_of_Saint_Edward_Heraldry.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Canada_%28Pantone%29.svg/23px-Flag_of_Canada_%28Pantone%29.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Badge_of_the_House_of_Windsor.svg/100px-Badge_of_the_House_of_Windsor.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Prince_Harry%27s_signature.svg/125px-Prince_Harry%27s_signature.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Royal_Standard_of_Prince_Harry%2C_Earl_of_Dumbarton.svg/50px-Royal_Standard_of_Prince_Harry%2C_Earl_of_Dumbarton.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Prince_Harry_Trooping_the_Colour_cropped.JPG/170px-Prince_Harry_Trooping_the_Colour_cropped.JPG", "http://upload.wikimedia.org/wikipedia/en/thumb/b/be/Flag_of_England.svg/23px-Flag_of_England.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Coat_of_Arms_of_Harry%2C_Duke_of_Sussex.svg/120px-Coat_of_Arms_of_Harry%2C_Duke_of_Sussex.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/5/59/Flag_of_the_Royal_Marines.png/23px-Flag_of_the_Royal_Marines.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Bluetank.png/24px-Bluetank.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Flag_of_Great_Britain_%281707%E2%80%931800%29.svg/23px-Flag_of_Great_Britain_%281707%E2%80%931800%29.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Flag_of_the_British_Army.svg/23px-Flag_of_the_British_Army.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/cc/Air_Force_Ensign_of_the_United_Kingdom.svg/23px-Air_Force_Ensign_of_the_United_Kingdom.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Coronet_of_a_British_Duke.svg/80px-Coronet_of_a_British_Duke.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Prince_Harry_Speaks_at_the_Invictus_Games_Symposium.webm/220px--Prince_Harry_Speaks_at_the_Invictus_Games_Symposium.webm.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/3/32/Lancering_Invictus_Games_2020-7_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Prince_Harry,_Duke_of_Sussex", "title": "Prince Harry, Duke of Sussex", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/3/32/Lancering_Invictus_Games_2020-7_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}