{"url": "http://time.com/4503609/shia-labeouf-weird-behavior-timeline/", "text": "Most people were first introduced to Shia LaBeouf in 2000 when he starred in the Disney show Even Stevens. As Louis Stevens, the mischievous ne’er do well little brother of a perfectionist older sister, he seemed to fit right in with the glossy kids the channel was prepping for stardom.\n\nBut LaBeouf’s career has taken some interesting twists and turns in the intervening dozen-plus years, as he’s appeared in franchises like Transformers as well as prestigious indies, and then hit some controversial and legal snags and engaged in political protest.\n\n“The star is a by-product of the machine age,” he told ArtNet News in 2016, “a relic of modernist ideals, it’s outmoded.” So instead of playing by the script, LaBeouf has continually made choices that are, well, unusual. Think: performance art projects, cryptic interviews and swathes of time spent without bathing.\n\nHere’s a roundup of the actor’s enduring, awesome weirdness—and his evolving public art projects.\n\nJuly 2009: After LaBeouf was charged with a misdemeanor for criminal trespassing following his 21st birthday, he told David Letterman that he’d just been trying to buy some cigarettes at four in the morning. “I got really wasted in Chicago and ended up celebrating in Walgreens,” he says. He ended up making multiple late-night Walgreens visits, each of them involving a costume change. Ultimately, the store dropped the charges.\n\nDecember 2013: LaBeouf releases a short film online that viewers discover is a plagiarized enactment of a short story that was actually written by author Daniel Clowes, who is not credited. This incident kicks off LaBeouf’s notable phase of borrowing quotes, lines and works from other people. In a 2016 interview with ArtNet News, he cited this moment as transformational in terms of moving him introducing him to a future in performance art. “The idea of the ‘star’ could become a prime site for the formulation of new stances whose honesty might advance a more satisfying kind of affect,” he said. He apologized via Twitter to Clowes—but the tweets were all unattributed quotes themselves, too.\n\nFebruary 2014: LaBeouf wears a paper bag on his head as he walks the red carpet at the Cannes Film Festival for the premiere of his movie Nymphomaniac. The bag reads “I am not famous anymore” in large letters across his face.\n\nFebruary 2014: During a press conference to promote Nymphomaniac at the Berlin Film Festival, he delivers a cryptic line: “When the seagulls follow the trawler, it is because they think sardines will be thrown into the sea.” Then he stormed out. Journalists noted that the line is actually from a Manchester United football player named Eric Cantona, who reportedly said these same words before walking out of a news conference in 1995 after being convicted for assault.\n\nFebruary 2014: LaBeouf launches the #IAMSORRY project, in which he appears alone with that same paper bag over his head in a room in a Los Angeles art space. Visitors are allowed, one by one, to visit him and use a variety of props in their interactions, including a bottle of Jack Daniels. Afterward, LaBeouf said in an interview with Dazed that he had been raped by one of the visitors during the 5-day experiment. Afterward, his collaborators Turner and Rönkkö publicly noted that they “put a stop” to the incident when they became aware of it. No charges were pressed against the alleged perpetrator.\n\nJune 2014: During a Broadway performance of Cabaret, LaBeouf is escorted from the audience after allegedly engaging in disruptive behavior. (Witnesses say he went up on stage and grabbed at actor Alan Cumming.) He subsequently spends the night in jail, and eventually pled guilty to disorderly conduct.\n\nJune 2014: LaBeouf reportedly heads straight to an audition after spending his night in jail. The movie is War Dogs, directed by Jake Phillips—and the actor he’s auditioning with is current late-night host James Corden. (Ultimately, War Dogs would be made starring Jonah Hill and Miles Teller and released in 2016.) In the audition, LaBeouf reads his line while wearing his shoelaces dangling over his face. As Phillips later explained, the actor’s shoelaces had been removed during his jail stint. “So he was carrying his shoelaces, and he put them on his face because he was being weird and wanted to throw you off a little bit,” he told Corden in a later interview.\n\nJanuary 2015: In Sia’s music video for “Elastic Heart,” LaBeouf and dancer Maddie Ziegler don nude leotards and circle each other warily in a large metal bird cage. The pop singer later apologizes after some find the interaction between LeBeouf and Zieger potentially sexually suggestive, stating that the pair were the only two actors she felt could play “two warring ‘Sia’ self states.”\n\nMarch 2015: LaBeouf sets up a livestream of his heartbeat.\n\nMay 2015: Along with art students at Central St. Martins, LaBeouf films 30 minutes of seemingly improvisational acting in front of a green screen. The soundbites from the footage would become prime meme material. “Seen from a distance, almost everything looks beautiful,” he muses poetically. At one point, he yells: “Do it! Just do it! Don’t let your dreams be dreams!” This particular segment spawned a series of its own memes, his tough-love acting taking the Internet by storm.\n\nOctober 2015: LaBeouf was arrested for public intoxication while crossing the street in Austin, Texas, booked into the local jail for the night, and later released on his own recognizance.\n\nNovember 2015: He and a writer for Dazed magazine both don GoPro video cameras on their heads and sit filming each other, in silence, for an hour. There are moments of levity throughout as the two can’t help but laugh.\n\nNovember 2015: It’s a busy month of self-reflection for LaBeouf, who invites fans to join him as he watches all of his movies—in order—at Manhattan’s Angelika Film Center. He also livestreams his own face during the experience, sharing the varied emotions of his reactions with the world at large. They’re pretty good.\n\nFebruary 2016: He spends 24 hours in an elevator as performance art, again with frequent collaborators Rönkkö and Turner. They livestream the whole thing, naturally.\n\nApril 2016: A man in New York City was punched out by a stranger who said he “looked like Shia LaBeouf.” The actor called and left a message to apologize to his victimized doppelgänger even though he had nothing to do with the actual incident—and offer him some soup as a condolence. “He was like, ‘Hey, this is Shia LaBeouf… I just read an article that you were punched in the face because you look like me?’ And he was like, ‘Aw, man. That sucks. I’m so sorry. But I get it. It’s happened to me before.’ And then he was like, ‘I don’t know. I wish I was in New York. I’d come bring you soup,'” the lookalike told the New York Post.\n\nMay 2016: Shia launches an open-sourced, monthlong cross-country journey. Called “#TakeMeAnywhere,” he tweets out his geographic coordinates daily, allowing fans to find him, pick him up, and take him… anywhere. (And do pretty much anything with him in the process. He’s shared some pretty weird revelations with some of his fans in the process, but others came away impressed. “Sometimes when you meet your heroes, you’re disappointed when you meet them, but not Shia,” one fan who met up with him said afterward. “He was just an amazing guy. He was so receptive and conversational. I think he’s a true artist.”\n\nDecember 2016: The trio of LaBeouf, Rönkkö, and Turner camp out at the Sydney Opera House during a culture festival for two nights as, one by one, visitors delivered a message to them starting with the cryptic phrase “And in the end…” “As 2016 draws to a close, we are all too aware of the pervasive sense of foreboding that has come to define the year,” LaBeouf and his collaborators expressed in a statement about the project, called #ANDINTHEEND. “And yet, we still yearn for some greater truth, for the utopias of our distant horizons, expressed through art.” The messages from the visitors were streamed online and on a giant digital screen outside the Opera House, while the three onstage intermittently read out some of the striking statements.\n\nJanuary 2017: In his most overtly political work yet, LaBeouf and company set up a camera connected to a continuous livestream outside of New York’s Museum of the Moving Image. The message, this time, was “He Will Not Divide Us”—that “he” referring to new President Donald Trump. To launch the protest project, LaBeouf recruited Jaden Smith to recite the phrase like a mantra for over four hours during Inauguration Day. The livestream was ostensibly set to continue throughout Trump’s tenure, and drew crowds—and controversy. LaBeouf was allegedly arrested during an on-camera tussle with a detractor.\n\nFebruary 2017: The Museum of the Moving Image shut down the He Will Not Divide Us project on Feb. 10 in a move that LaBeouf and his collaborators considered “abandonment.” They then relocated the installation to the El Rey Theater in Albuquerque, New Mexico on Feb. 18 to keep the momentum going. But that was not to last long. According to Deadline, the camera was vandalized with spray paint after just two days at its new home, and on Feb. 23, LaBeouf shared an update that the stream had been taken down after reports of gunshots.\n\nMarch 2017: He Will Not Divide Us reopens on March 22—with some adjustments—in the U.K., taking the form of a waving flag printed with the statement and hoisted above the Foundation for Art and Creative Technology in Liverpool. “Events have shown that America is simply not safe enough for this artwork to exist,” LaBeouf, Rönkkö, and Turner said in a statement about the work’s latest iteration.\n\nTurns out, the U.K. wasn’t “safe enough” either: after just a single day, police were called to the scene when trespassers attempted to climb the flagpole, according to a Merseyside Police statement. The flag was subsequently removed on police advice, the BBC reports.\n\nApril 2017: LaBeouf performs a 2017 version of the Walden Pond experiment, spending a month alone in a cabin in Finland starting April 12. (Ronkko and Turner are also alone, at different cabins.) The new project is called #ALONETOGETHER. Visitors to a Finnish museum can send messages to the artists, which they’ll respond to by text. As usual, it’s livestreamed; so far, they’ve been complaining of the cold at their mysterious, remote locales in Lapland. Shia’s also shared tidbits about his “badass” grandmother, the funky spelling of his last name, and his teetotaling approach to the experiment.\n\nJuly 2017: LaBeouf is arrested in Savannah, GA for “disorderly conduct, obstruction and public drunkenness” while trying to bum a cigarette, and released soon after on bail. However, video of an expletive-riddled, racist rant leveled at the police officers took on a life of its own, prompting LaBeouf to share a formal apology via Twitter. He called the incident a “new low” and expressed a new commitment towards attaining sobriety.\n\nMarch 2018: LaBeouf is the cover star of Esquire Magazine, in which he opens up about his struggles with addiction, his fraught relationship with his father and the screenplay he penned, working title Honey Boy, based on his life as a child star living with his dad. (Soon after, news came out that the movie would go forward with LaBeouf playing his own father, and actor Lucas Hedges playing LaBeouf as a kid.) LaBeouf also noted, as an aside, that Kanye West once took a bunch of his clothes out of his closet at his own offering.\n\nApril 2018: In an appearance on Jimmy Kimmel Live! LaBeouf is his usual candid self — maybe a little too candid. While discussing his experiences in Finland and the acceptance of nudity he encountered there, he got reflective with a NSFW memory.\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Raisa Bruner at raisa.bruner@time.com.", "images": ["https://api.time.com/wp-content/uploads/2020/03/meghan-markle-narrate-disney-film.jpg?quality=85&w=600", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2020/04/Adam-Schesinger-Coronavirus.jpg?quality=85&w=500", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2020/04/TIM200427_cover_Hope_USETHIS.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2016/09/shia-labeouf.jpg?quality=85&w=1200&h=628&crop=1"], "top_img": "https://api.time.com/wp-content/uploads/2016/09/shia-labeouf.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Raisa Bruner"], "canonical_link": "https://time.com/4503609/shia-labeouf-weird-behavior-timeline/", "title": "A Comprehensive Timeline of Shia LaBeouf's Weirdest Behavior", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "shia labeouf, shia labeouf do it, shia labeouf do it, shia labeouf method, shia labeouf transformers, shia labeouf twitter, shia labeouf holes, shia labeouf coordinates, shia labeouf child, shia labeouf actor, shia labeouf all my movies", "news_keywords": "Shia LaBeouf, Maddie Ziegler Shia LaBeouf, Actual Cannibal, Elastic Heart, Shia LaBeouf history of art work, Shia LaBeouf career, Shia LaBeouf biography, Shia LaBeouf I'm not famous anymore, Shia Labeouf plagiarism, Shia Labeouf analysis, shia labeouf all my movies", "description": "The 'American Honey' actor has transformed into an unpredictable performance artist over the last few years.", "og": {"title": "A Comprehensive Timeline of Shia LaBeouf's Weirdest Behavior", "type": "article", "site_name": "Time", "url": "https://time.com/4503609/shia-labeouf-weird-behavior-timeline/", "description": "The quirky 'American Honey' actor has taken to performance art.", "image": {"identifier": "https://api.time.com/wp-content/uploads/2016/09/shia-labeouf.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/4503609/shia-labeouf-weird-behavior-timeline/", "description": "The 'American Honey' actor has transformed into an unpredictable performance artist over the last few years.", "media": "https://api.time.com/wp-content/uploads/2016/09/shia-labeouf.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/4503609/shia-labeouf-weird-behavior-timeline/", "title": "A Comprehensive Timeline of Shia LaBeouf's Weirdest Behavior", "description": "The quirky 'American Honey' actor has taken to performance art.", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2016/09/shia-labeouf.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": ["https://www.youtube.com/embed/KGAWg3pt0h0", "https://www.youtube.com/embed/iVbplK9McB0", "https://www.youtube.com/embed/UWTfRH5cA8Y", "https://www.youtube.com/embed/_6rDDZioHoM", "https://www.youtube.com/embed/KWZGAExj-es", "https://www.youtube.com/embed/LQdObqEWscU", "https://player.vimeo.com/video/111506778?app_id=122963", "https://player.vimeo.com/video/146575857?app_id=122963", "https://www.youtube.com/embed/jadPbiFNpsw", "https://www.youtube.com/embed/QTuqdzu815s", "https://www.youtube.com/embed/6tXQW2UBSRw", "https://www.youtube.com/embed/PT2fxswWSpQ"], "publish_date": null, "source": "http://time.com", "summary": ""}