{"url": "https://www.producersguild.org/page/2018award_winners", "text": "The 2018 Producers Guild Awards are presented by Cadillac.\n\n- Winners in full bold.\n\n\n\n\n\nThe Darryl F. Zanuck Award for Outstanding Producer of Theatrical Motion Pictures:\n\n“The Big Sick”\n\nProducers: Judd Apatow, Barry Mendel\n\n“Call Me By Your Name”\n\nProducers: Peter Spears, Luca Guadagnino, Emilie Georges, Marco Morabito\n\n“Dunkirk”\n\nProducers: Emma Thomas, Christopher Nolan\n\n“Get Out”\n\nProducers: Sean McKittrick & Edward H. Hamm, Jr., Jason Blum, Jordan Peele\n\n“I, Tonya”\n\nProducers: Bryan Unkeless, Steven Rogers, Margot Robbie, Tom Ackerley\n\n“Lady Bird”\n\nProducers: Scott Rudin, Eli Bush, Evelyn O’Neill\n\n“Molly's Game”\n\nProducers: Mark Gordon, Amy Pascal, Matt Jackson\n\n“The Post”\n\nProducers: Amy Pascal, Steven Spielberg, Kristie Macosko Krieger\n\n“The Shape Of Water”\n\nProducers: Guillermo del Toro, J. Miles Dale\n\nProducing Team: Dennis Chapman, Marie Claude-Hornois, Doug Wilkinson, Dennis Berardi\n\n“Three Billboards Outside Ebbing, Missouri”\n\nProducers: Graham Broadbent & Pete Czernin, Martin McDonagh\n\n“Wonder Woman”\n\nProducers: Charles Roven & Richard Suckle, Zack Snyder & Deborah Snyder\n\nThe Award for Outstanding Producer of Animated Theatrical Motion Pictures:\n\n“The Boss Baby”\n\nProducer: Ramsey Naito\n\n“Coco”\n\nProducer: Darla K. Anderson\n\nProducing Team: Mary Alice Drumm, David Park\n\n“Despicable Me 3”\n\nProducers: Chris Meledandri, Janet Healy\n\n“Ferdinand”\n\nProducers: Lori Forte, Bruce Anderson\n\n“The Lego Batman Movie”\n\nProducers: Dan Lin, Phil Lord & Christopher Miller\n\nThe Award for Outstanding Producer of Documentary Motion Pictures:\n\nThe PGA previously announced the nominations in this category on November 20, 2017. The nominees are listed below, along with eligible producers’ names.\n\n“Chasing Coral”\n\nProducers: Jeff Orlowski, Larissa Rhodes\n\n“City of Ghosts”\n\nProducer: Matthew Heineman\n\n“Cries from Syria”\n\nProducers: Evgeny Afineevsky, Den Tolmor, Aaron I. Butler\n\n“Earth: One Amazing Day”\n\nProducer: Stephen McDonogh\n\n“Jane”\n\nProducers: Brett Morgen, Bryan Burk, Tony Gerber, James Smith\n\nProducing Team: Tim Pastore, Jeff Hasler, Debra Eisenstadt, Gayle Lynn Fields\n\n“Joshua: Teenager vs. Superpower”\n\nProducers: Matthew Torne, Mark Rinehart, Joe Piscatella\n\n“The Newspaperman: The Life and Times of Ben Bradlee”\n\nProducers: Teddy Kunhardt, George Kunhardt\n\nThe television nominees are listed below in alphabetical order by category, along with eligible producers’ names.\n\nThe Norman Felton Award for Outstanding Producer of Episodic Television, Drama:\n\n“Big Little Lies” (Season 1)\n\nProducers: David E. Kelley, Jean-Marc Vallée, Reese Witherspoon, Bruna Papandrea, Nicole Kidman, Per Saari, Gregg Fienberg, Nathan Ross, Barbara A. Hall\n\n“The Crown” (Season 2)\n\nProducers: Peter Morgan, Stephen Daldry, Andy Harries, Philip Martin, Suzanne Mackie, Matthew Byam Shaw, Robert Fox, Andy Stebbing, Martin Harrison\n\n“Game of Thrones” (Season 7)\n\nProducers: David Benioff, D.B. Weiss, Carolyn Strauss, Frank Doelger, Bernadette Caulfield, Bryan Cogman, Chris Newman, Lisa McAtackney, Greg Spence\n\n“The Handmaid's Tale” (Season 1)\n\nProducers: Bruce Miller, Warren Littlefield, Daniel Wilson, Fran Sears, Ilene Chaiken, Sheila Hockin, Eric Tuchman, Frank Siracusa, John Weber, Joseph Boccia, Elisabeth Moss, Kira Snyder, Leila Gerstein\n\nProducing Team: Margaret Atwood, Dorothy Fortenberry, Wendy Straker Hauser, Joseph Boccia, Melissa Girotti, Eleanor Mendes, Corrie Gudgeon, Kathryn Blythe\n\n“Stranger Things” (Season 2)\n\nProducers: Iain Paterson, Shawn Levy, Dan Cohen, The Duffer Brothers, Rand Geiger, Justin Doble\n\nThe Danny Thomas Award for Outstanding Producer of Episodic Television, Comedy:\n\n“Curb Your Enthusiasm” (Season 9)\n\nProducers: Larry David, Jeff Garlin, Jeff Schaffer, Justin Hurwitz, Jon Hayman, Laura Streicher, Mychelle Deschamps\n\n“The Marvelous Mrs. Maisel” (Season 1)\n\nProducers: Daniel Palladino, Amy Sherman-Palladino, Sheila Lawrence, Dhana Rivera Gilbert\n\nProducing Team: Matthew Shapiro, Sal Carino, Francesca M. Mannix, Frank Covino, Rachel Jablin, Parker Chehak, Molly Pabain\n\n“Master of None” (Season 2)\n\nProducers: Aziz Ansari, Alan Yang, Michael Schur, David Miner, Dave Becky, Igor Srubshchik, Andrew Blitz, Eric Wareheim\n\n“Silicon Valley” (Season 4)\n\nProducers: Mike Judge, Alec Berg, Jim Kleverweis, Jamie Babbit, Clay Tarver, Dan O’Keefe, Chris Provenzano, Graham Wagner, Carrie Kemper, Aaron Zelman, Adam Countee\n\n“Veep” (Season 6)\n\nProducers: David Mandel, Frank Rich, Julia Louis-Dreyfus, Lew Morton, Morgan Sackett, Peter Huyck, Alex Gregory, Georgia Pritchett, Jennifer Crittenden, Gabrielle Allan, Ian Maxtone-Graham, Steve Hely, Ted Cohen, David Hyman, Rachel Axler, Billy Kimball, Dale Stern, Erik Kenward, Dan Mintz\n\nThe David L. Wolper Award for Outstanding Producer of Long-Form Television:\n\nThe Long-Form Television category encompasses both movies of the week and limited series.\n\n“Black Mirror” (Season 4)\n\nProducers: Annabel Jones, Charlie Brooker\n\nProducing Team: Nick Pitt, Louise Sutton, Sanne Wohlenberg, Ian Hogan, Joanne Crowther, Chris Lahr, Andy Chapman, Benjamin Greenacre, Andrea Raffaghello, Joel Stokes, Oliver Cockerham, Arni Pall Hansson, Moira Brophy, Russell McLean, Amber Ducker, Christopher Gray, Jakub Chilczuk\n\n“Fargo” (Season 3)\n\nProducers: Noah Hawley, Warren Littlefield, Joel Coen, Ethan Coen, John Cameron, Steve Blackman, Bob DeLaurentis, Matt Wolpert, Ben Nedivi, Monica Beletsky, Kim Todd, Leslie Cowan, Regis Kimble, Chad Oakes, Michael Frislev\n\n“FEUD: Bette and Joan” (Season 1)\n\nProducers: Ryan Murphy, Dede Gardner, Tim Minear, Alexis Martin Woodall, Chip Vucelich, John J. Gray, Jaffe Cohen, Renee Tab, Michael Zam, Jessica Lange, Susan Sarandon\n\n“Sherlock: The Lying Detective”\n\nProducers: Steven Moffat, Mark Gatiss, Sue Vertue, Beryl Vertue, Rebecca Eaton\n\n“The Wizard of Lies”\n\nProducers: Jane Rosenthal, Robert De Niro, Berry Welsh, Barry Levinson, Tom Fontana, Jason Sosnoff, Joseph E. Iberti\n\nThe Award for Outstanding Producer of Non-Fiction Television:\n\n“30 for 30” (Season 8)\n\nProducers: Connor Schell, John Dahl, Libby Geist, Erin Leyden, Adam Neuhaus, Jenna Anthony, Gentry Kirby, Marquis Daisy, Andy Billman, Deirdre Fenton\n\n“60 Minutes” (Season 50)\n\nProducer: Jeff Fager\n\n“Anthony Bourdain: Parts Unknown” (Season 9, Season 10)\n\nProducers: Anthony Bourdain, Christopher Collins, Lydia Tenaglia, Sandra Zweig\n\n“Leah Remini: Scientology and the Aftermath” (Season 1, Season 2)\n\nProducers: Leah Remini, Eli Holzman, Aaron Saidman, Myles Reiff, Adam Saltzberg, Erin Gamble, Lisa Rosen, Grainne Byrne, Taylor Levin, Alex Weresow, Rachelle Mendez\n\nProducing Team: Elaine Frontain Bryant, Amy Savitsky, Devon Graham Hammonds, Sabrina Mar, Jeana Dill, Emily Webster, Mike Rinder, Angela Root, Michael Tubman, Gabrielle Della Pesca, Marissa Ramirez, Natalie Doerr, Jennifer Parris, Deanne Vernengo, Dunbar Dicks, Bobby Aguilar, Matthew S. Harper, Zachary Bidman, Michelle Vonwald, Gabriel Rivera, Jane Lemberg, Tim Romine\n\n“Spielberg”\n\nProducers: Susan Lacy, Jessica Levin, Emma Pildes\n\nThe Award for Outstanding Producer of Live Entertainment & Talk Television:\n\n“Full Frontal with Samantha Bee” (Season 2)\n\nProducers: Samantha Bee, Jo Miller, Jason Jones, Tony Hernandez, Miles Kahn, Alison Camillo, Pat King, Allana Harkin\n\n“Jimmy Kimmel Live!” (Season 15)\n\nProducers: Jimmy Kimmel, Jill Leiderman, Jason Schrift, Doug DeLuca, Erin Irwin, David Craig, Gary Greenberg, Jennifer Sharron, Tony Romero, Ken Crosby, Josh Weintraub, Seth Weidner, Molly McNearney\n\n“Last Week Tonight with John Oliver” (Season 4)\n\nProducers: John Oliver, Tim Carvell, Liz Stanton\n\nProducing Team: Jon Thoday, James Taylor, Jeremy Tchaban, Baz Hatfield, Nicole Franza, Catherine Owens, Amanda Bayard, Claire Gordon, Kate Mullaney, Matt Passet, Alex Smelson, Christopher Werner, Melissa Weiss, Steven Tucker\n\n“The Late Show with Stephen Colbert” (Season 3)\n\nProducers: Stephen T. Colbert, Chris Licht, Tom Purcell, Jon Stewart, Barry Julien, Tanya Michnevich Bracco, Aaron Cohen, Paul Dinello, Emily Gertler, Matt Lappin, Opus Moreschi, Michael Brumm, Paige Kendig, Jake Plunkett\n\n“Saturday Night Live” (Season 43)\n\nProducers: Lorne Michaels, Steve Higgins, Erik Kenward, Lindsay Shookus, Erin Doyle, Tom Broecker, Ken Aymong\n\nThe Award for Outstanding Producer of Competition Television:\n\n“The Amazing Race” (Season 29)\n\nProducers: Jerry Bruckheimer, Bertram van Munster, Jonathan Littman, Elise Doganieri, Mark Vertullo\n\n“American Ninja Warrior” (Season 9)\n\nProducers: Arthur Smith, Kent Weed, Anthony Storm, Brian Richardson, Kristen Stabile, David Markus, Royce Toni, Stephen Saylor, J.D. Pruess, Jeffrey J. Hyman, D. Max Poris, Briana Vowels, Jonathan Provost\n\n“Lip Sync Battle” (Season 3)\n\nProducers: Casey Patterson, Jay Peterson, John Krasinski, Stephen Merchant, James McKinlay, Leah Culton Gonzalez, Pete DiObilda, LL Cool J, Genna Gintzig, Lindsay John, Jacob Burke, Diane Perrotta\n\n“Top Chef” (Season 14)\n\nProducers: Dan Cutforth, Jane Lipsitz, Casey Kriley, Tom Colicchio, Padma Lakshmi, Doneen Arquines, Gaylen Gawlowski, Erica Ross, Blake Davis, Scott Patch, Patrick Schmedeman, Elida Carbajal Araiza, Daniel Calin, Zoe Jackson\n\n“The Voice” (Season 12, Season 13)\n\nProducers: John de Mol, Mark Burnett, Audrey Morrissey, Lee Metzger, Chad Hines, Amanda Zucker, Kyra Thompson, Jay Bienstock, Stijn Bakkers, Mike Yurchuk, Teddy Valenti, Carson Daly\n\nProducing Team: Amanda Silva Borden, Dan Paschen, Tod Schellinger, Jared Wyso, Suzanne Lee, Anthea Bhargava, Keith Dinielli, May Johnson, Clyde Lieberman, Kyley Tucker, Amanda Horning Cuddy, Melissa Wong, Anna Gunne, Thomas A. Douglass, Stephanie Rojas, Ryan Corchard-Keller, Brianna Stegemann, Meredith Ambrose, William Davalos, Alexis Heller, Amanda Keller, Alyson Lippert, Mariela Rodriguez, Jacob Kieval\n\nThe PGA does not vet the individual producers of short-form programs, sports programs, or children’s programs and the winning productions will be recognized at the official ceremony on January 20th.\n\nThe Award for Outstanding Short-Form Program:\n\n“Better Call Saul's Los Pollos Hermanos Employee Training” (Season 1)\n\n“Carpool Karaoke” (Season 1)\n\n\n\nProducing Team: Ben Winston, James Corden, Eric Pankowski, Sheila Rogers\n\n“Humans of New York: The Series” (Season 1)\n\n“National Endowment for the Arts: United States of Arts” (Season 3)\n\n“Viceland at the Women's March” (Season 1)\n\nThe Award for Outstanding Sports Program:\n\n“All or Nothing: A Season with the Los Angeles Rams” (Season 2)\n\n“Hard Knocks: Training Camp with the Tampa Bay Buccaneers” (Season 12)\n\n“Real Sports with Bryant Gumbel” (Season 23)\n\nProducing Team: Rick Bernstein, Joe Perskie, Kirby Bradley, Lisa Bennett, Maggie Burbank, Chapman Downes, Josh Fine, Jordan Kronick, Stuart Ash, Max Gershberg, Nisreen Habbal, Naimah Jabali-Nash, Katie Melone, Beret Remak, Jake Resenwasser\n\n“SportsCenter with Scott Van Pelt” (Season 3)\n\n“VICE World of Sports” (Season 2)\n\nThe Award for Outstanding Children’s Program:\n\n“Doc McStuffins” (Season 4)\n\n“Nickelodeon Kids' Choice Awards 2017”\n\n“School of Rock” (Season 3)\n\n“Sesame Street” (Season 47)\n\nProducing Team: Brown Johnson, Carol-Lynn Parente, Benjamin Lehmann, Stephanie Longardo, Karyn Leibovich,Theresa Anderson, Andrew Moriarty, Aimee Blackton, Maxwell Nicoll, Elena Sporillo, Yuewen Jiang\n\n“SpongeBob SquarePants” (Season 10, Season 11)", "images": ["https://www.producersguild.org/resource/resmgr/produced_by_online_content/feb20cover_224x278.jpg", "https://www.producersguild.org/global_graphics/icons/securesubmit.png", "https://www.producersguild.org/resource/resmgr/guild_logos/pg_yt.png", "https://www.producersguild.org/global_graphics/icons/star_32x32.gif", "https://www.producersguild.org/resource/resmgr/guild_logos/pg_ig.png", "https://www.producersguild.org/graphics/header.jpg", "https://www.producersguild.org/graphics/Favicon.ico", "https://www.producersguild.org/resource/resmgr/guild_logos/pg_li.png", "https://www.producersguild.org/resource/resmgr/guild_logos/pg_fb.png", "https://www.producersguild.org/global_graphics/icons/fb-connect.png", "https://www.producersguild.org/resource/resmgr/guild_logos/pg_tw.png"], "top_img": "https://www.producersguild.org/graphics/Favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Producers Guild of America", "meta_data": {"google-site-verification": "tzgnQIwcom0BlqBPc9bQQFZT6e4qfq2GTidRzG840Cw"}, "movies": [], "publish_date": null, "source": "https://www.producersguild.org", "summary": ""}