{"url": "https://www.thedailybeast.com/bow-wow-caught-lying-about-private-jet-inspires-bowwowchallenge-for-social-media-fakery", "text": "On Monday, rapper Bow Wow Instagrammed a picture of his private jet, ostensibly in order to inform New York’s ten CSI: Cyber fans of his imminent arrival. The post, innocuously captioned “Travel day. NYC press run for Growing Up Hip Hop [sic]. Lets goo,” easily blended in with the rest of Bow Wow’s aspirational Instagram content. The problem, of course, is that Bow Wow—or Shad Moss, as he would really like you to call him—isn’t exactly flush. In 2012, the rapper behind such hits as “Mo Money,\" \"Get Money,\" and “Money in the Way” proved that he would not let his public love of money get in the way of shirking his child support payments. In an infamous court session, Bow Wow claimed that after over two decades in the music industry, he was only making around $4,000 a month. Furthermore, he insisted that he only had $1,500 in his checking account—which, for some perspective, is the amount of money that Rick Ross has probably spent on lobsters today. By copping to his financial insolvency—while conveniently failing to disclose that he had just scored a hosting gig at BET—Bow Wow was able to argue that he would be incapable of paying his child’s mother any more than $3,000 a month.\n\nOf course, the man still not known as Moss could very well have increased his assets over the past five years. Maybe he opened a 401(k). Maybe he invested his surplus $1,000 a month in Snapchat. Or, maybe, Bow Wow wasn’t actually flying private. That’s the theory put out by one Twitter sleuth, who spotted Bow Wow on his commercial flight and quickly uploaded the evidence to his feed. The surreptitious snap is captioned, “So this guy lil bow wow is on my flight to NY. But on instagram he posted a picture of a private jet captioned ‘traveling to NY today’ smh.” Another Internet investigator with some free time on their hands (Comey, is that you?) did a reverse image search on Bow Wow’s Instagram, which led to a photo from a Fort Lauderdale-based airport transportation website. In other words, it appears that the rapper pulled his sweet private plane from Google images. To Moss’s credit, he seems to have attempted to cover his tracks by running the picture through Amaro. But while an Instagram filter might make a sunset seem prettier or a sorority pledge class look tanner, it can’t magically make a rapper richer.\n\nIn other words, haters would say it’s Photoshopped—and haters would probably be right. Bow Wow’s social media stunting quickly gave way to a hashtag, #bowwowchallenge, where Twitter users could share altered photos of their phony lavish lifestyles. But as many #bowwowchallenge truthers were quick to point out, faking it on Instagram isn’t exactly uncommon. Who among us hasn’t Facetuned our selfies on Instagram or inserted Riz Ahmed into our prom pictures?\n\nOf course, these social media crimes are way more embarrassing when they’re committed by celebrities—people we would like to think are actually living the dream, as opposed to just Photoshopping it. The most garden-variety social media fakery is, of course, altering one’s face or body—colloquially referred to as the Facetune. If a star’s Instagram features a strange blur, a confusing reflection or a conspicuously wide thigh gap, it’s most likely the work of a body altering app. Beyoncé, Kylie Jenner (LINK: http://www.thedailybeast.com/articles/2017/04/27/inside-kylie-jenner-s-latest-photoshop-controversy.html), Kim Kardashian, and John Mayer have all been accused of getting virtual work done on their social media posts.\n\nBut Bow Wow’s Google image gaffe is more reminiscent of the work of two of his fellow rappers: Soulja Boy and 50 Cent. In 2014, Soulja Boy shared multiple pictures and videos of himself surrounded by hundred-dollar bills. The only problem was that the “Crank That” rapper had clearly stuffed his stacks with slips of blank white paper. After fans called Soulja Boy out, he deleted the offensive posts, before responding to the controversy on Twitter. “I just want my fans to know that yes I was on set shooting a video and they had prop money and I took a picture with it. All my cash is real,” he explained. “They had prop money at turn my swag on video 2. They always have props. But I don't want y'all to think I would fool y'all with fake stuff.”\n\nIn 2016, 50 Cent upped the prop money ante by exhibiting a pattern of fooling with the aforementioned “fake stuff.” After filing for bankruptcy in Connecticut, Curtis Jackson III was forced to answer for a series of social media posts in which he appeared to be showing off his deep pockets. In response, the rapper’s attorneys claimed that the stacks of money the rapper flexed on Instagram were totally bogus. “The cash depicted in the social media postings is not real,” his lawyers explained. “The postings, which amongst other things, make use of stage or prop money, are part of the Debtor's routine social media marketing activities and relate directly to the Debtor's various business interests. Prop money is routinely used in the entertainment industry, including in movies, television shows, videos and social media postings.” Essentially, they argued that the posts in question were crucial to maintaining the bankrupt celebrity’s brand—the brand of a rapper who isn’t bankrupt. Other rappers have been accused of showing off their fake watches on Instagram, or stunting in luxury cars they’re actually leasing.\n\nBow Wow found himself in a totally separate social media shit storm of his own creation earlier this year, when he sent out an ill-advised tweet defending Snoop Dogg’s right to fake assassinate Trump in a music video, and proposing that they “pimp” Melania Trump “and make her work for us.” To be fair to Bow Wow, once The New York Times decides that you’re Snoop Dogg’s nephew, reality probably does start to seem increasingly open to interpretation.", "images": ["https://img.thedailybeast.com/image/upload/c_fill,h_200,w_200,x_0,y_0/v1489779073/author/amy-halperin-zimmerman-author.jpg", "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2561,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1494461952/articles/2017/05/10/bow-wow-caught-lying-about-private-jet-inspires-more-social-media-fakery/170510-zimmerman-bowwow-tease_yi8hrb", "https://img.thedailybeast.com/image/upload/v1550872986/White2x_hcwpd6.png", "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2561,x_0,y_0/dpr_1.5/c_limit,w_1044/fl_lossy,q_auto/v1494461952/articles/2017/05/10/bow-wow-caught-lying-about-private-jet-inspires-more-social-media-fakery/170510-zimmerman-bowwow-tease_yi8hrb", "https://img.thedailybeast.com/image/upload/v1549916286/logo_km2qs4.png"], "top_img": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2561,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1494461952/articles/2017/05/10/bow-wow-caught-lying-about-private-jet-inspires-more-social-media-fakery/170510-zimmerman-bowwow-tease_yi8hrb", "keywords": [], "authors": ["Amy Zimmerman", "Entertainment Reporter"], "canonical_link": "https://www.thedailybeast.com/bow-wow-caught-lying-about-private-jet-inspires-bowwowchallenge-for-social-media-fakery", "title": "Bow Wow Caught Lying About Private Jet, Inspires #BowWowChallenge for Social Media Fakery", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "title": "Bow Wow Caught Lying About Private Jet, Inspires #BowWowChallenge for Social Media Fakery", "keywords": "social media, Hip hop music, Instagram, Celebrities", "og": {"title": "Bow Wow Caught Lying About Private Jet, Inspires #BowWowChallenge for Social Media Fakery", "description": "After a fan seemingly caught the rapper staging a trip on a private jet, Twitter exposed more social media fakery with the #BowWowChallenge. The lesson? Everyone fakes stuff on Instagram.", "url": "https://www.thedailybeast.com/articles/2017/05/10/bow-wow-caught-lying-about-private-jet-inspires-more-social-media-fakery", "site_name": "The Daily Beast", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2561,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1494461952/articles/2017/05/10/bow-wow-caught-lying-about-private-jet-inspires-more-social-media-fakery/170510-zimmerman-bowwow-tease_yi8hrb"}, "description": "After a fan seemingly caught the rapper staging a trip on a private jet, Twitter exposed more social media fakery with the #BowWowChallenge. The lesson? Everyone fakes stuff on Instagram.", "authors": "Amy Zimmerman", "wrap": "/content/dailybeast/entertainment", "article": {"section": "entertainment", "published_time": "2017-05-10T23:04:00.000Z", "author": "https://www.thedailybeast.com/authors/amy-zimmerman"}, "fb": {"app_id": 189930913679}, "twitter": {"card": "summary_large_image", "site": "@thedailybeast", "creator": "@ahzimm", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2561,x_0,y_0/dpr_2.0/c_limit,w_600/f_jpg/fl_lossy,q_auto/v1494461952/articles/2017/05/10/bow-wow-caught-lying-about-private-jet-inspires-more-social-media-fakery/170510-zimmerman-bowwow-tease_yi8hrb"}, "sailthru.date": "2017-05-10T23:04:00.000Z", "sailthru.expire_date": "2017-05-24T23:04:00.000Z", "publicationDate": 201705102304, "parsely-page": "{\"author\":\"Amy Zimmerman\",\"link\":\"https://www.thedailybeast.com/bow-wow-caught-lying-about-private-jet-inspires-bowwowchallenge-for-social-media-fakery\",\"metadata\":{\"articleType\":\"article\",\"rubric\":\"STUNTIN\\u0027\"},\"post_id\":\"articles/2017/05/10/bow-wow-caught-lying-about-private-jet-inspires-more-social-media-fakery\",\"pub_date\":\"2017-05-10T23:04:00+00:00\",\"section\":\"Entertainment\",\"tags\":[\"social media\",\"Hip hop music\",\"Instagram\",\"Celebrities\",\"typeArticle\"],\"title\":\"Bow Wow Caught Lying About Private Jet, Inspires #BowWowChallenge for Social Media Fakery\",\"type\":\"post\"}"}, "movies": [], "publish_date": 1494457440.0, "source": "https://www.thedailybeast.com", "summary": ""}