{"url": "https://www.inquisitr.com/4931815/tracee-ellis-ross-shuts-down-baby-questions-telling-people-to-get-out-of-her-womb/", "text": "Tracee Ellis Ross may be the superstar daughter of singer Diana Ross, but she’s letting fans know that that doesn’t give them a pass to pry in her personal life. As reported by E!, during a special interview with Vanity Fair, Ross was asked questions about having kids where she bluntly made it clear that some boundaries need to be set and not everything is up for discussion when it comes to her personal and private life. The cover model and actress sat down with the magazine and gave her thoughts on how she feels constantly being asked about whether she plans on having kids or not. Back in 2016 and 2017 for example, Ross, who was promoting the third season of her show Black-ish was constantly asked whether the 45-year-old ever plans on having kids.\n\nBecause Ross’ character in the series was expecting her fifth child, she was often asked whether she ever wanted to become a mother in real life.\n\n“Last year, I was pregnant all season. That brought on a lot of comments and questions and pontifications from people with no invitation.”\n\nThe former model and actress told the magazine that she was forced to shut down the questions in a no-nonsense way, pretty much telling everyone to back off.\n\n“I literally have said to people, for real, no joke, ‘Why don’t you just get out of my womb? Like, get out of my uterus. What are you doing in there? And why are you asking those questions? And what makes you think you can ask that?'”\n\nAccording to the actress, patriarchy has created a “siloed-off experience” for women—not just actresses—”with one answer for what a good life looks like.”\n\nRoss, whose mother is none other than the one and only Diana Ross, grew up with what many could say was a unique model of what it means to be a woman. Of her mother, Ross says, “I saw a woman who just was making a path and doing it on her own. She didn’t have hundreds of people doing everything for her—my mom always packed her own bags and cooked our food. She was doing it all and never had the response to me… where she was like, ‘Not now, I don’t have time.’ It was very capable, incredibly capable and present at the same time.”\n\nWith her mother as her role model, Ross has used her mother’s example to take control of her career as an actress and even as a director saying, “My mother is a woman who completely possessed her own agency and embodied a sense of her own power, unapologetically. I think that lends itself to directing. I don’t have a fear in making a choice or expressing my opinion even if no one else likes it—or not even expressing it, but owning it for myself.”\n\nAside from owning her power as an actress and director, Ross is also paying attention and making sure she getting what she’s rightfully worth. Earlier this year, news broke that Ross earned less money than her male co-star, Anthony Anderson.\n\n???? A post shared by Tracee Ellis Ross (@traceeellisross) on Jun 6, 2018 at 10:45am PDT\n\nOf the news going public Ross told the magazine, “That was really f–king awkward. I don’t know how that information got out. But I understand the interest because there is a larger, deeper, more important conversation going on that is not about me, but is about people being paid appropriately for their contribution and the work that they do, not because of their gender, race, or anything. And it is a valid, real, important, past-due conversation that should no longer be a conversation, that should just be handled…across all industries.”\n\nRoss, once again making sure to set boundaries, has hired a new team of female agents and prefers not to talk about the pay disparity simply saying,”That has been resolved.”", "images": ["https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "https://cdn.inquisitr.com/wp-content/uploads/2018/06/GettyImages-9269769822.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://secure.gravatar.com/avatar/3bd1a3d2c01a173ca477b7aa4785d73d?s=250&d=mm&r=g", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E"], "top_img": "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Tiffani Cordner"], "canonical_link": "https://www.inquisitr.com/4931815/tracee-ellis-ross-shuts-down-baby-questions-telling-people-to-get-out-of-her-womb/", "title": "Tracee Ellis Ross Shuts Down Baby Questions Telling People To ‘Get Out’ Of Her Womb", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}