{"url": "https://www.cosmopolitan.com/entertainment/tv/a19831489/american-horror-story-news-cast-date-spoilers/", "text": "Some two months after American Horror Story: Cult wrapped up last November, FX announced that season eight was a go. Here, everything we know so far about Apocalypse:\n\n1. It began shooting in the summer. In April, showrunner Ryan Murphy said that shooting would commence in mid-June. Also in June, FX confirmed that the new season would premiere Sept. 12.\n\n2. It is not called Radioactive, but Apocalypse. The past few seasons of AHS have stayed relatively mysterious until they premiered, and season eight is so far no different. Though internet sleuths discovered that a trademark was filed for American Horror Story: Radioactive and became convinced that the new season would be named as such, in July, FX announced that season eight is officially called Apocalypse.\n\n3. It's set in the future, technically. While some rumors place the setting of the new season in 2032, Murphy said in April that it would be set \"18 months from today,\" so in October 2019. \"It’s still topical, but [set in] the future, which I’ve never done,\" he said. \"I think people will like it. It’s different from what we’ve done before.\" Theorists have noted that Oct. 6, 2019 marks the 58th anniversary of a speech by JFK telling Americans to build nuclear bomb shelters, which would track with the alleged \"radioactive\" theme. Murphy has also said that it will be more fantasy-based than the show's previous two seasons. \"It’s heightened,\" he said in April. \"It’s not necessarily as real and grounded as the past season. We’re sort of getting back to Asylum, and Coven. That’s the tone of it.\"\n\n\n\n4. Kathy Bates will be back. After star turns in Coven, Freak Show, Hotel, and Roanoke, Bates had to sit out Cult due to her commitment to her Netflix show Disjointed, but Murphy has confirmed that she'll be back for season eight and that she's one of the leads. I hope she gets to yell \"LIIIIIIIES\" again.\n\nFX\n\n5. MVPs Sarah Paulson and Evan Peters will also be back. Paulson and Peters have lead roles, per Murphy, and Peters will be a hairstylist. Cheyenne Jackson, Adina Porter, Billy Eichner, Leslie Grossman, and Emma Roberts will be back too.\n\n6. Dame. Joan. Collins. Murphy confirmed in April that the iconic Dynasty actress will join the cast in season eight, though of course has not given hints as to what she'll be doing besides being Evan Peters's grandmother. Does it even matter, though? She's Joan Collins.\n\nJoan Collins in 2018. Getty Images\n\n7. It's the Coven/Murder House crossover season. In June, Ryan tweeted that the next season of AHS would be the promised mashup of seasons one and three. Also of note: Connie Britton is no longer attached to 9-1-1, which means she could be free to return as her Murder House character Vivien Harmon (who died, but this show loves ghosts, so that doesn't really matter).\n\n\n\nOn Aug. 26, Britton and Dylan McDermott confirmed their return as their Murder House husband-and-wife duo, Vivien and Ben. According to the Instagram caption from Britton's set photo, Sarah Paulson will direct at least one episode this season.\n\n8. Remember the Harmon baby? He’s all grown up — and he’s back. In July, Murphy announced that Cody Fern will reprise his role as Michael Langdon in Apocalypse.\n\n\n\nViewers first met Michael at the end of Murder House, when Vivien gave birth to a child fathered by a ghost. Does that mean this season is about the apocalypse brought on by that devil baby? Is the devil baby in the promo image supposed to be Michael? And what’s he been doing this whole time? I don’t know, but I’ll tell you what: I love devil babies.\n\n9. Jessica Lange is coming back. Lange hasn't appeared on the show since season four, Freak Show, so if you've been missing Constance Langdon, Fiona Goode, Sister Jude, or Elsa Mars, then you're in luck. During a TCA event in August, Paulson said that Lange would return as Constance.\n\nOn Sept. 19, Murphy shared the first set photo of Lange returning as Queen Constance. Bow down.\n\n10a. (Re) meet the coven. Yes, that is Stevie Nicks.\n\n\n\n10b. Serious question. To quote Emma Roberts, \"Does the bitch survive the #apocalypse?\"\n\n11. In addition to Cordelia Goode and Billie Dean Howard, Paulson will take on the role of a third character this season: Venable. On Aug. 22, FX released this teaser of Venable turning a raffle basket. “Now is your chance to be one of the few remaining. This is your chance to survive. We’ll find you soon,” she says. The teaser also introduced fans to a new site, thebeginningisnear.tv.\n\n12. FX has been teasing the season on social media, with some clips more disturbing than others. Proceed with caution, and maybe one closed eye.\n\n13. In early September, FX released a teaser trailer, followed by the first full trailer for Apocalypse. Come for Billy Eichner yelling, \"You Bitch,\" stay for Kathy Bates saying, \"Hail Satan.\" And yes, the Rubber Man from Murder House is back.\n\n\n\n\n\n", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/ahs-apocalypse-fx-1534963866.jpg?crop=1xw:1xh;center,top&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/ahs-apocalypse-fx-1534963866.jpg?crop=1xw:1xh;center,top&resize=1200:*", "keywords": [], "authors": ["Eliza Thompson", "Peggy Truong", "Senior Entertainment Editor", "I M The Senior Entertainment Editor At Cosmopolitan.Com", "Which Means My Dvr Is Always Percent Full.", "Entertainment Writer", "Peggy Is Cosmopolitan.Com S Entertainment Writer", "Specializing In Leonardo Dicaprio", "This Is Us", "The Royals."], "canonical_link": "https://www.cosmopolitan.com/entertainment/tv/a19831489/american-horror-story-news-cast-date-spoilers/", "title": "Everything to Know About 'American Horror Story' Season 8", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "Everything to Know About 'American Horror Story' Season 8", "description": "Just how many scary clowns will this involve?", "url": "https://www.cosmopolitan.com/entertainment/tv/a19831489/american-horror-story-news-cast-date-spoilers/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/ahs-apocalypse-fx-1534963866.jpg?crop=1xw:1xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2019-10-24 07:25:02", "published_time": "2018-09-20 01:00:00", "section": "TV", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/ahs-apocalypse-fx-1534963866.jpg?crop=1xw:1xh;center,top&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "American Horror Story Season 8 Spoilers, Air Date, Cast News and More - All About AHS Season 8", "description": "From the theme to the cast and the air date, here's everything you need to know about the eighth season of American Horror Story.", "keywords": "ahs, american horror story, ahs season 8, american horror story season 8, ahs season 8 theme, american horror story season 8 theme", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/ahs-apocalypse-fx-1534963866.jpg?crop=0.5xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrities & Entertainment,entertainment,tv", "sailthru.date": "2018-09-20T13:00:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/ahs-apocalypse-fx-1534963866.jpg?crop=1xw:1xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/ahs-apocalypse-fx-1534963866.jpg?crop=0.5xw:1xh;center,top", "sailthru.socialtitle": "Everything to Know About 'American Horror Story' Season 8", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1537376400.0, "source": "https://www.cosmopolitan.com", "summary": ""}