{"url": "en.wikipedia.org/wiki/Liam_Payne", "text": "English singer and songwriter\n\nLiam James Payne (born 29 August 1993) is an English singer and songwriter. He rose to fame as a member of the boy band One Direction. Payne made his debut as a singer when he auditioned for the British television series X-Factor in 2008. After being eliminated as a solo performer, he auditioned again in 2010 and was put into a group with four other contestants to form One Direction.[3][4] The group has since released five albums, embarked on four world tours, and won several awards. Payne has worked with other producers under the monikers \"Big Payno\" and \"Payno\" creating remixes for songs by his group and Cheryl.[5]\n\nIn 13 January 2016, after nearly 6 years as a group, 1D announced the group would stop it's work and start his acting career. Payne signed a recording deal with Republic Records in North America.[6] In May 2017, Payne released \"Strip That Down\" as the lead single from his upcoming debut album. It peaked at number three on the UK Singles Chart and number ten on the US Billboard Hot 100, being certified platinum in both countries. His debut album, LP1, was released on 6 December 2019.\n\nEarly life [ edit ]\n\nPayne was born in Wolverhampton, West Midlands, England. He is the son of Karen, an infant nurse, and Geoff Payne, a fitter. He has two older sisters, Nicola and Ruth Payne.[7] Payne was born three weeks early, getting ill frequently. Until the age of four, Payne had regular tests done in hospital as doctors noticed one of his kidneys was scarred and dysfunctional. To help cope with the pain, he had sixteen injections in his arm every morning and another sixteen every evening as a child.[8] As a student, Payne was heavily involved in sports, particularly cross country running. Payne originally joined the Wolverhampton and Bilston Athletics Club to pursue his running career. Payne claimed in an interview that he was '3rd best in the country at one point'. [9][10]\n\nAs he was dealing with bullying from some older students in secondary school, he took up boxing lessons at the age of twelve.[11] Payne completed 11 GCSEs at St Peter's Collegiate School before moving on to study music technology at Wolverhampton College's Paget Road campus.[4]\n\nPayne was first introduced to the world of show business at age twelve as a member of the Pink Productions Theatre Company, even appearing as Tony Manero from Saturday Night Fever.[12] Payne had previously performed in front of a crowd of 26,000 during a Wolverhampton Wanderers football match.[4][13]\n\nCareer [ edit ]\n\n2008–2015: The X-Factor and One Direction [ edit ]\n\nPayne first auditioned for the fifth series of the British Singing Competition The X Factor in 2008, at just 14 years old. Payne moved past the first round after performing Frank Sinatra's \"Fly Me to the Moon\". He was subsequently cut at the Boot Camp stage, but Simon Cowell, who then changed his mind and asked Payne to return for the judges' houses stage.[14] Payne was cut again during judges' houses, but was encouraged by Cowell to \"come back in two years\".[15]\n\nPayne returned to the show in 2010 for the seventh series. He auditioned with the Michael Bublé version of \"Cry Me a River\", which earned him four yeses and a standing ovation from Cowell. Payne was considered the second favourite to win the competition following his solo audition.[16] He failed to progress to the \"Boys\" category at judges' houses, but after a suggestion by Simon Cowell, Payne, along with Harry Styles, Niall Horan, Louis Tomlinson, and Zayn Malik, were put together to form a five-piece boy band at Wembley Arena, during the bootcamp stage of the competition, thus qualifying for the \"Groups\" category.[17] Subsequently, the group got together for two weeks to get to know each other and to practice. For their qualifying song at Judges' houses, and their first song as a group, they performed an acoustic version of \"Torn\". Simon Cowell later commented that the performance convinced him that the group \"were confident, fun, like a gang of friends, and kind of fearless as well.\" The group quickly gained popularity in the UK, ultimately coming in third place on the show.[18]\n\nLiam Payne in 2012\n\nFollowing The X Factor, One Direction were signed to Simon Cowell's Syco Entertainment in 2010.[19] A book licensed by One Direction, One Direction: Forever Young (Our Official X Factor Story), was released in February 2011 and topped The Sunday Times' Best Seller list. Their debut single, \"What Makes You Beautiful\", was released in September 2011, and was a commercial and international success, reaching number one in several countries.[20] Their debut album, Up All Night, was released in Ireland and the UK of November of that same year, charting at number one and number two, respectively. The album was released worldwide in March 2012, and One Direction became the first UK group to have their debut album reach number one in the United States.[21] Following the release of the album, the group headlined the Up All Night Tour. Originally intended with shows taking place only in the UK and Ireland,[22] Australian and North American legs of the tour were added due to demand.[23] A commercial success, tickets for the tour sold out in minutes and garnered positive reviews from critics who applauded the band's singing abilities and stage presence.[24] The band released Up All Night: The Live Tour, a video album documenting the tour, in May 2012. That same month, One Direction's first book to be licensed in America, Dare to Dream: Life as One Direction, was published and topped The New York Times Best Seller list.[25]\n\nIn September 2012, \"Live While We're Young\", the lead single from the group's second album, was released, and was a global success. Another single, \"Little Things\", spawned the band's second number one single in the UK.[26] In November 2012, the group released their second album, Take Me Home, and it reached number one in over 35 countries. Reaching number one on the Billboard 200, the group became the first boy band in US chart history to record two number-one albums in the same calendar year alongside becoming the first group since 2008 to record two number-one albums in the same year.[27] Following the release of the album, the group embarked on their second headlining concert tour, the Take Me Home Tour. Performing 123 shows in North America, Asia, Oceania, and Europe, grossing $114 million. During the tour, One Direction covered Wheatus's \"Teenage Dirtbag\". In the original song lead vocalist Brendan Brown performs a segment in a \"female voice\" which, in One Direction's rendition of the song Payne covered in falsetto. This garnered praise from Brown, who commented, \"You can do my girl part anytime.\"[28] In August 2013, One Direction: This Is Us, a 3-D documentary concert film was released, accumalting a box office gross of $68.5 million.[29] One Direction's third book, One Direction: Where We Are: Our Band, Our Story: 100% Official, was released that same month.[30]\n\nThe group's third album, Midnight Memories, was released in November of that same year. It was the best-selling album worldwide in 2013 with 4 million copies sold globally.[31] The album's lead single, Best Song Ever, is their highest charting single in the US to date.[32] The group embarked on their third headling tour, the Where We Are Tour. Tickets sold out in minutes,[33][34] and more shows were added due to \"overwhelming demand.\"[35] The tour was their first all-stadium tour, averaging 49,848 fans per show.[36] In total, the tour grossed over $290 million and was the highest-grossing tour of 2014, the 15th highest-grossing concert tour of all time, and is still the highest-grossing tour of all time by a vocal group.[37] The tour was attended by 3.4 million fans.[36] In September 2014, One Direction's fourth book, One Direction: Who We Are: Our Official Autobiography was released. The group's second concert film, One Direction: Where We Are – The Concert Film, was released in October 2014, showing footage of the band's shows at San Siro Stadium in Milan, Italy. In November 2014, the group's fourth album, Four, was released, making it the last album to include Zayn Malik. Singles \"Steal My Girl\" and \"Night Changes\" were released, both achieving platinum status in the US among other countries.[38][39] The album debuted number one in 18 countries, selling 3.2 million copies.[40] One Direction became the only group in the 58-year history of the Billboard 200 albums chart to have their first four albums debut at number one.[41] The group embarked on their fourth headlining world tour, the On the Road Again Tour, grossing $208 million and selling 2.3 million tickets. In November 2015, One Direction's fifth album, Made in the A.M., was released. Singles \"Drag Me Down\" and \"Perfect\" both debuted at number one in various countries, and the album reached number one in the UK and number two on the US Billboard 200. Following the release of the album, the group went on an indefinite hiatus.\n\nFollowing the departure of former member Zayn Malik, Payne was tasked with taking over the bulk of Malik's vocals.[42] Bandmate Harry Styles admitted, \"Liam [Payne] stepped up to do the high notes. He kicks them in the bollocks every show. He doesn't hold back.\"[43]\n\nPayne was known as one of the principal songwriters in One Direction, credited for co-writing more than half of the songs on the band's third and fourth album.[44][45]\n\n2016–present: Solo projects and LP1 [ edit ]\n\nPayne began working as a producer under the monikers \"Big Payno\" or \"Payno\", teaming up with fellow producers AfterHrs to remix several tracks including Cheryl Cole's \"I Don't Care\" in 2014.[46] Some EDM websites noted Payne's remixes were venturing into future house.[47][48][49] Payne is also credited with writing Cole's \"I Won't Break\", off her album Only Human.\n\nIn August 2014, Payne created and became director of Hampton Music Limited, a publishing company under which his solo projects will appear.[50][51] Australian band 5 Seconds of Summer is signed to One Mode Productions Limited, on which Payne serves as one of the directors.[52]\n\nPayne began working on future projects collaborating with Juicy J on seven tracks with more in the works,[53][54] DJ Mustard,[55] and Miguel.[56] He has also been in the studio with producer and performing artist Pharrell Williams.[57] Payne also contacted The Collective member and YouTube musician and producer Will Singe.[58]\n\nIn 2015, Payne collaborated with songwriter Jamie Scott on Irish band Hometown's single \"The Night We Met\".[59] In early 2016, Payne featured on a track titled \"You\" by Wiz Khalifa and Juicy J. Payne denied that the track was a single, but it was confirmed to be a leak from an untitled, unreleased mixtape.[60][61]\n\nIn October 2016, it was announced that Payne had signed a recording contract with Republic Records.[6] His debut solo single \"Strip That Down\", featuring Quavo and co-written with Ed Sheeran and Steve Mac, was released on 19 May 2017,[62] and sent to US contemporary hit radio on 23 May.[63] Payne later released the single \"Bedroom Floor\"[64] and the collaboration with Zedd, \"Get Low\".[65] Regarding his forthcoming debut album, Payne stated:\n\nIt's very eclectic. It's more like my playlist album; my favorite playlist of songs that I have made over the past year. So, some slow jams, there's a couple of dance songs on there, with some R&B stuff. So there's a lot – it's a lot of different stuff.[66]\n\nIn January 2018, Payne and Rita Ora released the single \"For You\" from the soundtrack of the film Fifty Shades Freed.[67] In April 2018, Payne released \"Familiar\" with J Balvin.[68] He announced his debut album would be released on 14 September 2018.[69]\n\nOn 30 March 2018, Payne performed in front of more than 100,000 people during a free concert at Global Village 2018 in Dubai.[70][71] He released his first extended play, First Time,[72] which features a collaboration with French Montana of the same name, on 24 August 2018.[73] Prior to the EP's release, Payne announced that he is putting off his album to make some adjustments to it.[74]\n\nHe contributed vocals on Jonas Blue's song \"Polaroid\", along with Lennon Stella, released on 5 October 2018.\n\nPayne released the song \"Stack It Up\", featuring American rapper A Boogie wit da Hoodie, on 18 September 2019. After its release, Payne revealed that his album is \"finished\" and would more likely released in 2020,[75] although in October, the album, LP1, was confirmed for a 6 December 2019 release date. It peaked at number 17 in the UK and at number 111 in the US.\n\nOn 25 October 2019, Payne released as Christmas song titled, \"All I Want For Christmas\". It serves as the sixth single from his album.\n\nOn 6 December 2019, released the seventh single \"Live Forever\" featuring American DJ trios Cheat Codes alongside his debut album.\n\nOn 1 April 2020, Payne announced that he will feature on Swedish DJ Alesso’s next single called \"Midnight\". The song was released on 8 April 2020.\n\nArtistry [ edit ]\n\nLiam Payne is a pop[76] and R&B[77] singer who explores other genres like electronic.[78]\n\nHe cites Pharrell Williams,[79] Justin Timberlake,[80] and Usher as major musical influences.[81][82] \"The person who has inspired me most is Pharrell Williams who I worked with a while back. I got talking to his producer recently and asked him what Pharrell was like when he was younger, and he said to me that when he was my age he couldn’t press a note on a keyboard. And that was amazing to me because at 22 I thought I was too old to learn guitar,\" revealed Payne.[83]\n\nPhilanthropy [ edit ]\n\nAs a member on One Direction, Payne has also supported Comic Relief,[84] and a new initiative titled Action 1D \"to help better the future\".[85]\n\nPayne is an avid supporter of Unicef and teamed up with tennis star Andy Murray, Jack Whitehall and Clare Balding in support of Unicef UK's Children in Danger Summer Disease Appeal.[86] Payne teamed up with motorsport star Eddie Jordan in support of UK based charity CLIC Sargent.[87] Payne is an ambassador for the charitable organization Trekstock.[88] Payne's original campaign with the organization in 2013 raised $784,198.[89] He raised an additional $211,237 during his campaign in 2015.[90] Payne has also been named an ambassador of Sustainable Development Goals also known as the Global Goals campaign.[91][92] Payne also gave a much needed push to a £6 million youth project \"The Youth Zone\" in his hometown of Wolverhampton.[93]\n\nPersonal life [ edit ]\n\nRelationships [ edit ]\n\nIn 2016, Payne started dating Cheryl;[94][95][96] they have one son (b.2017). They split in 2018.[97][98][99] In September 2019, Payne confirmed that he was in a relationship with model Maya Henry.[100]\n\nDiscography [ edit ]\n\nFilmography [ edit ]\n\nAwards and nominations [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Liam_Payne_in_October_2018.jpg/220px-Liam_Payne_in_October_2018.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Liam_Payne_Sydney_Australia.jpg/200px-Liam_Payne_Sydney_Australia.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/f/f8/Liam_Payne_in_October_2018.jpg", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/f/f8/Liam_Payne_in_October_2018.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Liam_Payne", "title": "Liam Payne", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/f/f8/Liam_Payne_in_October_2018.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}