{"url": "https://www.metacritic.com/feature/tv-premiere-dates", "text": "FRI / May 1\n\n▣ Betty Trailer Drama/Comedy 11p\n\nSix-episode spinoff from the 2018 film Skate Kitchen comes from that film's director, Crystal Moselle (along with Brooklyn Nine-Nine's Lesley Arfin) and returns much of the film's cast.\n\n▣ Endings, Beginnings Drama ($) Rent (Digital)\n\n▣ Hollywood Drama\n\nRyan Murphy's second Netflix series to air (following The Politician) but the first ordered by the streaming service after signing Murphy to a long-term deal, Hollywood is a seven-episode limited series set in late-1940s Hollywood, where various filmmakers attempt to strike it big in a movie industry that is biased against certain genders, races, and sexualities. Darren Criss, David Corenswet, Jeremy Pope, Patti LuPone, Dylan McDermott, Holland Taylor, and Maude Apatow star. They'll play a mix of fictional and real-life figures.\n\nMedici Trailer Foreign/Drama\n\n▣ Trying Trailer Comedy Apple TV+\n\nRafe Spall, Esther Smith, and Imelda Staunton star in this BBC-produced (but Apple-exclusive) British comedy series about a couple that wants to have a baby but cannot.\n\n▣ Upload Trailer Comedy/Sci-fi Prime Video\n\nThe latest comedy from Greg Daniels (The Office, King of the Hill, People of Earth) is a satire set in a near future in which people nearing death can have their minds \"uploaded\" into a virtual afterlife of their choosing. Robbie Amell and Andy Allo star. Daniels wrote and directed the pilot and serves and showrunner for the 10-episode series.\n\nSUN / May 3\n\n▣ Billions Trailer Drama 9p\n\nJulianna Margulies and Corey Stoll will each appear in multiple episodes this season. Note that several episodes could not be filmed prior to the March shutdown in production and will need to air later this year.\n\nGood Witch Drama Hallmark, 9p\n\nMarried to Medicine Los Angeles Reality Bravo, 9p\n\nThe Real Housewives of Potomac Reality Bravo, 8p\n\nRick and Morty Trailer Animation/Comedy Adult Swim, 11:30p\n\nMON / May 4\n\nBakeaway Camp With Martha Stewart Reality Food, 9p\n\n▣ Camp Getaway Trailer Reality Bravo, 10p\n\nDisney Gallery: The Mandalorian Reality Disney+\n\nDuff Takes the Cake Reality Food, 10p\n\nGold Digger Trailer Drama Acorn TV\n\nReno 911! Comedy Quibi\n\nShort-format revival of the Comedy Central series returns the original cast.\n\nTUE / May 5\n\nActor Clark Duke makes his directorial debut with a darkly comedic thriller set in a Deep South drug trafficking ring. Duke stars alongside Liam Hemsworth, Michael Kenneth Williams, Vince Vaughn, and Vivica A. Fox.\n\n▣ Better Days Foreign/Drama/Thriller ($) Buy (Digital)\n\nJerry Seinfeld: 23 Hours to Kill Comedy special\n\nMillion Dollar Listing Los Angeles Reality Bravo, 10p\n\n▣ Tirdy Works Trailer Reality truTV, 10p\n\nAs someone once said, you go into quarantine with the moose turd business docuseries you have, not the moose turd business docuseries you might want or wish to have at a later time.\n\nTHU / May 7\n\nBad Mothers Trailer Drama Sundance Now\n\nFRI / May 8\n\nThe first TV series from director Damien Chazelle (La La Land, Whiplash) is yet another music-focused project. Written by Jack Thorne (National Treasure), with original songs from Glen Ballard and Randy Kerber, the gritty, multi-lingual, Paris-set series stars Andre Holland as a pianist and part-owner of a failing jazz club whose estranged teenage daughter (Amandla Stenberg) suddenly re-enters his life.\n\n▣ A Good Woman Is Hard to Find Drama/Thriller ($) Buy (Digital/VOD)\n\nBooksmart star Beanie Feldstein returns in another coming of age comedy, this time set in early 1990s London. She plays a decidedly uncool working-class teen who attempts to reinvent herself as a music critic for an NME-like magazine Coky Giedroyc's briskly paced adaptation of Caitlin Moran's semi-autobiographical book (written for the screen by Moran as well) also stars Paddy Considine, Emma Thompson, Alfie Allen, and Chris O'Dowd, while Elbow provides original music. Reviews were good out of the film's TIFF debut last fall, but current circumstances have canceled the planned theatrical release, leaving the film to debut on digital services.\n\nInto the Dark: Delivered Horror\n\nJimmy O Yang: Good Deal Trailer Comedy special Prime Video\n\nThe latest animated sci-fi comedy from Rick & Morty creator Justin Roiland (along with Mike McMahan, also a writer on Rick & Morty) centers on a family of aliens who find themselves forced to live in America. The voice cast is led by Roiland, Thomas Middleditch, Sean Giambrone, and Mary Mack. All eight episodes will be available to stream today, and the series has already been renewed for a second season.\n\nValeria Trailer Foreign/Drama\n\nSUN / May 10\n\nCall Your Mother Trailer Documentary 10p\n\nGordon Ramsay: Uncharted Reality Nat Geo, 10p\n\nRescheduled from April. Written and directed by Derek Cianfrance (The Place Beyond the Pines), this six-episode adaptation of Wally Lamb’s 1998 best-seller stars Mark Ruffalo in dual roles as very different identical twins. (Ruffalo gained 30 pounds to play one of the twins, whose weight is affected by medications he takes to treat his schizophrenia.) Rosie O'Donnell, Melissa Leo, Juliette Lewis, Kathryn Hahn, Imogen Poots, Rob Huebel, and Archie Panjabi also star.\n\nWorst Cooks in America: Celebrity Edition Reality competition Food, 9p\n\nMON / May 11\n\nBarkitecture Reality Quibi\n\nDude Perfect: Backstage Pass Trailer Documentary YouTube\n\nHave a Good Trip: Adventures in Psychedelics Documentary\n\nA Royal Tour of the 20th Century Reality Acorn TV\n\nTrial by Media Documentary\n\nTUE / May 12\n\n▣ Capone Trailer Drama ($) Buy (Digital)\n\nTom Hardy stars as Al Capone in a biopic directed by Josh Trank (Fantastic Four). Formerly titled Fonzo, the film was originally intended as a theatrical release but is now a straight-to-VOD title.\n\n▣ Fantasy Island Thriller/Comedy/Adventure ($) Rent (Digital)\n\nThe Happy Days of Garry Marshall Trailer Special 8p\n\n▣ The Invisible Man Thriller/Horror/Sci-fi ($) Buy (Digital)\n\n▣ The Traitor Foreign/Drama ($) Buy (Digital)\n\nUnbreakable Kimmy Schmidt: Kimmy vs. the Reverend Interactive special\n\nThe canceled comedy series returns with a one-off episode that utilizes the interactive, choose-your-own-adventure-style format of previous Netflix programming like Bandersnatch. The entire cast returns, while new and returning guests include Jon Hamm, Jack McBrayer, Fred Armisen, Daniel Radcliffe, Amy Sedaris, and Chris Parnell.\n\nTHU / May 14\n\nThe Misery Index Game show TBS, 10:30p\n\nFRI / May 15\n\nBasketball County: In the Water Documentary/Sports 9p\n\nBattleBots Robot sports Discovery, 8p\n\nThis irreverent take on historical fiction from The Favourite screenwriter Tony McNamara traces the rise of Catherine the Great (Elle Fanning) in 18th century Russia. Nicholas Hoult, Phoebe Fox, and Adam Godley also star.\n\nMasters of Illusion Reality 8p\n\nSUN / May 17\n\nAn American Aristocrat's Guide to Great Estates Reality Smithsonian, 9p\n\n▣ Hightown Trailer Drama Starz, 8p\n\nMonica Raymund and James Badge Dale head the cast of this eight-episode crime drama set on Cape Cod.\n\n▣ Snowpiercer Trailer Drama/Sci-fi TNT, 9p\n\nRecently moved forward from May 31. First, it was graphic novel. Then, a well-reviewed 2013 film from future Parasite director Bong Joon-ho. Then it was set to become a TNT series. Then it was a TBS series. Then it was a TNT series again. Along the way, the original showrunner (Josh Friedman) and director (Scott Derrickson) left the show due to creative differences after filming a pilot (itself the result of a two-year development process). From the wreckage several years later comes a very different adaptation from Orphan Black creator Graeme Manson. Like the film, the series is set in a frigid, post-apocalyptic future aboard a perpetually moving train (containing 1,001 cars that house Earth's remaining human population) where class differences play out in various ways. Daveed Diggs and Jennifer Connelly head the cast, and the show has already been renewed for a second season, which will add Sean Bean in a major role.\n\nMON / May 18\n\nDead Still Trailer Drama/Comedy Acorn TV\n\nAcorn original series is a comedic, Victorian-era murder-mystery starring Michael Smiley (Luther) and Kerr Logan (Game of Thrones). Two episodes stream today.\n\nPrivate Lives of the Monarchs Reality Smithsonian, 9p\n\nTUE / May 19\n\n▣ Downhill Trailer Comedy/Drama ($) Buy (Digital)\n\nThe Genetic Detective Reality 10p\n\nPatton Oswalt: I Love Everything Comedy special\n\n▣ Stargirl Trailer Drama 9p\n\nFormerly ordered as a DC Unviserse exclusive (it'll now stream there one day before each episode airs on broadcast television, starting May 11), this Greg Berlanti-produced live-action series adaptation of Geoff Johns' comics stars Courtney Whitmore (Bella and the Bulldogs) as the titular heroine. Joel McHale, Luke Wilson, Amy Smart, and Henry Thomas also star.\n\n▣ Tokyo Godfathers Anime ($) Buy (Digital)\n\nOne of several anime classics from the late Japanese filmmaker Satoshi Kon (Perfect Blue, Paprika), this 2003 retelling of Peter B. Kyne's novel Three Godfathers (which was also adapted into a 1948 John Wayne film) has its belated debut U.S. theatrical run interrupted by the coronavirus in March. But now this new 4K remaster (boasting its first-ever English-language dub) heads to digital outlets today and disc next month.\n\nWED / May 20\n\nThe 100 Drama/Sci-fi 8p\n\nThe Amazing Race Reality competition 8p\n\nThis season was filmed in its entirety prior to the spread of the coronavirus, so no episodes were impacted.\n\nMarried at First Sight: Couples' Cam Reality Lifetime, 8p\n\n▣ Ultimate Tag Trailer Game show 9p\n\nIt may sound like an act of desperation from a network that has run out of content thanks to the industry-wide production halt, but this primetime game of tag was actually in the works long before the pandemic. (Obviously so, now that we think about it; tag isn't very compelling when the contestants have to remain six feet apart.) NFL stars JJ, TJ, and Derek Watt host.\n\nTHU / May 21\n\nBurden of Truth Drama 8p\n\nCelebrity Escape Room Special 8p\n\nNBC's annual \"Red Nose Day\" fundraiser kicks off with a group of celebrities (including Jack Black, Ben Stiller, Adam Scott, Courteney Cox, and Lisa Kudrow) attempting to solve an escape room.\n\nHoley Moley Game show 9p\n\nLabor of Love Trailer Reality 9p\n\nLove Island Reality 8p\n\nPenance Trailer Drama Sundance Now\n\nRed Nose Day Special Variety 9p\n\n▣ The Split Drama Sundance, midnight\n\nTo Tell the Truth Game show 10p\n\nFRI / May 22\n\nAKA Jane Roe Documentary 9p\n\n▣ Homecoming Trailer Drama Prime Video\n\nAmazon's acclaimed drama series will be almost unreognizable in its second season. Among the changes: Star Julia Roberts is gone, as is much of the first season's cast—though Hong Chau and Stephan James will be back. Series creator Sam Esmail, who directed all 10 episodes last season, is stepping back and will not direct any this year (those duties fall to Kyle Patrick Alvarez), and the show will no longer draw on the podcast of the same name for its story (having already moved in a different direction with its plotting). The new season will focus on a new character played by Janelle Monáe, who opens the season as a woman floating in a canoe with no memory of how she got there. Other new faces include Chris Cooper and Joan Cusack.\n\nStars Steve Coogan and Rob Brydon reunite with director Michael Winterbottom for the fourth film in their comedic travelogue series.\n\n▣ Villain Trailer Drama/Thriller ($) Buy (Digital/VOD)\n\nSAT / May 23\n\nSpelling the Dream Documentary\n\nMON / May 25\n\nBarkskins Trailer Drama Nat Geo, 9p\n\nThis eight-part adaptation of Annie Proulx's novel about a conflict between French and English settlers in a small 1690s settlement in forested territory that is now Quebec stars David Thewlis and Marcia Gay Harden. Two episodes air back-to-back tonight and on each of the next three Mondays.\n\nI Was Lorena Bobbitt Drama Lifetime, 8p\n\nTUE / May 26\n\nHannah Gadsby: Douglas Comedy special\n\nWED / May 27\n\nFRI / May 29\n\nCentral Park Trailer Animation/Comedy/Musical Apple TV+\n\nThe latest animated series from Bob's Burgers creator Loren Bouchard is a music-filled comedy following a family living in the titular New York landmark, where they oversee its operations. Kristen Bell, Josh Gad (who co-created the series), Leslie Odom Jr., Kathryn Hahn, Tituss Burgess, Daveed Diggs, and Stanley Tucci provide the voices. The series has already been renewed for a second season.\n\n▣ Ramy Comedy\n\nRamy Youssef's critically acclaimed comedy series returns for a second season that features a guest appearance by Mahershala Ali. All 10 episodes stream today.\n\n▣ Space Force Comedy\n\nThe Office vets Steve Carell, Greg Daniels, and Howard Klein reunite for another workplace comedy—and, yes, that workplace is indeed the newest branch of the American armed services, just as they are getting off the ground (so to speak). Carell stars opposite John Malkovich, Lisa Kudrow, Ben Schwartz, Noah Emmerich, Jessica St. Clair, Tawny Newsome, Fred Willard, Diana Silvers, and Jimmy O. Yang.\n\nSAT / May 30\n\nHeartland Docs, DVM Reality Nat Geo Wild, 8p\n\nSUN / May 31\n\nCelebrity Family Feud Game show 8p\n\nDr. K's Exotic Animal ER Reality Nat Geo Wild, 9p\n\nLaurel Canyon Documentary/Music Epix, 10p\n\nMatch Game Game show 10p\n\nPress Your Luck Game show 9p\n\n▣ Quiz Drama 9p", "images": ["https://static.metacritic.com/images/features/networks/comedycentralnew20.png", "https://static.metacritic.com/images/features/main/peacock202004-28.jpg", "https://static.metacritic.com/images/products/tv/1/e951216810bf9b9c61f45b87bdcbf5d8-98.jpg", "https://static.metacritic.com/images/products/tv/8/5a6f27965ef2e3b9c6c41d7ba2cb7e19-98.jpg", "https://static.metacritic.com/images/products/movies/8/49c291191b4b6d4686707f8c802e4462-98.jpg", "https://static.metacritic.com/images/features/main/best_games_2019_residentevil2-28.jpg", "https://static.metacritic.com/images/features/main/tvpremieredates-28.jpg", "https://static.metacritic.com/images/features/main/decade_best_games_breathofthewild-28.jpg", "https://static.metacritic.com/images/features/networks/hulu15transparent.png", "http://static.metacritic.com/images/features/networks/fx20.png", "https://static.metacritic.com/images/features/main/starz202003-50.jpg", "https://static.metacritic.com/images/products/music/9/913ead22b9fdf9f19229581e3914c2b0-98.jpg", "https://static.metacritic.com/images/features/main/fullyear_movies3-28.jpg", "https://static.metacritic.com/images/products/music/5/03fa2f48e7537482619037aa9936c1e8-98.jpg", "https://static.metacritic.com/images/features/main/tvpreview_2020_04killingeve-50.jpg", "https://static.metacritic.com/images/features/main/peacock202004-180.jpg", "https://www.metacritic.com/images/icons/search_inactive.svg", "https://static.metacritic.com/images/products/games/2/0c6d00c4427046c3d07cc2555b943d32-98.jpg", "https://static.metacritic.com/images/features/main/coronavirusdelays-180.jpg", "https://static.metacritic.com/images/features/main/amazon202004-50.jpg", "https://static.metacritic.com/images/features/networks/netflixnew50.jpg", "https://static.metacritic.com/images/products/tv/1/b15171baa9dc05e4ed73098b885c3eb4-98.jpg", "https://static.metacritic.com/images/features/networks/abc20.png", "https://www.metacritic.com/images/icons/metacritic-wordmark.svg", "https://static.metacritic.com/images/features/_graphics/miniseries.gif", "https://static.metacritic.com/images/products/movies/0/3a6527d4d2499240200465561fc7b4a7-98.jpg", "https://static.metacritic.com/images/products/tv/4/2f5d95e7c790ba802ca147105966cb8e-98.jpg", "https://static.metacritic.com/images/products/music/4/ff948221ddeb6cc42360a2e2506f7b69-98.jpg", "https://static.metacritic.com/images/features/main/mustwatchshows-50.jpg", "https://www.metacritic.com/images/icons/mc-mustwatch-sm.svg", "https://static.metacritic.com/images/features/main/gamesscorecard2020Q1alt-180.jpg", "https://static.metacritic.com/images/products/music/6/3fac9024d9a862da5cb23f87a4853448-98.jpg", "https://static.metacritic.com/images/features/main/appletvplus202003-50.jpg", "https://static.metacritic.com/images/features/main/dvd_2020_04-180.jpg", "https://static.metacritic.com/images/features/media/graphics/new.gif", "https://static.metacritic.com/images/features/_graphics/movie.gif", "https://www.metacritic.com/media/networks/pbs25.png", "https://static.metacritic.com/images/features/main/quibi_april2020-50.jpg", "https://static.metacritic.com/images/products/movies/0/e2d70ac851a1bbdebc986fe443a4b3ba-98.jpg", "https://www.metacritic.com/images/icons/mc-mustplay-sm.svg", "https://www.metacritic.com/images/icons/metacritic-icon.svg", "https://static.metacritic.com/images/products/movies/1/66f6608a0310cf4a3e4c7f2190d18763-98.jpg", "https://static.metacritic.com/images/products/tv/7/23cf7c77f75f932de5ad18fa0142c724-98.jpg", "https://static.metacritic.com/images/features/networks/fox20.png", "https://static.metacritic.com/images/features/networks/nbc20.png", "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "https://static.metacritic.com/images/products/music/0/5ab703f43374c176ca247856465dccad-98.jpg", "https://static.metacritic.com/images/features/networks/showtime20.png", "https://static.metacritic.com/images/products/movies/1/dadac636aa14c3b9b9feea1ce09fb43e-98.jpg", "https://static.metacritic.com/images/products/games/5/f174e5f35cf726f0e75fa90ca3d9f83b-98.jpg", "https://static.metacritic.com/images/products/games/4/559d5752e81e5bd977817d9de26bfe4b-98.jpg", "https://static.metacritic.com/images/features/main/dvd_2020_04-50.jpg", "https://www.metacritic.com/media/networks/cw20.png", "https://static.metacritic.com/images/features/_graphics/special.gif", "https://static.metacritic.com/images/features/networks/cbs20.png", "https://static.metacritic.com/images/features/networks/amc20.png", "https://static.metacritic.com/images/features/main/peacock202004-50.jpg", "https://static.metacritic.com/images/features/main/coronavirusdelays-28.jpg", "https://static.metacritic.com/images/features/networks/hbo20.png", "https://static.metacritic.com/images/products/games/2/fc2b1036e9ce9e224d11e32d5571a5bc-98.jpg", "https://static.metacritic.com/images/products/games/5/e5d85ca5a8ec5a987c8d6fd04625ec14-98.jpg"], "top_img": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.metacritic.com/feature/tv-premiere-dates", "title": "2020 Spring/Summer TV Premiere Calendar", "meta_data": {"description": "Find a calendar of premiere dates for all upcoming new and returning television shows, plus TV movies and specials.", "viewport": "width=1024", "application-name": "Metacritic", "msapplication-TileColor": "#000000", "msapplication-TileImage": "/images/win8tile/76bf1426-2886-4b87-ae1c-06424b6bb8a2.png", "og": {"title": "2020 Spring/Summer TV Premiere Calendar", "type": "article", "url": "https://www.metacritic.com/feature/tv-premiere-dates", "image": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "site_name": "Metacritic", "description": "Find a calendar of premiere dates for all upcoming new and returning television shows, plus TV movies and specials."}, "fb": {"app_id": 123113677890173}, "twitter": {"site": "@metacritic", "creator": "@metacritic", "card": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg"}}, "movies": [], "publish_date": null, "source": "https://www.metacritic.com", "summary": ""}