{"url": "https://www.independent.co.uk/arts-entertainment/tv/news/thandie-newton-emmys-speech-full-dress-award-westworld-supporting-actress-a8542481.html", "text": "Thandie Newton gave a moving acceptance speech after being announced as the winner for Outstanding Supporting Actress at this year's Emmy Awards.\n\nThe Westworld star prompted laughter from the audience at the Hollywood ceremony when she began with \"I don't even believe in God but I'm going to thank her tonight\".\n\nShe told the aurdience: \"I am so blessed. I am so f***ing blessed...\" At this point the actress clapped her hand over her mouth as she realised she'd dropped the expletive – to more cheers from the audience.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\n\"To work with the people that I have gotten to work with,\" she said. \"The cast and crew of – I can't believe I'm here – the cast and crew of Westworld, I love you all so much.\"\n\nNewton beat The Handmaid's Tale stars Ann Dowd, Yvonne Strahovski and Alexis Blediel, Game of Thrones' Lena Headey, Millie Bobby Brown from Stranger Things, and Vanessa Kirby from The Crown to win the award. She revealed that the day was all the more special because it was her daughter's 18th birthday.\n\n\"My family, my daughter Ripley turns 18 today and I get to guide you and love you and protect you, which is my north star, I love you so much baby,\" she said. \"Thank you, thank you for this,\" she concluded, before walking offstage with The Handmaid's Tale stars Elisabeth Moss and Samira Wiley, who had presented her with the award.\n\nIt was Newton's second nomination and her first win at the Emmys. She was previously nominated for the same role in Westworld last year.\n\nShape Created with Sketch. Emmys 2018: Best-dressed celebrities of the night Show all 40 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Emmys 2018: Best-dressed celebrities of the night 1/40 Allison Janney She might've been battling bronchitis, but the 'I, Tonya' actor still managed to turn up looking radiant in a fuchsia gown by Prabal Gurung. Getty Images 2/40 Chrissy Metz The 'This is Us' actor was a vision in this custom emerald green gown by John Paul Ataker. Getty Images 3/40 Sandra Oh Thanks to her leading role in the acclaimed series 'Killing Eve', Oh is having a moment. Proving her style credentials on arrival, the former 'Grey's Anatomy' star donned a plunging burgundy satin gown by Ralph and Russo. AFP/Getty Images 4/40 Jessica Biel and Justin Timberlake Hollywood couples get no better than Biel and Timberlake, who once again prove that they are quite literally the perfect pairing, romantically and visually. While the 'Can't stop the feeling!' singer kept things slick and simple in a black tuxedo, The 'Sinner' actor evoked regal charm with a muted strapless gown by Ralph and Russo. Getty Images 5/40 Ann Dowd Trading Gilead for Hollywood, the 'Handmaid's Tale' actor channelled a melancholic aesthetic on the beige carpet via a billowing silhouette and dark, solemn florals. Getty Images 6/40 Jimmy Kimmel and Molly McNearney The late-night TV host opted for a classic black tuxedo with all the trimmings (waistcoat, bow tie, shiny shoes), while McNearney's gown added a splash of sunshine to the duo's overall aesthetic in a lemon pleated gown. Getty Images 7/40 John Legend Navy blue never looked so good. Tailored to the nines and paired with a bow tie, the 'Jesus Christ Superstar' performer wore his formalwear with aplomb. Getty Images 8/40 Alison Brie Switching her wrestling garb for a slightly more upscale ensemble, Brie really did 'GLOW' her way down the beige carpet in a canary yellow column gown by Miu Miu, complete with Swarovski crystals and cut-out detail on the waist. Getty Images 9/40 Rachel Brosnahan Taking home the award for lead actress in a comedy series, the 'Marvellous Mrs Maisel' star was the epitome of Chris de Burgh's 'Lady in Red', wearing a stunning scarlet gown by Oscar de la Renta complete with off-the-shoulder detail. Getty Images 10/40 Jonathan Van Ness The 'Queer Eye' TV personality pulled no punches when it came to his red carpet look. The 70s flared Stella McCartney suit is given a flamboyant upgrade via a sheer Prada blouse that has a whiff of Marie Antoinette about it thanks to its high-neck. The deep violet clutch by The Row is the cherry on top. Getty Images 11/40 Stefani Robinson Wearing one of J.Mendel's more fairytale-like creations, the 'Atlanta' writer offset the girlish glamour of her puffy tulle skirt with a slick of dark burgundy lipstick. Getty Images 12/40 Evan Rachel Wood You'd be forgiven for thinking the 'Westworld' actor could've been a little more experimental with her occasionwear. But the subtle hints of a floral headpiece uplift her all-black tailored look by Altuzarra with an ethereal nymph-like charm. Getty Images 13/40 Millie Bobby Brown The 'Stranger Things' star knows a thing or two about red carpet events by now, having been attending them since the tender age of 12. Now 14, the teenager is a total pro, as illustrated by this millennial pink princess frock by Calvin Klein. Getty Images 14/40 Claire Foy Few could pull off the severity of stiff cream satin, but Foy manages to flourish under such circumstances. Keeping accessories and hairstyling to a minimum, the British rose radiates with natural beauty. Getty Images 15/40 Elisabeth Moss Sporting a peachy sun-kissed glow, the 'Handmaid's Tale' star opted for a black strapless gown by Vera Wang, allowing her blonde tresses to rest comfortably in gentle waves on her clavicle. Getty Images 16/40 Thandie Newton Prior to picking up the award for outstanding supporting actress, the 'Westworld' actor scooped a sartorial accolade in a fitted fuchsia gown hot off Brandon Maxwell's New York Fashion Week runway. Getty Images 17/40 Kirsten Dunst Sometimes all you need is a floor-length deep blue gown and blonde Hollywood waves to make a statement on the red carpet - and Dunst succeeds effortlessly, completing the look with sparkling diamond earrings and a peachy lip hue. Getty Images 18/40 Chrissy Teigen Not an inch of Teigen's eye-popping ensemble remains unsaturated by sparkle. This Zuhair Murad creation comes complete with a thigh-high slit and a triangular neckline that brings an angular twist to Teigen's perennial goddess vibe. Getty Images 19/40 Maya Rudolph A romantic blend of black lace, the 'Bridesmaids' actor channelled a sombre mood with her midi Simone Rocha gown, adding only a sliver of colour to the look via a subtle rosy lip shade. Getty Images 20/40 Sophie Hunter and Benedict Cumberbatch Who needs to wear more than one shade when the hue is so egg-yolky vibrant and the silhouette so sharp? Cumberbatch may look dapper in his three-piece, but it's Hunter whose sartorial prowess prevails here. Getty Images 21/40 Vanessa Kirby Not usually one for pastels, Kirby beguiles in this fitted satin gown by Tom Ford, which, in a muted shade of rose, highlights the British actor's flawless complexion. Getty Images 22/40 Dakota Fanning Dior Haute Couture can do no wrong and Fanning wears it with grace. This sea green pleated gown strikes a Shakespearean chord, thanks to the Alienist's 175 carats worth of jewellery by Lorraine Schwartz, proving that all that glitters is not gold, it's actually emerald. Getty Images 23/40 Scarlett Johansson A darling in Dolce & Gabbana, Johansson is the picture-perfect celebrity guest. Drop earrings - check; dynamic neckline - check; thigh-high slit - check. This look ticks all the boxes and even some circles too. Getty Images 24/40 Sarah Paulson Only Oscar de la Renta could immerse you in a feathered fantasy so abundant without seeming trite. Quite rightly, Paulson lets her extroverted gown do the talking here, keeping her neck free from the distraction of jewellery and slicking her hair back in a simple bun. Getty Images 25/40 Kit Harington The 'Game of Thrones' star shunned occasionwear conventions by opting for a slim daytime tie as opposed to its ribbony counterpart. He did, however, still wear a black suit. So that's something. Getty Images 26/40 Gwendoline Christie Looking like the lady of the manor, Christie cut a statuesque silhouette in this glistening golden robed gown. Getty Images 27/40 Sarah Silverman In true runway ready fashion, Silverman cinched her voluminous Galia Lahav gown in at the waist with a simple black belt, giving every last poof of fabric either side the attention it deserves. Getty Images 28/40 Emilia Clarke A vision in Dior, Clarke opted for a darker and twistier look than normal which came complete with a heavily-laced bodice and ornamental floral embellishments. Getty Images 29/40 Amanda Peet The US actor donned a forest green v-neck gown for the proceedings, complemented by a vibrant slick of red lipstick. Getty Images 30/40 James Corden and Julia Carey Corden added a bolt of primary pleasure to his tuxedo with his jolly bright blue jacket. Meanwhile, Carey opted for a fitted fishtail gown with ornate lace sleeves. Getty Images 31/40 Nukaaka Coster-Waldau and Nikolaj Coster-Waldau While mustard is not a colour frequented by many at red carpet events, it works a treat here, particularly when worn alongside your wife's pale lime satin gown. Getty Images 32/40 Michelle Dockery The 'Downton Abbey' star opted for a sky blue gown by Carolina Herrera. Getty Images 33/40 Tiffany Haddish Multi-coloured gowns are a rare sight at modern-day award ceremonies, but Haddish demonstrates they are due a renaissance via this Prabal Gurung creation. Getty Images 34/40 Tina Fey Like many of her fellow attendees, Fey subverted feminine floral norms by wearing a darker and more decorative design. Yes, there are flower-like patterns, but the overriding theme is one of romantic melancholy rather than springtime joy. Getty Images 35/40 Poppy Delevingne The British model turned heads in a turquoise gown by Giambattista Valli couture, an eternal favourite on award ceremony red carpets. Getty Images 36/40 Letitia Wright The 'Black Panther' actor maintained a demure aesthetic in this sparkly Pamella Roland gown. Getty Images 37/40 Mandy Moore The 'This is Us' actor could've led a masterclass in metallics in this Rodarte gown, which complemented the lustrous shine of her brunette locks. Getty Images 38/40 Kristen Bell Boxy necklines are always a winner when it comes to formalwear and Bell accentuates the sophistication via this long-sleeved Solace London gown, whose stark white shade makes quite the impact. Getty Images 39/40 Heidi Klum It would be hard for the German model to wear something that doesn't make her look like a Greek statue. With a cinched-in bodice and a sweeping train, this satin Zac Posen gown is no different. Getty Images 40/40 Alexis Bledel Battenberg cake gets a sartorial re-imagining in this Delpozo gown, whose pastel lemon and pink shades come together in tender tandem. Getty Images 1/40 Allison Janney She might've been battling bronchitis, but the 'I, Tonya' actor still managed to turn up looking radiant in a fuchsia gown by Prabal Gurung. Getty Images 2/40 Chrissy Metz The 'This is Us' actor was a vision in this custom emerald green gown by John Paul Ataker. Getty Images 3/40 Sandra Oh Thanks to her leading role in the acclaimed series 'Killing Eve', Oh is having a moment. Proving her style credentials on arrival, the former 'Grey's Anatomy' star donned a plunging burgundy satin gown by Ralph and Russo. AFP/Getty Images 4/40 Jessica Biel and Justin Timberlake Hollywood couples get no better than Biel and Timberlake, who once again prove that they are quite literally the perfect pairing, romantically and visually. While the 'Can't stop the feeling!' singer kept things slick and simple in a black tuxedo, The 'Sinner' actor evoked regal charm with a muted strapless gown by Ralph and Russo. Getty Images 5/40 Ann Dowd Trading Gilead for Hollywood, the 'Handmaid's Tale' actor channelled a melancholic aesthetic on the beige carpet via a billowing silhouette and dark, solemn florals. Getty Images 6/40 Jimmy Kimmel and Molly McNearney The late-night TV host opted for a classic black tuxedo with all the trimmings (waistcoat, bow tie, shiny shoes), while McNearney's gown added a splash of sunshine to the duo's overall aesthetic in a lemon pleated gown. Getty Images 7/40 John Legend Navy blue never looked so good. Tailored to the nines and paired with a bow tie, the 'Jesus Christ Superstar' performer wore his formalwear with aplomb. Getty Images 8/40 Alison Brie Switching her wrestling garb for a slightly more upscale ensemble, Brie really did 'GLOW' her way down the beige carpet in a canary yellow column gown by Miu Miu, complete with Swarovski crystals and cut-out detail on the waist. Getty Images 9/40 Rachel Brosnahan Taking home the award for lead actress in a comedy series, the 'Marvellous Mrs Maisel' star was the epitome of Chris de Burgh's 'Lady in Red', wearing a stunning scarlet gown by Oscar de la Renta complete with off-the-shoulder detail. Getty Images 10/40 Jonathan Van Ness The 'Queer Eye' TV personality pulled no punches when it came to his red carpet look. The 70s flared Stella McCartney suit is given a flamboyant upgrade via a sheer Prada blouse that has a whiff of Marie Antoinette about it thanks to its high-neck. The deep violet clutch by The Row is the cherry on top. Getty Images 11/40 Stefani Robinson Wearing one of J.Mendel's more fairytale-like creations, the 'Atlanta' writer offset the girlish glamour of her puffy tulle skirt with a slick of dark burgundy lipstick. Getty Images 12/40 Evan Rachel Wood You'd be forgiven for thinking the 'Westworld' actor could've been a little more experimental with her occasionwear. But the subtle hints of a floral headpiece uplift her all-black tailored look by Altuzarra with an ethereal nymph-like charm. Getty Images 13/40 Millie Bobby Brown The 'Stranger Things' star knows a thing or two about red carpet events by now, having been attending them since the tender age of 12. Now 14, the teenager is a total pro, as illustrated by this millennial pink princess frock by Calvin Klein. Getty Images 14/40 Claire Foy Few could pull off the severity of stiff cream satin, but Foy manages to flourish under such circumstances. Keeping accessories and hairstyling to a minimum, the British rose radiates with natural beauty. Getty Images 15/40 Elisabeth Moss Sporting a peachy sun-kissed glow, the 'Handmaid's Tale' star opted for a black strapless gown by Vera Wang, allowing her blonde tresses to rest comfortably in gentle waves on her clavicle. Getty Images 16/40 Thandie Newton Prior to picking up the award for outstanding supporting actress, the 'Westworld' actor scooped a sartorial accolade in a fitted fuchsia gown hot off Brandon Maxwell's New York Fashion Week runway. Getty Images 17/40 Kirsten Dunst Sometimes all you need is a floor-length deep blue gown and blonde Hollywood waves to make a statement on the red carpet - and Dunst succeeds effortlessly, completing the look with sparkling diamond earrings and a peachy lip hue. Getty Images 18/40 Chrissy Teigen Not an inch of Teigen's eye-popping ensemble remains unsaturated by sparkle. This Zuhair Murad creation comes complete with a thigh-high slit and a triangular neckline that brings an angular twist to Teigen's perennial goddess vibe. Getty Images 19/40 Maya Rudolph A romantic blend of black lace, the 'Bridesmaids' actor channelled a sombre mood with her midi Simone Rocha gown, adding only a sliver of colour to the look via a subtle rosy lip shade. Getty Images 20/40 Sophie Hunter and Benedict Cumberbatch Who needs to wear more than one shade when the hue is so egg-yolky vibrant and the silhouette so sharp? Cumberbatch may look dapper in his three-piece, but it's Hunter whose sartorial prowess prevails here. Getty Images 21/40 Vanessa Kirby Not usually one for pastels, Kirby beguiles in this fitted satin gown by Tom Ford, which, in a muted shade of rose, highlights the British actor's flawless complexion. Getty Images 22/40 Dakota Fanning Dior Haute Couture can do no wrong and Fanning wears it with grace. This sea green pleated gown strikes a Shakespearean chord, thanks to the Alienist's 175 carats worth of jewellery by Lorraine Schwartz, proving that all that glitters is not gold, it's actually emerald. Getty Images 23/40 Scarlett Johansson A darling in Dolce & Gabbana, Johansson is the picture-perfect celebrity guest. Drop earrings - check; dynamic neckline - check; thigh-high slit - check. This look ticks all the boxes and even some circles too. Getty Images 24/40 Sarah Paulson Only Oscar de la Renta could immerse you in a feathered fantasy so abundant without seeming trite. Quite rightly, Paulson lets her extroverted gown do the talking here, keeping her neck free from the distraction of jewellery and slicking her hair back in a simple bun. Getty Images 25/40 Kit Harington The 'Game of Thrones' star shunned occasionwear conventions by opting for a slim daytime tie as opposed to its ribbony counterpart. He did, however, still wear a black suit. So that's something. Getty Images 26/40 Gwendoline Christie Looking like the lady of the manor, Christie cut a statuesque silhouette in this glistening golden robed gown. Getty Images 27/40 Sarah Silverman In true runway ready fashion, Silverman cinched her voluminous Galia Lahav gown in at the waist with a simple black belt, giving every last poof of fabric either side the attention it deserves. Getty Images 28/40 Emilia Clarke A vision in Dior, Clarke opted for a darker and twistier look than normal which came complete with a heavily-laced bodice and ornamental floral embellishments. Getty Images 29/40 Amanda Peet The US actor donned a forest green v-neck gown for the proceedings, complemented by a vibrant slick of red lipstick. Getty Images 30/40 James Corden and Julia Carey Corden added a bolt of primary pleasure to his tuxedo with his jolly bright blue jacket. Meanwhile, Carey opted for a fitted fishtail gown with ornate lace sleeves. Getty Images 31/40 Nukaaka Coster-Waldau and Nikolaj Coster-Waldau While mustard is not a colour frequented by many at red carpet events, it works a treat here, particularly when worn alongside your wife's pale lime satin gown. Getty Images 32/40 Michelle Dockery The 'Downton Abbey' star opted for a sky blue gown by Carolina Herrera. Getty Images 33/40 Tiffany Haddish Multi-coloured gowns are a rare sight at modern-day award ceremonies, but Haddish demonstrates they are due a renaissance via this Prabal Gurung creation. Getty Images 34/40 Tina Fey Like many of her fellow attendees, Fey subverted feminine floral norms by wearing a darker and more decorative design. Yes, there are flower-like patterns, but the overriding theme is one of romantic melancholy rather than springtime joy. Getty Images 35/40 Poppy Delevingne The British model turned heads in a turquoise gown by Giambattista Valli couture, an eternal favourite on award ceremony red carpets. Getty Images 36/40 Letitia Wright The 'Black Panther' actor maintained a demure aesthetic in this sparkly Pamella Roland gown. Getty Images 37/40 Mandy Moore The 'This is Us' actor could've led a masterclass in metallics in this Rodarte gown, which complemented the lustrous shine of her brunette locks. Getty Images 38/40 Kristen Bell Boxy necklines are always a winner when it comes to formalwear and Bell accentuates the sophistication via this long-sleeved Solace London gown, whose stark white shade makes quite the impact. Getty Images 39/40 Heidi Klum It would be hard for the German model to wear something that doesn't make her look like a Greek statue. With a cinched-in bodice and a sweeping train, this satin Zac Posen gown is no different. Getty Images 40/40 Alexis Bledel Battenberg cake gets a sartorial re-imagining in this Delpozo gown, whose pastel lemon and pink shades come together in tender tandem. Getty Images\n\nThis year's Emmy Awards were relatively uneventful, with highlights being off-script moments such as director Glenn Weiss proposing to his partner Jan Svendsen onstage.\n\nCo-hosted by Saturday Night Live's Colin Josh and MIchael Che, the ceremony saw Game of Thrones emerge as the biggest winner on the night, while Atlanta fans were left disappointed as the acclaimed FX comedy left empty handed.\n\nGame of Thrones' win for Outstanding Drama Series raised a few eyebrows. As Ed Powers noted for The Independent, even the show's biggest fans would admit that the seventh series was littered with flaws and lacked the gravitas of previous seasons.\n\nWhat this year's Emmys did prove is how TV is rapidly changing, with its more \"obscure gems\" recognised among the traditional blockbuster winners.\n\nSee more of The Independent's Emmys coverage here.", "images": ["https://trc.taboola.com/1036135/log/3/unip?en=page_view", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/09/18/08/Thandie-Newton.jpg"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/09/18/08/Thandie-Newton.jpg", "keywords": [], "authors": ["Roisin O'Connor"], "canonical_link": "https://www.independent.co.uk/arts-entertainment/tv/news/thandie-newton-emmys-speech-full-dress-award-westworld-supporting-actress-a8542481.html", "title": "Emmy Awards: Thandie Newton gives emotional speech for Westworld win", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "https://www.independent.co.uk/arts-entertainment/tv/news/thandie-newton-emmys-speech-full-dress-award-westworld-supporting-actress-a8542481.html", "title": "Thandie Newton gives emotional speech for Emmy Awards win", "description": "Actress said the evening was particularly special because it was her daughter's 18th birthday", "updated_time": "2018-09-18T09:38:10+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/09/18/08/Thandie-Newton.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB", "video": {"identifier": "https://f1.media.brightcove.com/4/624246174001/624246174001_5836251354001_5836249512001.mp4?pubId=624246174001&videoId=5836249512001", "type": "application/octet-stream"}}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/8542481"}, "description": "Thandie Newton gave a moving acceptance speech after being announced as the winner for Outstanding Supporting Actress at this year's Emmy Awards.  The Westworld star prompted laughter from the audience at the Hollywood ceremony when she began with \"I don't even believe in God but I'm going to thank her tonight\".", "keywords": "Emmys 2018, Emmy Awards, Thandie Newton, Hollywood, Game of Thrones, Atlanta, News, TV & Radio, Culture", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Emmys 2018", "published_time": "2018-09-18T09:09:00+01:00", "modified_time": "2018-09-18T09:38:10+01:00", "section": "News", "subsection": "Video", "author_name": "Roisin O'Connor", "content_type": "story", "word_count": 441, "image_count": 2, "video_count": 0, "embed_count": 0, "internal_link_count": 13, "external_link_count": 0}, "twitter": {"title": "Thandie Newton gives emotional speech for Emmy Awards win", "description": "Thandie Newton gave a moving acceptance speech after being announced as the winner for Outstanding Supporting Actress at this year's Emmy Awards.  The Westworld star prompted laughter from the", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1537258140.0, "source": "https://www.independent.co.uk", "summary": ""}