{"url": "https://corporate.wwe.com/news/company-news/2017/09-19-2017", "text": "SEASON SEVEN OF E!’S SIZZLING HIT SERIES “TOTAL DIVAS” PREMIERES WEDNESDAY, NOVEMBER 1 AT 9PM ET/PT\n\nThe Bella Twins®, Naomi®, Maryse™, Lana® and Natalya® Return Along With New Cast Members Carmella™, Nia Jax™ and Alexa Bliss™\n\nSeason Seven Finale Will Mark the 100th Episode of the Successful Series\n\nLOS ANGELES, CA – SEPTEMBER 19, 2017– E! and WWE®’s “Total Divas®” returns for its fiery and fierce seventh season beginning Wednesday, November 1 at 9 pm ET/PT . Brie Bella®, Nikki Bella®, Naomi (Trinity), Natalya (Nattie), Lana and Maryse will join newcomers Carmella, Nia Jax and Alexa Bliss. These WWE Superstars will give viewers an exclusive glimpse at the demands of their professional careers and the challenges of their everyday lives. The season finale, airing January 31, 2018, will mark the show’s 100th episode. For a sneak peek at the ladies, please visit: http://eonli.ne/1pw0k68\n\nThis season, the cast travels around the world as they embark on new journeys, cross new thresholds and make difficult decisions about their futures in and out of the ring. Naomi is hoping to hit the trifecta effect; keeping her marriage fresh to fellow WWE Superstar Jimmy Uso™, maintaining a crazy schedule and taking a chance to stand out as the SmackDown® Live Women’s Champion.\n\nVeteran cast member Natalya challenges Naomi’s title reign in a heated rivalry for the SmackDown Live Women’s Championship, all culminating in a showdown at SummerSlam®, season seven’s most anticipated event. With the stakes higher than ever, the women must put on the best match of their lives.\n\nMeanwhile, The Bella Twins catch a case of “FOMO” during their time off from WWE. Together, they explore new ventures and contemplate when the best time would be to make their in-ring comeback. Off the heels of her whirlwind engagement to WWE Superstar John Cena®, Nikki Bella gets ready to twist and twirl when she receives an offer from Dancing with the Stars that is hard to refuse. While Nikki is celebrating her long-awaited engagement in Cabo San Lucas, her sister Brie Bella is working on balancing the demands of being a new mom to her baby girl Birdie and managing her and Nikki’s burgeoning businesses. To spend more time twinning, the ladies plan a road trip and head to San Diego for the summer with Brie’s husband, WWE Superstar Daniel Bryan® in tow.\n\nIt’s Vegas or bust when Maryse’s husband Mike “The Miz®” Mizanin refuses to leave Los Angeles after their second home burglary. With Maryse ready to head to Sin City, the two must decide where they will call home.\n\nLana struggles to prioritize her life as a newlywed and her new role on SmackDown Live. When her husband, WWE Superstar Rusev® reveals he wants a baby, she is torn between living her dream in the ring or starting a family sooner than later.\n\nNew cast member Carmella, thinks she hit the jackpot with her boyfriend WWE Superstar Big Cass™ who she believes is “the one.” However, with each of them planning on moving to opposite sides of the country, the future of their relationship depends on compromising on a new place to call home.\n\nNia Jax, cousin of Dwayne \"The Rock®” Johnson, is part of a coveted WWE legacy. Despite her famous linage, the dating world isn’t working out the way Nia hoped it would. The women help her explore who she is and what she wants in a partner.\n\nWith the growing rise of her career, Alexa Bliss is enjoying the fruits of her labor. But when her fiancé, NXT Superstar Buddy Murphy™ visits during the biggest match of season seven, she is forced to confront her uncertainty about marrying him.\n\n“Total Divas” is produced by WWE and Bunim/Murray Productions. Gil Goldschein, Jeff Jenkins and Russell Jay are Executive Producers for Bunim/Murray Productions. Kevin Dunn is Executive Producer for WWE. Nikki Bella serves as a Co-Executive Producer.\n\nSeason six of Total Divas averaged nearly 1 million total viewers and over 600K P18-49 and ranked across the Top 10 original programs on Wednesdays in Primetime (8-11pm) in ad-supported cable among key demos: P/W 18-49 and 18-34.\n\nRatings Source: Nielsen Ratings Report, L3 program data for full S6, ranks are for ad-supported cable original premieres in Primetime (8P-11P) and exclude pay cable, sports, specials, live events, and kids programming.\n\nTwitter:\n\nhttps://twitter.com/totaldivas\n\n\n\nInstagram:\n\nhttps://www.instagram.com/totaldivas\n\n\n\nFacebook:\n\nhttps://www.facebook.com/TotalDivas/\n\n\n\nHashtag:\n\n#TotalDivas\n\nMedia Village:\n\nhttps://www.nbcumv.com/programming/e-entertainment/total-divas?network=33136\n\nAbout E! Entertainment\n\nE! is the only global, multi-platform brand for all things pop culture. The network is currently available to 91 million cable and satellite subscribers in the U.S. \"E! News\" airs nightly on the network and is the leading multi-platform publisher delivering breaking entertainment news and pop culture coverage 24/7 across all digital and social media. E! programming includes popular series \"Keeping Up with the Kardashians,\" \"Total Divas,\" \"Botched,\" \"Hollywood Medium with Tyler Henry,\" \"WAGS,\" and \"Fashion Police,\" as well as the network's scripted series \"The Royals\" and “The Arrangement.” Additionally, E!'s \"Live from the Red Carpet\" signature events keep fans connected to their favorite stars on pop culture's biggest nights. E! is a network of NBCUniversal Cable Entertainment, a division of NBCUniversal, one of the world's leading media and entertainment companies in the development, production, and marketing of entertainment, news and information to a global audience. For more corporate information, visit www.nbcuniversal.com.\n\nAbout WWE\n\nWWE, a publicly traded company (NYSE: WWE), is an integrated media organization and recognized leader in global entertainment. The company consists of a portfolio of businesses that create and deliver original content 52 weeks a year to a global audience. WWE is committed to family friendly entertainment on its television programming, pay-per-view, digital media and publishing platforms. WWE programming reaches more than 650 million homes worldwide in 20 languages. WWE Network, the first-ever 24/7 over-the-top premium network that includes all live pay-per-views, scheduled programming and a massive video-on-demand library, is currently available in more than 180 countries. The company is headquartered in Stamford, Conn., with offices in New York, Los Angeles, London, Mexico City, Mumbai, Shanghai, Singapore, Dubai, Munich and Tokyo. Additional information on WWE (NYSE: WWE) can be found at wwe.com and corporate.wwe.com. For information on our global activities, go to http://www.wwe.com/worldwide/\n\nAbout Bunim/Murray Productions\n\nBunim/Murray Productions (BMP) is the leading producer of innovative entertainment content. The Emmy Award-winning company is widely credited with creating the reality television genre with its hit series “The Real World” (32 seasons on MTV). BMP continued to innovate with the first reality game show, “Road Rules” (MTV), in 1995; the first reality sitcom, “The Simple Life” (E!), in 2003; and the first reality soap opera, “Starting Over,” in 2003. BMP’s current programming includes “Keeping up with the Kardashians,” “Life of Kylie,” “Total Divas,” “Total Bellas” and “So Cosmo” (E!), “The Real World” and “The Challenge” (MTV), “Project Runway” and “Project Runway All Stars” (Lifetime), “Valerie’s Home Cooking” (Food Network), “Born This Way” (A&E), “Earth Live” (National Geographic), “Bill Nye Saves the World” (Netflix), “The Selection: Special Operations Experiment” (History), “The Healer” (TLC), “Chachi’s World” (go90), “GloBugz” (YouTube) and “Ball in the Family” (Facebook Watch) . BMP has also produced films, including “They Call Us Monsters,” “Valentine Road” (HBO), “Pedro” (MTV) and the Emmy Award-winning “Autism: The Musical” (HBO). BMP has launched additional entities including BMP Films, BMP Digital and BMP Latin. Based in Glendale, CA, the company was founded in 1987 by Jonathan Murray and the late Mary-Ellis Bunim, who were inducted into the Television Academy’s Hall of Fame in 2012. The company joined Banijay Group in 2010.\n\nPR Contact for “Total Divas”\n\nIvana Nimoh\n\n818- 684-5132\n\nIvana.Nimoh@nbcuni.com\n\n<< More News", "images": ["https://corporate.wwe.com/~/media/Images/W/WWE/logo/logo-small.png?h=58&la=en&w=65", "https://corporate.wwe.com/~/media/images/w/wwe/logo/wwe-twitter.jpg", "https://corporate.wwe.com/~/media/Images/W/WWE/logo/logo-black.jpg"], "top_img": "https://corporate.wwe.com/~/media/Images/W/WWE/logo/logo-black.jpg", "keywords": [], "authors": [], "canonical_link": "https://corporate.wwe.com/news/company-news/2017/09-19-2017", "title": "SEASON SEVEN OF E!’S SIZZLING HIT SERIES “TOTAL DIVAS” PREMIERES WEDNESDAY, NOVEMBER 1 AT 9PM ET/PT", "meta_data": {"description": "sup { top: -0.2em; } The Bella Twins®, Naomi®, Maryse™, Lana® and Natalya® Return Along With New Cast Members Carmella™, Nia Jax™ and Alexa Bliss™ Season Seven Finale Will Mark the 100th Episode of the Successful Series LOS ANGELES, CA – SEPTEMBER 19, 2017– E! and WWE®’s", "viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0", "twitter": {"card": "summary_large_image", "site": "@wwe", "title": "WWE Corporate", "description": "WWE corporate information, the recognized leader in global sports-entertainment.", "image": {"identifier": "https://corporate.wwe.com/~/media/Images/W/WWE/logo/wwe_tweet_image.jpg", "width": 435, "height": 375}, "url": "https://corporate.wwe.com/"}, "og": {"type": "Website", "url": "https://corporate.wwe.com/news/company-news/2017/09-19-2017", "title": "SEASON SEVEN OF E!’S SIZZLING HIT SERIES “TOTAL DIVAS” PREMIERES WEDNESDAY, NOVEMBER 1 AT 9PM ET/PT", "image": "https://corporate.wwe.com/~/media/Images/W/WWE/logo/logo-black.jpg"}}, "movies": [], "publish_date": 1505750400.0, "source": "https://corporate.wwe.com", "summary": ""}