{"url": "https://people.com/home/nicole-curtis-says-son-was-ripped-out-of-my-arms-on-thanksgiving-due-to-custody-agreement/", "text": "Nicole Curtis was separated from her three-year-old son, Harper, on Thanksgiving due to a strict custody arrangement. She opened up about her traumatic experience and trying to support other parents in similar situations to PEOPLE.\n\n“The holidays are a nightmare because I would have all of us together — friends, family, enemies alike,” the star of HGTV and DIY Network’s Rehab Addict tells PEOPLE, referring to her ex, Shane Maguire, with whom she shares child custody. “Thanksgiving was not my parenting time; therefore, I could not be with Harper.”\n\nGet push notifications with news, features and more.\n\nShe continues, “Even on the worst day, my ex is encouraged and welcomed in our home. We recently all went trick-or-treating together, even thought it was ‘my parenting time.’ I always hope that the same courtesy will be extended, but it is not. I am not permitted to be with Harper during his time with his dad.”\n\nMaguire’s attorney did not immediately respond to PEOPLE’s request for comment.\n\nRELATED: Nicole Curtis and Ex Maintain Joint Custody Agreement, Ending Years-Long Legal Battle Over Son\n\nCurtis and Maguire recently reached a custody agreement after an ugly, years-long legal battle, but adhering to the court-mandated hand-offs and subsequently being separated from her toddler for extended periods has been a struggle for the home renovation star, especially at his time of year.\n\n“I’ve been asked what my Thanksgiving plans are and receive horrified looks when I say, ‘Nothing,'” she wrote on Instagram on Thursday alongside a black-and-white photo of her, Harper, and her older son, Ethan, who she shares with ex Steven Cimini. “Of course every bone in my body yearns to cook, entertain and stuff myself full of Gram’s pie recipe that I never will get just right — but like so many others, we are trapped in the fd[sic] world of ‘not your parenting time.'”\n\nImage zoom Nicole Curtis/Instagram\n\nDespite her frustration with the arrangement, Curtis says she’d welcome a blended family holiday — “I would have my ex at my dining room table today, but’s not up to me,” she wrote — but she has a serious critique seemingly aimed at Maguire: “If you are the parent that refuses to allow your child the joy of having both parents in the same room (sans abusive/dangerous situation) – buck up – it’s not about you,” she writes, adding, “Gave someone that talk yesterday – got me nowhere, but no one ever said I wasn’t persistent.”\n\nImage zoom From left: Nicole Curtis, her son Harper and Shane\n\nRELATED: Nicole Curtis, Vanilla Ice and More HGTV and TLC Stars Will Appear in While You Were Out Reboot\n\nHarper coming down with a sudden illness right before Thanksgiving added to the stress of the situation, the mom of two tells PEOPLE.\n\n“He was sick the day before and I refused to transfer him when he was vomiting. His dad demanded that he be delivered as scheduled,” she recalls. “It’s one thing to be called a negligent parent, but I will not be one.” (In July, Maguire filed for sole custody of Harper, claiming Curtis was “not a fit” mother, but later dropped the request.)\n\n“I can’t express in words what it feels like looking at your sick baby and being told that a ‘parenting time’ schedule trumps their wellbeing. I woke up Thanksgiving morning and thanked God that I was able to have that time with him,” she continues. “I arrived at the airport and literally had my baby ripped out of my arms and whisked away as I was ‘screwing up’ Thanksgiving plans. The cycle never ends.”\n\nRELATED: Nicole Curtis Says She Will Keep Fighting for Her Family: ‘Sometimes the Storm Clears the Path’\n\nImage zoom\n\nStill, Curtis sees one positive opportunity to come out of her situation: sharing her struggles with other parents, and telling them there’s “no shame” in it.\n\n“Over the past ten years [since Rehab Addict’s debut], I have heard from hundreds of ‘single’ parents. They shared their stories and applauded seeing Ethan’s dad and me in photos, from everything from soccer games to Christmas dinner,” she tells PEOPLE referring her older son, now in his twenties. “I encouraged each one to keep trying because it wasn’t always that way and it took a lot of work.”\n\nSpeaking of her Instagram post, she explains, “I wrote my post because it’s something that most people will luckily never understand, but those that do feel shame and just sadness. I am surrounded by AMAZING people and I still have to shake myself loose from the negativity and carry on and it’s a struggle — I think of those parents that don’t have that. And I have to think about them because they write me, sad and losing hope and the will to keep fighting for their children. Children deserve better.”\n\nIn her 2016 memoir Better than New, Curtis describes Maguire’s reaction to her pregnancy as unexpected and writes that she planned to move forward raising the child on her own. (Maguire’s lawyer told PEOPLE in 2016 that his client “couldn’t have been happier to find out he was the father to his son.”)\n\nImage zoom Nicole Curtis/Instagram\n\nMaguire filed for paternity and joint custody in December 2015. He was awarded both, according to The Detroit News.\n\nCurtis and Maguire’s relationship had seemed to take a positive turn in March of 2018, when they had dinner together. “Shane has been to L.A. and the new house,” Curtis told PEOPLE. “We went to dinner the other night just the two of us.” But things quickly dissolved again when Curtis alleges, she was denied time with Harper on Easter.\n\nRELATED: Nicole Curtis Says She Was Refused Time with Her Toddler Son on Easter Amid Custody Battle\n\n“As much as I would say that it has really not been fun having everything drawn out in public, I think it’s also changed the course of my life,” Curtis told PEOPLE in July. “Because God isn’t putting bad in your life without [a reason]. Sometimes, the storm is there to clear the path for the sunshine.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fscreen-shot-2018-04-02-at-12-38-11-pm.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1575&h=825&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnicole-curtis-son.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F11%2Fnicole-curtis-sons-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F02%2Fnicole-curtis-husband.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnicole-curtis-son.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1575&h=825&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnicole-curtis-son.jpg", "keywords": [], "authors": ["Mackenzie Schmidt"], "canonical_link": "https://people.com/home/nicole-curtis-says-son-was-ripped-out-of-my-arms-on-thanksgiving-due-to-custody-agreement/", "title": "Nicole Curtis Separated from Son on Thanksgiving", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Exclusive,HGTV,Nicole Curtis,TV", "news_keywords": "Exclusive,HGTV,Nicole Curtis,TV", "description": "The Rehab Addict star says her son was \"ripped out of my arms\" so he could spend time with his father, her ex, with whom she has a contentious relationship", "og": {"title": "Nicole Curtis Says Son Was Taken from Her Arms on Thanksgiving Due to Custody Agreement, as She Supports Other 'Single' Parents", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/home/nicole-curtis-says-son-was-ripped-out-of-my-arms-on-thanksgiving-due-to-custody-agreement/", "description": "Nicole Curtis was separated from her three-year-old son, Harper, on Thanksgiving due to a strict custody arrangement. She opened up about her traumatic experience and&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1575&h=825&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnicole-curtis-son.jpg", "width": 1575, "height": 825}}, "pinterest": {"url": "https://people.com/home/nicole-curtis-says-son-was-ripped-out-of-my-arms-on-thanksgiving-due-to-custody-agreement/", "description": "The Rehab Addict star says her son was \"ripped out of my arms\" so he could spend time with his father, her ex, with whom she has a contentious relationship", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnicole-curtis-son.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/home/nicole-curtis-says-son-was-ripped-out-of-my-arms-on-thanksgiving-due-to-custody-agreement/", "title": "Nicole Curtis Says Son Was Taken from Her Arms on Thanksgiving Due to Custody Agreement, as She Supports Other 'Single' Parents", "description": "The Rehab Addict star says her son was \"ripped out of my arms\" so he could spend time with his father, her ex, with whom she has a contentious relationship", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1575&h=825&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fnicole-curtis-son.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}