{"url": "https://www.washingtonpost.com/news/morning-mix/wp/2018/06/25/roseanne-barr-breaks-down-sobbing-in-first-interview-after-racist-tweet-ive-lost-everything/", "text": "“I’m a lot of things, a loudmouth and all that stuff,” Barr said, sobbing. “But I’m not stupid, for God’s sake. I never would have wittingly called any black person . . . a monkey. I just wouldn’t do that. I didn’t do that. And people think that I did that, and it just kills me.”\n\nAD\n\nBarr reiterated her explanation that she was medicated with the sleep drug Ambien when she posted the tweet comparing Valerie Jarrett, a former adviser to President Barack Obama, to an ape. The tweet in late May read: “muslim brotherhood & planet of the apes had a baby=vj.”\n\nAD\n\nBarr told Boteach that she did not know Jarrett was black, an assertion she has also made publicly.\n\n“When ABC called me and said, ‘What is the reason for your egregious racism?’ I said, ‘Oh my God, it is a form of racism,’ ” Barr said. “I guess I didn’t know she was black, and I’ll cop to it, but I thought she was white.”\n\n“But you still regret and don’t excuse what you wrote,” asked Boteach, who said he has been friends with Barr for two decades.\n\nAD\n\n“Of course, no, I don’t excuse it. I horribly regret it. Are you kidding? I lost everything, and I regretted it before I lost everything,” Barr responded. “And I said to God: ‘I am willing to accept whatever consequences this brings because I know I’ve done wrong. I’m willing to accept what the consequences are.’ ”\n\nBarr added that many refuse to accept her apology. “I’ve made myself a hate magnet,” she said.\n\nAD\n\nAfter Barr’s tweet about Jarrett, ABC shut down the “Roseanne” revival, which Barr had starred in. When Barr blamed the tweet on Ambien, the company that produces the drug responded that “racism is not a known side effect” of any of its medications.\n\nAD\n\nLast week, three weeks after ABC abruptly canceled the show, the network said it had ordered a spinoff centered on the same family, but without Barr. The working title is “The Conners.”\n\nBoteach, whom The Washington Post once called “America’s most famous rabbi,” has been a spiritual guide for the likes of Michael Jackson and Sen. Cory Booker (D-N.J). In releasing the podcast interview Sunday, he praised Barr for her “incredibly public and passionate commitment to Judaism.”\n\nAfter Barr’s Twitter rant, Boteach said he “reached out to her and told her that she has a responsibility, in the name of repentance and her commitment to Judaism, to make this right.” In the interview, he asked her to affirm that she believes in the Torah values that “every human being is created equally in the image of God.”\n\nAD\n\nAD\n\nBreaking down in tears, Barr spoke of her intense remorse: “After your heart is unfrozen and after it stops being broken from the pain you caused others, you stop being a robot and you’ve got to come back to God.”\n\nBarr said what she did makes her “sick.” “I can’t defend it. I don’t want to defend it,” she said. The actress said she had been trying to call Jarrett to apologize to her personally.\n\n“I caused a lot of pain. I know that, and that’s the worst feeling in the world,” she said. “I caused pain for my family, I caused pain for my mother, I caused pain to the 200 out-of-work actors that I loved, and the crew and writers. I feel so bad that they gave me another chance and I blew it.”\n\nAD\n\n“But I did it,” she added. “And what can I do now except for say . . . I’m not a racist, I’m an idiot. And I might have done something that comes across as bigoted and ignorant, and I know that that’s how it came across. And you know, I just ask for forgiveness because I do love all people, I really do.”\n\nAD\n\nHere’s the interview:", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/4WQTVRV5VE2HVH47MHDEETQHBU.jpg&w=150", "https://www.washingtonpost.com/resizer/4Rv1QNGA7JWSexqXbopF8QDORbs=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/4WE2Z55WIY3JLLRFCAD3CH3KUA.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/c71d0f75-e726-4b3e-a5fe-039e913143fc.png&w=90&h=90"], "top_img": "https://www.washingtonpost.com/resizer/4Rv1QNGA7JWSexqXbopF8QDORbs=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/4WE2Z55WIY3JLLRFCAD3CH3KUA.jpg", "keywords": [], "authors": ["Samantha Schmidt", "Reporter Covering Gender", "Family Issues"], "canonical_link": "https://www.washingtonpost.com/news/morning-mix/wp/2018/06/25/roseanne-barr-breaks-down-sobbing-in-first-interview-after-racist-tweet-ive-lost-everything/", "title": "Roseanne Barr breaks down sobbing in newly released interview after racist tweet: ‘I’ve lost everything’", "meta_data": {"description": "Roseanne Barr spoke of her remorse in an interview with her longtime friend and spiritual adviser Rabbi Shmuley Boteach.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/morning-mix/wp/2018/06/25/roseanne-barr-breaks-down-sobbing-in-first-interview-after-racist-tweet-ive-lost-everything/", "image": "https://www.washingtonpost.com/resizer/4Rv1QNGA7JWSexqXbopF8QDORbs=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/4WE2Z55WIY3JLLRFCAD3CH3KUA.jpg", "title": "Roseanne Barr breaks down sobbing in newly released interview after racist tweet: ‘I’ve lost everything’", "description": "Roseanne Barr spoke of her remorse in an interview with her longtime friend and spiritual adviser Rabbi Shmuley Boteach."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Roseanne Barr breaks down sobbing in newly released interview after racist tweet: ‘I’ve lost everything’", "description": "Roseanne Barr spoke of her remorse in an interview with her longtime friend and spiritual adviser Rabbi Shmuley Boteach."}, "last_updated_date": "2019-04-29T21:36:17.573Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1529856000.0, "source": "https://www.washingtonpost.com", "summary": ""}