{"url": "https://www.hollywoodreporter.com/live-feed/demario-jackson-interview-what-happened-at-bachelor-paradise-1030267", "text": "\"I would hate for my biggest enemy to go through what I’ve been through this summer,\" DeMario Jackson tells THR.\n\nMillions of viewers were anxiously awaiting the premiere of Bachelor in Paradise, but DeMario Jackson was personally invested in how the TV saga would play out.\n\nSpeaking candidly to The Hollywood Reporter, Jackson says he feels \"relieved\" now that the ABC summer spinoff series has addressed the controversy that featured him and fellow contestant, Corinne Olympios, in the leading roles off-camera for nearly two months this summer.\n\n\"I think people wanted it to be something different,\" Jackson, 30, who is black, says of his on-set encounter with Olympios, 25, a white contestant. \"They wanted the angry black guy and this little, innocent white girl. But it wasn't that.\"\n\nThe moment in question was a taped sexual encounter between the two contestants, who had both been drinking, that occurred in the hot tub at the show's Sayulita, Mexico, resort. A producer, who according to Jackson never saw the moment or the footage, filed a misconduct allegation, forcing producers Warner Bros. Television to suspend production to investigate. A second producer later filed a similar complaint. After nearly two weeks, where an outside firm watched all footage and interviewed the entire cast and crew, WBTV concluded there was no wrongdoing and the show resumed filming, this time without Jackson or Olympios.\n\nBefore the cast officially kicked off the second round of Paradise, they sat down with host Chris Harrison to discuss what happened, placing blame on inaccurate reporting and clearing the show's producers of any culpability. The scandal, they agreed, blew up into a national sensation because of vague statements and quick assumptions, largely motivated by race. Jackson, who says he harbors no ill will toward Olympios, agrees with their takeaway. If he was white, or if Olympios was black, \"we wouldn’t even be having this discussion at all,\" he says.\n\nThough he was there for the encounter with Olympios — something he says he remembers fully and describes as \"100 percent consensual\" from both parties — and the production shutdown, he still has questions. He also sat down with Harrison for a one-on-one interview that will air next week, with Olympios telling her side of the story in a sitdown that airs the following week.\n\nIn a wide-ranging chat with THR below, Jackson shares his account of the events that took place at Paradise, details how his life has been impacted since and explains why he feels ABC has been \"woke as hell\" with how they've handled the entire situation, despite any criticism and his decision not to return.\n\nNow that the footage has aired and Bachelor in Paradise addressed what happened, how do you feel?\n\nI'm relieved. My story has never changed. I'’ve never cracked. I've never been angry or upset. I just told my truth. Unfortunately, we live in a society where the whole world is going to side with the woman. Even when the story doesn't make sense. In this situation, I don't think people used common sense. You're on a multimillion-dollar set with 50 to 100-plus cameras, 300 workers and an entire production. I love how [castmate] Alex [Woytkiw] was giving the play-by-play with what was going on with me and Corinne when we were in the pool, because it showed all the production, all the people and the castmates watching. I was actually telling the truth, so I'm relieved.\n\nI'm hoping you can clear up the timeline. We knew the actual tape was never going to air, but viewers seem to be confused about when the encounter in question actually happened.\n\nIt happened right there, that afternoon. When Alex was giving the play-by-play to the cameras.\n\nWe did see you both after that, when the cast gathered to welcome Wells Adams to the show (pictured below). How would you characterize your interactions with Olympios from then on?\n\nWe were fine. We were fine throughout the whole day. You saw us the next morning when we had breakfast. Even that night before we got pulled away, I gave her the fist-bump. Even today, after all of this, I'm still sitting here confused. I still feel like I'm missing 25 percent of the story, even though I'm in the story. (Laughs.) I'm still sitting here saying, \"Wait a minute, what happened?\"\n\nWe saw the producers approach you and Olympios separately before everything shut down. When they walked up to you, what did you think they were going to say?\n\nEven when I was pulled away, I didn't think [about] the Corinne situation. I was thinking, \"What is going on?\" I wondered if the girl from The Bachelorette was back. When I spoke to production, I asked, \"Did Corinne say something?\" They said no. I asked, \"Did I say something?\" They said no. I said, \"So why the fuck are we having this conversation?\" This third-party who wasn't present and who didn't view the video can just say she wants to shut down the production? It didn't make sense to me.\n\nThe \"third-party\" you are referring to is a producer who filed a misconduct allegation, which set off the investigation. Did you ever get clarity about what that person reported?\n\nThe only thing I know about that person is that she is Corinne's best friend. That's the only thing that I know. When I heard who it was, I thought it was weird. None of this makes sense to me.\n\n[\"The complaint was filed by two producers, not one. Perhaps DeMario's questions should be asked of the producers. Corinne has been on record for some time that she was blacked out and has no memory of what happened,\" Olympios' rep, Stan Rosenfield, told THR in a statement.]\n\nDo you know what happened to the producer?\n\nShe left that next day. Up and left. The wildest shit. When all this happened, when I got sent home, I was in the back of the car destroyed — because we went for it that night — and I realized who it was because that producer, and one other producer, were missing that next day. I had a moment of clarity that sobered me right up. I'm in the back of a car thinking, \"Wow, my reality career is shorter than Kim Kardashian's marriage to Kris Humphries.\" I've been on reality TV for what, two and a half episodes? And I'm the most known reality guy of all 34 seasons for having a wannabe girlfriend and a sex tape. No more reality for me!\n\nIs there anything that wasn't shown that you wish had made it to air during the premiere?\n\nI was happy that they showed Corinne and I interacting. With Paradise, you hookup with somebody or do whatever you're going to do, and it's very cutthroat, in a sense! You can make out with someone, take a nap and they've already moved on to someone else. Later that night, Corinne was spending time with Vinny [Ventiera] and I was hanging with Alexis [Waters]. It was just a natural transition, because it's Paradise and that's what people do. I wish they would have shown a little bit more about the other couples that started to form that night, because we didn't see much of that. I know it was hard and they couldn't legally put a lot of stuff in the episode, so there were some weird transitions.\n\nWhen Olympios told Ventiera she was giving him her rose that next day, it did come out of nowhere to the viewer because that was never shown. At that point, were you and her just friendly and had moved on?\n\nYes. In the first episode, the minute I walked up and everyone was scolding me, Alexis grabbed my hand and said, \"Lets get a drink.\" Alexis and I had this little flirtation thing going. Early off the bat, she said, \"You're dope, I'm dope, let's just give each other our roses.\" I said, \"Great.\" Then Corinne came up, and her and I had our day and we went to the pool, but after that I came back and started hanging out with Alexis, and the next morning when Alexis and I were eating breakfast, Corinne came up somewhat awkwardly and it was dope that they put that in there because it showed the aftermath and how we were all eating breakfast.\n\nWhen the producers shut it down, at what point did you understand that you were involved?\n\nThey told me a \"third-party person filed a complaint about you and Corinne's sexual activity in the pool.\" I’m thinking, \"“What the fuck?\" I asked if they talked to Corinne, and they said she said everything is cool. I asked, \"If she said everything is cool, and I said everything is cool, then why are we having this conversation?\" They said it was protocol. I asked if the producer saw the tape and he said he did, and when I asked what the tape showed he said the tape was fine. That's why I've said \"show the tape, show the tape\" this whole time. I made a T-shirt. When have you ever seen somebody who really, really, really wanted footage to be shown like that? Show the tape, please.\n\nWhat were you happy viewers did get to see?\n\nThe thing I wanted people to see is that we were very coherent and lucid and having fun. We were having conversations and swimming around. We were two homies having fun. Even the next day. We have mutual friends and she lives in L.A., I thought I'd leave here with a new homie. And then all of a sudden, I'm in the middle of a sex scandal.\n\nOlympios has said that she doesn't remember much from that night. Do you?\n\nI recall everything. I remember what I wore to school the first day of third grade. (Laughs.)\n\nThe cast spoke about consent on Tuesday's episode and the show put in place some rules behind the scenes, where the cast needed to make their consent clear. In your opinion, was your hookup with Olympios consensual, on both ends?\n\nIt was 100 percent consensual. She hopped in my arms, she pulled me into the pool. You've seen that with your own eyes. I think people wanted it to be something different. They wanted the angry black guy and this little, innocent white girl. But it wasn't. Then it was like, \"Oh, shit. Ok, damn.\" For months the media will drag your name through the mud. And the moment it's no longer a story, that's it. The media can put \"alleged\" from a source and put anything you want about a person. It sucks. Who raised these people? I read some things from a \"source\" where I thought, \"Wow, this is some low shit.\" Especially when you go back and watch the video. You think, \"This is it?\"\n\nThe cast agreed that race played a part in this. How do you feel race motivated the scandal and what it became?\n\nIf I would have been Alex or Derek [Peth, two white contestants], we wouldn't even be having this conversation, I would probably be engaged to Alexis right now. If anyone argues, tell them to Google \"Charlottesville.\" That's the world we live in. Look who our president is. Just tell them to look up what Trump said. It's always the white guy who says race didn't play a factor. Trust me, there were four black people on that entire island, three castmates and one producer. Luckily that producer followed me over [to the pool with Corinne] because I gave him the look. He followed me over with cameras.\n\nDid that producer, an eyewitness, vouch for you throughout all of this?\n\nYes, 100 percent.\n\nWhat do you think would have happened if Olympios had been a black contestant?\n\nThis wouldn't have been a story. We wouldn't even be having this discussion at all. Right now, you would just be watching Paradise and saying, \"DeMario's whistle is so annoying!\" The minute you saw a black man and a white woman's face. I had black America who hated me because I'm a sellout with a white girl. And I had white America calling me the N-word and telling me to \"go back to Africa.\" And they were slut-shaming Corinne, which sucked. For me, I'm just sitting here thinking, \"Wow. Our world.\" The human race continues to let me down.\n\nWhat would you say has been the biggest misconception of you?\n\nAfrican-Americans have been portrayed a certain way in movies for years. At the Oscars, we only get nominated for slave movies. Or we have to be gangster, or a pimp or a thug. It can't just be a normal black guy. For years, we've been drug through the mud, and the reason why I handled myself with such respect and class is because it wasn't just to respect my name, I was speaking on behalf of all African-Americans. The paparazzi are outside my house and I bring them water and they say, \"Wow, you're so nice!\" That's actually who I am! They want to put the angry black man on the news and people can say, \"That's exactly who I thought he would be.\" How the Obamas carried themselves in office for eight years as human beings, compared to Donald Trump — can you imagine if Obama acted how Trump does? He would have never gotten near the White House, and that's what we call white privilege. That's what this situation is. In a weird way, ABC has been woke as hell. With the Lee Garrett situation on The Bachelorette and this situation, ABC has touched on things that need to be addressed, especially in present-day America.\n\nWe are going to hear from you in a sitdown interview with Chris Harrison, airing next week, and Olympios in a sitdown the following week. What is the most important thing you want everyone to know in that interview?\n\nIt was a very emotional interview. Chris and I, as you can see from the Men Tell All, are playful. I can play up my villain persona, but this is my real life. This actually affected my real life. Chris knew how to poke the bear and really get the best out of me. The person I felt bad for the most out of all this was my mother. She was my biggest fan. I can go grocery shopping and she'll be there cheering for me. To see her cry every day and to see her not be herself, it was very sad. I wanted to say to her, \"I'm sorry. I’ll take 100 percent of the blame and be the bigger person.\" My castmates were there for me, especially Raven [Gates] and Jasmine [Goode]. My mom thanked them for speaking to the press and getting out their truth about her son. I'm excited for everyone to watch that and to see what I went through. A lot of it was hurtful. It was the racist stuff. From people who don't even watch the show! People I can tell probably saw it on the news. There is no way these people watch Bachelor in Paradise. That was the hardest part of me, getting it from all angles. That's some insight into what you'll see next week.\n\nHow did you emerge from that hole, and do you feel like you are now in a good place?\n\nI have the greatest family, friends and castmates. I have the two best parents, ever. Taylor [Nolan] had a run-in with Corinne last season and I Facetimed Taylor every single day. Taylor is so cool because she said to me, \"Last season, no one came to my defense. I was all alone through this darkness and I refuse to let you go through it.\" Nobody believed her side of the story and because of that, she didn't know if she wanted to do Paradise. We instantly became best friends and she had my back. So did Raven and Alexis. Through all this darkness, the best thing was that I met these extremely dope girls who I'll be in their lives forever.\n\nHave you seen Olympios face-to-face or spoken to her since you left Paradise?\n\nNo. We run in the same circles. L.A. is a very small. But I haven't. If I do see her, it would be nothing but love for her and her family. There's not enough time in this world to focus your energy on hate. Before I talk about hating on anybody, I call my mom and talk to her.\n\nWhat do you hope to hear her clarify when she sits down with Harrison?\n\nI hope she finds peace within herself. That's the main thing through all of this. That's the only thing I can say.\n\nWhy did you decide not to return to the show when it resumed?\n\nTo be completely honest, I wanted to go back solely for Alexis. It broke me down into tears, thinking I met this dope ass girl in Paradise and that she was going to find someone else. But I wasn't mentally or physically right. I lost 25 pounds. I hadn't been sleeping. And I didn't want to be under the microscope. And I didn't want it to be The DeMario Show. Everyone would be watching my every move and I wanted it to be natural and organic. I wanted them to be there and have fun. It would have been different if I had been there. Watching it, you have no idea the amount of FOMO I had! But I was so happy because all of my friends are happy.\n\nAre you and Waters pursuing anything romantically?\n\nWe're just friends. We're just taking it day by day. She's been my rock through all of this. My comedy relief, we went to Disneyland last week. She's been there through a very dark time. Nothing sexual or intimate, just being there.\n\nYou also said you will be back for the reunion. This season is going to have a different format it seems, with the finale being a reunion of sorts to catch up with the cast and the relationships. Have you shot the reunion yet?\n\nNo, it's coming up and it's still up in the air. The producers are saying it might be cast only to see who is still a couple. But I'm speaking to production now to see what the deal is for that.\n\nParadise also implemented new rules, keeping tabs on drinking and making sure everyone gives consent. Do you think it was necessary?\n\nBased on my situation, yes. I would hate for my biggest enemy to go through what I've been through this summer.\n\nDiggy Moreland, who is now the sole black male contestant on Paradise, defended you and spoke about the Google searches that will follow you around. What has it been like now that some weeks have passed?\n\nMy biggest fear is one day that my goddaughter or godson, or hopefully one day when I have little Derek Jeter Jackson with Alexis (laughs), will Google me one day. Hopefully by then, maybe I'll have a cure for cancer! But they're still going to get that question. I'm sure some evil parent at a parent-teacher conference will ask. I'm going to have to address what happened, in that crazy summer of 2017. It's a fear of mine, but at the same time I'm ready for that moment to come when it does.\n\nIf you could go back in time, would you go back on Paradise?\n\nOne-hundred percent. What I found out through Paradise is that I went through a crazy thing but my castmates, these were strangers. I knew Raven, Alexis and Taylor for less than 72 hours. For them to come to my defense and have my back and continue to have my back and continue to love me, text me and continue to hang out? I just saw Vinny and we're going to a Dodger game. It's like a brotherhood or sisterhood. We're all going to be friends. It's something deeper than the fans, and even production, can see. The bond that we have. I would do it again, one-million percent.\n\nWhat is one question you still want answered?\n\nI want to know from that producer just straight up, why? Because she never even told a high-level producer, she just jumped the gun. I want to know, why? That's it. It would be like you seeing something crazy at work and instead of going to your boss to say something, you just quit.\n\nIt doesn't sound like you need much from Olympios to move on?\n\nNo. Corinne never came out and said, \"DeMario.\" But we live in a world where people don't read and just assume. It wasn't from her, it was from this producer. I don't have too much to say to Corinne.\n\nWould you consider returning to the Bachelor franchise in the future?\n\nEverything depends on my health, and my health is great. I'm in the gym and starting to feel like myself. I love some of those producers with all my heart. Those guys really went to bat for me. Words can't describe what they mean to me and for them to give me this particular platform. Because really, they could have spun it however they wanted last night. They could have not shown us interacting, or shown us in the pool and that's it. But they really wanted the world to see. They really, really went to war for me.\n\nAre you dating? And what is next for you, if no more reality?\n\nMy team is working on a few different things. I'm literally just taking everything day by day. I'm in the gym, working out and trying to get my strength back. Hopefully things will start jumping off soon. Right now, I have a lot of baggage. I would be doing an injustice to any woman right now. Paparazzi still to this day, whoever I'm out with will post it and note if it's a \"Corinne lookalike\" or who I'm with. I don't want to bring a very innocent woman into a very hostile situation. I don't think that would work too much. So, no. I'm just laying low right now.\n\nAug. 17, 12:30 p.m.: Updated with Olympios statement.", "images": ["https://cdn1.thr.com/sites/default/files/2017/08/demario_jackson.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/01/greg_berlanti_sharon_horgan_alex_kurtzman_and_dwayne_johnson_-_getty_-_h_2020.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2017/08/demario_jackson.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/12/bywcqq0k.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/03/mrs._america_-_publicity_still_1-_h_2020_.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/blogicon_livefeed-black2.png"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/08/demario_jackson.jpg", "keywords": [], "authors": ["Jackie Strause", "Jackie.Strause Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/live-feed/demario-jackson-interview-what-happened-at-bachelor-paradise-1030267", "title": "'Bachelor in Paradise' Star Says Scandal Wouldn't Have Happened If He Were White", "meta_data": {"viewport": "width=device-width", "description": "\"I would hate for my biggest enemy to go through what I’ve been through this summer,\" 'Bachelor in Paradise' star Demario Jackson says of the ABC controversy.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/live-feed/demario-jackson-interview-what-happened-at-bachelor-paradise-1030267", "domain": "https://www.hollywoodreporter.com/", "title": "'Bachelor in Paradise' Star Says Scandal Wouldn't Have Happened If He Were White", "description": "\"I would hate for my biggest enemy to go through what I’ve been through this summer,\" DeMario Jackson tells THR.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/08/demario_jackson.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "'Bachelor in Paradise' Star Says Scandal Wouldn't Have Happened If He Were White", "description": "\"I would hate for my biggest enemy to go through what I’ve been through this summer,\" DeMario Jackson tells THR.", "url": "https://www.hollywoodreporter.com/live-feed/demario-jackson-interview-what-happened-at-bachelor-paradise-1030267", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/08/demario_jackson.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "'Bachelor in Paradise' Star Says Scandal Wouldn't Have Happened If He Were White", "sailthru.description": "\"I would hate for my biggest enemy to go through what I’ve been through this summer,\" DeMario Jackson tells THR.", "sailthru.author": "Jackie Strause", "sailthru.channel": "Live Feed", "sailthru.vertical": "Live Feed", "sailthru.date": "2017-08-17 06:15:00", "sailthru.tags": "Live Feed, Television, Bachelor In Paradise"}, "movies": [], "publish_date": 1502921700.0, "source": "https://www.hollywoodreporter.com", "summary": ""}