{"url": "www.elitedaily.com/p/who-is-rihanna-dating-hassan-jameel-is-still-the-man-in-her-life-according-to-reports-8056373", "text": "If the Grammy Awards proved anything on Jan. 28, they only solidified that Rihanna is kween and we all need to bow down. She always looks amazing, she's mega talented, and she has a badass attitude about life. Do not come for Rihanna or I will come for you. If RiRi is hanging out with someone, especially a potential boyfriend, you best believe fans will jump all over it... or so you would think. Her latest rumored relationship has managed to stay surprisingly low-key. Who is Rihanna dating? His name is Hassan Jameel and the two have been linked together for about seven months.\n\nBack in June of 2017, photos were released of RiRi getting hot and heavy with Jameel in a hot tub. The photos have since been deleted, but people were mostly wondering who the heck this seemingly random guy with Rihanna was in Spain.\n\nAs it turns out, Jameel is extremely well-known throughout the world. As the Toyota heir, he's wealthy — like, really wealthy. For 80 years, Jameel's family has been, \"the sole owners of the right to sell Toyota cars in Saudi Arabia,\" according to COED. This results in his net worth sitting at a hefty $1.5 billion.\n\nIn addition, the 29-year-old also serves as the deputy president and vice chairman of his family's company, Abdul Latif Jameel. According to Daily Mail, this is one of the biggest companies in the entire world.\n\nMoney is great, but I don't think it matters to Rihanna one bit. With her own net worth at $36 million, according to Forbes, she can take care of her own damn self. This relationship is definitely rooted in good ol' fashioned chemistry. According to a source from Daily Mail, Rihanna is \"smitten\" with Jameel. The source said,\n\nThis relationship is the real deal. Rihanna has told friends she's in love with him and seems completely smitten. They've been spending a lot of time together away from prying eyes and are really serious. They're really enjoying each others' company.\n\nLike I said earlier, all this info came to the surface back in June. After a quick obsession session, everyone moved on to other things. Rihanna, Jameel, and their potential relationship was swept under the rug, and I didn't know if we would ever hear from them again.\n\nThat is, until the 2018 Grammys. After Rihanna won her Grammy for Best Rap/Sung Collaboration with Kendrick Lamar and performed \"Wild Thoughts\" with DJ Khaled and Bryson Tiller, she went out to celebrate.\n\nKevin Winter/Getty Images Entertainment/Getty Images\n\nAccording to E! News, Rihanna and Jameel were both seen at the famous 1 OAK nightclub in NYC. Although they arrived and were photographed separately, sources claim the two were \"coupled up\" all night. A source said the two weren't afraid to flaunt a little PDA, and Rihanna \"seemed so happy\" with Jameel. The source told E!,\n\nRihanna and Hassan showed affection throughout the evening. It was cool because he can roll with Rihanna, he fits in great.\n\nThe source continued,\n\nHe was always making sure she was OK and had everything she needed. Rihanna was dancing and having a great time.\n\nThe two sound like a fabulous couple. Another eyewitness account of the two came from realtor and famous NYC and Miami socialite, Malcolm Edwards. He exclusively told E!,\n\nRihanna was sitting with her boyfriend Hassan at 1 OAK owner Richie Akiva's table. They weren't being overly romantic but definitely showed some PDA throughout the night. They were happy to see Diddy and his girlfriend Cassie when they showed up at the table. They hugged and kissed hello. The foursome laughed throughout the night and enjoyed music.\n\nAt the owner's table with Diddy... no biggie. Just a day in the life of Rihanna. The two being friends with other couples could prove that their relationship is getting serious. Hopefully, we'll be hearing more about Rihanna and Jameel in the near future.\n\nBasically, if Rihanna is happy, I'm happy. It's so exciting the singer may have a new-ish man in her life to celebrate the good stuff. NOTHING BUT GOOD THOUGHTS AND WISHES FOR RIRI.\n\nCheck out the entire Gen Why series and other videos on Facebook and the Bustle app across Apple TV, Roku, and Amazon Fire TV.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2018/1/29/f6d010a3-7cd2-4f7a-9bc3-25fe686cd7ec-getty-911562982.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2018/1/29/f6d010a3-7cd2-4f7a-9bc3-25fe686cd7ec-getty-911562982.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/16/555700cf-c269-4ba5-9ad4-004df0469bc7-getty-1170538224.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.elitedaily.com/uploads/getty/2018/1/30/cd02a2c4-c8b7-4774-bdd9-b65858aacabf-getty-911540170.jpg?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/16/7136529d-01cd-4144-849c-502e8ab4a6e6-getty-1176988943.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/15/6020d905-531a-4969-84d2-f3c3ca4938de-getty-1193835672.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/1/29/f6d010a3-7cd2-4f7a-9bc3-25fe686cd7ec-getty-911562982.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/who-is-rihanna-dating-hassan-jameel-is-still-the-man-in-her-life-according-to-reports-8056373", "title": "Who Is Rihanna Dating? Hassan Jameel Is Still The Man In Her Life, According To Reports", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/who-is-rihanna-dating-hassan-jameel-is-still-the-man-in-her-life-according-to-reports-8056373", "type": "article", "title": "Rihanna Reportedly Hung Out With Her Rumored BF After The Grammys, So That's Still A Thing", "description": "If the Grammy Awards proved anything on Jan. 28, they only solidified that Rihanna is kween and we all need to bow down. She always looks amazing, she's mega talented, and she has a badass attitude about life. Do not come for Rihanna or I will come…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/1/29/f6d010a3-7cd2-4f7a-9bc3-25fe686cd7ec-getty-911562982.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "If the Grammy Awards proved anything on Jan. 28, they only solidified that Rihanna is kween and we all need to bow down. She always looks amazing, she's mega talented, and she has a badass attitude about life. Do not come for Rihanna or I will come…"}, "movies": [], "publish_date": null, "source": "http://www.elitedaily.com", "summary": ""}