{"url": "https://slate.com/culture/2017/10/assessing-crazy-ex-girlfriends-three-opening-credits-sequences-video.html", "text": "Season 3’s theme brings out many strains of “crazy.” YouTube\n\nEarlier this week, Crazy Ex-Girlfriend’s Season 3 opening credits sequence was finally revealed online. In the new sequence, which makes its official debut in tonight’s episode, Rebecca Bunch (co-creator and star Rachel Bloom) takes on several pop star personas, channeling different strains of crazy: A Carrie Underwood–type, swinging a Louisville slugger; a sultry diva who’s crazy in love; a rock star who likes a woman who’s “crazy in bed”; and a rapper who warns you to stay away from a girl who’s “crazy in the head.” To be crazy or not to be crazy? That’s the question at the center of the theme, but of course, there’s no clear answer—the personalities conflict, and a cut at the end to Rebecca herself, sitting on the toilet and watching it all go down on her phone, reveals she’s more confused than ever.\n\nHonestly, the whole thing is confusing to me, too. The song, which feels clearly inspired by Underwood’s “Before He Cheats,” is disjointed and plodding, flying by quickly and ending abruptly. It never really registers as a cohesive opener, and that’s probably the point—Bloom told E! that pop’s obsession with the word crazy inspired the aesthetic: “It’s probably the most common word used in pop music, and if you’re like my character, who’s trying to live her life by those things, it would be very confusing to get guidelines from listening to different pop songs.” It’s a great concept, especially considering that Season 3 is where Crazy Ex-Girlfriend officially begins to earn its title, with Rebecca seeking the utmost revenge on Josh after he’s left her at the altar. But the execution is unsatisfying—this is also the season that is filtering its motif through movie tropes (Bloom has described it as “funny Fatal Attraction” and the second episode, airing tonight, includes a 50 Shades of Grey plot line and a musical ode to Gene Kelly), and the pop theme is jarringly inconsistent in this light. Also, it’s just not that catchy.\n\nThe Season 1 opening credits sequence is catchy, and does what so many of the best TV theme songs have done: It cleverly lays out the show’s premise in a way that complements the script and the spirit of the season. Rebecca’s rash decision to move her entire life from New York City to West Covina, Ca. after running into her summer-camp boyfriend from high school is breezily chronicled in the lyrics and then instantly commented upon by the chorus. “She’s the crazy ex-girlfriend! (What? No I’m not!)” Rebecca is in denial for everyone, herself included, and this plays out slowly throughout the season until she finally attempts to seek therapy for her mental health issues and admits to Josh aloud that she made the move explicitly for him. The theme is subversive and provocative, cheerful and animated, while revealing our protagonist to be more than a little not OK. In delivery, it’s spot-on, and Season 1 does in fact live up to its promise—its take on the “crazy woman” trope is “a lot more nuanced than that.”\n\nSeason 2’s theme, however, raised the bar for what Crazy Ex-Girlfriend could convey in a mere 30 seconds. In the Busby Berkeley-inspired musical number, Rebecca sings innocently about just being “a girl in love” who “can’t be held responsible for my actions”; she’s “certifiably cute and adorably obsessed.” It’s perfect from beginning to end, a bubbly singalong that belies Rebecca’s darker, deeper spiral into willful ignorance of her problems, and how those problems affect those around her. The chorus members call her an ingenue—fitting, since the season is all about taking the romantic comedy genre’s celebration of doing outrageous things in the name of “love” and exposing it for the disturbing mess it can actually be in real life. (Paula questions her friendship with Rebecca, whose selfishness leaves her high and dry when she needs her most; Rebecca runs over Josh’s new girlfriend’s cat.) And that final moment, of Rebecca’s head busting (blam!) through the heart-shaped image of Josh’s face, with the camera lingering for just a beat longer than feels comfortable—if Season 1 Rebecca was charming and highly functional while still exhibiting a steady loss of control, Season 2 Rebecca is much more unsettling in the most fascinating of ways.\n\nHeld up against these two previous examples, Season 3’s theme is a bit of a letdown. It makes smart points—women are frequently told that one of the worst things to be is “crazy,” except when in bed with a man, and then it’s encouraged—but doesn’t really subvert them through imagery. (One would expect something at least a bit more fun coming from Joseph Kahn, the director behind the music video for “The Thong Song.”) Based on the three new episodes I’ve seen, it doesn’t seem like cause to worry for the fate of this season, as Crazy Ex-Girlfriend is still very much a delightful and thought-provoking journey. But when the four strains of “crazy” pop stars collectively offer “We hope this helps!” to Rebecca, it’s hard not to answer with, “No, no. It does not.”", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=18406752&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel/p-fw53_-Tq3MNK1.gif", "https://slate.com/media/components/adblock-message/slate-plus-promo.png", "https://www.facebook.com/tr?id=166975463695820&ev=PageView&noscript=1", "https://compote.slate.com/images/ca12ec69-e598-4fd2-a015-f138341a14c5.png"], "top_img": "https://compote.slate.com/images/ca12ec69-e598-4fd2-a015-f138341a14c5.png", "keywords": [], "authors": ["Aisha Harris"], "canonical_link": "https://slate.com/culture/2017/10/assessing-crazy-ex-girlfriends-three-opening-credits-sequences-video.html", "title": "Which Is the Best Crazy Ex-Girlfriend Opening Credits Sequence So Far?", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Which Is the Best Crazy Ex-Girlfriend Opening Credits Sequence So Far?", "url": "https://slate.com/culture/2017/10/assessing-crazy-ex-girlfriends-three-opening-credits-sequences-video.html", "description": "Carrie Underwood clearly inspired the Season 3 theme.", "image": "https://compote.slate.com/images/ca12ec69-e598-4fd2-a015-f138341a14c5.png", "site_name": "Slate Magazine", "type": "article"}, "twitter": {"title": "Which Is the Best Crazy Ex-Girlfriend Opening Credits Sequence So Far?", "description": "Carrie Underwood clearly inspired the Season 3 theme.", "image": "https://compote.slate.com/images/ca12ec69-e598-4fd2-a015-f138341a14c5.png", "card": "summary_large_image", "site": "@slate"}, "article": {"published_time": "2017-10-20T16:19:00+00:00", "tag": "/content/slate/blogs/browbeat", "publisher": "https://www.facebook.com/Slate"}, "description": "Carrie Underwood clearly inspired the Season 3 theme.", "news_keywords": "/content/slate/blogs/browbeat", "author": "Aisha Harris", "fb": {"app_id": 142011022527753}, "apple-mobile-web-app-title": "Slate", "application-name": "Slate", "msapplication-TileColor": "#660033", "msapplication-TileImage": "https://slate.com/media/sites/slate-com/icon.144x144.png", "theme-color": "#2c0022", "dfp-cache-buster": "7b1b9fb6f55280c03edfe3d6def54723514811de"}, "movies": ["https://www.youtube.com/embed/GPpKC0v5_h0?rel=0&enablejsapi=1", "https://www.youtube.com/embed/lph_EfoAn-A?rel=0&enablejsapi=1", "https://www.youtube.com/embed/OdjvjsPAQgk?rel=0&enablejsapi=1"], "publish_date": 1508516340.0, "source": "https://slate.com", "summary": ""}