{"url": "people.com/books/catherine-oxenberg-book-daughter-nxivm/", "text": "Three months after first revealing the story of her daughter India’s involvement with the group NXIVM, Dynasty star Catherine Oxenberg has decided to write a book to share her story with the hope it can also help others.\n\nHer memoir, CAPTIVE: A Mother’s Crusade to Save Her Daughter From a Terrifying Cult, cowritten by PEOPLE contributor Natasha Stoynoff, will be released in Fall and will recount Catherine’s estrangement from her 26-year-old daughter, India, and her attempt to rescue her from what she believes is a dangerous group.\n\nGet push notifications with news, features and more.\n\n“I was completely ignorant about these sorts of the dangers and traps associated with these so-called personal growth self help groups. It’s an $11 billion, completely unregulated industry, so I reached out to a lot of experts for guidance,” Catherine tells PEOPLE. “What I learned along the way could help others [and] prevent them from falling into the same trap, know what warning signs to look for, and also to give hope to those parents that are struggling and who have lost children to similar situations.\n\n“So many people reached out to me when I went public saying, ‘Oh my God, I’m in the same situation. I’m heartbroken, I’ve lost my child. I don’t know what to do,” she adds.\n\nImage zoom Allison Michael Orenstein\n\nIndia was 20 years old when she and her mother attended a meeting as part of a leadership seminar organized by NXIVM in 2011. While the meeting was supposed to provide methods for self-improvement, Catherine told PEOPLE she found the organization “weird and creepy.” India didn’t have the same hesitations and immersed herself in the organization over the next few years.\n\nNXIVM has been around for 20 years, with approximately 16,000 people paying thousands of dollars for experiences like executive-coaching workshops. Run by Keith Raniere, 57, who is known as “Vanguard” to members, NXIVM has offices throughout the country and in Mexico.\n\nImage zoom Catherine and daughter India Wenn/Alamy\n\n“The mission of NXIVM is to help transform and, ultimately, be an expression of the noble civilization of humans,” the organization states on their website.\n\nNot only do former followers dispute this claim, many have shared horror stories of allegedly having their skin branded with Rainere’s initials and describe the group as a “cult.”\n\nLast April, Catherine claims she learned her daughter was also in potential danger.\n\nHer friend, Bonnie Piesse, 34, had left the group and warned Catherine that India was taking part in what Catherine calls a “secret sisterhood.”\n\n“You need to save your daughter,” Piesse told her, according to Catherine. “You need to save India.”\n\nIn December, the New York Times reported that Justice Department has opened an investigation into NXIVM.\n\nImage zoom Catherine and young daughter India Ron Galella/WireImage\n\nBut that doesn’t ease Catherine’s immediate concerns for her daughter.\n\nCatherine previously told PEOPLE that she learned India was on a restrictive diet, suffered hair loss, and hadn’t had her period in a year. Now she says she’s told that India is eating more because “they’re trying to look more normal,” but says she’s still worried.\n\nAfter Catherine decided to go public with her allegations in October, India became angry and further withdrew from her. Catherine tells PEOPLE that India was recently in Los Angeles, but wasn’t willing to see her.\n\n“She was in L.A. and I was hoping that was a good sign, and I was very distressed when she flew back [to NXIVM’s headquarters Albany],” Catherine says. “Even is she’s not willing to see me, the fact that she’s outside of their sphere of influence physically gave me hope.”\n\n“I’m assuming they kept her on a tight leash so that they still had a lot of influence over her,” she says. “Because if she [leaves the group], that’s a tremendous blow to [NXIVM] considering she’s been such a public figure for them. I think that that could be the death blow and I think they’re doing everything they can to keep her in.”\n\nAs India becomes more entangled in the controversial group, Catherine is writing the memoir in another attempt to save India.\n\nCAPTIVE will reveal the steps Catherine has taken to extract her daughter from what she considers a “dangerous, mind-controlling cult” in which she claims the women are treated like “slaves.” She also draws on interviews from former members and cult experts.\n\n“I’ve grown as a person through this experience [and] I’ve become more inclusive,” Catherine says. “It’s no longer just about my daughter. It’s about helping everybody who has suffered through this.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=944&h=494&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fcatherine-square-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fcatherine-square-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fcatherine-oxenberg-2-1.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F03%2Fcatherine-india-oxemburg.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=944&h=494&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fcatherine-square-1.jpg", "keywords": [], "authors": ["Sam Gillette", "Liz Mcneil"], "canonical_link": "https://people.com/books/catherine-oxenberg-book-daughter-nxivm/", "title": "Catherine Oxenberg Is Writing a Book About the Group She Claims 'Brainwashed' Her Daughter", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Books,Crime News,Human Interest News,News,NXIVM", "news_keywords": "Books,Crime News,Human Interest News,News,NXIVM", "description": "Catherine Oxenberg is writing about her continued efforts to \"save\" her 26-year-old daughter from what she believes is a dangerous \"cult\"", "og": {"title": "Catherine Oxenberg Is Writing a Book About the Group She Claims 'Brainwashed' Her Daughter", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/books/catherine-oxenberg-book-daughter-nxivm/", "description": "Three&nbsp;months&nbsp;after first&nbsp;revealing the story of her&nbsp;daughter India’s involvement with the&nbsp;group NXIVM, Dynasty star Catherine Oxenberg has&nbsp;decided to write a book to share her story with&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=944&h=494&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fcatherine-square-1.jpg", "width": 944, "height": 494}}, "pinterest": {"url": "https://people.com/books/catherine-oxenberg-book-daughter-nxivm/", "description": "Catherine Oxenberg is writing about her continued efforts to \"save\" her 26-year-old daughter from what she believes is a dangerous \"cult\"", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fcatherine-square-1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/books/catherine-oxenberg-book-daughter-nxivm/", "title": "Catherine Oxenberg Is Writing a Book About the Group She Claims 'Brainwashed' Her Daughter", "description": "Catherine Oxenberg is writing about her continued efforts to \"save\" her 26-year-old daughter from what she believes is a dangerous \"cult\"", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=944&h=494&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fcatherine-square-1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}