{"url": "www.inquisitr.com/3101499/justin-bieber-blames-taylor-swift-for-selena-gomez-split-swift-orchestrated-orlando-bloom-drama-to-hurt-katy-perry/", "text": "Taylor Swift and Selena Gomez have remained friends for years despite the media spotlight that causes some celebrity relationships to splinter. After watching her friend go through heartbreak from the ups and downs that occurred in her romance with Justin Bieber, Taylor is definitely not a Belieber. With the “Sorry” singer aware that Swift dislikes him, Justin is blaming Taylor for the most recent crumbling of Jelena, according to Hollywood Life’s insider.\n\nHowever, don’t look for any signs on social media or in interviews that the Biebs blames Swift.\n\n“Justin knows Taylor doesn’t like him and never will and the feeling is mutual, but he is smart enough to know not to say anything in public or on social media because he knows all the scrutiny he’d endure,” explained the source.\n\nTaylor Swift and Selena Gomez showcase their friendship. [Photo by Jason Kempin/Getty Images for iHeartRadio / Turner]\n\nSwift recently attracted attention at the iHeartRadio Awards by throwing shade at the 22-year-old pop star after his performance, pointedly looking in the opposite direction. And the Biebs doesn’t believe that he and Taylor will ever become pals. In contrast, he will always blame Swift for any problems in his Jelena relationship, claims the insider.\n\n“He never expects to be her friend and is not looking to be her friend. He blames Taylor for some of his issues with Selena and that will never go away.”\n\nIs Taylor Swift to blame for separating Selena Gomez and Justin Bieber? [Photo by Jason Merritt/Getty Images]\n\nBut is Swift also to blame for any “issues” arising from the photos that circulated showing Gomez getting intimate with Orlando Bloom, who is Katy Perry’s boyfriend? Amid the blame game controversy that resulted, sources told Naughty Gossip that Gomez was the one who was “aggressive” to hurt Katy.\n\n“Selena really likes him and was very aggressive to get him,” claimed one source. “You must remember that her best friend is Taylor Swift who hates Katy Perry. I can only imagine the things Taylor and Selena have said to each other about Katy.”\n\nAs to whether Swift actually orchestrated the hookup to make Perry feel bad, however?\n\n“I doubt Taylor was behind this hookup, but you know these two have spoken about it since,” added the insider.\n\nKaty Perry tweeted her views about the alleged cheating scandal involving Selena Gomez and Orlando Bloom. [Photo by Stephen Lovekin/Getty Images]\n\nTaking it one step further, Wendy Williams used her talk show as a platform to claim that Swift pushed her pal to get intimate with Orlando, an allegation that Gossip Cop calls false.\n\n“Selena is best friends with Taylor Swift. And Taylor is [a] low-key mean girl, doesn’t want to see anybody get anything,” slammed Wendy. “Katy, you need to be looking at your man…sicced on him by Taylor Swift. Taylor is just a [b***h].”\n\nHowever, when it comes to Swift and the allegations of cheating, Taylor was never involved, according to Gossip Cop.\n\nAs for how Katy feels about this situation? Perry is dealing with it by turning to Twitter to challenge all those allegations, pointed out Vanity Fair.\n\nIs that all there is? https://t.co/54Q72MfXND — KATY PERRY (@katyperry) May 12, 2016\n\nUsing social media to showcase her views, Katy tweeted a link to Peggy Lee’s song, “Is That All There Is?” and followed it with a link to an article about Bloom’s efforts as a UNICEF goodwill ambassador in Eastern Ukraine.\n\n“Instead of giving energy & eyeballs to dumb conspiracy, check out how cool this is,” urged Perry. “#dontfeedthebeast.”\n\nInstead of giving energy & eyeballs to dumb conspiracy ???? check out how C????????L this is: https://t.co/ClmGlPMz3x #dontfeedthebeast — KATY PERRY (@katyperry) May 12, 2016\n\nProviding her own view on the situation, Gomez retweeted what Katy had posted, complete with a prayer hands emoji.\n\nJust one week after all the scandal erupted over the photos showing Selena and Orlando getting cozy, Perry was seen cuddling and kissing her boyfriend on what the Daily Mail describes as a “romantic rendezvous in Cannes.”\n\nKaty has been dating her actor boyfriend for four months, and their canoodling on a yacht at the French Riviera resort Sunday seemed to discount all those cheating rumors. Perry, 31, is in Cannes to perform at the amfAR Cinema Against AIDs benefit.\n\n[Photo by Jason Merritt/Getty Images]", "images": ["https://secure.gravatar.com/avatar/fa8aa86244d76bf2aee7e2fb5b934ea3?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2016/05/Katy-Perry-And-Selena.jpg", "https://cdn.inquisitr.com/wp-content/uploads/2016/05/Selena-Justin-Split.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://cdn.inquisitr.com/wp-content/uploads/2016/05/Selena-Taylor-Swift.jpg", "https://cdn.inquisitr.com/wp-content/uploads/2016/05/Taylor-Swift-Selena-Gomez-Friends.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Joanne Eglash"], "canonical_link": "https://www.inquisitr.com/3101499/justin-bieber-blames-taylor-swift-for-selena-gomez-split-swift-orchestrated-orlando-bloom-drama-to-hurt-katy-perry/", "title": "Justin Bieber Blames Taylor Swift For Selena Gomez Split: Swift Orchestrated Orlando Bloom Drama To Hurt Katy Perry?", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}