{"url": "https://people.com/parents/nikki-reed-ian-somerhalder-daughter-birth-changed-lifestyle/", "text": "The holidays are typically a time known for the hustle and bustle, but for Nikki Reed, this year will be all about taking it slow.\n\nOver the last few months, the actress has been occupied with preparing to open her first brick-and-mortar storefront for her sustainable lifestyle brand Bayou with Love. All of her efforts came to fruition on Friday when the holiday pop up, created in collaboration with Earth + Element owner Elizabeth Di Prinzio, opened to the public in Los Angeles’ Silver Lake neighborhood.\n\nGet push notifications with news, features and more.\n\n“We poured our hearts and souls into this store so it’s really nice to see everybody enjoying and appreciating and touching everything,” Reed, 30, tells PEOPLE. “The brick-and-mortar model is really sweet, and I think part of what Liz and I are trying to do with our pop up is give different communities that same opportunity to come in and see things in person.”\n\nOn top of the store opening, Reed is busy as a mom to her 16-month-old daughter Bodhi Soleil, whom she shares with her husband and former Vampire Diaries actor Ian Somerhalder. At one point during her conversation with PEOPLE, she jokingly admits, “I have a 1-year-old — putting together a sentence is challenging.”\n\nThe former Twilight actress is notoriously private when it comes to sharing anything about her daughter in the public eye (she has only ever shown her baby’s feet in photos posted to her Instagram), but she says Bodhi is “just the most spectacular thing.”\n\nWant all the latest pregnancy and birth announcements, plus celebrity mom blogs? Click here to get those and more in the PEOPLE Parents newsletter.\n\nImage zoom Nikki Reed and Elizabeth Di Prinzio BaYou with Love and Earth and Element\n\nRELATED: All About Nikki Reed’s Sustainable Jewelry Collection — Which Features Seed-Grown Diamonds\n\nWhen the holidays arrive, Reed says she and Somerhalder are excited to be spending some down time at home with their daughter. Before Bodhi was born, Reed says, she and Somerhalder would typically be on planes every month or so flying back and forth to visit each other. But now that they’re a family, they all travel together.\n\nImage zoom BaYou with Love and Earth and Element\n\n“We’re ready to have our feet planted on the ground and just nest again,” she says. “We live such crazy nomadic lifestyles all over the place, on planes, and [we’ve had] to uproot and move. Now that we’re a family, the whole family goes together so that Mom and Dad can both be there at every second to witness every milestone and everything that’s happening.”\n\n“It’s kind of like you pick up the whole house and move it and set the house down,” she continues. “We definitely are feeling right now like we miss home.”\n\nRELATED: Nikki Reed Knows She Looks Like a “Totally Different Person” but Swears: “I Haven’t Done a Single Thing to My Face”\n\nReed says she got back to her home in Los Angeles recently, and after being away for a while, she felt like it was time to check in on the animal rescues she has worked with for over a decade to see if they needed anything.\n\n“When it rains, it pours,” she says with a laugh. “So now we’ve got so many fosters at the house and we actually can’t travel because we have too many foster animals right now.”\n\nReed says that her brood is a “big camping family,” and that they love being in the outdoors.\n\n“I think that’s part of what Ian and I connected on the most when we got together, in fact, was how much we love to just strip it all away and be in nature,” she says. “We probably spend 100 days out of 365 in our Airstream camping.”\n\nRELATED VIDEO: Ian Somerhalder and Nikki Reed Expecting First Child\n\nReed and Somerhalder got engaged in January 2015, just six months after they started dating. She says they love to drive across the country and participate in “all kinds of adventures.”\n\n“We go down to Joshua Tree and New Mexico and all over the place,” she says.\n\nWhen it comes to gift-giving, Reed says “everything” Somerhalder gets her “is really special.”\n\n“His gifts come at random times,” she says. “We’re not always so big on obligatory shopping for each other. To me, it’s about the random thought. There’s something so sweet about coming home and there’s a sunflower lying on the table with a note. We love to make each other things.”\n\nImage zoom Nikki Reed and Ian Somerhalder Splash News\n\nRELATED: Nikki Reed and Ian Somerhalder Share Loving 3-Year Anniversary Posts: “This Journey Is So Beautiful”\n\nReed’s love for the outdoors extends to her eco-friendly jewelry collection, which she hopes shows customers that sustainably made pieces can be just as luxurious as those that are not.\n\n“It’s really nice to have people touch things and see them in person because I think there’s a misconception that sustainable goods are somehow considered, at times, less than,” Reed says. “There’s the illusion of luxury with virgin materials, which I think is becoming less and less common, which is great. But it’s wonderful to see people pick up a diamond ring that’s made from recycled gold and go, ‘Oh wow, this doesn’t feel any less luxurious than any other diamond ring that I would pick up.’ ”\n\nReed wears all the jewelry she designed herself for the collection on a daily basis, but has had to forego wearing some rings because of her daughter. “When you have a 1-year-old, I don’t generally wear too much on my hands anymore because I’m picking her up all day long,” she says. “But I don’t take any of it [off], honestly.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F12%2Fnikki-reed-jewelry-4-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1333&h=698&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F04%2Fnikki-reed-jewelry-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F04%2Fnikki-reed-jewelry-1-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fnikki-reed-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1333&h=698&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F04%2Fnikki-reed-jewelry-1-2000.jpg", "keywords": [], "authors": ["Brianne Tracy"], "canonical_link": "https://people.com/parents/nikki-reed-ian-somerhalder-daughter-birth-changed-lifestyle/", "title": "Why Nikki Reed and Ian Somerhalder Changed Their Lifestyle After the Birth of Their Daughter", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Babies Exclusives,Exclusive,Ian Somerhalder,Jewelry,News,Nikki Reed,Parenting", "news_keywords": "Babies Exclusives,Exclusive,Ian Somerhalder,Jewelry,News,Nikki Reed,Parenting", "description": "Actress and Bayou with Love co-founder Nikki Reed tells PEOPLE that her 16-month-old daughter Bodhi is \"just the most spectacular thing\"", "og": {"title": "Why Nikki Reed and Ian Somerhalder Changed Their Lifestyle After the Birth of Their Daughter", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/parents/nikki-reed-ian-somerhalder-daughter-birth-changed-lifestyle/", "description": "The holidays are typically a time known for the hustle and bustle, but for&nbsp;Nikki Reed, this year will be all about taking it slow. Over&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1333&h=698&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F04%2Fnikki-reed-jewelry-1-2000.jpg", "width": 1333, "height": 698}}, "pinterest": {"url": "https://people.com/parents/nikki-reed-ian-somerhalder-daughter-birth-changed-lifestyle/", "description": "Actress and Bayou with Love co-founder Nikki Reed tells PEOPLE that her 16-month-old daughter Bodhi is \"just the most spectacular thing\"", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F04%2Fnikki-reed-jewelry-1-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/parents/nikki-reed-ian-somerhalder-daughter-birth-changed-lifestyle/", "title": "Why Nikki Reed and Ian Somerhalder Changed Their Lifestyle After the Birth of Their Daughter", "description": "Actress and Bayou with Love co-founder Nikki Reed tells PEOPLE that her 16-month-old daughter Bodhi is \"just the most spectacular thing\"", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1333&h=698&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F04%2Fnikki-reed-jewelry-1-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}