{"url": "https://www.usatoday.com/story/life/tv/2018/01/24/citizen-rose-mcgowans-documentary-series/1061157001/", "text": "Rose McGowan is bringing her activism to your TV screen.\n\nThe actress and activist has become a prominent figure in the movement against sexual harassment and violence that burst into the national conversation after the downfall of movie producer Harvey Weinstein and other prominent men. And her new E! documentary series, Citizen Rose, takes a closer look at her efforts.\n\nMore:Rose McGowan on reality show: 'I'm just trying to stop international rapists'\n\nThe series, premiering Tuesday (8 ET/PT) with a two-hour special and returning with four more episodes this spring, is a mix of biography, personal statements and a recent history of the Me Too movement. McGowan began work on the series before the first stories about Weinstein were published in October.\n\nHere are five things in an early version of the emotional special:\n\nThe series is about her life, in addition to her activism\n\nMcGowan explores her upbringing, including being born into the cult Children of God, and her complicated relationship with her father. The series follows her to a family Thanksgiving, an emotional confrontation with her mother about her assault and on a visit to her father's grave.\n\nThe series doesn't mention Harvey Weinstein by name\n\nMcGowan has accused the disgraced movie mogul of rape, and although the series talks about him repeatedly, including McGowan's own remembrances and news clips of his downfall after exposés in The New York Times and the New Yorker in October. However, McGowan simply refers to him as \"the monster\" (except on one occasion) and the series blacks out his name in written text and distorts it when others say it.\n\nShe talks about the day she was allegedly assaulted by Weinstein\n\nMcGowan speaks at the beginning of the episode about the day in 1997 that she says she was raped by Weinstein, describing, as in other accounts, going to a meeting at a hotel and being told it had been moved upstairs to his room. She says she was being followed by an MTV film crew that day for a segment, and the episode shows a clip from it of her walking through a door. She recalls saying \"I think my life is finally getting easier,\" just before the meeting. (In previous statements, Weinstein has denied accusations of non-consensual sex.)\n\nShe explains why she took issue with this year's Golden Globes\n\nMcGowan made headlines in December when she criticized actresses who planned to wear black to the Golden Globes in solidarity with the Me Too movement in a tweet. It read, \"actresses, like Meryl Streep, who happily worked for The Pig Monster, are wearing black @GoldenGlobes in a silent protest. YOUR SILENCE is THE problem. You’ll accept a fake award breathlessly & (effect) no real change. I despise your hypocrisy. Maybe you should all wear Marchesa.\" (A reference to Weinstein's now-estranged wife's fashion line.)\n\nAlthough she later apologized, in a comment later edited from the special, McGowan explains, \"I wanted to tell the truth about why the Golden Globes were there, what it means,\" suggesting Weinstein is responsible for the Globes' prominence in the awards campaigning season. \"So while it may seem small — oh, it's just a dress at the Golden Globes — there's a lot of layers.\"\n\nShe documents her arrest in Virginia\n\nIn November, a months-old Virginia arrest warrant for McGowan for cocaine-possession charges came to light, and she claimed then (and now, in the series) that it's related to her accusation against Weinstein. In one scene, McGowan meets with Ronan Farrow — who reported on a network of private investigators and spies, including some former Mossad agents, that Weinstein employed while trying to keep reports of his alleged abuses under wraps — to discuss his investigation. The series also shows McGowan on her way to a court appearence and discussing her mugshot.", "images": ["https://media.gannett-cdn.com/29906170001/29906170001_5627106842001_5627103814001-vs.jpg?pubId=29906170001&width=660&height=372&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/912eaf2649c080d2b3463a580497324a5a12adb0/c=0-413-6232-3934/local/-/media/2018/01/02/USATODAY/USATODAY/636505028767828631-XXX-IMG-USP-NEWS-THE-WOMEN-S-1-1-7MKHP8RP.JPG?width=3200&height=1808&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/912eaf2649c080d2b3463a580497324a5a12adb0/c=0-413-6232-3934/local/-/media/2018/01/02/USATODAY/USATODAY/636505028767828631-XXX-IMG-USP-NEWS-THE-WOMEN-S-1-1-7MKHP8RP.JPG?width=3200&height=1808&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/tv/2018/01/24/citizen-rose-mcgowans-documentary-series/1061157001/", "title": "'Citizen Rose': 5 things to know about Rose McGowan's documentary series", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "'Citizen Rose': 5 things to know about Rose McGowan's documentary series", "description": "The actress and activist tells her side of the story in the E! documentary series.", "url": "https://www.usatoday.com/story/life/tv/2018/01/24/citizen-rose-mcgowans-documentary-series/1061157001/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/912eaf2649c080d2b3463a580497324a5a12adb0/c=0-413-6232-3934/local/-/media/2018/01/02/USATODAY/USATODAY/636505028767828631-XXX-IMG-USP-NEWS-THE-WOMEN-S-1-1-7MKHP8RP.JPG?width=3200&height=1808&fit=crop&format=pjpg&auto=webp", "width": 3200, "height": 1808}, "type": "article"}, "article": {"author": "Kelly Lawler", "content_tier": "free", "opinion": "false"}, "description": "The actress and activist tells her side of the story in the E! documentary series.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/912eaf2649c080d2b3463a580497324a5a12adb0/c=0-413-6232-3934/local/-/media/2018/01/02/USATODAY/USATODAY/636505028767828631-XXX-IMG-USP-NEWS-THE-WOMEN-S-1-1-7MKHP8RP.JPG?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "'Citizen Rose': 5 things to know about Rose McGowan's documentary series", "description": "The actress and activist tells her side of the story in the E! documentary series."}}, "movies": [], "publish_date": 1516723200.0, "source": "https://www.usatoday.com", "summary": ""}