{"url": "https://www.billboard.com/articles/columns/latin/8468666/shakira-north-american-el-dorado-tour-live-review", "text": "Shakira kicks off the North American leg of Her El Dorado World Tour at United Center on Aug. 3, 2018 in Chicago.\n\nShakira fans waited long enough to see the Colombian superstar touring and back onstage in the United States -- seven years to be exact. And for some fans, like Joel and Karen, it was the first time they got to see Shakira live.\n\n“We drove eight hours from Minnesota just to see her,” said the couple. “We’ve been waiting since the '90s to see Shakira. I want to sing the oldies with her.\" \"I’ve been practicing in my shower for the last 20 years,” added Karen.\n\nAfter a successful run in Europe earlier this summer, Shakira kicked off the U.S. leg of her El Dorado Tour at the United Center in Chicago on Friday (Aug. 3). The tour was rescheduled from January after the singer/songwriter had to postpone her international trek due to strained vocal chords.\n\n“It’s so good to see you,” Shakira said after singing her first couple of songs, including “Estoy Aquí,” “She Wolf” and “Si Te Vas.”\n\n“It’s been way too long,\" she continued. \"I’ve been dreaming about this moment. There were times when all of this seemed impossible, but miracles do exist. You made this happen! Thank you for all your support, especially in these last few months.\"\n\nNot only did Shakira sing her heart out -- in English and Spanish -- for nearly two hours and delivered classics like “Inevitable,” “Tú” and “Antología” and her most recent hits such as “Me Enamoré” and “Chantaje,” she also danced all night long. Even as mother of two, those hips still don’t lie.\n\nWorking the stage from left to right and walking along a runway that stretched to the center of the venue, the hypnotizing and infectious hip moves came when the chart-topping artist sang tracks like “Perro Fiel,” “Dare (La La La),” “Waka Waka” and “Loca.”\n\nOf course, the sexy, upbeat tracks called for a change in wardrobe and for those, Shakira appeared onstage with her staple belly dancing wraps covered with beads and coins that really accentuated her hip-swiveling moves.\n\nTwo special guests spotted in the crowd were Shakira’s sons: Milan and Sasha. The two almost stole the show when they were ushered to their front row seats where they would see their mamá in all her glory. From the stage and throughout the show, she blew kisses their way.\n\nAnother fan favorite moment was when Shakira appeared on the other side of the venue wearing a long, gold dress to sing “Toneladas” and right after, made her way back to the main stage walking in the middle of the crowd and stopping to snap a few selfies and greet fans who threw themselves at her as she passed by.\n\nThe grand finale was a succession of hits, including “Rabiosa,” “Hips Don’t Lie,” “La Tortura” and “La Bicicleta.” It reminded us of how vast Shakira's catalog is, and how enduring the hits are, even after a seven-year wait.\n\n“First night in the U.S., incredible,” she wrote on social media immediately after the concert. “Thank you, Chicago.”", "images": ["https://static.billboard.com/files/2020/04/Billie-Eilish-Where-Do-We-Go-World-Tour-Kick-Off-Miami-2020-billboard-1548-1587151378-compressed.jpg", "https://static.billboard.com/files/2020/03/radio-city-music-hall-covid19-2020-billboard-1500x845-1584562361-compressed.jpg", "https://static.billboard.com/files/media/Shakira-august-chicago-2018-a-billboard-1548-1024x677.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://static.billboard.com/files/2020/04/miley-cyrus-april-2019-uu-billboard-z-1548-1585925327-compressed.jpg", "https://static.billboard.com/files/2020/03/7cover_Coronavirus_Touring_WEB-1585231399-220x286.jpg", "https://static.billboard.com/files/2020/03/GettyImages-1144319419-1583448877-compressed.jpg", "https://www.billboard.com/assets/1586539892/images/Billboard-white.svg?c596412deda54d9a807d"], "top_img": "https://static.billboard.com/files/media/Shakira-august-chicago-2018-a-billboard-1548-1024x677.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.billboard.com/articles/columns/latin/8468666/shakira-north-american-el-dorado-tour-live-review", "title": "Shakira Kicks Off Momentous U.S. Tour in Chicago After 7-Year Wait: 'I've Been Dreaming About This Moment'", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2018-08-04T12:46:07-04:00", "published_time": "2018-08-04T11:47:35-04:00"}, "description": "Shakira kicked off the U.S. leg of her El Dorado tour in Chicago on Friday night (Aug. 3).", "og": {"description": "Shakira kicked off the U.S. leg of her El Dorado tour in Chicago on Friday night (Aug. 3).", "image": {"identifier": "https://static.billboard.com/files/media/Shakira-august-chicago-2018-a-billboard-1548-1024x677.jpg", "height": 677, "width": 1024}, "title": "Shakira Kicks Off El Dorado U.S. Tour| Billboard", "type": "article", "url": "http://www.billboard.com/articles/columns/latin/8468666/shakira-north-american-el-dorado-tour-live-review", "site_name": "Billboard"}, "title": "Shakira Kicks Off Momentous U.S. Tour in Chicago After 7-Year Wait: 'I've Been Dreaming About This Moment'", "twitter": {"card": "summary_large_image", "description": "Shakira kicked off the U.S. leg of her El Dorado tour in Chicago on Friday night (Aug. 3).", "image": "https://static.billboard.com/files/media/Shakira-august-chicago-2018-a-billboard-1548-1024x677.jpg", "title": "Shakira Kicks Off Momentous U.S. Tour in Chicago After 7-Year Wait: 'I've Been Dreaming About This Moment'", "site": "@billboard"}}, "movies": [], "publish_date": 1533397655.0, "source": "https://www.billboard.com", "summary": ""}