{"url": "https://en.wikipedia.org/wiki/Iman_(model)", "text": "Iman (born Zara Mohamed Abdulmajid; Somali: Zara Maxamed Cabdulmajiid; 25 July 1955[2]) is a Somali fashion model, actress and entrepreneur. A former muse of designers Gianni Versace, Halston, Calvin Klein, Donna Karan and Yves Saint Laurent, she is also noted for her philanthropic work. She is the widow of English rock musician David Bowie, whom she married in 1992.[3]\n\nEarly life [ edit ]\n\nIman was born Zara Mohamed Abdulmajid in Mogadishu, the capital of Somalia. She was later renamed Iman at her grandfather's urging.[4] Iman is the daughter of Marian and Mohamed Abdulmajid.[5] Her father was a diplomat and a former Somali ambassador to Saudi Arabia,[6] and her mother was a gynecologist.[7] She has four siblings: two brothers, Elias and Feisal, and two younger sisters, Idil and Nadia.[8]\n\nIman lived with her grandparents during her formative years. At the age of four, she was sent to boarding school in Egypt, where she spent most of her childhood and adolescence.[4][9] Following political unrest in Somalia, Iman's father moved the family back to the country. At his behest, she, her mother and siblings subsequently travelled to Kenya and were later joined by her father and younger sister.[4] There, she studied political science at the University of Nairobi for a brief period,[10] in 1975.[11]\n\nCareer [ edit ]\n\nModeling [ edit ]\n\nWhile still at university, Iman was discovered by an American photographer Peter Beard, and she subsequently moved to the United States to begin a modeling career.[6][12] Her first modeling assignment was for Vogue a year later in 1976. She soon landed some of the most prestigious magazine covers, establishing herself as a supermodel.[6]\n\nWith her long neck, tall stature, slender figure, fine features, copper-toned skin, and exotic accent, Iman was an instant success in the fashion world, though she herself insists that her looks are merely or typically Somali. She became a muse for many prominent designers, including Halston, Gianni Versace, Calvin Klein, Issey Miyake and Donna Karan.[9][13][14] She was a favorite of Yves Saint-Laurent, who once described her as his \"dream woman\".[15]\n\nIman has also worked with many notable photographers, including Helmut Newton, Richard Avedon, Irving Penn and Annie Leibovitz.[13]\n\nIman credits the nurturing she received from various designers with having given her the confidence to succeed in an era when individuality was valued and model-muses were often an integral part of the creative process.[9]\n\nShe is signed to TESS Management in London.[16]\n\nBusiness [ edit ]\n\nIman Cosmetics [ edit ]\n\nIman in 1996\n\nAfter almost two decades of modeling, Iman started her own cosmetics firm in 1994, focusing on difficult-to-find shades for women.[17] Based on her years of experience mixing her own formulations for make-up artists to use on her, she was closely involved with the final product and also acted as the commercial face of the company.[9]\n\nIman Cosmetics was a US$25-million-a-year business by 2010. It is centered on US$14.99 foundations in 4 formulations and 14 shades, and is among the top-selling foundation brands on Walgreens website.[9]\n\nIn spring 2012, Iman signed fellow Somali designers Ayaan and Idyl Mohallim, founders of the Mataano fashion company, as brand ambassadors for her cosmetics line.[18]\n\nGlobal Chic [ edit ]\n\nDue to her marketability and high profile, Iman was approached in 2007 by the CEO of the Home Shopping Network (HSN) to create a clothing design line. Inspired by her childhood in Egypt and modeling time with Halston, Iman's first collection introduced embroidered, one-size-fits-all caftans. Today, her Global Chic collection is one of four best-selling items among more than 200 fashion and jewelry brands on HSN, having evolved into a line of affordable accessories.[9]\n\nCinema [ edit ]\n\nIman appeared as a character named Martia in Star Trek VI: The Undiscovered Country (1991).[19] She plays the role of a Star Trek Chameloid alien, a shape-shifter who can take on different forms. Various actors play this character in different guises, but Iman plays the form in which the character principally appears in the film.\n\nTelevision [ edit ]\n\nIman at the Metropolitan Opera opening night in 2006\n\nIman appeared in two episodes of Miami Vice, playing Dakotah in Back in the World (1985) and Lois Blyth in Love at First Sight (1988). She also had a guest role as Mrs. Montgomery on The Cosby Show (1985). In 1988, she appeared as Marie Babineaux in an episode of In the Heat of the Night.[20]\n\nIn the mid-2000s, Iman spent two years as the host of Bravo TV's fashion-themed show, Project Runway Canada. In November 2010, along with her friend and colleague, designer Isaac Mizrahi, Iman also began hosting the second season of The Fashion Show. Bravo started the series to replace its former hit Project Runway that has now moved to the Lifetime network.[9][21]\n\nFilm [ edit ]\n\nIman first featured in the 1979 British film The Human Factor, and had a bit part in the 1985 Oscar-winning film Out of Africa starring Robert Redford and Meryl Streep. She then portrayed Nina Beka in the 1987 thriller No Way Out with Kevin Costner, and Hedy in the Michael Caine comedy Surrender the same year. During her first year in Hollywood, in 1991, Iman worked on several film productions.[22] Among these was the Tim Hunter-directed Lies of the Twins and Star Trek VI: The Undiscovered Country, where she played a shapeshifting alien. Iman also took on some comedic roles. In 1991 she appeared in The Linguini Incident opposite her then fiancé David Bowie. She had a smaller part in the 1991 comedy House Party 2 and in the 1994 comedy/romance film Exit to Eden.[20]\n\nVideo games [ edit ]\n\nIman made a cameo appearance alongside her husband David Bowie in the 1999 Windows 9x and Dreamcast 3D adventure game, Omikron: The Nomad Soul, developed by the video game company, Quantic Dream. In the game, she appears as one of the numerous Omikronian citizens the player can \"reincarnate\" into.[23]\n\nPhilanthropy [ edit ]\n\nIn addition to running her global beauty company, Iman is also actively involved in a number of charitable endeavors. Since September 2019, Iman has held the role of CARE's first-ever Global Advocate, where she works alongside CARE to support its mission to create a world where poverty has been overcome and all people live with dignity and security. She is also currently a spokesperson for the Keep a Child Alive program, and works closely with the Children's Defense Fund.[13] She also serves as an Ambassador for Save the Children, and has been active in raising awareness of their relief services in the greater East Africa region.[24] Additionally, Iman works with the Enough Project to end the global trade in conflict minerals. She played a key part in the public campaign against blood diamonds through her termination of her contract with the diamonds conglomerate De Beers over a conflict of ethics.[25][26]\n\nAwards [ edit ]\n\nOver the course of her long modeling and philanthropic career, Iman has received many awards. On 7 June 2010, she received a Fashion Icon lifetime achievement award from the Council of Fashion Designers of America (CFDA), a special prize reserved for \"an individual whose signature style has had a profound influence on fashion\". Iman selected her friend, actress and former model Isabella Rossellini, to present the award.[9][27] Wearing a gown designed by Giambattista Valli with four giant diamond bracelets on each arm, Iman thanked her parents \"for giving me a neck longer than any other girl on any go-see anywhere in the world\".[27]\n\nPersonal life [ edit ]\n\nIman is Muslim.[28] She is fluent in five languages: Somali, Arabic, Italian, French and English.[29]\n\nIman was first married at age 18 to Hassan, a young Somali entrepreneur and Hilton hotelier executive.[30][31] The marriage ended a few years later when she moved to the United States to pursue a modeling career.[30]\n\nIn 1977, Iman dated American actor Warren Beatty.[32] Later that year, she became engaged to American basketball player Spencer Haywood, and they married soon after. Their daughter, Zulekha Haywood, was born in 1978. The two divorced in February 1987.[33]\n\nOn 24 April 1992, Iman married English musician David Bowie in a private ceremony in Lausanne, Switzerland. The wedding was then solemnized, on 6 June, in Florence, Italy.[34] They have one daughter, Alexandria Zahra Jones, born 15 August 2000 at Mount Sinai Hospital in New York City.[35] Iman is also stepmother to Bowie's son from a previous marriage, Duncan Jones. Both children bear Bowie's legal surname. Iman and her family resided primarily in Manhattan and London.[36] When Bowie died on 10 January 2016, making her a widow, she wrote in tribute to him that \"the struggle is real, but so is God.\"[37]\n\nBibliography [ edit ]\n\nI Am Iman (2001)\n\n(2001) The Beauty of Color (2005)\n\n(2005) One Love Lost: A True Story (2005)\n\nFilmography [ edit ]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/0/0b/Iman_2010.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Iman_1996.jpg/170px-Iman_1996.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Iman_2010.jpg/180px-Iman_2010.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Iman_and_David_Bowie_at_the_premiere_of_Moon.jpg/220px-Iman_and_David_Bowie_at_the_premiere_of_Moon.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Iman_%28model%29.jpg/170px-Iman_%28model%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Iman_2010.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Iman_(model)", "title": "Iman (model)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Iman_2010.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}