{"url": "en.wikipedia.org/wiki/Liam_Hemsworth", "text": "Australian actor\n\nLiam Hemsworth (born 13 January 1990)[3] is an Australian actor. He played the roles of Josh Taylor in the soap opera Neighbours and Marcus in the children's television series The Elephant Princess. In American films, Hemsworth starred as Will Blakelee in The Last Song (2010), as Gale Hawthorne in The Hunger Games film series (2012–2015), and as Jake Morrison in Independence Day: Resurgence (2016).\n\nHemsworth's older brothers, Luke and Chris, are also actors.\n\nEarly life\n\nHemsworth was born in Melbourne, Australia, to Leonie (née van Os), an English teacher, and Craig Hemsworth, a social-services counsellor.[4][5][6] He has two older brothers, Chris Hemsworth and Luke Hemsworth, who are also actors.[7] His maternal grandfather is a Dutch immigrant, and his other ancestry is English, Irish, Scottish, and German.[8] Hemsworth has said that though there is competition for jobs among them, it is friendly: \"We are brothers and we are always competitive, but it is a good thing, it pushes us and we are always happy whenever someone books something.\"[9]\n\nWhen Hemsworth was in year 8, he and his family relocated to Phillip Island,[10] a small Australian island southeast of Melbourne where he spent much of his time there surfing with his brothers.[11] In March 2009, Hemsworth moved to the United States to pursue his acting career.[12] He and his brother Chris first stayed in the guest house of Chris's manager, William Ward,[13] before renting their own Los Angeles apartment.[9]\n\nActing career\n\n2007–2010: Career beginnings\n\nPrior to becoming an actor, Hemsworth laid floors for six months.[9] He began to seriously consider following his elder brothers' footsteps in high school by participating in school plays. Eventually, Hemsworth retained an agent.[11] He attended his first audition at the age of sixteen[14] and began his career in 2007 with guest appearances on the shows Home and Away and McLeod's Daughters.[15] The week of 8 July 2007, Hemsworth began filming episodes for Neighbours, an Australian soap opera his brother Luke had previously starred in.[16] Hemsworth's character, Josh Taylor, was a recurring character from 2007 to 2008. In the show, Josh was an athletic paraplegic who supported and began a relationship with character Bridget Parker after she was paralysed down one side of her body in a car crash.[17] In 2008, Hemsworth began acting on the children's television show The Elephant Princess, playing \"Marcus\", the lead guitarist of the protagonist's band.[15][18] Hemsworth later had roles in the television series Satisfaction and starred in the British film Triangle.[15] He also made a brief appearance as an MIT student in the film Knowing.[19]\n\nIn 2009, Hemsworth was selected to act opposite Sylvester Stallone in Stallone's 2010 film, The Expendables, but his character was written out of the script (Hemsworth later co-starred in The Expendables 2).[7] Hemsworth's brother, Chris, told Movieline that just a few hours after Hemsworth learned he would not appear in The Expendables, director Kenneth Branagh called to ask him to test for the lead role in the 2011 film Thor.[7] Hemsworth moved to the States in March 2009 for screen tests.[12] Though he eventually lost the role to Chris in May,[13] Disney announced later the same week that Hemsworth had landed the part of Will Blakelee in the 2010 drama The Last Song, based on the Nicholas Sparks novel by the same name. Hemsworth plays the love interest of Miley Cyrus's character in the film.[20] Nikki Finke reported that Hemsworth had been in Los Angeles for just three weeks and had not yet found an agent when he was cast.[13] Hemsworth next appeared in the music video for Cyrus' \"When I Look at You\"[21] which was recorded on 16 August 2009.[22]\n\nIn September 2009, Hemsworth appeared at a dinner event to promote Foxtel, an Australian pay television company.[23] In March 2010, Details magazine selected Hemsworth as one of their predictions for \"The Next Generation of Hollywood's Leading Men\".[19] Later that month, it was announced that Hemsworth was in negotiations to star in Arabian Nights, a 3D action film that will be directed by Chuck Russell for Inferno Entertainment.[24] It was later confirmed that he will be starring in the movie.[25] He has also reportedly been offered the lead role in Northern Lights after Taylor Lautner withdrew from the David Ellison-financed project.[25]\n\nHemsworth was the Nickelodeon Australian Kids' Choice Awards 2010 host. He and Miley Cyrus won the \"Fave Kiss\" category.[26]\n\nHemsworth starred in the music video for \"Colder Weather\" by the Zac Brown Band.[27]\n\n2011–present: The Hunger Games series and beyond\n\nLiam Hemsworth, November 2014\n\nOn 4 April 2011, Lionsgate announced Hemsworth to be one of the leads, Gale Hawthorne, in The Hunger Games, which was released in 2012.[28] In June 2011, he became attached to war drama Love and Honor which also stars Aimee Teegarden and Teresa Palmer.[29]\n\nIn 2013, Hemsworth appeared in Empire State, with Emma Roberts, and Paranoia, co-starring Harrison Ford, Gary Oldman and Amber Heard. He reprised his role, Gale Hawthorne, in three sequels to The Hunger Games, The Hunger Games: Catching Fire, released in November 2013, The Hunger Games: Mockingjay – Part 1, released in November 2014, and The Hunger Games: Mockingjay – Part 2, released in November 2015.\n\nOn 11 June 2012, Los Angeles-based non-profit organization Australians in Film announced that Hemsworth would be honoured at an exclusive benefit dinner on 27 June 2012 in Hollywood.[30] Hemsworth attended the invitation only event, held at the Intercontinental Hotel in Century City, with his then fiancée Miley Cyrus. It was their first public appearance together as an engaged couple.[31]\n\nIn 2015, Hemsworth portrayed the love interest of Kate Winslet's character in the Australian literary adaptation The Dressmaker, which was filmed in Victoria in the summer of 2014.[32][33] Hemsworth starred in director Roland Emmerich's 2016 film Independence Day: Resurgence.[34] In 2019, following a three-year absence, he played a fantasy version of a romantic comedy leading man in the film Isn't It Romantic, and starred in the action crime film Killerman.\n\nHemsworth is currently working on a horror TV series, Most Dangerous Game, for Quibi, the short-form streaming platform. Hemsworth will play the lead role as a terminally ill man trying to provide for his pregnant wife before he dies.[35] The show is set to premiere in April 2020.\n\nPersonal life\n\nHemsworth at the San Diego ComicCon, 2013\n\nHemsworth is the ambassador of the Australian Childhood Foundation. Hemsworth talked about his association with the foundation, \"I have the best parents you can have. They have worked in child protection for twenty years and have only ever given me encouragement and support. The world is a scary enough place as it is for children. It is important that home should always be a safe place for them.\" When asked if he believed he was a hero to children, Hemsworth said he did not know, but that he would like to be a good role model.[36]\n\nHemsworth is vegan and told Men's Fitness that he found \"no negatives to eating like this. I feel nothing but positive, mentally and physically.\"[37]\n\nRelationship with Miley Cyrus\n\nWhile filming The Last Song in June 2009, Hemsworth began a relationship with his co-star Miley Cyrus.[38] After a three-year on-again, off-again relationship, the couple announced their engagement in June 2012.[39] They lived together in Los Angeles[40] but ended their engagement in September 2013.[41] In July 2014, Hemsworth said that he and Cyrus would \"always be best friends\" and they had \"an instantaneous and powerful connection.\"[42] Rumours began in January 2016, stemming primarily from sightings of the couple together at his Malibu home and the reappearance of the engagement ring on Cyrus.[43] Cyrus confirmed in an interview on The Ellen DeGeneres Show in October 2016, they were once again engaged.[44]\n\nIn November 2018, Cyrus revealed on social media that her and Hemsworth's home had burned down in the Woolsey Fire,[45][46] and expressed devastation for her community and gratitude for the safety of herself, Hemsworth, and their pets. The following morning, Hemsworth responded on his social media by posting a picture he had taken of the charred rubble of their former home.[47][48][49] In his posts he praised the residents of his community on how they united in helping with the consequences of the fire, and encouraged his followers to donate their time, money, and resources to The Malibu Foundation, a non-profit established in the wake of the Woolsey fire, and to his fiancée's own non-profit organisation, the Happy Hippie Foundation, to further contribute help with the aftermath. On 13 November 2018, Hemsworth and Cyrus made a joint $500,000 donation to The Malibu Foundation through Cyrus's foundation.[50]\n\nHemsworth and Cyrus married on 23 December 2018 at their home in Nashville, Tennessee.[51] On 10 August 2019, Cyrus announced their separation.[52] Eleven days later, Hemsworth filed for divorce, citing irreconcilable differences.[53] On 28 January 2020, it was announced that their divorce had been finalized.[54]\n\nFilmography\n\nFilm\n\nTelevision\n\nAwards and nominations\n\nOn 27 June 2012, Liam Hemsworth was presented with the Australians in Film Breakthrough Award for international success.[30]", "images": ["https://upload.wikimedia.org/wikipedia/commons/a/a4/Liam_Hemsworth_June_2016.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Liam_Hemsworth_November_2014.jpg/150px-Liam_Hemsworth_November_2014.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Liam_Hemsworth_by_Gage_Skidmore.jpg/200px-Liam_Hemsworth_by_Gage_Skidmore.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Liam_Hemsworth_June_2016.jpg/220px-Liam_Hemsworth_June_2016.jpg", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Liam_Hemsworth_June_2016.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Liam_Hemsworth", "title": "Liam Hemsworth", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.27", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Liam_Hemsworth_June_2016.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}