{"url": "https://www.huffingtonpost.com/entry/pearl-mackie-new-doctor-who-companion_us_58f0e37ce4b0da2ff86013be", "text": "When Pearl Mackie began the audition process for “Doctor Who,” she didn’t know she was auditioning for “Doctor Who.”\n\nShe’d been starring in the West End production of “The Curious Incident of the Dog in the Night Time” when her agent asked if she was available to tryout for a part in a show called “Mean Town.” With little more information, Mackie said she was free and agreed to wait for more details on the opportunity. When her agent contacted her again, she told the actress that “Mean Town” wasn’t actually a show, it was an anagram for “Woman Ten.” Turns out, Mackie wasn’t just auditioning for a poorly titled drama or sitcom, she was now in the running to become the newest female companion on “Doctor Who” Season 10.\n\n“I was like, riiight, OK, I’m never gonna get that,” the London-born Mackie told The Huffington Post in a phone interview. Long story short, she did. After an initial audition, she performed lines alongside a theatrical Peter Capaldi, the resident Doctor entering into his final season as a time-traveling alien this year.\n\n“He’s running pressing buttons and pulling levers, because he knows where everything is in the TARDIS,” Mackie recounted. “And I’m sort of just standing, open-mouthed, looking around in wonder, kind of thinking ― What is going on here? This is the maddest experience of my life. I’ve just had the most intense experience, and I can’t even tell anyone about it.”\n\nSecrecy is par for the course when it comes to the BBC show, which ran for 26 seasons between the 1960s and 1980s, only to return in a 2005 revival that’s about to air its Season 10 premiere on BBC America on April 15. But Mackie’s character, Bill Potts, is anything but traditional. According to The Guardian, she’ll be the show’s first openly gay companion, a woman who’s been described as “completely fresh and new,” perhaps due in part to the fact that the actress behind the role has never really watched more than one episode of the show.\n\nCheck out our entire interview with Mackie, in which we talked about her character’s persona, the pressures of joining the “Doctor Who” family, and what representation on television means to her.\n\nI love your character’s name ― Bill. Is there anything behind the name? Is it short for anything?\n\nWell, no, not as far as I know. She’s just called Bill! I wondered the same, but I haven’t discovered anything, unless they’ve got big plans for a reveal later on. No, as far as I know, it’s just Bill.\n\nFans have been speculating that Bill is from the ‘80s and that there might be a parallel to a former “Who” companion, Ace ― is any of this true? I’ve read that “Doctor Who” showrunner Steven Moffat has hinted otherwise.\n\nShe is not from the ‘80s, no. She is very much from now. She’s very much a present-day woman. Kind of a normal young woman, really. Kind of a nod there, in her vintage-inspired outfits, but she’s definitely not from the ‘80s.\n\nBBC America\n\nIs there anything else you can tell us about Bill’s origins that won’t incite utter rage from the BBC?\n\nYeah! In terms of personality, she’s very open and she’s very real. When I read Steven’s script, I was very struck by how fully rounded the character was. Not sort of struck in terms of being surprised by Steven’s writing ― because, I mean, we all know how good that is ― but it was very much more that I felt she was already there. She had a history. She felt like a real person that you would meet. And someone that you’d like. She’s quite open. She’s quite honest ― sometimes to her detriment. She doesn’t necessarily always think things through before saying them. But I don’t do that very well either, so maybe that’s why I related to her. But yeah, she’s quite witty and quite intelligent and very human and driven by her gut and the way she feels about things, which is something that I really liked.\n\nDo we know how old she is or where she was born?\n\nI mean, she’s about early 20s, I would say. Yeah, that kind of age. Aaand I don’t know if I can say where she’s born. In the U.K.! To be vague.\n\nBBC America\n\nWell, obviously the entire “Doctor Who” universe is filled with a ton of secrecy and a lot of these really really dedicated fans. I saw that kids are already dressing up as your character online. What has your life as a companion been like so far ― even before the show has aired?\n\nIt’s been kind of a whirlwind. It’s sort of like being welcomed into like the biggest, most enthusiastic family at a family gathering and being introduced to them all at the same time. And, you know, everyone’s got really strong opinions about what it is you’re about to do, which can be a little bit overwhelming at times. But I think, for me, it’s been amazing. It’s such a wonderful thing to be part of a show that means so much to so many people. You know, people relate to “Doctor Who” in such a personal way, which I think is why people have their own personal favorite Doctor, their favorite companion, their favorite monsters, their favorite episodes. It’s a very strong relationship for a lot of people. And it’s been wonderful to be to be welcomed so wholeheartedly into it.\n\nDid you do any particular research before you took on the role? Did you brush up on any of the history or any of the fan theories?\n\nYou know, I didn’t watch much of “Doctor Who” when I was a kid. I didn’t watch any of the feature series ― I think I’ve watched one episode. But obviously you’d have to be living in some type of a hole to not be aware of the show. After getting the job, I said to Steven and [executive producer] Brian [Minchin], “Look, give me the back catalog and let me watch everything.” And they said, “Well, what you’re doing at the moment is great. You’re bringing a really nice sort of freshness to it. And, you know, you experiencing things as Bill is kind of experiencing things seemed to work really well. So don’t watch it!”\n\nAnd also, I kind of felt like as an actor watching someone play what is essentially your role [as a companion] and watching them do it so well, it would be hard not to borrow a little bit here and there, even subconsciously. And I really didn’t want to do that because I thought Bill was supposed to be completely fresh and completely new to this. So I thought it was best not to [watch].\n\nDid Peter Capaldi or some of the other cast and crew members give you any memorable advice during your first moments on set?\n\nPeter was great. He gave me a little card and a scented candle for my new flat in Cardiff. It was really sweet. It’s such a big beast of a show, you know, in terms of its its reach and its fan base and all the extra little bits that make up the world of Doctor Who. But he said, “Remember why you’re here. You’re here because you’re really good.” Which was very kind of him to say. “The acting is what you’re here to do ― that’s the main job. We’re here to create this show and everything else is on top. But all of that can be a bit too much sometimes. It can seem like a lot, but if it does, here’s my number. Feel free to have a chat with me about it if anything seems too overwhelming.” Which was very lovely.\n\nThe trailer for the upcoming “Who” season contains the line, “2017 needs us.” And Peter Capaldi has hinted in interview that while Season 9 began to reflect on the modern world a bit more, he thinks we might see more of that in Season 10. Does this mean we’re going to hear about contemporary politics at all on the show?\n\nUmmm, there might be some areas of contemporary politics in this series. Yes, indeed. But not in a very direct way. In a way that is open to interpretation, as all good art that imitates life is. If you know what I mean? Am I being too abstract?\n\nBBC America\n\nI can’t imagine keeping secrets, so I applaud you. On to the next question! One of my favorite “Doctor Who” fan theories claims that the Doctor always regenerates into a face he’s seen before. So, is there any chance the character of Bill is just one giant teaser for your eventual takeover as the Doctor? Would you turn down the role?\n\nWhat, would I turn down the role of Doctor Who? No, I’d be mad to do that, wouldn’t I? Can you imagine if someone was like, “Do you want to be Doctor Who?” And you were like, “Nah, I’m alright. One of the most exciting jobs in television? Nah, you can leave that, actually. I’m over it.” That’s not to say that’s what is going to happen. I mean, who knows?\n\nThere’s been loads of discussion about the all-male Doctor roster ― we’ve yet to see a woman tackle the role. What do you make of the show’s track record with representation?\n\nI think in terms of representation, this series is doing pretty well from what I’ve seen so far. Hopefully, by the end of the series, we might have another conversation, or you might think the same. But in terms of playing the character of Doctor Who next, hopefully, they get whoever is best for the job, whatever gender or race that may be.\n\nYou mentioned in a Guardian interview that you didn’t see many people who looked like you on TV growing up. When you think about your role on this show, are you thinking about the fans today who might still feel the same way you did?\n\nI think as an actress of color, there’s always that kind of responsibility. And especially in a prime-time, widely reaching show. For me, if even a couple of kids can look at Bill on “Doctor Who” and think, hey, she looks like me, maybe that means there’s more room for me in the world of acting or the world of television or the world of fighting aliens, then that’s a good thing, you know? I think it is important to see people that look like you and to show that there is a place for you in the world. That you do exist and that you are important. But then, that said, you know, I am only playing one person and she’s not supposed to be representative of every person and every young woman of color, because that would be a generalization that we wouldn’t want to make either.\n\n“Doctor Who” Season 10 premieres Saturday, April 15 at 9 p.m. ET on BBC America.", "images": ["https://www.facebook.com/tr?id=10153394098876130&ev=PageView&noscript=1", "https://s.m.huffpost.com/assets/donut-a63d2a21ca5f04f551be212a9496d4deba5d40f4bcb801f34ba14f27bb3bb32a.svg", "https://s.m.huffpost.com/assets/H-icon-72fd5782b36a1a42ab82a4af65cbc6dd6ddc4d4a71190a91c5cfaab7c66fd836.svg", "https://img.huffingtonpost.com/asset/5d88f91b2100003200dab6d8.png", "https://img.huffingtonpost.com/asset/58f1321514000021001b466a.jpeg?ops=scalefit_970_noupscale", "https://img.huffingtonpost.com/asset/5591c4cb2b00004c00cb1533.jpg?ops=100_100", "https://img.huffingtonpost.com/asset/58f131f22600003600c45c91.jpeg?ops=scalefit_970_noupscale", "https://sb.scorecardresearch.com/p?c1=2&c2=6723616&c3=&c4=&c5=&c6=&c15=&cj=1", "https://img.huffingtonpost.com/asset/58f131b414000021001b4667.jpeg?ops=scalefit_970_noupscale", "https://img.huffingtonpost.com/asset/58f131b414000021001b4667.jpeg?ops=1778_1000", "https://s.m.huffpost.com/assets/HuffPostHero-d783f680fb974e80346bdfa145131d058e596e1d32f791981875aa481702c770.svg", "https://img.huffingtonpost.com/asset/58f131d82600004500c45c90.jpeg?ops=scalefit_970_noupscale", "https://www.facebook.com/tr?id=1621685564716533&ev=PageView&noscript=1"], "top_img": "https://img.huffingtonpost.com/asset/58f131b414000021001b4667.jpeg?ops=1778_1000", "keywords": [], "authors": ["Deputy Enterprise Editor", "Culture"], "canonical_link": "https://www.huffpost.com/entry/pearl-mackie-new-doctor-who-companion_n_58f0e37ce4b0da2ff86013be", "title": "Meet Pearl Mackie, The 20-Something Shaking Up 'Doctor Who'", "meta_data": {"google-site-verification": "97Mj-wW7u8U1NOnkW1rfH-I1kgO0-a9YsgoesOk41R8", "oath": {"guce": {"product-eu": "false", "consent-host": "guce.huffpost.com", "locale": "en-US", "inline-consent": "true"}}, "fb": {"pages": 70242384902, "app_id": 46744042133}, "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "description": "Starting April 15 on BBC America, Mackie will play the series' first openly gay companion.", "keywords": "Entertainment Originals,Television,bbc,Doctor Who,Whoniverse", "og": {"title": "Meet Pearl Mackie, The 20-Something Shaking Up 'Doctor Who'", "type": "article", "image": {"identifier": "https://img.huffingtonpost.com/asset/58f131b414000021001b4667.jpeg?ops=1778_1000", "url": "https://img.huffingtonpost.com/asset/58f131b414000021001b4667.jpeg?ops=1778_1000", "type": "image/jpeg", "width": 1778, "height": 1000}, "url": "https://www.huffpost.com/entry/pearl-mackie-new-doctor-who-companion_n_58f0e37ce4b0da2ff86013be", "site_name": "HuffPost", "locale": "en_US", "description": "Starting April 15 on BBC America, Mackie will play the series' first openly gay companion."}, "article": {"tag": "Entertainment Originals,Television,bbc,Doctor Who,Whoniverse", "section": "Culture & Arts", "author": "https://www.facebook.com/katy.brooks.18", "published_time": "2017-04-14 17:55:22 -0400", "modified_time": "2017-04-14 17:55:22 -0400"}, "twitter": {"card": "summary_large_image", "site": "@HuffPostArts", "title": "Meet Pearl Mackie, The 20-Something Shaking Up 'Doctor Who'", "image": {"identifier": "https://img.huffingtonpost.com/asset/58f131b414000021001b4667.jpeg?ops=1778_1000", "width": 1778, "height": 1000}, "description": "Starting April 15 on BBC America, Mackie will play the series' first openly gay companion.", "creator": "kann_brooks"}, "al": {"ios": {"url": "huffpostnews:///?editionID=us&entryID=us_58f0e37ce4b0da2ff86013be", "app_store_id": 306621789, "app_name": "HuffPost"}}, "taboola.category": "arts"}, "movies": [], "publish_date": 1492206922.0, "source": "https://www.huffingtonpost.com", "summary": ""}