{"url": "https://www.billboard.com/articles/news/dance/8358400/avicii-death-reactions", "text": "Swedish DJ Avicii died Friday (April 20) at the age of 28, his publicist has confirmed to Billboard.\n\n\"He was found dead in Muscat, Oman this Friday afternoon local time, April 20th,\" his publicist Diana Baron said in a statement. \"The family is devastated and we ask everyone to please respect their need for privacy in this difficult time. No further statements will be given.\"\n\nAvicii's dance music peers, and admirers, immediately took to Twitter to express their grief.\n\nNo words can describe the sadness I’m feeling right now, hearing about Avicii passing away....--\n\nThoughts go out to his family and friends... — Zedd (@Zedd) April 20, 2018\n\nRIP @Avicii you will be insanely missed...my deepest condolences to his family. — Dillon Francis (@DILLONFRANCIS) April 20, 2018\n\nI was lucky enough to see Avicii’s last show in Ibiza and what a fucking show it was! Such a talent. Devastating news, my thoughts are with everyone close to him. — Louis Tomlinson (@Louis_Tomlinson) April 21, 2018\n\nSomething really horrible happened. We lost a friend with such a beautiful heart and the world lost an incredibly talented musician. Thank you for your beautiful melodies, the time we shared in the studio, playing together as djs or just enjoying life as friends.\n\nRIP @Avicii pic.twitter.com/IGiTYetJcq — David Guetta (@davidguetta) April 20, 2018\n\nI can’t find words but what I can say is that we all where couple of young kids from Sweden with dreams and Tim inspired us all and millions more. RIP my brother your music will live forever ?? @Avicii pic.twitter.com/riC69lay3p — INGROSSO (@Ingrosso) April 20, 2018\n\nWords can not describe how I feel right now..I am gonna miss you brother ?? pic.twitter.com/AjBgXi5gVR — Tiësto (@tiesto) April 20, 2018\n\nMy heartfelt condolences to Tim's family and close friends. I can't express how deeply sad I am. Meeting him changed my life. He was an amazingly talented person and it hurts so bad that he's gone. — Aloe Blacc (@aloeblacc) April 20, 2018\n\nDevastating news about Avicii, a beautiful soul, passionate and extremely talented with so much more to do. My heart goes out to his family. God bless you Tim x — Calvin Harris (@CalvinHarris) April 20, 2018\n\nmy sincerest and most heartfelt condolences to the friends, fans and families of @Avicii 🙁 Banter aside, nobody can deny what he has accomplished and done for modern dance music and im very proud of him. — Goat lord (@deadmau5) April 20, 2018\n\nAt a loss for words...Rest easy brother -- @Avicii — marshmello (@marshmellomusic) April 20, 2018\n\nI have no words. I remember how amazing it was to make Lonely Together and it felt like just yesterday we were talking. Condolences to Avicii's family, friends, and the fans who supported him. May he rest in peace. Gone too soon. I’m devastated. Heartbroken. — Rita Ora (@RitaOra) April 20, 2018\n\nCan’t believe this, I’m gonna miss you so bad. From your first show where we played together, to all the amazing memories we shared. Thank you for changing the world with your amazing music and for being such an inspiration. I’m gonna miss you brother, until we meet again! ? pic.twitter.com/FjJyLA5Ohc — Hardwell (@HARDWELL) April 20, 2018\n\nOh shit — T'Questlove (@questlove) April 20, 2018\n\nJust hearrbthe craziest shit about avicii.... — T'Questlove (@questlove) April 20, 2018\n\n#RIPAVICII Dear Tim your family have my most heartfelt condolences. You were my little bro. Love always. — Nile Rodgers (@nilerodgers) April 20, 2018\n\nRIP @Avicii so so so so talented!!! so sad. #seekbromance — Dave Audé (@daveaude) April 20, 2018\n\nOh my god truly devastated for Avicii very very sad news way to young ... what a talent he was. rest in peace x — Liam (@LiamPayne) April 20, 2018\n\nAvicii contributed incredible art to this world. devastated to hear about this. Rest In Peace. X — Sabrina Carpenter (@SabrinaAnnLynn) April 20, 2018\n\nSuch sad news to hear about Avicii passing. Too young and way too soon. My condolences go out to his family, friends and fans x — DUA LIPA (@DUALIPA) April 20, 2018\n\nOH MY GOD -- wow... I’m speechless. May you Rest In Peace my dear Tim -- RT @TMZ: #BREAKING: Avicii Has Died at 28 #RIP https://t.co/dvE4cgk9BY — Laidback Luke (@LaidbackLuke) April 20, 2018\n\nSo many of us wouldn't be where we are without @Avicii . Thank you for what you did in your time here. RIP — louis (@LouisTheChild) April 20, 2018\n\nI have no words.. RIP Tim -- — Eric Prydz (@ericprydz) April 20, 2018\n\nRest In Peace Avicii -- — ALISON WONDERLAND (@awonderland) April 20, 2018\n\nFUCK MAN... RIP AVICII. A LEGEND AND THE REASON A LOT OF WHAT WE ALL DO IS POSSIBLE. — BREATHE CAROLINA (@BreatheCarolina) April 20, 2018\n\nRIP Avicii. I have so many great memories to his music. — Caspar Lee (@Caspar_Lee) April 20, 2018\n\nAvicii was one of the first artists to get me into EDM music, so sad man, RIP — Luna (@Lunaa) April 20, 2018\n\nUgh devastating news about Avicii, hard to even believe.. -- sending all my love to his family, friends and community of fans.. electronic music is a community. We lost one of it's brightest stars. He made music that was universally loved. Always seemed so kind. Gone way too soon — Ayahuasca Flocka Flame (@atrak) April 20, 2018\n\ndevastated at the news of @Avicii passing. working with him was one of my favorite collaborative moments. far too young. the world was a happier and fuller place with his presence and art. sending all my love to his friends and family. Xxdr — Imagine Dragons (@Imaginedragons) April 20, 2018\n\nWay too early. So much amazing music the world never will hear. Devastated right now. RIP Tim — Dada Life (@dadalife) April 20, 2018\n\n. @Avicii was talented and kind, and I was genuinely excited to see what would come next from him. His future most certainly should have been written beyond age 28. I am\n\nheartbroken.\n\nRest easy Tim. — Kaskade (@kaskade) April 20, 2018\n\nI’m shook. Avicii. RIP.\n\nSometimes I think only death immortalizes art. — ZHU (@ZHUmusic) April 20, 2018\n\nI‘m at a loss for words. I wouldn’t be where I am if it wasn’t for @Avicii ‘Levels’ made me want to create my own music. Rest in peace. You will always be remembered. ?? pic.twitter.com/5kNoqdXa6L — Felix Jaehn (@FelixJaehn) April 20, 2018\n\nRIP Avicii. — Duke Dumont (@DukeDumont) April 20, 2018\n\nBroken hearted. Such a huge musical inspiration to me and many others. will miss you so much. Rest In Peace Avicii pic.twitter.com/AdU5UzoY90 — Noah Cyrus (@noahcyrus) April 20, 2018\n\nAt a loss for words today... one of the main reasons we got into dance music was because of you, your music was a gift to the world @Avicii thank you ?? I’ll always remember this night 7 or 8 years ago when I first met you?? Rest Easy Brother -- pic.twitter.com/hzAgBLlqvg — Cheat Codes (@CheatCodesMusic) April 20, 2018\n\nRest easy Avicii, you inspired so many of us. Wish I could have said that to you in person x — Ellie Goulding (@elliegoulding) April 20, 2018\n\nHey Tim, I never got to meet you, but I wanted you to know that almost 11 years ago the first remix I ever did was of Seek Bromance. I remember watching all your music videos, interviews, etc. completely fascinated by the phenomena that was avicii. Thanks for inspiring us all. — GASSED UP SHARK ---- (@Jauzofficial) April 20, 2018\n\nRest In Peace @Avicii - u inspired some of my writing and I’m sure thousands of others, u will be missed — Ryan Tedder (@RyanTedder) April 20, 2018\n\nWow...beyond sad to hear about Avicii today. He was one of the biggest reasons I got into dance music. Rest In Peace, your music will forever live on and continue to inspire artists around the world. — GRYFFIN (@gryffinofficial) April 20, 2018\n\nI think this image just speaks for itself today. #Avicii pic.twitter.com/k8YLSwI8oa — Rukes (@rukes) April 20, 2018\n\nTim, I can’t believe what I just heard, you have gone way to early, there are no words to describe how I feel, I am thankful for all the great moments we got to spent together; and thankful for all the things I got to learn from you. The world will miss you.?? ~ R.I.P Avicii pic.twitter.com/HR3JvWGs9k — Nicky Romero (@nickyromero) April 20, 2018\n\navicii 🙁 influenced so many lives at such a young age. rest in peace forever — daya (@Daya) April 20, 2018\n\nRIP Avicii. Remember to tell the people you love how you feel everyday — ODESZA (@odesza) April 20, 2018\n\nRIP AVICII ---- May your legacy continue to live on through your music. Thank you for the impact that you have on many. Prayers going out to your family, friends and fans all across the world. We will miss you. — Normani (@NormaniKordei) April 20, 2018\n\nIt was an honor to be able to work with an artist like @Avicii. A talent like his will truly be missed. pic.twitter.com/yJRdenLWdP — Zac Brown Band (@zacbrownband) April 20, 2018\n\nWishing Avicii a safe journey home...grew up listening to his music and was so incredibly inspired by him and his influence on Electronic Music. Rest In Peace and love?-- — Lauren Jauregui (@LaurenJauregui) April 20, 2018\n\nDeeply shocked and can't believe that dance music has lost one of its icons today. Avicii's music changed the lives of so many people. He will be missed dearly. My sincere condolences to his family, friends & loved ones. May you find the strength you need in these difficult times pic.twitter.com/PLqYaiaLMd — Armin van Buuren (@arminvanbuuren) April 20, 2018\n\nJust landed on the West Coast and received this very sad news. Tim was like a little brother to me. In my darkest hour, I went to Sweden and he was there for me and we found light in great conversation and in music. He will be forever be missed. This pain I can not describe-- pic.twitter.com/YO6HTFyHhQ — Wyclef Jean (@wyclef) April 20, 2018\n\n---- A post shared by Ty Dolla $ign (@tydollasign) on Apr 20, 2018 at 2:46pm PDT", "images": ["https://static.billboard.com/files/2020/04/Billie-Eilish-Where-Do-We-Go-World-Tour-Kick-Off-Miami-2020-billboard-1548-1587151378-compressed.jpg", "https://static.billboard.com/files/2020/03/radio-city-music-hall-covid19-2020-billboard-1500x845-1584562361-compressed.jpg", "https://static.billboard.com/files/media/02-avicii-2018-billboard-1548-1024x677.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://static.billboard.com/files/2020/04/miley-cyrus-april-2019-uu-billboard-z-1548-1585925327-compressed.jpg", "https://static.billboard.com/files/2020/03/7cover_Coronavirus_Touring_WEB-1585231399-220x286.jpg", "https://static.billboard.com/files/2020/03/GettyImages-1144319419-1583448877-compressed.jpg", "https://www.billboard.com/assets/1586539892/images/Billboard-white.svg?5483f7d85ab28d1d2c44"], "top_img": "https://static.billboard.com/files/media/02-avicii-2018-billboard-1548-1024x677.jpg", "keywords": [], "authors": ["Julia Marzovilla"], "canonical_link": "https://www.billboard.com/articles/news/dance/8358400/avicii-death-reactions", "title": "Avicii's Death Mourned by Calvin Harris, Marshmello, deadmau5 & More", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2018-04-21T19:52:14-04:00", "published_time": "2018-04-20T13:59:25-04:00"}, "description": "The Swedish DJ was 28.", "og": {"description": "The Swedish DJ was 28.", "image": {"identifier": "https://static.billboard.com/files/media/02-avicii-2018-billboard-1548-1024x677.jpg", "height": 677, "width": 1024}, "title": "Avicii Dies: Mourned by Calvin Harris, Marshmello, deadmau5 & More | Billboard", "type": "article", "url": "http://www.billboard.com/articles/news/dance/8358400/avicii-death-reactions", "site_name": "Billboard"}, "title": "Avicii's Death Mourned by Calvin Harris, Marshmello, deadmau5 & More", "twitter": {"card": "summary_large_image", "description": "The Swedish DJ was 28.", "image": "https://static.billboard.com/files/media/02-avicii-2018-billboard-1548-1024x677.jpg", "title": "Avicii's Death Mourned by Calvin Harris, Marshmello, deadmau5 & More", "site": "@billboard"}}, "movies": [], "publish_date": 1524247165.0, "source": "https://www.billboard.com", "summary": ""}