{"url": "https://www.today.com/style/oscars-2015-every-dress-meryl-streep-has-ever-worn-academy-t4681", "text": "The incomparable Meryl Streep has been attending the Oscars for more than 30 years and been nominated a whopping 20 times. If she wins one more Oscar this year, for her role in \"Florence Foster Jenkins,\" she’ll tie Katharine Hepburn for the most wins for any performer — that includes both actors and actresses!\n\nBut whether she wins or loses, Streep always graces the red carpet as a true lady. Here are all of Meryl Streep's Oscar outfits from years past.\n\n1979 - Nominated for best supporting actress for \"The Deer Hunter\"\n\nMeryl Streep and husband Don Gummer in 1979. Ron Galella / WireImage\n\nThe iconic actress wore a long black gown with flouncy sleeves and sheer, Swiss-dot style paneling across the bust. She wore her long hair down in loose curls for a very effortless, bohemian effect.\n\n1980 - Won best supporting actress for \"Kramer vs. Kramer\"\n\nMeryl Streep holds her Oscar on April 1, 1980. John T. Barr / Getty Images\n\nOne year later, Streep took home the gold in a white gown by French designer Pauline Trigere. The design featured colorful square embellishments across the bodice and a matching jacket which she wore with a popped collar for a very '80s feel.\n\n1982 - Nominated for best actress for \"The French Lieutenant's Woman\"\n\nMeryl Streep and husband Don Gummer in 1982 Getty Images\n\nIn 1982, Streep wore a purple Kristian Leigh ballgown with layers of pleated taffeta and three-quarter sleeves with puffy shoulder pads. She accessorized the look with a black pumps and a long pendant necklace.\n\n1983 - Won best actress for \"Sophie's Choice\" (pregnant with daughter Mamie Gummer)\n\nMeryl Streep holds her second Oscar in 1983. Barry King / WireImage\n\nStreep had that expectant-mom glow when she took home her second Oscar in 1983. The star sported a golden caftan with sequined embroidery throughout the entire garment for a shimmery, stunning look.\n\n1984 - Nominated for best actress for \"Silkwood\"\n\nMeryl Streep and husband Don Gummer in 1984. Ron Galella / WireImage\n\nThe next year, Streep opted for a shorter hemline in this feminine cocktail dress. The white gown was embellished with floral appliques throughout the bodice and at the cuff and she paired the look with gorgeous, dangling earrings.\n\nStuff We Love Get a daily roundup of items that will make your life easier, healthier and more stylish. This site is protected by recaptcha\n\n1986 - Nominated for best actress for \"Out of Africa\" (pregnant with daughter Grace Gummer)\n\nMeryl Streep at the Oscars in 1986. Ron Galella / WireImage\n\nStreep stepped out in an almost 1920s style for the the 1986 Oscars. Her ankle-length skirt and long white sweater looked like something out of \"The Great Gatsby,\" especially when paired with long strands of pearls!\n\n1988 - Nominated for best actress for \"Ironweed\"\n\nGetty Images\n\nTo celebrate her seventh nomination, Streep wore a sassy black and gold patterned blouse with an obi belt and flowing black bottoms.\n\n1989 - Nominated for best actress for \"A Cry in the Dark\"\n\nDon Gummer and Meryl Streep in 1989. Barry King / WireImage\n\nA decade after she first attended the awards show, the actress stepped out looking every bit the glamorous movie star she is. She wore a black Donna Karan ballgown-style skirt and off the shoulder top. She paired the look with a four-strand pearl choker.\n\n1991 - Nominated for best actress for \"Postcards from the Edge\" (Not present)\n\nThe actress didn't attend the ceremony in 1991, so all we can do is imagine the glamorous gown she would have worn to celebrate her ninth nomination!\n\n1996 - Nominated for best actress for \"The Bridges of Madison County\"\n\nMeryl Streep arrives wearing a Donna Karan gown on March 25, 1996. Jeff Vinnick / Reuters\n\nIn 1996, Streep continued her elegant streak in a navy Donna Karan dress with a long silk shawl. She kept her accessories minimal to accentuate her stunning decolletage.\n\n1999 - Nominated for best actress for \"One True Thing\"\n\nMeryl Streep at the Oscars in 1999. S. Granitz / WireImage\n\nTwenty years after she first graced the Academy Awards red carpet, the star stepped out in a high-fashion gown worthy of the queen she is! The pale lavender Valentino gown was intricately embellished into a drop-waist style with a flowing chiffon skirt.\n\n2000 - Nominated for best actress for \"Music of the Heart\"\n\nMeryl Streep with her daughter Grace March 26, 2000. Lucy Nicholson / AFP/Getty Images\n\nStreep turned the Oscars into a mother-daughter affair in 2000 by bringing along her daughter Grace. She chose a bold, printed pantsuit for the occasion and paired the look with sleek hair and statement earrings.\n\n2003 - Nominated for best supporting actress for \"Adaptation\"\n\nMeryl Streep walks on stage to present an award on March 23, 2003. Reuters\n\nThe star sported a dramatic ballgown for the 2003 ceremony. The dress featured iridescent gray sleeves and Streep paired the look with an opulent gold and emerald statement necklace.\n\n2006 - Presenter\n\nMeryl Streep arrives to the 78th Annual Academy Awards. Vince Bucci / Getty Images\n\nStreep was on-hand to present an award honoring her \"Prairie Home Companion\" director and she chose a dramatic violet gown for the evening. The empire-waist dress featured three-quarter sleeves and ombre floral detailing throughout the skirt.\n\n2007 - Nominated for best actress for \"The Devil Wears Prada\"\n\nMeryl Streep at the Oscars in 2007. Bob Riha Jr. / WireImage\n\nFour years later, Streep returned with another statement necklace. The star received her 14th nomination for her work in \"The Devil Wears Prada,\" and we can only hope her fashionista character Miranda Priestly would give this look an approving nod.\n\n2009 - Nominated for best actress for \"Doubt\"\n\nMeryl Streep arrives at the Oscars on Feb. 22, 2009. Bloomberg via Getty Images\n\nTwo years later, the actress was nominated again and chose an elegantly draped Alberta Ferretti gown for the awards ceremony. In keeping with the gown's elegant silhouette, Streep kept the accessories minimal.\n\n2010 - Nominated for best actress for \"Julie and Julia\"\n\nMeryl Streep at the Oscars on March 7, 2010. S. Granitz / WireImage\n\nStreep took a bit of a fashion risk in 2010 by calling on \"Project Runway\" alum Chris March to design her dress for the award show. The move paid off big time because the actress looked like a million bucks in this custom white, cowl-neck gown. The hem of the skirt parted in a dainty, subtle slit that showed off her strappy silver sandals.\n\n2012 - Won for best actress for \"The Iron Lady\"\n\nMeryl Streep poses with Oscars number three on February 26, 2012. S. Granitz / WireImage\n\nIt's hard to believe this powerhouse has only won three Oscars, but Streep took home her most recent statuette in a gathered Lanvin gown that matched her shiny new trophy. Gold seems to bring the star good luck! The best part about this dress? It's made completely from eco-certified fabric, which makes it a very chic win-win.\n\n2013 - Presenter\n\nMeryl Streep enters the press room during the Oscars in 2013. Steve Granitz / WireImage\n\nAfter taking home the gold one year before, Streep presented the award for best actor at the 2013 ceremony. She chose another glittering Lanvin gown for the occasion, this time in multi-tonal silver sequins! She paired the look with matching silver cuffs to up the sparkle factor just a bit more.\n\n2014 - Nominated for best actress for \"August: Osage County\"\n\nMeryl Streep at the Oscar Awards on March 2, 2014. Jeffrey Mayer / WireImage\n\nThe actress returned to Lanvin for a third year and chose an elegant black-and-white creation to wear to the awards ceremony. She paired the look with a bejeweled belt and simple accessories.\n\n2015 - Nominated for best supporting actress for \"Into the Woods\"\n\nJordan Strauss / AP\n\nIn 2015, Streep went for a sleek and sophisticated tuxedo-style suit. She paired the tailored separates with a loose fitting blouse and structured black and silver belt. She paired the look with a box clutch and pulled her hair back into an elegant up-do to show off her stunning shoulder-grazing earrings!\n\nComposite by TODAY\n\nOnly time will tell if she'll win the gold on Oscars night, Sunday, Feb. 26!\n\nThis article was originally published Feb. 22, 2015 at 5:17 p.m. ET.", "images": ["https://media3.s-nbcnews.com/j/newscms/2019_18/1432044/today-3rd-hour_9370906f7c40d78db8842bc0c3e628a7.10000;74;7;80;3.png", "https://media4.s-nbcnews.com/j/newscms/2020_03/1529838/weekend-today-menu_94be02e0ac821819fdb22a090c28163f.10000;74;7;80;3.png", "https://media4.s-nbcnews.com/j/newscms/2018_52/2696426/food_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2019_18/1432043/hodaandjenna_00d9547321553d5a5f55c2b3973c514b.10000;74;7;80;3.png", "https://media3.s-nbcnews.com/j/newscms/2017_08/1196634/meryl-streep-1999-oscars-today-170221-tease_419caca746f9837e8aa56fd7ade2b7be.social_share_1200x630_center.jpg", "https://media3.s-nbcnews.com/j/newscms/2016_08/989481/ss-160225-meryl-streep-fashion-tease_f5b6223e4cb8b9f7792e5af046311d89.focal-600x300.jpg", "https://media4.s-nbcnews.com/j/newscms/2018_52/2696446/shop_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696466/wellness_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media4.s-nbcnews.com/j/newscms/2018_52/2696481/today_4bc7d2146c228dd9a02a3c15b38527d0.10000;74;7;80;3.png", "https://media2.s-nbcnews.com/j/MSNBC/Components/Video/201702/x_tdy_merylstreepfashion_170222.focal-760x428.jpg", "https://media2.s-nbcnews.com/j/newscms/2018_52/2696456/style_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696461/videos_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media2.s-nbcnews.com/j/newscms/2018_52/2696491/williegeist_4bc7d2146c228dd9a02a3c15b38527d0.10000;74;7;80;3.png", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696431/home_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696436/parenting_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media4.s-nbcnews.com/j/MSNBC/Components/Video/201701/x_tdy_meryl_streep_noms_170108.focal-760x428.jpg", "https://media2.s-nbcnews.com/j/newscms/2018_52/2696441/popculture_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg"], "top_img": "https://media3.s-nbcnews.com/j/newscms/2017_08/1196634/meryl-streep-1999-oscars-today-170221-tease_419caca746f9837e8aa56fd7ade2b7be.social_share_1200x630_center.jpg", "keywords": [], "authors": ["Getty Images"], "canonical_link": "https://www.today.com/style/oscars-2015-every-dress-meryl-streep-has-ever-worn-academy-t4681", "title": "See every Oscar dress Meryl Streep has ever worn", "meta_data": {"msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/today/all-other-sizes-PNG.ico/ms-icon-144x144.png", "msapplication-config": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/today/all-other-sizes-PNG.ico/browserconfig.xml", "fb": {"app_id": 122384521533, "admins": 100001657893615, "pages": 157687092983}, "og": {"site_name": "TODAY.com", "locale": "en_US", "url": "https://www.today.com/style/oscars-2015-every-dress-meryl-streep-has-ever-worn-academy-t4681", "title": "See every Oscar dress Meryl Streep has ever worn", "description": "The incomparable Meryl Streep has been attending the Oscars for more than 30 years and been nominated a whopping 20 times.", "image": {"identifier": "https://media3.s-nbcnews.com/j/newscms/2017_08/1196634/meryl-streep-1999-oscars-today-170221-tease_419caca746f9837e8aa56fd7ade2b7be.social_share_1200x630_center.jpg", "secure_url": "https://media3.s-nbcnews.com/j/newscms/2017_08/1196634/meryl-streep-1999-oscars-today-170221-tease_419caca746f9837e8aa56fd7ade2b7be.social_share_1200x630_center.jpg", "type": "image/jpeg", "width": 1200, "height": 630}, "type": "article"}, "twitter": {"site": "@TodayShow", "creator": "TodayShow", "image": "https://media3.s-nbcnews.com/j/newscms/2017_08/1196634/meryl-streep-1999-oscars-today-170221-tease_419caca746f9837e8aa56fd7ade2b7be.social_share_1024x512_center.jpg", "title": "See every Oscar dress Meryl Streep has ever worn", "description": "The incomparable Meryl Streep has been attending the Oscars for more than 30 years and been nominated a whopping 20 times.", "card": "summary_large_image"}, "viewport": "width=device-width, initial-scale=1", "description": "The incomparable Meryl Streep has been attending the Oscars for more than 30 years and been nominated a whopping 20 times.", "article": {"opinion": "false", "content_tier": "free"}, "thumbnail": "https://media3.s-nbcnews.com/j/newscms/2017_08/1196634/meryl-streep-1999-oscars-today-170221-tease_419caca746f9837e8aa56fd7ade2b7be.social_share_1024x768_scale.jpg", "apple-itunes-app": "app-id=416357699"}, "movies": [], "publish_date": 1487778480.0, "source": "https://www.today.com", "summary": ""}