{"url": "knowyourmeme.com/memes/internet-death-hoaxes", "text": "About\n\nInternet Death Hoaxes refer to unfounded rumors or misreports of someone's death, usually a celebrity, or otherwise famous public figure, that spread virally online, particularly through social media platforms like Twitter and Facebook.\n\nOrigin\n\nOne the original pre-internet celebrity death hoaxes was a rumor of Beatle Paul McCartney's death in 1966. One of the first death hoaxes to spread online was the 2010 Morgan Freeman death hoax.On December 16th, 2010, Twitter user OriginalCJiZZle tweeted a message asserting that actor Morgan Freeman had died, prefaced by an RT (retweet) signature credited to CNN to make it appear as if the news organization had tweeted the original report:\n\n\"RT @CNN: Breaking News: actor Morgan Freeman has passed away in his Burbank home<< wow legendary actor #RIPmorganfreeman.\"\n\n\n\n\n\nCNN quickly issued a response explaining that it had not reported on Freeman’s death via Twitter :\n\n\"CNN did not report Morgan Freeman death. Rumor is false. CNN will aggressively investigate this hoax.\"\n\n\n\n\n\nThe same day, CNN published an article titled “Who said Morgan Freeman is dead? Not us,\" in which the news outlet reiterated their previous response and included a confirmation from the actor's publicist Stan Rosenfield that Freeman was still alive.\n\nNotable Cases\n\nSteve Jobs\n\nBetween Apple CEO Steve Jobs' announcement of his diagnosis in 2004 and his death in 2011, there had been a number of premature obituaries and breaking news updates falsely reporting on the passing of Apple's co-founder. Jobs maintained his chief executie role in the company until August 2011 when he resigned from his post.\n\nIn August 2008, Bloomberg mistakenly published an obituary article of Steve Jobs that had been put together by the staff in the case of such event. The report quickly spread through its corporate news service and the rumor intensified as blogs and other news carriers began syndicating the story.\n\nDuring the Macworld Keynote speech in January 2009, Apple-related forum MacRumors was infiltrated by a hacker who defaced the website with false news of Steve Job's death that read \"STEVE JOBS JUST DIED.\" The news media speculated that the hacker was associated with Anonymous and 4chan .\n\nIn September 2011, CBS reported via one of its Twitter accounts that Steve Jobs had passed from a heart attack. The post was removed within minutes with a formal retraction, but not before the information was re-tweeted by some of the account’s 11,000+ followers.\n\nCher\n\nOn January 26th, 2012, Twitter user Lorraine Star tweeted out a rumor that singer Cher had died, making it appear as if the tweet had originated from CNN:\n\n\"RT @CNN: American recording artist Cher dies at 65 years old. Found dead in Malibu home.\"\n\n\n\n\n\nThe rumor was further fueled when Kim Kardashian tweeted:\n\n\"Did I juist hear Cher has passed away? Is this real? OMG\"\n\n\n\n\n\nThe rumor was dispelled on January 27th, when Loree Rodkin , a friend of the singer, tweeted:\n\n\"Whoever started that stupid rumor needs to have their face dragged across concrete..#cher is FINE\"\n\n\n\n\n\nAdele\n\nOn January 28th, 2012, RIP Adele was a trending topic on Twitter. This was proven untrue by the International Business Times and Gossip Cop.\n\nPaul McCartney\n\nOn March 21st, 2012, RIP Paul McCartney began to trend on Twitter. The rumor was dispelled by a post on Gossip Cop published the next day.\n\nChris Brown\n\nOn March 23rd, 2012, rumors of singer Chris Brown's death spread on Twitter and on YouTube through comments on his music videos. The singer was the victim of several previous death rumors including one that spread on Twitter on February 15th, 2012.\n\nCeline Dion\n\nOn November 9th, 2013, a rumor about the supposed death of singer Celine Dion circulated on Facebook. Authenticity was lent to the claim by an app that can put news organization logos on unaffiliated posts. Dion spoke to Digital Spy the same day to dispel rumors, saying:\n\n\"Sometimes it's freaky because I have to call my family about it. I was celebrating the birthday of my twins in Montreal and I was getting these phone calls saying there was stuff on Facebook that I was dead. The thing that worries me is my mom. It makes me a little mad – she's 86 years old and if I'm not on the phone telling her I'm OK four seconds after it's on the news… it doesn't matter what they say, it's the impact it has on your family.\"\n\n\n\n\n\nJustin Bieber\n\nOn January 8th, 2014, a rumor that singer Justin Bieber had died in a car crash after driving over 120 miles per hour in his Ferrari circulated on Twitter. On January 12th, Global Associated News , a site known for spreading celebrity death rumors, published a post saying Bieber had died in a car crash:\n\n\"Justin Bieber died in a single vehicle crash on Route 80 between Morristown and Roswell. He was pronounced dead at the scene by paramedics responding to the vehicle accident and was identified by photo ID found on his body. Alcohol and drugs do not appear to have been a factor in this accident.\"\n\n\n\n\n\nThe claim was proved false when Bieber posted a photo of his new tattoo to his Instagram account.\n\nJim Carrey\n\nOn January 12th, 2014, an rumor that actor Jim Carrey circulated on Facebook, but was quickly disproved when Carrey appeared at the Golden Globes held that evening. A second death rumor circulated on Facebook on January 14th, suggesting the actor had died in a snowboarding accident. A representative for the actor released a statement saying:\n\n\"He joins the long list of celebrities who have been victimized by this hoax. He's still alive and well, stop believing what you see on the Internet.\"\n\n\n\n\n\nSubway Jared\n\nOn May 5th, 2014, Twitter user nice_mustard sent a tweet using the hashtag #RIPSubwayJared which implied Jared Fogle, who has been a spokesman for the sandwich chain Subway since 2000, had died. In less than 24 hours the hashtag #RIPSubwayJared had been tweeted out over 6,000 times. Nice_Mustard also tweeted out a request that their original RIP tweet be retweeted and the hashtag be spread.\n\n\n\n\n\nThe claim was proved false the same day in a post published on Gossip Cop.\n\nBetty White\n\nOn September 3rd, 2014, Empire News, a satirical news site published an article about actress Betty White dying her hair with a pun in the title, \"Actress Betty White, 92, Dyes Peacefully In Her Los Angeles Home.\" The title lead some readers to believe White had actually died. Within 24 hours the hashtag #BettyWhite was tweeted out over 100 times, with Twitter users inquiring whether White had died, or confirming it was simply a hoax. The hoax was covered that day my several sites including Business 2 Community and the Inquisitr.\n\n\n\n\n\nMacaulay Culkin\n\nOn November 7th, 2014, a fake memorial page for actor and musician Macaulay Culkin was created on Facebook, which linked to a spoofed MSNBC article claiming the 34-year-old actor had passed away earlier that day (shown below). Within 72 hours, the article gained over 153,000 Facebook likes and 22,500 retweets.\n\n\n\n\n\nThe Facebook memorial page was subsequently removed. On November 8th, Culkin’s Velvet Underground cover band Pizza Underground tweeted a photograph of the actor with the caption “We’re on tour you silly people” (shown below, left). That same day, the rumor-debunking website Snopes posted an entry for Culkin's death hoax. On November 9th, Pizza Underground tweeted another photograph of Culkin being held up by a friend while posing as if he were dead, in reference to a scene from the 1989 comedy cult film Weekend at Bernie’s (shown below, right).\n\n\n\n\n\nIn the coming days, several news sites published articles about the hoax, including Mashable, UpRoxx, The Daily Dot, CBS News and People.\n\nRelated Memes\n\nGood Night Sweet Prince\n\nGoodnight Sweet Prince is a phrase and series of image macros that originally appeared on 4Chan approximately around 2006. Many assume the phrase was taken from the Shakespearean play “Hamlet”, although it is also quite possible /b/ also got the line from the either The Big Lebowski or Robocop; both taking it from Hamlet. It’s one of /b/’s many ways to troll people\n\nRIP in Peace\n\nR.I.P in Peace is an online slang expression marked by its redundant phrasing which can be used to commemorate an individual who has either passed away or some who has been a target of an Internet death hoax.\n\nSearch Interest\n\nKnow Your Meme Store\n\nExternal References", "images": ["https://pixel.quantserve.com/pixel?a.1=p-75z9nhQwNH4Ek&a.2=p-149W7Ang9fLCQ", "https://s.kym-cdn.com/assets/blank-b3f96f160b75b1b49b426754ba188fe8.gif", "https://i.kym-cdn.com/entries/icons/facebook/000/002/179/DH_-_Thumbnail.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6685975&cv=2.0&cj=1", "https://api.b2c.com/api/noscript-40069ffybbzfqiynrkd.gif"], "top_img": "https://i.kym-cdn.com/entries/icons/facebook/000/002/179/DH_-_Thumbnail.jpg", "keywords": [], "authors": [], "canonical_link": "https://knowyourmeme.com/memes/internet-death-hoaxes", "title": "Internet Death Hoaxes", "meta_data": {"og": {"title": "Internet Death Hoaxes", "site_name": "Know Your Meme", "image": {"identifier": "https://i.kym-cdn.com/entries/icons/facebook/000/002/179/DH_-_Thumbnail.jpg", "width": 600, "height": 315}, "type": "article", "url": "https://knowyourmeme.com/memes/internet-death-hoaxes", "description": "Internet Death Hoaxes refer to unfounded rumors or misreports of someone’s death, usually a celebrity, or otherwise famous public figure, that spread virally online, particularly through social media platforms like Twitter and Facebook."}, "fb": {"app_id": 104675392961482, "pages": 88519108736}, "article": {"publisher": "https://www.facebook.com/knowyourmeme"}, "description": "Internet Death Hoaxes refer to unfounded rumors or misreports of someone’s death, usually a celebrity, or otherwise famous public figure, that spread virally online, particularly through social media platforms like Twitter and Facebook.", "referrer": "unsafe-url", "p": {"domain_verify": "3fa925d06e2f3c4af076ced1e6e951cf"}}, "movies": [], "publish_date": null, "source": "http://knowyourmeme.com", "summary": ""}