{"url": "https://www.rollingstone.com/tv/tv-news/jessica-chastain-shows-jimmy-fallon-what-its-like-to-have-a-female-role-253629/", "text": "Jessica Chastain illustrated her words with actions Thursday on The Tonight Show With Jimmy Fallon, engaging the late night host in an exercise in Hollywood inequality.\n\nThe Molly’s Game actress prefaced the demonstration with a note that “female roles have been so underwritten, especially compared to male roles.”\n\nShe and Fallon then acted out three movie scenes, reading off scripts and adopting roles of the opposite gender.\n\nThe first scene, from a romantic comedy, saw Chastain playing the man, bumping into Fallon, who was playing the woman.\n\n“Oh, excuse me. I didn’t see you there,” Chastain intoned. Fallon giggled and mumbled something about being clumsy. Here, Chastain launched into a self-involved monologue.\n\n“You’ll have to forgive me. I was lost in thought contemplating how small we are in this vast universe,” she said. “Nothing but a speck of dust. The only thing that could give me purpose is somebody to grab onto and join me as I float through this endless world of confusion.”\n\nFallon’s single line: “Yeah.”\n\nThe late night host then pointed out to Chastain, “I barely got to speak there.”\n\nThe two other faux movie scenes proved similar points, with Chastain taking the lead or carelessly dismissing Fallon’s lines with a wave of her hand and a “no thanks.”\n\nChastain has been a vocal supporter of the #MeToo and Time’s Up movements. Last May, at the Cannes Film Festival, the actress spoke out about the problematically low female representation in film during a press conference following the festival’s final ceremony.\n\n“This is the first time I’ve watched 20 films in 10 days, and I love movies, and the one thing I really took away from this experience is how the world views women from the female characters that I saw represented,” Chastain said at the time. “It was quite disturbing to me, to be honest. There are some exceptions, I will say. But for the most part I was surprised by the representation of female characters on screen in these films, and I do hope that when we include more female storytellers we will have more of the women that I recognize in my day-to-day life. Ones who are proactive, have their own agency, don’t just react to the men around them, they have their own point of view.”", "images": ["https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Ftv%2Ftv-news%2Fjessica-chastain-shows-jimmy-fallon-what-its-like-to-have-a-female-role-253629%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=253629", "https://www.rollingstone.com/wp-content/uploads/2018/06/jessica-chastain-jimmy-fallon-4e6fa306-9f2e-4e02-8ab9-fb44bb8e6516.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/jessica-chastain-jimmy-fallon-4e6fa306-9f2e-4e02-8ab9-fb44bb8e6516.jpg", "keywords": [], "authors": ["Joyce Chen", "Joyce Chen'S Most Recent Stories", "Soundgarden", "Family Honor Chris Cornell At Seattle Statue Unveiling", "Bill Coswill Face Five More Accusers In Sexual Assault Retrial", "Natalee Holloway", "Man Linked To Disappearance Fatally Stabbed", "View All"], "canonical_link": "https://www.rollingstone.com/tv/tv-news/jessica-chastain-shows-jimmy-fallon-what-its-like-to-have-a-female-role-253629/", "title": "Jessica Chastain Shows Jimmy Fallon What It’s Like to Have a Female Role", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "Jessica Chastain says women's parts have been \"so underwritten,\" champions \"better female representation\" in Hollywood", "news_keywords": "Jessica Chastain, Jimmy Fallon", "og": {"type": "article", "title": "Jessica Chastain Shows Jimmy Fallon What It's Like to Have a Female Role", "url": "https://www.rollingstone.com/tv/tv-news/jessica-chastain-shows-jimmy-fallon-what-its-like-to-have-a-female-role-253629/", "description": "Actress says women’s parts have been “so underwritten,” champions “better female representation”", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/jessica-chastain-jimmy-fallon-4e6fa306-9f2e-4e02-8ab9-fb44bb8e6516.jpg", "width": 1024, "height": 658, "alt": "Actress Jessica Chastain with host Jimmy Fallon during \" Role Swap\" on January 18, 2018"}, "locale": "en_US"}, "article": {"published_time": "2018-01-19T17:24:33+00:00", "modified_time": "2018-06-25T13:44:14+00:00"}, "twitter": {"text": {"title": "Jessica Chastain Shows Jimmy Fallon What It's Like to Have a Female Role"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/jessica-chastain-jimmy-fallon-4e6fa306-9f2e-4e02-8ab9-fb44bb8e6516.jpg?w=1024", "alt": "Actress Jessica Chastain with host Jimmy Fallon during \" Role Swap\" on January 18, 2018"}, "card": "summary_large_image", "site": "@RollingStone", "title": "Jessica Chastain Shows Jimmy Fallon What It’s Like to Have a Female Role", "description": "Jessica Chastain says women's parts have been \"so underwritten,\" champions \"better female representation\" in Hollywood"}, "generator": "WordPress 5.4", "author": "Joyce Chen", "content_type": "Article", "post_id": 253629, "title": "Jessica Chastain Shows Jimmy Fallon What It's Like to Have a Female Role", "published_at": "2018-01-19 17:24:33", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/jessica-chastain-jimmy-fallon-4e6fa306-9f2e-4e02-8ab9-fb44bb8e6516.jpg?w=1024", "comment_count": 0, "tags": "Jimmy Fallon", "topics": "TV News", "body": "Jessica Chastain illustrated her words with actions Thursday on The Tonight Show With Jimmy Fallon, engaging the late night host in an exercise in Hollywood inequality.The Molly's Game actress prefaced the demonstration with a note that \"female roles have been so underwritten, especially compared to male roles.\"She and Fallon then acted out three movie scenes, reading off scripts and adopting roles of the opposite gender.The first scene, from a romantic comedy, saw Chastain playing the man, bumping into Fallon, who was playing the woman.\"Oh, excuse me. I didn't see you there,\" Chastain intoned. Fallon giggled and mumbled something about being clumsy. Here, Chastain launched into a self-involved monologue.\"You'll have to forgive me. I was lost in thought contemplating how small we are in this vast universe,\" she said. \"Nothing but a speck of dust. The only thing that could give me purpose is somebody to grab onto and join me as I float through this endless world of confusion.\"Fallon's single line: \"Yeah.\"The late night host then pointed out to Chastain, \"I barely got to speak there.\"The two other faux movie scenes proved similar points, with Chastain taking the lead or carelessly dismissing Fallon’s lines with a wave of her hand and a \"no thanks.\"Chastain has been a vocal supporter of the #MeToo and Time's Up movements. Last May, at the Cannes Film Festival, the actress spoke out about the problematically low female representation in film during a press conference following the festival's final ceremony. \"This is the first time I've watched 20 films in 10 days, and I love movies, and the one thing I really took away from this experience is how the world views women from the female characters that I saw represented,\" Chastain said at the time. \"It was quite disturbing to me, to be honest. There are some exceptions, I will say. But for the most part I was surprised by the representation of female characters on screen in these films, and I do hope that when we include more female storytellers we will have more of the women that I recognize in my day-to-day life. Ones who are proactive, have their own agency, don't just react to the men around them, they have their own point of view.\"", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1516382673.0, "source": "https://www.rollingstone.com", "summary": ""}