{"url": "https://globalnews.ca/news/3780493/jim-carrey-lawsuit-cathriona-white-note/", "text": "Send this page to someone via email\n\nThe wrongful death lawsuit against Jim Carrey keeps getting uglier.\n\nA note written by Carrey’s ex-girlfriend Cathriona White has surfaced, alleging the actor “introduced” her to multiple things, including hard drugs and prostitutes. The opposition’s lawyer has already accused Carrey of giving White three sexually transmitted infections (STIs). The letter was allegedly written in April 2013.\n\nWhite intentionally overdosed on prescription medication, which was supposedly provided by Carrey. The wrongful death lawsuit against Carrey was filed by White’s estranged husband, Mark Burton, and White’s mother, Brigid Sweetman, who amalgamated their complaints into one single case.\n\nWATCH BELOW: The latest on the Jim Carrey lawsuit\n\nThe body of the 30-year-old makeup artist, originally from Ireland, was discovered in her Los Angeles home in September 2015. She and Carrey, 55, met in 2012, and dated on and off.\n\nStory continues below advertisement\n\nThere was some hope for a settlement out-of-court between the parties, but Burton and Sweetman’s lawyer, Michael Avenatti, has insisted multiple times in the past that he wants Carrey to take the stand at trial and has been demanding his deposition for months.\n\nOn Friday, Carrey filed a counter-complaint against Burton, Sweetman and White’s lawyer Filippo Machino (along with Machino’s office, The X Law Group). Carrey once again alleged that the lawsuit is an extortion attempt.\n\nhttps://twitter.com/JimCarrey/status/913891847570722816\n\nIn response to the counter-complaint, Avenatti released the 2013 letter.\n\nComposed on an iPad in Notes, the note is meant for Carrey and was released by Avenatti after the legal team uncovered it “during a forensic examination of Ms. White’s iPad.” It’s unclear if Carrey or anyone else read the note prior to White’s death.\n\nREAD MORE: Jim Carrey responds to ex-girlfriend’s mother’s lawsuit: it’s a ‘shakedown’\n\nAvenatti said in a statement that the note is “written in Cat’s own words, [and] shows the world how Jim Carrey treated her while she was alive and the depths of his destructive behavior.”\n\nAs he’s stated in the past, Avenatti then said he’s looking forward to trying the case in front of a jury.\n\n(Via Michael Avenatti)\n\nIn response to the letter, Carrey’s lawyer Ray Boucher said, “This note helps establish the evidence that this was pure fraud, and that [White], her lawyers and others were trying to establish a basis for Jim into ultimately settling with her based on these false claims… this was part of her and her lawyers’ [sic] campaign to extort money from Jim and ultimately he succumbed.”\n\nStory continues below advertisement\n\nIn yet another response, Avenatti responded to Boucher, saying “Jim Carrey is so desperate to avoid the public knowing the truth about his own outrageous conduct that he has now resorted to outlandish accusations against innocent people. As his interview from a few weeks ago shows, the guy is incoherent and unhinged. He needs help.”\n\nREAD MORE: Jim Carrey responds to ‘evil’ lawsuit: I will not be exploited\n\nIn August, Carrey was permitted by the court to use White’s health records at trial.\n\nBoucher had previously attempted to get the judge to throw the lawsuit out of court, calling it “malicious” and “predatory.” Carrey himself has called the lawsuit a “shakedown,” and denies any wrongdoing on all accounts.\n\nBoucher contends that White had breast augmentation surgery prior to her death, and had been prescribed painkillers and other pills that ultimately led to her overdose.\n\n“One of the issues is her prescription medication,” said Boucher in court. “We know she had breast surgery that month, we know she had oxycodone prescribed to her.”\n\nREAD MORE: Jim Carrey to give deposition in ex-girlfriend’s wrongful death lawsuit\n\nHer family’s legal team attempted to argue against the medical records’ admission on privacy grounds, but Judge Deirdre Hill ruled that the records could be disclosed.\n\nStory continues below advertisement\n\nThe medical records should also determine whether or not White had any STIs prior to dating Carrey.\n\nThe actor will face the jury trial in April 2018.\n\nIf you or someone you know is having suicidal thoughts, is in crisis or needs someone to talk to, you can find 24-hour help through the Canadian Association for Suicide Prevention. Tweet This", "images": ["https://s2.wp.com/wp-content/themes/vip/shaw-globalnews/assets/dist/images/shield.png", "https://s2.wp.com/wp-content/themes/vip/shaw-globalnews/assets/dist/images/alert-red.png", "https://s2.wp.com/wp-content/themes/vip/shaw-globalnews/assets/dist/images/shield-blue.png", "https://shawglobalnews.files.wordpress.com/2016/07/jim-carrey-cathriona-white.jpg?quality=70&strip=all&w=667&h=379&crop=1", "https://shawglobalnews.files.wordpress.com/2016/07/jim-carrey-cathriona-white.jpg?quality=70&strip=all&w=667", "https://s2.wp.com/wp-content/themes/vip/shaw-globalnews/assets/dist/images/logo-corus.svg", "https://sb.scorecardresearch.com/p?c1=2&c2=3005670&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://shawglobalnews.files.wordpress.com/2015/11/chris-jancelewicz-220.jpg?quality=70&strip=all&w=136&h=136&crop=1", "https://s2.wp.com/wp-content/themes/vip/shaw-globalnews/assets/dist/images/alert.png", "https://s2.wp.com/wp-content/themes/vip/shaw-globalnews/assets/dist/images/morty.svg", "https://s2.wp.com/wp-content/themes/vip/shaw-globalnews/assets/dist/images/logo-black.svg", "https://shawglobalnews.files.wordpress.com/2017/10/jim-carrey-cathriona-white-letter.jpg?quality=70&strip=all&w=720&h=671&crop=1", "https://pixel.wp.com/b.gif?v=noscript", "https://s2.wp.com/wp-content/themes/vip/shaw-globalnews/assets/dist/images/logo-mobile.svg"], "top_img": "https://shawglobalnews.files.wordpress.com/2016/07/jim-carrey-cathriona-white.jpg?quality=70&strip=all&w=667&h=379&crop=1", "keywords": [], "authors": ["Chris Jancelewicz", "Global News", "Posted October", "Updated October"], "canonical_link": "http://globalnews.ca/news/3780493/jim-carrey-lawsuit-cathriona-white-note/", "title": "Jim Carrey lawsuit: Unearthed note from ex-girlfriend makes shocking claims", "meta_data": {"theme-color": "#133F6F", "viewport": "width=device-width, initial-scale=1.0", "title": "Jim Carrey lawsuit: Unearthed note from ex-girlfriend makes shocking claims  | Globalnews.ca", "description": "Cathriona White allegedly wrote the letter in 2013, saying Jim Carrey introduced her to 'cocaine, mental abuse and disease,' among other things.", "keywords": "Jim Carrey, cathriona white, Cathriona White Jim Carrey, jim carrey cathriona white, jim carrey court, jim carrey ex, jim carrey ex-girlfriend, jim carrey lawsuit, jim carrey sued, Jim Carrey Wrongful Death, Crime, Entertainment", "news_keywords": "Jim Carrey, cathriona white, Cathriona White Jim Carrey, jim carrey cathriona white, jim carrey court, jim carrey ex, jim carrey ex-girlfriend, jim carrey lawsuit, jim carrey sued, Jim Carrey Wrongful Death, Crime, Entertainment", "article": {"tag": "Entertainment"}, "og": {"title": "Jim Carrey lawsuit: Unearthed note from ex-girlfriend makes shocking claims", "description": "Cathriona White allegedly wrote the letter in 2013, saying Jim Carrey introduced her to 'cocaine, mental abuse and disease,' among other things.", "type": "article", "url": "https://globalnews.ca/news/3780493/jim-carrey-lawsuit-cathriona-white-note/", "site_name": "Global News", "image": "https://shawglobalnews.files.wordpress.com/2016/07/jim-carrey-cathriona-white.jpg?quality=70&strip=all&w=667&h=379&crop=1"}, "twitter": {"title": "Jim Carrey lawsuit: Unearthed note from ex-girlfriend makes shocking claims", "url": "https://globalnews.ca/news/3780493/jim-carrey-lawsuit-cathriona-white-note/", "description": "Cathriona White allegedly wrote the letter in 2013, saying Jim Carrey introduced her to 'cocaine, mental abuse and disease,' among other things.", "card": "summary_large_image", "site": "@globalnews", "image": "https://shawglobalnews.files.wordpress.com/2016/07/jim-carrey-cathriona-white.jpg?quality=70&strip=all&w=667&h=379&crop=1"}, "fb": {"app_id": 318812448281278, "pages": 91251252807}, "application-name": "Global News", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://globalnews.ca/feed/;icon-uri=https://secure.gravatar.com/blavatar/134ef81f5668dc78080f6bd19ca2310b?s=16"}, "movies": [], "publish_date": null, "source": "https://globalnews.ca", "summary": ""}