{"url": "http://the-royals.wikia.com/wiki/Robert_Henstridge", "text": "“ Speaking of power, let me ask you a question. Prime Minister, does this sound ceremonial to you? [CROWD CHANTING] “Long live the King! Long live the King!” — Robert proves the power of the Monarchy to the Parliament ”\n\n\n\n\n\nKing Robert Simon Henstridge is the current king of the United Kingdom and the other Commonwealth realms who replaced his uncle Cyrus as king after a Privy Council vote.\n\nUntil Season 3, Robert was thought to have died in a plane crash, but instead was found to be alive on a deserted island.\n\nHe is Willow's husband, whom he married at the end of Season 4.\n\nContents show]\n\nCharacter Edit\n\nKing Robert is the firstborn son of the late King Simon Henstridge and Queen Helena Henstridge. He is also the older brother of fraternal twins Prince Liam Henstridge and Princess Eleanor Henstridge. He was the favorite nephew of Prince Cyrus and he is his mother's favorite child as well. It is well known that he is especially close with his younger sister Eleanor and she felt a tremendous amount of guilt for not calling him the day of his accident.\n\nWe found out his supposed 'death' wasn't an accident, as he was targeted. He was 'killed' by Brandon Boone. Boone was ordered by Ted Pryce to have him shot, but he failed, and Robert remained alive, as revealed at the end of Season 2.\n\nAccording to most of the accounts of Robert's character during the first two seasons, it is known that he was well-groomed by his parents to take over as king someday. He understood his duty much better than his younger siblings, who tend to prefer partying to ruling. His best friend, Twysden 'Beck' Beckwith, was the man who took Eleanor's virginity and was her first love.\n\nHe is surviving on the island with only his crashed plane and an old antique knife that was once his father's. In Season 3, Episode 1, he scrapes \"HRH\" off of his flight helmet, indicating that he may be happier in his new life not being the Crown Prince.\n\nHe had a girlfriend, Kathryn Davis, whom we find out is the girl Liam has developed feelings for at the beginning of Season 3. Robert has a hallucination of Kathryn asking what he wants at the end of Season 3 Episode 2. This is what eventually leads to him to shoot his flare and thus get rescued.\n\nHe destroyed Eleanor’s letter to Jasper, believing Jasper isn’t good enough for her. He is very cruel to Liam, when he got home he saw Liam and Kathryn share a kiss. He didn’t mention it however and he kept Kathryn as a girlfriend before breaking up with her in the final episode of Season 3. He calls her a whore and reveals that he knew about the relationship between her and Liam.\n\nHe takes a romantic interest in Willow, who is Liam's close friend, at the end of Season 3.\n\nIt is revealed in a flashback in 3x10, that Simon planned to disband the monarchy because he did not believe Robert would make a good king. Robert keeps this fact to himself.\n\nPersonality Edit\n\nHe is very smart, manipulative and disciplined, taking after his mother. He and Liam are very competitive. Robert often calls Liam “Sparrow,\" a reminder that he is the younger brother and spare son.\n\nRobert is ruthless, cunning, charming and polite. He conducts himself gracefully and respectfully in public, which he seems to have inherited from his father. However, he has shown that he can be exceptionally deceitful and arrogant just like his uncle Cyrus.\n\n\n\n\n\nSeason 1 Edit\n\nSeason 1 opens up with King Simon being told that Robert's plane has been shot down and his eldest son is now dead. The family is in disarray as the line of succession has changed and Liam (who is next in line to the British throne) is unprepared to rule. Each member of the family deals with Robert's 'death' differently and Simon announces plans to disband the monarchy (presumably because Liam and Eleanor would not make good heirs to the throne).\n\nThroughout the season, Robert is praised for being the most responsible and most respectful of the three children. He was also known to support many local charities. Liam and Eleanor take over many of his charitable duties when he is presumed dead.\n\nIn 1x09, Simon remains in critical condition after he is stabbed by an unknown assailant late one night. This event prompts Eleanor to look closer into Robert's accident and at one point she even accuses her mother of killing him. Eleanor and Marcus investigate a mystery man (Brandon Boone) who appears on the palace surveillance tapes. Boone confronts Eleanor at the hospital and tells her that he 'killed' Robert. He also told her that she is not safe.\n\nJasper and Eleanor go to meet Boone in 1x10. He explains he was paid to take to crash Robert's plane using a drone to control it. Boone's Major apparently got calls from the palace to do this and is now missing. Boone expresses regret and says that the fake suicide note that was found was indeed forged. He assures them that he had nothing to do with the attack on Simon.\n\nSeason 2 Edit\n\nJasper is the first one to discover the truth about Robert's accident and Simon's murder in 2x09 by obtaining video footage of the latter event.\n\nIt is revealed that Ted Pryce and Jeffrey Stuart planned to kill both Simon and Robert in retaliation for the wrongs that the Royal Family have committed against them. Pryce blames the monarchy for the death of his wife Daphne. Stuart blames Helena and the Grand Duchess for the death of his sister, Dominique (who was a rival for Simon's affections many years prior).\n\nSeason 3 Edit\n\nIn Season 3 Episode 1, Robert is surviving on the island with only his crashed plane, a flare and an old antique knife that was once his father's. He is seen scraping \"HRH\" off of his flight helmet, indicating that he may be happier in his new life not being the Crown Prince.\n\nA boat passes Robert many times, but he refuses to signal for help in 3x02. It appears that he is not ready to return to his previous life and face the public scrutiny. He has hallucinations of Eleanor confronting him about not coming home sooner and Kathryn Davis (whom we later find out is his secret girlfriend) asks him what he wants. He then signals the boat and is rescued.\n\nIn 3x03, Eleanor and the Queen are walking late one night in the palace when across the hall they spot Robert who has returned. Shocked to see her brother, Eleanor faints. The Queen shortly faints as well.\n\nAt the start of Our (Late) Dear Brother's Death, we see the family, Robert comforting them and telling them about how he got home. He jokes to Eleanor as she wakes up, \"you always did make everything about you.\" Queen Helena is trying to make sense of the situation and orders tea. Robert asks his mother join him and his sister on the couch. The three embrace, overjoyed by the moment. Cyrus walks in on the family reunion, still drunk and defeated from the news that Helena has DNA proof that her children are the rightful heirs to the throne. He scoffs, not quite comprehending it's the real Robert. When Robert let's him know it's truly him, Cyrus coldly and bluntly lets his nephew know that his father passed away before leaving the room.\n\nRobert then receives the files on his and his father's deaths along with a hard drive with the graphic video of his father's murder. Robert sits down and begins catching up on everything he's missed. The news of his father's death overwhelms him. Next, he is in front of a bathroom mirror and begins to shave his beard with a golden razor and proper shaving cream. He recalls the challenge and struggle of shaving on the island with just his father's knife.\n\nWhen Liam returns to the palace, he rushes to meet his brother, who is now clean shaven and in a suit. The two brother's embrace once reunited. They are sitting in the throne room talking about their father. Robert remembers his father's last words to him but doesn't want to share them with Liam. Liam receives a text from Kathryn with whom he had spent the night. He tells her he needs to explain the situation to her in person.\n\nHelena and her three children discuss how to handle Robert's return. She wants to control the story and advises Eleanor and Liam to go about business as usual. The family decides to announce Robert's return during the press conference scheduled to reveal Liam and Eleanor as Simon's true heirs. Helena then asks Robert how many people know about his rescues. He explains MI6, a few admins, and four military extractors know he returned but that they can be trusted. Throughout the family meeting, Liam continues to receive texts from Kathryn. Robert is surprised and shocked to learn his mother schemed to have his siblings removed from the line of succession, and Helena admits it wasn't one of her finest moments. She then asks Robert if he wants a speech writer to help him prepare what he'll say but then smiles, remembering her son always had a natural way with words. Eleanor breaks out smiling stating she can't believe they are all together. The family then calls Liam out for texting throughout the entire meeting.\n\nRobert walks through the hall and overhears Eleanor's preliminary interview with Vanity Fair. He is impressed to see his little sister has grown up while he was away and come into her own when it comes to helping promote the royal image. Jasper then bursts into Eleanor's room, and she tries awkwardly to cover up their relationship by passing him off as a lost guard looking for Liam.\n\nRobert is in his old room getting ready to look at the flash drive given to him by the head of security when Helena comes to visit him. She tells him his things are in storage and can be brought up but he refuses, saying he just needs a bed and one thing he needs to pull out of storage: \"Mum, please relax. You thought I was dead. There's no need to apologize... It's what I want –– something simple really. I just need one of those things from those boxes. Other than that, I'll I need is that bed. I've done more thinking on that island than I'd care to admit.\" He then learns Lucius has also left the household while he was away. He asks his mother if she at least had Alistair's company and she lets him know they no longer speak. Robert tells his mother she must have been lonely all this time, and she tells him no one feels sorry for the royal family. Once she leaves, he looks at the video on the flash drive and begins to cry as he sees his father murdered. He then searches online for reactions to the news and the public riots that followed. He sees a video clip of Liam speaking kindly about Robert at his funeral. Robert then sees the #kingliam movement and how popular his brother has become.\n\nA reporter visits the queen and tells her he knows Robert has returned, and he is going to publish the story with or without a comment from her. Robert walks in and convinces Mr. Krenshaw to wait for the press conference in exchange for a quote from him. Helena beams as she watches her firstborn son expertly maneuver the media.\n\nRobert goes out on the grounds with Liam and retrieves an old bottle of whiskey their father kept hidden in a tree. They drink together and pour a drink on the ground for their father. Robert admits to his brother he's having a hard time processing the news that their father is gone before asking Liam about the girl he's been texting all day. Liam avoids his questions. Robert then asks Liam to join him for a walk later that night.\n\nRobert walks in on Eleanor talking to Jasper about how they'll explain their relationship to him. Robert learns Jasper is American, and Eleanor begins praising Jasper as the one who discovered the truth behind their father's death. She then awkwardly lets out that Jasper is also her boyfriend. Robert shakes Jasper's hand and then tells him he has high standards for whomever dates his sister but is impressed already with Jasper since he is the one that found out the truth about the murders.\n\nLater that evening, Robert and Liam are on their walk through the town and a little tipsy. Robert ask Liam what he thinks of Jasper and then comments on how surprised he is that Liam and Eleanor no longer argue and fight like they used to. Liam explains that it was expected since he and his sister were kids and shared the same birthday. He says Robert's death brought them closer together. He then laments that his brother always took Eleanor's side. Robert explains that Eleanor was his sister and needed someone to look out for her, and Liam sadly notes that he is also Robert's sibling. Before Liam realizes where they are going, Robert is on Kathryn's street. Kathryn is shocked to see Robert and Robert assures her he is alive and expects nothing from her. He only wanted her to hear from him that he is back and that he missed her. Liam hangs back and watches the reunion.\n\nThe next morning, Robert is dressed in his military uniform and visits his father's grave with Eleanor. She apologizes for never calling him back the night before he disappeared. She explains the guilt has been eating away at her, and he reassures her she had no need to feel guilty because he doesn't even remember the missed call. He lets her know she seems to be a good place now and then recalls their father had a lot of expectations for all of them. He says he is proud of her. Eleanor asks him if he likes Jasper, and Robert can only smile and let her know that he likes that she is happy.\n\nAt the press conference, Queen Helena announces Liam and Eleanor are Simon's children. As the media asks when Liam will ascend the throne, Helena states someone else will finish answering their questions. Robert walks out before the press. He explains to them how his plane was remotely hijacked and how he survived on the island. He assures the media he is emotionally and mentally ready to lead the country and is happy to get back to his own bed.\n\nHowever, later that night as the palace rests, Robert does not seem fine. He retrieves an item from his belongings in storage and then returns to his room. Rather than sleep in his own bed, he lies down on the floor with a small hour glass by his side. The trauma from the island is still with him.\n\nFlashbacks of Liam and Robert first meeting Kathryn at her father’s pub parallel reveal Liam’s guilt for dating his brother’s girlfriend. Although Liam flirted with Kathryn, Robert called bagsy (the British equivalent of dibs) and that was that. Robert and Kathryn fell in love behind the prying eyes of the public.\n\nSeason 3 Episode 5, has Robert presently enjoying his homecoming celebrations and spending time with Kathryn who has yet to have a talk with Liam about what to do now that Robert has returned. Robert takes Kathryn out on a picnic and explains that he has no expectations of her, but wants her to know that he misses her and wishes to pick up where they left off.\n\nHelena urges Cyrus to hand the crown over to Robert, but Cyrus reminds her that Robert is still legally dead and may be mentally unstable because of his time on the island. Robert takes the opportunity to manipulate Cyrus into leaving it to the Privy Council to decide their fates, while convincing him that it was his idea. The two reminisce about Cyrus giving Robert his first drink and Robert praises him for his battle against cancer and for being a good person to confide in when Simon was being too tough on him.\n\nRobert informs Liam that he will be taking over his charity work during a rigged game of darts. While on the balcony, Robert steals the first wave from Cyrus and gives Liam an awkward hug. Liam still seems bitter about their earlier encounters.\n\nIt's Christmas in 3x06 and the palace is chaotic when Liam lets the staff go home early. Robert agrees with Helena, that Liam should not have done that without properly planning it out first.\n\nRobert runs into Jasper at the family gym and reminds him to know his place. Robert also lets him know that he is looking into his past.\n\nRobert then confronts Cyrus about sending expensive, engraved wine bottles to the members of the Privy Council, in an attempt to bribe them to vote in his favor. Robert reminds Cyrus that, \"I played chess with my father. You’d be wise to remember that.”\n\nRobert escorts a drunk Cyrus to bed, while Liam (who's looking for a fight) confronts him about how much he knows about Jasper's past. When Liam comes to Jasper's defense, Robert continuously refers to him by his code name 'Sparrow,' which aggravates him even further. At dinner, Robert gives a concise toast and Liam criticizes Robert's self-righteousness in his follow-up toast. The two argue about who should give the annual Christmas address. In the end, Eleanor gives it and wears the late Simon's watch during the broadcast. Liam visits Robert's room at the end of the night, where Robert is playing with a small hourglass. Liam gives him the boxing gloves Simon left to him. Liam says that Simon would have wanted Robert to have them, if he knew that Robert was still alive. Liam then challenges him to a boxing match for charity and says he will win the gloves back.\n\nAt the People's Charity Gala in 3x07, Beck chats with Robert and they prepare for the upcoming match. Helena reprimands Robert for not talking to the young ladies she invited, and tell him that she wishes to compile a list of suitable brides for him. Robert responds that lists are only for men who don't know what they want. When she reminds him that she was on Simon's list, he harshly says, \"and look how that turned out.\" Helena is hurt and he retracts by saying, \"sorry, that was unfair.\" They agree that if Helena participates in the auction (and makes a sacrifice for the family), then he will give her list a fair consideration.\n\nWillow is tasked with complying the list and approaches Robert with a series of questions to help her with the process. Initially, Robert appears bored with the encounter, but slowly warms to Willow's wit and charm. He smiles as he watches her walk away.\n\nRobert unveils(the charity that he took over from Liam) and gives Eleanor credit for hosting the gala, but no credit to Liam or Willow for founding the charity.Kathryn and her older sister, Angie, attend the Gala. Angie buys Kathryn an auction ticket. After some deliberation, she puts her ticket into Robert's box and wins. After it is announced that Kathryn won, Robert makes a very public display of affection by meeting Kathryn in the crowd, kissing her hand, complimenting her, and taking a photo with her. Robert planned it so that she would win the wine cellar tour with him. That way, the press sees the two of them together, they could publish a 'Cinderella story.'\n\nOnce they are alone, Kathryn learns from Robert that he had tasted a 1962 Bordeaux even though he had told her otherwise when they first met. He only used that to get to know her better.\n\nBefore the boxing match, Cyrus places his bet on Liam, promising to double his donation to Gratitude Forever if Liam wins. Robert seems to have this win in the bag as Liam lays on the floor of the ring, but then Liam remembers his dad’s note in the Christmas present; he remembers that his dad told him to always keep going. So Liam gets back up and takes Robert out.\n\nLater, Robert says, “We gave them a good show.” Since the fight was for charity, Robert had set it all up. Liam didn’t actually beat Robert. Liam decides to try to take his brother on right then and there, but Robert keeps knocking Liam down. Robert says he will continue to do so because he loves him. Kathryn and Robert leave Liam bloodied and bruised.\n\nIn Season 3 Episode 8, Liam apologizes to Robert and the two make up with a hug. Robert promises to talk to Liam later. Robert goes out with Kathryn and talks about leaving the monarchy and growing old with her. He is approached again by Liam later in the day, who tells him that he is ready and willing to be king if only Robert would step aside. Robert apologizes for not realizing the extent of Liam's personal growth in his absence and offers to put Liam's name forward to the Privy Council instead, but only if Helena agrees.\n\nWhen they approach Helena, she is vehemently opposed to the idea and adamantly tells Liam that this is, \"Robert's time... this has always been Robert's destiny.\" She thereby destroys Liam's hopes of becoming king, and he leaves defeated. It turns out that this was all planned by Robert; he knew exactly what his mother was going to say. He would have never really supported Liam becoming king. Helena is disgusted by Robert's antics and for making her the 'bad guy'. Robert stresses that this was the only way that Liam would stop pursuing the crown and he needed to hear those things from Helena. Helena reluctantly agrees.\n\nIn O, Farewell, Honest Soldier, the family prepares for the Privy Council meeting. The night before, Robert stares at Big Ben from a park bench. Big Ben is important to Robert, because if the Privy Council decides in his favor, Big Ben will ring. If there is silence, then Cyrus remains the King of England. Kathryn meets him there the morning of the decision to ask him whether he’s ready. He assures her that he has been ready his whole life.\n\nHe asks Liam to tarnish Cyrus' character in order to secure the crown. Liam does not think it is the best plan and suggests that Robert give a invigorating, inspiring speech about how great England is instead. Robert calls his little brother’s perspective naive. Eleanor wishes her brother luck before the meeting of the Council by giving him Simon’s watch. Helena obviously sees this as an opportunity to use the watch to Robert’s advantage since it was widely seen in Eleanor's Christmas address. He could reach for it when he speaks and that will mean something to the Privy Council.\n\nJasper turns himself in for stealing classified information about Robert's plane crash and is about to be arrested. At the last minute, Robert comes to the rescue and lies that Jasper was secretly working for him. Jasper avoids jail time and after he is fired by James Hill, he accepts Robert's offer to be his personal security detail (on the condition that he stay away from Eleanor).\n\nStanding before the Privy Council, Helena and Eleanor give speeches supporting Robert and denouncing Cyrus. Liam's speech is fairly neutral and does not tarnish Cyrus' reputation. Robert speaks last and gives an impassioned and moving speech about the what is in the best interest for the country moving forward. Back at the palace, Robert harshly criticizes Liam's speech, saying it may cost him the crown, but Liam insists he was protecting the family's reputation. Robert says that if they lose, there will be no more fighting and he will not appeal the decision (like Helena would like to do).At midnight, Big Ben chimes and Robert is now set to become the next king. After quick congratulations all around, he sneaks off to Kathryn's place and the two have sex. When she wakes up, all she sees is a King Robert mask next to her.\n\nIn the Season 3 finale, the Royal Family prepares for Robert's coronation. Robert has Simon's portrait taken down and tells Eleanor that it should be in a museum inspiring other people. She tells him that she wants the portrait to remain in the palace, as it inspires her and is a way to keep their father close.\n\nEleanor also finds out that Robert invited Prince Sebastian Idrisi to the People's Gala. She accuses Robert of setting her up without telling her. Robert deflects by saying Sebastian is \"kind and drama free\" and he thought she would appreciate spending time with someone like that. He also states that had she known about the setup, she never would have given Idrisi a chance.\n\nRobert is already making plans for his new room, taking measurements while Cyrus is still living in it. Cyrus is obviously appalled by this and thinks he is being put on the curb already. Robert says there is a way for Cyrus to stay in the palace by telling him, “Find a purpose, dear uncle. Otherwise, you’re gone.”\n\nLiam actually flies to the island where Robert was stranded for seven months and brings back Robert’s flight helmet to confront his brother. Liam reveals that he knows that the boat that saved Robert came by several times before Robert signaled for help. A furious Robert goes on about how Liam was living a life of luxury while he was alone and stranded.\n\nRobert wants Liam to admit his hatred for him. But Liam doesn’t budge. He wishes Robert had come back sooner and didn’t have to go through their father’s death alone. “I hate that you didn’t come back,” Liam says, “Because while you were hiding on that island, like that damn coward that you are, I was here watching dad die.”\n\nRobert responds,“Don’t you mean letting him die?” Robert spits back. “Or more specifically, letting him get stabbed while you fondled the help.” Liam lunges for Robert and pushes him to the ground. Jasper steps in to break up the fight. Robert lets Liam know that Jasper works for him now.Robert disproves of Helena's relationship with Spencer Hoenigsberg when he sees them embracing. Shortly before the coronation, he tells her that Hoenigsberg has been dismissed. When Helena protests, he states that he has the right because he is the King of the United Kingdom and the other Commonwealth realms. Liam confronts Robert before the family goes out onto the balcony and informs them that he will not be by Robert's side. Robert gives him a Judas kiss and lets him go.\n\nA series of flashbacks reveal secrets about Robert's past. Robert found the letter that Eleanor had left for Jasper in 3x06. He burns it and calls Jasper's father, thereby telling him to sell the story of his son's relationship with the princess to the press. These series of events leads Jasper to break up with Eleanor in 3x07, and indirectly gets him fired by James Hill.\n\nRobert sleeps with Kathryn after the Privy Council meeting and confesses that she was the reason he came back. He then breaks up with her. When questioned further, Robert reveals that the day he came back, he saw Liam kiss Kathryn outside her flat. Robert is angry that she never told him the truth about their relationship. Kathryn asks why he continued to see her if he knew the truth and he responds, \"Well let's face it, you're quite the whore in bed. I think it's the common blood in you, but you should probably ask Liam.\" He also gives her a Judas kiss and walks away.\n\nEarlier that day, he asks to speak with Willow and tells her that he updated her list of potential brides in order of preference. He says, \"I hope the sorting hat is not too disappointed.\" They both agree that attempting to court his first choice would be the most efficient option. He asks her to keep the new list between them and that he will speak to Queen Helena after the coronation. Willow agrees. She opens the list when she is alone, and discovers that Robert has crossed out Kathryn's name and puts hers at the top.\n\nA flashback to Robert's childhood shows him playing chess with his father. He is arrogant even in his youth and spends hours learning to beat his father after Simon walks away. This is why the hourglass shown at the beginning of the season is special to Robert. Fast forward a year ago and Simon praises Robert for learning all of the lessons he had taught him. Unfortunately, Simon believes that (unlike Liam) Robert will never be a good king as he lacks the virtues that cannot be learned, but ones that you are only born with. He reveals his plan to disband the monarchy as a result.\n\nRobert never reveals this to anyone. Robert and the family (minus Cyrus and Liam) make their way onto the balcony. Robert and Willow share a knowing look. Robert is crowned King of the United Kingdom and the other Commonwealth realms.\n\n\n\n\n\nQuotes Edit\n\n“ Your hubris, Robert. It will be your downfall one day — Simon [src] ”\n\n\n\n\n\n“ You finally have something that I don’t. — Robert to Liam about his father's boxing gloves [src] ”\n\n\n\n\n\n“ At least I'm not a Hufflepuff. — Robert to Willow [[src]] ”\n\n\n\n\n\n“ You're the reason that I came back. It's gonna be difficult never seeing you again — Robert leaves Kathryn [src] ”\n\n\n\n\n\n“ I have to be at my worst, Liam. Because no one gives you anything! — Robert [src] ”\n\n\n\n\n\n“ Okay everyone, we're gonna be extremely British right now and pretend none of that just happened — Robert before his balcony return [src] ”\n\n\n\n\n\n“ The thing about my brother, he wasn't afraid to be his own man. — Prince Liam about his brother [src] ”\n\n\n\n\n\nRelationships Edit\n\nWillow\n\nMain article: Robert and Willow\n\nTrivia Edit", "images": ["https://vignette.wikia.nocookie.net/the-royals/images/0/0b/Rs_1024x640-170217144654-ROYALS-6.jpg/revision/latest/scale-to-width-down/220?cb=20180118104637", "https://vignette.wikia.nocookie.net/the-royals/images/6/6c/Rs_600x600-161214151730-Prince-Robert-Max-Brown-The-Royals.jpg/revision/latest/scale-to-width-down/220?cb=20180117101514", "https://vignette.wikia.nocookie.net/the-royals/images/3/35/The-Royals-S03E07-f3ebc64bd896dbcda2bb803ba000f783-full.jpg/revision/latest/scale-to-width-down/248?cb=20180118082621", "https://slot1-images.wikia.nocookie.net/__cb1586975593232/common/extensions/wikia/WikiaBar/images/wikiabarIcon.png", "https://vignette.wikia.nocookie.net/the-royals/images/0/04/Rs_1024x640-170217144655-ROYALS-5.jpg/revision/latest/scale-to-width-down/220?cb=20180118101349", "https://vignette.wikia.nocookie.net/rockosmodernlife/images/a/ad/Static_Cling_Netflix_banner.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20191126160900", "https://vignette.wikia.nocookie.net/the-royals/images/9/91/C5OU_cTUEAADhjn.jpg/revision/latest/scale-to-width-down/220?cb=20180118101537", "https://vignette.wikia.nocookie.net/the-royals/images/a/a9/Rs_600x600-170104124818-600-THE-ROYALS-305-LIAM-ROBERT.jpg/revision/latest/scale-to-width-down/220?cb=20180118092042", "https://vignette.wikia.nocookie.net/bourne/images/6/68/Treadstone_Banner_%281%29.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20191125210358", "https://vignette.wikia.nocookie.net/the-royals/images/0/08/8c893b9d0976bf17bc6baea999ad5665.jpg/revision/latest/scale-to-width-down/220?cb=20180118093400", "https://vignette.wikia.nocookie.net/the-royals/images/0/08/Tumblr_olr5emXAqw1qd966jo6_250.gif/revision/latest?cb=20180118085817", "https://vignette.wikia.nocookie.net/the-royals/images/d/d2/Tumblr_ojjnvysiFP1u46ngko1_1280.jpg/revision/latest/scale-to-width-down/238?cb=20180117085858", "https://vignette.wikia.nocookie.net/the-royals/images/9/92/Landscape-1467723589-max-brown-the-royals-filming.jpg/revision/latest/scale-to-width-down/220?cb=20180119085855", "https://vignette.wikia.nocookie.net/the-royals/images/5/56/RoyalFamily.jpg/revision/latest/scale-to-width-down/200?cb=20180516082820", "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D", "https://vignette.wikia.nocookie.net/the-royals/images/e/e7/Helena_corns_Robert.png/revision/latest/scale-to-width-down/220?cb=20180118102611", "https://vignette.wikia.nocookie.net/the-royals/images/7/71/8d68809e76e81a2c16d4796267bbb421.jpg/revision/latest/scale-to-width-down/220?cb=20180118090925", "https://vignette.wikia.nocookie.net/the-royals/images/8/89/Wiki-wordmark.png/revision/latest?cb=20180530044343", "https://vignette.wikia.nocookie.net/the-royals/images/9/90/Robert_speaks_at_the_Privy_Council_meeting.png/revision/latest/scale-to-width-down/238?cb=20180118092805", "https://vignette.wikia.nocookie.net/the-royals/images/f/fb/ROBERT-3.jpg/revision/latest/scale-to-width-down/242?cb=20180118082947", "https://vignette.wikia.nocookie.net/the-royals/images/a/a7/Robert.jpg/revision/latest?cb=20180516032835", "https://vignette.wikia.nocookie.net/the-royals/images/a/a7/Robert.jpg/revision/latest/scale-to-width-down/340?cb=20180516032835", "https://vignette.wikia.nocookie.net/the-royals/images/0/02/Rs_500x281-170105115858-THE-ROYALS-305-ROBERT-CYRUS.jpg/revision/latest/scale-to-width-down/279?cb=20180118103318", "https://vignette.wikia.nocookie.net/101dalmatianstreet/images/0/0e/Community-header-background/revision/latest/zoom-crop/width/100/height/56?cb=20200106151802"], "top_img": "https://vignette.wikia.nocookie.net/the-royals/images/a/a7/Robert.jpg/revision/latest?cb=20180516032835", "keywords": [], "authors": [], "canonical_link": "https://the-royals.fandom.com/wiki/Robert_Henstridge", "title": "Robert Henstridge", "meta_data": {"viewport": "width=device-width, user-scalable=yes", "generator": "MediaWiki 1.19.24", "keywords": "The Royals Wiki,theroyals634,Robert Henstridge,Kathryn Davis,Wilhelmina Henstridge,Helena Henstridge,Simon Henstridge,Liam Henstridge,Eleanor Henstridge,Cyrus Henstridge,Penelope Henstridge,Felicity Moreno,Grand Duchess Alexandra", "description": "King Robert Simon Henstridge is the current king of the United Kingdom and the other Commonwealth realms who replaced his uncle Cyrus as king after a Privy Council vote. Until Season 3, Robert was thought to have died in a plane crash, but instead was found to be alive on a deserted island.", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://the-royals.fandom.com/wiki/Robert_Henstridge", "title": "Robert Henstridge | The Royals Wiki | Fandom", "description": "King Robert Simon Henstridge is the current king of the United Kingdom and the other Commonwealth realms who replaced his uncle Cyrus as king after a Privy Council vote. Until Season 3, Robert was..."}, "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "The Royals Wiki", "title": "Robert Henstridge", "description": "King Robert Simon Henstridge is the current king of the United Kingdom and the other Commonwealth realms who replaced his uncle Cyrus as king after a Privy Council vote. Until Season 3, Robert was thought to have died in a plane crash, but instead was found to be alive on a deserted island.", "url": "https://the-royals.fandom.com/wiki/Robert_Henstridge", "image": "https://vignette.wikia.nocookie.net/the-royals/images/a/a7/Robert.jpg/revision/latest?cb=20180516032835"}, "apple-itunes-app": "app-id=422467074, app-arguments=https://the-royals.fandom.com/wiki/Robert_Henstridge"}, "movies": [], "publish_date": null, "source": "http://the-royals.wikia.com", "summary": ""}