{"url": "https://www.nme.com/blogs/tv-blogs/true-crime-documentaries-making-a-murderer-2393468", "text": "Ever since Making A Murderer thrust the true-crime boom into the spotlight, the armchair sleuth has never been so spoilt. With cold-cases being reopened via shocking documentaries, or a famous case being reevaluated via a deep-dive podcast, there’s a hot-take available for every unsolved or controversial case.\n\nHere’s the nine documentaries and podcasts you need to throw yourself into.\n\nThe Jinx\n\nWhat’s the case? New York property heir Robert Durst was accused of being involved of several disappearances of close acquaintances. His wife Kathleen McCormack Durst disappeared in 1982, while close friend Susan Berman was killed decades later in 2000. The case that this doc focuses on his alleged involvement with the killing and dismemberment of neighbour Morris Black a year later, in 2001.\n\nAdvertisement\n\nWhy it’s worth a watch? It has a rare caveat for true crime docs – it directly interviews the criminal involved. In The Jinx, Durst sits down with director Andrew Jarecki to talk through the cases. It results in a jaw-dropping finale that’ll chill you to your very core.\n\nWhere to watch? All episodes on NOW TV or Sky Boxsets.\n\nThe Keepers\n\nWhat’s the case? In 1969, Sister Cathy Cesnik body was found near a garbage dump in a Baltimore suburb and her murder has never been explained. However former students suggest that Cathy may have become suspicious of alleged sexual abuse of students by a priest also teaching at the school she worked at.\n\nWhy it’s worth a watch? The story jumps from present day to the time of the crime with ease, and shines a close light on sexual abuse in the Catholic church and its far-reaching implications.\n\nWhere to watch? All episodes on Netflix.\n\nAdvertisement\n\nDirty John\n\nWhat’s the case? After meeting John Meehan on a internet dating website, Debra Newell and her family are dragged into the renegade surgeon’s crazy life, which involves deceit, emotional abuse and eventually, a murder.\n\nWhy it’s worth a listen? The Newell family are forthcoming in their involvement with Meehan – aka Dirty John – and the investigative reporting of LA journalist Christopher Goffard unravels the story of a truly terrifying mean\n\nWhere to listen? Available on all major podcast apps.\n\nThe Staircase\n\nWhat’s the case? Novelist Michael Peterson is charged of the murder of his wife, Kathleen Peterson, despite his claims that she fell down the family home’s staircase. The prosecution alleged that he bludgeoned her to death, instead.\n\nWhy it’s worth a watch? Unprecedented access and insight into Peterson and his lawyer’s defence team, but despite the relationship forged between viewer and Peterson, the documentary is careful to show both sides of the court case.\n\nWhere to watch? All episodes are available on Netflix.\n\nSerial\n\nWhat’s the case? In Season 1, Sarah Koenig and the team investigate the disappearance of Hae Min Lee and the subsequent arrest and trial of Adnan Syed. Season 2 takes a different course, telling the story of US army deserter Bowe Bergdahl, while Season 3 examines the faults of the US’ criminal justice system. All very different strands, but equally engrossing.\n\nWhat it’s worth a listen? Arguably the reason by recent years’ True Crime boom, the team’s attention to detail brings every little detail under review, and it’s serialised (geddit?) format allows the team to tell the story with nuance and clarity.\n\nWhere to listen? Available on all major podcast apps.\n\nhttps://www.youtube.com/watch?v=6TlJsW4Eb6o\n\nAmanda Knox\n\nWhat’s the case? In 2007, Briton Meredith Kercher was found dead in US student Amanda Knox in Italy. Knox was subsequently tried and imprisoned by Italian authorities for four years, but was released in 2011. The court case was highly controversial for its subject matter, police tactics and the media coverage.\n\nWhy it’s worth a watch? We hear the Knox side of the story, for what feels like the first time. Handling the gruesome murder carefully, the documentary assesses what it’s like to be falsely imprisoned for a crime like murder, and how Knox fought to clear her name.\n\nWhere to watch? Available on Netflix\n\nUntold\n\nWhat’s the case? Private Investigator Daniel Morgan is murdered in a pub car park in South London in 1987. He was, allegedly, hot on the tail of a set of corrupt police officers and preparing to tell his story when he was killed.\n\nWhy it’s worth a listen? In one fell swoop, journalist Peter Jukes and Alistair Morgan, Daniel’s brother, discuss the alleged Met Police cover up, drug trafficking and the newspaper phone hacking scandal. It’s a brutal and staggering listen that makes for a very British injustice.\n\nWhere to listen? Available on all major podcast apps.\n\nEvil Genius\n\nWhat’s the case? In 2003, a ‘botched’ bank robbery resulted in the death of Brian Wells. His death was a part of a larger plan that was hatched by Marjorie Diehl-Armstrong and Kenneth Barnes. The FBI would later call it one of “one of the most complicated and bizarre crimes in the annals of the FBI”.\n\nWhy it’s worth a watch? There’s likely never been a case quite as complex, diabolical and intriguing as this one. That Trey Borzillieri and Barbara Schroeder managed to condense it into 4 breathless episodes might just be a minor miracle.\n\nWhere to watch? Available on Netflix\n\nIn The Dark (series 2)\n\nWhat’s the case? Curtis Flowers has been tried six times for a crime he says he didn’t commit. Currently on death row for the murder of three people back in 1996, he’s won countless appeals but still the DA in his hometown of Winona tries the case again and again. A personal vendetta? It certainly looks that way.\n\nWhat it’s worth a listen? The level of injustice uncovered by APM reports is astonishing as is trying to imagine what Curtis has been through over the last 21 years.\n\nWhere to listen? All major podcast apps", "images": ["https://www.nme.com/wp-content/uploads/2018/10/the-staircase.jpg", "https://www.nme.com/wp-content/uploads/2020/01/logo-nme-white.svg", "https://www.nme.com/wp-content/uploads/2019/11/logo-nme.svg", "https://www.nme.com/wp-content/uploads/2018/10/the-staircase-696x442.jpg"], "top_img": "https://www.nme.com/wp-content/uploads/2018/10/the-staircase.jpg", "keywords": [], "authors": ["Thomas Smith"], "canonical_link": "https://www.nme.com/blogs/nme-blogs/true-crime-documentaries-making-a-murderer-2393468", "title": "True-crime documentaries: Here's the ones you need to watch", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Here's the eight unmissable true crime documentaries and podcasts you need to throw yourself into this year", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_GB", "type": "article", "title": "True-crime documentaries: Here's the ones you need to watch", "description": "Here's the eight unmissable true crime documentaries and podcasts you need to throw yourself into this year", "url": "https://www.nme.com/blogs/nme-blogs/true-crime-documentaries-making-a-murderer-2393468", "site_name": "NME Music News, Reviews, Videos, Galleries, Tickets and Blogs | NME.COM", "image": {"identifier": "https://www.nme.com/wp-content/uploads/2018/10/the-staircase.jpg", "secure_url": "https://www.nme.com/wp-content/uploads/2018/10/the-staircase.jpg", "width": 2000, "height": 1270}}, "article": {"publisher": "https://www.facebook.com/nmemagazine/", "tag": "Making A Murderer", "section": "NME Blogs", "published_time": "2018-10-26T14:03:47+00:00"}, "twitter": {"card": "summary_large_image", "description": "Here's the eight unmissable true crime documentaries and podcasts you need to throw yourself into this year", "title": "True-crime documentaries: Here's the ones you need to watch", "site": "@nme", "image": "https://www.nme.com/wp-content/uploads/2018/10/the-staircase.jpg", "creator": "@nme"}, "generator": "WordPress 5.3.2"}, "movies": ["https://www.youtube.com/embed/8ZabDYB7ijM?feature=oembed", "https://www.youtube.com/embed/Khr7dbuBjuE?feature=oembed", "https://www.youtube.com/embed/mNzrws6ubb4?feature=oembed", "https://www.youtube.com/embed/Bvv97sCcruY?feature=oembed", "https://www.youtube.com/embed/f5SFjSxzS7M?feature=oembed", "https://www.youtube.com/embed/sTqdryPttNU?feature=oembed", "https://www.youtube.com/embed/Qpdb9zo_1t8?feature=oembed", "https://www.youtube.com/embed/e7EuBnB3vcs?feature=oembed"], "publish_date": 1540562627.0, "source": "https://www.nme.com", "summary": ""}