{"url": "https://www.inquisitr.com/4443199/ben-affleck-and-lindsay-shookus-date-in-new-york-heres-what-happened-on-their-big-date-at-the-big-apple/", "text": "Ben Affleck and Lindsay Shookus spotted out and about in New York on Sunday as their summer romance post-Jennifer Gardner divorce continues to bloom.\n\nAccording to the Daily Mail UK, the 45-year-old Justice League star and his 37-year-old Saturday Night Live! producer girlfriend strolled down the streets of New York for their Sunday date.\n\nWhile people expected the new couple to look like they are on a big date at the Big Apple, the Hollywood superstar and his lady love appear to be downplaying their romance as Ben was spotted a couple of steps ahead of Lindsay.\n\nWearing his usual jeans-and-shirt ensemble, Ben Affleck took Lindsay Shokus, who was wearing a striped top and a thigh-skimming denim shorts, shopping earlier that day.\n\nSpeaking to E! News, a witness confirmed that the 45-year-old Oscar winner paused his stroll with his girlfriend to sign autographs and have selfies taken with fans who happen to pass them by before they proceeded to Barney’s New York. After that, they made their way back to Ben’s hotel.\n\nBoth of them were sporting what appears to be a matching pair of black leather bomber jacket in the morning and both ditched it for a more casual attire for their date night, E! News added.\n\nBen Affleck and Lindsay Shookus' Big Date in the Big Apple https://t.co/5z6E0xNFLV — E! News (@enews) August 21, 2017\n\nBased on the outlet’s report on Ben Affleck and Lindsay Shookus’ date night in New York, the couple reportedly dined at a French-American restaurant situated at the heart of Greenwich Village, New York City called the Mas (farmhouse).\n\nDuring that night, Ben donned a blue sport coat and corduroy trousers matched with his familiar red t-shirt while Lindsay wore a black top, skinny jeans, and a pair of nude wedges.\n\nSeeing the new couple on their Sunday date in New York was not surprising for fans considering that they have already confirmed their relationship early in July by making a public appearance together in Los Angeles, three months after his divorce with actress, Jennifer Gardner, in April 2017.\n\n[Image by Pascal Le Segretain/Getty Images]\n\n“It’s more than a summer fling,” someone reportedly knowledgeable of the situation told E! News.\n\n“They are having fun and care for each other. It’s early and they are taking it slow.”\n\nBased on the source’s statement, Ben Affleck and Lindsay Shookus had been trying to keep their relationship low profile before they were spotted out-and-about in L.A. on July 6.\n\n“They had a table for two, but were sitting very close to one another,” E! News’ eyewitness said.\n\n“Ben and Lindsay were very intimate and touchy the entire dinner. They kept whispering in each other’s ears and Ben was quite touchy with Lindsay.”\n\nOn top of that, they even shared a plate for a couple of dishes and left the restaurant “walking very closely together.”\n\nHowever, neither of the two have made any comment to confirm nor deny their relationship.\n\nBased on E! News’ report, what is left now is for them to make it “red carpet official,” as most Hollywood couples do. In fact, they haven’t even made it Instagram or Twitter official yet.\n\nWith that said, who’s to say that they’re just friends who happened to color-coordinate their outfits every time they get together? Better take the speculations down a notch until we know more.\n\nWhat do you think of this article about Ben Affleck and Lindsay Shookus? Tell us in the comments.\n\n[Featured Image by Kevin Winter/Getty Images]", "images": ["https://secure.gravatar.com/avatar/408a7e4769d130cb16bb1c27f3d52e1d?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2017/08/Ben-Affleck-On-A-New-York-Date.jpg", "https://cdn.inquisitr.com/wp-content/uploads/2017/08/Ben-Affleck-and-estranged-wife-Jennifer-Gardner.jpg", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png"], "top_img": "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Erika Miranda"], "canonical_link": "https://www.inquisitr.com/4443199/ben-affleck-and-lindsay-shookus-date-in-new-york-heres-what-happened-on-their-big-date-at-the-big-apple/", "title": "Ben Affleck And Lindsay Shookus’ Date In New York: Here’s What Happened On Their Big Date At The Big Apple", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}