{"url": "https://people.com/tv/kim-kardashian-slams-desperate-scott-disick-over-kourtney-kardashian-drama/", "text": "Scott Disickisn’t thrilled about his ex Kourtney Kardashian‘s new man.\n\nOn Sunday night’s episode of Keeping Up with the Kardashians, the mounting tension between the two reached its peak as Kourtney, 38, went public with boyfriend Younes Bendjima in Cannes, France — pushing Disick, 34, to do whatever he could to seek revenge.\n\nGet push notifications with news, features and more.\n\nScott’s shenanigans begin\n\nIn the days leading up to her trip to the south of France in May, Kourtney took great care to avoid telling Disick about her plans out of fear that he would also fly to Cannes. (Spoiler alert: He did.)\n\n“He was photographed last night with Bella [Thorne],” she told her sisters. “But he’s been writing me all morning. He’s like, ‘I sold my house and I think that I should move in [with you]. Then we can just raise the kids together and have an open relationship.’ ”\n\n“Scott and I are not in a good place — he’s been partying and I’ve been trying to distance myself,” she said. “Is he serious that he thinks there’s any sort of chance of moving back into the house? Because that is just wild.”\n\nSure enough, as soon as he found out his ex would be there, Disick planned his own trip, claiming he had booked a club appearance.\n\n“It is crazy that Scott won’t leave Kourt alone,” fumed Khloé Kardashian, 33. “We just went through all that s— in Santa Barbara, and all of a sudden Scott is going to Cannes? It’s super suspicious.”\n\nKourtney informed her that she and Disick had gotten into a “full war” over the trip.\n\n“He doesn’t care how he embarrasses you, going out on the town with Bella and all of those other people,” Khloé said.\n\nBut it was more serious than that — according to Kourtney, Disick had started “threatening” her and Bendjima.\n\n“He’s like, ‘Your little friend is going to get beat up every single day that we’re there,'” Kourtney said. “Then he’s like, ‘You’re the love of my life. Why would I have anyone attack you?’ ”\n\n“I said, ‘I will actually never speak to you again with your threats. If you threaten me and my friends, it’s over — that’s not how I will be treated, you treated me horribly for years,’ ” she explained.\n\n“I just can’t believe he would stoop this low and speak to her like this,” Khloé said. “At the end of the day, she’s the mother of his children. … It’s just so childish.”\n\nRELATED VIDEO: Bella Thorne Reveals Details from Her Time in Cannes with Scott Disick — His Partying Was ‘Way Too Much for Me’\n\nAfter several attempts to reach Disick, the sisters acknowledged that he was purposely ignoring them.\n\n“When Scott does something and he knows it, he avoids you,” Kim Kardashian West said. “He avoids all of us. It’s so obvious.”\n\nAs for Disick? During a confessional, he claimed Kourtney was being “a drop condescending” about the trip.\n\n“I got defensive,” he admitted. “If you’re going to be in Cannes with another guy, like, have fun. But just know that it’s probably not going to be that fun if you run into me.”\n\n“She’s allowed to live her life, she’s a single girl. We all know that I do what I want, so she should be able to also,” he added. “But there’s a lot of anger. It’s really real, us not being together.”\n\nKhloé eventually got a hold of him, and he apologized for his behavior toward Kourtney, calling himself “a f—ing idiot.”\n\n“She’s still going to be the mother of your kids no matter what,” Khloé said. “We can’t say certain things, because it’s really hard to take it back.”\n\n“I really was just acting like a hothead. I got way too out of hand,” he said. “Long story short, I was acting a bit immature, and I said a few things that weren’t appropriate. I’m not going to regret that, because that’s how I felt at the time.”\n\nKim confronts her assistant\n\nMeanwhile, Kim, 37, was going through her own set of issues — this time over her longtime assistant Stephanie Shepherd, who had recently grown extremely close with Kourtney.\n\n“She was single, you were single, and you just love to have a partner in crime to go out with,” Kim told Kourtney. “I kind of looked up and they were BFF, or ‘wifeys.’ ”\n\nBut the closeness between Shepherd and Kourtney made things awkward for Kim, who learned from her sister that Shepherd had admitted to feeling “unfulfilled job-wise.”\n\n“I do think it’s inappropriate for her to talk to you and not to me,” Kim said. “Don’t you think that’s a little unprofessional? … That’s like, a convo she should have with me.”\n\nKhloé advised her sister to have a conversation with Shepherd, and the two women finally sat down.\n\n“I hate serious conversations. I’m uncomfortable, she’s uncomfortable, I just don’t know what to say … but I don’t have the time to dance around not being confrontational anymore,” Kim said. “I want to be upfront. I don’t want to be that pushover person.”\n\nBut a little honesty goes a long way — after their talk, Kim agreed to let Shepherd take on bigger roles in her companies.\n\n“I do want you to feel like you’re fulfilled and doing stuff that you love,” she said, as Shepherd promised to always have Kim’s back — no matter what her relationships with any Kim’s family members may be.\n\nA visit to Planned Parenthood\n\nBefore Kourtney’s trip to Cannes, the three sisters decided to visit a Planned Parenthood location in Los Angeles to become more informed about a hot-button political issue: “pro-life” lawmakers’ efforts to close Planned Parenthood clinics across the country.\n\nAfter meeting with several employees and patients, the sisters all agreed that the organization is one they wanted to support.\n\n“The perception of Planned Parenthood is that it’s this like, abortion clinic. That’s nothing like what it’s like,” Kim said. “Hearing that firsthand really made it real for me.”\n\n“Hearing the stories for sure was eye-opening,” Kourtney added.\n\n“I’m a big fan of Planned Parenthood now,” Khloé said. “Meeting all the girls and hearing their stories and seeing how many women have been helped by some of the services they have to offer — I think people need to be more educated before they form opinions, and that’s what I’m grateful that I had the opportunity to do today.”\n\nKourtney and Kendall take France\n\nOnce in Cannes, Kendall couldn’t help but notice how “intense” things were between Kourtney and Bendjima, whom she’s been dating since earlier this year and whom family friend Simon Huck called a 24-year-old “stallion.”\n\n“It’s kind of weird because I haven’t seen Kourt with another guy in like, 10 years, or however long it’s been,” said Kendall, 21. “It’s interesting. It’s fun. She’s free.”\n\nBut just a couple of days into their trip, paparazzi photos surfaced of Disick flying out of Los Angeles on his way to Cannes with his then-fling, 20-year-old Bella Thorne.\n\n“They looked so desperate at the airport,” said Kim to Kendall on the phone. “Who goes to LAX together? It’s not a good look for Scott, at all.”\n\n“He talked to me it about it,” Kendall said. “He thinks it is. I said, ‘Are you nuts? Like, are you actually not well?’ He was like, ‘I’m doing it to make Kourtney mad.’ I said, ‘You’re not going to make her mad for the right reasons.’ ”\n\n“I think it’s clear to everyone that Scott is doing this just to try to one-up Kourtney and that seems super malicious,” Kim said. “Kourtney is genuinely trying to go away and have a good time. It’s just so ridiculous. I can just see this is not going to end well.”\n\nAs new photos of Kourtney with Bendjima continued to surface, so did photos of Disick cuddling up to a slew of young women, including Thorne, stylist Chloe Bartoli, current flame Sofia Richie and more.\n\nImage zoom KCS Presse/MEGA\n\nImage zoom J. Almasi/GC Images\n\nImage zoom Splash News Online\n\nBack in Los Angeles, Khloé could hardly believe her eyes: “I feel like Kourt is just living her life on the boat with her guy, chilling, and Scott is trying to one-up Kourt with every picture, new girl, new thing, lovey-dovey,” she said.\n\n“It’s all a jealousy thing,” Kim said. “It’s just nuts.”\n\nImage zoom Splash News\n\nImage zoom Splash News Online\n\nImage zoom BACKGRID\n\nAfter FaceTiming her sister (and meeting Bendjima for the first time!), Khloé encouraged Kourtney to keep living her life — even if that meant contributing to the ongoing “picture wars” with her ex.\n\n“I feel like I’m watching a ping pong match,” she joked to her sister. “Anyways, you are a class act.”\n\n“She’s finally doing something for herself,” Khloé added later. “And I’m just proud of her for having fun.”\n\nAs for Kourtney? She called the trip “so fun” and, most importantly, incredibly “freeing.”\n\n“I do think this was one of the first times I was really able to separate Scott and what he’s doing and be able to have an amazing time and not worry,” she said. “I’m not trying to throw anything in anyone’s face, but I’m also not going to hide.”\n\nKeeping Up with the Kardashians airs Sundays (9 p.m. ET) on E!", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F05%2Fkourtney-kardashian-7.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fscott-chloe.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F05%2Fdisick-thorne-4-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F05%2Fscott-disick-b-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fkim-kardashian-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F05%2Fkourtney-k-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F06%2Fkardashian-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fkim-kardashian-2.jpg", "keywords": [], "authors": ["Aurelie Corinthios"], "canonical_link": "https://people.com/tv/kim-kardashian-slams-desperate-scott-disick-over-kourtney-kardashian-drama/", "title": "Kim Kardashian Calls Scott Disick 'Desperate' and 'Malicious' During Cannes Fling with Bella Thorne", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Keeping Up with the Kardashians,Kendall Jenner,Khloé Kardashian,Kim Kardashian,Kourtney Kardashian,News,Recap,Scott Disick,TV,Younes Bendjima", "news_keywords": "Keeping Up with the Kardashians,Kendall Jenner,Khloé Kardashian,Kim Kardashian,Kourtney Kardashian,News,Recap,Scott Disick,TV,Younes Bendjima", "description": "On Sunday night's Keeping Up with the Kardashians, Kourtney Kardashian went public with Younes Bendjima as Scott Disick was photographed with Bella Thorne", "og": {"title": "Kim Kardashian Calls Scott Disick 'Desperate' and 'Malicious' During Cannes Fling with Bella Thorne", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/kim-kardashian-slams-desperate-scott-disick-over-kourtney-kardashian-drama/", "description": "Scott Disickisn’t thrilled about his ex Kourtney Kardashian‘s new man. On Sunday night’s episode of&nbsp;Keeping Up with the Kardashians, the mounting tension between the two&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fkim-kardashian-2.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/kim-kardashian-slams-desperate-scott-disick-over-kourtney-kardashian-drama/", "description": "On Sunday night's Keeping Up with the Kardashians, Kourtney Kardashian went public with Younes Bendjima as Scott Disick was photographed with Bella Thorne", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fkim-kardashian-2.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/kim-kardashian-slams-desperate-scott-disick-over-kourtney-kardashian-drama/", "title": "Kim Kardashian Calls Scott Disick 'Desperate' and 'Malicious' During Cannes Fling with Bella Thorne", "description": "On Sunday night's Keeping Up with the Kardashians, Kourtney Kardashian went public with Younes Bendjima as Scott Disick was photographed with Bella Thorne", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fkim-kardashian-2.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}