{"url": "https://www.cosmopolitan.com/entertainment/music/a15071747/taylor-swift-end-game-secrets/", "text": "Taylor Swift's third video from her album Reputation offers an entire basket of easter eggs for die-hard fans, curious Swifties, and people who can fluently read Japanese. For those who aren't as eagle-eyed or bilingual, you can find most of Taylor's secret shout-outs here.\n\n1. Taylor's Old Fashioned\n\nYoutube\n\nTaylor could be drinking anything in this shot from early in the video, but it looks suspiciously like the whiskey-based Old Fashioned drink she mentioned in \"Getaway Car,\" another song from Reputation.\n\n2. Future's license plate says \"13\"\n\nYoutube\n\nTaylor has a long history with the number 13 and often includes it in her videos. Her birthday is on the 13th and she considers it her lucky number.\n\n3. Kitty!\n\nYoutube\n\nIt's no surprise that Taylor likes cats, but instead of including one of her two adorable furbabies in the video, this fuzzy friend pops up in the back of her lounging with a chair. The black cat might be a reference to black cats being \"bad luck,\" a sort of visual 13.\n\n4. \"Ex-Love\" visual pun\n\nYoutube\n\nRight after Taylor sings \"I don't want to be just another ex-love,\" the camera cuts to this image of her sitting on a bench in front of a wall with wooden struts that look like the letter X. Gotta love an eye-pun.\n\n5. Snake earring\n\nYoutube\n\nTaylor announced Reputation with short clips of snakes, indicating that she was leaning hard into the \"snake emoji\" image Kim Kardashian tagged her in during their whole thing. The snake earring in the \"End Game\" video is just one of the many snakey references.\n\n6. Literally so many references hidden in the Japanese street signs.\n\nYoutube\n\nTwitter users have already started pointing out that the street signs in the Tokyo part of the video have the names of Taylor Swift's cats and some lyrics from the video hidden in them.\n\n①あなたの一軍でいたいの means \"I wanna be your first string\"\n\n②メレディス オリビア means \"Meredith Olivia\"\n\n③Aチーム means \"A-Team\"\n\n④クライマックス means \"end game\"#EndGameVideoTomorrow #EndGameMusicVideo pic.twitter.com/BRCD3ILRag — Ichika💘 (@Rowl_13) January 11, 2018\n\n7. Another 13 and more snakes\n\nYoutube\n\nThe boom box drops another 13 on us, and the snakey straws in the drinks are a nice touch.\n\n8. An \"A Team\" shirt when she's sitting next to Ed Sheeran\n\nYoutube\n\nYou can juuust make out that Taylor's shirt says \"A Team,\" and since she's next to her BFF Ed, it's definitely a reference to both the \"End Game\" and Ed Sheeran's song \"A Team.\"\n\n9. This. Snake. Jumpsuit.\n\nYoutube\n\nWait wait wait. This snake print jumpsuit is a snake reference, but it's actually the most brutal and specific reference in the video. In September 2017, makeup guru Jeffree Star threw his hat in the snake ring when he posted a tweet saying he was \"wearing Taylor Swift's skin,\" referring to his snake print jumpsuit.\n\nTaylor is wearing the exact same jumpsuit! She is watching, ya'll.\n\n10 & 11. Rainbow dress at a New Year's party\n\nYoutube\n\nThe rainbow dress Taylor is wearing at the party is very similar but not exact to the rainbow dress she wore in the Reputation magazines released alongside her album. The dress in the video has a high neck and the one from the magazine is a v neck, but it seems like a pretty deliberate reference. Also, judging by the hats and fireworks, this is a New Year's party, which pertains to \"New Year's Day,\" another song on Reputation.\n\n12. Special \"Endgame 13\" snake\n\nYoutube\n\nThis single shot in the video combines Taylor playing a game with a snake, where she is on level 1-3, and the bar at the top gives her the option to \"ENDGAME.\" That's a lot of refs for two seconds on screen.\n\n13. Joe Alwyn's necklace\n\nYoutube\n\nIn the bathrobe scene, Taylor is wearing a robe, a necklace, and presumably little else. The necklace she's wearing is the same one she was spotted wearing when she started dating Joe Alwyn; it's a Tiffany pendant with the letter \"J.\"\n\n14. \"Wildest Dreams\" car ride\n\nYoutube\n\nThe shot of Taylor looking out of a car in the rain has the same lighting and composition of a similar shot from the \"Wildest Dreams\" music video. In \"Wildest Dreams,\" Taylor is sad and glammed up, with diamonds and red lipstick abound. This time she has a more natural look, and she turns to the camera and smiles. The \"Wildest Dreams\" video was also based on the doomed romances of Elizabeth Taylor and Richard Burton, which she references in Reputation's \"...Ready For It?\" when she sings \"he can be my jailer, Burton to my Taylor,\" presumably in reference to Joe Alwyn. Here's the \"Wildest Dreams\" shot for comparison:", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-swift-end-game-1515779356.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-swift-end-game-1515779356.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": ["Alexis Nedd"], "canonical_link": "https://www.cosmopolitan.com/entertainment/music/a15071747/taylor-swift-end-game-secrets/", "title": "14 Hidden Messages You Might Have Missed In Taylor Swift's \"End Game\" Video", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "14 Hidden Messages You Might Have Missed In Taylor Swift's \"End Game\" Video", "description": "She's got a big reputation!", "url": "https://www.cosmopolitan.com/entertainment/music/a15071747/taylor-swift-end-game-secrets/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-swift-end-game-1515779356.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2018-03-16 05:16:56", "published_time": "2018-01-12 05:51:00", "section": "Music", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-swift-end-game-1515779356.jpg?crop=1.00xw:1.00xh;0,0&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Taylor Swift End Game Video Meaning & Easter Eggs - Hidden Messages in T Swift Music Video", "description": "Taylor hid secret messages for fans in her video for \"End Game.\" She's got a big reputation!", "keywords": "taylor swift, taylor swift end game, end game music video, end game hidden messages, taylor swift hidden messages", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-swift-end-game-1515779356.jpg?crop=0.502xw:1.00xh;0.402xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrities & Entertainment,entertainment,music", "sailthru.date": "2018-01-12T17:51:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-swift-end-game-1515779356.jpg?crop=1.00xw:1.00xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-swift-end-game-1515779356.jpg?crop=0.502xw:1.00xh;0.402xw,0", "sailthru.socialtitle": "14 Hidden Messages You Might Have Missed In Taylor Swift's \"End Game\" Video", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1515707460.0, "source": "https://www.cosmopolitan.com", "summary": ""}