{"url": "http://www.mtv.com/news/articles/1583539/20080317/id_0.jhtml", "text": "On Sunday, former President Bill Clinton — whose wife, Senator Hillary Clinton, is battling for the Democratic Party's presidential nomination — fielded some tough questions from four college journalists during mtvU's \"Editorial Board\" in New Orleans. The Clinton installment of \"Editorial Board\" premieres March 26 on mtvU.\n\nWhile the questions were largely expected, Clinton's answers were not. The event — the first in a televised series that will give selected writers and editors from mtvU's College Media Network the opportunity to meet with some of today's most prominent political figures — provided Clinton an opportunity to set the record straight.\n\nWhen asked about those remarks he'd made leading up to the South Carolina primary (he pointedly compared Senator Barack Obama's candidacy to that of Jesse Jackson's in '84 and '88, which some perceived as his attempt to pigeonhole his wife's rival as the \"black\" candidate), Clinton said his remarks were blown out of proportion by a media hungry for controversy during election season.\n\n\"Contrary to the myth, I went through South Carolina and never said a bad word about Senator Obama — not one,\" he insisted. \"I went to African-American college campuses and said, 'Look, I expect most of you are going to vote against Hillary. But I want you to know that she wants your vote.' That's what we did. You can't blame the African-American community for being proud of having a candidate who's immensely impressive, who has had a lot of support in the North among non-African-Americans and has generated all this excitement among young people. I don't think it's rocket science. The fact that people are excited about Senator Obama's candidacy in the African-American community is entirely understandable.\"\n\nBut Clinton warned against approaching this election as though it were a popularity contest. He said while thousands of Americans have rallied around Obama's call for change, his wife has been making change for years.\n\n\"It is almost impossible to find any Democrat who has accomplished more in less time in the Senate — and with Republicans — on both domestic and foreign-policy issues and military issues\" than Hillary Clinton, he said. Bill Clinton also said that Obama has been running a campaign that suggests, \"If you were part of making good things happen in the '90s and stopping bad things from happening in this decade ... then you are part of a culture of conflict and you are so yesterday. The only way we can have a good president is to make a completely new beginning.\n\n\"This is the first election in history that I can remember where experience — and having, actually, experience as a change-maker — should be a disability for being elected,\" he added. \"All of you who are young have a right to say that, but don't pretend you're not saying that.\"\n\nLater, Clinton took exception to suggestions that Obama has rejected special-interest funds in his campaign. \"[Obama] was the only one who kept his [political action committee],\" Clinton said. \"Then, in the beginning, he spends 40 percent of the PAC money — 43 percent, to be exact — on Iowa, New Hampshire, Nevada and South Carolina politicians. Those states constitute 3.7 percent of America's population. He also admitted that his political action committee consulted with his campaign on how to spread the money out. So, therefore, it is not true that he has run a campaign without any special-interest money influencing the presidential campaign.\"\n\nWhen asked why African-Americans' support of his wife continues to drop, Clinton pointed to Obama's caucus win in Iowa as the turning point — not the comments he made before South Carolina's primary.\n\n\"The minute it became possible that [Obama] could be the nominee, he was going to win the lion's share of the African-American vote,\" Clinton surmised. \"And I think that I never begrudged it.\"\n\nThe issue of drug use was also broached. Clinton famously remarked in the '90s that he had experimented with marijuana but \"never inhaled,\" and Obama has also admitted to trying cocaine as a youth. Clinton was asked whether voters might be swayed by such things from a candidate's past.\n\n\"It was also an issue when President Bush ran for the first time, because he didn't answer the cocaine question, right? ... I think the voters rendered a verdict ... that what you did when you were really young is not going to bar you from serving as president,\" he said.\n\nClinton later told the crowd assembled for Sunday's event that he thinks Congress may abolish the \"Don't Ask, Don't Tell\" policy regarding gays serving in the military before year's end.\n\n\"It would have been a better policy if it had been implemented the way General [Colin] Powell and I agreed to implement it. ... I think we may have the support now in Congress to get rid of it altogether,\" Clinton said. \"That's what we should do. We should do what every other major country has done and allow gays to serve honorably in the military. ... Our guys came to us and said, 'Look. If you don't agree to this, they're going to bury you. You will have nothing.' \"\n\nGet informed! Head to Choose or Lose for nonstop coverage of the 2008 presidential election, including everything from the latest news on the candidates to on-the-ground multimedia reports from our 51 citizen journalists, MTV and MySpace's Presidential Dialogues, and much more.", "images": ["http://www.mtv.com/shared/promoimages/chooseorlose/choose_logo_100x49.gif", "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:29581?quality=0.8&format=jpg&width=1440&height=810&.jpg", "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:29581?width=385&height=217&quality=.05&format=jpg"], "top_img": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:29581?quality=0.8&format=jpg&width=1440&height=810&.jpg", "keywords": [], "authors": [], "canonical_link": "http://www.mtv.com/news/1583539/bill-clinton-says-he-never-said-a-bad-word-about-senator-obama-at-mtvus-first-editorial-board/", "title": "Bill Clinton Says He 'Never Said A Bad Word About Senator Obama,' At mtvU's First 'Editorial Board'", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no", "HandheldFriendly": "true", "MobileOptimized": 320, "reporting": {"beacon_url": "http://mb.mtv.com/data/collect/v1/mb.gif", "call_config": "{\"omniture\":{\"pageName\":\"/news/1583539/bill-clinton-says-he-never-said-a-bad-word-about-senator-obama-at-mtvus-first-editorial-board/\",\"channel\":\"news\",\"events\":\"event16, event18\",\"prop1\":\"\",\"prop8\":\"none\",\"prop9\":\"\",\"prop11\":\"\",\"prop12\":\"Life\",\"prop14\":\"\",\"prop15\":\"no-franchise\",\"prop18\":\"Bill Clinton Says He 'Never Said A Bad Word About Senator Obama,' At mtvU's First 'Editorial Board' [Life]\",\"prop19\":\"03.17.2008\",\"prop20\":\"archive-Chris-Harris\",\"prop21\":\"ALLTRAFFIC:MTV\",\"prop28\":\"News article\",\"prop38\":\"mtv.com\",\"prop44\":\"\",\"prop55\":\"news:News\",\"prop65\":\"News Article\",\"eVar6\":\"none\",\"eVar9\":\"/news/1583539/bill-clinton-says-he-never-said-a-bad-word-about-senator-obama-at-mtvus-first-editorial-board/\",\"eVar10\":\"ALLTRAFFIC:MTV\",\"eVar68\":\"no-franchise\",\"hier1\":\"/news/1583539/bill-clinton-says-he-never-said-a-bad-word-about-senator-obama-at-mtvus-first-editorial-board/\"}}"}, "og": {"site_name": "MTV News", "image": {"identifier": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:29581?quality=0.8&format=jpg&width=1440&height=810&.jpg", "width": 1440, "height": 810}, "author": "Archive-Chris-Harris", "type": "article", "description": "Former president also addresses drug use, 'Don't Ask, Don't Tell' policy and more during discussion with college journalists; episode premieres March 26.", "title": "Bill Clinton Says He 'Never Said A Bad Word About Senator Obama,' At mtvU's First 'Editorial Board'", "url": "http://www.mtv.com/news/1583539/bill-clinton-says-he-never-said-a-bad-word-about-senator-obama-at-mtvus-first-editorial-board/"}, "ao": {"mgid": "mgid:wordpress:post:articles.mtv.com:1583539"}, "thumbnail": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:29581?quality=0.8&format=jpg&width=1440&height=810&.jpg", "twitter": {"image": "https://mtv.mtvnimages.com/uri/mgid:ao:image:mtv.com:29581?quality=0.8&format=jpg&width=500&height=375", "card": "summary_large_image", "description": "Former president also addresses drug use, 'Don't Ask, Don't Tell' policy and more during discussion with college journalists; episode premieres March 26.", "title": "Bill Clinton Says He 'Never Said A Bad Word About Senator Obama,' At mtvU's First 'Editorial Board'", "url": "http://www.mtv.com/news/1583539/bill-clinton-says-he-never-said-a-bad-word-about-senator-obama-at-mtvus-first-editorial-board/"}, "author": "Archive-Chris-Harris", "fb": {"app_id": 122150691493, "admins": "unset"}, "asset_url": "http://www.mtv.com/news", "expression": "shownav", "description": "Former president also addresses drug use, 'Don't Ask, Don't Tell' policy and more during discussion with college journalists; episode premieres March 26."}, "movies": [], "publish_date": 1205683200.0, "source": "http://www.mtv.com", "summary": ""}