{"url": "https://www.macleans.ca/culture/books/remembering-diana-a-life-in-photographs-tina-brown/", "text": "Gallery Remembering Diana: A Life in Photographs 1 / 5 Diana, Princess of Wales, at the Braemar Highland Games on September 1982 in Scotland. (Anwar Hussein/WireImage) Remembering Diana: A Life in Photographs Diana, Princess of Wales, at the Braemar Highland Games on September 1982 in Scotland. (Anwar Hussein/WireImage)\n\nIn her foreword to Remembering Diana: A Life in Photographs, which appears 20 years after the princess’s death, journalist, editor and author (The Diana Chronicles) Tina Brown recalls an iconic woman who embodied tragedy, a lifelong search for love, a bold spirit and a selfless commitment to the world’s less fortunate.\n\nTwenty years after her death we miss her more than ever. There’s still a yawning gap. So deep was the bond of compassion she forged with her admirers that her death in August 1997 at the age of 36 was a universal bereavement.\n\nDiana was always a rebel. In 1994, at the end of a long string of tabloid revelations about the Prince and Princess of Wales’s marriage difficulties, she was summoned, I am told, to a meeting with Queen Elizabeth and Prince Philip. It was clearly the first royal warning shot that she had better go quietly in what was her now inevitable divorce from Prince Charles. “If you don’t behave, my girl,” Prince Philip reportedly told her, “we’ll take your title away.”\n\nDiana gave him a long, cool stare. “My title is a lot older than yours, Philip,” the Earl Spencer’s daughter replied.\n\nShe has been memorialized forever as the People’s Princess. But first and foremost, Diana was a Spencer. Hers was a family more than 500 years old, with centuries of experience as power brokers to the throne. It’s one of the ironies of Diana’s story that it took a girl from an impeccably aristocratic background to break the monarchy out of the crueller rigidities of class.\n\nTo understand why, you have to look to her parents’ divorce and the ensuing acrimony. When Diana was seven, her mother, Frances, left her father, then Viscount Althorp, for Peter Shand Kydd. [The children] watched as her car drove off through the gates of Park House, where Diana was born and raised until the age of 14. Her pain was compounded by the treachery of Frances’s mother, Baroness Fermoy, who sided with Diana’s father in the custody dispute: Diana’s first taste of how power and patriarchy called the shots. The rift between Diana’s mother and grandmother planted in her a potent ambivalence toward the establishment. A frequent, erroneous press assumption at the time of Diana’s engagement to Prince Charles was that her distinguished aristocratic background meant familiarity with a grand, high-society world. In fact, Diana’s childhood was limited in its circle and almost feral in its neglect. She spent most of her free time with the servants below stairs (one reason, perhaps, she could communicate so well with ordinary people). She rattled around the gilded halls of Althorp House, the stately home that Johnny Spencer inherited when Diana was in her early teens, avoiding the company of her despised, social-climbing stepmother, Raine, whom her father had abruptly married when Diana was 15. When he broke the news of his marriage, Diana slapped her father hard across the face, shouting, “That’s from all of us, for hurting us.”\n\nThe future Princess of Wales came from the last generation of uneducated upper-class girls. She attended West Heath Girls’ School, one of those intellectually dim ladies’ academies that sent her off into the world at 16 with not a single educational qualification. At 19, she awaited the arrival of Mr. Wonderful while working as a nanny.\n\nDiana’s lack of education was the source of lifelong feelings of intellectual inferiority. She made up for it with a keen strategic intelligence and a striking capacity for empathy that was noticeable even during her school days.\n\nThe senior classes at West Heath made annual volunteer visits to a nearby hospital for the mentally ill at Dartford. The hospital manager, Muriel Stevens, noted how Diana, unlike her classmates, was never frightened by the grim, therapeutic scene. And she devised a resourceful way of enhancing their pleasure on the dance floor. Many patients were in wheelchairs. Rather than push them from behind, the future princess faced the wheelchair and danced backwards, gliding in a circuit with the chair so she could maintain eye contact and human connection.\n\nDiana always flowered in the presence of the disabled or the ill. And later, as she came to understand the symbolic potency of gesture, she used her position to break taboos. In April 1987—a time when AIDS was still considered a pariah disease—she attended the opening of the first AIDS ward in the U.K. at the Middlesex Hospital. Her decision to shake hands, without gloves, with 12 male AIDS patients was critical in dispelling prejudice toward the ailment. It’s impossible to know what happiness Diana would have known—or who she would have become—if she had married someone other than the Prince of Wales. But it’s also true that in 1977, when the naive 16-year-old first caught sight of the 29-year-old number-one royal bachelor striding through a plowed field at an Althorp shooting party, there was no other rival for her heart. A courtier’s daughter, Diana was raised in the purlieus of Sandringham, where she often played with the young princes as a child. So it’s hardly surprising that the dashing eldest son of the Queen would be the pin-up heartthrob on her bedroom wall. To Charles, however, Diana was the “jolly,” “bouncy” younger sister of Sarah, whom he briefly dated. His future bride wasn’t always a radiant beauty; she became one under the spotlight.\n\nIt was remarkable to watch this change over the years. At the time of her engagement, when she was 19, I was introduced to Diana at the American embassy in London. She was agonizingly shy. As she and Charles moved between the guests, she gazed up at the urbane, practised Prince of Wales with star-struck adoration. Seventeen years later, in July 1997, when I lunched with her at the Four Seasons in New York shortly before her death, global celebrity had electrified her charisma. She strode across the dining room on three-inch heels with all the confidence of a supermodel.\n\nDiana did not know until it was too late that the wedding of the century at St. Paul’s Cathedral, watched by a global TV audience of 750 million people in 1981, was a charade. The callousness of the royals (and the entire circle around Prince Charles) was that they never let her in on the truth: her romantic dream was, at its core, an arranged marriage. The Queen Mother had singled her out as one of the last available virgins from the right family. It was eagerly endorsed by the Queen and Prince Philip, who were desperate for Charles to produce an heir and feared his persistent passion for his married mistress, Camilla Parker Bowles, had become more of a threat than an extended dalliance. With the benefit of 20 years of hindsight, the wrong perpetrated on the young Diana by the crown seems unconscionable.\n\nIt was soon after the engagement that the young bride-to-be increasingly sensed the unwelcome presence of Parker Bowles. Aboard the royal yacht while on her honeymoon with Charles, she overheard the secret calls. Her deep sense of being unloved and unsupported led to bulimia, instability and a neurotic desire for attention. The wedding was hardly over before Charles began to smart from what court insiders referred to as the “upstage problem.” It is another of the great ironies of Diana’s life that everyone was in love with her except her husband. On their first trip as husband and wife to Wales, the mayor of Brecon recalled how the royal couple worked both sides of the rope line as thousands thronged the route to Caernarfon Castle. But the crowd only called out, “Di! Di!”—and when they saw Prince Charles approach, they groaned, “Oh no!”\n\nCourt insiders, alert to the jealousies and displaced in their old routines, were dedicated to suppressing her. Unlike Kate Middleton 15 years later, when the lessons of Diana’s tragedy had been fully absorbed, the 20-year-old Princess of Wales was offered little guidance or protection.\n\nAnd her unhappiness was seeping into the press. In a 1985 Vanity Fair cover story, I broke the news of the behind-the-scenes storms in the Wales’s marriage. The royal couple’s vehement denials of discord—and their decision to go on BBC TV and refute my piece—only confirmed to palace watchers that the stories were true.\n\nAs Diana’s global stardom increased, so did her unhappiness. Five years later, after affairs with her bodyguard Barry Mannakee and her handsome riding instructor James Hewitt, Diana was determined to smash the fairy tale that had trapped her. Her decision to break every royal taboo and go public with her marital misery was as breathtaking in its impudence as it was flawless in its cunning.\n\nOver the course of six months in 1991, Diana’s friend Dr. James Colthurst bicycled to Kensington Palace with a tape recorder hidden in the basket. There, he conducted interviews with her and cycled off again with her stunning revelations—of Charles’s infidelity, of her struggles with bulimia, of the callousness of the royals—and delivered the smoking tapes to tabloid journalist Andrew Morton. [The book] Diana: Her True Story was essentially her memoir, written in his name.\n\nThe first Charles learned of it was on the morning of Sunday, June 7, 1992. He unfurled his carefully folded copy of the Sunday Times and saw an excerpt of Morton’s book. The headline: “Diana Driven to Five Suicide Bids by ‘Uncaring’ Charles.”\n\nThe marriage was now, in essence, over. Diana sublimated her lovelessness into acts of humanitarian leadership, boosting the efforts of the Red Cross, advocating for others with eating disorders and ministering to the homeless, orphans, AIDS patients and the disabled. Charles’s circle mocked her “saintly” acts as self-promotion—but her compassion was real.\n\nAnd no one in the royal family could deny her devotion as a mother. Diana fought for William and Harry to have as normal a childhood as was possible for a member of the royal family, wrapping the boys in the warmth and joy that both she and Prince Charles had been deprived of growing up.\n\nOne of the many sadnesses of Diana’s story is why she was in Paris at all that fateful August in 1997. Life had been better after a divorce from Charles that was acutely bitter. There had been the sensation of her appearance on the BBC in the now legendary television interview with Martin Bashir, where she revealed to a shocked nation the full extent of her husband’s abandonment—“there were three of us in this marriage”—admitted to infidelity herself and dared to imply that the Queen was out of touch. In the year that followed her freedom from her marriage to Charles, Diana had never achieved more meaningful impact. In Huambo, Angola, Diana exhibited all the bravery and recklessness she had used to defy the royal family when she walked through a field of unexploded land mines. And when the press complained they hadn’t got the shot they wanted, she did it again.\n\nBut love, or the lack of it, would always be Diana’s primal wound. Since the summer of 1995, she had found deep fulfillment in an affair with Pakistani heart surgeon Hasnat Khan. But as a conservative Muslim, he could not win the approval of his family to marry her.\n\nThe end of their affair in 1997 left her empty and vulnerable. In June, she came to New York for the Christie’s auction of all her glittering gowns to benefit AIDS and cancer patients. But over lunch at the Four Seasons, she spoke to me of the loneliness of the summer ahead. In August the boys would go, as they did every year, to stay with their father and their grandparents at Balmoral. The world assumed, she told me, that everyone would vie to invite her as their guest. But hosting her came at a price of lost privacy that most of her friends did not want to pay. A fortress was needed to keep the press out. In another of the great ironies of Diana’s fate, the invitation to cruise the south of France by yacht with her new admirer Dodi al-Fayed primarily meant safety. “He has all the toys,” she told her friends, meaning the private plane, the car and driver, the servants and bodyguards belonging to his tycoon father, Mohamed al-Fayed (who also owned Harrods and the Ritz Hotel in Paris)—required to protect her.\n\nAt six minutes past midnight on Aug. 31, 1997, guided only by Dodi’s chaotic plan to elude the Paris paparazzi, he and the most famous woman in the world descended in the service elevator of the Ritz, exited the hotel and slid into the back seat of a black Mercedes. The car, driven by the drunk-acting head of security, Henri Paul, who had been recalled unexpectedly from his night off, took off at breakneck speed into the Pont de l’Alma tunnel.\n\nThe crash and the frantic, unsuccessful attempts to save her at the Pitié-Salpêtrière hospital were followed by “the Great Sorrow”—a wave of pain that swept the British Isles and the world as a numb and disbelieving public learned of Diana’s loss. It could be argued that only the imagery of Diana’s monumental funeral saved the monarchy in those extraordinary days. It was as if Diana’s death had allowed England’s stiff upper lip to tremble at last, and acknowledge that it was no longer a hierarchical, class-bound society imprisoned by the cruel expectations of conformity it had shown the princess during her life. In 2007, I asked then prime minister Tony Blair what, if anything, Diana’s life had signified. A new way to be royal? “No,” he replied without hesitation. “A new way to be British.”\n\nAnd so she did. Twenty years after her death, it is time to acknowledge what we have learned from the example of a woman of privilege who showed the world the importance of humanity: Diana, Princess of Wales.\n\nExcerpted from Remembering Diana by National Geographic with foreword by Tina Brown. Copyright © 2017 by National Geographic Partners. Available Aug. 1, 2017, wherever books are sold. Reproduced by arrangement with the Publisher. All rights reserved.\n\nMORE ABOUT PRINCESS DIANA:", "images": ["https://www.macleans.ca/wp-content/uploads/2017/07/MAC07_DIANA_POST01-1-1.jpg", "https://www.macleans.ca/wp-content/uploads/2017/07/MAC07_DIANA_POST01-1.jpg", "https://www.macleans.ca/wp-content/themes/macleans.ca/assets/images/logo.svg", "https://www.macleans.ca/wp-content/themes/macleans.ca/assets/images/logo.png", "https://www.macleans.ca/wp-content/plugins/rdm-daac-notice/public/images/info.png", "https://www.macleans.ca/wp-content/plugins/rdm-daac-notice/public/images/close.png"], "top_img": "https://www.macleans.ca/wp-content/uploads/2017/07/MAC07_DIANA_POST01-1-1.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.macleans.ca/culture/books/remembering-diana-a-life-in-photographs-tina-brown/", "title": "Princess Diana’s legacy is more urgent than ever, 20 years after her death", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "apple-mobile-web-app-capable": "yes", "contextly-page": "{\"title\":\"Princess Diana\\u2019s legacy is more urgent than ever\",\"url\":\"https:\\/\\/www.macleans.ca\\/culture\\/books\\/remembering-diana-a-life-in-photographs-tina-brown\\/\",\"pub_date\":\"2017-07-31 06:00:21\",\"mod_date\":\"2017-08-28 11:17:07\",\"type\":\"post\",\"post_id\":\"1038097\",\"author_id\":\"30\",\"author_name\":\"Maclean&#039;s\",\"author_display_name\":\"Maclean&#039;s\",\"tags\":[\"British royalty\",\"Editor&#039;s Picks\",\"Prince Charles\",\"Prince Philip\",\"Princess Diana\"],\"categories\":[\"Books\",\"Facebook Instant Articles\",\"Society\"],\"image\":\"https:\\/\\/www.macleans.ca\\/wp-content\\/uploads\\/2017\\/07\\/MAC07_DIANA_FEATURE01.jpg\",\"image_alt\":\"Diana, Princess of Wales\"}", "description": "Two decades after her tragic death in Paris, a new book remembers the compassion, glamour and rebellious spirit of the “People’s Princess.”", "robots": "noodp", "og": {"locale": "en_US", "type": "article", "title": "Princess Diana’s legacy is more urgent than ever, 20 years after her death", "description": "Two decades after her tragic death in Paris, a new book remembers the compassion, glamour and rebellious spirit of the “People’s Princess.”", "url": "https://www.macleans.ca/culture/books/remembering-diana-a-life-in-photographs-tina-brown/", "site_name": "Macleans.ca", "updated_time": "2017-08-28T11:17:07-04:00", "image": "https://www.macleans.ca/wp-content/uploads/2017/07/MAC07_DIANA_POST01-1-1.jpg"}, "article": {"author": "http://www.facebook.com/macleans", "tag": "Tony Blair", "section": "Books", "published_time": "2017-07-31T06:00:21-04:00", "modified_time": "2017-08-28T11:17:07-04:00"}, "twitter": {"card": "summary_large_image", "description": "Two decades after her tragic death in Paris, a new book remembers the compassion, glamour and rebellious spirit of the “People’s Princess.”", "title": "Princess Diana’s legacy is more urgent than ever, 20 years after her death", "image": "https://www.macleans.ca/wp-content/uploads/2017/07/MAC07_DIANA_POST01-1-1.jpg"}, "generator": "WordPress 4.9.9"}, "movies": [], "publish_date": 1501495221.0, "source": "https://www.macleans.ca", "summary": ""}