{"url": "https://techcrunch.com/2017/11/29/meet-the-man-who-deactivated-trumps-twitter-account/", "text": "As Twitter tries to figure out how to lock down the parts of its platform that enable harassment, as well as the spread of misleading information and illicit content, there have been a number of moments that highlight how the service, and its levers of control, are far from perfect.\n\nOne such moment took place earlier this month, when the very active, very watched Twitter account of President Donald Trump was abruptly deactivated for 11 minutes. The man responsible for those 11 minutes moved back home to Germany, and he agreed to speak to TechCrunch about what happened that day.\n\nU.S. President Donald Trump long ago realized that you can use Twitter as an effective mouthpiece without all the pain and price of dealing with the media. Trump’s Twitter account (36.5K tweets and counting) has become one of the most popular ones out there today, with 43.5 million followers and growing by several hundred thousand a week. It’s also one of the most notorious, because of his flippant jokes, insults, rants and controversial retweets.\n\nSo for those who haven’t been happy with Trump — and judging by the popular vote results from the 2016 election, that accounted for a majority of voters in the U.S. — those deactivated 11 minutes became a burst of unexpected joy.\n\nNo joke, the internet has nominated the Twitter employee who shut down Trump's account for a Nobel Peace Prize — Ed Krassenstein 💎 (@EdKrassen) November 6, 2017\n\nJust gonna say it, the employee at Twitter who shut off Trump's account for 11 mins could become a candidate for the Nobel Peace Prize. — David Jolly (@DavidJollyFL) November 3, 2017\n\nhow do i tell my parents im marrying the twitter employee? — Sarah Hagi (@geekylonglegs) November 3, 2017\n\nTwitter, in its turn for more transparency, quickly announced that the account’s shutdown was accidental. Moments later, it followed up with more information: a contractor, on his last day of work, was responsible.\n\nThe story could have ended there, but it didn’t.\n\nReporters started immediately trying to find the now-former Twitter contractor to try to figure out what happened. If it was an accident, how could it happen? If it was intentional, why did it happen?\n\nWe were among those looking for the contractor, and through a string of events found out his name, Bahtiyar Duysak, and got him to agree to talk to us in a town in Germany.\n\nDuysak, a twenty-something with Turkish roots who was born and raised in Germany, was working as a contractor for a fixed term for the last part of his stay in the U.S. under a work and study visa. In addition to his role at Twitter with Pro Unlimited, other assignments had included stints in monetization at Google and YouTube via another contractor, Vaco.\n\nMany have wondered on Twitter why Trump’s account has never been shut down for violating Twitter’s terms (among the reasons people have given is that he has threatened North Korea with nuclear violence) while others have been calling for people to report him using Twitter’s reporting tools for offensive tweets.\n\nAt Twitter, Duysak had been assigned to customer support as part of the Trust and Safety division. This team receives alerts when users report bad behavior, including offensive or illegal tweets, harassment, someone impersonating another person and so on. The team performs triage on complaints to determine what further steps, if any, should be taken.\n\nD\n\nuysak, medium in stature and wearing a black and gray cardigan with a pattern of the American flag across it (not something he planned, laughing a little in surprise when he made the connection between it and the story), is a personable guy. He’s quick to smile; he’s close to his family and has a big network of friends; and he speaks with a certain kind of indeterminate European accent — the kind you often hear from people who have traveled, lived and studied across different countries. He’s more Euro than bro.\n\nHis last day at Twitter was mostly uneventful, he says. There were many goodbyes, and he worked up until the last hour before his computer access was to be shut off. Near the end of his shift, the fateful alert came in.\n\nThis is where Trump’s behavior intersects with Duysak’s work life. Someone reported Trump’s account on Duysak’s last day; as a final, throwaway gesture, he put the wheels in motion to deactivate it. Then he closed his computer and left the building.\n\nSeveral hours later, the panic began. Duysak tells us that it started when he was approached by a woman whom he didn’t know very well. According to Duysak, the woman said that she had been contacted by someone asking about Duysak in connection with Trump’s Twitter account. After a moment of disbelief, he said he then looked at the news and realized what had happened.\n\nDuysak describes the event as a “mistake.” Specifically, he told us, he never thought the account would actually get deactivated.\n\nIn fact, it appeared that Trump’s account was essentially protected from being deactivated over Terms of Service violations. In June, Twitter explained why: Some tweets that seemingly violate its terms of service are nevertheless “newsworthy” and therefore in the public interest to keep up.\n\nOne takeaway from Twitter’s exemption for newsworthy tweets is that news and information trump judgment calls on the relative toxicity of the content, which is probably apt in our age of toxicity dressed up as “news.”\n\nTrump’s election has signaled a high water mark for how people with opposing views on politics and other flashpoint subjects interact. Perhaps more than ever, people spin stories in ways that fit their own agendas.\n\nAlthough Duysak was hailed as a hero by some, he says he hasn’t felt like one at all.\n\nHe’s been pursued by the media, which have been aggressive in contacting family and friends. The woman who first alerted him is a typical example (we asked, and he would not provide her details to us, probably to protect her). Duysak said she had liked some of his posts, and someone — already with a lead on Duysak — had spotted this and tracked her down.\n\nBut he is not concerned about what happens next if there is further investigation of the incident. He hasn’t broken any laws.\n\n“I didn’t hack anyone. I didn’t do anything that I was not authorized to do,” he told us when we met in Germany. “I didn’t go to any site I was not supposed to go to. I didn’t break any rules.”\n\nFor now, it appears that the media has actually been more aggressive than the authorities. We asked and have confirmed with Duysak’s legal representative that the FBI is not investigating him at the moment, although Twitter has apparently attempted to get more information from him. Duysak has chosen not to reply.\n\nAt Twitter — which declined to provide any details to confirm Duysak’s identity to us — the event has hastened efforts to change things at the company.\n\nThe day after the deactivation, Twitter said it was conducting a full internal review and implementing safeguards to prevent incidents like this in the future.\n\nCEO Jack Dorsey also acknowledged in an interview shortly after the incident that there have been weaknesses and gaps, which it is also trying to address. He said that the clause about newsworthiness, which was not publicly known until Twitter made it so, was one of those gaps.\n\n“We have implemented safeguards to prevent this from happening again,” Twitter tweeted from its Twitter Government account. “We won’t be able to share all details about our internal investigation or updates to our security measures, but we take this seriously and our teams are on it.”\n\nThere are some details that potentially complicate things, partly because of how charged the political climate has become in the U.S. Duysak is of Turkish origin, not from the U.S. While these facts have nothing to do with Trump’s account on Twitter getting deactivated, in the wrong hands they could be spun negatively, given Trump’s previous negative statements on immigration and people from predominantly Muslim countries.\n\nApart from inflaming those who don’t agree with him, and emboldening those who do, Trump has spelled out some specific opinions on how the U.S. sits in relation to the rest of the world. He wants to build a wall to keep out immigrants. He has targeted Muslims specifically as a group, a blanket policy he believes would help keep out extremists and terrorists. He has also proposed and signed orders to fill out those ambitions.\n\nD\n\nuysak, in one physical sense, is out of the picture where the U.S. is concerned: our interview took place in Germany, Duysak’s home country, where he returned at the end of his visa period.\n\nHe could have just laid low, but he hasn’t. So then why come forward? To try to clear the air, he said, get a new job and not worry about how the story would come out, if it did, without his involvement.\n\n“I want to continue an ordinary life. I don’t want to flee from the media,” he said. “I want to speak to my neighbors and friends. I had to delete hundreds of friends, so many pictures, because reporters are stalking me. I just want to continue an ordinary life.”\n\nHe said the pursuit has been relentless: journalists have contacted the university where he studied, his places of employment, his friends and his family. His family has shut down various social accounts to avoid the contact.\n\nHe agreed to talk to us because he had a connection to a Muslim-focused community center (which has also had some persistent contact from reporters) in the Bay Area where a relative of Tito’s volunteers. That contributed to his trusting us.\n\n“I didn’t do any crime or anything evil, but I feel like Pablo Escobar,” he said, “and slowly it’s getting really annoying.”\n\nThese days, Duysak said he isn’t likely to take another tech job anytime soon. More likely, he’ll be looking into finance or other related field. “But I love Twitter,” he said, “and I love America.”", "images": ["https://beta.techcrunch.com/wp-content/uploads/2017/11/img_92091.jpg", "https://www.facebook.com/tr?id=1447508128842484&ev=PageView&noscript=1", "https://techcrunch.com/wp-content/uploads/2017/11/trump-twitter.jpg?w=711"], "top_img": "https://techcrunch.com/wp-content/uploads/2017/11/trump-twitter.jpg?w=711", "keywords": [], "authors": ["Ingrid Lunden"], "canonical_link": "https://techcrunch.com/2017/11/29/meet-the-man-who-deactivated-trumps-twitter-account/", "title": "Meet the man who deactivated Trump’s Twitter account – TechCrunch", "meta_data": {"viewport": "initial-scale=1.0,width=device-width,user-scalable=no,minimum-scale=1.0,maximum-scale=1.0", "oath": {"guce": {"product-eu": "false", "consent-host": "guce.techcrunch.com", "inline-consent": "true"}}, "generator": "WordPress 5.4", "sailthru.date": "2017-11-29 15:19:01", "sailthru.title": "Meet the man who deactivated Trump’s Twitter account", "sailthru.tags": "trump, Twitter", "sailthru.author": "Ingrid Lunden", "sailthru.description": "As Twitter tries to figure out how to lock down the parts of its platform that enable harassment, as well as the spread of misleading information and illicit content, there have been a number of moments that highlight how the service, and its levers of control, are far from perfect.", "sailthru.image.full": "https://techcrunch.com/wp-content/uploads/2017/11/trump-twitter.jpg", "sailthru.image.thumb": "https://techcrunch.com/wp-content/uploads/2017/11/trump-twitter.jpg?w=50", "wp-parsely_version": "2.0", "fb": {"app_id": 187288694643718, "pages": 8062627951, "admins": "8803025,726995222,1550970059,1661021707,1178144075,643979435,4700188"}, "article": {"publisher": "https://www.facebook.com/techcrunch"}, "og": {"site_name": "TechCrunch", "site": "social.techcrunch.com", "title": "Meet the man who deactivated Trump’s Twitter account – TechCrunch", "description": "As Twitter tries to figure out how to lock down the parts of its platform that enable harassment, as well as the spread of misleading information and illicit content, there have been a number of moments that highlight how the service, and its levers of control, are far from perfect.", "image": "https://techcrunch.com/wp-content/uploads/2017/11/trump-twitter.jpg?w=711", "url": "https://social.techcrunch.com/2017/11/29/meet-the-man-who-deactivated-trumps-twitter-account/", "type": "article"}, "description": "As Twitter tries to figure out how to lock down the parts of its platform that enable harassment, as well as the spread of misleading information and illicit content, there have been a number of moments that highlight how the service, and its levers of control, are far from perfect.", "title": "Meet the man who deactivated Trump’s Twitter account – TechCrunch", "twitter": {"card": "summary_large_image", "site": "@techcrunch", "title": "Meet the man who deactivated Trump’s Twitter account – TechCrunch", "description": "As Twitter tries to figure out how to lock down the parts of its platform that enable harassment, as well as the spread of misleading information and illicit content, there have been a number of moments that highlight how the service, and its levers of control, are far from perfect.", "image": "https://techcrunch.com/wp-content/uploads/2017/11/trump-twitter.jpg?w=711"}, "msapplication-TileImage": "https://techcrunch.com/wp-content/uploads/2015/02/cropped-cropped-favicon-gradient.png?w=270"}, "movies": ["https://www.youtube.com/embed/WjeciPTFPBc?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": 1511884800.0, "source": "https://techcrunch.com", "summary": ""}