{"url": "https://www.distractify.com/entertainment/2018/08/07/Z1kQHMK/ryan-reynolds-on-twitter", "text": "It's easy to be a fan of Ryan Reynolds. From his epic Twitter takes on everything from parenting to his marriage with Blake Lively, to his Deadpool persona, Ryan is pretty down to Earth. So, while you may think you know everything about the 41-year-old actor — yes, he's Canadian; no, that is not him dancing in the \"Ashes\" music video — thanks to his ability to connect with fans on social media and in real life, you might be surprised to know that there is more to Ryan than his hilarious tweets. Just ask Hugh Jackman. But don't worry, we got you covered.\n\nHow did Blake Lively and Ryan Reynolds meet? Ryan and Blake played love interests in the 2010 blockbuster Green Lantern. However, they were both taken at the time (Ryan was married to Scarlett Johansson and Blake was dating her Gossip Girl co-star Penn Badgley). Fast forward a year, and Ryan and Blake (both single) reunited for a group date, each bringing a person they were casually seeing. \"That was the most awkward date because we were just like fireworks coming across,\" he explained to Entertainment Weekly. \"It was weird at first but we were buddies for a long time. I think ... the best way to have a relationship is to start as friends.\"\n\n\n\nSource: Getty Images\n\nWho was Ryan married to? Before Blake, Ryan was previously married to Scarlett Johansson. They were married for two years before calling it quits in 2010 — and it seems their careers were to blame for the breakup. \"There's always going to be the more successful person. It's related to rejection. Because actors, if they’re not having success, connect it directly to unpopularity — to the fact that nobody wants them. It’s not necessarily true. I’m constantly rejected,\" Scarlett explained to Parade magazine. \"[Marriage] takes a lot of work. It takes a man who's not only confident in the love that you have for one another, but confident in what he has going on in his own career.\" Before Scarlett, Ryan was also dated \"Ironic\" singer Alanis Morissette for five years.\n\nSource: Getty Images\n\nRyan Reynolds' daughters are lucky AF. Ryan and Blake are the proud parents of daughters James, 3, and Inez, who is turning two in September. And by proud, we mean absolutely determined to make sure they grow up as humble as can be. From roasting his oldest's artwork (\"I'd hang it on the fridge but honestly, it's absolute garbage\") to knowing the true value of children (\"Having matching donor organs in case anything happens to me is a true blessing\"), Ryan does not hesitate to roast his kids on social media on almost a daily basis.\n\nSource: Getty Images\n\nSeriously, his parenting tweets are gold. But he makes sure his daughters know he will do anything for them, as long as fire is not involved. \"I'd walk through fire for my daughter. Well not FIRE, because it's dangerous. But a super humid room. But not too humid, because my hair,\" he once jokingly wrote. Same, Ryan. Same.\n\nDoes Ryan Reynolds have a brother? Rumors were swirling that Ryan had a twin brother, but it turns out that was just Ryan pulling a parent trap — he even caught his wife flirting with his \"twin\" Gordon. However, Ryan does have a real-life brother named Jeff, who he also trolls on Twitter. \"Jeff, if there was a fire and I had to choose a family member to save, obviously it’d be me,\" he jokingly tweeted alongside a photo of the siblings. \"But if I had time to save one more, you can be damn sure I’d call the fire department. They’re experts in the field and have vast experience in these matters. I love you.\"\n\nJeff, if there was a fire and I had to choose a family member to save, obviously it’d be me. But if I had time to save one more, you can be damn sure I’d call the fire department. They’re experts in the field and have vast experience in these matters. I love you. Happy Birthday. pic.twitter.com/uBVkia6N4g — Ryan Reynolds (@VancityReynolds) December 1, 2017\n\nI gave this 3 months. Tops. I was wrong. https://t.co/gxXSdACQ1X — Ryan Reynolds (@VancityReynolds) April 11, 2018\n\nJust don't ask him to stop visiting kids with cancer (yes, people like that exist). When a follower used his movie's R rating, Ryan clapped back, writing, \"Deadpool is Rated R. If my kid went through a fraction of the s--t these kids deal with daily, I think they can watch whatever they like. That’s just my .02 cents.\" So, in a nutshell, Ryan is perfect on (and off) Twitter.", "images": ["https://media.distractify.com/brand-img/Z9IyIo/0x0/ryan-reynolds-tweets-1533659787542-1533659789636.jpg", "https://www.distractify.com/dfy-logo.jpg", "data:,"], "top_img": "https://media.distractify.com/brand-img/Z9IyIo/0x0/ryan-reynolds-tweets-1533659787542-1533659789636.jpg", "keywords": [], "authors": ["Anna Quintana"], "canonical_link": "https://www.distractify.com/entertainment/2018/08/07/Z1kQHMK/ryan-reynolds-on-twitter", "title": "Here's Why Ryan Reynolds Will Always Be Our Favorite Canadian", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "theme-color": "#fceb10", "description": "Everything you need to know about Ryan Reynolds — from Twitter to Blake Lively to his twin brother?", "keywords": "Entertainment,ryan reynolds", "fb": {"app_id": 1587987144602214, "pages": 150323485125149}, "og": {"site_name": "Distractify", "title": "Here's Why Ryan Reynolds Will Always Be Our Favorite Canadian", "url": "https://www.distractify.com/entertainment/2018/08/07/Z1kQHMK/ryan-reynolds-on-twitter", "description": "Sorry not sorry.", "image": "https://media.distractify.com/brand-img/Z9IyIo/0x0/ryan-reynolds-tweets-1533659787542-1533659789636.jpg", "type": "article", "article": {"published_time": "2018-08-07T20:50:48.688Z", "modified_time": "2019-05-07T13:04:22.540Z"}, "locale": "en_US"}, "bt": {"id": "Z1kQHMK", "author": "anna"}, "twitter": {"site": "https://twitter.com/distractify", "card": "summary_large_image", "title": "Here's Why Ryan Reynolds Will Always Be Our Favorite Canadian", "description": "Sorry not sorry.", "image": "https://media.distractify.com/brand-img/Z9IyIo/0x0/ryan-reynolds-tweets-1533659787542-1533659789636.jpg"}}, "movies": [], "publish_date": 1533571200.0, "source": "https://www.distractify.com", "summary": ""}