{"url": "https://en.wikipedia.org/wiki/Gigi_Hadid", "text": "American model\n\nJelena Noura \"Gigi\" Hadid (born April 23, 1995)[3] is an American fashion model.\n\nShe signed to IMG Models in 2013. In November 2014, Hadid made her debut in the Top 50 Models ranking at Models.com.[4] In 2016, she was named International Model of the Year by the British Fashion Council.[5] Over the span of four years, Hadid has made 35 appearances on international Vogue magazine covers.[6]\n\nEarly life\n\nJelena Noura Hadid was born in Los Angeles[7] to real estate developer Mohamed Hadid and former model Yolanda Hadid (née Van den Herik). Her mother is Dutch, and her father is Palestinian.[8] Through her father she claims descent from Daher Al Omer, Prince of Nazareth and the Sheik of Galilee.[9][10] Hadid has two younger siblings, a sister, Bella, and a brother, Anwar, both of whom are also models. She has two older paternal half-sisters, Marielle and Alana.[11][3] In 2013, Hadid graduated from Malibu High School, where she was captain of the varsity volleyball team as well as a competitive horseback rider.[12][13]\n\nFollowing high school, she moved to New York City, to focus on her studies and her modeling career. Hadid studied criminal psychology at The New School beginning in the fall of 2013, but suspended her studies to focus on her modeling career.[14]\n\nCareer\n\n1997–2012: Early work\n\nHadid's modeling career began when she was two years old[15] after being discovered by Paul Marciano, of Guess clothing. She started modeling with Baby Guess before stopping to concentrate on school. Hadid eventually returned to modeling, in 2011.[16] She resumed working with Marciano, and was named the face of a Guess campaign in 2012. Hadid has shot three campaigns with Guess as an adult.[13][17]\n\n2013–2014: Breakthrough\n\nAfter moving to New York City and signing to IMG Models in 2013, Hadid made her New York Fashion Week debut in February 2014 walking for Desigual's show.[18][19] In the same month she got her break in high fashion on the cover of CR Fashion Book magazine.[20] On July 15, 2014, she starred alongside actor and model Patrick Schwarzenegger in fashion designer Tom Ford's Eyewear autumn/winter campaign.[21] She co-hosted the Daily Front Row's Fashion Media Awards event that was held in New York City on September 5, 2014.[22] Hadid has also starred in campaigns for Tom Ford F/W 2014, Tom Ford Velvet Orchard Fragrance and Tom Ford Beauty 2014.[23][24]\n\nShe was on the cover of Galore magazine and Carine Roitfeld's CR Fashion Book in 2014.[25][26][27]\n\n2015–2016: Model of the Year, first American Vogue cover\n\nHadid at the amFAR Gala in 2015\n\nHadid appeared in the 2015 Pirelli calendar.[28] In that same year Hadid, was also the brand ambassador for Australian fashion swimwear label, Seafolly. In January 2015, she was named the Daily Front Row's Model of the Year,[29] and a Maybelline brand ambassador.[30] In March 2015, Hadid and her boyfriend at the time Cody Simpson featured as a part of fashion photographer Mario Testino project called \"Towel Series.\"[31] By May 2015, Hadid had walked for designers including: Marc Jacobs, Chanel, Michael Kors, Jean Paul Gaultier, and Max Mara.[32] Hadid appeared in the music video for Taylor Swift's song \"Bad Blood\", which was released in the same month. Hadid's sister, Bella, is also a model, and the two sisters have been featured together in some modeling appearances. In December 2015, she made her first appearance in the Victoria's Secret Fashion Show.[33]\n\nHadid has appeared on magazine covers including Vogue (United States, Paris, Italy, Britain, Japan, Spain, Australia, Brazil, the Netherlands, Germany, Italy, China), Schön!,[34] Numéro, Allure, W Magazine and Teen Vogue as well as WSJ Magazine, Elle Canada, Dazed and Harper's Bazaar (USA, Malaysia).[35][36][37] Hadid has also shot editorials for VMAN, Elle, Grazia, Cleo, Vogue, Sports Illustrated, Paper magazine, Vanity Fair and V Magazine. Hadid has also starred in campaigns for Guess, Versace, Penshoppe, Balmain F/W 2015, Topshop, Max Mara, and Stuart Weitzman.[38][39][40]\n\nIn 2016, she walked for: Versace, Chanel, Elie Saab, Fendi, Marc Jacobs, Anna Sui, Miu Miu, Balmain, Diane Von Furstenberg, Tommy Hilfiger, Fenty x Puma, Isabel Marant, and Giambattista Valli.[41][42][43][44] In January 2016, she became the global brand ambassador for Tommy Hilfiger, fronting campaigns for underwear, apparel and fragrances.[45] In April 2016, Hadid starred in an interactive campaign including a commercial for the BMW M2.[46] She hosted the 2016 iHeartRadio Much Music Video Awards in Toronto on June 19, 2016.[47] She co-designed a capsule collection with Tommy Hilfiger called Gigi by Tommy Hilfiger which was released in the fall of 2016 at New York Fashion Week.[48] During fall 2016 Fashion Weeks in New York, Milan and Paris, Hadid opened five shows and closed seven.[49] In October her boot collection for Stuart Weitzman titled the Gigi Boot was revealed,[50] and it was announced that Hadid had become a brand ambassador for Reebok, fronting the #PerfectNever campaign.[51]\n\nOn November 20, 2016, Hadid hosted the American Music Awards alongside Saturday Night Live alum Jay Pharoah.[52] She received backlash for an impression of Melania Trump during the show, and later apologized.[53] In December 2016, she made her second appearance at the Victoria's Secret Fashion Show, earning her wings for the first time,[54] and in the same month she won the award for International Model of the Year at the British Fashion Awards, presented to her by Donatella Versace.[5]\n\n2017–present\n\nHadid started off the Spring/Summer campaign season – starring in Fendi and Moschino campaigns.[55] she also was the face of the S/S 2017 campaign for Max Mara accessories, Stuart Weitzman[56] and DSQUARED2.[57] The second Tommy Hilfiger and Gigi Hadid ready-to-wear collection was presented in February 2017 for the Spring season.[58] Hadid was the photographer of the Versus (Versace) Spring Summer 2017 campaign which featured singer Zayn Malik and model Adwoah Aboah.[59] She also photographed a special summer edition of V Magazine titled Gigi's Journal, which featured Polaroids of fashion industry colleagues, celebrities and close friends.[60]\n\nHadid was featured on four March 2017 Vogue covers: United States, Britain, China, and the inaugural Arabia edition.[61][62][63][64] She also appeared on the covers for the CR Fashion Book (Spring/Summer 2017), Jolie (April 2017) and The Daily (Spring 2017).[65][66][67] She featured on the May 2017 covers for the Netherlands editions of Vogue, Cosmopolitan and Glamour as well as the June/July 2017 cover of US Harper's Bazaar.[68][69] Hadid has starred in editorials for Vogue US (April 2017) and LOVE Magazine (Spring/Summer 2017).\n\nHadid scored her second American Vogue cover in August 2017, sharing the cover with her boyfriend at the time, Zayn Malik.[70] During Fall/Winter 2017 Fashion Month in New York, Milan and Paris, Hadid opened the shows for Jeremy Scott, Anna Sui, Versus (Versace), Alberta Ferretti, Missoni, H&M and Balmain; and closed the shows for Isabel Marant, Moschino, Max Mara and Anna Sui. She also released the first season of two new collaborations with Vogue Eyewear and Messika Jewelry.[68] At The Daily Front Row's third annual Fashion Los Angeles Awards, Hadid was honored for the Best Design Debut for her collection with Tommy Hilfiger.[71] She ended 2017 being named one of Glamour Magazine's Woman of the Year, alongside Nicole Kidman, Solange Knowles, Muzoon Almellehan and other.[72]\n\nHadid started 2018 with multiple high fashion campaigns, including Valentino, Moschino, Versace and Fendi. She also went on to release her second collaboration with both Vogue Eyewear and Messika Jewelry.[73] In February, during fashion week she presented the fourth and last season of her capsule collection with Tommy Hilfiger in Milan.\n\nShe appeared on many different international Vogue covers in 2018, including British Vogue in March,[74] Vogue Italia in May and Vogue Brazil in September.[75] She also scored multiple American covers including Harper's Bazaar May issue[76] and V Magazine Fall Preview Cover V114.[77] and W Magazine. She also covered LOVE Magazine (Fall/Winter 2018) 10th Anniversary,[78] Chaos 69, and Chaos True Originals - Disney Special.\n\nShe announced in May 2018, that she will be working closely with Unicef to help children around the world, on August 25 she went on her first mission with Unicef to visit their programing in Bangladesh. The trip fell on the eve of the one-year anniversary of the Rohingya refugee crisis.[79]\n\nIn November 2018, she announced her first collaboration with Reebok designing sneakers for the brand, starting with limited release on December 7 and the full collection to be released later in February 2019.[80] She also returned to Victoria's Secret Fashion Show for the third time in the same month.[81] In early 2019, she appeared on more international Vogue covers, including Vogue Czechoslovakia, Vogue Arabia, and Vogue Hong Kong[82] In late January 2019, Hadid was sued by the independent photo agency business Xclusive for sharing an October 2018 photo of herself without the photographer's permission. The company is seeking damages for copyright infringement, as well as any profits derived from the image. Hadid removed Xclusive's photo from her Instagram page shortly after sharing it, but the suit also alleges this isn't the only instance she has posted unlicensed images. In the documents, Hadid's Instagram account includes at least fifty examples of uncredited photographs of Hadid in public, at press events, or on the runway.[83] This isn't also the first time Hadid is being sued for posting photos of herself on her social media account. In 2017, photographer Peter Cepeda took a photo of her, which she later posted on Instagram without his permission. He filed a lawsuit against her the following September and it was later settled outside of court.[83]\n\nPersonal life\n\nHadid revealed in 2014 that she was diagnosed with Hashimoto's disease, and reiterated this in 2016.[84]\n\nMedia personality Vitalii Sediuk assaulted Hadid in 2016,[85][86] and she was commended on how she defended herself from him.[87][88] In January 2017, after Donald Trump's \"Muslim ban\", Hadid and her sister, Bella, protested among others in New York City.[89]\n\nIn 2017, Hadid attempted to travel to China to participate in the 2017 Victoria's Secret Fashion Show but ultimately could not after her visa was revoked for perceived \"racism\" towards Buddha.[90][91]\n\nGigi publicly dated Cody Simpson from 2013–2015.[92] She appeared in his music video \"Surfboard\".[93] She then began dating English singer Zayn Malik in late 2015.[94] She also appeared in Malik's music video for \"Pillowtalk\". They appeared together on the August 2017 cover of Vogue.[95] Malik and Hadid are the third couple to appear together on a Vogue cover, which courted controversy because of Vogue misnaming them as gender fluid, for which Vogue apologized.[96] They also did a Versus (Versace) campaign as a couple, with Hadid as the photographer.[97][98] They broke up in March 2018, then reconciled in June 2018.[99][100] They split up again in November 2018;[101] only to reunite in December 2019.[102]\n\nFilmography\n\nFilm and television\n\nMusic videos\n\nMusic\n\nAwards and nominations\n\nSee also", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Gigi_Hadid_Met_Gala_2017.jpg/170px-Gigi_Hadid_Met_Gala_2017.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/9/91/Gigi_Hadid._2015.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/BathingSuit1920s.jpg/32px-BathingSuit1920s.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Gigi_Hadid_amFAR_2015.png/170px-Gigi_Hadid_amFAR_2015.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/AnnaSui-FW17RTW-Hadids-BW_%28cropped%29.jpg/170px-AnnaSui-FW17RTW-Hadids-BW_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Gigi_Hadid._2015.jpg/220px-Gigi_Hadid._2015.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/9/91/Gigi_Hadid._2015.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Gigi_Hadid", "title": "Gigi Hadid", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/9/91/Gigi_Hadid._2015.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}