{"url": "https://www.rollingstone.com/music/music-country/maren-morris-talks-las-vegas-shooting-response-song-dear-hate-122398/", "text": "On Monday morning, Maren Morris woke up to 50 text messages from friends and family. Two nights after Morris had performed on the main stage at Las Vegas’ Route 91 Harvest Festival, loved ones were frantically trying to reach her: Did she make it home OK? Was everyone she knew safe? Then, the singer started to read the news: the previous evening, after she had gone to bed, and in front of the very same stage on which she had performed, the deadliest mass shooting in modern American history had taken place.\n\n“I felt this sick pit in my stomach,” Morris tells Rolling Stone. “I had been there the night before and, reading that the shooter had checked into the hotel Thursday, he could have picked any of the days of the festival to carry out this horrific plan. It gives you a bit of survivor’s guilt.”\n\nMorris’ Saturday evening performance, which took place just before Sam Hunt’s headlining set, had been one of the most feel-good shows she’d played all year. “The festival was so fun and well-organized. It was very secure, it felt so safe to be there, and it was one of the favorite festivals I’ve played. You couldn’t even see the edge of the crowd, it was that big. It sounds cliche I guess, but it just seemed like the least likely place where something this tragic could go down.”\n\nFeeling paralyzed with guilt and sick with inaction, Morris then thought of a song she had written more than two years earlier, just two days after the 2015 Charleston, South Carolina, church shooting. “It was a really emotional day to write that song,” Morris says. The song, “Dear Hate,” was a prayer of belief in the power of healing and hope in the face of obscene violence. “I’ve had the song in my pocket for the last few years and I never knew when to release it,” says Morris. “I wanted to be precious with it because it is such a sensitive subject. It’s just insane how relevant the message still is today. “\n\nLast year, Morris sent the song to Vince Gill to see if the legendary singer would like to record a vocal for the track. “He immediately called me and said he was on board and did the whole thing for free.” Less than 24 hours after Morris has released “Dear Hate” – a portion of the proceeds of which she will be donating to the Music City Cares fund for victims in Las Vegas – the song has racked up more than 500,000 plays on YouTube.\n\nLike so many artists who performed at Route 91, Morris is still recovering. “I’m trying not to think too far into it because when things like this happen it does make you start to fear and second guess going on stage. You just don’t know what can happen. But I also think this is a time when as artists and fans and music lovers in general, we can band together and not stop going to shows, going to festivals, going to concerts. The biggest thing we can do besides donating money and donating blood is not being afraid to still enjoy live music.”\n\nAs for the song’s message, Morris is convinced that even in today’s polarized world of social media vitriol, her “song of hope and love and kindness” is surely something on which everyone can agree.\n\n“The song is really not partisan, it’s just about bringing love and kindness to the world,” says the singer. “I’m staring at all the facets of hatred, the horrific things that have happened throughout history. In the last couple of years, especially, it just feels like we’ve been bashed over the head with horrible headlines.”\n\nDespite its nonpartisan message, Morris says that releasing the song, which references the Selma Bridge and the assassination of JFK, represents a transformational point for the singer. “Hate is everywhere, and I’m sick of not doing enough,” she explained on Instagram.\n\nIndeed, Morris believes strongly that the tragedy in Las Vegas needs to inspire debates and conversations on the issue of guns, which up until now has traditionally been a third-rail topic of public discussion in country music.\n\n“I think there always needs to be conversations about that,” she says. “I can’t really speak on everything because I know they’re still confirming so many details, but I do feel more awake, and I hope that the rest of the world is too because there’s clearly a problem. While we are still mourning and in shock right now, those questions are all being asked, which I do think is a slight silver lining through everything. I hope that we take action to figure out how to prevent this from ever happening again.”", "images": ["https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-846257782-9c86350d-06d0-49a5-a3f7-b2ce9c7b4b98.jpg", "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/build/images/_dev/flag-country.png", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fmusic%2Fmusic-country%2Fmaren-morris-talks-las-vegas-shooting-response-song-dear-hate-122398%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=122398", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-846257782-9c86350d-06d0-49a5-a3f7-b2ce9c7b4b98.jpg", "keywords": [], "authors": ["Jonathan Bernstein", "Jonathan Bernstein'S Most Recent Stories", "Teenage Dirtbag", "Courtney Marie Andrews Meditates On Loss In Delicate New Song", "Burlap String", "Hear Memphis Soul Veteran Don Bryant S Yearning New", "Is It Over", "View All"], "canonical_link": "https://www.rollingstone.com/music/music-country/maren-morris-talks-las-vegas-shooting-response-song-dear-hate-122398/", "title": "Maren Morris Talks Las Vegas Shooting, Response Song ‘Dear Hate’", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "Maren Morris discusses her new song \"Dear Hate,\" released in the aftermath of the Las Vegas shooting.", "news_keywords": "Las Vegas, Maren Morris", "og": {"type": "article", "title": "Maren Morris Talks Las Vegas Shooting, Response Song 'Dear Hate'", "url": "https://www.rollingstone.com/music/music-country/maren-morris-talks-las-vegas-shooting-response-song-dear-hate-122398/", "description": "“I felt this sick pit in my stomach,” says the “My Church” singer, who performed at Route 91 two days before the massacre", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-846257782-9c86350d-06d0-49a5-a3f7-b2ce9c7b4b98.jpg", "width": 1024, "height": 683, "alt": "Maren Morris"}, "locale": "en_US"}, "article": {"published_time": "2017-10-03T19:06:00+00:00", "modified_time": "2018-06-25T13:47:43+00:00"}, "twitter": {"text": {"title": "Maren Morris Talks Las Vegas Shooting, Response Song 'Dear Hate'"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-846257782-9c86350d-06d0-49a5-a3f7-b2ce9c7b4b98.jpg?w=1024", "alt": "Maren Morris"}, "card": "summary_large_image", "site": "@RollingStone", "title": "Maren Morris Talks Las Vegas Shooting, Response Song ‘Dear Hate’", "description": "Maren Morris discusses her new song \"Dear Hate,\" released in the aftermath of the Las Vegas shooting."}, "generator": "WordPress 5.4", "author": "Jonathan Bernstein", "content_type": "Article", "post_id": 122398, "title": "Maren Morris Talks Las Vegas Shooting, Response Song 'Dear Hate'", "published_at": "2017-10-03 19:06:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-846257782-9c86350d-06d0-49a5-a3f7-b2ce9c7b4b98.jpg?w=1024", "comment_count": 0, "tags": "Maren Morris", "topics": "Country Music", "body": "On Monday morning, Maren Morris woke up to 50 text messages from friends and family. Two nights after Morris had performed on the main stage at Las Vegas' Route 91 Harvest Festival, loved ones were frantically trying to reach her: Did she make it home OK? Was everyone she knew safe? Then, the singer started to read the news: the previous evening, after she had gone to bed, and in front of the very same stage on which she had performed, the deadliest mass shooting in modern American history had taken place.\"I felt this sick pit in my stomach,\" Morris tells Rolling Stone. \"I had been there the night before and, reading that the shooter had checked into the hotel Thursday, he could have picked any of the days of the festival to carry out this horrific plan. It gives you a bit of survivor's guilt.\"Morris' Saturday evening performance, which took place just before Sam Hunt's headlining set, had been one of the most feel-good shows she'd played all year. \"The festival was so fun and well-organized. It was very secure, it felt so safe to be there, and it was one of the favorite festivals I've played. You couldn't even see the edge of the crowd, it was that big. It sounds cliche I guess, but it just seemed like the least likely place where something this tragic could go down.\" Feeling paralyzed with guilt and sick with inaction, Morris then thought of a song she had written more than two years earlier, just two days after the 2015 Charleston, South Carolina, church shooting. \"It was a really emotional day to write that song,\" Morris says. The song, \"Dear Hate,\" was a prayer of belief in the power of healing and hope in the face of obscene violence. \"I've had the song in my pocket for the last few years and I never knew when to release it,\" says Morris. \"I wanted to be precious with it because it is such a sensitive subject. It's just insane how relevant the message still is today. \"Last year, Morris sent the song to Vince Gill to see if the legendary singer would like to record a vocal for the track. \"He immediately called me and said he was on board and did the whole thing for free.\" Less than 24 hours after Morris has released \"Dear Hate\" – a portion of the proceeds of which she will be donating to the Music City Cares fund for victims in Las Vegas – the song has racked up more than 500,000 plays on YouTube. Like so many artists who performed at Route 91, Morris is still recovering. \"I'm trying not to think too far into it because when things like this happen it does make you start to fear and second guess going on stage. You just don't know what can happen. But I also think this is a time when as artists and fans and music lovers in general, we can band together and not stop going to shows, going to festivals, going to concerts. The biggest thing we can do besides donating money and donating blood is not being afraid to still enjoy live music.\"As for the song's message, Morris is convinced that even in today's polarized world of social media vitriol, her \"song of hope and love and kindness\" is surely something on which everyone can agree.\"The song is really not partisan, it's just about bringing love and kindness to the world,\" says the singer. \"I'm staring at all the facets of hatred, the horrific things that have happened throughout history. In the last couple of years, especially, it just feels like we've been bashed over the head with horrible headlines.\"Despite its nonpartisan message, Morris says that releasing the song, which references the Selma Bridge and the assassination of JFK, represents a transformational point for the singer. \"Hate is everywhere, and I'm sick of not doing enough,\" she explained on Instagram.Indeed, Morris believes strongly that the tragedy in Las Vegas needs to inspire debates and conversations on the issue of guns, which up until now has traditionally been a third-rail topic of public discussion in country music.\"I think there always needs to be conversations about that,\" she says. \"I can't really speak on everything because I know they're still confirming so many details, but I do feel more awake, and I hope that the rest of the world is too because there's clearly a problem. While we are still mourning and in shock right now, those questions are all being asked, which I do think is a slight silver lining through everything. I hope that we take action to figure out how to prevent this from ever happening again.\"", "onesignal": "wordpress-plugin"}, "movies": ["https://www.youtube.com/embed/tUPR5-igTVY"], "publish_date": 1507057560.0, "source": "https://www.rollingstone.com", "summary": ""}