{"url": "people.com/celebrity/famous-cousins-melissa-mccarthy-jenny-mccarthy-and-other-stars-who-are-related/", "text": "Image zoom Noam Galai/WireImage; Steve Granitz/WireImage\n\nThe worst part of being a celebrity, undoubtedly, must be family reunions. All those cousins coming out of the woodwork, asking you to pass along their script or snag an autograph or even help Aunt Agatha buy that new hot tub that she desperately needs.\n\nThen there are those happy few stars who don’t have to face this problem. Because their cousins are famous, too.\n\nGet push notifications with news, features and more.\n\nIn honor of Cousins Day – July 24, to be exact – here are several celebrity cousins who don’t have to worry about being the only famous person at their family reunion.\n\nJenny McCarthy and Melissa McCarthy\n\n\n\nYou couldn’t ask for a better cousin than Jenny McCarthy. Back in the ’90s, The View host helped older cousin Melissa land her first TV role as a guest star in the former’s short-lived sitcom.\n\nNow that both McCarthy girls have cemented their places in Hollywood, she’s spoken out against criticism of Melissa on multiple occasions.\n\nTom Cruise and William Mapother\n\n\n\nOnce you know that Tom Cruise‘s real name is “Thomas Mapother,” suddenly the resemblance between the A-lister and his character-actor cousin becomes a lot more apparent. (Look at their chins!)\n\nMapother has acted in five films with Cruise – Born on the Fourth of July, Magnolia, Mission: Impossible II, Vanilla Sky and Minority Report – but to us, he’ll always be Ethan, the duplicitous member of the Others from Lost.\n\nSofia Coppola, Jason Schwartzman and Nicolas Cage\n\n\n\nComposer Carmine Coppola unwittingly spawned a Hollywood dynasty: His son Francis became the famed director of The Godfather and Apocalypse Now, while his daughter Talia Shire starred as Adrian in the Rocky movies.\n\nDecades later, the second generation of Coppola cousins has gotten mixed up in the family business: Frances’s daughter Sofia and Talia’s son Jason have each followed in their parents’ footsteps, while their cousin Nicolas (son of the comparatively unknown August Coppola) took a new name from one of his favorite superheroes and became the Internet’s One True God.\n\nOther Coppola cousins in the entertainment industry include Sofia’s older brother Roman, who co-wrote The Darjeeling Limited and Moonrise Kingdom, and Jason’s younger brother Robert, lead singer of the band Rooney.\n\nGwyneth Paltrow and Katherine Moennig\n\n\n\nEven before she came to fame on The L Word, actress Katherine Moennig was haunted by questions about her blonder, goopier cousin.\n\nAs a 2000 New York Observer profile observed, when asked about Gwyneth, “a wary look crossed Ms. Moennig’s eyes and her facial muscles seemed to freeze up.”\n\nLater, she revealed a certain gratefulness for their lack of resemblance: “We’re totally different people. We look very different, too No one’s judging me solely on the fact that I am her cousin.”\n\nSnoop Dogg and Brandy\n\n\n\nThis is one of those facts that you feel a lot more people should know than they do. We’re talking two of the most famous musicians to come out of the ’90s!\n\nAlthough perhaps that would have made it weird for them to collaborate on a love song, as they did on Snoop’s “Special.”\n\nGary LeVox and Jay DeMarcus\n\n\n\nThough they’re only second cousins, LeVox and DeMarcus probably hang out more than most of the relatives on this list. They have to – they’re two of the three members of the country group Rascal Flatts!\n\nDamon Dash and Stacey Dash\n\n\n\nMaybe we’re mixing him up with Reverend Run, but we’d always sort of assumed “Damon Dash” was not the name the former Roc-A-Fella Records honcho was born with. But it was!\n\nWhen you realize that your whole perspective was whack, it makes more sense that he’s cousins with Clueless‘s Stacey Dash.\n\nMelissa Gorga and Ralph Macchio\n\n\n\nCousins often enjoy different levels of success at different points in their lives, but the comparison is striking in the case of these two relatives.\n\nMelissa Gorga was just a child when her cousin Ralph Macchio shot to fame in The Karate Kid – years later, he was working as a guest actor on shows like Psych and How I Met Your Mother when an all-grown-up Gorga became a cast member on The Real Housewives of New Jersey.\n\nK-Ci & JoJo and Fantasia Barrino\n\n\n\nAll their lives, brothers Cedric “K-Ci” and Joel “JoJo” Hailey have been cousins with American Idol winner Fantasia Barrino.\n\nThe trio haven’t officially recorded together, but K-Ci did show up at a Fantasia concert to duet on “Nobody Greater” with his younger cuz.\n\nKyra Sedgwick and Edie Sedgwick\n\n\n\nIf someone asks you to explain the concept of first cousins once removed, just tell them, “It’s like Edie Sedgwick and Kyra Sedwick!” (Edie’s father was the younger brother of Kyra’s grandfather.)\n\nBrooke Shields and Glenn Close\n\n\n\nLikewise, next time someone asks you how to explain the concept of second cousins once removed to them, just tell them, “It’s like Brooke Shields and Glenn Close!” (Shields’s great-grandmother was the sister of Close’s grandfather.)\n\nThe difference? You have probably met most of your first cousins once removed, at least once or twice (unless your parents hated their cousins). You probably haven’t met many of your second cousins once removed.\n\nQueen Elizabeth and Prince Philip\n\n\n\nIt’s safe to say that the royal families of Europe have different relationships with their cousins than the rest of us.\n\nTake, for example, Queen Elizabeth II and her husband Prince Philip, who are distant cousins.\n\nThat actually understates the complexity of their bloodlines, as Elizabeth and Philip are, in fact, related to each other twice.\n\nNot only are the couple each great-great-grandchildren of Queen Victoria, making them third cousins, they also share an ancestor in Christian IX of Denmark, who was Phillip’s great-grandfather and Elizabeth’s great-great-grandfather, thus making them second cousins once removed. (Like Brooke Shields and Glenn Close!)\n\nLike we said, royals are different.\n\nFranklin Delano Roosevelt and Eleanor Roosevelt\n\n\n\nBefore you snicker at the Queen, remember that America’s rulers aren’t any strangers to marrying their cousins, either.\n\nYes, Eleanor Roosevelt may have only been FDR’s fifth cousin once removed, and yes, she may have been more closely related to the other Roosevelt president (she was Teddy’s niece), but still – her maiden name was Roosevelt!\n\nYou could say the future president was just following in the family tradition, though; his own parents were sixth cousins.\n\nRELATED: See Jenny McCarthy and More Stars in Vintage Family Pics\n\n[IMAGE” “” “” “0” ]\n\nYou Have to Watch Our Favorite Melissa McCarthy Moments of All Time", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2075'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2014%2F07%2Fjenny-mccarthy-600x450-3.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=600&h=314&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2014%2F07%2Fjenny-mccarthy-600x450-3.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=600&h=314&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2014%2F07%2Fjenny-mccarthy-600x450-3.jpg", "keywords": [], "authors": ["Nate Jones"], "canonical_link": "https://people.com/celebrity/famous-cousins-melissa-mccarthy-jenny-mccarthy-and-other-stars-who-are-related/", "title": "Famous Cousins: Melissa McCarthy, Jenny McCarthy and Other Stars Who Are Related", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Brandy,Brooke Shields,Fantasia Barrino,Glenn Close,Gwyneth Paltrow,Jenny McCarthy,Kyra Sedgwick,Melissa McCarthy,Nicolas Cage,Prince Philip,Queen Elizabeth,Ralph Macchio,Rascal Flatts,Snoop Dogg,Stacey Dash,Tom Cruise.", "news_keywords": "Brandy,Brooke Shields,Fantasia Barrino,Glenn Close,Gwyneth Paltrow,Jenny McCarthy,Kyra Sedgwick,Melissa McCarthy,Nicolas Cage,Prince Philip,Queen Elizabeth,Ralph Macchio,Rascal Flatts,Snoop Dogg,Stacey Dash,Tom Cruise.", "description": "Some lucky stars don't have to deal with being the only celebrity at their family reunion", "og": {"title": "Famous Cousins: Melissa McCarthy, Jenny McCarthy and Other Stars Who Are Related", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/celebrity/famous-cousins-melissa-mccarthy-jenny-mccarthy-and-other-stars-who-are-related/", "description": "The worst part of being a celebrity, undoubtedly, must be family reunions. All those cousins coming out of the woodwork, asking you to pass along&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=600&h=314&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2014%2F07%2Fjenny-mccarthy-600x450-3.jpg", "width": 600, "height": 314}}, "pinterest": {"url": "https://people.com/celebrity/famous-cousins-melissa-mccarthy-jenny-mccarthy-and-other-stars-who-are-related/", "description": "Some lucky stars don't have to deal with being the only celebrity at their family reunion", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2014%2F07%2Fjenny-mccarthy-600x450-3.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/celebrity/famous-cousins-melissa-mccarthy-jenny-mccarthy-and-other-stars-who-are-related/", "title": "Famous Cousins: Melissa McCarthy, Jenny McCarthy and Other Stars Who Are Related", "description": "Some lucky stars don't have to deal with being the only celebrity at their family reunion", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=600&h=314&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2014%2F07%2Fjenny-mccarthy-600x450-3.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}