{"url": "www.flare.com/tv-movies/netflix-canada-march-2018/", "text": "Further proof that just staying in is the best\n\nPardon me but it’s almost March and you know what that means: spring is about to get sprung, y’all! What better time to harvest the newest crop of TV shows and movies with your virtual bestie, Netflix Canada? From some of our literal fave movies ever (yes, we’re 100-percent referring to all the Fast and the Furious flicks) to much-anticipated new seasons of the best and most addictive series (like Season 2 of Santa Clarita Diet and Season 3 of Love, duh), the goodies coming to Netflix Canada in March are the next best thing to actually leaving the house and experiencing life, because, like, we need to ease back into it after the winter, no? Here’s your complete list of all the movies and TV shows coming (like Season 2 of Marvel’s Jessica Jones) and going (like our guiltiest pleasure, Will Ferrell and Mark Wahlberg’s Daddy’s Home—don’t @ us) on Netflix Canada March 2018.\n\nMarch 1:\n\n2 Fast 2 Furious\n\nCast: Paul Walker, Tyrese Gibson\n\nSynopsis: Former cop, Brian O’Conner, is called upon to bust a dangerous criminal, and he recruits the help of a former childhood friend and street racer who has a chance to redeem himself.\n\nAdel Karam: Live from Beirut (Netflix Original)\n\nCast: Adel Aram\n\nSynopsis: From Casino du Liban, Lebanese actor and comedian Adel Karam delivers punchlines on everything from kissing and colonoscopies to a porn star named Rocco.\n\nCasino\n\nCast: Robert DeNiro, Sharon Stone, Joe Pesci\n\nSynopsis: A tale of greed, deception, money, power and murder occur between two best friends as a mafia enforcer and a casino executive compete against each other over a gambling empire (and a fast-living socialite).\n\nFast & Furious\n\nCast: Vin Diesel, Paul Walker, Michelle Rodriguez\n\nSynopsis: Brian O’Conner, back working for the FBI in Los Angeles, teams up with Dominic Toretto to bring down a heroin importer by infiltrating his operation.\n\nFast Five\n\nCast: Vin Diesel, Paul Walker, Dwayne Johnson\n\nSynopsis: Dominic Toretto and his crew of street racers plan a massive heist to buy their freedom while in the sights of a powerful Brazilian drug lord and a dangerous federal agent.\n\nLove Beats Rhymes\n\nCast: Azealia Banks, Jill Scott, Lucien Laviscount, Hana Mae Lee, Common\n\nSynopsis: After enrolling in a college poetry course, a struggling rapper finds inspiration for her new voice through slam poetry.\n\nRuPaul’s Drag Race, Season 9\n\nCast: RuPaul\n\nSynopsis: Contestants compete to win $100,000 and the title of America’s Next Drag Superstar in a season filled with big surprises and even bigger guest judges.\n\nSisters\n\nCast: Amy Poehler, Tina Fey, Maya Rudolph, Ike Barinholtz, James Brolin\n\nSynopsis: When their parents decide to sell the house they grew up in, sisters Kate and Maura host one final booze-fuelled blast with their high school friends.\n\nSleeping With Other People\n\nCast: Jason Sudeikis, Alison Brie\n\nSynopsis: A good-natured womanizer and a serial cheater form a platonic relationship until a mutual attraction sets in.\n\nSteve Jobs\n\nCast: Michael Fassbender, Kate Winslet, Seth Rogen\n\nSynopsis: Steve Jobs takes us behind the scenes of the digital revolution to paint a portrait of the man at its epicenter. The story unfolds backstage at three iconic product launches, ending in 1998 with the unveiling of the iMac.\n\nStomp the Yard\n\nCast: Columbus Short, Meagan Good, Ne-Yo\n\nSynopsis: After the death of his brother, an expert street dancer goes to Georgia to attend Truth University. But his efforts to get an education and woo the girl he likes are sidelined when he joins in his fraternity’s effort to win a step dancing competition.\n\nThe Fast and the Furious\n\nCast: Vin Diesel, Paul Walker\n\nSynopsis: Los Angeles police officer Brian O’Connor must decide where his loyalty really lies when he becomes enamoured with the street racing world he has been sent undercover to destroy.\n\nThe Fast and the Furious: Tokyo Drift\n\nCast: Lucas Black, Zachery Ty Bryan, Shad Moss\n\nSynopsis: A teenager becomes a major competitor in the world of drift racing after moving in with his father in Tokyo to avoid a jail sentence in America.\n\nThe Forest\n\nCast: Natalie Dormer, Eoin Macken, Stephanie Vogt\n\nSynopsis: A woman goes into Japan’s Suicide Forest to find her twin sister and confronts supernatural terror.\n\nThe Rundown\n\nCast: Dwayne Johnson, Seann William Scott, Christopher Walken\n\nSynopsis: A tough aspiring chef is hired to bring home a mobster’s son from the Amazon but becomes involved in the fight against an oppressive town operator and the search for a legendary treasure.\n\nThe Tale of Despereaux\n\nCast: Matthew Broderick, Emma Watson, Dustin Hoffman\n\nSynopsis: An unusually brave mouse helps to restore happiness to a forlorn kingdom after making friends with a gentleman rat.\n\nTrue to the Game\n\nCast: Columbus Short, Vivica Fox\n\nSynopsis: A charismatic drug lord tries to start a new life after he falls for a young woman from Philadelphia.\n\nMarch 2:\n\nGirls Incarcerated, Season 1 (Netflix Original)\n\nSynopsis: This documentary series follows the lives of teenage girls housed in a maximum security juvenile detention centre.\n\nVoltron: Legendary Defender, Season 5 (Netflix Original)\n\nCast: Jeremy Shada, Tyler Labine, Bex Taylor-Klaus, Josh Keaton, Steven Yeun\n\nSynopsis: In an effort to take down the Galra, the Paladins enter into an uneasy alliance that could bring the peace they’ve long desired—or doom them forever.\n\nMarch 3:\n\nThe Stanford Prison Experiment\n\nCast: Ezra Miller, Tye Sheridan, Billy Crudup\n\nSynopsis: In 1971, 24 male students are selected to take on randomly assigned roles of prisoners and guards in a mock prison situated in the basement of the Stanford psychology building.\n\nMarch 4:\n\nExpedition China\n\nCast: Maggie Q\n\nSynopsis: Expedition China invites you on location in some of the world’s most intense, hard-to-reach environments with the filmmakers of Disneynature’s big-screen adventure Born in China.\n\nThe Joel McHale Show with Joel McHale, Season 1 (Weekly Episodes every Sunday, Netflix Original)\n\nSynopsis: Trending news, pop culture, social media, original videos and more come together in host Joel McHale’s new weekly comedy commentary show.\n\nMarch 5:\n\nBroadchurch, Season 3\n\nCast: David Tennant, Olivia Colman\n\nSynopsis: The murder of a young boy in a small coastal town brings a media frenzy which threatens to tear the community apart.\n\nThe Brothers Grimm\n\nCast: Matt Damon, Heath Ledger, Monica Bellucci, Lena Headey, Peter Stormare\n\nSynopsis: Brothers Jake and Will Grimm travel from village to village, posing as exterminators of magical creatures. But in reality, they’re expert con artists.\n\nMarch 6:\n\nBorderliner: Season 1 (Netflix Original)\n\nCast: Tobias Santelmann, Ellen Dorrit Petersen, Benjamin Helstad\n\nSynopsis: To protect his family, a police detective covers up a murder case. But when his partner suspects foul play, he is trapped in a dangerous game.\n\nThe Brothers Grimsby\n\nCast: Sacha Baron Cohen, Mark Strong, Rebel Wilson\n\nSynopsis: A new assignment forces a top spy to team up with his football hooligan brother.\n\nBenji (1974)\n\nCast: Peter Breck, Deborah Walley, Patsy Garrett\n\nSynopsis: After lovable abandoned mutt Benji is adopted by a kind family, he chases cats, flirts with a show dog and bravely helps to rescue two abducted kids.\n\nBenji: Off the Leash\n\nCast: Nick Whitaker, Chris Kendrick, Nate Bynum\n\nSynopsis: Young Colby rescues a puppy from his abusive dog-breeding stepfather, Hatchett. Under Colby’s care, the canine grows up to be Benji.\n\nBlack Lighting, Season 1 (Weekly Episodes from March 6, Netflix Original)\n\nCast: Cress Williams, James Remar, Marvin ‘Krondon’ Jones III, Jill Scott, China Anne McClain\n\nSynopsis: A retired vigilante leaves behind his quiet life as a school principal and returns to fighting crime in his New Orleans community.\n\nFor the Love of Benji\n\nCast: Patsy Garrett, Benji, Art Vasil\n\nSynopsis: Benji sniffs out a bogus CIA agent in Athens, Greece.\n\nGad Elmaleh: American Dream (Netflix Original)\n\nSynopsis: In his first English-language stand-up special, French superstar Gad Elmaleh riffs on the perks, perils and bewildering quirks of life in the U.S.\n\nMarch 8:\n\nMarvel’s Jessica Jones, Season 2 (Netflix Original)\n\nCast: Krysten Ritter, David Tennant, Rachael Taylor, Mike Colter, Carrie-Anne Moss\n\nSynopsis: Jessica grapples with more demons from her past as she hunts down the source of her powers and faces off with a mysterious killer.\n\nLadies First (Netflix Original)\n\nCast: Uraaz Bahl\n\nSynopsis: Born amid poverty and limited women’s rights in the village of Ratu, India, Deepika Kumari rose to become the no.1 female archer in the world at 18.\n\nRiverdale, Season 2 (Weekly Episodes as of March 8, Netflix Original)\n\nCast: KJ Apa, Cole Sprouse, Lili Reinhart, Camila Mendes, Madelaine Petsch\n\nSynopsis: If Jason Blossom’s murder revealed the slimy underbelly beneath Riverdale’s surface, the shooting of Fred Andrews threatens to plunge the entire town into utter darkness.\n\nMarch 9:\n\nCollateral: Limited Series (Netflix Original)\n\nCast: Carey Mulligan, John Simm, Nicola Walker, Billie Piper, Nathaniel Martello-White\n\nSynopsis: A London detective probes the seemingly random murder of a pizza delivery man, suspecting it’s connected to a larger conspiracy.\n\nNailed It: Season 1 (Netflix Original)\n\nSynopsis: Home bakers with a terrible track record take a crack at re-creating edible masterpieces for a $10,000 prize. It’s part reality contest, part hot mess.\n\nLove: Season 3 (Netflix Original)\n\nCast: Gillian Jacobs, Paul Rust, Claudia O’Doherty, Mike Mitchell\n\nSynopsis: As Mickey and Gus take big leaps in their personal and professional lives, they struggle to keep their self-sabotaging impulses in check.\n\nMy Next Guest Needs No Introduction With David Letterman: Malala Yousafzai (Netflix Original)\n\nCast: David Letterman, Malala Yousafzai\n\nSynopsis: David Letterman returns in a monthly series of in-depth interviews with globally relevant personalities, plus field segments expressing his curiosity.\n\nThe Outsiders (Netflix Film)\n\nCast: Jared Leto, Tadanobu Asano, Kippei Shîna\n\nSynopsis: An American soldier imprisoned in postwar Japan enters the dark world of the yakuza, adopting their way of life in repayment for his freedom.\n\nTransformers: The Last Knight\n\nCast: Mark Wahlberg, Anthony Hopkins, Josh Duhamel\n\nSynopsis: Autobots and Decepticons are at war, with humans on the sidelines. Optimus Prime is gone. The key to saving our future lies buried in the secrets of the past within the hidden history of Transformers on Earth.\n\nTrolls: The Beat Goes On!, Season 2 (Netflix Original)\n\nSynopsis: As Queen Poppy welcomes a new time of peace in Troll Village with parties, sports and holiday celebrations, Branch tries to be more fun-loving.\n\nWind River\n\nCast: Jeremy Renner, Elizabeth Olsen\n\nSynopsis: A veteran tracker with the Fish and Wildlife Service helps to investigate the murder of a young Native American woman and uses the case as a means of seeking redemption for an earlier act of irresponsibility which ended in tragedy.\n\nMarch 12:\n\nKygo: Live at the Hollywood Bowl\n\nCast: Kygo, G-Eazy\n\nSynopsis: Join Norwegian electronic music superstar Kygo onstage and behind the scenes as he performs at the famed L.A. venue with a bevy of special guests.\n\nTroy: The Odyssey\n\nCast: Dylan Vox, Lara Heller, Hachem Hicham\n\nSynopsis: An action film based on the Epic Greek Poem as sung by Homer.\n\nWhat to Expect When You’re Expecting\n\nCast: Cameron Diaz, Jennifer Lopez, Elizabeth Banks, Brooklyn Decker\n\nSynopsis: Follow the lives of five interconnected couples as they experience the thrills and surprises of having a baby and realize that no matter what you plan for, life does not always deliver what is expected.\n\nMarch 13:\n\nStretch Armstrong: The Breakout (Netflix Original)\n\nSynopsis: Every villain the Flex Fighters have defeated escapes from Rook Tower, and it’s up to our heroes to save Charter City.\n\nSt. Vincent\n\nCast: Bill Murray, Melissa McCarthy, Naomi Watts\n\nSynopsis: A young boy whose parents have just divorced finds an unlikely friend and mentor in the misanthropic, bawdy, hedonistic war veteran who lives next door.\n\nRicky Gervais: Humanity (Netflix Original)\n\nCast: Ricky Gervais\n\nSynopsis: Ricky Gervais returns to the stage in London with a scathing special that touches on aging, becoming spoiled, his perspective on having kids and more.\n\nTerrace House: Opening New Doors: Part 1 (Netflix Original)\n\nCast: Regina Triendly, Yoshimi Tokui, Azousa Babazono, Ryota Yamasato\n\nSynopsis: A group of young people—including a chef, a snowboarder and an ice hockey player —gather in the Karuizawa woods while pursuing their dreams.\n\nMarch 15:\n\nBefore the Flood\n\nCast: Leonardo Dicaprio\n\nSynopsis: Leonardo DiCaprio crisscrosses the globe to investigate the consequences of man-made global warming and the measures being taken to reverse it.\n\nTabula Rasa: Season 1 (Netflix Original)\n\nCast: Veerle Baetens, Stijn Van Opstal, Jeroen Perceval\n\nSynopsis: When a young woman with amnesia becomes a key figure in a missing persons case, she must reconstruct her memories to clear her name and solve the case.\n\nThe Hollywood Masters, Season 2\n\nSynopsis: The Hollywood icons who light up this instalment of the insightful live interview series include Jane Fonda, Hans Zimmer and Kenneth Branagh.\n\nMarch 16:\n\nBenji (Netflix Film)\n\nCast: Gabriel Bateman, Darby Camp, Kiele Sanchez, Jerod Haynes, Gralen Bryant Banks\n\nSynopsis: A determined dog comes to the rescue and helps heal a broken family when a young boy and his sister stumble into some serious danger.\n\nEdha: Season 1 (Netflix Original)\n\nCast: Antonio Birabent, Sophia Castiglione, Ana Celentano\n\nSynopsis: Revenge, passion and dark secrets push a successful fashion designer and single mother to her limits when she meets a handsome young immigrant.\n\nHitman’s Bodyguard\n\nCast: Ryan Reynolds, Samuel L. Jackson, Gary Oldman\n\nSynopsis: The world’s top bodyguard gets a new client, a hitman who must testify at the International Criminal Court. The two are forced to put their differences aside and work together to make it to the trial on time.\n\nOn My Block, Season 1 (Netflix Original)\n\nCast: Sierra Capri, Ronni Hawk, Brett Gray\n\nSynopsis: This comedy series follows a diverse group of teenage friends as they confront the challenges of growing up in gritty inner-city Los Angeles.\n\nSpirit Riding Free, Season 4 (Netflix Original)\n\nSynopsis: Exciting new adventures await Lucky and her friends on the frontier in a fourth season filled with fun and discovery.\n\nTake Your Pills (Netflix Original)\n\nSynopsis: The use of prescription stimulants like Adderall as performance enhancing drugs is on the rise. This documentary explores what’s driving this trend.\n\nThe Legacy of a Whitetail Deer Hunter (Netflix Film)\n\nCast: Josh Brolin, Danny McBride, Montana Jordan, Scoot McNairy, Carrie Coon\n\nSynopsis: Sixth-grader Jaden goes on a hunting trip that’s meant to be a bonding experience with his father even though it’s the last thing he wants to do.\n\nWild Wild Country, Season 1 (Netflix Original)\n\nSynopsis: A documentary series about a controversial cult leader who built a utopian city in the Oregon desert and the conflict with the locals that escalated into a national scandal.\n\nMarch 20:\n\nThe Standups, Season 2 (Netflix Original)\n\nSynopsis: Comedians Rachel Feinstein, Kyle Kinane, Joe List, Brent Morin, Aparna Nancherla and Gina Yashere take the stage in Season 2 of the showcase series.\n\nMarch 21:\n\nBob the Builder: Mega Machines\n\nSynopsis: Bob and his team get together with the Mega Machines to build a new dam and reservoir for Spring City—but are they up to this mega challenge?\n\nMarch 23:\n\nAlexa & Katie: Season 1 (Netflix Original)\n\nCast:Finn Carr, Tiffani Thiessen, Emery Kelly\n\nSynopsis: Alexa is battling cancer. But with her best friend, Katie, by her side, she’s also starting high school—and ready for whatever comes next.\n\nRace\n\nCast: Stephen James, Jason Sudeikis, Eli Goree, Shanice Banton, Carce Van Houten\n\nSynopsis: At the 1936 Berlin Olympics, Hitler wanted to show the supremacy of the Aryan race, but African American athlete Jesse Owens would prove him wrong.\n\nDinotrux Supercharged, Season 2 (Netflix Original)\n\nSynopsis: Bigger, faster and stronger than ever, the supercharged Dinotrux are back to take on new challenges, embrace adventure and meet new friends.\n\nGame Over, Man! (Netflix Film)\n\nCast: Sugar Lyn Beard, Steve Howey, Adam Devine\n\nSynopsis: In this action comedy, three friends are on the verge of getting their video game financed when their benefactor is taken hostage by terrorists.\n\nLayla M. (Netflix Original Film)\n\nCast:Nora El Koussour, Ilias Addab, Hassan Akkouch\n\nSynopsis: In response to the repeated bigotry she faces, a Moroccan teen in Amsterdam tries to find a sense of belonging in the world of fundamentalist Islam.\n\nRoxanne Roxanne (Netflix Film)\n\nCast:Mahershala Ali, Nia Long, Adam Horovitz\n\nSynopsis: In 1984, New York teen Lolita Shanté Gooden bursts onto the hip-hop scene with her song “The Real Roxanne.”\n\nRequiem: Season 1 (Netflix Original)\n\nCast:Lydia Wilson, James Frecheville, Sian Reese-Williams\n\nSynopsis: After her mother commits suicide, a young cellist searches for answers about her past and unearths a sinister secret.\n\nSanta Clarita Diet, Season 2 (Netflix Original)\n\nCast:Drew Barrymore, Timothy Olyphant, Liv Hewson\n\nSynopsis: What turned Sheila undead? Has Joel boarded the crazy train? Are Eric and Abby just friends? The questions—like the bodies—are stacking up.\n\nThe Mechanism, Season 1 (Netflix Original)\n\nCast: Alessandra Colassanti, Antonio Saboia\n\nSynopsis: This fictional drama series is loosely inspired by an investigation of alleged corruption in private and state oil and construction companies in Brazil.\n\nSWORDGAI The Animation: Part 1 (Netflix Original)\n\nSynopsis: After harnessing a demon sword to replace his missing arm, a young man named Gai fuses with the weapon to fight his enemies in this action fantasy.\n\nMarch 25:\n\nAlias Grace: Limited Series\n\nCast: Sarah Gadon, Edward Holcroft, Rebecca Liddiard\n\nSynopsis: In 19th-century Canada, a psychiatrist weighs whether or not a murder should be pardoned due to insanity.\n\nMarch 29:\n\nPride and Prejudice and Zombies\n\nCast: Lily James, Sam Riley, Jack Huston, Bella Heathcote, Elle Bamber\n\nSynopsis: When plague-born zombies stalk the 19th-century English countryside, it’s up to feisty Elizabeth Bennett and proud Mr. Darcy to stop them.\n\nMarch 30:\n\nA Series of Unfortunate Events, Season 2 (Netflix Original)\n\nCast: Neil Patrick Harris, Patrick Warburton, Malina Weissman\n\nSynopsis: The siblings return for a second season based on the series by Lemony Snicket with even more perilous predicaments, dastardly villains and brilliant inventions.\n\nEye in the Sky\n\nCast: Helen Mirren, Aaron Paul, Alan Rickman, Barkhad Abdi, Iain Glen\n\nSynopsis: While a drone circles over Kenya, politicians and military brass in London clash over a strike that could kill a terrorist—and an innocent girl.\n\nFirst Match (Netflix Film)\n\nCast: Elvire Emanuelle, Yahya Abdul-Mateen II, Colman Domingo\n\nSynopsis: Hardened by years in foster care, a teenage girl from Brooklyn decides that wrestling boys is the only way back to her estranged father.\n\nHappy Anniversary (Netflix Film)\n\nCast: Annie Potts, Isidora Goreshter, Joe Pantoliano\n\nSynopsis: A quirky couple spends their three-year dating anniversary by looking back at their relationship and contemplating whether they should break up.\n\nTrailer Park Boys, Season 12 (Netflix Original)\n\nCast: John Paul Tremblay, Robb Wells, Mike Smith\n\nSynopsis: Three petty felons have a documentary made about their life in a trailer park.\n\nThe Titan (Netflix Film)\n\nCast: Sam Worthington, Taylor Schilling, Tom Wilkinson\n\nSynopsis: In a future where Earth is ecologically doomed, a soldier undergoes an experimental transformation into a new species suitable for space colonization.\n\nTrump: An American Dream, Season 1 (Netflix Original)\n\nSynopsis: This is the story of modern America, told through the biography of Donald Trump, a man irrefutably shaped by history.\n\nRapture, Season 1 (Netflix Original)\n\nSynopsis: Featuring an impressive collection of artists who have found worldwide success, this documentary series showcases hip-hop’s impact on global culture.\n\nMarch 31:\n\nA Walk Among the Tombstones\n\nCast: Liam Neeson, Dan Stevens, David Harbour, Boyd Hollbrook, Ólafur Darri Ólafsson\n\nSynopsis: A drug kingpin hires troubled ex-cop Matt Scudder to find his wife’s killers, a hunt that leads to shocking revelations in New York’s underworld.\n\nBewitched\n\nCast: Nicole Kidman, Will Ferrell, Shirley MacLaine, Michael Caine, Jason Schwartzman\n\nSynopsis: Isabel Bigelow seems to be the perfect Samantha to star in a remake of the 1960s sitcom Bewitched—but no one knows she really is a witch!\n\nCatfish\n\nCast: Yaniv Schulman, Henry Joost, Ariel Schulman, Melody C. Roscher, Angela Wesselman-Pierce\n\nSynopsis: A young photographer becomes involved with a gifted 8-year-old artist’s family—until he realizes something’s not quite right.\n\nClerks 2\n\nCast: Brian O’Halloran, Jeff Anderson, Rosario Dawson, Trevor Fehrman, Jason Mewes\n\nSynopsis: Picking up 10 years after the original misfit misadventures, Kevin Smith revisits the daily routines of New Jersey’s minimum-wage employees.\n\nEternal Sunshine of the Spotless Mind\n\nCast: Jim Carrey, Kate Winslet, Kirsten Dunst, Mark Ruffalo, Elijah Wood\n\nSynopsis: After learning that his ex-girlfriend had an experimental medical procedure to purge all memories of him, a man decides to do the same with her.\n\nHairspray\n\nCast: Nikki Blonsky, John Travolta, Michelle Pfeiffer, Christopher Walken, Amanda Bynes\n\nSynopsis: In 1962, ambitious plus-size teen Tracy Turnblad tries to integrate a racially divided Baltimore one Watusi at a time.\n\nRV\n\nCast: Robin Williams, Cheryl Hines, Joanna ‘JoJo’ Levesque, Josh Hutcherson, Jeff Daniels\n\nSynopsis: Climbing aboard their mammoth recreational vehicle for a cross-country trip to the Rockies, the Munro family prepares for the adventure of a lifetime.\n\nTalladega Nights: The Ballad of Ricky Bobby\n\nCast: Will Ferrell, John C. Reilly, Sacha Baron Cohen, Gary Cole, Michael Clarke Duncan\n\nSynopsis: NASCAR idol Ricky Bobby is at the top of his game until Formula One driver Jean Girard bests him on the track, sending him into a downward spiral.\n\nThe Fifth Element\n\nCast: Bruce Willis, Gary Oldman, Milla Jovovich, Ian Holm, Chris Tucker\n\nSynopsis: In this imaginative sci-fi epic, a 23rd-century cabbie finds himself involved with a fetching alien who may hold the key to saving the world.\n\nUnderworld\n\nCast: Kate Beckinsale, Scott Speedman, Michael Sheen, Shane Brolly, Bill Nighy\n\nSynopsis: A vampire suspects that her mortal enemies, werewolves known as Lycans, are targeting a human. As she shadows one, she finds herself falling in love.\n\nUnderworld: Awakening\n\nCast: Kate Beckinsale, Stephen Rea, Michael Ealy, Theo James, India Eisley\n\nSynopsis: Reprising her role as the vampire Selene, Kate Beckinsale stars in this installment in the stylish vampires vs. werewolves franchise.\n\nUnderworld: Evolution\n\nCast: Kate Beckinsale, Scott Speedman, Tony Curran, Shane Brolly, Steven Mackintosh\n\nSynopsis: Vampire warrior Selene and werewolf hybrid Michael learn the history of the ongoing war between the patrician Death Dealers and the barbarous Lycans.\n\nUnderworld: Rise of the Lycans\n\nCast: Michael Sheen, Bill Nighy, Rhona Mitra, Steven Mackintosh, Kevin Grevioux\n\nSynopsis: Tracing the backstory of the long war between the ruling-class vampires and the enslaved Lycans, this bloody prequel depicts the feud’s first dustups.\n\nHanna\n\nCast: Saoirse Ronan, Eric Bana, Cate Blanchett, Tom Hollander, Olivia Williams\n\nSynopsis: Raised in isolation and trained as an assassin, teen Hanna longs for a normal life but when she comes out of hiding, she becomes targeted by the CIA.\n\nLet Me In\n\nCast: Kodi Smit-McPhee, Chlo ë Grace Moretz, Richard Jenkins, Cara Buono, Elias Koteas\n\nSynopsis: When 12-year-old Owen befriends neighbour Abby, their bond helps him confront bullies but he soon suspects his mysterious friend has a dark secret.\n\nLucky Number Slevin\n\nCast: Josh Hartnett, Bruce Willis, Morgan Freeman, Ben Kingsley, Lucy Liu\n\nSynopsis: While checking out the apartment of his missing friend Nick Fisher, a drifter is mistaken for Nick by thugs and forced to participate in a murder.\n\nPandorum\n\nCast: Dennis Quaid, Ben Foster, Cam Gigandet, Antje Traue, Cung Le\n\nSynopsis: After waking from hyper-sleep, two spacecraft women discover startling gaps in their collective memory—including the nature of their mission.\n\nSpy Kids\n\nCast: Antonio Banderas, Carla Gugino, Alan Cumming, Teri Hatcher, Cheech Marin\n\nSynopsis: The tables are turned when pint-sized kids Carmen and Juni must rescue their secret-agent parents from the diabolical clutches of Alexander Minion.\n\nSpy Kids 2: The Island of Lost Dreams\n\nCast: Antonio Banderas, Carla Gugino, Alexa PenaVega, Daryl Sabara, Steve Buscemi\n\nSynopsis: Spy Kids Carmen and Juni Cortez team up with two other pint-sized secret agents, Gary and Gerti Giggles, to take on an evil scientist.\n\nSpy Kids: All the Time in the World\n\nCast: Jessica Alba, Joel McHale, Rowan Blanchard, Mason Cook, Jeremy Piven\n\nSynopsis: Former Spy Kids Carmen and Juni return to help twin siblings Rebecca and Cecil Wilson save the world with their retired secret-agent stepmother.\n\nTexas Chainsaw Massacre\n\nCast: Jessica Biel, Jonathan Tucker, Erica Leerhsen, Mike Vogel, Eric Balfour\n\nSynopsis: The sole survivor of a 1973 killing spree breaks her silence to tell the story of what really happened on that grisly, unforgettable day.\n\nThe Back-Up Plan\n\nCast: Jennifer Lopez, Alex O’Loughlin, Michaela Watkins, Eric Christian Olsen, Anthony Anderson\n\nSynopsis: Tired of looking for “Mr. Right,” Zoe decides to have a baby on her own. But on the day she’s artificially inseminated, she meets her perfect match.\n\nThe Crazies\n\nCast: Timothy Olyphant, Radha Mitchell, Joe Anderson, Danielle Panabaker, Christie Lynn Smith\n\nSynopsis: When a plane crashes in a small town, a secret biological weapon is released that turns the residents into homicidal maniacs.\n\nThe Man\n\nCast: Samuel L. Jackson, Eugene Levy, Miguel Ferrer, Luke Goss, Susie Essman\n\nSynopsis: A hard-nosed special agent seeks revenge on the man who killed his partner, but an identity mix-up forces him to work with a hapless salesman.\n\nWinter’s Bone\n\nCast: Jennifer Lawrence, John Hawkes, Kevin Breznahan, Dale Dickey, Garret Dillahunt\n\nSynopsis: In this unflinching noir drama, a resilient teen goes on the trail of her missing, drug-dealing father when his absence threatens the family’s safety.\n\nYou Me Her, Season 1-3\n\nCast: Greg Poehler, Rachel Blanchard, Priscilla Faia\n\nSynopsis: Centers around a three-way romantic relationship involving a suburban married couple.\n\nLast call! Here is everything leaving Netflix Canada in March:\n\nMarch 1:\n\n12 Years a Slave\n\nHeartland, Seasons 1 – 8\n\nMarch 4:\n\nPrison Break, Seasons 1-4\n\nAngel, Seasons 1-5\n\nRoswell, Seasons 1-3\n\nMarch 6:\n\nThe Finest Hours\n\nMarch 9:\n\nDaddy’s Home\n\nMarch 16:\n\nThe Godfather, Part I – III\n\nMarch 20:\n\nZootopia\n\nMarch 31:\n\nZoolander 2\n\nRelated:\n\n\n\nFive Shows You Missed While You Were Being Disappointed by Riverdull\n\n“We Were About to Shoot!”: SJP Spills on What Really Happened to Sex and the City 3\n\nWhat’s Coming (and Going) on Netflix Canada in February 2018\n\n\n\n", "images": ["https://www.flare.com/wp-content/uploads/2018/02/INLINE_0000s_0016_ROXANNE-ROXANNE.jpg", "https://www.flare.com/wp-content/plugins/rdm-daac-notice/public/images/close.png", "https://www.flare.com/wp-content/uploads/2018/02/INLINE_0000s_0003_DADDY_S-HOME.jpg", "https://www.flare.com/wp-content/uploads/2018/02/INLINE_0000s_0004_COLLATERAL.jpg", "https://www.flare.com/wp-content/themes/flare.com/assets/images/logo.png", "https://www.flare.com/wp-content/uploads/2018/02/INLINE_04-2.jpg", "https://www.flare.com/wp-content/uploads/2018/02/INLINE_0000s_0009_MY-NEXT-GUEST....jpg", "https://www.flare.com/wp-content/uploads/2018/02/INLINE_0000s_0000_LADIES-FIRST.jpg", "https://www.flare.com/wp-content/uploads/2018/02/INLINE_0000s_0017_REQUIEM-S1.jpg", "https://www.flare.com/wp-content/uploads/2018/02/INLINE_0000s_0014_SCD_202_Unit_00421_R_CROP.jpg", "https://www.flare.com/wp-content/plugins/rdm-daac-notice/public/images/info.png", "https://www.flare.com/wp-content/uploads/2018/02/INLINE_0000s_0000_THE-BACK-UP-PLAN.jpg", "https://www.flare.com/wp-content/uploads/2018/02/INLINE_0000s_0003_BEWITCHED.jpg", "https://secure.gravatar.com/avatar/b8c6f4c12ab56453121db7a88b16f740?s=50&d=https%3A%2F%2Fwww.flare.com%2Fwp-content%2Fthemes%2Fflare.com%2Fimages%2FFlare_AuthorProfile_250.png&r=g", "https://www.flare.com/wp-content/uploads/2018/02/INLINE_0000s_0006_ALEXA-AND-KATIE.jpg", "https://www.flare.com/wp-content/uploads/2018/02/INLINE_0000s_0007_LOVE-S3.jpg", "https://www.flare.com/wp-content/uploads/2018/02/INLINE_0000s_0018_ON-MY-BLOCK-S1.jpg", "https://www.flare.com/wp-content/uploads/2018/02/INLINE_0000s_0005_ALIAS-GRACE_-LIMITED-SERIES.jpg", "https://www.flare.com/wp-content/uploads/2018/02/INLINE_0000s_0001_SISTERS.jpg", "https://www.flare.com/wp-content/uploads/2018/02/FB_NetflixMarch.jpg", "https://www.flare.com/wp-content/uploads/2018/02/INLINE_01-5.jpg", "https://www.flare.com/wp-content/uploads/2018/02/INLINE_05-4.jpg", "https://www.flare.com/wp-content/uploads/2018/02/INLINE_0000s_0001_HAPPY-ANNIVERSARY.jpg", "https://www.flare.com/wp-content/uploads/2018/02/INLINE_0000s_0013_SERIES-OF-EVENTS-S2.jpg", "https://www.flare.com/wp-content/uploads/2018/02/INLINE_0000s_0002_HAIRSPRAY.jpg", "https://www.flare.com/wp-content/uploads/2018/02/INLINE_02-6.jpg", "https://www.flare.com/wp-content/uploads/2018/02/INLINE_0000s_0012_THE-OUTSIDER.jpg"], "top_img": "https://www.flare.com/wp-content/uploads/2018/02/FB_NetflixMarch.jpg", "keywords": [], "authors": ["Jennifer Berry"], "canonical_link": "https://www.flare.com/tv-movies/netflix-canada-march-2018/", "title": "Netflix Canada March 2018: What's Coming (and Going)", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "apple-mobile-web-app-capable": "yes", "contextly-page": "{\"title\":\"What&#039;s Coming (and Going) on Netflix Canada in March 2018\",\"url\":\"https:\\/\\/www.flare.com\\/tv-movies\\/netflix-canada-march-2018\\/\",\"pub_date\":\"2018-02-27 14:03:30\",\"mod_date\":\"2018-03-14 16:21:27\",\"type\":\"post\",\"post_id\":\"656751\",\"author_id\":\"79380\",\"author_name\":\"Jennifer Berry\",\"author_display_name\":\"Jennifer Berry\",\"tags\":[\"Netflix\"],\"categories\":[\"TV &amp; Movies\"],\"image\":\"https:\\/\\/www.flare.com\\/wp-content\\/uploads\\/2018\\/02\\/JessicaJonesS2_feature2.jpg\"}", "description": "We round up all the movies and TV shows coming (like 'Love' Season 3) and going (like all 'The Godfather' movies *tear*) on Netflix Canada March 2018", "robots": "noodp", "og": {"locale": "en_US", "type": "article", "title": "What's Coming (and Going) on Netflix Canada in March", "description": "We literally never thought the third season of 'Love' would arrive", "url": "https://www.flare.com/tv-movies/netflix-canada-march-2018/", "site_name": "Flare", "updated_time": "2018-03-14T16:21:27-04:00", "image": "https://www.flare.com/wp-content/uploads/2018/02/FB_NetflixMarch.jpg"}, "article": {"publisher": "https://www.facebook.com/FLAREFashion", "tag": "Netflix", "section": "TV & Movies", "published_time": "2018-02-27T14:03:30-04:00", "modified_time": "2018-03-14T16:21:27-04:00"}, "twitter": {"card": "summary_large_image", "description": "We literally never thought the third season of 'Love' would arrive", "title": "What's Coming (and Going) on Netflix Canada in March", "site": "@FLAREfashion", "image": "https://www.flare.com/wp-content/uploads/2018/02/FB_NetflixMarch.jpg", "creator": "@FLAREfashion"}, "generator": "WordPress 4.9.13", "msapplication-TileImage": "https://www.flare.com/wp-content/uploads/2020/02/favicon.png"}, "movies": [], "publish_date": 1519754610.0, "source": "http://www.flare.com", "summary": ""}