{"url": "variety.com/2018/film/news/johnny-depp-rolling-stone-profile-amber-heard-1202853819/", "text": "Johnny Depp’s bad boy persona used to help sell the movies he made. He was a real life Capt. Jack Sparrow, who could hit the press circuit armed with a few rococo anecdotes, delivered with a rock ‘n roll edge in between drags of freshly rolled cigarettes. His act was charming and his mystique undeniable.\n\nNo longer. A new Rolling Stone profile of the actor compares Depp’s current, debauched existence to Elvis’s last, drug-fueled days. It left readers and people in Hollywood alarmed with its portrayal of Depp, a 55-year-old man, drinking goblet after goblet of vintage red wine, smoking hash, and, it is heavily implied, partaking in even stronger substances, all while cordoned off in a gated mansion that leaves him cut off from reality.\n\nStudios still in business with the actor were poring over the profile this morning, assessing what — if any — fallout there would be from the piece. At a minimum, it’s a major distraction for the backers of Depp’s upcoming films — a list that includes Global Road’s September crime drama “City of Lies” and Warner Bros. big-budget “Fantastic Beasts: The Crimes of Grindelwald.” Spokespeople for both studios declined to comment, and a spokesperson for Depp did not immediately respond to a request for comment.\n\nThe truth is that even before the Rolling Stone article hit stands, Depp has been widely viewed as a liability. He is out of step with the #MeToo and Time’s Up movements after being accused by ex-wife Amber Heard of domestic assault. The backlash to those allegations has been so intense that J.K. Rowling felt moved to defend casting the actor in “Fantastic Beasts” nearly a year before the film even hit theaters.\n\n“Based on our understanding of the circumstances, the filmmakers and I are not only comfortable sticking with our original casting but genuinely happy to have Johnny playing a major character in the movies,” Rowling said in a statement.\n\nAnd his legal battle with his former business managers has laid bare embarrassing spending details and, worse yet, exposed him as an actor in desperate need of paycheck roles to fund a lifestyle he can no longer afford. Studios want Depp to share a few choice on-set memories, not expose him to a grilling about his stormy personal life.\n\n“His baggage is a huge concern,” said Jeff Bock, a box office analyst with Exhibitor Relations. “Part of the reason to hire an A-list actor is so they can hit the talk- show circuit and travel around the world promoting a film. That might not be possible now.”\n\nIt also means that Depp’s co-stars will now have to deflect questions about the actor’s behavior when they go out to talk up the films.\n\nThe Rolling Stone story may have set off alarms, but an individual with knowledge of the “Fantastic Beasts” production said the portrait it presented of a zonked- out movie star was not in keeping with Depp’s on-set behavior. He was on time, knew his lines, and was courteous to cast and crew.\n\nIt is also true that unlike indefatigable promoters such as Tom Cruise and Will Smith, Depp tends to be more sparing in his press appearances. He will traditionally only do a few magazine profiles, often with favored outlets such as Vanity Fair, and a handful of on-camera interviews.\n\nDepp isn’t the only actor whose off-screen behavior is causing headaches for studios these days. Vertical Entertainment is moving ahead with the August release of “Billionaire Boys Club,” despite the presence of Kevin Spacey, an actor accused of harassing and assaulting several men, some of whom were underage.\n\nAmazon still has to figure out what to do with “A Rainy Day in New York,” an upcoming Woody Allen movie. The director has become toxic as allegations that he assaulted his daughter, Dylan Farrow, have received more media coverage since Hollywood has been battling an industry-wide sexual harassment crisis. Several of the films stars, a group that includes Timothée Chalamet and Rebecca Hall, have donated their salaries to charity and expressed regret for working on the film. Amazon has yet to announce a release date for the picture, which doesn’t seem like a show of confidence.\n\nAnd earlier this week, Peter Fonda attracted a wave of bad publicity after tweeting that Barron Trump should be ripped from his mother’s arms while calling out the Trump administration’s family separation policy. Sony Pictures Classics, the distributor of Fonda’s next film “Boundaries,” said it had no plans to delay or cancel the movie’s debut this weekend, but it did denounce his comments.\n\nDepp plays the lead role in “City of Lies,” a drama about the murders of Tupac Shakur and The Notorious B.I.G., so he’s front-and-center in the marketing material. “Fantastic Beasts,” however, is another story. Because Depp plays a villainous supporting role, the studio never planned for him to be heavily involved in hawking the film. Trailers and posters don’t exactly hide Depp’s involvement, but they don’t trumpet it either. Warner Bros. hasn’t ruled out asking the actor to participate in interviews for the film, but nothing definitive has been set in place. He is also intended to be a part of the third “Fantastic Beasts” film, but that could theoretically change because Rowling has yet to deliver the script.\n\nDepp’s other forthcoming big-budget movie, “The Invisible Man,” appears to be stuck in development limbo. It was intended to be part of an effort to relaunch Universal’s iconic movie monsters, but those plans had to be reworked after the first film in that proposed cinematic universe, 2017’s “The Mummy,” bombed at the box office.\n\nThe Rolling Stone story, which portrays Depp engaging in a deeply unhealthy lifestyle, could potentially lead to trouble with insurance companies that bond the actor’s productions. Actors such as Robert Downey Jr., who famously struggled with drug and alcohol addiction, had insurance headaches before cleaning up their acts. Of course, Downey’s drug problems landed him in prison, making his issues more extreme.\n\nAll of these Depp-related headaches come while the actor’s box office powers appear to be waning. Recent Depp vehicles such as “Black Mass” and “Alice Through the Looking Glass” were financial duds, and last summer’s “Pirates of the Caribbean: Dead Men Tell No Tales” was the second-lowest grossing film in the franchise.\n\nThat may be Depp’s biggest crime. Hollywood can accept almost anything, except for failure.", "images": ["http://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Ffilm%2Fnews%2Fjohnny-depp-rolling-stone-profile-amber-heard-1202853819%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202853819&comment_count=68", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pmcvariety.files.wordpress.com/2018/06/johnny-depp.jpg?w=1000", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif"], "top_img": "https://pmcvariety.files.wordpress.com/2018/06/johnny-depp.jpg?w=1000", "keywords": [], "authors": ["Brent Lang"], "canonical_link": "https://variety.com/2018/film/news/johnny-depp-rolling-stone-profile-amber-heard-1202853819/", "title": "Johnny Depp: Rolling Stone Profile Latest Sign Actor Is PR Liability", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "A Rolling Stone profile of Johnny Depp compares his current, debauched existence to Elvis's last, drug-fueled days, and left people in Hollywood alarmed with its portrayal of the actor.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202853819, "author": "Brent Lang", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-06-21T15:03:40"}, "pmc-tag": "Johnny Depp,Rolling Stone", "title": "Johnny Depp: Rolling Stone Profile Latest Sign Actor Is PR Liability", "pageclass": "article", "pmc-vertical": "film", "pmc-primary-category": "News", "pmc-primary-vertical": "film", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "Johnny Depp: Rolling Stone Profile Latest Sign Actor Is PR Liability", "url": "https://variety.com/2018/film/news/johnny-depp-rolling-stone-profile-amber-heard-1202853819/", "description": "Johnny Depp’s bad boy persona used to help sell the movies he made. He was a real life Capt. Jack Sparrow, who could hit the press circuit armed with a few rococo anecdotes, delivered with a …", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/06/johnny-depp.jpg?w=1000", "width": 1000, "height": 562, "alt": "Actor Johnny Depp poses for photographers upon arrival at the world premiere of the film 'Murder on the Orient Express', in LondonBritain Murder on the Orient Express World Premiere, London, United Kingdom - 02 Nov 2017"}, "locale": "en_US"}, "article": {"published_time": "2018-06-21T22:03:40+00:00", "modified_time": "2018-06-22T00:47:50+00:00"}, "twitter": {"creator": "@https://twitter.com/BrentALang", "site": "@variety", "text": {"title": "Johnny Depp: Rolling Stone Profile Latest Sign Actor Is PR Liability"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/06/johnny-depp.jpg?w=1000", "alt": "Actor Johnny Depp poses for photographers upon arrival at the world premiere of the film 'Murder on the Orient Express', in LondonBritain Murder on the Orient Express World Premiere, London, United Kingdom - 02 Nov 2017"}, "card": "summary_large_image", "title": "Johnny Depp: Rolling Stone Profile Latest Sign Actor Is PR Liability", "description": "A Rolling Stone profile of Johnny Depp compares his current, debauched existence to Elvis's last, drug-fueled days, and left people in Hollywood alarmed with its portrayal of the actor."}, "author": "Brent Lang", "content_type": "Article", "post_id": 1202853819, "title": "Johnny Depp: Rolling Stone Profile Latest Sign Actor Is PR Liability", "published_at": "2018-06-21 15:03:40", "image": "https://pmcvariety.files.wordpress.com/2018/06/johnny-depp.jpg?w=1000", "comment_count": 68, "tags": "Rolling Stone", "topics": "News", "appeared_in_print": "No", "body": "Johnny Depp's bad boy persona used to help sell the movies he made. He was a real life Capt. Jack Sparrow, who could hit the press circuit armed with a few rococo anecdotes, delivered with a rock 'n roll edge in between drags of freshly rolled cigarettes. His act was charming and his mystique undeniable.\r\n\r\nNo longer. A new Rolling Stone profile of the actor compares Depp's current, debauched existence to Elvis's last, drug-fueled days. It left readers and people in Hollywood alarmed with its portrayal of Depp, a 55-year-old man, drinking goblet after goblet of vintage red wine, smoking hash, and, it is heavily implied, partaking in even stronger substances, all while cordoned off in a gated mansion that leaves him cut off from reality.\r\n\r\nStudios still in business with the actor were poring over the profile this morning, assessing what — if any — fallout there would be from the piece. At a minimum, it's a major distraction for the backers of Depp's upcoming films — a list that includes Global Road's September crime drama \"City of Lies\" and Warner Bros. big-budget \"Fantastic Beasts: The Crimes of Grindelwald.\" Spokespeople for both studios declined to comment, and a spokesperson for Depp did not immediately respond to a request for comment.\r\n\r\nThe truth is that even before the Rolling Stone article hit stands, Depp has been widely viewed as a liability. He is out of step with the #MeToo and Time's Up movements after being accused by ex-wife Amber Heard of domestic assault. The backlash to those allegations has been so intense that J.K. Rowling felt moved to defend casting the actor in \"Fantastic Beasts\" nearly a year before the film even hit theaters.\r\n\r\n“Based on our understanding of the circumstances, the filmmakers and I are not only comfortable sticking with our original casting but genuinely happy to have Johnny playing a major character in the movies,” Rowling said in a statement.\r\n\r\nAnd his legal battle with his former business managers has laid bare embarrassing spending details and, worse yet, exposed him as an actor in desperate need of paycheck roles to fund a lifestyle he can no longer afford. Studios want Depp to share a few choice on-set memories, not expose him to a grilling about his stormy personal life.\r\n\r\n\"His baggage is a huge concern,\" said Jeff Bock, a box office analyst with Exhibitor Relations. \"Part of the reason to hire an A-list actor is so they can hit the talk- show circuit and travel around the world promoting a film. That might not be possible now.\"\r\n\r\nIt also means that Depp's co-stars will now have to deflect questions about the actor's behavior when they go out to talk up the films.\r\n\r\nThe Rolling Stone story may have set off alarms, but an individual with knowledge of the \"Fantastic Beasts\" production said the portrait it presented of a zonked- out movie star was not in keeping with Depp's on-set behavior. He was on time, knew his lines, and was courteous to cast and crew.\r\n\r\nIt is also true that unlike indefatigable promoters such as Tom Cruise and Will Smith, Depp tends to be more sparing in his press appearances. He will traditionally only do a few magazine profiles, often with favored outlets such as Vanity Fair, and a handful of on-camera interviews.\r\n\r\nDepp isn't the only actor whose off-screen behavior is causing headaches for studios these days. Vertical Entertainment is moving ahead with the August release of \"Billionaire Boys Club,\" despite the presence of Kevin Spacey, an actor accused of harassing and assaulting several men, some of whom were underage.\r\n\r\nAmazon still has to figure out what to do with \"A Rainy Day in New York,\" an upcoming Woody Allen movie. The director has become toxic as allegations that he assaulted his daughter, Dylan Farrow, have received more media coverage since Hollywood has been battling an industry-wide sexual harassment crisis. Several of the films stars, a group that includes Timothée Chalamet and Rebecca Hall, have donated their salaries to charity and expressed regret for working on the film. Amazon has yet to announce a release date for the picture, which doesn't seem like a show of confidence.\r\n\r\nAnd earlier this week, Peter Fonda attracted a wave of bad publicity after tweeting that Barron Trump should be ripped from his mother’s arms while calling out the Trump administration's family separation policy. Sony Pictures Classics, the distributor of Fonda's next film “Boundaries,” said it had no plans to delay or cancel the movie's debut this weekend, but it did denounce his comments.\r\n\r\nDepp plays the lead role in \"City of Lies,\" a drama about the murders of Tupac Shakur and The Notorious B.I.G., so he's front-and-center in the marketing material. \"Fantastic Beasts,\" however, is another story. Because Depp plays a villainous supporting role, the studio never planned for him to be heavily involved in hawking the film. Trailers and posters don't exactly hide Depp's involvement, but they don't trumpet it either. Warner Bros. hasn't ruled out asking the actor to participate in interviews for the film, but nothing definitive has been set in place.  He is also intended to be a part of the third \"Fantastic Beasts\" film, but that could theoretically change because Rowling has yet to deliver the script.\r\n\r\nDepp's other forthcoming big-budget movie, \"The Invisible Man,\" appears to be stuck in development limbo. It was intended to be part of an effort to relaunch Universal's iconic movie monsters, but those plans had to be reworked after the first film in that proposed cinematic universe, 2017's \"The Mummy,\" bombed at the box office.\r\n\r\nThe Rolling Stone story, which portrays Depp engaging in a deeply unhealthy lifestyle, could potentially lead to trouble with insurance companies that bond the actor's productions. Actors such as Robert Downey Jr., who famously struggled with drug and alcohol addiction, had insurance headaches before cleaning up their acts. Of course, Downey's drug problems landed him in prison, making his issues more extreme.\r\n\r\nAll of these Depp-related headaches come while the actor's box office powers appear to be waning. Recent Depp vehicles such as \"Black Mass\" and \"Alice Through the Looking Glass\" were financial duds, and last summer's \"Pirates of the Caribbean: Dead Men Tell No Tales\" was the second-lowest grossing film in the franchise.\r\n\r\nThat may be Depp's biggest crime. Hollywood can accept almost anything, except for failure.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1529618620.0, "source": "http://variety.com", "summary": ""}