{"url": "https://web.archive.org/web/20170218101543/http://www.thethings.com:80/fifty-shades-of-dakota-15-things-people-dont-know-about-dakota-johnson/", "text": "30 Shares Share On Facebook Pint It Email\n\nDakota Johnson; most of us know her as the actress from Fifty Shades of Grey. While we may have seen Johnson in some pretty intimate positions on-screen, there’s definitely a lot we don’t know about the Fifty Shades star. Like, for instance, the superfluity of familiar names in her family tree. Seeing that her popular movie, Fifty Shades Darker came out on the day of love—Valentine’s Day—it’s only fitting to dedicate a piece to the actress who brought us the sexy and quaint, Anastasia Steele. Johnson, after all, has become somewhat something of a Valentine’s Day staple, herself. Here are 15 facts about Dakota Johnson or, as some might call her, “that girl from Fifty Shades of Grey.” We guarantee that she will no longer by “that girl” by the end of the list!\n\n15. Her Family Tree Is Full Of Famous Faces\n\nYou know how we said there are a few familiar names in her family tree? Well, we weren’t lying. Her parents are fellow actors, Melanie Griffith and Don Johnson. Unfortunately, her parents divorced in 1994 so Dakota had to split her time between the two. “It was the only way that I could be with them,” she said in an interview for Cosmopolitan. “And since they were divorced, I would spend two weeks with one and two weeks with the other, traveling with a tutor.” But wait, it gets better. Her maternal grandmother (can you guess..) is Hitchcock actress Tippi Hedren. Yes, that’s right, so clearly creative talent lies in that family. We’ve never heard of a family tree with so many famous names! Thanksgiving is probably a whirlwind. Now, Dakota Johnson is another famous name in that tree.\n\n\n\n14. She’s An Animal Rights Activist\n\nJust like her grandmother Tippi Hedren, Dakota Johnson is also an animal rights activist. Like grandmother, like granddaughter shall we say? As animal lovers ourselves, we’re pleased to hear that she’s following in her grandmother’s footsteps—both in acting and in animal rights. In 2014, Johnson saved 12 horses from being slaughtered by paying for them. What a sweet thing to do! We bet her grandmother was really proud. It’s always so great to hear about celebrities doing positive things – so naturally, we’re happy to hear of Dakota’s compassionate side. We admit we have a soft spot for animal lovers, but who doesn’t? We always love hearing about people doing good deeds for animals and it’s always nice to hear celebrities using their celebrity title for the better.\n\n\n\n13. She Grew Up Shooting Guns And Riding Horses In Colorado\n\nShe may play the innocent and naive Anastasia Steele in the Fifty Shades movies, but growing up Johnson was anything but naive. She grew up in Colorado at her dad’s house, where she learned to build a fire, ride a horse, ride motorbikes, and even shoot a gun. And this was all before she was just 10 years old! Sounds like a badass kid to us! But when she wasn’t at her father’s house, she was at her mom’s house in L.A. which she also loved.\n\nIt’s hard to imagine a 10 year old these days shooting guns, riding motorbikes, or building fires without being grounded. But it sounds like she had a pretty inspiring and freeing childhood which makes us fall for the actress all the more.\n\n\n\n12. She Never Dates\n\nBy the header, we mean she never has casual relationships. She only has long-term relationships. Good for her, is all we can say! You hear of so many celebrities who are constantly dating other celebrities. You can barely keep up with who they’re dating these days. It seems to be one guy or girl after another. So it’s great to hear of Dakota’s conservative views on relationships. Apparently she’s only ever been in long-term, serious relationships; she doesn’t just date. That probably explains why she’s been in a relationship with model Matthew Hitt since 2014. Yes, it’s been a kind of an on-and-off relationship but they’ve been in it for the long haul so far. So, to sum up, we like her whole dating attitude. The commitment is great and saves you a lot of time.\n\n\n\n11. She HATED School\n\nIt seems like we have something in common with Dakota Johnson: a loathing of school. Okay, so maybe not all of you hated school – many of you probably loved school or at least thrived at school. But most of us can say with the utmost certainty that we hated school with a passion. We all have our reasons why. Johnson, for instance, hated school because she felt like an “alien.” She said she didn’t understand the process of school as a child and felt “suffocated.” I don’t know about you guys, but I can totally relate with Dakota on this. Many of us felt like we didn’t really fit in at school so it’s especially comforting to hear that a big name like Dakota Johnson also felt like a social outcast in class. Like many of us, she preferred hanging out with her friends than going to school. But hey, we admire her honesty.\n\n\n\n10. Auditioning Gives Her Panic Attacks\n\n“We have a very natural, easy way with each other now. We both really needed each other through this process.” – Jamie on Dakota ♥#dakotajohnson #anastasiasteele #christiangrey #fiftyshadesdarker #jamiedornan A post shared by Fifty Shades Darker (@fiftyshadesen) on Feb 13, 2017 at 3:17pm PST\n\nWatching the pristine-looking A-list celebrities gliding around the Golden Globes Award ceremony is enough to wreck your mind with self-doubt over their unbelievably high levels of confidence and self esteem. If only we could possess as much poise! The truth is, many of these celebrities don’t feel that way at all; confident and self assured, that is. Dakota Johnson, for example, gets so nervous during auditions that she often has panic attacks. And we’re not just talking a bit of breathlessness here and there, we’re talking full-on panic attacks—the real deal. So before you come to your conclusions that the celebrities you see on television and in magazines are way more confident than you’ll ever be, just remember something: every single one of them suffers from self-doubt at one point or another. It happens to all of us.\n\n\n\n9. She Doesn’t Have Facebook\n\nNowadays it seems like virtually every celebrity has his or her own Facebook page that you’re able to ‘’like’’ in order to keep up with whatever is going on in their lives. Even the likes of Beyoncé and Adele have their own Facebook pages. Dakota Johnson, on the other hand, doesn’t follow suit. While there are Facebook fan pages of the actress, Dakota Johnson doesn’t have her own personal page. So if you thought you had found her, you were misguided because this woman seriously doesn’t have Facebook. Why? According to Johnson, “I was on Facebook until I caught myself being a psycho stalker. That’s when I chose to stop.” We can all agree with that! C’mon, at one point or another, who hasn’t stumbled upon an ex’s Facebook page and stumbled into even more random pages. We’re with ya, Dakota!\n\n\n\n8. She Used To Be A Model\n\n'Black Mass' will have a screening at Venice Film Festival on September 4th! #DakotaJohnson A post shared by Dakota Johnson (@officialdakotajohnson) on Jul 24, 2015 at 12:36pm PDT\n\nWhen Dakota Johnson left school (you know, that place she hated), she signed with IMG Models. For your information, IMG Models has also signed with the likes of Gigi Hadid, Bella Hadid, Taylor Marie Hill, Karlie Kloss, Miranda Kerr, Lily Aldridge, and a host of other famous models. Most of us are happy if we can bag a job at Burger King upon leaving school but, let’s be honest, we’d kill to get signed with a modeling agency like IMG. Damn the absence of prominent cheekbones and killer-long legs! But hey, we’re happy for the girl. A little envious, sure, but still very happy for her. Johnson has also starred in other modelling campaigns like the Mango Jeans line. It’s no wonder she got picked for the leading role in Fifty Shades. She’s quite a stunner!\n\n\n\n7. She Was Only Nine When She Made Her First Film Debut\n\nThe Fifty Shades of Grey movie made Dakota Johnson the well-known name she is today. Sure, some of us have watched her in films before but we probably weren’t so familiar with exactly who she was. Now, we’re kind of obsessed. So we thought we’d let you know that Johnson has actually been playing in movie roles for quite a while now – and it stems back to her childhood. That’s right, she was a child actor (if you couldn’t tell from her talented bloodline). Crazy in Alabama was Dakota Johnson’s first film debut, which she did when she was just nine years old. She and her half-sister played the role of the daughters to their actual mother, Melanie Griffith. And even more interesting, the movie was actually directed by Antonio Banderas – their stepfather.\n\n\n\n6. She Never Used A Body Double In ‘Fifty Shades Of Grey’\n\nOne word pretty much defines Dakota Johnson: brave. Yes, she’s brave alright. Not only has she starred in one of Hollywood’s most erotic and controversial movies, she’s also bared her entire body to the world – She never used a body double in the Fifty Shades of Grey movie. That was all her! Every curve, every inch – all Dakota. It takes guts to do that, it really does. The only scene that required a body double was in one BDSM scene. It was used during a scene in which Anastasia gets whipped with a belt. Johnson refused to participate in the scene because she didn’t want her body getting marked. Which we can’t entirely blame her for.Other than that, every other scene was completely her.\n\n\n\n5. She Had To Have All Her Tattoos Covered For Her Role As Anastasia Steele\n\nWell, it kind of makes sense. Can you honestly imagine a tattoo-plastered Anastasia Steele? Hmm, it doesn’t really fit does it? Since she wasn’t using a body double, Dakota Johnson had to have her tattoos covered to play the role of Anastasia Steele in Fifty Shades of Grey and the same rule applied for the sequel, Fifty Shades Darker. She admits her tattoos can be a real pain in the acting world. “I went through a phase where I loved tattoos, and I loved the feeling of getting tattooed,” she said. “But now I’ve outgrown them mostly, and [because] I always have to cover them for jobs, God, they’re annoying!” Seeing as she has many tattoos, you can imagine how much time it must take to cover them all up.\n\n\n\n4. Her Favorite Book is “Lolita”\n\nDakota Johnson must have a thing for controversial stories because her favorite book is “Lolita” by Vladimir Nabokov. If you don’t already know the story, it’s about an older man’s love and obsession with a 14-year-old girl, Lolita. It’s a classic novel. But also, as we said before, kind of controversial. However, there are a lot of important themes within this book which is essentially what makes it the classic novel that it is today. Interestingly enough, not only is it Johnson’s favorite book, but her mother actually also played Lolita’s mother in the film adaption of Lolita in 1997. Who knows if her mother’s role in the movie has anything to do with Dakota’s love for the book. Maybe it does, but nevertheless, it’s an incredibly powerful book, even if it is a little on the strange side.\n\n\n\n3. She Always Carries Three Specific Things In Her Purse\n\nYou will find all sorts of things in a woman’s handbag. A woman’s handbag is her pride and joy. We take pretty much everything necessary in our handbags. (Okay, an unnecessary, too. You never know when you might need your iPad.) Maybe that’s why they’re getting larger and larger. We also have specific items that we always carry with us in our purse. It might be one specific object that’s always in there or maybe two. For Dakota Johnson, there are three items she can never be without in her purse: keys, candy and ChapStick. Keys, yes, they are definitely an essential to keep in your purse. That’s kind of obvious. Candy? Well, it’s definitely a smart idea. Who doesn’t love snacking on candy throughout the day? And Chapstick, yes, another essential. No respectable woman wants to be seen with cracked lips.\n\n\n\n2. She Beat Out A Number Of Hollywood Actresses To Land the Role of Anastasia Steele\n\nA quien elegis bella? 😟 #kristenstewart #bellaswan #crepusculo #twilight A post shared by Magali.B. (@misseriesfav) on Feb 14, 2017 at 4:50am PST\n\nWho can forget the initial craze of the Fifty Shades franchise? It. Was. Insane. Everybody was literally obsessed with the book series and when we heard there was going to be a movie, it got us all asking the same question: who would play Anastasia Steele? Obviously everybody also wondered who would play the role of Christian Grey but right now we’re focusing on Dakota Johnson and as she played Anastasia, it feels only right to talk about that now. Anyway, Dakota Johnson reportedly beat out a host of well-known Hollywood actresses including Kristen Stewart, Elizabeth Olsen, Shailene Woodley, Alicia Vikander, Lucy Hale, Imogen Poots, and Chloe Bridges to land the role of Anastasia in the 2015 movie Fifty Shades of Grey. She was one lucky – and envied – girl.\n\n\n\n1. Her And Jamie Dornan Do Get Along, In Spite Of Rumors…\n\nYou know how the press can be like. They tend to sensationalize pretty much every tiny detail they get hold of. Sometimes, they completely fabricate stories from nothing at all. Well, this happened with the Fifty Shades of Grey costars. It was reported that Dakota Johnson and her co-star Jamie Dornan did not get along. The press made us believe that these two hated each others guts, but in actual fact, they get along well. Despite what the press say, they are friends. They’re on good terms. And if you seen her acceptance speech when she won the People’s Choice Award for Favorite Dramatic Movie Actress, thanking him and saying she couldn’t have done it without him, you would know that there is anything but hatred and bitterness between these two.", "images": ["https://web.archive.org/web/20170218101543im_/https://www.facebook.com/tr?id=952311624915190&ev=PageView&noscript=1", "https://web.archive.org/web/20170218101543im_/http://www.thethings.com/wp-content/uploads/2017/02/fifty-shades-feature.jpg", "https://web.archive.org/web/20170218101543im_/http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1", "https://web.archive.org/web/20170218101543im_/http://www.thethings.com/wp-content/themes/thethings/css/img/the-things-the-t-logo-red.svg"], "top_img": "https://web.archive.org/web/20170218101543im_/http://www.thethings.com/wp-content/uploads/2017/02/fifty-shades-feature.jpg", "keywords": [], "authors": ["Lauren Kearney"], "canonical_link": "https://web.archive.org/web/20170218101543/http://www.thethings.com/fifty-shades-of-dakota-15-things-people-dont-know-about-dakota-johnson/", "title": "Fifty Shades Of Dakota: 15 Things People Don’t Know About Dakota Johnson", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, maximum-scale=3.0, width=device-width", "description": "Dakota Johnson; most of us know her as the actress from Fifty Shades of Grey. While we may have seen Johnson in some pretty intimate positions on-screen,...", "fb": {"app_id": 1682953215260932}, "og": {"title": "Fifty Shades Of Dakota: 15 Things People Don't Know About Dakota Johnson", "url": "https://web.archive.org/web/20170218101543/http://www.thethings.com/fifty-shades-of-dakota-15-things-people-dont-know-about-dakota-johnson/", "locale": "en_US", "description": "Here are 15 things you never knew about Dakota Johnson or, as some might call her, \"that girl from Fifty Shades of Grey.\"", "site_name": "TheThings", "image": {"identifier": "https://web.archive.org/web/20170218101543im_/http://www.thethings.com/wp-content/uploads/2017/02/fifty-shades-feature.jpg", "width": 1024, "height": 539}, "type": "article"}, "article": {"publisher": "https://www.facebook.com/TheThingscom/", "published_time": "2017-02-15T16:00:31+00:00", "modified_time": "2017-02-15T14:12:23+00:00", "author": "Lauren Kearney", "section": "Pop Culture"}}, "movies": [], "publish_date": 1487174431.0, "source": "https://web.archive.org", "summary": ""}