{"url": "https://en.wikipedia.org/wiki/Twin_Peaks", "text": "This article is about the TV series. For other uses, see Twin Peaks (disambiguation)\n\n1990s American drama television series\n\nTwin Peaks is an American mystery horror drama television series created by Mark Frost and David Lynch that premiered on April 8, 1990, on ABC, running until its cancellation after its second season in 1991. The show gained a devoted cult following and has been referenced in a wide variety of media.[3][4][5][6] In subsequent years, Twin Peaks is often listed among the greatest television series of all time, and is considered a landmark turning point in television drama.[7][8][9][10][11]\n\nThe series follows an investigation headed by FBI Special Agent Dale Cooper (Kyle MacLachlan) and local Sheriff Harry S. Truman (Michael Ontkean) into the murder of homecoming queen Laura Palmer (Sheryl Lee) in the fictional town of Twin Peaks, Washington. The show's narrative draws on elements of detective fiction, but its uncanny tone, supernatural elements, and campy, melodramatic portrayal of eccentric characters also draw on American soap opera and horror tropes.[12][13][6][14] Like much of Lynch's work, it is distinguished by surrealism, offbeat humor, and distinctive cinematography.[15] The score was composed by Angelo Badalamenti with Lynch.[16]\n\nThe success of the show sparked a media franchise, and the series was followed by a 1992 feature film, Twin Peaks: Fire Walk with Me, that serves as a prequel to the series. Additional tie-in books were also released. Following a hiatus of over 25 years, the show returned in 2017 with a third season on Showtime, marketed as Twin Peaks: The Return and Twin Peaks: A Limited Event Series. The season was directed by Lynch and written by Lynch and Frost, and starred many original cast members, including MacLachlan.\n\nPlot [ edit ]\n\nSeason Episodes Originally aired First aired Last aired Network 1 8 April 8, 1990 ( ) May 23, 1990 ( 1990-05-23 ) ABC 2 22 September 30, 1990 ( ) June 10, 1991 ( 1991-06-10 ) Fire Walk with Me August 28, 1992 ( ) N/A 3 18 May 21, 2017 ( ) September 3, 2017 ( 2017-09-03 ) Showtime\n\nSeason 1 [ edit ]\n\nTwin Peaks focuses on the mystery of who killed Laura Palmer (played by Season one offocuses on the mystery of who killed Laura Palmer (played by Sheryl Lee , pictured in 1990).\n\nIn 1989, local logger Pete Martell discovers a naked corpse wrapped in plastic on the bank of a river outside the town of Twin Peaks, Washington. When Sheriff Harry S. Truman, his deputies, and doctor Will Hayward arrive, the body is identified as high school senior and homecoming queen Laura Palmer. A badly injured second girl, Ronette Pulaski, is discovered in a fugue state.\n\nFBI Special Agent Dale Cooper is called in to investigate. Cooper's initial examination of Laura's body reveals a tiny typed letter \"R\" inserted under her fingernail. Cooper informs the community that Laura's death matches the signature of a killer who murdered another girl in southwestern Washington the previous year, and that evidence indicates the killer lives in Twin Peaks.\n\nThe authorities discover through Laura's diary that she had been living a double life. She was cheating on her boyfriend, football captain Bobby Briggs, with biker James Hurley, and prostituting herself with the help of truck driver Leo Johnson and drug dealer Jacques Renault. Laura was also addicted to cocaine, which she obtained by coercing Bobby into doing business with Jacques.\n\nLaura's father, attorney Leland Palmer, suffers a nervous breakdown after her death. Her best friend Donna Hayward begins a relationship with James. With the help of Laura's cousin Maddy Ferguson, Donna and James discover that Laura's psychiatrist, Dr. Lawrence Jacoby, was obsessed with her, but he is proven innocent of the murder.\n\nHotelier Ben Horne, the richest man in Twin Peaks, plans to destroy the town's lumber mill along with its owner Josie Packard, and murder his lover (Josie's sister-in-law), Catherine Martell (Piper Laurie), so he can purchase the land at a reduced price and complete a development project called Ghostwood. Horne's sultry, troubled daughter, Audrey, becomes infatuated with Agent Cooper and spies on her father for clues in an effort to gain his affections.\n\nCooper has a dream in which he is approached by a one-armed otherworldly being who calls himself MIKE. MIKE says that Laura's murderer is a similar entity, Killer BOB, a feral, denim-clad man with long gray hair. Cooper finds himself decades older with Laura and a dwarf in a red business suit, who engages in coded dialogue with Cooper. The next morning, Cooper tells Truman that, if he can decipher the dream, he will know who killed Laura.\n\nCooper and the sheriff's department find the one-armed man from Cooper's dream, a traveling shoe salesman named Phillip Gerard. Gerard knows a Bob, the veterinarian who treats Renault's pet bird. Cooper interprets these events to mean that Renault is the murderer, and with Truman's help, tracks Renault to One-Eyed Jack's, a brothel owned by Horne across the border in Canada. He lures Jacques Renault back onto U.S. soil to arrest him, but Renault is shot while trying to escape and is hospitalized.\n\nLeland, learning that Renault has been arrested, sneaks into the hospital and murders him. The same night, Horne orders Leo to burn down the lumber mill with Catherine trapped inside and has Leo gunned down by Hank Jennings to ensure Leo's silence. Cooper returns to his room following Jacques's arrest and is shot by a masked gunman.\n\nSeason 2 [ edit ]\n\nAfter solving the murder of Laura Palmer, Kyle MacLachlan 's (pictured here in 1991) character of Dale Cooper stays in Twin Peaks to investigate further.\n\nLying hurt in his hotel room, Cooper has a vision in which a giant appears and reveals three clues: \"There is a man in a smiling bag,\" \"the owls are not what they seem,\" and \"without chemicals, he points.\" He takes a gold ring off Cooper's finger and explains that when Cooper understands the three premonitions, his ring will be returned.\n\nLeo Johnson survives his shooting but is left brain-damaged. Catherine Martell disappears, presumed killed in the mill fire. Leland Palmer, whose hair has turned white overnight, returns to work but behaves erratically. Cooper deduces that the \"man in the smiling bag\" is the corpse of Jacques Renault in a body bag.\n\nMIKE is inhabiting the body of Phillip Gerard. His personality surfaces when Gerard forgoes the use of a certain drug. MIKE reveals that he and BOB once collaborated in killing humans and that BOB is similarly inhabiting a man in the town. Cooper and the sheriff's department use MIKE, in control of Gerard's body, to help find BOB (\"without chemicals, he points\").\n\nDonna befriends an agoraphobic orchid grower named Harold Smith whom Laura entrusted with her second, secret diary. Harold catches Donna and Maddy attempting to steal the diary from him and hangs himself in despair. Cooper and the sheriff's department take possession of Laura's secret diary, and learn that BOB, a friend of her father's, had been sexually abusing her since childhood and she used drugs to cope. They initially suspect that the killer is Ben Horne and arrest him, but Leland Palmer is revealed to viewers to be BOB's host when he kills Maddy.\n\nCooper begins to doubt Horne's guilt, so he gathers all of his suspects in the belief that he will receive a sign to help him identify the killer. The Giant appears and confirms that Leland is BOB's host and Laura's and Maddy's killer, giving Cooper back his ring. Cooper and Truman take Leland into custody. In control of Leland's body, BOB admits to a string of murders, before forcing Leland to commit suicide. As Leland dies, he is freed of BOB's influence and begs for forgiveness. BOB's spirit disappears into the woods in the form of an owl and the lawmen wonder if he will reappear.\n\nCooper is set to leave Twin Peaks when he is framed for drug trafficking by Jean Renault and is suspended from the FBI. Renault holds Cooper responsible for the death of his brothers, Jacques and Bernard. Jean Renault is killed in a shootout with police, and Cooper is cleared of all charges.\n\nWindom Earle, Cooper's former mentor and FBI partner, escapes from a mental institution and comes to Twin Peaks. Cooper had previously been having an affair with Earle's wife, Caroline, while she was under his protection as a witness to a federal crime. Earle murdered Caroline and wounded Cooper. He now engages Cooper in a twisted game of chess during which Earle murders someone whenever a piece is captured.\n\nInvestigating BOB's origin and whereabouts with the help of Major Garland Briggs, Cooper learns of the existence of the White Lodge and the Black Lodge, two extra-dimensional realms whose entrances are somewhere in the woods surrounding Twin Peaks.\n\nCatherine returns to town in yellowface, having survived the mill fire, and manipulates Ben Horne into signing the Ghostwood project over to her. Andrew Packard, Josie's husband, is revealed to be still alive while Josie Packard is revealed to be the person who shot Cooper at the end of the first season. Andrew forces Josie to confront his business rival and her tormentor from Hong Kong, the sinister Thomas Eckhardt. Josie kills Eckhardt, but she mysteriously dies when Truman and Cooper try to apprehend her.\n\nCooper falls in love with a new arrival in town, Annie Blackburn. Earle captures the brain-damaged Leo for use as a henchman and abandons his chess game with Cooper. When Annie wins the Miss Twin Peaks contest, Earle kidnaps her and takes her to the entrance to the Black Lodge, whose power he seeks to use for himself.\n\nThrough a series of clues Cooper discovers the entrance to the Black Lodge, which turns out to be the strange, red-curtained room from his dream. He is greeted by the Man From Another Place, the Giant, and Laura Palmer, who each give Cooper cryptic messages. Searching for Annie and Earle, Cooper encounters doppelgängers of various people, including Maddy Ferguson and Leland Palmer. Cooper finds Earle, who demands Cooper's soul in exchange for Annie's life. Cooper agrees but BOB appears and takes Earle's soul for himself. BOB then turns to Cooper, who is chased through the lodge by a doppelgänger of himself.\n\nOutside the lodge, Andrew Packard, Pete Martell and Audrey Horne are caught in an explosion at a bank vault, a trap laid by the dead Eckhardt.\n\nCooper and Annie reappear in the woods, both injured. Annie is taken to hospital but Cooper recovers in his room at the Great Northern Hotel. It becomes clear that the \"Cooper\" who emerged from the Lodge is in fact his doppelgänger, under BOB's control. He smashes his head into a bathroom mirror and laughs maniacally.\n\nSeason 3 [ edit ]\n\nOn October 6, 2014, it was announced that a limited series would air on Showtime. David Lynch and Mark Frost wrote all the episodes, and Lynch directed. Frost emphasized that the new episodes are not a remake or reboot but a continuation of the series. The episodes are set in the present day, and the passage of 25 years is an important element in the plot.[17]\n\nMost of the original cast returns, including Kyle MacLachlan, Mädchen Amick, Sherilyn Fenn, Sheryl Lee, Ray Wise, and several others. Additions include Jeremy Davies, Laura Dern, Robert Forster, Tim Roth, Jennifer Jason Leigh, Amanda Seyfried, Matthew Lillard, and Naomi Watts.[18]\n\nThe limited series began filming in September 2015[19] and was completed by April 2016.[18] It was shot continuously from a single, long-shooting script before being edited into separate episodes. The series premiered on May 21, 2017, and consists of 18 episodes.[20] It is known as both Twin Peaks: The Return and Twin Peaks: A Limited Event Series.\n\nFuture [ edit ]\n\nSince Season 3 ended in 2017, Lynch and Frost have expressed interest in making another season of Twin Peaks.[21][22] Lynch has been asked in several interviews if he would continue, once saying \"I don't know, I have a box of ideas, and I'm working with producer Sabrina Sutherland, kind of trying to go through and see if there's any gold in those boxes.\"[23] Lynch also said one more story was \"calling to him\" (involving the character of Carrie Page) but there \"were disturbances.\"[24]\n\nCast [ edit ]\n\nMain cast [ edit ]\n\nSecondary cast [ edit ]\n\nRecurring cast [ edit ]\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nIn the 1980s, Mark Frost worked for three years as a writer for the television police drama Hill Street Blues, which featured a large cast and extended story lines.[25] Following his success with The Elephant Man (1980) and Blue Velvet (1986), David Lynch was hired by a Warner Bros. executive to direct a film about the life of Marilyn Monroe, based on the best-selling book Goddess. Lynch recalls being \"sort of interested. I loved the idea of this woman in trouble, but I didn't know if I liked it being a real story.\"[26] Lynch and Frost first worked together on the Goddess screenplay and although the project was dropped by Warner Bros., they became good friends. They went on to work as writer and director for One Saliva Bubble, a film with Steve Martin attached to star, but it was never made either. Lynch's agent, Tony Krantz, encouraged him to do a television show. Lynch said \"Tony I don't want to do a TV show\".[27] He took Lynch to Nibblers restaurant in Los Angeles and said, \"You should do a show about real life in America—your vision of America the same way you demonstrated it in Blue Velvet.\" Lynch got an \"idea of a small-town thing\", and though he and Frost were not keen on it, they decided to humor Krantz. Frost wanted to tell \"a sort of Dickensian story about multiple lives in a contained area that could sort of go perpetually.\" Originally, the show was to be titled North Dakota and set in the Plains region of North Dakota.[28]\n\nAfter Frost, Krantz, and Lynch rented a screening room in Beverly Hills and screened Peyton Place, they decided to develop the town before its inhabitants.[25][29] Due to the lack of forests and mountains in North Dakota, the title was changed from North Dakota to Northwest Passage (the title of the pilot episode), and the location to the Pacific Northwest, specifically Washington.[28][29] They then drew a map and decided that there would be a lumber mill in the town.[25] Then they came up with an image of a body washing up on the shore of a lake.[25][30] Lynch remembers, \"We knew where everything was located and that helped us determine the prevailing atmosphere and what might happen there.\"[30] Frost remembers that he and Lynch came up with the notion of the girl next door leading a \"desperate double life\" that would end in murder.[29] The idea was inspired, in part, by the unsolved 1908 murder of Hazel Irene Drew in Sand Lake, New York.[31]\n\nLynch and Frost pitched the idea to ABC during the 1988 Writers Guild of America strike[32] in a ten-minute meeting with the network's drama head, Chad Hoffman, with nothing more than this image and a concept.[30] According to the director, the mystery of who killed Laura Palmer was initially going to be in the foreground, but would recede gradually as viewers got to know the other townsfolk and the problems they were having.[30] Lynch and Frost wanted to mix a police investigation with a soap opera.[30] ABC liked the idea and asked Lynch and Frost to write a screenplay for the pilot episode. They had been talking about the project for three months and wrote the screenplay in 10 days.[33] Frost wrote more verbal characters, like Benjamin Horne, while Lynch was responsible for Agent Cooper. According to the director, \"He says a lot of the things I say.\"[25] ABC Entertainment President Brandon Stoddard ordered the two-hour pilot for a possible fall 1989 series. He left the position in March 1989 as Lynch went into production.[34] They filmed the pilot for $4 million with an agreement with ABC that they would shoot an additional \"ending\" to it so that it could be sold directly to video in Europe as a feature film if the TV show was not picked up.[29] ABC's Robert Iger and his creative team took over, saw the dailies, and met with Frost and Lynch to get the arc of the stories and characters.[34] Although Iger liked the pilot, he had difficulty persuading the rest of the network executives. Iger suggested showing it to a more diverse, younger group, who liked it, and the executive subsequently convinced ABC to buy seven episodes at $1.1 million apiece.[32] Some executives figured that the show would never get on the air or that it might run as a seven-hour mini-series,[35] but Iger planned to schedule it for the spring. The final showdown occurred during a bi-coastal conference call between Iger and a room full of New York executives; Iger won, and Twin Peaks was on the air.[30]\n\nEach episode took a week to shoot and after directing the second episode, Lynch went off to complete Wild at Heart while Frost wrote the remaining segments.[34] Standards and Practices had a problem with only one scene from the first season: an extreme close-up in the pilot of Cooper's hand as he slid tweezers under Laura's fingernail and removed a tiny \"R\". They wanted the scene to be shorter because it made them uncomfortable, but Frost and Lynch refused and the scene remained.[34]\n\nCasting [ edit ]\n\nTwin Peaks cast. Veteran film actress Piper Laurie (pictured here in 1990) helped cement thecast.\n\nTwin Peaks features members of a loose ensemble of Lynch's favorite character actors, including Jack Nance, Kyle MacLachlan, Grace Zabriskie, and Everett McGill. Isabella Rossellini, who had worked with Lynch on Blue Velvet was originally cast as Giovanna Packard, but she dropped out of the production before shooting began on the pilot episode.[36] The character was then reconceived as Josie Packard, of Chinese ethnicity, and the role given to actress Joan Chen.[37] The cast includes several actors who had risen to fame in the 1950s and 1960s, including 1950s film stars Richard Beymer, Piper Laurie, and Russ Tamblyn. Other veteran actors included British actor James Booth (Zulu), former The Mod Squad star Peggy Lipton, and Michael Ontkean, who co-starred in the 1970s crime drama The Rookies. Kyle MacLachlan was cast as Agent Dale Cooper. Stage actor Warren Frost was cast as Dr. Will Hayward.\n\nDue to budget constraints, Lynch intended to cast a local girl from Seattle as Laura Palmer, reportedly \"just to play a dead girl.\"[26] The local girl ended up being Sheryl Lee. Lynch stated \"But no one—not Mark, me, anyone—had any idea that she could act, or that she was going to be so powerful just being dead.\"[26] And then, while Lynch shot the home movie that James takes of Donna and Laura, he realized that Lee had something special. \"She did do another scene—the video with Donna on the picnic—and it was that scene that did it.\"[26] As a result, Sheryl Lee became a semi-regular addition to the cast, appearing in flashbacks as Laura, and portraying another, recurring character: Maddy Ferguson, Laura's similar-looking cousin.\n\nThe character of Phillip Gerard's appearance in the pilot episode was originally intended to be only a \"kind of homage to The Fugitive. The only thing he was gonna do was be in this elevator and walk out,\" according to David Lynch.[26] However, when Lynch wrote the \"Fire walk with me\" speech, he imagined Al Strobel, who played Gerard, reciting it in the basement of the Twin Peaks hospital—a scene that appeared in the European version of the pilot episode, and surfaced later in Agent Cooper's dream sequence. Gerard's full name, Phillip Michael Gerard, is also a reference to Lieutenant Phillip Gerard, a character in The Fugitive.\n\nLynch met Michael J. Anderson in 1987. After seeing him in a short film, Lynch wanted to cast the actor in the title role in Ronnie Rocket, but that project failed to get made.\n\nRichard Beymer was cast as Ben Horne because he had known Johanna Ray, Lynch's casting director. Lynch was familiar with Beymer's work in the 1961 film West Side Story and was surprised that Beymer was available for the role.[38]\n\nSet dresser Frank Silva was cast as the mysterious \"Bob\". Lynch himself recalls that the idea originated when he overheard Silva moving furniture around in the bedroom set, and then heard a woman warning Silva not to block himself in by moving furniture in front of the door. Lynch was struck with an image of Silva in the room. When he learned that Silva was an actor, he filmed two panning shots, one with Silva at the base of the bed, and one without; he did not yet know how he would use this material. Later that day, during the filming of Sarah Palmer having a vision, the camera operator told Lynch that the shot was ruined because \"Frank [Silva] was reflected in the mirror.\" Lynch comments, \"Things like this happen and make you start dreaming. And one thing leads to another, and if you let it, a whole other thing opens up.\"[39] Lynch used the panning shot of Silva in the bedroom, and the shot featuring Silva's reflection, in the closing scenes of the European version of the pilot episode. Silva's reflection in the mirror can also be glimpsed during the scene of Sarah's vision at the end of the original pilot, but it is less clear. A close-up of Silva in the bedroom later became a significant image in episodes of the TV series.[40]\n\nMusic [ edit ]\n\nThe score for Twin Peaks has received acclaim; The Guardian wrote that it \"still marks the summit of TV soundtracks.\"[16] In fall 1989, composer Angelo Badalamenti and Lynch created the score for the show. In 20 minutes they produced the signature theme for the series. Badalamenti called it the \"Love Theme from Twin Peaks\". Lynch told him, \"You just wrote 75% of the score. It's the mood of the whole piece. It is Twin Peaks.\"[41] While creating the score, Lynch often described the moods or emotions he wanted the music to evoke, and Badalamenti began to play the piano. In the scenes dominated by young men, they are accompanied by music that Badalamenti called Cool Jazz. The characters' masculinity was enhanced by finger-snapping, \"cocktail-lounge electric piano, pulsing bass, and lightly brushed percussion.\"[41] A handful of the motifs were borrowed from the Julee Cruise album Floating into the Night, which was written in large part by Badalamenti and Lynch and was released in 1989. This album also serves as the soundtrack to another Lynch project, Industrial Symphony No. 1, a live Cruise performance also featuring Michael J. Anderson (\"The Man from Another Place\").\n\nThe song \"Falling\" (sans vocals) became the theme to the show, and the songs \"Rockin' Back Inside My Heart\", \"The Nightingale\", \"The World Spins\", and \"Into the Night\" (found in their full versions on the album) were all, except the last, used as Cruise's roadhouse performances during the show's run. The lyrics for all five songs were written by Lynch.[42] A second volume of the soundtrack was released on October 30, 2007, to coincide with the Definitive Gold Box DVD set.[43]\n\nIn March 2011, Lynch began releasing The Twin Peaks Archive - a collection of previously unavailable tracks from the series and the film via his website.[44][45]\n\nFilming locations [ edit ]\n\nFBI Special Agent Dale Cooper states, in the pilot episode, that Twin Peaks is \"five miles south of the Canadian border, and twelve miles west of the state line\". This places it in the Salmo-Priest Wilderness. Lynch and Frost started their location search in Snoqualmie, Washington, on the recommendation of a friend of Frost. They found all of the locations that they had written into the pilot episode.[29] The towns of Snoqualmie, North Bend and Fall City – which became the primary filming locations for stock Twin Peaks exterior footage – are about an hour's drive from the town of Roslyn, Washington, the town used for the series Northern Exposure. Many exterior scenes were filmed in wooded areas of Malibu, California.[37] Most of the interior scenes were shot on standing sets in a San Fernando Valley warehouse.\n\nThe soap opera show-within-the-show Invitation to Love was not shot on a studio set, but in the Ennis House, an architectural landmark designed by Frank Lloyd Wright in the Hollywood area of Los Angeles.[46]\n\nFilming [ edit ]\n\nMark Frost and David Lynch made use of repeating and sometimes mysterious motifs such as trees (especially fir and pines), coffee and doughnuts, cherry pie, owls, logs, ducks, water, fire — and numerous embedded references to other films and TV shows.[47]\n\nDuring the filming of the scene in which Cooper first examines Laura's body, a malfunctioning fluorescent lamp above the table flickered constantly, but Lynch decided not to replace it, since he liked the disconcerting effect that it created.[37]\n\nCooper's dream at the end of the third episode, which became a driving plot point in the series's first season and ultimately held the key to the identity of Laura's murderer, was never scripted. The idea came to Lynch one afternoon after touching the side of a hot car left out in the sun: \"I was leaning against a car—the front of me was leaning against this very warm car. My hands were on the roof and the metal was very hot. The Red Room scene leapt into my mind. 'Little Mike' was there, and he was speaking backwards... For the rest of the night I thought only about The Red Room.\"[26] The footage was originally shot along with the pilot, to be used as the conclusion were it to be released as a feature film. When the series was picked up, Lynch decided to incorporate some of the footage; in the third episode, Cooper, narrating the dream, outlines the shot footage which Lynch did not incorporate, such as Mike shooting Bob and the fact that he is 25 years older when he meets Laura Palmer's spirit.\n\nIn an attempt to avoid cancellation, the idea of a Cooper possessed by Bob came up and was included in the final episode, but the series was cancelled even before the episode was aired.[48]\n\nResponse [ edit ]\n\nBefore the one and a half hour pilot premiered on TV, a screening was held at the Museum of Broadcasting in Hollywood.[49] Media analyst and advertising executive Paul Schulman said, \"I don't think it has a chance of succeeding. It is not commercial, it is radically different from what we as viewers are accustomed to seeing, there's no one in the show to root for.\"[49] The show's Thursday night time slot had not been a good one for soap operas, as both Dynasty and its short-lived spin-off The Colbys did poorly.[49] Twin Peaks was also up against the hugely successful sitcom Cheers.\n\nInitially, the show received a positive response from TV critics. Tom Shales, in The Washington Post, wrote, \"Twin Peaks disorients you in ways that small-screen productions seldom attempt. It's a pleasurable sensation, the floor dropping out and leaving one dangling.\"[50] In The New York Times, John J. O'Connor wrote, \"Twin Peaks is not a send-up of the form. Mr. Lynch clearly savors the standard ingredients...but then the director adds his own peculiar touches, small passing details that suddenly, and often hilariously, thrust the commonplace out of kilter.\"[51] Entertainment Weekly gave the show an \"A+\" rating and Ken Tucker wrote, \"Plot is irrelevant; moments are everything. Lynch and Frost have mastered a way to make a weekly series endlessly interesting.\"[52] Richard Zoglin in Time magazine said that it \"may be the most hauntingly original work ever done for American TV.\"[53]\n\nThe two-hour pilot was the highest-rated movie for the 1989–90 season with a 22 rating and was viewed by 33% of the audience.[54] In its first broadcast as a regular one-hour drama series, Twin Peaks scored ABC's highest ratings in four years in its 9:00 pm Thursday time slot.[55] The show also reduced NBC's Cheers's ratings. Twin Peaks had a 16.2 rating with each point equaling 921,000 homes with TVs.[55] The episode also added new viewers because of what ABC's senior vice-president of research, Alan Wurtzel, called \"the water cooler syndrome\", in which people talk about the series the next day at work.[55]\n\nBut the show's third episode lost 14% of the audience that had tuned in a week before.[56] That audience had dropped 30% from the show's first appearance on Thursday night. This was a result of competing against Cheers, which appealed to the same demographic that watched Twin Peaks. A production executive from the show spoke of being frustrated with the network's scheduling of the show. \"The show is being banged around on Thursday night. If ABC had put it on Wednesday night it could have built on its initial success. ABC has put the show at risk.\"[56]\n\nIn response, the network aired the first-season finale on a Wednesday night at 10:00 pm instead of its usual 9:00 pm Thursday slot.[57] The show achieved its best ratings since its third week on the air with a 12.6 and a 22 share of the audience.[58] On May 22, 1990, it was announced that Twin Peaks would be renewed for a second season.[59]\n\nDuring the first and second season, the search for Laura Palmer's killer served as the engine for the plot, and captured the public's imagination, although the creators admitted this was largely a MacGuffin; each episode was really about the interactions between the townsfolk.[32] The unique (and often bizarre) personalities of each citizen formed a web of minutiae that ran contrary to the town's quaint appearance. Adding to the surreal atmosphere was the recurrence of Dale Cooper's dreams, in which the FBI agent is given clues to Laura's murder in a supernatural realm that may or may not be of his imagination. The first season contained only eight episodes (including the two-hour pilot episode), and was considered technically and artistically revolutionary for television at the time, and geared toward reaching the standards of film.[60]\n\nCritics have noted that Twin Peaks began the trend of accomplished cinematography now commonplace in today's television dramas.[61] Lynch and Frost maintained tight control over the first season, handpicking all of the directors, including some Lynch had known from his days at the American Film Institute (e.g., Caleb Deschanel and Tim Hunter) and some referred to him by those he knew personally. Lynch and Frost's control lessened in the second season, corresponding with what is generally regarded as a decrease in the show's quality once the identity of Laura Palmer's murderer was revealed.\n\nThe aforementioned \"water cooler effect\" put pressure on the show's creators to solve the mystery. Although they claimed to have known from the series' inception the identity of Laura's murderer,[37] Lynch never wanted to solve the murder, while Frost felt that they had an obligation to the audience to solve it. This created tension between the two men.[29]\n\nIts ambitious style, paranormal undertones, and engaging murder mystery made Twin Peaks an unexpected hit. Its characters, particularly MacLachlan's Dale Cooper, were unorthodox for a supposed crime drama, as was Cooper's method of interpreting his dreams to solve the crime. During its first season, the show's popularity reached its zenith, and elements of the program seeped into mainstream popular culture, prompting parodies, including one in the 16th-season premiere of Saturday Night Live, hosted by MacLachlan.[62]\n\nCritical acclaim [ edit ]\n\nTwin Peaks was nominated for fourteen awards. He was nominated for directing and co-writing the David Lynch at the 42nd Primetime Emmy Awards on September 16, 1990, wherewas nominated for fourteen awards. He was nominated for directing and co-writing the pilot episode\n\nFor its first season, Twin Peaks received fourteen nominations at the 42nd Primetime Emmy Awards, for Outstanding Drama Series, Outstanding Lead Actor in a Drama Series (Kyle MacLachlan), Outstanding Lead Actress in a Drama Series (Piper Laurie), Outstanding Supporting Actress in a Drama Series (Sherilyn Fenn), Outstanding Directing in a Drama Series (David Lynch), Outstanding Writing in a Drama Series (David Lynch and Mark Frost), Outstanding Writing in a Drama Series (Harley Peyton), Outstanding Art Direction for a Series, Outstanding Achievement in Main Title Theme Music, Outstanding Achievement in Music Composition for a Series (Dramatic Underscore), Outstanding Achievement in Music and Lyrics, and Outstanding Sound Editing for a Series. Out of its fourteen nominations, it won for Outstanding Costume Design for a Series and Outstanding Editing for a Series – Single Camera Production.[63]\n\nFor its second season, it received four nominations at the 43rd Primetime Emmy Awards, for Outstanding Lead Actor in a Drama Series (Kyle MacLachlan), Outstanding Supporting Actress in a Drama Series (Piper Laurie), Outstanding Sound Editing for a Series, and Outstanding Sound Mixing for a Drama Series.[63]\n\nAt the 48th Golden Globe Awards, it won for Best TV Series – Drama, Kyle MacLachlan won for Best Performance by an Actor in a TV Series – Drama, Piper Laurie won for Best Performance by an Actress in a Supporting Role in a Series, Mini-Series or Motion Picture Made for TV; while Sherilyn Fenn was nominated in the same category as Laurie.[64]\n\nThe pilot episode was ranked 25th on TV Guide's 1997 100 Greatest Episodes of All Time.[65] It placed 49th on Entertainment Weekly's \"New TV Classics\" list.[66] In 2004 and 2007, Twin Peaks was ranked 20th and 24th on TV Guide's Top Cult Shows Ever,[67][68] and in 2002, it was ranked 45th of the \"Top 50 Television Programs of All Time\" by the same guide.[7] In 2007, UK broadcaster Channel 4 ranked Twin Peaks 9th on their list of the \"50 Greatest TV Dramas\".[69] Also that year, Time included the show on their list of the \"100 Best TV Shows of All-Time\".[8] Empire listed Twin Peaks as the 24th best TV show in their list of \"The 50 Greatest TV Shows of All Time\".[70]\n\nIn 2012, Entertainment Weekly listed the show at no. 12 in the \"25 Best Cult TV Shows from the Past 25 Years\", saying, \"The show itself was only fitfully brilliant and ultimately unfulfilling, but the cult lives, fueled by nostalgia for the extraordinary pop phenomenon it inspired, for its significance to the medium (behold the big bang of auteur TV!), and for a sensuous strangeness that possesses you and never lets you go.\"[9] The series has been nominated for the TCA Heritage Award six consecutive years since 2010.[71] It was ranked 20th on The Hollywood Reporter's list of Hollywood's 100 Favorite TV Shows.[72]\n\nDeclining ratings [ edit ]\n\nAs the series' ratings started to decline, the producers added Heather Graham (seen here in 2011) to the cast.\n\nWith the resolution of Twin Peaks' main drawing point (Laura Palmer's murder) in the middle of the second season, and with subsequent story lines becoming more obscure and drawn out, public interest began to wane. This discontent, coupled with ABC changing its timeslot on a number of occasions, led to a huge drop in the show's ratings after being one of the most-watched television programs in the United States in 1990. A week after the season's 15th episode placed 85th in the ratings out of 89 shows, ABC put Twin Peaks on indefinite hiatus,[73] a move that usually leads to cancellation.[74]\n\nAn organized letter-writing campaign, dubbed COOP (Citizens Opposed to the Offing of Peaks), attempted to save the show from cancellation.[75] The campaign was successful, as ABC agreed to air the remaining six episodes to finish the season.[75] But due to the Gulf War, Twin Peaks was moved from its usual time slot \"for six weeks out of eight\" in early 1991, according to Frost, preventing the show from maintaining audience interest.[76]\n\nAccording to Frost, the main storyline after the resolution of Laura Palmer's murder was planned to be the second strongest element from the first season that audiences responded to: the relationship between Agent Cooper and Audrey Horne. Frost explained that Lara Flynn Boyle, who was romantically involved with Kyle MacLachlan at the time, had effectively vetoed the Audrey-Cooper relationship, forcing the writers to come up with alternative storylines to fill the gap.[77][78] Sherilyn Fenn corroborated this claim in a 2014 interview, stating, \"[Boyle] was mad that my character was getting more attention, so then Kyle started saying that his character shouldn't be with my character because it doesn't look good, 'cause I'm too young... I was not happy about it. It was stupid.\"[79] This meant the artificial extension of secondary storylines, such as James Hurley and Evelyn Marsh, to fill in the space. After ratings began to decline, Agent Cooper was given a new love interest, Annie Blackburn (Heather Graham), to replace the writers' intended romance between him and Audrey Horne. Despite ending on a deliberate audience-baiting cliffhanger, the series finale did not sufficiently boost interest, and the show was not renewed for a third season, leaving the cliffhanger unresolved.\n\nLynch expressed his regret at having resolved the Laura Palmer murder, saying he and Frost had never intended for the series to answer the question and that doing so \"killed the goose that laid the golden eggs\". Lynch blamed network pressure for the decision to resolve the Palmer storyline prematurely.[80] Frost agreed, noting that people at the network had in fact wanted the killer to be revealed by the end of season one.[81]\n\nIn 1993, cable channel Bravo acquired the license to rerun the entire series, which began airing in June 1993.[82] These reruns included Lynch's addition of introductions to each episode by the Log Lady and her cryptic musings.[83]\n\nLooking back, Frost has admitted that he wished he and Lynch had \"worked out a smoother transition\" between storylines and that the Laura Palmer story was a \"tough act to follow\".[35] Regarding the second season, Frost felt that \"perhaps the storytelling wasn't quite as taut or as fraught with emotion\".[35]\n\nInfluence [ edit ]\n\nWriting for The Atlantic in 2016, Mike Mariani wrote that \"It would be tough to look at the roster of television shows any given season without finding several that owe a creative debt to Twin Peaks,\" stating that \"Lynch's manipulation of the uncanny, his surreal non-sequiturs, his black humor, and his trademark ominous tracking shots can be felt in a variety of contemporary hit shows.[15] In 2010, the television series Psych paid tribute to the series by reuniting some of the cast in the fifth-season episode, \"Dual Spires\". The episode's plot is an homage to the Twin Peaks pilot, where the characters of Psych investigate the death of a young girl in a small town called \"Dual Spires\". The episode also contains several references to the original show. Twin Peaks actors that guest star in the episode are Sherilyn Fenn, Sheryl Lee, Dana Ashbrook, Robyn Lively, Lenny Von Dohlen, Catherine E. Coulson and Ray Wise. Prior to the airing of the episode, a special event at the Paley Center for Media was held where the actors from both shows discussed the episode.[84][85]\n\nReviewers and fans of four seasons of Veena Sud's U.S. TV series, The Killing, have noted similarities and borrowed elements from Lynch's Fire Walk with Me and Twin Peaks, and compared Sud and Lynch's works.[86][87][88][89][90][91][92][93]\n\nCarlton Cuse, creator of Bates Motel, cited Twin Peaks as a key inspiration for his series, stating: \"We pretty much ripped off Twin Peaks... If you wanted to get that confession, the answer is yes. I loved that show. They only did 30 episodes. Kerry [Ehrin] and I thought we'd do the 70 that are missing.\"[94]\n\nTwin Peaks served as an inspiration for the 1993 video game The Legend of Zelda: Link's Awakening, with director Takashi Tezuka citing the series as the main factor for the creation of the \"suspicious\" characters that populate the game, as well as the mystery elements of the story.[95] The show has also influenced a number of survival horror and psychological thriller video games—most notably Alan Wake,[96] Deadly Premonition,[97] Silent Hill,[98] and Max Payne.[99] The 1998 open world adventure video game Mizzurna Falls was reminiscent and a homage to Twin Peaks.[100]\n\nThe American animated show Gravity Falls repeatedly referenced the Black Lodge along with other elements of Twin Peaks throughout its run.[101]\n\nThe song \"Laura Palmer\" by the band Bastille was written influenced by the \"slightly weird, eerie\" atmosphere of the show.[102]\n\nMerchandise [ edit ]\n\nHome media [ edit ]\n\nThe series was released on VHS in a six-tape collection on April 16, 1995, however, it did not include the original pilot episode.[103] The series was also released on LaserDisc in a sixteen disc set in 1991 in Japan.[104] The same set was later released in the U.S. across four different volumes from 1993–94; neither release contained the original pilot nor Twin Peaks: Fire Walk with Me.\n\nOn December 18, 2001, the first season (episodes 1–7, minus the pilot) of Twin Peaks was released on DVD in Region 1 by Artisan Entertainment.[105] The box set featured digitally remastered video was noted for being the first TV series to have its audio track redone in DTS.[106]\n\nThe second season release was postponed several times, and the release was originally canceled in 2003 by Artisan due to low sales figures for the season 1 DVD.[107] The second season was finally released in the United States and Canada on April 3, 2007, via Paramount Pictures Home Entertainment/CBS DVD.[108]\n\nOn October 30, 2007, the broadcast version of the pilot finally received a legitimate U.S. release as part of the Twin Peaks \"Definitive Gold Box Edition\". This set includes both U.S. original network broadcast and international versions of the pilot. The set also includes all episodes from both seasons, deleted scenes for both seasons, and a feature-length retrospective documentary. Entertainment Weekly gave the box set a \"B+\" rating and wrote, \"There are numerous fascinatingly frank mini-docs here, including interviews with many Peaks participants; together, they offer one of the best available portraits of how a TV hit can go off the rails\".[109]\n\nIn July 2013, it was revealed that a Blu-ray version of the complete series would be released.[110] In January 2014, Lynch confirmed the Blu-ray release and that it would contain the pilot, season 1, season 2, and new special features, and possibly the film.[111] It was announced on May 15, 2014, that the Blu-ray of the complete series of Twin Peaks and the film containing over 90 minutes of deleted scenes would be released on July 29, 2014.[112]\n\nTwin Peaks: From Z to A, a 21-disc limited edition Blu-ray box set, which includes all the television episodes, Fire Walk with Me, The Missing Pieces, previously released special features, as well as six hours of new behind-the-scenes content and 4K versions of the original pilot and episode 8 from The Return, was released on December 10, 2019. Additionally, Twin Peaks: The Television Collection, a Blu-ray and DVD collection of the original series, The Return, and all previously released special features, was released on October 15, 2019.[113]\n\nOnline, the series is available through the pay CBS All Access service in full, along with Showtime's \"Anytime\" service for pay-TV subscribers and its over-the-top separate service.\n\nThe original series is available for HD streaming via both Hulu and Netflix in the U.S. Hulu also offers The Return, the 18-episode continuation originally aired on Showtime, as an additional-cost subscription option for viewing some of Showtime's programming.[114]\n\nBooks and audio [ edit ]\n\nDuring the show's second season, Pocket Books released three official tie-in books, each authored by the show's creators (or their family), which offer a wealth of backstory.\n\nThe Secret Diary of Laura Palmer, written by Lynch's daughter Jennifer Lynch, is the diary as seen in the series and written by Laura, chronicling her thoughts from her twelfth birthday to the days leading up to her death. Frost's brother Scott wrote The Autobiography of F.B.I. Special Agent Dale Cooper: My Life, My Tapes. Kyle MacLachlan also recorded Diane: The Twin Peaks Tapes of Agent Cooper, which combined audio tracks from various episodes of the series with newly recorded monologues.[115] Welcome to Twin Peaks: An Access Guide to the Town offers information about the history, flora, fauna, and culture of the fictitious town.\n\nThe Secret History of Twin Peaks, a novel by series co-creator Mark Frost, \"places the unexplained phenomena that unfolded in Twin Peaks in a layered, wide-ranging history, beginning with the journals of Lewis and Clark and ending with the shocking events that closed the finale.\"[116] It was published on October 18, 2016.[117]\n\nTwin Peaks: Visual Soundtrack, a LaserDisc that plays like an elaborate music video. The show's entire soundtrack album is played over silent video footage shot by a Japanese TV crew visiting the Snoqualmie, Washington locations where the series was shot.[118]\n\nTheatrical film [ edit ]\n\nThe 1992 film Twin Peaks: Fire Walk with Me is a prequel to the TV series. It tells of the investigation into the murder of Teresa Banks and the last seven days in the life of Laura Palmer. Director David Lynch and most of the television cast returned for the film, with the notable exceptions of Lara Flynn Boyle, who declined to return as Laura's best friend Donna Hayward and was replaced by Moira Kelly, and Sherilyn Fenn due to scheduling conflicts. Also, Kyle MacLachlan returned reluctantly as he wanted to avoid typecasting, so his presence in the film is smaller than originally planned. Lynch originally shot about five hours of footage that was subsequently cut down to two hours and fourteen minutes. Most of the deleted scenes feature additional characters from the television series who ultimately did not appear in the finished film. Around ninety minutes of these scenes are included in the complete series Blu-ray that was released on July 29, 2014.[112]\n\nFire Walk with Me was initially poorly received, especially in comparison to the series. It was greeted at the 1992 Cannes Film Festival with booing from the audience and has received mixed reviews by American critics.[119][120] It grossed a total of US$1.8 million in 691 theaters in its opening weekend and went on to gross a total of $4.1 million in North America.[121]\n\nReferences [ edit ]\n\nSources [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Gnome-mime-sound-openclipart.svg/50px-Gnome-mime-sound-openclipart.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/e/ea/TwinPeaks_openingshotcredits.jpg/250px-TwinPeaks_openingshotcredits.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Snoqualmie_Falls_in_June_2008.JPG/220px-Snoqualmie_Falls_in_June_2008.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Kyle_MacLachlan.jpg/170px-Kyle_MacLachlan.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Piper_Laurie_1990.jpg/170px-Piper_Laurie_1990.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Sheryl_Lee.jpg/170px-Sheryl_Lee.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/HeatherGrahamByDimitriSarantis2011.jpg/170px-HeatherGrahamByDimitriSarantis2011.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/e/ea/TwinPeaks_openingshotcredits.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/David_Lynch_at_the_1990_Emmy_Awards.jpg/170px-David_Lynch_at_the_1990_Emmy_Awards.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/e/ea/TwinPeaks_openingshotcredits.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Twin_Peaks", "title": "Twin Peaks", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/e/ea/TwinPeaks_openingshotcredits.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}