{"url": "www.nytimes.com/interactive/2017/12/13/opinion/contributors/salma-hayek-harvey-weinstein.html", "text": "‘Why do so many of us, as female artists, have to go to war?’\n\n‘No to opening the door to him at all hours of the night.’\n\nOpinion Harvey Weinstein Is My Monster Too\n\nHarvey Weinstein was a passionate cinephile, a risk taker, a patron of talent in film, a loving father and a monster.\n\nFor years, he was my monster.\n\nThis fall, I was approached by reporters, through different sources, including my dear friend Ashley Judd, to speak about an episode in my life that, although painful, I thought I had made peace with.\n\nI had brainwashed myself into thinking that it was over and that I had survived; I hid from the responsibility to speak out with the excuse that enough people were already involved in shining a light on my monster. I didn’t consider my voice important, nor did I think it would make a difference.\n\nIn reality, I was trying to save myself the challenge of explaining several things to my loved ones: Why, when I had casually mentioned that I had been bullied like many others by Harvey, I had excluded a couple of details. And why, for so many years, we have been cordial to a man who hurt me so deeply. I had been proud of my capacity for forgiveness, but the mere fact that I was ashamed to describe the details of what I had forgiven made me wonder if that chapter of my life had really been resolved.\n\nWhen so many women came forward to describe what Harvey had done to them, I had to confront my cowardice and humbly accept that my story, as important as it was to me, was nothing but a drop in an ocean of sorrow and confusion. I felt that by now nobody would care about my pain — maybe this was an effect of the many times I was told, especially by Harvey, that I was nobody.\n\nWe are finally becoming conscious of a vice that has been socially accepted and has insulted and humiliated millions of girls like me, for in every woman there is a girl. I am inspired by those who had the courage to speak out, especially in a society that elected a president who has been accused of sexual harassment and assault by more than a dozen women and whom we have all heard make a statement about how a man in power can do anything he wants to women.\n\nWell, not anymore.\n\nIn the 14 years that I stumbled from schoolgirl to Mexican soap star to an extra in a few American films to catching a couple of lucky breaks in “Desperado” and “Fools Rush In,” Harvey Weinstein had become the wizard of a new wave of cinema that took original content into the mainstream. At the same time, it was unimaginable for a Mexican actress to aspire to a place in Hollywood. And even though I had proven them wrong, I was still a nobody.\n\nOne of the forces that gave me the determination to pursue my career was the story of Frida Kahlo, who in the golden age of the Mexican muralists would do small intimate paintings that everybody looked down on. She had the courage to express herself while disregarding skepticism. My greatest ambition was to tell her story. It became my mission to portray the life of this extraordinary artist and to show my native Mexico in a way that combated stereotypes.\n\nThe Weinstein empire, which was then Miramax, had become synonymous with quality, sophistication and risk taking — a haven for artists who were complex and defiant. It was everything that Frida was to me and everything I aspired to be.\n\nI had started a journey to produce the film with a different company, but I fought to get it back to take it to Harvey.\n\nI knew him a little bit through my relationship with the director Robert Rodriguez and the producer Elizabeth Avellan, who was then his wife, with whom I had done several films and who had taken me under their wing. All I knew of Harvey at the time was that he had a remarkable intellect, he was a loyal friend and a family man.\n\nKnowing what I know now, I wonder if it wasn’t my friendship with them — and Quentin Tarantino and George Clooney — that saved me from being raped.\n\nThe deal we made initially was that Harvey would pay for the rights of work I had already developed. As an actress, I would be paid the minimum Screen Actors Guild scale plus 10 percent. As a producer, I would receive a credit that would not yet be defined, but no payment, which was not that rare for a female producer in the ’90s. He also demanded a signed deal for me to do several other films with Miramax, which I thought would cement my status as a leading lady.\n\nSign Up for the Opinion Today Newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, The Times editorial board and contributing writers from around the world.\n\nI did not care about the money; I was so excited to work with him and that company. In my naïveté, I thought my dream had come true. He had validated the last 14 years of my life. He had taken a chance on me — a nobody. He had said yes.\n\nLittle did I know it would become my turn to say no.\n\nNo to opening the door to him at all hours of the night, hotel after hotel, location after location, where he would show up unexpectedly, including one location where I was doing a movie he wasn’t even involved with.\n\nNo to me taking a shower with him.\n\nNo to letting him watch me take a shower.\n\nNo to letting him give me a massage.\n\nNo to letting a naked friend of his give me a massage.\n\nNo to letting him give me oral sex.\n\nNo to my getting naked with another woman.\n\nNo, no, no, no, no …\n\nAnd with every refusal came Harvey’s Machiavellian rage.\n\nI don’t think he hated anything more than the word “no.” The absurdity of his demands went from getting a furious call in the middle of the night asking me to fire my agent for a fight he was having with him about a different movie with a different client to physically dragging me out of the opening gala of the Venice Film Festival, which was in honor of “Frida,” so I could hang out at his private party with him and some women I thought were models but I was told later were high-priced prostitutes.\n\nThe range of his persuasion tactics went from sweet-talking me to that one time when, in an attack of fury, he said the terrifying words, “I will kill you, don’t think I can’t.”\n\nWhen he was finally convinced that I was not going to earn the movie the way he had expected, he told me he had offered my role and my script with my years of research to another actress.\n\nIn his eyes, I was not an artist. I wasn’t even a person. I was a thing: not a nobody, but a body.\n\nAt that point, I had to resort to using lawyers, not by pursuing a sexual harassment case, but by claiming “bad faith,” as I had worked so hard on a movie that he was not intending to make or sell back to me. I tried to get it out of his company.\n\nHe claimed that my name as an actress was not big enough and that I was incompetent as a producer, but to clear himself legally, as I understood it, he gave me a list of impossible tasks with a tight deadline:\n\n1. Get a rewrite of the script, with no additional payment.\n\n2. Raise $10 million to finance the film.\n\n3. Attach an A-list director.\n\n4. Cast four of the smaller roles with prominent actors.\n\nThe #MeToo Moment The latest news and insights on the sexual harassment and misconduct scandals roiling society.\n\nMuch to everyone’s amazement, not least my own, I delivered, thanks to a phalanx of angels who came to my rescue, including Edward Norton, who beautifully rewrote the script several times and appallingly never got credit, and my friend Margaret Perenchio, a first-time producer, who put up the money. The brilliant Julie Taymor agreed to direct, and from then on she became my rock. For the other roles, I recruited my friends Antonio Banderas, Edward Norton and my dear Ashley Judd. To this day, I don’t know how I convinced Geoffrey Rush, whom I barely knew at the time.\n\nNow Harvey Weinstein was not only rejected but also about to do a movie he did not want to do.\n\nIronically, once we started filming, the sexual harassment stopped but the rage escalated. We paid the price for standing up to him nearly every day of shooting. Once, in an interview he said Julie and I were the biggest ball busters he had ever encountered, which we took as a compliment.\n\nHalfway through shooting, Harvey turned up on set and complained about Frida’s “unibrow.” He insisted that I eliminate the limp and berated my performance. Then he asked everyone in the room to step out except for me. He told me that the only thing I had going for me was my sex appeal and that there was none of that in this movie. So he told me he was going to shut down the film because no one would want to see me in that role.\n\nIt was soul crushing because, I confess, lost in the fog of a sort of Stockholm syndrome, I wanted him to see me as an artist: not only as a capable actress but also as somebody who could identify a compelling story and had the vision to tell it in an original way.\n\nI was hoping he would acknowledge me as a producer, who on top of delivering his list of demands shepherded the script and obtained the permits to use the paintings. I had negotiated with the Mexican government, and with whomever I had to, to get locations that had never been given to anyone in the past — including Frida Kahlo’s houses and the murals of Kahlo’s husband, Diego Rivera, among others.\n\nBut all of this seemed to have no value. The only thing he noticed was that I was not sexy in the movie. He made me doubt if I was any good as an actress, but he never succeeded in making me think that the film was not worth making.\n\nHe offered me one option to continue. He would let me finish the film if I agreed to do a sex scene with another woman. And he demanded full-frontal nudity.\n\nHe had been constantly asking for more skin, for more sex. Once before, Julie Taymor got him to settle for a tango ending in a kiss instead of the lovemaking scene he wanted us to shoot between the character Tina Modotti, played by Ashley Judd, and Frida.\n\nBut this time, it was clear to me he would never let me finish this movie without him having his fantasy one way or another. There was no room for negotiation.\n\nI had to say yes. By now so many years of my life had gone into this film. We were about five weeks into shooting, and I had convinced so many talented people to participate. How could I let their magnificent work go to waste?\n\nI had asked for so many favors, I felt an immense pressure to deliver and a deep sense of gratitude for all those who did believe in me and followed me into this madness. So I agreed to do the senseless scene.\n\nI arrived on the set the day we were to shoot the scene that I believed would save the movie. And for the first and last time in my career, I had a nervous breakdown: My body began to shake uncontrollably, my breath was short and I began to cry and cry, unable to stop, as if I were throwing up tears.\n\nSince those around me had no knowledge of my history of Harvey, they were very surprised by my struggle that morning. It was not because I would be naked with another woman. It was because I would be naked with her for Harvey Weinstein. But I could not tell them then.\n\nMy mind understood that I had to do it, but my body wouldn’t stop crying and convulsing. At that point, I started throwing up while a set frozen still waited to shoot. I had to take a tranquilizer, which eventually stopped the crying but made the vomiting worse. As you can imagine, this was not sexy, but it was the only way I could get through the scene.\n\nBy the time the filming of the movie was over, I was so emotionally distraught that I had to distance myself during the postproduction.\n\nWhen Harvey saw the cut film, he said it was not good enough for a theatrical release and that he would send it straight to video.\n\nThis time Julie had to fight him without me and got him to agree to release the film in one movie theater in New York if we tested it to an audience and we scored at least an 80.\n\nLess than 10 percent of films achieve that score on a first screening.\n\nI didn’t go to the test. I anxiously awaited to receive the news. The film scored 85.\n\nAnd again, I heard Harvey raged. In the lobby of a theater after the screening, he screamed at Julie. He balled up one of the scorecards and threw it at her. It bounced off her nose. Her partner, the film’s composer Elliot Goldenthal, stepped in, and Harvey physically threatened him.\n\nOnce he calmed down, I found the strength to call Harvey to ask him also to open the movie in a theater in Los Angeles, which made a total of two theaters. And without much ado, he gave me that. I have to say sometimes he was kind, fun and witty — and that was part of the problem: You just never knew which Harvey you were going to get.\n\nMonths later, in October 2002, this film, about my hero and inspiration — this Mexican artist who never truly got acknowledged in her time with her limp and her unibrow, this film that Harvey never wanted to do, gave him a box office success that no one could have predicted, and despite his lack of support, added six Academy Award nominations to his collection, including best actress.\n\nEven though “Frida” eventually won him two Oscars, I still didn’t see any joy. He never offered me a starring role in a movie again. The films that I was obliged to do under my original deal with Miramax were all minor supporting roles.\n\nYears later, when I ran into him at an event, he pulled me aside and told me he had stopped smoking and he had had a heart attack. He said he’d fallen in love and married Georgina Chapman, and that he was a changed man. Finally, he said to me: “You did well with ‘Frida’; we did a beautiful movie.”\n\nI believed him. Harvey would never know how much those words meant to me. He also would never know how much he hurt me. I never showed Harvey how terrified I was of him. When I saw him socially, I’d smile and try to remember the good things about him, telling myself that I went to war and I won.\n\nBut why do so many of us, as female artists, have to go to war to tell our stories when we have so much to offer? Why do we have to fight tooth and nail to maintain our dignity?\n\nI think it is because we, as women, have been devalued artistically to an indecent state, to the point where the film industry stopped making an effort to find out what female audiences wanted to see and what stories we wanted to tell.\n\nAccording to a recent study, between 2007 and 2016, only 4 percent of directors were female and 80 percent of those got the chance to make only one film. In 2016, another study found, only 27 percent of words spoken in the biggest movies were spoken by women. And people wonder why you didn’t hear our voices sooner. I think the statistics are self-explanatory — our voices are not welcome.\n\nUntil there is equality in our industry, with men and women having the same value in every aspect of it, our community will continue to be a fertile ground for predators.\n\nI am grateful for everyone who is listening to our experiences. I hope that adding my voice to the chorus of those who are finally speaking out will shed light on why it is so difficult, and why so many of us have waited so long. Men sexually harassed because they could. Women are talking today because, in this new era, we finally can.", "images": ["https://static01.nyt.com/images/2017/12/12/opinion/contributors/12hayek-bg/12hayek-bg-master180-v3.jpg", "https://static01.nyt.com/images/2017/12/13/opinion/13hayek2/13hayek2-master180.jpg", "https://static01.nyt.com/images/2017/10/20/opinion/19nyongoWeb/19nyongoWeb-mediumThreeByTwo225.jpg", "https://static01.nyt.com/images/2017/12/17/opinion/contributors/17hayek1/12hayek-web-1513168243575-facebookJumbo.jpg", "https://static01.nyt.com/images/2017/10/06/us/06inquiry-alpha/06inquiry-alpha-mediumThreeByTwo225-v3.jpg", "https://static01.nyt.com/images/2017/12/07/opinion/07WILLIAMS1/07WILLIAMS1-mediumThreeByTwo225.jpg", "https://static01.nyt.com/images/2017/10/10/us/10actress-alpha/10actress-alpha-mediumThreeByTwo225-v2.jpg", "https://static01.nyt.com/images/2017/10/15/opinion/sunday/15Polley/15Polley-mediumThreeByTwo225.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://static01.nyt.com/images/2017/12/17/opinion/contributors/17hayek1/12hayek-web-1513168243575-facebookJumbo.jpg", "keywords": [], "authors": ["Salma Hayek"], "canonical_link": "https://www.nytimes.com/interactive/2017/12/13/opinion/contributors/salma-hayek-harvey-weinstein.html", "title": "Opinion | Harvey Weinstein Is My Monster Too", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "fb": {"app_id": 9869919170}, "twitter": {"site": "@nytimes", "url": "https://www.nytimes.com/interactive/2017/12/13/opinion/contributors/salma-hayek-harvey-weinstein.html", "title": "Opinion | Harvey Weinstein Is My Monster Too", "description": "He threatened to shut down “Frida” if I didn’t comply with his demands.", "image": "https://static01.nyt.com/images/2017/12/17/opinion/contributors/17hayek1/12hayek-web-1513168243575-videoSixteenByNineJumbo1600.jpg", "card": "summary_large_image"}, "sourceApp": "nyt-v5", "applicationName": "interactive", "foundation-build-id": "nyt-v5", "PT": "Multimedia", "PST": "Interactive", "tom": "interactive_feature", "hdl": "Harvey Weinstein Is My Monster Too", "slug": "salma-hayek-harvey-weinstein", "lp": "He threatened to shut down “Frida” if I didn’t comply with his demands.", "dfp-ad-unit-path": "opinion/sunday", "keywords": "Hayek, Salma,Weinstein, Harvey,Sexual Harassment,Miramax Films,Actors and Actresses,Women and Girls,Discrimination,#MeToo Movement,Sex Crimes,Kahlo, Frida", "nyt-collection": {"display-name": "Harassed - Articles from Opinion", "identifier": "harass-opinion", "url": "https://www.nytimes.com/spotlight/harass-opinion", "uri": "/spotlight/harass-opinion", "tone": "opinion", "tagline": "The New York Times uncovered the secret histories of prominent men across industries who were accused of sexual harassment and misconduct that affected women ranging from actresses to factory workers to food servers. These articles set off workplace investigations, criminal inquiries — and the #MeToo movement.", "type": "spotlight"}, "article": {"collection": "https://static01.nyt.com/services/json/sectionfronts/opinion/index.jsonp", "published": "2017-12-13T16:43:51.000Z", "modified": "2018-04-16T18:03:46.211Z", "section": "Opinion", "tag": "Kahlo, Frida", "opinion": "true", "content_tier": "metered"}, "DISPLAYDATE": "Dec. 13, 2017", "dat": "Dec. 13, 2017", "author": "Salma Hayek", "robots": "noarchive", "articleid": 100000005598891, "nyt_uri": "nyt://interactive/4c3a081b-6a66-5703-b7a0-a3d631febab9", "pubp_event_id": "pubp://event/6419f08e48124d1e96645a2c4509d451", "description": "He threatened to shut down “Frida” if I didn’t comply with his demands.", "image": "https://static01.nyt.com/images/2017/12/17/opinion/contributors/17hayek1/12hayek-web-1513168243575-facebookJumbo.jpg", "byl": "By Salma Hayek", "thumbnail": "https://static01.nyt.com/images/2017/12/17/opinion/contributors/17hayek1/12hayek-web-1513168243575-thumbStandard.jpg", "news_keywords": "Salma Hayek,Harvey Weinstein,Sexual harassment,Miramax Films,Actor,Women and Girls,Discrimination,MeToo Movement,Rape,Frida Kahlo", "pdate": 20171213, "og": {"url": "https://www.nytimes.com/interactive/2017/12/13/opinion/contributors/salma-hayek-harvey-weinstein.html", "type": "article", "title": "Opinion | Harvey Weinstein Is My Monster Too", "image": "https://static01.nyt.com/images/2017/12/17/opinion/contributors/17hayek1/12hayek-web-1513168243575-facebookJumbo.jpg", "description": "He threatened to shut down “Frida” if I didn’t comply with his demands."}, "CG": "opinion", "SCG": "sunday", "CN": "harass-opinion", "CT": "spotlight", "hostApp": "vi", "typ": "int", "template": "interactive", "ver": "nyt5", "sov": 4, "vp": "small", "test": "projectvi", "gpt-beta": "vqwdtftx", "prop": "mnyt", "plat": "mweb", "edn": "us", "als_test": 1587192040257, "brandsensitive": "true", "per": "hayeksalma,weinsteinharvey,kahlofrida", "org": "miramaxfilms", "des": "sexcrimes", "coll": "opinion,sundayreview,gendersociety,harassedarticlesfromopinion", "artlen": "short", "ledemedsz": "none", "section": "opinion", "si_section": "opinion", "id": 100000005598891, "gscat": "neg_ibmtest,neg_mastercard,neg_ibm,gs_entertain,neg_hearts,neg_bp,gs_entertain_movies,neg_msft,neg_orep,neg_capitalone,neg_chanel,neg_google,neg_cathay,neg_samsung,neg_mktg_safe_q4_2019,gv_crime,gs_t", "adtargeting": "{\"typ\":\"int\",\"template\":\"interactive\",\"ver\":\"mvi\",\"sov\":\"4\",\"vp\":\"small\",\"test\":\"projectvi\",\"ref\":\"\",\"refdom\":\"\",\"abra_dfp\":\"\",\"gpt-beta\":\"vqwdtftx\",\"prop\":\"mnyt\",\"plat\":\"mweb\",\"edn\":\"us\",\"als_test\":\"1587192040257\",\"brandsensitive\":\"true\",\"per\":\"hayeksalma,weinsteinharvey,kahlofrida\",\"org\":\"miramaxfilms\",\"des\":\"sexualharassment,actorsandactresses,womenandgirls,discrimination,metoomovement,sexcrimes\",\"coll\":\"opinion,sundayreview,gendersociety,harassedarticlesfromopinion\",\"artlen\":\"short\",\"ledemedsz\":\"none\",\"section\":\"opinion\",\"si_section\":\"opinion\",\"id\":\"100000005598891\",\"gscat\":\"neg_ibmtest,neg_mastercard,neg_ibm,gs_entertain,neg_hearts,neg_bp,gs_entertain_movies,neg_msft,neg_orep,neg_capitalone,neg_chanel,neg_google,neg_cathay,neg_samsung,neg_mktg_safe_q4_2019,gv_crime,gs_t\"}", "adunitpath": "/29390238/nyt/undefined"}, "movies": [], "publish_date": 1513094400.0, "source": "http://www.nytimes.com", "summary": ""}