{"url": "en.wikipedia.org/wiki/Royal_Christmas_Message", "text": "For special royal messages to the nation, see Royal address to the nation\n\nThe first televised Christmas Message, broadcast in 1957\n\nThe Queen's Christmas Message (also known as The King's Christmas Message in the reign of a male monarch, formally as Her Majesty's Most Gracious Speech[1]) is a broadcast made by the sovereign of the Commonwealth realms to the Commonwealth of Nations each Christmas. The tradition began in 1932 with a radio broadcast by King George V on the British Broadcasting Corporation's Empire Service. Since 1952, the message has been read by Elizabeth II; today, it is broadcast on television, radio, and the Internet via various providers.\n\nHistory [ edit ]\n\nThe idea for a Christmas message from the sovereign to the British Empire was first proposed by the \"founding father\" of the British Broadcasting Corporation (BBC), John Reith, in 1922 when he approached King George V about making a short broadcast on the newly created radio service. The King declined, however, believing that radio was mainly an entertainment.[2] Reith approached the King again ten years later, in 1932,[3] as a way to inaugurate the Empire Service (now the World Service) and the King finally agreed after being encouraged to do so by Queen Mary[2] and Prime Minister Ramsay MacDonald.[4] That year, George V read the first Royal Christmas Message; the King was originally hesitant about using the relatively untested medium of radio, but was reassured after a summertime visit to the BBC and agreed to carry out the concept and read the speech from a temporary studio set up at Sandringham House.[5] The broadcast was introduced from Ilmington Manor by 65-year-old Walton Handy, a local shepherd, with carols from the church choir and the bells ringing from the town church, and reached an estimated 20 million people in Australia, Canada, India, Kenya, South Africa and the United Kingdom.[5]\n\nWhile his brother, Edward VIII, abdicated just before his first Christmas as king, George VI continued his father's Christmas broadcasts; it was in his 1939 reading delivered in the opening stages of the Second World War that he uttered the famous lines: \"I said to the man who stood at the Gate of the Year.\"[6]\n\nFor many years, the King's speech came at the end of an hour-long broadcast of greeting from various parts of the British Empire and Commonwealth which typically included interviews with ordinary people of many occupations such as an innkeeper in an English village, a minder in South Africa, and a lifeguard in Australia with the King's speech serving as a bond tying the Commonwealth together.[2]\n\nGeorge's daughter and successor, Elizabeth II, gave her first Christmas message to the Commonwealth of Nations from her study at Sandringham House, at 3:07 PM on 25 December 1952, some 11 months after her father's death. Five years later, the tradition was first broadcast on television[7] and, from then until 1996, was produced by the BBC; only in 1969 was no message given because a special documentary film, Royal Family, had been made during the summer in connection with the investiture of the Prince of Wales. It was therefore decided not to do a broadcast at Christmas, but the Queen issued a written message instead.\n\nThe Queen ended this monopoly, however, announcing that the message would, from 1997, be produced and broadcast alternately by the BBC and its main rival, Independent Television News (ITN), with a biennial rotation.[8] It was reported by The Daily Telegraph that this decision was made after the BBC decided to screen an interview with Diana, Princess of Wales, on its current affairs programme Panorama.[9] This was denied by Buckingham Palace which said the new arrangements \"reflect the composition of the television and radio industries today\".[10] Beginning in 2011, Sky News was added to the rotation.[10]\n\nSky News recorded the Queen's Christmas message for Christmas 2012, the Queen's Diamond Jubilee year, and for the first time it has been recorded in 3D.[11] Buckingham Palace are reported to have explained: \"We wanted to do something a bit different and special in this Jubilee year, so doing it for the first time in 3D seemed a good thing, technology wise, to do.\"[11]\n\nThe themes and direction of the speech are decided by the Queen and the text is largely written by the Queen herself, sometimes with assistance from Prince Philip and her staff. In recent years, the speech has become more personal and religious in tone.[12]\n\nBroadcast [ edit ]\n\nThe message typically combines a chronicle of that year's major events, with specific focus on the British Empire originally and later the Commonwealth of Nations, with the sovereign's own personal milestones and feelings on Christmas. It is one of the few instances when the sovereign speaks publicly without advice from any ministers of the Crown in any of the monarch's realms. Planning for each year's address begins months earlier, when the monarch establishes a theme and appropriate archival footage is collected and assembled; the actual speech is recorded a few days prior to Christmas.[5]\n\nIn the United Kingdom and on the Internet, broadcast of the Queen's Christmas message is embargoed until 15:00 GMT on 25 December. In other parts of the Commonwealth, the message is first broadcast in New Zealand at 18:06 local time by Radio New Zealand on RNZ National, then again at 18:50 by Television New Zealand on TVNZ1, in Australia by the Australian Broadcasting Corporation at 15:20 local time, and in Canada by the Canadian Broadcasting Corporation at noon local time on television, 14:50 local time on CBC Radio One and CBC Music.\n\nOutside of the Commonwealth, C-SPAN in the United States also airs the Queen's Message although the times that the message airs can vary, depending on C-SPAN's schedule. No US radio station airs the broadcast, although some bordering areas in Canada can also receive the message via the CBC.\n\nMessages [ edit ]\n\n1930s [ edit ]\n\n1940s [ edit ]\n\n1950s [ edit ]\n\n1960s [ edit ]\n\n1970s [ edit ]\n\n1980s [ edit ]\n\n1990s [ edit ]\n\n2000s [ edit ]\n\n2010s [ edit ]\n\nSimilar messages elsewhere [ edit ]\n\nIn 1931, Queen Wilhelmina of the Netherlands delivered her first Christmas message on the airwaves, which was also broadcast to the Dutch East Indies, Suriname and the other Dutch West Indies via shortwave radio station PCJJ. During the reign of her daughter Juliana, the Royal Christmas Message was to become an annual tradition.[143]\n\nThe Pope delivers a Christmas message to the world and heads of state of other countries have adopted the tradition of a message at Christmas, including the King of Sweden, the King of the Belgians, the President of Germany, and the King of Spain.\n\nOthers have modified the practice by issuing a statement to coincide with the New Year; this is done by the Governors-General of Canada and New Zealand, the Queen of Denmark, the King of Norway, the King of Thailand, the Presidents of China, Finland, France, Hungary, Italy, the Philippines, Poland, and the Russian Federation, as well as the Chancellor of Germany. The Archbishop of Canterbury, spiritual leader of the Anglican Communion, also gives a New Year's Day speech. The British Prime Minister issues a short Christmas message and the Prime Minister's New Year Message which extensively reflects on the last year and the governments intentions in the new year.\n\nThe Yang di-Pertuan Agong of Malaysia makes speeches on his official birthday in June and on National Heroes Day in July, while the Prime Minister of Malaysia also makes speeches not only on New Year's Day but also on the night of Eid ul-Fitr and on the eve of Independence Day. The Prime Minister of Singapore gives his speech on this occasion and on the National Day of Singapore. In the past, the Governor of Hong Kong, as the representative of the British monarch, played this role; the tradition was carried on by the Chief Executive upon the territory's handover to China in 1997.\n\nThe President of the United States also gives out Christmas messages as part of the President's Weekly Address. Some of these messages come out within a few days before Christmas or on Christmas Day. The President may also give out Christmas message to soldiers serving in the U.S. Armed Forces.[144] The opposition party may also give out their Christmas messages as part of their response to the President's weekly address. In addition, beginning in 1986, US President Ronald Reagan and Soviet Union President Mikhail Gorbachev exchanged televised New Year's Day addresses to the other's respective nations. This exchange continued between President George H. W. Bush and Gorbachev until the demise of the Soviet Union.\n\n\n\n\n\nSee also [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/12px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/7/77/Christmas_broadcast_1957.png/220px-Christmas_broadcast_1957.png", "https://upload.wikimedia.org/wikipedia/en/7/77/Christmas_broadcast_1957.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Royal_broadcast%2C_Christmas_1934_%28Our_Generation%2C_1938%29.jpg/220px-Royal_broadcast%2C_Christmas_1934_%28Our_Generation%2C_1938%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Wikisource-logo.svg/15px-Wikisource-logo.svg.png", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/79/P_christianity.svg/31px-P_christianity.svg.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/7/77/Christmas_broadcast_1957.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Royal_Christmas_Message", "title": "Royal Christmas Message", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/7/77/Christmas_broadcast_1957.png"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}