{"url": "https://www.independent.co.uk/news/world/americas/game-of-thrones-jason-momoa-raping-beautiful-women-joke-video-actor-comic-con-a7998056.html", "text": "Game of Thrones actor Jason Momoa joked about raping beautiful women during a panel discussion, a recently resurfaced video clip has shown.\n\nThe actor made the comments during a talk at 2011 Comic Con, a comic conference held annually in California. The footage has been widely shared on social media since it was uploaded to Twitter on Thursday.\n\nIn the clip, Mr Momoa is heard to say: “But as far as sci-fi and fantasy, I love that genre.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\n\"There's so many things you can do, like rip someone's tongue out of their throat and get away with it...rape a beautiful woman, you know?\"\n\nAfter these comments, the audience laughs while several of the actor’s fellow panel members look uncomfortable.\n\nMr Momoa quickly says, “next question?” and covers his face with his jacket.\n\nMany took to social media to condemn the joke. One Twitter user, Meg Ahsens, said: “Everyone laughing after Jason Momoa jokes about rape IS rape culture. That laughter is why victims don't come forward.”\n\nThe actor has since apologised for the remarks. In a statement posted to his Instagram account, he said: “I awoke in Australia to the justified reactions by many people to a distasteful joke I made years ago in Hall H for which I am sorry. I am still severely disappointed in myself at the insensitivity of my remarks that day.\n\n“I know my sincerest apology won’t take away those hurtful words. Rape and sexual harassment can reach anyone and I have seen first-hand its painful torment among members of my own family and friends.\"\n\nThis footage has emerged after a flurry of allegations of rape and sexual assault made against Hollywood producer Harvey Weinstein.\n\nOn Thursday, Kate Beckinsale became the latest actress to accuse Mr Weinstein of harassment, saying he had made inappropriate advances when she was just 17.\n\nThe number of actresses who have come forward to accuse the producer of harassment and assault continues to grow, and now includes Gwyneth Paltrow, Angelina Jolie and Ashley Judd.\n\nDaily coronavirus briefing No hype, just the advice and analysis you need Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nThe New York Police Department and Metropolitan Police have opened investigations into further historical allegations of assault against the mogul, whose films have been nominated for more than 300 Oscars.", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/10/13/08/jason-momoa-new.jpg", "https://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/10/13/08/jason-momoa-new.jpg", "keywords": [], "authors": ["Niamh Mcintyre"], "canonical_link": "https://www.independent.co.uk/news/world/americas/game-of-thrones-jason-momoa-raping-beautiful-women-joke-video-actor-comic-con-a7998056.html", "title": "Game of Thrones actor Jason Momoa joked about 'raping beautiful women' on TV show", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "http://www.independent.co.uk/news/world/americas/game-of-thrones-jason-momoa-raping-beautiful-women-joke-video-actor-comic-con-a7998056.html", "title": "Game of Thrones actor said: 'I love my job so I can rape beautiful women'", "description": "Old footage of Jason Momoa making rape joke resurfaces on social media", "updated_time": "2017-10-13T10:08:16+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/10/13/08/jason-momoa-new.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB", "video": {"identifier": "https://f1.media.brightcove.com/4/624246174001/624246174001_5608663114001_5608642061001.mp4?pubId=624246174001&videoId=5608642061001", "type": "application/octet-stream"}}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/7998056"}, "description": "Game of Thrones actor Jason Momoa joked about raping beautiful women during a panel discussion, a recently resurfaced video clip has shown. The actor made the comments during a talk at 2011 Comic Con, a comic conference held annually in California. The footage has been widely shared on social media since it was uploaded to Twitter on Thursday.", "keywords": "Jason Momoa, Game of Thrones, rape, sexual assault, Harvey Weinstein, Americas, World, News", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Jason Momoa", "published_time": "2017-10-13T09:06:00+01:00", "modified_time": "2017-10-13T10:08:16+01:00", "section": "Americas", "subsection": "Culture, Video", "author_name": "Niamh McIntyre", "content_type": "story", "word_count": 458, "image_count": 1, "video_count": 0, "embed_count": 0, "internal_link_count": 6, "external_link_count": 4}, "twitter": {"title": "Game of Thrones actor said: 'I love my job so I can rape beautiful w…", "description": "Game of Thrones actor Jason Momoa joked about raping beautiful women during a panel discussion, a recently resurfaced video clip has shown. The actor made the comments during a talk at 2011 Comic", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1507881960.0, "source": "https://www.independent.co.uk", "summary": ""}