{"url": "https://people.com/parents/nick-lachey-vanessa-kids-parenting-no-spontaneous-date-nights/", "text": "For Nick and Vanessa Lachey, family comes first.\n\n“That was one of the things I think that really drew us to each other is we both really value family and how important family is,” Nick, 43, tells PEOPLE for the annual World’s Most Beautiful issue.\n\nGet push notifications with news, features and more.\n\n“We both knew we wanted a family,” he adds, explaining that “at this point” in the couple’s lives, “it is the single biggest priority” for them.\n\nAnd with three little ones — Phoenix Robert, 4 months, Brooklyn Elisabeth, 2, and Camden John, 4½ — Vanessa, 36, credits “a lot of teamwork” to helping the pair strike a balance. “I say this all the time: I would not be able to do this without an active husband, daddy,” she shares.\n\n“It’s all hands on deck,” says Nick.\n\nImage zoom Fabio Chizzola\n\nWant all the latest pregnancy and birth announcements, plus celebrity mom blogs? Click here to get those and more in the PEOPLE Babies newsletter.\n\n“Nick is incredible,” Vanessa says. “Nick is the reason that we are, I think, sane. He is our foundation. He is our rock. He keeps it together because Lord knows I can’t.”\n\nAlthough spending time with their kids is top priority, the couple, who tied the knot in 2011, still makes sure to “carve out time” for themselves.\n\n“It’s easy, especially with multiple kids, to just get caught up in that — and it’s a beautiful thing to get caught up in,” says Nick. “But it’s also good to have a balance where you’re still seeing your friends, you’re still having date night, you’re still doing things that are important to you outside of your family.”\n\nImage zoom Fabio Chizzola\n\nHowever, when it comes to making plans without their children, they need to know “at least a week in advance,” says Vanessa.\n\n“There’s no spontaneous date nights,” she shares. “We have to make a full plan [and] make sure there’s nothing with the [kids’] schedules.”\n\n\n\nMost of the time, the family of five is together. “We spend a lot of time together as a family,” says Nick. “I think at this age it’s a lot of going to the park. It’s a lot of going to get ice cream or just fun stuff at their age they can do.”\n\nAnd when it comes to the couple’s parenting style, Nick describes it as “moderate.” “I don’t think we turn away and say, ‘Hey! Let the kids do whatever they want,’ ” he says, “but we also don’t want to be helicopter parents where we’re constantly berating and berating, and after a while I think it just falls on deaf ears.”\n\nAdds Vanessa, “I believe things that are important to us, we’re strict about. For example, manners.”\n\n“We always make sure you have to clean up after yourself,” she explains. ” ‘You have to say please. You have to say thank you. Look someone in the eye when you talk to them. Make sure that you keep your hands to yourself. Don’t do that to your sister,’ and that is a constant — and I say it’s exhausting because it’s a constant lesson.”\n\nShe continues, “But when you see moments of it paying off and [Camden] walking and going, ‘Excuse me? May I have an ice-cream cone, please?’ and he looks at him in the eye, and says, ‘Thank you,’ you’re like, ‘They do listen!’ ”\n\nEven though it’s always a team effort between the pair, Nick admits, “If it gets bad” he’s “the bad cop for sure.”\n\nExplains Vanessa, “I think it’s because — and I told Nick this — they love and respect him so much that they don’t want to disappoint him. And when Nick is upset, you can see it in his face, and he’s not okay. Literally, he can look at them and they’ll get the quiver lip.”\n\n“It’s the dad look,” says Nick, adding that as far as disciplining their children equally, Vanessa thinks he’s “a complete pushover” with Brooklyn.\n\n“It’s not true,” he insists. “I handle it in different ways, but I discipline her.”\n\nWatch the full episode of World’s Most Beautiful: My Beautiful Family now on the new People/Entertainment Weekly Network (PEN). Go to PEOPLE.com/PEN or download the PEN app on your favorite device.\n\nFor Vanessa, the “true test” will be how Nick is with Phoenix.\n\n“[He does] let a lot go with [Brooklyn],” she says, “And I’m like, ‘That would’ve never flown with Camden.’ ”\n\nAs for their best and worst qualities as parents? “Vanessa’s best quality as a parent is her absolute across-the-board, unwavering love for her kids, and she never lets a moment go by where her kids don’t know how much she loves them,” says Nick, adding, “That love, sometimes, allows her to spoil the heck out of the kids.”\n\n“Camden’s car collection rivals Jay Leno‘s,” he teases. “But I guess that’s not really a bad flaw.”\n\nRELATED VIDEO: Hearing Nick Lachey Gush About His Kids Will Warm Your Heart\n\nFor Nick, his best and worst quality is his “sensitivity,” says Vanessa.\n\n“He’s so sensitive to the kids that he’s an amazing dad because he’s very aware of how they’re feeling and what’s going on with them,” she explains. “He’s so in tune with them that it’s a beautiful thing to watch, and watch his parenting with that sensitivity.”\n\n“But then to a fault, he worries so much,” she continues. ” ‘Did you see that?’ I’m like, ‘Babe! He’s 4.’ He’s like, ‘Man. I don’t know.’ ”\n\nEven Nick, himself, admits he’s “banned from WebMD.”\n\n“I’m not allowed to go on WebMD anymore,” he says, adding that he’s not a hypochondriac and that he just tends to “look up symptoms.”\n\nBut the couple shares that, over the years, they’ve grown as parents.\n\n“I think by the time [you have] your first one, everything is so surreal and you’re so precious and paranoid about everything as first-time parents,” explains Nick. “And then by the second one, you’ve been down that road once, so you’re a little bit more prepared for what’s going to come, so you’re a little bit more relaxed. And then by the third, I think you let down your guard even a little bit more, but it’s all in a positive way.”\n\n“I try to tell women it’s like a quiet confident,” adds Vanessa. “It’s just a calm feeling that overtakes you.”\n\nStill, all three of their kids are “very different,” she says.\n\n“They test you,” Vanessa admits. “No matter what you think you know with one, you get all new challenges with the next. You get all new challenges with the third … it’s just something new every time.”\n\nHowever, the parents of three may not find out what it’s like to add another baby to their family.\n\n“We’re very happy with our three,” shares Vanessa. “It’s not that we’re like, ‘No!’ It’s just we love the dynamic we have.”\n\nShe explains, “We had the boy and the girl, and three was the wild card — whenever it happened, it was going to happen, and it happened sooner than I think we thought.”\n\nImage zoom\n\nFor the couple, Phoenix’s arrival was “exciting” and “such a welcoming surprise.”\n\n“Five of us, three kids, is a good number,” says Vanessa. “Any more than that and we’re really outnumbered.”\n\nShe adds, “We personally would have no time for ourselves and life in general, and it just becomes madness. People who do it, I commend them. I applaud them. We respect them, but we’re good at three.”\n\n\n\nFor more from the Lacheys and more celebrity families, pick up PEOPLE’s World’s Most Beautiful issue, on newsstands now.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Flachey-family-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Flachey-family-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fjulia-wmb-cover.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Flachey-family-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Flachey-family-2-2000.jpg", "keywords": [], "authors": ["Mariah Haas"], "canonical_link": "https://people.com/parents/nick-lachey-vanessa-kids-parenting-no-spontaneous-date-nights/", "title": "Nick and Vanessa Lachey Talk Raising Three Kids", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Babies,Babies Exclusives,Babies Photos,Exclusive,Kids,Nick Lachey,Parenting,Vanessa Lachey,World's Most Beautiful", "news_keywords": "Babies,Babies Exclusives,Babies Photos,Exclusive,Kids,Nick Lachey,Parenting,Vanessa Lachey,World's Most Beautiful", "description": "\"Any more than [three] and we're really outnumbered,\" says Vanessa Lachey, who is mom to sons Phoenix, 4 months, and Camden, 4½, plus daughter, Brooklyn, 2", "og": {"title": "Nick and Vanessa Lachey Talk Raising Three Kids", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/parents/nick-lachey-vanessa-kids-parenting-no-spontaneous-date-nights/", "description": "For Nick and Vanessa Lachey, family comes first. “That was one of the things I think that really drew us to each other is we&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Flachey-family-2-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/parents/nick-lachey-vanessa-kids-parenting-no-spontaneous-date-nights/", "description": "\"Any more than [three] and we're really outnumbered,\" says Vanessa Lachey, who is mom to sons Phoenix, 4 months, and Camden, 4½, plus daughter, Brooklyn, 2", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Flachey-family-2-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/parents/nick-lachey-vanessa-kids-parenting-no-spontaneous-date-nights/", "title": "Nick and Vanessa Lachey Talk Raising Three Kids", "description": "\"Any more than [three] and we're really outnumbered,\" says Vanessa Lachey, who is mom to sons Phoenix, 4 months, and Camden, 4½, plus daughter, Brooklyn, 2", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Flachey-family-2-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}