{"url": "https://en.wikipedia.org/wiki/Teen_Mom", "text": "This article is about the reality television series. For teenage pregnancy and motherhood, see Teenage pregnancy\n\nTeen Mom (renamed Teen Mom OG from the fifth season) is an American reality television series broadcast by MTV. It is the first spin-off of 16 and Pregnant, and it focuses on the lives of several young mothers as they navigate motherhood and strained family and romantic relationships. Its first run consists of four seasons originally aired between December 8, 2009, and October 9, 2012, while another four seasons have aired during its second run that began on March 23, 2015.\n\nThe series originally focused on the lives of Maci Bookout (now McKinney), Catelynn Lowell (now Baltierra), Amber Portwood, and Farrah Abraham, who were featured on the first season of 16 and Pregnant. Are You the One? participant Cheyenne Floyd and television personality Bristol Palin joined in the second half of the seventh season replacing Abraham who departed from the show. However, Palin departed the show following an announcement on Instagram in April 2019. In August 2019, Mackenzie McKee from Teen Mom 3 joined the cast as a guest mom for the last few episodes of season eight. Mackenzie McKee will officially be a main cast member on season 8B.\n\nThe show's success has allowed for the development of the spin-offs Teen Mom 2, Teen Mom 3, Teen Mom: Young and Pregnant, and Teen Mom: Young Moms Club.\n\nCast [ edit ]\n\nFarrah Abraham [ edit ]\n\nAn aspiring model,[1] Farrah Abraham (from Council Bluffs, Iowa) is the mother of Sophia Laurent Abraham, whose father, Derek Underwood, was killed in a car accident on December 28, 2008, two months before her birth.\n\nIn January 2010, Farrah's mother, Debra Danielson, was charged with assault in an Iowa court for hitting her.[2] As a result of the fight with her mother, Farrah and Sophia moved out of her mother's house.\n\nShe started seeing a therapist to discuss the rocky relationship with her family, because she couldn't cope with her mothers actions as well as dealing with her emotions regarding Underwood and his death. Farrah eventually proved to Derek's family through a paternity test that Derek was in fact Sophia's father and then was faced with a lawsuit filed by Derek's mother for grandparents' visitation rights, despite no previous contact with Sophia.\n\nShe published her autobiography, My Teenage Dream Ended in August 2012. In May 2013, Vivid Entertainment released a sex tape featuring Abraham having sex with porn star James Deen. Abraham defended her decision to make and sell her porn video, claiming that she wanted to \"celebrate [her] awesome body\".[3]\n\nIn October 2017, Farrah was fired from the show by producer Morgan J. Freeman. He explained her choice to return to the adult entertainment industry was in conflict with the overall message of Teen Mom. She was later replaced by Bristol Palin and Cheyenne Floyd\n\nMaci McKinney [ edit ]\n\nMaci McKinney (née Bookout) (from Chattanooga, Tennessee), the mother of Bentley Cadence Edwards, is described by MTV as the classic teenage overachiever who is popular, athletic, and successful in school.[4][5] She had aspirations to go away to college with her friends after she graduated from high school, but her dreams are now on hold as she struggles to take care of Bentley, take online courses at the local state college, and maintain her relationship with Ryan, Bentley's father.[6] Maci gets fed up with Ryan when he does not help her juggle parenthood, school, and work to her satisfaction.[1]\n\nBookout said the reason she participated in the show was because she wanted to get a good message across[6] and stated: \"I really just wanted to show girls how hard it was to be a teen parent. I wanted girls who might get pregnant to see there are options out there to move forward with your life and still have goals.\"[5] She has gone back to college after dropping her online classes, and now is majoring in journalism and hopes to write a book about her experience being 16 and pregnant. She also speaks at local high schools about the challenges of teen pregnancy.[6]\n\nIn December 2014, Maci announced she was expecting her second child, a daughter, with her boyfriend of two years, Taylor McKinney, due in June 2015.[7][8] Bookout gave birth to their daughter, Jayde Carter, on May 29, 2015.[9] In February 2016, Bookout revealed she is expecting her third child, a second son named Maverick Reed, with Taylor McKinney. Maverick made his appearance on May 31, 2016. Maci married Taylor McKinney on October 8, 2016.\n\nCatelynn Baltierra [ edit ]\n\nCatelynn Lowell Baltierra (from Marine City, Michigan) is the birth mother of Carolynn \"Carly\" Elizabeth. Described as a smart and funny high school senior, she struggles to go back to her normal life after her emotional decision to place Carly for adoption. Catelynn is an integral part of the show, letting prospective teen moms know that there are options. She demonstrates that one can go on after becoming a \"birth mom,\" and being completely mature and selfless by choosing parents for her baby via adoption.\n\nCarly's adoptive parents are Brandon and Theresa.[4] Catelynn moves back home with her parents but learns that her mother and stepfather, who is also the father of her boyfriend Tyler, have still not accepted her decision to place her daughter for adoption. During the season, Catelynn comes to terms with being a birth mother, moves in with Tyler and his mother when her mother and her stepfather move into an apartment in another city, and gets engaged to Tyler. She and Tyler both get tattoos in honor of their daughter.\n\nLowell gave birth to their second daughter, Novalee \"Nova\" Reign, on January 1, 2015.[10] The couple were married on August 22, 2015.[11] She gave birth to her third child, Vaeda Luma, on February 23, 2019.[12]\n\nAmber Portwood [ edit ]\n\nAmber Portwood (from Anderson, Indiana) is the mother of Leah Leann Shirley. Amber's journey into parenthood has been tough; she struggles to parent Leah, and stay with her fiancé Gary. She used to be a self-declared party girl, but now discovers she has little time to do anything besides take care of Leah. Amber dropped out of high school when she discovered she was pregnant, but now is working to obtain her GED.\n\nShe has many troubles with her baby's father, Gary. The problems have led to physical violence in front of her child, Leah, including an incident where Amber beats him so severely, he is left with permanent scars. Amber eventually gets arrested for domestic violence against Gary.[4] She had a younger sister, Candace, who died of SIDS when Amber was 5.[13] As of June 2012, Amber was serving a five-year jail sentence, the result of a December 2011 arrest for possession of drugs and failing to complete a court-ordered rehab program. On November 4, 2013, she was released from Indiana's Rockville Correctional Facility (four years early).\n\nOver the course of filming, Portwood became engaged to Matt Baier, an author and onetime DJ. Originally, the wedding was scheduled for October 10, 2016; however, the wedding plans were suspended when it was revealed that, unbeknownst to Portwood, Baier had several children by different women and had fallen behind on child support payments, and that he had reached out to fellow Teen Mom castmates Farrah Abraham and Jenelle Evans before finally pursuing Portwood.[14][15] The couple reconciled.[16] Portwood said she would be inviting all of the Teen Mom stars, \"[e]very single one from Teen Mom 2 and Teen Mom OG.\"[14]\n\nPortwood met Baier over Twitter in 2014 and she says \"she put him through a test to see if he really liked her, and not just because she was on TV\". Both Portwood and Baier have a love of music and past addiction problems in common, according to Portwood.[16] On the 2016 check-up with Dr. Drew, Portwood announces that she and her ex-fiancé Gary have agreed to share 50-50 custody of their 7-year-old daughter, Leah.\n\nFollowing the sixth-season finale and reunion show, Portwood announced she would not be returning to the series. In a series a tweets, Portwood claimed: \"If I was treated fairly it wouldn't be an issue but it's been nothing but disrespect since the reunion show. Which keeps continuing today. [...] Nothing has been dealt with or has made me feel any safer to even move on with people who have continuously hidden things from the network. The day I'm shown some respect by the people I've worked with for 8 years is the day I'll be back. I've sacrificed a lot for this show.\"[17]\n\nPortwood subsequently returned for the seventh season, her upcoming wedding being one of the show's focuses.[14] Portwood and Baier ended their relationship around the summer of 2017 after Portwood learned of Baier's infidelity.[18]\n\nWhilst filming Marriage Boot Camp, Portwood met Andrew Glennon, who was onset working as a cameraman. They began a relationship and welcomed their first child, a boy named James Andrew Glennon, on May 8, 2018.[19] On July 5, 2019 Portwood was arrested for domestic battery against Glennon, effectively ending their relationship. She denies the details of the charges.[20]\n\nAmber Portwood's spousal abuse legal charges [ edit ]\n\nFootage of Amber Portwood's violent behavior towards her child's father, Gary Shirley, including an assault in which Shirley refused to physically defend himself, prompted an investigation from both the police department of Anderson, Indiana, and that city's branch of the state Child Protective Services, along with sparking hundreds of public complaints questioning Portwood's suitability to be a mother. Police searched Portwood's apartment, finding \"evidence that requires further investigation,\" but would not specify what had been found at the time; it was later revealed that Portwood had been caught with a large quantity of marijuana and crack cocaine.\n\nDuring the incidents, MTV failed to stop Portwood's attacks on her partner, and it appears the crew also failed to inform the police of her crimes, with authorities only investigating the case and pressing charges when later contacted by concerned viewers following broadcast of the material.[21] This despite the fact that the show featured a Public Service Announcement concerning domestic violence and showed links to a domestic violence related website,[22]\n\nOn October 20, 2010, The Today Show aired a segment revolving around the depicted domestic abuse in both seasons. NBC's Dan Abrams discussed the possible legal consequences Portwood could face under Indiana law, including the felony charge of conducting abuse in the presence of a child under 14 (namely, the couple's 2-year-old daughter, Leah) and misdemeanor charges including but not limited to domestic assault and battery. On November 3, it was reported that Portwood agreed to allow Indiana CPS to monitor her for up to six months in exchange for CPS's allowing her to maintain custody of Leah.[citation needed]\n\nOn November 18, after an extensive investigation, Portwood was charged with three counts of domestic violence, two of them felonies, in connection with separate incidents of on-camera abuse of Shirley.[23] The same day, MTV released a statement concerning the charges filed on Portwood: \"We are cooperating with all parties and hope for a quick and fair resolution that allows everyone involved to move forward in a positive manner.\"[24]\n\nIn December 2011, Portwood was arrested for the Class D felony of possession of a controlled substance and was later charged with violating her probation on her earlier domestic-violence charges by breaching conditions including behaving well in society, obtaining a GED certificate, completing six months of anger-management training, paying her probation fees, and setting up a $10,000 college fund for Leah. She was held without bond in Madison County Jail until her January 27, 2012, hearing on both charges, at which she entered a guilty plea and the court scheduled a sentencing hearing for February 6 of that year.\n\nOn February 6, Portwood was given a five-year suspended sentence with the provision that all charges would be dropped if she went to and completed rehab.[citation needed] In March 2012, Portwood failed to take a required drug test, violating the associated condition of her suspended sentence and putting herself in jeopardy of having the five-year suspended sentence reimposed. At the ensuing probation violation hearing, the judge in the case declined to reimpose any portion of the suspended sentence, instead requiring Amber to complete 30 days of daily drug tests.[citation needed] Portwood subsequently dropped out of her rehabilitation program and was charged with a third violation of her probation; in June 2012, the court reimposed Portwood's five-year sentence in its entirety.[25] On June 13, 2012, Portwood began serving her five-year sentence, during which she is expected to attend substance abuse classes and earn her GED.[26]\n\nOn December 20, 2013, Portwood made an appearance on the talk show Dr. Phil. She revealed that she has been released from jail early due to good behavior and now has her GED. Portwood also revealed that she was high on prescription and illegal medication for most episodes of Teen Mom and that she is sober with no intent of ever using again. Portwood is working on obtaining a joint-custody agreement with her ex-boyfriend Gary Shirley and is trying to focus on being a good mom to her daughter. She also has established an organization to help teens stay off drugs.[27]\n\nOn July 5, 2019, Portwood was arrested in Indianapolis, Indiana and charged with two counts of domestic battery and one count of criminal recklessness with a deadly weapon, after she struck Glennon in the neck while Glennon held James in his arms, threatened to commit suicide by overdosing on clonazepam, and used a machete to attempt and break into the room where Glennon was hiding with their son.\n\nTimeline of cast members [ edit ]\n\nName Seasons Teen Mom Teen Mom OG 1 2 3 4 5a 5b 6a 6b 7a 7b 8a 8b Farrah Abraham Main Maci McKinney Main Catelynn Baltierra Main Amber Portwood Main Cheyenne Floyd Main Bristol Palin Main Mackenzie McKee Guest Main\n\nEpisodes [ edit ]\n\nSeason Episodes Originally aired First aired Last aired 1 8 December 8, 2009 ( ) January 26, 2010 ( 2010-01-26 ) 2 12 July 20, 2010 ( ) October 12, 2010 ( 2010-10-12 ) 3 12 July 5, 2011 ( ) September 20, 2011 ( 2011-09-20 ) 4 12 June 12, 2012 ( ) August 28, 2012 ( 2012-08-28 ) 5a 10 March 23, 2015 ( ) May 25, 2015 ( 2015-05-25 ) 5b 10 January 4, 2016 ( ) February 22, 2016 ( 2016-02-22 ) 6a 15 August 22, 2016 ( ) November 28, 2016 ( 2016-11-28 ) 6b 12 April 17, 2017 ( ) June 26, 2017 ( 2017-06-26 ) 7a 18 November 27, 2017 ( ) April 9, 2018 ( 2018-04-09 ) 7b 12 October 1, 2018 ( ) December 17, 2018 ( 2018-12-17 ) 8a 12 June 10, 2019 ( ) August 19, 2019 ( 2019-08-19 ) 8b TBA March 17, 2020 ( ) TBA\n\nReception [ edit ]\n\nIn 2016, a New York Times study of the 50 TV shows with the most Facebook Likes found that Teen Mom was \"most popular in rural Kentucky and least popular in New York City. As with 16 and Pregnant, it's much more popular among women — 94 percent of 'likes' come from women, second only to Pretty Little Liars\".[28]\n\nRatings [ edit ]\n\nThe pilot episode was the network's highest-rated premiere in over a year, with 2.1 million total viewers;[29] the record was surpassed by the controversial series Skins, which had 3.26 million viewers. The first-season finale brought in 3.6 million viewers.[30] The second-season finale pulled in over 5.6 million viewers.[30]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/images/wikimedia-button.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Teen_Mom", "title": "Wikipedia", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}