{"url": "variety.com/2018/film/news/mamma-mia-sequel-here-we-go-again-cher-ol-parker-1202877503/", "text": "It’s been a decade since the smash hit “Mamma Mia” hit the screen, and yet director Ol Parker knew audiences still had the hunger for a sequel.\n\nParker, best known for writing the “The Best Exotic Marigold Hotel” series, was originally planning just to write the sequel, before Universal decided he would also be the right choice to direct.\n\nWith the film opening Friday, Parker talked to Variety about how Richard Curtis, the screenwriter and director of the original, played a part in pushing him towards the job, Lily James’ full commitment to the part and the famous sequel he was inspired by.\n\nHave you been surprised at at all that there is still a thirst for a sequel even after ten years?\n\nI’m grateful for starters. When I first got the gig I spent a couple of the first days terrified! Obviously we are here because of the enormous success of the first one, so I realized quite quickly that if I succumbed to the pressure that I would never get out of bed and would never write a word. So I just tried to view it that I got the chance to inherit these characters that people knew and loved and these songs and extraordinary music as well as these wonderful actors I get the chance to work with and not get too freaked out by the level of expectations.\n\nWhen did you and Universal decide to make a flashback an essential element of how the story would be told in this sequel?\n\nPrior to coming on, Richard Curtis wrote me an email and asked, “Random question — do you like Abba?” and I went, “Well, who doesn’t?” and that was like two years ago, and I thought he was going to invite me to dinner with them, because he knows everybody and that’s how he rolls. Then he wrote me again and asked, “How do you feel about writing the sequel to Mamma Mia?” So when I was trying to figure out the story, I reached out to Richard about how to tell the story after so many years and his brilliant daughter, Scarlet, who is also a writer and happened to be with Richard driving in a car said, “Well, you should do “Godfather 2,” and I just went “Brilliant, I’ll take it.”\n\nI would never think to put “Godfather 2” and “Mamma Mia” together?\n\nIt is not often that they are mentioned in the same sentence — it’s not a comparison, it’s just a structural theft.\n\nWhat was it about Lily James early on that made you think she could play a character that Meryl Streep had already played?\n\nSo she had met, but right after that, she went straight into doing publicity for “Baby Driver” and because it was doing so well they kept extending the publicity tour. Even though we were seeing some really great actresses, I was just waiting for Lily to come back. Lily is in life and art, completely uninhibited and just commits fully on screen.\n\nPlus, she sang in “Cinderella” and had a lovely voice and what I didn’t realize is that while her voice was in tune and beautiful, I had no idea how well she could act with it. So she came in with like half a day in between the “Baby Driver” tour and I knew she would be brilliant but what I also came to find out was how nice she was. To me, one of the keys of casting the younger cast was casting people I really liked, because I can attest to having seen the first film and seeing that cast really unite and see that close bond they formed, I wanted that with this younger cast as well.\n\nHow did the Cher casting come about?\n\nThere’s a sports saying, if you aren’t playing offense, you’re playing defense, so if you are coming back for a sequel not be better but you have to aim higher and bring something else back in to the mix. So I wrote that part specifically for Cher in the script and when I handed it in I told them, by the way that role is Cher. I refused to contemplate anyone else being on the list. So we are waiting for a while, on Cher time — because Cher owns time. In the end, Ron Meyer just called her up and said “You’re doing ‘Mamma Mia 2” and she was like “OK.” It was a great day when she said yes but it was an even better day when the plane arrived in London. She’s also an absolute sweetheart, she’s warm and funny and was very lovely on the set.\n\nHad you dealt with any musical directing prior to getting the job?\n\nI hadn’t, but I was lucky enough to work with a lovely choreographer who insisted that we work together. I originally thought 40% of the film would just be his. We also had this brilliant cameraman, Bob Yeoman, and that was a really big deal when he signed . We knew we were in a different echelon with him and that was fantastic obviously. We were just having fun and no idea was too dumb.\n\nWhat was your favorite musical sequence? Most challenging?\n\n“Waterloo” was probably my favorite. That was enormous fun and we laughed a lot. Hugh was all in in that scene, we just laughed for four days. “Dancing Queen” was the hardest to pull off, all those boats and all those people dancing around the street with boats coming around the corner. Pierce, god bless him, he hurt his Achilles tendon, so he kept going, “Haven’t got too many left in me,” and then something would go wrong with a boat so we would have to apologize and he’d be like, “nope, all good.” So yeah, that was a tough one.\n\nWhat do you hope audiences take away from this go-round?\n\nIt’s always hard to tell with sequels. I wrote the “Marigold Hotel” series and with the first one, people hated it in the U.K. but in America they really liked it. On the sequel, it was the direct opposite, really well-reviewed here (in the U.K.) and absolutely pissed on in the States. That taught me how much the sequel is seen through the prism of the first one and really can’t get away from that. I remember reading an interview with Meryl when the first one came out, saying “This is the type of movie the world needs.” God knows things have gotten darker since then, almost desperate times now. So if we can add any joy and lighten someone’s day then I’ll take that.\n\n(Pictured at top: Christine Baranski and Ol Parker)", "images": ["http://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://pmcvariety.files.wordpress.com/2018/07/ol-parker.jpg?w=1000", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Ffilm%2Fnews%2Fmamma-mia-sequel-here-we-go-again-cher-ol-parker-1202877503%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202877503&comment_count=6", "https://s0.wp.com/wp-content/themes/vip/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pmcvariety.files.wordpress.com/2015/12/mamma-mia.jpg", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif"], "top_img": "https://pmcvariety.files.wordpress.com/2018/07/ol-parker.jpg?w=1000", "keywords": [], "authors": ["Justin Kroll"], "canonical_link": "https://variety.com/2018/film/news/mamma-mia-sequel-here-we-go-again-cher-ol-parker-1202877503/", "title": "‘Mamma Mia! Here We Go Again’ Director Ol Parker on Casting Cher: ‘I Refused to Contemplate Anyone Else’", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "It's been a decade since the smash hit \"Mamma Mia\" hit the screen, and yet director Ol Parker knew audiences still hungered for a sequel.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202877503, "author": "Justin Kroll", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-07-20T14:30:14"}, "pmc-tag": "Cher,Mamma: Here We Go Again,Meryl Streep,Ol Parker", "title": "‘Mamma Mia! Here We Go Again’ Director Ol Parker on Casting Cher: ‘I Refused to Contemplate Anyone Else’", "pageclass": "article", "pmc-vertical": "film", "pmc-primary-category": "News", "pmc-primary-vertical": "film", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "‘Mamma Mia! Here We Go Again’ Director Ol Parker on Casting Cher: ‘I Refused to Contemplate Anyone Else’", "url": "https://variety.com/2018/film/news/mamma-mia-sequel-here-we-go-again-cher-ol-parker-1202877503/", "description": "It’s been a decade since the smash hit “Mamma Mia” hit the screen, and yet director Ol Parker knew audiences still had the hunger for a sequel. Parker, best known for writing the …", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/07/ol-parker.jpg?w=1000", "width": 1000, "height": 563, "alt": "Ol Parker"}, "locale": "en_US"}, "article": {"published_time": "2018-07-20T21:30:14+00:00", "modified_time": "2018-07-20T21:30:14+00:00"}, "twitter": {"creator": "@krolljvar", "site": "@variety", "text": {"title": "‘Mamma Mia! Here We Go Again’ Director Ol Parker on Casting Cher: ‘I Refused to Contemplate Anyone Else’"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/07/ol-parker.jpg?w=1000", "alt": "Ol Parker"}, "card": "summary_large_image", "title": "‘Mamma Mia! Here We Go Again’ Director Ol Parker on Casting Cher: ‘I Refused to Contemplate Anyone Else’", "description": "It's been a decade since the smash hit \"Mamma Mia\" hit the screen, and yet director Ol Parker knew audiences still hungered for a sequel."}, "author": "Justin Kroll", "content_type": "Article", "post_id": 1202877503, "title": "'Mamma Mia! Here We Go Again' Director Ol Parker on Casting Cher: 'I Refused to Contemplate Anyone Else'", "published_at": "2018-07-20 14:30:14", "image": "https://pmcvariety.files.wordpress.com/2018/07/ol-parker.jpg?w=1000", "comment_count": 6, "tags": "Ol Parker", "topics": "News", "appeared_in_print": "No", "body": "It's been a decade since the smash hit \"Mamma Mia\" hit the screen, and yet director Ol Parker knew audiences still had the hunger for a sequel.\r\n\r\nParker, best known for writing the \"The Best Exotic Marigold Hotel\" series, was originally planning just to write the sequel, before Universal decided he would also be the right choice to direct.\r\n\r\nWith the film opening Friday, Parker talked to Variety about how Richard Curtis, the screenwriter and director of the original, played a part in pushing him towards the job, Lily James' full commitment to the part and the famous sequel he was inspired by.\r\n\r\nHave you been surprised at at all that there is still a thirst for a sequel even after ten years?\r\n\r\nI'm grateful for starters. When I first got the gig I spent a couple of the first days terrified! Obviously we are here because of the enormous success of the first one, so I realized quite quickly that if I succumbed to the pressure that I would never get out of bed and would never write a word. So I just tried to view it that I got the chance to inherit these characters that people knew and loved and these songs and extraordinary music as well as these wonderful actors I get the chance to work with and not get too freaked out by the level of expectations.\r\n\r\nWhen did you and Universal decide to make a flashback an essential element of how the story would be told in this sequel?\r\n\r\nPrior to coming on, Richard Curtis wrote me an email and asked, \"Random question -- do you like Abba?\" and I went, \"Well, who doesn't?\" and that was like two years ago, and I thought he was going to invite me to dinner with them, because he knows everybody and that's how he rolls. Then he wrote me again and asked, \"How do you feel about writing the sequel to Mamma Mia?\" So when I was trying to figure out the story, I reached out to Richard about how to tell the story after so many years  and his brilliant daughter, Scarlet, who is also a writer and happened to be with Richard driving in a car said, \"Well, you should do \"Godfather 2,\" and I just went \"Brilliant, I'll take it.\"\r\n\r\nI would never think to put \"Godfather 2\" and \"Mamma Mia\" together?\r\nIt is not often that they are mentioned in the same sentence -- it's not a comparison, it's just a structural theft.\r\n\r\nWhat was it about Lily James early on that made you think she could play a character that Meryl Streep had already played?\r\nSo she had met, but right after that, she went straight into doing publicity for \"Baby Driver\" and because it was doing so well they kept extending the publicity tour. Even though we were seeing some really great actresses, I was just waiting for Lily to come back. Lily is in life and art, completely uninhibited and just commits fully on screen.\r\n\r\nPlus, she sang in \"Cinderella\" and had a lovely voice and what I didn't realize is that while her voice was in tune and beautiful, I had no idea how well she could act with it. So she came in with like half a day in between the \"Baby Driver\" tour and I knew she would be brilliant but what I also came to find out was how nice she was. To me, one of the keys of casting the younger cast was casting people I really liked, because I can attest to having seen the first film and seeing that cast really unite and see that close bond they formed, I wanted that with this younger cast as well.\r\n\r\n\r\nHow did the Cher casting come about?\r\nThere's a sports saying, if you aren't playing offense, you're playing defense, so if you are coming back for a sequel not be better but you have to aim higher and bring something else back in to the mix. So I wrote that part specifically for Cher in the script and when I handed it in I told them, by the way that role is Cher. I refused to contemplate anyone else being on the list. So we are waiting for a while, on Cher time -- because Cher owns time. In the end, Ron Meyer just called her up and said \"You're doing 'Mamma Mia 2\" and she was like \"OK.\" It was a great day when she said yes but it was an even better day when the plane arrived in London. She's also an absolute sweetheart, she's warm and funny and was very lovely on the set.\r\n\r\nHad you dealt with any musical directing prior to getting the job?\r\nI hadn't, but I was lucky enough to work with a lovely choreographer who insisted that we work together. I originally thought 40% of the film would just be his. We also had this brilliant cameraman, Bob Yeoman, and that was a really big deal when he signed . We knew we were in a different echelon with him and that was fantastic obviously. We were just having fun and no idea was too dumb.\r\n\r\nWhat was your favorite musical sequence? Most challenging?\r\n\"Waterloo\" was probably my favorite. That was enormous fun and we laughed a lot. Hugh was all in in that scene, we just laughed for four days. \"Dancing Queen\" was the hardest to pull off, all those boats and all those people dancing around the street with boats coming around the corner. Pierce, god bless him, he hurt his Achilles tendon, so he kept going, \"Haven't got too many left in me,\" and then something would go wrong with a boat so we would have to apologize and he'd be like, \"nope, all good.\" So yeah, that was a tough one.\r\n\r\nWhat do you hope audiences take away from this go-round?\r\nIt's always hard to tell with sequels. I wrote the \"Marigold Hotel\" series and with the first one, people hated it in the U.K. but in America they really liked it. On the sequel, it was the direct opposite, really well-reviewed here (in the U.K.) and absolutely pissed on in the States. That taught me how much the sequel is seen through the prism of the first one and really can't get away from that. I remember reading an interview with Meryl when the first one came out, saying \"This is the type of movie the world needs.\" God knows things have gotten darker since then, almost desperate times now. So if we can add any joy and lighten someone's day then I'll take that.\r\n\r\n(Pictured at top: Christine Baranski and Ol Parker)", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1532122214.0, "source": "http://variety.com", "summary": ""}