{"url": "https://www.cheatsheet.com/entertainment/all-of-the-hilarious-clapbacks-kelly-ripa-had-for-her-bikini-photo-haters.html/", "text": "For almost 30 years, Kelly Ripa has been doing her thing in the entertainment industry. From her role on All My Children to her current position as a talk show host on Live! with Kelly and Ryan, she’s been a boss. Therefore, the mother of three probably thought nothing of taking some pics during a family getaway.\n\nWhen Ripa’s husband, Riverdale actor Mark Consuelos, posted a photo of his beautiful bikini-clad wife, the internet was immediately abuzz. Apparently, some haters were offended by a 47-year-old woman wearing a bikini, while others simply just had nasty things to say. Luckily Ripa and Consuelos are the queen and king of clapbacks.\n\nFrom the controversial bikini shot (page 5) to their family’s antics on social media (page 7) and everything in between, here are all of the hilarious times they let trolls have it.\n\nTrolling the trolls\n\nRipa relishes the opportunity to shut down trolls. | Dimitrios Kambouris/Getty Images Ripa relishes the opportunity to shut down trolls. | Dimitrios Kambouris/Getty Images\n\nWhile many celebritiess simply ignore any negative comments on their social media pages, Ripa delights in making her trolls feel uncomfortable. In fact, it’s one of her favorite activities.\n\nIn an Instagram video, she revealed, “I like trolling. I love trolling a troll. It is my favorite thing to do.”\n\nNext: A swift comeback times two\n\nDon’t come for her man\n\nCan you believe this photo was taken a decade ago? | Can you believe this photo was taken a decade ago? | Kelly Ripa via Instagram\n\nRecently, Ripa shared a cute throwback photo of herself and Consuelos with the caption, “That other time we got fancy.” Unfortunately, some poor troll was deeply offended by the photo and rudely responded by saying, “Too bad he’s short when he tries to look taller. It looks funny. Just be who you are.”\n\nEver quick with the comeback, Ripa responded cheekily, “He’s tall where it counts, babe.” Meanwhile, Consuelos asked the important questions, “Please tell me how it is I can try to look taller? I’m dying to know.”\n\nNext: A lesson in spelling and grammar\n\nHey big head\n\nRipa doesn’t hold anything back. | Mike Coppola/Getty Images for Tribeca Film Festival Ripa doesn’t hold anything back. | Mike Coppola/Getty Images for Tribeca Film Festival\n\nJust because you’re a public figure, people think it’s OK to say any rude thing to you. Luckily, Ripa won’t let anyone walk over her. In an Instagram video captioned, “Kelly reads mean IG comments,” an IG user said, “Her head looks [sic]to big for her tiny body.”\n\nPer usual, Ripa was quick to quip, “to is spelled too FYI.” Grammer and spelling are fundamental.\n\nNext: A quick history lesson\n\nBackground checks\n\nRipa and Consuelos don’t listen to the haters. | Robin Marchant/Getty Images Ripa and Consuelos don’t listen to the haters. | Robin Marchant/Getty Images\n\nIt seems scary to be in the public eye, especially when people think they know who you are. In fact, one bold troll tried to claim that Ripa lies about her husband’s heritage. The rude hater claimed that she “lies about her husband being Italian.”\n\nRipa was having none of it. She quickly clapped back saying,\n\nOMG, please get help, you are making yourself look like a complete fool. Please stop shouting and do your research. A quick google search is all you need. @instasuelous father is from Mexico (Oaxaca) his mother is from Lago Majorie, Italy. Not that I feel the need to justify this to you, but since you called me a liar and I’m bored I felt the need to straighten you out.\n\nNext: The bikini photo that broke the internet\n\nBikini drama\n\nIt’s amazing that a photo this simple and breathtaking could cause so much controversy. | It’s amazing that a photo this simple and breathtaking could cause so much controversy. | Mark Consuelos via Instagram\n\nStill, Consuelos and Ripa’s most recent snappy reply to IG trolls has to be our favorite. Consuelos posted a stunning photo of his bikini-clad wife in crystal blue waters with the caption “Sultry Sundays with the sexy one are my fave…”\n\nThe innocent photo sent haters into a tizzy, and many of them suggested that at her age, Ripa shouldn’t be caught dead in a bikini. Consuelos wasn’t having it. In a lengthy response, he said,\n\nI wanted to take a couple of days to weigh in. Probably should’ve earlier arguably. But I wanted to be above it. Well, not I’m not. I posted this pic of the women I most admire As a playful tribute to my wife who I’m proud of in endless ways. She works extremely hard in her professional life and her commitment to exercise, a healthy diet is admirable and the benefits show. Yes, she’s wearing a bikini at age 47 and will no doubt wear one for many years to come. If that offends you in some way, if it triggers you, or some other psychosis you’re suffering from, I suggest you get over it and get used to it. To all the males that had something negative to say. I suggest you bring it up with me if ever I’m lucky enough to run into you. I’m going to get back to my vacation now.. thanks for allowing me to express myself. I love you @kellyripa… keep killing it.\n\nBloop.\n\nNext: The slyest response\n\nShowing them better than she can tell them\n\nShe’s fit and she knows it. | She’s fit and she knows it. | Kelly Ripa via Instagram\n\nRipa also dragged her bikini haters across the internet, and she did it all without saying anything at all. Instead of a witty remark, Ripa posted her workout routine on IG. In the video, Ripa is wearing workout gear and running as fast as she can while her husband holds a resistance band around her waist.\n\nIn a brilliant and hilarious clap back, Ripa suggested that instead of sitting around hating people ought to get healthy and active.\n\nNext: Passing it on to the next generation\n\nKeeping it in the family\n\nDolling out snappy comments on social media is a family tradition. | Dolling out snappy comments on social media is a family tradition. | Kelly Ripa via Instagram\n\nIt looks like Ripa and Consuelos aren’t the only clapback masters in their family. Their teenage daughter, Lola, also knows a thing or two about a snarky remark. Ripa posted a photo of Consuelos in a scene from Riverdale with the caption, “Where’s the beef? #daddy knows. Find out tonight on all new #Riverdale on the CW 8 EST.”\n\nLola was probably horrified by the suggestive caption and quickly replied on her mother’s page, “Stop posting Riverdale photos, we get it.” Ripa quickly quipped back, “Imma block you in a minute.”\n\nBasically just don’t come for the Ripa/Consuelos clan.\n\nFollow Aramide on Twitter @midnightrami.\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2018/03/Kelly-Ripa-on-the-beach.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/04/kelly-ripa-phone.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/04/kelly-ripa-mark-consuelos.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2016/10/kelly-ripa-and-mark-consuelos.jpg?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.cheatsheet.com/wp-content/uploads/2018/03/Kelly-Ripa-working-out-in-a-gym.png?x62514", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2018/04/kelly-ripa-phone.jpg", "https://www.cheatsheet.com/wp-content/uploads/2018/04/kelly-ripa-mark-consuelos-family.jpg?x62514", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2018/04/kelly-ripa.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/04/kelly-ripa-phone.jpg", "keywords": [], "authors": ["Aramide Tinubu"], "canonical_link": "https://www.cheatsheet.com/entertainment/all-of-the-hilarious-clapbacks-kelly-ripa-had-for-her-bikini-photo-haters.html/", "title": "Every Hilarious Clapback Kelly Ripa Has Had For Her Haters", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/all-of-the-hilarious-clapbacks-kelly-ripa-had-for-her-bikini-photo-haters.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "Kelly Ripa is a master of shutting down her haters on social media. Here are all the best times she has clapped back at her critics.", "og": {"locale": "en_US", "type": "article", "title": "Every Hilarious Clapback Kelly Ripa Has Had For Her Haters", "description": "Kelly Ripa is a master of shutting down her haters on social media. Here are all the best times she has clapped back at her critics.", "url": "https://www.cheatsheet.com/entertainment/all-of-the-hilarious-clapbacks-kelly-ripa-had-for-her-bikini-photo-haters.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-06-14T18:30:05-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2018/04/kelly-ripa-phone.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2018/04/kelly-ripa-phone.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "social media", "section": "Entertainment", "published_time": "2018-06-14T18:30:00-04:00", "modified_time": "2018-06-14T18:30:05-04:00"}, "twitter": {"card": "summary_large_image", "description": "Kelly Ripa is a master of shutting down her haters on social media. Here are all the best times she has clapped back at her critics.", "title": "Every Hilarious Clapback Kelly Ripa Has Had For Her Haters", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/04/kelly-ripa-phone.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1529015400.0, "source": "https://www.cheatsheet.com", "summary": ""}