{"url": "https://www.seventeen.com/celebrity/celebrity-couples/a19170778/cole-sprouse-lili-reinhart-relationship-timeline/", "text": "Jughead and Betty may be openly in love on Riverdale, but Cole Sprouse and Lili Reinhart are far less forthcoming about their real-life romance. The couple have been together since 2017, and while they have faced some ups and downs in the past, they are going strong now and killing it on season 4 of Riverdale. Check out this timeline of their relationship below!\n\nFebruary 5, 2020\n\nSprousehart fans had a minor freak out when it looked like Lili and Cole unfollowed each other on Instagram. Lili later explained the situation, though, writing on her story that it was simply a glitch on the social media site.\n\n\"Houve uma falha no Instagram, não se apavorem.\" - Lili Reinhart via Instagram Stories. pic.twitter.com/AuealYZlvo — Lili Reinhart Brasil (@lilirbrasil_) February 3, 2020\n\nNovember 10, 2019\n\nThough Cole attended the People's Choice Awards alone, Lili showed her support for her man from bed, as he accepted the award Drama Movie Star of 2019.\n\n\"Congrats, to my people's choice best baby,\" she wrote along with of Cole on stage at the show.\n\nInstagram\n\nWhile I'm annoyed we missed out on a red carpet moment from these two, this was still pretty cute.\n\nNovember 7, 2019\n\nIn an interview with Cosmo, Lili revealed that she's not a gift-giving person because she finds that it's more romantic to give an \"experience.\"\n\n\"If I can pay for a trip somewhere...whether it's booking a flight, or a really cool hotel, and going somewhere together and making it a romantic thing,\" she said. \"That's really better than a physical gift. Walking away with an experience is more romantic in my mind.\"\n\nOctober 27, 2019\n\nCole posted a pic to Instagram of Lili at the 2019 Governors Awards, along with the caption, \"This is me bragging.\" Honestly, I don't blame him, she looks gorg!\n\nInstagram\n\nOctober 12, 2019\n\nLili and Cole headed out for a romantic dinner date in LA where they reportedly looked \"very happy together\" and were \"openly affectionate and loving with one another.\" If you don't believe me, check out the pics from their night:\n\nBACKGRID\n\nSeptember 13, 2019\n\nIn honor of Lili's 23rd birthday, Cole posted the cutest quartet of photos on Instagram, featuring the couple embracing and making out.\n\n\"Lil @lilireinhart was born on a Friday the 13th and haven’t I just been so lucky ever since?\" he captioned the pic.\n\nThis comes a few days after Lili confirmed, yet again, that the couple is still together following breakup rumors early this summer. She also hinted that the two are working on a couples costume (!!) together, so get ready for that.\n\nAugust 7, 2019\n\nLili and Cole are still not over the crazy rumors that they broke up, but it looks like they're having a good laugh about it now. Lili has some fun on Instagram when she commented on a post about Cole that was posted on Variety's account.\n\n\"Sources say he's single now- is he available?\" she asked in a comment.\n\nOf course, Lili wasn't the only one who had a bit of fun. Cole confirmed that they were totally still together and said that they're just having a laugh about it.\n\n\"I think you have to poke fun at it a little bit,\" he told Entertainment Tonight. \"It's kind of something you sign up for, but as long as can keep it light and fun, it's all good.\"\n\nAugust 4, 2019\n\nLili Reinhart posted a super sweet poem on Cole's birthday with a brand new photo of him relaxing on vacation.\n\nOf course, Cole decided to have some fun and commented back, \"follow for follow?\" which made some fans confused. For the record, they totally follow each other so it's likely an inside joke between them, but it seems he had a really great birthday after he thanked everyone on his Instagram story.\n\n\"Thank you for all the birthday wishes guys feeling v pregnant with your love,\" he wrote.\n\nInstagram\n\nJuly 26, 2019\n\nAfter a confusing week of trying to figure out what really going on with Sproushart, it looks like Lili is officially setting the record straight once and for all. After their hot and steamy cover that caused a lot more confusion was released, Lili took to Twitter to reassure everyone that all the recent reports of their breakup were false.\n\n\"Don’t believe everything you read on the internet, kids. And news sources should try a little harder to be less vile. 'Reliable sources' can kiss my a**.\"\n\nDon’t believe everything you read on the internet, kids. And news sources should try a little harder to be less vile. “Reliable sources” can kiss my ass.\n\n🙏🏻 — Lili Reinhart (@lilireinhart) July 25, 2019\n\nGlad we can all finally relax and enjoy the fact that our favorite on-camera and off-camera couple is still going strong!\n\nJuly 22, 2019\n\nIt looks like Sproushart is over! Us Weekly is reporting that the two have officially called it quits after two years of dating, with multiple sources saying that the couple is done and kept their distance at a San Diego Comic-Con party. According to someone at the party, Sprouse told a friend that they broke up and he ended up going home with co-stars KJ Apa and Camila Mendes.\n\nThe former couple didn't show any signs of a breakup at their Hall H panel where they gushed about season 4 and what's next for their characters. Hopefully this means the couple is on good terms with each other as they continue to film the show.\n\nMay 31, 2019\n\nLili and Cole are notoriously known for keeping their relationship really private, but the two just gave us a peek into their love on Instagram, once again solidifying the fact that they're total #relationshipgoals. Cole shared a stunning photo of Lili in a gown leaning over a pool of water while staring at her reflection. \"Some mercurial pool,\" he captioned the photo.\n\nLili also put her love for Cole on display by posting a photo of the film poster for Cole's most recent movie, Five Feet Apart, to her Instagram Stories. Underneath Cole's photo, Lili wrote \"That's My Boy.\" We're so here for Bughead PDA in real life.\n\nApril 29, 2019\n\nLili just shared a video of her boyfriend, Cole Sprouse, getting a whole lot of attention from another lady. OK, to be fair, the other lady has a lot of fur and while she's a cute pup, she has nothing on Lili.\n\nThe Riverdale actress posted a video on her Instagram story that shows Cole getting his faced licked by an adorable dog, Pinky. \"She thinks that you're Dylan,\" said someone in the background. \"She does the same thing to Dylan.\"\n\n\n\nIn Pinky's defense, ever since Cole dyed his hair back to blonde, he does look A LOT like his twin brother. It was later revealed that Pinky was probably going after some of the barbecue chicken wings that Cole had previously indulged in. Either way, the video is so cute. Pinky is having the time of her life with Cole, and Lili is having the time of her life watching her bf get slobbered on.\n\nMarch 15, 2019\n\nCole and Lili like to keep their private life, well, private. So, it isn't often that we hear about things like their dates...until now! That's right, Cole revealed to Glamour the most romantic thing he's ever done for Lili and, unsurprisingly, it's straight out of a movie.\n\n\"I took my [Lili] on a date where we drove to this location deep into Canada, and I surprised her with a big hot-air balloon adventure, which was quite a bit of fun,\" he told Glamour. \"I like traveling quite a bit. I like road-tripping. Those grand experiences always end up yielding the greatest memories—and the greatest romances.\"\n\n\n\nOK, um, imagine Lili's face when she saw that hot-air balloon. I'm sure that was the most magical date either of them have ever had. In the interview, Cole also mentioned that he's not a big movie date kind of guy, instead he prefers doing something more personal, like photography. Of course, we already knew that because he takes the most incredible photos of Lili.\n\nMarch 13, 2019\n\nIt didn't take long for Cole and Lili to realize their connection with each other.\n\n\"We legitimately could not stay away from one another,\" Cole revealed to the Los Angeles Times.\n\nEven though the couple has been more public than ever, Cole says that fans shouldn't expect things to change, especially when it comes to things like his relationship with Lili.\n\n\"I’ve girded my private life very intentionally,\" he says. \"It’s one of those things that I still sort of grapple with, and Lili and I grapple with.\"\n\nMarch 7, 2019\n\n\n\nCole's new movie, Five Feet Apart, is almost here and Lili Reinhart was there to support her beau during the movie premiere. The Riverdale co-stars looked so cute as they posed together on the red carpet and even showed some super rare PDA.\n\nKevin Winter Getty Images\n\nKevin Winter Getty Images\n\nJon Kopaloff Getty Images\n\nDylan was also there to support his brother and the twins seemed to have a good time together!\n\nFrazer Harrison Getty Images\n\nFebruary 14, 2019\n\nLove is in the air for Valentine's Day and Cole just posted another amazing photo of Lili for the big holiday!\n\n\"Quite actually the only thing keeping me sane is @lilireinhart,\" he wrote.\n\nCole and Lili have been posted photos from the same shoot over the past few days. She posted a photo a few days earlier with the caption, \"the sun came out for us.\"\n\nFebruary 12, 2019\n\nCole and Lili are setting the record straight about their relationship just in time for Valentine's Day. Amid rumors that the pair broke up, Cole posted a hauntingly beautiful image of Lili laying in the snow.\n\n\"'How do the people you shoot even tolerate you?' @lilireinharton ‘making her suffer for my art,’\" Cole wrote on Instagram. And while I can't help but agree (he made her lay in snow!), I sure am glad that Lili endured the pain in order to capture this amazing image.\n\n\n\nJanuary 30, 2019\n\nFans have been getting a bit concerned after rumors of the couple possibly breaking up have been going around the internet. So do fans have anything to worry about? Not at all! In fact, there is proof that all is good between Lili and Cole, so everyone can rest easy!\n\nDecember 17, 2018\n\nLili knows that she found herself a real catch in Cole Sprouse, and she's not afraid to let the world know too. When a meme account posted a joke regarding the perfect man not existing, Lili was quick to correct them.\n\n\"No man has all 5: good d*ck game, empathy, a height above 5' 9\", no hoes, common sense,\" the post read. Initially, it was Miley Cyrus who corrected the meme page, commenting, \"Mine does! Don't give up!\"\n\nWhen Instagram account @commentsbycelebs posted Miley's response, Lili commented too, making it known that Cole was also among the rare breed of men along with Miley's bae, Liam Hemsworth.\n\n\"I found one! 🙋\" she commented, revealing some much needed information regarding Cole Sprouse's \"d*ck game.\"\n\nDecember 14, 2018\n\nIt might be getting cold outside, but Cole Sprouse is heating things up with his latest photo of Lili Reinhart.\n\nCole posted the photo on his Instagram story featuring Lili in a bra and matching sweater. He captioned it, \"some one let this girl know I'm interested.\"\n\nInstagram\n\nOh, we're pretty sure she knows Cole. Here's hoping she posts a response real soon.\n\nNovember 22, 2018\n\n\n\nLili and Cole took a big step in their relationship when they traveled home to Lili's family for Thanksgiving dinner.\n\nThe pair spent the holiday in North Carolina, where the Reinharts now reside. Not only did Cole meet his girlfriend's whole clan, but he also got to play with some of Lili's adorable dogs!\n\nInstagram\n\nSeems like things are getting pretty serious for the IRL Riverdale couple. Maybe Christmas will be held at the Sprouse house with Dylan and his model beau.\n\nNovember 12, 2018\n\nWhile People's Sexiest Man of the Year might've gone to Idris Elba this year, Lili Reinhart has a completely different idea of who should've gotten the honor.\n\nLili posted a photo of Cole on her Instagram story with the caption, \"my 2018 sexiest man.\" While we're not exactly sure what his response is, it's safe to say that fans were freaking out over the post. Check it out below:\n\nOctober 15, 2018\n\nLili Reinhart and Cole Sprouse have been heating things up lately with their recent photoshoots, but this time it was Lili's turn to share a steamy photo of her beau Cole.\n\nThe couple had some fun with fans after the photo was posted, especially after Cole responded with a hilarious comment that we all wish we wrote first.\n\n\"Are you guys dating?\" Cole asked.\n\nLili still hasn't officially responded to his question, but the answer seems pretty obvious.\n\nOctober 3, 2018\n\nLili Reinhart just opened up about her relationship with Cole Sprouse and why it’s been so important for her to keep her love life private.\n\n\"I think it’s just that I’m so protective over it. It’s not something the world needs to know about, because if you give them anything, they are just going to want more,\" she told Who What Wear. \"I’m not going to hide away from my relationship or hide away from what’s going on in my life, but what does happen in my relationship is so private, and I cherish it a lot. He does as well. A relationship is a very intimate thing, and I want it to be between me and him, not me, him, and the world.\"\n\nShe also couldn't stop gushing about his love for photography.\n\n\"I think he is such an incredible photographer, really. Sometimes he’s inspired by a location, and he’s like, 'I want to shoot you here,'\" she revealed. \"Other times, I’m inspired by a dress, and I’m like, 'I want you to shoot me in this.' Our photo shoots are very intimate, just him and me; no one else is there ever.\"\n\nSeptember 25, 2018\n\nWhile the couplehave been pretty quiet about each other over the years, Glamour finally got them to share their thoughts about each other and they were super sweet (for the most part).\n\nThey had to share their first impressions of each other and Cole revealed that it took time for him to really get to know Lili.\n\n\"Lili was a tough egg to crack. She's very shy at first and reserved. I think it was about halfway into the first season she started letting people in truly,\" he said.\n\nWhen it came to Lili sharing what she thought of Cole, she had something a little bit different to say...\n\n\"I thought his voice was annoying. That was my first impression. I was like, 'That guy's got an annoying voice.' And now it's grown on me, I guess,\" she revealed.\n\nLili did, however, have some nice things to say about Cole, praising his passion for photography and art.\n\n\"Cole is one of the smartest, the smartest person that I’m friends with. He’s incredibly passionate about art, about photography, about acting, and I really admire that,\" she said.\n\nCole even revealed that Lili is part of the reason why he continues to push himself creatively.\n\n\"She’s one of those people that consistently pushes me to be better at the arts that I’m pursuing,\" he said. \"That’s just the kind of person she is. She inspires excellence out of everybody she works with.\"\n\nHe also pointed out how much her family has helped her become the person she is today.\n\n\"Maybe your mother inspired this in you, but you are by nature a caretaker and an extremely nurturing person. You just want to make people feel better and help people get through whatever they’re getting through.\"\n\n\n\nLili also talked about Cole's strong connection to his family.\n\n\"I said you’re very loyal to your family, because you are,” she said.\n\n\n\nIf only this video was longer cause we can honestly listen to them talk about each other all day!\n\nSeptember 13, 2018\n\n\n\nThe pics just keep coming and this one is the best yet! In honor of Lili's 22nd birthday, Cole posted this GORGEOUS pic of his topless GF.\n\nAlong with the picture, Cole wrote, \"Both the birthday and the gift. My little muse, happy birthday my love.\" Ugh be cuter guys, I dare you.\n\nSeptember 12, 2018\n\nIs the new purpose of Instagram just to keep up with all of the incredible Lili and Cole content? It seems like it, and, honestly, I'm OK with that. Especially when Cole posts breathtaking photos of Lili like this artistic-dream he shared recently.\n\nSeriously is that a Renaissance painting of a gorgeous queen or a modern shot of Lili Reinhart? Who can tell the difference?! You can feel the love emanating from this image.\n\nSeptember 9, 2018\n\nWhile Cole and Lili still haven't officially confirmed their relationship, it seemed they were getting pretty close late last night in Cole's new pic of the two of them together.\n\nThe caption is just \"it's pretty, pretty late,\" which means they definitely stayed up all night together and by the looks of it, they got pretty close and almost KISSED in the photo.\n\nEven though it's still not the official confirmation that we're all looking for, it's definitely close enough.\n\nAugust 30, 2018\n\nLili and Cole are taking on the City of Love together and they look chic af doing it. Maybe the two just needed to get away from filming Riverdale season 3 so they flew off to France as a spontaneous, beautiful act of love? Just a thought.\n\nConsidering the photo is captioned \"6 am,\" one can only assume that the two couldn't sleep, so they put on their best coats (and scarf in Cole's case) and strolled the streets of Paris, window shopping, chatting, and maybe stopping for some croissants when they got a little hungry. While we don't actually know why they're in Paris or what the trip entails, we can only assume the two of them are having a beautifully romantic time.\n\nAugust 20, 2018\n\nWhile Cole is typically the one behind the camera, Lili had her beau act as model during a photo shoot in some very exotic-looking mountainous location. Cole is rocking jeans and a button-up, with his iconic camera slung around his neck. He looks totally like Jughead in the wild. Lili captioned the image with the praying hands emoji. Preach, girl!\n\nAugust 12, 2018\n\nCole and Lili made an appearance at the 2018 Teen Choice Awards, where they (along with their Riverdale cast mates) were nominated for a bunch of awards. While Cole and Lili did win Choice TV Ship and Choice Liplock, they noticeably did NOT walk the red carpet together. They also did not pose for photos as a couple (though Cole did pose for pics with his on-screen BFF KJ Apa). A fan also caught a photo of the award show's seating arrangement, which does appear to have Cole and Lili sitting near each other, but with an empty seat between the two of them. What does it all mean!?\n\nKevin Mazur Getty Images\n\nLili stunned in a sequin pink midi dress (do you thinkKylie's 21st bday look inspired this dress?!) and Cole took a slightly more casual approach with a white blazer, denim shirt, red bandana, and slim black pants.\n\nAugust 6, 2018\n\nBig news! Skeet Ulrich and Mädchen Amick (AKA FP Jones and Alice Cooper) pretty much just confirmed Sprousehart!\n\n\"It's great. I mean, they didn't talk about [their relationship] the entire time, until just recently,\" Amick told Entertainment Tonight. \"So, it's nice that they're able to now, like, be public with it, so it's not so under wraps.\" You hear that? They're public with it! And while we weren't sure exactly whether or not Lili and Cole were just really good friends or much more, their on screen 'rents pretty much just gave us all the information we need. We hope they had permission from their kids!\n\n\"Behind the scenes, they're so sweet with each other and they're both just exceptional people,\" Amick continued. Ok, we would do anything to see Lili and Cole interact behind the scenes during Riverdale filming.\n\nWhile this is all amazing news, Ulrich ended the interview saying, \"Their friendship is beautiful.\" Talk about mixed messages! We're just going to chalk it up to the fact that Lili and Cole are best friends and dating, because isn't that just beautiful.\n\n\n\nAugust 4, 2018\n\nLili celebrated Cole's 26th birthday with an adorable Instagram post. Along with the cutest pic of Cole pointing at the camera she wrote, \"It seems as if the world would still be a stranger to me, if not for you. I’m so thankful that our paths intertwined to form this beautiful adventure~\" She finished off the post with, \"Happy birthday, my love.\" You read that right, MY LOVE!\n\nWhile the two have been very private about their relationship in the past, can we officially all agree that this relationship is happening? Is this their way of breaking the news? The suspense is paralyzing!\n\nJuly 27, 2018\n\nThe two got together after filming the third season of Riverdale to watch the very rare Blood Moon lunar eclipse. Hanging in Cole's trailer, Lili documented the whole night on her Instagram story. At first, Lili adorably joked that, \"If the world really is gonna end tonight then I'm happy it's with my best bud!!\"\n\nInstagram\n\nThen, it became obvious that maybe Cole didn't care as much about the lunar eclipse as Lili did, but she kept going!\n\nInstagram\n\nLili continued to joke writing, \"Asked him to tell me all the things he loves about me. He's been silent for 30 minutes. Awww he must be thinking really deeply.\"\n\nInstagram\n\nAs the night went on, Lili continued to goof around, documenting her and Cole as he played video games, discussed \"The Purge,\" and took selfies. We will never get enough Cili content!\n\nInstagram\n\nAugust 4, 2018\n\nLili celebrated Cole's 26th birthday with this adorable Instagram. \"It seems as if the world would still be a stranger to me, if not for you,\" the caption read. \"I’m so thankful that our paths intertwined to form this beautiful adventure~\" The big kicker though? The caption ended with, \"Happy birthday, my love.\" You read that right. MY LOVE!\n\nSo, this confirms their relationship, right? I mean, you can't get anymore couple-y than that! Bring on the PDA! We're ready for it.\n\nJuly 23, 2018\n\nLili, who is usually super tight-lipped about her romance with Jughead IRL, calls Cole Sprouse her \"love\" on Instagram. Lili posted a pic of herself (rocking a stunning, powder blue two-piece set) and co-stars Cole and Casey Cott (aka Betty's bestie Kevin Keller on Riverdale) from their weekend at Comic Con. Lili captioned the pic: \"Loves.\"\n\nThe pic currently has over 2 million likes, and I'm pretty sure that 98% of those people ship Cole and Lili ALL THE WAY.\n\nDuring the Comic Con panel, Lili and Cole revealed that things were looking up in season 3 for Bughead, and that they two will be going strong. Is art imitating life here, Lole/Cili?\n\nJuly 4, 2018\n\nDuring an interview with HarpersBazaar.com, Lili got real about talking about her relationship with Cole in public.\n\n\"I'm not okay talking about my relationship,” Lili said. “I'm not going to tell you my love story. That's just not appropriate right now.”\n\nLili also shared that her fame just comes with the job but it's not something that defines her.\n\n“I don't act to be famous,” she said. “I just am a performer.”\n\nShe also opened up about dealing with all the speculation about her life now that she's famous, despite the fact that she doesn't enjoy it at all.\n\n\"Am I pregnant? Am I dating someone? Am I gay? Am I gaining weight? Am I homophobic?,\" she said. \"People will always have something to say. I’ve accepted that. It doesn't mean it's not frustrating when people say those things. It's not like it just rolls off my back.\"\n\nAfter the interview, Lili also fired back at critics who went after she opened up about her experience with body dysmorphia in the same interview. She tweeted out various tweets throughout July 3 and 4.\n\nTelling someone they don’t deserve to feel insecure because their body is “fine” or “just like” whomever.. is wrong. That’s part of the problem. That’s part of body shaming. — Lili Reinhart (@lilireinhart) July 3, 2018\n\nI will never understand how someone can be so cowardly as to hide behind their phone and tell a stranger that their feelings are irrelevant and considered “whining,” just because they think you represent some ideal figure or shape. — Lili Reinhart (@lilireinhart) July 3, 2018\n\nFeeling really disheartened by the fact that so many people are saying “you’re skinny so shut up about embrscing your body.” As if my body dysmorphia is irrelevant because of how I look to some people. I’m either not curvy enough or not skinny enough to feel insecure. — Lili Reinhart (@lilireinhart) July 4, 2018\n\nMental illness gets worse when people say that you don’t have a right to feel the way you do. That’s where we are dailing. Do not encourage this behavior. It is destructive. More destructive than you’ll ever realize. You may not understand someone’s insecurity- but respect it. — Lili Reinhart (@lilireinhart) July 4, 2018\n\n\"Mental illness gets worse when people say that you don’t have a right to feel the way you do. That’s where we are dailing. Do not encourage this behavior,\" she tweeted. \"It is destructive. More destructive than you’ll ever realize. You may not understand someone’s insecurity- but respect it.\"\n\nMay 13, 2018\n\nIn case you didn't know, there's been a running joke between the Riverdale cast about who is the most \"daddy,\" so when Cole tweeted \"I can't wait to be a mommy someday\" on Mother's Day, Lili saw it as the perfect opportunity to start a Twitter war.\n\n\"You've admitted defeat,\" she responded the same day, at 8:43 P.M.\n\nYou’ve admitted defeat. — Lili Reinhart (@lilireinhart) May 14, 2018\n\nAs you might expect, Cole responded with a healthy dose of sarcasm. At 9:04 P.M., he shared screengrabs of their Twitter accounts and wrote, \"Sorry I didn't reply quicker, your notification got a little lost down the feed.\"\n\nSorry I didn’t reply quicker, your notification got a little lost down the feed pic.twitter.com/wMPHaq8qpJ — Cole M. Sprouse (@colesprouse) May 14, 2018\n\nFinally, at 11:10 P.M., Lili replied with a \"Whatever\" and a Barbie gif that shows one of the most epic hair flips of all time. Enjoy.\n\nMay 7, 2018\n\nBughead fans, rejoice! Lili and Cole finally made their red carpet debut at the 2018 Met Gala. Without a doubt, this was the most fabulous way to confirm their relationship.\n\nGetty Images\n\nApril 17, 2018\n\nLili is still Cole's photography muse. The star shared not one, but two gorgeous photos of Lili on Instagram looking like an angelic goddess in a flowey white dress.\n\nIt's hard to know if Cole took these pics WHILE they were in Mexico, but whether he did or not, clearly posting them while on their trip is a sign that he's in his feels and having a BLAST with Lili.\n\nApril 16, 2018\n\nWhile most celeb couples were schmoozing at Coachella, Lili and Cole are having a romantic getaway in Mexico! Lili and Cole have both been sharing the most beautiful pics from their trip — none together, though. Of course.\n\nSo how do we know they're there together?\n\nWell, Lili posted this video riding a horse looking like she's having a blast.\n\nThen Cole posted this video riding a horse where Lili can be seen riding her horse in front of him.\n\nThey're probably not feeling too bad about missing Coachella at all with views like this!\n\nApril 4, 2018\n\nTwo days after Cole and Lili pretty much confirmed their relationship with a very public kiss, the couple seemingly let the cat out of the bag with actual words!\n\nTMZ caught Cole and Lili making their way through LAX airport and asked the couple if it was a big decision for a celeb couple to go public with their relationship.\n\nAnd what did Lili have to say? She said, \"It's obvious.\"\n\nThere's some debate about what, exactly, Lili meant. She could have meant it's obvious that they're dating at this point, but she also could have been answering the paparazzi's question. As in, it's pretty obvious that a celeb couple making their relationship public is a big decision.\n\nOr maybe both?\n\nApril 2, 2018\n\nCole and Lili came pretty close to confirming they're together... by kissing in public! They totally got snapped smooching casually while on a press trip in Paris, France. And can you blame them? It's the City of Lights, after all. Love is most definitely in the air.\n\nMarch 25, 2018\n\nThe cast of Riverdale hit up Paley Fest 2018 to promote their upcoming season two musical episode. When it came time for the audience to ask questions, one fan decided to score a goal for Bughead shippers everywhere.\n\n\"Cole and Lili, there's been a lot of rumors that you guys are dating. Are you dating?\" the fan asked, giving Cole and Lili the opportunity to finally shut down all the speculation and rumors if they are not, in fact dating. But the rumored couple didn't take the bait.\n\n\"No comment,\" Cole whispered awkwardly into his mic as fans freaked out — no doubt taking his non-denial as confirmation that there's something going on between them.\n\nCheck out the moment below.\n\nJanuary 16, 2018\n\nLili echoed Cole's refusal to open up about the nature of their relationship with V magazine, explaining: “People are just dying to know information about if I’m in a relationship or not. I understand the interest, but it’s called a private life for a reason. And it’s not something that I owe the world.\"\n\nLili thinks people are bound to speculate over every one of her relationships, so why bother addressing any of it?\n\n“People are going to say anything and everything. They’re going to say that I love KJ, they’re gonna say that I love Cami, and they’re gonna say that I love Cole: it’s inevitable,” she said. “But I’m not at a point in my life where I’m ready to openly confirm, deny, or talk about a relationship that I’m in, because I think it’s brutal to have a relationship in the spotlight where I can be scrutinized by anyone and everyone.”\n\nJanuary 1, 2018\n\nCole and Lili spend New Years together in Hawaii. The couple that holidays together must be real, right?!\n\nCole Sprouse and Lili Reinhart with a fan today in Hawaii! pic.twitter.com/G9Dbk71zSO — Riverdale News (DAILY) (@_riverdalenews) January 2, 2018\n\nCole Sprouse and Lili Reinhart with fans on Hawaii (January 2, 2018) pic.twitter.com/etW027YAjp — AlwaysChach Sprouseblog (@am_Chach) January 3, 2018\n\nDecember 19, 2018\n\nThe pair won't confirm their relationship, but they will gush about each other on Instagram. For example, Lili couldn't even begin to handle how adorable Cole was on Friends as a child.\n\nNovember 27, 2018\n\nCole told People he will never, ever confirm his relationship with Lili. But he won't deny it either!\n\n\"Whether you dismiss those rumors or whether you encourage those rumors, it’s giving people who are, in my opinion, a bit entitled to your personal life more power,\" Cole explained to the mag.\n\n\"You have to have spaces for reverence in the industry,\" he continued. \"The more you let people in on that, the more people feel entitled to it and the more it becomes problematic with whoever you end up being with in the future, so I take that very seriously. So I just never talk about it because it’s not anyone’s right to know.\"\n\nBut Cole knows that fans are bound to continue speculating whether he confirms his relationships or not and he's okay with that. \"People can speculate all they want,\" he said. \"People speculate about me with every member of the cast practically, but it’s really no one’s right to know. It’s also sexy, these parts of the relationships that are just yours.\"\n\nOctober 26, 2017\n\nCole admitted that he doesn’t mind making out with Lili.\n\nWhen asked what fans could expect from season two on Live With Kelly and Ryan, Cole hinted at more Bughead sexy times. “[There will be] a little bit more of that, which is going to be good,” he said awkwardly.\n\nAnd he certainly doesn't mind kissing Lili on screen. “They’re contractually obliged to give me as many kiss scenes as possible this season,” he joked. “I wrote it into my contract.”\n\nCheck out the moment below!\n\nOctober 17, 2017\n\nJust another gorgeous shot of Lili snapped by Cole.\n\nHe captioned this one \"410,\" which was pretty mysterious to fans. Some think it refers to a date, while others think the number is a secret way for Cole to call Lili his angel.\n\nLili shared another photo from their shoot captioned, \"You go first.\"\n\nSeptember 14, 2017\n\nCole seems to suggest that Sprousehart is all in fans' heads in an interview with Entertainment Weekly.\n\n“Since the show began, people have wanted Lili and I to be together,\" Cole told the mag about the impact of Bughead. \"People have wanted Lili and Camila to be together. People have wanted KJ and I to be together. People have wanted every actor on this show to be in a union that they could make real. Truthfully, it’s very pleasing that people talk about Lili and I in that way because it means that we’re resonating so strongly that people really want that to be true,” Cole added.\n\nSeptember 13, 2017\n\nCole and Lili held hands on the cover of Entertainment Weekly. No biggie. (AKA, excuse me while I go cry my eyes out from happiness...)\n\nEntertainment Weekly\n\nAugust 11, 2017\n\nCole's TV dad Skeet Ulrich opened up about just how real Cole and Lili's chemistry is with Entertainment Tonight.\n\n\"They have great chemistry and they've been at our house with a lot of the Riverdale people and they always enjoy each other's company. So I wish them the best.\"\n\nSkeet was also asked if the pair share a \"special connection\" off screen, to which he responded: \"It seems like it, yeah. You just hear them talking to each other like they've been best friends for 20 years. So it's a good sign.\"\n\nJuly 23, 2017\n\nEagle-eyed fans spotted Cole and Lili sneakily caressing one another's hands in an interview during Comic Con.\n\nCasey Cott clearly felt the sparks.\n\nThe pair were supposedly spotted making out at the event, but pictures or it didn't happen, right? The closest thing we got to real evidence was this fan photo that proves Cole gave Lili his jacket to keep her warm, which is the next best thing, I guess!\n\nCole really did give his jacket to Lili I'm- pic.twitter.com/jsVGbq1bFG — Bread Inside (@emilysprentits) July 23, 2017\n\nJune 12, 2017\n\nLili responded to a ~creative~ thirst trap photo Cole shared on Twitter with major heart eyes.\n\n😍🔥💦💦 — Lili Reinhart (@lilireinhart) June 13, 2017\n\nApril 22, 2017\n\nCole shared another photo of Lili prancing through a flowery field, this time with a gushy, deep caption that fans had no trouble reading into and deciding was a veiled admission of undying love for Lili.\n\nMarch 18, 2017\n\nFans were feeling Cole and Lili on screen from the moment Riverdale premiered in January, but the real-life dating rumors didn't start until Cole shared this gorgeous photo of Lili in a field of flowers. Because clearly, it means she's his muse, right?", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cole-sprouse-and-lili-reinhart-attend-the-2019-met-gala-news-photo-1568061708.jpg?crop=1.00xw:0.363xh;0,0&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cole-sprouse-and-lili-reinhart-attend-the-2019-met-gala-news-photo-1568061708.jpg?crop=1.00xw:0.363xh;0,0&resize=1200:*", "keywords": [], "authors": ["Noelle Devoe", "Tamara Fuentes", "Carolyn Twersky", "Entertainment Editor", "When I'M Not Holed Up In My Room Going On A Completely Unproductive Netflix Binge Or Tumblr Stalking Timothée Chalomet", "I'M Searching For Awesome Celeb News Stories That Seventeen Readers Will Love", "Tamara Fuentes Is The Entertainment Editor For Seventeen", "Covers Celebrity News", "Pop Culture", "Television"], "canonical_link": "https://www.seventeen.com/celebrity/celebrity-couples/a19170778/cole-sprouse-lili-reinhart-relationship-timeline/", "title": "A Complete Timeline of Cole Sprouse and Lili Reinhart's Relationship", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Seventeen", "title": "A Complete Timeline of Cole Sprouse and Lili Reinhart's Relationship", "description": "They're still going strong.", "url": "https://www.seventeen.com/celebrity/celebrity-couples/a19170778/cole-sprouse-lili-reinhart-relationship-timeline/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cole-sprouse-and-lili-reinhart-attend-the-2019-met-gala-news-photo-1568061708.jpg?crop=1.00xw:0.363xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 112965278727107, "pages": 8028997215}, "article": {"publisher": "https://www.facebook.com/seventeen", "modified_time": "2020-03-10 08:57:30", "published_time": "2020-03-10 08:56:00", "section": "Celeb Couples", "opinion": "false"}, "twitter": {"site": "@seventeen", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cole-sprouse-and-lili-reinhart-attend-the-2019-met-gala-news-photo-1568061708.jpg?crop=1.00xw:0.363xh;0,0&resize=640:*"}, "google-site-verification": "uQMdsrh02fvs6lNVGcB04v0iEtK1MpGMQ3UF-Fy0RVI", "title": "Cole Sprouse and Lili Reinhart's Relationship Timeline - Jughead and Betty From Riverdale Dating IRL", "description": "Jughead and Betty from Riverdale are officially dating in real life. Check out Cole Sprouse and Lili Reinhart's real-life romance timeline of their confirmed relationship!", "keywords": "Cole Sprouse, Lili Reinhart, cole sprouse lili reinhart relationship, are bughead dating irl, Sprousehart, Lili Reinhart and Cole Sprouse, Bughead, Cole and Lili Pictures, Cole Sprouse and Lili Reinhart Dating, Cole Sprouse and Lili Reinhart Relationship, Riverdale Cast", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cole-sprouse-and-lili-reinhart-attend-the-2019-met-gala-news-photo-1568061708.jpg?crop=1.00xw:0.725xh;0,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebs & Entertainment,celebrity,celebrity-couples", "sailthru.date": "2020-03-10T20:56:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cole-sprouse-and-lili-reinhart-attend-the-2019-met-gala-news-photo-1568061708.jpg?crop=1.00xw:0.363xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cole-sprouse-and-lili-reinhart-attend-the-2019-met-gala-news-photo-1568061708.jpg?crop=1.00xw:0.725xh;0,0", "sailthru.socialtitle": "A Complete Timeline of Cole Sprouse and Lili Reinhart's Relationship", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1583801760.0, "source": "https://www.seventeen.com", "summary": ""}