{"url": "http://mentalfloss.com/article/64833/15-things-you-might-not-know-about-finding-nemo", "text": "Robert Redford’s long, storied career spans 60 years and includes countless Hollywood classics, from outlaw Westerns like Butch Cassidy and the Sundance Kid to political thrillers like All the President’s Men. But he's far from just a prolific actor with rugged good looks and a winning smile—he’s also an Oscar-winning director, a staunch supporter of independent films, and a devoted conservationist. Find out more about the living legend below.\n\n1. Robert Redford used to work at Yosemite National Park.\n\nWhen an 11-year-old Robert Redford was recovering from a mild case of polio in 1949, his mother took him to visit Yosemite National Park. He was immediately blown away by it, and later returned to apply for a job there. For two summers, he worked at Camp Curry—now called Curry Village—and Yosemite Valley Lodge, and spent his free time immersing himself in the natural wonders of the park. “It gave me a chance to really be there every day—to hike up to Vernal Falls or Nevada Falls,” he told Smithsonian.com. “It just took me really deep into it. Yosemite claimed me.” In 2016, Redford got a chance to virtually return to his boyhood playground by narrating the documentary National Parks Adventure, which explores Yosemite and many other American National Parks.\n\n2. Robert Redford earned a baseball scholarship to the University of Colorado.\n\nAs a boy, Redford had a natural aptitude for anything athletic, and sports were a main focus of his childhood (along with reading, which his parents both encouraged). In addition to track, tennis, and football, he grew up playing baseball, which eventually earned him a scholarship to the University of Colorado—but it didn’t last very long. “I became the campus drunk and blew out before I could ever get going,” Redford told People in 1998. He either dropped out or was expelled during his sophomore year (there are differing accounts), then relocated to Europe, where he spent a year and a half learning about art, culture, and politics from contemporaries in France and Italy. “I was living with a bunch of bohemians, highly politicized, and I'd be challenged by students about my country and I didn't know what they were talking about,” he told The Guardian. When he returned to the U.S., he made a concerted effort to stay up to date on national goings-on.\n\n3. Robert Redford has been married twice.\n\n\n\nRobert Redford and Sibylle Szaggars at the Cannes Film Festival in 2013. Andreas Rentz/Getty Images\n\nUpon his return to Los Angeles, Redford met a 17-year-old bank teller from Utah named Lola Van Wagenan, who lived in his building. The two married in 1958, moved to New York City, and went on to have four children before divorcing amicably in 1985. In the late 1990s, Redford began seeing German-born painter Sibylle Szaggars, though he predicted he’d never marry again. “I have to be careful in terms of never saying never, but I don’t think I would go there again,” he told People in 1998. He was right to be wary of saying “never”—the couple tied the knot in 2009.\n\n4. Robert Redford’s early adulthood was marked by tragedy.\n\nRedford’s mother, Martha Hart Redford, died suddenly from septicemia—a bacterial infection in the bloodstream—in 1955, when the future Oscar winner was 18 years old. “When I look back on it now, I realize she was the one person who believed in me throughout,” Redford said in an interview. Just four years later, Redford and his first wife, Lola, lost their 5-month-old son, Scott, to sudden infant death syndrome. “People think it’s been easy for me,” Redford told People. “That’s hard to live with. It’s so untrue.”\n\n5. Robert Redford considers his kids to be his greatest achievement.\n\n\n\nRobert Redford pictured with his son, Jamie, and daughter-in-law, Kyle, in 2009. Tim Mosenfelder/Getty Images\n\nThree of Redford’s children ended up with careers in the arts: Shauna became an artist, Jamie took up screenwriting, and Amy pursued acting. Redford considers them his ultimate success. “I've made some interesting movies, and I've been very satisfied with the work, but if someone wrapped it all up and said to me, ‘What's your greatest achievement?’ I'd say, ‘The children. They're the best thing in my life,’” he said.\n\n6. Robert Redford got his start on Broadway.\n\nAfter moving to New York, Redford enrolled at Brooklyn’s Pratt Institute with a plan to learn how to design theater sets. But it soon became clear that he was much better suited to being on stage rather than behind the scenes. During an acting class at the American Academy of Dramatic Arts, Redford impressed his teacher with a scene from Arthur Miller’s All My Sons, and something clicked. “Suddenly, I had support for something that was very raw, but felt good to me,” Redford told The Washington Post in 2005. He abandoned his design classes to study acting at the Academy instead, and in 1959 he performed in two Broadway plays: Tall Story and The Highest Tree.\n\n7. Barefoot in the Park was Robert Redford’s big break.\n\nRedford continued to perform plays in the early 1960s: Little Moon of Alban in 1960, Sunday in New York in 1961, and Barefoot in the Park in 1963. A few years after his first credited film role—1962’s War Hunt—Redford got to reprise his most recent Broadway character in the film adaptation of Barefoot in the Park, acting opposite the already well-established Jane Fonda (coincidentally, Fonda had starred in the movie versions of both Tall Story and Sunday in New York). It premiered in 1967 to generally positive reviews, and Redford’s portrayal of the well-to-do—and almost inconceivably handsome—Paul Bratter catapulted him to a much higher level in the Hollywood stratosphere.\n\n8. Robert Redford is notoriously late.\n\nIf you’re running late to a meeting with Robert Redford, don’t panic: he’s likely running even later than you are. “To a person, the colleagues and friends interviewed for this article predicted that Redford would not be on time and that the only question was by how much,” Ann Hornaday wrote for The Washington Post in 2005. (He was late—by nearly an hour.) “He’s been late all his life,” the late Sydney Pollack, who directed Redford in multiple films, told her. When asked about his own reputation for tardiness, Redford grinned and responded, “I’ve heard about it. It’s a myth.”\n\n9. Out of all his films, Butch Cassidy and the Sundance Kid is Robert Redford’s favorite.\n\nConsidering that Redford has built a veritable business empire on the word Sundance, it’s probably not altogether surprising that his character from 1969’s Butch Cassidy and the Sundance Kid is especially dear to him—in part because it was so much fun to shoot. “I love to ride, I like doing the stunts,” Redford said in 2011. “And Paul [Newman] and I had a great relationship that just evolved in the making of the film.”\n\n10. Robert Redford and Paul Newman liked to give each other gag gifts.\n\nRedford and Newman paired up again for 1974’s The Sting, and the two remained close friends until Newman’s death in 2008. Their relationship was playful both on- and offscreen, and the pals were known to prank each other from time to time. Once, Newman gifted Redford a pillow embroidered with the adage “Punctuality is the courtesy of kings,” poking fun at Redford’s habitual tardiness. For Newman’s 50th birthday, Redford wrapped up an old junkyard Porsche—a nod to Newman’s penchant for auto racing—and delivered it to Newman’s back doorstep. Newman then deposited it in the middle of Redford’s living room. Determined to have the last laugh, Redford had the beat-up automobile made into a garden sculpture, which he set in Newman’s yard.\n\n11. Robert Redford almost turned down The Way We Were.\n\nFilmmakers were pushing hard for Robert Redford to star alongside Barbra Streisand in 1973’s The Way We Were, but he wasn’t keen on Hubbell Gardiner, a character he thought was too one-dimensional to be anything more than a “Ken doll” for Streisand’s Katie Murosky to fall in love with. After extensive script revisions, Redford finally felt that Hubbell was flawed enough to be interesting, and signed on to play the role. He did, however, have one additional concern. “She’s not going to sing, is she?” he asked director Sydney Pollack, referring to Streisand. “I don’t want it to be a musical.” It wasn’t, but Streisand did sing one rather memorable track for the film: “The Way We Were,” which won both Best Original Song at the Oscars and Song of the Year at the Grammys in 1974.\n\n12. Robert Redford was already interested in making a movie about Watergate while the scandal was still unfolding.\n\nRedford didn’t just play Bob Woodward in 1976’s All the President’s Men—he was instrumental in making sure the movie happened in the first place. In 1972, more than a year before Richard Nixon’s resignation, Redford called Woodward and asked to meet about a potential film. Woodward was wary, and even considered the possibility that it was a prank—or worse, someone working in Nixon’s White House—but Redford eventually succeeded in discussing the project with him and fellow Washington Post reporter Carl Bernstein. Though no decisions were made for a couple more years, when Bernstein and Woodward published their book, All the President’s Men, in 1974, they sold the rights to Redford.\n\n13. Robert Redford founded the Sundance Institute right after winning his first Oscar.\n\nToday, Redford is one of the world’s most famous champions of independent filmmaking, but back in 1981, he was still a novice filmmaker who had just nabbed his first (and only) Oscar for directing his first film, Ordinary People. Almost immediately after the win, he founded the Sundance Institute, an organization that supports independent films. “I’ve always had this personal theory that at just the moment of the highest achievement, you should stop and go back to zero and not take anything for granted,” he told The Washington Post.\n\nBut that wasn’t the only reason he decided to devote his resources to indie projects. Cable, home video, and then-new blockbuster franchises like Superman and Star Wars were rapidly changing the landscape of the film industry in the late 1970s, and Redford was thinking ahead about what that might mean for less established artists. “I said, ‘Well, that's OK, the film business is a broad one, but is that going to be at the expense of more humanistic films?’ And I felt that it would be.”\n\n14. Robert Redford convinced the author of A River Runs Through It to let him adapt it for film.\n\nIn 1976, Norman Maclean published A River Runs Through It and Other Stories, a semi-autobiographical collection of tales about his upbringing in early 20th-century Montana, which garnered literary acclaim and piqued the interest of Hollywood filmmakers. But Maclean held onto the rights, reluctant to hand the reins to people who likely wouldn’t let him have much say in the adaptation of his work. Redford, on the other hand, promised to consult with the author and his family throughout the whole process, and Maclean agreed. Unfortunately, Maclean didn’t live long enough to see the final result; he passed away in 1990, and the Redford-directed film—starring a young up-and-comer named Brad Pitt—didn’t hit theaters until 1992.\n\n15. Robert Redford was friends with Gabriel García Márquez.\n\nWhen Redford invited Gabriel García Márquez to lead a Spanish-speaking lab at the Sundance Institute, the renowned author of One Hundred Years of Solitude suggested a deal—he’d visit Sundance if Redford would come with him to Cuba, which Redford agreed to do. During their vacation in Havana, García Márquez introduced the actor to Che Guevara’s widow, who sold him the rights to her late husband’s memoir The Motorcycle Diaries. The film adaptation, produced by Redford and directed by Walter Salles, was released in 2004, and Jorge Drexler’s “Al Otro Lado del Rio” clinched an Oscar for Best Original Song.\n\n16. Barack Obama awarded Robert Redford the Presidential Medal of Freedom in 2016.\n\n\n\nRobert Redford receives the Presidential Medal of Freedom in 2016. Chip Somodevilla/Getty Images\n\nIn 2016, President Barack Obama presented Redford with America’s highest civilian honor for his contributions as an actor, director, producer, and conservationist. Redford wasn’t the only member of the cultural elite to receive the award that year: Robert De Niro, Tom Hanks, Bruce Springsteen, Diana Ross, Ellen DeGeneres, and Lorne Michaels were also honored, as were Bill and Melinda Gates and Michael Jordan. When asked what was going through his mind during the ceremony, Redford told C-SPAN that he wished his parents were alive to see it. “I don’t think either one of them saw this coming,” he said with a chuckle.\n\n17. Robert Redford may or may not be retired from acting.\n\nWhile promoting the release of 2018’s The Old Man & the Gun—which earned him a Golden Globe nomination for Best Actor in a Musical or Comedy—Redford confessed that he was ready to hang up the acting hat he’d been wearing for 60 years. “Never say never, but I pretty well concluded that this would be it for me in terms of acting,” he told Entertainment Weekly that August. “I thought, ‘Well, that’s enough.’ And why not go out with something that’s very upbeat and positive?”\n\nIt’s a good thing Redford qualified his statement with a “Never say never,” because he took it back the following month. “I think it was a mistake to say that I was retiring because you never know,” he told People at the New York premiere of the film in September.", "images": ["https://images2.minutemediacdn.com/image/upload/f_auto,fl_lossy,q_auto,w_1280/f_auto,h_487,q_auto,w_730/v1586358797/shape/mentalfloss/622557-gettyimages-472485880.jpg", "https://images2.minutemediacdn.com/image/upload/c_crop,h_1600,w_2378,x_11,y_0/f_auto,h_229,q_auto,w_344/v1586272846/shape/mentalfloss/622512-gettyimages-167237265.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=9929026&cv=2.0&cj=1", "https://images2.minutemediacdn.com/image/upload/c_fit,f_auto,fl_lossy,q_auto,w_728/v1585947451/shape/mentalfloss/622408-gettyimages-625100480.jpg?itok=Zv3aBtmV", "https://images2.minutemediacdn.com/image/upload/c_fit,f_auto,fl_lossy,q_auto,w_728/v1555466136/shape/mentalfloss/64833-pixar3.jpg?itok=CJ4CkeES", "https://images2.minutemediacdn.com/image/upload/c_crop,h_1136,w_2020,x_0,y_0/f_auto,q_auto,w_1100/v1554924679/shape/mentalfloss/64833-pixar.jpg", "https://images2.minutemediacdn.com/image/upload/c_fit,f_auto,fl_lossy,q_auto,w_728/v1585947033/shape/mentalfloss/622408-gettyimages-169250240.jpg?itok=ObendqL_", "https://images2.minutemediacdn.com/image/upload/c_crop,h_1594,w_2369,x_15,y_0/f_auto,h_229,q_auto,w_344/v1585940846/shape/mentalfloss/622405-gettyimages-1088347334.jpg", "https://images2.minutemediacdn.com/image/upload/c_crop,h_1136,w_2020,x_0,y_0/v1554924679/shape/mentalfloss/64833-pixar.jpg?itok=_kgLK5To", "https://images2.minutemediacdn.com/image/upload/c_crop,h_1080,w_1924,x_0,y_236/f_auto,q_auto,w_1100/v1585946699/shape/mentalfloss/622408-gettyimages-2661980.jpg", "https://images2.minutemediacdn.com/image/upload/c_fit,f_auto,fl_lossy,q_auto,w_728/v1587138428/shape/mentalfloss/623325-sierrasothebysinternationalrealty1.jpg?itok=BCJHBywC", "https://images2.minutemediacdn.com/image/upload/c_fit,f_auto,fl_lossy,q_auto,w_728/v1555466136/shape/mentalfloss/64833-pixar1.jpg?itok=tx__6F2o", "https://images2.minutemediacdn.com/image/upload/c_fit,f_auto,fl_lossy,q_auto,w_728/v1587138574/shape/mentalfloss/623325-sierrasothebysinternationalrealty2.jpg?itok=8mMLKlFv", "https://images2.minutemediacdn.com/image/upload/c_fit,f_auto,fl_lossy,q_auto,w_728/v1587138807/shape/mentalfloss/623325-sierrasothebysinternationalrealty3.jpg?itok=m9lhbfcR", "https://images2.minutemediacdn.com/image/upload/c_fit,f_auto,fl_lossy,q_auto,w_728/v1555466136/shape/mentalfloss/64833-pixar2.jpg?itok=IBj9wD9S", "https://images2.minutemediacdn.com/image/upload/c_fit,f_auto,fl_lossy,q_auto,w_728/v1555466136/shape/mentalfloss/64833-pixar4.jpg?itok=Su8DikOx", "https://images2.minutemediacdn.com/image/upload/c_fit,f_auto,fl_lossy,q_auto,w_728/v1585947259/shape/mentalfloss/622408-gettyimages-85589006.jpg?itok=yCyp9nGP", "https://images2.minutemediacdn.com/image/upload/c_crop,h_1124,w_2000,x_0,y_105/f_auto,q_auto,w_1100/v1587138282/shape/mentalfloss/623325-sierrasothebysinternationalrealtyhed_0.jpg", "http://mentalfloss.com/bundles/mfsite/images/global/close_white.png"], "top_img": "https://images2.minutemediacdn.com/image/upload/c_crop,h_1136,w_2020,x_0,y_0/v1554924679/shape/mentalfloss/64833-pixar.jpg?itok=_kgLK5To", "keywords": [], "authors": [], "canonical_link": "https://www.mentalfloss.com/article/64833/15-things-you-might-not-know-about-finding-nemo", "title": "15 Things You Might Not Know About Finding Nemo", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "animation, disney, entertainment, lists, movies, news, pop culture", "description": "Pixar’s beloved underwater masterpiece was released 15 years ago.", "ir-site-verification-token": "-2106322133", "og": {"url": "https://www.mentalfloss.com/article/64833/15-things-you-might-not-know-about-finding-nemo", "type": "article", "title": "15 Things You Might Not Know About <em>Finding Nemo</em>", "description": "Pixar’s beloved underwater masterpiece was released 15 years ago.", "image": "https://images2.minutemediacdn.com/image/upload/c_crop,h_1136,w_2020,x_0,y_0/v1554924679/shape/mentalfloss/64833-pixar.jpg?itok=_kgLK5To"}, "article": {"published_time": "2018-05-30T08:00:00-04:00", "section": "entertainment"}, "twitter": {"card": "summary_large_image", "site": "@mental_floss", "title": "15 Things You Might Not Know About Finding Nemo", "image": {"identifier": "https://images2.minutemediacdn.com/image/upload/c_crop,h_1136,w_1687,x_129,y_0/v1554924679/shape/mentalfloss/64833-pixar.jpg?itok=TRmq53Z0", "height": 120, "width": 120}, "description": "Pixar’s beloved underwater masterpiece was released 15 years ago."}}, "movies": ["https://www.youtube.com/embed/0iqF2Tk_1WA", "https://www.youtube.com/embed/rY-uQehpXf0", "https://www.youtube.com/embed/YdJW2UxvSFQ", "https://www.youtube.com/embed/CKvBvWb0Wzg", "https://www.youtube.com/embed/DC3YFyah_Yg", "https://www.youtube.com/embed/OsIolBViUmc", "https://www.youtube.com/embed/d7rlUe-Thvk"], "publish_date": 1527681600.0, "source": "http://mentalfloss.com", "summary": ""}