{"url": "https://web.archive.org/web/20061116002411/http://www.forbes.com:80/2006/04/15/prison-supermax-ross_cx_jr_06slate_0418super.html?", "text": "'); //--> E-mail | Print | Comments | Request Reprints | E-Mail Newsletters | My Yahoo! | RSS\n\nBlank Slate\n\nIs The End In Sight For Supermax?\n\nJeffrey Ian Ross\n\n\n\nWhen you think about it, it\u0092s really no different than any other public works project: You need prisons, you build prisons. You need better ones, you design and build better ones. When prison populations fall--well, that\u0092s a more difficult matter. How do we keep an appropriate number of prisons on line and available to house--and hopefully rehabilitate--a prison population that is in flux? Even with violent-crime rates trending downward nationwide, how do we prepare for a potential rise in the numbers of extremely violent offenders who require special facilities--like the highly touted Supermax prisons? The answer is the same as it would be for schools, shopping malls and highways: You build them based on your current and expected needs. And you hope they\u0092ll be used. In 1994, the federal government opened its first Supermax prison in Florence, Colo., dubbed the \u0093Alcatraz of the Rockies.\u0094 In the years that followed, many state departments of corrections built their own. Supermax prisons, also known as Special (or Security) Handling Units or Control Handling Units, are known for their strict lockdown policies, lack of amenities and prisoner isolation techniques. Escapes from Supermaxes are so rare they're statistically inconsequential. However, as good as these prisons are at keeping our worst offenders in check, the purpose of the Supermax is in flux. Originally set up to house the most violent, hardened and escape-prone criminals, Supermaxes are instead used for leaders of criminal organizations and gangs, serial killers, persistent rule-breakers and political criminals like spies and terrorists. The Supermaxes maintained by the Federal Bureau of Prisons in Marion, Ill., and Florence, Colo., incarcerate a total of 1,710 people, including such notable criminals as \"Unabomber\" Ted Kaczynski and Oklahoma City bombing co-conspirator Terry Nichols. In the United States alone, some 7 million people are under the control of the criminal justice system. About 2.1 million are behind bars, while another 4.9 million are on probation, parole or some other type of community correction. Only a fraction of these populations find themselves in a Supermax facility. In 1998, approximately 20,000 inmates were locked up in this type of prison, representing less than 2% of all the men and women currently incarcerated across the country. Most of the Supermaxes in the United States, such as the federal facility in Florence, are brand new or nearly so. Others are simply free-standing prisons that were retrofitted. According to a study by the Urban Institute, the per-cell cost of a Supermax is about $75,000 annually, compared to $25,000 for each cell in an ordinary state prison. You can see the problem: We have plenty of super-expensive Supermax facilities--two-thirds of the states now have them. But they were designed when crime was considered a growing problem, and now we have a remarkably lower violent-crime rate showing no real signs a turn for the worse. What to do? How do we use these pricey islands of ultimate correction? No self-respecting state director of the corrections or correctional planner will admit that the Supermax concept was a mistake. And you\u0092d be wrong to think that these prisons can be replaced by something drastically less costly. But prison experts are beginning to realize that, just like a shrinking city that finds itself with too many schools or fire departments, the Supermax model must be made more flexible in order to justify its size and budget. One solution is to house different types of prisoners. Earlier this month, Wisconsin Department of Corrections officials announced that over the past 16 years, the state\u0092s Supermax facility in Boscobel--built to the tune of $47.5 million (in 1990 dollars) and with a capacity of 500 inmates--has always stood at 100 cells less than its capacity. It will now be housing maximum security prisoners--serious offenders, but a step down from the worst of the worst. The Maryland Correctional Adjustment Center, aka the Baltimore Supermax prison, opened in 1989 at a cost of $21 million (in 1989 dollars) with room for 288 inmates. Like its cousin in Wisconsin, the structure has never been at capacity. Not only does it hold the state's most dangerous prisoners, it also houses 100 or so inmates who are working their way through the federal courts, and serves as the home for Maryland\u0092s ten death row convicts. Converting cells is one approach, but not the only one. Other ideas include building more regional Supermaxes, and filling them by shifting populations from other states. This would allow us to completely empty out a given Supermax, and then close it down or convert it to another use. There\u0092s also the possibility that some elements of the Supermax model could be combined with the approaches of traditional prisons, creating a hybrid that serves a wider population. But different types of prisoners would have to be kept well away from each other--a logistical problem of no small concern. It\u0092s worth considering that the Supermax model--which includes prisoner isolation for 23 out of every 24 hours a day--may be serving as a deterrent to some violent criminals, a kind of brightly lit billboard that advertises the life of rather extreme measures they are facing. There\u0092s no way to quantify that, but it\u0092s not out of the realm of possibility. Whatever the solution or solutions to the issue of Supermax costs, it\u0092s important to remember that an empty jail cell of any kind is an indicator to our society of one truth: We must be doing something right.\n\n\n\n\n\nMore On This Topic Companies: CXW | CRN | GGI\n\nArticle Controls E-mail | Print | Comments | Request Reprints | E-Mail Newsletters | My Yahoo! | RSS\n\n\n\nRelated Sections Home > Technology > Blank Slate\n\n\n\n\n\n'); //--> News Headlines | More From Forbes.com | Special Reports Subscriptions >\n\n\n\n\n\n\n\n\n\n", "images": ["https://web.archive.org/web/20061116002411im_/http://images.forbes.com/media/assets/spacer_white.gif", "https://web.archive.org/web/20061116002411im_/http://images.forbes.com/media/partners/footer/mirrorimage.gif", "https://web.archive.org/web/20061116002411im_/http://images.forbes.com/media/partners/footer/hemscott.gif", "https://web.archive.org/web/20061116002411im_/http://images.forbes.com/media/partners/footer/web_logo_forbescom_small.gif", "https://web.archive.org/web/20061116002411im_/http://secure-us.imrworldwide.com/cgi-bin/m?ci=us-forbes&cg=0", "https://web.archive.org/web/20061116002411im_/http://images.forbes.com/media/partners/footer/att.gif", "https://web.archive.org/web/20061116002411im_/http://images.forbes.com/media/icons/xml.gif", "https://web.archive.org/web/20061116002411im_/http://images.forbes.com/media/partners/footer/comstock.gif", "https://web.archive.org/web/20061116002411im_/http://images.forbes.com/media/bookstore/0727house_of_money_thumb.jpg", "https://web.archive.org/web/20061116002411im_/http://images.forbes.com/media/partners/yahoo/plus8x8.gif", "https://web.archive.org/web/20061116002411im_/http://images.forbes.com/media/partners/footer/fadc-sm-logo-footer.gif", "https://web.archive.org/web/20061116002411im_/http://images.forbes.com/media/partners/footer/spirent.gif", "https://web.archive.org/web/20061116002411im_/http://images.forbes.com/media/partners/footer/quotemedia.gif", "https://web.archive.org/web/20061116002411im_/http://images.forbes.com/media/assets/special.gif", "https://web.archive.org/web/20061116002411im_/http://images.forbes.com/media/blankslate/blankslate-sm.gif"], "top_img": "https://web.archive.org/web/20061116002411im_/http://images.forbes.com/media/blankslate/blankslate-sm.gif", "keywords": [], "authors": ["Robert Lenzner"], "canonical_link": "", "title": "Is The End In Sight For Supermax?", "meta_data": {"description": "Americas most secure and most expensive prisons stand largely empty.", "keywords": "Prison,Corrections,Supermax,Reinvention,Blank Slate"}, "movies": [], "publish_date": 1145030400.0, "source": "https://web.archive.org", "summary": ""}