{"url": "www.thehollywoodgossip.com/2018/03/kim-kardashian-desperate-to-take-down-kylie-jenner/", "text": "Kim Kardashian and Kylie Jenner: sisters, friends, reality show co-stars ...\n\n... Mortal enemies?!\n\nBelieve it or not -- just kidding, this is pretty easy to believe -- many rumors have been claiming there's just a little bit of bad blood between Kylie and Kim, on account of Kylie's ridiculously fast rise to fame.\n\nWell, she was always famous, but it's the fact that she's on track to becoming more famous than Kim that's the problem.\n\nOr, OK, the real problem is that more fame equals more money.\n\nKim is reportedly upset that her little sister could become more wealthy than she is, that's what we're getting at here.\n\nAccording to a source close to the family, Kim \"takes all the credit\" for making her family famous, which is definitely fair.\n\nO.J. Simpson would be the only other person who could perhaps take this credit -- after all, he put Robert Kardashian on his legal team for his murder trial, which was the very first time the public heard the Kardashian name.\n\nThat little tie-in probably had a little to do with our fascination with the family once the reality show started, but actually getting the show picked up?\n\nThat was all Kim (shout-out to Ray J though).\n\nIf she hadn't buddied up with Paris Hilton and had that whole sex tape leak, there's a solid chance we wouldn't know who any of these people are, so it's understandable that she takes credit for it all.\n\nBut the source also says that Kim \"always thought she'd be the first billionaire in the family.\"\n\nThen Kylie happened.\n\nWith her wildly successful cosmetics company and her popularity with the younger crowd, Kylie could very easily be the first billionaire in the family.\n\nKylie Cosmetics is actually all set to become a billion dollar company within the next few years.\n\nAnd now Kim is apparently \"desperate to dethrone Kylie.\"\n\nIt seems like the makeup thing is a particularly sore spot for Kim -- the insider says that \"Kylie's makeup empire has amassed her a fortune and Kim is a little bitter about all the money that goes straight into Kylie's pockets.\"\n\nAgain, \"because Kim feels like much of those earnings are thanks to everything she did first.\"\n\nIf this is true, it's such a petty stance, because then wouldn't Kim owe Paris for helping her to become famous? And wouldn't Paris owe her super wealthy family for putting her in the position to become famous?\n\nWhere does it end?\n\nWhether you like her or not, Kylie's makeup company is successful for a reason.\n\nShe has quality products, she's put the work in, and she wisely capitalized on her popularity and all the attention she and her lips have been getting for years now.\n\nShe doesn't owe Kim anything for that.\n\nYou might think it's a little sad that Kim is anything but happy for her little sister's success, but don't worry -- Kylie is in on it, too.\n\nThe source claims that the littlest Jenner has \"become increasingly worried that Kim is going to steal back her thunder, but she's ready to take her on.\"\n\n\"She loves being a mom but there's no way in hell she's going to let Kim win the money game.\"\n\nYep, step aside, little Stormi, mama's got even more money to make!\n\nAnd speaking of Stormi ... is anyone looking forward to 2040 when we'll be reading stories like these about her and North?!\n\nIt's the circle of life. Look into it, Kim.", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--kBIsEmtg--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1519692040/kim-kardashian-west-snapshot.png"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--kBIsEmtg--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1519692040/kim-kardashian-west-snapshot.png", "keywords": [], "authors": ["Emily Trainham"], "canonical_link": "https://www.thehollywoodgossip.com/2018/03/kim-kardashian-desperate-to-take-down-kylie-jenner/", "title": "Kim Kardashian: Desperate to Take Down Kylie Jenner?!", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2018/03/kim-kardashian-desperate-to-take-down-kylie-jenner/", "title": "Kim Kardashian: Desperate to Take Down Kylie Jenner?!", "description": "Kim Kardashian loves her baby sister, Kylie Jenner ... but she may also be intent on destroying her.", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--XL2-cNjx--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1517952376/kylie-jenner-and-baby-stormi.png", "type": "image/png", "width": 630, "height": 523}}, "article": {"published_time": "2018-03-01T12:35:12-05:00", "modified_time": "2018-03-01T12:33:08-05:00", "tag": "Kylie Jenner", "author": "Emily Trainham"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Kim Kardashian: Desperate to Take Down Kylie Jenner?!", "description": "Kim Kardashian loves her baby sister, Kylie Jenner ... but she may also be intent on destroying her.", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--kBIsEmtg--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1519692040/kim-kardashian-west-snapshot.png"}}, "description": "Kim Kardashian loves her baby sister, Kylie Jenner ... but she may also be intent on destroying her."}, "movies": [], "publish_date": 1519925712.0, "source": "http://www.thehollywoodgossip.com", "summary": ""}