{"url": "https://en.wikipedia.org/wiki/John_Stamos", "text": "American actor and musician\n\n\"Stamos\" redirects here. For a surname, see Stamos (surname)\n\nJohn Phillip Stamos (Greek: Τζον Φίλλιπ Στάμος; STAY-mohss; born August 19, 1963)[1] is an American actor, producer, musician, comedian and singer. He first gained recognition for his contract role as Blackie Parrish on the ABC television series General Hospital, for which he was nominated for the Daytime Emmy Award for Outstanding Supporting Actor in a Drama Series. He is known for his work in television, especially in his starring role as Jesse Katsopolis on the ABC sitcom Full House. Since the show's finale in 1995, Stamos has appeared in numerous TV films and series. Since 2005, he has been the national spokesperson for Project Cuddle.[2]\n\nFrom 2005 to 2009, Stamos had a starring role on the NBC medical drama ER as Dr. Tony Gates. In September 2009, he began playing the role of Albert in the Broadway revival of Bye Bye Birdie. From September 2015 to 2016, Stamos starred as the lead character in the Fox sitcom Grandfathered. As of 2016, he is an executive producer of the Netflix series Fuller House, in which he reprised the role of Jesse Katsopolis. Recently, he starred as Dr. Nicky in the Lifetime/Netflix psychological thriller You.\n\nEarly life [ edit ]\n\nJohn Stamos was born on August 19, 1963 in Cypress, California to William \"Bill\" Stamos, a restaurateur, and Loretta (née Phillips).[3]\n\nIn his youth, Stamos worked for his father's restaurants, and as a teenager had a job flipping burgers in the Orange County area. He attended John F. Kennedy High School and played in the marching band there. At 15, he attended his first Beach Boys concert; a huge fan, he would later tour with the band. His parents were supportive of his aspiration to be an actor, and although he planned to enroll at Cypress College for the 1981 term, he skipped his first semester to focus on launching a career as an actor—with his father's blessing. After just three weeks, he landed his first role on General Hospital.[4]\n\nActing career [ edit ]\n\n1982–1986: Early career [ edit ]\n\nStamos began his acting career with the role of Blackie Parrish on the soap opera General Hospital in late January 1982, for which he was nominated for a Daytime Emmy Award in 1984. That April, he went on to the lead role in the short-lived CBS sitcom Dreams, in which he played an aspiring musician in a band of the same name. Later, he played a cast role in the sitcom You Again? (1986) with Jack Klugman.\n\n1987–1995: Full House [ edit ]\n\nStamos at the 1990 Grammy Awards\n\nIn the late 1980s, ABC's Full House gradually became a hit, and the show solidified Stamos's career. He asked that the character's last name be Katsopolis to highlight his Greek heritage, according to show creator and executive producer Jeff Franklin. He played one of the show's protagonists, Jesse, who lives with his brother-in-law, whose deceased wife was Jesse's older sister. Danny's best friend, Joey, also lives in the house with them. The three help each other raise three young girls. Jesse is known to be the \"bad boy\" at first until he falls in love with and marries Rebecca Donaldson and has twin boys, Nicky and Alex. In 1995, after eight seasons, the series came to an end. Stamos has since maintained close relationships with co-stars Bob Saget, Dave Coulier, Lori Loughlin, Jodie Sweetin, Mary-Kate and Ashley Olsen, Andrea Barber, and Candace Cameron Bure.\n\n1996–2009: Later career [ edit ]\n\nStamos has appeared in numerous made-for-television films, stage productions, television series, and commercials. He had starring roles in the television series Thieves (2001) and Jake in Progress (2005). Both shows ran for several episodes before cancellation.[5][6] In 2003, Stamos guest-starred on Friends, appearing in the season nine episode, \"The One with the Donor\", playing a man who went to Chandler and Monica's apartment for dinner, not knowing he was actually being interviewed to be a sperm donor. Stamos was a guest star in a first-season episode of MTV's The Andy Milonakis Show (2005), playing himself. He took part in only one skit, which featured him in a tree, having rabies, and being put down by another character. In the A&E television movie Wedding Wars (2006), he starred as Shel, a gay wedding planner. He stated that his performance reflected his support for same-sex marriages.[7]\n\nHe has made several voice acting appearances such as in the MTV animated series Clone High in the episode, \"Changes: The Big Prom: The Sex Romp: The Season Finale\", where he played himself, and as the What's Global Warming Penguin in Bob Saget's parody film Farce of the Penguins. In 2005, Stamos guest-starred in two episodes in season 12 of ER as paramedic-turned-intern Tony Gates. In 2006, at the start of ER's thirteenth season, he joined the cast of ER as a series regular. In February 2008, Stamos appeared in the television adaptation of A Raisin in the Sun. In August 2008, he was the roast master for Comedy Central Roast of Bob Saget.[8]\n\n2010–present: Grandfathered, Fuller House, and other ventures [ edit ]\n\nOn June 8, 2010, it was announced that Stamos would portray Carl Howell, a new love interest for Emma Pillsbury (Jayma Mays), in season two of the television show Glee.[9][10] In 2011, Stamos guest-starred on Law & Order: Special Victims Unit[11] and was featured in a CollegeHumor video with Bob Saget.[12] Stamos also guest-starred as himself on Two and a Half Men as Charlie's old friend, who was interested in buying the house until he found out that the place was Charlie's.\n\nStamos in 2012\n\nSince 2011, Stamos has appeared in a series of commercials for Dannon's Greek yogurt brand Oikos; including his first Super Bowl commercial which was aired during Super Bowl 2012.[13] In February 2012, it was reported that Stamos would take on one of the lead roles on the new Fox drama Little Brother. The series was created by Everybody Loves Raymond writer Mike Royce, and centers around a man who finds out that he has a long-lost half-brother.[14]\n\nIn March 2013, Stamos signed on in a recurring role on the USA Network drama Necessary Roughness, during season three. He played Connor McClane, the head of a sports and entertainment management company that is interested in hiring Dani.[15] Stamos was to play the lead role in ABC's soap opera Members Only,[16] but the network decided not to air the show.[17]\n\nIn April 2015, Stamos announced on Jimmy Kimmel Live! that the streaming service Netflix would be picking up Full House for a 13-episode sequel, titled Fuller House, to start airing on February 26, 2016.[18] In September, he began leading the cast of the Fox sitcom Grandfathered, also starring Josh Peck, Christina Milian, and Paget Brewster.[19] In 2016, Stamos appeared in the film My Big Fat Greek Wedding 2, and joined the Fox black comedy series Scream Queens in its second season, as series regular Dr. Brock Holt.[20]\n\nIn 2018, Stamos starred in Lifetime's former television adaptation of You as Dr. Nicky, which premiered on September 9, 2018.[21] On December 3, 2018, it was announced that You would move to Netflix as a \"Netflix Original\" title, ahead of the premiere of the second season.[22] On June 24, 2019, it was confirmed that Stamos will reprise his role, as Dr. Nicky in the second season of the Netflix series, You.[23] The second season was released on December 26, 2019.[24]\n\nMusic and theatre [ edit ]\n\nStamos started learning drums when he was four, then began to take up playing the guitar, and started his own band called Destiny. The band had played concerts at some amusement parks and parties.[25]\n\nIndependently [ edit ]\n\nStamos performed on an independently released 1994 album entitled Shades of Blue along with Lanny Cordola, Gary Griffin, Sandra Stephens, Tony Guerrero, and David Enos. Shades of Blue was re-released digitally through iTunes and other channels in 2010 after being long out-of-print. He appeared on Broadway as The Emcee in Cabaret, and also in Nine and How To Succeed in Business Without Really Trying. Stamos performed the Billy Joel song \"Lullabye (Goodnight, My Angel)\" on the 2006 charity album Unexpected Dreams – Songs From the Stars.\n\nOn March 30, 2009, he announced that he would participate in the Broadway revival of Bye Bye Birdie.[26] Stamos won the 2009–10 Golden Icon Award for best actor in a musical for his performance in that production.[27] Stamos was awarded a star on the Hollywood Walk of Fame on November 16, 2009.[28] The star is located at 7021 Hollywood Blvd.\n\nStamos performed with John Fogerty on April 24, 2010, during one of the Tampa Bay Rays post-game concerts. Stamos rotated between the tambourine, drums, and bass guitar throughout the concert. In August 2011, Stamos performed in Hairspray at the Hollywood Bowl as Corny Collins, alongside an all-star cast.[29]\n\nOn July 10, 2012, Stamos began performances on Broadway in Gore Vidal's The Best Man as Senator Joseph Cantwell.[30] Stamos reprised his role as Jesse Katsopolis for a \"Jesse and the Rippers\" reunion on Late Night with Jimmy Fallon on July 19, 2013. Played straight by host Fallon (who introduced the band as being from San Francisco and having a number one song in Japan), Stamos performed a medley of songs featured on Full House including \"Forever\" and the series' theme song \"Everywhere You Look\". Bob Saget and Lori Loughlin also made cameos.[31]\n\nIn 2014, Stamos directed the music video \"Let Yourself be Loved\" for the Nashville-based band Diamond Carter, featuring the band's front-man Tyler Tuohy alongside actress Nicky Whelan. Stamos was also noted as a co-writer for the song, along with Michael Gigante, and the video was released on Yahoo Music on May 21, 2014.[32]\n\nThe Beach Boys [ edit ]\n\nStamos has occasionally performed in concert with The Beach Boys, dating back to 1985, typically playing drums and various other percussion instruments. In 1988, he appeared in their video for \"Kokomo\", in which he played both the conga drums and the steel drums. In 1990, he played drums for them on the title track of the comedy Problem Child and also appeared in the song's music video.\n\nIn 1992, he sang lead vocals on a new version of \"Forever\" for their album Summer in Paradise. The song was originally written and sung by Beach Boy Dennis Wilson and released in 1970. The song was also featured twice on Full House. The first was a recording sung at his character's wedding, while the second was a recording sung for his character's twin sons. The 1992 music video, titled \"Forever by Jesse and the Rippers\", featured Stamos predominantly. Three of The Beach Boys members are however briefly shown singing harmonies with Stamos: Carl Wilson, Bruce Johnston, and Mike Love.\n\nSince the 1990s, Stamos has occasionally performed with The Beach Boys, such as during their summer tours, playing drums and guitar, and singing along on some of their hit songs, like \"Forever\", including:\n\nPersonal life [ edit ]\n\nStamos is a big fan of Elvis Presley and has often referenced or paid homage to him in the show Full House. Stamos began dating model/actress Rebecca Romijn in 1994 after they met at a Victoria's Secret fashion show in which she was modeling. Stamos and Romijn became engaged on Christmas Eve 1997, and they married on September 19, 1998, at the Beverly Hills Hotel.[39] They announced their separation in April 2004.[40] Stamos filed for divorce in August 2004,[41] and it became final on March 1, 2005.[42]\n\nOn October 23, 2017, Stamos announced his engagement to model and actress Caitlin McHugh after a year of dating.[43] In December 2017, the couple announced they were expecting their first child, due in the spring of 2018.[44] Stamos and McHugh married in February 2018.[45] The couple's son was born in April 2018.[46]\n\nOn May 19, 2018, John and Caitlin Stamos announced their new jewelry line, \"St. Amos Jewelry\" with 100% of the proceeds going to the Childhelp foundation.[47]\n\nFilmography [ edit ]\n\nTelevision [ edit ]\n\nFilm [ edit ]\n\nAwards and nominations [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/2/2f/John_Stamos_at_PaleyFest_2013.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/John_Stamos_%281990%29.jpg/170px-John_Stamos_%281990%29.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/JohnStamosHWoFFeb2012.jpg/220px-JohnStamosHWoFFeb2012.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/John_Stamos_at_PaleyFest_2013.jpg/220px-John_Stamos_at_PaleyFest_2013.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/John_Stamos_by_Peter_Chiapperino.jpg/220px-John_Stamos_by_Peter_Chiapperino.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/2/2f/John_Stamos_at_PaleyFest_2013.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/John_Stamos", "title": "John Stamos", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/2/2f/John_Stamos_at_PaleyFest_2013.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}