{"url": "www.thecut.com/2018/02/jennifer-aniston-justin-theroux-break-up-gossip.html", "text": "Justin Theroux and Jennifer Aniston. Photo: Getty Images\n\nWelcome to You Know What I Heard, the Cut’s weekly celebrity gossip column about the peregrinations of the rich and famous. Have gossip? Email me at allie.jones@nymag.com, send me a message on Twitter, or contact me on Signal (ask for the number).\n\nWhen Jennifer Aniston and Justin Theroux announced their breakup last Thursday evening, they did so with a joint statement issued by Aniston’s longtime publicist, Stephen Huvane. It had Jen written all over it: The statement called out the malicious “gossip industry” and insisted that “whatever else is printed about us that is not directly from us, is someone else’s fictional narrative.”\n\nSince Thursday, a lot has been printed about the split, and a lot of it seems to be coming from Theroux’s friends. So who’s really running this breakup?\n\nSources close to Theroux in New York have been telling “Page Six” that Theroux was “really bored by [Aniston’s] whole Hollywood crowd” and that he “initiated” the separation. Unfortunately for Aniston, Official Hollywood Bible People has more or less backed up those “Page Six” reports, citing sources who say that Theroux was done with the marriage and wanted to take the breakup public ASAP.\n\nIn one report, published Sunday, a source close to Aniston told People that “Jen didn’t want to announce [the split] for as long as possible, because she wanted to avoid the media attention.” But Theroux didn’t play ball. Instead, he walked around getting photographed in New York throughout Aniston’s birthday weekend, while Aniston celebrated at home with girlfriends in L.A. (We definitely noticed that last week.)\n\n“Jen hoped that Justin would be low-key on her birthday so people weren’t wondering why he wasn’t with her, but that’s not Justin’s style,” People’s source said. “He wanted to make the announcement so he can live his life.” Theroux apparently flew to L.A. to talk to Aniston three days after her birthday (on Valentine’s Day!), and Aniston agreed to release a statement the next day.\n\nSo: Theroux initiated the breakup and took it public before Aniston was ready because … why? What life does he want to live? The Sun reported this weekend that one source of contention in his marriage to Aniston was his desire to “party” with the “New York art scene.” Specifically, Sun sources claimed that Aniston was upset over Theroux’s desire to hang out with 25-year-old photographer and “art beauty” Petra Collins.\n\nThe Sun tends to be more accurate when reporting on British stars (like Taylor Swift’s boyfriends), so who knows where its reporters are getting this information, but Theroux and Collins do know each other. Collins shot Theroux for a spread in L’uomo Vogue last year. The shoot took place at Paul’s Baby Grand in Tribeca; you can see it on Collins’s website.\n\nHypothetically, what would a Collins-Theroux romance mean for gossip? Collins isn’t just an indie darling; she’s also a collaborator and close friend of Selena Gomez. Gomez has publicly gushed, many times, about how much she loves Aniston. (They met a few years ago through their management.) Will Gomez have to pick a side?\n\nSelena Gomez and Jennifer Aniston. Photo: Ari Perilstein/Getty Images for Cinelou\n\nAnother curious element in all of this: Aniston and Theroux may not be legally married at all. Though they had a surprise wedding in the back yard of Aniston’s Bel Air mansion in 2015, TMZ reported this weekend that the couple never filed for a marriage license, confidentially or otherwise, in L.A. County. And neither Aniston nor Theroux has hired a divorce lawyer.\n\nTheroux’s friends may be talking to the tabloids, but Theroux himself is not ready to address the rumors: He backed out of a scheduled appearance on The Late Show With Stephen Colbert tonight.\n\nSelena Gomez, meanwhile, is reportedly in Jamaica with Justin Bieber for Bieber’s dad’s wedding. Jeremy Bieber, 42, is marrying his “longtime girlfriend” Chelsey Rebelo, 29. Here’s a photo of Gomez posing with some of Rebelo’s friends and relatives:\n\nSo Gomez and Bieber are going strong, despite her family’s disapproval. According to People, the on-again couple spent Valentine’s Day with a visit to Hillsong and a makeout at the Montage in Beverly Hills.\n\nWe haven’t heard much from Ben Affleck and his SNL-producer girlfriend Lindsay Shookus so far this year, but you’ll be happy to know they are still together and still color-coordinating their outfits.\n\nBen Affleck and Lindsay Shookus. Photo: SOVE, GICE/Stoianov/Max - Lopes/Geva / BACK\n\nAccording to E! News, the couple spent Valentine’s Day house-hunting in L.A. “They visited two homes in the $8 million–$10 million range with a broker who gave them tours,” a source told the site. Those homes were in the tony neighborhood of Pacific Palisades, where Affleck’s ex-wife Jennifer Garner lives with their three kids. The house tours were very romantic, apparently.\n\n“While Ben and Lindsay were waiting for the first house to be opened, Ben grabbed Lindsay on the doorstep and pulled her in close for a hug,” E!’s source said. “They were swaying back and forth hugging and laughing. He kissed her on the forehead. He walked with his arm around her and put his hand on her lower back. They seemed very happy and close.”\n\nShookus can’t be planning to move to L.A. full-time, though, can she? Her daughter and ex-husband live in New York. And she has SNL. Currently, she’s living in Affleck’s $28,000-a-month rental on the Upper West Side.\n\nOne small blessing from this week:\n\nHere is a photo of Rooney Mara and her boyfriend Joaquin Phoenix going to a mall in Sherman Oaks.\n\nJoaquin Phoenix and Rooney Mara. Photo: GEDU, SALA/Terma / SL / BACKGRID\n\nJennifer Lawrence. Photo: Tristan Fewings/Getty Images\n\nFinally, I’ll leave you with this TimesTalk Jennifer Lawrence did last week to promote her new spy thriller Red Sparrow. During the talk, she said she’d like to use her character’s skills to figure out “what’s going on with Karlie Kloss and Taylor Swift.”\n\n“That’s the God’s honest truth,” she added. “[It’s] keeping me up at night.”\n\nLove or hate J.Law, she is a great gossip. Most celebrities pretend not to pay attention to the tabloids, but she regularly brings up feuds and rumors in public conversations. (See this appearance on Andy Cohen’s Watch What Happens Live! or her interview with Kim Kardashian West on Jimmy Kimmel’s show.) I, too, would love to know why Kloss and Swift broke up. This past weekend, Kloss attended the NBA All-Star Game with her boyfriend Josh Kushner. Before that, she was spotted hanging out with sworn-Swift-enemy Katy Perry. Swift has been hanging out with herself. Will J.Law’s comment prompt Swift to make a statement?\n\nThanks so much for gossiping this week. Don’t forget to email me at allie.jones@nymag.com, send me a message on Twitter, or contact me on Signal, if you’d like to chat.", "images": ["https://pixel.nymag.com/imgs/fashion/daily/2018/02/20/gossip/Ben-Affleck-Lindsay-Shookus.nocrop.w710.h2147483647.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/02/20/gossip/Jennifer-Lawrence.w245.h368.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/02/20/gossip/20-gossip.w1200.h630.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/02/20/gossip/20-gossip.w700.h700.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/02/20/gossip/Rooney-Mara-Joaquin-Phoenix.nocrop.w710.h2147483647.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/02/20/gossip/Selena-Gomez-Jennifer-Aniston.nocrop.w710.h2147483647.jpg"], "top_img": "https://pixel.nymag.com/imgs/fashion/daily/2018/02/20/gossip/20-gossip.w1200.h630.jpg", "keywords": [], "authors": ["Allie Jones"], "canonical_link": "https://www.thecut.com/2018/02/jennifer-aniston-justin-theroux-break-up-gossip.html", "title": "Why Did Jennifer Aniston and Justin Theroux Break Up?", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Why Did Jennifer Aniston and Justin Theroux Break Up?", "url": "https://www.thecut.com/2018/02/jennifer-aniston-justin-theroux-break-up-gossip.html", "description": "And more pressing questions in this week’s celebrity gossip column.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/02/20/gossip/20-gossip.w1200.h630.jpg", "site_name": "The Cut", "type": "article"}, "twitter": {"title": "Why Did Jennifer Aniston and Justin Theroux Break Up?", "description": "And more pressing questions in this week’s celebrity gossip column.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/02/20/gossip/20-gossip.w600.h315.2x.jpg", "card": "summary_large_image", "creator": "@allierileyjones", "site": "@TheCut"}, "article": {"published_time": "2018-02-20T11:40:47.402-05:00", "tag": "you know what i heard, celebrity, culture, jennifer aniston, justin theroux, petra collins, selena gomez", "publisher": "https://www.facebook.com/cut"}, "description": "And more pressing questions in this week’s celebrity gossip column.", "sailthru.tags": "you know what i heard, celebrity, culture, jennifer aniston, justin theroux, petra collins, selena gomez", "author": "Allie Jones", "fb": {"app_id": 343556435754245}, "type": "Article", "vertical": "The Cut", "apple-mobile-web-app-title": "The Cut", "application-name": "The Cut", "msapplication-TileColor": "#ff5656", "msapplication-TileImage": "https://assets.nymag.com/media/sites/thecut/icon.144x144.png"}, "movies": [], "publish_date": 1519144847.402, "source": "http://www.thecut.com", "summary": ""}