{"url": "https://www.elitedaily.com/p/jennette-mccurdys-comments-on-ariana-grande-pete-davidson-will-make-your-head-spin-9411126", "text": "It’s been nearly four years since Ariana Grande appeared on the short-lived Nickelodeon series Sam & Cat. But that’s not stopping her former co-stars from weighing in on her current relationship status. Jennette McCurdy is one such co-star. In a recent red carpet interview, the actress offered some insight into Grande's relationship amid news that she was reportedly engaged. Actually, Jennette McCurdy’s comments on Ariana Grande and Pete Davidson are really sweet and offer a glimpse into what Grande typically goes for in a guy.\n\nWhen asked by Entertainment Tonight correspondent Katie Krause what she’d heard about the engagement, McCurdy expressed her excitement for her friend and former co-star:\n\nI'm super proud of her and excited for her. I hope that she's super happy.\n\nMcCurdy was in Los Angeles attending a red carpet event for the premiere of the comedy Damsel when ET caught up with her.\n\nWhen Krause asked her what she thought of Grande and Davidson’s swift union and subsequent engagement, the actress had nothing but great things to say. In fact, she thinks they’re a really good match for each other:\n\nThey seem like they're a great fit. From what I know of her, he seems like exactly a good person for her.\n\nKevork Djansezian/Getty Images Entertainment/Getty Images\n\nKrause also took the opportunity to ask McCurdy what Grande finds appealing in a guy and whether Davidson fits the mold. Here’s what McCurdy had to say:\n\nTattoos! She always likes the tattoos. And humor, of course.\n\nSo, it sounds like Davidson is, in fact, Grande’s type. That isn’t surprising considering how quickly these two moved from friends to romantic partners.\n\nWhile many were baffled at the relationship between Grande and Davidson at first, the couple has done everything in their power to make the world take them seriously. They even got engaged... just a month after announcing their relationship in the first place! That’s wild, right? At least it is if the reports are true. Elite Daily reached out to Grande and Davidson's teams for comment on the engagement reports, but did not hear back by the time of publication.\n\nFrom the word go, Grande and Davidson were moving their relationship at a really rapid pace. For instance, Davidson reportedly got two tattoos in honor of his lady love — her iconic Dangerous Woman-era bunny ears and her initials.\n\nThen, on Monday, June 11, it was reported that Grande and Davidson were engaged. According to a new report from E!, Davidson apparently bought Grande’s engagement ring in May. So, Davidson was thinking long-term romance just a few weeks into the relationship.\n\nE!’s report also included some bits of info from the jeweler who reportedly made Pete Grande’s rumored engagement ring, Greg Yuna. Here’s what Yuna said about Davidson’s $93,000 purchase:\n\nPete called me at the end of May and said 'Look, I'm getting a ring. This is what I want.' And I told him that I had the right ring for him. He didn't tell me who it was for but told me to keep it a secret. He didn't tell me anything about it.\n\nIn a recent report from Us Weekly, an insider source revealed that Grande and Davidson were head over heels for each other:\n\nThey are both constantly making each other laugh. Their moms have met. They’ve been very public with their relationship on social media, and they are very in love.\n\nAfter their engagement was announced, Grande and Davidson headed out to Disneyland to celebrate. On Tuesday, June 12, E! shared an eyewitness account of the two at the park:\n\nAriana and Pete were in the front row and he got out first and then turned to her and held out his hand to help her up. A few people yelled ‘Ariana' from the line and she turned and smiled at them and waved. She looked very happy. Then they all walked out and Ariana and Pete were holding hands.\n\nIt certainly sounds like Grande and Davidson are a great match. They seem supremely happy together, which is all that matters.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2018/6/14/857c9abc-ebdb-40bf-b8cc-f59b59a858fb-getty-184209440.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/6/14/857c9abc-ebdb-40bf-b8cc-f59b59a858fb-getty-184209440.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/16/555700cf-c269-4ba5-9ad4-004df0469bc7-getty-1170538224.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.elitedaily.com/uploads/getty/2018/6/14/53991386-f001-4748-b9a1-1cf64d6dd358-getty-164460337.jpg?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/17/ca574bac-e603-453a-a0e1-d65cafea57b6-getty-919969056.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/17/666f5461-db31-459c-a8d4-d226e5d4ef9b-getty-884987858.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/6/14/857c9abc-ebdb-40bf-b8cc-f59b59a858fb-getty-184209440.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/jennette-mccurdys-comments-on-ariana-grande-pete-davidson-will-make-your-head-spin-9411126", "title": "Jennette McCurdy's Comments On Ariana Grande & Pete Davidson Will Make Your Head Spin", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/jennette-mccurdys-comments-on-ariana-grande-pete-davidson-will-make-your-head-spin-9411126", "type": "article", "title": "Ariana Grande’s Old Co-Star Had A Lot To Say About Her Relationship With Pete Davidson", "description": "It’s been nearly four years since Ariana Grande appeared on the short-lived Nickelodeon series Sam & Cat. But that’s not stopping her former co-stars from weighing in on her current relationship status. Jennette McCurdy is one such co-star. In a…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/6/14/857c9abc-ebdb-40bf-b8cc-f59b59a858fb-getty-184209440.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "It’s been nearly four years since Ariana Grande appeared on the short-lived Nickelodeon series Sam & Cat. But that’s not stopping her former co-stars from weighing in on her current relationship status. Jennette McCurdy is one such co-star. In a…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}