{"url": "https://www.huffingtonpost.com/entry/penn-badgley-you-lifetime-interview_us_5b91a817e4b0511db3e0a95e", "text": "A beautiful young woman walks into an indie bookstore and meets the eyes of the handsome store manager. He’s not hot, but cute, with unassuming mannerisms and a subtly winning smile. The pair banter about books flirtatiously, and it’s clear that there’s an instant attraction, a *spark* if you will. The woman reaches up to grab a book off the top shelf, and the man scans her up and down.\n\n“If this was a movie, I’d grab you and we’d go at it right in the stacks,” he says in a voiceover, invoking visions of spontaneous passion that should be familiar to anyone who’s spent time watching romance films.\n\nBut it isn’t a movie. And it’s not quite a romance, either ― at least not one to be desired. It’s the pilot episode of “You,” the latest of Lifetime’s forays into scripted television.\n\n“You,” based on the novel of the same name, follows Joe Goldberg (Badgley), the charming bookstore manager, and his increasingly terrifying obsession with Guinevere Beck (Elizabeth Lail), a grad student and writer onto whom Joe projects all of his fantasies and expectations.\n\nIn the midst of the Me Too movement, it might sound dicey, unnecessary and even counterproductive to put a charming white dude stalker front and center on television. And yet “You” manages to be sharp and self-aware, skewering the very tropes you might expect to weigh it down. Much of this responsibility falls on the writing and on Badgley, who as Joe is left to narrate much of the first five episodes with his inner monologue.\n\nThe last time you saw Badgley on your television screen, it was most likely as Dan Humphrey, the moody outcast turned insider on teen juggernaut “Gossip Girl” (2007-2012). At the end of the series’ run, it was revealed (in a messy retconned twist) that Dan had been the titular Gossip Girl all along.\n\nAt first glance, beyond their stated bookishness, heartthrob Dan and predator Joe don’t seem all that similar. But then you start talking to Badgley and the similarities become clearer. As Badgley pointed out to me over the phone, “If any real person actually did the things that Gossip Girl did, is that person, no matter who they are, a sociopath? Aren’t they manipulative? Aren’t they abusive?”\n\nAnd these sorts of observations are what make chatting with Badgley so much fun. He’s a seasoned pro at doing press ― he came of age in the public eye, after all ― which means that he could come off as rehearsed, so media-trained as to be boring. But instead Badgley is contemplative, not only answering questions but also asking them. We talked about everything from romantic comedy conventions to the format of this interview. And really, what’s more Dan Humphrey than that?\n\nSo, I’ve seen the first five episodes of “You,” and they are any dating woman’s greatest nightmare realized.\n\nYes. Definitely.\n\nYou play Joe, the very charming stalker at the center of this show. I’m curious what initially drew you to the role?\n\nI was drawn to the project through the conversations I had with [“You” co-creators] Greg Berlanti and Sera Gamble. After I read the book, I could really admire the effect that Caroline [Kepnes’] writing has on the reader. But [Joe is] not the sort of person that you want to live with day in, day out. I think I was actually quite cautious [going into the project], and what that has led me to do is learn to trust the other people in the process ― the writers, the actors, the crew ― so I’m less attached to this person, this character. That’s what I like about it now. Initially, I couldn’t see all those things and couldn’t tell exactly why I was compelled by it.\n\nLifetime/AE Elizabeth Lail and Penn Badgley in the pilot episode of \"You.\"\n\nI will say that the writing definitely takes the project beyond what its log line might suggest.\n\nExactly. Right now, we’re doing a lot of press, and this show hasn’t been seen by anybody. So all we’ve got is the log line. And how much can you go beyond the log line before spoiling a lot of what the show is about? I have experienced the show to be infinitely deeper than its teaser, but that’s the medium and you have to work with that in the beginning. I find myself having to say things that are vague. I can’t really speak to all the things that he’s done, so what is it that Joe is? Well, he does things.\n\nWhat was it like to dig into this complex and obviously disturbing character while we’re in the midst of having national conversations about sexual misconduct and abuse and harassment?\n\nI am grateful to the moment and that [the show] is coming out now. I think it would be bad if this show were to come out and it wasn’t scrutinized and held to the standard that it will be held to now.\n\nIt’s interesting. [“You”] is a show that is ultimately about a man. I mean it is about an obsession and it is about a subject, and it very much depends on this female character, this woman [Beck], but it is a show about a man. And... we’re a part of it and we’re trying to understand what that means now. I think what this show needs is for people to see it ― that’s the thing that closes the loop. Right now it’s an open-ended question.\n\nI’m sure you have heard these comparisons, but is Joe the logical conclusion of Dan Humphrey, whom you played on “Gossip Girl”? Like… is Joe Dan Humphrey with a touch more sociopath?\n\nWell, the question is, if any real person actually did the things that Gossip Girl did, is that person, no matter who they are, a sociopath? Aren’t they manipulative? Aren’t they abusive?\n\nAnd then, if we follow that logic, how often is it that an [online] troll says something that, if it was enacted, would actually be murder? People speak so casually about wanting to kill other people online. So, in a way, Joe ― I am not trying to defend anyone’s behavior, least of all Joe’s ― but I think what I am troubled by and interested in, which this show is dealing with, is [the question of whether Joe’s behavior] is an inappropriate following of logic that is set up by our culture. And, in certain ways, it is. Of course, this does not mean that his behavior is right, but it also means that a lot of our cultural norms are wrong.\n\nI was going to ask you about that. “You” is a show that explores the way that we very casually put so much personal information out into the world, and how that information can be used or manipulated against us. Do you see the show as sort of a cautionary tale about social media?\n\nPeople might take that from it. The social media dimension is not one that I am as compelled by, personally. But I know that everybody sees this, [and] they’re like, “Wow, it made me rethink that.” I am thinking more [about the show’s exploration of] gender dynamics, the cultural definition of love and relationships. What is appropriate and what is not. What is intimate, and what is not. What is humane, and what is not. And, yes, the social media thing confuses us all, honestly. So [“You”] does shine a light on how it can be abused ― as though we weren’t aware of the end to which social media is being abused. It’s pretty evident.\n\nI am also curious ― you grew up in the public eye because of “Gossip Girl.” You and I are the same age, and I just think about if people had been paying attention to my every move in 2007/2008, that would have been really rough.\n\nYeah, that was [pauses] ― you’re right.\n\nDid that experience impact the way you read the “You” script at all?\n\nProbably. But in ways that I am not so conscious of. It affects everything about the way that I think. I actually became grateful to all that because I learned very early on how merciless and manipulative [public attention] can be.\n\nYou know, even an interviewer trying to communicate something that you’ve communicated responsibly, it might get lost in translation. And then the person who reads it is a third level of translation. In the way that reflects on social media, I think I had to develop the discipline to not use it as a way to think that I can know or understand any person. I do not value it as a window into anything real. For better or worse ― I’m not saying that’s a good thing, I’m just saying I think it’s the way that I see it. I just don’t see [social media] as valuable, because I have been up close and personal with how... it’s just untrue. It’s literally not a reflection of reality. So why would I try to find out something about someone in this way when I know that if anybody tried to do the same to me, they would literally actually be getting further from understanding who I am?\n\nWould anyone else be considered unassuming on the side of the street standing there too long? It’s pretty evident that no one but a young handsome white man could do that. Penn Badgley on his character, Joe Goldberg, in \"You\"\n\nSomething I was really struck by in the pilot is when Joe has broken into Beck’s house, and she comes home early, so he ends up hiding in her shower. We hear Joe say through his inner monologue, “I’m not worried. I’ve seen enough romantic comedies to know that guys like me are always getting in jams like this.” Is “You” intentionally playing with the more problematic tropes of rom-coms?\n\nThat’s exactly what it’s doing. That’s what we were talking about before, which is that [“You”] is examining and scrutinizing the definitions [of love and relationships] we have and all of these cultural standards.\n\nLike, [the culture says], “This is what a relationship can look like, this is what love can look like. This is how you should be. This is what it’s cool to do.” And then Joe is like, “Alright, I will do all those things.” And then he’s got blood on his hands and everyone’s like, “What did you do?” And he’s like, “I just did what you did!”\n\nYeah, there was even a study that came out in 2016 that showed that romantic movies literally perpetuate stalking myths and make it harder to prosecute stalkers. Which is crazy.\n\nThat’s absolutely terrifying. And I mean, who is responsible for romantic comedies? It’s actually a very small group of people.... So I think it’s healthy that we examine these standards and be ready to cast them aside entirely, and be like, “Wait, that’s not humane. That’s not human. That’s not what love is.”… There’s so much about our idea of love that can’t be separated from American consumerism and materialism and white privilege, all of this stuff.\n\nAnd I think that Joe is a great example of that. Would anyone else be considered unassuming on the side of the street standing there too long? It’s pretty evident that no one but a young handsome white man could do that. And there’s a lot of ways in which we don’t examine that. I am ready to have that conversation if anyone else wants to. But again, I think it’s more interesting once everyone has seen the show, and then as the seasons continue. [Editor’s note: “You” has already been renewed for a second season.]\n\nI hope that “You” prompts that conversation! Pop culture is such a great, accessible way to dive into things that people might not feel comfortable talking about otherwise.\n\nRight. Any interview that I am able to do ― if we can’t address these things in a real way, does that mean we should talk about them differently, or does that mean we should augment these spaces so we can have a real conversation regardless of this show?\n\nPut that in print.\n\nConsider it done! Do you have any hope for the future of the romantic leading male character? Is there a way for us to have that conversation we’re discussing, about the negative tropes that have been perpetuated, and then do it differently? I don’t know if you’ve seen Netflix’s “To All the Boys I’ve Loved Before”...\n\nI haven’t, but I have heard good things.\n\nWell, it’s delightful. And it has started an interesting conversation about a different mold of that male romantic lead.\n\nWe all know that tropes exist. But if we start to realize that tropes shape behavior of real human beings, I think we need to question, like, what the fuck are these tropes doing here in the first place? Do we need tropes because it’s what makes advertisers comfortable? If that’s the answer, fuck tropes. Get rid of the tropes if they’re negatively affecting any single human being’s behavior.\n\n[But] no one wants to hear that in an interview that I am in… You know, there’s a lot of dots that we should always be connecting, and if we don’t assume that we have the attention span for it or the patience for it, I don’t know what we’re doing.\n\nDo we need tropes because it’s what makes advertisers comfortable? If that’s the answer, fuck tropes. Penn Badgley\n\nIt’s certainly easy as interviewer and interviewee to fall into a trap of “this is what is supposed to come out of this,” where we both go into the interview agreeing on the terms.\n\nI’ve been thinking about this a lot coming up to this press because the interview isn’t even necessarily designed as a way to have a conversation. You have to ask questions, and I have to answer them. Maybe that should change. A conversation has to go two ways, and people have to be willing to listen. And I think the problem with a lot of, let’s say, men out there, actors, famous men ― particularly famous white men ― is that their entire livelihood is them talking ad nauseum. I’m guilty of it, too. It’s just the way things are designed. And so you might try to undo that. But then you don’t get support.\n\nThis is where maybe I have some empathy for Joe. He has no support to try and change. He clearly did not have it before we met him. [Editor’s note: The first five episodes of “You” include some flashbacks to Joe’s childhood.] He had to grow up on his own, and he came to some really bad conclusions, and no one was there to be like, “Hey, man, that’s wrong.”\n\nI think as a culture we have a tendency to look at men who do things ― maybe not as extreme as Joe, but things on that continuum of sexual abuse and harassment and violence ― as monsters that are separate from us. But what’s so interesting about Joe is that he has humanity, and so you can’t just think of him as something less than human. He is, for better or worse, one of us.\n\nYou know, that’s really interesting. I personally believe that one of the struggles we have these days is the second someone does something that we believe is truly wrong, we do write them off as kind of evil or inhuman, which separates them from us.… No one is an island. How are they supported in reaching these conclusions? How are they supported in continuing to behave in a certain way? ... To me, this idea of [shared] humanity is a really important one.\n\nIn the beginning, I was not interested in making Joe human. I was like, “This dude’s a murderer. I don’t think we need to be humanizing murderers anymore.” But then I realized maybe this is the most responsible thing to do. Because if we can’t turn away from Joe’s humanity, then we have to accept how we’ve somehow also been supportive and complicit in allowing Joe to reach the conclusions he’s reached [about love]. We can’t just point the finger and call people evil. It’s not helpful. It’s not helpful because it actually is our reality. We need to be recognizing people’s humanity rather than building walls. There it is, there’s the sound byte. [Laughs.]\n\nWhat do you hope viewers take away from the show once they do see it?\n\nLet’s say, theoretically, this show isn’t any good. If people are able to have conversations like this around it, that’s good. Is my acting great? Is the show well written? Sure, at points it is, and at points I’m sure we were inconsistent, because it’s like 10 hours of material. It’s really hard to be consistent with 10 hours of material. You turn that into movies and that’s like 10 years of a person’s career.\n\nSo, you know, I just think it’s great that we can be considering these [big ideas]. We have a space and a time to do it. Even though I know so much of it doesn’t fit into, like, the thing you’re going to have to write, to me there is a space and a time for it. And that’s where social media helps us. We just have to use it better.\n\nCORRECTION: A previous version of this story included the phrases “out the nozzle” and “development discipline.” It has been updated to reflect that Badgley said “ad nauseum” and “developed the discipline.”", "images": ["https://img.huffingtonpost.com/asset/5b8ed05c200000430034bed2.jpeg?cache=tnzqwgv7o7&ops=scalefit_970_noupscale", "https://www.facebook.com/tr?id=10153394098876130&ev=PageView&noscript=1", "https://s.m.huffpost.com/assets/H-icon-72fd5782b36a1a42ab82a4af65cbc6dd6ddc4d4a71190a91c5cfaab7c66fd836.svg", "https://img.huffingtonpost.com/asset/5d88f91b2100003200dab6d8.png", "https://sb.scorecardresearch.com/p?c1=2&c2=6723616&c3=&c4=&c5=&c6=&c15=&cj=1", "https://img.huffingtonpost.com/asset/5b8ed05c200000430034bed2.jpeg?cache=tnzqwgv7o7&ops=1778_1000", "https://img.huffingtonpost.com/asset/5b92effd2000002d0034c3fb.jpeg?ops=scalefit_970_noupscale", "https://s.m.huffpost.com/assets/HuffPostHero-d783f680fb974e80346bdfa145131d058e596e1d32f791981875aa481702c770.svg", "https://img.huffingtonpost.com/asset/5cacf4f424000030074f66b5.jpg?ops=100_100", "https://www.facebook.com/tr?id=1621685564716533&ev=PageView&noscript=1"], "top_img": "https://img.huffingtonpost.com/asset/5b8ed05c200000430034bed2.jpeg?cache=tnzqwgv7o7&ops=1778_1000", "keywords": [], "authors": ["Senior Women'S Reporter"], "canonical_link": "https://www.huffpost.com/entry/penn-badgley-you-lifetime-interview_n_5b91a817e4b0511db3e0a95e", "title": "Penn Badgley Gets Meta About His Return To TV As A Very Charming Stalker", "meta_data": {"google-site-verification": "97Mj-wW7u8U1NOnkW1rfH-I1kgO0-a9YsgoesOk41R8", "oath": {"guce": {"product-eu": "false", "consent-host": "guce.huffpost.com", "locale": "en-US", "inline-consent": "true"}}, "fb": {"pages": 70242384902, "app_id": 46744042133}, "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "description": "Also, he's pretty sure that Gossip Girl was a sociopath.", "keywords": "Gossip Girl,TV Series,penn badgley,lifetime tv,You TV series", "og": {"title": "Penn Badgley Gets Meta About His Return To TV As A Very Charming Stalker", "type": "article", "image": {"identifier": "https://img.huffingtonpost.com/asset/5b8ed05c200000430034bed2.jpeg?cache=tnzqwgv7o7&ops=1778_1000", "url": "https://img.huffingtonpost.com/asset/5b8ed05c200000430034bed2.jpeg?cache=tnzqwgv7o7&ops=1778_1000", "type": "image/jpeg", "width": 1778, "height": 1000}, "url": "https://www.huffpost.com/entry/penn-badgley-you-lifetime-interview_n_5b91a817e4b0511db3e0a95e", "site_name": "HuffPost", "locale": "en_US", "description": "Also, he's pretty sure that Gossip Girl was a sociopath."}, "article": {"tag": "Gossip Girl,TV Series,penn badgley,lifetime tv,You TV series", "section": "Entertainment", "author": "https://www.facebook.com/emma.rose.gray.1", "published_time": "2018-09-08 08:00:09 -0400", "modified_time": "2018-09-13 10:06:36 -0400"}, "twitter": {"card": "summary_large_image", "site": "@HuffPostEnt", "title": "Penn Badgley Gets Meta About His Return To TV As A Very Charming Stalker", "image": {"identifier": "https://img.huffingtonpost.com/asset/5b8ed05c200000430034bed2.jpeg?cache=tnzqwgv7o7&ops=1778_1000", "width": 1778, "height": 1000}, "description": "Also, he's pretty sure that Gossip Girl was a sociopath.", "creator": "emmaladyrose"}, "al": {"ios": {"url": "huffpostnews:///?editionID=us&entryID=us_5b91a817e4b0511db3e0a95e", "app_store_id": 306621789, "app_name": "HuffPost"}}, "taboola.category": "entertainment"}, "movies": [], "publish_date": 1536408009.0, "source": "https://www.huffingtonpost.com", "summary": ""}