{"url": "https://tvline.com/2018/12/07/crazy-ex-girlfriend-recap-season-4-episode-8-greg-skylar-astin/", "text": "Warning: The following post contains spoilers for Friday’s Crazy Ex-Girlfriend.\n\nOh hi, Greg! Wait… that‘s Greg?\n\nFriday’s Crazy Ex-Girlfriend fall finale brought back Rebecca’s former flame Greg for the first time since Season 2 — but now he’s played by Pitch Perfect star Skylar Astin, who steps in for original cast member Santino Fontana. In true Crazy Ex fashion, the episode leaned into the absurdity of it all, with Rebecca not recognizing Greg at first, making the recast a statement on how radically our perceptions of people can change over time. (He’s not even the same person!)\n\nRebecca and Greg started fresh with a get-to-know-you duet — “Hello, nice to meet you/You’ve been inside of me,” she sang — and even after she confessed to sleeping with Greg’s dad, the two didn’t totally shut the door on a possible rekindling. With yet another love interest now in Rebecca’s orbit, TVLine reached out to showrunner Aline Brosh McKenna to get the scoop on the big Greg recasting, what his return means for Rebecca’s already complicated love life — and what we can expect to see in the back half of the final season.\n\nTVLINE | We haven’t seen Greg since way back in Season 2. When did you first decide he had to come back, in some form?\n\nWell, we had always thought their love relationship would die somewhere during Season 2, but we were going to continue his journey towards figuring out that he was an alcoholic, and towards sobriety. We probably would’ve taken all of Season 2 to do that. Much like Josh and Nathaniel, their stories don’t end when they’re not sleeping with Rebecca. So we had a bunch of stuff we wanted to do with Greg, and then Santino needed to move back to New York, so we accelerated all of that storyline at the beginning of Season 2 and wrapped it up. But we had always wanted to continue telling his story, and their story, and so when we were [writing] this season, we thought, “We could…”\n\nWe didn’t want to do it just to recast. We felt like we had an opportunity to do something different, and do it the way that works for our show. So the idea is that it’s a first-person show: It’s all very much filtered through her perception. So she perceives him as different — first of all, because when you see an ex you haven’t seen for two years, they invariably look and feel very different, but also because he’s changed a lot, and he’s evolved a lot, and he is a different sort of person, in a way. Then what you find out at the end of the episode is that they’ve both changed, and that’s why he seems so different to her. It’s as much the fact that she’s changed as the fact that he’s changed.\n\nTVLINE | Do you feel like Skylar Astin brings a different energy to the role than Santino did? Or is it still like writing for the same character?\n\nOh, I think he brings a different energy to the role, but that’s also because the character’s a different guy. He’s been in recovery for two years, he’s been going to weekly meetings, he’s heard a lot of stories that are way worse than his. I think it’s expanded his humanity, so we’re writing him differently. And the way we’re writing him suits Skylar very well, because I think he exudes an evolved intelligence and a warmth that Greg presumably developed when he was in Atlanta. That’s not to say that Santino couldn’t have played it as well, but Skylar does bring a nice quality to the role and a wonderful connection to Rachel. He just fit in with the group here like crazy. It’s pretty amazing. To come into a show so late, and two seconds later, you’re playing paintball with the cast… [Laughs]\n\nTVLINE | Did you actually reach out to Santino? I know he’s busy playing Tootsie, but…\n\nWe didn’t reach out to him to play the part, because the whole idea was that it would be played by a different actor. That’s what was exciting to us. But we didn’t want him to be surprised, so the first thing we did was to let him know we’d be recasting the role. And he and Skylar are friends. They did a show together, so that’s nice.\n\nTVLINE | Greg has changed a lot, and not just physically: He’s more centered, he’s less self-destructive. So has he gone through a lot of the same hard psychological work that Rebecca has?\n\nExactly. I think someone who’s been in recovery for two years and somebody who’s been in a pretty intense mental health program for a year have a lot more to talk about than they did the last time they saw each other. Their relationship was characterized by a slight judgment of her by him, always. There was always a slightly neggy energy coming from him towards her, and I think that’s something they now both understand came from an unhealthy impulse on her part, and came from a self-hatred on his part. So they’re actually able to redress some of these issues.\n\nTVLINE | Rebecca came clean and admitted that she slept with Greg’s dad, and he was stunned, understandably. But he did appreciate her honesty, too. Is that a sign that maybe he can accept her as she is, flaws and all?\n\nWell, again, he’s been in meetings where people have talked about doing all kinds of crazy stuff. So I think he has expanded his humanity somewhat, and he recognizes the change in her. She’s somebody who would never have admitted to that before. She was always someone who would’ve tried to get away with it. There’s no reason that she had to be the one to tell him. He was going to find out two seconds later. So he recognizes the courage in that, even though, obviously, it’s rather repellent to him, and quite upsetting.\n\nTVLINE | We’ve done “The Math of Love Triangles” before, so is Rebecca now in a love rectangle?\n\nShe is in some sort of love quadrangle, yeah.\n\nTVLINE | Do you see these three guys appealing to different aspects of her?\n\nOh, definitely. We’ve consciously tried to explore the different tropes of men in romantic comedies, so in the way that she is somewhat adhering to the stereotype of a crazy ex-girlfriend, we have high school hero Josh Chan, rich a–hole Nathaniel Plimpton and snarky best friend Greg. They’re all things that she’s attracted to, and they all have something about them she really loves and admires. But she’s still figuring herself out. She’s really trying to figure out who she is, and what her place is in the world.\n\nTVLINE | Yeah, Rebecca even mentioned that this week: Does she even need to end up with anyone?\n\nYeah, does she need to be with anyone? What’s the role of love in her life? How important is it to her? Are any of these guys suitable for that? Is she ready to be in a relationship with anybody? Love is her drug of choice, and unlike booze and drugs, she can’t just put it down and walk away from it completely. That’s something that Dr. Akopian said to her last year: You need and deserve love. So for her, the challenge is: How is she ever going to dip her toe in that with anybody, without getting swamped and overwhelmed and going down a rabbit hole?\n\nTVLINE | We’re entering the homestretch here, the back half of the final season. What can you tell us about what’s coming up?\n\nWe come back with an episode that is just completely bonkers. It’s one of the silliest ones we’ve ever done. We really enjoyed making it. And we continue to explore these relationships, and where Rebecca’s going in her life. She’s landing the plane now. She’s trying to make some decisions based on the things she’s learned about herself. We gave her a lot of real estate after her suicide attempt, both by doing an eight-month jump, and then also this season, she hasn’t really been involved with anybody romantically. She’s been going down the list of unresolved relationships, and obviously, this relationship with Greg is one of the most unresolved. So there’s a chance to go back to that with the tools that she’s learned, and with a year under her belt since the [suicide attempt].\n\nTVLINE | And is the series finale really set on Valentine’s Day, like Greg said this week?\n\nI mean… that’s the end of the series of holidays, isn’t it?\n\nCrazy Ex fans, let’s talk: Drop your thoughts on New Greg, and Season 4 so far, in the comments below.", "images": ["https://pmctvline2.files.wordpress.com/2018/12/crazy-ex-girlfriend-season-4-episode-8-rebecca-greg.jpg?w=300&h=203", "https://s2.wp.com/wp-content/themes/vip/pmc-tvline-2014/library/images/follow_us_on_facebook_graphic.png", "https://pmctvline2.files.wordpress.com/2019/06/lucifer-season-4-episode-4.jpg?w=620", "https://pmctvline2.files.wordpress.com/2020/04/too-hot-to-handle-finale.jpg?w=620", "https://pmcspy.files.wordpress.com/2020/04/best-hangboards.jpg?resize=180%2C101", "https://pmctvline2.files.wordpress.com/2018/12/crazy-ex-girlfriend-season-4-episode-8-rebecca.jpg?w=300&h=203", "https://i0.wp.com/www.goldderby.com/wp-content/uploads/2017/11/top-chef-season-15-contestants-hosts-Tom-Colicchio.jpg?resize=180%2C101&ssl=1", "https://pmchollywoodlife.files.wordpress.com/2020/04/alia-shawkat-leaves-brad-pitts-house-backgrid-ftr.jpg?resize=180%2C101", "https://pmctvline2.files.wordpress.com/2018/12/crazy-ex-girlfriend-season-4-episode-8-greg-rebecca.jpg?w=620", "https://boygeniusreport.files.wordpress.com/2020/04/webp.net-resizeimage-1-10.jpg?quality=98&strip=all&resize=180%2C101", "https://pmctvline2.files.wordpress.com/2020/04/swat-season-3-finale-schedule.jpg?w=620", "https://pmctvline2.files.wordpress.com/2018/12/crazy-ex-girlfriend-season-4-greg-skylar-astin.jpg?w=200&h=300", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=tvline.com&path=%2F2018%2F12%2F07%2Fcrazy-ex-girlfriend-recap-season-4-episode-8-greg-skylar-astin%2F&ct=article&lob=tvline&loc=us&env=desktop&post_id=1009303&comment_count=22", "https://pmcdeadline2.files.wordpress.com/2020/04/taylor-swift-performs-at-global-citizens-concert.png?resize=180%2C101", "https://pmctvline2.files.wordpress.com/2018/12/crazy-ex-girlfriend-season-4-episode-8-greg-rebecca.jpg?w=620&h=420&crop=1", "https://secure-us.imrworldwide.com/cgi-bin/m?ci=us-203220h&cg=0&cc=1&ts=noscript", "https://pmctvline2.files.wordpress.com/2020/04/brooklyn-nine-nine-season-7-episode-13-finale-nbc-1.jpg?w=620", "https://pixel.wp.com/b.gif?v=noscript", "https://pmctvline2.files.wordpress.com/2020/04/one-chicago-cast-exits-2.jpg?w=620", "https://pmctvline2.files.wordpress.com/2020/03/dw-2.jpg?w=280"], "top_img": "https://pmctvline2.files.wordpress.com/2018/12/crazy-ex-girlfriend-season-4-episode-8-greg-rebecca.jpg?w=620", "keywords": [], "authors": ["Dave Nemetz"], "canonical_link": "https://tvline.com/2018/12/07/crazy-ex-girlfriend-recap-season-4-episode-8-greg-skylar-astin/", "title": "Crazy Ex-Girlfriend Boss on Recasting Greg, Rebecca's New 'Love Quadrangle'", "meta_data": {"viewport": "width=device-width, initial-scale=1.0 maximum-scale=1, user-scalable=no", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-mobile-web-app-capable": "yes", "p": {"domain_verify": "9ad238c78ee34da2d6d96a41981790d2"}, "description": "\"Crazy Ex-Girlfriend's\" showrunner explains why they recast Greg with Skylar Astin, and what his return means for Rebecca's love life.", "news_keywords": "Crazy Ex-Girlfriend, The CW", "apple-itunes-app": "app-id=1377345661", "generator": "WordPress.com", "og": {"type": "article", "title": "Crazy Ex-Girlfriend Boss on Recasting Greg, Rebecca's New 'Love Quadrangle'", "url": "https://tvline.com/2018/12/07/crazy-ex-girlfriend-recap-season-4-episode-8-greg-skylar-astin/", "description": "Warning: The following post contains spoilers for Friday’s Crazy Ex-Girlfriend. Oh hi, Greg! Wait… that’s Greg?", "site_name": "TVLine", "image": {"identifier": "https://pmctvline2.files.wordpress.com/2018/12/crazy-ex-girlfriend-season-4-episode-8-greg-rebecca.jpg?w=620", "width": 620, "height": 420, "alt": "Crazy Ex-Girlfriend Season 4 Episode 8 Greg Rebecca"}, "locale": "en_US"}, "article": {"published_time": "2018-12-08T03:00:38+00:00", "modified_time": "2018-12-08T03:00:07+00:00"}, "twitter": {"site": "@TVLine", "text": {"title": "<i>Crazy Ex-Girlfriend</i> Boss on Recasting Greg, Rebecca's New 'Love Quadrangle'"}, "image": {"identifier": "https://pmctvline2.files.wordpress.com/2018/12/crazy-ex-girlfriend-season-4-episode-8-greg-rebecca.jpg?w=620", "alt": "Crazy Ex-Girlfriend Season 4 Episode 8 Greg Rebecca"}, "card": "summary_large_image", "creator": "@dave_nemetz", "title": "Crazy Ex-Girlfriend Boss on Recasting Greg, Rebecca's New 'Love Quadrangle'", "description": "\"Crazy Ex-Girlfriend's\" showrunner explains why they recast Greg with Skylar Astin, and what his return means for Rebecca's love life."}, "author": "Dave Nemetz", "content_type": "Article", "post_id": 1009303, "title": "<i>Crazy Ex-Girlfriend</i> Boss on Recasting Greg, Rebecca's New 'Love Quadrangle'", "published_at": "2018-12-07 19:00:38", "image": "https://pmctvline2.files.wordpress.com/2018/12/crazy-ex-girlfriend-season-4-episode-8-greg-rebecca.jpg?w=300&h=208&crop=1", "comment_count": 22, "tags": "The CW", "topics": "Post Mortems", "body": "Warning: The following post contains spoilers for Friday's Crazy Ex-Girlfriend.\r\n\r\nOh hi, Greg! Wait… that's Greg?\r\n\r\nFriday's Crazy Ex-Girlfriend fall finale brought back Rebecca's former flame Greg for the first time since Season 2 — but now he's played by Pitch Perfect star Skylar Astin, who steps in for original cast member Santino Fontana. In true Crazy Ex fashion, the episode leaned into the absurdity of it all, with Rebecca not recognizing Greg at first, making the recast a statement on how radically our perceptions of people can change over time. (He's not even the same person!)\r\n\r\nRebecca and Greg started fresh with a get-to-know-you duet — \"Hello, nice to meet you/You've been inside of me,\" she sang — and even after she confessed to sleeping with Greg's dad, the two didn't totally shut the door on a possible rekindling. With yet another love interest now in Rebecca's orbit, TVLine reached out to showrunner Aline Brosh McKenna to get the scoop on the big Greg recasting, what his return means for Rebecca's already complicated love life — and what we can expect to see in the back half of the final season.\r\n\r\nTVLINE | We haven't seen Greg since way back in Season 2. When did you first decide he had to come back, in some form? \r\nWell, we had always thought their love relationship would die somewhere during Season 2, but we were going to continue his journey towards figuring out that he was an alcoholic, and towards sobriety. We probably would've taken all of Season 2 to do that. Much like Josh and Nathaniel, their stories don't end when they're not sleeping with Rebecca. So we had a bunch of stuff we wanted to do with Greg, and then Santino needed to move back to New York, so we accelerated all of that storyline at the beginning of Season 2 and wrapped it up. But we had always wanted to continue telling his story, and their story, and so when we were [writing] this season, we thought, \"We could...\"\r\n\r\nWe didn't want to do it just to recast. We felt like we had an opportunity to do something different, and do it the way that works for our show. So the idea is that it's a first-person show: It's all very much filtered through her perception. So she perceives him as different — first of all, because when you see an ex you haven't seen for two years, they invariably look and feel very different, but also because he's changed a lot, and he's evolved a lot, and he is a different sort of person, in a way. Then what you find out at the end of the episode is that they've both changed, and that's why he seems so different to her. It's as much the fact that she's changed as the fact that he's changed.\r\n\r\nTVLINE | Do you feel like Skylar Astin brings a different energy to the role than Santino did? Or is it still like writing for the same character?\r\nOh, I think he brings a different energy to the role, but that's also because the character's a different guy. He's been in recovery for two years, he's been going to weekly meetings, he's heard a lot of stories that are way worse than his. I think it's expanded his humanity, so we're writing him differently. And the way we're writing him suits Skylar very well, because I think he exudes an evolved intelligence and a warmth that Greg presumably developed when he was in Atlanta. That's not to say that Santino couldn't have played it as well, but Skylar does bring a nice quality to the role and a wonderful connection to Rachel. He just fit in with the group here like crazy. It's pretty amazing. To come into a show so late, and two seconds later, you're playing paintball with the cast... [Laughs]\r\n\r\nTVLINE | Did you actually reach out to Santino? I know he's busy playing Tootsie, but...\r\nWe didn't reach out to him to play the part, because the whole idea was that it would be played by a different actor. That's what was exciting to us. But we didn't want him to be surprised, so the first thing we did was to let him know we'd be recasting the role. And he and Skylar are friends. They did a show together, so that's nice.\r\n\r\nTVLINE | Greg has changed a lot, and not just physically: He's more centered, he's less self-destructive. So has he gone through a lot of the same hard psychological work that Rebecca has?\r\nExactly. I think someone who's been in recovery for two years and somebody who's been in a pretty intense mental health program for a year have a lot more to talk about than they did the last time they saw each other. Their relationship was characterized by a slight judgment of her by him, always. There was always a slightly neggy energy coming from him towards her, and I think that's something they now both understand came from an unhealthy impulse on her part, and came from a self-hatred on his part. So they're actually able to redress some of these issues.\r\n\r\nTVLINE | Rebecca came clean and admitted that she slept with Greg's dad, and he was stunned, understandably. But he did appreciate her honesty, too. Is that a sign that maybe he can accept her as she is, flaws and all?\r\nWell, again, he's been in meetings where people have talked about doing all kinds of crazy stuff. So I think he has expanded his humanity somewhat, and he recognizes the change in her. She's somebody who would never have admitted to that before. She was always someone who would've tried to get away with it. There's no reason that she had to be the one to tell him. He was going to find out two seconds later. So he recognizes the courage in that, even though, obviously, it's rather repellent to him, and quite upsetting.\r\n\r\nTVLINE | We've done \"The Math of Love Triangles\" before, so is Rebecca now in a love rectangle?\r\nShe is in some sort of love quadrangle, yeah.\r\n\r\nTVLINE | Do you see these three guys appealing to different aspects of her?\r\nOh, definitely. We've consciously tried to explore the different tropes of men in romantic comedies, so in the way that she is somewhat adhering to the stereotype of a crazy ex-girlfriend, we have high school hero Josh Chan, rich a--hole Nathaniel Plimpton and snarky best friend Greg. They're all things that she's attracted to, and they all have something about them she really loves and admires. But she's still figuring herself out. She's really trying to figure out who she is, and what her place is in the world.\r\n\r\nTVLINE | Yeah, Rebecca even mentioned that this week: Does she even need to end up with anyone?\r\nYeah, does she need to be with anyone? What's the role of love in her life? How important is it to her? Are any of these guys suitable for that? Is she ready to be in a relationship with anybody? Love is her drug of choice, and unlike booze and drugs, she can't just put it down and walk away from it completely. That's something that Dr. Akopian said to her last year: You need and deserve love. So for her, the challenge is: How is she ever going to dip her toe in that with anybody, without getting swamped and overwhelmed and going down a rabbit hole?\r\n\r\nTVLINE | We're entering the homestretch here, the back half of the final season. What can you tell us about what's coming up?\r\nWe come back with an episode that is just completely bonkers. It's one of the silliest ones we've ever done. We really enjoyed making it. And we continue to explore these relationships, and where Rebecca's going in her life. She's landing the plane now. She's trying to make some decisions based on the things she's learned about herself. We gave her a lot of real estate after her suicide attempt, both by doing an eight-month jump, and then also this season, she hasn't really been involved with anybody romantically. She's been going down the list of unresolved relationships, and obviously, this relationship with Greg is one of the most unresolved. So there's a chance to go back to that with the tools that she's learned, and with a year under her belt since the [suicide attempt].\r\n\r\nTVLINE | And is the series finale really set on Valentine's Day, like Greg said this week?\r\nI mean... that's the end of the series of holidays, isn't it?\r\n\r\nCrazy Ex fans, let's talk: Drop your thoughts on New Greg, and Season 4 so far, in the comments below.", "fb": {"pages": 187516444593639, "page_id": 187516444593639}, "application-name": "TVLine", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "TV News, Previews, Spoilers, Casting Scoop, Interviews", "msapplication-task": "name=Subscribe;action-uri=https://tvline.com/feed/;icon-uri=https://pmctvline2.files.wordpress.com/2018/06/logo-tvline.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!", "msapplication-TileImage": "https://pmctvline2.files.wordpress.com/2018/06/logo-tvline.png?w=270"}, "movies": [], "publish_date": 1544112000.0, "source": "https://tvline.com", "summary": ""}