{"url": "https://www.huffingtonpost.com/entry/crazy-rich-asians-cultural-references_us_5b7b29ede4b0a5b1febe0336", "text": "Audiences who flocked to see “Crazy Rich Asians” this past weekend have heralded the movie as a milestone for Asian representation in pop culture, with many Asian viewers remarking how much it made them feel “seen” after years of being stereotyped and diluted in mainstream American movies and television.\n\nThe movie, based on Kevin Kwan’s bestselling novel, is a romantic comedy about the drama that ensues when Chinese-American Rachel Chu (Constance Wu) travels to Singapore to meet the extremely wealthy extended family of her boyfriend, Nick Young (Henry Golding). Tensions boil in particular between Rachel and Eleanor, Nick’s steely and domineering mother, played by the legendary Michelle Yeoh.\n\nThe film is remarkable for how it balances the general with the specific, following the conventions of a fun, splashy, summer romantic comedy while providing nuanced representations of Asians, which have deeply resonated with Asian audiences.\n\nHere are some ways, both thematic and stylistic, in which the film captures aspects of Asian culture. (Minor spoilers ahead.)\n\nAsian-American Versus Asian\n\nEleanor doesn’t just reject Rachel over class differences. As she explains in several pivotal scenes, she also looks down on her for being Asian-American and considers her not really Asian or not Asian enough, and therefore not worthy of marrying Nick.\n\nSetting up one of the central themes of the film, Rachel’s mom, Kerry, warns her early on that while she may look Chinese, “here and here, you’re different.” And she points to Rachel’s head and heart.\n\nYou’re a foreigner, an American. Eleanor Young to Rachel Chu, in one of the movie's climactic scenes\n\nLater, Rachel’s friend Peik Lin (the riotously funny Awkwafina) reminds her that Nick’s family sees her as “an unrefined ‘banana’ — yellow on the outside, white on the inside.” It’s an expression used to describe Asian-Americans.\n\nThe Mahjong Scene\n\nThe conflict between Eleanor and Rachel culminates in a mahjong showdown between the two women, a frenetic and impressively crafted scene in which the game’s strategy and tactics cleverly match up with the women’s conversation and symbolize their cultural tensions. (Journalist Jeff Yang has a much more comprehensive explanation of how the game works.)\n\n“You’re a foreigner, an American,” Eleanor says with derision, adding that Rachel is not “our own kind.”\n\nEleanor’s remarks reflect the experience of many Asian-Americans when they go to Asia and meet their extended families. Those relatives then treat them as strangers, making them feel out of place. Add to that the experience of being seen as perpetual foreigners in the U.S., and Asian-Americans can feel caught between two cultures, not belonging in either world.\n\nSpeaking Chinese\n\nA significant portion of the film is conducted in Mandarin Chinese, and for those who understand that language, there are additional moments to savor.\n\nIn one climactic scene involving Nick running onto a plane, a woman in line to board, exasperated by the holdup, says, “Hello, quickly quickly,” in Mandarin. Unlike some other non-English parts of the film, her remark is not subtitled, making it an Easter egg for some viewers.\n\nAnother potential Easter egg: When Nick, speaking Mandarin, orders food for Rachel, he discreetly asks for one dish with extra spice. Moments later, the taste of that dish appears to take Rachel by surprise.\n\nLanguage can also indicate social class. For example, Nick’s grandmother, who presides over his ultra-wealthy family, speaks precise and refined Mandarin.\n\nSome scenes feature two major Chinese dialects, Cantonese and Hokkien.\n\nAlso, There’s ‘Singlish’\n\nReflecting the range of cultures that form Singapore, viewers can also hear bits of Malay and “Singlish,” or Singaporean English. Kwan’s book goes into much more detail about these various tongues, with sardonic footnotes explaining certain oft-used expressions.\n\nWhen Nick’s family and friends send a flurry of text messages trying to find out information about Rachel, one person writes, “Why are there so many Rachel Chus, lah,” tacking on a Singlish phrase commonly used for emphasis. (They also appear to be using WeChat, a messaging app popular among ethnic Chinese people, both in China and overseas.)\n\nWhile serving Rachel a multi-course meal, Peik Lin’s mother tries to downplay it as just “simple food, lah.”\n\nAncient Designs With A Modern Flair\n\nChinese culture is reflected in some of the film’s more subtle details and aesthetic choices.\n\nRachel and Nick’s grand hotel room contains a blue and white ceramic vase that bears the Chinese characters for “double happiness,” a phrase often used in wedding decorations. The same characters appear on other objects and ornaments throughout the film.\n\nThe gates that lead to the Young family’s mansion, Tyersall Park, are designed to resemble ancient Chinese coins with a square hole.\n\nThe film’s style was also influenced by modern Asian cinema. Costume designer Mary Vogt told Vulture that the movie’s color palette was inspired by the vivid colors of Hong Kong director Wong Kar-wai’s “In the Mood for Love,” a favorite of “Crazy Rich Asians” director Jon M. Chu.\n\nThe Symbolism Of Red\n\nBefore Rachel embarks on her trip to meet Nick’s family, Kerry instructs her to buy a red dress. The color symbolizes good luck and prosperity — as well as “fertility,” Kerry says with a wink.\n\nLater seeing the dress, Peik Lin’s family teases Rachel about it before advising her to wear something more lavish to meet the Youngs.\n\n2018 WARNER BROS ENTERTAINMENT INC Peik Lin talks to Rachel about her much-too-simple red dress.\n\n“Isn’t red a lucky color?” Rachel asks.\n\n“Only if you’re an envelope,” Peik Lin’s dad (Ken Jeong) jokes, referring to the red envelopes of money traditionally given at Chinese New Year and other special occasions, like weddings and births.\n\nAddressing Elders As “Auntie” And “Uncle”\n\n“Call me auntie,” Peik Lin’s mother instructs Rachel early in the film. In many Asian cultures, younger generations refer to older people as “aunts” and “uncles” as a sign of respect, even if they’re not related. The practice also reflects how close family friends can be considered family, especially in immigrant communities where, in the absence of relatives, friends provide a support system.\n\nSometimes it’s hard to keep track of the correct forms of address, like when Rachel is unsure what exactly to call Eleanor: Mrs. Young or Auntie.\n\n“I’m still learning the lingo,” she says nervously.\n\n2018 WARNER BROS ENTERTAINMENT INC Rachel and Nick greet Eleanor upon arriving at the Young mansion for the first time.\n\nMaking Dumplings As A Group\n\nMaking dumplings brings families together, particularly when celebrating Chinese New Year. In the film, Nick introduces Rachel to the assembly-line process: You first flatten the dough using a rolling pin (a smaller and thinner kind than its Western equivalent). Then you place a dollop of filling in the center of each circle of dough, and fold and crimp it to seal the dumpling and prevent the filling from leaking out when cooking. Nick’s grandmother gives Eleanor, her daughter-in-law, a hard time for the appearance of her dumplings.\n\nBringing Leftover Meals On A Trip\n\nWhen they get to the airport for their flight to Singapore, Rachel shows Nick the three Tupperware containers of food prepared by Kerry for their long journey. Before heading to the airport in a key scene toward the end of the movie, Kerry can be seen carrying another container of food.\n\nWhich Chu Family Do You Come From?\n\nWhen meeting Rachel for the first time, Nick’s cousin Eddie (Ronny Chieng) jokingly inquires which famous Chu family she belongs to. He offers up “the packing peanut Chus” and “the ‘Cup of Noodle’ Chus,” before finally asking, “Rachel, Chu are you?”", "images": ["https://img.huffingtonpost.com/asset/5b749dcf1900002b01501ea7.jpeg?cache=5tox3gpcxl&ops=scalefit_720_noupscale", "https://img.huffingtonpost.com/asset/5b75e649200000420034a88f.jpeg?cache=lo6httrwe7&ops=210_120", "https://www.facebook.com/tr?id=10153394098876130&ev=PageView&noscript=1", "https://s.m.huffpost.com/assets/donut-a63d2a21ca5f04f551be212a9496d4deba5d40f4bcb801f34ba14f27bb3bb32a.svg", "https://img.huffingtonpost.com/asset/5b76d53f1900002b015020f3.jpeg?cache=wioewyx7av&ops=210_120", "https://s.m.huffpost.com/assets/HuffPost-Logo-Left-21b09569bfefc9a8cbc653ce84457f56babbe8110db830981db681171fd94505.svg", "https://s.m.huffpost.com/assets/H-icon-72fd5782b36a1a42ab82a4af65cbc6dd6ddc4d4a71190a91c5cfaab7c66fd836.svg", "https://img.huffingtonpost.com/asset/5d88f91b2100003200dab6d8.png", "https://s.m.huffpost.com/assets/slideshow-youtube-thumb-bc749e049bc1ccaa0c46e34471943d53a325b9901991bb2b6cc3d62e3d53321f.png", "https://img.huffingtonpost.com/asset/5b749dcf1900002b01501ea7.jpeg?cache=5tox3gpcxl&ops=1778_1000", "https://img.huffingtonpost.com/asset/5cd4e0072500005500a0c2af.jpeg?ops=100_100", "https://s.m.huffpost.com/assets/slideshow-tweet-thumb-86ce75b4fe0b7c897dac13973b0667c9f12ba3c538c72689a0a0ef69fe74f76f.png", "https://sb.scorecardresearch.com/p?c1=2&c2=6723616&c3=&c4=&c5=&c6=&c15=&cj=1", "https://img.huffingtonpost.com/asset/5b749dcb2000002c0034a71f.jpeg?cache=txlu512qkn&ops=210_120", "https://img.huffingtonpost.com/asset/5b749dcb200000dd02379cb2.jpeg?ops=scalefit_720_noupscale", "https://img.huffingtonpost.com/asset/5b71d3502000009f0037999b.jpeg?cache=nlrpr6qxrv&ops=210_120", "https://s.m.huffpost.com/assets/HuffPost-Logo-Right-b109f49b50e598958eafa8a8405c6896be046ec55882a3cfa902854998b8fbb1.svg", "https://img.huffingtonpost.com/asset/5b79b62d200000dd0237a0a6.jpeg?cache=met4ws8h6k&ops=210_120", "https://s.m.huffpost.com/assets/HuffPostHero-d783f680fb974e80346bdfa145131d058e596e1d32f791981875aa481702c770.svg", "https://www.facebook.com/tr?id=1621685564716533&ev=PageView&noscript=1"], "top_img": "https://img.huffingtonpost.com/asset/5b749dcf1900002b01501ea7.jpeg?cache=5tox3gpcxl&ops=1778_1000", "keywords": [], "authors": ["Reporter"], "canonical_link": "https://www.huffpost.com/entry/crazy-rich-asians-cultural-references_n_5b7b29ede4b0a5b1febe0336", "title": "10 'Crazy Rich Asians' Culturally Nuanced Moments That Speak Directly To Asian Viewers", "meta_data": {"google-site-verification": "97Mj-wW7u8U1NOnkW1rfH-I1kgO0-a9YsgoesOk41R8", "oath": {"guce": {"product-eu": "false", "consent-host": "guce.huffpost.com", "locale": "en-US", "inline-consent": "true"}}, "fb": {"pages": 70242384902, "app_id": 46744042133}, "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "description": "A look at some of the cultural references you might be wondering about.", "keywords": "Movies,Asian Americans,Crazy Rich Asians film,Culture of Asia,mandarin", "og": {"title": "10 'Crazy Rich Asians' Cultural Moments That Speak Directly To Asian Viewers", "type": "article", "image": {"identifier": "https://img.huffingtonpost.com/asset/5b749dcf1900002b01501ea7.jpeg?cache=5tox3gpcxl&ops=1778_1000", "url": "https://img.huffingtonpost.com/asset/5b749dcf1900002b01501ea7.jpeg?cache=5tox3gpcxl&ops=1778_1000", "type": "image/jpeg", "width": 1778, "height": 1000}, "url": "https://www.huffpost.com/entry/crazy-rich-asians-cultural-references_n_5b7b29ede4b0a5b1febe0336", "site_name": "HuffPost", "locale": "en_US", "description": "A look at some of the cultural references you might be wondering about."}, "article": {"tag": "Movies,Asian Americans,Crazy Rich Asians film,Culture of Asia,mandarin", "section": "Asian Voices", "author": "https://www.facebook.com/marina.fang", "published_time": "2018-08-21 14:29:35 -0400", "modified_time": "2018-08-21 16:17:21 -0400"}, "twitter": {"card": "summary_large_image", "site": "@HPAsianVoices", "title": "10 'Crazy Rich Asians' Cultural Moments That Speak Directly To Asian Viewers", "image": {"identifier": "https://img.huffingtonpost.com/asset/5b749dcf1900002b01501ea7.jpeg?cache=5tox3gpcxl&ops=1778_1000", "width": 1778, "height": 1000}, "description": "A look at some of the cultural references you might be wondering about.", "creator": "marinafang"}, "al": {"ios": {"url": "huffpostnews:///?editionID=us&entryID=us_5b7b29ede4b0a5b1febe0336", "app_store_id": 306621789, "app_name": "HuffPost"}}, "taboola.category": "asian-voices"}, "movies": [], "publish_date": 1534876175.0, "source": "https://www.huffingtonpost.com", "summary": ""}