{"url": "https://www.yourtango.com/2018318606/who-is-michael-barrett-new-details-anna-fariss-boyfriend", "text": "No offense but he kinda crashed the Anna Faris-Chris Pratt Halloween reunion of our dreams.\n\nIf you're still grieving the Chris Pratt and Anna Faris split, it's time to move on — Anna Faris has! The Overboard star, 41, stepped out with her new man on Halloween. The two have been linked since 2017, so who is Michael Barrett?\n\nAlso in attendance on the couple's Halloween date? Chris Pratt himself! But before you get too excited about the possibility of a reconciliation and/or love triangle, Pratt, 39, brought a plus one of his own—girlfriend Katherine Schwarzenegger, 28. It's been over a year since Anna Faris and Chris Pratt announced their split in August 2017, and while the rest of us may still be reeling, Hollywood's former comedy power couple appear to be doing just fine. The two reunited with their new beaux in tow for a Halloween double-date to take their son Jack, 6, trick-or-treating.\n\nPratt and Faris finalized their divorce just two weeks ago after eight years of marriage, and the former husband and wife seem to have made a seamless transition from couple goals to ex goals.\n\n“What Chris and I try to do is to communicate openly,” Faris told Women’s Health back in April. “We reiterate that there aren’t rules to this. We have a lot of love and friendship, and our big goal is to protect Jack. I cherish my family, my close friends, my child – that makes the rest of it worth it.”\n\nWhile of dreams of a Chris Pratt/Anna Faris reunion seem to have been officially laid to rest, the exes seem to have happily moved on. So who is Anna's new man? Here's everything you need to know about Michael Barrett.\n\n1. He's a cinematographer\n\nAccording to IMDB, Barrett's professional film experience goes back to the 90s, but his first major cinematography credit was 2005's Kiss Kiss Bang Bang. You may have also seen his work in comedies like Ted, Ted 2, and You Don't Mess With The Zohan.\n\n2. He went to UCLA and Columbia\n\nHe studied film, shooting music videos and shorts. He completed his thesis under famed cinematographer Allen Daviau, known for his award-winning work on films like The Color Purple and Empire of the Sun.\n\n3. He was first linked to Anna back in 2017\n\nShortly after Faris and Pratt announced their separation in August 2017, Faris was spotted out with Barrett on various dinner dates in and around LA. Before the end of the year, the two had gone public with their relationship.\n\n4. He and Anna have worked together\n\nFaris and Barrett both worked on the 2018 remake of the 1987 classic Overboard. Although TMZ reported there were \"no signs of romance during production,\" reports of the budding romance began to surface shortly after filming wrapped.\n\n5. They've kept the relationship low-profile\n\nWhile a flurry of headlines emerged after Faris and Anna first stepped out together last fall, the couple's romance has continued to unfold largely out of the public eye. Barrett has made no appearances on Faris' Instagram, although he does seem to enjoy quality time with Faris's son, Jack, an Instagram star in the making.\n\nOver a year before this week's Halloween double-date, Jack was already a guest of honor on Faris and Barrett's dates, with the three spotted together at an LA carnival back in September 2017.\n\n6. He's got a seal of approval from her friends\n\nIn March, Us Weekly confirmed that Faris' friends are fully onboard with the star's new beau. “They are a great match,” an insider told the magazine. “All of her friends love him. He’s so down-to-earth, stable and obsessed with Anna.”\n\nEven if you're still mourning the Pratt/Faris split, it's hard not to be happy for Faris and Barrett. And hey, at least we still have Faris and Pratt's epic co-parenting relationship to obsess over.\n\nKayla Kibbe is a writer wrapping up her final semester at Connecticut College where she is an English major with a concentration in creative writing. She covers trending celebrity and entertainment news, love and relationships, and astrology.\n\nWATCH: The Real Reasons Chris Pratt And Anna Faris Split", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6035233&cv=2.0&cj=1", "https://www.yourtango.com/sites/all/themes/ytpurple/img/logo-150.png?v2", "https://www.yourtango.com/sites/default/files/styles/header_slider/public/image_blog/WhoIsMichealBarrett.png?itok=sOuToYCe", "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/WhoIsMichealBarrett.png?itok=kbCMfM59"], "top_img": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/WhoIsMichealBarrett.png?itok=kbCMfM59", "keywords": [], "authors": [], "canonical_link": "https://www.yourtango.com/2018318606/who-is-michael-barrett-new-details-anna-fariss-boyfriend", "title": "Who Is Michael Barrett? New Details On Anna Faris's Boyfriend", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "fb": {"app_id": 102332647006, "pages": 39475817260}, "keywords": "anna faris, Chris Pratt, entertainment and news, Buzz", "article": {"author": "https://www.yourtango.com/users/kayla-kibbe", "published_time": "2018-11-02T18:45:30", "modified_time": "2018-11-02T18:45:30"}, "og": {"site_name": "YourTango", "type": "article", "url": "https://www.yourtango.com/2018318606/who-is-michael-barrett-new-details-anna-fariss-boyfriend", "title": "Who Is Michael Barrett? New Details On Anna Faris's Boyfriend", "description": "No offense but he kinda crashed the Anna Faris-Chris Pratt Halloween reunion of our dreams.", "updated_time": "2018-11-02T18:45:30", "image": {"identifier": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/WhoIsMichealBarrett.png?itok=kbCMfM59", "width": 620, "height": 309}}, "description": "Who is Michael Barrett? Anna Faris showed up with a new man on her arm for Halloween, joining ex-husband Chris Pratt and his new girlfriend on a \"double-date\" to take son Jack trick-or-treating. So who is Anna's new guy? Here's everything you need to know about cinematographer Michael Barrett.", "abstract": "If you're still grieving the Chris Pratt and Anna Faris split, it's time to move on—Anna Faris has! The Overboard star, 41, stepped out with her new", "robots": "follow, index, noodp, noydir", "news_keywords": "who is michael barrett, anna faris and michael barrett, anna faris boyfriend, anna faris new boyfriend, who is anna faris new boyfriend, who is anna faris new boyfriend, anna faris chris pratt reunion, michael barrett", "generator": "Drupal 7 (http://drupal.org)", "twitter": {"card": "summary_large_image", "creator": {"identifier": "@yourtango", "id": 17490866}, "url": "https://www.yourtango.com/2018318606/who-is-michael-barrett-new-details-anna-fariss-boyfriend", "title": "Who Is Michael Barrett? New Details On Anna Faris's Boyfriend", "image": {"src": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/WhoIsMichealBarrett.png?itok=kbCMfM59", "width": 60, "height": 60}}}, "movies": ["https://www.youtube.com/embed/KaWjsHxoTrY", "https://www.youtube.com/embed/aOt-aygJ0Eo"], "publish_date": 1541155530.0, "source": "https://www.yourtango.com", "summary": ""}