{"url": "https://www.metacritic.com/feature/tv-premiere-dates?page=1", "text": "Past dates are listed below in reverse chronological order.\n\n< Current/Future Premieres | 2019 Premieres >\n\nFRI / January 31\n\n37 Seconds Foreign/Drama\n\nAll or Nothing: CBF Foreign/Reality/Sports Prime Video\n\nThe critic favorite concludes its six-season run with these eight final episodes.\n\nDiablero Foreign/Drama/Fantasy\n\nI Am a Killer Reality\n\nLamp Life Trailer Animated short Disney+\n\nLuna Nera Foreign/Drama\n\nThe Road to F9: Fast & Furious Fan Fest Special 9p\n\nFaster than you can say \"corporate synergy,\" NBC devotes a full hour of its primetime schedule to unveiling a trailer for an upcoming movie distributed by its parent company. Also, Cardi B performs.\n\nShakira in Concert: El Dorado World Tour Trailer Music/Documentary 8p\n\nSinister Savior Drama LMN, 8p\n\nTed Bundy: Falling for a Killer Trailer Documentary Prime Video\n\nUnauthorized Living Foreign/Drama\n\nTHU / January 30\n\n30 for 30: Vick Documentary/Sports ESPN, 9p\n\nTwo-part look at Michael Vick concludes February 6 at 9p.\n\nAinori Love Wagon: African Journey Foreign/Reality\n\nAlone Reality History, 10p\n\nThe Good Place Comedy/Special 8:30p\n\nSpecial 90-minute series finale includes an expanded final episode as well as an after-show hosted by Seth Meyers.\n\nGrand Theft Auto Girls Drama LMN, 8p\n\nImpractical Jokers Comedy truTV, 10p\n\n▣ The Stranger Drama\n\nEight-part Harlan Coben adaptation from the team behind Safe stars Richard Armitage, Siobhan Finneran, Hannah John-Kamen, Jennifer Saunders, Anthony Head, and Stephen Rea.\n\nWhat the Love! With Karan Johar Reality\n\nWED / January 29\n\nClose Enemies (Frères Ennemis) Foreign/Drama/Thriller\n\nHarry & Meghan: The Royals in Crisis News(ish) 8p\n\nMiz and Mrs Reality USA, 10p\n\nNight on Earth Trailer Documentary/Nature\n\nOmniscient Foreign/Sci-fi/Drama\n\nRoyal Divide: Harry, Meghan, and The Crown News(ish) 10p\n\nTUE / January 28\n\nAlex Fernández: El mejor comediante del mundo Foreign/Comedy special\n\nThe Biggest Loser Reality competition USA, 9p\n\nI Am Jazz Reality TLC, 9p\n\nThe cast from season one of Miracle Workers (including Daniel Ratcliffe and Steve Buscemi) returns, but all will be playing new characters in this second season that shifts the setting to the medieval era.\n\nMON / January 27\n\nSUN / January 26\n\n62nd Annual Grammy Awards Music/Live event 8p ET\n\nAlicia Keys returns as host.\n\nAdopted in Danger Drama Lifetime, 8p\n\nAuschwitz Untold Documentary History, 9p\n\nThe Circus News 8p\n\nLate Bloomer Drama UP, 7p\n\nThe Lost Unabomber Tapes Reality Reelz, 9p ET\n\nVir Das: For India Comedy special\n\nSAT / January 25\n\nBeyond the Headlines: The Watts Family Tragedy Documentary Lifetime, 10p\n\nChris Watts, Colorado Killer Dad: The Friends Speak Reality Reelz, 7p ET\n\nChris Watts: Confessions of a Killer Drama Lifetime, 8p\n\nHeartland Docs, DVM Reality Nat Geo Wild, 10p\n\nHearts of Winter Drama Hallmark, 8p\n\nJeffrey Epstein & Prince Andrew: The True Story Reality Reelz, 9p ET\n\nFRI / January 24\n\nAncient Aliens Rality History, 10p\n\n▣ The Crystal Maze Game show/Family Nickelodeon, 7p\n\nThe Ranch Comedy\n\nRise of Empires: Ottoman Documentary/Drama\n\n▣ Shrill Trailer Comedy\n\nA Sun Foreign/Drama\n\nThe Wrong House Sitter Drama LMN, 8p\n\nTHU / January 23\n\nAirplane Mode Foreign/Comedy\n\nThe Bold Type Drama Freeform, 9p\n\nThe Dead Lands Trailer Drama/Horror Shudder\n\nDeath by Friendship Drama LMN, 8p\n\nThe Gayle King Grammy Special Music/Talk 10p\n\nThe Ghost Bride Foreign/Drama\n\nGrey's Anatomy Drama 9p\n\nA Million Little Things Drama 10p\n\nOctober Faction Trailer Drama/Fantasy\n\n▣ Outmatched Comedy 8:30p\n\nFox's lone new live-action sitcom this season comes from LA→Vegas creator Lon Zimmet and centers on a blue-collar couple (Jason Biggs, Maggie Lawson) living in South Jersey. Together, they are trying to raise four kids—three of whom are \"certified geniuses.\" (Apparently they lacked the resources to obtain certification for the fourth child.)\n\nThe Red Shadows Foreign/Drama Sundance Now\n\nSaint Seiya: Knights of the Zodiac Anime\n\nPatrick Stewart returns as Starfleet's all-time greatest captain (hey, we're just stating facts) in a new series that picks up over two decades after the events of Star Trek: The Next Generation and its various film spinoffs. Filling out the main cast are Michelle Hurd, Santiago Cabrera, Alison Pill, Isa Briones, and Harry Treadaway, but you'll also see some familiar faces from TNG (and Voyager), including Brent Spiner, Jonathan Frakes (who also directs several episodes), Marina Sirtis, and Jeri Ryan. Novelist Michael Chabon is among the writers and serves as showrunner for the 10-episode season, which is not a miniseries as originally believed, and has in fact already been renewed for a 2nd season.\n\nStation 19 Drama 8p\n\nSwamp People Reality History, 9p\n\nWED / January 22\n\nComedian/actress Awkwafina (The Farewell) is the creator and star of this 10-episode, semi-autobiographical scripted comedy series about a young Asian-American woman growing up in Flushing. BD Wong, Lori Tan Chinn, and Bowen Yang also star, while the mostly female director list includes Natasha Lyonne (who also guest stars), Lucia Aniello, and Jamie Babbit. The series has already been renewed for a 2nd season.\n\nPandemic: How to Prevent an Outbreak Documentary\n\nRiverdale Drama 8p\n\nTUE / January 21\n\nBless This Mess Comedy 8:30p\n\nThe Connors Comedy 8p\n\nFortune Feimster: Sweet & Salty Trailer Comedy special\n\nWord Party Animation/Family\n\nMON / January 20\n\nAaron Hernandez: An ID Murder Mystery Reality ID, 9p\n\nAll-American Drama 8p\n\nAmazing Winter Romance Drama Hallmark, 8p\n\nBlack Lightning Drama 9p\n\n▣ Brain Games Reality Nat Geo, 8p\n\nKeegan-Michael Key hosts a celebrity-filled, eight-episode revival of the Nat Geo series.\n\nCarter Drama/Comedy WGN, 10p\n\nFamily Reunion Trailer Comedy\n\nHome Town Reality HGTV, 9p\n\nNo Passport Required Reality 9p\n\nProdigal Son Drama 9p\n\n▣ Spy Games Reality competition Bravo, 10p\n\nStreet Outlaws: Fastest in America Reality competition Discovery, 8p\n\nUrban One Honors Special TV One, 8p\n\nSUN / January 19\n\n26th Annual Screen Actors Guild Awards Live event TNT/TBS, 8p ET\n\n▣ 9-1-1: Lone Star Trailer Drama 10p ET / 7p PT\n\nRob Lowe and Liv Tyler head the cast of this 9-1-1 spinoff set in Austin, Texas. The special two-night premiere begins tonight immediately after the NFC Championship game (on both coasts) and concludes tomorrow at 8p.\n\nVeep creator Armando Iannucci returns to HBO for his next foul-mouthed comedy series, a sci-fi satire set four decades in the future aboard a luxury tourist vessel in space. Captaining that ship is Hugh Laurie, and he's joined in the cast by Josh Gad, Zach Woods, Nikki Amuka-Bird, Kyle Bornheimer, and Star Trek: Voyager's Ethan Phillips.\n\nBatwoman Drama 8p\n\nGuests for this 10th season include Jon Hamm, Laverne Cox, Jane Krakowski, Fred Armisen, and Wilco's Jeff Tweedy.\n\nHopeless Romantic Drama UP, 7p\n\nMurder in the Suburbs Drama Lifetime, 8p\n\nMurdered by Morning Reality Oxygen, 7p\n\nSupergirl Drama 9p\n\n▣ Vienna Blood Trailer Drama 10p\n\nSix-episode, BBC-produced crime drama is set in the early 1900s.\n\nSAT / January 18\n\nBeyond the Headlines: The Kamiyah Mobley Story with Robin Roberts Documentary Lifetime, 10p\n\nKiller Affair Reality Oxygen, 7p\n\nLove on Iceland Drama Hallmark, 8p\n\n▣ Seven Worlds, One Planet Documentary/Nature BBC America, 9p\n\nThe latest stunningly photographed nature series narrated by David Attenborough follows recent hits Planet Earth II and Blue Planet II. Shot across all seven continents, the seven-part series will be simulcast on Sundance, AMC, and IFC.\n\nStolen by My Mother: The Kamiyah Mobley Story Drama Lifetime, 8p\n\nFRI / January 17\n\nAmerican Housewife Comedy 8p\n\nAres Foreign/Drama/Horror\n\nCharmed Drama 8p\n\nThe Daughter Stalker Drama LMN, 8p\n\nIlana Peña's loosely autobiographical series follows an ambitious 12-year-old Cuban American girl (Tess Romero) through middle school. Selenis Leyva and Michael Weaver also star, while Gina Rodriguez produces (and, for the opener, directs), while also guest-starring as a future version of the young woman—who is, indeed, President of the United States.\n\nDynasty Drama 9p\n\nEndlings Trailer Sci-fi/Family\n\nFresh Off the Boat Comedy 8:30p\n\nGeorge of the Jungle Animation/Family CBS All Access\n\nHip-Hop Evolution Music/Reality\n\nHopelessly in Love: Anna Nicole Smith & Larry Birkhead Documentary Lifetime, 9p\n\nJust Add Magic: Mystery City Family Prime Video\n\nLassie Animation/Family CBS All Access\n\nApple hasn't exactly come out of the gate strong with its new streaming service, which has produced few if any noteworthy shows in its opening months (despite huge budgets). But the tech giant will be rolling out plenty of new programming throughout 2020. First up is this anthology series from the husband and wife team behind The Big Sick, Emily V. Gordon and Kumail Nanjiani, along with Master of None co-creator Alan Yang and The Office's Lee Eisenberg. In its first season (and a second has already been greenlit), Little America will offer eight half-hour tales of the immigrant experience in present-day America, inspired by the true stories reported in the column of the same name at Epic Magazine. Apple is departing from its usual weekly rollout and will make all episodes available to stream at once.\n\nMr. Magoo Animation/Family CBS All Access\n\nNailed It! Germany Reality competition\n\nReal Time With Bill Maher Talk 10p\n\nRob Delaney: Jackie Comedy special Prime Video\n\nRussell Peters: Deported Trailer Comedy special Prime Video\n\n▣ Troop Zero Trailer Drama/Comedy/Family Prime Video\n\nTHU / January 16\n\nGone, Daughter Gone Drama LMN, 8p\n\ngrown-ish Comedy Freeform, 8p\n\nThe Last Days of Richard Pryor Reality 9p\n\nLegacies Drama 9p\n\nNi No Kuni Anime\n\nSupernatural Drama 8p\n\nWED / January 15\n\nThink of it as a modern-day M*A*S*H. Adapted from an Israeli series (Charlie Golf One), this 10-episode dramedy focuses on a group of Army medics serving in Afghanistan. The ensemble cast includes Sam Keeley, Jeremy Tardy, Gage Golightly, and Cristina Rodlo.\n\nThe CW Dog Honors Special 8p\n\nExpedition With Steve Backshall Trailer Reality 10p\n\nEye for an Eye (Quien a hierro mata) Foreign/Drama/Thriller\n\nThe Goldbergs Comedy 8p\n\nGood Trouble Drama Freeform, 10p\n\nIn Pursuit With John Walsh Reality ID, 10p\n\nListing Impossible Reality CNBC, 10p\n\nThe Magicians Trailer Drama Syfy, 10p\n\nNancy Drew Drama 9p\n\nSchooled Comedy 8:30p\n\nS.W.A.T. Drama 10p\n\nTUE / January 14\n\nArrow Drama 8p\n\nDC's Legends of Tomorrow Drama 9p\n\nDemocratic Presidential Debate Live event CNN, 9p ET\n\nWill this episode be the one to finally reveal which celebrity has been wearing the Bernie Sanders mask throughout the competition?\n\nKipo and the Age of Wonderbeasts Animation/Family\n\nNew Amsterdam Drama 10p\n\nThis Is Us Drama 9p\n\nMON / January 13\n\nAckley Bridge Trailer Drama/Comedy Acorn TV\n\nBattle of Little Big Horn Reality Smithsonian, 8p\n\nFatal Attraction Reality TV One, 9p\n\nThe Good Doctor Drama 10p\n\nThe Healing Powers of Dude Family/Comedy\n\nMeet the Frasers Trailer Reality E!, 10p\n\nDirector Paolo Sorrentino's nine-episode sequel to his 2017 miniseries The Young Pope returns star Jude Law and finds John Malkovich's Sir John Brannox taking over the papal throne. Sharon Stone and Marilyn Manson guest, because why not.\n\nSUN / January 12\n\n25th Annual Critics Choice Awards Live event 7p\n\n28th Annual Bounce Trumpet Awards Special Bounce, 9p\n\nAaron Hernandez's Killing Fields Reality Reelz, 8p ET\n\nBrimming With Love Drama UP, 7p\n\nHBO's 10-episode adaptation of Stephen King's 2018 horror novel stars Ben Mendelsohn as a detective investigating the brutal murder of an 11-year-old boy found in the Georgia woods. Jason Bateman, Cynthia Erivo, Bill Camp, Mare Winningham, Paddy Considine, and Julianne Nicholson also star. Two episodes air back-to-back tonight.\n\nPsycho Party Planner Drama Lifetime, 8p\n\n▣ Sanditon Trailer Drama 9p\n\nJane Austen's unfinished final novel set in an early 19th century seaside village comes to the small screen in an adaptation from Andrew Davies (Les Misérables, Mr. Selfridge). Rose Williams, Theo James, Anne Reid, Kris Marshall, and Crystal Clarke star. The series already aired last fall in the UK, where it seemed to divide critics. Two episodes air back-to-back tonight.\n\nSAT / January 11\n\nFamily or Fiancé Reality OWN, 9p\n\nLove in Winterland Drama Hallmark, 8p\n\nPsycho Nurse Drama Lifetime, 8p\n\nFRI / January 10\n\nCo-created by Sex and the City's Michael Patrick King and Drag Race host RuPaul, this Netflix sitcom stars the latter as Ruby Red, a drag queen who takes on a 10-year-old runaway as a traveling companion while embarking on a cross-country trip in an attempt to open his own drag club.\n\nBaby Monitor Murders Drama LMN, 8p\n\nBill Burr Presents: The Ringers Comedy 11p\n\nNamed one of the best shows of 2019 by The Telegraph (it aired in the UK on BBC2 last fall), this artsy British crime thriller focuses on a clash between rival Yakuza gangs that spans multiple countries (with much of the action split between London and Tokyo).\n\nHarvey Girls Forever! Animation/Family\n\nHopelessly in Love: Faith Evans & Notorious B.I.G. Documentary Lifetime, 9p\n\nHow to Survive a Murder Reality Reelz, 9p ET\n\nThe Inbestigators Family/Comedy\n\nJamtara Trailer Foreign/Drama\n\n▣ Lincoln Rhyme: Hunt for the Bone Collector Drama 8p\n\nRussell Hornsby (of Grimm and the just-canceled Proven Innocent) heads the cast of this series adaptation of Jeffery Deaver's novel The Bone Collector, which was previously made into a not all that good 1999 film. He plays Lincoln Rhyme, a former forensic specialist with the NYPD who was forced to retire when an encounter with a serial killer left him paralyzed. But he is brought back in when a young detective (Arielle Kebbel of Midnight, Texas) has a lead on the same killer. Michael Imperioli, Brían F. O'Byrne, Brooke Lyons, and Tate Ellington also star. The adaptation comes from relative newcomer Mark Bianculli and former Justified writer/producer V.J. Boyd. Note that The Blacklist will go on a brief hiatus to make way for this newcomer, which runs until March.\n\nThe team behind Adult Swim hits Children's Hospital and NTSF:SD:SUV:: returns with a similar satire of TV procedurals, this time for Netflix. Many of Hospital's cast members will appear in the new series—which is technically a sequel, dealing with the outbreak of a deadly virus—including Erinn Hayes, Rob Huebel, Malin Akerman, Lake Bell, Rob Corddry, and Ken Marino. Guests include Joel McHale, Randall Park, Craig Robinson, Fred Melamed, Jason Schwartzman, and Lilly Singh.\n\nThe Owl House Trailer Animation/Family Disney, 8:45p\n\nScissor Seven Anime\n\nUntil Dawn Foreign/Reality\n\nZumbo's Just Desserts Reality competition\n\nTHU / January 9\n\nThe Babysitter's Revenge Drama LMN, 8p\n\nBuilding Off the Grid Reality Discovery, 10p\n\nCarol's Second Act Comedy 9:30p\n\nEvil Drama 10p\n\nThe Good Place Comedy 8:30p\n\nLaw & Order: SVU Drama 10p\n\nMom Comedy 9p\n\nPerfect Harmony Comedy 9:30p\n\nReclaimed Reality Discovery, 9p\n\nSuperstore Comedy 8p\n\nTruth and Lies: The Jeffrey Epstein Story News tbd\n\nThe Unicorn Comedy 8:30p\n\nVery Cavallari Reality E!, 9p\n\nWhat on Earth? Reality Science, 9p\n\nWill & Grace Comedy 9p\n\nYoung Sheldon Comedy 8p\n\nWED / January 8\n\nAmerica's Top Dog Trailer Fureality competition A&E, 9p\n\nCatfish: The TV Show Reality MTV, 8p\n\n▣ Cheer Trailer Reality\n\nChicago Fire Drama 9p\n\nChicago Med Drama 8p\n\nChicago P.D. Drama 10p\n\nChicago Waste Management Drama\n\nThis one doesn't actually exist; we were just testing to see if you were paying attention.\n\nCriminal Minds Drama 9p\n\nSpecial two-hour premiere.\n\nModern Family Comedy 9p\n\nReboot of the 1990s series of the same name (which ran for six seasons on Fox) offers a timely take on the story of five children who must support each other after they lose their parents—in this case, because their parents are deported to Mexico. The first half of tonight's two-episode debut will also be available to stream one week early (on Jan. 1) via Freeform's app and website and Hulu.\n\nSingle Parents Comedy 9:30p\n\nStumptown Drama 10p\n\nTrue Life Crime Trailer Reality MTV, 9p\n\nUndercover Boss Reality 8p\n\nTUE / January 7\n\nblack-ish Comedy 9:30p\n\nBurgers, Brew & 'Que Reality Cooking, 9p\n\nEllen's Game of Games Game show 8p\n\nEmergence Drama 10p\n\nFBI Drama 9p\n\n▣ FBI: Most Wanted Drama 10p\n\nFulfilling the TV axiom that says every Dick Wolf series gets a spinoff, Most Wanted first debuted as a backdoor pilot on the April 2nd episode of Wolf's FBI. The spinoff will center on the FBI division charged with tracking down the criminals on the Bureau's \"most wanted\" list (in case that show title didn't make this crystal clear already). Julian McMahon, Kellan Lutz, Nathaniel Arcand, Roxy Sternberg, and Keisha Castle-Hughes star. (Alana De La Garza was originally set to move from the main series to Most Wanted but will now remain where she is on FBI, though she will guest occasionally on the new show.)\n\nFinding Your Roots Reality 8p\n\nGordon Ramsay's 24 Hours to Hell and Back Reality 9p\n\nGuardians of the Glades Reality Discovery, 10p\n\nThe Haves and the Have Nots Drama OWN, 9p\n\nHot & Heavy Reality TLC, 10p\n\nInk Master Reality competition Paramount, 10p\n\n▣ Jeopardy: The Greatest of All Time Game show 8p\n\nSpecial multi-day tournament (which marks Jeopardy's first prime-time network television airing in over three decades) pits the game show's all-time winningest champions (James Holzhauer, Ken Jennings, and Brad Rutter) against each other. Subsequent episodes will air each night until someone wins a total of three matches.\n\nLive Twice, Love Once (Vivir dos veces) Foreign/Comedy\n\nmixed-ish Comedy 9p\n\nMy Big Fat Fabulous Life Reality TLC, 8p\n\nNCIS Drama 8p\n\nNick Cannon Presents: Wild 'N Out Comedy VH1, tbd\n\nThe Resident Drama 8p\n\nSiesta Key Reality MTV, 8p\n\nVanderpump Rules Reality Bravo, 9p\n\n▣ Zoey's Extraordinary Playlist Drama 10p\n\n[Special sneak preview tonight; the official debut is February 16.] The rare network show to start with a \"Z\" (joining such greats as Zorro and Son and Zoe, Duncan, Jack and Jane), Zoey is a magical realist drama from Austin Winsberg (Jake in Progress, The Sound of Music Live!) and producer Paul Feig. Jane Levy stars as a \"whip-smart\" San Francisco-based coder who suddenly gains the ability to hear the thoughts and desires of people around her through—wait for it—song. Is it a blessing? A curse? Well, that depends on how good the songs are. Lauren Graham, Skylar Astin, Mary Steenburgen, Peter Gallagher, Alex Newell, John Clarence Stewart, and Andrew Leeds fill out the cast.\n\nMON / January 6\n\nAll Rise Drama 9p\n\nAmerica's Got Talent: The Champions Reality competition 8p\n\nAntiques Roadshow Reality 8p\n\nThe Bachelor Reality competition 8p\n\nBob ♥ Abishola Comedy 8:30p\n\nThe Brokenwood Mysteries Drama Acorn TV\n\nBull Drama 10p\n\nInfinity Train Animation/Family Cartoon, 7:30p\n\nKids Baking Championship Reality competition Food, 9p\n\nLove & Hip Hop: Miami Reality VH1, 9p\n\n▣ Manifest Drama 10p\n\nThe Neighborhood Comedy 8p\n\nRidiculousness Comedy MTV, 10p\n\nSUN / January 5\n\n▣ 77th Annual Golden Globe Awards Live event 8p ET\n\nRicky Gervais hosts.\n\nAbducted on Air Drama Lifetime, 8p\n\nAir Disasters Reality Smithsonian, 8p\n\nAmerica's Funniest Home Videos Reality 7p\n\nBless the Harts Animation/Comedy 8:30p\n\nBob's Burgers Animation/Comedy 9p\n\nDisasters at Sea Reality Smithsonian, 9p\n\nEvil Lives Here Reality ID, 9p\n\nFamily Guy Animation/Comedy 9:30p\n\nGod Friended Me Drama 8p\n\nNaked and Afraid Reality Discovery, 8p\n\nNaked and Afraid XL Reality Discovery, 10p\n\nNCIS: Los Angeles Drama 9p\n\nPower Drama Starz, 8p\n\nThe Simpsons Animation/Comedy 8p\n\nSister Wives Reality TLC, 9p\n\nThe Wedding Do Over Drama UP, 7p\n\nWorst Cooks in America Reality competition Food, 9p\n\nSAT / January 4\n\nThe creative team behind Sherlock (Mark Gatiss and Steven Moffat) offers a new take on another literary figure: Bram Stoker's Dracula. A co-production with the BBC (which gets the series a few days earlier), the new series is set in Victorian London (and Transylvania) and will span just three episodes for its first season, though each is feature-length. Claes Bang (The Square, Borgen) stars as Count Dracula, and he's joined in the cast by Dolly Wells, Joanna Scanlan, Morfydd Clark, and Gatiss (who co-wrote each of the three episodes with Moffat).\n\nGo! Go! Cory Carson Animation/Family\n\nHaunted Hospitals Reality Travel, 10p\n\nHopelessly in Love: Lisa “Left Eye” Lopes & Andre Rison Documentary Lifetime, 9:30p\n\nSay Yes to the Dress: America Reality TLC, 8p\n\nWinter in Vail Drama Hallmark, 8p\n\nFRI / January 3\n\nAll the Freckles in the World Foreign/Drama/Family\n\nBlue Bloods Drama 10p\n\nBug Diaries Animation/Family Prime Video\n\nA Deadly Price for Her Pretty Face Drama LMN, 8p\n\nThe Dirt Talk Discovery, 10p\n\nExtreme Love Reality WE, 10p\n\nGhost Loop Reality Travel, 10p\n\nHawaii Five-0 Drama 8p\n\nIlana Glazer: The Planet Is Burning Trailer Comedy special Prime Video\n\nJames May: Our Man in Japan Reality Prime Video\n\nJayde Adams: Serious Black Jumper Comedy special Prime Video\n\nKindred Spirits Reality Travel, 9p\n\nLove After Lockup: Life After Lockup Reality WE, 9p\n\nMagnum P.I. Drama 9p\n\nTHU / January 2\n\n60 Days In Reality A&E, 10p\n\nChristina on the Coast Reality HGTV, 9p\n\nDead of Winter Reality ID, 9p\n\n▣ Deputy Trailer Drama 9p\n\nCastle writer Will Beall, who created the recent (not so good) TV adaptation of Training Day, returns with another law enforcement drama series. This one follows the Los Angeles County Sheriff's department—specifically, a man (Stephen Dorff) who gets the department's top job after the death of the former sheriff thanks to \"an arcane rule forged back in the Wild West.\" (We're assuming that rule is \"Finders Keepers.\") David Ayer (Suicide Squad) directs the pilot and is also a producer on the series.\n\nDr. Pimple Popper Reality TLC, 9p\n\nThe First 48 Reality A&E, 8p\n\nGhost Adventures: Screaming Room Reality Travel, 9p\n\nThe Golden Age of Television continues as cast members of a reality show watch episodes of their own reality show.\n\nHer Deadly Reflections Drama LMN, 8p\n\nHomestead Rescue Reality Discovery, 8p\n\nHow the Universe Works Reality Science, 9p\n\n▣ Last Man Standing Comedy 8p\n\nTwo new episodes air back-to-back tonight, the former Friday show's new night.\n\nMy Feet Are Killing Me Reality TLC, 10p\n\nThe Paley Center Salutes Law & Order: SVU Special 9p\n\nSex Explained Trailer Reality\n\nIt's time for you and Netflix to sit down and have a talk.\n\nThieves of the Wood Foreign/Drama\n\nWED / January 1\n\n100 Day Dream Home Reality HGTV, 10p\n\n1000-lb Sisters Reality TLC, 10p\n\nAileen Wuornos: Mind of a Monster Reality ID, 10p\n\nAlaska PD Reality A&E, 10p\n\nAlmost Family Drama 9p\n\nThe Circle Trailer Reality competition\n\n▣ Doctor Who Trailer Drama/Sci-fi BBC America, 8p\n\nSpecial premiere night; subsequent episodes will air Sundays at 8p (beginning Jan. 5).\n\nEscaping My Stalker Drama LMN, 8p\n\nThe Explosion Show Reality Science, 10p\n\nThe First 48: 15th Anniversary Special Reality A&E, 8p\n\nHGTV Dream Home Special 2020 Reality HGTV, 8p\n\nHGTV House Party Reality HGTV, 11p\n\nImpossible Engineering Reality Science, 9p\n\nKiller Bods Reality ID, 8p\n\nMarried at First Sight Reality Lifetime, 8p\n\n▣ Messiah Trailer Drama\n\nIn this Mark Burnett-produced thriller, Michelle Monaghan stars as a CIA agent who investigates a charismatic cult leader (Mehdi Dehbi) claiming to be the son of God. James McTeigue directs.\n\nMy 600-lb Life Reality TLC, 8p\n\nNisman: The Prosecutor, The President, and The Spy Foreign/Documentary\n\nSelf-Made Mansions Reality HGTV, 6:30p\n\nDrama series set in the world of competitive figure skating stars Kaya Scodelario (Skins), Johnny Weir, and January Jones.", "images": ["https://static.metacritic.com/images/features/networks/comedycentralnew20.png", "https://static.metacritic.com/images/features/main/peacock202004-28.jpg", "https://static.metacritic.com/images/products/tv/1/e951216810bf9b9c61f45b87bdcbf5d8-98.jpg", "https://static.metacritic.com/images/products/tv/8/5a6f27965ef2e3b9c6c41d7ba2cb7e19-98.jpg", "https://static.metacritic.com/images/products/movies/8/49c291191b4b6d4686707f8c802e4462-98.jpg", "https://static.metacritic.com/images/features/main/best_games_2019_residentevil2-28.jpg", "https://static.metacritic.com/images/features/main/tvpremieredates-28.jpg", "https://static.metacritic.com/images/features/main/decade_best_games_breathofthewild-28.jpg", "https://static.metacritic.com/images/features/networks/hulu15transparent.png", "http://static.metacritic.com/images/features/networks/fx20.png", "https://static.metacritic.com/images/features/main/starz202003-50.jpg", "https://static.metacritic.com/images/products/music/9/913ead22b9fdf9f19229581e3914c2b0-98.jpg", "https://static.metacritic.com/images/features/main/fullyear_movies3-28.jpg", "https://static.metacritic.com/images/products/music/5/03fa2f48e7537482619037aa9936c1e8-98.jpg", "https://static.metacritic.com/images/features/main/tvpreview_2020_04killingeve-50.jpg", "https://static.metacritic.com/images/features/main/peacock202004-180.jpg", "https://www.metacritic.com/images/icons/search_inactive.svg", "https://static.metacritic.com/images/features/networks/fxx25.png", "https://static.metacritic.com/images/products/games/2/0c6d00c4427046c3d07cc2555b943d32-98.jpg", "https://static.metacritic.com/images/features/main/coronavirusdelays-180.jpg", "https://static.metacritic.com/images/features/main/amazon202004-50.jpg", "https://static.metacritic.com/images/features/networks/netflixnew50.jpg", "https://static.metacritic.com/images/products/tv/1/b15171baa9dc05e4ed73098b885c3eb4-98.jpg", "https://static.metacritic.com/images/features/networks/abc20.png", "https://www.metacritic.com/images/icons/metacritic-wordmark.svg", "https://static.metacritic.com/images/features/_graphics/miniseries.gif", "https://static.metacritic.com/images/products/movies/0/3a6527d4d2499240200465561fc7b4a7-98.jpg", "https://static.metacritic.com/images/products/tv/4/2f5d95e7c790ba802ca147105966cb8e-98.jpg", "https://static.metacritic.com/images/products/music/4/ff948221ddeb6cc42360a2e2506f7b69-98.jpg", "https://static.metacritic.com/images/features/main/mustwatchshows-50.jpg", "https://www.metacritic.com/images/icons/mc-mustwatch-sm.svg", "https://static.metacritic.com/images/features/main/gamesscorecard2020Q1alt-180.jpg", "https://static.metacritic.com/images/products/music/6/3fac9024d9a862da5cb23f87a4853448-98.jpg", "https://static.metacritic.com/images/features/main/appletvplus202003-50.jpg", "https://static.metacritic.com/images/features/main/dvd_2020_04-180.jpg", "https://static.metacritic.com/images/features/_graphics/movie.gif", "https://static.metacritic.com/images/features/media/graphics/new.gif", "https://www.metacritic.com/media/networks/pbs25.png", "https://static.metacritic.com/images/features/main/quibi_april2020-50.jpg", "https://static.metacritic.com/images/products/movies/0/e2d70ac851a1bbdebc986fe443a4b3ba-98.jpg", "https://www.metacritic.com/images/icons/mc-mustplay-sm.svg", "https://www.metacritic.com/images/icons/metacritic-icon.svg", "https://static.metacritic.com/images/products/movies/1/66f6608a0310cf4a3e4c7f2190d18763-98.jpg", "https://static.metacritic.com/images/products/tv/7/23cf7c77f75f932de5ad18fa0142c724-98.jpg", "https://static.metacritic.com/images/features/networks/nbc20.png", "https://static.metacritic.com/images/features/networks/fox20.png", "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "https://static.metacritic.com/images/products/music/0/5ab703f43374c176ca247856465dccad-98.jpg", "https://static.metacritic.com/images/features/networks/showtime20.png", "https://static.metacritic.com/images/products/movies/1/dadac636aa14c3b9b9feea1ce09fb43e-98.jpg", "https://static.metacritic.com/images/products/games/5/f174e5f35cf726f0e75fa90ca3d9f83b-98.jpg", "https://static.metacritic.com/images/products/games/4/559d5752e81e5bd977817d9de26bfe4b-98.jpg", "https://static.metacritic.com/images/features/main/dvd_2020_04-50.jpg", "https://www.metacritic.com/media/networks/cw20.png", "https://static.metacritic.com/images/features/_graphics/special.gif", "https://static.metacritic.com/images/features/networks/cbs20.png", "https://static.metacritic.com/images/features/networks/amc20.png", "https://static.metacritic.com/images/features/main/peacock202004-50.jpg", "https://static.metacritic.com/images/features/main/coronavirusdelays-28.jpg", "https://static.metacritic.com/images/features/networks/hbo20.png", "https://static.metacritic.com/images/products/games/2/fc2b1036e9ce9e224d11e32d5571a5bc-98.jpg", "https://static.metacritic.com/images/products/games/5/e5d85ca5a8ec5a987c8d6fd04625ec14-98.jpg"], "top_img": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.metacritic.com/feature/tv-premiere-dates", "title": "2020 Spring/Summer TV Premiere Calendar", "meta_data": {"description": "Find a calendar of premiere dates for all upcoming new and returning television shows, plus TV movies and specials. - Page 2", "viewport": "width=1024", "application-name": "Metacritic", "msapplication-TileColor": "#000000", "msapplication-TileImage": "/images/win8tile/76bf1426-2886-4b87-ae1c-06424b6bb8a2.png", "og": {"title": "2020 Spring/Summer TV Premiere Calendar", "type": "article", "url": "https://www.metacritic.com/feature/tv-premiere-dates", "image": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "site_name": "Metacritic", "description": "Find a calendar of premiere dates for all upcoming new and returning television shows, plus TV movies and specials."}, "fb": {"app_id": 123113677890173}, "twitter": {"site": "@metacritic", "creator": "@metacritic", "card": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg"}}, "movies": [], "publish_date": null, "source": "https://www.metacritic.com", "summary": ""}