{"url": "https://www.marieclaire.com/beauty/how-to/a7053/how-to-wash-your-face/", "text": "Most of us assume that cleansing your face is a task so basic it can be accomplished even when you're completely exhausted or slightly tipsy—which, of course, it can. (All the snaps for you if you’ve successfully cleansed your skin before bed to avoid the terror that is waking up with last night’s mascara on.) But it turns out that there's a lot more to washing your face than soap and water, says Dr. Doris Day, NYC dermatologist and author of Forget the Facelift. \"With so many sophisticated, gentle cleansers that won't strip the skin, using the right one allows moisturizing and anti-aging products to absorb more effectively.\"\n\nClearly, an old-school splash and scrub won't do. In order for your cleanser to truly do its thing, there’s a few guidelines that just can’t be compromised…and, in addition, myths floating around that need to be addressed.\n\nEspecially with the rise in cleanser innovations and the popularity of 15-step skincare routines, misinformation can be spread quick. Ahead, we spoke with some of the top dermatologists to set all the cleansing facts straight and share how to execute this very important step in your routine the right way. Read on for the new rules for getting your freshest face.\n\nMyth 1: Wash and Go\n\nIt's more of a two-step process. \"Remove your makeup before you wash your face,\" says Montclair, New Jersey, derm Dr. Jeanine Downie. \"Many cleansers can't take off concealer or foundation completely, especially around the eyes and nose.\" Use an oil-based cream, an emollient wipe, or a cleansing oil to dissolve stubborn sunscreen and makeup. Follow with lukewarm water and a dime-size amount of cleanser (look for the ingredients cocamidopropyl betaine or caprylic triglyceride, which are sulfate-free surfactants) on your fingers or a clean, damp washcloth.\n\nMyth 2: Wash Twice a Day\n\nWhile the jury is still out on how often to cleanse (every a.m. and p.m. or just once at night), all derms agree that over-washing can lead to irritation and a lack of moisture. \"The reality is most people apply some sort of night cream or serum; you want to make sure to get that off before applying your a.m. products. In the morning, it's beneficial to use a gentle cleanser such as Cetaphil and at night double cleanse with an oil-based cleanser before following up with a more active exfoliative wash,\" says New York City dermatologist Dendy Engelman.\n\nThe rule is to use common sense: Always wash your face after a workout to prevent breakouts, and wash excessively oily skin morning and night. For very dry or sensitive skin, stick to cleansing once daily in the evening. \"Be careful of over-washing the skin, as this can really strip the face of natural oils and natural lipids, which leads to irritation,\" says Dr. Tiffany Libby, assistant professor of dermatology at Brown University.\n\nMyth 3: You Cleanse to Close Your Pores\n\nSorry, folks, but you can skip rituals like massaging your face to increase circulation or splashing with cold water to \"close\" your pores. \"Pores don't open and close,\" says Downie. In fact, extreme hot or cold can exacerbate problems like rosacea and redness. That said, mild steam can help soften hardened oil in pores, so it's never a bad idea to cleanse in the shower. And \"while it feels nice, massage doesn't do much,\" adds Downie. \"Exercise is what boosts your circulation.\"\n\nMyth 4: Buy Cleanser According to Skin Type\n\nNo matter what kind of skin you have, make sure the ingredients list doesn't contain fragrance, which can be irritating; parabens (potentially toxic preservatives); or harsh soap (it's drying). \"If a cleanser fits that bill, the formula itself [cream, lotion, foaming, etc.] is more a matter of personal preference,\" says NYC dermatologist Dr. Brad Katchen. Of course, people with dry skin may prefer formulas with added moisturizers, like glycerin or shea butter. And \"if you have oily skin, you might want a foaming wash that leaves skin feeling super clean,\" says Day. The American Academy of Dermatology also recommends avoiding alcohol in cleansers that can be abrasive to skin.\n\nMyth 5: Grainy Scrubs Are the Best Smoothing Exfoliants\n\nA salicylic- or glycolic-acid cleanser is gentler and more effective than grainy scrubs, and both offer anti-aging benefits and help prevent breakouts. Alternate these with your regular cleansers (start with three times a week), and adjust depending on how your skin is looking and feeling. The usage of acids on the skin can aid in unclogging the pores and minimizing their appearance. \"Gently exfoliate and smooth the texture of the skin with alpha hydroxy acid (AHA) and beta hydroxy acid (BHA). These gentle exfoliative acids help to clear out debris and further minimize the appearance of the pore\", adds Libby.\n\nMyth 6: Use Alcohol-Based Toner\n\n\"An alcohol-based toner strips off natural oils,\" explains Day. Not good. \"Gentle toners calm the skin and balance pH levels, but with the right cleanser, you don't really need this step.\" Love the feeling of toning anyway? Other dermatologists would agree the step of applying toner is one you shouldn't skip, as it aids with allowing products to follow absorb more effectively into the layers of your skin. Choose gentle, alcohol-free toners instead.\n\nMyth 7: Use Cleansing Brushes Daily for a Healthy Glow\n\n\"A brush removes oil, dirt, and dead skin better than your hands can, and it's less aggressive than most exfoliating cleansers or scrubs,\" says Day. \"But it's not something you have to use every night, especially if you're also applying ingredients like retinoids or acids. Too much exfoliation can cause inflammation.\" Basically: Use, but use sparingly. (Right now we're obsessed with Clarisonic's new acne-cleansing brush head, below.) To keep your brush bacteria-free, rinse and air-dry after use. Oh, and hey, clean freak, like you do with your Brita, replace the brush head every three months. Beware of pressing down too hard on the skin when using a facial brush.\"Being too harsh with a brush can cause micro-injury and acne from the over-manipulation of the skin,\" adds Engelman.\n\nMyth 8: Good Skincare Costs a Fortune\n\nSave your pricier ingredients, like retinol or antioxidants, for leave-on products instead of for cleansers, which you're literally washing down the drain. \"[These ingredients are] most effective when they stay concentrated on the skin,\" says Katchen.\n\nShop Our Favorite Cleansing Products:\n\nFor more stories like this, including celebrity news, beauty and fashion advice, savvy political commentary, and fascinating features, sign up for the Marie Claire newsletter.\n\nsubscribe here", "images": ["https://hips.hearstapps.com/mac.h-cdn.co/assets/16/01/4000x2000/landscape-1452119660-how-to-wash-face.jpg?resize=1200:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-6522-000207-web-1585227207.jpg?crop=1.00xw:0.373xh;0,0.335xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/stocksy-txp85c6cf7amhw200-medium-2534521-2-1573166024.jpg?crop=0.699xw:0.526xh;0.196xw,0.339xh&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/mac.h-cdn.co/assets/16/01/4000x2000/landscape-1452119660-how-to-wash-face.jpg?resize=1200:*", "keywords": [], "authors": ["Gina Way", "Chelsea Hall", "Chelsea Hall Is The Assistant Fashion", "Beauty Editor At Marie Claire", "Where She Covers Celebrity Style", "Fashion Trends", "Skincare", "Makeup", "Anything Else Tied Into The World Of Fashion"], "canonical_link": "https://www.marieclaire.com/beauty/how-to/a7053/how-to-wash-your-face/", "title": "Tips for Facial Cleansing From Experts", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Marie Claire", "title": "This Is the Correct Way to Wash Your Face, According to Experts", "description": "The eight commandments of cleansing.", "url": "https://www.marieclaire.com/hair-beauty/how-to/how-to-wash-your-face", "image": {"identifier": "https://hips.hearstapps.com/mac.h-cdn.co/assets/16/01/4000x2000/landscape-1452119660-how-to-wash-face.jpg?resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 128598260542816, "pages": 10799255126}, "article": {"publisher": "https://www.facebook.com/MarieClaire", "modified_time": "2020-04-08 04:11:44", "published_time": "2020-04-08 04:11:00", "section": "Beauty", "opinion": "false"}, "twitter": {"site": "@marieclaire", "card": "summary_large_image", "image": "https://hips.hearstapps.com/mac.h-cdn.co/assets/16/01/4000x2000/landscape-1452119660-how-to-wash-face.jpg?resize=640:*"}, "google-site-verification": "21t3kl6tV4kpBdF4RZeyQAZd2D32Yzv-g9TAHaxCVvE", "title": "How To Wash Your Face | Tips for Facial Cleansing From Experts", "description": "When it comes to washing your face, some people like soap and water, others like to use 7 products. Neither is right.", "keywords": "acne prevention,skincare,clean face,face washing tips,skin tips,how to wash your face", "auto-publish": "evergreen", "thumbnail": "https://hips.hearstapps.com/mac.h-cdn.co/assets/16/01/3200x3200/square-1452119660-how-to-wash-face.jpg?resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Beauty,beauty,skin tips and advice,skin care", "sailthru.date": "2020-04-08T16:11:00Z", "sailthru.image.full": "https://hips.hearstapps.com/mac.h-cdn.co/assets/16/01/4000x2000/landscape-1452119660-how-to-wash-face.jpg", "sailthru.image.thumb": "https://hips.hearstapps.com/mac.h-cdn.co/assets/16/01/3200x3200/square-1452119660-how-to-wash-face.jpg", "sailthru.socialtitle": "This Is the Correct Way to Wash Your Face, According to Experts", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1586290260.0, "source": "https://www.marieclaire.com", "summary": ""}