{"url": "https://www.independent.co.uk/arts-entertainment/music/news/donald-trump-inauguration-ceremony-artists-performing-elton-john-legend-celine-dion-a7492991.html", "text": "With only a month to go before the big day, Donald Trump and his team's attempts to find artists to perform at his inauguration ceremony are looking increasingly desperate.\n\nAs with several other aspects of his presidential campaign process, the lead-up to the ceremony has been filled with embarrassing gaffes and miscommunication.\n\nIt is currently unclear as to whether Trump will succeed in securing any high profile singers to perform on the day.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nSo far the very short list of confirmed acts is comprised of America's Got Talent runner-up Jackie Evancho, The Rockettes (the announcement of which has prompted considerable controversy), and the Mormon Tabernacle Choir.\n\nWhat we do know for sure is that there is a fairly big (and still growing) list of major artists who definitely won't be performing on the day.\n\nHere is who has declined so far:\n\nElton John\n\nThis rumour was started by Anthony Scaramucci of the Trump transition team, who claimed that Trump would be \"the first American president in US history that enters the White House with a pro-gay-rights stance. Elton John is going to be doing our concert on the mall for the inauguration.\"\n\nThat sounded pretty definite. Unfortunately John's publicist Fran Curtis came straight back with a statement to the New York Times: \"Incorrect. He will NOT be performing.\"\n\nJohn added his own thoughts in an interview with the Guardian, where he said: \"I don't really want my music to be involved in anything to do with an American election campaign.\n\n\"I'm British. I've met Donald Trump, he was very nice to me, it's nothing personal, his political views are his own, mine are very different, I'm not a Republican in a million years. Why not ask Ted f***ing Nugent? Or one of those f***ing country stars? They'll do it for you.\"\n\nAndrea Bocelli\n\nIn early December it looked very likely that Bocelli would duet with America's Got Talent runner-up Jackie Evancho. Due to a serious backlash from his fans, however, Bocelli has reportedly pulled out of any potential performance.\n\nIce T\n\nAn odd one considering everything that Donald Trump's campaign said about Black Lives Matter and hip hop - more so when you consider the fact that Ice T penned a song called 'Cop Killer' which was written as a protest against police brutality.\n\nBut Ice T claims that the team did reach out to him, or at least joked about what would happen if they did.\n\nHe wrote on Twitter: \"I just got [called] to perform at the inauguration. I didn't pick up and blocked the number.\"\n\nCeline Dion\n\nAccording to reports, Celine Dion didn't decline Trump because she didn't want to perform, but more because she was just too busy.\n\nDion is scheduled to perform at the Colosseum at Caesar's Palace in Las Vegas on the day of the inauguration ceremony (20 January) and is unlikely to cancel due to fierce loyalty to her fans.\n\nJohn Legend\n\nJohn Legend has been vocal about the US election from the start. Asked for his opinion on why Trump was having so much difficulty in finding talent for the ceremony, he told the BBC: \"Creative people tend to reject bigotry and hate.\n\n\"We tend to be more liberal-minded. When we see somebody that's preaching division and hate and bigotry, it's unlikely that he'll get a lot of creative people that want to be associated with him.\"\n\nAdam Lambert\n\nAdam Lambert was fairly diplomatic when asked about whether he would perform at the inauguration for Trump, considering his active campaigning for LGBTQ rights and the appalling record Trump's current campaign team has on the same issues.\n\n\"I don't think I would take money on that one,\" he told the BBC. \"I don't think I'd be endorsing that. They might struggle.\"\n\nThe Dixie Chicks\n\nSpeaking to The Wrap, Dixie Chicks manager Simon Renshaw not only denied that the band would perform, but also gave an answer on the wider industry's reluctance to participate. \"No one is prepared to normalise what is going on in the country right now,\" he said.\n\n\"If anyone does do it, I hope that the cheque they get is in the nine figures. Because it's probably the last cheque they're ever going to get.\"", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2014/10/14/12/John-Legend.jpg", "https://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2014/10/14/12/John-Legend.jpg", "keywords": [], "authors": ["Roisin O'Connor"], "canonical_link": "https://www.independent.co.uk/arts-entertainment/music/news/donald-trump-inauguration-ceremony-artists-performing-elton-john-legend-celine-dion-a7492991.html", "title": "Donald Trump inauguration: Artists who won't perform at ceremony include Elton John, Celine Dion and John Legend", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "http://www.independent.co.uk/arts-entertainment/music/news/donald-trump-inauguration-ceremony-artists-performing-elton-john-legend-celine-dion-a7492991.html", "title": "All the artists refusing to perform at Donald Trump's inauguration", "description": "It looks increasingly unlikely that Trump will secure any high-profile artists to appear", "updated_time": "2016-12-23T19:20:30+00:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2014/10/14/12/John-Legend.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB", "video": {"identifier": "https://f1.media.brightcove.com/4/624246174001/624246174001_5259462870001_5259434493001.mp4?pubId=624246174001&videoId=5259434493001", "type": "application/octet-stream"}}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/7492991"}, "description": "With only a month to go before the big day, Donald Trump and his team's attempts to find artists to perform at his inauguration ceremony are looking increasingly desperate. As with several other aspects of his presidential campaign process, the lead-up to the ceremony has been filled with embarrassing gaffes and miscommunication.  It is currently unclear as to whether Trump", "keywords": "Celine Dion, Ice T, Dixie Chicks, John Legend, Adam Lambert, Donald Trump, presidential inauguration, News, Music, Culture", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Celine Dion", "published_time": "2016-12-23T15:44:00+00:00", "modified_time": "2016-12-23T19:20:30+00:00", "section": "News", "subsection": "Video", "author_name": "Roisin O'Connor", "content_type": "story", "word_count": 776, "image_count": 2, "video_count": 0, "embed_count": 0, "internal_link_count": 5, "external_link_count": 5}, "twitter": {"title": "All the artists refusing to perform at Donald Trump's inauguration", "description": "With only a month to go before the big day, Donald Trump and his team's attempts to find artists to perform at his inauguration ceremony are looking increasingly desperate. As with several other", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1482507840.0, "source": "https://www.independent.co.uk", "summary": ""}