{"url": "https://www.vox.com/the-goods/2018/10/15/17978152/ariana-grande-pete-davidson-split-engagement-ring", "text": "The greatest love story of our time 2018 has ended, TMZ reports. Pop singer Ariana Grande and Saturday Night Live cast member Pete Davidson called off their engagement over the weekend, leaving many, many people wondering who will get custody of their pet pig, what they will do about their matching tattoos, and, most pressingly, what will become of the $93,000 pear-shaped diamond ring that Davidson bought for Grande.\n\nPeople on Twitter were fixated specifically on the question of whether Davidson would be able to get the ring back, since it cost so very much. They didn’t have to waste away in limbo for long: TMZ reported in the wee hours of Tuesday morning that Grande had already returned it. But, clearly, this situation was about a lot more than a diamond ring.\n\nWho?\n\nFamous people get together and break up all the time, so it’s important to know that this isn’t just any celebrity romance. Grande and Davidson’s relationship captivated onlookers because of its speed, intensity, and incredibly public nature. It was also surprising, since Grande is, well, much more famous than Davidson.\n\nThey got together in late May, shortly after breaking up with partners they dated for multiple years — the rapper Mac Miller and Cazzie David, Larry David’s daughter, respectively — and fanned the flames of the public’s interest by flirting via Instagram comments. They got numerous tattoos for one another. After roughly one month of dating, they were engaged.\n\nThe usual rites of courtship happened at warp speed, magnified by Grande and Davidson’s visibility and collective wealth. They adopted a pig and named it Piggy Smalls. They moved into a $16 million apartment in New York together. Grande titled the penultimate song on her album Sweetener “pete davidson” — not something most people do in a relationship, but notable nonetheless.\n\nIt all seemed so unwise! So soon! But also ... so fun, a spectacle played out on social media, where anyone with an Instagram account could follow their declarations of love. Davidson confirmed the engagement to Jimmy Fallon on The Tonight Show, saying, “It’s fucking lit, Jimmy.” At the time, it kind of was.\n\nIn September, Mac Miller, Grande’s ex, died at age 26. Grande, who expressed her grief in an Instagram note later that month, has since canceled appearances at a benefit gala and on the season premiere of SNL, which replaced her with Kanye West.\n\nWhen Davidson and Grande broke up this weekend, it might not have been a huge surprise, but Twitter nonetheless went into overdrive. Of course it did: Fans were here for the romance, and they’re here for the breakup. But beyond the emotional difficulties at hand, the question people really wanted answered was, who gets to keep that ridiculously expensive ring?\n\nSo who gets to keep that ridiculously expensive ring?\n\nOn Monday, celebrity sites were already reporting that Grande planned to give the ring back to Davidson, and according to TMZ, that’s what she did. (But Piggy Smalls remains in Grande’s custody.) That seems like the reasonable thing to do, and New York courts would agree, since the state considers engagement rings to be contracts, not gifts.\n\nBut it is telling that we’re so obsessed with the question. For most of us, the $93,000 ring, crafted by Manhattan-based jeweler Greg Yuna, seems like a massive financial investment — an exorbitant purchase that echoes the all-in nature of Grande and Davidson’s early relationship. The fate of that ring is just one more piece of this unbelievable romance. (Yuna’s business has not responded to request for comment about whether it accepts returns on engagement rings.)\n\nThere’s something else happening here, though. A lot of people on Twitter have expressed joking concern over Davidson’s finances, saying that he’s going to want the ring back so that he can pay his bills again.\n\nPete Davidson stealing that diamond ring from @ArianaGrande so he doesn’t have to eat off of the dollar menu for the rest of his life! pic.twitter.com/Yy7LjAZhcu — Dawndi (@Dawn24903615) October 14, 2018\n\npete davidson have to move to a one bedroom apartment now and pay rent sksksksklsk and he’s not even done paying for that engagement ring — joysé outsold (@stansroseanne) October 14, 2018\n\nPete Davidson realizing he can pay his bills this month by selling his engagement ring pic.twitter.com/2W6MwYCSdl — ✨David✨ (@SimplyDavie) October 15, 2018\n\nim so amused by all the tweets about pete davidson being poor now even though we all know he's rich enough to give her a 100k ring — spooky michelle (@michellelailai) October 15, 2018\n\nTo be clear: None of us know what’s up with Davidson’s finances. He probably makes a good salary on SNL, but that’s about as much as you can say! It seems like these comments have less to do with Davidson’s income and more with Davidson’s income in relation to Grande’s.\n\nGrande is massively successful — her albums, much like her hair, are certified platinum — and she definitely makes more than Davidson does. Their income disparity flips on its head the societal norm that says men in heterosexual relationships should be the breadwinners. Suggesting that Davidson is broke stretches those stereotypes even further: If a man isn’t making as much as his female partner, he must be a complete failure. He must be financially reliant.\n\nThere was a real power imbalance in Davidson and Grande’s relationship, and that was one of the reasons people followed it so avidly. (The desire to understand what each party was bringing to the table is also related to the advent of the phrase “Big Dick Energy.”) Grande was a world-famous pop star; Davidson was a sketch comedian who hadn’t yet crossed over into mainstream Hollywood in the way that SNL alums like Will Ferrell or Amy Poehler have. In a way, Grande was Davidson’s big break, and on the late-night talk show circuit, he wasn’t shy about the differences in their career status.\n\n“We got a pig. Yo, can I just say, this girl, she was like, ‘I want a pig!’ And then an hour later, it was just there,” Davidson said on Late Night With Seth Meyers in September. “You know what I mean? I’m still trying to get a Propecia refill ... this girl got a pig in an hour.”\n\nAnd in a GQ interview published in August, Davidson expressed a certain hesitance to call their apartment his own:\n\nDavidson and Grande recently moved into a Manhattan apartment that reportedly cost $16 million. She bought the place, Davidson says, and he stocks the fridge. “She’s really sweet. She’s like, ‘This is our house,’ and I’m like, ‘You’re very nice for saying that. Thank you for letting me stay here,’ “ he deadpans. “She’s like, ‘We’re getting married!’ And I’m like, ‘I know, thank you for letting me stay here.’ “\n\nOn Monday, someone started a GoFundMe to give Davidson money for housing, though the page was removed that day.\n\nOf course, when people express faux concern over Davidson’s finances, they might also be assuming that since Grande and Davidson rushed into a romantic relationship, one or both of them might also make rash financial decisions that they can’t actually fund. Onlookers might be conflating Davidson’s mental health challenges, which he’s been open about, with an inability to manage money.\n\nThe fact is, we don’t really know what’s up. Only this: Love is dead.", "images": ["https://cdn.vox-cdn.com/uploads/chorus_image/image/66670451/1210070405.jpg.0.jpg", "https://cdn.vox-cdn.com/thumbor/__l4WsEgiJ0pNtVaO6WobS-hYs8=/0x14:3000x1585/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13272747/GettyImages_1020376134.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66670249/GettyImages_1218880371.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66671059/GettyImages_1210050360.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667959/1219262470.jpg.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66670298/fionaapple3000.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_asset/file/12880947/sandbox_TheGoods_Logo_HypeType_final_Black.0-1.0.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAUEBAAAACwAAAAAAQABAAACAkQBADs", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66670574/1210300395.jpg.0.jpg", "https://cdn.vox-cdn.com/thumbor/tB_w9jnYgh5zlbXxnZ3FSAl9KkI=/0x0:3000x2091/1200x800/filters:focal(1385x559:1865x1039)/cdn.vox-cdn.com/uploads/chorus_image/image/61781009/GettyImages_1020376134.0.jpg"], "top_img": "https://cdn.vox-cdn.com/thumbor/__l4WsEgiJ0pNtVaO6WobS-hYs8=/0x14:3000x1585/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13272747/GettyImages_1020376134.jpg", "keywords": [], "authors": ["Eliza Brooke", "Jag Bhalla", "German Lopez", "Li Zhou", "Aaron Rupar", "Emily Todd Vanderwerff", "Dylan Scott", "Oct", "Davidson", "Grande Recently Moved Into A Manhattan Apartment That Reportedly Cost"], "canonical_link": "https://www.vox.com/the-goods/2018/10/15/17978152/ariana-grande-pete-davidson-split-engagement-ring", "title": "Pete Davidson and Ariana Grande split: what happens to the ring?", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Vox", "article": {"publisher": "https://www.facebook.com/Vox", "published_time": "2018-10-15T17:30:02-04:00", "modified_time": "2018-10-16T10:35:45-04:00"}, "author": "Eliza Brooke", "style-tools": "https://www.vox.com/style/community/441/dd55371d9ef76d5d505f37d268e3aefb/tools.css", "p": {"domain_verify": "d4410485bd6277c2bf2ce0f277819dc6"}, "msvalidate.01": "D385D0326A3AE144205C298DB34B4E94", "ahrefs-site-verification": "1e57a609922037a3fbdc1c22efd7334113f174f15608f37e1b8538a7b4ce64c3", "description": "More importantly, why do we care so much?", "og": {"description": "More importantly, why do we care so much?", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/__l4WsEgiJ0pNtVaO6WobS-hYs8=/0x14:3000x1585/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13272747/GettyImages_1020376134.jpg", "alt": "Davidson and Grande hold hands at an event.", "height": 630, "width": 1200}, "site_name": "Vox", "title": "Pete Davidson and Ariana Grande broke up. But what about the $93,000 engagement ring?", "type": "article", "url": "https://www.vox.com/the-goods/2018/10/15/17978152/ariana-grande-pete-davidson-split-engagement-ring"}, "fb": {"app_id": 549923288395304}, "twitter": {"card": "summary_large_image", "url": "https://www.vox.com/the-goods/2018/10/15/17978152/ariana-grande-pete-davidson-split-engagement-ring", "title": "Pete Davidson and Ariana Grande broke up. But what about the $93,000 engagement ring?", "description": "More importantly, why do we care so much?", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/vowlmB8x4FtIlybA1bKz8pl9POk=/0x49:3000x1549/fit-in/1200x600/cdn.vox-cdn.com/uploads/chorus_asset/file/13272747/GettyImages_1020376134.jpg", "alt": "Davidson and Grande hold hands at an event."}, "site": "voxdotcom"}, "sailthru.title": "What has become of the engagement ring Pete Davidson gave Ariana Grande?", "sailthru.tags": "general,vox,front-page,celebrities,culture,category-news,the-goods", "sailthru.description": "More importantly, why do we care so much?", "sailthru.date": "2018-10-15T17:30:02-04:00", "sailthru.image.full": "https://cdn.vox-cdn.com/thumbor/E2QvBg435XU1jXac0-NwSR_6ZS0=/0x0:3000x1688/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/61781007/GettyImages_1020376134.0.jpg", "sailthru.image.thumb": "https://cdn.vox-cdn.com/thumbor/jzJlYNBas_BW9S2VtRQcVALKf30=/580x0:2671x2091/200x200/cdn.vox-cdn.com/uploads/chorus_image/image/61781007/GettyImages_1020376134.0.jpg", "msapplication-TileImage": "https://cdn.vox-cdn.com/uploads/hub/sbnu_logo_minimal/441/touch_icon_ipad_retina_1000_yellow.755.png", "msapplication-TileColor": "#4f7177", "outbrainsection": "category-news"}, "movies": [], "publish_date": 1539532800.0, "source": "https://www.vox.com", "summary": ""}