{"url": "https://en.wikipedia.org/wiki/Arie_Luyendyk_Jr.", "text": "This article is about the racing driver. For his father, see Arie Luyendyk\n\nArie Luyendyk Jr. ( ; Dutch: [ˈaːri ləjɛnˈdik]; born September 18, 1981) is a Dutch-American auto racing driver and son of two-time Indianapolis 500 winner Arie Luyendyk. He has competed mostly in North America where his father lives and made his career. Luyendyk is best known for competing in the Indy Lights Series where he finished 2nd, 3rd and 4th in the Championship over a number of years. He was named a test-driver in A1 Grand Prix alongside Jeroen Bleekemolen for A1 Team The Netherlands starting the 2007–08 season.[2]\n\nLuyendyk has competed in various sports-car series competing in the 12 Hours of Sebring and the 24 Hours of Daytona.\n\nHe was a contestant on ABC's dating competition The Bachelorette season 8 in 2012, where he placed first runner-up, and starred in the 22nd season of its sister show The Bachelor, which premiered on January 1, 2018.\n\nEarly life [ edit ]\n\nLuyendyk was born in The Netherlands,[3] to Arie and Mieke Luyendyk.[4] At age 3,[3] he immigrated with his family, including sister Maida, to the United States and settled in Brookfield, Wisconsin. Luyendyk has two younger twin brothers, Alec and Luca.[4]\n\nCareer [ edit ]\n\nLuyendyk began racing karts in 1992, and moved to Sports Car Club of America club Formula Ford competition six years later at the age of 16. He raced in a number of American junior formulae, notching wins in the Skip Barber Formula Dodge series and top five finishes the U.S. Formula Ford 2000 Championship. In 2001, Luyendyk finished third in the Formula Continental class at the SCCA National Championship Runoffs as well as winning the SCCA Southern Pacific divisional title on the strength of four wins in that same class.[citation needed]\n\nHe competed full-time in the first three seasons of the Indy Racing League's Indy Pro Series (now known as Firestone Indy Lights), beginning in 2002. In his Firestone Indy Lights career, Luyendyk has 1 victory, four pole positions and 24 top-5 finishes. Luyendyk finished second in the Firestone Indy Lights Championship in 2002, third in 2004, and fourth in 2008.[citation needed]\n\nIn 2005, Luyendyk attempted to make his IndyCar Series debut by qualifying for the 2005 Indianapolis 500 in a car owned by Curb-Agajanian/Beck Motorsports. Luyendyk's qualifying speed of 215.039 mph (346.072 km/h) was close to 2 mph (3.2 km/h) slower than the next slowest qualifier at the time. A. J. Foyt hired driver Felipe Giaffone to qualify a third car for him, and Giaffone's 217.645 mph (350.266 km/h) four-lap average bumped Luyendyk from the field.\n\nLuyendyk did qualify for the 2006 Indianapolis 500 in a car owned by his father and backed by cheapcaribbean.com and Blue Star Jets. The team had limited practice time due to a second week engine program. However, his first race in the more powerful cars ended early due to handling issues, with Luyendyk finishing 54 laps out of 200 and ending in 28th place in the field of 33.[citation needed]\n\nIn the 2007–08 A1 Grand Prix season, Luyendyk drove for A1 Team Netherlands in the A1 Grand Prix World Cup of Motorsport as the team's \"rookie driver\". His best result was a fifth place training time at Round 5 held in Taupo, New Zealand. He has returned to the Firestone Indy Lights Series to race for AGR-AFS Racing as the teammate to Raphael Matos. He captured his first series win in the final race of the 2008 season at Chicagoland Speedway by passing Matos on a late race restart. Luyendyk would finish the 2008 season fourth in the Championship, recording five podium finishes.[citation needed]\n\nIn 2010, he returned part-time to Indy Lights and drove in the Freedom 100 for Andersen Racing and three other oval races for Alliance Motorsports. His best finish was seventh at Chicagoland.[citation needed]\n\nPro Light TORC truck at Crandon\n\nIn 2013, Luyendyk made the switch to off-road racing in the Stadium Super Trucks series,[5] finishing seventh in points. In his partial season Luyendyk notched a heat win and three 4th-place finishes in seven starts. Two years later, he won the bronze medal at X Games Austin 2015 in the SST category.[6]\n\nLuyendyk finished the season driving in the Traxxas TORC Series with Aero Motorsports backed by Ethika and Cooper Tires. In Luyendyk's TORC debut he finished fourth at Crandon International Off-Road Raceway driving in the Pro Light class. On November 18, 2013, Luyendyk completed a test with Dale Coyne Racing in the DW12 IndyCar. Luyendyk ran 138 laps.[citation needed]\n\nDuring the 2018 Stadium Super Trucks season, Luyendyk recorded his first series win at Barbagallo Raceway in Perth, Australia.[7] He scored a second victory at Detroit in June.[8]\n\nTelevision [ edit ]\n\nIn 2009, Luyendyk became the driver analyst for Versus broadcasts of Indy Lights races. In 2012 Luyendyk returned to the booth, commentating the Indy Lights races for the NBC Sports Network. He appeared as himself in season nine of Hell's Kitchen. The chefs visited the Grand Prix of Long Beach in which Luyendyk was participating.[citation needed]\n\nLuyendyk placed second on the eighth season of the reality show The Bachelorette, starring Emily Maynard.[9]\n\nLuyendyk appeared in the first episode of the 17th season of The Bachelor. Luyendyk also competed on Wipeout: Summer Episode 7: \"Bachelors vs. Bachelorettes\",[10] where he was eliminated early.\n\nIn 2017, it was announced that Luyendyk would appear in the 22nd season of The Bachelor. He asked Rebecca \"Becca\" Kufrin to marry him at the season finale however he later regretted rejecting Lauren Burnham, the runner-up, and tried to rekindle things with Burnham. Luyendyk and Kufrin broke up after the show, but the breakup was televised. Luyendyk revealed that he had been talking to Burnham, and later the two began dating. They got engaged during the After the Final Rose ceremony in March 2018, and revealed in November that Burnham was pregant. [11] They married in Maui, Hawaii on January 12, 2019.[12]\n\nPersonal life [ edit ]\n\nLuyendyk works as a real estate broker for RE/MAX in Scottsdale, Arizona.[13] He became engaged to the runner-up, Lauren Burnham of The Bachelor[14][15] and Burnham moved to Scottsdale to be with Luyendyk.[16] The couple married in January 2019.[17] They have a daughter, Alessi Ren, born in May 2019.[18] He appeared as an agent on a 2019 episode of HGTV's House Hunters International set in Amsterdam.[19] The former Bachelor lives at home with his wife and daughter and dog Bastian.\n\nRacing record [ edit ]\n\nSCCA National Championship Runoffs [ edit ]\n\nYear Track Car Engine Class Finish Start Status 2000 Mid-Ohio Van Diemen RF01 Ford Formula Continental 3 2 Running\n\nAmerican open-wheel racing [ edit ]\n\n(key) (Races in bold indicate pole position)\n\nIndy Lights [ edit ]\n\nIndyCar [ edit ]\n\nYear Team 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 Rank Points 2005 CURB/Agajanian/Beck Motorsports HMS PHX STP MOT INDY\n\nDNQ TXS RIR KAN NSH MIL MIS KTY PPIR SNM CHI WGL FON NC – 2006 Luyendyk Racing HMS STP MOT INDY\n\n28 WGL TXS RIR KAN NSH MIL MIS KTY SNM CHI 36th 10\n\nIndianapolis 500 [ edit ]\n\nYear Chassis Engine Start Finish Team 2005 Dallara Chevrolet DNQ Beck 2006 Panoz Honda 31 28 Luyendyk\n\nComplete A1 Grand Prix results [ edit ]\n\n(key) (Races in bold indicate pole position) (Races in italics indicate fastest lap)\n\nStadium Super Trucks [ edit ]\n\n(key) (Bold – Pole position. * – Most laps led.)", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/LuyundykFreedom100.jpg/220px-LuyundykFreedom100.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Race_Car_Driver_Arie_Luyendyk%2C_Jr.jpg/220px-Race_Car_Driver_Arie_Luyendyk%2C_Jr.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Crandon_2013_Pro_Light_25_Arie_Luyendyk_Jr_Crandon_2013.jpg/220px-Crandon_2013_Pro_Light_25_Arie_Luyendyk_Jr_Crandon_2013.jpg", "https://upload.wikimedia.org/wikipedia/commons/5/50/Race_Car_Driver_Arie_Luyendyk%2C_Jr.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Bronze_medal_icon_%28B_initial%29.svg/16px-Bronze_medal_icon_%28B_initial%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/23px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/ArieJr2005.jpg/220px-ArieJr2005.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/5/50/Race_Car_Driver_Arie_Luyendyk%2C_Jr.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Arie_Luyendyk_Jr.", "title": "Arie Luyendyk Jr.", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/5/50/Race_Car_Driver_Arie_Luyendyk%2C_Jr.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}