{"url": "www.cheatsheet.com/entertainment/jennifer-aniston-and-justin-theroux-the-real-reason-this-celebrity-couple-split-up.html/", "text": "It seemed like Jennifer Aniston finally got her happy ending, but her marriage to Justin Theroux has sadly met its end. After tying the knot on Aug. 5, 2015, the couple seemed to be blissfully wed. Rumors may have been circulating around bumps in their relationship, but we didn’t think they could be true.\n\nUnfortunately, some of the rumors were true — Aniston and Theroux are splitting up. A number of factors come into play with the demise of their relationship, but one, in particular, could be the real reason for their separation (No. 6).\n\n1. They announced their separation in a statement\n\nThe couple called it quits in early 2018. | Gabriel Bouys/AFP/Getty Images The couple called it quits in early 2018. | Gabriel Bouys/AFP/Getty Images\n\nAlthough Aniston and Theroux wanted to keep this time in their lives private, they felt it necessary to set the story straight. They released a joint statement about their separation on Feb. 15, 2018, which reads:\n\nIn an effort to reduce any further speculation, we have decided to announce our separation. This decision was mutual and lovingly made at the end of last year. We are two best friends who have decided to part ways as a couple, but look forward to continuing our cherished friendship.\n\n\n\nNormally we would do this privately, but given that the gossip industry cannot resist an opportunity to speculate and invent, we wanted to convey the truth directly. Whatever else is printed about us that is not directly from us, is someone else’s fictional narrative. Above all, we are determined to maintain the deep respect and love that we have for one another.\n\nNext: We could see it coming for these reasons.\n\n2. There were some warning signs\n\nThe two didn’t celebrate Jennifer Aniston’s birthday together. | Tim Mosenfelder/Getty Images The two didn’t celebrate Jennifer Aniston’s birthday together. | Tim Mosenfelder/Getty Images\n\nRumors had been circulating about their marriage being on the rocks, and granted, there were a few warning signs. For starters, couples will normally share a little birthday love for their spouse, but Theroux stayed silent on Aniston’s 49th birthday on Feb. 11, 2018.\n\nAniston has also been spotted numerous times without Theroux in the months before their separation announcement. Her Friends co-star, Courtney Cox, joined her for her birthday celebrations in Malibu — but Theroux was nowhere to be found.\n\nNext: They couldn’t ignore these differences.\n\n3. They had major differences from the start\n\nThe couple has always had their fair share of differences. | Valerie Macon/AFP/Getty Images The couple has always had their fair share of differences. | Valerie Macon/AFP/Getty Images\n\nAlthough Theroux and Aniston were very much in love, they had major differences from the start.\n\nA source told E! News, “Jennifer and Justin fell in love hard and fast and yet they were never really suited to one another. He was a New York hipster that loved the alternative lifestyle and Jennifer was living a much more reclusive life when they first started to fall in love.”\n\nThe source added, “The initial chemistry between them made it easy for them to ignore their differences and incompatibility.”\n\nNext: This might have kept them from splitting up sooner.\n\n4. They shared a sense of humor\n\nJennifer Aniston and Justin Theroux in Wanderlust | Universal Pictures Jennifer Aniston and Justin Theroux in Wanderlust | Universal Pictures\n\nBoth actors have major comedy chops and met while working on the comedy film Wanderlust together, so it comes as no surprise that “[t]hey love to laugh and share a wicked sense of humor.” They also love to joke about one another.\n\nIn an interview, Aniston lovingly referred to her husband as a “turkey.” And Theroux, when asked about what he would be getting Aniston for their second anniversary, teased, “Isn’t number two cotton? Am I supposed to get something cotton? So probably just a bag of cotton.”\n\nNext: Keeping up with Aniston’s lifestyle became too much.\n\n5. Theroux prefers keeping a lower profile\n\nJustin Theroux isn’t a fan of the spotlight. | Frederick M. Brown/Getty Images Justin Theroux isn’t a fan of the spotlight. | Frederick M. Brown/Getty Images\n\nBeing married to a Hollywood A-lister like Aniston means constantly being in the public eye — and it just wasn’t for Theroux. E! News noted, “Instead of walking around the streets of major cities without being bothered, the actor found the paparazzi following his every move. The photographers were especially present when he spent time in Los Angeles with Jennifer.”\n\n\n\nA source claimed, “He absolutely hated it at first,” but his love for Aniston drove him to accept his new life. However, “Everyone around him knew it wasn’t really who he was.”\n\nNext: This is the main reason they split up.\n\n6. They had different ideas on where to live\n\nThe couple had different opinions on where to live. | Mark David/Getty Images The couple had different opinions on where to live. | Mark David/Getty Images\n\nAniston and Theroux’s general differences were major factors in their split, but their inability to agree on where to live ultimately drove them apart. New York is home to Theroux, and he wasn’t willing to give up his life there. Aniston, on the other hand, was set on living in Los Angeles. According to a source for Entertainment Tonight, “[Theroux] much prefers being [in New York] and that’s been a major issue for them for a long time.”\n\nThe couple gave living in New York a try by moving into an apartment in the West Village, and “he really wanted her to be comfortable.” The source added, “He even negotiated with the paps to make a deal that they would only shoot her once per day and then leave her alone. He also agreed to move out of his apartment, which he loves.”\n\nDespite the fact that Aniston grew up in New York and found her beginnings as an actor there, “she just never really could get settled in, she wasn’t happy [in New York].”\n\nNext: Friends can sometimes see what we can’t.\n\n7. Theroux’s friends weren’t completely on board\n\nThe two weren’t as compatible as they seemed. | Pascal Le Segretain/Getty Images The two weren’t as compatible as they seemed. | Pascal Le Segretain/Getty Images\n\nIt’s hard to see real problems when you don’t want them to be there, but Theroux’s friends could see their differences from the beginning. According to a source for E! News, “They have always just been two very different people with very different characters who just happened to fall in love.”\n\nThe source added, “He’s more nomadic, more of a free spirit, he’s rugged and urban and Jennifer just isn’t that kind of person.”\n\nNext: They did their best to make it work.\n\n8. They did their best to roll with the punches\n\nSometimes life gets the best of us. | Jason Merritt/Getty Images Sometimes life gets the best of us. | Jason Merritt/Getty Images\n\nAs it turns out, Aniston is quite the home-improvement expert. In an interview with actress and friend Amy Sedaris, she said about renovating, “I love it. I’m getting antsy to do another project.”\n\nDespite her taking the reigns, it sounds like Theroux was usually on board with this hobby. Aniston told Sedaris, “We walked in one day after they’d been doing the demo, and he was like, ‘Holy shit. What are we doing?’ And I was like, ‘We’re redoing the house, babe. We gotta take the wall down to put up a nicer one.’”\n\nNext: This was bound to happen.\n\n9. Their love faded over time\n\nTheir relationship became strained over time. | Dimitrios Kambouris/Getty Images Their relationship became strained over time. | Dimitrios Kambouris/Getty Images\n\nAniston and Theroux were truly in love, but it wasn’t enough to keep them together forever. “They’ve had problems for a while. It’s just been a case of two people who were ultimately incompatible,” a source told E! News.\n\n“And as the love faded over time, it became harder and harder to bridge the differences between them.”\n\nAdditional reporting by Becca Bleznak.\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2016/06/Wanderlust-1024x750.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/09/GettyImages-491198722.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/02/GettyImages-645794214.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/02/GettyImages-509335382.jpg?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.cheatsheet.com/wp-content/uploads/2014/09/Jennifer-Aniston.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/02/GettyImages-667312932.jpg?x62514", "http://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2017/09/GettyImages-823201734.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/09/GettyImages-505443398.jpg?x62514", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2018/02/GettyImages-667312932.jpg", "https://www.cheatsheet.com/wp-content/uploads/2014/10/Justin-Theroux.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/02/GettyImages-667312932.jpg", "keywords": [], "authors": ["Chelsea Leary"], "canonical_link": "https://www.cheatsheet.com/entertainment/jennifer-aniston-and-justin-theroux-the-real-reason-this-celebrity-couple-split-up.html/", "title": "Jennifer Aniston and Justin Theroux: The Real Reason This Celebrity Couple Split Up", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/jennifer-aniston-and-justin-theroux-the-real-reason-this-celebrity-couple-split-up.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "After only two years of marriage, Jennifer Aniston and Justin Theroux have announced their separation. Is this the real reason for their split?", "og": {"locale": "en_US", "type": "article", "title": "Jennifer Aniston and Justin Theroux: The Real Reason This Celebrity Couple Split Up", "description": "After only two years of marriage, Jennifer Aniston and Justin Theroux have announced their separation. Is this the real reason for their split?", "url": "https://www.cheatsheet.com/entertainment/jennifer-aniston-and-justin-theroux-the-real-reason-this-celebrity-couple-split-up.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-06-04T17:00:07-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2018/02/GettyImages-667312932.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2018/02/GettyImages-667312932.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "celebrity relationships", "section": "Entertainment", "published_time": "2018-06-04T17:00:00-04:00", "modified_time": "2018-06-04T17:00:07-04:00"}, "twitter": {"card": "summary_large_image", "description": "After only two years of marriage, Jennifer Aniston and Justin Theroux have announced their separation. Is this the real reason for their split?", "title": "Jennifer Aniston and Justin Theroux: The Real Reason This Celebrity Couple Split Up", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/02/GettyImages-667312932.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1528146000.0, "source": "http://www.cheatsheet.com", "summary": ""}