{"url": "https://www.history.com/this-day-in-history/police-recover-elizabeth-smart-and-arrest-her-abductors", "text": "On March 12, 2003, 15-year-old Elizabeth Smart is finally found in Sandy, Utah, nine months after being abducted from her family’s home. Her alleged kidnappers, Brian David Mitchell, a drifter who the Smarts had briefly employed at their house, and his wife, Wanda Barzee, were charged with the kidnapping, as well as burglary and sexual assault.\n\nIn the middle of the night on June 5, 2002, Elizabeth Smart, then 14 years old, was taken at knifepoint from her bedroom in her parents’ house in the upscale Federal Heights neighborhood of Salt Lake City. Her captor slid into the house undetected after cutting open the screen of an open window. Elizabeth’s younger sister, Mary Katherine, with whom she shared her bedroom, was the only witness to the kidnapping. Mary Katherine did not inform her parents until two hours after the incident, frightened that the man might return for her if she called out to alert them. She was initially unable to identify her sister’s attacker.\n\nElizabeth was taken to a crude campsite in the woods just three miles from her family’s home–close enough that she could actually hear the voices of searchers calling for her in the days following her abduction. There, it is alleged that Mitchell, who calls himself Emmanuel and professes to be a prophet with his own Mormon sect, sexually assaulted her.\n\nAfter two months, Smart, who was forced to wear a wig and dress in a robe and veil, was taken to Salt Lake City and appeared in public, but was not recognized. From there, Mitchell and Barzee took Smart to San Diego, where they lived in a series of campsites and under bridges. Finally, the group returned to the Salt Lake City area and, just a couple of hours later, several people recognized Elizabeth. They reported their sightings to police, who immediately followed up on the lead and pulled over a car carrying Mitchell, Barzee and Smart.\n\nMost of the early police investigation into Elizabeth’s disappearance had focused on another suspect, Richard Ricci, who had also once worked as a handyman in the Smart home. Serving time in prison for a parole violation during the investigation, Ricci denied having any involvement in the kidnapping. The trail grew cold after Ricci died in prison of a brain hemorrhage on August 30. Finally in early February 2003, Mary Katherine Smart told her parents she believed another former worker at the Smart home, who called himself Emmanuel, might be Elizabeth’s captor and the Smarts relayed the information to authorities. On February 3, believing that the police were not taking Mary Katherine’s tip seriously, the Smart family called their own press conference to release a sketch of Emmanuel. Several days later, a man contacted police to inform them that Emmanuel was his disturbed stepfather, Brian David Mitchell, and that he believed him to indeed be capable of kidnapping. In the days before finding Elizabeth, the Smarts continued to criticize police for failing to devote enough energy to following up on the lead.\n\nWhen found, Smart, who called herself Augustine, most likely at the behest of Mitchell, initially denied to police that she was in fact Elizabeth Smart. Undeterred, police took her and her captors in separate cars to the Salt Lake City Police Department, where she was reunited with her family. On March 18, 2003, after Mitchell and Barzee were formally charged, Mitchell’s attorney announced that his client considered taking Elizabeth a call from God. It has since been reported that Mitchell believed Smart was his wife and that the young girl may have suffered from Stockholm syndrome during the nine-month ordeal, answering questions as to why she did not try to escape even though it seemed she had been presented with several opportunities.\n\nPolice later discovered that Mitchell had also attempted to kidnap Smart’s cousin several weeks after taking Elizabeth and added that crime to the list of charges against him. Mitchell was declared mentally unfit to stand trial in July 2005 and December 2006; Barzee, who filed for divorce from Mitchell in December 2004, was sentenced to 15 years in prison for her role in the kidnapping in November 2009. On May 25, 2011, after being ruled competent to stand trial in March 2010 and convicted that December, Mitchell was sentenced to life in federal prison.", "images": ["https://www.history.com/site/images/apple-touch-icon.png?v=2020-04-17-205441-3d5ce40-015427", "https://www.history.com/.image/cs_srgb%2Cq_auto:good/MTU1MTMxNjMyMzU1OTI3NTg1/logo-nav.png", "https://www.history.com/.image/cs_srgb%2Cq_auto:good/MTU3OTM4MTkyNjk0MTI2NTQy/section_header_art_small_signup.svg", "https://www.history.com/.image/c_fill%2Ccs_srgb%2Cfl_progressive%2Cq_auto:good%2Cw_1280/MTU3OTM5NzQ3NzQwNzIzMTUw/section_header_art_medium_be10-copy.jpg"], "top_img": "https://www.history.com/site/images/apple-touch-icon.png?v=2020-04-17-205441-3d5ce40-015427", "keywords": [], "authors": ["History.Com Editors"], "canonical_link": "https://www.history.com/this-day-in-history/police-recover-elizabeth-smart-and-arrest-her-abductors", "title": "Police recover Elizabeth Smart and arrest her abductors", "meta_data": {"referrer": "unsafe-url", "HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1", "apple-mobile-web-app-capable": "no", "apple-mobile-web-app-status-bar-style": "black", "format-detection": "address=no", "google-site-verification": "UJ5DYgSNH_M-jazMoGwLwZbRcROfBun_AtNyzptKT1U", "generator": "Tempest - www.saymedia.com", "pinterest": "nohover", "author": "History.com Editors", "description": "On March 12, 2003, 15-year-old Elizabeth Smart is finally found in Sandy, Utah, nine months after being abducted from her family’s home. Her alleged kidnappers,", "keywords": "Crime,March 12,2003,Topics", "section": "Topics", "sub-section": "Crime", "pagetype": "article", "item-id": "ci0230e53670072549", "published": "2009-11-13T16:29:14Z", "modified": "2020-03-10T20:42:27Z", "dcterms.rightsHolder": "A&E Television Networks, LLC. All Rights Reserved.", "dcterms.dateCopyrighted": 2020, "twitter": {"card": "summary_large_image", "url": "https://www.history.com/this-day-in-history/police-recover-elizabeth-smart-and-arrest-her-abductors", "description": "On March 12, 2003, 15-year-old Elizabeth Smart is finally found in Sandy, Utah, nine months after being abducted from her family’s home. Her alleged kidnappers,", "domain": "www.history.com"}, "og": {"type": "article", "url": "https://www.history.com/this-day-in-history/police-recover-elizabeth-smart-and-arrest-her-abductors", "title": "Police recover Elizabeth Smart and arrest her abductors", "description": "On March 12, 2003, 15-year-old Elizabeth Smart is finally found in Sandy, Utah, nine months after being abducted from her family’s home. Her alleged kidnappers,", "site_name": "HISTORY"}, "fb": {"pages": 8429246183}, "pinterest-rich-pin": "true", "apple-mobile-web-app-title": "HISTORY", "parsely-title": "Police recover Elizabeth Smart and arrest her abductors - HISTORY", "parsely-link": "https://www.history.com/this-day-in-history/police-recover-elizabeth-smart-and-arrest-her-abductors", "parsely-post-id": "ci0230e53670072549", "parsely-pub-date": "2009-11-13T16:29:14Z", "parsely-section": "Topics", "parsely-author": "History.com Editors", "parsely-tags": "Crime,March 12,2003,Topics", "sailthru.title": "Police recover Elizabeth Smart and arrest her abductors", "sailthru.date": "2009-11-13T16:29:14Z", "sailthru.author": "History.com Editors", "sailthru.tags": "Crime,March 12,2003,Topics", "sailthru.description": "On March 12, 2003, 15-year-old Elizabeth Smart is finally found in Sandy, Utah, nine months after being abducted from her family’s home. Her alleged kidnappers,", "phx": {"content-item-id": "ci0230e53670072549", "content-object-type": "ContentArticle"}}, "movies": [], "publish_date": 1258129754.0, "source": "https://www.history.com", "summary": ""}