{"url": "https://people.com/style/kim-kardashian-debuts-fragrance-bottle-inspired-her-naked-form-after-kanye-west-twitter-spree/", "text": "Kim Kardashian West just revealed her latest fragrance bottle and, as promised, it’s shaped like her body.\n\nOn Wednesday, the Keeping Up with the Kardashians star, 37, unveiled the bottle for her newest scent ‘KKW Body’ on social media.\n\nGet push notifications with news, features and more.\n\n“Alright guys, I want to show you my bottle for ‘KKW Body,'” Kardashian West said in her Instagram story, as she opened up a grey colored box, which featured a nude figure, inspired by her own body, inside.\n\n“So this is not the press box you guys, this is the regular box,” she continued. “I didn’t do press boxes because I wanted everyone to get this amazing box, I thought this was such a cool box within itself, that the bottle is like on a statue pedestal like a statue in a museum.”\n\nImage zoom Kim Kardashian’s new fragrance Kim Kardashian Instagram\n\nWant to keep up on the latest from PEOPLE? Sign\n\nup for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\nFor the past three days, the reality star has been posting a series of suggestive nude images to promote her fragrance, despite the drama surrounding her husband, Kanye West, who spent Wednesday on Twitter spree after some in his inner circle expressed concern about him.\n\nOn Monday, Kardashian West shared a photo, in which she’s posing topless with her arm across her chest, to announce the launch of the fragrance. “KKW BODY 4.30 by Vanessa Beecroft,” she captioned the snap, noting that controversial artist, Beecroft, is involved in the project.\n\nIn a separate post on Tuesday, Kardashian West shared a full-frontal nude picture of herself. In the behind-the-scenes photograph, the mom of three was covered in grey plaster, but that was not enough to cover her nether region or her nipples, so she was forced to blur out her private parts.\n\n“We took a mold of my body and made it a perfume bottle,” she captioned the revealing image.\n\nOn top of her upcoming KKW Fragrance launch, Kardashian West also teamed up with Lumee to design her own collection of Kimoji-covered cases, available now online.\n\nRELATED: Kim Kardashian Shares ANOTHER Nude Photo As Concerns for Husband Kanye West Grow\n\nBefore unveiling her new fragrance bottle, Kardashian West defended her husband, who has been making headlines for his ongoing Twitter spree, in a series of tweets of her own.\n\n“To the media trying to demonize my husband let me just say this… your commentary on Kanye being erratic & his tweets being disturbing is actually scary. So quick to label him as having mental health issues for just being himself when he has always been expressive is not fair,” she wrote.\n\nRELATED: Kanye West Has Had ‘Explosive’ Fights with Kris Jenner & Kim Kardashian Can’t ‘Control’ Him: Sources\n\nContinued Kardashian West: “Yesterday it was announced that Kanye had parted ways with some business people and media outlets made this about Kanye’s mental health. Rather than just a simple business decision. So I’m glad he tweeted about the state of his company and all of the exciting things happening.”\n\n“He’s a free thinker, is that not allowed in America?” she added. “Because some of his ideas differ from yours you have to throw in the mental health card? That’s just not fair. He’s actually out of the sunken place when he’s being himself which is very expressive.”\n\nImage zoom Gilbert Carrasquillo/Getty\n\nLooking for more style content? Click here to subscribe to the PeopleStyle Newsletter for amazing shopping discounts, can’t-live-without beauty products and more.\n\nKardashian West also addressed her husband’s series of tweets about Donald Trump in which he called the president his “brother” and said the two “are both dragon energy.” (“You don’t have to agree with Trump but the mob can’t make me not love him,” he said, though he clarified: “I’m not even political. I’m not a Democrat or a Republican.”)\n\n“When he spoke out about Trump… Most people (including myself) have very different feelings & opinions about this,” the mom of three said. “But this is HIS opinion. I believe in people being able to have their own opinions, even if really different from mine.”\n\n“He never said he agrees with his politics,” she added.\n\nLast but not least, Kardashian West praised her husband for being unique, even if he’s not universally liked.\n\n“Kanye will never run in the race of popular opinion and we know that and that’s why I love him and respect him and in a few years when someone else says the same exact thing but they aren’t labeled the way he is and you will all praise them!” she wrote. “Kanye is years ahead of his time.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkim-k-perfume-1-2000x1333.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fgettyimages-601892266-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkim-k-perfume-1-1333x2000b-1.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkim-k-perfume-1-2000x1333.jpg", "keywords": [], "authors": ["Mariah Haas"], "canonical_link": "https://people.com/style/kim-kardashian-debuts-fragrance-bottle-inspired-her-naked-form-after-kanye-west-twitter-spree/", "title": "Kim Kardashian Debuts 'KKW Body' Fragrance", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Beauty,Kanye West,Kim Kardashian,Music News,News,Style,TV,TV Watch", "news_keywords": "Beauty,Kanye West,Kim Kardashian,Music News,News,Style,TV,TV Watch", "description": "On Wednesday, Kim Kardashian West revealed her 'KKW Body' fragrance bottle, inspired by her naked form, on Instagram.", "og": {"title": "Kim Kardashian Debuts Fragrance Bottle Inspired by her Naked Form After Kanye West's Twitter Spree", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/style/kim-kardashian-debuts-fragrance-bottle-inspired-her-naked-form-after-kanye-west-twitter-spree/", "description": "Kim Kardashian West just revealed her latest fragrance bottle and, as promised, it’s shaped like her body. On Wednesday, the Keeping Up with the Kardashians&nbsp;star,&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkim-k-perfume-1-2000x1333.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/style/kim-kardashian-debuts-fragrance-bottle-inspired-her-naked-form-after-kanye-west-twitter-spree/", "description": "On Wednesday, Kim Kardashian West revealed her 'KKW Body' fragrance bottle, inspired by her naked form, on Instagram.", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkim-k-perfume-1-2000x1333.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/style/kim-kardashian-debuts-fragrance-bottle-inspired-her-naked-form-after-kanye-west-twitter-spree/", "title": "Kim Kardashian Debuts Fragrance Bottle Inspired by her Naked Form After Kanye West's Twitter Spree", "description": "On Wednesday, Kim Kardashian West revealed her 'KKW Body' fragrance bottle, inspired by her naked form, on Instagram.", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fkim-k-perfume-1-2000x1333.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}