{"url": "https://en.wikipedia.org/wiki/Agents_of_S.H.I.E.L.D._(season_5)", "text": "The fifth season of the American television series Agents of S.H.I.E.L.D., based on the Marvel Comics organization S.H.I.E.L.D., follows Phil Coulson and other S.H.I.E.L.D. agents and allies as they try to save the world from an apocalyptic future. It is set in the Marvel Cinematic Universe (MCU) and acknowledges the continuity of the franchise's films. The season was produced by ABC Studios, Marvel Television, and Mutant Enemy Productions, with Jed Whedon, Maurissa Tancharoen, and Jeffrey Bell serving as showrunners.\n\nClark Gregg reprises his role as Coulson from the film series, strring alongside returning series regulars Ming-Na Wen, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, and Henry Simmons. They are joined by Natalia Cordova-Buckley who was promoted from her recurring guest role since the third season. The fifth season was ordered in May 2017. Due to its broadcast schedule, the season was split into two \"pods\": the first sees the S.H.I.E.L.D. team transported to a future in which the Earth has been destroyed; in the second, they attempt to prevent this future in the present. The end of the season dovetails with the events of the film Avengers: Infinity War (2018). The season includes the series' 100th episode as well as Gregg's directorial debut for the series.\n\nThe fifth season premiered on December 1, 2017, and ran for 22 episodes on ABC until May 18, 2018. The two-part premiere debuted to 2.54 million viewers, marking a significant downturn from previous seasons. Despite consistently low viewership, critical reception of the season was positive, with many commending the series for its ambition, in particular praising the futuristic space setting during its first half and its exploration of time travel. The series was renewed for a sixth season in May 2018.[1]\n\nEpisodes [ edit ]\n\nCast and characters [ edit ]\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nIn January 2017, ahead of the mid-season premiere of the fourth season, ABC's Channing Dungey said that she was \"very bullish\" about S.H.I.E.L.D.'s future, feeling that \"the episodes just keep getting better and stronger\".[41] The series was renewed for a fifth season of 22 episodes on May 11, with ABC looking to lower the cost of the series moving forward,[42][43] by reducing its budget and licensing fee.[44] Asked whether she had considered giving the season a shorter episode order, Dungey noted that every season of the series had been 22 episodes long, and she felt its prior success in delayed viewership and overseas justified continuing that. She added that the \"show has continued to grow creatively every season. I feel like last season [was] its strongest creatively yet. I'm very excited for what we have planned for Season 5.\"[45] It was reported that Disney, the parent company of Marvel Television, ABC Studios, and ABC, had given a mandate to ABC to renew Agents of S.H.I.E.L.D. \"despite the desire by some at the network to end the series\".\n\nWriting [ edit ]\n\nIn May 2017, ahead of the fifth season renewal, showrunner and executive producer Jed Whedon said the writers were not sure what would happen in the season, and that it would be \"by the seat of our pants.\"[47] The season explores the ramifications of Phil Coulson making a deal with Ghost Rider at the end of the previous season, as well as the groundwork laid by Aida for humans to fear S.H.I.E.L.D. and Inhumans. Whedon stated, \"The public perception of S.H.I.E.L.D. is at an all-time low, so we have not resolved that, and there will be still more fallout from it.\"[48] Moving beyond the Framework reality established at the end of season four, Tancharoen said the emotional impact from the characters' experiences would \"be something that resonates throughout the season\", especially for Fitz and Mack.[49] When asked if the season would be broken into pods as with season four, executive producer Jeffrey Bell said, \"A 22-episode arc is a lot for people to hold onto. By breaking it up into either smaller arcs or different pods, by introducing a set of antagonists and putting them down, or moving from space to space, our experience has been that it's something the viewers enjoy, and it makes it a little easier to digest when you're telling some of these stories.\" However, Whedon noted that it would depend on how the season would be aired as to where the story is broken up.[48] The season ultimately was broken into two pod story arcs, with each pod having a different emphases, but the whole season having an arc \"that will pay off\".[50] The writers for the season began work at the end of May 2017.[24]\n\nFirst pod [ edit ]\n\nThe first pod of the season was informally referred to by the production team as S.H.I.E.L.D. in Space.[50] Ahead of the season premiere, executive producer Maurissa Tancharoen said that \"every year we reset the series, and this year we definitely knew that it would be the most giant reset to date [with the characters going to space]. Just creatively across the board for everyone, art direction, all of it, our sets, you'll see an overhaul.\"[51] On the move to space, Whedon commented, \"Last year was about tearing everybody apart. We spent a lot of time doing that ... So our goal this year was... putting [this] family together in an intense situation [that] will end up causing drama internally, inevitably.... we've spent this many years with them, let's throw them on the craziest roller coaster adventure we could think of.\"[52] The main characters eventually return home to their time period.[53]\n\nSecond pod [ edit ]\n\nThe second pod of the season includes the series' 100th episode, which Whedon and Tancharoen described as a \"game changer\" that would \"shake up\" the rest of the pod emotionally, to the point that \"nothing will be the same after\" it.[54] Bell added the episode featured \"a device that grows out of our current storyline and plot that allows us to look back and reflect on where we've come from, turn over a couple cards that people will be excited about and then also celebrate the show and people on it.\"[55] Loeb also felt the episode \"finishes up some stories that perhaps [viewers] didn't even know we haven't revealed\".[56] The episode featured Fitz and Simmons getting married, which Tancharoen said was included because \"it was about damn time. After 100 episodes, they needed to get married.\" Coulson's deal with Ghost Rider was also revealed, which was to have the Kree serum that revived him after his death be burned off, resulting in his chest wound slowly killing him. Whedon said that Coulson has \"come to terms with it. It's something he actually had to come to terms with a long time ago when he was discovering the T.A.H.I.T.I. Project and everything that had been done to him. I don't think he wants to go through any of that again. He's ready for nature to take its course... he seems as much at peace with it as you can be considering there's so much he's done in a world that thinks he's dead.\"[38]\n\nAt the end of February 2018, the writers were planning the end of the pod, and were planning for the final episode to be able to serve as both a season and series finale, with some elements that could be adjusted based on whether the series was renewed for a sixth season or not. Whedon added, \"we're ready for if this is the end. We're definitely going to make it rewarding either way.\"[54] The season ends with the agents having to make a choice between Coulson's life or saving the world, which was \"where we were always going\" when the showrunners were plotting out the season.[57] By killing Fitz in \"The End\", but revealing there was another still in space journeying to the future, Bell noted it helped solve \"the one time loop problem we had\". Whedon explained when deciding when to bring the characters back to the present, it was discussed to have them return to the diner where they were taken, but Fitz would still be there, so the group was brought back after Fitz left to avoid that problem, which \"became this great opportunity. What we realized is the thing that would weirdly have the most impact, one of the most painful things that you can experience, could be then experienced and then, not brought back, but a loophole could be revealed.\"[58]\n\nThe showrunners spoke to not including a bonus scene at the end of \"The End\" to tease what would come, Tancharoen said, \"We felt like it needed to end in Tahiti. To take away from that would be wrong.\" Bell added, \"It's also, emotionally, about the two senior members of the team, who in a sense have retired to Tahiti, and there they are watching the future of S.H.I.E.L.D. fly off into a new adventure... It felt like a nice, succinct ending.\"[59] Coulson's journey was always meant to end at Tahiti, something the showrunners revealed was decided since the start of the series. Whedon explained, \"We thought it was a beautiful image... It's one of the things where you don't overthink it. We latched onto that and went, 'That will be great.' It's an emotional thing for him. We even heard from Mike Peterson that this was something he always wanted. Our big mystery in episode 1 was, \"Never been to Tahiti.\" He doesn't know, and he can never know. And here he is, finding some sort of peace on that beach. We love that image and we were solid on it all the way.\"[58]\n\nCasting [ edit ]\n\nMain cast members Clark Gregg, Ming-Na Wen, Chloe Bennet, Iain De Caestecker, Elizabeth Henstridge, and Henry Simmons return from previous seasons as Phil Coulson, Melinda May, Daisy Johnson / Quake, Leo Fitz, Jemma Simmons, and Alphonso \"Mack\" MacKenzie, respectively.[23] Before the 2017 New York Comic-Con, it was revealed that Natalia Cordova-Buckley had been promoted to series regular for the season, after recurring in the past two seasons as Elena \"Yo-Yo\" Rodriguez.[25] De Caestecker also portrays \"The Doctor\", the version of Fitz from the Framework reality.[60]\n\nIn September 2017, former series regular Nick Blood was announced as returning to reprise his role of Lance Hunter. Blood left the series during the third season, to star in the spin-off series Marvel's Most Wanted, which never came to fruition.[37] Adrianne Palicki, who portrayed Bobbi Morse and also left in the third season for Most Wanted with Blood, expressed interest in October 2017 in returning to guest star in the season, saying she \"would absolutely come back\" if asked.[61] Also returning from earlier in the series are Joel Stoffer as Enoch,[28] who was simply credited as \"silhouetted man\" in his previous appearance,[62] and Lola Glaudini as Polly Hinton.[30] Polly's daughter Robin also appears, portrayed by multiple actresses,[63] after the character made an uncredited appearance in \"Ascension\":[64] Lexy Kolker appears as 7-year-old Robin, Ava Kolker appears as 12-year-old Robin,[63] and Willow Hale appears as an older Robin, when she is also known as The Seer.[63][65]\n\nAdrian Pasdar reprises his role as Glenn Talbot, while also becoming the villain Graviton in the season. This is despite the series introducing Franklin Hall (portrayed by Ian Hart) in the first season, who goes on to become the villain in the comics.[35][36] Additional returning actors include Brian Patrick Wade as Carl Creel,[31] J. August Richards as Mike Peterson / Deathlok,[38] Spencer Treat Clark as Werner von Strucker,[33] Zach McGowan as Anton Ivanov / The Superior,[34] Reed Diamond as Daniel Whitehall, and Raquel Gardner as Carla Talbot,[39] along with Briana Venskus and Maximilian Osinski as S.H.I.E.L.D. agents Piper and Davis.[31][32] Ruth Negga and David Conrad reprise their roles as Raina and Ian Quinn, respectively, in a flashback sequence set during the events of the season one finale, \"Beginning of the End\".[40] The characters Lash and Hive return from earlier seasons for the series' 100th episode.[66][38] Younger versions of Jasper Sitwell and Wolfgang von Strucker also appear, portrayed by Adam Faison and Joey Defore, respectively.[39] Older versions of the characters had been respectively portrayed by Maximiliano Hernández (in the MCU films and first season of the series) and Thomas Kretschmann (in the MCU films).[67][68]\n\nJeff Ward was cast in a recurring role in August 2017,[26] and was revealed in October to be portraying Deke Shaw.[27] Ward had originally been cast as Virgil, a character who dies in the first episode. During the table read of the episode, the main cast felt Ward \"nailed it\" as Virgil and wanted him to stay on as Deke, who had not yet been cast. The producers reached out to Ward after the reading to audition for Deke, and was ultimately cast in the part.[69] Also in October, other newcomers were revealed, with Eve Harlow as Tess, Coy Stewart as Flint, and Pruitt Taylor Vince as Grill.[27] The next month, Marvel revealed that Dove Cameron had joined the season in an unspecified role,[70] which was revealed in January 2018 to be the character Ruby, the daughter of Catherine Dent's General Hale.[29] Other recurring guests for the season include Dominic Rains as Kasius, Florence Faivre as Sinara, Jay Hunter as a Kree watch commander, Tunisha Hubbard as Ava,[28] Shontae Saldana as Candice Lee,[31] and Peter Mensah as Qovas.[34]\n\nDesign [ edit ]\n\nThe title card for the season's first pod\n\nAfter leaving the series during the fourth season, costume designer Ann Foley returned for the first two episodes of the fifth season, before handing over to Whitney Galitz, who had assisted her on the previous few seasons, and Christann Chanell.[71] The opening for \"Orientation\" is reminiscent of the sequence for \"4,722 Hours\", forgoing the title card and having the typeface silently fading onto the screen.[72] The subsequent episodes of the season feature a title card with the series name in a new typeface against a backdrop of various depictions of Earth: episodes through \"Past Life\" feature a destroyed future Earth;[73] episodes from \"Principia\" through \"The Devil Complex\" feature a present Earth; while episodes from \"Rise and Shine\" through \"All Roads Lead...\" feature the Earth beginning to crack.[74]\n\nFilming [ edit ]\n\nFilming for the season began on July 20, 2017.[75][76] In May 2017, Gregg expressed interest in directing an episode in the season,[77] and confirmed that September he would be directing an episode,[78] which was the sixth of the season, \"Fun & Games\". Gregg felt the idea of directing was \"daunting\" as he would need to be doing \"five weeks of double duty\", needing to act in addition to the various aspects of directing the episode.[79] He reached out to fellow S.H.I.E.L.D. directors Kevin Tancharoen, Billy Gierhart, and Jesse Bochco to get tips on filming for the series.[80] Bennet felt Gregg was able to bring out performances from the cast \"that another director probably wouldn't have been able to because he knows the characters so well.\"[81] Gregg added that he had \"shorthand with [the other actors] about what we want to try to do, ways the script could give us a chance to push us into new territory. They all also have deep and interesting ideas that helped me.\" Gregg also received a deeper appreciation for some of the other departments on the series he normally does not encounter on a regular basis and the work they contribute to each episode.[79] The scene for Fitz and Simmons' wedding in \"The Real Deal\" was filmed in \"a very remote location\" in Placerita Canyon State Park.[82] Filming for the season wrapped on April 15, 2018.[83]\n\nMarvel Cinematic Universe tie-ins [ edit ]\n\nIn terms of having connections to Marvel's Inhumans, Whedon felt it was doubtful, but noted \"we also want there to be a bigger reward for people who watch all of [the MCU series], so they'll start to see that there's lines connecting it. It's more fun for people who are playing the whole game, but if you don't, you'll still have a great rollercoaster ride.\"[84] In November 2017, Whedon said that the season would not have moved the characters to space if the recent MCU films like Guardians of the Galaxy Vol. 2 and Thor: Ragnarok had not been exploring that part of the MCU, but that this would remain a \"thematic tie\". He explained that they had moved on from the overt tie-ins with the MCU films that the series utilized in earlier seasons because \"we have our own mythology. That started to be much more interesting to us, and hopefully to the audience ... No one wants to come to see our show to see another show.\"[51] Whedon added in March 2018 that the then-upcoming release of Avengers: Infinity War would similarly \"open a new playground\" for the series to explore.[85]\n\nThe season features the Kree, an alien race that previously appeared in the first three seasons, and in the film Guardians of the Galaxy.[86] The fictional element gravitonium also returns, having first appeared in the first season.[87] It is revealed that the consciousnesses of Franklin Hall and Ian Quinn had been absorbed by the element, eventually merging with Talbot when he enters the Rebirth chamber and becomes Graviton.[36] The last four episodes of the season are set during the events of Infinity War, taking place over a single day and making references to the film; Whedon stated that there was an \"unspoken Marvel rule not to address time\" but that they considered the events of the series and film to roughly line up.[57] In the episodes, the threat of Thanos becomes the driving force of Talbot's character arc as he plans to join the Avengers in defending the Earth.[88] Bell also spoke to not directly referencing the end of Infinity War in \"The End\", by not showing any of the characters killed as a result of Thanos' finger snap. He said \"Part of what happened was, they changed the release date... we move at a different schedule than they do and so suddenly everything was a week earlier, and so we had to make some adjustments and that's how we end up with our story.\" Whedon continued, \"the other thing is that there's certain story points that are so – there would really be no way for us to address it and keep our show intact. Given that there's another movie coming out, and there's gonna be constant repercussions of their universe, so what we felt was that the safe play for our story, and for the integrity of our universe, was to operate outside of it.\"[58] Whedon also added, \"one of the things that we tried to do was even if we're just hinting at a crossover, our concept was to create motivation for our villain, for our antagonist – using the events of Infinity War and using the larger MCU battle to sort of inform [Talbot's] motivation to become what he's becoming. That was our main tie-in, trying to drive our own antagonist. We felt like that was a good way to deal with it, but keep the things in our world in our story.\"[59]\n\nMarketing [ edit ]\n\nThe main cast of the season appeared at New York Comic Con on October 7, 2017, where they promoted the season and debuted the first 20 minutes of the first episode of the season.[89][81] A shortened version of the footage was released by ABC and Marvel on November 26, 2017, as a sneak peek before the season premiere later that week.[90] Marvel released three roundtable discussions in support of the series reaching 100 episodes. Hosted by Patton Oswalt, who has portrayed The Koenigs in the series, the first was released on March 8, 2018 with the women of the series. The second, which was released on March 9, featured the full cast, while the third debuted on March 12 with the executive producers. All premiered on Marvel.com while also being available on Marvel and the series' social media platforms and Marvel's YouTube channel.[91] The executive producers, main cast members except Gregg, and Ward appeared at WonderCon on March 24, 2018, to promote the remainder of the season and answer fan questions. A clip from the end of \"Rise and Shine\" was also shown.[92][85]\n\n\"The Road to 100\" [ edit ]\n\nIn December 2017, Marvel announced the \"Marvel's Agents of S.H.I.E.L.D.: The Road to 100\" art program to commemorate the series reaching 100 episodes. The program features five posters, one for each season of the series, representing \"key pivotal moments of each season\". The art also appeared as variant covers to select titles published by Marvel Comics in March 2018. Megan Thomas Bradner, Vice President of Development and Production, Live Action at Marvel Television, called reaching 100 episodes \"quite a feat... and it felt special enough to share with the fans that got us here. By working with some of our favorite comic artists, we felt we could show a large variety of meaningful moments and the characters that helped get us to a 100.\" She added that the program \"commemorates these creators, the actors, the characters and a hundred amazing stories\".[93]\n\nThe first poster, highlighting season one, was created by Dale Keown. It features four panels, showcasing the moment Coulson and Grant Ward approached Skye in her van from the pilot, Coulson learning he survived the Battle of New York from the T.A.H.I.T.I. program and a drug from a half-dissected Kree alien corpse, the moment Grant Ward revealed he was a Hydra agent by killing Victoria Hand, and Fitz giving Simmons the last remaining oxygen tank and declaring his love for her in the season one finale.[93] The second poster, highlighting season two, was created by Daniel Acuña. The scenes depicted are Coulson writing the Inhuman map on a wall; Daisy coming out of her Terrigenesis; the S.H.I.E.L.D. team, Bobbi Morse, Lance Hunter, and the \"real S.H.I.E.L.D.\" logo; and May cradling the deceased body of Katya Belyakov.[94] The third poster, highlighting season three, was created by Nick Bradshaw. The poster shows the S.H.I.E.L.D. team and Hive, along with the Hydra logo breaking the S.H.I.E.L.D. logo and its tentacles covering much of the poster. Specific moments highlighted include Fitz and Simmons after she has been pulled from the portal to Maveth, Coulson killing Ward on Maveth, and the formation of the Secret Warriors.[95] The fourth poster, highlighting season four, was created by Rahzzah. It highlighted the introduction of Ghost Rider, Life Model Decoys (LMD) and the Framework reality, Jeffrey Mace sacrificing himself in the Framework, and Coulson's kiss with the May LMD.[96] The fifth and final poster, highlighting this season, was created by Stonehouse. Flanked on either side are Kasius and Sinara, with the S.H.I.E.L.D. team and Deke in the center in front of the destroyed Earth of the future as well as Fitz reuniting with Simmons.[97]\n\nRelease [ edit ]\n\nBroadcast [ edit ]\n\nThe season began airing in the United States on ABC on December 1, 2017,[81] beginning once Inhumans finished airing its episodes.[98] It is set to run for 22 episodes,[43] with a short hiatus for the airing of the 2018 Winter Olympics between \"Past Life\" and \"All the Comforts of Home\".[53] The season concluded on May 18, 2018.[99]\n\nThe fifth season moved to a Friday timeslot, alongside the seventh season of ABC's Once Upon a Time, with ABC chief Channing Dungey explaining, \"We've turned Friday into more of a destination for our fantasy and science fiction fans. Once Upon a Time and S.H.I.E.L.D. are airing on the same night for the first time, which is giving many fans of both shows what they've been asking for for a long time.\"[100] Andy Kubitz, executive vice president for program planning and scheduling at ABC, added that ABC had \"confidence that [the S.H.I.E.L.D.] core audience... [would] travel with it\" to its new Friday time slot. He continued, \"The great thing about Friday night for these shows is it gives three days of downtime for a lot of these younger viewers to be able to catch up on it. You've got Saturday and Sunday viewing that will be able to be counted into our C3 to help us monetize it.\"[44]\n\nHome media [ edit ]\n\nThe season began streaming on Netflix in the United States on June 17, 2018.[101]\n\nReception [ edit ]\n\nRatings [ edit ]\n\nThe season averaged 3.57 million total viewers, including from DVR, ranking 133rd among network series in the 2017–18 television season. It also had an average total 18-49 rating of 1.1, which was 97th.[121]\n\nCritical response [ edit ]\n\nThe review aggregator website Rotten Tomatoes reports a 100% approval rating, with an average score of 7.89/10, based on 22 reviews. The website's consensus reads, \"Agents of S.H.I.E.L.D. swings for the fences with large-scale storytelling and wild twists that elevate season 5 from the saturated MCU and into its own space.\"[122]\n\nReviewing the premiere episodes, Merrill Barr of Forbes felt moving the series to space was not a reboot of the series, rather \"a continuation, in some form, of the story set-up at the end of last season. The show is not different. The team is still trying to save the world. They're just doing it in a new place and new way. Overall, there's a lot to love about what S.H.I.E.L.D. is doing in the new season. It's a crazy ride fans are going to be glad they've stayed aboard for. The \"Agents of Hydra\" run [at the end of season four] was a bit weak. The space run is so far proving to be anything but.\"[123] Jon Negroni of We Got This Covered praised the show for its delightful twists and turns and for not relying on what's already worked, adding that \"it's a testament to the show's ongoing experimentation that we can watch these characters get to space and believe that this is far from their final frontier.\" He felt, however, that there was \"little room for pathos and seeds for character development\" and that \"we know almost nothing about where these individuals are at emotionally because of how fast we blazed through the finale.\"[124] Alex McLevy of The A.V. Club praised the move to space, saying that \"if season four was Agents of S.H.I.E.L.D. firing on all cylinders, especially during its stellar 'Agents of Hydra' arc in the Framework, then this is the look of a show that knows it has mastered its storytelling, and is confidently expanding the scope of its ambition.\"[125]\n\nAccolades [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Global_thinking.svg/10px-Global_thinking.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/5/5f/Agents_of_S.H.I.E.L.D._season_5_poster.jpg/220px-Agents_of_S.H.I.E.L.D._season_5_poster.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/e/ee/Agents_of_S.H.I.E.L.D._season_5_title_card.jpg/220px-Agents_of_S.H.I.E.L.D._season_5_title_card.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/5/5f/Agents_of_S.H.I.E.L.D._season_5_poster.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/5/5f/Agents_of_S.H.I.E.L.D._season_5_poster.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Agents_of_S.H.I.E.L.D._(season_5)", "title": "Agents of S.H.I.E.L.D. (season 5)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/5/5f/Agents_of_S.H.I.E.L.D._season_5_poster.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}