{"url": "people.com/movies/katie-holmes-jamie-foxx-relationship-history/", "text": "Under-the-radar couple Jamie Foxx and Katie Holmes have called it quits after six years of dating.\n\nAn entertainment source confirmed to PEOPLE “Jamie and Katie split.”\n\nGet push notifications with news, features and more.\n\nThe pair, who have been linked since 2013, parted ways in May — the same month that they posed together for the first time at the 2019 Met Gala. They were also seen laughing and holding hands in videos posted to designer Zac Posen’s Instagram Stories.\n\nIn April, a source told PEOPLE that Foxx, 51, and Holmes, 40, were trying to make time for each other as much as possible.\n\n“When they can spend time together, they do. When they’re busy and they can’t, they don’t. They are two adults who enjoy each other’s company and have for a long time,” the insider said.\n\nThe former couple remained tight-lipped about their romance, but managed to make several other rare appearances together throughout their relationship.\n\nRELATED: Katie Holmes and Jamie Foxx Split After 6 Years of Dating\n\nIn January 2018, Foxx and Holmes looked every bit the happy couple at Clive Davis‘ annual Pre-Grammy Awards Gala. Though the two arrived separately, they sat together at the same table once inside the star-studded event.\n\nBut it appeared the actress tried to avoid drawing attention to herself by leaving the room and moving to a different seat just moments before Davis announced the singer’s presence.\n\nHowever, Davis called out the move, saying, “This lady left the room right when I was going to introduce her, she was sitting at that table right with Jamie Foxx and everyone else.”\n\nDavis added, “If you’re going to sit together what better night than tonight?”\n\nImage zoom Katie Holmes and Jamie Foxx at the 2019 Met Gala Kevin Tachman/MG19/Getty\n\nThe pair even wrapped up the year with a December yacht outing in Miami, followed by a jet ski trip the next day.\n\nAnd that wasn’t the first time Foxx and Holmes were caught on a romantic outing.\n\nin May 2017, Foxx and Holmes were spotted spending time together in Paris.\n\nHolmes met up at a hotel with Foxx, who had been in the City of Lights to shoot his film Robin Hood, sources confirmed at the time. (Meanwhile, Cruise was working on the sixth installment of his Mission: Impossible franchise a few blocks away.)\n\n\n\nWhile the actress kept a low profile during her Paris stay, she did stop by Luc Besson’s studio Cité du Cinemas where Foxx was filming. Later, the duo were photographed boarding a private jet together out of the city.\n\nIn September 2017, the stars were spotted walking hand in hand along the sand barefoot in Malibu, relaunching years-long buzz about a romance. A few months later in December, the two celebrated Foxx’s 50th birthday with a night out in Los Angeles. They were seen leaving the Highlight Room together.\n\nA new round of rumors surfaced in 2016 after the actress stepped out in New York City wearing a diamond ring (which she’d been sporting for months) while Foxx was spotted wearing a gold band.\n\nFoxx’s rep told PEOPLE at the time that the movie stars were neither engaged nor married.\n\nImage zoom Katie Holmes and Jamie Foxx at the Clive Davis Pre-Grammy Gala in 2018 Kevin Mazur/Getty Images\n\nIn 2015, a source told PEOPLE they weren’t getting serious. “This is not some intense romance,” the source said. “Jamie and Katie are friends and have been for a long time. They are two adults who are attractive and single, and so apparently conclusions will be drawn. But contrary to those conclusions, they’re not about to run off and make some serious commitment.”\n\nAdded a Foxx source at the time: “[They] see each other and go out together, but Jamie would tell you he is not involved with anyone seriously. [He]’s a workaholic and couldn’t be happier in his life as it is.”\n\nIn a November 2014 cover story, Holmes told PEOPLE that she “absolutely” still believes in love.\n\n“I’m a very loving person,” she said. “Of course I’m open to finding love again.”\n\nThe pair first made headlines when they hit the dance floor together at the Apollo in the Hamptons event in East Hampton, New York, in 2013, a little over a year after Holmes and Tom Cruise split in 2012 after six years of marriage. They jammed out to Robin Thicke’s summer anthem, “Blurred Lines” and Foxx’s 2009 hit “Blame It (On the Alcohol)” at the benefit concert.\n\nRELATED ViDEO: Are Katie Holmes and Jamie Foxx Dating?\n\nThe actor and musician denied that he and Holmes were an item following the encounter.\n\n“[The rumors] are one hundred percent not true. In fact, it’s quite hilarious because we simply danced at a charity event along with a lot of other people,” he told Entertainment Tonight at the time.\n\nReps for both actors had no immediate comment in response to news of their split.\n\nTheir breakup comes three days after Foxx was spotted holding hands with singer Sela Vave on Friday night as the two left Bootsy Bellows nightclub in Los Angeles.\n\nImage zoom Jamie Foxx and Katie Holmes in Malibu in 2017 DOBN/RMBI/BACKGRID\n\nVave, a singer/songwriter and model, is the record producer’s newest artist. “She’s just a girl he’s helping out, a young singer,” a source told PEOPLE at the time.\n\nAn eyewitness who was at La Esquina restaurant on Friday night told PageSix that they had overheard Holmes telling a friend that she and Foxx “haven’t been together for months.” Sources told both PageSix and E! News that the two stopped seeing each other in May.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F08%2Fkatie-holmes-3.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Ffoxx-holmes-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F08%2Fkatie-holmes-b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F08%2Fkatie-holmes-a.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F08%2Fkatie-holmes-a.jpg", "keywords": [], "authors": ["Stephanie Petit"], "canonical_link": "https://people.com/movies/katie-holmes-jamie-foxx-relationship-history/", "title": "Katie Holmes and Jamie Foxx Split: A Look Back at Their Private Romance", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Breakups,Jamie Foxx,Katie Holmes,Movie Celebrities,News", "news_keywords": "Breakups,Jamie Foxx,Katie Holmes,Movie Celebrities,News", "description": "The pair first made headlines when they hit the dance floor together at the Apollo in the Hamptons event in East Hampton, New York, in 2013", "og": {"title": "Katie Holmes and Jamie Foxx Split: A Look Back at Their Private Romance", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/movies/katie-holmes-jamie-foxx-relationship-history/", "description": "Under-the-radar couple Jamie Foxx&nbsp;and&nbsp;Katie Holmes have called it quits after six years of dating. An entertainment source confirmed to PEOPLE “Jamie and Katie split.” The&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F08%2Fkatie-holmes-a.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/movies/katie-holmes-jamie-foxx-relationship-history/", "description": "The pair first made headlines when they hit the dance floor together at the Apollo in the Hamptons event in East Hampton, New York, in 2013", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F08%2Fkatie-holmes-a.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/movies/katie-holmes-jamie-foxx-relationship-history/", "title": "Katie Holmes and Jamie Foxx Split: A Look Back at Their Private Romance", "description": "The pair first made headlines when they hit the dance floor together at the Apollo in the Hamptons event in East Hampton, New York, in 2013", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F08%2Fkatie-holmes-a.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}