{"url": "www.thecut.com/2017/03/25-famous-women-on-waxing-and-shaving.html", "text": "Photo: BFA, Getty Images\n\nThanks to warped beauty standards, female body hair often comes attached to a stigma. More than 99 percent of American women reportedly remove their body hair, spending tens of thousands of dollars over the course of their lifetimes to wax, pluck, shave, epilate, thread, or laser unwanted fuzz off their bodies. Below, 25 women — from Victoria’s Secret models to body-hair activists — get real about their own body hair (from eyebrows to pubes to leg hair), whether they choose to laser everything off, or let it grow out as nature intended.\n\nKim Kardashian\n\n“I have the hairiest forehead you could ever imagine, and I would always break out and get all cracky on my forehead just from all the hair that I had. So in high school, I would wax it off because there was just so much hair, and then I would laser it off a little bit. If you Google 2008 or 2007, I had the craziest, hairiest hairline, so I did laser it. Everyone would just Photoshop it every time I did a photo shoot [anyway]. I didn’t really change the shape, I just got rid of all the baby hairs.” – People, March 2015\n\nRihanna\n\n“Well, I went to this wax salon, and she recognized me before I took my clothes off … And then, you know, obviously, I’m laying there in pain, and she just decides to bust out — and you know what, every time I get a wax, I always specify that the lady is old and speaks Russian or no English — and she was [a] 25-year-old American. And she was basically like, ‘I know who you are. [Imitates wax-tearing noise.] You’re Rihanna, aren’t you?’ I was just like … awkward. It was really awkward. It was probably one of the most awkward moments of my entire life. I just got up and I just got out of there.” – The Graham Norton Show, November 2010\n\nAdele\n\nOn whether her husband minds her unshaven legs: “He has no choice. I’ll have no man telling me to shave my fuckin’ legs. Shave yours.” – Vanity Fair, October 2016\n\nLeandra Medine\n\n“My relationship with shaving and waxing is very strange. The reason I don’t do anything to my arms is because I really don’t mind the hair on them. Sometimes my husband asks me to shave it or to wax it and that really bothers me. I’m not asking him to, like, wax his balls. So why should he tell me what to wax or what to shave? Right? … Still, I think that my problem with bikini waxing in particular is that I am uncomfortable with having hair there, and I’m uncomfortable about being uncomfortable. I almost want to remove my hair to take back being a woman, and have that be my feminist statement … I don’t mind how [my arm hair] looks, though, so I’m not changing it. However, I do laser my mustache.” – Man Repeller, July 2015\n\nCarrie Brownstein\n\n“I will say, as a woman, when you put a mustache on, you find out a lot of things about yourself … There’s just a certain swagger. Now I know why men, you know, grow out the facial hair. Like there is just a certain level of confidence but also just a certain level of sleaziness.” – Wait Wait…Don’t Tell Me!, March 2012\n\nPriyanka Chopra\n\n“Brows need to be on point, and I prefer threading to waxing. Because your skin is so sensitive around your eye, waxing can create wrinkles. It’s also really important for your eyebrows to be extremely well filled-in. If you have great eyebrows and a good lip, then you don’t need anything else on your face. My mom used to do her own eyebrows when she was in school, so I’ve known how to do [it] for years. If you have sensitive skin then it is kind of tricky — you have to find the right technician to do it. And when you find her, keep her! My hairstylist does it for me. Her name is Priyanka, actually — same as mine.” – Into the Gloss, May 2015\n\nHarnaam Kaur\n\n“I was diagnosed with polycystic ovaries from a really young age, around the time I hit puberty. PCOS is a condition in which there is an imbalance in hormones within the female body, this has led me to have more male hormones than female ones, and it is also the reason to why I have a beard. I used to have my face waxed two to three times a week, and on the days I couldn’t bear the pain I would simply shave … I decided to keep my beard and step forward against society’s expectations of what a woman should look like … Today I am happy living as a young, beautiful, bearded woman. I have realized that this body is mine, I own it, I do not have any other body to live in, so I may as well love it unconditionally.” – Rock N Roll Bride, June 2015\n\nPetra Collins\n\nOn shaving her pubic area: “I never really did. I guess I would like trim. And it was always something that I’d be like, I’m going to the beach, I’m so embarrassed. Like, because I never really liked to shave. So I just didn’t know what to wear because it was embarrassing … Now, I just don’t care … [Women’s body hair]’s just something that is so not talked about that it’s insane. Like, all shaving ads would not — there’s no hair in the ads. It doesn’t even start with hair. They’re shaving nothing. And I guess it’s kind of the same thing with like menstrual blood … I was finally like, wait, why do I do this every day and why do I buy things every day to get rid of something that my body’s just trying to grow?” – StyleLikeU, June 2015\n\nGaby Hoffmann\n\n“When people want me to talk about whether I think the bush is back, and if that’s great for feminism, I’m like, ‘You know what’s great for feminism? Respecting everybody’s own choice.’ … I don’t give a shit if people want to wax everything off. If it makes you feel comfortable, by all means, do that. This is how I feel comfortable.” – The Telegraph, May 2016\n\nEva Longoria\n\n“Get a Brazilian wax. It makes sex better, orgasm-wise. It’s like the difference between this [she pats her arm lightly] and this [rubs her arm] … Believe me, the first time I did it, the technician did half, and I was like ‘Stop!’ She said, ‘Sit down, I have to finish.’ But then it gets easier. The more you do it, the less hair grows back. But yeah, I love it. I swear by it. Every woman should try a Brazilian wax once. And then the sex they have afterward will make them keep coming back!” – Cosmopolitan, October 2005\n\nTina Fey\n\n“Remove your body hair only when necessary. Body hair is a constant annoyance. Mostly I just let it be. Until I have to go into a professional situation, and then I have to shave from head to toe.” – The Edit, December 2015\n\nKate Winslet\n\nOn her role in The Reader: “I had to grow the hair down there. But because of years of waxing, as all of us girls know, it doesn’t come back quite the way it used to. They even made me a merkin — a wig — because they were so concerned that I might not be able to grow enough.” – Allure, June 2009\n\nChrissy Teigen\n\n“Waxing for a shoot? Are you kidding? I shave my whole body every day. It’s exhausting. Trust me. It’s gotten to the point where it takes up more of my life than anything else.” – Allure, April 2015\n\nCameron Diaz\n\n“I figure there’s a purpose for that hair. No matter how you enjoy grooming it throughout your life, whether it’s like shave it all off, wax it all off, put a bull’s-eye, birthday cake, I don’t care. Just girls, think about not taking it all off forever. Permanency forever, ever, means forever. It doesn’t come back.” – Chelsea Lately, March 2014\n\nJennifer Lopez\n\n“I don’t love waxing. I just don’t like everybody … up in the business, you know what I mean? I shave everywhere; the only thing I wax is my eyebrows. It’s torture plucking the hairs out one by one … I’m not really a hairy person. I shave every few days; once the stubble comes in, I take it off right away. Today I’ve changed my outfit six times for shoots, and there’s a lot of going from pants to a short skirt, so I keep a razor in my travel kit. In a pinch, I’ve grabbed a water spray bottle from the hairdresser, mixed it with some lotion, and shaved my legs in under a minute.” – Allure, February 2011\n\nKate Somerville\n\n“I hate to say this, but personally I get hairs above my upper lip, and have forever. Initially I [shaved] it because of the hair, but then I noticed that it was a great exfoliant and that my makeup went on a lot better.” – The New York Times, June 2015\n\nEmma Watson\n\n“It’s funny — I was just talking to my friend before this about how in the Instagram era it’s so easy to edit your life so that it looks perfect. But I bleach my top lip and tweeze my eyebrows and you’d never get to see that, even though it’s a part of my routine. There’s still so much shame around the things you do to get ready while you’ve got a towel wrapped around your head. It’s important to me not to edit that out. I’ve been bleaching my top lip since I was nine. I don’t do it very often, but I do it! There’s that, and I use Fur Oil. I’ll use that anywhere from the ends of my hair to my eyebrows to my pubic hair. It’s an amazing all-purpose product.” – Into The Gloss, March 2017\n\nRita Ora\n\n“If I’m not working and getting my makeup done, that’s my chance to do a hair mask and a face mask and my plucking and waxing and all of that …Eyebrows are really important because they structure the face. In school it was funny because I was always the one walking around with tweezers plucking my girlfriends’ eyebrows. I was really good; eyebrow tweezing runs in my family — my mother used to do mine, and I picked it up. Then I started plucking my friends’ brows when I would see them at school. Suddenly there ended up being a line at lunchtime of people who wanted to get their eyebrows tweezed.” – Into The Gloss, August 2014\n\nMadonna\n\n“[G]oing to high school, I saw how popular girls had to behave to get the boys. I knew I couldn’t fit into that. So I decided to do the opposite. I refused to wear makeup, to have a hairstyle. I refused to shave. I had hairy armpits … The boys in my school would make fun of me. ‘Hairy monster.’ You know, things like that.” – Harper’s Bazaar, November 2011\n\nMo’Nique\n\nOn her shaven legs: “Okay, let me tell you something … I didn’t [care about my leg hair]. And I still don’t. But what happened was, as I got older, the hair began to fall out in different places. So one night, Sid [her husband] and I were in the closet, and he said ‘Mama, you’re starting to have spots on your legs. It look like you got the mangy. So you got to do something about that.’ So I shaved them that night and I’ve been shaving them ever since … If I still had it I would still wear it well.” – The Wendy Williams Show, April 2015\n\nBusy Philipps\n\nOn whether she waxes or shaves: “Oh! I love this question. Actually, I wanted to talk to you about this, it’s so weird. So I do get waxed, but after I had my daughter I had this real epiphany. I felt like it would be really fucking weird if I had no hair on my vagina, because I have a little girl and I want her to look at me and think that grown women have hair on their vaginas!” – The Conversation with Amanda de Cadenet, May 2013\n\nGrimes\n\n“I just started shaving for the first time this year. I am rebelling against my previous body hair, because now people get mad when I shave my legs. So I’m like, ‘I have the right to shave my legs.’ I think people policing my body either way is bizarre … There is still an intense vibe in society about body hair. No one I’ve ever dated has mentioned it. I didn’t even think it was weird until I started doing fashion and people would be putting concealer over my legs.” – Teen Vogue, April 2016\n\nCharlotte Free\n\nOn her unshaven armpits: “It’s an equal-rights thing. It’s ridiculous that women have to shave their armpits and legs every day. I don’t have time. I think it’s asinine that men have this standard that women should be perfectly shaven … I only shave them once in a blue moon for a really big job. I like to keep my body hair. It’s a symbol of how I’m not going to conform to something that’s so ridiculous.” – The Guardian, March 2012\n\nMayim Bialik\n\n“I wonder if I had a girl if she would find me odd and embarrassing, or if whatever we present to our children about us, whether they be girls or boys, is simply what we teach them we are. Meaning, if we never told girls to shave, would they? If we modeled a cultural acceptance of our body hair, would they spontaneously feel the need to remove it weekly, monthly, or daily? If we all wore bathing suits that covered our natural forms instead of the form that only hairless young girls who have not birthed babies can wear, would our girls and boys have a more or less realistic notion of what the human body ‘should’ look like?” – Kveller, July 2012\n\nMolly Soda\n\n“Choosing to shave doesn’t mean that you’re insecure. The strongest statement you can make is to take control of your body and present yourself in whatever way that makes you feel comfortable. Shave one leg and don’t shave the other, shave sometimes, never shave … it doesn’t matter. All that matters is that you feel good about you. That’s the boldest and bravest thing you can do.” – Nylon, April 2016", "images": ["https://pixel.nymag.com/imgs/fashion/daily/2017/03/30/30-famous-women-waxing-shaving.w1200.h630.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2017/03/30/30-famous-women-waxing-shaving.w700.h700.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pixel.nymag.com/imgs/fashion/daily/2017/03/30/30-famous-women-waxing-shaving.w1200.h630.jpg", "keywords": [], "authors": ["Julie Ma"], "canonical_link": "https://www.thecut.com/2017/03/25-famous-women-on-waxing-and-shaving.html", "title": "25 Famous Women on Waxing and Shaving", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "25 Famous Women on Waxing and Shaving", "url": "https://www.thecut.com/2017/03/25-famous-women-on-waxing-and-shaving.html", "description": "How Rihanna, Emma Watson, Eva Longoria, and more deal with body hair.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2017/03/30/30-famous-women-waxing-shaving.w1200.h630.jpg", "site_name": "The Cut", "type": "article"}, "twitter": {"title": "25 Famous Women on Waxing and Shaving", "description": "How Rihanna, Emma Watson, Eva Longoria, and more deal with body hair.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2017/03/30/30-famous-women-waxing-shaving.w600.h315.2x.jpg", "card": "summary_large_image", "site": "@TheCut"}, "description": "How Rihanna, Emma Watson, Eva Longoria, and more deal with body hair.", "article": {"tag": "body hair, 25 famous women on, fame, beauty, kim kardashian, rihanna, adele, leandra medine, carrie brownstein, priyanka chopra, harnaam kaur, petra collins, gaby hoffmann, eva longoria, tina fey, kate winslet, chrissy teigen, cameron diaz, jennifer lopez, kate somerville, emma watson, rita ora, madonna, monique, busy philipps, grimes, charlotte free, mayim bialik, molly soda, hairy situations, cut homepage lede, top story", "publisher": "https://www.facebook.com/cut"}, "sailthru.tags": "body hair, 25 famous women on, fame, beauty, kim kardashian, rihanna, adele, leandra medine, carrie brownstein, priyanka chopra, harnaam kaur, petra collins, gaby hoffmann, eva longoria, tina fey, kate winslet, chrissy teigen, cameron diaz, jennifer lopez, kate somerville, emma watson, rita ora, madonna, monique, busy philipps, grimes, charlotte free, mayim bialik, molly soda, hairy situations, cut homepage lede, top story", "author": "Julie Ma", "fb": {"app_id": 343556435754245}, "type": "Article", "vertical": "The Cut", "apple-mobile-web-app-title": "The Cut", "application-name": "The Cut", "msapplication-TileColor": "#ff5656", "msapplication-TileImage": "https://assets.nymag.com/media/sites/thecut/icon.144x144.png"}, "movies": [], "publish_date": 1490371200.0, "source": "http://www.thecut.com", "summary": ""}