{"url": "https://www.nytimes.com/interactive/2017/11/10/us/men-accused-sexual-misconduct-weinstein.html", "text": "In early October, Harvey Weinstein, the Hollywood producer, was fired from his namesake company after multiple women came forward to accuse him of rape and sexual assault.\n\nIn what appears to be a seismic shift in what behavior is tolerated in the workplace, a cascade of high-profile men, many in the entertainment and news media industries, have since been fired or forced to resign after accusations of sexual misconduct that ranged from inappropriate comments to rape.\n\nSome high-profile cases are not on the lists below because the accusations of misconduct were not clearly sexual in nature and the men who were accused did not admit to sexual misconduct. For example, some men have been fired for “inappropriate behavior” or “misconduct,” but the details of their actions remain unclear. This page was last updated at the beginning of February.\n\n71 Firings and Resignations\n\nThe men in the list below have been fired, resigned or experienced similar professional fallout.\n\nResponse “I appreciate the way I've behaved with colleagues in the past has caused a lot of pain, and I sincerely apologize for it.” He denied the accusations of nonconsensual sex. »\n\nFallout Fired from his company and expelled from the Academy of Motion Pictures Arts and Sciences. »\n\nAccusation Raping three women. Sexual assault and harassment of dozens of others — including masturbating, exposing himself and unwelcome touching. »\n\nResponse “Mr. Signore unequivocally denies allegations of sexual assault, harassment or retaliation of any kind,” his lawyer said in a statement.\n\nAccusation Sexual assault of one woman and harassment of several others. »\n\nResponse “Each of the women who have come forward used grains of truth to sell false narrative.” »\n\nAccusation Sexual assault of at least two women and inappropriate behavior with one woman. »\n\nResponse Vox Media's chief executive said Steele had admitted to “engaging in conduct that is inconsistent with our core values and will not be tolerated.” »\n\nResponse “I alone am entirely responsible for my moral failings. This is not the way the head of a company like ours should have acted.” »\n\nResponse “Many of his professional interactions with subjects were sexual and explicit in nature but all of the subjects of his work participated consensually,” a spokeswoman said. »\n\nFallout Banned from working with Condé Nast. Under investigation by the New York Police Department. »\n\nResponse “For my offenses against some of my colleagues in the past I offer a shaken apology and ask for their forgiveness.” »\n\nFallout Fired from Emerson Collective, which canceled publication of a magazine he was editing, and removed by The Atlantic as a contributing editor. »\n\nResponse “I fully recognize that I have tested certain boundaries, which I am working hard to correct.” »\n\nResponse “We are heartbroken and confounded by deliberate and cruel defamations,” said his family in a statement. »\n\nResponse “I am profoundly sorry for the pain and anguish I have caused by my past actions. I apologize sincerely to the women I mistreated.” »\n\nResponse “While I am not guilty of any such crimes, I am admittedly not perfect.” »\n\nResponse “Mr. Webster has had multiple relationships over the course of his professional life, all of which have been consensual,” a representative said in response to the first accusation. »\n\nFallout Dozens of his country music star clients cut ties. He stepped away from his public relations firm. »\n\nResponse “Kevin Spacey is taking the time necessary to seek evaluation and treatment,” said his representative in a statement. »\n\nResponse “Women have longstanding and profound concerns with respect to their treatment in the workplace. Many men have a lot to learn in this regard. I know I do, and I hope for and encourage that new direction.” »\n\nResponse “I am deeply sorry to the people I hurt. My behavior was wrong and inexcusable, and I accept full responsibility.” »\n\nResponse “I didn’t grope anybody. I might have kissed somebody on the cheek to say goodbye and then licked them. ... I’m not trying to sexually harass people.” »\n\nResponse “From day one, I have denied the outrageous allegations against me. I have never been charged with a crime, let alone convicted of one.” »\n\nResponse “I have never forced myself in any manner, on any woman. I certainly have never committed rape.” »\n\nFallout Cut from a show on BBC, which suspended another show in which he stars. The Los Angeles Police Department opened an investigation in November. »\n\nResponse “I’ve already made clear my deep regret if any action of mine was ever misinterpreted by anyone as being aggressive, but the idea that I would deliberately harass anyone is simply and utterly untrue.” »\n\nResponse “To the extent my behavior was perceived as disrespectful, I deeply and sincerely apologize and will ensure it does not happen again.” »\n\nResponse The accusations are “either completely false or have been taken far out of context,” Mr. Schoen told MinnPost. »\n\nAccusation Sexual misconduct with five women, including exposing himself and masturbating in front of them. »\n\nResponse “I have made comments on women’s appearances and clothes in my capacity as an executive producer, but they were not sexualized.” »\n\nResponse “I sincerely regret that my actions and choices have kept me from serving my constituents and our state in a way that reflects the best ideals of public service.” »\n\nResponse “I have much to learn, but my goal is and has always been to make sure every member of our party has a safe environment in which to succeed. It seems I’ve not been successful in that goal, and I will do better.” »\n\nResponse “I know in my heart, nothing that I have done as a senator, nothing, has brought dishonor on this institution, and I am confident that the Ethics Committee would agree.” »\n\nResponse “I vehemently deny all these allegations. ... I have already apologized for the instances of thoughtlessness in my consensual relations.” »\n\nAccusation Sexual assault of two women and rape of three others. »\n\nResponse “I expressly and vehemently denied the allegations made against me, and continue to do so.” »\n\nResponse “I have behaved insensitively at times, and I accept responsibility for that, though I do not believe that all of these allegations are accurate.” »\n\nResponse “I am shattered and heartbroken at the thought that any of my actions left members of my team feeling hurt or degraded.” »\n\nResponse “Some of what is being said about me is untrue or mischaracterized, but there is enough truth in these stories to make me feel embarrassed and ashamed.” »\n\nResponse “If I am guilty of harassment, then every employee who stole a pencil is guilty of embezzlement.” »\n\nResponse “We are confident that these anecdotes will be shown to be untrue.” »\n\nResponse “To hear that I have caused pain is profoundly upsetting, as is the idea that I might have crossed a line with anyone who considered me a mentor.” »\n\nAccusation Sexual abuse of nine women, some of whom were teenagers at the time. »\n\nResponse “I want to state clearly again that I deny the allegations in question.” »\n\nResponse “I have denied, and continue to deny, that I have engaged in any such misconduct.” »\n\nResponse “I blurred the personal and the professional in ways that were, I now recognize, disrespectful of my colleagues and our contributors, and that made them feel uncomfortable or demeaned.” »\n\nResponse “I clearly became insensitive as to how the discussion of such an intensely personal topic might affect others.” »\n\nResponse “It grieves me to learn that I caused any of my clerks to feel uncomfortable; this was never my intent.” »\n\nResponse “I am dismayed that The New Yorker has decided to characterize a respectful relationship with a woman I dated as somehow inappropriate.” »\n\nResponse “Much of the behavior described does, in fact, match up with ways I have acted. That behavior was wrong and there are no excuses.” »\n\nResponse “I certainly respect the need for change with regard to this issue, but as far as my situation, I did not sexually harass anyone.” »\n\nResponse “You see, I’ve come to understand after months of these revelations, that I am not some innocent bystander, I am also a part of the problem.” »\n\nFallout Stepped down from his production company. YouTube Red canceled the release of his coming film. »\n\nResponse “I believe that it is time to turn the franchise over to new ownership.” »\n\nResponse A spokeswoman for Mr. Gomes said, “This is a time of reflection for Marcelo. He is gratified and strengthened by the support he has received from family, friends and colleagues.” »\n\nResponse “I do not believe that these allegations reflect the company’s culture — or the way we treat each other.” »\n\nResponse “The allegations are true. What I did was wrong, and I take full responsibility for my actions.” »\n\nFallout Resigned from his company, Wynn Resorts, and stepped down from the R.N.C. »\n\nResponse “I apologize for my bad behavior. It was never my intention to disrespect anyone.” »\n\n28 Suspensions and Other Fallout\n\nThe men below, who have all also been accused of sexual misconduct, have experienced fallout short of resignation, such as being suspended.\n\nDayan Candappa, chief content officer of Newsweek Media Group and global editor in chief of the International Business Times, took a leave of absence after it was revealed that he was fired from his previous position as a top editor at Reuters because of accusations of sexual harassment. He has not responded to the accusations.\n\nRoss Levinsohn, publisher and chief executive of The Los Angeles Times, was placed on an unpaid leave of absence after it was reported that he was sued for sexual harassment at two other companies.\n\nMario Testino and Bruce Weber, both fashion photographers, were accused by male models of sexual misconduct, which they both denied. Condé Nast said it would stop working with them “for the forseeable future.”\n\nBen Vereen, an actor and singer, was accused of sexual misconduct with several actresses, including forced kissing. Broadway San Diego, a production group, cut ties with Mr. Vereen, who apologized.\n\nThomas Roma, a documentary photographer and professor at Columbia University, had his show at the National Gallery of Art canceled after five women who had been his students accused him of sexual misconduct. Mr. Roma’s lawyer said that he disputes the accusations.\n\nCharlie Hallowell, a chef and owner of three restaurants, stepped away from daily operations of his businesses after 17 women accused him of sexual harassment. Mr. Hallowell apologized.\n\nAndrew Creighton, president of Vice Media, was placed on leave pending an internal review of a settlement he reached with a former employee who accused him of sexual harassment. Mr. Creighton apologized.\n\nThe artist Chuck Close had his show at the National Gallery of Art canceled and his self-portrait at Seattle University removed after accusations of sexual harassment by several women. He denied some of the accusations and also apologized.\n\nKen Friedman, a chef and restaurateur, took a leave of absence from the management of his restaurants after 10 women accused him of unwanted sexual advances. He has apologized.\n\nMarshall Faulk, Heath Evans and Ike Taylor, analysts for NFL Network, were suspended pending investigations into accusations by a former coworker, who sued them for sexual harassment and assault. Eric Weinberger, a former NFL Network executive, was also named in the suit and suspended from his current position as president of the Bill Simmons Media Group. Mr. Weinberger, Mr. Taylor, and a representative for Mr. Faulk and Mr. Evans did not respond to requests for comment.\n\nJon Heely, the director of music publishing at Disney, has been suspended without pay during a criminal investigation into charges that he sexually abused two minors. Mr. Heely’s attorney denied the charges.\n\nJames Levine, a longtime conductor at the Metropolitan Opera, was suspended after four men accused him of abusing them. Mr. Levine denied the accusations.\n\nSteven T. McLaughlin, a New York state assemblyman, was disciplined by an ethics committee for sexual harassment. He denied that the harassment occurred.\n\nAndy Rubin, the creator of Android and a former executive at Google, took a leave of absence from his start-up after a report that he was involved in an inappropriate relationship with a female subordinate when he was at Google. Mr. Rubin’s spokesman disputed the report, and Mr. Rubin has since returned to work.\n\nJohn Lasseter stepped away as head of Pixar and Walt Disney Animation for “a six-month sabbatical” after he was accused of sexual harassment. He apologized.\n\nGlenn Thrush, a reporter at The New York Times, was suspended for two months and removed from the team covering the White House after being accused of sexual misconduct. He apologized.\n\nRandy Baumgardner, a Colorado state senator, was accused of sexual harassment by a former legislative aid. He stepped down from a committee chairmanship and apologized, but remains in the legislature.\n\nGary Goddard took a leave of absence from his production company, the Goddard Group, after two men accused him of sexually assaulting them when they were minors. An additional six men later accused him of the same. Mr. Goddard’s publicist denied the accusations.\n\nRoy Moore, the former Republican nominee for a United States Senate seat in Alabama, had financing for his campaign withdrawn by the Republican National Committee and the National Republican Senatorial Committee after he was accused of sexual misconduct against teenage girls. Mr. Moore has denied the accusations and the Republican National Committee restored its support after he was endorsed by President Trump.\n\nTony Mendoza, a California state senator, was removed from his leadership positions and placed on a paid leave of absence pending an internal investigation into accusations of sexual harassment by three women. Mr. Mendoza disputed the accusations.\n\nJeff Hoover resigned from his position as speaker of Kentucky’s House of Representatives after a report that he settled sexual harassment claims made by an employee. Mr. Hoover, who remained in the Legislature as of Feb. 7 and plans to run for re-election, denied claims of harassment.\n\nBrett Ratner, a producer and director, stepped away from all activities related to a $450 million agreement to cofinance films with Warner Bros. after he was accused of sexual assault or harassment by six women. A lawyer for Mr. Ratner denied the accusations.\n\nKen Baker, a journalist for the E! network, was pulled from the network’s shows while its parent company, NBCUniversal, investigated accusations that he had sexually harassed two women at the network. Mr. Baker said he was “disturbed by these anonymous allegations.” A third woman later accused him of inappropriate touching when they worked together at Us Weekly. In November, E! News and Mr. Baker decided to part ways, a decision they said was unrelated to the investigation.\n\nJames Toback, a screenwriter and director, was dropped by his agent after 38 women accused him of sexual misconduct. He denied the accusations in a profanity-laden interview with Rolling Stone. Since The Los Angeles Times published its investigation, hundreds of women have reached out to describe their encounters.", "images": ["https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/lubin.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/schwahn.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/goodman.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/halperin.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/jurvetson.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/hazen.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/signore.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/webster.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/no-pic.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/oreskes.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/scoble.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/dick.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/schoen.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/malik.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/wynn.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/najera.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/meehan.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/lauer.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/davis.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/guillod.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/savino.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/dababneh.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/kozinski.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/fish.jpg", "https://static01.nyt.com/images/2017/11/10/us/men-accused-sexual-misconduct-weinstein-1510370544262/men-accused-sexual-misconduct-weinstein-1510370544262-facebookJumbo-v3.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/masterson.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/kihuen.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/bittel.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/palomarez.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/iuzzini.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/kreisberg.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/franks.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/conyers.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/franken.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/rose.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/pishevar.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/louis.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/tambor.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/westwick.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/weinstein.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/spurlock.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/steele.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/mcnabb.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/wieseltier.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/edelstein.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/pacelle.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/price.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/dutoit.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/besh.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/gomes.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/horovitz.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/rosen.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/germano.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/genocchio.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/simmons.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/keillor.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/batali.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/landesman.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/cornish.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/berganza.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/stein.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/martins.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/jrichardson.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/lizza.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/richardson.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/cirrincione.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/bocanegra.jpg", "https://static01.nyt.com/newsgraphics/2017/11/09/sexual-harrassment-claims/9c2547d406e514f3ddae868f75d51e75d62e59b7/spacey.jpg"], "top_img": "https://static01.nyt.com/images/2017/11/10/us/men-accused-sexual-misconduct-weinstein-1510370544262/men-accused-sexual-misconduct-weinstein-1510370544262-facebookJumbo-v3.jpg", "keywords": [], "authors": ["Sarah Almukhtar", "Michael Gold", "Larry Buchanan"], "canonical_link": "https://www.nytimes.com/interactive/2017/11/10/us/men-accused-sexual-misconduct-weinstein.html", "title": "After Weinstein: 71 Men Accused of Sexual Misconduct and Their Fall From Power", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "fb": {"app_id": 9869919170}, "twitter": {"site": "@nytimes", "url": "https://www.nytimes.com/interactive/2017/11/10/us/men-accused-sexual-misconduct-weinstein.html", "title": "After Weinstein: 71 Men Accused of Sexual Misconduct and Their Fall From Power", "description": "A list of men who have resigned, been fired or otherwise lost power since the Harvey Weinstein scandal broke.", "image": "https://static01.nyt.com/images/2017/11/10/us/men-accused-sexual-misconduct-weinstein-1510370544262/men-accused-sexual-misconduct-weinstein-1510370544262-videoSixteenByNineJumbo1600-v3.jpg", "card": "summary_large_image"}, "sourceApp": "nyt-v5", "applicationName": "interactive", "foundation-build-id": "nyt-v5", "PT": "Multimedia", "PST": "Interactive", "tom": "interactive_feature", "hdl": "After Weinstein: 71 Men Accused of Sexual Misconduct and Their Fall From Power", "slug": "men-accused-sexual-misconduct-weinstein", "lp": "A list of men who have resigned, been fired or otherwise lost power since the Harvey Weinstein scandal broke.", "dfp-ad-unit-path": "us", "keywords": "#MeToo Movement,Sexual Harassment,Sex Crimes,Weinstein, Harvey,C K, Louis,Stein, Lorin,Lizza, Ryan,Franks, Trent,Masterson, Danny (1976- ),Huff, Justin,Lauer, Matt,Keillor, Garrison,Levine, James,Conyers, John Jr,Simmons, Russell,Franken, Al,Cornish, Tony,Price, Roy (1967- ),Spacey, Kevin,Besh, John (1968- ),Rose, Charlie", "article": {"collection": "https://static01.nyt.com/services/json/sectionfronts/us/index.jsonp", "published": "2017-11-11T04:25:17.000Z", "modified": "2018-05-24T22:26:23.678Z", "section": "U.S.", "author": "http://www.nytimes.com/by/larry-buchanan", "tag": "Rose, Charlie", "opinion": "false", "content_tier": "metered"}, "DISPLAYDATE": "Nov. 10, 2017", "dat": "Nov. 10, 2017", "author": "Larry Buchanan", "robots": "noarchive", "articleid": 100000005547526, "nyt_uri": "nyt://interactive/5e2d6fc7-2c28-5cab-9850-7ec9f1d50e7c", "pubp_event_id": "pubp://event/edb8bc247cd4407a8957a1591f29b4f3", "description": "A list of men who have resigned, been fired or otherwise lost power since the Harvey Weinstein scandal broke.", "image": "https://static01.nyt.com/images/2017/11/10/us/men-accused-sexual-misconduct-weinstein-1510370544262/men-accused-sexual-misconduct-weinstein-1510370544262-facebookJumbo-v3.jpg", "byl": "By Sarah Almukhtar, Michael Gold and Larry Buchanan", "thumbnail": "https://static01.nyt.com/images/2017/11/10/us/men-accused-sexual-misconduct-weinstein-1510370544262/men-accused-sexual-misconduct-weinstein-1510370544262-thumbStandard-v2.jpg", "news_keywords": "MeToo Movement,Sexual harassment,Rape,Harvey Weinstein,Louis C K,Lorin Stein,Ryan Lizza,Trent Franks,Danny Masterson,Justin Huff,Matt Lauer,Garrison Keillor,James Levine,John Conyers Jr,Russell Simmons,Al Franken,Tony Cornish,Roy Price,Kevin Spacey,John Besh,Charlie Rose", "pdate": 20171110, "og": {"url": "https://www.nytimes.com/interactive/2017/11/10/us/men-accused-sexual-misconduct-weinstein.html", "type": "article", "title": "After Weinstein: 71 Men Accused of Sexual Misconduct and Their Fall From Power", "image": "https://static01.nyt.com/images/2017/11/10/us/men-accused-sexual-misconduct-weinstein-1510370544262/men-accused-sexual-misconduct-weinstein-1510370544262-facebookJumbo-v3.jpg", "description": "A list of men who have resigned, been fired or otherwise lost power since the Harvey Weinstein scandal broke."}, "CG": "us", "hostApp": "vi", "typ": "int", "template": "interactive", "ver": "nyt5", "sov": 1, "vp": "small", "test": "projectvi", "gpt-beta": "vqwdtftx", "prop": "mnyt", "plat": "mweb", "edn": "us", "als_test": 1587285154440, "brandsensitive": "true", "per": "weinsteinharvey,cklouis,steinlorin,lizzaryan,frankstrent,mastersondanny1976,huffjustin,lauermatt,keillorgarrison,levinejames,conyersjohnjr,simmonsrussell,frankenal,cornishtony,priceroy1967,spaceykevin,beshjohn1968,rosecharlie", "des": "sexcrimes", "auth": "larrybuchanan,michaelgold,sarahalmukhtar", "coll": "usnews", "artlen": "short", "ledemedsz": "none", "section": "us", "si_section": "us", "id": 100000005547526, "gscat": "gs_t", "adtargeting": "{\"typ\":\"int\",\"template\":\"interactive\",\"ver\":\"mvi\",\"sov\":\"1\",\"vp\":\"small\",\"test\":\"projectvi\",\"ref\":\"\",\"refdom\":\"\",\"abra_dfp\":\"\",\"gpt-beta\":\"vqwdtftx\",\"prop\":\"mnyt\",\"plat\":\"mweb\",\"edn\":\"us\",\"als_test\":\"1587285154440\",\"brandsensitive\":\"true\",\"per\":\"weinsteinharvey,cklouis,steinlorin,lizzaryan,frankstrent,mastersondanny1976,huffjustin,lauermatt,keillorgarrison,levinejames,conyersjohnjr,simmonsrussell,frankenal,cornishtony,priceroy1967,spaceykevin,beshjohn1968,rosecharlie\",\"des\":\"metoomovement,sexualharassment,sexcrimes\",\"auth\":\"larrybuchanan,michaelgold,sarahalmukhtar\",\"coll\":\"usnews\",\"artlen\":\"short\",\"ledemedsz\":\"none\",\"section\":\"us\",\"si_section\":\"us\",\"id\":\"100000005547526\",\"gscat\":\"gs_t\"}", "adunitpath": "/29390238/nyt/undefined"}, "movies": [], "publish_date": 1510243200.0, "source": "https://www.nytimes.com", "summary": ""}