{"url": "https://ew.com/article/2016/09/26/this-is-us-creator-episode-2-reveal/", "text": "Image zoom\n\nThis Is Us type TV Show network NBC Where to watch Close Streaming Options\n\nJust when you thought it couldn’t get any twistier…\n\nThis Is Us proved on Tuesday night that not only does it have life beyond a magical pilot, but that it isn’t running low on shock power either, delivering another emotional jolt in the final scene of episode 2. One week after learning that this collection of thirtysomethings are more connected than we initially thought — Jack (Milo Ventimiglia) and Rebecca (Mandy Moore) are the parents of the Big Three, a.k.a. Kate (Chrissy Metz), Kevin (Justin Hartley) and Randall (Sterling K. Brown) — we discovered that William (Ron Cephas Jones) was secretly feeding a cat! Nope, that’s not it. That Kevin was kissing off Hollywood and moving to New York to do theater! Also interesting, but not what we’re talking about. That we opened the episode with a flashback not immediately after the birth of the Big Three but eight years later, scattering our bearings all over the place? That was a disorienting delight, but that’s not it either. What was it? Oh, right: Our patriarch and matriarch — the loving foundation of this family — are no longer together.\n\nWhen Jack was struggling with his parental responsibilities and nursing a few too many bourbons at the local bar, his best friend, Miguel (Castle alum Jon Huertas) was right there to tell Jack to take stock of his many blessings at home, especially his attractive wife (whose derriere he complimented), and he noted that he was “jealous” of their relationship. After Jack ambled home and Rebecca dropped a rather devastating speech about his increasingly distant role as a parent (“I’m done letting you lower our score”), Jack sobered up in all senses of the word, vowed to quit drinking, and gave her a moon necklace, to which she promised, “I’m never going to take it off.” And so things returned to happy… right up until the end of the episode, when the doorbell at Randall’s house rang and one of his children announced, “Grandma and Grandpa are here!'” Oh, Grandma was there all right, wearing her moon necklace as promised. But it turns out that this Grandpa was actually Miguel.\n\nEnd of episode. Beginning of anxious questions.\n\nRELATED: This Is Us: Before They Were Stars\n\nAllow This Is Us creator Dan Fogelman to break down that cliffhanger and preview what’s to come.\n\nENTERTAINMENT WEEKLY: You walloped us again.\n\nDAN FOGELMAN: The ending is a real mystery: What the f— happened there? Did the issues that obviously plagued their marriage like any couple catch up with them? Did something else happen? Was there a divorce? Did somebody cheat? Did somebody die? What is the story there?\n\nGiven that we bought Jack and Rebecca as the epic love story at the center of the show up until now, what can you hint about their relationship in future episodes?\n\nTheir marriage in the series, or the first season of the show, is a real marriage with ups and downs. The show is always hopeful, even though it’s heavy and not everything is perfect. It’s fair to say that there can be sadness and sad endings to things for these two, but I think as their love story goes, it’s a hopeful and romantic one, too. Every week is not a slog watching those people from the pilot turn bad. They’re in love in the way that people fall in love in movies. It’s soulmate kind of stuff, right? But that’s not to say they can’t separate, or divorce, or die. But at the end of whatever their journey is — and we haven’t even gotten there yet — I like to think that great love still exists at the end of it, wherever it ended.\n\nWhen you’re watching, part of you immediately feels protective of Jack, thinks back on the episode and wonders, “Was this guy honing in on Rebecca? Or was he a great guy who comforted her after he was out of the picture?”\n\nOne hundred percent. I think the audience will now be guessing what happened, and there’s more to it all than that. Even the questions we’ve asked right now, there’s going to be different questions that come later. I think that in this show, no one’s evil and no one’s out to do bad, but everybody’s flawed because we’re all human, right? But the feelings are real. People are really in love, and people are really trying to do the right thing, even when things are crumbling… There’s stuff that’s gone on here. It doesn’t mean it was dark, depraved s—, but stuff has happened. And so I think that’s part of the journey for the audience, is watching that unfold.\n\nRELATED: Hear why This is Us is one of fall’s best new shows\n\nWhen will we get more answers about Rebecca ending up with Miguel? Is it something where you drop that bomb and then we don’t revisit that for episodes to come?\n\nOr potentially a season, even. There’s a typical device in an episode of television, where you start with a scene that seems crazy and then you go 48 hours earlier and you rewind, and then you see the whole episode’s about how did these normal characters get to this crazy place? We’re doing that on a kind of big, macro level. We go: I know this ending piece — or this middle piece as it might turn out to be. Now I’m going to go on this journey with the show for a season that’s going to get me from, “How did that happen in episode 2 of this show,” and it’s going to get me all the way there in the course of the season.\n\nSo fair to say we will have to hold tight for a bit before we get more answers on that question.\n\nI think so. There are some questions that are going to be not answered for seasons, and it’ll always make sense. We’re being very careful not to do something and then say “Oh, s—, that doesn’t make sense with what we’re going to be doing later,” but there are some questions in the series. Otherwise we’re just unfolding too much stuff too quickly. It’s that fine line where you also want to satisfy and not frustrate. But yeah, how people got together, we’re really going to play that.\n\nNEXT: About that moon necklace…[pagebreak]\n\nShould we read the fact that she’s wearing the moon necklace as a sign of their connection? That maybe things didn’t end in divorce or so bitterly?\n\nI think we should. It’s a “Whoa.” But now you’re very curious how it happened. I think if you watch the show and you love the show and people are starting to find it already in such a big way, I think you can feel the heart of the show. And I think it should give the audience comfort that the characters are going to make terrible mistakes, the characters are going to do bad things, but at the end of the day, it doesn’t have a dark view of people and there’s deep love everywhere.\n\nRandall’s “Hey, Miguel” was a little chillier than his “Hey, Mom!” Do you want the audience to study his reaction?\n\nI think so. Sterling’s so great because I made him do this 150 times because it was such an important ending. You wouldn’t describe it as cold, you would describe it as slightly less warm than he greets his own mother, which is kind of how we greet step-people. It’s not mean. But I think different characters have different reactions to Miguel in the show as we move forward. Randall is probably the most tolerant. He lives the closest by, but there’s still a little bit of awkward distance in that dance, because as you learn about when this all happened and how it all happened, it’s uncomfortable. We’re left wondering: “Were there affairs? Did a marriage break apart? Did Jack somehow pass away? Did something else happen?” So you learn it as it goes.\n\nWhat was Jon’s reaction when you told him he’d be.. the other guy?\n\nWhen Jon was cast, he came in knowing where that character was going. The biggest surprise for Mandy and Jon was, “Oh, you’re also going to be playing that [older] version of yourself.” That was something that Mandy didn’t know. I was like, “Oh and Mandy, we’re going to try to do something crazy here.” She was totally game… My promise to her was if we don’t get it right, we have what we call a ripping-the-parachute cord, and we were also simultaneously saying, “Do we need to do something else?” Our makeup team and hair team just blew me away, and I was so happy with what they did, so that locked in a couple weeks before we shot it.\n\nWill we see present-day Jack, too?\n\nHe’s game. I mean, what better thing for an actor? What scarier thing for an actor? We haven’t shot old Milo yet…. Both Mandy and Milo strangely can float through different periods easily, and it feels very authentic.\n\nWilliam didn’t seem eager to greet Randall’s mother at the door.\n\nI think the read right now is that he wants to give Randall a moment without bombarding his adoptive parents with his biological father. Coming next week we’re going to learn that it’s a little more than that.\n\nWhat can you tease about episode 3?\n\nIt will be the first time we explore young William. We go back to the birth of the family, we go back to that time period where we start the pilot and a lot of secrets are revealed. And there’s something very visceral about the episode in a different way than the first two have been, which are also really emotional and fulfilling. It’s crazy.\n\nTo read what Mandy Moore and Milo Ventimiglia said about the big reveal in episode 2, click here.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2016%2F09%2Fthisisus.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2057'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F13%2Fbetter-call-saul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2Frhbh-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F09%2Flennykravitz.jpg%3Fw%3D768", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2019%2F03%2Fnup_185862_1462-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F115093_46282_b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F09%2FHomeland_810_4979_R.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F115093_48676b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F11%2Frolestout.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F17%2FNUP_189932_0195.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2FListen-to-Your-Heart.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F10%2Fcelebrity-binge.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F116494_0767b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-voice-rec.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Frhony.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2064'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F12%2Fsnl.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2Fdee-rogan-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1562&h=818&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2016%2F09%2Fthisisus.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F03%2Fgreys-anatomy-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Fevan-rachel-wood-aaron-paul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-challenge-b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Foutlander-sea5.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F116400_1225b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2FRVD417d_0162b.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1562&h=818&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2016%2F09%2Fthisisus.png", "keywords": [], "authors": ["Dan Snierson", "Seija Rankin", "Jodi Walker", "Maureen Lee Lenker", "Andy Hoglund", "Dalton Ross", "Chancellor Agard", "Samantha Highfill", "Sydney Bucksbaum", "James Hibberd"], "canonical_link": "https://ew.com/article/2016/09/26/this-is-us-creator-episode-2-reveal/", "title": "This Is Us creator on episode 2's gut-punch ending", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "entertainment, entertainment news, ew, entertainment weekly", "news_keywords": "entertainment, entertainment news, ew, entertainment weekly", "description": "This Is Us creator on episode 2's gut-punch ending", "og": {"title": "'This Is Us' Creator Dan Fogelman on Episode 2's Game-Changing Reveal", "type": "article", "site_name": "EW.com", "url": "https://ew.com/article/2016/09/26/this-is-us-creator-episode-2-reveal/", "description": "[tempo-video id=\"5116889022001\" account=\"219646971\"] Just when you thought it couldn’t get any twistier… This Is Us proved on Tuesday night that not only does it have&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1562&h=818&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2016%2F09%2Fthisisus.png", "width": 1562, "height": 818}}, "pinterest": {"url": "https://ew.com/article/2016/09/26/this-is-us-creator-episode-2-reveal/", "description": "This Is Us creator on episode 2's gut-punch ending", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2016%2F09%2Fthisisus.png"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/article/2016/09/26/this-is-us-creator-episode-2-reveal/", "title": "'This Is Us' Creator Dan Fogelman on Episode 2's Game-Changing Reveal", "description": "This Is Us creator on episode 2's gut-punch ending", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1562&h=818&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2016%2F09%2Fthisisus.png"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}}, "movies": [], "publish_date": 1474819200.0, "source": "https://ew.com", "summary": ""}