{"url": "https://www.cheatsheet.com/culture/how-barron-trumps-life-is-different-from-other-first-children.html/", "text": "Numerous children have lived at the White House over the course of American history. Barack Obama’s two daughters, Malia and Sasha, grew up there. And Barron Trump, the youngest son of Donald Trump, now lives at the White House with his parents. But Barron’s life at the White House is quite different from the lives that other first children had at 1600 Pennsylvania Ave.\n\nRead on to get all the details, including the biggest way Barron Trump’s life at the White House is unique (page 9).\n\n9. Barron Trump is the only first son to live at the White House since the Kennedy era\n\nHe has a lot in common with other first sons. | Chris Kleponis-Pool/Getty Images He has a lot in common with other first sons. | Chris Kleponis-Pool/Getty Images\n\nPlenty of first sons have lived at the White House — but not recently. In fact, E! News reports that Barron Trump is the first presidential son to live at the White House since John F. Kennedy Jr. And because JFK Jr. was born just a couple of months before the Kennedys moved to the White House in 1961, Barron is the first preteen boy to live at the White House since Charles Taft II. (Taft was 11 years old when his father, William Howard Taft, was elected president in 1908.)\n\nYet Barron does have a surprising characteristic in common with other presidential sons. As E! News explains, all of the sons who were young enough to live in the White House over the past century, such as John Aspinwall Roosevelt, were the youngest of their siblings. Barron Trump, too, is Donald Trump’s youngest child.\n\nNext: Unlike other first kids, he doesn’t own one of these.\n\n8. He doesn’t have a pet at the White House\n\nMany presidents had pets, but the Trumps don’t. | Chip Somodevilla/Getty Images Many presidents had pets, but the Trumps don’t. | Chip Somodevilla/Getty Images\n\nWhile many first children have had pets at the White House, Barron Trump doesn’t. CNN noted that the Trumps broke with “presidential pet tradition” by not adding an animal to the household. That tradition, according to CNN, “dates back to Thomas Jefferson, who kept a mockingbird and a couple of bear cubs during his presidency. Throughout the years, presidential pets became celebrities of sorts.”\n\nMalia and Sasha had two dogs, Bo and Sunny. The Bush family had five pets, including a Scottish terrier named Miss Beazley. And the tradition of first families having pets goes far back in American history. Town & Country notes that in 1861, 7-year-old Tad Lincoln brought his ponies to the White House. And he also kept pet goats, Nanny and Nanko, who slept in his bed with him.\n\nNext: He had already gotten used to this before his dad assumed office.\n\n7. Barron Trump was already famous before his dad became president\n\nHe was used to the spotlight on his family. | Gustavo Caballero/Getty Images He was used to the spotlight on his family. | Gustavo Caballero/Getty Images\n\nAs E! News notes, most first children aren’t used to the spotlight when they move to the White House. But Barron Trump had already had experience with it before Donald Trump even began to campaign for president. “Growing up the son of celebrities in a gilded penthouse at Trump Tower and knowing how to look politely at the occasional camera may have prepared Barron better than most first kids for that famous-but-fiercely-shielded existence,” the publication explains.\n\nNonetheless, Barron’s parents have kept some things out of the spotlight. We know that Melania Trump redecorated the private quarters at the White House. But the Trumps have kept the details private, which Town & Country notes contrasts with a few other first families’ decisions to be very open about what their residence looked like.\n\nNext: He probably doesn’t mind this aspect of White House life.\n\n6. The Secret Service detail probably isn’t a big deal to him\n\nHe already had experience with security. | Timothy A. Clary/AFP/Getty Images He already had experience with security. | Timothy A. Clary/AFP/Getty Images\n\nAnother factor that would have been a big adjustment for other first children but probably didn’t faze Barron Trump? The Secret Service detail that protects him 24/7. Town & Country reports that children living at the White House typically “don’t have much privacy or freedom or movement beyond their private living quarters.”\n\nBut given the heavy security that Barron and Melania got used to while living in New York, that likely didn’t require a big adjustment for Barron upon his arrival in Washington. Nonetheless, his mom did seem to consider it an adjustment. As Vanity Fair learned, Melania said to a friend that she was used to “drivers and security, but now you have the Secret Service outside your door.”\n\nNext: He might have this attitude toward his new home.\n\n5. Barron Trump might consider the White House a downgrade\n\nHe had his own floor in Trump Tower. | Chip Somodevilla/Getty Images He had his own floor in Trump Tower. | Chip Somodevilla/Getty Images\n\nTown & Country points out another way that Barron differs from other children who have lived in the White House. “Barron, who reportedly has his own floor in the family penthouse at Trump Tower, may be the first presidential kid to find the White House a downgrade,” the publication explains.\n\nHowever, the White House does have a basketball court, movie theater, swimming pool, bowling alley, billiards room, and jogging track. The White House also employs a full kitchen staff, so Barron can likely get just about anything he wants to eat. Thus, hopefully Barron has found plenty to like about his new home.\n\nNext: He may do this more often than other presidents’ kids.\n\n4. He likely spends more time away from the White House than other first children\n\nThe president travels a lot. | Gustavo Caballero/Getty Images The president travels a lot. | Gustavo Caballero/Getty Images\n\nBecause Donald Trump spends a lot of time at his properties, Barron Trump likely spends more time away from the White House than other first children did. In fact, Donald Trump spent about a third of his first year in office at his properties away from the White House. He also took 97 vacation days, more than the 26 days Barack Obama had taken in the same period of his presidency. So it seems safe to say that even if he travels with his dad only occasionally, Barron Trump lives a more jet-setting lifestyle than other presidential kids.\n\nOf course, many first families have taken vacations. And as Town & Country notes, plenty of former presidents’ kids did some occasional travel. In addition to flying on Air Force One, a few presidents’ children have even gone with their dads on international trips. For instance, while in the White House, Sasha and Malia Obama went with their parents on trips to China and Cuba.\n\nNext: He didn’t follow in the footsteps of other first children in this regard.\n\n3. Barron Trump goes to St. Andrews School instead of Sidwell Friends\n\nHe attends school in Maryland. | Mark Wilson/Getty Images He attends school in Maryland. | Mark Wilson/Getty Images\n\nMost presidents send their school-aged children to private schools in Washington. Donald and Melania Trump followed suit with Barron. But they broke a more recent tradition by skipping the school that several modern first families have picked. Barron goes to St. Andrews School in Potomac, Maryland.\n\nBut several other first kids have gone to the Sidwell Friends School, including Chelsea Clinton and Malia and Sasha Obama. And farther back in history, Tricia and Julie Nixon also attended Sidwell. Plus, former Vice President Al Gore’s son Albert Gore III went there, as did three of former Vice President Joe Biden’s granddaughters.\n\nNext: He and his mother broke tradition in this headline-grabbing way.\n\n2. He didn’t move into the White House right away\n\nHe finished the school year in New York. | Gustavo Caballero/Getty Images He finished the school year in New York. | Gustavo Caballero/Getty Images\n\nIn one of the biggest departures from the traditions set by former presidents and their families, Melania and Barron Trump didn’t move into the White House as soon as Donald Trump assumed office. Instead, they stayed in New York for Barron to finish out the school year at Columbia Grammar and Preparatory School.\n\nIn fact, Barron and Melania didn’t move to Washington until five months into Donald Trump’s presidency. They officially made the move on June 14, 2017. Rolling Stone reported that “Melania is the only first lady in modern history to delay her move to the White House.” The Trump family came under fire over the security costs associated with Melania and Barron staying in Manhattan, especially because much of that money came from taxpayers.\n\nNext: He had doubts about this.\n\n1. Barron Trump had doubts about moving to the White House\n\nHe reportedly didn’t want to move. | Nicholas Kamm/AFP/Getty Images He reportedly didn’t want to move. | Nicholas Kamm/AFP/Getty Images\n\nIn addition to not moving to the White House right away, Barron Trump found himself in the unusual position of expressing doubts about a move to the White House — and then seeing his dad talk about those doubts. As People reports, Donald Trump responded to the publication’s question about whether Barron was excited about living in the White House by saying, “not so much that.”\n\nThe president added, “He does love New York and he loves his school. Not so much living in the White House.” You can’t really blame Barron for having those doubts. But fortunately, Melania Trump later said Barron was “all settled” at the White House and “loves it here.”\n\nRead more: You’ll Never Believe How Many People Have Died in the White House\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2018/03/us-politics-INAUGURATION-PARADE-640x360.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/03/Parade-Celebrates-Presidential-Inauguration-Of-Donald-Trump-640x484.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/03/US-POLITICS-TRUMP-NEW-YEAR-640x426.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/03/First-Family-Arrives-At-The-White-House-640x490.jpg", "https://www.cheatsheet.com/wp-content/uploads/2018/03/First-Family-Arrives-At-The-White-House-640x490.jpg?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.cheatsheet.com/wp-content/uploads/2018/03/President-Trump-And-Melania-Trump-Host-White-House-Easter-Egg-Roll-640x427.jpg?x62514", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2018/03/Trump-Invitational-Grand-Prix-Mar-a-Lago-338x500.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/03/President-Trump-First-Lady-And-Son-Barron-Depart-White-House-En-Route-To-Mar-a-Lago-For-Weekend-640x426.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/03/Trump-Invitational-Grand-Prix--416x500.jpg?x62514", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2018/03/Trump-Invitational-Grand-Prix-Mar-a-Lago-Club-640x498.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/03/First-Family-Arrives-At-The-White-House-640x490.jpg", "keywords": [], "authors": ["Jess Bolluyt"], "canonical_link": "https://www.cheatsheet.com/culture/how-barron-trumps-life-is-different-from-other-first-children.html/", "title": "The Surprising Ways Barron Trump’s White House Life Is Different From Other First Children", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/culture/how-barron-trumps-life-is-different-from-other-first-children.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "As the son of Donald Trump, Barron Trump leads a very different life from other first children.", "og": {"locale": "en_US", "type": "article", "title": "The Surprising Ways Barron Trump's White House Life Is Different From Other First Children", "description": "As the son of Donald Trump, Barron Trump leads a very different life from other first children.", "url": "https://www.cheatsheet.com/culture/how-barron-trumps-life-is-different-from-other-first-children.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-04-02T12:12:10-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2018/03/First-Family-Arrives-At-The-White-House-640x490.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2018/03/First-Family-Arrives-At-The-White-House-640x490.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "white house", "section": "Culture", "published_time": "2018-04-02T12:12:00-04:00", "modified_time": "2018-04-02T12:12:10-04:00"}, "twitter": {"card": "summary_large_image", "description": "As the son of Donald Trump, Barron Trump leads a very different life from other first children.", "title": "The Surprising Ways Barron Trump's White House Life Is Different From Other First Children", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/03/First-Family-Arrives-At-The-White-House-640x490.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1522685520.0, "source": "https://www.cheatsheet.com", "summary": ""}