{"url": "http://www.huffingtonpost.com/michael-bloomberg/terror-suspects-are-buyin_b_564069.html", "text": "It's amazing but true: we can prevent terror suspects from boarding an airplane, but the FBI doesn't have the power to block them from buying dynamite or an AK-47.\n\nI believe strongly that they should. And so do the 500 mayors who are members of our bi-partisan coalition of Mayor Against Illegal Guns.\n\nIt is time to close the \"Terror Gap\" in our gun laws.\n\nThis morning I will be testifying at a hearing of the Senate Homeland Security Committee about the easy access that terror suspects have to guns and explosives. I wanted to share with lawmakers the hard-earned perspective New Yorkers have on this national security risk.\n\nThe car bomb the New York City Police Department found in Times Square on Saturday night was not the only attempted terrorist attack on our city since 9/11 -- far from it. And sadly, it won't be the last.\n\nSince 1990, there have been more than 20 terrorists plots -- or actual attacks -- against our city.\n\nIn the last year alone, the NYPD -- working closely with federal authorities -- prevented two major planned attacks on our City. The first was last May, when the terrorists purchased guns and explosives as part of a planned attack on a Temple and Jewish Center in the Bronx.\n\nThe second was in September, when the City and federal authorities broke up a plot to detonate explosives in the New York City subway system.\n\nAnd, of course, attacks and planned attacks have not been limited to New York.\n\nLast June in Little Rock, Arkansas, a man opened fire at a military recruiting station, killing one private and wounding another. At the time of the shooting, the FBI was already investigating the man after his arrest in Yemen with a fake Somali passport. He was charged with murder and 16 counts of terrorist acts.\n\nAnd on November 5, 2009, Major Nidal Hasan shot 43 people at Fort Hood -- killing 13. We know Hasan was able to buy a handgun despite having been under investigation by the FBI for links to terrorism.\n\nThe Bush Administration first proposed closing the Terror Gap in 2007. But because Congress has failed to act on that proposal, people who may want to do our country harm have been able to buy guns and explosives.\n\nToday, the Government Accountability Office has released new data showing that suspects on the terrorism watch lists were able to buy guns and explosives from licensed US dealers 1,119 times between 2004 and 2010.\n\nThat is a serious and dangerous breach of national security.\n\nThat's why the more than 500 mayors in Mayors Against Illegal Guns, a coalition that I co-chair with Mayor Tom Menino of Boston, support legislation to close the Terror Gap. This issue is a centerpiece of the coalition's fight to strengthen the federal background check system. Today, we have launched a new website -- www.TerrorGap.org -- to help educate Congress and the public about the Terror Gap and its consequences.\n\nThis legislation would give FBI agents the authority to block terror suspects from buying guns and explosives. It would also give them the ability to make exceptions when they determine that blocking a sale might tip off a suspect who is under investigation.\n\nAnd the bill also allows those on the list to appeal their status to the Justice Department -- and challenge the determination in court.\n\nAttorney General Eric Holder supported closing the Terror Gap in testimony before the Senate Judiciary Committee last year. And so does the vast majority of Americans.\n\nA December poll by Republican pollster Frank Luntz found that 82% of NRA members, and 86% of other gun owners, support closing the Terror Gap.\n\nTo learn more and take action, please visit: www.TerrorGap.org.\n\nIn New York City, we are doing everything humanly possible to prevent another terrorist attack. Under Commissioner Kelly's leadership, the NYPD has developed one of the world's most advanced counter-terrorism programs. One thousand of our best officers work on counter-terrorism and intelligence efforts every day.\n\nA key element of any smart counter-terrorism strategy is to make it harder for terrorists to strike.\n\nThat's why air passengers walk through metal detectors.\n\nThat's why our police officers randomly check bags in the subway.\n\nThat's why our police officers patrol sensitive locations.\n\nAnd that's why it's just common sense to give the FBI the authority to keep terror suspects from buying guns and explosives.\n\nNow, finally, it's time for Congress to act and fix the Terror Gap. Visit: www.TerrorGap.org.", "images": ["https://www.facebook.com/tr?id=10153394098876130&ev=PageView&noscript=1", "https://img.huffingtonpost.com/asset/5d88f91b2100003200dab6d8.png", "https://s.m.huffpost.com/assets/H-icon-72fd5782b36a1a42ab82a4af65cbc6dd6ddc4d4a71190a91c5cfaab7c66fd836.svg", "https://sb.scorecardresearch.com/p?c1=2&c2=6723616&c3=&c4=&c5=&c6=&c15=&cj=1", "https://img.huffingtonpost.com/asset/default-entry.jpg?ops=1778_1000", "https://img.huffingtonpost.com/asset/59121db31700003a005a5a7e.jpg?ops=100_100", "https://img.huffingtonpost.com/asset/5bb8d1a12600002d0183b96e.jpeg?ops=scalefit_720_noupscale", "https://s.m.huffpost.com/assets/HuffPostHero-d783f680fb974e80346bdfa145131d058e596e1d32f791981875aa481702c770.svg", "https://www.facebook.com/tr?id=1621685564716533&ev=PageView&noscript=1"], "top_img": "https://img.huffingtonpost.com/asset/default-entry.jpg?ops=1778_1000", "keywords": [], "authors": ["Founder", "Bloomberg Lp", "Bloomberg Philanthropies", "Three-Term Mayor Of New York City", "Bestselling Author Of 'Climate Of Hope'"], "canonical_link": "https://www.huffpost.com/entry/terror-suspects-are-buyin_b_564069", "title": "Terror Suspects Are Buying Guns - and the FBI Can't Stop Them", "meta_data": {"google-site-verification": "97Mj-wW7u8U1NOnkW1rfH-I1kgO0-a9YsgoesOk41R8", "oath": {"guce": {"product-eu": "false", "consent-host": "guce.huffpost.com", "locale": "en-US", "inline-consent": "true"}}, "fb": {"pages": 70242384902, "app_id": 46744042133}, "robots": "max-image-preview:large", "Slurp": "noindex", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "description": "It's amazing but true: we can prevent terror suspects from boarding an airplane, but the FBI doesn't have the power to block them from buying dynamite or...", "keywords": "Bush Administration,New York,Politics,illegal guns,Congress,Obama Administration,Federal Bureau of Investigation,New York City,Terrorism,eric-holder-attorney-general,Guns", "og": {"title": "Terror Suspects Are Buying Guns - and the FBI Can't Stop Them", "type": "blog", "image": {"identifier": "https://img.huffingtonpost.com/asset/default-entry.jpg?ops=1778_1000", "url": "https://img.huffingtonpost.com/asset/default-entry.jpg?ops=1778_1000", "type": "image/jpeg", "width": 1778, "height": 1000}, "url": "https://www.huffpost.com/entry/terror-suspects-are-buyin_b_564069", "site_name": "HuffPost", "locale": "en_US", "description": "It's amazing but true: we can prevent terror suspects from boarding an airplane, but the FBI doesn't have the power to block them from buying dynamite or..."}, "article": {"tag": "Bush Administration,New York,Politics,illegal guns,Congress,Obama Administration,Federal Bureau of Investigation,New York City,Terrorism,eric-holder-attorney-general,Guns", "section": "Politics", "published_time": "2010-07-05 05:12:02 -0400", "modified_time": "2017-12-06 22:00:03 -0500"}, "twitter": {"card": "summary_large_image", "site": "@HuffPostPol", "title": "Terror Suspects Are Buying Guns - and the FBI Can't Stop Them", "image": {"identifier": "https://img.huffingtonpost.com/asset/default-entry.jpg?ops=1778_1000", "width": 1778, "height": 1000}, "description": "It's amazing but true: we can prevent terror suspects from boarding an airplane, but the FBI doesn't have the power to block them from buying dynamite or...", "creator": "MikeBloomberg"}, "al": {"ios": {"url": "huffpostnews:///?editionID=us&entryID=us_564069", "app_store_id": 306621789, "app_name": "HuffPost"}}, "taboola.category": "politics"}, "movies": [], "publish_date": 1278321122.0, "source": "http://www.huffingtonpost.com", "summary": ""}