{"url": "http://abcnews.go.com/ThisWeek/week-transcript-hoyer-boehner-bill-gates/story?id=10900231", "text": "June 13, 2010 \u0097 -- TAPPER (voice-over): Good morning, and welcome to \"This Week.\"\n\nIt keeps getting worse in the gulf, while the nation asks, who's in charge and when will it end?\n\nOBAMA: We talk to these folks so I know whose ass to kick.\n\nTAPPER: And Congress turns up the heat on BP. Our headliners this morning, House Majority Leader Steny Hoyer.\n\nHOYER: We need to get it stopped.\n\nTAPPER: And Minority Leader John Boehner.\n\nBOEHNER: Figure out what the hell went wrong.\n\nTAPPER: Hoyer and Boehner, a \"This Week\" debate.\n\nThen, he revolutionized computing, and now he wants to do the same for energy. In a \"This Week\" exclusive, Microsoft co-founder and chairman Bill Gates outlines his vision for a clean energy future...\n\nGATES: The government playing a strong role is critical and urgent.\n\nTAPPER: ... and what it will cost.\n\nPlus, the roundtable looks at a big night for women in politics. That and all the week's politics with George Will, Democratic strategist Donna Brazile, former Republican Congressman Tom Davis, and former Labor Secretary Robert Reich.\n\nAnd as always, the Sunday funnies.\n\nCOLBERT: Eighty-two billion dollars lost. God. It would be such a tragedy if any pelicans owned BP stock.\n\n(END VIDEO CLIP)\n\nANNOUNCER: From the heart of the nation's capital, \"This Week\" with ABC's senior White House correspondent, Jake Tapper, live from the Newseum on Pennsylvania Avenue.\n\nTAPPER: And joining me now is House Majority Leader Steny Hoyer and House Minority Leader John Boehner. Gentlemen, thanks so much for joining me.\n\nHOYER: Thank you.\n\nBOEHNER: Hey, good morning.\n\nTAPPER: So you got a letter last night -- I actually think I got it before you guys did...\n\nHOYER: I think you did.\n\nTAPPER: ... but from President Obama requesting $50 billion in emergency spending for state and local governments. Leader Hoyer, you have said that there is spending fatigue on Capitol Hill. Can you get this passed?\n\nHOYER: Well, I think it's accurate that there's spending fatigue, not only on Capitol Hill, but around the country. People are concerned about the debt level, and we are, as well. But clearly, you cannot not continue to stimulate an economy that is still struggling to get out of the deep ditch that we found it in about 18 months ago.\n\nWhat the president is saying is, we need to expend additional dollars to make sure that we don't have significant layoffs in the next few months, which will again depress the economy, so that -- I understand what he's saying. I have asked the White House to look at the package that we -- the Recovery and Reinvestment Act that we passed, approximately $800-plus billion. There are clearly funds in there that have not been expended to see whether or not there are some available for this more immediate priority than some that may not be quite as immediate.\n\nTAPPER: Leader Boehner, the president said in his letter that if this does not pass, the economy -- there's a risk that the economy will slide back into recession. Do you agree?\n\nBOEHNER: Listen, I'm concerned about the plight of teachers, firemen, policemen who face the real possibility that they may be laid off, but to send this letter up here on a Saturday night with no opportunity to cut spending elsewhere in the budget strikes me as a little different. Steny and I and other leaders were at the White House on Thursday, and this subject never came up.\n\nThere was no indication this was going to happen. And I'm asking myself, why is this happening on Saturday night?\n\nFact is that the spending spree in Washington is continuing to run unabated. The American people are screaming at the top of their lungs, \"Stop!\" And -- and to move this without finding other offsets in spending, I think, is irresponsible. It's just putting more debt on the backs of our kids and our grandkids, and it really begs the question is, why don't we have a budget this year?\n\nYou know, we've not cut -- the House has failed -- not failed in the modern era to move a budget. And this appears to be the first time in the modern era that the House is not even going to consider a budget.\n\nTAPPER: Well, Leader Hoyer, if I could...\n\n(CROSSTALK)\n\nTAPPER: ... if I could say, one of the -- the theory is that you don't want to make vulnerable Democrats vote for another spending bill, and that's why for the first time since 1974 there isn't going to be a House budget. Is that not true?\n\nHOYER: Whatever -- whatever the theory may be, Jake, the fact of the matter is, my friend, Mr. Boehner, voted for $2 trillion during the Bush administration of unfunded spending. So when he says this cascade of spending, he...\n\n(CROSSTALK)\n\nTAPPER: But you agree that this should be offset with spending cuts?\n\nHOYER: I would hope that we could do that, yes. However, what I said was, money that has already been appropriated in the Recovery and Reinvestment Act that has not yet been spent could be spent now on these priority items. Nobody wants to see $300,000 teachers or fire and police laid off. That's not good for the economy; it's not good for our kids; it's not good for the safety of our communities.\n\nSo the president's absolutely right in terms of this being critically important spending, and we're going to work on getting that. I personally believe that if we have dollars that are not yet expended in the Recovery Act that we can apply to this immediate need and then look to later expenditures in the long term for investments, I think we ought to do that. But we can't -- we can't stimulate and depress at the same time.\n\nTAPPER: I'd like to -- I'd...\n\nBOEHNER: Jake, every family knows that in a tough time it's more important to have a budget, not less. And if you think that they're going to move a budget on Capitol Hill, you must obviously believe that Elvis is still alive.\n\nTAPPER: Well, I'd -- I'd like to move on to another topic...\n\nHOYER: I know you do...\n\nTAPPER: ... other than Elvis.\n\nHOYER: ... but as you know, the Republicans didn't have a budget in '02, '04, '06.\n\nBOEHNER: The House has never failed to pass a budget in the modern era.\n\nHOYER: And the American public had no idea about that, budgets that pass...\n\nBOEHNER: Well, this is a great opportunity...\n\nHOYER: ... and spending bills that follow (ph).\n\nBOEHNER: ... to cut spending and to get the economy going again.\n\nHOYER: And we're doing that.\n\nBOEHNER: That's why I gave the president...\n\nHOYER: Let me close with this.\n\nBOEHNER: ... a letter this week with -- 100 economists signed a letter saying that cutting spending now will, in fact, help get the economy moving again, get jobs back...\n\n(CROSSTALK)\n\nTAPPER: I would like -- in terms of getting things moving again, I would like to move to another topic...\n\nHOYER: Look, can I conclude on the deficit? Because the president -- we've adopted statutory PAYGO, which they jettisoned.\n\nBOEHNER: And you've ignored it every time you've had a chance to use it.\n\nTAPPER: All right, guys...\n\nHOYER: The president sent down a freeze in spending. And he established a commission to look at long-term spending control. All of that is positive movement.\n\nTAPPER: Let's move on to the oil spill.\n\nBOEHNER: The American people want spending cut now.\n\nTAPPER: Got it. Let's move on to the oil spill, because I want to get your reaction. On Tuesday, the BP chief operating officer, Doug Suttles, told the Associated Press that the flow \"should decrease to a relative trickle by Monday or Tuesday.\" That's by tomorrow or the day after that, Doug Suttles said that.\n\nI don't know what a relative anything means when it comes to this oil spill, but there's no indication that there's going to be -- it's only going to be trickling by tomorrow or the next day. And I just want to know, as the leaders of your respective parties on Capitol Hill, are you finding it tough to believe anything these guys from BP have to say anymore?\n\nHOYER: Certainly BP has not been accurate in its representations. It has been misleading in its representations. What has happened is outrageous, and the American public are correctly very, very angry. And the administration has been marshalling every asset that we have available to work on this program.\n\nI hope he's right. The American public hopes he's right. A trickle. I don't know what a trickle is. But certainly a very, very substantial reduction. BP said they could handle a 250,000-barrel spill. They have -- weren't able to handle what they said was initially a 5,000, which was -- what then went to 20,000 or 25,000 and now we think is a much greater spill than that.\n\nBOEHNER: Well, Steny, guess what? I agree wholeheartedly with you. The American people want this oil leak stopped now. They want to know what happened. They want the gulf cleaned up. And they want it all done now.\n\nAnd I just think that BP ought to be held responsible for all of the costs that are involved in this. I've said that right from -- from the beginning. And I continue to believe that.\n\nI'm sure that the federal government, though, was -- isn't also responsible. The laws that were in place, the -- the materials that should have been in place for a spill this size were not, and the reaction, I think, on the part of the administration has been slow. But having said that, it's time to get this thing stopped now.\n\nTAPPER: All right, just to...\n\nHOYER: The only thing I would say to that, Jake...\n\nTAPPER: ... just to clear up what you said earlier this week, on Thursday, you said that -- that BP and the federal government should take full responsibility. To clarify that, you think BP needs to pay?\n\nBOEHNER: I've said from the beginning, BP needs to pay for the entire cost of this. But the federal government -- this is a failure of government. Government is there to protect our shores, to protect our environment. And there's been a real failure here.\n\nWe've been asking for 55 days, where's the inspection reports from this rig? The administration won't give them to us.\n\nTAPPER: The Democrats are pushing a bill to lift the liability. Right now, it's at $75 million. Democrats are pushing a bill to lift the liability cap. Do you support that?\n\nBOEHNER: I believe that lifting the liability cap on BP and for this spill is appropriate. I have concerns...\n\nTAPPER: So lift it entirely for BP?\n\nBOEHNER: Absolutely. They should be held responsible for every dime of this cost.\n\nHOYER: Let me -- let me -- let me say a few words here. First of all, the Republicans have been holding up lifting the cap in the Senate from the $75 million, minuscule sum, as we see, to $10 billion.\n\nSecondly, I think John Boehner is right in this respect: The psychology of neglect in terms of regulatory oversight that was pursued in the Bush administration, which led to the banking failure, insurance prices going way up, and oil companies thinking they could do whatever they wanted because the \"drill, baby, drill\" crowd, all they wanted them to do was to drill.\n\nSo I think John's right. I think the regularly psychology of the last administration was not appropriate, and there was mistakes made in this administration, as well.\n\nBOEHNER: How long are you going to blame the Bush administration? Come on. What's going on over at MSS...\n\nHOYER: As long as they're responsible, whether it's the economy...\n\nBOEHNER: No, that's -- listen...\n\nHOYER: ... or their lack of oversight, John, I'm going to do that.\n\nBOEHNER: Where -- where -- when is someone...\n\nHOYER: As appropriate (ph).\n\nBOEHNER: ... in Washington going to -- Washington going to take responsibility for what they are in charge of?\n\nTAPPER: I want to move on...\n\nHOYER: And the administration has done that.\n\nTAPPER: I want to move on to some foreign policy questions, but before I do, I just -- there -- there was a poll recently this week indicating that the American people rate the federal response to this oil spill as worse than the federal response to Katrina, 69 percent negative for the gulf oil spill, 62 percent negative for the government's response to Katrina. Do you rate the government's response to this oil spill as negative or positive?\n\nHOYER: Absolutely not. I think that that's -- the American public are angry, rightfully so. BP was on site. The folks who own the rig, Halliburton, who constructed the piping, the concrete down there, they are responsible with the federal government was (ph).\n\nImmediately upon this incident happening -- immediately...\n\nTAPPER: So you think the government's responsible?\n\nHOYER: ... the Coast Guard -- the Coast Guard was on site. Unfortunately, tragically, we lost 11 lives, but saved over 100 lives on site. Thad Allen, the admiral, immediately put in charge, 17,500 National Guard troops on duty right now.\n\nTAPPER: OK.\n\nHOYER: So there's been a vast response here. A natural disaster came along in Katrina, and, frankly, there were months before there was adequate response.\n\nTAPPER: Leader Boehner, turning to Israel, a member of your leadership team, Congressman Mike Pence of Indiana, said this on Thursday.\n\n(BEGIN VIDEO CLIP)\n\nPENCE: Remarkably, yesterday, the president said it was time for Israel to sharply limit its effective blockade in Gaza, saying, quote, \"The situation in Gaza is unsustainable.\" The truth is, Mr. President, your policy in Israel is unsustainable. The American people are on the side of Israel and Israel's right to defend herself. Mr. President, whose side are you on?\n\n(END VIDEO CLIP)\n\nTAPPER: Leader Boehner, is expressing concern about the humanitarian crisis in Gaza the same thing as being anti-Israel?\n\nBOEHNER: Well, I think the Israelis have a clear right to -- to defend themselves. When you look at this flotilla that came over, the first five ships that were inspected, there was no -- there was no problem at all. It's pretty clear to many of us who've looked into this that this last ship was intended to be a problem, intended to cause a conflict.\n\nAnd this is part of a much bigger problem that we see with the administration, where we've -- we've coddled our enemies and -- and pushed our friends aside in the process...\n\nTAPPER: Leader Hoyer?\n\nBOEHNER: ... raising a lot of doubts around the world, including the people of Israel, who are having serious doubts about our commitment to them, our closest ally in the Middle East.\n\nHOYER: And I think one of the problems is, when you see Mr. Pence and you hear Mr. Boehner, this is not a partisan difference. Mr. Cantor and I had a colloquy on Thursday, which as John knows, I strongly support Israel's actions.\n\nThey told these folks, come here, you're not going to break the blockade. Why are you not going to break the blockade? Because Hamas, a terrorist organization, continues to attack civilians, men, women and children, in Israel.\n\nAnd it is appropriate to have a blockade to make sure they don't get the weapons or other materials to effect those kinds of attacks, which are criminal, which are terrorist acts. So I think they did exactly the right thing in stopping that.\n\nAnd in fact, in my view, the sixth ship, as John has pointed out, we agree on this, five ships were stopped without incident. This sixth ship was stopped. There's some reason to believe that that's exactly what they intended to do. Al Jazeera television showed attacks on the boarding party, and they responded in self-defense.\n\nTurkey knew that if these ships came, it was going to be a problem. And the Israelis offered to allow the -- those ships to be offloaded at an Israeli port and all the humanitarian gear go into Gaza. That was the appropriate thing to do.\n\nTAPPER: We only have one minute left, and I want to get your predictions for the midterm elections, literally one minute left. So...\n\nHOYER: History says we're going to lose a few seats, but we're going to retain the House.\n\nTAPPER: You're going to keep the House?\n\nHOYER: We're going to keep the House.\n\nTAPPER: Sir?\n\nBOEHNER: Our goal is to take the majority in the House...\n\nTAPPER: Not your goal. What's going to happen? Prediction. Prediction. You've said 100 seats. Can you do it?\n\nBOEHNER: We've got -- we've got 100 seats in play. We have a real shot at winning a majority so that we can put a check on this administration and all the spending that's out of control here in Washington, D.C.\n\nHOYER: Jake, they said that about Mark Critz in the 12th District of Pennsylvania. He won by 8 points.\n\nTAPPER: All right.\n\nHOYER: We're going to keep the House.\n\nTAPPER: Leader Hoyer, Leader Boehner, thanks so much for joining us. I appreciate it.\n\nTAPPER: Joining me now, Microsoft co-founder and chairman, Bill Gates.\n\nMr. Gates, thanks so much for joining us.\n\nBILL GATES, MICROSOFT CO-FOUNDER & CHAIRMAN: Great to be here.\n\nTAPPER: Obviously, the oil spill in the Gulf makes your proposal for $11 billion in energy innovation all the more resonant, all the more relevant. But I'm wondering, some are criticizing the president's handling of the federal response to the spill by saying he doesn't have executive experience and that's why he hasn't been able to -- to really get the federal bureaucracy moving the way it needs to.\n\nAs a former CEO, do you think there's anything to that at all?\n\nGATES: Well, I think in any crisis like this, the key thing is to avoid them happening in the future. And I'm not an expert on oil recovery. BP is certainly incented to try and minimize the damage here in a very complex situation.\n\nBut how did we get an ener -- energy infrastructure that is this fragile?\n\nYou know, we've got a supply chain where we send a billion dollars a year overseas and you can imagine that there will be disruptions. When there have been in the past, we've always said, no, let's put a solution in place. But, in fact, the only real solution is to take American ingenuity and fund R&D to get energy in different forms that we're not sending this much money away and -- and that it's stable and reliable.\n\nTAPPER: Well, let -- let's talk about that. Obviously, your proposal for $11 billion in additional spending for energy innovation, there's not a huge appetite right now among the American people for more spending with the record deficits we have.\n\nForgetting the merits of your proposal for a second, how politically feasible is it?\n\nGATES: Well, I would distinguish between spending and investment. What we're talking about is about 1 percent of what the United States spends on energy, being devoted to R&D. And so if you find a way out of the energy sector to raise that 1 percent, which is not some huge increase in the costs there, then you can tap into the unique ability in this country, through its universities, the national labs and entrepreneurs, to give us a form of energy that is both cheaper, not dependent on foreign supply and is environmentally designed so that we're not emitting carbon and getting into the climate change problem.\n\nThe only way you get those things is through the breakthroughs. And I'm optimistic they're there, but we're not making the investment. Today we spend only about $4 billion on energy R&D compared to $30 billion on health, $80 billion on -- on defense.\n\nTAPPER: So that's your pitch.\n\nHow receptive have you found lawmakers?\n\nGATES: Well, there is obviously a -- a tight budget. And it would be tough to say that this money should come from existing categories.\n\nThe question is can the energy sector finance its own revolution and create these great R&D jobs here in America?\n\nTAPPER: What's the risk if -- if President Obama and Congress and the American people don't do this?\n\nGATES: The problem we'll run into is that we'll have more crises like the oil spill and we'll have the supply disruption. We'll start to see more and more effects of the -- the climate problem. The costs will go up because you're looking for oil in harder and harder places.\n\nSo you'll just be paying more and more. And so it's an implicit tax. If you don't innovate, it's this gigantic cost that we'll be paying.\n\nTAPPER: You know, some experts believe that the only way to spur the kind of innovation and investment in these alternative forms of energy is to dissuade the American people and American enterprise from using oil and gasoline. Do you think that a gas tax is necessary?\n\nGATES: The -- that's not specifically necessary. You need some source of funding for this R&D. And, you know, so you would take some parts of the energy sector and -- and raise the money there. If you -- if you want people to switch, there's two ways to do it. One is to invent something that's lower cost. The other is to raise the cost of the thing that's forcing us to fund the military or creating climate problems and -- and help the new technology. The bulk of what's missing right now that will force us, at some point, to go for a very expensive alternative because we haven't done invention, is the -- this -- this R&D piece isn't getting done.\n\nTAPPER: Why do you think that the innovation and technology that's part of the oil industry hasn't advanced enough in the last 30 years, I mean to -- to plug this hole in the Gulf, they're using basically the same technology as they used 20 or 30 years ago?\n\nWhy have -- hasn't that advanced?\n\nGATES: Well, certainly, in retrospect, they needed to invest more in these deep sea operations. Deep sea operation is fairly complicated in terms of pressures and temperatures how materials behave down there. And obviously, you know, now they're seeing the cost of not doing that. That will be reinforced in a lot of ways.\n\nSo that particular innovation will happen. But you're going to get oil in very hard places. With other energy sources, over time, you wouldn't have to try that hard you wouldn't have to be bringing most of it out of the Middle East, where, you know, the chance of something disrupting that in the years ahead is -- is very measurable and -- and we're not -- we're not setting ourselves up to get rid of that over time.\n\nTAPPER: So tell us what areas you're looking at.\n\nGATES: Well, the idea of the Council's report is that you -- you fund R&D very broadly with an open mind. You don't just pick and say it will be synthetic fuels or hydrogen or fuel cells, but you get behind all of those things and you create metrics. In the solar area alone, there's so many different approaches -- solar thermal, solar chemical, solar electric -- and many different scientists. And that's the beauty of America, is you -- you can have hundreds of teams pursuing those things. And as they meet milestones, they can get more funding.\n\nTAPPER: The economic recovery has been slow and relatively jobless.\n\nWhat do you think President Obama needs to do?\n\nGATES: Well, the president can't just pull the levers and -- and make the economy take off. You know, the right emergency steps were taken and...\n\nTAPPER: So you support the stimulus and the TARP program?\n\nGATES: Well, you don't -- I don't think I need to get into the particulars. And it's easy looking back to say, OK, you could have tuned this or that. The incredible measures needed to be taken to make sure there wasn't a collapse, both in terms of stabilizing the financial system and then priming the pump of the economy, because it had been slowed down so much.\n\nNow, we're seeing the benefits that those things have been done. Now this is an international problem.\n\nAnd so everybody's dad is coming in, you know, are -- are those governments over spending?\n\nYou know, our own government is looking at when do you cut back?\n\nAnd it's a tricky thing, because almost everybody agrees we need to keep spending up, you know, not take all country deficits to zero right away. But over time, you have to move in that direction. And so getting the timing right on this is -- is a very tough challenge.\n\nTAPPER: So do you think that there needs to be another stimulus to keep spending up?\n\nGATES: In terms of the U.S. in particular, lots of people, you know, have views that plus and minus on that in terms of if you did a -- a smaller stimulus, where exactly would you target?\n\nYou know, our $16 billion for energy R&D, that's a type of stimulus. That is creating jobs and it's a -- a nice investment in the future. So where you get a twofer like that, that feels particularly attractive that -- that you can do that.\n\nTAPPER: Do you think the health care legislation is going to do enough to contain costs and control the deficit?\n\nGATES: Well, the -- the health care bill broadened coverage. And there's a lot of...\n\nTAPPER: Yeah, but beyond that, do you think it's going to contain...\n\nGATES: Well, in terms of cost containment, that step alone, in my view, is at most the start of how we look at not letting medical costs continue to go up. The projection is they'll continue to go up.\n\nAnd it creates a dilemma that if the government is funding those costs and if you're -- you know, you feel your taxation levels are going to hit some -- some limit, then what are you taking money away from?\n\nYou're not going to take it away from your Social Security. You're not going to take it away from paying the debt.\n\nIt's a tough problem.\n\nSo if we could innovate to reduce those increases in costs that would be great. And I think there's a lot of work to be done there, you know, people – In some respects may be tired of hearing about health care, but in terms of really reducing the costs, no. The -- the years ahead, that's going to -- a lot of experts and politicians are going to have to -- to think about how that's achieved.\n\nTAPPER: Last month, Apple passed Microsoft in market capitalization, making -- it marked a historic moment where -- where Microsoft lost its status as the largest tech company in the world.\n\nWhy did this happen?\n\nAnd -- do you still have confidence in CEO, Steve Ballmer?\n\nGATES: Oh, Microsoft is doing a lot of great stuff. I mean the software industry, you know, the opportunities are -- are pretty phenomenal. You know, the way that people think about TV, the way they think about reading, about learning, software is going to revolutionize that. Our company and our stock has gone up, it's gone down. And, you know, we've been the most valuable, not the most valuable. It -- you know, that's -- that changed and it will change again and again and again.\n\nThere's room for more than one company to succeed in the industry. I -- I happen to like the things that Steve's -- Steve's doing. It's not my full-time work, but as a -- a board member, you know, I -- I see a lot of great things going on.\n\nTAPPER: Bill Gates, thanks so much for joining us.\n\n(BEGIN VIDEO CLIP)\n\nLENO: Eighty-nine-year-old White House reporter Helen Thomas is retiring. I'm going to be the first to say, \"Mazel tov.\"\n\n(END VIDEO CLIP)\n\n(COMMERCIAL BREAK)\n\n(BEGIN VIDEO CLIP)\n\n(UNKNOWN): The Democratic Senate nominee in South Carolina, Alvin Greene...\n\n(UNKNOWN): Oh, Alvin.\n\n(UNKNOWN): ... is a mystery man.\n\nGREENE: So we should be pro-South Carolina, rather than anti-Greene, and speaking of me.\n\nSMITH: Where'd you get the $10,000 grand to file?\n\nGREENE: From my own personal money.\n\n(UNKNOWN): Where did he come from, and how did he win?\n\nOLBERMANN: How do you think the people voted for you on Tuesday knew who you were or even that you were running?\n\nGREENE: You know, I think that they -- they saw -- I think that they -- you know, I just think that they recognize -- I think they -- they heard of my name.\n\n(UNKNOWN): This is for real?\n\n(UNKNOWN): Yes, I am for real.\n\n(END VIDEO CLIP)\n\nTAPPER: The quizzical stylings of Al Greene, the Democratic Senate candidate in South Carolina, one of many topics we'll get to with our roundtable, starting with George Will, former Republican Congressman Tom Davis, from the University of California at Berkeley, Robert Reich, the former Clinton labor secretary, and Democratic strategist Donna Brazile.\n\nThanks, one and all, for being here. Let's start with the oil spill this week. The fallout from the oil spill became transatlantic, George. Check the headlines that we see here. \"Obama killing all our pensions.\" \"Cameron fails to back BP in fight with Obama.\" \"Back off, Obama.\" This is how the British press is treating this disaster. BP, obviously, the biggest company in the U.K.\n\nDo they have a point?\n\nWILL: Well, sure, they do. This is a reminder to Americans at all time that when they attack Wall Street and big business, they're attacking the people who are supporting their pension funds. I don't know how many Americans depend also on BP, but a lot of them do. It's an internationally traded stock.\n\nSo when you turn on the company, the liability of which is unclear at this point, but Congress, according to the interview you just conducted, is thinking of passing something that looks awfully like a bill of attainder, which is to single out for punishment with specific legislation a particular corporation. This is going to -- to ripple through people's 401(k)s and elsewhere.\n\nTAPPER: Tom, when you were in Congress, you were for a time the head of the National Republican Congressional Committee in charge of electing Republicans to Congress, so you were focused on the mood of the public. What does this oil spill do to the mood of the public?\n\nDAVIS: Well, it adds to the narrative where the big institutions have failed us, government, Wall Street, BP. The anger out there, I think, is greater than we've seen in at least a generation, and this adds to the narrative of government sitting there powerless, just making speeches. It's let them down.\n\nTAPPER: Professor Reich, on -- on Wednesday, when President Obama and other White House officials meet with BP executives -- do you like that, that I called you \"professor\"?\n\nREICH: I do, actually, yes.\n\nTAPPER: You're smiling. When he meets with BP executives, one of the things he'll be pushing for is a -- is an escrow account, a third-party escrow account for BP to put money in, and then a third party will give out this money to people whose lives have been impacted by the spill. Where do you see this headed?\n\nREICH: Well, look, Jake, BP does not have unlimited resources. It has a lot. But inevitably, there is going to be a clash, because the costs of this clean-up, the costs of containing the oil spill damage, the costs of plugging that hole are going to be in the tens of billions of dollars. And the question is, how much of this is going to be borne by the American taxpayer and how much by BP?\n\nBut the present spectacle of the Coast Guard asking BP to speed up this clean-up is absurd. I mean, the federal government needs to be in charge. The president needs to be in charge of this. Use BP's expertise. Use BP's resources. But the president must be in charge of all of this. Otherwise, he looks like he's just standing on the sidelines.\n\nBRAZILE: Well, the administration has been constrained by the Oil Pollution Act of 1990, which basically gives the responsible party the lead role in trying to not only fix the problem, but contain the problem. That has been the problem from day one. They've waited for BP to come up with the answers, and we know that BP continues to mislead people.\n\nI don't have any sympathy -- and I -- and I probably have some stock or something in BP, because I have mutual funds, so let me just put that aside and say, all the people of Great Britain, this is not personal. This is not about your national identity.\n\nThis is about a big region of our country that now has to deal with an oil spill that will go on for years and years and years, threatening the livelihood of human beings, marine life, sea life, and a way of life for people who make that their homes, 14 million Americans.\n\nSo when it comes to sympathy, angry, love (ph), go down to the Gulf Coast, because we have all of it. And we're angry. Tomorrow, the BP directors will meet. I hope that they hold that money in escrow. I hope...\n\nTAPPER: The dividend -- the dividend money?\n\nBRAZILE: Absolutely. They made $6.8 billion in profit as of March 31st. Hold it in escrow until the investigation is completed. And while they're at it, process these claims.\n\nPeople are waiting, waiting in line now in St. Bernard Parish for food because they cannot go out and fish. They can't hunt, so they can't feed their families. They can't pay their mortgage. I have a lot of anger. I don't want my president to be angry. I have it for him.\n\nREICH: Go beyond escrow. Go into temporary receivership.\n\nTAPPER: You think that the Obama administration should take control of BP or BP America?\n\nREICH: BP America, absolutely, Jake. Otherwise, not only is this a political disaster-in-waiting, because this is going to get larger and larger, and the president looks like he's waiting on the sidelines, but, secondly, we have no way of knowing as American people that BP is actually telling the truth, that all of its resources are being put to the appropriate use, and that it is appropriately balancing the health and safety of Americans against the cost of doing this clean-up.\n\nThis is a for-profit organization, BP, that is answerable to its shareholders, not to the American people.\n\nTAPPER: President Obama is going down to the gulf, Alabama, Mississippi and Florida, tomorrow. And when he gets back, he's going to give an address to the nation from the White House Tuesday at 8 o'clock. Last time he went down, his own White House video cameras caught him talking to residents down there, and this is what he had to say.\n\n(BEGIN VIDEO CLIP)\n\nOBAMA: I can't just dive down there and plug the hole. I can't suck it up with a straw. All I can do is make sure that I put honest, hard-working, smart people in place, like Thad, to implement this thing.\n\n(END VIDEO CLIP)\n\nTAPPER: Congressman, this is the president being confronted with the limits of his own abilities, even though he's been a big proponent of government and the ability of government, but here he is saying, \"I can't do this. I can't suck up the oil with a straw.\" This is a dilemma for him.\n\nDAVIS: It is. You know, I did the Katrina report, too, the same kind -- it was an unforgiving storm. And even if you did everything right, there was going to be a lot of anger, a lot of disappointed people. You have the same circumstance here.\n\nBut you have to ask yourself, where was MMS? We've known this has been a dysfunctional organization for years.\n\nTAPPER: The Minerals Management Service.\n\nDAVIS: Absolutely. I held hearings on this when I was in Congress, calling for reorganization and moving it back and forth. There's probably more culpability here than we see. We haven't gotten to the bottom line. It's easy to just blame BP, put it all on them, but I think a thorough investigation is going to show that there was a breakdown all through.\n\nTAPPER: George?\n\nWILL: Well, if there is a breakdown all through, I don't know why he thought it was a propitious moment to start a criminal investigation of a company that is in charge of this and that Bob wants the government to take over on the principle that the government will run another corporation well. I don't understand any of what's going on.\n\nThe president -- and I don't know why he's coming back to talk to us again. He's been talking about this nonstop for five weeks.\n\nBRAZILE: Well, some people believe that he hasn't said enough, George, and that this is his fourth visit.\n\nTAPPER: What could he possibly say, though?\n\nBRAZILE: Well, I -- I do believe that he needs to answer some of the questions that have been raised about the containment of the current spill, whether or not there are enough federal resources to contain what has already been in the gulf, to make sure that the states have the proper boomers, the skimmers, and all of the other resources they need -- they need in order to contain the spill.\n\nI think he needs to update us on everything he understands. Look, he may be able to split the sea, but I don't think he can cap the well. And I think it's even foolish to think that the president can -- can split the sea, but politics is in this, and it's draining his political capital, so I think he needs to address this and talk about our addiction to oil, because there are some longer-term issues here, including a moratorium, that needs to be addressed.\n\nTAPPER: Bob, I want to turn briefly, if I could, just to the other crisis that the country is facing. That's the economic crisis. Retail sales figures came out, and I know you wanted to say something about this. They're actually down 1.2 percent during this time that the economy is supposedly recovering. What do you think the significance is?\n\nREICH: Well, this is very unusual, Jake. Hopefully, this is just an aberration, but we have this on top of 41,000 private jobs being created in May...\n\nTAPPER: Not a lot. Not a lot of jobs.\n\nREICH: No. At this stage of recovery, particularly from this deep a recession, you need a lot of job growth, and you also need a lot of retail sales growth.\n\nThe fact is, American consumers just can't afford it. They're coming out from under huge debt loads, and many of them are still facing the prospect of joblessness.\n\nThis is why it is so important -- given the private sector's and consumers' inability to spend more -- for the public sector to spend more, at least in the short term. I mean, the public is not being told -- and here's where presidential education is very important, Donna -- the president is not being -- the president is not educating the public and the public is not being told that there is a huge difference between short-term spending to stimulate the economy and get the economy going again and dealing with the long-term structural deficit, which is mostly about health and Medicare. And these are two different animals entirely.\n\nTAPPER: All right, I want to move to politics now. You guys can talk more about the economy in the green room in the green room segment we have later, but we had some really amazing primaries that happened on Tuesday. In California, especially, where you hail from, Bob, there is the Fiorina versus Boxer race is setting up for the Senate. Carly Fiorina, former HP chairperson, just won the Republican nomination for Senate.\n\nAnd here, right out of the box, is Carly Fiorina's greatest hits while she was wired for sound before a TV interview.\n\n(BEGIN VIDEO CLIP)\n\nFIORINA: Laura (ph) saw Barbara Boxer briefly on television this morning and said what everyone says. God, what is that hair?\n\n(LAUGHTER)\n\nSo yesterday. You didn't...\n\n(END VIDEO CLIP)\n\nTAPPER: So, Bob, forget the hair. Forget Barbara Boxer's hair for a second. There is a possibility that Barbara Boxer will be so yesterday. She is vulnerable.\n\nREICH: She is vulnerable. I think that what we are seeing in California, again, if you look at the history of this country, everything that is good and everything that's bad starts in California. And what we see in California is a huge, huge amount of spending, Republicans going through the gauntlet of that right-wing Republican primary, forcing Fiorina and also Whitman to the right.\n\nNow, we're not going to have primaries to kick around anymore or parties in California after this year, because Californians, in a -- in a flight of just desperation, said we can't stand it anymore and we're getting rid of parties, especially.\n\nTAPPER: Tom, you wrote a memo to the -- your successor at the National Republican Congressional Committee, Pete Sessions, outlining the lay of the land, what you -- what you think voters are doing right now, what they're thinking right now. What -- what did you tell him?\n\nDAVIS: Well, it's very clear anger today is worse than it was in 1994, 2006, when Congress flipped hands. I mean, that's clear. And the Republicans have had a better recruiting year, I think, than any party has in the last generation, in terms of recruiting challengers. That's on the plus side for the Republicans.\n\nOn the down side is, they still have a party branding issue. The voters threw the Republicans out in 2006 and threw them out in 2008. And when you ask which party is more acceptable, I mean, neither one is, but Democrats actually rank slightly higher than Republicans.\n\nThe Democrats are prepared for this. They have -- all of their candidates have over $1 million in the bank. They've seen this wave coming. They've constructed a high seawall.\n\nYou don't have the open seats the Republicans had in -- in 1994 to shoot out or the Democrats had in 2006. And instead of a wind at your back, it's kind of a crosswind. And if you can be Scott Brown and get your sail up and hoist it right, you can ride it into shore, but just relying on, \"They're the other guys, we're not,\" is not going to work.\n\nThe Republicans have got to take this anger and translate it in districts across the country if they're going to win. They have a possibility of taking the House back. This is not an automatic. This is one of those strange years that voter anger is deep, and all these things we're talking about just add to that narrative.\n\nTAPPER: George, what do you see from Tuesday's results that you find interesting? What conclusions did you draw, if any?\n\nWILL: How hard it is to draw national conclusions about this. In California, Barbara Boxer, 69 years old, running with Jerry Brown, 72 years old, is not a youth movement out there. But Barbara Boxer got more votes, I believe, than Carly Fiorina and her principle challenger, Tom Campbell, combined, even though there was a hotly contested gubernatorial and Senate primaries on the Republican side to bring out the vote.\n\nIn Arkansas, a right-to-work state, out of 1.1 million workers in Arkansas, only 41,000 are unionized workers. Unions went in, spent $10 million, accusing Blanche Lincoln of being insufficiently subservient. And, surprise, surprise, she won. Having won, she starts out 20 points behind her Republican opponent.\n\nAnd in Nevada, Harry Reid might, on a good day, get to 43 percent in Nevada. So he has to figure out in his canny way how to win with 43 percent. Here's how you do it: You spend a lot of money to take down your most -- what you think is your strongest opponent. You pick your opponent.\n\nThere are six other lines on that ballot, independent candidates. That'll disperse the vote. And there's a none-of-the-above in Nevada. You can vote, \"I don't like any of these people.\" So in that sense, he may have brought down to 43 percent the winning total and his -- his threshold of victory.\n\nTAPPER: Let's talk about that Arkansas primary, because Senator Blanche Lincoln did finally defeat Bill Halter, who had been supported by labor unions. And that night that she beat him in the run-off, a White House official -- an anonymous White House official -- called our friend, Ben Smith, at Politico and said, quote, \"Organized labor just flushed $10 million of their members' money down the toilet on a pointless exercise. If even half that total had been well targeted and applied in key House races across the country, that could have made a real difference in November.\"\n\nAsked about the quote, here's what White House press secretary Robert Gibbs had to say. He said, \"First of all, I should say that the president wouldn't agree with that characterization, but\"...\n\n(BEGIN VIDEO CLIP)\n\nGIBBS: I think that whether or not that money might have been better spent in the fall on closer elections between somebody -- between people who cared about an agenda that benefited working families and those that didn't, that money might come in more -- more handy then.\n\n(END VIDEO CLIP)\n\nTAPPER: Donna, is the White House risking alienating labor with that kind of talk?\n\nBRAZILE: I think, for the most part, labor decided to ignore those comments, although some of them were a little bit -- they were not too satisfied with that comment.\n\nLook, organized labor does not exist to elect Democrats. They exist to help workers, to improve their jobs, their benefits, their pay. So I think the White House needs to be careful in alienating labor, because without organized labor, we don't have the sea legs to go knocking door to door to get the few Democrats that they support elect to office. And I know that from being out there for more than 30 years electing Democrats.\n\nThat said, look, she ran a great campaign. Blanche Lincoln ran a great campaign. She ran against Washington. Labor, the money did make her the outsider. She was able to reconnect with her base, and she pulled her base out. She still has trouble in the general election, but she ran a very smart, strategic campaign.\n\nAnd Bill Clinton helped her. He is popular. Ninety percent of the people in the state still love him. And he was able to pull out the stops to get her elected.\n\nThis was ladies' night across the country on Tuesday night, ladies' night. It was double or nothing in many states. We have now more female candidates running for governor and senator as a result of the -- the voter anger out there, and so that's a good -- that's a good sign for women candidates.\n\nThat said, not all women are equal in this battle. I thought Carly Fiorina's comments about Barbara Boxer was catty. It was old-school. And we've long since stopped talking about women's hair, headlines (ph), coat jackets, et cetera. We don't talk about male grooming or their ties, so she should get better on her message.\n\nTAPPER: I get comments about my ties all the time.\n\nBRAZILE: Well, that's because you're married to a smart woman.\n\nBut, you know, the Republicans spent a lot of money to -- to win in California, $100 million. That's a lot of...\n\n(CROSSTALK)\n\nTAPPER: You know, let me -- let me...\n\nREICH: And it was their -- and it was their own money. Let me just say that in that gubernatorial race, in that primary, we had two candidates who spent $100 million of their own money.\n\nTAPPER: And let's talk about that for one second, because -- because the other CEO running for governor, as opposed to Senate with Fiorina, is Meg Whitman from eBay. And here's Jerry Brown. He is the Democratic gubernatorial candidate, and he told a local reporter, \"You know, by the time Whitman's done with me two months from now, I'll be a child-molesting\" -- he let the line trail off. \"She'll have people believing whatever she wants about me. It's like Goebbels. Goebbels invented this kind of propaganda. He took control of the whole world. She wants to be president. That's her ambition, the first woman president. That's what this is all about.\"\n\nBob, regardless of the tastelessness of comparing Meg Whitman to a Nazi propagandist, Jerry Brown has a point in the sense -- not the Goebbels part of it -- but in the sense that she has a lot of money. She spent $70 million of her own money just in the primary.\n\nREICH: Well, again, California is the future. It means that, essentially, the ground war, the organizing on the ground, is really less and less important. And if you can spend a huge amount of money -- or you, like Jerry Brown, have a brand-name recognition -- you can get through and possibly be elected. But if you don't have a lot of money of your own and don't have brand-name recognition, you can basically forget it.\n\nWILL: But California also has a history of very rich candidates losing. There is such a thing as declining marginal utility of the last dollar spent, and the Republicans may be reaching that.\n\nDAVIS: And we're seeing campaign finance reform, really, that parties are -- they -- they no longer have the value. What's happened is the money has moved away with the political parties with the new (ph) -- out to the Tea Party, the Club for Growth, MoveOn.org, to labor. So the party establishments don't have the kind of power they once did.\n\nREICH: But connect the dots. I think this is a very important point, Tom. I mean, we've got so much anger in the electorate. Why? Because, A, we've got an economy that is not functioning for many people. B, we have a lot of physical representation of things out of control, such as the blow in the -- in -- in the gulf.\n\nAnd, thirdly, we have political parties that people now feel are not representing them at all. So there's this kind of anti-establishment earthquake going on in the country, and politicians ought to be aware. It's not just incumbents.\n\nTAPPER: Donna, I just -- we only have 30 seconds. You just talked to the South Carolina Democratic Party chair, Carol Fowler, about this bizarre nomination of Alvin Greene. Very quickly, what did she tell you?\n\nBRAZILE: It's a mystery. No one understands it. They can't -- no one can explain it. And there are all kind of conspiracy theories out there. Some of them I might ascribe myself to at some point. This guy came from nowhere, walked in with a cashier's check with his name scrawled on it, went back home to his dad's house, never campaigned, never cut a radio spot, a robo-call, and won.\n\nTAPPER: OK, well, the roundtable will continue in the green room on abcnews.com, where later you can also find our fact checks. We've teamed up with PolitiFact to fact check the show.", "images": ["http://abcnews.go.com/ThisWeek/week-transcript-hoyer-boehner-bill-gates/null", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "http://abcnews.go.com/ThisWeek/week-transcript-hoyer-boehner-bill-gates/null", "keywords": [], "authors": ["Abc News", "January", "Min Read"], "canonical_link": "https://abcnews.go.com/ThisWeek/week-transcript-hoyer-boehner-bill-gates/story?id=10900231", "title": "'This Week' Transcript: Hoyer, Boehner and Bill Gates", "meta_data": {"description": "Transcript of 'This Week' interview with House Majority Leader Steny Hoyer, Minority Leader John Boehner and Microsoft Founder and Chairman Bill Gates.", "keywords": "this week, jake tapper, steny hoyer, john boehner, bill gates", "copyright": "2020 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "'This Week' Transcript: Hoyer, Boehner and Bill Gates", "og": {"site_name": "ABC News", "url": "https://abcnews.go.com/ThisWeek/week-transcript-hoyer-boehner-bill-gates/story?id=10900231", "title": "'This Week' Transcript: Hoyer, Boehner and Bill Gates", "description": "Transcript of 'This Week' interview with House Majority Leader Steny Hoyer, Minority Leader John Boehner and Microsoft Founder and Chairman Bill Gates.", "image": "null", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2010-06-20T08:10:27Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,10900231", "ipad": "abcnewsipad://link/story,10900231", "googleplay": "https://abcnews.go.com/ThisWeek/week-transcript-hoyer-boehner-bill-gates/story?id=10900231"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "'This Week' Transcript: Hoyer, Boehner and Bill Gates", "description": "Transcript of 'This Week' interview with House Majority Leader Steny Hoyer, Minority Leader John Boehner and Microsoft Founder and Chairman Bill Gates.", "url": "https://abcnews.go.com/ThisWeek/week-transcript-hoyer-boehner-bill-gates/story?id=10900231", "image": {"identifier": "null", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,10900231", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,10900231", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/ThisWeek/week-transcript-hoyer-boehner-bill-gates/story?id=10900231", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/ThisWeek/week-transcript-hoyer-boehner-bill-gates/story?id=10900231"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "http://abcnews.go.com", "summary": ""}