{"url": "https://web.archive.org/web/20180114120021/http://www.unseen-pedia.com:80/citizens-want-receive-gvt-benefits-must-agree-microchipped-near-future/", "text": "(Natural News) Late last month, it was reported that a Wisconsin company called Three Square Market was planning on surgically implanting microchips underneath the skin of its employees for convenience purposes.\n\nThree Square Market CEO Todd Westby told KSTP, the Twin Cities ABC affiliate station, that the microchip implants are “the next big thing that’s inevitably going to happen, and we want to be a part of it.”\n\nWestby explained that the microchip would be capable of doing a number of different things, from allowing people to purchase food in the break room by simply scanning their hand, to serving as an electronic key to open doors and access computers.\n\nThe microchips use Radio Frequency Identification technology (RFID) to function, which also happens to be the technology used when you pay for items using your iPhone or Android device.\n\n“We foresee the use of RFID technology to drive everything from making purchases in our office break room market, opening doors, use of copy machines, logging into our office computers, unlocking phones, sharing business cards, storing medical/health information, and used as payment at other RFID terminals,” said the Three Square Market CEO in a statement.\n\n“Eventually, this technology will become standardized allowing you to use this as your passport, public transit, all purchasing opportunities, etc.”\n\nBut while Todd Westby may be enthusiastic about the use of this microchip technology in everyday life, thousands or even millions of others are no doubt concerned.\n\nThe idea of implanting microchips underneath the skin in order to store information regarding your health and finances sounds like something straight out of George Orwell’s famous book 1984.\n\nEven if the chips do not have a GPS system and it’s impossible to track those that have them embedded underneath their skin, the overall concept is still unnerving.\n\nAmericans are conditioned to embrace individual liberty, and microchip implants force them to embrace the exact opposite of that.\n\nNoelle Chesley, an associate professor of sociology at the University of Wisconsin-Milwaukee, believes that the use of microchips is only going to become more common in the not-so-distant future.\n\n“It will happen to everybody,” she explained. “But not this year, and not in 2018. Maybe not my generation, but certainly that of my kids.”\n\nIn fact, the idea of using microchips in order to track the financial situations of welfare recipients has already been suggested by one politician in Finland.\n\nAccording to Sputnik News, a member of Finland’s conservative Finn Party recently recommended implanting satellite-tracking chips inside of welfare recipients in response to news that some recipients continued to receive payments after leaving the country to fight for the Islamic State.\n\nPasi Maenranta, the politician who suggested the idea, argued on his Facebook page that in order to receive welfare payments from Kela, “one has to tell exact data about your location using your personal code, read by a satellite.”\n\nMaenranta also noted that it would be possible to implant microchips beneath the skin of all those traveling overseas “who for example receive medical welfare from Kela,” also known as the Social Insurance Institution.\n\nBut regardless of how good the intentions may be, there are still a lot of questions that must be answered before the people of our country and elsewhere embrace the use of surgically implanted microchips.\n\nCan they ever be turned off or removed? Who exactly will have access to your location should the microchip be equipped with GPS technology?\n\nAnd if the microchips contain personal information regarding health and finances, will it be possible for that information to be hacked and potentially sold by a third party?\n\nIf Americans are serious about holding on to our Fourth Amendment right to privacy, then these are questions that we should all demand be answered before more advancements in microchip technology are made.\n\nSource humansarefree", "images": ["https://web.archive.org/web/20180114120021im_/http://www.unseen-pedia.com/wp-content/uploads/2018/01/Small-Microchip-Tracking-Device-Antenna.jpg"], "top_img": "https://web.archive.org/web/20180114120021im_/http://www.unseen-pedia.com/wp-content/uploads/2018/01/Small-Microchip-Tracking-Device-Antenna.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20180114120021/http://www.unseen-pedia.com/citizens-want-receive-gvt-benefits-must-agree-microchipped-near-future/", "title": "All Citizens Who Want to Receive Gvt Benefits Must Agree to Be Microchipped in the Near Future", "meta_data": {"fb": {"pages": 1146718355343574}, "viewport": "width=device-width, initial-scale=1", "og": {"locale": "en_GB", "type": "article", "title": "All Citizens Who Want to Receive Gvt Benefits Must Agree to Be Microchipped in the Near Future", "description": "All Citizens Who Want to Receive Gvt Benefits Must Agree to Be Microchipped in the Near Future", "url": "https://web.archive.org/web/20180114120021/http://www.unseen-pedia.com/citizens-want-receive-gvt-benefits-must-agree-microchipped-near-future/", "site_name": "Anti News Network", "image": "https://web.archive.org/web/20180114120021im_/http://www.unseen-pedia.com/wp-content/uploads/2018/01/Small-Microchip-Tracking-Device-Antenna.jpg"}, "article": {"section": "Truth News", "published_time": "2018-01-12T02:43:06-07:00"}, "twitter": {"card": "summary", "description": "(Natural News) Late last month, it was reported that a Wisconsin company called Three Square Market was planning on surgically implanting", "title": "All Citizens Who Want to Receive Gvt Benefits Must Agree to Be Microchipped in the Near Future - Anti News Network", "image": "https://web.archive.org/web/20180114120021im_/http://www.unseen-pedia.com/wp-content/uploads/2018/01/Small-Microchip-Tracking-Device-Antenna.jpg"}, "generator": "WordPress 4.9.1", "ia": {"markup_url": "http://www.unseen-pedia.com/citizens-want-receive-gvt-benefits-must-agree-microchipped-near-future/?ia_markup=1"}, "msapplication-TileImage": "http://www.unseen-pedia.com/wp-content/uploads/2017/02/14908370_1782421858673034_4749262631277297409_n.png"}, "movies": [], "publish_date": 1515750186.0, "source": "https://web.archive.org", "summary": ""}