{"url": "en.wikipedia.org/wiki/Nicole_Kidman", "text": "Australian actress and film producer\n\nNicole Mary Kidman[3] (born 20 June 1967)[4] is an Australian actress, producer and singer.[5] She has won many awards including an Academy Award, two Primetime Emmy Awards, and five Golden Globe Awards. She was listed among the highest-paid actresses in the world in 2006, 2018, and 2019. Time magazine twice named her one of the 100 most influential people in the world, in 2004 and 2018.[6][7][8]\n\nKidman began her acting career in Australia with the 1983 films Bush Christmas and BMX Bandits. Her breakthrough came in 1989 with the thriller film Dead Calm and the miniseries Bangkok Hilton. In 1990, she made her Hollywood debut in the racing film Days of Thunder, opposite Tom Cruise. She went on to achieve wider recognition with lead roles in Far and Away (1992), Batman Forever (1995), To Die For (1995), and Eyes Wide Shut (1999). Kidman won the Academy Award for Best Actress for portraying the writer Virginia Woolf in the drama The Hours (2002). Her other Oscar-nominated roles were as a courtesan in the musical Moulin Rouge! (2001) and emotionally troubled mothers in the dramas Rabbit Hole (2010) and Lion (2016).\n\nKidman's other film credits include The Others (2001), Cold Mountain (2003), Dogville (2003), Birth (2004), Australia (2008), The Paperboy (2012), Paddington (2014), Destroyer (2018), Aquaman (2018), and Bombshell (2019). Her television roles include two projects for HBO, the biopic Hemingway & Gellhorn (2012) and the drama series Big Little Lies (2017–2019). The latter earned Kidman the Primetime Emmy Award for Outstanding Lead Actress and Outstanding Limited Series.\n\nKidman has been a Goodwill ambassador for UNICEF since 1994[9] and for UNIFEM since 2006.[10] In 2006, she was appointed Companion of the Order of Australia.[11] Since she was born to Australian parents in Hawaii, Kidman has dual citizenship of Australia and the United States.[12][13] In 2010, she founded the production company Blossom Films. She has been married to singer Keith Urban since 2006, and was earlier married to Tom Cruise.\n\nEarly life [ edit ]\n\nKidman was born 20 June 1967, in Honolulu, Hawaii,[3] while her Australian parents were temporarily in the United States on student visas. Her mother, Janelle Ann (née Glenny), is a nursing instructor who edited her husband's books and was a member of the Women's Electoral Lobby; her father, Antony Kidman, was a biochemist, clinical psychologist and author.[14][15][16][17] Kidman's ancestry includes Irish and Scottish heritage.[18]\n\nBeing born in Hawaii, she was given the Hawaiian name \"Hōkūlani\", meaning \"Heavenly Star\". The inspiration came from a baby elephant born around the same time at the Honolulu Zoo.[19][20]\n\nAt the time of Kidman's birth, her father was a graduate student at the University of Hawaiʻi at Mānoa. He became a visiting fellow at the National Institute of Mental Health of the United States. Opposed to the war in Vietnam, Kidman's parents participated in anti-war protests while living in Washington, D.C.[21] The family returned to Australia when Kidman was four and her mother now lives on Sydney's North Shore. Kidman has a younger sister, Antonia Kidman, a journalist and TV presenter.[22]\n\nKidman grew up in Sydney and attended Lane Cove Public School and North Sydney Girls' High School. She was enrolled in ballet at three and showed her natural talent for acting in her primary and high school years.[23] She says that she was first inspired to become an actress upon seeing Margaret Hamilton's performance as the Wicked Witch of the West in The Wizard of Oz.[24] Kidman has revealed that she was timid as a child, saying, \"I am very shy – really shy – I even had a stutter as a kid, which I slowly got over, but I still regress into that shyness. So I don't like walking into a crowded restaurant by myself; I don't like going to a party by myself.\"[25]\n\nShe initially studied at the Phillip Street Theatre in Sydney, alongside Naomi Watts who had attended the same high school.[23] She also attended the Australian Theatre for Young People.[23] Here she took up drama, mime and performing in her teens, finding acting to be a refuge. Owing to her fair skin and naturally red hair, the Australian sun forced the young Kidman to rehearse in halls of the theatre. A regular at the Phillip Street Theatre, she received praise, and encouragement to pursue acting full-time.[18]\n\nCareer [ edit ]\n\nBeginnings (1983–1994) [ edit ]\n\nIn 1983, aged 16, Kidman made her film debut in a remake of the Australian holiday season favourite Bush Christmas.[18] By the end of 1983, she had a supporting role in the television series Five Mile Creek. In 1984, her mother was diagnosed with breast cancer, which caused Kidman to halt her acting work temporarily while she studied massage so she could help her mother with physical therapy.[26] She began gaining popularity in the mid-1980s after appearing in several film roles, including BMX Bandits (1983), Watch the Shadows Dance (1987 aka Nightmaster), and the romantic comedy Windrider (1986), which earned Kidman attention due to her racy scenes. Also during the decade, she appeared in several Australian productions, including the soap opera A Country Practice[27] and the 1987 miniseries Vietnam.[28] She also made guest appearances on Australian television programs and TV movies.\n\nIn 1988, Kidman appeared in Emerald City, based on the play of the same name. The Australian film earned her an Australian Film Institute award for Best Supporting Actress. Kidman next starred with Sam Neill in Dead Calm (1989) as Rae Ingram, playing the wife of a naval officer. The thriller brought Kidman to international recognition; Variety commented: \"Throughout the film, Kidman is excellent. She gives the character of Rae real tenacity and energy.\"[29] Meanwhile, critic Roger Ebert noted the excellent chemistry between the leads, stating, \"Kidman and Zane do generate real, palpable hatred in their scenes together.\"[30] She followed that up with the Australian miniseries Bangkok Hilton. She next moved on to star alongside her then-boyfriend and future husband, Tom Cruise, in the 1990 auto racing film Days of Thunder, as a young doctor who falls in love with a NASCAR driver. It is Kidman's American debut and was among the highest-grossing films of the year.[31]\n\nIn 1991, she co-starred with Thandie Newton and former classmate Naomi Watts in the Australian independent film Flirting.[32] They portrayed high school girls in this coming of age story, which won the Australian Film Institute Award for Best Film.[33] That same year, her work in the film Billy Bathgate earned Kidman her first Golden Globe Award nomination, for Best Supporting Actress. The New York Times, in its film review, called her \"a beauty with, it seems, a sense of humor\".[34] The following year, she and Cruise re-teamed for Ron Howard's Irish epic Far and Away (1992), which was a modest critical[35][36] and commercial[37] success. In 1993, she starred in the thriller Malice opposite Alec Baldwin[38] and the drama My Life opposite Michael Keaton.[39]\n\nWorldwide recognition (1995–2003) [ edit ]\n\nIn 1995, Kidman played Dr. Chase Meridian, the damsel in distress, in the superhero film Batman Forever, opposite Val Kilmer as the film's title character. The same year, she starred in Gus Van Sant's critically acclaimed dark comedy To Die For, in which she played the murderous newscaster Suzanne Stone. Of Kidman's Golden Globe Award-winning performance, Mick LaSalle of the San Francisco Chronicle said \"[she] brings to the role layers of meaning, intention and impulse. Telling her story in close-up – as she does throughout the film – Kidman lets you see the calculation, the wheels turning, the transparent efforts to charm that succeed in charming all the same.\"[40] Kidman next appeared, alongside Barbara Hershey and John Malkovich, in The Portrait of a Lady (1996), based on the novel of the same name, and starred in The Peacemaker (1997) as White House nuclear expert Dr. Julia Kelly, opposite George Clooney. The latter film grossed US$110 million worldwide.[41][42] Kidman starred in comedy Practical Magic (1998) with Sandra Bullock as two witch sisters who face a curse which threatens to prevent them ever finding lasting love. While the film opened atop the chart on its North American opening weekend, it flopped at the box office.[43][44] She returned to her work on stage the same year in the David Hare play The Blue Room, which opened in London.[45]\n\nNicole Kidman Damsels Bound and Gagged in Batman Forever 1995.\n\nIn 1999, Kidman reunited with then husband, Tom Cruise, to portray a Manhattan couple on a sexual odyssey, in Eyes Wide Shut, the final film of director Stanley Kubrick. It was subject to censorship controversies due to the explicit nature of its sex scenes.[46] After a brief hiatus and a highly publicised divorce from Cruise,[47] Kidman returned to the screen to play a mail-order bride in the British-American drama Birthday Girl.[48] In 2001, Kidman played the cabaret actress and courtesan Satine in Baz Luhrmann's musical Moulin Rouge!, opposite Ewan McGregor. Her performance and her singing received positive reviews; Paul Clinton of CNN.com called it her best work since To Die For, and wrote \"[she] is smoldering and stunning as Satine. She moves with total confidence throughout the film [...] Kidman seems to specialize in 'ice queen' characters, but with Satine, she allows herself to thaw, just a bit.\"[49] Subsequently, Kidman received her second Golden Globe Award, for Best Actress in a Motion Picture Musical or Comedy, as well as many other acting awards and nominations. She also received her first Academy Award nomination, for Best Actress.\n\nKidman also starred in Alejandro Amenábar's horror film The Others (2001), as Grace Stewart, a mother living in the Channel Islands during World War II who suspects her house is haunted. Grossing over US$210 million worldwide, the film also earned several Goya Award nominations, including a Best Actress nomination for Kidman. She received her second BAFTA Award[50] and fifth Golden Globe Award[51] nominations. Roger Ebert commented that \"Alejandro Amenábar has the patience to create a languorous, dreamy atmosphere, and Nicole Kidman succeeds in convincing us that she is a normal person in a disturbing situation, and not just a standard-issue horror movie hysteric.\"[52] Kidman was named the World's Most Beautiful Person by People magazine.[53]\n\nIn 2002, Kidman won critical praise for her portrayal of Virginia Woolf in Stephen Daldry's The Hours, which stars Meryl Streep and Julianne Moore. Kidman famously wore prosthetics that were applied to her nose making her almost unrecognisable playing the author during her time in 1920s England, and her bouts with depression and mental illness while trying to write her novel, Mrs. Dalloway. The film earned positive notices and several nominations, including for an Academy Award for Best Picture. The New York Times wrote that, \"Ms. Kidman, in a performance of astounding bravery, evokes the savage inner war waged by a brilliant mind against a system of faulty wiring that transmits a searing, crazy static into her brain\".[54] Kidman won numerous critics' awards, including her first BAFTA Award, third Golden Globe Award, and the Academy Award for Best Actress. As the first Australian actress to win an Academy Award, Kidman made a teary acceptance speech about the importance of art, even during times of war, saying, \"Why do you come to the Academy Awards when the world is in such turmoil? Because art is important. And because you believe in what you do and you want to honour that, and it is a tradition that needs to be upheld.\"[55]\n\nFollowing her Oscar win, Kidman appeared in three very different films in 2003. The first, a leading role in Dogville, by Danish director Lars von Trier, was an experimental film set on a bare soundstage. Though the film divided critics in the United States, Kidman still earned praise for her performance. Peter Travers of Rolling Stone magazine stated: \"Kidman gives the most emotionally bruising performance of her career in Dogville, a movie that never met a cliche it didn't stomp on.\"[56] The second was an adaptation of Philip Roth's novel The Human Stain, opposite Anthony Hopkins. Her third film was Anthony Minghella's war drama Cold Mountain. Kidman appeared opposite Jude Law and Renée Zellweger, playing Southerner Ada Monroe, who is in love with Law's character and separated by the Civil War. TIME magazine wrote, \"Kidman takes strength from Ada's plight and grows steadily, literally luminous. Her sculptural pallor gives way to warm radiance in the firelight\".[57] The film garnered several award nominations and wins for its actors; Kidman received her sixth Golden Globe Award nomination at the 61st Golden Globe Awards for Best Actress.[58]\n\nContinued success (2004–2009) [ edit ]\n\nKidman in 2004\n\nIn 2004 she appeared in the film Birth, which received controversy over a scene in which Kidman shares a bath with her co-star, 10-year-old Cameron Bright. At a press conference at the Venice Film Festival, Kidman addressed the controversy saying, \"It wasn't that I wanted to make a film where I kiss a 10-year-old boy. I wanted to make a film where you understand love\".[59] Kidman earned her seventh Golden Globe nomination, for Best Actress – Motion Picture Drama. That same year, she appeared as a successful producer in the black comedy-science-fiction film The Stepford Wives, a remake of the 1975 film of the same name, directed by Frank Oz. In 2005, Kidman appeared opposite Sean Penn in the Sydney Pollack thriller The Interpreter, playing UN translator Silvia Broome, and with Will Ferrell in the romantic comedy Bewitched, based on the 1960s TV sitcom of the same name. While neither film fared well in the United States, both were international successes.[60][61] Kidman and Ferrell earned the Razzie Award for Worst Screen Couple.\n\nIn conjunction with her success in the film industry, Kidman became the face of the Chanel No. 5 perfume brand. She starred in a campaign of television and print ads with Rodrigo Santoro, directed by Moulin Rouge! director Baz Luhrmann, to promote the fragrance during the holiday seasons of 2004, 2005, 2006, and 2008. The three-minute commercial produced for Chanel No. 5 made Kidman the record holder for the most money paid per minute to an actor after she reportedly earned US$12million for the three-minute advert.[62] During this time, Kidman was also listed as the 45th Most Powerful Celebrity on the 2005 Forbes Celebrity 100 List. She made a reported US$14.5 million in 2004–2005. On People magazine's list of 2005's highest-paid actresses, Kidman was second behind Julia Roberts, with US$16–17 million per-film price tag.[63] Nintendo in 2007 announced that Kidman would be the new face of Nintendo's advertising campaign for the Nintendo DS game More Brain Training in its European market.[64]\n\nIn 2006, Kidman portrayed photographer Diane Arbus in the biographical film Fur, opposite Robert Downey Jr., and lent her voice to the animated film Happy Feet, which grossed over US$384 million worldwide. In 2007, she starred in the science-fiction movie The Invasion directed by Oliver Hirschbiegel, a remake of the 1956 Invasion of the Body Snatchers, and starred opposite Jennifer Jason Leigh and Jack Black in Noah Baumbach's comedy-drama Margot at the Wedding, which earned her a Satellite Award nomination for Best Actress – Musical or Comedy. She also starred in the fantasy-adventure, The Golden Compass (2007), playing the villainous Marisa Coulter.\n\nIn 2008, she reunited with Moulin Rouge! director Baz Luhrmann in the Australian period film Australia, set in the remote Northern Territory during the Japanese attack on Darwin during World War II. Kidman played opposite Hugh Jackman as an Englishwoman feeling overwhelmed by the continent. The acting was praised and the movie was a box office success worldwide.[65] Kidman appeared in the 2009 Rob Marshall musical Nine, portraying the Federico Fellini-like character's muse, Claudia Jenssen, with fellow Oscar winners Daniel Day-Lewis, Judi Dench, Marion Cotillard, Penélope Cruz and Sophia Loren. Kidman, whose screen time was brief compared to the other actresses, performed the musical number \"Unusual Way\", alongside Day-Lewis. The film received several Golden Globe Award and Academy Award nominations, and earned Kidman a fourth Screen Actors Guild Award nomination, as part of the Outstanding Performance by a Cast in a Motion Picture.\n\nBiographical and independent films (2010–2015) [ edit ]\n\nIn 2010, Kidman starred with Aaron Eckhart in the film adaptation of the Pulitzer Prize-winning play Rabbit Hole, for which she vacated her role in the Woody Allen picture You Will Meet a Tall Dark Stranger.[66] Her portrayal as a grieving mother in the film earned her critical acclaim, and received nominations for the Academy Awards, Golden Globe Awards, and Screen Actors Guild Awards. She lent her voice to a promotional video that Australia used to support its bid to host the 2018 FIFA World Cup.[67] In 2011, she starred alongside Nicolas Cage in director Joel Schumacher's action-thriller Trespass, with the stars playing a married couple taken hostage,[68] and appeared with Adam Sandler and Jennifer Aniston in Dennis Dugan's romantic comedy Just Go with It, as a trophy wife.\n\nIn 2012, Kidman and Clive Owen starred in the HBO film Hemingway & Gellhorn, and about Ernest Hemingway and his relationship with Martha Gellhorn.[69][70] In Lee Daniels' adaptation of the Pete Dexter novel, The Paperboy (2012),[71] she portrayed death row groupie Charlotte Bless, and performed sex scenes that she claims not to have remembered until seeing the finished film.[72] The film competed in the 2012 Cannes Film Festival, and Kidman's performance drew nominations for the SAG and the Saturn Award for Best Supporting Actress, gave Kidman her second Golden Globe Award nomination for Best Supporting Actress and her tenth nomination overall. In 2012, Kidman's audiobook recording of Virginia Woolf's To the Lighthouse was released at Audible.com.[73] Kidman starred as an unstable mother in Park Chan-wook's Stoker (2013),[74] to a positive response and a Saturn Award nomination for Best Supporting Actress. In April 2013 she was selected as a member of the main competition jury at the 2013 Cannes Film Festival.[75]\n\nIn 2014, Kidman starred in the biographical film Grace of Monaco in the title role that chronicles the 1962 crisis, in which Charles de Gaulle blockaded the tiny principality, angered by Monaco's status as a tax haven for wealthy French subjects and Kelly's contemplating a Hollywood return to star in Alfred Hitchcock's Marnie. Opening out of competition at the 2014 Cannes Film Festival, the film received largely negative reviews.[76] Kidman also starred in two films with Colin Firth that year, the first being the British-Australian historical drama The Railway Man, in which Kidman played an officer's wife.[77] Katherine Monk of the Montreal Gazette said of Kidman's performance, \"It's a truly masterful piece of acting that transcends Teplitzky's store-bought framing, but it's Kidman who delivers the biggest surprise: For the first time since her eyebrows turned into solid marble arches, the Australian Oscar winner is truly terrific\".[78] Her second film with Firth was the British thriller film Before I Go To Sleep, portraying a car crash survivor with brain damage.[79] She also appeared in the family film Paddington (2014) as a villain.\n\nIn 2015, Kidman starred in the drama Strangerland, which opened at the 2015 Sundance Film Festival,[80] and the Jason Bateman-directed The Family Fang, produced by Kidman's production company, Blossom Films, which premiered at the 2015 Toronto International Film Festival. In her other 2015 film release, the biographical drama Queen of the Desert, she portrayed writer, traveller, political officer, administrator, and archaeologist Gertrude Bell. Kidman played a district attorney, opposite Julia Roberts and Chiwetel Ejiofor, in the little-seen film Secret in Their Eyes (also 2015), a remake of the 2009 Argentine film of the same name, both based on the novel La pregunta de sus ojos by author Eduardo Sacheri.[81] After more than 15 years, Kidman returned to the West End in the UK premiere of Photograph 51 at the Noël Coward Theatre. She starred as British scientist Rosalind Franklin, working for the discovery of the structure of DNA, in the production from 5 September to 21 November 2015, directed by Michael Grandage.[82][83][84][85][86][87][88] Her return to the West End was hailed a success, especially after having won an acting award for her portrayal in the play.[89][90][91]\n\nResurgence and television career (2016–present) [ edit ]\n\nIn 2016's Lion, Kidman portrayed Sue, the adoptive mother of Saroo Brierley, an Indian boy who was separated from his birth family, a role she felt connected to as she herself is the mother of adopted children.[92] She earned favorable reviews for her performance, as well as nominations for the Academy Award for Best Supporting Actress, her fourth nomination overall, and her eleventh Golden Globe Award nomination, among others. Richard Roeper of the Chicago Sun-Times thought that \"Kidman gives a powerful and moving performance as Saroo's adoptive mother, who loves her son with every molecule of her being, but comes to understand his quest. It's as good as anything she's done in the last decade.\"[93] Budgeted at US$12 million, Lion earned over US$140 million globally.[94] She also gave a voice-over performance for the English version of the animated film The Guardian Brothers.[95]\n\nIn 2017, Kidman returned to television for Big Little Lies, a drama series based on Liane Moriarty's novel, which premiered on HBO. She also served as producer alongside her co-star, Reese Witherspoon, and the show's director, Jean-Marc Vallée. She played Celeste Wright, a former lawyer and housewife, who is concealing her abusive relationship with her husband, played by Alexander Skarsgård. Matthew Jacobs of The Huffington Post considered that she \"delivered a career-defining performance\",[96] while Ann Hornaday of The Washington Post wrote that \"Kidman belongs in the pantheon of great actresses\".[97] She won the Primetime Emmy Award for Outstanding Lead Actress in a Limited Series or Movie for her performance, as well as winning the Primetime Emmy Award for Outstanding Limited Series as a producer. She also won a Critics' Choice Television Award, Golden Globe Award, and Screen Actors Guild Award.[98][99]\n\nKidman next played Martha Farnsworth, the headmistress of an all-girls school during the American Civil War, in Sofia Coppola's drama The Beguiled, a remake of a 1971 film of the same name, which premiered at the 2017 Cannes Film Festival, competing for the Palme d'Or.[100] Both films were adaptations of a novel by Thomas P. Cullinan, The film was an arthouse success, and Katie Walsh of Tribune News Service found Kidman to be \"particularly, unsurprisingly excellent in her performance as the steely Miss Martha. She is controlled and in control, unflappable. Her genteel manners and femininity co-exist easily with her toughness.\"[101] Kidman had two other films premiere at the festival, the science-fiction romantic comedy How to Talk to Girls at Parties, reuniting her with director John Cameron Mitchell,[102][103] and the psychological thriller The Killing of a Sacred Deer, directed by Yorgos Lanthimos, which also competed for the Palme d'Or.[102][103] Also in 2017, Kidman played supporting roles in the television series Top of the Lake: China Girl and in the comedy-drama The Upside, a remake of the 2011 French comedy The Intouchables, starring Bryan Cranston and Kevin Hart.[104]\n\nKidman starred in two 2018 dramas —Destroyer and Boy Erased. In the former, she played a detective troubled by a case for two decades. Peter Debruge of Variety and Brooke Marine of W both found her \"unrecognizable\" in the role and Debruge added that \"she disappears into an entirely new skin, rearranging her insides to fit the character’s tough hide\",[105] whereas Marine highlighted Kidman's method acting.[106] The latter film is based on Garrard Conley's Boy Erased: A Memoir, and features Russell Crowe and Kidman as socially conservative parents who send their son (played by Lucas Hedges) to a gay conversion program. Richard Lawson of Vanity Fair credited all three performers for \"elevating the fairly standard-issue material to poignant highs\".[107] Also that year, Kidman played Queen Atlanna, the mother of the title character, in the DC Extended Universe superhero film Aquaman.[108]\n\nForbes ranked her as the fourth highest-paid actress in the world in 2019, with an annual income of $34 million.[109] She took on the supporting part of a rich socialite in John Crowley's drama The Goldfinch, an adaptation of the novel of the same name by Donna Tartt, starring Ansel Elgort.[110] Although it was poorly received, Owen Gleiberman commended Kidman for playing her part with \"elegant affection\".[111][112] She next starred as Gretchen Carlson in the drama Bombshell, directed by Jay Roach, about sexual harassment at Fox News.[113] For her work, she received a nomination for the Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Supporting Role.[114]\n\nUpcoming projects [ edit ]\n\nKidman has signed on to star and serve as executive producer on three television miniseries. First, Kidman will headline the HBO miniseries, The Undoing, based on the novel You Should Have Known by Jean Hanff Korelitz.[115] The Undoing was previously set to premiere in May 2020 but due to the 2019–20 coronavirus pandemic, HBO pushed the premiere to the fall of 2020.[116] Second, Kidman will headline the Hulu miniseries Nine Perfect Strangers based on the novel of the same name by Liane Moriarty. Nine Perfect Strangers is set to premiere sometime in 2021.[117][118] Thirdly, Kidman will headline the Amazon Prime Video thriller miniseries based on the upcoming novel Pretty Things by Janelle Brown.[119]\n\nFurthermore, Kidman will serve as an executive producer for a television series adaption The Expatriates based upon the novel of the same name by Janice Y.K. Lee for Amazon Prime Video.[120]\n\nPersonal life [ edit ]\n\nRelationships and children [ edit ]\n\nKidman has been married twice: first to actor Tom Cruise, and later to country singer Keith Urban. Kidman met Cruise in November 1989, while filming Days of Thunder; they were married on Christmas Eve in Telluride, Colorado. The couple adopted a daughter, Isabella Jane Cruise (born 1992),[121] and a son, Connor Antony (born 1995).[121] On 5 February 2001, the couple's spokesperson announced their separation.[122] Cruise filed for divorce two days later, and the marriage was dissolved in August of that year, with Cruise citing irreconcilable differences.[123] In a 2007 interview with Marie Claire, Kidman noted the incorrect reporting of the ectopic pregnancy early in her marriage. \"It was wrongly reported as miscarriage, by everyone who picked up the story.\" \"So it's huge news, and it didn't happen.\"[124]\n\nIn the June 2006 issue of Ladies' Home Journal, she said she still loved Cruise: \"He was huge; still is. To me, he was just Tom, but to everybody else, he is huge. But he was lovely to me and I loved him. I still love him.\" In addition, she has expressed shock about their divorce.[125] In 2015, former Church of Scientology executive Mark Rathbun claimed in a documentary film that he was instructed to \"facilitate [Cruise's] break-up with Nicole Kidman\".[126] Cruise's auditor further claimed Kidman had been wiretapped on Cruise's suggestion.[127]\n\nPrior to marrying Cruise, Kidman had been involved in relationships with Australian actor Marcus Graham and Windrider (1986) co-star Tom Burlinson.[128][129][130] She was also said to be involved with Adrien Brody.[131] The film Cold Mountain brought rumours that an affair between Kidman and co-star Jude Law was responsible for the break-up of his marriage. Both denied the allegations, and Kidman won an undisclosed sum from the British tabloids that published the story.[132] She met musician Lenny Kravitz in 2003, and dated him into 2004.[133] Kidman was also romantically linked to rapper Q-Tip.[134] Robbie Williams claims he had a short romance with Kidman on her yacht in summer 2004.[135]\n\nIn a 2007 Vanity Fair interview, Kidman revealed that she had been secretly engaged to someone prior to her present relationship to New Zealand-Australian country singer Keith Urban,[136] whom she met at G'Day LA, an event honouring Australians, in January 2005. Kidman married Urban on 25 June 2006, at Cardinal Cerretti Memorial Chapel in the grounds of St Patrick's Estate, Manly in Sydney.[137][138] In an interview in 2015, Kidman said, \"We didn't really know each other – we got to know each other during our marriage.\"[139] They maintain homes in Sydney, Sutton Forest (New South Wales, Australia); Los Angeles;[140] Nashville (Tennessee, U.S.);[141] and a condominium in Manhattan purchased for US$10 million.[142] The couple's first daughter Sunday Rose was born in 2008, in Nashville.[143][144] In 2010, Kidman and Urban had their second daughter Faith Margaret via gestational surrogacy[145] at Nashville's Centennial Women's Hospital.[146][147] In an interview by Tina Brown at the 2015 Women in the World conference, she stated that her attention turned to her career after her divorce from Cruise: \"Out of my divorce came work that was applauded so that was an interesting thing for me\", leading to her Academy Award in 2003.[139]\n\nReligious and political views [ edit ]\n\nKidman is Catholic and even considered becoming a nun at one point.[148][149] She attended Mary Mackillop Chapel in North Sydney. Following criticism of The Golden Compass by Catholic leaders[150] as anti-Catholic,[151] Kidman told Entertainment Weekly that the Catholic Church is part of her \"essence\", and that her religious beliefs would prevent her from taking a role in a film she perceived as anti-Catholic.[152] During her divorce from Tom Cruise, she stated that she did not want their children raised as Scientologists.[153] She has been reluctant to discuss Scientology since her divorce.[154]\n\nA supporter of women's rights,[155] Kidman testified before the United States House of Representatives Committee on Foreign Affairs to support the International Violence Against Women Act in 2009.[156] In January 2017, she stated her support for the legalisation of same-sex marriage in Australia.[157] Kidman has also donated to U.S. Democratic party candidates.[158]\n\nWealth, philanthropy, and honours [ edit ]\n\nIn 2002, Kidman first appeared on the Australian rich list published annually in the Business Review Weekly with an estimated net worth of A$122 million.[159] In the 2011 published list, Kidman's wealth was estimated at A$304 million, down from A$329 million in 2010.[160] Kidman has raised money for, and drawn attention to, disadvantaged children around the world. In 1994, she was appointed a goodwill ambassador for UNICEF,[9] and in 2004, she was honoured as a \"Citizen of the World\" by the United Nations.[161] Kidman joined the Little Tee Campaign for breast cancer care to design T-shirts or vests to raise money to fight the disease;[162] motivated by her mother's own battle with breast cancer in 1984.[163]\n\nThe Golden Compass in 2007 Kidman signing autographs at the premiere ofin 2007\n\nIn the 2006 Australia Day Honours, Kidman was appointed Companion of Order of Australia (AC) for \"service to the performing arts as an acclaimed motion picture performer, to health care through contributions to improve medical treatment for women and children and advocacy for cancer research, to youth as a principal supporter of young performing artists, and to humanitarian causes in Australia and internationally\".[164] However, due to film commitments and her wedding to Urban, it wasn't until 13 April 2007 that she was presented with the honour.[165] It was presented by the Governor-General of Australia, Major General Michael Jeffery, in a ceremony at Government House, Canberra.[166]\n\nKidman was appointed goodwill ambassador of the United Nations Development Fund for Women (UNIFEM) in 2006.[9] She visited Kosovo in 2006 to learn about women's experiences of conflict and UNIFEM's support efforts.[167] She is also the international spokesperson for UNIFEM's Say NO – UNiTE to End Violence against Women initiative.[168] Kidman and the UNIFEM executive director presented over five million signatures collected during the first phase of this to the UN Secretary-General on 25 November 2008.[169] In 2016, Kidman donated $50,000 to UN Women.[170]\n\nIn the beginning of 2009, Kidman appeared in a series of postage stamps featuring Australian actors. She, Geoffrey Rush, Russell Crowe and Cate Blanchett each appear twice in the series: once as themselves and once as their Academy Award-nominated character; Kidman's second stamp showed her as Satine from Moulin Rouge!.[171] On 8 January 2010, alongside Nancy Pelosi, Joan Chen and Joe Torre, Kidman attended the ceremony to help the Family Violence Prevention Fund break ground on a new international centre located in the Presidio of San Francisco.[172][173] In 2015, Kidman became the brand ambassador for Etihad Airways.[174]\n\nKidman supports the Nashville Predators, being seen and photographed almost nightly throughout the season.[175] Additionally, she supports the Sydney Swans in the Australian Football League and once served as a club ambassador.[176]\n\nFilmography [ edit ]\n\nDiscography [ edit ]\n\nKidman's discography[177] consists of one spoken word album, one extended play, three singles, three music videos, ten other appearances, a number of unreleased tracks and two tribute songs recorded by various artists. Kidman, primarily known in the field of acting, entered the music industry in the 2000s after recording a number of tracks for the soundtrack album to Baz Luhrmann's 2001 motion picture Moulin Rouge!, which she starred in.[178] Her duet with Ewan McGregor entitled \"Come What May\" was released as her debut and the second single of the OST through Interscope on 24 September 2001. The composition became the eighth-highest selling single by an Australian artist for that year,[179] being certified Gold by Australian Recording Industry Association,[180] while reaching on the UK Singles Chart at number twenty-seven.[181] In addition, the song received a nomination at the 59th Golden Globe Awards as the Best Original Song,[182] and has been listed as the eighty-fifth within AFI's 100 Years...100 Songs by American Film Institute.[183]\n\n\"Somethin' Stupid\", a cover version of Frank and Nancy Sinatra followed soon. The track, recorded as a duet with English singer-songwriter Robbie Williams, was issued on 14 December 2001 by Chrysalis Records as the lead single of his fourth studio album, Swing When You're Winning.[184] Kidman's second single topped the official music charts in Italy,[185] New Zealand,[186] Portugal,[187] and England, as well as scored top ten placings all over Europe, including Australia, Austria,[188] Belgium,[189] Denmark,[190] Germany,[191] Netherlands,[192] Norway,[193] and Switzerland.[194] Apart from being certified either Gold[195][196][197][198][199] or Silver[200][201] in a number of countries, it was classified as the eleventh best-selling single of 2002 in Italy,[202] thirtieth in the UK, the fifty-ninth in Australia,[203] and the ninety-third in France,[204] respectively. The song peaked at No. 8 in the Australian ARIAnet Singles Chart and at No. 1, for three weeks, in the UK.[205]\n\nOn 5 April 2002, Kidman released, through Interscope, her third single, a cover of Randy Crawford's \"One Day I'll Fly Away\".[206] The song, a Tony Philips remix, was promoted as the pilot single of a follow-up to the original soundtrack of the same name, Moulin Rouge! Vol. 2. In 2006, she contributed with her vocal for the OST Happy Feet on a rendition of the Prince song \"Kiss\".[207] In 2009, she was featured on the soundtrack of Rob Marshall's 2009 movie musical Nine, singing the song \"Unusual Way\".[208]\n\nHer name was later been credited on a track called \"What's the Procedure\", issued on 14 March 2013, on the compilation album I Know Why They Call It Pop: Volume 2 by Rok Lok Records.[209] Among others, Kidman also narrated an audiobook in 2012.[210]\n\nIn 2017, she and Nicolle Gaylon sang backing vocals on her husband, country music singer Keith Urban's song \"Female\".[211]\n\nAwards [ edit ]\n\nIn 2003, Kidman received a Star on the Hollywood Walk of Fame.[212] In addition to her 2003 Academy Award for Best Actress, Kidman has received Best Actress awards from the following critics' groups or award-granting organisations: the Hollywood Foreign Press Association (Golden Globe Awards),[213] Australian Film Institute, Blockbuster Entertainment Awards, Empire Awards, Hollywood Film Festival, London Film Critics' Circle, Russian Guild of Film Critics, Satellite Awards, and Southeastern Film Critics Association.\n\nKidman also received recognition from the National Association of Theatre Owners at the ShoWest Convention in 1992 as the Female Star of Tomorrow, and in 2002 for a Distinguished Decade of Achievement in Film. In 2003, she was given the American Cinematheque Award.[214]\n\nSee also [ edit ]\n\nReferences [ edit ]\n\nHart Radio honors Nicole for her wonderful relationsho with Keith Urban", "images": ["http://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/28px-Video-x-generic.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/59/NicoleKidmanGoldenCompass2007.jpg/170px-NicoleKidmanGoldenCompass2007.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Nicole_Kidman_Cannes_2014.jpg/170px-Nicole_Kidman_Cannes_2014.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/32/2013_Golden_Globe_Awards_%288378775681%29.jpg/170px-2013_Golden_Globe_Awards_%288378775681%29.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Nicole_Kidman_2004.jpg/170px-Nicole_Kidman_2004.jpg", "http://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/2/28/Nicole_Kidman_Cannes_2017_2.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/b/b9/Flag_of_Australia.svg/32px-Flag_of_Australia.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Nicole_Kidman_Cannes_2017_7.jpg/170px-Nicole_Kidman_Cannes_2017_7.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Nicole_Kidman_Cannes_2017_2.jpg/220px-Nicole_Kidman_Cannes_2017_2.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Nicole_kidman3cropped.jpg/170px-Nicole_kidman3cropped.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Nicole_Kidman_2011.jpg/170px-Nicole_Kidman_2011.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/28px-P_vip.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/MV5BOTIzMjlhM2ItMTEyZi00NTAyLWExMGMtMWE2Zjc4OTFmZDliXkEyXkFqcGdeQXVyNDk2MjQ4Mzk%40._V1_%282%29.jpg/284px-MV5BOTIzMjlhM2ItMTEyZi00NTAyLWExMGMtMWE2Zjc4OTFmZDliXkEyXkFqcGdeQXVyNDk2MjQ4Mzk%40._V1_%282%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Nicole_Kidman_-_West_End_2015.png/170px-Nicole_Kidman_-_West_End_2015.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/2/28/Nicole_Kidman_Cannes_2017_2.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Nicole_Kidman", "title": "Nicole Kidman", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/2/28/Nicole_Kidman_Cannes_2017_2.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}