{"url": "https://www.usatoday.com/story/life/tv/2018/12/04/marvelous-mrs-maisel-season-2-review-amazon-rachel-brosnahan-emmy-winner/2189664002/", "text": "It's not easy to pull off marvelous a second time around.\n\nAmazon's \"The Marvelous Mrs. Maisel\" returns for its second season Wednesday, fresh from winning eight Emmy Awards, including outstanding comedy and actress in a comedy, for star Rachel Brosnahan.\n\nThat's a lot of hype to live up to, and, thankfully, in its second season, \"Maisel\" (★★★½ out of four) manages to avoid getting weighed down by its own pretentiousness. Nor does it fail to meet all those high expectations. After a false start of a Parisian season premiere, the new season is as sunny as its eventual Catskills resort setting, even if there's just a hint of dark sky on the horizon.\n\nFor those just jumping on board the \"Maisel\" train, the dramedy, created by Amy Sherman-Palladino (\"Gilmore Girls\"), made its way to Emmy glory with the story of a 1950s housewife-turned-comedienne, Midge Maisel (Brosnahan). Midge falls into comedy when her husband Joel (Michael Zegen) abruptly leaves her and their idyllic Upper West Side life for his young secretary. The first season mostly deals with Midge's cannonball into comedy, with the help of her manager Susie (Alex Borstein, another Emmy winner), and also the fallout from Midge and Joel's separation, as Midge moves back in with her parents Rose (Marin Hinkle) and Abe Weissman (Tony Shalhoub).\n\nMore:'Marvelous Mrs. Maisel' team on Paris, pastrami and why Season 2 story is 'still relevant'\n\nThe new season starts off less about Midge's comedy career and more about how she, her parents and Joel are forming new lives that defy the expectations of their era, both to themselves and to other people. The series expertly shows how even minor steps outside the norm make giant waves and lead to giant consequences. And these are small deviations, such as Midge and Joel's divorce or Rose's desire to get an education. Stand-up comedy is less a deviation and more an act of transformation of Midge into someone completely unrecognizable to her friends and family, a peril she faces nearly every night onstage.\n\nThe first episode is, unfortunately, a misstep that sends Midge's mother on a soul-searching trip to Paris, a development that appears to come out of nowhere and ends equally confusingly. Rose's desire to leave her husband and her life in New York feels more like an excuse to shoot in Paris than true character development, and although it leads to the endlessly funny sight gag of Shalhoub wearing a black beret, the trip abroad mostly makes \"Maisel\" run in place for the entire episode. That includes multiple scenes that confirm Joel and Midge's marriage is over for good, which any viewer could have surmised from the Season 1 finale.\n\nBut once the Maisels and the Weissmans are back in New York and back to their routines, the series starts swinging again. All the elements that made Season 1 so great are back, from the meticulous re-creation of 1950s New York to the luxe costuming to Midge's acerbic stand-up to the acting. When the show leaves Manhattan for an expensive resort in the Catskills, a la \"Dirty Dancing,\" the setting feels far more natural than Paris, and it mines fantastic humor from the leisurely lives of the mid-century Jewish elite.\n\nBrosnahan remains on point, allowing Midge to stray further from her Upper West Side persona, making her just as treacly but with an even bigger potty mouth than before. As much as Midge is learning and growing, she is still a woman whose self-righteousness leads to devastating mistakes, and it only gets worse this season, from angering a booker to ruining a friend's wedding with her annoying habit of turning every room into a stand-up stage.\n\nAs wonderful as Brosnahan and the rest of the cast is, the champion of the second season is Shalhoub. He broadens a character who mostly operated in anger and frustration in Season 1, showing an incredible range and making Abe the funniest member of the cast who doesn't perform stand-up. But Abe isn't just comic relief, and in a midseason story, Shalhoub manages to break your heart as much as he makes you slap your knee.\n\nWhat \"Maisel\" repeats best is its sense of joy and optimism. Its candy-colored version of 1959 may be incredibly myopic, but it celebrates the good in people, the good in comedy and show business and the good in family and marriage over wallowing in the bad. Even when it makes you cringe, you know it soon will make you smile.\n\nAnd there is something marvelous about that.", "images": ["https://www.gannett-cdn.com/presto/2018/12/03/USAT/77da777f-ae1d-431c-be99-222b2de3fc4e-the-marvelous-mrs-maisel-season-two-MMM_204_26379_RT3_Final_rgb.jpg?crop=3899,2193,x0,y0&width=3200&height=1800&format=pjpg&auto=webp", "https://media.gannett-cdn.com/29906170001/29906170001_5973572085001_5973566904001-vs.jpg?pubId=29906170001&width=660&height=372&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/presto/2018/12/03/USAT/77da777f-ae1d-431c-be99-222b2de3fc4e-the-marvelous-mrs-maisel-season-two-MMM_204_26379_RT3_Final_rgb.jpg?crop=3899,2193,x0,y0&width=3200&height=1800&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/tv/2018/12/04/marvelous-mrs-maisel-season-2-review-amazon-rachel-brosnahan-emmy-winner/2189664002/", "title": "Review: 'The Marvelous Mrs. Maisel' rides Emmy wins to a spitfire of a second season", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Review: 'The Marvelous Mrs. Maisel' rides Emmy wins to a spitfire of a second season", "description": "\"The Marvelous Mrs. Maisel,\" which won eight Emmys for its first season, returns for a second with just as much optimism, great stand-up and as many gorgeous costumes.", "url": "https://www.usatoday.com/story/life/tv/2018/12/04/marvelous-mrs-maisel-season-2-review-amazon-rachel-brosnahan-emmy-winner/2189664002/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/presto/2018/12/03/USAT/77da777f-ae1d-431c-be99-222b2de3fc4e-the-marvelous-mrs-maisel-season-two-MMM_204_26379_RT3_Final_rgb.jpg?crop=3899,2193,x0,y0&width=3200&height=1800&format=pjpg&auto=webp", "width": 3200, "height": 1800}, "type": "article"}, "article": {"author": "Kelly Lawler", "content_tier": "free", "opinion": "false"}, "description": "\"The Marvelous Mrs. Maisel,\" which won eight Emmys for its first season, returns for a second with just as much optimism, great stand-up and as many gorgeous costumes.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/presto/2018/12/03/USAT/77da777f-ae1d-431c-be99-222b2de3fc4e-the-marvelous-mrs-maisel-season-two-MMM_204_26379_RT3_Final_rgb.jpg?crop=3899,2193,x0,y0&width=1600&height=800&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Review: 'The Marvelous Mrs. Maisel' rides Emmy wins to a spitfire of a second season", "description": "\"The Marvelous Mrs. Maisel,\" which won eight Emmys for its first season, returns for a second with just as much optimism, great stand-up and as many gorgeous costumes."}}, "movies": [], "publish_date": 1543852800.0, "source": "https://www.usatoday.com", "summary": ""}