{"url": "www.vanityfair.com/style/2016/05/sharon-ozzy-osbourne-split-after-33-years-of-marriage", "text": "Over the weekend, news broke that Sharon and Ozzy Osbourne had broken up after nearly 34 years of marriage. The couple have three children together—Aimee, 32, Kelly, 31, and Jack, 30. Conflicting, salacious reports immediately began to emerge about the Osbourne’s split. One said that Ozzy had gone missing after his wife threw him out of their home. Another alleged he’d had an affair with a celebrity hairdresser. There were also concerns that Ozzy had relapsed, which happened the last time the couple split in 2013. On that occasion, the Black Sabbath singer apologized on his Facebook page for what he called his “insane behavior” while drinking and using drugs for the previous year and a half.\n\nThis time, the couple decided to nip the rumors in the bud before they had a chance to spiral out of control even more. Ozzy told E! News on Monday that the split has nothing to do with a relapse. “I have been sober for three and a quarter years, I have not touched drugs or alcohol in that time. Any reports that I am not sober are completely inaccurate.” A source also told E! that, “[T]he pair mutually agreed that Ozzy would move out of the house temporarily.”\n\nContrary to what other outlets alleged, Ozzy had not gone missing. He was photographed on Monday morning in Los Angeles. He was also spotted on Tuesday with his daughter Aimee, who’s rarely seen in public.\n\nSharon Osbourne didn’t attend Monday’s taping of The Talk, but her co-host Julie Chen addressed her absence. “There were many tabloid headlines this past weekend about her and Ozzy. Rumors and speculation that they have split up after nearly 34 years of marriage. Sharon understandably took today off. We are sending all of our love to her and her family, and we ask that you do the same.”\n\nOsbourne not only resumed her duties at The Talk on Tuesday, she discussed what was happening in her personal life. She came onto the set holding hands with the other hosts as the audience chanted “Sharon! Sharon!” When she sat down, Sharon Osbourne sipped from a tall glass of lemonade as opposed to a mug of coffee, because Beyoncé has turned lemonade sipping into the universal symbol of a woman scorned.\n\n“I’ve been avoiding looking at any pictures or reading anything. I know what’s going on,” Osbourne said. “I don’t need to read about it and see about it because it’s like putting salt in a wound. So I don’t need to.”\n\nShe thanked everyone who for sending her messages of support before confirming that she had thrown her husband out of their home over the weekend. “It’s true,” Osbourne said. However, “He’s back, and I’m out of the house . . . I don’t know where I’m going, who I’m going with. And I just need time to think. And really think about myself, about what do I really want for . . . Because I’m 63 years of age, and I can’t keep living like this.”\n\nNevertheless, Sharon Osbourne isn’t sure if she and Ozzy are headed for a reconciliation or divorce. “At this point, I cannot answer that because I don’t know what I want . . . I love Ozzy dearly, you know. He’s given me an unbelievable life,” she dished. ”He’s given me three gorgeous children . . . You know, I love him,” she said on The Talk.\n\nNo matter what, she appears to have the support of her children. Yesterday, Kelly Osbourne shared an Instagram photo of herself holding a lemon over her eye and sticking out her tongue with a motivational caption.", "images": ["http://www.vanityfair.com/verso/static/vanity-fair/assets/logo-header.b6748104d0d362745b508aebea5a86c913809200.svg", "https://media.vanityfair.com/photos/573333906107999878ec37f8/16:9/w_1280,c_limit/t-sharon-ozzy-osbourne.jpg", "https://media.vanityfair.com/photos/573334216107999878ec37fc/master/w_2560%2Cc_limit/t-sharon-ozzy-osbourne.jpg", "https://media.vanityfair.com/photos/57471e4e55f979a31fa98a12/1:1/w_90%2Cc_limit/contributor-vf-web-lauren-levine.jpg", "http://www.vanityfair.com/verso/static/vanity-fair/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg", "https://media.vanityfair.com/photos/54cc0061fde9250a6c410738/1:1/w_350%2Ch_350%2Cc_limit/image.jpg"], "top_img": "https://media.vanityfair.com/photos/573333906107999878ec37f8/16:9/w_1280,c_limit/t-sharon-ozzy-osbourne.jpg", "keywords": [], "authors": ["Lauren Le Vine", "Lauren Le Vin", "Eric Spitznage", "Vanity Fai"], "canonical_link": "https://www.vanityfair.com/style/2016/05/sharon-ozzy-osbourne-split-after-33-years-of-marriage", "title": "Sharon Ozzy Osbourne Split After 33 Years of Marriage", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Lauren Le Vine", "copyright": "Copyright (c) Condé Nast 2020", "description": "Sharon and Ozzy Osbourne have split after 33 years of marriage.", "id": "573330e076585bd84561c925", "keywords": "style,sharon osbourne,ozzy osbourne,kelly osbourne,jack osbourne,aimee osbourne", "news_keywords": "style,sharon osbourne,ozzy osbourne,kelly osbourne,jack osbourne,aimee osbourne", "robots": "index, follow", "content-type": "article", "parsely-post-id": "573330e076585bd84561c925", "parsely-metadata": "{\"description\":\"Sharon and Ozzy Osbourne have split after 33 years of marriage.\",\"image-16-9\":\"https://media.vanityfair.com/photos/573333906107999878ec37f8/16:9/w_1000,c_limit/t-sharon-ozzy-osbourne.jpg\",\"image-1-1\":\"https://media.vanityfair.com/photos/573333906107999878ec37f8/1:1/w_1000,c_limit/t-sharon-ozzy-osbourne.jpg\"}", "og": {"description": "The couple had a tumultuous weekend, to say the least.", "image": "https://media.vanityfair.com/photos/573333906107999878ec37f8/16:9/w_1280,c_limit/t-sharon-ozzy-osbourne.jpg", "site_name": "Vanity Fair", "title": "Sharon & Ozzy Osbourne Open Up About Splitting After 33 Years of Marriage", "type": "article", "url": "https://www.vanityfair.com/style/2016/05/sharon-ozzy-osbourne-split-after-33-years-of-marriage"}, "article": {"content_tier": "metered", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@VanityFair", "description": "The couple had a tumultuous weekend, to say the least.", "domain": "https://www.vanityfair.com", "image": {"src": "https://media.vanityfair.com/photos/573333906107999878ec37f8/16:9/w_1280,c_limit/t-sharon-ozzy-osbourne.jpg?mbid=social_retweet"}, "site": "@VanityFair", "title": "Sharon & Ozzy Osbourne Open Up About Splitting After 33 Years of Marriage"}, "fb": {"app_id": 305927716147259, "pages": 8810407571}, "google-signin-client_id": "1065629119444-svrqo31taikd2j0ji4dgjs9q3vul4133.apps.googleusercontent.com"}, "movies": [], "publish_date": null, "source": "http://www.vanityfair.com", "summary": ""}