{"url": "https://popculture.com/reality-tv/2018/01/25/maryse-pregnant-total-divas-season-finale/", "text": "Talk about a knockout! Maryse Ouellet had some exciting baby news for Mike \"The Miz\" Mizanin on Wednesday's episode of Total Divas, and the WWE star's reaction is priceless.\n\n\"Mike has been on the road. I haven't seen him in a few days and I'm feeling tired,\" Maryse says in a confessional. \"I feel like I need to nap all the time and it's just not like me. This has been the longest 48 hours of my life.\"\n\nAfter Mike gets home, Maryse chats nervously with her husband while he chows down before saying he's heading to bed.\n\n\"I wanted to talk to you about something before you go to bed,\" the WWE Diva tells her hubby. \"Actually, I've been trying to talk to you for 48 hours now, but I wanted to see you in person.\"\n\n\"What's up?\" Mike asks worriedly. \"You OK?\"\n\nIt's at this moment that Maryse whips out a positive pregnancy test, saying, \"Congratulations, dad!\"\n\n\"You're kidding?\" Mike asks. \"Are you sure?\"\n\n\"I'm one hundred percent pregnant,\" she tells him, pulling out a ton more positive tests..\n\n\"Oh my God!\" Mike says.\"We weren't even trying!\"\n\nAfter asking a few questions in shock about the legitimacy of pregnancy tests, reality seems to set in on the wrestler.\n\n\"Wow, I'm gonna be a dad,\" he says, rising to kiss his bride. \"Congratulations mom!\"\n\nWhen Maryse asks what's behind his somewhat glazed look, he reveals the surprise has left him with a lot of conflicting emotions.\n\n\"I'm speechless; I'm happy; I'm nervous; I'm scared,\" he tells her. \"This is kind of an interesting time too.\"\n\nMaryse waves off his concerns, saying the couple will figure it out as they go. But privately, she has her concerns.\n\n\"You know when they say timing is everything, well timing is everything,\" she tells cameras. \"My career is doing phenomenal, Mike's career is doing phenomenal ... I don't know what's gonna happen now.\"\n\nShe continues, \"I'm pregnant and I work in a very physical company, like it's WWE. This is definitely unknown.\"\n\nAlthough the couple announced they were expecting their first child in September, revealing that the baby is going to be a girl in October, Wednesday's episode of the E! show was the first time fans got an intimate look at the milestone moment for the couple.\n\nPhoto credit: E!", "images": ["https://media.popculture.com/2018/01/maryse-20023918-640x320.jpeg"], "top_img": "https://media.popculture.com/2018/01/maryse-20023918-640x320.jpeg", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/reality-tv/2018/01/25/maryse-pregnant-total-divas-season-finale/", "title": "Maryse Reveals She's Pregnant to a Shocked Miz on 'Total Divas'", "meta_data": {"description": "Talk about a knockout! Maryse Ouellet had some exciting baby news for Mike 'The Miz' Mizanin on Wednesday's episode of Total Divas, and the WWE star's reaction is priceless.'Mike has been on the road. I haven't seen him in a few days and I'm feeling tired,' Maryse says in a confessional. 'I feel [...]", "keywords": "Total Divas,The Miz,WWE", "news_keywords": "Total Divas,The Miz,WWE", "twitter": {"card": "summary", "site": "@PopCulture", "creator": "@PopCulture", "title": "Maryse Reveals She's Pregnant to a Shocked Miz on 'Total Divas'", "description": "Talk about a knockout! Maryse Ouellet had some exciting baby news for Mike 'The Miz' Mizanin on [...]", "image": "https://media.popculture.com/2018/01/maryse-20023918-640x320.jpeg"}, "og": {"title": "Maryse Reveals She's Pregnant to a Shocked Miz on 'Total Divas'", "type": "article", "url": "https://popculture.com/reality-tv/2018/01/25/maryse-pregnant-total-divas-season-finale/", "image": {"identifier": "https://media.popculture.com/2018/01/maryse-20023918-640x320.jpeg", "width": 640, "height": 320}, "site_name": "Reality TV", "description": "Talk about a knockout! Maryse Ouellet had some exciting baby news for Mike 'The Miz' Mizanin on [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1516809600.0, "source": "https://popculture.com", "summary": ""}