{"url": "https://www.etonline.com/luis-fonsi-and-daddy-yankee-heat-things-sizzling-despacito-performance-2018-grammys-95101", "text": "Luis Fonsi and Daddy Yankee brought the Latin flavor to the 60th Annual GRAMMY Awards!\n\nThe Puerto Rican singer and the \"Gasolina\" rapper took the stage at Madison Square Garden in New York City on Sunday to perform their smash hit and three-time GRAMMY-nominated single, \"Despacito.\"\n\nThe duo was joined by vocalist and Miss Universe 2006 Zuleyka Rivera, who starred in the \"Despacito\" music video. Fonsi had previously told ET during rehearsals that Justin Bieber was not going to perform with them.\n\nNonetheless, Fonsi and Daddy Yankee pulled off a showstopper of a performance that had stars like Chrissy Teigen, John Legend and Donnie Wahlberg dancing in their seats.\n\nThe \"Despacito\" remix became a worldwide phenomenon, spending 16 weeks at No. 1 on the Billboard Hot 100 and tying the all-time record for consecutive weeks on top.\n\n\"Despacito\" was not only a commercial but also a critical success for the collaborators. The track won four Latin GRAMMY Awards, including Record of the Year and Song of the Year, and is nominated for three GRAMMY Awards.\n\nThe song was infectious, and its music video went on to become the first YouTube video to hit 4 billion views, as well as the world's most streamed song of all time with 4.6 billion streams.\n\nBefore hitting the stage, Fonsi told ET how nervous he was and what an honor as a Latin artist it was to take the stage.\n\n\"I'm a little nervous, I'm not gonna lie,\" Fonsi revealed. \"This is really big. Not only for me, but for Latin music in general, to be able to sing a song in Spanish for the big show. I'm really proud to be here. Being from Puerto Rico, growing up here in the United States, I've always been so proud of my roots and my language, and all these artists who are performing, they've all influenced me. So to be able to celebrate a little bit of who I am and where I'm from, and to share with the world, and break that language barrier -- especially after everything that [Puerto Rico has] been going through -- this is already just good vibes for everybody.\"\n\nIn December, following the GRAMMY nominations, Fonsi also told ET how proud he was of his recent accomplishments.\n\n\"I think all artists dream about achieving this at some point,\" he expressed. \"It just makes me feel like everything I’ve been working so hard for the last two decades and all the sacrifices I have made have been worthwhile.\n\n\"I feel extremely honored and grateful to be recognized by the Academy,\" he added. \"I’m still digesting everything that is happening, but one thing is for sure, this is historic for Latin music, and I’m proud to be a part of the selective group of artists that has crossover and shared our roots and culture with the world.\"\n\nAs far as achieving the same success with his new music as he did with \"Despacito,\" he understands it was a huge feat.\n\n\"What happened with 'Despacito' is something that is hard to match, even by me, so I do not have any pressure of achieving the same,\" he said. \"I just want to continue creating amazing music and if there is an opportunity to work with other artists from different genres, I’m all for that.\"\n\nFor more on how Fonsi and Daddy Yankee prepared for the big show, watch below.\n\nRELATED CONTENT:\n\nLuis Fonsi On 'Despacito' Being Recognized by Both the Latin and American GRAMMYs (Exclusive)\n\nLuis Fonsi on His Influential 20-Year Career and His Mission to Help Rebuild Puerto Rico (Exclusive)\n\nLuis Fonsi Says Justin Bieber Deserves a 'Pass' for Not Knowing the Lyrics to 'Despacito'\n\nLuis Fonsi Confirms Justin Bieber Will Not Perform 'Despacito' at the GRAMMYs 2018 (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRelated Gallery", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/et_intv_despacito_012818.png?h=c673cd1c&itok=jaPvMnMY", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/GettyImages-1143597813.jpg?h=ee1ee909&itok=I68E4wZI", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/gctah300_0.jpg?h=35278c44&itok=wFHc-B3i", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2018-01/gettyimages-911499216.jpg?h=f87027f4&itok=yJL-tpvf"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/et_intv_despacito_012818.png?h=c673cd1c&itok=jaPvMnMY", "keywords": [], "authors": ["Liz Calvario"], "canonical_link": "https://www.etonline.com/luis-fonsi-and-daddy-yankee-heat-things-up-with-sizzling-despacito-performance-at-2018-grammys", "title": "Luis Fonsi and Daddy Yankee Heat Things Up With Sizzling 'Despacito' Performance at 2018 GRAMMYs", "meta_data": {"article": {"opinion": "false"}, "title": "Luis Fonsi and Daddy Yankee Heat Things Up With Sizzling 'Despacito' Performance at 2018 GRAMMYs | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/luis-fonsi-and-daddy-yankee-heat-things-up-with-sizzling-despacito-performance-at-2018-grammys", "title": "Luis Fonsi and Daddy Yankee Heat Things Up With Sizzling 'Despacito' Performance at 2018 GRAMMYs", "description": "The singer and rapper took the stage at Madison Square Garden in New York City on Sunday.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/et_intv_despacito_012818.png?h=c673cd1c&itok=jaPvMnMY", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "The singer and rapper took the stage at Madison Square Garden in New York City on Sunday.", "title": "Luis Fonsi and Daddy Yankee Heat Things Up With Sizzling 'Despacito' Performance at 2018 GRAMMYs", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Liz Calvario‍", "url": "https://www.etonline.com/luis-fonsi-and-daddy-yankee-heat-things-up-with-sizzling-despacito-performance-at-2018-grammys", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/et_intv_despacito_012818.png?h=c673cd1c&itok=jaPvMnMY"}, "description": "The singer and rapper took the stage at Madison Square Garden in New York City on Sunday.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "Awards, Awards, Music, News, Grammys, Luis Fonsi", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}