{"url": "https://www.thewrap.com/game-of-thrones-megyn-kelly-fox-news-summer-tv-winners-losers/", "text": "A wise woman once said, “Sometimes when you win, you really lose, and sometimes when you lose, you really win, and sometimes when you win or lose, you actually tie, and sometimes when you tie, you actually win or lose. Winning or losing is all one organic mechanism, from which one extracts what one needs.”\n\nBut that was just a movie character named Gloria Clemente, who was played masterfully by Rosie Perez in 1992’s “White Men Can’t Jump.” Aside from those massive “Jeopardy!” winnings (“What is a Quahog?”), what does she know anyway? Plus, we’re talking about TV here, where when you win, you win. And when you lose, well, just ask ABC.\n\nTheWrap digged through the data (and relied heavy on circumstantial observation) to come up with Summer 2017’s nine small-screen winners and losers. Check out our list and reasons below.\n\nAlso Read: 2017 Creative Arts Emmys: The Complete List of Night 1 Winners\n\nWinner: The Actual Winner\n\nOur first winner is an easy one, as NBC was the No. 1 broadcast network for another summer in Nielsen’s TV ratings — its seventh in a row for the key 18-49 demo, and third among total viewers.\n\nAlong the way, NBC launched a new legit hit in “World of Dance,” which proved a terrific partner for summer crown jewel “America’s Got Talent.” Expect those two to dominate together for years to come.\n\n“Weekend Update: Summer Edition” was no slouch performer either and “American Ninja Warrior” stayed doing its thing.\n\nBut don’t worry for NBC when the leaves change color: “This Is Us” will be back, and “Sunday Night Football” is set to again be the biggest show of the season. Plus, the Peacock’s got a killer combination coming up in 2018: Super Bowl LII and a little TV show called the Winter Olympics. Good luck, everyone else.\n\nAlso Read: Summer 2017 Movie Winners and Losers, From 'Spider-Man: Homecoming' to 'The House' (Photos)\n\nLoser: Every Rose Has Its Thorn(s)\n\nThere was very little love surrounding the “Bachelor” franchise this summer.\n\nFirst up, Rachel Lindsay’s “Bachelorette” finale slipped double digits in ratings from the prior year’s version. Then there was the ugly “Bachelor in Paradise” sex scandal, when Corinne Olympios called herself a “victim” after a sexual encounter with DeMario Jackson. A tone-deaf promo ahead of the show’s return didn’t help fans forget the controversy and hop back on board.\n\nFinally, the ABC franchise finished the summer with an unpopular choice for its next “Bachelor.” Peter Kraus was RIGHT THERE, you guys.\n\nAlso Read: 43 Summer TV Premieres Ranked by Total Viewers (Photos)\n\nWinner: Cup a Joe\n\nAnd Joe and Mika thought a May engagement would be the highlight of their year…\n\nPerhaps no one on television has directly benefitted more from the President Trump era than MSNBC’s morning show, “Morning Joe.” Joe Scarborough and Mika Brzezinski have become NBCU’s new “Must-See TV,” generally spending their weekday mornings shredding the hapless White House administration from 6 a.m. (or 5, if you’re into “First Look”) to 9.\n\nThese months, it’s the rare day one wakes up, checks the Twitter trends and doesn’t see “Morning Joe” among the Top 10. So yeah, good summer guys.\n\nAlso Read: ABC's 'In an Instant' Is Summer's Lowest-Rated Broadcast TV Show\n\nLoser: Keep Your Pants on, Fox\n\nThis has been a summer to forget for Fox’s cable networks, and it would have been even worse if Bill O’Reilly had made it to the warmer months.\n\nIn June, Fox Sports National Networks president Jamie Horowitz exited amid claims of misconduct, which he denied. A month later, Fox News’ Eric Bolling was benched for reportedly sending unsolicited, lewd text messages to female colleagues. Bolling would be fired weeks later.\n\nAdditionally, Fox Business Network’s Charles Payne was suspended from July 6 through Sept. 8 as the company investigated sexual harassment allegations into yet another on-air personality. Considering he returned, it stands to reason that Payne was cleared behind-close-doors of the former guest’s behind-closed-doors accusations.\n\nAlso Read: Why NBC Will Win Its 7th Straight Summer in TV Ratings\n\nWinner AND Loser: HBO’s “Crown” Jewel\n\n“Game of Thrones” is pretty popular, in case you hadn’t heard.\n\nThe HBO juggernaut’s second-to-last season, which signed off last month, was rewarded with widespread praise and numerous series highs in ratings. No dragons were circling here.\n\nAlas, things didn’t entirely go off without a hitch, as hackers informed the network in July that they had breached its system. When HBO declined to heed the $6 million-plus ransom demand, the thieves leaked details and scripts for then-unaired “Thrones” episodes, along with other company information.\n\nBut given the massive viewership despite the leaks for the show based on George R.R. Martin’s books, HBO appears to have made the right call in its refusal to kowtow.\n\nAlso Read: Fall TV Premiere Calendar: 164 New and Returning Shows (Photos)\n\nLoser: The Worldwide Leader in Bad PR\n\nESPN continued to see its power diminish this summer, as the network shed hundreds of thousands of subscribers as it continues to be hit hard by cord-cutting. Parent company Disney announced an ESPN-branded streaming service to stem the bleeding, but that won’t launch until next year.\n\nIf that wasn’t bad enough, the cable giant was accused of mishandling a tweet by “SportsCenter” anchor Jemele Hill, turning it into a national story that even prompted the White House to call for her firing.\n\n\n\nAdding to the hits: ESPN radio host Ryen Russillo was suspended and forced to pay $250 after wandering into the wrong Wyoming hotel room while drunk, and the network pulled announcer Robert Lee off of a University of Virginia telecast following the protests in Charlottesville. Because, you know, same name as Robert E. Lee.\n\nAlso Read: 47 Fall TV Actors Ranked Most to Least Liked, From Michael Weatherly to Matt LeBlanc (Photos)\n\nWinner: “Seacrest, In!” (Everything)\n\nIt was a good time to be Ryan Seacrest, as if there’s ever a bad time to be the wildly prolific multi-hyphenate.\n\nIn addition to scoring solid ratings on “Live” after landing the coveted co-hosting gig opposite Kelly Ripa, he finalized his deal in July to return as the face of “American Idol,” picking up a substantial payday for ABC’s reboot ahead of its likely 2018 launch.\n\nThe always-busy Seacrest also continues to launch new properties in the polarizing Kardashian empire (yes, he has an EP credit on this summer’s E! unscripted series “Life of Kylie”), and he still hosts his morning radio show, thanks in part to ABC building him his own radio studio to cut down on his commute.\n\nAlso Read: 34 Fall TV Actresses Ranked Most to Least Liked, From Pauley Perrette to America Ferrera (Photos)\n\nLoser: Not Quite “60 Minutes”\n\nMaybe Megyn Kelly’s fans all spent the summer camping and away from TV access?\n\nThe Fox News alum launched “Sunday Night With Megyn Kelly” in June, and despite a hot start thanks to star guest Russian President Vladimir Putin, her primetime talker’s ratings were unimpressive, as the show often had trouble topping reruns of CBS’ venerable “60 Minutes.”\n\nGiven that she takes over for the third hour of “Today” in the fall, NBC brass are presumably holding their breath that Kelly is just taking a little time to find her audience.\n\nAlso Read: 'Will & Grace' Revival to Actor Mixup: 7 Things We Learned at TCA and 7 Unsolved Mysteries (Photos)\n\nWinner: It’s Showtime!\n\nFloyd Mayweather’s final bout might not have been his most impressive, but it was certainly a big win for the premium cable network behind it.\n\nShowtime’s telecast of the highly anticipated match between the undefeated boxer and UFC standout Conor McGregor is expected to have broken pay-per-view records, with final numbers still to come. Plus, despite concern from fans that the seemingly uneven matchup would be a snooze-fest, the fight actually didn’t suck.\n\nIt wasn’t just fisticuffs that gave Showtime a boost. “Twin Peaks” was back in all its head-scratching glory, with the return to Washington bringing solid ratings and plenty of watercooler buzz.\n\nAlso Read: 15 New Fall TV Shows You'll Want to Catch, From 'Inhumans' to 'Star Trek: Discovery' (Photos)\n\nDid we miss anyone of consequence? What’d we get wrong? Let us know in the comments section.\n\nMatt Pressberg contributed to this post.", "images": ["https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/newsletter-icon.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo-white.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-wrappro-white.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-pro-free.svg", "https://www.thewrap.com/wp-content/uploads/2017/02/BrunoMarsPrince-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/wrap-logo.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/memberships/user_icon_white.svg", "https://www.thewrap.com/wp-content/uploads/2017/09/Sean-Spicer-on-Kimmel-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2017/09/fall-box-office-movie-showdowns-160x105.jpeg", "https://www.thewrap.com/wp-content/uploads/2014/05/TV-UPFRONTS.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=8498827&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel/p-8flXM--ZHulLQ.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/arw-rt.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/get-more.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/email-icon.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/first-take.png", "https://www.thewrap.com/wp-content/uploads/2017/09/winners-and-losers.jpg", "https://www.thewrap.com/wp-content/plugins/contextual-links/assets/img/loading.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/logo-signup.png", "https://www.thewrap.com/wp-content/uploads/2017/05/networks.jpg"], "top_img": "https://www.thewrap.com/wp-content/uploads/2017/09/winners-and-losers.jpg", "keywords": [], "authors": ["Tony Maglio", "Ryan Gajewski", "Debbie Emery", "Jeremy Fuster"], "canonical_link": "https://www.thewrap.com/game-of-thrones-megyn-kelly-fox-news-summer-tv-winners-losers/", "title": "9 Summer TV Winners and Losers: From ‘Game of Thrones’ to Megyn Kelly", "meta_data": {"parsely-title": "9 Summer TV Winners and Losers: From ‘Game of Thrones’ to Megyn Kelly", "parsely-link": "https://www.thewrap.com/game-of-thrones-megyn-kelly-fox-news-summer-tv-winners-losers/", "parsely-type": "post", "parsely-pub-date": "2017-09-15T08:57:39-07:00", "parsely-section": "tv", "parsely-author": "Ryan Gajewski", "parsely-tags": "abc, cbs, charlottesville, conor-mcgregor, corinne-olympios, demario-jackson, disney, eric-bolling, espn, floyd-mayweather, george-r-r-martin, jamie-horowitz, kelly_ripa, mika_brzezinski, pauley-perrette, peter-kraus, rachel-lindsay, robert-e-lee, robert-lee, rosie-perez, ryan_seacrest, trump", "viewport": "initial-scale=1.0, maximum-scale=6.0, user-scalable=yes", "description": "9 Summer TV Winners and Losers: 'Game of Thrones,' Megyn Kelly, 'The Bachelor' franchise, Mayweather-McGregor, and Fox cable cannot keep its pants on", "news_keywords": "abc, cbs, charlottesville, conor mcgregor, corinne olympios, demario jackson, disney, eric bolling, espn, floyd mayweather, george r. r. martin, jamie horowitz, kelly ripa, mika brzezinski, pauley perrette, peter kraus, rachel lindsay, robert e. lee, robert lee, rosie perez, ryan seacrest, trump", "original-source": "https://www.thewrap.com/game-of-thrones-megyn-kelly-fox-news-summer-tv-winners-losers/", "og": {"locale": "en_US", "type": "article", "title": "9 Summer TV Winners and Losers: From 'Game of Thrones' to Megyn Kelly", "description": "9 Summer TV Winners and Losers: 'Game of Thrones,' Megyn Kelly, 'The Bachelor' franchise, Mayweather-McGregor, and Fox cable cannot keep its pants on", "url": "https://www.thewrap.com/game-of-thrones-megyn-kelly-fox-news-summer-tv-winners-losers/", "site_name": "TheWrap", "image": {"identifier": "https://www.thewrap.com/wp-content/uploads/2017/09/winners-and-losers.jpg", "secure_url": "https://www.thewrap.com/wp-content/uploads/2017/09/winners-and-losers.jpg", "width": 618, "height": 412}}, "article": {"publisher": "http://facebook.com/thewrap", "author": "https://www.facebook.com/tony.maglio.7?ref=tn_tnmn", "tag": "Trump", "section": "News", "published_time": "2017-09-15T15:57:39-07:00"}, "fb": {"app_id": 228236404181023, "pages": 48941893663}, "twitter": {"card": "summary_large_image", "description": "9 Summer TV Winners and Losers: 'Game of Thrones,' Megyn Kelly, 'The Bachelor' franchise, Mayweather-McGregor, and Fox cable cannot keep its pants on", "title": "9 Summer TV Winners and Losers: From 'Game of Thrones' to Megyn Kelly", "site": "@thewrap", "image": "https://www.thewrap.com/wp-content/uploads/2017/09/winners-and-losers.jpg", "creator": "@tonymaglio"}, "generator": "WooFramework 6.2.0", "sailthru.title": "9 Summer TV Winners and Losers: From ‘Game of Thrones’ to Megyn Kelly", "sailthru.date": "2017-09-15T15:57:39+00:00", "sailthru.author": "Tony Maglio", "sailthru.tags": "disney,cbs,abc,ryan seacrest,espn,kelly ripa,trump,mika brzezinski", "sailthru.category": "tv,ratings,business,news", "sailthru.image.full": "https://www.thewrap.com/wp-content/uploads/2017/09/winners-and-losers.jpg", "sailthru.image.thumb": "https://www.thewrap.com/wp-content/uploads/2017/09/winners-and-losers-150x150.jpg", "wp-parsely_version": "1.12.1", "google-site-verification": "-PpFSIrGHybVDxbndrL6MCngw3j6BXdy0xDVBVVOacI"}, "movies": [], "publish_date": 1505516259.0, "source": "https://www.thewrap.com", "summary": ""}