{"url": "https://www.inquisitr.com/4908497/gwen-stefani-sing-whole-bunch-of-songs-about-blake-shelton-during-las-vegas-residency/", "text": "Gwen Stefani is admitting that her boyfriend, Blake Shelton, will play a big role in her upcoming Las Vegas residency. Per Entertainment Tonight Canada, the star revealed in a new interview that Blake has inspired a number of the songs she’s planning to sing when she heads to Sin City in June, as well as helping her to choose a number of aspects of the shows, including when it came to picking out the dancers.\n\n“Obviously, he’s my best friend, so I’m bouncing stuff off him all the time,” Stefani revealed this week of involving the country superstar and The Voice coach in her residency shows.\n\n“He’s one of those people in my life that’s super supportive and gets me motivated,” Gwen said of the country singer, who she’s been dating for more than two years. “There’s a whole bunch of songs about him in the show, so that’s fun.”\n\nGwen then revealed that she would send Blake videos and updates of how show planning is going, even sending him videos of the dancers so he could see them.\n\n“Like anybody with their best friend, we share everything together,” the mom-of-three said. “I’ll tell him, ‘I picked my dancers! There were 500 girls that tried out!’ and I’ll send him videos.”\n\nStefani, who was recently spotted spending a sweet family Mother’s Day with Shelton and her three kids at church, also revealed in the new interview that fans hoping for new music probably shouldn’t keep their hopes up, as she said that she knows she’s nearing the end of her music career that first began way back in 1986 as a member of the band No Doubt.\n\n“I’m obviously at the end of my journey of being a musician… because of my age, and I’ve been doing it for thirty-something years,” she said, suggesting that she may soon be ready to retire from music.\n\nGwen added, “It’s perfect for me to be able to do a Vegas show because not only does it work for me as a mom, but it also works creatively.”\n\nGwen Stefani with former husband Gavin Rossdale. Featured image credit: Angela Weiss Getty Images\n\nStefani also referred to how her divorce from her former husband, Gavin Rossdale, inspired her last album, This Is What The Truth Feels Like, and its accompanying tour. She called her divorce from the rocker an “unexpected life crisis” after 14 years of marriage.\n\n“I did my last tour because I had this unexpected life crisis and then the music came pouring out of me from that,” she said of her split with the musician, but noted that touring all the time just isn’t “realistic” for her as a mom. “It was such a lifesaver and a beautiful moment for me to be able to write again. I put that tour on at the last minute and went on a summer tour with the kids.”\n\nAs reported by Daily Mail, Stefani announced her Las Vegas residency during an appearance on The Ellen DeGeneres Show in April. She told the daytime talk show host at the time that she was feeling pretty “nervous” about her new gig, but will also be doing her bit for charity through ticket sales.\n\n“I feel really nervous about it, but really excited,” Stefani revealed. “Every ticket that I sell for this show, one dollar is going for Cure for Kids, which is a local Vegas charity. It just feels good.”\n\nGwen was then joined by boyfriend Blake for her big welcome to Las Vegas in April.\n\nE! Online reported that Shelton could be spotted cheering on and supporting his girlfriend at an event welcoming her to the Zappos Theater at Planet Hollywood Resort & Casino, where she’ll be performing her residency show, titled “Just A Girl.”\n\nGwen’s Just A Girl Las Vegas residency shows will begin on June 27.", "images": ["https://secure.gravatar.com/avatar/04740ca59ff3a7ed6178872d42206b16?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2018/05/Gwen-Stefani-Will-Sing-A-Whole-Bunch-Of-Songs-About-Blake-Shelton-During-Las-Vegas-Residency.jpg", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://cdn.inquisitr.com/wp-content/uploads/2018/05/Gwen-Stefani-will-sing-about-Blake-Shelton-during-Las-Vegas-residency-following-Gavin-Rossdale-divorce.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png"], "top_img": "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Emily Hutchinson"], "canonical_link": "https://www.inquisitr.com/4908497/gwen-stefani-sing-whole-bunch-of-songs-about-blake-shelton-during-las-vegas-residency/", "title": "Gwen Stefani Will Sing ‘A Whole Bunch Of Songs’ About Blake Shelton During Las Vegas Residency", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": ["https://www.youtube.com/embed/egy6kwupEg4?feature=oembed"], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}