{"url": "http://riverdale.wikia.com/wiki/Hermione_Lodge", "text": "A Guilty Conscious?\n\nThe morning after the Jubilee, Hermione confronted Veronica over her drinking of the Cristal that she purchased specifically for Hiram. Veronica's phone then began to ring, which led Hermione on route to address the fact that Archie slept over. However, the lecture was put on hold after learning that Fred was shot by a black hood wearing assailant during a supposed robbery at Pop's. In light of this tragic incident, Hermione and Veronica rushed down to Riverdale General Hospital, where they are met by Jughead and the Coopers. They entered the lobby to find Archie covered in his father's blood, pacing back and forth. With the kids offering comfort to Archie, Hermione, Alice, and Hal checked in with the nurses' station for updates.\n\nAfter learning that Fred would be in surgery for a while, Hermione asked Archie if he had contacted his mother to inform her about the shooting, which he hadn't. As he headed out in the hall to do as Hermione had asked, Alice and Jughead began to argue over the Southside Serpents' potential involvement in the shooting.\n\nOnce Archie returned from questioning with Sheriff Keller about the shooting, Fred's doctor entered the lobby to inform them that while the bullet had successfully been removed from Fred, and that the internal bleeding had stopped, he still wasn't capable breathing on his own, which was worthy of concern. Archie then asked to see his father, which would be arranged once they found him a room, though this could take up to two hours. Until then, they advised Archie to go home and get cleaned up.\n\nWith Fred's life hanging in the balance, Hermione headed to the Chapel to pray in his name. However, she was interrupted by Veronica, who questioned if she was praying for Fred's speedy recovery or a quick death. Veronica explained Jughead's theory about the shooting, and how it may have been a hit, which left Veronica wondering who would be evil enough to commit such a heinous act. Veronica then remembered how Hermione wanted Fred to sell his share of the company back because he and Hiram wouldn't get along. Hermione initially assumed that the target of Veronica's accusations was Hiram, but in actuality, Veronica directed them towards her. Veronica no longer saw her as an innocent pawn. She believed Hermione to be Hiram's eyes and ears on the ground, calling the shots while he's in prison. Hermione rose to her feet as she informed Veronica that her disrespect would no longer be tolerated. She offered her daughter a word of advice; to get back in line with the family because she's a Lodge above all else. She should slap Veronica for what she's insinuating, but Hermione claimed that she's not a violent person.\n\nHermione briefly appeared in Fred's dream-like hallucination of Archie and Veronica's Scottish themed wedding. She sat alongside Josie and Kevin while Veronica walked down the aisle in her wedding dress. Meanwhile, in reality, Hermione and Hiram, who had just been released from prison, awaited Veronica's return home. She wasted little time informing Hiram that Veronica drank his Cristal. After giving Hiram on kiss on the cheek, Veronica informed them that Fred was awake and recovering.[16]\n\nAs Hermione and Hiram sat at the dinner table, Veronica entered the room, accusing her father of buying Pop's Chock'lit Shoppe the same way he bought the Twilight Drive-In, anonymously. Hiram denied that accusation and insisted that Veronica should sit down so that they could talk civilly. Veronica decided to talk about Fred and the shooting at the diner. Veronica recalled that he was shot the day after he rejected Hermione's offer to sell his portion of the SoDale project, leaving Veronica to wonder if Hiram was responsible. Having had enough of Veronica's accusations, both towards her as well as Hiram, Hermione insisted that Veronica stop. An unconvinced Veronica told her parents that she was Hiram's fiercest protector, which Hermione could vouch for. Whenever someone called him the devil, she always came to his defense. However, she saw him in a new light after he sent Veronica a letter, which unbeknownst to Hermione, was a threat from Hiram to expose her should Veronica fail to cooperate. Veronica then gave Hermione the letter, telling her to think about the kind of man that they are letting back into their lives. After reading the letter, however, Hermione told Veronica that she wrote the letter threatening herself in order to get Veronica to testify on Hiram's behalf, so that they could be reunited as a family once more, or so she claimed.\n\nThe following night, Hermione and Hiram attended Retro Night at Pop's in support of Veronica and her cause to keep the shoppe from closing. With the night being a new beginning for Pop's, Veronica suggested that maybe the night can be a new beginning for them as well. However, she asked for total transparency in return. In the spirit of that, Hiram proposed that Lodge Industries make a \"charitable contribution\" to the diner.\n\nAfter a show of appreciation from Pop Tate, in which he thanked the Lodges for their generous contribution, Hermione remarked that she didn't know they were in the charity business. Hiram, however, revealed that, as of five minutes ago, he had secretly bought the diner from Pop. In exchange for his silence, Hiram told Pop that he can stay on as manager. It was nice to have Hiram back, Hermione stated. He then thanked her for having lied to Veronica about writing that letter that he really did write, knowing that Veronica never would've forgiven him had she learned that he threatened her. Hiram complimented Hermione on her loyalty, which he has concluded \"knows no bounds\".\n\nHermione, Hiram, and Veronica, return to the Pembrooke, where they are greeted at the door by their new doorman, Andre, who had replaced Smithers due to his mother falling ill over seas.[17]\n\nAs Hermione neared Hiram's study with his morning coffee, she was approached by Veronica, who offered to take the coffee in herself as she had something that she wished to discuss with him. However, Hermione declined her offer, stating that she and Hiram had issues of their own to discuss, not to mention that Veronica wasn't allowed in her father's study. Veronica replied that those were the old rules — but rules which still applied, Hermione retorted. Hiram then joined them in the main room, during which time Veronica asked if her friends could come over for the season premiere of the Matchlerette.\n\nOn their way to dinner at the club later that night, Hermione and Hiram passed through the living room to greet Veronica's friends. However, they couldn't help but overhear the discussion the teens were having, where they showed great frustration with Sheriff Keller and his inability to catch the killer. Being a man that has had his fair share of run-ins with the law, Hiram offered them a word of advice; he could say with confidence that the police aren't always the solution. Sometimes they needed to stand up and protect themselves. On that note, Hermione decided to cut Hiram's speech short, telling him that if they didn't leave in that moment, that they would lose their seats. Then, before heading out the door, Hiram unexpectedly invited Archie over for dinner later in the week as he looked forward to seeing what he came up with to saving Riverdale.\n\nThe following morning, Hermione advised Veronica against pursuing the dinner with Archie. While it may not have been Veronica who extended the invitation, Hiram's actions stemmed from his desire to please her. Veronica, on the other hand, simply wanted her father's approval. She hoped for everything to change overnight, and for him to be friends with her friend. While one day her friends will be in a great place with her father, it was a working process, not something to be rushed.\n\nHermione joined Veronica in the dining room as she cleaned the silverware in preparation for her upcoming dinner with Archie. She warned her daughter that she was playing with fire, and that she should be more cautious when doing so. While Veronica's agenda may have consisted of the family getting to know Archie over a civilized dinner, Hermione wasn't too convinced that this was Hiram's agenda. However, from Veronica's perspective, Hermione was the only one failing to put forth an effort. What do you think daddy is going to do to Archie, Veronica asked. She was tired of the veiled threats, telling Hermione to admit that Hiram was dangerous or to otherwise drop it as they were to never have the conversation again. Hermione, unfortunately, stood there quietly as Veronica reminded her that she was responsible for welcoming Hiram back into their lives.\n\nWhile getting prepared for another evening out with Hiram, Hermione asked if he could zip up the back of her dress, which he does, but not without informing her that sound carries within apartment. He could hear her and Veronica in the dining room earlier that day even in his study with the door closed. Hiram told Hermione if she wanted to burn down her relationship with Veronica, that was her choice, but attempting to turn Veronica against him was unacceptable.\n\nAs planned, Archie came over for dinner, during which time he complimented Hermione on her well-prepared meal. They briefly discussed how Archie saved Ethel Muggs the prior night. Unfortunately, the individual stalking her got away. Admittedly, they needed to increase their response time. Hiram understood Archie's need to be ahead of the threat. After Hermione and Hiram exchanged looks from across the table, which went unnoticed by Archie and Veronica, Hiram asked Archie if he's ever had rum, then inviting him into the study to have a drink from the signature Lodge family label. Veronica mistook this as an invitation to join them, however, Hiram asked that she stay behind, providing him and Archie with the opportunity to talk man-to-man. Poor little princess, Hermione commented as she finished off the remaining of her drink. The king will always keep her at arm's length. She'll never be allowed in his private throne room.\n\nThe following morning, as Hermione brought Hiram his morning coffee, Veronica announced that she wanted a more active role in Lodge Industries considering that she was a shareholder. Hiram reminded Veronica that this was merely an honorary title, which is why Veronica suggested that they make it a legitimate title. She wanted to get her hands dirty and be in the room where it all happened. Much to Hermione's surprise, Hiram agreed that as a Lodge, it was Veronica's right to be more involved in the family business.[18]\n\nWith the Black Hood's presence growing in Riverdale, Archie took it upon himself to send a message to the killer. Now, with the Red Circle's public message to the Black Hood sending the town in an uproar, Hermione and Hiram questioned Veronica on her involvement with the Circle's video, though she didn't seem to think it was as serious as they were making it out to be. Hermione explained that it was a video threatening violence, which in turn made Archie dangerous in the eyes of her and Hiram, though Hermione took her stance on the matter a step further by forbidding Veronica from seeing Archie any longer. However, Veronica had no intentions of breaking off her relationship with Archie without first getting his side of the story. Once Veronica was out the room, a grin formed on Hiram's face, leaving Hermione to wonder what he was smiling about. Hiram explained that between the Black hood, the Red Circle, and the Town Hall meeting, there was so much chaos and confusion taking place.\n\nThe next day, after Veronica returned home from school, Hermione commented on her t-shirt that was in support of the Red Circle. She asked Veronica if she would still be wearing it when Archie's arrested for reckless endangerment or something worse. Veronica didn't believe that it would ever come to this. Archie was being railroaded, she claimed. And you can say that, with absolute certainty, after watching that video, Hermione asked. She began to question the extent of Veronica's adherence, then offering her a word of advice in regards to loyalty. There was nothing more honorable and noble than it. But blind loyalty was both stupid and dangerous. Hemione prayed that this wasn't the case with Veronica and Archie.\n\nLater that night, she and Hiram attended the Town Hall meeting, where Mayor McCoy welcomed all in attendance. While the meeting started out peaceful and civilized, it quickly escalated, turning into a shouting match between two divided sides, with one side being led by Alice, who believed the south side was responsible for everything wrong with Riverdale, and the other side being led by Fred, who believed that this was a time where they needed to unite rather than fraction off because only then would they truly be defeated. Hermione had told Hiram that Fred was going to be a problem, though Hiram wasn't quite sure of this being true. The town loved and trusted Fred. It could work in their favor. Moments later, Betty and Jughead entered through the back doors to alert everyone that the Black Hood was on his way to the Town Hall, where the cipher claimed he would strike next. Hermione and Hiram presumably evacuated the building with everyone else.[19]\n\nOpen House\n\nHermione sat on the desk in Hiram's study, reading aloud to both him and Veronica, the latest published article from the Register, which addressed the rise in crime in Riverdale, more specifically the stabbing of Northside teen, Dilton Doiley. The recent incident confirmed that the real threat wasn't the Black Hood, rather the Southside and its corruptive forces. The article, which was written by Alice, accused Hiram of wanting to profit off of Riverdale's misfortunes, instead of fixing them. To make matters worse, all this was occurring just before their open house. Hiram told Hermione that they couldn't allow anything to derail the SoDale project, that included Alice, the southside gangs (Southside Serpents and Ghoulies), and the Black Hood. Their biggest problem at the moment, was capital. They were running out of it at a fast rate, Hermione explained. Fortunately, Hiram had invited potential investors to the open house, the St. Clair's, to be exact. They were coming up from New York. Veronica was delighted to hear that her old friend, Nick St. Clair, would be coming up with them for the opening. If they could get the St. Clair's to invest, then others would surely follow. Hermione recalled Veronica wanting a seat at the table, and with Nick having his father's ear, she hoped that Veronica could help them close the deal by showing Nick all that Riverdale had to offer.\n\nA few days later, Hermione and Hiram arrived at the opening, arm-in-arm, greeting guests as they proceeded down the aisle. If the successful turn out of the open house didn't convince the St. Clair's to invest, Hermione remarked that she didn't know what would. Moments later, they spotted Veronica, before calling her over to see how things were going with Nick. From all reports, Veronica's charm offensive was paying off. As the St. Clair's arrived, Hermione decided it was time to wrangle up Fred. She told him that the entire point of the open house was to socialize, though he figured he'd leave it to Hermione and Hiram, the professionals. However, Fred wasn't without his charms, Hermione noted. She and Hiram were glad that he was back at work, and would appreciate it if he joined them on stage. She commented that he might as well, considering he built it. However, their discussion was cut short by Alice's sudden arrival in a red snake print dress and a matching gold snake necklace.\n\nHermione, Fred, and Hiram got on stage to make an announcement as the hosts of the event. Hiram announced that a new story began in Riverdale that night. A story about reinvention and aspiration. The building would be the first chapter of that story. Luxury apartments, shopping, and even a golf course. The Southside as they knew it would be gone, replaced with a new Eden. So, they raised their glasses to a brighter tomorrow. But for that day, they would celebrate with a little music from Josie and the Pussycats.[20]\n\nDealing with the St. Clairs\n\nHermione and Hiram set up a meeting with Penelope Blossom pertaining Cheryl's incident with Nick St. Clair at the Open house. Even though Penelope appreciated them calling her after Cheryl had told them, she still wished that they stopped her from talking to the Sheriff. She was skeptical of Cheryl's act of damsel in distress and wasn't convinced that Cheryl was completely innocent, so she concluded that Cheryl had to have provoked him somehow. However, Hermione stated that per Veronica's explanation, Cheryl was innocent in the matter. Penelope then told them that she wanted the situation to be handled discreetly. Exchanging looks with Hermione, Hiram agreed, also sure the St. Clairs felt the same way. Ending the meeting, Penelope said she'd handle the Sheriff and inform him that they wouldn't be pressing charges, because after all, nothing really happened to Cheryl.\n\nHermione and Hiram attended the meeting that Alice decided to set to deal with what happened at Nick St. Clair's party. All the parents along with their children attended. Alice quickly judged the party as a \"bacchanal\", pointing out that only her Betty was smart enough not to use drugs. Hiram Lodge immediately replied to Alice's harsh insinuations about those who used Jingle Jangle, suggesting her to be careful at throwing stones by recalling her mugshot Betty recently printed on the newspaper's front page. When Hermione demanded to know who brought the Jingle Jangle to the party, Reggie Mantle confessed that he brought the drugs that he acquired from a dealer on the Southside, who he suspected of being a Southside serpent. While they admittedly shouldn't have taken the Jingle Jangle, Veronica pointed out that Nick asked for it, and later pressured them into taking it. Furthermore, he attacked Cheryl. If anyone should be under interrogation, they believed it to be him. However, as Sheriff Keller explained, prosecuting Nick would be difficult given that they were all unreliable witnesses due to the fact that they were high. When Veronica retorted that when Josie and herself witnessed the incident with Nick and Cheryl, they weren't on drugs, Sheriff explained that Jingle Jangle stayed in one's system for up to three days. Unfortunately, it had only been one day since the open house, so this would raise a credibility issue in court. Josie's mother was appalled to learn that she too had participated in taking Jingle Jangle despite knowing how her father struggled with addiction. This triggered Mayor McCoy to take harsh measures, much to Alice's complacency to see the Southside blamed for it and actions taken to prevent further crime coming to the Northside.\n\nHermione and Hiram were playing chess in the living room, when Veronica entered, confronting her parents upon hearing from Cheryl that they were still doing business with the St. Clairs and letting them invest in the SoDale project, who paid Penelope to stay quiet about the incident. Hiram tried to retort that Cheryl's accusations were not strong enough as she didn't have any physical evidence to support her claim. Trying to corroborate Cheryl's claim, Veronica decided to confess that Nick tried to do the same to her. Upon hearing this, her parents' attitude toward the situation changed from a dismissive to a protective one, vowing to not take a single penny from them ever again.\n\nLater, as Veronica, Hiram and Hermione sat in the living room, they received a call. Hermione picked up the phone, getting news from Andre that the St. Clair's got into a car accident; Nick would gradually recover, with time, but Xander and Simone St. Clair's status was currently unknown. \"Oh, well. Karma's a bitch\", Veronica said, as Hermione and Hiram continued playing chess.[21]\n\nA Letter from the Black Hood\n\nHermione and Hiram called Sheriff Keller over to investigate after receiving a threatening letter from someone claiming to be the Black Hood. As the Sheriff was leaving, Veronica returned home. They informed her of the letter, and how it said that they would be targeted and punished for their sinful ways. Hermione and Hiram didn't express much concern given that dozens of households received the exact same letter, though Veronica was terrified by the letter considering that they were actually sinners. However, Hermione and Hiram explained that they would be fine considering that the Pembrooke was a fortress and Andre was trained in martial arts. Regarding Veronica's every day activities, such as going to school and shopping, Andre would drive her, and when he wasn't available, they'd hire a car service. After talking it over, Hermione and Hiram decided that they wouldn't mind seeing more of Archie since he was brawny and devoted to Veronica.\n\nThe next day, while at the breakfast table, Hiram and Hermione learned from Veronica that Archie had said that he loved her, though she didn't say it back as she felt it was too soon. It didn't matter what Archie said or didn't say, it was about whether or not Veronica was ready to here it, Hiram and Hermione stated.\n\nA few days later, as Veronica prepared to leave for FP's retirement party, Hermione stopped by her room to check on her and to see how her relationship with Archie was progressing ever since he professed his love for her. Veronica explained that they had been working on a side project, which she realized was just an attempt by herself to avoid talking about the love that dares not speak its name. Veronica wondered why she couldn't say it back and why it had to be such a big deal. She pointed out that Hermione and Hiram never say that they love each other. It was then that Veronica realized that in her entire life, she'd never heard her parents say that they loved one another.[22]\n\nThe Family Business\n\nIn the days leading up to Christmas, the Lodges ate dinner as a family, during which time Hermione asked about the Spiffany's bag she saw Hiram come in with earlier that day. It looked about the right size for a Glamerge egg, she added. That depends on whether she's been naughty or nice this year, Hiram replied. Hiram then assured Veronica that he had her Christmas list as well. But he asked of her to refrain from snooping as she does every year. However, Veronica wasn't in the Christmas spirit. She was frustrated and she wanted Hermione and Hiram to take a look at themselves and realize how fortunate and wasteful they were, spending money on bejeweled eggs like they were a family of Russian oligarchs while there were people in Riverdale who couldn't even afford to pay their own bills, such as Fred Andrews, who Veronica learned from Archie was drowning in medical bills to the tune of $86,000. Which is why she was hoping that Hermione and Hiram would cover his expenses. Unfortunately, the Lodge Charitable Trust had made its donations for the fiscal year. Fred would have to tighten his belt, so to speak. However, as Veronica informed Hiram, Fred was already selling Christmas trees for extra money. That's the kind of father he was, Veronica surmised. Regardless, Hiram wished to hear no more on the matter, storming off to his study.\n\nThe following night, Hermione and Hiram returned to the Pembrooke from last minute Christmas shopping after receiving a call from the bank, confirming a charge that was made from her credit card, in the amount of $86,000. They realized that it was their daughter's doing and came home to confront Veronica, who had decided that they would in fact cover Fred's medical expenses considering that they had the money to buy Pop's and then lie to her face about it. Veronica asked how it was that they could afford an entire diner. Hiram addressed the fact that she wanted a more active role in Lodge Industries, which they gave to her. In response, she broke into his office and tried to use whatever she could find as leverage against them. While Hiram admitted that it was a lot Veronica didn't know, he explained to her that this was on purpose. Veronica questioned how she could be apart of the family if they continued to hide things from her. With her name being on all of the documents in Hiram's desk, Veronica insisted that she had the right to know the truth about everything. Hermione agreed that she had the right to know the truth. However, this would also mean that the time for being \"Daddy's little girl\" is over. It was time for all of them to work in lockstep. Hiram agreed, telling Veronica to follow him to the study.\n\nIn the study, Hermione and Hiram came clean to Veronica about everything involving their family's business. Veronica agreed to join them in running Lodge Industries, though she had one condition; she refused to do anything illegal. Which was fine considering that they were involved in any illegal activity either. When Veronica gave her a look, almost as if to say that she wasn't fooling anyone, Hermione shared with her two words to live by; plausible deniability. In regards to the charge that Veronica made towards Fred's medical bills, she wanted that to stick. While Hiram was initially against doing so as it would only further complicate matters, Hermione agreed to Veronica's demand, stating that they could smooth it over. Furthermore, they needed Fred for what would come next. Assuming that the Fred situation could be finessed, Veronica agreed to the deal with her parents.\n\nOn Christmas morning, the Lodges unwrapped their gifts, during which time, they informed Veronica that Archie had stopped by the day before to leave her a gift.[23]\n\nWith Christmas and the Black Hood behind them, Hermione and Hiram continued to have secret business meetings with Mayor McCoy at the Pembrooke. Hiram took her into his study as Veronica watched on. Hermione gave a wink to her, smiling. Veronica returned the gesture in kind.\n\nHermione and Hiram took a moment to check in on Veronica, wanting to make sure she's still on board with their \"plan\". Veronica assured them that she is. Hermione pressed further, indicating that once completed, she would be at ground zero, i.e. the eye of the potential hurricane. Their concern goes unwarranted but she's kept her classmates from revolting. With renewed faith, she nodded at her daughter and smiled at her husband.\n\nLater, at the Mayor's office, Hiram and Hermione discussed the closure of Southside High School. Sierra mused that her phone was about to start exploding with calls from outraged parents. Hermione attempted to quell Mayor McCoy's concerns, telling her that it would only be news for a couple of days then it would blow over. She referred her to how quick Riverdale had stopped talking about the Black Hood since he'd been stopped. Hiram piped up and assured her that as the town went back to normalcy, the Lodges would quietly go about purchasing the land beneath Southside High. With Mayor McCoy's assistance in closing down the school, Hermione reassured her that she'd get her commission, a sizable donation to her re-election campaign. With business completed, Sierra's phone began to light up with phone calls.\n\nThat night Hermione and Hiram invited Archie up for dinner. Veronica explained that she's established a welcoming committee to welcome the incoming Southside transfers. Archie pressed the closure of Southside being close to the SoDale project and assumed it's bad for business. Hiram corrected him, saying that drugs, gangs, and violence was in fact bad for business. Archie mentioned the St. Clairs, but Veronica told him that they were no longer investors. Hermione confirmed that they severed all ties with the family considering what had transpired between Nick and Cheryl; they didn't even call them after the accident. This news gained Archie's attention and so he asked what happened. Hiram claimed to not know what happened, that he either had a car accident driving back to Vail or on the slopes. Hermione reassured Archie that he'd recovered enough to be back at Greenwich Prep.\n\nThe next day, Hermione and Hiram had another talk with Veronica after a tumultuous week of Southside and Northside integration. They've learned some news from Mr. Weatherbee, relayed to them from Mayor McCoy, that integration of Southside High was not going well. She confessed that Reggie was just being Reggie, though gang ware, specifically the Serpent Jacket, had become a flashpoint. She suggested that looking the part would help quell the tension between them and proposed a charitable donation to help out the \"fashionably misguided\". Considering their options, Hermione and Hiram accepted her proposal.[24]\n\nAt the Andrews house, Hermione, Hiram and Veronica attended a meeting with Fred, Mayor McCoy and Sheriff Keller. The topic of discussion - the students who had been transferred to Riverdale High a week ago. While they were fine, their parents were in Mayor McCoy's office everyday to demand that she reopen Southside High. Which is why Hermione, Hiram and Fred had discussed how their new neighborhood could use something positive to focus on. With Mayor McCoy's blessing, they'd like to make Pickens Day a celebratory event. Sponsored by Lodge Industries with Andrews Construction co-sponsoring. Mayor McCoy took this to mean that they wanted to make Pickens Day a commercial event for the SoDale, similar to their open house, though as Veronica disagreed. She pointed out that the open house was for investors while Pickens Day would be for North and Southsiders alike. Two halves of a whole coming together. Mayor McCoy worried that trying to distract people with a party would backfire, resulting in violence. While the Southside Serpents had been laying low, they were wild cards and reasons for concern. Having prepared for just that scenario, Hermione, Hiram and Fred had offered to hire the Serpents as security for the event since FP had told Fred that the Serpents were looking for work. Furthermore, the party would let the Southside know that they haven't been abandoned. The meeting was then brought to an abrupt as Archie returned home.\n\nA couple days had passed since her meeting at Fred's house when Hermione learned from Veronica that Sierra was acting cold towards her, almost as if Veronica was a bad seed who was out to corrupt Josie. In hearing this, Hermione surmised that Sierra wasn't comfortable with how involved in the family business Veronica had recently become. She likely feared that Veronica would tell Josie something that she shouldn't know. Veronica insisted that she would never do anything that would compromise what they had planned, which Hermione knew to be true. In fact, should Sierra's coldness towards Veronica persist, Hermione would have a conversation with her.\n\nOn Pickens Day morning, at the breakfast table, Hermione noticed that Veronica was upset. She assumed that it was in relation the conflict between to Archie and Hiram, but in actuality, it was about Josie. The two of them got into a fight and Josie dropped out of their Pickens Day performance. With Sierra's coldness persisting, Hermione decided to take care of the situation. But Veronica asked that she not. Veronica recalled Hermione previously telling her that their family worked differently from others. So if Josie and Sierra didn't like the way they did business, that was on them. But the show must go on. With that, Veronica devised a plan to solve her dilemma.\n\nHermione greeted Sierra and Josie as they arrived at the Pickens Day celebration. She was surprised to see that they made it and sorry to hear that Josie wouldn't be performing with Veronica. Sierra explained that she had forbade Josie from performing following the publishing of Jughead's article because of the possible dangers she could face while possibly encountering outraged townsfolk.\n\nHermione and Hiram watched from the crowd as Veronica and the Pussycats performed on stage. Half way through their performance, the Serpents marched into the park as a protest with duct-tape covering their mouths and signs that read 'honor this land' and 'sacred land'. With Sweet Pea and Fogarty at her side, Toni, who seemingly led the protest, stood in front of the stage to announce that they represented the dead and the silenced. Pickens Day was a lie. General Pickens slaughtered the Uktena tribe, Toni's grandfather's family. And the land in which they were standing on, would soon give way to a new Southside, which was stolen from them. While the Serpents couldn't bring them back, they could at the very least honor them. Hoping to defuse the protest and resolve any conflict, Hiram got on stage to applaud the Serpents for standing up for justice, as well as the honor and legacy of the Uktena, who contribute to the rich tapestry that is Riverdale, that is the Southside and that will be SoDale.\n\nThe following morning, Hermione, Hiram, Mayor McCoy and Sheriff Keller headed down to Pickens Park after being alerted of the desecration of the General Pickens' statue. Its head had been removed and red paint covered the statue to simulate blood. Since Hiram and Hermione were calling the shots, Sierra asked how they would like it to be handled. Hiram replied that the investigation of the missing head should be handled swiftly and with extreme prejudice given that the most likely suspects were the Serpents.[25]\n\nAt the Pembrooke, Hermione and Terry sized Veronica for her dress in preparation for her confirmation ceremony.\n\nLater that day, a confirmation present from the St. Clairs arrived for Veronica, leaving her to question what would make them think that they had the right to send her a gift after everything that went down between them when they were in town. Hermione explained that it's what families that are in their line of business do. Even when they're at war. They give gifts to show respect Or, in this case, to try and make amends for the events that had transpired. Whatever the gift is, Veronica wanted no parts of it, telling her mother to burn or regift it. As she was leaving, Hermione told her that Simone St. Clair called to follow up on this gift and that during that call, she said that Archie paid Nick an unfriendly visit. Hermione asked Veronica if this was true. Which it was.\n\nThe next day, at the Pembrooke, Hermione and Veronica greeted Josie and Sierra, who stopped by to offer an apology after Pickens Day. Admittedly, Sierra had misgivings about some of the decisions that Hermione and Hiram were making which was wrong and inappropriate. Given the stressful times, neither Veronica nor Hermione held any grudges. In fact, as proof of this, Veronica invited them both to her confirmation. Sierra graciously accepted as this made giving them their gift that much easier. The aforementioned gift was Josie's offer to sing at Veronica's confirmation. While Veronica already had plans to sing herself, Hermione accepted Josie's offer for her so that they could perform a duet. When Veronica asked Josie if she knew the \"Bitter Sweet Symphony\" from the Cruel Intentions soundtrack, Josie told her that she could learn.\n\nThe following night, all the women got together at the Pembrooke for girl-talk. Veronica told her family that her confession with Monsignor Murphy didn't offer much piece in mind. Hoping to help, they shared their \"things\" which helped them get through the day and they advised Veronica to find her own. Tia then asked about Archie after seeing him a couple days before. Veronica told them that he was her boyfriend and that he would be attending the ceremony. Archie was a local boy and he was as Hermione put it, \"inocente\", which is Spanish for innocent.\n\nThe very next day, Hermione sat alongside Hiram and his mother as Veronica's confirmation ceremony commenced with her and Josie singing a duet of \"Bitter Sweet Symphony\" from the Cruel Intentions soundtrack. She watched proudly as Veronica was anointed and confirmed by Monsignor Murphy. Afterward, during the post-ceremony celebration, Sierra told Hiram and Hermione that it was a beautiful service before handing them a deed. They were now the proud owners of what was previously Southside High. Later, the ladies took family photos together. As Veronica attempted to leave, Hermione pulled her back in for follow up pictures.\n\nThat night, after the party, Veronica received one last gift. She opened it to discover the head of General Pickens' statue. Realizing that it was actually for her parents, she called them over to deal with the head that was wrapped neatly in a box. [26]\n\nPicking up from where the previous episode left off, Hermione, Hiram and Veronica sat around the table where the head of General Pickens' statue was placed. Hiram interpreted the delivery of the head as a deceleration of war. Hermione stated that they always knew that they would have to go to war eventually. But of course, there was another option. Veronica reminded them that at Spence, she was Secretary General of the Model UN, and before declaring war, they'd always try to negotiate a settlement. So if she could broker a detente between the Contras and the Sandinistas, then Hiram could surely de-escalate relations with the Southside Serpents. This isn't high school, Hiram remarked. But as Veronica reminded him, cutting off the head of a statue was fairly immature. A remark that Hermione found humor in. Veronica offered to get them to the table while all he had to do is play nice.\n\nA couple days later, Hermione and Hiram got into a heated argument with Mayor McCoy over the Southside land development. As she exited the study, Sierra told them that she was fairly close to telling Jughead everything and that it would be a lot worse for them than it would be for her. With Veronica standing just outside the door, Hermione and Hiram explained to her that given exposé that Jughead was writing about them, they decided it was best to accelerate the timetable. So they told Sierra they might have to announce their plans for Southside High, but she refused and demanded that they wait until after she's reelected. Should they proceed without her, she threatened to expose them. If this wasn't handled properly, the whole town would be out for their blood. However, if they got Sierra out of the Mayor's office, under a cloud of scandal, the damage she could do to them would be minimized. They would go about doing that by revealing her affair with Sheriff Keller.\n\nThe next day, Hermione and Hiram watched as Sierra resigned from office over a live broadcast. She claimed that seeing them through a triumphant Jubilee and the terrors of the Black Hood killings had taken a personal toll. So she had decided to step down as Mayor, to spend more time with her family and to return to her own legal career right in Riverdale. Hermione and Hiram were surprised by Sierra's sudden decision to resign since they hadn't even made their play yet. Veronica told them that this was good news since now they don't have to. If they did, it would be cruel.\n\nLater that night, Hermione sent Andre to retrieve Archie following his admission to Hiram that the FBI had approached him three weeks ago to be an informant. Hermione stood at the edge of a cliff, where down below was a long and deadly drop to the ocean. Archie approached her under the impression that he was meeting \"the boss\" (i.e. Hiram). Much to his surprise, the person who Andre identified as the boss was Hermione. Do you know what \"Omertà\" is, she asked Archie. It's their code of silence. It states there is no worse, no more cowardly crime than snitching. Archie assured her that he would never do anything to betray her family. Which he'd unknowingly proven to her in those last few weeks. She and Hiram, unbeknownst to Veronica, enlisted one of their closest associates to approach Archie and say that he was an FBI agent investigating Hiram. Agent Adams isn't real. He worked for Hermione as one of her Capos. She asked him to apply a lot of pressure to Archie by threatening his father to see if he would crack. It was all a test, which Archie passed. With that, Hermione welcomed him to the family.[27]\n\nHermione and Hiram invited Fred and Archie over for dinner at the Pembrooke where Hermione, Hiram and Fred told stories from their youth when they apparently broke into Thornhill for a swim and stole the school's van. However, according to Hermione, it wasn't her and Mary who stole the van for a joyride, rather it was Alice. She and Hiram then invited Fred into the study where they proposed that he run for Mayor.\n\nWith the odds of Fred saying yes being at about 50-50, the next morning at the breakfast table, Hermione suggested that Veronica influence Archie into convincing Fred to run for Mayor. While reluctant, Veronica agreed to her parents' request.\n\nHermione and Hiram watched Veronica get shut down by Archie as she called him the next day after doing some research. Apparently, Fred needed 12,000 signatures before he could even run for Mayor. And so Veronica was thinking that the two of them could collect the signatures together. However, Archie blew her off, claiming that he had homework to do before hanging up.\n\nThe following morning, Hermione learned from Veronica that while she was willing to do the family's bidding at school, Archie was off the table as she was afraid of losing him. He had become a pawn on their chessboard and it was hurting her relationship with him. However, as Hermione explained, the women always walked the razor's edge. The men were the gangsters, but the molls, they used their wiles and cunning, such as a hand on an elbow or a whisper in an ear to manage things from behind the scenes. While this was the case for most, Veronica refused to take part. And so Hermione conceded.\n\nHermione, Hiram and Veronica learned from Pop Tate that Jughead was asking questions about the ownership of Pop's Chock'lit Shoppe, meaning that there was someone in their inner circle feeding him information. However, the only people that knew about the secret purchasing of Pop's were the three of them and Archie, leaving them to believe that Archie was the mole. Although, Veronica confessed to telling Jughead about them secretly buying Pop's in order to get him off their trail. She explained that Jughead was grilling her about SoDale, Southside High and Sunnyside Trailer Park while they were at Shadow Lake. Hoping to throw him off, Veronica distracted Jughead with the smallest truth she could, or so she claimed. While Hiram was enraged, Hermione claimed it was quick thinking. She agreed with Veronica's decision to feed Jughead a little bit of information in order to keep him from learning a lot more. Her gambit bought them the time that they needed for some preemptive damage control.\n\nThe next day, the Lodges learned from warden Jeffries at Shankshaw prison that Jughead and FP paid a visit to an inmate, one of FP's well informed cronies. They suspected that the Jughead and FP had learned everything regarding Hiram's plans for the Southside, meaning that it was only a matter of time before it made the papers. With their hands being forced, the Lodges called Fred and Archie over to inform them of the master plan before Jughead could break the story. They revealed that their plans for Riverdale entailed turning Southside High into a private, for profit prison. As for SoDale, it was intended to be housing for the employees of the prison. Unfortunately, Fred refused to support their plan. He called Archie over as they were preparing to leave. However, much to their surprise, Archie decided to stay as he wanted to hear their proposal out.\n\nLater that day, outside Town Hall, the Lodges held a press conference where they announced that Hermione would be running for Mayor. Hermione went on to give a brief campaign speech as the crowd applauded. \"Thank you, Veronica, and thank you all very much. Like many of you, I grew up in this town dreaming of a better tomorrow. For myself, for my family and for my friends. And now, for the future that you all so deserve. Riverdale is one of the most dynamic, resilient communities. {...} Riverdale cannot succeed unless all of us succeed and that will require certain sacrifices. {...} We will also need your support. We will need your trust. We will need your loyalty. {...} This town has endured so much these past few years. After so much adversity, aren't we all ready for a taste of prosperity?\"[28]\n\nHermione sat down for an interview with Hal Cooper at the Pembrooke for their Register readers. She was kind enough to also allow Veronica and Kevin to sit-in. When Hal asked why she chose to run for Mayor of Riverdale, Hermione explained that she hoped to fix the yearly decrease in population and business closings. That is why Lodge Industries had secured a bid for a maximum security prison on the Southside. That meant jobs, economic growth and stability. It'll give Riverdale its future back. After they discussed building the prison on the bones of Southside High and whether or not Veronica would be running for student council president at Riverdale High, Andy Cohen, a family friend, came to give his endorsement of Hermione. Moving onto official business, the campaign wouldn't be easy, especially since they had to lead with her Hiram's plans for the prison. Certain people would see them as the enemy. So after the endorsement, they needed to keep their heads down.\n\nHermione and Hiram confronted Veronica the following morning after learning that she had punched Reggie Mantle in the face a school. Veronica apologized for stepping out of line, though she was suddenly determined to get Ethel Muggs' father a job at the prison to make amends. However, they refused to oblige her request and demanded that she keep her head buried in the sand, so to speak.\n\nAt Andrews Construction, Hermione was surprised to learn that Fred wanted out of his contract with SoDale. He was hoping for a clean break, however, they would inevitably have to get their lawyers involved.\n\nThe following evening, Hermione and Hiram discussed their contract with Fred and his lawyer, Mary, who had just returned to Riverdale per his request. Mary claimed the contract was exploitative and that Fred should be immediately released and compensated.\n\nHermione confronted Veronica as she walked through the front door from school after learning that Veronica had gone against her wishes to lay low by running for student council president. To make matters worse, there was a flyer going around school, exposing Veronica for all her lies. This was precisely why they asked that she keep a low profile. Veronica explained that she was out there every day, facing what they all had done. And maybe, if she was their President, her friends would stop looking at her like she's just the daughter of criminals. Essentially, she needed something she could use as a shield against everything that was coming their way. Protection from everybody out there who hated them and was out for their blood.[29]\n\nHermione and Hiram attended the school hall meeting at Veronica's school, where she and Archie squared off against Jughead, Betty, Reggie and Josie. Afterward, Hermione and Hiram exchanged words with Fred and Mary in the halls as Archie and Veronica played peacemakers. All of Riverdale was buzzing about Fred's decision to run against Hermione for Mayor. When Mary pointed out that they were still waiting for Hiram to sign the papers to release Fred from his contract to Lodge Industries, Hermione countered that they were still waiting for Mary and Fred to sign the NDA that they had sent over.\n\nHermione, Hiram, Veronica and Archie returned to the Pembrooke where they were greeted by Andre and Adams. In the lobby was Lenny Kowalski and Carl Martin. Two mob bosses who requested to speak with Hiram privately.\n\nA couple days later, Andre was attacked in the lobby of the Pembrooke. Archie managed to unmasked the hooded assailant. In doing so he discovered that Andre's attacker was Adams. He had apparently double-crossed the Lodges. Adams then overpowered Archie and told him to tell Hiram to take Kowalski and Martin's deal. Archie relaid this message to the Lodges who weren't pleased with these latest developments. They concluded that Kowalski and Martin either offered Adams money or he sensed that they were weak and vulnerable. The message being sent was clear, either cut Kowalski and Martin in or suffer the consequences. With them being essentially unprotected, Archie offered to keep watch on the lobby. However, that was only a short-term solution to a long-term problem which Hiram had no answer for. As for the time being, they would circle the wagon. Any campaigning that Hermione needed to do would be done from the Pembrooke and Veronica was only ever to be at home or school, and Archie was to see her to and fro.\n\nLater that week, Hermione, Hiram and Veronica arranged a surprise for Archie. They met him outside of Pop's Chock'lit Shoppe with a brand new car that they had purchased for him. Archie was shocked and couldn't except such an amazing gift but they insisted that he take it, especially since he would have to continue his duty of escorting Veronica to and from school. While Veronica started up the car, Hiram pulled Archie to the side to talk about their enemies and Archie blowing up their car as a short-term solution.[30]\n\nAt the Pembrooke, Hermione asked Hiram if Fred had a shot at winning the election. In their favor, he's essentially running on a platform of family values with none of his family by his side. Luckily for them, Mary returned to Chicago. As for Archie, he and Fred have never been more distant, and Hiram planned to keep it that way.\n\nAfter learning from Veronica that Archie was hiding Firebird, the car they had bought him, in the Pembrooke garage out of fear of how Fred would react, Hiram told Hermione that he had come up with a wicked idea to further strain their relationship. An idea that would later prove unsuccessful.\n\nOpening night of Carrie: The Musical, Hermione arrived at the play, greeting those in attendance as she passed out buttons for her campaign.[31]\n\nThe town gathers for Midge's funeral to pay respect. Cheryl sings a song in Midge's honor. She and the rest of the River Vixens are dressed in all-black cheerleader uniform. Midge's death has seemingly taken a great toll on Riverdale, Mrs. Klump and Moose especially. Hermione stands alongside Hiram and Veronica as the service commences.\n\nAt the Pembrooke the following day, Hermione announces that she will be going door-to-door to ensure the residents of Riverdale that Lodges are for safety first, unlike Sheriff Keller. Hiram and Hermione then look to Veronica for assistance in one particular objective involving Cheryl given that she and Veronica are friends and that Cheryl seemed particularly devastated over Midge's death. However, Veronica wants no part of whatever schemes they're cooking up.\n\nHermione pays Cheryl an unexpected visit at Thistlehouse. Cheryl invites her in nonetheless. Hermione claims that she was moved by Cheryl's speech at Midge's funeral. Cheryl replies that it came from the core of her bosom as it is an absolute travesty what happened to Midge. If only Riverdale had more competent law enforcement. Which brings Hermione to her point. She is right in the middle of writing an editorial calling for Sheriff Keller's head, and seeing Cheryl's passion in the subject, Hermione thought that maybe Cheryl would be willing to write an op-ed. \"Say no more\". Cheryl replies.\n\nAt the Pembrooke, Hermione and Hiram celebrate a small victory after she managed to recruit Cheryl herself. Veronica then gets a call from Nick St. Clair who has kidnapped Archie and is holding him for ransom. $1 million to be precise. Unfortunately, they refuse to pay Archie's ransom because Hiram won't be cowing down to who he describes as being a teen terrorist. With that, Veronica decides to call the police, but Hermione and Hiram warn her against it. The St. Clairs are a mob family with ties to the underworld. This entire time, Veronica was under the impression that they were only music producers. Now that she knows the truth, involving the police puts themselves at risk. Which i likely why Nick was so brazen and not even bothering to hide his identity. They ask Veronica to be patient but she can't. Not with all the terrible things Nick could be doing to Archie, like cutting his ear off. When Veronica leaves the room, Hiram tells Hermione that Archie isn't their blood. If they pay his ransom, it shows that they're vulnerable. And if that happens, Veronica will be targeted.\n\nHermione and Hiram return home to find Veronica standing over a large sum of money. Veronica explains it's ransom money from when she turned the tables on Nick and held him for ransom instead. His parents gave Veronica $1 million for her troubles. Hiram tells Veronica that he was dealing with it, but the thing is that the St. Clairs hadn't heard a thing about Archie's kidnapping. But Veronica leaves that up to her father to explain to Archie.[32]\n\nHermione waits in the dinning room with all five of Veronica's suitors from the mob families. Hermione informs Veronica that they've come to pay their respect. While she is eager to hear their proposals, Veronica has to get to school. Hermione isn't pleased with Veronica putting off such an important matter, but Veronica has her own way of doing things.\n\nBack at the Pembrooke, Hermione and Hiram discuss the Mayoral election. Hermione and Fred are neck-and-neck. And with the town divided over their prison, the debate is the single most important event of the election. While they already control the Sheriff Station and the Register, they need the mayor's office as well so that the prison can't be blocked. Hiram's counting on Archie's Dark Circle to cause unrest within the community. If Fred can't control his own son, then he certainly can't control a town on the verge of sliding into chaos.\n\nHermione and Hiram make their way over to the Andrews house after learning that Fred got a letter from the Black Hood. Prank or not, Hiram, Hermione and Archie want to cancel the debate, but Fred wants to go on. He asks if Sheriff Minetta can tighten security at Town Hall, which he can. Fred explains that the town is scared, but they need to show that they can't be cowed. If Fred wants to do it, then so does Hermione.\n\nThe night of the Mayoral debate has arrived. To Hermione's right stands Hiram and Veronica. Jumping right into the debate, fear and unrest rule the streets, so Alice asks how Hermione plans to restore safety to the town. Hermione claims that they're already making strides. She and Hiram personally recruited Sheriff Minetta from Centerville after Tom Keller resigned. Not one week on the job, and he's supposedly apprehended Midge Klump's murderer. Fred argues that they don't actually know that Fangs is the killer. He makes a point to not call for blood until they've had a trial. Regarding his comment about calling for blood, Hermione enlightens him about the Dark Circle, who she refers to as a dangerous, radical group that traffics in terror, violence and street warfare. This group, she points out, was started by Archie. Hermione adds that they can't trust Fred to run a town when he can't even keep his own house in order. Veronica then spots the Black Hood on the balcony with a rifle. As the Black Hood shoots from the balcony, Hermione, Hiram and Veronica hide behind their podium.\n\nThe Lodges return to the Pembrooke. Hermione is shaken up. She can hardly hold her glass still. Veronica notices this. Hermione insists that she's fine however. Veronica understands that she wants to be strong for the campaign, but if tonight was any indication of what's to come, then maybe she should drop put of the race. Hiram refuses to allow that to happen. They've worked too hard on their plans. They can't quit when they're so close. Veronica reminds him that they were shot at, but Hermione agrees with Hiram that the plan must move forward. The campaign is bigger than her. She assures Veronica that she'll be fine. Veronica explains that Hiram is willing to put Hermione's life at risk all for his plan. Hiram demands respect from Veronica, but she questions where was her respect when he asked her to entertain the sons of his enemies or the respect that he showed her when she explained that she worked everything out with the casinos, only for him to brush her off. Regardless, Veronica's done the work and plans to go along with the casino plans on her own. Little does she know that Hiram has already put her the money that she got from Nick's ransom in a trust that she won't be able to touch until she's 21.[33]\n\nHiram gets a call from Andre that he's picked Veronica up from the Andrews house and that he's bringing her directly home. Now that Hermione and Hiram know that Veronica is safe, one of Minetta's deputy's will take Hermione over to the Register so that she can make her announcement. They're taking an huge gamble, which concerns Hermione as there will be no way of controlling what will follow. Hiram counters that chaos works in their favor. They have the pieces in place to restore safety and order when Fred doesn't. Andre will also keep watch over Veronica. When Hiram says that he'll be out with another deputy, Hermione asks if he's keeping anything from her. He tells Hermione that now is not the time to start doubting him, before giving her a kiss.\n\nHermione meets with Alice at the Register to make her announcement, a $1,000,000 reward for anyone who can capture the Black Hood, dead or alive. As a mayoral candidate, Hermione feels it's important to take charge in times of crisis. Like the riot, which she believes was brought about by the actions of the Black Hood. She offers a bounty in hopes that it will calm the storm. Betty disagrees with the notion that a bounty will solve their problem. Furthermore, she questions if it's even legal. Hermione reminds Betty that the Black Hood is an active shooter on the streets of Riverdale. He even tried to kill Fangs outside the Sheriff's Station. However, Betty assures Hermione that the Black Hood wasn't responsible for shooting Fangs as no one actually saw him outside the station. As Betty continues, Alice questions her sudden urge to act so protective of the Black Hood. Before she can respond, Cheryl calls with a lead as she continues to track the Black Hood. He's exited the forest and headed for the houses beyond the pines. Maybe even Betty's house. With that being said, Cheryl warns Betty against going in the house alone. However, Betty has to find her father before anyone else does given Hermione's bounty.\n\nWhile discussing the bounty with Sheriff Minetta, Hermione is confronted at the station by Veronica. The two of them return to the Pembrooke, where Veronica questions where her father got the $1,000,000 to pay for the bounty. Hermione claims that Hiram has secret funds, but Veronica isn't buying it. She's convinced that her father intends to use her ransom money from the St. Clairs to pay the bounty. Hermione assures Veronica that this isn't the case as Hiram has put the money in a trust fund. Still, Veronica doesn't believe a word from her mother's mouth. So, she goes into her father's study and locks the door behind her. She then goes looking through Hiram's drawers for evidence of his misleading.\n\nVeronica shows Hermione the \"October Surprise\" file that she found in Hiram's office. He has already written a story about Hermione and Fred's affair. Veronica surmises that Hiram's plan was to publish the article in the Register, dragging both Hermione and Fred. However, as Hermione points out, Fred's running his camping on family values while Hermione's the law and order candidate. She explains that Hiram believes that the October Surprise will hurt her, but destroy Fred's chances of winning far more. Veronica realizes that her mother was in on the plan. Hermione tells her that it's all part of the game plan. What kind of man would do this to his own wife, Veronica questions. She accuses her father of being the kind of man who always has someone else to take the risk, to stand in the line of fire, to run for Mayor, for example. Hermione is nothing more than a means to an end to Hiram, Veronica states. Hermione disagrees, claiming that Hiram would never put them in harm's way.\n\nHermione and Veronica continue to argue. Hermione claims that Veronica has lost her nerve. Veronica counters that Hermione (and Hiram) have lost their minds. October Surprise wouldn't just destroy Fred's campaign, it would ruin his life. Small Fry knocks at the door repeatedly before kicking it down completely and proceeding further into the apartment. He introduces himself as the son of Poppa Poutine. His father told him that if he was to ever be murdered, not to take the life of the man who killed him i.e. Hiram, but to take the lives of the people that man loved the most. Realizing that Small Fry has come to kill them, Hermione and Veronica run into the study, where Hermione grabs a gun and shoots Small Fry multiple times and kills him.\n\nWhen Hiram returns to the Pembrooke, Hermione tells him that along with Andre's body, there's another one in the study. With all this being his mess, Veronica tells him that he has to clean it up.\n\nHiram informs Hermione and Veronica that Sheriff Minetta delivered Andre and Small Fry's bodies to the coroner's office and tagged them as riot victims, so no one's going to be asking any questions. Hiram is sorry for the ordeal they had to withstand. Veronica takes this opportunity to reveal that she found Hiram's \"October Surprise\" file. Hiram tries to cover for himself, claiming that Hermione understands the cost of winning better than anyone. Veronica explains that she realized something. There will always be an October Surprise with her father. While her mother may volunteer to be his collateral damage, she won't. Hiram reminds Veronica to never lose sight of the bigger picture, but Veronica insists that she isn't the one who lost sight.[34]\n\nHermione and Hiram are confronted by Veronica after she learned about Hiram's meeting with Penelope and Claudius Blossom. Hiram claims that he's looking to diversify Lodge Industries' holdings by possibly getting into the maple trade. However, Veronica suspects that her father enlisted in Claudius to impersonate the Black Hood and have him shoot up the town hall debate. Hermione interjects, telling Veronica that she's out of line. While Hiram suspects that Veronica's imagination may be getting the better of her, Veronica counters that none of them can deny the possibility that Hiram would put Hermione in harm's way in order to accomplish his own personal/political agenda.\n\nHermione admits to Veronica that it is entirely conceivable that Hiram orchestrated the attack at town hall, and it made her think that Veronica should at least have a contingency in place. There is a bit of leverage that, should Veronica acquire it, would give her power over her father. Hiram's plans for the Southside go far beyond the prison. He wants to consolidate the entire area into something. But there's one critical piece of the Southside that he doesn't own yet, that's keeping his takeover from being complete, the Whyte Wyrm. Though, he's in the middle of negotiations with the proprietor. However, Veronica will need money to block him. Veronica gains that money by contacting attorney McCoy and strong-arming Hiram into giving the money back as Hermione watches from the doorway.\n\nLater that week, both the mayoral election and student body election are held in the gymnasium of Riverdale High. Hermione and Fred greet voters as they approach the booths. That night, Hermione learns that she has won the election. She then heads over to the Andrews house to tell Fred that he ran a great campaign. It was close. It came down to less than 200 votes. As a show of good sportsmanship, Hermione and Fred shake hands.[35]", "images": ["https://vignette.wikia.nocookie.net/riverdalearchie/images/6/66/RD-Caps-3x04-The-Midnight-Club-62-Teen-Alice-Teen-Fred-Teen-FP-Teen-Sierra-Teen-Penelope-Teen-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20181111202723", "https://vignette.wikia.nocookie.net/riverdalearchie/images/e/e6/RD-Caps-2x15-There-Will-Be-Blood-27-Hiram-Hermione.png/revision/latest/scale-to-width-down/250?cb=20180315151012", "https://vignette.wikia.nocookie.net/riverdalearchie/images/0/09/Riverdale_symbol.png/revision/latest/scale-to-width-down/50?cb=20190318222900", "https://vignette.wikia.nocookie.net/riverdalearchie/images/e/e7/RD-Caps-2x04-The-Town-That-Dreaded-Sundown-100-Hiram-Hermione.png/revision/latest/scale-to-width-down/250?cb=20171102183506", "https://vignette.wikia.nocookie.net/riverdalearchie/images/2/28/RD-Caps-2x21-Judgment-Night-44-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20180512170240", "https://vignette.wikia.nocookie.net/riverdalearchie/images/d/dc/RD-Caps-2x21-Judgment-Night-97-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20180512172319", "https://vignette.wikia.nocookie.net/riverdalearchie/images/d/d4/RD-Caps-4x14-How-to-Get-Away-with-Murder-24-Hermione-Hiram-Hermosa.png/revision/latest/scale-to-width-down/250?cb=20200227180525", "https://vignette.wikia.nocookie.net/riverdalearchie/images/8/89/Season_1_Episode_4_The_Last_Picture_Show_Hermione_with_bag_of_money.png/revision/latest/scale-to-width-down/250?cb=20170312181929", "https://vignette.wikia.nocookie.net/riverdalearchie/images/0/0d/Season_1_Episode_11_To_Riverdale_And_Back_Again_Homecoming_Fred_Hermione_and_Mary.PNG/revision/latest/scale-to-width-down/250?cb=20170428214854", "https://vignette.wikia.nocookie.net/riverdalearchie/images/1/14/RD-Caps-4x07-The-Ice-Storm-81-FP-Alice-Hiram-Hermione.png/revision/latest/scale-to-width-down/250?cb=20191123022932", "https://vignette.wikia.nocookie.net/riverdalearchie/images/5/59/RD-Caps-2x08-House-of-the-Devil-40-Hiram-Hermione.png/revision/latest/scale-to-width-down/250?cb=20171207190437", "https://vignette.wikia.nocookie.net/riverdalearchie/images/e/e1/RD-Caps-4x01-In-Memoriam-30-Arthur-Jellybean-Ben-FP-Toni-Jughead-Betty-Sierra-Tom-Kevin-Alice-Mary-Hal-Hiram-Hermione-Veronica-Cheryl-Jason-Reggie-Clifford-Penelope-Pop.png/revision/latest/scale-to-width-down/250?cb=20191013162412", "https://vignette.wikia.nocookie.net/riverdalearchie/images/1/18/RD-Caps-2x17-The-Noose-Tightens-133-Veronica-Hermione-Hiram-Archie.jpg/revision/latest/scale-to-width-down/250?cb=20180330165641", "https://vignette.wikia.nocookie.net/riverdalearchie/images/9/9a/RD-Caps-3x04-The-Midnight-Club-46-Teen-Alice-Teen-Penelope-Teen-Sierra-Teen-Hermione-Teen-Fred-Teen-FP.jpg/revision/latest/scale-to-width-down/250?cb=20181111202652", "https://vignette.wikia.nocookie.net/riverdalearchie/images/b/b9/Season_1_Episode_8_The_Outsiders_Alice_Hermione_%281%29.jpg/revision/latest/scale-to-width-down/250?cb=20170403161633", "https://vignette.wikia.nocookie.net/riverdalearchie/images/2/2e/RD-Caps-4x05-Witness-for-the-Prosecution-47-Hermione.png/revision/latest/scale-to-width-down/250?cb=20191109011036", "https://vignette.wikia.nocookie.net/riverdalearchie/images/4/41/RD-S4-Hermione-Lodge-Promotional-Portrait.jpg/revision/latest?cb=20191013200302", "https://vignette.wikia.nocookie.net/riverdalearchie/images/3/31/Season_1_Episode_8_The_Outsiders_Hermione_Veronica.jpg/revision/latest/scale-to-width-down/250?cb=20170403153719", "https://vignette.wikia.nocookie.net/riverdalearchie/images/1/16/RD-Caps-2x02-Nighthawks-127-Hermione-Hiram.png/revision/latest/scale-to-width-down/250?cb=20171019183929", "https://vignette.wikia.nocookie.net/riverdalearchie/images/b/bb/RD-Caps-2x13-The-Tell-Tale-Heart-128-Hermione.png/revision/latest/scale-to-width-down/250?cb=20180208153124", "https://vignette.wikia.nocookie.net/riverdalearchie/images/d/d6/RD-Caps-3x16-Big-Fun-01-Mr.-Weatherbee-Kevin-Evelyn-Hermione.png/revision/latest/scale-to-width-down/250?cb=20190323175721", "https://vignette.wikia.nocookie.net/riverdalearchie/images/e/ec/RD-Caps-2x08-House-of-the-Devil-21-Hermione-Hiram.png/revision/latest/scale-to-width-down/250?cb=20171207190429", "https://vignette.wikia.nocookie.net/riverdalearchie/images/a/a7/RD-Caps-2x13-The-Tell-Tale-Heart-26-Hermione.png/revision/latest/scale-to-width-down/250?cb=20180208152427", "https://vignette.wikia.nocookie.net/riverdalearchie/images/e/e4/RD-Caps-4x15-To-Die-For-53-FP-Veronica-Archie-Mary-Fangs-Pop-Cheryl-Toni-Joan-Donna-Bret-Sweet-Pea-Tom-Kevin-Hermione-Hiram-Jellybean-Alice-Betty.png/revision/latest/scale-to-width-down/250?cb=20200307125858", "https://vignette.wikia.nocookie.net/riverdalearchie/images/d/d1/RD-Caps-4x05-Witness-for-the-Prosecution-08-Mary-Veronica-Hermione.png/revision/latest/scale-to-width-down/250?cb=20191109010843", "https://vignette.wikia.nocookie.net/riverdalearchie/images/1/1c/Season_1_Episode_10_The_Lost_Weekend_Hermione_learns_the_truth.png/revision/latest/scale-to-width-down/250?cb=20170414202325", "https://vignette.wikia.nocookie.net/riverdalearchie/images/9/9f/Season_1_Episode_7_In_a_Lonely_Place_Hermione_Veronica_1.png/revision/latest/scale-to-width-down/250?cb=20170313155549", "https://vignette.wikia.nocookie.net/riverdalearchie/images/1/17/RD-Caps-2x10-The-Blackboard-Jungle-28-Hiram-Hermione.png/revision/latest/scale-to-width-down/250?cb=20180118163742", "https://vignette.wikia.nocookie.net/riverdalearchie/images/9/96/RD-Caps-2x21-Judgment-Night-130-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20180512173435", "https://vignette.wikia.nocookie.net/riverdalearchie/images/e/e7/RD-Caps-2x11-The-Wrestler-90-Hermione.png/revision/latest/scale-to-width-down/250?cb=20180125165834", "https://vignette.wikia.nocookie.net/riverdalearchie/images/c/c8/RD-Caps-2x21-Judgment-Night-166-Hermione-Hiram-Veronica.jpg/revision/latest/scale-to-width-down/250?cb=20180512174632", "https://vignette.wikia.nocookie.net/riverdalearchie/images/b/b7/RD-Caps-3x04-The-Midnight-Club-141-Teen-Fred-Teen-Hermione-Teen-Hiram-Teen-Marty-Teen-Penelope-Teen-FP-Teen-Tom-Teen-Sierra-Teen-Daryl-Teen-Alice.jpg/revision/latest/scale-to-width-down/250?cb=20181111202923", "https://vignette.wikia.nocookie.net/riverdalearchie/images/c/ca/Season_1_Episode_13_The_Sweet_Hereafter_Hermione_at_Jubilee.png/revision/latest/scale-to-width-down/250?cb=20170512192850", "https://vignette.wikia.nocookie.net/riverdalearchie/images/1/17/RD-Caps-3x10-The-Stranger-42-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20190127153137", "https://vignette.wikia.nocookie.net/riverdalearchie/images/1/16/RD-Caps-3x12-Bizarrodale-08-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20190210210641", "https://vignette.wikia.nocookie.net/riverdalearchie/images/9/9a/RD-Caps-3x17-The-Raid-16-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20190330015616", "https://vignette.wikia.nocookie.net/riverdalearchie/images/a/a2/RD-Caps-2x22-Brave-New-World-44-Hiram-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20180519064007", "https://vignette.wikia.nocookie.net/riverdalearchie/images/e/ec/RD-Caps-3x02-Fortune-and-Men%27s-Eyes-131-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20181020171702", "https://vignette.wikia.nocookie.net/riverdalearchie/images/8/8e/RD-Caps-2x21-Judgment-Night-29-Hiram-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20180512165524", "https://vignette.wikia.nocookie.net/riverdalearchie/images/b/b0/RD-Caps-3x04-The-Midnight-Club-35-Teen-Sierra-Teen-Hermione-Teen-FP-Teen-Penelope-Teen-Fred-Teen-Alice-Principal-Featherhead.jpg/revision/latest/scale-to-width-down/250?cb=20181111202637", "https://vignette.wikia.nocookie.net/riverdalearchie/images/3/3e/Season_1_Episode_9_La_Grande_Illusion_Ethel%2C_Veronica%2C_Hermione%2C_Betty_and_Kevin.png/revision/latest/scale-to-width-down/250?cb=20170407131951", "https://slot1-images.wikia.nocookie.net/__cb1586975593232/common/extensions/wikia/WikiaBar/images/wikiabarIcon.png", "https://vignette.wikia.nocookie.net/riverdalearchie/images/9/9d/RD-Caps-4x07-The-Ice-Storm-22-Hermione-Hiram-Hermosa.png/revision/latest/scale-to-width-down/250?cb=20191123022628", "https://vignette.wikia.nocookie.net/riverdalearchie/images/7/70/RD-Caps-2x03-The-Watcher-in-the-Woods-90-Veronica-Hermione.png/revision/latest/scale-to-width-down/250?cb=20171026212013", "https://vignette.wikia.nocookie.net/riverdalearchie/images/4/4b/RD-Caps-2x09-Silent-Night-Deadly-Night-56-Hermione-Hiram-Veronica.png/revision/latest/scale-to-width-down/250?cb=20171214171545", "https://vignette.wikia.nocookie.net/riverdalearchie/images/5/5a/RD-Caps-2x03-The-Watcher-in-the-Woods-123-Hermione.png/revision/latest/scale-to-width-down/250?cb=20171026212957", "https://vignette.wikia.nocookie.net/riverdalearchie/images/1/1d/RD-Caps-3x04-The-Midnight-Club-07-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20181111202548", "https://vignette.wikia.nocookie.net/riverdalearchie/images/a/a6/RD-Caps-2x04-The-Town-That-Dreaded-Sundown-17-Hermione.png/revision/latest/scale-to-width-down/250?cb=20171102180402", "https://vignette.wikia.nocookie.net/riverdalearchie/images/8/88/RD-Caps-3x11-The-Red-Dahlia-62-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20190203214518", "https://vignette.wikia.nocookie.net/riverdalearchie/images/b/b8/RD-Caps-2x17-The-Noose-Tightens-85-Hermione-Hiram-Veronica-Archie.jpg/revision/latest/scale-to-width-down/250?cb=20180330165430", "https://vignette.wikia.nocookie.net/riverdalearchie/images/1/19/RD-Caps-2x12-The-Wicked-and-The-Divine-27-Hermione-Veronica.png/revision/latest/scale-to-width-down/250?cb=20180201171316", "https://vignette.wikia.nocookie.net/riverdalearchie/images/1/1a/Season_1_Episode_6_Faster%2C_Pussycats%21_Kill%21_Kill%21_Hermione_and_Fred_kissing.png/revision/latest/scale-to-width-down/250?cb=20170312182544", "https://vignette.wikia.nocookie.net/riverdalearchie/images/e/ef/RD-Caps-3x22-Survive-The-Night-107-Agent-Ardelia-Hermione.png/revision/latest/scale-to-width-down/250?cb=20190518012504", "https://vignette.wikia.nocookie.net/riverdalearchie/images/0/0a/RD-Caps-2x11-The-Wrestler-110-Hermione-Hiram.png/revision/latest/scale-to-width-down/250?cb=20180125170001", "https://vignette.wikia.nocookie.net/riverdalearchie/images/9/99/Season_1_Episode_4_The_Last_Picture_Show_Hermione_vs_FP.png/revision/latest/scale-to-width-down/250?cb=20170312181928", "https://vignette.wikia.nocookie.net/riverdalearchie/images/6/60/RD-Caps-2x12-The-Wicked-and-The-Divine-78-Abuelita-Hiram-Hermione.png/revision/latest/scale-to-width-down/250?cb=20180201171700", "https://vignette.wikia.nocookie.net/riverdalearchie/images/2/20/Season_1_Episode_5_Heart_of_Darkness_Hermione_and_Penelope.png/revision/latest/scale-to-width-down/250?cb=20170312182235", "https://vignette.wikia.nocookie.net/riverdalearchie/images/b/b9/Season_1_Episode_13_The_Sweet_Hereafter_Hermione_in_the_window.png/revision/latest/scale-to-width-down/250?cb=20170512192853", "https://vignette.wikia.nocookie.net/riverdalearchie/images/4/44/RD-Caps-4x12-Men-of-Honor-09-Hermione-Hiram.png/revision/latest/scale-to-width-down/250?cb=20200209202206", "https://vignette.wikia.nocookie.net/riverdalearchie/images/1/18/RD-Caps-3x04-The-Midnight-Club-88-Teen-Fred-Teen-Hermione-Teen-FP-Teen-Penelope-Teen-Alice-Teen-Sierra.jpg/revision/latest/scale-to-width-down/250?cb=20181111202756", "https://vignette.wikia.nocookie.net/riverdalearchie/images/f/f2/RD-Caps-2x20-Shadow-of-a-Doubt-101-Hiram-Veronica-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20180504152124", "https://vignette.wikia.nocookie.net/riverdalearchie/images/5/55/RD-Caps-4x05-Witness-for-the-Prosecution-59-Hermione.png/revision/latest/scale-to-width-down/250?cb=20191109011111", "https://vignette.wikia.nocookie.net/riverdalearchie/images/0/01/Season_1_Episode_11_To_Riverdale_and_Back_Again_Hermione_vs_Veronica.png/revision/latest/scale-to-width-down/250?cb=20170428203037", "https://vignette.wikia.nocookie.net/riverdalearchie/images/7/79/RD-Caps-2x03-The-Watcher-in-the-Woods-38-Betty-Veronica-Hiram-Hermione-Archie-Jughead.png/revision/latest/scale-to-width-down/250?cb=20171026210226", "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D", "https://vignette.wikia.nocookie.net/riverdalearchie/images/9/94/RD-Caps-3x02-Fortune-and-Men%27s-Eyes-54-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20181020171528", "https://vignette.wikia.nocookie.net/riverdalearchie/images/5/52/RD-Caps-2x01-A-Kiss-Before-Dying-89-Veronica-Hermione.png/revision/latest/scale-to-width-down/250?cb=20171012221356", "https://vignette.wikia.nocookie.net/riverdalearchie/images/f/f7/RD-Caps-3x21-The-Dark-Secret-of-Harvest-House-08-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20190510224828", "https://vignette.wikia.nocookie.net/riverdalearchie/images/e/e5/RD-Caps-3x06-Manhunter-101-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20181202171441", "https://vignette.wikia.nocookie.net/riverdalearchie/images/a/a4/RD-Caps-2x10-The-Blackboard-Jungle-05-Mayor-Sierra-McCoy-Hermione.png/revision/latest/scale-to-width-down/250?cb=20180118163547", "https://vignette.wikia.nocookie.net/riverdalearchie/images/9/9f/Season_1_Episode_2_A_Touch_of_Evil_Hermione_talking_to_Archie.png/revision/latest/scale-to-width-down/250?cb=20170319150452", "https://vignette.wikia.nocookie.net/hildatheseries/images/0/01/Community-Page-Header.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20190914140704", "https://vignette.wikia.nocookie.net/riverdalearchie/images/6/60/RD-Caps-3x04-The-Midnight-Club-97-Teen-Fred-Teen-Daryl-Teen-Hermione-Teen-FP-Teen-Marty-Teen-Hiram-Teen-Sierra-Teen-Alice-Teen-Tom.jpg/revision/latest/scale-to-width-down/250?cb=20181111202810", "https://vignette.wikia.nocookie.net/riverdalearchie/images/0/0d/Season_1_Episode_9_La_Grande_Illusion_Hermione_smiling.png/revision/latest/scale-to-width-down/250?cb=20170407160013", "https://vignette.wikia.nocookie.net/riverdalearchie/images/d/dc/RD-Caps-3x17-The-Raid-63-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20190330020106", "https://vignette.wikia.nocookie.net/riverdalearchie/images/8/89/Wiki-wordmark.png/revision/latest?cb=20190508211625", "https://vignette.wikia.nocookie.net/riverdalearchie/images/a/af/RD-Caps-2x21-Judgment-Night-50-Hermione-Sheriff-Minetta.jpg/revision/latest/scale-to-width-down/250?cb=20180512170243", "https://vignette.wikia.nocookie.net/riverdalearchie/images/6/64/RD-Caps-3x10-The-Stranger-107-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20190127153819", "https://vignette.wikia.nocookie.net/riverdalearchie/images/6/67/RD-Caps-3x08-Outbreak-18-Hiram-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20181219231445", "https://vignette.wikia.nocookie.net/adoptme/images/6/61/Wikia_from_DreamCraft.png/revision/latest/zoom-crop/width/100/height/56?cb=20200324164245", "https://vignette.wikia.nocookie.net/riverdalearchie/images/d/d1/RD-Caps-2x20-Shadow-of-a-Doubt-107-Veronica-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20180504152137", "https://vignette.wikia.nocookie.net/riverdalearchie/images/8/8a/RD-Caps-3x06-Manhunter-37-Hiram-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20181202171331", "https://vignette.wikia.nocookie.net/riverdalearchie/images/d/df/RD-Caps-3x01-Labor-Day-15-Hiram-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20181014153742", "https://vignette.wikia.nocookie.net/riverdalearchie/images/d/d7/Season_1_Episode_1_The_River%27s_Edge_Hermione_and_Veronica_at_Pembrooke.png/revision/latest/scale-to-width-down/250?cb=20170312181132", "https://vignette.wikia.nocookie.net/riverdalearchie/images/8/80/RD-Caps-2x05-When-a-Stranger-Calls-07-Hermione.png/revision/latest/scale-to-width-down/250?cb=20171109184220", "https://vignette.wikia.nocookie.net/riverdalearchie/images/7/73/RD-Caps-3x04-The-Midnight-Club-23-Teen-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20181111202618", "https://vignette.wikia.nocookie.net/riverdalearchie/images/8/80/RD-Caps-3x08-Outbreak-49-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20181219231533", "https://vignette.wikia.nocookie.net/riverdalearchie/images/1/14/RD-Caps-3x13-Requiem-for-a-Welterweight-107-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20190303144436", "https://vignette.wikia.nocookie.net/riverdalearchie/images/7/79/RD-Caps-2x12-The-Wicked-and-The-Divine-19-Hermione.png/revision/latest/scale-to-width-down/250?cb=20180201171241", "https://vignette.wikia.nocookie.net/riverdalearchie/images/0/06/RD-Caps-3x11-The-Red-Dahlia-86-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20190203214639", "https://vignette.wikia.nocookie.net/riverdalearchie/images/3/34/RD-Caps-2x15-There-Will-Be-Blood-142-Hermione.png/revision/latest/scale-to-width-down/250?cb=20180315152027", "https://vignette.wikia.nocookie.net/riverdalearchie/images/a/a2/RD-Caps-2x19-Prisoners-40-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20180427151616", "https://vignette.wikia.nocookie.net/riverdalearchie/images/7/72/RD-Caps-2x15-There-Will-Be-Blood-07-Hermione-Veronica.png/revision/latest/scale-to-width-down/250?cb=20180315150833", "https://vignette.wikia.nocookie.net/riverdalearchie/images/5/5f/RD-Caps-3x07-The-Man-in-Black-43-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20181209234428", "https://vignette.wikia.nocookie.net/riverdalearchie/images/8/86/RD-Caps-2x06-Death-Proof-98-Hermione-Hiram-Veronica.png/revision/latest/scale-to-width-down/250?cb=20171116174756", "https://vignette.wikia.nocookie.net/riverdalearchie/images/1/19/RD-Caps-3x05-The-Great-Escape-129-Hiram-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20181122162717", "https://vignette.wikia.nocookie.net/riverdalearchie/images/1/19/RD-Caps-2x11-The-Wrestler-37-Hermione.png/revision/latest/scale-to-width-down/250?cb=20180125165136", "https://vignette.wikia.nocookie.net/riverdalearchie/images/c/cb/RD-Caps-2x05-When-a-Stranger-Calls-98-Hiram-Hermione.png/revision/latest/scale-to-width-down/250?cb=20171109190314", "https://vignette.wikia.nocookie.net/riverdalearchie/images/1/10/RD-Caps-3x12-Bizarrodale-36-Penelope-Hermione-Fred-Marty-Alice-FP-The-Midnight-Club.jpg/revision/latest/scale-to-width-down/250?cb=20190210211050", "https://vignette.wikia.nocookie.net/101dalmatianstreet/images/0/0e/Community-header-background/revision/latest/zoom-crop/width/100/height/56?cb=20200106151802", "https://vignette.wikia.nocookie.net/riverdalearchie/images/e/e4/RD-Caps-2x05-When-a-Stranger-Calls-101-Hermione-Fred.png/revision/latest/scale-to-width-down/250?cb=20171109190917", "https://vignette.wikia.nocookie.net/riverdalearchie/images/f/fb/RD-Caps-3x06-Manhunter-42-Alice-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20181202171336", "https://vignette.wikia.nocookie.net/riverdalearchie/images/0/07/RD-Caps-3x04-The-Midnight-Club-132-Teen-Alice-Teen-Fred-Teen-Hermione-Teen-Sierra-Teen-FP-Teen-Penelope.jpg/revision/latest/scale-to-width-down/250?cb=20181111202908", "https://vignette.wikia.nocookie.net/riverdalearchie/images/4/42/RD-Caps-3x08-Outbreak-117-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20181219231703", "https://vignette.wikia.nocookie.net/riverdalearchie/images/2/23/RD-Caps-4x07-The-Ice-Storm-33-Hiram-Hermione.png/revision/latest/scale-to-width-down/250?cb=20191123022704", "https://vignette.wikia.nocookie.net/riverdalearchie/images/3/39/RD-Caps-2x16-Primary-Colors-30-Hiram-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20180323155117", "https://vignette.wikia.nocookie.net/riverdalearchie/images/6/60/Season_1_Episode_11_To_Riverdale_and_Back_Again_Hermione%2C_Fred%2C_and_Mary.png/revision/latest/scale-to-width-down/250?cb=20170428200653", "https://vignette.wikia.nocookie.net/riverdalearchie/images/f/f2/RD-Caps-3x04-The-Midnight-Club-64-Teen-Sierra-Teen-Alice-Teen-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20181111202724", "https://vignette.wikia.nocookie.net/riverdalearchie/images/7/70/RD-Caps-3x11-The-Red-Dahlia-15-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20190203214319", "https://vignette.wikia.nocookie.net/riverdalearchie/images/6/67/RD-Caps-2x20-Shadow-of-a-Doubt-10-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20180504151758", "https://vignette.wikia.nocookie.net/riverdalearchie/images/1/11/RD-Caps-2x19-Prisoners-04-Hermione-Veronica-Hiram.jpg/revision/latest/scale-to-width-down/250?cb=20180427151503", "https://vignette.wikia.nocookie.net/riverdalearchie/images/4/45/RD-Caps-2x16-Primary-Colors-10-Andy-Cohen-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20180323155023", "https://vignette.wikia.nocookie.net/riverdalearchie/images/0/09/RD-Caps-2x17-The-Noose-Tightens-20-Mary-Fred-Veronica-Archie-Hiram-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20180330165138", "https://vignette.wikia.nocookie.net/riverdalearchie/images/b/bb/RD-Caps-3x11-The-Red-Dahlia-103-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20190203214650", "https://vignette.wikia.nocookie.net/riverdalearchie/images/e/ef/RD-Caps-3x11-The-Red-Dahlia-104-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20190203214651", "https://vignette.wikia.nocookie.net/riverdalearchie/images/3/3f/RD-Caps-3x16-Big-Fun-37-Hermione.png/revision/latest/scale-to-width-down/250?cb=20190323175946", "https://vignette.wikia.nocookie.net/riverdalearchie/images/e/ee/RD-Caps-2x01-A-Kiss-Before-Dying-03-Hermione.png/revision/latest/scale-to-width-down/250?cb=20171012170758", "https://vignette.wikia.nocookie.net/riverdalearchie/images/4/4c/RD-Caps-2x19-Prisoners-60-Hiram-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20180427151704", "https://vignette.wikia.nocookie.net/riverdalearchie/images/3/39/RD-Caps-2x10-The-Blackboard-Jungle-93-Hermione-Hiram.png/revision/latest/scale-to-width-down/250?cb=20180118164247", "https://vignette.wikia.nocookie.net/riverdalearchie/images/8/84/RD-Caps-3x04-The-Midnight-Club-33-Teen-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20181111202634", "https://vignette.wikia.nocookie.net/riverdalearchie/images/7/73/RD-Caps-4x12-Men-of-Honor-109-Veronica-Hermione.png/revision/latest/scale-to-width-down/250?cb=20200209202625", "https://vignette.wikia.nocookie.net/riverdalearchie/images/c/cb/RD-Caps-2x18-A-Night-To-Remember-46-Hiram-Hermione.png/revision/latest/scale-to-width-down/250?cb=20180420154747", "https://vignette.wikia.nocookie.net/riverdalearchie/images/0/00/RD-Caps-2x09-Silent-Night-Deadly-Night-114-Veronica-Hermione-Hiram.png/revision/latest/scale-to-width-down/250?cb=20171214173825", "https://vignette.wikia.nocookie.net/riverdalearchie/images/4/44/RD-Caps-4x13-The-Ides-of-March-74-Hermosa-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20200214222906", "https://vignette.wikia.nocookie.net/riverdalearchie/images/8/84/Season_1_Episode_8_The_Outsiders_Hermione_and_Fred.PNG/revision/latest/scale-to-width-down/250?cb=20170401110750", "https://vignette.wikia.nocookie.net/riverdalearchie/images/0/01/Season_1_Episode_12_Anatomy_of_a_Murder_Hermione_%27time_to_pack%27.png/revision/latest/scale-to-width-down/250?cb=20170505231109", "https://vignette.wikia.nocookie.net/riverdalearchie/images/f/fd/RD-Caps-2x15-There-Will-Be-Blood-116-Hermione-Veronica.png/revision/latest/scale-to-width-down/250?cb=20180315151752", "https://vignette.wikia.nocookie.net/riverdalearchie/images/5/5e/RD-Caps-3x12-Bizarrodale-67-Hiram-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20190210211146", "https://vignette.wikia.nocookie.net/riverdalearchie/images/e/e2/RD-Caps-3x01-Labor-Day-79-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20181014153904", "https://vignette.wikia.nocookie.net/riverdalearchie/images/a/a4/RD-Caps-4x06-Hereditary-28-Hermione-Veronica.png/revision/latest/scale-to-width-down/250?cb=20191116022651", "https://vignette.wikia.nocookie.net/riverdalearchie/images/e/e1/RD-Caps-4x06-Hereditary-68-Hermione-Hiram.png/revision/latest/scale-to-width-down/250?cb=20191116022856", "https://vignette.wikia.nocookie.net/riverdalearchie/images/c/ca/RD-Caps-2x22-Brave-New-World-63-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20180519064943", "https://vignette.wikia.nocookie.net/riverdalearchie/images/8/8a/RD-Caps-2x05-When-a-Stranger-Calls-116-Hermione-Hiram-Fred.png/revision/latest/scale-to-width-down/250?cb=20171109190924", "https://vignette.wikia.nocookie.net/riverdalearchie/images/c/c1/RD-Caps-2x15-There-Will-Be-Blood-84-Hiram-Veronica-Hermione.png/revision/latest/scale-to-width-down/250?cb=20180315151504", "https://vignette.wikia.nocookie.net/riverdalearchie/images/1/1b/RD-Caps-2x02-Nighthawks-72-Hermione-Hiram-Veronica.png/revision/latest/scale-to-width-down/250?cb=20171019180151", "https://vignette.wikia.nocookie.net/riverdalearchie/images/d/de/RD-Caps-2x09-Silent-Night-Deadly-Night-96-Hiram-Hermione-Veronica.png/revision/latest/scale-to-width-down/250?cb=20171214172944", "https://vignette.wikia.nocookie.net/riverdalearchie/images/0/01/RD-Caps-2x16-Primary-Colors-91-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20180323155435", "https://vignette.wikia.nocookie.net/riverdalearchie/images/e/ec/RD-Caps-2x11-The-Wrestler-11-Hermione-Hiram-Fred-Mayor-Sierra-McCoy-Sheriff-Keller.png/revision/latest/scale-to-width-down/250?cb=20180125164942", "https://vignette.wikia.nocookie.net/riverdalearchie/images/1/1a/RD-Caps-3x01-Labor-Day-124-Hiram-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20181014153956", "https://vignette.wikia.nocookie.net/riverdalearchie/images/b/ba/RD-Caps-2x13-The-Tell-Tale-Heart-72-Hiram-Hermione.png/revision/latest/scale-to-width-down/250?cb=20180208152748", "https://vignette.wikia.nocookie.net/riverdalearchie/images/4/41/RD-S4-Hermione-Lodge-Promotional-Portrait.jpg/revision/latest/scale-to-width-down/350?cb=20191013200302", "https://vignette.wikia.nocookie.net/riverdalearchie/images/2/23/RD-Caps-3x17-The-Raid-70-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20190330020114", "https://vignette.wikia.nocookie.net/riverdalearchie/images/2/26/RD-Caps-2x06-Death-Proof-21-Alice-Betty-Archie-Veronica-Josie-Kevin-Reggie-Melinda-Hermione-Hiram-Fred-Sheriff-Keller-Mayor-Sierra-McCoy.png/revision/latest/scale-to-width-down/250?cb=20171116172226", "https://vignette.wikia.nocookie.net/riverdalearchie/images/b/b6/RD-Caps-3x04-The-Midnight-Club-76-Teen-Hermione.jpg/revision/latest/scale-to-width-down/250?cb=20181111202740", "https://vignette.wikia.nocookie.net/riverdalearchie/images/9/9b/RD-Caps-2x10-The-Blackboard-Jungle-41-Hiram-Hermione.png/revision/latest/scale-to-width-down/250?cb=20180118163845", "https://vignette.wikia.nocookie.net/riverdalearchie/images/b/b5/Season_1_Episode_6_Faster%2C_Pussycats%21_Kill%21_Kill%21_Hermione_and_Fred_hug.png/revision/latest/scale-to-width-down/250?cb=20170312182543"], "top_img": "https://vignette.wikia.nocookie.net/riverdalearchie/images/4/41/RD-S4-Hermione-Lodge-Promotional-Portrait.jpg/revision/latest?cb=20191013200302", "keywords": [], "authors": [], "canonical_link": "https://riverdale.fandom.com/wiki/Hermione_Lodge", "title": "Hermione Lodge", "meta_data": {"viewport": "width=device-width, user-scalable=yes", "generator": "MediaWiki 1.19.24", "keywords": "Archieverse Wiki,riverdalearchie,Hermione Lodge,Veronica Lodge,Marisol Nichols,Camila Mendes,Chapter One: The River's Edge,Lodge Industries,Andrews Construction,Bijou,The Midnight Club,Pop's Chock'lit Shoppe,Hiram Lodge", "description": "Hermione Apollonia Lodge (née Gomez) is a main character on The CW's Riverdale. She is portrayed by Marisol Nichols. Hermione is the ex-wife of Hiram Lodge and the mother of Veronica Lodge. She had a brief affair with Fred Andrews, but, their relationship ended when Hermione revealed that she...", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://riverdale.fandom.com/wiki/Hermione_Lodge", "title": "Hermione Lodge | Archieverse Wiki | Fandom", "description": "Hermione Apollonia Lodge (née Gomez) is a main character on The CW's Riverdale. She is portrayed by Marisol Nichols. Hermione is the ex-wife of Hiram Lodge and the mother of Veronica Lodge. She..."}, "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "Archieverse Wiki", "title": "Hermione Lodge", "description": "Hermione Apollonia Lodge (née Gomez) is a main character on The CW's Riverdale. She is portrayed by Marisol Nichols. Hermione is the ex-wife of Hiram Lodge and the mother of Veronica Lodge. She had a brief affair with Fred Andrews, but, their relationship ended when Hermione revealed that she was the buyer of the SoDale project.", "url": "https://riverdale.fandom.com/wiki/Hermione_Lodge", "image": "https://vignette.wikia.nocookie.net/riverdalearchie/images/4/41/RD-S4-Hermione-Lodge-Promotional-Portrait.jpg/revision/latest?cb=20191013200302"}, "apple-itunes-app": "app-id=422467074, app-arguments=https://riverdale.fandom.com/wiki/Hermione_Lodge"}, "movies": [], "publish_date": null, "source": "http://riverdale.wikia.com", "summary": ""}