{"url": "https://www.monster.com/career-advice/article/healthcare-ways-your-job-is-nothing-like-greys-anatomy-0916", "text": "9 ways your job is nothing like ‘Grey’s Anatomy’ For one, real life nurses actually do the majority of the work performed by the doctors on the show. Here’s a side-by-side comparison of all the misconceptions we found.\n\nLily Martis, Monster staff\n\n“Is it just like Grey’s Anatomy?” your non-health friends have probably asked you of your hospital job.\n\nWell, not quite.\n\nABC’s Grey’s Anatomy—a medical show filled with above-average looking doctors, forbidden romances, heartbreak, oh yeah, and blood, guts and unauthorized surgeries performed with a clipboard—is back for its 13th season which premiered Thursday, Sept. 22.\n\nWhile, yes, some aspects of hospital life are similar to what’s depicted on the show, most other elements are nothing like it.\n\nMonster spoke with Andrew Holtz, a former CNN medical correspondent and author of The Real Grey’s Anatomy, which gives a behind-the-scenes look at the real lives of surgical residents he shadowed at Oregon Health & Science University (OHSU). Here’s a side-by-side comparison.\n\nGrey’s Anatomy:\n\nSurgeons get into really intense, close relationships with patients regularly.\n\nReal life:\n\nResidents and physicians actually spend more time away from the patients in rooms with computers and lab test results, Holtz says. Nurses are the ones who develop the close relationships with patients.\n\n“An awful lot of what you see on the show is what nurses do in terms of patient care,” Holtz says. “The surgeons, the residents, the other physicians in the hospital are checking with the patients, they get to know their cases, but they don’t spend anything like the kind of time actually in the room with the patients as the nurses do. Nurses really are the ones who take care of the patients, and the doctors get familiar with their cases and give instructions.”\n\nWhat we’re trying to say is, the Izzie Stevens-Denny Duquette romance would never have happened in real life.\n\nGrey’s Anatomy:\n\nDoctors discuss their personal lives while working on an unconscious patient.\n\nReal life:\n\nActually, yes.\n\nOK, maybe they aren’t talking about who slept with who, but that conference they attended last week or the concert they saw last night? Yeah, Holtz says it’ll probably come up between incisions.\n\n“Some surgeries last for hours and most of it’s not that intense,” Holtz says. “You would think it would be, but it’s mostly methodical. They’re very careful and things take time, so they do have time to chat.”\n\nBut the second something changes, all conversation stops.\n\n“I noticed, on a number of occasions, people would be having conversations, and then, all of a sudden, it would go quiet and people would snap to attention because of some uncertainty or some bleeding,” Holtz says.\n\nBut nothing is usually quite to the dramatic extent of Grey’s Anatomy where the patient has to code on the table for the surgeon to come out as a hero and save their life.\n\n“Almost every surgery goes according to plan and much of it is very routine,” he says.\n\nGrey’s Anatomy:\n\nThe residents are constantly competing for surgeries.\n\nReal life:\n\nIn the pilot episode, Richard Webber, chief of surgery, makes his famous introduction to the first year residents, “Look around you. Say hello to your competition…this is your starting line, this is your arena,” he says as the new doctors size up their peers, sort of scheming how they can get ahead.\n\nHoltz says hospital workers tend to develop more camaraderie.\n\n“There is a lot of stress, but I saw, for the most part, that people tended to support each other,” he says. “I saw a lot more collaboration and mutual support. More often than not, they tend to get along and sometimes socialize outside of the hospital.”\n\nGrey’s Anatomy:\n\nNurses play a small role in the hospital.\n\nReal life:\n\nHoltz says this is one of the biggest myths on Grey’s Anatomy and other TV medical shows.\n\n“Nurses are absolutely essential to health care,” Holtz says. “What you see on TV is mostly nursing care. Giving patients injections, making sure they have their medicine, taking their blood pressure and doing hands on things with the patient in the hospital room, that’s almost all nursing care.”\n\nEspecially to young doctors, Holtz says nurses are useful in helping them learn the ropes, and in good health care institutions, nurses are listened to and their opinions are valued.\n\nGrey’s Anatomy:\n\nExperimental treatment is better than standard treatment.\n\nReal life:\n\nSurgeons aren’t as big of risk takers as doctors like Derek Shepherd (you know him as McDreamy), his sister Amelia and Callie Torres would lead you to believe. Holtz says a common myth on Grey’s Anatomy is that new is better, but people tend to not take those kinds of risks in real life.\n\n“If it was the better treatment option, it wouldn’t be experimental.” Holtz says. “Experimental means you don’t know if it’s better or not.”\n\nGrey’s Anatomy:\n\nSurgeons will find any excuse to get in the OR and cut open a patient.\n\nReal life:\n\nOn Grey’s Anatomy, Cristina Yang and the other surgeons are almost addicted to the high that comes from cutting open a patient. Not just that, but as most cases on the show will lead you to believe, surgery is the Hail Mary when it comes to saving a patient’s life.\n\n“If patients are high risk, they generally don’t go into surgery,” Holtz says. “Surgeons don’t want to go in there if they don’t think the patient is going to pull through.”\n\nWith the exception of emergency medicine and trauma surgery, Holtz says treatments are thought through and planned out in the hospital.\n\nGrey’s Anatomy:\n\nFirst year residents spend a lot of time in the operating room.\n\nReal life:\n\nIn season 1, George O’Malley, on his first day as a resident, gets selected, out of all his peers, to perform an appendectomy.\n\nYeah, that wouldn’t happen in a real surgical program. In fact, a first year resident would be lucky to so much as touch a scalpel.\n\n“Most of the actual surgery is done by chief residents and attending surgeons,” Holtz says. “First and second year residents spend more time on the floor, learning how to care for patients and observing.”\n\nGrey’s Anatomy:\n\nWorking in a hospital is a high stakes environment.\n\nReal life:\n\nAs you probably know, working in a hospital isn’t too exciting. In fact, Holtz says, when he went to write his book, he worried it wouldn’t be entertaining enough.\n\n“For doctors and other people working in the hospital, it’s just their everyday job,” Holtz says. “You couldn’t go to a job where you were on edge and totally stressed out every minute of every day because things were so dramatic. For the most part, the work is pretty routine.”\n\nThat’s not to say working in a hospital doesn’t come with its stresses. Holtz says many hospital workers are prone to nightmares and the worry that they might have forgotten to do something before they left the hospital.\n\nGrey’s Anatomy:\n\nDifferent personality types are associated with different health care workers.\n\nReal life:\n\nIn one episode in season 3, Meredith Grey’s mother, the renowned surgeon Ellis Grey, begins to ask her doctor, Cristina Yang, personal questions about Meredith.\n\n“Has Meredith chosen a specialty?” Ellis asks.\n\n“That’s a personal question?” Cristina responds.\n\n“For surgeons, the most personal question you can ask.”\n\nHoltz says there are strong personality differences between different health care professionals.\n\nFor example, Holtz says cancer surgeons have to enjoy talking to patients as they spend a great deal of time meeting with them and discussing treatment plans. On the other end of the spectrum, trauma surgeons don’t really want to spend time chit-chatting with patients, as they provide quick fixes to medical emergencies as they come in. Similarly, orthopedic surgeons tend to like things very clear-cut, as their job is very mechanical, a bone is either in the right place or it’s not.\n\nPhoto courtesy of ABC/Kelsey McNeal.", "images": ["https://privacy-policy.truste.com/privacy-seal/seal?rid=232f8c51-711d-4fbc-afed-b3b87885979a", "https://media.newjobs.com/mm/cms/mons/jobrapp/play-store.svg", "https://media.newjobs.com/mm/cms/mons/jobrapp/app-store.svg", "https://coda.newjobs.com/api/imagesproxy/ms/cms/content30/images/greys-anatomy.jpg"], "top_img": "https://coda.newjobs.com/api/imagesproxy/ms/cms/content30/images/greys-anatomy.jpg", "keywords": [], "authors": ["Lily Martis", "Monster Staff"], "canonical_link": "https://www.monster.com/career-advice/article/healthcare-ways-your-job-is-nothing-like-greys-anatomy-0916", "title": "9 ways your job is nothing like ‘Grey’s Anatomy’", "meta_data": {"description": "For one, real life nurses actually do the majority of the work performed by the doctors on the show. Here’s a side-by-side comparison of all the misconceptions we found.", "viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0, user-scalable=no", "robots": "index, follow", "twitter": {"card": "summary_large_image", "site": "@Monster", "title": "9 ways your job is nothing like ‘Grey’s Anatomy’", "description": "For one, real life nurses actually do the majority of the work performed by the doctors on the show. Here’s a side-by-side comparison of all the misconceptions we found.", "image": "https://coda.newjobs.com/api/imagesproxy/ms/cms/content30/images/greys-anatomy.jpg", "domain": "https://www.monster.com/career-advice/article/healthcare-ways-your-job-is-nothing-like-greys-anatomy-0916"}, "og": {"type": "article", "title": "9 ways your job is nothing like ‘Grey’s Anatomy’", "description": "For one, real life nurses actually do the majority of the work performed by the doctors on the show. Here’s a side-by-side comparison of all the misconceptions we found.", "url": "https://www.monster.com/career-advice/article/healthcare-ways-your-job-is-nothing-like-greys-anatomy-0916", "site_name": "Monster Career Advice", "image": "https://coda.newjobs.com/api/imagesproxy/ms/cms/content30/images/greys-anatomy.jpg"}, "article": {"publisher": "http://facebook.com/monster"}}, "movies": [], "publish_date": null, "source": "https://www.monster.com", "summary": ""}