{"url": "https://abc.go.com/shows/dancing-with-the-stars/news/dwts-results-and-eliminations/fall-2018-season-27-week-8-the-semi-finals", "text": "The Dancing with the Stars Semi-Finals show was an eventful evening of competition and shocking eliminations. It was a night of double dances from the remaining six competitors (Bobby Bones, Alexis Ren, Grocery Store Joe Amabile, Juan Pablo Di Pace, Evanna Lynch, and Milo Manheim): one dedicated dance and one Judges' Choice dance. How did the stars fare on this high pressure evening? Read the Season 27 Semi-Finals recap to get caught up and find out the scores and what judges Carrie Ann Inaba, Len Goodman, and Bruno Tonioli had to say. The judges weigh in on the dedicated dances, as well as the Judges' Choice dances, as the Season 27 cast heads into the Finals, airing MONDAY NOVEMBER 19 at 8|7c on ABC!\n\nVIDEO: Watch all the performances from Week 8: The Semi-Finals\n\nBobby & Sharna - Total score: 45 out of 60\n\nDedicated Dance: Bobby was especially proud of himself for hitting every step for the first time ever. \"I don't know if it was a Salsa really, but as a show it was incredible,\" said Bruno Tonioli. Len Goodman said he enjoyed watching it even though it wasn't a traditional Salsa performance, and Carrie Ann said Bobby was a little ahead of the other dancers. Bobby and Sharna received three 7s for 21 out of 30.\n\nJudges' Choice Jive (mentored by Len): \"For entertainment, and coming out and selling it, you're my man!\" Len said. He called Bobby's flicks and kicks pretty good. Bruno was pleased to see the kicks and flicks too. Carrie Ann said, \"The world needs more Bobby Bones!\" Bobby and Sharna earned what Bobby called \"his 10s\" ... three 8s for a score of 24 out of 30.\n\nWatch Bobby Bones's Judges' Choice Jive\n\nAlexis & Alan - Total score: 58 out of 60\n\nDedicated Dance: \"Brilliantly beautiful\" said Bruno. \"This was your best dance, but there was a lift!\" said Carrie Ann. \"Why didn't you put more Waltz into that?\" asked Len. Alexis and Alan were awarded two 9s and a 10 for a score of 28 out of 30.\n\nJudges' Choice Jive (mentored by Bruno): \"Nothing fuzzy about that one! It was clearly brilliant\" proclaimed Bruno. \"The concept I loved, the dancing was fab-u-lous,\" said Len. Alexis and Alan received three 10s for a perfect 30 out of 30.\n\nGrocery Store Joe & Jenna - Total score: 46 out of 60\n\nDedicated Dance: \"Well, you didn't do much Joe, but you didn't do much very well!\" said Len, adding, \"I enjoyed it!\" Bruno said, \"It was fashionably minimalistic!\" The judges gave Joe and Jenna an 8 and two 7s, for a score of 22 out of 30.\n\nJudges' Choice Quickstep (mentored by Carrie Ann): \"What a difference!\" said Carrie Ann. \"Really, you have shown up and you have put it on the dance floor, and I am so proud of you,\" she added. \"It was a clean, clear routine!\" said Len. \"From start to finish, no mistakes, you got through it ... it was such an improvement, well done!\" Joe and Jenna received their highest scores of the competition with three 8s, for a total of 24 out of 30.\n\nJuan Pablo & Cheryl - Total score: 60 out of 60\n\nDedicated Dance: Juan Pablo dedicated his Argentine Tango to his mother. Len had to stand up after the dance. \"I will always remember that Argentine Tango, because it was fabulous,\" Len told Juan Pablo and Cheryl. \"It really was extraordinary!\" said Bruno. Carrie Ann added, \"There are no words that I can find that would do that justice...you're in a class of your own, my friend.\" With such stellar reviews from the judges, it was clear that Juan Pablo and Cheryl were about to receive top marks, and they did: three 10s for a perfect 30 out of 30.\n\nWatch Juan Pablo and Cheryl's Perfect Argentine Tango\n\nJudges' Choice Salsa (mentored by Bruno): \"I don't think any Salsa could get hotter or better than this one!\" raved Bruno. \"That was like Fifty Shades of Salsa!\" said Carrie Ann, adding, \"Two authentic, awesome dances today.\" \"I'm going to call you the midwife because you keep delivering dances,\" quipped Len. It's no surprise that Juan Pablo and Cheryl received another perfect score: 30 out of 30!\n\nEvanna & Keo: - Total score: 58 out of 30\n\nDedicated Dance: Evanna's tribute to her friend, late Irish director Simon Fitzmaurice, was beautiful. Bruno lauded how Evanna has grown over the season. \"You did him justice,\" Carrie Ann told her. \"That was a powerful, polished performance, and I loved it!\" said Len. Evanna and Keo were able to successfully follow Juan Pablo's perfect performance, also earning three 10s for a perfect score of 30 out of 30!\n\nWatch Evanna and Keo's Perfect Contemporary\n\nJudges' Choice Foxtrot (mentored by Len): Bruno told Evanna, \"It's like watching another girl from what I saw Week 1.\" \"When I was watching you dance I was overwhelmed with emotion,\" Carrie Ann said. \"I was blown away. Thank you for touching my heart tonight.\" The judges gave Evanna and Keo's Foxtrot redux a 10 and two 9s, for a score of 28 out of 30.\n\nMilo & Witney: - Total score: 55 out of 60\n\nDedicated Dance: \"Stylish, sharp, strong, and I have to say, all the sequences of lifts you did were very, very good,\" Bruno said. \"Milo always delivers.\" Len and Carrie Ann were also impressed, and Milo and Witney were awarded three 9s for a score of 27 out of 30.\n\nJudges' Choice Cha Cha (mentored by Carrie Ann): Carrie Ann felt it was still a little too wild, but said Milo was a great student. \"It was full of youthful exuberance! You come out and there's a joy about your dancing,\" said Len. \"I liked it, I thought it was a very fresh, individual interpretation of the Cha Cha Cha,\" Bruno told Milo and Witney, adding, \"I thought it was a fantastic dance to finish a fantastic night!\" Milo and Witney received two 9s and a 10, for a score of 28 out of 30.\n\nJoe and Jenna, Alexis and Alan, and Juan Pablo and Cheryl were all in jeopardy. Alexis and Alan were safe, so Grocery Store Joe and Jenna, and Juan Pablo and Cheryl were eliminated.\n\nWatch the shocking Semi-Finals elimination!\n\nCatch weekly video highlights and watch full episodes of Dancing with the Stars on ABC.com or the ABC app and don't miss Dancing with the Stars LIVE Mondays 8|7c on ABC!", "images": ["https://assets.cdn.watchdisneyfe.com/delta/assets/abc/abc.png", "https://cdn1.edgedatg.com/aws/v2/abc/DancingWithTheStars/showimages/086101c1a6a087ef587c5debf86ba884/350x117-Q80_086101c1a6a087ef587c5debf86ba884.png", "https://cdn1.edgedatg.com/aws/v2/abc/DancingWithTheStars/blog/2253338/97b03d319df2e0e881b96bb51e9a5e76/1000x400-Q90_97b03d319df2e0e881b96bb51e9a5e76.jpg", "https://assets.cdn.watchdisneyfe.com/delta/assets/common/close.png", "https://assets.cdn.watchdisneyfe.com/delta/assets/common/search.png", "https://assets.cdn.watchdisneyfe.com/delta/assets/common/social/facebook.png", "https://assets.cdn.watchdisneyfe.com/delta/assets/common/social/twitter.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://cdn1.edgedatg.com/aws/v2/abc/DancingWithTheStars/blog/2253338/97b03d319df2e0e881b96bb51e9a5e76/1000x400-Q90_97b03d319df2e0e881b96bb51e9a5e76.jpg", "keywords": [], "authors": [], "canonical_link": "https://abc.com/shows/dancing-with-the-stars/news/dwts-results-and-eliminations/fall-2018-season-27-week-8-the-semi-finals", "title": "DWTS Season 27 Results: Week 8 - The Semi-Finals", "meta_data": {"fb": {"app_id": 137585909851}, "twitter": {"card": "summary_large_image", "site": "@dancingabc", "image": "https://cdn1.edgedatg.com/aws/v2/abc/DancingWithTheStars/blog/2253338/97b03d319df2e0e881b96bb51e9a5e76/1000x400-Q90_97b03d319df2e0e881b96bb51e9a5e76.jpg"}, "og": {"url": "https://abc.com/shows/dancing-with-the-stars/news/dwts-results-and-eliminations/fall-2018-season-27-week-8-the-semi-finals", "app_id": 137585909851, "site_name": "ABC", "image": "https://cdn1.edgedatg.com/aws/v2/abc/DancingWithTheStars/blog/2253338/97b03d319df2e0e881b96bb51e9a5e76/1000x400-Q90_97b03d319df2e0e881b96bb51e9a5e76.jpg", "description": "It's the Semi-Finals of Season 27 of Dancing with the Stars. Read the recap of the show now!", "title": "DWTS Season 27 Results: Week 8 - The Semi-Finals | Dancing with the Stars", "locale": "en_US"}, "keywords": "DWTS Season 27 Results: Week 8 - The Semi-Finals, Dancing with the Stars blogs", "description": "It's the Semi-Finals of Season 27 of Dancing with the Stars. Read the recap of the show now!", "google-play-app": "app-id=com.disney.datg.videoplatforms.android.abc", "msApplication-PackageFamilyName": "ABC.ABCPlayer", "msvalidate.01": "0EABD001D404EA9DDE2025E9E4F14CAF", "msApplication-ID": "App", "msapplication-TileColor": "#2D2D2D", "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "msapplication-TileImage": "//cdn1.edgedatg.com/aws/abc/brand/fall2018/favicon_ie10.png", "apple-itunes-app": "app-id=364191819, app-argument=https://abc.com/watch-live", "google-site-verification": "5ojqqxU4pdyoa-4TgjCukgNv4eEl-8TGQZPsRhznWXc", "format-detection": "telephone=no"}, "movies": [], "publish_date": null, "source": "https://abc.go.com", "summary": ""}