{"url": "https://variety.com/2017/tv/news/outlander-recap-season-3-episode-8-first-wife-1202607103/", "text": "SPOILER ALERT: Do not read if you have not yet watched “First Wife,” the eighth episode of the third season of “Outlander.”\n\nClaire (Caitriona Balfe) and Jamie (Sam Heughan) return to Lallybroch to bring young Ian (John Bell) home. Instead of a warm homecoming, Claire is met with suspicion and distrust by Jamie’s sister Jenny (Laura Donnelly). Then Jamie reveals the one thing he’s been reluctant to tell Claire: he got married while she was in America.\n\nWhen Jamie, Claire and young Ian arrive in Lallybroch, Jamie’s sister Jenny is stunned to see Claire, because she thought Claire long dead. She hugs Young Ian then gives him a whack for making her worry so much. Young Ian is mad they brought him home and tells Jenny about his job selling liquor, which makes his parents even more mad at Jamie. Jamie explains he watched over him like he was his own son and that everything was fine in Edinburgh until an agent of the Crown extorted him. Young Ian unhelpfully adds that Claire killed the agent. Claire explains the man attacked her and she was defending herself. Jamie adds that Jenny never complained when he was sending money to her. Ian (Steven Cree) hands Jamie a belt and tells him to punish Young Ian. Jamie tells them there are other ways to punish Young Ian, and he makes the lad work in the muck making patties.\n\nJamie apologizes to Ian for their worry about Young Ian. Claire meets Maggie’s young sons Angus and Anthony and as Jenny points out that 20 years have past, James Murray (also known as Jamie) comes downstairs holding a baby. He’s now married with five kids.\n\nJamie tells Jenny that Young Ian needs a taste of freedom, while she can still grant him that much. He says he knows what it’s like to be a 16 year old man living on a farm. Jenny counters that it’s a mortal sin to take another wife while his first wife still walks the earth. Jenny asks why Jamie didn’t share his grief years ago when he thought Claire was dead. He says he was prepared to die in battle at Culloden and that he hid Claire in a town and arranged for her to go to the colonies, then the town was attacked and he thought Claire died then, but she made it to the colonies. He does not mention time travel. Jenny tells Jamie that when he was taken away, they rode around looking for him, and that the Claire she knew then would never have stopped looking for Jamie.\n\nThat night, Jamie and Claire are talking before bedtime, and he suggests they settle in Lallybroch. Claire points out that living there would be difficult, given the fact that Jenny hates her. Claire suggests telling Jenny everything, including the part about time travel, or there will always be a wall between her and Jenny. Jamie doesn’t think that’s a good idea. He tells Claire he went searching for her when he escaped Dunsmuir to find the old man who allegedly knew about treasure near the prison. Jamie says when the old man mentioned “La Dame Blanche,” his heart leapt at the thought that Claire might still be alive.\n\nIn a flashback, Jamie recalls looking at Silkies Island, then swims to it, sees a broken-down castle, and walks around yelling “Claire.” He then sees the Mackenzie crest etched into a stone and finds a box containing a treasure of coins and gems. He takes one large sapphire and re-buries the box.\n\nBack in their present, Claire asks why Jamie returned to the prison, and he says his fellow prisoners needed him. Jamie says he gave the sapphire to the prison governor. Claire tells Jamie, “I was out there somewhere, wishing you’d find me. I pretended birdsong was you talking to me.” They kiss, but Claire sees Jamie is troubled. He says he has something to tell her and then a woman and young girl burst in on them. It’s Laoghaire McKimmie (Nell Hudson) and one of her daughters (she has two, Joan and Marsali.) Laoghaire calls Claire “Sassenach” and also a string of filthy curses, adding, “You’re supposed to be dead!”\n\nJamie talks to the little girl, Joanie, and tells her Claire is his first wife and that he thought she was dead but by the grace of God, she came back. Jamie says he tried to be a husband to the little girl’s ma but they didn’t have the bond he has with Claire. Jamie says he’ll always look after Joanie and her sister and they hug.\n\nA very upset Claire starts to gather her things while Jamie tries to explain the situation to her: the marriage to Laoghaire was a mistake, he’s not the father of her daughters, and he didn’t love Laoghaire. Jamie says, “You told me to be nice to her. She was a widow with two kids when we met.” Claire accuses Jamie of lying when he said he didn’t fall in love with anyone else. Jamie repeats he didn’t fall in love with Laoghaire, and he explains his cowardice about telling her about Laoghaire because he desperately wanted Claire to stay with him, especially because of how he fell apart when she left him. An indignant Claire shoots back, “LEFT YOU? You forced me to go back! I would’ve died gladly at Culloden with you.” Jamie starts to get angry and says she had to go back for Brianna’s sake and that just thinking of Claire lying in bed with Frank all those years made him angry. They start to tussle with each other and just as it starts to lead to some angry sex, Jenny interrupts and throws water on them.\n\nA shaken Claire is downstairs by the fire. Jenny’s daughter Maggie brings Claire a whiskey. Claire apologizes for disrupting the household. Maggie tells Claire that Jenny told her to tell Laoghaire that Jamie and Claire were in Lallybroch, and to ask her and the daughter to come to the house. Then Jenny walks in and Claire asks her point-blank why she did this. Jenny asks why Claire didn’t look for Jamie. Claire again says that she thought he was dead. Jenny says he was practically dead for a long time after he returned from Helwater. Claire says she’s come back to be part of this family and Jenny counters, “Well, family writes letters. Did you think we were frozen in time, waiting for you to return?” Claire tells Jenny she had another husband in America and that the marriage was mainly about survival. Jenny asks if Jamie knows about this and Claire says he does. Claire explains that when Frank died, she wanted to come back to visit Jamie’s grave and tell him she still loved him, then she found he was still alive. Jenny says she sees truth but feels that Claire is still holding something back and she can’t trust her.\n\nA little later, Jenny and Ian talk and he gently tells her not to stir the pot. He hears her prayers and knows she wants Jamie to be happy.\n\nThe next morning, outside the house, Claire tells Jamie she never should have come back. He says he wants to make things right and he’s still the same person she fell in love with decades ago. She tells him, “We can have secrets, but not lies.” He says, “I’ve only known one love in my life and that’s you.” Then Laoghaire shows up with a gun! She’s about to shoot Claire, Jamie protects Claire and the gun goes off and Jamie gets shot in the arm. Claire immediately springs into surgeon mode and tends to Jamie’s wounds, methodically digging the birdshot out of his arm with her tools. Jamie anesthetizes himself with whisky and then sleeps. When he wakes, Claire tells him his artery is intact and tells him to drink non-whisky liquids.\n\nClaire tells Jamie she’ll never see what he saw in Laoghaire. He says “She wasn’t toting a pistol then.” Claire is still angry at him.\n\nIn another flashback Jamie describes a holiday time when he returned from Helwater. He says he’d been away so long that he was a ghost. Jenny’s kids didn’t recognize him. He says, “I was here but I wasn’t home. I was lonely.” We see Joanie ask Jamie to dance as he stands alone in a dark corner of the room. He joins in and starts to dance and laugh.\n\nJamie tells Claire, “My heart felt lighter and I finally laughed for the first time since I was with you.” Joanie and her sister tell Jamie their ma is Mistress MacKimmie and Jamie’s eyes go wide. He tells Claire, “I found something to fill the hole in me. I wanted to be a father and husband, all the things I thought the future held for me when I was with you. All the things I had to forget when I said goodbye to you at the stones.” Claire asks how Jamie wound up living in Edinburgh. Jamie says there were days and weeks when Laoghaire wouldn’t speak to him and he didn’t mind because at least they weren’t fighting. She was also afraid of his touch and he thought it was because of her two previous husbands. So he moved to Edinburgh and sent money home.\n\nClaire notices Jamie is burning up with fever. She takes out her kit and gives him a shot of penicillin. Jamie is a little nervous when he sees the large needle.\n\nShe goes outside for air and talks to Jenny, saying she loves Jamie very much, never forgot him or the family, and she never stopped wearing her wedding ring. She asks Jenny for a second chance. When she goes back inside, Claire runs into Ned Gowan (Bill Paterson), who’s there to see Jamie. He’s so happy to see Claire, he starts to tear up. Ned tells them Laoghaire complained about Claire and there’s a way they can bring her up on charges for the gun incident. Jamie won’t turn the pistol over as he doesn’t want Joanie and Marsali to lose their mother. Ned tells Jamie that Laoghaire is asking for alimony in the amount of 20 pounds (two years wages) and money for the girls until they’re wed. A little later, Jenny and Ian ask Jamie where he thinks he’ll get that kind of money. Jamie tells them about the treasure on Silkies Island. Young Ian says he can swim to the island and get it, as Jamie’s wounded arm prevents him from doing so. Jamie says he’ll fence the treasure in Paris and asks to take Young Ian with him and Claire. Taking Jamie’s advice, Jenny agrees to this. Jamie promises they can trust him and Claire with Young Ian.\n\nYoung Ian swims to Silkies Island as Claire and Jamie watch from the opposite shore. Claire again tells Jamie that she’s having doubts about being there and recalls the full life she had in Boston and he had his life in Edinburgh. Jamie tells her, “That was naught compared to being your husband. You belong with me. We’re mated for life.”\n\nClaire and Jamie see a rowboat full of men then a larger ship near the island. Worried, they spot Young Ian on the island and start yelling at him to try and warn him. Young Ian retrieves the treasure box, but as he makes his way back to the water, a man stops him. Claire and Jamie fear for his life and but can only watch from afar, unable to help.\n\n“Outlander” is on Sundays at 8 p.m. on Starz.", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2017%2Ftv%2Fnews%2Foutlander-recap-season-3-episode-8-first-wife-1202607103%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202607103&comment_count=2", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pmcvariety.files.wordpress.com/2017/11/outlander-3x08.jpg?w=1000", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2017/11/outlander-3x08.jpg?w=1000", "keywords": [], "authors": ["Diane Gordon"], "canonical_link": "https://variety.com/2017/tv/news/outlander-recap-season-3-episode-8-first-wife-1202607103/", "title": "‘Outlander’ Recap: Claire is Relegated to ‘First Wife’ Status as Jamie Reveals Secret Marriage", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Jamie reveals he got married when Claire was in America and his new wife lashes out at them both in \"Outlander\" episode 3.08, \"First Wife.\"", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202607103, "author": "Diane Gordon", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-11-05T18:00:41"}, "pmc-tag": "Outlander", "title": "‘Outlander’ Recap: Claire is Relegated to ‘First Wife’ Status as Jamie Reveals Secret Marriage", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "‘Outlander’ Recap: Claire is Relegated to ‘First Wife’ Status as Jamie Reveals Secret Marriage", "url": "https://variety.com/2017/tv/news/outlander-recap-season-3-episode-8-first-wife-1202607103/", "description": "SPOILER ALERT: Do not read if you have not yet watched “First Wife,” the eighth episode of the third season of “Outlander.” Claire (Caitriona Balfe) and Jamie (Sam Heughan) …", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/11/outlander-3x08.jpg?w=1000", "width": 1000, "height": 563, "alt": "Outlander"}, "locale": "en_US"}, "article": {"published_time": "2017-11-06T02:00:41+00:00", "modified_time": "2017-11-06T02:00:43+00:00"}, "twitter": {"creator": "@Variety", "site": "@variety", "text": {"title": "‘Outlander’ Recap: Claire is Relegated to ‘First Wife’ Status as Jamie Reveals Secret Marriage"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/11/outlander-3x08.jpg?w=1000", "alt": "Outlander"}, "card": "summary_large_image", "title": "‘Outlander’ Recap: Claire is Relegated to ‘First Wife’ Status as Jamie Reveals Secret Marriage", "description": "Jamie reveals he got married when Claire was in America and his new wife lashes out at them both in \"Outlander\" episode 3.08, \"First Wife.\""}, "author": "Diane Gordon", "content_type": "Article", "post_id": 1202607103, "title": "'Outlander' Recap: Claire is Relegated to 'First Wife' Status as Jamie Reveals Secret Marriage", "published_at": "2017-11-05 18:00:41", "image": "https://pmcvariety.files.wordpress.com/2017/11/outlander-3x08.jpg?w=1000", "comment_count": 2, "tags": "Outlander", "topics": "News", "appeared_in_print": "No", "body": "SPOILER ALERT: Do not read if you have not yet watched \"First Wife,\" the eighth episode of the third season of \"Outlander.\"\r\n\r\nClaire (Caitriona Balfe) and Jamie (Sam Heughan) return to Lallybroch to bring young Ian (John Bell) home. Instead of a warm homecoming, Claire is met with suspicion and distrust by Jamie’s sister Jenny (Laura Donnelly). Then Jamie reveals the one thing he’s been reluctant to tell Claire: he got married while she was in America.\r\n\r\nWhen Jamie, Claire and young Ian arrive in Lallybroch, Jamie’s sister Jenny is stunned to see Claire, because she thought Claire long dead. She hugs Young Ian then gives him a whack for making her worry so much. Young Ian is mad they brought him home and tells Jenny about his job selling liquor, which makes his parents even more mad at Jamie. Jamie explains he watched over him like he was his own son and that everything was fine in Edinburgh until an agent of the Crown extorted him. Young Ian unhelpfully adds that Claire killed the agent. Claire explains the man attacked her and she was defending herself. Jamie adds that Jenny never complained when he was sending money to her. Ian (Steven Cree) hands Jamie a belt and tells him to punish Young Ian. Jamie tells them there are other ways to punish Young Ian, and he makes the lad work in the muck making patties.\r\n\r\nJamie apologizes to Ian for their worry about Young Ian. Claire meets Maggie’s young sons Angus and Anthony and as Jenny points out that 20 years have past, James Murray (also known as Jamie) comes downstairs holding a baby. He’s now married with five kids.\r\n\r\nJamie tells Jenny that Young Ian needs a taste of freedom, while she can still grant him that much. He says he knows what it’s like to be a 16 year old man living on a farm. Jenny counters that it’s a mortal sin to take another wife while his first wife still walks the earth. Jenny asks why Jamie didn’t share his grief years ago when he thought Claire was dead. He says he was prepared to die in battle at Culloden and that he hid Claire in a town and arranged for her to go to the colonies, then the town was attacked and he thought Claire died then, but she made it to the colonies. He does not mention time travel. Jenny tells Jamie that when he was taken away, they rode around looking for him, and that the Claire she knew then would never have stopped looking for Jamie.\r\n\r\nThat night, Jamie and Claire are talking before bedtime, and he suggests they settle in Lallybroch. Claire points out that living there would be difficult, given the fact that Jenny hates her. Claire suggests telling Jenny everything, including the part about time travel, or there will always be a wall between her and Jenny. Jamie doesn’t think that’s a good idea. He tells Claire he went searching for her when he escaped Dunsmuir to find the old man who allegedly knew about treasure near the prison. Jamie says when the old man mentioned “La Dame Blanche,” his heart leapt at the thought that Claire might still be alive.\r\n\r\nIn a flashback, Jamie recalls looking at Silkies Island, then swims to it, sees a broken-down castle, and walks around yelling “Claire.\" He then sees the Mackenzie crest etched into a stone and finds a box containing a treasure of coins and gems. He takes one large sapphire and re-buries the box.\r\n\r\nBack in their present, Claire asks why Jamie returned to the prison, and he says his fellow prisoners needed him. Jamie says he gave the sapphire to the prison governor. Claire tells Jamie, “I was out there somewhere, wishing you’d find me. I pretended birdsong was you talking to me.” They kiss, but Claire sees Jamie is troubled. He says he has something to tell her and then a woman and young girl burst in on them. It’s Laoghaire McKimmie (Nell Hudson) and one of her daughters (she has two, Joan and Marsali.) Laoghaire calls Claire “Sassenach” and also a string of filthy curses, adding, “You’re supposed to be dead!”\r\n\r\nJamie talks to the little girl, Joanie, and tells her Claire is his first wife and that he thought she was dead but by the grace of God, she came back. Jamie says he tried to be a husband to the little girl’s ma but they didn’t have the bond he has with Claire. Jamie says he’ll always look after Joanie and her sister and they hug.\r\n\r\nA very upset Claire starts to gather her things while Jamie tries to explain the situation to her: the marriage to Laoghaire was a mistake, he’s not the father of her daughters, and he didn’t love Laoghaire. Jamie says, “You told me to be nice to her. She was a widow with two kids when we met.” Claire accuses Jamie of lying when he said he didn’t fall in love with anyone else. Jamie repeats he didn’t fall in love with Laoghaire, and he explains his cowardice about telling her about Laoghaire because he desperately wanted Claire to stay with him, especially because of how he fell apart when she left him. An indignant Claire shoots back, “LEFT YOU? You forced me to go back! I would’ve died gladly at Culloden with you.” Jamie starts to get angry and says she had to go back for Brianna’s sake and that just thinking of Claire lying in bed with Frank all those years made him angry. They start to tussle with each other and just as it starts to lead to some angry sex, Jenny interrupts and throws water on them.\r\n\r\nA shaken Claire is downstairs by the fire. Jenny’s daughter Maggie brings Claire a whiskey. Claire apologizes for disrupting the household. Maggie tells Claire that Jenny told her to tell Laoghaire that Jamie and Claire were in Lallybroch, and to ask her and the daughter to come to the house. Then Jenny walks in and Claire asks her point-blank why she did this. Jenny asks why Claire didn’t look for Jamie. Claire again says that she thought he was dead. Jenny says he was practically dead for a long time after he returned from Helwater. Claire says she’s come back to be part of this family and Jenny counters, “Well, family writes letters. Did you think we were frozen in time, waiting for you to return?” Claire tells Jenny she had another husband in America and that the marriage was mainly about survival. Jenny asks if Jamie knows about this and Claire says he does. Claire explains that when Frank died, she wanted to come back to visit Jamie’s grave and tell him she still loved him, then she found he was still alive. Jenny says she sees truth but feels that Claire is still holding something back and she can’t trust her.\r\n\r\nA little later, Jenny and Ian talk and he gently tells her not to stir the pot. He hears her prayers and knows she wants Jamie to be happy.\r\n\r\nThe next morning, outside the house, Claire tells Jamie she never should have come back. He says he wants to make things right and he’s still the same person she fell in love with decades ago. She tells him, “We can have secrets, but not lies.” He says, “I’ve only known one love in my life and that’s you.” Then Laoghaire shows up with a gun! She’s about to shoot Claire, Jamie protects Claire and the gun goes off and Jamie gets shot in the arm. Claire immediately springs into surgeon mode and tends to Jamie’s wounds, methodically digging the birdshot out of his arm with her tools. Jamie anesthetizes himself with whisky and then sleeps. When he wakes, Claire tells him his artery is intact and tells him to drink non-whisky liquids.\r\n\r\nClaire tells Jamie she’ll never see what he saw in Laoghaire. He says “She wasn’t toting a pistol then.” Claire is still angry at him.\r\n\r\nIn another flashback Jamie describes a holiday time when he returned from Helwater. He says he’d been away so long that he was a ghost. Jenny’s kids didn’t recognize him. He says, “I was here but I wasn’t home. I was lonely.” We see Joanie ask Jamie to dance as he stands alone in a dark corner of the room. He joins in and starts to dance and laugh.\r\n\r\nJamie tells Claire, “My heart felt lighter and I finally laughed for the first time since I was with you.” Joanie and her sister tell Jamie their ma is Mistress MacKimmie and Jamie’s eyes go wide. He tells Claire, “I found something to fill the hole in me. I wanted to be a father and husband, all the things I thought the future held for me when I was with you. All the things I had to forget when I said goodbye to you at the stones.” Claire asks how Jamie wound up living in Edinburgh. Jamie says there were days and weeks when Laoghaire wouldn’t speak to him and he didn’t mind because at least they weren’t fighting. She was also afraid of his touch and he thought it was because of her two previous husbands. So he moved to Edinburgh and sent money home.\r\n\r\nClaire notices Jamie is burning up with fever. She takes out her kit and gives him a shot of penicillin. Jamie is a little nervous when he sees the large needle.\r\n\r\nShe goes outside for air and talks to Jenny, saying she loves Jamie very much, never forgot him or the family, and she never stopped wearing her wedding ring. She asks Jenny for a second chance. When she goes back inside, Claire runs into Ned Gowan (Bill Paterson), who’s there to see Jamie. He’s so happy to see Claire, he starts to tear up. Ned tells them Laoghaire complained about Claire and there’s a way they can bring her up on charges for the gun incident. Jamie won’t turn the pistol over as he doesn’t want Joanie and Marsali to lose their mother. Ned tells Jamie that Laoghaire is asking for alimony in the amount of 20 pounds (two years wages) and money for the girls until they’re wed. A little later, Jenny and Ian ask Jamie where he thinks he’ll get that kind of money. Jamie tells them about the treasure on Silkies Island. Young Ian says he can swim to the island and get it, as Jamie’s wounded arm prevents him from doing so. Jamie says he’ll fence the treasure in Paris and asks to take Young Ian with him and Claire. Taking Jamie’s advice, Jenny agrees to this. Jamie promises they can trust him and Claire with Young Ian.\r\n\r\nYoung Ian swims to Silkies Island as Claire and Jamie watch from the opposite shore. Claire again tells Jamie that she’s having doubts about being there and recalls the full life she had in Boston and he had his life in Edinburgh. Jamie tells her, “That was naught compared to being your husband. You belong with me. We’re mated for life.”\r\n\r\nClaire and Jamie see a rowboat full of men then a larger ship near the island. Worried, they spot Young Ian on the island and start yelling at him to try and warn him. Young Ian retrieves the treasure box, but as he makes his way back to the water, a man stops him. Claire and Jamie fear for his life and but can only watch from afar, unable to help.\r\n\r\n\"Outlander\" is on Sundays at 8 p.m. on Starz.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1509933641.0, "source": "https://variety.com", "summary": ""}