{"url": "https://www.thewrap.com/riverdale-showrunner-on-archies-fate-after-whirlwind-trial-in-season-3-premiere/", "text": "(Warning: Spoilers ahead for the Season 3 premiere of “Riverdale,” titled “Labor Day”)\n\nSay it ain’t so, Archie!\n\nThe return of “Riverdale” was an emotional rollercoaster for fans, as the Season 3 premiere saw Archie hauled off to juvenile detention with a two-year sentence after pleading guilty to a murder he did not commit. Ever the hero, Archie accepted the prosecutor’s deal for a lessened sentence even though his trial resulted in a hung jury. The boy-next-door doesn’t want to put his parents and friends through that again!\n\nShowrunner Roberto Aguirre-Sacasa told TheWrap in an interview ahead of the premiere that we’re out of the courtroom for the season, but now everyone will be working together to try to free Archie. He also said that he was inspired by classic noir films like “Shawshank Redemption” for scenes in which Archie is behind bars.\n\nAlso Read: 'Riverdale' Finally Casts Its Gladys and Jellybean\n\nAguirre-Sacasa also quelled our fears about Betty, who was left seizing on her porch at the end of the episode.\n\n“Betty’s very good at throwing herself into projects,” he said, adding that she and Jughead will be teaming up and focusing on the Gargoyle King mystery. “That’s one of the big mysteries, is are the seizures connected to the Gargoyle King? What is the Gargoyle King exactly?”\n\nSee our interview with Aguirre-Sacasa below.\n\nTheWrap: You’ve said that Season 3 won’t be too heavy on the courtroom stuff with Archie. Now that he’s pled guilty and he’s in juvenile detention, what can you say about his fate?\n\nAguirre-Sacasa: “That’s it for the trial stuff. We are definitely going to see Archie in juvenile detention. You know, we always do kind of noir and crime stuff, and we wanted to do some — there are some great, obviously, classic noirs that are set in prisons and jails, so we wanted to do sort of like almost an homage to “Shawshank Redemption,” which is one of my favorite movies. And yeah, on the outside, we’re definitely going to see everyone working to get Archie out. Especially Veronica, who doesn’t want to be separated from her man.”\n\nAlso Read: Why Sabrina Didn't End up on 'Riverdale' -- Or on the Big Screen\n\nSpeaking of Veronica, she tells her dad in this episode, “You have no daughter.” So how is that going to affect the Lodge family? Hermione especially, dealing with this crazy family life and mayoral duties.\n\n“Hermione’s definitely caught between the two of them. And you know, Veronica and Hiram, they did fight last year, but Veronica’s always been kind of a Daddy’s Girl, and I think in Season 3 we really see her stop being that, and start being a real rival to her father. Last year, it was all about Hiram and Archie, and this year it’s all about Veronica and Hiram.”\n\nAnother character I wanted to ask you about is Betty. We find out she’s been lying and hiding drugs all summer, and really avoiding the trauma from Season 2 — and then the episode ends with her having a seizure! How might this affect the rest of the season?\n\n“I think you know, the good thing about this season is that after the premiere, we have a great murder mystery and a great sort of mystery and you know, shocking crime for Betty and Jughead to investigate. So Betty’s very good at throwing herself into projects. So she’s going to throw herself into that. And she’s also going to throw herself into helping her mom, who is getting deeper and deeper into this place called the farm.”\n\nYes — and in the trailer we saw the Gargoyle King right behind Betty. So is that related to the end scene when she is seizing and having this crazy vision of the babies floating?\n\n“One aspect of this season is we’re going to see how all these things tie together — or if they do. And that’s one of the big mysteries, is are the seizures connected to the Gargoyle King? What is the Gargoyle King exactly?”\n\nAlso Read: 'Riverdale' Star Lili Reinhart on Her 'Twin Peaks' Inspiration for Season 3's Flashback Episode\n\nI know you said you’ve been inspired by the first season of “True Detective.”\n\n“Totally.”\n\nWhat I’m interested in is this game that Dilton and Ben are playing. What can you tell us about this game? Will that be part of the mystery?\n\n“That’s a really big aspect of the season. You know, when I was a kid, or when I was a teenager, Dungeons & Dragons was huge. It was kind of when it first really broke out. And a lot of adults and parents were against Dungeons & Dragons because they thought it like led to Satanism and murder and suicide and cult behavior. So Griffins & Gargoyles is sort of Riverdale’s version of Dungeons & Dragons. How the game fits into all of this is also sort of part of this ‘True Detective’-like mystery.”\n\nWe also in the premiere see the return of the Ghoulies when the Serpents are trying to save Hot Dog. How much will that rivalry play into the rest of the season?\n\n“It felt like last year we did a lot of stuff with the Serpents, and we did a significant amount of stuff with the Ghoulies. You know, Jughead is the Serpent King, Betty is the Serpent Queen. The Serpents are definitely in conflict with other gangs. That’s a world that we’re not leaving behind, but I’d say that Betty and Jughead are mostly focused on the mystery at first.”\n\nAlso Read: 'Riverdale': There's a Creepy New Mystery Promised in the New Season 3 Teaser (Video)\n\nAnd then I had a question for you just about your day-to-day. How has it been balancing “Riverdale” and “Chilling Adventures of Sabrina”?\n\n“Brutal! Brutal, brutal, brutal. I mean listen, you know, I’m not gonna lie, it’s been exhausting and challenging and I don’t have weekends anymore and I don’t sleep. But I love the shows, so it’s easy to kind of throw myself into it. I have such great writing staffs, they make it possible. And really it’s like two groups of, two teams working at the best of their, at the top of their game. So that’s why it’s possible.”\n\nWe know not to expect a crossover at least anytime soon, but when working on two shows at the same time, do you find that an idea you had for “Riverdale” might not work there, but on “Sabrina” instead, or vice versa?\n\n“That’s a really good question. Yeah, you know there’s always a little bit of cross-pollination that way. I will say that the shows are — because the genre is different, one is horror and one is pulpy crime, there’s not tons of overlap. But I think there’s no denying that they’re both products of their time. And you know, that they kind of refract what I’m thinking about and what the writers are thinking about. But they’re pretty distinct, I would say.”\n\nWe finally got to learn about the Gladys and Jellybean casting during New York Comic-Con over the weekend, which I know was exciting for fans.\n\n“Yeah, absolutely.”\n\nAlso Read: 'Riverdale' Casts Anthony Michael Hall as Principal for 'Breakfast Club' Inspired Flashback Episode\n\nHave they been on set already? What can you tease about how they’ll fit in?\n\n“We just shot their first episode, and they’re amazing. I love them. I love them I love them I love them. They’re great. You know, Gina Gershon is an icon obviously, and she’s been in two of my favorite crime movies. She was in a movie called “Killer Joe” and she was also in one of the great modern pulp noirs, “Bound,” which I love. And she knew Skeet [Ulrich] — it’s amazing. And Trinity, who plays Jellybean, she’s great.”\n\nAnd how will Betty get along with Jellybean and Gladys?\n\n“Very good question. Probably not well, right?”\n\nDuring our interview at TCA this summer, we talked about another musical episode happening in Season 3. Have you narrowed down which musical yet?\n\n“I definitely still want to do it, it’s obviously one of my — it’s such a fan favorite episode, and we all love it. You know, we haven’t narrowed it down yet. We have a list, a running list, but it really has to be the perfect musical at the perfect time for it to work, or else it just won’t be as good as last season. And kind of no one wants that, you know what I mean?”\n\nYeah. So we talked about “True Detective,” you mentioned “Shawshank Redemption,” and obviously the flashback episode is inspired by “The Breakfast Club” — what, if any, other pop culture or pulp crime touchstones did you draw inspiration from for this season?\n\n“We’re definitely, you know for Veronica… she says in the [Season 2] finale, she said she’s opening a speakeasy. And we’re really like… there are a couple of homages to like the movie “Casino,” a little bit younger, the Tom Cruise movie “Risky Business.” We’ve got some… You know the movie “Cabaret” or the musical “Cabaret” is obviously another inspiration. So we’re going to add a little bit of showbiz glamour to Riverdale with the speakeasy.”\n\n“Riverdale” airs Wednesdays at 8 p.m. on The CW.", "images": ["https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/newsletter-icon.svg", "https://www.thewrap.com/wp-content/uploads/2018/10/RVD301b_0217b.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo-white.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-wrappro-white.svg", "https://www.thewrap.com/wp-content/uploads/2018/10/Archie-Sabrina-160x105.png", "https://www.thewrap.com/wp-content/uploads/2020/04/laura-bush-michelle-obama-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-pro-free.svg", "https://www.thewrap.com/wp-content/uploads/2020/01/Issue-4_DTTW_Portfolio_COVER-1.png", "https://www.thewrap.com/wp-content/uploads/2020/04/white-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2020/04/browse.jpg", "https://www.thewrap.com/wp-content/uploads/2020/01/NUP_189951_0317-2.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/wrap-logo.png", "https://www.thewrap.com/wp-content/uploads/2018/04/bill-cosby-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/memberships/user_icon_white.svg", "https://www.thewrap.com/wp-content/uploads/2018/09/riverdale-lili-reinhart-twin-peaks-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2018/10/GenaGershonTrinityLikinsRiverdale-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2017/03/GettyImages-52741361-160x105.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=8498827&cv=2.0&cj=1", "https://www.thewrap.com/wp-content/uploads/2018/08/dfsdfdsf-160x105.png", "https://pixel.quantserve.com/pixel/p-8flXM--ZHulLQ.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/arw-rt.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/get-more.svg", "https://www.thewrap.com/wp-content/uploads/2020/04/Dwayne-Johnson-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/email-icon.png", "https://www.thewrap.com/wp-content/uploads/2017/05/Cannes-1.jpg", "https://www.thewrap.com/wp-content/uploads/2017/10/RVD111b_0159b.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/first-take.png", "https://www.thewrap.com/wp-content/plugins/contextual-links/assets/img/loading.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/logo-signup.png", "https://www.thewrap.com/wp-content/uploads/2020/04/riot.gif"], "top_img": "https://www.thewrap.com/wp-content/uploads/2018/10/RVD301b_0217b.jpg", "keywords": [], "authors": ["Ashley Boucher", "Rosemary Rossi", "Daniel Goldblatt", "Trey Williams"], "canonical_link": "https://www.thewrap.com/riverdale-showrunner-on-archies-fate-after-whirlwind-trial-in-season-3-premiere/", "title": "'Riverdale' Showrunner on Archie's Fate After That Whirlwind Trial", "meta_data": {"parsely-title": "‘Riverdale’ Showrunner on Archie’s Fate After That Whirlwind Trial in the Season 3 Premiere", "parsely-link": "https://www.thewrap.com/riverdale-showrunner-on-archies-fate-after-whirlwind-trial-in-season-3-premiere/", "parsely-type": "post", "parsely-pub-date": "2018-10-10T18:02:14-07:00", "parsely-section": "tv", "parsely-author": "Ashley Boucher", "parsely-tags": "camila-mendes, cole-sprouse, kj-apa, lili-reinhart, riverdale, roberto_aguirre-sacasa, the_cw", "viewport": "initial-scale=1.0, maximum-scale=6.0, user-scalable=yes", "description": "Showrunner Roberto Aguirre-Sacasa told TheWrap that we're out of the courtroom for the season, but everyone still wants to free Archie.", "news_keywords": "camila mendes, cole sprouse, kj apa, lili reinhart, riverdale, roberto aguirre-sacasa, the cw", "original-source": "https://www.thewrap.com/riverdale-showrunner-on-archies-fate-after-whirlwind-trial-in-season-3-premiere/", "og": {"locale": "en_US", "type": "article", "title": "'Riverdale' Showrunner on Archie's Fate After That Whirlwind Trial", "description": "Showrunner Roberto Aguirre-Sacasa told TheWrap that we're out of the courtroom for the season, but everyone still wants to free Archie.", "url": "https://www.thewrap.com/riverdale-showrunner-on-archies-fate-after-whirlwind-trial-in-season-3-premiere/", "site_name": "TheWrap", "updated_time": "2018-10-11T13:21:24-07:00", "image": {"identifier": "https://www.thewrap.com/wp-content/uploads/2018/10/RVD301b_0217b.jpg", "secure_url": "https://www.thewrap.com/wp-content/uploads/2018/10/RVD301b_0217b.jpg", "width": 618, "height": 412}}, "article": {"publisher": "http://facebook.com/thewrap", "tag": "the CW", "section": "TV", "published_time": "2018-10-11T01:02:14-07:00", "modified_time": "2018-10-11T13:21:24-07:00"}, "fb": {"app_id": 228236404181023, "pages": 48941893663}, "twitter": {"card": "summary_large_image", "description": "Showrunner Roberto Aguirre-Sacasa told TheWrap that we're out of the courtroom for the season, but everyone still wants to free Archie.", "title": "'Riverdale' Showrunner on Archie's Fate After That Whirlwind Trial", "site": "@thewrap", "image": "https://www.thewrap.com/wp-content/uploads/2018/10/RVD301b_0217b.jpg", "creator": "@thewrap"}, "generator": "WooFramework 6.2.0", "sailthru.title": "‘Riverdale’ Showrunner on Archie’s Fate After That Whirlwind Trial in the Season 3 Premiere", "sailthru.date": "2018-10-11T01:02:14+00:00", "sailthru.author": "Ashley Boucher", "sailthru.tags": "the cw,roberto aguirre-sacasa,riverdale,cole sprouse,lili reinhart,camila mendes,kj apa", "sailthru.category": "tv", "sailthru.image.full": "https://www.thewrap.com/wp-content/uploads/2018/10/RVD301b_0217b.jpg", "sailthru.image.thumb": "https://www.thewrap.com/wp-content/uploads/2018/10/RVD301b_0217b-150x150.jpg", "wp-parsely_version": "1.12.1", "google-site-verification": "-PpFSIrGHybVDxbndrL6MCngw3j6BXdy0xDVBVVOacI"}, "movies": [], "publish_date": 1539244934.0, "source": "https://www.thewrap.com", "summary": ""}