{"url": "https://www.bustle.com/p/mindy-kalings-daughters-middle-name-beautifully-honors-her-mother-7654673", "text": "If you cried tears of joy over reports that Mindy Kaling had her baby, then you better grab some more tissues. Kaling's daughter's middle name has been reported, and, well, you're going to shed even more tears once you hear it. According to a birth certificate The Blast and Entertainment Tonight reportedly obtained, the creator and former star of The Mindy Project named her baby girl Katherine Swati Kaling.\n\nNow, here's why Swati is such a special name — it is the first name of Kaling's late mother, Swati Roysircar, who died in 2012 from pancreatic cancer. Kaling and her mother had an amazing relationship, and one that the multi-hyphenate has talked about on multiple occasions.\n\nIn November 2013, Lena Dunham interviewed Kaling for RollingStone.com. After the Girls creator asked Kaling about her role model in life, the Office actor said, \"I would say that my mother is the single biggest role model in my life, but that term doesn't seem to encompass enough when I use it about her. She was the love of my life.\"\n\nSo much so that Kaling's Mindy Project character, Dr. Mindy Lahiri, was loosely based on her mom, who was an OB/GYN. Actually, Roysircar died on Jan. 30, 2012, the same day Fox picked up The Mindy Project. \"I'm not superstitious,\" Kaling told Good Housekeeping in January 2015, \"but I think my mom had some part in it.\" She added, \"My mom was my soul mate.\"\n\nIf all of that didn't make you weep, get ready for this. While chatting with Us Weekly in September, Mindy Project's Ed Weeks said about Kaling having a baby, \"The show started as a tribute to her mother, who very sadly passed away just as the show [was] being picked up.\" The fact that Kaling got pregnant with her own daughter during the final season of her show made it all the more meaningful. Weeks continued, \"When she reminded us all of that, we all cried in the final table read. I mean Jesus, life! It makes some very interesting and beautiful patterns sometimes.\"\n\nThe way Kaling has reportedly chosen to honor her mother is truly wonderful. Even though her daughter won't ever personally know her grandmother, she can walk around knowing she's keeping Roysircar's spirit alive by having her first name as her middle name.\n\nIt was reported by E! News Tuesday that Kaling gave birth to her first child. (At the time of the report, Bustle reached out to Kaling's rep for comment, but did not receive an immediate response.)\n\nWhen Kaling confirmed her pregnancy to Today in August, she said, \"It’s so unknown to me. I have a lot of control over a lot of aspects of my life, and this is one where I’m like, 'OK, it’s out of my hands,' which is kind of a fun feeling.\" She, then, of course, brought up her mom. \"My mom was incredibly fierce and so devoted to us, just loved us and really wanted us to be happy no matter what we did.\" She continued, \"My career choice was not something that she was familiar with and she was just so supportive of that. And if I could give that to my child, just that open-mindedness, I’d be so happy.\"\n\nBased on the relationship Kaling had with her own mother, there's no doubt she and her daughter will share the same bond.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/15/37f4f60e-5d87-4523-9a7d-39f782b3c0e4-getty-1209799355.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/15/0301616f-a32f-413e-9fef-efe48242f292-getty-537759406.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/17/436a4d24-0503-4050-a54f-0367f1974937-getty-919969056.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2017/12/20/1f5cb901-ea11-4f3a-a950-8802bc257f43-getty-823660356.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2017/12/20/1f5cb901-ea11-4f3a-a950-8802bc257f43-getty-823660356.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2020/4/14/140f13e5-57be-4d8b-913a-b3ee39ca0dfd-getty-122716729.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70"], "top_img": "https://imgix.bustle.com/uploads/getty/2017/12/20/1f5cb901-ea11-4f3a-a950-8802bc257f43-getty-823660356.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/mindy-kalings-daughters-middle-name-beautifully-honors-her-mother-7654673", "title": "Mindy Kaling's Daughter's Middle Name Beautifully Honors Her Mother", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/mindy-kalings-daughters-middle-name-beautifully-honors-her-mother-7654673", "type": "article", "title": "The Middle Name Mindy Kaling Gave Her Daughter Might Make You Tear Up", "description": "If you cried tears of joy over reports that Mindy Kaling had her baby, then you better grab some more tissues. Kaling's daughter's middle name has been reported, and, well, you're going to shed even more tears once you hear it. According to a birth…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2017/12/20/1f5cb901-ea11-4f3a-a950-8802bc257f43-getty-823660356.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "If you cried tears of joy over reports that Mindy Kaling had her baby, then you better grab some more tissues. Kaling's daughter's middle name has been reported, and, well, you're going to shed even more tears once you hear it. According to a birth…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}