{"url": "http://www.usanetwork.com/suits/blog/suits-returns-this-march-says-goodbye-to-two-beloved-characters-and-confirms-season-8", "text": "Big news day, Suitors! You might want to clear your afternoon for this one...\n\nUSA Network and Universal Cable Productions announced today that Suits has been renewed for an eighth season. Show creator and executive producer Aaron Korsh is set to return, as are stars Gabriel Macht as Harvey Specter, Sarah Rafferty as Donna Paulsen, Rick Hoffman as Louis Litt, and newly-minted series regular Dulé Hill as Alex Williams.\n\nREAD MORE: Katherine Heigl Joins Suits Season 8 as Series Regular\n\nAdditionally, the network announced that the back half of Suits’ Season 7 will premiere on Wednesday, Mar. 28 at 9/8c, culminating in a 2-hour season finale on Wednesday, April 25 -- an arc in which Suits says goodbye to characters Mike Ross (Patrick J. Adams) and Rachel Zane (Meghan Markle).\n\n“After seven seasons, Suits remains one of USA Network’s most beloved and popular series,” said Chris McCumber, President, Entertainment Networks, NBCUniversal Cable Entertainment. “While we’re excited for Season 8, everyone at USA will deeply miss Patrick and Meghan, and are grateful for the talent and commitment they brought to Suits season after season. We wish each of them nothing but the very best.”\n\nSaid Suits creator Korsh: \"I would like to thank Patrick and Meghan for their extraordinary contributions over the last seven years. Not only have they been outstanding in their roles as Mike and Rachel, they are also superb human beings who will always be beloved members of the Suits family, and we wish them well in their days to come.” The showrunner continued: “Speaking of days to come, I am incredibly excited to welcome back our phenomenal crew and cast -- Gabriel, Sarah, Rick and Dulé -- who will continue the roller coaster ride with all of our amazing fans. Season 8 will have everything from shifting alliances and internal power plays, to secrets, betrayals and fiery relationships. Keep an eye out for an adversarial new character that will give Harvey a run for his money.”\n\nAdams, whose character has evolved from small-time criminal to one of New York's sharpest legal minds, released a statement about leaving Suits after seven seasons in which he said: \"Mike Ross has taught me a lot about commitment, hard work and the power of believing in yourself and I feel blessed that now we both get to walk out into the lives that we never dreamed we would actually be lucky enough to live.\" [Read Adams's full statement here.] News of Markle's departure was announced in November, following her engagement to Prince Harry.\n\nSuits began when legendary hotshot lawyer Harvey Specter took a gamble by hiring Mike Ross, a brilliant, but not-so-legitimate college dropout, as an associate at his prolific Manhattan law firm. Nearly seven seasons later, this dynamic duo -- along with Louis, Donna and Rachel -- have become a family intertwined in one another’s triumphs and tribulations.\n\nWhen the back half of season seven returns, Harvey must deal with the aftermath of Jessica (Gina Torres) losing her license, while trying to process how the kiss with Donna will affect his relationship with Paula (Christina Cole). Mike tries to juggle his commitment to the firm, his passion for pro bono work, and his engagement to Rachel. All the while, Louis struggles with right and wrong as his torrid affair with Sheila (Rachael Harris) deepens.\n\nHere's a first look at season 7.5, when it returns on March 28!", "images": ["https://www.usanetwork.com/sites/usanetwork/files/2018/01/NUP_178666_0134.JPG", "http://www.usanetwork.com/sites/usanetwork/modules/contrib/lazyloader/loader/loader-7.gif"], "top_img": "https://www.usanetwork.com/sites/usanetwork/files/2018/01/NUP_178666_0134.JPG", "keywords": [], "authors": [], "canonical_link": "https://www.usanetwork.com/suits/blog/suits-returns-this-march-says-goodbye-to-two-beloved-characters-and-confirms-season-8", "title": "Suits Returns This March, Says Goodbye to Two Beloved Characters and Confirms Season 8", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no", "fb": {"app_id": 241079750077}, "description": "USA Network and Universal Cable Productions announced today that Suits has been renewed for an eighth season. Additionally, the network announced that the back half of Suits’ Season 7 will premiere in March and end with a two-hour finale that says goodbye to characters Mike Ross (Patrick J. Adams) and Rachel Zane (Meghan Markle).", "generator": "Drupal 7 (http://drupal.org)", "og": {"site_name": "USA Network", "type": "article", "url": "https://www.usanetwork.com/suits/blog/suits-returns-this-march-says-goodbye-to-two-beloved-characters-and-confirms-season-8", "title": "Suits Returns This March, Says Goodbye to Two Beloved Characters and Confirms Season 8 | Blog | USA Network", "description": "USA Network and Universal Cable Productions announced today that Suits has been renewed for an eighth season. Additionally, the network announced that the back half of Suits’ Season 7 will premiere in March and end with a two-hour finale that says goodbye to characters Mike Ross (Patrick J. Adams) and Rachel Zane (Meghan Markle).", "updated_time": "2018-03-27T18:58:48-04:00", "image": "https://www.usanetwork.com/sites/usanetwork/files/2018/01/NUP_178666_0134.JPG"}, "twitter": {"site": "@USA_Network", "url": "https://www.usanetwork.com/suits/blog/suits-returns-this-march-says-goodbye-to-two-beloved-characters-and-confirms-season-8", "title": "Suits Returns This March, Says Goodbye to Two Beloved Characters and Confirms Season 8", "description": "USA Network and Universal Cable Productions announced today that Suits has been renewed for an eighth season. Additionally, the network announced that the back half of Suits’ Season 7 will premiere in March and end with a two-hour finale that says goodbye to characters Mike Ross (Patrick J. Adams) and Rachel Zane (Meghan Markle)."}, "article": {"published_time": "2018-01-30T14:24:33-05:00", "modified_time": "2018-03-27T18:58:48-04:00"}}, "movies": [], "publish_date": 1517340273.0, "source": "http://www.usanetwork.com", "summary": ""}