{"url": "https://smarttan.com/news/index.php/norvell-presents-dancing-with-the-stars-product-line/", "text": "Norvell, an industry leader in self-tanning, is working with ABC on the new ‘Dancing with the Stars’ Sunless Tanning Collection. Designed to provide flawless, foolproof bronzing at home, the quartet of products will waltz onto the shelves of spas and salons just in time for the 19th season of ‘Dancing with the Stars,’ premiering Monday, September 15th, 2014 at 8:00 PM ET/PT on ABC.\n\n‘Dancing with the Stars’ has infused ballroom dancing with an unprecedented entertainment factor; turning salsa and sequins into appointment television. But it’s not just the moves, the costumes and the drama that dazzle millions of ‘Dancing with the Stars’ viewers each week. Gorgeous bronzed limbs are a big part of presentation. No matter their dance scores, contestants always win big with their professional spray tans.\n\nStarting now, getting a “ten” from at-home self-tanning is as simple as picking the right partner — Dancing with the Stars Sunless Collection by Norvell. That’s because Norvell has done all the fancy footwork for consumers, putting its extensive knowledge of the art and science of sunless tanning into each and every bottle. “There’s no doubt that ‘Dancing with the Stars’ has been a driving force in the rapid growth of sunless tanning, one of the beauty industry’s hottest categories,” said Rick Norvell, president of the family owned, Tennessee-based company that has led the U.S. professional spray tanning industry for more than 20 years. “We’re excited to partner with the show to help consumers get that healthy, bronzed just-off-the-beach look they love…at home.”\n\nThe Dancing with the Stars Sunless Collection by Norvell features four skin-healthy formulas that go on gracefully, creating a natural and flawless self-tan – no technique or training required. Like all Norvell products they are vegan, free of parabens, sulfates and gluten, and are conceived, formulated, manufactured, distributed and sold exclusively by Norvell.\n\nThe products included in this line are:\n\nPERFECTION self tanning mousse : This lightweight, velvety mousse glides as easily over the skin as a dancer skims the ballroom floor, creating an instant, long-lasting bronze finish. Talk about a quick-step. Fragrance: CocoNilla. 8 fl. 0z. MSRP $37.95\n\n: This lightweight, velvety mousse glides as easily over the skin as a dancer skims the ballroom floor, creating an instant, long-lasting bronze finish. Talk about a quick-step. Fragrance: CocoNilla. 8 fl. 0z. MSRP $37.95 PERFORMANCE self tanning airbrush spray : Ready to tango? This micro-fine mist delivers an all-over flawless tan deserving of a perfect ten. Self-tanning skeptics will be won over by this product’s advanced spray technology, and the professional results will have them coming back for encore after encore. Fragrance: CocoNilla. 7 fl. Oz MSRP $37.95.\n\n: Ready to tango? This micro-fine mist delivers an all-over flawless tan deserving of a perfect ten. Self-tanning skeptics will be won over by this product’s advanced spray technology, and the professional results will have them coming back for encore after encore. Fragrance: CocoNilla. 7 fl. Oz MSRP $37.95. ENDURANCE color boosting skin perfector : This multi-purpose body balm is a win-win, delivering instant skin illumination and a gradual build to a show-stopping bronze. But the carefully choreographed formula does even more. Offering the skincare benefits of a CC (color correcting) cream, Endurance also moisturizes, brightens, and firms – all while evening skin tone and extending self-tanning color results. Could a mirror-ball trophy be far behind?\n\n: This multi-purpose body balm is a win-win, delivering instant skin illumination and a gradual build to a show-stopping bronze. But the carefully choreographed formula does even more. Offering the skincare benefits of a CC (color correcting) cream, also moisturizes, brightens, and firms – all while evening skin tone and extending self-tanning color results. Could a mirror-ball trophy be far behind? DAZZLE shimmering mist: Sparkle, shimmer and shine like the stars with this super-fine shimmering spray! There’s no better way to accent the hottest tan in town. Spritz it all over, use it as an accent, or mist it onto hair to add a little glitz and glamour to your day. Fragrance; Fresh Scent 4 fl. Oz. MSRP $14.95.\n\nFor further information, or to locate a salon, spa or retailer in your areas, please visit www.NorvellSunless.com.", "images": ["https://www.facebook.com/tr?id=301431344021711&ev=PageView&noscript=1", "https://smarttan.com/images/social-twitter.png", "https://smarttan.com/images/social-fb.png", "http://smarttan.com/news/wp-content/uploads/2014/09/Norvell-Dancing2.jpg", "https://smarttan.com/images/index/tanningtruth.gif", "https://smarttan.com/images/social-rss.png", "https://smarttan.com/images/social-youtube.png", "https://smarttan.com/images/index/wearesunshine.gif", "https://smarttan.com/images/header_logo.png"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "https://smarttan.com/news/index.php/norvell-presents-dancing-with-the-stars-product-line/", "title": "Norvell Presents \"Dancing With The Stars\" Product Line", "meta_data": {"generator": "WordPress 5.3.2"}, "movies": [], "publish_date": null, "source": "https://smarttan.com", "summary": ""}