{"url": "www.thecut.com/2018/05/british-royals-secret-social-media-accounts.html", "text": "Cheerio! Photo: Emily Sundberg\n\nRoyal Inquiries is your comprehensive guide to everything you ever wanted to know about life under the crown.\n\nAs a world-famous royal expert — who happens to be the exact same height as Queen Elizabeth, not to brag — I’m aware that all British royals absolutely love two things: (1) fancy hats, and (2) social media.\n\nEven though Meghan Markle had to cleanse her personal social-media accounts — and delete her lifestyle blog — before her upcoming May 19 wedding to Prince Harry, it’s known that many royals have social-media presences. Some accounts are public; others are super secretive, but by god, they exist.\n\nSo, which royals have secret accounts? Why, I’m so glad you asked! Here, let’s go through the list of my favorite British royal adults and I’ll break it all down for you.\n\nQueen Elizabeth II. Photo: Stuart C. Wilson/Getty Images\n\nRoyal: Queen Elizabeth II\n\nPublic social-media account?: Yes, @RoyalFamily\n\nSecret social-media account?: Yes!!!!!! Reportedly\n\nWhat’s the deal?: Queen Elizabeth, my sister in height, apparently has a super-secret Facebook account, can you believe it? According to the British tabloids, the queen has a personal iPad and laptop, loves to text, and even has a clandestine Facebook.\n\nKate Middleton. Photo: Chris Jackson/Getty Images\n\nRoyal: Catherine, Duchess of Cambridge (Kate Middleton)\n\nPublic social-media account?: Yes, @KensingtonRoyal\n\nSecret social-media account?: Supposedly\n\nWhat’s the deal: Kate reportedly has an account on the British website, Mumsnet. She’s been on the mommy forum swapping parenting tips ever since the birth of her second child, Charlotte. That counts as social media, right?\n\nPrince William. Photo: WPA Pool/Getty Images\n\nRoyal: Prince William\n\nPublic social-media account?: Yes, @KensingtonRoyal\n\nSecret social-media account?: No\n\nWhat’s the deal?: Other than his occasional tendency to dance like a dad at a club, Prince William seems like a pretty boring guy. I haven’t seen any evidence of him having a secret social-media account, and I don’t really suspect he has one. In 2007 there was a fake Prince William Facebook account that everyone freaked out over, however.\n\nPrince Harry. Photo: Chris Jackson/Getty Images\n\nRoyal: Prince Harry\n\nPublic social-media account?: Yes, @KensingtonRoyal\n\nSecret social-media account?: You better believe it!!!\n\nWhat’s the deal?: Prince Harry may seem mature now, but let’s not forget that he was very recently a wild child who wore inappropriate costumes, had far too much fun in Vegas, and loved social media. In fact, after the pictures of his Vegas misadventures emerged, Prince Harry was reportedly forced to shut down his beloved Facebook account … in which he used the name … wait for it …. are you ready? … Spike Wells. !!!! Prince Harry/Spike reportedly had that Facebook account for four years. While he was courting Meghan, who was still on social media at that time, the prince reportedly had a secret Instagram account (that he used to follow her, close friends, and charities). It’s unclear whether Prince Harry still has that account, but if Meghan had to get rid of hers, I should hope he’d have been polite and done the same.\n\nMeghan Markle. Photo: WPA Pool/Getty Images\n\nRoyal: Meghan Markle\n\nPublic social-media account?: None at the moment, but I assume she will also be joining @KensingtonRoyal\n\nSecret social-media account?: No\n\nWhat’s the deal?: There’s no proof Meghan has a private Instagram or Twitter account, but don’t you get the feeling she does? I mean, she was so into Instagram, Twitter, and Facebook for so long, had her lifestyle website the Tig, and she reportedly had an anonymous and very honest blog about being a working actress. BuzzFeed even recently uncovered a (now-deleted) Instagram pic she posted of someone who was potentially Prince Harry back in October 2016 (in which he was wearing a Golden Girls sweatshirt and his face was partially obscured!). So, this woman clearly loves social media. I figure she must have some accounts now, or at the very least is just lurking around on her phone.\n\nPrincess Beatrice. Photo: WPA Pool/Getty Images\n\nRoyal: Princess Beatrice\n\nPublic social-media account?: Yes, @yorkiebea\n\nSecret social-media account?: Instagram, baby!\n\nWhat’s the deal?: According to Guest of a Guest, Princess Beatrice likely has a secret Instagram account. In February, the royal attended a party for David Geffen, of all people. There, Vanity Fair’s Derek Blasberg, friend of all celebrities, tagged her in a pic on Instagram. The account he tagged is private, but I assume it’s actually hers, especially because Prince Harry’s ex-girlfriend Chelsy Davy (who has a public Instagram account) follows it. Princess Beatrice does have a public Twitter, though.\n\nPrincess Eugenie. Photo: Chris Jackson/Getty Images\n\nRoyal: Princess Eugenie\n\nPublic social-media account?: Yes, @PrincessEugenie\n\nSecret social-media account?: She doesn’t need one!\n\nWhat’s the deal?: Princess Eugenie is the only royal who officially has her own public Instagram account. Isn’t that nice? She posts cute pictures of herself and her sister Princess Beatrice when they were young, and some sweet current photos that include her mother Sarah Ferguson. She also posted an outtake from the official photoshoot in which she announced her engagement to her longtime boyfriend Jack Brooksbank. Can I get a #followback, Eugenie?\n\nSo there you have it for secret social accounts: Queen, yes; Kate, kind of; Will, ehhhh no; Harry, YESSS!; Meghan, probably?; Beatrice, yes; and Eugenie, she doesn’t even need one! If you’re wondering why I didn’t include Prince Charles and Camilla Parker Bowles on this list, it’s because I haven’t forgiven them for their affair and the pain they caused Princess Diana, sorry.", "images": ["https://pixel.nymag.com/imgs/fashion/daily/2018/04/30/royal-social-media/queen-elizabeth.w710.h473.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/04/24/royal-wedding/1.w330.h412.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/04/30/royal-social-media/kaye-middleton.w710.h473.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/04/30/royal-social-media/meghan-markle.w710.h473.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/04/30/royal-social-media/princess-beatrice.w710.h473.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/04/30/royal-social-media/princess-eugenie.w710.h473.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/04/30/royal-social-media/prince-harry.w710.h473.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/04/30/royal-social-media/prince-william.w710.h473.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/05/01/01-royal-four-up.w1200.h630.jpg"], "top_img": "https://pixel.nymag.com/imgs/fashion/daily/2018/05/01/01-royal-four-up.w1200.h630.jpg", "keywords": [], "authors": ["Lisa Ryan"], "canonical_link": "https://www.thecut.com/2018/05/british-royals-secret-social-media-accounts.html", "title": "Which Royals Have Secret Social-Media Accounts?", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Which Royals Have Secret Social-Media Accounts?", "url": "https://www.thecut.com/2018/05/british-royals-secret-social-media-accounts.html", "description": "Your royal expert has all the info on these fancy lurkers.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/05/01/01-royal-four-up.w1200.h630.jpg", "site_name": "The Cut", "type": "article"}, "twitter": {"title": "Which Royals Have Secret Social-Media Accounts?", "description": "Your royal expert has all the info on these fancy lurkers.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/05/01/01-royal-four-up.w600.h315.2x.jpg", "card": "summary_large_image", "creator": "@lisarya", "site": "@TheCut"}, "article": {"published_time": "2018-05-01T08:43:37.128-04:00", "tag": "royal inquiries, culture, celebrity, kate middleton, prince william, prince harry, meghan markle, queen elizabeth, princess eugenie, princess beatrice, social media", "publisher": "https://www.facebook.com/cut"}, "description": "Although most of the British royals are represented on social media in official accounts, several of them — including Queen Elizabeth, Kate Middleton, Princess Beatrice, and Prince Harry — are believed to have secret social-media accounts.", "sailthru.tags": "royal inquiries, culture, celebrity, kate middleton, prince william, prince harry, meghan markle, queen elizabeth, princess eugenie, princess beatrice, social media", "author": "Lisa Ryan", "fb": {"app_id": 343556435754245}, "type": "Article", "vertical": "The Cut", "apple-mobile-web-app-title": "The Cut", "application-name": "The Cut", "msapplication-TileColor": "#ff5656", "msapplication-TileImage": "https://assets.nymag.com/media/sites/thecut/icon.144x144.png"}, "movies": [], "publish_date": 1525178617.128, "source": "http://www.thecut.com", "summary": ""}