{"url": "https://www.hollywoodreporter.com/live-feed/versace-issues-statement-american-crime-story-pokes-holes-shows-credibility-1073580", "text": "\"As we have said, the Versace family has neither authorized nor had any involvement whatsoever in the forthcoming TV series about the death of Mr. Gianni Versace, which should only be considered as a work of fiction.\"\n\nVersace has issued a second statement regarding FX's highly anticipated American Crime Story: The Assassination of Gianni Versace.\n\nThe second season of Ryan Murphy's anthology series, which premieres Jan. 17, examines the death of the famed Italian fashion designer — but his family wants viewers to know that the series \"should only be considered a work of fiction,\" adding that much of the story has been sensationalized and is based on \"second-hand hearsay.\"\n\nThe family discredits the show's authenticity by poking holes in the integrity of its source material, the 2000 book Vulgar Favors: The Assassination of Gianni Versace by Maureen Orth. \"The Orth book itself is full of gossip and speculation,\" says the family, \"Orth never received any information from the Versace family and she has no basis to make claims about the intimate personal life of Gianni Versace or other family members.\"\n\nThe statement questions Orth's information gathering tactics, specifically regarding the attainment of Gianni's postmortem medical records. \"In her lurid claims, she ignores contrary information provided by members of Mr. Versace's family.\"\n\nThe first statement regarding the series was issued Tuesday, prompting the following response from FX and Fox21 producers: \"The Assassination of Gianni Versace is based on Maureen Orth's heavily researched and authenticated nonfiction best-seller Vulgar Favors, which examined the true-life crime spree of Andrew Cunanan. We stand by the meticulous reporting of Ms. Orth.”\n\nIn Murphy's follow-up cycle to The People v. O.J. Simpson, Edgar Ramirez stars as Versace, while Penelope Cruz stars as his sister Donatella, Ricky Martin plays his longtime partner Antonio D'Amico and Darren Criss stars as Cunanan.\n\nMurphy himself told The Hollywood Reporter that Donatella Versace's actions seemed to indicate she wasn't entirely displeased with the drama. \"Donatella Versace sent Penelope Cruz a very large arrangement of flowers when she was representing the show at the Golden Globes,\" he said. \"I don't know if she is going to watch the show, but if she did, I think she would see that we treat her and her family with respect and kindness, and she really is sort of a feminist role model in my book because she had to step into an impossible situation, which she did with grace and understanding.\"\n\nUltimately, Murphy said he understands the instinct to be wary of the project but added that Cruz \"would never do anything to represent [Donatella] in a negative light.\"\n\nThe Versace family has noted that it will issue no further comment on the show.\n\nRead the family's statement in full below:\n\nAs we have said, the Versace family has neither authorized nor had any involvement whatsoever in the forthcoming TV series about the death of Mr. Gianni Versace, which should only be considered as a work of fiction.\n\nThe company producing the series claims it is relying on a book by Maureen Orth, but the Orth book itself is full of gossip and speculation. Orth never received any information from the Versace family and she has no basis to make claims about the intimate personal life of Gianni Versace or other family members. Instead, in her effort to create a sensational story, she presents second-hand hearsay that is full of contradictions.\n\nAs just one example, Orth makes assertions about Gianni Versace’s medical condition based on a person who claims he reviewed a post-mortem test result, but she admits it would have been illegal for the person to have reviewed the report in the first place (if it existed at all). In making her lurid claims, she ignores contrary information provided by members of Mr. Versace’s family, who lived and worked closely with him and were in the best position to know the facts of his life.\n\nGianni Versace was a brave and honest man, who engaged in humanitarian work for the benefit of others. Of all the possible portrayals of his life and legacy, it is sad and reprehensible that the producers have chosen to present the distorted and bogus version created by Maureen Orth.\n\nThe Versace family will issue no further comment on the matter.\n\n\n\nUPDATE: On Thursday, Random House (publisher of source material Vulgar Favors by journalist Maureen Orth, issued its own statement on the matter: “First published almost 19 years ago, Vulgar Favors is a carefully reported and extensively-sourced work of investigative journalism by an award-winning journalist with impeccable credentials. The book has stood the test of time and is widely regarded as the definitive account of Andrew Cunanan’s chilling crime spree. Random House stands by the book and its author, Maureen Orth.”\n\n\n\n", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2018/02/acsversace-ep305_scday-ray_0734_-_embed_2018_0.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/01/greg_berlanti_sharon_horgan_alex_kurtzman_and_dwayne_johnson_-_getty_-_h_2020.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/2017/12/acsversace-ep301_scday-r1e-embed.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/11/fx-logo.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/03/mrs._america_-_publicity_still_1-_h_2020_.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2017/12/acsversace-ep301_scday-r1e-embed.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/blogicon_livefeed-black2.png"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/12/acsversace-ep301_scday-r1e-embed.jpg", "keywords": [], "authors": ["Sam Reed", "Thrnews Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/live-feed/versace-issues-statement-american-crime-story-pokes-holes-shows-credibility-1073580", "title": "Versace Issues Another Statement About 'American Crime Story,' Pokes Holes in Show's Credibility", "meta_data": {"viewport": "width=device-width", "description": "\"As we have said, the Versace family has neither authorized nor had any involvement whatsoever in the forthcoming TV series about the death of Mr. Gianni Versace, which should only be considered as a work of fiction.\"", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/live-feed/versace-issues-statement-american-crime-story-pokes-holes-shows-credibility-1073580", "domain": "https://www.hollywoodreporter.com/", "title": "Versace Issues Another Statement About 'American Crime Story,' Pokes Holes in Show's Credibility", "description": "\"As we have said, the Versace family has neither authorized nor had any involvement whatsoever in the forthcoming TV series about the death of Mr. Gianni Versace, which should only be considered as a work of fiction.\"", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/12/acsversace-ep301_scday-r1e-embed.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Versace Issues Another Statement About 'American Crime Story,' Pokes Holes in Show's Credibility", "description": "\"As we have said, the Versace family has neither authorized nor had any involvement whatsoever in the forthcoming TV series about the death of Mr. Gianni Versace, which should only be considered as a work of fiction.\"", "url": "https://www.hollywoodreporter.com/live-feed/versace-issues-statement-american-crime-story-pokes-holes-shows-credibility-1073580", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/12/acsversace-ep301_scday-r1e-embed.jpg", "width": 928, "height": 619, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Versace Issues Another Statement About 'American Crime Story,' Pokes Holes in Show's Credibility", "sailthru.description": "\"As we have said, the Versace family has neither authorized nor had any involvement whatsoever in the forthcoming TV series about the death of Mr. Gianni Versace, which should only be considered as a work of fiction.\"", "sailthru.author": "Sam Reed", "sailthru.channel": "Live Feed", "sailthru.vertical": "Live Feed", "sailthru.date": "2018-01-10 09:26:48", "sailthru.tags": "Live Feed, Style, FX, Ryan Murphy, Versace, The Assassination of Gianni Versace, The Assassination of Gianni Versace: American Crime Story, Style News"}, "movies": [], "publish_date": 1515547608.0, "source": "https://www.hollywoodreporter.com", "summary": ""}