{"url": "https://www.wmagazine.com/story/jimmy-kimmel-emotional-response-las-vegas-shooting-best-monologue", "text": "“Vegas is a funny town,” said Jimmy Kimmel during his emotional opening monologue for Jimmy Kimmel Live on Monday night. “It’s easy to forget people live there.”\n\nThe late-night host would know: Kimmel is a Vegas native himself, having moved there from Brooklyn when he was 9. So when he launched into his introduction to Monday night’s show, just one day after a shooter, 64-year-old Stephen Paddock of Mesquite, Nevada, opened fire on a crowd of concertgoers outside Las Vegas’s Mandalay Bay Hotel, the news was particularly poignant. James Corden, Trevor Noah, Stephen Colbert, and Seth Meyers all, like Kimmel, devoted their opening monologues to discussing the shooting in Las Vegas.\n\nBut Kimmel, who has recently found a calling transforming his show into a political conscience (even though, as he said Monday night, “I want this to be a comedy show. I hate talking about stuff like this”), began tearing up as soon as the cameras started rolling, giving a particularly unfiltered perspective on gun control and the government’s continuing inaction in the face of mass shootings.\n\n“It’s the kind of thing that makes you want to throw up or give up,” he said. “It’s too much to process.” He offered a scathing indictment of both the president, who offered his “warmest condolences” on Twitter while having signed a bill in February that allowed mentally ill individuals easier access to purchasing guns, as well as of the 56 senators who voted against closing a loophole that allows prospective gun buyers to evade the government-mandated background checks, showing their faces on screen and describing them as those “who won’t do anything about this because the NRA has their balls in a money clip.” For in the wake of various incidents of gun violence—Sandy Hook, Charleston, Orlando, now Las Vegas—the National Rifle Association has successfully lobbied in favor of second-amendment rights: “Our forefathers wanted us to have AK-47s, is the argument,” Kimmel said, incredulous.\n\nPoliticians’ inaction—and their widespread reluctance to turn mass shootings into mobilizing efforts in favor of stricter gun control—was the subject of the monologues of Kimmel’s peers, too. As Corden, whose voice also tightened as he delivered a quiet, measured speech, said, “Some say it’s too early to talk about gun control; for those victims last night, it’s far too late.” He, like Noah, is a recent New York transplant who has witnessed the two worst mass shootings since the mid-20th century in the past two years: First, at Pulse nightclub in Orlando, Florida last summer; and now, in Las Vegas, Nevada.\n\nRelated Videos\n\n“It should be hard for everyone to fathom,” Corden said. “Gun violence should not be a staple of American life.”\n\nAnd yet the response to these shootings—of which there have been 275 so far in 2017—has become rote. “People are becoming more accustomed to this kind of news. I almost know how it’s going to play out,” Noah said during The Daily Show on Monday night, a sentiment Meyers echoed opening Late Night With Seth Meyers. “We’re shocked, we’re sad, thoughts and prayers, and then, almost on cue, people are going to come out and say, whatever you do, when you speak about the shooting, don’t talk about guns,” Meyers said.\n\nIt’s not just that politicians have refused to pass gun control legislation that, as Stephen Colbert pointed out, “the vast majority of Americans want.” Later this week, a bill that would make it easier for individuals to purchase gun silencers—which, as Politico reported, currently have more stringent requirements for purchase than guns themselves—was expected to go up for a vote in the House of Representatives. However, Sunday night’s shooting is expected to delay the bill to some degree—for, at least, if elected leaders refuse to “politicize” an incident of gun violence as a way of promoting gun control, the converse is also true, that they will also be reluctant to promote gun (and gun accessory) access. As Noah said, “Don’t talk about guns.”\n\nColbert closed out The Late Show’s introductory monologue with a firm address directly to Trump: “Doing nothing is cowardice.” he said. “You want to make America great again? Do something the past two presidents haven’t been able to do: Pass any kind of common-sense gun control legislation.”\n\nFormer 'Daily Show' correspondents Samantha Bee and Jason Jones on falling in love:", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.wmagazine.com/wp-content/uploads/2017/09/21/59c3b8d76d140b5bd74f4100_GettyImages-849709530.jpg?crop=0px,0px,3000px,1500px&w=790px", "https://www.facebook.com/tr?id=3223313014351882&ev=PageView&noscript=1"], "top_img": "https://www.wmagazine.com/wp-content/uploads/2017/09/21/59c3b8d76d140b5bd74f4100_GettyImages-849709530.jpg?crop=0px,0px,3000px,1500px&w=790px", "keywords": [], "authors": [], "canonical_link": "https://www.wmagazine.com/story/jimmy-kimmel-emotional-response-las-vegas-shooting-best-monologue/", "title": "Jimmy Kimmel's Indignant, Emotional Response to Vegas Shooting Was the Best Monologue on Monday Night", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "Jimmy Kimmel, James Corden, Trevor Noah, Stephen Colbert, and Seth Meyers all made the case for stricter gun control after the Las Vegas shooting Sunday night.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Jimmy Kimmel's Indignant, Emotional Response to Vegas Shooting Was the Best Monologue on Monday Night", "description": "Jimmy Kimmel, James Corden, Trevor Noah, Stephen Colbert, and Seth Meyers all made the case for stricter gun control after the Las Vegas shooting Sunday night.", "url": "https://www.wmagazine.com/story/jimmy-kimmel-emotional-response-las-vegas-shooting-best-monologue/", "site_name": "W Magazine | Women's Fashion & Celebrity News", "image": {"identifier": "https://www.wmagazine.com/wp-content/uploads/2017/09/21/59c3b8d76d140b5bd74f4100_GettyImages-849709530.jpg?crop=0px,0px,3000px,1500px&w=790px", "secure_url": "https://www.wmagazine.com/wp-content/uploads/2017/09/21/59c3b8d76d140b5bd74f4100_GettyImages-849709530.jpg?crop=0px,0px,3000px,1500px&w=790px", "width": 3000, "height": 2000}}, "fb": {"app_id": 450372832509980}, "twitter": {"card": "summary_large_image", "description": "Jimmy Kimmel, James Corden, Trevor Noah, Stephen Colbert, and Seth Meyers all made the case for stricter gun control after the Las Vegas shooting Sunday night.", "title": "Jimmy Kimmel's Indignant, Emotional Response to Vegas Shooting Was the Best Monologue on Monday Night", "image": "https://www.wmagazine.com/wp-content/uploads/2017/09/21/59c3b8d76d140b5bd74f4100_GettyImages-849709530.jpg?crop=0px,0px,3000px,1500px&w=790px&mbid=social_retweet"}, "generator": "WordPress 5.4", "msapplication-TileImage": "https://www.wmagazine.com/wp-content/uploads/2020/01/cropped-favicon.png?fit=270%2C270"}, "movies": ["https://www.youtube.com/embed/ruYeBXudsds"], "publish_date": null, "source": "https://www.wmagazine.com", "summary": ""}