{"url": "discussion.femalefirst.co.uk/viewtopic.php?t=752720", "text": "Postby Guest » Sat Jul 07, 2018 5:10 am\n\nBrad Pitt is on the verge of relapsing because Neri Oxman dumped him, according to a completely wrong tabloid story. Gossip Cop can debunk this report. Pitt is committed to his sobriety, and was never dating Oxman in the first place.\n\n\n\nBut the Globe wants readers to believe Pitt has “suffered a painful blow to the heart” after Oxman “jilted him for a billionaire.” The magazine contends that “friends” now “fear losing at love will send” the actor into a “destructive abuse binge.” The narrative was sparked by Oxman being seen with her boyfriend, Bill Ackman, in Paris last month.\n\n\n\n“Brad still thought things would work out with Neri. So it was a shock when he saw she’s back with Bill,” a so-called “source” is quoted as saying. Maintains the outlet, “Now sources worry the Allied star could fall off the wagon… Insiders worry the stress of romantic disappointment and his custody war [with Angelina Jolie] could trigger an issue.” Of course, none of these untraceable “sources” or “insiders” are named.\n\n\n\nGossip Cop can’t help but wonder if they’re the same ones that led this publication to falsely allege last month that Pitt and Jolie were “calling off” their divorce. The tabloid even went as far as claiming they were “hot again” after a “steamy, clothes-ripping reconciliation,” and that they’d have a “second commitment ceremony.” Notably, nothing is said about any of that in this new tale about Pitt’s supposed heartbreak from Oxman.\n\n\n\nThe stories aren’t just inconsistent; they’re also plain wrong. Just as Pitt was never getting back together with Jolie in June, he was never romantically involved with Oxman. As Page Six rightly reported back in April, Pitt and the MIT professor have shared a friendship and nothing more.\n\n\n\nConfirms his spokesperson to Gossip Cop, “They were only friends.” And Oxman was dating Ackman all along. So the premise that Pitt has been “jilted” is entirely untrue. As for his love life affecting his well-being, “Entertainment Tonight” reported just last week that Pitt has chosen to focus on fatherhood, not dating. It was specifically noted, “He spent over a year learning to live a healthier lifestyle and he feels better than ever.”\n\n\n\nConclusion: After wrongly claiming Pitt reunited with Jolie in June, the tabloid is now contending in July that he’s been dumped by Oxman. But according to other outlets and Pitt’s own rep, he and the scholar were never dating. That means this article is based on a false premise. Additionally, while the magazine asserts there’s concerns Pitt is on the verge of a relapse, it was just reliably reported last week that he is feeling “better than ever” and has embraced a “healthier lifestyle.” It’s apparent this story is entirely inaccurate.", "images": ["https://www.femalefirst.co.uk/image-library/partners/bang/square/250/k/knife-322808f87044c4eed4d3f820b0d9d516785eb2db.jpg", "http://www.femalefirst.co.uk/assets/gfx/ff/logos/femalefirst.png", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/f/flamingo-d55b313720a065a21c500962fe670c6b3474768d.jpg", "https://www.femalefirst.co.uk/image-library/square/250/i/image001-7.jpg", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/b/baby-in-blanket-d9f538e519d4a1a6b0ea54a26a9a8316f1843d15.jpg", "http://discussion.femalefirst.co.uk/images/avatars/gallery/newimages/eye7.gif", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/l/lightning-7027059984b9945d9a0fb63a76cf3a332c79bc2f.jpg", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/t/tiger-5117e3f2cb071e456e3d5fc7d5872570741e2150.jpg", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/s/seagulls-32b6c85d8065e4adbb2d87a1bbb9e9a15dc0ab54.jpg", "https://a.collective-media.net/seg/etu/1b", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/f/fighter-jet-081b86e576474c00b187601078a4027476a9c19c.jpg", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/z/zebra-6a816e66761bf274817e7d770bc3c715fc9e5cf3.jpg", "http://discussion.femalefirst.co.uk/images/smilies/icon_lol.gif", "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/c/cat-breaks-into-couples-home-ef4a392f7387557515cfffa911a82ff.jpg"], "top_img": "https://www.femalefirst.co.uk/image-library/partners/bang/square/250/k/knife-322808f87044c4eed4d3f820b0d9d516785eb2db.jpg", "keywords": [], "authors": [], "canonical_link": "https://discussion.femalefirst.co.uk/viewtopic.php?t=752720", "title": "Female First Forum", "meta_data": {"viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": null, "source": "http://discussion.femalefirst.co.uk", "summary": ""}