{"url": "http://time.com/5252990/avengers-infinity-war-deaths/", "text": "Warning: This post contains spoilers for Avengers: Infinity War.\n\nYou expected superheroes to die in Avengers: Infinity War. You probably didn’t expect so many superheroes would perish. And, just a few weeks before the release of that film’s sequel, Avengers: Endgame, Marvel has finally confirmed who lived and who died. (We won’t reveal who ultimately lives, dies and was brought back to life in this story, but you can find out what happens in Avengers: Endgame here.)\n\nThe Russo brothers, who directed both films, let audiences know early on in Infinity War that no character was safe: fan favorite Loki is killed off in the first few minutes. Other characters met an ugly fate at the hands of Thanos and his minions, including Gamora (more on that later). But it wasn’t until the very end of the film that heroes began to disappear — literally.\n\nThanos fulfilled his plan to destroy half of all life in the universe, and with the snap of his fingers, people began to disintegrate.\n\nBut are they really gone? The short answer: probably not. In March 2019, Marvel released a collection of posters verifying the survivors of Infinity War.\n\nMarvel Studios\n\nPlus, Black Panther broke every record at the box office, and Disney is eager to make a sequel. In 2019, Captain Marvel broke her own share of box-office records. And a second Spider-Man movie is set to premiere shortly after Avengers: Endgame hits theaters on April 26.\n\nHow then will the remaining heroes bring all these characters back? Note that all the members of the original Avengers team — Iron Man, Captain America, Thor, Hulk, Black Widow and Hawkeye — survived Thanos’ attack. Presumably they will unite one last time in Avengers: Endgame to reverse the curse. They’ll get some help from Captain Marvel, who meets the Avengers for the first time, post Thanos’s snap, in a post-credits scene for her solo film.\n\nIn the meantime, here is a full list of Avengers: Infinity War deaths and survivals.\n\nHere’s who died in Avengers: Infinity War\n\nLoki (Tom Hiddleston) in Marvel Studios' AVENGERS: INFINITY WAR Marvel Studios\n\nLoki: Turns out Loki (Tom Hiddleston) wasn’t such a bad guy after all. In the opening scene of the movie, Loki hands over the Tesseract to Thanos (Josh Brolin) to save the life of Thor (Chris Hemsworth). Loki offers fake fealty to Thanos and then immediately tries to assassinate the evil alien. Thanos doesn’t buy Loki’s trick and quickly murders him. Thanos quips, “No resurrections this time” after killing the trickster god, who has seemingly died twice before in the film series.\n\nREAD MORE: How to Stream Every Single Marvel Movie\n\nHeimdall: Thanos and his children murder Thor’s best friend Heimdall (Idris Elba) when they invade Thor’s ship. But before he dies, the Asgardian opens up a gateway to Earth so the Hulk can escape. Thor cries out when Heimdall perishes, and swears that Thanos will die for his actions. He does sort of avenge Heimdall later by stabbing Thanos, but unfortunately Thanos is already invincible at that point.\n\nGamora: Thanos travels to a planet with his adopted daughter Gamora (Zoe Saldana). There, they encounter Red Skull, the baddie from Captain America: The First Avenger who has been cursed to guard the Soul Stone. Red Skull tells Thanos that he will have to sacrifice something he loves in order to get the Soul Stone. Despite taking a commanding lead in the World’s Worst Dad competition, Thanos apparently loves Gamora — just enough to throw her over a cliff. Gamora dies and Thanos walks away with another Infinity Stone.\n\nDon’t mourn yet though: If the Avengers find a way to reverse all that Thanos has done, they may be able to bring Gamora back. And who better to finally kill the villain in the end?\n\nVision: Scarlet Witch (Elizabeth Olsen) destroys the Infinity Stone inside Vision’s (Paul Bettany) head to keep it from Thanos. But Thanos uses the Time Stone to turn back time and restore the stone and Vision. He then crushes Vision’s head in his hands and takes the Infinity Stone. Vision is left lifeless on the ground.\n\nHere’s who disintegrated in Avengers: Infinity War\n\nMarvel Studios\n\nBlack Panther/T’Challa: Okoye (Danai Gurira) cries out as her king disintegrates. Chadwick Boseman will likely be back, but in the meantime will someone else don the Black Panther suit? Here’s hoping Shuri or Okoye gets to try out his claws.\n\nSpider-Man/Peter Parker: Poor Spider-Man (Tom Holland). He was just a kid. But don’t worry, Spider-Man is already set to appear in a Spider-Man: Homecoming sequel next year, Spider-Man: Far From Home. There is a small chance that Tom Holland’s Spidey really did die, and Miles Morales — another Spider-Man from the comic books whose existence Marvel teased in Homecoming — could take over for him.\n\nDoctor Strange/Stephen Strange: Marvel has been cagey about confirming a Doctor Strange 2 and now we know why. Doctor Strange disintegrates in Infinity War. But he also is the only character who hints that he may be able to return. As he dies, he tells Iron Man that giving up the Time Stone to Thanos in exchange for Iron Man’s life was the “only way.”\n\nEarlier in the movie, Doctor Strange looked into many possible futures and probably saw that the only way to ultimately defeat Thanos — and possibly bring everyone back —was to lose that particular battle.\n\nWinter Soldier/Bucky Barnes and Falcon/Sam Wilson: Many fans have speculated that either Bucky or Falcon will take over the Captain America mantle when Steve Rogers retires. But his time has not come yet: Cap survives but loses his two best friends.\n\nScarlet Witch/Wanda Maximoff: This loss hurts: Scarlet Witch seems to be the only superhero with the ability to destroy an Infinity Stone. The Avengers will have to find a clever way to destroy the stones as they fight Thanos in the next movie without her.\n\nThe Guardians of the Galaxy: Most of the remaining Guardians — Star-Lord, Groot, Drax and Mantis — all perish in the culling. Only Rocket remains. Marvel recently confirmed that Guardians of the Galaxy Vol. 3 is back on after director James Gunn was reinstated following his controversial dismissal.\n\nNick Fury and Maria Hill: The former S.H.I.E.L.D. agents disintegrate in New York in the Avengers: Infinity War post-credit scene — but not before they call on Captain Marvel for help. (More on her later.)\n\nREAD MORE: We Ranked Every Single Marvel Cinematic Universe Movie\n\nHope Pym, Hank Pym and Janet Van Dyne: Though Hope Pym (the Wasp) and her parents did not appear in Infinity War, they did star in Ant-Man and the Wasp. They all disintegrated in that film’s mid-credits scene.\n\nShuri: Black Panther’s sister Shuri tries to remove the Infinity Stone from Vision’s head, but is thrown from her lab by one of Thanos’ children before she can finish. We don’t see what happens to her when half the world’s population disappears, but in the trailer for the sequel, Avengers: Endgame, we find out that the Avengers count her among the disappeared. New posters released by Marvel in March 2019 confirmed what we already knew.\n\nHere’s who survived Avengers: Infinity War\n\nChuck Zlotnick—Marvel Studios\n\nCaptain America/Steve Rogers: Captain America actor Chris Evans has been suggesting for months that he would die in Infinity War. But when he faces down Thanos one-on-one, Thanos inexplicably decides to toss Cap aside instead of just killing him. Captain America survives.\n\nIron Man/Tony Stark: Despite being stabbed in the stomach, Iron Man survives. Doctor Strange trades the Time Stone to save Iron Man’s life.\n\nThor: With the help of his new battle axe, Thor is able to stab Thanos in the heart. Thor survives, but he doesn’t stop Thanos from destroying half the universe.\n\nBlack Widow/Natasha Romanoff: Black Widow takes out several of Thanos’ children in the battle in Wakanda and survives the fight.\n\nHulk/Bruce Banner: Bruce Banner also manages to live despite his inability to turn into the Hulk for most of the movie.\n\nWar Machine/James Rhodes: Rhodey lost the use of his legs at the end of Captain America: Civil War (though he can now walk with the aid of Stark technology). At least he made it through the end of Infinity War.\n\nRocket and Nebula: Of the original Guardians crew, only Rocket survives. Gamora’s sister Nebula also lives. Perhaps the two will reunite in the next film.\n\nOkoye and M’Baku: Black Panther may be dead, but Wakanda lives on. Okoye and M’Baku (Winston Duke) survive. One of them — or perhaps Shuri — will have to lead the Wakandan army in any Avengers: Endgame battles.\n\nAnt-Man/Scott Lang: Though he did not appear in Infinity War itself, a mid-credits scene in Ant-Man and the Wasp revealed that Ant-Man survived the culling. Unfortunately for him, he had entered the Subatomic Realm just before Thanos snapped his fingers. Ant-Man’s allies who were supposed to pull him out—Hope Pym, Hank Pym and Janet Van Dyne—all disintegrated. But the Avengers: Endgame trailer revealed that he escaped.\n\nHawkeye/Clint Barton: The archer (Jeremy Renner) was conspicuously missing from Avengers: Infinity War. The stay-at-home dad apparently told the rest of the Avengers that fighting Thanos was too risky. But the Avengers: Endgame trailer revealed that Clint has survived and adopted a darker costume. Fans speculate that he’s taken on a darker identity from the comics too as he seeks to avenge his family: Ronin, a lonely hero.\n\nCaptain Marvel/Carol Danvers: If you stayed for the post-credit scene of Avengers: Infinity War, you know that Nick Fury called Captain Marvel right before he disintegrated. We learn that the new, extremely powerful hero survived the culling in the Captain Marvel post-credits scene. Captain Marvel (a.k.a. Carol Danvers, played by Brie Larson) did indeed answer Fury’s call. She shows up at Avengers headquarters looking for her old friend.\n\nPepper Potts: The last we heard from Pepper, she was berating Tony for abandoning her to fight evil — again. But a recent poster for Avengers: Endgame that showed everyone who is alive and dead confirmed that she did, indeed survive the culling. That means she could fight in Avengers: Endgame. Never forget: Pepper gained super powers in Iron Man 3. The Avengers: Endgame trailer shows Tony, floating through space, send a goodbye message to Pepper. She may try to save him.\n\nValkyrie: Where is Valkyrie (Tessa Thompson)? At the end of Thor: Ragnarok, Thor’s new ally Valkyrie boarded the ship bound for earth along with Thor, the Hulk, Loki, Heimdall and the rest of the Asgardians. But we don’t see her dead on the ground when Thanos takes over that same ship at the beginning of Infinity War. Thor makes no mention of her. Did she run out to get chips and guac on an escape pod and miss the whole fight? Thompson jokingly tweeted in September that Valkyrie was alive “and thriving” after the apocalypse. And the poster of characters who died and survived confirmed that she is indeed alive.\n\nWong: Wong (Benedict Wong) returns to the Sanctum Sanctorum to protect the building after Doctor Strange is taken captive by Thanos’ children. We never see whether he lives or dies. But a recent poster confirmed that he did survive the culling.\n\nHappy Hogan: A poster also confirms that Tony Stark’s right-hand man, played by Jon Favreau, is still alive.\n\nHere’s who went M.I.A. in Avengers: Infinity War\n\nThe Collector: We see the Collector (Benicio del Toro) alive and well in Thanos’ alternate reality, but then discover he’s not actually hanging out in his museum. Did Thanos kill him? Did he flee? Did he survive the culling? We don’t know.\n\nNed and MJ: We also never find out whether Ned, who creates a distraction for his friend Peter Parker to escape a school field trip at the beginning of the movie, lives or dies. Same with Peter’s love interest MJ who presumably was on that same bus and is set to feature in Spider-Man’s next film, Spider-Man: Far From Home.\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Eliana Dockterman at eliana.dockterman@time.com.", "images": ["https://api.time.com/wp-content/uploads/2020/04/Sergio_00_45_10_00C1.jpg?quality=85&w=600", "https://api.time.com/wp-content/uploads/2018/04/avengers-infinity-war-endgame-alive-dead.png", "https://api.time.com/wp-content/uploads/2018/04/mlu-19833_r.jpg?quality=85", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2018/04/avengers-infinity-war-brolin-villain1.jpg?quality=85&w=1200&h=628&crop=1", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2018/04/avengers-infinity-war-2.jpg?quality=85", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2020/04/TIM200427_cover_Hope_USETHIS.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2018/04/loki-avengers-marvel.jpg", "https://api.time.com/wp-content/uploads/2020/04/love-and-basketball.jpg?quality=85&w=600"], "top_img": "https://api.time.com/wp-content/uploads/2018/04/avengers-infinity-war-brolin-villain1.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Eliana Dockterman"], "canonical_link": "https://time.com/5252990/avengers-infinity-war-deaths/", "title": "A Complete List of Who Lives and Dies in Avengers: Infinity War", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "movies", "news_keywords": "movies", "description": "The Russo brothers, who directed Avengers: Infinity War, let audiences know early on that no character—new or old— was safe this time around.", "og": {"title": "A Complete List of Who Lives and Dies in 'Avengers: Infinity War'", "type": "article", "site_name": "Time", "url": "https://time.com/5252990/avengers-infinity-war-deaths/", "description": "The Russo brothers, who directed Avengers: Infinity War, let audiences know early on that no character—new or old— was safe this time around.", "image": {"identifier": "https://api.time.com/wp-content/uploads/2018/04/avengers-infinity-war-brolin-villain1.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5252990/avengers-infinity-war-deaths/", "description": "The Russo brothers, who directed Avengers: Infinity War, let audiences know early on that no character—new or old— was safe this time around.", "media": "https://api.time.com/wp-content/uploads/2018/04/avengers-infinity-war-brolin-villain1.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5252990/avengers-infinity-war-deaths/", "title": "A Complete List of Who Lives and Dies in 'Avengers: Infinity War'", "description": "The Russo brothers, who directed Avengers: Infinity War, let audiences know early on that no character—new or old— was safe this time around.", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2018/04/avengers-infinity-war-brolin-villain1.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}