{"url": "https://thecelebscloset.com/asa-soltan-rahmati-boyfriend-married-child-bio/", "text": "Born Name Asa Soltan Rahmati Birth Place Ahwaz, Iran Height 5 feet 6 inch Eye Color Brown Zodiac Sign Virgo Nationality Iranian and American Ethnicity Mixed Profession Businesswoman, artist Net Worth $250 thousand Age 42 years Dating Jermaine Jackson, Jr. Sibling Arta\n\nLast Updated on July 2, 2019\n\nHave you ever watched the Bravo reality series Shahs of Sunset? Who was your favorite character? Most of the people were following their favorite Persian diva Asa Soltan Rahmati. People repeatedly talk about her beauty and style.\n\nAsa Soltan Rahmati describes herself as an Iranian pop-priestess. She is also an emerging entrepreneur and a TV personality. She has many feathers on her cap as she is also a great singer and a songwriter.\n\nInterested to know who is Asa Soltan Rahmati dating? Has she married already? Well, you have rightly landed on our page to explore all about her. So, let’s know Asa Soltan Rahmati boyfriend, dating affair, children, marriage, net worth, career, age, and wiki.\n\nAsa Soltan Rahmati Boyfriend; Glimpse of Her Dating Affair\n\nThe beautiful Asa Soltan Rahmati is currently dating her longtime boyfriend, Jermaine Jackson Jr. They are in a relationship for more than six years.\n\nAsa knew her boyfriend when she was just fifteen years old. The couple is in a live-in relation since 2010. However, they have not married yet nor have engaged too. Possibly, the right moment for their marriage hasn’t arrived yet.\n\nAsa Rahmati is still in a healthy relationship with her boyfriend, Jermaine Jackson. Her boyfriend, Jermaine Jackson is the nephew of Michael Jackson.\n\nAsa Soltan Rahmati and Her Boyfriend Welcomed a Child\n\nOn January 20, 2017, with her boyfriend, Jackson Jr., Asa Rahmati Soltan welcomed her first baby boy named Soltan Jackson. She was super excited before her delivery as she would post photos on social media flaunting her baby bumps.\n\nCurrently, Asa is living a blissful life with her baby and the love of her life. Though she posts photos of her son on her social media profiles, she never shows us, fans, his face. She is keeping her baby boy’s personal details far from the media attention.\n\nhttps://www.instagram.com/p/Bt7IL2tH-xR/\n\nLook at how she hid her son’s face here!\n\nAsa Soltan Rahmati Net Worth\n\nBesides the reality show, Asa Soltan Rahmati has her clothes plus accessories designing-production business. She is an aspiring entrepreneur as she has made immense wealth by selling alkaline water called Diamond Water.\n\nMy beautiful Goddesses! Please join me for my @HSN live party late tonight and tomorrow afternoon! I’ve brought you out of this world jewelry and amazing kaftans. This short kaftan I’m wearing is one of fav prints I’ve ever crated and available to you now. It’s so fun and bold! pic.twitter.com/H4fFdAuwnk — Asa Soltan Rahmati (@AsaSoltan) April 5, 2018\n\nAs of 2018, Asa Soltan Rahmati’s net worth is projected to be around $250 thousand. We can expect that her net worth is going to soar up in the future as she is also a gold jewelry expert, philanthropist, designer, and an author.\n\nThe TV star also makes an impressive net worth from her Instagram account. From her per ads post, she makes $1,779 – $2,965.\n\nAsa Soltan Rahmati Bio: Early Life and Career\n\nAsa sultan Rahmati was born on September 1, 1976. Hence, she is currently 42 years old. She was born and raised in Iran. Later, she migrated to Los Angeles after her family left Iran.\n\nRegarding her education, Rahmati graduated from UCLA with a double major in Philosophy and Psychology.\n\nFurthermore, Asa used to sing and perform as a singer with different art forms and shows. She came to spotlight after joining the television show on Bravo, Shahs of Sunset in 2012 where she brilliantly portrayed her character with her Iran-American friends.\n\nFurthermore, she also sang songs like Gold and Tehrangeles. Apart from that, Asa also established herself as a successful businesswoman.\n\nAsa Soltan Rahmati Wiki Facts\n\nThe bold and beautiful Asa Soltan Rahmati is currently at the age of 42. The Iranian-born beauty is a legal citizen of the USA. The Virgo born Asa has balanced her career as well as her personal life.\n\nShe has an alluring body structure and stands tall with a height of 5 feet 7 inches. Her busty figure makes her look even more captivating.\n\nThe long shiny black hair suits her personality. As of now, as she uses social media to connect with her fans and promote her endorsements, she has 595.9k followers on Instagram and about 112k followers on her Twitter account.\n\nMoreover, Rahmati has almost 4117 posts on her Instagram account. Whereas, her account has over 2k comments and 134k likes.", "images": ["https://cdn.shortpixel.ai/client/q_glossy,ret_img,w_728/https://thecelebscloset.com/wp-content/uploads/2018/12/0328-rosa-salazar-getty-3.jpg", "https://cdn.shortpixel.ai/client/q_glossy,ret_img,w_604/https://thecelebscloset.com/wp-content/uploads/2018/04/8a6611edbf971ba1d26e71ed38dffd4a.jpg", "https://cdn.shortpixel.ai/client/q_glossy,ret_img,w_980/https://thecelebscloset.com/wp-content/uploads/2018/04/mgid_ao_image_mtv_222694.jpg", "https://thecelebscloset.com/wp-content/uploads/2018/04/maxresdefault-1.jpg", "https://cdn.shortpixel.ai/client/q_glossy,ret_img,w_700/https://thecelebscloset.com/wp-content/uploads/2018/04/og-sebastian-bear-mcclard-35609-1.jpg", "https://cdn.shortpixel.ai/client/q_glossy,ret_img/https://thecelebscloset.com/wp-content/uploads/2018/04/maxresdefault-1.jpg", "https://cdn.shortpixel.ai/client/q_glossy,ret_img,w_728/https://thecelebscloset.com/wp-content/uploads/2017/11/liza-koshy-10-million.jpg", "https://cdn.shortpixel.ai/client/q_glossy,ret_img,w_768/https://thecelebscloset.com/wp-content/uploads/2018/11/gettyimages-996707518-h_2018.jpg", "https://cdn.shortpixel.ai/client/q_glossy,ret_img/https://thecelebscloset.com/wp-content/themes/mh-magazine/images/placeholder-medium.png", "https://cdn.shortpixel.ai/client/q_glossy,ret_img,w_600/https://thecelebscloset.com/wp-content/uploads/2018/07/Gus-Caleb-Smyrnios-Bio-Wiki-Net-Worth.jpg", "https://cdn.shortpixel.ai/client/q_glossy,ret_img,w_600/https://thecelebscloset.com/wp-content/uploads/2018/08/15SHONDA-1-articleLarge.jpg"], "top_img": "https://thecelebscloset.com/wp-content/uploads/2018/04/maxresdefault-1.jpg", "keywords": [], "authors": [], "canonical_link": "https://thecelebscloset.com/asa-soltan-rahmati-boyfriend-married-child-bio/", "title": "Asa Soltan Rahmati Boyfriend, Marriage, Child, Net worth, Career, Bio", "meta_data": {"msvalidate.01": "88C6C66D7E6BE4E4E74752A7D8CD8B20", "viewport": "width=device-width, initial-scale=1.0", "atdlayout": "articlepage", "fb": {"pages": 1807579692887934}, "description": "Asa Soltan Rahmati welcomed a child with her longtime boyfriend. Know Asa Soltan Rahmati bio: parents,family, wiki: age, net worth, height, ethnicity, career, nationality, and hair.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Asa Soltan Rahmati Boyfriend, Marriage, Child, Net worth, Career, Bio", "description": "Asa Soltan Rahmati welcomed a child with her longtime boyfriend. Know Asa Soltan Rahmati bio: parents,family, wiki: age, net worth, height, ethnicity, career, nationality, and hair.", "url": "https://thecelebscloset.com/asa-soltan-rahmati-boyfriend-married-child-bio/", "site_name": "Thecelebscloset", "updated_time": "2019-07-02T07:16:47+00:00", "image": {"identifier": "https://thecelebscloset.com/wp-content/uploads/2018/04/maxresdefault-1.jpg", "secure_url": "https://thecelebscloset.com/wp-content/uploads/2018/04/maxresdefault-1.jpg", "width": 1280, "height": 720}}, "article": {"publisher": "https://www.facebook.com/thecelebscloset", "tag": "TV personality", "section": "Entertainment", "published_time": "2018-04-09T18:19:43+00:00", "modified_time": "2019-07-02T07:16:47+00:00"}, "twitter": {"card": "summary_large_image", "description": "Asa Soltan Rahmati welcomed a child with her longtime boyfriend. Know Asa Soltan Rahmati bio: parents,family, wiki: age, net worth, height, ethnicity, career, nationality, and hair.", "title": "Asa Soltan Rahmati Boyfriend, Marriage, Child, Net worth, Career, Bio", "site": "@celebscloset1", "image": "https://thecelebscloset.com/wp-content/uploads/2018/04/maxresdefault-1.jpg", "creator": "@celebscloset1"}, "msapplication-TileImage": "https://thecelebscloset.com/wp-content/uploads/2019/01/cropped-thecelebscloset-logo-1-270x270.png"}, "movies": ["https://www.youtube.com/embed/f4o34NpDfFo?feature=oembed"], "publish_date": 1523297983.0, "source": "https://thecelebscloset.com", "summary": ""}