{"url": "https://www.usatoday.com/story/sports/olympics/2018/05/14/tonya-harding-adam-rippon-mirai-nagasu-dancing-stars/609641002/", "text": "If Adam Rippon and Jenna Johnson were taking a chance with a contemporary dance that started inside a bird cage Monday night, it was a chance that solidified him as the favorite to win the mirror ball trophy next week on Dancing with the Stars.\n\nThe openly gay Olympic figure skater, wearing a feathered costume worthy of Johnny Weir, scored three 10s and a 9 to highlight the third week of the special four-week all-athletes season and advance to next Monday's finale. The dance was so good that judge Bruno Tonioli told him and partner Jenna Johnson, “It’s impossible to tell who is the professional.”\n\nThat’s a compliment to both, not to mention something generally said of winners over the 25 seasons.\n\n“Perfect!” said Shauna Fuhs, the pom coach at Gaithersburg (Md.) High School who has been scoring DWTS for USA TODAY the last three seasons and for herself the last nine. “Wanted to rewind it as soon as it was over. Cool choreography. Really stayed in sync. They have the best partnership of the season.”\n\nMore:'Dancing with the Stars' now part of Adam Rippon's fun, whirlwind life\n\nMore:Harding rolls on, but Rippon, Nagasu still rule 'Dancing with the Stars'\n\nThe only one who could technically catch him was surprisingly sent home: close friend and fellow 2018 Olympic figure skater Mirai Nagasu. Despite consistent performances, she never seemed to gain favor with the fans, her Valley girl persona perhaps becoming a bit grating.\n\nWhich brings us to Tonya Harding, who has made next week’s three-person finale along with Washington Redskins defensive back Josh Norman.\n\nThe way Harding was promoted coming into the season as a figure skating legend, it was clear the producers were riding her story and the controversy off the movie about her life. The attack on Nancy Kerrigan and the subsequent revelation of how much she knew were never really mentioned. It was quite telling after her individual dance Monday that judge Carrie Ann Inaba said to her “We’re all in your corner.”\n\nHarding later said “Thank you, America,” for the support. And she cried, as she has each week.\n\nAsked during the show what it would mean to make the final, she said, “That I had the chance and I made it. Whether I win or not, that doesn’t matter. What matters is that I’m here and having a wonderful time, and I don’t want to leave.”\n\nAnd so we were not able to say, “Bye, Tonya.”\n\nAlso sent home were Olympic luger Chris Mazdzer and Olympic softball pitcher Jennie Finch-Daigle.\n\nThe clutch performance of the night was by Norman. He scored 36 — second only to Rippon in the individual performance — doing a contemporary dance with partner Sharna Burgess.\n\nSaid Fuhs, “Impressive. Showed off his strength and grace at the same time. Seemed very at ease. Sharna always does the best job of choreographing her partner’s stories, which makes them better able to connect with the routine.\"\n\nPopular baseball player David Ross, the Season 24 runner-up, came back as a guest judge.\n\nThe four-week season, a first for the show, allowed no room for error, which should not have bothered athletes who live under that kind of pressure.\n\nFor example, Fuhs said of Nagasu: “Quality performance of what we would normally see later in the longer seasons, like week eight. It’s only their third week doing this.”\n\nYet, that could not overcome a lack of viewer support, though we never see the viewer votes.\n\nWhat the truncated season did not allow for was the growth you can see over, say, 10 weeks. Even Inaba told Finch-Daigle she wished there were more weeks in the season for her to improve.\n\nWould a longer season have produced a different final three? Rippon was a lock. Some of us thought Nagasu was. Norman was getting better and better. Maybe the question then would have been: Could America have taken six more weeks of Harding?", "images": ["https://media.gannett-cdn.com/29906170001/29906170001_5708245331001_5708214366001-vs.jpg?pubId=29906170001&width=660&height=372&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/e7e4f2e9905dd9e407160ad009a81fa77c41cc0b/c=0-67-1992-1193/local/-/media/2018/05/14/USATODAY/USATODAY/636619348991558433-GTY-953292756-99555711.JPG?width=1992&height=1126&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/e7e4f2e9905dd9e407160ad009a81fa77c41cc0b/c=0-67-1992-1193/local/-/media/2018/05/14/USATODAY/USATODAY/636619348991558433-GTY-953292756-99555711.JPG?width=1992&height=1126&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/sports/olympics/2018/05/14/tonya-harding-adam-rippon-mirai-nagasu-dancing-stars/609641002/", "title": "Adam Rippon dominates 'DWTS,' Mirai Nagasu goes home, Tonya Harding makes the finals", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Adam Rippon dominates 'DWTS,' Mirai Nagasu goes home, Tonya Harding makes the finals", "description": "Dancing with the Stars set its athletes finale with Adam Rippon, Tonya Harding and Josh Norman while Mirai Nagasu was surprisingly sent home.", "url": "https://www.usatoday.com/story/sports/olympics/2018/05/14/tonya-harding-adam-rippon-mirai-nagasu-dancing-stars/609641002/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/e7e4f2e9905dd9e407160ad009a81fa77c41cc0b/c=0-67-1992-1193/local/-/media/2018/05/14/USATODAY/USATODAY/636619348991558433-GTY-953292756-99555711.JPG?width=1992&height=1126&fit=crop&format=pjpg&auto=webp", "width": 1992, "height": 1126}, "type": "article"}, "article": {"author": "Thomas O'Toole", "content_tier": "free", "opinion": "false"}, "description": "Dancing with the Stars set its athletes finale with Adam Rippon, Tonya Harding and Josh Norman while Mirai Nagasu was surprisingly sent home.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/e7e4f2e9905dd9e407160ad009a81fa77c41cc0b/c=0-67-1992-1193/local/-/media/2018/05/14/USATODAY/USATODAY/636619348991558433-GTY-953292756-99555711.JPG?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Adam Rippon dominates 'DWTS,' Mirai Nagasu goes home, Tonya Harding makes the finals", "description": "Dancing with the Stars set its athletes finale with Adam Rippon, Tonya Harding and Josh Norman while Mirai Nagasu was surprisingly sent home."}}, "movies": [], "publish_date": 1526227200.0, "source": "https://www.usatoday.com", "summary": ""}