{"url": "https://www.bustle.com/p/keshas-learn-to-let-go-highlights-her-uplifting-method-of-moving-on-video-72993", "text": "Kesha continues to show why she is one singer fans can truly connect with. Accompanying the release of her new song, \"Learn To Let Go,\" the 30-year-old wrote a stand-out piece explaining the meaning behind the song for The Huffington Post. In the essay, Kesha says she is learning to let go after everything she has endured in her past. The musician has been extremely open about her struggles, including battling an eating disorder, suffering from depression, and her ongoing lawsuit with music producer Dr. Luke.\n\nAccording to Kesha, \"Learn To Let Go\" has \"become one of [her] mantras over the last few years.\" Her past is something that she refuses to let define who she is now or prevent her from moving forward, especially when it comes to her career. \"You have to learn to let go of those bad feelings and move forward,\" she writes. \"We all have bias based on whatever our own story and life experience has been, but really the only way to truly evolve is to let the past be the past and move forward with an open heart.\"\n\nIt's easy to let people who have wronged you or let the difficulties you have faced \"haunt you forever,\" as Kesha puts it, but why give them that power? \"Learn from your mistakes but don’t dwell on them, and if you feel like someone has wronged you, let that be their problem ― not yours,\" the \"Praying\" singer notes.\n\nIt may be easier said than done to move on from a situation that has influenced your life negatively, but her advice is something that almost anyone could try apply to their own life. It could inspire people to take their lives by the reins and steer them in the direction they've been hoping to.\n\nThat's exactly what I plan to do. I identify with everything Kesha wrote. We have had two very different life experiences, but that doesn't mean I can't find comfort in what she's saying.\n\nWhen I first lost my 16-year-old brother in a car accident 18 years ago, it was traumatic, to say the least. To make matters worse, there were some family and friends who chose to treat me and my family in unsympathetic ways that were even cruel at times. In most ways, we've managed to move forward with our lives and put much of the toxicity behind us. However, I would be lying if I said it doesn't affect us in a small way today. Letting go of the past completely is tough, but after hearing Kesha express herself in such a light and free way makes me want to cut even that extremely small portion of negativity out of my life for good.\n\nShe truly has a way with words — even when she's not singing.\n\nkeshaVEVO on YouTube\n\nIn another part of Kesha's essay, she shares that looking back on her childhood has greatly impacted her life. It's something she also incorporated into her \"Learn To Let Go\" video by including home videos of herself as a little girl. \"It’s this idea of reconnecting to my child-like self because that’s when you are so full of wonder and joy,\" the Rainbow artist explains. \"You can choose to learn from the bullsh*t along the way but not dwell on it and instead connect with that joyful childhood innocence.\"\n\nWho would've ever thought that looking to your childhood might be able to help you out of a rut? It really does make sense, and is an interesting technique that could push you to a more carefree space.\n\nOf course, pain isn't something that goes away overnight. Sometimes you have to work at being happy, which is absolutely OK. And when you have someone like Kesha who opens up about her dark days, but then also shows you how to learn from and let go of the darkness at the same time, well, it's a beautiful thing.", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/4/ed906c28-a728-4e62-a5ca-6ee53b9f10cb-getty-1169491940.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2017/7/27/8cbeb2e3-03b5-438c-8e2b-bc7f63745f6d-getty-454094126.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/14/140f13e5-57be-4d8b-913a-b3ee39ca0dfd-getty-122716729.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/16/15a1f2f4-ea42-4f95-87bf-1968752f2ced-gettyimages-74684761.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2017/7/27/8cbeb2e3-03b5-438c-8e2b-bc7f63745f6d-getty-454094126.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/6/6ec3dcb8-566d-4631-88db-11d6dac03c81-8955bb08-cd84-48c9-b83d-bc8ad846cb05-getty-161442774.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2017/7/27/8cbeb2e3-03b5-438c-8e2b-bc7f63745f6d-getty-454094126.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/keshas-learn-to-let-go-highlights-her-uplifting-method-of-moving-on-video-72993", "title": "Kesha’s “Learn To Let Go” Highlights Her Uplifting Method Of Moving On — VIDEO", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/keshas-learn-to-let-go-highlights-her-uplifting-method-of-moving-on-video-72993", "type": "article", "title": "The Way Kesha Let Go Of The Past Could Make You Rethink Life, Too", "description": "Kesha continues to show why she is one singer fans can truly connect with. Accompanying the release of her new song, \"Learn To Let Go,\" the 30-year-old wrote a stand-out piece explaining the meaning behind the song for The Huffington Post. In the…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2017/7/27/8cbeb2e3-03b5-438c-8e2b-bc7f63745f6d-getty-454094126.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Kesha continues to show why she is one singer fans can truly connect with. Accompanying the release of her new song, \"Learn To Let Go,\" the 30-year-old wrote a stand-out piece explaining the meaning behind the song for The Huffington Post. In the…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}