{"url": "www.cosmopolitan.com/entertainment/celebs/a13856745/celeb-feuds-2017/", "text": "1. Drake Bell and Josh Peck\n\nGetty\n\nThe stars of Nickelodeon's Drake & Josh had a falling out in June, after Josh Peck married his longtime girlfriend, Paige O'Brien, and didn't invite Drake Bell to his wedding. Drake shared his hurt on Twitter, saying, \"When you’re not invited to the wedding the message is clear ... True colors have come out today. Message is loud and clear. Ties are officially cut. I’ll miss you brotha.\" He deleted the tweets, but his words live on in screenshots.\n\nJosh Peck got married yesterday and Drake Bell just tweeted this 😭 my favorite childhood tv show brothers pic.twitter.com/Xqq0AoLuOD — Amber Leeann Secrest (@AmbySecrest) June 18, 2017\n\nAccording to E! News, Drake also wrote and deleted that \"Loyalty is key... ALWAYS remember where you came from.\"\n\n\n\nA co-star who was invited to the wedding? John Stamos, from the now defunct FOX show Grandfathered. He addressed the feud thusly:\n\nIn July, Drake walked back his initial comments, telling People, \"There are no hard feelings. He’s been my best friend for 18 years. In all honesty, we talk all the time, we’ve been talking.\" He expanded on that sentiment in a Facebook Live interview with Entertainment Tonight, saying:\n\nWe've been together 18 years, Josh and me ... We've been so close, it was just one of those things where you know, I'd been talking to him, and he's been telling me about the engagement. And then I saw [the wedding] on social media. So it was just one of those things where it was just like, 'You didn't even tell me?! I had to find out on social media?' And then you're like, 'You know what?! Fine!’ And then I'm like, 'Wait, I probably shouldn't have done that.'\n\nThe guys attended the MTV Video Music Awards in August and shared matching Instagram posts to prove that all was forgiven.\n\n2. Caitlyn Jenner vs. The Kardashians\n\nGetty\n\nCaitlyn Jenner released her memoir, The Secrets of My Life, on April 25, sharing some less than flattering details about her relationship with Kris Jenner, to whom she was married for nearly 25 years. \"My heart breaks for my mom,\" Kim Kardashian West said on The Ellen DeGeneres Show. \"I don’t think it’s necessary. I just feel like it’s unfair, things aren’t truthful.\"\n\nAmong other things, Caitlyn claimed that Kris had total control of her finances when they were married and that it was Caitlyn who came up with the idea for Keeping Up With the Kardashians, not Kris. \"It’s taken her a really long time to be honest with herself so I don’t expect her to be honest about my mom now,\" Kim told Ellen. \"But it’s just so hurtful. I wish her all the success in the world, but not at our expense.\"\n\nIn October, on the season-14 premiere of Keeping Up With the Kardashians, Kim more pointedly called Caitlyn a \"liar\" and \"not a good person\" for writing that Robert Kardashian knew O.J. Simpson was guilty but joined his defense team anyway. \"If you talk about my dad,\" Kim said, \"I will cut you.\" Later in the episode, Khloé called Caitlyn a \"bad, mean person\" and Kris cried via FaceTime about feeling blindsided by her ex's memoir.\n\n\n\nSpeaking to students at the U.K.’s Cambridge Union in November, Caitlyn said she hadn't talked to Kim in a year. (And she'd previously said she hadn't talked to Kris since the release of her book.) \"It’s been a little tough over the last couple of years on the Kardashian side,\" she said, according to the Cambridge News (via Us Weekly). \"To be honest, I don’t talk to them anymore. Kim I haven’t talked in a year. They don’t want me in their lives, they bashed me pretty badly. It’s devastating when your kids do that. It really hurt. I don’t know what the future holds. We will see.\"\n\n3. Justin Bieber vs. Marilyn Manson\n\nGetty\n\nLast year, Team Bieber sold a repurposed Marilyn Manson t-shirt designed by Fear of God for $195 at Barneys, but according to Marilyn, they did so without his permission. Marilyn told Consequence of Sound that Justin was wearing the t-shirt when they met \"and he said to me, 'I made you relevant again.' Bad mistake to say to me.\" Marilyn claimed to eventually get \"all the proceeds from those shirts,\" without Justin's team even putting up a fight, and he called Justin a \"real piece of shit in the way he had the arrogance to say that.\"\n\n\"He was a real touchy-feely guy, too, like, 'yo yo bro!' and touches you when he’s talking. I’m like, you need to stand down, you’re dick height on me, ok? Alright? So stand down, son.\"\n\nIn a conversation with Howard Stern, Marilyn put the beef to rest by sharing a text exchange initiated by Justin, which Stern read on air. \"I thought we had a pretty pleasant interaction,\" Justin texted. \"Also, if anything wasn’t squared away with the T-shirts, I’m so sorry. Anyway, regardless, it kind of stung seeing that I came off as an asshole or even just was an asshole, I’m sorry...\"\n\n\"That was exaggerated,\" Marilyn responded. \"You were just being you, no beef here.\" He continued:\n\nWe are cool. People just made that shirt stuff into a fake feud,” Stern said reading Manson’s text to Bieber. Let’s turn it upside down and f— the press and do something together. It will be the best. And don’t apologize. You weren’t an asshole. They asked if you were and I sort of agreed. I wasn’t out to get you. If not, I’ll try to avoid more questions today on Stern.\n\nIf only Justin would apologize for selling the shirt for $195.\n\n4. Camila Cabello vs. Fifth Harmony\n\nGetty\n\nCamila Cabello may have quit Fifth Harmony in December 2016, but the hard feelings carried over into the new year. In February, Camila told Billboard she left the band in part because she took issue with singing \"other people's words.\"\n\n\"You have to follow and honor that inner voice,\" she told the magazine ... \"We didn’t write our records. We were interpreting somebody else’s story. Fifth Harmony is an entity or identity outside all of us, and I don’t think anybody felt individually represented by the sound — we didn’t make it.\" She also said that she hadn't intended for her departure to be as dramatic or messy as it was, but that she's \"only got love\" for her former band members.\n\nThe group was featured in Galore magazine in April, its first cover as a foursome, and although they didn't mention Camila by name, fans read between the lines. Possibly shady quotes included, \"the four of us are really in sync with each other\" and \"for us, communication is really important.\" They got more pointed with Billboard magazine in July, telling the magazine, \"Let's just say we’re in a better place now — there are no secrets in this circle.\"\n\nThe feud-iest moment came at the MTV Video Music Awards in August, when Fifth Harmony mysteriously opened their performance of \"Angel\" with five members onstage — only to boot that fifth person \"into outer-space\" just as the vocals kicked in.\n\nIn a subsequent interview with Radio Disney, Camila didn't directly address the VMAs stunt directly, but said, \"Fifth Harmony represented this confidence and girl power. I wouldn’t be the person or that artist that I feel like I’ve discovered, so I’m super thankful for that experience.\"\n\n5. Taylor Swift vs. Katy Perry\n\nGetty\n\nYou're probably thinking, Wasn't this a feud from 2014? — in which case, you'd be right. Yet here we are. The feud started with a 2014 Rolling Stone interview, in which Taylor Swift cryptically revealed that Katy Perry was the inspiration for \"Bad Blood.\"\n\n\"It had to do with business,\" Taylor said. \"[This person] basically tried to sabotage an entire arena tour. She tried to hire a bunch of people out from under me … So now I have to avoid her. It’s awkward, and I don’t like it.\" Katy tweeted:\n\nWatch out for the Regina George in sheep's clothing... — KATY PERRY (@katyperry) September 9, 2014\n\nFast-forward to this May, when Katy appeared on a Carpool Karaoke Primetime Special with James Corden after releasing\"Swish Swish,\" her Taylor diss track (even if she refused to call it that herself).\n\n\"Honestly, it’s really like she started it and it’s time for her to finish it,\" Katy said. She also gave her side of the \"backup dancers\" story, saying, \"I tried to talk to [Taylor] about it … she wouldn’t speak to me. I do the right thing anytime that it feels like a fumble. It was a full shut-down and then she writes a song about me and I’m like, 'OK, cool cool cool. That’s how you wanna deal with it?'\"\n\nStill not done talking about Taylor, Katy then told NME, \"I mean, I'm not Buddha — things irritate me. I wish that I could turn the other cheek every single time, but I'm also not a pushover, you know? Especially when someone tries to assassinate my character with little girls [her fans]. That's so messed up!\"\n\nOn June 11, Katy seemed to have a change of heart. In an interview with Ariana Huffington on her Thrive Global Podcast, she said she was \"ready to let it go\" and apologize to Taylor. \"I forgive her and I’m sorry for anything I ever did, and I hope the same from her. I think it’s actually like, I think it’s time. There are bigger fish to fry, and there are real problems in the world. You know what I’m saying?\" She added:\n\nI love her, and I want the best for her. And I think she's a fantastic songwriter, and I think that if we, both her and I, can be representatives of strong women that come together despite their differences, I think the whole world is going to go like, 'Yeah, well we can do this.' I don't know. Maybe I don't agree with everything she does and she doesn't agree with everything I do, but I just really, truly want to come together in a place of love and forgiveness and understanding and compassion.\n\nGood call. This feud was getting tired.\n\n6. Taylor Swift vs. Kanye West and Kim Kardashian West\n\nGetty\n\nThis feud has spanned nearly a decade. The latest installment to the saga came when Taylor Swift released \"Look What You Made Me Do,\" the first single off her album Reputation. It didn't take a detective, or even a particularly astute blogger, to spot the Kimye references. (\"I don't like your little games / Don't like your tilted stage / The role you made me play / Of the fool, no, I don't like you.\") Other songs off Reputation seemed to address the feud as well.\n\nThe Kardashian-West's didn't respond to the album explicitly, but some took Kim's hanging out with Katy Perry on the day Taylor's album dropped as a swipe at the snake-affiliated pop star.\n\n7. Jay-Z vs. Kanye West\n\nGetty\n\nDuring his Saint Pablo tour last year, Kanye West went off on his long-time collaborator and friend Jay-Z. Among his grievances were a falling out they had over some \"Tidal-Apple bullshit,\" the fact that their children had never played together, and Jay-Z’s failure to reach out to Kanye after Kim Kardashian-West was robbed at gunpoint in Paris. He also criticized Beyoncé, saying, \"Beyoncé, I was hurt cause I heard you said you wouldn't perform [at the Grammys] unless you won Video of the Year over me and over 'Hotline Bling.'\"\n\nJay-Z responded on his album 4:44, which came out in June. On \"Kill Jay-Z,\" he raps, \"But you ain’t the same, this ain’t KumbaYe/ But you got hurt because you think KumbaYe/ You gave him 20 million without thinkin’/ He gave you 20 minutes on stage, fuck was he thinkin’?/ 'Fuck wrong with everybody?' is what you sayin’/ But if everybody’s crazy, you’re the one that’s insane.\" And on \"BAM,\" Jay-Z seemed to reference Kanye’s \"30 Hours\" — in which Kanye raps \"I hit the gym, all chest no legs\" — with the lyric \"Uh, n*ggas is skippin’ leg day just to run they mouth.\" As Consequence of Sound points out, \"BAM\" also samples \"Bam Bam\" by Sister Nancy, which Kanye samples on \"Famous.\"\n\n8. Tyrese Gibson vs. Dwayne \"The Rock\" Johnson\n\nGetty\n\nIn September, Tyrese Gibson commented on The Rock's Instagram to express his dismay that Fast & Furious 9 might be delayed in favor of a spinoff about The Rock's character, Hobbs. \"If you move forward with that #Hobbs Movie you will have purposely ignored the heart to heart moment we had in my sprinter,\" he wrote, according to E! (the comment has since been deleted). \"I don't wanna hear from you until you remember what we talked about. I'm on your timeline cause you're not responding to my text messages – #FastFamily is just that a family… We don't fly solo.\"\n\nIn October, the Fast & Furious 9 release date was indeed bumped from April 2019 to April 2020. Tyrese offered a sarcastic congratulations to The Rock \"for making the fast and the furious franchise about YOU.\"\n\nOn November 1, Tyrese announced that he would not return to the Fast franchise if the movie also starred The Rock. \"You mess with family and my daughters survival I mess with yours,\" he wrote. (On more than one occasion, Tyrese suggested that The Rock was standing in his way of providing for his family.)\n\nThe following day, Tyrese claimed that an associate for The Rock reached out to smooth things over. \"This will be my last post about him........ I️ repeat my last.... I️ respect the associate who called,\" he said. \"My story will never change I️ was never DJ’s Co-Star... I’m Shayla’s Father first.... \"\n\nThe Rock never commented directly, but Tyrese did post a video of his co-star trashing his album Black Rose.\n\nCelebrity feuds come at you fast (and furious).\n\nFollow Cosmo Celeb on Facebook.\n\n", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kardashian-1511290026.jpg?crop=1.00xw:1.00xh;0,0&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylorswift-katyperry-1560367163.gif?crop=1.00xw:1.00xh;0,0&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-485482657-1511357389.jpg?crop=0.952xw:0.680xh;0.0240xw,0.0870xh&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-485482657-1511357389.jpg?crop=0.952xw:0.680xh;0.0240xw,0.0870xh&resize=1200:*", "keywords": [], "authors": ["Patti Greco", "Patti Greco Is A Freelance Writer", "Editor Based In Brooklyn."], "canonical_link": "https://www.cosmopolitan.com/entertainment/celebs/a13856745/celeb-feuds-2017/", "title": "8 Juiciest Celebrity Feuds of 2017", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "8 Juiciest Celebrity Feuds of 2017", "description": "Stars can be quite petty.", "url": "https://www.cosmopolitan.com/entertainment/celebs/a13856745/celeb-feuds-2017/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-485482657-1511357389.jpg?crop=0.952xw:0.680xh;0.0240xw,0.0870xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2018-03-16 05:20:46", "published_time": "2017-11-27 02:00:00", "section": "Celebs", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-485482657-1511357389.jpg?crop=0.952xw:0.680xh;0.0240xw,0.0870xh&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "8 Juiciest Celebrity Feuds of 2017", "description": "From Drake Bell and Josh Peck to Katy Perry and Taylor Swift, these are the biggest celebrity feuds of 2017.", "keywords": "celeb feuds, celeb feuds 2017", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-485482657-1511357389.jpg?crop=0.700xw:1.00xh;0.151xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrities & Entertainment,entertainment,celebs", "sailthru.date": "2017-11-27T14:00:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-485482657-1511357389.jpg?crop=0.952xw:0.680xh;0.0240xw,0.0870xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-485482657-1511357389.jpg?crop=0.700xw:1.00xh;0.151xw,0", "sailthru.socialtitle": "8 Juiciest Celebrity Feuds of 2017", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1511719200.0, "source": "http://www.cosmopolitan.com", "summary": ""}