{"url": "https://www.indiewire.com/2018/01/david-simon-james-franco-deuce-hbo-sexual-harassment-1201916343/", "text": "Five women accused Franco of sexually exploitative behavior in a report published by the Los Angeles Times.\n\n“The Deuce” creator and writer David Simon is assuring fans that James Franco was “entirely professional” on the set of the HBO porn drama following sexual harassment allegations made against the actor. Franco stars in the show but also directed several episodes and serves as one of its producers.\n\n“I’m still reading it the same as everyone else, trying to discern what is or isn’t there,” Simon told Variety in a statement. “Personally I can only speak knowledgeably to ‘The Deuce.’ I’ve checked with all my fellow producers and other personnel. We have no complainant or complaint or any awareness of any incident of concern involving Mr. Franco. Nor has HBO been approached with any complaint.\n\nSimon concluded: “In our experience, he was entirely professional as an actor, director, and producer.”\n\nThe Los Angeles Times published a report on January 11 in which five women went on record accusing Franco of sexually inappropriate and exploitative behavior. Four of the accusers are Franco’s former acting students. The majority of the accusations allege Franco pressured women into appearing nude on film sets.\n\n“I feel there was an abuse of power, and there was a culture of exploiting non-celebrity women, and a culture of women being replaceable,” Sarah Tither-Kaplan told the Times about Franco’s set.\n\nPopular on IndieWire\n\nTither-Kaplan was acting in Franco’s film “The Long Home” when she was asked by a producer to appear in a “bonus scene” that included a simulated orgy. The actress agreed to appear fully nude in the background of the scene, but she says she observed Franco allegedly remove clear plastic guards that covered actresses’ vaginas “to simulate the sex act with no protection.”\n\nAnother woman, Violet Paley, says Franco pressured her into performing oral sex on him while sitting in her car in 2016. The two had been in a consensual romantic relationship at the time.\n\n“I was talking to him, all of a sudden his penis was out,” said Paley. “I got really nervous, and I said, ‘Can we do this later?’ He was kind of nudging my head down, and I just didn’t want him to hate me, so I did it.”\n\nFranco has said during appearances on both “The Late Show With Stephen Colbert” and “Late Night With Seth Meyers” that the allegations against him are “not accurate.” The actor told Seth Meyers that he wasn’t going to “actively refute” the accusations since he felt every woman should be able to share her story.\n\n“The Deuce,” in which Franco stars opposite Maggie Gyllenhaal, wrapped up its debut season in October 27 and has been renewed for a second season.\n\nSign Up: Stay on top of the latest breaking film and TV news! Sign up for our Email Newsletters here.", "images": ["https://pmctvline2.files.wordpress.com/2020/04/lady-gaga-one-world-together-at-home.png?resize=230%2C135&w=300", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.indiewire.com&path=%2F2018%2F01%2Fdavid-simon-james-franco-deuce-hbo-sexual-harassment-1201916343%2F&ct=article&lob=indiewire&loc=us&env=desktop&post_id=1201916343", "https://www.indiewire.com/wp-content/themes/indiewire/sprites/logo/Logo_IndieWire.png", "https://i0.wp.com/www.goldderby.com/wp-content/uploads/2017/11/top-chef-season-15-contestants-hosts-Tom-Colicchio.jpg?resize=230%2C135&ssl=1&w=300", "https://www.indiewire.com/wp-content/themes/indiewire/images/indiewire-color.png", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY", "https://www.indiewire.com/wp-content/uploads/2017/08/the-deuce-hbo-season-1-trailer.png", "https://pmcdeadline2.files.wordpress.com/2020/04/taylor-swift-performs-at-global-citizens-concert.png?resize=230%2C135&w=300", "https://i1.wp.com/www.rollingstone.com/wp-content/uploads/2020/04/office-chairs.jpg?resize=230%2C135&ssl=1&w=300", "https://i1.wp.com/www.indiewire.com/wp-content/uploads/2018/06/Zack-Sharf.png?resize=96%2C96&ssl=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.indiewire.com/wp-content/uploads/2017/08/the-deuce-hbo-season-1-trailer.png?w=639", "https://pmcvariety.files.wordpress.com/2020/04/taylorswift_01-e1587277738854.png?resize=230%2C135&w=300"], "top_img": "https://www.indiewire.com/wp-content/uploads/2017/08/the-deuce-hbo-season-1-trailer.png", "keywords": [], "authors": ["Zack Sharf"], "canonical_link": "https://www.indiewire.com/2018/01/david-simon-james-franco-deuce-hbo-sexual-harassment-1201916343/", "title": "David Simon Says James Franco Was ‘Entirely Professional as an Actor, Director, and Producer’ on HBO’s ‘The Deuce’", "meta_data": {"fb": {"pages": 9800035481}, "msvalidate.01": "87B78205BB25666E656DA3EB49F3FD42", "viewport": "width=device-width, initial-scale=1", "st": {"robots": "follow, index"}, "description": "James Franco acted, directed, and produced the HBO porn drama series.", "news_keywords": "David Simon, James Franco, Sexual Harassment", "apple-itunes-app": "app-id=1400654071", "generator": "WordPress 5.4", "author": "Zack Sharf", "content_type": "Article", "post_id": 1201916343, "title": "David Simon Says James Franco Was 'Entirely Professional as an Actor, Director, and Producer' on HBO's 'The Deuce'", "published_at": "2018-01-11 13:08:12", "image": "https://www.indiewire.com/wp-content/uploads/2017/08/the-deuce-hbo-season-1-trailer.png?w=300", "comment_count": 0, "tags": "Sexual Harassment", "topics": "Television", "body": "\"The Deuce\" creator and writer David Simon is assuring fans that James Franco was \"entirely professional\" on the set of the HBO porn drama following sexual harassment allegations made against the actor. Franco stars in the show but also directed several episodes and serves as one of its producers.\r\n\r\n\r\n\r\n\"I’m still reading it the same as everyone else, trying to discern what is or isn’t there,” Simon told Variety in a statement. \"Personally I can only speak knowledgeably to ‘The Deuce.’ I’ve checked with all my fellow producers and other personnel. We have no complainant or complaint or any awareness of any incident of concern involving Mr. Franco. Nor has HBO been approached with any complaint.\r\n\r\nSimon concluded: \"In our experience, he was entirely professional as an actor, director, and producer.\"\r\n\r\nThe Los Angeles Times published a report on January 11 in which five women went on record accusing Franco of sexually inappropriate and exploitative behavior. Four of the accusers are Franco’s former acting students. The majority of the accusations allege Franco pressured women into appearing nude on film sets.\r\n\r\n\"I feel there was an abuse of power, and there was a culture of exploiting non-celebrity women, and a culture of women being replaceable,” Sarah Tither-Kaplan told the Times about Franco's set.\r\n\r\nTither-Kaplan was acting in Franco’s film “The Long Home” when she was asked by a producer to appear in a \"bonus scene\" that included a simulated orgy. The actress agreed to appear fully nude in the background of the scene, but she says she observed Franco allegedly remove clear plastic guards that covered actresses’ vaginas “to simulate the sex act with no protection.”\r\n\r\n\r\n\r\nAnother woman, Violet Paley, says Franco pressured her into performing oral sex on him while sitting in her car in 2016. The two had been in a consensual romantic relationship at the time.\r\n\r\n“I was talking to him, all of a sudden his penis was out,” said Paley. “I got really nervous, and I said, ‘Can we do this later?’ He was kind of nudging my head down, and I just didn’t want him to hate me, so I did it.”\r\n\r\nFranco has said during appearances on both \"The Late Show With Stephen Colbert\" and \"Late Night With Seth Meyers\" that the allegations against him are \"not accurate.\" The actor told Seth Meyers that he wasn't going to \"actively refute\" the accusations since he felt every woman should be able to share her story.\r\n\r\n\"The Deuce,\" in which Franco stars opposite Maggie Gyllenhaal, wrapped up its debut season in October 27 and has been renewed for a second season.", "onesignal": "wordpress-plugin", "og": {"site_name": "IndieWire", "type": "article", "locale": "en_US", "url": "https://www.indiewire.com/2018/01/david-simon-james-franco-deuce-hbo-sexual-harassment-1201916343/", "title": "David Simon Says James Franco Was ‘Entirely Professional as an Actor, Director, and Producer’ on HBO’s ‘The Deuce’", "description": "Five women accused Franco of sexually exploitative behavior in a report published by the Los Angeles Times.", "image": {"identifier": "https://www.indiewire.com/wp-content/uploads/2017/08/the-deuce-hbo-season-1-trailer.png", "width": 639, "height": 356}}, "article": {"published_time": "2018-01-11T18:08:12+00:00", "modified_time": "2018-01-11T18:08:39+00:00", "author": "https://www.indiewire.com/author/zacksharf/", "section": "Television", "tag": "Sexual Harassment"}, "fragment": "!", "msapplication-TileImage": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=270"}, "movies": [], "publish_date": 1515694092.0, "source": "https://www.indiewire.com", "summary": ""}