{"url": "www.townandcountrymag.com/society/a9664508/prince-harry-meghan-markle-relationship/", "text": "Less than a year after their royal wedding, Meghan and Harry have welcomed their first child! Baby boy Sussex arrived on May 6, 2019, weighing 7 pounds and 3 ounces. In honor of their expanding family, we take a the top-secret relationship that lead to one of the highest profile weddings of the decade—and a new chapter in the history of the Windsor family.\n\nHow They Met\n\nHarry and Markle first made each other's acquaintance on a blind date in early July, 2016. \"We were introduced actually by a mutual friend,\" Harry revealed during the couple's first sit-down interview with the BBC following their engagement announcement. (E! News claims Harry's friend Violet von Westenholz is the one who introduced them, but others have speculated it was fashion designer Mischa Nonoo.)\n\nThe only thing that I asked was is he nice? Cause if he wasn't kind, it just didn’t seem like it would make sense.\n\nDespite Prince Harry's global fame, Markle says she didn't have a lot of preconceived notions about who he was before they met. \"Because I’m from the States, you don’t grow up with the same understanding of the royal family,\" she explained during the BBC interview. \"I didn’t know much about him, so the only thing that I had asked [our mutual friend] when she said that she wanted to set us up, was, 'Well is he nice?' Cause if he wasn't kind, it just didn’t seem like it would make sense.\"\n\nPrince Harry and Meghan Markle during the televised interview following the announcement of their engagement. YouTube\n\nThe two hit it off immediately. \"We met for a drink,\" said Markle, \"and then I think very quickly into that we said, 'Well what are we doing tomorrow? We should meet again.'\"\n\nAt the photo call in the Kensington Palace gardens following their engagement announcement, Harry was asked when he knew Markle was the one. He quickly replied, \"the very first time we met.\"\n\nThings moved quickly from there. The couple went on a second date and Prince Harry then invited Markle to accompany him on a trip to Africa just three or four weeks later. \"I managed to persuade her to come and join me in Botswana and we camped out with each other under the stars,\" he said, describing the whirlwind romance. \"Then we were really by ourselves, which was crucial to me to make sure that we had a chance to get to know each other.\"\n\n\n\nThe News Gets Out\n\nAfter four months of quiet dating, the news finally leaked on October 31, 2016 that Prince Harry was dating an American actress. A source told the Sunday Express that Harry is “happier than he’s been for many years” and is \"besotted\" with the Markle. On the same day, Markle posted a sweet photo on her Instagram of two bananas spooning, possibly hinting at the new love in her life.\n\nOf this period, Markle later said: \"We had a good five, six months almost with just privacy, which was amazing.\"\n\nMeghan Meets the Family\n\nMy cup runneth over and I’m the luckiest girl in the world.\n\nIn November 2016, the Vancouver Sun published an interview with Markle promoting her collection for retailer Reitmans. In the interview, she discussed her collaboration with Reitmans, her charity work with World Vision, and her plans for the holidays. Though she avoided any mention of Harry, she happily said, “So, my cup runneth over and I’m the luckiest girl in the world!”\n\nAround the same time, People reported that Harry had already introduced the actress to his father, Prince Charles.\n\nHarry Makes a Public Statement in Defense of His Girlfriend\n\nHarry confirmed his relationship with Markle in a formal statement November 8, 2016. In the statement, Harry also pleads the press and trolls on social media to stop the “wave of abuse and harassment\" that had been directed at his girlfriend.\n\nGetty Images\n\nAccording to Harry, he has been involved with “nightly legal battles” to stop the media from publishing defamatory stories about Markle and their relationship.\n\nPrince Harry is worried about Ms. Markle’s safety and is deeply disappointed that he has not been able to protect her. It is not right that a few months into a relationship with him that Ms. Markle should be subjected to such a storm. He knows commentators will say this is ‘the price she has to pay’ and that ‘this is all part of the game’. He strongly disagrees. This is not a game - it is her life and his.\n\nDuring the BBC interview, Harry revealed that both he and Markle were taken aback by the media scrutiny. \"I think both of us were totally surprised by the reaction.\"\n\nMany assumed that Markle would be prepared for the onslaught of attention because she had been in the public eye as an actress, but little could have prepared her for what was to come. \"There was a misconception that because I have worked in the entertainment industry that this would be something I would be familiar with,\" she said. \"But I've never been part of tabloid culture. I've never been in pop culture to that degree and and lived a relatively quiet life.\"\n\nPrince Harry with school children in Antigua in November, 2016. Getty Images\n\nHer answer, she told the BBC, was to tune out the noise. \"I think we were just hit so hard at the beginning with a lot of mistruths that I made the choice to not read anything, positive or negative. It just didn't make sense and instead we focused all of our energies just on nurturing our relationship.\"\n\n\n\nOn November 18, she shared a Mahatma Gandhi quote on her Instagram, which many people interpreted as a response to Harry's statement on their relationship.\n\nEven Prince William Is Forced to Weigh In\n\nOn November 27, 2016, Prince William released a statement to clear up rumors that he was unhappy with his brother's decision to open up about his relationship. A portion of the statement reads, “The Duke of Cambridge absolutely understands the situation concerning privacy and supports the need for Prince Harry to support those closest to him.\"\n\nHarry and Meghan Continue to Grow Closer\n\nIn early December 2016, Markle is photographed in Toronto wearing a gold necklace featuring the letters “M” and “H.” Later that month, she and Harry are spotted together picking out a 6-foot Christmas tree, and in London's West End holding hands on their way to see the Tony award-winning show The Curious Incident of the Dog in the Nighttime. According to The Sun, the couple walk through the Soho area while admiring the Christmas lights throughout Piccadilly Circus.\n\nGetty Images\n\nThe Queen Approves\n\nAccording to Us Weekly, the Queen is “fully supportive” and another source revealed that the Queen is “delighted to see Harry in a loving relationship.”\n\nGetty Images\n\nMarkle spoke of meeting the Queen during their BBC interview. \"It's incredible to be able to meet her through his lens, not just with his honor and respect for her as the monarch, but the love that he has for her as his grandmother. She's an incredible woman.\"\n\nAfter spending Christmas with their own families, the couple spends New Year's together in London.\n\nMeghan's Family Is Heard From\n\nMeghan’s half-brother Thomas Markle Jr. discloses to the Daily Mail that their father has been aware of Meghan's relationship since it began. In the interview, Thomas says his father is, “pretty happy about Harry and he’s extremely proud of her.\"\n\nMeghan is very close to both her mother and father and attended her mom's graduation from the University of Southern California, after she received her Masters in Social Work in 2016.\n\nAt their engagement announcement, Markle revealed that her father has spoken with Harry several times, but he \"hasn't been able to meet him just yet.\"\n\nA Romantic Trip to Norway\n\nAfter spending New Year's in London, the couple embarks on a romantic trip to Norway. This is the first time that the often incognito couple vacation together and according to Us Weekly, Harry planned the romantic getaway so that the two could to catch the Northern Lights. The couple stay with Harry's close friend, Inge Solheim, at his luxury property in Tromsø, Norway. A source tells the sun The Sun that Harry \"put a lot of thought into it and wanted to make it as romantic and special as possible.”\n\nGetty Images\n\nMeghan Meets Kate and Charlotte\n\nAccording to Us Weekly, in early 2017 Harry introduced his girlfriend to his sister-in-law Kate Middleton and Princess Charlotte at apartment 1A at Kensington Palace. According to the magazine, Kate and Markle, \"got on fabulously.\"\n\nGetty Images\n\n\"She's been wonderful,\" Markle said of Duchess Kate. \"Amazing,\" continued Harry. \"As has William as well, you know, fantastic support.\"\n\n\n\nMaintaining a Long Distance Relationship\n\nThough Markle filmed her USA Network series Suits in Toronto, Canada, she and Harry are spotted in early February holding hands while leaving West London's Soho House. According to The Sun, on-lookers at the member's only club say that the couple tried to remain low key by sitting in a cozy corner of the restaurant. A friend close to the couple also reportedly tells The Sun that a spring engagement is imminent: “I know that sounds a bit crazily soon, but he’s head over heels and they can’t bear to be apart.”\n\nAfter a two-month break from social media, Markle shared an Instagram post on February 12 that said, \"#NoBadEnergy.\"\n\nIn March, the couple traveled together to Montego Bay, Jamaica to attend the wedding of Harry's childhood friend Tom “Skippy” Inskip. Markle is Harry's plus one to the wedding as the prince serves as one of the ceremony's 14 ushers. A source later revealed to People, that the two were incredibly \"joyful\" during the wedding festivities, and seemed very much in love.\n\nIn April, Harry flew from England to spend Easter weekend with Markle in Toronto. Photos are released by E! Online and reveal the young prince wearing a baseball cap and toting a large duffle bag while entering Markle’s building.\n\nMeghan's Life Begins to Change\n\nIn April, Markle announced that she would shut down her lifestyle website, The Tig, which she had founded three years earlier. In a statement shared on both the Tig website and her Instagram, Markle said:\n\nWhat began as a passion project (my little engine that could) evolved into an amazing community of inspiration, support, fun and frivolity. You’ve made my days brighter and filled this experience with so much joy. Keep finding those Tig moments of discovery, keep laughing and taking risks, and keep being the change you wish to see in the world.\"\n\nThough it is rumored that Markle shut down her passion project as a sacrifice to her royal relationship, a source told People that the real reason was her busy schedule, balancing charity work with shooting Suits.\n\n\n\nThe Couple Steps Out\n\nMarkle and Harry made their first public appearance as a couple (and shared a kiss) at the annual Audi Polo Challenge in Ascot, England. As Harry participated in the games, Markle, wearing a chic navy dress and white blazer, cheered on her prince from the sidelines. The couple was later snapped engaging in some PDA off-site in the polo parking lot.\n\nGetty Images\n\nLove is in the Air: Prince Harry and Meghan Markle ❤️💏💑\n\nMaybe the Next Royal Wedding pic.twitter.com/YbOc3Eeyh6 — Royal Ladies (@vaninaswchindt) May 8, 2017\n\nMarkle was back in London in May for Pippa Middleton's wedding, arriving days ahead of the festivities. According to E! Online, the actress landed at London's Heathrow Airport and was immediately escorted to Kensington Palace. While Markle did not attend the ceremony, she did reportedly go to the reception.\n\n\n\nA Big Birthday Trip\n\nThe couple traveled to Africa in August 2017—a year after their first trip to the continent—for a romantic getaway in celebration of Markle's 36th birthday. Over the course of their three-week vacation, they visited Botswana and finished their travels at the stunning Victoria Falls.\n\nMeghan Opens Up\n\nMarkle spoke openly about her relationship for the first time in the October 2017 issue of Vanity Fair. \"We’re a couple. We’re in love. I’m sure there will be a time when we will have to come forward and present ourselves and have stories to tell, but I hope what people will understand is that this is our time,\" she says in the cover story. \"This is for us. It’s part of what makes it so special, that’s just ours. But we’re happy. Personally, I love a great love story.\"\n\nThat month, Markle also accompanied Prince Harry to an official royal appearance for the first time at the Invictus Games opening ceremony. Over the course of the games, cameras catch the pair holding hands at the the Wheelchair Tennis semi-final and spending time with Markle's mother, Doria Ragland. The couple even share a sweet smooch at the closing ceremony.\n\nAt this point, Harry has met Markle's mother several times. \"Her mum's amazing,\" Harry said during the BBC interview.\n\nEngaged!\n\nAfter months of speculation, Prince Harry and Meghan Markle finally announced their engagement on November 27, 2017. The couple is \"thrilled and happy\" to be engaged, and marked the news with a celebratory photoshoot and a formal interview. Read all about the news here.\n\nChris Jackson Getty Images\n\nTheir engagement\n\nIn the months leading up to the wedding, Meghan has been introduced not only to the British public, but also to life as a working royal, as she attends official events alongside her fiancé Harry, all the while planning the wedding of the year.\n\nThe wedding\n\nTens of millions of people from around the world tuned in to see the couple wed at Windsor Castle on May 19. They had high-profile guests like Oprah, David and Victoria Beckham, and of course the royal family, but all eyes were on the bride, who wore a stunning Givenchy gown for the ceremony and a chic halter Stella McCartney dress for the reception at the Frogmore House.\n\nIn their official portraits, released May 21, two days after the wedding, the couple looked more in love than ever.\n\nMeghan and Harry’s official wedding portrait. Alexi Lubomirski/Kensington Palace via AP)\n\nHarry and Meghan start a family!\n\nOn October 15, Kensington Palace announced that the Duke and Duchess of Sussex were expecting their first child. The announcement came as the couple landed in Australia for their first joint royal tour.\n\nThe couple landing in Sydney, Australia. Newspix Getty Images\n\nOn May 6, 2019, Baby Sussex arrived! The baby boy is now seventh in line for the throne and he is the Queen and Prince Philip's eighth great grandchild. Harry's father, Prince Charles and his stepmother, Camilla, Duchess of Cornwall said that they are \"delighted\" with the royal baby's arrival, as are the Queen, Duke of Edinburgh, and the Duke and Duchess of Cambridge.\n\nHere’s one of the first photos of the family of three. WPA Pool Getty Images\n\nBaby boy Sussex is Prince Charles's fourth grandchild. As any royal fan knows, Prince Harry's brother William has three children, Prince George, Princess Charlotte, and little Prince Louis. It is the first grandchild for Meghan Markle's mom, Doria Ragland, who has also issued a sweet statement upon the baby's birth, revealing that she is \"overjoyed by the arrival of her first grandchild.\"", "images": ["https://hips.hearstapps.com/elleuk.cdnds.net/17/21/768x384/landscape-1495720221-gallery-1489053202-gettyimages-468056663-2.jpg?resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/prince-harry-duke-of-sussex-and-meghan-duchess-of-sussex-news-photo-1142164437-1557319677.jpg?crop=1.00xw:0.754xh;0,0.246xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/prince-harry-duke-of-sussex-and-meghan-duchess-of-sussex-news-photo-1142164437-1557319677.jpg?crop=1.00xw:0.754xh;0,0.246xh&resize=1200:*", "keywords": [], "authors": ["Morgan Evans", "Eileen Reslen", "I M Eileen", "The Digital News Reporter At Hearst Digital Media."], "canonical_link": "https://www.townandcountrymag.com/society/a9664508/prince-harry-meghan-markle-relationship/", "title": "Prince Harry & Meghan Markle Relationship Timeline", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#BE3E19", "og": {"type": "article", "site_name": "Town & Country", "title": "Prince Harry and Meghan Markle's Son Arrived Just Days Before Their First Wedding Anniversary", "description": "Here's a look at their love story from the first blind date to the birth of their son.", "url": "https://www.townandcountrymag.com/society/a9664508/prince-harry-meghan-markle-relationship/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/prince-harry-duke-of-sussex-and-meghan-duchess-of-sussex-news-photo-1142164437-1557319677.jpg?crop=1.00xw:0.754xh;0,0.246xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 526594570689062, "pages": 344794953432}, "article": {"publisher": "https://www.facebook.com/TownandCountryMagazine", "modified_time": "2019-05-08 02:52:11", "published_time": "2019-05-08 01:53:00", "section": "Society", "opinion": "false"}, "twitter": {"site": "@TandCmag", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/prince-harry-duke-of-sussex-and-meghan-duchess-of-sussex-news-photo-1142164437-1557319677.jpg?crop=1.00xw:0.754xh;0,0.246xh&resize=640:*"}, "google-site-verification": "musQPiBADe3f4WpT4JNcg9uUChC3qnOhhPLSR4n1urM", "title": "Prince Harry & Meghan Markle Relationship Timeline - How Harry Met Meghan", "description": "Here's a timeline of the Prince Harry and Meghan Markle's whirlwind romance, from May 2016 through their engagement, wedding, and the announcement of Meghan Markle's pregnancy and first baby.", "keywords": "prince harry, meghan markle, prince harry meghan markle, prince harry relationship, prince harry meghan markle timeline, prince harry meghan markle relationship timeline, prince harry meghan markle relationship details, how did meghan meet harry, how did harry meet meghan", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/prince-harry-duke-of-sussex-and-meghan-duchess-of-sussex-news-photo-1142164437-1557319677.jpg?crop=0.668xw:1.00xh;0.167xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Society,society,Meghan Markle,Queen Elizabeth II", "sailthru.date": "2019-05-08T13:53:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/prince-harry-duke-of-sussex-and-meghan-duchess-of-sussex-news-photo-1142164437-1557319677.jpg?crop=1.00xw:0.754xh;0,0.246xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/prince-harry-duke-of-sussex-and-meghan-duchess-of-sussex-news-photo-1142164437-1557319677.jpg?crop=0.668xw:1.00xh;0.167xw,0", "sailthru.socialtitle": "Prince Harry and Meghan Markle's Son Arrived Just Days Before Their First Wedding Anniversary", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1557251580.0, "source": "http://www.townandcountrymag.com", "summary": ""}