{"url": "https://web.archive.org/web/20190203044655/https://screenrant.com/nina-dobrev-ian-somerhalder-relationship-vampire-diaries-trivia-secrets/", "text": "It’s no secret that Ian Somerhalder and Nina Dobrev were in a relationship during the early years on The Vampire Diaries. Somerhalder played Damon Salvatore while Dobrev played Elena Gilbert. They were two of the main characters and worked closely together. As with many leading men and women who are significant others on a TV show, feelings can sometimes grow between them. Often, relationships outside the show become just as official. Some couples barely last beyond the boyfriend/girlfriend stage, but some - like Anna Paquin and Stephen Moyer from True Blood - get married.\n\nSomerhalder and Dobrev tried to remain covert as a couple, often denying rumors they were dating, or speaking obscurely when questions or statements veered towards their suspected relationship. W ith a Hollywood lifestyle, the truth eventually surfaced. The couple dated for 3 years from 2010 to 2013 before ending their relationship to much controversy and speculation - mostly from The Vampire Diaries fan community and the tabloids.\n\nWhile they had secrets during their relationship, not all of them were bad. Some were downright fun, some were friendly, and some involved people (and animals!) outside their relationship. This list lets you know some of those secrets back when they were dating, soon after their breakup, and up until today.\n\nHere’s 15 Secrets Behind Nina Dobrev and Ian Somerhalder’s Relationship.\n\n15 Ian's Test\n\nMost men and women have things they look for when dating or courting someone of the opposite gender. Call them requirements or criteria, but consciously or subconsciously, men and women pay attention to them. In the November 2012 issue of Self magazine, Nina Dobrev told readers and her fans what she required of Ian Somerhalder before they officially became a couple.\n\n“He has to be a happy person,” she said is her relationship requirement. Did he make her happy? He sure did: “You’ll laugh and enjoy life more,” she said. Because Somerhalder is a happy person, she credits him with being one way to deal with any stress in her life. Does Dobrev have other ways? Yes: yoga and chocolate.\n\nIn a previous interview for Seventeen magazine she had more detail in what she meant. “I think people should be with the person who makes them smile.” She states that you shouldn't be in that relationship if you don’t smile anymore. Dobrev praises that it’s okay to have good and bad experiences with dating because you’ll find out what you do and don’t like in a person. “It’s part of growing up and learning,” she added. “You should always be with the people who make you feel happiest.”\n\n14 Nina Didn't Want To Date Co-Stars\n\nBefore The Vampire Diaries, Nina Dobrev had been in a number of television films and had been in a total of 52 episodes of Degrassi: The Next Generation. Already a young star, Dobrev was doing interviews for major teen magazines like Seventeen. She was on the cover the first time in 2010 with the main blurb reading \"Nina: Why she wouldn’t date any of her co-stars.\" Dobrev had said that it “could definitely get sticky if you dated your co-star.”\n\nShe also stated she didn’t need a boyfriend to be happy, but would be with someone if she met them and wanted to be with him. Although she has no problem being single, she would devote her time and love to the person who she became extremely crazy about. Except it can’t be too much work: “Once it’s not fun anymore, it’s not worth it,” she told the magazine.\n\nDobrev wanted to be professional on the show, but then two years later, when she did another interview for Seventeen magazine, she was dating Somerhalder.\n\n“Sometimes you can't help who you have a connection with,” she told Seventeen. She fought her feelings for Ian for a “really, really long time.”\n\n13 Nina Kept The Cat After the Breakup\n\nWhile they were dating, Dobrev and Somerhalder were “parents” to a cat named Moke. After they broke up, it appeared that Dobrev retained “custody” of the feline because she continued to post photos of her and the cat together.\n\nIn April 2013, the couple had to rush Moke to the animal hospital because the cat became suddenly ill. Eventually, Moke became better.\n\nTwo months later, Dobrev was getting ready for a trip when her “kid” hopped in the suitcase. Apparently, the cat didn’t want her to leave. “I think he wants me to bring him too… Won’t leave the suitcase!” she tweeted. In another tweet, she posted a photo with “Kid is helping me pack…” It’s understandable Dobrev would keep the cat; she had always said Ian is a nice guy, so it stands to reason he would let her keep Moke.\n\nHowever, it’s very possibly Somerhalder comes to visit Moke since he considered himself a “parent.” Then again, she may have been taking care of Moke while Ian was away filming a movie at the time, The Anomaly. With the tweets about Moke in the suitcase, she never revealed where she was going, so she may have been returning Moke to Somerhalder. Or it could have been his weekend to have the cat, like in a traditional parenting agreement in a divorce.\n\n12 How Nina and Ian Were Cast\n\nIt was Nina Dobrev’s casting first which helped the creators pick the two other main actors for Stefan and Damon Salvatore. On one of the bonus features for the DVD set, Dobrev said it was a long process, but she ultimately received the role of Elena Gilbert, despite not having blonde hair. The creators were more concerned with the actress than physical features. “It was a sacrifice we had to make,” Julie Plec, a showrunner said.\n\nFor a while, the creators and executive producers couldn’t find actors that had chemistry with Dobrev.\n\nThey especially had trouble find someone to play Damon. Then they found out Ian Somerhalder was interested. Somerhalder stated it was 7-10 days of meetings, interviews, and auditions. He really wanted the role and seemed to impress everyone. “We were convinced he was our guy,” Plec said.\n\nAs soon as it was announced Somerhalder was cast as Damon, everyone had an opinion about the choice. Luckily, the press and fans knew that Somerhalder was perfect to play opposite Dobrev. Even Plec said that she couldn’t think of anyone else in that part. “He is just so good,” she also said. And for three years, Dobrev and Somerhalder were good together in real life too.\n\n11 Nina and Ian Are \"Hippies\"\n\nIn 2012, for an interview with US Weekly, Kat Graham called Ian Somerhalder and Nina Dobrev \"hippies\" when commenting on their relationship. Graham was Somerhalder and Dobrev’s co-star in The Vampire Diaries; she played Bonnie Bennett in the CW series. Graham didn’t call the couple hippies to be mean - she meant it as a very positive way to look at the relationship.\n\nSomerhalder and Dobrev are “genuinely good people who strive toward having a good relationship,” Graham had said. If that is what being a hipping means when dating, then everyone should strive to be a hippie with a significant other.\n\nDuring their 3 years as a couple, Somerhalder and Dobrev appeared to make everything work as best they could, especially since they were constantly in the spotlight. In an interview with the same magazine in 2011, Somerhalder said what he loved the most about Dobrev: “She truly enjoys life. Her desire to experience and appreciate everything around her, and chuckle and enjoy it, is great.”\n\nIn a later interview with People magazine, Graham also called the couple “perfect” because they have “the same values when it comes to people [and] how you treat people.” She added that they are perfect because of how they treat animals, the world, and the environment.\n\n10 Ian As Christian Grey\n\nWhen the 50 Shades of Grey movie was announced and casting begin, Ian Somerhalder was believed to be in the running. During interviews, he gave vague answers to questions about joining the cast of the movie. In the after-show Watch What Happens Live hosted by Andy Cohen, Somerhalder told Cohen, “There are so many young boys in Hollywood up for this role.” He added, “I can’t say anything other than it’s a very interesting story, and whoever plays that role is going to have a lot of fun.”\n\nMore interesting is his answer to who he would have play opposite him as Anastasia. During an interview with Ryan Seacrest on his show On Air with Ryan Seacrest, Somerhalder told Ryan, “I’m going to think about that.” Seacrest mentioned there could be “ramifications” to any answer Somerhalder gives, and the host put words in Somerhalder's mouth, saying “Because I would like to have a happy home.”\n\nAll this meant was Ian didn’t want to say who he’d really like to play Anastasia because Dobrev could possibly get jealous or angry.\n\nTo keep the peace in their relationship, Somerhalder thought it better to just preserve any answers. Seacrest subtly mentioned Somerhalder should text him the answer, so he may know the truth.\n\n9 Were They Dating? Not Dating?\n\nIt took a long time for fans and viewers and websites to figure out Nina Dobrev and Ian Somerhalder were dating. But before that for months (almost a year), the proof piled up in the form of pictures of them spending time and attending events together.\n\nThe first time people wondered if they were together was in Australia, where a photograph surfaced of the two snorkeling together. They also were spotted at the Daintree Rainforest and Great Barrier Reef.\n\nThe two showed additional romantic behavior when they were in an Atlanta restaurant for Valentine’s day. He tweeted the holiday was “corporate” and a “conspiracy of florists and chocolatiers,” but also said the “day serves as a good excuse to spread a little love.” Right after Dobrev denied dating rumors, she and Somerhalder were spotted at Coachella Music Festival looking as if they were in a relationship. There was another incident where Dobrev and Somerhalder were out one night, and she wore a black derby hat Somerhalder had worn just days before. A friendly gesture or not?\n\nThe moment that the couple became subtly official occurred at the 2011 MuchMusic Awards. They arrived together and were caught giving each other a quick kiss behind the scenes. Also, Dobrev was the person Somerhalder mentioned he was most excited to see that night.\n\n8 The Paris Trip\n\nIf there was one point in Dobrev and Somerhalder’s relationship that told everyone they were definitely dating, it was the trip they took together to Paris in 2012. For years, the two rebuked and deflected questions and statements about their dating status. Even before the Paris trip, with sightings at various locations overseas and in the United States, fans and the media just assumed they were together.\n\nThe reason for the trip varied from personal vacations - they weren’t set to film the 4th season of The Vampire Diaries until the fall of that year - to going out with co-stars. On the Saturday they were in Paris, they joined in Julie Plec’s birthday party. Plec is one of the creators of TVD.\n\nAlthough they were spotted apart - usually dodging the hordes of fans who came to see them walk around Paris - Dobrev and Somerhalder were photographed quite often strolling through the streets showing all types of affection.\n\nFrom holding hands to snuggling to intimate and caring touching, the two clearly had the hots for each other.\n\nThis trip was slightly different than the one before it, when the couple brought their mothers, early in their relationship. Of course, they claimed not to have been dating around that time.\n\n7 Nina Helps Still Helps Ian With Puppies After Their Breakup\n\nMonths after Somerhalder and Dobrev ended their relationship, Somerhalder started dating other women and Dobrev was with Derek Hough of Dancing with the Stars. But when Ian’s dog went into labor, Nina was right there to help Ian.\n\nOne day in August 2013, Ian saw a dog trapped in traffic nearby The Vampire Diaries’ sound stages. Ian rescued the dog and ultimately adopted her, but what he didn’t know at the time was the dog - who Ian named Nietzche - was pregnant. He did use the dog’s pregnancy as an opportunity to promote his Ian Somerhalder Foundation, which seeks to end over-population of animals by completing research of “species-specific sterilization drugs.”\n\nNina was present during Nietzche’s labor and supported Ian and his dog-daughter the through whole birthing process. She posted a Whosay picture of the dog and new puppies. She wrote, “Birthing little Nietzsches …Such a beautiful + equally terrifying thing to witness. The miracle of life :) #Wow.”\n\nJust another piece of evidence that Nina and Ian remained good friends after their breakup, just months after the end occurred. If an ex-girlfriend was that mad at you after a split, would she come to help you deliver newborn puppies?\n\n6 They vacationed with their mothers\n\nThe burning question for a long time was “Are Nina Dobrev and Ian Somerhalder dating?” If a previous entry in this list didn’t provide the evidence at the time to answer that query, then this one might. Dobrev and Somerhalder’s Paris trip was a defining moment in their relationship to outsiders and fans of the actor and actress, but what they did on the trip wasn’t exactly telling for everyone.\n\nIt’s an important step when dating to introduce your significant other to your family and your parents - specifically, your mother.\n\nIt must have been serious when Dobrev and Somerhalder brought their mothers along for the ride. Whether or Dobrev and Somerhalder had met each others’ mothers before the trip probably didn’t matter, because all four were spotted out for a shopping stroll in Paris together. The couple sometimes walked a few steps ahead, giving their mothers some time to chat.\n\nIf you wanted additional proof that Dobrev and Somerhalder were a couple, bringing their mothers on the trip further validates the speculation (one of the more positive rumors about them) that they had been dating. It was a simple vacation, but one that further inflamed fans’ hopes about the two together.\n\n5 Ian Had Hard Time Dating After Nina\n\nBreakups are rough. The longer you date or are with someone, the rougher the breakup will be. P ost-breakup life can be even harder, especially when you try to get back into the dating life, if that’s something you plan to do. Ian Somerhalder found out that dating after Nina Dobrev was a hard time.\n\nHe told the German magazine Bravo, “I would be happy if a woman would just go to dinner with me, rather than wanting my babies right away!” While Somerhalder had reportedly wanted to settle down with Dobrev, she wanted to commit to her career. “She’s just too young,” an insider informed In Touch Weekly. Nina wasn’t ready to take the relationship to the next level.\n\nNow Somerhalder was back on the market, looking to move on from his 3-year relationship with Dobrev. In the interview with Bravo, it wasn’t clear who he was going to dinner with; if they were blind dates, other actresses, or women he met while out and about. However, what was clear was that Somerhalder had been traveling between the U.K. and the U.S. filming the movie The Anomaly and getting set for the new season of The Vampire Diaries respectively, so finding a woman to consistently date would be hard enough traveling so much.\n\n4 Post-Breakup Goals\n\nThere were many rumors and stories about Dobrev and Somerhalder’s breakup. Most of them were negative, often spearing the friendship the two had even after they split. It was likely hard enough to be seen together (or not together) in public, but it was probably harder for both of them to endure the rumors and the speculations that ran rampant around the internet.\n\nNo matter how you saw the couple after breaking up, many clues surfaced about their good friendship after dating. Besides, they still had to work together!\n\nThe couple instructed everyone to have breakup goals since, between them, there was no reason either one should hate each other. Dobrev has a personal philosophy that says, “I try to be good to everyone, whether it’s a love, a friend, an ex. I’ll always try to treat people the way I want to be treated.”\n\nDespite those nasty rumors, Dobrev and Somerhalder have proved that two people can move on from a romantic relationship and remain good friends - at least as long as animals are involved! Whatever happened when they were dating, their friendship was strong enough to maintain after the breakup. Their friendship possibly became stronger after splitting up!\n\n3 Cheating Rumors\n\nAfter the breakup, rumors and theories swirled that Somerhalder had cheated on Dobrev with Nikki Reed when they were still together. Celebrity Dirty Laundry claimed that “Everybody connected to the situation claimed that Ian had cheated on Nina.\" This was reportedly because Dobrev didn’t want to “settle down” and she didn’t think their “relationship was going anywhere.”\n\nBut the two women - Nikki Reed and Nina Dobrev - let everyone know years later that they were never jealous of each other or fought over Ian Somerhalder. They dispelled the rumors that they hated each other, and that Reed broke the “girl-code” by dating Somerhalder. Dobrev started off addressing the speculations by posting a picture of her at The Vampire Diaries series finale dinner with Reed and Somerhalder. She wrote, “Can’t believe how time flies. Farewell dinner with team Somereed! So good catching up with these goofballs!”\n\nIt’s hard to know what to believe with sites that run rumors and speculation and spew them as truth, but when the actual truth comes from the people involved, and you can see without a doubt they are being sincere, it’s easy to believe them. After Dobrev posted the dinner picture, Reed took to Instagram for a similar follow-up.\n\n2 The Somerhalder Love Triangle\n\nIan Somerhalder married Nikki Reed in April of 2015. They are currently still married and had a daughter in July of 2017. It was about a year after breaking up with Dobrev that Somerhalder started dating Reed. Somerhalder and Reed were engaged in February 2015.\n\nDespite the obvious adoration Somerhalder felt for Reed, rumors that he was back with Dobrev or was cheating on Reed with Dobrev continued for a time after the marriage.\n\nThe Christian Post claimed Ian and Nikki weren’t “having a great time together” since the wedding. A separation rumor after Somerhalder was ready to have kids with Reed, but she wasn’t ready. The actress wanted to focus on her career, continuing to build it on her terms. Somerhalder infamously threw out Reed's birth control.\n\nThis, and the fact Dobrev was probably coming back to The Vampire Diaries at the time, sparked rumors that Somerhalder had fled back to the arms of Dobrev. It didn’t help that fans were upset when Dobrev left the show (many thought it was because of their breakup) and were equally upset when Somerhalder announced his relationship with Nikki. Fans wanted Dobrev and Somerhalder together, so it was easy to create the drama that Somerhalder went back to Dobrev at the slightest mention of trouble in Somerhalder’s marriage.\n\n1 Nina is friends with Ian's wife\n\nIn February 2017, Nikki Reed went to Instagram and posted a photo and rant about Somerhalder, Dobrev, and herself. In the photo, Reed is surrounded by her husband and Somerhalder to prove that the three are close friends, and have been for several years. The post has over half a million likes, but it’s the accompanying text that is the reason for the post itself.\n\nWhile rumors swirled about the hatred between Reed and Somerhalder, the two girls and Ian have stayed silent on the subject. Reed states she thought “addressing any baseless rumors with silence was the best way.” Reed didn’t want to respond to the stories about friends backstabbing friends, cheating, or fake reasons cast members left The Vampire Diaries. She called out “low-brow” websites that “perpetuated trends.” Being silent, according to her, was an easy way for more “falsities, and juicer stories.” Reed used the Instagram platform to put an end to all the “fake stories of on-set jealous, betrayal…and women hating women.”\n\nThe main purpose of the post was to empower young girls to “end that narrative.” She wanted the headlines taking advantage of a fan’s devotion of a show to stop since those headlines teach hate. “…hopefully we will start to see a shift in the way we treat each other & view ourselves,” she ended the post.\n\n---\n\nDo you have any other trivia to share about Ian Somerhalder and Nina Dobrev's relationship? Let us know in the comments!", "images": ["https://web.archive.org/web/20190203044655im_/https://screenrant.com/public/build/images/mm-logo-full-white.fe72c74c.svg", "https://web.archive.org/web/20190203044655im_/https://screenrant.com/public/build/images/sr-logo-full-white.b0cc2b44.svg", "https://web.archive.org/web/20190203044655im_/https://screenrant.com/public/build/images/th-logo-full-white.7684e614.svg", "https://web.archive.org/web/20190203044655im_/https://screenrant.com/public/build/images/tr-logo-full-white.090c581a.svg", "https://web.archive.org/web/20190203044655im_/https://screenrant.com/public/build/images/tq-logo-full-white.7436bde3.svg", "https://web.archive.org/web/20190203044655im_/http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1", "https://web.archive.org/web/20190203044655im_/https://screenrant.com/public/build/images/tt-logo-full-white.04a6f0d4.svg", "https://web.archive.org/web/20190203044655im_/https://q.quora.com/_/ad/91f52889f6a04390a65ad2591c59986e/pixel?tag=ViewContent&noscript=1", "https://web.archive.org/web/20190203044655im_/https://www.facebook.com/tr?id=297467373958238&ev=PageView&noscript=1", "https://web.archive.org/web/20190203044655im_/https://screenrant.com/public/build/images/cb-logo-full-white.afca2e29.svg", "https://web.archive.org/web/20190203044655im_/https://screenrant.com/public/build/images/tg-logo-full-white.fc9e742a.svg", "https://web.archive.org/web/20190203044655im_/https://screenrant.com/public/build/images/bg-logo-full-white.8242bbb9.svg", "https://web.archive.org/web/20190203044655im_/https://screenrant.com/public/build/images/hc-logo-full-white.5f66cfe4.svg", "https://web.archive.org/web/20190203044655im_/https://screenrant.com/public/build/images/ts-logo-full-white.54beb4cf.svg", "https://web.archive.org/web/20190203044655im_/https://static0.srcdn.com/wordpress/wp-content/uploads/2018/05/Ian-Somerhalder-and-Nina-Dobrev.jpg", "https://web.archive.org/web/20190203044655im_/https://screenrant.com/public/build/images/tv-logo-full-white.642d3d01.svg"], "top_img": "https://web.archive.org/web/20190203044655im_/https://static0.srcdn.com/wordpress/wp-content/uploads/2018/05/Ian-Somerhalder-and-Nina-Dobrev.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20190203044655/https://screenrant.com/nina-dobrev-ian-somerhalder-relationship-vampire-diaries-trivia-secrets/", "title": "15 Secrets Behind Nina Dobrev And Ian Somerhalder’s Relationship", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "description": "Life imitated art when The Vampire Diaries stars Ian Somerhalder and Nina Dobrev dated off screen, but their romance didn't last as long as the show.", "og": {"title": "15 Secrets Behind Nina Dobrev And Ian Somerhalder’s Relationship", "type": "article", "image": {"identifier": "https://web.archive.org/web/20190203044655im_/https://static0.srcdn.com/wordpress/wp-content/uploads/2018/05/Ian-Somerhalder-and-Nina-Dobrev.jpg", "width": 1400, "height": 700}, "url": "https://web.archive.org/web/20190203044655/https://screenrant.com/nina-dobrev-ian-somerhalder-relationship-vampire-diaries-trivia-secrets/", "locale": "en_US", "description": "Life imitated art when The Vampire Diaries stars Ian Somerhalder and Nina Dobrev dated off screen, but their romance didn't last as long as the show.", "site_name": "ScreenRant"}, "article": {"published_time": "2018-05-22T11:05:53Z", "section": "Lists"}, "fb": {"app_id": 822150531210883, "pages": 10765693196}}, "movies": [], "publish_date": 1526987153.0, "source": "https://web.archive.org", "summary": ""}