{"url": "https://www.cosmopolitan.com/entertainment/a8615679/bella-hadid-the-weeknd-dating-timeline/", "text": "Quick refresher: Bella Hadid and The Weeknd, aka Abel Tesfaye, broke up in November 2016 after more than a year of dating. Their demanding work schedules were reportedly the cause of the split, although neither party confirmed what happened. Flash-forward a few years + a major rebound and they’re back together! Here’s how it all went down.\n\n\n\nGiphy\n\nApril 2015\n\nBella and Abel become more than friends after hanging out at Coachella, where he performed. A source tells E! News they were “flirting lots” while a second source reveals Coachella is “where they really clicked.” Us Weekly reveals that the new couple had gone on double dates with Gigi and (then-boyfriend) Cody Simpson as well as Miley Cyrus and Patrick Schwarzenegger (MEMORIES!).\n\nMay 2015\n\nThe new couple remains quiet about their relationship but fans go wild over this tweet:\n\ndon't go around breaking young girls' hearts. — The Weeknd (@theweeknd) May 2, 2015\n\nJuly 2015\n\nAbel is featured in the New York Times, and when asked if he’s in love, offers this: “I don’t know, to be honest with you. I don’t think so. Maybe. It’s no, it’s yes, it’s maybe.”\n\nGetty\n\nAugust 2015\n\nBella and Gigi go on another double date with their beaus Abel and Joe Jonas, respectively, hanging out at L.A. hotspot The Nice Guy. According to People, Taylor Swift is also there.\n\nSeptember 2015\n\nBella and Abel are spotted at New York Fashion Week holding hands.\n\nGetty\n\nOctober 2015\n\nAbel buys Bella a puppy named Hendrix for her 19th birthday.\n\nThey spend her birthday weekend in New York City, along with Gigi and Joe Jonas.\n\n\n\nGetty\n\nIn an interview with Rolling Stone, Abel says he first approached Bella for work and work only. “I actually asked her to be on the artwork for Beauty Behind the Madness. My motive was literally to work with her.” Bella initially declined, leading him to suggest a “face-to-face” meetup. In the RS interview, he points out that their relationship wouldn’t have worked if it happened two years ago (“she couldn’t”), possibly alluding to the fact that she would have been 16 at the time. “But if I’d met someone two years ago, I probably would’ve fucked it up. But I’m more—how do I say it?—clear-thinking now.”\n\nDecember 2015\n\nBella plays a femme fatale in Abel’s new video for “In the Night.” There’s a beautiful shot of them riding on a motorcycle together.\n\n\n\nBefore the end of the year, E! News reports that the couple is taking a break due to their busy schedules. “They are still in each other’s lives though, just not in the same exclusive capacity,” says one source. They spend Christmas apart.\n\n\n\nFebruary 2016\n\nBella and Abel make their red carpet debut as a couple at the 58th Grammy Awards.\n\n\n\nGetty\n\nMarch 2016\n\nAbel supports Bella at the Daily Front Row’s Fashion Los Angeles Awards. They’re too cute for words.\n\nGetty\n\nMay 2016\n\nBella and Abel attend the 2016 Met Gala looking like a million bucks in his-and-hers Givenchy.\n\nGetty\n\nAugust 2016\n\nBella opens up about her boyfriend to Glamour magazine, saying that she often thinks about him when she’s modeling and that when they’re together, he’s “Abel” and not his stage name. “I’m proud of The Weeknd and the music he makes, but I really love Abel.”\n\nShe also reveals why they decided to make their couple debut at the Grammys. “It was a big night for him. He has worked so hard, and he did so well that night. As a girlfriend, I wanted to be there to support him. Seeing him so happy when he won a Grammy made me so happy.” (He was nominated for seven and won two that night).\n\nGetty\n\nOctober 2016\n\nBella and Abel fly off to Tokyo and have the Instagram vacation of your dreams.\n\nUpon their return, the couple celebrate Bella’s 20th birthday. No puppy this time though.\n\nNovember 2016\n\nPeople reports on November 10 that Bella and Abel have split. One source says their schedules, once again, are to blame and that Abel is “focusing on finishing and promoting his album…They still have a great deal of love for one another and will remain friends.”\n\nTwo weeks later, The Weeknd’s new album Starboy is released. Bella and Abel reunite onstage at the Victoria’s Secret Fashion Show, with her making her VS debut and him performing on the show for the second year in a row. “There is no awkwardness,” she tells E! News before hitting the stage. “He is my best friend, and I am excited because I am walking during his performance.”\n\nGetty\n\nBella gives a shout-out to her ex the following day on Instagram, writing, “Thank you @theweeknd for being the best and most incredible performer on the planet. You KILLED it, as always.” No awkward feelings here. Nope.\n\n\n\nJanuary, 2017\n\nTMZ publishes photos of Selena Gomez and Abel making out by a dumpster in Santa Monica. Bella quietly unfollows Selena on Instagram, but everyone notices.\n\nOn January 12, photographer Mert Alas posts—and quickly deletes—a sultry pic of Selena wearing nothing but gold hoops, a matching thong, and a towel. The original photo also included a tag for The Weeknd along with a heart emoji.\n\nThe next day, Bella shares a sexy sideboob selfie (say that three times) on Instagram. Make of this what you will…\n\n\n\nPeople reports that Bella is “hurt and pissed” that her ex has moved on with Selena. This is according to a “source close to the supermodel,” so do read it with a grain of salt. In the same vein, a “Hadid pal” tells Us Weekly that Bella has reached out to Abel “a few times and told him Selena is using him,” as it’s believed the rumored new couple are working on new music together. Meanwhile, this appears on Bella’s Instagram.\n\n\n\nOctober 2017\n\nWhile appearing on Watch What Happens Live With Andy Cohen, Bella’s mom Yolanda reveals that her daughter no longer cares that The Weeknd is dating Selena Gomez. “Not anymore, I think,” she says.\n\nNovember 2017\n\nAbel is photographed leaving Bella’s apartment in New York City, sparking rumors that the two are friendly again. The sighting comes weeks after news broke that Abel and Selena’s relationship had come to an end and that she might have rekindled things with Justin Bieber.\n\nMarch 2018\n\nThe Weeknd releases a new EP, My Dear Melancholy, which features “Call Out My Name,” a song that’s definitely, maybe about ex-girlfriend Selena. “Wasted Times,” which is also on the EP, also raises eyebrows thanks to the lyric, “You were equestrian, so ride it like a champion.” You know who’s had a pretty solid equestrian career? Bella.\n\nApril 2018\n\nThe Weeknd and Bella cause a stir after reportedly kissing at Coachella. Per Us Weekly, the former couple “were completely all over each other” during Travis Scott’s set at Poppy nightclub’s Coachella pop-up, where they were “canoodling and being affectionate as she sat on his lap.” The location of this reported hookup is an interesting one, considering it’s where Selena and Abel made their Instagram debut approximately one year earlier.\n\nKYLE GRILLOT/AFP/Getty Images\n\nBella is quick to shut down the rumor, however, taking to Instagram to clear the air. Responding to an E! caption, the model writes, “It wasn’t me,” along with a shrugging emoji and detective emoji.\n\nScreenshot\n\nMay 2018\n\nThe Weeknd and Bella are spotted kissing—for real this time, because there’s photographic evidence—at the Magnum x Alexander Wang VIP Party in Cannes. “Bella kept coming over and whispering in his ear and kissing his neck,” according to one Daily Mail source. “They certainly weren’t keeping it a secret. They were standing out on the beach in front of hundreds of people.”\n\nJune 2018\n\nTo further stir the Bella x Weeknd love pot, the rumored on-again couple are spotted on a date in Paris. And there’s Instagram proof! Here’s Bella saying, “You’re taking a video of the bubble” over Abel’s Insta video of um, the bubble.\n\nHere’s Bella hanging out at a second restaurant that same day with roses and jars of tomato sauce (click through for the tomato sauce photo):\n\nAnd here’s an Instagram Story shared by Abel of his view post-dinner. Note the jars of tomato sauce nearby.\n\nScreenshot\n\nIf you still don’t think they’re hanging out at this point, consider this appearance by Bella’s nails on Abel’s Instagram Story of a packet of sugar. Look at Bella’s Instagram from the same day. Now go back to the sugar. See?\n\nScreenshot\n\nOne day later, the pair are spotted walking arm in arm through the streets of Paris.\n\nBest Image/BACKGRID\n\nJuly 2018\n\nFlash-forward about a month and your faves are spotted on a ~romantic date~ in Tokyo, and this time they get caught on camera:\n\nOctober 2018\n\nAbel celebrates Bella’s birthday with the most romantic Instagram post in the history of romantic Instagram posts. Oh, and he shares a bunch of intimate never-before-seen moments from their relationship while he’s at it.\n\nDecember 2018\n\nAbel and Bella spend the holidays together, and he casually shares a picture of her in a bra:\n\nThat said, all that really matters here is their massive Christmas tree.\n\nFebruary 2019\n\nAbel fully wins Valentine’s Day by treating Bella to about a million red roses in their apartment:\n\nA few days later, Bella and Abel celebrate his birthday in matching outfits. Because the couple that wears camo together, stays together! Or something.\n\nMarch 2019\n\nAt this point, things between Bella and Abel seem to be going pretty strong. It’s never a bad sign when a S.O. comes over to spend time with the parents, amirite? In her Instagram Stories, Bella posts a picture of her spending time at Abel’s family home for his mother's birthday and writes his mother a super sweet message. “Heaven...happy birthday angel Samra I cherish you forever,” Bella writes. The cute snap features Abel’s mother looking overcome with emotion, while the rest of her family surrounds her and the birthday cake.\n\n@bellahadid Instagram\n\nMay 2019\n\nBella attends the Met Gala sans Abel. I mean, it’s totally fine, though, because she only attended the gala with him once in 2016.\n\nBella at Met Gala 2019. Karwai Tang Getty Images\n\nBella and Abel at Met Gala 2016. Kevin Mazur Getty Images\n\nAugust 2019\n\nAfter a few months of silence from the couple, it appears that Bella and Abel have called it quits again. According to an E! source, things between the pair haven't worked out because of distance and very separate schedules. “They are in different places right now, physically and mentally. Bella is prepping for her fashion week commitments and Abel is working on his music and his upcoming acting debut,” the source said.“They have been arguing a lot recently....[They] haven’t spent quality time together in months.”\n\nEven though the breakup news is admittedly really sad, there’s still a sliver of hope that Bella and Abel could get back together at some point. “They hope to get back together at one point but for now are focusing on themselves and their projects,” the source added. Fingers crossed for these two!\n\nOctober 2019\n\nJust two months after Bella and Abel split, it looks like they're are talking again. A source tells E!, \"There is no bad blood between the two and they are on good terms right now. There isn’t any chance of them getting back together right now, but Bella never wants to have any anger or resentment toward anyone.\"\n\nBut then Abel showed up to Bella's 23rd birthday party, sparking rumors that things are very much back on between then. According to another E! source, \"He was with her the entire night and they left together to go back to the apartment they both shared. You could tell that they were definitely in love and they both looked very happy being around each other.\"\n\nSo does that mean that they're dating once more? Nope! A rep for the Weeknd clarified that he only attend Bella's party as a friend. So for now, these two are still broken up.\n\nThat brings us up to date, but something says 2019 has a bit more in store for these two.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-528598290-1511151669.jpg?crop=1.00xw:0.751xh;0,0.0722xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-528598290-1511151669.jpg?crop=1.00xw:0.751xh;0,0.0722xh&resize=1200:*", "keywords": [], "authors": ["Peggy Truong", "Entertainment Writer", "Peggy Is Cosmopolitan.Com S Entertainment Writer", "Specializing In Leonardo Dicaprio", "This Is Us", "The Royals."], "canonical_link": "https://www.cosmopolitan.com/entertainment/a8615679/bella-hadid-the-weeknd-dating-timeline/", "title": "A Definitive Timeline of Bella Hadid and The Weeknd’s Relationship", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "A Definitive Timeline of Bella Hadid and The Weeknd’s Relationship", "description": "Tell your friends.", "url": "https://www.cosmopolitan.com/entertainment/a8615679/bella-hadid-the-weeknd-dating-timeline/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-528598290-1511151669.jpg?crop=1.00xw:0.751xh;0,0.0722xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2019-10-12 08:03:54", "published_time": "2019-10-12 08:02:00", "section": "Celebrities & Entertainment", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-528598290-1511151669.jpg?crop=1.00xw:0.751xh;0,0.0722xh&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Bella Hadid and The Weeknd Dating Timeline - A Definitive Look at Bella and Abel's Relationship History", "description": "Here's everything to know about Bella Hadid and The Weeknd's mostly quiet relationship, from their Coachella encounter to their Victoria's Secret reunion after breaking up.", "keywords": "bella hadid, the weeknd, timeline, bella hadid the weeknd, bella hadid the weeknd relationship timeline, bella hadid the weeknd relationship, bella hadid the weeknd dating history, bella hadid the weeknd dating timeline", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-528598290-1511151669.jpg?crop=0.669xw:1.00xh;0.167xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrities & Entertainment,entertainment,bella hadid,timeline", "sailthru.date": "2019-10-12T20:02:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-528598290-1511151669.jpg?crop=1.00xw:0.751xh;0,0.0722xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-528598290-1511151669.jpg?crop=0.669xw:1.00xh;0.167xw,0", "sailthru.socialtitle": "A Definitive Timeline of Bella Hadid and The Weeknd’s Relationship", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1570838520.0, "source": "https://www.cosmopolitan.com", "summary": ""}