{"url": "nypost.com/2017/04/08/inside-the-rock-and-vin-diesels-furious-feud/", "text": "When the cast of “The Fate of the Furious” — the eighth film in the “Fast and the Furious” franchise — hit CinemaCon to preview footage for theater owners in Las Vegas on March 29, it was like a star-studded family reunion.\n\nLongtime lead Vin Diesel gave a moving tribute to late actor Paul Walker and laughed it up with co-stars Charlize Theron, Kurt Russell and Tyrese Gibson.\n\nBut there was one member of the family missing: Dwayne “The Rock” Johnson, who has appeared alongside Diesel in the last four “Furious” movies.\n\nSources told The Post that’s because Johnson and Diesel can’t stand to be in the same place at the same time anymore after simmering tensions came to a head on the set of “The Fate of the Furious.” In fact, Johnson was at the same place just the day before, promoting buzzy blockbusters “Baywatch” and “Jumanji” to the CinemaCon crowd. Twelve hours later, he was on the Miami set of his HBO show, “Ballers.”\n\nBut a Hollywood insider told The Post that it wasn’t TV work that kept Johnson, 44, from attending the “Furious” dog-and-pony show.\n\n“I’ve been with this crew a lot,” said the Hollywood insider. “Vin decides who shows up [for promotional events]; he always has.”\n\nIndeed, the franchise is Diesel’s baby. He’s been a producer on the movies, which launched him as an action star and have collectively earned a whopping $3.9 billion globally, since 2001’s “The Fast and the Furious.”\n\nSo when Johnson lashed out at Diesel, 49, near the end of filming for “Fate,” there were bound to be repercussions. On Aug. 8, 2016, Johnson posted a scathing — but blind — Facebook attack on one or more unnamed male co-stars.\n\nDwayne finally lost patience after [multiple] films when Vin showed up late for their final [shared] scene on ‘Fate’\n\n“My female co-stars are always amazing, and I love ’em. My male co-stars however are a different story,” he wrote. “Some conduct themselves as stand up men and true professionals, while others don’t. The ones that don’t are too chicken s–t to do anything about it anyway. Candy asses.”\n\nFurthermore, he wrote, “when you watch this movie next April, and it seems like I’m not acting in some of these scenes and my blood is legit boiling — you’re right.”\n\nAccording to TMZ, Johnson was boiling mad at Diesel repeatedly showing up to set late and refusing to start the day before 10 a.m. Insiders reveal that the turmoil has been a long time coming.\n\n“Dwayne finally lost patience after [multiple] films when Vin showed up late for their final [shared] scene on ‘Fate,’ ” said another movie-business insider.\n\nAfter Johnson’s social-media scolding, the two A-listers allegedly had it out in his trailer. That night, when the director called “cut” on Diesel’s last scene at around 1 a.m., the actor told the cast and crew, “Daddy’s gone,” and high-tailed it out of there. (Johnson still had another week of shooting.)\n\nTwo days later, on Aug. 10, Diesel himself took to social media: He put up an Instagram video talking about coming home to his 2-year-old daughter Pauline — named for Walker — in which he added, ominously, at the end: “Give me a second, and I will tell you everything. Everything.” So far, he hasn’t.\n\nBut Diesel did speak to USA Today this past week. “I don’t think the world really realizes how close we are, in a weird way,” he told the newspaper. “I think some things may be blown out of proportion . . . I know he appreciates how much I work [on] this franchise. In my house, he’s Uncle Dwayne.”\n\nAnd while TMZ reported that Johnson wasn’t the only one on set who was irritated with Diesel, don’t expect any of the money-minting franchise’s regulars, like Gibson and Chris “Ludacris” Bridges, to say anything. After all, Fortune predicts the upcoming installment could earn $1 billion globally.\n\n“Look, they all depend on Vin for a paycheck,” said a source close to members of the cast. “But Dwayne [is so successful on his own that he] doesn’t need Vin. He was the only one who could legitimately stand up and bust him.”\n\nAccording to the same source, Johnson “thinks Vin’s disrespectful — and he is.”\n\nThis wasn’t the first time Diesel has reportedly caused problems on set. In 2014, while shooting “Furious 7,” he spent a whole day locked in his trailer, then demanded Universal execs show up so he could berate them — for 2 ¹/₂ hours, according to the Hollywood Reporter. The next day on set, work was done by stunt doubles.\n\nJohnson, meanwhile, is seen as the nice guy on set, and in Hollywood at large. Said one celebrity publicist close to the films, “Vin is always a douche” on set, and “Dwayne is always a doll.”\n\n(Representatives for Johnson and Diesel did not return requests for comment.)\n\nThe crew, apparently, sided with Johnson on the set of “Fate.” TMZ reported that many people got sick of Diesel holding up shooting by showing up late and goading people — including Johnson — by criticizing their acting.\n\nBut a studio insider disagrees. “There was no junket for this movie because they just couldn’t get everyone in one place. Dwayne and Vin were both at the trailer launch [last December].’’\n\nAs for Johnson, a source close to the film’s crew called him “the ultimate professional.”\n\nIt’s worth noting that the two do play frenemies-turned-furious enemies in “Fate,” in which Vin’s Dominic Toretto betrays his family. Could the feud have been concocted to notch up even more interest? After all, an insider told the Hollywood Reporter that Universal, the studio behind “Furious,” was “keeping [Johnson and Diesel] as separated as possible.”\n\nAn executive close to the film told The Post that, “If this is some p.r. stunt, Universal did not create it.”\n\nHowever, the source close to the cast added, “There’s got to be a reason this film is taking a different route. There’s no junket. That tells you a lot.”\n\nBut a studio insider disagrees: “There was no junket for this movie because they just couldn’t get everyone in one place. Dwayne and Vin were both at the trailer launch [last December].’’\n\nWhile Johnson did show up for the New York City premier Saturday evening, he did not join Diesel and Theron for the Berlin or Paris premiers earlier in the week.\n\nNevertheless, in a movie series that’s all about alphas, there can only be one alpha dog on set.\n\nWhile Diesel has already signed on to star in “Furious” installments 9 and 10 — and even Gibson is already locked and loaded for No. 9 — no announcements have been made about Johnson’s fate in the franchise.\n\n“I protect the franchise. I protect everybody including Dwayne,” Diesel told USA Today. “I protected Dwayne more than he’ll ever know.\n\n“If [Johnson] does return,” says a knowledgeable casting director, “I doubt things will change on set. It’s Vin’s show. He can be late when everyone else has to be on time.”\n\nBut since it is Diesel’s show, “Daddy” probably won’t want to jeopardize his bank account. Johnson may not need the “Furious” movies to pump up his career at this point, but, said the casting director source, “the franchise would make less money without him.”", "images": ["https://s0.wp.com/wp-content/themes/vip/plugins/vip-do-not-include-on-wpcom/vip-powered-wpcom/images/vip-powered-dark-small.png", "https://pixel.wp.com/b.gif?v=noscript", "https://thenypost.files.wordpress.com/2020/04/dogears_133x41_right-1.png", "https://thenypost.files.wordpress.com/2020/04/spanx-sale.png?w=300&h=200&crop=1", "https://nyppagesix.files.wordpress.com/2019/09/p6podcast402x.png", "http://googleads.g.doubleclick.net/pagead/viewthroughconversion/988380111/?value=0&guid=ON&script=0", "https://nyppagesix.files.wordpress.com/2019/09/we_hear_sidebarimage_520x280_v2.jpg", "https://nyppagesix.files.wordpress.com/2019/09/stitcher-button402x-1.png?w=165&h=49", "https://nyppagesix.files.wordpress.com/2019/09/spotify-podcast-badge-wht-grn-330x80402x.png?w=205&h=50", "https://thenypost.files.wordpress.com/2017/04/mcdfafi_ec003.jpg?quality=90&strip=all&w=1200", "https://thenypost.files.wordpress.com/2020/04/dogears_133x41_left.png", "https://s2.wp.com/wp-content/mu-plugins/post-flair/sharing/images/loading.gif", "https://nyppagesix.files.wordpress.com/2019/09/google_podcasts_badge402x-1-1.png?w=190&h=48", "https://thenypost.files.wordpress.com/2017/04/mcdfafi_ec003.jpg?quality=90&strip=all&w=618&h=410&crop=1", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://nyppagesix.files.wordpress.com/2019/09/apple-podcast-badge402x.png?w=190&h=46"], "top_img": "https://thenypost.files.wordpress.com/2017/04/mcdfafi_ec003.jpg?quality=90&strip=all&w=1200", "keywords": [], "authors": ["April"], "canonical_link": "https://nypost.com/2017/04/08/inside-the-rock-and-vin-diesels-furious-feud/", "title": "Inside The Rock and Vin Diesel’s ‘Furious’ feud", "meta_data": {"viewport": "width=device-width, initial-scale=1", "copyright": "Copyright 2020 NYP Holdings. All rights reserved.", "p": {"domain_verify": "44b526edc36ffbcc163412ee9fe42833"}, "description": "When the cast of “The Fate of the Furious” — the eighth film in the “Fast and the Furious” franchise — hit CinemaCon to preview footage for theater...", "generator": "WordPress.com", "og": {"type": "article", "title": "Inside The Rock and Vin Diesel’s ‘Furious’ feud", "url": "https://nypost.com/2017/04/08/inside-the-rock-and-vin-diesels-furious-feud/", "description": "When the cast of “The Fate of the Furious” — the eighth film in the “Fast and the Furious” franchise — hit CinemaCon to preview footage for theater owners in Las Vegas on March 29, it was like a st…", "site_name": "New York Post", "image": {"identifier": "https://thenypost.files.wordpress.com/2017/04/mcdfafi_ec003.jpg?quality=90&strip=all&w=1200", "secure_url": "https://thenypost.files.wordpress.com/2017/04/mcdfafi_ec003.jpg?quality=90&strip=all&w=1200"}, "locale": "en_US"}, "article": {"published_time": "2017-04-08T17:30:28+00:00", "modified_time": "2017-04-09T16:25:07+00:00", "publisher": "https://www.facebook.com/nypost", "opinion": "false", "content_tier": "free"}, "twitter": {"creator": "@nypost", "site": "@nypost", "text": {"title": "Inside The Rock and Vin Diesel’s ‘Furious’ feud"}, "image": {"identifier": "https://thenypost.files.wordpress.com/2017/04/mcdfafi_ec003.jpg?quality=90&strip=all&w=664&h=441&crop=1", "src": "https://thenypost.files.wordpress.com/2017/04/mcdfafi_ec003.jpg?quality=90&strip=all&w=664&h=441&crop=1"}, "card": "summary_large_image", "title": "Inside The Rock and Vin Diesel's 'Furious' feud", "description": "When the cast of “The Fate of the Furious” — the eighth film in the “Fast and the Furious” franchise — hit CinemaCon to preview footage for theater owners in Las Vegas on March 29, it was"}, "fb": {"pages": 225343690812937}, "nypost-section": "Entertainment", "parsely-metadata": "{\"post_id\":\"nypost-10860675\"}", "keywords": "Entertainment,celebrity feuds,dwayne \"the rock\" johnson,fast and furious,vin diesel", "google-site-verification": "eyT36MjcFGn_qzUdS9VyWVb89Lq2f8-ItpI8WRksiyw", "msvalidate.01": "8188997BC82071CE07AB711B5675CE54", "application-name": "New York Post", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Your source for breaking news, news about New York, sports, business, entertainment, opinion, real estate, culture, fashion, and more.", "msapplication-task": "name=Subscribe;action-uri=https://nypost.com/feed/;icon-uri=https://secure.gravatar.com/blavatar/0b14d9dbf0c711522a906102b60f3da0?s=16"}, "movies": ["https://www.youtube.com/embed/JwMKRevYa_M?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": 1491580800.0, "source": "http://nypost.com", "summary": ""}