{"url": "https://tv.avclub.com/she-s-gotta-have-it-delivers-rich-stylized-fun-in-a-pr-1820741415", "text": "(Photo: David Lee/Netflix)\n\nTV Reviews All of our TV reviews in one convenient place. Prev Next View All\n\nThe premise of the Netflix series, She’s Gotta Have It, based on the 1986 Spike Lee film of the same name isn’t radical or controversial anymore. Nola Darling is an artist, a dog walker, and a cinephile who rejects all labels including “girlfriend.” She’s not interested in monogamy and is carrying on casual, sexual affairs with three men.\n\n\n\nAdvertisement\n\nI admit I will probably sound my parents or some concern-trolling Dateline piece about millennial sexual habits but it’s 2017 and everyone is on Tinder. Like. Everyone. It’s safe to assume that if you’re sleeping with someone, they’re sleeping with someone else. And you’re sleeping with someone else. Every woman I know keeps some kind of list or Excel spreadsheet with her sexual partners and detailed notes. Nola doesn’t sound radical. She sounds like someone you went to college with.\n\nAdvertisement\n\nThat’s the beauty of She’s Gotta Have It. Particularly this first episode. It feels intimate and familiar and lush and stylized. The whole show feels like your 20's with better art direction Nola’s bed, one of a few locations in the episode, is epic but it also feels like something she built herself from found wood.\n\nThere are some classic Spike Lee touches that feel reinvigorated in this new format. Hella jazz, referential dialogue, and playful visual tricks. My favorite is the album covers that flash on the screen after almost every scene. Insecure put up Spotify playlists after every episode and this feels like Spike Lee’s version of that.\n\nThe episode opens with a montage of catcallers and their dialogue is ridiculous but every woman has been on the receiving end of something equally crude. The episode also shows the reality of street harassment that spurs Nola to use her art to make a Statement.\n\nOne improvement on the film is that Nola has a rich life outside of her men. She’s political and has interests and hobbies. The addition of a circle of friends featuring her best friend, Clo (Margot Bingham) lets us know Nola isn’t one of those people defined by who she’s sleeping with. Her bitch session with Clo is warm and honest. DeWanda Wise plays Nola with an insecurity and a wit that helps to sell the weighty monologues about not wanting to fit in or about the purpose of the paintbrush. The moment she rushes home after being assaulted on the street and storms into her bedroom, silently crying, smoking a joint has your heart breaking but you know she won’t be down for long.\n\nAdvertisement\n\nEach of Nola’s men are more developed from their characters in the film. Greer Childs is beautiful and suave but he feels like he could come apart at any moment. He whines at an unflattering portrait Nola paints of him like a baby and painstakingly folds his clothes before sex. Jamie Overstreet was younger and politer in the film. Making him more established (read: old and rich) and his demands for her monogamy while he’s sleeping with two other women paints him more unflattering light and you can understand why Nola isn’t rushing to give up anything for him.\n\nAdvertisement\n\nAnthony Ramos crackles with energy as Mars. Spike Lee has his limitations as an actor but Ramos has an unreasonable amount of charisma to sell the most cartoonish moments of his character. He’s a little flighty and broke as fuck but you’d love being in bed with him for a night. Just not two in a row.\n\nThe moments when Nola’s life gets a little messy are the most intriguing. Like when Nola is in bed with Jamie, a passionate and possessive investment banker, and Mars, a ratchet and playful bike messenger, calls asking if he can “smell it.” Nola indulges each of Mars’ repeated phone calls and laughs a little too loud. Also, Clo mentions that Nola broke the code by sleeping with Mars and that Clo really liked him too. These moments signal at potential conflict down the line and keep the episode moving forward. And Greer? Well, he yells his own name during sex.\n\nAdvertisement\n\nUnfortunately, the show is corny. Nola and Mars argue about Denzel Washington not winning an Oscar for Malcolm X and his win for Training Day was a make-up call. C’mon, Spike. You can’t be doing this out here. It’s embarrassing. What else is embarrassing is his attempts to put some of this new hippity-hop slang in the show like when Greer screams “WDF – What da fuck!” Who says that? Don’t forget Jamie leaving Nola’s apartment after a fight saying “I’m out like Durant” and she follows him out the door shouting about OKC. Spike, we get it. You like sports. The first episode feels a little like my dad attempting to be “hip.”\n\nLater episodes are written by other members of the writing staff so here’s hoping the dialogue feels fresher in later episodes but Spike Lee’s strengths as a director make this episode easy to watch and fun. The attempt to put the lives of these characters on display with all their richness and flaws is admirable an Spike Lee succeeds.\n\nAdvertisement\n\nStray observations\n\nMy favorite catcall: “I bet your farts smell like grape Jolly Ranchers, Fruity Pebbles and Arizona Iced Tea all combined. Damn, what a combination.” I also say “you’re so fine I would drink your bathwater.” It’s an old school come-on and I hope it’s making a comeback!\n\nNola’s street art was a reference to Tatyana Fazlalizadeh’s anti-street harassment street art.\n\nMars fucking his in Jordans is quite possibly the blackest thing to happen on Netflix.\n\n\n\nIn college, I took a freshman seminar titled “Spike Lee & Woody Allen: The City in Black & White.” I was the only black student and the only student who had watched any Spike Lee films before. The professor was white and would regularly tell me that I was wrong about black culture. We also didn’t watch Do The Right Thing.\n\n\n\nHow did no one say “deadass” in this episode?\n\n", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/fukpgrzbu4nsmj0m52lp.jpg"], "top_img": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/fukpgrzbu4nsmj0m52lp.jpg", "keywords": [], "authors": [], "canonical_link": "https://tv.avclub.com/she-s-gotta-have-it-delivers-rich-stylized-fun-in-a-pr-1820741415", "title": "She’s Gotta Have It delivers rich, stylized fun in a premiere that's a little corny", "meta_data": {"google-site-verification": "P13oAn8o8LB6FVCJWKsHWXvxfbR-SJrmvox6EgULpUs", "ir-site-verification-token": "-1270174611", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0,maximum-scale=10.0", "ROBOTS": "INDEX, FOLLOW", "msapplication-square70x70logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/cfeerdkqdvairskc2jmv.png", "msapplication-square150x150logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_200,q_80,w_200/cfeerdkqdvairskc2jmv.png", "keywords": "Recap, She's Gotta Have It, DeWanda Wise, TV Club", "news_keywords": "Recap, She's Gotta Have It, DeWanda Wise, TV Club", "twitter": {"url": "https://tv.avclub.com/she-s-gotta-have-it-delivers-rich-stylized-fun-in-a-pr-1820741415", "card": "summary_large_image", "site": "AVTVClub", "title": "She’s Gotta Have It delivers rich, stylized fun in a premiere that's a little corny", "description": "The premise of the Netflix series, She’s Gotta Have It, based on the 1986 Spike Lee film of the same name isn’t radical or controversial anymore. Nola Darling is an artist, a dog walker, and a cinephile who rejects all labels including “girlfriend.” She’s not interested in monogamy and is carrying on casual, sexual affairs with three men.", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/fukpgrzbu4nsmj0m52lp.jpg"}, "description": "The premise of the Netflix series, She’s Gotta Have It, based on the 1986 Spike Lee film of the same name isn’t radical or controversial anymore. Nola Darling is an artist, a dog walker, and a cinephile who rejects all labels including “girlfriend.” She’s not interested in monogamy and is carrying on casual, sexual affairs with three men.", "og": {"title": "She’s Gotta Have It delivers rich, stylized fun in a premiere that's a little corny", "type": "article", "url": "https://tv.avclub.com/she-s-gotta-have-it-delivers-rich-stylized-fun-in-a-pr-1820741415", "description": "The premise of the Netflix series, She’s Gotta Have It, based on the 1986 Spike Lee film of the same name isn’t radical or controversial anymore. Nola Darling is an artist, a dog walker, and a cinephile who rejects all labels including “girlfriend.” She’s not interested in monogamy and is carrying on casual, sexual affairs with three men.", "locale": "en_US", "site_name": "TV Club", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/fukpgrzbu4nsmj0m52lp.jpg"}, "fb": {"app_id": 280492615405243}}, "movies": [], "publish_date": null, "source": "https://tv.avclub.com", "summary": ""}