{"url": "www.inquisitr.com/4190080/kuwtk-producer-ryan-seacrest-leaving-for-live-with-kelly-kris-jenner-terrified-that-he-might-quit/", "text": "KUWTK producer Ryan Seacrest is moving to the Big Apple for his new gig with Kelly Ripa, and Kris Jenner seemed to be scared of where that will leave her family especially now that Keeping Up With the Kardashians ratings aren’t exactly soaring.\n\nOn Monday, Kelly Ripa and ABC has finally decided to make Ryan her permanent co-host and it seems like the ripple effect of this decision has reached the backyard of the Kardashians clan whose life is being featured on E! thanks to the former American Idol host.\n\nIn fact, a source revealed to Radar Online that the Keeping Up With the Kardashians momager Kris Jenner is “terrified” for their future as KUWTK producer Ryan Seacrest makes the big move.\n\n“Of course Kris is scared,” the insider who was reportedly close to the family declared.\n\nAccording to the outlet, Seacrest was the one who was “almost single-handedly responsible for giving Jenner a spot on E! for KUWTK” which is why his decision to leave Los Angeles for New York seems to be something that may also affect the reality TV show.\n\nThe outlet further explained Kris’ fears, saying that the timing of Ryan’s move could “not be worse for the money-hungry momager” as less people tune in to watch the Kardashians go about their personal lives while on camera in Keeping Up With the Kardashians. In fact, KUWTK producer Ryan Seacrest leaving L.A. might also be a sign that the reality show will soon be facing the end, according to Radar‘s source.\n\n“More and more viewers are tuning out every week and at this point it looks like the end is inevitable.”\n\nStill, there seems to be no confirmation yet as to whether or not Seacrest will no longer be producing E!’s Keeping Up With the Kardashians. Although he may be moving to the Big Apple, the 42-year-old TV host revealed that he will still spend a lot of time in L.A. in an interview with Variety after he was named as the co-host for Live!\n\n“I have never lived here before but I have spent a lot of time here,” he told the outlet when asked whether or not he ever tried living in New York.\n\n“I expect to still spend a lot of time in Los Angeles, but I’m excited to take up residence in the Big Apple.”\n\nAccording to the New York Times, KUWTK producer Ryan Seacrest was granted a position in “a high-profile platform” by making him Kelly Ripa’s co-host for ABC’s morning show in preparation for a new competition.\n\n“It’s making sure the show is in the right hands — one day, eventually, I’m sure of it, I will retire,” Ripa told the outlet, adding a forecast about her new permanent co-host’s future.\n\n“And Ryan Seacrest, who is a seamless broadcaster and a kind human being, is the one who can take this show into the future.”\n\nOf course, it is still too early to know for sure whether or not KUWTK producer Ryan Seacrest will be letting go of his project with Kris Jenner and E! especially since he was recently named as one of the co-producers for a Keeping Up With the Kardashians spinoff covering Kylie Jenner’s private life.\n\nAccording to another report from Variety, the host’s entertainment production company Ryan Seacrest Productions is teaming up with Bunim/Murray Productions to make Life of Kylie happen. The report also revealed that Kris will be executive producing the show together with a number of other people from E!.\n\nDo you think KUWTK producer Ryan Seacrest will soon be ditching Kris Jenner and the rest of the Kardashians? Share with us your thoughts in the comments section below and stay tuned for more updates about Ryan Seacrest and Keeping Up With the Kardashians.\n\n[Featured Image by Christian Petersen/Getty Images]", "images": ["https://secure.gravatar.com/avatar/408a7e4769d130cb16bb1c27f3d52e1d?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2017/05/Ryan-Seacrest-with-KUWTK-Momager-Kris-Jenner.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Erika Miranda"], "canonical_link": "https://www.inquisitr.com/4190080/kuwtk-producer-ryan-seacrest-leaving-for-live-with-kelly-kris-jenner-terrified-that-he-might-quit/", "title": "Is ‘KUWTK’ Producer Ryan Seacrest Leaving For Good? Kris Jenner ‘Terrified’ That He’s Done With The Show", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}