{"url": "vt.co/entertainment/celebrity/furious-kylie-jenner-accuses-travis-scott-cheating-several-women/", "text": "Well, it seems that all is not well in the world of Kylie Jenner. Fresh off the back of rumors that members of her staff have been trying to take photos of her in the privacy of her home, it's being reported that she has had a blazing row with her expected baby daddy, Travis Scott.\n\nAs I'm more than sure you are aware by now, it's pretty much blindingly obvious that Kylie Jenner is pregnant. While we have yet to receive any form of confirmation from the 20-year-old or her sisters, everything points to the fact that Jenner is expecting. Whether it's her change of tact on Instagram, the fact the had a crib delivered to her house or the latest campaign from Calvin Klein in which she can be seen covering her tummy, Kylie Jenner is pregnant.\n\nHowever, as the rumors began to become more and more concrete, it was suggested that Jenner and her beau had split up. While it was never confirmed that Kylie and Travis had decided to go their separate ways, a source has revealed to Insider that the two stars had a blazing row at Kris Jenner's house and things turned nasty.\n\n“Kylie and Travis got into a blowout fight after he showed up unexpectedly to her mother Kris’ house, where she’s been staying lately. She flipped out on him and accused him of cheating on her with several women during her pregnancy, including a girl that she is kinda friends with!”\n\nThe source continued, saying that the rapper had been doing all that he could to try and win Kylie back, but the Keeping Up With The Kardashians star was having none of it.\n\n“He has been trying to do everything he can to win her back, including sending her flowers and gifts,” the source said. “But she is just so emotional right now that she doesn’t know what she wants. The fact that they are still talking and in communication leads some of her friends to believe that they will fix things before the birth of the baby.”\n\nAlthough Kylie had disappeared from the public eye since the rumors, according to Entertainment Tonight, she’s not planning to hide the fact that she’s a mom once she gives birth.\n\n“Kylie has been chilling at home for the most part and just living her best life. She has really enjoyed this time away from the spotlight. It’s the first time she can remember in her entire life not being followed by cameras and she’s just trying to enjoy this privacy,” a source told the website.\n\nThe source continued, saying: “she’s definitely not going to deny that she’s had a baby, or continue to evade questions about it at all.”\n\nThe outlet also learned that \"this isn’t a permanent thing. As soon as the baby is born, she will make an announcement and introduce the baby to her fans. She will also address the fact that she went ‘dark’ on social media and in the public.”\n\nThe source claims that Kylie will announce the birth on Instagram and also claims that the 20-year-old is extremely excited to be a mother. “Yes, she will release a photo and yes, she will acknowledge the baby. She’s excited to continue to be her authentic self, and that will soon mean being a mother and sharing that with her fans.”\n\nSo while there may be trouble in paradise, it looks like we will finally be getting the news we've all been waiting for shortly. I'm calling it guys: Jenner is pregnant and the baby will arrive in the next month or so.", "images": ["http://vt.co/static/img/logos/jungle-creations.svg", "http://vt.co/static/img/icons/search.svg", "http://vt.co/static/img/icons/share/pinterest.svg", "http://vt.co/static/img/icons/gorilla.svg", "http://vt.co/static/img/icons/share/whatsapp.svg", "http://cdn.junglecreations.com/wp/junglecms/2018/01/Screen-Shot-2018-01-23-at-15.18.10.png", "http://vt.co/static/img/icons/share/email.svg", "http://vt.co/static/img/logos/vt_white.svg", "http://vt.co/static/img/icons/share/facebook.svg", "https://cdn.junglecreations.com/wp/junglecms/2018/01/Travis-Kylie-Site-Image.jpg", "http://vt.co/static/img/logos/vt_black.svg"], "top_img": "http://cdn.junglecreations.com/wp/junglecms/2018/01/Screen-Shot-2018-01-23-at-15.18.10.png", "keywords": [], "authors": [], "canonical_link": "http://vt.co/entertainment/celebrity/furious-kylie-jenner-accuses-travis-scott-cheating-several-women/", "title": "'Furious' Kylie Jenner accuses Travis Scott of 'cheating on her with several women'", "meta_data": {"viewport": "width=device-width", "description": "As rumours regarding Kylie Jenner's 'pregnancy' continue to circulate, it's believed that Travis Scott has been cheating on her with 'several women'", "fb": {"app_id": 586923868183434, "pages": 363765800431935}, "og": {"locale": "en-US", "type": "article", "title": "'Furious' Kylie Jenner accuses Travis Scott of 'cheating on her with several women'", "image": {"identifier": "http://cdn.junglecreations.com/wp/junglecms/2018/01/Screen-Shot-2018-01-23-at-15.18.10.png", "height": 450, "width": 850}, "description": "Well, it seems that all is not well in the world of Kylie Jenner. Fresh off the back of rumors that members of her staff have been trying to take photos of her in the privacy of her home, it's being reported that she has had a blazing row with her&hellip;", "url": "http://vt.co/entertainment/celebrity/furious-kylie-jenner-accuses-travis-scott-cheating-several-women/", "site_name": "VT"}, "article": {"publisher": "https://www.facebook.com/VT", "section": "Entertainment", "published_time": "2018-01-23T15:27:58+00:00"}, "twitter": {"card": "summary_large_image", "title": "'Furious' Kylie Jenner accuses Travis Scott of 'cheating on her with several women'", "image": "http://cdn.junglecreations.com/wp/junglecms/2018/01/Screen-Shot-2018-01-23-at-15.18.10.png", "description": "Well, it seems that all is not well in the world of Kylie Jenner. Fresh off the back of rumors that members of her staff have been trying to take photos of her in the privacy of her home, it's being reported that she has had a blazing row with her&hellip;"}, "next-head-count": 10}, "movies": [], "publish_date": 1516721278.0, "source": "http://vt.co", "summary": ""}