{"url": "metro.co.uk/2018/07/13/bieber-selena-gomez-smiles-rumoured-beau-caleb-stevens-ex-justin-announces-engagement-7710708/", "text": "Selena Gomez was all smiles as she headed out for a trip with rumoured love interest Caleb Stevens (Picture: TheImageDirect.com)\n\nHer ex has been making headlines across the globe with the latest twist in his personal life.\n\nBut it seems that Selena Gomez isn’t the slightest bit on the back foot when it comes to Justin Bieber’s engagement, as the star was in very high spirits as the news started to circulate.\n\nWhile her ex was enjoying a romantic holiday with Hailey Baldwin, who was flashing a huge sparkler on her hand, the 25-year-old singer and actress was enjoying a break with friends and Caleb at a country cabin.\n\nHaving taken a break from the hustle and bustle of her day-to-day life, Selena looked to be absolutely loving life as she left the cabin in Upstate New York alongside the influencer (who is the younger brother of her pal Raquelle).\n\nThe 25-year-old singer and actress didn’t seem to have a care in the world as she went for a low-key look in Upstate New York (Picture: TheImageDirect.com)\n\nLeaving the cabin, Selena rocked a low-key and comfy look sporting a band tee and track pants complete with comfy slippers.\n\nAdvertisement\n\nAdvertisement\n\nSipping on an iced drink as she headed to an SUV, the Back To You singer couldn’t help but smile – something which was emphasized by her tied back hair.\n\nCaleb – who graduated high school last year and is thought to be 18-year-old – similarly went for a relaxed look, sporting shorts and a tee.\n\nDespite being linked after a number of sightings together by eagle-eyed fans romance rumours have been squashed, with one adamant source telling Metro.co.uk: ‘They’re just friends, nothing else.’\n\nCaleb is the brother of her pal Raquelle, though just last week a source refuted rumours of romance between Selena and the rising social media influencer (Picture: TheImageDirect.com)\n\nSomething which echoes another insider’s comment to People last week, who said: ‘They’re absolutely only friends. They’re not dating.’\n\nAnd if anyone was thinking this was a romantic getaway for two then they’d think wrong as Raquelle was also along for the weekend along with a number of other friends.\n\nBut at least she had some good company to take her mind off any possible thoughts of ‘what if’ when it came to Biebs.\n\nHer break in the country with Caleb came at the same time as her ex Justin Bieber sparked engagment rumours with Hailey Baldwin – with the couple later confirming the news (Picture: Justin Bieber/Instagram)\n\nJustin officially announced his engagement on Instagram this week, after speculation ran rife, where he posted a black and white photo of him and Hailey hugging with a heartfelt caption.\n\nAdvertisement\n\nAdvertisement\n\nHe wrote: ‘Was gonna wait a while to say anything but word travels fast, listen plain and simple Hailey I am soooo in love with everything about you! So committed to spending my life getting to know every single part of you loving you patiently and kindLY. I promise to lead our family with honor and integrity letting Jesus through his Holy Spirit guide us in everything we do and every decision we make.\n\n‘My heart is COMPLETELY and FULLY YOURS and I will ALWAYS put you first! You are the love of my life Hailey Baldwin and I wouldn’t want to spend it with anybody else. You make me so much better and we compliment eachother so well!! Can’t wait for the best season of life yet!.\n\n‘It’s funny because now with you everything seems to make sense! The thing I am most excited for is that my little brother and sister get to see another healthy stable marriage and look for the same!!! Gods timing really is literally perfect, we got engaged on the seventh day of the seventh month, the number seven is the number of spiritual perfection, it’s true GOOGLE IT! Isn’t that nuts? By the way I didn’t plan that, anyways My goodness does feel good to have our future secured! WERE GONNA VE BETTER AT 70 BABY HERE WE GO! ‘”He who finds a wife finds a good thing and obtains FAVOR from the Lord!” This is the year of favor!!!! (sic)’\n\nGot a showbiz story? If you've got a celebrity story, video or pictures get in touch with the Metro.co.uk entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Justin Bieber would love to marry Hailey Baldwin in a ‘small and intimate Canadian wedding’\n\nMORE: Which other celebrities attend Justin Bieber and Hailey Baldwin’s Hillsong churches?", "images": ["https://d17fy28x8ov4h8.cloudfront.net/190x/images/j/JL_Brandlines_Logo_Micro_Use_Blk_RGB-100px_9.png", "https://d3tsytm1wtjqo2.cloudfront.net/180x/images/c/currys_9.png", "https://metro.co.uk/wp-content/themes/metro-parent/img/fallback.png", "https://i1.wp.com/metro.co.uk/wp-content/uploads/2018/07/sec_2133144712.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "https://i0.wp.com/metro.co.uk/wp-content/uploads/2018/07/sec_21331447.jpg?quality=90&strip=all&zoom=1&resize=644%2C338&ssl=1", "https://d17fy28x8ov4h8.cloudfront.net/190x/images/v/virgin-media_9.png", "https://sb.scorecardresearch.com/p?c1=2&c2=6034964&cv=2.0&cj=1", "https://d3tsytm1wtjqo2.cloudfront.net/images/media/72/n/nord_logo_square_1x_9.png", "https://d17fy28x8ov4h8.cloudfront.net/190x/images/w/Wickes-Logo_9.png"], "top_img": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2018/07/sec_2133144712.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "keywords": [], "authors": ["Jj Nattrass"], "canonical_link": "https://metro.co.uk/2018/07/13/bieber-selena-gomez-smiles-rumoured-beau-caleb-stevens-ex-justin-announces-engagement-7710708/", "title": "Selena Gomez all smiles with Caleb Stevens after Justin Bieber's engagement", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "format-detection": "telephone=no", "robots": "max-image-preview:large", "google-site-verification": "NRfCb8mBNAy5_f17NpvLZYoY38EzM2dgpcOh_Am9yps", "twitter": {"widgets": {"csp": "on"}, "image": {"src": "https://metro.co.uk/wp-content/uploads/2018/07/sec_21331447.jpg?quality=90&strip=all&crop=0px%2C0px%2C1200px%2C630px&resize=1200%2C630"}, "title": "Bieber who? Selena Gomez is all smiles with rumoured beau Caleb Stevens", "description": "No woes here.", "card": "summary_large_image", "site": "@MetroUK", "account_id": 138749160}, "ir-site-verification-token": 422605026, "description": "Her ex has been making headlines across the globe with the latest twist in his personal life. But it seems that Selena Gomez isn’t the slightest bit on the back...", "news_keywords": "selena gomez, justin bieber, selena gomez boyfriend, caleb stevens, raquelle stevens, justin bieber engaged, justine beiber engagment, hailey baldwin, justin bieber hailey baldwin engaged", "msvalidate.01": "11110DC8D42E74E13F24B3A18E7CFB8A", "generator": "WordPress 5.4", "fb": {"pages": "117118184990145,427889824264313", "app_id": 176908729004638}, "ia": {"markup_url": "https://metro.co.uk/2018/07/13/bieber-selena-gomez-smiles-rumoured-beau-caleb-stevens-ex-justin-announces-engagement-7710708/?ia_markup=1"}, "theme-color": "#000000", "apple-mobile-web-app-title": "Metro", "sailthru.date": "2018-07-13 07:36:43", "sailthru.title": "Bieber who? Selena Gomez is all smiles with rumoured beau Caleb Stevens – as ex Justin announces engagement", "sailthru.tags": "justin bieber, school, selena gomez", "sailthru.description": "No woes here.", "sailthru.image.full": "https://metro.co.uk/wp-content/uploads/2018/07/sec_21331447.jpg?quality=90&strip=all&crop=80px%2C54px%2C525px%2C525px&resize=150%2C150", "sailthru.image.thumb": "https://metro.co.uk/wp-content/uploads/2018/07/sec_21331447.jpg?quality=90&strip=all&crop=80px%2C54px%2C525px%2C525px&resize=150%2C150&w=50", "og": {"locale": "en_GB", "title": "Bieber who? Selena Gomez is all smiles with rumoured beau Caleb Stevens", "type": "article", "url": "https://metro.co.uk/2018/07/13/bieber-selena-gomez-smiles-rumoured-beau-caleb-stevens-ex-justin-announces-engagement-7710708/", "description": "No woes here.", "site_name": "Metro", "image": {"identifier": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2018/07/sec_2133144712.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "secure_url": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2018/07/sec_2133144712.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/MetroUK", "section": "Entertainment", "tag": "Selena Gomez", "published_time": "2018-07-13T07:36:43+0000", "modified_time": "2018-07-13T12:59:11+0100"}, "msapplication-TileImage": "https://metro.co.uk/wp-content/uploads/2020/03/cropped-m-icon-black-9693.png?w=270"}, "movies": [], "publish_date": 1531411200.0, "source": "https://metro.co.uk", "summary": ""}