{"url": "https://www.elle.com/culture/movies-tv/a19136467/bachelor-nation-book-most-shocking-revelations/", "text": "7.8 million viewers tuned in to watch a man propose then break the hearts of not one, but two women on the Season 22 finale of The Bachelor Monday night. ABC's hit dating reality show has seen immeasurable success since its premiere in 2002. And those numbers show no signs of letting up. Viewers continue to tune in year after year to see a storybook romance come to life, despite the terrible track-record of Bachelor Nation couples actually making it.\n\nOver the past 16 years, The Bachelor and its several spinoffs, including The Bachelorette, Bachelor Pad, Bachelor in Paradise, Bachelor in Paradise: After Paradise, and The Bachelor Winter Games, have turned every day people into celebrities overnight. However, as Los Angeles Times reporter and author Amy Kaufman notes in her newly released , finding love and fame on a reality show comes at a price.\n\nHere are 25 of the most shocking revelations, according to Kaufman and her sources, about what goes on behind-the-scenes of one of the longest running reality shows on American television. ABC declined to comment on the book's claims.\n\n1. Former Bachelors asked Kaufman for money in exchange for dirt.\n\nKaufman approached several producers and stars of the show to provide context and quotes for her book. According to Kaufman, Andrew Baldwin, who was The Bachelor in 2007, asked for “a percentage of the book sales” and in exchange he would “dish all.” Matt Grant, who followed Baldwin as the lead the next year, allegedly said, \"Unless your business opportunity can help my daughter's university fund then I have little interest in getting involved.\"\n\n2. Producers influence who the lead eliminates and keeps around.\n\n\n\nFormer Bachelor executive producer Scott Jeffrees told Kaufman, \"We would say, 'We'd like you to keep this one because she's good for TV, and this other one we'd like you to get to know better.\" The final decision was ultimately up to the Bachelor or Bachelorette, but producers did try to influence their choices, Jeffrees said.\n\n3. Top producers paid other producers to create drama.\n\nKaufman notes that Jeffrees \"kept a wad of crisp $100 bills in his pocket\" to give to anyone who delivered the best drama.\n\n4. Creator Mike Fleiss was always allegedly high during the early seasons of The Bachelor and had an affair with one of his top producers.\n\n’Bachelor’ creator Mike Fleiss. Getty Images\n\nFormer production coordinator Brad Isenberg told Kaufman that Fleiss smoked so much weed that there was \"smoke coming out of his [office] door.\" Kaufman also notes that a casting associate spotted Fleiss, who was married to his first wife at the time, flirting with producer Lisa Levenson as she sat between his legs. Fleiss has not commented on these accusations.\n\n5. Herpes was the primary STD that caused contestants to be cut from the casting process.\n\nFleiss' former assistant, Ben Hatta, said every contestant had to undergo medical tests before joining the show. \"Herpes was the biggest thing,\" he said. \"And sometimes you'd be the first person to tell a contestant they had herpes.\"\n\n6. Confessing to psychological issues did not always hurt a contestant's chances of being cast.\n\nIn the book, Rozlyn Papa (Season 14) confesses she told producers that she struggled with depression and believes she shouldn't have been cast on the show. \"If they really were trying to protect you, you'd think that would be sort of a red flag and they would say, 'Well, maybe this is someone who can't handle this kind of pressure,\" she said. Papa was eliminated from Jake Pavelka's season in 2010, and was dubbed one of the season's \"villains\" for having an inappropriate relationship with a producer, which Papa denies.\n\n7. Producers own the exclusive rights to the wedding and Neil Lane ring for two years.\n\nIf the engaged couple breaks up before the two-year mark, they cannot sell the ring, Kaufman notes. Producers pay contestants $10,000 per hour of TV programming for their televised wedding specials.\n\n8. Desiree Hartsock asked producers to pay her rent so she could stay on the show.\n\nDesiree Hartsock Siegfried, who was on Season 9 of The Bachelorette, reportedly was living paycheck to paycheck when she was on Sean Lowe's season of The Bachelor. While taping the show, she said it was rent time and couldn't afford to pay her bills. \"I won't be able to continue unless you pay my rent,\" Hartsock said she told producers.\n\n9. Nick Viall liked the attention from being on the show.\n\nViall (Season 21) told Kaufman that he enjoyed the rush of being recognized from television, although he tried to remind himself that fame was fickle. \"'What am I doing?' I try to tell myself this isn't going to last. I'm aware how forgettable we all are,\" he said.\n\n10. Producers sent Jillian Harris to speech lessons to help her get rid of her Canadian accent.\n\nHarris starred on the fifth season of The Bachelorette. According to Kaufman, producers sent her to speech therapy to help her get rid of her Canadian accent, but then canceled classes after the found her \"quirky voice\" to be an integral part of her personality.\n\n11. The main Bachelor and Bachelorettes get paid a salary commiserate to their actual jobs.\n\nThe Bachelor and Bachelorettes are the only cast members that get paid to appear on the reality show. They are able to negotiate their contracts so that they can make a salary close to what they would make in their regular jobs during their stint on the show, Kaufman notes. However, she also adds that it would be “incredibly rare” for the star of the show to make less than six figures these days.\n\n12. Contestants (both men and women) are encouraged to lose weight and get in good shape.\n\nErica Rose, who competed for Bachelor Lorenzo Borghese's heart on Season 9, said, \"They did encourage everyone to get in their best shape. They'd say, 'Maybe you want to lose some weight, maybe workout.'\" She added that if people were already very thin, producers would not encourage them to get even skinnier. Male contestants told Kaufman they too felt the pressure to look fit, stating that producers would ask them to take their shirts off and show off their muscles.\n\n13. A former producer said black contestants weren’t chosen because producers were “afraid of losing the audience.”\n\n\n\nThe lack of diversity in the Bachelor franchise has always stood out to viewers. In 2017, Rachel Lindsay was finally the first black Bachelorette after 13 seasons of the spinoff and 21 seasons of The Bachelor. There still has never been a black male Bachelor.\n\nFleiss told Entertainment Weekly in 2011 that black contestants “for whatever reason, they don’t come forward.” However, Jeffrees, who worked on the show until 2005, claimed the producers are \"afraid of losing their audience.\"\n\n14. Eric Bigger admits to only dating white women for six years before The Bachelorette.\n\nBigger was part of Rachel Lindsay's final three alongside Bryan Abasolo and Peter Kraus in Season 13. After the show, he received a lot of positive feedback from the black community for being the last black contestant standing. However, in Bachelor Nation, Bigger shared that he \"exclusively dated\" white women for six years prior to Lindsay. \"There aren't that many African Americans in Los Angeles—at least not the area I'm in,\" he said.\n\n15. Producers leave mean notes about contestants when casting.\n\nKaufman discovered a binder filled with annotated casting notes from Jesse Palmer's season, Season 5. In it, she found that producers wrote nasty comments about some of the contestants. Producers allegedly wrote notes like \"very young and immature,\" \"girls won't like her,\" and \"gets prettier the longer you watch her tape.\"\n\n16. The Bachelor mansion belongs to an actual family.\n\nThe picturesque Bachelor mansion, called Villa de la Vina, belongs to real estate developer Marshall Haraden. Haraden and his family live in the six-bedroom, nine-bathroom house about 10 months out of the year.\n\n17. The women are asked to participate in forced conversation better known as “girl chats.”\n\nAccording to Kaufman, producers encourage the women to gather around in the same room of the Bachelor mansion to talk about the lead, the other girls' dates and about who is going home. The chats were reportedly not a requirement in the earlier seasons.\n\n18. Producers keep track of when women are on their period to better their odds of getting an emotional interview.\n\nKaufman notes that producers were known to keep track of when the women in the house were menstruating to schedule one-on-one interviews accordingly. \"It helped the producers, because now you've got someone who is emotional—and all you want is emotion,\" Hatta told Kaufman.\n\n19. Producer Elan Gale tried to pressure Chris Bukowski into proposing—even though he didn't want to.\n\nBukowski said Gale wanted Bukowski, who was originally in Season 8, to propose to Elise Mosca, a girl he had only been dating for a short time after Bachelor in Paradise. However, Bukowski was hesitant because he \"couldn't stand her\" at this point. \"You've got to do it. This is going to fix your image so much. America's going to fall in love with you guys,\" Bukowski said Gale told him. Bukowski didn't go along with the plan, and he and Gale lost touch after that.\n\n20. A former editor admits to cutting clips to create a different narrative than what actually happened.\n\nIt's called “Frankenbiting.” Kaufman notes that a \"Frankenbite\" is a sound bite that has been re-cut so that it has a different meaning. A former editor, who worked on the show for three seasons, told Kaufman, \"You can make it whatever you think. You think, 'Oh, she's going to say something bitchy and we'll use that.' No, no, no. You make whatever she does sound bitchy.\"\n\n21. Clare Crawley said producers purposely made it look like she had sex—when she didn't.\n\nClare Crawley came in second place on Juan Pablo Galavis' season, Season 18. In one episode, she was portrayed as having had sex in the ocean with Galavis. However, Crawley said she was actually just celebrating overcoming her anxiety in the water and did not commit any sexual acts. \"I felt so betrayed by the producers,\" she said.\n\n22. Nick Viall denies slut-shaming Andi Dorfman.\n\n\n\nViall received a lot of backlash when after coming in second place on Andi Dorfman's season, Season 1o, he called her out for having \"made love\" to him in the Fantasy Suite. \"I'm not trying to defend it—it wasn't the platform,\" he told Kaufman. \"But I also wasn't trying to shame her...The truth is, if a girl had done that, all the feminists in the world would have been like, 'You go, girl! Way to call him out!'\"\n\n23. Sean Lowe got cold feet before his proposal to Catherine Giudici.\n\nGiudici (Season 17) told Kaufman that Lowe went to her hotel room around midnight the night before he proposed to her. The Bachelor, who was known for his religious values, said he wasn't going to \"settle for anything less than a family that will center around Christ.\" Giudici admitted that although she and Lowe are happily married for almost four years, she wishes he had not chosen the \"eleventh hour\" to talk about his concerns.\n\n24. Jesse Csincsack was puking on the day he proposed to DeAnna Pappas.\n\nCsincsack admitted he felt pressured into popping the question on the fourth season of The Bachelorette. \"I started throwing up,\" he said. \"I was puking on the sidewalk walking down to get the ring and coming back.\" That should have been a clear cut sign, because Pappas and Csincsack split within a few months of the proposal.\n\n\n\n25. Contestants get paid anywhere from $250 to $10,000 per Instagram post after the show.\n\nOne of the many appeals of participating in the Bachelor franchise these days is the opportunity of becoming an Instagram influencer. Bachelor favorite Ashley Iaconetti (Season 19), who has over 700,000 Instagram followers, told Kaufman she has figured out how to properly profit from her endorsements as her follower count increases. \"250,000 followers = $1,000/ad. 500,000 followers = $2,000/ad. And if you have 1 million followers? You're probably getting at least $10,000 per ad,\" Kaufman notes.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/elle-bachelor-nation-amy-kaufman-1520434486.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/elle-bachelor-nation-amy-kaufman-1520434486.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": ["Eileen Reslen", "I M Eileen", "The Digital News Reporter At Hearst Digital Media."], "canonical_link": "https://www.elle.com/culture/movies-tv/a19136467/bachelor-nation-book-most-shocking-revelations/", "title": "25 of the Most Shocking Revelations From 'Bachelor' Tell-All", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "25 of the Most Shocking Revelations From 'Bachelor' Tell-All", "description": "Will you accept this insanely juicy gossip?", "url": "https://www.elle.com/culture/movies-tv/a19136467/bachelor-nation-book-most-shocking-revelations/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/elle-bachelor-nation-amy-kaufman-1520434486.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "modified_time": "2019-10-24 03:24:49", "published_time": "2018-03-06 09:54:00", "section": "Movies & TV 2020", "opinion": "false"}, "twitter": {"site": "@ELLEmagazine", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/elle-bachelor-nation-amy-kaufman-1520434486.jpg?crop=1.00xw:1.00xh;0,0&resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "25 of the Most Shocking Revelations From 'Bachelor' Tell-All - Amy Kaufman Bachelor Nation Review", "description": "ABC blacklisted reporter Amy Kaufman after a Women Tell All taping. Now she's telling all in Bachelor Nation: Inside the World of America's Guilty Pleasure.", "keywords": "the bachelor, amy kaufman, bachelor nation, bachelor book, bachelor tell-all, reality steve, bachelor nation inside the world of america's guilty pleasure, bachelor secrets, bachelor producers, bachelor nation book", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/elle-bachelor-nation-amy-kaufman-1520434486.jpg?crop=0.365xw:0.731xh;0.574xw,0.144xh&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Culture,culture,movies-tv", "sailthru.date": "2018-03-06T21:54:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/elle-bachelor-nation-amy-kaufman-1520434486.jpg?crop=1.00xw:1.00xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/elle-bachelor-nation-amy-kaufman-1520434486.jpg?crop=0.365xw:0.731xh;0.574xw,0.144xh", "sailthru.socialtitle": "25 of the Most Shocking Revelations From 'Bachelor' Tell-All", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1520301240.0, "source": "https://www.elle.com", "summary": ""}