{"url": "https://ew.com/recap/the-bachelor-season-22-episode-3/2/", "text": "Image zoom Paul Hebert/ABC\n\nThe Bachelor S 22 E 3 type TV Show network ABC genre Reality Where to watch Close Streaming Options\n\nHere’s the thing about having a boring Bachelor: The producers have to pull out all the stops on the dates in order to even attempt to make a season entertaining, and that means wrestling, that means surprise guests, and that means dogs. And even with all that, you’ll probably find yourself thinking, Eh. But here we are anyway, three weeks into Arie’s journey and still only vaguely interested.\n\nWith 18 women left in the house, Chris “Time Is Precious” Harrison arrives to let the women know that there will be two group dates and one one-on-one this week before leaving behind the first date card for: Maquel, Jacqueline, Lauren B., Tia, Marikh, Bekah M., Bibiana, and Krystal. And with that, I’d like to introduce you all to the Gorgeous Ladies of The Bachelor, or GLOB. (Because if I had to choose one word to describe this season, it would in fact be “glob.”)\n\nOn the wrestling date, the women will be learning from two of the “Gorgeous Ladies of Wrestling” — no, not from the hit Netflix show GLOW, but rather from the far less exciting 1980s series. And to make matters worse, Arie doesn’t even know that it’s called a wrestling “match.” He prefers to call it a “wrestling fight” as he stands in the ring in a suit and attempts to participate.\n\nAnd let me tell you something about these gorgeous ladies of wrestling: They do NOT believe in laughter. In their minds, this is not a date. This is the opportunity of a lifetime. The women get to learn from Little Egypt herself, and she will not have them goofing off. Instead, she’s going to insult Bibiana’s mother for naming her child after a Bib, and she’s going to get her fellow wrestler to pull Tia’s hair until she gets angry. (But instead Tia and Bibiana go cry together in a corner.)\n\nSo remember last week when I said Becca’s shopping excursion was a terrible date? This one is WAY worse. Fun is literally not allowed, but you also can’t take things the other direction and hit these mean women. Instead, you have to put on a fake smile and fake punch them.\n\nBut of course, Bekah M. is INTO it. For tonight’s show, she’s going to be a “sex kitten.” Fun fact: She thinks she looks like Catwoman when really, she looks like an 8-year-old who’s about to go trick-or-treating.\n\nAs the women dress up for the main event, it’s Arie who’s the first one in the ring, still wearing a suit because he truly doesn’t have a clue what’s going on. His opponent? Pretty Boy Pitbull Kenny King! Remember Kenny from Rachel’s season? Me too! Excited to see him again? Sure. Want to hear how he’s doing? TOO BAD. You literally watch Kenny throw Arie around and then he’s gone, never to be seen again.\n\nThen it’s the women’s turn to enter the ring, and I’ve gotta say, this feels like a giant step back for womankind. The only highlight? Tia yelling “I’m too pretty for this!” and ultimately defeating Bibiana.\n\nThat night, Arie takes the women to an Airstream park, where Krystal steals him away so he can tell her how sexy she was today and she can whisper sweet, drawn-out syllables into his ear. She asks if he prefers for her to be aggressive, and he is all, “Just be you!” If she needs attention, he gives her permission to come get it. Speaking of attention, Krystal’s time is interrupted. As she stands to leave, she tells the next woman to “have fun,” and those two words have never sounded more like a threat.\n\nWhile Bibiana complains about Krystal being too aggressive, Tia gets some one-on-one time with Arie where he admits that he expected her to rock today, so when he saw that she was upset about the old woman screaming at her and pulling her hair he thought, “Huh, that’s interesting.” GREAT THOUGHT, DUDE. But the good news is that her being upset allowed Arie to comfort her, which apparently makes him feel like a man. So should we address the issue of Arie needing a crying woman to feel like a man? No? Great, let’s move on. (Next: And the date rose goes to…)\n\nNext up, Bekah lies on Arie and tells him about her longest relationship — 2.5 to 3 years — which translates in my mind to: middle school. She and Arie then bond about how breakups can make you reevaluate things and how you, like, totally end up hitting the gym and stuff, right? Totally! Then they make out and she straddles him while the rest of the women discuss how well their nights went.\n\nSo while Bekah mounts Arie, Krystal pulls a Trump and decides that everyone else is living in their own “false reality” and the truth is only what she believes, which is that she and Arie are the OTP…and then Arie gives the date rose to Bekah. As he so eloquently puts it, “You were outstanding today and tonight you were amazing.” (I can only imagine how great his wedding vows will be.)\n\nThe next day, Krystal admits that she’s been hated on by “jealous” girls her entire life. She has struggled for so long and she’s had to be SO strong and carry so much all by herself, and now, she just has to endure it one more time because she knows she and Arie will end up together. This process is just the latest thing she has to get through in order for them to be together in the end. Meanwhile, I can’t wait until ABC forces her to watch this on the Women Tell All special and let me tell you: THAT will be something to endure.\n\nAs for Lauren S., she’s off to Napa Valley with Arie for her one-on-one date in wine country, and she, for one, is looking forward to all the “cheersing” that will be happening. But the wine isn’t the only great thing about this date. There’s also the riveting conversation.\n\nFirst up, they discuss how early they go to bed. THEN they discuss how early they wake up. And wait, isn’t it crazy how you reach a certain age and you suddenly just start wearing cardigans?! So cray.\n\nAnd if you thought that was great stuff, just wait until the dinner portion of the evening in which Lauren S. talks so much that ARIE ACTUALLY EATS. This might be the first time in Bachelor history that we’ve seen someone eat on a date, and that’s how you know it’s bad.\n\nSitting down to dinner, Arie kicks things off by explaining that he’s not a wine connoisseur, he just likes going to wineries and drinking wine. He then asks Lauren ONE question about her journey to get here, and she tells him about past relationships, her amazing friends and family, that one time her mom got an eye infection when she was in college, why she loves music, how she doesn’t really know what “science” is, and the fact that her last relationship lacked chemistry. Welp, I’d say that last thing applies here too.\n\nBefore the night’s over, she tries to rescue herself by talking SOME MORE about how she wasn’t herself tonight and how she’s not sure what’s happening. (Surely it’s not the wine you’ve been drinking all day.) But in the end, Arie tells her he can’t give her the rose because, to quote him, “I don’t even know.” Same, Arie. Same. He then walks her out and says his super easy “most difficult” goodbye yet.\n\nBack at the house, Lauren’s luggage is taken away, and Krystal takes it upon herself to perform some sort of funeral for Lauren’s “beautiful soul” before offering the other women the never-before-heard advice to make the most of their time, and Caroline has had enough of it. As Lauren’s friend, Caroline is done with Krystal and the fact that she thinks she can be condescending to everyone just because “you met his dog.” (Next: Who let the dogs out?)\n\nWell, if that’s the criteria, this place is about to be filled with condescension, because the next group date introduces Ashley, Becca K., Brittany, Jenna, Caroline, Chelsea, and Annaliese to Arie’s dog. Today’s group date involves hanging out at a park and preparing to perform a show with the dogs that night. But for Annaliese, it’s about yet another childhood trauma. (And cue yet another amazing reenactment.)\n\nIt seems that when Annaliese was young, her grandparents’ dog, the clearly misnamed Sunshine, bit Annaliese and she “almost” lost her eye. Okay, I have a few thoughts: Compared to bumper cars, at least this actually seems traumatic, except…how young were you? Do you actually remember this? And also, how did that dog bite you that you almost lost an eye but have no visible scars on your face? And finally, is there any activity that doesn’t stir up some kind of childhood trauma for you?!\n\nThat night, the women have to perform for a bunch of toddlers at The Grove, and the only good thing to come out of it is that Best in Show‘s Fred Willard stops by. And by that, I mean it’s good for us and terrible for poor Fred Willard, who has to watch the women crash and burn. They can’t even get the dogs to sit. Scratch that: They can’t even keep toddlers from wandering onto their stage! And then there’s Annaliese, who’s undoubtedly experiencing another trauma after she’s given the job of designated pooper scooper for the event.\n\nThat night, the women head to an old bank that Jenna just thinks is some building with amazing decor because she doesn’t realize vaults don’t tend to show up in many buildings. Arie grabs Chelsea first, and their conversation goes like this: He gives her a sad face when she says she’s never had anyone respect her for who she is, and somehow that results in them kissing.\n\nCaroline then asks Arie about his last five years A.E. — After Emily — and he admits he dated women who weren’t ready for marriage as a “defense.” She then informs him that the women call him “pillow lips,” and he actually has an appropriately disturbed and embarrassed response.\n\nAnd then there’s Annaliese, experiencing her latest trauma: She can’t get enough time with Arie, and then when she finally does, she can’t think of ANYTHING to say. So instead of getting her first kiss with Arie, she’s interrupted by Chelsea and then returns to the other women and puts on her jacket as one final “f— you” to the sound guy.\n\nWhile Annaliese talks about how she thinks she’s going home, Becca and Arie call each other dorks and make out before he says this super creepy thing: “You look really good in yoga pants, by the way.” And yet, she doesn’t look good enough to get the date rose, which instead goes to Chelsea, because as Arie puts it, she’s the one person who stood out. (Take THAT, everyone else!)\n\nThe next night is the cocktail party, and Bibiana has arranged for a special romantic setup for Arie. She’s got a bed in the driveway along with a telescope so they can stargaze. Only, when she’s not guarding it, Arie and Lauren B. stumble upon it and start making out. And when Bibiana tries to reclaim it, he gives her the “we just need five minutes” slap across the face.\n\nArie then proceeds to take woman after woman to Bibiana’s setup, and even lays Bekah M. down there so that he can figure out why he’s so guarded around her. “I’m unsafe because I think you know that I don’t need you,” she tells him in a moment that actually makes me like her tiny child brain. In the past, he’s been attracted to women who need a man to complete them, and that’s not her. And you know what? That information blows his tiny adult mind.\n\nAfter Tia enjoys some moonshine with Arie, which he claims tastes like gasoline “in a good way,” Annaliese takes him away to get her kiss. But instead of going for it, she ASKS for it, literally, and he tells her that they’re not there yet in what’s the most uncomfortable thing I’ve seen thus far in 2018, and I watched Floribama Shore!\n\nOnce Annaliese stops crying and convinces herself that some of the world’s best relationships start with the people not being attracted to each other — you know, just like Romeo and Juliet — she heads back to ask Arie if he sees a future there. Spoiler: He does not. So Arie promptly walks Annaliese out.\n\nAnd because we’re already sending women home, what do you say we just keep things rolling? At the rose ceremony, Arie hands out roses to: Caroline, Kendall, Ashley, Lauren, Brittany, Becca, Seinne, Krystal, Tia, Maquel, Jenna, Jacqueline, and Marikh. That means it’s time to say goodbye to Bibiana, and my only question is: Will Arie ever know that she is responsible for his favorite make-out spot?\n\nIf you all need me before next week, I’ll be watching GLOW — the Netflix show — with my dog.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2019%2F12%2Fgettyimages-923157538-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F13%2Fbetter-call-saul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2Frhbh-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F09%2Flennykravitz.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F01%2F147763_7383-2000.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F115093_46282_b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F09%2FHomeland_810_4979_R.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F115093_48676b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F11%2Frolestout.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F17%2FNUP_189932_0195.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2FListen-to-Your-Heart.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F01%2F147763_7383-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F10%2Fcelebrity-binge.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F116494_0767b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-voice-rec.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Frhony.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2067'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2064'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2Fdee-rogan-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F12%2Fsnl.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F03%2Fgreys-anatomy-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Fevan-rachel-wood-aaron-paul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-challenge-b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Foutlander-sea5.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F116400_1225b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2FRVD417d_0162b.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F01%2F147763_7383-2000.jpg", "keywords": [], "authors": ["Samantha Highfill", "Seija Rankin", "Jodi Walker", "Maureen Lee Lenker", "Andy Hoglund", "Dalton Ross", "Chancellor Agard", "Sydney Bucksbaum", "James Hibberd", "Maggie Fremont"], "canonical_link": "https://ew.com/recap/the-bachelor-season-22-episode-3/", "title": "The Bachelor recap: Season 22, Episode 3", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "entertainment, entertainment news, ew, entertainment weekly", "news_keywords": "entertainment, entertainment news, ew, entertainment weekly", "description": "Week three involves wrestling, dogs, and two women getting sent home early.", "og": {"title": "'The Bachelor' recap: The women give wrestling a try", "type": "article", "site_name": "EW.com", "url": "https://ew.com/recap/the-bachelor-season-22-episode-3/", "description": "Here’s the thing about having a boring Bachelor: The producers have to pull out all the stops on the dates in order to even attempt&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F01%2F147763_7383-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://ew.com/recap/the-bachelor-season-22-episode-3/", "description": "Week three involves wrestling, dogs, and two women getting sent home early.", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F01%2F147763_7383-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/recap/the-bachelor-season-22-episode-3/", "title": "'The Bachelor' recap: The women give wrestling a try", "description": "Week three involves wrestling, dogs, and two women getting sent home early.", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F01%2F147763_7383-2000.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}}, "movies": [], "publish_date": null, "source": "https://ew.com", "summary": ""}