{"url": "forward.com/schmooze/406999/mila-kunis-and-ashton-kutcher-s-love-story-is-straight-out-of-a-romantic-comedy/", "text": "Getty Images Mila Kunis and Ashton Kutcher Share\n\n\n\nPinterest\n\nEmail\n\nMila Kunis and Natalie Portman are our shiniest examples of the American Jewish dream. Kunis’s family came to the US from the USSR with only $250 when she was a child. Portman’s parents, descended from Holocaust survivors, emigrated to the US from Israel for her father’s work as a doctor.\n\nvia GIPHY\n\nKunis is brash and sexy — the black swan to Portman’s swan princess — and Portman is all grace and quiet strength, shocking the Jewish world with her controversial choice not to accept an award alongside Israeli Prime Minister Benjamin Netanyahu.\n\nTheir love stories are intertwined, as Kunis revealed on Monday on Marc Maron’s podcast “WTF.”\n\nPortman, who after playing Queen Amidalah in “Star Wars” became perhaps the most lusted-after woman in the galaxy, famously fell in love on the set of the 2010 film that won her an Oscar — “Black Swan.” Portman and Kunis played rivals in a ballet company, and Portman fell in love with their choreographer and co-star, French ballet dancer Benjamin Millepied, who later converted to Judaism. He and Portman are married and raising two children, Aleph and Amelia.\n\nvia GIPHY\n\nOn Maron’s podcast, Kunis divulged that Portman also played a role in her romance with her husband, actor Ashton Kutcher, with whom she is, like Portman, raising two Jewish children, Wyatt and Dmitri. Kunis and Kutcher co-starred in the sitcom “That 70’s Show” for eight years — Kunis was cast when she was only 14 — but she says they had “no feelings whatsoever” for each other. Though their characters were romantically involved, leading to plenty of steamy on-screen scenes, “There was nothing there,” Kunis remembers. “It was like … whatever,” she says. They were friends.\n\nvia GIPHY\n\nKunis went on to date fellow child star Macauley Culkin for eight years. Kutcher famously wed actress Demi Moore, and the couple eventually filed for divorce, which was finalized after… eight years of marriage. (See how much weird symmetry there is in this story?)\n\nIn 2011, Kunis was cast in a movie called “Friends With Benefits,” about a man and woman who decide to add a sexual component to their friendship, believing they’ll be able to stay otherwise platonic. Of course, they fall in love. Her co-star wasn’t Ashton Kutcher, which would have been too easy; it was Justin Timberlake.\n\nvia GIPHY\n\nIn 2011, Kutcher was cast in a movie called “No Strings Attached,” about a man and woman who decide to add a sexual component to their friendship, believing they’ll be able to stay otherwise platonic. Of course, they fall in love. His co-star was none other than Natalie Portman.\n\nvia GIPHY\n\nOne night, Kunis says, she was backstage at an awards show. She saw an attractive man — from her vantage point, she could only see his profile — and began wondering who he was. He turned. It was Ashton Kutcher. She had been admiring the man she’d known for almost 15 years. They began seeing each other.\n\n“We never dated,” Kunis said. “We hooked up.” Kunis was starring in a movie about casual sex with friends. Kutcher was doing the same. “We lived out our movies,” she said. (Really makes you wonder what she does when she’s in movies about crime.)\n\nAny romantic-comedy fan knows exactly what’s going to happen next.\n\nThe affair lasted three months, then something shifted. Kunis began to have feelings for her longtime friend. “I walked up to him, and I was like, ‘You know what? I actually care about you, and I don’t want to mess anything up, so I’m just going to walk away before it becomes too much,’” she says.\n\nvia GIPHY\n\n“The next day, he showed up to my house, and he was like, ‘Move in with me,’” she remembers.\n\nvia GIPHY\n\nAnd so she did.\n\nWhy did it take so long for the photogenic couple to come together?\n\nKunis says it had to happen the way it happened. “We would have never been together if we didn’t both go through what we went through in order to be the people that we were when we met,” she says. “Reconnected I should say — not met.”\n\nvia GIPHY\n\nJenny Singer is the deputy lifestyle editor for the Forward. You can reach her at Singer@forward.com or on Twitter @jeanvaljenny", "images": ["https://images.forwardcdn.com/image/1090x480/center/top/images/cropped/mila-kunis-ashton-kutcher-1533050727.jpg", "https://www.facebook.com/tr?id=1138270999612182&ev=PageView&noscript=1"], "top_img": "https://images.forwardcdn.com/image/1090x480/center/top/images/cropped/mila-kunis-ashton-kutcher-1533050727.jpg", "keywords": [], "authors": ["Jenny Singer", "Getty Images"], "canonical_link": "https://forward.com/schmooze/406999/mila-kunis-and-ashton-kutcher-s-love-story-is-straight-out-of-a-romantic-comedy/", "title": "Mila Kunis And Ashton Kutcher’s Love Story Is Straight Out Of A Romantic Comedy", "meta_data": {"description": "Mila Kunis's love story with Ashton Kutcher has something to do with Natalie Portman, Kunis revealed on \"WTF\" with Marc Maron.", "og": {"site_name": "The Forward", "title": "Mila Kunis And Ashton Kutcher’s Love Story Is Straight Out Of A Romantic Comedy", "type": "article", "url": "https://forward.com/schmooze/406999/mila-kunis-and-ashton-kutcher-s-love-story-is-straight-out-of-a-romantic-comedy/", "image": "https://images.forwardcdn.com/image/1090x480/center/top/images/cropped/mila-kunis-ashton-kutcher-1533050727.jpg", "description": "Get ready for the ride of your life, Kunis-Kutcher fans."}, "twitter": {"image": "https://images.forwardcdn.com/image/1090x480/center/top/images/cropped/mila-kunis-ashton-kutcher-1533050727.jpg", "site": "@jdforward", "card": "summary_large_image", "title": "Mila Kunis And Ashton Kutcher’s Love Story Is Straight Out Of A Romantic Comedy", "description": "Get ready for the ride of your life, Kunis-Kutcher fans.", "url": "https://forward.com/schmooze/406999/mila-kunis-and-ashton-kutcher-s-love-story-is-straight-out-of-a-romantic-comedy/"}, "fb": {"app_id": 186464554784446, "pages": 39846147446}, "p": {"domain_verify": "0ca032fc72a6636649d5cc6684c68bdb"}, "date": "2018-07-31 10:44 -0400", "search.author": "jennysinger", "search.section": "schmooze", "search.timestamp": 1533048240, "search.type": "blog", "parsely-title": "Mila Kunis And Ashton Kutcher’s Love Story Is Straight Out Of A Romantic Comedy", "parsely-link": "https://forward.com/schmooze/406999/mila-kunis-and-ashton-kutcher-s-love-story-is-straight-out-of-a-romantic-comedy/", "parsely-type": "post", "parsely-image-url": "https://images.forwardcdn.com/image/center/top/images/cropped/mila-kunis-ashton-kutcher-1533050727.jpg", "parsely-pub-date": "2018-07-31 10:44 -0400", "parsely-section": "The Schmooze", "parsely-tags": "ashton kutcher,mila kunis,natalie portman", "parsely-author": "Jenny Singer", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "https://forward.com/ms-icon-144x144.png", "theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1, maximum-scale=1", "itemprop": 2020}, "movies": [], "publish_date": null, "source": "http://forward.com", "summary": ""}