{"url": "www.cheatsheet.com/entertainment/matt-lauer-new-details-about-his-reported-secret-plans-for-a-career-comeback.html/", "text": "Could Matt Lauer still make a career comeback? NBC fired the Today anchor in November after he was accused of sexual misconduct, and he has not been heard from since. But recently, there has been some indication that he’s not planning to stay out of the spotlight for long, and he’s hoping to bounce back from the scandal.\n\nHere’s what we know about Lauer’s reported plans, including the one move that has people thinking he’s planning a return (page 5) and his first public statement in months (page 8).\n\n1. Lauer retreated to the Hamptons after the scandal\n\nMatt Later retreated to the Hamptons after the scandal. | Michael Loccisano/Getty Images Matt Later retreated to the Hamptons after the scandal. | Michael Loccisano/Getty Images\n\nAfter NBC fired him, Lauer essentially went into hiding. While he was working at Today, Lauer lived in Manhattan during the week; he would spend the weekends with his family in the Hamptons.\n\nBut following his fall from grace, Lauer fled Manhattan and went to his Hamptons home. He remained there until his wife reportedly kicked him out. Then, Lauer moved to another nearby house in the Hamptons, and that’s mainly where he has been since. In April, he listed his Manhattan apartment for $7 million.\n\nPage Six reported in December that Lauer had no plans to return to public life. But this did not seem to remain true for very long, according to numerous reports.\n\nNext: The first rumbling that Lauer might be interested in returning\n\n2. He reportedly started thinking about a comeback as soon as January\n\nMatt Lauer has reportedly been itching to return to the spotlight. | Jason Kempin/Getty Images for The Rolling Stones Matt Lauer has reportedly been itching to return to the spotlight. | Jason Kempin/Getty Images for The Rolling Stones\n\nIn January, less than two months after Lauer’s firing, Hollywood Life reported that he was thinking about making a comeback. A source close to Lauer said that he “misses the spotlight” and is “now reconsidering a future comeback.” However, the source said that Lauer’s friends and his lawyers were telling him that it’s far too soon.\n\nAnother report from Radar Online later that month suggested that Lauer was thinking about becoming a film producer, starting his career by funding documentaries, as Katie Couric has done.\n\nNext: Some information about how Lauer might go about a comeback\n\n3. He might give a public apology when things die down\n\nMatt Lauer may opt to give a formal, sit-down interview at some point. | NBC Matt Lauer may opt to give a formal, sit-down interview at some point. | NBC\n\nA few months later, in March 2018, Entertainment Tonight reported that Lauer is almost ready for his comeback. A source said that Lauer thinks he just needs to wait for the public to move on from the scandal first.\n\n“Matt seems to be under the impression that if he waits this news cycle out, this will go away and he can have a comeback,” the source said. “He has seen a lot of people come back and hopes he will too.”\n\nSo how would that actually happen? Well, the source said that Lauer’s team has discussed the idea of a public apology. Lauer did issue an apology immediately after the scandal, but presumably, his plan would involve a more extensive one given on camera in some sort of sit-down interview. The source referred to Lauer as potentially going on a “redemption tour.”\n\nNext: What Lauer’s former colleagues had to say about his potential comeback.\n\n4. Hoda Kotb and Savannah Guthrie say he’s not focused on a comeback ‘right now’\n\nHoda Kotb and Savannah Guthrie insist he’s not ready to return to the spotlight — yet. | NBC Hoda Kotb and Savannah Guthrie insist he’s not ready to return to the spotlight — yet. | NBC\n\nRecently, current Today hosts Hoda Kotb and Savannah Guthrie were asked about whether Lauer might make a comeback, and neither one of them gave a totally definitive “no.”\n\nGuthrie said she had “no idea” whether Lauer is planning to come back, saying that he’s “really focused on his family right now.” Kotb agreed, adding that this is “where his heart is at this moment” and that a comeback isn’t at the “forefront of his mind.”\n\nSo neither one said that Lauer has no interest in returning to public life, just that he’s likely not planning to do so right now.\n\nNext: Despite what Kotb and Guthrie say, this suggests that Lauer won’t let his career go.\n\n5. He refuses to let go of Today and might even try to return to it\n\nHoda Kotb and Matt Lauer reportedly keep in touch. | NBC Hoda Kotb and Matt Lauer reportedly keep in touch. | NBC\n\nLauer would probably need to still have close relationships with members of the media if he hopes to have any chance of returning. It seems that he does, and he never stopped talking with his friends on Today. Hoda Kotb revealed in April that “we keep in touch with [Lauer]” and that it’s a “complex” situation.\n\nIt sounds like Lauer has gone beyond just maintaining friendships with his former colleagues. According to Page Six, Lauer was still reaching out to Today producers as recently as January and giving them feedback about specific segments.\n\nIt’s difficult to imagine that NBC would actually let Lauer return after everything that happened. But In Touch Weekly did report in February that Lauer might come back to Today for a tell-all interview.\n\nNext: A major new development suggests that Lauer is making moves towards his comeback.\n\n6. He was seen out in Manhattan in April for the first time in months\n\nMatt Lauer was seen out in Manhattan for the first time in months. | Neilson Barnard/Getty Images Matt Lauer was seen out in Manhattan for the first time in months. | Neilson Barnard/Getty Images\n\nFor months after his firing, Lauer remained isolated in the Hamptons. He only ever made headlines when someone spotted him dropping his kids off at school or going to stores.\n\nThen, on April 16, 2018, Page Six published an article revealing how Donald Trump’s lawyer, Michael Cohen, was given a warm reception at a restaurant in Manhattan. But the juiciest detail was hidden several paragraphs into the article: at that same restaurant was none other than Lauer, who was out and about in Manhattan for the first time in months.\n\nNext: What sources say this indicates about Lauer’s future\n\n7. He’s reportedly testing the waters for his return\n\nThis may be his first step back into the public eye. | Scott Halleran/Getty Images This may be his first step back into the public eye. | Scott Halleran/Getty Images\n\nIs it jumping the gun to suggest that Lauer returning to Manhattan after months of hiding indicates that he’s ready for his career comeback to begin? Apparently not, as per Page Six, “Lauer is said to be testing the waters for a public comeback by coming out of hiding from his Hamptons home.”\n\nThe report also cited anonymous friends of Lauer’s as saying that he’s ready to “restart his life.”\n\nIf Lauer does try to make a comeback, it sounds like it could start with him giving a sit-down interview and potentially attempting a new career in film production. But it remains to be seen whether the public, and fellow members of the media, would ever be willing to support him again.\n\nNext: This new development fits with the idea that Lauer is attempting to return to the public eye.\n\n8. He recently spoke out for the first time since the scandal\n\nMatt Lauer and Andy Lack | Dimitrios Kambouris/Getty Images Matt Lauer and Andy Lack | Dimitrios Kambouris/Getty Images\n\nNot long after the report that Lauer was testing the waters for his return, we received some more evidence of that. On April 27th, Lauer spoke publicly for the first time since his scandal in November.\n\nLauer told The Washington Post that he has been remaining silent in order to allow his family to have privacy, but now, false stories require him to speak up. Here’s Lauer’s full statement:\n\n“I have made no public comments on the many false stories from anonymous or biased sources that have been reported about me over these past several months…I remained silent in an attempt to protect my family from further embarrassment and to restore a small degree of the privacy they have lost. But defending my family now requires me to speak up. I fully acknowledge that I acted inappropriately as a husband, father and principal at NBC. However I want to make it perfectly clear that any allegations or reports of coercive, aggressive or abusive actions on my part, at any time, are absolutely false.”\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2018/02/Matt-Lauer.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/11/matt-lauer-today.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/01/hoda-kotb-matt-lauer.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/04/lauer.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/04/Matt-Lauer-and-Andy-Lack.jpg?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "http://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2018/04/GettyImages-467241645-2.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/01/hoda-kotb-savannah-guthrie-tease-new-180102-jpg.today-inline-vid-featured-desktop.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/02/Matt-Lauer.png", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Matt-Lauer.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/02/Matt-Lauer.png", "keywords": [], "authors": ["Brendan Morrow"], "canonical_link": "https://www.cheatsheet.com/entertainment/matt-lauer-new-details-about-his-reported-secret-plans-for-a-career-comeback.html/", "title": "Matt Lauer: New Details About His Secret Plans for a Career Comeback, Revealed", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/matt-lauer-new-details-about-his-reported-secret-plans-for-a-career-comeback.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "Matt Lauer may be attempting to make a career comeback. Here's a look at everything we know about his reported plans to revitalize his career.", "og": {"locale": "en_US", "type": "article", "title": "Matt Lauer: New Details About His Secret Plans for a Career Comeback, Revealed", "description": "Matt Lauer may be attempting to make a career comeback. Here's a look at everything we know about his reported plans to revitalize his career.", "url": "https://www.cheatsheet.com/entertainment/matt-lauer-new-details-about-his-reported-secret-plans-for-a-career-comeback.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-06-09T16:33:23-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2018/02/Matt-Lauer.png", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2018/02/Matt-Lauer.png"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "Today", "section": "Entertainment", "published_time": "2018-06-09T16:29:00-04:00", "modified_time": "2018-06-09T16:33:23-04:00"}, "twitter": {"card": "summary_large_image", "description": "Matt Lauer may be attempting to make a career comeback. Here's a look at everything we know about his reported plans to revitalize his career.", "title": "Matt Lauer: New Details About His Secret Plans for a Career Comeback, Revealed", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/02/Matt-Lauer.png", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1528576140.0, "source": "http://www.cheatsheet.com", "summary": ""}