{"url": "https://www.thesun.co.uk/tvandshowbiz/4426397/kim-kardashian-breaks-silence-on-surrogacy-reports/", "text": "KIM Kardashian has broken her silence over claims she’s chosen the woman who will be a surrogate for her third child with Kanye West.\n\nYesterday it was reported the famous couple were in contact with “a married African-American college graduate with two children” who would help bring their third child into the world.\n\n15 Kim Kardashian has broken her silence over reports she has chosen the woman she wants as her surrogate Credit: Splash News\n\nBut it seems Kim isn’t ready to discuss details yet, as she told E! News she would talk about her much-talked-about “third child” when she was ready.\n\nKim explained: “[There’s] so many details out there, and like I've never heard this, I've never heard this.\n\n“Like whatever. We have not confirmed it, and that's that. I'll let you know when we're ready.\n\n“I've definitely seen a lot of things, we've never confirmed anything.”\n\nKim made the comments during a night out with her sister Kendall Jenner at the Harper's BAZAAR event celebrating ICONS By Carine Roitfeld in New York.\n\nRumours surrounding Kim and Kanye deciding to expand their family have been circulating for months, after the Keeping Up With The Kardashians star said she would use a surrogate.\n\n15 The reality star and her husband Kanye West have been at the centre of numerous surrogacy reports over the past few weeks Credit: Splash News\n\nEarlier this week it was revealed that the couple, who are already parents to North, four, and Saint, one, will be welcoming a baby girl in January.\n\nAccording to TMZ, the pair decided to have a third baby via surrogacy because of Kim's well-documented medical issues during her previous pregnancies.\n\n15 According to recent claims, the pair are expecting their third baby in January 2018 Credit: Getty - Contributor\n\n15 Kim was last seen in public out and about in LA on August 24 Credit: BackGrid\n\n15 Kanye was seen leaving a recording studio in LA on Tuesday night Credit: X17Online.com\n\nAnother source told People: \"The entire family is over the moon.\n\n\"Given her health scares in the past, Kim felt the need to hire a surrogacy agency that helped serve as the liaison in finding a healthy woman who would be a great surrogate option for her and Kanye.\n\n\"Both of them have been super involved in the process.\"\n\nNeither Kim nor Kanye has confirmed the news but it's not the first time they've been at the centre of speculation a third child is on the way.\n\nReports of a surrogate surfaced in July, with Us Weekly claiming their chosen surrogate was already three months pregnant.\n\nAn insider alleged at the time that the woman was approached by the famous couple through “an agency”.\n\n15 Kim and Kanye are already parents to daughter North, four, and son Saint, one, both conceived naturally Credit: Getty - Contributor\n\nClaims of a surrogate child being on the way come after Kim revealed she suffers from a condition that means she is unable to carry any more children.\n\nIn an episode of Keeping Up With The Kardashians aired last year, the reality star was warned she could \"bleed to death\" if she falls pregnant for a third time.\n\nKim sought her doctor's advice after admitting she wanted a third pregnant but fearing the same complications she endured in past pregnancies would return.\n\n15 Kim, pictured in 2015 while pregnant with Saint, has been warned she could 'bleed to death' if she falls pregnant again Credit: Getty - Contributor\n\nDoctor Crane warned her against it and said there is a \"potential fear\" for her after she suffered from toxaemia - toxins in the blood from infection - and had two \"very traumatic\" labours with North and Saint.\n\nHe said: \"Here's what I think, your pregnancies, you had toxaemia, you had a retained placenta, very traumatic, we're always worried about the next serious complication. I think the potential fear of the whole situation is legitimate.\n\n\"You never know that you might not have the same type of problem that might be more serious this time. You're always taking a little bit of a chance. There are situations where retained placenta could be life and death.\"\n\nHer mother Kris, 61, then said: \"You could bleed to death\".\n\nWhat is toxaemia of pregnancy? During Kim’s last two pregnancy she suffered from toxaemia – more commonly known as pre-eclampsia. It is a condition that can affect pregnant women, resulting in high blood pressure and damage to one or more organs, often the kidneys. It is usually diagnosed after 20 weeks of pregnancy and can lead to serious complications for mother and baby. In Kim’s case she was warned that she could ‘bleed to death’ if she got pregnant again following complications the last two times.\n\n15 Kim suffered toxaemia during her pregnancies with North and Saint Credit: Splash News\n\n15 Kim confirmed in August that she and Kanye wanted a third child Credit: Instagram\n\nKim confirmed last month that she and Kanye were hopeful of a third child, but kept tight lipped about details or timing.\n\nSpeaking to The Hollywood Reporter about the possibility of a third child, she said: \"I hope so. There have been a lot of things said and Kanye and I have not confirmed anything. We're definitely trying. We are hoping so.\"\n\n15 Kim, seen while pregnant with Saint, hinted in August that she and Kanye were trying for a third child Credit: Getty - Contributor\n\n15 The star has openly spoken about exploring surrogacy Credit: Fame Flynet\n\nKim has spoken in the past about exploring surrogacy - and even said she'd asked sisters Kourtney and Khloe if they would be willing to carry her child.\n\nSpeaking during an appearance on Watch What Happens Live, she explained: \"I have had to go through multiple things to try and do it on my own but I do not think that is looking good for me but I am not giving up.\n\n\"So it is a process. You kind of see the whole thing on this next season of our show... of me begging Khloe to help out, but I do not want to do that to her.\n\n\"My mom offered, Kourtney offered.\"\n\n15 Kim has asked her sisters if they would be surrogates for her and Kanye Credit: BackGrid\n\n15 The couple have been married since 2015 Credit: EPA\n\nKim’s troubles began when she was pregnant with her first child North after doctors discovered she had a high-risk condition called placenta accreta.\n\nThe rare condition occurs when the placenta attaches too deep into the uterine wall and is life-threatening because the sufferer can lose an average of three to five litres of blood during delivery.\n\n15 Kim has documented her medical issues on Keeping Up With The Kardashians Credit: Getty - Contributor\n\n15 Kim and Kanye have yet to confirm reports of hiring a surrogate or expecting a third child Credit: Getty Images - Getty\n\nGot a story? email digishowbiz@the-sun.co.uk or call us direct on 02077824220", "images": ["https://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.9 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.7 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.8 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/uploads/2017/09/pmcompositekim.jpg?strip=all&quality=100&w=750&h=500&crop=1", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2017/09/pmcompositekim.jpg?strip=all&quality=100&w=750&h=500&crop=1", "keywords": [], "authors": ["Ellie Henman"], "canonical_link": "https://www.thesun.co.uk/tvandshowbiz/4426397/kim-kardashian-breaks-silence-on-surrogacy-reports/", "title": "Kim Kardashian breaks her silence over surrogacy amid claims she’s chosen ‘married college graduate’ to carry her third child", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Kim Kardashian breaks her silence over surrogacy amid claims she's chosen 'married college graduate' to carry her third child", "url": "https://www.thesun.co.uk/tvandshowbiz/4426397/kim-kardashian-breaks-silence-on-surrogacy-reports/", "description": "KIM Kardashian has broken her silence over claims she’s chosen the woman who will be a surrogate for her third child with Kanye West. Yesterday it was reported the famous couple were in contact wit…", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2017/09/pmcompositekim.jpg?strip=all&quality=100&w=750&h=500&crop=1", "width": 750, "height": 500}, "locale": "en_GB"}, "article": {"published_time": "2017-09-09T08:59:06+00:00", "modified_time": "2017-09-09T09:36:02+00:00", "publisher": 161385360554578, "tag": "Kanye West, Kim Kardashian, Keeping Up with the Kardashians", "author": "https://www.facebook.com/thesunshowbiz/"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "description": "Kim Kardashian has broken her silence about the claims she’s chosen the woman who will be a surrogate for her third child with Kanye West...", "keywords": "Kim Kardashian, Kanye West, Surrogacy,", "news_keywords": "Kim Kardashian, Kanye West, Surrogacy,", "twitter": {"text": {"title": "Kim Kardashian breaks her silence over surrogacy amid claims she’s chosen ‘married college graduate’ to carry her third child"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "BABY TALK", "headline": "Kim Kardashian breaks silence amid claims she's chosen 'married college graduate' as surrogate", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2017/09/pmcompositekim.jpg?strip=all&quality=100&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2017/09/pmcompositekim.jpg?strip=all&quality=100&w=620&h=413&crop=1"}}, "parsely-post-id": 4426397, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1504947546.0, "source": "https://www.thesun.co.uk", "summary": ""}