{"url": "www.inquisitr.com/4653927/angelina-jolie-the-shock-diet-causing-actress-to-lose-weight-amid-brad-pitt-divorce-drama/", "text": "Angelina Jolie is allegedly surviving on little to no food, with sources questioning whether the stress of her divorce with Brad Pitt is to blame for her weight loss.\n\nAccording to OK! Magazine, as cited by Gossip Cop, the actress has developed a smoking habit that’s so bad, she finds herself smoking an entire pack every single day, and to make matters worse, Angelina Jolie isn’t eating much on top of that.\n\nSources tell the publication that the A-list actress wakes up in the morning and finds herself smoking with a cup of coffee before the kids wake up, and she reportedly breaks the habit until her children are fast asleep before she carries on again.\n\nSupposedly, Angelina Jolie smokes heavily throughout the morning and evening, and in the afternoon, there’s nothing that she consumes other than French cheese and expensive wine, which has greatly affected her weight, an insider stresses.\n\nShe’s nowhere near as healthy as she used to be, but the outlet fails to mention what her actual reasons are for this drastic diet she’s adapted to, though fans would want to believe that it’s presumably due to the supposed stress dealing with her divorce from Brad Pitt.\n\nWhatever the case may be, it’s evidently clear that Angelina Jolie has been losing weight, which sources tell OK! Magazine is simply through the way that the mother of six has been treating herself as of late.\n\n“Anytime I feel lost, I pull out a map and stare. I stare until I have reminded myself that life is a giant adventure, so much to do, to see.” – Angelina Jolie A post shared by Angelina Jolie (@angelinajolieofficial) on Nov 20, 2017 at 3:49pm PST\n\nAngelina Jolie has never shied away from her dark past, which consisted of multiple health issues, but she has never commented on people’s recent concerns regarding her weight loss.\n\nA statement regarding new claims about her unhealthy food intake will most likely not be addressed by the actress, for she has stayed away from even commenting on anything that concerns her weight.\n\nAngelina Jolie has yet to finalize her divorce from Brad Pitt, as the couple continues to work out a custody plan with visitation rights that they are both in agreement with.\n\nDespite OK! Magazine‘s claims, Gossip Cop‘s sources question the credibility of the outlet’s insiders, insisting that the story regarding Angelina Jolie’s weight loss is far from true.\n\nJolie famously filed for divorce last September, with reports at the time claiming that Pitt’s alcohol addiction had gotten so out of hand, it was beginning to affect everyone’s life around him, including his own family.\n\nAngelina Jolie has remained single ever since.", "images": ["http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "https://secure.gravatar.com/avatar/2146221c3bb32c670d1053a99949feba?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2017/11/angelina-jolie-feud-brad-pitt-custody-divorce-settlement.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Maurice Cassidy"], "canonical_link": "https://www.inquisitr.com/4653927/angelina-jolie-the-shock-diet-causing-actress-to-lose-weight-amid-brad-pitt-divorce-drama/", "title": "Angelina Jolie: The Shock Diet Causing Actress To Lose Weight Amid Brad Pitt Divorce Drama", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}