{"url": "http://hotlifestylenews.com/lifestyle/celebrate-selena-gomezs-new-single-back-voting-iconic-music-videos-peoples-choice-awards/", "text": "Selena Gomez has released new music and now we need a complete album ASAP!\n\nThe 25-year-old singer has been teasing fans for a while now that she has enough content for an album, but she isn’t ready to drop anything. The good news is that while we wait for another record Gomez has given fans a gift. On Thursday she dropped a new track called “Back to You,” which is a part of the 13 Reasons Why soundtrack from season two.\n\nThere might not be a music video for “Back to You” just yet—there is a lyric video—but that doesn’t mean we can’t imagine how great it’ll be. As fans wait for 13 Reasons Why‘s second season to premiere on Netflix—Gomez is the executive producer on the show—they can listen to its soundtrack.\n\nWatch\n\nInside Jennifer Aniston & Selena Gomez’s Friendship\n\nAs fans of the former Disney Channel star and her music career you can relive her best music videos below. We know it’s not as good as getting a full CD of fresh tracks from Gomez, but it’ll do. In fact, after scrolling through her best music videos including, “Come and Get It,” you can cast your vote on which one you love most in our poll.\n\nGomez has a lot of hits so it won’t be easy to decide which video is the best of the best, but you can do it. Plus, it’s fun to go back through the “Bad Liar” singer’s videos because it’s like taking a trip back through your childhood AKA it’s a win-win!\n\n“Bad Liar”\n\nThe 2017 video for “Bad Liar” is one of the most movie-like videos Gomez has ever done. It takes you back to the ’70s with the style and as Gomez goes through her school day it’s totally relatable. Plus, Gomez plays all of the leads including a man, a cool girl—complete with Farrah Fawcett locks—and your average teen.\n\n“Hands to Myself”\n\nIf you thought Gomez couldn’t do sexy then you haven’t seen this music video. “Hands to Myself” is saucy, sexy and full of spice from the singer. She shows off her killer bod in her lingerie, dances in a Risky Business ensemble and rides a motorcycle with Christopher Mason, who is extremely good looking. This is all before she lounges in her tub and channels her inner pop diva.\n\n“Kill Em With Kindness”\n\nSometimes the simplest videos are the best. That is the case with “Kill Em With Kindness.” It begins with Gomez sitting and singing with a photography backdrop behind her. You then see roses and flashes and simple dress changes, which just works. The entire video is in black and white and it’s just so sophisticated.\n\nPhotos\n\n4 Selena Gomez-Inspired Outfits for Spring\n\n“Come & Get It”\n\nWe will never stop loving this music video. Gomez’s style in this video is impeccable. From her corseted black dress to the saucy red number we are in love with her ensembles. The fashion mixed with the epic dance moves in beautiful locations make this one of the artist’s best videos ever.\n\n“Fetish”\n\nOkay, so “Fetish” is a little bit of a confusing video, but from beginning to end you’re intrigued. What’s happening? The character that Gomez portrays is a little bit of a mess and we’re not exactly sure what time period this is supposed to be. The photography is funky and fun. Paired with Gomez’s great acting skills and outbreaks throughout the video has us hooked…even if we’re lost.\n\n“Slow Down”\n\nThis song is such a party jam and the video fits that vibe perfectly. Seeing Gomez looking fierce in a car on her way to a club and then watching the dance scenes are so fun. We want to dance every time we hear this track and clearly that’s the point based on the video. It’s fierce and shows Gomez as a total boss.\n\n“Love You Like a Love Song”\n\nThis song is an oldie but goodie and the video is top notch. Gomez takes over the karaoke stage in this video with big and bold curls and wow. She then gets trippy on us and goes into a whole different world complete with purple backdrops and warrior duds. Oh, and who could forget Gomez’s Marie Antionette costume in the middle? It’s so bizarre and wonderful at the same time.\n\nPhotos\n\nSelena Gomez’s Best Coach Looks\n\n“The Heart Wants What It Wants”\n\nThe best thing about this video is the realness of it. It shows the raw and soft side of Gomez and it pulls at our heartstrings. The pain in Gomez’s face is moving and hits us hard no matter how many times we’ve watched this video.\n\n“Good For You”\n\nGomez strips down throughout this video both literally and figuratively. She goes nude in a shower scene and stays in simple and minimal outfits to keep the music at the forefront. It’s a fresh-faced Gomez, which we love on a real and intriguing level. It might be a little boring compared to her action-packed videos but we like the break from action.\n\n“Wolves”\n\nWhen Gomez teamed up with Marshmello for “Wolves” we expected something unique and we weren’t disappointed. The singer looks glamourous as she sits in a locker room and struts her stuff in that fabulous glitter gown. It’s animalistic, fresh and electric. PS: That diving board scene is amazing.\n\nWatch the 2018 People’s Choice Awards Sunday, Nov. 11, only on E!\n\nSource: Read Full Article", "images": ["https://hotlifestylenews.com/wp-content/uploads/2018/05/rs_600x600-180510044550-600.selena-gomez-back-to-you.51018-450x280.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20800%20450'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20743%20489'%3E%3C/svg%3E", "https://akns-images.eonline.com/eol_images/Entire_Site/201832/rs_600x600-180402114047-600-Selena-Gomez-Blue-Dress-Sneaker.jl.040218.jpg?fit=inside|192:192&output-quality=90", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20639%20404'%3E%3C/svg%3E", "https://hotlifestylenews.com/wp-content/uploads/2018/05/rs_600x600-180510044550-600.selena-gomez-back-to-you.51018.jpg", "https://hotlifestylenews.com/wp-content/uploads/2020/04/cnews00152468.jpg", "https://hotlifestylenews.com/wp-content/uploads/2020/04/ccelebritiesSD-LAB-COMPOSITE-V2.jpg", "https://hotlifestylenews.com/wp-content/uploads/2020/04/cfntalk5670.jpg", "https://hotlifestylenews.com/wp-content/uploads/2020/04/ccelebritiespjimage-1-1.jpg", "http://c.statcounter.com/11691185/0/36067258/1/", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E", "https://hotlifestylenews.com/wp-content/uploads/2020/04/cnewsfotoskynews-elton-john-coronavirus_4971921.jpg", "https://hotlifestylenews.com/wp-content/uploads/2020/04/ccelebritiesPRC_149576034_1587280964.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201026%20577'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201231%20692'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20775%20538'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20450%20280'%3E%3C/svg%3E", "https://akns-images.eonline.com/eol_images/Entire_Site/2018113/rs_600x600-180213165846-600-Selan-Gomez-Coach-Front-Row-Group.jl.021318.jpg?fit=inside|192:192&output-quality=90"], "top_img": "https://hotlifestylenews.com/wp-content/uploads/2018/05/rs_600x600-180510044550-600.selena-gomez-back-to-you.51018.jpg", "keywords": [], "authors": [], "canonical_link": "https://hotlifestylenews.com/lifestyle/celebrate-selena-gomezs-new-single-back-voting-iconic-music-videos-peoples-choice-awards/", "title": "Celebrate Selena Gomez's New Single Back to You by Voting for Her Most Iconic Music Videos on People’s Choice Awards", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Celebrate Selena Gomez's New Single Back to You by Voting for Her Most Iconic Music Videos on People's Choice Awards | Hot Lifestyle News", "description": "Selena Gomez has released new music and now we need [...]", "url": "https://hotlifestylenews.com/lifestyle/celebrate-selena-gomezs-new-single-back-voting-iconic-music-videos-peoples-choice-awards/", "site_name": "Hot Lifestyle News", "image": {"identifier": "https://hotlifestylenews.com/wp-content/uploads/2018/05/rs_600x600-180510044550-600.selena-gomez-back-to-you.51018.jpg", "secure_url": "https://hotlifestylenews.com/wp-content/uploads/2018/05/rs_600x600-180510044550-600.selena-gomez-back-to-you.51018.jpg", "width": 450, "height": 350}}, "article": {"tag": "Selena Gomez", "section": "Lifestyle", "published_time": "2018-05-11T12:05:02+00:00"}, "twitter": {"card": "summary_large_image", "description": "Selena Gomez has released new music and now we need [...]", "title": "Celebrate Selena Gomez's New Single Back to You by Voting for Her Most Iconic Music Videos on People's Choice Awards | Hot Lifestyle News", "image": "https://hotlifestylenews.com/wp-content/uploads/2018/05/rs_600x600-180510044550-600.selena-gomez-back-to-you.51018.jpg"}, "generator": "WordPress 5.4", "msapplication-TileImage": "https://hotlifestylenews.com/wp-content/uploads/2019/11/cropped-5-270x270.gif"}, "movies": [], "publish_date": 1526040302.0, "source": "http://hotlifestylenews.com", "summary": ""}