{"url": "https://www.usatoday.com/story/life/people/2018/04/27/royal-baby-kates-new-prince-louis-arthur-charles/549429002/", "text": "LONDON — Four days after the Duke and Duchess of Cambridge's new royal baby was born, the public learned Friday that the little prince will be called Louis Arthur Charles.\n\nKensington Palace said the baby, the couple's second son, will be known as His Royal Highness Prince Louis of Cambridge.\n\nPrince Louis, born at St. Mary's Hospital in London at one minute after 11 a.m. local time on Monday, weighed 8 pounds, 7 ounces at birth.\n\nLouis (pronounced \"Louie\") is one of Prince William's several middle names and was also given to his other son, Prince George, as a middle name.\n\nArthur, which had been the favorite name among British bettors, was the middle name of great-granny Queen Elizabeth II's father, King George VI, as well as that carried by King Arthur of Britain's mythic past.\n\nThe name Louis is more closely associated with French monarchs, such as Louis XIV, the Sun King. In British royal terms, the name can be seen as a touching honor to the baby's great-grandfather, Prince Philip, 96, and a posthumous honor to Lord Louis \"Uncle Dickie\" Mountbatten, a royal relation (like them, descended from Queen Victoria) and Philip's uncle.\n\nAs a young orphaned Greek royal exile, Philip was raised by Mountbatten and was introduced to the then-Princess Elizabeth as a teen through the ambitious matchmaking of Uncle Dickie.\n\nMountbatten was especially close to the baby's grandfather, Prince Charles, who viewed him as a mentor and father figure. A former British Navy leader and the last British viceroy of India, Mountbatten was killed by an IRA bomb at age 79 (along with some of his family) while fishing off his Irish estate in 1979, a shocking tragedy that devastated the royal family.\n\nThe baby is the couple's third child and is the first little prince to be affected by a 2013 change in British laws that made birth order more important than gender in determining the line of succession to the throne.\n\nThus, this baby is fifth in line, behind his older sister instead of displacing her.\n\nUncle Prince Harry, 33, moved down to sixth in line, and any children he has with his American fiancée, Meghan Markle, 36, will follow him in the succession.\n\nWill and Kate's other recent name choices — Prince George Alexander Louis, 4, and Princess Charlotte Elizabeth Diana, 2 — come from the 18th and 19th centuries, balancing tradition, family obligations and personal taste.\n\nMore:Duchess Kate and Prince William leave hospital with new baby prince\n\nMore:How does Duchess Kate do it? From giving birth to camera-ready in heels in under 8 hours\n\nChristian Turner, global director of naming at the brand-strategy firm Siegel+Gale, says that in naming their children, Will and Kate have skillfully navigated the tricky shoals of meeting history's expectations while sending branding signals to the public that \"we're like you, we're a family.\"\n\nHe says George and Charlotte are examples of historical names that also have become popular in recent decades with everyone else. \"The royals are trying to connect with the people; they're putting in the hours trying to make sure they're royal in bearing and stature but also familiar and accessible to everyone,\" Turner says.\n\nWill and Kate took two days to announce both George and Charlotte's names.\n\nThe young royal family emerged from the hospital six hours after the delivery Monday, baby in Kate's arms, as cheers from a small crowd of onlookers erupted and the cameras of the usual huge media mob whirred and clicked.\n\nKate was wearing a Jenny Packham knee-length red dress with a white Peter Pan collar, and showed only a slight remaining baby bump. Later, they went back inside briefly, then reemerged holding hands, with Will carrying the baby in a baby car seat. Then they returned to their Kensington Palace apartment as news helicopters followed them from above.\n\nPrince William was there for the birth, as he was for their previous two children. The baby was born on St. George's Day, marking the national day for England's patron saint.\n\nMore:Royal baby: Where does the new prince fit in the line for the throne?", "images": ["https://www.gannett-cdn.com/-mm-/7cc91a2fc88ced0a2af2040d9468185ff626b58f/c=0-123-3320-4550/local/-/media/2018/04/23/USATODAY/USATODAY/636601036006063807-AP-Britain-Royal-Baby.4.jpg?width=300&height=401&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/d787fdc222d2f713cdf2d57e4911183500385802/c=0-243-3319-2118/local/-/media/2018/04/23/USATODAY/USATODAY/636601036006063807-AP-Britain-Royal-Baby.4.jpg?width=3200&height=1808&fit=crop&format=pjpg&auto=webp", "http://www.gannett-cdn.com/media/2018/04/25/USATODAY/USATODAY/636602505122190988-AP-APTOPIX-Britain-Royal-Baby.1.jpg?width=660&height=372&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/d787fdc222d2f713cdf2d57e4911183500385802/c=0-243-3319-2118/local/-/media/2018/04/23/USATODAY/USATODAY/636601036006063807-AP-Britain-Royal-Baby.4.jpg?width=3200&height=1808&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/people/2018/04/27/royal-baby-kates-new-prince-louis-arthur-charles/549429002/", "title": "Royal baby: Prince William and Duchess Kate's new prince is named Louis Arthur Charles", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Royal baby: Prince William and Duchess Kate's new prince is named Louis Arthur Charles", "description": "Four days days after the Duke and Duchess of Cambridge's new royal baby was born, Kensington Palace said the baby will be known as His Royal Highness Prince Louis of Cambridge.", "url": "https://www.usatoday.com/story/life/people/2018/04/27/royal-baby-kates-new-prince-louis-arthur-charles/549429002/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/d787fdc222d2f713cdf2d57e4911183500385802/c=0-243-3319-2118/local/-/media/2018/04/23/USATODAY/USATODAY/636601036006063807-AP-Britain-Royal-Baby.4.jpg?width=3200&height=1808&fit=crop&format=pjpg&auto=webp", "width": 3200, "height": 1808}, "type": "article"}, "article": {"author": "Maria Puente and Kim Hjelmgaard", "content_tier": "free", "opinion": "false"}, "description": "Four days days after the Duke and Duchess of Cambridge's new royal baby was born, Kensington Palace said the baby will be known as His Royal Highness Prince Louis of Cambridge.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/d787fdc222d2f713cdf2d57e4911183500385802/c=0-243-3319-2118/local/-/media/2018/04/23/USATODAY/USATODAY/636601036006063807-AP-Britain-Royal-Baby.4.jpg?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Royal baby: Prince William and Duchess Kate's new prince is named Louis Arthur Charles", "description": "Four days days after the Duke and Duchess of Cambridge's new royal baby was born, Kensington Palace said the baby will be known as His Royal Highness Prince Louis of Cambridge."}}, "movies": [], "publish_date": 1524758400.0, "source": "https://www.usatoday.com", "summary": ""}