{"url": "https://www.manrepeller.com/2018/10/tracee-ellis-ross-amas.html", "text": "Yesterday, my lunch was dressing with a side of salad, not because I prefer to treat condiments as meals but because of overzealous pouring and lack of sleep. It is important to note that I made the salad by myself, for myself. I was the only one at fault in this scenario. Tight about the whole thing but not one to waste food, I noshed sullenly on what had the mouthfeel of a swamp. And then, to get out of my funk, I turned to my one true source of comfort: Tracee Ellis Ross.\n\nYou might be wondering why salad was enough to get me down and to that I say, “I’M SENSITIVE,” and “Don’t get us off track, please.” What’s more important than my labile mood is the fact that although we are not yet friends IRL, I knew Tracee would provide me the kind of support I needed because: a.) this has historically been true and b.) her Instagram be poppin’.\n\nPoint a.) would imply that Tracee and I have a history at all, which I can confirm. I have loved her for over 15 years — since Girlfriends debuted and I saw a sitcom full of femmes who looked like what I imagined my friends and I would look like when we finally reached our early adult years.\n\nGirlfriends, like Sex and the City, is about four friends moving through the trials and tribulations of their 20s and maybe 30s. I loved both shows; both were inspirational to me, painting pictures of lives I could potentially lead. But Girlfriends was aspirational in a way that Sex and the City could never be: While watching Tracee’s character, Joan, a successful lawyer with a nice house, I didn’t have to whitewash myself to imagine that I could, one day, be a successful lawyer with a nice house too. (Also, shout out to Tracee for being on UPN, the unofficial Black channel of the 90s and 2000s.)\n\nI eventually realized that Tracee is Diana Ross’ daughter and became an even bigger fan based on her parentage — trivial, but I was young. Learning that she, too, is a biracial Black woman offered me another point of connection. It’s inappropriate to conflate all biracial experiences into one, but at 13 I was yearning for role models I could truly relate to and felt kindred with her because I presumed we shared at least some common understandings. Plus, we have kinda the same hair and have you noticed her slightly lazy eye (no shade, just observation) because I HAVE THAT TOO. (See this example.) I notice it often while watching Black-ish and sometimes when I’m scrolling her social media feed, which brings me comfort and to point b.) the poppin’ Instagram.\n\nTracee hosted the American Music Awards on Tuesday; her Instagram is currently chock full of AMA content — 11 different looks! — which is delightful and aesthetically pleasing for many reasons. First, there is the above gold dress made by CD Greene.\n\nTurn on your JavaScript to view content\n\nI did not truly understand how important it is to sometimes dress like an actual disco party until now, and for that I salute you, Tracee and Mr. Greene. Hats off. We should also talk about that inspired cobalt blue number by new designer DÈSHON.\n\nIs it a dress? Is it a trench? It is neither, but rather, a slit blazer and pleated trouser (a suit!) that look like both a dress and a trench coat, but better. With elements that suggest being simultaneously casual AND elegant is possible, the voluptuous ensemble blends masculine and feminine to echo what many of our generation know to be true: binary thinking is for the birds. Hats off yet again.\n\nTurn on your JavaScript to view content\n\nI could go on and on about the way her fashion choices inspire me to love her more every day, although I’m not unique in this. Remember the pink Valentino dress she wore to the Emmys? Her sleeves alone wielded a power over the internet typically reserved for the bare asses of those with outsized fame — no small feat. But I don’t adore her just because her personal brand is cool and fun to look at. I love her because of the way she moves through the world.\n\nTurn on your JavaScript to view content\n\nAs my friend and colleague Nora would say, “be the change, etc. etc.” Tracee does just that. She is an example to me; a possibility model. Of course, it helps that sometimes when I’m watching her T Murda videos I get confused and can’t tell if I’m watching Tracee’s rapper persona or myself listening to music alone in my apartment. We are the same, I think, laughing — and I am inspired. But what I mean is: I hope I am like her in the ways that matter most to me.\n\nAt the time of this writing, the most recent post on Tracee’s Instagram feed is an iOs press release that reads:\n\nFor the American Music Awards, from press to stage, I featured Black designers in my looks. Not every piece of what I wore was by a Black designer, but I wore a Black designer in every look and Pat McGrath on my face. It was the story I wanted to tell and Karla Welch made it happen. I was inspired by Issa Rae and Jason Rembert, who did it first at the CDFA Awards back in June. I strongly believe in using my platform to shine light in directions I believe in, and I believe in, love, and celebrate my people.\n\nI love the way Tracee loves us: unabashedly. It’s her most appealing quality — greater than her bomb fashion or her delightfully joyful existence. It’s easy to get caught up in the trappings of colorism that can come with looking like she does, or the trappings of elitism that so often come with wealth and fame like hers. But I see Tracee working hard to maintain her self-awareness, to turn around and lift others up in the same way that so many before her have; in the way I aspire to do. She reaches back and shines on our community in a way that is distinct and deserves celebrating.\n\nSo many things she does are for us, and what’s more important than being a champion for the culture in times like these? To me, not much.\n\nFeature photos by Kevin Mazur/AMA2018 via Getty Images.", "images": ["https://manrepeller-wpengine.netdna-ssl.com/wp-content/plugins/a3-lazy-load/assets/images/lazy_placeholder.gif", "https://t.co/i/adsct?txn_id=nv0io&p_id=Twitter&tw_sale_amount=0&tw_order_quantity=0", "https://www.manrepeller.com/wp-content/uploads/2018/10/Tracee-Ellis-Ross-Man-Repeller-feature-2-1.jpg", "https://manrepeller-wpengine.netdna-ssl.com/wp-content/themes/mr2017/dist/images/nav/search-mobile.png?v=20200419", "https://pixel.quantserve.com/pixel/p-xVX2ST-EDeFEf.gif", "https://assets.rewardstyle.com/images/search/350.gif", "https://manrepeller-wpengine.netdna-ssl.com/wp-content/themes/mr2017/dist/images/temp/astronaut.png?v=20200419", "https://manrepeller-wpengine.netdna-ssl.com/wp-content/themes/mr2017/dist/images/doll-l-09-2019.png?v=20200419", "https://www.facebook.com/tr?id=1280088375337969&ev=PageView\n&noscript=1", "https://manrepeller-wpengine.netdna-ssl.com/wp-content/themes/mr2017/dist/images/mr-mobile-menu.png?v=20200419", "https://manrepeller-wpengine.netdna-ssl.com/wp-content/themes/mr2017/dist/images/carat.svg", "http://manrepeller.wpengine.netdna-cdn.com/wp-content/themes/manrepeller/img/flamingo.gif", "https://manrepeller-wpengine.netdna-ssl.com/wp-content/themes/mr2017/dist/images/doll-r-09-2019.png?v=20200419", "https://analytics.twitter.com/i/adsct?txn_id=nv0io&p_id=Twitter&tw_sale_amount=0&tw_order_quantity=0"], "top_img": "https://www.manrepeller.com/wp-content/uploads/2018/10/Tracee-Ellis-Ross-Man-Repeller-feature-2-1.jpg", "keywords": [], "authors": ["Emma Bracy", "Mallory Rice", "Edith Young", "Harling Ross", "Gyan Yankovich"], "canonical_link": "https://www.manrepeller.com/2018/10/tracee-ellis-ross-amas.html", "title": "I'd Like to Thank Tracee Ellis Ross for Redefining \"Celebrity\"", "meta_data": {"viewport": "width=device-width, initial-scale=1", "google-site-verification": "googlefd1f074c08d2c967.html", "bitly-verification": "504376c415f9", "p": {"domain_verify": "166a201fd83575b716ebfc30836e5b2b"}, "description": "Tracee Ellis Ross hosted the AMAs on Tuesday, and in doing so further underlined why she is the only celebrity I want and need.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "I'd Like to Thank Tracee Ellis Ross for Redefining \"Celebrity\"", "description": "Tracee Ellis Ross hosted the AMAs on Tuesday, and in doing so further underlined why she is the only celebrity I want and need.", "url": "https://www.manrepeller.com/2018/10/tracee-ellis-ross-amas.html", "site_name": "Man Repeller", "updated_time": "2019-03-28T21:46:36-04:00", "image": {"identifier": "https://www.manrepeller.com/wp-content/uploads/2018/10/Tracee-Ellis-Ross-Man-Repeller-feature-2-1.jpg", "secure_url": "https://www.manrepeller.com/wp-content/uploads/2018/10/Tracee-Ellis-Ross-Man-Repeller-feature-2-1.jpg", "width": 1400, "height": 906}}, "article": {"publisher": "https://www.facebook.com/manrepeller", "section": "Pop Culture", "published_time": "2018-10-12T16:00:03-04:00", "modified_time": "2019-03-28T21:46:36-04:00"}, "twitter": {"card": "summary", "description": "Tracee Ellis Ross hosted the AMAs on Tuesday, and in doing so further underlined why she is the only celebrity I want and need.", "title": "I'd Like to Thank Tracee Ellis Ross for Redefining \"Celebrity\" - Man Repeller", "site": "@manrepeller", "image": "https://www.manrepeller.com/wp-content/uploads/2018/10/Tracee-Ellis-Ross-Man-Repeller-feature-2-1.jpg", "creator": "@emmabracy"}}, "movies": [], "publish_date": 1539374403.0, "source": "https://www.manrepeller.com", "summary": ""}