{"url": "https://www.cheatsheet.com/health-fitness/heres-why-gwyneth-paltrows-ex-husband-chris-martin-might-walk-her-down-the-aisle.html/", "text": "Gwyneth Paltrow and Chris Martin | Charley Gallay/Getty Images Gwyneth Paltrow and Chris Martin | Charley Gallay/Getty Images\n\nWhile many a bride with an ex-husband would prefer he stay far away from her wedding, Gwyneth Paltrow may feel differently. In fact, the 45-year-old actress might even have former husband Chris Martin walk her down the aisle, reports say.\n\nPage Six says Paltrow will marry Hollywood producer Brad Falchuk in her Hamptons home at the end of summer, “after Labor Day.” The wedding would happen two years after her “conscious uncoupling” with the Coldplay lead singer. The two were married for 10 years.\n\nThe wedding roles of Martin and their kids\n\nThe lifestyle guru is considering asking Martin and film director Steven Spielberg to escort her down the aisle, Express reported. Paltrow’s father, producer and director Bruce Paltrow, died from cancer in 2002 at age 58.\n\n“She’s toying with the idea of having both Spielberg and her ex-husband Chris give her away,” a source told the U.K. news outlet. The source said Paltrow’s and Martin’s children, Apple, 13, and Moses, 12, will be flower girl and ring bearer.\n\nThe Goop owner also hopes Martin will join Mick Jagger to perform at her wedding, Express reported, adding the guest lists includes Julia Roberts, Madonna, and the Obamas.\n\nPaltrow’s Father’s Day wishes\n\nThe Academy Award winning actress recently sent out Father’s Day wishes to both her ex and her fiancée on Instagram. “Happy Father’s Day cajm, you are a ray of sunshine,” she captioned a photo of the Coldplay singer, 41, and their two kids.\n\nIn turn, she shared a photo of herself, Falchuk, and their blended families. The caption read, “Happy Father’s Day @bradfalchuk You are extraordinary.” Falchuk shares children Isabella and Brody with his ex-wife, Suzanne.\n\nPaltrow’s current and former flames are seen hanging out together in a November 2017 snap she shared on Instagram. Captioned “Sunday brunch #modernfamily,” the two men smile while seated next to each other.\n\nSunday brunch #modernfamily A post shared by Gwyneth Paltrow (@gwynethpaltrow) on Nov 26, 2017 at 12:59pm PST\n\nTheir history since splitting\n\nSince they split in 2014, Paltrow and Martin have remained friendly, vacationing together with their kids. They hit the beach on the Caribbean island of Antigua last winter. Paltrow shared a photo on Instagram of Martin and Apple leaping in the air in front of a glowing sunset.\n\n“They always keep it very amicable around the holidays and they have remained good friends,” a source told E! News. “Gwyneth and Chris try to keep things as normal as possible for their children, and always have a good time together as a family unit. They try to plan at least one family vacation together per year for the sake of the kids. The children are used to the family dynamic now and love when they are all are able to be together.”\n\nHow Paltrow and Falchuk celebrated their love\n\nSome predicted Paltrow and Falchuk would marry at an April 2018 bash the couple hosted, reports said. Rather, it appeared to have been an engagement party. Afterward, Paltrow shared an Instagram photo of her and Falchuk at the bash, thanking friends for attending She closed the caption with, “And most of all thank you @bradalchuk for the true happiness.”\n\nThree months prior, the couple announced their engagement in Goop Magazine’s Sex & Love issue. Paltrow had been dating the American Horror Story producer for three years.\n\nE! News denied the report\n\nE! News discounted the rumor Martin may walk Paltrow down the aisle, calling it “definitely false” and saying “no matter how conscious their uncoupling, they’re definitely not that chummy.”\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2017/07/GwynethPaltrowChrisMartin-1.jpg", "https://www.cheatsheet.com/wp-content/uploads/2017/07/GwynethPaltrowChrisMartin-1.jpg?x62514", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2017/07/GwynethPaltrowChrisMartin-1.jpg", "keywords": [], "authors": ["Karen Bennett"], "canonical_link": "https://www.cheatsheet.com/health-fitness/heres-why-gwyneth-paltrows-ex-husband-chris-martin-might-walk-her-down-the-aisle.html/", "title": "Here’s Why Gwyneth Paltrow’s Ex-Husband Chris Martin Might Walk Her Down the Aisle", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/health-fitness/heres-why-gwyneth-paltrows-ex-husband-chris-martin-might-walk-her-down-the-aisle.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "Gwyneth Paltrow reportedly plans to tie the knot with fiancée Brad Falchuk at her Hamptons home. Will ex-husband Chris Martin walk her down the aisle?", "og": {"locale": "en_US", "type": "article", "title": "Here's Why Gwyneth Paltrow’s Ex-Husband Chris Martin Might Walk Her Down the Aisle", "description": "Gwyneth Paltrow reportedly plans to tie the knot with fiancée Brad Falchuk at her Hamptons home. Will ex-husband Chris Martin walk her down the aisle?", "url": "https://www.cheatsheet.com/health-fitness/heres-why-gwyneth-paltrows-ex-husband-chris-martin-might-walk-her-down-the-aisle.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-06-29T19:21:05-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2017/07/GwynethPaltrowChrisMartin-1.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2017/07/GwynethPaltrowChrisMartin-1.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "celebrity gossip", "section": "Health & Fitness", "published_time": "2018-06-29T19:21:00-04:00", "modified_time": "2018-06-29T19:21:05-04:00"}, "twitter": {"card": "summary_large_image", "description": "Gwyneth Paltrow reportedly plans to tie the knot with fiancée Brad Falchuk at her Hamptons home. Will ex-husband Chris Martin walk her down the aisle?", "title": "Here's Why Gwyneth Paltrow’s Ex-Husband Chris Martin Might Walk Her Down the Aisle", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2017/07/GwynethPaltrowChrisMartin-1.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1530314460.0, "source": "https://www.cheatsheet.com", "summary": ""}