{"url": "https://people.com/archive/mel-gibson-out-of-control-vol-74-no-1/", "text": "Image zoom\n\nFor one sunny summer weekend, at least, there was peace in the mad, mad world of Mel Gibson. He spent July 10 and 11 playing and enjoying time with his 9-month-old daughter Lucia in his Malibu home. “He’s okay as long as he’s with her,” says a friend. “He loves that baby.” Meanwhile his ex-girlfriend and Lucia’s mom, Oksana Grigorieva, 40-his adversary in a ferocious ongoing custody battle-was photographed 15 miles away, grocery shopping.\n\nBut as soon as the weekend was over, one of Hollywood’s nastiest breakups went ballistic again. On July 12 an eight-minute recording allegedly of Gibson viciously ranting at Grigorieva was posted on Radaronline.com, which has posted several leaked tapes despite a judge’s ordering them sealed. Hyperventilating with fury during the phone conversation early this year, Gibson, 54, screams and curses while seemingly admitting to having hit Grigorieva in the face while she held Lucia and threatening to bury Grigorieva “in an [expletive] rose garden … I’m capable of it” (see box). Gibson’s raw, hate-filled outbursts-other tapes, reportedly made by Grigorieva, included racial and ethnic slurs-have people wondering how the life of a movie star once renowned for his charm and humility could have gone so far off the rails.\n\nGet push notifications with news, features and more.\n\nGibson may have to answer that in court: The L.A. County Sheriff’s Department announced it is investigating Grigorieva’s claims that he hit her in the face “more than once” this January, knocking out a dental veneer. (A Gibson source said the actor was restraining Grigorieva from shaking Lucia “like a rag doll”; Gibson also claims to have evidence Grigorieva was using tapes to try to extort money from him.) L.A. criminal defense attorney Trent Copeland calls the tapes “a smoking gun of domestic violence” that will create public pressure to charge Gibson, perhaps with battery and making threats. But “as inflammatory as this tape is, it’s not a slam dunk against Mel,” says former L.A. prosecutor Jeffery Rubenstein. “The legality of the tapes will be fought over, and it could be argued that she deliberately pushed his buttons.”\n\nIn the meantime Gibson’s vitriolic rants, on top of anti-Semitic remarks he made during his 2006 arrest for drunk driving, have turned some of Hollywood against him. His agency William Morris Endeavor announced on July 9 that it would no longer represent him, a few days after the death of his longtime personal agent Ed Limato. Ari Emanuel, the head of WME, “personally hated the things Mel has said and done,” says an industry source. “He was embarrassed to have him at William Morris.” And while Gibson has often financed his films himself, his future as a bankable mainstream actor is in doubt. His Jodie Foster-directed dark comedy The Beaver, shot last fall, still has no release date, while a proposed Viking epic with Leonardo DiCaprio “will never happen [with Leo],” says a source. “At a certain point, it’s five strikes and you’re out,” says one Hollywood insider. “He has expressed hate towards so many kinds of people, I think he’s toast.”\n\nSome who know Gibson say he began losing control of his life after separating from his wife of 26 years, Robyn, in 2006 and particularly after she filed for divorce in April 2009. “Robyn always had a calming influence on Mel, and he always felt safe with her,” says a source close to the family. “His family always stood by him through good and bad. Now Mel is like a lost boy without her.”\n\nGibson seemed to rebound after his 2006 DUI arrest, apologizing for drunkenly telling cops that Jews were responsible “for all the wars in the world.” He also landed the lead role in the thriller Edge of Darkness. But then he started publicly stepping out with Grigorieva, a Russian-born musician (Lucia was born last October; they broke up this March). From the beginning, say friends, they were not an ideal match. “She has no sense of humor,” an acquaintance says of Grigorieva. “I thought, ‘God, Mel loves to joke, so what’s he going to do with this girl?’ You had an impulsive, damaged, funny man with an opportunistic, cold survivor. It was destined for doom.” Sources close to Gibson’s camp believe Grigorieva only dated him to benefit her career and bank account: “Mel realized how unhealthy the relationship was and recognized he was getting his buttons pushed. He wanted to figure out how to extricate himself peacefully and calmly,” says one friend. Gibson began seeing a therapist earlier this year to help him deal with the troubled relationship, says the source, noting the actor is still in therapy.\n\nGibson has long admitted to problems controlling his emotions. In a 2002 interview he said he had been diagnosed as manic depressive; he entered rehab for alcoholism after his 2006 DUI arrest. Lately he seemed to have been staying sober. On the set of Edge of Darkness, Gibson “did not drink, and he wasn’t going crazy,” says production assistant Jill Habelow. A source on the set of Gibson’s movie How I Spent My Summer Vacation, filmed in Mexico this spring, says Gibson “was not raging around. He was just one of the guys, and [crew members] would run through a wall for him.”\n\nBut the way Gibson’s anger has erupted is new and alarming, says the Gibson family source. “Mel never talked to Robyn in a disrespectful way,” says the source. “He’s had anger issues all his life, but Robyn knew how to deal with him. To hear how Mel speaks to Oksana in such a hateful manner is very sad. It shows how far off the track Mel has gone.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2010%2F07%2F20100726_58-61.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2065'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=300&h=157&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2010%2F07%2F20100726_58-61.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=300&h=157&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2010%2F07%2F20100726_58-61.jpg", "keywords": [], "authors": ["Alex Tresniowski"], "canonical_link": "https://people.com/archive/mel-gibson-out-of-control-vol-74-no-1/", "title": "Mel Gibson: Out of Control", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Leonardo DiCaprio,Mel Gibson", "news_keywords": "Leonardo DiCaprio,Mel Gibson", "description": "Amid a bitter custody fight, tapes surface of Mel Gibson allegedly spewing hate and threatening his ex-girlfriend", "og": {"title": "Mel Gibson: Out of Control", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/archive/mel-gibson-out-of-control-vol-74-no-1/", "description": "For one sunny summer weekend, at least, there was peace in the mad, mad world of Mel Gibson. He spent July 10 and 11 playing&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=300&h=157&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2010%2F07%2F20100726_58-61.jpg", "width": 300, "height": 157}}, "pinterest": {"url": "https://people.com/archive/mel-gibson-out-of-control-vol-74-no-1/", "description": "Amid a bitter custody fight, tapes surface of Mel Gibson allegedly spewing hate and threatening his ex-girlfriend", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2010%2F07%2F20100726_58-61.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/archive/mel-gibson-out-of-control-vol-74-no-1/", "title": "Mel Gibson: Out of Control", "description": "Amid a bitter custody fight, tapes surface of Mel Gibson allegedly spewing hate and threatening his ex-girlfriend", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=300&h=157&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2010%2F07%2F20100726_58-61.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}