{"url": "https://www.byrdie.com/best-selling-cvs-products-2017", "text": "If we learned anything about beauty trends in 2018, it's that what products and looks are christened as cool evolve faster than ever before. Gone are the days when every American woman would hop on one collective beauty bandwagon, buying the same lip pencil or face cream as everyone else for a year straight. Thanks to social media, the diversification of brands and the hyper-crowded beauty marketplace, consumers' tastes are more varied and move quicker than at any other point in beauty history.\n\nAll that said, there are still a few products that cohesively defined America's overall beauty vibe in 2018. This year, we saw several distinct patterns, including the launch of CBD-infused beauty, natural formulas with minimal packaging, expanded cosmetic shade ranges, and a lot of understated glitter makeup (as understated as glitter can be).\n\nThe following 15 beauty products were the ones that we think best encapsulated 2018 as a beauty moment in time. Keep scrolling to see the eye shadows, face masks, mascaras, and more that made the list.\n\nLord Jones High CBD Formula Body Lotion $60 Shop\n\nThis was the year of CBD beauty, and chic skincare and wellness brand Lord Jones dominated the market. The brand launched its hypnotic-smelling body lotion this year, which contains a high concentration of CBD—perfect for easing post-workout soreness, period cramps, and any other icky pain-related maladies. (It's available on Sephora.com where it has almost a perfect five-star rating.) The brand's ultra-calming CBD gummies were also a defining product of 2018—especially on stressful days at Byrdie HQ.\n\nFenty Pro Filt'r Soft Matte Longwear Foundation $35 Shop\n\nIt would be inaccurate and just plain irresponsible to talk about the beauty products that represented 2018 without mentioning Fenty, which I'd go so far as to say was the one cosmetics brand that defined the year above all others. At the end of 2017, Rihanna released her now award-winning 40-shade foundation collection, which sent ripples throughout the entire makeup industry, and in the year since, brands from Covergirl to Dior have followed suit, expanding their foundation shade ranges. Fenty has been a groundbreaker in the makeup world this year. Its Gloss Bomb and Diamond Bomb both easily deserve a spot on this list as well.\n\nShani Darden Texture Reform $95 Shop\n\nCertainly one of the buzziest releases of the year was celebrity facialist Shani Darden's resurfacing serum, which she calls the gentle sister to the Retinol Reform. A bright, radiant, even complexion achieved without beating the crap out of your skin was definitely the overall skincare vibe in 2018, and Shani's new product (which celebs like Drew Barrymore already swear by) is basically that philosophy in a bottle. (Click here for a full review of it.)\n\nAugustinus Bader The Rich Cream $160 Shop\n\nHigh-tech skincare was something we also saw a ton of in 2018, not least of which is this ultra-rich, regenerative moisturizer. The new and proprietary formula was developed by scientists to feature natural amino acids, high-grade vitamins, and synthesized molecules, which help the body enhance its own stem cell production. The pricey, royally packaged product is Violet Grey's skincare best seller.\n\nMilk Kush High Volume Mascara $24 Shop\n\nMore CBD! Milk Makeup shook the cosmetics industry this year by releasing an entirely new CBD oil–infused makeup line, starting with its ridiculously volumizing Kush Mascara, then brow gel, then a lip balm and mask (available December 26). We can definitely expect to see more CBD-infused makeup in 2019, but it all started this year with Milk.\n\nNécessaire The Starter Kit $50 Shop\n\nThis new holistic, ultra-chic bodycare line features a simply packaged and sustainably produced body lotion, wash, and lube. We saw the launch of several nontoxic, ethically made, female-empowering body and sexual health products this year from awesome brands like Lola and Sustain Natural, but our wellness editor Victoria says Nécessaire is the one that \"perfectly encapsulates minimalist skincare.\" So 2018.\n\nGlow Recipe Avocado Melt Sleeping Mask $49 Shop\n\nKorean-inspired skincare went absolutely nowhere in 2018. In fact, interest in the country's innovative textures and formulas only continued to skyrocket as proven by the much-hyped launch of Glow Recipe's highly Instagramable avocado sleeping mask (the richer counterpart to its best-selling watermelon mask). It's like the avocado toast of skincare in that you'll be hard-pressed to find someone who isn't always in the mood for this super-hydrating, gently decongesting overnight mask, which quickly earned almost a perfect five-star rating on Sephora.com.\n\nOuai Haircare Sun of a Beach Ombré Spray $24 Shop\n\nStrobing and lightening hair sprays (like highlighters for your hair) were a big trend this year, and one of the buzziest launches of the bunch was this summer product from Ouai. The lemon-coconut water spray is heat-activated, so upon exposure to the sun, it gives the hair subtle highlights. IGK's glitter hair spray and Summertime Hair Lightening Spray were a couple other fun 2018 launches in this category.\n\nKopari Coconut Deodorant $14 Shop\n\nHigher-end, non-granola natural deodorants became a major thing this year, and Kopari's much-anticipated, Allure Best of Beauty Award–winning, and Sephora best-selling coconut deodorant was perhaps the year's best-loved pick.\n\nSummer Fridays Jet Lag Mask $48 Shop\n\nL.A. bloggers Marianna Hewitt and Lauren Gores Ireland released their much-hyped Summer Fridays Jet Lag mask this year, which, if you spent any time on Instagram this summer, you couldn't miss. According to an in-depth review by Byrdie's UK editor, \"The balm-like cream that smells very subtly minty contains antioxidant-rich vitamin C to brighten, niacinamide to reduce the appearance of pores and fine lines, chestnut extract to gently exfoliate, and green tea to reduce puffiness and inflammation. What's genius about this mask is that it's a no-nonsense product made for and by busy people. You slather it onto cleansed skin, leave for 10 minutes, and then tissue off the excess. Skin feels moisturized and plump while looking brighter and calmer.\"\n\nIsle of Paradise Self Tanning Drops $29 Shop\n\nWe thought there were no new advancements to be made in the self-tanner world until Isle of Paradise's totally natural, organic, non-gross-smelling, beautifully packaged, and easy-to-use line of products came out in 2018. These lightweight 100% clear drops, which you can apply to your body or face lotion, changed the self-tanning game this year—and not only because the brand used regular people with actual human bodies in its ad campaigns. Isle of Paradise is also the only self-tanner to earn Sephora's new Clean Beauty seal.\n\nPat McGrath Labs BlitzTrance Lipstick $38 Shop\n\nPretty much every year in beauty since legendary makeup artist Pat McGrath launched her iconic line has been a Pat McGrath year, and 2018 was no exception. She launched so many lust-worthy items this year, from eye shadow palettes to lip balms, but we have to single out her newest launch, a ridiculously mesmerizing BlitzTrance lipstick which deposits a full-coverage coating of crystallized color onto the lips, making them look shimmery, enchanting, and very holiday-appropriate.\n\nGlossier Lidstar Duo $30 Shop\n\nMore glitter: Glossier's hotly anticipated Lidstar was at the forefront of the \"eye topper\" makeup trend. Shimmery, glossy liquid eye products are only going to continue to take the makeup market by storm.\n\nBillie The Starter Kit $9 Shop\n\nAnother empowering brand that got real with its ads this year was razor delivery service Billie, which featured actual human female body hair (gasp) in its Project Body Hair campaign, along with the slogan, “If and when you feel like shaving, we’re here.” This chill attitude toward real bodies was very representative of 2018.\n\nFlesh Ripe Flesh Glisten Drops $28 Shop\n\nAnother brand that really symbolized a shift in the diversity and wearability of makeup this year was makeup artist Linda Wells's new line, Flesh, in which the products were formulated to flatter truly every skin tone. The shade ranges and formulas stole Team Byrdie's hearts this year, especially these insanely glow-inducing highlighter drops. (Read a full review of the line here.)", "images": ["data:image/svg+xml,%3Csvg width=%27450%27 height=%27522%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%27700%27 height=%27467%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%27480%27 height=%27640%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "https://www.byrdie.com/thmb/4kX7UW6KXr38C1pW5TImTacuwWs=/500x350/filters:no_upscale():max_bytes(150000):strip_icc()/rep-9534533aedc547e7b327267a77b6c120.jpg", "data:image/svg+xml,%3Csvg width=%27500%27 height=%27500%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%27700%27 height=%27879%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%27700%27 height=%27700%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%27480%27 height=%27660%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%27700%27 height=%27597%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%27650%27 height=%27650%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%27550%27 height=%27550%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg width=%27700%27 height=%27531%27 xmlns=%27http://www.w3.org/2000/svg%27%3E%3Cg%3E%3C/g%3E%3C/svg%3E", "https://www.byrdie.com/thmb/Od7fJuoiB9ATL_Mf6HOoL8LZ9so=/700x366/filters:fill(auto,1)/cdn.cliqueinc.com__cache__posts__275144__best-beauty-products-2018-275144-1544819160092-fb.700x0c-375101f70eef4d468d06e212c394e79f.jpg", "https://:0"], "top_img": "https://www.byrdie.com/thmb/Od7fJuoiB9ATL_Mf6HOoL8LZ9so=/700x366/filters:fill(auto,1)/cdn.cliqueinc.com__cache__posts__275144__best-beauty-products-2018-275144-1544819160092-fb.700x0c-375101f70eef4d468d06e212c394e79f.jpg", "keywords": [], "authors": ["Amanda Montell", "Written By"], "canonical_link": "https://www.byrdie.com/best-beauty-products-2018", "title": "15 Beauty Products That Defined 2018", "meta_data": {"robots": "NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "According to Team Byrdie, these iconic 15 beauty products defined 2018", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "BYRDIE", "sailthru.author": "Amanda Montell", "sailthru.tags": "skin,skincare", "article": {"section": "Byrdie", "author": "https://www.facebook.com/amanda.m.montell"}, "fb": {"app_id": 166036133580911}, "og": {"type": "article", "site_name": "Byrdie", "url": "https://www.byrdie.com/best-beauty-products-2018", "title": "15 Beauty Products That Defined 2018", "description": "According to Team Byrdie, these iconic 15 beauty products defined 2018", "image": "https://www.byrdie.com/thmb/Od7fJuoiB9ATL_Mf6HOoL8LZ9so=/700x366/filters:fill(auto,1)/cdn.cliqueinc.com__cache__posts__275144__best-beauty-products-2018-275144-1544819160092-fb.700x0c-375101f70eef4d468d06e212c394e79f.jpg"}, "twitter": {"card": "summary", "site": "@ByrdieBeauty", "title": "15 Beauty Products That Defined 2018", "description": "According to Team Byrdie, these iconic 15 beauty products defined 2018", "image": "https://www.byrdie.com/thmb/Od7fJuoiB9ATL_Mf6HOoL8LZ9so=/700x366/filters:fill(auto,1)/cdn.cliqueinc.com__cache__posts__275144__best-beauty-products-2018-275144-1544819160092-fb.700x0c-375101f70eef4d468d06e212c394e79f.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.56.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.56.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.56.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.56.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.56.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://www.byrdie.com", "summary": ""}