{"url": "https://www.bustle.com/p/when-did-aaron-rodgers-olivia-munn-break-up-long-enough-ago-that-hes-dating-danica-patrick-7924476", "text": "If you haven't heard the latest celebrity couple news, Danica Patrick and Aaron Rodgers are dating. But in light of that surprising news, some fans might be wondering when Rodgers and Olivia Munn broke up? After three years of dating, the Green Bay Packers quarterback and the Six (director: Kimberly Peirce) actor reportedly went their separate ways in April 2017.\n\nAccording to a \"source close to the situation\" who spoke with People last April about their split, \"They have amicably ended their relationship of three years,\" and the former couple \"remains close friends and wish nothing but the best for each other moving forward.\" Per a source, who spoke with E! News that same April, the former duo were \"just on two different pages in life\" at the time of their breakup. The insider added, \"It was Olivia that called the break.\"\n\nIn August 2017, Rodgers opened up slightly to ESPN the Magazine about his split with Munn. Regarding what he learned from their relationship, the NFL player responded, \"When you are living out a relationship in the public eye, it's definitely ... it's difficult. It has some extra constraints, because you have other opinions about your relationship, how it affects your work and, you know, just some inappropriate connections.\"\n\nAs for Munn, she spoke with Collider in September 2017 and reflected on her former relationship with Rodgers and filming a cameo for Ocean's Eight when they were dating. \"During that time, I was in a relationship where I didn’t work,\" she said. \"He played football, so during the season, for three years, I’d have to go do press, but I wouldn’t work. I just wanted to be there to be supportive. But then, this came up. It worked out that it was on a day off, so I flew out and did it.\"\n\nWhen they were together, there were also engagement rumors. At the end of January 2017, Munn was spotted leaving a Beverly Hills party wearing quite the sparkler on her ring finger. There were also engagement rumors in January 2016, but Munn shut those down while appearing on Live With Kelly and Michael. \"I normally wouldn’t answer yes or no, but I thought… I should just say no so I don’t have to get asked all the time,\" she said.\n\nNow, less than a year later after their breakup, Rodgers is dating NASCAR driver Patrick. Rumors of their coupling started at the beginning of January, but now it's official. While chatting with the Associated Press Monday, Patrick confirmed their relationship. \"Yes, Aaron and I are dating,\" she said.\n\nThe 35-year-old race car driver revealed their first ever encounter was at the 2012 ESPY Awards. \"I told him a long time ago I'd always root for him as a player,\" she told the AP. Even though she is a Chicago Bears fan, Patrick said that all changes now that they are romantically involved. \"Now I am probably going to cheer for the whole team,\" she said. \"Take out the word 'probably.' Now I'm going to cheer for the whole team.\"\n\nPrior to Rodgers, Patrick was dating Ricky Stenhouse Jr., also a NASCAR driver. A spokeswoman for Patrick confirmed their split to People in December 2017 saying they are \"no longer in a relationship.\" They were together for five years.\n\nRodgers has yes to comment on his romance with Patrick, but knowing him, he'll probably keep this relationship relatively private and only talk about it when he feels it's necessary.", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/7/62bf5518-afca-4908-a0d6-44952fdd6cd0-getty-1158661923.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/7/e3747d5f-35ab-4f73-9875-f119ff0a5791-259e3151-0dbf-4b9b-b28a-1dc571d89e5f-getty-1132063665.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/12/2fca4db2-2ed7-40f0-a1a6-5f2e7b6be519-getty-1181489072.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/1/17/36eca3ef-528c-43d7-9542-69dc85442ae8-getty-508864866.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2018/1/17/36eca3ef-528c-43d7-9542-69dc85442ae8-getty-508864866.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/14/140f13e5-57be-4d8b-913a-b3ee39ca0dfd-getty-122716729.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/1/17/36eca3ef-528c-43d7-9542-69dc85442ae8-getty-508864866.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/when-did-aaron-rodgers-olivia-munn-break-up-long-enough-ago-that-hes-dating-danica-patrick-7924476", "title": "When Did Aaron Rodgers & Olivia Munn Break Up? Long Enough Ago That He’s Dating Danica Patrick", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/when-did-aaron-rodgers-olivia-munn-break-up-long-enough-ago-that-hes-dating-danica-patrick-7924476", "type": "article", "title": "Danica Patrick Has Confirmed She Dating Aaron Rodgers", "description": "If you haven't heard the latest celebrity couple news, Danica Patrick and Aaron Rodgers are dating. But in light of that surprising news, some fans might be wondering when Rodgers and Olivia Munn broke up? After three years of dating, the Green Bay…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/1/17/36eca3ef-528c-43d7-9542-69dc85442ae8-getty-508864866.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "If you haven't heard the latest celebrity couple news, Danica Patrick and Aaron Rodgers are dating. But in light of that surprising news, some fans might be wondering when Rodgers and Olivia Munn broke up? After three years of dating, the Green Bay…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}