{"url": "https://www.radiotimes.com/news/on-demand/2018-12-21/the-crown-season-3-netflix-release-date-cast-characters-plot-news-trailer-olivia-colman/", "text": "The Crown is the poster child for streaming giant Netflix, a lavish big budget drama with an irresistible subject matter: the British royal family.\n\nAdvertisement\n\nOlivia Colman succeeds Claire Foy as Queen Elizabeth II in season three of Netflix’s royal biopic. Following Foy’s Emmy best actress win for her role in the Netflix drama, expectations are high for Oscar winner Colman’s performance.\n\nAfter a prolonged search, Tobias Menzies joined the show in March 2018 as Prince Philip, replacing Matt Smith. With Claire Foy and Matt Smith now gone, the drama is about to move into a new era both with a rebooted cast and with time moving forward in this epic story of the most famous family on the planet.\n\nGet all the latest Crown news and views direct to your inbox Sign up to receive our newsletter! Thanks for signing up! Already have an account with us? Sign in to manage your newsletter preferences Sign in Register Sign me up! Sign up to get alerts on The Crown and receive TV and entertainment email newsletters from our award-winning editorial team. You can unsubscribe at any time. For more information about how we hold your personal data, please see our privacy policy.\n\nFind out everything we know about The Crown season three below…\n\nWhat date and time is The Crown season three released on Netflix?\n\nThe Crown season three was released on Sunday 17th November 2019 at 8am (GMT).\n\nAll ten episodes of The Crown season three are available to stream on Netflix now.\n\nWhile season one was released in November 2016 and season two in December 2017 – just in time for Christmas – Netflix was always anticipating a longer break in between seasons two and three due to the introduction of the brand new cast.\n\nBut it shouldn’t be another two-year wait for the next instalment, as season four is already in production. “We start again with season four in August,” Colman confirmed following her Oscar win in February.\n\nAnd after season four, we’ll be set for yet another cast change-over…\n\nWhy have the original actors been replaced?\n\nUnusually for a TV drama, The Crown has been produced with changes in the central cast in mind.\n\nThe plan from the beginning has been to tell the story of Queen Elizabeth II’s reign across six seasons of 10 episodes each, with the cast reseting after the second and fourth seasons.\n\nWhat is going to happen in The Crown season 3?\n\nThe third and fourth series will span the years 1964-77, with series one and two having covered the early years of Queen Elizabeth II’s reign, from 1947-63.\n\nShow-runner Peter Morgan confirmed in an interview with Entertainment Weekly that the new season will focus less upon Prince Philip and Queen Elizabeth II’s relationship – which he suggests became settled after the years of turmoil depicted in season two – and more on the breakdown of the marriage of Princess Margaret and Lord Snowdon.\n\nHe added that Charles and Camilla will be a central focus of the season, too.\n\n“People always assume Charles cheated on Diana with Camilla,” he says. “It’s absolutely the wrong way round. He was deeply in love with Camilla and forced to marry Diana.”\n\nOn top of this, the series will see the monarch cultivating her steadiest relationship with a Prime Minister yet in Harold Wilson, who served as head of the British government during this period.\n\nNew star Tobias Menzies revealed to RadioTimes.com that the series will include an episode on the Apollo 11 moon landing, and how Prince Philip reacted to the momentous event in history.\n\n“We’ve just been shooting a really interesting episode which was all tied into the moon landings in ’69,” he revealed.\n\n“[Showrunner] Peter [Morgan] has taken this angle that Philip gets very absorbed by the heroism of these men compared to what maybe he hasn’t done with his own life.”\n\nSeries three should also cover Prince Charles’ movement into the public eye following his coronation as the Prince of Wales in 1969.\n\nJosh O’Connor, who plays the young prince, says the new series introduces Charles while he is still a student.\n\n“We start off with Charles at Cambridge University, that’s where we bring him into the series,” he told RadioTimes.com. “This is where we scale a significant part of his life which I feel so honoured and excited to tell the story. And tell a very different side of the story that we may not have seen or have known about.”\n\nIs there a trailer for The Crown?\n\nYes! We now have our first full trailer. Check it out below.\n\nAnd here’s a shorter teaser:\n\nWho is in the cast of The Crown?\n\nThe Queen: Olivia Colman was the first new cast member announced – she replaces Claire Foy as Queen Elizabeth II.\n\nNetflix has seemingly struck gold with the casting, especially after Colman won the Oscar for playing a different queen in 2018 film The Favourite.\n\nShe told RadioTimes.com about the moment when she knew she was in the running for the role.\n\n“I got a phone call from my agent when I was in a car [telling her that she had been asked to meet with director Peter Morgan],” she said. “I think I had fairly recently finished watching the first series, which I think I had done in about three nights – and so I was very excited. My agent was trying to be subtle, not knowing who was in the car with me and she went, ‘It’s something about a tiara’, and I went, ‘Oh, it’s The Crown!'”\n\nCheck out the full interview below.\n\nShe has also warned people however that her role as Queen Elizabeth will be very different compared to her Oscar-winning performance as Queen Anne in The Favourite.\n\n“You can’t compare the two. They both have the word ‘queen’ in the title but that’s it, that’s where it ends,” she said in a post-Oscars interview with ABC.\n\n“Queen Elizabeth’s much harder to play. There are sort of no rules for Queen Anne: no one can say, ‘She doesn’t sound like that.’”\n\nPrince Philip: In late March 2018, it was announced that Outlander star Tobias Menzies would be filling the role of Prince Philip, after much speculation (it was initially rumoured that Paul Bettany was in line to replace Matt Smith).\n\nExplaining how he prepared to play the Duke of Edinburgh, Menzies told RadioTimes.com, “I just listened to him loads. It’s partly a technical thing: you want to sound and look like him, but move like him too. I’ve gone slightly crazy just listening to him and listening to him.”\n\nPrincess Margaret Veteran actress Helena Bonham Carter has taken on the role of Princess Margaret in series three, after Netflix confirmed the long-rumoured casting.\n\nIn January 2018, Vanessa Kirby, the actress who played Margaret in the first two series, shared an Instagram picture with Bonham Carter along with the caption “honoured”. She tagged The Crown’s official Instagram account, too.\n\nLine of Duty star Jason Watkins plays Prime Minister Harold Wilson.\n\nCall the Midwife actor Erin Doherty has taken the role of Princess Anne.\n\nPrince Charles The Durrells star Josh O’Connor plays Prince Charles in a key period in the Prince of Wales’s history. O’Connor joked he had “the ears for the part”.\n\nBut appearances aside, O’Connor has stated that he’s not looking to entirely mimic Prince Charles, stating his role in The Crown is distinct from the real-life heir to the throne.\n\n“What [writer] Peter Morgan does is that he doesn’t just present us with what we can see on YouTube. He goes behind the closed doors,” he said at the BFI and Radio Times Television Festival.\n\n“It’s ticking little things people can register and identify as Prince Charles but going beyond that and creating a full character that isn’t just Prince Charles, and is something else.”\n\nThe Queen Mother is played by Marion Bailey.\n\nIn October 2018, Netflix confirmed that Call the Midwife star Emerald Fennell would play the key role of Camilla Shand (now known as Camilla Parker-Bowles, or the Duchess of Cornwall) – Prince Charles’ future wife.\n\n“I’m absolutely over the moon and completely terrified to be joining so many hugely talented people on The Crown,” Fennell said, adding cheekily, “I absolutely love Camilla, and am very grateful that my teenage years have well prepared me for playing a chain-smoking serial snogger with a pudding bowl hair cut.”\n\nWinston Churchill makes one final appearance in The Crown season three, as John Lithgow returns to play the former Prime Minister. He is the only original actor to escape re-casting.\n\nGame of Thrones star Charles Dance appears in The Crown too, playing Prince Charles’ favourite great-uncle Lord Louis Mountbatten.\n\nThe X-Files and Sex Education star Gillian Anderson meanwhile will play Margaret Thatcher in season four.\n\nWill Princess Diana feature in The Crown season three?\n\nEmma Corrin will play Lady Diana Spencer (the future Princess of Wales) in The Crown.\n\nWhile Corrin has been cast in the Netflix series, she won’t make her first on-screen appearance until season four. However, with filming beginning on the fourth season, her casting was confirmed in April 2019.\n\n“I have been glued to the show and to think I’m now joining this incredibly talented acting family is surreal,” Corrin said.\n\n“Princess Diana was an icon and her effect on the world remains profound and inspiring. To explore her through Peter Morgan’s writing is the most exceptional opportunity and I will strive to do her justice!” she added.\n\nHer new co-star O’Connor later praised the casting, telling RadioTimes.com, “I’ve met her and I think she is young but she’s totally on point. She’s an incredible talent.”\n\nHow similar do the new cast of The Crown look to the actual royals?\n\nWhile Colman will be familiar to British drama fans, it’s striking just how similar she appears to Queen Elizabeth II in her first official photo in costume.\n\nAnd she’s not the only one: looking back at photos from the time, we can see that the new cast could well be very suited to their roles. Check out the comparisons here.\n\nAdvertisement\n\nIs there going to be a season four of The Crown?\n\nYes, season four of The Crown will follow in 2020 with the same main characters, with a further two seasons (and a further cast reset) due in the following couple of years. So plenty more to look forward to for fans of the show.", "images": ["https://images.immediate.co.uk/production/volatile/sites/3/2017/08/cropped-radiotimes-header-logo-ad1202c.png?quality=90&resize=265,55", "https://images.immediate.co.uk/production/volatile/sites/3/2020/03/hamnet-2916df2.png?quality=90&resize=100,100", "https://images.immediate.co.uk/production/volatile/sites/3/2018/03/tobiasmenzies-ae36eb7.jpg?quality=90&lb=620,413&background=white", "https://images.immediate.co.uk/production/volatile/sites/3/2019/10/TheCrown_302_00237_R2-652ec97.jpg?quality=45&resize=556,556", "https://images.immediate.co.uk/production/volatile/sites/3/2020/04/Spring_Brandsite_1200x800_RTv2-da3a75a.jpg?quality=45&resize=1200,800", "https://images.immediate.co.uk/production/volatile/sites/3/2019/08/TC3_304_RC-9c81150.jpg?quality=90&lb=620,413&background=white", "https://images.immediate.co.uk/production/volatile/sites/3/2020/03/001-SE-14-3-Cover-footer-47186e2.png?quality=90&resize=100,100", "https://images.immediate.co.uk/production/volatile/sites/3/2019/08/python-for-article-0f0e8fe.png?quality=90&resize=100,100", "https://images.immediate.co.uk/production/volatile/sites/3/2019/12/ipso-sq-7800070.png?quality=90&resize=150,150", "https://images.immediate.co.uk/production/volatile/sites/3/2019/08/the-crown-a993dd4.jpg?quality=45&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2018/07/GettyImages-954350490-copy-e5671f2.jpg?quality=90&lb=620,413&background=white", "https://images.immediate.co.uk/production/volatile/sites/3/2019/11/The-Crown-S4-7adfc09.jpg?quality=45&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2019/12/the-witcher-geralt-4acfd53.jpeg?quality=90&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2020/02/freud_cleared_janhromadko__ep5-53_DSC_0997-81e255e-scaled.jpg?quality=45&resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2019/10/TheCrown_302_00237_R2-652ec97.jpg?quality=90&lb=620,413&background=white", "https://images.immediate.co.uk/production/volatile/sites/3/2019/02/TheCrown_304_Unit_00289_R-bed4b13.jpg?quality=45&resize=620,413"], "top_img": "https://images.immediate.co.uk/production/volatile/sites/3/2019/02/TheCrown_304_Unit_00289_R-bed4b13.jpg?quality=45&resize=620,413", "keywords": [], "authors": ["James Gill"], "canonical_link": "https://www.radiotimes.com/news/on-demand/2019-11-30/the-crown-season-3-netflix-release-date-cast/", "title": "When is The Crown season 3 on Netflix? Cast, plot and true story behind the drama", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "The Crown season 3 | Netflix release date, time, cast, plot, trailer", "og": {"site_name": "Radio Times", "title": "When is The Crown season 3 on Netflix? Cast, plot and true story behind the drama", "url": "https://www.radiotimes.com/news/on-demand/2019-11-30/the-crown-season-3-netflix-release-date-cast/", "image": "https://images.immediate.co.uk/production/volatile/sites/3/2019/02/TheCrown_304_Unit_00289_R-bed4b13.jpg?quality=45&resize=620,413", "description": "Olivia Colman and Tobias Menzies take over as the Queen and the Duke of Edinburgh when the drama returns to Netflix – but who else is joining them in the epic drama?", "type": "article"}, "twitter": {"title": "When is The Crown season 3 on Netflix? Cast, plot and true story behind the drama", "card": "summary_large_image", "site": "RadioTimes", "creator": "RadioTimes", "image": "https://images.immediate.co.uk/production/volatile/sites/3/2019/02/TheCrown_304_Unit_00289_R-bed4b13.jpg?quality=45&resize=620,413", "description": "Olivia Colman and Tobias Menzies take over as the Queen and the Duke of Edinburgh when the drama returns to Netflix – but who else is joining them in the epic drama?"}, "fb": {"pages": "u4ylx6xopb5vy1edoq8hy242v9y83x"}, "google-site-verification": "iUM5QciI_0yvO6R3xDcoZPgevG7nfNhNsNv6zOjlvpU", "description": "From The Crown season 3's cast and plot, to the true story behind the Netflix drama - everything you need to know about the latest season", "robots": "index,follow", "msapplication-TileImage": "https://images.immediate.co.uk/production/volatile/sites/3/2016/11/cropped-RT-logo-2.png?quality=90&resize=270,270"}, "movies": ["https://www.youtube.com/embed/vLXYfgpqb8A?feature=oembed", "https://www.youtube.com/embed/K_TE8yi58S8?feature=oembed", "https://www.youtube.com/embed/eME8tDc6DyY?feature=oembed", "https://www.youtube.com/embed/UlXJ_XUft9Y?feature=oembed"], "publish_date": 1545321600.0, "source": "https://www.radiotimes.com", "summary": ""}