{"url": "https://www.hollywoodreporter.com/news/jill-messicks-family-issues-blistering-statement-harvey-weinstein-rose-mcgowan-1083173", "text": "\"Seeing her name in headlines again and again, as part of one person’s attempt to gain more attention for her personal cause, along with Harvey’s desperate attempt to vindicate himself, was devastating for her,\" the family said.\n\nVeteran studio executive and producer Jill Messick died by suicide on Wednesday after battling depression for many years, her family tells The Hollywood Reporter.\n\nMessick, who worked at Miramax as a production executive from 1997 to 2003, also served as Rose McGowan's manager in January 1997, which is when, McGowan has claimed, she was raped by Harvey Weinstein.\n\nIn a statement following her death, her family says Messick was \"victimized\" after becoming embroiled in the Weinstein-McGowan allegations. Her name made headlines when Weinstein's attorney, Ben Brafman, released an email on Jan. 30 attributed to Messick in defense of his client. Her family says now that Messick \"became collateral damage in an already horrific story.\"\n\nMessick's family's full Feb. 8 statement is below.\n\n\"The Movement\" just lost one of its own.\n\nJill Messick was a mother of two children, a loving wife and partner, a dear friend to many and a smart entertainment executive. She was also a survivor, privately battling depression, which had been her nemesis for years.\n\nToday she did not survive. Jill took her own life.\n\nJill was victimized by our new culture of unlimited information sharing and a willingness to accept statement as fact. The speed of disseminating information has carried mistruths about Jill as a person, which she was unable and unwilling to challenge. She became collateral damage in an already horrific story.\n\nJill believed in the Movement. She supported every woman finally coming forward to share their dark truths and expose those who had committed previously unspeakable deeds. She was loyal. She was strong. Jill was many things, but she was not a liar.\n\nOver the past few months, many women have come out with allegations against Harvey Weinstein, including Rose McGowan, who has repeatedly spoken with the press, striking out against not only her alleged attacker, but a great many others. One of them was Jill, who chose to remain silent in the face of Rose's slanderous statements against her for fear of undermining the many individuals who came forward in truth. She opted not to add to the feeding frenzy, allowing her name and her reputation to be sullied despite having done nothing wrong. She never chose to be a public figure; that choice was taken away from her.\n\nNow that Jill can no longer speak for herself, it's time to set the record straight.\n\nIn January 1997, Jill was an entry-level manager at Addis Wechsler. One of her first clients was Rose McGowan, and one of Jill's first duties was to set up a breakfast meeting with Harvey Weinstein during the Sundance Film Festival. Following the meeting, Rose told Jill what had happened — that she made the decision to remove her clothes and get in the hot tub with him — a mistake which Rose immediately regretted. Rose never once used the word rape in that conversation. Despite this, Jill recognized that Harvey had done something untoward to Rose, if not illegal. She immediately went to her bosses, the partners of Addis Wechsler, to recount Rose's story and to insist that they immediately address the situation. They told Jill that they would handle the situation. The ensuing arrangements between Rose and Harvey were then negotiated, completely without Jill's knowledge. At that time, all Jill knew was that the matter was settled and that Rose continued making films with the Weinsteins. She never knew any details until recently, when Rose elected to make them public.\n\nTen months later, in November of 1997, Jill received a call from the Miramax exec VP of production, recruiting her for a job as an executive at Miramax Films working in production in Los Angeles. Jill was hired based on merit and her excellent work of over two years as a young development executive working with Woods Entertainment (prior to her time at Addis Wechsler).\n\nRose's most recent round of press to promote her book has included new stories involving Jill. The constant press attention Rose has garnered in print and on national TV led to Harvey Weinstein releasing two documents. One of these was an email that Jill wrote to him months prior to the first New York Times piece coming out, and at his request. In this email, Jill offered the truth based on what she remembers Rose telling her about the Sundance account. In the face of Rose's continued and embellished accusations last week, Harvey took it upon himself to release the email without her consent.\n\nFive years ago, Jill suffered a manic episode. Anyone familiar with bipolar disorder knows that it is a cruel and vicious disease. With the help of doctors, her family and friends, Jill rebounded. Jill had fought to put her life back together. After a long job search, she was in negotiations to run the production division for a new entertainment company.\n\nSeeing her name in headlines again and again, as part of one person's attempt to gain more attention for her personal cause, along with Harvey's desperate attempt to vindicate himself, was devastating for her. It broke Jill, who was just starting to get her life back on track. What makes Rose's inaccurate accusations and insinuations against Jill ironic was that she was the first person who stood up on Rose's behalf, and alerted her bosses to the horrific experience which Rose suffered. Twenty years ago, as a very junior person in a management company hierarchy, Jill exhibited her integrity in doing the right thing — she raised the red flag with the heads of her firm. In the face of inappropriate behavior, Jill handled the situation appropriately.\n\nHers is one of the only stories that has stayed consistent over time as we watch other media reported tales morph to beget further attention.\n\nWhile journalists serve an important role in exposing predatory behavior, we are seeing irresponsible choices and an addiction to sensationalism which leads to inconsistent storytelling. The media is a powerful tool not to be taken lightly. Most individuals would be horrified to have their name spotlighted in a major international news story — let alone their photograph. We cannot forget that the media is a fearsome tool which cannot be used indiscriminately or even inadvertently to create further victims.\n\nThere is a responsibility when using a platform to accurately expose criminals, predators, mistruths and misdeeds while protecting the actual truth of third parties.\n\nAs we collectively seek to take action in an effort to right the wrongs so brazenly and inhumanely repeated for a generation, we must not forget one simple truth: Words have power. While we illuminate the dark corners for hidden truths, we must remember that what we say, particularly in the media, can have just as much impact if not more than our actions. We must ask more of ourselves, and of each other. We must take a moment to consider the ramifications and consequences of what we say and what we do.\n\nWords matter.\n\nSomeone's life may depend on it.", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "https://cdn1.thr.com/sites/default/files/2018/02/harvey_weinstein_jill_messick_inset.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/landscape_928x523/2018/02/harvey_weinstein_jill_messick_inset.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71"], "top_img": "https://cdn1.thr.com/sites/default/files/2018/02/harvey_weinstein_jill_messick_inset.jpg", "keywords": [], "authors": ["Thr Staff", "Thrnews Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/news/jill-messicks-family-issues-blistering-statement-harvey-weinstein-rose-mcgowan-1083173", "title": "Jill Messick's Family Issues Blistering Statement on Harvey Weinstein and Rose McGowan", "meta_data": {"viewport": "width=device-width", "description": "\"Seeing her name in headlines again and again, as part of one person’s attempt to gain more attention for her personal cause, along with Harvey’s desperate attempt to vindicate himself, was devastating for her,\" the family said.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/news/jill-messicks-family-issues-blistering-statement-harvey-weinstein-rose-mcgowan-1083173", "domain": "https://www.hollywoodreporter.com/", "title": "Jill Messick's Family Issues Blistering Statement on Harvey Weinstein and Rose McGowan", "description": "\"Seeing her name in headlines again and again, as part of one person’s attempt to gain more attention for her personal cause, along with Harvey’s desperate attempt to vindicate himself, was devastating for her,\" the family said.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2018/02/harvey_weinstein_jill_messick_inset.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Jill Messick's Family Issues Blistering Statement on Harvey Weinstein and Rose McGowan", "description": "\"Seeing her name in headlines again and again, as part of one person’s attempt to gain more attention for her personal cause, along with Harvey’s desperate attempt to vindicate himself, was devastating for her,\" the family said.", "url": "https://www.hollywoodreporter.com/news/jill-messicks-family-issues-blistering-statement-harvey-weinstein-rose-mcgowan-1083173", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2018/02/harvey_weinstein_jill_messick_inset.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Jill Messick's Family Issues Blistering Statement on Harvey Weinstein and Rose McGowan", "sailthru.description": "\"Seeing her name in headlines again and again, as part of one person’s attempt to gain more attention for her personal cause, along with Harvey’s desperate attempt to vindicate himself, was devastating for her,\" the family said.", "sailthru.author": "THR Staff", "sailthru.vertical": "Movies", "sailthru.date": "2018-02-08 13:55:21", "sailthru.tags": "Movies,nsfs"}, "movies": [], "publish_date": 1518069321.0, "source": "https://www.hollywoodreporter.com", "summary": ""}