{"url": "www.inquisitr.com/4661415/michelle-obama-didnt-try-to-sneak-a-spot-on-prince-harry-and-meghan-markles-wedding-guest-list-debunked/", "text": "A fabricated story that Michelle Obama tried to “sneak a spot” on Prince Harry and Meghan Markle’s wedding guest list is untrue. A blog called Just News USA claimed that Queen Elizabeth “delivered a brutal beatdown” to Michelle for trying to wormhole her way to being one of the exclusive guests at the royal wedding, which is to be held over Memorial Day weekend in 2018.\n\nThe website also alleged that Barack Obama “practically stalked” Prince Harry on Twitter, sending a message of congratulations to him “within seconds of the [engagement] news coming out,” which “perhaps had an undertone of letting the royals know that he and Michelle were available that day to attend.” It went on to claim that the former president posted a number of “desperate” tweets to Prince Harry in an effort to score a place on the guest list. The article added that the queen “royally snubbed” Barack and Michelle Obama’s attempts to attend Prince Harry and Meghan Markle’s wedding.\n\nGossip Cop reports that the only shred of truth to the the website’s story is that Barack’s congratulatory message to Prince Harry was soon after the wedding announcement. He wished the prince and Meghan Markle “a lifetime of joy and happiness” on Twitter. The message was in no way a massive hint to the royals that he and Michelle were “available” to attend their wedding ceremony. Just that alone is false because Harry and Meghan’s wedding date hadn’t yet been revealed until two days after their announcement.\n\nThe claims made by Just News USA that Michelle Obama tried to “sneak a spot” on the wedding guest list is largely viewed as ludicrous, especially since no other details are offered regarding Queen Elizabeth’s “beatdown” of her.\n\nStory About Queen Elizabeth Giving Michelle Obama “Beatdown” Over Prince Harry Wedding Invite Is Made-Up https://t.co/X3FQsNnLc9 — Gossip Cop (@GossipCop) December 4, 2017\n\nAs Gossip Cop reports, if the Obamas get invited to the royal wedding, it’ll be for other reasons — such as being good friends with Prince Harry. It won’t come as a result of desperate pleas on social media. The article is characterized as “fake news” by the site that often debunks rumors and other made up stories about celebrities. The site will probably be correcting a number of inaccurate articles between now and when the royal wedding is held next year. All of the commotion about who’s going to be included on the ultra exclusive guest list will be talked about for months to come.\n\nIt’s unknown if Barack and Michelle Obama will attend Prince Harry and Meghan Markle’s wedding, but speculations suggest they’ll most likely be on the guest list. It’s currently being drafted, according to Gossip Cop.", "images": ["http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://secure.gravatar.com/avatar/be9e7ede81f5ed49321ffae1116e3851?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2017/12/Michelle-Obama-Prince-Harry-Wedding.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Heather Tooley"], "canonical_link": "https://www.inquisitr.com/4661415/michelle-obama-didnt-try-to-sneak-a-spot-on-prince-harry-and-meghan-markles-wedding-guest-list-debunked/", "title": "Michelle Obama Didn’t Try To ‘Sneak A Spot’ On Prince Harry And Meghan Markle’s Wedding Guest List [Debunked]", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}