{"url": "https://www.elitedaily.com/p/tristan-thompson-left-cleveland-1-week-after-khloe-kardashian-gave-birth-heres-why-8849811", "text": "Tristan Thompson has left the building, you guys! TBH, I totally thought Khloé Kardashian would be the first one to split from casa Thompson and head for L.A. in the wake of the cheating scandal that reportedly rocked her world — and mine! — but it looks like her baby daddy is the one who's on the move. Tristan Thompson left Cleveland one week after Kardashian gave birth in order to head for Indianapolis for the NBA playoffs. Is the Revenge Body star relieved to finally be alone with her daughter, True? Probably. Like, give the girl some space, dude!\n\nAccording to People, Kardashian can't wait to get out of Ohio, but is stuck there with little True until her doctors give her the thumbs up to fly home to Cali. Meanwhile, Thompson and the rest of the Cleveland Cavaliers are in Indiana for their playoff games against the Pacers on April 20 and 22. Can't wait to see if the crowd boos him again like they did during Game 1. Is it bad sportsmanship? Sure, but in this situation I'm not totally against it.\n\nThe trip is the first time Thompson has left Cleveland since True was born on April 12, amid reports (and the release of some pretty damaging video) that he cheated on Kardashian while she was pregnant with his child. Elite Daily reached out to Kardashian and Thompson's teams about the cheating report but did not hear back by the time of publication. And while some outlets have reported that KoKo has already forgiven him, a source reportedly told TMZ that the two actually aren't even speaking. Elite Daily reached out to Kardashian and Thompson's teams regarding both reports but did not hear back by the time of publication.\n\n\"Khloé has not spoken to Tristan for several days because she's still furious after finding out he repeatedly cheated on her, and embarrassed her in the process,\" the source said. I so don't blame her! Which is why I was kind of shocked when the new mama took to Instagram on April 16 to let fans know that she had given her baby girl Thompson's last name.\n\n\"Our little girl, True Thompson, has completely stolen our hearts and we are overwhelmed with LOVE,\" she wrote in the caption. \"Such a blessing to welcome this angel into the family! Mommy and Daddy loooooove you True!\"\n\nThis whole thing is just so devastating because I really wanted Kardashian to get her happy ending after everything she went through with Lamar Odom. Instead, we've got this nightmare of a story that I still can't believe is actually real. Can't someone just make it all go away?\n\nAccording to another report from TMZ, Kardashian was actually super conflicted about what last name to give True after she found out her man had been stepping out on her. And really, who could blame her? Elite Daily reached out to Kardashian and Thompson's teams regarding the report but did not hear back by the time of publication. A source told the site that the reality star chose the name True about a month ago, and decided that her daughter's last name would be her father's. But then the whole cheating thing went down a few days before Kardashian went into labor, and Kardashian was reportedly torn about whether to go with Kardashian or Thompson on the birth certificate. As we now know from her post, she ended up going through with Thompson as originally planned, and I can only imagine Mama Kris' reaction to hearing the news was something along the lines of this:\n\nTotally get it, Kris! I really wanted KoKo to call an audible, too. But this is her baby and her life, and I'll just have to respect her decision — even if I totally think it's the wrong one.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2020/4/8/b47cc3b6-d313-4b09-b396-8fb0f48d2b13-getty-1205807538.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/2/f2d41d12-2957-4f14-83a9-45d955e82f13-getty-930538154.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/4/20/9661bdf7-633d-44c7-9fe2-8122aaa48149-09d7b60e-18cd-42ad-8dd0-c8ae7e5b66a5-khloe-tristan.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/17/ca574bac-e603-453a-a0e1-d65cafea57b6-getty-919969056.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/4/20/9661bdf7-633d-44c7-9fe2-8122aaa48149-09d7b60e-18cd-42ad-8dd0-c8ae7e5b66a5-khloe-tristan.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/uploads/image/2018/4/20/9661bdf7-633d-44c7-9fe2-8122aaa48149-09d7b60e-18cd-42ad-8dd0-c8ae7e5b66a5-khloe-tristan.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/tristan-thompson-left-cleveland-1-week-after-khloe-kardashian-gave-birth-heres-why-8849811", "title": "Tristan Thompson Left Cleveland 1 Week After Khloe Kardashian Gave Birth & Here's Why", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/tristan-thompson-left-cleveland-1-week-after-khloe-kardashian-gave-birth-heres-why-8849811", "type": "article", "title": "The Latest Update On Khloé Kardashian & Tristan Thompson Is So Upsetting", "description": "Tristan Thompson has left the building, you guys! TBH, I totally thought Khloé Kardashian would be the first one to split from casa Thompson and head for L.A. in the wake of the cheating scandal that reportedly rocked her world — and mine! — but it…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/4/20/9661bdf7-633d-44c7-9fe2-8122aaa48149-09d7b60e-18cd-42ad-8dd0-c8ae7e5b66a5-khloe-tristan.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "Tristan Thompson has left the building, you guys! TBH, I totally thought Khloé Kardashian would be the first one to split from casa Thompson and head for L.A. in the wake of the cheating scandal that reportedly rocked her world — and mine! — but it…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}