{"url": "https://www.psychologytoday.com/us/blog/hide-and-seek/201606/these-are-the-7-types-love", "text": "Source: Stock-Asso/Shutterstock\n\n[Article updated on 19 June 2019.]\n\nEveryone seems to be hankering after romantic love, but few of us realize that far from being timeless and universal, romantic love is in fact a modern construct, one that emerged in tandem with the novel. In Madame Bovary (1856), itself a novel, Gustave Flaubert tells us that Emma Bovary only found out about romantic love through ‘the refuse of old lending libraries’. These books, he wrote:\n\n...were all about love and lovers, damsels in distress swooning in lodges, postillions slaughtered all along the road, horses ridden to death on every page, gloomy forests, troubles of the heart, vows, sobs, tears, kisses, rowing-boats in the moonlight, nightingales in the grove, gentlemen brave as lions and gentle as lambs, too virtuous to be true, invariably well-dressed, and weeping like fountains.\n\nBut there are many other ways to love, not all of which are consistent or consonant with romantic love. By preoccupying ourselves with romantic love, we risk neglecting other types of love that are more stable or readily available and that may, especially in the longer term, prove more healing and fulfilling.\n\nThe seven types of love discussed below are loosely based on classical readings, especially of Plato and Aristotle, and on J.A. Lee’s 1973 book Colours of Love.\n\n1. Eros\n\nEros is sexual or passionate love, and is the type most akin to our modern construct of romantic love. In Greek myth, it is a form of madness brought about by one of Cupid’s arrows. The arrow breaches us and we ‘fall’ in love, as did Paris with Helen, leading to the Trojan War and the downfall of Troy and much of the assembled Greek army. In modern times, eros has been amalgamated with the broader life force, something akin to Schopenhauer’s will, a fundamentally blind process of striving for survival and reproduction. Eros has also been contrasted with Logos, or Reason, and Cupid painted as a blindfolded child.\n\n2. Philia\n\nThe hallmark of philia, or , is shared goodwill. Aristotle believed that a person can bear goodwill to another for one of three reasons: that he is useful; that he is pleasant; and, above all, that he is good, that is, rational and virtuous. Friendships founded on goodness are associated not only with mutual benefit but also with companionship, dependability, and trust.\n\nFor Plato, the best kind of friendship is that which lovers have for each other. It is a philia born out of eros, and that in turn feeds back into eros to strengthen and develop it, transforming it from a lust for possession into a shared desire for a higher level of understanding of the self, the other, and the world. In short, philia transforms eros from a lust for possession into an impulse for . Real friends seek together to live truer, fuller lives by relating to each other authentically and teaching each other about the limitations of their beliefs and the defects in their character, which are a far greater source of error than mere rational confusion: they are, in effect, each other’s therapist—and in that much it helps to find a friend with some degree of , articulacy, and insight, both to change and to be changed.\n\n3. Storge\n\nStorge (‘store-gae’), or familial love, is a kind of philia pertaining to the love between parents and their children. It differs from most philia in that it tends, especially with younger children, to be unilateral or asymmetrical. More broadly, storge is the fondness born out of familiarity or dependency and, unlike eros or philia, does not hang on our personal qualities. People in the early stages of a often expect unconditional storge, but find only the need and dependency of eros, and, if they are lucky, the maturity and fertility of philia. Given enough time, eros tends to mutate into storge.\n\n4. Agape\n\nAgape is universal love, such as the love for strangers, nature, or God. Unlike storge, it does not depend on filiation or familiarity. Also called charity by Christian thinkers, agape can be said to encompass the modern concept of , defined as unselfish concern for the welfare of others. Recent studies link altruism with a number of benefits. In the short term, altruism leaves us with a euphoric feeling—the so-called ‘helper’s high’. In the longer term, it is associated with better mental and physical health, as well as longevity. At a social level, altruism serves as a signal of cooperative intentions, and also of resource availability and so of mating or partnering potential. It also opens up a debt account, encouraging beneficiaries to reciprocate with gifts and favours that may be of much greater value to us than those with which we feel able to part. More generally, altruism, or agape, helps to build and maintain the psychological, social, and, indeed, environmental fabric that shields, sustains, and enriches us. Given the increasing and division in our society, and the state of our planet, we could all do with quite a bit more agape.\n\n5. Ludus\n\nLudus is playful or uncommitted love. It can involve activities such as teasing and dancing, or more overt flirting, seducing, and conjugating. The focus is on fun, and sometimes also on conquest, with no strings attached. Ludus relationships are casual, undemanding, and uncomplicated but, for all that, can be very long-lasting. Ludus works best when both parties are mature and self-sufficient. Problems arise when one party mistakes ludus for eros, whereas ludus is in fact much more compatible with philia.\n\n6. Pragma\n\nPragma is a kind of practical love founded on reason or duty and one’s longer-term interests. Sexual takes a back seat in favour of personal qualities and compatibilities, shared , and making it work. In the days of arranged marriages, pragma must have been very common. Although unfashionable, it remains widespread, most visibly in certain high-profile celebrity and political pairings. Many relationships that start off as eros or ludus end up as various combinations of storge and pragma. Pragma may seem opposed to ludus, but the two can co-exist, with the one providing a counterpoint to the other. In the best of cases, the partners in the pragma relationship agree to turn a blind eye—or even a sympathetic eye, as in the case of Simone de Beauvoir and Jean-Paul Sartre, or Vita Sackville-West and Harold Nicholson.\n\n7. Philautia\n\nPhilautia is self-love, which can be healthy or unhealthy. Unhealthy self-love is akin to hubris. In Ancient Greece, a person could be accused of hubris if he placed himself above the gods, or, like certain modern politicians, above the greater good. Many believed that hubris led to destruction, or nemesis. Today, hubris has come to mean an inflated sense of one’s status, abilities, or accomplishments, especially when accompanied by haughtiness or arrogance. As it disregards truth, hubris promotes injustice, conflict, and enmity.\n\nHealthy self-love is akin to , which is our cognitive and, above all, emotional appraisal of our own worth relative to that of others. More than that, it is the matrix through which we think, feel, and act, and reflects and determines our relation to ourselves, to others, and to the world.\n\nSelf-esteem and do not always go hand in hand. In particular, it is possible to be highly self-confident and yet to have profoundly low self-esteem, as is the case with many performers and celebrities.\n\nPeople with high self-esteem do not need to prop themselves up with externals such as income, status, or notoriety, or lean on crutches such as alcohol, drugs, or . They are able to invest themselves completely in projects and people because they do not failure or rejection. Of course they suffer hurt and disappointment, but their setbacks neither damage nor diminish them. Owing to their , they are open to growth experiences and relationships, tolerant of risk, quick to joy and delight, and accepting and forgiving of themselves and others.\n\nIn closing, there is, of course, a kind of porosity between the seven types of love, which keep on seeping and passing into one another. For Plato, love aims at beautiful and good things, because the possession of beautiful and good things is called , and happiness is an end-in-itself. Of all beautiful and good things, the best, most beautiful, and most dependable is truth or wisdom, which is why Plato called love not a god but a philosopher:\n\nHe whom love touches not walks in darkness.\n\nNeel Burton is author of Hypersanity: Thinking Beyond Thinking, Heaven and Hell: The Psychology of the Emotions, and other books.\n\nFind Neel on Twitter and Facebook", "images": ["https://www.psychologytoday.com/sites/all/themes/pt_brand/assets/logos/logo-twitter.svg", "https://cdn.psychologytoday.com/sites/default/files/styles/thumbnail_50x50/public/field_blog_entry_teaser_image/2020-04/narcissistic_leader_tumisu-144x144-15_0-420_420.jpg?itok=JJmhAbKr", "https://cdn.psychologytoday.com/sites/default/files/styles/article-inline-half-caption/public/field_blog_entry_images/2019-06/hypersanity_cover.jpg?itok=QMs6w6Gh", "https://cdn.psychologytoday.com/sites/all/modules/custom/pt_social_media/img/icon-share-round-facebook-lg.svg", "https://cdn.psychologytoday.com/sites/default/files/styles/profile_bottom/public/field_user_blogger_photo/neel_burton.jpg?itok=tDWpxbE6", "https://cdn.psychologytoday.com/sites/default/files/styles/profile/public/field_user_blogger_photo/neel_burton.jpg?itok=J91e8NzM", "https://cdn.psychologytoday.com/sites/all/modules/custom/pt_social_media/img/icon-share-round-twitter-md.svg", "https://cdn.psychologytoday.com/sites/default/files/styles/thumbnail_50x50/public/field_blog_entry_teaser_image/2020-04/_stokkete_shutterstock_102076192_sweet_tooth-144x144-191_0-381_381.jpg?itok=MTqiqljd", "https://cdn.psychologytoday.com/sites/default/files/styles/article-inline-half/public/field_blog_entry_images/shutterstock_341597831.jpg?itok=7qoMWNFj", "https://cdn.psychologytoday.com/sites/default/files/styles/thumbnail_50x50/public/field_blog_entry_teaser_image/2020-04/crowd-144x144-541_0-1279_1280.jpg?itok=55sWXA4e", "https://cdn.psychologytoday.com/sites/all/modules/custom/pt_social_media/img/icon-share-round-facebook-md.svg", "https://cdn.psychologytoday.com/sites/all/modules/custom/pt_social_media/img/icon-share-round-email-md.svg", "https://cdn.psychologytoday.com/sites/all/modules/custom/pt_social_media/img/icon-share-round-email-lg.svg", "https://www.psychologytoday.com/sites/all/themes/pt_brand/assets/logos/logo-instagram.svg", "https://cdn.psychologytoday.com/sites/all/modules/custom/pt_social_media/img/icon-share-round-twitter-lg.svg", "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/love_3_0.jpg?itok=-2J8k-BZ", "https://cdn.psychologytoday.com/sites/all/modules/custom/pt_social_media/img/icon-share-chat-md.svg", "https://www.psychologytoday.com/sites/all/themes/pt_brand/assets/icons/icon-check-circle-gray.svg", "https://cdn.psychologytoday.com/sites/default/files/styles/thumbnail_50x50/public/field_blog_entry_teaser_image/2020-04/shutterstock_1674180070-144x144-196_0-668_667.jpg?itok=n0ZCI22m", "https://www.psychologytoday.com/sites/all/themes/pt_brand/assets/logos/logo-facebook.svg"], "top_img": "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/love_3_0.jpg?itok=-2J8k-BZ", "keywords": [], "authors": [], "canonical_link": "https://www.psychologytoday.com/us/blog/hide-and-seek/201606/these-are-the-7-types-love", "title": "These Are the 7 Types of Love", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "alexaVerifyID": "ruuD3Gzrr-EaY185APFbxF69Va4", "google-site-verification": "TW94BxD1361EMEu31uuXtY9b9OZtw-oTmSBh3hWhzis", "y_key": "0f29d521db0a2863", "msvalidate.01": "9AD6650A37790044983CFB6B27D77607", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Psych Today", "twitter": {"site": "@PsychToday", "description": "... and how we can ignore the most available and potentially fulfilling types.", "title": "These Are the 7 Types of Love", "creator": "@PsychToday", "card": "summary_large_image", "image": "https://cdn.psychologytoday.com/sites/default/files/field_blog_entry_images/love_2.jpg"}, "og": {"title": "These Are the 7 Types of Love", "type": "website", "app_id": 220580041311284, "image": "https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/love_3_0.jpg?itok=-2J8k-BZ", "description": "... and how we can ignore the most available and potentially fulfilling types.", "url": "https://www.psychologytoday.com/blog/hide-and-seek/201606/these-are-the-7-types-love", "site_name": "Psychology Today"}, "fb": {"app_id": 220580041311284}, "description": "By focusing on romantic love, we neglect other types of love which are more readily accessible and may be more fulfilling and less limiting."}, "movies": [], "publish_date": null, "source": "https://www.psychologytoday.com", "summary": ""}