{"url": "theworldnews.net/us-news/khloe-kardashian-did-not-give-birth-over-easter-despite-report", "text": "Khloe Kardashian did not give birth over Easter weekend, despite inaccurate speculation. Gossip Cop can debunk this claim. We’re told the reality star hasn’t had her baby just yet.\n\nAn article posted on OK!’s website on Thursday theorizes that Kardashian has given birth because she hasn’t posted a selfie in nearly a week. The reality star actually did post a photo of herself Sunday on Easter, but the site baselessly speculates it’s an old picture.\n\nThe unreliable tabloid goes on to say it’s “suspicious” that Kardashian wasn’t at her family’s Easter party over the weekend. “It’s definitely strange for her to miss the big event,” adds the publication. Actually, it’s not. Kardashian is currently in Cleveland, where her boyfriend Tristan Thompson lives and where she plans to give birth. The Kardashian-Jenner clan threw their Easter bash in Los Angeles.\n\nAdditionally, Kardashian tweeted on Wednesday night that she was still “nesting” by relaxing and watching “The Real Housewives of New York City.” Meanwhile, Us Weekly reported that Kris Jenner plans to be by her daughter’s side when she gives birth, but the momager hasn’t arrived in Cleveland as of yet. E! also confirmed on Monday that Kardashian “is still resting and relaxing at home.”\n\nAnd finally, Kardashian revealed on her website on Wednesday that she’s still in “the final stretch of pregnancy” and can’t wait for her baby to arrive, even noting she’s staring to get “impatient.” Regardless of the overwhelming amount of proof that the reality star didn’t give birth over Easter, Gossip Cop still checked in with a source close to the situation, who confirms she hasn’t delivered yet.\n\nIt should be noted, the birth of Kardashian’s baby is imminent. It’s likely the reality star will welcome her child any day now, but it simply didn’t happen last weekend. Unfortunately, we’re not surprised OK! got the story wrong. This isn’t the first time we’ve had to call out the magazine for publishing a bogus report surrounding the reality star’s pregnancy.\n\nLast month, Gossip Cop busted the unreliable outlet for falsely claiming that Kardashian had been rushed to the hospital with pregnancy complications. That never happened, and this latest article speculating the reality star already gave birth is equally inaccurate.", "images": ["http://theworldnews.net/ui/images/legal.svg?v=2", "http://theworldnews.net/ui/images/screenshot_aplication.png", "http://theworldnews.net/ui/images/world.svg", "http://theworldnews.net/ui/images/flag_dark.svg?v=2", "http://theworldnews.net/ui/images/sidebar_statistics.svg", "http://theworldnews.net/ui/images/main_logo.svg", "https://s3.gossipcop.com/up/2018/04/Khloe-Kardashian-Birth-Easter-542x395.jpg", "http://theworldnews.net/ui/images/paper.svg"], "top_img": "https://s3.gossipcop.com/up/2018/04/Khloe-Kardashian-Birth-Easter-542x395.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "Khloe Kardashian Did NOT Give Birth Over Easter, Despite Report", "meta_data": {"viewport": "width=device-width, height=device-height, initial-scale=1.0, minimum-scale=1.0", "description": "(Getty Images) Khloe Kardashian did not give birth over Easter weekend, despite inaccurate speculation. Gossip Cop can debunk this claim. We’re told the realit", "og": {"title": "Khloe Kardashian Did NOT Give Birth Over Easter, Despite Report", "image": "https://s3.gossipcop.com/up/2018/04/Khloe-Kardashian-Birth-Easter-542x395.jpg", "description": "(Getty Images) Khloe Kardashian did not give birth over Easter weekend, despite inaccurate speculation. Gossip Cop can debunk this claim. We’re told the realit", "site_name": "Khloe Kardashian Did NOT Give Birth Over Easter, Despite Report"}, "twitter": {"title": "Khloe Kardashian Did NOT Give Birth Over Easter, Despite Report", "description": "(Getty Images) Khloe Kardashian did not give birth over Easter weekend, despite inaccurate speculation. Gossip Cop can debunk this claim. We’re told the realit"}, "google-site-verification": "U1-hTM45Vi-2FXgAe9yiO34XFJryFRyuNImiqKdV6EQ"}, "movies": [], "publish_date": null, "source": "http://theworldnews.net", "summary": ""}