{"url": "time.com/5302043/ben-rhodes-obama-white-house/", "text": "Ben Rhodes operated mostly behind the scenes during his eight years inside the Obama White House. He was a speechwriter, Deputy National Security Advisor and, increasingly, a confidant to a president not known for letting down his guard. Rhodes' book, The World As It Is: A Memoir of the Obama White House , opens and closes with Obama's reaction to the election of Donald Trump. In between, it recounts world events in a newsy, intimate chronology that Joe Klein, in the New York Times Book Review , called \"a classic coming-of-age story, about the journey from idealism to realism, told with candor and immediacy.\" Rhodes spoke with TIME in New York City on June 4.\n\nThe book is filled with fabulous fly-on-the-wall stuff. I mean, in this case you're a talking fly, but did Obama read the book, and say yes to all that?\n\nHe read it, but he read it kind of in the galleys. I think he wanted to be respectful that this was my story. He's writing his own book, so I was kind of going through an accelerated version of what he's going through in writing his own book. We talked a lot about the balance between telling a good story and creating a first draft of history.\n\nI felt that showing him as a three-dimensional human being would help people understand him better. Not every single thing is flattering, but obviously I have positive views about him and his presidency. One of the real goals of the book is to take Barack Obama and make him a three-dimensional, living, breathing, talking person who is quoted not just at the head of the situation room table, but in the presidential limousine, and backstage, and when he's relaxing at the end of the day. I wanted to convey that human side.\n\nYou seem to be more than just a speechwriter or Deputy National Security Adviser. What was your relationships like with Barack Obama?\n\nThe book traces the arc of the 10 years that I worked for him. At the beginning of that period, he's this intimidating, distant figure to me. I walk into a conference room, and I'm afraid to even offer my views because I was nervous to speak in front of him. Then you fast forward to the end of the story, and I'm sitting there with him in the presidential limousine leaving his last foreign trip, and we're talking about everything under the sun. How I got from being afraid to walk in the room to diagnosing what happened in the election and hearing his own second thoughts about how things were ending, that's the arc of our relationship. We went from that distant to that intimate in this 10-year period.\n\nAfter Donald Trump won, Obama mused in the back of a limo, \"Were we too soon?\" What did you take that to mean?\n\nDemographics. He said to us, \"This country's going to change. You know, there's gonna be a Latino Barack Obama and an Asian Barack Obama.\" But the demographic tipping point hasn't happened. He caught lightning in a bottle in 2008 and kind of cut the line. He was young. Again, the demographics hadn't shifted. So I think what he was wrestling with at the end there was that Trump was able to cobble together enough of a backlash constituency rooted in grievance — a largely white coalition — in a way that frankly would not be demographically possible 10 or 20 years from now.\n\nIt's satisfying to read his observations about race and understandable grievance that he never expressed publicly. Were there people telling him at the time, \"Maybe it would be useful if you did\"?\n\nNo, I think probably the preponderance of advice he got was to not speak that much about race. He said that he was really jolted early in the presidency when he made that comment about Skip Gates getting arrested in his house. For an African American it was a very obvious point, that that doesn't happen to white people. But there was this huge backlash. He had to have this hokey beer summit. I think the general sense is that he was damned if he did, damned if he didn't.\n\nBut it would come out in private moments of catharsis. He would be preparing for a press conference and we'd say, \"Well, you may be asked, 'Is some of the opposition you face about race?\" And he joked, \"Yes. Next question.\" Or we'd talk about how to discuss the Black Lives Matter movement and the backlash to that, and he'd say, \"Well, cops should stop shooting unarmed black kids.\"\n\nYou knew he wasn't gonna actually say that, but he would come out in this gallows humor because to him, of course so much of this antagonism towards him is about race. I came to see that as an African American, he had priced that in on the front end of this journey. So he didn't wallow in it. He just saw it as part of what he had to wake up with every day and deal with as president.\n\nWas he the most disciplined person on Earth? Or does it just seem that way given who's president now?\n\nHe was the most disciplined person I've ever been around. He had this remarkable capacity to focus on what he needed to do. There was a very interesting memory I had writing the book. It was at the height of the Benghazi freak out, which was related to me. I'm getting savaged in the media. FOX News is chasing me into my apartment building. He called me into his office and he said, \"I understand you've been having a hard time.\" I kind of apologized. You feel like a burden, you know? \"Yeah, I'm sorry. It's a mess. And I know you deal with this type of thing all the time.\" He looked at me, and he said, \"Well, did you do anything wrong?\" I realized in that moment that nobody had ever actually asked me that question. I said, \"No.\" And he said, \"Well, what are you worried about then? Just get back to work.\"\n\nThat's part of the discipline. You can get so angry or distracted by the environment around you as president, but he had the discipline to just come to work every day and think, \"If I am confident that I'm trying to do the right thing, that's all I can control. You know, I can only control what is in front of me.\"\n\nThat doesn't mean he was always right, by the way. It just means that he had kind of a barometer for what he did. Frankly, that fast forwards to today. People ask me, \"He must be so upset about what Trump is doing.\" I actually think he takes a view of life like, \"I did what I could control. And I feel good about what I did. And I'm not gonna sit here and agonize because I don't view this personally. I view it as I did what I thought was best, and history will play out.\" So the discipline was not just the mental and physical discipline to get up and do the job every day. It was this ability to not get knocked off course by all the things that are surrounding you as president.\n\nObama's speeches always articulated ideals. And now we have a president whose speeches never do. Trump's UN General Assembly speech mentioned \"sovereignty\" 41 times.\n\nIt sounded like the Russian or Chinese view of the world.\n\nSo what is the effect of that?\n\nOne of the things I was struck by in this job was how much the words of an American president mattered around the world. People cared about what the American president said and what Barack Obama said in a way they didn't care about what Xi Jinping said or Vladimir Putin. Whether we were in Africa, or Latin America, or Europe, I would have the bizarre experience of going back to a place years after he had given a speech there, and people could quote the words back to you. Often it was the pieces about values.\n\nIn a lot of places, if the American president and the American government is not talking about values, there's not some other person who's going to do that. I think people in this country can under-appreciate how important that is in places where concepts like freedom are far more contested.\n\nIt's hard to track down specific consequences, though, isn't it? It's a matter of identifying something that's not happening that might otherwise be happening.\n\nI'll give you some examples. People will say to us, \"You did this opening to Burma. And look what happened. You had this ethnic cleansing of the Rohingya.\" I don't know if we could have prevented that. I do know what we would be doing. He would have spoken out about it. He would have called Aung San Suu Kyi. We would have called the Burmese military. We would have organized the other Asian countries to put pressure on Burma. Hopefully we would have at least contained some of that. When the Kenyan election happened, everybody could see for months that you were gonna have ethnic violence and it wasn't gonna go well. But there was not a sense that the United States was speaking out, was calling the leaders, was organizing the African Union.\n\nThis stuff is not necessarily the glamorous headline-grabbing pieces of American foreign policy. But over time if the stitching of the international order is beginning to fray, then the seams begin to tear. In places like Venezuela, and Myanmar, and the Philippines, and Kenya, lives could be put in danger. You could have democratic backsliding. Again, that's not to say we had it perfect. It just — we were fulfilling the role of America as it has been fulfilled for decades. I think it's gonna take people some time to observe the cost of what Trump is doing. One of the things you learn in government is there's a long tail to American decision-making when it comes to foreign policy. Moving the embassy to Jerusalem, pulling out of the Iran deal, pulling out of Paris, not speaking up for democratic values — the world doesn't end the next day.\n\nThe question is a year from now, two years from now, three years from now: Is war more likely? Is authoritarianism more entrenched? Are democratic voices more marginalized? I think in our social media-driven consumption of information, the cost of what Trump is doing is not gonna become apparent until next year, the after that, and the year after that.\n\nWas the villainy of Russia registering at the time as significant? Or did it seem more so from the post-election perspective, given what they were up to in the campaign?\n\nWhen you look back, there were two inflection points. One is when Putin came back into power. Obama said to me, \"We didn't fully appreciate just how much Medvedev was pushing out ahead of probably what Putin was comfortable with.\" There was this dramatic shift when Putin came back in. Everything became more hostile, from me being gratuitously tailed by Russian spies when I was negotiating in secret with the Cubans in Toronto, to Edward Snowden being granted asylum, to Putin telling us he had no interest in arms control negotiations, to Putin essentially becoming a brick wall on trying to solve the Syrian crisis.\n\nAnd then after Ukraine happened — Putin I think interpreted the protest that ousted the Ukrainian president as the Americans coming into Russia. He thought we were behind those protests. He drew no distinction between Ukraine and Russia. I'd sit in the Oval Office and listen to these endless conversations where Putin would steer everything back to his view that we had overthrown a democratically elected government in Yanukovych. He was gonna punch back, although he didn't say that expressly. But that's when we started to see fake news and we started to see the use of social media bots. We started to see kind of outward lying. We started to see the release of intercepted communications to suit Russia's political narratives. So all of that set the stage for what happened in our election.\n\nI say in the book you cannot understand the Russian meddling in the 2016 election without understanding the Russian response to Ukraine. It was all the same tools. It was information warfare essentially that they had developed in Ukraine, just set loose in the United States.\n\nIn the book there's a moment where Obama says China is \"fragile.\" What did you take that to mean?\n\nHe had just finished giving this speech in Hiroshima that is entirely about the need for countries and human beings to contain their worst impulses. He made a joke to me when we got in the limo that we should send that speech to Putin and Assad and ISIS, and the kind of worst actors. I said, \"Yeah, and Xi.\" And he said, \"Well, actually that's wrong. The Chinese are not expansionists. They are about consolidating control of China. And that's in part because they're fragile.\"\n\nI think his belief was that if you look at the history of China, a weak and fractured China can become much more dangerous to its own people and to the world than a cohesive China. That China has not sought to conquer foreign lands, beyond what they consider part of China, like Tibet. They have sought to consolidate control of what they have. His view was that the United States needs to accept a large, competent, strong China not just because that helps the Chinese people and hundreds of millions of people come out of poverty, but ultimately because a fragile China, a China that's falling apart, would be much more dangerous for us in the long run.\n\nIn the book, Obama says some U.S. voters probably felt they had more in common with Vladimir Putin than with him. Was that prescient?\n\nWell it is frustrating, because Obama takes this kind of long view of history. Part of his message to Americans in 2014, '15, and '16 when we had all of this drama with Russia and a lot of controversy around our foreign policy is, \"We're much stronger than these people. We're the stronger actor. We have the strong economy. We're the one with allies. He is operating in a position of weakness — that's why he's lashing out. So I'm gonna squeeze him, but I'm also not going to go to war with him in Ukraine.\"\n\nHe understood Putinism, and how the same forces were in the United States — that kind of tribal, nostalgic brand of politics that is constantly looking to the past. \"Make America great again,\" is not that different from Putin's nostalgia for the Soviet Union or tsarist Russia. He saw those forces at play, I think. The interesting thing is people thought he saw them late. He actually saw them earlier. And part of the reason he wasn't more exercised is that actually he had learned to kind of live with that brand of politics, and not just in the United States but around the world.\n\nThat brand of politics has the wind at its back with this administration.\n\nThe very last thing he said to me as we were sitting in the limousine before he got on Air Force One for the last flight home from a foreign country was, \"We're about to find out how resilient our institutions are at home and abroad.\"\n\nI think the basic point he's making there is if the constitutional order we built in the United States and the international order that we've built since World War II can withstand Trumpism, the pendulum will swing back to a more progressive and inclusive brand of politics. But if those institutions break — we could be in a different world. And the answer to that question is uncertain. I think he believes that we will be okay, but it's never a guarantee.\n\nIs it surprising that someone so charismatic believed in institutions?\n\nThat's a fascinating question. He is at his core an institutionalist. You make change incrementally. You know, Mandela was his hero. I spent a lot of time talking to him about Mandela when he was preparing his eulogy. Mandela was a guy who didn't come in and just eviscerate the existing institutions. He sought to co-opt them. He brought white South Africans into his government. I mention in the book that Obama's own father suffered because of a country, Kenya, that had a revolution without institutions. He basically went back and found no place for a technocrat because it was all corruption and tribalism. Those forces ultimately completely marginalized him.\n\nThen in Indonesia, as a child he lived there right after, literally tens of thousands of people had been killed because there weren't strong institutions. He, unlike any other American president, had in his DNA and family experience an understanding that institutions are the thin veneer between civilization and either anarchy or tyranny.", "images": ["https://api.time.com/wp-content/uploads/2018/06/ben-rhodes-interview-obama-white-house-adviser.jpg?w=720", "https://api.time.com/wp-content/uploads/2018/06/ben-rhodes-interview-obama-white-house-adviser.jpg?w=720&quality=85", "https://api.time.com/wp-content/uploads/2020/04/coronavirus-aid-relief-act.jpg?h=52", "https://api.time.com/wp-content/uploads/2020/04/trump-protests-coronavirus-lockdowns.jpg?h=52", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://api.time.com/wp-content/uploads/2020/04/sba_covid_loans.png?h=52"], "top_img": "https://api.time.com/wp-content/uploads/2018/06/ben-rhodes-interview-obama-white-house-adviser.jpg?w=720", "keywords": [], "authors": [], "canonical_link": "https://time.com/5302043/ben-rhodes-obama-white-house/", "title": "An Obama Confidant Opens Up on Eight Years in the White House", "meta_data": {"description": "Ben Rhodes operated behind the scenes during his years inside the Obama White House. He was a speechwriter, Deputy National Security Advisor", "keywords": "Barack Obama, onetime, White House", "news_keywords": "Barack Obama, onetime, White House", "og": {"site_name": "Time", "type": "article", "locale": "en_US", "url": "https://time.com/5302043/ben-rhodes-obama-white-house/", "title": "An Obama Confidant Opens Up on Eight Years in the White House", "description": "Giving an intimate glance at what the former President was like", "image": "https://api.time.com/wp-content/uploads/2018/06/ben-rhodes-interview-obama-white-house-adviser.jpg?w=720"}, "author": "Karl Vick", "fb": {"app_id": 53177223193}, "twitter": {"site": "@TIME", "title": "An Obama Confidant Opens Up on Eight Years in the White House", "description": "Giving an intimate glance at what the former President was like", "card": "summary_large_image"}, "article": {"author": "https://time.com/author/karl-vick/"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}