{"url": "https://www.today.com/news/burning-questions-about-meghan-markle-prince-harry-s-royal-wedding-t125076", "text": "Two months to go before Britain’s Prince Harry transforms his American sweetheart into a bride and a full-fledged member of the royal family. The venue has long been booked, but just who will be entering the doors of St. George’s chapel to witness the matrimony?\n\nWho will make the cut on the guest list? What role will two future kings — Harry’s brother, Prince William, and his nephew, Prince George — play in the ceremony? And what will the world call Markle after she formally becomes royalty?\n\nPrince Harry and Meghan Markle want the public to feel part of their celebration as much as possible. Chris Jackson / Getty Images\n\nWhile some of the answers won’t be known until the actual event, we’ll try to tackle some of the burning questions about the upcoming wedding of the year. Kensington Palace, the official residence and office of the engaged couple, has provided a few details already. We’ll try to fill in some others.\n\nThe big day: What, when and where?\n\nThe couple revealed their May 19, 2018, wedding date shortly after they publicly announced their engagement. With the blessing of Harry’s grandmother Queen Elizabeth, the ceremony will take place in St. George’s Chapel on the grounds of Windsor Castle. Harry was christened inside the 15th century gothic chapel, which can seat about 800 people. Compare that to the 1,900 guests that Prince William and the former Kate Middleton invited to their 2011 wedding at Westminster Abbey.\n\nThe event is expected to be televised, but Americans who want to watch from home will have to set their alarm clocks: The service will begin at noon local time — which means 7 a.m. for folks on the East Coast, and 4 a.m. for West Coast viewers.\n\nThe couple to hold the ceremony at St. George's Chapel, located on the grounds of the royal residence in Windsor, England. AFP - Getty Images\n\nFor those who live in or plan to head to Windsor, it may be possible to catch a glimpse of the couple on their special day. Harry and Markle will open up the castle grounds (which is normally open to tourists but will be closed on the wedding day) to some local school children, charity workers and select individuals chosen by local leaders throughout the United Kingdom.\n\nThe rest of the public will have to join the crowds lined along the route of a carriage procession transporting the couple through the streets of Windsor once the two have tied the knot.\n\nHarry and Markle will ride in a carriage following their ceremony, just as Duke and Duchess of Cambridge did after their April 2011 wedding. Tom Stoddart / Getty Images\n\n\"Prince Harry and Ms. Markle are very much looking forward to this part of the day,\" according to Kensington Palace. \"It will be their chance to express their gratitude for the goodwill and warm wishes they have received from all quarters in the months since their engagement.\"\n\nWho will be in the wedding party?\n\nDon’t be fooled by the 2011 wedding of William and Kate, now known as the Duke and Duchess of Cambridge. While that ceremony included Prince Harry as his brother’s best man and Kate’s sister, Pippa, as maid of honor, royal weddings don’t typically include parties like the ones compiled by American brides and grooms.\n\n“Historically, there’s no such thing as a best man in a royal wedding,” said Marlene Koenig, an academic librarian who has studied British and European royalty. Instead, the best man equivalent is known as a “supporter.”\n\nPrince William and his new bride Catherine, Duchess of Cambridge walk down the aisle followed by best man Prince Harry and Maid of Honor Pippa Middleton at the close of their wedding ceremony at Westminster Abbey on April 29, 2011 in London. WPA Pool / Getty Images\n\nWhen asked in a January interview about his brother’s wedding, William joked: “He hasn’t asked me yet, just to clear that up. It could be a sensitive subject.”\n\nBut three months later, Kensington Palace revealed it was official: Harry had asked his brother to be his best man. William, of course, accepted.\n\n“The Duke of Cambridge is honored to have been asked, and is very much looking forward to supporting his brother at St. George’s Chapel, Windsor on May 19th,” the palace said in an April 26 statement.\n\nPrince Harry has asked his brother The Duke of Cambridge to be his Best Man at his wedding to Ms. Meghan Markle. pic.twitter.com/7TvZ2VlEk2 — Kensington Palace (@KensingtonRoyal) April 26, 2018\n\nThe announcement did not come as a surprise since two brothers have always had a close relationship, forged in part during their recovery from the 1997 death of their mother Princess Diana. In addition, Harry served as William's best man at his 2011 wedding to Kate Middleton.\n\nThe two princes are close, but will Prince Harry ask his brother to be best man? Samir Hussein / WireImage\n\nMarkle, on the other hand, decided against having a maid of honor since that would force her to choose among a tight circle of friends. Royal weddings traditionally have young children serve as bridesmaids — and pages — anyway.\n\nTrending stories,celebrity news and all the best of TODAY. This site is protected by recaptcha\n\nWhat roles will Prince George and Princess Charlotte play?\n\nPrince George, the third in line to the British throne, and his sister, Princess Charlotte, are expected to shine bright at their uncle's wedding.\n\nAnd why wouldn't they? The young siblings have proved they can (mostly) handle the pressure with aplomb, based on their performance last May when they nearly stole the spotlight at the wedding of their aunt, Pippa Middleton.\n\nKate, Duchess of Cambridge, guides her children along at the May 2017 wedding of Pippa Middleton to James Matthews. Kirsty Wigglesworth / Pool via AP\n\nGeorge, 4, served as a page and Charlotte, who turned 3 in May, was a bridesmaid. They will repeat their roles at Harry's wedding and will be joined by others their age, including several of Markle and Harry's godchildren.\n\nGeorge, in particular, may have received some advice on the role from his father and uncle, who were old hands at playing pages in various weddings for their uncles and aunts while growing up.\n\nPrinces William and Harry made darling pageboys as children! Getty Images\n\nWill the Obamas be coming to the wedding?\n\nNo.\n\nFormer President Barack Obama and his wife, Michelle, have had a warm friendship with Prince Harry, as well as his brother Prince William. (Remember the time the Obamas met a robe-clad Prince George inside Kensington Palace?)\n\nThe Obamas have worked together with Harry on numerous occasions, including a luncheon for military families and at the annual event dear to the prince's heart, the Invictus Games, the Paralympic-style competition for wounded veterans.\n\nUnfortunately for you @FLOTUS and @POTUS I wasn't alone when you sent me that video 😉 - H.https://t.co/sjfSQvkzb6 — Kensington Palace (@KensingtonRoyal) April 29, 2016\n\nWhen Harry was asked on a BBC radio show in late December whether he planned to invite the former American president, the prince eluded giving a direct answer.\n\n“I don’t know about that — we haven’t even put the invites or the guest list together yet so who knows whether he’s going to be invited or not,\" he said. \"I wouldn't want to ruin that surprise.\"\n\nRoyal watchers suspect inviting the Obamas would be seen as a political statement, particularly if President Trump failed to make the cut. But a Kensington Palace spokesman told NBC News that an official list of political leaders, both from the United Kingdom and around the world, \"is not required for the wedding.\"\n\nWhile the palace would not comment on which individuals made the guest list cut, the spokesman confirmed that the Obamas will not be attending.\n\n\"But the couples look forward to seeing each other soon,\" the spokesman said.\n\nWhat will Markle wear?\n\nSpeculation has swirled around which designer has been commissioned to create Markle's bridal gown. Some have wondered whether Markle will go with Alexander McQueen, as her future sister-in-law did for her wedding to Prince William. Kate, the Duchess of Cambridge, wore a lace wedding gown designed by McQueen's creative director, Sarah Burton.\n\nBut Roland Mouret is another name that has been tossed around. Markle has been photographed wearing his designs numerous times. Plus, the two are close friends.\n\nOther leading contenders are Australians Tamara Ralph and Michael Russo, who created the black Ralph & Russo mesh dress Markle wore for her engagement pictures.\n\nMore than likely, the public will have to wait until May 19 to learn the label behind the bridal wedding gown.\n\nAnd what about Harry? That's a lot easier. There's a good chance that the former Captain Wales, a 10-year British Army veteran, may dress in his military uniform.\n\nRoland Mouret designed this dress Markle wore for her engagement photo. Will he also design her wedding gown? Alexi Lubomirski/Kensington Palace via Getty Images\n\nHave the couple set up a wedding registry anywhere?\n\nSince Harry and Markle are truly the couple who have everything, they've made it clear they don't want or need wedding gifts. They've asked well-wishers to make a donation to one of their hand-selected charities instead.\n\n“The couple have personally chosen seven charities which represent a range of issues that they are passionate about, including sport for social change, women’s empowerment, conservation, the environment, homelessness, HIV and the Armed Forces,\" Kensington Palace announced on Twitter. It released a similar statement on its website that listed details about each organization.\n\nThe couple's request follows in the footsteps of Harry's brother, Prince William. The Duke and Duchess of Cambridge raised $1.7 million in donations to the Royal Wedding Charitable Gift Fund, which they formed ahead of their April 2011 ceremony.\n\nPrince William and Kate, the Duchess of Cambridge, also preferred charity donations to wedding gifts when they got married in 2011. Martin Meissner / AP\n\nWill Markle actually become a princess after the wedding?\n\nNo. And yes. A look at Harry’s sister-in-law can best explain why.\n\nWhen the former Kate Middleton married Prince William, she assumed her husband's title and style, technically making her \"Princess William of Wales,\" said royal historian Carolyn Harris, author of “Raising Royalty: 1000 Years of Royal Parenting.”\n\nWilliam actually listed \"Princess of the United Kingdom\" as his wife's occupation on the birth certificates of their children, George and Charlotte.\n\nHowever, Kate will never be called Princess Kate.\n\n“Only princesses born into the royal family hold the title of ‘Princess’ plus their first name,” Harris said.\n\nTake, for example, the two daughters of Queen Elizabeth’s son, Prince Andrew: Princess Beatrice and Princess Eugenie.\n\nQueen Elizabeth is expected to bestow Prince Harry with a royal title once he is married. When Prince William married Kate, he became the Duke of Cambridge, a title last held by one of Queen Victoria' cousins, and his wife, the Duchess of Cambridge.\n\nThe frontrunner among titles for Harry is Duke of Sussex, a title last held by one of the younger sons of King George III.\n\n“When Meghan Markle marries Prince Harry, she will assume his title,” Harris said.\n\nAnother possibility for the red-headed royal is Duke of Clarence, a title last held by Queen Victoria's grandson Albert Victor.\n\nThere also is some speculation that the couple may also receive a title pertaining to Scottish and Northern Irish subsidiaries. Among the Scottish possibilities are the Earl and Countess of Ross. The couple would use their English titles in England and Scottish titles in Scotland, Harris said.\n\nDo you have more royal wedding burning questions? Tweet them to @TodayShow!", "images": ["https://media3.s-nbcnews.com/j/newscms/2019_18/1432044/today-3rd-hour_9370906f7c40d78db8842bc0c3e628a7.10000;74;7;80;3.png", "https://media4.s-nbcnews.com/j/newscms/2020_03/1529838/weekend-today-menu_94be02e0ac821819fdb22a090c28163f.10000;74;7;80;3.png", "https://media4.s-nbcnews.com/j/newscms/2018_52/2696426/food_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2019_18/1432043/hodaandjenna_00d9547321553d5a5f55c2b3973c514b.10000;74;7;80;3.png", "https://media2.s-nbcnews.com/j/MSNBC/Components/Video/201711/tdy_news_kelly_royals_171129_1920x1080.focal-760x428.jpg", "https://media3.s-nbcnews.com/j/MSNBC/Components/Video/201803/tdy_pop_royals_180316_1920x1080.focal-760x428.jpg", "https://media4.s-nbcnews.com/j/newscms/2018_52/2696446/shop_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696466/wellness_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media4.s-nbcnews.com/j/newscms/2018_52/2696481/today_4bc7d2146c228dd9a02a3c15b38527d0.10000;74;7;80;3.png", "https://media2.s-nbcnews.com/j/newscms/2018_11/1324413/meghan-markle-prince-harry-today-180313-main-art2_09ee59031b3984c6309fda74aa7cb209.fit-760w.jpg", "https://media1.s-nbcnews.com/j/MSNBC/Components/Video/201803/tdy_pop_ali_royals_180303_1920x1080.focal-760x428.jpg", "https://media3.s-nbcnews.com/j/newscms/2018_11/1324412/meghan-markle-prince-harry-today-180313-tease-01_d0bd0495e47e6885e092f54846d5cc40.social_share_1200x630_center.jpg", "https://media2.s-nbcnews.com/j/newscms/2018_52/2696456/style_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696461/videos_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media2.s-nbcnews.com/j/newscms/2018_52/2696491/williegeist_4bc7d2146c228dd9a02a3c15b38527d0.10000;74;7;80;3.png", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696431/home_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media3.s-nbcnews.com/j/newscms/2018_52/2696436/parenting_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg", "https://media2.s-nbcnews.com/j/newscms/2018_52/2696441/popculture_v2_4430f66e4555be0684b8f4bf6875e1e8.focal-120x180.jpg"], "top_img": "https://media3.s-nbcnews.com/j/newscms/2018_11/1324412/meghan-markle-prince-harry-today-180313-tease-01_d0bd0495e47e6885e092f54846d5cc40.social_share_1200x630_center.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.today.com/news/burning-questions-about-meghan-markle-prince-harry-s-royal-wedding-t125076", "title": "Burning questions about Meghan Markle and Prince Harry's royal wedding", "meta_data": {"msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/today/all-other-sizes-PNG.ico/ms-icon-144x144.png", "msapplication-config": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/today/all-other-sizes-PNG.ico/browserconfig.xml", "fb": {"app_id": 122384521533, "admins": 100001657893615, "pages": 157687092983}, "og": {"site_name": "TODAY.com", "locale": "en_US", "url": "https://www.today.com/news/burning-questions-about-meghan-markle-prince-harry-s-royal-wedding-t125076", "title": "Prince Harry and Meghan Markle’s wedding is coming up! Here’s what to know", "description": "What will Markle's gown look like? Will William serve as best man? Your burning questions answered!", "image": {"identifier": "https://media3.s-nbcnews.com/j/newscms/2018_11/1324412/meghan-markle-prince-harry-today-180313-tease-01_d0bd0495e47e6885e092f54846d5cc40.social_share_1200x630_center.jpg", "secure_url": "https://media3.s-nbcnews.com/j/newscms/2018_11/1324412/meghan-markle-prince-harry-today-180313-tease-01_d0bd0495e47e6885e092f54846d5cc40.social_share_1200x630_center.jpg", "type": "image/jpeg", "width": 1200, "height": 630}, "type": "article"}, "twitter": {"site": "@TodayShow", "creator": "TodayShow", "image": "https://media3.s-nbcnews.com/j/newscms/2018_11/1324412/meghan-markle-prince-harry-today-180313-tease-01_d0bd0495e47e6885e092f54846d5cc40.social_share_1024x512_center.jpg", "title": "Prince Harry and Meghan Markle’s wedding is coming up! Here’s what to know", "description": "What will Markle's gown look like? Will William serve as best man? Your burning questions answered!", "card": "summary_large_image"}, "viewport": "width=device-width, initial-scale=1", "description": "Top burning questions about Meghan Markle's wedding to Prince Harry - venue, gown, potential title, role of Prince George and Princess Charlotte - answered.", "article": {"opinion": "false", "content_tier": "free"}, "thumbnail": "https://media3.s-nbcnews.com/j/newscms/2018_11/1324412/meghan-markle-prince-harry-today-180313-tease-01_d0bd0495e47e6885e092f54846d5cc40.social_share_1024x768_scale.jpg", "apple-itunes-app": "app-id=416357699"}, "movies": [], "publish_date": 1521569580.0, "source": "https://www.today.com", "summary": ""}