{"url": "www.theguardian.com/film/2018/aug/22/danny-boyle-james-bond-daniel-craig", "text": "Director’s departure over ‘creative differences’ expected to delay production, and could even lead to loss of star Daniel Craig\n\nThe immediate future of the James Bond franchise is in chaos after the sudden departure of the director Danny Boyle.\n\n\n\nThree months before shooting on the as-yet-untitled film was scheduled to start, the Oscar-winning film-maker behind Slumdog Millionaire and Trainspotting quit, leaving producers scrambling.\n\nA delay to the scheduled release date of 25 October 2019 looks inevitable; there is also speculation the fallout could stretch further, claiming star Daniel Craig as another victim.\n\nA tweet from the franchise’s official account announced on Monday evening: “Michael G Wilson, Barbara Broccoli and Daniel Craig today announced that due to creative differences Danny Boyle has decided to no longer direct Bond 25.”\n\nIndustry insiders suspect these differences revolve around the script, which Boyle wrote with his long-term collaborator John Hodge. The pair previously collaborated on Trainspotting and its sequel, as well as The Beach, A Life Less Ordinary and Boyle’s debut, Shallow Grave.\n\nThe Bond script was reportedly a deal-breaker for Boyle, who took on the project after the departure of Sam Mendes, who directed Skyfall in 2012 before returning (having previously quit) for 2015’s Spectre.\n\nFacebook Twitter Pinterest Daniel Craig in the most recent James Bond film, Spectre. Photograph: Allstar/United Artists\n\nThe producers were reportedly so keen to secure Boyle that they put an already completed screenplay, by the longtime 007 writers Neal Purvis and Robert Wade, on the back-burner. Purvis and Wade have previously written six Bond films, including all four Craig outings, as well as the final two starring his predecessor, Pierce Brosnan.\n\nHodge and Boyle’s script – which is different in all respects – was thought to have been a work-in-progress until recently, and it is understood its themes were more topical than is traditional for a Bond film.\n\nA leaked casting-call sheet indicated that the key villain would be Russian, and Boyle has suggested the film would help the franchise evolve in the #MeToo and #TimesUp era.\n\n“You write in real time,” he said. “You acknowledge the legacy of the world of Bond and you write in the world – but you also write in the modern world as well.”\n\nBoyle indicated that the script featured a considerable coup de cinema – “it’s a great idea so hopefully it will work” – which some speculated could involve a high-concept plot in which Bond would be incarcerated for much of the running time – or, potentially, die.\n\nThe high-stakes nature of such a twist, and the controversial real-life issues the film may have explored, may well have proved a sticking point with producers. Bond films have increasingly toyed with topicality, with Spectre hanging on an initiative to axe field agents in favour of virtual espionage. However, grappling with issues such as sexual assault and Russian influence in geopolitics might have been deemed too great a gamble.\n\nAlthough Mendes and Craig’s tenure has put Bond back in favour with liberal critics as well as punters, Eon Productions, the production company behind the franchise, would be unlikely to want to risk the alienation of a large part of its target market to placate talent. With budgets for Skyfall and Spectre exceeding $300m (£232m), little compromise for the film’s commercial prospects can be countenanced.\n\nBoyle and Hodge’s script is unlikely to survive the director’s exit, meaning that Purvis and Wade’s draft will need to be polished up for production, and the entire enterprise overhauled to account for a different story, characters and settings. This would add at least a year to the schedule, and the film may not be released until late-2020, at the earliest.\n\nProducers would be reluctant to delay further, as a 2020 release date would already mean a five-year gap between the new film and Spectre. Although there were four years between Craig’s second outing, Quantum of Solace (2008) and his third, Skyfall (2012), the longest break between Bond films is only six years – between Licence to Kill (1989) and GoldenEye (1995) – and that involved a change of actor in the leading role.\n\nThis makes it yet more likely that Craig, 50, will call it a day. Until there was confirmation he would return alongside Boyle, speculation had been rife that the actor, a famously reluctant tuxedo wearer, would move on, with Idris Elba and Tom Hardy among those named as possible candidates to replace him.\n\nPromoting Spectre in 2015, Craig said he would rather slash his wrists than reprise the role; months later, his departure seemed all but certain following that of Mendes.\n\nIn 2016, Craig was reportedly offered $150m to star in another two Bond movies by Broccoli, and this year he was confirmed for at least one more.\n\nCraig and Boyle have worked together once before: when the former appeared as Bond, alongside the Queen, in a brief film that featured in the London 2012 Olympic opening ceremony, which Boyle directed.\n\nMark Tildesley, Boyle’s favoured production designer, was also recruited to the Bond film this year. His future on the project is now unknown.\n\nBoyle’s latest film, a romcom scripted by Richard Curtis, is scheduled for release in September 2019 – just a month before the Bond movie was due to come out. It is distributed by Universal Pictures, which recently took on UK distribution rights to the Bond films from Sony Pictures, which was responsible for getting Boyle’s most recent big screen release, T2: Trainspotting, into cinemas.\n\nPossible replacements for Boyle include Christopher Nolan, Christopher McQuarrie and Susanne Bier. McQuarrie’s latest film, Mission: Impossible – Fallout, was widely praised for its Bond-style plot and stunts. The film, which stars Tom Cruise, has so far made $500m at the box office.", "images": ["https://i.guim.co.uk/img/media/94bb08a0339eceee95da2c7a369af3acbf8d62d3/0_172_3504_2102/master/3504.jpg?width=300&quality=85&auto=format&fit=max&s=68d77cee2c7bce14561bd848e1af31ac", "https://i.guim.co.uk/img/media/01e42cb8b312817845b64c20456ada4beb6e6c78/0_24_3842_2305/master/3842.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctYWdlLTIwMTgucG5n&enable=upscale&s=856f51844498765e7001944d205ff46d", "http://phar.gu-web.net/count/pvg.gif", "http://phar.gu-web.net/count/pv.gif", "https://i.guim.co.uk/img/media/01e42cb8b312817845b64c20456ada4beb6e6c78/0_24_3842_2305/master/3842.jpg?width=300&quality=85&auto=format&fit=max&s=d5fc76406655c157032b17315c01d6df", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=James+Bond%2CDanny+Boyle%2CDaniel+Craig%2CSam+Mendes%2CFilm+industry%2CCulture%2CFilm"], "top_img": "https://i.guim.co.uk/img/media/01e42cb8b312817845b64c20456ada4beb6e6c78/0_24_3842_2305/master/3842.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctYWdlLTIwMTgucG5n&enable=upscale&s=856f51844498765e7001944d205ff46d", "keywords": [], "authors": ["Catherine Shoard"], "canonical_link": "https://www.theguardian.com/film/2018/aug/22/danny-boyle-james-bond-daniel-craig", "title": "Danny Boyle's exit from James Bond throws franchise into chaos", "meta_data": {"description": "Director’s departure over ‘creative differences’ expected to delay production, and could even lead to loss of star Daniel Craig", "format-detection": "telephone=no", "HandheldFriendly": "True", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "apple-mobile-web-app-title": "Guardian", "application-name": "The Guardian", "msapplication-TileColor": "#052962", "theme-color": "#052962", "msapplication-TileImage": "https://assets.guim.co.uk/images/favicons/023dafadbf5ef53e0865e4baaaa32b3b/windows_tile_144_b.png", "author": "Catherine Shoard", "thumbnail": "https://i.guim.co.uk/img/media/01e42cb8b312817845b64c20456ada4beb6e6c78/0_24_3842_2305/master/3842.jpg?width=620&quality=85&auto=format&fit=max&s=4108894fe7d95ae7d883eab3674053c8", "keywords": "James Bond,Danny Boyle,Daniel Craig,Sam Mendes,Film industry,Culture,Film", "news_keywords": "James Bond,Danny Boyle,Daniel Craig,Sam Mendes,Film industry,Culture,Film", "og": {"url": "http://www.theguardian.com/film/2018/aug/22/danny-boyle-james-bond-daniel-craig", "image": "https://i.guim.co.uk/img/media/01e42cb8b312817845b64c20456ada4beb6e6c78/0_24_3842_2305/master/3842.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctYWdlLTIwMTgucG5n&enable=upscale&s=856f51844498765e7001944d205ff46d", "description": "Director’s departure over ‘creative differences’ expected to delay production, and could even lead to loss of star Daniel Craig", "type": "article", "title": "Danny Boyle's exit from James Bond throws franchise into chaos", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/catherineshoard", "publisher": "https://www.facebook.com/theguardian", "section": "Film", "published_time": "2018-08-22T12:29:20.000Z", "tag": "James Bond,Danny Boyle,Daniel Craig,Sam Mendes,Film industry,Culture,Film", "modified_time": "2018-08-22T20:28:44.000Z"}, "al": {"ios": {"url": "gnmguardian://film/2018/aug/22/danny-boyle-james-bond-daniel-craig?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287, "pages": 516977308337360}, "twitter": {"app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"ipad": "gnmguardian://film/2018/aug/22/danny-boyle-james-bond-daniel-craig?contenttype=Article&source=twitter", "googleplay": "guardian://www.theguardian.com/film/2018/aug/22/danny-boyle-james-bond-daniel-craig", "iphone": "gnmguardian://film/2018/aug/22/danny-boyle-james-bond-daniel-craig?contenttype=Article&source=twitter"}}, "image": "https://i.guim.co.uk/img/media/01e42cb8b312817845b64c20456ada4beb6e6c78/0_24_3842_2305/master/3842.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctYWdlLTIwMTgucG5n&s=36a1f1902e6eb37b8e64dc9bfa77a58c", "site": "@guardian", "card": "summary_large_image", "creator": "@catherineshoard", "dnt": "on"}, "robots": "max-image-preview:large"}, "movies": ["https://www.youtube-nocookie.com/embed/1AS-dCdYZbo?wmode=opaque&feature=oembed"], "publish_date": 1534867200.0, "source": "http://www.theguardian.com", "summary": ""}