{"url": "www.thewrap.com/oscar-parties-2018-top-invites-events-nominee-gatherings/", "text": "This preview focuses on private, invite-only events aimed at a professional industry audience of stakeholders in the Academy Awards.\n\nAs soon as Oscar voting closes on Tuesday, Feb. 27 at 5 p.m. PST, the Academy’s prohibition on “non-screening events” ends. Party season begins again. Here’s a first look at the top gatherings of nominees and creative ensembles before and after Jimmy Kimmel hosts the big show on Sunday, March 4.\n\nAlso Read: Academy to Eliminate Paper Balloting at Next Year's Oscars\n\nTuesday, February 27\n\nICON MANN Pre-Oscars Dinner Honoring Former Academy President Cheryl Boone Isaacs\n\nRegent Beverly Wilshire\n\nLogline: Quincy Jones chairs the night that brings together black Hollywood power players. Halle Berry, Common, Lee Daniels, Charles King, former Oscar telecast producer Reginald Hudlin, TV Academy CEO Hayma Washington, ABC Entertainment President Channing Dungy, Ava DuVernay, and Jada Pinkett Smith are expected.\n\nWednesday, February 28\n\nThe Oscar Concert with the Los Angeles Philharmonic\n\nWalt Disney Concert Hall\n\nLogline: The great Michael Giacchino (an Oscar-winning Academy Governor) led a team making fresh arrangements of this year’s nominated scores. The L.A. Phil will perform them live with film clips.\n\nTickets: Unlike everything else from here down, this is open to the public. Tickets start at $43.\n\nVanity Fair, Barneys New York, and Sony Pictures Classics’ Cocktail Party\n\nChateau Marmont\n\nLogline: Cocktail with one of the season’s buzziest films, “Call Me by Your Name,” while servicing one of the mag’s many advertising clients touching Oscar week.\n\nGlobal Green’s 15th Anniversary Oscar Party\n\nNeuehouse Hollywood\n\nLogline: The CEO of the Leonardo DiCaprio Foundation will be honored but the Oscar-winning environmentalist himself is not expected. Stepping into the spotlight instead: Sophia Bush, Elisabeth Röhm, Sharon Lawrence and Ed O’Neill.\n\nThursday, March 1\n\nCadillac Celebrates the 90th Academy Awards\n\nChateau Marmont\n\nLogline: Michael Patrick’s soiree always draws a mix of familiar faces (Zoe Saldana, Christoph Waltz, Naomi Watts, Joel McHale) and some news ones (Angela Sarafyan, Jay Ellis) at one of the most social industry gatherings of the week.\n\nConnection: As the Academy’s official wheels, Cadillac will be shuttling nominees and presenters across town all week to many of the events listed below.\n\nGersh Oscar Party\n\nChateau Marmont Penthouse\n\nLogline: The agency and Tequila Don Julio 1942 will raise a glass to the agency’s nominees Allison Janney, Sam Rockwell and Richard Jenkins.\n\nLookout: I don’t envy the elegant face of the Chateau, Anya Varda, and her team that night. March is coming in like a lion.\n\nAlso Read: 'Faces Places' Director JR Explains Agnes Varda Cardboard Cutout at Oscars Luncheon (Video)\n\nVanity Fair and Lancôme Paris Toast Women in Hollywood\n\nSoho House\n\nLogline: Oscar week doubles as a debut for Graydon Carter’s successor, new top editor Radhika Jones. The high-end cosmetics brand will make a donation to Time’s Up on behalf of the guests, who include Ava DuVernay.\n\nUniversal, Focus Features and DreamWorks Animation Oscar Nominee Celebration Dinner\n\nSpago\n\nLogline: There’a pile of nominees and nominations here with Focus having a banner year (“Darkest Hour,” “Phantom Thread,” and “Victoria & Abdul”). A year ago, Universal was not scheduling Oscar week plans for “Get Out,” but after Jordan Peele’s commercial and critical hit took off, that all changed.\n\nOscar Wilde Awards at J.J. Abrams’ Bad Robot\n\nBad Robot in Santa Monica\n\nLogline: In a week packed with formal gatherings, this casual get together with live music on “JJ’s roof” always brings out Hollywood’s most strident supporters of the U.S.-Ireland relationship. This year, the US-Ireland Alliance honors Mark Hamill, Barry Keoghan, and Catherine O’Hara. Colin Farrell and Martin Short will each be presenting awards. See a master of the Star Wars and Star Trek universes, Abrams, try on the role of master of ceremonies.\n\n2nd Annual KODAK Auteur Awards\n\nCrossroads on Melrose\n\nLogline:The former name-sponsor of the home of the Oscars celebrates Oscar-contending movies that were shot on actual film.\n\nWho to Expect: Sean Baker (Director, “The Florida Project”), Luca Guadagnino (Director, “Call Me By Your Name”), Dee Rees (Director, “Mudbound”), and Edgar Wright (Director, “Baby Driver”)\n\nDolby Honors this year’s Oscar Nominees in Sound Mixing, Sound Editing, and Cinematography\n\nThe London West Hollywood\n\nLogline: The Sound Editing and Sound Mixing Oscar categories contain the same five films as nominees, though the two audio trades are not the same thing. The Oscar’s titular host – the “Dolby” Theatre – welcomes nominees from those two categories to join the nominated cinematographers in West Hollywood three nights before the big show.\n\nFriday, March 2\n\nBritish Consul General Michael Howells’ Film is Great Reception\n\nBritish Consul General’s Residence in Hancock Park\n\nLogline: Don’t tell the ultra-nationalist xenophobes. The foreigners are already here.\n\nThere are U.K.-born nominees in 17 of the 24 Oscar categories and representation in five of the top races: Best Picture (“The Darkest Hour,” “The Phantom Thread,” “Three Billboards Outside Ebbing, Missouri”), Best Actress (Sally Hawkins), Supporting Actress (Lesley Manvill), Best Actor (Daniel Kaluuya, Daniel Day Lewis, Gary Oldman), and Director (Christopher Nolan).\n\nFeature: Host Michael Howells gave one of the best speeches of this awards season at BAFTA’s Golden Globes weekend Tea Party. Take note and shut up when he addresses his backyard.\n\nAlso Read: Royal Wedding Chatter at BAFTA: Hollywood-Royal Merger 'Is Great News' (Photos)\n\nPours: Even the bar is British. Sponsors include Silent Pool Gin, Aberlour Whisky, Chapel Down (English Sparkling Wine), Seedlip (non-alcoholic spirit) and Fever Tree tonics.\n\nEmma Stone hosts Women in Film’s Celebration of the 2018 Female Oscar Nominees\n\nCrustacean, Beverly Hills\n\nLogline: The reigning Best Actress winner (and in the famous flub, also announced as the Best Picture winner) joins Women in Film president Cathy Schulman and the community of female nominees from both sides of the camera.\n\nThe industry’s reckoning of institutionalized gender inequality and systemic sexual assault engulfed Hollywood, and Schulman’s been sounding the alarm for years. How WiF addresses the state of the industry on its biggest weekend will set the tone for what happens as as we turn the page to a new “industry year.”\n\nAlso Read: 'Crashing' Star Jamie Lee on Comedy in the #MeToo Era: 'Things Are Not That Funny Right Now' (Video)\n\nSponsors: Max Mara (for the 11th year) and Lancôme with additional support from Crustacean Beverly Hills, Johnnie Walker, and Stella Artois.\n\nWME\n\nFriday evening, Private Residence\n\nWho’s Who: Kobe Bryant, the champ of this year’s Oscars gatherings, should be there. Add nominees Denzel Washington, Octavia Spencer, Laurie Metcalf, Guillermo del Toro, Dee Rees, Christopher Nolan, Luca Guadagnino, Hans Zimmer, James Mangold and Michael Green to the list and call it a top crowd.\n\nBonus: The agency will also raise a glass to nominated projects “Call Me by Your Name,” “Mudbound” and “The Square,” all of which hail from Endeavor Content.\n\nVanity Fair, Genesis, 20th Century Fox, and Fox Searchlight celebrate “The Shape of Water,” “Three Billboards Outside Ebbing, Missouri,” “The Post,” “The Greatest Showman,” “Ferdinand,” “Logan,” and “War for the Plant of the Apes.”\n\nFriday evening, Spago Beverly Hills\n\nLogline: This one wasn’t going to fit in a boutique space like the Sunset Tower. The studios have too many contenders. Select guests will arrive via luxury car sponsor Genesis.\n\nSaturday, March 3\n\nFilm Independent Spirit Awards\n\nA Tent on the Beach: 1550 Pacific Coast Highway Lot 1 North Santa Monica\n\nLogline: The industry’s booziest daytime bash of the year. Everyone heeds Film Independent President Josh Welsh’s mantra to “leave the thank-you notes at home,” adding to a celebratory day that begins in the lounges outside the main tent as early as 11 a.m.\n\nTop Hang: DIRECTV’s Bungalow presented by AT&T, the main hospitality suite outside the tent. This is where winners come to have their trophies engraved and select VIPs – nominated or not – go to grab cocktails.\n\nIFC Films and Sundance Selects’ Film Independent Spirit Awards After Party\n\n41 Ocean Club\n\nLogline: After the John Mulaney and Nick Kroll signs off from hosting the Spirit Awards, host network IFC welcomes winners and friends to walk up the hill. MovieGrade App, Hendrick’s Gin, and Kona Brewing Company sponsor the Spirit Awards’ late afternoon party.\n\nSony Pictures Classics Annual Oscar Nominees Dinner\n\nNordstrom Local on Melrose Place in West Hollywood\n\nWhy they will be smiling: This is the finish line. The “Call Me by Your Name” troika — Timothée Chalamet, Armie Hammer, and director Luca Guadagnino — end the 14-month promotional tour that started back at Sundance 2017.\n\nOther Nominees: SPC will also toast its two foreign language nominees, “A Fantastic Woman” (from Chile) and “Loveless” (from Russia).\n\nMPTF’s Annual “Night Before”\n\nFox Studios\n\nLogline: The MPTF is where the gatekeepers and power brokers in the industry convene on the night before the Oscars. This is an invite worth fighting for. Make a big donation and step in to Jeffrey Katzenberg’s circle.\n\nSign of the times: YouTube joins the list of blue-chip corporate sponsors.\n\nOscars Viewing Parties on Sunday, March 4\n\n*Top Invite* – 2018 Elton John AIDS Foundation Academy Awards Viewing Party\n\nCustom built complext in West Hollywood Park\n\nLogline: The most choice invite if you’re not seated in the first 15 rows of the Kodak Theatre itself.\n\nDo: drink top-shelf champagne and feast on cuisine from a Michelin three-star restaurant in Spain with a great cross section of Hollywood.\n\nDon’t: Don’t try to take any pictures of Sir Elton or stand too close to his head table. You may be excused for asking frequent guest Robert Kraft what happened in the Super Bowl. By 8:45 or so, trophy winners start pouring in as the telecast on screen comes to you.\n\nCharity Component: Contributing to the EJAF mission, presenting sponsor BVLGARI is donating a 13 carat white gold diamond necklace, the “BVLGARI DIVISSIMA” to the live auction.\n\nWow Booking: Greta Van Fleet. This is a return to prime form for the EJAF, welcoming a big up-and-coming band heralded as a savior of guitar rock, not a nostalgia act. Because all 42 of the headlining dates on their first U.S. tour sold out in advance and they’re headed to Coachella, the four Michigan boys are a choice dessert on the evening.\n\nByron Allen’s Second Annual Entertainment Studios Gala\n\nBeverly Wilshire\n\nLogline: Katy Perry and Jamie Foxx will perform at the benefit for Children’s Hospital Los Angeles. Last year’s inaugural event raised $1 million, and “Byron hopes to raise even more again this year,” a rep for Entertainment Studios tells the Party Report.\n\nAlso Read: Oscars Box Office: Can Best Picture Contenders Turn Nominations Into Big Bucks?\n\nIMDb Live Viewing Party\n\nNeuehouse in Hollywood\n\nLogline: This is part party, part live broadcast. Dave Karger, Kevin Smith and other IMDb talent will provide live commentary on the show that will stream across IMDb platforms.\n\nGuests: About 300 industry types.\n\nNotables: Last year, Issa Rae and Aisha Tyler were among the crowd about a mile away from the actual show.\n\nMercedes-Benz Viewing Party\n\nFour Seasons, Beverly Hills\n\nLogline: The Four Seasons is an Oscars week base camp, so this is sort of like watching the golf tournament from the clubhouse. Last year was a mixed bag of names from Housewives (Kandi Burruss) to 1980s basketball star Ralph Sampson, to ESPN’s man in L.A., Stan Verrett.\n\nAlso Read: Syria Blocks 'Last Men In Aleppo' Producer and Subject from Attending Oscars\n\nNordstrom Local Oscar Viewing Party for the Fashion Industry\n\nNordstrom Local on Melrose Place in West Hollywood\n\nLogline: With New York’s fashion week two weeks in the rearview mirror, the style set can kick back here before hitting the after parties.\n\nOscars After-Parties\n\nThe Academy’s Governors Ball\n\nDolby Ballroom above the Dolby Theatre at Hollywood and Highland\n\nLogline: They have a lot of “make-up” homework to do after last year’s Governors Ball drowned in the surreal wake of the Oscars envelope flub.\n\nFun Facts: Six time Oscar winner Francis Ford Coppola’s winery furnishes the Academy with all the still wines. He’s shipping 2,400 bottles to the Dolby, some of which are a limited edition production of “Director’s Cut Oscars 90th Edition” bottles. Piper-Heidsieck will pour over 8,500 glasses of champagne, including Party Report favorites Rare 2002 and Rare 1998 Magnums.\n\nVanity Fair Oscar Party\n\nWallis Annenberg Center in Beverly Hills\n\nLogline: It’s the first outing for new Editor-in-Chief Radhika Jones (above). She steps into the bridge of a ship that Graydon Carter built and is already making waves. On Feb. 15, a round of layoffs included Jane Sarkin and Beth Kseniak, two founding mothers of VF Oscar night that has been the “toughest invite in town” over the past 24 years.\n\nAlso Read: Editor Purge at Vanity Fair, Glamour: More Than 15 Ousted\n\nOn the brighter (or sadder?) side of “recently separated” news, single Jennifer Aniston should be there. Forget the Brad Pitt sequel rumors. Please, let her show up with Angelina Jolie.\n\nDetails on other late night soirees to come.\n\nPlease send invites, updates, and details to the party and event contributor Mikey Glazer here.", "images": ["https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/newsletter-icon.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo-white.svg", "https://www.thewrap.com/wp-content/uploads/2018/01/Leonardo-DiCaprio-Focus-Features-Gary-Oldman-Party-copy.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-wrappro-white.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/try-pro-free.svg", "https://www.thewrap.com/wp-content/uploads/2018/02/2017.02.25-12.52.38-copy.jpg", "https://www.thewrap.com/wp-content/uploads/2014/02/GREAT-British-Film-Reception.jpg", "https://www.thewrap.com/wp-content/uploads/2018/02/Oscar-Parties-2018-in-Hollywood-After-Parties-Preview-Mikey-Glazer.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/wrap-logo.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/memberships/user_icon_white.svg", "https://www.thewrap.com/wp-content/uploads/2015/02/oscars-100.jpg", "https://www.thewrap.com/wp-content/uploads/2017/06/0001_Patty-Jenkins-Emma-Stone-Michael-Kovac.jpg", "https://www.thewrap.com/wp-content/uploads/2018/02/Governors-Ball-Kevork-D.-GettyImages-645760214.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=8498827&cv=2.0&cj=1", "https://www.thewrap.com/wp-content/uploads/2017/01/2017_01_22_Wrap_Sundance_Jana_Cruder-207.jpg", "https://pixel.quantserve.com/pixel/p-8flXM--ZHulLQ.gif", "https://www.thewrap.com/wp-content/uploads/2018/02/Kobe-Bryant-Nominees-Luncheon-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2017/06/Oscar-Statuettes-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/arw-rt.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/get-more.svg", "https://www.thewrap.com/wp-content/uploads/2018/02/longdoc_025-160x105.jpg", "https://www.thewrap.com/wp-content/uploads/2018/01/AFI-Lunch-_0007_AFI-Awards-3.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/email-icon.png", "https://www.thewrap.com/wp-content/uploads/2018/02/Radhika-Jones-Larry-Bussacca-GettyImages-487368017.jpg", "https://www.thewrap.com/wp-content/uploads/2018/02/05-last-man-in-aleppo.w710.h473-160x105.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/first-take.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/logo-signup.png", "https://www.thewrap.com/wp-content/uploads/2017/02/Cadillac-Oscar-Party-Getty-Images.jpg"], "top_img": "https://www.thewrap.com/wp-content/uploads/2018/02/Oscar-Parties-2018-in-Hollywood-After-Parties-Preview-Mikey-Glazer.jpg", "keywords": [], "authors": ["Mikey Glazer", "Jeremy Fuster", "Brian Welk", "Steve Pond"], "canonical_link": "https://www.thewrap.com/oscar-parties-2018-top-invites-events-nominee-gatherings/", "title": "Oscar Parties 2018: The Top Invites, Events and Nominee Gatherings", "meta_data": {"parsely-title": "Oscar Parties 2018: The Top Invites, Events and Nominee Gatherings", "parsely-link": "https://www.thewrap.com/oscar-parties-2018-top-invites-events-nominee-gatherings/", "parsely-type": "post", "parsely-pub-date": "2018-02-15T17:36:02-08:00", "parsely-section": "pages", "parsely-author": "Mikey Glazer", "parsely-tags": "aleppo, allison_janney, anya-varda, ava_duvernay, beth-kseniak, byron-allen, cathy_schulman, daniel-day-lewis, dave_karger, elton_john, emma_stone, governors_ball, graydon_carter, greta-van-fleet, hans_zimmer, jamie_foxx, jay-ellis, jeffrey_katzenberg, jennifer_aniston, jimmy_kimmel, josh-welsh, katy_perry, luca-guadagnino, michael_giacchino, michael-patrick, oscar-nominee, oscar_parties, sally_hawkins, sam_rockwell, sony_pictures_classics", "viewport": "initial-scale=1.0, maximum-scale=6.0, user-scalable=yes", "description": "Kobe Bryant, Emma Stone, Katy Perry, Michelin-starred chefs, Coachella 2018 bands and a 13-karat diamond necklace are all hitting Oscar week", "news_keywords": "aleppo, allison janney, anya varda, ava duvernay, beth kseniak, byron allen, cathy schulman, daniel day lewis, dave karger, elton john, emma stone, governors ball, graydon carter, greta van fleet, hans zimmer, jamie foxx, jay ellis, jeffrey katzenberg, jennifer aniston, jimmy kimmel, josh welsh, katy perry, luca guadagnino, michael giacchino, michael patrick, oscar nominee, oscar parties, sally hawkins, sam rockwell, sony pictures classics", "original-source": "https://www.thewrap.com/oscar-parties-2018-top-invites-events-nominee-gatherings/", "og": {"locale": "en_US", "type": "article", "title": "Oscar Parties 2018: The Top Invites, Events and Nominee Gatherings", "description": "Kobe Bryant, Emma Stone, Katy Perry, Michelin-starred chefs, Coachella 2018 bands and a 13-karat diamond necklace are all hitting Oscar week", "url": "https://www.thewrap.com/oscar-parties-2018-top-invites-events-nominee-gatherings/", "site_name": "TheWrap", "updated_time": "2018-02-28T19:21:13-08:00", "image": {"identifier": "https://www.thewrap.com/wp-content/uploads/2018/02/Oscar-Parties-2018-in-Hollywood-After-Parties-Preview-Mikey-Glazer.jpg", "secure_url": "https://www.thewrap.com/wp-content/uploads/2018/02/Oscar-Parties-2018-in-Hollywood-After-Parties-Preview-Mikey-Glazer.jpg", "width": 618, "height": 412}}, "article": {"publisher": "http://facebook.com/thewrap", "tag": "Sony Pictures Classics", "section": "Oscars", "published_time": "2018-02-16T01:36:02-08:00", "modified_time": "2018-02-28T19:21:13-08:00"}, "fb": {"app_id": 228236404181023, "pages": 48941893663}, "twitter": {"card": "summary_large_image", "description": "Kobe Bryant, Emma Stone, Katy Perry, Michelin-starred chefs, Coachella 2018 bands and a 13-karat diamond necklace are all hitting Oscar week", "title": "Oscar Parties 2018: The Top Invites, Events and Nominee Gatherings", "site": "@thewrap", "image": "https://www.thewrap.com/wp-content/uploads/2018/02/Oscar-Parties-2018-in-Hollywood-After-Parties-Preview-Mikey-Glazer.jpg", "creator": "@Celebsightings"}, "generator": "WooFramework 6.2.0", "sailthru.title": "Oscar Parties 2018: The Top Invites, Events and Nominee Gatherings", "sailthru.date": "2018-02-16T01:36:02+00:00", "sailthru.author": "Mikey Glazer", "sailthru.tags": "jeffrey katzenberg,jimmy kimmel,elton john,cathy schulman,jamie foxx,sam rockwell,sony pictures classics,graydon carter", "sailthru.category": "awards,movies,the party report,oscars", "sailthru.image.full": "https://www.thewrap.com/wp-content/uploads/2018/02/Oscar-Parties-2018-in-Hollywood-After-Parties-Preview-Mikey-Glazer.jpg", "sailthru.image.thumb": "https://www.thewrap.com/wp-content/uploads/2018/02/Oscar-Parties-2018-in-Hollywood-After-Parties-Preview-Mikey-Glazer-150x150.jpg", "wp-parsely_version": "1.12.1", "google-site-verification": "-PpFSIrGHybVDxbndrL6MCngw3j6BXdy0xDVBVVOacI"}, "movies": [], "publish_date": 1518773762.0, "source": "http://www.thewrap.com", "summary": ""}