{"url": "https://www.elitedaily.com/entertainment/celebrity/john-mayer-defends-justin-bieber/2032891", "text": "Just when you thought John Mayer was all about being a lone wolf, he proves to be the most supportive friend... ever. John Mayer defended Justin Bieber and his decision to cancel the remainder of his Purpose World Tour during a recent interview with Variety, and it was so, so sweet. The \"Who You Love\" singer is known for being deep, sensitive, and sometimes not making sense when talking about Katy Perry during interviews. However, he made it known loud and clear that he supports Bieber's decision, and that we should, too. He said,\n\nWith touring dates, you hope you do them all, and I don't know his situation, but I appreciate the transparency. There are a hundred different reasons you can give for canceling a tour. I think the one that goes, 'I think I'm done' is the bravest and healthiest one.\n\nIf John Mayer says it, it must be true. AMIRITE? Mayer continued,\n\nYou can't send someone else to do the gig; you've got to do it. And at that age — I'm 39 and only now beginning to feel like I can weather the storm. You have to apply a certain amount of grace to younger people who are developing into that.\n\nMayer has been vocal about his support of Bieber's decision since the beginning. After it was announced that Bieber was canceling the remainder of the Purpose World Tour on July 24, he received a lot of backlash. He also got tons of support from fans worried about the \"Love Yourself\" singer's well-being, including John Mayer.\n\nMayer tweeted,\n\nWhen someone pulls remaining dates of a tour, it means they would have done real damage to themselves if they kept going. We've lost so many great artists lately. I give Justin [two thumbs up] for realizing it was time to call it. You should too.\n\nThe news of the canceled tour took a lot of people by surprise because Bieber had less than 20 shows left at the tail-end of an 18-month tour. In a statement to Elite Daily, Bieber's team said,\n\nDue to unforeseen circumstances, Justin Bieber will cancel the remainder of the Purpose World Tour concerts. Justin loves his fans and hates to disappoint them. He thanks his fans for the incredible experience of the Purpose World Tour over the last 18 months. He is grateful and honored to have shared that experience with his cast and crew for over 150 successful shows across six contents during this run. However, after careful consideration, he has decided he will not be performing any further dates. Tickets will be refunded at point of purchase.\n\nOne day, we may know the true reasoning behind Bieber canceling the rest of his tour. For now, we should all take note from John Mayer and give Biebs a break.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/elite-daily/2017/07/31170530/justin-bieber-john-mayer-side-by-side.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/elite-daily/2017/07/31170530/justin-bieber-john-mayer-side-by-side.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/elite-daily/2017/07/31170530/justin-bieber-john-mayer-side-by-side.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/entertainment/celebrity/john-mayer-defends-justin-bieber/2032891", "title": "John Mayer Defends Justin Bieber For Canceling 'Purpose' Tour, Proves They're BFFs", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/entertainment/celebrity/john-mayer-defends-justin-bieber/2032891", "type": "article", "title": "Justin Bieber And John Mayer Surprisingly Have The Most Supportive Bromance Ever", "description": "Just when you thought John Mayer was all about being a lone wolf, he proves to be the most supportive friend... ever. John Mayer defended Justin Bieber and his decision to cancel the remainder of his Purpose World Tour during a recent interview with…", "image": {"identifier": "https://imgix.bustle.com/elite-daily/2017/07/31170530/justin-bieber-john-mayer-side-by-side.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "Just when you thought John Mayer was all about being a lone wolf, he proves to be the most supportive friend... ever. John Mayer defended Justin Bieber and his decision to cancel the remainder of his Purpose World Tour during a recent interview with…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}