{"url": "http://time.com/5228207/meghan-markle-title-royal-wedding/", "text": "After marrying Prince Harry at St. George’s Chapel, Meghan Markle became an official member of the royal family. And just like Kate Middleton before her, she was given a royal title on the day of her nuptials—as was Prince Harry.\n\nKensington Palace tweeted Saturday morning that the Queen was “pleased to confer a Dukedom on Prince Henry of Wales. His titles will be Duke of Sussex, Earl of Dumbarton and Baron Kilkeel.”\n\nPrince Harry’s new title is His Royal Highness The Duke of Sussex, and after marriage, Meghan Markle’s title is Her Royal Highness The Duchess of Sussex.\n\nShe is the first woman to be known as the Duchess of Sussex. Prince Harry is the second Duke of Sussex. Prince Augustus Frederick, who campaigned against slavery, was the only other person to hold the title.\n\nJust like Prince William was given the title of Duke of Cambridge on his wedding day, it was expected that Queen Elizabeth would also bestow a dukedom on Prince Harry to commemorate his nuptials. It was previously speculated that the vacant Dukedom of Sussex had been reserved for Harry, who will also retain the title of Prince Henry of Wales.\n\nWhen Kate married Prince William on April 29, 2011, she received the title of Duchess of Cambridge to go along with the dukedom William was granted by Queen Elizabeth.\n\nBut after the royal wedding, there are still other ways to refer to Meghan Markle. Here’s what we know about how and why the royals end up with certain names and titles.\n\nPrince Harry looks at Meghan Markle, as she arrives accompanied by the Prince of Wales in St George's Chapel at Windsor Castle, May 19, 2018. Jonathan Brady—PA Wire\n\nWhat is Prince Harry’s last name?\n\nBefore we talk about Meghan, let’s first get to the bottom of what exactly Prince Harry’s last name is.\n\nHenry Charles Albert David, familiarly known as Prince Harry, was born to Charles, Prince of Wales, and Diana, Princess of Wales, on Sept. 15, 1984. Harry was born into the House of Windsor and his last name is technically Mountbatten-Windsor—as is the case for all royals who are descended from Queen Elizabeth II through the male line.\n\nHowever, last names are typically only used by members of the royal family without titles, meaning Mountbatten-Windsor is pretty much never tacked onto Harry’s name.\n\nDuring his time at school and in the military, Prince Harry was known simply as Harry Wales, a surname that derived from his father’s official title. Today, he is typically referred to as Prince Harry, or more formally, His Royal Highness Prince Henry of Wales.\n\nWhat is Meghan Markle’s new title after marrying Prince Harry?\n\nMeghan Markle’s marriage to Prince Harry does not make her a princess, as only women that are born into the royal family, like Princess Charlotte, hold that title. Instead, Meghan is now a duchess since Harry, as is tradition, was granted a dukedom on their wedding day.\n\nHowever, despite the fact that Meghan’s official title is Her Royal Highness the Duchess of Sussex and she will never be a princess in her own right, she may still be referred to by the royal title in reference to her husband, i.e., HRH Princess Henry of Wales.\n\nPrince Harry, Duke of Sussex, (left) arrives with his best man Prince William, Duke of Cambridge, at St George's Chapel, Windsor Castle, in Windsor, on May 19, 2018. Gareth Fuller—AFP/Getty Images\n\nWhat is Meghan Markle’s new last name?\n\nAfter marrying Prince Harry, Markle can now use Mountbatten-Windsor as her surname. However, considering royals tend to be known only by their first names, it’s not likely you’ll see her addressed by that name very often.\n\nJust as Kate Middleton is mainly referred to by her maiden name or the title she was given by Queen Elizabeth at her wedding to Prince William, Duchess of Cambridge, Markle will likely only add Duchess of Sussex—the dukedom Prince Harry has been granted—to her current moniker.\n\nPrince Harry and Meghan Markle in St George's Chapel at Windsor Castle during their wedding service, conducted by the Archbishop of Canterbury Justin Welby in Windsor, Britain, May 19, 2018. Owen Humphreys/Pool via REUTERS Owen Humphreys—Pool/Reuters\n\nWhat title will Prince Harry’s children have?\n\nHowever, if Harry and Meghan have children, they will not be princes and princesses like William and Kate’s children, Prince George, Princess Charlotte and Prince Louis. Unless Queen Elizabeth issues a Letters Patent declaring otherwise, Harry and Meghan’s children will be lords and ladies.\n\nThis is due to a 1917 Letters Patent issued by King George V, that limited the titles of a sovereign’s grandchildren. It read as follows: “…the grandchildren of the sons of any such Sovereign in the direct male line (save only the eldest living son of the eldest son of the Prince of Wales) shall have and enjoy in all occasions the style and title enjoyed by the children of Dukes of these Our Realms.”\n\nBasically, Prince William’s oldest son, Prince George, was the only grandchild that was ever guaranteed the title of prince. However, when Kate was pregnant with Charlotte, the Queen issued a new Letters Patent stating that all of the children of the eldest son of the Prince of Wales would receive the title of prince or princess.\n\nShe could very well do the same for Harry and Meghan’s children.\n\nWhy doesn’t the royal family use a last name?\n\nThe royal family’s naming practice may seem complicated, but the reason behind it is relatively simple: The royals are typically so well known that they don’t need a last name to be recognized.\n\n“Members of the Royal Family can be known both by the name of the Royal house, and by a surname, which are not always the same,” the official royal website reads. “And often they do not use a surname at all.”\n\nWhat do we call Kate Middleton?\n\nKate Middleton officially became Her Royal Highness the Duchess of Cambridge when Prince William was granted the Dukedom of Cambridge on their wedding day. She can also be referred to as Catherine, Duchess of Cambridge and HRH Princess William of Wales, as well as the more casual Catherine Cambridge or Catherine Mountbatten-Windsor.\n\nIn addition, William and Kate hold the titles of Earl and Countess of Strathearn in Scotland and Baron and Baroness of Carrickfergus in Ireland.\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Megan McCluskey at megan.mccluskey@time.com.", "images": ["https://api.time.com/wp-content/uploads/2018/05/royal-wedding-2018-meghan-markle-prince-harry-veil.jpg", "https://api.time.com/wp-content/uploads/2018/10/cara-delevingne-princess-eugenie.jpg?quality=85&w=558", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2018/05/royal-wedding-2018-meghan-markle-prince-harry-church-smile.jpg", "https://api.time.com/wp-content/uploads/2018/05/royal-wedding-2018-meghan-markle-prince-harry-william-walk-crowd.jpg", "https://api.time.com/wp-content/uploads/2018/03/prince-harry-meghan-markle-net-worth.jpg?quality=85&w=586", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2020/04/TIM200427_cover_Hope_USETHIS.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2018/05/meghan-markle-prince-harry-wedding.jpg?quality=85&w=1200&h=628&crop=1"], "top_img": "https://api.time.com/wp-content/uploads/2018/05/meghan-markle-prince-harry-wedding.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Megan Mccluskey"], "canonical_link": "https://time.com/5228207/meghan-markle-title-royal-wedding/", "title": "Meghan Markle and Prince Harry Have Official New Royal Titles From the Queen", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "what title will prince harry's children have, meghan markle title, what will meghan markle's last name be, harry and meghan, meghan markle, meghan markle title, prince harry, meghan markle royal title, meghan markle new title, prince harry title", "news_keywords": "what title will prince harry's children have, meghan markle title, what will meghan markle's last name be, harry and meghan, meghan markle, meghan markle title, prince harry, meghan markle royal title, meghan markle new title, prince harry title", "description": "Kensington Palace tweeted on the morning of the wedding that the Queen was pleased to confer a dukedom on Prince Harry.", "og": {"title": "Meghan Markle and Prince Harry Have Official New Royal Titles From the Queen", "type": "article", "site_name": "Time", "url": "https://time.com/5228207/meghan-markle-title-royal-wedding/", "description": "Kensington Palace tweeted the new titles on the morning of the royal wedding", "image": {"identifier": "https://api.time.com/wp-content/uploads/2018/05/meghan-markle-prince-harry-wedding.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5228207/meghan-markle-title-royal-wedding/", "description": "Kensington Palace tweeted on the morning of the wedding that the Queen was pleased to confer a dukedom on Prince Harry.", "media": "https://api.time.com/wp-content/uploads/2018/05/meghan-markle-prince-harry-wedding.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5228207/meghan-markle-title-royal-wedding/", "title": "Meghan Markle and Prince Harry Have Official New Royal Titles From the Queen", "description": "Kensington Palace tweeted the new titles on the morning of the royal wedding", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2018/05/meghan-markle-prince-harry-wedding.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}