{"url": "www.glamourmagazine.co.uk/article/jennifer-aniston-justin-theroux-engaged", "text": "Jennifer Aniston and Justin Theroux – aka one of the cutest couples in Hollywood have just broken our hearts by announcing their divorce after two and a half years of marriage.\n\nIn a statement released by Jennifer's publicist, the couple expressed:\n\n“In an effort to reduce any further speculation, we have decided to announce our separation. This decision was mutual and lovingly made at the end of last year.\"\n\nAdvertisement\n\nGetty Images\n\n\"We are two best friends who have decided to part ways as a couple, but look forward to continuing our cherished friendship. Normally we would do this privately, but given that the gossip industry cannot resist an opportunity to speculate and invent, we wanted to convey the truth directly.\"\n\nRead next 25 years since The Rachel, this is why Jennifer Aniston's hair is still so iconic and how to get it today Hair 25 years since The Rachel, this is why Jennifer Aniston's hair is still so iconic and how to get it today The secret to Jen's hair 💁🏻\n\n\"Above all, we are determined to maintain the deep respect and love that we have for one another.”\n\nGetty Images\n\nAdvertisement\n\nFor some reason, Twitter became more concerned with the fact that Brad Pitt and Jennifer Aniston are both single for the first time since their marriage ended back in 2005.\n\nIn order to see this embed, you must give consent to Social Media cookies. Open my cookie preferences. #JenniferAniston\n\nWhen u realize both Jennifer Aniston & Brad Pitt are now single pic.twitter.com/Y9cxfIWQyH — Sonia Grace (@soniagracemusic) February 15, 2018\n\nIn order to see this embed, you must give consent to Social Media cookies. Open my cookie preferences. Jennifer Aniston: single ✔️\n\nBrad Pitt: single ✔️ pic.twitter.com/glMAiNSQXz — La Colo (@soyluluuu) February 16, 2018\n\nRead next Why we're still obsessing over Rachel Green's outfit choices 25 years post-Friends Friends Why we're still obsessing over Rachel Green's outfit choices 25 years post-Friends She's like the best friend whose wardrobe we WISH we could raid.\n\nIn order to see this embed, you must give consent to Social Media cookies. Open my cookie preferences. My reaction to Jennifer Aniston separation news😭but realized both her and Brad Pitt are single😊 pic.twitter.com/RJj9UWxgxg — Hanii (@HaniLee1) February 15, 2018\n\nAdvertisement\n\nRumours began to circulate that Jen had looked to Brad as a 'shoulder to cry on' when her relationship got tough with Justin, but Jen's team have now firmly shut down the gossip.\n\nIn a statement, Jen's publicist said,\n\n\"Whatever else is printed about us that is not directly from us, is someone else's fictional narrative.\"\n\nWell, that's that then. We're not entirely sure why Jen would go back to Brad, who reportedly cheated on her with Angelina Jolie, after all these years, but each to their own.\n\nRead next The Beauty Hype: I was one of the first Beauty Directors in the UK to trial Drunk Elephant’s Hair & Body range – here’s what happened Hair Products The Beauty Hype: I was one of the first Beauty Directors in the UK to trial Drunk Elephant’s Hair & Body range – here’s what happened Luxe hair in isolation.\n\nJustin and Jen's split\n\nDespite speculation that the couple was in trouble after Brad and Angelina called it quits in September 2016, Jen and Justin stuck it out for over another year, but their relationship has sadly now come to an end.\n\nSo what were the reasons behind the split? Well, according to reports, their main disagreement was about where they should live.\n\nA source told Entertainment Tonight that Justin couldn't hack living in Hollywood and that Jen wouldn't give up her privacy to live in New York.\n\n\"He much prefers being [in New York] and that's been a major issue for them for a long time. Justin has a very diverse friend group, and he likes that they're not all 'in the industry. He's friends with people in the restaurant world, writers, comedians, artists, tattoo artists. It's an eclectic group and he doesn't have that type of network in LA.\"\n\nGetty Images\n\nRead next 15 times Rachel, Monica and even Gunther wore outfits that inspired our current wardrobes Jennifer Aniston 15 times Rachel, Monica and even Gunther wore outfits that inspired our current wardrobes Yes, even our WFH looks.\n\nJen's hounded by paparazzi everywhere she goes, whereas Justin can still travel about relatively unnoticed, which of course, posed an issue for them.\n\n\"Justin can hop on his [motorcycle], walk in the neighbourhood, hang at a bar and all that without being bothered, but for Jen, the paparazzi are all over her. He really wanted her to be comfortable [in New York]. He even negotiated with the paps to make a deal that they would only shoot her once per day and then leave her alone. He also agreed to move out of his apartment, which he loves.\"\n\nThey then apparently moved into an apartment in the West Village, but it just wasn't working. The location of a park across the road provided paps with the ideal location to snap Jen as she came and went from her home. This also irked the neighbours, adding more tension to the drama.\n\n\"...What really pissed off the neighbours was just the constant commotion outside their door all the time with the photographers. It made for an awkward living situation for Jen and Justin because they knew the neighbours weren't happy.\"\n\nThen, it gets weird, with a tidbit known as 'the bologna incident'. Apparently, Justin came downstairs one day to find that his motorcycle had been covered in slices of bologna (Italian sausage to you and I), and Jen was convinced that the neighbours had done it. It almost seems too farfetched to be untrue, to be honest, but we'll let you make your own mind up.\n\nRead next Selena Gomez is bringing back the ‘Rachel’ cut Selena Gomez Selena Gomez is bringing back the ‘Rachel’ cut Alexa, play the Friends theme song.\n\nDespite their differences, the couple really wanted it to work. The source concluded,\n\n\"She just never really could get settled in, she wasn't happy [in New York]. They really were a great couple. And they cared a lot about each other. Justin was always really protective of her. They both wanted this to work.\"\n\nHere's a look back on their relationship...\n\nTheir meeting\n\nAfter her five-year marriage ended to Brad Pitt in 2005, Jennifer Aniston became the poster girl for single women everywhere.\n\nShe dated several high profile celebrities including Vince Vaughn, Paul Sculfor, John Mayer and Bradley Cooper and finally found love again falling for Justin Theroux.\n\nRead next Ummmm, is Timothée Chalamet going to be in the Friends reboot?! Jennifer Aniston Ummmm, is Timothée Chalamet going to be in the Friends reboot?! Nostalgic.\n\nThe pair met in 2007 on the set of Tropic Thunder, which Justin co-wrote with Jen's close friend, Ben Stiller. Nothing happened for three years although she admitted even then he had made an impression on her.\n\nShe told Popsugar: \"I thought he was very sweet and he was always very nice.\"\n\n\"But I remember thinking he was very dark. At first, you think he could be like a serial killer, but he is actually the nicest person in the world.\"\n\nSecond chance\n\nThe pair got a second shot at romance when they were filming Wanderlust in 2010 together. Justin was still dating stylist Heidi Bivens but the pair became good friends.\n\nThey were spotted together in May 2011 before they took their relationship public in June at the MTV Movie Awards afterparty.\n\nRead next Why, sixteen years since it left our screens, are we still so obsessed with Friends? Friends Why, sixteen years since it left our screens, are we still so obsessed with Friends? Our TV prayers have been answered, and the most famous friends in history is getting back together.\n\nJustin was the first person Jennifer had dated seriously since John Mayer in 2009.\n\nThe proposal\n\nJennifer Aniston and Justin Theroux got engaged during a romantic break to Rome.\n\nA rep for Theroux revealed that the screenwriter and actor popped the question to the Friends star on his 41st birthday.\n\nSpeaking to People, his publicist said: \"Justin Theroux had an amazing birthday on Friday, receiving an extraordinary gift when his girlfriend, Jennifer Aniston, accepted his proposal of marriage.\"\n\nSpeaking about the interest in his new fiancee's love life, Justin said: \"I understand the curiosity [about me and Jen], but other than saying I am happy, I am not going to indulge it.\"\n\nRead next OMG! Jennifer Aniston and Courteney Cox look like actual twins in this photo Friends OMG! Jennifer Aniston and Courteney Cox look like actual twins in this photo Uncanny.\n\nBradley Cooper congratulated Jen Jennifer Aniston following her engagement to Justin Theroux. The actor, who dated Jen briefly in the summer of 2009, was asked about the news and said: \"That's awesome!\"\n\nThe wedding\n\nJennifer Aniston and Justin Theroux got married in August 2015.\n\nAccording to People, they exchanged vows in front of more than 70 family members and friends at their Bel-Air, California, home.\n\nHoward Stern revealed that the couple's pal Jimmy Kimmel officiated and that most of the people attending thought that it was a party for Justin's 44th birthday.\n\nSecurity at the event was stringent, with guests asked to hand in their phones.\n\nRead next Fabulous at 51: Here are the beauty and wellness tips Jennifer Aniston swears by Jennifer Aniston Fabulous at 51: Here are the beauty and wellness tips Jennifer Aniston swears by Benjamin Button or Jennifer Aniston?\n\nHe joked: \"Why can't I have my cell phone? I don't want to take a picture of you two! I really don't. I want my cell phone so after I make this speech I can call my car and get the fuck outta here!\"\n\nThe DJ also revealed that there was a table with \"little tiny chairs\".\n\n\"There was a table, and then you sit down and the chairs were like poufs, like little pillow pouf. I'm 6-foot-fucking-5! I'm a grown man!\"\n\nBut the DJ said he had enjoyed himself and that Kimmel did \"a beautiful job\" officiating and Sia performed.\n\nFor the celebration, a large wooden deck was set up in the couple's back garden, filled with cozy little spaces for lounging as well as elegant seating arrangements.\n\nRead next Yes, he made mistakes. And yes, she's a strong independent woman. But it's not 'anti-feminist' if Jen decides she does want to get back with Brad Feminism Yes, he made mistakes. And yes, she's a strong independent woman. But it's not 'anti-feminist' if Jen decides she does want to get back with Brad BREAKING: It can be okay to forgive an ex.\n\nAniston's best friend Courteney Cox served as the actress's maid of honour, while the groom's pal Scott Campbell was the best man at the service in Bel-Air.\n\nCampbell is a tattoo artist, who has given Theroux a number of inkings and is married to actress Lake Bell.\n\nLots of their celeb friends arrived to celebrate their big day; Lisa Kudrow, Chelsea Handler, Orlando Bloom, Ellen DeGeneres, Portia de Rossi and Whitney Cummings. Courteney Cox was apparently the last to leave the event, partying with the couple until 3am.\n\nBut two surprising names were left off the guestlist, Jennifer's Friends co-stars, Matt LeBlanc and Matthew Perry.\n\nRex Features\n\nRead next All the old, romantic photos that prove Brad and Jen should most definitely get back together Jennifer Aniston All the old, romantic photos that prove Brad and Jen should most definitely get back together Prepare to feel v. warm and fuzzy.\n\n\"I think they're a great couple. I think she's happy. And that's all I care about is that Jen's happy,\" Matt, 48, told People magazine at a Television Critics Association press event in Los Angeles. \"If she wanted me there, I would have been there.\"\n\nLeBlanc, who was promoting his TV show Episodes, said he wasn't disappointed not to get an invitation, even though it meant missing her big day for a second time.\n\n\"I missed when she married Brad [Pitt],\" he said. \"I was in Austria working. She called me, and she was like, 'You're really not coming to my wedding?' And I was like, 'I asked them if they could change the schedule. I would fly and clap and fly out.' And they said, 'We can't do it. It's too tight.' It was a small-budget movie in Austria you've never heard of. Probably should have left anyway, but shit happens. What are you going to do?\"\n\nThe magazine also spoke to Matthew Perry, 45, who wished the couple well, and said he was happy the couple was able to pull off the surprise wedding.\n\n\"It was a surprise to me as well,\" he said. \"They're a lovely couple, and I'm happy for them.\"\n\nAsked if he was sorry he missed the wedding, he replied: \"I wasn't invited. So what can you do?\"\n\nThe Honeymoon\n\nThe couple honeymooned at the Four Seasons in Bora Bora with a few of their celebrity friends.\n\n\"It was a fantastic honeymoon,\" Theroux gushed. \"We had thought about it - we could just do a normal honeymoon, or we could go with some friends, keep the party going, relax, and have fun. It was really special, it was really beautiful.\"\n\nThe constant Brangelina drama\n\nThe Girl On The Train star won the best husband award for jumping to his wife's defence for having to deal with the endless rumours about her ex, Brad Pitt, describing her as \"bad ass\".\n\nAdvertisement\n\nRex Features\n\nHe said: \"She has lived through a lot of bullshit. Many people would have crumbled under some of the stresses that have been put on her. I'm very proud of her for that, for the way she handles herself.\"", "images": ["https://gl-images.condecdn.net/image/R7y3RMm1bny/crop/200/square/f/shutterstock_editorial_10550543bi_l.jpg", "https://gl-images.condecdn.net/image/zjaDx0QanOA/crop/200/square/f/Jennifer-Aniston2_glamour_21jan15_getty_b.jpg", "https://gl-images.condecdn.net/image/4rqQV4P1JRB/crop/200/square/f/gettyimages-1203452771_p_sf.jpg", "https://gl-images.condecdn.net/image/vPKPNj5j4Vj/crop/200/square/f/gettyimages-969524194_sf_sq.jpg", "https://gl-images.condecdn.net/image/9rQ7PG31Yjw/crop/200/square/f/img_3929.jpg", "https://gl-images.condecdn.net/image/QONpywwDnYj/crop/200/square/f/emily.jpg", "https://gl-images.condecdn.net/image/pJxr6wx1VVa/crop/200/square/f/00241319_52ac95d6_sq.jpg", "http://www.glamourmagazine.co.uk/static/img/tiny.gif", "https://gl-images.condecdn.net/image/nMEOVyj5wRD/crop/200/square/f/untitled-1_sf.jpg", "https://gl-images.condecdn.net/image/gLnOaq9dzWo/crop/405/f/jennifer-aniston-justin-glamour-9aug16-rex-b.jpg", "https://gl-images.condecdn.net/image/66ZwMA2rA5n/crop/200/square/f/gettyimages-140949809_p_sf_sq.jpg", "https://gl-images.condecdn.net/image/kbBmBZ6Qd8L/crop/1440/0.5235602094240838/f/brad-pitt-jen-an_glamour_2mar17_gettyimages_sq.jpg", "https://gl-images.condecdn.net/image/l4KeVOnbLPq/crop/200/square/f/gettyimages-536165370_sf_sq.jpg", "https://gl-images.condecdn.net/image/ArDd4X6jj4M/crop/200/square/f/justinbieber_sq.jpg", "https://gl-images.condecdn.net/image/3AGOnQM8QMa/crop/200/square/f/gettyimages-1199756716_p_sf.jpg", "https://gl-images.condecdn.net/image/eQVpzbRYveX/crop/200/square/f/jenniferaniston_glamour_23may18_gettyimages-950087470_hero.jpg", "https://gl-images.condecdn.net/image/QvwLLZL1wK8/crop/405/f/jennifer-anniston-and-justin_glamour_6apr17_gettyimages_p.jpg", "https://gl-images.condecdn.net/image/M8LVlBBeam7/crop/405/f/justin-theroux-gl-16feb18_getty_b.jpg", "https://gl-images.condecdn.net/image/7EWJoMpQBzp/crop/200/square/f/hair_and_body_group_shot_high_res_sf.jpg", "https://gl-images.condecdn.net/image/PGpYMxB0OPl/crop/200/square/f/gettyimages-75502265_sf_sq.jpg", "https://gl-images.condecdn.net/image/GpmnQxvmAvN/crop/200/square/f/Jennifer-Aniston_glamour_21jan15_rex_b.jpg", "https://gl-images.condecdn.net/image/D6Wonm4mdz7/crop/200/square/f/image002_p_sq.jpg", "https://gl-images.condecdn.net/image/gWZ0VPkRyzY/crop/405/f/Matt-LeBlanc-and-Matthew-Perry-_glamour_12aug15_rex_b.jpg", "https://gl-images.condecdn.net/image/BJmGdqjMB5P/crop/200/square/f/gettyimages-1155292762_p_sf.jpg", "https://gl-images.condecdn.net/image/JzoBwLklmeZ/crop/200/square/f/Jennifer-Aniston1_glamour_21jan15_rex_b.jpg", "https://gl-images.condecdn.net/image/3Q0vJNMlD98/crop/405/f/brad-pitt-and-jennifer-aniston-gl-16feb18_getty_b.jpg"], "top_img": "https://gl-images.condecdn.net/image/kbBmBZ6Qd8L/crop/1440/0.5235602094240838/f/brad-pitt-jen-an_glamour_2mar17_gettyimages_sq.jpg", "keywords": [], "authors": ["Samantha Mcmeekin", "Sunday February"], "canonical_link": "https://www.glamourmagazine.co.uk/article/jennifer-aniston-justin-theroux-engaged", "title": "Jennifer Aniston denies Brad Pitt rumours following her split with Justin Theroux", "meta_data": {"description": "Justin Theroux and Jennifer Aniston are getting a divorce after two and a half years of marriage. Find out more on GLAMOUR.", "GENERATOR": "Macromedia Dreamweaver", "viewport": "width=device-width, initial-scale=1", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Glamour UK", "apple-mobile-web-app-status-bar-style": "translucent black", "application-name": "Glamour UK", "og": {"site_name": "Glamour UK", "locale": "en_GB", "title": "Jennifer Aniston denies Brad Pitt rumours following her split with Justin Theroux", "url": "https://www.glamourmagazine.co.uk/article/jennifer-aniston-justin-theroux-engaged", "type": "article", "article": {"publisher": 103165711773}, "description": "So everyone can just leave it alone now.", "image": "https://gl-images.condecdn.net/image/kbBmBZ6Qd8L/crop/1440/0.5235602094240838/f/brad-pitt-jen-an_glamour_2mar17_gettyimages_sq.jpg"}, "fb": {"app_id": 589577624418454, "pages": 103165711773}, "twitter": {"site": "@GlamourMagUK", "account_id": 34258758, "title": "Jennifer Aniston denies Brad Pitt rumours following her split with Justin Theroux", "card": "summary_large_image", "description": "So everyone can just leave it alone now.", "image": "https://gl-images.condecdn.net/image/kbBmBZ6Qd8L/crop/810/landscape/f/brad-pitt-jen-an_glamour_2mar17_gettyimages_sq.jpg"}, "theme-color": "#000", "article": {"section": "Jennifer Aniston", "tag": "Jennifer Aniston,Celebrity Splits,Celebrity Divorces,Justin Theroux,Celebrity Weddings,Celebrity Engagement,Entertainment,News"}, "author": "Samantha McMeekin", "snippet": {"image": "https://gl-images.condecdn.net/image/kbBmBZ6Qd8L/crop/405/0.75/f/brad-pitt-jen-an_glamour_2mar17_gettyimages_sq.jpg"}}, "movies": [], "publish_date": null, "source": "http://www.glamourmagazine.co.uk", "summary": ""}