{"url": "https://www.bustle.com/p/how-todd-kraines-really-feels-about-being-the-guy-behind-scott-disicks-infamous-kuwtk-prank-2453286", "text": "\"Auntie Kris! It's me, Todd Kraines!\" A goofy voice, prank calls, and Scott Disick have all become associated with that exact catchphrase. Keeping Up With The Kardashians fans will never forget Disick's Todd Kraines prank, as the ongoing joke cemented its place in reality TV history. And in honor of the 10-year anniversary of KUWTK, Bustle caught up with the real Todd Kraines, and as it turns out, Disick's cringe-inducing impression is actually dead wrong.\n\n\"The whole thing was a lot of fun,\" Kraines says when we speak on the phone in late September. He reflects on the ongoing KUWTK saga wherein Disick repeatedly called Kris Jenner pretending to be him, but apparently, Kraines didn't really love this long-running prank at the time. \"I'm a team player, so it's just like OK, I'll go in on this with you guys... But during the time, it needs to be known, it was not fun. It was a little unnerving,\" he says.\n\nAs it turns out, the Beverly Hills real estate agent was not in on the joke. \"It's funny for other people, but for me, it really wasn't that funny,\" Kraines says. \"It wasn't. It was just like, is this for real? Is this really happening? People like this? So it was like an out-of-body experience. I didn't know what to think or feel or what. All of a sudden, I've become this practical joke.\"\n\nWhile Kraines is a family friend of the Kardashians (his dad was best friends with the late Robert Kardashian and his mom still is buds with Kris), he didn't understand why Kris would have any reason to be calling him.\n\nE! Entertainment on YouTube\n\n\"When it was going on, I had no idea, and the fact that Kris was calling me, 'Is this you? Are you doing this?' I'm like, what are you talking about?\" he recalls. \"I got kind of nervous, because it kept going on for six months. I was like, do we need to call the feds? What guy is using my name?\"\n\nAs fans of the E! series know, no one actually stole Kraines' identity, unless you count Disick and then-girlfriend Kourtney Kardashian playing an innocent joke on the world's most famous momager. Luckily, Kraines soon got caught up to speed, and even went on a ski trip to Vail with the famous fam — giving the real Kraines some screen time on KUWTK.\n\nFinally, fans got more insight into who the real Kraines was, beyond Disick's impression. But if it wasn't until that Season 12 KUWTK episode that you realized Kraines, you know, is an actual person, don't feel too bad. It turns out you're not the only one.\n\n\"[Scott] didn't know I was real either, by the way,\" offers Kraines. \"That's the funny part. He had no idea. He didn't know who the hell I was.\"\n\nDespite Lord Disick's obliviousness, someone else was much more in the loop. \"[Scott] went along with what Kourtney was telling him what to do. So I blame Kourtney for this whole thing,\" he says with a laugh.\n\nE! Entertainment on YouTube\n\nBut the whole prank might have been worth it, since Kraines got to make a cameo on the family's show and spend quality time with them. And interestingly enough, the episode Kraines was in took place the day the family found out Rob Kardashian and Blac Chyna got engaged. \"Behind the scenes, obviously we were talking about the engagement and how bananas that was,\" Kraines recalls. \"And [Rob] was supposed to come on the trip and he didn't, and now we know why.\"\n\nOutside of his moments with the Karadashians, Kraines is, well, a real person. \"I sell real estate in Beverly Hills ... Like, you know, I hustle, I do my thing. I'm as real as it gets,\" he says. And just like the Kardashians, he shares more insight into his life on Twitter. He also occasionally posts selfies with Kris on his Instagram — and what's better than that?\n\nAt the end of the day, Kraines has nothing but love for the family that pushed his name into faux-notoriety. \"They're not bad people. They're not. You might think they do things to get attention or whatever, but that's what they do. That's their job,\" Kraines says of the Kardashian-Jenners, adding that anyone who says they're not talented is so wrong. \"I think people should respect that aspect of them, and the people that don't are just going to be haters regardless. So screw 'em.\"\n\nAnd when it comes to Disick, Kraines suggests that, based on his time filming his Keeping up With The Kardashians episode, fans may be totally misunderstanding Mason, Penelope, and Reign's dad. \"It was nice to see Scott with the kids, just being a dad. I don't think that gets portrayed very well, to be honest with you,\" he says, with the caveat that his experience happened before Disick and Kourtney split. \"I don't know where it is today... obviously [Kourtney and Scott are] not together. But he was there and we had fun... He's the father. It was nice to see him being that and showing up\"\n\nThroughout 14 seasons of Keeping Up With The Kardashians, the Kraines prank remains in fans' hearts. And eventually, the guy behind the joke has come to accept that. Sure, he might not speak to the Kardashians all the time, but doesn't take away from their bond. \"Am I friends with them today? Yes. Do I talk to them all the time? No. But if we wanted to talk, yes. They're in a different world — in a good way,\" he says.\n\nAnd perhaps, someday, he might even take a page out of their book — \"I'm a pretty big personality myself. So maybe they'll do a Todd Kraines show,\" he jokes. Given the reaction fans had to him popping up at the end of the KUWTK 10-year anniversary special, that may not be a bad idea.", "images": ["https://imgix.bustle.com/uploads/image/2017/9/26/4721958d-f2b5-48fc-bdca-f487d4a35045-screen-shot-2017-09-26-at-45207-pm.png?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/3/31/a7928c7e-1a2f-4eeb-a14a-3e6922cfdb43-getty-1094762134.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/3/194ae6f8-bcef-4f14-b94e-ad8aa42bad93-getty-1181741946.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/1/58c1a92f-54bc-4064-9ab9-38ee62d2cd4b-screen-shot-2020-04-01-at-114400-am.png?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/4/143448e3-4aad-4671-9733-857842778d0d-getty-1094888054.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2017/9/26/4721958d-f2b5-48fc-bdca-f487d4a35045-screen-shot-2017-09-26-at-45207-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2017/9/26/4721958d-f2b5-48fc-bdca-f487d4a35045-screen-shot-2017-09-26-at-45207-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/how-todd-kraines-really-feels-about-being-the-guy-behind-scott-disicks-infamous-kuwtk-prank-2453286", "title": "How Todd Kraines Really Feels About Being The Guy Behind Scott Disick's Infamous 'KUWTK' Prank", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/how-todd-kraines-really-feels-about-being-the-guy-behind-scott-disicks-infamous-kuwtk-prank-2453286", "type": "article", "title": "Here's What The Real Todd Kraines Officially Thinks Of That Infamous Scott Disick Prank", "description": "\"Auntie Kris! It's me, Todd Kraines!\" A goofy voice, prank calls, and Scott Disick have all become associated with that exact catchphrase. Keeping Up With The Kardashians fans will never forget Disick's Todd Kraines prank, as the ongoing joke…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2017/9/26/4721958d-f2b5-48fc-bdca-f487d4a35045-screen-shot-2017-09-26-at-45207-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "\"Auntie Kris! It's me, Todd Kraines!\" A goofy voice, prank calls, and Scott Disick have all become associated with that exact catchphrase. Keeping Up With The Kardashians fans will never forget Disick's Todd Kraines prank, as the ongoing joke…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}