{"url": "https://people.com/music/enrique-iglesias-anna-kournikova-inside-private-relationship/", "text": "Enrique Iglesias and Anna Kournikova have been so secretive about their relationship that fans have often wondered if they’re even still together.\n\nBut on Monday, the couple put any split rumors to rest after news broke they reportedly welcomed twins — a boy and a girl — over the weekend.\n\nGet push notifications with news, features and more.\n\nHere’s a look back at their private romance:\n\n2001\n\nThe singer, 42, and the former tennis pro, 36, first met when she starred in her future boyfriend’s sexy music video for “Escape.” Sparks flew on set and they began dating shortly after shooting the video, which features Kournikova initially rebuffing his advances. The duo later make out and get hands-y in the bathroom on the sink.\n\n2002\n\nThe couple weren’t always so secretive about their relationship. After making their official debut as a couple on the red carpet of the MTV Video Music Awards in 2002, they also coupled up a year later at the Once Upon a Time in Mexico premiere in New York City.\n\nImage zoom Anna Kournikova and Enrique Iglesias Bill Davila/FilmMagic\n\nIn true turn of the century fashion, Kournikova showed off rock-hard abs in an all-white belly-baring ensemble with strappy heels while Enrique wore distressed flared denim jeans and a black dress shirt paired with a T-shirt.\n\n2004\n\nThe rumor mill went into overdrive about a possible engagement — or wedding — when Kournikova stepped onto the court at the World Team Tennis match with a blindingly large pink diamond ring on her ring finger. She later sported a simple band while out and about.\n\nImage zoom Anna Kournikova Jason Squires/WireImage\n\nReports circulated the duo had wed in a secret ceremony in Puerto Vallarta, but sources told PEOPLE at the time the rumors were false.\n\n2006 – 2012\n\nThe pair appeared to be going strong for nearly a decade.\n\nIn 2006, they sat front and center at the Cleveland Cavaliers vs. Miami Heat game in Miami, posed for photos at Big Pink restaurant and capped off the year with a date at Mauro’s Cafe in December.\n\nImage zoom Enrique Iglesias and Anna Kournikova Issac Baldizon/NBAE/Getty\n\nAnd the next year, Kournikova was photographed goofing around in a bikini with Iglesias while they prepared to board a boat in Miami. In December, they jetted to London and once again fueled wedding rumors when Kournikova was snapped with yet another plain band on her ring finger.\n\nIglesias fueled breakup rumors when he told a Swedish newspaper that the duo had been secretly married but were “now” divorced. “We’re divorced. I am single now, but that’s okay,” he told Aftonbladet. “I don’t mind being alone.”\n\nHowever, a Kournikova pal told PEOPLE Iglesias was joking, and his rep also confirmed the duo were “still together.”\n\nIn 2008, Kournikova told PEOPLE she was “never getting married” but added that “everything is good” between her and Iglesias. Days later, the singer told reporters he had been trying to get his girlfriend to marry him for years. “I always try, but she pays me no attention,” he said as he arrived in the Dominican Republic for a series of concerts.\n\nThough they didn’t attend many public events together for the rest of the decade, the duo were photographed going on dinner dates and vacationing in St. Barts.\n\nThe former tennis champ also opened up about hopefully becoming a mother in the future in a 2011 interview with Women’s Health. “I absolutely want to have children, whether I have my own or adopt,” she told the mag. “I love taking care of people.”\n\nIn a 2012 interview with Parade, Iglesias reiterated the duo had no plans to wed. “I’ve never really thought marriage would make a difference,” he told the outlet. “Maybe it’s because I come from divorced parents, but I don’t think you love somebody more because of a piece of paper.”\n\n2013 – 2014\n\nIn late 2013, reports surfaced that the longtime couple had called it quits. But after the new year, they were photographed spending quality time together on a boat in Miami.\n\nThen in 2014, Iglesias shocked fans by again claiming he and Kournikova had divorced. “I got a divorce three days ago and I wanted to give you guys the exclusive. I’m serious. No, seriously. Don’t laugh,” he told reporters ahead of a performance at the Staples Center that October.\n\n2016\n\nKournikova proved all was well in 2016 when she posted a photo of her and Iglesias with her brother Allan on her Instagram account.\n\nOver the last few years, Kournikova also began sporting another massive ring — perhaps a yellow diamond? — complete with a matching diamond band.\n\n2017\n\nSixteen years after they first met, Iglesias and Kournikova reportedly became parents over the weekend. According to TMZ, the couple welcomed a boy and a girl named Nicholas and Lucy. Reps for the musician and athlete did not immediately return PEOPLE’s request for comment.\n\n“I think she’d be a perfect mother,” Iglesias once told PEOPLE en Español in 2007.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fenrique-iglesias-11-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fenrique-iglesias-21-1.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fenrique-iglesias-3.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fanna-kournikovia-1-2000.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fenrique-iglesias-3.jpg", "keywords": [], "authors": ["Melody Chiu"], "canonical_link": "https://people.com/music/enrique-iglesias-anna-kournikova-inside-private-relationship/", "title": "Enrique Iglesias and Anna Kournikova: Inside Their Relationship", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Anna Kournikova,Couples,Enrique Iglesias,Music News,News,Twins", "news_keywords": "Anna Kournikova,Couples,Enrique Iglesias,Music News,News,Twins", "description": "From meeting on set of Iglesias' steamy music video to reportedly welcoming twins, here's a look back at the singer and the former tennis pro's relationship", "og": {"title": "Enrique Iglesias and Anna Kournikova: Inside Their Relationship", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/music/enrique-iglesias-anna-kournikova-inside-private-relationship/", "description": "Enrique Iglesias and Anna Kournikova have been so secretive about their relationship that fans have often wondered if they’re even still together. But on Monday,&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fenrique-iglesias-3.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/music/enrique-iglesias-anna-kournikova-inside-private-relationship/", "description": "From meeting on set of Iglesias' steamy music video to reportedly welcoming twins, here's a look back at the singer and the former tennis pro's relationship", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fenrique-iglesias-3.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/music/enrique-iglesias-anna-kournikova-inside-private-relationship/", "title": "Enrique Iglesias and Anna Kournikova: Inside Their Relationship", "description": "From meeting on set of Iglesias' steamy music video to reportedly welcoming twins, here's a look back at the singer and the former tennis pro's relationship", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fenrique-iglesias-3.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": ["https://www.youtube.com/embed/9mQJaXwGPlg"], "publish_date": null, "source": "https://people.com", "summary": ""}