{"url": "https://www.amazon.com/gp/video/detail/B078HF8KHB", "text": "Like Johnny Appleseed, Annie Oakley, and possibly Harry Houdini, P.T. Barnum has become less a figure of history than a giant of American popular folklore. And since Barnum himself never pretended to possess more than a passing relationship with the truth, it’s richly appropriate that “The Greatest Showman,” the new movie which uses as its foundation the life of the father of the circus, does not even bother to use the usual opening gambit, “based on a true story.” Because it rarely is.\n\n\n\nInstead, before the opening credits even hit the screen the movie throws the audience by the seat of its pants into the most foot-stomping, pulse-pounding, show-stopping entertainment since the circus came to town. The picture grabs the viewer by his nose and doesn’t let go from the first frame of film until the last. And after the show is over, the viewer leaves with a song in his heart, a smile on his face, a spring in his step, and a tear in his eye.\n\n\n\n“The Greatest Showman” follows the tried-and-true formula of Horatio Alger and dozens of motion pictures biographies, from “Rhapsody in Blue” to “Night and Day” to “Yankee Doodle Dandy”: Through hard work and dedication, the hero rises from poverty to the pinnacle of success, falters for a moment, and then through faith and love achieves an even more lofty and soul-satisfying conclusion.\n\n\n\nBut “The Greatest Showman” continues the hallowed entertainment tradition to the beat of a percussive and pounding drum-driven hip-hop tempo of street music, accompanied by the most jaw-dropping breakdance moves you’ll ever see in an ensemble performance.\n\n\n\nDuring the opening scene the world explodes into a panorama of vivid colors embracing in its entirety the world of the circus—flying acrobats, prancing horses, fire-breathers, elephants, and clowns. When the song ends, it’s all you can do to stop yourself from jumping to your feet to applaud. And then the movie tops itself, over and over and over again.\n\n\n\nAnyone who’s seen Hugh Jackman appearing on an interview show—and he’s doing a lot of them in support of this movie—knows that his signature role as the caustic and violent Wolverine in eight “X-Men” movies are the real stretch for the actor.\n\n\n\nThe very definition of the term “amiable bloke,” the Australian Jackman at heart is a song-and-dance man. And in “The Greatest Showman” Jackman proves it—the actor whirls, jumps, kicks, cakewalks, and struts with such loose-limbed dexterity that he often seems immune to laws of gravity.\n\n\n\nMatching Jackman almost step-by-step, scene-by-scene, and note-by-note are a talented array of supporting performers, including Zac Efron as a highbrow New York playwright persuaded by Barnum to join the circus as a means of broadening the show’s appeal, and the platinum-selling pop star Zendaya as the trapeze artist Efron falls for. One highlight among many in the picture is the ballad “Rewrite the Stars,” performed by Zendaya and Efron in a sort of aerial ballet courting ritual under the big top.\n\n\n\nLikewise, the exotic Keala Settle, playing the bearded lady among the uniquely-gifted and physically distinctive show people recruited by Barnum to star in his “Greatest Show,” provides much of the heart and soul of the movie. Settle’s performance of “This is Me” adds real spirit to an anthem for the heartbreaking loneliness of individuality, and the empowerment found in accepting yourself as you are.\n\n\n\nThe gifted Michelle Williams is as adorable as usual as Barnum’s patient wife, Charity, and the Swedish actress Rebecca Ferguson adds European flavor as opera star Jenny Lind, persuaded by impresario Barnum to undertake a series of US concerts under his tutelage in a bid to gain acceptance among the more rarefied echelons of society.\n\n\n\nSurprisingly, “The Greatest Showman” is receiving mixed reviews from some of the country’s more influential critics. Some are turning up their collective noses at the movie’s “soupy soulfulness” and shallow, populist aspirations.\n\n\n\nBut the picture in its depiction of the contentious “friendly enemy” relationship between Barnum and newspaper critic James Gordon Bennett seems to anticipate the unflattering reviews. When Barnum is confronted with the challenge that everything connected with his show is “fake,” Barnum points to the circus’ audience and smilingly replies, “Those smiles seem real enough.” And you know what? He’s right.\n\n\n\nWritten by Jenny Bicks and Bill Condon and guided to the screen by first-time director Michael Gracey, “The Greatest Showman” steps up to the plate and bats a grand slam home run in just about every single department. And with a dozen or so rousing, showstopping songs courtesy of Benj Pasek and Justin Paul, the Academy Award-winning lyricists from last year’s “La La Land,” the viewer might even want to stop on the way home after the movie to pick up a copy of the soundtrack album.\n\n\n\n“The Greatest Showman” is superb motion picture entertainment in the tradition of the great Hollywood musicals, and as close as we’re likely to get to a Broadway experience simulated in a movie auditorium. There’s real movie magic at work here: This is one picture packed with an ingredient rarely found in films these days—it’s spelled J-O-Y, and it has a big exclamation point at the end.\n\n\n\nThere’s a lot of competition out there for your family entertainment dollar during this holiday season. If you can only see one movie this month, “The Greatest Showman” is the choice you want to make. Any movie which depicts a father riding to his daughter’s musical recital on a dancing elephant is doing something awfully right.\n\n\n\nThe highest praise—P.T. Barnum would love this picture. And so will you.", "images": ["https://images-na.ssl-images-amazon.com/images/S/sgp-catalog-images/region_US/disney-12559_OV-Full-Image_GalleryCover-en-US-1567697415146._UR1920,1080_RI_SX329_.jpg", "https://images-na.ssl-images-amazon.com/images/S/sgp-catalog-images/region_US/nbcu-0AA20-Full-Image_GalleryCover-en-US-1477071828668._UR1920,1080_RI_SX329_.jpg", "https://images-na.ssl-images-amazon.com/images/S/sgp-catalog-images/region_US/sphe-2249256-Full-Image_GalleryCover-en-US-1542835757965._UR1920,1080_RI_SX329_.jpg", "https://images-na.ssl-images-amazon.com/images/S/sgp-catalog-images/region_US/CNBC-05706-Full-Image_GalleryCover-en-US-1469821382430._UR1920,1080_RI_SX329_.jpg", "https://images-na.ssl-images-amazon.com/images/S/sgp-catalog-images/region_US/nbcu-05670-Full-Image_GalleryCover-en-US-1484000125737._UR1920,1080_RI_SX329_.jpg", "https://images-fe.ssl-images-amazon.com/images/S/amazon-avatars-global/ddcd3983-d38a-4f69-88b0-cb59cfe219b6._CR0,0,385,385_SX48_.jpg", "https://images-na.ssl-images-amazon.com/images/S/sgp-catalog-images/region_US/SPHE-11051336-Full-Image_GalleryCover-en-US-1581396326831._UR1920,1080_RI_SX329_.jpg", "https://images-na.ssl-images-amazon.com/images/S/sgp-catalog-images/region_US/nbcu-02495-Full-Image_GalleryCover-en-US-1539818391424._UR1920,1080_RI_SX329_.jpg", "https://images-na.ssl-images-amazon.com/images/S/sgp-catalog-images/region_US/nbcu-02480-Full-Image_GalleryCover-en-US-1519251866890._UR1920,1080_RI_SX329_.jpg", "https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png", "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars/6562fe6e-48d1-4bfa-95ef-944b095fa5f7._CR41,0,237,237_SX48_.jpg", "https://images-na.ssl-images-amazon.com/images/I/71Aejbg8eDL._SY88.jpg", "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/b877e152-7a65-41c8-988a-efa6adaf9a3c._CR0,0,500,500_SX48_.jpg", "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/eb3e80f5-2296-4452-a878-1dfefd33c041._CR109,0,281,281_SX48_.jpg", "https://images-na.ssl-images-amazon.com/images/I/71Of80hrKrL._SY88.jpg", "https://images-na.ssl-images-amazon.com/images/S/sgp-catalog-images/region_US/hbo_svod-14333-Full-Image_GalleryCover-en-US-1527636465152._UR1920,1080_RI_SX329_.jpg", "https://images-na.ssl-images-amazon.com/images/I/81CCjjhLdsL._UR300,300_BL99_UR987,555_CLa%7C987,555%7C81CCjjhLdsL.jpg%7C0,0,987,555+0,0,987,555_SX329_.jpg", "https://images-fe.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png", "https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/f3cea352-d96c-4f35-a5b6-10abc09419e8._CR0,207.0,955,955_SX48_.jpg", "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars/default._CR0,0,1024,1024_SX48_.png", "https://images-na.ssl-images-amazon.com/images/I/713yDPR86uL._SY88.jpg", "https://images-na.ssl-images-amazon.com/images/I/51C92LlTNsL._SY88.jpg", "https://images-na.ssl-images-amazon.com/images/S/sgp-catalog-images/region_US/disney-93773-Full-Image_GalleryCover-en-US-1578897454258._UR1920,1080_RI_SX329_.jpg", "https://images-na.ssl-images-amazon.com/images/G/01/gno/sprites/nav-sprite-global_bluebeacon-1x_optimized_layout1._CB468670774_.png", "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif", "https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/2ac832c4-056c-484a-b4a0-57453cc2ab59._CR62,0,375,375_SX48_.jpg", "https://images-na.ssl-images-amazon.com/images/I/71RsVkxnjDL._SY88.jpg", "https://images-na.ssl-images-amazon.com/images/S/sgp-catalog-images/region_US/fox-031264-Full-Image_GalleryBackground-en-US-1556295945992._SX1080_.jpg", "https://images-na.ssl-images-amazon.com/images/I/71CzMlW1mzL._SY88.jpg", "https://images-na.ssl-images-amazon.com/images/S/sgp-catalog-images/region_US/nbcu-10E27_UHD-Full-Image_GalleryCover-en-US-1586401184913._UR1920,1080_RI_SX329_.jpg", "https://fls-na.amazon.com/1/batch/1/OP/ATVPDKIKX0DER:147-9764006-1713508:RAGM3CVS866NRM96WW9A$uedata=s:%2Fgp%2Fvideo%2Fdetail%2FB078HF8KHB%2Fuedata%2Funsticky%2F147-9764006-1713508%2FVideo%2Fntpoffrw%3Fstaticb%26id%3DRAGM3CVS866NRM96WW9A%26pty%3DDetailAW%26spty%3DMovie%26pti%3DB06XYQGH7P:1000", "https://www.amazon.com/gp/video/detail/B078HF8KHB/uedata/unsticky/147-9764006-1713508/Video/ntpoffrw?noscript&id=RAGM3CVS866NRM96WW9A&pty=Detail&spty=Movie&pti=B078HF8KHB", "https://images-na.ssl-images-amazon.com/images/S/sgp-catalog-images/region_US/nbcu-61106623-Full-Image_GalleryCover-en-US-1484000544930._UR1920,1080_RI_SX329_.jpg", "https://fls-na.amazon.com/1/batch/1/OP/ATVPDKIKX0DER:147-9764006-1713508:RAGM3CVS866NRM96WW9A$uedata=s:%2Fgp%2Fvideo%2Fdetail%2FB078HF8KHB%2Fuedata%2Funsticky%2F147-9764006-1713508%2FVideo%2Fntpoffrw%3Fnoscript%26id%3DRAGM3CVS866NRM96WW9A%26pty%3DDetail%26spty%3DMovie%26pti%3DB078HF8KHB:2000"], "top_img": "https://images-na.ssl-images-amazon.com/images/S/sgp-catalog-images/region_US/fox-031264-Full-Image_GalleryBackground-en-US-1556295945992._SX1080_.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.amazon.com/Greatest-Showman-Hugh-Jackman/dp/B078HF8KHB", "title": "Amazon.com: Watch The Greatest Showman", "meta_data": {"description": "Hugh Jackman stars in this bold and original musical — inspired by the ambition and imagination of P.T. Barnum — celebrating the birth of show business and dreams coming to life.", "title": "Amazon.com: Watch The Greatest Showman | Prime Video", "keywords": "Michelle Williams, Hugh Jackman, Zac Efron, Rebecca Ferguson, Zendaya, Michael Gracey, Bill Condon, Jenny Bicks,The Greatest Showman"}, "movies": [], "publish_date": null, "source": "https://www.amazon.com", "summary": ""}