{"url": "https://variety.com/2017/tv/news/the-arrangement-season-2-interview-josh-henderson-christine-evangelista-jonathan-abrahams-1202614911/", "text": "The first season of E!’s Hollywood relationship drama “The Arrangement” ended with Megan (Christine Evangelista) emerging from the Institute of the Higher Mind presumably “reprogrammed” but actually just faking it and instead vowing to “burn it down.” When the show returns for its second season, Megan will still want to keep up the ruse so she can keep her relationship with Kyle (Josh Henderson), but that relationship is going to get a lot more complicated.\n\n“One of the lines we’re exploring this season is when you’re coming from a place of anger and revenge, how sustainable is that?,” creator Jonathan Abrahams tells Variety. “It’s so much about emotion and passion in that world, and there’s so much emotion and passion between Megan and Kyle, but how sustainable is that? For a while that’s the thing that’s worth fighting for, but then you have to ask if you can ever get back to that.”\n\nWhile Megan and Kyle are moving forward in their relationship — and contract — by planning a wedding, Evangelista says the “honeymoon phase” of their relationship is over, and now they are faced with questions of trust and whether or not the fantasy can withstand time.\n\nThere’s also the question of whose vision this wedding truly is, given that it was just one of many milestones she promised to mark when she signed the relationship agreement in the first place.\n\n“It’s not Megan’s vision, it’s not Kyle’s vision, it’s something else,” Evangelista says. “There’s always this other force around them, so it’s this young girl having incredible moments, something she’s fantasized about her whole life, and it’s out of her control in a lot of ways. It’s very stressful, and coming into this season the stakes are very high but the consequences are even higher.”\n\nA throughline for the season, says Evangelista, is whether or not Megan and Kyle’s relationship is strong enough to convince him of the truth behind the Institute, and Henderson points out that Kyle “really wants the relationship to survive” because he “truly does love Megan.”\n\nBut further complicating things is the fact that Megan and Kyle are also embarking upon a professional project together — a movie she will star in that he will direct. Because it’s the first project Kyle is directing “it’s a big deal for him, so he kind of obsesses about it,” says Henderson.\n\nThe show’s second season will also explore who Kyle was in the past to understand more about him, including his relationship with Lisbeth (Ashley Hinshaw) and Terrence (Michael Vartan).\n\n“It’s a deep dive into Kyle West,” Abrahams says. “We’re going to learn a lot, not just about Kyle but also Terrence and their relationship — so much more of why his life has the strange elements in it that it does.”\n\nHenderson adds that in getting to know Kyle, the audience will see “he’s got a lot of guilt” and “demons” that he’s trying to work through.\n\n“He wants to be happy and right some wrongs, and he’s tired of hiding things. He and Megan have some pretty eye-opening, groundbreaking moments between them, and it’s a big journey for him this year to decide if Terrence and the Institute really have his best interest at heart and if it’s the best thing for him,” Henderson says.\n\nKyle has had his own doubts about the organization, he says, but thus far he has needed it because of his “intense” relationship with Terrence.\n\nBut as the couple marches toward their marriage, they will be re-evaluating the other relationships they see around them. “There’s a cool episode where we juxtapose the relationship [between Megan and Kyle, and Terrence and Deann] because they’re both arrangements in a way, but they’re in very different places,” Abrahams says.\n\nMegan and Kyle may even have to re-evaluate their own relationship beyond the professional obligation they made to each other, says Henderson. “There’s a lot of separation. There’s a lot of stuff going on with her, obviously, there’s a lot of stuff with me, and then we come back at the end of the day and we’re living together and there’s this interesting, kind of weird dynamic between us because there’s so many things not being said,” Henderson says.\n\n“The Arrangement” Season 2 premieres March 11 on E!", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://pmcvariety.files.wordpress.com/2017/11/nup_174905_0714.jpg?w=1000", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2017%2Ftv%2Fnews%2Fthe-arrangement-season-2-interview-josh-henderson-christine-evangelista-jonathan-abrahams-1202614911%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202614911", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2017/11/nup_174905_0714.jpg?w=1000", "keywords": [], "authors": ["Danielle Turchiano"], "canonical_link": "https://variety.com/2017/tv/news/the-arrangement-season-2-interview-josh-henderson-christine-evangelista-jonathan-abrahams-1202614911/", "title": "‘The Arrangement’ Team on Season 2’s Wedding Plans, Revenge, and a ‘Deep Dive’ into Kyle’s Past", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "\"The Arrancement\" creator and stars preview Season 2: a Hollywood wedding, Megan's plan to burn down the Institute, and Kyle's backstory.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202614911, "author": "Danielle Turchiano", "pmc-category": "Features,News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-11-15T11:00:49"}, "pmc-tag": "Christine Evangelista,Jonathan Abrahams,Josh Henderson,The Arrangement", "title": "‘The Arrangement’ Team on Season 2’s Wedding Plans, Revenge, and a ‘Deep Dive’ into Kyle’s Past", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "Features", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "‘The Arrangement’ Team on Season 2’s Wedding Plans, Revenge, and a ‘Deep Dive’ into Kyle’s Past", "url": "https://variety.com/2017/tv/news/the-arrangement-season-2-interview-josh-henderson-christine-evangelista-jonathan-abrahams-1202614911/", "description": "The first season of E!’s Hollywood relationship drama “The Arrangement” ended with Megan (Christine Evangelista) emerging from the Institute of the Higher Mind presumably “r…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/11/nup_174905_0714.jpg?w=1000", "width": 1000, "height": 667, "alt": "THE ARRANGEMENT -- Episode 101/102 -- Pictured: (l-r) Josh Henderson as Kyle West, Christine Evangelista as Megan Morrison -- (Photo by: Daniel Power/E! Entertainment)"}, "locale": "en_US"}, "article": {"published_time": "2017-11-15T19:00:49+00:00", "modified_time": "2017-11-15T19:00:50+00:00"}, "twitter": {"creator": "@https://twitter.com/danielletbd", "site": "@variety", "text": {"title": "‘The Arrangement’ Team on Season 2’s Wedding Plans, Revenge, and a ‘Deep Dive’ into Kyle’s Past"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/11/nup_174905_0714.jpg?w=1000", "alt": "THE ARRANGEMENT -- Episode 101/102 -- Pictured: (l-r) Josh Henderson as Kyle West, Christine Evangelista as Megan Morrison -- (Photo by: Daniel Power/E! Entertainment)"}, "card": "summary_large_image", "title": "‘The Arrangement’ Team on Season 2’s Wedding Plans, Revenge, and a ‘Deep Dive’ into Kyle’s Past", "description": "\"The Arrancement\" creator and stars preview Season 2: a Hollywood wedding, Megan's plan to burn down the Institute, and Kyle's backstory."}, "author": "Danielle Turchiano", "content_type": "Article", "post_id": 1202614911, "title": "'The Arrangement' Team on Season 2's Wedding Plans, Revenge, and a 'Deep Dive' into Kyle's Past", "published_at": "2017-11-15 11:00:49", "image": "https://pmcvariety.files.wordpress.com/2017/11/nup_174905_0714.jpg?w=1000", "comment_count": 0, "tags": "The Arrangement", "topics": "News", "appeared_in_print": "No", "body": "The first season of E!'s Hollywood relationship drama \"The Arrangement\" ended with Megan (Christine Evangelista) emerging from the Institute of the Higher Mind presumably \"reprogrammed\" but actually just faking it and instead vowing to \"burn it down.\" When the show returns for its second season, Megan will still want to keep up the ruse so she can keep her relationship with Kyle (Josh Henderson), but that relationship is going to get a lot more complicated.\r\n\r\n\"One of the lines we're exploring this season is when you're coming from a place of anger and revenge, how sustainable is that?,\" creator Jonathan Abrahams tells Variety. \"It's so much about emotion and passion in that world, and there's so much emotion and passion between Megan and Kyle, but how sustainable is that? For a while that's the thing that's worth fighting for, but then you have to ask if you can ever get back to that.\"\r\n\r\nWhile Megan and Kyle are moving forward in their relationship — and contract — by planning a wedding, Evangelista says the \"honeymoon phase\" of their relationship is over, and now they are faced with questions of trust and whether or not the fantasy can withstand time.\r\n\r\n\r\n\r\nThere's also the question of whose vision this wedding truly is, given that it was just one of many milestones she promised to mark when she signed the relationship agreement in the first place.\r\n\r\n\"It's not Megan's vision, it's not Kyle's vision, it's something else,\" Evangelista says. \"There's always this other force around them, so it's this young girl having incredible moments, something she's fantasized about her whole life, and it's out of her control in a lot of ways. It's very stressful, and coming into this season the stakes are very high but the consequences are even higher.\"\r\n\r\nA throughline for the season, says Evangelista, is whether or not Megan and Kyle's relationship is strong enough to convince him of the truth behind the Institute, and Henderson points out that Kyle \"really wants the relationship to survive\" because he \"truly does love Megan.\"\r\n\r\nBut further complicating things is the fact that Megan and Kyle are also embarking upon a professional project together — a movie she will star in that he will direct. Because it's the first project Kyle is directing \"it's a big deal for him, so he kind of obsesses about it,\" says Henderson.\r\n\r\nThe show's second season will also explore who Kyle was in the past to understand more about him, including his relationship with Lisbeth (Ashley Hinshaw) and Terrence (Michael Vartan).\r\n\r\n\"It's a deep dive into Kyle West,\" Abrahams says. \"We're going to learn a lot, not just about Kyle but also Terrence and their relationship — so much more of why his life has the strange elements in it that it does.\"\r\n\r\nHenderson adds that in getting to know Kyle, the audience will see \"he's got a lot of guilt\" and \"demons\" that he's trying to work through.\r\n\r\n\"He wants to be happy and right some wrongs, and he's tired of hiding things. He and Megan have some pretty eye-opening, groundbreaking moments between them, and it's a big journey for him this year to decide if Terrence and the Institute really have his best interest at heart and if it's the best thing for him,\" Henderson says.\r\n\r\nKyle has had his own doubts about the organization, he says, but thus far he has needed it because of his \"intense\" relationship with Terrence.\r\n\r\nBut as the couple marches toward their marriage, they will be re-evaluating the other relationships they see around them. \"There's a cool episode where we juxtapose the relationship [between Megan and Kyle, and Terrence and Deann] because they're both arrangements in a way, but they're in very different places,\" Abrahams says.\r\n\r\nMegan and Kyle may even have to re-evaluate their own relationship beyond the professional obligation they made to each other, says Henderson. \"There's a lot of separation. There's a lot of stuff going on with her, obviously, there's a lot of stuff with me, and then we come back at the end of the day and we're living together and there's this interesting, kind of weird dynamic between us because there's so many things not being said,\" Henderson says.\r\n\r\n\"The Arrangement\" Season 2 premieres March 11 on E!", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1510772449.0, "source": "https://variety.com", "summary": ""}