{"url": "https://people.com/style/paulina-porizkova-sailor-brinkley-cook-pose-nude-sports-illustrated-swim/", "text": "In the wake of the #metoo movement, Sports Illustrated Swimsuit models are using this year’s issue as a way to speak out about issues that are important to them. The highly anticipated special issue has become a platform that stretches far beyond celebrating women’s bodies.\n\nModels Paulina Porizkova, 52, Sailor Brinkley Cook, 19, and Robyn Lawley, 28, are proving just that, taking part in a powerful new project called “In Her Own Words.” Each woman poses completely nude in the issue — along with more models, which will be revealed when the SI Swim issue drops next week — with meaningful words like truth, artist, mother, natural and more written across their bodies.\n\nGet push notifications with news, features and more.\n\n“The ‘In Her Own Words’ project is the evolution of the messaging of the SI Swimsuit issue that we have been consistently promoting in the issue for years,” SI Swim editor MJ Daly told PEOPLE. “The idea of allowing women to celebrate and evolve and harness their own power in a creative environment and allow them a platform to speak to who they truly are and who they want to be.”\n\nDay added: “It’s so simple, yet so difficult for many in this industry to find control over how their identity is portrayed or interpreted or judged. We want to give this control directly to the women to own their story and image throughout the whole creative process. The results are inspiring.”\n\nImage zoom Paulina Porzikova poses nude for Sports Illustrated Swimsuit’s new “In Her Own Words” project.\n\nPorzikova, who has been very open about sexual harassment in the modeling industry, landed her first SI Swimsuit cover at the age of 18 in 1984 and covered the issue again the year after, and the model isn’t letting age hold her back from loving her body.\n\nLooking for more style content? Click here to subscribe to the PeopleStyle Newsletter for amazing shopping discounts, can’t-live-without beauty products and more.\n\n“I wanted to say that I’m not ashamed of my body and you shouldn’t be ashamed of your body, no matter what age you are. We all have our own truths. We all want to live according to our own truths,” Porzikova told SI. “We want to be true to ourselves so truth is what matters more than anything.”In a way, it’s more than being naked.”\n\nRELATED: In Her Own Words: SI Swimsuit Models Celebrate More Than Just Their Bodies in Candid Project\n\nRELATED VIDEO: Christie Brinkley’s Daughter Sailor on Following in Her Mother’s Footsteps\n\nDay knew Porizkova’s legendary status and outspoken personality would make her an amazing powerful addition to the project. “Her non-conformity made me immediately want to approach her about participating in ‘In Her Own Words,” Day shared. “I knew that if she agreed to do it, just her presence alone would be incredibly important and powerful, and the decision to use her word [“Truth”] punctuated the meaning of the project perfectly.”\n\nImage zoom Sailor Brinkley Cook poses nude for Sports Illustrated Swimsuit’s new “In Her Own Words” project.\n\nFor Brinkley Cook, who made her SI Swim debut in 2017 alongside her model mom Christie Brinkley and sister Alexa Ray Joel, the experience of writing words and affirmations on her body was a way to combat her own insecurity.\n\n“It was really special to be a part of this and get to express myself in a very raw, uncensored way,” the model said of taking part in the project. “Having these words written all over your naked body and having that next level of exposure — I felt sexy obviously but I felt more emotional and it helped me accept myself.”\n\nImage zoom Robyn Lawley poses nude for Sports Illustrated Swimsuit’s new “In Her Own Words” project. Taylor Ballantyne/SPORTS ILLUSTRATED\n\nSports Illustrated Swimsuit is bringing female empowerment to the forefront of its Swimsuit Issue this year, and along with the new section of “In Her Own Words,” the magazine is including more first-person essays from models and highlighting causes that are important to them, like Paige Spiranac’s work with anti-cyberbullying.\n\nRELATED PHOTOS: UPDATED! Shop All the Empowering Feminist Clothing Stars Wore at the Women’s March and Beyond\n\n“Female empowerment has always been an undertone of SI Swimsuit but this year we decided that now more than ever, it needed to be placed at the forefront of the discussion,” Day told PEOPLE. “There seems to be a misconception out there that you have to ‘pick a team’ when it comes to defining yourself as a woman. There is room at the table for everyone and redefining sexy is a great place to start.”\n\nIt was also important for SI Swimsuit’s female editorial team to recruit a female photographer, Taylor Ballantyne, to conceptualize the shoot and “In Her Own Words Project,” all of which will be detailed in an upcoming TV special which will be airing on Sports Illustrated TV.\n\n“One of the most common misconceptions about the issue is that it is just for men. Fourteen million women read it,” Day said. “When you are doing something as sensitive as nudes like we were this year, having a Taylor shoot it immediately added to the comfort level of the project.”\n\nLawley, who’s spoken about publicly about raising her 2-year-old daughter Ripley in a gender-neutral environment, posed nude for this shoot as an effort to teach her about feeling comfortable in her own skin. “My daughter is growing up in this world right now and I want her to love who she is because it is so important. If she ever came to me and said, ‘I don’t feel comfortable in my body, ‘I don’t know what I would do,” the model admitted to SI.\n\nShe continued, “I’d die on the inside. We are women and we are human. We have stretch marks. We have rolls. We have cellulite. That’s all part of our bodies. We become so obsessed with our exterior message; we give no thoughts to what’s in our heads. I just want all those girls out there to know they are so beautiful and so special.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fpaulina-porizkova-credit-taylor-ballantyne_sports-illustrated.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1920&h=1005&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fpaulina-porizkova-credit-taylor-ballantyne_sports-illustrated.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Frobyn-lawley-credit-taylor-ballantyne_sports-illustrated-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fsailor-brinkley-cook-credit-taylor-ballantyne_sports-illustrated-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1920&h=1005&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fpaulina-porizkova-credit-taylor-ballantyne_sports-illustrated.jpg", "keywords": [], "authors": ["Kaitlyn Frey", "Brittany Talarico"], "canonical_link": "https://people.com/style/paulina-porizkova-sailor-brinkley-cook-pose-nude-sports-illustrated-swim/", "title": "Paulina Porizkova, Sailor Brinkley Cook Pose Nude for New Sports Illustrated Swimsuit Franchise", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Models,News,Paulina Porizkova,Robyn Lawley,Sailor Brinkley-Cook,SI Swim,Sports Illustrated,Style,Style News", "news_keywords": "Models,News,Paulina Porizkova,Robyn Lawley,Sailor Brinkley-Cook,SI Swim,Sports Illustrated,Style,Style News", "description": "Sports Illustrated is celebrating more than just women's bodies in this year's Swimsuit Issue", "og": {"title": "Paulina Porizkova Poses Nude for SI Swim at 52: 'You Shouldn’t Be Ashamed of Your Body, No Matter What Age You Are'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/style/paulina-porizkova-sailor-brinkley-cook-pose-nude-sports-illustrated-swim/", "description": "In the wake of the #metoo movement, Sports Illustrated Swimsuit models are using this year’s issue as a way to speak out about issues that&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1920&h=1005&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fpaulina-porizkova-credit-taylor-ballantyne_sports-illustrated.jpg", "width": 1920, "height": 1005}}, "pinterest": {"url": "https://people.com/style/paulina-porizkova-sailor-brinkley-cook-pose-nude-sports-illustrated-swim/", "description": "Sports Illustrated is celebrating more than just women's bodies in this year's Swimsuit Issue", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fpaulina-porizkova-credit-taylor-ballantyne_sports-illustrated.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/style/paulina-porizkova-sailor-brinkley-cook-pose-nude-sports-illustrated-swim/", "title": "Paulina Porizkova Poses Nude for SI Swim at 52: 'You Shouldn’t Be Ashamed of Your Body, No Matter What Age You Are'", "description": "Sports Illustrated is celebrating more than just women's bodies in this year's Swimsuit Issue", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1920&h=1005&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F02%2Fpaulina-porizkova-credit-taylor-ballantyne_sports-illustrated.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}