{"url": "www.mercurynews.com/2018/03/14/after-everything-ben-affleck-wishes-he-could-win-jennifer-garner-back-new-report-says/", "text": "Ben Affleck and Jennifer Garner announced they were breaking up in 2015, though they didn’t get around to filing for divorce until April 2017.\n\nBut soon after, Affleck more or less went public with his romance with Lindsay Shookus, a “Saturday Night Live” producer whom he may have started seeing when he was still married to Garner.\n\nBut three years after that initial 2015 announcement, Affleck and Garner, both 45, have yet to finalize their divorce, raising the question: What’s taking so long?\n\nA new report by Us Weekly cites sources who say that the “Batman v. Superman” actor is dragging his feet because he would like to get back together with Garner, with whom he has three children.\n\nIf this description of Affleck is close to accurate, he could be the Oscar-winning, movie star version of “Bachelor” star Arie Luyendyk Jr., who angered Bachelor Nation and the rest of America by vacillating between two women in the show’s final episodes.\n\nFor her part, Garner really tried to make things work with Affleck — despite his reported struggles with alcohol addiction, gambling and monogamy, according to Us Weekly.\n\nThis fall, Affleck also had a dark cloud hanging over him following news about multiple sexual misconduct allegations against his regular producing collaborator Harvey Weinstein. In the wake of the Weinstein allegations and the launch of the #MeToo movement, Affleck was accused of groping two women and of being complicit in a Hollywood culture that allows sexually predatory men to stay in power.\n\nAfter Garner and Affleck first announced their split in 2015, the “Alias” actress “put her heart and soul into fixing the relationship and wanted so desperately to turn things around for the children’s sake as well as theirs,” a source told Us Weekly.\n\n“She forgave him for so much, and still he couldn’t change,” the source said.\n\nIn the year since they filed for divorce, Affleck begged Garner to come back several times, even after he had officially moved on with Shookus. “He had at one point been telling friends he wanted his ex back,” a source told the magazine.\n\nAffleck apparently was saying such things even after he and Shookus started being photographed together in New York City or Los Angeles. In November, Affleck reportedly introduced Shookus to Garner as a step to getting her comfortable with his children, Violet, 12, Seraphina, 9, and Samuel, 6. Affleck and Shookus also were spotted house-hunting together in the Los Angeles area over Valentine’s Day, various reports said.\n\nStill, Affleck and Garner have continued to be seen in public together, attending church or taking the kids to school — though these joint appearances could simply be part of their vow to be hands-on co-parents.\n\nThe new Us Weekly report claims that there was a slim chance that the two could have reconciled in late 2017, after Affleck returned to rehab and re-dedicated himself to his recovery.\n\nAccording to reports in November, two-time rehab veteran Affleck realized he was “losing his grip on his alcohol addiction.”\n\nAffleck poured out his heart to Garner, “telling her everything that was going on with his life,” a source told Us Weekly at the time. “After everything they’ve been through, she is going to continue to be there for him when he needs her,” the source told Us Weekly in November. “No matter what the circumstances.”\n\nThose circumstances include all the “smoking and drinking and gambling” that apparently took place during the marriage — as well as Affleck possibly cheating on Garner with Shookus when they were married and reportedly dating their children’s 28-year-old nanny Christine Ouzounian after they first announced their split in 2015.\n\nThe new Us Weekly report said that Garner visited her estranged husband every day while he was in rehab.\n\n“They did family counseling to work on their relationship,” an insider told the magazine. “Things looked positive. Jennifer was very caring, very present. They both wanted it to work.”\n\nBut another source told Us Weekly that Affleck is, in fact, ready to move on and be with Shookus, whom he “loves and adores.”\n\nCertainly, geography could make that relationship challenging as Shookus lives in New York City, where she works and raises a son, while Affleck is committed to being close to his children, who are based in Los Angeles.\n\nThe website Gossip Cop quoted other sources “close” to the couple who slammed the Us Weekly report, saying that the story actually makes clear that the two aren’t reuniting, but teases the idea that they might. A contact close to the situation told Gossip Cop: “(The cover) is not true. There’s no reconciliation and they are in (the middle of) finalizing the divorce.”\n\nAnother friend of Affleck and Garner told Gossip Cop that the exes are “both working hard to create the best relationship for the kids.”\n\nIndeed, the Us Weekly story said that Garner has quietly begun dating again, though that included going out with a man who is described as looking something like Affleck.\n\n“Jen is ready to go with her feelings and give love another try,” a friend told Us Weekly.\n\nThis story has been updated.", "images": ["https://i2.wp.com/www.mercurynews.com/wp-content/uploads/2017/07/garneraffleck111.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://i0.wp.com/www.mercurynews.com/wp-content/uploads/2017/09/emmysshookus.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://www.mercurynews.com/wp-content/uploads/2017/04/garneraffleck172.jpg?w=1024&h=803", "https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2017/04/garneraffleck172.jpg?w=1024&h=803", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2018/03/14/after-everything-ben-affleck-wishes-he-could-win-jennifer-garner-back-new-report-says/", "title": "After everything, Ben Affleck wishes he could win Jennifer Garner back, new report says", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "Ben Affleck may officially be seeing Lindsay Shookus but there are reasons he's dragging his feet finalizing his divorce from Jennifer Garner, says new report.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "After everything, Ben Affleck wishes he could win Jennifer Garner back, new report says", "url": "https://www.mercurynews.com/2018/03/14/after-everything-ben-affleck-wishes-he-could-win-jennifer-garner-back-new-report-says/", "description": "Ben Affleck may officially be seeing Lindsay Shookus but there may be reasons he’s dragging his feet finalizing his divorce from Jennifer Garner.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2017/04/garneraffleck172.jpg?w=1024&h=803", "width": 1024, "height": 803}, "locale": "en_US"}, "article": {"published_time": "2018-03-14T16:55:20+00:00", "modified_time": "2018-03-14T21:37:38+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "After everything, Ben Affleck wishes he could win Jennifer Garner back, new report says"}, "image": "https://www.mercurynews.com/wp-content/uploads/2017/04/garneraffleck172.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1520956800.0, "source": "http://www.mercurynews.com", "summary": ""}