{"url": "www.inquisitr.com/4582655/tom-cruise-reportedly-wish-to-be-in-suris-life-again-as-he-plans-to-marry-vanessa-kirby-in-2018/", "text": "Tom Cruise’s personal life is again on the media’s radar as his ex-wife, Katie Holmes, and his former friend, Jamie Foxx, are planning to move ahead as an alleged couple. Tom, who is currently busy filming Mission: Impossible 6 with Vanessa Kirby, is reportedly planning to settle down. According to reports, the actor is afraid that just like his father, he is also going to die of cancer and wishes to reunite with his 11-year-old daughter, Suri Cruise.\n\nEver since Katie Holmes and Tom Cruise announced their divorce, the entire entertainment world started to talk about Suri and how she would be raised without a father figure in her life. However, Katie proved herself as an excellent mother, as she did not let any news affect her life with her daughter. She was recently spotted enjoying a hockey game with Suri and even her Instagram pictures show the bond she shares with her daughter.\n\nAs Katie and Jamie are moving on together in their personal lives, recent reports suggest that even Tom Cruise has decided to settle down again. It was recently reported by Inquisitr that Tom Cruise reportedly has the hots for his Mission: Impossible 6 co-star Vanessa Kirby. An alleged insider revealed that Tom admired Vanessa’s work and reportedly persuaded other producers to give The Crown actress a crucial role in the sixth installment of Mission: Impossible series.\n\n???? @netflix A post shared by Vanessa Kirby (@vanessa__kirby) on Aug 10, 2016 at 3:27am PDT\n\nTom Cruise, who was previously married to Mimi Rogers, Nicole Kidman, and Katie Holmes, has reportedly decided to make Vanessa Kirby the next Mrs. Cruise.\n\nBut it is not only a life partner which Tom desires. According to a recent report, Tom is planning to reintroduce Suri back in his life.\n\nAfter Tom’s divorce with Katie, there were alleged reports that due to the Church of Scientology, one of Hollywood’s most loved actors was not allowed to see or meet his own daughter. It was previously reported that Tom has not seen Suri for over three years and even the pre-teen girl has stopped missing her dad.\n\n“With his desire to reintroduce his estranged daughter Suri into his life, along with his plan to be married again ‘by early next year,’ Tom — who is also father to 24-year-old Bella and 22-year-old Connor with Nicole Kidman — is getting his life back where he wants it,” reads the report.\n\n[Image by Donald Traill/AP Images]\n\nThat being said, it was recently reported that Katie Holmes is not comfortable around Tom Cruise. The recent report further alleged that Katie thinks that her ex-husband does not approve of her relationship with Jamie Foxx. She also thinks that her former husband can influence Suri to follow the Church of Scientology — reportedly the main reason why Katie asked for a divorce.\n\nThe report also alleged that when Katie and Jamie decide to get married, it will be a small ceremony, as the Dawson’s Creek’s actress is afraid of the Vanilla Sky actor.\n\n[Image by Neilson Barnard/Getty Images]\n\n“She’s terrified of how her ex-husband will react to her moving on to a new life with another man. She’s worried Tom could come crashing back into her and Suri’s lives, take her to court to get more custody and try to sway Suri over to Scientology,” an alleged insider revealed.\n\n???????????????????????????????????? #nationaldaughterday ???????????????????? A post shared by Katie Holmes (@katieholmes212) on Sep 27, 2017 at 8:18pm PDT\n\nIt is still not confirmed when Katie Holmes and Jamie Foxx will announce their marriage. As of now, the two haven’t even released a statement about their alleged affair. On the other hand, Tom Cruise’s representatives have not commented on the recent claims that suggest that he is planning to get Suri back in his life, as he reportedly moves ahead to settle down with Vanessa Kirby.\n\n[Featured Image by Kevin Winter/Getty Images]", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2017/10/Tom-Cruise-and-Katie-holmes-divorce-reason.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "https://cdn.inquisitr.com/wp-content/uploads/2017/10/tom-cruise-with-daughter-suri-cruise-picture.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://secure.gravatar.com/avatar/2796d5da17c476cbb25029169dfc079c?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2017/10/tom-cruise-mission-impossible-6-trailer.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Viraj Mahajan"], "canonical_link": "https://www.inquisitr.com/4582655/tom-cruise-reportedly-wish-to-be-in-suris-life-again-as-he-plans-to-marry-vanessa-kirby-in-2018/", "title": "Tom Cruise Reportedly Wishes To Be In Suri’s Life Again, As He Plans To Marry Vanessa Kirby In 2018", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}