{"url": "https://web.archive.org/web/20080204072132/http://www.rockymountainnews.com:80/news/2008/feb/02/romney-tells-denver-crowd-he-can-salvage-economy/", "text": "Romney makes pitch, hoping to close deal\n\nPhoto by Matt McClain\n\nMitt Romney offered a pragmatic view of the tight Republican race for president Friday at a Denver car dealership, saying that some states are \"long shots\" for him while others are there for the taking.\n\nColorado, he believed, fell into the latter category - which is why he made the stop in Denver on his way to Utah to attend funeral services for Gordon B. Hinckley.\n\nHinckley, 97, was president of the Mormon church, of which Romney is a member.\n\nRomney, standing in the parking lot of Freeway Ford, stood with his sleeves rolled up, despite the rapidly dropping temperature, and offered a broad view of Super Tuesday's contest featuring 21 states, including Colorado, holding Republican caucuses or primaries.\n\n\"At this stage, I expect to keep on battling and get the nomination,\" he said. \"I'm not going to forecast anything but success.\"\n\nThe campaign is targeting a series of states in the next few days that Romney could play well in. After Utah, where he enjoys strong support, the former Massachusetts governor will head to Minnesota.\n\nHis campaign didn't rule out another trip to Colorado before Tuesday.\n\nThe state has seen massive campaign activity this week as Super Tuesday nears, with Democratic presidential candidate Barack Obama drawing about 13,000 people at the University of Denver and former President Bill Clinton, stumping for his wife Sen. Hillary Clinton, bringing in about 4,500 at the same location.\n\nDealership cites 'civic duty'\n\nRomney's event drew about 1,200 supporters, who were shoehorned into the car dealership showroom. It was a last-minute change of venue.\n\nThe campaign had planned to host the rally at the Harley Davidson dealership in Thornton, but contacted Freeway Ford General Manager and Vice President Mike Peebles to see if they could have the event there after the motorcycle dealership's owner pulled the plug on the event.\n\nPeebles, who said that the business had not hosted a presidential candidate's visit before, agreed and soon had the place crawling with supporters, Secret Service and media - forcing salespeople from their cubicles and moving cars around to accommodate everyone.\n\n\"We're not endorsing him or anything,\" Peebles said. \"We just thought it would be a good thing to help out. Doing our civic duty, right?\"\n\nRomney spoke to the crowd for about 20 minutes, offering up his usual talking points about strengthening the economy, adding 100,000 troops to the military, and his experience as a businessman and governor. Romney, whose wealth has been estimated at $250 million, spent years as an investor and venture capitalist.\n\nOne area where he didn't spend much time talking was on Western issues, including things such as natural resources.\n\nThe economy was where he took his shot at his chief rival, Sen. John McCain - a name that elicited a chorus of boos.\n\n\"He has a number of things that are great strengths of his, but he happened to say the economy was not his strong suit,\" Romney said. \"Well, at a time like this in a country like this, I think it is important to have a president for whom the economy is his strong suit.\"\n\nWarnings about economy\n\nIt was the only real slap at the McCain campaign, which did not return repeated calls for comment.\n\nRomney has been making his hay with the economy. He openly worried about the direction the nation is headed in and suggested that it could be headed for a dip in status amid emerging global economies.\n\n\"Unless we get ourselves on the right track, this country could become a second-tier nation,\" he said.\n\nIt was a key part of Romney's theme. A poster behind him read \"Washington is broken.\" He cited his experience as a governor in a liberal state as proof that he could work with the opposition party and get things accomplished.\n\nBeauprez said that an ability to unify the country is needed and conceded that President Bush has had \"a bunker mentality\" that he believes Romney would not have if elected.\n\nDemocrats offered a less rosy view.\n\n\"Mitt can't hide the fact that a vote for Romney is a vote for a third Bush term,\" said Damien LaVera, Democratic National Committee spokesman.\n\nStill, the crowd cheered at several points. Afterward, Romney waded through the crowd and signed T-shirts and posed for pictures.\n\nRecently, Romney has been casting himself as the choice of the conservative wing of the party by talking about illegal immigration and family values. The tactic has won some over, but he has not been able to secure an endorsement from Focus on the Family founder James Dobson. Dobson has said, speaking as a private citizen since the Colorado Springs-based group does not endorse candidates, that he would not support McCain.", "images": ["https://web.archive.org/web/20080204072132im_/http://denver.rockymountainnews.com/static/images/faces/johnson.jpg", "https://web.archive.org/web/20080204072132im_/http://denver.rockymountainnews.com/static/images/drmn/promo/promoReprints.jpg", "https://web.archive.org/web/20080204072132im_/http://denver.rockymountainnews.com/static/images/drmn/nav/digg.gif", "https://web.archive.org/web/20080204072132im_/http://media.scrippsnewspapers.com/static/images/corp/network_logos/alphame_food_black.png", "https://web.archive.org/web/20080204072132im_/http://mngirockymtnnews.112.2o7.net/b/ss/mngirockymtnnews/1/H.1--NS/0", "https://web.archive.org/web/20080204072132im_/http://denver.rockymountainnews.com/static/images/drmn/promo/promoSubscribe.jpg", "https://web.archive.org/web/20080204072132im_/http://media.rockymountainnews.com/drmn/content/img/photos/2008/02/01/436023793_t220.jpg", "https://web.archive.org/web/20080204072132im_/http://denver.rockymountainnews.com/static/images/drmn/nav/newsvine.gif", "https://web.archive.org/web/20080204072132im_/http://denver.rockymountainnews.com/static/images/drmn/nav/reddit.gif", "https://web.archive.org/web/20080204072132im_/http://denver.rockymountainnews.com/static/images/drmn/icons/plusOff.jpg", "https://web.archive.org/web/20080204072132im_/http://denver.rockymountainnews.com/static/images/drmn/icons/minusOff.jpg", "https://web.archive.org/web/20080204072132im_/http://denver.rockymountainnews.com/static/images/faces/sprengelmeyer.jpg", "https://web.archive.org/web/20080204072132im_/http://denver.rockymountainnews.com/static/images/drmn/nav/delicious.gif", "https://web.archive.org/web/20080204072132im_/http://media.scrippsnewspapers.com/static/images/corp/network_logos/alphame_hgtv_black.png", "https://web.archive.org/web/20080204072132im_/http://media.scrippsnewspapers.com/static/images/corp/network_logos/alphame_diy_black.png", "https://web.archive.org/web/20080204072132im_/http://media.scrippsnewspapers.com/static/images/corp/network_logos/alphame_gac_black.png", "https://web.archive.org/web/20080204072132im_/http://denver.rockymountainnews.com/static/images/faces/wolf.jpg", "https://web.archive.org/web/20080204072132im_/http://media.scrippsnewspapers.com/static/images/corp/network_logos/lighthouse.gif", "https://web.archive.org/web/20080204072132im_/http://media.scrippsnewspapers.com/static/images/corp/network_logos/alphame_fl_black.png"], "top_img": "", "keywords": [], "authors": ["David Montero"], "canonical_link": "", "title": "Romney makes pitch, hoping to close deal : Elections : The Rocky Mountain News", "meta_data": {"author": "David Montero", "description": "Mitt Romney offered a pragmatic view of the GOP race at a car dealership in Denver: some states are \"long shots\" for him; others are there for the taking.", "copyright": "Copyright (c) 2008 The Rocky Mountain News and rockymountainnews.com.  All Rights Reserved."}, "movies": [], "publish_date": 1201881600.0, "source": "https://web.archive.org", "summary": ""}