{"url": "https://stylecaster.com/kourtney-kardashian-summer-meal-plan/", "text": "If you’re looking for a healthy, refreshing meal, Kourtney Kardashian‘s house is where you go. The 39-year-old reality star is known for her organic, mostly natural diet, and just because summer is approaching, doesn’t mean that she’s slacking off. This week, the “Keeping Up with the Kardashians” star took to her website and app to reveal the healthy-yet-delicious meals she’s eating on her summer meal plan.\n\nThough she hasn’t revealed her full week of meals, we have the scoop on what she eats on the first two days, and if you’re a fan of keeping cool this summer, Kourt’s meals might be for you. Find out what the E! personality eats in a day ahead.\n\nDay 1 Breakfast: Smoothie Bowl\n\nKourtney kicks off her week with a smoothie bowl chock-full of vitamins and minerals. For the base, Kourtney blends two cups of pineapple, two ripe bananas, one cup of kale with the stems removed, one cup of spinach, and half of an avocado. She tops it with one teaspoon of bee pollen, one teaspoon of chia seeds, some shredded coconut, and some thinly sliced strawberries, banana, and kiwis. The meal, which takes about 15 minutes to prepare, serves two, so eat with a buddy.\n\nInstructions:\n\n1. Add pineapple, bananas, kale and avocado to blender and blend until completely smooth.\n\n2. Pour mixture into 2 bowls.\n\n3. Slice fruit for toppings and divide between the 2 servings.\n\n4. Sprinkle with bee pollen, chia seeds, and coconut shreds.\n\nDay 1 Lunch: Citrus Salad\n\nKourtney continues her day by refreshing herself with a citrus salad. For her homemade balsamic vinaigrette dressing, Kourtney combines 3/4 of a cup of extra-virgin olive oil, a 1/4 cup of balsamic vinegar, one clove of finely chopped garlic, one teaspoon of honey, one teaspoon of dijon mustard, 1/2 a teaspoon of salt, and 1/2 a teaspoon of pepper.\n\nShe drizzles the mix over her salad which is made of two blood oranges, one navel orange, one grapefruit, pumpkin seeds, a handful of pomegranate seeds, and mixed greens. Kourtney estimates the meal, which feeds two people, to take 20 minutes.\n\nInstructions:\n\nFor Dressing:\n\n1. Combine all ingredients in a glass jar with a lid.\n\n2. Place the lid on the jar and shake vigorously until the dressing has emulsified.\n\nFor Salad:\n\n1. Peel citrus, remove any pits or seeds, and slice into wheels.\n\n2. Place on a serving dish, sprinkle with mixed greens, pomegranate and pumpkin seeds.\n\n3. Drizzle with dressing and enjoy!\n\nDay 1 Dinner: Salmon with Broccoli Rice\n\nTo end her day, Kourtney eats a hearty dish of salmon and broccoli rice. The meal, which serves four and takes around 40 minutes to prepare, consists of four salmon fillets. For the marinade, Kourtney uses 1/4 cup of olive oil, two tablespoons of soy sauce, two tablespoons of rice vinegar, two tablespoons of sesame oil, two tablespoons of brown sugar, two cloves of pressed garlic, one tablespoon of grated ginger, one tablespoon of sesame seeds, and four onions thinly sliced.\n\nFor the salmon’s glaze, she combines two tablespoons of honey, one teaspoon of soy sauce, one teaspoon of sesame oil, 1/2 a teaspoon of grated ginger, and 1/2 a teaspoon of sesame seeds.\n\nInstructions:\n\n1. Combine all glaze ingredients in a small bowl and set aside.\n\n2. Combine all marinade ingredients and whisk until well combined.\n\n3. Place fillets in a large Zip-loc bag with the marinade let marinate for at least 30 minutes.\n\n4. Preheat oven to 400° F and lightly coat a baking dish with nonstick spray.\n\n5. Place the salmon fillets and marinade onto the prepared baking dish and bake for about 20 minutes.\n\n6. Serve salmon with honey ginger glaze.\n\nDay 2 Breakfast: Coconut Parfait\n\nKourtney keeps the week going with a post-workout coconut parfait that is entirely dairy-free. The meal, which takes 25 minutes to make and serves two, uses dairy-free coconut yogurt, mango or any fruit of your choice, and organic honey or agave syrup.\n\nFor her homemade granola, Kourtney combines two cups of whole rolled oats, 1/2 a cup of chopped raw nuts, 1/2 a cup of your choice of raw seeds (she likes pumpkin seeds), two tablespoons of organic maple syrup, two tablespoons of coconut oil, and 1/2 a teaspoon of vanilla extract.\n\nInstructions:\n\nFor Granola:\n\n1. Preheat oven to 300ºF.\n\n2. Combine all granola ingredients in a bowl and mix well, using your hands.\n\n3. Spread the mixture onto a baking sheet lined with parchment paper and bake for 10 minutes.\n\n4. Cool before serving.\n\nFor Parfait:\n\n1. In a small bowl or jar, layer yogurt and homemade granola and top with organic honey or agave syrup.\n\nDay 2 Lunch: Avocado Toast with Eggs\n\nFor a mid-day pick-me-up, Kourtney eats avocado toast with an egg for lunch. The dish, which takes 10 minutes to make and serves one person, uses one egg, one avocado, gluten-free bread of your choice, radishes, mixed greens, and a sprinkle of salt and pepper to taste.\n\nInstructions:\n\n1. Mash the avocado and season with salt and pepper.\n\n2. Heat a small skillet on medium heat and cook 1-2 eggs however you like (over easy, scrambled, etc.).\n\n3. Toast a slice of bread and spread the mashed avocado over the top.\n\n4. Finish with fresh greens and radish slices.\n\nDay 2 Dinner: Sushi Sandwich\n\nFor dinner, Kourtney eats her own “sushi sandwich” made with vegetables and her homemade teriyaki sauce. For the sandwich, Kourtney uses two nori sheets, one cup of cooked brown rice, a 3-ounce package of super-firm organic tofu, one sliced avocado, one sliced cucumber, a handful of spinach sleeves, a sprinkle of black and white sesame seeds for garnish, and salt and pepper to taste.\n\nThe teriyaki sauce consists of one cup of water, five tablespoons of brown sugar, 1/4 cup of soy sauce, one to two tablespoons of honey, one large finely minced clove of garlic, 1/2 teaspoon of ginger, 2 tablespoons of cornstarch, and 1/4 cup of cold water. For the dipping sauce, Kourtney combines two tablespoons of Vegenaise and a tablespoons of Sriracha.\n\nInstructions:\n\nFor Sandwich:\n\n1. Slice the tofu in half and wrap it in a paper towel. Place it on a plate and weigh it down with something heavy (like a pan). Once the paper towel becomes wet, change it for a new one. Repeat a few times until the paper towel stays almost dry.\n\n2. Combine the teriyaki sauce ingredients and mix until well combined. Set aside.\n\n3. Set the oven to 390°F and line a baking tray with parchment paper. Coat tofu in teriyaki sauce. Brush a bit of oil on the parchment paper underneath the tofu and bake for about 30 minutes (until crisp and dry), flipping the pieces to the other side halfway through.\n\n4. Place your nori sheet down in the center of your workspace. Wet your hands and grab a handful of rice. Place it in the middle of the sheet and form it into a compacted square.\n\n5. Put a layer of tofu, cucumber, avocado and spinach on the rice and cover all the ingredients with another layer of compacted rice.\n\n6. Seal all 4 corners of the nori sheet on the top of the filling (like an envelope).\n\n7. Cut in half with a sharp knife and enjoy!\n\nFor Dipping Sauce: Mix Vegenaise and Sriracha until smooth.", "images": ["https://scstylecaster.files.wordpress.com/2020/04/chris-harrison.png?w=120&h=120&crop=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=stylecaster.com&path=%2Fkourtney-kardashian-summer-meal-plan%2F&ct=article&lob=&loc=us&env=desktop&post_id=730639", "https://scstylecaster.files.wordpress.com/2020/03/tiger-king-netflix-1.png?w=120&h=120&crop=1", "https://scstylecaster.files.wordpress.com/2020/04/blackpink-jisoo.jpg?w=120&h=120&crop=1", "https://www.facebook.com/tr?id=1130306277008218&ev=PageView&noscript=1", "https://scstylecaster.files.wordpress.com/2017/05/5814f0acb4e987d10d263e3e6210e2a8.jpeg?resize=%2C", "https://scstylecaster.files.wordpress.com/2018/05/kourtney-kardashian.jpg", "https://scstylecaster.files.wordpress.com/2020/02/prince-harry.png?w=120&h=120&crop=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript"], "top_img": "https://scstylecaster.files.wordpress.com/2018/05/kourtney-kardashian.jpg", "keywords": [], "authors": ["Jason Pham"], "canonical_link": "https://stylecaster.com/kourtney-kardashian-summer-meal-plan/", "title": "Kourtney Kardashian Reveals Her Healthy Summer Meal Plan", "meta_data": {"description": "Reality star Kourtney Kardashian revealed the three meals she eats on her summer meal plan. The one-day meal plan consists of a smoothie bowl for breakfast, a citrus salad for lunch, and a salmon dish for dinner. See Kourtney's yummy summer recipes.", "msvalidate.01": "7A34A1C1904BAFB83691E8B3718CA9A2", "article": {"publisher": "https://www.facebook.com/stylecaster", "published_time": "2018-05-01T13:31:16+00:00", "modified_time": "2018-11-04T22:24:15+00:00", "author": "Jason Pham", "section": "Celebrity News", "tag": "meal plans"}, "google-site-verification": "yB_5UwT5pPNnn93Mba5HIaFkNtbrafDQWP_Rj34Iw08", "news_keywords": "celebrity meal plans, kourtney kardashian, meal plans", "viewport": "width=device-width, initial-scale=1, maximum-scale=1", "generator": "WordPress.com", "author": "Jason Pham", "application-name": "StyleCaster", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Style News, Fashion Trends & Beauty Tips", "msapplication-task": "name=Subscribe;action-uri=https://stylecaster.com/feed/;icon-uri=https://secure.gravatar.com/blavatar/f95e80beb275448b98a924f84cc3473a?s=16", "onesignal": "wordpress-plugin", "og": {"site_name": "StyleCaster", "type": "article", "locale": "en_US", "url": "https://stylecaster.com/kourtney-kardashian-summer-meal-plan/", "title": "Kourtney Kardashian Reveals Her Healthy Summer Meal Plan", "description": "They're tasty, refreshing, and filling.", "image": {"identifier": "https://scstylecaster.files.wordpress.com/2018/05/kourtney-kardashian.jpg", "width": 1024, "height": 576}}, "fb": {"app_id": 134683123322801, "pages": 48566051011, "article_style": "scdefault"}, "twitter": {"card": "summary_large_image", "site": "@stylecaster", "creator": "@stylecaster", "title": "Kourtney Kardashian Reveals Her Healthy Summer Meal Plan", "description": "They're tasty, refreshing, and filling.", "image": "https://scstylecaster.files.wordpress.com/2018/05/kourtney-kardashian.jpg", "account_id": 55678606}}, "movies": [], "publish_date": 1525181476.0, "source": "https://stylecaster.com", "summary": ""}