{"url": "https://www.etonline.com/mila-kunis-post-baby-body-new-christmas-traditions-juggling-2-kids-we-needed-help-exclusive-88513", "text": "With her baby boy, Dimitri, gearing up to celebrate his first birthday next month, Mila Kunis is reflecting on her first year as a mom of two -- getting candid about how she and husband Ashton Kutcher are determined not to “raise a**holes,” their new family traditions and how she got in shape after giving birth.\n\nThe 34-year-old actress sat down with ET’s Brooke Anderson to promote the upcoming Bad Moms sequel -- A Bad Moms Christmas -- and admitted she has her own moments of feeling like a bad mom, but is more relaxed about balancing work and parenthood these days.\n\n“I'm a little bit less stressed over what to anticipate,” explains Kunis, who also has a 3-year-old daughter, Wyatt, with Kutcher. “You're still stressed out and there's still the idea of the guilt of leaving your kids, but you know that they'll be OK. Because I've already done it once and the kid doesn't resent me, so I was like, ‘OK, I think I can do this.'\"\n\n“I also need to enlist help,” she adds. “Working full-time, my husband has moved his company here, so he works full-time. We needed help.”\n\nEXCLUSIVE: Kathryn Hahn Reveals Sweet Way She Convinced Susan Sarandon to Join 'Bad Moms Christmas'\n\nLife as a working mom is certainly made easier when Kunis is able to have her family with her while filming on location around the world. Describing her clan as a “mobile tribe,” she was thrilled to have them nearby while shooting A Bad Moms Christmas in Atlanta, Georgia.\n\nThe sequel -- which also stars Susan Sarandon, Christine Baranski and Cheryl Hines as well as returning co-stars Kristen Bell and Kathryn Hahn -- hits theaters on Nov. 3., and Kunis made the most of her downtime from the set with fun family activities.\n\n“I can write you a book on kid-friendly activities anywhere in the world,” she says. “Because that's what we do. We used to be like, ‘What's the coolest club?’ and [now] I'm like, ‘Let me tell you about the zoo in Atlanta and the bouncy house.’ There's not one kid activity that I haven't done yet with my child!\"\n\n“We have a public library card everywhere we go,” Kunis continues. “When it is really hot outside, we go to the library and read books.”\n\nLibrary visits are important for the kids, with Kunis and Kutcher endeavoring to raise open-minded children.\n\n“Yeah, we're not gonna raise a**holes. There's enough a**holes in this world!” Kunis says. “We don't need to contribute. But, you know, there's some nice people.”\n\nEXCLUSIVE: Justin Hartley Talks Getting Naked for 'Bad Moms Christmas' and 'This Is Us' Season 2\n\nIn between filming and keeping her kids entertained, Kunis has also been working hard to stay in shape following Dimitri’s birth.\n\nThe former That ‘70s Show star admitted that maintaining a post-baby body takes effort.\n\n“Lots of gym-ing,” she says. “I hate someone who's like, ‘This is all natural.’ Bullsh**. It's not natural.”\n\nWith the holidays coming up, Kunis also got candid about her evolving experience with Christmas and her family’s latest traditions.\n\n“I come from communist Russia, where you're not allowed to be happy, so my holiday traditions are ‘be quiet,’” Kunis shares. “Coming to America is when you realize Christmas has a magical quality to it. In Russia, back in the day, it was a very religious holiday, so you don't celebrate Christmas if you're not Christian and if you're not at Mass. So, I being Jewish, was like, ‘Christmas is not for you.’”\n\n“We come to America and we're like, ‘Christmas is so inclusive,’” Kunis recalls. “We literally bought a Christmas tree. So as far as tradition goes, my family's big on any excuse to get the family together and get drunk. Whether it's Easter, which we've now all accepted into our Jewish household, or Christmas, it doesn't matter. It's all family time, but having kids, we're building up our own little versions of tradition.”\n\nEXCLUSIVE: 'Bad Moms Christmas' First Look! Meet Mila Kunis and Kristen Bell's On-Screen Moms\n\nKunis explained how Wyatt and Dimitri have previously been spoiled with presents by their grandparents, which fueled her and Kutcher’s new rule.\n\n“So far, our tradition is no presents for the kids,” she says. “We're instituting it this year because when the kids are [younger than] one, it doesn't really matter. Last year when we celebrated Christmas, Wyatt was two and it was too much. We didn't give her anything -- it was the grandparents. The kid no longer appreciates the one gift. They don't even know what they're expecting; they're just expecting stuff.”\n\n“We've told our parents, ‘We're begging you -- if you have to give her something, pick one gift. Otherwise, we'd like to take a charitable donation, to the Children's Hospital or a pet [or] whatever you want.’ That's our new tradition.”\n\nSpeaking of traditions, there’s another custom Kunis enjoys -- Monday nights with The Bachelor and its various spinoffs! Every week, Kunis pours a glass of white wine and Kutcher grabs a vodka tonic before the pair enjoy their “guilty pleasure.”\n\nEXCLUSIVE: Kristen Bell Shares Motherhood Advice, Talks 'Bad Moms 2' and Rebooting 'The Good Place'\n\nThey even appeared on a recent episode of ABC’s The Bachelorette, helping Rachel Lindsay in her search for a husband.\n\n“The reason we did it was because we became genuine fans of hers,” Kunis says. “Yes, I love the show and yes, I got my poor husband hooked on it. But genuinely love her.”\n\nCheck out the trailer for A Bad Moms Christmas below.\n\n'A Bad Moms Christmas' Trailer: Mila, Kathryn and Kristen Are Back With More NSFW Antics This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRelated Gallery", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2016-06/embed_1_ashton_kutcher_mila_kunis_closeup_Getty538309054.jpg?h=eefc779a&itok=JqDgk035", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2018-12/megyn_kelly_gettyimages-1053390462_1280.jpg?h=c673cd1c&itok=GkyEoz-G", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2020-03/1280bluntjohn.jpg?h=d067a961&itok=eUNlvyAb", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-02/gettyimages-1188309777_copy.jpg?h=c673cd1c&itok=TUXJDh-j"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2016-06/embed_1_ashton_kutcher_mila_kunis_closeup_Getty538309054.jpg?h=eefc779a&itok=JqDgk035", "keywords": [], "authors": ["Leena Tailor"], "canonical_link": "https://www.etonline.com/mila-kunis-post-baby-body-new-christmas-traditions-juggling-2-kids-we-needed-help-exclusive-88513", "title": "Mila Kunis on Post-Baby Body, New Christmas Traditions & Juggling 2 Kids: ‘We Needed Help’ (Exclusive)", "meta_data": {"article": {"opinion": "false"}, "title": "Mila Kunis on Post-Baby Body, New Christmas Traditions & Juggling 2 Kids: ‘We Needed Help’ (Exclusive) | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/mila-kunis-post-baby-body-new-christmas-traditions-juggling-2-kids-we-needed-help-exclusive-88513", "title": "Mila Kunis on Post-Baby Body, New Christmas Traditions & Juggling 2 Kids: ‘We Needed Help’ (Exclusive)", "description": "The 'Bad Moms' star is opening up about juggling two children and how she got into shape after giving birth.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2016-06/embed_1_ashton_kutcher_mila_kunis_closeup_Getty538309054.jpg?h=eefc779a&itok=JqDgk035", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "The 'Bad Moms' star is opening up about juggling two children and how she got into shape after giving birth.", "title": "Mila Kunis on Post-Baby Body, New Christmas Traditions & Juggling 2 Kids: ‘We Needed Help’ (Exclusive)", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Leena Tailor‍", "url": "https://www.etonline.com/mila-kunis-post-baby-body-new-christmas-traditions-juggling-2-kids-we-needed-help-exclusive-88513", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2016-06/embed_1_ashton_kutcher_mila_kunis_closeup_Getty538309054.jpg?h=eefc779a&itok=JqDgk035"}, "description": "The 'Bad Moms' star is opening up about juggling two children and how she got into shape after giving birth.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "Movies, News, Mila Kunis, Ashton Kutcher, A Bad Moms Christmas", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}