{"url": "https://www.bbc.com/news/entertainment-arts-40248415", "text": "Image copyright PA/Getty Image caption Beyonce and JK Rowling are the only two women in the top 10\n\nIt's that time of year again - Forbes has released its list of the top 100 highest-paid entertainers and Sean \"Diddy\" Combs is top of the tree.\n\nHis earnings of $130m (£102m) pushed him up from last year's 22nd spot.\n\nHis success is down to his recent US tour, a marketing deal with a vodka company and selling one third of his Sean John clothing line.\n\nBeyonce and JK Rowling took second and third spot, but women comprise just 16% of the world's top-earning celebrities.\n\nNewcomers include Kylie Jenner, at number 59, who is the youngest list member at the age of 19. Her earnings come from her family's reality TV show - Keeping Up with the Kardashians - her namesake cosmetics company and clothing line, plus various endorsements.\n\nHalf of the top 10 are made up of musicians, while two athletes - Real Madrid's Cristiano Ronaldo and basketball star LeBron James - also make the cut.\n\nHere's a look at the top 10:\n\n1. Sean \"Diddy\" Combs - $130m (£102m)\n\nImage copyright Reuters Image caption Combs made an estimated $70m from selling a third of his clothing label\n\nGrammy award-winning rapper Combs used to be best known for best-selling albums such as No Way Out and Forever. But the entrepreneur's business interests have catapulted him into the big time, and he's jumped from number 22 in last year's list to nab this year's top spot.\n\n2. Beyonce Knowles - $105m (£82.7m)\n\nImage copyright Reuters Image caption The star is currently pregnant with twins\n\nQueen Bey needs no introduction but she's made a big leap up the chart, from number 34 last year. That's largely due to profits from her Formation tour and her most recent album, the critically-acclaimed Lemonade. Her husband, Jay-Z, could only make number 55.\n\n3. JK Rowling - $95m (£74.8m)\n\nImage copyright Reuters Image caption Rowling has recently finished the script for the next Fantastic Beasts film\n\nJK Rowling returns to the top 100, no doubt boosted by the publication of the two-part play, Harry Potter and the Cursed Child and the film release of Potter spin-off, Fantastic Beasts and Where to Find Them.\n\n4. Drake - $94m (£74.06m)\n\nImage copyright AFP Image caption The Canadian singer had a good night at the Billboard Awards last month\n\nThe Canadian hip hop star has jumped from number 69 to number four, more than doubling his fortune through touring and endorsements with the likes of Nike, Sprite and Apple.\n\n5. Cristiano Ronaldo - $93m (£73.2m)\n\nImage copyright EPA Image caption Ronaldo has scored in three different Champion's League finals\n\nThe Real Madrid footy star drops just one place on this year's list. On top of his soccer earnings, the current Fifa world player of the year also has a line of branded products including underwear and jeans, plus a lifetime deal with Nike.\n\n6. The Weeknd - $92m (£72.45m)\n\nImage copyright Getty Images Image caption The Weeknd stepped out with girlfriend Selena Gomez at the Met Ball\n\nAnother Canadian star, The Weeknd, has cracked the top 10 for the first time, having made it to number 30 last time round. His latest album, Starboy, had the third-largest debut sales week in the US of 2016. He recently collaborated with Lana Del Ray on duet, Lust for Life.\n\n7. Howard Stern - $90m (£70.86m)\n\nImage copyright Reuters Image caption Howard Stern has never shied away from controversy\n\nUS \"shock jock\" and self-styled \"king of all media\" Howard Stern holds on to the seventh spot he occupied last year. The former America's Got Talent judge is currently part way through a five-year deal with Sirius XM Radio.\n\n8. Coldplay - $88m (£69.33m)\n\nImage copyright Reuters Image caption Coldplay recently performed at the One Love Manchester concert\n\nColdplay return to the list following the success of their worldwide Head Full of Dreams tour, which finished in Australia and New Zealand in December. That's good news for the charity sector, as the band donate 10% of their profits to good causes.\n\n9. James Patterson - $87m (£68.53m)\n\nImage caption Patterson has also enjoyed huge ebook sales\n\nYes, it's another author on the list - Patterson has published more than 130 titles in his name and is believed to be the world's best-selling living author. Former US president Bill Clinton is currently writing a novel about the White House in collaboration with him.\n\n10. LeBron James - $86m (£67.8m)\n\nImage copyright EPA Image caption LeBron is a huge sporting star in the US\n\nProbably the US's best-known basketball star, the Cleveland Cavaliers player's $31m (£24.4m) salary in 2016-17 made him only the third NBA player to earn $30m in a season after Michael Jordan and Kobe Bryant. His endorsement list ain't bad either, including brands such as Nike, Coca-Cola and Beats by Dre.\n\n'Too few women' on Forbes list\n\nWe spoke to Forbes associate editor, Natalie Robehmed, about her thoughts on this year's list.\n\n\"It surprises me year on year how few women end up on the list, especially musicians. Ten out of the 100 are female musicians but there are 27 male musicians on the list.\n\n\"I think it speaks to the under-representation of women in all industries.\"\n\nRobehmed pointed to streaming as one of the main income generators.\n\n\"This year really shows streaming has become more important than ever. Dave Chapelle (number 43), Adam Sandler (number 35) and Chris Rock (number 30) have all benefited from Netflix deals.\"\n\nAnd is there an argument that lists like this, in publicising such huge incomes, are a bit distasteful?\n\nRobehmed has a different take.\n\n\"With the gap between rich and poor widening, it's even more important to know what the rich are up to and to track them. The public have a right to know.\n\n\"Celebrities can go on to be politicians - think Ronald Reagan, Arnie Schwarzenegger and possibly Chris Rock - let's start taking them seriously.\"\n\nFollow us on Facebook, on Twitter @BBCNewsEnts, or on Instagram at bbcnewsents. If you have a story suggestion email entertainment.news@bbc.co.uk.", "images": ["https://a1.api.bbc.co.uk/hit.xiti?&col=1&from=p&ptag=js&s=598253&p=entertainment_and_arts::news.entertainment_and_arts.story.40248415.page&x1=[urn:bbc:cps:0833bd35-dc2e-aa4e-986a-50deea491d61]&x2=[responsive]&x3=[bbc_website]&x4=[en]&x7=[article]&x8=[reverb-1.4.0-nojs]&x11=[NEWS_GNL]&x12=[NEWS]", "https://ssc.api.bbc.com/?c1=2&c2=19293874&ns_site=bbc&name=", "https://ichef.bbci.co.uk/news/320/cpsprodpb/07B6/production/_96447910_forbes_split.jpg", "https://ichef.bbci.co.uk/news/1024/branded_news/07B6/production/_96447910_forbes_split.jpg"], "top_img": "https://ichef.bbci.co.uk/news/1024/branded_news/07B6/production/_96447910_forbes_split.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bbc.com/news/entertainment-arts-40248415", "title": "Forbes rich list: Which celebrities earned the most over the past year?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Forbes releases its top 100 list of the world's highest-paid entertainers - find out the movers and shakers.", "x-country": "hk", "x-audience": "Asia", "CPS_AUDIENCE": "Asia", "CPS_CHANGEQUEUEID": 0, "og": {"title": "Top-earning celebrities revealed", "type": "article", "description": "Forbes releases its top 100 list of the world's highest-paid entertainers - find out the movers and shakers.", "site_name": "BBC News", "locale": "en_GB", "url": "https://www.bbc.com/news/entertainment-arts-40248415", "image": {"identifier": "https://ichef.bbci.co.uk/news/1024/branded_news/07B6/production/_96447910_forbes_split.jpg", "alt": "BBC News. Beyonce, Sean Combs, JK Rowling"}}, "article": {"author": "https://www.facebook.com/bbcnews", "section": "Entertainment & Arts"}, "fb": {"pages": "1143803202301544,317278538359186,1392506827668140,742734325867560,185246968166196,156060587793370,137920769558355,193435954068976,21263239760,156400551056385,929399697073756,154344434967,228735667216,80758950658,260212261199,294662213128,1086451581439054,283348121682053,295830058648,239931389545417,304314573046,310719525611571,647687225371774,1159932557403143,286567251709437,1731770190373618,125309456546,163571453661989,285361880228,512423982152360,238003846549831,176663550714,260967092113,118450564909230,100978706649892,15286229625,122103087870579,120655094632228,102814153147070,124715648647,153132638110668,150467675018739", "app_id": 1609039196070050, "admins": 100004154058350}, "twitter": {"card": "summary_large_image", "site": "@BBCWorld", "title": "Top-earning celebrities revealed", "description": "Forbes releases its top 100 list of the world's highest-paid entertainers - find out the movers and shakers.", "creator": "@BBCWorld", "image": {"src": "https://ichef.bbci.co.uk/news/1024/branded_news/07B6/production/_96447910_forbes_split.jpg", "alt": "Beyonce, Sean Combs, JK Rowling"}, "domain": "www.bbc.com"}, "apple-itunes-app": "app-id=364147881, app-argument=https://www.bbc.com/news/entertainment-arts-40248415?utm_medium=banner&utm_content=apple-itunes-app", "apple-mobile-web-app-title": "BBC News", "application-name": "BBC News", "msapplication-TileImage": "BBC News", "msapplication-TileColor": "#bb1919", "mobile-web-app-capable": "yes", "robots": "NOODP,NOYDIR", "theme-color": "#bb1919"}, "movies": [], "publish_date": null, "source": "https://www.bbc.com", "summary": ""}