{"url": "https://www.bustle.com/p/robin-wright-says-she-was-surprised-by-kevin-spacey-allegations-in-new-house-of-cards-interview-9695896", "text": "With House of Cards returning for its final season without its former star, Kevin Spacey, many fans are looking for closure. But they're unlikely to find it in Robin Wright's statement on Kevin Spacey. In a new interview with TODAY, the actor spoke at length on the subject of Spacey's firing, but added no new information. Wright claimed that she was \"surprised\" by the allegations against her former costar, insisting that even after five years of sharing the screen, she \"never knew the man.\"\n\nWright broke her silence during a TODAY segment on Monday, in which Wright spoke with Savannah Guthrie about her perspective on Spacey's departure from the series. \"I think we were all surprised, of course, and ultimately saddened,\" she shared, adding, \" [but] we forged ahead, and we were so thankful that we were able to complete the series as planned.\" She's referring, of course, to the allegations of sexual harassment and assault brought against Spacey late last year that led to his termination from the Netflix series, leaving the fate of House of Cards uncertain until the decision was made for Claire Underwood to helm the final season.\n\nSpacey has faced multiple claims of sexual assault and harassment, most publicly by Anthony Rapp, who accused Spacey of assaulting him when the former was just a teenager. Spacey has denied those claims and others, saying in a statement that he had no memory of the incident, but \"if I did behave then as he describes, I owe him the sincerest apology for what would have been deeply inappropriate drunken behavior.\"\n\nIn her recent interview, Wright insisted that she never personally experienced any of this kind of behavior from her co-star, saying that the two were not friends outside of work. \"I didn't really — I didn't know the man. I knew the incredible craftsman that he is,\" she said. As for her own experience with the actor on set, Wright said it was always professional:\n\n\"We were coworkers, really, we weren't — we never socialized outside of work. [It was a] respectful, professional relationship. He was so great with me, and was never disrespectful to me. So, that's my personal experience. That's the only thing I feel that I have the right to talk about.\"\n\nWhile it's refreshing that Wright doesn't wish to speak for someone else's experience, it's interesting to note that all her commentary about Spacey was positive. She distances herself from her former costar, but uses words like \"respectful,\" \"great,\" and \"professional\" to characterize him.\n\nEven when prodded by Guthrie, Wright wouldn't go so far as to say that Netflix had made the right decision in cutting Spacey loose. \"I don't know how to comment on that,\" she said, continuing:\n\n\"But I think at that time, the shock was so intense all over the nation, for many reasons, many stories, many people — I think that everybody felt that it was respectful to back off.\"\n\nNetflix on YouTube\n\nFans will likely never know what actually happened, or who knew — or suspected — what and when. But, as Wright points out, viewers can at least be happy that the remaining cast and crew continued on with the show to give audiences one last season.\n\nIf you or someone you know has been sexually assaulted, call the National Sexual Assault Telephone Hotline at 800-656-HOPE (4673) or visit online.rainn.org.", "images": ["https://imgix.bustle.com/uploads/image/2020/4/6/d773bbcf-aca6-4787-897b-6a5381c64782-odaat_304_unit_00940r.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/14/00157ed3-b4fe-4e33-a6bd-1541604cd801-15_gallery_jay-ellis_0117_01.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/16/060a47f5-6a46-41c6-b963-760894135871-getty-966471954.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/2/8558afdb-4b6e-4514-a156-aba4d131d282-25013969-a05d-4cc1-b656-cd34b2b44c99-getty-1203660027.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2018/7/9/d86f2cad-478e-4af1-862a-da7fd82ee4e4-getty-471403214.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2018/7/9/d86f2cad-478e-4af1-862a-da7fd82ee4e4-getty-471403214.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/7/9/d86f2cad-478e-4af1-862a-da7fd82ee4e4-getty-471403214.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/robin-wright-says-she-was-surprised-by-kevin-spacey-allegations-in-new-house-of-cards-interview-9695896", "title": "Robin Wright Says She Was \"Surprised\" By Kevin Spacey Allegations In New 'House Of Cards' Interview", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/robin-wright-says-she-was-surprised-by-kevin-spacey-allegations-in-new-house-of-cards-interview-9695896", "type": "article", "title": "Robin Wright Finally Breaks Her Silence On The Kevin Spacey Allegations", "description": "With House of Cards returning for its final season without its former star, Kevin Spacey, many fans are looking for closure. But they're unlikely to find it in Robin Wright's statement on Kevin Spacey. In a new interview with TODAY, the actor spoke…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/7/9/d86f2cad-478e-4af1-862a-da7fd82ee4e4-getty-471403214.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "With House of Cards returning for its final season without its former star, Kevin Spacey, many fans are looking for closure. But they're unlikely to find it in Robin Wright's statement on Kevin Spacey. In a new interview with TODAY, the actor spoke…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}