{"url": "https://www.elitedaily.com/p/clues-about-taylor-swifts-delicate-music-video-are-here-were-so-pumped-8441582", "text": "Taylor Swift's \"Delicate\" music video is dropping on Sunday, March 11, during the iHeart Radio Music Awards, but outside of those details, we haven't been told much else about the video. But Joseph Kahn, the director of the music video and lots of the singer's past videos, just dropped the biggest clues about Taylor Swift's \"Delicate\" music video we've gotten since the release was announced and fans are so excited, but also super worried.\n\nIn an interview with E! News, Swift's longtime music video director gave some insight into what fans can expect to see in the video when it drops on March 11. \"It's going to be unexpected and it's going to be grand,\" he said. He continued,\n\nI can't get into too much detail. The need is love and the expression of it. And it's not about flowers. People have been sending me ideas, and generally it's like flowers, or pink dresses or blue skies. And those are all the things you'd think you'd want in a video, but they wouldn't fill what you need out of a song like that. So, I think I have a plan here to address that, but it's completely unexpected.\n\nFans are nervous about what the video could turn out like based on Kahn's comments. They have one vision in mind that doesn't necessarily match with what Kahn described. And Kahn addressed the fans who have apparently been sending him ideas for the music video on Twitter. In a tweet on March 2, Kahn said, \"You can stop sending me fan concepts lol, video was shot weeks ago.\"\n\nFans aren't too excited about the idea of a futuristic \"Delicate.\" It's fair to assume, based on the \"...Ready For It?\" and \"End Game\" music videos (which Kahn also directed) that \"Delicate\" would also be futuristic.\n\nKahn has been dropping hints on his Twitter that the music video is going to have a futuristic vibe. That's what fans are making of this tweet, at least.\n\nThey feel it's too coincidental that Kahn included the word \"delicate\" in this tweet about the Mars robot that said, \"It's insane the Mars robot found these tiny, delicate markings.\"\n\nOther fans are just excited Kahn gave an actual clue about the music video and not just some vague statement.\n\nSwift announced the upcoming world premiere of the \"Delicate\" music video on March 5.\n\nThe video she posted on Instagram shows Swift opening a piece of paper that reads, \"Delicate Music Video World Premiere. Sunday, March 11. iHeart Radio Music Awards.\" The video will be the fourth music video from Swift's Reputation album. The first was the controversial \"Look What You Made Me Do,\" the second was \"...Ready For It?\" and the third was \"End Game\" featuring Ed Sheeran and Future.\n\nSwift released a behind-the-scenes video showing the making of \"Delicate\" on Nov. 15, 2017.\n\nTaylor Swift on YouTube\n\nThe video shows Swift working on creating the lyrics, tune, and beat of \"Delicate.\" iHeartRadio also shared details from the Reputation release party, during which Swift said of one of the vocal features on \"Delicate,\"\n\nThere's an effect that you may hear on the vocals throughout the vocals on the rest of the album that is recurring, and it's a vocoder. It's a vocal effect where you sing, and the vocoder splits your voice into chords, and you can play your voice on a keyboard, in chords. So basically, if you're singing the notes of a piano, and you could play your own voice. So that's what you'll hear in the beginning, and throughout the song, and then you'll hear it several times. We tried it in the studio, and I thought it sounded really emotional, and really vulnerable, and really kind of, like, sad but beautiful.\n\nShe continued,\n\nThe idea of your reputation is definitely something that I play on for the entire album, but when the album starts off it's much more bombastic. It's more like, 'Oh, I don't care what you say about me, I don't care what you say about my reputation, it doesn't matter.' But then it hits this point, on track five, where it's like, oh god, what happens when you meet somebody that you really want in your life and then you start worrying about what they've heard before they met you. And you start to wonder, could something fake, like your reputation, affect something real, like somebody getting to know you? And you start to wonder, how much does all that matter? And this is the first point of vulnerability in the record where you're like, oh maybe this does actually matter a little bit. And how does that factor in, kind of questioning the reality and the perception of a reputation, and how much weight it actually has.\n\nI'm not quite sure where a futuristic vibe is going to fit in with this song, but I guess we'll find out what Kahn meant in his statement and tweets on Sunday, March 11.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/image/2020/4/9/12164869-6e6e-4021-992b-846bdc6cb9ff-lead-image-9.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/3/8/d8f3ee39-d296-4ad7-a839-c04fb7c8c307-gettyimages-486009884.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2020/4/16/dfe9d464-85db-4695-9f18-061ddea19988-lead-image-16.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/14/d2334b46-c781-4bdf-bc76-ef0a9b83a320-getty-1204840126.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2018/3/8/d8f3ee39-d296-4ad7-a839-c04fb7c8c307-gettyimages-486009884.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70"], "top_img": "https://imgix.bustle.com/uploads/image/2018/3/8/d8f3ee39-d296-4ad7-a839-c04fb7c8c307-gettyimages-486009884.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/clues-about-taylor-swifts-delicate-music-video-are-here-were-so-pumped-8441582", "title": "Clues About Taylor Swift's \"Delicate\" Music Video Are Here & We're So Pumped", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/clues-about-taylor-swifts-delicate-music-video-are-here-were-so-pumped-8441582", "type": "article", "title": "Taylor Swift's \"Delicate\" Music Video Is Coming & Its Director Just Dropped Huge Hints", "description": "Taylor Swift's \"Delicate\" music video is dropping on Sunday, March 11, during the iHeart Radio Music Awards, but outside of those details, we haven't been told much else about the video. But Joseph Kahn, the director of the music video and lots of…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/3/8/d8f3ee39-d296-4ad7-a839-c04fb7c8c307-gettyimages-486009884.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "Taylor Swift's \"Delicate\" music video is dropping on Sunday, March 11, during the iHeart Radio Music Awards, but outside of those details, we haven't been told much else about the video. But Joseph Kahn, the director of the music video and lots of…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}