{"url": "https://www.washingtonpost.com/politics/it-totally-belittled-the-moment-many-look-back-in-anger-at-trumps-tossing-of-paper-towels-in-puerto-rico/2018/09/13/8a3647d2-b77e-11e8-a2c5-3187f427e253_story.html", "text": "White House aides reacted at the time with a mix of grimaces and chuckles over what they saw as classic Trump — acting insensitively but, in his own way, playfully to offer amusement to locals who were happy to see him. A pool reporter that day called the scene “surreal” and described Trump doing his “best Stephen Curry impersonation” as he aimed the towels to the far reaches of the crowd, a performance “they enjoyed.”\n\nBut nearly a year later, viewed in the prism of a new report about the lethal legacy of Maria, the moment last October does not seem as lighthearted. Trump’s day in San Juan — limited to the better fortified neighborhoods of the capital and far from the most catastrophic destruction — included other scenes that suggested the president was eager to congratulate himself prematurely and to minimize a rapidly deepening tragedy.\n\nAD\n\nAD\n\nThe paper-towel moment in particular has come to symbolize what critics say is Trump’s inability to sympathize with others — and his self-absorbed leadership in a time of crisis.\n\n“One could argue it was nothing but then you could argue it was everything,” José Andrés, the celebrity chef who oversaw a massive operation to provide meals on the island, said in an interview Thursday. “It showed such a lack of empathy.”\n\nTrump’s performance reminds some of a Republican predecessor, George W. Bush, who declared “mission accomplished” in May 2003 during a visit to an aircraft carrier supporting troops in the Iraq War — which would slog on eight more years. Two years later, Bush rushed to congratulate his Federal Emergency Management Agency director for a “heckuva job” in response to Hurricane Katrina, a storm that was blamed for the deaths of more than 1,800 people.\n\nAt the makeshift supply center last October at Calvary Chapel, Trump scoffed at a water purification kit that could help save lives. He awarded “A+” grades for his administration for its response to a pair of other hurricanes that struck Texas, Louisiana and Florida. And he characterized a death toll of 16 in Puerto Rico as a kind of victory, though the count would officially grow to 34 later in the day.\n\n“There’s a lot of love in this room,” Trump, wearing a dark hooded windbreaker, boasted in the church.\n\nAD\n\nAD\n\nThings look far more grim approaching Maria’s first anniversary. A report last month from George Washington University, commissioned by the Puerto Rican government, found that an estimated 2,975 more people died on the island in the six months following the storm than would have been expected under typical mortality rates — a figure that Puerto Rico’s governor accepted as the official death toll.\n\nTrump, furious over what he considers revisionist history, has angrily watched the clips of him tossing paper towels on television and disputed the death numbers Thursday on Twitter, declaring it a conspiracy from Democrats.\n\nBut on the island, many residents have honed in on Trump’s moment at the church.\n\nAD\n\n“That was disrespectful,” said Ramon Pachaco, 58, whose house in Ponce, on the island’s southern coast, suffered $26,000 in damage. Trump’s message to local residents, he said, amounted to: “If you want to cry, dry your tears with this.”\n\nAD\n\n'We get an A+'\n\nMaria wasn’t the only crisis the president was dealing with as he and first lady Melania Trump emerged from the White House just after 8 a.m. on Oct. 3, 2017, to start the day trip to San Juan.\n\nTwo days earlier, a gunman had slaughtered 58 people at an outdoor country music concert in Las Vegas.\n\nOn the South Lawn, the president responded to shouted questions from reporters, calling the mass shooting a “tragedy.” Asked about Puerto Rico, Trump declared victory in an escalating feud with San Juan Mayor Carmen Yulín Cruz, who had criticized his administration’s response.\n\nAD\n\n“It’s now acknowledged what a great job we’ve done,” Trump declared. “In Texas and in Florida, we get an A+. I think we’ve done just as good in Puerto Rico.”\n\nWhite House aides viewed the president’s trip as an important visual counterbalance to his response to the storms on the mainland. Trump already had visited Texas and Florida, but he had appeared more callous toward Puerto Rico, criticizing the island’s poor infrastructure, including the electrical grid, and complaining that the cost of the emergency response would throw the federal budget “out of whack.”\n\nTo Mark Merritt, who served as a FEMA manager in the Clinton administration, Trump had already set the wrong tone for his visit.\n\nAD\n\nAD\n\n“No one ever gives themselves a grade on disaster response,” said Merritt, who has served as a consultant for the Puerto Rico government over the past year. “The president should have come out and said, ‘This is the first truly catastrophic disaster in U.S. history. Never have we had a state that has been devastated with 100 percent of the state impacted.”\n\nAides had set up a full itinerary. The Trumps would meet with people affected by the storm, receive a briefing from local officials and greet U.S. sailors and Marines assisting in the recovery.\n\n“I’ve been to Puerto Rico many times and the weather is second to none, but sometimes you get hit and you got hit,” Trump said, after disembarking Air Force One at a National Guard base in San Juan. Energy Secretary Rick Perry, who had accompanied Trump, gave Puerto Rico Gov. Ricardo Rosselló a hug and an emphatic handshake. Rosselló, in contrast to the San Juan mayor, had spoken positively of the White House.\n\nAD\n\nAD\n\nAfter a private briefing, the Trumps proceeded on a walking tour of the relatively affluent Guaynabo neighborhood, where they posed for photos with a local family.\n\nNext stop was Calvary Chapel, for the carefully scripted photo op of Trump handing out supplies. It was something he had done a month earlier in a subdivision in Fort Myers, Fla., where he and the first lady, along with Vice President Pence, had passed out hoagies and bottled water to residents affected by Hurricane Irma.\n\nAs soon as Trump entered the church in San Juan, dozens of locals began cheering, snapping photos and straining to shake his hand.\n\n'It totally belittled the moment'\n\nAndrés was disgusted by Trump’s behavior in the church.\n\nAD\n\n“You don’t throw them. You hand them,” he said of the paper towels. “You look the people in the eye and tell them, ‘We’re here for you, and we’ll do our best to provide relief for you and your family.’”\n\nAD\n\nCurrent and former White House aides acknowledged that the imagery was unhelpful, overshadowing the breadth of the administration’s response. The federal government approved $1.39 billion in grants for more than 462,000 homeowners and renters, and the U.S. Small Business Administration authorized $1.8 billion in low-interest disaster loans, aides said.\n\n“Our sense was that it was a good trip, the president did well, and a lot of the coverage was unfair,” said one former administration official, who spoke on anonymity to discuss the thinking of the president’s team.\n\nAD\n\nThe paper towel moment “was relatively minor and the media exploited it,” this person added.\n\nAnother former official argued that “the throwing of the paper towels was one of the funniest things of all time” and brought a bit of humor to an otherwise somber visit.\n\nIn the video, Trump can be seen throwing six rolls in 20 seconds, posing for a selfie in the middle of it. Then he picks up a different item and pretends to toss that to the crowd, drawing oohs.\n\nAD\n\n“His inexperience and lack of understanding of the process made him feel like this is a campaign event,” Merritt said. “It totally belittled the moment and did more damage than good.”\n\nNearly a year later, White House aides have tried to keep Trump focused on the looming threat of Florence. More than 1.5 million people have been evacuated from coastal regions in the Southeast.\n\nBut the president has become increasingly infuriated by the focus on his San Juan trip, aides said. His tweets — arguing that Democrats inflated the official death count “to make me look as bad as possible” — have led to still more coverage, contributing to what aides described as a vicious cycle.\n\nIt’s a far cry from last October, as Air Force One streaked back from San Juan toward Washington and a triumphant Trump chatted with reporters on the plane.\n\nAD\n\nAsked if he’d received any constructive criticism, the president replied: “None. They were so thankful for what we’ve done. I think it’s been a great day. No, we only heard thank yous from the people of Puerto Rico.”", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/98ea397c-2d5f-45dc-8cf5-292bcf5610fd.png&w=90&h=90", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/c29656ae-2a6a-4142-8e34-4fde090356dc.png&w=90&h=90", "https://www.washingtonpost.com/resizer/odMTeNm9dg8vHNeYvQXyqEGYhzQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DGBQFRVK3EI6PM5KYDRODVA6HA.jpg"], "top_img": "https://www.washingtonpost.com/resizer/odMTeNm9dg8vHNeYvQXyqEGYhzQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DGBQFRVK3EI6PM5KYDRODVA6HA.jpg", "keywords": [], "authors": ["David Nakamura", "Reporter Covering The White House", "Ashley Parker", "White House Reporter"], "canonical_link": "https://www.washingtonpost.com/politics/it-totally-belittled-the-moment-many-look-back-in-anger-at-trumps-tossing-of-paper-towels-in-puerto-rico/2018/09/13/8a3647d2-b77e-11e8-a2c5-3187f427e253_story.html", "title": "‘It totally belittled the moment’: Many look back in dismay at Trump’s tossing of paper towels in Puerto Rico", "meta_data": {"description": "The president’s lighthearted visit to San Juan in the wake of Hurricane Maria now reminds some of Bush’s ‘mission accomplished’ and Katrina moments.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/politics/it-totally-belittled-the-moment-many-look-back-in-anger-at-trumps-tossing-of-paper-towels-in-puerto-rico/2018/09/13/8a3647d2-b77e-11e8-a2c5-3187f427e253_story.html", "image": "https://www.washingtonpost.com/resizer/odMTeNm9dg8vHNeYvQXyqEGYhzQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DGBQFRVK3EI6PM5KYDRODVA6HA.jpg", "title": "‘It totally belittled the moment’: Many look back in dismay at Trump’s tossing of paper towels in Puerto Rico", "description": "The president’s lighthearted visit to San Juan in the wake of Hurricane Maria now reminds some of Bush’s ‘mission accomplished’ and Katrina moments."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "‘It totally belittled the moment’: Many look back in dismay at Trump’s tossing of paper towels in Puerto Rico", "description": "The president’s lighthearted visit to San Juan in the wake of Hurricane Maria now reminds some of Bush’s ‘mission accomplished’ and Katrina moments."}, "last_updated_date": "2018-09-14T13:57:25.177Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1536768000.0, "source": "https://www.washingtonpost.com", "summary": ""}