{"url": "https://www.cbsnews.com/news/ariana-grande-sends-love-to-manchester-one-year-after-attack/", "text": "LONDON — Ariana Grande sent her love to fans on Tuesday as dignitaries, survivors, first responders and the people of Manchester gathered to mark the anniversary of the concert bombing that killed 22 people. The pop star wrote in a tweet to survivors and the families of victims that she was \"thinking of you all today and every day.\"\n\n\"I love you with all of me and am sending you all of the light and warmth I have to offer on this challenging day,\" she wrote in a tweet that included a bee, the civic symbol of Manchester.\n\nthinking of you all today and every day 🐝 I love you with all of me and am sending you all of the light and warmth I have to offer on this challenging day — Ariana Grande (@ArianaGrande) May 22, 2018\n\nSalman Abedi, a 22-year-old Briton of Libyan descent, blew himself up as fans were leaving Grande's concert at Manchester Arena on May 22, 2017. Twenty-two concertgoers were killed, and police say more than 800 people were left \"with physical and deep psychological injuries.\" Grande suspended her Dangerous Woman Tour after the bombing and returned for the One Love Manchester charity concert weeks later, which raised funds for victims of the attack.\n\nLast June, Grande was made an honorary citizen of Manchester after a unanimous vote by the city council. The singer has paid tribute to victims of the attack, including the youngest, Saffie Roussos, who would have turned 9 last July. During Grande's July show in Buenos Aires, the singer reprised her take on \"Somewhere Over the Rainbow,\" which she also performed at One Love. She closed off the song by blowing a kiss and saying, \"Happy birthday, Saffie.\"\n\nOn Tuesday, across Manchester, residents made defiant statements of unity in the face of extremist violence.\n\nSome laid bouquets of flowers in St. Ann's Square; others left hand-written notes on Japanese maples that have been planted to form a \"Trees of Hope\" trail through the city. One note cited U.S. Episcopal bishop Michael Curry's sermon at Saturday's royal wedding: \"As a clever bishop said 'there is power in love.'\"\n\nA girl cries as she looks at at tributes left in St Anne's Square on the first anniversary of the Manchester Arena bombing, in Manchester, England, May 22, 2018. Andrew Yates / REUTERS\n\nGreater Manchester Mayor Andy Burnham said it was a day to \"come together.\"\n\nThousands of people paused outside Manchester Cathedral at 2:30 p.m. for a minute of silence that was observed across the country — including in Parliament, where lawmakers paused their debates and fell still.\n\nPrince William and Prime Minister Theresa May joined survivors and emergency workers who responded to the attack for a remembrance service at the cathedral.\n\nA choir sang \"Amazing Grace\" and \"Somewhere Over the Rainbow,\" and Christian, Jewish, Hindu, Sikh, Muslim and humanist leaders all addressed the congregation.\n\nOn the altar stood 22 lit candles, made from the wax of thousands of candles left in the city's St. Ann's Square in the days after the attack.\n\nWilliam read a passage from the Bible's book of Corinthians, ending: \"Faith, hope and love abide, these three; but the greatest of these is love.\"\n\nRobby Potter, who was hit by shrapnel as he waited to pick his daughter up from the concert, said he felt he had to come to the service \"to support the families who have lost people.\"\n\n\"We were very lucky, we know how lucky we are,\" he told Sky News. \"It's a case of standing strong. The country stood strong, especially Manchester.\"\n\nLater, thousands of people — including a choir of survivors — are due to gather for a concert and sing-song in St. Ann's Square. The event will include renditions of Grande's \"One Last Time\" and \"Look Back In Anger\" by Oasis, which became an unofficial anthem of Manchester after the bombing.\n\nBells on the city hall and churches will ring out at 10:31 p.m., exactly a year since the bomb exploded.\n\nPolice say 100 investigators are still working on the case. The U.K. has issued an arrest warrant for Abedi's younger brother, Hashem Abedi, and is seeking his extradition from Libya — a far-from-straightforward process given that country's political chaos.", "images": ["https://cbsnews1.cbsistatic.com/hub/i/r/2019/11/19/186936ea-2db7-4a48-b750-74f38f653dc6/thumbnail/640x360/80fb8996993802606d5c971761bf5b42/newsletter-breakingnews.jpg", "https://cbsnews1.cbsistatic.com/hub/i/2017/06/05/c1113abf-f9a0-45d6-b570-801812765379/gettyimages-692324262.jpg", "https://cbsnews1.cbsistatic.com/hub/i/r/2018/05/22/ae3f1101-9089-4778-b732-1ee9325a4db6/thumbnail/1200x630/f839d9efc0efc8c6025ee4b6199cf071/rts1spjw.jpg", "https://cbsnews3.cbsistatic.com/hub/i/r/2018/05/22/ae3f1101-9089-4778-b732-1ee9325a4db6/thumbnail/620x421/1b4687100baa4cafa3aed26193f8b016/rts1spjw.jpg"], "top_img": "https://cbsnews1.cbsistatic.com/hub/i/r/2018/05/22/ae3f1101-9089-4778-b732-1ee9325a4db6/thumbnail/1200x630/f839d9efc0efc8c6025ee4b6199cf071/rts1spjw.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.cbsnews.com/news/ariana-grande-sends-love-to-manchester-one-year-after-attack/", "title": "Ariana Grande sends love to Manchester one year after attack", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1, user-scalable=0", "robots": "index, follow", "description": "Tuesday marked the first anniversary of the concert bombing that killed 22 people", "keywords": "Ariana Grande Concert Explosion, manchester attack, Manchester Arena Explosion, Ariana Grande", "news_keywords": "Ariana Grande Concert Explosion, manchester attack, Manchester Arena Explosion, Ariana Grande", "al": {"web": {"url": "https://www.cbsnews.com/news/ariana-grande-sends-love-to-manchester-one-year-after-attack/"}, "ios": {"app_name": "CBS News", "app_store_id": 334256223, "url": "cbsnewsapp://cbsnews.com/news/ariana-grande-sends-love-to-manchester-one-year-after-attack/"}, "android": {"app_name": "CBS News", "package": "com.treemolabs.apps.cbsnews"}}, "og": {"type": "article", "url": "https://www.cbsnews.com/news/ariana-grande-sends-love-to-manchester-one-year-after-attack/", "title": "Ariana Grande sends love to Manchester one year after attack", "description": "Tuesday marked the first anniversary of the concert bombing that killed 22 people", "image": {"identifier": "https://cbsnews1.cbsistatic.com/hub/i/r/2018/05/22/ae3f1101-9089-4778-b732-1ee9325a4db6/thumbnail/1200x630/f839d9efc0efc8c6025ee4b6199cf071/rts1spjw.jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 1536620209892267, "pages": 131459315949}, "article": {"publisher": "https://www.facebook.com/CBSNewsEntertainment", "content_tier": "free", "opinion": "false"}, "twitter": {"dnt": "on", "app": {"country": "US", "name": {"iphone": "CBS News", "ipad": "CBS News", "googleplay": "CBS News"}, "id": {"iphone": 334256223, "ipad": 334256223, "googleplay": "com.treemolabs.apps.cbsnews"}, "url": {"iphone": "cbsnewsapp://cbsnews.com/news/ariana-grande-sends-love-to-manchester-one-year-after-attack/", "ipad": "cbsnewsapp://cbsnews.com/news/ariana-grande-sends-love-to-manchester-one-year-after-attack/", "googleplay": "cbsnewsapp://cbsnews.com/news/ariana-grande-sends-love-to-manchester-one-year-after-attack/"}}, "site": "@CBSNewsEnt", "title": "Ariana Grande sends love to Manchester one year after attack", "description": "Tuesday marked the first anniversary of the concert bombing that killed 22 people", "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2018/05/22/ae3f1101-9089-4778-b732-1ee9325a4db6/thumbnail/1200x630/f839d9efc0efc8c6025ee4b6199cf071/rts1spjw.jpg", "card": "summary_large_image"}, "theme-color": "#101010", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "CBS News", "apple-mobile-web-app-status-bar-style": "black"}, "movies": [], "publish_date": null, "source": "https://www.cbsnews.com", "summary": ""}