{"url": "https://web.archive.org/web/20171107233836/http://www.bravotv.com:80/blogs/jlo-hit-on-a-rod-dressed-as-her-shades-of-blue-character", "text": "Jennifer Lopez and Alex Rodriguez had met only once before — 12 years earlier at a Mets-Yankees subway series game after her ex-husband Marc Anthony threw out the first pitch.\n\nBut J.Lo felt compelled to approach the former baseball star last winter in Beverly Hills after she finished lunch (tortilla soup). She tells Vanity Fair that she could have easily walked away, but instead she tapped him on the shoulder and the rest is history.\n\n\"It was last winter as she was having lunch in Beverly Hills that she saw Rodriguez walk by. 'I almost yelled out ‘Alex,’ but I am the shyest person when it comes to things like that,'\" says the mag. \"When she went outside, he was still there, facing away from her. 'I could literally just have walked away. But I walk over and tap him on the shoulder and say 'Hey.' I had just come from a promo for my show, Shades of Blue [in which she plays N.Y.P.D. detective Harlee Santos], so I’m dressed like my character, like a boy — Timberlands, jeans, curly short hair. He looks at me. I say, 'It’s Jennifer.' He says, 'You look so beautiful.'\"\n\nA-Rod texted her (or Harlee, whoever he thought she was) late that afternoon and a few nights later, the two went to dinner, neither knowing if it was a date.\n\n\"We talk about their first date, when they met for dinner at the Hotel Bel Air. 'He was sitting there in his white shirt, very confident and manly, but then he was just so talkative! I think he thought I was going to be this loud person, but I’m not. I just listen. So he’s talking, talking about his plans, about how he had just retired from baseball, about how he saw himself getting married again, all these things you wouldn’t normally talk about on a first date. I don’t know if he thought it was a date. I thought it was a date. Then I knew he was nervous because he asked me if I wanted a drink. I said, 'No, I don’t drink,' and he asked if I minded if he had one. He was nervous, and it was really cute.'\"\n\nA-Rod, calling her \"one of the smartest, greatest women in the world,\" says that \"she told me around the third or fourth inning that she was single.\"\n\n\"I didn’t know if it was a date,\" he says. \"Maybe we were seeing each other at night because of her work schedule. I went in uneasy, not knowing her situation … I had to get up and go re-adjust my thoughts. I went to the bathroom and got enough courage to send her a text.\"\n\n\"So I’m sitting there and he’s walking back, and I get a text,\" Jennifer adds. \"It says . . .\" 'You can tell her!' he says.' 'You look sexy AF.'\n\nThey both laugh. 'And then it took a turn. The fire alarm went off, and we had to evacuate.' I laugh, thinking she’s being metaphorical. 'No, really. The fire alarm went off!'\"\n\nThe two say now that they are in their 40’s and have both seen public scandals and breakups, they were ready for each other.\n\n\"I understand him in a way that I don’t think anyone else could, and he understands me in a way that no one else could ever,\" Jennifer says. \"In his 20s, he came into big success with the biggest baseball contract [at the time]. I had a No. 1 movie and a No. 1 album and made history. We both had ups and downs and challenges in our 30s, and by our 40s we’d both been through so much. And more importantly than anything, we had both done a lot of work on ourselves.\"\n\nThey both believe that if they had been single when they met, 12 years ago, the relationship wouldn’t have worked. \"We had to grow and discover ourselves first,\" J.Lo says.\n\nAnd you know what? These two just may last.\n\n\"J.Lo and A-Rod, by the way they come from very similar backgrounds, they started with nothing,\" says Fran Greene, relationship expert and author of Dating Again with Courage & Confidence. \"They’re both Hispanic, have been married, both have children, have both been very famous.\"\n\nGreene says that one of the variables that will either make or break them is how they deal with each other’s fame and fortune. \"She’s working like crazy, he’s reinventing himself, he's on Shark Tank, they both work a lot,\" she says. \"If they are not competitive with the fame and can negotiate how to share the spotlight, they are young enough to have a long life together.\"\n\nTheir children getting along is an added bonus, \"there are a lot of things going for them,\" says Greene. \"The anger and the resentment at the exes have been dealt with. If someone, especially with the fame and the power, has gotten out of their system what they think they’re entitled to and put it in perspective, it’s another reason it may work.\"\n\nThe hallmark of a good relationship for two people who have fame and fortune is respecting each’s individuality. \"It’s recognizing some of the challenges and some of the difficulties. How you maintain some of the privacy and that’s incredibly important,\" Greene says, adding that you can \"absolutely conquer your past demons ... and timing is 50 percent of any relationship. People recently divorced or separated often meet someone within six months and then it evaporates because they cannot manage their life alone. What J.Lo is saying is she can manage her life alone now, but it’s so much better to have someone with you. As for his steroid scandal, we all do things we’re ashamed of and that we wish we didn’t. One option is to beat yourself up continuously, one is to blame everyone else, and the third is accepting your piece.\"", "images": ["https://web.archive.org/web/20171107233836im_/http://www.bravotv.com/sites/nbcubravotv/files/field_blog_image/2017/11/personal-space-jlo-arod-text.jpg", "https://web.archive.org/web/20171107233836im_/http://www.bravotv.com/sites/nbcubravotv/files/styles/related-posts--computer/public/field_blog_image/2016/03/dish-030116-jlo.jpg?itok=7a_Q4mN4&timestamp=1456847329", "https://web.archive.org/web/20171107233836im_/http://www.bravotv.com/sites/nbcubravotv/files/styles/blog-post--mobile/public/field_blog_image/2017/11/personal-space-jlo-arod-text.jpg?itok=aNSq1xhX&timestamp=1509565063", "https://web.archive.org/web/20171107233836im_/http://www.bravotv.com/sites/all/modules/custom/common_site/images/transp-bg-60-black.png", "https://web.archive.org/web/20171107233836im_/http://www.bravotv.com/sites/nbcubravotv/files/styles/microsite-logo--mobile-1_5x/public/2017/04/verticals-white-personalspace.png?itok=Yvysn4kX&timestamp=1492116909", "https://web.archive.org/web/20171107233836im_/http://www.bravotv.com/sites/nbcubravotv/files/styles/scale--1800/public/2017/01/refresh_personalspace_3000x800.png?itok=p_hT2JOp&timestamp=1485473711", "https://web.archive.org/web/20171107233836im_/http://www.bravotv.com/sites/nbcubravotv/files/styles/related-posts--computer/public/field_blog_image/2017/03/personal-space-arod-jlo.jpg?itok=lAI0R1-h&timestamp=1490986867"], "top_img": "https://web.archive.org/web/20171107233836im_/http://www.bravotv.com/sites/nbcubravotv/files/field_blog_image/2017/11/personal-space-jlo-arod-text.jpg", "keywords": [], "authors": ["Marianne Garvey"], "canonical_link": "https://web.archive.org/web/20171107233836/http://www.bravotv.com/blogs/jlo-hit-on-a-rod-dressed-as-her-shades-of-blue-character", "title": "One Love Expert Weighs in on Why J.Lo and A-Rod Just May Last", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "vertical_name": "Personal Space", "fb": {"app_id": 1592250694320227}, "og": {"site_name": "Bravo TV Official Site", "type": "article", "title": "One Love Expert Weighs in on Why J.Lo and A-Rod Just May Last", "url": "https://web.archive.org/web/20171107233836/http://www.bravotv.com/blogs/jlo-hit-on-a-rod-dressed-as-her-shades-of-blue-character", "description": "Jennifer Lopez and Alex Rodriguez had met only once before — 12 years earlier at a Mets-Yankees subway series game after her ex-husband Marc Anthony threw out the first pitch.", "image": "https://web.archive.org/web/20171107233836im_/http://www.bravotv.com/sites/nbcubravotv/files/field_blog_image/2017/11/personal-space-jlo-arod-text.jpg"}, "twitter": {"card": "summary_large_image", "site": "@bravotv", "url": "https://web.archive.org/web/20171107233836im_/http://www.bravotv.com/blogs/jlo-hit-on-a-rod-dressed-as-her-shades-of-blue-character", "title": "One Love Expert Weighs in on Why J.Lo and A-Rod Just May Last", "description": "Jennifer Lopez and Alex Rodriguez had met only once before — 12 years earlier at a Mets-Yankees subway series game after her ex-husband Marc Anthony threw out the first pitch.", "image": "https://web.archive.org/web/20171107233836im_/http://www.bravotv.com/sites/nbcubravotv/files/field_blog_image/2017/11/personal-space-jlo-arod-text.jpg"}, "article": {"published_time": "2017-11-02T09:32:00-04:00", "modified_time": "2017-11-02T10:16:28-04:00"}}, "movies": [], "publish_date": 1509629520.0, "source": "https://web.archive.org", "summary": ""}