{"url": "http://time.com/5065392/star-wars-the-last-jedi-carrie-fisher/", "text": "Warning: This post contains major spoilers for Star Wars: The Last Jedi.\n\nThe Last Jedi marks the end of an era for Star Wars fans, as Carrie Fisher makes her final appearance as the beloved Princess-turned-General Leia. Fisher passed away in December 2016 after suffering a heart attack, but had reportedly already finished filming her scenes for Episode VIII at the time of her death.\n\nStar Wars: The Last Jedi begins with the Leia-led Resistance making a mad dash to evade the encroaching forces of the First Order. Unfortunately, in the midst of their escape, Leia’s ship is hit by a blast that destroys its entire command center. For a few minutes, it seems as though that will be the last we see of her. But then Leia appears on-screen again, drifting through the galaxy. She reaches out her hand and — using her connection to the Force— manages to fly through space back to the Resistance fleet.\n\nRead More: John Boyega Is a Star of His Own Making\n\nThe general is unconscious for the majority of the rest of The Last Jedi as she recovers from her ordeal. But, of course, at the Resistance’s greatest moment of need, she wakes up ready to command. Leia gets a heartwarming reunion with her twin brother Luke Skywalker (Mark Hamill) — or at least his Force projection — and seems to pass the torch of leadership to Poe (Oscar Isaac).\n\nIn Leia’s final scene, she boards the Millennium Falcon with Rey (Daisy Ridley) — both seeming to know that Luke is gone — to fly off into the galaxy once again. When the credits roll, a dedication to the late Fisher appears on-screen: “In loving memory of our princess, Carrie Fisher.”\n\nAlthough there were rumors that Fisher’s role in The Last Jedi would be changed to account for her absence in Episode IX, director Rian Johnson has said that he didn’t alter the movie at all. “I felt very strongly that we don’t try to change her performance,” he told the New York Times in September. “We don’t adjust what happens to her in this movie. Emotionally, you can’t help recontextualize it, now that she’s gone. It’s almost eerie how there are scenes that have an emotional resonance and a meaning, especially now. She gives a beautiful and complete performance in this film.”\n\nDisney has also stated that there will be no computer-generated version of Leia in Episode IX like there was in Rogue One. “We had to deal with tragedy at the end of 2016,” said Disney CEO Bob Iger during a March talk at the University of Southern California. “Carrie appears throughout VIII. We are not changing VIII to deal with her passing. Her performance remains as it is in VIII. In Rogue One, we had some digital character. We are not doing that with Carrie.”\n\n“We don’t have any intention of beginning a trend of re-creating actors who are gone,” Lucasfilm President Kathleen Kennedy reiterated to Vanity Fair in May.\n\nConsidering Leia’s storyline was left pretty open-ended, it’s unclear how Episode IX director J.J. Abrams will deal with tying up the loose ends. All we can ask is that it does Fisher justice.\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Megan McCluskey at megan.mccluskey@time.com.", "images": ["https://api.time.com/wp-content/uploads/2020/04/Sergio_00_45_10_00C1.jpg?quality=85&w=600", "https://api.time.com/wp-content/uploads/2017/12/princess-leia-last-jedi.jpg?quality=85&w=1200&h=628&crop=1", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2020/04/love-and-basketball.jpg?quality=85&w=600"], "top_img": "https://api.time.com/wp-content/uploads/2017/12/princess-leia-last-jedi.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Megan Mccluskey"], "canonical_link": "https://time.com/5065392/star-wars-the-last-jedi-carrie-fisher/", "title": "How Star Wars: The Last Jedi Says Goodbye to Carrie Fisher", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "star wars the last jedi carrie fisher, is carrie fisher in the last jedi, carrie fisher princess leia, star wars princess leia, does princess leia die in the last jedi, who will play princess leia in episode 9,  star wars last jedi, star wars the last jedi, the last jedi, the last jedi spoilers", "news_keywords": "star wars the last jedi carrie fisher, is carrie fisher in the last jedi, carrie fisher princess leia, star wars princess leia, does princess leia die in the last jedi, who will play princess leia in episode 9,  star wars last jedi, star wars the last jedi, the last jedi, the last jedi spoilers", "description": "Star Wars: The Last Jedi marks the end of an era for fans, as Carrie Fisher makes her final appearance as the beloved Princess Leia.", "og": {"title": "How the 'Star Wars: The Last Jedi' Says Goodbye to Carrie Fisher and Princess Leia", "type": "article", "site_name": "Time", "url": "https://time.com/5065392/star-wars-the-last-jedi-carrie-fisher/", "description": "Major spoilers ahead", "image": {"identifier": "https://api.time.com/wp-content/uploads/2017/12/princess-leia-last-jedi.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5065392/star-wars-the-last-jedi-carrie-fisher/", "description": "Star Wars: The Last Jedi marks the end of an era for fans, as Carrie Fisher makes her final appearance as the beloved Princess Leia.", "media": "https://api.time.com/wp-content/uploads/2017/12/princess-leia-last-jedi.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5065392/star-wars-the-last-jedi-carrie-fisher/", "title": "How the 'Star Wars: The Last Jedi' Says Goodbye to Carrie Fisher and Princess Leia", "description": "Major spoilers ahead", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2017/12/princess-leia-last-jedi.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}