{"url": "www.mercurynews.com/2018/08/23/angelina-jolie-agrees-to-temporary-truce-as-brad-pitt-divorce-war-makes-her-unpopular-in-hollywood/", "text": "CLICK HERE if you are having a problem viewing the photos on a mobile device\n\nBack in April, Angelina Jolie was named the most admired woman on the planet in a global online survey, ahead of Michelle Obama, Oprah Winfrey and Malala Yousafzai.\n\nBut very soon after, the 43-year-old actress, director and globe-trotting humanitarian began to appear in not-so-admiring news stories reporting that she had been accused by a judge of undermining estranged husband Brad Pitt’s relationship with their six children.\n\nJolie started to come across even to friends as “crazy and manipulative” for going public earlier this month with her efforts to portray Pitt as a deadbeat dad, having her lawyers say he was shirking his responsibility to pay his fair share of childcare expenses, Page Six reported.\n\nSo perhaps it’s no surprise to learn this week that she and Pitt quietly reached a temporary custody agreement that would put off arguing their respective cases in a court hearing, according to People.\n\nActually, this interim custody agreement keeps in place the one imposed by a judge in June, which said that “Angelina must let Brad see the children,” a source close to Pitt told Page Six. The agreement also may only put off the custody hearing for a few weeks, the source added.\n\nStill, there appears to be a temporary truce in play. Was this a matter of Jolie “waving the white flag,” as Us Weekly put it?\n\nAnother Page Six report earlier this week said that Jolie’s decision to escalate her fight against Pitt was losing her friends in Hollywood — according to some of those friends. And she was already upset that she had lost Amal and George Clooney as close friends after she filed for divorce from Pitt in September 2016.\n\nMoreover, with the Clooneys taking Pitt’s side in the breakup, Jolie also was developing an “insane” jealousy over Amal Clooney, an international human rights attorney and mother of 1-year-old twins.\n\nJolie believes “Amal has stolen her identity” as the world’s most glamorous, admired humanitarian, a source told Page Six. The source added: “Angelina hates all the attention that Amal is getting — she’s beautiful, she’s smart, she’s stylish, she has a beautiful family and she’s doing important human rights work.”\n\nJolie’s humanitarian reputation began to take a hit in June when details spilled out about how a Los Angeles County judge said she risked losing custody if she continued to interfere in Pitt’s relationship with their three sons and three daughters, Maddox, 17, Pax, 14, Zahara, 13, Shiloh, 12, and 10-year-old twins Knox and Vivienne.\n\nSaying it was important for the children’s welfare to have strong bonds with both parents, the judge set up a detailed summer visitation schedule and prohibited Jolie from barring Pitt’s phone and and text access to them.\n\nFamily law experts say the judge’s admonition was unusual in that courts generally trust parents to make the best decisions for their children. “But when a parent is proving they’re not acting in that way, the court will start imposing sanctions,” Christopher Melcher, a Los Angeles-based family law attorney, told this organization in an interview in June.\n\nMelcher, who is not associated with the Jolie-Pitt case, added it’s pretty “rare” for a judge to tell a parent he or she could lose custody if a certain behavior doesn’t change.\n\n“I imagine there were some pretty serious warning signs before the judge made this ruling,” he said.\n\nA source told Page Six that “Angelina lives in such a bubble” in not being able to “understand why she herself has become so unpopular in Hollywood.”\n\nJolie’s “bubble” was based in London this summer, where she was filming “Maleficent 2.” The children spent much of their summer in London with Jolie, People reported. However, the judge’s visitation schedule allowed Pitt to spend time with the children there and then to have them stay with him in Los Angeles for about a week, where he is based and where he has been shooting Quentin Tarantino’s “Once Upon a Time in Hollywood.”\n\nIn the past few weeks, Jolie and the children have been back in Los Angeles, where they have been spotted shopping at Whole Foods or going to a movie.", "images": ["https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg", "https://www.mercurynews.com/wp-content/uploads/2018/08/AngelinaKidsPaxGoldenGlobes1.jpg?w=1024&h=682", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://i0.wp.com/www.mercurynews.com/wp-content/uploads/2018/05/britain-royal-wedding1.jpg?fit=620%2C9999px&ssl=1"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2018/08/AngelinaKidsPaxGoldenGlobes1.jpg?w=1024&h=682", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2018/08/23/angelina-jolie-agrees-to-temporary-truce-as-brad-pitt-divorce-war-makes-her-unpopular-in-hollywood/", "title": "Angelina Jolie agrees to temporary truce as Brad Pitt divorce war makes her ‘unpopular in Hollywood’", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "Did Angelina Jolie agree to a temporary custody arrangement with Brad Pitt because she worried her divorce fight was making her 'unpopular' in Hollywood?", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Angelina Jolie agrees to temporary truce as Brad Pitt divorce war makes her ‘unpopular in Hollywood’", "url": "https://www.mercurynews.com/2018/08/23/angelina-jolie-agrees-to-temporary-truce-as-brad-pitt-divorce-war-makes-her-unpopular-in-hollywood/", "description": "Angelina Jolie’s agreement to a temporary truce in her custody fight with Brad Pitt comes as she was being increasingly seen as ‘crazy and manipulative,’ reports say.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2018/08/AngelinaKidsPaxGoldenGlobes1.jpg?w=1024&h=682", "width": 1024, "height": 682}, "locale": "en_US"}, "article": {"published_time": "2018-08-23T16:18:41+00:00", "modified_time": "2018-08-24T13:21:46+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Angelina Jolie agrees to temporary truce as Brad Pitt divorce war makes her ‘unpopular in Hollywood’"}, "image": "https://www.mercurynews.com/wp-content/uploads/2018/08/AngelinaKidsPaxGoldenGlobes1.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1534953600.0, "source": "http://www.mercurynews.com", "summary": ""}