{"url": "https://people.com/movies/channing-tatum-jenna-dewan-divorce-legal/", "text": "Channing Tatum and Jenna Dewan have a long road ahead of them in legal proceedings after announcing their split.\n\nThe former couple, both 37, announced their separation on Monday after almost nine years of marriage and welcoming 4-year-old daughter Everly in 2013.\n\nGet push notifications with news, features and more.\n\nRELATED: The Millions at Stake in Channing Tatum and Jenna Dewan’s Split\n\n“We have lovingly chosen to separate as a couple. We fell deeply in love so many years ago and have had a magical journey together,” a joint statement from the two read. “Absolutely nothing has changed about how much we love one another, but love is a beautiful adventure that is taking us on different paths for now…We are still a family and will always be loving dedicated parents to Everly.”\n\nBut now that they’ve officially announced their separation, what comes next?\n\nImage zoom Channing Tatum and Jenna Dewan Jason LaVeris/FilmMagic\n\nLegal experts tell PEOPLE that a lot depends on whether the couple signed a prenuptial agreement when they wed in 2009. But either way, their career paths and Tatum’s stratospheric paychecks will make for a complicated divorce.\n\nForbes estimated that the actor made $60 million in 2013 for movies like The Vow, 21 Jump Street, Magic Mike and G.I. Joe: Retaliation. He then made $29 million in 2015, according to the magazine. Tatum also launched his own vodka line, Born and Bred, in February 2017. Various online estimates place his net worth in the range of $60 to $80 million.\n\nCelebrity divorce attorney Vikki Ziegler says Tatum stands to potentially lose more in a divorce settlement if they didn’t have a prenup.\n\n“Nobody knows if they did sign one or not, and both of their careers blossomed since — especially Channing’s,” Ziegler says. “At this point, there is so much at stake, for him more than her, because they would be dividing the bulk of their assets. She could be looking at spousal support for a period of time. Child support of course, that could be a huge number.”\n\nShe continues, “Obviously houses, retirement assets, bank accounts — all of those things would be in the pot for division. So he is looking at a substantial depletion of his estate.”\n\nComplicating matters is the fact that neither Tatum or Dewan were as well known at the time of their marriage and Tatum has since gone on to make a blockbuster amount of money after. Ziegler says that in cases like this, the spouse with the suddenly higher income could have taken another step to protect themselves — a postnuptial agreement.\n\n“The concept is the same as a prenup and would dictate the divorce,” Ziegler explains. “It’s kind of trying to do damage control after the marriage when you didn’t do a prenup. It would’ve been super smart for Channing to do that.”\n\nRELATED: Signs of Trouble Surfaced Over Last Few Months in Channing Tatum & Jenna Dewan Tatum’s Marriage\n\nCelebrity divorce attorney Stu Slotnick, a shareholder at Buchanan Ingersoll and Rooney, tells PEOPLE that the best way to avoid the process getting difficult is for the two to take care of everything in private mediation instead of in court.\n\n“As a general rule, divorce litigation is something that should be avoided because it is long, it is painful and it is expensive,” Slotnick says. “Divorce bleeds into every aspect of a person’s life. Even if there’s a prenup, litigation surrounding a prenup can be just as costly, just as protractive and just as vicious as a divorce litigation without one. The fact that they released a joint statement is indicative of a present intention to work things out without the public being involved.”\n\nBut while the statement implies the split is amicable, Ziegler says it could get worse down the line if they’re unable to agree about the parting of assets during mediation.\n\n“While they could be in a good emotional place, financially they have to come to terms, which is very difficult,” she explains. “When people start parting with money it becomes a different ball game. So he’s going to have to come to terms with losing a lot of money and hoping that he’s gonna regain it back in the future.”\n\nFor Ziegler, how much money Dewan asks for is the big question. “How much does she need to live and support their daughter, assuming she’s gonna be the parent of primary residence,” she says. “This stuff gets ugly quickly, unless they’ve brokered a deal and they’re trying to hash it out.”\n\nEven though Dewan didn’t make as much money as Tatum during their marriage, she could have a higher claim to his earnings if she argues that she helped him in his career through support. Slotnick says that situations like Dewan taking care of the house and their child while Tatum was filming a movie give her an arguing point during mediation.\n\nImage zoom Channing Tatum and Jenna Dewan in 2009 Masatoshi Okauchi/REX/Shutterstock\n\nAnd if they can’t come to an agreement, the situation would have to go public.\n\n“Usually what happens if they can’t settle after a period of time is one of the parties will file a complaint for divorce and let the courts start unwinding its process because you’re at a crossroads,” Ziegler says. “But that’s the goal — to keep it private through mediation.”\n\nSlotnick agrees: “Both parties would be wise to come to an agreement to keep it out of court, because a public divorce can only potentially damage the parties. If it goes to a public fight it could be a terrible thing.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fchanning-tatum-jenna-dewan-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fchanning-jenna-gallery-3-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1440&h=754&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F11%2Fchanning-tatum7.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1440&h=754&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F11%2Fchanning-tatum7.jpg", "keywords": [], "authors": ["Ale Russian"], "canonical_link": "https://people.com/movies/channing-tatum-jenna-dewan-divorce-legal/", "title": "Channing Tatum, Jenna Dewan's Divorce Could Get Very Complicated: 'There Is So Much at Stake'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Channing Tatum,Couples,Jenna Dewan,Movie Celebrities,News", "news_keywords": "Channing Tatum,Couples,Jenna Dewan,Movie Celebrities,News", "description": "Channing Tatum and Jenna Dewan have a long road ahead of them in legal proceedings after announcing their split", "og": {"title": "Channing Tatum, Jenna Dewan's Divorce Could Get Very Complicated: 'There Is So Much at Stake'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/movies/channing-tatum-jenna-dewan-divorce-legal/", "description": "Channing Tatum and Jenna Dewan have a long road ahead of them in legal proceedings after announcing their split. The former couple, both 37, announced&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1440&h=754&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F11%2Fchanning-tatum7.jpg", "width": 1440, "height": 754}}, "pinterest": {"url": "https://people.com/movies/channing-tatum-jenna-dewan-divorce-legal/", "description": "Channing Tatum and Jenna Dewan have a long road ahead of them in legal proceedings after announcing their split", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F11%2Fchanning-tatum7.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/movies/channing-tatum-jenna-dewan-divorce-legal/", "title": "Channing Tatum, Jenna Dewan's Divorce Could Get Very Complicated: 'There Is So Much at Stake'", "description": "Channing Tatum and Jenna Dewan have a long road ahead of them in legal proceedings after announcing their split", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1440&h=754&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2016%2F11%2Fchanning-tatum7.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}