{"url": "https://people.com/music/lady-gaga-best-friend-sonja-durham-dead-cancer/", "text": "Lady Gaga‘s best friend Sonja Durham has died after a valiant cancer battle.\n\nDurham, who was the longtime managing director of Haus of Gaga, battled stage four breast, brain and lung cancer.\n\nGet push notifications with news, features and more.\n\n“I don’t know how to put a price on a friendship. I’m not even sure how you can assess the size of its meaning, only really your heart truly knows and it’s too special for words,” Gaga wrote on Sunday, sharing a series of photos of Durham, her friend of more than a decade. “I feel two competing feelings. Firstly, that I will live everyday with more passion, more determination, more compassion and more giving than ever before. Because that’s who she was, and it’s what drew us to each other, and I know it’s what she always wanted for me.”\n\nMother Monster also reflected on her friend’s ability to keep her centered and inspired.\n\n“She had this incredible way of releasing me from the anchor of my own sadness that held me back, she loved me fearlessly while I learned how to cope with fame and stay inspired no matter how scared I was. She knew all I cared about was the music. She made that ok. The other feeling I have is that of being robbed of the last 10 years of my life, friendship and career with her. Like someone took her from us, and with that taking took all the good times. I know that’s not true, and I know that I have those memories forever, I’m just in shock that I will never have new ones with her. I’m in shock that I won’t see her again until I pass too,” Gaga, 31, wrote of Durham, who managed the behind-the-scenes of Gaga’s famous Super Bowl performance in February.\n\nThe songstress vowed to be a voice for cancer patients.\n\n“I vow to be a little stronger everyday for her because that’s what she would have wanted, I vow to be stronger for anyone who’s lost somebody to cancer. I’m a part of that family now. I vow to be a warrior for her and be a voice for cancer patients so the world can continue to improve the dialogue and the fight. I loved her. I still love her. And I love so much her husband Andre, stepson Sante, and friends. I made them some food yesterday. I will keep cooking. Cooking my soul until it understands this,” she said.\n\nGaga concluded, “Last thing I told her, ‘Go find Joanne, Sonj.’ Somehow I think she did. @sonjad7777 #sonjadurham #grigiogirls.”\n\nHer final hashtag referenced her homage to Durham in “Grigio Girls,” off the Joanne deluxe edition album. The opening lyric sheds light on Gaga’s lost years pre-fame, during which a “Texas girl real strong” showed her the strength to be found.\n\n“I was 23, she was 35 / I was spiralin’ out and she was so alive,” the lyrics read.\n\nGaga had posted about Durham’s cancer battle last week.\n\n“Watching one of my best friends in the world show unfathomable courage, strength, and positivity while battling cancer has really changed my life. Thank you Sonja for inspiring me and all of us everyday with your joy,” Gaga, 31, wrote on Instagram Thursday, along with a black and white photo of Durham and her husband, Andre Dubois. In March, Gaga attended and helped plan Durham’s wedding to Dubois, for which Durham called Gaga her “guardian angel.”\n\n“I love you so much it brings tears to my eyes just to think of all the years we’ve spent together backstage running the show, taking care of each other. You are one of a kind. I’m so proud of you,” the songstress continued in her post. “And you and Andre, your unbreakable beautiful love is what life is all about. You can see it in this photo. Wanted to share this with the world and show them what true beauty looks like. I love you girl. I love you so much.”\n\nDuring weekend two of the Coachella Valley Music and Arts Festival, Gaga dedicated an acoustic version of her song “Edge of Glory” to Durham during a beautiful and somber moment of her headlining act.\n\n“My friend Sonja is very sick and I love her so much and if it’s okay with you, I’d like to sing this song for her,” she said in April. “I’m sorry you don’t feel well. We all wish you were here with us.”\n\nFollowing Sonja’s death, the hashtag #RIPSonja trended on Twitter, with many of Gaga’s followers sending support to the singer and paying tribute to her friendship with Durham.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1555&h=814&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F05%2Flady-gaga-sonja-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1555&h=814&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F05%2Flady-gaga-sonja-2000.jpg", "keywords": [], "authors": ["Karen Mizoguchi"], "canonical_link": "https://people.com/music/lady-gaga-best-friend-sonja-durham-dead-cancer/", "title": "Lady Gaga's Best Friend Sonja Durham Dies After Cancer Battle", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Death,Lady Gaga,Music News,News", "news_keywords": "Death,Lady Gaga,Music News,News", "description": "Haus of Gaga managing director Sonja Durham was revealed last year to be suffering from breast cancer", "og": {"title": "Lady Gaga's Best Friend Sonja Durham Dies After Cancer Battle", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/music/lady-gaga-best-friend-sonja-durham-dead-cancer/", "description": "Lady Gaga‘s best friend Sonja Durham has died after a valiant cancer battle. Durham, who was the longtime managing director of Haus of Gaga, battled&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1555&h=814&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F05%2Flady-gaga-sonja-2000.jpg", "width": 1555, "height": 814}}, "pinterest": {"url": "https://people.com/music/lady-gaga-best-friend-sonja-durham-dead-cancer/", "description": "Haus of Gaga managing director Sonja Durham was revealed last year to be suffering from breast cancer", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F05%2Flady-gaga-sonja-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/music/lady-gaga-best-friend-sonja-durham-dead-cancer/", "title": "Lady Gaga's Best Friend Sonja Durham Dies After Cancer Battle", "description": "Haus of Gaga managing director Sonja Durham was revealed last year to be suffering from breast cancer", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1555&h=814&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F05%2Flady-gaga-sonja-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}