{"url": "https://www.polygon.com/2017/12/15/16780618/star-wars-last-jedi-cast-cameos-slowen-lo-prince-william-harry-gary", "text": "Just like The Force Awakens before it, Star Wars: The Last Jedi is filled with blink-and-you’ll-miss-them celebrity cameos. In case you’re too busy gushing about how excellent the film is during the end credits to catch the names, here’s the list of celebs to keep an eye or ear out for during any of your Last Jedi viewings.\n\n[Warning: If you’re on complete spoiler-watch for The Last Jedi, you may want to bookmark this story to refer back to after you’ve seen the film.]\n\nFirst things first: While director Rian Johnson included several familiar names in the film during production, not all of them made it into the finished project.\n\nPrince William and Prince Harry\n\nThe most notable of these are Prince William and Prince Harry, whom John Boyega (Finn) outed as hidden members of the cast in November. The brothers were set to play Stormtroopers, so fans of the royal family may not have been able to catch them regardless. But earlier this week, Boyega confirmed that neither royal actually appears in the theatrical cut.\n\n“I did personally apologize to them yesterday and said, ‘Sorry you were cut out of the film,’” Boyega revealed on a British morning show, according to Newsweek. “Will was like, ‘I guess I just need to work more on the [acting] skill.’\"\n\nTom Hardy and Gary Barlow\n\nTom Hardy of Inception fame and British pop star Gary Barlow joined William and Harry for costumed cameos. It’s likely that Hardy and Barlow were cut from the film too, as the foursome filmed their appearances together. But Comicbook suggests that Hardy and Barlow are still present during the scene in which Finn and Rose go undercover in order to break into Snoke’s ship.\n\nAnd now, onto the lucky folks we can actually find in The Last Jedi.\n\nUpdate: Alas, according to SlashFIlm, Hardy exchanged some lines of dialog with Finn, but those scenes were definitely cut — guess we’ll have to wait for the Blu-ray.\n\nGary the dog\n\nGary regained public prominence last year after his owner, Carrie Fisher, passed away. Fisher and her pet were an item, with Gary garnering his own immense popularity that he ended up with his own Twitter account. In early December, Gary tweeted out his special The Last Jedi appearance. When Finn and Rose are in the Canto Bright casino, one of the gambling aliens can be seen in the background holding the recognizable pup.\n\nYes! The Last Jedi director @rianjohnson has made it official. I’m in the new #StarWars movie! Look for me! pic.twitter.com/DdN5IfXewp — Gary the Dog (@Gary_TheDog) December 7, 2017\n\nJoseph Gordon-Levitt\n\nRian Johnson’s close friend gave us the heads up back in October that he would appear in The Last Jedi in some fashion. He tweeted that he was one of two actors who Johnson had worked with in each of his directorial projects, from Johnson’s debut picture Brick to 2012’s Looper, his last film before joining the Star Wars family.\n\nI believe it’s only me and one other actor who has appeared in all four @rianjohnson movies. Proud and honored. Btw, name the other guy... https://t.co/usxDtRfuWT — Joseph Gordon-Levitt (@hitRECordJoe) October 10, 2017\n\nThe credits suggest that JGL plays a character named Slowen-Lo. (That’s a reference to a Beastie Boys song, “Slow And Low”; The Force Awakens also featured a Beastie Boys goof with the bit character Ello Asty.) Slowen-Lo is an alien whose voice can be heard when Finn and Rose are in the casino on Canto Bright. Big fans of the actor will have to listen closely to figure out which of the numerous creatures is him.\n\nThe other Johnson mainstay in the film, by the way, is Noah Segan. He took part in the gigantic space battle that opens up The Last Jedi; he’s behind the controls of one of the X-Wings.\n\nWarwick Davis\n\nWarwick Davis is remembered by Star Wars fans for his role as Wicket the Ewok in Return of the Jedi. Since that film, however, he’s made small appearances in other Star Wars films. Those include a handful of roles in The Phantom Menace and a tiny part in The Force Awakens. The tradition continues in The Last Jedi, where he plays yet another Canto Bright regular; he confirmed his own role back in October 2016. (Next up for Davis: a turn in 2018’s Solo: A Star Wars Story.)\n\nJustin Theroux\n\nJustin Theroux is very easy on the eyes, so it’s lucky for us that he actually gets a little bit of screen time. Known most recently for The Leftovers (and as Jennifer Aniston’s husband), Theroux makes a brief appearance in the casino as a hacker that Finn and Rose enlist for help. He’s wearing a red broach and a white tuxedo, as well as an uncharacteristic mustache. Otherwise, it’s definitely Justin — albeit we only get to spend a few seconds with him. (The British model Lily Cole also appears alongside him.)\n\nEllie Goulding\n\nThe singer teased her own Star Wars cameo just before the film’s release. She can be seen as a member of the rebel forces, according to a pair of tweets. You can bet that Ellie Goulding superfans are scouring the film frantically to spot her, so we’ll update with more specific details when we find them.\n\nHas anybody seen Star Wars yet and seen someone who resembles me in it awkward if I got cut. Haha — Ellie Goulding (@elliegoulding) December 13, 2017\n\nEdgar Wright\n\nEdgar Wright also revealed his own surprise The Last Jedi appearance a little early. The Star Wars superfan, whose Baby Driver was one of the year’s most entertaining, stylish action films, also plays a rebel soldier. His brother Oscar Wright joined him for the scene.\n\nThis feels like an appropriate moment to let you all know that me and my big brother Oscar are blink-and-you'll-miss-us-rebels in 'The Last Jedi'. Oh, and the film is truly great. Go @riancjohnson! pic.twitter.com/8e3CaziJyu — edgarwright (@edgarwright) December 10, 2017\n\nGareth Edwards\n\nJohnson owed Edwards, the director of 2016’s Rogue One: A Star Wars Story, a favor. Johnson got to play a bit part in Rogue One, and this year, Edwards got to experience the same thrill of being in front of the camera in The Last Jedi. He’s a member of the resistance, and he can be seen hiding out in a trench during a late-film battle on the salty planet Crait. Basically, look to the left of the person who realizes the planet is covered in salt.\n\nMichaela Coel\n\nThe Chewing Gum star has a blink-and-you’ll-miss-it moment in the bridge of the resistance ship.\n\nYh, peek-a-boo, iss me ! — Michaela Coel (@MichaelaCoel) December 15, 2017\n\nJames Corden ... maybe (update: maybe not)\n\nOur own Ross Miller has seen the film twice now, and he swears one of the first people to die in the film is none other than late night host James Corden, as a resistance pilot that gets blown up in a close-up shot. And he’s not the only one who thinks it’s Corden.\n\nWant more news and takes on The Last Jedi? Check out the rest of our Star Wars coverage.\n\nUpdate: It’s not him.", "images": ["https://cdn.vox-cdn.com/uploads/chorus_image/image/66672850/mk11deals.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66670791/underwater_foxamarkfield.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66670718/raze.0.png", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66671900/iXZHRDT.0.png", "https://cdn.vox-cdn.com/thumbor/259B8NKxFq_1svcpRoCeOobahhk=/0x0:4567x3045/1200x800/filters:focal(1919x1158:2649x1888)/cdn.vox-cdn.com/uploads/chorus_image/image/57997947/TheLastJedi5991ec3ab0d8d.0.jpg", "https://cdn.vox-cdn.com/thumbor/vtdI0FEPgPkcGtmyc6zsuWXF6NY=/0x328:4567x2719/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9857405/TheLastJedi5991ec3ab0d8d.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAUEBAAAACwAAAAAAQABAAACAkQBADs", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66670886/DesMe1.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66672163/DB8E102C_40E1_4E3C_8AEF_5F156F8456F6_e1561390962980.0.jpeg"], "top_img": "https://cdn.vox-cdn.com/thumbor/vtdI0FEPgPkcGtmyc6zsuWXF6NY=/0x328:4567x2719/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9857405/TheLastJedi5991ec3ab0d8d.jpg", "keywords": [], "authors": ["Allegra Frank", "Ross Miller", "Emily Heller", "Cass Marshall", "Tasha Robinson", "Karen Han", "Austen Goslin", "Dec"], "canonical_link": "https://www.polygon.com/2017/12/15/16780618/star-wars-last-jedi-cast-cameos-slowen-lo-prince-william-harry-gary", "title": "Star Wars: The Last Jedi’s celebrity cameos you may have missed (update)", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Polygon", "author": "Allegra Frank", "article": {"published_time": "2017-12-15T17:00:01-05:00", "modified_time": "2017-12-23T13:05:24-05:00"}, "fb": {"pages": "340327135979921,1121292284586403,353942168328519,231096643968522", "app_id": 549923288395304}, "style-tools": "https://www.polygon.com/style/community/405/aa1b5f60f2d88473ebd6692c9d20c2ed/tools.css", "msvalidate.01": "D385D0326A3AE144205C298DB34B4E94", "ahrefs-site-verification": "1e57a609922037a3fbdc1c22efd7334113f174f15608f37e1b8538a7b4ce64c3", "description": "Fantastic stars and where to find them", "og": {"description": "Fantastic stars and where to find them", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/vtdI0FEPgPkcGtmyc6zsuWXF6NY=/0x328:4567x2719/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9857405/TheLastJedi5991ec3ab0d8d.jpg", "alt": "Rose (Kelly Marie Tran) and Finn (John Boyega) in Star Wars: The Last Jedi", "height": 630, "width": 1200}, "site_name": "Polygon", "title": "Star Wars: The Last Jedi’s celebrity cameos you may have missed (update)", "type": "article", "url": "https://www.polygon.com/2017/12/15/16780618/star-wars-last-jedi-cast-cameos-slowen-lo-prince-william-harry-gary"}, "twitter": {"card": "summary_large_image", "url": "https://www.polygon.com/2017/12/15/16780618/star-wars-last-jedi-cast-cameos-slowen-lo-prince-william-harry-gary", "title": "Star Wars: The Last Jedi’s celebrity cameos you may have missed (update)", "description": "Fantastic stars and where to find them", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/d44zQY6IREhEB3z2Pv-5o-k9CRM=/0x381:4567x2665/fit-in/1200x600/cdn.vox-cdn.com/uploads/chorus_asset/file/9857405/TheLastJedi5991ec3ab0d8d.jpg", "alt": "Rose (Kelly Marie Tran) and Finn (John Boyega) in Star Wars: The Last Jedi"}, "site": "Polygon"}, "sailthru.title": "Star Wars: The Last Jedi’s celebrity cameos you may have missed (update)", "sailthru.tags": "general,polygon,front-page,movies,star-wars,entertainment", "sailthru.description": "Fantastic stars and where to find them", "sailthru.date": "2017-12-15T17:00:01-05:00", "sailthru.image.full": "https://cdn.vox-cdn.com/thumbor/_6FK5NtFw3SSCPrR01rvuzWguAQ=/0x239:4567x2808/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/57997945/TheLastJedi5991ec3ab0d8d.0.jpg", "sailthru.image.thumb": "https://cdn.vox-cdn.com/thumbor/tiTSsbrS4V_-rZrg8QWQbGIUZqA=/762x0:3807x3045/200x200/cdn.vox-cdn.com/uploads/chorus_image/image/57997945/TheLastJedi5991ec3ab0d8d.0.jpg", "msapplication-TileImage": "https://cdn.vox-cdn.com/uploads/hub/sbnu_logo_minimal/405/touch_icon_ipad_retina_1000x1000.7014.png", "msapplication-TileColor": "#da0050", "outbrainsection": "movies"}, "movies": [], "publish_date": 1513267200.0, "source": "https://www.polygon.com", "summary": ""}