{"url": "heightline.com/charlize-theron-dating-partner-net-worth/", "text": "Charlize Theron is one of Hollywoods biggest names as well as one of its phenomenal and most decorated actresses. She landed a spot in the film industry and subsequently, the world of fame with her breakout role in the 1997 film The Devil’s Advocate. Since then, her career has been in an upward trajectory. She is a recipient of several accolades including an Academy Award, a Golden Globe Award and the Silver Bear for Best Actress for her role in Monster and has continued to win hearts with her versatility which cuts across romantic roles to action-filled ones.\n\nWhile it may be known to us her tremendous success in Hollywood, having been on our screens for over two decades, we may not really know much about her private life which includes her relationship; past and present. Thus, let’s take a look at some of the men who could be considered lucky for dating the blonde bombshell and Hollywood phenom.\n\nBrief Bio\n\nCharlize Theron is a prominent American actress. She has starred in over 50 movies and tv shows in a career spanning over two decades. Born to Gerda (née Maritz) and Charles Theron on August 7, 1975, in Benoni, South Africa, she grew up during the apartheid in South Africa and has worked her way to greatness in the tinsel town where she is known as one of its most beautiful stars. Her family is Afrikaner with roots in Dutch, French, and German thus she has her first language as Afrikaans. Being a dedicated and hardworking actress, she developed an American accent when she moved to the U.S. and now speaks the English Language fluently. Theron became a naturalized American citizen in 2007 though she still keeps her South African citizenship.\n\nShe had a traumatic childhood wherein she witnessed her mother shoot her father in June 1991. Prior to his death, he was given to alcohol and was abusive to his wife and daughter. Hence, Charlize’ mother was not charged with murder following the incident as it was legally adjudged to have been self-defense. Despite the ugly circumstances that surrounded her early years, she found her way through it emerging at the top as a true champion.\n\nCharlize Theron worked on the catwalks in Milan Italy at 16, studied ballet at the Joffrey School in New York on a scholarship at 18 though she couldn’t continue due to knee injuries which turned out to be a blessing in disguise as it turned her in to the world of portrayals.\n\nShe made her acting debut in an uncredited role as a follower of a cult in the horror film Children of the Corn III: Urban Harvest (1995). Since then, she has established her form as a talented and skillful actress with versatile roles in movies including a woman suffering from schizophrenia in The Devil’s Advocate (1997) which was her ticket to fame, The Cider’s House Rules (1999), a serial killer Aileen Wuornos in Monster (2003) for which she won several awards including the Academy Award for Best Actress, the Golden Globe Award for Best Actress in a Motion Picture – Drama, and the Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Leading Role.\n\nHer other work credits include the biopic The Life and Death of Peter Sellers (2004), Æon Flux (2005) where she played the eponymous rebel assassin, Hannock (2008), Young Adult (2011), Snowman and the Huntsman (2012), a rebel soldier Imperator Furiosa in Mad Max: Fury Road (2015), The Fate of the Furious (2017), Atomic Blonde (2017), Tully (2018), Gringo (2018). Along the course of her career, Theron has starred with notable acts such as Vin Diesel, Dwayne Johnson, Al Pacino, Johnny Depp and Michelle Rodriguez.\n\nBesides her screen works, Theron has also succeeded behind the screen as a producer. She ventured into film production in the late 2000s with her own company Denver and Delilah Productions and has numerous produced works to her credit some of which she also starred in. They include her documentary East of Havana (2007), The Burning Plain (2008), Dark Places (2015) and Atomic Blonde (2017).\n\nNet Worth\n\nThe South African Belle is no doubt a highly successful actress judging by her slew of works and attendant accolades, that is if those two criteria are left to judge success in the entertainment arena as she has a dose of them. If it is left to how much one brings home after every work and the accumulating net worth, Charlize Theron surely does not have a dearth in that aspect as well. However, there is more to determining success in every sphere of human endeavor than meets the eye such as dedication, strong-willed and focus which she does not lack either.\n\nFrom her days as a model to her stint in dancing down to when she joined the tinsel town where she got established as an A-list actress added to a burgeoning production career, she has amassed a fitting amount in net worth. She has also starred in critically and commercially successful movies such as Hancock and The Fate of the Furious which grossed more than $624 million and $1 billion at the worldwide box office respectively.\n\nWith this antecedent, her worth has been estimated to be between $110 and $130 million. Furthermore, she has several homes and is a wise investor. Charlize Theron also has humanity close to her heart and donates much of her wealth to philanthropic courses\n\nWho is Charlize Theron Dating? Her Partner, Boyfriend\n\nCharlize Theron has always had a point of delivering outstanding performances in her career for which she has won thousands of hearts. While that could confidently be said about her career-wise, one couldn’t be so sure when it comes to her relationships. Let’s turn some pages of her private life as to get a view of the outlook. And here it is starting from Craig Bierko in the 1990s to the most recent.\n\nCraig Bierko\n\nWhen the blonde beauty was just setting out in her Hollywood career, she dated actor and singer, Craig Bierko from 1995 until 1997.\n\nStephan Jenkins\n\nStephan Jenkins is an American musician popularly known as the Third Eye Blind frontman and guitarist. The duo met in 1998 and dated from then till they went their ways in 2001. Following the split, some of the songs in the band’s third album, Out of the Vein appear to explore the emotions Jenkins experienced due to the breakup, particularly, the song Never Let You Go which was supposedly inspired by the incident.\n\nStuart Townsend\n\nThe Mad Max: Fury Road actress’ relationship with her Trapped co-star is one of her longest to date (almost a decade old). She met the Irish actor, Stuart Townsend on the set of the 2000 film where they played an on-screen couple. However, it seemed the chemistry went beyond the silver screen into their real lives. They were together from then and even lived as husband and wife in Los Angeles and Ireland, though no nuptial took place until they decided to call time on the affair in 2010 much to the dismay of their fans.\n\nSee Also: Samm Levine (Inglourious Basterds Actor) Bio And Facts -Where Is He Now?\n\nAlong her dating profile, Charlize Theron took an intermission to launch into a new aspect of life – motherhood – by adopting two lovely children. She adopted her first child, a son named Jackson in March 2012. Three years later, she went the adoption way again when she brought home a girl, August in July 2015. Having become a mother, she developed a new view on dating, apparently seeking for a partner that would not only stand by her but also look out for her children as a father figure if not a father.\n\nSean Penn\n\nHer latest relationship was a high profile one as well. After being friends with the pop singer Madonna‘s ex-husband, American actor Sean Penn for many years, the duo started dating in December 2013. They announced their engagement a year later but months after she revealed to Esquire UK that it was nice to be single but coupling up is even nicer. Unfortunately, they couldn’t take their relationship to the next level as they ended it in June 2015 after nearly two years of keeping the flame glowing if not burning.\n\nDating Rumors\n\nOther than the many men she had dedicated some portions of her life to, she has also had some who she was rumored to have dated or had a fling with. They include her co-star Will Smith in 2008, Jeremy Renner and Keanu Reeves both in 2010, Ryan Reynolds whom she reportedly dated for a few months in 2011, Alexander Skarsgård in 2012, and after her split from Penn, she was linked to actor Jake Gylenhall in 2015 and most recently Halle Berry‘s ex, former Versace model Gabriel Aubry in 2017.", "images": ["https://heightline.com/wp-content/uploads/Charlize-Stephan.jpg", "https://heightline.com/wp-content/uploads/Ijeoma-Ogbozor-150x150.jpg", "https://heightline.com/wp-content/uploads/Charlize-1.jpg", "https://heightline.com/wp-content/uploads/Charlize-Sean.jpg", "https://heightline.com/wp-content/uploads/charlize-stuart-z.jpg", "https://heightline.com/wp-content/uploads/charlize_theron-e1532452948952.jpg", "https://heightline.com/wp-content/uploads/20190617170853f7-01fe-66c8-8451-7a1b6c56aced.jpg", "https://heightline.com/wp-content/uploads/logo_heightline.png"], "top_img": "https://heightline.com/wp-content/uploads/charlize_theron-e1532452948952.jpg", "keywords": [], "authors": ["Ijeoma Ogbozor"], "canonical_link": "https://heightline.com/charlize-theron-dating-partner-net-worth/", "title": "Who Is Charlize Theron Dating, Her Partner, Boyfriend And Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Charlize Theron had her breakout role in The Devil's Advocate. Beyond her screen persona, get to know who she is dating or had dated in the past.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Who is Charlize Theron Dating, Her Partner, Boyfriend and Net Worth", "description": "Charlize Theron had her breakout role in The Devil's Advocate. Beyond her screen persona, get to know who she is dating or had dated in the past.", "url": "https://heightline.com/charlize-theron-dating-partner-net-worth/", "site_name": "Heightline - Celebrity Biographies, Height, Weight, Bios of Famous People", "image": {"identifier": "https://heightline.com/wp-content/uploads/charlize_theron-e1532452948952.jpg", "secure_url": "https://heightline.com/wp-content/uploads/charlize_theron-e1532452948952.jpg", "width": 640, "height": 400}}, "article": {"section": "Actresses", "published_time": "2018-08-07T13:27:50+00:00"}, "twitter": {"card": "summary", "description": "Charlize Theron had her breakout role in The Devil's Advocate. Beyond her screen persona, get to know who she is dating or had dated in the past.", "title": "Who is Charlize Theron Dating, Her Partner, Boyfriend and Net Worth", "image": "https://heightline.com/wp-content/uploads/charlize_theron-e1532452948952.jpg"}, "generator": "Powered by WPBakery Page Builder - drag and drop page builder for WordPress."}, "movies": [], "publish_date": 1533648470.0, "source": "http://heightline.com", "summary": ""}