{"url": "https://web.archive.org/web/20070321075045/http://www.asce.org:80/reportcard/2005/actionplan07.cfm", "text": "\n\n» Printer Friendly\n\nASCE's 2005 Report Card for America's Infrastructure assessed the condition and capacity of our nation's public works with an overall grade of D. ASCE estimates that $1.6 trillion is needed over a five-year period to bring the nation's infrastructure to good condition. While long term solutions are needed, in the short term, small steps can be taken by the 110th Congress to improve our nation's failing infrastructure.\n\n\n\n\n\n\n\n\n\n\n\nThe Cost\n\nThe estimated total need of $1.6 trillion in federal, state and local funds is not all new money. Much of it is already allocated in existing budgets. However, existing funds have been repeatedly raided to pay for other programs. We estimate that approximately one-third of the total current investment needed will be new funding. It is also important to remember that the $1.6 trillion does not account for future population growth.\n\n\n\nCase studies of failing infrastructure . . .\n\n\n\nKauai, Hawaii - March 2006\n\nSeven people were killed when an earthen dam failed, unleashing nearly 300 million gallons of water, smashing down trees and sweeping away homes.\n\n\n\nPortland, Oregon - December 2006\n\nA clogged sewer line caused a sink hole in Portland which swallowed a truck-which had been sent to clean the sewer. Natural gas and water lines were also ruptured in the accident.\n\n\n\nWashington County, Pennsylvania - December 2005\n\nA 120-ton concrete beam collapsed onto Interstate 70 in Washington County, Pa., barely missing passing motorists. According to FHWA, 39 percent of bridges in Pennsylvania are unsafe.\n\n\n\nAtlanta, Georgia\n\nCongestion on Atlanta's roads costs the individual commuter 67 hours in wasted time each year and more than $1.7 billion, according to the Texas Transportation Institute.\n\n\n\nAction Steps\n\nNational Infrastructure Commission\n\n\n\n\n\nCongress must enact the National Infrastructure Improvement Act to establish the National Commission on Infrastructure of the United States.\n\n\n\nThe Commission would study the present condition of the nation's various infrastructure systems and report to Congress by 2009 on the capacity of our infrastructure to support the national economy, the age of the systems and possible methods to finance improvements.\n\n\n\n\n\nAviation\n\n\n\n\n\nCongress must reauthorize funding for the Airport and Airway Trust Fund and enact an increase in user fees as necessary for continued funding of the Airport Improvement Program.\n\n\n\nThe National Plan of Integrated Airport Systems estimates that over the next five years (2005-2009) $39.5 billion will be needed to meet the infrastructure demands of all segments of civil aviation. In March 2005, the FAA forecasted total passenger enplanements would surpass 1 billion annually within the next ten years, representing a 41 percent increase from 2005. The current funding authority expires October 1, 2007, and with the projected increase in passenger traffic, airports are at risk for seasonal and peak-period delays.\n\n\n\n\n\nBridges, Roads & Transit\n\n\n\n\n\nCongress must fully fund surface transportation programs authorized under SAFETEA-LU.\n\n\n\nCongress must use all funds that accumulate in the Highway Trust Fund to invest in the nation's surface transportation program.\n\n\n\nPoor road conditions cost U.S. motorists $54 billion a year in repairs and operating costs?$275 per motorist- and congestion on the nation's roadways costs drivers $63.1 billion a year. However, the $59.4 billion spent annually is well below the $94 billion needed each year to improve transportation infrastructure conditions nationally. Also, in 2004, Americans took 9.6 billion trips using public transportation. Since 1995, public transportation ridership in the U.S. has grown by more than 23 percent, faster than highway travel.\n\n\n\n\n\nBrownfields\n\n\n\n\n\nCongress must reauthorize the Brownfields Revitalization and Environmental Restoration Act of 2002 in order to provide continued federal funding for the redevelopment of brownfields sites.\n\n\n\nAccording to the U.S. Conference of Mayors, 172 cities estimated that they collectively have more than 23,810 brownfields sites, with the average size of a brownfield site being between five and 15 acres. Also, 158 cities collectively estimated that their brownfield properties comprised 96,039 acres of land, representing potential new jobs and land tax revenue.\n\n\n\n\n\nDams & Levees\n\n\n\n\n\nCongress must enact the Dam Rehabilitation and Repair Act (H.R. 1098) to address the most critical non-federal public dams.\n\n\n\nCongress must enact a national levee safety program, including a nationwide inventory of levees and mandatory inspection requirements.\n\n\n\nState dam safety officials estimate that $10 billion is needed to repair the most critical dams over the next 12 years. Also, state dam safety programs have identified more than 3,500 unsafe or deficient dams, many of which are susceptible to large flood events or earthquakes.\n\n\n\nThe U.S. Army Corps of Engineers reported in early 2007 that nearly 150 U.S. levees pose an unacceptable risk of failing in a major flood, mainly due to poor maintenance. The nation cannot afford to wait for another flooding catastrophe like the one that followed Hurricane Katrina in 2005.\n\n\n\n\n\nDrinking Water & Wastewater\n\n\n\n\n\nCongress must enact the Water Quality Financing Act of 2007 (H.R. 720) to provide vitally needed federal aid through the State Revolving Loan Fund (CWSRF) program.\n\n\n\nCongress must authorize $1 billion in annual funding for the Safe Drinking Water Act State Revolving Loan Fund (DWSRF).\n\n\n\nThe EPA estimates that nearly $1 trillion is needed in critical drinking water and wastewater investments over the next two decades. At risk are the gains that have been made in cleaning up the nation's rivers, lakes, and streams since the enactment of the Clean Water Act in 1972.\n\n\n\n\n\nInland Waterways\n\n\n\n\n\nCongress must enact a Water Resources Development Act (WRDA) that requires a more comprehensive approach to water resources projects constructed by the U.S. Army Corps of Engineers.\n\n\n\nCongress must ensure the integrity of the Inland Waterways Trust Fund.\n\n\n\nOf the 257 locks on the more than 12,000 miles of inland waterways operated by the U.S. Army Corps of Engineers, nearly 50 percent are functionally obsolete. By 2020, that number will increase to 80 percent. The cost to replace the present system of locks is more than $125 billion.\n\n\n\nASCE's 2005 Report Card for America's Infrastructure assessed the condition and capacity of our nation's public works with an overall grade of D. ASCE estimates that $1.6 trillion is needed over a five-year period to bring the nation's infrastructure to good condition. While long term solutions are needed, in the short term, small steps can be taken by the 110th Congress to improve our nation's failing infrastructure.\n\n\n\n\n\n^ Back to top\n\n\n\n", "images": ["https://web.archive.org/web/20070321075045im_/http://www.asce.org/graphics/rc07/brownfields.jpg", "https://web.archive.org/web/20070321075045im_/http://www.asce.org/graphics/rc07/scorecard_image.jpg", "https://web.archive.org/web/20070321075045im_/http://www.asce.org/graphics/rc07/actionplantitle.jpg", "https://web.archive.org/web/20070321075045im_/http://www.asce.org/graphics/rc07/airplane.jpg", "https://web.archive.org/web/20070321075045im_/http://www.asce.org/reportcard/2005/assets/images/body_bottom.gif", "https://web.archive.org/web/20070321075045im_/http://www.asce.org/graphics/rc07/waterways.jpg", "https://web.archive.org/web/20070321075045im_/http://www.asce.org/reportcard/2005/assets/images/footer_bottom.gif", "https://web.archive.org/web/20070321075045im_/http://www.asce.org/graphics/rc07/brt.jpg", "https://web.archive.org/web/20070321075045im_/http://www.asce.org/reportcard/2005/assets/images/2007/case_btn.jpg", "https://web.archive.org/web/20070321075045im_/http://www.asce.org/graphics/rc07/pdf_action.jpg", "https://web.archive.org/web/20070321075045im_/http://www.asce.org/graphics/rc07/water.jpg", "https://web.archive.org/web/20070321075045im_/http://www.asce.org/graphics/rc07/actionstep.jpg", "https://web.archive.org/web/20070321075045im_/http://www.asce.org/graphics/rc07/dam.jpg", "https://web.archive.org/web/20070321075045im_/http://www.asce.org/reportcard/2005/assets/images/footer_top.gif", "https://web.archive.org/web/20070321075045im_/http://www.asce.org/reportcard/2005/assets/images/body_top.gif", "https://web.archive.org/web/20070321075045im_/http://www.asce.org/reportcard/2005/assets/images/box_transparent.gif", "https://web.archive.org/web/20070321075045im_/http://www.asce.org/reportcard/2005/assets/images/icons_merge.gif"], "top_img": "https://web.archive.org/web/20070321075045im_/http://www.asce.org/reportcard/2005/assets/images/box_transparent.gif", "keywords": [], "authors": [], "canonical_link": "", "title": "Infrastructure Report Card 2005", "meta_data": {}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}