{"url": "https://people.com/tv/bachelor-arie-luyendyk-jr-blog-premiere/", "text": "Arie Luyendyk Jr. vied for Emily Maynard‘s heart on season 8 of The Bachelorette. Now, he’s on his own journey to find love on the latest season of The Bachelor — and he’s blogging about it exclusively for PEOPLE! Follow Arie on Twitter at @ariejr.\n\nWhen I first got the call asking me if I was interested in being the new Bachelor, I laughed. I seriously thought it must be some kind of joke. Isn’t my hair too gray? Don’t I go to bed too early? Honestly, until the moment that I was announced on Good Morning America, I thought someone was going to pop out and say, gotcha. My entire flight to the announcement, I kept thinking Well, at least New York will be fun. I’ve been out of the spotlight for so long and I really thought that chapter in my life was over. So, trust me, I get that when many people saw my name announced as the new Bachelor, they said, who?\n\nGet push notifications with news, features and more.\n\nAfter being on Emily’s season of The Bachelorette, I went back to my regular life. I was never on the show to be famous or to get big on social media. Initially I went on the show for a new adventure and a fun story and was really skeptical of the idea that you could actually fall in love on a TV show. Then, I met Emily and had one of the most transformative experiences of my life. For the first time in my adult life, I was able to drop the craziness of being a traveling race car driver and focus on love — and it worked. I fell head over heels in love with Emily, and haven’t been in love since. So, yeah, when I got the call I was equal parts confused (very confused), flattered, and excited. Confused because I really didn’t expect to be asked but excited because I knew that I had to say yes. The last place I found love was on The Bachelorette and I knew I was ready to find love again. While I was packing my bags and saying goodbye to my dog, Bastian, I realized that this may be my last time in my home as a single man. If all went to plan, I’d return here with a fiancée and in love.\n\nImage zoom Arie Luyendyk Jr. and Emily Maynard JON LEMAY/ABC\n\nI don’t know when it actually sunk in that I was The Bachelor. Even after I flew to L.A., got fitted for my suit, and took hundreds of photos with roses, I still half expected someone to pop out and tell me this was all a joke. It all started to feel real when I met Sean Lowe, Catherine Giudici Lowe, and their son Samuel at the mansion. This was my first time actually being there. If you didn’t watch Emily’s season, we filmed in Charlotte, North Carolina, so that Emily could be closer to her daughter. Being in the mansion for the first time and seeing the place I had seen on TV so many times before was surreal. It’s a place where I watched so many people fall in love and I now realized it was my turn to make those memories for myself.\n\nThankfully Sean was there to give me the grand tour. He shared memories of his time on the show and, of course, showed me the best places to sneak a kiss. Sean and Catherine have what I want — a wonderful marriage that started here — so I was really excited to hear their advice. They told me a lot that day, but the message that stuck with me most was to be patient and to keep my heart open to women who may not stand out right away. Sean saw Catherine as a friend for much of the beginning of his season, but eventually that friendship turned to love. It may be no surprise that a guy known as “The Kissing Bandit” often leads with chemistry, so I took their advice to heart. I resolved not to repeat the mistakes of my past. The last thing Sean said was for me to have fun, because the first night was going to be totally nuts.\n\nImage zoom From left: Catherine Giudici, Arie Luyenduk Jr. and Sean Lowe Arie Luyendyk Jr./Instagram\n\nSean could not have been more right. What an incredible, insane night. Almost right away the nerves took over. As I put on my suit and got into my limo, I was questioning everything. Would I like any of the women? Would the women like me? Will I find my person, the one, my wife? Will I be a good Bachelor? The enormity of it all made its way into my head.\n\nDuring my final conversation with Chris Harrison, as the women’s limos were on the way, I broke out into a sweat — a great time to have a mild panic attack. I took a deep breath to calm my nerves and then saw the first limo pull into the driveway. I heard them scream my name from inside the limo and realized they’re all here —all these women from all walks of life — excited to meet me. The door swung opened and so began the craziest night of my life.\n\nThe women were really, really amazing out of the limo. So many nervous, beautiful women who had me at hello (couldn’t resist). Their introductions ranged from cute to funny to hilariously weird. Marikh saying she likes to cook with salt and pepper, Brittane sticking a bumper sticker on my butt, and Bekah M. literally calling me a “classic.” I was so nervous and their lighthearted joking really helped break the tension going into the evening.\n\nSo many of the entrances stood out. Krystal’s presence was undeniable and her Ferrari red dress was burned into my memory forever. Her mediation and breathing exercise was totally needed and actually helped calm down my wild nerves. Speaking of nerves, I still can’t believe I was so nervous that Tia’s I hope you don’t already have a little weiner joke went right over my head. Becca K. reminded me why I was really there — to end up on one knee — and Seinne’s sincere, thoughtful gift of the elephant cuffs showed me that this night wasn’t all jokes.\n\nImage zoom The cast of The Bachelor\n\nAfter Maquel pulled up in that race car and made maybe the most badass entrance of the night (the way she shook her hair was straight out of a movie), I realized that all in all there were 29 — 29 beautiful amazing women who had taken time out of their busy lives to come meet me, 29 women who chose to put their lives on pause for a chance to potentially fall in love. This realization left me feeling so humbled and so lucky.\n\nOne of the most nerve-racking moments of the night was going back into the house and talking to the group of 29 women, waiting to hear what I had to say because as much as I wanted to find love, so did they! This was their shot to find love, just as much as it was mine! So I really needed to express how ready I was to find someone and how sincerely I believe this whole experience CAN work. I remember five years ago, standing there skeptically in a group of 25 men. I really didn’t know what it was all about. As Emily spoke, though, I felt her sincerity and saw how much hope there was in her eyes. That is what I wanted to come across more than anything. I wanted them to see that my heart was open and that I truly was here to fall in love and find my person.\n\nNow, it was time to do what I came here to do: really meet the women. I had so many questions: Why are you here? What’s your story? Do we have chemistry? I realized right away what a remarkable group of impressive, intelligent and charming woman I had here.\n\nKendall wrote me a hilarious song on the ukulele. I really didn’t know how to react to a beautiful woman writing me a funny song other than to laugh and enjoy myself. On a stressful night, it’s so important to have levity because at the end of the day, finding love should be seriously fun. I loved how much Annaliese put her herself out there by being the only person in costume. I remember being on the other side and how hard it can be to try something daring. Brittany T.’s driveway race was so much fun. I loved how much thought she put into our time together and it reminded me to put that same effort into all my new relationships. Becca K. shared her mom’s letter, which was especially meaningful because that first night can be scary and I thought it was really brave to share something so intimate so quickly. My conversation with Jacqueline got deep fast when she “therapized” me, which I have to say, I really appreciated! I like being asked tough questions and being challenged. It was conversations like these that really made me hopeful about finding love here again.\n\nThen, there was Chelsea. She boldly pulled me first and was the only woman to pull me twice. When she came and pulled me a second time, she went in for a kiss. I know it took a lot of courage and ultimately, I want the women to take risks. I want a partner who is fiercely independent, who is her own person, and who knows what she wants. Chelsea was still such a mystery to me and I could not wait to learn more. This is why I gave her the First Impression rose.\n\nImage zoom Chelsea and Arie Luyendyk Jr. ABC/Paul Hebert\n\nImage zoom Chelsea Craig Sjodin/ABC\n\nI didn’t expect the first Rose Ceremony to be so hard. I stood there, looking at these 29 women knowing that I would have to send eight home. I had to trust my gut on whether or not we’d work as a couple and ultimately end up together. At the beginning of this journey, I promised myself I’d be decisive even when it was difficult. I just didn’t expect it to be difficult so early. I sent home some amazing women that night, I just knew they weren’t my person.\n\nAfter the longest and most amazing night of my life I finally got some sleep. Here’s an excerpt from my personal journal the morning after that first night:\n\n“I could write so many pages on last night because it was so intense and I know I’m just brushing the surface on everything that went on. So many great women and a lot of tough decisions to come. Last night eight women went home and it was really hard to let them go. Admiring the thoughtful gifts I received from last night I’m so hopeful she is a part of this amazing group. I want there to be love here and I’m so thankful I was chosen. More than anything I want to make this experience mine, I think only then I’ll feel good in this. Hopefully ‘the one’ is here, my heart is open.”\n\nImage zoom Chelsea and Arie Luyenkdyk Jr. Paul Hebert/ABC\n\nIt was such a good feeling to get through my first night as Bachelor, but this is just beginning. I came into this experience with one goal in mind: to find the love of my life. I hadn’t been in love since Emily and I was here to finally find my happy ending. Next week is the first week of dates and I decided to change things up. I wanted this journey to be my own, and so I wanted to make sure that I made decisions for the ending I want. I think you’ll all be surprised by some of the small and big changes, and trust me, some of those decisions didn’t always sit well. It’s a wild ride filled with more tears and heartbreak than I ever experienced before. See you guys next week where the drama begins and the romance heats up. You won’t want to miss it. Thanks for reading. I can’t wait to share this journey with you.\n\nBest, Arie\n\nThe Bachelor airs Mondays at 8 p.m. ET on ABC.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Farie-luyendyk2-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fthe-bachelor-11-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Farie-jr-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fbachelor5-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fthe-bachelor-11-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fbachelor-1b-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Farie-luyendyk1-2000.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fthe-bachelor-11-1.jpg", "keywords": [], "authors": ["Arie Luyendyk Jr."], "canonical_link": "https://people.com/tv/bachelor-arie-luyendyk-jr-blog-premiere/", "title": "The Bachelor Arie Luyendyk Jr. Explains Why Chelsea Got His First Impression Rose — and a Kiss", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Arie Luyendyk Jr.,News,The Bachelor,TV", "news_keywords": "Arie Luyendyk Jr.,News,The Bachelor,TV", "description": "The Bachelor airs Mondays at 8 p.m. ET on ABC", "og": {"title": "The Bachelor Arie Luyendyk Jr. Explains Why Chelsea Got His First Impression Rose — and a Kiss", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/bachelor-arie-luyendyk-jr-blog-premiere/", "description": "&nbsp;Arie Luyendyk Jr.&nbsp;vied for Emily Maynard‘s heart on season 8 of&nbsp; The Bachelorette.&nbsp;Now, he’s on his own journey to find love on the latest season&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fthe-bachelor-11-1.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/bachelor-arie-luyendyk-jr-blog-premiere/", "description": "The Bachelor airs Mondays at 8 p.m. ET on ABC", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fthe-bachelor-11-1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/bachelor-arie-luyendyk-jr-blog-premiere/", "title": "The Bachelor Arie Luyendyk Jr. Explains Why Chelsea Got His First Impression Rose — and a Kiss", "description": "The Bachelor airs Mondays at 8 p.m. ET on ABC", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fthe-bachelor-11-1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}