{"url": "https://www.usatoday.com/story/life/tv/2017/04/26/ellen-degeneres-gay-coming-out-tv-20-year-anniversary/100888584/", "text": "Robert Bianco\n\nUSA TODAY\n\n\n\n\n\nWe’ve come so far in 20 years — and the way Ellen DeGeneres came out helped get us here.\n\nAs her anniversary approaches, there is some danger in overstating the impact of DeGeneres’ dual public announcement: literally on an April 14, 1997 Time cover emblazoned with the words “Yep, I’m Gay,” and figuratively two weeks later, in the April 30, 1997 \"Puppy Episode\" of her ABC sitcom Ellen. Culture and history seldom pivot on one moment alone, and almost never do so on the back of a single TV episode — even one watched by 36 million people.\n\nYet despite those caveats, there’s little doubt that DeGeneres’ decision to publicly embrace her homosexuality — and, with ABC’s reluctant but eventual cooperation, to extend that embrace to her fictional character — was a watershed in how gay men and women are treated on TV. And over time, the lessons we learn from TV seep into real life.\n\nGranted, Ellen Morgan was not the first gay character to enter our homes through our TV sets. Viewers had already seen Billy Crystal's star-making performance in the 1977 sitcom Soap as the long-suffering Jodie Dallas, though he had more on-air relationships with women than with men. And more than a year before Ellen’s coming-out declaration, NBC's Friends had aired \"The One with the Lesbian Wedding\" of Susan and Carol — transforming a couple who had initially served as a reflected joke on Ross into people in their own right.\n\nStill, for the most part, gay men and women were as invisible on TV as they were in movies — making occasional appearances as characters whose tragic disgrace was linked to a hinted-at “love that dare not speak its name.” The most you'd find were asexual camp twists on the traditional “sissy” stereotype, such as Paul Lynde’s Uncle Arthur in Bewitched, or “confirmed bachelors” like the one Tony Randall played in the 1981 series Love, Sidney — a character who had been gay in the TV movie that launched the show but was neutered once it went to series.\n\nThen came Ellen, a slight sitcom that had struggled creatively for four seasons because it was stuck in a story-generating dead end: DeGeneres and ABC were not ready for the character to be a lesbian, but DeGeneres was uncomfortable playing straight. Finally, after many rumors and much buildup, Ellen Morgan came out in a two-part, late-season episode that cast Laura Dern as the woman who made Ellen realize who she was.\n\nThere was resistance: from advertisers, conservative advocacy groups, and so-called \"tolerant\" people who were fine with homosexuals as long as they didn’t force their gay \"lifestyle\" upon them. An argument, by the way, generally made by heterosexuals who have no idea of how often they assert their own sexuality on a daily basis in the pictures on their desks, the conversations they have about their spouses or their children, and the way they interact. As well they should.\n\nMore importantly, in the fifth and final season, there was resistance from viewers, who began to wander away. Prejudice may have played some part (exacerbated by the ludicrous \"adult content\" warnings ABC slapped on the episodes), but the truth may be that a show as paper-thin as Ellen was not ready to carry the burden of a groundbreaking subject, particularly when sending a message seemed to become its only purpose.\n\nThe show disappeared, and DeGeneres’s career took a hit, but the world did not end — for her, for ABC or for Hollywood. And because the world and the business went on, others were able to step forward, through shows as varied as Will & Grace, Buffy the Vampire Slayer, Queer as Folk, Six Feet Under, Brothers and Sisters, True Blood, Glee, Modern Family and Sunday's American Gods — a Starz soft-core fantasy that takes us way past those first-step Will & Grace days when characters could be homosexual as long as no sex was involved.\n\nTV's gay characters, before and after Ellen\n\nIn essence, it's a progression every minority knows. You’re not seen at all, or you’re so disguised, it’s as good as not being seen. Then you’re only seen at your perceived worst, as murderers, suicides, sex fiends, and other figures of tragedy. Slowly, progress comes — though that usually means, at first anyway, that you're only seen at what society thinks of as your best, or your safest.\n\nThe hope for all is that one day, you'll be accorded the same rights as the majority: To be seen as who you are, in full, and treated as well or as badly as everyone else. Which means for every wonderful, romantic love story like London Spy, you have to accept a sex-fest reality mess like Thursday's Fire Island, on Logo. Because that's the cost and reward of freedom.\n\nAnd at least in part, we have Ellen — and Ellen — to thank.", "images": ["https://www.gannett-cdn.com/-mm-/310370840aa0713345e42ca90917b3f5a6e67b46/c=0-21-795-470/local/-/media/2017/04/26/USATODAY/USATODAY/636287987246840097-Ellen-DeGeneres-Time-Magazine-cover-.jpg?width=795&height=449&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/presto/2020/04/16/USAT/4d8a8908-57d6-4c34-a2cc-f44dd8502152-b51007f0-adff-4d31-842a-49bf32e1ad1b_thumbnail.png?width=660&height=372&fit=crop&format=pjpg&auto=webp", "http://videos.usatoday.net/Brightcove3/29906170001/201704/971/29906170001_5412441105001_5412419480001-vs.jpg?pubId=29906170001"], "top_img": "https://www.gannett-cdn.com/-mm-/310370840aa0713345e42ca90917b3f5a6e67b46/c=0-21-795-470/local/-/media/2017/04/26/USATODAY/USATODAY/636287987246840097-Ellen-DeGeneres-Time-Magazine-cover-.jpg?width=795&height=449&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/tv/2017/04/26/ellen-degeneres-gay-coming-out-tv-20-year-anniversary/100888584/", "title": "20-year flashback: Ellen DeGeneres came out, and paved the way for more gay TV roles", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "20-year flashback: Ellen DeGeneres came out, and paved the way for more gay TV roles", "description": "We’ve come so far in 20 years — and the way Ellen DeGeneres came out helped get us here.", "url": "https://www.usatoday.com/story/life/tv/2017/04/26/ellen-degeneres-gay-coming-out-tv-20-year-anniversary/100888584/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/310370840aa0713345e42ca90917b3f5a6e67b46/c=0-21-795-470/local/-/media/2017/04/26/USATODAY/USATODAY/636287987246840097-Ellen-DeGeneres-Time-Magazine-cover-.jpg?width=795&height=449&fit=crop&format=pjpg&auto=webp", "width": 795, "height": 449}, "type": "article"}, "article": {"author": "Robert Bianco", "content_tier": "free", "opinion": "false"}, "description": "We’ve come so far in 20 years — and the way Ellen DeGeneres came out helped get us here.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/310370840aa0713345e42ca90917b3f5a6e67b46/c=0-21-795-470/local/-/media/2017/04/26/USATODAY/USATODAY/636287987246840097-Ellen-DeGeneres-Time-Magazine-cover-.jpg?width=795&height=397&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "20-year flashback: Ellen DeGeneres came out, and paved the way for more gay TV roles", "description": "We’ve come so far in 20 years — and the way Ellen DeGeneres came out helped get us here."}}, "movies": [], "publish_date": 1493136000.0, "source": "https://www.usatoday.com", "summary": ""}