{"url": "https://www.etonline.com/awards/grammys/210286_2017_grammy_awards_the_best_worst_and_weirdest_moments", "text": "\n\nJames Corden hosted the 2017 GRAMMY Awards on Sunday, in an evening filled with some touching tributes, some unusual acceptance speeches and a whole lot of Blue Ivy!\n\nFrom Beyonce's unbelievable and hypnotic performance to Adele's non-stop run of emotional wins to Lady Gaga crowd surfing for some reason, here's a look at the best, worst and downright weirdest moments from music's biggest night.\n\n\n\nWATCH: James Corden Opens GRAMMYs 2017 by Tripping Down the Stairs, Dissing Donald Trump in Epic Rap\n\n\n\n\n\nBEST MOMENTS\n\n\n\n\n\nAdele Opens the Show (With Her Ring)\n\n\n\nAfter her previous glitchy performance at the GRAMMYs, Adele returned to the stage to open this year's show and her flawless delivery of \"Hello\" had people in tears. However, many watching at home were just as obsessed with the sparkling band on her ring finger, adding fuel to the rumors that she secretly got engaged to -- or even married -- her boyfriend, Simon Konecki. But we were mostly fascinated about how well she hit her high notes.\n\n\n\nTwenty One Pilots Strip Down to Their Underwear, Corden Responds\n\n\n\nWhen Tyler Joseph and Josh Dun won Best Pop Duo/Group, the two artists stripped off their tuxedo pants and accepted the award in their skivvies. While the stunt seemed silly at first, it turned out there was a meaningful reason behind it all.\n\nJoseph recounted how, years before they \"were able to make any money playing music,\" he invited Dun over to his house to watch the GRAMMYs, and \"as we were watching, we noticed that every single one of us was in our underwear. Josh turned to me, and we were no one at the time, and he said, 'If we ever win a GRAMMY, we should receive it just like this. So, not only is this amazing but I want everyone watching at home to know that you could be next. Anyone from anywhere can do anything.\"\n\n\n\nBeyonce's Psychedelic Live/Holographic Performance\n\n\n\nThe Lemonade singer, who is pregnant with twins, delivered one of the highlight performances of the night that ended up being more like art than your standard live GRAMMYs fare. Combining holograms and pre-recorded packages with a live stage presence, the trippy Golden Goddess experiment was unlike anything we've seen from her (or the awards show) in the past.\n\n\n\nWATCH: Busta Rhymes Calls Donald Trump 'President Agent Orange' in Powerful A Tribe Called Quest Performance\n\n\n\n\n\nKaty Perry Gets Political\n\n\n\nPerry delivered the debut live performance of her new single, \"Chained to the Rhythm,\" along with collaborator Skip Marley. While the song would have been fun to watch on it's own merit, Perry made sure to inject some bold political commentary. Aside from rocking a \"PERSIST\" arm band and a Planned Parenthood pin on her lapel, the duo ended the song by standing in front of a massive projection of the preamble to the Constitution.\n\n\n\nBruno Mars Channels Prince\n\n\n\nIn a tribute to the late star, Mars' proved his love for Prince's legacy with an amazing rendition of the legend's 1984 single, \"Let's Go Crazy,\" while decked out just like music icon, rocking a glittery purple suit, complete with a white ascot. Mars showed just how talented he really is while covering the iconic song. Not only did he nail Prince's vocal range, he shredded on the guitar in a performance that blew most other Prince tributes out of the water.\n\n\n\nPHOTOS: 2017 GRAMMY Winners -- See the Stars With Their Awards!\n\n\n\n\n\nBEST MOMENT OF THE NIGHT\n\n\n\n\n\nAdele Wins Album of the Year, Tries to Give It to Beyonce\n\n\n\nTo say Adele had a big night would be a laughable understatement. She opened the show, she performed the tribute to George Michael and she became the only artist to win Song of the Year, Record of the Year and Album of the year at the same show, twice!\n\nHer tearful acceptance speech for Album of the Year was a non-stop highlight reel. For example, she seemingly confirmed that she had indeed tied the knot with her longtime boyfriend while opening up about being a mom, when she referred to Simon Konecki as her \"husband.\" However, her best moment might have come when she openly wept and said that, while she appreciated the honor, she felt wrong winning it over Beyonce.\n\n\"I can't possibly accept this award. I'm very humbled and very grateful and gracious but [the] artist of my life is Beyonce,\" Adele said through tears as Beyonce looked up at her from the audience. \"The Lemonade album is just so monumental and so well thought out and so beautiful. We all got to see another side to you that you don't always let us see and we appreciate that. All us artists here appreciate you.\"\n\n\"I love you,\" Adele said. \"I always have and I always will.\"\n\n\n\nWATCH: Adele Apologizes for Dropping F-Bomb During George Michael Tribute at the GRAMMYs\n\n\n\n\n\nWORST MOMENTS\n\n\n\n\n\nMetallica and Lady Gaga\n\n\n\nLady Gaga got in touch with her heavy metal side during a performance with Metallica and the results were… awkward. From out-of-place crowd surfing to lead singer James Hetfield's mic getting accidentally turned off, the whole thing just fell apart on its feet in slow motion.\n\n\n\nAdele Makes Herself Cry\n\n\n\nWe never like to see Adele sad! While she might have been flawless in her opening number, when it came time to sing a tribute to the late George Michael, she had a bit of a vocal mishap that led to her getting very emotional.\n\nWhile performing Michael's 1996 song, \"Fastlove,\" a clearly upset Adele stopped the song and said, \"I know it's live TV. I f**ked up. I can't do it again like last year. I'm sorry for swearing. Can we please start it again? I'm sorry, I can't mess this up for him.\" After the second time around, the singer appeared to be on the verge of tears, despite a stirring performance and a lot of support from the audience.\n\n\n\nGreg Kurstin Gets Cut Off\n\n\n\nMusical artists often have to contend with the \"wrap it up\" music when their acceptance speeches go long, but rarely do you see their mics cut off entirely. When Adele and producer Greg Kurstin won the GRAMMY for Song of the Year, Adele got to thank fans, but when Kurstin took the mic, the show producers could not care less and cut away without letting him talk at all. The move elicited a chorus of boos from the audience and was yet another tech hiccup. Luckily, Adele ended up correcting the show's mistake by letting Kurstin talk first when they won Record of the Year.\n\n\n\nJames Corden Trolls Fans Over Kanye West's Boycott\n\n\n\nKanye West was very adamant about not showing up to the GRAMMYs this year. So, when Corden came out to seemingly introduce a performance by the Life of Pablo artist, a lot of fans and viewers freaked out! Then, it turned out Corden was trolling us entirely and the whole thing was just a set-up to the invariably dry annual speech by Recording Academy President Neil Portnow. It was a letdown, to say the least.\n\n\n\nNEWS: Chance the Rapper Was Everyone's Best Friend at the 2017 GRAMMYs -- See the Pics!\n\n\n\n\n\nWEIRDEST MOMENTS\n\n\n\n\n\nJames Corden's Disastrous Intro\n\n\n\nIn what was supposed to be a joke mocking the recent spate of tech problems at various awards shows, Corden's introduction was filled with (intentionally) broken lifts, pratfalls and various mishaps. While it was very funny at the time, it turned out to be a good predictor of the multitude of technical issues that plagued the rest of the show.\n\n\n\nEverything With John Travolta\n\n\n\nThe Saturday Night Fever star came out to promote the fact that there was going to be a Bee Gees tribute later in the show. While that alone was sort of weird, what made things truly bizarre was his unexplained \"bling\" and his unprompted confession that he can't read without glasses. This appearance will never make sense.\n\n\n\nDemi Lovato Singing Bee Gees Tunes\n\n\n\nIn a tribute to the iconic Bee Gees, the \"Confident\" singer wore a disco-tastic dress and sang \"Stayin' Alive.\" (Or, more specifically, only portions of the '70s classic.) While the tribute -- which also included Tori Kelly, Andra Day and LIttle Big Town -- on the whole wasn't bad, it just felt a little disjointed overall.\n\n\n\nSee even more of the best and weirdest moments from the GRAMMYs and the red carpet over at Giphy, ET's partner in bringing all the unforgettable moments to life!\n\n\n\n\n\nWATCH: Beyoncé's GRAMMYs 2017 Performance Features Blue Ivy, Her Baby Bump and Pregnant Dancing\n\n\n\nBeyonce Flaunts Growing Baby Bump During Visually-Stunning GRAMMY Performance -- Watch! This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRelated Gallery", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2018-12/megyn_kelly_gettyimages-1053390462_1280.jpg?h=c673cd1c&itok=GkyEoz-G", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-02/gettyimages-1188309777_copy.jpg?h=c673cd1c&itok=TUXJDh-j", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2017-02/1280_rihanna_2017grammys_getty634980470.jpg?itok=ufdJRIQ6", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-02/et_021217_BestWorstMoments720.jpg?itok=L34a0q8R"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-02/et_021217_BestWorstMoments720.jpg?itok=L34a0q8R", "keywords": [], "authors": ["Zach Seemayer"], "canonical_link": "https://www.etonline.com/awards/grammys/210286_2017_grammy_awards_the_best_worst_and_weirdest_moments", "title": "2017 GRAMMY Awards: The Best, Worst and Weirdest Moments", "meta_data": {"article": {"opinion": "false"}, "title": "2017 GRAMMY Awards: The Best, Worst and Weirdest Moments | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/awards/grammys/210286_2017_grammy_awards_the_best_worst_and_weirdest_moments", "title": "2017 GRAMMY Awards: The Best, Worst and Weirdest Moments", "description": "From tearful speeches to touching tributes, here are the GRAMMY Awards moments you'll be talking about tomorrow.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-02/et_021217_BestWorstMoments720.jpg?itok=L34a0q8R", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "From tearful speeches to touching tributes, here are the GRAMMY Awards moments you'll be talking about tomorrow.", "title": "2017 GRAMMY Awards: The Best, Worst and Weirdest Moments", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Zach Seemayer", "url": "https://www.etonline.com/awards/grammys/210286_2017_grammy_awards_the_best_worst_and_weirdest_moments", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-02/et_021217_BestWorstMoments720.jpg?itok=L34a0q8R"}, "description": "From tearful speeches to touching tributes, here are the GRAMMY Awards moments you'll be talking about tomorrow.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "Awards, Awards, Music, News, Demi Lovato, John Travolta, James Corden, Lady Gaga, Prince, Bruno Mars, Katy Perry, Beyonce, Adele, Grammys", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}