{"url": "https://www.wrestlinginc.com/news/2017/11/total-divas-s7-e3-recap-634156/", "text": "When last we left our Total Divas, we all were wondering (or, maybe I was) if Lana would even have a job the next time we'd see her.\n\nBut, spoiler alert -- she's still gainfully employed, even though she's (wait for it) breaking all the rules (which is also the name of tonight's episode of Total Divas).\n\nSo, to make it easy on everyone, since our Divas were all over the place tonight, let's break it down by groups.\n\nMaryse & The Miz Host a Sleepover for Carmella & Big Cass\n\nYou have to hand it to Maryse -- she has a big heart, and is quite the host when her friends are going to pay a visit. After having a FaceTime chat with Carmella -- that, actually, buffered out for a minute, which leads to hilarity later down the line -- she decides to invite her over with the love of her life, Big Cass, and she offers for the two to stay with her and Miz. Carmella mentioned that she'd wanted to get out of Orlando and take a vacation to Los Angeles, since she hadn't been since her Laker Girl days. Maryse, of course, thinks this is as good of a time as any to have a sleepover, whether or not Carmella and Cass are ready for it. After special-ordering an eight foot by eight foot customized bed for Cass -- that, ultimately, doesn't fit in the house, so The Miz and Maryse put it under their pergola -- and ordering a taco truck (because Carmella loves tacos), the Mizanins are informed that, while they appreciate the offer, Cass and Carmella would rather spend time alone in their hotel room so they can make strange-looking children, or have fun trying.\n\nNaomi & Lana Fight It Out, Again, For the Title\n\nAfter being told that she may not have a job last week, Lana is already trying to push the envelope by Tweeting pictures to Daniel Bryan about her \"unfair chance\" that she didn't have in her match with Naomi (Trinity). So, needless to say, she got called up to the WWE executive offices to get a stern talking-to about posting unauthorized pictures on social media. But no sooner do the WWE suits put down their Pepto-Bismol with Lana that they have to deal with Naomi customizing her belt without permission (even though her husband, Jimmy Uso, warned her against doing so), and spending the whole episode wondering if maybe, just maybe, she may have to forego her championship after all. Ultimately, though, all's well that ends well -- Naomi gets to keep her title, Lana has her \"fair match\" with Naomi, which she loses anyway, and Naomi gets a nice LED-lit belt as a consolation for it all.\n\nNikki & Brie Go On A Road Trip\n\nNikki & Brie, in a previous life, were known as the indomitable Bella Twins, but as of late, they haven't been able to hang out together as much. This is in no small part thanks to Nikki going to the iHeartRadio Awards and hoofing it up on Dancing with the Stars (SHE WAS ROBBED!) while Brie is off raising baby Birdie with Daniel Bryan. So, the two decide to go on a road trip together to reconnect. After a few aborted attempts at playing \"I, Spy,\" the two stop by a place called Dateland to have a \"world famous date shake\" (which sounds gross, but is apparently quite tasty, according to Nikki). But, somewhere along the line, baby Birdie got hungry, and the two had to stop so Brie could breast-feed. Unfortunately, there was no place for Brie to feed the baby, so they end up going to a truck stop's outdoor shower, where Brie pops a squat on a chair kindly provided by the truck stop's matron. Um...thanks, we guess?", "images": ["https://cdn.relaymedia.com/ping?url=https%3A%2F%2Fwww%2EWrestlingInc%2Ecom%2Fnews%2F2017%2F11%2Ftotal%2Ddivas%2Ds7%2De3%2Drecap%2D634156%2F", "https://www.wrestlinginc.com/assets/ui/images/layout/winc-logo.png", "https://www.wrestlinginc.com/assets/lib/counters/news.asp?newsId=634156", "https://www.wrestlinginc.com/images/pics/thumb/maryse1.jpg", "https://www.wrestlinginc.com/assets/ui/images/general/clear.gif", "https://www.wrestlinginc.com/assets/ui/images/layout/f-logo-s.png", "https://www.wrestlinginc.com/assets/ui/images/footer/google-play.png", "https://www.wrestlinginc.com/assets/ui/images/footer/ios-app.png", "http://i1.ytimg.com/vi/AMurO5QE9t4/maxresdefault.jpg", "https://c.statcounter.com/256370/0//1/"], "top_img": "http://i1.ytimg.com/vi/AMurO5QE9t4/maxresdefault.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.WrestlingInc.com/news/2017/11/total-divas-s7-e3-recap-634156/", "title": "Total Divas S7 E3 Recap: Naomi Gets In Trouble For A Championship Leak, Carmella & Big Cass", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "title": "Total Divas S7 E3 Recap: Naomi Gets In Trouble For A Championship Leak, Carmella & Big Cass", "description": "Total Divas S7 E3 Recap: Naomi Gets In Trouble For A Championship Leak, Carmella & Big Cass", "keywords": "lana, wwe news, wrestling news", "image": "http://i1.ytimg.com/vi/AMurO5QE9t4/maxresdefault.jpg", "medium": "article", "article": {"published_time": "2017-11-16T09:20:45 -0500", "tag": "lana, wwe news, wrestling news"}, "og": {"type": "article", "site_name": "Wrestling Inc.", "image": "http://i1.ytimg.com/vi/AMurO5QE9t4/maxresdefault.jpg", "url": "https://www.WrestlingInc.com/news/2017/11/total-divas-s7-e3-recap-634156/", "title": "Total Divas S7 E3 Recap: Naomi Gets In Trouble For A Championship Leak, Carmella & Big Cass - Wrestling Inc.", "description": "Total Divas S7 E3 Recap: Naomi Gets In Trouble For A Championship Leak, Carmella & Big Cass"}, "fb": {"app_id": 123325808288224, "pages": 225021057526395}, "twitter": {"site": "@WrestlingINC", "url": "https://www.WrestlingInc.com/news/2017/11/total-divas-s7-e3-recap-634156/", "title": "Total Divas S7 E3 Recap: Naomi Gets In Trouble For A Championship Leak, Carmella & Big Cass", "description": "Total Divas S7 E3 Recap: Naomi Gets In Trouble For A Championship Leak, Carmella & Big Cass", "card": "summary_large_image", "image": "http://i1.ytimg.com/vi/AMurO5QE9t4/maxresdefault.jpg", "app": {"name": {"iphone": "Wrestling Inc.", "ipad": "Wrestling Inc.", "googleplay": "Wrestling Inc."}, "id": {"iphone": 1102820164, "ipad": 1102820164, "googleplay": "com.rumble.wrestlinginc"}}}, "msapplication-TileImage": "/assets/ui/images/icons/icon-144x144.png"}, "movies": ["https://www.youtube.com/embed/_ACEHa8YMEw"], "publish_date": 1510842045.0, "source": "https://www.wrestlinginc.com", "summary": ""}