{"url": "https://en.wikipedia.org/wiki/Heath_Ledger", "text": "Australian actor\n\nHeath Andrew Ledger[a] (4 April 1979 – 22 January 2008) was an Australian actor, photographer, and music video director. After performing roles in several Australian television and film productions during the 1990s, Ledger left for the United States in 1998 to further develop his film career. His work comprised nineteen films, including 10 Things I Hate About You (1999), The Patriot (2000), A Knight's Tale (2001), Monster's Ball (2001), Lords of Dogtown (2005), Brokeback Mountain (2005), Candy (2006), The Dark Knight (2008), and The Imaginarium of Doctor Parnassus (2009), the latter two being posthumous releases.[1] He also produced and directed music videos and aspired to be a film director.[2]\n\nFor his portrayal of Ennis Del Mar in Brokeback Mountain, Ledger won the New York Film Critics Circle Award for Best Actor and the Best International Actor Award from the Australian Film Institute; he was the first actor to win the latter award posthumously.[3] He was nominated for the BAFTA Award for Best Actor in a Leading Role[4] and the Academy Award for Best Actor.[5] Posthumously, he shared the 2007 Independent Spirit Robert Altman Award with the rest of the ensemble cast, the director, and the casting director for the film I'm Not There, which was inspired by the life and songs of American singer-songwriter Bob Dylan. In the film, Ledger portrayed a fictional actor named Robbie Clark, one of six characters embodying aspects of Dylan's life and persona.[6]\n\nLedger died on the afternoon of 22 January 2008[7][5] due to an accidental overdose of prescription medications.[8][9][10] A few months before his death, Ledger had finished filming his performance as the Joker in The Dark Knight. At the time of his death, The Dark Knight was in its editing-phase, and The Imaginarium of Doctor Parnassus was in the midst of filming, in which he was playing his last role as Tony. His untimely death also affected the subsequent promotion of The Dark Knight.[11] His role as the Joker in The Dark Knight earned him universal acclaim and popularity from fans and critics alike. Ledger also received numerous posthumous accolades for his performance in The Dark Knight, including the Academy Award for Best Supporting Actor, a Best Actor International Award at the 2008 Australian Film Institute Awards, the 2008 Los Angeles Film Critics Association Award for Best Supporting Actor, the 2009 Golden Globe Award for Best Supporting Actor – Motion Picture,[12] and the 2009 BAFTA Award for Best Supporting Actor.[4][13]\n\nEarly life [ edit ]\n\nLedger was born in Perth, Western Australia, the son of Sally Ramshaw, a French teacher, and Kim Ledger, a racing car driver and mining engineer whose family established and owned the Ledger Engineering Foundry.[14] The Sir Frank Ledger Charitable Trust is named after his great-grandfather.[14] He had English, Irish, and Scottish ancestry.[15] Ledger attended Mary's Mount Primary School in Gooseberry Hill,[16] and later Guildford Grammar School, where he had his first acting experiences, starring in a school production as Peter Pan at the age of 10.[5][14] His parents separated when he was 10 and divorced when he was 11.[17] Ledger's older sister Kate, an actress and later a publicist, to whom he was very close, inspired his acting on stage, and his love of Gene Kelly inspired his successful choreography, leading to Guildford Grammar's 60-member team's \"first all-boy victory\" at the Rock Eisteddfod Challenge.[14][18] Ledger's two half-sisters are Ashleigh Bell (b. 1990), his mother's daughter with her second husband and his stepfather Roger Bell, and Olivia Ledger (b. 1996), his father's daughter with his second wife Emma Brown.[19]\n\nCareer [ edit ]\n\n1990s [ edit ]\n\nAfter sitting for early graduation exams at age 16 to get his diploma, Ledger left school to pursue an acting career.[17] With Trevor DiCarlo, his best friend since the age of three, Ledger drove across Australia from Perth to Sydney, returning to Perth to take a small role in Clowning Around (1992), the first part of a two-part television series, and to work on the TV series Sweat (1996), in which he played a cyclist.[14] From 1993 to 1997, Ledger also had parts in the Perth television series Ship to Shore (1993); Ledger also had parts in the short-lived Fox Broadcasting Company fantasy-drama Roar (1997); in Home and Away (1997), one of Australia's most successful television shows; and in the Australian film Blackrock (1997), his feature film debut.[14] In 1999, he starred in the teen comedy 10 Things I Hate About You and in the acclaimed Australian crime film Two Hands, directed by Gregor Jordan.[14]\n\n2000s [ edit ]\n\nFrom 2000 to 2005, he starred in supporting roles as Gabriel Martin, the eldest son of Benjamin Martin (Mel Gibson), in The Patriot (2000), and as Sonny Grotowski, the son of Hank Grotowski (Billy Bob Thornton), in Monster's Ball (2001); and in leading or title roles in A Knight's Tale (2001), The Four Feathers (2002), The Order (2003), Ned Kelly (2003), Casanova (2005), The Brothers Grimm (2005), and Lords of Dogtown (2005).[20] In 2001, he won a ShoWest Award as \"Male Star of Tomorrow\".[21]\n\nLedger received \"Best Actor of 2005\" awards from both the New York Film Critics Circle and the San Francisco Film Critics Circle for his performance in Brokeback Mountain,[22][23] in which he plays Wyoming ranch hand Ennis Del Mar, who has a love affair with aspiring rodeo rider Jack Twist, played by Jake Gyllenhaal.[24] He also received a nomination for Golden Globe Best Actor in a Drama and a nomination for Academy Award for Best Actor for this performance,[25] making him, at age 26, the ninth-youngest nominee for a Best Actor Oscar.[26] In The New York Times review of the film, critic Stephen Holden writes: \"Both Mr. Ledger and Mr. Gyllenhaal make this anguished love story physically palpable. Mr. Ledger magically and mysteriously disappears beneath the skin of his lean, sinewy character. It is a great screen performance, as good as the best of Marlon Brando and Sean Penn.\"[27] In a review in Rolling Stone, Peter Travers states: \"Ledger's magnificent performance is an acting miracle. He seems to tear it from his insides. Ledger doesn't just know how Ennis moves, speaks and listens; he knows how he breathes. To see him inhale the scent of a shirt hanging in Jack's closet is to take measure of the pain of love lost.\"[28]\n\nAfter Brokeback Mountain, Ledger costarred with fellow Australian Abbie Cornish in the 2006 Australian film Candy, an adaptation of the 1998 novel Candy: A Novel of Love and Addiction, as young heroin addicts in love attempting to break free of their addiction, whose mentor is played by Geoffrey Rush; for his performance as sometime poet Dan, Ledger was nominated for three \"Best Actor\" awards, including one of the Film Critics Circle of Australia Awards, which both Cornish and Rush won in their categories. Shortly after the release of Candy, Ledger was invited to join the Academy of Motion Picture Arts and Sciences.[29] As one of six actors embodying different aspects of the life of Bob Dylan in the 2007 film I'm Not There, directed by Todd Haynes, Ledger \"won praise for his portrayal of 'Robbie [Clark],' a moody, counter-culture actor who represents the romanticist side of Dylan, but says accolades are never his motivation\".[30] Posthumously, on 23 February 2008, he shared the 2007 Independent Spirit Robert Altman Award with the rest of the film's ensemble cast, its director, and its casting director.[31]\n\nIn his penultimate film performance, Ledger played the Joker in Christopher Nolan's 2008 film The Dark Knight, which was released nearly six months after his death. While working on the film in London, Ledger told Sarah Lyall in their New York Times interview that he viewed The Dark Knight's Joker as a \"psychopathic, mass murdering, schizophrenic clown with zero empathy\".[32] For his work on The Dark Knight, Ledger posthumously won the Academy Award for Best Supporting Actor, which his family accepted on his behalf, as well as numerous other posthumous awards, including the Golden Globe Award for Best Supporting Actor, which Christopher Nolan accepted for him.[33][34] At the time of his death on 22 January 2008, Ledger had completed about half of the work for his final film performance as Tony in Terry Gilliam's The Imaginarium of Doctor Parnassus.[35][36] Gilliam chose to adapt the film after his death by having fellow actors Johnny Depp, Jude Law, and Colin Farrell play \"fantasy transformations\" of his character so that Ledger's final performance could be seen in theatres.\n\nDirectorial work [ edit ]\n\nrightmost) posing with the cast and the director of I'm Not There at the 64th Ledger () posing with the cast and the director ofat the 64th Venice Film Festival in September 2007.\n\nLedger had aspirations to become a film director and had made some music videos with his production company The Masses, which director Todd Haynes praised highly in his tribute to Ledger upon accepting the ISP Robert Altman Award, which Ledger posthumously shared, on 23 February 2008.[31][37] In 2006, Ledger directed music videos for the title track on Australian hip hop artist N'fa's CD debut solo album Cause An Effect[38] and for the single \"Seduction Is Evil (She's Hot)\".[39][40] Later that year, Ledger inaugurated a new record label, The Masses Music, with singer Ben Harper and also directed a music video for Harper's song \"Morning Yearning\".[32][41]\n\nAt a news conference at the 2007 Venice Film Festival, Ledger spoke of his desire to make a documentary film about the British singer-songwriter Nick Drake, who died in 1974, at the age of 26, from an overdose of an antidepressant.[42] Ledger created and acted in a music video set to Drake's recording of the singer's 1974 song about depression \"Black Eyed Dog\" – a title \"inspired by Winston Churchill's descriptive term for depression\" (black dog);[43] it was shown publicly only twice, first at the Bumbershoot Festival, in Seattle, held from 1 to 3 September 2007; and secondly as part of \"A Place To Be: A Celebration of Nick Drake\", with its screening of Their Place: Reflections On Nick Drake, \"a series of short filmed homages to Nick Drake\" (including Ledger's), sponsored by American Cinematheque, at the Grauman's Egyptian Theatre, in Hollywood, on 5 October 2007.[44] After Ledger's death, his music video for \"Black Eyed Dog\" was shown on the Internet and excerpted in news clips distributed via YouTube.[42][45][46][47]\n\nHe was working with Scottish screenwriter and producer Allan Scott on an adaptation of the 1983 novel The Queen's Gambit by Walter Tevis, which would have been his first feature film as a director. He also intended to act in the film, with Canadian actress Ellen Page proposed in the lead role.[2][48][49] Ledger's final directorial work, in which he shot two music videos before his death, premiered in 2009.[50] The music videos, completed for Modest Mouse and Grace Woodroofe,[51] include an animated feature for Modest Mouse's song, \"King Rat\", and the Woodroofe video for her cover of David Bowie's \"Quicksand\".[52] The \"King Rat\" video premiered on 4 August 2009.[53]\n\nPersonal life [ edit ]\n\nLedger was an avid chess player, playing some tournaments when he was young.[54] As an adult, he often played with other chess enthusiasts at Washington Square Park,[55] though the level of his play has sometimes been exaggerated.[56] Ledger also had a keen interest in the West Coast Eagles, a professional Australian rules football team that competes in the Australian Football League and is based in his hometown of Perth.[57]\n\nIn addition to being a chess player, Ledger was an avid photographer.[58].\n\nRelationships [ edit ]\n\nLedger had relationships with actresses Lisa Zane, Heather Graham and Naomi Watts.[59][60]\n\nIn 2004, he met and began dating actress Michelle Williams on the set of Brokeback Mountain. Their daughter, Matilda Rose, was born on 28 October 2005 in New York City.[61] Matilda's godparents are Brokeback co-star Jake Gyllenhaal and Williams' Dawson's Creek co-star Busy Philipps.[62] In January 2006, Ledger put his residence in Bronte, New South Wales up for sale[63] and returned to the United States, where he shared a house with Williams in Boerum Hill, Brooklyn from 2005 to 2007.[64] In September 2007, Williams' father confirmed to The Daily Telegraph that Ledger and Williams had ended their relationship.[65]\n\nAfter his break-up with Williams, the tabloid press and other public media linked Ledger romantically with supermodels Helena Christensen and Gemma Ward. In 2011, Ward stated that the pair had begun dating in November 2007 and that their families had spent Christmas 2007 together in their home town of Perth.[66][67][68][69][70][71]\n\nPress controversies [ edit ]\n\nLedger's relationship with the press in Australia was sometimes turbulent, and it led to his abandonment of plans for his family to reside part-time in Sydney.[72][73] In 2004, he strongly denied press reports alleging that \"he spat at journalists on the Sydney set of the film Candy\", or that one of his relatives had done so later, outside Ledger's Sydney home.[72][73] On 13 January 2006, \"Several members of the paparazzi retaliated ... squirting Ledger and Williams with water pistols on the red carpet at the Sydney premiere of Brokeback Mountain\".[74][75]\n\nAfter his performance on stage at the 2005 Screen Actors Guild Awards, when he had giggled in presenting Brokeback Mountain as a nominee for Outstanding Performance by a Cast in a Motion Picture, the Los Angeles Times referred to his presentation as an \"apparent gay spoof\".[76] Ledger called the Times later and explained that his levity resulted from stage fright, saying that he had been told that he would be presenting the award only minutes earlier; he stated: \"I am so sorry and I apologise for my nervousness. I would be absolutely horrified if my stage fright was misinterpreted as a lack of respect for the film, the topic and for the amazing filmmakers.\"[77][78]\n\nLedger was quoted in January 2006 in Melbourne's Herald Sun as saying that he heard that West Virginia had banned Brokeback Mountain, which it had not; actually, a cinema in Utah had banned the film.[79] He had also mistakenly claimed that lynchings had occurred in West Virginia as recently as the 1980s; state scholars disputed his statement, asserting that no documented lynchings had occurred in West Virginia since 1931.[80]\n\nHealth problems and drug use [ edit ]\n\nIn their New York Times interview, published on 4 November 2007, Ledger told Sarah Lyall that his recently completed roles in I'm Not There (2007) and The Dark Knight (2008) had taken a toll on his ability to sleep: \"Last week I probably slept an average of two hours a night. ... I couldn't stop thinking. My body was exhausted, and my mind was still going.\"[81] At that time, he told Lyall that he had taken two Ambien pills, after taking just one had not sufficed, and those left him in \"a stupor, only to wake up an hour later, his mind still racing\".[32]\n\nPrior to his return to New York from his last film assignment, in London, in January 2008, while he was apparently suffering from some kind of respiratory illness, he reportedly complained to his co-star from The Imaginarium of Doctor Parnassus, Christopher Plummer, that he was continuing to have difficulty sleeping and taking pills to help with that problem: \"Confirming earlier reports that Ledger hadn't been feeling well on set, Plummer says, 'we all caught colds because we were shooting outside on horrible, damp nights. But Heath's went on and I don't think he dealt with it immediately with the antibiotics.... I think what he did have was the walking pneumonia.' [...] On top of that, 'He was saying all the time, 'dammit, I can't sleep'... and he was taking all these pills to help him'\".[82]\n\nIn talking with Interview magazine after Ledger's death, Michelle Williams confirmed reports that the actor had experienced trouble sleeping: \"For as long as I'd known him, he had bouts with insomnia. He had too much energy. His mind was turning, turning, turning – always turning\".[83]\n\nLedger was \"widely reported to have struggled with substance abuse\".[84] Following Ledger's death, Entertainment Tonight aired video footage from 2006 in which Ledger stated that he \"'used to smoke five joints a day for 20 years'\"[85][86] and news outlets reported that his drug abuse had prompted Williams to request that he move out of their apartment in Brooklyn.[87] Ledger's publicist asserted that some reportage regarding Ledger and drugs had been inaccurate.[85]\n\nDeath [ edit ]\n\nAt about 3:00 pm (EST), on 22 January 2008, Ledger was found unconscious in his bed by his housekeeper, Teresa Solomon, and his masseuse, Diana Wolozin, in his loft at 421 Broome Street in the SoHo neighborhood of Manhattan.[7][5]\n\nAccording to the police, Wolozin, who had arrived early for a 3:00 pm appointment with Ledger, called Ledger's friend Mary-Kate Olsen for help. Olsen, who was in California, directed a New York City private security guard to go to the scene. At 3:26 pm, \"less than 15 minutes after she first saw him in bed and only a few moments after the first call to Ms. Olsen\", Wolozin telephoned 9-1-1 \"to say that Mr. Ledger was not breathing\". At the urging of the 9-1-1 operator, Wolozin administered CPR, which was unsuccessful in reviving him.[88]\n\nParamedics and emergency medical technicians arrived seven minutes later, at 3:33 pm (\"at almost exactly the same moment as a private security guard summoned by Ms. Olsen\") but were also unable to revive him.[7][88][89] At 3:36 pm, Ledger was pronounced dead, and his body was removed from the apartment.[7][88]\n\nAutopsy and toxicology report [ edit ]\n\nOn 6 February 2008, the Office of the Chief Medical Examiner of New York released its conclusions. Those conclusions were based on an initial autopsy that occurred 23 January 2008 and a subsequent complete toxicological analysis.[8][90][91] The report concluded that Ledger died \"as the result of acute intoxication by the combined effects of oxycodone, hydrocodone, diazepam, temazepam, alprazolam and doxylamine\". It added: \"We have concluded that the manner of death is accident, resulting from the abuse of prescribed medications.\"[8][10]\n\nWhile the medications found in the toxicological analysis may be prescribed in the United States for insomnia, anxiety, pain, or common cold symptoms (doxylamine), the vast majority of physicians in the U.S. are extremely reluctant to prescribe multiple benzodiazepines (e.g., diazepam, alprazolam, and temazepam) to a single patient, let alone to prescribe such medications to a patient already taking a mix of oxycodone and hydrocodone. Although the Associated Press and other media reported that police had estimated that Ledger's death had occurred between 1 pm and 2:45 pm\" on 22 January 2008,[92] the Medical Examiner's Office announced that it would not publicly disclose the official estimated time of death.[93][94] The official announcement of the cause and manner of Ledger's death heightened concerns about the growing problems of prescription drug abuse or misuse and combined drug intoxication (CDI).[9][91][95]\n\nIn 2017, Dr. Jason Payne-James, a forensic pathologist, asserted that Ledger might have survived if hydrocodone and oxycodone had been left out of the combination of drugs that the actor took just prior to his death.[96]\n\nFederal investigation [ edit ]\n\nLate in February 2008, a DEA investigation of medical professionals relating to Ledger's death exonerated two American physicians, who practice in Los Angeles and Houston, of any wrongdoing, determining that \"the doctors in question had prescribed Ledger other medications – not the pills that killed him.\"[97][98]\n\nOn 4 August 2008, citing unnamed sources, Murray Weiss, of the New York Post, first reported that Mary-Kate Olsen had \"refused [through her attorney, Michael C. Miller] to be interviewed by federal investigators probing the accidental drug death of her close friend Heath Ledger ... [without] ... immunity from prosecution\" and that, when asked about the matter, Miller at first declined further comment.[99][100] Later that day, after the police confirmed the gist of Weiss's account to the Associated Press, Miller issued a statement denying that Olsen supplied Ledger with the drugs causing his death and asserting that she did not know their source.[101][102] In his statement, Miller said specifically, \"Despite tabloid speculation, Mary-Kate Olsen had nothing whatsoever to do with the drugs found in Heath Ledger's home or his body, and she does not know where he obtained them,\" emphasizing that media \"descriptions [attributed to an unidentified source] are incomplete and inaccurate.\"[103]\n\nAfter a flurry of further media speculation, on 6 August 2008, the US Attorney's Office in Manhattan closed its investigation into Ledger's death without filing any charges and rendering moot its subpoena of Olsen.[104][105] With the clearing of the two doctors and Olsen, and the closing of the investigation because the prosecutors in the Manhattan US Attorney's Office \"don't believe there's a viable target,\" it is still not known how Ledger obtained the oxycodone and hydrocodone in the lethal drug combination that killed him.[105][106]\n\nEffect on fans [ edit ]\n\nEleven months after Ledger's death, on 23 December 2008, Jake Coyle, writing for the Associated Press, announced that \"Heath Ledger's death was voted 2008's top entertainment story by U.S. newspaper and broadcast editors surveyed by The Associated Press\". He claimed that this was partially a result of the \"shock and confusion\" surrounding the circumstances of Ledger's death, as well as due to Ledger's \"legacy [...] in a roundly acclaimed performance as the Joker in the year's biggest box office hit The Dark Knight\".[107]\n\nControversy over will [ edit ]\n\nAfter Ledger's death, in response to some press reports about his will, filed in New York City on 28 February 2008,[108][109] and his daughter's access to his financial legacy, his father, Kim Ledger, said that he considered the financial well-being of Heath's daughter Matilda Rose an \"absolute priority\", whilst also stating that her mother, Michelle Williams, was \"an integral part of our family\". He added, \"They will be taken care of and that's how Heath would want it to be\".[110] Some of Ledger's relatives may be challenging the legal status of his will signed in 2003, prior to his involvement with Williams and the birth of their daughter and not updated to include them, which divides half of his estate between his parents and half among his siblings; they claim that there is a second, unsigned will, which leaves most of that estate to Matilda Rose.[111][112] Williams' father, Larry Williams, has also joined the controversy about Ledger's will as it was filed in New York City soon after his death.[113]\n\nOn 31 March 2008, stimulating another controversy pertaining to Ledger's estate, Gemma Jones and Janet Fife-Yeomans published an \"Exclusive\" report, in The Daily Telegraph, citing Ledger's uncle Haydn Ledger and other family members, who \"believe the late actor may have fathered a secret love child\" when he was 17, and stating that \"If it is confirmed that Ledger is the girl's biological father, it could split his multi-million dollar estate between ... Matilda Rose ... and his secret love child.\"[114][115][116] A few days later, reports citing telephone interviews with Ledger's uncles Haydn and Mike Ledger and the family of the other little girl, published in OK! and Us Weekly, \"denied\" those \"claims\", with Ledger's uncles and the little girl's mother and stepfather describing them as unfounded \"rumors\" distorted and exaggerated by the media.[117][118]\n\nOn 15 July 2008, Fife-Yeomans reported further, via Australian News Limited, that \"While Ledger left everything to his parents and three sisters, it is understood they have legal advice that under Western Australia law, Matilda Rose is entitled to the lion's share\" of his estate; its executors, Kim Ledger's former business colleague Robert John Collins and Geraldton accountant William Mark Dyson, \"have applied for probate in the West Australian Supreme Court in Perth, advertising for 'creditors and other persons' having claims on the estate to lodge them by 11 August 2008 ... to ensure all debts are paid before the estate is distributed....\"[119] According to this report by Fife-Yeomans, earlier reports citing Ledger's uncles,[110] and subsequent reports citing Ledger's father, which do not include his actual posthumous earnings, \"his entire fortune, mostly held in Australian trusts, is likely to be worth up to $20 million.\"[119][120][121]\n\nOn 27 September 2008, Ledger's father Kim stated that \"the family has agreed to leave the US$16.3 million fortune to Matilda,\" adding: \"There is no claim. Our family has gifted everything to Matilda.\"[120][121] In October 2008, Forbes estimated Ledger's annual earnings from October 2007 through October 2008 – including his posthumous share of The Dark Knight's gross income of \"US$1 billion in box office revenue worldwide\" – as \"US$20 million\".[122]\n\nLegacy [ edit ]\n\nMemorial tributes and services [ edit ]\n\nMemorial for Ledger, outside 421 Broome Street, SoHo , Manhattan, 23 January 2008\n\nAs the news of Ledger's death became public, throughout the night of 22 January 2008, and the next day, media crews, mourners, fans, and other onlookers began gathering outside his apartment building, with some leaving flowers or other memorial tributes.[123][124]\n\nThe next day, at 10:50 am Australian time, Ledger's parents and sister appeared outside his mother's house in Applecross, a riverside suburb of Perth, and read a short statement to the media expressing their grief and desire for privacy.[125] Within the next few days, memorial tributes were communicated by family members; the Prime Minister of Australia, Kevin Rudd; the Deputy Premier of Western Australia, Eric Ripper; Warner Bros. (distributor of The Dark Knight) and thousands of Ledger's fans around the world.[126][127][128][129]\n\nSeveral actors made statements expressing their sorrow at Ledger's death, including Daniel Day-Lewis, who dedicated his Screen Actors Guild Award to him, saying that he was inspired by Ledger's acting; Day-Lewis praised Ledger's performances in Monster's Ball and Brokeback Mountain, describing the latter as \"unique, perfect\".[130][131] Verne Troyer, who was working with Ledger on The Imaginarium of Doctor Parnassus at the time of his death, had a heart shape, an exact duplicate of a symbol that Ledger scrawled on a piece of paper with his email address, tattooed on his hand in remembrance of Ledger because Ledger \"had made such an impression on [him]\".[132] British indie band Kasabian paid tribute to Ledger in their song 'Vlad the Impaler', with the line \"Joker, meet you on the other side\". Singer Tom Meighan often changes the word \"Joker\" to either \"Ledger\", or the names of recently deceased celebrities.\n\nOn 1 February, in her first public statement after Ledger's death, Michelle Williams expressed her heartbreak and described Ledger's spirit as surviving in their daughter.[133][134]\n\nAfter attending private memorial ceremonies in Los Angeles, Ledger's family members returned with his body to Perth.[135][136]\n\nOn 9 February, a memorial service attended by several hundred invited guests was held at Penrhos College, attracting considerable press attention; afterward Ledger's body was cremated at Fremantle Cemetery,[137] followed by a private service attended by only 10 closest family members,[138][139][140] with his ashes interred later in a family plot at Karrakatta Cemetery, next to two of his grandparents.[136][141][142] Later that night, his family and friends gathered for a wake on Cottesloe Beach.[143][144][145]\n\nIn January 2011, the State Theatre Centre of Western Australia in Ledger's home town of Perth named a 575-seat theatre the Heath Ledger Theatre after him. For the opening of the theatre, Ledger's Academy Award for Best Supporting Actor was on display in the theatre's foyer along with his Joker costume.[146]\n\nBon Iver's \"Perth\" was inspired by Heath Ledger.[147] Justin Vernon, the lead singer and songwriter of the American indie folk band, revealed back in 2011 that he had begun working on the song in 2008 and was scheduled to meet with a music video director who was good friends with Ledger, Matt Amato. \"The first thing I worked on, the riff and the beginning melodies, was the first song on the record, 'Perth,'\" Vernon told Exclaim!.[148] Amato was directing the band's \"The Wolves (Act I & II)\" music video the day that Ledger died. \"It was no longer about just making a Bon Iver music video anymore,\" Vernon says. \"This was now our chance to be there with Matt as he grieved. It was a three-day wake.\" Amato told Vernon stories about Ledger that eventually became the inspiration for \"Perth,\" the opening track to the band's second studio album Bon Iver, Bon Iver (2011).[147]\n\nMethod and style [ edit ]\n\nRolling Stone Ledger on the March 2006 cover of\n\n\"You know when you see the preachers down South? And they grab a believer and they go, 'Bwoom! I touch you with the hand of God!' And they believe so strongly, they're on the ground shaking and spitting. And fuck's sake, that's the power of belief... Now, I don't believe in Jesus, but I believe in my performance. And if you can understand that the power of belief is one of the great tools of our time and that a lot of acting comes from it, you can do anything.\" —Ledger, during the interview with Rolling Stone in 2006, on belief, power and acting.[149]\n\nPortraying a variety of roles, from romantic heroes to the reluctantly oppressed, Ledger created a hodgepodge of characters that are deliberately unlike one another, stating \"I feel like I am wasting my time if I repeat myself\". He also reflected on his inability to be happy with his work, \"I feel the same thing about everything I do. The day I say, 'It's good' is the day I should start doing something else.\"[150] Ledger liked to wait between jobs so that he would start creatively hungry on new projects.[151] In his own words, acting was about harnessing \"the infinite power of belief,\"[149] thus using belief as a tool for creating.\n\nDirectors who have worked with the actor praised him for his creativity, seriousness and intuition. \"I've never felt as old as I did watching Heath explore his talents,\" The Dark Knight director Christopher Nolan has written, expressing amazement over the actor's working process, genuine curiosity and charisma.[151] Marc Forster, who directed Ledger in Monster's Ball, complimented him as taking the job \"very seriously\", being disciplined, observant, and understanding and intuitive. In 2007, director Todd Haynes compared Ledger's presence to actor James Dean, casting Ledger as Robbie Clarke, a fictive personification of Bob Dylan in I'm Not There. Drawing on the similar characteristics between the actors, Haynes further highlighted Ledger's \"precocious seriousness\" and intuition. He also felt that Ledger had a rare maturity beyond his years.\"[150] Ledger, however, disconnected himself and acting from perfectionism. \"I'm always gonna pull myself apart and dissect [the work]. I mean, there's no such thing as perfection in what [actors] do. Pornos are more perfect than we are, because they're actually fucking.\"[149]\n\n\"Some people find their shtick,\" Ledger reflected on the categorisation of style. \"I never figured out who 'Heath Ledger' is on film: 'This is what you expect when you hire me, and it will be recognisable'... People always feel compelled to sum you up, to presume that they have you and can describe you. That's fine. But there are so many stories inside of me and a lot I want to achieve outside of one flat note.\"[150]\n\nPosthumous films and awards [ edit ]\n\nLedger's death affected the marketing campaign for Christopher Nolan's The Dark Knight (2008)[11][35] and also both the production and marketing of Terry Gilliam's film The Imaginarium of Doctor Parnassus, with both directors intending to celebrate and pay tribute to his work in these films.[35][36][152][153] Although Gilliam temporarily suspended production on the latter film,[36] he expressed determination to \"salvage\" it, perhaps using computer-generated imagery (CGI), and dedicated it to Ledger.[82][154][155] In February 2008, as a \"memorial tribute to the man many have called one of the best actors of his generation,\" Johnny Depp, Jude Law, and Colin Farrell signed on to take over Ledger's role, becoming multiple incarnations of his character, Tony, transformed in this \"magical re-telling of the Faust story\".[156][157][158] The three actors donated their fees for the film to Ledger's and Williams's daughter.[159]\n\nSpeaking of editing The Dark Knight, on which Ledger had completed his work in October 2007, Nolan recalled, \"It was tremendously emotional, right when he passed, having to go back in and look at him every day. ... But the truth is, I feel very lucky to have something productive to do, to have a performance that he was very, very proud of, and that he had entrusted to me to finish.\"[153] All of Ledger's scenes appear as he completed them in the filming; in editing the film, Nolan added no \"digital effects\" to alter Ledger's actual performance posthumously.[160] Nolan dedicated the film in part to Ledger's memory, as well as to the memory of technician Conway Wickliffe, who was killed during a car accident while preparing one of the film's stunts.[161]\n\nReleased in July 2008, The Dark Knight broke several box office records and received both popular and critical accolades, especially with regard to Ledger's performance as the Joker.[162] Even film critic David Denby, who does not praise the film overall in his pre-release review in The New Yorker, evaluates Ledger's work highly, describing his performance as both \"sinister and frightening\" and Ledger as \"mesmerising in every scene\", concluding: \"His performance is a heroic, unsettling final act: this young actor looked into the abyss.\"[163] Attempting to dispel widespread speculations that Ledger's performance as the Joker had in any way led to his death (as Denby and others suggest), Ledger's co-star and friend Christian Bale, who played opposite him as Batman, has stressed that, as an actor, Ledger greatly enjoyed meeting the challenges of creating that role, an experience that Ledger himself described as \"the most fun I've ever had, or probably ever will have, playing a character\".[11][164] Terry Gilliam also refuted the claims that playing the Joker made him crazy, calling it \"absolute nonsense\" and going on to say, \"Heath was so solid. His feet were on the ground and he was the least neurotic person I've ever met.\"[165]\n\nLedger received numerous awards for his Joker role in The Dark Knight. On 10 November 2008, he was nominated for two People's Choice Awards related to his work on the film, \"Best Ensemble Cast\" and \"Best Onscreen Match-Up\" (shared with Christian Bale), and Ledger won an award for \"Match-Up\" in the ceremony aired live on CBS in January 2009.[166]\n\nOn 11 December 2008, it was announced that Ledger had been nominated for a Golden Globe Award for Best Supporting Actor – Motion Picture for his performance as the Joker in The Dark Knight; he subsequently won the award at the 66th Golden Globe Awards ceremony telecast on NBC on 11 January 2009 with Dark Knight director Christopher Nolan accepting on his behalf.[12][33]\n\nFilm critics, co-stars Maggie Gyllenhaal and Michael Caine and many of Ledger's colleagues in the film community joined Bale in calling for and predicting a nomination for the 2008 Academy Award for Best Supporting Actor in recognition of Ledger's achievement in The Dark Knight.[167] Ledger's subsequent nomination was announced on 22 January 2009, the anniversary of his death.[168]\n\nLedger went on to win the Academy Award for Best Supporting Actor, becoming the second person to win a posthumous Academy Award for acting (after fellow Australian actor Peter Finch, who won for 1976's Network), as well as the first comic-book movie actor to win an Oscar for their acting. Ledger's family attended the ceremony on 22 February 2009, with his parents and sister accepting the award on stage on his behalf.[169][34] Following talks with the Ledger family in Australia, the Academy determined that Ledger's daughter, Matilda Rose, would own the award. However, due to Matilda's age, she will not gain full ownership of the statuette until her eighteenth birthday in 2023.[170] Her mother, Michelle Williams, will hold the statuette in trust for Matilda until that time.[171]\n\nOn 4 April 2017, a trailer was released for the documentary I Am Heath Ledger which was released on 3 May 2017.[172] It features archival footage of Ledger and interviews.[173]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nYear Title Role Notes 1993 Ship to Shore Cyclist 3 episodes 1996 Sweat Snowy Bowles 26 episodes 1997 Home and Away Scott Irwin 9 episodes Roar Conor 13 episodes\n\nMusic video [ edit ]\n\nAccolades [ edit ]\n\nSee also [ edit ]\n\nNotes [ edit ]\n\n^ Many sources normally considered reliable say that his birth name was Heathcliff; however, Ledger himself denied this, saying his name was always just Heath.\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Heath_Ledger_%28Berlin_Film_Festival_2006%29_revised.jpg/170px-Heath_Ledger_%28Berlin_Film_Festival_2006%29_revised.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/Heath_Ledger_%282%29.jpg/220px-Heath_Ledger_%282%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/fd/Portal-puzzle.svg/24px-Portal-puzzle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/e/ea/Heath_Ledger_%282%29.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/21px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/Director_and_actors_of_I%27m_not_there_at_the_64th_Venice_Film_Festival-01_%28cropped%29.jpg/295px-Director_and_actors_of_I%27m_not_there_at_the_64th_Venice_Film_Festival-01_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Heath_Ledger%27s_signature.svg/150px-Heath_Ledger%27s_signature.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/90/HeathJoker.png/180px-HeathJoker.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4d/March_2006_cover_of_Rolling_Stone_magazine_featuring_Heath_Ledger.png/190px-March_2006_cover_of_Rolling_Stone_magazine_featuring_Heath_Ledger.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/LedgerMemorial.jpg/180px-LedgerMemorial.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b9/Flag_of_Australia.svg/24px-Flag_of_Australia.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Heath_Ledger_%282%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Heath_Ledger", "title": "Heath Ledger", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Heath_Ledger_%282%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}