{"url": "https://pandagossips.com/posts/862", "text": "Jordin Sparks is Married to Model Dana Isaiah\n\nJordin Sparks, wife of Dana Isaiah, is an American Idol Season 6 winner, singer, actress and songwriter. She’s known for several roles in television and movies produced over the past 5 years, as well as being the youngest person to ever win American Idol at the age of 17 and multiple Grammy nominations. Her net worth is estimated to be at or just over $10 million. After noticing paparazzi taking photos of their group, Sparks decided to secretly marry her boyfriend Dana Isaiah during a vacation in Hawaii. After tying the knot in the water with friends close by, and the husband and wife honeymooned the remainder of the trip. Isaiah had a birthday in May and turned 25 and Sparks, who will celebrate her birthday in December, is 27. Although they are both young in age they each have begun and led successful careers in their own rights.\n\nFrom Boyfriend to Secretly Becoming Her Husband\n\nSparks went public on Instagram with her relationship to then-boyfriend Isaiah in June of 2017, and secretly wed the model that same year in July. Sparks kept her relationship with her boyfriend Isaiah out of the public eye due to a very public relationship with her previous boyfriend Jason Derulo proving that the pitfalls of fame wreaked havoc on her then-boyfriend and relationship. She followed that same rational when it came to their status as newlyweds and kept the news of their marriage under wraps until sharing news of their bundle of Joy in the fall.\n\nSparks found out about her pregnancy only a month after she and Isaiah’s impromptu wedding. Because of her understanding of life in the public eye and the scrutiny that comes with it, Sparks waited to announce her pregnancy with the new dad-to-be Isaiah until September of 2017. According to Sparks, Isaiah has wanted to share the good news with everyone but respected his wife’s desire for privacy. Isaiah is thrilled to be expecting his first child with sparks early next spring.\n\nWho exactly is Dana Isaiah?\n\nMany have asked this question since news of their relationship broke earlier this summer and while the two seem to be blissfully in love and over the moon about their child-to-be, there is so much to learn about the model that stole this singer’s heart. One thing is for sure: with a compassionate heart, great body and beautiful face, Sparks won the lottery. We think they are an amazing couple and perfect for each other in every way. Want to learn more about Mr. Isaiah? Check out these 5 things to know about him below!\n\n1. Dana Isaiah is a Christian\n\nOne very special and important thing that attracted Sparks and Isaiah to each other is their shared faith. Isaiah is a Christian and so is Sparks. The two constantly post scriptures and messages conveying their shared faith on their personal Instagram accounts. In fact, lots of their Instagram photos together show Sparks and Isaiah sharing their faith with others! Jordin Sparks recently performed the national anthem during a football game in which she had the bible verse Proverbs 31:8-9 written on the back of her hand.\n\n2. Dana Isaiah is a Model\n\nEven though his wife is very well off, Dana Isaiah has got some money of his own. From modeling clothes to several professional shoots shared on his social media relating to fitness, Isaiah is a model making a name for himself. Isaiah’s net worth is said to be around $100,000 and that’s no small feat. His portfolio boasts features in a variety of publications and fitness campaigns, including a shoot in Lapalme Magazine where he also graced the cover. Isaiah frequently shares images of his modeling gigs on his Instagram account.\n\n3. Dana Isaiah is REALLY into Fitness\n\nIsaiah is a trainer and frequently works out with Sparks. He labels himself as a “fitness enthusiast” who loves to work out with Sparks, calling her his workout partner for life. The two are proof that couples that sweat together stay together! They can be seen together in the gym when Isaiah posts videos of his training sessions when he’s sweating it out with his wife. Being fit and athletic are normal for Isaiah who has been involved in sports and fitness most of his life. Isaiah is both a trainer and fitness model and enjoys exercising for health and fun.\n\n4. Dana Isaiah is huge on family\n\nIsaiah celebrated his 25th birthday by working out and with FaceTime conversations with his family. Frequently seen in photos with his nephew, Isaiah is all about the babies in his life. He and Sparks spend lots of time with their families, celebrating holidays and birthdays with the ones they love. Isaiah is very close to his siblings and parents. His Mom and Dad are central to his life.\n\n5. Dana Isaiah played college basketball", "images": ["https://s3-us-west-2.amazonaws.com/cdn.panda-gossips.com/production/posts/eyecatches/000/000/862/original.jpg?1510950658", "https://s3-us-west-2.amazonaws.com/cdn.panda-gossips.com/assets/favicon-d9f323dd1faf37b031ce1432d55a486e80a4e657d4aee0ee2abf2cb95e22382d.ico", "https://s3-us-west-2.amazonaws.com/cdn.panda-gossips.com/assets/logo-772560a10b32f5afb97643a0c264ad88c56172966bede13e83626eef1739ad8a.png"], "top_img": "https://s3-us-west-2.amazonaws.com/cdn.panda-gossips.com/production/posts/eyecatches/000/000/862/original.jpg?1510950658", "keywords": [], "authors": [], "canonical_link": "https://pandagossips.com/posts/862", "title": "Dana Isaiah Wiki: 5 Facts To Know About Jordin Sparks' Boyfriend", "meta_data": {"description": "American Idol winner Jordin Sparks and husband Dana Isaiah are expecting. Here are 5 things to know about Sparks’ model boyfriend turned husband!", "og": {"title": "Dana Isaiah Wiki: 5 Facts To Know About Jordin Sparks' Boyfriend", "type": "article", "url": "https://pandagossips.com/posts/862", "image": "https://s3-us-west-2.amazonaws.com/cdn.panda-gossips.com/production/posts/eyecatches/000/000/862/original.jpg?1510950658", "description": "American Idol winner Jordin Sparks and husband Dana Isaiah are expecting. Here are 5 things to know about Sparks’ model boyfriend turned husband!", "locale": "en"}, "viewport": "width=device-width,initial-scale=1.0,minimum-scale=1.0,maximum-scale=1.0,user-scalable=0"}, "movies": ["https://www.youtube.com/embed/Wo_Y2R6gx3o"], "publish_date": null, "source": "https://pandagossips.com", "summary": ""}