{"url": "https://www.rollingstone.com/culture/culture-news/harrison-ford-breaks-silence-over-carrie-fishers-memoir-star-wars-affair-200810/", "text": "Harrison Ford was tight-lipped when asked about his reaction to late Star Wars costar Carrie Fisher’s revealing memoir during a recent interview, but the actor did manage to share one brief thought on the matter.\n\n“It was strange. For me,” he said in GQ’s new cover story. In 2016, Fisher dropped a bombshell on fans of the franchise when she revealed in her memoir, The Princess Diarist, that she and Ford had an affair while on the set of the film that started the franchise,1977’s Star Wars: Episode IV – A New Hope.\n\nAt the time, Fisher was 19 and Ford was 33 – and married to his first wife, Mary Marquardt, with whom he had two children.\n\nThe steadfastly private actor admitted that he was given advance warning that Fisher planned to write about their affair (“to a degree”), but declined to go into detail about his reaction.\n\n“Oh, I don’t know. I don’t know,” he said. “You know, with Carrie’s untimely passing, I don’t really feel that it’s a subject that I want to discuss.”\n\nWhen asked whether he’s read Fisher’s nearly 300-page memoir, Ford responded shortly, “No. I didn’t.”\n\nFord remained silent throughout Fisher’s promotional tours and interviews for the book, though he was often asked for comment. In a chat with NPR’s Fresh Air host Terry Gross in late November of that year, Fisher expressed surprise that readers made such a big deal out of the three-month affair.\n\n“I said, ‘I found the journals that I kept during the first movie, and I’m probably going to publish them,'” she said of the conversation she had with Harrison prior to moving forward with that chapter of the memoir. “And he just sort of raised his finger and said, ‘Lawyer!’ Then I said, ‘No, I won’t write anything that you don’t want. I mean, I’ll show it to you before and you can take anything out that you want taken out. I don’t want to make you uncomfortable’ – which I, of course, have. Unduly comfortable.”\n\n“I wouldn’t have ambushed him like that, but it’s still – no matter if I told him or not, it probably feels like an ambush,” she continued. “It feels like an ambush to me, and I’m the one who wrote it.”\n\nFisher and Ford reunited on the big screen for 2015’s Star Wars: The Force Awakens, and following Fisher’s death in December 2016, he issued a statement remembering her “fearless” spirit, though he made no mention of their romance.", "images": ["https://www.rollingstone.com/wp-content/uploads/2018/06/ford-fisher-02-e46cf142-d93a-4bf6-b821-512b6d2b0264.jpg", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fculture%2Fculture-news%2Fharrison-ford-breaks-silence-over-carrie-fishers-memoir-star-wars-affair-200810%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=200810", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/ford-fisher-02-e46cf142-d93a-4bf6-b821-512b6d2b0264.jpg", "keywords": [], "authors": ["Joyce Chen", "Joyce Chen'S Most Recent Stories", "Soundgarden", "Family Honor Chris Cornell At Seattle Statue Unveiling", "Bill Coswill Face Five More Accusers In Sexual Assault Retrial", "Natalee Holloway", "Man Linked To Disappearance Fatally Stabbed", "View All"], "canonical_link": "https://www.rollingstone.com/culture/culture-news/harrison-ford-breaks-silence-over-carrie-fishers-memoir-star-wars-affair-200810/", "title": "Harrison Ford Finally Addresses Carrie Fisher Memoir, Affair", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "Harrison Ford says it was \"strange\" for him when Carrie Fisher revealed decades-old fling in memoir.", "news_keywords": "Carrie Fisher, Harrison Ford, Star Wars", "og": {"type": "article", "title": "Harrison Ford Finally Addresses Carrie Fisher Memoir, Affair", "url": "https://www.rollingstone.com/culture/culture-news/harrison-ford-breaks-silence-over-carrie-fishers-memoir-star-wars-affair-200810/", "description": "Veteran actor says it was “strange” for him when Fisher revealed decades-old fling", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/ford-fisher-02-e46cf142-d93a-4bf6-b821-512b6d2b0264.jpg", "width": 1024, "height": 576, "alt": "American actors Carrie Fisher and Harrison Ford on the set of Star Wars: Episode V - The Empire Strikes Back directed by Irvin Kershner. (Photo by Lucasfilm/Sunset Boulevard/Corbis via Getty Images)"}, "locale": "en_US"}, "article": {"published_time": "2017-09-14T15:49:00+00:00", "modified_time": "2018-06-25T15:27:33+00:00"}, "twitter": {"text": {"title": "Harrison Ford Breaks Silence Over Carrie Fisher's Memoir, 'Star Wars' Affair"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/ford-fisher-02-e46cf142-d93a-4bf6-b821-512b6d2b0264.jpg?w=1024", "alt": "American actors Carrie Fisher and Harrison Ford on the set of Star Wars: Episode V - The Empire Strikes Back directed by Irvin Kershner. (Photo by Lucasfilm/Sunset Boulevard/Corbis via Getty Images)"}, "card": "summary_large_image", "site": "@RollingStone", "title": "Harrison Ford Breaks Silence Over Carrie Fisher’s Memoir, ‘Star Wars’ Affair", "description": "Harrison Ford says it was \"strange\" for him when Carrie Fisher revealed decades-old fling in memoir."}, "generator": "WordPress 5.4", "author": "Joyce Chen", "content_type": "Article", "post_id": 200810, "title": "Harrison Ford Breaks Silence Over Carrie Fisher's Memoir, 'Star Wars' Affair", "published_at": "2017-09-14 15:49:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/ford-fisher-02-e46cf142-d93a-4bf6-b821-512b6d2b0264.jpg?w=1024", "comment_count": 0, "tags": "Star Wars", "topics": "Culture News", "body": "Harrison Ford was tight-lipped when asked about his reaction to late Star Wars costar Carrie Fisher's revealing memoir during a recent interview, but the actor did manage to share one brief thought on the matter.\"It was strange. For me,\" he said in GQ's new cover story. In 2016, Fisher dropped a bombshell on fans of the franchise when she revealed in her memoir, The Princess Diarist, that she and Ford had an affair while on the set of the film that started the franchise,1977's Star Wars: Episode IV – A New Hope. At the time, Fisher was 19 and Ford was 33 – and married to his first wife, Mary Marquardt, with whom he had two children.The steadfastly private actor admitted that he was given advance warning that Fisher planned to write about their affair (\"to a degree\"), but declined to go into detail about his reaction.\"Oh, I don't know. I don't know,\" he said. \"You know, with Carrie's untimely passing, I don't really feel that it's a subject that I want to discuss.\"When asked whether he's read Fisher's nearly 300-page memoir, Ford responded shortly, \"No. I didn't.\"Ford remained silent throughout Fisher's promotional tours and interviews for the book, though he was often asked for comment. In a chat with NPR's Fresh Air host Terry Gross in late November of that year, Fisher expressed surprise that readers made such a big deal out of the three-month affair.\"I said, 'I found the journals that I kept during the first movie, and I'm probably going to publish them,'\" she said of the conversation she had with Harrison prior to moving forward with that chapter of the memoir. \"And he just sort of raised his finger and said, 'Lawyer!' Then I said, 'No, I won't write anything that you don't want. I mean, I'll show it to you before and you can take anything out that you want taken out. I don't want to make you uncomfortable' – which I, of course, have. Unduly comfortable.\"\"I wouldn't have ambushed him like that, but it's still – no matter if I told him or not, it probably feels like an ambush,\" she continued. \"It feels like an ambush to me, and I'm the one who wrote it.\"Fisher and Ford reunited on the big screen for 2015's Star Wars: The Force Awakens, and following Fisher's death in December 2016, he issued a statement remembering her \"fearless\" spirit, though he made no mention of their romance.", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1282233600.0, "source": "https://www.rollingstone.com", "summary": ""}