{"url": "https://www.usatoday.com/story/life/tv/2018/11/02/house-cards-final-season-netflix-moving-new-era/1844298002/", "text": "Netflix is dead. Long live Netflix.\n\nThis weekend marks the end of an era for the omnipresent streaming service, with the debut of the final season of \"House of Cards.\"\n\nCanceling \"Cards\" and \"Orange is the New Black\" (its seventh and final season is due in 2019) officially closes the streaming service's first chapter of programming, five years after it began. It was a time when the TV sky seemed limitless – no shows seemed to get canceled, old favorites were constantly being saved and streaming was a playground for writers and directors to experiment. And always, at least on the outside, it seemed to work.\n\nIt was an era when Netflix sought a handful of high-quality, high-talent series to lure new subscribers. It was the era when the Kyle Chandler-starring \"Bloodline\" and the Wachowski sibling extravaganza \"Sense8\" were among the service's top offerings because of their pedigrees alone (both series eventually were canceled in early seasons). It was a time when we thought Netflix was just trying to become HBO.\n\nBut that was 2013. And maybe 2014 and 2015. In the week ending Nov. 2, Netflix released eight new projects, including documentaries, comedy specials and movies, more than any breathing human could likely watch in a weekend. When the Emmy nominations were announced this summer, for the first time, Netflix had more than HBO.\n\nThe streaming service has spent billions of dollars on original programming in every genre, from Food Network-style baking competitions (\"Sugar Rush\") to foreign language sci-fi (\"Dark\") to preteen sobfests (\"Alexa and Katie\"). Sure, it's still fun and experimental. But just like traditional TV networks (whose audience size is made public, unlike Netflix), the streaming service is more frequently canceling shows that don't stick, including Marvel's \"Luke Cage\" and acclaimed true-crime parody \"American Vandal.\"\n\nIn this new world of Netflix, \"Cards\" and \"Orange\" seem quaintly out of date, just five years after they broke ground.\n\nAlmost from the moment it began unveiling original programming – known until then for reruns of series like \"How I Met Your Mother\" and \"Breaking Bad\" and mail-order DVDs – Netflix changed TV. It started quietly with shows like \"Lilyhammer\" but Netflix's big coming-out moment was \"Cards,\" a drama about a ruthless politician directed by Oscar nominee David Fincher and starring Kevin Spacey (then a powerhouse celebrity). It was exactly the kind of dark, serialized, twisty series that thrived in the new binge-streaming paradigm, and it became a phenomenon.\n\nNot long after, prison dramedy \"Orange\" arrived, looking, sounding and feeling like nothing else on TV, including a cast with a wide range of races, body types, socioeconomic statuses, gender identities and sexual orientations. It told women's stories at a time in television when most other programmers were trying to find the next Walter White.\n\n\"Cards\" and \"Orange\" were showered with Emmy nominations (though their wins were few) and became the face of the streaming frontier that Netflix set out to dominate. But the streaming service doesn't need them anymore.\n\nSure, both shows have declined sharply in quality, which would seemingly warrant cancellation, but the reasons for their demise go beyond just their age: Netflix now has so many other options that scratch the same itches.\n\nMore:New on Netflix in November: 'House of Cards,' 'Narcos,' and plenty of Christmas films\n\nThe service has spent hundreds of millions to woo Shonda Rhimes and Ryan Murphy from TV networks, both creators known for making shows with diverse casts and, especially Murphy, for experimenting with form. Want politics? Netflix has also signed Barack and Michelle Obama to a production deal. It has dark dramas and anti-hero shows by the dozen, from \"Ozark\" to \"The Punisher.\" It won 23 Emmys this fall (tying perennial leader HBO), plus SAG Awards and Golden Globes aplenty. If you need to see its influence, look no further than the recently released \"Making a Murderer Part 2,\" which spends ample time outlining just how much the first chapter of the Netflix doc affected the media and the criminal justice system.\n\nWhen Netflix launched original programming, it needed big, buzzy shows to make noise. But the streaming service is now one gigantic monster, hoarding hundreds of big, medium and little shows that cater to every possible interest. Want a baking show mixed with the a sense of the macabre? Try \"The Curious Creations of Christine McConnell.\" Want a cop comedy with a cast as seemingly random as Tony Danza and Josh Groban? There's \"The Good Cop.\" Want to see pretty houses? Enjoy \"The World's Most Extraordinary Homes.\"\n\nNetflix's brand is everything, and its audience is everyone. \"Cards\" and \"Orange\" represent a tiny sliver of that vast canvas.\n\nViewers' main interest in the final season of \"Cards\" is how the show moves on after Spacey was fired after allegations of sexual misconduct and assault. Had the actor not fallen from grace so publicly, \"Cards\" might have premiered its final episodes even more quietly. With so much else on Netflix's welcome screen, \"Cards\" simply isn't essential viewing anymore. On its release day this year it has to compete with a lost Orson Welles movie, a Mike Judge comedy special and two documentaries. Not to mention a Julia Roberts series a few clicks away on Netflix competitor Amazon Prime.\n\nWith every passing day, Netflix executives and their checkbooks turn their attention somewhere new. Its biggest priority now seems to be conquering the film industry. And the streamer certainly seems to be making progress on that front. It's impossible to think of a new series this year that's generated the same adoration and hype that greeted its mini-rom-com film slate, from teen sensation \"The Kissing Booth\" to the by-the-numbers \"Set It Up.\" Film pundits predict that Netflix might get its first best-picture Oscar nomination for Alfonso Cuaron's \"Roma,\" due in theaters this month and on Netflix in December.\n\nSo here's to \"Cards\" and \"Orange\" and the televised revolution they helped begin. It's been a wild five years. It's both exciting and terrifying to wonder what will happen in five more.", "images": ["https://www.gannett-cdn.com/presto/2018/10/22/USAT/669b5926-a312-4e76-932c-a4c3e6597e7a-VPCLIFE_NETFLIX_NOV_THUMB_1.jpg?width=660&height=372&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/presto/2018/10/26/USAT/51926d3e-2bf6-4168-8811-82a5ae9dc45d-XXX_hoc_ps3_004_h.jpg?crop=2999,1680,x0,y139&width=2999&height=1680&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/presto/2018/10/26/USAT/51926d3e-2bf6-4168-8811-82a5ae9dc45d-XXX_hoc_ps3_004_h.jpg?crop=2999,1680,x0,y139&width=2999&height=1680&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/tv/2018/11/02/house-cards-final-season-netflix-moving-new-era/1844298002/", "title": "Say goodbye to 'House of Cards' and hello to a new Netflix era", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Say goodbye to 'House of Cards' and hello to a new Netflix era", "description": "As \"House of Cards\" debuts its sixth and final season, it represents the end of the first era of Netflix, one in which the political drama was a dominating cultural force.", "url": "https://www.usatoday.com/story/life/tv/2018/11/02/house-cards-final-season-netflix-moving-new-era/1844298002/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/presto/2018/10/26/USAT/51926d3e-2bf6-4168-8811-82a5ae9dc45d-XXX_hoc_ps3_004_h.jpg?crop=2999,1680,x0,y139&width=2999&height=1680&format=pjpg&auto=webp", "width": 2999, "height": 1680}, "type": "article"}, "article": {"author": "Kelly Lawler", "content_tier": "free", "opinion": "false"}, "description": "As \"House of Cards\" debuts its sixth and final season, it represents the end of the first era of Netflix, one in which the political drama was a dominating cultural force.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/presto/2018/10/26/USAT/51926d3e-2bf6-4168-8811-82a5ae9dc45d-XXX_hoc_ps3_004_h.jpg?crop=2999,1680,x0,y139&width=1600&height=800&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Say goodbye to 'House of Cards' and hello to a new Netflix era", "description": "As \"House of Cards\" debuts its sixth and final season, it represents the end of the first era of Netflix, one in which the political drama was a dominating cultural force."}}, "movies": [], "publish_date": 1541088000.0, "source": "https://www.usatoday.com", "summary": ""}