{"url": "https://web.archive.org/web/20170829231245/http://screenrant.com/game-thrones-night-king-plan-before-dragon-wall-destroyed/", "text": "At the end of Game of Thrones Season 7, the Night King uses his newly acquired dragon to bring down the east end of the Wall, finally unleashing an army of wights and White Walkers on the Seven Kingdoms. But if this is him entering the final stage of his Westeros death plan, we’re left asking what he would have done if Daenerys hadn’t turned up beyond the Wall with Viserion in the first place.\n\nOf course, the Wall coming down is a major event that has felt like a narrative inevitability since the ancient, 700 foot-high behemoth was first introduced. And it now being breached (if not completely felled) serves – along with the confirmation of Jon’s true lineage and claim to the Iron Throne – feels like the official signal Game of Thrones is entering its final act. Plainly, the Wall had to fall otherwise the story’s conclusion lacks its essential part.\n\nAs such, theorising how it may happen and allow the armies of the dead to go from Wildling-bothering pest to immediate, mortal-coil threatening certainty has been one of the biggest debates in Thrones fandom over the past few seasons. Prior to Season 7, the expectation was that Bran’s mark – given to him by the Night King during a vision of his forces – would remove the magic placed on the structure by the Children of the Forest (the Wall’s origins are the stuff of myth, but it’s assumed to be a shared effort of the Westerosi natives and the first men). The Night King attacking Bran already allowed him to break into the original Three-Eyed Raven’s Children-protected hideout and kill him; surely passing through the Wall would do something similar?\n\nWhen he and Meera arrived at Castle Black at the start of the season, however, it didn’t have much of an impact – the Wall’s remained standing under the watchful eye of Dolores Edd all season with minimal worry. It took the Night King finding a presumed-extinct creature, turning it and riding it to destruction to even create a hole, which is possibly the luckiest move in the entire series.\n\nWhat Would The Night King Have Done Without The Dragon?\n\nAs the Night King uses the dragon he got just over an hour of TV time before to bring down the Wall, are we to assume he had no other way through? The fact he’s been traipsing around just north of the Wall for years (Hardhome isn’t relatively that far out from Eastwatch) would definitely suggest his advancement was being halted.\n\nIf so, then that would mean had Dany never flown north then he’d be stuck twiddling his thumbs, raising the straggling Wildlings for little long-term gain, only hoping for a breakthrough; it was only when the three dragons came over the ridge that an option presented itself and he acted ridiculously quick. That’s an incredibly convenient plot turn in a show once built on methodical storytelling as is, but as it’s the biggest development for the central unstoppable evil force vastly reduces the primary antagonists’ threat; they are only deadly due to the heroes’ failures.\n\nThere is an argument to be made the show is making a point of how man’s fear of death inadvertently only accelerates the inevitability’s advancement, but there was nothing in the show that tries to put blame on Jon, Dany and co.’s short-sightedness (beyond Tyrion’s berating, something that is much more politically focused).\n\nThe Night Knight may have had another, more time-consuming trick up his sleeve – he is immortal, presumably, so waiting isn’t a big problem for his dead army – meaning the dragon simply accelerated plans. Although, as there’s no evidence of it, that begins making assumptions on the villain’s plans, and leading us onto an interesting track.\n\n\n\nThePremium Network Ad Free Browsing\n\nAd Free Browsing Over 10,000 Videos!\n\nOver 10,000 Videos! All in 1 Access\n\nAll in 1 Access Join For Free! GO PREMIUM WITH SCREENRANT Go Premium!", "images": ["https://web.archive.org/web/20170829231245im_/http://screenrant.com/wp-content/uploads/2017/08/The-Night-King-Takes-Down-Viserion-in-Game-of-Thrones.jpg", "https://web.archive.org/web/20170829231245im_/http://screenrant.com/wp-content/themes/screenrant/images/pr-part-of-1.svg", "https://web.archive.org/web/20170829231245im_/http://screenrant.com/wp-content/themes/screenrant/images/pr-go-premium-white.svg", "https://web.archive.org/web/20170829231245im_/http://screenrant.com/wp-content/themes/screenrant/images/pr-icon-light.svg", "https://web.archive.org/web/20170829231245im_/https://www.facebook.com/tr?id=297467373958238&ev=PageView&noscript=1", "https://web.archive.org/web/20170829231245im_/http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1"], "top_img": "https://web.archive.org/web/20170829231245im_/http://screenrant.com/wp-content/uploads/2017/08/The-Night-King-Takes-Down-Viserion-in-Game-of-Thrones.jpg", "keywords": [], "authors": ["Alex Leadbeater"], "canonical_link": "https://web.archive.org/web/20170829231245/http://screenrant.com/game-thrones-night-king-plan-before-dragon-wall-destroyed/", "title": "Game of Thrones: Was the Dragon Always the Night King’s Plan?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "syndication-source": "http://screenrant.com/game-thrones-night-king-plan-before-dragon-wall-destroyed/all/1", "twitter": {"domain": "ScreenRant.com", "site": "@screenrant", "card": "summary_large_image", "title": "Game of Thrones: Was the Dragon Always the Night King's Plan?", "description": "Game of Thrones' big villain is taking advantage of the show's dragons - but what was the Night King going to do before they turned up?", "image": {"src": "http://screenrant.com/wp-content/uploads/2017/08/The-Night-King-Takes-Down-Viserion-in-Game-of-Thrones.jpg"}}, "news_keywords": "Game Of Thrones,SR Originals", "description": "Game of Thrones' big villain is taking advantage of the show's dragons - but what was the Night King going to do before they turned up?", "fb": {"app_id": 1682953215260932}, "og": {"type": "article", "title": "Game of Thrones: Was the Dragon Always the Night King's Plan?", "url": "https://web.archive.org/web/20170829231245/http://screenrant.com/game-thrones-night-king-plan-before-dragon-wall-destroyed/", "locale": "en_US", "description": "What was he doing before Dany turned up?", "site_name": "Screen Rant", "image": {"identifier": "https://web.archive.org/web/20170829231245im_/http://screenrant.com/wp-content/uploads/2017/08/The-Night-King-Takes-Down-Viserion-in-Game-of-Thrones.jpg", "width": 620, "height": 310}}, "article": {"publisher": "http://www.facebook.com/ScreenRant", "published_time": "2017-08-29T10:28:27+00:00", "modified_time": "2017-08-29T10:28:27+00:00", "author": "Alex Leadbeater", "section": "SR Originals", "tag": "game of thrones"}, "robots": "noydir"}, "movies": [], "publish_date": 1504002507.0, "source": "https://web.archive.org", "summary": ""}