{"url": "www.stuff.co.nz/life-style/love-sex/92914269/nicole-kidman-and-keith-urban-take-pda-to-a-new-level-on-cannes-red-carpet", "text": "Cute or a bit too much? Nicole Kidman and Keith Urban weren't shy about showing affection on the red carpet at Cannes.\n\nThe Nic-aissance has officially hit Cannes, with Nicole Kidman promoting no fewer than four movies at the film festival this year.\n\nThe actress understands that the notorious press calls, complete with wall-to-wall photographers, on those red carpet steps, are the most important aspect of a movie's promotion.\n\nWhere else but in Cannes do we witness the perfect melange of decadence, frivolity and just a splash of tacky? Not even The Met Ball can guarantee this level of fashion extra-ness.\n\nAndreas Rentz The couple starts with some hand-holding...\n\nThis goes some way to explaining the piece of performance art produced by Kidman and her husband, Keith Urban, at the premiere of The Killing of a Scared Deer.\n\nREAD MORE:\n\n* Naomie Harris barefoot in Cannes is all of us after a big night out\n\n* Sofia Coppola and Nicole Kidman lead Cannes Film Festival 2017 lineup\n\n* Best & worst dressed: 2016 Cannes Film Festival so far\n\nJEAN-PAUL PELISSIER And some hand-kissing...\n\nThe nuzzles, the elongated looks, the soft nibbles on the neck, the fingers, entwined in climactic pleasure, all combine to create what might best be titled \"Le Public de Love Making\", which is probably the grossest sentence ever written, but if the oversized tutu fits ...\n\nAt one point, Urban took hold of his wife's long hair and gently pulled at it while gripping her bare back, in what might be described as a classic Mills and Boon cover move.\n\nIt isn't the first time the couple have put their PDA on display. It's actually something of a sensuous habit. At this year's Oscars, Kidman and Urban engaged in the sort of kissing normally reserved for couples bidding farewell at the airport… in a private room… on a military base.\n\nERIC GAILLARD There's also a bit of eye-gazing...\n\nWhen Kidman is able to come up for air, she tends to look a little coy. This moment is usually alleviated by Urban through prolonged eye contact followed by a \"presentation\" of his wife to photographers.\n\nIf the move seems familiar, it's because it is.\n\nIn 1992, when Kidman made her debut at Cannes, she arrived with her then husband, Tom Cruise, a man who is not shy of presenting wives and belief-defying displays of public affection.\n\nERIC GAILLARD There's even a few tears.\n\nAll of which begs, was it Tom who influenced Nicole, or the other way around? Kidman, who has admitted to social introversion, has said several times that she finds the red carpet nerve-wracking, and to ease her butterflies, she goes into her own private world.\n\nThis admission makes sense – it's not performance PDA then, but an attempt to cope with the onslaught of cameras.\n\nIt also explains why she also held hands with, and leaned on Colin Farrell at the premiere, too. Although, considering Farrell has lost none of his own scrappy brand of Celtic sensuality, there's really no explanation required.", "images": ["https://resources.stuff.co.nz/content/dam/images/1/j/b/h/m/0/image.related.StuffLandscapeSixteenByNine.1420x800.1jbh3x.png/1496093690887.jpg", "https://secure-nz.imrworldwide.com/cgi-bin/m?ci=nz-stuff&cg=0&cc=1&ts=noscript"], "top_img": "https://resources.stuff.co.nz/content/dam/images/1/j/b/h/m/0/image.related.StuffLandscapeSixteenByNine.1420x800.1jbh3x.png/1496093690887.jpg", "keywords": [], "authors": ["Natalie Reilly"], "canonical_link": "https://www.stuff.co.nz/life-style/love-sex/92914269/nicole-kidman-and-keith-urban-take-pda-to-a-new-level-on-cannes-red-carpet", "title": "Nicole Kidman and Keith Urban take PDA to a new level on Cannes red carpet", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "noarchive", "format-detection": "telephone=no", "fb": {"app_id": 207633159308175, "pages": 21253884267}, "verify-v1": "RazNiYjuvNuEsMeFXxfR9l9cDZIKxcq2VjQZA25CHgM=", "msapplication-config": "/sics-assets/images/favicons/browserconfig.xml", "theme-color": "#ffffff", "description": "Nuzzles, nibbles and hair-pulling - Nicole Kidman and Keith Urban get cosy on the red carpet.", "source": "dailylife.com.au", "og": {"description": "Nuzzles, nibbles and hair-pulling - Nicole Kidman and Keith Urban get cosy on the red carpet.", "title": "Nicole Kidman and Keith Urban take PDA to a new level on Cannes red carpet", "url": "https://www.stuff.co.nz/life-style/love-sex/92914269/nicole-kidman-and-keith-urban-take-pda-to-a-new-level-on-cannes-red-carpet", "type": "article", "image": "https://resources.stuff.co.nz/content/dam/images/1/j/b/h/m/0/image.related.StuffLandscapeSixteenByNine.1420x800.1jbh3x.png/1496093690887.jpg", "site_name": "Stuff"}}, "movies": [], "publish_date": null, "source": "http://www.stuff.co.nz", "summary": ""}