{"url": "https://www.elitedaily.com/p/kourtney-kardashians-relationship-with-kim-khloe-on-kuwtk-vs-real-life-is-different-10920630", "text": "Celebrity relationships and friendships are a rare breed. These famous faces have their lives played out in front of the masses, whether it’s the good, the bad, or the straight-up shady. In Elite Daily’s new series, It’s Complicated, we’re highlighting the biggest celebrity “feuds” that took over Hollywood and dominated our Sunday brunches for weeks on end. We’ll take a deep dive into the lives and social media feeds of our favorite stars and dissect what happened in front of the camera, what went down behind the scenes, and everything you might have missed in between.\n\nThere's no denying it. Somehow, the Kardashian family drama just continues to grow with each and every new season Keeping Up With The Kardashians. So far in Season 15, oldest sister Kourtney's relationship with her younger sisters Kim and Khloé is at the center of the conflict. There's a very clear divide forming in the OG trio, and tension has been high since the premiere episode, when Kim called Kourtney \"the least exciting\" family member to look at. However, you better believe Kourtney Kardashian's relationship with Kim and Khloé on the show is very different than how it is in real life. Many KUWTK fans, including myself, are following the girls in real time on social media too, and they seem to be past the previously recorded drama IRL.\n\nFans are just now learning through current KUWTK episodes that while we were all busy scouring the earth for clues about Kylie Jenner and Khloé Kardashian's pregnancies, Kourtney was at a personal crossroads. Thanks to things like finding a new therapist and her then-growing relationship with Younes Bendjima, Kourtney described feeling disconnected and, for lack of better words, \"so over\" her family's dynamic. In the show, fans watched in wonder as she shouted over the phone to Khloé how \"disgusting\" she feels being a part of the famous clan. In the following episodes, Kourt even pondered taking her children and celebrating the holidays separately from everyone else.\n\nAye, aye, aye. Say it isn't so, Kourt!\n\nLuckily, thanks to things like Instagram, fans know the sisters eventually buried the hatchet. Why? Because everything appears groovy now.\n\nConsider this example: It was understandable that after the premiere episode and famous \"least exciting to look at\" comment that Kourtney, Kim, and Khloé all jumped on Twitter to rehash their argument. Obviously, re-watching an intense fight that happened months ago might cause anyone to get worked up all over again. However, just a week or so later, Kylie Jenner turned 21 and the sisters were already joking about their feud. Kourtney posted a smoldering photo of herself from her sister's party in which she jokingly thanked fans for all of the birthday wishes. Jenner played along, commenting, \"Happy birthday. you're so interesting to look at.\"\n\nInstagram / Kourtney Kardashian\n\nLater, Khloé shared a photo of her and Kourtney goofing around from the same evening. She captioned it, \"Yes, we are completely aware of how obnoxious we are when we are together. NO, WE DON’T CARE!!! Malika took a really cool pic!!\"\n\nSeems like no hard feelings there, eh?\n\nPlus, there's another big change that happened since they wrapped filming. Kourtney and Younes have reportedly broken up. During the time news of their split was swirling in the press, Kim jumped to her sister's side in support. At one point, photos surfaced of Bendjima hanging out and maybe flirting with another woman named Jordan Ozuna in Mexico. Bendjima took the negative attention hard, and posted a message on his Instagram account reading:\n\nOnce again you guys failed. I'm not attached to this 'life' so you can't touch me. I know who i am where i'm from and where i'm going and that bothers you. only one opinion matter. the one of my Lord.\n\nIn response, Kim, who is ride-or-die for her sisters in the end, commented, \"Nice pics from your 'boys trip'.\" She also included a Pinocchio emoji, essentially calling Bendjima a liar.\n\nOf course, we saw on KUWTK and on social media back in December that Kourtney did ultimately decide to stick to tradition and spend the holidays with her family. And, as recently as Aug. 28, she shared a serious throwback picture of herself and Kim from 1995.\n\nYou know what they say, all's well that ends with a major #TBT.\n\nOf course, I'm sure the drama isn't over yet and there's plenty more bickering to come in Season 15. But, if there's one thing this family has proven over and over again, it's how adaptable they are to any situation and that Kardashian blood and hair extensions are thicker than water... or something.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2020/3/31/a51dbd0b-9513-47d8-8dbd-7683667fe4b3-getty-513147352.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/3/26/9208f6bc-3b6c-42b0-8761-eab25348fca2-getty-528406946.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.elitedaily.com/uploads/image/2018/8/28/4de1ca7a-ae16-4a2f-9dd2-9730fbde3350-screen-shot-2018-08-28-at-34629-pm.png?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/1/7af491f4-43fb-4732-9574-5e85b3a1179f-getty-1057802478.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/8/28/75b9ce53-3201-47ba-a48e-49d19fb830b5-kardashians.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2018/8/28/75b9ce53-3201-47ba-a48e-49d19fb830b5-kardashians.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/uploads/image/2018/8/28/75b9ce53-3201-47ba-a48e-49d19fb830b5-kardashians.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/kourtney-kardashians-relationship-with-kim-khloe-on-kuwtk-vs-real-life-is-different-10920630", "title": "Kourtney Kardashian's Relationship With Kim & Khloe On 'KUWTK' Vs. Real Life Is Different", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/kourtney-kardashians-relationship-with-kim-khloe-on-kuwtk-vs-real-life-is-different-10920630", "type": "article", "title": "Kourtney Kardashian's Relationship With Kim & Khloé On 'KUWTK' Is So Different IRL", "description": "Celebrity relationships and friendships are a rare breed. These famous faces have their lives played out in front of the masses, whether it’s the good, the bad, or the straight-up shady. In Elite Daily’s new series, It’s Complicated, we’re…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/8/28/75b9ce53-3201-47ba-a48e-49d19fb830b5-kardashians.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "Celebrity relationships and friendships are a rare breed. These famous faces have their lives played out in front of the masses, whether it’s the good, the bad, or the straight-up shady. In Elite Daily’s new series, It’s Complicated, we’re…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}