{"url": "https://people.com/parents/matt-lanter-wife-angela-welcome-daughter-mackenlee-faire/", "text": "Image zoom Courtesy Matt Lanter\n\nIt’s official: Matt Lanter‘s baby girl has arrived!\n\nThe Timeless star and his wife Angela — a blogger behind the popular lifestyle website Hello Gorgeous — welcomed their first child, daughter MacKenlee Faire Lanter, on Saturday, Dec. 30, in Los Angeles, his rep confirms to PEOPLE.\n\nGet push notifications with news, features and more.\n\nShe weighed in at 6 lb. 11 oz. and measured 20 inches in length.\n\n“The moment our daughter was lifted up and we laid eyes on her was incredible,” Matt, 34, tells PEOPLE. “As a dad, some of my most special moments so far are when she just lays her little body on my chest and falls asleep.”\n\nFor Angela, bonding with MacKenlee through nursing has been one of the most amazing moments for the new mom. “Every time I see this perfect little angel baby, she reminds me of the love I have for her daddy and this brand new love I now have for her,” she shares.\n\nThe couple had scheduled a Cesarean section, but little MacKenlee “had other plans of her own” when Angela woke up in labor a week early.\n\n“We headed to the hospital thinking it was probably false labor — nope. She was on her way,” Angela shares. “Our doctor made our gentle cesarean so special by allowing us to play our own music in the operating room, letting us witness her being born and giving me the privilege of skin to skin as soon as she was born.”\n\nMatt admits that he was “nervous being in the operating room because it all feels so high-stakes surgical,” but the nervousness fell away when he “saw her and heard her cry for the first time.”\n\nUpon meeting their baby girl, it was love at first sight for the couple.\n\n“She’s the most gorgeous baby ever,” Angela recalls about seeing MacKenlee for the first time. “I just thought to myself, she’s perfect,” says Matt.\n\nWant all the latest pregnancy and birth announcements, plus celebrity mom blogs? Click here to get those and more in the PEOPLE Babies newsletter.\n\nRELATED: Matt Lanter Has a Name Picked Out for His Baby Girl, But It’s “Not Official”: “We Want to See Her First”\n\nThe couple, who married in 2013, confirmed their pregnancy to PEOPLE exclusively in August.\n\nOpening up about how fatherhood had been something the he had been looking forward to for a long time, Lanter told PEOPLE in December, “I have a sister. I grew up in a great family and have always seen that as something that I’ve wanted to do.”\n\n“I want to play catch with my kid,” shared the actor. “I want to kick the soccer ball with my little girl. So yeah, I’m excited.”\n\nFor more coverage, follow our babies magazine on Flipboard.\n\nRELATED: Timeless’ Matt Lanter and His Wife Like “Old-Fashioned Names” for Daughter on the Way: It Won’t “Be Apple or Banana”\n\nBut although the couple had no problem revealing the sex of their first child before her due date, there was one thing they kept mum on: what they were thinking about naming her.\n\nIn December, the 90210 alum told PEOPLE that although he and his wife had an idea of what they were going to name their baby before her birth, they wanted to wait until her arrival before making an official decision.\n\n“We have one that we think we’re going to go with. It’s a family thing,” Lanter said. “We’re not saying what it is yet, but it’s definitely not official because we want to see her first [to name her].”\n\nRELATED: Timeless Star Matt Lanter and Wife Angela Expecting First Child\n\n“She might just not look like the name that we have [picked out]. So we’re going to wait to make it official,” Lanter added.\n\nHowever, the Pitch Perfect 3 star had previously revealed what they wouldn’t be naming their child, telling PEOPLE that while he and his wife wanted a name that was “a little different,” they weren’t going to give their baby “Apple or Banana or something like that” for a moniker.\n\n“We like the idea of old-fashioned names,” he explained.\n\nFROM PEN: Ali Fedotowsky-Manno Admits She Will “Definitely Support” Baby Molly If She Wants to Be The Bachelorette!\n\nWhile the happy couple navigated the ups and downs of pregnancy as a team, Angela revealed to PEOPLE that carrying their first child didn’t come without its difficulties.\n\n“The first trimester was a little bumpy,” she said in August. “I was pretty much textbook for all first trimester symptoms, but after battling endometriosis for many years, we are just so beyond thankful to have the chance to become parents.”\n\nBut luckily, her husband was there every step of the way. “Matt has gone above and beyond any expectation I could have had,” Angela continued. “From taking care of me when I’m feeling sick, to never missing a doctor’s appointment.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=600&h=314&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmatt-lanter.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmatt-lanter.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20133'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=600&h=314&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmatt-lanter.jpg", "keywords": [], "authors": ["Aili Nahas", "Maria Pasquini"], "canonical_link": "https://people.com/parents/matt-lanter-wife-angela-welcome-daughter-mackenlee-faire/", "title": "Matt Lanter and Wife Angela Welcome Daughter MacKenlee", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Babies,Births,Exclusive,Matt Lanter,News,TV", "news_keywords": "Babies,Births,Exclusive,Matt Lanter,News,TV", "description": "It's official: Matt Lanter and his wife Angela's baby girl is here", "og": {"title": "A Timeless Moment! Matt Lanter and Wife Angela Welcome Daughter MacKenlee Faire", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/parents/matt-lanter-wife-angela-welcome-daughter-mackenlee-faire/", "description": "It’s official:&nbsp;Matt Lanter‘s baby girl has arrived! The Timeless star and his wife Angela — a blogger behind the popular lifestyle website&nbsp;Hello Gorgeous — welcomed&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=600&h=314&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmatt-lanter.jpg", "width": 600, "height": 314}}, "pinterest": {"url": "https://people.com/parents/matt-lanter-wife-angela-welcome-daughter-mackenlee-faire/", "description": "It's official: Matt Lanter and his wife Angela's baby girl is here", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmatt-lanter.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/parents/matt-lanter-wife-angela-welcome-daughter-mackenlee-faire/", "title": "A Timeless Moment! Matt Lanter and Wife Angela Welcome Daughter MacKenlee Faire", "description": "It's official: Matt Lanter and his wife Angela's baby girl is here", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=600&h=314&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fmatt-lanter.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}