{"url": "https://web.archive.org/web/20180526204350/http://www.cvikas.com:80/2018/05/22/usa-mysterious-nazi-submarine-from-wwii-discovered-in-great-lakes/", "text": "Niagara Falls| Divers from the U.S coast guard took part this morning, in a delicate wreck recoveryoperation to bring to the surface a Nazisubmarine discovered two weeks ago at the bottomof Lake Ontario.\n\nThe U-boat was spotted for the first time by amateur scuba divers in late January and they had contacted the authorities. Archaeologists associated with Niagara University of and master divers from the U.S Coast Guard were mobilized on site to determine what it was, and they soon realized that they were dealing with a German submarine that sank during World War II.\n\nA wreck recovery vessel of the Great Lakes Shipwreck Historical Society was mandated to refloat the ship and bring it back to Niagara Falls, where it must be restored before becoming a museum ship. The delicate recovery operation took nearly 30 hours to complete, but the submarine was finally brought down on the bank with relative ease.\n\nThe divers of the U.S. Coast guard braved the frigid water temperature to go attach cables to the wreck for the recovery operation.\n\nThe submarine was identified as the UX-791, a unique experimental German submarine, based on the U-1200 model, and known to have participated in the “Battle of the St. Lawrence”. It was reported missing in 1943 and was believed to have been sunk near the Canadian coast\n\nProfessor Mark Carpenter, who leads the team of archaeologists, believes that the U-boat could have traveled up the St-Lawrence River, all the way to the Great Lakes, where it intended to disturb the American economy.\n\nA report from the dated from February 1943 suggests, that the ship could have attacked and destroyed three cargo ships and two fishing vessels, even damaging the USS Sable (IX-81), an aircraft carrier of the U.S. navy that was used for training in the Great Lakes, before finally being sunk by anti-sub grenades launched by a Canadian frigate.\n\n“We have known for a long time that the Nazis had sent some of their U-boats in the St-Lawrence River, but this is the first proof that they actually reached the Great Lakes,” Professor Carpenter told reporters. “This could explain the mysterious ship disappearances that took place in the region in 1943, and the reported “Battle of Niagara Falls” which had always been dismissed as a collective hallucination caused by fear.”\n\nThe restoration of the submarine could take more than two years, but once completed, the museum ship is expected to become one of the major tourist attractions of the region.", "images": ["https://web.archive.org/web/20180526204350im_/http://www.cvikas.com/wp-content/uploads/2018/05/sdewf-800x418-1-768x401-678x381.png", "https://web.archive.org/web/20180526204350im_/http://www.cvikas.com/wp-content/uploads/2018/05/sdewf-800x418-1-768x401-678x381-800x445.png"], "top_img": "https://web.archive.org/web/20180526204350im_/http://www.cvikas.com/wp-content/uploads/2018/05/sdewf-800x418-1-768x401-678x381.png", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20180526204350/http://www.cvikas.com/2018/05/22/usa-mysterious-nazi-submarine-from-wwii-discovered-in-great-lakes/", "title": "USA: Mysterious Nazi submarine from WWII discovered in Great Lakes!", "meta_data": {"viewport": "width=device-width, initial-scale=1", "og": {"locale": "en_US", "type": "article", "title": "USA: Mysterious Nazi submarine from WWII discovered in Great Lakes! - cvikas.com", "description": "Niagara Falls| Divers from the U.S coast guard took part this morning, in a delicate wreck recoveryoperation to bring to", "url": "https://web.archive.org/web/20180526204350/http://www.cvikas.com/2018/05/22/usa-mysterious-nazi-submarine-from-wwii-discovered-in-great-lakes/", "site_name": "cvikas.com", "image": {"identifier": "https://web.archive.org/web/20180526204350im_/http://www.cvikas.com/wp-content/uploads/2018/05/sdewf-800x418-1-768x401-678x381.png", "width": 1000, "height": 561}}, "article": {"section": "TRENDING", "published_time": "2018-05-22T16:23:34+01:00"}, "twitter": {"card": "summary_large_image", "description": "Niagara Falls| Divers from the U.S coast guard took part this morning, in a delicate wreck recoveryoperation to bring to", "title": "USA: Mysterious Nazi submarine from WWII discovered in Great Lakes! - cvikas.com", "image": "https://web.archive.org/web/20180526204350im_/http://www.cvikas.com/wp-content/uploads/2018/05/sdewf-800x418-1-768x401-678x381.png"}, "generator": "WordPress 4.9.6", "fb": {"pages": 1583959518572641}}, "movies": [], "publish_date": 1526918400.0, "source": "https://web.archive.org", "summary": ""}