{"url": "https://www.washingtonpost.com/entertainment/2018-kennedy-center-honors-hamilton-cher-reba-mcentire-phillip-glass-wayne-shorter/2018/11/30/a7d8ecee-f4b5-11e8-bc79-68604ed88993_story.html", "text": "“The first time I saw it, I was so overwhelmed,” Miranda says of “Satisfied,” the song Angelica Schuyler, who loves Alexander Hamilton from afar, sings at a powerful moment in “Hamilton.” “I mean, it’s still the number that every time I see it, regardless of where I am in my life or which company I’m seeing in the world, I am completely overwhelmed. It is so much bigger than all of us.”\n\nAD\n\nAD\n\nRead the full story: One key scene helped cement ‘Hamilton’ as a Broadway legend. The team that crafted it explains how. by Peter Marks\n\nLAS VEGAS — What sentient being doesn’t know the six-decade story of her career? What’s left to tell? From “I Got You, Babe” and the Bob Mackie gowns so provocatively sewn, to the divorce, then the other divorce, then the Oscar-winning movie career (“Snap out of it!”), she is always rising up from a recent trip down. The nadir of hair-product infomercials vs. the thrill of the dance-floor comeback. It should be a required part of the SAT: Write 150 words about the life of Cher. Use examples.\n\nThe curtain drops, the audience screams, the beat kicks in and the diva descends on a tiny platform strung from the rafters of the Park MGM theater on a recent Wednesday night. She’s dressed in a golden glamazon bustier, with a massive wig of bright orange ringlets cascading from her shiny crown. She belts out lyrics about the glory of living in a woman’s world.\n\nAD\n\nAD\n\nLAS VEGAS — Her dressing room has rooms. Wings, even. It’s not so much a changing area as a backstage chateau. This is Reba McEntire’s sanctuary when she plays Caesars Palace in the town’s longest-running country music show. She’s the reigning Okie on the Strip.\n\n“You don’t have to be the best,” she says. She swings her cowboy boots over an armchair; they’re from the REBA by Justin line, naturally. “You have to have that special something that connects with the audience.”\n\nIt took McEntire seven hard years of honky-tonks and dance halls to break through. So even as she emerged as one of country’s top-selling and most influential female artists, McEntire resolved not to remain dependent on the mood swings of Nashville’s Music Row. Instead, she seized opportunity everywhere: movies, Broadway, a television series (two, actually), Carnegie Hall, a clothing line, a gig as the first female Colonel Sanders. She Reba-fied our world.\n\nAD\n\nAD\n\nRead the full story: Reba McEntire never needed to be the best. She simply had to want it most. by Karen Heller\n\nNEW YORK— Philip Glass is hard to pin down. Not that he has airs; on the contrary, he’s one of the most straightforward composers you’re likely to meet. “I’m a very bad celebrity,” he says. “I’m not interested in it at all.” And he doesn’t act like one. In conversation, he asks your opinion about things, and when he chuckles at one of his own punchlines, he looks at you hopefully, waiting for a laugh. Yet he’s still hard to pin down, because there have been many different Philip Glasses over the composer’s 81 years. If you think you know who Philip Glass is, you probably don’t.\n\nAD\n\nYou’ll know the outlines, of course. Glass is one of the most popular and prolific composers alive. His output is veritably Bach-like in its range and quantity. To some people, Glass is “Koyaanisqatsi,” the pulsing, mind-bending film in which Glass’s music and Godfrey Reggio’s images play equal parts. To some, he’s “Einstein on the Beach,” the breakout avant-garde opera he created with director Robert Wilson in 1976. Some would name the symphonies he wrote based on the albums David Bowie recorded in Berlin in the late 1970s, “Heroes” and “Low.” (He’s currently working on a symphony — his 12th — based on Bowie’s third Berlin album, “Lodger.”)\n\nAD\n\nIn the new-music world, some hail his masterpiece as “Music in 12 Parts,” the four-plus-hour work he wrote in the early 1970s as a summation of his distinctive musical language. Operagoers might name the 2015 revision of “Appomattox,” covering a century of American history, from the Civil War to the Rev. Martin Luther King Jr. And “a lot of people like ‘The Hours,’” Glass says, referring to the score of the 2002 film with Meryl Streep, Nicole Kidman, and Julianne Moore, one of three of his film scores nominated for an Oscar. “Why not? Beautiful women, and a nice story, and all that.”\n\nRead the full story: If you think you know who Philip Glass is, you probably don’t. by Anne Midgette\n\nLOS ANGELES— Wayne Shorter says he doesn’t really believe in beginnings or endings, so let’s just parachute into 1985, when the garrulous jazz sage felt the need to explain himself to an interviewer who couldn’t keep up with his oratorical playtime: “I’m the kind of person who jumps around when he talks because everything is connected.”\n\nAD\n\nAD\n\nThat ability to connect the most disparate of dots has helped Shorter become one of the finest composers in the history of American jazz — and when he receives the Kennedy Center Honors on Sunday night, he’ll be recognized for all of that, and then some. Because when you listen to the sweep of his music — whether he made it with Miles Davis, or in Weather Report, or on his own — you can practically hear Shorter’s concept of “everything” growing wide enough to include what lies beyond our perception.\n\n“There are colors we can’t see, but they’re connected to the ones we can,” he says, gesturing toward an open window on a breezy October afternoon in his California living room. “There’s a connection between everything.”\n\nRead the full story: Jazz icon Wayne Shorter can play anything. He’s still trying to say everything. by Chris Richards\n\nAD\n\nAD", "images": ["https://www.washingtonpost.com/resizer/KLBr7bF2t9KZgZbzI6vWr2p7fGA=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UCC2GPXUCQI6RGOCZ7FG7T3BBQ.jpg"], "top_img": "https://www.washingtonpost.com/resizer/KLBr7bF2t9KZgZbzI6vWr2p7fGA=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UCC2GPXUCQI6RGOCZ7FG7T3BBQ.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.washingtonpost.com/entertainment/2018-kennedy-center-honors-hamilton-cher-reba-mcentire-phillip-glass-wayne-shorter/2018/11/30/a7d8ecee-f4b5-11e8-bc79-68604ed88993_story.html", "title": "2018 Kennedy Center Honors: Hamilton, Cher, Reba McEntire, Philip Glass, Wayne Shorter", "meta_data": {"og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/entertainment/2018-kennedy-center-honors-hamilton-cher-reba-mcentire-phillip-glass-wayne-shorter/2018/11/30/a7d8ecee-f4b5-11e8-bc79-68604ed88993_story.html", "image": "https://www.washingtonpost.com/resizer/KLBr7bF2t9KZgZbzI6vWr2p7fGA=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UCC2GPXUCQI6RGOCZ7FG7T3BBQ.jpg", "title": "2018 Kennedy Center Honors: Hamilton, Cher, Reba McEntire, Philip Glass, Wayne Shorter"}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "2018 Kennedy Center Honors: Hamilton, Cher, Reba McEntire, Philip Glass, Wayne Shorter"}, "last_updated_date": "2018-12-03T19:59:22.734Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1543507200.0, "source": "https://www.washingtonpost.com", "summary": ""}