{"url": "www.thehollywoodgossip.com/2017/07/khloe-kardashian-responds-to-rumors-oj-simpson-is-her-father/", "text": "If you were anywhere near an Internet-enabled device yesterday, then you no doubt heard the news:\n\nAfter nine years behind bars on armed robbery charges, former NFL star O.J. Simpson has been paroled.\n\nYes, it looks like the football great and likely double-murderer might be a free man as early as October 1.\n\nThe 70-year-old Simpson, of course, is one of the most notorious public figures in America.\n\nAs a result, it stands to reason that the question of what he'll do after his release is looming large today.\n\nWill he write another ill-advised memoir, or did he learn his lesson the first time?\n\nWill he attempt to re-enter public life, or simply lay low?\n\nAnd, of course, will the Juice make an appearance on Maury to settle the most famous paternity mystery since Jon Snow?\n\nAs you may have heard, a rumor that O.J. is Khloe Kardashian's father has been circulating on the Internet for years and years.\n\nProponents cite several pieces of \"evidence,\" including the fact that Kris Jenner and Simpson ran in the same social circles.\n\n(The physical dissimilarities between Khloe and her sisters is perhaps the biggest driver of this long-running theory.)\n\nOne thing that is fact, father than fiction, is that at the time of his arrest for double murder, Simpson was tight with the family.\n\nO.J. was so close with the Kardashians that they were prominently featured in the FX miniseries about the Simpson trial.\n\nSo some considered it strange that the 33-year-old Khloe didn't comment on the news of Simpson's impending release.\n\nAnd the Internet being the Internet, a handful of folks flocked to Khloe's Instagram page to try and coax a comment out of her.\n\nKhloe posted the above pic to her Instagram page yesterday, and not surprisingly, many of the comments had little to do with the photo.\n\nO.J. was the news of the day, and the reactions to Khloe's photo reflected that ... sometimes amusingly, other times inappropriately.\n\n“Dad’s on his way home from that vacation your mom told you about when you were a kid,\" joked one fan.\n\n“The face you make when you find out Daddy’s home #oj,\" commented another.\n\n“Your dad is out of prison girl, u must be thrilled,\" wrote a third.\n\nEventually, Khloe broke Internet Rule Number One and fed the trolls, but she did so without debasing herself by engaging in one-on-one arguments.\n\n“People are a--oles but I don’t care lol. I focus on the good,” Khloe wrote. “They are all f-cked lol such a--holes.\"\n\n\"Hehe oh well… I’m happy and they hatin’.\"\n\nJokes are one thing, but mean-spirited comments made directly to Khloe without an iota of wit are uncalled for.\n\nAnd, as many fans pointed out, in some cases, they're disrespectful to the late Robert Kardashian Sr. (with O.J., above).\n\nThe elder Robert Kardashian died in 2003 at the age of 59; Kris Jenner and Kardashian married in 1978 but later divorced.\n\nFortunately, Khloe's been in the spotlight for the better part of two decades, so she knows exactly how to handle this sort of thing by now.", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--fGsY-D-M--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1500658352/attachment/oj-and-khlo.png"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--fGsY-D-M--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1500658352/attachment/oj-and-khlo.png", "keywords": [], "authors": ["Tyler Johnson"], "canonical_link": "https://www.thehollywoodgossip.com/2017/07/khloe-kardashian-responds-to-rumors-oj-simpson-is-her-father/", "title": "Khloe Kardashian Responds to O.J. Simpson Rumors: Is He Her Father?!", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2017/07/khloe-kardashian-responds-to-rumors-oj-simpson-is-her-father/", "title": "Khloe Kardashian Responds to O.J. Simpson Rumors: Is He Her Father?!", "description": "Khloe Kardashian's Instagram is blowing up these days. Unfortunately, fans are less concerned with her pics than with questions about her paternity.", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--GxoD7_sp--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1459973570/slides/2531/oj-simpson.jpg", "type": "image/jpeg", "width": 630, "height": 354}}, "article": {"published_time": "2017-07-21T13:06:36-04:00", "modified_time": "2017-07-21T14:14:12-04:00", "tag": "Celebrity Gossip", "author": "Tyler Johnson"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Khloe Kardashian Responds to O.J. Simpson Rumors: Is He Her Father?!", "description": "Khloe Kardashian's Instagram is blowing up these days. Unfortunately, fans are less concerned with her pics than with questions about her paternity.", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--fGsY-D-M--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1500658352/attachment/oj-and-khlo.png"}}, "description": "Khloe Kardashian's Instagram is blowing up these days. Unfortunately, fans are less concerned with her pics than with questions about her..."}, "movies": [], "publish_date": 1500656796.0, "source": "http://www.thehollywoodgossip.com", "summary": ""}