{"url": "https://web.archive.org/web/20070625210514/http://clinton.senate.gov/news/statements/details.cfm?id=277627", "text": "Washington, DC - U.S. Senators Charles E. Schumer and Hillary Rodham Clinton today announced that the full Senate Appropriations Committee has approved the Labor, Health and Human Services and Education FY08 Appropriations Bill which includes $1,000,000 for Bethel Performing Arts and $300,000 for SUNY New Paltz. The bill will now proceed to the Senate Floor as the next step in the appropriations process. Schumer and Clinton worked closely with members of the Appropriations Committee to include funding for the project in this year’s spending bill.\n\n“This is great news for the Hudson Valley,” said Schumer. “These projects are designed to strengthen various aspects of the community from encouraging the arts to creating stronger and more specialized academic programs for our students. I will work hard to continue to secure funding for these critical programs.”\n\n“These are welcome investments for the Hudson Valley,” said Senator Clinton. “These funds will help the for the Bethel Woods Center for the Arts continue to promote education, the arts, culture and tourism in the region and will help SUNY New Paltz continue its world class curriculum for students.”\n\nBethel Performing Arts will use $1,000,000 in federal funds to purchase and borrow of exhibits at the non-for-profit museum. Exhibits will focus on the post-WWII period and cultural, political, social, and significant historic events during this period including, in particular, the period of the 1960’s and its continuing legacy. This museum aims at advancing education, the arts, and culture in the surrounding upstate New York region. Funds will also be used for the development and creation of the audio-visual presentations, computer interactive displays, and films, and all licensing and similar matters and related costs and expenses.\n\nSUNY New Paltz will use $300,000 in federal funds for curriculum development in economic development and governance.\n\nNow that the bill has been approved by the full Senate Appropriations Committee, it will be sent to the Senate floor. Following approval by the Senate, the bill will move towards Conference with the House and then to the President for signature.\n\n\n\n\n\n###", "images": ["https://web.archive.org/web/20070625210514im_/http://clinton.senate.gov/images/press/footer.jpg", "https://web.archive.org/web/20070625210514im_/http://clinton.senate.gov/images/press/header_links_border.jpg", "https://web.archive.org/web/20070625210514im_/http://clinton.senate.gov/images/misc/clear.gif"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "", "title": "Hillary Rodham Clinton, Senator for New York: Schumer, Clinton Announce Key Senate Panel Approves Over $1.3 Million for Labor, Health and Human Services Projects in the Hudson Valley", "meta_data": {"description": "Schumer, Clinton Announce Key Senate Panel Approves Over $1.3 Million for Labor, Health and Human Services Projects in the Hudson Valley"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}