{"url": "https://www.usatoday.com/story/life/movies/2018/05/03/overboard-eugenio-derbez-talks-trump-hollywood-and-latin-stereotypes/575276002/", "text": "Get ready to go Overboard — again. This Friday, Anna Faris and Eugenio Derbez are steering the beloved 1987 comedy in a new direction, with Faris playing Kate Sullivan, an exhausted, debt-ridden mom of three, and Derbez hitting the decks as spoiled playboy Leonardo Montenegro.\n\nTwo months after Derbez, 56, presented at the Oscars (“It was a huge dream come true”), USA TODAY chatted with world-famous star about taking on the Goldie Hawn classic — and why he left Mexico City for Hollywood, where films like Overboard and How to Be a Latin Lover awaited.\n\nQuestion: You produced and star in this film. Why remake Overboard, of all '80s comedies?\n\nEugenio Derbez: I’ve been working my entire life in Mexico City, and working for the Hispanic market. But after I did a 2013 movie called Instructions Not Included, it became a hit in the U.S. and a lot of doors opened in Hollywood, so I started having meetings with the studios. When I went to MGM, they wanted to do something with me, and they said, \"Are you interested in doing remakes?\" I said, \"I could be.\" And they gave me the list of remakes (they owned), and when I saw Overboard I was really excited, because I grew up watching the film. Goldie Hawn was my movie-star crush when I was young.\n\nQ: Your Overboard steers clear of stereotyping its Latino characters. What's your take on why modern comedies rely on such tired tropes?\n\nDerbez: When I started coming to the U.S., they were offering me only the typical stereotypical roles: the druggard, the criminal, the gang member, or in the best case scenario, the gardener or the cook. I was fed up with all these roles that were always the same. And I promised I would try to change the image of Latinos in Hollywood.\n\nNow that I was able to co-produce this movie, we felt that it was necessary to change the stereotypes. The natural thing to do in Hollywood was to have me play the poor carpenter. But we wanted a fresh take and changed the genders. That way I can play the billionaire, and we can have Anna play the carpet-cleaning lady. We're breaking stereotypes and we’re also avoiding direct comparison to Goldie Hawn and Kurt Russell.\n\nRelated:Where are the movies for Hispanic audiences?\n\nMore:The 75 best movie comedies of the '80s\n\nAlso:Mexico had great night at the Oscars. President Trump still tweeted smear\n\nQ: We still see poor representation of Latino leads in Hollywood films, despite years of #OscarsSoWhite. What needs to change?\n\nDerbez: When we had the years of #OscarsSoWhite, all the African Americans were together and they joined to protest. But right now with this Trump administration, we feel a lot of fear to raise our voices. So we haven’t been able to really raise our hands, raise our voices to say we deserve more opportunities. But I think it’s important. In my case, it’s me producing my own stuff. Right now, I’m my own producer because that's the only way I can have jobs.\n\nQ: Do you think Overboard will be received differently in the Me Too era?\n\nDerbez: We had lot of luck (in the timing of) when we decided to do this. But after the Me Too movement, I cannot imagine what would have happened if we kept the same pattern. Nowadays to have a guy kidnapping a woman to make her work at home? It would be really politically incorrect.\n\nQ: Has the Me Too movement affected filmmaking in Mexico?\n\nDerbez: Honestly, not yet. Hopefully someday a lot of people are going to start speaking out and telling their stories.\n\nQ: What’s been the biggest transition moving from Mexico City to Hollywood three years ago?\n\nDerbez: Everything. I mean, I had a career and a life in Mexico and I had really successful shows (Al Derecho y al Derbez and La familia P. Luche). I had everything back there and all the sudden after Instructions Not Included came out, and it became what it became, I had to make a decision to come here to try to conquer a new market or to continue in my comfort zone.\n\nI have way more freedom in Los Angeles and in the U.S. But it’s funny because when I have a meeting with producers or people from the industry, we go to a restaurant to meet someone and nobody knows me. But all of the sudden, the entire kitchen comes out and they start taking pictures with me, or at valet parking. It's strange to be a very well-known face for some of them and completely unknown for another part of the industry.\n\nQ: Now given the film, I have to ask — are you a yacht guy?\n\nDerbez: I mean, who doesn’t want to have a yacht? But I would prefer to invest my money in something else. But I love them. I just wouldn’t buy one unless I had a lot, a LOT of money.", "images": ["https://media.gannett-cdn.com/29906170001/29906170001_5690709704001_5690691748001-vs.jpg?pubId=29906170001&width=660&height=372&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/2b827855ed813875d11c3bb971f080d0abdc8b3b/c=0-0-4638-2620/local/-/media/2018/05/02/USATODAY/USATODAY/636608840104761526-AP-APTOPIX-LA-Premiere-of-Overboard-99563865.JPG?width=3200&height=1808&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/2b827855ed813875d11c3bb971f080d0abdc8b3b/c=0-0-4638-2620/local/-/media/2018/05/02/USATODAY/USATODAY/636608840104761526-AP-APTOPIX-LA-Premiere-of-Overboard-99563865.JPG?width=3200&height=1808&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/movies/2018/05/03/overboard-eugenio-derbez-talks-trump-hollywood-and-latin-stereotypes/575276002/", "title": "Q&A: 'Overboard' star Eugenio Derbez on Trump, conquering Hollywood and Latin stereotypes", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Q&A: 'Overboard' star Eugenio Derbez on Trump, conquering Hollywood and Latin stereotypes", "description": "Eugenio Derbez, a huge Mexican star/director, says \"everything\" has changed since he moved to Hollywood from Mexico City three years ago. He co-produces and stars opposite Anna Faris in the new 'Overboard' remake, a gender flip on the Goldie Hawn and Kurt Russell original.", "url": "https://www.usatoday.com/story/life/movies/2018/05/03/overboard-eugenio-derbez-talks-trump-hollywood-and-latin-stereotypes/575276002/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/2b827855ed813875d11c3bb971f080d0abdc8b3b/c=0-0-4638-2620/local/-/media/2018/05/02/USATODAY/USATODAY/636608840104761526-AP-APTOPIX-LA-Premiere-of-Overboard-99563865.JPG?width=3200&height=1808&fit=crop&format=pjpg&auto=webp", "width": 3200, "height": 1808}, "type": "article"}, "article": {"author": "Andrea Mandell", "content_tier": "free", "opinion": "false"}, "description": "Eugenio Derbez, a huge Mexican star/director, says \"everything\" has changed since he moved to Hollywood from Mexico City three years ago. He co-produces and stars opposite Anna Faris in the new 'Overboard' remake, a gender flip on the Goldie Hawn and Kurt Russell original.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/2b827855ed813875d11c3bb971f080d0abdc8b3b/c=0-0-4638-2620/local/-/media/2018/05/02/USATODAY/USATODAY/636608840104761526-AP-APTOPIX-LA-Premiere-of-Overboard-99563865.JPG?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Q&A: 'Overboard' star Eugenio Derbez on Trump, conquering Hollywood and Latin stereotypes", "description": "Eugenio Derbez, a huge Mexican star/director, says \"everything\" has changed since he moved to Hollywood from Mexico City three years ago. He co-produces and stars opposite Anna Faris in the new 'Overboard' remake, a gender flip on the Goldie Hawn and Kurt Russell original."}}, "movies": [], "publish_date": 1525276800.0, "source": "https://www.usatoday.com", "summary": ""}