{"url": "people.com/celebrity/a-timeline-of-the-complicated-relationship-between-taylor-swift-and-kim-kardashian-west/", "text": "Taylor Swift and Kim Kardashian West aren’t so different – both are massive successes in their respective fields (whether it be singing, reality TV and/or accumulating an impressive social media following) and are constantly in the news for, well, anything they do.\n\nBut these two have had a rather interesting history, especially after Kim released footage of Taylor and Kanye West‘s phone call about those “Famous” lyrics, as well as Taylor’s supposed rebuttal in the form of her single, “Look What You Made Me Do.” Let’s take a look back on how we got here.\n\nGet push notifications with news, features and more.\n\nSEPTEMBER 2009: THE KANYE INCIDENT\n\nIt’s important that we start here, even though this situation only involved Taylor and Kanye. You see, since Kanye and Kim later married, Kanye’s past becomes important to Kim’s future. And that time he grabbed the mic from Taylor’s hands during her 2009 VMAs acceptance speech is the root of so much more.\n\nA lot was said about this incident over the years from both sides, from apologies to non-apologies, but Kim didn’t have much to say on the matter – yet.\n\nNOVEMBER 2012: JUST CHILLING\n\nAt the 2012 MTV EMAs, Taylor hung out with Kim – who had just started dating Kanye a few months before. They also spent time with Rita Ora, who was dating Rob Kardashian at the time. Yes, yes we were ever so young.\n\nThere was also a moment when Kim took a photo for Taylor.\n\nFEBRUARY 2015: GOOD VIBES\n\nTaylor and Kanye were reunited at the 2015 Grammys, and there was no drama to be seen. Taylor enjoyed some nice conversation with Kim. Everyone smiled.\n\nThey also embraced! This could really be the start of something beautiful.\n\nThey also took a group shot with JAY-Z, because, why not?\n\nThe whole lovefest sparked rumors of a potential collaboration that West was quick to humor in an interview with Ryan Seacrest. “She wants to get in the studio, and we’re definitely going to go in,” he said. “Any artist with an amazing point of view, perspective, fan base, I’m down to get in the studio and work. I don’t discriminate.”\n\nSadly, that day never came – but if it had, we would have expected backup vocals from Kim, the artist best known for “Jam (Turn It Up).”\n\nFEBRUARY 2015: PARTY TIME\n\nThe two reunited at the 2015 Brit Awards. Kim shared a group photo with Taylor, Kanye and Sam Smith.\n\nThey also had a beautiful moment with Karlie Kloss and Derek Blasberg.\n\nPlus, when Kanye performed, Kim was treated to a front-row view of The Taylor Swift Award Show Dancing Extravaganza. Lucky Kim!\n\nvia GIPHY\n\nJUNE 2015: SISTERLY BOND\n\nhttps://www.instagram.com/p/4c9IgIDvAL/\n\nThe squad joined forces at Taylor Swift’s 1989 World Tour stop in London, kicking off a summer full of guest appearances up on the stage. One certain member of the squad to note: Kendall Jenner, Kim’s sister.\n\nIn fact, a few members of Taylor’s friend circle are also friendly with Kim, including Gigi Hadid and Cara Delevingne (who also go by Slay-Z and Mother Chucker).\n\nAUGUST 2015: BEST NIGHT EVER\n\nSix years after that original night at the VMAs, Taylor took the stage to present Kanye with the Michael Jackson Video Vanguard Award. “I have been a fan of his since I can remember because Kanye defines what it is to be a creative force in music, fashion and, well, life,” Taylor said in her introduction. “I’m really happy for you, and I’mma let you finish, but Kanye has had one of the greatest careers of all time!”\n\nShe then settled in next to Kim in the audience to watch Kanye give an 11-minute speech/rant/proclamation to run for president. Their expressions throughout it all pretty much confirmed their status as #squad.\n\nThey laughed.\n\nThey applauded.\n\nThey looked at one another lovingly.\n\nThey hugged.\n\nAnd for a brief moment, Tay was basically one of the KarJenners.\n\nSEPTEMBER 2015: EVERYONE LOVES FLOWERS\n\nhttps://www.instagram.com/p/7OZIdGDvFT/\n\nAfter that night, Kanye sent Taylor flowers, which pretty much led to her assertion that she would, indeed, be his running mate. She captioned the Instagram photo, “Awww Kanye sent me the coolest flowers!! #KanTay2020 #BFFs.”\n\nInterestingly enough, these flowers beared a striking resembling to his and Kim’s floral wedding wall.\n\nThis also resembles the flower wall Kanye got Kim for her first Mother’s Day. Basically, if Kanye loves you, you get a flower wall.\n\nFEBRUARY 2016: THOSE LYRICS\n\nThen things started to get … complicated. At Kanye’s Yeezy Season 3 fashion show (which doubled as a listening party for his new album, The Life of Pablo), fans first heard his song “Famous.” In it, Kanye raps, “For all my Southside n—-s that know me best / I feel like me and Taylor might still have sex / Why, I made that bitch famous / Goddamn / I made that bitch famous.”\n\nAfter some reactions from the Internet (including squad members Gigi Hadid, Karlie Kloss and Jaime King, plus brother Austin Swift), Kanye took to Twitter to clear up his side of the story. According to him, both Taylor and Kim approved the lyrics prior to the song’s debut.\n\n“I called Taylor and had a hour long convo with her about the line, and she thought it was funny and gave her blessings,” Kanye wrote. He went on to say his lyrics about Taylor were “endearing” and that she herself was actually the source of a contentious line. According to him, she was at a dinner with one of their mutual friends when she allegedly said, “I can’t be mad at Kanye because he made me famous!”\n\nA spokesperson for Taylor told PEOPLE, “Kanye did not call for approval, but to ask Taylor to release his single ‘Famous’ on her Twitter account.”\n\nHer rep also said, “She declined and cautioned him about releasing a song with such a strong misogynistic message. Taylor was never made aware of the actual lyric, ‘I made that bitch famous.'”\n\nFEBRUARY 2016: TAYLOR’S RESPONSE\n\nThe 2016 Grammys came just a few weeks later. Taylor took home the biggest prize of the night – album of the year – and used that moment to make a powerful speech that many saw as a dig to Kanye.\n\n“[A]s the first woman to win album of the year at the Grammys twice,” Taylor said, “I want to say to all the young women out there, there are going to be people along the way who will try to undercut your success or take credit for your accomplishments or your fame.”\n\nShe continued, “If you just focus on the work, and you don’t let those people sidetrack you, someday when you get where you’re going, you’ll look around and you will know that it was you and the people who love you who put you there, and that will be the greatest feeling in the world. Thank you for this moment.”\n\nJUNE 2016: KIM HAS SOME OPINIONS ON THAT\n\nIn her cover interview with GQ for their July issue, Kim said that Taylor did green-light the verse mentioning her. “She totally approved that,” she said. “She totally knew that that was coming out. She wanted to all of a sudden act like she didn’t. I swear, my husband gets so much s— for things [when] he really was doing proper protocol and even called to get it approved.”\n\nShe continued: “What rapper would call a girl that he was rapping a line about to get approval?”\n\nKim also shared that “so many respected people in the music business” heard the phone conversation and that West always keeps cameras rolling while he is recording an album, in case he decides to make a documentary (as one does).\n\n“I don’t know why she just, you know, flipped all of a sudden,” Kim said. “It was funny because [on the call with Kanye] she said, ‘When I get on the Grammy red carpet, all the media is going to think that I’m so against this, and I’ll just laugh and say, ‘The joke’s on you, guys. I was in on it the whole time.’ And I’m like, wait, but [in] your Grammy speech, you completely dissed my husband just to play the victim again.”\n\nKim said Kanye and Taylor have not been in touch since the latest bout of drama, but he did receive an attorney’s letter from Taylor’s team asking for the video footage to be destroyed.\n\nJUNE 2016: TAYLOR SEES THINGS A LITTLE DIFFERENTLY\n\nGQ reached out for comment from Taylor’s side on the whole debacle. A spokesperson for her declined to directly answer questions seeking clarification on the matter, but instead provided the following statement:\n\n“Taylor does not hold anything against Kim Kardashian, as she recognizes the pressure Kim must be under and that she is only repeating what she has been told by Kanye West. However, that does not change the fact that much of what Kim is saying is incorrect. Kanye West and Taylor only spoke once on the phone while she was on vacation with her family in January of 2016, and they have never spoken since. Taylor has never denied that conversation took place. It was on that phone call that Kanye West also asked her to release the song on her Twitter account, which she declined to do.”\n\nThe statement continued: “Kanye West never told Taylor he was going to use the term ‘that bitch’ in referencing her. A song cannot be approved if it was never heard. Kanye West never played the song for Taylor Swift. Taylor heard it for the first time when everyone else did and was humiliated. Kim Kardashian’s claim that Taylor and her team were aware of being recorded is not true, and Taylor cannot understand why Kanye West, and now Kim Kardashian, will not just leave her alone.”\n\nJUNE 2016: THE MUSIC VIDEO\n\nKanye finally released his NSFW music video for “Famous” – and per usual, it got the people talking.\n\nInspired by Vincent Desiderio’s 2008 Sleep painting, Kanye literally stripped down 12 of the biggest pop culture figures, including Taylor. The video also opened with a snippet of her and background audio from that fateful night at the MTV Video Music Awards.\n\nJULY 2016: THE STORY BEHIND THE STORY\n\nOn an episode of Keeping Up with the Kardashians, the family discussed the longstanding feud between Kanye and Taylor in great detail, as well as Kanye’s controversial rant during his appearance on Saturday Night Live, where he was recorded backstage calling Taylor fake.\n\nWhen Kanye’s assistant called Kim to let her know about the leaked audio recording from SNL, she got upset, though Kanye didn’t seem too bothered. “My full-time job is your publicist,” she told Kanye. “I care what people think.”\n\n“Kanye says what he wants and he has no filter … and some people may not understand that,” Kim added during her interview. “Usually I try to stay neutral and just give moral support.”\n\nKim was finally ready to take action when it came to that GQ interview, and she explained to sister Kourtney Kardashian exactly why she felt the need to speak out.\n\n“I never talk s–t about anyone publicly, especially in interviews. But I was just like I had so had it,” she said “I wanted to defend him in it. She legitimately quote says, ‘As soon as I get on that Grammy red carpet I’m gonna tell all the press. Like I was in on it.’ ”\n\n“And then she just didn’t like the reaction?” Kourtney asked.\n\n“Yeah, and you know just another way to play the victim,” Kim added. “It definitely got her a lot of attention the first time,” – referencing when Kanye jumped on VMA stage – “I just don’t think he should be punished for it still to this day,” she continued.\n\n“I feel like I’ve had it with people blatantly treating my husband a certain way and making him look a certain way, and I’m gonna say how I feel,” Kim said during her interview. “Kanye is always so honest and speaks his mind. And you know, when we were first dating, people would always talk s–t and he always had my back. At this point, I really don’t give a f— so I’ll do whatever to protect my husband.”\n\nShe then went on to add that Taylor even helped Kanye rewrite the lyrics within the song.\n\n“I’m so glad that you said the truth,” Kourtney told Kim. “Yeah, I’m just speaking the truth,” Kim replied.\n\nAt the end of the episode, Kim sat down with momager Kris Jenner to discuss the controversial interview and issues surrounding it. Kris tried to play peacemaker, asking, “What would happen if you just called Taylor up and say ‘What happened? How did this go so south?’ I guess I don’t understand the motivation to flip … maybe she took it the wrong way. My advice would to be give Taylor Swift a call.”\n\n“Thank you for your lovely advice,” Kim told her mother, “but I’m not going to take it.”\n\nJULY 2016: THE VIDEO FOOTAGE\n\nImmediately following that episode of KUWTK, Kim took to Snapchat to provide the proof, sharing a series of videos of that phone call between Kanye and Taylor, discussing the “Famous” lyrics – as well as their history.\n\n“It’s like a compliment,” Taylor is heard saying in the video after Kanye reads the lyrics to her (which include, “For all my Southside n—– that know me best / I feel like me and Taylor might still have sex”).\n\n“What I give a f— is you as a person, and as a friend, I want things that make you feel good,” Kanye said, and thanked Swift “for being like, so cool about it” after she told him she appreciates the “heads up” on the lyrics.\n\n“I never would’ve expected you to like tell me about a line in your song,” Taylor said. “I mean, I don’t think anybody would listen to that and be like, ‘Oh, that’s a real diss.’ You gotta tell the story that way that it happened to you and the way you experienced it.”\n\nShe went on to add, “If people ask me about it, look, I think it would be great for me to be like, ‘He called me and told me before it came out … Joke’s on you, guys. We’re fine.”\n\nWhy might Kim do such a thing, you ask? “Kim is super loyal to Kanye and will always do anything to have his back,” a source tells PEOPLE. “She is even more protective of him than she is of herself. She thinks he’s misunderstood and couldn’t stand that people thought he was a liar.”\n\nThe Internet immediately seemed to side with Kim, and #KimExposedTaylorParty started trending.\n\nJULY 2016: TAYLOR SPEAKS AGAIN\n\nTaylor wasn’t about to sit back and watch all this happen – she quickly responded to the videos with a post on Instagram.\n\n“Where is the video of Kanye telling me he was going to call me ‘that bitch’ in his song? It doesn’t exist because it never happened. You don’t get to control someone’s emotional response to being called ‘that bitch’ in front of the entire world,” she wrote in a note.\n\n“Of course I wanted to like the song. I wanted to believe Kanye when he told me that I would love the song. I wanted us to have a friendly relationship. He promised to play the song for me, but he never did. While I wanted to be supportive of Kanye on the phone call, you cannot ‘approve’ a song you haven’t heard. Being falsely painted as a liar when I was never given the full story or played any part of the song is character assassination.”\n\n“I would very much like to be excluded from this narrative, one that I have never asked to be a part of, since 2009,” Taylor continued. She captioned the post, “That moment when Kanye West secretly records your phone call, then Kim posts it on the Internet.”\n\nWATCH: Taylor Swift-Kim Kardashian Feud: Internet Sides with Kim on #KimExposedTaylorParty\n\nJULY 2016: THE AFTERMATH\n\nAt this point, the whole situation extends far past Taylor, Kim and Kanye – the whole squad is getting involved.\n\nTaylor’s BFF Selena Gomez tweeted, “There are more important things to talk about Why can’t people use their voice for something that f—— matters? Truth is last thing we need right now is hate, in any form.”\n\nChloë Grace Moretz spoke out against Kim’s actions, too, which led Kim’s sister Khloé Kardashian to clap back against her.\n\nThen, Ruby Rose, another member of the squad, chimed in with: “Yo Khloe I thought you were rad when I met you but this is awful and this is a 19 year old girl. Nobody likes being bullied or made to feel worthless.. Yet so many people will go above and beyond to make others feel that way.”\n\nPlenty more people weighed in – while some of Kim and Taylor’s friends stayed noticeably quiet.\n\nJULY 2016: WHAT HAPPENS IN VEGAS…\n\nAside from the drama with Kimye, Taylor hasn’t had the cleanest breakup from her ex Calvin Harris (considering he recently slammed her on Twitter and all).\n\nThe two worlds collided over the weekend during Jennifer Lopez‘s birthday celebration at her show in Las Vegas. French Montana shared an Instagram photo in which a whole group – Harris included – posed with Lopez and a cake.\n\nhttps://www.instagram.com/p/BIPD1qegmiD/\n\nKim also shared several Snapchats during her night at Hakkasan nightclub in the MGM Grand in Las Vegas, which included dancing along and lip syncing to songs played at the club – and there’s one song in particular she chose to share with her followers.\n\nKim shared a video of herself and friend Carla DiBello dancing and singing along to Kanye’s now-infamous song, “Famous,” specifically at the moment where he says, “I feel like me and Taylor might still have sex.”\n\nJULY 2016: SELENA SPEAKS AGAIN\n\nSelena also had a birthday to celebrate over the weekend (which Taylor, of course, observed on Instagram), but it didn’t seem quite as positive. Just before performing her hit single “Kill ‘Em With Kindness” to end a show, Selena got emotional and said to the crowd, “The next song, before I go home, is a song that’s so important to me, because I get really frustrated. I get stupid sometimes. I say things that I don’t mean, or that come out wrong, just because I care so badly.”\n\nShe continued her message, perhaps alluding to the recent feud Taylor has been dealing with versus Kimye, or the negative reaction from fans when she stepped in to defend her BFF. “But the thing is, at the end of the day, no war in anger was ever won,” she said, quoting her hit song. “I do know that deep down in my heart, that I have to believe that we can love each other and always be kind, no matter what it takes in us. I believe that we can do that, no matter what.”\n\nThings took an even more emotional turn later that night when Selena posted a note on her Instagram reflecting on her performance.\n\n“Tonight I felt extremely unauthentic, unconnected to both myself and my music. I’ve never really felt like my materials, wardrobe or a video could define me. I act on a moment and fear that something hasn’t happened. I’m stagnant, I stay still and don’t just sit with myself first and ask ‘Is this where I am, whole heartedly?’ I’ve always told the truth. I’m always true to my word, I’ve shown who I am but I need to rethink some areas of my life creatively and personally.”\n\nShe captioned the screenshot, “not being negative about anything I’ve done. I’m grateful for every single moment I get here – Indonesia you were LOUD and clearly inspiring. Love you so much.”\n\nAUGUST 2017: SENDING A MESSAGE\n\nAhead of Taylor releasing her first single since Kim leaked a phone call between the “Shake It Off” singer and Kanye on Snapchat, the reality star banned commenters from using the snake emoji on her Instagram. In the edited clips of the call, the pop star appeared to give the rapper her blessing for his “Famous” lyrics. But on Instagram, Taylor asserted that Kanye never told her he was going to call her “that bitch” in the song. “You don’t get to control someone’s emotional response to being called ‘that bitch’ in front of the entire world,” she wrote. “He promised to play the song for me, but he never did.”\n\nStill, haters flooded Taylor’s social media pages with the reptile last summer. But now she’s embracing the snake image and using it to promote her new music.\n\nAUGUST 2017: A NEW IMAGE\n\nAfter spending eight months out of the spotlight, Taylor made her triumphant return, announcing that her new album, Reputation, would be dropping in November. While some fans are saying “Look What You Made Me Do” makes digs at Kanye and Kim, we won’t know for sure until the singer comes forward to confirm those rumors.\n\nDECEMBER 2017: IT STILL ISN’T OVER\n\nKim took to Instagram to share a throwback snapshot of herself at Kanye’s “Famous” exhibit, which shows a nude row of celebs in bed with the rapper — including Taylor. The photo enraged Swifties so much that the superfans flooded the reality star’s account to post rat emojis.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F08%2Fkardashian-swift-1-2000a.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F08%2Fkardashian-swift-1-2000a.jpg", "keywords": [], "authors": ["Laura Cohen"], "canonical_link": "https://people.com/celebrity/a-timeline-of-the-complicated-relationship-between-taylor-swift-and-kim-kardashian-west/", "title": "A Timeline of the Complicated Relationship Between Taylor Swift and Kim Kardashian West", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Kanye West,Kim Kardashian,News,Taylor Swift", "news_keywords": "Kanye West,Kim Kardashian,News,Taylor Swift", "description": "Their feud has reached a new level after Kim released the \"Famous\" phone call footage", "og": {"title": "A Timeline of the Complicated Relationship Between Taylor Swift and Kim Kardashian West", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/celebrity/a-timeline-of-the-complicated-relationship-between-taylor-swift-and-kim-kardashian-west/", "description": "Taylor Swift and Kim Kardashian West aren’t so different – both are massive successes in their respective fields (whether it be singing, reality TV and/or&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F08%2Fkardashian-swift-1-2000a.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/celebrity/a-timeline-of-the-complicated-relationship-between-taylor-swift-and-kim-kardashian-west/", "description": "Their feud has reached a new level after Kim released the \"Famous\" phone call footage", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F08%2Fkardashian-swift-1-2000a.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/celebrity/a-timeline-of-the-complicated-relationship-between-taylor-swift-and-kim-kardashian-west/", "title": "A Timeline of the Complicated Relationship Between Taylor Swift and Kim Kardashian West", "description": "Their feud has reached a new level after Kim released the \"Famous\" phone call footage", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F08%2Fkardashian-swift-1-2000a.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": ["https://www.youtube.com/embed/RvaakT52RjQ", "https://www.youtube.com/embed/dMCAEUb0h34", "https://www.youtube.com/embed/3K0RzZGpyds"], "publish_date": null, "source": "http://people.com", "summary": ""}