{"url": "https://www.cosmopolitan.com/entertainment/celebs/a12254273/kate-walsh-brain-tumor-cancer-diagnosis-recovery-interview/", "text": "Kate Walsh is used to working her ass off. In January 2015, she had just wrapped up a starring role on NBC's Bad Judge, a legal comedy which she also executive produced, and felt exhausted. \"I had been working insane hours, maybe 80 hours a week, and also working out really hard, so I wasn't surprised.\" The exhaustion, though intense and difficult to shake even with multiple cups of coffee, didn't seem out of the ordinary. \"I figured, okay, I'll change up my workout routine, I'll go back to mellow stuff like hiking.\"\n\nBut over the weeks, she didn't feel better. Her pilates instructor noticed that her right side was dipping. While driving, she found herself inadvertently drifting into the right-hand lane. She was struggling to finish her sentences. And in June of that year, she was diagnosed with a brain tumor — a meningioma the size of a lemon, which upon surgery was found to be benign.\n\nJust over two years on from her surgery to remove the tumor, Walsh is fully recovered and working as hard as ever — but as you might expect, the experience radically changed her outlook. She's now partnering with Cigna as part of their TV Doctors campaign — alongside the likes of Patrick Dempsey, Neil Patrick Harris and Donald Faison — to encourage more people to get their annual check-ups and advocate for their own health.\n\nCosmopolitan.com spoke exclusively to Walsh about her diagnosis, her surgery, and recovery process, and how this experience has overhauled her approach to the doctor's office.\n\nOn the gradual progression of her symptoms:\n\n\"My pilates instructor said 'hey, your right side is dipping,' and it didn’t feel like I was off, but I looked down and could see it. Then when I was driving, I started swerving into the right lane. The exhaustion got to the point where I could drink five cups of coffee and still not feel awake or clear. And then around April, I started having more cognitive difficulties. It felt like aphasia, but it wasn’t just not being able to find words; I would lose my train of thought, I wasn’t able to finish sentences, and that was when I got really alarmed.\"\n\n\"I thought maybe it was menopausal symptoms, because there are a lot of the same markers, but I really pushed to see a neurologist, I just had an instinct. I had to really advocate, because they don’t hand out MRIs so easily, but I got an MRI and thank God I did, because it turned out I had a very sizable brain tumor in my left frontal lobe. And three days later I was in surgery having it removed.\"\n\nOn the moment she was told her diagnosis:\n\n\"The words \"brain tumor\" were never in my zeitgeist. I went in for the MRI, and you know it’s serious when they don’t even wait, they’re like 'hey, the radiologist wants to see you.' And she starts to say, 'Well, it looks like you have a very sizable brain tumor' — and I just left my body. My assistant had driven me there, and I had to go get him so that he could take notes, because I was gone. It was never anything I would have imagined.\"\n\n\"They suspected that it was benign, but they wouldn’t know for sure until they got in there. It was over 5cm, like a small lemon in my head, causing quite a bit of damage: there was a lot of swelling, and I had started getting shooting pains in my head. I shattered my pinkie the night before my MRI, because I had no depth perception. It was crazy. The whole situation was so overwhelming, and I was just so relieved to know there was something wrong, that it wasn’t just my imagination and that my instincts were correct.\"\n\nOn her surgery:\n\n\"As much as it was scary, I was sort of in robot mode once I found out. I was relieved that I could get in with a great doctor and one of the most amazing surgeons in the world, and have them take care of it. I had the MRI and three days later I was in surgery, and it was benign and they were able to get all of it. After that, I just really focused on recovery, and surrendering to that process. I love to work hard and do 800 things at once, and this was a really amazing lesson in just submitting to the process of healing. I did exactly what the doctors told me to do, and asked tons of questions when I had them, and got lots of support, and just took my time.\"\n\nOn going back to work:\n\n\"I took about nine months off, and when I came back, I hit it hard. I shot a film called Felt that’s just going to Toronto now, I shot Girls Trip, I shot 13 Reasons Why, I did a play in New York last year. Those cliche, existential things do happen when you have a brain tumor, like, 'How do I really want to spend my time?' I want to be with my friends and family and work on projects that are hugely important to me, and fun, and that make a cultural contribution. But my health comes first, and I’ve had to change my lifestyle. In my business, it’s not unusual to be working 17 hour days, so it can be really challenging, but now I know I absolutely need 7 or 8 hours of sleep. As basic as that sounds, it was a huge part of my recovery.\"\n\nOn how her TV doctor experience informed her real-life attitude to healthcare:\n\n\"It was the total opposite! You’d think that after playing Dr. Addison for the better part of a decade, where I spent more time on a hospital set than at my house, that I would feel somehow more comfortable, but I was such a little scaredy-cat. In the hospital, I felt like I might as well be six years old. My mother gave me rosary beads, my friend gave me a stuffed animal to go into surgery with… I played a real badass on TV, but when it comes to being a patient it's such a vulnerable experience.\"\n\nABC\n\n\"There’s this idea that doctors are gods, and you can’t approach them, like they have superpowers. You’re like 'oh, I hate to ask you…' whether it’s about billing or test results or whatever. You just have to keep talking, keep asking questions. I think of myself as a very strong, proactive person, but still there’s this anxiety that comes up, and the idea that healthcare is an ivory tower, and you don’t want to bother the geniuses. But everybody’s health is their own experience, and you have to keep a dialogue going. If I’m nervous about an appointment now, I bring a friend with me. You don’t have to go it alone.\"\n\nOn the biggest thing she learned:\n\n\"Go see a doctor! We’re all so socialized to try to self-diagnose, like 'I’ll change my workout, I'll change my diet.' I'm very proactive and willful and independent, and in the past, even though I played a doctor on TV for years, I was not one to go see doctors very often, other than for my annual OB-GYN appointment. So for me, it was a really big wakeup call to do annual check-ups, and that’s why I wanted to pair up with Cigna for this campaign. I love the idea of changing the framing around healthcare, and changing it from a reactionary thing — 'Oh my god, I’m sick, I have to go to the doctor' — to something more along the lines of preventive care. We should go get a checkup the same way we go to the gym, just preventively, instead of waiting for something to go wrong.\"\n\nOn why she decided to speak out:\n\n\"This was a very private experience for me. I really didn’t want to talk about it, I wanted it to be mine, but I knew that someday I would want to share it. One of the most interesting things for me about this diagnosis was that this tumor is twice as common in women as men. It can be especially hard for women to take time out for their health — you’re mothers, you’re career women, you’re spinning all of these plates, and it’s hard sometimes to hand over the superwoman cape and ask for help. When the Cigna campaign came along, I thought it was a perfect marriage. I loved the humor of the storytelling, poking fun at TV doctors, and it was a way for me to talk about my own personal experience and be of service to others.\"\n\nFollow Emma on Twitter and Cosmo Celeb on Facebook.\n\n", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2017-09-15-at-3-34-09-pm-1505504071.png?crop=1.00xw:0.367xh;0,0.164xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2017-09-15-at-3-34-09-pm-1505504071.png?crop=1.00xw:0.367xh;0,0.164xh&resize=1200:*", "keywords": [], "authors": ["Emma Dibdin", "Emma Dibdin Writes About Television", "Movies", "Podcasts", "With Coverage Including Opinion Essays", "News Posts", "Episodic Reviews", "In-Depth Interviews With Creatives."], "canonical_link": "https://www.cosmopolitan.com/entertainment/celebs/a12254273/kate-walsh-brain-tumor-cancer-diagnosis-recovery-interview/", "title": "Kate Walsh Reveals She Was Diagnosed With A Brain Tumor Two Years Ago", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "Kate Walsh Reveals She Was Diagnosed With A Brain Tumor Two Years Ago", "description": "The Grey's Anatomy actress had the benign meningioma removed in 2015, and speaks exclusively here about her diagnosis, her recovery, and what she's learned.", "url": "https://www.cosmopolitan.com/entertainment/celebs/a12254273/kate-walsh-brain-tumor-cancer-diagnosis-recovery-interview/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2017-09-15-at-3-34-09-pm-1505504071.png?crop=1.00xw:0.367xh;0,0.164xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2017-10-11 02:34:21", "published_time": "2017-09-18 10:00:00", "section": "Celebs", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2017-09-15-at-3-34-09-pm-1505504071.png?crop=1.00xw:0.367xh;0,0.164xh&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Kate Walsh Reveals Brain Tumor Diagnosis and Discusses Her Recovery", "description": "The Grey's Anatomy star was diagnosed in 2015 with a benign meningioma. Here, she speaks exclusively about her surgery, her recovery, and what she's learned.", "keywords": "kate walsh cancer, kate walsh tumor, grey's anatomy, kate walsh, cigna", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2017-09-15-at-3-34-09-pm-1505504071.png?crop=1.00xw:0.732xh;0,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrities & Entertainment,entertainment,celebs,kate walsh", "sailthru.date": "2017-09-18T10:00:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2017-09-15-at-3-34-09-pm-1505504071.png?crop=1.00xw:0.367xh;0,0.164xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2017-09-15-at-3-34-09-pm-1505504071.png?crop=1.00xw:0.732xh;0,0", "sailthru.socialtitle": "Kate Walsh Reveals She Was Diagnosed With A Brain Tumor Two Years Ago", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1505700000.0, "source": "https://www.cosmopolitan.com", "summary": ""}