{"url": "https://people.com/parents/jason-biggs-jenny-mollen-welcome-son-lazlo/", "text": "Image zoom Jenny Mollen/Instagram\n\nJason Biggs and Jenny Mollen are seeing blue — again!\n\nThe fun-loving family of three just became a family of four with the arrival of the couple’s second son, a rep confirms to PEOPLE, saying, “Mom, dad and big brother Sid are doing great!”\n\nGet push notifications with news, features and more.\n\nBorn on Monday, Oct. 2, at Lenox Hill Hospital in N.Y.C., Lazlo Biggs weighed 7 lbs., 1 oz., and measured 20 inches long upon his much-anticipated arrival.\n\n“Hello everybody. I’m just sitting in the back of the car with Jason and my second child,” Mollen, 38, said in the first of a series of clips shared on Instagram Stories Thursday, showing herself and Biggs in a car with their newborn son.\n\nAddressing her husband after panning the camera to their new little guy, situated between his parents in his car seat, Mollen says, “Baby, you have two boys now.”\n\n“I know, WTF,” Biggs, 39, replies. (The couple also share 3½-year-old Sid.)\n\nWant all the latest pregnancy and birth announcements, plus celebrity mom blogs? Click here to get those and more in the PEOPLE Babies newsletter.\n\nImage zoom Instagram\n\nRELATED: Jenny Mollen Goes Nude for 39-Week Bump Pic, Plus More of Her Second Pregnancy Selfies\n\n“I had to break out of the hospital, they wanted to keep me, but I’m leaving — I’m leaving with wires attached,” Mollen adds. Biggs replies jokingly, “Was I supposed to sign [discharge] papers or pay or anything?”\n\n“I’m gonna go home and eat my placenta,” says Mollen, with Biggs adding, “I’m excited to try it.”\n\nShortly after, Mollen posted a video to Instagram of herself in a hospital bed, gazing at a golden pineapple-shaped ur on a chair. “Obviously had to bring Teets for moral support…. #babybiggs,” she wrote, referring to her beloved dog who died in March 2016.\n\nRELATED VIDEO: Baby No. 2 on the Way for Jason Biggs and Jenny Mollen – See Their Hilarious Announcement\n\nMollen and Biggs leveraged their signature silly sides to share their pregnancy news with the world in April, sharing a photo to Instagram showing the actress and author using a NoseFrida snot sucker on her husband.\n\nSince announcing Baby No. 2 on the way, the couple revealed they were having a second son, with Mollen being hilariously open about the realities of parenting while pregnant — and dealing with placenta previa.\n\n“It actually hasn’t been a big deal so far because I’m so early,” Mollen told PEOPLE in June. “I had a c-section the first time because I never dilated, so I’m not that concerned because I expected to have to be cut open again.”\n\nAt the time, Biggs explained that Sid wasn’t quite sure what was in store for him with a new sibling on the way. “While it’s still safely tucked away and he doesn’t have to actually physically deal with someone else in his space, he loves it,” the Orange Is the New Black star told PEOPLE.\n\nRELATED: Jenny Mollen on Supportive Husband Jason Biggs: “He’s My Wife, Even When I’m Not Pregnant”\n\nPlacenta previa and juggling a toddler and impending second-time motherhood aren’t the only challenges Mollen faced throughout her pregnancy. In early September, the Angel alum shared her experience with what she described as “prepartum” depression in an Instagram post and Story.\n\n“I could already be in a depression,” she revealed. “I’m planning on eating my placenta, but I’m also anticipating a major emotional dive. I think that it’s chemical. I think people don’t talk about it enough.”\n\nThe following day, Mollen clarified that she was “totally fine” after receiving an influx of concerned emails. “This is normal — that’s what I’m trying to say,” she explained. “That it’s not weird … I would be more freaked out if I weren’t freaking out.”\n\nFROM PEN: Former Bachelorette Ashley Hebert Rosenbaum Opens Up About Her Sibling Rivalry Fears\n\n\n\nRELATED GALLERY: The Jenny Mollen and Jason Biggs Hilariously Honest Guide to Parenting\n\nOver the past six months, Mollen has been extremely open about her changing body, posting a variety of nude mirror selfies and joking, “Can I keep the boobs?” in the caption of one recent before-and-after shot.\n\n“It’s official! I’ve outgrown the mirror,” wrote the Live Fast Die Hot author on another naked snap, taken in a bathroom at 38 weeks pregnant.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fjenny-mollen1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fjenny-mollen1.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2078'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F12%2Fjenny-mollen-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fjenny-mollen1.jpg", "keywords": [], "authors": ["Jen Juneau"], "canonical_link": "https://people.com/parents/jason-biggs-jenny-mollen-welcome-son-lazlo/", "title": "Jason Biggs and Jenny Mollen Welcome Son Lazlo", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Babies,Births,Jason Biggs,Jenny Mollen,News,TV", "news_keywords": "Babies,Births,Jason Biggs,Jenny Mollen,News,TV", "description": "It's a second boy for spouses of nine years Jason Biggs and Jenny Mollen, who announced their second child on the way in April", "og": {"title": "He's Here! Jason Biggs and Jenny Mollen Welcome Son Lazlo - See His First Photos", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/parents/jason-biggs-jenny-mollen-welcome-son-lazlo/", "description": "Jason Biggs and Jenny Mollen are seeing blue — again! The fun-loving family of three just became a family of four with the arrival of&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fjenny-mollen1.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/parents/jason-biggs-jenny-mollen-welcome-son-lazlo/", "description": "It's a second boy for spouses of nine years Jason Biggs and Jenny Mollen, who announced their second child on the way in April", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fjenny-mollen1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/parents/jason-biggs-jenny-mollen-welcome-son-lazlo/", "title": "He's Here! Jason Biggs and Jenny Mollen Welcome Son Lazlo - See His First Photos", "description": "It's a second boy for spouses of nine years Jason Biggs and Jenny Mollen, who announced their second child on the way in April", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F10%2Fjenny-mollen1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}