{"url": "http://www.nfib-sbet.org/", "text": "SMALL BUSINESS ECONOMIC TRENDS\n\nThe NFIB Small Business Optimism Index fell 8.1 points in March to 96.4, the largest monthly decline in the survey’s history. Nine of the 10 Index components declined, which is evidence that economic disruptions are escalating on Main Street as small businesses struggle to keep their doors open. The small business sector is anticipating and bracing for continued economic disruptions going forward.\n\n“Small businesses are living through the coronavirus pandemic right now and it’s hard to say what the severity of the disruption will be, but we do know they’re feeling the urgency,” said NFIB Chief Economist William Dunkelberg. “It is vital that these businesses have access to federal funds that are made available through the CARES Act to keep the doors open on Main Street.”\n\nThe financial markets saw substantial change in March, with the stock market indices losing 22% of their value and jobless claims rising to a record 10 million in the last two weeks of the month. The NFIB survey collected the majority of responses in the first half of the month, so the sharp decline in employment is not reflected in the March survey data.\n\nThe main takeaways from the March survey include:\n\nThe NFIB Uncertainty Index rose 12 points in March to 92, the highest level since March 2017. Reports of better business conditions in the next six months declined 17 points to a net 5%, which is the largest monthly decline since November 2012. Real sales expectations in the next six months declined 31 points to a net negative 12%, the largest monthly decline in the survey’s history. Thirteen percent of firms thought it was a good time to expand, a decline of 13 points from last month. Job openings fell three points to 35%.\n\nAs reported in NFIB’s monthly jobs report, prior to the COVID-19 outbreak, the small business labor market reported strong hiring, elevated levels of open positions, and historically high employee compensation. However, hiring plans experienced a significant drop from February yet finding qualified workers remains the top issue for 24% of small employers who reported this as their No. 1 problem.\n\nDown two points from February, 60% of owners reported capital outlays. Of those making expenditures, 43% reported spending on new equipment, 26% acquired vehicles, 16% improved or expanded facilities, 6% acquired new buildings or land for expansion, and 12% spend money for new fixtures and furniture. Twenty-one percent of owners are planning capital outlays in the next few months, a sign that small business owners are scaling back spending as economic conditions started to disrupt the nation.\n\nSales held strong in March, with a seasonally adjusted net 8% of all owners reporting higher nominal sales in the past three months. As actual sales volumes remained strong, expectations of the future of sales growth deteriorated significantly. It is clear owners felt the pending economic shift as state officials began to shut down non-essential businesses and issue stay-at-home orders in response to coronavirus.\n\nA net negative three percent of owners are planning to expand inventory holdings. Small business owners are bracing themselves for a significant reduction in consumer spending and future orders.\n\nThe frequency of reports of positive profit trends fell two points to a net negative 6% reporting quarter-on-quarter profits. Among the owners reporting weaker profits, 32% blamed weaker sales, 26% blamed usual seasonal change, 9% cited price changes, 7% cited labor costs, and 7% cited material costs. For those reporting higher profits, 53% credited sales volumes and 22% credited usual seasonal change.\n\nNFIB released surveys in March on how COVID-19 is impacting small businesses. The latest survey showed 92% of small employers are negatively impacted by the outbreak and about half of small employers said they can survive for no more than two months under the current business conditions.", "images": ["http://www.nfib-sbet.org/wp-content/themes/nfib/img/spinner-page.gif", "http://www.nfib-sbet.org/wp-content/themes/nfib/img/homespinner.gif"], "top_img": "http://www.nfib-sbet.org/wp-content/themes/nfib/img/spinner-page.gif", "keywords": [], "authors": [], "canonical_link": "", "title": "NFIB", "meta_data": {"viewport": "width=1024"}, "movies": [], "publish_date": null, "source": "http://www.nfib-sbet.org", "summary": ""}