{"url": "https://en.wikipedia.org/wiki/Spice_Girls", "text": "British girl group\n\nThe Spice Girls are an English pop girl group formed in 1994. The group comprises Melanie Brown, also known as Mel B (\"Scary Spice\"), Melanie Chisholm, also known as Mel C (\"Sporty Spice\"), Emma Bunton (\"Baby Spice\"), Geri Halliwell (\"Ginger Spice\"), and Victoria Beckham (\"Posh Spice\"). They were signed to Virgin Records and released their debut single \"Wannabe\" in 1996; it hit number one in 37 countries[1][2] and commenced their global success. Their debut album Spice sold more than 31 million copies worldwide, becoming the best-selling album by a female group in history.[3][4] Their follow-up album, Spiceworld sold over 20 million copies worldwide.[5] The Spice Girls have sold 85 million records worldwide,[6][7][8] making them the best-selling girl group of all time, one of the best-selling pop groups of all time,[7][9] and the biggest British pop success since The Beatles.[10][11][12] Among the highest profile acts in 1990s popular culture, Time called them \"arguably the most recognizable face\" of Cool Britannia, the mid-1990s celebration of youth culture in the UK.[13]\n\nMeasures of their success include international record sales, a 2007–2008 reunion tour, a 2019 reunion tour, vast merchandising enterprises, iconic symbolism such as Halliwell's Union Jack dress representing \"girl power\", and a film, Spice World. The group became one of the most successful marketing engines ever,[14] earning up to $75 million per year,[15] with their global gross income estimated at $500–800 million by May 1998.[14] Under the guidance of their mentor and manager Simon Fuller, the Spice Girls embraced merchandising and became a regular feature of the British and global press. In 1996, Top of the Pops magazine gave each member of the group aliases, which were adopted by the group and media. According to Rolling Stone journalist and biographer David Sinclair, \"Scary, Baby, Ginger, Posh, and Sporty were the most widely recognised group of individuals since John, Paul, George, and Ringo\".[16] With the \"girl power\" label, the Spice Girls were popular cultural icons of the 1990s.[17][18] They are cited as part of the 'second wave' 1990s British Invasion of the US.[19]\n\nBand history [ edit ]\n\n1994–1996: Formation and early years [ edit ]\n\n[20] \"WANTED: R.U. 18–23 with the ability to sing/dance? R.U. streetwise, outgoing, ambitious, and dedicated? Heart Management Ltd. are a widely successful music industry management consortium currently forming a choreographed, singing/dancing, all-female pop act for a recording deal. Open audition. Danceworks, 16 Balderton Street. Friday 4th March. 11.00am - 5.30pm. Please bring sheet music or backing cassette\" – Advertisement placed in The Stage\n\nIn the mid-1990s, relatives Bob and Chris Herbert of Heart Management decided to create a girl group to compete with popular boy bands, such as Take That and East 17, which dominated the pop music scene at the time.[21] In February 1994, together with financier Chic Murphy, they placed an advertisement in the trade magazine The Stage asking for singers to audition for an all-female pop band at Danceworks studios.[21] Approximately 400 women attended the audition, during which they were placed in groups of 10 and danced a routine to \"Stay\" by Eternal, followed by solo auditions in which they were asked to perform songs of their own choosing. After several weeks of deliberation, Victoria Adams, Melanie Brown, Melanie Chisholm, and Michelle Stephenson were among 12 women chosen to a second round of auditions in April; Geri Halliwell also attended the second audition, despite missing the first.[21]\n\nA week after the second audition, the women were asked to attend a recall at Nomis Studios in Shepherds Bush, performing \"Signed, Sealed, Delivered\" on their own and in a group. During the session, Adams, Brown, Chisholm, Halliwell and Stephenson were selected for a band initially named \"Touch\".[21] The group moved to a house in Maidenhead, Berkshire, and spent most of 1994 practising songs which had been written for them by Bob Herbert's long-time associates John Thirkell and Erwin Keiles.[22] During the first two months, they worked on demos at South Hill Park Recording Studios in Bracknell with producer/studio owner Michael Sparkes and songwriter/arranger Tim Hawes. According to Stephenson, the material the group was given was \"very, very young pop\";[23] one of the songs they recorded, \"Sugar and Spice\", would be the source of their final band name. They also worked on various dance routines at the Trinity Studios in Knaphill, near Woking, Surrey. A few months into the training period, Stephenson was fired from the group and replaced with Emma Bunton.[24] It was also during this time that Halliwell came up with the band name Spice.[21]\n\nThe group felt insecure about the lack of a contract and was frustrated by the direction in which Heart Management was steering them. In October 1994, armed with a catalogue of demos and dance routines, they began touring management agencies. They persuaded Bob Herbert to set up a showcase performance for the group in front of industry writers, producers, and A&R men in December 1994 at the Nomis Studios, where they received an \"overwhelmingly positive\" reaction.[25] Due to the large interest in the group, the Herberts quickly set about creating a binding contract for them. Encouraged by the reaction they had received at the Nomis showcase, all five members delayed signing contracts on legal advice from, among others, Adams's father.[26]\n\nIn March 1995, the group parted from Heart Management due to their frustration with the company's unwillingness to listen to their visions and ideas. To ensure they kept control of their own work, they allegedly stole the master recordings of their discography from the management offices.[26][27] That same day, the group tracked down Sheffield-based producer Eliot Kennedy, who had been present at the showcase, and persuaded him to work with them. They were introduced to record producers Absolute, who in turn brought them to the attention of Simon Fuller of 19 Entertainment, who signed them to his company in March 1995. During the summer of that year, the group toured record labels in London and Los Angeles with Fuller, signing a deal with Virgin Records in September 1995. Their name was changed to Spice Girls, as a rapper was already using the name \"Spice\".[21] From this point on until the summer of 1996, the group continued to write and record tracks for their debut album while extensively touring the west coast of the US, where they signed a publishing deal with Windswept Pacific.[26]\n\n1996–1997: Spice and breakthrough [ edit ]\n\nOn 7 July 1996, the Spice Girls released their debut single \"Wannabe\" in the United Kingdom. In the weeks leading up to the release, the music video for \"Wannabe\" (directed by Swedish commercials director Johan Camitz and shot in April at the entrance and main staircase of the St. Pancras Grand Hotel in London), got a trial airing on music channel The Box.[28] The video was an instant hit, and was aired up to seventy times a week at its peak. After the video was released, the Spice Girls had their first live TV slot on broadcast on LWT's Surprise Surprise. The first music press interview appeared in Music Week. In July 1996, the group conducted their first interview with Paul Gorman, the contributing editor of music paper Music Week, at Virgin Records' Paris headquarters. His piece recognised that the Spice Girls were about to institute a change in the charts away from Britpop and towards out-and-out pop. He wrote: \"JUST WHEN BOYS with guitars threaten to rule pop life – Damon's all over Smash Hits, Ash are big in Big! and Liam can't move for tabloid frenzy – an all-girl, in-yer-face pop group have arrived with enough sass to burst that rockist bubble.\"[29] The song entered the UK Singles Chart at number three before moving up to number one the following week and staying there for seven weeks. The song proved to be a global hit, hitting number one in 37 countries, including four weeks atop the Billboard Hot 100 in the US, and becoming not only the biggest selling debut single by an all-female group but also the biggest-selling single by an all-female group of all time.[1][30][31]\n\nRiding a wave of publicity and hype, the group released their next singles in the UK and Europe; in October \"Say You'll Be There\" was released topping the charts at number one for two weeks. In December \"2 Become 1\" was released, becoming their first Christmas number-one and selling 462,000 copies in its first week,[32] making it the fastest selling single of the year. The two tracks continued the group's remarkable sales, giving them three of the top five biggest selling songs of 1996 in the UK.[33] In November 1996, the Spice Girls released their debut album Spice in Europe. The success was unprecedented and drew comparisons to Beatlemania,[12] leading the press to dub it \"Spice mania\"[34][35][36][37] and the group the \"Fab Five\".[38][39][40][41] In seven weeks Spice had sold 1.8 million copies in Britain alone,[42] making the Spice Girls the fastest selling British act since the Beatles. In total, the album sold over 3 million copies in Britain,[42] the biggest-selling album of all time in the UK by a female group,[43] certified 10× Platinum,[42] and peaked at number one for fifteen non-consecutive weeks.[44] In Europe the album became the biggest-selling album of 1997 and was certified 8× Platinum by the IFPI for sales in excess of 8 million copies.[45]\n\n\"Wannabe\" Spice Girls debut single \"Wannabe\" is one of the best selling singles of all time, topping the charts in 37 countries and selling over 6 million copies Worldwide. Problems playing this file? See media help.\n\nThat same month the Spice Girls attracted a crowd of 500,000 when they switched on the Christmas lights in Oxford Street, London.[21] At the same time, Simon Fuller started to set up million pound sponsorship deals for the Spice Girls with Pepsi, Walkers, Impulse, Cadbury's and Polaroid.[21] In December 1996, the group won three trophies at the Smash Hits awards at the London Arena, including best video for \"Say You'll Be There\".[21] In January 1997, the group released \"Wannabe\" in the United States.[46] The single, written by the Spice Girls, Richard Stannard, and Matt Rowe also proved to be a catalyst in helping the Spice Girls break into the notoriously difficult US market when it debuted on the Hot 100 Chart at number eleven. At the time, this was the highest-ever debut by a non-American act, beating the previous record held by the Beatles for \"I Want to Hold Your Hand\" and the joint highest entry for a debut act beating Alanis Morissette with \"Ironic\".[21] \"Wannabe\" reached number one in the US for four weeks. In February 1997, Spice was released in the US, and became the biggest-selling album of 1997 in the US, peaking at number one, and was certified 7× Platinum by the RIAA[47] for sales in excess of 7.4 million copies.[48] The album is also included in the Top 100 Albums of All Time list of the Recording Industry Association of America (RIAA) based on US sales.[49] In total, the album sold over 28 million copies worldwide becoming the biggest-selling album in pop music history by an all-female group.[3][50][51]\n\nLater that month, the Spice Girls won two Brit Awards for Best British Video, \"Say You'll Be There\" and Best British Single for \"Wannabe\".[21][50] The group performed \"Who Do You Think You Are\" to open the 1997 Brit Awards, with Geri Halliwell wearing a Union Jack mini-dress that became one of pop history's most famed outfits.[20][53] In March 1997, a double A-side of \"Mama\"/\"Who Do You Think You Are\" was released in Europe, the last from Spice, which once again saw them at number one,[54] making the Spice Girls the first group in history since the Jackson 5 to have four consecutive number one hits.[21] Girl Power!, The Spice Girls' first book and manifesto was launched later that month at the Virgin Megastore. It sold out its initial print run of 200,000 copies within a day, and was eventually translated into more than 20 languages. In April, One Hour of Girl Power was released; it sold 500,000 copies in the UK between April and June to become the best-selling pop video ever.[55][56] In May, Spice World was announced by the Spice Girls at the Cannes Film Festival. The group also performed their first live British show, for the Royalty of Great Britain. At the show, they breached royal protocol when Mel B and then Geri Halliwell planted kisses on Prince Charles' cheeks and pinched his bottom, causing controversy.[21] At the Ivor Novello Awards, the group won International Hit of the Year and Best-Selling British Single awards for \"Wannabe\". In June 1997, Spice World began filming and wrapped in August. In September, the Spice Girls performed \"Say You'll Be There\" at the 1997 MTV Video Music Awards at Radio City Music Hall in New York City, and won Best Dance Video for \"Wannabe\".[57] The MTV Awards came five days after the death of Princess Diana, with tributes paid to her throughout the ceremony. Mel C stated, “We'd like to dedicate this award to Princess Diana, who is a great loss to our country.\"[58] At the 1997 Billboard Music Awards the group won four awards; New Artist of the Year, Billboard Hot 100 Singles Group of the Year, Billboard 200 Group of the Year, and Billboard 200 Album of the Year for Spice.[59]\n\n1997–1998: Groundbreaking success, Spiceworld and Halliwell's departure [ edit ]\n\nIn October 1997, the Spice Girls released the first single from Spiceworld, \"Spice Up Your Life\". It entered the UK Singles Chart at number one on 19 October 1997, making it the group's fifth consecutive number-one single. That same month, Simon Fuller took the Spice Girls east to perform their first live major concert to 40,000 fans in Istanbul, Turkey. Later, the group launched The Royal British Legion's Poppy Appeal,[60] then travelled to South Africa to meet Nelson Mandela, who announced, \"These are my heroes.\"[61] This was the year when the Spice Girls reached the height of their career. In November, the Spice Girls released their second album, Spiceworld. The album was a global best seller. It set a new record for the fastest-selling album when it shipped seven million copies over the course of two weeks. Gaining favourable reviews,[51] the album went on to sell over 10 million copies in Europe,[62] Canada,[63] and the United States[47] combined, and 20 million copies worldwide.[5] Criticised in the United-States for releasing the album just nine months after their debut there, which gave the group two simultaneous Top 10 albums in the Billboard album charts,[64] and suffering from over-exposure at home,[60] the Spice Girls began to experience a media backlash. The group was criticised for the number of sponsorship deals signed[65]—over twenty in total—and they began to witness diminishing international chart positions. Nevertheless, the Spice Girls remained the biggest-selling pop group of both 1997 and 1998.[26]\n\nOn 7 November 1997, the group performed \"Spice Up Your Life\" in the 1997 MTV Europe Music Awards.[66] After this performance, the Spice Girls made the decision to take over the running of the group themselves, and fired their manager Simon Fuller.[1] The firing was front-page news around the world. Many commentators speculated that Fuller had been the true mastermind behind the group, and that this was the moment when the band lost their impetus and direction.[67] Later that month, the Spice Girls became the first pop group to host ITV's An Audience with...;[68] their show was watched by 11.8 million viewers in the UK, one fifth of the population.[69] In December 1997, the second single from Spiceworld, \"Too Much\", was released, becoming the group's second Christmas number-one and their sixth consecutive number-one single in the UK. The group ended 1997 as the year's most played artist on American radio.[70] At the 1998 American Music Awards on 26 January, the Spice Girls won the awards for Favorite Pop Album, Favorite New Artist, and Favorite Pop Group.[71] In February 1998, they won a special award for overseas success at the 1998 Brit Awards, with combined sales of albums and singles for over of 45 million records worldwide.[72][73] That night, the group performed their next single, \"Stop\", their first track not to reach number one in Britain (it entered at number two).\n\n\"Spice Up Your Life\" \"Spice Up Your Life\" became the group's fifth consecutive chart-topper, which made them the first act to have its first five singles reach number one in the UK. Problems playing this file? See media help.\n\nIn early 1998, the Spice Girls embarked on the Spiceworld world tour covering Europe and North America, starting in Dublin, Ireland on 24 February 1998 before moving to mainland Europe, and then returning to Britain for two gigs at Wembley Arena.[74] Later that year, the Spice Girls were invited to sing on the official England World Cup song \"How Does It Feel (To Be on Top of the World)\", the last song recorded with Halliwell until 2007. On 31 May 1998, Halliwell announced her departure from the Spice Girls through her solicitor.[75] Halliwell claimed that she was suffering from exhaustion and wanted to take a break. Rumours of a power struggle with Brown as the reason for her departure were circulated by the press.[15][76] Halliwell's departure from the group shocked fans and became one of the biggest entertainment news stories of the year, making news headlines the world over.[77] The four remaining members were adamant that the group would carry on.[75]\n\nHalliwell's departure was the subject of a lawsuit by Aprilia World Service B.V. (AWS), a manufacturer of motorcycles and scooters. On 9 March 1998, Halliwell informed the other members of the group of her intention to withdraw from the group, yet the girls signed an agreement with AWS on 24 March and again on 30 April and participated in a commercial photo shoot on 4 May in Milan, eventually concluding a contract with AWS on 6 May 1998. The Court of Appeal of England and Wales held that their conduct constituted a misrepresentation by giving the impression that Halliwell intended to remain part of the group in the foreseeable future, allowing AWS to rescind their contract with the Spice Girls. This is now the leading case in English law on misrepresentation by conduct.[78][79]\n\n\"Viva Forever\" was the last single released from Spiceworld. The video for the single was made before Halliwell's departure and features the girls in stop-motion animated form. The North American tour began in West Palm Beach on 15 June, and grossed $60 million over 40 sold-out performances.[15]\n\n1998–2000: Forever and hiatus [ edit ]\n\nThe Spice Girls as a four-piece performing \"Holler\" in Cologne , Germany at the Return of the Spice Girls tour.\n\nWhile on tour in the United-States, the group continued to record new material and released a new song, \"Goodbye\", before Christmas in 1998. The song was seen as a tribute to Geri Halliwell, and when it topped the UK Singles Chart it became their third consecutive Christmas number-one – equalling the record previously set by the Beatles.[80] Later in 1998, Bunton and Chisholm appeared at the 1998 MTV Europe Music Awards without their other band members, and the group won two awards: \"Best Pop Act\" and \"Best Group\" for a second time.[81] In late 1998, Brown and Adams announced they were both pregnant; Brown was married to dancer Jimmy Gulzer and became known as Mel G for a brief period. She gave birth to daughter Phoenix Chi in February 1999.[82] One month later, Adams gave birth to son Brooklyn, whose father was then Manchester United footballer David Beckham. Later that year, she married Beckham in a highly publicised wedding in Ireland.[83]\n\nThe Spice Girls returned to the studio in August 1999, after an eight-month recording break to start work on their third and last studio album. The album's sound was initially more pop-influenced, similar to their first two albums, and included production from Eliot Kennedy.[84] The album's sound took a mature direction when American producers like Rodney Jerkins, Jimmy Jam and Terry Lewis came on to collaborate with the group. In December 1999 they performed live for a UK-only tour, Christmas in Spiceworld, in London and Manchester, also showcasing new songs from the third album.[85] During 1999, the group recorded the character Amneris' song \"My Strongest Suit\" in Elton John's and Tim Rice's Aida, a concept album which would later go on to fuel the musical version of Verdi's Aida. The band performed again at the 2000 Brit Awards, where they received a Lifetime Achievement Award. Despite being at the event, Halliwell did not join her former bandmates on stage.[86] In November 2000, the group released Forever. Sporting a new edgier R&B sound, the album received a lukewarm response from critics.[87]\n\nIn the US, the album peaked at number thirty-nine on the Billboard 200 albums chart. In the UK, the album was released the same week as Westlife's Coast to Coast album and the chart battle was widely reported by the media, where Westlife won the battle reaching number one in the UK, leaving the Spice Girls at number two.[88] The lead single from Forever, the double A-side \"Holler\"/\"Let Love Lead the Way\", became the group's ninth number one single in the UK.[89] However the song failed to break onto the Billboard Hot 100 singles chart stateside, instead peaking at number seven on the Bubbling Under Hot 100 Singles. \"Holler\" did peak at number thirty-one on the Hot Dance Music/Club Play chart in 2000. The only major performance of the lead single came at the MTV Europe Music Awards on 16 November 2000.[90] In total, Forever achieved only a fraction of the success of its two best-selling predecessors, selling five million copies.[91] In January 2001, the group unofficially announced that they were beginning an indefinite hiatus and would be concentrating on their solo careers in regards to their foreseeable future, although they pointed out that the group was not splitting.[92][93]\n\n2007–2008: Return of the Spice Girls and Greatest Hits [ edit ]\n\nOn 28 June 2007, the group held a press conference at The O2 Arena revealing their intention to reunite.[94] The plan to re-form had long been speculated by the media,[95] but the group finally confirmed their intention to embark upon a worldwide concert tour, starting in Vancouver on 2 December 2007.[96] Filmmaker Bob Smeaton directed an official documentary on the reunion. It was entitled Spice Girls: Giving You Everything and was first aired on Australia's Fox8 on 16 December 2007,[97] followed by BBC One in the UK, on 31 December.[98] Ticket sales for the first London date of the Return of the Spice Girls tour sold out in 38 seconds.[99] It was reported that over one million people signed up in the UK alone and over five million worldwide for the ticket ballot on the band's official website.[99] Sixteen additional dates in London were added,[100] all selling out within one minute.[101] In the United States, Las Vegas, Los Angeles and San Jose shows also sold out, prompting additional dates to be added.[102] It was announced that the Spice Girls would be playing dates in Chicago and Detroit and Boston, as well as additional dates in New York to keep up with the demand. On the first concert in Canada, they performed to an audience of 15,000 people, singing twenty songs and changing a total of eight times.[103] Along with the tour sellout, the Spice Girls licensed their name and image to Tesco's UK supermarket chain.[104]\n\nThe group's comeback single, \"Headlines (Friendship Never Ends)\", was announced as the official Children in Need charity single for 2007 and was released 5 November. The first public appearance on stage by the Spice Girls occurred at the Victoria's Secret Fashion Show, where they performed two songs, 1998 single \"Stop\" and the lead single from their greatest hits album, \"Headlines (Friendship Never Ends)\". The show was filmed by CBS on 15 November 2007 for broadcast on 4 December 2007.[105] They also performed both songs live for the BBC Children in Need telethon on 16 November 2007 from Los Angeles. The release of \"Headlines (Friendship Never Ends)\" peaked at number eleven on the UK Singles Chart, making it the group's lowest charting British single to date. The album peaked at number two on the UK Albums Chart. On 1 February 2008, it was announced that due to personal and family commitments their tour would come to an end in Toronto on 26 February 2008, meaning that tour dates in Beijing, Hong Kong, Shanghai, Sydney, Cape Town and Buenos Aires were cancelled.[106] Overall, the tour produced some $107.2 million in ticket sales and merchandising, with sponsorship and ad deals bringing the total to $200 million.[107] In March 2008, the group won the coveted \"Icon Awards\" at the 95.8 Capital Awards; Bunton and Chisholm collected the award. In June, they captured the Glamour Award for the Best Band; Bunton, Brown and Halliwell received the award at the event. In September, the Spice Girls won the \"Best Live Return Award\" at the 2008 Live Vodafone Music Awards, beating acts such as Led Zeppelin and the Sex Pistols. Bunton was there to collect the award.[108]\n\n2010–2012: Viva Forever musical and London Olympics [ edit ]\n\nViva Forever! premiere night, 2012. The Spice Girls at thepremiere night, 2012.\n\nIn 2010, the group was nominated for a Brit Award in the new category, \"Best Performance of the 30th Year\" for their 1997 Brit Awards performance of their songs, \"Wannabe\" and \"Who Do You Think You Are\". The group later won the award which was received by Halliwell and Brown. The group along with Simon Fuller also teamed with Judy Craymer and Jennifer Saunders to develop a Spice Girls musical, Viva Forever!. Although the group were not in the musical, they influenced the show's cast and production choices in a story which uses the music, similar to ABBA's music in Mamma Mia!.[109]\n\nTwo years later, in June 2012, the group reunited for the first time in four years for the press conference in London to promote the launch of Viva Forever!.[110] The press conference was held at St. Pancras Renaissance London Hotel, the location where the group filmed the music video for \"Wannabe\", sixteen years earlier, to the day.[111] In August 2012, after much speculation and anticipation from the press and the public, the group performed a medley of \"Wannabe\" and \"Spice Up Your Life\" at the 2012 Summer Olympics closing ceremony, reuniting solely for the event.[112][113] Their performance received great response from critics and audiences and became the most tweeted moment of the entire Olympics with over 116,000 tweets on Twitter per minute.[114] In December 2012, the group reunited once again for the premiere of Viva Forever! at the West End's Piccadilly Theatre.[115] In addition to the promotion of the musical, the group appeared in the documentary, Spice Girls' Story: Viva Forever! which aired on 24 December 2012 on ITV1.[116]\n\n2016–present: Second reunion [ edit ]\n\nOn 8 July 2016, Brown, Bunton, and Halliwell released a video celebrating the 20th anniversary of their first single \"Wannabe\", alongside a website under the name \"The Spice Girls - GEM\" and teased news from them as a three-piece.[117] Brown later clarified that \"GEM\" was not a new name for the three-piece but rather simply the name of the website.[118] Beckham and Chisholm opted not to take part in a reunion project, with Brown reaffirming their positions in saying, \"Victoria's busy [...] Mel C's doing her own album\" and noted that both members gave the three-piece their blessing to continue with the project.[119] On 23 November 2016, a new song, \"Song for Her\", was leaked online.[120] Following Halliwell's announcement of her pregnancy, the project was cancelled.[121]\n\nOn 5 November 2018, Brown, Bunton, Chisholm and Halliwell announced a tour for 2019. Beckham declined to join due to commitments regarding her fashion business.[122][123] The Spice World – 2019 Tour commenced at Croke Park in Dublin, Ireland on 24 May 2019.[124] A 13 date European tour, it concluded with three concerts at London's Wembley Stadium, with the last taking place on 15 June 2019.[125] The tour produced 700,000 spectators and earned $78.2 million.[126][127] Despite sound problems in the early concerts, Anna Nicholson in The Guardian writes, “As nostalgia tours go, this could hardly have been bettered. Victoria’s dry wit was missed, but some passive-aggressive patter and a food fight is how you really sell a tour.”[128]\n\nOn 30 April 2019, the group teamed up with the children's book franchise Mr. Men, in order to create many derivative products such as books, cups, bags and coasters.[129][130][131] On 13 June 2019, it was reported that Paramount Animation president Mireille Soria had green lit an animated film based on the group, with all five members returning. The project will be produced by Simon Fuller, with Karen McCullah and Kiwi Smith writing the screenplay, and will feature both previous and original songs.[132] The film will feature the band as superheroes. A director has not yet been announced.[133]\n\nCultural impact and legacy [ edit ]\n\nPop music scene [ edit ]\n\nIn addition to their global success, The Spice Girls became the biggest act of the 1990s in the UK charts , achieving eight of their nine number-one singles in this decade.\n\nThe Spice Girls broke onto the music scene at a time when alternative rock, hip-hop and R&B dominated global music charts. The modern pop phenomenon that the Spice Girls created by targeting early members of Generation Y was credited with changing the global music landscape,[134][135][136] bringing about the global wave of late 1990s and early 2000s teen pop acts such as Hanson, Britney Spears, Christina Aguilera and NSYNC.[137][138][139][140]\n\nThe Spice Girls have also been credited with paving the way for the girl groups and female pop singers that have come after them.[141][142][143] In the UK, they are credited for their massive commercial breakthrough in the previously male-dominated pop music scene,[143][144] leading to the widespread formation of new girl groups in the late 1990s and early 2000s including All Saints, B*Witched, Atomic Kitten, Girls Aloud and Sugababes, hoping to emulate the Spice Girls’ success.[145][146][147] 21st-century girl groups, including The Pussycat Dolls,[148] 2NE1,[149] Girls' Generation,[150] Little Mix[151][152] and Fifth Harmony,[153] continue to cite the group as a major source of influence, as have female singers, including Lady Gaga,[154] Jess Glynne,[155] Alexandra Burke,[155] Kim Petras,[156] Charli XCX,[157][158] Rita Ora,[159] Demi Lovato[160] and Carly Rae Jepsen.[161] During her 2005 \"Reflections\" concert series, Filipina superstar Regine Velasquez performed a medley of Spice Girls songs consisting of \"Wannabe\", \"Say You'll Be There\", \"2 Become 1\", \"Who Do You Think You Are\" and \"Holler\", as a tribute to the band she says were a major influence on her music.[162] Danish singer-songwriter MØ decided to pursue music after watching the Spice Girls on TV as a child, saying in a 2014 interview: \"I have them and only them to thank—or to blame—for becoming a singer.\"[163] 15-time Grammy Award-winning singer-songwriter Adele credits the Spice Girls as a major influence in regard to her love and passion for music, stating that \"they made me what I am today\".[164][165]\n\nGirl power [ edit ]\n\nThe phrase \"girl power\" put a name to a social phenomenon, but the slogan was met with mixed reactions.[166] The phrase was a label for the particular facet of post classical neo-feminist empowerment embraced by the band: that a sensual, feminine appearance and equality between the sexes need not be mutually exclusive. This concept was by no means original in the pop world: both Madonna and Bananarama had employed similar outlooks. The phrase itself had also appeared in a few songs by British girl groups and bands since at least 1987; most notably, it was the name of British pop duo Shampoo's 1996 single and album, later credited by Halliwell as the inspiration for the Spice Girls' mantra.[27][167] In a Christmas 1996 interview with The Spectator magazine, Halliwell spoke of former UK Prime Minister Margaret Thatcher as being an inspiration for the group: “We are true Thatcherites. Thatcher was the first Spice Girl, the pioneer of our ideology.”[168]\n\nBillboard states it was among the songs where “they embraced their sexuality.\"[169] Beckham and Bunton in Las Vegas Nevada , on 11 December 2007, performing \"2 Become 1\". Addressing the importance of contraception, Jennifer Keishin Armstrong instates it was among the songs where “they embraced their sexuality.\"\n\nHowever, it was not until the emergence of the Spice Girls in 1996 with \"Wannabe\", that the concept of \"girl power\" exploded onto the common consciousness.[169] The phrase was regularly uttered by all five members—although most closely associated with Halliwell—and was often delivered with a peace sign.[170] The slogan also featured on official Spice Girls merchandise and on some of the outfits the group members wore. The Spice Girls' version was distinctive. Its message of empowerment appealed to young girls, adolescents and adult women,[171][166] and it emphasised the importance of strong and loyal friendship among females.[172][173] According to Billboard magazine, they demonstrated real, noncompetitive female friendship, singing: \"If you wannabe my lover, you gotta get with my friends. Make it last forever; friendship never ends.\"[169]\n\nIn all, the focused, consistent presentation of \"girl power\" formed the centrepiece of their appeal as a band.[166][174] Some commentators credit the Spice Girls with reinvigorating mainstream feminism—popularised as \"girl power\"—in the 1990s,[175][176] with their mantra serving as a gateway to feminism for their young fans.[173][177] On the other hand, some critics dismissed it as no more than a shallow marketing tactic, while others took issue with the emphasis on physical appearance, concerned about the potential impact on self-conscious and/or impressionable youngsters.[171] Regardless, the phrase became a cultural phenomenon,[178] adopted as the mantra for millions of girls[166][173] and even making it into the Oxford English Dictionary.[179] In summation of the concept, author Ryan Dawson said, \"The Spice Girls changed British culture enough for Girl Power to now seem completely unremarkable.\"[12]\n\nThe Spice Girls' debut single \"Wannabe\" has been hailed as an \"iconic girl power anthem\".[135][180][181] In 2016, the United Nations' Global Goals \"#WhatIReallyReallyWant\" campaign filmed a global remake of the original music video for \"Wannabe\" to highlight gender inequality issues faced by women across the world. The video, which was launched on YouTube and ran in movie theatres internationally,[182] featured British girl group M.O, Canadian \"viral sensation\" Taylor Hatala, Nigerian-British singer Seyi Shay and Bollywood actress Jacqueline Fernandez lip-syncing to the song in various locations around the world.[183] In response to the remake, Beckham said, \"How fabulous is it that after 20 years the legacy of the Spice Girls’ girl power is being used to encourage and empower a whole new generation?\"[182]\n\nAt the 43rd People's Choice Awards in January 2017, American actress Blake Lively dedicated her \"Favorite Dramatic Movie Actress\" award to \"girl power\" in her acceptance speech, and credited the Spice Girls, saying: \"What was so neat about them was that they’re all so distinctly different, and they were women, and they owned who they were, and that was my first introduction into girl power.\"[184] In 2018, Rolling Stone named the Spice Girls’ girl power on The Millennial 100, a list of 100 people, music, cultural touchstones and movements that have shaped a generation (those born between 1980 and 1995).[185]\n\nCool Britannia [ edit ]\n\nThe term \"Cool Britannia\" became prominent in the media and represented the new political and social climate that was emerging with the advances made by New Labour and the new UK Prime Minister Tony Blair. Coming out of a period of 18 years of Conservative government, Tony Blair and New Labour were seen as young, cool, and appealing, a driving force in giving Britain a feeling of euphoria and optimism.[186]\n\nAlthough by no means responsible for the onset of \"Cool Britannia\", the arrival of the Spice Girls added to the new image and re-branding of Britain, and underlined the growing world popularity of British, rather than American, pop music. This fact was underlined at the 1997 Brit Awards; the group won two awards[187] but it was Halliwell's iconic red, white and blue Union Jack mini-dress that appeared in media coverage around the world, becoming an enduring image of \"Cool Britannia\".[188][53] In 2016, Time acknowledged the Spice Girls as \"arguably the most recognisable face\" of \"Cool Britannia\".[13]\n\nFashion trends, image and nicknames [ edit ]\n\nThe Spice Girls are considered style icons of the 1990s; their image and styles becoming inextricably tied to the band's identity.[189][190][191] They are credited with setting 1990s fashion trends such as Buffalo platform shoes and double bun hairstyles.[193][194] The group have also been noted for the memorable outfits they have worn, the most iconic being Halliwell's Union Jack dress from the 1997 Brit Awards.[195] The dress was sold at a charity auction to the Las Vegas Hard Rock Cafe for £41,320, giving Halliwell the Guinness World Record at that time for the most expensive piece of pop star clothing ever sold.[196][197] Their style has inspired other celebrities including Katy Perry,[198] Charli XCX,[199] Billie Eilish,[200] and Bollywood actress Anushka Ranjan.[201]\n\nThe Spice Girls' image was deliberately aimed at young girls, an audience of formidable size and potential. Instrumental to their range of appeal within the target demographic were the bandmates' five divergent personalities and styles, which encouraged fans to identify with one member or another and were a departure from previous bands.[171][202] This marketing of each member's individuality was reinforced by the distinctive nicknames adopted by each member of the group. Their concept of each band member having a distinct style identity has been influential to later teen pop groups such as boy band One Direction.[203][204]\n\nShortly after \"Wannabe\"'s release, a lunch with Peter Loraine, then-editor of Top of the Pops, inadvertently led the Spice Girls to adopt the nicknames that ultimately played a key role in their marketability and the way their international audience identified with them. After the lunch, Loraine and his editorial staff decided to devise nicknames for each member of the group based on their personalities. In an interview with Music Week, Loraine explained that, \"In the magazine we used silly language and came up with nicknames all the time so it came naturally to give them names that would be used by the magazine and its readers; it was never meant to be adopted globally.\" Shortly after using the nicknames in a magazine feature on the group, Loraine received calls from other British media outlets requesting permission to use them, and before long the nicknames were synonymous with the Spice Girls.[205]\n\nEach Spice Girl had a unique, over-the-top style that served as an extension of her public persona, becoming her trademark look.[189][206]\n\nIn their one-off reunion at the 2012 Summer Olympics closing ceremony, the Spice Girls performed in updated high fashion versions of their signature outfits,[113] after entering the Olympic Stadium in five black cabs which lit up with LEDs, each decorated with their individual trademark emblems (Posh: sparkling black, Sporty: racing stripes, Scary: leopard print, Baby: pink and Ginger: the Union Jack Flag).\n\nCommercialisation and celebrity culture [ edit ]\n\nAt the height of \"Spice mania\", the group were involved in a prolific marketing phenomenon.[213][214][215][216] They advertised for an unprecedented number of brands, becoming the most merchandised group in music history,[167][217] and were a frequent feature of the global press.[215][218]\n\nAccording to Rolling Stone's David Sinclair, \"So great was the daily bombardment of Spice images and Spice product that it quickly became oppressive even to people who were well disposed towards the group.\"[219] This was even parodied in the video for their song \"Spice Up Your Life\", which depicts the group going around a futuristic dystopian city in a space ship surrounded by billboards and adverts featuring them. Throughout the American leg of their 1998 Spiceworld world tour, commercials were played on large concert screens before the shows and during intermissions. It was the first time advertising had been used in pop concerts and was met with mixed reactions in the music industry. Nevertheless, it opened up a whole new concert revenue stream, with music industry pundits predicting more acts would follow the Spice Girls' lead.[220][221]\n\nIn his analysis of the group's influence on 21st century popular culture two decades after their debut, John Mckie of the BBC noted that while other stars had used brand endorsements in the past, \"the Spice brand was the first to propel the success of the band\".[171] The Guardian's Sylvia Patterson also wrote of what she called the Spice Girls' true legacy: \"[T]hey were the original pioneers of the band as brand, of pop as a ruthless marketing ruse, of the merchandising and sponsorship deals that have dominated commercial pop ever since.\"[139]\n\nThe mainstream media embraced the Spice Girls at the peak of their success. The group received regular international press coverage and were constantly followed by paparazzi.[4][222] Paul Gorman of Music Week said of the media interest in the Spice Girls in the late 1990s: \"They inaugurated the era of cheesy celebrity obsession which pertains today. There is lineage from them to the Kardashianisation not only of the music industry, but the wider culture.\"[171] The Irish Independent's Tanya Sweeney agreed that \"[t]he vapidity of paparazzi culture could probably be traced back to the Spice Girls' naked ambitions\",[174] while Mckie predicted that, \"[f]or all that modern stars from Katy Perry to Lionel Messi exploit brand endorsements and attract tabloid coverage, the scale of the Spice Girls' breakthrough in 1996 is unlikely to be repeated—at least not by a music act.\"[171]\n\n1990s icons [ edit ]\n\nThe Spice Girls have been labelled the biggest pop phenomenon of the 1990s[18][20] due to their international record sales, iconic symbolism and \"omnipresence\" in the late 1990s.[189][215][223] At the 2000 Brit Awards, the group received the Outstanding Contribution to Music Award to mark their success in the global music scene in the 1990s.[224] The iconic symbolism of the Spice Girls in the 1990s is partly attributed to their era-defining outfits,[189] the most notable being the Union Jack dress that Geri Halliwell wore at the 1997 Brit Awards. The dress has achieved iconic status, becoming one of the most prominent symbols of 1990s pop culture.[225] The status of the Spice Girls as 1990s pop icons is also attributed to their vast merchandising and willingness to be a part of a media-driven world.[171] Their unprecedented appearances in adverts and the media solidified the group as a phenomenon—an icon of the decade and for British music.[17][143]\n\nSome sources, especially those in the United Kingdom, regard the Spice Girls as gay icons.[226][227] In a UK survey of more than 5,000 gay men and women, Victoria Beckham placed 12th and Halliwell placed 43rd in a ranking of the Top 50 gay icons of all time.[228] Halliwell was also the recipient of the Honorary Gay Award at the 2016 Attitude Awards.[229] In a 2005 interview, Emma Bunton attributed their large gay fan base to the group's fun-loving nature, open-mindedness, and their love of fashion and dressing up, concluding that: \"I'm so flattered that we've got such a huge gay following, it's amazing.\"[230]\n\nIn 1999, a study conducted by the British Council found that the Spice Girls were the second-best-known Britons internationally—only behind then-Prime Minister Tony Blair—and the best-known Britons in Asia.[231][232] In 2004, they featured in the VH1 series I Love the '90s for the year 1997, which was broadcast in the United States.[233] In 2005, Emma Bunton was a presenter on the VH1 sequel, I Love the '90s: Part Deux, with 1998 covering Geri Halliwell's exit from the group.[234] In 2006, ten years after the release of their debut single, the Spice Girls were voted the biggest cultural icons of the 1990s with 80 percent of the votes in a UK poll of 1,000 people carried out for the board game Trivial Pursuit, stating that \"Girl Power\" defined the decade.[223][235] The Spice Girls also ranked number ten in the E! TV special, The 101 Reasons the '90s Ruled.[236]\n\nPortrayal in the media [ edit ]\n\nThe Spice Girls became media icons in Great Britain and a regular feature of the British press.[218][237] During the peak of their worldwide fame in 1997, the paparazzi were constantly seen following them everywhere[4][222] to obtain stories and gossip about the group, as a supposed affair between Emma Bunton and manager Simon Fuller, or constant split rumours which became fodder for numerous tabloids.[237][238][239][240] Rumours of in-fighting and conflicts within the group also made headlines, with the rumours suggesting that Geri Halliwell and Melanie Brown in particular were fighting to be the leader of the group.[14] Brown, who later admitted that she used to be a \"bitch\" to Halliwell, said the problems had stayed in the past.[241] The rumours reached their height when the Spice Girls dismissed their manager Simon Fuller during the power struggles, with Fuller reportedly receiving a £10 million severance cheque to keep quiet about the details of his sacking.[14][239][240] Months later, in May 1998, Halliwell would leave the band amid rumours of a falling out with Brown; the news of Halliwell's departure was covered as a major news story by media around the world,[242] and became one of the biggest entertainment news stories of the year.[77]\n\nIn February 1997 at the Brit Awards, Halliwell's Union Jack dress from the Spice Girls' live performance made all the front pages the next day. During the ceremony, Halliwell's breasts were exposed twice, causing controversy.[21] In the same year, nude glamour shots of Halliwell taken earlier in her career were released,[237] causing some scandal.[218] According to the group's official documentary Giving You Everything, the rest of the group had been fully aware of Halliwell's glamour modelling past, but the photos still created friction inside the group when they were published.\n\nThe stories of their encounters with other celebrities also became fodder for the press;[237][243] for example, in May 1997, at The Prince's Trust 21st anniversary concert, Mel B and Geri Halliwell breached royal protocol when they planted kisses on Prince Charles's cheeks, leaving it covered with lipstick, and later, Halliwell told him \"you're very sexy\" and also pinched his bottom.[244] In November, the British Royal Family were considered fans of the Spice Girls, including The Prince of Wales and his sons Prince William and Prince Harry.[245][246][247] That month, South African President Nelson Mandela said: \"These are my heroes. This is one of the greatest moments in my life\"[248] in an encounter organised by Prince Charles, who said, \"It is the second greatest moment in my life, the first time I met them was the greatest\".[248] Prince Charles would later send Halliwell a personal letter \"with lots of love\" when he heard that she had quit the Spice Girls.[244] In 1998 the video game magazine Nintendo Power created The More Annoying Than the Spice Girls Award, adding: \"What could possibly have been more annoying in 1997 than the Spice Girls, you ask?\"[249]\n\nVictoria Adams started dating football player David Beckham in 1997 after they had met at a charity football match.[250] The couple announced their engagement in 1998[251] and were dubbed \"Posh and Becks\" by the media, becoming a cultural phenomenon in their own right.[252]\n\nOther brand ventures [ edit ]\n\nFilm [ edit ]\n\nSpice World (1997) The Spice Girls' bus used in the film(1997)\n\nIn June 1997, the group began filming their movie debut with director Bob Spiers. Meant to accompany the album, the comical style and content of the movie was in the same vein as The Beatles' films in the 1960s such as A Hard Day's Night. The light-hearted comedy, intended to capture the spirit of the Spice Girls, featured a plethora of stars including Roger Moore, Hugh Laurie, Stephen Fry, Elton John, Richard O'Brien, Bob Hoskins, Jennifer Saunders, Richard E. Grant, Elvis Costello, and Meat Loaf.[253]\n\nReleased in December 1997, Spiceworld: The Movie proved to be a hit at the box office, breaking the record for the highest-ever weekend debut for Super Bowl Weekend (25 January 1998) in the US, with box office sales of $10,527,222. The movie took in a total of $151 million at the box office worldwide.[14] Despite being a commercial success, the film was widely panned by critics; the movie was nominated for seven awards at the 1999 Golden Raspberry Awards where the Spice Girls collectively won the award for \"Worst Actress\". Since 18 July 2014, The Spice Bus, which was driven by Meat Loaf in the film, is now on permanent display at the Island Harbour Marina on the Isle of Wight, England.[254]\n\nConsidered a cult film, many publications described it as a brilliant film of the parody genre, that mocks both the star system and clichés of the cinema, while giving many winks to popular culture of the time.[255][256][257][258][259]\n\nTelevision [ edit ]\n\nThe Spice Girls have starred in several television specials, documentaries and commercials since their debut in 1996. They have hosted various television specials. In November 1997, the Spice Girls became the first pop group to host ITV's An Audience with...;[68] their show featured an all-female audience and was watched by 11.8 million viewers in the UK, one fifth of the country's total population.[69] They have also hosted Christmas Eve and Christmas Day Top of the Pops television specials on BBC One.[260][261] Concert specials of their 1997 Girl Power! Live in Istanbul,[262] 1998 Spiceworld Tour[263] and 1999 Christmas in Spiceworld tours were also broadcast in various countries.\n\nThe Spice Girls have released at least seven official behind-the-scenes television documentaries, including two tour documentaries and two making-of documentaries for their film Spice World. They have also been the subject of a number of unofficial documentaries, commissioned and produced by individuals independent of the group. These documentaries usually focus on the group's career and their cultural impact. The Spice Girls have had episodes dedicated to them in several music biography series, including VH1's Behind the Music, E! True Hollywood Story, and MTV's BioRhythm. The Spice Girls have appeared and performed in numerous television shows and events. Notable appearances include Saturday Night Live (SNL), The Oprah Winfrey Show, two Royal Variety Performances, and the 2012 Summer Olympics closing ceremony. The group has also starred in television commercials for brands including Pepsi (where they sang “Move Over”, given the additional subtitle \"Generationext\" which is a prominent lyric in the song), Polaroid, Walkers Crisps, Impulse and Tesco.[264]\n\nViva Forever! [ edit ]\n\nA jukebox musical written by Jennifer Saunders, produced by Judy Craymer and directed by Paul Garrington. Based on the songs of the Spice Girls, the show began previews at the Piccadilly Theatre in the West End on 27 November 2012 and had its Press Night on 11 December 2012 and features some of the group's biggest hit songs including \"Wannabe\", \"Spice Up Your Life\" and the eponymous \"Viva Forever\".[265]\n\nIn 1997, the Spice Girls were involved in a prolific merchandising phenomenon, becoming the most merchandised group in music history[217] with estimated earnings of over £300 million from their merchandising and endorsement deals that year alone.[266] They negotiated lucrative deals with many brands, including Pepsi, Asda, Cadbury and Target, which led to accusations of \"selling out\" and overexposure.[65] The group responded to the press' criticisms by launching the music video for \"Spice Up Your Life\" in which they parody the number of sponsorships they had. In their 2019 reunion, they teamed up with the children's book franchise Mr. Men, creating many derivative products such as books, cups, bags and coasters.[267][268][269]\n\nIn conjunction with the beginning of the Spice World – 2019 Tour, the Spice Girls launched an advertising campaign with Walkers potato crisps who they had previously worked with in the 1990s.[270] The campaign was to find their \"Best Ever Fan\" and included Spice Girls branded products in supermarkets to promote their \"best ever\" Cheese & Onion flavouring and a television advertisement which was premiered during a commercial break for 2019's Britain's Got Talent semi-finals.[271] The \"best ever fan\" would receive the chance to meet the Spice Girls on a date of their tour.[272]\n\nCareer records and achievements [ edit ]\n\nAs a group, the Spice Girls have received a number of notable awards including five Brit Awards, three American Music Awards, three MTV Europe Music Awards, one MTV Video Music Award and three World Music Awards. In 2000, they received the Brit Award for Outstanding Contribution to the British Music Industry, previous winners include Elton John, The Beatles and Queen. They have sold 85 million records worldwide,[6][8] achieving certified sales of 13 million albums in Europe,[45] 14 million records in the US[47] and 2.4 million in Canada.[63] The group achieved the highest debut for a UK group on the Billboard Hot 100 at number five with \"Say You'll Be There\". They are also the first British band since The Rolling Stones in 1975 to have two top-ten albums in the US Billboard 200 albums chart at the same time (Spice and Spiceworld).[64] In addition to this, the Spice Girls also achieved the highest ever annual earnings by an all-female group in 1998 with an income of £29.6 million (approximately US$49 million).[273] In 1999, they were ranked sixth in Forbes' inaugural Celebrity 100 Power Ranking.[274]\n\nThey produced a total of nine number one singles in the UK—tied with ABBA behind Take That (eleven), The Shadows (twelve), Madonna (thirteen), Westlife (fourteen), Cliff Richard (fourteen), The Beatles (seventeen), and Elvis Presley (twenty-one). The group had three consecutive Christmas number-one singles in the UK (\"2 Become 1\", 1996; \"Too Much\", 1997; \"Goodbye\", 1998); they only share this record with The Beatles.[275] Their first single, \"Wannabe\", is the most successful song released by an all-female group.[30][196] Debuting on the US Billboard Hot 100 chart at number eleven, it is also the highest-ever debut by a British band in the US, beating the previous record held by The Beatles for \"I Want to Hold Your Hand\" and the joint highest entry for a debut act, tying with Alanis Morissette.[21]\n\nSpice is the 18th biggest-selling album of all time in the UK with over 3 million copies sold, and topped the charts for 15 non-consecutive weeks, the most by a female group in the UK.[43] It is also the biggest-selling album of all time by a girl group, with sales of over 28 million copies worldwide.[3][21][50][51] Spiceworld shipped 7 million copies in just two weeks, including 1.4 million in Britain alone—the largest-ever shipment of an album over 14 days.[276] They are also the first act (and so far only female act) to have their first six singles (\"Wannabe\", \"Say You'll Be There\", \"2 Become 1\", \"Mama\"/\"Who Do You Think You Are\", \"Spice Up Your Life\" and \"Too Much\") make number one on the UK charts. (Their run was broken by \"Stop\", which peaked at number two in March 1998.)\n\nSpiceworld: The Movie broke the record for the highest-ever weekend debut a film on Super Bowl weekend (25 January 1998) in the US, with box office sales of $10,527,222. Spiceworld: The Movie topped the UK video charts on its first week of release, selling over 55,000 copies on its first day in stores and 270,000 copies in the first week.[277][278] The Return of the Spice Girls Tour was announced as the highest-grossing concert act of 2008, measured as the twelve months ended April 2008.[101] The 17-night sellout stand at the O 2 Arena in London was the highest-grossing engagement of the year, netting £16.5 million (US$33 million) for the group and drawing an audience of 256,647, winning the 2008 Billboard Touring Award for Top Boxscore.[279][280] In total, the 47-date tour took in more than $70 million[281] and produced $107.2 million in ticket sales and merchandising.[107] The 3-night sellout stand at Wembley Stadium for the Spice World - 2019 Tour was the highest-grossing engagement of the year drawing an audience of 221,971, winning the 2019 Billboard Live Music Award for Top Boxscore.[282]\n\nIn popular culture [ edit ]\n\nSpice World at the Geri Halliwell's swimsuit fromat the Hard Rock Cafe in Tokyo, Japan\n\nIn February 1997, the \"Sugar Lumps\", a satirical version of the Spice Girls played by Kathy Burke, Dawn French, Llewella Gideon, Lulu, and Jennifer Saunders, filmed a video for British charity Comic Relief. The video starts with the Sugar Lumps as schoolgirls who really want to become pop stars like the Spice Girls, and ends with them joining the group on stage, while dancing and lip-syncing the song \"Who Do You Think You Are\".[283] The Sugar Lumps later joined the Spice Girls during their live performance of the song on Comic Relief's telethon Red Nose Day event in March 1997.[284] In January 1998, a fight between animated versions of the Spice Girls and pop band Hanson was the headlining matchup in MTV's claymation parody Celebrity Deathmatch Deathbowl '98 special that aired during the Super Bowl XXXII halftime.[285][286] The episode became the highest-rated special in the network's history and MTV turned the concept into a full-fledged television series soon after.[287]\n\nIn March 2013, the Glee characters Brittany (Heather Morris), Tina (Jenna Ushkowitz), Marley (Melissa Benoist), Kitty (Becca Tobin), and Unique (Alex Newell) dressed up as the Spice Girls and performed the song \"Wannabe\" on the 17th episode of the fourth season of the show.[288] In April 2016, the Italian variety show Laura & Paola on Rai 1 featured the hosts, Grammy Award-winning singer Laura Pausini and actress Paola Cortellesi, and their guests, Francesca Michielin, Margherita Buy, and Claudia Gerini, dressed up as the Spice Girls to perform a medley of Spice Girls songs as part of a 20th anniversary tribute to the band.[289][290] In December 2016, the episode \"Who Needs Josh When You Have a Girl Group?\" of the musical comedy-drama series Crazy Ex-Girlfriend featured cast members Rachel Bloom, Gabrielle Ruiz, and Vella Lovell performing an original song titled \"Friendtopia\", a parody of the Spice Girls’ songs and \"girl power\" philosophy.[291][292] Rapper Aminé's 2017 single \"Spice Girl\" is a reference to the group, and the song's music video includes an appearance by Mel B.[293]\n\nIn the late 1990s, Spice Girls parodies appeared in various American sketch comedy shows including Saturday Night Live (SNL), Mad TV[294] and All That. A January 1998 episode of SNL featured cast members, including guest host Sarah Michelle Gellar, impersonating the Spice Girls for two \"An Important Message About ...\" sketches.[295] In September 1998, the show once again featured cast members, including guest host Cameron Diaz, impersonating the Spice Girls for a sketch titled \"A Message from the Spice Girls\".[296][297] Nickelodeon's All That had recurring sketches with the fictional boy band \"The Spice Boys\", featuring cast members Nick Cannon as \"Sweaty Spice\", Kenan Thompson as \"Spice Cube\", Danny Tamberelli as \"Hairy Spice\", Josh Server as \"Mumbly Spice\", and a skeleton prop as \"Dead Spice\".[298]\n\nParodies of the Spice Girls have also appeared in major advertising campaigns. In 1997, Jack in the Box, an American fast-food chain restaurant, sought to capitalise on \"Spice mania\" in America by launching a national television campaign using a fictional girl group called the Spicy Crispy Chicks (a take off of the Spice Girls) to promote the new Spicy Crispy Sandwich. The Spicy Crispy Chicks concept was used as a model for another successful advertising campaign called the 'Meaty Cheesy Boys'.[141][299] At the 1998 Association of Independent Commercial Producers (AICP) Show, one of the Spicy Crispy Chicks commercials won the top award for humour.[300] In 2001, prints adverts featuring a parody of the Spice Girls, along with other British music icons consisting of The Beatles, Elton John, Freddie Mercury, and The Rolling Stones, were used in the Eurostar national advertising campaign in France. The campaign won the award for Best Outdoor Campaign at the French advertising CDA awards.[301][302] In September 2016, an Apple Music advert premiered during the 68th Primetime Emmy Awards that featured comedian James Corden dressed up as various music icons including all five of the Spice Girls.[303]\n\nOther notable groups of people have been labelled as some variation of a play-on-words on the Spice Girls' name as an allusion to the band. In 1997, the term \"Spice Boys\" emerged in the British media as a term coined to characterise the \"pop star\" antics and lifestyles off the pitch of a group of Liverpool F.C. footballers that includes Jamie Redknapp, David James, Steve McManaman, Robbie Fowler, and Jason McAteer.[304] The label has stuck with these footballers ever since, with John Scales, one of the so-called Spice Boys, admitting in 2015 that, \"We’re the Spice Boys and it’s something we have to accept because it will never change.\"[305] In the Philippines, the \"Spice Boys\" tag was given to a group of young Congressmen of the House of Representatives who initiated the impeachment of President Joseph Estrada in 2001.[306][307] The Australian/British string quartet Bond were dubbed by the international press as the \"Spice Girls of classical music\" during their launch in 2000 due to their \"sexy\" image and classical crossover music that incorporated elements of pop and dance music. A spokeswoman for the quartet said in response to the comparisons, \"In fact, they are much better looking than the Spice Girls. But we don't welcome comparisons. The Bond girls are proper musicians; they have paid their dues.\"[308][309] The Women's Tennis Association (WTA) doubles team of Martina Hingis and Anna Kournikova, two-time Grand Slam and two-time WTA Finals Doubles champions, dubbed themselves the \"Spice Girls of tennis\" in 1999.[310][311] Hingis and Kournikova, along with fellow WTA players Venus and Serena Williams, were also labelled the \"Spice Girls of tennis\", then later the \"Spite Girls\",[312][313] by the media in the late 1990s due to their youthfulness, popularity, and brashness.[314]\n\nWax sculptures of the Spice Girls are currently on display at the famed Madame Tussauds New York wax museum.[315][316] The sculptures of the Spice Girls (sans Halliwell) were first unveiled in December 1999, making them the first pop band to be modelled as a group since the Beatles in 1964 at the time.[317] A sculpture of Halliwell was later made in 2002,[318] and was eventually displayed with the other Spice Girls' sculptures after Halliwell reunited with the band in 2007. Since 2008, \"Spiceworld: The Exhibition\", a collection of over 5,000 Spice Girls memorabilia and merchandise, has been showcased in museums across the UK, including the Leeds City Museum in 2011,[319] Northampton Museum and Art Gallery in 2012,[320] Tower Museum in 2012,[321] Ripley's Believe It or Not! London and Blackpool museums in 2015[322] and 2016,[323] and the Watford Colosseum in 2016.[324] The collection is owned by Liz West, the Guinness World Record holder for the largest collection of Spice Girls memorabilia.[325][326] The Spice Girls themselves have contributed items to the exhibition.[327] \"The Spice Girls Exhibition\", a collection of over 1,000 Spice Girls items owned by Alan Smith-Allison, was held at the Trakasol Cultural Centre in Limassol Marina, Cyprus in the summer of 2016.[328] \"Wannabe 1996-2016: A Spice Girls Art Exhibition\", an exhibition of Spice Girls-inspired art, was held at The Ballery in Berlin in 2016 to celebrate the 20th anniversary of the group's debut single, \"Wannabe\".[329][330]\n\nDiscography [ edit ]\n\nConcerts [ edit ]\n\nPublications [ edit ]\n\nGirl Power: The Official Book by the Spice Girls , Andre Deutsch Ltd (27 March 1997) ISBN 9780233991658\n\n, Andre Deutsch Ltd (27 March 1997) ISBN 9780233991658 Real Life : Real Spice: The Official Story by the Spice Girls , Andre Deutsch Ltd (23 October 1997) ISBN 9780233992990\n\n, Andre Deutsch Ltd (23 October 1997) ISBN 9780233992990 Geri \"Ginger Nutter\": Official Spice Girls Pocket Books , Andre Deutsch Ltd (23 October 1997) ISBN 9780233993218\n\n, Andre Deutsch Ltd (23 October 1997) ISBN 9780233993218 Emma \"Baby Talking\": Official Spice Girls Pocket Books , Andre Deutsch Ltd (23 October 1997) ISBN 9780233993225\n\n, Andre Deutsch Ltd (23 October 1997) ISBN 9780233993225 Mel C \"Tuff Enuff\": Official Spice Girls Pocket Books , Andre Deutsch Ltd (23 October 1997) ISBN 9780233993249\n\n, Andre Deutsch Ltd (23 October 1997) ISBN 9780233993249 Victoria \"The High Life\": Official Spice Girls Pocket Books , Andre Deutsch Ltd (23 October 1997) ISBN 9780233993256\n\n, Andre Deutsch Ltd (23 October 1997) ISBN 9780233993256 Mel B \"Don't Be Scared\": Official Spice Girls Pocket Books , Andre Deutsch Ltd (23 October 1997) ISBN 9780233993232\n\n, Andre Deutsch Ltd (23 October 1997) ISBN 9780233993232 Spice World The Movie: The Official Book of the Film , Ebury Press (26 November 1997) ISBN 9780091864200\n\n, Ebury Press (26 November 1997) ISBN 9780091864200 Forever Spice, Little, Brown & Company (4 November 1999) ISBN 9780316853613\n\nSee also [ edit ]\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Gnome-mime-sound-openclipart.svg/50px-Gnome-mime-sound-openclipart.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/The_actual_Spice_Bus_from_the_film_Spice_World.jpg/220px-The_actual_Spice_Bus_from_the_film_Spice_World.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/SpiceGirlWembley150619-2_%2848999823438%29.jpg/220px-SpiceGirlWembley150619-2_%2848999823438%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Spiceworld-gerihalliwell-outfit.jpg/170px-Spiceworld-gerihalliwell-outfit.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Spice_Girls_Viva_Forever.jpg/220px-Spice_Girls_Viva_Forever.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/Spicegirls-holler.JPG/230px-Spicegirls-holler.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Spice_Girls_2008_01_cropped.jpg/230px-Spice_Girls_2008_01_cropped.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Spice_Girls_live_West_MacLaren_1997.jpg/240px-Spice_Girls_live_West_MacLaren_1997.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/Spice_Girls_in_Toronto%2C_Ontario.jpg/1200px-Spice_Girls_in_Toronto%2C_Ontario.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/London_cabs_with_Spice_Girls.jpg/220px-London_cabs_with_Spice_Girls.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Victoriaandemmaonpoleslv.jpg/215px-Victoriaandemmaonpoleslv.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/Spice_Girls_in_Toronto%2C_Ontario.jpg/225px-Spice_Girls_in_Toronto%2C_Ontario.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Geri_Halliwell_in_concert_cropped.jpg/200px-Geri_Halliwell_in_concert_cropped.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Spice_Girls_2008_02_cropped.jpg/220px-Spice_Girls_2008_02_cropped.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/Spice_Girls_in_Toronto%2C_Ontario.jpg/1200px-Spice_Girls_in_Toronto%2C_Ontario.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Spice_Girls", "title": "Spice Girls", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/Spice_Girls_in_Toronto%2C_Ontario.jpg/1200px-Spice_Girls_in_Toronto%2C_Ontario.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}