{"url": "www.yogaesoteric.net/content.aspx?lang=EN&item=14910", "text": "Macaulay Culkin: ‘Satanic’ Hollywood Execs Ritually Murder Child Actors\n\nHollywood executives are “blood-thirsty Satanists” who “ritually abuse children in the industry”, according to Macaulay Culkin, who claims he only got out alive because he was a “smart, suspicious kid” and he “got too famous to be killed like some of the other kids”.\n\n“You learn very early to recognize which of them want to abuse you, and which of them have even darker tastes”, Macaulay Culkin said, explaining that “the worst of them wear shoes made out of the skin of children that they ritually murdered.”\n\nSpeaking on radio in Paris, France, Culkin said “Have you seen leather products made from human skin? It has a very unusual, distinctive look. I learned at a very young age to identify it.”\n\nThe news was picked up by French media, with mainstream French newspapers reporting on the explosive interview. However, within an hour of publication all reports had been removed from the internet.\n\nFrench newspaper Les Echos’ headline translated into English: “Macaulay Culkin speaks about Hollywood ritual child abuse live on radio”. Les Echos have not responded to questions regarding why they deleted the article within an hour of publication, and if they were pressured to do so.\n\nLes Echo’s report translated into English: “Macaulay Culkin claims Hollywood studio executives rape and murder child stars and use their skin to make boots, belts and wallets that they use as ‘skin trophies’.”\n\nSkin Trophies\n\nDuring the interview, Culkin claimed that children in the entertainment industry “learn very early to recognize which of them want to abuse you, and which of them have even darker tastes,” explaining that some of the Hollywood executives wear “skin trophies”. Explaining that he was 11 the first time he saw human leather, Culkin said he was “filming Home Alone 2 in New York” when he was “ushered into a back room on the set. There was a guy in there, a powerful executive suit type, you know what I mean?”\n\n“He tried to make me relax. Gave me a can of Coke. Started telling me about the nature of the industry. Basically he wanted me to cut my parents out. He wanted to be my guardian. He said he would make me into the biggest teen star in history. He said I had it all. He said I had to get rid of my parents. I was like ‘Dude, I’m 11!’ and he said ‘You’re a man now’.”\n\nCulkin, who has been living in Paris, France since 2003, then explained that the man “began to make his intentions clear”. “He started breathing real shallow. My experience with perverts kicked in. I could tell he was interested in me.\n\nHe licked his lips and told me I was very handsome. I think I managed to say ‘thank you’ and started thinking about how I could get immediately out of there.\n\nThen he reached into his case and took out a crack pipe. He put it in his lap, took out this huge lighter, and continued to gaze at me with this overpowering sexual desire.”\n\n“I was just staring at him. I think I said something like ‘Dude, I’m 11’ again.\n\nI remember he said to me: ‘It’s a celebration, little man. To celebrate your upcoming success. Your many successes. Come. Sit back down’.\n\nHe was tapping the pipe on his crotch, smiling this total creepazoid smile. I ran out of the room, but I ran straight into this other guy who was outside the room and he grabbed me by the arm and threw me back inside.”\n\n“He lit the pipe and blew the smoke in my face. He told me to look at his shoes. He said they were made from the skin of children he and his friends had murdered. He said leather made from human skin is the finest leather known to man.”\n\nDeath of a child star\n\nMacaulay Culkin said the Hollywood executive then dropped a heavy hint about the provenance of the skin used to make his shoes.\n\n“He asked me if I knew Heather O’Rourke. Yeah, I remembered her. I grew up watching Poltergeist. I remembered her in Happy Days. She was so cute. I vomited all over his shoes.”\n\nHeather O’Rourke was an American child actress, discovered by director Steven Spielberg when she was visiting MGM’s studios and later cast as Carol Anne Freeling in the horror film Poltergeist. She had the movie’s most recognizable line: “They’re here!”.\n\nAfter years in the Hollywood system, Heather O’Rourke died suddenly and unexpectedly at the age of 12. The official cause of death was listed as “heart attack and septic shock” caused by a “misdiagnosed intestinal stenosis” in 1988, though many people were left wondering if there was more to the tragic story.\n\n“Let’s just say I went off the rails after my experiences filming Home Alone 2. I’m 37 now and I’m still processing everything. The things I have seen…” Culkin said, before trailing off and abruptly changing the topic.\n\nCulkin’s legacy\n\nThere are a fair few things Macaulay Culkin is remembered for.\n\nPeople like to talk about his years of reported heroin addiction, which snowballed into rumors that he spent an obscene amount of money on drugs. Others chat about his friendship with pop star Michael Jackson, as well as him fronting a pizza-themed comedy rock band.\n\nBut Culkin no longer has the rail thin, sickly appearance of a junkie. Carrying some weight around the midriff, Culkin is looking happier now, and is filming the lead role for friend Seth Green’s vehicle Changeland.\n\nSpeaking about the future, Culkin said “I’ve come out the other side. I’m alive. That is more than can be said for many. I’m not finished yet. Hollywood is going to burn in my lifetime. You watch.”\n\nyogaesoteric\n\nFebruary 25, 2018\n\n\n\n", "images": ["http://www.yogaesoteric.net/projects/y/YesAtmanImg/content-down.png", "http://www.yogaesoteric.net/uploads-dec17/februarie/25.02.2018/14910/14910_2.jpg", "http://www.yogaesoteric.net/uploads-dec17/februarie/25.02.2018/14910/14910_1.jpg", "http://www.yogaesoteric.net/projects/y/YesAtmanImg/content-up.png", "http://log.trafic.ro/cgi-bin/pl.dll?rid=yogaesotericnet1", "http://www.yogaesoteric.net/img_y\\face\\fr_flag.gif", "http://www.yogaesoteric.net/uploads-dec17/februarie/25.02.2018/14910/14910_3.jpg", "http://www.yogaesoteric.net/img_y\\face\\ro_flag.gif", "http://www.yogaesoteric.net/projects/ye/images/spacer.gif"], "top_img": "http://www.yogaesoteric.net/uploads-dec17/februarie/25.02.2018/14910/14910_3.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "YogaEsoteric :: Macaulay Culkin: ‘Satanic’ Hollywood Execs Ritually Murder Child Actors ::", "meta_data": {"WebsiteSpark": "ghW4ZZj6lb"}, "movies": [], "publish_date": null, "source": "http://www.yogaesoteric.net", "summary": ""}