{"url": "https://www.etonline.com/news/223824_exclusive_how_bachelor_paradise_alum_sarah_herron_is_using_reality_tv_fame_to_change_lives", "text": "When Sarah Herron went on The Bachelor in 2012, she did it for herself. What she never expected was how the experience would motivate her to help others.\n\n\"I originally signed up for The Bachelor because I was so insecure with my arm that I couldn't date,\" she tells ET. \"I thought, as crazy it sounds, maybe if I ... go on and my story's out there for everyone to see, I can't hide from it anymore. When the show aired and I started getting messages from girls across the country who could relate, that was when I realized what an incredible opportunity I had been given.\"\n\nHerron is \"limb different,\" she was born with only one fully-formed arm. The 30-year-old didn't win Bachelor Sean Lowe's heart, but she walked away from the experience with much more: the beginnings of an idea. Herron continued living in California, working and even went on Bachelor in Paradise twice before the way she could use her time on reality TV came to her in full. It was actually season two of BIP, and a terrible experience with infamous \"villain\" Chad Johnson, that helped.\n\nBachelor in Paradise Premiere: How The Show Handled Corinne Olympios, DeMario Jackson Scandal\n\n\"He said some pretty offensive things that were specifically targeted at my arm, and that kind of all made it seem like, this is a better chance than ever to start an organization,\" she says.\n\nSo, SheLift was born. This month marks the nonprofit's first anniversary. SheLift is about using outdoor activities and mentorship to empower young women who need confidence and guidance at critical ages.\n\nOnly ET was on set for a photo shoot celebrating the anniversary. Herron enlisted fellow Bachelor Nation alumni Becca Tilley, Amanda Stanton, Ashley Iaconetti and Ali Fedotowsky, along with several women and girls who are part of SheLift, to be photographed in the organization's signature T-shirts. Photographer Brandon Kidd and celebrity makeup artist Emma Willis were also on hand. The shirts read, \"Maybe You Literally Can Even,\" a play off of the now-popular phrase, \"I can't even.\" Bachelor executive producer Elan Gale actually came up with the wording.\n\nEXCLUSIVE: This 'Bachelor' Executive Producer Wrote a Book To Change the Way You See the World\n\n\"The idea is to stop saying 'I can't' and start saying 'I can,'\" Herron says. \"Especially when you're working with girls with limb differences and physical differences. It's ... a more positive outlook. Maybe you literally can climb a mountain or ride a bike, and pushing girls to try things they've never done before.\"\n\nHerron got support from Chris Harrison and dozens of Bachelor Nation alumni for the organization's first campaign, which raised over $30,000. Her goal this year is to top that, and to send SheLift girls and their mothers on a ski retreat, where they'll learn to ski and connect with other girls and women like them.\n\n\"Sarah has taken her platform from The Bachelor and BIP and is doing something for girls who have really grown up the way she did, which is a little bit different,\" Iaconetti tells ET. \"Now she's making everybody feel great about themselves and ... it's amazing!\"\n\n\n\nStanton adds, \"Having two daughters and just knowing how important it is to feel confident and comfortable in your own skin, that's why I really love what Sarah's doing.\"\n\nAnyone can support SheLift by buying a T-shirt, a mug or more at SheLift.org. Herron's next money-raising effort? She plans to take advantage of all those good-looking Bachelor Nation guys!\n\n\"I really want to do Hot Guys Supporting SheLift!\" she says. \"You don't have to be a woman to support women ... [we'll] get a bunch of hot guys in these T-shirts.\"", "images": ["https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-08/et_pkg_shelift_081517_hulu.jpg?itok=soNiNvY7"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-08/et_pkg_shelift_081517_hulu.jpg?itok=soNiNvY7", "keywords": [], "authors": ["Lauren Zima"], "canonical_link": "https://www.etonline.com/news/223824_exclusive_how_bachelor_paradise_alum_sarah_herron_is_using_reality_tv_fame_to_change_lives", "title": "EXCLUSIVE: How 'Bachelor in Paradise' Alum Sarah Herron Is Using Reality TV Fame to Change Lives", "meta_data": {"article": {"opinion": "false"}, "title": "EXCLUSIVE: How 'Bachelor in Paradise' Alum Sarah Herron Is Using Reality TV Fame to Change Lives | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/news/223824_exclusive_how_bachelor_paradise_alum_sarah_herron_is_using_reality_tv_fame_to_change_lives", "title": "EXCLUSIVE: How 'Bachelor in Paradise' Alum Sarah Herron Is Using Reality TV Fame to Change Lives", "description": "'Bachelor in Paradise' has seen drama and scandal, but Herron is using the platform for good.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-08/et_pkg_shelift_081517_hulu.jpg?itok=soNiNvY7", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "'Bachelor in Paradise' has seen drama and scandal, but Herron is using the platform for good.", "title": "EXCLUSIVE: How 'Bachelor in Paradise' Alum Sarah Herron Is Using Reality TV Fame to Change Lives", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Lauren Zima", "url": "https://www.etonline.com/news/223824_exclusive_how_bachelor_paradise_alum_sarah_herron_is_using_reality_tv_fame_to_change_lives", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-08/et_pkg_shelift_081517_hulu.jpg?itok=soNiNvY7"}, "description": "'Bachelor in Paradise' has seen drama and scandal, but Herron is using the platform for good.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, The Bachelor, Bachelor In Paradise", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}