{"url": "https://www.sheknows.com/entertainment/articles/1141016/beyonce-quotes-about-motherhood/", "text": "From the outside looking in, Beyoncé Knowles Carter is probably the least relatable celebrity mom of all — what with her family vacations on private yachts in Europe and her $7,560 maternity attire. But when you strip Queen Bey of her beauty, fame and unparalleled talent, you get a regular-ish 30-something mama who’s like the rest of us: loving of her kids, amazed by the miracle of pregnancy and childbirth, and overwhelmed by the joy of raising children.\n\nWe’ve rounded up Beyoncé’s most inspiring quotes about motherhood. The mom of three has talked at length over the years about her miscarriages, healthy pregnancies, giving birth and being a mom to oldest daughter Blue and twins Rumi and Sir, and her thoughts on all of the above are surprisingly relatable, even though her lifestyle is anything but.\n\nRead Bey’s most touching quotes about the family she and husband Jay-Z have built together, and prepare to be inspired (OK, probably a little bit jealous, too).\n\n1. When she shared the heartbreaking details of her miscarriage\n\nIn the star’s 2013 HBO documentary Life Is But a Dream, Bey opened up for the first time about the pregnancy she lost before the 2012 birth of daughter Blue.\n\n“About two years ago, I was pregnant for the first time. And I heard the heartbeat, which was the most beautiful music I ever heard in my life,” she said. “I flew back to New York to get my checkup — and no heartbeat. Literally the week before I went to the doctor, everything was fine, but there was no heartbeat.”\n\nFrom there, the Grammy winner put her feelings into her music: “I went into the studio and wrote the saddest song I’ve ever written in my life. And it was actually the first song I wrote for my album. And it was the best form of therapy for me, because it was the saddest thing I’ve ever been through.”\n\n2. When she explained why she wanted to open up about her loss\n\nWhen Oprah interviewed Bey later in 2013, she explained why it was so important for her to talk publicly about her miscarriage.\n\n“There are so many couples that go through that and it was a big part of my story. It’s one of the reasons I did not share I was pregnant the second time [with Blue], because you don’t know what’s going to happen. And that was hard, because all of my family and my friends knew and we celebrated. It was hard,” Beyoncé said.\n\n3. When she got emotional about her mother/daughter bond with Blue Ivy\n\nIn the same Oprah interview, Bey shared that she felt a bond with her little girl almost immediately.\n\n“My daughter introduced me to myself,” she said. “You know, my mother and I are so close, and I always prayed that I would have that type of relationship with my daughter. And she’s still a baby, but the connection I had with her when I was giving birth was something that I’ve never felt before.”\n\n4. When she called pregnancy “the most beautiful experience of my life”\n\nIn Life Is But a Dream, the stunning star also discussed the beauty of carrying her daughter, Blue.\n\n“[It was] the most beautiful experience of my life. It was amazing. I felt like God was giving me a chance to assist in a miracle. You’re playing a part in a much bigger show. And that’s what life is. It’s the greatest show on Earth,” she said.\n\n5. When she was so thankful she got to experience a healthy pregnancy\n\n“Pregnancy is the most incredible gift anyone can have and I’m so happy I’m a woman,” the star told E! News in a 2011 interview. “Men, I feel bad, they don’t get to experience this. It’s incredible.”\n\n6. When she understood the struggle working moms face\n\nYes, even superstars realize it’s not easy for everyday mamas to balance our careers with our families.\n\n“I have so much admiration for women who are mothers, who balance family and work,” the “Single Ladies” singer told Cosmopolitan UK in 2011. “I see them and I have this word in my head — respect. I also look to learn. I see these women and I think, ‘Yes, it can be balanced, it can all work out.’ I do believe that it’s possible to have it all — work, a career, babies. It’s all a question of being very organized. That’s what I’m getting my head around.”\n\n7. When she shared the benefits of breastfeeding\n\nIn 2012, when Bey was crowned People magazine’s Most Beautiful Woman, she revealed she lost the baby weight by breastfeeding — she nursed Blue Ivy for 10 weeks — and encouraged other mamas to do the same.\n\n“I lost most of my weight from breastfeeding and I encourage women to do it. It’s just so good for the baby and good for yourself,” she said.\n\n8. When she hit the nail on the head about how motherhood has changed her\n\nBeyoncé said she found a newfound purpose after becoming a mother.\n\n“It just gives you purpose, and all of the things that my self-esteem was associated with, it’s all completely different,” she told Anderson Cooper in 2012. “I realized why I was born and more than anything all of the things I want to pass onto my child, and the best way of doing that is not by preaching or telling her but showing her by example.”\n\n9. When she admitted she and Jay-Z love changing diapers\n\nIn the same interview, Bey confessed that not even Mr. and Mrs. Carter are above diaper duty.\n\n“Actually, [Jay-Z] is very good. We both [change diapers]. I love changing diapers, I love it. I love every moment of it, it’s so beautiful. I love it all,” she said.\n\n10. When she got real about what was going through her mind during labor\n\nBey got super-philosophical in her 2013 Vogue interview, in which she revealed how she mentally got through labor with Blue.\n\n“I felt like when I was having contractions, I envisioned my child pushing through a very heavy door. And I imagined this tiny infant doing all the work, so I couldn’t think about my own pain… We were talking. I know it sounds crazy, but I felt a communication.”\n\n11. When she asserted that giving birth was her greatest accomplishment\n\nThe star told Garage magazine in 2016 that her proudest moment had nothing to do with her career.\n\n“Out of everything I’ve accomplished, my proudest moment, hands down, was when I gave birth to my daughter Blue,” she said.\n\n12. When she said being called Mama is the best thing ever\n\n“I just adore being a mother, hearing [Blue Ivy] say ‘Mama’ and call me when she needs something,” she told Shape in 2013. “It makes me feel like I have a real purpose here.”\n\n13. When she said family is more important than everything\n\nThis sweet confession came via the singer’s “Self-titled” YouTube series, in which she discussed her 2013 self-titled album.\n\n“I have a lot of awards, and I have a lot of these things. And they’re amazing, and I worked my ass off. I worked harder than probably everybody I know to get those things. But nothing feels like my child saying, ‘Mommy!’ Nothing feels like when I look my husband in the eyes.”\n\n14. When she understood the simple joy of waking up every day to your kid\n\n“When I wake up in the morning, the best thing in the world is seeing her face,” Beyoncé told the NFL Network’s Super Bowl Live show in 2013. “She’s starting to talk. It’s just such a beautiful time in my life to have a child and every day see something new and see her learn something new.”\n\n15. When she accepted her post-baby body\n\nQueen Bey told Vogue in 2013 that she had “no shame” about her post-baby body.\n\n“I just feel my body means something completely different. I feel a lot more confident about it,” she said. “Even being heavier, thinner, whatever. I feel a lot more like a woman. More feminine, more sensual. And no shame.”\n\n16. When she confessed she wanted her kids to have normal childhoods\n\nBefore the twins were born, Beyoncé told Good Morning America in 2013 that she wanted more kids — and she hoped they could live as normal lives as possible despite the fame and fortune.\n\n“I would like more children. I think my daughter needs some company. I definitely love being big sister,” she said. “I am very protective. I just want to make sure that she can have a healthy, safe, normal life. In the back of my mind, she’s my priority. And life is completely different now. I feel really, really just lucky that I can still do what I love, and now have a way bigger meaning. And that’s to be her mother.”\n\n17. When she announced she was pregnant with twins\n\nThe most-liked Instagram photo of all time was Beyonce’s February 2017 post in which she revealed she was expecting twins.\n\n“We would like to share our love and happiness,” she wrote in a caption. “We have been blessed two times over. We are incredibly grateful that our family will be growing by two, and we thank you for your well wishes.”\n\n18. When she got real about her unplanned C-section\n\nThough her first labor and delivery seemed pretty blissful, the second was anything but, and Bey revealed in her September 2018 Vogue cover story that she had to have an emergency C-section with the twins.\n\n“I was swollen from toxemia and had been on bed rest for over a month. My health and my babies’ health were in danger, so I had an emergency C-section,” she said.\n\n19. When she gave herself time to recover the second time around\n\nThree months after Beyoncé had Blue, she was back to performing. But after the birth of Rumi and Sir, she realized how important it was to give her body time to recover, she said in the same Vogue interview.\n\n“After the birth of my first child, I believed in the things society said about how my body should look. I put pressure on myself to lose all the baby weight in three months, and scheduled a small tour to assure I would do it. Looking back, that was crazy,” she said.\n\n“I needed time to heal, to recover,” she added. “During my recovery, I gave myself self-love and self-care, and I embraced being curvier. I accepted what my body wanted to be… I was patient with myself and enjoyed my fuller curves. My kids and husband did, too.”\n\n20. When she really proved she’s just like us because she too has a post-baby “FUPA”\n\n\n\nBut perhaps our favorite part of the Vogue interview was Bey accepting her body’s imperfections — and admitting she’s got a “mommy pouch” and a FUPA (look it up) like the rest of us.\n\n“To this day my arms, shoulders, breasts and thighs are fuller. I have a little mommy pouch, and I’m in no rush to get rid of it. I think it’s real,” Beyoncé told the magazine. “Whenever I’m ready to get a six-pack, I will go into beast zone and work my ass off until I have it. But right now, my little FUPA and I feel like we are meant to be.”\n\n21. When she got real about ger life-threatening pregnancy\n\nIn her 2019 Netflix documentary, Homecoming, Bey opened up about how her difficult pregnancy with her twins almost cost her and one of her baby’s lives.\n\n“My body went through more than I knew it could. I was 218 pounds the day I gave birth. I had an extremely difficult pregnancy. I had high blood pressure. I developed toxemia, preeclampsia, and in the womb, one of my babies’ heart beats paused a few times, so I needed to get an emergency C-section,” she said.\n\n22. When she didn’t feel the same career-wise after her twins’ birth\n\nAfter her twins’ birth in 2017, Bey didn’t feel the same career-wise. In Homecoming, the singer opened up about how she felt less motivated to push herself in her career because of her newborn, which proved difficult when she was rehearsing non-stop for her Coachella 2018 performance.\n\n“My mind was not there,” she said. “My mind wanted to be with my children. People don’t see the sacrifice. I would dance and go off to the trailer and breastfeed the babies. The days I could I would bring the children.”\n\nA version of this story was originally published in September 2018.", "images": ["https://i1.wp.com/www.rollingstone.com/wp-content/uploads/2020/04/lizzo_togetherathome.jpg?quality=98&w=330#038;ssl=1", "https://pmchollywoodlife.files.wordpress.com/2019/05/models-who-dont-age-rex-ftr-1.jpg?quality=98&w=330", "https://www.sheknows.com/wp-content/uploads/2020/04/vanessa-kobe-bryant-1.jpg?w=445&h=250&crop=1", "https://www.sheknows.com/wp-content/uploads/2020/04/Kenneth-Armando.jpg?w=445&h=250&crop=1", "https://pmcvariety.files.wordpress.com/2020/04/taylorswift_01-e1587277738854.png?quality=98&w=330", "https://www.sheknows.com/wp-content/uploads/2020/04/Kobe-Gianna-Bryant.jpg?w=445&h=250&crop=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.sheknows.com&path=%2Fentertainment%2Farticles%2F1141016%2Fbeyonce-quotes-about-motherhood%2F&ct=article&lob=&loc=us&env=desktop&post_id=1141016", "https://www.sheknows.com/wp-content/uploads/2020/04/Reese-Witherspoon-2013-arrest.jpg?w=445&h=250&crop=1", "https://www.sheknows.com/wp-content/uploads/2018/10/oopswev7gzjagndcr6sc.png", "https://pmcspy.files.wordpress.com/2020/04/best-hangboards.jpg?quality=98&w=330", "https://www.sheknows.com/wp-content/uploads/2020/04/melissa-mccarthy-mark-wahlber-1.jpg?w=445&h=250&crop=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.sheknows.com/wp-content/uploads/2020/04/vanessa-kobe-bryant-anniversary-1.jpg?w=445&h=250&crop=1", "https://secure.gravatar.com/avatar/?s=150&d=mm&r=g", "https://www.sheknows.com/wp-content/uploads/2018/10/oopswev7gzjagndcr6sc.png?w=695&h=391&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://www.sheknows.com/wp-content/uploads/2018/10/oopswev7gzjagndcr6sc.png", "keywords": [], "authors": ["Haley Longman"], "canonical_link": "https://www.sheknows.com/entertainment/articles/1141016/beyonce-quotes-about-motherhood/", "title": "Best Beyonce Motherhood Quotes About Her Twins, Kids, Pregnancies – SheKnows", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0", "description": "Beyoncé remains totally relatable and honest with these select quotes about being a mother to her kids, Blue Ivy, Rumi and Sir Carter.", "generator": "WordPress 5.4", "author": "Haley Longman", "onesignal": "wordpress-plugin", "og": {"type": "article", "title": "Beyoncé's Quotes About Motherhood Are Everything", "url": "https://www.sheknows.com/entertainment/articles/1141016/beyonce-quotes-about-motherhood/", "description": "Here are 20 examples that will inspire you.", "site_name": "SheKnows", "image": {"identifier": "https://www.sheknows.com/wp-content/uploads/2018/10/oopswev7gzjagndcr6sc.png", "width": 1024, "height": 576, "alt": "Beyonce in front of black and gold background"}, "locale": "en_US"}, "article": {"published_time": "2019-06-05T14:45:00+00:00", "modified_time": "2019-06-05T15:01:11+00:00"}, "twitter": {"text": {"title": "Beyoncé's Quotes About Motherhood Are Everything"}, "image": {"identifier": "https://www.sheknows.com/wp-content/uploads/2018/10/oopswev7gzjagndcr6sc.png?w=1024", "alt": "Beyonce in front of black and gold background"}, "card": "summary_large_image", "site": "@SheKnows", "title": "Beyoncé's Quotes About Motherhood Are Everything", "description": "Here are 20 examples that will inspire you."}, "msapplication-TileImage": "https://www.sheknows.com/wp-content/uploads/2018/11/cropped-sk-favicon.png?w=270"}, "movies": ["https://www.youtube.com/embed/EhEnhNU3gVM?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/8E3XEdEXpvc?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/cIv1z6n3Xxo?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent", "https://www.youtube.com/embed/fB8qvx0HOlI?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": 1559745900.0, "source": "https://www.sheknows.com", "summary": ""}