{"url": "https://www.opb.org/news/article/everything-sucks-netflix-boring-oregon-interview/", "text": "Courtesy of Scott Patrick Green/Netflix\n\nOregon has been growing into a small powerhouse in the film and television industry, but no one could’ve predicted the state’s newest star: Boring, Oregon. Named after the pioneer William Harrison Boring, the unincorporated town is the site of the newest Netflix coming-of-age show, “Everything Sucks!”\n\nDrawing inspiration from ‘90s hallmarks like “10 Things I Hate About You,” “My So Called Life” and “Freaks and Geeks,” the show is a celebrations of all things ‘90s. The first episode’s opening montage alone features slap bracelets, pogs, hacky sack and arguing over whether the Star Wars reboot is going to be super cool or sacrilege. The soundtrack throughout the season will bring you back to your Columbia House subscription: Oasis, Gin Blossoms, Blues Traveler and Tori Amos.\n\nWe talked with the creators Ben York Jones and Mike Mohan and have distilled the conversation into 10 things we love about the show.\n\n1. While a celebration of the ‘90s, the show isn’t geared only toward the Zima generation.\n\nGrowing up in the ‘90s himself, creator Ben Jones says he loved watching the “Wonder Years,” which was about a boy his age living in the ‘60s. “I guess it seemed like a slightly different world, and that was fascinating to me as a kid, but ultimately it was a backdrop,” he said, adding that that’s their goal, too. “So for kids watching it today that weren’t even born in the ‘90s, it’ll feel like the olden days for sure, but hopefully that’s just a footnote to the emotional arc of the story.”\n\n2. “Everything Sucks!” features characters who would have never gotten their own show in the ‘90s, but should have.\n\nStep back to 1996, before Ellen came out, before “Will and Grace.” In that era, gay and lesbian characters and people of color were generally relegated to a supporting friend role in mainstream shows.\n\nNow, step into “Everything Sucks!,” where the main characters are Luke, a black boy, and Kate, a sophomore girl coming to terms with her attraction to other girls. Much of the show’s drama revolves around Luke’s crush on Kate, as it collides with Kate’s coming out process.\n\n“With the character of Luke, we thought about ourselves, and the fact that we were obsessed with girls, wear your heart on your sleeve — all these things that have nothing to do with race,” Mohan said. “So in terms of the question of ‘Why did you make him black?’ Really the question is ‘Why not?’”\n\n“That’s a little bit of the point, too, is to go and say here’s how we could’ve or should’ve done it,” Jones added. “And if that feels a little utopian, that’s OK by us. We’re presenting things as we would like to see them.”\n\nCourtesy of Scott Patrick Green/Netflix\n\n3. They get the ‘90s teenage coming-out experience right — in other words, we were totally at that Tori Amos concert.\n\nTori Amos, one of the most memorable artists to break out of the ‘90s, is used to incredible narrative effect. On the first day of class, Kate is wearing a Tori Amos t-shirt, and her description of what makes Amos great gives the first indication of things to come.\n\nLuke, trying to win Kate’s affection, eventually takes her to an Amos concert, where Kate spends the entire time staring at a happy lesbian couple dancing nearby. Actor Peyton Kennedy captures the lonely but hopeful longing of that moment with heart-breaking authenticity, and we should know: We were the closeted kid at that Tori Amos concert in the mid-‘90s staring at the happy queer couple nearby.\n\n“You can see everything that’s going on in [Kate’s] head on [Kennedy’s] face, even though she doesn’t have to say a word,” Mohan said. “I think that’s one of the things that’s miraculous about Peyton and her performance as an actor.” (Granted, Tori was way too big post-“Cornflake Girl” to ever play the Aladdin, where this scene was filmed. But the Rose Garden just doesn’t have the same charm.)\n\n4. While we’re on the subject of music: the soundtrack.\n\nRemember when you used to sign up your entire family for Columbia House or BMG Music, and if you schemed it right, you could get 20 CDs for the price of one? Well, half the bands you ordered probably have a song in the show. Some are timeless gems (Oasis’s “Wonderwall”), some are used to express thematic effect (Weezer’s “Pink Triangle” and The Verve Pipe’s “The Freshman”), and some make you thankful the ‘90s are long over (Deep Blue Something’s “Breakfast at Tiffany’s”).\n\n5. The fact that the actors capture all the awkwardness of the teen years with aplomb is all the more impressive given they weren’t even alive in an era where you passed notes instead of texted and had to bike to Blockbuster instead of logging in to Netflix.\n\nJones and Mohan recommended certain movies and bands to the young actors with which to familiarize themselves for the era, but they attribute the cast’s acting abilities to the performers’ own empathy.\n\nThere were, however, a few things lost in translation. Jones tells a story about the first time they filmed a scene in Luke’s room where actor Jahi Di’Allo Winston had to put a VHS tape in the VCR. “Mike calls action, and Jahi puts the tape into the VHS player backwards and is trying to shove it in,” Jones said. “’Cut! Cut! Cut! Jahi what’s going on?’ And he was like, ‘I don’t know how to do this. I’ve never put a tape in a VHS player.’ And instantly everyone on set felt ancient. That was just one example of how the ‘90s are pretty far in the past, especially for these kids, who’re born in the early 2000s.”\n\n6. The parents are real people.\n\nUnlike most teen shows from the ‘90s like “Saved by the Bell” and “My So-Called Life,” where the parents rarely made an appearance, Luke and Kate’s single parents are central to the show. Sherri and Ken, having lost their spouses to abandonment and death, respectively, suffer from the grown-up versions of the loneliness and insecurity that affects their children. But in a nice twist, while the kids flounder at romance, it’s the two parents who get to experience the anxiety of new love.\n\n“It was important for us that the parent characters have dimension and not simply be comedic foils to the kids like they are historically in a lot of high school shows,” Jones said.\n\n7. The show ended up in Boring by accident.\n\nJones and Mohan knew they wanted to set the show in a rural area. “When we were Googling images, we just looked up ‘boring suburb’ just because I needed a photo for when we were going to go into Netflix and pitch it to them,” Mohan recalled. “And we discovered the town of Boring, Oregon, and it just made us laugh.”\n\nThey put it in the pitch, thinking they’d film in Vancouver, British Columbia, and just call it Boring. But then they convinced Netflix to let them scout Oregon, and they discovered the strength of the local film community and the beauty of the area. “It’s just a beautiful place to set a show,” Mohan said. “The whole goal of the show is to make it as honest as possible, so you might as well just go with that authenticity.”\n\nCourtesy of Scott Patrick Green/Netflix\n\n8. For once, an Oregon TV show isn’t all about Portland.\n\nPortland has had more than its due of attention. While “Portlandia” is in its final season, the new HBO series “Here and Now” has picked up the torch, with excruciating attention to Portland details. (What are they having for lunch? Bunk Sandwiches. What wine are they drinking? A to Z. Donuts? You can guess.)\n\n“Everything Sucks!” wants none of that.\n\nApart from the Tori Amos concert filmed at the Aladdin Theater, “Everything Sucks!” is filmed almost exclusively around Oregon City, since Boring doesn’t have its own high school, with the effect of making it a stand-in for small towns everywhere.\n\nWhich isn’t to say there aren’t small local cameos that are all the more delightful for their subtlety, like the fact that one of the VHS tapes Luke’s film-loving father left behind is Gus Van Sant’s ode to Old Portland, “Drugstore Cowboys,” or that, when the show needed to film a scene at a Blockbuster in Los Angeles (which no longer exists), they could just go down the road to Sandy, Oregon, the site of one of the chain’s last remaining outposts.\n\n9. The jocks aren’t the bad guys.\n\nSince the dawn of VHS — if not before — seemingly every movie and show ever set in a high school has reserved the bad guy role for the jocks. For “Everything Sucks!,” it’s the drama club. Because let’s be honest, the jocks can’t be bothered with the A/V club. The thespians, on the other hand, are just one step up in the social ladder, meaning that they have all the more to gain for playing the villains (which, every actor knows, is always the best role anyway). Of course, that ‘90s can’t-we-all-just-get-along ethos wins out in the end, and the two join forces to make an over-the-top sci-fi film worthy of “Mystery Science Theater 3000.”\n\n10. There are plenty of possibilities for season two.\n\nThe season ends with both a certain level of satisfying resolution and a cliff-hanger — the perfect compromise for an unknown future.\n\n“We don’t have a season two yet, but if enough people watch it, we are hoping and praying that we can spend another summer in your beautiful state, hanging out with these kids and telling more stories with them,” Mohan said. “Because this show ends with a pretty big whopper cliffhangeranger, we are definitely hoping to honor it and do so in the most unexpected of ways. And that’s all we can say.”", "images": ["https://images3.opb.org/c_fill%2Ch_200%2Cq_90%2Cw_300/artsandlife_20170120_portlandia_augusta_quirk-ifc-2_azqg2t.jpg", "https://images1.opb.org/c_fill%2Ch_200%2Cq_90%2Cw_300/20200414-food-bank_1586884424166.jpg", "https://www.opb.org/s/chrome/footer/apm_logo.gif", "https://images5.opb.org/c_fill%2Cg_north_west%2Ch_300%2Cq_90%2Cw_400/news_20180303_everything-sucks_netflix3_d7nl1f.jpg", "https://images4.opb.org/c_fill%2Ch_200%2Cq_90%2Cw_300/20200316_oha-gov-brown-coronavirus_kd-12.jpg", "https://www.opb.org/s/chrome/logo-mobile.gif", "https://www.opb.org/s/chrome/logo-small.png", "https://www.opb.org/s/chrome/footer/prilogo.png", "https://www.opb.org/s/chrome/footer/bbclogo.gif", "https://images4.opb.org/c_fill%2Ch_200%2Cq_90%2Cw_300/haystack5_1532981123880.jpg", "https://www.opb.org/s/chrome/footer/pbslogo.png", "https://images2.opb.org/c_fill%2Cg_center%2Ch_200%2Cq_90%2Cw_300/781c548552c3daca645ed2136cd39426.jpg", "https://www.opb.org/s/images/television/programs/ofg/ofg-op-directions.png", "https://images2.opb.org/c_limit%2Cg_north_east%2Ch_1000%2Cq_90%2Cw_640/radio_20180303_everything-sucks_netflix_krjvqe.jpg", "https://www.opb.org/s/images/television/programs/ofg/ofg-op-map.png", "https://images2.opb.org/c_fill%2Ch_200%2Cq_90%2Cw_300/garlic_1587086951247.jpg", "https://images5.opb.org/c_fill%2Ch_200%2Cq_90%2Cw_300/artboard_1_copy_5__1_.png", "https://images5.opb.org/c_fill%2Ch_200%2Cq_90%2Cw_300/television_packer-1_e5gyar.jpg", "https://images1.opb.org/c_limit%2Cg_north_east%2Ch_1000%2Cq_90%2Cw_640/news_20180303_everything-sucks_netflix2_nccchh.jpg", "https://www.opb.org/s/images/television/programs/ofg/ofg-op-arrow-right.png", "https://www.opb.org/s/images/television/programs/ofg/ofg-op-photo.png", "https://www.opb.org/s/chrome/footer/nprlogo.gif", "https://images4.opb.org/c_limit%2Cg_north_west%2Ch_1000%2Cq_90%2Cw_640/news_20180303_everything-sucks_netflix3_d7nl1f.jpg", "https://www.opb.org/s/images/television/programs/ofg/op-logo-grey.png", "https://images2.opb.org/c_fill%2Cg_west%2Ch_200%2Cq_90%2Cw_300/20200320_kate-brown-covid_bp-7.jpg"], "top_img": "https://images5.opb.org/c_fill%2Cg_north_west%2Ch_300%2Cq_90%2Cw_400/news_20180303_everything-sucks_netflix3_d7nl1f.jpg", "keywords": [], "authors": ["Aaron Scott"], "canonical_link": "https://www.opb.org/news/article/everything-sucks-netflix-boring-oregon-interview/", "title": "10 Things We Love About Oregon’s Newest TV Show, ‘Everything Sucks!’ On Netflix", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1", "twitter": {"card": "summary_large_image", "creator": "@OPB", "title": "10 Things We Love About ‘Everything Sucks!,’ Oregon's Newest TV Show", "description": "<p>Filmed in Boring, Oregon, Netflix&rsquo;s newest show is a homage to the '90s. We have an exclusive interview with the creators.</p>", "image": {"src": "https://images4.opb.org/c_fill%2Cg_north_west%2Ch_348%2Cq_90%2Cw_620/news_20180303_everything-sucks_netflix3_d7nl1f.jpg"}, "site": "@OPB"}, "og": {"image": {"identifier": "https://images5.opb.org/c_fill%2Cg_north_west%2Ch_300%2Cq_90%2Cw_400/news_20180303_everything-sucks_netflix3_d7nl1f.jpg", "width": 400, "height": 300}, "title": "10 Things We Love About Oregon’s Newest TV Show, ‘Everything Sucks!’ On Netflix", "url": "https://www.opb.org/news/article/everything-sucks-netflix-boring-oregon-interview/", "description": "Filmed in Boring, Oregon, Netflix’s newest show is a homage to the '90s. We have an exclusive interview with the creators."}, "fb": {"pages": 17790154938, "app_id": 1635670063409263}, "google-site-verification": "KMaJ_LFRGDv_xknYuKImf3uF3H8gkUuIblN-HIVIjAM", "author": "Aaron Scott", "org_id": "OPB", "datePublished": "2018-03-02", "story_id": "None", "has_audio": 1, "category": "arts | arts | entertainment | oregon | nw-life |", "keywords": "arts | arts | entertainment | oregon | nw-life |", "wordCount": 1649, "sniply-options": "block"}, "movies": [], "publish_date": null, "source": "https://www.opb.org", "summary": ""}