{"url": "www.inquisitr.com/4975631/kim-kardashian-and-kanye-west-dont-have-a-secret-pact-to-fake-their-marriage-debunked/", "text": "Kim Kardashian and Kanye West have three children together and recently celebrated their fourth wedding anniversary. However, a new report claims that the couple known as “Kimye” have been faking their marriage for the public.\n\nAccording to a report by Gossip Cop, one tabloid claims to have sources that reveal Kim Kardashian and Kanye West have a “secret pact” to continue their relationship for the sake of their reputation, although they don’t really want to stay married to each other.\n\nThe outlet reveals that Woman’s Day in New Zealand claims that there is a “lack of love” between Kim and Kanye, despite their marriage and family. The pair have allegedly been faking their relationship “for the sake of their brand and their three children,” a source allegedly told the outlet.\n\n“Kim knows she needs Kanye and says they very much have a business relationship, which she’s hell-bent on continuing,” the magazine reports a Kardashian insider as saying.\n\nHowever, Gossip Cop claims that rumors simply are not true, and that more credible sources at People Magazine claim that Kim is a “very loyal wife” to Kanye, and recently very publicly defended him when many were questioning his mental heath due to a series of tweets he posted about the state of the country.\n\nWyoming A post shared by Kim Kardashian West (@kimkardashian) on May 27, 2018 at 12:21pm PDT\n\nAs previously reported by the Inquisitr, Kim Kardashian and Kanye West recently spent the Fourth of July together with their family in Idaho. The couple were reportedly looking to get some peace and quiet in the town of Coeur d’Alene, which has been a frequent celebrity hot spot, boasting recent guests such as Harry Styles, Wayne Gretzky, and Adam Levine.\n\nThe couple rented a $1.85 million cabin with four bedrooms, 4.5 bathrooms, and an amazing view of the water for their holiday getaway. Kim even took to her Instagram account to reveal that she and her friends were on a boat and gearing up to try wakeboarding for the first time, an activity that Kardashian later called harder than it looks.\n\nHowever, Kim Kardashian did not show off Kanye West on her social media account, only further debunking that she and the rapper have a pact to put on a fake marriage for the cameras. If anything, they are often the subject of divorce rumors due to comments made by West or the amount of time they go without being seen together in public.\n\nMost recently, the couple stepped out for a dinner date at Nobu in Malibu, and even rocked matching looks by wearing similar cargo pants and muted tones from Kanye’s Yeezy clothing line.", "images": ["https://secure.gravatar.com/avatar/5a1aab41ece6a274bcaecb11bc798ff5?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2018/06/Kim-Kardashian-Kanye-West-Divorce-Rumor.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Amanda Lynne"], "canonical_link": "https://www.inquisitr.com/4975631/kim-kardashian-and-kanye-west-dont-have-a-secret-pact-to-fake-their-marriage-debunked/", "title": "Kim Kardashian And Kanye West Don’t Have A Secret Pact To Fake Their Marriage [Debunked]", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}