{"url": "simple.wikipedia.org/wiki/Angelina_Jolie", "text": "Angelina Jolie ( ; née Voight, formerly Jolie Pitt, born June 4, 1975)[3] is an American actress, movie producer, screenwriter, and author. She is the daughter of Jon Voight,[4] who is also an actor and former actress/model Marcheline Bertrand. Her full name is Angelina Jolie Voight, but she decided to go by Angelina Jolie. She grew up in Los Angeles and attended the Lee Strasberg Theatre Institute. She began acting at about 12 years old, and since then has starred in many movies, including the Tomb Raider movies. She has also been in the movies Hackers, Gathering Evidence (U.S. title), and Gone in Sixty Seconds.\n\nEarly life [ change | change source ]\n\nShe was born in Los Angeles, California. She is the daughter of actors Jon Voight and Marcheline Bertrand. She is the sister of actor James Haven, niece of singer-songwriter Chip Taylor, and goddaughter of actors Jacqueline Bisset and Maximilian Schell. On her father's side, Jolie is of German and Slovak descent,[5][6] and on her mother's side, she is of primarily French Canadian, Dutch, and German ancestry.[5] Like her mother, Jolie has stated that she is part Iroquois,[7] although her only known Native American ancestor was a Huron woman born in 1649.[5]\n\nJolie played her first leading role in the 1993 movie Cyborg 2. In 1999 Jolie played Lisa Rowe in Girl, Interrupted.\n\nShe was awarded an honorary damehood by the British government in 2014 in recognition of her work in preventing sexual violence. She was presented with the award by Queen Elizabeth II.[8] As an American citizen, she cannot be called \"Dame Angelina\", but she can use the letters \"DCMG\" after her name.\n\nShe won an Academy Award for Best Supporting Actress for her performance in Girl, Interrupted.\n\nMarriage and family [ change | change source ]\n\nJolie self-identifies as bisexual.[9] She has been married to Jonny Lee Miller and Billy Bob Thornton.\n\nShe has three adopted children. She lives with actor Brad Pitt. Pitt and Angelina are called 'Brangelina' by the media. They have three biological children. On May 27, 2006, Jolie gave birth to a girl, Shiloh. In 2008, she also gave birth to twins, Vivienne Marcheline and Knox Leon.[10] On August 28, 2014, Jolie married Pitt in France. In September 2016, they separated and she filed for divorce. Jolie is currently battling for full custody of her six children.\n\nPersonal life [ change | change source ]\n\nShe said in May 2013 that she had undergone a preventive double mastectomy after learning she had an 87% risk of getting breast cancer. Jolie has a defective BRCA1 gene resulting in a very high risk of breast cancer and ovarian cancer. Jolie said she might have her ovaries removed to prevent cancer.", "images": ["http://simple.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://simple.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png", "https://upload.wikimedia.org/wikipedia/commons/a/ad/Angelina_Jolie_2_June_2014_%28cropped%29.jpg", "http://simple.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Angelina_Jolie_2_June_2014_%28cropped%29.jpg/220px-Angelina_Jolie_2_June_2014_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Wikiquote-logo-en.svg/40px-Wikiquote-logo-en.svg.png", "http://upload.wikimedia.org/wikipedia/commons/3/37/Dagger-14-plain.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/a/ad/Angelina_Jolie_2_June_2014_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://simple.wikipedia.org/wiki/Angelina_Jolie", "title": "Simple English Wikipedia, the free encyclopedia", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/a/ad/Angelina_Jolie_2_June_2014_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "http://simple.wikipedia.org", "summary": ""}