{"url": "https://www.chicagotribune.com/entertainment/tv/ct-this-is-us-jacks-death-clues-20180117-story.html", "text": "Most of us didn't sign up for a whodunit when we began watching NBC's \"This Is Us,\" but it's sort of turning into one. The big, gaping plot hole that the show builds around is just how perfect-specimen-of-a-dad Jack Pearson met his maker.\n\n\"Before this season is over we will see how Jack Pearson dies,\" Sterling K. Brown said on the Golden Globes red carpet. Then Milo Ventimiglia on Saturday told Us Weekly the cause of Jack's death would be revealed \"very, very, very, very soon.\"\n\nWhile Tuesday's episode didn't completely divulge the backstory, it did reveal one more crucial piece of information. (Spoilers ahead!)\n\nIn the beginning of \"Clooney,\" Rebecca (Mandy Moore) and Jack (Ventimiglia) list items they need to buy at the mall -- batteries for Rebecca, a suit for Jack -- in what turns into quite the dramatic trip. Then off they go! Teenage Kate has a meltdown in a fitting room. Teenage Kevin drowns his injury-related sorrows with chicken wings then gets teary-eyed with dad. Teenage Randall asks a girl out using the ol' personalized Magic 8-ball trick (the kid's a genius).\n\nBack at home, Rebecca and Jack share a heartfelt moment after all that heavy-duty parenting. All seems well. Then Rebecca asks Jack if they forgot anything at the mall. Nope, he doesn't think so. Suddenly, we cut to a close-up shot of the smoke detector.\n\nNO. NO. NO.\n\nRebecca had told Jack not to let her forget the batteries. Then they both forgot. Combine this with what we've learned so far, and the pieces are clearly falling into place.\n\nJack's death was so traumatic that the family, in present day, can't talk about it. Heck, Kate hasn't even told the man she's going to marry what exactlyhappened. So the importance to the \"This Is Us\" story rests not just with the actual manner of Jack's death, but the circumstances surrounding it. The Rebecca-battery connection is one more addition to this.\n\nHere's a rundown of what we've learned about Jack's death so far, in chronological order by episode:\n\nSeason 1, Episode 5: \"The Game Plan\"\n\nCan you even remember a time before you realized Jack wasn't still alive? Well, this major plot point wasn't revealed until five episodes in, when Kate tells Toby that she likes to watch the Steelers games at home alone with her dad. Her dad, in this case, being the urn of his ashes she keeps on her mantle.\n\nSeason 1, Episode 6: \"Career Days\"\n\nKevin inadvertently crashes a memorial service, and ends up talking with the man's widow about her 15-year-old son. During the conversation, he reveals he used to build model planes and boats with Jack -- \"I used to pick the most complex ones,\" Kevin explains, \"because they took the longest. I was one of three kids so you really had to strategize to get your alone time with dad.\"\n\nWhile the pair eventually had a fleet of models, Kevin threw them all away after Jack died. \"I threw every one of them away, and I don't know why I did that,\" Kevin says. When asked how old he was, he simply responds, \"It was a long time ago.\"\n\nKevin points to his necklace as belonging to Jack's. \"It's the only thing I have left of him.\" It's a detail that maybe didn't fully register with viewers this early in the series, but it became clearer in Season 2.\n\nSeason 1, Episode 13: \"Three Sentences\"\n\nThis is the first time we get a sense of when Jack died. This episode ends with scenes from Jack's funeral, including Rebecca and her kids mourning. Kate, Kevin and Randall are clearly teenagers.\n\nSeason 1, Episode 17: \"What Now?\"\n\n\"You remember when I told you I couldn't talk about my dad's death?\" Kate tells Toby. \"Well, that's because it's my fault ... I'm the reason that he's dead.\"\n\nWhen she says these words, the flashback cuts to Jack thanking Kate for encouraging him to surprise Rebecca at an out-of-town gig. We're sort of led to believe that maybe something horrible happens on this trip. But we later discover that isn't the case, so Kate's feelings of guilt remain a mystery to viewers.\n\nSeason 2, Episode 1: \"A Father's Advice\" OK.\n\nThis is the big one when we see the immediate aftermath of Jack's death.\n\nRebecca is driving while wearing a Steelers jersey (the team, if you remember, are pretty important in Jack and Rebecca's relationship). The passenger seat holds a plastic bag with a few things presumably belonging to Jack: a watch, a set of keys, an American flag key chain, a wedding ring and a notebook. The items all seem unscathed and undamaged.\n\nThe kids, meanwhile, are at Miguel's house. Kate cries into her dog, and Randall weeps while holding the hand of a redheaded girl. Miguel, teary-eyed, shows up with linens and says he's going to find pillows.\n\n\"We have to find Kev,\" a crying Kate tells Randall. \"He needs to hear it from me.\" Kevin, meanwhile, is shown in his letterman jacket, with a cast and on crutches, kissing a girl (Sophie, the love of his life, right?).\n\nThen we cut back to Rebecca pulling over to the side of a road. She looks at the red mailbox reading \"Pearson,\" and the house completely gutted by a fire, and loses all composure, yelling and beating the steering wheel. The caution tape is still up, and a few firefighters assess the scene.\n\nSeason 2, Episode 8: \"Number One\"\n\nIt doesn't seem much is left of Jack, physically. Kevin has a meltdown when he realizes, in his rush to get more painkillers, he's likely left his father's necklace at the home of the woman he just slept with and walked out on after stealing her prescription pad.\n\n\"That necklace is the only thing I have left in my life from my dad,\" Kevin cries out in desperation. \"It's the only thing I have.\"\n\nSeason 2, Episodes 8, 9 and 10: \"Number One,\" \"Number Two,\" \"Number Three\"\n\nWe see the same day replay in these three episodes, including the lights cutting out in the Pearson house.\n\n\"Jack! Fuse!\" Rebecca cries out. \"Yup, I'm working on it,\" Jack yells back. Rebecca puts lit candles all around the house. Once the lights kick back up, Jack says, \"I think the power's gonna hold.\"\n\nCould it be a case of faulty wiring that burned the house down? Or all those candles? Or something else? And if so, why would Jack die in the house fire?\n\nSeason 2, episode 12: \"Clooney\"\n\nAs noted above, in this episode we're left with what feels like a big detail: The smoke detector needed replacement batteries.", "images": ["http://www.trbimg.com/img-5d055333/turbine/ct-jumble-daily/70/70x70", "http://www.trbimg.com/img-5d55b853/turbine/ct-crossword-latimessunday/70/70x70", "https://www.trbimg.com/img-5a5f8a70/turbine/ct-this-is-us-jacks-death-clues-20180117", "http://www.trbimg.com/img-5a7203a0/turbine/ct-jumble-sunday/70/70x70"], "top_img": "https://www.trbimg.com/img-5a5f8a70/turbine/ct-this-is-us-jacks-death-clues-20180117", "keywords": [], "authors": ["Elahe Izadi"], "canonical_link": "https://www.chicagotribune.com/entertainment/tv/ct-this-is-us-jacks-death-clues-20180117-story.html", "title": "'This Is Us' just revealed a major clue about Jack's death; here's everything we know so far", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0, user-scalable=no", "x-servername": "i18prod-d90d6c5-13-116.1", "robots": "index,follow", "author": "Elahe Izadi", "date": "2018-01-17", "copyright": "Copyright (c) 2020 Washington Post", "Description": "Most of us didn't sign up for a whodunit when we began watching NBC's \"This Is Us,\" but that's what the series is turning into.", "news_keywords": "this is us, jack's death, how does jack die", "fb_title": "'This Is Us' just revealed a major clue about Jack's death; here's everything we know so far", "og": {"title": "'This Is Us' just revealed a major clue about Jack's death; here's everything we know so far", "description": "Most of us didn't sign up for a whodunit when we began watching NBC's \"This Is Us,\" but that's what the series is turning into.", "type": "article", "url": "https://www.chicagotribune.com/entertainment/tv/ct-this-is-us-jacks-death-clues-20180117-story.html", "image": "https://www.trbimg.com/img-5a5f8a70/turbine/ct-this-is-us-jacks-death-clues-20180117", "site_name": "chicagotribune.com"}, "fb": {"app_id": 306836229411287, "pages": 745745225518281}, "twitter": {"card": "summary_large_image", "site": "@chicagotribune"}, "googlebot": "index", "googlebot-news": "index", "article": {"content_tier": "metered"}, "apple-itunes-app": "app-id=383137151, app-argument=http://www.chicagotribune.com/deeplinkid/95683084"}, "movies": [], "publish_date": 1516118400.0, "source": "https://www.chicagotribune.com", "summary": ""}