{"url": "https://www.inquisitr.com/5102935/chrissy-teigen-luna-instagram-video-sassy/", "text": "Chrissy Teigen is one of the most loved celebrities on social media. Her quick-witted tweets and hilarious captions always seem to entertain her fans. However, in Chrissy’s most recent video, her daughter steals the whole show. Chrissy posted the video to her Instagram to share her daughter’s antics with her 20.5 million followers Thursday night. In the video, mom Chrissy sits on a chair with her two little ones on her lap while another woman (presumably a close friend or family member) sits off to the side. Miles, the baby boy Chrissy Teigen and John Legend welcomed earlier this year, sits quietly as the three ladies around him discuss. “Hey guys, welcome to our YouTube channel,” the star jokes. Chrissy is poking fun at the YouTube community where some popular users are known for having more or less the same opening.\n\nIn the video, Luna becomes argumentative after her mother says her name. “Don’t say me!” Luna cries out, as she kicks her feet. Chrissy encourages her daughter’s voice by complying and omitting her name throughout the rest of the short clip, referring to her daughter as the “girl in the blue dress.” It’s not really clear where the video is going, as Luna continues to make it very clear that she does not want her name in the video. It’s hilarious to watch Chrissy Teigen, whose Twitter is full of sassy quips, be out-sassed by her toddler.\n\nAs reported by People, there’s also a video from earlier this year of Luna telling her father, singer John Legend, to stop singing despite his golden voice.\n\nChrissy Teigen loves her children but she also goes beyond that. She appears to respect them. While Luna’s request to have her name omitted may have just been a classic stubborn toddler stunt, Chrissy made sure she listened and complied with the little girl who was demanding privacy. Chrissy has another post in which she reveals Luna doesn’t have to smile if she doesn’t want to and that she “shouldn’t listen” to those who tell her to.\n\nA lot of people love and comment on Chrissy’s parenting style the way it appears on social media. Luna is relatively well-behaved in public but it’s clear she knows how to use her own voice and does what makes her comfortable. Miles is still too young to assert himself in the way that Luna does, but Chrissy is bound to raise and respect her two children the same way.\n\nNot only is Chrissy’s take on parenting super balanced, but it’s also refreshingly real. The star often posts pictures on social media that other celebrity parents don’t. A post from earlier this year was captioned with Teigen’s thought process for posting a picture and it reflected the struggles of photographing children perfectly.", "images": ["https://secure.gravatar.com/avatar/8c3e29c3d8d3e4c0e0a314248094392c?s=250&d=mm&r=g", "https://cdn.inquisitr.com/wp-content/uploads/2018/10/Chrissy-Luna-John.png", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png"], "top_img": "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Megan Russell"], "canonical_link": "https://www.inquisitr.com/5102935/chrissy-teigen-luna-instagram-video-sassy/", "title": "Chrissy Teigen Posts Hilarious Video That Proves Her Daughter Luna Is Just As Sassy As She Is", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}