{"url": "https://www.hollywoodreporter.com/live-feed/james-corden-hosts-avengers-infinity-war-cast-tour-around-los-angeles-1106488", "text": "On Thursday’s episode of The Late Late Show, James Corden introduced a new faux career venture: James Corden’s The Star Star Tours, which he joked would take celebrities around Los Angeles. The stars of Marvel Studios’ Avengers: Infinity War boarded a bus for the company's inaugural tour.\n\nTom Hiddleston was the first castmember to arrive. After Hiddleston introduced himself, a quiet Corden responded, “I’m sorry, I just got lost in your eyes.”\n\nPaul Bettany, Chris Pratt, Benedict Cumberbatch, Pom Klementieff, Zoe Saldana, Winston Duke, Sebastian Stan, Letitia Wright, Elizabeth Olsen, Don Cheadle, Anthony Mackie and Josh Brolin then all boarded the bus one by one to join Hiddleston on the tour. “This is more stars than I could have dreamt of,” declared Corden during the boarding process.\n\nWhile welcoming the group to the tour, Corden stated that flash photography was allowed. “Just make sure you tag me in all the photos,” he said. The host added, “Weapons are prohibited on the bus. That includes firearms, mace, war hammers, Vibranium and Infinity Gauntlets.”\n\nCorden then checked that everyone was wearing sunscreen before assigning Cumberbatch and Pratt to apply sunscreen to his own legs.\n\nThe first stop on the tour was a local Coffee Bean. “That is where, when you shout out of a room, ‘Can someone get me a coffee?’ someone will run down to a shop very similar to that, and they will physically go in, wait in line and bring you back the coffee,” Corden explained to the actors.\n\nThe next planned activity was a sing-along led by bandleader Reggie Watts. \"I like outer space, looking at alien races. Utilizing energy weapons,” the group sang in unison following Watts’ lead. “If somebody attacks me, I have the skills to defend myself. And if somebody doubts me ... Well, that's too bad for them, because they gonna die.\"\n\nThe actors then stopped to take pictures and learn about places like Barbra Streisand’s alleged holiday home and a popular brunch spot.\n\nBrolin asked the tour guide if he could stop to use the bathroom, to which Corden explained an exclusive bathroom privilege that the actor did not yet have. “The problem with that, Josh, is, as rules on the Star Tours, you have to have appeared in three or more Marvel movies to use the bathroom. End-credit scenes don’t count.”\n\nCorden then tried to get the scoop on the latest Marvel spoilers by asking if anyone on the bus dies in the next Avengers movie. After a moment of silence, Bettany shouted, “Snitches end up in ditches!”\n\nThe actors eventually made a pit stop at Golden Apple Comics, where they greeted fans, signed comic books and took pictures. As the Avengers stars were busy talking with fans, Corden stood by a Peter Rabbit poster, eagerly waiting for someone to ask for his autograph.\n\nOnce the group got back on the tour bus, Watts and Corden led another sing-along. “We save the world. We are Avengers. We’ll probably be doing these movies till we have dentures,” they sang. “Yeah, we’re hoping to escape without a scratch. We must protect the pretty face of Cumberbatch.”\n\nAs Corden wrapped up the tour, a very late Chris Hemsworth boarded the bus and tried to join. As his co-stars got off the bus, Corden reluctantly agreed to give the tour all over again for the tardy star.", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2017/02/thanos_glove_avengers_infinity_war.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2016/05/gettyimages-510455694-h_2016.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/01/greg_berlanti_sharon_horgan_alex_kurtzman_and_dwayne_johnson_-_getty_-_h_2020.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2017/02/colbert_never_fjorget.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/03/mrs._america_-_publicity_still_1-_h_2020_.jpg", "https://cdn1.thr.com/sites/default/files/2018/04/112593_167bc-h_2018_0.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/blogicon_livefeed-black2.png"], "top_img": "https://cdn1.thr.com/sites/default/files/2018/04/112593_167bc-h_2018_0.jpg", "keywords": [], "authors": ["Katherine Schaffstall", "Thrnews Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/live-feed/james-corden-hosts-avengers-infinity-war-cast-tour-around-los-angeles-1106488", "title": "James Corden Hosts 'Avengers: Infinity War' Cast on Tour Around Los Angeles", "meta_data": {"viewport": "width=device-width", "description": "The 'Late Late Show' host's tour included a stop at a comic book store full of Marvel fans.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/live-feed/james-corden-hosts-avengers-infinity-war-cast-tour-around-los-angeles-1106488", "domain": "https://www.hollywoodreporter.com/", "title": "James Corden Hosts 'Avengers: Infinity War' Cast on Tour Around Los Angeles", "description": "The 'Late Late Show' host's tour included a stop at a comic book store full of Marvel fans.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2018/04/112593_167bc-h_2018_0.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "James Corden Hosts 'Avengers: Infinity War' Cast on Tour Around Los Angeles", "description": "The 'Late Late Show' host's tour included a stop at a comic book store full of Marvel fans.", "url": "https://www.hollywoodreporter.com/live-feed/james-corden-hosts-avengers-infinity-war-cast-tour-around-los-angeles-1106488", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2018/04/112593_167bc-h_2018_0.jpg", "width": 1280, "height": 722, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "James Corden Hosts 'Avengers: Infinity War' Cast on Tour Around Los Angeles", "sailthru.description": "The 'Late Late Show' host's tour included a stop at a comic book store full of Marvel fans.", "sailthru.author": "Katherine Schaffstall", "sailthru.channel": "Live Feed", "sailthru.vertical": "Live Feed", "sailthru.date": "2018-04-27 11:33:35", "sailthru.tags": "Live Feed, Movies, Television, Chris Hemsworth, James Corden, Josh Brolin, Tom Hiddleston, Avengers: Infinity War, The Late Late Show, Late-Night TV"}, "movies": [], "publish_date": 1524800015.0, "source": "https://www.hollywoodreporter.com", "summary": ""}