{"url": "https://www.cbc.ca/books/6-things-that-inspired-margaret-atwood-s-alias-grace-1.4302863", "text": "Alias Grace, which was originally published in 1996, is based on the true story of Grace Marks, a young Irish immigrant and servant in Upper Canada who finds herself accused of murdering her employer in 1843. A CBC and Netflix original production, the miniseries was written and produced by Sarah Polley, directed by Mary Harron, and won the Canadian Screen Award for best limited series.\n\nNeed to know more about Alias Grace? Atwood spoke to CBC twice about the novel in 1996: on the TV program Midday (which you can watch above) and the CBC Radio program Morningside (which you can listen to at the bottom of this post).\n\nHere are six things that inspired the classic novel.\n\n1. The writings of Susanna Moodie\n\nAlias Grace represents Atwood's fascination with the tale after reading author Susanna Moodie's account of the murders in the 1853 book, Life in the Clearing. Moodie, best known for Roughing it in the Bush, wrote about Marks' case in Life in the Clearing, although many of the details Moodie reported were later revealed to be inaccurate.\n\nAtwood read Life in the Clearing while she was a student at Harvard University. \"I was intrigued... the report of it that I first read was Susanna Moodie's book Life in the Clearing. Moodie recounts seeing Marks in the Kingston penitentiary, she then takes the occasion to tell the whole account.\"\n\nAtwood has been intrigued by the story ever since. In fact, she penned a play called The Servant Girl and based on Susanna Moodie's version of the Grace Marks first. The play was filmed for CBC-TV and released in 1974, 22 years before Alias Grace was published.\n\n2. The known facts of the 19th century case\n\nIn 1843, Irish immigrant and teenager Grace Marks was sentence to life in prison for murdering her wealthy employer Thomas Kinnear and his pregnant housekeeper and mistress Nancy Montgomery. James McDermott, a stable hand, was also convicted for the murders and was hanged. Due to the sensational details of the case, as well as the fact that she was beautiful, Marks drew wide attention and became a polarizing public figure. Thirty years after her conviction, Marks was pardoned and released from Kingston Penitentiary. In Alias Grace, Atwood draws out the tantalizing \"did she or didn't she?\" question that once fixated the public.\n\nWhen writing the historical novel, Atwood wanted to avoid bending the facts to create her narrative. As a result, Alias Grace is grounded in as much truth as she could find — the newspaper quotes and excerpts at the beginning of the book chapters were taken from real sources. \"If you're dealing with things that actually are known, you can't arbitrarily change that to suit yourself,\" Atwood said.\n\n3. Grace Marks, Karla Holmolka and how society views female criminals\n\nThe trial of Paul Bernardo and Karla Homolka were happening around the same time Atwood was writing Alias Grace. While Atwood didn't follow the trial all that closely, she was fascinated by how the public reacts to female criminals differently than male criminals.\n\n\"In murders in which there are a man and a woman involved, public opinion usually goes in the following fashion: everybody is agreed on the man but opinion is usually split about the woman. One side: 'She instigated it all. She's the female demon.' The other side: 'She is an innocent victim coerced by force, circumstance and fear',\" Atwood said to CBC. \"That's how it split on Karla and it was certainly how it spilt on Grace.\"\n\n4. The power of dreams and repressed memories\n\nAtwood was fascinated by the concept of dreams and the subconscious; dreaming plays a major role in Alias Grace. Dreams, repressed memories, hypnosis and the human mind all play key components of the compelling story.\n\n\"This novel is set in the Victorian period, a period this you might say is the period of dreams. It's when they become very important. I think dreams are part of people's lives — and if you are going to show a character you have to show their dreams. There was a huge interest into the workings of the mind (at that time).\"​\n\n5. How history repeats itself\n\nThe 19th century story of Grace Marks says a lot of about today's class society, according to Atwood. \"We are hurtling back towards the 19th century. We seem to be making choices with a small class of very rich people and a large class of very poor people whose labour will therefore be very cheap. In the first part of the 21st century, there was an attempt to get away from that — but now we seem determined to go back to it. We should as people have a good look at how it played out then and whether we really want to (go back).\"\n\n6. How we tell stories\n\nAtwood is a storyteller (Alias Grace was her ninth novel when it came out in 1996) and she's interested in not only telling stories, but why and how we tell stories. \"The novel is partly about stories, how they are constructed, how they are influenced by the circumstances surrounding them: who is telling, who is listening, and why.\"\n\nIn fact, readers should keep that in mind when reading the book and deciding whether Grace is innocent or guilty. \"She's telling the story to somebody who might help her get out. And if you were in that position, and you were talking to someone who might help you get out, what sort of light would you represent yourself in?\"\n\nAtwood has come to her own conclusion on the guilt or innocence of Grace Marks. But she's not telling anyone.\n\n\"The maddening thing about history is that it can leave out the things you most want to know,\" she said. \"[But] I haven't concealed any hidden piece of evidence that tells all.\"", "images": ["https://www.cbc.ca/a/static/media/logo_cbc-radio-canada.svg", "https://i.cbc.ca/1.4344276.1507316035!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/frontpagealiasgrace1.jpg"], "top_img": "https://i.cbc.ca/1.4344276.1507316035!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/frontpagealiasgrace1.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.cbc.ca/books/6-things-that-inspired-margaret-atwood-s-alias-grace-1.4302863", "title": "6 things that inspired Margaret Atwood's Alias Grace", "meta_data": {"viewport": "width=device-width, initial-scale=1", "og": {"site_name": "CBC", "url": "https://www.cbc.ca/books/6-things-that-inspired-margaret-atwood-s-alias-grace-1.4302863", "title": "6 things that inspired Margaret Atwood's Alias Grace | CBC Books", "image": "https://i.cbc.ca/1.4344276.1507316035!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/frontpagealiasgrace1.jpg", "description": "In honour of the award-winning adaptation, here is a look at some of the influences Atwood had when writing the novel.", "locale": "en_US", "type": "article"}, "fb": {"pages": 50566954493}, "vf": {"section": "2.7415", "unique_id": "1.4302863"}, "google-site-verification": "pJy_QmRvDz2tr7X8eQ6Y1L3Se-8RWM_PpJX42Pr_fYo", "twitter": {"site": "@cbc", "player": {"width": 640, "height": 360}, "card": "summary_large_image"}, "description": "In honour of the award-winning adaptation, here is a look at some of the influences Atwood had when writing the novel."}, "movies": [], "publish_date": null, "source": "https://www.cbc.ca", "summary": ""}