{"url": "https://comicbook.com/starwars/2017/06/21/han-solo-director-kyle-newman-star-wars/", "text": "The fate of the upcoming Han Solo spin-off film is currently unknown, as a surprise announcement came late on Tuesday that revealed directors Phil Lord and Chris Miller were leaving the film with three weeks left of filming. Although their successor has yet to be named, Star Wars fanboy and filmmaker Kyle Newman threw his hat into the ring and even offered to take a massive pay cut to bring the film to completion.\n\nWhen people began suggesting he take over the reins on Twitter, Newman replied with a string of replies to various different accounts. His message on the matter is as follows:\n\n\"I'm available. To be honest, I'd kill it. Was born for it. And know Solo inside out. And am free. As in I would cost zero dollars. I'm not shiny and new. But goddamn could I direct the f**k out of some Star Wars. I have my doctorate in it after all. No fear. Only adrenaline. If it's Star Wars, then I'm your guy. Period. I know Solo inside and out. You'd enjoy my Han Solo radio dramas recorded live at the past three domestic SW Celebrations. I truly feel like I'm wasting my life NOT working on Star Wars in some capacity. I would go supernova and blow people's minds.\" The filmmaker then noted, \"It could be a great film and will be a great film.\" He also made sure to commend Lord and Miller, saying, \"Those guys are great and their DNA will still be all over it.\"\n\nUP NEXT: More Possible Han Solo Replacement Directors Named Not wanting to hog all the attention himself, Newman also suggested that Dave Filoni, director of the Clone Wars animated series and executive producer of Star Wars Rebels, could finish the production.\n\nA huge force in the fan community, Newman has made multiple projects that honor the saga, from the Fanboys film starring Kristen Bell and Dan Fogler about fans trying to break into Lucasfilm to see Phantom Menace before it was released to a variety of live stage shows at conventions and documentaries. MORE NEWS: Han Solo Directors Reportedly Fired After Clashing With Kathleen Kennedy \"Phil Lord and Christopher Miller are talented filmmakers who have assembled an incredible cast and crew, but it’s become clear that we had different creative visions on this film, and we’ve decided to part ways. A new director will be announced soon,\" Kathleen Kennedy said in a statement.\n\nLord and Miller also released a statement, saying, \"Unfortunately, our vision and process weren’t aligned with our partners on this project. We normally aren’t fans of the phrase ‘creative differences’ but for once this cliché is true. We are really proud of the amazing and world-class work of our cast and crew.\" The untitled Han Solo movie will be in theaters May 25, 2018.\n\nAlden Ehrenreich stars as a young Han Solo and Joonas Suotamo as Chewbacca in the era before Star Wars: A New Hope, before they met Leia and Luke and embarked on a galaxy-saving adventure. Donald Glover also stars as Lando Calrissian, with Woody Harrelson, Thandie Newton, Phoebe Waller-Bridge, and Emilia Clarke in as-yet-unrevealed co-starring roles.", "images": ["https://media.comicbook.com/2017/06/kyle-newman-jaime-king-star-wars-1004052-640x320.jpg", "https://media.comicbook.com/2017/01/aldenehrenreich-headshot-224523-160x240.jpg", "https://www.gamespot.com/bundles/phoenixsite/images/core/loose/logo-gamespot-clear.png", "http://asset.comicbook.com/img/comicbook/comicbook-logo-1a.png"], "top_img": "https://media.comicbook.com/2017/06/kyle-newman-jaime-king-star-wars-1004052-640x320.jpg", "keywords": [], "authors": [], "canonical_link": "https://comicbook.com/starwars/2017/06/21/han-solo-director-kyle-newman-star-wars/", "title": "Kyle Newman Offers To Direct Han Solo Film For Free", "meta_data": {"description": "The fate of the upcoming Han Solo spin-off film is currently unknown, as a surprise announcement came late on Tuesday that revealed directors Phil Lord and Chris Miller were leaving the film with three weeks left of filming. Although their successor has yet to be named, Star Wars fanboy and [...]", "keywords": "Solo: A Star Wars Story,Han Solo,Star Wars,Phil Lord,Chris Miller", "news_keywords": "Solo: A Star Wars Story,Han Solo,Star Wars,Phil Lord,Chris Miller", "twitter": {"card": "summary", "site": "ComicBook", "creator": "ComicBook", "title": "Kyle Newman Offers To Direct Han Solo Film For Free", "description": "The fate of the upcoming Han Solo spin-off film is currently unknown, as a surprise announcement [...]", "image": "https://media.comicbook.com/2017/06/kyle-newman-jaime-king-star-wars-1004052-640x320.jpg"}, "og": {"title": "Kyle Newman Offers To Direct Han Solo Film For Free", "type": "article", "url": "https://comicbook.com/starwars/2017/06/21/han-solo-director-kyle-newman-star-wars/", "image": {"identifier": "https://media.comicbook.com/2017/06/kyle-newman-jaime-king-star-wars-1004052-640x320.jpg", "width": 640, "height": 320}, "site_name": "Star Wars", "description": "The fate of the upcoming Han Solo spin-off film is currently unknown, as a surprise announcement [...]"}, "fb": {"app_id": 231517050198188, "pages": 1075190092524035}, "p": {"domain_verify": "5ad45d41467dc74340d8100ffa0f2a73"}, "google-site-verification": "x7hVrjifSfYWJfj0-FWACv2DSoXFbHhXgJ62RjFIkgs", "viewport": "width=device-width, initial-scale=1, maximum-scale=5,user-scalable=0"}, "movies": [], "publish_date": 1497974400.0, "source": "https://comicbook.com", "summary": ""}