{"url": "www.independent.co.uk/news/people/dame-judi-dench-battles-failing-eyesight-but-says-stop-telling-me-to-retire-9856849.html", "text": "Dame Judi Dench is battling failing eyesight which has left her unable to read scripts. But the actress has said she is driven “spare” by people asking when she will retire because she has no intention of leaving the stage.\n\nThe 79-year-old was diagnosed with macular degeneration, which can lead to blindness, several years ago.\n\nShe stars opposite Dustin Hoffman, 77, in a BBC1 Christmas adaptation of Roald Dahl’s Esio Trot, the touching story of a faltering love affair between two lonely pensioners.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nSpeaking at a screening of the film in central London, Dame Judi issued a plea for the capacities of older people not to be ignored. The Oscar-winner said: “It drives me absolutely spare when people say 'Are you going to retire?' or ‘Don’t you think it's time you put your feet up?’ or tell me my age.\n\n“I loathe it. I don’t want to be told that I'm too old to do something; I want to try it first and then, if I don't succeed, then I can be told I can't do it.\n\n“Otherwise, because you get to a certain age, it's ‘Oh well, you mustn't do that because you might have a fall or you can’t learn the lines or you can’t see’. Let me have a go. Let us all have a go.”\n\nDame Judi’s macular degeneration, an age-related condition that leads to a gradual loss of vision, which her mother also had, has left her struggling to watch films.\n\nShe is currently shooting The Hollow Crown, a BBC adaptation of Shakespeare’s history plays and will next be seen in a sequel to The Best Exotic Marigold Hotel and a much-delayed adaptation of Deborah Moggach’s novel Tulip Fever.\n\nIn Esio Trot, Dame Judi plays a flamboyant widow who is the object of tongue-tied bachelor Mr Hoppy’s (Hoffman) affections, but who only has eyes for her pet tortoise Alfie.\n\nThe story was adapted for the screen by Richard Curtis, whose hits include Four Weddings And A Funeral and Notting Hill.\n\nMr Curtis, famed for his romantic comedies starring Hugh Grant, said he thought the pair of elderly lovers in the story were the “couple most likely to stay together” out of all the characters in his films.\n\nCurtis wrote the screenplay with Paul Mayhew-Archer, with whom he co-created the hit comedy The Vicar of Dibley. Mr Mayhew-Archer disclosed at the screening that he began working on the screenplay, shortly after being diagnosed with Parkinson’s Disease. He said the message behind Dahl’s story was particularly poignant: “Whatever happens to you, never give up. It’s never too late.”\n\nEsio Trot, which also stars James Corden and features 60 real tortoises, is set to be the highlight of the BBC Christmas schedules.\n\nProducers are picking over the Dahl catalogue for more hits after the success of the musical Matilda. The 90-minute Esio Trot is set to become an international money-spinner after The Weinstein Company picked up the US distribution rights.\n\nHarvey Weinstein said: “Roald Dahl is one of the most revered children’s authors in history, so needless to say we're delighted to be on board with this project.”", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2014/11/12/19/pg-20-dench-getty.jpg", "http://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2014/11/12/19/pg-20-dench-getty.jpg", "keywords": [], "authors": ["Adam Sherwin"], "canonical_link": "https://www.independent.co.uk/news/people/dame-judi-dench-battles-failing-eyesight-but-says-stop-telling-me-to-retire-9856849.html", "title": "Dame Judi Dench battles failing eyesight but says 'stop telling me to retire'", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "http://www.independent.co.uk/news/people/dame-judi-dench-battles-failing-eyesight-but-says-stop-telling-me-to-retire-9856849.html", "title": "Dame Judi Dench and failing eyesight: 'stop telling me to retire'", "description": "79-year-old appears alongside Dustin Hoffman in Roald Dahl’s Esio Trot this Christmas", "updated_time": "2014-11-12T21:54:43+00:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2014/11/12/19/pg-20-dench-getty.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "description": "Dame Judi Dench is battling failing eyesight which has left her unable to read scripts. But the actress has said she is driven “spare” by people asking when she will retire because she has no intention of leaving the stage.", "keywords": ", People, News", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"published_time": "2014-11-12T20:09:40+00:00", "modified_time": "2014-11-12T21:54:43+00:00", "section": "People", "subsection": "Frontpage, News, Culture, News", "author_name": "Adam Sherwin", "content_type": "story", "word_count": 532, "image_count": 1, "video_count": 0, "embed_count": 0, "internal_link_count": 0, "external_link_count": 0}, "twitter": {"description": "Dame Judi Dench is battling failing eyesight which has left her unable to read scripts. But the actress has said she is driven “spare” by people asking when she will retire because she has no", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1415822980.0, "source": "http://www.independent.co.uk", "summary": ""}