{"url": "https://www.thedailybeast.com/nick-cannon-on-his-unconditional-love-of-mariah-carey-and-the-return-of-wild-n-out", "text": "Over his nearly two-decade career, Nick Cannon has accomplished more than most celebrities—let alone former child stars—do in a lifetime.\n\nCannon is a rapper, an actor, a comedian, a director, a screenwriter, and a radio and television personality. Whether it’s in the classic Drumline or the less classic Drumline: A New Beat, Cannon is always working.\n\nAnd while he’s always been a multitasker, the 36-year-old has recently upped the ante when it comes to creative productivity. The star’s recent decision to part ways with America’s Got Talent has left Cannon with even more time to devote to his passion projects, like helming the Wild ’N Out reboot at MTV and working on new music.\n\nOne of Cannon’s many passions recently led him to Kingston, Jamaica, where he was inspired by the local dancehall scene. Believing that this story had yet to reach a mainstream audience, Cannon wrote, directed, executive produced, and starred in a musical drama called King of the Dancehall, premiering on YouTube Red on Aug. 2.\n\nNaturally, when Nick Cannon single-handedly wills a dancehall drama into being, that film also happens to star Whoopi Goldberg, Busta Rhymes, Louis Gossett Jr., and Kreesha Turner (and it shoots on location in Jamaica).\n\nArguably, it was Cannon’s insistence on juggling multiple careers and personas that landed him in hot water earlier this year.\n\nWhile taping for his Showtime stand-up special, Cannon joked that he was losing his “black card” because of America’s Got Talent. The implication was that Cannon felt somehow controlled or censored by the expectations of the network hosting gig.\n\nNBC allegedly believed that the joke “disparaged their brand,” and may have even gone so far as to threaten Cannon with termination. So the host of the wildly popular summer talent competition quit instead.\n\n“There is no amount of money worth my dignity or my integrity,” Cannon wrote in a subsequent Facebook post. “Not to get too detailed but this isn’t the first time executives have attempted to ‘put me in my place’ for so called unruly actions… I will not stand for it. My moral principles will easily walk away from the millions of dollars they hang over my head.”\n\nIn many ways, it’s this insistence on creative autonomy at any cost that truly sets Nick Cannon apart.\n\nDuring a recent phone call with The Daily Beast, Cannon further articulated his “boss” mentality. We discussed King of the Dancehall, co-parenting with Mariah Carey, and his passion for show-stopping turbans.\n\nSo let’s talk about King of the Dancehall, which you wrote, directed, executive produced, and starred in—can you speak on your vision for this project?\n\nMore than anything it was just trying to shed light on the subculture of dancehall and Jamaica. I took a trip to Kingston and was inspired by the community so much, and I felt like there was never a story told on a mainstream platform about this world. So I figured they had all the Step Ups and the Dirty Dancings and all that, so why not have something specifically about dancehall? So I wrote it! And put it all together.\n\nDancehall is definitely having a mainstream moment right now with artists like Drake and Rihanna.\n\nYeah well that was the thing! I felt like people have been brought on to the culture for quite some time, but were never really paying homage or telling the true story of where everything comes from, the raw ideas or this actually being a lifestyle. So I wanted to do that in a big way so even more people have a chance to—with Drake and Rihanna and the Justin Bieber song—to actually know where that stuff came from.\n\nAnd how was shooting on location in Jamaica?\n\nIt was intense at times because it was just so raw. But we made it happen, it was an incredible experience.\n\nSo how does it feel to be doing Wild ’N Out again at MTV?\n\nIt’s exciting! More than anything it’s exciting. Again, it’s something I created from nothing, with just an idea. So to see it be so successful and continue to be so successful almost 15 years later and hundreds of episodes later—this generation and the previous generation. And we’re expanding in so many different ways, different verticals, brick and mortar, sports bars, Wild ’N Out comedy clubs. And bringing out all the new talent that you see as well, just giving other people even more opportunities through the Wild ’N Out brand.\n\nIn the past you’ve compared Wild ’N Out to Def Comedy Jam and In Living Color, and you’ve certainly helped launch the careers of a bunch of comedians, and black comedians specifically.\n\nDefinitely—this was the first place a lot of people were introduced to Katt Williams and Kevin Hart. Even people on SNL like Taran Killam and Pete Davidson, these are people who started their career on Wild ’N Out. It’s been a great platform for young comedians and hip-hop culture. So I take pride in that, to be able to build up young talent and give them a platform.\n\nWild ’N Out is really unique in that you have these huge celebrities on, and they’re actually willing to be honest and candid. I saw that episode you just did with Blac Chyna, and you guys really went there.\n\n(Laughs.) Yeah, I mean you just got to create an environment of fun. And an environment where no one’s taking themselves too seriously. And so we offer them that. Cause everybody’s handling everything with gravity, and we’re like no, this is an environment where you can address things and address them in a way that says it’s not as serious as everyone makes it. So you can have that fun—and obviously usually I’m the first to take it, I bear the brunt of everyone’s jokes, and so everyone sees it like, “Hey, Nick’s not tripping, so why should anyone else.”\n\nSo if a celebrity came with a list of off-limits topics, would you not be about that?\n\nNah, that happens all the time! Sometimes people will come on and say please don’t say anything about this and this, and we’re sensitive to that. We’re nice and professional people! So if you ask us not to talk about something, we’ll follow the rules. We can be professional!\n\nWhen all of the stuff was going down with America’s Got Talent, you wrote a statement that touched on the lack of minority executives in the entertainment industry, which is a huge issue, and the challenges of being a black artist in general—do you feel like you’ve seen any sort of progress on that front over the course of your career?\n\nDefinitely… We’ve come a long way but we’ve got a long way to go. A lot of times for me it’s more about the mentality. When it comes to talent specifically, they have to “know their place” or “be grateful to have the opportunity,” and that’s not for me at all. I’m more about creating my own, and developing and owning and having equity, not only with studios and brands but with content, and owning IP, not just because that’s where the money is, but that’s where the power is as well. So I just don’t like that employee mentality. I feel like I can’t be an employee anymore, I aim to be a boss and an owner in everything that I do. So when someone puts me in a position where they want to treat me a certain way, and question me, then I have to step up.\n\nAt what point did you get so comfortable calling people out and asserting yourself like that?\n\n(Laughs.) You know what, I feel like I’ve always been doing that? I just don’t really care about the consequences, I care about staying true to myself. So it wasn’t like, “Oh I’ve reached a certain point and now I can do it.” I’ve always done it. And luckily I am in a position where even when there are consequences… like I’m no longer working on America’s Got Talent, but there are other jobs, so it doesn’t really phase me.\n\nYou mean you don’t need the money.\n\nRight. Pretty much!\n\nOK, shifting from a serious issue to sort of a silly one: The internet went sort of wild when you were spotted at the Victoria’s Secret Fashion Show wearing a turban—were you surprised that everyone was tweeting about it and all that? Because you’ve been wearing turbans for a while now, right?\n\nYeah, it’s been a minute. I mean I guess I’m a stylish person, but I never really set out to make a statement and style with it. It’s more of a cultural thing, but I guess it’s part of my style too. I never really give that stuff too much attention—when it comes to being flamboyant, it’s like, why not? Why not rock a pink turban?\n\nDoes it upset you when people judge you on the internet, or have you been famous for so long that you actually don’t read the comments?\n\nI definitely read the comments! I read it, laugh at it, and put it on Wild ’N Out, most of the time! That’s great banter. And none of that stuff really phases me because it’s not real life. It’s stuff that you can always laugh at. I always say I’m not worried about other people’s opinions, I just laugh and keep it moving and then do it all over again.\n\nThere is constant speculation about how you and your ex-wife (Mariah Carey) have managed to remain such close friends and co-parents even after your split—from the outside, it just looks like a really healthy relationship. How have you managed to stay so close with your ex? What’s the secret?\n\nIt’s really just about unconditional love, taking your ego out of the situation and understanding that that’s how it goes. You’ve moved on, but at the end of the day you’ve got to raise children. It’s pretty simple when you think about it.\n\nIt doesn’t seem so simple though!\n\nYou’re right—you can make it hard or you can just deal with it and embrace it, and I think everybody’s coming from a positive place.\n\nAre you sick of having to constantly address rumors that you’re getting back together?\n\nYeah, I mean there’s a rumor about that every week, there’s a rumor about who I’m dating. There are so many rumors that I don’t even pay attention to it anymore.\n\nUnless they’re really funny.\n\nExactly. I try to find the humor in it.\n\nSo what other projects are you working on right now?\n\nI’m focusing on music. I have so much free time after America’s Got Talent, that used to take up my entire summer, and so now I’ve just been focusing—I’ve got a hot record out right now with Quavo called “Dream Girl” that’s been shooting up the charts. Aside from that I’ve been DJ’ing and building up the Wild ’N Out brand like I told you, getting all that together and getting ready for the next season, so I’ve been busier than ever. Obviously the film is coming out and then I’m working on another film, doing the same thing, writing, financing, shooting everything but this one takes place in Inglewood, California, and it’s a basketball film about female street ball called She-ball. So that’s kind of cool.\n\nWhere do you think your sound is at right now? Because you’ve obviously been making music for a while.\n\nI’m always going to be influenced by gospel music because that’s my favorite type of music. The older stuff I’m always going to be influenced by. But the stuff I’m vibing with, that I’m loving out there right now, is everything from Kehlani, who’s actually one of my artists that I discovered, to everything that’s going on in the hip-hop scene, from Kendrick to Chance to Migos. Those are the guys I’m paying close attention to because that’s who I’m chasing right now.\n\nAnd are you still enrolled at Howard University?\n\nI am! I’m still trying to figure that out, school starts on the 22nd of August I think, so got to get all of that stuff together.\n\nWhat are you studying?\n\nI’m majoring in strategic, legal and management communication in the school of communications.\n\nSo that’s a lot you have going on!\n\nAlways.", "images": ["https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1501630706/170802-zimmerman-nick-cannon-hero_j0zf0o", "https://img.thedailybeast.com/image/upload/c_fill,h_200,w_200,x_0,y_0/v1489779073/author/amy-halperin-zimmerman-author.jpg", "https://img.thedailybeast.com/image/upload/v1550872986/White2x_hcwpd6.png", "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_1.5/c_limit,w_1044/fl_lossy,q_auto/v1501630706/170802-zimmerman-nick-cannon-hero_j0zf0o", "https://img.thedailybeast.com/image/upload/v1549916286/logo_km2qs4.png"], "top_img": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1501630706/170802-zimmerman-nick-cannon-hero_j0zf0o", "keywords": [], "authors": ["Amy Zimmerman", "Entertainment Reporter"], "canonical_link": "https://www.thedailybeast.com/nick-cannon-on-his-unconditional-love-of-mariah-carey-and-the-return-of-wild-n-out", "title": "Nick Cannon on His ‘Unconditional Love’ of Mariah Carey and the Return of ‘Wild ’N Out’", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "title": "Nick Cannon on His ‘Unconditional Love’ of Mariah Carey and the Return of ‘Wild ’N Out’", "keywords": "Mariah Carey, MTV, America's Got Talent, Nick Cannon", "og": {"title": "Nick Cannon on His ‘Unconditional Love’ of Mariah Carey and the Return of ‘Wild ’N Out’", "description": "The 36-year-old multi-hyphenate talks what it takes to co-parent twins with the Elusive Chanteuse, along with juggling a new film, new music, and MTV’s reboot of ‘Wild ’N Out.’", "url": "https://www.thedailybeast.com/nick-cannon-on-his-unconditional-love-of-mariah-carey-and-the-return-of-wild-n-out", "site_name": "The Daily Beast", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1501630706/170802-zimmerman-nick-cannon-hero_j0zf0o"}, "description": "The 36-year-old multi-hyphenate talks what it takes to co-parent twins with the Elusive Chanteuse, along with juggling a new film, new music, and MTV’s reboot of ‘Wild ’N Out.’", "authors": "Amy Zimmerman", "wrap": "/content/dailybeast/entertainment", "article": {"section": "entertainment", "published_time": "2017-08-02T05:00:00.000Z", "author": "https://www.thedailybeast.com/authors/amy-zimmerman"}, "fb": {"app_id": 189930913679}, "twitter": {"card": "summary_large_image", "site": "@thedailybeast", "creator": "@ahzimm", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_600/f_jpg/fl_lossy,q_auto/v1501630706/170802-zimmerman-nick-cannon-hero_j0zf0o"}, "sailthru.date": "2017-08-02T05:00:00.000Z", "sailthru.expire_date": "2017-08-16T05:00:00.000Z", "publicationDate": 201708020500, "parsely-page": "{\"author\":\"Amy Zimmerman\",\"link\":\"https://www.thedailybeast.com/nick-cannon-on-his-unconditional-love-of-mariah-carey-and-the-return-of-wild-n-out\",\"metadata\":{\"articleType\":\"article\",\"rubric\":\"NEXT STEP\"},\"post_id\":\"nick-cannon-on-his-unconditional-love-of-mariah-carey-and-the-return-of-wild-n-out\",\"pub_date\":\"2017-08-02T05:00:00+00:00\",\"section\":\"Entertainment\",\"tags\":[\"Mariah Carey\",\"MTV\",\"America\\u0027s Got Talent\",\"Nick Cannon\",\"typeArticle\"],\"title\":\"Nick Cannon on His ‘Unconditional Love’ of Mariah Carey and the Return of ‘Wild ’N Out’\",\"type\":\"post\"}"}, "movies": ["https://www.youtube.com/embed/6Bju_5l5NVQ?&enablejsapi=1&playsinline=0&autoplay=0", "https://www.youtube.com/embed/_UQds5MR08Q?&enablejsapi=1&playsinline=0&autoplay=0"], "publish_date": 1501650000.0, "source": "https://www.thedailybeast.com", "summary": ""}