{"url": "https://www.npr.org/sections/therecord/2018/04/26/606080885/kelis-nas-ex-wife-accuses-rapper-of-physical-and-mental-abuse", "text": "Kelis, Nas' Ex-Wife, Accuses Rapper Of Physical And Mental Abuse\n\nEnlarge this image toggle caption Matt Winkelmeyer/Getty Images for Spotify Matt Winkelmeyer/Getty Images for Spotify\n\nFor nearly a decade, singer and celebrity chef Kelis kept the details surrounding her divorce from the rap artist Nas private. But in a new video interview with Hollywood Unlocked, she describes their high-profile celebrity marriage of five years as a \"tumultuous and toxic\" relationship in which she suffered both mental and physical abuse.\n\n\"I have edited myself for nine years and I woke up this morning and said, 'not today,' \" Kelis says during the nearly two-hour interview recorded at her home.\n\nA representative for Nas did not respond to a request for comment.\n\nYouTube\n\nWhen the couple married in 2005, Nas's status as one of the greatest rappers alive and Kelis's genre-bending musical repertoire made them instant hip-hop royalty in the public eye. Yet the fairy-tale was far from reality, Kelis claims. She describes a marriage in which they fought frequently, with Nas often drinking to the point of being black-out drunk before becoming violent toward her. Kelis would fight back in self-defense, she says, and Nas would often wake up with no memory of the events. \"Literally, we would have the worst night ever and we would wake up the next day, and it's like it never happened.\"\n\nHer revelations come amid the backdrop of #MeToo, a movement whose greater reckoning around sexual assault, harassment and violence against women has yet to make a dent in hip-hop, despite its tangled, misogynist history. Russell Simmons, the godfather of the rap industry, has been the subject of multiple allegations of sexual assault and harassment over the past year; one of two assault cases filed against Simmons was dropped earlier this week. But the music industry, and hip-hop in particular, has yet to face the wide-scale scrutiny that has hit Hollywood head-on.\n\nIn one grim account, Kelis recalls feeling empathy for Rihanna when details emerged of her abuse at the hands of Chris Brown because she found herself in the same predicament. \"I remember so clearly when the pictures came out with that whole thing that happened with her and Chris Brown. And the only way I can describe it was like double-dutch. I felt like, 'Do I jump in? Do I say it?' Cause I had bruises all over my body at that time,\" she says. \"That day, I remember being in Atlanta sitting in the kitchen and I wasn't ready to walk.\"\n\nBy the time she filed for divorce over \"irreconcilable differences\" in April 2009, Nas had been cheating for two years, she alleges, in addition to the domestic abuse. Pregnant with their son Knight at the time, she gave birth in July. In less than a year, their divorce was finalized.\n\nOn the cover photo of Nas' 2012 album Life Is Good, the artist is seated with part of his ex-wife's green wedding dress draped over his leg. It was left behind when they split, he said in interviews at the time of the album's release. Nas has never acknowledged physical abuse and has yet to respond publicly to Kelis's new allegations.\n\nIt's not the first time Nas has been the subject of such accusations. In her 2006 tell-all book It's No Secret, Carmen Bryan, the mother of Nas' daughter Destiny Jones, wrote: \"The next thing I knew I was being hit in the face with a closed fist,\" detailing what happened the morning after she came home and Nas noticed a hickey on her neck. \"The impact of the blow was so fierce that I saw stars.\"\n\nKelis's interview comes in the wake of the latest filing by Nas in the protracted custody battle over their eight-year-old son, which provoked her to speak out, she says. \"I'm really private; I don't like people in my business,\" Kelis says, explaining why she stayed quiet during their marriage. \"I felt like, 'This is my partner; I chose this. We're gonna do this. We're gonna make it work.' I stayed for years after that, and you keep it moving. Like I said, I'm not frail, I'm not scared, I'm not weak.\"", "images": ["https://media.npr.org/assets/img/2020/03/24/undefined_sq-63f9f4b46bb9031d67f9785b66818f4befbab8bc.jpg?s=100", "https://media.npr.org/assets/img/2017/01/30/rodneycarmichael_sq-ad453b583dc660c883974bd1e4002fa3d71b57f1-s100-c85.jpg", "https://media.npr.org/chrome_svg/music-logo-dark.svg", "https://media.npr.org/assets/img/2019/02/26/we_otherentitiestemplatesun_sq-4a03b35e7e5adfa446aec374523a578d54dc9bf5-s100-c85.png", "https://www.facebook.com/tr?id=1621557368158968&ev=PageView&noscript=1", "https://media.npr.org/chrome/programs/logos/morning-edition.jpg", "https://media.npr.org/chrome/programs/logos/up-first.jpg?version=2", "https://media.npr.org/assets/img/2018/04/26/gettyimages-869170448_wide-21f0120e92726dfb2bfcf915f094b8272f055abd.jpg?s=1400", "https://media.npr.org/assets/img/2018/04/26/gettyimages-869170448_wide-21f0120e92726dfb2bfcf915f094b8272f055abd-s1100-c15.jpg", "https://media.npr.org/assets/img/2020/03/17/coronavirus_daily_final__sq-2aca96317281db7f8671e5bf24e68fb77b66bbed.png?s=100", "https://media.npr.org/assets/img/2020/02/21/invisibiliapodcasttile-3000x3000_sq-3cea16f264a5ecd812496bd930d38c4f54102d6e.png?s=100", "https://media.npr.org/chrome_svg/music-logo-light.svg", "https://media.npr.org/assets/img/2020/03/09/trh_podcast-tile_sq-c05fb259465d433a5cf8a21248b8fa209a6b7690.png?s=100", "https://media.npr.org/chrome/programs/logos/all-things-considered.png", "https://media.npr.org/assets/img/2019/02/26/we_otherentitiestemplatesat_sq-cbde87a2fa31b01047441e6f34d2769b0287bcd4-s100-c85.png", "https://media.npr.org/chrome_svg/npr-logo.svg", "https://media.npr.org/chrome/programs/logos/fresh-air.png"], "top_img": "https://media.npr.org/assets/img/2018/04/26/gettyimages-869170448_wide-21f0120e92726dfb2bfcf915f094b8272f055abd.jpg?s=1400", "keywords": [], "authors": ["Rodney Carmichael"], "canonical_link": "https://www.npr.org/sections/therecord/2018/04/26/606080885/kelis-nas-ex-wife-accuses-rapper-of-physical-and-mental-abuse", "title": "Kelis, Nas' Ex-Wife, Accuses Rapper Of Physical And Mental Abuse", "meta_data": {"google-site-verification": "1VqzbDm4ukeFVHOoq5LjIKA2fVKZD-EYv8cXZhKXSfU", "robots": "noarchive,index,follow", "Rating": "General", "viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "date": "2018-04-26", "description": "The singer and chef details a \"toxic\" marriage defined by mental and physical abuse, the second accusation of violence to be made by a former partner of the rapper.", "og": {"title": "Kelis, Nas' Ex-Wife, Accuses Rapper Of Physical And Mental Abuse", "url": "https://www.npr.org/sections/therecord/2018/04/26/606080885/kelis-nas-ex-wife-accuses-rapper-of-physical-and-mental-abuse", "type": "article", "description": "The singer and chef details a \"toxic\" marriage defined by mental and physical abuse, the second accusation of violence to be made by a former partner of the rapper.", "image": "https://media.npr.org/assets/img/2018/04/26/gettyimages-869170448_wide-21f0120e92726dfb2bfcf915f094b8272f055abd.jpg?s=1400", "site_name": "NPR.org"}, "fb": {"app_id": 138837436154588, "pages": 10643211755}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "title": "Kelis, Nas' Ex-Wife, Accuses Rapper Of Physical And Mental Abuse", "site": "@NPR", "domain": "npr.org", "image": {"src": "https://media.npr.org/assets/img/2018/04/26/gettyimages-869170448_wide-21f0120e92726dfb2bfcf915f094b8272f055abd.jpg?s=1400"}}}, "movies": ["https://www.youtube.com/embed/7bFcHyI4dOk?rel=0"], "publish_date": 1524672000.0, "source": "https://www.npr.org", "summary": ""}