{"url": "www.thecut.com/2018/06/david-victoria-beckham-divorce.html", "text": "Photo: Bertrand Rindoff Petroff/Getty Images\n\nWelcome to You Know What I Heard, the Cut’s weekly celebrity gossip column about the peregrinations of the rich and famous.\n\nGet the best celebrity gossip in your inbox every week. Receive alerts every time there's more news from You Know What I Heard. Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.\n\nSo, are the Beckhams divorcing? Rumors about trouble in David and Victoria’s marriage have been proliferating in the tabloids since the Royal Wedding, where the couple was photographed looking dour. Of course, there are always rumors about the Beckhams, who will (hopefully?) celebrate their 19th wedding anniversary on July 4. This time, though, social-media participants seem convinced that they are really heading for a split.\n\nThere are a few factors to consider when weighing the possibility of divorce. One is: Do you care? Another is: What have the Beckhams said about their marriage? (It’s F-I-N-E, according to their publicist, who called the rumors “Journalist Chinese whispers and fake news fueled by social media.”) And another is: What’s going on with the Beckhams’ businesses?\n\nLast week, the Daily Mail reported that David left his longtime manager, who also manages Posh, for a new team led by his friend David Gardner. This, to me, would be the strongest sign of an impending split, but the Beckhams quickly denied the report. Then, Victoria gave a speech at the Forbes Women Summit in New York, where she mentioned David specifically and called him an “incredible husband.”\n\n“I try really, really hard. I try hardest to be the best mother,” she said in her speech, according to People. “I am trying to be the best wife and the best professional. When I get home I try to put the phone down and spend time with the children and spend time with David. I have the support of an incredible husband. We really are equal with everything we do at home with the children. When I’m away he’s the one doing the school run and doing the cooking.”\n\nSo Victoria is trying. Is David? So far, he hasn’t personally said anything about the divorce rumors. I’d wait to see what he does next week for their anniversary.\n\nIn other celebrity relationship news, Ben Affleck and Lindsay Shookus are doing great. Shookus’s parents visited the couple in L.A. this past weekend, and they all went on a dinner date and a hike the next day. (Shookus’s 5-year-old daughter was present for the hike, too.) According to an “eyewitness” who talked to People, Affleck was in a “great mood” at dinner, and he “picked up the check at the end of the night.”\n\nPhoto: Juliano-rol/X17online.com\n\nBut Affleck and Shookus are not necessarily getting more serious, according to Entertainment Tonight. A source close to Affleck told the outlet, “Ben knows he loves Lindsay, but he wants to take things slow for the sake of his sobriety. He’s actually been told to take it slow and he’s heeding that advice … Ben isn’t ready to propose and has no plans to get engaged anytime soon, but Lindsay feels he is worth the wait.”\n\nWhat do you think? Is Ben Affleck worth the wait?\n\nMoving more quickly is Shookus’s SNL colleague Pete Davidson, who just moved into a $16 million apartment in Manhattan with his new fiancé, Ariana Grande. Grande’s 25th birthday is today, and Davidson wished her a happy birthday on Instagram just after midnight.\n\nLast night, Grande posted a photo of Davidson on her Instagram story at 11:11 p.m. with the caption, “i have no wish i have everything i ever wanted hi.” I love it!\n\nDo you remember who Chris Martin is dating? It’s Dakota Johnson. They were photographed walking a dog in Malibu on Sunday.\n\nPhoto: DOBN/RMBI/BACKGRID\n\nOne small blessing from this week:\n\nMartin’s ex-wife, Gwyneth Paltrow, is preparing to marry her fiancé, the television producer Brad Falchuk at the end of the summer. Here’s what she had to say about wedding planning this time around:\n\n“I’m very busy so I’m actually not that involved in it.”\n\nPhoto: XPOS/BACKGRID\n\nAnd here’s an interesting blind item from this week, from Enty at Crazy Days and Nights:\n\n“This former A- list mostly television actress from a now defunct hit comedy is probably A-/B+ list mostly movie actress. She says that this A-/B+ list writer/actor all of you know spent three weeks chatting her up and doing everything he could to hook up with her. She finally hooked up with him and within 30 minutes after, he had her out the door and has ghosted her since.”\n\nI believe that “A-/B+ list writer/actor all of you know” has moved on with an even younger actress.\n\nFinally, I’ll leave you with some incredible news: Emma Watson is back together with former Glee star Chord Overstreet. Or perhaps they never broke up? They first announced their relationship back in March, with a very obvious pap stroll in L.A.. Then, People reported at the end of May that they were over. But last week, they were pap-strolling in L.A. again, and this time, they made out for the camera! Watson must really like this guy to go along with all of this.\n\nThanks so much for gossiping this week. Don’t forget to email me at allie.jones@nymag.com, send me a message on Twitter, or contact me on Signal, if you’d like to chat.", "images": ["https://pixel.nymag.com/imgs/fashion/daily/2018/06/26/gossip/lede.w1200.h630.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/06/26/gossip/chris-martin-dakota-johnson.nocrop.w710.h2147483647.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/06/26/gossip/lede.w700.h700.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/06/26/gossip/gwyneth-paltrow.nocrop.w710.h2147483647.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/06/26/gossip/ben-affleck.nocrop.w710.h2147483647.jpg"], "top_img": "https://pixel.nymag.com/imgs/fashion/daily/2018/06/26/gossip/lede.w1200.h630.jpg", "keywords": [], "authors": ["Allie Jones"], "canonical_link": "https://www.thecut.com/2018/06/david-victoria-beckham-divorce.html", "title": "Are David Beckham & Victoria Beckham Getting a Divorce?", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "What Is Going on With the Victoria and David Beckham Divorce Rumors?", "url": "https://www.thecut.com/2018/06/david-victoria-beckham-divorce.html", "description": "That and more in this week’s celebrity gossip column.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/06/26/gossip/lede.w1200.h630.jpg", "site_name": "The Cut", "type": "article"}, "twitter": {"title": "So, Are the Beckhams Divorcing?", "description": "That and more in this week’s celebrity gossip column.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/06/26/gossip/lede.w600.h315.2x.jpg", "card": "summary_large_image", "creator": "@allierileyjones", "site": "@TheCut"}, "article": {"published_time": "2018-06-26T18:07:13.245Z", "tag": "you know what i heard, celebrity, culture", "publisher": "https://www.facebook.com/cut"}, "description": "That and more in this week’s celebrity gossip column.", "sailthru.tags": "you know what i heard, celebrity, culture", "author": "Allie Jones", "fb": {"app_id": 343556435754245}, "type": "Article", "vertical": "The Cut", "apple-mobile-web-app-title": "The Cut", "application-name": "The Cut", "msapplication-TileColor": "#ff5656", "msapplication-TileImage": "https://assets.nymag.com/media/sites/thecut/icon.144x144.png"}, "movies": [], "publish_date": 1530036433.245, "source": "http://www.thecut.com", "summary": ""}