{"url": "www.washingtonpost.com/news/business/wp/2017/03/10/go-buy-ivankas-stuff-kellyanne-conway-said-then-the-first-daughters-fashion-sales-exploded/", "text": "Yes, Feb. 9 — the same day that White House counselor Kellyanne Conway promoted Trump’s clothing and jewelry line on “Fox & Friends.”\n\n“Go buy Ivanka’s stuff is what I would tell you,” Conway said. “I’m going to give a free commercial here. Go buy it today, everybody.”\n\nAnd viewers did, apparently.\n\nAbigail Klem, president of the Ivanka Trump brand, said in a statement that “the beginning of February” shows “the best performing weeks in the history of the brand.”\n\nAD\n\nAD\n\n“For several different retailers, Ivanka Trump was a top performer online, and in some of the categories it was the best performance ever,” Klem said.\n\nSarah Tanner, Lyst’s spokeswoman, said increases in sales are usually tied to current events. For instance, interest in pantsuits went up by 460 percent last year because of Hillary Clinton’s affinity for the style, she said. Sales of the first daughter’s products went up by 86 percent in November when her father won the presidential election, according to the company.\n\nBut the brand was “largely featured” in the news in February, Tanner said. Conway gave her on-air endorsement of Ivanka Trump’s brand after President Trump had complained on Twitter that his daughter had “been treated so unfairly” by the department store Nordstrom, which dropped her clothing line over slow sales.\n\nAD\n\nAD\n\n“It would not be a surprise to us if it resulted in the increase in sales,” Tanner said of Conway’s Fox interview. “I think that’s one of the reasons the brand was largely in the news and could have attributed to this increase.”\n\nConway did not respond to an email requesting comment. Her promotion of the fashion line appeared to violate an ethics rule barring federal employees from using their public office to endorse products and immediately drew criticism from both Democrats and Republicans.\n\nRep. Jason Chaffetz (R-Utah), chairman of the House Oversight Committee, said Conway’s comments were “absolutely wrong, wrong, wrong” and “clearly over the line,” The Washington Post reported.\n\nAD\n\nThe White House later said that Conway had been “counseled.” But concerns about her comments remain.\n\nOn Thursday, the government’s top ethics official criticized the White House for not disciplining Conway, The Post’s Drew Harwell reported. Walter M. Shaub Jr., director of the Office of Government Ethics, had urged officials last month to reprimand the White House counsel but was rebuffed. On Thursday he wrote to Stefan C. Passantino, who handles White House ethics issues as the president’s deputy counsel.\n\nAD\n\n“When an employee’s conduct violates, disciplinary action serves to deter future misconduct,” Shaub wrote. “Not taking disciplinary action against a senior official under such circumstances risks undermining the ethics program.”\n\nAD\n\nLast month, a group of law professors filed a professional misconduct complaint against Conway — a law school graduate and member of the D.C. Bar — partly because of her on-air endorsement of Trump’s products.\n\nAccording to Lyst, February drew unusually large numbers of orders across many Ivanka Trump-branded products, including dresses, shoes, pants, coats, knitwear and tops. Heels were the bestsellers, followed by dresses.\n\n“We’ve never seen such a large uptick,” Tanner said. “Typically, she’s not in our top 100 sellers.”\n\nComparing February’s numbers with last year’s average number of orders of Ivanka Trump products shows a difference of 557 percent. (Tanner said company policy prohibits her from sharing the actual numbers of online sales.)\n\nAD\n\nAD\n\nThe excitement of the brand, however, may be slumping. The company’s numbers show sales were gradually tapering off toward the end of February. March does not appear to be as remarkable, but sales are still on track to be about 8 percent better than they were in January, according to Lyst.\n\nThe Ivanka Trump brand also appears to have weathered an aggressive boycott campaign called Grab Your Wallet, which began in October and encouraged shoppers to avoid retailers that stock Trump-branded products.\n\nIvanka Trump: A life in the spotlight share Share Email this link Share on Pinterest Share on LinkedIn View Photos View Photos Next Image MANHATTAN, NY - JULY 16: Ivanka Trump poses for a portrait inside the Trump Tower in Manhattan, NY, on July 16, 2014. (Yana Paskova/For The Washington Post)\n\nSome retailers have partially or completely distanced themselves from the Trump brand. Nordstrom, Neiman Marcus and Belk have stopped selling Trump’s branded line of clothing, shoes and jewelry. T.J. Maxx and Marshalls have instructed employees to stop promoting Trump products in stores and to move Trump clothing into general merchandise racks. Sears Holdings and subsidiary Kmart discontinued online sales of 31 items from the Trump Home collection last month, though their websites still contain items sold by third-party sellers. The collection includes living room and bedroom furniture, lamps and chandeliers.\n\nAD\n\nAD\n\nThe companies attributed their decisions to product performance. Nordstrom, for instance, said sales of the brand have steadily declined, particularly in the last half of 2016.\n\nStill, despite the boycott, Trump’s line of fragrances enjoyed top spots in Amazon’s best-selling list last month, The Post’s Amy B Wang reported. The Ivanka Trump Eau de Parfum spray was the top-selling item in the “Perfumes & Fragrances” category.", "images": ["https://www.washingtonpost.com/resizer/aQuLDJmTLJTJVc31hsin4Vose30=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/O5IAQWYYEAYALKBZCJIYPPDTYI.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/c6a5c81c-3382-40e6-8231-fcfb2d41a328.png&w=90&h=90"], "top_img": "https://www.washingtonpost.com/resizer/aQuLDJmTLJTJVc31hsin4Vose30=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/O5IAQWYYEAYALKBZCJIYPPDTYI.jpg", "keywords": [], "authors": ["Kristine Phillips", "Reporter Covering National", "Breaking News"], "canonical_link": "https://www.washingtonpost.com/news/business/wp/2017/03/10/go-buy-ivankas-stuff-kellyanne-conway-said-then-the-first-daughters-fashion-sales-exploded/", "title": "‘Go buy Ivanka’s stuff,’ Kellyanne Conway said. Then the first daughter’s fashion sales exploded.", "meta_data": {"description": "Lyst, the largest fashion e-commerce website in the world, says sales of Ivanka Trump's fashion line skyrocketed in early February.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/business/wp/2017/03/10/go-buy-ivankas-stuff-kellyanne-conway-said-then-the-first-daughters-fashion-sales-exploded/", "image": "https://www.washingtonpost.com/resizer/aQuLDJmTLJTJVc31hsin4Vose30=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/O5IAQWYYEAYALKBZCJIYPPDTYI.jpg", "title": "‘Go buy Ivanka’s stuff,’ Kellyanne Conway said. Then the first daughter’s fashion sales exploded.", "description": "Lyst, the largest fashion e-commerce website in the world, says sales of Ivanka Trump's fashion line skyrocketed in early February."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "‘Go buy Ivanka’s stuff,’ Kellyanne Conway said. Then the first daughter’s fashion sales exploded.", "description": "Lyst, the largest fashion e-commerce website in the world, says sales of Ivanka Trump's fashion line skyrocketed in early February."}, "last_updated_date": "2019-03-28T21:31:38.138Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1489075200.0, "source": "http://www.washingtonpost.com", "summary": ""}