{"url": "https://en.wikipedia.org/wiki/Tom_Brady", "text": "This article is about the American football player. For other people named Tom Brady, see Tom Brady (disambiguation)\n\nAmerican football quarterback\n\nThomas Edward Patrick Brady Jr. (born August 3, 1977) is an American football quarterback for the Tampa Bay Buccaneers of the National Football League (NFL). He spent the first 20 seasons of his career with the New England Patriots, playing in nine Super Bowls and winning six of them (XXXVI, XXXVIII, XXXIX, XLIX, LI, and LIII), the most of any player in NFL history. He has won a record four Super Bowl MVP awards (XXXVI, XXXVIII, XLIX, and LI) as well as three NFL MVP awards (2007, 2010, 2017).[a] Due to his numerous records and accolades, several sports writers, commentators, and players consider Brady to be the greatest quarterback of all time.[discuss][2][3][4][5][6][7]\n\nAfter playing college football for the University of Michigan, Brady was drafted 199th overall by the Patriots in the sixth round of the 2000 NFL Draft. Due to his late selection, Brady is considered the biggest \"steal\" in the history of the NFL Draft.[8][9][10] He went on to become the team's starting quarterback in his second season after an injury to Drew Bledsoe and played for the Patriots for 20 seasons, the NFL record for seasons as quarterback for one team.[b] Following the 2019 season, Brady left New England and signed a two-year deal with the Buccaneers.\n\nBrady is one of only two quarterbacks to win a Super Bowl in their first season as a starter.[c] He is also the only quarterback to reach 200 regular-season wins,[14] Brady has never had a losing season as a starting quarterback. He has led his team to more division titles (17) than any other quarterback in NFL history. With a postseason record of 30–11, he is first all-time in playoff wins and appearances for an NFL player, including an NFL-record eight consecutive AFC championship games between 2011 and 2018 (and 13 overall). Brady has also been selected to 14 Pro Bowls, which ties the NFL record for most selections. For regular season and postseason combined, Brady is first all-time in career passing yards and touchdown passes. He is one of only two players in NFL history to amass 70,000 passing yards and 1,000 rushing yards.[d] Brady is second all-time in career regular season passing yards, second in career touchdown passes, and tied for fifth in career passer rating. He is first in postseason career completions, passing yards, and passing touchdowns, and is fifteenth in postseason career passer rating. He also tied the record for the longest touchdown pass at 99 yards to Wes Welker.[16] He is the only quarterback in NFL history named to two all-decade teams[17], having been named first-team for both the 2000 and 2010 squads (the latter of which he was selected to unanimously). He was one of only 10 quarterbacks selected to the NFL 100th Anniversary All-Time team (and one of only four players active at the time they were selected), encompassing the entire 100-year history of the league at the time.\n\nFor his alleged involvement in the Deflategate football-tampering scandal, Brady was suspended for the first four games of the 2016 season.[18] Brady and the Patriots won two of the next three Super Bowls, making him the record holder for most Super Bowl wins by a player, and the oldest quarterback to win a Super Bowl, at 41.[19]\n\nEarly life\n\nBrady was born in San Mateo, California, on August 3, 1977, the only son and fourth child of Galynn Patricia (née Johnson) and Thomas Brady Sr.[20] He has three older sisters, Nancy, Julie, and Maureen,[21] and was raised as a Catholic. His father is of Irish descent, while his mother has German, Norwegian, Polish, and Swedish ancestry.[22] Two of Brady's great-great-grandparents on his father's side, John and Bridget Brady, were Irish refugees from the Great Famine who moved to San Francisco from Boston before the American Civil War. They were accompanied by Bridget's sister Ann and her husband Lawrence Meegan, the parents of the 19th-century American Major League Baseball player \"Steady\" Pete Meegan. Brady's great-uncle Michael Buckley Jr. was the first American prisoner of war in World War II.[22][23][24][25][26][27]\n\nIn the 1980s, Brady regularly attended San Francisco 49ers games at Candlestick Park, where he was a fan of quarterback Joe Montana; Brady has called Montana his idol and one of his inspirations.[28] At age four, Brady attended the 1981 NFC Championship, against the Dallas Cowboys, in which Montana threw The Catch to Dwight Clark.[29] As a child, Brady attended football camp at the College of San Mateo, where he was taught to throw the football by camp counselor and future NFL/AFL quarterback Tony Graziani.[30] Despite the rivalry between both teams, Brady grew up as a Los Angeles Lakers and Boston Celtics fan.[31]\n\nBrady attended Junípero Serra High School in San Mateo, where he graduated in 1995; the ceremony was held at St. Mary's Cathedral.[32] He played football, basketball, and baseball in high school. He played against Bellarmine College Preparatory rival Pat Burrell in both football and baseball.[33] Brady began his football career as the backup quarterback on the Padres junior varsity team. At first, Brady was not good enough to start on the 0–8 JV team, which had not scored a touchdown all year.[34] Brady ascended to the starting position when the starting quarterback was injured. He became the varsity starter in his junior year and held the position until he graduated.[35] By Brady's senior year, he was striving to be noticed by college coaches. He created highlight tapes and sent them to schools he considered attending.[36] This led to strong interest from many football programs around the nation.\n\nThe process of recruiting was much different during Brady's time, and athletes' rankings were not as prominent. In terms of recruiting in the 2000s, Brady would have been considered a four-star recruit. In essence, he was a highly rated prospect.[37] Brady was also on Blue Chip Illustrated as well as a Prep Football Report All-American selection.[38] After his recruiting process, he narrowed down his list to five schools.[39] \"Probably the ones that we did hear from and ultimately pared the list to were Cal–Berkeley, UCLA, USC, Michigan, and Illinois”, his father said.[39] As a Cal fan, his father hoped that Brady would attend the nearby Cal, where Brady was a silent commit, and that he would be able to watch his son play.[40][41]\n\nBrady was also known as a great baseball player in high school.[42] He was a left-handed-batting catcher with power. His skills impressed MLB scouts, and he was drafted in the 18th round of the 1995 MLB Draft by the Montreal Expos.[34][43] The Expos projected Brady as a potential All-Star, and offered him money typical of that offered to a late second-round or early third-round pick.[44] Nevertheless, Brady was determined to play football at the next level. He was always more passionate about football; when he found that there was significant interest in him, he decided to take the road of football.[39] Brady was recruited by Michigan assistant Bill Harris, and he signed to play for the University of Michigan in 1995.[45][46] He finished his high-school football career by completing 236 of 447 passes for 3,702 yards and 31 touchdowns. He also won All-State and All-Far West honors and the team's Most Valuable Player Award.[38]\n\nDuring the summers of 1998 and 1999, Brady was an intern at Merrill Lynch.[47] He was inducted into the Junípero Serra High School Hall of Fame in 2003, joining fellow Serra High graduates Barry Bonds, Lynn Swann, Gregg Jefferies, Jim Fregosi, and his older sister Maureen, among many others.[38] When Brady revisited two weeks after Super Bowl XLVI, in 2012, school administrators announced that they had named the football stadium Brady Family Stadium.[48]\n\nCollege career\n\nBrady played college football at the University of Michigan from 1995 to 1999.[49][50] He was a backup quarterback for his first two years, while teammate and future NFL quarterback Brian Griese led the 1997 Wolverines to an undefeated season, which was capped by a victory in the Rose Bowl and a share of the national championship.[51] When he enrolled at Michigan, Brady was seventh on the depth chart, and he had an intense struggle to get some playing time. At one point, Brady hired a sports psychologist to help him cope with frustration and anxiety, and even considered transferring to California.[52][53] He worked closely with assistant athletic director Greg Harden, who met with Brady every week to build his confidence and to maximize his performance on the field.[54] Brady told 60 Minutes in 2014: \"He will always be somebody I rely on for sound advice and mentorship. He has helped me with my own personal struggles in both athletics and in life. Greg really pushed me in a direction that I wasn't sure I could go.\"[55]\n\nUnder Michigan head coach Lloyd Carr, Brady battled for the starting job with Drew Henson[50] and ultimately started every game in the 1998 and 1999 seasons. Brady was All-Big Ten honorable mention both seasons, and was the team captain in his senior year.\n\nDuring his first full year as starter, he set new Michigan records for most pass attempts and completions in a season, for a total of 214.[56] He set a school record for completions in a 31–16 loss against Ohio State in 1998, a season in which Michigan shared the Big Ten Conference title.[57] Brady capped that season with a 45–31 win over Arkansas in the Citrus Bowl.\n\nIn the 1999 season, Brady had to once again hold off Henson for the starting job. The two players platooned during the season's first seven games, with Brady playing the first quarter, Henson the second and Carr then deciding upon a quarterback for the second half. The 1999 Michigan Wolverines started with a 5–0 record, including a 26–22 win over Notre Dame, and a road win against eventual powerhouse Wisconsin. Against Michigan State, Brady was not chosen to play the second half; however, he was reinserted into the game with Michigan down by 17 points, and he nearly led Michigan all the way back before losing 34–31.[59] After a 300-yard passing game the following week, Carr went exclusively with Brady for the remainder of the season. Brady went on to lead Michigan to multiple 4th-quarter comebacks, including a remarkable 31–27 win against Penn State, and leading them out of a close game against Indiana, 34–31, heading into the regular season's final game, winners of three straight, earning him the moniker of \"Comeback Kid\".[60]\n\nMichigan concluded the regular season against Ohio State; this was a dramatic game with a trip to the Orange Bowl on the line. With five minutes left, tied 17–17, Brady led Michigan to the winning score.[61] He led Michigan to an overtime win in the Orange Bowl over Alabama, throwing for 369 yards, four touchdowns, leading the team back from a pair of 14-point deficits in regulation (14–0 in the first half, and 28–14 in the second). He threw the game-winning score on a bootleg to tight end Shawn Thompson. Michigan won the game when Alabama missed an extra point following its own touchdown.[62][63]\n\nIn the two seasons that Brady started at Michigan, he posted a 20–5 record, including wins at the Citrus Bowl (1999) and the Orange Bowl (2000). Brady finished his career ranking third in Michigan history with 710 attempts and 442 completions, fourth with 5,351 yards and 62.3 completion percentage, and fifth with 35 touchdown passes.[38][64]\n\nStatistics\n\nCollege football statistics[65] Year Team Passing Rushing Cmp Att Pct Yds Y/A TD Int Rtg Att Yds Avg TD 1996 Michigan 3 5 60.0 26 5.2 0 1 63.7 — — — — 1997 Michigan 12 15 80.0 103 6.9 0 0 137.7 2 −14 −7.0 0 1998 Michigan 200 323 61.9 2,427 7.5 14 10 133.1 54 −105 −1.9 2 1999 Michigan 180 295 61.0 2,217 7.5 16 6 138.0 34 −31 −0.9 1 Career 395 638 61.9 4,773 7.5 30 17 134.9 90 −150 −1.7 3\n\nProfessional career\n\nPre-draft measurables Height Weight 40-yard dash 10-yd split 20-yd split 20-ss 3-cone Vert jump Broad Wonderlic 6 ft 4 3⁄ 8 in\n\n(1.94 m) 211 lb\n\n(96 kg) 5.24 s 1.75 s 2.99 s 4.38 s 7.20 s 24 1⁄ 2 in\n\n(0.62 m) 8 ft 3 in\n\n(2.51 m) [66] 33 All values from NFL Combine[67]\n\nOverview\n\nA lightly regarded prospect coming out of college,[68][69] Brady was selected by the New England Patriots with the 199th overall pick in the sixth round of 2000 NFL Draft and had since spent 20 seasons of his career with the Patriots. Brady's tenure with the Patriots is an NFL record for the longest time playing quarterback for one franchise. Despite his less-than-stellar physical abilities as seen at his NFL Scouting Combine performance,[70] Brady's success as a passer has been attributed to his work ethic, pocket awareness, and intelligence.[71]\n\nSince Brady became their starting quarterback in 2001, the Patriots have never had a losing season and have won 17 division titles. The Patriots played in 13 AFC Championship Games from 2001 to 2018—including eight in a row from 2011 to 2018—and won nine of them. Brady and Patriots head coach Bill Belichick have combined to form the most successful quarterback-head coach tandem in NFL history, winning more regular season games and postseason games than any other such duo[72] as well as appearing in nine Super Bowls. All of these events set new NFL records.[73]\n\nIn his second season, Brady took over as the starting quarterback after Drew Bledsoe was injured.[74] He led the Patriots to first place in the AFC East[75] and a victory over the favored St. Louis Rams[76][77] in Super Bowl XXXVI, winning his first Super Bowl MVP award. Despite the Patriots' missing the playoffs the following season, Brady would then lead them to back-to-back Super Bowl championships in 2003 and 2004, winning Super Bowl MVP honors again in 2003. Along the way, the Patriots won an NFL-record 21 consecutive games (including the playoffs) between the 2003 and 2004 seasons.[78] The 2005 season was Brady's first to throw for 4,000 yards and lead the NFL in passing.[79] That postseason, Brady would win his 10th consecutive playoff game, another NFL postseason record.[80]\n\nAlthough Brady and the Patriots continued to win often, they did not return to the Super Bowl until the 2007 season. That year, Brady not only set an NFL record with 50 touchdown passes[81] but he would also lead the Patriots to a 16–0 finish,[82] the first perfect regular-season record since the Miami Dolphins finished 14–0 in 1972.[83][84] Brady would win his first career NFL MVP Award, winning 49 out of 50 votes.[85] The Associated Press also named him Male Athlete of the Year, the first such award given to an NFL player since Joe Montana won it in 1989 and 1990.[86] However, the Patriots suffered their first Super Bowl loss with Brady as quarterback, dropping a 17–14 decision to the New York Giants in Super Bowl XLII.[87]\n\nBrady missed virtually the entire following season due to a knee injury in the season opener.[88] But he would come back strong in the 2009 season to be named the league's Comeback Player of the Year.[89] In 2010, Brady set the NFL record for consecutive passes without an interception (358)[90] and broke his own record for the highest season touchdown-to-interception ratio (among players who have started a full season) at 9:1, currently the third best TD:INT ratio for a single season by a quarterback.[91] Brady would win his second league MVP award with all 50 votes in his favor.[92] He was the first unanimous NFL MVP since Giants linebacker Lawrence Taylor won the award in 1986.[93] He and Joe Montana are the only players in NFL history to win multiple NFL MVP and Super Bowl MVP awards.[94][95] Brady was also named the top player by his peers in the first NFL Top 100 list, released in 2011.[96]\n\nIn the 2011 season, Brady led the Patriots to their first AFC Championship since 2007 and appeared in the Super Bowl for a fifth time; but the Patriots would lose again to the Giants.[97] Following AFC Championship Game losses in the following two seasons, Brady and the Patriots made their sixth trip to the Super Bowl after the 2014 season (Brady's 15th as a professional). There, he led the Patriots to a fourth-quarter comeback[98] over the defending champion Seattle Seahawks. He won his fourth Super Bowl trophy and was named Super Bowl MVP for the third time.[99]\n\nDespite missing the first four games of the 2016 season, Brady would lead the Patriots to win 11 out of the 12 remaining regular season games (to finish 14–2) and two postseason games to make his seventh Super Bowl appearance. Brady and the Patriots would overcome a 28–3, 3rd quarter deficit against the Atlanta Falcons to force overtime, winning 34–28 to give Brady his fifth Super Bowl title.[100] He earned his fourth Super Bowl MVP award after setting title-game records for appearances, pass attempts, completions, passing yards and fourth-quarter comebacks.[101] In his eighth appearance, capping the 2017 season, Brady threw for 505 yards, setting a record for most passing yards in a Super Bowl, but the Patriots lost to the Philadelphia Eagles. The Patriots won Super Bowl LIII in 2018, earning Brady his sixth super bowl title, becoming the first player in history to have won six Super Bowls.[102]\n\nOver his career, Brady has won three league MVP awards, six Super Bowls, and four Super Bowl MVP Awards. A 14-time Pro Bowler, Brady has also twice led the NFL in passing yards.[103][104] As of November 2017, he owns the third-highest career passer rating (97.9) among quarterbacks with at least 1,500 career passing attempts.[105] He has thrown for more passing yards and touchdowns than any other quarterback in NFL postseason history; he also has won more playoff games than any other quarterback. As a result of his highly successful career, Brady is rated among the greatest quarterbacks of all time.[106]\n\nBrady's name has become associated with two NFL rules, which sports reporters have called the \"Brady rules\". One is the tuck rule that was in effect from 1999 through 2013.[107] The other is a rule about low hits enacted in 2009: \"A defender cannot initiate a roll or lunge and forcibly hit the passer in the knee area or below, even if he is being contacted by another player.\"[108]\n\nNew England Patriots\n\n2000 season: Rookie year\n\nBrady was selected with pick number 199, a compensatory pick, in the sixth round of the 2000 NFL Draft.[109] He and his family had believed that Brady would be drafted in the second or third round; they watched the draft on television, stunned as six other quarterbacks were drafted before he was. Brady was so embarrassed that he briefly left the family home during the sixth round, and cried when recalling the experience for an interview 11 years later. When the Patriots notified him that he would be drafted, Brady was grateful that, he later said, he would not \"have to be an insurance salesman\".[110] According to Michael Holley's book Patriot Reign, the Patriots were considering Brady and Tim Rattay, both of whom had received positive reviews from then-quarterbacks coach Dick Rehbein.[111] Ultimately, the Patriots front office chose Brady. Considering his subsequent success, many analysts have called Brady the best NFL draft pick of all time.[112][113][114][115] Patriots owner Robert Kraft recalled: \"I still have the image of Tom Brady coming down the old Foxboro Stadium steps with that pizza box under his arm, a skinny beanpole, and when he introduced himself to me and said 'Hi Mr. Kraft,' he was about to say who he was, but I said 'I know who you are, you're Tom Brady. You're our sixth round draft choice,'\" recalled Kraft. \"And he looked me in the eye and said 'I'm the best decision this organization has ever made.' It looks like he could be right.\"[116]\n\nBrady started the season as the fourth-string quarterback, behind starter Drew Bledsoe and backups John Friesz and Michael Bishop; by season's end, he was number two on the depth chart behind Bledsoe.[117] During his rookie season, he was 1-for-3 passing, for six yards.[118] Tight end Rod Rutledge caught Brady's first and only completed pass of the season in a 34–9 loss to the Detroit Lions on November 23.[119][120]\n\n2001 season\n\nWith Bledsoe as the starting quarterback, the Patriots opened the season with a 23–17 road loss to the Cincinnati Bengals.[118] In their second game and home opener on September 23, the Patriots squared off against their AFC East rivals, the New York Jets. Bledsoe was again the starter; in the fourth quarter, he suffered internal bleeding after a hit from Jets linebacker Mo Lewis. Bledsoe returned for the next series, but was replaced with Brady for the Patriots' final series of the game. Brady completed five of ten passes for 46 yards, but New York held on to win, 10–3, and the Patriots fell to 0–2 on the season.[121] Brady was named the starter for the season's third game, against the Indianapolis Colts. In his first two games as starter, Brady posted unspectacular passer ratings of 79.6 and 58.7, respectively, in a 44–13 victory over the Colts (in their last season in the AFC East) and a 30–10 loss to the Miami Dolphins.[122][123][124]\n\nIn the Patriots' fifth game, Brady began to find his stride. Trailing the visiting San Diego Chargers 26–16 in the fourth quarter, he led the Patriots on two scoring drives to force overtime, and another in overtime to set up a winning field goal. Brady finished the game with 33 of 54, for 364 yards, and two touchdowns, and was named AFC Offensive Player of the Week for the first time in his career.[125][126] The following week, Brady again played well during the rematch at Indianapolis, with a passer rating of 148.3 in a 38–17 win.[127] The Patriots went on to win eleven of the fourteen games Brady started, and six straight to finish the regular season, winning the AFC East and entering the 2001–02 NFL playoffs with a first-round bye.[128] In that stretch was a Week 11 34–17 victory over the New Orleans Saints where he was 19 of 26 for 258 passing yards and four touchdowns to earn his second AFC Offensive Player of the Week nod in 2001.[129] In Week 15, against the Miami Dolphins, he recorded a 23-yard reception from Kevin Faulk on a trick play.[130] Brady finished the 2001 season with 2,843 passing yards and 18 touchdowns and earned an invitation to the 2002 Pro Bowl.[118][131]\n\n2001 postseason\n\nIn Brady's first playoff game, he threw for 312 yards against the Oakland Raiders and led the Patriots back from a ten-point fourth-quarter deficit to send the game to overtime, where they won on an Adam Vinatieri field goal. A controversial play occurred in the fourth quarter of that game. Trailing by three points, Brady lost control of the ball after being hit by Raiders cornerback and former Michigan teammate Charles Woodson. Oakland initially recovered the ball, but, citing the \"tuck rule,\" which states that any forward throwing motion by a quarterback begins a pass even if the quarterback loses possession of the ball as he is attempting to tuck it back toward his body, referee Walt Coleman overturned the call on instant replay, ruling it an incomplete pass rather than a fumble.[132] Brady finished the game 32-of-52 for 312 passing yards and one interception.[133]\n\nIn the AFC Championship Game against the Pittsburgh Steelers, Brady injured his knee, and was relieved by Bledsoe.[134] The Patriots won the game by a score of 24–17 and were immediately installed by Las Vegas oddsmakers as 14-point underdogs against the NFC champion St. Louis Rams in Super Bowl XXXVI.[135][136]\n\nBrady returned from his knee injury in the AFC Championship Game to start in the Super Bowl a week later at the Louisiana Superdome in New Orleans. Despite being heavy underdogs, the Patriots played well, holding the Rams' high powered offense in check through the first three quarters. The Rams rallied from a 17–3 deficit to tie the game with 1:30 left in regulation. The Patriots then got the ball back at their own 17-yard line with no timeouts remaining. Sportscaster and former Super Bowl-winning coach John Madden said he thought the Patriots should run out the clock and try to win the game in overtime.[137] Instead, Brady drove the Patriots' offense down the field to the Rams' 31-yard line before spiking the ball with seven seconds left. Kicker Adam Vinatieri converted a 48-yard field goal as time expired to give the Patriots a 20–17 win and their first ever league championship.[138] Brady was named MVP of Super Bowl XXXVI while throwing for 145 yards, one touchdown, and no interceptions. At the age of 24 years and six months, Brady surpassed Joe Namath in Super Bowl III and Joe Montana in Super Bowl XVI, who were both 25 years, seven months, and 13 days old at the time of their victories, to earn the title of youngest quarterback to win a Super Bowl.[139][140] A possible quarterback controversy was averted when Bledsoe was traded to the Buffalo Bills during the off-season; this event cemented Brady's status as the starting quarterback.[141]\n\n2002 season\n\nIn the 2002 season opener, Brady had 294 passing yards and three touchdowns in the 30–14 victory over the Pittsburgh Steelers to earn his third AFC Offensive Player of the Week title.[142][143] In Week 9, in a 38–7 victory over the Buffalo Bills, he had 265 passing yards and three touchdowns to earn another AFC Offensive Player of the Week nod.[144][145] Brady and the Patriots finished the year at 9–7, tied with the New York Jets and Miami Dolphins for the best record in the division; however, the Jets won the division on the third tiebreaker, and the Patriots missed the playoffs.[146] Though Brady posted a career-low single-season passer rating of 85.7 and a career-high of 14 interceptions, he threw for a league-leading 28 touchdown passes and 921 more yards than in the 2001 season.[122]\n\n2003 season\n\nAfter opening the 2003 NFL season with a 2–2 start, Brady led the Patriots to twelve consecutive victories to finish the regular season in winning the AFC East.[147] In Week 9, against the Denver Broncos, he had 350 passing yards, three touchdowns, and one interception in the 30–26 victory to earn his fifth AFC Offensive Player of the Week honor.[148][149] In Week 14, a 12–0 victory against the Miami Dolphins, he recorded a 36-yard punt in the game.[150] Statistically, Brady's strongest game of the season was in Week 17 against the division rival Buffalo Bills, when he achieved a season-high quarterback rating of 122.9, and was named AFC Offensive Player of the Week.[122][151] Brady finished with 3,620 passing yards and 23 touchdowns,[118] and was third in NFL MVP voting to co-winners Peyton Manning and Steve McNair.[152]\n\n2003 postseason\n\nIn the first two rounds of the playoffs, the Patriots defeated the Tennessee Titans in the Divisional Round by a score of 17–14. In the win, Brady was 21 of 41 for 201 passing yards and one passing touchdown.[153] In the following round, they defeated Indianapolis Colts in the AFC Championship by a score of 24–14. Brady completed 22 of 37 passes for 237 yards, one passing touchdown, and an interception.[154] On February 1, 2004, Brady led the Patriots to a 32–29 victory over the NFC champion Carolina Panthers in Super Bowl XXXVIII and was named Super Bowl MVP for the second time. During the game, Brady threw for 354 yards with three touchdowns and set the record for most completions by a quarterback in a Super Bowl with 32. With 1:08 left in the fourth quarter and the score tied 29–29, Brady engineered a drive with five pass completions to put the Patriots in position for the game-winning 41-yard field goal by Vinatieri.[155][156]\n\n2004 season\n\nDuring the 2004 season, Brady helped the Patriots set an NFL record with 21 straight wins dating from the previous year, an accomplishment honored in the Pro Football Hall of Fame (though for official records, the NFL considers it an 18-game regular season winning streak; it does not count playoff games).[157] New England finished with a 14–2 record, equaling their 2003 record and the best regular-season record ever for a defending champion.[158] The Patriots also won the AFC East divisional title for the third time in four years.[159] Brady threw for 3,692 yards and 28 touchdowns, with a 92.6 passer rating, and was voted to his second Pro Bowl.[118]\n\n2004 postseason\n\nIn the playoffs, Brady led the Patriots to victories over the Indianapolis Colts in the Divisional Round by a score of 20–3 and the Pittsburgh Steelers in the AFC Championship by a score of 41–27.[160] Brady played his best game of the year in Pittsburgh despite requiring intravenous treatment the previous night when he ran a temperature of 103°.[161] Against the NFL's best defense,[160] he recorded a quarterback passer rating of 130.5, his highest of the season.[122] On February 6, 2005, the Patriots narrowly defeated the Philadelphia Eagles, 24–21, to win Super Bowl XXXIX at Alltel Stadium in Jacksonville, Florida. Brady threw for 236 yards and two touchdowns[162] while capturing the Patriots' third championship in four years. They became the first franchise since the Dallas Cowboys in 1992–1995 to win three Super Bowls in four years.[163]\n\n2005 season\n\nDuring the 2005 season, injuries suffered by running backs Corey Dillon, Patrick Pass, and Kevin Faulk forced the Patriots to rely more on Brady's passing.[164][165] Brady also had to adjust to new center Russ Hochstein and running back Heath Evans. On October 9, in a 31–28 victory over the Atlanta Falcons, he had 350 passing yards, three touchdowns, and one interception to earn AFC Offensive Player of the Week honors.[166][167] Brady finished first in the league with 4,110 passing yards and third in the league with 26 touchdowns.[118] At 92.3, his 2005 passer rating was the second-highest of his career at the time, although he equaled his career high for interceptions with 14.[122] He rushed for 89 yards and fumbled a career-low four times.[122] He and the Patriots finished with a 10–6 record, winning their third straight AFC East title.[168] He was named to his third Pro Bowl at the end of the season.[169]\n\n2005 postseason\n\nIn the playoffs, Brady recorded 201 passing yards and three passing touchdowns to help lead the Patriots to a 28–3 victory over the Jacksonville Jaguars in the Wild Card Round. On January 14, 2006, the Patriots lost 27–13 to the Denver Broncos at INVESCO Field in the Divisional Round.[170][171] Brady threw for 341 yards in the game with one touchdown and two interceptions, in the first playoff loss of his career after ten playoff victories.[172] After the season's end, it was revealed that Brady had been playing with a sports hernia since December. Linebacker Willie McGinest commented on it and said he knew, but Brady continued playing.[173]\n\n2006 season\n\nBrady started the 2006 season with 163 passing yards, two passing touchdowns, and an interception against the Buffalo Bills in a 19–17 victory.[174] In Week 8, against the Minnesota Vikings, he had one of his stronger performances of the season with 372 passing yards, four passing touchdowns, and one interception in the 31–7 victory.[175] He posted another game with four passing touchdowns in the Week 11 35–0 victory over the Green Bay Packers.[176] Brady led the Patriots to a 12–4 record and the fourth seed in the AFC playoffs.[177] In the regular season, Brady threw for 3,529 yards and 24 touchdowns.[118] He was not among the players initially selected to the Pro Bowl,[178] although he was offered an injury-replacement selection when San Diego Chargers quarterback Philip Rivers was forced to withdraw. Brady ended up declining the invitation.[179]\n\n2006 postseason\n\nIn the postseason, the Patriots first hosted their division rivals, the New York Jets, in the Wild Card Round. The Patriots defeated the Jets 37–16, as Brady went 22–34 for 212 yards and two touchdowns.[180] The Patriots traveled to San Diego to take on the Chargers in the Divisional Round. This was Brady's first playoff game in his home state of California. Brady and the Patriots struggled against the Chargers, whom many had picked as favorites to win Super Bowl XLI.[181] With eight minutes left in the fourth quarter and the Patriots down by eight points, Brady and the Patriots started a key drive that would ultimately decide the game. After a 49-yard pass play to wide receiver Reche Caldwell, a Stephen Gostkowski field goal gave the Patriots a 24–21 lead with 1:10 remaining. The Chargers drove down and attempted to tie the game with a 54-yard field goal attempt from Nate Kaeding, but it went no good and the Patriots won.[182]\n\nIn the AFC Championship, the Patriots faced the Indianapolis Colts. The Patriots and Colts had faced each other twice in the previous three postseasons at Foxborough; this game, however, was played at Indianapolis. The Patriots led at halftime, 21–6; however, the Colts and Peyton Manning staged a comeback, culminating in a last minute interception thrown by Brady, and the Patriots lost the game to the Colts, 34–38.[183] Brady finished the loss 21 of 34 for 232 yards, one touchdown, and one interception.[184]\n\n2007 season\n\nPlaying with a dramatically overhauled receiver corps—in the 2007 off-season, the Patriots acquired wide receivers Donté Stallworth, Wes Welker, Kelley Washington, and Randy Moss; tight end Kyle Brady; and running back Sammy Morris—Brady enjoyed what some sportswriters described as one of the best seasons by a quarterback.[185][186] The average score of a 2007 Patriots regular-season game would be 37–17 by the end of the year.[187] Brady led the Patriots to the first 16–0 regular-season record in league history, outscoring opponents by more than a 2-to-1 margin, but also attained numerous career, franchise, and NFL records and milestones in the process. He was named as the AFC Offensive Player of the Week five separate times that year.[188][189][190][191][192] While away at Dallas, he had a career-high five passing touchdowns in a 48–27 win. The win tied him with Cowboys Hall of Fame quarterback Roger Staubach for the most wins ever by a starting quarterback in his first 100 regular-season games, with 76.[193] The next week, in part of a 49–28 win at Miami, he had yet another record day, with a career-high six passing touchdowns, setting a franchise record. He also had the first game with a perfect passer rating of his career.[194] Two weeks later, as part of a come-from-behind 24–20 victory at Indianapolis, he threw for another three touchdowns, the ninth consecutive game in which he had done so, breaking Peyton Manning's NFL record of eight.[195] During the last game of the year against the New York Giants, Brady threw two touchdown passes; his second touchdown was his 50th, breaking Peyton Manning's record of 49 in the 2004 season.[196]\n\nBrady in Baltimore in December 2007\n\nBrady finished the season with 4,806 passing yards, 50 touchdown passes, and only eight interceptions. It was unanimously voted the greatest passing season of all time by ESPN in 2013. His 50:8 touchdown to interception ratio was, at the time, an NFL record. He became the first quarterback to pass for 50 touchdowns in a season and his 117.2 passer rating is[when?] the fourth highest in a single season. His 8.7% touchdown passing percentage is[when?] the third highest ever in a season. He led the Patriots to becoming the first team to ever go undefeated in the regular season since the 16 game schedule was enforced and directed an offense that scored a then NFL record 589 points and 75 total touchdowns. Those records stood until they were eclipsed by the 2013 Denver Broncos. The team's 50 total touchdown passes is the fourth most ever in a season. For his efforts, Brady was named the Most Valuable Player of this season, as well as Offensive Player of the Year. He was also honored by the Associated Press as their Male Athlete of the Year, the first time an NFL player has been so honored since Joe Montana won the award in 1990.[197] He was named as a First Team All-Pro and to his fourth career Pro Bowl as a result of his historic season.[198][199]\n\n2007 postseason\n\nIn the Patriots' first playoff game, a Divisional Round game against Jacksonville, Brady began the game with an NFL postseason record 16 consecutive completed passes, and finished the game with 26 completions in 28 attempts, a completion rate of 92.9%. That mark is the highest single-game completion percentage (for passers with at least 20 attempts) in NFL history, regular season or postseason.[200] With the win, the Patriots matched the undefeated 1972 Miami Dolphins as the only team to win 17 consecutive games in one season.\n\nStatistically, Brady did not fare as well in the AFC Championship Game against the San Diego Chargers, throwing for 209 yards, two touchdowns, three interceptions (including his first interception in the red zone since the playoff loss to Denver in the 2005 postseason). Nevertheless, the Patriots won their 18th game of the season, 21–12, to advance to the Super Bowl for the fourth time in seven seasons. Brady, with the 100th win of his career, also set an NFL record for the fewest games needed by a starting quarterback to do so: his 100–26 record is sixteen games better than Joe Montana's.[201] In Super Bowl XLII at the University of Phoenix Stadium in Glendale, Arizona, Brady was pressured heavily and sacked five times. The Patriots did manage to take the lead with a Brady touchdown to Moss with less than three minutes remaining in the fourth quarter, but the Giants were able to drive and score a last-minute touchdown to upset the Patriots 17–14, taking away what would have been the first perfect season since the NFL expanded its regular season to 16 games.[202]\n\nBrady in action against the Washington Redskins on August 28, 2009.\n\n2008 season\n\nBrady did not play in any games during the 2008 preseason or in the 2008 Pro Bowl due to two different foot injuries.[203][204] In the Patriots' 2008 season opener against the Kansas City Chiefs at Gillette Stadium, Brady's left knee was seriously injured midway through the first quarter on a hit by Chiefs safety Bernard Pollard; he left the game and did not return. The team later confirmed that Brady would require surgery, and it would prematurely end his 2008 season.[205] Brady tore both his anterior cruciate ligament and medial collateral ligament.[206] The injury ended Brady's streak of 111 consecutive starts (ninth in the list of most consecutive starts by an NFL quarterback, behind Brett Favre, Peyton Manning, Eli Manning, Philip Rivers, Matt Ryan, Matthew Stafford, Ron Jaworski, and Joe Flacco).[207] Dr. Neal ElAttrache performed the anterior cruciate ligament reconstruction at the Los Angeles Kerlan-Jobe Orthopaedic Clinic October 6, using Brady's patellar tendon graft to replace the torn ligament, and also repaired his medial collateral ligament, through a separate incision in his left knee.[208] An infection in the wound resulted in further debridement surgery several times since the original procedure. Brady received IV antibiotics for this infection which, at the time, threatened to delay his rehab.[209][210] Despite Brady's absence, the Patriots managed to finish the 2008 season with an 11–5 record; however, due to tiebreakers, the Patriots not only failed to win the AFC East division title, but missed the playoffs altogether for the first time since the 2002 season.[211]\n\n2009 season\n\nBrady playing on October 11, 2009 against the Denver Broncos\n\nIn his first game in nearly a year, Brady threw for 378 yards and two touchdowns in the 2009 season opener against the Buffalo Bills. In the final three minutes of the game, the Patriots were down 24–13 before Brady and tight end Benjamin Watson connected on two straight touchdowns to lead the Patriots to a 25–24 win.[212] Brady was named the AFC Offensive Player of the Week for the 13th time in his career for his performance.[213]\n\nOn October 18, 2009, in an early season snowstorm, Brady set an NFL record against the Tennessee Titans for most touchdowns in a single quarter, throwing five in the second quarter. Brady finished the game with six touchdowns, tying his career-high from the 2007 season, and 380 yards, completing 29-of-34 attempts, finishing with a nearly perfect passer rating of 152.8.[214][215] He earned his second AFC Offensive Player of the Week nod for his efforts against the Titans.[216] The Patriots' 59–0 victory over the Titans tied the record for the largest margin of victory since the 1970 AFL-NFL merger,[217] and set a record for largest halftime lead in NFL history, which was 45–0.[218]\n\nBrady finished the 2009 regular season with 4,398 yards passing and 28 touchdowns for a 96.2 rating,[118] despite a broken right ring finger and three fractured ribs, all which were suffered over the course of the season.[219] He was selected as a reserve to the 2010 Pro Bowl and named the 2009 NFL Comeback Player of the Year.[220][221]\n\n2009 postseason\n\nBrady ended the 2009 season throwing for 154 passing yards, two touchdowns, and three interceptions in a Wild Card Round loss to the Baltimore Ravens, 33–14, his first career home playoff loss, and the first playoff loss at home by a Patriots quarterback since Steve Grogan lost to the Houston Oilers in the 1978 Divisional Round.[222]\n\n2010 season\n\nOn September 10, 2010, Brady signed a four-year, $72 million contract extension, making him the highest-paid player in the NFL. The extension included $48.5 million in guaranteed money.[223]\n\nBrady became the quickest quarterback to achieve 100 regular season wins by helping his team defeat the Miami Dolphins 41–14 on October 4.[224] In a 31–28 win over the Indianapolis Colts on November 21, Brady tied Brett Favre's record of winning 25 consecutive regular-season home starts.[225] Brady's last regular-season defeat at home was a 17–14 loss to the New York Jets on November 12, 2006.[226] On November 25, in a 45–24 victory over the Detroit Lions, he had 341 passing yards and four touchdowns to earn AFC Offensive Player of the Week.[227][228] In the game, he earned a perfect passer rating for the second time in his career.[229][230] The next week, in a 45–3 victory over the New York Jets, he had 326 passing yards and four touchdowns to earn AFC Offensive Player of the Week honors for the second consecutive week. The victory over the Jets set an NFL record by winning 26 consecutive regular-season home starts.[231][232][233]\n\nBrady threw for 3,900 yards with 36 touchdowns and only four interceptions on the season.[118] He had a 111.0 passer rating; this gave him — at the time — two of the top five season ratings in NFL history and made him the first player to finish with a rating above 110 in two different seasons.[234] The 2010 Patriots also tied an NFL record for a team by throwing only five interceptions in an entire season; as in addition to another touchdown towards the team total, Brian Hoyer also threw the first interception of his career.[235]\n\nBrady was selected as a starter to the 2011 Pro Bowl.[236] However, he pulled out of the game (and was replaced by his former backup Matt Cassel, who then played for the Kansas City Chiefs) after undergoing surgery for a stress fracture in his right foot dating back to 2008.[237] Brady was also the only unanimous selection for the AP All-Pro Team and was named the 2010 Associated Press NFL Offensive Player of the Year. By unanimous decision, he won the MVP award for the second time in his career.[238] On the NFL Top 100 Players of 2011 players' list, Brady was ranked as the best player in the NFL by his fellow players.[239]\n\n2010 postseason\n\nAfter earning the #1 seed and a bye week, the Patriots lost to the New York Jets in the Divisional Round by a score of 28–21. Brady finished the game 29-of-45 for 299 yards and two touchdowns, with one interception. His one interception ended his NFL record of consecutive pass attempts without an interception at 340.[240][241]\n\n2011 season\n\nBrady in 2011 in Denver\n\nIn Week 1 of the 2011 NFL season, Brady threw for a career-high 517 yards, four touchdowns, and one interception in a 38–24 victory over the Miami Dolphins and earned AFC Offensive Player of the Week honors.[242] In the game, he threw a record-tying 99-yard touchdown pass to Wes Welker.[243][244][16] In the next game, a 35–21 victory over the San Diego Chargers, he had 423 passing yards and three touchdowns to earn another AFC Offensive Player of the Week nod.[245][246] In Week 16, against the Miami Dolphins, Brady had 304 passing yards and one passing touchdown to go along with nine rushes for 17 yards and two rushing touchdowns in the 27–24 victory to earn AFC Offensive Player of the Week for the third time in 2011.[247][248] In the regular season finale against the Buffalo Bills, Brady became the fourth quarterback to throw for 5,000 yards in a single season, finishing with 5,235; although Brady surpassed Dan Marino's longstanding record of 5,084 passing yards, he finished the season second in passing yards behind Drew Brees' 5,476.[118] The Patriots finished the season 13–3 and clinched the AFC's #1 seed.[249] For his efforts in the 2011 season, Brady was named to the Pro Bowl and was named as the fourth best player in the NFL on the NFL Top 100 Players of 2012 by his peers.[250][251]\n\n2011 postseason\n\n[252] There's no quarterback I'd rather have than Tom Brady. He's the best. He does so much for us in so many ways on so many different levels. I'm very fortunate that he's our quarterback and what he's able to do for this team. It's good to win with him and all the rest of our players. If that's more than somebody else did, I don't really care about that. —Bill Belichick\n\nIn the Patriots' 45–10 win over the Denver Broncos in the Divisional Round, Brady set a personal postseason best with 363 passing yards, and tied an NFL playoff record shared by Daryle Lamonica and Steve Young, throwing for six touchdown passes.[253] The win, his first postseason win since the 2007 season, gave Brady and Patriots head coach Bill Belichick sole possession of the NFL record for postseason wins by a quarterback-head coach duo with 15.[254] In the AFC Championship game against the Baltimore Ravens, Brady failed to throw a touchdown pass for the first time in 36 games, though he did pass for 239 yards and scored a one-yard rushing touchdown late in the game. A missed field goal from Ravens kicker Billy Cundiff gave Brady and the Patriots a 23–20 victory, sending Brady to his fifth Super Bowl.[255] In Super Bowl XLVI at Lucas Oil Stadium in Indianapolis, Brady and the Patriots met the New York Giants in a rematch of their Super Bowl XLII meeting four years earlier. On the Patriots' first offensive series, Brady was penalized for intentional grounding in the end zone, giving up a safety which gave the Giants an early 2–0 lead. Brady would bounce back from this early blunder, leading a Super Bowl record-tying 96-yard touchdown drive to close the first half and at one point completing 16 consecutive passes to give him a 20-of-23 mark partway into the third quarter, another Super Bowl record.[256] However, as was also the case four years earlier, the Patriots could not hold a late lead and allowed Eli Manning to lead the Giants to a game-winning touchdown with less than a minute left, giving Brady his second career Super Bowl loss.[257]\n\n2012 season\n\nBrady started all 16 regular season games of the 2012 NFL season and led the Patriots to a 12–4 record. Among the many highlights of the team was a 42–14 win over the Houston Texans in Week 14. Brady had 296 passing yards and four touchdowns to earn AFC Offensive Player of the Week.[258][259] The Patriots scored 557 total points, the third highest in league history and Brady became the first quarterback to lead his team to ten division titles.[260] With that point total, the Patriots became the first team to score at least 500 points in a season four different times, with Brady leading all four squads, which was a record as well. He finished the season with 4,827 passing yards, 34 touchdowns, only eight interceptions, and a passer rating of 98.7. It was Brady's third straight season throwing for over 30 touchdowns.[261] He was named to the Pro Bowl for the eighth time in his career.[262] On the NFL Top 100 Players of 2013, Brady was ranked fourth by his fellow players for the second consecutive year.[263]\n\n2012 postseason\n\nBrady started both Patriots playoff games, winning 41–28 over the Houston Texans in the Divisional Round.[264] Brady passed for 344 yards and three touchdowns as he led the team to the AFC Championship Game. With the victory, Brady surpassed Joe Montana for most career playoff wins, with 17.[265] The Patriots were then upset by the eventual Super Bowl XLVII champion Baltimore Ravens, 28–13 in the AFC Championship. He threw for 320 yards and one touchdown with two interceptions.[266] He suffered his first career loss at home when leading by halftime, in which he was previously 67–0.[267]\n\nOn February 25, 2013, Brady and the Patriots agreed on a three-year contract extension, which kept him with the team through 2017.[268] Sportswriter Peter King called it an \"amazing\" deal, as Brady took just $27 million in new money over the 2015, 2016, and 2017 seasons, and also noted that it reflected Patriots owner Robert Kraft's desire to make sure that Brady retired as a Patriot.[269]\n\n2013 season\n\nBrady and the Patriots began the season with much upheaval on the offensive side of the ball. Tight end Rob Gronkowski was injured and Aaron Hernandez was arrested. Wes Welker departed to the Denver Broncos, Danny Woodhead left in free agency for the San Diego Chargers, and Brandon Lloyd was released from the team. In order to replace the five players, the Patriots signed Danny Amendola in free agency from the Rams, drafted rookie wide receivers Aaron Dobson and Josh Boyce, and signed undrafted rookie free agent wide receiver Kenbrell Thompkins. In the first two games of the season, Brady completed 52% of his passes and had three touchdowns and one interception.[270][271]\n\nBrady during the 2013 season\n\nBrady was in pursuit of Drew Brees's record of at least one touchdown in 54 consecutive regular season games and saw the streak end at 52 games in a Week 5 loss against the Cincinnati Bengals.[272] In a Week 6 game against the Saints, the Patriots struggled in the first half and bounced back in the second with Brady passing for 269 yards with a touchdown to Kenbrell Thompkins as time expired to pull out the win over the Saints.[273]\n\nIn Week 12, Brady faced-off against Peyton Manning for the fourteenth time in his career. After going to the half trailing by 24 points, Brady and the Patriots scored 31 unanswered points. The Patriots won after a muffed punt in overtime when Stephen Gostkowski scored a field goal.[274] With the win, Brady earned AFC Offensive Player of the Week honors.[275] With a Week 16 win over the Baltimore Ravens, Brady collected his 147th win as a starting quarterback to tie Dan Marino for fourth place all time, and the following week he defeated the Buffalo Bills to tie John Elway for third place. In the victory over the Bills, Brady recorded a 32-yard punt.[276] Brady was named to the Pro Bowl for the ninth time in career and was ranked third on the NFL Top 100 Players of 2014 players' list in the off-season.[277][278]\n\n2013 postseason\n\nBrady's Patriots finished the season 12–4, to earn the second seed in the AFC and a first-round bye.[279] In the Divisional Round matchup against the Indianapolis Colts, Brady made his 25th playoff appearance, breaking Brett Favre's career record for playoff appearances by a quarterback (Jerry Rice appeared in 29 playoff games). He passed for 198 yards as the Patriots won 43–22 behind a four-touchdown performance from running back LeGarrette Blount.[280] The following week, the Patriots lost 26–16 to the Denver Broncos in the AFC Championship. In the loss, Brady was 24-for-38 for 277 yards and touchdown, along with two carries for seven yards and a rushing touchdown.[281]\n\n2014 season\n\nBrady started the 2014 season with a 33–20 loss to the Miami Dolphins.[282] It was Brady's first opening day loss since the 2003 season. Brady recorded 241 yards and a touchdown in the loss. New England rebounded against the Minnesota Vikings, but Brady struggled, throwing for 149 yards and a touchdown in a 30–7 win.[283] Against the Oakland Raiders, Brady was pressured all day, but threw for 234 yards and a touchdown in 16–9 win.[284] After a humiliating 41–14 loss to the Kansas City Chiefs, Brady led New England to back-to-back wins against the Cincinnati Bengals and the Buffalo Bills.[285][286] Brady then defeated the New York Jets with a 261-yard performance that included three touchdowns.[287] The following week, a 51–23 embarrassment of the Chicago Bears saw Brady throw for 354 yards and a season-high five touchdowns.[288] After passing for 333 yards, and 257 yards in his next two games against the Denver Broncos and Indianapolis Colts respectively, Brady defeated the Detroit Lions 34–9 with 349 passing yards and two touchdowns against only one interception.[289] The Patriots winning streak was put to the test against the Green Bay Packers in Week 13. Down 13–0 early, Brady threw for 245 yards and two touchdowns. Still down 26–21, Brady was unable to give the Patriots their eighth consecutive victory.[290] After trailing 14–3 at the San Diego Chargers, Brady rallied his team with 317 passing yards, two touchdowns, and one interception, to a 23–14 comeback win.[291] Brady clinched his NFL record 12th AFC East division title with 287 passing yards, two touchdowns, and an interception. Brady struggled in his final two games, throwing for only 182 yards, a touchdown, and an interception in 17–16 victory against the Jets, and 80 yards in one half of the final regular season game against the Buffalo Bills, a 17–9 loss, though Julian Edelman, Rob Gronkowski, and three starting offensive linemen did not play either the entirety or the majority of the final game, and Brady only played in the first half.[292] Brady was named to his tenth career Pro Bowl and was ranked third by his fellow players on the NFL Top 100 Players of 2015.[293][294]\n\n2014 postseason\n\nIn a 35–31 Divisional Round win over the Ravens, Brady threw for three touchdowns and ran in a fourth, breaking Curtis Martin's club record for rushing touchdowns in the playoffs; Brady also broke Joe Montana's record for playoff touchdowns with 46.[295] After the Ravens scored on their first two possessions, the Patriots were quickly down 14–0. Brady led New England on an eight-play, 78-yard drive, and ran for a score to cut the Ravens lead to 14–7. In the second quarter, Brady's 15-yard touchdown pass to Danny Amendola tied the score at 14–14. After getting the ball back, Brady threw an interception at the end of the first half. Joe Flacco capitalized on it by throwing an 11-yard touchdown strike to tight end Owen Daniels to give Baltimore a 21–14 halftime lead. Down 28–14, Brady engineered an 80-yard drive, culminating in a touchdown to Rob Gronkowski to cut the lead to 28–21. The Patriots tied the game once again at 28 off of a trick play where Brady passed laterally to Julian Edelman who then threw a 51-yard touchdown to Amendola. Ravens kicker Justin Tucker converted a 25-yard field goal to give Baltimore a 31–28 fourth quarter lead. Brady got the ball back, and threw a 23-yard touchdown to wide receiver Brandon LaFell to give the Patriots their first lead, 35–31, with 5:13 remaining. After a Duron Harmon interception and a Joe Flacco Hail Mary attempt failed, Brady clinched his record ninth AFC Championship Game, fourth straight, and the third championship game against the Indianapolis Colts.[296] After a 45–7 blowout, Brady advanced to play in his sixth Super Bowl, breaking a tie with John Elway for most career Super Bowl appearances by a quarterback. Against the Colts, Brady threw for 226 yards and three passing touchdowns with one interception.[297]\n\nIn Super Bowl XLIX at University of Phoenix Stadium in Glendale, Arizona, Brady completed 37-of-50 passes for 328 yards, four touchdowns, and two interceptions. He guided a then-record ten-point fourth quarter comeback as the Patriots defeated the Seattle Seahawks 28–24 to give Brady his fourth Super Bowl ring, tying him with Joe Montana and Terry Bradshaw for most Super Bowl victories by a starting quarterback.[298] He was named Super Bowl MVP for the third time, tying Montana's record.[299] Brady's 37 completed passes in the game set a Super Bowl record at the time, which Brady himself would break in Super Bowl LI two years later.[300]\n\n2015 off-season\n\nOn May 6, 2015, the NFL published a 243-page report regarding the deflation of footballs used in the previous season's AFC Championship Game.[301] The report concluded that, more likely than not, Brady was at least generally aware of the intentional deflation. On May 11, Brady was suspended for four games by the NFL for his involvement based on \"substantial and credible evidence\" that Brady knew Patriots employees were deflating footballs and that he failed to cooperate with the investigators.[302] On May 11, Troy Vincent—NFL Executive Vice President of Football Operations—penned a letter to Brady that stated in part: \"Your actions as set forth in the report clearly constitute conduct detrimental to the integrity of and public confidence in the game of professional football.\" Vincent's letter further stated: \"With respect to your particular involvement, the report established that there is substantial and credible evidence to conclude you were at least generally aware of the actions of the Patriots' employees involved in the deflation of the footballs and that it was unlikely that their actions were done without your knowledge. Moreover, the report documents your failure to cooperate fully and candidly with the investigation, including by refusing to produce any relevant electronic evidence (emails, texts, etc.), despite being offered extraordinary safeguards by the investigators to protect unrelated personal information, and by providing testimony that the report concludes was not plausible and contradicted by other evidence.\" Brady, through the NFL Players Association, appealed the suspension on May 14.[304]\n\nOn July 28, NFL Commissioner Roger Goodell upheld Brady's four-game suspension.[305] Brady gave permission to the NFLPA to appeal the suspension in federal court.[306] Goodell cited Brady's destruction of his cell phone as a critical factor in his decision to uphold Brady's suspension.[307][308] The NFL also filed papers in federal court seeking to confirm Roger Goodell's decision.[309] On July 29 Brady released a statement on his Facebook page that criticized Goodell's decision to uphold the suspension, saying in part \"I am very disappointed by the NFL's decision to uphold the 4 game suspension against me. I did nothing wrong, and no one in the Patriots organization did either... I will not allow my unfair discipline to become a precedent for other NFL players without a fight.\"[310][311]\n\nBrady in November 2015 in Denver\n\nCommentary on the initial punishment was mixed. Bleacher Report writer Mike Freeman made a statement agreeing with Goodell's decision, saying the penalties were \"brutal, but it deserved to be.\"[312] Various commentators also implied that the prior reputation of the Patriots organization as a team that bends rules appeared to factor into the harshness of the punishment.[312][313] Others described the punishment as \"firm but fair\".[314]\n\nOn September 3, Judge Richard M. Berman of the United States District Court for the Southern District of New York vacated Brady's suspension; this ruling allowed Brady to play in the first four games of the 2015 NFL season. In his decision, Judge Berman cited the NFL's failure to provide proper notice to Brady of the charges against him and the potential for a suspension.[315] Post-appeal commentary also criticized Goodell for \"manipulating Brady's testimony\" at the appeal hearing in his decision.[316]\n\n2015 season\n\nIn the NFL Kickoff Game, Brady led the Patriots to a 28–21 win over the Pittsburgh Steelers. He threw for 288 yards and four touchdowns, three of them to Rob Gronkowski.[317] The Patriots' victory was the 161st victory of Brady's career, all with the Patriots, which surpassed the record held by former Green Bay Packers quarterback Brett Favre for most regular season wins by a starting quarterback with a single team.[318] In Week 2, Brady threw for 466 yards and three touchdowns against the Buffalo Bills. Through the first five games of the season, Brady threw a total of 14 touchdowns with one interception and had a quarterback rating of 118.4.[319] In Week 8, a 36–7 victory over the Miami Dolphins, he had 356 passing yards and four touchdowns to earn his 25th career AFC Offensive Player of the Week title.[320][321]\n\nDespite Brady's success, the Patriots were hit by many injuries to key players on offense, including wide receiver Julian Edelman, and the Patriots eventually lost their first game against the Denver Broncos, who were without Peyton Manning, in Denver on NBC Sunday Night Football after Thanksgiving following a 10–0 start.[322] The Patriots then lost three of their remaining five games to finish 12–4 for a fourth straight season, tied with the Cincinnati Bengals and Denver Broncos for the AFC's best record. The Denver Broncos clinched the No. 1 seed due to their victories over both the Patriots and the Bengals, while the Patriots finished with the AFC's No. 2 seed due to having a better record against common opponents than the Cincinnati Bengals.[323][324] Brady finished the regular season with a league-leading 36 touchdown passes and seven interceptions.[325] He was named to his 11th Pro Bowl (seventh straight), and was ranked as the second best player on the NFL Top 100 Players of 2016 behind only league MVP Cam Newton.[326][327]\n\n2015 postseason\n\nWith the return of Julian Edelman from a foot injury, the Patriots defeated the Kansas City Chiefs in the Divisional Round by a score of 27–20 after advancing with a first round bye.[328][329] Brady completed 28 of 42 passes for 302 yards and two passing touchdowns and one rushing touchdown as he led the team to their fifth consecutive appearance in the AFC Championship.[330] The Patriots advanced to the AFC Championship to face Peyton Manning and the Denver Broncos at Sports Authority Field at Mile High. It would turn out to be the 17th and final meeting between the two storied quarterbacks, as Manning would announce his retirement after the season ended. The Broncos' top-ranked defense limited Brady, who completed 27-of-56 passes with two interceptions and a passing touchdown, all day, and the Patriots eventually lost the game 20–18 after a potential game-tying two-point conversion attempt failed with less than half a minute remaining.[331]\n\n2016 off-season\n\nOn February 29, 2016, Brady signed a two-year contract extension covering the 2018 and 2019 seasons.[332] On March 3, the NFL appealed Judge Richard M. Berman's 2015 decision to vacate Brady's four-game suspension as punishment for his alleged role in the Deflategate scandal. At the hearing, the three-judge panel of the United States Court of Appeals for the Second Circuit questioned Players Association lawyer Jeffrey L. Kessler and NFL lawyer Paul Clement, with Circuit Judge Denny Chin stating that \"the evidence of ball tampering is compelling, if not overwhelming.\"[333]\n\nOn April 25, the decision to vacate Brady's four-game suspension was overturned by the U.S. Appeals Court.[334][335] Circuit Judge Barrington Daniels Parker Jr., joined by Circuit Judge Chin, wrote that they could not \"second-guess\" the arbitration but were merely determining it \"met the minimum legal standards established by the Labor Management Relations Act of 1947\".[336] Circuit Chief Judge Robert Katzmann dissented, writing that the NFL's fines for using stickum was \"highly analogous\" and that here \"the Commissioner was doling out his own brand of industrial justice.\"[337] On May 23, Brady appealed for his case to be reheard by the full U.S. 2nd Circuit Court.[338] The 2nd Circuit Court denied Brady's request for an en banc hearing on July 13.[339] On July 15, Brady announced on that he would give up his Deflategate fight and accept his suspension for the first four regular season games of the 2016 season.[340]\n\n2016 season\n\nBrady in Denver during the 2016 season\n\nAfter serving his four-game suspension, Brady made his 2016 season debut on October 9 on the road against the Cleveland Browns; he completed 28-of-40 passes for 406 yards and three touchdowns in a 33–13 victory to earn AFC Offensive Player of the Week.[341][342] In his home debut the following week, Brady completed 29-of-35 passes for 376 yards and three touchdowns in a 35–17 victory over the Cincinnati Bengals.[343] In Week 7, Brady completed 19 of 26 passes for 222 yards and two touchdowns as New England defeated the Pittsburgh Steelers 27–16.[344] The next week, the Patriots defeated the Buffalo Bills 41–25, with Brady completing 22-of-33 passes for 315 yards and four touchdowns.[345] Brady's outstanding numbers during his first four games following the suspension earned him the AFC Offensive Player of the Month award for October.[346]\n\nFollowing a bye week, Brady and the Patriots faced the Seattle Seahawks in a Week 10 rematch of Super Bowl XLIX. Brady completed 23-of-32 passes for 316 yards, one interception, and no touchdowns in a 31–24 loss that saw the two teams trade leads seven times.[347] In Week 11, Brady completed 24-of-40 passes for 280 yards, four touchdowns, and no interceptions in a 30–17 road win against his childhood team, the San Francisco 49ers. Brady's performance against San Francisco earned him AFC Offensive Player of the Week honors for Week 11.[348] Those four touchdown passes also gave him 444 career regular season touchdown passes with one team, breaking Brett Favre's record with the Green Bay Packers. The following week, Brady completed 30-of-50 passes for 286 yards and two touchdowns in a 22–17 road victory against the New York Jets.[349] The win was also the Patriots' 500th victory (including playoffs) in franchise history. During this victory, Brady also became the fifth quarterback to record 60,000 career regular season passing yards, joining Peyton Manning, Brett Favre, Drew Brees, and Dan Marino.[350] The following week, Brady completed 33-of-46 passes for 269 yards and one touchdown as the Patriots defeated the Los Angeles Rams by a score of 26–10.[351] The Patriots' win against the Rams gave Brady his 201st career victory, including playoff games, breaking Peyton Manning's record of 200.[352] In Week 14, Brady completed 25 of 38 passes for 406 yards, three touchdowns, and one interception during a 30–23 victory against the Baltimore Ravens on Monday Night Football.[353]\n\nThe next week, Brady completed 16-of-32 passes for 188 yards in a 16–3 road victory over the Denver Broncos.[354] With this victory, the Patriots clinched an eighth consecutive AFC East title and a seventh consecutive first-round bye in the playoffs, both NFL records.[355] On December 20, 2016, Brady was named to the Pro Bowl for the eighth straight season and 12th time overall.[356][357] In Week 16, Brady threw for 17 of 27 passes for 214 yards, three touchdowns, and no interceptions as he led the Patriots to a 41–3 win over the Jets.[358] In Week 17, Brady completed 25-of-33 passes for 276 yards, three touchdowns, and no interceptions in a 35–14 victory over the Miami Dolphins in the regular season finale that gave the Patriots home field advantage throughout the AFC playoffs.[359] Brady's 276 yards against Miami moved him ahead of former Miami quarterback Dan Marino into fourth place on the NFL's all-time passing yards list. Brady's three touchdowns against Miami also gave him 28 passing touchdowns against two interceptions for the regular season. This broke the previous record of Nick Foles's 27:2 TD:INT ratio which was set in 2013 with the Philadelphia Eagles.[360] Being as Garoppolo and Jacoby Brissett threw zero interceptions in the first four games the 2016 Patriots also shattered the NFL record for fewest interceptions in a season with just two. The previous record was five held by several teams, including the 2010 Patriots. Brady was named to the AP All-Pro Second Team, behind Matt Ryan of the Atlanta Falcons, who was named to the AP All-Pro First Team.[361] Brady was also ranked first on the NFL Top 100 Players of 2017 as the best player in the league, becoming the first player to be named as #1 twice since the listing started.[362]\n\n2016 postseason\n\nBrady hoisting the Vince Lombardi Trophy for the fifth time in his career after winning Super Bowl LI\n\nBrady and the Patriots began their postseason run in the Divisional Round, hosting the Houston Texans, who had the league's No. 1 total defense. Brady completed 18-of-38 passes for 287 yards, two touchdowns, and two interceptions as the Patriots won 34–16, clinching a record sixth consecutive trip to the AFC Championship Game.[363] In the AFC Championship, The Patriots hosted the Pittsburgh Steelers. Brady completed 32 of 42 passes for 384 yards, three touchdowns, and no interceptions in the 36–17 victory. The win gave Brady and Patriots head coach Bill Belichick their record seventh conference title as a quarterback–head coach tandem, and the Patriots an NFL record ninth Super Bowl appearance.[364]\n\nBrady and the Patriots faced the NFC champion Atlanta Falcons—who boasted the league's highest scoring offense—in Super Bowl LI at NRG Stadium in Houston, Texas on Sunday, February 5, 2017. Brady threw for 43 completions on 62 attempts for 466 passing yards—all Super Bowl records at the time. Brady also threw for two touchdowns and an interception, which was returned for a touchdown by Robert Alford in the second quarter. After trailing 28–3 midway through the third quarter, Brady and the Patriots scored 25 unanswered points to tie the game at the end of regulation. This resulted in the first overtime in Super Bowl history. After winning the overtime coin toss, Brady led the Patriots down the field to score a touchdown and win the game by a score of 34–28,[365] completing the largest comeback win in both team history and Super Bowl history. With the victory, Brady won his fifth Super Bowl, which set a record for most Super Bowl victories of any quarterback in history and tied defensive player Charles Haley for the most Super Bowl victories for any player. In addition, Brady set another record by winning his fourth Super Bowl MVP award for his clutch performance.[366]\n\nAfter the game, it was discovered that Brady's jersey had gone missing from the Patriots' locker room at NRG Stadium.[367] The FBI, in collaboration with Mexican authorities, recovered the jersey from the home of Martin Mauricio Ortega, a Mexican tabloid writer, along with Brady's jersey from Super Bowl XLIX.[368]\n\n2017 off-season\n\nOn May 12, 2017, Brady was announced as the cover athlete for Madden NFL 18.[369]\n\nIn a CBS interview on May 17, 2017, Charlie Rose asked Brady's wife, Gisele Bündchen, if she wanted Brady to retire, despite the fact that he was playing at a high level. Bündchen mentioned that Brady suffered from a concussion in the 2016 season, saying, \"I mean he has concussions pretty much every—I mean we don't talk about—but he does have concussions. I don't really think it's a healthy thing for anybody to go through.”[370][371]\n\nFollowing the Bündchen interview, the NFL released a statement: \"We have reviewed all reports relating to Tom Brady from the unaffiliated neurotrauma consultants and certified athletic trainer spotters who worked at Patriots' home and away 2016 season games as well as club injury reports that were sent to the league office. There are no records that indicate that Mr. Brady suffered a head injury or concussion, or exhibited or complained of concussion symptoms. Today we have been in contact with the NFLPA and will work together to gather more information from the club's medical staff and Mr. Brady\".[372][373] Brady's agent, Don Yee, said that Brady was not diagnosed with a concussion during the 2016 season.[374]\n\n2017 season\n\nThe Patriots opened up their 2017 season in the NFL Kickoff Game on September 7 at home against the Kansas City Chiefs. Brady had 267 passing yards in the game, which the Patriots lost 42–27.[375] In Week 2, Brady threw three touchdown passes in the first quarter of a game for the first time in his career in a 36–20 win over the New Orleans Saints.[376] He finished the game with 447 passing yards and three touchdowns, earning him his 28th AFC Offensive Player of the Week award,[377] breaking the record previously held by Peyton Manning for the most AFC Offensive Player of the Week awards in a career.[378] In Week 3, Brady threw for 378 passing yards and five touchdowns as he led the Patriots to a 36–33 comeback win against the Houston Texans, a performance that earned him AFC Offensive Player of the Week honors for the second straight week.[379] In Week 5, the Patriots' defeated the Tampa Bay Buccaneers 19–14. With this victory, Brady tied Peyton Manning and Brett Favre for the most regular season wins by a quarterback in NFL history with 186.[380] On October 10, it was unveiled that Brady was diagnosed with an AC joint sprain in his left (non-throwing) shoulder.[381][382] The next week, the Patriots defeated the New York Jets, 24–17. Brady obtained his 187th career win, setting the record for most regular season wins in NFL history.[383] In Week 7, the Patriots hosted the Atlanta Falcons in a rematch of Super Bowl LI. Brady was efficient, completing 21 of 29 passes for 249 yards and two touchdowns as the Patriots defeated the Falcons, 23–7.[384] In Week 10, the Patriots dominated the Denver Broncos, 41–16. Brady completed 25 of 34 passes for 266 yards and three touchdowns. For his performance against Denver, Brady was named the AFC Offensive Player of the Week for the third time in the season.[385] After spending the next week training at the United States Air Force Academy in Colorado Springs, Colorado, Brady and the Patriots traveled to Mexico City for to battle the Oakland Raiders at Estadio Azteca.[386] Like the previous week, the Patriots won big, this time by a final score of 33–8. Brady completed 30 of 37 passes for 339 yards and three touchdowns in the win. During Week 12 against the Miami Dolphins, Brady finished with 227 passing yards, four touchdowns, and an interception as the Patriots won 35–17. Brady became the first quarterback at age 40 to throw for four touchdowns in a game. Brady was named AFC Offensive Player of the Month for November.[387] During Week 13 against the Buffalo Bills, Brady finished with 258 passing yards and an interception as the Patriots won 23–3. During the game, Brady yelled at offensive coordinator Josh McDaniels after failing to execute a play properly in the first quarter. Brady claimed that this was not his first incident with McDaniels, with whom he had worked together for 13 years, with a \"fruitful\" relationship.[388][389] On December 19, Brady was selected to the Pro Bowl for the 13th time in his career.[390][391] On December 24 against the Buffalo Bills, Brady completed 21 of 28 passes for 224 yards, two touchdowns, and one interception as the Patriots won their 12th game of the season, 37–16.[392] With this win, combined with a Jacksonville Jaguars loss later in the day, the Patriots clinched a first-round bye for the eighth straight year.[393] The Patriots won their regular season finale to clinch home-field advantage throughout the AFC playoffs.[394] At age 40, Brady became the oldest quarterback ever to start all of his team's games in an NFL regular season (surpassing Doug Flutie, who at age 38 started all 16 games for the 2001 San Diego Chargers). Brady finished the regular season as the NFL's passing yards leader with 4,577, making him the oldest player ever to lead the league in passing yards.[395] He was named a first-team All-Pro by the Associated Press for the third time in his career.[396] Earning 40 of 50 votes, Brady was named the NFL Most Valuable Player for the third time in his career.[397] For the second straight year and third time overall, Brady was ranked #1 by his fellow players on the NFL Top 100 Players of 2018.[398]\n\n2017 postseason\n\nBrady playing in Super Bowl LII\n\nBrady and the Patriots began their postseason run by hosting the Tennessee Titans in the Divisional Round of the playoffs. Brady completed 35 passes out of 53 attempts for 337 passing yards, three passing touchdowns, and no interceptions in a 35–14 Patriots victory.[399] With the win, the Patriots advanced to the AFC Championship Game for the seventh straight year. Days after the divisional round, it was revealed that Brady had a minor cut on his right hand, which required stitches.[400] Despite this injury, Brady managed to start the AFC Championship Game, where the Patriots hosted the Jacksonville Jaguars. Brady led a fourth quarter comeback to lead the Patriots to a 24–20 victory. He finished the game with 26 completions out of 38 attempts for 290 passing yards, two passing touchdowns, and no interceptions.[401] The win gave Brady and Patriots head coach Bill Belichick their eighth conference title as a quarterback–head coach tandem, and the Patriots a berth in Super Bowl LII, their tenth Super Bowl appearance as a team, both of which extended NFL records. In Super Bowl LII at U.S. Bank Stadium in Minneapolis, Minnesota, the Patriots faced off against the Philadelphia Eagles and their second-string quarterback Nick Foles. Brady completed 28 passes on 48 attempts for three passing touchdowns, no interceptions, and a Super Bowl record 505 yards – which also set a new record for the most passing yards by a quarterback in any postseason game in NFL history. With roughly two minutes remaining in the game and the Eagles leading 38–33, Brady was strip-sacked by Brandon Graham. The Eagles recovered the fumble and cemented their 41–33 win with a field goal, securing their first franchise Super Bowl victory in a game with most combined total yardage in NFL history.[402] This was the third time overall that Brady had lost in a Super Bowl, becoming the fourth starting quarterback in Super Bowl history to lose at least three Super Bowls (Jim Kelly, Fran Tarkenton, and John Elway).[403] In addition, this was the first time he had lost a Super Bowl to a team and a quarterback other than the New York Giants and Eli Manning, respectively.[404]\n\n2018 season\n\nBrady started his 19th NFL season with 277 passing yards, three touchdowns, and one interception in a 27–20 victory over the Houston Texans in the season opener.[405][406] After losses to the Jacksonville Jaguars and Detroit Lions over the next two games, Brady had 274 passing yards, three touchdowns, and two interceptions in a 38–7 victory over the Miami Dolphins in Week 4.[407] In the following game, a 38–24 victory over the Indianapolis Colts, he had 341 passing yards, three touchdowns, and two interceptions to go with a rushing touchdown. Brady's 500th career touchdown pass went to Josh Gordon, who became the 71st different player to catch a touchdown from Brady, breaking a record previously held by Vinny Testaverde.[408][409] In Week 6, a 43–40 victory over the Kansas City Chiefs, Brady had 340 passing yards and a passing touchdown to go with a four-yard rushing touchdown.[410] In Week 15, Brady reached 70,000 passing yards, becoming the fourth quarterback in NFL history to accomplish the feat, and the second player, after Brett Favre, to have over 70,000 passing yards and 1,000 rushing yards in a career. He finished with 279 passing yards as the Patriots lost 17–10 to the Pittsburgh Steelers.[411] During Week 16 against the Buffalo Bills, Brady was limited to 126 passing yards, but the Patriots combined for 273 rushing yards and won 24–12, clinching the AFC East pennant for the 10th consecutive season and 16th time in 18 years.[412] Tom Brady eclipsed 4,000 yards at the same time as Philip Rivers, becoming the third and fourth quarterback in NFL history to reach 4,000 yards in 10 seasons or more, joining Peyton Manning & Drew Brees.[413] In Week 17, Brady completed 24 of 33 passes for 250 yards and four touchdowns in a 38–3 win against the Jets that clinched the AFC's #2 seed and a first-round bye for the 11–5 Patriots.[414][415] Brady finished the season completing 375 of 570 passes (a 65.8% completion rate), 4,355 yards, 29 touchdowns, and 11 interceptions.[416] He was ranked sixth by his fellow players on the NFL Top 100 Players of 2019.[417]\n\n2018 postseason\n\nFollowing their first-round bye, the Patriots started their playoff run at home against the Los Angeles Chargers in the Divisional Round. The Patriots jumped out to a 35–7 halftime lead en route to a 41–28 win that saw Brady complete 34 of 44 passes for 343 passing yards, one touchdown, and no interceptions.[418] With the win, the Patriots advanced to the AFC Championship Game for the eighth consecutive year, this time to face the Chiefs at Arrowhead Stadium.[419] In the AFC Championship Game, the Patriots opened the game with an 80-yard, 15-play opening drive capped with a one-yard Sony Michel rushing touchdown. The Patriots went into halftime with a 14–0 lead. However, the Chiefs battled back in the second half and Harrison Butker hit a 39-yard field goal for the Chiefs with just eight seconds remaining in regulation to send the game into overtime with a score of 31–31. The Patriots won the coin toss to start overtime and elected to receive the ball. Brady led the Patriots on a 75-yard drive that resulted in a game-winning two-yard rushing touchdown by Rex Burkhead. With the victory, Brady earned a Super Bowl appearance for the third straight season and the ninth time overall in his career. Brady finished the game completing 30 of 46 attempts, with 348 passing yards, one touchdown, and two interceptions.[420] In Super Bowl LIII at Mercedes-Benz Stadium in Atlanta, Georgia, Brady completed 21 of 35 passes for 262 passing yards and an interception as the Patriots won 13–3 over the Los Angeles Rams in the lowest-scoring Super Bowl in history. This was the first time in nine Super Bowl appearances in which Brady did not have a passing touchdown, though with the game tied 3–3 and less than eight minutes left he successfully connected with Rob Gronkowski down the sideline between three defenders to set up what would be the decisive touchdown.[421] With the victory, the Patriots became the second NFL team to win six Super Bowls, tying the Pittsburgh Steelers for the most in NFL history.[422] In addition, Brady became the first player ever to win six Super Bowls, breaking a tie with Charles Haley, as well as the oldest quarterback at 41 years of age to win a Super Bowl.[423][424]\n\n2019 season: Final season in New England\n\nOn August 4, 2019, one day after his 42nd birthday, Brady signed a two-year contract extension worth $70 million that covered both the 2020 and the 2021 seasons;[425] the terms of the contract allowed Brady to become a free agent after the 2019 season.[426] Against the 2019 Patriots salary cap Brady was the highest-paid player on the team at $21.5 million.[427]\n\nBrady began his 20th NFL season by completing 24 of 36 passes for 341 yards and three touchdowns in a 33–3 win over the Pittsburgh Steelers.[428] The next week, in a 43–0 win over the Miami Dolphins, Brady completed 20 out of 28 passes for 264 yards and two touchdowns; in addition, he also scored a rushing touchdown. During a 33–7 victory against the Washington Redskins in Week 5, Brady surpassed Brett Favre for third place on the all-time passing yards list and finished only 17 yards short of tying his former rival Peyton Manning for second place.[429] On the first drive of the following week against the New York Giants, Brady surpassed Manning to take over second place on the all-time passing yards list, behind only New Orleans Saints quarterback Drew Brees.[430] However, Brady struggled during the second half of the season, and the Patriots lost three out of their next five games following an 8–0 start, including back-to-back losses in Weeks 13 and 14 against the Houston Texans and Kansas City Chiefs. Brady's career passer rating dropped from fourth to sixth highest among qualified QBs in NFL history.[431] In Week 15, against the Cincinnati Bengals, Brady moved to within one touchdown of tying Peyton Manning on the all-time passing touchdowns list with 538.[432] In the Patriots’ 34–13 victory, which guaranteed the team a spot in the playoffs for an 11th straight season, Brady had 128 passing yards and two touchdowns.[433] Brady played in his final regular season game with the Patriots two weeks later, in Week 17 at home against the Miami Dolphins. Brady threw for 221 yards and two touchdowns, but also threw an interception that was returned by former Patriots teammate Eric Rowe for a touchdown. The game ended with the Dolphins defeating the Patriots 27–24; this result, combined with a win by the Chiefs, denied New England a first round bye for the first time in 10 years. The first of Brady's two touchdowns against Miami in Week 17 was the 540th of his career, moving him ahead of Peyton Manning for the second most touchdown passes in NFL history.[434]\n\nFor the first time since the 2008 season, the year when he tore his ACL, Brady was not selected to the Pro Bowl.[435] That season as the Patriots' defense that was winning games while the offense was stagnant, Brady told friends that he \"felt Belichick had taken the offense for granted because of how good it had been for so long\" and said to NBC that he was the \"most miserable 8–0 quarterback in the NFL.\"[436] However, Sporting News would name him their \"NFL Athlete of the Decade\".[437]\n\n2019 postseason\n\nDespite finishing the regular season with a 12–4 record and winning the AFC East title for the 11th consecutive year, the Patriots were forced to start their postseason run in the Wild Card Round for the first time since 2009, where they faced the Tennessee Titans. With his team trailing by a 14–13 score and pinned back on their own 1-yard line with 15 seconds left in the game, Brady's 37th and final pass attempt of the game – and his last pass attempt as a New England Patriot – was intercepted and returned for a touchdown by former teammate and Titans cornerback Logan Ryan, which effectively sealed the 20–13 win for Tennessee.[438] This marked the first time since the 2010 season that the Patriots went one-and-done in the playoffs;[439] The loss ended the Patriots' chance of advancing to their fourth consecutive Super Bowl appearance, which would have matched a feat that only their division rival, the Buffalo Bills (1990–1993), had accomplished. In addition, this also marked the first time since the 2010 season in which the Patriots did not reach the AFC Championship Game, ending their NFL record run of eight consecutive AFC title game appearances. The loss to the Titans was Brady's final game as a New England Patriot; on March 17, 2020, the day before his contract with the Patriots expired, Brady announced that he would not re-sign with the team for the 2020 season, ending his 20-year tenure in New England.[440]\n\nAfter Brady signed with the Tampa Bay Buccaneers, billboards thanking Brady for his 20 years were posted alongside the Massachusetts Turnpike, a mile from Gillette Stadium and ten other locations around New England.[441]\n\nTampa Bay Buccaneers\n\nOn March 20, 2020, Brady signed with the Tampa Bay Buccaneers. The two-year contract was worth $50 million in fully guaranteed money, with up to $4.5 million each year in incentives. The deal also included a no-trade and a no-tag clause.[442] Although his career number of 12 was already taken, Chris Godwin agreed to give it to Brady and himself switched to 14.[443]\n\nNFL career statistics\n\nRegular season\n\nTom Brady regular season statistics Year Team Games Passing Rushing Sacked Fumbles Record G GS Cmp Att Pct Yds Y/A Lng TD Int Rtg Att Yds Avg TD Sck Yds Fum Lost W–L 2000 NE 1 0 1 3 33.3 6 2.0 6 0 0 42.4 0 0 0 0 0 0 0 0 0–0 2001 NE≈ 15 14 264 413 63.9 2,843 6.9 91 18 12 86.5 36 43 1.2 0 41 216 12 3 11–3 2002 NE 16 16 373 601 62.1 3,764 6.3 49 28* 14 85.7 42 110 2.6 1 31 190 11 5 9–7 2003 NE≈ 16 16 317 527 60.2 3,620 6.9 82 23 12 85.9 42 63 1.5 1 32 219 13 5 14–2 2004 NE≈ 16 16 288 474 60.8 3,692 7.8 50 28 14 92.6 43 28 0.7 0 26 162 7 5 14–2 2005 NE 16 16 334 530 63.0 4,110* 7.8 71 26 14 92.3 27 89 3.3 1 26 188 4 3 10–6 2006 NE 16 16 319 516 61.8 3,529 6.8 62 24 12 87.9 49 102 2.1 0 26 175 12 4 12–4 2007× NE 16 16 398 578 68.9* 4,806* 8.3* 69 50* 8 117.2* 37 98 2.6 2 21 128 6 4 16–0° 2008 NE 1 1 7 11 63.6 76 6.9 26 0 0 83.9 0 0 0 0 0 0 0 0 1–0 2009 NE 16 16 371 565 65.7 4,398 7.8 81 28 13 96.2 29 44 1.5 1 16 86 4 2 10–6 2010× NE 16 16 324 492 65.9 3,900 7.9 79 36* 4 111.0* 31 30 1.0 1 25 175 3 1 14–2 2011 NE 16 16 401 611 65.6 5,235 8.6 99° 39 12 105.6 43 109 2.5 3 32 173 6 2 13–3 2012 NE 16 16 401 637 63.0 4,827 7.6 83 34 8 98.7 23 32 1.4 4 27 182 2 0 12–4 2013 NE 16 16 380 628 60.5 4,343 6.9 81 25 11 87.3 32 18 0.6 0 40 256 9 3 12–4 2014 NE≈ 16 16 373 582 64.1 4,109 7.1 69 33 9 97.4 36 57 1.6 0 21 134 6 3 12–4 2015 NE 16 16 402 624 64.4 4,770 7.6 76 36* 7 102.2 34 53 1.6 3 38 225 6 2 12–4 2016 NE≈ 12 12 291 432 67.4 3,554 8.2 79 28 2 112.2 28 64 2.3 0 15 87 5 0 11–1 2017× NE 16 16 385 581* 66.3 4,577* 7.9 64 32 8 102.8 25 28 1.1 0 35 201 7 3 13–3 2018 NE≈ 16 16 375 570 65.8 4,355 7.6 63 29 11 97.7 23 35 1.5 2 21 147 4 2 11–5 2019 NE 16 16 373 613 60.8 4,057 6.6 59 24 8 88.0 26 34 1.3 3 27 185 4 1 12–4 Career‡ 285 283 6,377 9,988 63.8 74,571 7.5 99° 541 179 97.0 606 1,037 1.7 22 500 3,129 121 48 219–64°\n\n‡ Career totals accurate through the end of the 2019 regular season.[444]\n\nPlayoffs\n\nTom Brady playoff statistics Year Team Games Passing[445] Rushing Sacked Fumbles Record G GS Cmp Att Pct Yds Y/A Lng TD Int Rtg Att Yds Avg TD Sck Yds Fum Lost W–L 2001 NE≈ 3 3 60 97 61.9 572 5.9 29 1 1 77.3 8 22 2.8 1 5 36 1 0 3–0 2003 NE≈ 3 3 75 126 59.5 792 6.3 52 5 2 84.5 12 18 1.5 0 0 0 0 0 3–0 2004 NE≈ 3 3 55 81 67.9 587 7.2 60 5 0 109.4 7 3 0.4 1 0 0 1 1 3–0 2005 NE 2 2 35 63 55.6 542 8.6 73 4 2 92.2 3 8 2.7 0 4 12 2 0 1–1 2006 NE 3 3 70 119 58.8 724 6.1 49 5 4 76.5 8 18 2.2 0 4 22 2 0 2–1 2007 NE 3 3 77 109 70.6 737 6.8 53 6 3 96.0 4 −1 −0.2 0 8 52 1 1 2–1 2009 NE 1 1 23 42 54.8 154 3.7 24 2 3 49.1 0 0 0 0 3 22 1 1 0–1 2010 NE 1 1 29 45 64.4 299 6.6 37 2 1 89.0 2 2 1.0 0 5 40 1 0 0–1 2011 NE 3 3 75 111 67.6 878 7.9 61 8 4 100.4 9 10 1.1 1 3 15 0 0 2–1 2012 NE 2 2 54 94 57.4 664 7.1 49 4 2 84.7 3 4 1.3 0 1 9 0 0 1–1 2013 NE 2 2 37 63 58.7 475 7.5 53 1 0 87.7 3 6 2.0 1 4 34 1 0 1–1 2014 NE≈ 3 3 93 135 68.9 921 6.8 46 10 4 100.3 9 13 1.4 1 3 16 0 0 3–0 2015 NE 2 2 55 98 56.1 612 6.2 42 3 2 76.6 9 19 2.1 1 4 18 0 0 1–1 2016 NE≈ 3 3 93 142 65.5 1,137 8.0 48 7 3 97.7 9 13 1.4 0 9 42 0 0 3–0 2017 NE 3 3 89 139 64.0 1,132 8.1 50 8 0 108.6 7 8 1.1 0 4 19 1 1 2–1 2018 NE≈ 3 3 85 125 68.0 953 7.6 35 2 3 85.8 5 −4 −0.8 0 1 9 1 0 3–0 2019 NE 1 1 20 37 54.1 209 5.6 29 0 1 59.4 0 0 0 0 0 0 0 0 0–1 Career 41° 41° 1,025° 1,626° 63.0 11,388° 7.0 73 73° 35° 89.8 100 136 1.4 6 66 409 12 4 30–11°\n\nSuper Bowl\n\nTom Brady Super Bowl statistics Year SB Team Opp Passing[446] Rushing Result Cmp Att Pct Yds Y/A TD Int Rtg Att Yds Avg TD Final score 2001 XXXVI± NE≈ STL 16 27 59.3 145 5.4 1 0 86.2 1 3 3.0 0 W 20–17 2003 XXXVIII± NE≈ CAR 32 48 66.7 354 7.4 3 1 100.5 2 12 6.0 0 W 32–29 2004 XXXIX NE≈ PHI 23 33 69.7 236 7.2 2 0 110.2 1 −1 −1.0 0 W 24–21 2007 XLII NE NYG 29 48 60.4 266 5.5 1 0 82.5 0 0 0 0 L 17–14 2011 XLVI NE NYG 27 41 65.9 276 6.7 2 1 91.5 0 0 0 0 L 21–17 2014 XLIX± NE≈ SEA 37 50 74.0 328 6.6 4 2 101.1 2 −3 −1.5 0 W 28–24 2016 LI± NE≈ ATL 43° 62° 69.4 466 7.5 2 1 95.2 1 15 15.0 0 W 34–28 (OT) 2017 LII NE PHI 28 48 58.3 505° 10.5 3 0 115.4 1 6 6.0 0 L 41–33 2018 LIII NE≈ LAR 21 35 60.0 262 7.5 0 1 71.3 2 −2 −1.0 0 W 13–3 Career 9° 256° 392° 65.3 2,838° 7.2 18° 6 95.6 10 30 3.0 0 W–L: 6–3\n\nNFL career records\n\nRegular season\n\nPlayoffs Most games played: 41 [459] [460]\n\nMost games started: 41 [461]\n\nMost games won by a starting quarterback: 30 [461]\n\nMost consecutive wins by a starting quarterback: 10 (2001–2005)\n\nMost consecutive wins to start a career by a starting quarterback: 10 (2001, 2003–2005)\n\nMost career home wins by a starting quarterback: 20 (2001–2019)\n\nMost consecutive home wins by a starting quarterback: 9 (2013–2019)\n\nMost touchdown passes: 73 [462]\n\nMost passing yards: 11,388 [463]\n\nMost passing yards in a single playoff game: 505 (Super Bowl LII) [464]\n\nMost passes completed: 1,025 [465]\n\nMost passes attempted: 1,626 [465]\n\nMost passes intercepted: 35 [466]\n\nMost division titles won by a starting quarterback: 16 [461]\n\nMost NFL conference championship appearances by a starting quarterback: 13 [467]\n\nMost NFL conference championship wins by a starting quarterback: 9 [468]\n\nOldest Quarterback to win an AFC title game: 41 years, 5 months, 17 days\n\nMost career 300+ passing yard games: 16 [465]\n\nMost game-winning drives: 13 [101]\n\nMost multi-TD passes: 23[468] Super Bowl Most touchdown passes: 18 [469]\n\nMost passing yards: 2,838 [464]\n\nMost passes completed: 256 [464]\n\nMost passes attempted: 392 [464]\n\nMost wins as starting QB: 6 [101]\n\nMost wins as a player: 6\n\nMost passes completed in first half of a single Super Bowl: 20 (XLIX) [470]\n\nMost passes completed in a single Super Bowl: 43 (LI) [101]\n\nMost passes attempted in a single Super Bowl: 62 (LI) [101]\n\nMost passing yards in a single Super Bowl: 505 (LII) [464]\n\nMost Super Bowl appearances: 9 [471]\n\nMost passing attempts without an interception in a single Super Bowl: 48 (XLII & LII) [472]\n\nOldest QB to start a Super Bowl: 41 years, 6 months, 0 days [473]\n\nOldest QB to win a Super Bowl: 41 years, 6 months, 0 days [473]\n\nOldest player to win Super Bowl MVP: 39 years, 6 months, 2 days [473]\n\nMost consecutive completions in a single Super Bowl: 16 (XLVI) [472]\n\nMost game-winning drives: 6[474]\n\nOther endeavors\n\nBrady has been featured as a guest star on some popular television programs, hosting Saturday Night Live in 2005[475] and voicing himself in the 2005 The Simpsons episode \"Homer and Ned's Hail Mary Pass\" and the 2006 Family Guy episode (\"Patriot Games\"; both football-themed episodes were broadcast within a week of that year's Super Bowl.[476][477] In 2009, he appeared as himself in a sixth season episode of Entourage.[478] In 2015, he had cameo appearances as fictionalized versions of himself in the Entourage movie[479] and Ted 2.[480]\n\nIn 2007, Brady was a model for the Stetson cologne.[481] Brady has endorsed brands including Uggs, Under Armour, Movado, Aston Martin and Glaceau Smartwater. According to Forbes, he earned about $7 million from endorsements alone in 2014.[482][483][484] In 2016, he began appearing in a Beautyrest Black commercial campaign for Simmons Bedding Company.[485] In 2016, he launched his own line of vegan snacks.[486]\n\nOn January 20, 2016, Brady announced the launch of his peak performance website TB12Sports.com. The site features information on Brady's training regimen and includes a store to purchase TB12 equipment and merchandise.[487] Later in the year, on August 23, 2016, the TB12 brand then expanded to offer a snack line. The snacks contain raw, vegan, and organic ingredients that are also free of gluten and dairy.[488] The following month, Brady, alongside Boston Private and Robert Paul Properties, announced the formation of the TB12 Foundation. The purpose of the nonprofit foundation is to provide free post-injury rehabilitation care and training to underprivileged, young athletes.[489] In March 2017, Brady moved beyond his snack line and partnered with meal-kit startup Purple Carrot to offer his own line of TB12 Performance Meals. The meals utilize whole foods and focus on providing nutrients for workout recovery.[490][491] On September 19, 2017, Simon & Schuster published Brady's first book, The TB12 Method: How to Achieve a Lifetime of Sustained Peak Performance. Within 48 hours, it had become a number one best-seller on Amazon.com.[492] The book also reached #1 on The New York Times' weekly Best Sellers list, to be featured in the edition of October 8, 2017.[493]\n\nFilmmaker Gotham Chopra filmed Brady during the 2017 off-season and regular season for a Facebook Watch documentary series entitled Tom vs Time. According to The New York Times, the documentary follows Brady as he \"conducts his ongoing subversion campaign against the actuarial tables of quarterback longevity.\"[494]\n\nPersonal life\n\nBrady dated actress Bridget Moynahan from 2004 until late 2006.[495] On February 18, 2007, Moynahan confirmed to People magazine that she was more than three months pregnant with Brady's child.[495][496] Brady and Moynahan ended their relationship sometime in early December 2006, around the time Moynahan became pregnant.[497] John Edward Thomas Moynahan[498] was born in August 2007 at Saint John's Health Center in Santa Monica, California.[499]\n\nBrady began dating Brazilian model Gisele Bündchen in December 2006.[500] In 2009, Brady said they had been set up on a blind date by a mutual friend.[501] Brady and Bündchen married on February 26, 2009, in an intimate Catholic ceremony in Santa Monica, California.[502] Together, they have two children: a son named Benjamin Rein born in December 2009,[503] and a daughter named Vivian Lake born in December 2012.[504]\n\nBrady and baseball player Kevin Youkilis became brothers-in-law in 2012, when Youkilis married Brady's sister Julie.[505] He and his family reside in Brookline, Massachusetts, as well as New York City.[506] They own several homes together and spend time during the summer near Big Sky, Montana, as well as their home at Silo Ridge in Amenia, New York.[507][508]\n\nPolitics\n\nBrady attended the 2004 State of the Union Address as a special guest of then-President George W. Bush.[509] In 2004, he told ESPN The Magazine that being a U.S. Senator would be his \"craziest ambition\".[510][511]\n\nBrady is a friend of President Donald Trump;[512][513] in 2017, Brady indicated he had known Trump \"for 16 years\".[514] At a political event in New Hampshire on the day before the 2016 presidential election, Trump said he had received a call from Brady, and that Brady told him \"Donald, I support you, you're my friend, and I voted for you.\" However, after his wife was asked directly on Instagram whether she and Brady backed Trump, Bündchen answered \"NO!\"[515] After a Trump campaign \"Make America Great Again\" cap was photographed in Brady's locker, Brady said that Bündchen told him not to discuss politics anymore, which he thought was a \"good decision\".[516] Brady did not join the New England Patriots in visiting Trump and the White House in April 2017 after their Super Bowl victory, citing \"personal family matters\".[517]\n\nIn an interview with Howard Stern on The Howard Stern Show in April 2020, Brady talked about how Donald Trump had reached out to him to speak at the 2016 Republican National Convention and that he had politely declined, telling Stern: \" It was uncomfortable for me because you can't undo things, not that I would undo a friendship, but political support is totally different than the support of a friend.\" Brady explained on that he has known Trump since 2002 when Trump asked him to be a judge in the Miss USA pageant following Br", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/NCAAFootball_transparent.png/23px-NCAAFootball_transparent.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/Tom_Brady_Hyannis_May_2009.jpg/170px-Tom_Brady_Hyannis_May_2009.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/TomBrady.jpg/220px-TomBrady.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Tom_Brady_2016.JPG/220px-Tom_Brady_2016.JPG", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Tom_Brady_vs._Vikings_2014.jpg/220px-Tom_Brady_vs._Vikings_2014.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Brady_and_Michel.png/220px-Brady_and_Michel.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Tom_Brady_2015.JPG/220px-Tom_Brady_2015.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/20160917_Tom_Brady_at_Michigan_Stadium.jpg/220px-20160917_Tom_Brady_at_Michigan_Stadium.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/21px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Patriotsgiants_031.jpg/220px-Patriotsgiants_031.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Tom_Brady_2017.JPG/220px-Tom_Brady_2017.JPG", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Tom_Brady_2011.JPG/220px-Tom_Brady_2011.JPG", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/a/a1/Tom_Brady_with_Vince_Lombardi_trophy_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Tom_Brady_2017.JPG/1200px-Tom_Brady_2017.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/Tom_Brady_8-28-09_Patriots-vs-Redskins.jpg/220px-Tom_Brady_8-28-09_Patriots-vs-Redskins.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Patriots_on_offense_at_Super_Bowl_XXXIX_1.jpg/220px-Patriots_on_offense_at_Super_Bowl_XXXIX_1.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Tom_Brady_in_October_2013.jpg/220px-Tom_Brady_in_October_2013.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/Tom_Brady_Super_Bowl_LII_85F9D5D.jpg/220px-Tom_Brady_Super_Bowl_LII_85F9D5D.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/American_football.svg/21px-American_football.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Tom_Brady_Patriots_at_Broncos.jpg/180px-Tom_Brady_Patriots_at_Broncos.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Tom_Brady_2017.JPG/1200px-Tom_Brady_2017.JPG", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Tom_Brady", "title": "Tom Brady", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Tom_Brady_2017.JPG/1200px-Tom_Brady_2017.JPG"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}