{"url": "www.theatlantic.com/entertainment/archive/2011/03/the-tourist-why-the-angelina-jolie-johnny-depp-flop-deserves-a-second-look/72989/", "text": "In her championing of the Venice-set film, Movieline's Stephanie Zacharek extended the movie's elevation of really nice stuff from mere set dressing to full-blown theme, by comparing the star vehicle to a cocktail—\"a Bellini, fizzy and sweet and dry all at the same time.\" While The Tourist's tonic qualities might be disputed, it does offer some substantial pleasures, particularly of the dry variety. These mostly come courtesy of Depp, in bewildered mode throughout, cast into a plot whose mechanics he can't fully grasp, but almost casually accepting of every new development—recalling his career-best work in Jim Jarmusch's 1995 anti-Western Dead Man. Here Depp's character, Frank, dazedly stumbles through shootout chases and police interrogations, as if one of his beloved spy thrillers has sprung to life around him (Frank fumbles with a paperback called The Berlin Vendetta when Jolie's Elise takes a seat across from him on a train).\n\nAside from its minor pleasures, though, The Tourist might also wind up enduring as a kind of curiosity. In a Daily Beast postmortem on the film, one of Nicole LaPorte's sources offers that \"[von Donnersmarck] was interested in making a movie that was about elegance and the glamour of stars. It was not supposed to be a hard-edged thriller. He wanted to make a style piece. That may have been a miscalculation.\" The \"elegance\" and \"glamour\" of two of Hollywood's brightest stars is indeed here thrust to the fore, even more so than usual. What's more, there are hardly any other concerns occupying the foreground. The thriller elements and the dialogue here seem almost deliberately by-the-numbers, so as not to distract from the sheer star wattage.\n\nThe Tourist is, at its core, a movie about the nature of seeing and being seen, featuring a perhaps-not-entirely-inadvertent barebones, feminist-film-theory-inflected demo of classical Hollywood patriarchy. Depp, the disheveled, down-on-his-luck, paperback-reading teacher from Wisconsin, serves as the audience's (male) point of identification. For her part, Jolie is objectified to an almost absurd degree, constantly watched by (exclusively male) surveillance experts. At one point the mere sight of her prompts Frank to inadvertently blurt out the PG-13 film's token \"fuck,\" and Elise renders speechless nearly every man she encounters, as if even these thunderstruck waiters and bellhops inside the movie are unable to process her as anything other than a fantasy, a glamorous apparition, a totally bewitching flicker of light. The audience is, of course, also implicated in all this looking.\n\nThe final scenes of The Tourist attempt, with mixed results, to complicate and maybe even half-heartedly critique these power dynamics, turning a few tables and imparting to certain players more agency than they initially seemed to have. The film ultimately skews more toward knowing tease than coherent statement, but at its most intriguing The Tourist plays like a movie turned completely inside out, an espionage movie willing to spy on its own inner workings.\n\nWe want to hear what you think about this article. Submit a letter to the editor or write to letters@theatlantic.com.", "images": ["https://cdn.theatlantic.com/assets/media/files/nav-crossword.png", "https://atlanticmedia.122.2o7.net/b/ss/atlanticprod/1/H.22--NS/0", "https://cdn.theatlantic.com/assets/static/b/theatlantic/img/lacroix-default-thumbnail.png"], "top_img": "https://cdn.theatlantic.com/assets/static/b/theatlantic/img/lacroix-default-thumbnail.png", "keywords": [], "authors": ["Benjamin Mercer"], "canonical_link": "https://www.theatlantic.com/entertainment/archive/2011/03/the-tourist-why-the-angelina-jolie-johnny-depp-flop-deserves-a-second-look/72989/", "title": "'The Tourist': Why the Angelina Jolie-Johnny Depp Flop Deserves a Second Look", "meta_data": {"viewport": "width=device-width,initial-scale=1", "description": "Yes, it tanked at the box office. But the movie is worth watching, if only as a curiosity.", "theme-color": "#000000", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-status-bar-style": "black", "apple-mobile-web-app-title": "The Atlantic", "referrer": "unsafe-url", "og": {"site_name": "The Atlantic", "locale": "en_US", "title": "'The Tourist': Why the Angelina Jolie-Johnny Depp Flop Deserves a Second Look", "type": "article", "url": "https://www.theatlantic.com/entertainment/archive/2011/03/the-tourist-why-the-angelina-jolie-johnny-depp-flop-deserves-a-second-look/72989/", "image": "https://cdn.theatlantic.com/assets/static/b/theatlantic/img/lacroix-default-thumbnail.png", "description": "Yes, it tanked at the box office. But the movie is worth watching, if only as a curiosity."}, "fb": {"pages": "29259828486,1468531833474495,1061579677251147,457711054591520,370457103090695,1631141167169115,148681772342453,1510507419185410,128344747344340,128377530562508,236061986423933", "admins": "577048155,17301937", "app_id": 100770816677686}, "p": {"domain_verify": "68e1a0361a557708fefc992f3309ed70"}, "twitter": {"site": "@theatlantic", "domain": "theatlantic.com", "card": "summary_large_image", "image": {"src": "https://cdn.theatlantic.com/assets/static/b/theatlantic/img/lacroix-default-thumbnail.png"}}, "application-name": "theatlantic", "msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "https://cdn.theatlantic.com/assets/static/b/theatlantic/img/lacroix/apple-touch-icon-iphone.50541ad29f2c.png", "ROBOTS": "INDEX, FOLLOW", "krux": {"title": "'The Tourist': Why the Angelina Jolie-Johnny Depp Flop Deserves a Second Look", "description": "Yes, it tanked at the box office. But the movie is worth watching, if only as a curiosity."}, "author": "Benjamin Mercer", "ia": {"markup_url": "https://www.theatlantic.com/facebook-instant/article/72989/"}, "article": {"publisher": "https://www.facebook.com/TheAtlantic/", "opinion": "false", "content_tier": "metered", "tag": "culture", "section": "Culture", "published_time": "2011-03-25T11:20:06-04:00", "modified_time": "2019-02-08T18:26:55-05:00"}, "keywords": "Johnny Depp, Angelina Jolie, Golden Globe Nominations, Tourist's unique combination, Johnny Depp's Fame Doom, feature-length co-star of Gervais, unwitting math-teacher tourist Depp, second feature, beloved spy thrillers, Ricky Gervais, Hollywood Foreign Press, movie's elevation, Tourist, Columbia Pictures, good opportunity, Kevin Fallon, Golden Globes, star vehicle, mere set dressing, opening monologue, only awards-season recognition, Daily Beast postmortem, British agent, film, money-losers, worth watching, Lives of Others, recent releases, Florian Henckel, classic action-romance picture, movie, mere sight of her prompts Frank, month's Mars Needs Moms, paperback-reading teacher, home video, German director, easy target, bit of a sophomore slump, identity intrigue, feminist-film-theory, final scenes of The Tourist attempt, Movieline's Stephanie Zacharek, courtesy of Depp, PG-13 film's token, nice stationery, latter option, point of identification, sheer star wattage, piece of filmmaking, white-hot European director", "news_keywords": "Johnny Depp, Angelina Jolie, Golden Globe Nominations, Tourist's unique combination, Johnny Depp's Fame Doom, feature-length co-star of Gervais, unwitting math-teacher tourist Depp, second feature, beloved spy thrillers, Ricky Gervais, Hollywood Foreign Press, movie's elevation, Tourist, Columbia Pictures, good opportunity, Kevin Fallon, Golden Globes, star vehicle, mere set dressing, opening monologue, only awards-season recognition, Daily Beast postmortem, British agent, film, money-losers, worth watching, Lives of Others, recent releases, Florian Henckel, classic action-romance picture, movie, mere sight of her prompts Frank, month's Mars Needs Moms, paperback-reading teacher, home video, German director, easy target, bit of a sophomore slump, identity intrigue, feminist-film-theory, final scenes of The Tourist attempt, Movieline's Stephanie Zacharek, courtesy of Depp, PG-13 film's token, nice stationery, latter option, point of identification, sheer star wattage, piece of filmmaking, white-hot European director"}, "movies": [], "publish_date": 1301066406.0, "source": "http://www.theatlantic.com", "summary": ""}