{"url": "www.elitedaily.com/p/video-of-kim-kardashian-having-a-panic-attack-on-kuwtk-is-so-so-heartbreaking-2805601", "text": "Everyone is always talking about Kim Kardashian. Whether she's supporting Kanye West in his latest debacle or sharing pictures of her cute kids, the woman and her family make their rounds on the internet. This time, the brave reality star shared a shocking video of herself in complete disarray. The video of Kim Kardashian having a panic attack is frightening and heartbreaking, but nonetheless, honest and brave because she allowed camera crews to document it.\n\nAccording to a report from BuzzFeed, in an upcoming episode of Keeping Up With the Kardashians, Kim K arrives at a house in Mexico with several of her close friends and grows increasingly more uncomfortable and anxious. She begins having severe flashbacks of her Paris robbery incident, and the post traumatic stress sets in. Kim K called her friend and the owner of the house, Joe Francis, hysterically crying, saying, \"Are you sure it's safe here? ... I’m just like, why did I come, you know?\"\n\nOn the other line, her friend reassures her. \"Yeah, I promise you. Look, I went through the same thing and I promise you, it's safe. I have my kids there.\"\n\nKim explains the traumatic ordeal in a confessional interview on KUWTK,\n\nEver since Paris, I just go through this worst-case scenario mode in my head. I was so excited to come on this trip and I had no idea that I was gonna end up feeling this way.\n\nE! Entertainment on YouTube\n\nKim K also explained,\n\nBut it hit me right as we were getting off the plane that all of these people at the airport are going to see you know, 17 or 18 girls with all of our Chanel bags and Louis Vuitton this, and it just like hit me: We’re the biggest target ever.\"\n\nSince Kim K's robbery in Paris back in 2016, the reality star has shared her battle with anxiety and her struggles from it. She told Ellen DeGeneres in an interview from April of 2017 that she has sleeping issues at night, unless there's a security guard outside of her door and present at her residence. She said,\n\nMy whole life has changed. I never thought I would need security staying outside of my door. I should have had a security guard outside of my door. Now I have several just for me to be able to sleep at night.\n\nBack in April, Kim K suffered another bout with anxiety on an episode of KUWTK. The business mogul decided to finally leave the house to attend a Kanye West concert, but within minutes suffered from a panic attack. She began having terrible anxiety and had to rush out of the auditorium. She said in a confessional on the show,\n\nI just want to disappear for a little bit. I have to do what makes me feel comfortable.\n\nKim K was robbed at gunpoint by two masked men in her hotel room in Paris in October of 2016. The men reportedly stole $10 million dollars worth of jewelry and tied up the Kardashian star. She was unharmed, but severely shaken.\n\nAlthough the entire Kardashian family is severely judged by every move they make, it's important to remember they are human, too. Kim K appears to have it all together on the outside, but on the inside she's just like the millions of other people who suffer from panic attacks and anxiety disorders daily. Those who go through it know how deeply traumatic it can feel. That's why Kim's brave documentation of her anxiety attack is important to showcase and to remember. It's proof we all struggle... even Kim Kardashian.\n\nCheck out the entire Gen Why series and other videos on Facebook and the Bustle app across Apple TV, Roku, and Amazon Fire TV.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2020/4/9/f04700b9-2e38-452c-8112-5352f1765b19-getty-1060381824.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/2/f2d41d12-2957-4f14-83a9-45d955e82f13-getty-930538154.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2017/10/6/85ee6531-3c89-45b9-ba65-c7a49bb7951a-getty-844545642.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/11/959d0fb8-50a7-4da1-aaa8-a61da167c25a-getty-1181284940.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2017/10/6/85ee6531-3c89-45b9-ba65-c7a49bb7951a-getty-844545642.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/uploads/getty/2017/10/6/85ee6531-3c89-45b9-ba65-c7a49bb7951a-getty-844545642.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/video-of-kim-kardashian-having-a-panic-attack-on-kuwtk-is-so-so-heartbreaking-2805601", "title": "Video Of Kim Kardashian Having A Panic Attack On 'KUWTK' Is So, So Heartbreaking", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/video-of-kim-kardashian-having-a-panic-attack-on-kuwtk-is-so-so-heartbreaking-2805601", "type": "article", "title": "Kim Kardashian Has A Panic Attack In New 'KUWTK' Clip & It's Heartbreaking", "description": "Everyone is always talking about Kim Kardashian. Whether she's supporting Kanye West in his latest debacle or sharing pictures of her cute kids, the woman and her family make their rounds on the internet. This time, the brave reality star shared a…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2017/10/6/85ee6531-3c89-45b9-ba65-c7a49bb7951a-getty-844545642.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "Everyone is always talking about Kim Kardashian. Whether she's supporting Kanye West in his latest debacle or sharing pictures of her cute kids, the woman and her family make their rounds on the internet. This time, the brave reality star shared a…"}, "movies": [], "publish_date": null, "source": "http://www.elitedaily.com", "summary": ""}