{"url": "https://en.wikipedia.org/wiki/Oliver_Hudson", "text": "Oliver Rutledge Hudson (born September 7, 1976)[1] is an American actor. He is known for his roles as Adam Rhodes in the CBS comedy series Rules of Engagement (2007–2013), Jeff Fordham on the ABC musical drama series Nashville (2013–2015) and Wes Gardner in the Fox horror comedy Scream Queens. He appeared as one of the main cast members of the ABC sitcom Splitting Up Together, produced by Ellen DeGeneres.\n\nEarly life [ edit ]\n\nHudson was born in Los Angeles to Academy Award-winning actress Goldie Hawn and musician Bill Hudson.[1] After his parents divorced in 1980, he and his sister, actress Kate Hudson, were raised in Colorado by their mother and her partner, actor Kurt Russell. He has four half-siblings: Emily and Zachary, from his biological father's marriage to actress Cindy Williams; Lalania, from another of his father's relationships in 2006; and Wyatt, from his mother's relationship with Kurt Russell.[2]\n\nHudson is of Italian, Hungarian-Jewish, English, and German ancestry.[3][4] He was raised in the Jewish faith.[5]\n\nCareer [ edit ]\n\nHudson appeared opposite his mother in 1999 comedy film The Out-of-Towners and later starred in several teen movies, like The Smokers, and Going Greek. In 2002, he played the lead role of The WB comedy series My Guide to Becoming a Rock Star. Hudson also appeared in recurring role opposite Katie Holmes as her love interest, Eddie Doling, in sixteen episodes of Dawson's Creek from 2002 to 2003.[6]\n\nHudson starred in The WB series The Mountain from 2004 to 2005; the show was canceled after 13 episodes. In 2006, he starred in horror films The Breed and Black Christmas. He also starred with Claire Forlani in Lifetime movie Carolina Moon in 2007. From 2007 to 2013, Hudson starred as Adam Rhodes in the CBS sitcom Rules of Engagement (2007–2013).\n\nIn 2013, Hudson was cast in the recurring role of Jeff Fordham for the second season on the ABC drama series Nashville.[7][8] Hudson later was promoted to series regular for third season.[9]\n\nIn 2015, Hudson was cast as a series regular on the horror comedy anthology series Scream Queens playing Wes Gardner, the father of a college sorority pledge member.\n\nAlso in 2015, Hudson and his sister, Kate Hudson, launched FL2, a men's activewear line and subsidiary of Fabletics.[10]\n\nIn 2017, Hudson was cast in the lead role of Martin in the ABC sitcom Splitting Up Together[11] and premiered in 2018. The series was cancelled after two seasons. In 2020, Hudson will play in the lead role of Will in the CBS comedy pilot The Three of Us which was created by Frank Pines.[12]\n\nPersonal life [ edit ]\n\nHudson married actress Erinn Bartlett on June 9, 2006, in Cabo San Lucas, Mexico. The ceremony was officiated by a Buddhist monk.[13] The couple have three children: two sons, Wilder Brooks (born August 23, 2007) and Bodhi Hawn (born March 19, 2010),[14][15] and a daughter, Rio Laura (born July 18, 2013).[16]\n\nHudson entered the World Series of Poker main event in 2005 but was eliminated in his first hand by Sam Farha.[17]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nAwards and nominations [ edit ]\n\nYear Award Nominated work Result Ref 2001 Teen Choice Awards for Choice Movie Actor: Comedy (shared with co-star Harvey Silver) Going Greek Won [18]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Oliver_Hudson.jpg/220px-Oliver_Hudson.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/9/91/Oliver_Hudson.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/9/91/Oliver_Hudson.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Oliver_Hudson", "title": "Oliver Hudson", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/9/91/Oliver_Hudson.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}