{"url": "https://en.wikipedia.org/wiki/Johnny_McDaid", "text": "John McDaid (born 24 July 1976)[1] is a singer, songwriter, musician and record producer from Northern Ireland.[2] He is a member of the band Snow Patrol and Vega4, and has written songs with other artists including Ed Sheeran, P!nk and Robbie Williams.\n\nEarly life [ edit ]\n\nOne of six children of John (died in 2011) and Pauline McDaid,[1] McDaid attended St Brigid's Primary School,[3] Carnhill,[1] and St Columb's College.[1]\n\nCareer [ edit ]\n\nMcDaid was the singer and songwriter of the band Vega4, whose second album You and Others was produced by Jacknife Lee. Its first single, \"Life Is Beautiful\", was featured on the US Contemporary Radio Charts Top 40 for 12 weeks in 2007,[citation needed] and was the song used for the theatrical trailer of My Sister's Keeper.[citation needed] In 2009, McDaid was the first person to sign to Snow Patrol's publishing company, Polar Patrol Publishing.[4]\n\nMcDaid went on to play guitar and piano and sing backing vocals in the alternative rock band Snow Patrol. While on the road with Snow Patrol, McDaid was developing his unique style of writing and working with artists in a variety of genres, scoring a hit with Example's “Say Nothing” which went to number 2 in the UK singles chart in 2012.[5] Collaborations with artists as diverse as Robbie Williams' “Love My Life”,[6] Biffy Clyro “Howl”,[7] Rudimental “Never Let You Go”,[8] “Bloodstream”,[9] Birdy “Wild Horses” [9] and Kodaline “Love Will Set You Free”.[10]\n\nMcDaid's songs have been featured on many television shows, including, One Tree Hill, The Hills, Pushing Daisies, Defying Gravity,[citation needed] and have been used for many HBO network season campaigns,[citation needed] among others. His songs have also been used on various advertising campaigns including: Land Rover, Jeep, and RTÉ,[citation needed] and in feature films, including Into the Blue, The Sisterhood of the Traveling Pants and Sex Drive.[citation needed] McDaid produced the \"Snow Patrol Remix\" of U2's \"Unknown Caller\" in January 2010.\n\nMcDaid also has a studio, Fieldwork Music, in North London where he writes, produces and mixes with and for various artists and songwriters. He has used Fieldwork as a project name for song releases, including the single \"This Is Not The End\", which featured in a trailer for the film Edge of Tomorrow.[11]\n\nIn 2012, Example released his album The Evolution of Man. The debut single \"Say Nothing\", co-written with McDaid was released in September 2012, debuting at number two on the UK Official Charts.[12] The song was received positively overall and became the best selling song from the album. Digital Spy rated it four stars, calling it \"an electronic anthem that's ready to take over the airwaves\" and commenting that it \"maintains a sense of depth, proving that despite his questionable celebrity jibes his talent still comes out on top.\"[13]\n\nCollaborations [ edit ]\n\nKnown to work with styles of music from dance and pop to acoustic singer songwriters, McDaid has written and produced tracks for Ed Sheeran, Harry Styles, Carina Round, Ingrid Michaelson, Gary Go, Example, Birdy, Kodaline, Rudimental, Biffy Clyro and Rosi Golan. He has also worked with Iain Archer, Declan O'Rourke, Tonio K, and Freelance Hellraiser. He wrote and produced the title track for the movie House of Fools, which was directed by Academy Award-nominated director Eva Isaksen, and has written and produced records for Sony BMG, Universal Music Group, EMI, PIAS Recordings, Mushroom Records, and Capitol Records.\n\nMcDaid worked with Paul Van Dyk, resulting in \"Time of Our Lives\", the number one club chart single from the Grammy Award-nominated album Reflections. He also wrote and performed the number one club chart hit \"Home\" for Paul van Dyk. The single was awarded Best Track at the 2009 Trance Awards. McDaid has performed with Paul van Dyk at selected shows.\n\nIn January 2013, McDaid and Gary Lightbody performed at the \"Sons & Daughters\" concert in Derry, McDaid's hometown, to mark the opening of the city's UK City of Culture year.[14] In early 2013, McDaid moved to Nashville, Tennessee with singer-songwriter Ed Sheeran to work with him on his second album. Sheeran and McDaid are close friends and later moved to Los Angeles together to continue working on Sheeran's second record.[15] In November 2013, Sheeran posted a picture of himself and McDaid on Instagram stating that they had been making the record together for two years and that it was now complete.[16] Sheeran's X album was released in June 2014 with McDaid having co-written seven of the songs, including \"Photograph\", which went on to go platinum and win a BMI Pop Award, and hit song \"Bloodstream\", which was nominated for Best Song Musically and Lyrically at the 2016 Ivor Novello Awards. For his work on the album, McDaid was Grammy and BRIT Award nominated, with the record going on to win the 2015 BRIT Award for Album of the Year. In 2016 he co-wrote \"Love My Life\" with Robbie Williams & Gary Go from Robbie Williams \"The Heavy Entertainment Show\" album.\n\nIn 2017, McDaid had his first hit with his co-write of Ed Sheeran's 'Shape Of You' (co-written with Ed Sheeran and Steve Mac). The song went to number 1 in the UK and US and remained number 1 in the UK for four weeks.[17] The song had 240,000 downloads in the first week of its release,[18] with 12.71 million streams on Spotify in the first 48 hours [19] He also developed a lot of Ed's third album.\n\nIn 2017, McDaid co-wrote the single What about us by Pink. [20] On October 6, 2017, country music duo Tim McGraw and Faith Hill released the single “Rest Of Our Life”, written by McDaid, Ed Sheeran, Amy Wadge, and Steve Mac.[21]\n\nPersonal life [ edit ]\n\nMcDaid began dating Friends actress Courteney Cox in late 2013.[22] The couple announced their engagement on 26 June 2014.[23] In 2019, Cox announced that the couple broke off their engagement but are still in a relationship.\n\nMcDaid lives in London and divides his time between the UK and the US, where Cox lives.[24]\n\nMcDaid speaks Irish.[25] He has a tattoo on his left arm reading Nuair is gá dom filleadh abhaile, is tú mo réalt eolais (\"When I need to get home you're my guiding light\"), an Irish translation of the song \"Guiding Light\" by fellow Northern Irish musician Foy Vance. Ed Sheeran and Vance both have the same tattoo. The song was written for Johnny's late father, John McDaid, Sr., who died in July 2011. \"Guiding Light\" was recorded with Sheeran featured on vocals, and Vance on vocals and piano.[26][27]\n\nSongwriting and production credits [ edit ]\n\nReferences [ edit ]\n\nSources [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Snow_Patrol_-_2018153204702_2018-06-02_Rock_am_Ring_-_1D_X_MK_II_-_0629_-_B70I1936.jpg/300px-Snow_Patrol_-_2018153204702_2018-06-02_Rock_am_Ring_-_1D_X_MK_II_-_0629_-_B70I1936.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Snow_Patrol_-_2018153204702_2018-06-02_Rock_am_Ring_-_1D_X_MK_II_-_0629_-_B70I1936.jpg/1200px-Snow_Patrol_-_2018153204702_2018-06-02_Rock_am_Ring_-_1D_X_MK_II_-_0629_-_B70I1936.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Snow_Patrol_-_2018153204702_2018-06-02_Rock_am_Ring_-_1D_X_MK_II_-_0629_-_B70I1936.jpg/1200px-Snow_Patrol_-_2018153204702_2018-06-02_Rock_am_Ring_-_1D_X_MK_II_-_0629_-_B70I1936.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Johnny_McDaid", "title": "Johnny McDaid", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Snow_Patrol_-_2018153204702_2018-06-02_Rock_am_Ring_-_1D_X_MK_II_-_0629_-_B70I1936.jpg/1200px-Snow_Patrol_-_2018153204702_2018-06-02_Rock_am_Ring_-_1D_X_MK_II_-_0629_-_B70I1936.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}