{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2016/12/01/leah-reminis-long-history-of-calling-out-the-church-of-scientology/", "text": "A solid number for the show isn’t surprising — Scientology is one of those topics that’s irresistible, mostly because of the secretive nature of the famously controversial church. Remini, known for the hit sitcom “King of Queens,” was a devout Scientologist for 35 years before she left the church in 2013. She has been an outspoken critic ever since, although it is extremely rare for anyone to criticize Scientology after they leave. Here’s her history of calling out the church:\n\n(For the record, the church has called Remini an “obnoxious, spiteful ex-Scientologist” and claims the actress is bitter that she was expelled for unethical conduct; it also disputes many statements made in the A&E show. Church officials say that Remini is trying to “distort the truth” about Scientology and that she’s “doing [the show] for the money and now tries to pretend otherwise.”)\n\nAD\n\nAD\n\nJuly 2013: Page Six confirms that Remini, who rose to very high levels in the organization once she became a star and donated millions, has left Scientology. A Remini “source” says the actress was “put through interrogations and blacklisted within the church” when she started to question leader David Miscavige, particularly the whereabouts of his wife, Shelly, who reportedly hasn’t been seen in public since 2007.\n\nRemini said she also disagreed with the church’s policies that restrict members from talking to relatives who criticize the church, a practice known as “disconnecting.” “She is stepping back from a regime she thinks is corrupt. She thinks no religion should tear apart a family or abuse someone under the umbrella of ‘religion,’ ” the source says.\n\nLater that month, Remini echoes this sentiment to People magazine. “I believe that people should be able to question things. I believe that people should value family, and value friendships, and hold those things sacrosanct,” she says. “That for me, that’s what I’m about. It wouldn’t matter what it was, simply because no one is going to tell me how I need to think, no one is going to tell me who I can, and cannot, talk to.”\n\nAD\n\nAD\n\nAugust 2013: Remini files a missing-person report for Shelly Miscavige, which the Los Angeles Police Department calls “unfounded.” The church says it’s “ill-advised, ludicrous self-promotion” on Remini’s part.\n\nSeptember 2013: Remini joins the cast of “Dancing With the Stars,” where she lands in fifth place. During one episode, she tells her partner, Tony Dovolani, that she hoped the show would help her move on. “The church is looking for me to fail so they can say to their parishioners, ‘You see what happens when you leave the church?’ They’re waiting for me to fail,” Remini says.\n\nFebruary 2014: Remini tells Buzzfeed that she quit Scientology because her young daughter was getting closer to the age of getting “acclimated” in it and would have to sit for audits, where members divulge personal information. Plus, Remini thought Scientology was taking over her life. “I was spending most of my time at the Church,” she says. “So, I was saying ‘family first,’ but I wasn’t showing that. I didn’t like the message that sent my daughter.” (Scientology officials call Remini’s statements “absurd, insulting and motivated entirely by a desire to grab attention.”)\n\nAD\n\nAD\n\nMarch 2015: Alex Gibney’s “Going Clear: Scientology and the Prison of Belief” documentary airs on HBO, featuring multiple ex-members telling horror stories about their time in the organization. Remini tweets her praise: “Thank you to the brave who did something about it. And to those who didn’t have a voice, you do now.”\n\nMay 2015: Remini sits for an interview with Oprah Winfrey in “Oprah: Where Are They Now?” and talks about how painful it was to leave friends behind in the church. “I’m learning there’s a new world out here and there shouldn’t be any kind of judgment toward somebody who has a belief system that is not yours,” she says.\n\nJuly 2015: The second and final season of her TLC reality show, “Leah Remini: It’s All Relative,” premieres, and Remini talks more about how she left to protect her daughter.\n\nAD\n\nAD\n\nOctober 2015: Remini writes a book, “Troublemaker: Surviving Hollywood and Scientology,” and promotes it with an in-depth interview on “20/20,” reiterating her previous claims and saying she didn’t want want to be “disconnected” from her daughter.\n\nNovember 2015: Remini’s book is released, and she spills lots of dirt, including tales of Scientology superstar Tom Cruise and Katie Holmes’s wedding weekend, which is where her relationship with the church started to go downhill after Remini was accused of behaving badly. The church’s response? Remini is “pathetically exploiting her former religion, her former friends and other celebrities for money and attention to appear relevant again.”\n\nDecember 2015: According to her show on A&E, Remini starts to get lots of requests for help from people who still have family members in the church. She captures one story on video of a family torn apart by Scientology, and decides to develop a show.\n\nAD\n\nAD\n\nNovember 2016: “Leah Remini: Scientology and the Aftermath” premieres on A&E, chronicling Remini’s past and the stories of former members, who allege physical and sexual abuse. (Scientology officials say all of them are lying.)\n\n“I want to give a voice to these stories,” Remini says in the show, “enough that people will be incensed by it to put some pressure on this organization to stop abusing people.”", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/57f2027b-73ed-448e-b497-38ad3452a54b.png&w=90&h=90", "https://www.washingtonpost.com/resizer/rpMMAByuvXo5luT3NSQsGt6ze_A=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HWLV77KLV46MDCKG6DM6EIH6DA.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HWLV77KLV46MDCKG6DM6EIH6DA.jpg&w=150"], "top_img": "https://www.washingtonpost.com/resizer/rpMMAByuvXo5luT3NSQsGt6ze_A=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HWLV77KLV46MDCKG6DM6EIH6DA.jpg", "keywords": [], "authors": ["Emily Yahr", "Style Reporter Covering Pop Culture"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2016/12/01/leah-reminis-long-history-of-calling-out-the-church-of-scientology/", "title": "Leah Remini’s long history of calling out the Church of Scientology", "meta_data": {"description": "It all culminated in this week's A&E docuseries, in which Remini says she will expose \"shocking stories of abuse, heartbreak and harassment.\"", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2016/12/01/leah-reminis-long-history-of-calling-out-the-church-of-scientology/", "image": "https://www.washingtonpost.com/resizer/rpMMAByuvXo5luT3NSQsGt6ze_A=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HWLV77KLV46MDCKG6DM6EIH6DA.jpg", "title": "Leah Remini’s long history of calling out the Church of Scientology", "description": "It all culminated in this week's A&E docuseries, in which Remini says she will expose \"shocking stories of abuse, heartbreak and harassment.\""}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Leah Remini’s long history of calling out the Church of Scientology", "description": "It all culminated in this week's A&E docuseries, in which Remini says she will expose \"shocking stories of abuse, heartbreak and harassment.\""}, "last_updated_date": "2019-04-21T22:24:02.542Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1480521600.0, "source": "https://www.washingtonpost.com", "summary": ""}