{"url": "https://www.independent.co.uk/arts-entertainment/tv/features/the-arrangement-scientology-e-best-show-tv-religion-a8252676.html", "text": "If you counted down the days until Going Clear aired or watched every episode of Leah Remini's takedown of Scientology, then you will likely fall into the void that is The Arrangement. Truthfully, I was hesitant to watch E!'s second scripted series after not being able to see the allure of The Royals, but my fascination with Scientology drew me into the series. The Arrangement - which premiered in 2017 - follows the relationship between aspiring actress Megan Morrison (Christine Evangelista) and Hollywood superstar Kyle West as Megan enters a contract marriage with him. Kyle is a coveted member of a self-help organisation called \"The Institute of The Higher Mind (IHM)\" led by Terence Anderson former Alias star Michael Vartan). As Megan - a very mediocre actress - gets more involved with Kyle, she is also coerced into making IHM a part of her life. The combination of allusions to Scientology and Ashlee Simpson's ex-boyfriend (Henderson) from her MTV reality series was enough to get me hooked.\n\nBefore the show premiered last March, rumours circulated that The Arrangement was actually inspired by Katie Holmes and Tom Cruise's marriage. Creator Jonathan Abrahams told THR that the team was \"inspired by rumours we have all heard.\" He said, \"If you and I took a minute, we could probably come up with 10 couples that we’ve heard might be not real or might have been arranged. And, by the way, that goes back to the golden age of Hollywood.\" While Holmes and Cruise's marriage may not be the only inspiration for The Arrangement, it's hard to believe it didn't cross any of the team's minds. \"I’m happy for people to think, 'Oh, this must be the Tom and Katie story.' But then they’ll watch and realise it’s not,\" Abrahams added.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nOf course, The Institute of The Higher Mind is not Scientology - it's formatted as a place where people are looking to improve their lives, not as a religion. It's supposed to give an inside look at how people may or may not be lured into these types of groups (i.e. AA, Lifespring or Landmark Forum), which is what makes the show interesting. However it's difficult to deny the Easter eggs within the show that allude to the aforementioned self-help groups, but also Scientology. When Megan first auditions for West's movie - which is actually an audition to be his wife - she is asked to deliver \"three imperatives.\" This is an IHM mind exercise and something that parallels tests that the Church gives their members. It's also impossible to deny the closeness of Anderson and West - a similarity to Cruise's relationship with friend and Scientology leader David Miscavige. As Megan becomes more involved with IHM, all media requests need to be approved by the organisation. In Scientology, members of the Church are only supposed to talk about their religion in Scientology-specific publications and can't talk about it if they leave it. The Church denies all claims made by former members. But perhaps one of the biggest allusions to the religion comes from Kyle's ex Lisbeth (Ashley Grace), who is paranoid about being followed and won't discuss her past with IHM. She left Kyle with no explanation other than a letter saying she was \"getting lost\" in his world. This is not too foreign from Cruise's divorce from Mimi Rogers or Nicole Kidman. In 2012, former Scientology executive Marty Rathburn told Vanity Fair that \"both women got cold on Miscavige\" and he was essentially \"integral to the breakup\" of their relationships.\n\nWhile the show does a deep dive into the idea of self-help groups and cult-like organisations, it also touches on the idea of Hollywood's fake relationships and contract marriages - appealing to people who enjoy blind item sites. Watching Megan go from struggling actress to leading lady is engaging, especially when the public wonders how certain stars get famous so quickly. The Arrangement also reveals the dark secrets that are rumoured to be hidden behind some of the most famous celebrities - it's evident that Kyle has an anger management problem and a past he's tried to leave behind.\n\nThis season focuses more on what happens when Megan actually gets fully immersed in the IHM experience as her wedding to Kyle looms.\n\nCome for the conspiracy theories and stay for Ashlee Simpson's ex-boyfriend.\n\nThe Arrangement airs at 9pm EST on E!", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/03/12/13/nup-174905-0334.jpg", "https://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/03/12/13/nup-174905-0334.jpg", "keywords": [], "authors": ["Ilana Kaplan"], "canonical_link": "https://www.independent.co.uk/arts-entertainment/tv/features/the-arrangement-scientology-e-best-show-tv-religion-a8252676.html", "title": "Why The Arrangement is the best show on TV for the Scientology-obsessed", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "http://www.independent.co.uk/arts-entertainment/tv/features/the-arrangement-scientology-e-best-show-tv-religion-a8252676.html", "title": "Why The Arrangement is the best show on TV for the Scientology-obsessed", "description": "It's the best-worst show you're probably not watching", "updated_time": "2018-03-13T16:13:46+00:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/03/12/13/nup-174905-0334.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB", "video": {"identifier": "https://f1.media.brightcove.com/4/624246174001/624246174001_5749990040001_5749990297001.mp4?pubId=624246174001&videoId=5749990297001", "type": "application/octet-stream"}}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/8252676"}, "description": "If you counted down the days until Going Clear aired or watched every episode of Leah Remini's takedown of Scientology, then you will likely fall into the void that is The Arrangement. Truthfully, I was hesitant to watch E!'s second scripted series after not being able to see the allure of The Royals, but my fascination with Scientology drew me into the series.", "keywords": "the arrangement, E! News, Church Of Scientology, Scientology, TV show, Features, TV & Radio, Culture", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "the arrangement", "published_time": "2018-03-13T13:22:00+00:00", "modified_time": "2018-03-13T16:13:46+00:00", "section": "Features", "subsection": "Video", "author_name": "Ilana Kaplan", "content_type": "story", "word_count": 756, "image_count": 3, "video_count": 0, "embed_count": 0, "internal_link_count": 2, "external_link_count": 2}, "twitter": {"title": "Why The Arrangement is the best show on TV for the Scientology-obses…", "description": "If you counted down the days until Going Clear aired or watched every episode of Leah Remini's takedown of Scientology, then you will likely fall into the void that is The Arrangement. Truthfully, I", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1520947320.0, "source": "https://www.independent.co.uk", "summary": ""}