{"url": "https://gameofthrones.fandom.com/wiki/Beyond_the_Wall_(episode)", "text": "\"Beyond the Wall\" is the sixth episode of the seventh season of Game of Thrones. It is the sixty-sixth episode of the series overall. It premiered on August 20, 2017. It was written by David Benioff & D.B. Weiss and directed by Alan Taylor.\n\nContents show]\n\nPlot\n\nJon and the Brotherhood hunt the dead. Arya confronts Sansa. Tyrion thinks about the future.\n\nSummary\n\nAt Winterfell\n\nAt Winterfell, Arya Stark talks to her sister Sansa Stark about borrowing Bran Stark's bow and arrow. She tells Sansa that she practiced several times until she finally hit the bullseye. Arya recalls that their father Eddard Stark had been watching and clapped his hands in praise of her accomplishments. Arya reasons that their father knew that the rules were wrong but that his daughter was in the right. She then confronts Sansa about her alleged role in their father's death.\n\nArya presents the letter that Sansa had written to their late brother Robb Stark urging him to come and bend the knee to King Joffrey Baratheon. Sansa replies that the Queen Mother Cersei Lannister forced her to do it under duress. Arya counters that she was not tortured and that she saw Sansa at Ned's execution; Sansa retorts that Arya did nothing to stop their father's execution either. Arya chastises Sansa for betraying their family but Sansa responds that they have only returned to Winterfell because of her, while Arya travelled the world in pursuit of her own agenda. Sansa adds that their half-brother Jon Snow was saved from defeat when Petyr Baelish and the Knights of the Vale came to their rescue and insists Arya would not have survived the torments she endured at the hands of Joffrey and Ramsay.\n\nSansa demands to know where Arya found the letter and chides her younger sister that Cersei would be pleased to see them fighting but Arya is still bitter towards Sansa. She realizes that while Jon would understand the difficult circumstances Sansa was under when she wrote the letter, Sansa is afraid the Northern lords will discover it and turn on her, including Lyanna Mormont. Arya adds that Lyanna is younger than Sansa was when she wrote this letter but argues Lyanna wouldn't agree with Sansa's defense that she was a child at the time. While recognizing that Sansa wrote the letter out of fear, a bitter Arya says that she prefers to embrace anger over fear.\n\nLater, Sansa asks Petyr Baelish about where Arya got the letter from, unaware that Baelish orchestrated the entire incident. Sansa tells Petyr that she is commanding 20,000 men who answer to Jon but not to her. Petyr tells Sansa that the men will trust her because she can rule. Sansa does not trust the loyalty of the Northern lords, citing their history of switching sides. She counters that the discovery of the letter will turn her liege lords and men against her. Sansa confides in Petyr about her strained relations with Arya. Petyr suggests that Sansa talk to Brienne of Tarth because she has sworn to protect both of Lady Catelyn Stark's daughters from harm's way. Trusting Baelish, Sansa accepts his advice.\n\nThe following morning, Maester Wolkan informs Sansa that they have received a letter from Queen Cersei. Sansa meets with Brienne, who advises her not to leave Winterfell. Instead, Sansa decides to send Brienne as her representative since she could reason with Jaime Lannister. Brienne warns that it is too dangerous for her to leave Sansa alone at Winterfell with Petyr. Sansa insists that her guards and men are loyal to her but Brienne warns that Petyr might be bribing them behind her back. Brienne offers to leave her squire Podrick Payne, whose swordsmanship has improved, but Sansa insists that she can take care of herself.\n\nFollowing the events of the Wight Hunt, Sansa enters Arya's quarters and opens a leather case containing several \"faces\", including the literally late Walder Frey's face. Arya catches her sister pilfering through her personal effects. When Sansa tells Arya that her men are loyal to her, Arya mockingly retorts that they are not here. Arya tells Sansa that she obtained the faces from the Faceless Men of Braavos and admits she spent time training to be a Faceless Man. She forces Sansa to play the lying game and begins by asking if she thinks that Jon is the rightful King. Sansa demands that Arya tell her what the \"faces\" are.\n\nArya replies that they always wanted to pretend to be other people. Sansa wanted to be a queen while Arya herself wanted to be a knight. In the end, neither of them got what they wanted. Arya says that the faces allow her to become someone else and toys with the idea of assuming Sansa's face and status. Arya approaches Sansa with her dagger and muses as the possibility of becoming the Lady of Winterfell. However, Arya relents and leaves a disturbed Sansa alone with the dagger.\n\nThe Wight Hunt\n\nAt Dragonstone castle, Queen Daenerys Targaryen and her Hand Tyrion Lannister chat in the Chamber of the Painted Table. Daenerys tells Tyrion that she appreciates the fact that he is not a hero because they have a tendency of risking their lives to do dangerous things. She compares Tyrion favorably to \"heroes\" such as Khal Drogo, Ser Jorah Mormont, Daario Naharis and Jon Snow, most of whom \"do stupid things, trying to outdo the others\". Tyrion, slightly amused, notes that all of those individuals fell in love with Daenerys, but she dismisses the obvious implication that Jon Snow is in love with her – to which Tyrion sarcastically quips that Jon must be staring so longingly at her because he is so eager for a military alliance. Daenerys remarks that Jon is too little for her tastes, but immediately apologizes when she realizes she's accidentally insulted Tyrion's height. Daenerys also recognizes that Tyrion is no coward. The two then turn their attention to the topic of their impending meeting with Queen Cersei in King's Landing. Tyrion admits that Cersei cannot be trusted and could be setting a trap for them, but that Daenerys will have the Unsullied, the Dothraki and her dragons at hand; if anyone tries to harm her, King's Landing will be leveled in response.\n\nDaenerys wonders whether, given that Cersei will almost certainly be attempting to double-cross them, they should be planning something similar. Tyrion is firmly against any deceit, counseling Daenerys that while she needs a healthy degree of fear to instill respect, she cannot rule through fear alone, as leaders who rule through fear alone like Cersei, Tywin, and Joffrey are hated by their people and forever vulnerable to being overthrown. Tyrion reminds Daenerys about her vision of creating a new society by \"breaking the wheel\" rather than merely imitating prior rulers like Aegon Targaryen, and cautions her about her temper and impulsiveness, citing the fiery executions of Lord Randyll Tarly and his son Dickon. Daenerys asserts that such an action was necessary, but Tyrion still believes she should have attempted more merciful means of dealing with the problem the Tarlys posed, or at least left them alive long enough to consider her other options rather than having them summarily executed. As Daenerys becomes increasingly agitated in the face of Tyrion's blunt but reasonable remarks, he reassures Daenerys that he supports her vision and ideals. Tyrion also proposes that Daenerys consider a succession plan in the event of a disaster, given that by her own admission, she believes she is incapable of bearing children. She refuses to consider this plan until she has donned the crown, also coldly blaming Tyrion's policy of caution for causing her the loss of Highgarden, Ellaria Sand, and Yara Greyjoy.\n\nJon Snow and his ranging party travel through the lands beyond the wall on their mission to capture a wight. Gendry complains about the bitter cold and asks Tormund about life as a Wildling. Tormund later confides with Jon about the foolhardy nature of their mission, while Jon discusses his difficult negotiations with Daenerys. Tormund points out that the pride of the Northmen may cost them too many lives, citing Mance Rayder and the Wildlings as an example. While walking, Gendry also confronts the Brotherhood Without Banners about selling him off as a sacrifice to Melisandre. Sandor Clegane sneers that Gendry should be grateful that he is still alive and points out that Beric Dondarrion has been killed six times (not mentioning one of those was by Sandor himself) \"and you don't hear him bitching about it\". Not entirely sure what to think of that particular revelation, Gendry accepts a drink from Thoros's wineskin.\n\nWhile walking, Jon and Jorah Mormont also chat about their relationships with their fathers Eddard Stark and Jeor Mormont respectively. They say that their fathers were good and honorable men and did not deserve their deaths. Jon tells Jorah about the brutal death of Jeor at the hands of the Mutineers and that Eddard was beheaded. Jon tries to return to Jorah his father's Valyrian sword Longclaw but Jorah tells him that he is not worthy to bear his father's sword, having forfeited any claim to it when he brought shame into his House. His father gave the sword to Jon, and gives his blessing for Jon and his future children to keep it.\n\nLater, Sandor and Tormund trade jabs about sex. Sandor takes offense when Tormund asks about how he burnt his face. Tormund then confides in Sandor about his infatuation for Brienne of Tarth, who is nearly as tall as Sandor. He jokes about having \"monstrous\" babies with her, to Sandor's utter bewilderment. Beric and Jon talk about Eddard Stark and how they have both been resurrected by worshipers of the Lord of Light. Beric tells Jon that he is fighting for life because death is the first and last enemy; it is inevitable, but it is human nature to fight it for as long as you can. He warns Jon that they have to work together to fight death and defend those who cannot defend themselves. Jon reflects on his Night's Watch oath about being the \"shield that guards the realms of men\" and agrees. Sandor sees the mountain from his vision lying ahead and steers the group in that direction.\n\nWhile trudging through a snowstorm, Jon and his party sight a massive snow bear with blue eyes approaching them. The snow bear turns out to have been resurrected by a White Walker. The monstrous creature mauls and kills three of their company. Beric and Thoros manage to set the snow bear alight with his flaming sword but it continues to attack, forcing Thoros to get in its' way when it attacks Sandor, who is too terrified of the flames engulfing the beast even to defend himself. Thoros is unable to break free of its jaws until Jorah kills it with a dragonglass dagger. Beric cauterizes Thoros' wounds with his flaming sword.\n\nJorah asks the wounded Thoros about his experience charging with a flaming sword during the Siege of Pyke, and commends his old comrade for his drunken bravery. While navigating through the mountain, they see a White Walker leading a column of Wights marching through the canyon below. The ranging party plants a fire and then ambushes them when the White Walker stops to investigate. Jon manages to kill the White Walker with Longclaw, causing most of the Wights associated with it to disintegrate, while the rest of the group manages to capture the only unaffected wight. The creature unexpectedly screeches for help; Sandor slaps his gloved hand over its mouth, but it wrenches its face away when its mouth skin tears off into the glove, to Sandor and Jorah's disgust. As Jorah pulls out a bag from his jacket and secures it over its head, Sandor and Tormund bind the creature with a coil of rope. In the middle of this, they realize their captive's howls have drawn the attention of a massive host of wights now heading their way, hastening their work.\n\nAs the noise of the horde approaches, Jon sends Gendry, over his protest, back to Eastwatch-by-the-Sea to bring news to Daenerys as he's the fastest. Gendry gives his war hammer to Tormund, who hands it to Sandor who has the wight slung over his shoulder. The wights pursue the group over a lake of weak ice, as they flee toward a large stone island jutting out in the middle. One of the party trips and falls behind; a few of the horde tackles him, the combined weight breaks the ice, and they fall through. This causes a chain reaction of breaking ice all around the rock until the horde slows to a stop to avoid the water. Throughout the night, Jon and his comrades wait in the middle of the ice while encircled by the army of the undead. Meanwhile, Gendry reaches Eastwatch's outer gates but collapses from exhaustion. Davos Seaworth and several guards attend to him. When Davos asks what happened, Gendry tells him to prepare a raven; Davos orders to bring the Maester.\n\nIn the morning, Jon and his company awake to find that Thoros has died from his wounds. Beric and Sandor pay their last respects, with the former praying for the Lord of Light to guard them as the latter assures him freezing to death is said to be one of the better ways to die. At Jon's insistence, they burn the body with Beric's flaming sword so Thoros can't be reanimated. The wights watch while their captive Wight struggles under its hood and restraints. Jorah proposes killing the wight but Jon counters that they need to keep it as evidence. Beric suggests that Jon kill the Night King, who has just arrived on horseback; given that they've seen killing a Walker destroyed the wights it controlled, killing the Night King might destroy them all. He then adds that the Lord of Light has not resurrected Jon for no reason, but Sandor reminds him that they have just lost their priest, and Beric is now down to his last life.\n\nAfter receiving Gendry's message from Eastwatch, Tyrion implores Queen Daenerys, who has donned a cold-weather version of her Targaryen garb, not to leave for the North because it is too risky, insisting that Jon and his companions knew the risks of their mission and that if Daenerys dies beyond the Wall, everything they've done will be for nothing. Daenerys counters that he told her to do nothing before and she lost. Dissatisfied with his advice, Dany leaves with all three dragons to the lands beyond the Wall to aid Jon Snow and his ranging party.\n\nBored, Sandor hurls two rocks at one of the undead minions, knocking its jaw off. The second however, skids across the ice, and both the party and the undead quickly realize the ice, which has hardened overnight, is strong enough to support their weight, and in ever-increasing numbers, the horde attacks the group's position. Sandor holds them back with Gendry's hammer while Jon and the other members of the ranging party join in, wielding weapons of fire, dragonglass or Valyrian steel. Beric manages to set several of the wights alight with his flaming sword. The ranging party hack and slash at the wights with their blades but are unable to stem the tide. With the group overwhelmed, Jon orders them to fall back to the highest part of the island. Tormund is overwhelmed by several wights and is nearly dragged under the ice, but is saved by Sandor, who drags him back onto the island. The group continues fighting against the wights. One of the Wildlings falls off a ledge and is ripped apart by the creatures, who begin to scramble up the ledge towards the living.\n\nWhen all seems lost, Queen Daenerys arrives with her dragons, who attack the wights with dragonfire. Hundreds of wights are burned to ashes while others collapse under the ice, which is melted by dragonfire. Jon and his party rush to Daenerys and her dragon Drogon, dragging their captive wight with them, while Viserion and Rhaegal provide covering fire from above. Meanwhile, the Night King obtains an icy javelin from one of his lieutenants and hurls it at Viserion, scoring a direct hit. Viserion is struck in the neck and plunges helplessly into freefall, shrieking in agony as blood and fire pour from the fatal wound. Drogon and Rhaegal cry out for their brother, but are powerless to help him as Daenerys watches in horror and sorrow. Viserion crashes onto the frozen lake, shattering the ice, and slowly sinks beneath it.\n\nAs the Night King readies another spear, Jon hollers at Daenerys and company to leave with her remaining dragons before being dragged under the ice by two wights. Daenerys and the survivors of Jon's ranging expedition flee with Drogon and Rhaegal before the Night King can kill them. He hurls the second javelin, but Drogon narrowly dodges it. With the dragons gone, the Night King and his army leave the scene. Later, Jon Snow climbs out of the ice and regains Longclaw. Jon is quickly spotted and pursued by a large horde. Before the wights can finish the King in the North, his long-lost uncle Benjen Stark appears on horseback with his flaming flail. Benjen tells Jon to flee on his horse while he stays behind to buy time for Jon to escape. While riding away on horseback, Jon watches his uncle being overwhelmed by the undead.\n\nAt Eastwatch, Sandor carries the struggling Wight into a boat. Tormund and Beric tell him they will meet again but Sandor retorts he hopes not. Daenerys sends Drogon and Rhaegal to scour the surrounding mountains for Jon. Jorah tells Daenerys that it is time to leave but she insists on waiting a bit longer. Before she can leave, they hear a horn blowing signaling a rider approaching. Looking down from the battlements, Dany sees a wounded Jon Snow approaching on horseback. Aboard their ship, Davos and Gendry remove the frozen-stiff garments and tend to Jon Snow, who has suffered severe hypothermia and several minor injuries. Daenerys also notes the massive scars on his chest from his previous fatal wounds.\n\nIn the Narrow Sea, Jon Snow wakes to find Daenerys watching over him in his chambers. Jon apologizes for the disastrous ranging party and the fact it caused Viserion's death, but Daenerys tells him not to apologize because she now knows that the army of the dead is real. Overcome with emotion, she tells Jon that the dragons are the only children she will ever have, and vows that she and Jon will together destroy the Night King. Jon thanks her for her support, addressing her as \"Dany\", and Daenerys realizes that the last person to address her by that name was her older brother Viserys Targaryen, who Daenerys remembers as not being a good person. Jon apologizes and asks if \"My Queen\" would be more appropriate; realizing he is agreeing to bend the knee, Daenerys asks Jon what the Northern lords loyal to him will make of this. Jon assures her they will come to see her for the good person she is, as he already has. Touched by his statement, Daenerys gently takes Jon's hand in her own for a moment. They gaze into each other's eye for a moment – a long moment – but Daenerys suddenly pulls away and tells him to get some rest and leaves him alone.\n\nLater, hundreds of Wights use several large chains to drag Viserion's corpse out of the frozen lake as the Night King and one of his lieutenants watch. When the dragon's corpse is dragged far enough out of the lake, the Night King walks over and places his hand upon Viserion's snout. All is quiet for a moment... and then Viserion's eyes snap open, shining a depthless, icy blue.\n\nProduction\n\nCast\n\nCast notes\n\nAppearances\n\nFirst\n\nDeaths\n\nNotes\n\nGeneral\n\nDragons traveling to the Wall\n\nIt is totally impossible that a raven could be sent to Dragonstone, and then Daenerys could ride her dragons back to the Wall, in the only one or two days , at most, that Jon's group was trapped by the White Walkers. The distance from the Wall to Dragonstone is half a continent – Cersei even stated in dialogue that Westeros is \"a continent\" two episodes ago in \"The Spoils of War\". The Title sequence of the TV series itself even visually depicts a map indicating the vast distance between Dragonstone and the Wall. There is no possible in-universe explanation for this. Given that the showrunners have admitted that the Wight Hunt doesn't even happen in future novels, it appears that they wanted to have Daenerys swoop in to save Jon instead of, without a raven, Daenerys changing her mind and deciding to head North to help Jon, in which case she could have spent over a week flying to the Wall catching up with them. Instead, the episode clearly establishes that Gendry had a raven sent from the Wall to Dragonstone, and then Daenerys flew her dragons to the Wall after receiving the letter, in enough time to save Jon's party while they were trapped on the island in the frozen lake. Ignoring, for the sake of argument, that the top flight distance and speed of dragons has never entirely been confirmed, the speed of the messenger-raven network across Westeros has been established. Even giving the over-generous assumption that Jon's group survived at most two days on the island in the ice lake (and it seems more like one, until the ice refroze), and using the assumption that dragons can fly from Dragonstone to the Wall in a single day, this would be claiming that a messenger-raven sent from the Wall could reach Dragonstone in at most a single day. Prior seasons have repeatedly shown that the messenger-raven network isn't nearly the fast, with messages taking days or sometimes weeks to cross large distances – particularly, the distance of half a continent from the Wall to Dragonstone (Dragonstone is roughly about as far from Eastwatch-by-the-Sea as King's Landing was from Castle Black in prior seasons). Even this is assuming that it wasn't one raven in a direct flight, but fresh ravens spreading the message to new castles in a chain (i.e. like a human messenger switching to a fresh horse at each new castle he passed so he could ride for two days in a row, instead of staying on the same horse and tiring him to death).\n\nIt is totally impossible that a raven could be sent to Dragonstone, and then Daenerys could ride her dragons back to the Wall, in the only , at most, that Jon's group was trapped by the White Walkers. The distance from the Wall to Dragonstone is half a continent – Cersei even stated in dialogue that Westeros is \"a continent\" two episodes ago in \"The Spoils of War\". The Title sequence of the TV series itself even visually depicts a map indicating the vast distance between Dragonstone and the Wall. Given that the showrunners have admitted that the Wight Hunt doesn't even happen in future novels, it appears that they wanted to have Daenerys swoop in to save Jon instead of, without a raven, Daenerys changing her mind and deciding to head North to help Jon, in which case she could have spent over a week flying to the Wall catching up with them. Instead, the episode clearly establishes that Gendry had a raven sent from the Wall to Dragonstone, and then Daenerys flew her dragons to the Wall after receiving the letter, in enough time to save Jon's party while they were trapped on the island in the frozen lake. Earlier in Season 7, writer and staff loremaster Bryan Cogman was repeatedly questioned by fans over Twitter that certain characters are moving around too fast in Season 7, rushing to get them where they need to be for plot points without thought to realism. Cogman countered that these were still plausible movements, given that they avoided saying how much time passes between episodes (i.e. for all we know, it took Grey Worm months to reach Casterly Rock from Dragonstone, and ships travel faster than land armies). The week before this episode aired, however, he quit Twitter and closed his account, so he can't field any new questions about this even greater case of time compression. [2]\n\nDirector Alan Taylor responded in an interview with The New York Times , \"I've only looked at one review online, and it was very much concerned with the speed of the ravens. I thought, that's funny — you don't seem troubled by the lizard as big as a 747, but you’re really concerned about the speed of a raven. It is true there are time issues, and I'm not exactly sure how many kilometers there are between Eastwatch and Dragonstone. But it was a bit dreary to hear somebody who said, \"I cannot enjoy this episode because, you know, that speed of that raven...'\" He suggested that more time may have passed on the island than was implied, \"since it's always sort of an eternal twilight north of the Wall.\" [3] Taylor went on to insist, \"They seemed to be very concerned about how fast a raven can fly but there’s a thing called plausible impossibilities, which is what you try to achieve, rather than impossible plausibilities. So I think we were straining plausibility a little bit, but I hope the story’s momentum carries over some of that stuff.\" He insists that a raven flying from the Wall to Dragonstone in this short of an amount of time, while unlikely, is still within the realm of physical possibility. As for waving aside \"a lizard as big as a 747\" as an example that the storyline is fantastic to begin with, they already established in their fictional world how fast dragons are - and then broke their own rules. This is sometimes called the \"Magic A is Magic A\" principle, that even in Science Fiction & Fantasy worlds in which \"magic\" and magical creatures exist, once a set of rules have been established for them, those rules have to be followed consistently. Otherwise, it undermines the integrity of the story: by the same principle, for example, Highgarden could have sent a raven to Dragonstone when it came under attack earlier in the season, and Daenerys could have flown her dragons to defend it rather than let her Tyrell allies be slaughtered (and Highgarden is a shorter distance from Dragonstone than the Wall).\n\n, \"I've only looked at one review online, and it was very much concerned with the speed of the ravens. I thought, that's funny — you don't seem troubled by the lizard as big as a 747, but you’re really concerned about the speed of a raven. It is true there are time issues, and I'm not exactly sure how many kilometers there are between Eastwatch and Dragonstone. But it was a bit dreary to hear somebody who said, \"I cannot enjoy this episode because, you know, that speed of that raven...'\" He suggested that more time may have passed on the island than was implied, \"since it's always sort of an eternal twilight north of the Wall.\" Linda Antonsson, co-author with George R.R. Martin of The World of Ice and Fire sourcebook, commented on this after the episode. She calculated (based on flights from Dragonstone to King's Landing) that it would take a dragon about 28 hours flying continuously at top speed to travel from the King's Landing/Dragonstone region to the Wall - which she regarded as implausible, because a dragon can't fly continuously for that long. This is comparable to saying a horse could plausibly reach a destination if it ran at a full racing-speed gallop for 28 hours straight: mathematically it could, but it can't physically maintain that speed for even remotely that long. [4] She went on to say, however, that the raven network is so much slower than this (as confirmed by better citations), that there is no plausible way one could carry a message from the Wall to Dragonstone in enough time for Daenerys and her dragons to react to it, then fly to save Jon. She concluded, \"This would be the Game of Thrones episode where they broke the plot so badly that suspension of disbelief is well and truly dead.\" [5]\n\nsourcebook, commented on this after the episode. She calculated (based on flights from Dragonstone to King's Landing) that it would take a dragon about 28 hours flying continuously at top speed to travel from the King's Landing/Dragonstone region to the Wall - which she regarded as implausible, because a dragon can't fly continuously for that long. This is comparable to saying a horse could plausibly reach a destination if it ran at a full racing-speed gallop for 28 hours straight: it could, but it can't physically maintain that speed for even remotely that long. She went on to say, however, that the raven network is so much slower than this (as confirmed by better citations), that there is no plausible way one could carry a message from the Wall to Dragonstone in enough time for Daenerys and her dragons to react to it, then fly to save Jon. She concluded, \"This would be the episode where they broke the plot so badly that suspension of disbelief is well and truly dead.\" The implausibility of the Wall-to-Dragonstone-and-back travel time in this episode was widely criticized by major media reviewers: Lauren Sarner of Inverse said: \" In any fantasy narrative, throwing established rules out the window is dangerous, since it’s a genre that relies upon world building. A world doesn’t make sense — and isn’t compelling — if it has no clear limits, because then there are no stakes. Whether there are ten fans or millions of fans, a fantasy story can’t debunk its own rules and hope that nobody notices.\" [6] Karthryn VanArendonk of Vulture/NYMag said: \"Does it matter that the Game of Thrones timeline makes absolutely no sense? We’re long past the point of arguing that time within the world of the show actually works, but if you are a person who cares about this sort of thing — if a disregard for how fast fictional bodies could reasonably move around a fictional map was ever going to disrupt your ability to enjoy dragon battles — then Sunday’s episode is the one that finally tipped you over the edge.\" [7] Lili Loofbourow of The Week said: \"'Beyond the Wall' was — for many — a bridge too far. The idea that Daenerys could show up just in the nick of time given the circumstances makes absolutely no sense (here's an in-depth breakdown). Nor was that the biggest stretch of the episode...The explanation for these holes is that there is no explanation; the people making this show literally just don't care about those details anymore...imagine not caring enough to nail down a remotely plausible timeline because you can't be bothered. You'll just hope the spectacle is big enough to make everyone forget the gaps in the plot - it worked so well for the Waif's final fight with Arya, after all!...The chains of causation that made the Red Wedding devastating but understandable are gone.\" [8] Sarah Weymes of WinterIsComing.net reacted to Alan Taylor's lack of a coherent response to the travel time issues: \"The fact that Alan Taylor asked us to suspend our disbelief in reference to the unfeasible timeline because 'there are dragons' is a little insulting. As far as I’m aware, the presence of dragons should have no bearing on Gendry’s ability to sprint a great distance like he’s got a rocket shoved up his bottom. Genre should not act as a stand-in for common sense. A lot of the episode didn’t make sense. The least the showrunners can do is own it.\" [9] Kyle Neubeck of Collider said: \"The setup that brought us here is extraordinarily, impressively stupid.\" [10] Kevin Yeoman of Screencrant said: \"[Does having the Night King get a zombie-dragon] really outweigh Gendry's miraculous spring back to the Wall, or the raven's seemingly faster-than-light travel to Dragonstone requesting Dany's help? All season long Game of Thrones has been playing fast and loose with the rules of geography and time, and for the most part it could be shrugged off so long as you believed the appropriate amount of time had passed. Here, though, the immediacy of the situation takes that option off the table, and the storytelling is weakened as a result.\" [11] Adam Chitwood of Collider said: \"I think 'plausible impossibilities' would be a bit easier to swallow if the show hadn’t so firmly established how time passes in Game of Thrones. Jon Snow spent an entire season traveling to and roaming around the area North of the Wall, but in \"Eastwatch\" Tyrion and Davos travel to and from King’s Landing in the span of an entire episode. It’s not that we can’t buy this 'fast travel' bit of storytelling, it's that it feels like cutting corners in contrast to all that came before.\" [12] Paste magazine made several articles in reaction. Jim Forel said: \"The show is now hurtling along at such a ridiculous pace that the writers simply can’t keep up and craft simultaneous developments of multiple plotlines that make no sense under the most basic of scrutiny...What we’re criticizing here is poor screenwriting, in the sense that they keep writing characters into situations where the story requires they do things the audience understands are either stupid or impossible.\" [13] Shane Ryan said: \"The ridiculous way that characters have seemingly teleported across Westeros this season, appearing thousands of miles away in the blink of an eye, without explanation [is] lazy writing made manifest.\" [14] Matt Brennan decried the entire \"Wight Hunt\" invented by the TV writers, and that Daenerys's speedy arrival is only one of several issues with it: \"The problem runs deeper...The episode - stunningly misconceived, bafflingly constructed, shallow, frustrating, long - is its culmination and, one can hope, its nadir. In truth, the plot's temporal and geographical illogic is unsurprising: Game of Thrones has become impatient with the details that sustain one's interest between the stretches of bloodletting\". [15]\n\n\n\nOn Dragonstone\n\nThe TV series has only briefly – and not explicitly – established that Daenerys Targaryen believes she cannot have children again, which was a plot point in the books. In book/Season 1, Mirri Maz Duur performed a blood magic curse which caused Daenerys's baby Rhaego to be stillborn and monstrously deformed. The book version made it more clear that Mirri believed this had done so much damage to Daenerys's womb that she could never have children again; in subsequent books, Daenerys repeatedly reflected in her internal monologue that she considers her three dragons her \"children\" in part because she feels they are the only children she will ever have. In the series, Daenerys mentions her infertility only in \"The Prince of Winterfell\", when stressing to Jorah that she must retrieve her dragons, and in \"The Red Woman\", when Khal Moro says he will lie with her that night and \"if the Great Stallion is kind, you will give me a son.\" Daenerys replies: \"I will bear no children, for you, or anyone else. Not until the sun rises in the west, and sets in the east.\" Both of these references can be interpreted to mean a choice not to have more children, (if one ignores the non-verbal cues incorporated into Clarke's performance), but this episode makes it explicit that Daenerys has told others she believes she is infertile. The final chapter of the fifth and most current novel hints that Daenerys only believes she can no longer have children, but will recover. In her last chapter, she has been stranded by Drogon back in the Dothraki Sea (corresponding to the Season 5 finale \"Mother's Mercy\"), she notes in her inner POV monologue that she has started \"passing blood\" – apparently just thinking she is sick, but there are fan theories that it could actually mean that she has begun Flowering again and her reproductive organs have recovered. It is possible, but totally unconfirmed, that magically resurrected people like Jon Snow or Beric Dondarrion cannot have children – meaning that the bloodline of Daenerys's brother Rhaegar would go extinct as well. In which case, the last blood relative of either of them is actually Gendry – House Baratheon intermarried with the Targaryens, so (in the books) Robert Baratheon's grandmother was a younger Targaryen princess, and thus Robert was actually the second cousin of both Rhaegar and Daenerys. Tyrion even specifically brings up that if Daenerys think she can't have children, she will need to plan for the future of the crown after her eventual death. He brings up that the Night's Watch and the ironborn have their own methods for selecting new rulers without inheritance (elections, a Choosing and a Kingsmoot, respectively). Both are essentially the same, though: they are democratic elections where the citizens vote for their leader (albeit an absolute one), and the majority wins. In the backstory, when there has been no clear successor, a \"Great Council\" is called by all the major lords of the realm to choose the lawful successor. The last major one picked Aegon V Targaryen, as his eldest brother was dead but left behind a mentally handicapped daughter, his second brother was insane and left an infant son behind who many feared inherited his insanity, and his third brother, Aemon, was a maester who had foresworn inheritance. A prior Great Council at the end of the reign of Jaehaerys I Targaryen tried to sort out the succession dispute between the heirs of his first two sons, who had both predeceased him, before settling on Viserys I Targaryen. Prior Great Councils, however, relied on picking between rival heirs, not a situation in which there was no clear lawful blood heir. It is also possible that, once she learns who he is, she might just name Gendry as her heir – reconciling with Robert Baratheon's former supporters. A hint at this might be how the real-life War of the Roses ended, which George R.R. Martin said the War of the Five Kings is loosely inspired by. This was a civil war in Medieval England between the Yorks and Lancasters - i.e. Starks and Lannisters, though the roles are reversed in the fictional story: the Lancasters are considered the “good” faction and the Yorks the \"bad\"/cunning faction. The War of the Roses began with the Lancasters being usurpsed by the Yorks (as the Lannisters usurp the Starks & Baratheons), only for the Yorks to ultimately be defeated – Henry Tudor, a bastard descendant of the Lancasters, eventually rallied the kingdom against Yorkist king Richard III and defeated him. Similarly, the Baratheons were seemingly wiped out, but left bastard descendant Gendry behind – perhaps to one day reclaim the throne.\n\nAs in the preceding episode, Daenerys and Tyrion heavily reference her intention to \"break the wheel\" of one tyrant replacing another on the Iron Throne, be it Targaryen, Baratheon, or Lannister. This is an invention of the TV series, possibly to present Daenerys as more of an overt hero and/or to appeal to modern audiences who typically view the desirable evolution of any society being toward some form of democracy, and doesn't happen in the novels. In the books, Daenerys sees the Iron Throne as her stolen birthright and wants to reclaim it for House Targaryen and be a good , benevolent monarch, but by the measure of their existing value system, not by radically re-inventing the system.\n\n, benevolent monarch, but by the measure of their existing value system, not by radically re-inventing the system. Tyrion Lannister recalls that, while not a particularly capable or brave physical warrior, he did lead a charge out the Mud Gate – which was during the Battle of the Blackwater.\n\nWinterfell\n\nIt is unclear why Arya Stark is behaving the way she does in her scenes with her sister Sansa Stark: she refuses to listen to any of her valid counter-arguments that she wrote the letter to Robb under duress. Arya then outright threatens to kill Sansa and take her face: after launching into a long and uncharacteristically dark threat against Sansa, Arya then simply hands her the Valyrian steel dagger she had been brandishing. If she's worried that Sansa will turn on Jon, threatening her will only exacerbate the problem. Fan speculation is rampant that this is all some elaborate ruse by one or both of the Stark sisters to trick Littlefinger, given that they know he has spies everywhere. Such speculation, however, occurred all too frequently in past seasons to try to explain what turned out to simply be plot holes, inconsistent writing, or simply misinterpretation by fans: i.e. all of the fan theories that Talisa Maegyr's behavior with Robb Stark seemed odd because she was really a Lannister spy. The TV writers later admitted that they rewrote the Robb Stark/Talisa relationship into a romance (which it isn't in the books) primarily for the out-of-universe reason that they wanted to show off Richard Madden (Robb) as an actor. Therefore it is equally possible that Arya is making unusually dark speeches threatening to kill Sansa in this episode, purely because the TV writers wanted to show off Maisie Williams, the actor, chewing the scenery in a dark speech scene.\n\nIt might not have been clear why Sansa sent Brienne of Tarth away from Winterfell, right after Littlefinger said she would try to prevent any strife between the Stark sisters. It's possible that Littlefinger wasn't urging that Brienne would prevent Arya from harming Sansa, but that Brienne would protect Arya from Sansa . Thus Sansa sent Brienne away (and burned the letter so no one will know about it) because this is the first step in moving against Arya, before Arya can turn the Northern lords against her. Another possibility is that Sansa was sincere in saying that it was unsafe for Brienne to be in Winterfell with Littlefinger, distrusting Littlefinger when he brought up Brienne and sending her away so that she doesn't serve as another one of his pawns. However, there is a good chance that this was the result Littlefinger hoped for, as it means that the Stark sisters are even more isolated than before. This is consistent with Petyr Baelish's personality. He manuevers people into doing what he wants by relying on lies and half-truths that are combined with vague wording. That allows Petyr to find loopholes if a scheme fails. He claims that the other person misinterpeted his words and phrases. This plan could easily have blown up in his face, however, if Arya had simply and sensibly told her sister what she had seen: that Baelish had asked the Maester to dig up the note. Sansa would surely see his scheming at once. And there is no way Baelish could know Arya well enough to predict she would not simply do that.\n\nfrom harming Sansa, but that Brienne would protect Arya . Thus Sansa sent Brienne away (and burned the letter so no one will know about it) because this is the first step in moving against Arya, before Arya can turn the Northern lords against her. Another possibility is that Sansa was sincere in saying that it was unsafe for Brienne to be in Winterfell with Littlefinger, distrusting Littlefinger when he brought up Brienne and sending her away so that she doesn't serve as another one of his pawns. However, there is a good chance that this was the result Littlefinger hoped for, as it means that the Stark sisters are even more isolated than before. Sansa says she fears the Northern lords would think her suspect for marrying into enemy Houses \"twice\" – even though her marriage to Tyrion Lannister in Season 3 was blatantly made under duress while she was literally a prisoner and hostage of the Lannisters in King's Landing. Meanwhile, her marriage to Ramsay Bolton was allegedly part of some bizarre scheme to \"undermine the Boltons from within\" – even though \"Marriage\" doesn't work like that in Westeros, the Lannisters certainly weren't worried about her \"undermining them from within\" when they forced her to marry Tyrion, and even Sansa – when she later confronted Littlefinger in Season 6's \"The Door\" – berated Littlefinger that his plot to marry her to Ramsay didn't really make sense (this doesn't happen in the novels, as the character who marries Ramsey is explicitly stated to be impersonating a Stark to give the Boltons legitimacy). Arya seemingly waves aside Sansa's accurate defense that she wrote the letter to Robb under duress, writing what Cersei told her to write, when she was a frightened 13 year old child told that this was the only way to save her father's life. In Season 1 (\"The Pointy End\"), Robb and Maester Luwin weren't even angry that Sansa wrote the letter, realizing simply from its contents that while it was in her handwriting she was obviously writing down Cersei's words, and was writing under duress as the Lannisters' prisoner. Many of the Northern lords would probably follow this logic as well. Sansa's concern seems to stem from how quickly the Northern lords rallied to and then abandoned Jon. It seems that she is afraid that tf the letter is made public, then at least some of the lords could accuse Sansa of being House Lannister puppet – not entirely a stretch given how disgruntled some of them are getting, and problematic even if Sansa isn't making a power grab for herself. Sansa's response to Petyr Baelish's analysis of the situation was that she considered his views without becoming emotional.\n\nin Westeros, the Lannisters certainly weren't worried about her \"undermining them from within\" when they forced her to marry Tyrion, and even Sansa – when she later confronted Littlefinger in Season 6's \"The Door\" – berated Littlefinger that his plot to marry her to Ramsay didn't really make sense (this doesn't happen in the novels, as the character who marries Ramsey is explicitly stated to be impersonating a Stark to give the Boltons legitimacy). It is somewhat strange that Arya does not mention how Sansa behaved when she and Joffrey encountered Arya and Mycah (\"The Kingsroad\"): all Sansa cared about was \"her beloved Joffrey\", as if he was the innocent victim rather than the bully, and did not care at all that he maliciously injured an innocent harmless kid, without provocation, and then nearly killed her sister; moreover, afterwards she lied brazenly about the incident. Arya has a good reason to resent Sansa for her awful behavior, and to bring it up among her other accusations against Sansa.\n\nIn the first novel, Sansa performed an act that perhaps could be considered as a betrayal against her house - of her own free will, without any coercion: her father told her he intended to send her and Arya back to Winterfell; Sansa could not bear the thought of being sent away from \"her beloved Joffrey\", so she told that to Cersei. In the second novel, Cersei claimed that Ned's plan was foiled thanks to Sansa's warning. Actually, that act had little to do with Ned's downfall, since he revealed to Cersei that he learned the truth about her children, and then put his trust in Littlefinger; that double stupidity resulted in Ned's imprisonment and subsequent death. Arya had no idea about Sansa's aforementioned act (which was omitted from the show anyway).\n\nArya reveals to Sansa for the first time that she was actually watching their father's execution, in Season 1's \"Baelor\", as she was hiding in the crowd in front of the Great Sept. It seems bizarre that Arya accuses Sansa of being there willingly given that Sansa broke into screaming when Joffrey declared he would kill Ned, and then outright fainted when he was beheaded. However, Arya – who wasn't even a teenager yet – didn't actually see Sansa faint: Yoren was holding her tight and she had already abandoned the vantage point that let her see above the crowd. When Sansa accused Arya of inaction when their father was condemned to death, Arya doesn't mention how she jumped down from the base of Baelor's statue and fought through the crowd, trying to get to her father, and was only restrained by Yoren who, at Ned Stark's bidding, rushed over to protect her, shield her eyes from his execution, and get her out of King's Landing.\n\nArya recalls their father Eddard Stark watching from the catwalk while the boys practiced archery in the courtyard, then she practiced when the boys left but had to try many times to hit the target. While this is similar to the Stark family's first scene in the Season 1 premiere \"Winter Is Coming\", it must be describing something that happened earlier: in that episode, Arya fired one arrow and hit the target, while her parents and the boys were still there. Arya says that Sansa didn't really watch the archery practice sessions because she was at the sewing circle with Septa Mordane, whom Joffrey executed along with the rest of Ned's household servants in King's Landing at the end of Season 1. In the Season 1 premiere, Arya snuck away from the sewing circle with Sansa and Mordane to watch the archery practice. In the novels, Arya actually isn't skilled at archery; in fact, she has not shot even one arrow in the novels. Fans have pointed out that her scene in Season 1 scoring a bull's eye on her target when Bran failed to contradicted this, as she isn't a preternaturally skilled archer with no training. This episode retroactively explains that she was simply practicing in secret for some time before that.\n\nOne of the faces Arya has created as magic Faceless Men shapeshifter masks is clearly the face of Walder Frey. It is unknown who the other faces are from.\n\nThe Inside the Episode video points out an additional reason for Sansa's shock when Arya starts speaking behind her, after she discovers her bag of faces: notice the camera clearly showed Sansa closing the only door into the room, but when the camera pulls back to reveal Arya, the door is still shut. Arya entered the room, and then closed the door behind her, so silently that Sansa didn't even notice despite only being a few feet away.\n\ndoor into the room, but when the camera pulls back to reveal Arya, the door is shut. Arya entered the room, and then closed the door behind her, so silently that Sansa didn't even notice despite only being a few feet away. Arya accuses Sansa that Lyanna Mormont is \"younger than you were\" when Cersei forced her to write the letter begging Robb to surrender, in exchange for their father's life. The passage of time between Seasons 6 and 7 is somewhat unclear, as is Lyanna Mormont's age. She was stated to be 10 years old in Season 5, but then described as 10 years old again in Season 6, even though other story elements seem to indicate that around a year passed between those seasons – it's possible that they were rounding, or that this was simply a dialogue error (repeating the line about her age without the TV writers taking the passage of time into account). Lyanna should have been 11 years old in Season 6, and at most 12 years old in Season 7 (assuming that one year passes each season, a pattern which generally held in prior seasons – but for all we know Season 7 might simply break with this and happen in a shorter timeframe). The matter is moot, however, because Sansa was stated in dialogue to be 13 years old in Season 1 – so whichever scenario, Lyanna is at most 12 years old now, and thus still \"younger\" than Sansa was.\n\nAlso regarding the passage of time, Sansa makes the only comment ever to address this in Season 7 itself, but only by vaguely saying that it has been \"weeks\" since Jon left Winterfell for Dragonstone. Given that months are composed of weeks, this could refer to anything from four weeks to four months – the TV writers may have been deliberately ambiguous about this.\n\nSansa says that they're asking \"20,000 men\" to fight for them. This doesn't seem to match prior numbers and is likely a hyperbolic remark or miscalculation on Sansa's part: earlier this season, Jon said there were fewer than 10,000 soldiers left in the North – though he was possibly referring to just the soldiers raised in the North itself, and not the large army from the Vale that came to Winterfell. Given that the Vale stayed neutral for most of the War of the Five Kings, until heading to Winterfell to help defeat the Boltons, it should have a full strength army in the range of 20-30,000 men (i.e. Robb could raise 20,000 men from the North in Season 1 when their armies were fresh, Tywin could raise even more in the south, etc.).\n\nArya suggests Sansa to play the game of faces - the game she used to play with the Waif (\"Unbowed, Unbent, Unbroken\").\n\nThe Wight Hunt - Jon's group heading north, and back\n\nThe Wight Hunt – the battle\n\nThe initial skirmish with a scouting party explicitly reveals that the White Walkers and their undead horde are a keystone army: if a White Walker dies, any wights that it has personally reanimated will drop dead, the White Walker's magic no longer animating them. Assuming this effect filters throughout all ranks of the army, it would mean that if the Night King were to be killed, all the White Walkers he turned, and all subsequent Wights, would be killed, effectively annihilating the entire horde of the undead with a single blow. This hasn't been revealed yet in the novels – if it is even true in the novels – and may in fact be a massive, TV-first revelation.\n\nThe showrunners stated in the Inside the Episode video for the preceding episode that the Wight Hunt is \"an idea we came up with\" – in a context that almost assuredly means it won't actually happen in the next novel, but is an invention of the TV series. Similarly, in the Inside the Episode video for this episode itself, producer D.B. Weiss remarks on how they came up with the idea that Jon's search party gets trapped in the middle of a frozen lake - that they had to come up with this idea, it isn't based on something Martin told them about what happens in the next novel.\n\nhad to come up with this idea, it isn't based on something Martin told them about what happens in the next novel. Similarly, the climaxes for Seasons 5 and 6 – \"Hardhome\" and \"Battle of the Bastards\" – are large action sequences heavily featuring Kit Harington, but which probably won't actually happen in the novels. \"Hardhome\" certainly won't happen: Jon doesn't go to Hardhome in the current novels, and while an expedition was sent there, it won't involve him and will apparently happen off-screen. There is no guarantee that Jon will actually fight Ramsay Bolton in a future novel (anymore than it seemed that Robb Stark would face off against Joffrey Baratheon, but then didn't). It is entirely possible that Stannis Baratheon will defeat the Boltons in his upcoming battle against him, and that Theon Greyjoy may execute Ramsay (or they might all die, no one knows for sure). In the Blu-ray commentary and behind the scenes videos for these first two battles, showrunners David Benioff and D.B. Weiss frequently remark that after the Battle of Castle Black, they were so impressed that actor Kit Harington can do his own stuntwork with swords that they wanted to show it off again, and remark on how impressed they are with how much emotion Harington can convey with his non-verbal facial reactions. Weiss even boasts in the behind the scenes video for \"Battle of the Bastards\" that \"It's got minimal dialogue in it!\". The battle scene, before Daenerys arrives, even uses a slow-motion shot to focus on Jon Snow, as Kit Harington reacts in wordless horror to the waves of wights overwhelming them. The showrunners have previously said in numerous videos that they avoid using slow motion whenever possible, feeling that it is a cheap trick, and have only sparingly used it a few times to convey extreme emotion during a battle (i.e. Jon focusing on Ygritte dying so much during the Battle of Castle Black that the camera slows down to shift to his perception, a slow-motion shot of Jaime watching men on fire flee Daenerys's dragon, which otherwise would happen too fast for the audience to experience as he does, etc.).\n\nThe entire battle scene, from when the wights start crossing the frozen lake to when Jon is saved by Benjen, lasts a full 9 minutes with no significant dialogue (other than shouts of \"Help!\", \"Fall back!\", etc.), instead focusing on the non-verbal reactions of the cast. After the battle begins, but before Daenerys arrives, consist of 5 full minutes of just Jon's party circled up and defending themselves from waves after wave of undead wights, with no dialogue – in contrast with the Massacre at Hardhome or Battle of the Bastards, which had more dialogue interspersed throughout, and incremental phases to each part of their battle sequences (i.e. at Hardhome, Jon tries to run into a building to retrieve dragonglass daggers, fails, then faces a White Walker, then new waves of wights appear).\n\nBenjen Stark dies for the last time, torn apart by wights, holding them off so his nephew Jon could escape on his horse. It is still unclear in the books what happened to Benjen, as he has not returned yet: the TV producers refer to him now as \"Coldhands Benjen\". In the books, \"Coldhands\" is a character who has similarly been reanimated but kept his own mind and free will due to the magic of the Children of the Forest, who helps Samwell Tarly and Bran Stark; he is definitely not a wight, since he can talk and his eyes are not glowing blue. There are three possibilities: either \"Coldhands\" really is Benjen, or perhaps Coldhands is a separate character setting up that Benjen will be reanimated in similar fashion, or this is just a pure invention of the TV series – it is currently unknown. When asked by his editor if Coldhands was Benjen, George R.R. Martin simply answered with a written message: \"NO\".\n\nThe wights' apparent aversion to water appears for the second time in this episode, the first being \"Hardhome\", where none of the Wights would chase Jon Snow or the Wildlings into the water. This is repeated again in this episode, when none of the Wights would initially chase the party into the lake after the ice cracks. In the novels, the Wights have no aversion to water: one of Cottor Pyke's letters to Jon Snow from the expedition to Hardhome states that there are \" dead things in the water .\" This episode, however, shows that water doesn't kill wights: when Tormund is swarmed by wights, two wights burst out of the frozen lake and try to drag Tormund under. One possibility that could simply be that wights can in fact operate in water, they simply cannot float or swim in it: when the dragons attack the wights and melt the ice, there is a shot that depicts dozens of wights sinking to the bottom of the lake. Furthermore, given the ending shot depicting the wights dragging Viserion's corpse out of the lake, it can be presumed some wights entered the water in order to attach the chains to the dragon's corpse.\n\n.\" This episode, however, shows that water doesn't kill wights: when Tormund is swarmed by wights, two wights burst of the frozen lake and try to drag Tormund under. One possibility that could simply be that wights can in fact operate in water, they simply cannot in it: when the dragons attack the wights and melt the ice, there is a shot that depicts dozens of wights sinking to the bottom of the lake. Furthermore, given the ending shot depicting the wights dragging Viserion's corpse out of the lake, it can be presumed wights entered the water in order to attach the chains to the dragon's corpse. This episode of course marks the first time that a dragon has died on-screen, Viserion the white dragon(Viserion isn't white on the show, instead golden in color). Dragons are nearly impervious to conventional weapons – but even in the backstory of the books, they have never been tested against Magic powers and weapons, like those of the White Walkers.\n\nIt is unclear why the Night King decided to throw an ice spear at Viserion, as opposed to Drogon, who was far closer and not airborne - and also evacuating the humans whose escape he was trying to prevent. It's possible he considered Viserion the more immediate threat because he was still actively attacking the White Walkers' army. He may also have considered that Drogon would have taken some time to take off anyway, making him still a potential target after killing Viserion, while Viserion and Rhaegal could have immediately left should Drogon had been killed first, being already in flight.\n\nThe weapons that the White Walkers wield, such as the ice-spear that the Night King uses to kill Viserion, are White Walker ice blades (they don't have a formal name). The books describe them as razor-thin shards of ice crystals, sharper than any human blade could ever be. George R.R. Martin has stated that they are made of \"ice\" - though only in the same sense that Valyrian steel is technically \"made out of iron\". Both are infused with spells that give them magical powers far beyond that: as Martin said, the White Walkers \"can do things with ice we can't imagine\".\n\nIn a subsequent interview, Emilia Clarke herself points out the irony that out of the three dragons, Viserion was the dragon who was killed and turned into a wight - given that he was named after Viserys, Daenerys's cruel brother who was brutally killed in Season 1 by Khal Drogo.\n\nGiven that the showrunners admitted that the Wight Hunt is an invention of the TV series, this introduces a massive and unresolved question: would the showrunners totally invent something on the scale of killing one of Daenerys's three dragons? Or, will Viserion be killed by the White Walkers in the novels, but in different circumstances? Or be killed by something else, or not at all? Such answers will, unfortunately, only be provided in the release of the next A Song of Ice and Fire novels.\n\nIn the books\n\n[This section will be updated with comparisons after the sixth novel is released.]\n\nSee: Differences between books and TV series - Season 7#Beyond the Wall\n\nMemorable quotes\n\nBeric Dondarrion: \"Death is the enemy. The first enemy and the last. The enemy always wins and we still need to fight him.\"\n\nGallery\n\nSee also\n\nReferences\n\n: \"You're scared, aren't you? What are you scared of?\"(upon realizing that Tormund Giantsbane is talking about Brienne of Tarth): Brienne of Tarth...you're with Brienne of fucking Tarth.", "images": ["https://vignette.wikia.nocookie.net/gameofthrones/images/c/ce/Jon%27s-Team-Beyond-the-Wall.jpg/revision/latest/scale-to-width-down/185?cb=20170818024435", "https://vignette.wikia.nocookie.net/gameofthrones/images/e/ec/706_Tyrion.jpg/revision/latest/scale-to-width-down/185?cb=20170815114443", "https://vignette.wikia.nocookie.net/gameofthrones/images/4/49/A_Game_of_Thrones_with_Danerys_at_Jon%27s_Bedside%2C_Episode_6_of_Season_7%2C_%27Beyond_the_Wall%27.jpg/revision/latest/scale-to-width-down/185?cb=20170823155744", "https://vignette.wikia.nocookie.net/gameofthrones/images/6/63/706_Jon_Snow_Beyond_the_Wall.jpg/revision/latest/scale-to-width-down/185?cb=20170815114128", "https://vignette.wikia.nocookie.net/gameofthrones/images/e/e9/706_Dragons_Army_of_the_Dead.jpg/revision/latest/scale-to-width-down/185?cb=20170821092527", "https://vignette.wikia.nocookie.net/gameofthrones/images/a/ac/706_Arya_Sansa.jpg/revision/latest/scale-to-width-down/185?cb=20170815113849", "https://slot1-images.wikia.nocookie.net/__cb1586975593232/common/extensions/wikia/WikiaBar/images/wikiabarIcon.png", "https://vignette.wikia.nocookie.net/gameofthrones/images/9/95/Tyrion-Daenerys-Beyond-the-Wall.jpg/revision/latest/scale-to-width-down/180?cb=20170816191828", "https://vignette.wikia.nocookie.net/gameofthrones/images/1/16/706_Tyrion_Daenerys_Exterior.jpg/revision/latest/scale-to-width-down/180?cb=20170821092740", "https://vignette.wikia.nocookie.net/gameofthrones/images/5/51/706_Beric_Jon.jpg/revision/latest/scale-to-width-down/185?cb=20170815113958", "https://vignette.wikia.nocookie.net/gameofthrones/images/0/05/706_Army_of_the_Dead_Chases_Wight_Hunt_Fellowship.jpg/revision/latest/scale-to-width-down/185?cb=20170815113804", "https://vignette.wikia.nocookie.net/gameofthrones/images/0/08/706_Tyrion_Daenerys.jpg/revision/latest/scale-to-width-down/185?cb=20170815114429", "https://vignette.wikia.nocookie.net/gameofthrones/images/2/23/706_Brienne_Sansa.jpg/revision/latest/scale-to-width-down/185?cb=20170821092505", "https://vignette.wikia.nocookie.net/gameofthrones/images/2/23/Jon-Snow-Beyond-the-Wall-sword.jpg/revision/latest/scale-to-width-down/185?cb=20170816192233", "https://vignette.wikia.nocookie.net/gameofthrones/images/5/52/706_Jorah.jpg/revision/latest/scale-to-width-down/185?cb=20170906200320", "https://vignette.wikia.nocookie.net/gameofthrones/images/c/ca/Beric-Jon-Beyond-the-Wall.jpg/revision/latest/scale-to-width-down/185?cb=20170816192003", "https://vignette.wikia.nocookie.net/gameofthrones/images/7/7c/WP_favicon.PNG/revision/latest?cb=20170327232925", "https://vignette.wikia.nocookie.net/gameofthrones/images/4/40/Imdb2.PNG/revision/latest?cb=20170327233010", "https://vignette.wikia.nocookie.net/gameofthrones/images/2/22/706_Winterfell.jpg/revision/latest/scale-to-width-down/185?cb=20170815114526", "https://vignette.wikia.nocookie.net/bourne/images/6/68/Treadstone_Banner_%281%29.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20191125210358", "https://vignette.wikia.nocookie.net/gameofthrones/images/9/98/Dragonstone-island.jpg/revision/latest/scale-to-width-down/150?cb=20150109173512", "https://vignette.wikia.nocookie.net/gameofthrones/images/2/27/706_Tormund_Beric_Sandor_Jon_Jorah_Gendry.jpg/revision/latest/scale-to-width-down/180?cb=20170821092659", "https://vignette.wikia.nocookie.net/gameofthrones/images/b/be/706_Sandor.jpg/revision/latest/scale-to-width-down/185?cb=20170815114325", "https://vignette.wikia.nocookie.net/gameofthrones/images/8/85/Sansa-Brienne-Beyond-the-Wall.jpg/revision/latest/scale-to-width-down/180?cb=20170816191629", "https://images.wikia.nocookie.net/__cb99/gameofthrones/images/8/89/Wiki-wordmark.png", "https://vignette.wikia.nocookie.net/gameofthrones/images/8/8a/706_Jon_Snow.jpg/revision/latest/scale-to-width-down/185?cb=20170815114150", "https://vignette.wikia.nocookie.net/gameofthrones/images/1/14/706_Jon_Jorah_Tormund.jpg/revision/latest/scale-to-width-down/185?cb=20170816192313", "https://vignette.wikia.nocookie.net/messaging/images/1/19/Avatar.jpg/revision/latest/scale-to-width-down/50", "https://vignette.wikia.nocookie.net/gameofthrones/images/8/84/706_The_Night_King.jpg/revision/latest/scale-to-width-down/185?cb=20170906200301", "https://vignette.wikia.nocookie.net/gameofthrones/images/4/4d/Tormund-Beyond-the-Wall.jpg/revision/latest/scale-to-width-down/185?cb=20170816191722", "https://vignette.wikia.nocookie.net/gameofthrones/images/7/70/706_Night_King_Viserion.jpg/revision/latest/scale-to-width-down/185?cb=20170821092616", "https://vignette.wikia.nocookie.net/gameofthrones/images/4/41/706_BTW.jpeg/revision/latest/scale-to-width-down/350?cb=20171210084036", "https://vignette.wikia.nocookie.net/gameofthrones/images/8/8e/Jon-Snow-Beyond-the-Wall.jpg/revision/latest/scale-to-width-down/185?cb=20170816191756", "https://vignette.wikia.nocookie.net/gameofthrones/images/4/41/706_BTW.jpeg/revision/latest?cb=20171210084036", "https://vignette.wikia.nocookie.net/gameofthrones/images/6/60/706_Army_of_the_Dead.jpg/revision/latest/scale-to-width-down/185?cb=20170815113828", "https://vignette.wikia.nocookie.net/gameofthrones/images/5/50/706_Episode_66.jpg/revision/latest/scale-to-width-down/180?cb=20170817101231", "https://vignette.wikia.nocookie.net/gameofthrones/images/9/90/706_Jon_Benjen.jpg/revision/latest/scale-to-width-down/180?cb=20170821092557", "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D", "https://vignette.wikia.nocookie.net/gameofthrones/images/f/fb/706_Wight_Hunt.jpg/revision/latest/scale-to-width-down/185?cb=20170815114503", "https://vignette.wikia.nocookie.net/gameofthrones/images/8/83/706_Arya.jpg/revision/latest/scale-to-width-down/185?cb=20170815113906", "https://vignette.wikia.nocookie.net/final-space/images/7/7e/Final-Space.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20200122100900", "https://vignette.wikia.nocookie.net/gameofthrones/images/a/a4/706_Sansa.jpg/revision/latest/scale-to-width-down/185?cb=20170815114341", "https://vignette.wikia.nocookie.net/gameofthrones/images/b/be/Sansa-Arya-Beyond-the-Wall.jpg/revision/latest/scale-to-width-down/180?cb=20170816191920", "https://vignette.wikia.nocookie.net/gameofthrones/images/a/a7/706_Jon_Jorah.jpg/revision/latest/scale-to-width-down/185?cb=20170815114109", "https://vignette.wikia.nocookie.net/gameofthrones/images/c/ce/A_Death_is_the_Enemy%2C_Episode_6%2C_Season_7%2C_Game_of_Thrones.jpg/revision/latest/scale-to-width-down/185?cb=20170816192249", "https://vignette.wikia.nocookie.net/gameofthrones/images/7/79/706_Sandor_Tormund.jpg/revision/latest/scale-to-width-down/185?cb=20170815114309", "https://vignette.wikia.nocookie.net/gameofthrones/images/e/e5/706_Daenerys.jpg/revision/latest/scale-to-width-down/185?cb=20170815114025", "https://vignette.wikia.nocookie.net/gameofthrones/images/0/0f/706_Tyrion_Daenerys_Interior.jpg/revision/latest/scale-to-width-down/185?cb=20170821092816", "https://vignette.wikia.nocookie.net/gameofthrones/images/f/f5/706_Army_of_the_Dead_Beyond_the_Wall.jpg/revision/latest/scale-to-width-down/180?cb=20170821092428", "https://vignette.wikia.nocookie.net/gameofthrones/images/9/96/Beyond-the-Wall-Jorah.jpg/revision/latest/scale-to-width-down/185?cb=20170816191850", "https://vignette.wikia.nocookie.net/gameofthrones/images/b/b1/Dany-Tyrion-Beyond-the-Wall.jpg/revision/latest/scale-to-width-down/185?cb=20170906200128", "https://vignette.wikia.nocookie.net/gameofthrones/images/e/e8/706_Beric_Gendry_Jon_Jorah_Sandor_Thoros_Tormund.jpg/revision/latest/scale-to-width-down/185?cb=20170815113937", "https://vignette.wikia.nocookie.net/wubbzy/images/7/7e/Me_and_My_Friends_-_128.png/revision/latest/zoom-crop/width/100/height/56?cb=20180423181936", "https://vignette.wikia.nocookie.net/gameofthrones/images/3/3f/706_Sandor_Thoros.jpg/revision/latest/scale-to-width-down/185?cb=20170815114223"], "top_img": "https://vignette.wikia.nocookie.net/gameofthrones/images/4/41/706_BTW.jpeg/revision/latest?cb=20171210084036", "keywords": [], "authors": [], "canonical_link": "https://gameofthrones.fandom.com/wiki/Beyond_the_Wall_(episode)", "title": "Beyond the Wall (episode)", "meta_data": {"viewport": "width=device-width, user-scalable=yes", "generator": "MediaWiki 1.19.24", "keywords": "Game of Thrones Wiki,gameofthrones,Beyond the Wall (episode),David Benioff,D.B. Weiss,Alan Taylor,Episode Guide,Eastwatch,The Dragon and the Wolf,Season 7,Game of Thrones (TV series),Jon Snow,Brotherhood Without Banners", "description": "&quot;Beyond the Wall&quot; is the sixth episode of the seventh season of Game of Thrones. It is the sixty-sixth episode of the series overall. It premiered on August 20, 2017. It was written by David Benioff&amp; D.B. Weiss and directed by Alan Taylor. Jon and the Brotherhood hunt the dead. Arya confronts...", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://gameofthrones.fandom.com/wiki/Beyond_the_Wall_(episode)", "title": "Beyond the Wall (episode) | Game of Thrones Wiki | Fandom", "description": "\"Beyond the Wall\" is the sixth episode of the seventh season of Game of Thrones. It is the sixty-sixth episode of the series overall. It premiered on August 20, 2017. It was written by David..."}, "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "Game of Thrones Wiki", "title": "Beyond the Wall (episode)", "description": "\"Beyond the Wall\" is the sixth episode of the seventh season of Game of Thrones. It is the sixty-sixth episode of the series overall. It premiered on August 20, 2017. It was written by David Benioff& D.B. Weiss and directed by Alan Taylor. Jon and the Brotherhood hunt the dead. Arya confronts Sansa. Tyrion thinks about the future.", "url": "https://gameofthrones.fandom.com/wiki/Beyond_the_Wall_(episode)", "image": "https://vignette.wikia.nocookie.net/gameofthrones/images/4/41/706_BTW.jpeg/revision/latest?cb=20171210084036"}, "apple-itunes-app": "app-id=920825172, app-arguments=https://gameofthrones.fandom.com/wiki/Beyond_the_Wall_(episode)"}, "movies": [], "publish_date": null, "source": "https://gameofthrones.fandom.com", "summary": ""}