{"url": "https://www.indiewire.com/2018/03/rupauls-drag-race-all-stars-rigged-finale-1201940220/", "text": "It was a shocking ending to an uneven season that left fans utterly gagged, and pulled back the curtain on the facade of reality show realness.\n\nIt’s the greatest upset in “Drag Race” herstory, but producers’ tricks are starting to wear thin on a dedicated fanbase who have been jerked around one too many times. On Thursday night’s season finale of “RuPaul’s Drag Race All Stars” Season 3, the clear frontrunner — one Miss Shangela “Hallelu” Laquifa Wadley — was shut out from even competing in the final lip sync. Perhaps the most chilling part of the whole kerfuffle is that the decision was made by her fellow queens. (The episode’s title: “A Jury of Their Queers”).\n\nEven more shocking was the final vote breakdown, posted to Twitter after the episode (using a weighted voting system that could give the Oscars a run for its money) which Ru-vealed that only one queen voted for Shangela. (Thorgy Thor, you are redeemed.) Instead of an epic three-season long redemption arc for Shangela, whose growth and tenacity is as fitting a metaphor for “Drag Race” as any, we got a lethargic lip-sync that ended with the crowning of the season’s third best queen.\n\nPopular on IndieWire\n\nHeading into Thursday’s finale, Shangela’s biggest competition, BenDeLaCreme, had already eliminated herself in the season’s first wig-snatching twist. This seemed to lock in the crown for Shangela, whose scene-stealing performances had landed her consistently in the top two throughout the competition. Alas, it was not meant to be, and comedy queen Trixie Mattel took her place in the “All Stars” hall of fame after beating out Kennedy Davenport in the final lip-sync.\n\nThe threads began to unravel with Ben’s self-elimination, a pseudo-noble act that reeked ever so slightly of self-importance. In the same episode, the winner had to eliminate someone and bring back one of the eliminated queens. Ben chose to bring back Morgan McMichaels, who had bombarded her with questions about why she was eliminated first, rather than Aja, who clearly performed best in the episode. In her concluding interview, Ben said: “I think the actual title is more important to them than it is to me.” Translation: You all know I was going to win, and my career will be fine.\n\nVH1\n\nSuddenly, the goal post had shifted. Ben seemed to think “All Stars” is simply about giving more exposure to performers who need a career boost, and there is no doubt that “Drag Race” has spawned a community of internationally recognized drag queens. Appearing on just one episode can boost someone’s profile significantly enough that she can work as a drag queen full time for many years to come. That’s great for the contestants, but viewers watch the show for the competition, and they expect some semblance of fairness — or they might just revolt.\n\nThere are many factors that could have contributed to the season’s disappointing ending: the eliminated queens were either envious of Shangela or friends with Trixie, the convoluted twists producers concocted to add drama ended up sabotaging the outcome, or the show’s recent move from Logo to VH1 invited an audience that doesn’t remember Shangela from earlier seasons and does know Trixie from her Viceland series, “The Trixie and Katya Show.” If the latter is true, it could also be the case that the expanded VH1 audience is younger, whiter, and straighter than ever before.\n\nThis is not the first time a white queen has won over a better or equally talented black queen. Though not quite as cut and dry, Trixie’s win over Shangela harkens to Sasha Velour’s win over Shea Couleé in Season 9. Though “Drag Race” winners have been a fairly mixed bag over the years, the “All Stars” hall of fame now features three white winners. It’s an unsettling statistic because, in contrast to regular “Drag Race,” “All Stars” is more dependent on fan and contestant voting than RuPaul’s final decisions.\n\nNo one is under the illusion that reality shows are completely fair all of the time, though reality competition shows are subject to the usual federal regulations due to the money at stake. But while viewers understand that the behind-the-scenes narrative is manipulated to create drama or keep a villain on, the final win should feel fair. Some might say it’s much ado about a reality show. But “Drag Race” is the most successful and long-running LGBTQ show on television, one that has grown from a micro-budget cult favorite to an Emmy-winning superstar-maker. “Drag Race” needs to remember where it came from, and who’s been there since the beginning.\n\nAnd let us say: Hallelu.\n\nSign Up: Stay on top of the latest breaking film and TV news! Sign up for our Email Newsletters here.", "images": ["https://www.indiewire.com/wp-content/uploads/2018/03/screen-shot-2018-03-16-at-12-15-52-pm.png?w=735", "https://pmcvariety.files.wordpress.com/2020/04/taylorswift_01-e1587277738854.png?resize=230%2C135&w=300", "https://www.indiewire.com/wp-content/uploads/2018/03/screen-shot-2018-03-16-at-12-15-52-pm.png", "https://www.indiewire.com/wp-content/themes/indiewire/sprites/logo/Logo_IndieWire.png", "https://i0.wp.com/www.goldderby.com/wp-content/uploads/2017/11/top-chef-season-15-contestants-hosts-Tom-Colicchio.jpg?resize=230%2C135&ssl=1&w=300", "https://www.indiewire.com/wp-content/themes/indiewire/images/indiewire-color.png", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY", "https://pmcdeadline2.files.wordpress.com/2020/04/taylor-swift-performs-at-global-citizens-concert.png?resize=230%2C135&w=300", "https://i1.wp.com/www.rollingstone.com/wp-content/uploads/2020/04/office-chairs.jpg?resize=230%2C135&ssl=1&w=300", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.indiewire.com&path=%2F2018%2F03%2Frupauls-drag-race-all-stars-rigged-finale-1201940220%2F&ct=article&lob=indiewire&loc=us&env=desktop&post_id=1201940220&comment_count=21", "http://www.indiewire.com/wp-content/uploads/2018/03/screen-shot-2018-03-16-at-12-15-13-pm.png?w=780"], "top_img": "https://www.indiewire.com/wp-content/uploads/2018/03/screen-shot-2018-03-16-at-12-15-52-pm.png", "keywords": [], "authors": ["Jude Dry"], "canonical_link": "https://www.indiewire.com/2018/03/rupauls-drag-race-all-stars-rigged-finale-1201940220/", "title": "‘RuPaul’s Drag Race All Stars’ Controversial Season Finale: Is the Show Rigged?", "meta_data": {"fb": {"pages": 9800035481}, "msvalidate.01": "87B78205BB25666E656DA3EB49F3FD42", "viewport": "width=device-width, initial-scale=1", "st": {"robots": "follow, index"}, "description": "Trixie Mattel took the crown, but a Shangela win would have completed a three-season redemption arc that mirrors the show's own ascension.", "news_keywords": "RuPaul, RuPaul's Drag Race, RuPaul's Drag Race All Stars", "apple-itunes-app": "app-id=1400654071", "generator": "WordPress 5.4", "author": "Jude Dry", "content_type": "Article", "post_id": 1201940220, "title": "'RuPaul's Drag Race All Stars' Controversial Season Finale: Is the Show Rigged?", "published_at": "2018-03-16 13:00:44", "image": "https://www.indiewire.com/wp-content/uploads/2018/03/screen-shot-2018-03-16-at-12-15-52-pm.png?w=300", "comment_count": 21, "tags": "RuPaul's Drag Race All Stars", "topics": "Television", "body": "It's the greatest upset in \"Drag Race\" herstory, but producers' tricks are starting to wear thin on a dedicated fanbase who have been jerked around one too many times. On Thursday night's season finale of \"RuPaul's Drag Race All Stars\" Season 3, the clear frontrunner — one Miss Shangela \"Hallelu\" Laquifa Wadley — was shut out from even competing in the final lip sync. Perhaps the most chilling part of the whole kerfuffle is that the decision was made by her fellow queens. (The episode's title: \"A Jury of Their Queers\").\r\n\r\nEven more shocking was the final vote breakdown, posted to Twitter after the episode (using a weighted voting system that could give the Oscars a run for its money) which Ru-vealed that only one queen voted for Shangela. (Thorgy Thor, you are redeemed.) Instead of an epic three-season long redemption arc for Shangela, whose growth and tenacity is as fitting a metaphor for \"Drag Race\" as any, we got a lethargic lip-sync that ended with the crowning of the season's third best queen.\r\n\r\n\r\n\r\nHeading into Thursday's finale, Shangela's biggest competition, BenDeLaCreme, had already eliminated herself in the season's first wig-snatching twist. This seemed to lock in the crown for Shangela, whose scene-stealing performances had landed her consistently in the top two throughout the competition. Alas, it was not meant to be, and comedy queen Trixie Mattel took her place in the \"All Stars\" hall of fame after beating out Kennedy Davenport in the final lip-sync.\r\n\r\nThe threads began to unravel with Ben's self-elimination, a pseudo-noble act that reeked ever so slightly of self-importance. In the same episode, the winner had to eliminate someone and bring back one of the eliminated queens. Ben chose to bring back Morgan McMichaels, who had bombarded her with questions about why she was eliminated first, rather than Aja, who clearly performed best in the episode. In her concluding interview, Ben said: \"I think the actual title is more important to them than it is to me.” Translation: You all know I was going to win, and my career will be fine.\r\n\r\n\r\n\r\nSuddenly, the goal post had shifted. Ben seemed to think \"All Stars\" is simply about giving more exposure to performers who need a career boost, and there is no doubt that \"Drag Race\" has spawned a community of internationally recognized drag queens. Appearing on just one episode can boost someone's profile significantly enough that she can work as a drag queen full time for many years to come. That's great for the contestants, but viewers watch the show for the competition, and they expect some semblance of fairness — or they might just revolt.\r\n\r\n\r\n\r\nThere are many factors that could have contributed to the season's disappointing ending: the eliminated queens were either envious of Shangela or friends with Trixie, the convoluted twists producers concocted to add drama ended up sabotaging the outcome, or the show's recent move from Logo to VH1 invited an audience that doesn't remember Shangela from earlier seasons and does know Trixie from her Viceland series, \"The Trixie and Katya Show.\" If the latter is true, it could also be the case that the expanded VH1 audience is younger, whiter, and straighter than ever before.\r\n\r\nThis is not the first time a white queen has won over a better or equally talented black queen. Though not quite as cut and dry, Trixie's win over Shangela harkens to Sasha Velour's win over Shea Couleé in Season 9. Though \"Drag Race\" winners have been a fairly mixed bag over the years, the \"All Stars\" hall of fame now features three white winners. It's an unsettling statistic because, in contrast to regular \"Drag Race,\" \"All Stars\" is more dependent on fan and contestant voting than RuPaul's final decisions.\r\n\r\nNo one is under the illusion that reality shows are completely fair all of the time, though reality competition shows are subject to the usual federal regulations due to the money at stake. But while viewers understand that the behind-the-scenes narrative is manipulated to create drama or keep a villain on, the final win should feel fair. Some might say it's much ado about a reality show. But \"Drag Race\" is the most successful and long-running LGBTQ show on television, one that has grown from a micro-budget cult favorite to an Emmy-winning superstar-maker. \"Drag Race\" needs to remember where it came from, and who's been there since the beginning.\r\n\r\nAnd let us say: Hallelu.", "onesignal": "wordpress-plugin", "og": {"site_name": "IndieWire", "type": "article", "locale": "en_US", "url": "https://www.indiewire.com/2018/03/rupauls-drag-race-all-stars-rigged-finale-1201940220/", "title": "‘RuPaul’s Drag Race All Stars’ Controversial Season Finale: Is the Show Rigged?", "description": "It was a shocking ending to an uneven season that left fans utterly gagged, and pulled back the curtain on the facade of reality show realness.", "image": {"identifier": "https://www.indiewire.com/wp-content/uploads/2018/03/screen-shot-2018-03-16-at-12-15-52-pm.png", "width": 735, "height": 463}}, "article": {"published_time": "2018-03-16T17:00:44+00:00", "modified_time": "2018-03-20T13:07:05+00:00", "author": "https://www.indiewire.com/author/judithdry/", "section": "Television", "tag": "RuPaul's Drag Race All Stars"}, "fragment": "!", "msapplication-TileImage": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=270"}, "movies": [], "publish_date": 1521219644.0, "source": "https://www.indiewire.com", "summary": ""}