{"url": "https://www.newyorker.com/culture/annals-of-gastronomy/you-cant-have-breakfast-at-tiffanys", "text": "Last week, the newly renovated home-goods floor of the Tiffany & Co. flagship, on Fifth Avenue, was opened to the public. Reimagined by the company’s recently appointed chief creative officer, Reed Krakoff, late of Coach, it now features, in addition to several rooms of glass cases displaying wares, a café—every surface of which is done in the brand’s signature shade of turquoise. The headlines have all been almost exactly the same: “Finally, You Can Have Breakfast at Tiffany.” “Here’s What Having Breakfast at Tiffany’s Really Looks Like.” “You Can Literally Have Breakfast at Tiffany’s.” “I Tried to Have Breakfast at Tiffany’s.” They refer, of course, to the opening scene of “Breakfast at Tiffany’s,” the iconic 1961 film adaptation of Truman Capote’s 1958 novella, in which Audrey Hepburn arrives at this very store, the block empty of all other people, at what’s meant to be the crack of dawn after a long night of revelry. Wearing a black ball gown with matching gloves, an elaborate updo, oversized sunglasses, and several lush strands of pearls, she gets out of a cab, carrying a small white paper bag, and walks up to one of the windows displaying jewelry. Barely taking her eyes off the diamonds, she opens the bag and removes a cup of coffee and a pastry, which she bites into, her skeletal jaw working hard as the strings swell on “Moon River,” the movie’s theme song, which was written for Hepburn.\n\nThough her character, Holly Golightly—opaquely drawn as a high-end call girl—is something of a down-on-her-luck striver, an outsider looking in and up, the scene is not about longing or aspiration so much as it is about ritual and the search for simple, almost pastoral pleasures in a dense and hectic city. The street is hers alone; the coffee and pastry are hers alone; the window displays, even, are hers alone. Explaining the store’s draw, later in the film (and, almost word for word, in Capote’s novella), she says that, when she’s feeling awful, “The only thing that does any good is to jump in a cab and go to Tiffany’s. Calms me down right away. The quietness and the proud look of it. Nothing very bad could happen to you there.”\n\nTimes have changed, to say the least. Tiffany & Co. now shares a block and a wall with Trump Tower, a place where very bad things seem likely to have happened, a place where you may have recently stood in the middle of a surging mass of people chanting “Shame! Shame! Shame!” during a political protest. Approaching the store requires maneuvering, at any hour, around large, ugly plastic barriers, and, for a certain kind of person, thinking about the state of the nation. Nonetheless, on Tuesday morning, I, too, tried to have breakfast at Tiffany’s. The first-come-first-serve café opened last Friday, at 10 A.M., and I’d read that people had waited in line for two hours—which seems insane by most standards but not, sadly, by those of New York restaurant-going, and I’d cleared my morning. Standing on the opposite side of the street, waiting to cross, just after ten, I squinted and looked for a line, outside of either the Fifth Avenue entrance or the Fifty-seventh Street one, but I saw no one. Feeling triumphant—the buzz must have died down quickly, I thought—I marched toward the revolving doors and asked a bright-eyed young uniformed attendant how to get to the café. Bubble, burst: it’s on the fourth floor, he graciously informed me—but entirely booked for most of the day, on account of people showing up at 7 A.M. to start waiting. He suggested returning around three-thirty. “But you’re welcome to head up there to get more information!” he added.\n\nUpstairs, at the host stand, the prognosis was even worse. Two men of incredible poise, both in suits and one with a posh British accent, told me calmly what they must have told dozens of hopefuls before me: in fact, people had begun to line up at midnight, and coming back at three-thirty was a long shot, but I could try again tomorrow. About a dozen sad-looking young women in black tights and wool jackets stood listlessly against the railing that led to the stairs, peering into the dining room, where other young women were taking DSLR and iPhone photos of “Tiffany Tea,” an assortment of finger sandwiches and sweets that arrive on a tiered stand. I asked to see a menu. Breakfast, at Tiffany, is a prix fixe (for twenty-nine dollars) that includes coffee or tea; a croissant with Nutella and honey butter; seasonal fruit; and your choice of a selection of entrées ranging from truffled eggs with bacon to buttermilk waffles to, of course, avocado toast. “Good morning, welcome, congratulations, you made it!” I heard a chipper server say as he showed a group of four to their table. “We love your passion.”\n\nI wasn’t going to have breakfast at Tiffany’s. Instead, I wandered around the home-goods floor, just as Krakoff intended, gazing at artfully arranged crystal decanters and candlesticks. In another scene in the movie, Hepburn brings her love interest—a writer, similarly striving, played by George Peppard—to Tiffany, during business hours. He wants to buy her something; she acquiesces, but only if it costs less than ten dollars, she insists. There’s one item, offers a kindly sales associate: a sterling-silver telephone dialer for $6.75, including tax. “Well, the price is right,” Peppard says. “But, uh, I must say, I was hoping for something slightly more . . . how shall I say it . . . romantic in feeling.” In the end, they decide to have something engraved: a ring from a box of Cracker Jack.\n\nI imagine they no longer carry a telephone dialer, but Krakoff has more than one-upped it with his new line of “Everyday Objects”: a sterling-silver “tin” can, for a thousand dollars; a sterling-silver ball of yarn, for nine thousand; a pair of coffee cups that look like they’re made of paper but are in fact bone china, and cost ninety-five dollars. Looking around to make sure no one was watching, I tapped a lemon beside a white-and-turquoise teapot to make sure it wasn’t real. A bunch of plastic bananas taunted me from the saddle bag of a turquoise bike. A faux tomato sat beside a sterling-silver plate etched with the image of a sandwich. A handful of dog biscuits were scattered around an engraved water dish—those were real. I thought about how Kate Moss once said, “Nothing tastes as good as skinny feels.” And then I rode the elevator back down to the ground floor and crossed Fifth Avenue, in search of a pastry and a cup of coffee.", "images": ["https://www.newyorker.com/verso/static/the-new-yorker/assets/logo-header.6e34c81346bc43475ffd572e6c2eb3e125927148.svg", "https://media.newyorker.com/photos/59dfd427424ebf661a102cbb/4:3/w_480%2Cc_limit/Goldfield-Top-Secret-New-York-Bar.jpg", "https://www.newyorker.com/verso/static/the-new-yorker/assets/logo.f1893bac6dafe13d6d5bad671a5bee2345efa44d.svg", "https://media.newyorker.com/photos/5a0de86432e52953cc4d2a9e/master/w_2560%2Cc_limit/Goldfield-You-Cant-Have-Breakfast-at-Tiffanys.jpg", "https://media.newyorker.com/photos/59097b77019dfc3494ea36d9/1:1/w_270%2Cc_limit/goldfield-hannah.png", "https://media.newyorker.com/photos/597fa5d4e5c0b025c201f5cd/4:3/w_480%2Cc_limit/Goldfield_Farewell-to-Frannys.jpg", "https://media.newyorker.com/photos/590968a1019dfc3494ea1039/4:3/w_480%2Cc_limit/Goldfield-Umami.jpg", "https://media.newyorker.com/photos/5a0de86432e52953cc4d2a9e/16:9/w_1280,c_limit/Goldfield-You-Cant-Have-Breakfast-at-Tiffanys.jpg", "https://www.newyorker.com/verso/static/the-new-yorker/assets/logo-reverse.f915b516b6ca9c0c2a9bdf9b749519365b2b2e4a.svg", "https://media.newyorker.com/photos/5a04aaa03c28d150d0b8d8aa/4:3/w_480%2Cc_limit/Goldfield-Lessons-from-the-Worst-Food-Hack-of-2017.jpg"], "top_img": "https://media.newyorker.com/photos/5a0de86432e52953cc4d2a9e/16:9/w_1280,c_limit/Goldfield-You-Cant-Have-Breakfast-at-Tiffanys.jpg", "keywords": [], "authors": ["Hannah Goldfield", "Hannah Goldfiel"], "canonical_link": "https://www.newyorker.com/culture/annals-of-gastronomy/you-cant-have-breakfast-at-tiffanys", "title": "You Can’t Have Breakfast at Tiffany’s", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Hannah Goldfield", "copyright": "Copyright (c) Condé Nast 2020", "description": "Hannah Goldfield on a new café at Tiffany & Co., which has inspired many references to the Audrey Hepburn film “Breakfast at Tiffany’s.”", "id": "5a0dd800ce93fc4120fd2b17", "keywords": "annals of gastronomy,breakfast at tiffany's,restaurants", "news_keywords": "annals of gastronomy,breakfast at tiffany's,restaurants", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5a0dd800ce93fc4120fd2b17", "parsely-metadata": "{\"description\":\"Hannah Goldfield on a new café at Tiffany & Co., which has inspired many references to the Audrey Hepburn film “Breakfast at Tiffany’s.”\",\"image-16-9\":\"https://media.newyorker.com/photos/5a0de86432e52953cc4d2a9e/16:9/w_1000,c_limit/Goldfield-You-Cant-Have-Breakfast-at-Tiffanys.jpg\",\"image-1-1\":\"https://media.newyorker.com/photos/5a0de86432e52953cc4d2a9e/1:1/w_1000,c_limit/Goldfield-You-Cant-Have-Breakfast-at-Tiffanys.jpg\"}", "og": {"description": "Before you can eat at the new café at Tiffany & Co., you have to navigate the barriers outside Trump Tower and wait in line for several hours.", "image": "https://media.newyorker.com/photos/5a0de86432e52953cc4d2a9e/16:9/w_1280,c_limit/Goldfield-You-Cant-Have-Breakfast-at-Tiffanys.jpg", "site_name": "The New Yorker", "title": "You Can’t Have Breakfast at Tiffany’s", "type": "article", "url": "https://www.newyorker.com/culture/annals-of-gastronomy/you-cant-have-breakfast-at-tiffanys"}, "article": {"content_tier": "metered", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@NewYorker", "description": "Before you can eat at the new café at Tiffany & Co., you have to navigate the barriers outside Trump Tower and wait in line for several hours.", "domain": "https://www.newyorker.com", "image": {"src": "https://media.newyorker.com/photos/5a0de86432e52953cc4d2a9e/16:9/w_1280,c_limit/Goldfield-You-Cant-Have-Breakfast-at-Tiffanys.jpg?mbid=social_retweet"}, "site": "@NewYorker", "title": "You Can’t Have Breakfast at Tiffany’s"}, "fb": {"app_id": 1147169538698836, "pages": 9258148868}, "google-signin-client_id": "275906274807-b4eqbdqr511u9msdpj8mh0pf77fcciv7.apps.googleusercontent.com"}, "movies": [], "publish_date": null, "source": "https://www.newyorker.com", "summary": ""}