{"url": "https://www.romper.com/p/jessie-james-deckers-pregnancy-cravings-are-all-over-the-map-with-baby-no-3-2907928", "text": "Pregnancy cravings are serious business. They will wake you up in the middle of the night, can be horridly inconvenient, and can sometimes feel impossible to actually satisfy. So, basically they're great for getting you ready for parenthood. As a soon-to-be-mom of three, singer and reality star Jessie James Decker's pregnancy cravings probably don't come as much of a surprise to her at this point. But the girl will most likely be a slave to them nonetheless.\n\nDuring a recent interview with E! News, the Eric & Jessie star opened up about her third pregnancy. While she admitted that she and husband, New York Jets wide receiver Eric Decker already know the sex of baby number three (they are already proud parents to 3-year-old daughter Vivienne and 2-year-old son Eric Jr.), she's not quite ready to share the news with the public. But Decker was willing to open up about a few things, including the fact that she already has a name picked out for the baby, even though she's just four months pregnant.\n\nApparently it's a long standing tradition in the family to be well prepared in the name department, as she told E! News:\n\nWe knew all of our children's names long before. We've always had the same names picked out for the last four years. He and I are kinda like that. We just, we had a mental plan of what to do with the children's names whether it was a girl or a boy.\n\nAs for cravings? Decker said that her cravings have \"changed every pregnancy, so this one's even been different.\"\n\nThat being said, she has had one \"consistent\" craving throughout all of her pregnancies, and Decker believes it's one most women share: \"Citrus. You just want oranges. Your want the citrus because your body is needing it and craving it,\" as she told E! News.\n\nShe and her little ones reportedly snack on \"little cuties\" together, and that's just about the most wholesome pregnancy craving ever.\n\nWhile Decker also told E! News that she hasn't really been craving junk food... it seems her Instagram feed might be telling us a different story.\n\nShe captioned a photo of a super delicious looking chocolate cake on Wednesday on Instagram, \"Pregnancy got me like....even worse? I took what I didn't eat to the hotel with me for snacks later.\"\n\nDecker was apparently in New York City the next day, because on Thursday she shared a picture of herself digging into a big old slice of pizza with the caption, \"When in NYC you gotta get a slice.\"\n\nI don't see any oranges... curious.\n\nWhatever Decker's pregnancy cravings might be (all moms know the whims of their hunger change by the minute, of course), the busy mom is still trying to make time for everyone in the household, including her husband of four years. She told Us Weekly recently that the couple schedule nights together for a little grown-up cuddle time to reconnect.\n\nWe plan these nights. I’ll send him a message and be like, \"Babe, it’s on tonight!\" Life gets really crazy with kids and schedules are hard, but couples need to be intimate. You have to find that time to connect with your partner.\n\nSpeaking of finding intimate time with her partner, Decker was very clear with E! News when the question of a possible fourth child came up during the interview.\n\nHonestly it's just not a question. I don't want more than three. There's nothing wrong with people that have four or five kids, it's just not for us. The fact that we were teeter-tottering on two, I felt like three was probably in the cards. I needed a break. Luckily Bub is two years old, I've had a few year break from being pregnant and so now it's a good time. But there will definitely not be a fourth. We're good.\n\nBesides, who knows what sort of cravings she might have if she gets pregnant a fourth time, right?\n\nWatch Romper's new video series, Romper's Doula Diaries:\n\nCheck out the entire Romper's Doula Diaries series and other videos on Facebook and the Bustle app across Apple TV, Roku, and Amazon Fire TV.", "images": ["https://imgix.bustle.com/uploads/image/2020/4/17/90319dbf-c660-4a15-a5c5-5e2da420d777-1.png?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2017/10/12/1389ecaa-4a9e-4309-94af-0313275ed3dc-getty-538921454.jpg?w=960&h=540&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/17/3884b83b-85bd-462c-a876-7c474ac699fb-getty-1181303875.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2017/10/12/1389ecaa-4a9e-4309-94af-0313275ed3dc-getty-538921454.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=932972280084675&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/13/e02ce777-a439-4316-86e7-0c29c7f878d2-getty-1211094184.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2017/10/12/1389ecaa-4a9e-4309-94af-0313275ed3dc-getty-538921454.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.romper.com/p/jessie-james-deckers-pregnancy-cravings-are-all-over-the-map-with-baby-no-3-2907928", "title": "Jessie James Decker's Pregnancy Cravings Are All Over The Map With Baby No. 3", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@romper", "card": "summary_large_image"}, "og": {"site_name": "Romper", "url": "https://www.romper.com/p/jessie-james-deckers-pregnancy-cravings-are-all-over-the-map-with-baby-no-3-2907928", "type": "article", "title": "Jessie James Decker's Pregnancy Cravings Are All Over The Map With Baby No. 3", "description": "Pregnancy cravings are serious business. They will wake you up in the middle of the night, can be horridly inconvenient, and can sometimes feel impossible to actually satisfy. So, basically they're great for getting you ready for parenthood. As a…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2017/10/12/1389ecaa-4a9e-4309-94af-0313275ed3dc-getty-538921454.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 510210782483125}, "description": "Pregnancy cravings are serious business. They will wake you up in the middle of the night, can be horridly inconvenient, and can sometimes feel impossible to actually satisfy. So, basically they're great for getting you ready for parenthood. As a…"}, "movies": [], "publish_date": null, "source": "https://www.romper.com", "summary": ""}