{"url": "https://en.wikipedia.org/wiki/Chloe_Kim", "text": "Korean snowboarder\n\nChloe Kim (born April 23, 2000) is an American snowboarder. At the 2018 Winter Olympics, she became the youngest woman to win an Olympic snowboarding gold medal when she won gold in the women's snowboard halfpipe at 17 years old.[2] She is a four-time X Games gold medalist and the first woman to win two gold medals in snowboarding at the Winter Youth Olympic Games.[3][4] She is the current World, Olympic, Youth Olympic, and X Games champion in the halfpipe, and the first to win the title at all four major events.\n\nEarly life [ edit ]\n\nKim was born in Long Beach, California and raised in nearby Torrance.[5] Her parents are from South Korea. Kim's father quit his job to drive her to the mountains and also to be able to travel with her when she competes. He started her on a snowboard at age four at the southern California resort of Mountain High; she started competing at age six as a member of Team Mountain High.[6] She trained in Geneva, Switzerland[7] from ages eight to ten before returning to California and training at Mammoth Mountain. Kim joined the U.S. Snowboarding Team in 2013.[8]\n\nCareer [ edit ]\n\nX Games [ edit ]\n\nWhile too young to compete in the 2014 Sochi Winter Olympics, Kim earned a silver medal in superpipe in the 2014 Winter X Games behind Kelly Clark. In 2015, Chloe won Gold in the superpipe at the Winter X Games, besting Clark.[9] With this win, at age 14, Kim became the youngest gold medalist until she lost the record to Kelly Sildaru, who won gold in 2016 at the age of 13.[10][11] In the 2016 X Games, she became the first person under the age of 16 to win two gold medals (and thus the first person to win back-to-back gold medals) at an X Games.[12][13] At that year's U.S. Snowboarding Grand Prix, she became the first woman to land back-to-back 1080 spins in a snowboarding competition.[13][5] She scored a perfect 100 points, and is believed to be the second rider ever to do so, after Shaun White.[14]\n\n2016 Winter Youth Olympics [ edit ]\n\nIn 2016, Kim became the first American woman to win a gold medal in snowboarding at the Winter Youth Olympic Games, and earned the highest snowboarding score in Youth Olympic Games history at the time.[4] She was selected as Team USA's flag bearer for the Opening Ceremony of the 2016 Winter Youth Olympic Games, becoming the first snowboarder chosen to serve as flag bearer for Team USA at either the Olympic Winter Games or Youth Olympic Games.[15] Kim was nominated for the 2016 ESPYS award for Best Breakthrough Athlete.[16]\n\n2018 Winter Olympics [ edit ]\n\nAt Kim’s first Winter Olympics in Pyeongchang, South Korea, she won the gold medal in the Women's Halfpipe finals with Ricky Bower as her coach.[17] Her first score was 93.75 points, 8.5 points ahead of second place. Her last score in the halfpipe was close to a perfect score at 98.25 points. She was nearly 10 points ahead of Liu Jiayu, who placed 2nd.[18] Kim became the youngest woman to ever land two 1080-degree spins in a row at the Olympics.[19] At age 17 she became the youngest woman to ever win gold at the Olympics in the halfpipe, surpassing the past record holder, Kelly Clark, who was 18.[20] This record landed her a position on Time magazine's annual Time 100 list.[21]\n\nOther [ edit ]\n\nIn 2018, she became the first woman to land a frontside double cork 1080 in halfpipe.[22]\n\nIn popular culture [ edit ]\n\nKim was featured on the cover of Sports Illustrated following her Olympic gold medal win.[23][24] Her appearance on a special edition of the Kellogg's Corn Flakes box set a new record for \"fastest-selling cereal box in Kellogg Company history.\"[25]\n\nIn 2018, Mattel began producing a Shero Barbie in her likeness in a new line of dolls highlighting inspiring women that also includes Amelia Earhart.[26] In February 2019, she was featured in Nike's \"Dream Crazier\" ad with Serena Williams, Simone Biles, Ibtihaj Muhammad, Megan Rapinoe, and other women athletes. The ad appeared during the 2019 Oscars.[27]\n\nAwards and honors [ edit ]\n\nIn July 2018, Kim won three ESPYs for Best Female Athlete, Best Female Olympian, and Best Female Action Sports Athlete.[28]\n\nPersonal life [ edit ]\n\nKim is Korean American, being a first-generation American; her parents emigrated from South Korea. In 1982, her father arrived in the United States with just $800 cash and eventually earned a college degree in manufacturing engineering technology.[29] Kim has extended family living in South Korea, where she competed in the 2018 Winter Olympics. Her relatives, including her grandmother, watched her compete for the first time at the Olympics.[30] Kim stated: \"I have this different opportunity because I'm Korean-American, but I'm riding for the States. ... I'm starting to understand that I can represent both countries.\"[29] She is trilingual, fluent in Korean, French, and English.[31] Kim was admitted to Princeton University's Class of 2022. After deferring the offer of admission until the Class of 2023, she stated she wants to study science.[32]\n\nFilmography [ edit ]\n\nYear Title Role Notes 2018 Double Dare Herself / Contestant Episode: \"Board Bombs vs. Team Over Your Head\" 2018 Ridiculousness Herself Episode: \"Chloe Kim\" 2019 Charlie's Angels Angel Recruit Cameo appearance\n\nMusic videos [ edit ]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/0/03/Flag_of_Italy.svg/22px-Flag_of_Italy.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/cf/Flag_of_Canada.svg/22px-Flag_of_Canada.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Bronze_medal_icon_%28B_initial%29.svg/16px-Bronze_medal_icon_%28B_initial%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/23px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Flag_of_Belgium_%28civil%29.svg/22px-Flag_of_Belgium_%28civil%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/22px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Flag_of_France.svg/22px-Flag_of_France.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Gold_medal_icon_%28G_initial%29.svg/16px-Gold_medal_icon_%28G_initial%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Silver_medal_icon_%28S_initial%29.svg/16px-Silver_medal_icon_%28S_initial%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Flag_of_Austria.svg/22px-Flag_of_Austria.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Flag_of_the_Netherlands.svg/22px-Flag_of_the_Netherlands.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Civil_Ensign_of_Switzerland.svg/23px-Civil_Ensign_of_Switzerland.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/ba/Flag_of_Germany.svg/22px-Flag_of_Germany.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Chloe_Kim%2C_2017_%28cropped%29.png/240px-Chloe_Kim%2C_2017_%28cropped%29.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b9/Flag_of_Australia.svg/22px-Flag_of_Australia.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Flag_of_the_Czech_Republic.svg/22px-Flag_of_the_Czech_Republic.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/9e/Flag_of_Japan.svg/22px-Flag_of_Japan.svg.png", "https://upload.wikimedia.org/wikipedia/commons/f/f3/Chloe_Kim%2C_2017_%28cropped%29.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Chloe_Kim%2C_2017_%28cropped%29.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Chloe_Kim", "title": "Chloe Kim", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Chloe_Kim%2C_2017_%28cropped%29.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}