{"url": "https://www.usatoday.com/story/life/entertainthis/2017/06/30/444-jay-z-review-everything-we-heard-on-new-album-beyonce-lemonade-response/103308504/", "text": "Maeve McDermott\n\nUSATODAY\n\nOf the many questions JAY-Z fans had in anticipation of his new album 4:44, which dropped Friday at midnight on TIDAL, was how the rapper would respond to his wife Beyoncé's Lemonade album, if at all.\n\nNow, we know.\n\nReleased barely two weeks after welcoming twins with Bey, Jay spends 4:44 meditating on his fame, wealth, troubled upbringing and experience as a black man in America. But before he gets to all that, he has a certain elevator fight to address.\n\nJay doesn't waste any time in airing his grievances, referencing his infamous scuffle with his sister-in-law Solange only minutes into the album's first track KillJay Z, talking to himself about how he lost control that night and unexpectedly name-dropping '90s R&B singer Eric Benét.\n\n\"You egged Solange on, knowin' all along all you had to say you was wrong / You almost went Eric Benét, let the baddest girl in the world get away / I didn't even know what else to say. Never go Eric Benét / I don't even know what you woulda done, in the future, other (expletive) playing football with your son,\" he raps, with the internet interpreting his \"football\" comment as a subtle jab at Future, whose ex Ciara married Seahawks quarterback Russell Wilson.\n\nHurry! Here's how you can listen to JAY-Z's new album, '4:44' for free\n\nJay continues his apology tour on 4:44, an unflinchingly honest track where he addresses Beyonce head-on, atoning for his various sins and indirectly referencing his alleged cheating.\n\n\"And if my children knew, I don't even know what I would do / If they ain't look at me the same, I would prolly die with all the shame / You did what with who? What good is a ménage à trois when you have a soulmate, you risked that for Blue?\" he says.\n\nHowever, just like Jay made an appearance in Bey's All Night video, signaling to viewers of Lemonade's visual album that all was well with the Carter family, Bey shows up on the 4:44 song Family Feud. The track prominently features her vocals, and according to the 4:44 album credits, she's listed as a co-writer on the track.\n\n\"My wife in the crib feeding my kids liquid gold, we in a whole different mode,\" Jay starts, before referencing Lemonade's most notorious lyric halfway through the track.\n\n“I’ll (expletive) up a good thing if you let me / Let me alone, Becky! / A man who don’t take care of his family can’t be rich / I watched Godfather, I missed that whole (expletive),\" he raps, referencing to the mystery \"Becky with the good hair\" from Sorry, which many fans interpreted as an allusion to Jay's infidelity.\n\nAs Jay says on Family Feud, \"Nobody wins when the family lose,\" before bringing his oldest daughter, Blue Ivy, to contribute the introduction to the album's closing track, Legacy.\n\nOne of the album's more unexpected targets is Kanye West, who railed against his Watch the Throne partner during an onstage rant last November for apparently not returning his calls.\n\n\"You gave him 20 million without thinking, He gave you 20 minutes on stage, (expletive) was he thinking?\" Jay raps during Kill Jay Z. \"'(Expletive) wrong with everybody?' is what you sayin', But if everybody's crazy, you're the one that's insane.\"\n\nOn a lighter note, the second-to-last track Moonlight is named after the 2017 best picture-winning movie.\n\n\"Ya'll stuck in La La Land / Even when we win, we gon' lose,\" he says in the chorus, explaining the song's Moonlight/La La Land connection in an interview with iHeart Radio.\n\n\"The hook is ‘We stuck in La La Land/Even if we win, we gonna lose,'\" he said. \"It’s like a subtle nod to La La Land winning the Oscar, and then having to give it to Moonlight. It’s really a commentary on the culture and where we’re going.\"\n\nAlong with Beyonce, 4:44 also features guests including Frank Ocean and Damien Marley. Ready to listen? The album is available for free via iHeartRadio for its first 24 hours before going back behind TIDAL's paywall, so stream it here.", "images": ["https://media.gannett-cdn.com/29906170001/29906170001_5489104588001_5489089898001-vs.jpg?pubId=29906170001&width=660&height=372&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/1e3a5e8ddeb46e5c1db9c5f63582f6b9e0083d4a/c=0-209-2996-1902/local/-/media/2017/06/30/USATODAY/USATODAY/636343811073981532-XXX-IMG-EPA-FILE-USA-MUSIC-B-4-1-2AIRG0GC-92019250.JPG?width=2996&height=1693&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/1e3a5e8ddeb46e5c1db9c5f63582f6b9e0083d4a/c=0-209-2996-1902/local/-/media/2017/06/30/USATODAY/USATODAY/636343811073981532-XXX-IMG-EPA-FILE-USA-MUSIC-B-4-1-2AIRG0GC-92019250.JPG?width=2996&height=1693&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/entertainthis/2017/06/30/444-jay-z-review-everything-we-heard-on-new-album-beyonce-lemonade-response/103308504/", "title": "'4:44' is JAY-Z's explosive response to Beyoncé's 'Lemonade'", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "'4:44' is JAY-Z's explosive response to Beyoncé's 'Lemonade'", "description": "JAY-Z's new album '4:44' came out Friday at midnight on TIDAL.", "url": "https://www.usatoday.com/story/life/entertainthis/2017/06/30/444-jay-z-review-everything-we-heard-on-new-album-beyonce-lemonade-response/103308504/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/1e3a5e8ddeb46e5c1db9c5f63582f6b9e0083d4a/c=0-209-2996-1902/local/-/media/2017/06/30/USATODAY/USATODAY/636343811073981532-XXX-IMG-EPA-FILE-USA-MUSIC-B-4-1-2AIRG0GC-92019250.JPG?width=2996&height=1693&fit=crop&format=pjpg&auto=webp", "width": 2996, "height": 1693}, "type": "article"}, "article": {"author": "Maeve McDermott", "content_tier": "free", "opinion": "false"}, "description": "JAY-Z's new album '4:44' came out Friday at midnight on TIDAL.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/1e3a5e8ddeb46e5c1db9c5f63582f6b9e0083d4a/c=0-209-2996-1902/local/-/media/2017/06/30/USATODAY/USATODAY/636343811073981532-XXX-IMG-EPA-FILE-USA-MUSIC-B-4-1-2AIRG0GC-92019250.JPG?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "'4:44' is JAY-Z's explosive response to Beyoncé's 'Lemonade'", "description": "JAY-Z's new album '4:44' came out Friday at midnight on TIDAL."}}, "movies": [], "publish_date": 1498752000.0, "source": "https://www.usatoday.com", "summary": ""}