{"url": "https://en.wikipedia.org/wiki/Kevin_(Probably)_Saves_the_World", "text": "No. Title Directed by Written by Original air date US viewers\n\n(millions)\n\n1 \"Pilot\" Paul McGuigan Michele Fazekas & Tara Butters October 3, 2017 ( ) 4.17[5]\n\nAfter getting fired from his Wall Street job and surviving a suicide attempt, Kevin Finn returns to his hometown to live with his twin sister Amy, a widowed mom, and her teenage daughter Reese. While Amy is away at a work assignment, a meteor crashes to earth near her home. Kevin and Reese investigate, and when Kevin touches the meteorite, he is hurtled backward. He begins having strange visions, including a mysterious woman named Yvette that only Kevin can see. Yvette calls herself one of God's messengers, tasked with locating the 36 righteous souls of this generation, of which Kevin is the only one known to be left.\n\nYvette tells Kevin that not even she knows what happened to the other 35 righteous ones, and that they'll have to let the universe guide them. She explains that Kevin needs to strengthen his soul by performing good deeds. While helping the son of a brewery pub owner find his true path, Kevin reconnects with his ex-girlfriend Kristin and the two sleep together. They ponder getting back together, but both remember how badly Kevin treated Kristin in the past and decide it's not a good idea. Kevin has a vision of an island surrounded by ocean.\n\n3 \"Sweet Little Lies\" Peter Leto Chris Dingess & Davah Avena October 17, 2017 ( ) 3.26[7]\n\nKevin tries to intervene as a wedding planner for Deb, whose former childhood friend proposed to her when she got cancer. But now that Deb is healthy, she reveals to Kevin that she does not want to get married. Kevin has a vision of a mariachi band. Yvette meets with Ava, a celestial messenger like herself. Ava says she will gather all the other messengers to meet about finding the rest of the righteous, but come meeting time, they are the only two to show up. Ava then says that she too is giving up.\n\n4 \"How to be Good\" J. Miller Tobin Teleplay by : Brant Englestein\n\nStory by : Michele Fazekas & Tara Butters October 24, 2017 ( ) 2.87[8]\n\nKevin helps Lucille, Tyler's rude boss at the diner, and gets dragged into a feud between Lucille and her estranged sister, Anne. Kevin later has a vision of being in an Asian marketplace. Reese confronts Kevin about the strange things she's observed, and asks if the meteorite gave him superpowers.\n\n5 \"Brutal Acts of Kindness\" Rob Hardy Craig DiGregorio October 31, 2017 ( ) 2.71[9]\n\nAfter Yvette convinces him to withdraw his entire $30,000 severance pay and give it away, Kevin helps a woman who cannot afford her son's diabetes medication. He later has a vision of being chased by a tiger through a jungle. Amy finds Reese's journal and sees that Kevin caused Reese to be thrown in jail. She angrily tells Kevin to pack up and move out.\n\n6 \"Rocky Road\" Wendey Stanzler Jack Kenny November 7, 2017 ( ) 2.91[10]\n\nKevin begins looking for places to stay, hitting up Tyler, Kristin and Nathan. He also helps a man who lost his job 18 months ago look for work, learning that the man never told his wife and has now exhausted their life savings. Angry at her mom, Reese skips school and runs away to an abandoned factory. Kevin and Amy arrive to talk her down, but Reese slips from her perch and falls. Yvette suspends Reese in mid air for a couple of seconds, allowing Kevin to get underneath and catch her. A dumbfounded Amy observes, and starts seeing Kevin the way Reese has seen him. Kevin gets a printout of all his previous visions, plus a new one of mountaintops in the clouds.\n\n7 \"Dave\" Ron Underwood Chris Dingess November 14, 2017 ( ) 2.62[11]\n\nKevin and Yvette are joined by Dave (Will Sasso), another celestial messenger, who helps them on Kevin's next assignment. The assignment turns out to be helping Kristin's cancer-stricken mother Susan (Anjali Bhimani) find some joy while living out her last days. Kevin later sees a vision of a flaming gazebo. Meanwhile, Amy wants to use science to figure out what she witnessed when Reese fell, and soon meets Iggy (Brandon Quinn), a theology professor who tries to convince her that it's okay for some things to remain unexplained. Also, Nathan tells Reese he wants to ask Amy out on a date, but Reese will not give him permission.\n\n8 \"Chrysalis\" Metin Hüseyin Kevin Deiboldt December 5, 2017 ( ) 2.62[12]\n\nKevin sees a vision of blue butterflies, and follows one to an art class held by Ethan (Enoch King). Kevin offers to help Ethan get over his fear of rejection by taking him to an art show, later realizing this will conflict with Reese's school play. Dave appears and reveals himself to Ethan, offering to take him to the art showing so Kevin can be with his family. At the same time, Yvette meets with Ava, who tells her that Dave has turned all the celestial messengers against her. Kevin angrily confronts Yvette about being able to reveal herself to other people, and asks what else she's hidden from him. Yvette admits she does not know if the other 35 righteous really exist, and is operating on faith alone. Kevin chooses to work with Dave, which backfires when Ethan gets scared and backs out of the show. Kevin returns to Yvette while making things right with Ethan by setting up a surprise showing of Ethan's paintings. Ethan offers a painting of a blue butterfly to Kevin as a thank you, also telling Kevin about a trip he took that inspired it. Kevin now knows where the next righteous soul will be found. Elsewhere, Kristin helps Amy prepare for her first date with Iggy, but later notices that Amy will not tell Nathan about the date.\n\n9 \"Probably\" Tamra Davis Michele Fazekas & Tara Butters December 12, 2017 ( ) 2.49[13]\n\nKevin travels to Laos, taking Tyler along. The two are befriended by Vong (David Huynh), whom Kevin and Yvette briefly think is the next righteous but he's not. Kevin sees another of his visions and wants to press on, but Yvette now has doubts and thinks Dave may have been right. Yvette appears as human and is approached by Tyler, who finds her fascinating. The two dance to a mariachi band (another of Kevin's earlier visions), which renews Yvette's faith. Kevin and Tyler, with help from Lucille on video chat, then help Vong's wife deliver their first child, and it turns out the baby is the next righteous soul. Back at home, Reese tells Amy that Nathan wanted to ask her out. Amy meets Nathan the next day and tells him about Iggy, but says she now knows she wasn't yet ready to date and is glad she realized this with someone she doesn't truly care about. Nathan later does something special for Amy.\n\n10 \"The Ugly Sleep\" J. Miller Tobin Davah Avena January 2, 2018 ( ) 2.62[14]\n\nKevin helps Charlie (Trent Garrett), who is despondent over a recent breakup, meet someone new, but when the someone new turns out to be Kristin, it leads to awkwardness. The situation causes Charlie to realize the girl he left is his one true love, and he returns to her. Inspired by Kevin's good deeds, Reese befriends a new girl at school who is struggling to fit in. Meanwhile, Yvette sees that Tyler is still smitten over her and tries to figure out a way to help him move on. Kevin has a vision of a snow-covered area in the woods. As the episode closes, Kristin tells Kevin that she submitted his name for an open substitute teacher position.\n\n11 \"Solo\" Lee Rose Kevin Deiboldt January 9, 2018 ( ) 2.39[15]\n\nOn his first day as a substitute teacher, Kevin encounters an introverted kid named Adam and extracts information about who will be the target of the annual \"Freshman Prank\". After Adam reveals the target is Kristin, he becomes even more disliked for squealing. Kevin tries to help Adam become noticed for something else -- namely, pulling off the most legendary Freshman Prank since the one Kevin engineered 20 years ago. Meanwhile, Amy and Nathan have an awkward first date, but later enjoy helping Kevin, Adam and Tyler as they plan the prank. Kevin has a vision of being on the deck of a crabbing boat.\n\n12 \"Caught White-Handed\" Jennifer Lynch Brant Englestein January 16, 2018 ( ) 2.46[16]\n\nReese is with Kevin when he tracks his next subject, and she realizes her uncle has stumbled upon the mysterious \"acorn fairy\" -- a person who has been doing good deeds around Taylor for the last ten years. In trying to help the woman (Kathleen Wilhoite), Kevin unintentionally causes her real identity to be revealed, along with her criminal past. Meanwhile, Yvette learns that the person responding to Tyler's ads searching for her is Kevin, who says he was just trying to figure out a way to let his friend down easy. This backfires when Tyler decides to travel to Canada to locate his true love. Kevin has a vision of the boat from the previous episode, but this time Tyler is with him.\n\n13 \"Fishtail\" J. Miller Tobin Craig DiGregorio & Chris Dingess February 6, 2018 ( ) 2.29[17]\n\nKevin tracks Tyler to Victoria, British Columbia, finding him working at a failing fish shop for a stubborn owner named Gus (Troy Evans), who refuses to update the shop in the modern marketplace that surrounds him. Kevin sees images from his fish boat vision, and determines the next righteous soul is in the vicinity. Elsewhere, Yvette reconnects with Dave to show him a cut on her finger and ask what it means. Dave later reveals a scrape on his leg. While Kevin and Tyler help Gus save his shop by developing an old-time fish tossing show, Kevin finds that the next righteous is Gus's landlord Shea (Sprague Grayden), who has done everything she can to keep the fish shop open. At Yvette's urging, Kevin tells Tyler the truth: that he wrote the emails from his \"true love\" to try and give him closure. Tyler decides that Kevin is no longer his friend.\n\n14 \"Old Friends\" Michael Patrick Jann Chris Dingess & Craig DiGregorio February 20, 2018 ( ) 1.55[18]\n\nAs Kevin helps Amy with a task, he meets and helps Marc (Rhenzy Feliz), a 19-year old who has become a drifter after being estranged from his parents. Kevin also makes numerous attempts to win back Tyler's friendship, all of which fail until he gets Dave's help to see into Tyler's past. With further help from Kristin and Amy, Kevin makes a grand gesture to recreate a piece of Tyler's childhood. In the process, Kevin reconnects with Kristin romantically. While kissing her, he is startled by a vision of a bearded corpse in a coffin. Elsewhere, Yvette and Dave are continuing to develop human qualities, like getting ill and becoming hungry. As the episode closes, Dave gets electrocuted and disappears. Yvette confesses to Kevin that she has no idea where Dave went.\n\n15 \"World's Worst Domino\" Peter Leto Brant Englestein & Davah Avena February 27, 2018 ( ) 2.11[19]\n\nAmy hears something upstairs, which she thinks is a critter or intruder, but is actually Yvette. This causes Amy to install multiple security cameras. Yvette tells Kevin that Dave is likely dead, and that changes are happening to her. Meanwhile, Kevin helps Becky, the school security guard who was fired following the prank he helped engineer. It turns out Becky is a bit of an inventor, and with help from Amy and Tyler, Kevin is able to get her into a nearby inventor's expo. While the expo doesn't go well, Becky and Tyler fall for each other. As the episode concludes, Amy and Reese are reviewing security camera footage, and are startled by a brief, faint image of what appears to be a human talking to Kevin.\n\n16 \"The Right Thing\" J. Miller Tobin Michele Fazekas & Tara Butters March 6, 2018 ( ) 2.51[20]", "images": ["https://upload.wikimedia.org/wikipedia/en/e/e0/Kevin_Probably_Saves_The_World.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e0/Kevin_Probably_Saves_The_World.png/250px-Kevin_Probably_Saves_The_World.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/e/e0/Kevin_Probably_Saves_The_World.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Kevin_(Probably)_Saves_the_World", "title": "Kevin (Probably) Saves the World", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/e/e0/Kevin_Probably_Saves_The_World.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}