{"url": "www.thehollywoodgossip.com/2017/12/kourtney-kardashian-to-jennifer-lawrence-stay-away-from-scott-di/", "text": "If you've enjoyed her many bonkers interviews over the years (some of which, to our minds, are every bit as entertaining as her funniest film roles), then you're likely aware that Jennifer Lawrence loves alcohol and reality television.\n\nSo it's not surprising that J-Law might have a bit of a thing for Kourtney Kardashian sperm donor and bold innovator in the use of facial hair to camouflage booze bloat, Scott Disick.\n\nOn second thought, it is surprising, but only in the sense that we're shocked Scott is still alive.\n\nAnyway, Jen revealed her love for the Lord in a recent interview with Oprah, in which she revealed that Scott would be one of her three ideal dinner guests.\n\n(The other two were Luann DeLesseps and Bethenny Frankel, both of Bravo's Real Housewives franchise. Jen ... we're concerned.)\n\nGiven that Jen chose Scott over any of the women in the Kardashian clan, it's not surprising that certain tabloids already have these two bedding down together.\n\nIt's also not surprising that some of these same publications are casting Kourtney in the role of the insane ex:\n\nAccording to the Australian version of OK! magazine (because why wouldn't news about three American celebs reach Sydney first?), Kourtney is pissed about the possibility of Jen and Scott hooking up.\n\nIn fact, Kourt has reportedly warned Lawrence to keep her mitts off her boozy baby daddy.\n\nThe subtly-titled piece “Kourtney Warns J. Law: Stay Away From Scott!” doesn't offer anything in the way of quotes or evidence, and instead poses an argument along the lines of \"makes sense if ya think about it.\"\n\nThe article also doesn't mention the fact that Kourtney is dating Younes Bendjima.\n\nOr that Scott is with Sofia Richie.\n\nOr that Jen was clearly joking, and her ideal dinner party would really just consist of Meryl Streep playing three different roles.\n\nLook, we believe Jen when she says she genuinely enjoys Keeping Up With the Kardashians (though it's worth noting that she's said she watches the show \"to fall asleep.\" Celebrities--they're as bored with the Kardashians as the rest of us!).\n\nBut there's a difference between enjoying a reality show and wanting to enmesh yourself in that world.\n\nWe like watching Naked and Afraid, but the thought of a single genital mosquito is enough to keep us inside for the bulk of 2018.\n\nHey, if the mere mention of Scott Disick doesn't bring to mind a bloodsucker who will spread disease to your nether regions, then you're not sufficiently wary of the Lord.", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--XzTCgZzX--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1513959999/attachment/kourtney-kardashian-scott-disick-jennifer-lawrence-split.png"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--XzTCgZzX--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1513959999/attachment/kourtney-kardashian-scott-disick-jennifer-lawrence-split.png", "keywords": [], "authors": ["Tyler Johnson"], "canonical_link": "https://www.thehollywoodgossip.com/2017/12/kourtney-kardashian-to-jennifer-lawrence-stay-away-from-scott-di/", "title": "Kourtney Kardashian to Jennifer Lawrence: Stay Away From Scott Disick!", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2017/12/kourtney-kardashian-to-jennifer-lawrence-stay-away-from-scott-di/", "title": "Kourtney Kardashian to Jennifer Lawrence: Stay Away From Scott Disick!", "description": "Does Jennifer Lawrence have a thing for Scott Disick? According to one tabloid, she does, and Kourtney Kardashian is NOT happy about it!", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--l2tY61oI--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1450385197/scott-disick-auntie-kris-its-me-its-todd-kraines-gif.gif", "type": "image/gif", "width": 500, "height": 230}}, "article": {"published_time": "2017-12-21T13:16:35-05:00", "modified_time": "2017-12-22T11:27:32-05:00", "tag": "Celebrity Gossip", "author": "Tyler Johnson"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Kourtney Kardashian to Jennifer Lawrence: Stay Away From Scott Disick!", "description": "Does Jennifer Lawrence have a thing for Scott Disick? According to one tabloid, she does, and Kourtney Kardashian is NOT happy about it!", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--XzTCgZzX--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1513959999/attachment/kourtney-kardashian-scott-disick-jennifer-lawrence-split.png"}}, "description": "Does Jennifer Lawrence have a thing for Scott Disick? According to one tabloid, she does, and Kourtney Kardashian is NOT happy about it!"}, "movies": [], "publish_date": 1513880195.0, "source": "http://www.thehollywoodgossip.com", "summary": ""}