{"url": "www.newidea.com.au/jennifer-aniston-furious-as-friend-emma-stone-spotted-getting-cozy-with-justin-theroux", "text": "The pair became close friends on set when they filmed Netflix show Maniac and Jen is said to be wondering whether they have been dating while she and Justin were still a couple.\n\n‘Justin and Emma did a movie together last year, so Jen is of course now wondering whether they hooked up back then - when Justin and Jen were still married,’ spills the source.\n\n‘It’s certainly not the first time Jen’s seen her husband fall for another actress on set, so of course she’s wary. It happened with Brad and Angelina – so Jen can’t help but think history is repeating itself,’ the insider says.\n\nTo add insult to injury, Jen has been close to Emma for a while and with these recent revelations, Jen feels her pal has been disloyal.\n\n‘She and Emma have been friends – the fact that she’s now hanging with Jen’s ex-husband is a complete betrayal. Emma has obviously chosen to side with Justin after the whole split, which is very telling to Jen considering that she’s been friends with Emma.\n\n‘She just wants to know when their hook-ups started – they looked so cosy and happy on their date, like this definitely wasn’t their first night out,’ the source continues.\n\n‘Jen just feels completely humiliated, like she’s being played for a fool – and she doesn’t like it one little bit.’\n\nJen and Justin called it quits in February this year and he has stayed friends with Emma since.\n\nJustin even posted the two of them hanging out onto his Instagram, but he was quick to declare they were ‘just friends’.\n\nBut just a month after announcing his split from Jen, Justin was seen at the Louis Vuitton show beside Emma.\n\nHe has also been linked to various other women including actress Aubrey Plaza and artist Petra Collins, while Emma is said to be dating writer Dave McCarthy since last year.\n\nIn the meantime, Jen has been rumoured to be back together again with her ex-husband Brad Pitt who recently finalised his divorce from Angelina Jolie.\n\nJen is also alleged to be pregnant with Brad’s child and was spotted getting off a private plane a few weeks back, hiding what seemed to be a baby bump.\n\nBut the news comes amid controversy that Brad Pitt is secretly dating beautiful architect Neri Oxman, leaving Jen to possibly consider raising their baby alone.\n\nJen and Justin have remained estranged since the split and sources tell New Idea the pair had an explosive showdown a few weeks ago as he returned to their Bel Air mansion to collect the rest of his belongings.\n\nNow with the recent release of the pictures of Justin’s cosy date with Emma, the relationship with Jen is certain to become even more frosty.\n\nFor the full story see this weeks issue of New Idea - out now!", "images": ["http://www.newidea.com.au/Branding/newidea/images/brand-logo-gray.svg", "https://snowplow.swm.digital/i?e=se&se_ca=ping&tv=http-get-0.1.0&dtm=0&stm=0&tna=pac&p=web", "http://www.newidea.com.au/media/73139/ni4619_cover_nobc_bws.png?height=158", "http://www.newidea.com.au/Branding/newidea/Images/idm-error-icon.svg", "http://www.newidea.com.au/Branding/newidea/images/gmail.svg", "http://secure-gl.imrworldwide.com/cgi-bin/m?ci=au-pacmags&cg=0&cc=1&ts=noscript", "http://www.newidea.com.au/Branding/NewIdea/images/brand-logo-footer-new.svg", "http://www.newidea.com.au/Branding/newidea/images/idm-thanks-icon.svg", "http://www.newidea.com.au/media/27317/jen-aniston-preview.jpg", "http://www.newidea.com.au/Branding/NewIdea/images/enhanced-header-logo.svg"], "top_img": "http://www.newidea.com.au/media/27317/jen-aniston-preview.jpg", "keywords": [], "authors": ["Faye James", "Faye James Is A Regular Contributor At New Idea", "Who", "Practical Parenting", "Works Across Health", "Beauty", "Celebrity", "Royal Content. She Has Over Years Of Experience Spanning Across The Uk", "Middle East"], "canonical_link": "https://www.newidea.com.au/jennifer-aniston-furious-as-friend-emma-stone-spotted-getting-cozy-with-justin-theroux", "title": "Jen's fury as Justin commits the ultimate betrayal", "meta_data": {"language": "en-us", "description": "Jen Aniston is said to be furious that her estranged husband Justin Theroux has already fallen into the arms of another A-list star – her good friend Emma Stone.", "news_keywords": "Jennifer Aniston, Justin Theroux, Jen and Justin, Emma Stone, Emma Stone Justin Theroux, Jennifer Aniston furious at Emma Stone over Justin Theroux, Justin Theroux dating, Justin Theroux Emma Stone, Emma Stone dating, Jennifer Aniston feud Justin Theroux, Jen and Justin split, celebrity news, celeb news, latest celebrity news, celeb gossip, latest celebrity gossip, latest celebrity goss, Jennifer Aniston latest, Justin Theroux latest, Emma Stone latest", "robots": "index, follow", "og": {"site_name": "New Idea", "type": "article", "url": "https://www.newidea.com.au/jennifer-aniston-furious-as-friend-emma-stone-spotted-getting-cozy-with-justin-theroux", "title": "Jen's fury as Justin commits the ultimate betrayal", "description": "Jen Aniston is said to be furious that her estranged husband Justin Theroux has already fallen into the arms of another A-list star – her good friend Emma Stone.", "image": {"identifier": "http://www.newidea.com.au/media/27317/jen-aniston-preview.jpg", "width": 1500, "height": 800}}, "twitter": {"title": "Jennifer Aniston furious as friend Emma Stone spotted getting cozy with Justin Theroux", "description": "Jen Aniston is said to be furious that her estranged husband Justin Theroux has already fallen into the arms of another A-list star – her good friend Emma Stone.", "image": "http://www.newidea.com.au/media/27317/jen-aniston-preview.jpg", "url": "https://www.newidea.com.au/jennifer-aniston-furious-as-friend-emma-stone-spotted-getting-cozy-with-justin-theroux"}, "fb": {"admins": 863618607005758, "pages": 140279489324860}, "msvalidate.01": "3BD3CB44DC500E9821E82E085D0F0D13", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1526261119.966, "source": "http://www.newidea.com.au", "summary": ""}