{"url": "abcnews.go.com/Entertainment/terry-crews-names-alleged-sexual-assaulter-shamed/story?id=51146972", "text": "\u0097 -- Terry Crews publicly named for the first time the high-powered talent agent he claims groped him at an industry party and said he would \"not be shamed\" about the alleged assault.\n\n\"Back in February 2016, I was assaulted by Adam Venit, who is head of the motion picture department at William Morris Endeavor, one of the biggest agencies in the world, period,\" Crews, 49, said today on \"Good Morning America.\" \"He's connected to probably everyone I know in the business ... I did not know this man. I have never had a conversation with him, ever.\"\n\nVenit has represented stars such as Adam Sandler, Eddie Murphy, Sylvester Stallone, Diane Keaton, Liam Hemsworth and Steve Martin.\n\nHost Adam Venit speaks onstage at the OF BY FOR Awards presented by Represent.Us, on Oct. 27, 2016, in Beverly Hills, Calif. Charley Gallay/Getty Images\n\nCrews was with his wife, Rebecca King-Crews, at the party last year when, he claims, Venit began making moves with his tongue at him.\n\n\"I'm looking like, 'Is this a joke?' ... It was actually so bizarre,\" Crews said. \"He comes over to me. I stick my hand out, and he literally takes his hand and puts it and squeezes my genitals. I jump back like, 'Hey, hey.'\"\n\nCrews continued, \"And he's still licking his tongue out and all this stuff, and I go, 'Dude, what are you doing? What are you doing?' and then he comes back again. He just won't stop.\"\n\nCrews claims he then pushed Venit away from him, causing Venit to bump into other partygoers.\n\n\"I have never felt more emasculated, more objectified. I was horrified,\" Crews said. \"It's so bizarre. I wake up every morning wondering, 'Did this really happen?'\"\n\nVenit did not respond to requests for comment from ABC News.\n\nWilliam Morris Endeavor told ABC News, \"Adam Venit was suspended following the internal investigation into the matter.\"\n\nCrews filed a police report Nov. 8 claiming to be a victim of a crime.\n\n\"People need to be held accountable,\" he said. \"This is the deal about Hollywood. It is an abuse of power. This guy, again, he's one of the most powerful man in Hollywood, and he looked at me at the end as if, 'Who is going to believe you?'\"\n\nAn LAPD spokesperson confirmed that Crews met with officers on Nov. 8 but would not elaborate on the nature of the meeting.\n\nCrews, a star of \"Brooklyn Nine-Nine,\" fired William Morris as his agency one day after he filed the police report.\n\nTerry Crews speaks out on \"Good Morning America\" about an alleged incident in which he says a \"high-level Hollywood executive\" groped him at a party. ABC\n\nHe went public with his account last month in a series of tweets, at the time identifying Venit only as \"a high level Hollywood executive.\"\n\nCrews said in one tweet that Venit called him to apologize but \"never really explained why he did what he did.\"\n\n'I understand why they won't come forward'\n\nCrews said he went public with the alleged incident after multiple women came forward to accuse now-disgraced Hollywood producer Harvey Weinstein of sexual misconduct.\n\n\"I put it in the back of my head, and I understood why women everywhere had to let it go,\" Crews said. \"When the Weinstein thing started happening, I got PTSD. I was going, 'Oh, my God, this exact thing happened to me. I understand why they won't come forward.'\"\n\nWeinstein, 65, has admitted wrongdoing but through a spokesperson has repeatedly denied having nonconsensual sexual relations with accusers.\n\nCrews compared being abused by a person in power to being a war captive.\n\n\"When a person of power breaks that boundary and violates that boundary, you're a prisoner of war,\" he said. \"Immediately, you're in a camp because you're trying to figure out when is the right time to come out.\"\n\n\"This the thing that a lot of people just don't understand, and they end up blaming the victim,\" he said. \"I have totally said I will not be shamed. I will not be shamed. I did nothing wrong. Nothing.\"\n\nCrews credited his wife with keeping him calm after the alleged assault.\n\nTerry Crews and his wife, Rebecca King-Crews, attend the Entertainment Weekly's 2017 Pre-Emmy Party at the Sunset Tower Hotel, Sept. 15, 2017, in West Hollywood, Calif. David Livingston/Getty Images\n\n\"My wife told me three years earlier, she said, 'Terry, you can never handle any situation like this with violence. You are a target. You are going to be baited and pulled if you react physically,'\" he said. \"When I grabbed her hand and I left that party — we were only there for, like, half an hour — and I got in the car, I almost ripped the steering wheel off.\"\n\n\"If I would have just retaliated in defense, I would be under the jail right now. That's one thing I knew, that being a large African-American man in America, I would immediately be seen as a thug,\" he added. \"But I'm not a thug. I'm an artist.\"\n\nCrews, a father of five, said he was also motivated to speak publicly after delivering a keynote address for an organization that helps victims of sexual assault.\n\n\"I said, 'Man, what kind of man would I be to tell my kids, 'If someone touches you where you don't want to be touched, tell someone, tell someone,' and then I don't do it?\" he said. \"Let me tell you something, it freed me.\"\n\nHe continued, \"I knew instantly that I had to tell my story so that other people could be free.\"\n\nCrews posted a tweet with just the hashtag #imfree after his appearance on \"GMA.\"\n\nABC News' Alex Stone and Lesley Messer contributed to this report.", "images": ["https://s.abcnews.com/images/Entertainment/terry-crews1-gma-mem-171115_16x9_992.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://s.abcnews.com/images/Entertainment/terry-crews1-gma-mem-171115_16x9_992.jpg", "keywords": [], "authors": ["Abc News", "Katie Kindelan", "Sabina Ghebremedhin", "November", "Min Read"], "canonical_link": "https://abcnews.go.com/Entertainment/terry-crews-names-alleged-sexual-assaulter-shamed/story?id=51146972", "title": "Terry Crews names alleged sexual assaulter: 'I will not be shamed'", "meta_data": {"keywords": "terry crews, sexual misconduct, allegations, Hollywood, #metoo, actor", "copyright": "2020 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "Terry Crews names alleged sexual assaulter: 'I will not be shamed'", "og": {"site_name": "ABC News", "url": "https://abcnews.go.com/Entertainment/terry-crews-names-alleged-sexual-assaulter-shamed/story?id=51146972", "title": "Terry Crews names alleged sexual assaulter: 'I will not be shamed'", "image": "https://s.abcnews.com/images/Entertainment/terry-crews1-gma-mem-171115_16x9_992.jpg", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2017-11-16T07:47:14Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/story,51146972", "ipad": "abcnewsipad://link/story,51146972", "googleplay": "https://abcnews.go.com/Entertainment/terry-crews-names-alleged-sexual-assaulter-shamed/story?id=51146972"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "Terry Crews names alleged sexual assaulter: 'I will not be shamed'", "url": "https://abcnews.go.com/Entertainment/terry-crews-names-alleged-sexual-assaulter-shamed/story?id=51146972", "image": {"identifier": "https://s.abcnews.com/images/Entertainment/terry-crews1-gma-mem-171115_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/story,51146972", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/story,51146972", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/Entertainment/terry-crews-names-alleged-sexual-assaulter-shamed/story?id=51146972", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/Entertainment/terry-crews-names-alleged-sexual-assaulter-shamed/story?id=51146972"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "http://abcnews.go.com", "summary": ""}