{"url": "https://www.theverge.com/2018/1/4/16846920/golden-globes-live-stream-2018-full-show-watch-online", "text": "Awards season is up and running this weekend with the 75th Golden Globe Awards, which will kick things off with Hollywood’s least serious award show. But even if winning a Golden Globe isn’t considered as much of an accomplishment as winning an Oscar, the Globes can often indicate which way the Hollywood winds are blowing. Here’s everything you need to know to enjoy the red carpet.\n\nWho’s the host?\n\nSeth Meyers, who you may know from his NBC late-night show, the aptly named Late Night with Seth Meyers. Or maybe you somehow caught his appearance in the 2008 movie Journey to the Center of the Earth — which, last I checked, was most notable for killing off the last vestiges of Brendan Fraser’s cinematic career.\n\nIt’s Meyers’ first time hosting, but he’ll be following in the talk-show-host footsteps of Jimmy Fallon, who hosted the Golden Globes last year. So at least the bar has been set for Meyers’ brand of humor. NBC is marketing the show under the tagline “Hollywood, we have a lot to talk about,” so expect lots of fun and not-at-all uncomfortable and awkward humor about the recent turmoil in Hollywood over sexual harassment and abuse.\n\nMeyers has commented in an interview with The Hollywood Reporter that he took the gig in the first place after conversations with his wife and women on the writing staff, viewing it as “an opportunity to be able to say some things that you wouldn’t be able to say in previous years.”\n\nWho’s up for the big awards?\n\nOn the film side of things, The Shape of Water, (seven nominations), The Post (six nominations) and Three Billboards Outside Ebbing, Missouri (also six) lead the pack. Lady Bird (four nominations) is also in the mix for several big awards, although not for Best Director, since that category once again completely overlooked all female directors.\n\nThe awards aimed at TV shows are more widely distributed. HBO’s Big Little Lies leads with six nominations, but it’s up against a slate of other prominent prestige shows, including The Handmaid's Tale, This Is Us, Master of None, Stranger Things, and The Crown.\n\nThe full list of nominations is available here.\n\nWhen does this awards shindig start?\n\nThe 75th Golden Globe Awards will start at 5PM PT / 8PM ET on Sunday night, January 7th. The ceremony will take place at The Beverly Hilton in Beverly Hills, California. The show will be broadcast live on NBC, as it has been since 1993.\n\nAnd if you just can’t get enough of the glamour, you can tune in an hour earlier for the red carpet arrivals, which will be streamed exclusively on Facebook.\n\nOkay, I’m in. How do I watch?\n\nDo you have NBC? Like through an over-the-air antenna, cable, or satellite television? Because this would really be a lot simpler if you did. You can simply just head over to your local NBC affiliate (Channel 4 in both NYC and the LA / Hollywood area), and you’ll be all set.\n\nSound good?\n\nNo. How do I watch on the internet?\n\nGood news! Unlike last year, where NBC didn’t stream the Golden Globes at all, apparently due to the fact that the company’s contract with the Hollywood Foreign Press Association doesn’t include streaming rights, this year you’ll be able to watch the Golden Globes online! According to a report from The Hollywood Reporter, NBC and the Hollywood Foreign Press Association have reached a deal to allow for online streaming of the awards show this year.\n\nSo if you have a cable or satellite provider with NBC (or a login from someone who does), you’ll be able to watch online live through NBC’s app (iOS / Android) or website.\n\nIs that it?\n\nNo cable at all? No problem. Over-the-top subscription services like DirecTV Now, Playstation Vue, Sling TV, YouTube TV, and Hulu’s live TV service all offer NBC, at least in some areas, and if you can get NBC on one of those services where you live, you’ll be able to watch the Golden Globes live there. (You’ll have to check local listings for specific over-the-top services, and different services may or may not have NBC, based on where you live.)\n\nAnd even if you’re not a subscriber, fortunately, most of these services offer free seven-day trials, so you won’t be committing to a long-term subscription if you want to give it a shot — just remember to cancel your subscription afterward so you don’t get charged.\n\nPlus, there’s always Twitter if you’d like to follow along with reactions and memes in real time — and The Verge will be reporting live on the night, with a running list of winners, reactions, and other news.\n\nUpdate January 5th, 12:30pm: Based on a report from The Hollywood Reporter, NBC will be livestreaming the Golden Globes online this year on both NBC’s site and apps and any over-the-top TV service that offers NBC. This article has been updated with the new information.", "images": ["https://cdn.vox-cdn.com/thumbor/HjspMuLIUyAItH5CbX5VfzwxHZs=/0x113:1000x637/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9976047/NUP_180950_0484.JPG", "https://cdn.vox-cdn.com/thumbor/I-0KmjFOQGXZj2k34WmguIW4lH4=/0x0:1000x750/1200x800/filters:focal(420x295:580x455)/cdn.vox-cdn.com/uploads/chorus_image/image/58208215/NUP_180950_0484.0.jpeg"], "top_img": "https://cdn.vox-cdn.com/thumbor/HjspMuLIUyAItH5CbX5VfzwxHZs=/0x113:1000x637/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9976047/NUP_180950_0484.JPG", "keywords": [], "authors": ["Chaim Gartenberg", "Jan"], "canonical_link": "https://www.theverge.com/2018/1/4/16846920/golden-globes-live-stream-2018-full-show-watch-online", "title": "How to watch the 2018 Golden Globes online tonight", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Verge", "article": {"publisher": "http://www.facebook.com/verge", "author": "https://www.facebook.com/cgartenberg", "published_time": "2018-01-04T14:40:47-05:00", "modified_time": "2018-01-07T10:30:14-05:00"}, "author": "Chaim Gartenberg", "style-tools": "https://www.theverge.com/style/community/372/e8584abde1fc118cbb44d8e68e9902bc/tools.css", "google-site-verification": "IucFf_TKtbFFH8_YeFyEteQIwYPdANM1R46_U9DpAr4", "msvalidate.01": "D385D0326A3AE144205C298DB34B4E94", "ahrefs-site-verification": "1e57a609922037a3fbdc1c22efd7334113f174f15608f37e1b8538a7b4ce64c3", "description": "The 75th Golden Globe Awards will start at 5PM PT / 8PM ET on Sunday night, January 7th. The ceremony will take place at The Beverly Hilton in Beverly Hills, California. The show will be broadcast live on NBC, as it has been since 1993.", "og": {"description": "Roll out the red carpet.", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/HjspMuLIUyAItH5CbX5VfzwxHZs=/0x113:1000x637/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9976047/NUP_180950_0484.JPG", "height": 630, "width": 1200}, "site_name": "The Verge", "title": "How to watch the 2018 Golden Globes online tonight", "type": "article", "url": "https://www.theverge.com/2018/1/4/16846920/golden-globes-live-stream-2018-full-show-watch-online"}, "fb": {"app_id": 549923288395304}, "twitter": {"card": "summary_large_image", "url": "https://www.theverge.com/2018/1/4/16846920/golden-globes-live-stream-2018-full-show-watch-online", "title": "How to watch the 2018 Golden Globes online tonight", "description": "Roll out the red carpet.", "image": "https://cdn.vox-cdn.com/thumbor/dBb0aIdkYMRsIEDdBuXaZwsCEMI=/0x125:1000x625/fit-in/1200x600/cdn.vox-cdn.com/uploads/chorus_asset/file/9976047/NUP_180950_0484.JPG", "site": "verge"}, "sailthru.title": "How to watch the 2018 Golden Globes online tonight", "sailthru.tags": "general,the-verge,front-page,entertainment,tv,film,golden-globes,culture", "sailthru.description": "The 75th Golden Globe Awards will start at 5PM PT / 8PM ET on Sunday night, January 7th. The ceremony will take place at The Beverly Hilton in Beverly Hills, California. The show will be broadcast live on NBC, as it has been since 1993.", "sailthru.date": "2018-01-04T14:40:47-05:00", "sailthru.image.full": "https://cdn.vox-cdn.com/thumbor/7K8MTh9LE8idxY8Pnyd2UQLJr2c=/0x94:1000x657/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/58208213/NUP_180950_0484.0.jpeg", "sailthru.image.thumb": "https://cdn.vox-cdn.com/thumbor/sVKTXVNLzAJb5FPdfORpjbjI-Ec=/114x0:864x750/200x200/cdn.vox-cdn.com/uploads/chorus_image/image/58208213/NUP_180950_0484.0.jpeg", "msapplication-TileImage": "https://cdn.vox-cdn.com/uploads/chorus_asset/file/7396113/221a67c8-a10f-11e6-8fae-983107008690.0.png", "msapplication-TileColor": "#393092", "outbrainsection": "golden-globes"}, "movies": [], "publish_date": 1514995200.0, "source": "https://www.theverge.com", "summary": ""}