{"url": "https://junkee.com/please-like-review-funniest-season-yet-much-wasnt/92284", "text": "The final three episodes were masterpieces of TV writing, whether they got credit for it or not.\n\nSpoilers for season four of Please Like Me!\n\n–\n\nIt began with drag queens lip-syncing to niche gay icon Enya’s timeless ‘Orinoco Flow’ in a gay nightclub and an extremely awkward, failed threesome between Josh (Josh Thomas), his boyfriend Arnold (Keegan Joyce) and a hunky paramour. It ended with an altogether different threesome: a trio of episodes that would likely be hailed as masterpieces of television writing if they were on American cable and not about very ordinary people in the inner suburbs of Melbourne.\n\nIt is a shame that without the prestige and social media buzz that comes with many more high-profile shows from HBO or Netflix, this season of Please Like Me hasn’t received the mainstream acclaim it deserves. But much like how Love My Way eventually wormed its way into the collective pantheon despite minimal ratings success at the time, hopefully this particular tide will change.\n\nPlease Like Me should no longer be seen as just a niche show about that gay comedian with the funny accent. It should be recognised as the rich, layered, and superb work that it is.\n\nThe Gay And The Everyday\n\nWhile there is so much to admire about this show, it’s true that placing its interest in the intricacies of modern gay life means it’s probably viewed by more people in New York City than all of Australia. But as one of the few who does watch it, it’s so refreshing to see this sort of portrayal of gay characters like Josh, Arnold, and Hannah (Hannah Gadsby’s brilliant grump) — “Sorry I’m late, someone called me fat in year three” may just be the most accurate dialogue about retroactive embarrassment and self-loathing I’ve heard all year — among Australia’s very un-diverse television landscape.\n\nDating in a world of Grindr, Scruff, Hornet and Tinder often feels like a sitcom. It is refreshing then to see it so expertly utilised here, mining laughs out of the changing face of sexuality (“I’m sick of sexuality being fluid. I miss the days when gays were gay, straights were straight, and bisexuals were lying”), casual meth addiction of upper-class gay men, racial dynamics (with a wonderful cameo by Mark Coles Smith) and youthful queer ignorance around HIV.\n\nThese are conversations many gay men have when around their friends, and like the US series Looking, there’s something to be said about seeing art reflect your real life when you’re so used to never seeing it shown at all. It has been quite something to see the way Please Like Me has developed over the years in terms of its gay content. Not since queer sci-fi nerd comedy Outland has a show so forcefully put its characters’ homosexuality to the foreground.\n\nThis lived-in comedy feel is the sort of thing that can only come with having surrounded yourselves with characters for four seasons. When Josh and Arnold’s relationship begins to deteriorate, it does so in ways that feel real and specific to the gay experience while simultaneously spotlighting the more universal truths of being in a broken relationship where even the most mundane of things can spark pettiness and resentment.\n\nNuances Of Grief And Illness\n\nOf course, funny seasons of TV shows come and go. But what has made this latest season of Please Like Me — potentially its last — work so well is its representation of mental illness. Portraying mental illness on film is fraught with difficulty, but the show has long come from a place of authority. The catalyst for the entire series were real-life events involving Josh Thomas’ mother’s attempted suicide, and Hannah Gadsby (who often addresses mental health problems through her comedy) frequently contributes written material for her character.\n\nThe show isn’t at all like Bojack Horseman, Crazy Ex-Girlfriend, Mr Robot or Lady Dynamite. It doesn’t have the benefit of genre or exaggerated comedy. It’s a show very firmly rooted in the everyday, which only makes its representation more impressive. Earlier this year, Vulture made a list of “What TV Gets Wrong About Mental Illness” including a lack of actual diagnosis and a tendency to excuse bad behaviour. Please Like Me avoids all the cliches. It’s always been nuanced and intelligent, never more so than this year.\n\nWith the very sudden death of Josh’s mother, Rose (the superb Debra Lawrance, leaving Pippa from Home & Away in the dust) in episode five, Please Like Me reached its peak and jolted the show back to a reality it is all too easy to become complacent of. Rose’s death emphasised the significance of mental health awareness and how we should never normalise its threats or shrug them off.\n\nIt’s a particularly potent message for TV, when the very real frailties of people can so easily be manipulated into cheap laughs. The “crazy cat lady” trope, for instance, is often applied as a comedic folly, and there have been scenes through Please Like Me’s run — like when Josh’s mum swung her grocery bags wildly at a stranger on the street — that would be played for laughs in a crasser TV show or film. But here they are building blocks — signifiers that hopefully open audience’s eyes to the very real struggles of people we see on the street and in the aisles of the supermarket.\n\nThe moment where Josh finds his mum slumped on the floor with a note in her hand, and the moments following it naturally bring to other ‘The Body’ from Buffy the Vampire Slayer and ‘A Different Planet’ from Love My Way. Not just for the narrative shock of a significant character’s sudden death, but also for the complexities that come with it.\n\nThe nuances of grief — Josh’s dad channelling his immediate sadness into cleaning out the refrigerator, the sparring repartee between his roommates Tom (Thomas Ward) and Ella (Emily Barclay) attempting to cheer him up, the honesty of Josh’s friend (Caitlin Stasey) who notes “I can think of literally nothing to say” blessedly in lieu of uncharacteristic and unrealistic therapeutic wisdom — were handled in a way unlike anything I have seen from most Australian television.\n\nThe final episodes of the season were works of rare beauty that I can only hope are discovered and celebrated as they should be. Special kudos must go to episode four, a stellar bottle episode involving Josh and his parents at a degustation dinner that saw Rose in a surprisingly chirpy mood. An episode that is even more powerful in retrospect as she attempts to say goodbye.\n\nThe show has always fallen on the side of gentle twentysomething observational comedy rather than the gutbusting, rapid-fire hilarity one might expect from a stand-up comedian, but season four truly outdid itself with its laughs before finally landing the emotional gut punch that it has always threatened to do.\n\n–\n\nIf you’d like to talk about any issues with your mental health and options getting help, you can reach Lifeline on 13 11 14, or beyondblue on 1300 22 4636.\n\n–\n\nThe fourth season of Please Like Me is now available to view on ABC iView. The earlier seasons are now on Netflix.\n\n–\n\nGlenn Dunks is a freelance writer from Melbourne. He also works as an editor and a film festival programmer while tweeting too much at @glenndunks.", "images": ["https://junkee.com/wp-content/uploads/2015/12/please1.jpg", "https://junkee.com/wp-content/uploads/2019/12/Blank-1024-x-683-2019-12-27T082331.412-1024x683.jpg", "https://junkee.com/wp-content/uploads/2020/04/Blank-1024-x-683-2020-04-17T112042.595-1024x683.png", "https://junkee.com/wp-content/uploads/2020/04/mainnutmeg-1024x683.jpg", "https://junkee.com/wp-content/uploads/2020/04/mainlowe-1024x683.jpg", "https://junkee.com/wp-content/uploads/2016/12/Screen-Shot-2016-12-15-at-5.22.51-PM.png", "https://junkee.com/wp-content/uploads/2020/04/Untitled-31-1024x683.jpg", "https://junkee.com/wp-content/uploads/2019/07/MoiraRose1-1024x683.jpg"], "top_img": "https://junkee.com/wp-content/uploads/2016/12/Screen-Shot-2016-12-15-at-5.22.51-PM.png", "keywords": [], "authors": ["Michelle Rennex", "Joseph Earp", "Patrick Lenton"], "canonical_link": "https://junkee.com/please-like-review-funniest-season-yet-much-wasnt/92284", "title": "‘Please Like Me’ Review: This Was The Funniest Season Yet (Until It Very Much Wasn’t)", "meta_data": {"HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black", "description": "The final three episodes were masterpieces of TV writing, whether they got credit for it or not.", "og": {"locale": "en_US", "type": "article", "title": "'Please Like Me' Review: This Was The Funniest Season Yet (Until It Very Much Wasn't)", "description": "The final three episodes were masterpieces of TV writing, whether they got credit for it or not.", "url": "https://junkee.com/please-like-review-funniest-season-yet-much-wasnt/92284", "site_name": "Junkee", "updated_time": "2017-03-31T03:54:39+00:00", "image": {"identifier": "https://junkee.com/wp-content/uploads/2016/12/Screen-Shot-2016-12-15-at-5.22.51-PM.png", "secure_url": "https://junkee.com/wp-content/uploads/2016/12/Screen-Shot-2016-12-15-at-5.22.51-PM.png", "width": 1024, "height": 684}}, "article": {"publisher": "https://www.facebook.com/junkeedotcom", "tag": "Season Four", "section": "TV", "published_time": "2016-12-15T06:28:59+00:00", "modified_time": "2017-03-31T03:54:39+00:00"}, "fb": {"app_id": 424599294371167, "pages": "341949582584179,75345812089,745352088973328,142820629111535,1411646472382846"}, "twitter": {"card": "summary_large_image", "description": "The final three episodes were masterpieces of TV writing, whether they got credit for it or not.", "title": "‘Please Like Me’ Review: This Was The Funniest Season Yet (Until It Very Much Wasn’t)", "site": "@junkeedotcom", "image": {"identifier": "https://junkee.com/wp-content/uploads/2016/12/Screen-Shot-2016-12-15-at-5.22.51-PM.png", "width": 1024, "height": 684}, "creator": "@junkeedotcom", "url": "https://junkee.com/please-like-review-funniest-season-yet-much-wasnt/92284"}, "msapplication-TileImage": "//junkee.com/wp-content/uploads/2016/11/cropped-junkee_site_logo_v2-270x270.jpg"}, "movies": ["https://www.youtube.com/embed/NGMhQnhMVpQ", "https://www.youtube.com/embed/HTg4zxi24Y0", "https://www.youtube.com/embed/96IeVJH3RKk"], "publish_date": 1481783339.0, "source": "https://junkee.com", "summary": ""}