{"url": "https://www.teenvogue.com/story/gigi-hadid-zayn-malik-celebrate-eid-with-zayn-family", "text": "It was a family celebration for Gigi Hadid and Zayn Malik this week, when they united with their loved ones to celebrate the Muslim festival of Eid.\n\nThe reported couple joined the entire Malik squad — including Zayn's mom, brother, and sister, Waliyha — to celebrate in the holy day, with Waliyah sharing some adorable pictures to Instagram of the intimate event. In one of the photos, Gigi is seen wearing an orange-and-black caftan over a pair of white pants, snuggling up to her boyfriend of two years. In another shot, Zayn receives a kiss on the cheek from his mom while throwing his arm over his sister's shoulder. Gigi's mom, Yolanda Hadid, shared the adorable photo of the couple to her story, too, which may mean that she was also in attendance.\n\nEid al-Adha, which took place on August 20–21, is also known as \"The Festival of Sacrifice\" or \"Big Eid,\" and it marks the end of the Hajj. It is one of the most important Muslim holidays of the year. Last year, Gigi and Zayn also celebrated the holiday with their families — including both of their moms.\n\nAs the daughter of an immigrant (her father, Mohamed Hadid, was born in Israel then lived in Syria and Lebanon before immigrating to the U.S. at age 14), Gigi has been outspoken about her pride in her Muslim roots. She appeared in a 2017 issue of Vogue Arabia wearing a hijab, and marched alongside her sister, Bella Hadid, at a New York City protest condemning Donald Trump's travel ban. In 2015, she posted an image of her hands covered in traditional mehndi to Instagram, captioning it “Half Palestinian & proud of it.\"\n\nZayn's family has roots in Pakistan, and he has been identified in the past by Britain's Evening Standard as \"the most high-profile British Muslim in the entertainment industry\" — something he is very proud of. “I take a great sense of pride — and responsibility — in knowing that I am the first of my kind, from my background,” he said of the accolade. “I’m not currently practicing, but I was raised in the Islamic faith, so it will always be with me, and I identify a lot with the culture. But I’m just me. I don’t want to be defined by my religion or my cultural background.”\n\nLet us slide into your DMs. Sign up for the Teen Vogue daily email.\n\nWant more from Teen Vogue? Check this out: Gigi Hadid and Halima Aden Are Sharing a September Cover for a Great Reason", "images": ["https://www.teenvogue.com/verso/static/teen-vogue/assets/logo-header.a32c5f649a1140996fd12f4a5ee1d0638ce23dc6.svg", "https://www.teenvogue.com/verso/static/teen-vogue/assets/logo-reverse.c9fd2ea81f6f84a7d604882e3d5f7ab119aeee5a.svg", "https://assets.teenvogue.com/photos/5b7f087dfb2ca45d0406b040/16:9/w_2560%2Cc_limit/shutterstock_8467905do.jpg", "https://assets.teenvogue.com/photos/5b7f087dfb2ca45d0406b040/16:9/w_1280,c_limit/shutterstock_8467905do.jpg", "https://assets.teenvogue.com/photos/5a15acadd3645b573a3dd49c/1:1/w_90%2Cc_limit/1474466652164.jpeg"], "top_img": "https://assets.teenvogue.com/photos/5b7f087dfb2ca45d0406b040/16:9/w_1280,c_limit/shutterstock_8467905do.jpg", "keywords": [], "authors": ["Zoë Weiner", "Zoë Weine"], "canonical_link": "https://www.teenvogue.com/story/gigi-hadid-zayn-malik-celebrate-eid-with-zayn-family", "title": "Gigi Hadid and Zayn Malik Celebrate Eid With Zayn's Family", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Zoë Weiner", "copyright": "Copyright (c) Condé Nast 2020", "description": "Model Gigi Hadid and \"Too Much\" singer Zayn Malik celebrated the Muslim holiday of Eid al-Adha with Zayn's family, and shared photos to Instagram of the event.", "id": "5b7f078c8d65c5660bb1f268", "keywords": "culture,gigi hadid,zayn malik", "news_keywords": "culture,gigi hadid,zayn malik", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5b7f078c8d65c5660bb1f268", "parsely-metadata": "{\"description\":\"Model Gigi Hadid and \\\"Too Much\\\" singer Zayn Malik celebrated the Muslim holiday of Eid al-Adha with Zayn's family, and shared photos to Instagram of the event.\",\"image-16-9\":\"https://assets.teenvogue.com/photos/5b7f087dfb2ca45d0406b040/16:9/w_1000,c_limit/shutterstock_8467905do.jpg\",\"image-1-1\":\"https://assets.teenvogue.com/photos/5b7f087dfb2ca45d0406b040/1:1/w_1000,c_limit/shutterstock_8467905do.jpg\"}", "og": {"description": "Their families shared sweet pics of the reported couple.", "image": "https://assets.teenvogue.com/photos/5b7f087dfb2ca45d0406b040/16:9/w_1280,c_limit/shutterstock_8467905do.jpg", "site_name": "Teen Vogue", "title": "See How Gigi Hadid and Zayn Malik Celebrated Eid", "type": "article", "url": "https://www.teenvogue.com/story/gigi-hadid-zayn-malik-celebrate-eid-with-zayn-family"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@TeenVogue", "description": "Their families shared sweet pics of the reported couple.", "domain": "https://www.teenvogue.com", "image": {"src": "https://assets.teenvogue.com/photos/5b7f087dfb2ca45d0406b040/16:9/w_1280,c_limit/shutterstock_8467905do.jpg?mbid=social_retweet"}, "site": "@TeenVogue", "title": "See How Gigi Hadid and Zayn Malik Celebrated Eid"}, "fb": {"app_id": 1013284322017473, "pages": 6636341311}}, "movies": [], "publish_date": null, "source": "https://www.teenvogue.com", "summary": ""}