{"url": "https://www.hollywoodreporter.com/live-feed/greys-anatomy-krista-vernoff-camilla-luddington-go-inside-timely-domestic-abuse-episode-1075810", "text": "The showrunner and star talk with THR about parallels to the sexual harassment \"reckoning\" happening in Hollywood and what's next for Jo.\n\n[This story contains spoilers from Thursday's \"1-800-799-7233\" episode of ABC's Grey's Anatomy.]\n\nIn an episode that could have been written post-Harvey Weinstein, ABC's Grey's Anatomy addressed domestic abuse during Thursday's episode in which Jo Wilson (Camilla Luddington) came face-to-face with her abusive and estranged husband Paul (Matthew Morrison, Glee).\n\nThe minute Paul arrives, many of Jo's colleagues are taken with his stature as a famous doctor. That is, until they learn that Jo was a victim of domestic abuse by the renowned surgeon. Meredith (Ellen Pompeo) instantly changes course and supports Jo, refusing to let her be alone in the same room when Paul and his new bride-to-be Jenny (guest star Bethany Joy Lenz, One Tree Hill) come calling with divorce papers.\n\nJo, realizing that she does not want another woman to suffer the same experience at Paul's hands, does her best to warn Jenny. However, she seems to believe the Paul's spin that Jo is crazy, as he attempted to discredit his estranged wife by calling her a party girl and alcoholic.\n\nAfter Paul learns of Jo's efforts to get to Jenny, he confronts — and scares the crap — out of Jo, who realizes he now knows where to find her and how to reach her. The episode ends when Paul is shockingly brought back to the hospital as a patient, the victim of a hit-and-run a day after Alex (Justin Chambers) and Jo both said that they wish he was dead.\n\nBelow, showrunner Krista Vernoff — who has been outspoken about what Hollywood can do to change its culture of sexual harassment — and star Camilla Luddington talk with THR about the timely storyline, Grey's star Ellen Pompeo's candid interview and what's next for Jo. Also worth noting: The phone number used for the title of Thursday's episode is for the National Domestic Violence Hotline (an idea that co-star Giacomo Gianniotti came up with), as Luddington filmed a PSA for the organization that aired at the end of the episode. Thursday's Grey's also featured an important transgender story in which new intern Casey disclosed some deeply personal information to Bailey. (Click here to read our exclusive interview with Vernoff and co-star Alex Blue Davis.)\n\nHow much of the domestic abuse storyline was plotted out before the season started? Did the sexual harassment \"reckoning\" that's happening across the country and in Hollywood play a role in this story at all?\n\nVernoff: This story was broken before #MeToo and before the Harvey Weinstein story came out. I don't know if I believe in coincidences but it's a fascinating moment of alchemy that these episodes are airing now. I came into this season knowing that we wanted to follow through on that story and that the show owed viewers that story.\n\nDo you think this episode serves as a parallel for what's happening in our society?\n\nLuddington: I do. It's amazing that the episode is airing right now because this storyline is about no longer feeling silent and about women finding the strength to use their voice to be heard, believed and feel empowered.\n\nAnd feeling empowered and using your voice expands into other areas, which Ellen Pompeo did this week in THR's cover story about fighting for the pay she felt she deserved.\n\nLuddington: I adore Ellen. I haven't read an interview in a long time that felt so honest. I appreciated her honesty and candor. Women like her are paving the way for asking what they're worth. We all should.\n\nVernoff: Like Ellen, I thought that story was gorgeous inside and out. What I loved about that story is that many actors, you meet them in life and read them in the press and it's two different people. This was like a conversation with Ellen — she brings her whole self, no filter, no falsehood.\n\nSpeaking of Pompeo, Meredith was instantly on Jo's side. Most women in Jo's position don't always get that kind of immediate support. Why was Meredith's response so important?\n\nVernoff: Meredith is the heart and soul of the show. And, in many ways, where Meredith goes, America goes too. When Meredith takes care of and believes Jo in this way, it is so powerfully moving that I find it hard to talk about. I think there is power in believing women and supporting women and holding women up and helping women through [sexual harassment]. Meredith Grey has an opportunity to teach and heal by just being who she is in this show and in the hearts and minds of the people who watch it.\n\nLuddington: That played out amazing. The moment where Jo is watching Paul manipulate people and he is so charming and confident and suggesting that Jo, in her past, had not been believed? He finds subtle ways to undermine her — saying that she was a party girl and alcoholic. In that moment when Jo runs out from the gallery and interrupts them, she didn't believe Meredith would believe her. They had a rocky relationship in the past. But it was this incredible moment for Jo when Meredith turns around and tells her, \"I know who you are.\" That's when Jo breaks down because I don't know how often — if ever — she's heard that.\n\nCamilla, what was it like shooting this episode for you?\n\nLuddington:I was anticipating shooting this episode for so long — it's been over a full season since Jo and viewers found out that she had an abusive ex-husband. I was nervous about the material because I felt the weight of it. [In preparing for the role], I was amazed at how many people have had this experience.\n\nHow did you prepare to portray Jo's reaction to being confronted by the man who abused her? You filmed a PSA for the National Domestic Violence Hotline at the end of this episode. Did you work with them on the story?\n\nLuddington: Krista went back and forth with them and we sat down as a collective to talk about it. It was very important to make sure that the details and words we used in the dialogue gave the right message. It was a constant conversation between all of us about what these experiences are like because I haven't been through it. We had constant conversations for over a season about what domestic abuse looks like and feels like and how it affects the rest of your life and future relationships.\n\nBy making Paul a highly respected doctor — Arizona (Jessica Capshaw) had serious hero worship going on before she knew about Jo's experience — and casting him with a well liked actor like Morrison, are you also making a statement that what's inside doesn't always match what's on the outside?\n\nVernoff: I can't take credit for casting Matthew Morrison but it was a stroke of genius on [casting director] Linda Lowy's part to cast him. He's so likeable and affable. It has been both my experience in life and my understanding that people who are abusive almost always have a different face that they present to the world. Very often, good-looking, affable white men get a pass and people don't think that they're the monster. I appreciated the opportunity to tell this story with an actor who doesn't seem like a bad guy on first sight.\n\nJo and Alex (Justin Chambers) both say at different points that they wish Paul was dead. What will surprise viewers about how his story ends?\n\nVernoff: We have a lot of fun building twists and turns on the show and it doesn't end how you think it will based on the end of this episode.\n\nLuddington: There are a lot of twists and turns that happen in the episode after this. I was very satisfied with how Krista wrapped it up.\n\nWhat do you hope viewers take away from this episode and storyline?\n\nVernoff: I hope they take away a deeper understanding and compassion for how people end up in abusive relationships and how difficult it can be to get out of them. I hope they take away a commitment to help their friends — male and female — out of abusive relationships. I hope they take away a desire to help themselves out of any abusive relationship that they're in. That they feel seen because so many people feel so alone when they're living in this kind of abuse.\n\nLuddington: We hope this storyline helps educate people about what domestic abuse is, what it looks like and brings awareness and a voice to it.\n\nIn terms of Jo's storyline, how will this experience change her going forward?\n\nLuddington: It's finally going to hopefully be a weight lifted off her shoulders. She has navigated through her life always looking over her shoulder and she can now be at peace with herself and feel free. That's what I've hoped for her since season nine when we revealed her past. It's been a long time coming for the character. Jo will let go and walk through some of the pain of her past that she, until now, had held back and not wanted to address. Filing for divorce was a step in the right direction. She's going to feel some relief.\n\nBrooke Stadler is Jo's real name. Will she go back to Brooke? Keep Jo? Take Karev's name if they get married?\n\nLuddington: I've had this discussion with the writers. I wondered if she'd take Brooke back or keep Jo Wilson. What would happen one day down the road if she and Alex get married? I don't know what the writers have in store but personally I think Jo Karev has a nice ring to it! She's never had family and taking the name of someone she loves would represent family to her. We don't see many doctors on our show taking their spouse's names. We'll see!\n\nWhat did you think about Jo's domestic abuse storyline? Sound off in the comments, below. Grey's Anatomy airs Thursdays at 8 p.m. on ABC.", "images": ["https://cdn1.thr.com/sites/default/files/2018/01/greys_anatomy_s14e09_still.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/01/greg_berlanti_sharon_horgan_alex_kurtzman_and_dwayne_johnson_-_getty_-_h_2020.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/04/lesley_goldberg_0.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/03/mrs._america_-_publicity_still_1-_h_2020_.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/blogicon_livefeed-black2.png", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2018/01/greys_anatomy_s14e09_still.jpg"], "top_img": "https://cdn1.thr.com/sites/default/files/2018/01/greys_anatomy_s14e09_still.jpg", "keywords": [], "authors": ["Lesley Goldberg", "Lesley.Goldberg Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/live-feed/greys-anatomy-krista-vernoff-camilla-luddington-go-inside-timely-domestic-abuse-episode-1075810", "title": "'Grey's Anatomy': Krista Vernoff and Camilla Luddington Go Inside Timely Domestic Abuse Episode", "meta_data": {"viewport": "width=device-width", "description": "The showrunner and star talk with THR about parallels to the sexual harassment \"reckoning\" happening in Hollywood and what's next for Jo.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/live-feed/greys-anatomy-krista-vernoff-camilla-luddington-go-inside-timely-domestic-abuse-episode-1075810", "domain": "https://www.hollywoodreporter.com/", "title": "'Grey's Anatomy': Krista Vernoff and Camilla Luddington Go Inside Timely Domestic Abuse Episode", "description": "The showrunner and star talk with THR about parallels to the sexual harassment \"reckoning\" happening in Hollywood and what's next for Jo.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2018/01/greys_anatomy_s14e09_still.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "'Grey's Anatomy': Krista Vernoff and Camilla Luddington Go Inside Timely Domestic Abuse Episode", "description": "The showrunner and star talk with THR about parallels to the sexual harassment \"reckoning\" happening in Hollywood and what's next for Jo.", "url": "https://www.hollywoodreporter.com/live-feed/greys-anatomy-krista-vernoff-camilla-luddington-go-inside-timely-domestic-abuse-episode-1075810", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2018/01/greys_anatomy_s14e09_still.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "'Grey's Anatomy': Krista Vernoff and Camilla Luddington Go Inside Timely Domestic Abuse Episode", "sailthru.description": "The showrunner and star talk with THR about parallels to the sexual harassment \"reckoning\" happening in Hollywood and what's next for Jo.", "sailthru.author": "Lesley Goldberg", "sailthru.channel": "Live Feed", "sailthru.vertical": "Live Feed", "sailthru.date": "2018-01-18 18:00:00", "sailthru.tags": "Live Feed, Television, Grey&#39;s Anatomy"}, "movies": [], "publish_date": 1516269600.0, "source": "https://www.hollywoodreporter.com", "summary": ""}