{"url": "https://en.wikipedia.org/wiki/Kim_Zolciak-Biermann", "text": "American television personality\n\nKimberleigh Marie Zolciak-Biermann (born May 19, 1978)[1][2] is an American television personality and singer. In 2008, she rose to prominence as one of the original housewives that appeared on the reality television series The Real Housewives of Atlanta aired on Bravo.\n\nZolciak-Biermann left The Real Housewives of Atlanta in 2012 during the fifth season of the series. Earlier that year, she received her own spin-off show titled Don't Be Tardy for the Wedding, which focused on the preparation of her wedding to football player Kroy Biermann. The series was subsequently renewed for a second season with a shortened title, Don't Be Tardy. The fourth season of the show premiered on August 16, 2015. In 2015, she was one of the contestants of the 21st season of the dancing competition series Dancing with the Stars.\n\nEarly life\n\nKim Zolciak was born in Pensacola, Florida, to a military family, and grew up in Windsor Locks, Connecticut.[3] Her parents are Joseph and Karen, and she has a brother named Michael.[4] She is of Polish and Italian descent and was raised Roman Catholic.[5]\n\nAt age 17,[3] Zolciak had an affair with a Windsor Locks police sergeant who had interviewed her as a material witness in a criminal investigation, initially resulting in the officer's firing.[6] The termination was later changed to a 45-day suspension without pay.[7][8] She graduated from East Catholic High School in Manchester, Connecticut in 1996, and studied nursing at the University of Connecticut.[3] At 21, she moved to Atlanta, Georgia, where her parents had moved, and eventually settled in the suburb of Johns Creek.[3]\n\nCareer\n\nEntertainment\n\nZolciak-Biermann first appeared on the reality television series The Real Housewives of Atlanta, airing on Bravo, on October 7, 2008. Between seasons four and five, Zolciak and her then fiancé were the subject of a spinoff show, Don't Be Tardy for the Wedding, chronicling Zolciak's wedding preparations. Zolciak left Real Housewives in the middle of the fifth season, with her final episode airing December 9, 2012.[9] Don't Be Tardy for the Wedding, later renamed to Don't Be Tardy..., is in its fifth season as of 2016. Zolciak-Biermann returned to 'Real Housewives' for its tenth season in a recurring capacity.\n\nZolciak-Biermann was scheduled to star in a new reality show on Bravo with fellow The Real Housewives cast member, NeNe Leakes, called NeNe and Kim: The Road to Riches.[10] However, the network later decided not to move forward with the show.[11]\n\nZolciak-Biermann competed on the 21st season of the dancing competition show Dancing with the Stars. She was paired with professional dancer Tony Dovolani.[12] She withdrew in September 2015, three weeks into the competition, because of a transient ischemic attack, which prevented her from air travel.[13][14]\n\nMusical career\n\nIn 2008 Zolciak began work on a country music album. She released a debut single, the dance track \"Tardy for the Party,\" in 2009, followed by a remix EP the following year.\n\nOn March 12, 2013, Zolciak's Real Housewives of Atlanta castmate, Kandi Burruss, and her collaborating songwriter/producer, Rodney \"Don Vito\" Richard, filed suit against Zolciak for profits earned from \"Tardy for the Party\". In the documents filed, Burruss' attorney, RHOA castmate Phaedra Parks, alleges her clients wrote the song for Zolciak and that Zolciak released and sold the single \"without [the] plaintiffs' authorization, license or consent.\" Burruss was also seeking a temporary restraining order to prevent future sales of the song and the \"destruction of all copies of the infringing single and any other product of defendant's that infringe plaintiffs' copyrights\", punitive damages, attorney's fees, and a jury trial.[15]\n\nBusiness\n\nIn May 2016, Zolciak-Biermann launched a line of skin-care products called Kashmere Kollection.[16][17] Later in 2016, Zolciak began working on a perfume, also called Kashmere.[18]\n\nPersonal life\n\nZolciak has two daughters from previous relationships,[19] Brielle Karenna (born February 25, 1997) and Ariana Lenee (born October 17, 2001). She was married to Daniel Toce from 2001 to 2003.[19]\n\nZolciak is bisexual and has publicly stated that she and DJ Tracy Young were in a romantic relationship.[20]\n\nIn May 2010, Zolciak met Atlanta Falcons football player Kroy Biermann at the charity event Dancing with Atlanta Stars. Their meeting was later shown on season three of The Real Housewives of Atlanta. The couple wed at their Roswell, Georgia, home[21] on November 11, 2011.[22] They have four children together: Kroy Jagger \"KJ\" (born May 31, 2011),[23] Kash Kade (born August 15, 2012),[24] and twins Kaia Rose and Kane Ren (born November 25, 2013).[25]\n\nIn March 2013, Biermann filed to adopt Zolciak's daughters.[26] In July 2013, the adoption became final and the girls subsequently changed their last names to become Brielle Biermann and Ariana Biermann.[27]\n\nDiscography\n\nSingles\n\nYear Single 2009 \"Tardy for the Party\" 2011 \"Google Me\" 2012 \"Love Me First\" 2018 \"Wig (Wish I Gave a S**t)\"\n\nReferences\n\n\n\n", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/24px-Blank_television_set.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/24px-Flag_of_the_United_States.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Kim_Zolciak_and_Allison_DeMarcus.jpg/1200px-Kim_Zolciak_and_Allison_DeMarcus.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Kim_Zolciak_and_Allison_DeMarcus.jpg/220px-Kim_Zolciak_and_Allison_DeMarcus.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Audio_a.svg/24px-Audio_a.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/BathingSuit1920s.jpg/24px-BathingSuit1920s.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/fd/Portal-puzzle.svg/24px-Portal-puzzle.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Kim_Zolciak_and_Allison_DeMarcus.jpg/1200px-Kim_Zolciak_and_Allison_DeMarcus.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Kim_Zolciak-Biermann", "title": "Kim Zolciak-Biermann", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Kim_Zolciak_and_Allison_DeMarcus.jpg/1200px-Kim_Zolciak_and_Allison_DeMarcus.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}