{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/shannen-doherty-net-worth/", "text": "Shannen Doherty Net Worth and Salary: Shannen Doherty is an American actress, producer, director and author who has a net worth of $5 million. She is best known for her roles as Heather Duke in Heathers (1988), Brenda Walsh in Beverly Hills, 90210 (1990–1994) and Prue Halliwell in Charmed (1998–2001).\n\nEarly Life: Shannen Maria Doherty was born in Memphis, Tennessee on April 12, 1971. Her mother, Rosa, was a beauty parlor operator and her father Tom, a mortgage consultant. She was raised Southern Baptist. She has Irish, English, and Scottish ancestry.\n\nCareer: Doherty started acting as a child. In 1982, she had guest spots on Voyagers! and Father Murphy, which was created and produced by Michael Landon. That same year, she was cast in the recurring role of Jenny Wilder on Little House on the Prairie, which, of course, Landon starred in and produced. She appeared in all but four episodes of the final season of Little House on the Prairie. Also in 1982, she did voice-over work for the animated movie The Secret of NIMH. In 1985, she starred as Maggie Malone in the teen comedy film Girls Just Want to Have Fun alongside Helen Hunt and Sarah Jessica Parker. Doherty was cast as Kris Witherspoon, the oldest sibling on the drama Our House, which ran from 1986 to 1988. She was nominated for several Young Artist Awards for this role. She appeared in an episode of Magnum P.I. as well as an early episode of Airwolf, for which she was nominated as Best Young Artist: Guest in a Series at the 1984 Youth in Film Awards.\n\nDoherty's first major film role was as Heather Duke in Heathers, which was released in 1988. In 1990 she, along with the rest of the cast, achieved international fame for her role in Beverly Hills 90210. She played Brenda Walsh, a newcomer to Beverly Hills with her brother Brandon Walsh, played by Jason Priestly. In 1991 and 1992 her portrayal of Brenda earned her a Young Artist Award nomination for Best Young Actress Starring in a Television Series. She left Beverly Hills, 90210 in 1994, at the conclusion of the fourth season.\n\nAfter leaving Beverly Hills, 90210, Shannen appeared in a number of made-for-TV movies. She had a starring role in Kevin Smith's 1995 film Mallrats. She also had a cameo in Smith's Jay and Silent Bob Strike Back. In 1998, Doherty was cast in Charmed, a story about three sisters who happen to be witches. She played Prue Halliwell, the oldest of the sisters. Doherty directed a few episodes of the series during the second and third seasons. She left Charmed in 2001 at the end of the third season. Her character was killed off. Doherty was also twice nominated, in 1999 and 2000, for the Saturn Award, Best Genre TV Actress, for her performance in Charmed.\n\nIn 2003, Doherty hosted the candid-camera show Scare Tactics on the Sci-Fi Channel. She was a series regular on North Shore in 2004 and 2005. In 2006, she produced and starred in her own reality show, Breaking Up with Shannen Doherty. The Oxygen network show featured Doherty helping members of the public dump their boyfriends or telling people what their friends really think about them. The show was canceled after one season due to poor ratings.\n\nIn 2008, 14 years since last playing Brenda Walsh, Doherty joined the cast of the Beverly Hills 90210 spin-off 90210. She was a recurring guest star in the new series and appeared in seven episodes. Brenda Walsh was a successful theater actress and stage director and returned to her old high school as the guest director of the high school musical.\n\nOn March 1, 2010, it was announced that Doherty would be a celebrity contestant on the 10th season of Dancing with the Stars. She was partnered with two-time champion Mark Ballas for the season which premiered on March 22, 2010. Doherty and Ballas were the first couple eliminated during the second week of the season.\n\nDoherty once more reprised her role of Brenda Walsh for the six-episode sequel BH 90210, which debuted August 7, 2019 on Fox.\n\nPersonal Life: In early 1993, Doherty was briefly engaged to Max Factor heir Dean Jay Factor. He filed a restraining order against her on May 25, 1993 alleging physical violence and threats from Doherty. Shannen's father claimed Factor was the one abusing Shannen, not the other way around.\n\nShe married Ashley Hamilton, the son of actor George Hamilton on October 11, 1993. They filed for divorce in April 1994.\n\nIn 2002, Doherty married Rick Salomon, former husband (twice) of Pamela Anderson. Their marriage was annulled after nine months.\n\nShannen married photographer Kurt Iswarienko on October 15, 2011 in Malibu, California.\n\nStarting with her role on Beverly Hills, 90210, Doherty had a reputation in the media for bad behavior that dominated her public image for many years. People Magazine called her the \"iconic Hollywood bad girl of the 90s.\" She had a reputation for heavy partying, on-set lateness, physical fights, and a heated feud with her Beverly Hills, 90210 co-star Jennie Garth. During her time on Charmed, her bad reputation continued to grow. Rumors of a feud with co-star Alyssa Milano is said to have fueled her exit from the show. Rumor has it Doherty was fired by Aaron Spelling after an ultimatum from Milano. Doherty left both Beverly Hills, 90210 and Charmed acrimoniously.\n\nHealth: In March 2015, Doherty was diagnosed with breast cancer that had spread to her lymph nodes. In February 2016, she revealed that she was receiving anti-estrogen treatment to shrink the tumor in the hopes that she could have a lumpectomy rather than a mastectomy. This wasn't possible and a single mastectomy was performed in May 2016. Surgery revealed that the cancer cells may have spread beyond the lymph nodes and she underwent chemotherapy and radiation following surgery. On April 29, 2017, Doherty announced that her cancer was in remission.\n\nOn February 4, 2020, Doherty announced that her cancer had returned a year earlier and she has stage four breast cancer.\n\nSalary Highlights: In the early days of Beverly Hills, 90210, Doherty made $17,500 per episode. For Charmed, she made $75,000 per episode. When she was cast in the 2008 reboot 90201, she made $40,000 – $50,000 per episode.\n\nReal Estate: In 2004, Doherty purchased a 3,410 square foot home in Malibu for $2.56 million. The home was built in 1976 and has five bedrooms, 4 1/2 baths, ocean views, a pool, and a spa. She listed the home for sale in May 2008 for $4.4 million.", "images": ["https://vz.cnwimg.com/wp-content/uploads/2010/03/Shannen-Doherty.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://googleads.g.doubleclick.net/pagead/viewthroughconversion/1057081139/?value=0&guid=ON&script=0", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2010/03/Shannen-Doherty.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/shannen-doherty-net-worth/", "title": "Shannen Doherty Net Worth", "meta_data": {"description": "Shannen Doherty Net Worth and Salary: Shannen Doherty is an American actress, producer, director and author who has a net worth of", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "cnw_share_fb_count": 35, "cnw_share_tw_count": 11, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Shannen Doherty Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/shannen-doherty-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/03/Shannen-Doherty.jpg", "site_name": "Celebrity Net Worth", "description": "Shannen Doherty Net Worth and Salary: Shannen Doherty is an American actress, producer, director and author who has a net worth of"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2020-02-04T22:08:45+00:00", "published_time": "2019-12-03T18:36:50+00:00", "section": "Actors", "tag": "Shannen Doherty salary"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/03/Shannen-Doherty.jpg", "title": "Shannen Doherty Net Worth", "description": "Shannen Doherty Net Worth and Salary: Shannen Doherty is an American actress, producer, director and author who has a net worth of"}}, "movies": [], "publish_date": 1575398210.0, "source": "https://www.celebritynetworth.com", "summary": ""}