{"url": "https://www.independent.co.uk/news/people/angelina-jolie-brad-pitt-divorce-relationship-quotes-moments-why-everyone-cares-a7319171.html", "text": "Angelina Jolie and Brad Pitt, the ultimate Hollywood power couple, are set to divorce after two years of marriage and a ten-year relationship.\n\nAs one of the most closely scrutinised high-profile relationships in recent time, speculation and interest in the couple developed from the onset when they appeared to begin dating shortly after Pitt’s separation from Jennifer Aniston.\n\nSo began the pitting of Aniston against Jolie, with ‘Team Jen’ and ‘Team Ange’ formed, while Aniston endured being asked about her divorce a decade after it happened. 'Brangelina' soon won a legion of fans who heralded their “true love” often because they spoke about each other openly, fondly and lovingly.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nBelow are some of their most memorable quotes:\n\nAngelina Jolie:\n\n“I think it's a reality of marriage that you go through hard times and that you have to embrace those hard times and challenges and know that it's a part of your marriage and it’s the pulling through together that actually makes the bond.” BBC News, 2015.\n\n“[Brad] has expanded my life in ways I never imagined. We built a family. He is not just the love my life, he is my family. I hold that very dear.” Marie Claire, 2012\n\nShape Created with Sketch. Angelina Jolie and Brad Pitt In Quotes Show all 6 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Angelina Jolie and Brad Pitt In Quotes 1/6 “I think it's a reality of marriage that you go through hard times and that you have to embrace those hard times and challenges and know that it's a part of your marriage and it’s the pulling through together that actually makes the bond.” - Jolie AFP/Getty Images 2/6 “There's a more profound feeling when I look back at all the things my wife and I have gone through; all the successes and failures and great passions and great fights and that we have that together is something I can’t quite get my arms around but, to me, it’s much more enticing than the newness of relationships.” - Pitt Getty 3/6 “[Brad] has expanded my life in ways I never imagined. We built a family. He is not just the love my life, he is my family. I hold that very dear.” - Jolie Getty Images 4/6 “One of the greatest, smartest things I ever did was give my kids Angie as their mom.” - Pitt Getty Images for Cinema for Peac 5/6 “You get together and you're two individuals and you feel inspired by each other, you challenge each other, you complement each other, drive each other beautifully crazy.' - Jolie Getty Images 6/6 There are no secrets at our house. We tell the kids, 'Mom and Dad are going off to kiss.' They go, 'Eww, gross!' But we demand it\" - Pitt Getty Images 1/6 “I think it's a reality of marriage that you go through hard times and that you have to embrace those hard times and challenges and know that it's a part of your marriage and it’s the pulling through together that actually makes the bond.” - Jolie AFP/Getty Images 2/6 “There's a more profound feeling when I look back at all the things my wife and I have gone through; all the successes and failures and great passions and great fights and that we have that together is something I can’t quite get my arms around but, to me, it’s much more enticing than the newness of relationships.” - Pitt Getty 3/6 “[Brad] has expanded my life in ways I never imagined. We built a family. He is not just the love my life, he is my family. I hold that very dear.” - Jolie Getty Images 4/6 “One of the greatest, smartest things I ever did was give my kids Angie as their mom.” - Pitt Getty Images for Cinema for Peac 5/6 “You get together and you're two individuals and you feel inspired by each other, you challenge each other, you complement each other, drive each other beautifully crazy.' - Jolie Getty Images 6/6 There are no secrets at our house. We tell the kids, 'Mom and Dad are going off to kiss.' They go, 'Eww, gross!' But we demand it\" - Pitt Getty Images\n\n'I don't have a lot of friends I talk to. He is really the only person I talk to.’ Marie Claire\n\n“You get together and you're two individuals and you feel inspired by each other, you challenge each other, you complement each other, drive each other beautifully crazy.” Elle, 2014\n\nBrad Pitt:\n\n“There's a more profound feeling when I look back at all the things my wife and I have gone through; all the successes and failures and great passions and great fights and that we have that together is something I can’t quite get my arms around but, to me, it’s much more enticing than the newness of relationships.” BBC News, 2015\n\n‘We know each other so well, just one gaze from her and I know, I f***d up this scene.” Glamour Germany\n\n‘There are no secrets at our house. We tell the kids, 'Mom and Dad are going off to kiss.' They go, 'Eww, gross!' But we demand it.” USA Weekend, 2011\n\n“One of the greatest, smartest things I ever did was give my kids Angie as their mom.” Parade, 2011\n\nDaily coronavirus briefing No hype, just the advice and analysis you need Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\n“I get up some mornings and gasp,” E! News, 2008", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2016/09/20/17/angelina-brad.jpg", "https://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2016/09/20/17/angelina-brad.jpg", "keywords": [], "authors": ["Olivia Blair"], "canonical_link": "https://www.independent.co.uk/news/people/angelina-jolie-brad-pitt-divorce-relationship-quotes-moments-why-everyone-cares-a7319171.html", "title": "Angelina Jolie and Brad Pitt divorce: The nine quotes that defined their relationship", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "http://www.independent.co.uk/news/people/angelina-jolie-brad-pitt-divorce-relationship-quotes-moments-why-everyone-cares-a7319171.html", "title": "The quotes that proved Angelina Jolie and Brad Pitt were one of Hollywood’s most open couples", "description": "The couple have announced their divorce", "updated_time": "2016-09-20T18:06:24+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2016/09/20/17/angelina-brad.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/7319171"}, "description": "Angelina Jolie and Brad Pitt, the ultimate Hollywood power couple, are set to divorce after two years of marriage and a ten-year relationship.", "keywords": "Angelina Jolie, Brad Pitt, People, News", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Angelina Jolie", "published_time": "2016-09-20T17:30:00+01:00", "modified_time": "2016-09-20T18:06:24+01:00", "section": "People", "author_name": "Olivia Blair", "content_type": "story", "word_count": 456, "image_count": 2, "video_count": 0, "embed_count": 0, "internal_link_count": 8, "external_link_count": 3}, "twitter": {"title": "The quotes that proved Angelina Jolie and Brad Pitt were one of Holl…", "description": "Angelina Jolie and Brad Pitt, the ultimate Hollywood power couple, are set to divorce after two years of marriage and a ten-year relationship.", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1474389000.0, "source": "https://www.independent.co.uk", "summary": ""}