{"url": "https://variety.com/2018/tv/news/scandal-good-people-katie-lowes-quinns-fate-rowan-robin-1202676635/", "text": "SPOILER ALERT: Do not read if you have not yet watched the Jan. 25 episode of “Scandal” entitled “Good People.”\n\nAfter an episode (“Robin”) that saw Olivia Pope (Kerry Washington) and QPA mourning the loss of Quinn (Katie Lowes), “Scandal” finally flashed back to show exactly what she went through after she walked into her office in her white dress on the day of her wedding, only to never be seen by her friends and co-workers again. It turned out Rowan (Joe Morton) didn’t shoot her after all.\n\n“I knew Quinn wasn’t dead, and it was kind of special and amazing and emotional to get an episode like [‘Robin’] where I just got to see those flashback moments of Quinn to see how she’s grown and changed in the last seven years,” Lowes tells Variety. “It was really rewarding in a sick way.”\n\nSince Lowes actually was pregnant during production, the show shot episodes out of order with “Good People” going ahead of “Robin” so that she could “go off and have [her] baby.” Knowing the true fate of her character didn’t make shooting the episode completely easy, though.\n\n“I remember coming into the first day of the episode and talking to the director and saying, ‘How the hell am I going to do this?’ It’s my life, it’s my baby’s life, it’s my wedding day. I’m actually nine and a half months pregnant [in real life]. And she was amazing and such a leader,” Lowes says of Nzingha Stewart. “What was great about her is that she’s a director that doesn’t take a billion takes, so I knew I could really go balls to the wall and leave it all on the dance floor three to five times but not have to do it 30 times.”\n\n“Good People” revealed Rowan kept Quinn in a bunker, where she pleaded for her life, clutching her pregnant stomach and saying that in B613 it was supposed to be “mothers and children first, that’s the rule” — but then railed against Rowan for his inability to see that Olivia would never trade and that doomed both her and her unborn daughter.\n\n“The stakes couldn’t be higher,” Lowes says of “Good People.”\n\nWhen Olivia showed up at Rowan’s and the father-daughter duo engaged in a standoff over the fact that he should shoot her but couldn’t, Quinn used a hairpin to unshackle her handcuffs. She was able to surprise Rowan when he came down to the bunker, and she attacked him — and this time when she begged him not to kill her until after her baby was born, it turned out that “mother and children first” reminder sunk in.\n\nGetting so physical while pregnant was “horrifying” at first for Lowes, but when it came to the day of shooting the actual scene, she shares she felt “very well taken care of.”\n\n“We had a medic on set at all times [and] we had an OB on set who was instructing me on how to do everything really safely, which was incredible,” Lowes says. “We had our stunt coordinator — I had a stunt double — and we took things really slow. I felt very safe.”\n\nShortly after the fake shooting, Quinn went into labor and had the baby with a little help from Rowan, his salesman friend who was previously a war medic, as well assome hallucinations of her friends.\n\n“The craziest part of the episode was me actually being nine and a half months pregnant with a blanket over my knees, and they put a real baby in between my legs and pulled the baby out like it was really happening. And I was like, ‘Oh my God, guys, this is going to really be happening to me in a few weeks!'” Lowes says. “They had a real baby and a fake baby — the real baby so they could get a cry and the fake was covered in grape jelly and cottage cheese. But that’s how they make it look like a baby was just born.”\n\nThe new mother and daughter moved into Liv’s old room in Rowan’s house to lay low and allow Olivia to continue to believe she was dead — so she wouldn’t come looking for her to actually kill her.\n\n“Nzingha was very much [about] finding moments where — especially when the baby comes and he had bought all of the clothes for her — Quinn is filling this huge void for Papa Pope,” Lowes says. “And similarly, Quinn didn’t have a father either. And then they are so allied in the end in that they both followed the B613 rules, which is that they put a woman and pregnancy before anything else.”\n\nLowes says Rowan and Quinn are now bonded because they “definitely need each other at the moment,” and subsequent episodes of “Scandal” will dive into how that plays out. Last the show left Rowan in present day, Charlie (George Newbern) was attacking him over the baby he found in his house, demanding to know whose it was. Lowes says the eventual family reunion between Charlie and Quinn is “not what you’d expect” — not even for “Scandal.”\n\nAs for whether or not Quinn and Rowan will work together to try to take down Olivia, and soon bring Charlie into that fold, Lowes would only say “all the loyalties and family dynamics” would unfold soon. “I don’t think it’s like one we’ve seen on television before,” she says.\n\nBut while Quinn was once super loyal to Olivia and in many ways was even “waiting around for her to save” her while she was down in that bunker, after overhearing Olivia allow her and her baby’s murder, her feelings toward her former mentor are “very complicated.”\n\n“It’s very hard for her to wrap her head around the fact that Olivia’s responsible for blowing up the plane with that young girl on it. I think it’s very hard for her to admit that the Olivia she knows and loves is not here right now,” Lowes says. “I think the line is, ‘Olivia’s a bitch’ and I think that’s way too light, honestly. I love the moment because how do you find the words to describe someone that is responsible for killing you and your unborn child and being fine for it for the Republic? I don’t know how a relationship comes back from it, I really don’t.”\n\nEven after such an emotional fake-out death episode, Lowes doesn’t have strong feelings about whether or not Quinn survives the series, which is ramping up for its finale in April.\n\n“I’ve been such a cog in this huge wheel for seven years, and I’m just very used to Shonda making the best decisions for the characters,” Lowes says. “I know Quinn is mine, but she’s also hers, and I just feel like whatever she wants for her is what I will come to terms with.”\n\n“Scandal” airs on Thursdays at 9 p.m. on ABC.", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://pmcvariety.files.wordpress.com/2018/01/147507_5204.jpg?w=1024", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Ftv%2Fnews%2Fscandal-good-people-katie-lowes-quinns-fate-rowan-robin-1202676635%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202676635&comment_count=5", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2018/01/147507_5204.jpg?w=1024", "keywords": [], "authors": ["Danielle Turchiano"], "canonical_link": "https://variety.com/2018/tv/news/scandal-good-people-katie-lowes-quinns-fate-rowan-robin-1202676635/", "title": "‘Scandal’ Star Katie Lowes on What Really Happened to Quinn: ‘The Stakes Couldn’t Be Higher’", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Katie Lowes talks about filming \"Scandal\" while being nine months pregnant &amp; what happened to Quinn when she went missing on her wedding day", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202676635, "author": "Danielle Turchiano", "pmc-category": "Features,News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-01-25T19:00:30"}, "pmc-tag": "Katie Lowes,Scandal", "title": "‘Scandal’ Star Katie Lowes on What Really Happened to Quinn: ‘The Stakes Couldn’t Be Higher’", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "Features", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "‘Scandal’ Star Katie Lowes on What Really Happened to Quinn: ‘The Stakes Couldn’t Be Higher’", "url": "https://variety.com/2018/tv/news/scandal-good-people-katie-lowes-quinns-fate-rowan-robin-1202676635/", "description": "SPOILER ALERT: Do not read if you have not yet watched the Jan. 25 episode of “Scandal” entitled “Good People.” After an episode (“Robin”) that saw Olivia Pope (…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/01/147507_5204.jpg?w=1024", "width": 1200, "height": 802, "alt": "SCANDAL - \"Good People\" - The harrowing events that transpired in Rowan's basement are revealed, from the moment Quinn was kidnapped to the earth-shattering gunshot that rocked Olivia to her core, on \"Scandal,\" airing THURSDAY, JAN. 25 (9:00-10:00 p.m. EST), on The ABC Television Network. (ABC/Eric McCandless)KATIE LOWES"}, "locale": "en_US"}, "article": {"published_time": "2018-01-26T03:00:30+00:00", "modified_time": "2018-01-26T03:02:41+00:00"}, "twitter": {"creator": "@https://twitter.com/danielletbd", "site": "@variety", "text": {"title": "‘Scandal’ Star Katie Lowes on What Really Happened to Quinn: ‘The Stakes Couldn’t Be Higher’"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/01/147507_5204.jpg?w=1024", "alt": "SCANDAL - \"Good People\" - The harrowing events that transpired in Rowan's basement are revealed, from the moment Quinn was kidnapped to the earth-shattering gunshot that rocked Olivia to her core, on \"Scandal,\" airing THURSDAY, JAN. 25 (9:00-10:00 p.m. EST), on The ABC Television Network. (ABC/Eric McCandless)KATIE LOWES"}, "card": "summary_large_image", "title": "‘Scandal’ Star Katie Lowes on What Really Happened to Quinn: ‘The Stakes Couldn’t Be Higher’", "description": "Katie Lowes talks about filming \"Scandal\" while being nine months pregnant & what happened to Quinn when she went missing on her wedding day"}, "author": "Danielle Turchiano", "content_type": "Article", "post_id": 1202676635, "title": "'Scandal' Star Katie Lowes on What Really Happened to Quinn: 'The Stakes Couldn't Be Higher'", "published_at": "2018-01-25 19:00:30", "image": "https://pmcvariety.files.wordpress.com/2018/01/147507_5204.jpg?w=1024", "comment_count": 5, "tags": "Scandal", "topics": "News", "appeared_in_print": "No", "body": "SPOILER ALERT: Do not read if you have not yet watched the Jan. 25 episode of \"Scandal\" entitled \"Good People.\"\r\n\r\nAfter an episode (\"Robin\") that saw Olivia Pope (Kerry Washington) and QPA mourning the loss of Quinn (Katie Lowes), \"Scandal\" finally flashed back to show exactly what she went through after she walked into her office in her white dress on the day of her wedding, only to never be seen by her friends and co-workers again. It turned out Rowan (Joe Morton) didn't shoot her after all.\r\n\r\n\"I knew Quinn wasn't dead, and it was kind of special and amazing and emotional to get an episode like ['Robin'] where I just got to see those flashback moments of Quinn to see how she's grown and changed in the last seven years,\" Lowes tells Variety. \"It was really rewarding in a sick way.\"\r\n\r\nSince Lowes actually was pregnant during production, the show shot episodes out of order with \"Good People\" going ahead of \"Robin\" so that she could \"go off and have [her] baby.\" Knowing the true fate of her character didn't make shooting the episode completely easy, though.\r\n\r\n\"I remember coming into the first day of the episode and talking to the director and saying, 'How the hell am I going to do this?' It's my life, it's my baby's life, it's my wedding day. I'm actually nine and a half months pregnant [in real life]. And she was amazing and such a leader,\" Lowes says of Nzingha Stewart. \"What was great about her is that she's a director that doesn't take a billion takes, so I knew I could really go balls to the wall and leave it all on the dance floor three to five times but not have to do it 30 times.\"\r\n\r\n\"Good People\" revealed Rowan kept Quinn in a bunker, where she pleaded for her life, clutching her pregnant stomach and saying that in B613 it was supposed to be \"mothers and children first, that's the rule\" — but then railed against Rowan for his inability to see that Olivia would never trade and that doomed both her and her unborn daughter.\r\n\r\n\"The stakes couldn't be higher,\" Lowes says of \"Good People.\"\r\n\r\nWhen Olivia showed up at Rowan's and the father-daughter duo engaged in a standoff over the fact that he should shoot her but couldn't, Quinn used a hairpin to unshackle her handcuffs. She was able to surprise Rowan when he came down to the bunker, and she attacked him — and this time when she begged him not to kill her until after her baby was born, it turned out that \"mother and children first\" reminder sunk in.\r\n\r\nGetting so physical while pregnant was \"horrifying\" at first for Lowes, but when it came to the day of shooting the actual scene, she shares she felt \"very well taken care of.\"\r\n\r\n\"We had a medic on set at all times [and] we had an OB on set who was instructing me on how to do everything really safely, which was incredible,\" Lowes says. \"We had our stunt coordinator — I had a stunt double — and we took things really slow. I felt very safe.\"\r\n\r\nShortly after the fake shooting, Quinn went into labor and had the baby with a little help from Rowan, his salesman friend who was previously a war medic, as well assome hallucinations of her friends.\r\n\r\n\"The craziest part of the episode was me actually being nine and a half months pregnant with a blanket over my knees, and they put a real baby in between my legs and pulled the baby out like it was really happening. And I was like, 'Oh my God, guys, this is going to really be happening to me in a few weeks!'\" Lowes says. \"They had a real baby and a fake baby — the real baby so they could get a cry and the fake was covered in grape jelly and cottage cheese. But that's how they make it look like a baby was just born.\"\r\n\r\nThe new mother and daughter moved into Liv's old room in Rowan's house to lay low and allow Olivia to continue to believe she was dead — so she wouldn't come looking for her to actually kill her.\r\n\r\n\"Nzingha was very much [about] finding moments where — especially when the baby comes and he had bought all of the clothes for her — Quinn is filling this huge void for Papa Pope,\" Lowes says. \"And similarly, Quinn didn't have a father either. And then they are so allied in the end in that they both followed the B613 rules, which is that they put a woman and pregnancy before anything else.\"\r\n\r\nLowes says Rowan and Quinn are now bonded because they \"definitely need each other at the moment,\" and subsequent episodes of \"Scandal\" will dive into how that plays out. Last the show left Rowan in present day, Charlie (George Newbern) was attacking him over the baby he found in his house, demanding to know whose it was. Lowes says the eventual family reunion between Charlie and Quinn is \"not what you'd expect\" — not even for \"Scandal.\"\r\n\r\nAs for whether or not Quinn and Rowan will work together to try to take down Olivia, and soon bring Charlie into that fold, Lowes would only say \"all the loyalties and family dynamics\" would unfold soon. \"I don't think it's like one we've seen on television before,\" she says.\r\n\r\nBut while Quinn was once super loyal to Olivia and in many ways was even \"waiting around for her to save\" her while she was down in that bunker, after overhearing Olivia allow her and her baby's murder, her feelings toward her former mentor are \"very complicated.\"\r\n\r\n\"It's very hard for her to wrap her head around the fact that Olivia's responsible for blowing up the plane with that young girl on it. I think it's very hard for her to admit that the Olivia she knows and loves is not here right now,\" Lowes says. \"I think the line is, 'Olivia's a bitch' and I think that's way too light, honestly. I love the moment because how do you find the words to describe someone that is responsible for killing you and your unborn child and being fine for it for the Republic? I don't know how a relationship comes back from it, I really don't.\"\r\n\r\nEven after such an emotional fake-out death episode, Lowes doesn't have strong feelings about whether or not Quinn survives the series, which is ramping up for its finale in April.\r\n\r\n\"I've been such a cog in this huge wheel for seven years, and I'm just very used to Shonda making the best decisions for the characters,\" Lowes says. \"I know Quinn is mine, but she's also hers, and I just feel like whatever she wants for her is what I will come to terms with.\"\r\n\r\n\"Scandal\" airs on Thursdays at 9 p.m. on ABC.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1516935630.0, "source": "https://variety.com", "summary": ""}