{"url": "http://time.com/4805251/ariana-grande-manchester-benefit-concert-fundraising/", "text": "Ariana Grande‘s star-studded Manchester benefit concert filled with messages of love and resilience raised more than $13 million for the victims of the May 22 attack.\n\nAbout 50,000 fans gathered in an act of defiance and strength for the sold-out One Love Manchester concert on Sunday. The British Red Cross said it raised 10 million pounds, which is about $13 million, for the We Love Manchester Emergency Fund, the Associated Press reports.\n\nGrande organized the concert in the 13 days after a suicide bomber killed 22 people and injured many others outside of her concert at Manchester Arena. The concert continued as planned even after another terrorist attack struck the United Kingdom on Saturday evening, when authorities said three men drove a van into pedestrians on the London Bridge and attacked people with knives at nearby Borough Market. Grande enlisted a number of celebrities to perform, including Katy Perry, Liam Gallagher, Chris Martin, Miley Cyrus, Justin Bieber and Pharrell Williams, among others. Throughout their performances, instructions for how to donate to the British Red Cross were displayed across massive screens on stage.\n\nGrande visited injured fans in the hospital before the concert and met the mother of Olivia Campbell, one of those killed during the Manchester attack. She also offered 14,000 free tickets for the benefit concert for those who attended her May 22 concert.\n\n“I want to thank you so much for coming together and being strong,” Grande told the crowd. “I love you guys so much, and I think the kind of love and unity you’re displaying is the medicine the world needs right now.”\n\nThe British Red Cross has also organized fundraising efforts for victims of all recent U.K. terror attacks — including the most recent one in London.\n\n“It’s not always easy to choose love, right? Especially in moments like this it can be difficult,” Perry said. “But love conquers fear and love conquers hate. And this love that you choose will give you strength, and it’s our greatest power.”\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nContact us at editors@time.com.", "images": ["https://api.time.com/wp-content/uploads/2017/06/ariana-grande-2.jpg?quality=85&w=1200&h=628&crop=1", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2017/06/ariana-grande-2.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": [], "canonical_link": "https://time.com/4805251/ariana-grande-manchester-benefit-concert-fundraising/", "title": "Ariana Grande Manchester Concert Raised $13 Million", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "ariana grande concert, ariana grande manchester, one love manchester, ariana grande one live, ariana grande one love manchester, one love manchester concert, london attack, manchester concert, manchester bombing, ariana grande manchester", "news_keywords": "ariana grande concert, ariana grande manchester, one love manchester, ariana grande one live, ariana grande one love manchester, one love manchester concert, london attack, manchester concert, manchester bombing, ariana grande manchester", "description": "Ariana Grande's benefit concert in Manchester, England, raised about $13 million for the victims of the  attack, the British Red Cross said", "og": {"title": "Ariana Grande's Manchester Benefit Concert Raised $13 Million", "type": "article", "site_name": "Time", "url": "https://time.com/4805251/ariana-grande-manchester-benefit-concert-fundraising/", "description": "The concert was filled with messages of resilience just two weeks after the attack", "image": {"identifier": "https://api.time.com/wp-content/uploads/2017/06/ariana-grande-2.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/4805251/ariana-grande-manchester-benefit-concert-fundraising/", "description": "Ariana Grande's benefit concert in Manchester, England, raised about $13 million for the victims of the  attack, the British Red Cross said", "media": "https://api.time.com/wp-content/uploads/2017/06/ariana-grande-2.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/4805251/ariana-grande-manchester-benefit-concert-fundraising/", "title": "Ariana Grande's Manchester Benefit Concert Raised $13 Million", "description": "The concert was filled with messages of resilience just two weeks after the attack", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2017/06/ariana-grande-2.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}