{"url": "https://www.romper.com/p/real-housewives-of-atlanta-star-eva-marcille-is-pregnant-with-baby-no-2-its-a-boy-5530579", "text": "One TV family is about to grow by one! America’s Next Top Model cycle 3 winner and current Real Housewives of Atlanta star, Eva Marcille, is pregnant with her second child, a baby boy, with her boyfriend, Michael Sterling, Us Weekly reported on Tuesday. According to the publication, Marcille shares her first child — 3-year-old daughter, Marley Rae — with her ex-boyfriend Kevin McCall.\n\nAlong with an Instagram post from Nov. 21, Marcille revealed that she was expecting her second child in an exclusive interview with People, saying that after her daughter had told her she wanted it to be a boy. And as it turns out, the little girl's wish came true! “I felt like she willed it in her favor,” Marcille said of her daughter’s prediction, adding that she was “beyond elated to be having a boy.”\n\nShe also spoke about the surprise she felt in discovering she was pregnant, as she originally just felt a little off. “My body felt super weird,” she told People. “I didn’t know what was going on. I went to the doctor and because of my symptoms, he decided to do an ultrasound to see if I had any cysts or tumors or fibroids or things of that nature.”\n\nAnd while the ultrasound obviously wasn’t what she expected, it was definitely some happy news. Because even though getting pregnant during her partner's mayoral campaign might have felt a little overwhelming at the time, Marcille is so ready to share her exciting news with the world now. The 33-year-old is now five months along and due in spring 2018.\n\n\"I was shocked and terrified all at the same time,” she told People. “It was not planned — it was very unexpected, and [Michael] was in the middle of this mayoral campaign where being pregnant was not a part of the agenda.\" However, Marcille's husband, Sterling, ended up dropping out of the mayoral race in October (and the Nov. 7 election ended up bringing a victory for two women, who will face a runoff election in December). Clearly, the couple has had a busy few months, and now that things have settled down, they can start to really enjoy this exciting new time together.\n\nAnd as babies tend to do, the news of Marcille's pregnancy sent 35-year-old Sterling, who's a lawyer, into somewhat of a shock. \"When I initially told him, he was like, ‘Oh, okay,’ and I could tell he was surprised and didn’t want to overreact or react in a way that he would regret or that would scare me,\" she explained to People.\n\nHowever, Sterling took some time to absorb the news, and was soon totally on board. \"We talked about it again, and he was excited,\" Marcille said to People. \"Which was a huge relief to me — excitement is what we want.\" And based on her life so far, excitement is something Marcille has become accustomed to. She was the third winner of America's Next Top Model back in 2004 and has since starred in a variety of movies and television shows, including The Young and the Restless and Sister Code. Currently, Marcille is set to debut on The Real Housewives of Atlanta alongside series legend NeNe Leakes.\n\nAnd while the official news of Marcille's pregnancy is still pretty new to the world, the family actually already has a name picked out for the little fellow, according to People. Technically, he will be Michael Todd Sterling Jr., but Marcille's daughter has already given him a nickname. \"Mikey — that’s what Marley calls him,\" she said.\n\nClearly, the model, mother, and reality star is happy to finally share her good news, and she should be!\n\nCheck out Romper's new video series, Romper's Doula Diaries:\n\nWatch full episodes of Romper's Doula Diaries on Facebook Watch.", "images": ["https://imgix.bustle.com/uploads/getty/2017/11/21/a7928873-85a1-4824-b154-761c982d6eaa-getty-848689664.jpg?w=960&h=540&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/7/1195267a-d47d-4262-9740-038c47e33f8d-getty-1181285233.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2017/11/21/a7928873-85a1-4824-b154-761c982d6eaa-getty-848689664.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2020/4/17/033c60cc-a277-4d15-b1cc-a8ba9968ac59-g_thelionking_09_97af1e04.jpeg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=932972280084675&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2020/4/16/38c22f04-cb0f-4840-9f0a-72fb7ed63faa-screen-shot-2020-04-16-at-95314-am.png?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2017/11/21/a7928873-85a1-4824-b154-761c982d6eaa-getty-848689664.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.romper.com/p/real-housewives-of-atlanta-star-eva-marcille-is-pregnant-with-baby-no-2-its-a-boy-5530579", "title": "'Real Housewives Of Atlanta' Star Eva Marcille Is Pregnant With Baby No. 2 & It's A Boy!", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@romper", "card": "summary_large_image"}, "og": {"site_name": "Romper", "url": "https://www.romper.com/p/real-housewives-of-atlanta-star-eva-marcille-is-pregnant-with-baby-no-2-its-a-boy-5530579", "type": "article", "title": "'Real Housewives Of Atlanta' Star Eva Marcille Is Pregnant With Baby No. 2!", "description": "One TV family is about to grow by one! America’s Next Top Model cycle 3 winner and current Real Housewives of Atlanta star, Eva Marcille, is pregnant with her second child, a baby boy, with her boyfriend, Michael Sterling, Us Weekly reported on…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2017/11/21/a7928873-85a1-4824-b154-761c982d6eaa-getty-848689664.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 510210782483125}, "description": "One TV family is about to grow by one! America’s Next Top Model cycle 3 winner and current Real Housewives of Atlanta star, Eva Marcille, is pregnant with her second child, a baby boy, with her boyfriend, Michael Sterling, Us Weekly reported on…"}, "movies": [], "publish_date": null, "source": "https://www.romper.com", "summary": ""}