{"url": "www.express.co.uk/travel/activity/736598/south-africa-safari-travel-adventure-big-five-prince-harry", "text": "GETTY Elephants at watering hole\n\nIt may not sound as if we’re heading out on a wild South African adventure but this is how our safari begins. We’re wrapped up all warm and cosy in a Land Cruiser while our guide, wearing nothing more than shorts and a T-shirt, turns and asks what we want to see. Lets go find some cats, we say. As the sun rises we bound off into Kruger National Park on a jeep convoy.\n\nThousands of animals roam this vast space, an area roughly the size of Scotland. While the park is home to 147 species, the main draw is the Big Five – that’s lion, leopard, elephant, rhino and buffalo. Picking our way through the bush it’s difficult to spot anything. There are rustles and strange sounds in the long grass but I can’t see any animals. The tracker perched on the bonnet with his rifle is much better at it. Despite (and very probably because of) being at risk of predators, he seems to notice the smallest of movements in the distance – he’s an expert at finding exotic shapes, everything from hippos and lone giraffes to zebras.\n\nAfrican wildlife up close and personal Mon, June 6, 2016 Penny Robartes, a Photo Tour Leader for ORYX captured these stunning up close and personal wildlife images. www.oryxphotography.com Play slideshow Penny Robartes, ORYX 1 of 17 As a wildlife photographer, I constantly have to be aware of the scene around the subject I'm wanting to photograph. The background is as important as the animal. Arriving at the scene of sleeping lions, I was very aware of the beautiful colours behind hi\n\nEvery now and again we stop to look at footprints and even fresh poop.\n\nThe main draw is the Big Five – that’s lion, leopard, elephant, rhino and buffalo\n\nIt looks like elephants passed through overnight. The rangers can read what direction they took and even how long ago. Soon enough, we gasp and nudge each other as he sights a leopard through the trees. It’s hunting something that we can’t make out. Impressed to find it stalking prey, we sit watching in silence. We see another safari vehicle and they report there are elephants near the river so we decide to leave our hungry feline to hunt alone.\n\nNATALIE CHALK Nathalie Chalk on safari\n\nThe ground is dry and cracked due to a two-year drought, which has left parts of the park looking scorched with dead trees and uprooted branches. It’s hard to see how anything could thrive in this landscape. Yet as we approach the river, it’s like we enter a different country. There are lush mahogany and marula fruit trees – a favourite snack of the park’s vast herds of elephants. And this is where we find once such group.\n\nGETTY The main draw is the Big Five – that’s lion, leopard, elephant, rhino and buffalo\n\nOn the banks are 30 elephants, including babies, close to their mothers, young bulls jumping on each other and adult males spraying water. It’s like being backstage on a David Attenborough documentary – peeking into their secret lives off-camera. As our guide talks quietly about how an elephant’s ear resembles the shape of Africa, they begin to stroll our way. The herd is making its way to the road and coming straight towards the vehicle. It’s an uncomfortable mixture of excitement and terror. As we look at them, they stare back. Some of us get nervous. We hold our breath, grit our teeth and fall silent as they get closer. I am about to be nuzzled by the largest land animal on Earth.\n\nI wish I had good rapport with nature. Instead I want to slide down the seat in front and hide under my blanket. Before turning to stone, I remember thinking what long eyelashes they have. Soon we are surrounded as they cross behind and in front. Some swing their trunks, which is how they smell, while others walk by munching on prickly branches. It’s the mother who stands guard. The guide tells us not to worry but we’re not convinced.\n\nSABI SABI The Bush Lodge at Sabi Sabi Private Game Reserve\n\nHe speaks in a calm voice to the elephants saying the baby is safe and they can pass. He’d better know what he’s doing, I pray. The ploy works and after 40 minutes, the herd strides off at their own slow pace. When they are far away enough, we all breathe out. Now that was worth getting up for. We’re welcomed back to safety of Bush Lodge at Sabi Sabi Private Game Reserve just before 10am with warm face cloths and drinks. Being on a game drive can make you hungry so I have a three-course feast, filling up at the buffet, ordering eggs benedict and washing it down with a glass of bubbly and a muffin to celebrate our once-ina-lifetime experience.\n\nWIREIMAGE Prince Harry stayed at the Bush Lodge at Sabi Sabi Private Game Reserve earlier this year\n\nThe lodge is a labour of love for managers Lauren and her husband Rod who take care of a cluster of 25 fi ve-star suites all offering panoramas of the bush. Inside, it has an Out Of Africa feel with its thatched roof, wooden tables and animal artefacts on the walls. It’s no wonder Prince Harry stayed here earlier this year. Everyone though is treated like royalty with guides escorting you back to your room each night. You couldn’t be closer to wildlife, with baboons swinging from the furniture and impalas on the doorstep. The next morning the birds act as our wake-up call. We bounce along the plains spotting a skipping baby rhino with its mother.\n\nIt wasn’t until the afternoon drive that we’d get to see all of the Big Five. As we head back to camp, word comes over the radio of a lion killing a buffalo. We arrive in darkness to watch the mother at work. With Sabi Sabi we don’t share our finds with other safari tours. As a private reserve, it has its own plot of the park, which if we duck under the branches, we can drive off road to follow animals. Visitors on a self-drive on Kruger’s public roads must stick to the tracks. Dinner back at the lodge is served under the stars at a boma (an enclosure traditionally used for livestock) with a barbecue.\n\nSABI SABI Everyone is treated like royalty at the lodge", "images": ["http://t.co/i/adsct?txn_id=l4f18&p_id=Twitter", "https://sb.scorecardresearch.com/p?c1=2&c2=6035737&cv=2.0&cj=1", "https://cdn.images.express.co.uk/img/dynamic/galleries/x701/117140.jpg", "https://cdn.images.express.co.uk/img/dynamic/1/285x190/718617_1.jpg", "https://cdn.images.express.co.uk/img/dynamic/133/750x445/736598.jpg", "https://cdn.images.express.co.uk/img/covers/70x91/front_2020-04-17.jpg", "https://cdn.images.express.co.uk/img/dynamic/25/285x190/726162_1.jpg", "https://cdn.images.express.co.uk/img/page/placeholder-horizontal.gif", "https://analytics.twitter.com/i/adsct?txn_id=l4f18&p_id=Twitter", "https://cdn.images.express.co.uk/img/page/preloaderbig.gif", "http://googleads.g.doubleclick.net/pagead/viewthroughconversion/1068671835/?value=0&label=u9gYCOmHtQYQ28bK_QM&guid=ON&script=0"], "top_img": "https://cdn.images.express.co.uk/img/dynamic/133/750x445/736598.jpg", "keywords": [], "authors": ["Natalie Chalk"], "canonical_link": "https://www.express.co.uk/travel/activity/736598/south-africa-safari-travel-adventure-big-five-prince-harry", "title": "Going wild in South Africa", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "WE leave at 6.30am without breakfast, clutching only hot water bottles and blankets.", "fb": {"pages": 129617873765147, "app_id": 823607694325129}, "og": {"title": "Going wild in South Africa", "type": "article", "url": "https://www.express.co.uk/travel/activity/736598/south-africa-safari-travel-adventure-big-five-prince-harry", "image": "https://cdn.images.express.co.uk/img/dynamic/133/750x445/736598.jpg", "site_name": "Express.co.uk", "language": "en", "tags": "ctp_video,safari,South africa,south africa safari,big five,lion,leopard,elephant,rhino,buffalo,adventure,south african adventure,lodge,prince harry,UploadExpress,", "section": "Activity Holidays", "description": "WE leave at 6.30am without breakfast, clutching only hot water bottles and blankets."}, "news_keywords": "ctp_video,safari,South africa,south africa safari,big five,lion,leopard,elephant,rhino,buffalo,adventure,south african adventure,lodge,prince harry,UploadExpress,", "article": {"tag": "UploadExpress", "published_time": "2016-11-26T00:01:00+00:00", "modified_time": "2016-11-25T17:46:47+00:00", "expiration_time": "2016-12-25", "section": "Activity Holidays", "image_count": 6, "video_count": 2, "word_count": 1196, "internal_link_count": 3, "external_link_count": 0}, "author": "Natalie Chalk", "twitter": {"card": "summary_large_image", "image": {"src": "https://cdn.images.express.co.uk/img/dynamic/133/750x445/736598.jpg"}, "title": "Going wild in South Africa", "description": "WE leave at 6.30am without breakfast, clutching only hot water bottles and blankets."}, "video_autoplay": "false", "headline_short": "Going wild in South Africa", "verify-v1": "EGl3XPBuem43awGwLC1rXGpRHRnmNSwp7VZfnCAAcKE=", "msvalidate.01": "1960193A20395DAD3FCB640BCB0D91D7", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "robots": "noodp,noydir,all"}, "movies": [], "publish_date": 1480118460.0, "source": "http://www.express.co.uk", "summary": ""}