{"url": "https://www.inquisitr.com/4484553/kylie-jenner-turns-into-monster-on-life-of-kylie-tv-show-cancellation-rumors-soar-as-ratings-fall/", "text": "Kylie Jenner probably felt fabulous when she learned that her solo Keeping Up With The Kardashians spin-off got a green light from the network. But although Kylie has scored when it comes to making money as the family’s cosmetics queen, Jenner hasn’t exactly been a solid hit with reviewers and critical fans on her new show, Life Of Kylie. Despite that failure, Kylie has followers who are willing to pay big bucks to try to look like their reality TV princess, with her cosmetics empire continuing to expand even as the ratings for her show reportedly are in a downward spiral.\n\nKylie Gets Extra-Cranky On Camera\n\nJenner isn’t much of a princess on the upcoming episode of Life Of Kylie. Noting that most people get somewhat cranky when they’re hungry, Hollywood Life dished up a sneak peek of the reality TV show that demonstrates how Kylie turns into a bratty “monster” when she’s in need of food.\n\n“Kylie Jenner…throws a fit at the dinner table when she finds out she can’t eat anything being served!”\n\nThe preview from the September 10 episode of Life of Kylie shows Jenner losing her cool as she dines with her mother Kris Jenner and her crew. The tantrum takes place following a tiring day of visiting Peru for a charity trip.\n\nKylie Jenner treats her mom Kris Jenner to a glimpse of her inner \"monster\" on the \"Life Of Kylie.\" [Image by Frederick M. Brown/Getty Images]\n\nTalking to the camera, Kylie’s friend Jordyn Woods, 19, explained what led up to her pal’s cranky explosion.\n\nMorphing Into Monster\n\nThe group had no food the entire day, according to Jordyn. In a camera confessional, Woods admitted that when her 20-year-old best friend is deprived of nourishment, she turns into a scary creature.\n\n“When Kylie doesn’t eat the whole day, she’s not Kylie. She’s…a monster.”\n\nJenner didn’t spare her mother Kris from the wrath of her “monster” personality. Instead, glaring at the fancy cheese dip and other extravagant goodies on the table, Kylie let go with a whine that sounded like she might need an infusion of gratitude just as much as food.\n\nReality TV Star Complains To Mommy Kris Jenner\n\nThe 20-year-old reality TV star informed her mother that she was “really hungry” and demanded that the menu change to suit her needs. The upscale restaurant dinner didn’t impress Kylie, who also revealed that the last food she consumed was chips and guacamole on a private jet.\n\n“I just need some f*cking spaghetti. Mom, I’m really hungry, you know? I just don’t think that this is gonna like, really fill me up.”\n\nBut it wasn’t just Jenner who sounded ungrateful. Her friends followed Kylie’s lead, including her assistant Victoria Villarroel, who referred to the gourmet feast as “plates of just rocks and a little fish in the top.” Jenner’s assistant didn’t hesitate to disdain the treats as inappropriate for her appetite.\n\n“When you’re hungry you don’t f*cking want that, you know?” complained Victoria.\n\nLow Ratings Lead To Cancellation Rumors\n\nAs for how Jenner’s show is doing, Refinery 29 noted that the ratings reportedly fell following the debut of Life Of Kylie. Blogger Perez Hilton labeled the show a flop, pointing to the dramatic drop in ratings in the second week.\n\nAs for what fans think, many are noting that there’s more to be learned about Jenner by following her social media rather than watching her reality TV show. Kylie has emphasized her desire to keep part of her life private, in contrast to her older sisters such as Kim Kardashian who have been willing to bare all (sometimes literally) for Keeping Up With Kardashians.\n\nDespite falling \"Life Of Kylie\" ratings, women still want Jenner's curves. [Image by Gustavo Caballero/Getty Images for New York Fashion Week: The Shows]\n\nAmid the rumors that the show is not doing well, however, the E network told Refinery29 that Life of Kylie “is currently averaging about 1 million viewers between the ages of 18 and 49, and 1.5 million viewers total.” That update took place on August 21.\n\nHowever, the most recent episode attracted only 666,000 total viewers, showing a drop in the critical group of adults ages 18 to 49 as well as overall viewership, according to In Touch Weekly on September 6.\n\n“People would rather watch Weather Channel Live and HGTV…than Life of Kylie because the show came in 21st place out of 25 programs for its…time slot.”\n\nAn insider told the publication that Jenner’s pals and those close to her are advising her to focus on her cosmetics empire rather than reality TV. With her inner circle reportedly telling Kylie to focus on her talents, which consist of “selling makeup,” Jenner allegedly may soon pull the plug on the Life Of Kylie.\n\nWomen Still Want To Look Like Kylie Jenner\n\nAs for whether the reported failure of Kylie’s reality TV show might affect her cosmetics company, E News revealed that women and teenage girls continue to want to look just like Jenner, even turning to plastic surgery to emulate the 20-year-old celebrity.\n\nAll new #LifeOfKylie airs tonight so I thought I'd throw it back to me and kendall with this cute fluffy cow ???? A post shared by Kylie (@kyliejenner) on Sep 3, 2017 at 6:35pm PDT\n\nJenner has raked in big bucks for her lip kits and, after first denying that she had any work done, finally confessed to undergoing lip filler treatments. Her most famous quote focuses on her lips.\n\n“I think big lips are awesome.”\n\nBeverly Hills plastic surgeon Jason Diamond told E News that he continues to receive requests for procedures that will make them look like Kylie.\n\n“People come in and say, ‘I’ve seen the changes that Kylie has made and I want to do something similar.’ It’s a very common request that we get,” said Dr. Diamond.\n\nIt sounds as if whether or not Life Of Kylie succeeds, Jenner is secure in reigning as the lip kit queen role model.\n\n[Featured Image by Ari Perilstein/Getty Images for A-OK Collective, LLC]", "images": ["https://secure.gravatar.com/avatar/fa8aa86244d76bf2aee7e2fb5b934ea3?s=250&d=mm&r=g", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "https://cdn.inquisitr.com/wp-content/uploads/2017/09/Kylie-Jenner-Life-Of-Kylie-Ratings.jpg", "https://cdn.inquisitr.com/wp-content/uploads/2017/09/Kylie-Jenner-Curves.jpg", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://cdn.inquisitr.com/wp-content/uploads/2017/09/Kris-Jenner-Kylie-Jenner-Monster.jpg", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png"], "top_img": "https://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Joanne Eglash"], "canonical_link": "https://www.inquisitr.com/4484553/kylie-jenner-turns-into-monster-on-life-of-kylie-tv-show-cancellation-rumors-soar-as-ratings-fall/", "title": "Kylie Jenner Turns Into ‘Monster’ On ‘Life Of Kylie:’ TV Show Cancellation Rumors Soar As Ratings Fall", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "https://www.inquisitr.com", "summary": ""}