{"url": "https://www.indiewire.com/2017/12/annie-awards-pixar-coco-13-nominations-oscars-1201903634/", "text": "Oscar-frontrunners \"Coco\" and \"The Breadwinner\" were the big Annie nomination winners, while \"The LEGO Batman Movie\" was snubbed.\n\nPixar’s Día de los Muertos saga, “Coco,” the Oscar frontrunner, led the pack with 13 nominations for the 45th Annie Awards, followed by GKid’s powerful indie fave, “The Breadwinner,” with 10. Both are expected to win the top categories for feature and indie feature at the February 3rd ASIFA-Hollywood ceremony at UCLA’s Royce Hall.\n\n“Coco” also picked up nominations for directing (Lee Unkrich and co-director Adrian Molina), character design, two each for character animation and storyboarding, writing (Molina and Matthew Aldrich), Michael Giacchino’s music, production design, effects, editing, and voice acting for newcomer Anthony Gonzalez as Miguel.\n\n“The Breadwinner,” about a young girl forced to become a boy in Afghanistan, also collected nominations for directing (Cartoon Saloon’s Nora Twomey), Mychael and Jeff Danna’s music, two voice acting bids for Saara Chaudry and Laara Sadiq, character design, production design, storyboarding, writing (Anita Doron), and editing.\n\nPopular on IndieWire\n\nOverall, GKids grabbed 16 nominations — for “The Breadwinner,” Napping Princess,” “Mary and the Witch’s Flower,” and “The Big Bad Fox & Other Tales” — with Pixar and DreamWorks getting 15 and nine, respectively.\n\nThe other nominees for animated feature include: DreamWorks’ “Captain Underpants,” and “The Boss Baby,” “Pixar’s “Cars 3,” and “Illuminations’ “Despicable Me 3.” The big snub here was Warner Bros.’ “The LEGO Batman Movie,” which only managed three nominations for directing (Chris McKay), editing, and voice acting (Zach Galifianakis as Joker).\n\nIn addition to “The Breadwinner,” GKids scored two other noms in the indie feature category: “Napping Princess” and “Big Bad Fox & Other Tales.” The others included “In This Corner of the World” and “Loving Vincent.”\n\nThe best short nominees were “Dear Baskeball,” from Disney animation legend Glen Keane and Lakers star Kobe Bryant; the National Film Board of Canada’s “Hedgehog’s Home”; “Negative Space” from IKKI Films and Manuel Cam Studios; Titmouse and Adult Swim’s “Scavengers”; and Google Spotlight Studio’s“Son of Jaguar,” directed by Jorge Gutierrez (“The Book of Life”).\n\nAnd live-action character animation nominees were “War for the Planet of the Apes,” “Game of Thrones” / S7 Ep.6 “Beyond The Wall,” “Guardians of the Galaxy Vol. 2,” “Kong: Skull Island,” and “Valerian and the City of a Thousand Planets.”\n\nThe Winsor McCay Award for career contributions to animation will be given to British character animator James Baxter, “SpongeBob SquarePants” creator Stephen Hillenburg, and Canadian animation duo Wendy Tilby and Amanda Forbis.\n\nCourtesy of Twentieth Century Fo\n\nThe Ub Iwerks Award for technical advancement will go to TVPaint for its 2D animation software.\n\nStudio MDHR Entertainment will be awarded the Special Achievement Award for its 1930s-inspired game “Cuphead.”\n\nAnimation historian Didier Ghez will be the recipient of the June Foray Award (the Annie Awards co-founding voice legend passed away in July at 99). And a certificate of merit will be given to David Nimitz, who was her longtime caretaker.\n\nFor a complete list of nominations, visit the Annie’s website\n\nSign Up Stay on top of the latest breaking film and TV news! Sign up for our Email Newsletters here.", "images": ["https://pmcvariety.files.wordpress.com/2020/01/michelle-obama.jpg?resize=230%2C135&w=300", "https://www.indiewire.com/wp-content/uploads/2017/08/coco586c323777b11-e1510248506244.jpg", "http://www.indiewire.com/wp-content/uploads/2016/12/animation_inarticle.jpg", "https://pmctvline2.files.wordpress.com/2020/04/lady-gaga-one-world-together-at-home.png?resize=230%2C135&w=300", "http://www.indiewire.com/wp-content/uploads/2017/03/captainunderpanst.jpg", "https://www.indiewire.com/wp-content/themes/indiewire/sprites/logo/Logo_IndieWire.png", "http://www.indiewire.com/wp-content/uploads/2017/07/1_cfk0110_v0165-0008_mkt_rgb1.jpg", "https://www.indiewire.com/wp-content/themes/indiewire/images/indiewire-color.png", "https://www.indiewire.com/wp-content/uploads/2017/08/coco586c323777b11-e1510248506244.jpg?w=780", "https://i0.wp.com/www.rollingstone.com/wp-content/uploads/2020/04/ev.jpg?resize=230%2C135&ssl=1&w=300", "https://pmcdeadline2.files.wordpress.com/2020/04/taylor-swift-performs-at-global-citizens-concert.png?resize=230%2C135&w=300", "https://i0.wp.com/www.goldderby.com/wp-content/uploads/2017/11/top-chef-season-15-contestants-hosts-Tom-Colicchio.jpg?resize=230%2C135&ssl=1&w=300", "https://i0.wp.com/www.indiewire.com/wp-content/uploads/2016/06/unnamed-22.jpg?resize=96%2C96&ssl=1", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.indiewire.com&path=%2F2017%2F12%2Fannie-awards-pixar-coco-13-nominations-oscars-1201903634%2F&ct=article&lob=indiewire&loc=us&env=desktop&post_id=1201903634&comment_count=1", "http://www.indiewire.com/wp-content/uploads/2017/10/main-select-bwact001_seq_003_sc025-output-0108.jpg"], "top_img": "https://www.indiewire.com/wp-content/uploads/2017/08/coco586c323777b11-e1510248506244.jpg", "keywords": [], "authors": ["Bill Desowitz"], "canonical_link": "https://www.indiewire.com/2017/12/annie-awards-pixar-coco-13-nominations-oscars-1201903634/", "title": "Pixar’s ‘Coco’ Tops the Annie Awards with 13 Nominations, Winners and Losers", "meta_data": {"fb": {"pages": 9800035481}, "msvalidate.01": "87B78205BB25666E656DA3EB49F3FD42", "viewport": "width=device-width, initial-scale=1", "st": {"robots": "follow, index"}, "description": "Oscar-frontrunners \"Coco\" and \"The Breadwinner\" were the big Annie nom winners, while \"LEGO Batman\" was snubbed.", "news_keywords": "Animation, Annie Awards, Coco, Oscars, Pixar, The Breadwinner", "apple-itunes-app": "app-id=1400654071", "generator": "WordPress 5.4", "author": "Bill Desowitz", "content_type": "Article", "post_id": 1201903634, "title": "Pixar's 'Coco' Tops the Annie Awards with 13 Nominations, Winners and Losers", "published_at": "2017-12-04 13:17:57", "image": "https://www.indiewire.com/wp-content/uploads/2017/08/coco586c323777b11-e1510248506244.jpg?w=300", "comment_count": 1, "tags": "The Breadwinner", "topics": "Awards", "body": "Pixar's Día de los Muertos saga, \"Coco,\" the Oscar frontrunner, led the pack with 13 nominations for the 45th Annie Awards, followed by GKid's powerful indie fave, \"The Breadwinner,\" with 10. Both are expected to win the top categories for feature and indie feature at the February 3rd ASIFA-Hollywood ceremony at UCLA's Royce Hall.\r\n\r\n\"Coco\" also picked up nominations for directing (Lee Unkrich and co-director Adrian Molina), character design, two each for character animation and storyboarding, writing (Molina and Matthew Aldrich), Michael Giacchino's music, production design, effects, editing, and voice acting for newcomer Anthony Gonzalez as Miguel.\r\n\r\n\"The Breadwinner,\" about a young girl forced to become a boy in Afghanistan, also collected nominations for directing (Cartoon Saloon's Nora Twomey), Mychael and Jeff Danna's music, two voice acting bids for Saara Chaudry and Laara Sadiq, character design, production design, storyboarding, writing (Anita Doron), and editing.\r\n\r\n\r\n\r\nOverall, GKids grabbed 16 nominations -- for \"The Breadwinner,\" Napping Princess,\" \"Mary and the Witch's Flower,\" and \"The Big Bad Fox & Other Tales” -- with Pixar and DreamWorks getting 15 and nine, respectively.\r\n\r\nThe other nominees for animated feature include: DreamWorks' \"Captain Underpants,\" and \"The Boss Baby,\" \"Pixar's \"Cars 3,\" and \"Illuminations' \"Despicable Me 3.\" The big snub here was Warner Bros.' \"The LEGO Batman Movie,\" which only managed three nominations for directing (Chris McKay), editing, and voice acting (Zach Galifianakis as Joker).\r\n\r\nIn addition to \"The Breadwinner,\" GKids scored two other noms in the indie feature category: \"Napping Princess\" and \"Big Bad Fox & Other Tales.\" The others included \"In This Corner of the World\" and \"Loving Vincent.\"\r\n\r\n\r\n\r\nThe best short nominees were \"Dear Baskeball,” from Disney animation legend Glen Keane and Lakers star Kobe Bryant; the National Film Board of Canada’s “Hedgehog’s Home”; “Negative Space” from IKKI Films and Manuel Cam Studios; Titmouse and Adult Swim’s “Scavengers”; and Google Spotlight Studio’s“Son of Jaguar,\" directed by Jorge Gutierrez (\"The Book of Life\").\r\n\r\nAnd live-action character animation nominees were \"War for the Planet of the Apes,\" “Game of Thrones” / S7 Ep.6 \"Beyond The Wall,\" \"Guardians of the Galaxy Vol. 2,\" \"Kong: Skull Island,\" and \"Valerian and the City of a Thousand Planets.\"\r\n\r\nThe Winsor McCay Award for career contributions to animation will be given to British character animator James Baxter, “SpongeBob SquarePants” creator Stephen Hillenburg, and Canadian animation duo Wendy Tilby and Amanda Forbis.\r\n\r\n\r\n\r\nThe Ub Iwerks Award for technical advancement will go to TVPaint for its 2D animation software.\r\n\r\nStudio MDHR Entertainment will be awarded the Special Achievement Award for its 1930s-inspired game “Cuphead.”\r\n\r\nAnimation historian Didier Ghez will be the recipient of the June Foray Award (the Annie Awards co-founding voice legend passed away in July at 99).  And a certificate of merit will be given to David Nimitz, who was her longtime caretaker.\r\n\r\nFor a complete list of nominations, visit the Annie's website\r\n\r\nSign Up Stay on top of the latest breaking film and TV news! Sign up for our Email Newsletters here.", "onesignal": "wordpress-plugin", "og": {"site_name": "IndieWire", "type": "article", "locale": "en_US", "url": "https://www.indiewire.com/2017/12/annie-awards-pixar-coco-13-nominations-oscars-1201903634/", "title": "Pixar’s ‘Coco’ Tops the Annie Awards with 13 Nominations, Winners and Losers", "description": "Oscar-frontrunners \"Coco\" and \"The Breadwinner\" were the big Annie nomination winners, while \"The LEGO Batman Movie\" was snubbed.", "image": {"identifier": "https://www.indiewire.com/wp-content/uploads/2017/08/coco586c323777b11-e1510248506244.jpg", "width": 780, "height": 458}}, "article": {"published_time": "2017-12-04T18:17:57+00:00", "modified_time": "2017-12-04T22:55:11+00:00", "author": "https://www.indiewire.com/author/bdesowitzindiewire/", "section": "Awards", "tag": "The Breadwinner"}, "fragment": "!", "msapplication-TileImage": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=270"}, "movies": [], "publish_date": 1512411477.0, "source": "https://www.indiewire.com", "summary": ""}