{"url": "https://web.archive.org/web/20170501160014/https://www.forbes.com/sites/maddieberg/2017/05/01/ryan-seacrest-to-join-kelly-ripa-as-co-host-of-live/", "text": "It's been just over a year since professional football player Michael Strahan suddenly left his co-host Kelly Ripa to host Good Morning America, leaving the show called, simply, Live! With Kelly.\n\nToday, Ripa, who has been hosting the syndicated show since 2001 when she joined original host Regis Philbin, announced her new co-host: veteran host Ryan Seacrest.\n\nThe television producer responsible for the Kardashian franchises started out on ESPN before moving to various game shows and smaller reality programs. He got his big break in 2002 as the host of American Idol, which made him a household name. In 2005 he began hosting New Years Rocking Eve, and in 2006 he started hosting E! News. He has previously tried his hand at daytime TV: On-Air with Ryan Seacrest, a syndicated talkshow, lasted less than a year in 2004.\n\nNow, Seacrest, who earned $55 million last year, hosts a syndicated radio show for Los Angeles’ KIIS-FM, in addition to having an overall production (and occasional hosting) deal with NBC Universal. His new hosting gig on an ABC shouldn't affect any of his production contracts (his Ryan Seacrest Productions produces shows for Fox, CBS and NBC), though we likely won't be seeing him on-air at the Peacock at the next Olympics.\n\n“Ryan is a quintessential broadcaster and at the top of his game,” said Ripa in a statement. “I am thrilled to start my mornings with him every day, and we are so fortunate at ‘Live’ to have him join the family. Ryan is a close friend and his star shines as brightly off camera as it does on. His tremendous success is only matched by his impeccable reputation. Plainly said, everyone loves him, and so will our daily viewers.”\n\nRather than immediately replace Strahan—who left abruptly without ABC giving Ripa or the show's executive producer much notice—a series of guest hosts (including Seacrest) took turns in the hot seat next to Ripa.\n\nThe rotating hosts did well for ratings. The show, which is distributed by ABC's parent company Disney, maintained its spot as the number two syndicated daytime talk show behind Dr. Phil. In most markets, the show airs during the 9 a.m. hour and beats the third hour of Today. The show brings in an estimated $85 to $90 million for ABC thanks to ad revenue and license fees.\n\nWhile Ripa may have been upset about the manner in which ABC handled Strahan's departure—in an on-air statement at the time, she condemned the network for not keeping her in the loop about its plans—she likely ended up with the long end of the stick, at least where money is concerned.\n\nPrior to Strahan's departure, Forbes estimates that Ripa was making about $15 million per year from the show. (She made a total $17 million last year thanks to padding her income with endorsement deals). But after she was left in the dark about Strahan's departure and had to host the show alone for a year, she likely ended up with quite a bit of negotiating power when it came to her next contract, which will be in effect starting during 2017-2018 season. On top of that, without having to pay Strahan, the show likely had extra cash in its budget to pay her a hefty bonus for this past season.\n\nThe well-known Seacrest will cost the show a pretty penny—he's even willing to relocate from Los Angeles to New York for the gig—but it will likely prove worth it. With a built-in fan base, Seacrest's visibility will increase that of the show, and with his hand in so many other pots—from music to television to clothing—he has existing relationships with many potential guests.\n\n“One of the secrets to Live’s decades of success in daytime is the relatability of our hosts and their ability to deeply connect with the audience,” said Janice Marinelli, president of Disney/ABC Home Entertainment and TV Distribution, in a statement. “Ryan has a charm and charisma that resonate with his devoted TV and radio audiences, and together, he and the remarkable Kelly Ripa will take Live to a whole new level.”\n\nFor the latest on the entertainment industry, follow me on Twitter @MadelinePBerg.", "images": ["https://web.archive.org/web/20170501160014im_/https://blogs-images.forbes.com/maddieberg/files/2017/05/rs_1024x759-161221152737-1024-8Kelly-Ripa-hosts.jpg?width=960", "https://web.archive.org/web/20170501160014im_/https://blogs-images.forbes.com/maddieberg/files/2017/05/rs_1024x759-161221152737-1024-8Kelly-Ripa-hosts.jpg?width=640&height=434", "https://web.archive.org/web/20170501160014im_/https://blogs-images.forbes.com/files/2015/02/maddieberg_avatar_1425069302.jpg"], "top_img": "https://web.archive.org/web/20170501160014im_/https://blogs-images.forbes.com/maddieberg/files/2017/05/rs_1024x759-161221152737-1024-8Kelly-Ripa-hosts.jpg?width=640&height=434", "keywords": [], "authors": ["Madeline Berg"], "canonical_link": "https://web.archive.org/web/20170501160014/https://www.forbes.com/sites/maddieberg/2017/05/01/ryan-seacrest-to-join-kelly-ripa-as-co-host-of-live/", "title": "Ryan Seacrest To Join Kelly Ripa As Co-Host Of 'Live!'", "meta_data": {"referrer": "origin-when-cross-origin", "description": "After over a year of rotating guest co-hosts, Ryan Seacrest will fill the seat next to Kelly Ripa.", "author": "Madeline Berg", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "prerender-status-code": "{{meta.code}}", "apple-itunes-app": "app-id=588647136", "og": {"title": "Ryan Seacrest To Join Kelly Ripa As Co-Host Of 'Live!'", "site_name": "Forbes", "url": "https://web.archive.org/web/20170501160014/https://www.forbes.com/sites/maddieberg/2017/05/01/ryan-seacrest-to-join-kelly-ripa-as-co-host-of-live/", "image": {"identifier": "https://web.archive.org/web/20170501160014im_/https://blogs-images.forbes.com/maddieberg/files/2017/05/rs_1024x759-161221152737-1024-8Kelly-Ripa-hosts.jpg?width=640&height=434", "type": "image/jpeg,image/gif,image/png"}, "description": "After over a year of rotating guest co-hosts, Ryan Seacrest will fill the seat next to Kelly Ripa.", "updated_time": "2017-05-01T10:17:54-04:00", "type": "article"}, "article": {"publisher": "https://www.facebook.com/forbes", "section": "Business", "section_url": "//www.forbes.com/business", "id": "blogAndPostId/blog/post/3609-3508", "published": "2017-05-01", "modified": "2017-05-01"}, "fb": {"app_id": 123694841080850}, "twitter": {"card": "summary_large_image", "site": "@forbes", "title": "Ryan Seacrest To Join Kelly Ripa As Co-Host Of 'Live!'", "description": "After over a year of rotating guest co-hosts, Ryan Seacrest will fill the seat next to Kelly Ripa.", "image": "https://web.archive.org/web/20170501160014im_/https://blogs-images.forbes.com/maddieberg/files/2017/05/rs_1024x759-161221152737-1024-8Kelly-Ripa-hosts.jpg?width=640&height=434", "creator": "@@MadelinePBerg"}}, "movies": [], "publish_date": 1493568000.0, "source": "https://web.archive.org", "summary": ""}