{"url": "people.com/celebrity/hugh-hefner-dead-celebrity-reactions/", "text": "He was a pioneer of the ’60s sexual revolution, a champion of civil rights and free speech, and created one of the most popular magazines and brand that not only became a playground for Hollywood’s biggest stars, but also changed publishing and pop culture forever.\n\nSo it’s fitting that in the wake of the news of Hugh Hefner‘s death, everyone from celebrities to politicians to former Playboy cover models are taking to social media to pay tribute to Hefner and honor his legacy.\n\nGet push notifications with news, features and more.\n\nThere were those who admired him and enjoyed time at his infamous Playboy mansion, like former BFFs Kim Kardashian West and Paris Hilton — who spent much of Wednesday night sharing memories of Hefner via text.\n\n“RIP to the legendary Hugh Hefner! I’m so honored to have been a part of the Playboy team! You will be greatly missed! Love you Hef! Xoxo,” Kardashian West shared on Twitter. “Paris & I are reminiscing about the Playboy parties at the mansion & how much we love Hef.”\n\nRELATED VIDEO: Hugh Hefner, ‘Playboy Magazine’ Founder and ‘Star of Girls Next Door,’ Dies at 91\n\nThere were those who recognized the good he did in the world, like Rev. Jesse Jackson who praised Hefner for being “a strong supporter of the civil rights movement.”\n\n“Hugh Hefner was a GIANT in publishing, journalism, free speech & civil rights. He was a true original, and he was my friend,” wrote Larry King. “Rest well Hef.”\n\n“Few did more for writers, inc myself, breaking boundaries and helping Lenny fight for his 1st Amend Rights,” said Richard Lewis.\n\nAnd then, of course, there were the Playmates — the stars who became stars in the pages of Playboy, and the celebs who graced the cover of the magazine like Cindy Crawford and Jenny McCarthy.\n\nRELATED VIDEO: Hugh Hefner’s Most Iconic ‘Playboy’ Covers\n\n“RIP #Hef Thank you for being a revolutionary and changing so many people’s lives, especially mine. I hope I made you proud,” McCarthy tweeted along with a photo of her January 2005 Playboy cover.\n\n“RIP @hughhefner thank you for making me part of the Playboy family. Sending lots of love and prayers to @crystalhefner,” said Heidi Montag.\n\nA rep for the Playboy Enterprises founder confirmed the tragic news in a statement to PEOPLE: “Hugh M. Hefner, the American icon who in 1953 introduced the world to Playboy magazine and built the company into one of the most recognizable American global brands in history, peacefully passed away today from natural causes at his home, The Playboy Mansion, surrounded by loved ones.”\n\nHefner’s son Cooper, who is also the Chief Creative Officer of Playboy Enterprises, also released a statement.\n\n“My father lived an exceptional and impactful life as a media and cultural pioneer and a leading voice behind some of the most significant social and cultural movements of our time in advocating free speech, civil rights and sexual freedom. He defined a lifestyle and ethos that lie at the heart of the Playboy brand, one of the most recognizable and enduring in history. He will be greatly missed by many, including his wife Crystal, my sister Christie and my brothers David and Marston, and all of us at Playboy Enterprises,” said Cooper.\n\nHefner quickly rose to fame after the first issue of men’s magazine Playboy published in December 1953, which featured a nude Marilyn Monroe. The same year, Hefner launched media and lifestyle company Playboy Enterprises, Inc., on which he served as a board member until the time of his death.\n\nIn an August 2017 interview, Hefner’s son Cooper, who took over as chief creative officer of Playboy Enterprises, admitted that it was hard to watch his father get older.\n\n“It’s tough to watch him struggle,” he told The Hollywood Reporter of his father getting older. “But I’m just happy it’s physical and not mental.\n\nHe is survived by his wife Crystal Harris and four children.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=435&h=228&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fhugh-hefner-9435.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=435&h=228&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fhugh-hefner-9435.jpg", "keywords": [], "authors": ["Karen Mizoguchi", "Dave Quinn"], "canonical_link": "https://people.com/celebrity/hugh-hefner-dead-celebrity-reactions/", "title": "Kim Kardashian, Jesse Jackson, Jenny McCarthy and More Mourn the Death of Hugh Hefner", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Death,Hugh Hefner,News,RIP,TV", "news_keywords": "Death,Hugh Hefner,News,RIP,TV", "description": "\"Hugh Hefner peacefully passed away today from natural causes at The Playboy Mansion, surrounded by loved ones,\" a rep for the Playboy founder told PEOPLE", "og": {"title": "Kim Kardashian, Jesse Jackson, Jenny McCarthy and More Mourn the Death of Hugh Hefner", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/celebrity/hugh-hefner-dead-celebrity-reactions/", "description": "He was a pioneer of the ’60s sexual revolution, a champion of civil rights and free speech, and created one of the most popular magazines&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=435&h=228&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fhugh-hefner-9435.jpg", "width": 435, "height": 228}}, "pinterest": {"url": "https://people.com/celebrity/hugh-hefner-dead-celebrity-reactions/", "description": "\"Hugh Hefner peacefully passed away today from natural causes at The Playboy Mansion, surrounded by loved ones,\" a rep for the Playboy founder told PEOPLE", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fhugh-hefner-9435.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/celebrity/hugh-hefner-dead-celebrity-reactions/", "title": "Kim Kardashian, Jesse Jackson, Jenny McCarthy and More Mourn the Death of Hugh Hefner", "description": "\"Hugh Hefner peacefully passed away today from natural causes at The Playboy Mansion, surrounded by loved ones,\" a rep for the Playboy founder told PEOPLE", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=435&h=228&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fhugh-hefner-9435.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}