{"url": "https://www.hollywoodreporter.com/live-feed/walking-dead-stars-father-reacts-show-exit-1066234", "text": "[Warning: This story contains major spoilers from episode 808, \"How It's Gotta Be,\" of AMC's The Walking Dead, as well as the comic book series on which the show is based.]\n\nGiven the magnitude of the twist, it's no surprise that many Walking Dead fans are upset about the looming departure of Carl Grimes, the young survivor played since season one by Chandler Riggs — and that list includes Riggs' own father, who took to social media to express his disappointment in Walking Dead showrunner Scott M. Gimple over how his son's exit was handled.\n\n\"Watching Gimple fire my son 2 weeks before his 18th birthday after telling him they wanted him for the next 3 years was disappointing,\" Riggs' father wrote on Facebook following the AMC zombie drama's midseason finale, in which Carl was revealed to be suffering from a fatal zombie bite. \"I never trusted Gimple or AMC, but Chandler did. I know how much it hurt him. But we do absolutely know how lucky we have been to be a part of it all and appreciate all the love from fans all these years!\"\n\nSpeaking with The Hollywood Reporter, Riggs stated the decision to leave The Walking Dead was not his own, despite speculation that he was eyeing an exit in order to focus on college.\n\n\"I'm taking a gap year right now to focus on acting for a while. Leaving Walking Dead wasn't my decision,\" Riggs told THR. \"I was planning on going to college until I found out. I found out when I was doing rehearsals for episode six back in June. It was quite the shocker for me, Andy and everyone because I don't think anyone saw it coming. It's definitely not a bad thing because it has been awesome being on the show but now I get to go and do a lot of other stuff that I haven't gotten to do before. Scott wanted to meet in person because it was such a big deal. We had just finished rehearsing for a scene in episode six and he wanted to meet with me and my mom and dad and talk about what's going to happen.\"\n\n\"That is a bite on his side. … It will play out as bites play out on the show,\" Gimple said Sunday on AMC's post-show Talking Dead, speaking about the character's exit. \"It's very important to Carl's story and the entire story, what happens in the next episode. I'm just focused on the fact that Carl right now is alive and he has some business to attend to. That is a one-way ticket. But I'd like to think that the things we see in the next episode are so important to his life and the other characters' lives.\"\n\nRiggs' impending exit from The Walking Dead is a shock for a number of reasons, including the fact that he is one of only five castmembers from the original season who still appear on the show. One of the others, Lennie James (Morgan), will depart The Walking Dead this season as well, joining the cast of Fear the Walking Dead for its fourth season.\n\nWhat's more, Carl remains an active presence in the Walking Dead comic books from Robert Kirkman and Charlie Adlard, on which the show is based. Many fans believed Carl would one day assume the lead role in the series, including Andrew Lincoln, who plays Rick Grimes, and has subsequently described Carl's demise as \"the biggest death\" of the entire series.\n\n\"My first reaction was silence,\" Lincoln told THR about his first reaction to learning of Carl's death. \"Scott Gimple called me up and said, 'You're going to hate this one.' He's very good about alerting the cast when there's going to be a [character] death. I tried guessing four times and was nowhere near Chandler Riggs' name. Scott had to say that it was Carl. I just didn't speak for a minute. I always thought Carl was going to be the one who led the show forward; that Rick would hand over his boots and revolver when he walked off into the sunset in season 28.\"\n\nIn the comics, Carl plays a central role in one of the story's most recent arcs, \"The Whisperer War,\" as his relationship with an outsider named Lydia causes a conflict between the Alexandrians and a group of survivors called the Whisperers, who walk among the walkers using flesh suits as camouflage.\n\n\"I was excited to do a lot of those storylines in the comics because there's a lot of really cool stuff,\" Riggs told THR. \"I'm more excited to do other things than The Walking Dead than I was excited about doing those things on Walking Dead.\"\n\nAMC did not immediately respond to a request for comment on the matter.\n\nFollow THR.com/WalkingDead for full coverage of the AMC zombie series, including our exclusive interview with Chandler Riggs and our conversation with series lead Andrew Lincoln.", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2017/12/the_walking_dead_s08e08_still_1.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/01/greg_berlanti_sharon_horgan_alex_kurtzman_and_dwayne_johnson_-_getty_-_h_2020.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/03/mrs._america_-_publicity_still_1-_h_2020_.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/blogicon_livefeed-black2.png", "https://cdn1.thr.com/sites/default/files/2017/12/the_walking_dead_s08e08_still_1.jpg"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/12/the_walking_dead_s08e08_still_1.jpg", "keywords": [], "authors": ["Josh Wigler", "Thrnews Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/live-feed/walking-dead-stars-father-reacts-show-exit-1066234", "title": "'Walking Dead' Star's Father Rips Showrunner for \"Firing\" Son", "meta_data": {"viewport": "width=device-width", "description": "Spoiler alert!", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/live-feed/walking-dead-stars-father-reacts-show-exit-1066234", "domain": "https://www.hollywoodreporter.com/", "title": "'Walking Dead' Star's Father Rips Showrunner for \"Firing\" Son", "description": "Spoiler alert!", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/12/the_walking_dead_s08e08_still_1.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "'Walking Dead' Star's Father Rips Showrunner for \"Firing\" Son", "description": "Spoiler alert!", "url": "https://www.hollywoodreporter.com/live-feed/walking-dead-stars-father-reacts-show-exit-1066234", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/12/the_walking_dead_s08e08_still_1.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "'Walking Dead' Star's Father Rips Showrunner for \"Firing\" Son", "sailthru.description": "Spoiler alert!", "sailthru.author": "Josh Wigler", "sailthru.channel": "Live Feed", "sailthru.vertical": "Live Feed", "sailthru.date": "2017-12-11 08:44:32", "sailthru.tags": "Live Feed, Television, The Walking Dead"}, "movies": [], "publish_date": 1512953072.0, "source": "https://www.hollywoodreporter.com", "summary": ""}