{"url": "https://studybreaks.com/culture/usa-gymnastics/", "text": "Hands shaking and heart pumping, athletes from all over the world take to the podium with tear-stained faces, radiant smiles and unbridled euphoria. They watch in genuine wonderment as their nation’s flag rises and the stadium resounds with the thunderous tones of their national anthem. These awe-inspiring moments draw the eyes of half the world to the Olympic Games, where spectators marvel at the unfathomable tenacity and strength of the world’s best athletes.\n\nYet those triumphant moments provide only superficial insight into an athlete’s tumultuous trek to victory. Their journeys took stamina and determination, but for too many athletes, it also took much more: their innocence, pride, self-worth and well-being, a merciless charge in exchange for success.\n\nIn too many cases, the winner is expected to take it all – the psychological and physical pain, the sexual abuse and the animosity of teammates in silence and with unfaltering national pride. Nowhere is this more evident or troubling than in USA Gymnastics.\n\nClad in sparkly, red-white-and-blue spandex, the female USA gymnasts are images of strength, grace and patriotism. Winning consecutive Olympic golds in 2012 and 2016, in addition to world championships in 2011, 2014 and 2015, the USA Women’s Gymnastics program has distinguished itself as a force to be reckoned with. The women have not only racked up quite the collection of gold medals, but they have also accrued millions of views and brought abundant media attention to the U.S. Olympic Committee and USA Gymnastics.\n\nDuring the 2012 London Summer Olympics, 38.7 million viewers tuned into NBC’s broadcast of the Women’s Gymnastics final, where the U.S. women dominated. In fact, in 2012, four of the five members of the “Fierce Five” ranked in the “Top 10 Most Clicked Athletes” on NBC’s Olympics.com, with Gabby Douglas leading with over 23 million clicks to her page. These women are the pride and joy of the U.S. Olympic Committee, not to mention national and international sensations.\n\nYou might also like: Michigan State Freshman Claims She Was Gang Raped by Basketball Players\n\nHowever, recent history has given a glimpse behind the curtain, revealing a revolting and disturbing truth: USA Gymnastics has created a deplorable culture that values its precious reputation more than the health and safety of its athletes. But the thinly veiled facade is beginning to fade, most notably with the well-founded sexual abuse allegations against USA Gymnastics doctor, Larry Nassar, by over 150 women and girls, according to CNN.\n\nAmong those victims were gymnasts Aly Raisman, McKayla Maroney, Gabby Douglas, Simone Biles and Jordyn Wieber. They each had a story to tell, rife with gruesome details of long-term abuse.\n\nIt is the dismaying story of McKayla Maroney, a “Fierce Five” member and silver medalist at the 2012 London Olympics, that perhaps most aptly encapsulates both Nassar’s menace and USA Gymnastics’ negligence. In the fall of 2017, Maroney made a startling announcement via Twitter that Nassar had abused her from the time she was thirteen years old until she left gymnastics in 2016, according to Time Magazine.\n\n“I had a dream to go to the Olympics, and the things that I had to endure to get there were unnecessary and disgusting,” Maroney said. The gymnast recounted a particularly traumatic event on a flight to Tokyo when Nassar gave her a sleeping pill. The next thing Maroney remembered was waking up alone with Nassar in his hotel room enduring one of his “treatments.” She was 15 years old.\n\nWhile it is shocking that a predator like Nassar was able to worm his way into this esteemed organization and continue his abuse for years without notice, the organization’s handling of the travesty was unprofessional, unpardonable and downright unethical.\n\nWhile USA Gymnastics commended Maroney’s courage when she publicly announced the horrors she endured, it soon came to light that a year earlier, the organization made her “sign a non-disclosure agreement as part of a financial settlement she needed to pay for psychological treatment,” according to NBC.\n\nOn Dec. 20, 2017, Maroney filed a lawsuit on the grounds that the agreement she signed was “hypocritical, immoral and in this case illegal,” said Maroney’s attorney. In response, on Jan. 16, 2018, USA Gymnastics ensured that it would not hound Maroney for any money should she choose to speak out. But even with this turnaround, the sheer reality that this rectification was even necessary is utterly unspeakable.\n\nA symphony of voices rose in corroboration of Maroney’s claims, and 156 women delivered grievous and powerful statements in front of Nassar’s very eyes during a seven-day-long trial. Aly Raisman, team captain of both the “Fierce Five” and the “Final Five,” has become a vocal advocate for her fellow victims and delivered a harrowing testimony at Nassar’s trial.\n\n“I have represented the United States of America in two Olympics and have done so successfully. And both USA Gymnastics and the United States Olympic Committee have been very quick to capitalize and celebrate my success,” Raisman said. “But did they reach out when I came forward? No.”\n\nYou might also like: Love or a Gold Medal? Two Olympic Ice Skaters Break Up to Win\n\nBut the sins of the organization did not develop overnight. In fact, this sickening culture laid down its roots many years ago. The Washington Post reported that since 1982, “more than 290 coaches and officials associated with the United States’ Olympic sports organizations have been publicly accused of sexual misconduct,” spanning 15 Olympic sports. Yet even aside from all the sexual abuse, the organizations’ transgressions still run deep, and if you pay close enough attention to history, the signs are evident.\n\nOne of the Olympics most spectacular and inspirational moments for the U.S. occurred during the 1996 Summer Olympics in Atlanta, Georgia, when U.S. gymnast Kerri Strug was exhorted by coach Bela Karolyi to perform the last vault on a critically sprained ankle. Despite her injury, she completed the vault, and led the U.S. women to victory over the Russians for the first time ever. However, malevolence lurks even in the Games’ most glorified moments.\n\nThe first feeling the video elicits from viewers is almost always one of admiration for the 18-year-old Strug, who somehow miraculously landed on one foot. But when you witness the agonizing pain on this young girl’s face, and Karolyi’s seemingly heartless coercion, the picture slowly turns from heartening to unsettling. To make matters worse, one of the doctors helping Strug off the stage is none other than Larry Nassar himself.\n\nFrom being forced to practice on broken limbs, doping at the urging of coaches and acquiescing to irrational diets, Olympic athletes withstand unthinkable afflictions and tribulations en route to domination at the Games.\n\nThe 2017 feature film “I, Tonya,” provided yet another startling reminder of the cutthroat nature of the Games; it resurrected the 1994 attack on U.S. Olympic ice skater Nancy Kerrigan, which soon implicated Tonya Harding, her own teammate and possible conspirator in the attack.\n\nYou might also like: Randolph College’s Meredith Alwine Is Lifting Herself to the 2020 Olympics\n\nWithout the most fundamental trust and security shared between teammates, coaches and doctors, the Olympics will cease to be a place where athletes can flourish. It will become their personal hell. Olympic gold medal winner Shawn Johnson even went so far as to say in a YouTube video on her channel, “I think gymnastics is the best sport in the entire world, but if I had a daughter right now, I wouldn’t put her in it.”\n\nWith news stories, personal testimonies and unearthed history inundating almost every media platform, it has become increasingly difficult to look past the Games’ faults and focus on their worth. In order to preserve an honorable tradition and progress in a positive way, major reform is necessary.\n\nThe U.S. Olympic Committee needs to genuinely recommit itself to cultivating an organization characterized for its emphasis on unity, not duplicity. In addition, the U.S. Olympic teams must forge environments that do not alienate future generations of athletes, but instead encourage and ignite the most inspired work and dedication they can give.\n\nThere is a black, rotting hole corroding the Games from the inside, and now is the time to wipe it out. Let the upcoming PyeongChang 2018 Olympic Winter Games be the birthplace of a new era, so when these world-class athletes take the stage, country flags ascending and anthems blaring, they can be filled with authentic, unadulterated ardor for the organization and country whose names they proudly bear.", "images": ["https://studybreaks.com/wp-content/uploads/2020/04/2020_04_07_92080_1586229616._large-500x500.jpg", "https://studybreaks.com/wp-content/uploads/2020/03/Oscars-and-animation-cover.jpg", "https://studybreaks.com/wp-content/uploads/2020/04/woman-1006100_1920-e1587056165799-500x500.jpg", "https://www.facebook.com/tr?id=1981960861848732&ev=PageView\n&noscript=1", "https://studybreaks.com/wp-content/uploads/2020/03/nina.jpg", "https://studybreaks.com/wp-content/uploads/2018/02/170623170308-north-korea-winter-olympic-team-2010-super-tease-500x500.jpg", "https://studybreaks.com/wp-content/uploads/2020/04/31784BEF-7A67-448E-8608-7A462C8F1570_1_201_a-500x500.jpeg", "https://studybreaks.com/wp-content/uploads/2020/03/female-entrepreneurs.jpg", "https://studybreaks.com/wp-content/uploads/2017/09/untitled-2.jpg", "https://studybreaks.com/wp-content/uploads/2018/02/Larry-Nassar-Trial.jpg", "https://studybreaks.com/wp-content/uploads/2020/04/study-drugs-500x500.jpg", "https://studybreaks.com/wp-content/uploads/2020/03/Image-from-iOS-5-3.jpg", "https://studybreaks.com/wp-content/uploads/2020/04/Mira-Royal-Detective.jpg", "https://studybreaks.com/wp-content/uploads/2020/04/killingeve222-e1587065993299-500x500.jpg", "https://studybreaks.com/wp-content/uploads/2020/03/Image-from-iOS-84.jpg", "https://go.ezoic.net/utilcave_com/img/ezoic.png", "https://studybreaks.com/wp-content/uploads/2018/03/tdy_mk_news_jacob_moore_180306_1920x1080.today-vid-canonical-featured-desktop-500x500.jpg", "https://pixel.quantserve.com/pixel/p-31iz6hfFutd16.gif?labels=Domain.studybreaks_com,DomainId.76173", "https://studybreaks.com/wp-content/uploads/2020/04/Image-from-iOS-90.jpg", "https://studybreaks.com/wp-content/uploads/2020/03/Image-from-iOS-4-3.jpg", "https://studybreaks.com/wp-content/uploads/2018/02/Screen-Shot-2018-02-04-at-6.00.53-PM.png", "https://studybreaks.com/wp-content/uploads/2018/02/USA-Gymnastics.jpg", "https://studybreaks.com/wp-content/uploads/2020/04/challenges_web.jpg", "https://studybreaks.com/wp-content/uploads/2020/04/F784E2C5-1E97-4E2A-80D9-D4DB13FEAD9F_1_201_a-500x500.jpeg", "https://studybreaks.com/wp-content/uploads/2020/03/1800x1200-Karunya.jpg", "https://studybreaks.com/wp-content/uploads/2017/12/03_Russia.jpg", "https://studybreaks.com/wp-content/uploads/2018/02/gettyimages-872711922-1514993850-500x500.jpg", "https://i.imgur.com/nkMC23h.gif", "https://studybreaks.com/wp-content/uploads/2018/05/larry-nassar-court-02-gty-jc-180125_4x3_992-500x500.jpg", "https://studybreaks.com/wp-content/uploads/2018/02/gettyimages-872711922-1514993850.jpg", "https://studybreaks.com/wp-content/uploads/2018/04/ct-michigan-state-suspensions-sex-assault-20170209-500x500.jpg", "https://studybreaks.com/wp-content/uploads/2020/04/Blackfishing_Web.jpg", "https://studybreaks.com/wp-content/uploads/2018/01/2017-02-06-cross-country-pyeongchang2018-inside-03.jpg", "https://studybreaks.com/wp-content/uploads/2020/04/Image-from-iOS-87.jpg", "https://studybreaks.com/wp-content/uploads/2018/01/nbc.0.png.jpeg", "https://studybreaks.com/wp-content/uploads/2017/08/paris-2024-olympic-games.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=20015427&cv=2.0&cj=1", "https://studybreaks.com/wp-content/uploads/2018/01/26609915_1702972669753941_132579717_o.jpg", "https://studybreaks.com/wp-content/themes/studybreaks/assets/img/logo-mobile2-footer.png", "https://studybreaks.com/wp-content/uploads/2018/02/olympics1-1-500x352.jpg", "https://studybreaks.com/wp-content/themes/studybreaks/assets/img/logo-mobile2.png", "https://studybreaks.com/wp-content/themes/studybreaks/assets/img/sb-icon.jpg", "https://studybreaks.com/wp-content/uploads/2017/11/DSC_0340.jpg"], "top_img": "https://studybreaks.com/wp-content/uploads/2018/02/USA-Gymnastics.jpg", "keywords": [], "authors": ["Sarah Lynch", "Marist College", "You Might Also Like"], "canonical_link": "https://studybreaks.com/culture/usa-gymnastics/", "title": "The Dark Side of USA Gymnastics", "meta_data": {"viewport": "width=device-width, initial-scale=1", "og": {"type": "article", "title": "The Dark Side of USA Gymnastics", "description": "In the wake of a highly publicized scandal, disrepute and depravity mar the honor of USA Gymnastics within the Olympic Games.", "image": {"identifier": "https://studybreaks.com/wp-content/uploads/2018/02/USA-Gymnastics.jpg", "width": 1700, "height": 1133}, "url": "https://studybreaks.com/culture/usa-gymnastics/", "site_name": "Study Breaks", "updated_time": "2018-02-19T14:13:57-06:00"}, "article": {"author": "https://www.facebook.com/mark.stenberg.79", "publisher": "https://www.facebook.com/studybreaks/?ref=aymt_homepage_panel", "published_time": "2018-02-05T17:00:24-06:00", "modified_time": "2018-02-19T14:13:57-06:00"}, "twitter": {"card": "summary_large_image", "title": "The Dark Side of USA Gymnastics", "description": "In the wake of a highly publicized scandal, disrepute and depravity mar the honor of USA Gymnastics within the Olympic Games.", "image": "https://studybreaks.com/wp-content/uploads/2018/02/USA-Gymnastics.jpg", "site": "@https://twitter.com/Study_Breaks", "creator": "@MarkStenberg3"}, "description": "In the wake of a highly publicized scandal, disrepute and depravity mar the honor of USA Gymnastics within the Olympic Games.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "generator": "WordPress 5.4", "onesignal": "wordpress-plugin", "msapplication-TileImage": "https://studybreaks.com/wp-content/uploads/2017/11/cropped-logo-270x270.jpg"}, "movies": [], "publish_date": 1517871624.0, "source": "https://studybreaks.com", "summary": ""}