{"url": "www.plasticsurgerypeople.com/beyonce-plastic-surgery/", "text": "As one of the most successful music artists of all time, Beyonce doesn’t seem to have a beauty misstep. No matter what the occasion, Queen B manages to look good in front of the cameras. And because she’s the epitome of perfection, she has been the subject of plastic surgery rumors all the time.\n\nTop cosmetic surgeons think she had rhinoplasty soon after she debuted her career. Other experts, on the other hand, have tried to assess if her growing breast size is real or fake, or due to her pregnancies. They also wanted to know if the pregnancy hormones affected her lips or she simply got fillers?\n\nAs a huge celebrity with a stunningly flawless appeal, people can’t help but talk about Beyonce’s appearance. From botox, boob job to butt injections, there will always be endless scrutiny about her face and body. There was even a panel in Germany that consisted of 450 plastic surgeons from around the world who determined that her bootylicious large butt was the “best bum in the world.”\n\nBut did Bey ever say anything about getting beauty enhancements? When her star power was just coming into the radar, in her early 20s, Beyonce did say that she was not OK with cosmetic surgery, but she also added that she could change her mind when she’s older.\n\nSo, has that time finally arrived?\n\nBefore & After Photos\n\nIn order to find out whether Beyonce had any cosmetic procedures, we will go over her photos before and after she became famous. This should tell us whether there’s any beauty “SECRETS” behind her perfect looks all these years.\n\nDid Beyonce Have Boob Job?\n\nBeyonce’s breasts definitely look larger and fuller now than before, as seen in these photos. Arguably, however, a woman’s bra size can change naturally due to hormones and weight gain.\n\nBut one top surgeon, Anthony Youn of the American Society of Plastic Surgeons, assessed that Beyonce did have breast surgery that made her boobs look naturally rounder and bustier. It complemented the size and shape of her body as well.\n\nMeanwhile, other cosmetic experts don’t believe that Beyonce had breast implants nor has she underwent a fat transfer procedure for her chest.\n\nHas She Had Butt Augmentation?\n\nBeyonce’s butt has the perfect waist-to-bum ratio and 450 experts can’t be wrong, right? In a study about bum size at the Technical University Munich, half of the plastic surgeons agreed that her bottom has the most attractive shape and size.\n\nThe star’s followers on Instagram are convinced she had butt implants. At the very least, she might have had fat injections to lift its shape. But Beyonce’s solid fan base came to her defense and said that she’s naturally blessed in the buttock area.\n\nAnd what was Beyonce’s reply about the butt injection rumors? She said she’s on the treadmill every single day and eats mostly lettuce to keep herself in shape.\n\nDoes Beyonce Bleach Her Skin?\n\nThe respected Queen B, who is idolized by legions of women of all colors, has been the subject of skin bleaching rumors as well. People have been noticing that Beyonce’s skin color has been lightening over the years.\n\nThe transformation is subtle, however, and some surmised that she didn’t actually get bleached. Instead, Beyonce seems to know how to properly take care of her dark natural skin with creams and products that make her appear glowing and radiant. She also probably applies a good sun protection with strong SPF.\n\nDid Beyonce Get A Nose Job?\n\nThe superstar’s nose used to be wider with a lower nasal bridge, as seen in these before and after pics. The difference between her old and new nose was too obvious for the experts, though.\n\nPlastic surgeons said that she definitely got a nose job to improve its shape. Beyonce’s nose was believed to have been narrowed down with a carefully planned nose surgery and its tip was expertly refined. If this is true, then her doctor actually did a great job.\n\nDoes She Have Lip Injections?\n\nLoud talks about Beyonce’s lips prompted her rep Yvette Noel-Schure to issue a statement to address those lip injections rumors. She slammed body shamers who criticized the superstar’s appearance while pregnant for the second time.\n\nThe rep denied that Beyonce had fillers or even botox when she was carrying twins. She said that the music legend’s upper lip changed because of pregnancy hormones. A plastic surgeon, Dr. Nestor Demosthenous, agreed that her pregnancy contributed to her swelling lips.\n\nWhat do you think?\n\nWhat About Beyonce’s Teeth?\n\nBecause she sings for a living, Beyonce has to have perfect teeth and she actually does take good care of her pearly whites very well. In videos she shares on Instagram, Beyonce makes flossing a family affair with her daughter Blue Ivy. She’s also rumored to use a Philips DiamondClean Sonicare toothbrush, which has the most advanced technology to keep her teeth and gums healthy.\n\nBeyonce had a braces phase, too, and even went to red carpet events with grills. Technically, however, Beyonce’s teeth aren’t bad, according to a top dentist, but she likely had veneers and addtional work done on her gumline.\n\nDid She Have Tummy Tuck & Liposuction?\n\nJust a month after debuting new babies on Instagram, fans immediately noticed her flat stomach. It prompted speculations that Beyonce had a tummy tuck after giving birth because — how else did she get such a perfect post baby body so quickly?\n\nIt’s a procedure she might have done before, too. In her early years as a rising star, Beyonce was also rumored to have undergone liposuction to remove the fat on her stomach while her lower body got fuller, particularly around the thighs and hips.\n\nBeyonce’s Beauty Transformation\n\nWant to see how Beyonce’s looks and style have changed throughout the years? Let’s take a quick look below and we might even pick up other plastic surgeries that we may have missed.\n\nEarly Childhood\n\nSource: Pinterest\n\nWhen she was a young and budding superstar, Beyonce had a cute and chubby face. Doesn’t she look like little Blue Ivy in this photo? As a child, Beyonce was already a pretty kid.\n\nTeenager Days\n\nSource: Twitter\n\nA skinny Beyonce used to be part of a church choir in her teens. Here she was performing solo and appears to have whiter skin in this photo, so this should put the skin lightening rumors to rest. But then….it could just be the effects of the camera flashlight.\n\nYear 1998\n\nSource: Reddit\n\nBeyonce became part of Destiny’s Child and she used to have a bigger nose then. We love the dramatic effect of the makeup on her eyes but her dark lipstick made her look older.\n\nYear 2001\n\nSource: Facebook\n\nGorgeous Beyonce with the dazzling hair celebrated with Destiny’s Child following the success of their album “Survivor,” and this was around the time when her nose job rumors started. Notice that she had a smaller cup size here?\n\nYear 2003\n\nSource: Pinterest\n\nBeyonce debuted her solo album, “Dangerously in Love”, and went with a fuzzy and wild curly hairstyle. Her face shape seemed unchanged but her chin curiously has a noticeable bump, although we doubt it’s chin implant. Again, we love what her makeup artist did for her eyes in this look.\n\nYear 2007\n\nPhoto Credit: Getty\n\nBeyonce walked the American Music Awards red carpet at the Nokia Theatre in Los Angeles, California. Her boobs were noticeably bigger so was it push up technique or breast implants that contributed to her larger bust size?\n\nThe superstar looked radiant with her fancy earrings and matching massive ring. Gorgeous!\n\nYear 2012\n\nCredit: Getty Images\n\nShe appeared to have healthy-looking cheeks and perfectly high cheekbones in this photo. Is it just a makeup trip or cheek implants? Meanwhile, her eyebrows looked naturally unkept, while her eyelids had a hint of sparkly makeup. She looked so refreshing here.\n\nYear 2014\n\nImage Credit: Getty\n\nBeyonce performed at the MTV Video Music Awards looking a bit heavier than usual. She might have gained weight but her legs looked so strong and shapely still. She might have gotten a thigh lift to enhance the shape of her big thighs.\n\nYear 2015\n\nSource: Pinterest\n\nRumors of her lip injections surfaced because of her uneven upper lips. It was not easy to ignore the puffiness. Fans also suspected she had a facelift and a browlift because her face appeared stretched. They think she had botox as well because her face looked so smooth.\n\nYear 2016\n\nPhoto Credit: Getty\n\nBeyonce graced the Met Gala in a form-fitting latex dress that showed off her body and butt size. Her sexy behind led to talks that she had either a bum augmentation via implants or a professional Brazilian butt lift.\n\nYear 2017\n\nreport this ad\n\nPhoto Credit: Getty Images\n\nDespite Beyonce announcing that she was expecting twins, people thought it was another fake pregnancy. But she shunned the unbelievers when she performed at the Grammys with her baby bump and her very pregnant body in full view of everyone.\n\nYear 2018\n\nPhoto Credit: Getty / Kevin Mazur\n\nPost pregnancy, Beyonce performed at the Coachella and did not disappoint. She showed off her very shapely form after apparently undergoing a rigid weight loss and diet routine. Though she swears she did exercise and workout regulary, fans think Beyonce had a tummy tuck. We noticed her legs also slimmed down.\n\nMore Information About Beyonce:\n\nReal Name: Beyoncé Giselle Knowles-Carter\n\nBirthday: 4th September 1981\n\nStar Sign: Virgo\n\nBirth Place: Houston, Texas, United States\n\nNationality: American\n\nRace / Ethnicity: African-American, French, Acadian\n\nOccupation: Singer, Songwriter, Actress, Businesswoman, Music Producer\n\nNet Worth: $350 Million\n\nRelationship: Married to Jay-Z (Shawn Corey Carter)\n\nChildren: Blue Ivy Carter, Sir Carter, Rumi Carter\n\nHeight: 1.69 m (5 ft 7 in)\n\nWeight: 62 kg (137 lb)\n\nBody Measurement: 35-26-39 Inches\n\nBra Size: 32C\n\nDress Size: 8 (US)\n\nShoe Size: 8.5 (US)\n\nNatural Hair Color: Black\n\nNatural Eye Color: Dark Brown\n\nConclusion\n\nWe can say that Beyonce’s flawless perfection is a mix of her natural gifts and plastic surgery. Despite never acknowledging that she had a boob job, it’s plain as day that she might’ve had work done on her boobs at the start of her career. She may have also gotten a nose job and if correct, we think her surgeon did an amazing job!\n\nAs for the rumors about her skin whitening procedure, we can credit Beyonce for simply taking good care of her skin. Her butt and thighs, on the other hand, could be the result of a great workout indeed. She also has to be commended for taking good care of her teeth.\n\nThe verdict is still out there for her lip injections as even top surgeons can’t agree whether it’s due to hormones or secret cosmetic enhancements.\n\nWhatever the case may be, Beyonce’s facial and body features will always be a fascination for the public. Perhaps that’s the price you have to pay for being the Queen.\n\n(Featured Photo Credit: Getty Images)\n\nSee other celebs before and after plastic surgery", "images": ["https://www.plasticsurgerypeople.com/wp-content/uploads/2018/06/cardi-b-featured.jpg", "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/06/beyonce-teeth.jpg", "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/07/kellyanne-conway-featured.jpg", "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/06/beyonce-1998.jpg", "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/06/young-beyonce.jpg", "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/06/beyonce-2014.jpg", "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/06/beyonce-2017.jpg", "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/06/beyonce-butt-implants.jpg", "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/06/beyonce-2016.jpg", "https://www.plasticsurgerypeople.com/wp-content/uploads/2019/06/carrie-underwood-featured-218x150.jpg", "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/06/beyonce-2018.jpg", "https://go.ezoic.net/utilcave_com/img/ezoic.png", "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/06/beyonce-2007.jpg", "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/06/beyonce-2001.jpg", "https://www.plasticsurgerypeople.com/wp-content/uploads/2019/04/psp-logo.png", "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/06/beyonce-lip-injections.jpg", "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/06/beyonce-skin-bleaching.jpg", "http://pixel.quantserve.com/pixel/p-31iz6hfFutd16.gif?labels=Domain.plasticsurgerypeople_com,DomainId.107302", "https://www.plasticsurgerypeople.com/wp-content/uploads/2019/05/niykee-heaton-featured-218x150.jpg", "https://www.plasticsurgerypeople.com/wp-content/uploads/2019/07/miley-cyrus-featured-218x150.jpg", "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/06/beyonce-2003.jpg", "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/06/beyonce-2015.jpg", "https://www.plasticsurgerypeople.com/wp-content/uploads/2019/04/psp-logo-footer.png", "https://www.plasticsurgerypeople.com/wp-content/uploads/2019/04/psp-logo-mobile.png", "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/07/park-min-young-featured.jpg", "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/06/beyonce-teen.jpg", "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/06/beyonce-featured.jpg", "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/06/beyonce-nose-job.jpg", "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/06/beyonce-boob-job.jpg", "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/06/beyonce-tummy-tuck.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=20015427&cv=2.0&cj=1", "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/06/beyonce-2012.jpg"], "top_img": "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/06/beyonce-featured.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.plasticsurgerypeople.com/beyonce-plastic-surgery/", "title": "Beyonce's Plastic Surgery SECRETS? (Before & After Photos 2018)", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "og": {"image": {"identifier": "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/06/beyonce-featured.jpg", "secure_url": "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/06/beyonce-featured.jpg", "width": 800, "height": 500}, "locale": "en_US", "type": "article", "title": "Beyonce's Plastic Surgery SECRETS? (Before & After Photos 2018)", "description": "As one of the most successful music artists of all time, Beyonce doesn’t seem to have a beauty misstep. No matter what the occasion, Queen B manages to look good in front of the cameras. And because she’s the epitome of perfection, she has been the subject of plastic surgery rumors all the time. Top …", "url": "https://www.plasticsurgerypeople.com/beyonce-plastic-surgery/", "site_name": "Plastic Surgery People", "updated_time": "2019-07-08T11:42:37+00:00"}, "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "article": {"section": "Female Singers", "published_time": "2018-06-13T13:37:50+00:00", "modified_time": "2019-07-08T11:42:37+00:00"}, "twitter": {"card": "summary", "description": "As one of the most successful music artists of all time, Beyonce doesn’t seem to have a beauty misstep. No matter what the occasion, Queen B manages to look good in front of the cameras. And because she’s the epitome of perfection, she has been the subject of plastic surgery rumors all the time. Top […]", "title": "Beyonce's Plastic Surgery SECRETS? (Before & After Photos 2018)", "image": "https://www.plasticsurgerypeople.com/wp-content/uploads/2018/06/beyonce-featured.jpg"}, "google-site-verification": "LiG6kcGakCQCxpR--UJKcTAfGnunK7Zxi8bRvH8aRRk"}, "movies": [], "publish_date": 1528897070.0, "source": "http://www.plasticsurgerypeople.com", "summary": ""}