{"url": "tinybuddha.com/blog/dealing-with-disappointing-relationships-change-your-expectations/", "text": "“If you can’t change the circumstances, change your perspective.” ~Unknown\n\nSometimes it feels as if you are completely in control of your life, but when it comes to relationships there’s always the other person.\n\nIn a relationship, you can’t be the puppeteer. People have their own emotions, behaviors, actions, beliefs, scars, wounds, fears, dreams, and perspectives. They are their own person.\n\nHow often have you wanted a relationship to be something that it was not?\n\nHow many times have you said a certain word or phrase in order to spark a specific reaction?\n\nHow much do you expect from this person? Do they fail you each and every time?\n\nIn healthy relationships there are certain expectations, like being treated well or being respected. Yet sometimes we find ourselves in relationships that don’t mirror what we anticipate to happen. We may feel hurt or used.\n\nWe cannot expect other people to treat us as we would treat them. We cannot assume anything or force change upon someone who clearly demonstrates he or she is stuck in his or her own way.\n\nWith eyes full of clarity, I am capable of changing the relationships in my life by adjusting my point of view.\n\nI call my father a sperm donor. He gave me life but never showed up in my life.\n\nMy friends at school never knew I had a father because they never saw him. He missed all of the concerts and sports games. For the majority of my life, we didn’t talk. He didn’t acknowledge me—no birthday calls. I had no idea where my dad lived. Some days I was not sure he was still alive.\n\nIn high school, my dad limped back into my life. I could stop by his apartment and visit him when I wanted to. If I called him, he would pick up the phone. Things were changing between us.\n\nBlindingly bright, his true colors revealed themselves the night before my high school graduation when I called to make sure he was coming. He said he couldn’t attend because he had to drive a friend to the airport. Cabs exist. His friend could have used one. I was angry, sad, and most of all, hurt.\n\nRejection from my father has been the hardest thing for me to accept. It is not easy to grasp the idea that someone who once loved me, adored me, gave life to me could turn his back and walk away so easily.\n\nI could no longer take the feelings of disappointment.\n\nThese feelings were a direct result of what I was expecting from him:\n\nAssuming he would respond to things as I would.\n\nAssuming he would care like I do.\n\nAssuming he thinks in a similar way as I do.\n\nI was living in a fantasyland of my hopes, dreams, ideas, beliefs, expectations, and assumptions.\n\nI was hurting myself most.\n\nFor the protection of my emotional body, I changed my perception from what I hoped would happen to being open to experience whatever actually happens.\n\nThis shift didn’t occur immediately, but by following the five steps listed below I was able to come to peace with the type of relationship I have with my father.\n\n1. Be aware of reality.\n\nAcknowledge the other person’s behaviors. Look at patterns and how they regularly treat you. Remember the feelings you had in the past. Don’t be fooled into believing things are different from how they are.\n\n2. Stop manipulating situations.\n\nMany times we yearn for specific responses, like validation and approval. When we do not receive what we want, we may speak or behave in certain ways to try to elicit the desired reaction.\n\nThis type of behavior leaves us feeling empty when the other person does not react the way we hope they would. Remember, you cannot change anyone; it is up to them to change.\n\n3. Let go.\n\nThrow expectations and assumptions out the door. Release the hopes, wishes, and dreams that things will change by detaching from the ideas.\n\nGet out of the fantasy world by not hooking into the thoughts of what could be. Keep your mind from running into the future. Remain open to all possibilities by staying in the present moment.\n\n4. Focus on those who love you.\n\nIt will be easier to follow the third step if you remind yourself of those who are there for you. They continue to be there because they care about you. Focus on people who make you feel loved, connected, cared for, and worthy. Reach out to them and reconnect.\n\n5. Learn to love yourself.\n\nProvide yourself with what you are yearning for (compliments, compassion, or encouragement). Only you know what you truly need.\n\nRealize each moment you are being the best you at that time. Build self-confidence and strive to eliminate any doubts you have about yourself. When you feel shaky or alone, look in your eyes in the mirror and say, “I love you.” Nurture yourself. Feel the love you have inside of yourself.\n\nLet go of your expectations of people and see how your relationships change. And if you don’t feel differently about it or if it’s not benefiting you, you can always walk away. Your emotional state matters most. You cannot control other people, but you can make yourself happy.\n\nPhoto by Don\n\nAbout Khrystle Rea Khrystle Rea is a certified health + fitness coach who helps women kick anxiety to the curb naturally. She is all about creating a calm lifestyle with food, thoughts, and exercise. Learn more about her and what she does at www.khrystlerea.com.", "images": ["https://cdn.tinybuddha.com/wp-content/uploads/2020/04/Missed-target-150x150.png", "https://cdn.tinybuddha.com/wp-content/uploads/2020/03/tb-newsubbox.png", "https://cdn.tinybuddha.com/wp-content/themes/tinybuddha/images/social-icons/Pinterest.png", "https://cdn.tinybuddha.com/wp-content/uploads/2014/01/Disappointed.jpg", "https://cdn.tinybuddha.com/wp-content/uploads/2019/05/header-widget2019.png", "https://cdn.tinybuddha.com/wp-content/themes/tinybuddha-v2-pp/images/lori.jpg", "https://secure.gravatar.com/avatar/e038524fe10da869caf2f0ad2203d63c?s=100&d=https%3A%2F%2Ftinybuddha.com%2Fwp-content%2Fuploads%2F2018%2F09%2Ftb-avatar.png&r=g", "https://cdn.tinybuddha.com/wp-content/uploads/bt/bt-green-buddha.png", "https://cdn.tinybuddha.com/wp-content/themes/tinybuddha/images/social-icons/Twitter.png", "https://cdn.tinybuddha.com/wp-content/uploads/2020/04/Worried-150x150.png", "https://cdn.tinybuddha.com/wp-content/uploads/2020/04/keep11-150x150.jpg", "https://cdn.tinybuddha.com/wp-content/themes/tinybuddha/images/logo.png", "https://cdn.tinybuddha.com/wp-content/themes/tinybuddha/images/social-icons/Google+.png", "https://cdn.tinybuddha.com/wp-content/themes/tinybuddha/images/social-icons/Facebook.png", "https://cdn.tinybuddha.com/wp-content/uploads/2018/10/Love-206x137.png", "http://googleads.g.doubleclick.net/pagead/viewthroughconversion/858237512/?guid=ON&script=0", "https://cdn.tinybuddha.com/wp-content/uploads/2020/04/HumanKind-cover2-150x150.png", "https://cdn.tinybuddha.com/wp-content/uploads/2018/11/Friends-206x137.png", "https://www.facebook.com/tr?id=444596113074787&ev=PageView&noscript=1", "https://cdn.tinybuddha.com/wp-content/themes/tinybuddha/images/social-icons/Stumbleupon.png", "https://cdn.tinybuddha.com/wp-content/uploads/2020/04/We-will-love-harder-300x300.png", "https://cdn.tinybuddha.com/wp-content/uploads/2020/04/Estranged-150x150.png"], "top_img": "https://cdn.tinybuddha.com/wp-content/uploads/2014/01/Disappointed.jpg", "keywords": [], "authors": ["Khrystle Rea"], "canonical_link": "https://tinybuddha.com/blog/dealing-with-disappointing-relationships-change-your-expectations/", "title": "Dealing with Disappointing Relationships: Change Your Expectations", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "title": "Dealing with Disappointing Relationships: Change Your Expectations - Tiny Buddha", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "description": "Your relationships will change if you let go of expectations--unless it's better to walk away. You can't control others, but you can make yourself happy.", "og": {"locale": "en_US", "type": "article", "title": "Dealing with Disappointing Relationships: Change Your Expectations", "description": "Your relationships will change if you let go of expectations--unless it's better to walk away. You can't control others, but you can make yourself happy.", "url": "https://tinybuddha.com/blog/dealing-with-disappointing-relationships-change-your-expectations/", "site_name": "Tiny Buddha", "updated_time": "2016-11-17T17:32:07+00:00", "image": {"identifier": "https://cdn.tinybuddha.com/wp-content/uploads/2014/01/Disappointed.jpg", "secure_url": "https://cdn.tinybuddha.com/wp-content/uploads/2014/01/Disappointed.jpg", "width": 640, "height": 427}}, "article": {"publisher": "https://www.facebook.com/tinybuddha", "tag": "wisdom", "section": "Blog", "published_time": "2014-01-02T03:40:48+00:00", "modified_time": "2016-11-17T17:32:07+00:00"}, "twitter": {"card": "summary", "description": "Your relationships will change if you let go of expectations--unless it's better to walk away. You can't control others, but you can make yourself happy.", "title": "Dealing with Disappointing Relationships: Change Your Expectations", "site": "@tinybuddha", "image": "https://cdn.tinybuddha.com/wp-content/uploads/2014/01/Disappointed.jpg", "creator": "@tinybuddha"}}, "movies": [], "publish_date": 1388634048.0, "source": "http://tinybuddha.com", "summary": ""}