{"url": "https://realityblurb.com/2018/02/28/real-housewives-beverly-hills-recap-bethenny-lisa-go-head-head/", "text": "The Real Housewives of Beverly Hills are still in NYC. Still parading modeling daughters around. This time, it’s Camille wanting “Mason to shine.” Man, it seems like a lot of these mommas are living vicariously through their kids.\n\nWhile Camille swoons over her model daughter, the rest of the ladies head into the limo van to come to the fashion show. It is the most awkward car ride ever. “I did not know that Dorit was capable of not talking for this long. Which is making me a lot more uncomfortable.” You and me both, Kyle. Dorit claims that she “doesn’t wanna be here,” but no one truly wants to miss THE fashion show at the Intrepid.\n\nThe ladies roll up to support Camille’s daughter, Mason, who kinda looks like a possessed doll as she stomps down the runway. “I can relate so much to what Camille is going through…because of my own daughters.” Ah, yes. It was only a matter of time before Rinna had to bring up her wanna-be Haddid daughters. So classic. Erika claims that Mason looks fabulous, although I am not quite sure how she is even seeing anything with those shades on. It is cute to hear how proud Camille is and it is quite refreshing to hear a mother talk like a mother, and not like a Rinna. #solidwork. As the ladies pile back into the van post fashion show, the tension is so thick you could cut it with a knife.\n\nNo time to waste- everyone has to get ready for the evening’s festivities. Watching Erika prep for a night out is my most favorite thing ever. Mainly because I love Mikey, her creative director. Erika legit has 37 people styling her for Kyle’s “in-store” and you would almost think that it was for the Oscar’s. Apparently everyone needs a village to get ready. Kyle is even feigning short hair because #NewYork.\n\nRinna pops in to find out exactly what is happening to cause all the silence in the van. She was too wasted the night before to truly know what the heck happened to cause the rift in the group. Kyle tells Rinna how she tries to defend Lisa all of the days and Rinna tells Kyle that she is a good friend. “Guess what Kyle? You would throw yourself in front of a f*cking bus for (LVP).” Rinna is finally catching on and states that “threesomes don’t work.” Ah yes, Rinna. Truer words have never been spoken. Kyle, Dorit, and LVP REALLY have to figure out their issues.\n\n“I always dress according to my mood, so I am wearing a vampire shirt because I feel like there was blood drawn last night. And it was mine”- Dorit explaining her cool t-shirt. She decides it would be best to talk to LVP and try to get back on her good side. It doesn’t seem likely that things will ever be the same again for LVP and Dorit. Dorit very clearly knows she is in the dog house with LVP, especially when LVP says she feels “a little bit hurt” by Dorit. Lisa lays into her and reminds Dorit of alllllllll the things she has ever said. “You’re needy and jealous….” Blah, blah, blah. LVP feels that it is “derogatory” and I don’t blame her. She also tells Dorit that just because her AND Kyle talked smack about Lisa doesn’t make it any better. Amen, sister. Lisa states that she loves Dorit, mainly cuz she loves Dorit’s husband, so therefore she cannot spoil this relationship. OUCH…After a lot of back and forth, the two of them decide to not have someone (KYLE) come between their friendship.\n\nOver at Kyle’s New York store’s trunk show, Kyle shares that she feels super weird now that her friendship is strained with LVP. Instead of heading to the store early with LVP, Kyle is stuck with Teddi-the-dud. Teddi fakes interest in the kaftans and the “amazing creations” Kyle’s 19 year-old godson designed. Everyone is at the trunk show. The Fat Jewish. Bethenny Frankel!!!! How cool is Kyle for getting the most fabulous party guests?\n\nBethenny’ s intensity is a lot for Teddi to handle, so it’s a blessing that the rest of the ladies finally make it to the trunk show…45 minutes late. Blame Dorit. Notice that she always seems to have a problem arriving places on time?? “Now Kyle has Bethenny as a back-up” and clearly LVP is uncomfortable going against this firecracker. I would be, too. LVP states that she is “a bigger person so, there…thuck you…I mean thank you.” Bethenny forces LVP to apologize to Kyle and it is incredible. That is why I love New York. None of this Beverly Hills fake business.\n\nLater, the ladies awkwardly model colorful fur jackets and Erika tries to woo Bethenny with her upcoming business ventures. Bethenny is not quite impressed. Erika describes Bethenny as “one of those big dogs who like to pee all over everything.” HA! Kyle later explains to Rinna that she is done kissing LVP’s a*s. Yea. I’ll believe it when I see it. Just like Kyle is over Dorit…until she has a one on one with her. Kyle explains that she “adores” Dorit. “The three of us together have the best time,” explains Dorit and she states that “something like this… we can’t let it…”tear us apart. So much back and forth.\n\nThe gang all returns home back where they belong. We all know they couldn’t hang in NYC much longer- they are just not cut out for it. LVP invites Teddi over for some tea…aka a chance for them to catch up and hear about LVP’s upcoming birthday party. They also share their feelings about their NY trip and Teddi states that the issue is Dorit’s lack of ownership when she says something wrong. LVP describes Dorit as being “very vocal” and still does not hold her accountable for her trash talking. Teddi does a fabulous job explaining how Kyle went to bat for LVP and I have decided that Teddi is a friend I would want to have- she seems to be the only one who can get through LVP’s thick British skull.\n\nRinna’s segment is of course about her children…oh and her adorable pup. It is kinda sweet seeing Rinna and HarryHamlin act like real parents…until HarryHamlin tries to compare Delilah’s NYC move to movie sets and tv shows. Sigh. Modeling. TV. Movies. This family. Thank GOD HarryHamlin and Rinna have “experience in the business” to help their kids.\n\nFinally, the meeting we have all been waiting for! LVP and Kyle. Together again out to dinner. Kyle claims she is “overwhelmed” and LVP tries to alleviate her pressure by pouring her a heavy glass of rose. Lisa lets Kyle know that she is worried about her relationship with Dorit because Lisa holds PK’s friendship in high regard. Kyle is totally annoyed by LVP trying to justify why she is not angry at Dorit. She also feels like her ten year friendship has taken a back seat, all because Dorit’s hubby is tight with LVP and Ken, her husband.\n\nAfter a whole lotta whining and finger pointing, finally Kyle hears what she’s been wanting to hear: LVP says, “I do want to apologize for this and I mean it 1,000%. I am sorry that I have neglected you and I didn’t realize you were that upset.” And there ya have it, guys. Give the lady a little rose and wam-o…friends again. Who knew it could be that easy?! Note: Always have a supply of rose around…for those times you need to butter up the one and only LVP.\n\nTELL US – WHAT ARE YOUR THOUGHTS ON THE RHOBH RECAP & LATEST EPISODE? SHOULD LISA HAVE APOLOGIZED TO KYLE?", "images": ["https://realityblurb.com/wp-content/uploads/2019/11/Shiva-Safai-new-boyfriend-Niels-Houweling-plus-Mohamed-Hadid-e1574892714519-400x283.jpg", "https://realityblurb.com/2018/02/28/real-housewives-beverly-hills-recap-bethenny-lisa-go-head-head/ https:/realityblurb.com/wp-content/uploads/2019/02/social-facebook-pink.png", "https://realityblurb.com/wp-content/uploads/2020/04/Kristen-Doute-and-Katie-Maloney-plus-James-Kennedy-400x286.jpg", "https://realityblurb.com/wp-content/uploads/2020/04/Erika-Jayne-and-Denise-Richards-plus-RHOBH-Cast-Photo-400x286.jpg", "https://realityblurb.com/2018/02/28/real-housewives-beverly-hills-recap-bethenny-lisa-go-head-head/ https:/realityblurb.com/wp-content/uploads/2019/02/social-instagram-pink.png", "https://realityblurb.com/wp-content/uploads/2019/04/Brittany-Cartwright-and-Jax-Taylor-2019-e1554656234797-400x285.jpg", "https://realityblurb.com/wp-content/uploads/2016/02/retina-pin2k-logo-1.png", "https://realityblurb.com/wp-content/uploads/2016/02/julia-m-120x120.jpeg", "https://realityblurb.com/wp-content/uploads/2019/11/RHONJ-Joe-Giudice-and-Teresa-Giudice-News-400x281.jpg", "https://realityblurb.com/wp-content/uploads/2016/02/white-logo1.png", "https://realityblurb.com/wp-content/uploads/2016/02/retina-pin2k-logo-1B.png", "https://realityblurb.com/wp-content/uploads/2020/03/Melissa-Gorga-Getting-Her-Mail-Photos-3-400x250.jpg", "https://realityblurb.com/2018/02/28/real-housewives-beverly-hills-recap-bethenny-lisa-go-head-head/ https:/realityblurb.com/wp-content/uploads/2019/02/social-pinterest-pink.png", "https://realityblurb.com/wp-content/uploads/2016/02/feed-logo.png", "https://realityblurb.com/wp-content/uploads/2019/06/Kyle-Richards-plus-Lisa-Vanderpump-400x257.jpg", "https://realityblurb.com/wp-content/uploads/2016/02/blurb-logo-1@2x.png", "https://realityblurb.com/wp-content/uploads/2018/02/rhobh_recap_Bethenny_Frankel_and_Lisa_Vanderpump.jpg", "https://realityblurb.com/wp-content/uploads/2018/02/rhobh_recap_Bethenny_Frankel_and_Lisa_Vanderpump-1024x576.jpg", "https://realityblurb.com/2018/02/28/real-housewives-beverly-hills-recap-bethenny-lisa-go-head-head/ https:/realityblurb.com/wp-content/uploads/2019/02/social-twitter-pink.png", "https://realityblurb.com/wp-content/uploads/2019/12/Kenya-Moore-News-Update-e1577372761358-400x289.jpg", "https://realityblurb.com/wp-content/uploads/2019/06/Kathryn-Dennis-plus-Thomas-Ravenel-News-400x263.jpg"], "top_img": "https://realityblurb.com/wp-content/uploads/2018/02/rhobh_recap_Bethenny_Frankel_and_Lisa_Vanderpump.jpg", "keywords": [], "authors": [], "canonical_link": "https://realityblurb.com/2018/02/28/real-housewives-beverly-hills-recap-bethenny-lisa-go-head-head/", "title": "Real Housewives of Beverly Hills Recap: Bethenny and Lisa Go Head to Head", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "format-detection": "telephone=no", "theme-color": "#db0a5b", "og": {"type": "article", "title": "Real Housewives of Beverly Hills Recap: Bethenny and Lisa Go Head to Head", "description": "The Real Housewives of Beverly Hills are still in NYC. Still parading modeling daughters around. This time, it’s Camille wanting “Mason to shine.” Man, it seems like a lot of these mommas are living vicariously", "image": {"identifier": "https://realityblurb.com/wp-content/uploads/2018/02/rhobh_recap_Bethenny_Frankel_and_Lisa_Vanderpump.jpg", "width": 1200, "height": 675}, "url": "https://realityblurb.com/2018/02/28/real-housewives-beverly-hills-recap-bethenny-lisa-go-head-head/", "site_name": "Reality Blurb", "updated_time": "2018-02-28T08:31:17-06:00"}, "article": {"publisher": "https://www.facebook.com/realityblurb", "published_time": "2018-02-28T08:31:17-06:00", "modified_time": "2018-02-28T08:31:17-06:00"}, "twitter": {"card": "summary_large_image", "title": "Real Housewives of Beverly Hills Recap: Bethenny and Lisa Go Head to Head", "description": "The Real Housewives of Beverly Hills are still in NYC. Still parading modeling daughters around. This time, it’s Camille wanting “Mason to shine.” Man, it seems like a lot of these mommas are living vicariously", "image": "https://realityblurb.com/wp-content/uploads/2018/02/rhobh_recap_Bethenny_Frankel_and_Lisa_Vanderpump.jpg"}, "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "generator": "WordPress 5.3.2", "google-site-verification": "KLs5Ahl3S2IZ7ied-aRAdTdpzpk7JE8c7coRSP72Ob8", "msapplication-TileImage": "https://realityblurb.com/wp-content/uploads/2016/02/cropped-Image1-300x300.jpg"}, "movies": [], "publish_date": 1519747200.0, "source": "https://realityblurb.com", "summary": ""}