{"url": "https://tvline.com/2015/12/20/homeland-finale-recap-season-5-quinn-dies-rupert-friend/", "text": "The following story contains major spoilers about Homeland‘s Season 5 finale. Stop reading if the episode is still sitting on your DVR.\n\nHomeland ended its fifth season Sunday with the presumed death of Rupert Friend’s Quinn.\n\nHis already-bleak condition took a turn for the worse when the super-sniper suffered a brain hemorrhage. Even if he was to recover, he would’ve been left with severe brain damage, his doc explained to Carrie. That prompted Carrie to remove his pulse monitor before — presumably — pulling the plug (or smothering him?) in the episode’s closing minutes. (Or did Quinn stop breathing on his own, as one reader noted in the comments below?) Earlier, Dar handed her the letter Quinn had written her at the end of last season on the off chance he didn’t survive that covert Syrian mission.\n\nHere’s the full text of his heartbreaking farewell note:\n\nCarrie. I guess I’m done. And we never happened. I’m not one for words, but they’re coming now. I don’t believe in fate, or destiny, or horoscopes, but I can’t say I’m surprised things turned out this way. I always thought there was something kind of pulling me back to darkness. But I wasn’t allowed a real life. Or a real love. That was for normal people. With you I thought maybe just maybe. But I know now that was a false glimmer. I’m used to… they happen all of the time in the desert, but this one got to me. And here’s the thing, this death, this end of me is exactly what should’ve happened. I wanted the darkness. I f—ing asked for it. And it has me now. So don’t put a star on the wall for me. Don’t say some dumb speech. Just think of me as a light on the heavens. A beacon. Steering you clear of the wrongs. I loved you. —Yours, for always now, Quinn.\n\n(Quick sidebar: While it’s true we didn’t actually see Carrie pull the plug, given the extent of Quinn’s brain injury, Homeland would risk mass ridicule if it returned in Season 6 with Quinn still alive; he’s dead, people.)\n\nOther highlights from Season 5’s final hour:\n\n* The chemical weapons attack in the Berlin subway station was averted, thanks to Carrie and good samaritan Qasim (may he R.I.P.).\n\n* Saul cut a deal with Ivan — witness protection in the U.S. in exchange for delivering the duplicitous Allison to him. He came through with his end of the bargain, pinpointing Allison’s whereabouts as she was being smuggled across the border in the trunk of a black sedan. The second the vehicle was in his sights, Saul ordered it fired upon; Allison was killed instantly.\n\nRELATED ‘Homeland Is Racist’ Message Sneaks Into Season 5 Episode; EP Responds\n\n* Laura and Numan were arrested by the BND for the role they played in stealing those sensitive documents. Astrid then floated a deal by Laura — publicly throw the late Marwan under the bus and, in return, her hacker buddy Numan won’t be deported. Laura reluctantly accepted it. (I’m gonna miss that scowl of hers.)\n\n* Carrie and Jonas had makeup sex and then he promptly dumped her.\n\n* Carrie — via Saul — was offered by the CIA a chance to “pick her next mission, design your own team” — a gig she flatly declined. “I’m not that person anymore,” she explained to Saul. Otto later made his own, far creepier job offer to Carrie — be his partner in work and life. She agreed to sleep on it.\n\nWhat did you think of the finale? Got theories about the setting and conceit of Season 6? Grade the episode below and then hit the comments!", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-tvline-2014/library/images/follow_us_on_facebook_graphic.png", "https://pmctvline2.files.wordpress.com/2019/06/lucifer-season-4-episode-4.jpg?w=620", "https://pmctvline2.files.wordpress.com/2020/04/too-hot-to-handle-finale.jpg?w=620", "https://pmcspy.files.wordpress.com/2020/04/best-hangboards.jpg?resize=180%2C101", "https://pmctvline2.files.wordpress.com/2015/12/homeland1.png?w=347&h=324", "https://i0.wp.com/www.goldderby.com/wp-content/uploads/2017/11/top-chef-season-15-contestants-hosts-Tom-Colicchio.jpg?resize=180%2C101&ssl=1", "https://pmchollywoodlife.files.wordpress.com/2020/04/alia-shawkat-leaves-brad-pitts-house-backgrid-ftr.jpg?resize=180%2C101", "https://boygeniusreport.files.wordpress.com/2020/04/webp.net-resizeimage-1-10.jpg?quality=98&strip=all&resize=180%2C101", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=tvline.com&path=%2F2015%2F12%2F20%2Fhomeland-finale-recap-season-5-quinn-dies-rupert-friend%2F&ct=article&lob=tvline&loc=us&env=desktop&post_id=668772&comment_count=249", "https://pmctvline2.files.wordpress.com/2020/04/swat-season-3-finale-schedule.jpg?w=620", "https://pmctvline2.files.wordpress.com/2015/12/homeland.png?w=620&h=420&crop=1", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY", "https://pmctvline2.files.wordpress.com/2015/12/homeland.png?w=620", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pmcdeadline2.files.wordpress.com/2020/04/taylor-swift-performs-at-global-citizens-concert.png?resize=180%2C101", "https://secure-us.imrworldwide.com/cgi-bin/m?ci=us-203220h&cg=0&cc=1&ts=noscript", "https://pmctvline2.files.wordpress.com/2015/07/dying-characters-deathwatch_shield.jpg?w=620", "https://pmctvline2.files.wordpress.com/2020/04/brooklyn-nine-nine-season-7-episode-13-finale-nbc-1.jpg?w=620", "https://pixel.wp.com/b.gif?v=noscript", "https://pmctvline2.files.wordpress.com/2020/04/one-chicago-cast-exits-2.jpg?w=620", "https://pmctvline2.files.wordpress.com/2020/03/dw-2.jpg?w=280"], "top_img": "https://pmctvline2.files.wordpress.com/2015/12/homeland.png?w=620", "keywords": [], "authors": ["Michael Ausiello"], "canonical_link": "https://tvline.com/2015/12/20/homeland-finale-recap-season-5-quinn-dies-rupert-friend/", "title": "Homeland Season 5 Finale Recap: Auf Wiedersehen", "meta_data": {"viewport": "width=device-width, initial-scale=1.0 maximum-scale=1, user-scalable=no", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-mobile-web-app-capable": "yes", "p": {"domain_verify": "9ad238c78ee34da2d6d96a41981790d2"}, "description": "The following story contains major spoilers about Homeland's Season 5 finale. Stop reading if the episode is still sitting on your DVR. Homeland ended its fifth season Sunday with the presumed death of Rupert Friend's Quinn.", "news_keywords": "Homeland, Showtime", "apple-itunes-app": "app-id=1377345661", "generator": "WordPress.com", "og": {"type": "article", "title": "Homeland Season 5 Finale Recap: Auf Wiedersehen", "url": "https://tvline.com/2015/12/20/homeland-finale-recap-season-5-quinn-dies-rupert-friend/", "description": "The following story contains major spoilers about Homeland’s Season 5 finale. Stop reading if the episode is still sitting on your DVR. Homeland ended its fifth season Sunday with the presume…", "site_name": "TVLine", "image": {"identifier": "https://pmctvline2.files.wordpress.com/2015/12/homeland.png?w=620", "width": 620, "height": 420, "alt": "Homeland Finale Recap"}, "locale": "en_US"}, "article": {"published_time": "2015-12-21T02:56:22+00:00", "modified_time": "2015-12-21T11:46:36+00:00"}, "twitter": {"site": "@TVLine", "text": {"title": "<i>Homeland</i> Season 5 Finale Recap: Auf Wiedersehen"}, "image": {"identifier": "https://pmctvline2.files.wordpress.com/2015/12/homeland.png?w=620", "alt": "Homeland Finale Recap"}, "card": "summary_large_image", "creator": "@michaelausiello", "title": "Homeland Season 5 Finale Recap: Auf Wiedersehen", "description": "The following story contains major spoilers about Homeland’s Season 5 finale. Stop reading if the episode is still sitting on your DVR. Homeland ended its fifth season Sunday with the presume…"}, "author": "Michael Ausiello", "content_type": "Article", "post_id": 668772, "title": "<i>Homeland</i> Season 5 Finale Recap: Auf Wiedersehen", "published_at": "2015-12-20 18:56:22", "image": "https://pmctvline2.files.wordpress.com/2015/12/homeland.png?w=300&h=208&crop=1", "comment_count": 249, "tags": "Showtime", "topics": "Recaps", "body": "The following story contains major spoilers about Homeland's Season 5 finale. Stop reading if the episode is still sitting on your DVR.\r\n\r\nHomeland ended its fifth season Sunday with the presumed death of Rupert Friend's Quinn.\r\n\r\nHis already-bleak condition took a turn for the worse when the super-sniper suffered a brain hemorrhage. Even if he was to recover, he would've been left with severe brain damage, his doc explained to Carrie. That prompted Carrie to remove his pulse monitor before — presumably — pulling the plug (or smothering him?) in the episode's closing minutes. (Or did Quinn stop breathing on his own, as one reader noted in the comments below?) Earlier, Dar handed her the letter Quinn had written her at the end of last season on the off chance he didn't survive that covert Syrian mission.\r\n\r\nHere's the full text of his heartbreaking farewell note:\r\nCarrie. I guess I'm done. And we never happened. I'm not one for words, but they're coming now. I don't believe in fate, or destiny, or horoscopes, but I can't say I'm surprised things turned out this way. I always thought there was something kind of pulling me back to darkness. But I wasn't allowed a real life. Or a real love. That was for normal people. With you I thought maybe just maybe. But I know now that was a false glimmer. I'm used to... they happen all of the time in the desert, but this one got to me. And here's the thing, this death, this end of me is exactly what should've happened. I wanted the darkness. I f---ing asked for it. And it has me now. So don't put a star on the wall for me. Don't say some dumb speech. Just think of me as a light on the heavens. A beacon. Steering you clear of the wrongs. I loved you. —Yours, for always now, Quinn.\r\n(Quick sidebar: While it's true we didn't actually see Carrie pull the plug, given the extent of Quinn's brain injury, Homeland would risk mass ridicule if it returned in Season 6 with Quinn still alive; he's dead, people.)\r\n\r\n\r\n\r\nOther highlights from Season 5's final hour:\r\n\r\n* The chemical weapons attack in the Berlin subway station was averted, thanks to Carrie and good samaritan Qasim (may he R.I.P.).\r\n\r\n* Saul cut a deal with Ivan — witness protection in the U.S. in exchange for delivering the duplicitous Allison to him. He came through with his end of the bargain, pinpointing Allison's whereabouts as she was being smuggled across the border in the trunk of a black sedan. The second the vehicle was in his sights, Saul ordered it fired upon; Allison was killed instantly.\r\n\r\nRELATED 'Homeland Is Racist' Message Sneaks Into Season 5 Episode; EP Responds\r\n\r\n* Laura and Numan were arrested by the BND for the role they played in stealing those sensitive documents. Astrid then floated a deal by Laura — publicly throw the late Marwan under the bus and, in return, her hacker buddy Numan won't be deported. Laura reluctantly accepted it. (I'm gonna miss that scowl of hers.)\r\n\r\n* Carrie and Jonas had makeup sex and then he promptly dumped her.\r\n\r\n* Carrie — via Saul — was offered by the CIA a chance to \"pick her next mission, design your own team\" — a gig she flatly declined. \"I'm not that person anymore,\" she explained to Saul. Otto later made his own, far creepier job offer to Carrie — be his partner in work and life. She agreed to sleep on it.\r\n\r\nWhat did you think of the finale? Got theories about the setting and conceit of Season 6? Grade the episode below and then hit the comments!", "fb": {"pages": 187516444593639, "page_id": 187516444593639}, "application-name": "TVLine", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "TV News, Previews, Spoilers, Casting Scoop, Interviews", "msapplication-task": "name=Subscribe;action-uri=https://tvline.com/feed/;icon-uri=https://pmctvline2.files.wordpress.com/2018/06/logo-tvline.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!", "msapplication-TileImage": "https://pmctvline2.files.wordpress.com/2018/06/logo-tvline.png?w=270"}, "movies": [], "publish_date": 1450540800.0, "source": "https://tvline.com", "summary": ""}