{"url": "https://www.usatoday.com/story/life/movies/2017/11/21/review-joyful-coco-breaks-pixar-pack-mexican-musical-spectacular/882699001/", "text": "As Pixar delves more into sequel territory (looking at you, Cars 3 and Finding Dory), here comes an animated fiesta that reminds just how good those folks are with originality.\n\nEffervescent, clever and thoughtful, Coco (***½ out of four; rated PG; in theaters nationwide Wednesday) is infused with an infectious youthful spirit and a deep musical soul in telling the tale of a young Mexican boy with a twofold mission: to grab his musical dreams and heal a familial rift. The joyful journey is Pixar’s best effort since 2015’s Inside Out and, like the studio’s greatest works, makes you laugh and cry in equal doses. (If Up left you a teary mess, go ahead and bring a whole tissue box.)\n\nMore:Everything you need to know about the Mexican cultural references in 'Coco'\n\nEarlier:The 'Incredibles 2' trailer is here with a dangerously powerful Jack-Jack\n\nRelated:Meet music-loving Miguel and dog friend Dante in an exclusive 'Coco' scene\n\nDirector Lee Unkrich (Toy Story 3) centers the story on the Day of the Dead and the importance of family — though Miguel (voiced by Anthony Gonzalez) in his own way rebels against his clan. (Coco isn't related to that other animated movie based on the Day of the Dead, the 2014 romantic adventure The Book of Life, though they would make a fine double feature.)\n\nA gifted 12-year-old, Miguel yearns to be a balladeer like his idol Ernesto de la Cruz (Benjamin Bratt), an A-list celebrity of yesteryear who’s a Latino Elvis and the most famous son of Santa Cecilia. But music is banned in Miguel's household, because his great-great-grandfather left the family behind for a performing career many years prior, so Miguel has to teach himself guitar in secret.\n\nHe runs off to the Land of the Dead — full of wondrous sights and skeleton residents — to find his ancestor and right a wrong, meeting the rest of his deceased relatives (who also hate music) and a lovable scamp named Héctor (Gael García Bernal). He's a key to getting Miguel some face time with Ernesto but also the guy who relays the stakes at hand: If someone in the Land of the Dead is forgotten by their family, they disappear into the ether, and if Miguel doesn’t get back home in time, he’ll turn into a skull and bones himself. (In a nod to Back to the Future, Héctor watches as the skin disappears from his hand as time passes.)\n\nCoco is one of Pixar’s most gorgeously animated outings in some time. The Land of the Dead pops like an afterlife Las Vegas, and Miguel’s town and its residents are impressively photorealistic. The screenplay by Matthew Aldrich and co-director Adrian Molina sticks closely to the Pixar template in terms of coming-of-age and find-your-identity themes and is unabashed in its emotional manipulation. But by the time you realize it, your heart’s been wholly warmed and there’s no going back.\n\nBratt lends over-the-top machismo to Ernesto, Bernal gives Héctor a fun sparkle, and Alanna Ubach is all sass as Mama Imelda, Miguel’s fiery, no-nonsense great-great-grandmother. But Gonzalez is tops in the cast: The 13-year-old newcomer gives Miguel a mischievous but heroic quality and a surprising depth, especially in the loving asides between Miguel and his great-grandmother Coco (Ana Ofelia Murguía). Plus, the kid can sing like nobody’s business.\n\nMore:The 5 best Pixar movies to binge-watch this weekend\n\nAlso:10 holiday movies you must see, from 'Justice League' to the new 'Star Wars'\n\nCoco is arguably the most musical Pixar film, with a host of catchy tunes. Proud Corazón is an emotionally packed showstopper for Gonzalez, who also duets with Bernal on the toe-tapping Un Poco Loco. The Let It Go of the bunch is Remember Me, a track by the Frozen songwriting team that gets reprised in various ways by different characters yet feels fresh every time.\n\nNot that you’ll forget how moving Coco is anytime soon.", "images": ["https://media.gannett-cdn.com/29906170001/29906170001_5623026535001_5623013574001-vs.jpg?pubId=29906170001&width=660&height=372&format=pjpg&auto=webp", "https://www.gannett-cdn.com/-mm-/2eb382014f49f103792ae5eab2947e2e46241a29/c=0-13-4000-2273/local/-/media/2017/11/20/USATODAY/USATODAY/636467929847206659-Coco596d30d0192bd.jpg?width=3200&height=1808&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/-mm-/2eb382014f49f103792ae5eab2947e2e46241a29/c=0-13-4000-2273/local/-/media/2017/11/20/USATODAY/USATODAY/636467929847206659-Coco596d30d0192bd.jpg?width=3200&height=1808&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/movies/2017/11/21/review-joyful-coco-breaks-pixar-pack-mexican-musical-spectacular/882699001/", "title": "Review: Joyful 'Coco' breaks from the Pixar pack as a Mexican musical spectacular", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "Review: Joyful 'Coco' breaks from the Pixar pack as a Mexican musical spectacular", "description": "The tale of a Mexican boy who travels to a colorful afterlife is Pixar's best effort since 'Inside Out.'", "url": "https://www.usatoday.com/story/life/movies/2017/11/21/review-joyful-coco-breaks-pixar-pack-mexican-musical-spectacular/882699001/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/2eb382014f49f103792ae5eab2947e2e46241a29/c=0-13-4000-2273/local/-/media/2017/11/20/USATODAY/USATODAY/636467929847206659-Coco596d30d0192bd.jpg?width=3200&height=1808&fit=crop&format=pjpg&auto=webp", "width": 3200, "height": 1808}, "type": "article"}, "article": {"author": "Brian Truitt", "content_tier": "free", "opinion": "false"}, "description": "The tale of a Mexican boy who travels to a colorful afterlife is Pixar's best effort since 'Inside Out.'", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/-mm-/2eb382014f49f103792ae5eab2947e2e46241a29/c=0-13-4000-2273/local/-/media/2017/11/20/USATODAY/USATODAY/636467929847206659-Coco596d30d0192bd.jpg?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Review: Joyful 'Coco' breaks from the Pixar pack as a Mexican musical spectacular", "description": "The tale of a Mexican boy who travels to a colorful afterlife is Pixar's best effort since 'Inside Out.'"}}, "movies": [], "publish_date": 1511193600.0, "source": "https://www.usatoday.com", "summary": ""}