{"url": "http://transcripts.cnn.com/TRANSCRIPTS/0804/13/se.01.html", "text": "\n\n\n\nReturn to Transcripts main page\n\nCNN LIVE EVENT/SPECIAL\n\nDemocratic Candidates Compassion Forum\n\nAired April 13, 2008 - 20:00 ET\n\nTHIS IS A RUSH TRANSCRIPT. THIS COPY MAY NOT BE IN ITS FINAL FORM AND MAY BE UPDATED.\n\n\n\nBROWN: Good evening, everybody, to our viewers in the United States and around the world. Welcome to Messiah College in Grantham, Pennsylvania. I'm Campbell Brown.\n\nTonight, we bring you something different in this already extraordinary campaign year. We are calling it the Compassion Forum, an evening with the Democratic presidential candidates to focus on the issues of faith and compassion and how a president's faith can affect us all.\n\n\n\nThe focus tonight is to take the conversation beyond the candidate's standard policy points. And some of these questions tonight will be deeply personal.\n\n\n\nWe are here before a distinguished, bipartisan audience of faith leaders from around the country, from the head of the Southern Baptist Convention to the head of Catholic charities to rabbis and lay leaders.\n\n\n\nBefore we get started, on behalf of CNN and the candidates, I'd like to thank the people behind tonight's event, Faith in Public Life, the ONE Campaign, Oxfam America, and, of course, our hosts, Messiah College.\n\n\n\nAnd I'd like now to introduce my co-host. Please welcome Jon Meacham. He is the editor of Newsweek and one of America's best-known writers of religion and matters of faith.\n\n\n\nWelcome, Jon.\n\n\n\nMEACHAM: Thank you.\n\n\n\nBROWN: Tonight, we're going to spend about half of our time with Senator Clinton, about half of our time with Senator Obama. The order tonight was decided by coin toss. Senator Clinton won and has elected to go first. Questions will come from Jon and me and from some of the faith leaders assembled here in our audience, so let's get started.\n\n\n\nWithout further ado, please welcome the senator from New York, Hillary Clinton.\n\n\n\nBROWN: Nice to see you. Welcome.\n\n\n\n(APPLAUSE)\n\n\n\nCLINTON: Thank you. Thank you very much.\n\n\n\nBROWN: Senator Clinton, welcome to you.\n\n\n\nCLINTON: Thank you.\n\n\n\nBROWN: Jon has got the first question.\n\n\n\nCLINTON: Great. Well, it's wonderful to be here. I want to thank Messiah College for hosting this. Very good of you to do this.\n\n\n\n(APPLAUSE)\n\n\n\nMEACHAM: Senator, we'll start with the news. You have been extremely critical of Senator Obama's recent comments in San Francisco in which he argued that some hard-pressed Americans have -- economically hard-pressed Americans have, and I quote, \"gotten bitter and cling to guns or religion or antipathy to people who aren't like them or anti-immigrant sentiment or antitrade sentiment as a way to explain their frustrations.\"\n\n\n\nSenator, you have written of how faith sustained you in bitter times. Many of us have been sustained by our faith in bitter times. What exactly is wrong with what Senator Obama had to say?\n\n\n\nCLINTON: Well, I'm going to let Senator Obama speak for himself. But from my perspective, the characterization of people in a way that really seemed to be elitist and out of touch is something that we have to overcome.\n\n\n\nYou know, the Democratic Party, to be very blunt about it, has been viewed as a party that didn't understand and respect the values and the way of life of so many of our fellow Americans.\n\n\n\nAnd I think it's important that we make clear that we believe people are people of faith because it is part of their whole being; it is what gives them meaning in life, through good times and bad times. It is there as a spur, an anchor, to center one in the storms, but also to guide one forward in the day-to-day living that is part of everyone's journey.\n\n\n\nAnd, you know, when we think about the legitimate concerns that people have about trade or immigration, those are problems to be solved. And that's what I think we should be focused on.\n\n\n\nBut I am very confident that, as we move forward tonight and beyond, people will get a chance to get to know each of us a little better, and that's really what I want to talk about. I will leave it to Senator Obama to speak for himself; he does an excellent job of that.\n\n\n\nAnd I will speak for myself on what my faith journey is and what, you know, leads me to this chair here tonight.\n\n\n\nBROWN: But, Senator, you've been out there on the stump attacking him pretty aggressively over this. And his response has been -- and he said it pretty bluntly tonight -- shame on you. You know that he is a man of faith. This is what he's saying. And to suggest that he is demeaning religion is you playing politics. CLINTON: Well, he will have to speak for himself and provide his own explanation. But I do think it raises a lot of concerns and we've seen that exhibited in the last several days by people here in Pennsylvania, in Indiana where I was yesterday, and elsewhere, because it did seem so much in-line with what often we are charged with.\n\n\n\nSomeone goes to a closed-door fund-raiser in San Francisco and makes comments that do seem elitist, out of touch and, frankly, patronizing. That has nothing to do with him being a good man or a man of faith.\n\n\n\nWe had two very good men and men of faith run for president in 2000 and 2004. But large segments of the electorate concluded that they did not really understand or relate to or frankly respect their ways of life.\n\n\n\nAnd I think that is an issue for voters, as I've heard today from people I visited in Scranton and elsewhere. So this is a legitimate political issue. And there are some issues that are not. But this one is.\n\n\n\nAnd I do believe that Senator Obama will have a chance to explain himself tonight. And I'm sure he will take that opportunity.\n\n\n\nBROWN: Let's talk about your faith. And we warned people the questions tonight would be pretty personal. So I want to ask you. You said in an interview last year that you believe in the Father, Son and the Holy Spirit. And you have actually felt the presence of the Holy Spirit on many occasions.\n\n\n\nShare some of those occasions with us.\n\n\n\nCLINTON: You know, I have, ever since I've been a little girl, felt the presence of God in my life. And it has been a gift of grace that has, for me, been incredibly sustaining. But, really, ever since I was a child, I have felt the enveloping support and love of God and I have had the experiences on many, many occasions where I felt like the holy spirit was there with me as I made a journey.\n\n\n\nIt didn't have to be a hard time. You know, it could be taking a walk in the woods. It could be watching a sunset.\n\n\n\nYou know, I am someone who has talked a lot about my life. You know more about my life than you know about nearly anybody else's, about 60 books worth...\n\n\n\n(LAUGHTER)\n\n\n\nCLINTON: ... some of which are, you know, frankly, a little bit off-base. But I don't think that I could have made my life's journey without being anchored in God's grace and without having that, you know, sense of forgiveness and unconditional love. And I am not going to point to one or another matter. I mean, some of my struggles and challenges have been extremely public. And I have talked about how I have been both guided and supported through those, trying to find my own way through, because, for me, my faith has given me the confidence to make decisions that were right for me, whether anybody else agreed with me or not.\n\n\n\nAnd it is just such a part of who I am and what I have lived through for so many years that trying to pull out and say, oh, I remember, I was sitting right there when I felt, you know, God's love embrace me, would be, I think, trivializing what has been an extraordinary sense of support and possibility that I have had with me my entire life.\n\n\n\nMEACHAM: Senator, you -- right after New Hampshire, you and I had a conversation a couple of days after that in which you described your moment in the setting where you said that you worked very hard and it was seen as a turning point by many people. You described that as a moment of grace.\n\n\n\nCLINTON: Yes.\n\n\n\nMEACHAM: So that is a specific in...\n\n\n\nCLINTON: Right, right. Well, you know, Jon, it is -- it is perhaps a reluctance on my part that is rooted in my personal reserve, rooted in the way I was raised, that I worry and I -- you know, I understand you want to ask a lot of personal questions, and I appreciate that.\n\n\n\nBut I also worry, as I suggested to you in that same interview, that you have to walk the walk of faith. And talking about it is important because it's important to share that experience. But I also believe that, you know, faith is just -- it's grace. It's love. It's mystery. It's provocation.\n\n\n\nIt is everything that makes life and its purpose meaningful as a human being.\n\n\n\nCLINTON: And those moments of grace are ones that I cherish and, you know, in asked a specific question about how I felt when I shared my belief that politics is not a game, it is not a who's up, who's down.\n\n\n\nI mean, it is a serious search and we are so fortunate because we have taken the gifts that God gave us and we have created this democracy where we choose our leaders and we have to be more mindful of how important and serious a business this is.\n\n\n\nAnd, therefore, when I say politics is not a game, it is really coming from deep within me because I know that we have the opportunity to really give other people a chance to live up to their own God-given potential. And that, to me, is the kind of grace note that makes politics worthwhile. Because, believe me, there's a lot about it that is not particularly welcoming or easy.\n\n\n\nBut every day as I travel around the country, I meet people whose faith just knocks me over. I mean, I was with a woman in Philadelphia Friday morning whose son was murdered on the streets in Philadelphia, whose grandson was murdered. And she and I just sat together and she told me about how strong her faith is and how it has sustained her and how she believes, you know, God is with her and she doesn't understand why this happened to her son and her grandson.\n\n\n\nBut every day she's grateful, and she is determined to be the person that she believes God meant her to be. And so when I sit there and I listen to that woman tell me about how it felt and how today she is still, you know, getting up every morning, has a smile on her face, looking to go to her daycare business and take care of all of these children who have been entrusted to her, that's a moment of grace.\n\n\n\nBut it's not about me. I mean, not every moment of grace is about you. More often it is about the interaction and the relationship. You know, grace is that relationship with God. But it's also the relationships with our fellow human beings in which we know grace is present. And so I just feel very fortunate that, you know, I have been able to experience that and I wish it for everyone.\n\n\n\nBROWN: Let's bring a question in from one of the religious leaders joining us tonight. Dr. Joel Hunter, who is senior pastor of the 12,000-member Northland Church in Longwood, Florida. Dr. Hunter?\n\n\n\nCLINTON: How are you, Dr. Hunter? Good to see you.\n\n\n\nPASTOR JOEL HUNTER, NORTHLAND CHURCH: I'm fine, Senator. Good to see you. Senator, many of the issues we're going to be talking about tonight, Darfur, AIDS, abortion, torture, could present you with choices that will have life and death consequences for countless people around the world. What are the first principles you fall back on to make such decisions? Are there certain activities or references or people with whom you consult in order to do what is morally right?\n\n\n\nCLINTON: You know, Dr. Hunter, I think this is one of the challenges that face any of us who are in public life where literally you do have the authority to make these decisions that could very well be life and death decisions and they are daunting and I do not pretend to know how I will deal with every single one of them.\n\n\n\nBut I do have a sense of the process by which I will try to approach them. And it really is rooted in, you know, my prayer, my contemplation, my study. I think you have to immerse yourself in advice, information, criticism from others. I don't pretend to even believe that I know the answers to a lot of these questions. I don't.\n\n\n\nBut I do believe that you have to be willing to expose yourself to many different points of view and then you have to make that decision. I think that for a lot of us, decisions are ones that you don't just make and put on a shelf. To be fair to be constantly struggling and challenging yourself, you have to keep opening up that decision and asking.\n\n\n\nCLINTON: And very often, as you know, some decisions look like they're 100-to-nothing until you actually examine them. And some decisions truly are right down the middle, and you're not sure which side of the line you will decide upon.\n\n\n\nYou mentioned some of the very difficult decisions that we are going to face, and there are countless more. How do we get out of Iraq the right way? Everyone knows there is no easy, comfortable decision.\n\n\n\nI believe we've got to begin taking our troops out of Iraq based on my analysis of what I think is the best path forward for us and for the Iraqis. But I am deeply aware that there will be predictable and unpredictable consequences. And part of making a decision is having to live with the consequences.\n\n\n\nAnd I have been very fortunate in my life to have people whom I feel very comfortable talking to openly, with total frankness, seeking their guidance. They don't all agree with me; they don't all share my view, when I start the conversation, perhaps.\n\n\n\nBut I don't think you can surround yourself only with people with whom you think you will agree. And, for me, being amongst people who challenge me, who make me uncomfortable, to be very blunt, is an important part of my decisionmaking process.\n\n\n\nI want to push back; I want to argue; I want to raise other hypotheticals and throw them back to see what the outcome is.\n\n\n\nBut at the end of the day, since we are running to be the president of the United States, you have to be comfortable making a decision, because you cannot say, \"Well, let's put it on the back burner and then get back to it some time when it's clearer,\" for many of these decisions. And then you have to live with the consequences.\n\n\n\nBut I hope I will never, ever find myself being defensive or abrupt and dismissive of people who disagree with me. I regret that that often happens in politics, and maybe it's because oftentimes the decisionmaking process is so exhausting.\n\n\n\nYou know, if you're a person of faith, after you've prayed, if you're a person willing to subject yourself to criticism, after you've done it, you're just so relieved to make the decision you don't want to revisit it. But I don't think that a president can afford to do that.\n\n\n\nMEACHAM: Senator, do you believe personally that life begins at conception?\n\n\n\nCLINTON: I believe that the potential for life begins at conception. I am a Methodist, as you know. My church has struggled with this issue. In fact, you can look at the Methodist Book of Discipline and see the contradiction and the challenge of trying to sort that very profound question out.\n\n\n\nBut for me, it is also not only about a potential life; it is about the other lives involved. And, therefore, I have concluded, after great, you know, concern and searching my own mind and heart over many years, that our task should be in this pluralistic, diverse life of ours in this nation that individuals must be entrusted to make this profound decision, because the alternative would be such an intrusion of government authority that it would be very difficult to sustain in our kind of open society.\n\n\n\nAnd as some of you've heard me discuss before, I think abortion should remain legal, but it needs to be safe and rare.\n\n\n\nAnd I have spent many years now, as a private citizen, as first lady, and now as senator, trying to make it rare, trying to create the conditions where women had other choices.\n\n\n\nI have supported adoption, foster care. I helped to create the campaign against teenage pregnancy, which fulfilled our original goal 10 years ago of reducing teenage pregnancies by about a third.\n\n\n\nAnd I think we have to do even more.\n\n\n\nCLINTON: And I am committed to doing that. And I guess I would just add from my own personal experience, I have been in countries that have taken very different views about this profoundly challenging question.\n\n\n\nSome of you know, I went to China in 1995 and spoke out against the Chinese government's one child policy, which led to forced abortions and forced sterilization because I believed that we needed to bear witness against what was an intrusive, abusive, dehumanizing effort to dictate how women and men would proceed with respect to the children they wished to have.\n\n\n\nAnd then shortly after that, I was in Romania and there I met women who had been subjected to the Communist regime of the 1970s and '80s where they were essentially forced to bear as many children as possible for the good of the state. And where abortion was criminalized and women were literally forced to have physical exams and followed by the secret police and so many children were abandoned and left to the orphanages that, unfortunately, led to an AIDS epidemic.\n\n\n\nSo, you know, when I think about this issue, I think about the whole range of concerns and challenges associated with it and I will continue to do what I can to reduce the number and to improve and increase the care for women and particularly the adoption system and the other opportunities that women would have to make different choices.\n\n\n\nBROWN: Senator, I want to go to the other end of the spectrum and the end of life and ask you, do you believe it is compassionate, that it is appropriate to let someone who is really suffering choose to end their life?\n\n\n\nCLINTON: Again, this is one of those incredibly challenging issues. You know, the Terry Schiavo case in Florida posed that for many people. And it was one of those decisions to go back to Dr. Hunter's point, where there were people of good faith and people of strong feelings on both sides about what should happen to that woman's life.\n\n\n\nAnd I don't know that any of us is in a position to make that choice for families or for individuals, but I don't want us also to condone government action that would legitimize or encourage end of life decisions. Somehow there has to be a framework for us to determine how can people who are either able to make these decisions on their own do so? Or if they are not, how best do we create a decision process for their families to try to decide?\n\n\n\nAnd now we are being faced with a lot of these difficult decisions because of what the world we live in today with modern technology and so much else. And we're going to have to come to grips with them one way or another.\n\n\n\nBROWN: We've got to take a quick break, a commercial break. We'll be back. Much more with Senator Clinton, right after this.\n\n\n\n(COMMERCIAL BREAK)\n\n\n\nBROWN: Welcome back to \"The Compassion Forum\", everyone. We're here with Senator Hillary Clinton.\n\n\n\nAnd, Senator, there are a lot of Americans who are uncomfortable with the conversation that we're having here tonight. That they believe religion already has way too much influence in political life and public life. How do you reassure them?\n\n\n\nCLINTON: Well, I understand that concern because part of our obligation as leaders in America is to make sure that any conversation about religion is inclusive and respectful. And that has not always happened, as we know. And it is so personal. The spiritual journey that each of us takes or doesn't take.\n\n\n\nAnd I think it's important that we recognize that for good cause, I mean, we have been such a vibrant nation when it comes to religious experience in large measure because we've always protected ourselves against, you know, religion going too far, being too intrusive. So it is a balance. And we want religion to be in the public square. If you are a person of faith, you have a right and even an obligation to speak from that wellspring of your faith. But to do so in a respectful and inclusive way.\n\n\n\nSo I understand why some people, even religious people, even people of faith might say, why are you having this forum? And why are you exploring these issues from two people who are vying to be president of the United States?\n\n\n\nAnd I think that's a fair question to ask. I am here because I think it's also fair for us to have this conversation. But I'm very conscious of how thoughtful we must proceed.\n\n\n\nBROWN: Another question from the audience. Rabbi Steve Gutow, who is director of the Jewish Council for Public Affairs is with us.\n\n\n\nRabbi?\n\n\n\nRABBI STEVE GUTOW, JEWISH COUNCIL FOR PUBLIC AFFAIRS: Senator Clinton?\n\n\n\nCLINTON: Yes, Rabbi.\n\n\n\nGUTOW: Back to China. China has continued to persecute and subject to oppression, the people of Tibet. It continues to be the largest supplier of weapons to Sudan and the largest purchaser of its oil. Let's just say China is not doing all it can to stop the genocide in Darfur. You have said that America needs to return to being a moral voice of the world.\n\n\n\nIs our participation in the Beijing Olympics harmful to that moral voice?\n\n\n\nCLINTON: Well, Rabbi, I appreciate your asking this question because I think it's a question of both political and moral significance. And that's why last week I called on our president to decide he would not attend the opening ceremonies of the Olympics because that is a public and very obvious ratification of our government's approval of the Beijing government's actions.\n\n\n\nCLINTON: Unless the Chinese began to take very visible steps to begin to end the suppression of the Tibetans and undermining their culture and religious beliefs, and if we could get more cooperation out of the Chinese government with respect to Sudan.\n\n\n\nAnd, of course, I would welcome even more action on behalf of human rights. But the challenge is, how do we try to influence the Chinese government? And I believe we have missed many opportunities during the Bush administration to do so.\n\n\n\nIn fact, I think it's fair to say our policy toward China is incoherent and that has not been in the best interest of our values or our strategic interest. So I would urge the president at least to consider and, therefore, publicly say that he will not be attending the opening ceremonies.\n\n\n\nAnd let's see whether the Chinese government begins to respond because that for them would be a great loss of face and perhaps we would get more cooperation. We would get the process going that the Dalai Lama has asked for over many years.\n\n\n\nThere could be a lot of ways that the Chinese government demonstrated it heard our concerns.\n\n\n\nBROWN: A question from Reverend William Shaw. He is the president of the National Baptist Convention.\n\n\n\nReverend Shaw?\n\n\n\nCLINTON: He is. Hello, Reverend Shaw. Good to see you again.\n\n\n\nREV. WILLIAM J. SHAW, NATIONAL BAPTIST CONVENTION: Senator. Current U.S. policies toward developing countries -- trade policies, make it sometimes extremely difficult for poor people to access inexpensive, generic drugs for the treatment of AIDS and other sicknesses.\n\n\n\nHow would you shape the policies of your administration to ensure that the poor would have access to and could secure the drugs that they need to improve the quality of their lives, of their families and even the future of their country?\n\n\n\nCLINTON: Well, Reverend Shaw, I agree with your description of this problem, and I believe that our government must do so much more to get generic drugs and low-cost drugs to people suffering.\n\n\n\nNot only from HIV/AIDS, but the range of diseases that affect disproportionately the poor. It's one of the reasons why I voted against the free trade agreement with Central America, because there was a provision that would give even more power to our pharmaceutical companies to prevent exactly doing what you are discussing.\n\n\n\nI have been an outspoken advocate in urging that both our great pharmaceutical companies -- which do a lot of good. Because, after all, they invent the compounds and put them together that the generics then are able to copy.\n\n\n\nBut we need to do much more to get our pharmaceutical companies to work with us to get the drug costs down and to open the pathway for generic drugs. And that's going to take presidential leadership.\n\n\n\nI commend President Bush for his PEPFAR initiative. It was a very bold and important commitment, but it didn't go far enough in opening up the door to generics and getting the costs down.\n\n\n\nAnd as president, I will do that.\n\n\n\nMEACHAM: Senator, we've heard about HIV/AIDS. Many people here are concerned about Darfur and a number of other humanitarian issues. Why do you think it is that a loving God allows innocent people to suffer?\n\n\n\nCLINTON: Well...\n\n\n\n(LAUGHTER)\n\n\n\nMEACHAM: And we just have 30 seconds.\n\n\n\nCLINTON: Yes. You know, that is the subject of generations of commentary and debate. And I don't know. I can't wait to ask him. Because I have...\n\n\n\n(LAUGHTER)\n\n\n\nCLINTON: I have just pondered it endless endlessly.\n\n\n\n(APPLAUSE)\n\n\n\nCLINTON: But I do want to just add that what that means to me is that in the face of suffering, there is no doubt in my mind that God calls us to respond. You know, that's part of what we are expected to do.\n\n\n\nFor whatever reason it exists, it's very existence is a call to action. Certainly in, you know, our...\n\n\n\n(APPLAUSE)\n\n\n\nCLINTON: You know, in my Judeo-Christian faith tradition, in both the Old and the New Testament, the incredible demands that God places on us and that the prophets ask of us, and that Christ called us to respond to on behalf of the poor are unavoidable.\n\n\n\nCLINTON: And it's always been curious to me how our debate about religion in America too often misses that. You know, his holiness, the pope, is going to be coming to America next week, and he's been a strong voice on behalf of what we must do to deal with poverty, and deal with injustice, and deal with what is truly our obligations toward those who are the least among us.\n\n\n\nSo maybe, you know, the lord is just waiting for us to respond to his call, because this despair, this impoverishment of body and soul is what we are expected to be spending our time responding to, and so few of us do.\n\n\n\nEven those who are doing wonderful work with organizations represented in this audience, we are just not doing enough. And it's a personal call; it's a family community, religious call; and it's a governmental call. And we've got to do more to respond to that call.\n\n\n\n(APPLAUSE)\n\n\n\nBROWN: Quickly, just you brought up the Bible. We were talking theology. Do you have a favorite Bible story?\n\n\n\nCLINTON: Oh, I have so many of them. You know, I was fortunate as a child growing up to be read Bible stories, to go to Sunday school, to go to Bible school. And Bill and I read, you know, Bible stories to Chelsea.\n\n\n\nAnd, you know, I have talked about Bible stories and parables a lot in my life with friends. And, you know, it depends upon what's going on in my life at the time.\n\n\n\nBut clearly, for me, the recent Purim holiday for Jews raised the question of Esther. And I have been -- ever since I was a little girl -- a great admirer of Esther. And I used to ask that that be read to me over and over again, because there weren't too many models of women who had the opportunity to make a decision, to take a chance, a risk that, you know, was very courageous.\n\n\n\nAnd so that's the one that's most recently on my mind, because I have some rabbi friends who send me readings that go with the scripture of the week. And certainly, Esther is someone who I wish I knew even more about than what we know from the Bible.\n\n\n\nBROWN: A question from Eboo Patel, who is a Muslim, is the founder and executive director of the Interfaith Youth Core.\n\n\n\nWelcome.\n\n\n\nCLINTON: Hello.\n\n\n\nQUESTION: As-Salamu Alaykum, Senator Clinton.\n\n\n\nCLINTON: Thank you.\n\n\n\nQUESTION: My name is Eboo Patel. I'm an American Muslim, and I lead an organization called the Interfaith Youth Core. And it's my privilege to watch a range of faith communities come together around the common value of compassion.\n\n\n\nAmericans of all faiths and no faith at all genuinely believe in compassion and want to apply that in addressing global poverty and climate change. Can we do that without changing our standard of living?\n\n\n\nCLINTON: Well, I believe there is so much we can do that we're not doing that would not change our standard of living as an imposition from the outside, but which would inspire us to take action that would impact how we live.\n\n\n\nAnd I don't think we would notice it demonstrably undermining our standard of living, but it would give us the opportunity to set an example and to be a model.\n\n\n\nWhen I think about the simple steps any one of us can take -- you know, turning off lights when one leaves a room, unplugging appliances, changing to compact florescent bulbs -- you know, my husband and I have done that -- I don't think it's impacted our standard of living, but we feel like we're making a small contribution to limiting the amount of greenhouse gas emissions, you know, being more mindful of our purchases.\n\n\n\nI hope that, as president, I can model that and lead that effort so that people don't feel so threatened by the changes we're talking about when it comes to dealing with global warming.\n\n\n\nIn preparation for the pope's visit, I was reading that the Vatican is the first carbon-neutral state in the world now. Well, that shows leadership. And I don't think it has impacted the work or the living. You know, Ambassador Flynn, who was our ambassador to the Vatican, might know. But it was a great statement.\n\n\n\nAnd we can do more.\n\n\n\nCLINTON: And I think that, with leadership, people will find ways to take those first steps. And then we can take even more.\n\n\n\nNow there's so much that I have to do as president with the cap in trade system, with moving away from our dependence on foreign oil, but I'm going to look for ways that will cushion the costs on middle class and working and poor people. Because I don't believe that they should have to bear more than what they are bearing right now as we make this transition. And I believe we can accomplish that.\n\n\n\nBROWN: Let's go to Lisa Sharon Harper. She is the executive director of New York Faith and Justice. Welcome to you.\n\n\n\nLISA SHARON HARPER, N.Y. FAITH AND JUSTICE: Thank you. Senator Clinton, underdeveloped nations and regions that lack widespread access to education and basic resources like water, and they tend to be some of the most unstable and dangerous regions of the world. Places like Pakistan, Somalia, Sudan. Our national security is at stake, but our military is stretched. As president, would you consider committing U.S. troops to a purely humanitarian mission under the leadership of a foreign flag?\n\n\n\nCLINTON: Well, let me start by saying, No. 1, I believe strongly that we have to get back to leading on issues like health care and education and women's rights around the world. I have introduced legislation called The Education for All Act. And it's bipartisan. I introduced it first in '04 and then we reintroduced it on a bipartisan basis in '07.\n\n\n\nAnd the work that I would want to do to have the United States lead the world in putting the 77 million kids who aren't in school into school, having us lead when it comes to health care, particularly in malaria, T.B., HIV/AIDS, but also women's health which has been woefully neglected.\n\n\n\nI believe we should demonstrate our commitment to people who are poor, disenfranchised, disempowered before we talk about putting troops anywhere. The United States has to be seen again as a peacekeeper, and we have lost that standing in these last seven years.\n\n\n\nTherefore, I want us to have a partnership, government to government, government with the private sector, government with our NGOS and our faith community to show the best of what America has to offer. You know, I really appreciated President Bush after the tsunami struck, asking his father and my husband to represent the United States and our concern for the people who have been devastated.\n\n\n\nAnd, yes, the military was there delivering supplies. That sent a loud message and it was resonating throughout South Asia -- in Indonesia, the largest Muslim country in the world. America's favorability rose dramatically because we were seen as caring and compassionate toward those with whom we had very little contact or, in fact, some, you know, level of distrust previously.\n\n\n\nSo I think we have to concentrate first and foremost on restoring our moral authority in the world and our standing in the world. And there are lots of ways that the United States military can be helpful and can show the better face of America. After the Pakistan earthquakes, we sent in military teams to help people. So I think that is my emphasis right now.\n\n\n\nBefore we get to what we might do hypothetically, let's see what we will do realistically to rebuild America's moral authority and demonstrate our commitment to compassionate humanitarianism.\n\n\n\nMEACHAM: Senator, this is our last question for you. To return to faith, do you believe God wants you to be president?\n\n\n\nCLINTON: Well, I could be glib and say we'll find out, but I -- I don't presume anything about God. I believe, you know, Abraham Lincoln was right in admonishing us not to act as though we knew God was on our side. In fact, our mission should be on God's side. And I have tried to take my beliefs, my faith and put it to work my entire life. And it has been gratifying to do the little I've done to try to help other people, which is really what motivates me.\n\n\n\nCLINTON: That's why I get up in the morning and see whether there's an individual I can help or a problem I can solve.\n\n\n\nAnd I wouldn't presume to even imagine that God is going to tell me what I should do. I think that he has given me enough guidance, you know, through how I have been raised and how I have been, thankfully, given access to the Bible over so many years, commentary and the like.\n\n\n\nSo I just get up and try to do the best I can. And I think that I see through a glass darkly. I don't believe that any of us know it all and can with any confidence say that we are going to, you know, be doing God's will unless, you know, we are just out there doing our very best, hoping that we make a difference in people's lives.\n\n\n\nAnd that's what I am trying to do in this campaign. That's what I would try to do as president.\n\n\n\nAnd I couldn't be sitting here had it not been for the, you know, gift of grace and faith that keeps me going and, frankly, challenges me. You know, we haven't talked much about the challenge that faith gives us individually.\n\n\n\nI really worry when people become very complacent in their faith, when they do believe they have all the answers, because I just don't think it's humanly possible for any of us to know God's mind. I think we are just searching.\n\n\n\nWe are on this journey together, and we need to approach it with a great deal of humility. And that's what I'm trying to do in this campaign, and we'll see what turns out. But whatever happens, I will get up the next day and try to continue on my journey to do what I can to try to fulfill what I believe to be God's expectations of us.\n\n\n\nBROWN: Senator Clinton, it was a very different kind of evening. You've been a good sport. Thank you.\n\n\n\nCLINTON: Thank you.\n\n\n\n(APPLAUSE)\n\n\n\nBROWN: And, of course, that is only half of our conversation we are having here tonight. Senator Clinton, before you leave the stage, I'd like to bring out now your opponent in this race, Senator Barack Obama of Illinois.\n\n\n\n(APPLAUSE)\n\n\n\nBROWN: Thanks, everybody. When we come back in just a moment, questions for Senator Obama.\n\n\n\n(COMMERCIAL BREAK)\n\n\n\nBROWN: Welcome back, everybody, to the Compassion Forum. And Senator Obama is joining us now. Thanks for being with us. OBAMA: Thank you so much for having me.\n\n\n\nBROWN: So I'm going to start with something that's been in the news. I don't have to tell you that you made some comments recently that are generating a lot of controversy. And I want to remind the audience and our viewers of what you had said.\n\n\n\nYou were talking about people here in small towns in Pennsylvania suffering economic hardship. And you said, quote, \"It's not surprising they get bitter, they cling to guns or religion or antipathy to people who aren't like them.\"\n\n\n\nAnd to a lot of the religious leaders in this room, to a lot of decent, hardworking people out there, it may have come across as you attacking their values or their religion, suggesting that people are \"clinging\" to religion.\n\n\n\nOBAMA: Well, first of all, you know, scripture talks about clinging to what's good. And so it's very important -- my words may have been clumsy, which happens surprisingly often on a presidential campaign...\n\n\n\n(LAUGHTER)\n\n\n\n... but this is something that I've talked about before, I've talked about in my own life, which is that religion is a bulwark, a foundation when other things aren't going well. That's true in my own life, through trials and tribulations.\n\n\n\nAnd so what I was referring to was in no way demeaning a faith that I, myself, embrace. What I was saying is that when economic hardship hits in these communities, what people have is they've got family, they've got their faith, they've got the traditions that have been passed onto them from generation to generation. Those aren't bad things. That's what they have left.\n\n\n\nAnd, unfortunately, what people have become bitter about -- and oftentimes have told me about, as I traveled through not just Pennsylvania, but I was referring to states all across the Midwest, including my home state -- is any confidence that the government is listening to them. They don't think that government is listening to them.\n\n\n\nSo I think it is very important to understand -- and I think it's unfortunate that, in the political process, presidential campaigns, that people have been trying to misconstrue my words -- to understand that, you know, I am a devout Christian, that I started my work working with churches in the shadow of steel plants that had closed on the south side of Chicago, that nobody in a presidential campaign on the Democratic side in recent memory has done more to reach out to the church and talk about, what are our obligations religiously, in terms of doing good works, and how does that inform our politics?\n\n\n\nSo I think that this is an example of, frankly, how the political debate can distract us from what is really at issue and that is: How are we going to create a just and fair society where people are getting a fair shake? And that's why I'm running this campaign.\n\n\n\nBROWN: And Hillary Clinton, who was just here, said you're being elitist.\n\n\n\nOBAMA: Well, that is, I think, a good example of what happens on the presidential campaign, is that we try to tear each other down instead of lifting the country up.\n\n\n\nOBAMA: But, you know, the notion that somebody like myself, who has been working in churches since I got out of college. and whose entire trajectory, not just during this campaign, but long before, has been to talk about how Democrats need to get in church, reach out to evangelicals, link faith with the work that we do.\n\n\n\nThe notion that somehow I am standing above that when that essentially describes much of what I've been doing over the last 20 years doesn't make much sense.\n\n\n\nMEACHAM: Senator, do you believe that God intervenes in history and rewards or punishes people or nations in real time for their behavior?\n\n\n\nOBAMA: You know, what I believe is that God intervenes, but that his plans are a little too mysterious for me to grasp. And so what I try to do is, as best I can, be an instrument of his will. To act in what I think is accordance to the precepts of my faith.\n\n\n\nAnd, you know, if I'm acting in an ethical way, if I am working to make sure that I am applying what I consider to be a core value of Christianity, but also a core value of all great religions, and that is that I am my brother's keeper and I am my sister's keeper, then I will be doing my part to move his agenda forward.\n\n\n\nI don't know what that master plan is. And I don't presume to know. And I think that none of us know. But what we do -- what I think we can do is to act in ways that are consummate with the values that we cherish.\n\n\n\nAnd sometimes that's harder to do in politics than it should be. But I think that's what's demanded of us.\n\n\n\nBROWN: Let's take a question from Reverend Samuel Rodriguez, who is with us. He is president of the National Hispanic Christian Leadership Conference.\n\n\n\nReverend?\n\n\n\nREV. SAMUEL RODRIGUEZ, PRESIDENT, NATIONAL HISPANIC LEADERSHIP CONFERENCE: Senator Obama, the vast majority of Americans believe that abortion is a decision to be made by a woman, her family and her doctors. However, the vast majority of Americans similarly believe that abortion is the taking of a human life.\n\n\n\nThe terms pro-choice and pro-life, do they encapsulate that reality in our 21st Century setting and can we find common ground? OBAMA: I absolutely think we can find common ground. And it requires a couple of things. Number one, it requires us to acknowledge that there is a moral dimension to abortion, which I think that all too often those of us who are pro-choice have not talked about or tried to tamp down. I think that's a mistake because I think all of us understand that it is a wrenching choice for anybody to think about.\n\n\n\nThe second thing, once we acknowledge that, is to recognize that people of good will can exist on both sides. That nobody wishes to be placed in a circumstance where they are even confronted with the choice of abortion. How we determine what's right at that moment, I think, people of good will can differ.\n\n\n\nAnd if we can acknowledge that much, then we can certainly agree on the fact that we should be doing everything we can to avoid unwanted pregnancies that might even lead somebody to consider having an abortion.\n\n\n\nAnd we've actually made progress over the last several years in reducing teen pregnancies, for example. And what I have consistently talked about is to take a comprehensive approach where we focus on abstinence, where we are teaching the sacredness of sexuality to our children.\n\n\n\nBut we also recognize the importance of good medical care for women, that we're also recognizing the importance of age-appropriate education to reduce risks. I do believe that contraception has to be part of that education process.\n\n\n\nAnd if we do those things, then I think that we can reduce abortions and I think we should make sure that adoption is an option for people out there. If we put all of those things in place, then I think we will take some of the edge off the debate.\n\n\n\nWe're not going to completely resolve it. I mean, there -- you know, at some point, there may just be an irreconcilable difference. And those who are opposed to abortion, I think, should continue to be able to lawfully object and try to change the laws.\n\n\n\nOBAMA: Those of us, like myself, who believe that in this difficult situation it is a woman's responsibility and choice to make in consultation with her doctor and her pastor and her family.\n\n\n\nI think we will continue to suggest that that's the right legal framework to deal with the issue. But at least we can start focusing on how to move in a better direction than the one we've been in the past.\n\n\n\nMEACHAM: Senator, do you personally believe that life begins at conception? And if not, when does it begin?\n\n\n\nOBAMA: This is something that I have not, I think, come to a firm resolution on. I think it's very hard to know what that means, when life begins. Is it when a cell separates? Is it when the soul stirs? So I don't presume to know the answer to that question. What I know, as I've said before, is that there is something extraordinarily powerful about potential life and that that has a moral weight to it that we take into consideration when we're having these debates.\n\n\n\nBROWN: Let me go to, again, are the end of the spectrum on that. There are a lot of philosophical and ethical questions relating to ending one's life. In \"The Audacity of Hope,\" you write very movingly about your mother's fight with cancer, the pain she was in and the process that she went through, especially toward the end.\n\n\n\nIn that vein, if someone today was in her position, and wanted to take active steps to end his or her own life, do you think that would be OK morally?\n\n\n\nOBAMA: Well I think we have to be very careful in making end of life decisions. I believe in first of all everybody having a living will so that their views on these issues can be factored in by family members and their doctors and many of the difficult choices that are made are made because people don't have guidance from the individual.\n\n\n\nI do believe in the importance of medicine and that if somebody is terminally ill, relieving their pain and suffering is the right thing to do. What happens then is you start getting into a gray area where relieving pain and suffering may accelerate death in some situations and that's a decision that should be made by the individual, the family and the doctor.\n\n\n\nI don't think that it's appropriate to empower doctors themselves to make that decision. But I think that it is important for us to be able to allow people who are terminally ill, in excruciating pain, to get the medicine they need to relieve that pain.\n\n\n\nBROWN: By relieve that pain you mean hasten the end of life if they choose to?\n\n\n\nOBAMA: And I think that there has to be very strict guidelines to ensure that somebody who is making a decision to relieve their pain that might take a week away from their life just because they are -- they are slipping into a coma quicker, for example. That that is distinguished from -- or at least there's a possibility that they slip into a coma. That that's distinguished from euthanasia in which someone else is making the decision for them.\n\n\n\nBROWN: Let's go to Dr. Frank Page, who's with us, president of the Southern Baptist Convention.\n\n\n\nDr. Page?\n\n\n\nFRANK PAGE, SOUTHERN BAPTIST CONVENTION: Thank you, Senator Obama. Thank you for being here at Messiah College for the Compassion Forum. Southern Baptists have been very active for years in sub- Saharan Africa in the HIV/AIDS relief ministries. Sometimes orphan care, sometimes educational activities.\n\n\n\nBut we also are involved in a ministry called True Love Waits, which has been credited by the government of Uganda from lowering the AIDS infection rate there dramatically from 30 percent to 6 percent. But we also teach a part of that, that faith has a role in the issue of HIV/AIDS. Do you concur with that and would you elaborate on that, please.\n\n\n\nBROWN: Can I just clarify, true love waits is an abstinence program.\n\n\n\nPAGE: Abstinence based and faith based, yes.\n\n\n\nOBAMA: Well first of all, congratulations to those who have been involved in that work. I think it's important work. And I think you may know my father came from this part of the world. I visited Kenya multiple times. I have been working with a group of grandmas who were helping AIDS orphans in Kenya.\n\n\n\nOBAMA: Michelle and I, when we were traveling there, took an AIDS test before thousands of people to encourage the importance of them getting clear on what their status was and hopefully reducing infections.\n\n\n\nAnd, by the way, this is an area where -- this doesn't happen very often, so everybody should take note -- where I compliment George Bush. I actually think that...\n\n\n\n(APPLAUSE)\n\n\n\nI actually think that the PEPFAR program is one of the success stories of this administration. We've seen a drastic increase in funding. And terrific work is being done between the CDC, the NIH, local AIDS organizations, NGOs.\n\n\n\nMy view is, is that we should use whatever the best approaches are, the scientifically sound approaches are, to reduce this devastating disease all across the world.\n\n\n\nAnd part of that, I think, should be a strong education component and I think abstinence education is important. I also think that contraception is important; I also think that treatment is important; I also think that we have to do more to make antiviral drugs available to people who are in extreme poverty.\n\n\n\nSo I don't want to pluck out one facet of it. Now, that doesn't mean that non-for-profit groups can't focus on one thing while the government focuses on other things. I think we want to have a comprehensive approach.\n\n\n\nI do think that -- and I've said this when I was in Kenya -- that there is a behavioral element to AIDS that has to be addressed. And if there is -- if there's promiscuity and we are pretending that that's not an issue in spreading AIDS, then we're missing part of the answer.\n\n\n\nBut I also think that -- keep in mind, women are far more likely to be infected now between the ages of 18 and 25 than are men. And that's why focusing, for example, on the status of women, empowering women, giving them microbicides, or other strategies that would allow them to protect themselves when they sometimes in certain situations may not be able to protect themselves from having unprotected sex, all those things are going to be just as important, as well.\n\n\n\nMEACHAM: Sir, in an earlier occasion in...\n\n\n\n(APPLAUSE)\n\n\n\n... an earlier occasion in talking about your own daughters and talking about sex education and contraception, you said that you would not want your daughter \"punished with a baby\" if she made a mistake, that you would teach values and morals, but if something were to happen. The phrase \"punished with a baby\" was jarring to a number of people. Could you explain what you meant by that?\n\n\n\nOBAMA: Well, keep in mind, on that same day, I said children are miracles, and so I think it's important not to parse my words too carefully here. What I was saying was that my daughters are 9 and 6.\n\n\n\n(LAUGHTER)\n\n\n\nAnd so if, at the age of 12 or 13, they made what I would consider to be a mistake, in having sex or unprotected sex, and ended up getting pregnant -- I think that statistically we know 12- or 13- year-olds who are having children are much more likely to be impoverished, are much more likely to have health problems, are much more likely to have trouble raising that child.\n\n\n\nAnd so all I meant was we want to prevent teen pregnancies. And what we don't want to do is to be blind to the possibility that kids will screw up, just like, surprisingly enough, we as adults screw up sometimes.\n\n\n\nAnd, you know, we should factor in the possibility that they make mistakes in our approach to dealing with STDs, which is what I was being asked about at the time.\n\n\n\nAnd we want to make sure that, even as we are teaching responsible sexuality and we are teaching abstinence to children, that we are also making sure that they've got, you know, enough understanding about contraception that they don't end up having much more severe problems because of a dumb mistake.\n\n\n\nBROWN: Senator, if one of your daughters asked you -- and maybe they already have -- \"Daddy, did God really create the world in six days?\" What would you say?\n\n\n\nOBAMA: You know, I'm trying to remember if we had this conversation.\n\n\n\n(LAUGHTER)\n\n\n\nOBAMA: You know, what I've said to them is that I believe that God created the universe and that the six days in the Bible may not be six days as we understand it. It may not be 24-hour days. And that's what I believe. I know there's always a debate between those who read the Bible literally and those who don't. And, you know, that, I think, is a legitimate debate within the Christian community of which I am a part.\n\n\n\nYou know, my belief is, is that the story that the Bible tells about God creating this magnificent Earth on which we live, that that is -- that is essentially true. That is fundamentally true.\n\n\n\nNow whether it happened exactly as we might understand it reading the text of the Bible, that, you know, I don't presume to know.\n\n\n\nBROWN: Let's go to...\n\n\n\nOBAMA: But let me just make one last point on this. I do believe in evolution. I don't think that is incompatible with Christian faith. Just as I don't think science generally is incompatible with Christian faith.\n\n\n\nAnd I think that this is something that, you know, we get bogged down in. There are those who suggest that if you have a scientific bent of mind, then somehow you should reject religion. And I fundamentally disagree with that.\n\n\n\nIn fact, the more I learn about the world, the more I know about science, the more I'm amazed about the mystery of this planet and this universe. And it strengthens my faith as opposed to weakens it.\n\n\n\n(APPLAUSE)\n\n\n\nBROWN: Let's go to Reverend Richard Cizik, who is vice president of the National Association of Evangelicals.\n\n\n\nReverend?\n\n\n\nREV. RICHARD CIZIK, VICE PRESIDENT, NATIONAL ASSOCIATION OF EVANGELICALS: Good evening, Senator. You just took my question. Congratulations. You won the prize. No, let me flesh this out just a little bit, if you wouldn't mind.\n\n\n\nOBAMA: Sure.\n\n\n\nCIZIK: Frankly, there has been perceived, by many, millions, a war between science and faith. I don't believe there's a war at all. In fact, the worlds of religion and science are coming together in amazing ways, including here on this campus.\n\n\n\nFor example, you have young evangelical Christians who are leaders on developing what we call \"creation care\" or a policy on climate change. And so let me ask you, you have already hinted at it, but let me ask you in specific.\n\n\n\nHow do you relate your faith our personal convictions to science generally and science policy, and let's take an issue like climate and flesh that out, or take stem cells, something like that. Just give us a little more indication of how you think.\n\n\n\nOBAMA: Well, first of all...\n\n\n\nCIZIK: Is that fair enough?\n\n\n\nOBAMA: It is fair enough. And you guys have done some terrific work on this. So I want to congratulate you on that.\n\n\n\n(APPLAUSE)\n\n\n\nOBAMA: And should it be part of God's plan to have me in the White House, I look forward to our collaboration.\n\n\n\n(LAUGHTER)\n\n\n\n(APPLAUSE)\n\n\n\nOBAMA: So, look, the -- one of the things I draw from the Genesis story is the importance of us being good stewards of the land, of this incredible gift. And I think there have been times where we haven't been and this is one of those times where we've got to take the warning seriously.\n\n\n\nI know that Al Gore was mentioned earlier. By the way, I have to say, I think Al Gore won. And...\n\n\n\n(APPLAUSE)\n\n\n\nOBAMA: And has done terrific work since. But I think that we are seeing enough warning signs for us to take this seriously. And part of what my religious faith teaches me is to take an intergenerational view, to recognize that we are borrowing this planet from our children and our grandchildren.\n\n\n\nAnd so we've got this obligation to them, which means that we've got to make some uncomfortable choices. And where I think potentially religious faith and the science of global warming converge is precisely because it's going to be hard to deal with.\n\n\n\nWe have to find resources in ourselves that allow us to make those sacrifices where we say, you know what? We're not going to leave it to the next generation. We're not going to wait.\n\n\n\nOBAMA: We are going to put in place a cap-and-trade system that controls the amount of greenhouse gases that are going into the atmosphere. And we know that that requires us to make adjustments in terms of how we use energy. We've got to be less wasteful, both as a society and in our own individual lives.\n\n\n\nAnd having faith, believing that this planet and this world extends beyond us, it's not just here for us, but it's here for, you know, more generations to come. I think religion can actually bolster our desire to make those sacrifices now. And that's why, as president, I hope to be able to rally the entire world around the importance of us being good stewards of the land.\n\n\n\nBROWN: All right, Senator Obama, we're going to take a quick break. Everybody stay with us. We'll be right back. When we come back, we'll ask Senator Obama what he will tell those Americans who say there's too much religion in government.\n\n\n\n(COMMERCIAL BREAK)\n\n\n\nBROWN: Welcome back, everybody, to Messiah College in Grantham, Pennsylvania. We're talking to the Democratic candidates about how the role of faith and compassion would play in their presidency. Senator Barack Obama is with us now.\n\n\n\nJon?\n\n\n\nMEACHAM: You have spoken about how your former pastor in Chicago, the Jeremiah Wright was critical in helping bring you to Christianity and is like part of your family. Can you tell us how he helped bring you closer to God?\n\n\n\nOBAMA: Well, I actually wrote about this in my second book \"Audacity of Hope.\" I had worked as an organizer on the South Side, as I mentioned and it was tough work.\n\n\n\nOBAMA: You know, the community was in difficult straits. And I was bringing churches together to set up job training programs and after-school programs for youth and to try to bring economic development to the community.\n\n\n\nI had been raised in a nonreligious home. My mother was the most spiritual person I know, but was mistrustful of organized religion, in part because of some of her experiences seeing segregation being compatible with organized religion. And so we went to church very infrequently.\n\n\n\nSo as I'm doing this organizing, some of the pastors started saying, \"You know, you've got great ideas, Obama, but, you know, if you're going to organize churches, it might help if you were going to church.\"\n\n\n\n(LAUGHTER)\n\n\n\nAnd I thought, \"Well, that's not an unreasonable position.\" And so I started visiting some churches. Trinity United Church of Christ was one of the churches that we were trying to get involved in the organization.\n\n\n\nI visited that church and found the ministries that they were doing on HIV/AIDS, on prison ministries, there were a whole host of wonderful ministries that they were engaged in. And Reverend Wright's sermons spoke directly to the social gospel, the need to act and not just to sit in the pews.\n\n\n\nAnd so I found that very attractive and ended up joining the church when I got out of law school. Now, I have to say that, you know, in reports subsequently, there's been this notion that he was, by various terms, my spiritual adviser or my spiritual mentor. You know, he's been my pastor.\n\n\n\nAnd what that means is, is that, you know, the ministries that have been built in that church community have been very important to me. It also means that there are areas where we've disagreed on. And, obviously, the most recent loop that's been playing -- Reverend Wright's greatest hits, so to speak...\n\n\n\n(LAUGHTER)\n\n\n\n... are, I think, both a distortion of who he is and what the church has been about, but also express...\n\n\n\n(APPLAUSE)\n\n\n\n... but also express, you know, some comments that I think are deeply offensive and are contrary to what I believe. And I've told him so and have made a lot of statements about that, including one pretty long one in Philadelphia.\n\n\n\nBut that doesn't detract...\n\n\n\n(APPLAUSE)\n\n\n\nThat, I think, doesn't detract from the incredible church community that this is. And I think that all of us who have been part of a faith community know that the church is a body of believers and it brings in the imperfections of us, men and women.\n\n\n\nAnd, you know, pastors are imperfect. Certainly, the membership is imperfect. I, as somebody who is sitting in the pews as a sinner, is imperfect. And, you know, that doesn't detract from, I think, what the church is supposed to be about, which is to worship God and proclaim the good news.\n\n\n\nBROWN: Senator, you are a Christian, but as a child you had more exposure to Islam than probably most Americans ever will. How did that shape you?\n\n\n\nOBAMA: Well, I lived in Indonesia for four-and-a-half years when I was a child. And, actually, ironically, the first school I went to in Indonesia was a Catholic school. So, you know, myself and Senator Bob Casey, who's sitting here, we had pretty similar experiences probably, in part, of at least our elementary school.\n\n\n\nI then attended a public school, but the majority of the country was Muslim. And the brand of Islam that was being practiced in Indonesia at the time was a very tolerant Islam. The country itself was explicitly secular in its constitution.\n\n\n\nAnd so you didn't have the oppressive state that was trying to impose people's religious beliefs. And Christians and people of other faiths lived very comfortably there. And women were working, and out, and were not wearing the traditional coverings that we see in the Middle East.\n\n\n\nAnd so what it taught me, and what it still teaches me, as I think about foreign policy now, is that Islam can be compatible with the modern world.\n\n\n\nOBAMA: It can be a partner with the Christian and Jewish and Hindu and Buddhist faiths in trying to create a better world.\n\n\n\nAnd so I am always careful and suspicious of attempts to paint Islam with a broad brush because the overwhelming majority of the people of the Islamic faith are people of good will who are trying to raise their families and live up to their values and ideals and to try to raise their kids as best they can and that's something that I think we always have to remember as opposed to assuming a clash of civilizations that sometimes are overheated rhetoric that politically is talked about.\n\n\n\nBROWN: Let's go to Reverend Jim Wallace.\n\n\n\nReverend Wallace, he is president of Sojourners, a Christian social justice organization.\n\n\n\nREV. JIM WALLACE, PRESIDENT, SOJOURNERS: Hello, Senator.\n\n\n\nOBAMA: How are you, Jim?\n\n\n\nWALLACE: I'm good. As you reminded us a week or two ago, when Dr. Martin Luther King Jr. was killed 40 years ago, he wasn't just speaking about civil rights. He was fighting for economic justice, was about to launch a poor people's campaign.\n\n\n\nYet, four decades after the anniversary of his death, the poverty rate in America is virtually unchanged and one in six of our children are poor in the richest nation in the world.\n\n\n\nSo in the faith community, we are wanting a new commitment around a measurable goal, something like cutting poverty in half in 10 years. Would you commit -- would you at this historic compassion forum, commit to such a goal tonight and if elected, tell us how you'd mobilize the nation, mobilize us to achieve that goal?\n\n\n\nOBAMA: Well, first of all, Jim, I appreciate the good work you've been doing on these issues. And I absolutely will make that commitment. Understand that when I make that commitment, I do so with great humility because it is a very ambitious goal. And we're going to have to mobilize our society, not just to cut poverty, but to prevent more people from slipping into poverty.\n\n\n\nYou know, this actually goes back to the earlier point you raised where Senator Clinton suggested I was being elitist when I said that people are frustrated and bitter. That is absolutely true. That's not just true in small towns. That's true in urban areas. That's true in my community of the South Side of Chicago. Because people feel forgotten. They feel as if nobody is listening in Washington.\n\n\n\nAnd that every four years we have politicians who come out and make promises and they are not kept. And so that's why I wanted to put the caveat on there. I make that commitment with humility because we've got a lot of work to do economically in this country to bring about a more just and fair economy. It starts with, I think, recognizing the rages and incomes for average families have gone down during the most recent economic expansion. That's never happened before in the history of America since we started recording these statistics, at least since World War II.\n\n\n\nSo we've got to shore up the mortgage market to make sure that we don't have millions of people who are losing their homes. We're going to have to I think change our tax code. For us to provide tax breaks to the wealthiest among us, those who didn't need them and weren't even asking for them, at a time when ordinary folks are struggling to fill up a gas tank just to get to a job.\n\n\n\nI met a guy here in Pennsylvania when Bob Casey and I were traveling around who told me his problem was he's looking for a job and it costs him more than he can afford just to go to a job interview.\n\n\n\nAnd so we've got to give them some tax relief, and we've got to invest in our infrastructure to create jobs, particularly those who are going to be getting laid off in the construction industry, the housing market goes down. And I put forward very specific plans for that.\n\n\n\nWe're going to have to, I think, invest heavily in clean energy. And if we have a cap in trade system, we can generate $150 billion over 10 years to invest in solar and wind and biodiesel and train people to build windmills and solar panels and make buildings more energy efficient -- and make alternative fuels.\n\n\n\n(APPLAUSE)\n\n\n\nOBAMA: All of these things -- all of these things will strengthen the economy generally. And I left out one last point, health care. People are falling into bankruptcy. They are going without medical care. It is a moral imperative that we make sure that we have a plan in place that provides health care to every single American and that has high quality and provides prevention.\n\n\n\nIf we do those things -- and that applies not just to poor people but to working and middle class families all across the country, then we also have to focus on those who, even when the economy is good and the middle class are doing well, are still impoverished, and that's a special challenge.\n\n\n\nAnd that involves, I think, going at the problem at its roots very early. Investing in early childhood education, working with at- risk parents...\n\n\n\n(APPLAUSE)\n\n\n\nOBAMA: ... drastically improving our education system, K through 12, by paying our teachers more and demanding more from them.\n\n\n\n(APPLAUSE)\n\n\n\nOBAMA: Making sure that we have after-school programs and summer school programs. And many of these, by the way, can be part of a faith community. And so, you know, just to go back to our theme here tonight, people sometimes ask me, what do I think about faith-based initiatives? I want to keep the Office of Faith-Based Initiatives open, but I want to make sure that its mission is clear. It's not to -- it's not to simply build a particular faith community, the faith-based initiatives should be targeted specifically at the issue of poverty and how to lift people up.\n\n\n\nAnd partnering with faith communities, I think we can achieve that as long as it's within the requirements of our Constitution. We make sure that it's open to everybody. It's not simply the federal government funding certain groups to be able to evangelize.\n\n\n\n(APPLAUSE)\n\n\n\nBROWN: Let's go to Dr. David Gushee, who is the president of Evangelicals for Human Rights.\n\n\n\nDr. Gushee?\n\n\n\nDAVID P. GUSHEE, MERCER UNIVERSITY: Senator Obama, recently yet another disturbing memo emerged from the Justice Department. This one said that not even interrogation methods that, quote, \"shock the conscience\" would be considered torture nor would they be considered illegal if they had been authorized by the president.\n\n\n\nSenator Obama, this kind of reasoning shocks the conscience of many millions of Americans and many millions of people of faith here and around the world. Is there justification for policies on the part of our nation that permit physical and mental cruelty toward those who are in our custody?\n\n\n\nOBAMA: We have to be clear and unequivocal. We do not torture, period. We don't torture.\n\n\n\n(APPLAUSE)\n\n\n\nOBAMA: Our government does not torture. That should be our position. That should be our position. That will be my position as president. That includes, by the way, renditions. We don't farm out torture. We don't subcontract torture.\n\n\n\n(APPLAUSE)\n\n\n\nOBAMA: And the reason this is important is not only because torture does not end up yielding good information -- most intelligence officers agree with that. I met with a group -- a distinguished group of former generals who have made it their mission to travel around and talk to presidential candidates and to talk in forums about how this degrades the discipline and the ethos of our military.\n\n\n\nIt is very hard for us when kids, you know, 19, 20, 21, 22 are in Iraq having to make difficult decisions, life or death decisions every day, and are being asked essentially to restrain themselves and operate within the law.\n\n\n\nAnd then to find out that our own government is not abiding by these same laws that we are asking them to defend? That is not acceptable. And so my position is going to be absolutely clear.\n\n\n\nAnd it is also important for our long-term security to send a message to the world that we will lead not just with our military might but we are going to lead with our values and our ideals.\n\n\n\nThat we are not a nation...\n\n\n\n(APPLAUSE)\n\n\n\nOBAMA: ... that gives away our civil liberties simply because we're scared. And we're always at our worst when we're fearful. And one of the things that my religious faith allows me to do, hopefully, is not to operate out of fear.\n\n\n\nFear is a bad counsel and I want to operate out of hope and out of faith.\n\n\n\n(APPLAUSE)\n\n\n\nBROWN: We are almost out of time. I asked the same question to Senator Clinton, though. And it's that there are a lot of Americans who believe the conversation going on here tonight is not necessarily appropriate.\n\n\n\nThey believe that religion has far too much influence in public life. What do you say to that?\n\n\n\nOBAMA: Well, you know, what I've written in the past, what I've -- I actually spoke at a Sojourner's forum two years ago on this precise issue. And I think that we have fallen into a false debate.\n\n\n\nOn the one hand, there have been elements, many of them in my own party, in the Democratic Party, that believe that any influence of religion whatsoever in the public debate somehow is problematic or violates church and state.\n\n\n\nOn the other hand, there have been those primarily in the other party, in the Republican Party, whose view has been that the separation between church and state shouldn't even be there. And I think both extremes are wrong.\n\n\n\nWhat I believe is that all of us come to the public square with our own values and our ideals and our ethics, what we believe. And people of religious faith have the same right to come to that public square with values and ideals that are rooted in their faith.\n\n\n\nAnd they have the right to describe them in religious terms, which has been part of our history. As I said in some of my writings, imagine Dr. King, you know, going up before, in front of the Lincoln Memorial and having to scrub all his religious references, or Abraham Lincoln in the Second Inaugural not being able to refer to God.\n\n\n\nWhat religious language can often do is allow us to get outside of ourselves and mobilize around a common good.\n\n\n\nOn the other hand, what those of us of religious faith have to do when we're in the public square is to translate our language into a universal language that can appeal to everybody.\n\n\n\nAnd both Lincoln and King did this and every great leader did it, because we are not just a Christian nation. We are a Jewish nation; we are a Buddhist nation; we are a Muslim nation; Hindu nation; and we are a nation of atheists and nonbelievers.\n\n\n\nAnd it is important for us not to try to kill the debate by saying, \"Well, God tells me I'm right, and so I'm not going to listen to you.\" Rather, we've got to translate whatever it is that we believe into a language that allows for argument, allows for debate, and also allows that we may be wrong.\n\n\n\nAnd the biggest danger, I think, for those of us of religious faith when we're in the public sphere is a certain self-righteousness, where we start thinking that, \"Well, you know, I've got a direct line to God.\" You know, that is incompatible with democracy.\n\n\n\nYou may have a direct line to God. But, you know, that is not -- the public square is not the place for us to empower ourselves in that way.\n\n\n\nBROWN: Many more questions, I'm sure, but we have to end it there. We're out of time.\n\n\n\nSenator Barack Obama, thank you very much.\n\n\n\n(APPLAUSE)\n\n\n\nOBAMA: Thank you.\n\n\n\nBROWN: Appreciate it. Thank you.\n\n\n\n(APPLAUSE)\n\n\n\nOBAMA: Are you going to sign off, because I want to just say hi to some people.\n\n\n\nBROWN: Please do. Please do. We're going to sign off.\n\n\n\nOBAMA: Is that OK?\n\n\n\nBROWN: Absolutely.\n\n\n\nI want to thank my co-host, Newsweek's Jon Meacham, as well as all those who joined us for tonight's forum, and also to the folks at Faith in Public Life, the ONE Campaign, and Oxfam America.\n\n\n\nAnd, finally, a big thanks to our hosts here at Messiah College.\n\n\n\nSenator John McCain, we should mention, was not able to join us tonight. We look forward, though, to having him and the eventual Democratic nominee for another Compassion Forum very soon.\n\n\n\nI'm Campbell Brown in Grantham, Pennsylvania. Thanks for watching.\n\n\n\nTO ORDER A VIDEO OF THIS TRANSCRIPT, PLEASE CALL 800-CNN-NEWS OR USE OUR SECURE ONLINE ORDER FORM LOCATED AT www.voxantshop.com\n\n", "images": ["http://i.cdn.turner.com/cnn/.element/img/3.0/global/header/hdr-close.jpg", "http://cdn.cnn.com/cnn/images/1.gif", "http://i.cdn.turner.com/cnn/.element/img/3.0/global/header/nav-arrow.gif", "http://i.cnn.net/cnn/.element/img/1.0/sect/TRANSCRIPTS/header.transcripts.gif", "http://i.cnn.net/cnn/images/1.gif", "http://i.cdn.turner.com/cnn/.element/img/3.0/global/header/hdr-main.gif", "http://i.a.cnn.net/cnn/images/1.gif", "http://i.cnn.net/cnn/.element/img/1.0/sect/TRANSCRIPTS/shows_by_cat_white_header.gif", "http://i.cdn.turner.com/cnn/.element/img/3.0/global/header/hdr-arrow.jpg"], "top_img": "http://i.cdn.turner.com/cnn/.element/img/3.0/global/header/hdr-main.gif", "keywords": [], "authors": [], "canonical_link": "", "title": "Transcripts", "meta_data": {}, "movies": [], "publish_date": null, "source": "http://transcripts.cnn.com", "summary": ""}