{"url": "https://www.bbc.com/sport/tennis/44359726", "text": "Serena Williams is a three-time winner of the French Open women's singles title\n\nFrench Open 2018 Venue: Roland Garros, Paris Dates: 27 May-10 June Coverage: Daily live radio and text commentaries on BBC Radio 5 live, the BBC Sport website and app.\n\nSerena Williams pulled out of the French Open before her fourth-round match with Maria Sharapova because of an injury that affected her serve.\n\nThe 23-time Grand Slam winner recently returned to tennis after giving birth to her first child, but looked in good form in her opening matches.\n\n\"I've had issues with the right pectoral muscle to the point where I can't serve,\" said the 36-year-old.\n\n\"I'll have a scan. I won't know about Wimbledon until I get the results.\"\n\nWilliams said she first felt the problem during her third-round win over German 11th seed Julia Gorges on Saturday.\n\nShe played in a doubles match with sister Venus on Sunday, saying she wanted to try to manage the problem before her match with Sharapova.\n\n\"I tried lots of taping and support to see how it felt in match circumstances,\" Williams said.\n\n\"It is hard to play when I can't physically serve. I've never had this injury before, I've never felt it in my life and it was so painful.\n\n\"I don't know how to manage it.\"\n\nWilliams said she will have an MRI scan in Paris on Tuesday and will stay in the French capital at least until the extent of her injury is clear.\n\nSharapova said she was \"looking forward\" to playing Williams and \"disappointed\" the American had to withdraw.\n\n\"I wish her a speedy recovery and hope she returns to the tour soon,\" she added.\n\nThe 31-year-old Russian, a two-time winner at Roland Garros, will play 2016 champion Garbine Muguruza. The Spaniard was 2-0 up in the opening set of her match against Lesia Tsurenko when the Ukrainian retired hurt.\n\nRivalry was set to be renewed\n\nThe possibility of Williams facing Sharapova had been grabbing attention since the draw was made at Roland Garros 10 days ago.\n\nAnd the meeting of the two former champions, both making comebacks at Roland Garros this year, was set up when Williams beat Gorges shortly after Sharapova beat Czech sixth seed Karolina Pliskova.\n\nWilliams has recently returned after giving birth to daughter Olympia in September, while 28th seed Sharapova is back in the draw after being refused a wildcard last year as she returned from a 15-month drugs ban.\n\nThe pair have had a frosty relationship since they first met on court in 2003, although Williams said in her pre-match news conference on Saturday that she did not have any \"negative feelings\" towards the Russian.\n\nThere has not been much of a rivalry on court in recent years, Williams having won 19 of their 21 meetings. Both of Sharapova's wins came in 2004 - including that year's Wimbledon final.\n\nSix matches in six days takes its toll - analysis\n\nTennis correspondent Russell Fuller at Roland Garros\n\nWilliams had been in astoundingly good form in the first week, but footage of the final set of Sunday's doubles - which she and sister Venus lost 6-0 - showed Serena rolling in a number of slow first serves.\n\nThe three-time champion chose to play doubles as well as singles because she knew she needed matches under her belt. But six matches in six days - after just four in the previous 16 months - appears to have taken its toll. A pectoral injury is most commonly associated with overuse.\n\nTuesday's MRI scan will reveal more, but if there is no serious damage, then Wimbledon may still be very much within Williams' sights. There are still four weeks to go, and not being able to play a grass-court warm-up event beforehand should not be a concern: only twice in her career has she done so.", "images": ["https://ssc.api.bbc.com/?c1=2&c2=19293874&ns_site=bbc&name=", "http://b.scorecardresearch.com/p?c1=2&c2=17986528&cv=2.0&cj=1", "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/1083/production/_101872240_williams_rex2.jpg", "https://a1.api.bbc.co.uk/hit.xiti?&col=1&from=p&ptag=js&s=598253&p=tennis::sport.tennis.story.44359726.page&x1=[urn:bbc:cps:fe8d4eb8-9129-bc4b-a9cd-c53793aee759]&x2=[responsive]&x3=[bbc_website]&x4=[en]&x7=[article]&x8=[reverb-1.4.0-nojs]&x11=[SPORT_GNL]&x12=[SPORT]", "https://ichef.bbci.co.uk/onesport/cps/480/cpsprodpb/5EA3/production/_101872242_williams_bodyreuters.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/1083/production/_101872240_williams_rex2.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bbc.com/sport/tennis/44359726", "title": "French Open: Serena Williams pulls out with injury before Maria Sharapova match", "meta_data": {"description": "Serena Williams says an injury that affected her serve forced her to pull out of the French Open before her last-16 match with Maria Sharapova.", "og": {"site_name": "BBC Sport", "url": "https://www.bbc.com/sport/tennis/44359726", "title": "French Open: Serena Williams pulls out with injury before Maria Sharapova match", "description": "Serena Williams says an injury that affected her serve forced her to pull out of the French Open before her last-16 match with Maria Sharapova.", "type": "article", "image": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/1083/production/_101872240_williams_rex2.jpg"}, "rnews": {"datePublished": "2018/06/04 17:02:05"}, "apple-mobile-web-app-title": "BBC Sport", "apple-itunes-app": "app-id=594842980, app-argument=https://www.bbc.com/sport/tennis/44359726", "theme-color": "#ffd230", "application-name": "BBC Sport", "msapplication-TileImage": "https://static.bbc.co.uk/onesport/2.11.755/images/web-icons/bbc-sport-144.png", "msapplication-TileColor": "#ffd230", "twitter": {"site": "@bbcsport", "card": "summary_large_image"}, "article": {"section": "Tennis"}, "fb": {"pages": "1392506827668140,137920769558355,193435954068976,118450564909230,100978706649892,15286229625,21263239760,122103087870579,120655094632228,102814153147070,124715648647,153132638110668,150467675018739,1033940569952576,857410004307950,624989267645024,1471706783148263,228735667216,317278538359186,958681370814419,260967092113,168895963122035,114010462015043,8251776107,273726292719943,232455204224,1436581493296609,8585725981,8244244903,470911516262605,413132078795966,7519460786,1470145583204829", "admins": 100004154058350}, "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1528102925.0, "source": "https://www.bbc.com", "summary": ""}