{"url": "https://www.vox.com/culture/2017/11/3/16602628/kevin-spacey-sexual-assault-allegations-house-of-cards", "text": "After allegations made by more than 30 different individuals against Kevin Spacey, the two-time Oscar winner now faces a felony sexual assault charge.\n\nAs sexual harassment and assault allegations against a number of powerful men continue to ricochet around Hollywood (as well as other industries), one of the most familiar names on the list of men accused of sexual assault is that of Spacey, a decorated Hollywood and Broadway veteran, and the (now former) star of Netflix’s House of Cards.\n\nSince October 2017, when BuzzFeed published allegations made by actor Anthony Rapp that Spacey made a sexual advance toward Rapp when Rapp was 14, more than 30 people have come forward with their own allegations against Spacey, with accounts ranging from harassment to attempted rape. On November 16, 2017, London’s Old Vic Theatre, where Spacey served as artistic director from 2004 to 2015, announced that a hotline it set up to facilitate its investigation into Spacey had received 20 allegations of “a range of inappropriate behavior,” all concerning young men over the age of 18.\n\nThe allegations have brought about a flood of damage control as multiple Hollywood entities seek to distance themselves from the actor. Netflix, Spacey’s agent, his publicist, and the industry at large have all backed away from him — he’s been effectively fired from House of Cards and was completely recast in All the Money in the World, amid plenty of other fallout.\n\nThe revelations of his alleged behavior took a bizarre turn on Christmas Eve 2018, when Spacey released a bizarre video via his official Twitter account and what appeared to be a YouTube fan channel, in which he attempted to address the public. (Some internet onlookers have questioned the possibility that the video is a fake, an example of a creepy computer-generated simulation known as a “deepfake.”) The video, called “Let Me Be Frank,” tacitly presented Spacey as Frank Underwood, his former character from House of Cards. The video appeared just as news broke that Spacey would be arraigned in Nantucket District Court in January 2019 on criminal charges related to the alleged 2016 assault of a then-18-year-old at a bar.\n\nIn the video, Spacey seems to simultaneously be referencing both the allegations made against him and the “death” of his fictional House of Cards character — who was promptly killed off after Netflix first suspended production on the show following the allegations against Spacey, and then promoted Robin Wright to solo lead for the show’s sixth and final season.\n\nIn language that recalls several of the more disturbing allegations of nonconsensual physical assault made against Spacey, the actor seems to tell the audience that he’s making a comeback, regardless of what they say they want:\n\n“We’re not done, no matter what anyone says. And besides, I know what you want. You want me back.”\n\nHere’s what we know so far about the allegations that have surfaced against Spacey, and the consequences that have ensued.\n\nAnthony Rapp accused Spacey of assaulting him when Rapp was 14. Spacey deflected by coming out as gay.\n\nRapp is a veteran Broadway actor best known for originating the role of Mark in Rent; he’s currently playing Star Trek’s first openly gay character on the CBS All Access series Star Trek: Discovery. He told BuzzFeed that Spacey befriended him in 1986, when Rapp was 14 years old and performing in the Broadway play Precious Sons. According to Rapp, Spacey made “a sexual advance” toward him while he was attending a party at Spacey’s home.\n\nAfter his claims went public on October 29, 2017, Rapp stated on Twitter that he was coming forward in solidarity with the dozens of women who’ve made allegations against Harvey Weinstein, as well as other assault survivors, “standing on the shoulders of the many courageous women and men who have been speaking out to shine a light and hopefully make a difference.”\n\nSpacey responded to Rapp’s allegations by issuing a statement on Twitter in which he said he owed Rapp “the sincerest apology for what would have been deeply inappropriate drunken behavior.” Spacey then added, “This story has encouraged me to address other things about my life. I know that there are stories out there about me and that some have been fueled by the fact I have been so protective of my privacy. ... I choose now to live as a gay man. I want to deal with this honestly and openly and that starts with examining my own behavior.”\n\nThe statement marked the first time Spacey had ever officially publicly confirmed his sexuality, which is usually something to celebrate. But many people interpreted his statement and his choice to come out in response to Rapp’s allegations as an attempt to distract from the seriousness of the charge that he had preyed on an underage target. Backlash was swift, as Spacey’s move was widely rejected and criticized, with some observers decrying the way it helped fuel a damaging myth that conflates queer male identity with pedophilia.\n\nAnd in the days that followed, several other accusers came forward to make their own allegations against Spacey, challenging his implication that his behavior was an isolated incident of irresponsible drunkenness.\n\nMore than 30 accusers have come forward against Spacey with allegations that span decades. Here’s a rundown.\n\nSince Rapp came forward, numerous other allegations against Spacey have surfaced. More than a dozen men have made specific claims against the actor. Many of Spacey’s accusers describe witnessing or experiencing behavior from the actor that, like Weinstein, involved using the lure of his success and the opportunity of career mentorship to put himself in a position where he could then prey on young men. Taken together, the allegations suggest a pattern of escalating physical contact, the consistent presence of alcohol, and Spacey making a habit of cornering his victims in order to confront them.\n\nHere are the allegations we know so far.\n\n1983–1984: anonymous 14-year-old boy\n\nAn anonymous man told New York magazine that in 1983, when he was 14 and Spacey was 24, he began a sexual relationship with Spacey that allegedly culminated in Spacey attempting to rape him.\n\nThe anonymous actor stated that his relationship with Spacey lasted about a year, during which time he became aware that “25-year-olds don’t have sex with 14- and 15-year-olds, that that’s wrong, that I was not the guilty party and I could leave.” He told New York that the relationship ended when he was 15, after Spacey allegedly attempted to rape him.\n\n“Mr. Spacey absolutely denies the allegations,” a representative for Spacey told the magazine.\n\n1985: anonymous 17-year-old boy\n\nThe BBC reported on November 1, 2017, that Spacey allegedly approached an anonymous 17-year-old boy in 1985, befriending the teen and then ultimately inviting him to visit his home, where Spacey progressed from being “charming and brotherly” to sexually inappropriate. After rejecting Spacey’s initial advances, the accuser says he woke up to find “Spacey's head on his stomach and his arms wrapped around him.” The anonymous source described Spacey to the BBC as “either very stupid or predatory or ... both,” and noted that Spacey had not been drunk during their encounter.\n\n\"It seems he was grooming me,\" the anonymous source told the BBC.\n\n1986: Kate Edwards\n\nWhen London performing arts teacher Kate Edwards was 17, she worked as a production assistant for the 1986 Broadway revival of Long Day’s Journey Into Night, in which Spacey starred alongside his longtime idol Jack Lemmon. Edwards alleged to the BBC that Spacey, then 27, invited her up to his flat for an apparently nonexistent party, where he kissed her. When it became clear he wanted sex, she made her excuses about wanting to leave, alleging that he then “became cold” and told her to “find [her] own way” home.\n\nEdwards said that Spacey subsequently “cut her dead” after the encounter, telling the BBC that she became depressed and eventually had to quit the show because of how “confused, completely isolated, ashamed” she felt over the incident.\n\n1988: Justin Dawes\n\nA man named Justin Dawes told BuzzFeed that he met a 29-year-old Spacey through a Connecticut theater when he was 16 years old and a junior in high school. Spacey allegedly invited Dawes and a friend to hang out at his apartment, where he served them cocktails and showed gay porn. According to BuzzFeed, even though nothing else happened, “at the time, the 16-year-old felt like he ‘should've realized’ that Spacey wanted him to come over for reasons related to sex.”\n\n“He knew that I was in high school,” Dawes told BuzzFeed. “It was pretty clear.”\n\n1995: Mark Ebenhoch\n\nMark Ebenhoch told BuzzFeed that he had been working as a military adviser on the set of Outbreak, in which Spacey played a supporting role, when one of Spacey’s on-set assistants propositioned him on Spacey’s behalf.\n\n“They asked flat out to engage in a sexual act,” Ebenhoch alleged. “It was enough to stun me. It blew me away.” Ebenhoch told BuzzFeed that he rejected the invitation and avoided Spacey for the duration of the production.\n\n1995: anonymous crew member on the film Albino Alligator\n\nThe BBC reported that while working on the 1995 film Albino Alligator, which marked Spacey’s film debut, the actor allegedly harassed an anonymous crew member who was 22 years old at the time. According to the anonymous crew member, Spacey initially seemed friendly and took an interest in his career, but progressed to “creepy” behavior such as giving him an unwanted massage.\n\n\"On one of the last days of shooting ... he sat down next to me and put his thigh against mine and put his hand on my thigh and moved it towards my inner thigh,” the man alleged. “I felt trapped. I felt harassed, sexually harassed.\"\n\n1995-2015: at least 20 young men, the Old Vic Theatre\n\nSpacey’s involvement with the Old Vic Theatre began in the mid-’90s, when he was involved in several highly acclaimed productions there, spearheaded a successful fundraising campaign to keep the theater from closing, and became one of its most significant donors. He ultimately assumed the position of artistic director for the Old Vic, a role he held from 2004 to 2015.\n\nAfter the allegations against Spacey came to light, the Old Vic set up a confidential email to receive tips and reports about the actor, while claiming in a public statement that it was “deeply dismayed” to hear about the allegations. Meanwhile, multiple allegations concerning Spacey’s behavior while at the Old Vic began to surface.\n\nOn November 1, 2017, Mexican actor Robert Cavazos discussed past encounters at the Old Vic with Spacey in a Facebook post (written in Spanish). Cavazos alleged that Spacey touched him inappropriately numerous times, and said that Spacey would frequently grope men while hanging out at the Old Vic’s bar.\n\n“It appears that all that was needed was a male under the age of 30 for Mr. Spacey to feel free to touch us,” Cavazos wrote. “It was so common that it turned into a local joke (in very bad taste).”\n\nOn November 3, 2017, BuzzFeed reported that an anonymous actor recently contacted the Old Vic to report that Spacey “repeatedly sexually assaulted him in a public place in 2013.” No further detail was reported, but the actor told BuzzFeed that Spacey treated the theater “like a playground.”\n\nOn November 16, 2017, the Old Vic announced that it had received 20 “personal testimonies” through its investigation into Spacey. These claims reportedly ranged “from behaviour that made people feel uncomfortable all the way through to sexually inappropriate behaviour.” The claims spanned 1995 through 2013, with most occurring before 2009. All of the claims involved young men, all of whom were over the age of 18 at the time of the alleged incidents.\n\nThe Associated Press reported that the Old Vic had urged 14 of the 20 respondents to go to the police with their allegations, but couldn’t confirm whether any of them had done so.\n\n2003: director Tony Montana\n\nDirector Tony Montana was the second person to publicly come forward with an allegation against Spacey. On October 31, 2017, he told the gossip website Radar Online that Spacey physically assaulted him in 2003, when Montana was in his 30s. Montana alleges that Spacey approached him in a bar, groped him, and said, “this designates ownership,” as he did so. “I had PTSD for six months after” the incident, Montana said.\n\nDate unspecified: anonymous journalist\n\nAn anonymous journalist gave a detailed account to BuzzFeed of an incident that occurred in London during the early 2000s, when the journalist was in his early 20s. The journalist was assigned to interview Spacey at his office at the Old Vic; after the interview, Spacey allegedly invited the journalist to hang out with him and some friends at a club, where he allegedly groped the journalist “aggressively” despite repeated attempts to get him to stop. When the journalist told Spacey he was in a committed relationship with a woman, it seemed to make no difference; when he tried to leave, Spacey implored him to stay. “He had somehow convinced himself that this was a sexual liaison that we both wanted,” the journalist told BuzzFeed.\n\nFinally, the journalist said, Spacey tried to prevent him from leaving:\n\n[Spacey] was screaming in my face outside of the main bar area, red-faced, spit flying out of his mouth, screaming at me with fury because I didn't want to fuck him. He was actually saying that I did want to and I was a coward. That was his tactic. It was unbelievable.\n\nThe journalist said he reported the incident to his editor, who confirmed as much to BuzzFeed, and the story ultimately ran without a byline. The journalist told BuzzFeed that a major concern that prevented him from going public with the incident was his fear of outing Spacey as gay. “Being closeted has for him enabled him to use this privacy claim as a shield against anybody looking closely at his actual behavior,” he said.\n\n2007: bartender Kris Nixon\n\nAccording to the BBC, Belfast bartender Kris Nixon met Spacey in 2007 while Nixon was working at a cocktail bar in London near the Old Vic. In a videotaped interview, Nixon told the BBC that after attending a party at Spacey’s penthouse, \"Kevin Spacey sat down next to me on a sofa, then reached over and grabbed my penis,\" declaring to Nixon, “I could fuck you better than [Nixon’s girlfriend, who was also in attendance].”\n\nNixon claimed that he left the party immediately but encountered Spacey again two weeks later while he was on shift at the bar where he’d first met Spacey. Nixon alleges that Spacey followed him down to a basement storeroom and cornered him, grabbing him by the waistband and offering to “make it up to [him].”\n\n“I didn’t speak out at the time because I didn’t think anyone would believe me,” Nixon said, adding that he “[didn’t] want to risk getting fired.” Nixon told the BBC that by coming forward, Rapp has made it possible for others to speak out. “Now that it’s become clear that this is a pattern of behavior,” he said, “I feel I have a responsibility to say what happened, so that other people, who maybe don’t yet feel in a position to speak out, feel empowered to do so.”\n\n2007: writer Ari Behn\n\nAri Behn is a Norwegian writer who was married to Princess Märtha Louise when he attended the 14th Annual Nobel Peace Prize Concert in Oslo in December 2007. The concert was hosted by Spacey and Uma Thurman.\n\nAfterward, according to an on-air interview Behn gave to the Norwegian radio network P4 on December 5, 2017, Spacey and Behn attended an afterparty at a nightclub, where they were seated next to each other.\n\n“After five minutes, he says, 'Hey, let's go out and have a cigarette,’” Behn recalled, saying that Spacey then reached “under the table” and groped his genitals.\n\nBehn said he responded with, “Eh, maybe later,” and declined the invitation. He seemed to laugh off the incident.\n\n2008: actor Harry Dreyfuss\n\nIn a piece he wrote for BuzzFeed, actor Harry Dreyfuss alleged that Spacey groped him when he was 18 years old, recalling an incident that took place while he was helping his father, the actor Richard Dreyfuss, rehearse for a play at Spacey’s London apartment.\n\nIn a very detailed account, Dreyfuss describes how Spacey touched him inappropriately throughout the rehearsal, and describes his failed attempts to stop Spacey from fondling him without disrupting the rehearsal or alerting his father. Thinking back to what was going through his head at the time, Dreyfuss writes:\n\nLooking into his eyes, I gave the most meager shake of my head that I could manage. I was trying to warn him without alerting my dad, who still had his eyes glued to the page. I thought I was protecting everyone. I was protecting my dad’s career. I was protecting Kevin, who my dad surely would have tried to punch. I was protecting myself, because I thought one day I’d want to work with this man. Kevin had no reaction and kept his hand there. My eyes went back to the script and I kept reading.\n\n“In retrospect, what disgusts me about Kevin was how safe he did feel,” Dreyfuss concluded. “He knew he could fondle me in a room with my father and that I wouldn’t say a word.”\n\nSpacey denied Dreyfuss’s allegations via his lawyer.\n\n2008: anonymous 23-year-old man\n\nAccording to Variety in 2017, Scotland Yard began an investigation into a claim that a man who is believed to be Spacey assaulted a 23-year-old bartender in London in 2008. “On 1 November, City of London police referred an allegation of sexual assault to the Metropolitan police service,” a Scotland Yard spokesperson said in a press statement released November 3, 2017. “It is alleged a man assaulted another man in 2008 in Lambeth. Officers from the child abuse and sexual offences command are investigating.”\n\nThough Scotland Yard has not named Spacey as the alleged perpetrator, Variety notes that the incident being investigated took place in the South London neighborhood of Lambeth, where Spacey maintains a home. The details, which were first reported by the British tabloid the Sun, allegedly involve the victim approaching Spacey to ask for help with his career, passing out after smoking weed at Spacey’s apartment, and waking up to find Spacey performing oral sex on him. The man, who is now 32, is said to have reported the incident to police in early November 2017, after other allegations against Spacey became public.\n\n2010: Daniel Beal\n\nA British bartender named Daniel Beal told the Sun that Spacey flashed his genitals at him in 2010, while Beal was working at a bar in West Sussex. Beal, then 19, photographed himself at the time wearing an expensive watch, which was allegedly given to him by Spacey shortly after the incident, apparently to buy his silence.\n\n2016: the teenage son of journalist Heather Unruh\n\nHeather Unruh, a former news anchor for the Boston news outlet WVCB, was one of the first people to mention Spacey in the wake of the Weinstein allegations, when her October 13, 2017, tweet that the actor had assaulted a loved one went viral. At a press conference in Boston on November 8, 2017, Unruh provided details of the assault, alleging that Spacey came on to her then-18-year-old son at a restaurant in Nantucket.\n\nAccording to Unruh, Spacey encountered her son at Nantucket’s Club Car Restaurant in July 2016. Spacey “bought [her underage son] drink after drink after drink,” then sexually assaulted him. \"Spacey stuck his hand inside my son's pants and grabbed his genitals,\" Unruh alleged. \"My son's efforts to shift his body to remove Spacey's hand were only momentarily successful. My son panicked, he froze. He was intoxicated.\"\n\nUnruh claims that after Spacey repeatedly pressured her son to attend a party with him, Spacey got up to go to the bathroom, at which point a woman at the bar approached her “very shaken” son and told him to “run.” Her son left, and disclosed the incident to his sister and Unruh later that night.\n\nUnruh stated that her son had filed a police report against Spacey with the Nantucket Police Department. A spokesperson for the Cape and Islands District Attorney’s Office told Boston.com that “an individual has provided information to the Nantucket Police regarding an allegation of an indecent assault and battery” but did not provide further details. On December 24, 2018, news broke that Spacey would face arraignment on a count of sexual assault in Nantucket District Court. The hearing will occur on January 7, 2019.\n\n2012 to 2017: multiple anonymous cast and crew members on the set of Netflix’s House of Cards\n\nOn November 2, 2017, CNN reported that multiple cast and crew members working on the House of Cards set allege that Spacey engaged in harassment and created a toxic environment during the production. A total of eight sources told CNN that Spacey’s behavior was “predatory,” or that he harassed or initiated nonconsensual physical contact with production crew or had targeted young men. One anonymous crew member said Spacey routinely touched him inappropriately throughout the six seasons he worked on set, and that he did not \"feel comfortable\" asking Spacey to stop.\n\nAdditionally, a former House of Cards production assistant who reported Spacey’s behavior to a supervisor told CNN that a supervisor resolved the problem by attempting to make sure Spacey and the assistant were segregated while on set. Months after the implementation of this practice, Spacey allegedly sexually assaulted the production assistant while they were driving in a car together. The crew member did not report the assault.\n\nNetflix and the Old Vic Theatre responded to the allegations against Spacey by distancing themselves from the actor\n\nMany current and former employers and associates of Spacey’s have been quick to denounce the allegations made against the actor, and to attempt to distance themselves from reports of his alleged behavior.\n\nOne day after BuzzFeed published Rapp’s allegations against Spacey, the Hollywood Reporter confirmed that House of Cards would end with its sixth season, noting that “official word on its conclusion, which has been in the works since the summer, comes at a problematic time for Spacey.”\n\nNetflix, along with House of Cards’ production studio Media Rights Capital, later suspended production on the show entirely. “MRC and Netflix have decided to suspend production on House of Cards season six until further notice,” read a joint press statement, “to give us time to review the current situation and to address any concerns of our cast and crew.”\n\nMRC has claimed to have no knowledge of outstanding or unresolved complaints made against Spacey. In a statement to CNN, the company claimed to have handled any incidents brought to its attention:\n\n[D]uring our first year of production in 2012, someone on the crew shared a complaint about a specific remark and gesture made by Kevin Spacey. Immediate action was taken following our review of the situation and we are confident the issue was resolved promptly to the satisfaction of all involved. Mr. Spacey willingly participated in a training process and since that time MRC has not been made aware of any other complaints involving Mr. Spacey.\n\nNetflix told CNN that “Netflix was just made aware of one incident, five years ago, that we were informed was resolved swiftly,” but that it was “not aware of any other incidents involving Kevin Spacey on-set.” Netflix stated it was committed to “maintain[ing] a safe and respectful working environment,” while MRC announced that it had established “an anonymous complaint hotline, crisis counselors, and sexual harassment legal advisors for the crew.”\n\nHowever, since the CNN report, multiple anonymous House of Cards crew members alleged to BuzzFeed that Spacey’s behavior was widely known on set, with many people, including series creator Beau Willimon, knowingly turning a blind eye to a pattern of harassment. One source told BuzzFeed that the production team treated Spacey’s “flirtatious behavior toward crew and cast ... like a joke,” adding, “He touches and feels anyone he wants to.” Willimon has denied all knowledge of Spacey’s behavior, including the on-set incident reported by CNN. The source BuzzFeed spoke with called Willimon’s claim “100% bullshit.”\n\nMeanwhile, since the news concerning Spacey has surfaced, the Old Vic has battled accusations that staff members of the theater knew about the actor’s alleged longstanding pattern of harassment and predatory behavior but did nothing to stop it.\n\nAccording to the Guardian, multiple Old Vic employees witnessed Spacey behaving inappropriately at the theater company during his tenure as artistic director, quoting one anonymous former staffer who said, “We were all involved in keeping it quiet. I witnessed him groping men many times in all sorts of different situations.”\n\nAfter the Old Vic concluded its investigation into Spacey, in which it learned of 20 allegations of inappropriate behavior, its current artistic director, Matthew Warchus, said in a public statement that “These allegations have been a shock and a disturbing surprise to many of us. It is incorrect, unfair and irresponsible to say that everybody knew.”\n\nYet the theater also acknowledged in that statement that multiple staff did witness incidents at the times they occurred, noting, “Staff who observed this behaviour claimed they were unclear about how to respond; in some cases they did not consider allegations of misconduct to be serious and, where they clearly did, they said they did not feel confident that The Old Vic would take those allegations seriously given who he was.”\n\n“What we have learnt is how better to call out this behaviour in future,” Warchus said. “These findings will help not only The Old Vic but our industry as a whole, as together we rapidly evolve an intelligent new standard of protection and support in and around the workplace.”\n\nThe consequences Spacey is facing so far have been wide-ranging and immediate — but so far, he largely stands alone\n\nOn some level, Rapp’s accusation against Spacey served as a litmus test to determine if the cultural shifts heralded by the allegations against Harvey Weinstein and the growth of the #MeToo movement could impact the careers of A-list actors. Spacey did in fact experience a number of striking and swift career setbacks:\n\nSpacey’s representatives said in a brief statement released to the Hollywood Reporter on November 1, 2017, that Spacey “is taking the time necessary to seek evaluation and treatment.” Later that month, he was reportedly spotted at the same elite Arizona treatment center for sex addiction that Harvey Weinstein briefly retreated to after the allegations against him broke.\n\nBut Spacey is far from the only alleged sexual predator in Hollywood, or the only one who’s led a successful career despite his behavior apparently being an open secret. And while some of the most powerful men in the industry — including Weinstein and former CBS head Les Moonves — have seen their careers topple, others remain largely unscathed by allegations against them. And as Spacey’s video indicates, he seems to think he deserves a comeback despite the overwhelming number of people who’ve spoken out against him.\n\nIt’s highly unlikely he’ll get one. But his confidence is a telling statement about an entertainment industry that for so long has allowed powerful men to operate with impunity — one that allowed him to allegedly prey on targets for decades with no repercussions, and that could still harbor many more Kevin Spaceys in its midst.\n\nVox has reached out to Spacey’s representatives for comment but has received no response.\n\nUpdate 12/24/18: Updated to include information about the felony sexual assault charge against Spacey and the video he released.", "images": ["https://cdn.vox-cdn.com/uploads/chorus_image/image/66672267/GettyImages_1210300377.0.jpg", "https://cdn.vox-cdn.com/thumbor/bArDZS4lA4tuDUSyd-QYRb94A-E=/0x0:2338x1224/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9605083/687736578.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66671059/GettyImages_1210050360.0.jpg", "https://cdn.vox-cdn.com/thumbor/HTnb_0RgbR7Kc8NEu0-OCiwmJ50=/0x0:2338x1540/1200x800/filters:focal(909x239:1389x719)/cdn.vox-cdn.com/uploads/chorus_image/image/57461249/687736578.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66563937/GettyImages_1129912168.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66671897/shel_silverstein.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66672372/GettyImages_1210313287.0.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAUEBAAAACwAAAAAAQABAAACAkQBADs", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66672024/1218646346.jpg.0.jpg"], "top_img": "https://cdn.vox-cdn.com/thumbor/bArDZS4lA4tuDUSyd-QYRb94A-E=/0x0:2338x1224/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9605083/687736578.jpg", "keywords": [], "authors": ["Aja Romano", "Riley Beggin", "Zeeshan Aleem", "Matthew Yglesias", "Constance Grady", "Emily Todd Vanderwerff", "Jag Bhalla", "Dec"], "canonical_link": "https://www.vox.com/culture/2017/11/3/16602628/kevin-spacey-sexual-assault-allegations-house-of-cards", "title": "The sexual assault allegations against Kevin Spacey span decades. Here’s what we know.", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Vox", "article": {"publisher": "https://www.facebook.com/Vox", "published_time": "2017-11-03T19:20:02-04:00", "modified_time": "2018-12-24T17:30:14-05:00"}, "author": "Aja Romano", "style-tools": "https://www.vox.com/style/community/441/dd55371d9ef76d5d505f37d268e3aefb/tools.css", "p": {"domain_verify": "d4410485bd6277c2bf2ce0f277819dc6"}, "msvalidate.01": "D385D0326A3AE144205C298DB34B4E94", "ahrefs-site-verification": "1e57a609922037a3fbdc1c22efd7334113f174f15608f37e1b8538a7b4ce64c3", "description": "Multiple men have accused the two-time Oscar winner of sexual harassment and assault. Spacey has since been dropped by his agent and publicist, and Netflix has suspended production on the final season of House of Cards.", "og": {"description": "The two-time Oscar winner now faces felony assault charges.", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/bArDZS4lA4tuDUSyd-QYRb94A-E=/0x0:2338x1224/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9605083/687736578.jpg", "alt": "Build Presents Kevin Spacey Discussing His New Play 'Clarence Darrow' And Hosting The Tony Awards", "height": 630, "width": 1200}, "site_name": "Vox", "title": "The sexual assault allegations against Kevin Spacey span decades. Here’s what we know.", "type": "article", "url": "https://www.vox.com/culture/2017/11/3/16602628/kevin-spacey-sexual-assault-allegations-house-of-cards"}, "fb": {"app_id": 549923288395304}, "twitter": {"card": "summary_large_image", "url": "https://www.vox.com/culture/2017/11/3/16602628/kevin-spacey-sexual-assault-allegations-house-of-cards", "title": "The sexual assault allegations against Kevin Spacey span decades. Here’s what we know.", "description": "The two-time Oscar winner now faces felony assault charges.", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/tmOkVLb803kOt2QyK0gRfCDPgpQ=/0x0:2338x1169/fit-in/1200x600/cdn.vox-cdn.com/uploads/chorus_asset/file/9605083/687736578.jpg", "alt": "Build Presents Kevin Spacey Discussing His New Play 'Clarence Darrow' And Hosting The Tony Awards"}, "site": "voxdotcom"}, "sailthru.title": "The sexual assault allegations against Kevin Spacey span decades. Here’s what we know.", "sailthru.tags": "general,vox,front-page,tv,culture", "sailthru.description": "Multiple men have accused the two-time Oscar winner of sexual harassment and assault. Spacey has since been dropped by his agent and publicist, and Netflix has suspended production on the final season of House of Cards.", "sailthru.date": "2017-11-03T19:20:02-04:00", "sailthru.image.full": "https://cdn.vox-cdn.com/thumbor/YKjmrjNkOpqxqkPH091YPFcfiSQ=/0x0:2338x1315/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/57461247/687736578.0.jpg", "sailthru.image.thumb": "https://cdn.vox-cdn.com/thumbor/bSdZiuXnY0Vv3FwM-ghn_9rkSuk=/379x0:1919x1540/200x200/cdn.vox-cdn.com/uploads/chorus_image/image/57461247/687736578.0.jpg", "msapplication-TileImage": "https://cdn.vox-cdn.com/uploads/hub/sbnu_logo_minimal/441/touch_icon_ipad_retina_1000_yellow.755.png", "msapplication-TileColor": "#4f7177", "outbrainsection": "tv"}, "movies": [], "publish_date": 1509638400.0, "source": "https://www.vox.com", "summary": ""}