{"url": "thekit.ca/life/celebrity-life/selena-gomez-justin-bieber-dating-history-of-jelena/", "text": "The twenty-first century has seen some truly iconic celebrity couples: Brangelina (Brad Pitt and Angelina Jolie), Bennifer (both versions: Ben Affleck and Jennifer Lopez, and Ben Affleck and Jennifer Garner), Kimye (Kanye West and Kim Kardashian West), and, of course: Jelena. Back in the day, Justin Bieber and Selena Gomez were the cutest couple around, and for a while, it really looked like those two crazy kids would really make a go of it.\n\nSadly, we all know how it worked out; seven years of “are they/aren’t they” drama that came to an explosive head last fall. After their widely-publicized Instagram feud, it seemed that the Jelena waters had calmed and everyone was moving on with their lives… until now! We’ve put together an exhaustive history to help you get re-acquainted with the story—and prepare you for its most recent update:\n\nDecember 2010: Justin Bieber and Selena Gomez are spotted out and about together, but their relationship is only a rumour until…\n\n\n\nFebruary 2011: …They make their first red carpet appearance as a couple at the Vanity Fair Oscars party.\n\nNovember 2011: A (bogus) paternity suit involving Biebs and a fan fuels the first breakup rumours.\n\nMay 2012: Selena deletes her Instagram account after posting a photo from a shooting range captioned “releasing some stress today,” which causes some to speculate that Jelena may have split.\n\n\n\nJune 2012: Breakup rumours are put to rest when they arrive to the premiere of Katy Perry: Part of Me together (wearing colour-coordinating outfits, no less).\n\nOctober 2012: Justin posts a photo on Instagram with the caption “Lingse,” which many commenters note is an anagram of ‘single,’ but he deletes it and soon replaces it with a self-portrait captioned “just me” (which, honestly, is foreboding in its own way).\n\nNovember 2012: The pair officially break up after nearly two years together, allegedly due to their conflicting schedules, and Justin begins to be linked to other women: VS model Barbara Palvin, whom he takes a photo with after performing at 2012’s Victoria Secret Fashion Show, and Miranda Kerr (who, at this time, is still married to Orlando Bloom).\n\nDecember 2012: Justin and Selena are caught kissing at an airport in Salt Lake City, but then reportedly break up again after a big fight at an NYE party in Mexico.\n\nJanuary 2013: Selena posts a photo wearing a hat with the logo of Justin’s hometown hockey team (the Stratford Warriors, née Cullitons).\n\nMarch 2013: Selena makes a jab at Justin while on the Late Show with David Letterman, when she says “that makes two of us” in response to Letterman’s admission that he had once made Justin cry on the show.\n\n\n\nApril 2013: Selena reportedly flies to Norway to see Justin, and he posts a quickly-deleted black and white photo of them together where they look very cuddly. The caption is “‘You’ve been makin music for too long babe come cuddle’ –her”.\n\nMay 2013: Selena greets Justin with a kiss on the cheek backstage at the Billboard Music Awards. It’s still unclear if they have officially reconciled.\n\nJuly 2013: They spend the Fourth of July together, but in a subsequent interview Selena claims to be single.\n\n\n\nJanuary 2014: Justin posts a sweet photo of the two of them on Instagram captioned “love the way you look at me.”\n\n\n\nMarch 2014: Selena attends a #WeDay party with a group that includes Orlando Bloom, whose ex-wife, you will remember, was rumoured to have gotten very close to Justin back in 2012.\n\n\n\nApril 2014: Justin and Selena have a fight at Coachella, allegedly due to the fact that Selena found photos of Kylie Jenner on Justin’s phone. Shortly after this, Selena is linked to Orlando after they are photographed sitting on a curb together outside a Chelsea Handler concert.\n\n\n\nMay 2014: Justin is linked romantically to various women, including Kylie, Adriana Lima, and Yovanna Ventura. He also previews a song that is almost definitely about Selena titled “It’s Working” (which, FYI, he never released).\n\n\n\nJune 2014: Justin posts another sappy black and white Instagram of the two of them; this one captioned “our love in unconditional,” and they are soon spotted out together at a host of different locations. Selena stands by him during a scandal about a racist joke Justin made on video.\n\nJuly 2014: More Bloom-Kerr drama (although at this point the two have divorced): Orlando punches Justin in Ibiza (on video!) and Justin posts a sexy photo of Miranda Kerr on Instagram (albeit not one he took himself)\n\n\n\nAugust 2014: As is tradition at this point, Justin posts a photo of him and Selena to signal that they are back on.\n\nSeptember 2014: Justin confirms that Jelena is back during the legal deposition for his DUI, telling the court “we’re dating.”\n\nOctober 2014: The pair is spotted fighting at an airport in France, and Selena tweets about being lonely shortly afterwards. There is speculation that the fight was over talk of getting married (Selena expected him to propose on the trip, which he did not), while others claim secret liaisons with Kendall Jenner are the fuel for this breakup.\n\n\n\nNovember 2014: An era of cryptic (or not so cryptic) subtext begins. Justin posts mushy photos on Instagram to try and win her back, and Selena releases her song “The Heart Wants What It Wants,” which she openly admits is about Justin.\n\nJustin responds to Selena’s emotional AMAs performance of “The Heart Wants What it Wants” with an Instagrammed quote.\n\n\n\nDecember 2014: Justin responds to the rumours that he’s dating Hailey Baldwin with an Instagram that says he’s ‘super single’.\n\nJanuary 2015: Selena begins dating German music producer Zedd, but she and Justin are spotted grabbing dinner together in LA.\n\nSeptember 2015: While promoting her album Revival, Selena is consistently asked about Justin in her interviews. She tells Elle that they are no longer together, but on good terms, and that she doesn’t know if she would ever get back together with him. Justin’s interviews around the same time reflect a similar sentiment; he claims that they got too serious too young, and that was the reason things didn’t work out.\n\nNovember 2015: On The Ellen Degeneres Show, leading up to the release of his new album, Purpose, Justin confirms that three of the songs are about Selena (“What Do You Mean,” “Sorry,” and “Mark My Words”), and admits “I don’t know if I’m over it yet.” Before the month is out, he is spotted serenading Selena with “My Girl” at a bar in Beverly Hills.\n\nFebruary 2016: The two continue to speak about their prior relationship often in interviews, but at this point Selena says she is “exhausted” and that she “can’t do it anymore.”\n\nMay 2016: Orlando Bloom is dating Katy Perry, but he and Selena appear to be canoodling in Vegas. At a concert during her Revival tour, a fan holds up a “Marry Justin Please” sign, which she takes, crumples, and throws on the floor without comment.\n\n\n\nAugust 2016: Justin posts several photos with Sofia Richie, who is rumoured to be his new girlfriend, on Instagram. His fans aren’t pleased, and Justin warns that if they don’t learn to be nicer to Richie he’ll have to make his profile private. From here, things get messy, quick:\n\n\n\nSelena comments on the photo, telling him if he can’t handle the backlash then he shouldn’t post photos of Sofia. She sides with his fans, claiming that “they love you and supported you before anyone ever did.”\n\nSelena follows this up by posting photos of herself with her fans on her own profile.\n\nJustin posts two comments, in which he does not mention Selena by name or Instagram handle.\n\nSelena lashes back with a comment that claims Justin cheated on her: “Funny how the ones that cheated multiple times, are pointing the finger at the ones that were forgiving and supportive, no wonder fans are mad. Sad. All love.”\n\nJustin then insinuates that Selena cheated on HIM, with Zayn Malik: “I cheated… oh I forgot about you and Zayn?”\n\nHailey Baldwin sides with Selena: “misplacing the blame onto someone else isn’t going to get you to the next stage in life,” she says, in a post that is deleted later.\n\nJustin deletes his Instagram to end the feud, and Selena posts a brief apology to Snapchat: “what I said was selfish and pointless.”\n\nAnd that was all, for a while. After Selena opened up about her kidney transplant earlier this year, however, she and Justin appear to have reconnected on friendly terms, and with full knowledge of Selena’s current boyfriend, Abel Tesfaye (The Weeknd):\n\nOctober 24th, 2017: Justin and Selena hang out with some mutual friends at her Studio City house.\n\nOctober 30th, 2017: Justin and Selena spend a full Sunday together, including attending church service together in the morning. Sources close to The Weeknd claim all is fine between the two of them, and that he knows about the two exes hanging out. However, others have noticed that he has unfollowed some of Selena’s closest friends and family: her mother, her assistant, her best friend/kidney transplant donor, and the parents of her godson. Meanwhile, People is reporting that Selena and The Weeknd have split, but we’ll wait for a black-and-white pic posted by Bieber to confirm if her and Selena are officially back on….\n\nNovember 1st, 2017: Alright, it’s official! Jelena is back—the pair were spotted on a cute day date in L.A., sipping iced coffees, walking arm-in-arm, biking around, and proving first love is forever.\n\nFebruary 2018: Gomez and Bieber are apparently taking a break “mainly because of Selena’s mom and her disapproval of Justin,” a source told Us Weekly. “Justin’s family loves Selena, but Selena’s family has put her in a very conflicting spot because they still don’t trust Justin.”", "images": ["https://thekit.ca/wp-content/uploads/2017/10/jelena-inpost-thekit.ca4_.jpg", "https://thekit.ca/wp-content/themes/thekitTheme/images/social-header-youtube.svg", "https://thekit.ca/wp-content/themes/thekitTheme/images/close1.png", "https://thekit.ca/wp-content/themes/thekitTheme/images/social-header-home.svg", "https://thekit.ca/wp-content/uploads/2017/10/jelena-inpost-thekit.ca12.jpg", "https://thekit.ca/wp-content/uploads/2017/03/logo.png", "https://thekit.ca/wp-content/uploads/2017/10/jelena-inpost-thekit.ca3_.jpg", "https://thekit.ca/wp-content/themes/thekitTheme/images/social-header-email.svg", "https://thekit.ca/wp-content/uploads/2018/03/popup-image.jpg", "https://thekit.ca/wp-content/uploads/2017/10/jelena-inpost-thekit.ca6_.jpg", "https://thekit.ca/wp-content/themes/thekitTheme/images/searchicon.svg", "https://sb.scorecardresearch.com/p?c1=2&c2=3005674&cv=2.0&cj=1", "https://thekit.ca/wp-content/uploads/2020/04/2020-luanne-ronquillo-thekit.ca-feature.jpg", "https://thekit.ca/wp-content/themes/thekitTheme/images/social-header-pinterest.svg", "https://thekit.ca/wp-content/uploads/2017/10/jelena-feature-thekit.ca_-491x592.jpg", "https://thekit.ca/wp-content/uploads/2017/10/jelena-inpost-thekit.ca13.jpg", "https://thekit.ca/wp-content/uploads/2017/10/jelena-inpost-thekit.ca182.jpg", "https://thekit.ca/wp-content/uploads/2017/10/jelena-inpost-thekit.ca7_.jpg", "https://thekit.ca/wp-content/uploads/2017/10/jelena-inpost-thekit.ca17.jpg", "https://thekit.ca/wp-content/themes/thekitTheme/images/social-header-twitter.svg", "https://thekit.ca/wp-content/themes/thekitTheme/images/social-header-facebook.svg", "https://thekit.ca/wp-content/uploads/2017/10/jelena-inpost-thekit.ca8_.jpg", "https://thekit.ca/wp-content/uploads/2017/10/jelena-inpost-thekit.ca14.jpg", "https://thekit.ca/wp-content/uploads/2017/10/jelena-feature-thekit.ca_.jpg", "https://thekit.ca/wp-content/uploads/2017/10/jelena-inpost-thekit.ca10.jpg", "https://thekit.ca/wp-content/uploads/2020/04/2020-stephanie-duong-thekit.ca-feature.jpg", "https://thekit.ca/wp-content/uploads/2017/10/jelena-inpost-thekit.ca15.jpg", "https://thekit.ca/wp-content/uploads/2020/04/2020-meghan-beauty-thekit_ca-feature.jpg", "https://thekit.ca/wp-content/uploads/2017/10/jelena-inpost-thekit.ca9_.jpg", "https://thekit.ca/wp-content/uploads/2017/03/Shop-Unit-GIF.gif", "https://www.facebook.com/tr?id=139559820066364&ev=PageView&noscript=1", "https://thekit.ca/wp-content/themes/thekitTheme/images/social-header-instagram.svg", "https://thekit.ca/wp-content/uploads/2017/10/jelena-inpost-thekit.ca11.jpg", "https://thekit.ca/wp-content/uploads/2017/10/jelena-inpost-thekit.ca5_.jpg", "https://thekit.ca/wp-content/uploads/2020/04/thekitca-2020-Spring-Shoes-Feature.jpg", "https://thekit.ca/wp-content/uploads/2017/10/jelena-inpost-thekit.ca18.jpg", "https://thekit.ca/wp-content/uploads/2020/04/2020-jennifer-crawford-thekit.ca-feature-1.jpg", "https://thekit.ca/wp-content/uploads/2017/10/justin-bieber-selena-gomez-relationship-feature-thekit.ca_-699x849.jpg", "https://thekit.ca/wp-content/uploads/2017/10/jelena-inpost-thekit.ca16.jpg"], "top_img": "https://thekit.ca/wp-content/uploads/2017/10/jelena-feature-thekit.ca_.jpg", "keywords": [], "authors": ["Mckenzie Bohn"], "canonical_link": "https://thekit.ca/life/celebrity-life/selena-gomez-justin-bieber-dating-history-of-jelena/", "title": "Selena Gomez-Justin Bieber Dating History: The Many Ups and Downs of Jelena", "meta_data": {"fb": {"pages": 152387688111337, "app_id": 231675370249970}, "viewport": "width=device-width, initial-scale=1", "msapplication-TileColor": "#da532c", "theme-color": "#ffffff", "pocket-site-verification": "74ee78dd4cc206779324b8bb30e528", "description": "Are you ready to ride the Gomez-Justin relationship rollercoaster once again? Time to review Selena Gomez and Justin Bieber's dating history", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Selena Gomez-Justin Bieber Dating History: The Many Ups and Downs of Jelena - The Kit", "description": "Are you ready to ride the Gomez-Justin relationship rollercoaster once again? Time to review Selena Gomez and Justin Bieber's dating history", "url": "https://thekit.ca/life/celebrity-life/selena-gomez-justin-bieber-dating-history-of-jelena/", "site_name": "The Kit", "updated_time": "2018-04-09T17:51:12+00:00", "image": {"identifier": "https://thekit.ca/wp-content/uploads/2017/10/jelena-feature-thekit.ca_.jpg", "secure_url": "https://thekit.ca/wp-content/uploads/2017/10/jelena-feature-thekit.ca_.jpg", "width": 840, "height": 1012}}, "article": {"publisher": "https://www.facebook.com/thekitCA", "section": "Celebrity", "published_time": "2017-10-30T20:26:01+00:00", "modified_time": "2018-04-09T17:51:12+00:00"}, "twitter": {"card": "summary_large_image", "description": "Are you ready to ride the Gomez-Justin relationship rollercoaster once again? Time to review Selena Gomez and Justin Bieber's dating history", "title": "Selena Gomez-Justin Bieber Dating History: The Many Ups and Downs of Jelena - The Kit", "site": "@TheKit", "image": "https://thekit.ca/wp-content/uploads/2017/10/jelena-feature-thekit.ca_.jpg", "creator": "@TheKit"}, "generator": "Powered by WPBakery Page Builder - drag and drop page builder for WordPress.", "wp-parsely_version": "2.0", "parsely-title": "Justin Bieber and Selena Gomez’s Entire Dating History", "parsely-link": "http://thekit.ca/life/celebrity-life/selena-gomez-justin-bieber-dating-history-of-jelena/", "parsely-type": "post", "parsely-image-url": "https://thekit.ca/wp-content/uploads/2017/10/jelena-feature-thekit.ca_-239x287.jpg", "parsely-pub-date": "2017-10-30T20:26:01Z", "parsely-section": "Celebrity", "parsely-author": "McKenzie Bohn", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1509395161.0, "source": "http://thekit.ca", "summary": ""}