{"url": "https://en.wikipedia.org/wiki/American_Horror_Story:_Cult", "text": "American Horror Story: Cult is the seventh season of the FX horror anthology television series American Horror Story, created by Ryan Murphy and Brad Falchuk. It premiered on September 5, 2017, and concluded on November 14, 2017. The subtitle Cult was announced on July 20, 2017. This season takes place in the fictional suburb of Brookfield Heights, Michigan, during the year 2017, and centers on a cult terrorizing the residents in the aftermath of the 2016 U.S. presidential election.\n\nReturning cast members from previous seasons include Sarah Paulson, Evan Peters, Cheyenne Jackson, John Carroll Lynch, Chaz Bono, Adina Porter, James Morosini, Emma Roberts, Mare Winningham, Frances Conroy, and Jamie Brewer, along with new cast members Billie Lourd and Alison Pill. Cult marks the first season to not feature series mainstay actress Lily Rabe.\n\nCult received mostly positive reviews from critics. Paulson, Peters, and Porter, all received Saturn Awards nominations for their performances. Additionally, Paulson and Porter were nominated for Outstanding Lead Actress and Outstanding Supporting Actress in a Limited Series or Movie respectively at the 70th Primetime Emmy Awards while Peters received a nomination for Best Actor in a Movie or Limited Series at the 8th Critics' Choice TV Awards.\n\nCast and characters [ edit ]\n\nMain [ edit ]\n\nSarah Paulson Evan Peters Cheyenne Jackson\n\nBillie Lourd Alison Pill\n\nSpecial guest stars [ edit ]\n\nRecurring [ edit ]\n\nGuest stars [ edit ]\n\nEpisodes [ edit ]\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nOn October 4, 2016, the series was renewed for a seventh cycle, which premiered on September 5, 2017.[12][13][14] Ryan Murphy confirmed that the season will be connected to Freak Show, but will be set in modern day.[15] In February 2017, on Watch What Happens Live, Murphy announced that the season would revolve around the 2016 U.S. election and suggested that it may feature a character based on President Donald Trump.[16] Murphy has said that the season will be representative of both sides of the political divide. He also said that he will be \"illuminating and highlighting\" groups of people he believes to be \"ignored by the current [Trump] administration and who are afraid and feel terrorized that their lives are going to be taken away.\"[17]\n\nIt was later confirmed that the season would be set in the aftermath of the presidential election, with the first episode taking place on election night.[18][19] Murphy explained it will be about \"the fallout of that night, which to many people, from all sides of the camps is a horror story.\"[20] He also revealed the season would not feature Donald Trump or Hillary Clinton, stating \"Horror Story is always about allegory, so the election is allegory.\"[20] In April 2017, Murphy confirmed that archive footage of the election night would be used in the season premiere.[21]\n\nMurphy revealed via Twitter that the details of the seventh season, including the title, would be revealed on July 20.[22] He also teased that the opening sequence of the series would return in this season, following its absence in Roanoke.[23]\n\nOn July 20, 2017, it was announced at the San Diego Comic-Con that the title of the season would be Cult. Murphy also revealed it would be set in Michigan, and confirmed it would consist of a total of 11 episodes, premiering on September 5, 2017. For the first time, the series did not air on Wednesdays but rather on Tuesdays. On August 3, 2017, online posters revealed the names of multiple characters of the season.[24] On August 21, 2017, the opening title sequence of the season was revealed, following its absence in the previous season.[25] That same month, Murphy confirmed that, contrary to the past seasons, Cult would not feature supernatural elements.[26]\n\nCasting [ edit ]\n\nDuring the Winter 2017 TCA Press Tour, series mainstays Sarah Paulson and Evan Peters were reported to be starring as the leads in the season.[15][14] In March 2017, Billy on the Street host Billy Eichner was announced to be cast in the series, playing a role in the life of Paulson's character.[19][27] His character is slated for appearing in \"six or seven\" episodes.[19] The next month, it was reported that Scream Queens actress Billie Lourd will also star in the seventh installment of the series.[18][20] In May 2017, Leslie Grossman, who starred in Murphy's series Popular, joined the cast of the series,[28] and Angela Bassett hinted she may return in a recurring role.[29] Despite this, Bassett didn't appear, but she did direct the episode \"Drink the Kool-Aid\". Later that month, it was confirmed via set pictures that Adina Porter and Cheyenne Jackson were also returning.[30][31] In June 2017, Murphy confirmed via his Instagram account that Colton Haynes, whom Murphy worked with previously on second season of Scream Queens, was joining the casting for the seventh season.[32] Later that month, set pictures revealed that Alison Pill was joining the cast of the season, seemingly portraying the partner of Sarah Paulson's character.[33] In July 2017, Murphy revealed via his Twitter account that Lena Dunham was joining the season.[34] She is set to play Valerie Solanas, author of the SCUM Manifesto and attempted murder of Andy Warhol, via flashbacks.[35] Murphy also confirmed the returns of Frances Conroy and Mare Winningham. Conroy has appeared in all the seasons except Hotel, while Winningham has appeared in Coven, Freak Show, and Hotel.[36] In August 2017, Murphy confirmed the return of Emma Roberts, who appeared in Coven and Freak Show,[37] while Roanoke actors Chaz Bono and James Morosini also confirmed their returns.[38] In the seventh episode, Murder House, Coven, and Freak Show actress Jamie Brewer returned to the show.\n\nOn June 26, 2017, it was confirmed that Lady Gaga would not return for the seventh season due to other projects.[39] Despite rumors, Entertainment Weekly reported on July 7, 2017, that Vera Farmiga, sister of American Horror Story actress Taissa Farmiga, would not appear in the season.[40] Later that month, it was confirmed by The Hollywood Reporter that Kathy Bates will not appear in Cult, after four seasons of regular appearances.[41]\n\nMurphy also revealed via his Instagram account that Freak Show character Twisty the Clown would return in the seventh season, indicating that John Carroll Lynch would reprise his role.[42]\n\nFilming [ edit ]\n\nIn February 2017, it was announced the season would begin principal photography in June 2017.[16] By the next month, filming was moved to May 2017.[19] On May 24, 2017, writer and producer John J. Gray confirmed the show started filming.[43]\n\nEdits [ edit ]\n\nOn October 7, 2017, it was confirmed that the sixth episode of the season would be edited as a direct result of the 2017 Las Vegas shooting that occurred on October 1, 2017. The episode originally featured a scene lasting 2 minutes and 16 seconds where Leslie Grossman's character Meadow Wilton begins to fire at Evan Peters' character, as well as a crowd, during a campaign speech. The episode was edited to de-emphasize the violence and to mostly have it featured completely off-screen[44] - as a result the opening sequence of the episode was cut in half, several on-screen deaths were removed and two separate close-up shots of the handgun firing were removed.[45]\n\nWhile only the edited episode was broadcast on FX, the original uncut episode was released via VOD, FXNOW and FX+.[45]\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nAmerican Horror Story: Cult received mostly positive reviews from critics. The review aggregator Rotten Tomatoes gave the season a 73% approval rating, with an average rating of 7.05/10, based on 49 reviews. The site's consensus reads, \"American Horror Story: Cult intrigues with timely, over-the-top creepiness - and lots of clowns - despite being hampered by broad political generalizations and occasional holes in the narrative's logic.\"[46] On Metacritic, the season was given a score of 66 out of 100 based on 24 reviews, indicating \"generally positive reviews\".[47]\n\nAmerican Horror Story (season 7): Critical reception by episode Season 7 (2017) : Percentage of positive reviews tracked by the website Rotten Tomatoes[48]\n\nAwards and nominations [ edit ]\n\nIn its seventh season, the series has been nominated for 25 awards, 3 of them were won.\n\nRatings [ edit ]\n\nAmerican Horror Story : U.S. viewers per episode (millions) Audience measurement performed by Nielsen Media Research. [62][ citation needed ]\n\n\n\n", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/32px-Blank_television_set.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Evan_Peters_by_Gage_Skidmore_2.jpg/122px-Evan_Peters_by_Gage_Skidmore_2.jpg", "https://en.wikipedia.org/api/rest_v1/page/graph/png/American_Horror_Story%3A_Cult/0/0a6e27a34ca4935b8db085ea448ebff524130483.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/Billie_Lourd_by_Gage_Skidmore.jpg/126px-Billie_Lourd_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/32px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4d/American_Horror_Story_Season_7.jpg/220px-American_Horror_Story_Season_7.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/Vampire_Smiley.png/30px-Vampire_Smiley.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Alison_Pill_at_PaleyFest_2013.jpg/125px-Alison_Pill_at_PaleyFest_2013.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/api/rest_v1/page/graph/png/American_Horror_Story%3A_Cult/0/b063c80c0bb2f4ab6ed0af62b4494c62607bbe73.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Cheyenne_Jackson_2009.jpg/131px-Cheyenne_Jackson_2009.jpg", "https://upload.wikimedia.org/wikipedia/en/4/4d/American_Horror_Story_Season_7.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Sarah_Paulson_by_Gage_Skidmore_2.jpg/126px-Sarah_Paulson_by_Gage_Skidmore_2.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/4/4d/American_Horror_Story_Season_7.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/American_Horror_Story:_Cult", "title": "American Horror Story: Cult", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/4/4d/American_Horror_Story_Season_7.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}