{"url": "https://www.vanityfair.com/hollywood/2018/11/house-of-cards-final-season-review", "text": "It’s not just Claire’s story that spins out of control. Diane Lane and Greg Kinnear play the billionaire Shepherd siblings who are trying to use Claire to their advantage, and end up becoming her primary opponents; a combination of the Koch brothers and Facebook, their corporate holdings manage to mine data, pollute the environment, steal users’ privacy, and uphold traditional family values. But even though the siblings make for a fascinating if grotesque portrait of power, privilege, and traditional family values, they barely have a story; like so much else in this season, the plot arc merely gestures toward relevance. Lane’s character Annette, a friend of Claire’s since girlhood, provides a striking foil for Claire’s ascent. (In one flashback to the dorms at Andover, the two are shown mirroring each other in elaborate cotillion-style curtsies, while sharing a bitten-off joint. It’s a loaded, arresting moment, but it’s just that: a moment.)\n\nThe Shepherds amass all of the not-yet-dead pawns from the last five seasons of House of Cards on their team—journalists working on hit pieces, operatives-turned-data miners, Russian plants in Claire’s administration, Cabinet secretaries and Supreme Court justices that can be bought for the right price. By the end of the season, in what feels like a desperate attempt to tie up loose ends, nearly all of these characters are killed. (The list includes Patricia Clarkson’s character Jane, Boris McGiver’s Tom Hammerschmidt, and Jayne Atkinson’s Cathy Durant, who technically dies twice.) The Shepherds get behind a Supreme Court ruling that would limit Claire’s power, so to outmaneuver them President Hale dives into a heated conflict between ICO, the show’s version of ISIS, and Russian President Viktor Petrov (Lars Mikkelsen), the show’s version of Vladimir Putin. This brings the nation to the brink of nuclear war. And if this were not enough drama, Annette begins to coolly plan the president’s assassination, with a cabal of co-conspirators that includes the vice president (Campbell Scott). Her man for the job? Doug Stamper (Michael Kelly), Frank Underwood’s long-serving jack-of-all-trades.\n\nWhich leads to the final scene of the entire series. A face-off, between Claire and Doug, in the Oval Office. During which Stamper confesses to murdering Frank, somewhat by accident, by tampering with his medication—and then lunges at Claire with Frank’s letter opener. Claire adroitly turns it back on him, and then, as he bleeds, suffocates him. He does not resist. So Stamper dies, in a pool of blood, inches from the presidential seal on the carpet. And Claire—almost 30 weeks pregnant, with an armed nuclear football awaiting her, and political chaos looming—whispers, “No more pain,” and then turns to the camera, with an almost crazed look in her eye.\n\nIt’s a great shot. The camera looks up at Claire, almost as if we are lying next to Doug on the ground. Wright’s blonde bob arcs toward the lens in a sweep. But it’s a mysterious, ambiguous ending for a show that has, until now, specialized in rather blunt storytelling. With Stamper dead, is Claire poised to succeed? Doomed to fail? Confident in her purpose? Haunted by guilt? Is this her last murder, or a harbinger of future carnage? What about everything else—the press secretary who knew too much (Kristen Sieh), the fearmongering journalist (Athena Karkanis), the conniving Speaker of the House (Boris Kodjoe)? What about the data mining that exposed the midterms to fraud, or the nuclear conflict in Syria? What about Claire’s as-yet unnamed daughter, and Annette’s thwarted assassination attempt? What about the story Janine (Constance Zimmer) had worked for so long to report? The story of House of Cards took Macbeth and Machiavelli and unleashed it on the White House; at its end, all it can show the audience is a moment of interpersonal bloodlust.\n\nHouse of Cards has always been a show that works best when in conversation with its political moment; the early years were so striking because their chilly cynicism was juxtaposed against the vivid optimism of President Barack Obama’s administration. In the Trump era, its cynicism seems like piling on to what’s already pernicious. The weekend before the real 2018 midterms, it’s jarring to watch this show, where politicians plot to steal elections and sway Supreme Court justices with horrifying gusto. In this season, the story seems to be simply about power, and the dangers of it—but for a show that so rewarded Frank Underwood’s precise, brutal reign, it feels like a sharp detour.\n\nIn its way, this abrupt conclusion is a staggering commentary on what came before: the stakes of the Underwoods’ House of Cards were global and political, but it could only lead to this kind of intimate, selfish violence. The rest of the story—the world outside the Oval Office—is abandoned midway. It’s as if House of Cards is telling us the rest of the story must be written by us.", "images": ["https://www.vanityfair.com/verso/static/hwd/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg", "https://media.vanityfair.com/photos/5d3d1e975989820008deba1f/1:1/w_90%2Cc_limit/Sonia_Saraiya%252520(1).png", "https://www.vanityfair.com/verso/static/hwd/assets/logo-header.7b6624f3aa336c67441a33a3e19289ee14eaf5c7.svg", "https://media.vanityfair.com/photos/54fefcd81bb97fd46fe01f11/master/w_1600%2Cc_limit/ss09-robin-wright-fashion.jpg", "https://media.vanityfair.com/photos/5bdcb5d6adbbcc502c0039b1/master/w_2560%2Cc_limit/HOC_603_01055r.jpg", "https://media.vanityfair.com/photos/54fefccc9689cbfa72bf3a64/master/w_1600%2Cc_limit/ss01-robin-wright-fashion.jpg", "https://media.vanityfair.com/photos/54fefdaa3d33425a57fc673f/master/w_1600%2Cc_limit/ss08-robin-wright-fashion.jpg", "https://media.vanityfair.com/photos/5bad3754e5ae6a094d0018cd/1:1/w_350%2Ch_350%2Cc_limit/house-of-cards-trailer.jpg", "https://media.vanityfair.com/photos/5bd345e155187a2d9530c8ab/1:1/w_350%2Ch_350%2Cc_limit/HOC_601_Unit_01950rCROP.jpeg", "https://media.vanityfair.com/photos/5bafaa962b57202d9836fe12/1:1/w_350%2Ch_350%2Cc_limit/kevin-spacey-misconduct.jpg", "https://media.vanityfair.com/photos/5bdcb5d6adbbcc502c0039b1/16:9/w_1280,c_limit/HOC_603_01055r.jpg"], "top_img": "https://media.vanityfair.com/photos/5bdcb5d6adbbcc502c0039b1/16:9/w_1280,c_limit/HOC_603_01055r.jpg", "keywords": [], "authors": ["Sonia Saraiya", "Sonia Saraiy", "Joy Pres", "Yohana Dest", "Hilary Weave"], "canonical_link": "https://www.vanityfair.com/hollywood/2018/11/house-of-cards-final-season-review", "title": "Review: House of Cards Collapses, Finally", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Sonia Saraiya", "copyright": "Copyright (c) Condé Nast 2020", "description": "Down a star and out of things to say, Season 6 flounders.", "id": "5bdcb58a7d738b4e26033e43", "keywords": "hollywood,television,kevin spacey,netflix,robin wright,house of cards", "news_keywords": "hollywood,television,kevin spacey,netflix,robin wright,house of cards", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5bdcb58a7d738b4e26033e43", "parsely-metadata": "{\"description\":\"Down a star and out of things to say, Season 6 flounders.\",\"image-16-9\":\"https://media.vanityfair.com/photos/5bdcb5d6adbbcc502c0039b1/16:9/w_1000,c_limit/HOC_603_01055r.jpg\",\"image-1-1\":\"https://media.vanityfair.com/photos/5bdcb5d6adbbcc502c0039b1/1:1/w_1000,c_limit/HOC_603_01055r.jpg\"}", "og": {"description": "Down a star and out of things to say, Season 6 flounders.", "image": "https://media.vanityfair.com/photos/5bdcb5d6adbbcc502c0039b1/16:9/w_1280,c_limit/HOC_603_01055r.jpg", "site_name": "Vanity Fair", "title": "Review: House of Cards Collapses, Finally", "type": "article", "url": "https://www.vanityfair.com/hollywood/2018/11/house-of-cards-final-season-review"}, "article": {"content_tier": "metered", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@VanityFair", "description": "Down a star and out of things to say, Season 6 flounders.", "domain": "https://www.vanityfair.com", "image": {"src": "https://media.vanityfair.com/photos/5bdcb5d6adbbcc502c0039b1/16:9/w_1280,c_limit/HOC_603_01055r.jpg?mbid=social_retweet"}, "site": "@VanityFair", "title": "Review: House of Cards Collapses, Finally"}, "fb": {"app_id": 305927716147259, "pages": 8810407571}, "google-signin-client_id": "1065629119444-svrqo31taikd2j0ji4dgjs9q3vul4133.apps.googleusercontent.com"}, "movies": [], "publish_date": null, "source": "https://www.vanityfair.com", "summary": ""}