{"url": "https://variety.com/2017/film/people-news/jerry-lewis-dies-dead-nutty-professor-1202533899/", "text": "Jerry Lewis, the brash slapstick comic who became a pop culture sensation in his partnership with Dean Martin and then transformed himself into an auteur filmmaker of such comedic classics as “The Nutty Professor” and “The Bellboy,” has died in Las Vegas. He was 91.\n\nLewis died at his home in Las Vegas at about 9:15 a.m. Sunday morning, his agent confirmed.\n\nFor most of his career, Lewis was a complicated and sometimes polarizing figure. An undeniable comedic genius, he pursued a singular vision and commanded a rare amount of creative control over his work with Paramount Pictures and other studios. His legacy also includes more than $2.5 billion raised for the Muscular Dystrophy Association through the annual Labor Day telethon that he made an end-of-summer ritual for decades until he was relieved of the hosting job in 2011.\n\nBut Lewis’ brand of humor did not always wear well as times and attitudes changed. Over the last 10 years of his life, his reputation soured slightly as he was forced to apologize for making a gay slur on camera during the 2007 telethon, continued to make racist and misogynistic jokes, and didn’t hesitate to share his right-wing political views.\n\nIn addition to his most famous films, Lewis also appeared in a number of notable works, such as Martin Scorsese’s “The King of Comedy,” but was largely offscreen from the late ’60s on and was more active with his telethon and philanthropic efforts. As late as 2016, Lewis continued to perform in Las Vegas, where he first debuted his comedy routine back in 1949.\n\nThe high regard in which his comic abilities were held in France — he received the Legion of Honor award in 1983 — became a running joke in the U.S. long after Lewis’ style of broad physical comedy fell out of fashion. His final film, “Max Rose,” screened at France’s Cannes Film Festival in 2013.\n\nThe telethon, like other aspects of Lewis’ life, was beset by controversy. The comic’s offstage persona was anything but humorous. He was, by his own admission, an impatient man, and over the years battled numerous illnesses and a prescription drug dependency. His parting with Martin in 1956 after 10 years as a duo was acrimonious. And the telethons were awash in claims that there was a disparity between the money pledged and the money collected.\n\nLewis’ pairing with Martin, featuring their improvisatory backbiting and physical chicanery, was an instant hit in 1946. When producer Hal Wallis saw them performing at the Copacabana and at Slapsie Maxie’s in Hollywood, he saw the potential for a new Bob Hope and Bing Crosby and signed them to a Paramount Pictures contract.\n\nFor the next 10 years, Martin and Lewis turned out one silly film after the next starting with “My Friend Irma” in 1949 and including “The Caddy,” “The Stooge,” “Artists and Models” and “Pardners.” None of their films grossed less than $5 million, a handy sum in those days.\n\nThe premises of the films grew tired, and the more Martin and Lewis worked together, the more disparate they appeared. In 1956, after their film “Hollywood or Bust,” they made their last dual appearance at the Copacabana.\n\nBy the time of their breakup, Martin had a prosperous career as a recording artist and actor. And soon Lewis, too, was a hot solo ticket.\n\nShortly after they broke up, Lewis filled in for an ailing Judy Garland in Las Vegas. Over the next five years Lewis developed a slicker, more sophisticated stage persona and would continue to play Vegas until 2016.\n\nOnscreen he made a go of it in such films as “The Delicate Delinquent” and “Rock-a-Bye Baby.” Lewis even had a million-selling single in the “Rock-a-Bye Your Baby” title track, which led to several albums on Decca Records.\n\nHe then extended his efforts into writing, producing and directing films, signing what was then a mammoth $10 million deal with Paramount. The first two, 1961’s “The Ladies Man” and 1962’s “The Errand Boy,” showed him at his best. His talents also dovetailed with director Frank Tashlin’s style in films such as “Cinderfella” and “The Disorderly Orderly.”\n\n“The Nutty Professor” (1963) was his biggest success ever, grossing $19 million. But by then his mugging and exaggerated body gyrations had become out of control, as had the syrupy moments in his films.\n\nLewis signed a nonexclusive deal with Columbia that resulted in several uninspired films such as “Three on a Couch,” “The Big Mouth” and “Don’t Raise the Bridge, Lower the River.” Even Lewis had to admit, “Jerry Lewis is never just OK or adequate; he’s either very funny or he’s awful.”\n\nWhile Americans largely dismissed him, Lewis had developed a following at French film journals Cahiers du Cinema and Positif.\n\nHe was born Joseph Levitch in Newark, N.J. Both his parents were in show business and, at the age of 5, Lewis made his debut at a Borscht Belt hotel singing “Brother Can You Spare a Dime?”\n\nPerhaps because his parents spent a great deal of time on the road, Lewis was demanding attention through humor by the time he was attending Irvington High School in New Jersey. By age 15 he was pantomiming operatic and popular songs and was booked into a burlesque house in Buffalo.\n\nIn 1942 he tried out his comic pantomiming at Brown’s Hotel in upstate New York, where he was also working the summer as a bellboy. Comic Irving Kaye was sufficiently impressed to land Lewis some bookings and became his road manager.\n\nLewis met the young singer Dean Martin at New York nightclub the Glass Hatt and was first paired with him in 1946. Afters years of rupture, Martin made a surprise appearance on the Muscular Dystrophy Telethon in 1976, a reunion orchestrated by their mutual friend Frank Sinatra. The pair also reconciled after the death of Martin’s son in the late 1980s. Martin died in 1995.\n\nIn the early ’70s he continued to direct uninspired fare such as “Which Way to the Front?” and then tried a serious film, “The Day the Clown Cried,” though he famously shelved the completed work (some footage of it finally surfaced in 2013). He attempted a live TV variety show that failed, as did an attempt at a Broadway musical, “Feeling No Pain”; it was followed by the acrimonious “Hellzapoppin,” which was ditched out of town in Boston at a loss of $1.25 million.\n\nIn 1972 he lent his name to a string of 200 movie theaters for Network Cinema Corp., which led to bankruptcy proceedings in 1974. His heavy schedule also brought him to the verge of a nervous breakdown, serious ulcer problems and painkiller drug dependency. In 1982 he had double-bypass heart surgery and gave up his four pack-a-day smoking habit.\n\nLewis was offscreen until 1979’s low-budget “Hardly Working,” which he also directed; it did not reverse his fortunes. But in 1982, director Martin Scorsese harnessed the brash, cynical side of Lewis’ persona for the role of a kidnapped latenight talkshow host in “The King of Comedy.” Though he reportedly resented being upstaged by Robert De Niro and Sandra Bernhard, the film represented some of Lewis’ finest work. Another high point was a similarly caustic appearance as a lethal underworld figure on the TV series “Wiseguy.”\n\nMost of his later film work, however, failed to impress, such as “Slapstick of Another Kind,” “Cookie” and 1992’s “American Dreamer.”\n\nIn 1995, he appeared in Peter Chelsom’s film “Funny Bones” and took over the role of the devil in a Broadway revival of “Damn Yankees,” which he took on tour in the U.S.; he then appeared in a London production of the musical.\n\nIn 2003 he provided a guest voice on an episode of “The Simpsons”; in 2006 he did an episode of “Law and Order: SVU” in which he played the insane, morally befuddled but bizarrely benevolent uncle of Det. John Munch (Richard Belzer).\n\nLewis long sought to create a sequel to “The Nutty Professor”; eventually, Imagine Entertainment produced and Universal released the 1996 remake starring Eddie Murphy on which Lewis was credited for the screenplay to the 1963 version and as an executive producer.\n\nLewis also hoped to bring a musical adaptation of “The Nutty Professor” to Broadway. By summer 2012 an ailing but still enthusiastic Lewis made his stage helming debut with such a musical, with a score by Marvin Hamlisch and a book and lyrics by Rupert Holmes, in Nashville, where it played for seven weeks.\n\nIn 2013 Lewis starred in the long-gestating project “Max Rose,” written and directed by Daniel Noah and also starring Claire Bloom, Kevin Pollak, Kerry Bishe and Mort Sahl. Lewis played a jazz pianist who recently became a widower.\n\nIn 2009, Lewis received the Academy of Motion Pictures Arts & Sciences’ Jean Hersholt Award for his charitable work. In May 2014, he added his footprints to those of other screen luminaries at the Chinese Theatre.\n\nIn 1944 Lewis married former band singer Patti Palmer, with whom he had six sons, Gary, Ronnie, Scott, Anthony, Christopher and Joseph, who died in 2009. Gary for a time had a rock career as the lead singer of Gary Lewis & the Playboys. The marriage ended in divorce.\n\nHe is survived by his second wife, SanDee Pitnick, with whom he adopted a daughter.", "images": ["https://pixel.wp.com/b.gif?v=noscript", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2017%2Ffilm%2Fpeople-news%2Fjerry-lewis-dies-dead-nutty-professor-1202533899%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202533899&comment_count=255", "https://pmcvariety.files.wordpress.com/2014/06/jerry-lewis-dead.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2014/06/jerry-lewis-dead.jpg?w=1024", "keywords": [], "authors": ["Richard Natale Carmel Dagan", "Richard Natale", "Carmel Dagan"], "canonical_link": "https://variety.com/2017/film/people-news/jerry-lewis-dies-dead-nutty-professor-1202533899/", "title": "Jerry Lewis, Comedy Legend, Dies at 91", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Jerry Lewis, the brash slapstick comic who teamed with Dean Martin and later starred in “The Nutty Professor,” has died in Las Vegas.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202533899, "author": "Richard Natale,Carmel Dagan", "pmc-category": "News,Obituaries,People News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-08-20T10:50:11"}, "pmc-tag": "Jerry Lewis", "title": "Jerry Lewis, Comedy Legend, Dies at 91", "pageclass": "article", "pmc-vertical": "film,tv", "pmc-primary-category": "News", "pmc-primary-vertical": "film", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "Jerry Lewis, Comedy Legend, Dies at 91", "url": "https://variety.com/2017/film/people-news/jerry-lewis-dies-dead-nutty-professor-1202533899/", "description": "Jerry Lewis, the brash slapstick comic who became a pop culture sensation in his partnership with Dean Martin and then transformed himself into an auteur filmmaker of such comedic classics as “The …", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2014/06/jerry-lewis-dead.jpg?w=1024", "width": 1024, "height": 576, "alt": "Jerry Lewis"}, "locale": "en_US"}, "article": {"published_time": "2017-08-20T17:50:11+00:00", "modified_time": "2017-08-21T18:40:14+00:00"}, "twitter": {"creator": "@Variety", "site": "@variety", "text": {"title": "Jerry Lewis, Comedy Legend, Dies at 91"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2014/06/jerry-lewis-dead.jpg?w=1024", "alt": "Jerry Lewis"}, "card": "summary_large_image", "title": "Jerry Lewis, Comedy Legend, Dies at 91", "description": "Jerry Lewis, the brash slapstick comic who teamed with Dean Martin and later starred in “The Nutty Professor,” has died in Las Vegas."}, "author": "Carmel Dagan", "content_type": "Article", "post_id": 1202533899, "title": "Jerry Lewis, Comedy Legend, Dies at 91", "published_at": "2017-08-20 10:50:11", "image": "https://pmcvariety.files.wordpress.com/2014/06/jerry-lewis-dead.jpg?w=1024", "comment_count": 255, "tags": "Jerry Lewis", "topics": "People News", "appeared_in_print": "No", "body": "Jerry Lewis, the brash slapstick comic who became a pop culture sensation in his partnership with Dean Martin and then transformed himself into an auteur filmmaker of such comedic classics as “The Nutty Professor” and \"The Bellboy,\" has died in Las Vegas. He was 91.\r\n\r\nLewis died at his home in Las Vegas at about 9:15 a.m. Sunday morning, his agent confirmed.\r\n\r\nFor most of his career, Lewis was a complicated and sometimes polarizing figure. An undeniable comedic genius, he pursued a singular vision and commanded a rare amount of creative control over his work with Paramount Pictures and other studios. His legacy also includes more than $2.5 billion raised for the Muscular Dystrophy Association through the annual Labor Day telethon that he made an end-of-summer ritual for decades until he was relieved of the hosting job in 2011.\r\n\r\nBut Lewis' brand of humor did not always wear well as times and attitudes changed. Over the last 10 years of his life, his reputation soured slightly as he was forced to apologize for making a gay slur on camera during the 2007 telethon, continued to make racist and misogynistic jokes, and didn't hesitate to share his right-wing political views.\r\n\r\n\r\n\r\nIn addition to his most famous films, Lewis also appeared in a number of notable works, such as Martin Scorsese’s “The King of Comedy,” but was largely offscreen from the late ’60s on and was more active with his telethon and philanthropic efforts. As late as 2016, Lewis continued to perform in Las Vegas, where he first debuted his comedy routine back in 1949.\r\n\r\nThe high regard in which his comic abilities were held in France — he received the Legion of Honor award in 1983 — became a running joke in the U.S. long after Lewis’ style of broad physical comedy fell out of fashion. His final film, \"Max Rose,\" screened at France's Cannes Film Festival in 2013.\r\n\r\nThe telethon, like other aspects of Lewis’ life, was beset by controversy. The comic’s offstage persona was anything but humorous. He was, by his own admission, an impatient man, and over the years battled numerous illnesses and a prescription drug dependency. His parting with Martin in 1956 after 10 years as a duo was acrimonious. And the telethons were awash in claims that there was a disparity between the money pledged and the money collected.\r\n\r\nLewis’ pairing with Martin, featuring their improvisatory backbiting and physical chicanery, was an instant hit in 1946. When producer Hal Wallis saw them performing at the Copacabana and at Slapsie Maxie’s in Hollywood, he saw the potential for a new Bob Hope and Bing Crosby and signed them to a Paramount Pictures contract.\r\n\r\nFor the next 10 years, Martin and Lewis turned out one silly film after the next starting with “My Friend Irma” in 1949 and including “The Caddy,” “The Stooge,” “Artists and Models” and “Pardners.” None of their films grossed less than $5 million, a handy sum in those days.\r\n\r\nThe premises of the films grew tired, and the more Martin and Lewis worked together, the more disparate they appeared. In 1956, after their film “Hollywood or Bust,” they made their last dual appearance at the Copacabana.\r\n\r\n\r\n\r\nBy the time of their breakup, Martin had a prosperous career as a recording artist and actor. And soon Lewis, too, was a hot solo ticket.\r\n\r\nShortly after they broke up, Lewis filled in for an ailing Judy Garland in Las Vegas. Over the next five years Lewis developed a slicker, more sophisticated stage persona and would continue to play Vegas until 2016.\r\n\r\nOnscreen he made a go of it in such films as “The Delicate Delinquent” and “Rock-a-Bye Baby.” Lewis even had a million-selling single in the “Rock-a-Bye Your Baby” title track, which led to several albums on Decca Records.\r\n\r\nHe then extended his efforts into writing, producing and directing films, signing what was then a mammoth $10 million deal with Paramount. The first two, 1961’s “The Ladies Man” and 1962’s “The Errand Boy,” showed him at his best. His talents also dovetailed with director Frank Tashlin’s style in films such as “Cinderfella” and “The Disorderly Orderly.”\r\n\r\n“The Nutty Professor” (1963) was his biggest success ever, grossing $19 million. But by then his mugging and exaggerated body gyrations had become out of control, as had the syrupy moments in his films.\r\n\r\nLewis signed a nonexclusive deal with Columbia that resulted in several uninspired films such as “Three on a Couch,” “The Big Mouth” and “Don’t Raise the Bridge, Lower the River.” Even Lewis had to admit, “Jerry Lewis is never just OK or adequate; he’s either very funny or he’s awful.”\r\n\r\nWhile Americans largely dismissed him, Lewis had developed a following at French film journals Cahiers du Cinema and Positif.\r\n\r\nHe was born Joseph Levitch in Newark, N.J. Both his parents were in show business and, at the age of 5, Lewis made his debut at a Borscht Belt hotel singing “Brother Can You Spare a Dime?”\r\n\r\nPerhaps because his parents spent a great deal of time on the road, Lewis was demanding attention through humor by the time he was attending Irvington High School in New Jersey. By age 15 he was pantomiming operatic and popular songs and was booked into a burlesque house in Buffalo.\r\n\r\n\r\n\r\nIn 1942 he tried out his comic pantomiming at Brown’s Hotel in upstate New York, where he was also working the summer as a bellboy. Comic Irving Kaye was sufficiently impressed to land Lewis some bookings and became his road manager.\r\n\r\nLewis met the young singer Dean Martin at New York nightclub the Glass Hatt and was first paired with him in 1946. Afters years of rupture, Martin made a surprise appearance on the Muscular Dystrophy Telethon in 1976, a reunion orchestrated by their mutual friend Frank Sinatra. The pair also reconciled after the death of Martin’s son in the late 1980s. Martin died in 1995.\r\n\r\nIn the early ’70s he continued to direct uninspired fare such as “Which Way to the Front?” and then tried a serious film, “The Day the Clown Cried,” though he famously shelved the completed work (some footage of it finally surfaced in 2013). He attempted a live TV variety show that failed, as did an attempt at a Broadway musical, “Feeling No Pain”; it was followed by the acrimonious “Hellzapoppin,” which was ditched out of town in Boston at a loss of $1.25 million.\r\n\r\nIn 1972 he lent his name to a string of 200 movie theaters for Network Cinema Corp., which led to bankruptcy proceedings in 1974. His heavy schedule also brought him to the verge of a nervous breakdown, serious ulcer problems and painkiller drug dependency. In 1982 he had double-bypass heart surgery and gave up his four pack-a-day smoking habit.\r\n\r\nLewis was offscreen until 1979’s low-budget “Hardly Working,” which he also directed; it did not reverse his fortunes. But in 1982, director Martin Scorsese harnessed the brash, cynical side of Lewis’ persona for the role of a kidnapped latenight talkshow host in “The King of Comedy.” Though he reportedly resented being upstaged by Robert De Niro and Sandra Bernhard, the film represented some of Lewis’ finest work. Another high point was a similarly caustic appearance as a lethal underworld figure on the TV series “Wiseguy.”\r\n\r\nMost of his later film work, however, failed to impress, such as “Slapstick of Another Kind,” “Cookie” and 1992’s “American Dreamer.”\r\n\r\nIn 1995, he appeared in Peter Chelsom’s film “Funny Bones” and took over the role of the devil in a Broadway revival of “Damn Yankees,” which he took on tour in the U.S.; he then appeared in a London production of the musical.\r\n\r\n\r\n\r\nIn 2003 he provided a guest voice on an episode of “The Simpsons”; in 2006 he did an episode of “Law and Order: SVU” in which he played the insane, morally befuddled but bizarrely benevolent uncle of Det. John Munch (Richard Belzer).\r\n\r\nLewis long sought to create a sequel to “The Nutty Professor”; eventually, Imagine Entertainment produced and Universal released the 1996 remake starring Eddie Murphy on which Lewis was credited for the screenplay to the 1963 version and as an executive producer.\r\n\r\nLewis also hoped to bring a musical adaptation of “The Nutty Professor” to Broadway. By summer 2012 an ailing but still enthusiastic Lewis made his stage helming debut with such a musical, with a score by Marvin Hamlisch and a book and lyrics by Rupert Holmes, in Nashville, where it played for seven weeks.\r\n\r\nIn 2013 Lewis starred in the long-gestating project “Max Rose,” written and directed by Daniel Noah and also starring Claire Bloom, Kevin Pollak, Kerry Bishe and Mort Sahl. Lewis played a jazz pianist who recently became a widower.\r\n\r\nIn 2009, Lewis received the Academy of Motion Pictures Arts & Sciences’ Jean Hersholt Award for his charitable work. In May 2014, he added his footprints to those of other screen luminaries at the Chinese Theatre.\r\n\r\nIn 1944 Lewis married former band singer Patti Palmer, with whom he had six sons, Gary, Ronnie, Scott, Anthony, Christopher and Joseph, who died in 2009. Gary for a time had a rock career as the lead singer of Gary Lewis & the Playboys. The marriage ended in divorce.\r\n\r\nHe is survived by his second wife, SanDee Pitnick, with whom he adopted a daughter.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1503251411.0, "source": "https://variety.com", "summary": ""}