{"url": "www.cheatsheet.com/health-fitness/meghan-markles-bucket-list-reveals-royals-surprising-to-dos.html/", "text": "Meghan Markle is the most relatable royal we’ve had in the U.S., well, ever. While we can’t all be household names, actresses, and committed philanthropists, Markle still has a down-to-earth side that makes her marriage to Prince Harry feel just a bit like a fairytale.\n\nIt’s safe to assume that everyone, royalty or not, has a bucket list (we’d kill to see Queen Elizabeth II’s) and Markle is no different. We’ve found a few of Markle’s future plans from her now-extinct blog’s archives, as well as one bucket list item she’s admitted to which has us eager for what’s to come from Markle and Prince Harry (page 5).\n\nHer old blog gave us some insight\n\nMeghan used to run a blog called The Tig. | Tasos Katopodis/Getty Images Meghan used to run a blog called The Tig. | Tasos Katopodis/Getty Images\n\nUnbeknownst to many, Markle used to run the now-defunct lifestyle blog The Tig. Markle dedicated the blog to travel and food content and referred to it as a “hub for all things I find exciting.” While The Tig is no more, a few blog posts still exist and offer an exclusive look into Markle’s personality, her ambitions, and what she wants to accomplish in the future (page 4).\n\nShe turned her New Year’s resolutions into a lifestyle\n\nMarkle is very down-to-earth. | Andrew Cowie/AFP/Getty Images Markle is very down-to-earth. | Andrew Cowie/AFP/Getty Images\n\nWhile we didn’t gain access to Markle’s 2018 New Year’s resolutions, she wrote a blog post in 2016 about resolutions which shared some valuable intel on the future royal. You can apply them any year, at any time, as Markle intended. The resolutions she listed (we’ll go over those next) coincide with her future goals as a member of the royal family.\n\nMarkle’s bucket list, of sorts, is relatable and, unsurprisingly, as down-to-earth as the former actress and philanthropist appears. The following former resolutions and future hopes are unlike any another future royal family member has publicly made and may surprise you.\n\nShe’s working on her language\n\nMarkle has been wanting to brush up on her French. | Chris Jackson/Getty Images Markle has been wanting to brush up on her French. | Chris Jackson/Getty Images\n\nWhile Markle made it a goal to need the disclaimer ‘Pardon my French’ less frequently, she also wanted to become fluent in the language. “Run a marathon. Stop biting my nails. Stop swearing. Re-learn French,” Markle wrote, claiming that these resolutions made her list every single year.\n\nThe blog post marks the year she resolved to not have a resolution, reminding herself and readers that if it takes a couple years (rather than just one) to become fluent in French or stop swearing — that’s OK. “I often find myself wallowing in disappointment when I set a goal I can’t achieve … And at 34 years old, I’m over that.”\n\nHer conclusion? Leave room for the magic\n\nMarkle was looking for the magic. | Oli Scarff/AFP/Getty Images Markle was looking for the magic. | Oli Scarff/AFP/Getty Images\n\nThe year of the post in question — 2016 — also marks the year that Markle began dating Prince Harry. So, it’s only appropriate that the only thing she aimed to do in the new year was “… to approach life playfully. To laugh and enjoy, to keep my standards high but my level of self-acceptance higher.”\n\nMarkle also took the advice of her Suits castmate and friend, Gina Torres, who told her, “Meg … Make sure you leave room for magic.” Markle took it upon herself to follow this advice, encouraging herself and those reading to set goals while remaining open to change and, of course, magic.\n\nShe wants kids\n\nKids are in their future. | Chris Jackson/Getty Images Kids are in their future. | Chris Jackson/Getty Images\n\nIn 2016, Best Health Canada interviewed Markle about a few of her bucket list items for the future. While she listed growing The Tig and continuing acting (both of which Markle has ceased, at least for now, as she embarks on her royal journey), the one item that caught our eye wasn’t career-oriented. “Other bucket list items: I want to travel more and I can’t wait to start a family, but in due time,” Markle said.\n\nHarry seemed to be in agreement while talking to BBC’s Mishal Husain in the couple’s first joint interview. “Not yet no,” he said about having children, “But I think eventually, one step at a time, and we’ll start a family in the near future.”\n\nShe has checked off meeting the royal family\n\nMarkle feels right at home with the royal family. | Adrian Dennis/AFP/Getty Images Markle feels right at home with the royal family. | Adrian Dennis/AFP/Getty Images\n\nAnd with flying colors at that. Markle, who had met Queen Elizabeth II “a couple of times” prior to the engagement, found the Queen to be “an incredible woman.” Markle also became the first royal fiancee to spend the holiday with the queen before marrying into the royal family.\n\nBoth Markle and Prince Harry have made clear how important family is to them. “His family has been so welcoming,” Markle said of the royal family, “… it’s been really important to me too … The family has been great and in the past year and a half, they’ve made me feel a part of, not just the institution, but of a part of the family [sic].”\n\nAs well as living out her dreams\n\nMarkle is free to live out her dreams. | Daniel Leal-Olivas/AFP/Getty Images Markle is free to live out her dreams. | Daniel Leal-Olivas/AFP/Getty Images\n\nMarkle announced her departure from Suits along with her engagement to Prince Harry and plans to focus on her philanthropic efforts in the future. In their first joint interview, Markle discussed her “transition” out of her career as “exciting,” noting that she plans to focus more energy on the causes that have been important to her.\n\n“You realize that as you have access or a voice that people are willing to listen to, [it comes with] a lot of responsibility, which I take seriously,” she said. Markle has prepared for her new chapter and is excited to work “as a team” with her husband… something the rest of the U.S. and the U.K. alike are excited to see pan out.\n\nFollow The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2017/11/GettyImages-880238024-640x475.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/12/GettyImages-883515276-1-640x426.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/04/MeghanMarkle-1-640x320.jpg", "https://www.cheatsheet.com/wp-content/uploads/2017/11/GettyImages-880230268-640x442.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/04/MeghanMarkle-1-640x320.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/12/GettyImages-898523210-640x446.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Meghan-Markle-and-Prince-Harry-640x461.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/09/Meghan-Markle-640x427.jpg?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "http://www.bizographics.com/collect/?pid=4708&fmt=gif", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2017/04/MeghanMarkle-1-640x320.jpg", "keywords": [], "authors": ["Emma Bleznak"], "canonical_link": "https://www.cheatsheet.com/health-fitness/meghan-markles-bucket-list-reveals-royals-surprising-to-dos.html/", "title": "Meghan Markle’s Bucket List Reveals the Royal’s Surprising To-Dos", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/health-fitness/meghan-markles-bucket-list-reveals-royals-surprising-to-dos.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "The royal's old blog reveals some of her future plans and what she hopes to accomplish.", "og": {"locale": "en_US", "type": "article", "title": "Meghan Markle's Bucket List Reveals the Royal's Surprising To-Dos", "description": "The royal's old blog reveals some of her future plans and what she hopes to accomplish.", "url": "https://www.cheatsheet.com/health-fitness/meghan-markles-bucket-list-reveals-royals-surprising-to-dos.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-05-21T22:53:04-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2017/04/MeghanMarkle-1-640x320.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2017/04/MeghanMarkle-1-640x320.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "royal family", "section": "Health & Fitness", "published_time": "2018-05-21T22:53:00-04:00", "modified_time": "2018-05-21T22:53:04-04:00"}, "twitter": {"card": "summary_large_image", "description": "The royal's old blog reveals some of her future plans and what she hopes to accomplish.", "title": "Meghan Markle's Bucket List Reveals the Royal's Surprising To-Dos", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2017/04/MeghanMarkle-1-640x320.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1526957580.0, "source": "http://www.cheatsheet.com", "summary": ""}