{"url": "www.cnn.com/2017/07/18/football/la-galaxy-david-beckham-transfer-scouting/index.html", "text": "(CNN) It was only 10 years ago that LA Galaxy were signing arguably the most recognizable face in world football, David Beckham.\n\nHis arrival in the US was going to build a legacy, push soccer in North America to new heights.\n\nA huge fanfare greeted Beckham. The US now had its very own soccer superstar. The world's media were just as sold on the story — \"Goldenballs\" would put the MLS on the worldwide football map.\n\nFast-forward a decade and Beckham is appearing on late-night American TV chat shows and generally being a worldwide A-lister.\n\nMeanwhile, LA Galaxy is scouting for players in Barnet, an area of north London whose only connection to soccer is their English League Two football team.\n\nOn the face of it, Beckham got everything he wanted out of his American dream. And The Galaxy? They're continuing to pursue creative solutions in scouting for talent.\n\nLA Galaxy were beaten 5-2 by Manchester United in a friendly on July 15.\n\nSlipping through the cracks\n\nThe US club believes it has spotted a gap in the market in English football. A world where big money is being spent on foreign talent, but that limits opportunities for young English players.\n\nSure, England's clubs still have youth academies, but the percentage of players that make it through to the first team is small. Even smaller is the number that go on to enjoy a fruitful career in England.\n\nThe Galaxy's theory is that many players have slipped through the cracks, been unlucky or not quite made the grade for the world's most competitive league.\n\nCombined with a struggle to find young footballing talent prepared to skip education in the US — many young American athletes pursue their sporting dreams through university scholarships — that leaves a gap for bringing young talented players into its ranks.\n\nThat's led The Galaxy to Barnet, a suburban area of London that's also a terminus for one of the capital's underground lines.\n\nTimed at the end of the English football season, Galaxy has opened its doors for those wanting a second chance, or even a first chance, to impress.\n\nFor those that do impress, a career in America is waiting. The Galaxy realizes there are thousands of players that are looking for opportunities, and they are prepared to give them that opportunity.\n\nBy holding trials in both London and Manchester this summer, the California-based club is making a point of wanting to make youth their focus.\n\nGalaxy has their second-string side, LA Galaxy II in the USL league and it's there that they see as the perfect nurturing ground for the kids.\n\nDavid Beckham and journalist and editor Anna Wintour arrive to take their seats in the Royal Box on Centre Court at Wimbledon.\n\nOpportunity\n\nTo find players between 18-years-old and their early twenties, Galaxy want to take talent in and build them up to be first-team regulars.\n\nOf course, there will still be room for future Beckhams and Steven Gerrards — but every MLS club can do that.\n\nWhere can you find kids that will one day win you trophies? And where will those talented kids be? The bottom of England's football pyramid seems like a logical place to look.\n\nChidi-James Williams is one example. Attending the trials in London, LA Galaxy liked what they saw and have invited him to LA for further trials.\n\nA talented defender, with strength and technical ability, the 21-year-old was with Premier League club Crystal Palace before being let go.\n\nSince then, he has struggled to find a way back into the youth system and is playing his football for Grays Athletic in the Isthmian League, the seventh tier of English football.\n\nWilliams said: \"One you're out of the system in England, it's impossible to get back in.\n\n\"For me opportunities like this you have to take, it's a viable career choice.\"\n\nGalaxy has also held trials across the US and Japan in the past but there is a notion within the club that England is their best chance of finding real youth talent.\n\nThey are making a point of investing in youth development, an area of a club that normally is set in stone from the beginning but not in the US where the focus initially was getting a first-team on the pitch and building a stadium.\n\n\"For LA Galaxy, it's only been the last five years that we have invested in our youth development,\" says Dan Kennedy, LA Galaxy former goalkeeper and now part of the coaching set-up. \"It's crazy it's only been five years.\n\n\"We realize that in England there are players who we can take in and develop and as a club we are in need of good youth players.\"\n\nPhotos: Fame, fashion, family and football His wife famously called him \"Golden Balls\" -- and David Beckham has the Midas Touch both on and off the football pitch. Hide Caption 1 of 46 Photos: Fame, fashion, family and football Now turning into something of a senior statesman since hanging up his boots in 2013, the boy from east London turned 40 on May 2, 2015. Hide Caption 2 of 46 Photos: Fame, fashion, family and football Here he is pictured with two of the people responsible for helping him become a global phenomenon, transcending his status as a football star: his wife Victoria (right) and \"American Idol\" creator Simon Fuller (left). Hide Caption 3 of 46 Photos: Fame, fashion, family and football When he started out as a youth player at Manchester United, there was little indication Beckham would be a fashion icon around the world. Hide Caption 4 of 46 Photos: Fame, fashion, family and football There were the haircuts, such as this corn-row style sported while representing England in 2003. Hide Caption 5 of 46 Photos: Fame, fashion, family and football After leaving Manchester United for Real Madrid in 2003, his follicles were regularly the focus of media attention. Here a shaven-headed Beckham promotes his first official training skills DVD -- \"Really Bend It Like Beckham,\" a title referring to the 2002 British film starring a young Keira Knightley as an aspiring footballer. Hide Caption 6 of 46 Photos: Fame, fashion, family and football Although Beckham's life is under constant media scrutiny, sometimes he likes to tease -- here hiding his new hairstyle during a training session in Madrid. Hide Caption 7 of 46 Photos: Fame, fashion, family and football Two days later his new blond look was unveiled during Real's match against Athletic Bilbao, with the big-spending club winning the Spanish league title in Beckham's final season there. Hide Caption 8 of 46 Photos: Fame, fashion, family and football Having moved to American club Los Angeles Galaxy later in 2007, David Beckham sported this variant on his earlier mohawk look. Hide Caption 9 of 46 Photos: Fame, fashion, family and football Like father, like son: the Beckhams' third offspring Cruz with his dad at an NBA game in LA in 2009. Hide Caption 10 of 46 Photos: Fame, fashion, family and football While still an LA player, Beckham made two loan moves back to Europe with Italian club AC Milan during Major League Soccer's offseason. Hide Caption 11 of 46 Photos: Fame, fashion, family and football Beckham's sculpted body is heavily tattooed. This is a closeup of his hand taken during the \"United for Wildlife\" conservation campaign launch in 2014. Hide Caption 12 of 46 Photos: Fame, fashion, family and football The previous year, Beckham showed this tattoo to fans in Beijing, having been named an international ambassador by the China Football Association. It reportedly says, \"Death and life have determined appointments. Riches and honor depend upon heaven.\" Hide Caption 13 of 46 Photos: Fame, fashion, family and football This Gothic winged cross on his neck, unveiled ahead of the 2004 European Championships, is just above the name of his first son Brooklyn. Hide Caption 14 of 46 Photos: Fame, fashion, family and football All four children feature on his skin -- and on his boots -- while Victoria's name is inked in Sanskrit on his left forearm. Hide Caption 15 of 46 Photos: Fame, fashion, family and football Victoria, formerly one of the all-conquering Spice Girls pop group, is credited with transforming Beckham from a floppy-haired footballer into a fashion designer's dream. Hide Caption 16 of 46 Photos: Fame, fashion, family and football From wobbly-voiced pouting singer, the former \"Posh Spice\" has become a respected award-winning designer, even guest editing for the French version of Vogue in December 2013. Hide Caption 17 of 46 Photos: Fame, fashion, family and football His many underwear adverts have earned him a following among men and women alike. Hide Caption 18 of 46 Photos: Fame, fashion, family and football In 1998, Beckham was widely mocked for wearing a sarong -- but his \"metrosexual\" look was at the forefront of a new sensitive male image emerging from the lager-fueled UK \"Lad culture\" of that decade. Hide Caption 19 of 46 Photos: Fame, fashion, family and football \"Posh and Becks\" regularly mix with Hollywood glitterati. They are seen here arriving in Italy for the 2006 wedding between Tom Cruise and Katie Holmes. Beckham is reportedly flying Cruise and other friends to Morocco for his 40th birthday party. Hide Caption 20 of 46 Photos: Fame, fashion, family and football In 2011, they attended the British royal wedding of Prince William to Catherine Middleton. Hide Caption 21 of 46 Photos: Fame, fashion, family and football Beckham's children have grown up in the media glare surrounding him -- here he is pictured with sons (L-R) Cruz, Brooklyn and Romeo Beckham during a diving event at the 2012 London Olympics. Hide Caption 22 of 46 Photos: Fame, fashion, family and football Daughter Harper, born in 2011, attended a presentation of her mom's work at the New York Fashion Week Fall/Winter shows in February 2014. Hide Caption 23 of 46 Photos: Fame, fashion, family and football Here the family attend the press night of \"Viva Forever,\" a musical based on the career of the Spice Girls, in December 2012. Hide Caption 24 of 46 Photos: Fame, fashion, family and football Beckham also took his boys to the 2014 World Cup in Brazil, where they attended the final between Germany and Argentina at the Maracana Stadium. Hide Caption 25 of 46 Photos: Fame, fashion, family and football The Beckhams have been a picture of family unity since weathering the media storm of 2004, when it was widely reported that David had an affair with his PA Rebecca Loos, who in the aftermath created her own career as a minor reality TV celebrity. The footballer vigorously denied claims of any infidelity. Hide Caption 26 of 46 Photos: Fame, fashion, family and football Here Ted Beckham watches his son playing the final game of his top-level career, for Paris Saint-Germain in May 2013. Beckham joined the French club on a five-month deal after leaving the U.S. and donated his reported $4.3 million salary to a children's charity. Hide Caption 27 of 46 Photos: Fame, fashion, family and football While his father's love of Manchester United inspired Beckham's early career, his mother Sandra's vocation -- hairdressing -- may have had a large influence in his appearance. Here she is pictured with Beckham's sister Joanne during the 2006 World Cup in Germany. Hide Caption 28 of 46 Photos: Fame, fashion, family and football Beckham's most glorious achievement at Manchester United came when the club won a treble of trophies in 1999, capped by a last-gasp win over Bayern Munich in the Champions League final. United came from behind to triumph 2-1, with both goals scored in stoppage time and resulting from Beckham's corners. Hide Caption 29 of 46 Photos: Fame, fashion, family and football Alex Ferguson brought Beckham into United's first team as part of the now venerated \"Class of '92\" youth side. They won six Premier League titles together but their relationship deteriorated as Beckham's celebrity persona blossomed -- and the Scottish manager's infamous kicking of a boot into the player's head in the Old Trafford dressing-room after an FA Cup defeat in 2003 precipitated his move to Real Madrid. Hide Caption 30 of 46 Photos: Fame, fashion, family and football Beckham won his first international cap in 1996 at the age of 21, in a World Cup qualifying match against Moldova. Hide Caption 31 of 46 Photos: Fame, fashion, family and football He was selected for the 1998 World Cup but was vilified back home after being sent off for petulantly kicking out at Argentina captain Diego Simeone as England painfully exited in the second round following a penalty shootout. Hide Caption 32 of 46 Photos: Fame, fashion, family and football As well as facing vitriol over the World Cup debacle, the seemingly effeminate Beckham was an easy target for fans at rival Premier League clubs. Here he blows a kiss to Chelsea supporters during United's run to winning the FA Cup in '99. Hide Caption 33 of 46 Photos: Fame, fashion, family and football Beckham received his 100th cap from Manchester United legend Bobby Charlton in 2008 and the midfielder went on to play 115 times at the top level -- the most by any English outfield player and second only behind goalkeeper Peter Shilton's 125 internationals. Hide Caption 34 of 46 Photos: Fame, fashion, family and football Beckham's shock move to America helped grow the nascent MLS and boost soccer's image in a country where it was previously a minority sport. He sold a reported 300,000 replica shirts each season of his half-decade stay in LA, winning two MLS Cup titles. Hide Caption 35 of 46 Photos: Fame, fashion, family and football However, Beckham had to win over LA fans after his deal was said to be worth $250 million -- which later turned out to be a publicity stunt by his agents: his contract was actually for $32.5M plus add-ons. Galaxy fans were also angered by reports Beckham was seeking a permanent move to Milan, where he suffered an Achilles injury that ruled him out of the 2010 World Cup and much of that MLS season. Hide Caption 36 of 46 Photos: Fame, fashion, family and football Beckham's move to Qatar-owned PSG gave him kudos in the Middle East. He presented the winner's trophy to tennis player David Ferrer at the 2015 Qatar Open in Doha. Hide Caption 37 of 46 Photos: Fame, fashion, family and football He has reportedly sought help from PSG's owners in funding his new Miami MLS franchise, which has been beset by stadium delays since it was announced in February 2014. Beckham had a clause in his Galaxy contract giving him the right to buy a new team for $25 million once he'd stopped playing. Hide Caption 38 of 46 Photos: Fame, fashion, family and football Among his charity projects, Beckham is a UNICEF ambasador. Here he plays with Filipino children who survived Typhoon Haiyan, which killed over 6,000 people in late 2013 and devastated large areas of Southeast Asia. Hide Caption 39 of 46 Photos: Fame, fashion, family and football Beckham launched his own soccer academy in 2005, with bases in London and Los Angeles. Both closed within five years during the global economic crisis. Hide Caption 40 of 46 Photos: Fame, fashion, family and football Beckham is now firmly established among the world's most powerful figures -- here he and former French president Nicolas Sarkozy watch PSG play in a Champions League match in February 2015. Hide Caption 41 of 46 Photos: Fame, fashion, family and football In 2005, he helped London's successful bid for the 2012 Olympics. Here he is pictured with then British Prime Minister Tony Blair (L) and his wife Cherie Blair. Hide Caption 42 of 46 Photos: Fame, fashion, family and football Beckham played a high-profile role in London's opening ceremony, driving a speedboat carrying the Olympic torch under Tower Bridge and down to the Stratford host venue near where he grew up. Hide Caption 43 of 46 Photos: Fame, fashion, family and football Beckham was less successful as a member of England's bid team for the 2018 World Cup. He is pictured here with fellow ambassadors Prince William and UK Prime Minister David Cameron in 2010 ahead of the controversial vote in which Russia won the right to stage soccer's showpiece event. Hide Caption 44 of 46 Photos: Fame, fashion, family and football Beckham now promotes a niche single-grain whiskey and is the face of the Las Vegas Sands chain, which runs casinos in Singapore and Macau among its resort ventures. Hide Caption 45 of 46 Photos: Fame, fashion, family and football So what's next for Becks? Hide Caption 46 of 46\n\nMany LA Galaxy fans felt Beckham disrespected the club with his loan spells away at AC Milan and considered his move to the US to be all about his personal gain instead of the club's.\n\nAlternatively maybe during his five-year spell at the Californian club he told the story of \"The Class of '92\" — a group of young Manchester United academy products that Beckham was part of — to Galaxy club officials and perhaps planted the seed of how youth development is the foundation for any good club.\n\nAnd if that is the case, Beckham's legacy could well live on for many years to come.", "images": ["http://cdn.cnn.com/cnnnext/dam/assets/200304050856-klopp-large-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422180106-david-beckham-royal-wedding-2011-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150424182904-david-beckham-hand-tattoo-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150427181947-david-beckham-daughter-harper-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/200313130422-epl-tease-large-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/191130172706-euro-2020-tease-large-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/200403060337-gary-lineker-on-quest-tease-large-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150424182648-david-beckham-side-tattoo-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/170717161225-galaxy-man-utd-large-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150424184519-david-beckham-milan-cut-face-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422173737-david-beckham-youth-team-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150427123827-david-beckham-ferguson-2002-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422182723-david-beckham-sarkozy-feb-2015-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150424182159-david-beckham-mls-trophy-2012-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422174152-david-beckham-chelsea-fans-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150427171128-david-beckham-simon-fuller-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150424182601-david-beckham-neck-tattoo-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150424184400-david-beckham-milan-tattoos-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422180240-david-beckham-sons-london-2012-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/170110120543-beckham-tease-exlarge-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422181837-david-beckham-boys-2014-world-cup-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422174758-david-beckham-shaved-hair-2004-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422175642-david-beckham-cruz-mohawk-2009-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150427130222-david-beckham-father-ted-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150424184400-david-beckham-milan-tattoos-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422182442-david-beckham-victoria-fashion-awards-2014-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150424174701-david-beckham-world-cup-ambassador-2010-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150427132942-david-beckham-rebecca-loos-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422181603-david-beckham-china-2013-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150424180221-david-beckham-mls-miami-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150427130402-david-beckham-unicef-philippines-super-169.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/130131120616-david-beckham-galaxy-wave-story-top.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150427125206-david-beckham-mother-and-sister-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150424174148-david-beckham-100th-cap-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/191220131931-flamengo-tease-large-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/200306072309-lukaku-tease-large-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422182259-david-beckham-qatar-2015-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/200328080307-as-roma-care-package-large-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150427125206-david-beckham-mother-and-sister-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422180351-david-beckham-family-spice-girls-musical-2012-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150427181947-david-beckham-daughter-harper-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150424184519-david-beckham-milan-cut-face-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422174009-david-beckham-1999-champions-league-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422174152-david-beckham-chelsea-fans-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/200316113425-sevilla-betis-fifa-large-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150424174701-david-beckham-world-cup-ambassador-2010-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150427181806-david-beckham-boot-childrens-name-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150424185133-david-beckham-underwear-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150424173726-david-beckham-tom-cruise-wedding-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422174623-david-beckham-1998-world-cup-red-card-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/170717162334-galaxy-beckham-large-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422175456-david-beckham-with-victoria-lax-2007-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422174623-david-beckham-1998-world-cup-red-card-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150424182904-david-beckham-hand-tattoo-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150427124728-david-beckham-olympics-opening-ceremony-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422181020-david-beckham-and-victoria-1999-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/200311103403-christian-kabasele-fight-salah-tease-large-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150427132942-david-beckham-rebecca-loos-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150427130402-david-beckham-unicef-philippines-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422180240-david-beckham-sons-london-2012-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422175304-david-beckham-real-madrid-hat-2007-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/200305093048-eric-dier-crowd-fa-cup-large-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150424175942-david-beckham-london-2012-ambassador-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422175304-david-beckham-real-madrid-hat-2007-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/170110120543-beckham-tease-large-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150424174148-david-beckham-100th-cap-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150428153044-david-beckham-london-academy-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422182021-david-beckham-gold-paint-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150424182601-david-beckham-neck-tattoo-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422174443-david-beckham-corn-row-hair-2003-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422175642-david-beckham-cruz-mohawk-2009-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150424180221-david-beckham-mls-miami-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422173737-david-beckham-youth-team-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422182442-david-beckham-victoria-fashion-awards-2014-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150429180332-david-beckham-tease-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/200414091213-ronaldo-bernardo-silva-tease-large-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422175456-david-beckham-with-victoria-lax-2007-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422181020-david-beckham-and-victoria-1999-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422174758-david-beckham-shaved-hair-2004-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422182259-david-beckham-qatar-2015-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422175805-david-beckham-la-galaxy-blonde-2009-small-11.jpg", "http://pixel.quantserve.com/pixel/p-D1yc5zQgjmqr5.gif?labels=noscript%3ANo%20Labels%20Set", "http://cdn.cnn.com/cnnnext/dam/assets/150422174443-david-beckham-corn-row-hair-2003-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150424173726-david-beckham-tom-cruise-wedding-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422182602-david-beckham-unicef-2015-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150427123827-david-beckham-ferguson-2002-small-11.jpg", "data:image/gif;base64,R0lGODlhEAAJAJEAAAAAAP///////wAAACH5BAEAAAIALAAAAAAQAAkAAAIKlI+py+0Po5yUFQA7", "http://cdn.cnn.com/cnnnext/dam/assets/150422181603-david-beckham-china-2013-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/200413133548-belarus-football-still-going-tease-large-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150427181806-david-beckham-boot-childrens-name-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422182602-david-beckham-unicef-2015-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150424182648-david-beckham-side-tattoo-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422180106-david-beckham-royal-wedding-2011-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150428153044-david-beckham-london-academy-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150429180332-david-beckham-tease-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150427171128-david-beckham-simon-fuller-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/200328114051-lewandowski-football-finance-tease-large-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150427124728-david-beckham-olympics-opening-ceremony-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422175805-david-beckham-la-galaxy-blonde-2009-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/200311164004-ac-milan-coronavirus-large-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422182021-david-beckham-gold-paint-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422181214-david-beckham-real-madrid-blond-2007-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422175154-david-beckham-england-debut-1996-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422182723-david-beckham-sarkozy-feb-2015-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422175154-david-beckham-england-debut-1996-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422174009-david-beckham-1999-champions-league-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150424182159-david-beckham-mls-trophy-2012-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422181837-david-beckham-boys-2014-world-cup-small-11.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422180351-david-beckham-family-spice-girls-musical-2012-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150422181214-david-beckham-real-madrid-blond-2007-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150424175942-david-beckham-london-2012-ambassador-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150424185133-david-beckham-underwear-super-169.jpg", "http://cdn.cnn.com/cnnnext/dam/assets/150427130222-david-beckham-father-ted-small-11.jpg"], "top_img": "https://cdn.cnn.com/cnnnext/dam/assets/130131120616-david-beckham-galaxy-wave-story-top.jpg", "keywords": [], "authors": ["Tom Bushell", "For Cnn"], "canonical_link": "https://edition.cnn.com/2017/07/18/football/la-galaxy-david-beckham-transfer-scouting/index.html", "title": "LA Galaxy's search for new talent 10 years after signing David Beckham", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "section": "football", "referrer": "unsafe-url", "og": {"pubdate": "2017-07-18T10:19:11Z", "url": "https://edition.cnn.com/2017/07/18/football/la-galaxy-david-beckham-transfer-scouting/index.html", "title": "LA Galaxy's search for new talent 10 years after signing Beckham", "description": "It was only 10 years ago that LA Galaxy signed David Beckham. Now they've returned to Britain in a very different recruitment drive.", "site_name": "CNN", "type": "article", "image": {"identifier": "https://cdn.cnn.com/cnnnext/dam/assets/130131120616-david-beckham-galaxy-wave-story-top.jpg", "width": 640, "height": 360}}, "pubdate": "2017-07-18T10:19:11Z", "lastmod": "2017-10-19T15:37:30Z", "author": "Tom Bushell, for CNN", "twitter": {"title": "LA Galaxy's search for new talent 10 years after signing Beckham", "description": "It was only 10 years ago that LA Galaxy signed David Beckham. Now they've returned to Britain in a very different recruitment drive.", "card": "summary_large_image", "image": "https://cdn.cnn.com/cnnnext/dam/assets/130131120616-david-beckham-galaxy-wave-story-top.jpg"}, "description": "It was only 10 years ago that LA Galaxy signed David Beckham. Now they've returned to Britain in a very different recruitment drive.", "keywords": "football, LA Galaxy's search for new talent 10 years after signing David Beckham - CNN", "thumbnail": "https://cdn.cnn.com/cnnnext/dam/assets/130131120616-david-beckham-galaxy-wave-story-top.jpg", "vr": {"canonical": "https://edition.cnn.com/2017/07/18/football/la-galaxy-david-beckham-transfer-scouting/index.html"}, "article": {"opinion": "false", "content-tier": "free"}, "fb": {"app_id": 80401312489, "pages": "5550296508,18793419640"}, "template-top": "sport,football,sport,art-vid-vls-col,col-international-football-news"}, "movies": [], "publish_date": 1500307200.0, "source": "http://www.cnn.com", "summary": ""}