{"url": "https://www.cosmopolitan.com/entertainment/celebs/a14000368/celebrity-breakups-2017/", "text": "12. Selena Gomez and the Weeknd\n\nGetty Images\n\nSelena seemed happy with Abel and that's great, but let's be real — she deserves better. I've mentioned this many times both in real life and on this website, but I'm going to mention it again because we must never forget that Abel once told the New York Fucking Times he didn't think he was in love with his then-girlfriend Bella Hadid. Who does that?! A man who is not good enough for Selena Gomez, that's who.\n\n11. Jennifer Lawrence and Darren Aronofsky\n\nGetty Images\n\nAs with Abelena, this was another case where J.Law's girlfriends needed to intervene and say, \"I'm sorry, but no.\" Is Darren Aronofsky a good director? I guess, if you're into body horror and dead babies. But is he a good boyfriend? It sure doesn't sound like it! Aside from the fact that he had the nerve to mock Jennifer's interest in reality TV, he also wouldn't shut the hell up about his movie's reviews when she was just trying to relax. Consider that bullet dodged, J.Law.\n\n10. Kylie Jenner and Tyga\n\nGetty Images\n\nThese two have been on and off for approximately 85 years, but they called it quits for good in April. While someone out there must be mourning the loss of the couple that produced videos like \"Stimulated,\" the rest of us are happy to forget this ever even happened.\n\n9. Katy Perry and Orlando Bloom\n\nGetty Images\n\nWhile this relationship is the reason we now have photos of Orlando Bloom paddleboarding naked, these two never quite clicked the way that say, Katy Perry and John Mayer did. They've been spotted together again since their March split, but they seem to be just friends (who still paddleboard, but with clothes).\n\n8. Scarlett Johansson and Romain Dauriac\n\nGetty Images\n\nIt's always charming when a super-famous person marries a normal, but alas, this pairing didn't last. Scarlett and Romain finalized their divorce in September, after three years of marriage. She's since been spotted with Saturday Night Live cast member Colin Jost.\n\n7. Rachel Bilson and Hayden Christensen\n\nGetty Images\n\nThe weirdest part of this breakup was the sensation of feeling sad about the end of a relationship you'd forgotten still existed. Rachel and Hayden had been together on and off for ten years, through the end of The O.C., the beginning of a new Star Wars trilogy, and the entire run of Hart of Dixie. They have one child together, Briar Rose, born in October 2014.\n\n6. La La and Carmelo Anthony\n\nGetty Images\n\nLa La and Carmelo first got together in 2004, which, lest you forget, is a year so long ago that iPhones didn't even exist yet. They married in 2010 and seemed destined to last forever, but split this spring amid cheating rumors. They're still not technically divorced, but in November, La La said this: \"When it's time for the world to know, they'll know.\"\n\n5. Fergie and Josh Duhamel\n\nGetty Images\n\nTotally random celebrity pairings are the best celebrity pairings, and this was one of those. How in the world did a Black Eyed Pea end up with the guy from the Nicholas Sparks ghost movie? Kismet, apparently, because way before they started dating, he had a dream about her. But in September, they announced that they'd decided to separate earlier this year.\n\n4. Nicki Minaj and Meek Mill\n\nGetty Images\n\nNicki stood by Meek throughout his ill-advised Drake feud, Meek gave Nicki a big ring, and the pair took some great photos with Jay-Z and Beyoncé, but in January Nicki confirmed via Twitter that she was single. At least Meek knows what a great thing he had — in July, he admitted that the breakup was a \"loss\" for him.\n\n3. Ben Stiller and Christine Taylor\n\nGetty Images\n\nBen and Christine had been together so long that it started to seem like they just always would be, à la Tom Hanks and Rita Wilson or Jada Pinkett and Will Smith. But 2017 just tooketh and tooketh, and in May the couple announced that they were splitting after 17 years of marriage. Zoolander will never be the same again.\n\n2. Robert Pattinson and FKA Twigs\n\nGetty Images\n\nFKA Edward and Tahliah Barnett were extremely private throughout the course of their two-year relationship, but the idea of these two particular people together was just too perfect. If an avant-garde musician and a sparkly vampire turned Serious Actor could make it work, anyone could. Sources have said they might get back together, though, so keep the dream alive.\n\n1. Anna Faris and Chris Pratt\n\nGetty Images\n\nEven if you're not a Chris or Anna superfan, this one was a real gut punch. They were one of those celebrity couples that made you believe fairy tales could happen in real life — just so cute and so funny and so freaking happy all the time. He liked to braid her hair in front of the TV, for god's sake! I'm getting choked up just thinking about it. At least we'll always have the memories.\n\nFollow Eliza on Twitter and Cosmo Celeb on Facebook.\n\n", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/celeb-breakups-1512166274.png?crop=1.00xw:1.00xh;0,0&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/celeb-breakups-1512166274.png?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": ["Eliza Thompson", "Senior Entertainment Editor", "I M The Senior Entertainment Editor At Cosmopolitan.Com", "Which Means My Dvr Is Always Percent Full."], "canonical_link": "https://www.cosmopolitan.com/entertainment/celebs/a14000368/celebrity-breakups-2017/", "title": "The 12 Saddest Celeb Breakups of 2017, Ranked From Least to Most Heartbreaking", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "The 12 Saddest Celeb Breakups of 2017, Ranked From Least to Most Heartbreaking", "description": "It's been a tough year for love.", "url": "https://www.cosmopolitan.com/entertainment/celebs/a14000368/celebrity-breakups-2017/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/celeb-breakups-1512166274.png?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2017-12-01 10:11:27", "published_time": "2017-12-01 10:11:25", "section": "Celebs", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/celeb-breakups-1512166274.png?crop=1.00xw:1.00xh;0,0&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "The 12 Saddest Celeb Breakups of 2017, Ranked From Least to Most Heartbreaking", "description": "A roundup of all the celebrity couples who split in 2017.", "keywords": "celeb breakups, celebrity splits, celebs who broke up in 2017, celebrity divorces 2017, anna faris chris pratt", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/celeb-breakups-1512166274.png?crop=0.502xw:1.00xh;0.251xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrities & Entertainment,entertainment,celebs", "sailthru.date": "2017-12-01T22:11:25Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/celeb-breakups-1512166274.png?crop=1.00xw:1.00xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/celeb-breakups-1512166274.png?crop=0.502xw:1.00xh;0.251xw,0", "sailthru.socialtitle": "The 12 Saddest Celeb Breakups of 2017, Ranked From Least to Most Heartbreaking", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1512094285.0, "source": "https://www.cosmopolitan.com", "summary": ""}