{"url": "onceuponatime.wikia.com/wiki/Evil_Queen", "text": "After Third Curse\n\nUpon arrival to Storybrooke, Regina and the others realize they can only remember entering King Arthur's castle in Camelot, and nothing else beyond that. Giving off the facade of having embraced her darkness, Emma enters, intimidating her family and friends with just her presence alone. Regina threatens to fulfill what Emma once told her to do if she went too far, but when she reaches for the dagger, it is not there. Instead, Emma reveals she has it now, and she then proclaims she will punish them for what they did to her. (\"The Dark Swan\", \"The Price\", \"Broken Heart\")\n\nThe next day, Regina, Mary Margaret and David try to stop the dwarves from testing the town line, but Leroy insists they have to know whether it's possible to leave town now that Emma is a danger to them all. Dopey crosses the line and nothing happens, but then, the earth beneath him cracks open and releases greenery, turning him into a tree. Regina confronts Emma when she sees her talking to Henry, and then asks about the memory wipe. Emma admits to casting the curse, which is unbreakable since there's no savior, but Regina attests she will find a way. Before Regina departs with Henry, Emma cautions that there's a problem in town that only a savior can fix. Regina learns some of Camelot's residents have been brought to Storybrooke by Emma's curse, and she briefs Arthur about it. As some of the townspeople are distributing supplies to the Camelot visitors, Regina relates her fears to Robin Hood about taking on the savior role and whether people are ready to trust her. Later, Robin is kidnapped by a fury, which is the \"problem\" Emma spoke of. Regina tries to save him, but she gets injured by the fury, who escapes. She attempts to follow, but Mary Margaret convinces her to stay behind and let them handle it. Upset at this setback, Regina vents her frustration onto a comatose Mr. Gold, blaming him for making her the person she is. Belle provides intel about the fury, stating it's a demon from the underworld sent to extract an unpaid price of magic, and that they have until the full moon reaches its zenith before Robin is taken. Believing Emma summoned the fury, Regina demands that she send it away, but Emma reveals Regina is the one who didn't pay the price from six weeks ago. Regina then forces the fury to take her life instead, but Mary Margaret refuses to abandon her, linking hands with her. Soon, David, Leroy and Arthur do the same, causing the fury's power to explode on itself, therefore paying off the price of magic. That night, Regina joins Robin at the diner. Satisfied with having proven she can protect the town, she solves another problem by magically reverting Mr. Clark to normal from his statue form. (\"The Price\")\n\nAt the sheriff station, Regina shows David and Mary Margaret a photo of a toadstool from a Camelot book she had marked six weeks prior, though she doesn't remember what it was for. When the dwarves storm in, demanding David do something about Emma, who stole Happy's pick ax, Regina grabs the book and takes her leave from the room. David eventually finds the toadstool, which crossed over from Camelot during the curse, and presents it to Regina and Mary Margaret in the vault, where they realize they were using the toadstool to breach communication with Merlin. (\"Siege Perilous\")\n\nGathered with her allies at the sheriff's station, Regina is present as Grif's strange disappearance is noted, with Arthur suggesting Grif escaped back to Camelot with a magic bean. Upset about how this news will affect her people, as the bean was their only hope of going home, Guinevere believes they must do something to raise everyone's spirits. Henry suggests a dance, to which David jokes about that being an excuse for him to ask his girlfriend out. Regina is alarmed by the mention of a girlfriend, though he later insists he and Violet Morgan are just friends. After Mr. Gold is reported missing, Regina goes with Belle, Hook, and Robin to break into Emma's house, suspecting she has something to do with his disappearance. To get past the door's protection spell, Regina conjures Henry's scarf, using it to bypass the barrier. In the basement, they find Excalibur in a stone, noting that the sword's markings are the same as the Dark One's dagger. Hook moves to pull it out, but Regina stops him, warning that doing so might kill him. Before they can search the rest of the house, Henry texts Regina about Emma returning home. As they scramble to leave, Hook finds a dreamcatcher, causing Regina to realize Emma used it to take their memories. Regina and Robin later view the dreamcatcher's memories, in which Emma took Violet's heart and told her to reject Henry, in order to obtain a tear of a broken heart to free Merlin. When Emma turns up asking to see Henry, Regina confronts her about what she did to Violet. Emma defends her decision, arguing that she did it with good reason, to which Regina compares her to Cora, who said the same thing to her long ago. Emma insists she didn't have a choice, though Regina recalls Emma has said many times there is always a choice. Pushed to her limit, Emma reveals it was the only way to free Merlin. Regina then questions why she is still the Dark One if they freed the sorcerer, but Emma refuses to say and instead asks again to see Henry. Regina denies her request, stating that Henry doesn't want to see her, before closing the door. (\"Dreamcatcher\")\n\nAfter informing David, Mary Margaret, Hook, and Belle about Emma's slip up about Merlin, Regina explains her plans to use the Crimson Crown to talk to the sorcerer, though they need Arthur's help enacting the spell, as only someone chosen by Merlin can use the toadstool. Belle prompts the group to consider getting direct help from Mr. Gold instead, but all three oppose her views for different reasons. Regina believes if Mr. Gold gets hurt while in Emma's grasp, that's a risk that has to be taken in order to focus on Merlin. After Belle goes to save Mr. Gold on her own, the heroes gather in the vault, with the prepared spell brew. Upon Arthur's arrival, he asks for privacy to use the Crimson Crown, explaining that Merlin only ever spoke to him when no other people were around. Regina and everyone else leave to wait outside the vault, and after a time, Arthur exits to inform them the spell failed. As proof of Arthur's sabotage, David later finds the charred, but still magically intact Crimson Crown in the burnt out cauldron fire. With Henry being the only other person who was chosen by Merlin, he is called in to enact the spell. Regina has concerns that he isn't up for the task, but Henry attests the person who ripped out Violet's heart isn't his mom and he'll do whatever it takes to get back the old Emma. Once the spell is cast, the group view a prerecorded hologram message from Merlin, who tells them to look for Nimue, the person they need for defeating the Dark One. (\"The Bear and the Bow\")\n\nAlthough Arthur is apprehended and imprisoned for his sabotage, he holds no answers about Emma's current actions. From Hook's previous run-in with Emma, in which she told him that he is the reason for her plans, he comes to believe Emma has something bigger at stake rather than her desire to snuff out the light. Regina scoffs at his naiveness, insisting Emma is toying with his emotions, but Hook refuses to let the issue go and decides to get answers from Emma herself. When Zelena's pregnancy accelerates because of Emma's magical influence, Regina and Robin are called in by Nurse Ratched, and all three accompany Zelena as she is brought to the hospital wing to prepare for labor. As Zelena is giving birth, Regina waits in the hallway, expressing doubts about helping her sister after everything she's done, but Mary Margaret persuades her that it's the right thing to do. After a daughter is born, Regina puts on a brave face, entering the room to congratulate Robin and meet the baby, while Zelena cannot help but comment on her sister's underlying jealousy over her having Robin's child. Before Regina can respond, Emma arrives to kidnap Zelena instead of the baby, proving Emma has something bigger planned. With David and Mary Margaret, Regina goes to confront Emma, who promises that they'll be thanking her after she is done with Zelena, and then stabs Excalibur into the ground, triggering a magical barrier that touches everyone who is present. (\"Birth\")\n\nShortly after, Regina, David and Mary Margaret enter the house in search of Emma, who finally admits she had turned Hook into a Dark One and planned on putting both her and Hook's darkness into Zelena before killing her. With a dark Hook now on the loose, their best bet of finding out his goals is getting their memories from the dreamcatchers, however, Hook has already stolen them. In a meeting at Regina's house, Mr. Gold reveals Hook intends to get revenge on him with a duel to the death. To learn more about Nimue, who can defeat the Dark One, Mr. Gold advises the group to research The Dark One Chronicles. Emma believes she can help them quicker with magic if they remove her cuff, but her family or friends refuse, not trusting that the darkness won't influence her to do bad things. As assurance Emma won't try anything, Regina has Merida guard her while everyone is away. Before she can join the group at the library, Regina heads to the hospital, where Zelena finds her baby daughter missing. Zelena is livid, accusing Regina of being jealous of her having Robin's baby, to which Regina fires back, confronting her sister over the outrageous things she did just to have the child. Believing this insanity between them has to end, Regina takes her to the loft, where Robin is taking care of the baby. Regina, having had the experience of changing into a better person because of maternal love, has hopes Zelena's love for her own child can do the same. Robin then gives his permission for Zelena to be part of his daughter's life and to visit as long as either he or Regina are present. After Emma retrieves the dreamcatchers, Regina's lost memories are restored. From regaining her memories that Hook stole from her, Emma realizes Hook wants to open a portal to the underworld and bring all the previous Dark Ones to Storybrooke. (\"Broken Heart\")\n\nLearning Hook has unleashed the previous Dark Ones from the Underworld, Regina goes with Robin to search for and take down Hook, while everyone else splits up from them to cover more ground. The pair stop in their tracks when Zelena poofs in front of them, casually stating she's since made a change in her and Robin's custody agreement, in which she grants herself sole custody. Zelena claims there is no point in fighting since both Regina and Robin will be dead soon. The couple quickly learn what she means when two Dark Ones corner them and brand their wrists with the mark of Charon. After regrouping with the others, they determine the Dark Ones cannot exist without living souls taking their places in the Underworld, as everyone with the mark will die when Charon comes for them. Regina finds Hook and tries to talk him out of damning Emma's loved ones to the Underworld. He ignores her plea, believing Regina, of all people, should know how far someone will go for revenge. However, she considers that he wasn't the man he was then when she asked him to kill Cora, and how she tested him to ensure he had no weaknesses. Before she can bring up the weakness in question, he magically constricts her throat, warning her to never speak of it again as she has no idea of his current capabilities. Regina arrives to the vault, where Emma tells her to fulfill the promise she once asked of her if she ever went too far. They procure Excalibur from Mr. Gold, with Emma intending to absorb all the darkness, and have Regina kill her to destroy it. Afterwards, Regina heads to the mayor's office with Robin to confront Zelena. Using the Apprentice's wand, she teleports herself and Zelena to the clock tower, before harnessing the wand to banish Zelena to Oz. As Charon's arrival draws near, everyone who was branded is brought to the lake, where the portal to the Underworld is. Regina reminds Hook once more of the choice he made with his father, and that he has to decide what kind of man he wants to be now. Prompted by this, Hook takes in the darkness and has Emma kill him. However, when Emma discovers Mr. Gold used Hook's sacrifice to regain his Dark One powers, she forces him to reopen the portal to the Underworld so she can save Hook. With the others, Regina joins them on this expedition. (\"Swan Song\")\n\nUpon coming to the Underworld, Regina splits from her group, with Robin accompanying her to search for Hook. She sees a familiar face on the street, a man named Blacktooth, whom she killed long ago in the Enchanted Forest. Robin notices the town looks the same as Storybrooke, except the top of the clock tower is in ruins on the street. Regina recalls Storybrooke came along with the Dark Curse after she cast it, though she theorizes that whoever made the curse created Storybrooke as a replica to the Underworld's town. Suddenly, she realizes Blacktooth has been trailing them, but he reveals Cora wants to see her. At the mayor's office, Regina reunites with her mother, who is worried for her safety in the Underworld and has prepared a boat to take her home. Cora insists Regina should do what's best for herself instead of helping her friends, which will be her downfall. To give Regina a reason to leave, she shows her what will happen if she stays. Cora pulls Blacktooth into a fiery abyss, damning him to a worse fate, and she warns Regina to take the boat, or her father will suffer the same end. After a failed attempt at talking to Hook, Emma urges Regina to leave the Underworld before Cora's threat becomes real. Instead, Regina uses the ale to summon her father, whom she tearfully apologizes to. He forgives her for killing him, and she promises to follow Cora's orders to keep him from any more suffering, but he encourages her to stay and help her friends. With Henry, Regina returns to the cave to confront Cora, but she is unable to stop Cora from pulling her father into the fire. After Cora teleports away, however, her father is released from the flames, with a bridge forming behind him leading to Mount Olympus. Realizing his unfinished business, which was to ensure Regina is free of Cora's control, has come to an end, he bids both her and Henry a farewell, before ascending to a better place. While Regina and her party consider helping other souls move on from the Underworld, Mr. Gold leaves the group, wanting no part in it. (\"Souls of the Departed\")\n\nContinuing to look for Hook in the north woods, Regina decides to speed things along by sending Robin to the mayor's office, where there might be maps of Underbrooke. She allows him to take Henry along, and she assures them that the office is safe now that Cora is gone. Emma picks up on a blood trail, which she and Regina follow, believing it leads to Hook, but instead, they find Hades' escaped prisoner Megara. The girl just barely mentions Hook when a hellhound, Cerberus, approaches them, prompting Emma to teleport all three of them to the Underworld version of her parents' apartment. Unsure of who or what is living here, Regina fears the tenant might come home, however, Emma finds proof that the apartment is waiting for her parents to die and move in. Megara tells them about Hook helping her escape Cerberus, whom she describes with terrifying detail. Believing Hercules can defeat the beast, Mary Margaret joins Regina and Emma at the diner, where Regina grills the Blind Witch about the deceased demigod. The Blind Witch still resents Regina for killing her, while the former Evil Queen reminds the witch that there were bound to be consequences for stealing her apple. After the witch gives them the information, Mary Margaret persuades Hercules to take on the mission. The trio of women enter the mines with him, and they stay behind as he ventures deeper on his own. When Hercules returns to them after fleeing from Cerberus, the group brace for a fight, only for Hades to call off his pet and confront them himself. Regina wants to know why the Underworld looks like Storybrooke, but Hades refuses to say. Hades leaves them with Killian's hook, warning that he'll do much worse to the pirate. When Mary Margaret loses hope over her inability to help Hercules or herself, Regina reminds her that Snow White never lost faith in her, the Evil Queen, and won her over by becoming her friend. Furthermore, she pushes Mary Margaret to give up her Storybrooke persona, because they need Snow White now. Inspired by Regina's advice, Mary Margaret channels her old personality and teams up with Megara and Hercules to kill Cerberus. In the aftermath, Mary Margaret vows to be Snow White again, much to Regina's approval. (\"Labor of Love\")\n\nTo find Hook underground, Regina and her party plan to enter the cave that Megara previously escaped from. The plan falls through after Mr. Gold convinces Emma to join him for a better idea, in which he'll use the aura of a deceased person to get both of them into Hades' lair, where Hook is. While Mr. Gold and Emma are away on the mission, Regina tries to track down the Blind Witch at the diner, but she finds Cruella instead. Unable to use her magic in the Underworld, Regina relies on Cruella for information about Underbrooke's headstones and how to tell by looking at them if someone has moved on. With her first love Daniel in mind, she recruits Snow to accompany her into the cemetery to look for his grave. Upon finding it, Regina is relieved to see the headstone is tipped over, meaning Daniel moved on from the Underworld. She speaks to his grave, relating how pleased she is that he's in a happier place, and at the same time, she is sad over not being able to see him again. Later, in town, she spots a wounded horse lying on its side and manages to channel her magic to heal the animal. At the apartment, Regina and the others enter to find Hook and Emma, who report that Hades destroyed their boat, so now everyone has no way of going home. Since her magic is working again, Regina attempts to take out Emma's heart, in order to split each half between Emma and Hook, but a magic barrier blocks her. Afterwards, Hook shows everyone the three headstones that Hades engraved with Regina, Snow and Emma's names, to make them stay in the Underworld forever, in place of the three people who already moved on. (\"Devil's Due\")\n\nSeeking knowledge about Hades' weakness in order to defeat him, Regina helps search for the storybook. After Henry reveals the book is in the Sorcerer's mansion, Emma's parents head to the sheriff's office to get the key. While waiting for their return, Emma confides in Regina about Hook's brother Liam pressuring her to let Killian go after they take down Hades. Though Emma confirms Killian wants to move on, Regina advises her to help Hook to forgive himself for his dark deeds, as that's something she struggled with in the past too. At the mansion, Emma makes Henry stand on guard duty as everyone else looks for the book. Henry begins to protest, but Regina cuts him off, telling him not to argue with either of his mothers. Liam finds the book, with the pages from Hades' story torn out, and he suggests sweeping the mansion until the fallen pages are found. Regina, having been told earlier by Emma that Liam is self-righteous, quietly agrees with her sentiments, before going to look for the pages. Later, Hook discovers Liam took the pages while under duress from Hades. Henry reveals to his family that he found the Author's quill in the mansion, and he initially wanted it for the wrong reasons, but now, he'll use it to re-record Hades' story. (\"The Brothers Jones\")\n\nAfter Henry writes about Snow and David's plan to contact their son Neal in Storybrooke, Regina and the others have little enthusiasm about it, as they were hoping to read Hades' story. Having no control over how and when his writing happens, Henry becomes upset at their reactions and storms upstairs. Zelena, after being pulled into the Underworld, seeks out the heroes' help to track down her baby, whom Belle ran off with. While combing the woods with Regina and Robin, she asks Robin what he named their daughter, expressing disdain at certain names, especially Marian. When Robin retorts he hasn't had enough time with their child since he's been protecting her from Zelena, she berates him for being in the Underworld instead of with their daughter. Robin insists helping a friend and settling an example of heroism is important, much to Zelena's disdain. To end the dispute, Regina recalls how she used to be like Zelena, only caring about herself, and that made her alone and miserable, but this changed when her enemies became her family, which is why they are in the Underworld to save Hook. After finding the baby, Zelena offers to feed her with a formula bottle. Robin relents, only because Zelena's magic isn't working, but when Zelena's magic returns, she douses him, Regina and Belle with a blast before escaping with her child. However, after realizing her own magic injured her daughter, Zelena forfeits her to Robin, knowing she can't protect their child from Hades, whom she suspects wants the child for a time spell. Back at the apartment, Regina plays with the baby, fondly noting that her eyes resembles Robin's. (\"Our Decay\")\n\nIn the library, Regina works on creating a spell to unlock Hades' seal on the elevator entrance. After finishing, she and Emma magick the door open, but instead of access to Hades' lair, it reveals a brick wall. Relating a dream she had, Emma thinks she may be able to magically burn her, Regina and Snow's names from the headstones. Snow and Hook go with her, but before Regina joins them, she goes to talk to Zelena about her past with Hades. Regina learns Hades is in love with Zelena, and while she cares about her sister, she presses her on the matter of Hades' weakness. Zelena is upset Regina has come to her for more than just sisterly concern, while Regina insists both are very important to her. However, Zelena has nothing else to offer, except that she is Hades' only known weakness. Regina finds her group in the vault, where they are hiding from a beast that killed Snow in Emma's dream. She theorizes Emma's dream relates to her fears, and after some prodding from Hook, Emma admits she regrets bringing everyone to the Underworld and is afraid she'll inevitably cause someone's death. After helping Emma let go of her guilt, Snow leads her allies into the forest to track the beast. Regina and Emma stun the monster with their combined powers, but upon closer look, Snow recognizes it's wolf Ruby and reverts her to human form with the cloak. (\"Her Handsome Hero\")\n\nOnce Ruby wakes up, she tells her friends about her search for Dorothy, who went missing in Oz after Zelena took her silver slippers. Regina talks Zelena into redeeming herself by helping them, to which Zelena unveils in a mirror that Dorothy is currently under the sleeping curse in Oz. Only true love's kiss can break the curse, and Zelena believes it impossible, since Dorothy may have the love of the Ozians, but not true love. In a private chat with Regina, Zelena continues to be smug about what she did to Dorothy, until her sister tells her to drop the act. Regina persuades her to break away from the path she is on now, starting by doing one good thing; giving up the slippers. Zelena forfeits the slippers, despite that she sees no value in Regina's pep talks, as she believes nothing will ever change for either of them. Regina offers the slippers to Ruby, who sees no point in returning to Dorothy if there's no one to give her true love's kiss. After some thought, Ruby recalls Dorothy loved her deceased Auntie Em. They find Auntie Em's headstone is neither tipped or cracked, and to get true love's kiss, Snow suggests bottling a kiss from Auntie Em and delivering it to Dorothy in Oz. Auntie Em jumps at the chance to help Dorothy, but before she can, her body melts into a puddle, because of interference from Hades. Eventually, Snow convinces Ruby to attempt true love's kiss on Dorothy, knowing she has feelings for the girl. Instead of David going with Ruby to Oz, where he'll make the journey home to Storybrooke, he forfeits his freedom so Snow can go instead. Before Snow leaves, Regina requests that, after she gets back to Storybrooke, to check up on Roland, as she knows Robin would want to know if his son is all right. (\"Ruby Slippers\")\n\nThrough an enchanted hand mirror, Regina spies on Zelena and Hades' growing romance. She learns Hades has created tombstones for her and her friends, and that he wants to leave for Storybrooke with Zelena. After Zelena returns home, Regina forbids her from seeing Hades again, but Zelena believes she can change him into a better person, like Regina did with Robin. Regina questions what will happen if she fails, to which Zelena rebuffs her concern, accusing her of never wanting a sister anyway. To stop Hades' influence on Zelena, she enlists Hook to help her rescue Cora. While her mother distracts Zelena by pretending to reconcile with her, Regina sneaks in with a memory potion. Cora tries to slip the potion to Zelena in a drink, but the latter figures out what is going on. When both sisters prepare to have it out in a magic battle, Cora restores their lost childhood memories of each other. Remorseful about having believed any love was weakness, Cora praises Regina for being stronger than she ever was, and that she earned that strength from her loved ones. After imparting similar wisdom to Zelena, Cora prepares to move on from the Underworld, and she asks her daughters to always hold on to each other. Once their mother is gone, Regina finally gives her blessing to Zelena about Hades. (\"Sisters\")\n\nShortly after letting Zelena go, Regina explains her decision to her allies, who are skeptical about whether her sister can change Hades or not. She steps up to help when Hades reveals Zelena is being ransomed by Mr. Gold and Peter Pan, but rather than let her, Hades agrees to remove everyone's names from the tombstones if Emma assists him. Once Emma saves Zelena, a kiss of true love between Hades and Zelena triggers a portal to Storybrooke that is set to open in a few hours. Following the removal of the tombstone names, Regina pulls out Emma's heart to begin the heart split, but it fails to work. When Hades mentions ambrosia might allow Killian to escape the Underworld, Emma and Hook head underground to look for it. In their absence, Henry frets over not completing Operation Firebird, and although people can move on once Hades has left, he wants to help those who don't know their unfinished business. Upon rejoining his party, Robin is alarmed to see them with Zelena and Hades, even with Regina's assurance the pair can be trusted. Knowing the portal to Storybrooke is opening soon, Regina asks Robin to take the baby and go through it first, as she wants to stay a little longer to help Henry with Operation Firebird. He refuses to leave her behind, and fears for her safety in the Underworld since many still hold a grudge against her. Regina then suggests giving the baby to Zelena instead, and he eventually relents, after she persuades him that she is doing this in his daughter's best interests. After Zelena, the baby and Hades leave to wait by the portal, Robin rebuffs Regina when she tries to comfort him over having to give up his child. While Henry commences Operation Firebird, Regina, David, and Robin keep him company. The Blind Witch, as Cruella's accomplice, traps the foursome in the library, with Regina later realizing Hades' magic is keeping them from escaping. These suspicions about Hades are cemented further when Emma returns without Hook or the ambrosia. With Emma and Regina's combined powers, the heroes break out and make it through the portal before it closes. (\"Firebird\")\n\nAfter returning to Storybrooke, Regina and Robin encounter Zelena and tell her about Hades' scheming. Zelena doesn't believe their claims and continues to defend Hades, who Regina threatens to kill. They attempt to reclaim Robin's daughter from Zelena and Hades from town hall, but they find the building protected with Zelena's magic. Regina proposes she and Robin get into the building through an underground tunnel, but she refuses to let Emma come along, citing that she is too emotional over Hook to face Hades. During the tunnel trek, Regina talks to him about why she gave Zelena a chance to find love with Hades. Robin, however, is still too upset over his daughter being in Hades' hands, and doesn't want to hear Regina defending her sister. When she apologizes for getting him in this mess and vows to rectify things, Robin goes back on his previous words, agreeing that Zelena does deserve another chance. He realizes, from having been with Regina, that people can change and don't always have to live in the shadows of their pasts. The couple arrive to the office, overhearing Hades trying to convince Zelena into letting him use the Olympian Crystal against the heroes so they can take over Storybrooke. Zelena teleports outside to deal with Emma, and while Hades is away, Regina and Robin enter to get the baby. Hades reappears to finish Regina off with the Olympian Crystal, but Robin takes the blow for her. After being hit, he shares one last look with Regina before collapsing and dying. His spirit separates from his body to reach out longingly at her, and then fades out of existence. As Regina cries over Robin's body, Zelena returns, with Hades lying about defending himself against Robin after he wanted to kill Zelena. Hades encourages Zelena to kill her sister, but Zelena ultimately kills Hades, after Regina uses Robin's sacrifice as an example of true love; something that Hades has with Zelena and yet it's not enough to change him. At Robin's funeral, after Emma and her family have laid rose entwined arrows onto the casket, Regina walks up to have her turn. As Regina turns back to look at the crowd of mourners, Zelena arrives with her daughter. She notes to Zelena that Robin never got to name his child, to which the latter decides the most fitting name for her is Robin. Regina agrees with the name choice, before welling up in tears over the sentiment behind it, as Zelena offers a comforting hand on her shoulder. (\"Last Rites\")\n\nAt Robin's wake, Regina is still in a daze over her lover's demise. Snow and David come by to offer support, but Zelena assures them that she can look after her sister, as they both lost the men they loved. With Regina in the dark about Hook's recent return, Emma makes Killian wait outside while she goes in to break the news. Before she can, a tremor shakes the town, prompting a concerned Hook to rush in to Emma. Regina, despite being angered that Hook is alive as Robin remains dead, sets aside her emotions in favor of finding out the cause of the tremor. At the clock tower, the heroes discover Mr. Gold has tethered Storybrooke's magic into a piece of the Olympian Crystal, in an effort to wake a cursed Belle. When Emma suggests to Regina that she should take a break from the mission, Regina realizes Emma assumes she will revert to being the Evil Queen. Henry tries to stop the argument, which ends with Regina teleporting out to find Mr. Gold herself since Emma doesn't want her help. The next day, Regina arrives to the loft looking for Henry, who has stolen the crystal and left town to destroy it. When Mr. Gold suggests that destroying the crystal's magic will erase Storybrooke, Regina reluctantly allows Emma to join her after the latter provides a lead on Henry. Using GPS, they track Henry to Boston, only to find he left his phone on the bus to throw them off. An upset Regina chucks the phone and accidentally sets it on fire, which causes her and Emma to fear Mr. Gold will harm Henry since magic outside of Storybrooke is now possible. In another plan, Regina convinces Emma to provide blood in a locator spell. Tracking Henry to Neal's apartment in New York, Emma runs a laptop scan to find out where he and Violet went. Regina reads an unsent letter that Robin wrote to her, which makes her come clean about her struggle to curb her darker instincts. She tells Emma about how being good has made her suffer losses and that she has to live with the evils of her past, or risk giving into darkness again and losing her loved ones. Emma believes Regina will prevail, but the latter thinks being miserable either way is her fate. When the scan reveals Henry is at the Midtown Library, the women arrive to find him and Violet passed out, after Mr. Gold has taken the crystal. Henry convinces Emma that she was wrong for not believing in Regina, and he defends his decision to destroy magic because he doesn't want to lose either of his moms to magic. Regina uses Henry's blood to locate Mr. Gold, which fails because Mr. Gold has disabled magic. (\"Only You\")\n\nLeaving Henry and Violet to wait in the library, Regina and Emma pinpoint Mr. Gold after seeing a magic storm cloud above the Hotel D'or building. In a text from Granny, they learn their family have been pulled into a portal. Since magic is needed to rescue their loved ones, Regina distracts Mr. Gold with a fake alliance as Emma sneaks in to steal the crystal. Mr. Gold busts the women's plan and reveals he only needed Regina's hair as a link to Zelena in the other realm, where Belle is also trapped. With no more use for either woman, Mr. Gold prepares to hurl a fireball at them, but Henry arrives to absorb the crystal's magic into a replica of the Holy Grail. Only after this, Henry learns from his moms about why they needed the crystal. While Emma finds him, Regina and Mr. Gold approach the Dragon for help to locate their family. The Dragon agrees to help for Regina's sake, as he sees her struggle with darkness, and he encourages her to win. After the Dragon fails to open a portal to the other realm, he advises that they seek magic with the power of belief. Back at the fountain, Henry persuades his family to make wishes on pennies, which creates magic in the crystal. To get enough magic for a portal, he rallies a crowd of New Yorkers to make wishes, allowing his family to return. The night before going home, Snow suggests Regina can make a clean break from her darkness by facing the Evil Queen. By injecting herself with a serum, the Evil Queen separates from Regina, who rips out and crushes her darker half's heart. On return to Storybrooke, Regina releases the crystal's magic back into the town. When Hyde shows up, claiming the town is now his, Regina vows to be victorious against him. However, he causes her to have doubts, by telling her that the darkness within her is not so easily removed. Without Regina knowing, the Evil Queen has manifested again in New York, with plans of waging war against her. (\"An Untold Story\")\n\nWhen a dirigible appears in Storybrooke, Regina learns Hyde brought them from his realm. She and Emma combine powers to take out Hyde, but their magic has no effect on him. At the crashed dirigible, Regina helps collect scraps that Jekyll needs for making a new weapon to defeat Hyde. Regina goes home afterwards, finding Zelena moving in, since she previously invited her to live with her. She tells Zelena about Hyde, but instead of letting the redhead help, she asks her to stay home. Zelena tries to find the feather from Robin's arrow that Roland gave her to give to Regina, but it is lost. Regina tries to be understanding, however, it starts to bother her. Later, she seals her vault to keep Hyde out, and opens up to Snow about her problems with Zelena. Snow believes something else is bothering her, but Regina doesn't know what it is. As part of a ruse, Regina offers Jekyll to Hyde in return for his departure from town. Hyde taunts her about her inability to intimidate him, to which Regina calls off the deal before hurling a fireball at him. With Hyde momentarily stunned, Regina yells for Emma to use the baton on him, but Emma becomes distracted, allowing Hyde to begin strangling Regina. Emma snaps out of it in order to use the baton, which leads to Hyde's capture. Afterwards, Regina returns to her office for the first time since Robin died and cries over him. She admits blaming Zelena for Robin's death because she trusted her about Hades' changed ways. Zelena, in turn, is mad that Regina took advice from Snow about ripping out her darker self, rather than talking to her about it. Additionally, Zelena is upset that Regina removed a part of herself that is most like her, which Regina has nothing to say in defense of, to which Zelena declares she is moving out. Regina later tries to locate Robin's feather, but it doesn't work because, as Henry notes, she wants to find Robin when he's already dead. Henry gives her hope that Robin wasn't obliterated as Hades stated he was since villains will say anything to hurt people. During a chat, Regina asks Snow how she survived in the Enchanted Forest after losing everything, and Snow recalls keeping hope alive because Regina as the Evil Queen taught her that having hope is a choice. Regina talks about living as who she thought she was supposed to be, the Queen, but now, she wants to be someone else and has hopes that the life she has now will get better in the future. (\"The Savior\")\n\nThe morning after, Regina reassures the Untold Stories residents not to be afraid of having their stories told because she, like them, is getting a fresh start and they will face the unknown together. David and Snow receive a note from the Count of Monte Cristo, a person Regina admits she once hired to kill them. Regina decides to convince the Count to give up on the mission, and she also reveals that David and Snow already met the Count, Edmond, in the past when he became the couple's wine steward. She tries her best to persuade Edmond that he doesn't need revenge to be happy again, something she learned in her own life. Edmond instead tells her that though she set him on this path, not even she can stop him now. He throws his sword at her, with Regina freezing it in time, but after she picks up the weapon, he is gone. Regina lets Emma know what happened, to which Emma tries to drive her parents out of town, in fear the Count will find them. The car is repelled by a barrier at the town line, and Regina realizes the spell was created with ingredients from her vault. She suspects Zelena broke the blood magic seal on the vault, but Zelena denies any wrongdoing. After finding Charlotte's body, Regina discovers the true culprit is the Evil Queen, who not only made the barrier, but is also controlling the Count. Regina duels with Edmond to protect Snow and David, but she can't use magic because of the Queen's spell to weaken her powers. She pushes Edmond to fight the Queen's control and vows to save him when she couldn't save Charlotte, however, Edmond disarms her before moving on to David and Snow. With no defenses left, she chucks her sword at him, and he dies from the fatality. Regina is despondent in the aftermath of this, especially when the Queen reveals she orchestrated it to prove Regina can never be rid of her inner darkness. Sometime after this, Regina casts a protection spell on Snow and David's hearts to keep them safe from the Queen. Snow encourages her not to run from the Queen, and that they can outsmart her by thinking ahead of her. When Snow asks what the Queen meant by everyone having stories they don't want to be told, Emma's hand shakes, which both Snow and Regina notice. Emma later confesses to Archie about her suspicion that the cloaked enemy on her vision is Regina. (\"A Bitter Draught\", \"Heartless\")\n\nSuspecting Hyde knows why the Queen is still alive, Regina tries to get on his good side by offering some of her home-cooked lasagna, however, she finds his appetite for food has already been satisfied by the Queen. Hyde asks for his freedom if Regina wants his help, but when she is unwilling to pay the price, he taunts her about being beaten by her other self. She, Snow, and David ater watch Jekyll attempt to recreate the serum as a means to destroy the Queen. After the experiment fails, Regina becomes frustrated over the Queen being a step ahead of her, with Snow suggesting she should try to get into the mindset of how the Queen thinks. Regina then realizes the Queen may have turned Zelena against her and promptly leaves to find her sister. She frantically questions Zelena about whether the Queen came to her or not, but Zelena shushes her to keep her from waking up baby Robin. Regina spots a familiar looking rattle in Robin's crib, which confirms her suspicions. She insists the rattle should be returned to the Queen because the gift came with a price, but Zelena refuses. She asks Regina to stop judging her, while Regina explains that she's just trying to save her. Zelena scoffs, recalling Regina needed saving so badly that she ripped herself in half, and that if anyone is to blame, it's Regina. (\"The Other Shoe\")\n\nAfter discovering Hyde escaped from his cell, Regina and Jekyll join up with David and Emma before returning to the lab, where Jekyll continues to work on the serum. Emma receives news from Hook about Mr. Gold trapping Belle on the Jolly Roger to keep Hyde from going after her. To speed things up so they can defeat Hyde, Regina seeks out Mr. Gold's help to finish the serum. She finds him in the pawnshop and is surprised to see his new haircut, which she notes complement his eyes. She leads Mr. Gold back to the lab, only to learn from Jekyll that Hyde destroyed the serum, but luckily, Jekyll kept some of the serum in another vial as a precaution. Distrustful of Mr. Gold, Regina refuses to give him the vial and instead tells him to just use his magic on it. He then rips out Jekyll's heart as leverage against Regina to make her comply with pouring the serum onto the Dark One's dagger so he can kill Hyde. After getting what he wants, Mr. Gold tosses the heart back to Regina on his way out. Regina later tracks him down at the harbor, where he is standing over Hyde's corpse. She mistakenly believes the serum worked, however, Mr. Gold explains Hyde's demise was caused by Jekyll's death and that this proves an original must die in order for a doppelganger to die as well. As Regina contemplates this revelation, she also realizes that while Jekyll became separate from his darker side, his capacity for evil remained, and this holds true for herself too, meaning the darkness inside her could grow back at any time. She asks Emma to stop her if she ever becomes dark again, which Emma reluctantly agrees to do. (\"Strange Case\")\n\nDuring Regina's attempt to help Jasmine create a locator spell to find Aladdin, Emma is nudged by Archie, actually the Queen in disguise, into revealing a secret she's been keeping from her family. Emma admits to having a recurring vision of her own death, in which she is killed by a hooded figure, and that it is the fate of all Saviors to die. Regina learns that, out of Emma's parents, Hook and Henry, she is the only one not present in Emma's vision, this could possibly mean she is the person who kills her. Emma tries to defuse the tense situation by swearing the vision isn't her subconscious at work, but Regina lets the subject drop and decides to work on another spell to find Aladdin. In her vault, Regina concocts a special kind of locator spell, which will link Emma and Aladdin's Savior magic and allow Emma to pinpoint where Aladdin is. Regina joins her for the search, and they are led to a forgotten crypt, where Jasmine seemingly finds evidence that Aladdin has died. However, Aladdin turns out to be alive, and he gives shears to Emma as a way to prevent her own death. Later in the loft, Regina examines the shears and remarks about the irony of magic being so literal. After Snow and David return, Emma declares she won't use the shears to stop her own death, and instead, wants to find another way or accept that she is meant to die. (\"Street Rats\")\n\nTo rescue Archie, Regina confronts the Queen outside of Zelena's house, while Snow and David sneak in to release the cricket. Zelena is tipped off to the intruders because of baby Robin's crying, with the Queen prepared to incinerate the couple, however, Regina teleports in to save her friends and whisk them away. (\"Dark Waters\")\n\nWhen the Queen threatens to destroy the town with Acheron water unless David and Snow forfeit their hearts to her, Regina and the heroes learn from Mother Superior about a sapling that can defeat her, but they cannot risk the villains finding out. Regina, realizing the partnership between the Queen and Mr. Gold is more than just business, awkwardly admits that she and Rumplestiltskin always had a kind of chemistry around each other in the past, even though nothing ever came of it until now. To keep the villains busy, she writes to Zelena under the guise of the Queen and sends her into the pawnshop to discover a tryst between the Queen and Mr. Gold. In preparation for the Queen's imprisonment, Regina removes the blood magic seal from her vault, and Emma and Hook go there to clear out any dangerous objects. Mother Superior casts a spell to find the sapling, which brings Regina, Snow, and David to the woods, where Regina discovers a trapdoor leading to the underground. Snow and David retrieve the plant, but on the trio's way out, the Queen snaps it in half. Later at the cemetery, Regina and Emma prepare to attack the Queen with their magic, only for Snow and David to show up. Regina reluctantly removes the protection spell on their hearts at their request, and then, the Queen rips out their hearts. Rather than killing them, the Queen casts a sleeping curse on their hearts, causing Snow to immediately fall asleep. After the Queen hides Snow away, Regina, Emma, and Hook follow David to the woods to find her. They witness David uncursing Snow with true love's kiss, however, when she awakens, he falls victim to the curse's effects. (\"Heartless\")\n\nSeeing Snow's misery over David's current state, Regina almost goes to confront the Queen herself, but Emma convinces her it won't do any good and that she needs to be there for Henry. She and Emma form a plan to entrap the Queen inside an enchanted mirror, with Henry agreeing to act as bait to lure out the Queen. However, the Queen is one step ahead of Regina, as she already switched out Regina's mirror with a fake, allowing her to imprison both women inside the actual mirror. Regina and Emma nearly gain Henry's attention when he hears them calling him, but the Queen draws him away before he realizes anything is wrong. They meet the Dragon again, as he was also confined in the mirror by the Queen, and he shows them a portal that a previously trapped Sidney was working on. As Regina and Emma work on repairing one of the mirrors, the Queen forces the Dragon to morph into his dragon form and orders him to kill them. The women hide behind a pillar, while the Queen gives Henry a hammer to smash the Dragon's heart to save his family. Going by Regina's suggestion that the Dragon's fire breath can break the mirror and allow them to escape, Emma prepares to bait the Dragon since she's fated to die anyway. Regina insists on being the sacrifice, revealing she fears raising Henry alone knowing the Queen is a reminder of the terrible mother she could've been, but Emma assures her it won't happen as long as she is there to help her. The two lure out the Dragon together, and from Henry's side, he smashes the mirror, just as the Dragon's fire breath hits the other side. As the mirror explodes, Emma and Regina are thrown out to safety. Later that night, the two watch Henry and Violet dance in the diner, with both mothers feeling relieved that their son will be all right, despite the worries each of them had about him growing up. (\"I'll Be Your Mirror\")\n\nWhen one of the nuns is affected by Mr. Gold's aging spell, Regina goes to Zelena's farmhouse to look for magic that might help reverse the enchantment. She arrives there just as the Queen is in the midst of trying to kill Zelena, and uses her own heart to make the Queen stop. Regina squeezes the heart to prove she means business, with both herself and the Queen being affected. Upon learning the Queen went after Zelena on Mr. Gold's orders, she suggests that it was an empty promise and that the hole in the Queen's heart made her so desperate to believe him. After Regina heals her sister's injury, Zelena thanks her for saving her and expresses regrets about not being the one to reach out to apologize to her. However, Regina admits she didn't come to the farmhouse to apologize and had wanted to sneak in to look for magic. Zelena becomes upset at her for this and questions why she even saved her. Regina explains she did because it was the right thing to do as a hero, even with people who have hurt her in unimaginable ways. Realizing her sister still blames her for Robin's death, Zelena asks why forgiveness and redemption aren't possible for her when Regina went down the same path of growing and changing into a different person. Regina declares that Zelena is not her, and thus, she cannot ever forgive her, even if she can go as far as to pity her, hate her, or spare her life. (\"Changelings\")\n\nAfter Emma finds the sword from her vision, she, Regina and Hook head to the vault, in the hopes of learning more about the weapon, but they run into the Queen at Robin's grave. The Queen claims Robin's death was the best thing to happen for herself and Regina as it was this that spurred Regina into splitting herself. Regina prepares to retaliate with a fireball, but the Queen snuffs it out, advising that the only way to hurt her is to harm herself. When taunted by the Queen, Emma lunges at her with the sword, surprisingly injuring her without Regina being affected too. Regina joins Emma, David and Hook to track down the Queen to finally take her down with the sword, but they are lured into the Queen's trap when they attempt to rescue Jasmine from her. With the genie lamp, whose genie is now Aladdin, the Queen grants Emma's wish of having never been the Savior. Following this, David and Hook blame one another for Emma's disappearance, with Regina stopping them from arguing after realizing the Queen wants them to turn against each other. At the mayor's office, Regina confronts the Queen, who tries to win over her with a toast in honor of both of them. The Queen reminds her that she cursed Snow and banished Emma from Storybrooke, the two things Regina once sought after. Unimpressed, Regina explains that, while they are indeed one and the same person, this also means they share ownership of the lamp, to which she uses the second wish to be sent to where Emma is. She ends up in the Wish Realm, an alternate world where Emma grew up as a princess and the Queen was defeated long ago by Snow and David without the curse being cast. When Regina cannot persuade Emma that this world is fake, she is advised by Rumplestiltskin into taking on the role of a villain again in order to give Emma a reason to be heroic. As per their deal, she frees him from his prison, and he promises to provide her with a magic bean for returning home. Regina, donning her Evil Queen disguise, interrupts Henry's knighting ceremony to proclaim her intentions of destroying them all and implies only a hero like Emma can defeat her. Emma simply begs for mercy, so to push her further, Regina kidnaps her parents. When Emma surrenders by forfeiting the key to the kingdom, a frustrated Regina rips out and crushes her parents' hearts to make her remember her true self, to no avail. Only when Henry tries to kill Regina to avenge his grandparents, with Regina refusing to hurt him, Emma snaps out of it and freezes Henry with magic. Afterward, Regina and Emma get the bean from Rumplestiltskin and open a portal, but before they can jump in, they dodge an arrow shot at them by none other than Robin Hood. Distracted by the sight of him, Regina begins walking towards him, despite Robin demanding their money and jewels. Emma calls her back, but Regina doesn't listen, and eventually, the portal closes, leaving them stranded in this realm. (\"Wish You Were Here\")\n\nStill dazed over seeing Robin, Regina forfeits her necklace to him before he runs off as riders approach. She and Emma hide from Henry and some soldiers who are looking for them, and later seek out Pinocchio, who agrees to make another magic wardrobe to help them go home. Regina slips away on her own, but not before leaving a note for Emma, telling her to do what needs to be done, but that she herself can't leave until she talks to Robin. At the tavern where pixie dust once led her to Robin, she walks in to ask if he is happy with his life, and Robin claims he is because he lives at his own whim without having to answer to anyone. She takes this to mean this version of Robin is better off without her, but as she leaves, he questions why she cares about his happiness. Before Regina can tell him, the Sheriff of Nottingham bursts in, immobilizing Regina's magic with a cuff, before capturing both her and Robin. While imprisoned, Robin laments about dying with nothing and no accomplishments in life. Regina argues against this by mentioning his noble and heroic deeds, but in doing so, she learns the Robin she knew is nothing like this Robin, who steals for himself rather than to aid the poor. She further discovers Maid Marian's early death in this realm was the reason he never changed his selfish ways. The pair is saved by Rumplestiltskin, only to become his prisoners, because of the Dark One's desire to punish Regina for the Queen causing Belle's death. During this, Regina reveals to Robin about the other Robin's fate. Robin picks the lock to free both of them and gifts her a feather from his lucky arrow. Regina is fearful of the consequences if Robin comes with her to Storybrooke, but Emma convinces her to choose her own fate instead of being afraid. When Robin seemingly doesn't make it through the wardrobe, Regina is crushed, however, she is elated when he does arrive and hugs him, letting her emotions get the better of her. They reach the town in time to see Emma fighting Gideon, who freezes them in place. After Emma defeats Gideon, the others are shocked by Robin's appearance, with Regina and Emma briefly explaining where he came from. (\"Tougher Than the Rest\")\n\nThat same night, Regina joins Emma, David, Henry, and Hook in celebrating the defeat of Gideon and their unity as a family. At some point after this, she gives Emma a box of potions to aid in possibly breaking David and Snow's joint curse. The next morning, Regina checks on Robin, who spent the night in one of her guest rooms. She sheepishly turns off an alarm clock, which woke him up earlier, before handing over clothes for him to change into. Upon learning about Robin, Snow cautions Regina about the man, as he may look like the Robin they know but he isn't him. Regina wants to give Robin a chance at a fresh start since he was miserable in the other realm, and that perhaps she could be part of his new life. Snow amicably agrees that she hopes things work out in her favor. Later, as Robin is looking through the storybook, he expresses interest in hearing about Regina and the other Robin's story, just as the doorbell rings. Regina opens the door to an irate Zelena, who threatens to hurt Robin if he comes anywhere near her daughter. Once Zelena is gone, Regina discovers Robin is missing and the storybook open to a photo of Robin and the Sheriff. Realizing he went after Keith, she stops Robin from killing his nemesis by teleporting the man away. Regina then takes Robin to her vault, where she owns up to her own dark deeds when Robin criticizes her for judging him. After healing Robin's hand, she comes clean to him about her Robin's children and the fact her sister is the mother of one of them. Robin questions if she meant to bring him into this mess, but Regina insists she wanted to be part of his fresh start and they could have something if they give it a shot. Robin tests out her theory by kissing her, and Regina later confides to Snow that it was like kissing a photograph. Regina then wonders why Robin could come to Storybrooke if it wasn't for her sake, with Snow suggesting perhaps there is no reason and that Robin's existence outside the Wish Realm is proof something in him is real. (\"Murder Most Foul\")\n\nFinding Robin in the woods, Regina apologizes to him for putting pressure on him to be like the Robin she knew. He suggests that he's not yet adjusted to the town, which Regina offers him help with, but he declines and instead agrees to meet with her later at night. She later discovers the box missing from her vault, and teleports to the town line, where she catches Zelena and Robin attempting to use a potion to leave Storybrooke. Upset that Robin lied to her, Regina asks him if he was serious about finding meaning in his life. Robin insists he was until coming to Storybrooke, a place where he's reminded constantly of someone who he is not, and that he cannot live up to the legacy of a man who died for her. The barrier remains even after Robin uses the potion, which Regina explains is because even she hasn't figured out the right ingredients to break the Evil Queen's protection spell. Regina tries to be sympathetic to Robin's desire to leave, while also cautioning him that the world outside of Storybrooke is different from what he's dealt with, to which Robin attests he can handle himself. Regina agrees and decides she will do everything in her power to find a way to remove the barrier so he can go. Later at the vault, Zelena returns the caged Queen to Regina and apologizes for going behind her back by helping Robin. This time, however, Regina owns up to the situation being entirely her fault because of her bad decisions in choosing to rip away her darker self and bringing Robin to Storybrooke. She realizes that separating her darkness doesn't erase the weight of her past as the Evil Queen, and then goes to remove the cover on the cage, only to see it is empty and the serpent has since escaped. (\"Ill-Boding Patterns\")\n\nWith Zelena, Regina goes to the loft to tell Emma, Snow, and Henry about the Queen's escape. She is surprised and elated for Emma after learning she and Hook are now engaged and gives her a congratulatory hug. After Henry receives Page 23 from the Queen, Regina immediately suspects her other half is holding Robin as a hostage to bait her. Emma offers to go in her place because she blames herself for persuading Regina into bringing Robin to Storybrooke, but Regina insists on finishing things with the Queen herself before anyone else she cares about gets hurt. As soon as Regina enters the mayoral office, the Queen teleports Robin away and then uses the shears on herself and Regina, which severs their link to each other. During the duel, the Queen expresses loathing and disgust over her better half's attempt to fill the darkness in herself with love and friendship. After binding her doppelgänger to a wall, Regina ferociously declares that the Queen will never again be able to take away the good in her life, before ripping out the Queen's heart. Regina moves to crush the heart, only to catch her own reflection in broken mirror shards, as she is reminded of how much she hated herself as the Evil Queen. Deciding to choose love over hate, pulls out her own heart to allow both her and the Queen's hearts to absorb equal amounts of light and dark before returning the Queen's heart. In the aftermath, Regina is relieved to learn Robin is safe in his original realm. When asked by the Queen if she regretted not taking a chance with the original Robin all those years ago, she denies it because had she not made that choice, she would not have the life she has now. Regina unsuccessfully tries to convince her friends and family that the Queen has changed for the better, though the Queen also makes things right by apologizing to her loved ones. In the end, Henry uses the Author's pen to provide the Queen with a fresh start in another realm. (\"Page 23\")\n\nTo help Emma as she copes with Hook leaving her, Regina takes a break from researching how to break the sleeping curse and invites Emma to a girls' night out with her and Snow at a new pub called Aesop's Tables. Emma declines the invitation, but Regina and Snow lure her there by calling in about a fake fight at the pub. Throughout the night, Regina tries to get Emma to open up emotionally about Hook's departure with little success. The two begin intervening when a drunk Snow confronts a group of vikings for attempting to leave without paying but then watch humorously from the sidelines as Snow challenges them to best her in a dagger throwing contest and whoever loses has to pay everyone's tab. Later, Regina and Snow comfort Emma when she finally allows herself to cry over Hook abandoning her when things got tough between them. (\"A Wondrous Place\")\n\nAfter cleaning up the Queen's messes, including undoing the town barrier and freeing the Dragon from the mirror realm, Regina continues to have little progress with breaking the sleeping curse. Henry offers to assist her, so she sends him to grab some ingredients from Emma's shed. As Regina tells him to get some tongue of newt, Henry begins writing it down, only to be pulled into a trance-like state as his Author powers compel him to scribble down a series of symbols before passing out. When Henry wakes up, he and Regina go to Isaac, who is still locked up in the psychiatric ward, for answers. Isaac, wanting out of his prison, only agrees to help if Regina gets him a sports car so he can return to New York as well as Broadway tickets to Hamilton. Regina flatly refuses and walks out, but Isaac gets her attention by admitting that Henry's Author powers are taking over him and that the frequency and intensity of his trances will get worse. Desperate to help her son, Regina procures an old truck for Isaac, who accepts the vehicle in his hurry to leave town. The former Author then directs Regina and Henry to the storybook's final chapter, which will happen soon when the Savior fights her final battle. (\"Mother's Little Helper\")\n\nWhile Emma and Henry research the symbols, David pressures Regina to use her sleeping curse antidote on him and Snow so they can be with Emma for the final battle, despite that she hasn't had enough time to test it yet. Regina consents, and with Zelena's help, the both of them pull out Snow and David's darkened heart halves, immerse them in the potion to eliminate the dark spots in them, before placing them back into each person's chest. However, it doesn't work, as Regina soon realizes the Queen put a fail-safe to keep the curse from being broken and that the couple will be permanently asleep by the end of the day if the curse isn't lifted. Later on, the heroes discover pixie flowers, which have the ability to reunite those who share true love, may be Snow and David's chance to undo the curse. Regina assists with locating the flowers, but ultimately, it is Snow's tracking skills that lead Snow and Emma to the site of the flowers, where they retrieve one. After Regina has collected enough of the flower's dust for the antidote in a vial and given it to Emma, Hook's shadow comes to deliver a wand to allow Emma to banish the Black Fairy back to the Dark Realm. With Snow's blessing, Emma uses the potion to rescue Hook from Neverland, and after Emma and Hook return home, Regina suggests another way to dilute the joint curse if they and some of the townspeople ingest a liquid form of the sleeping curse, which may weaken the curse considerably, allowing Snow and David to wake up. At the mayor's office, Regina presents this plan to the townsfolk by telling them of a time during the first Dark Curse when Snow and David chose to sacrifice their own happiness for everyone's sake, and this time, she hopes they can return the favor. After each person has had a drink, the curse causes everyone to fall asleep, but following Snow and David's awakening, Regina and the other people present also wake up. (\"Awake\")\n\nFrom Zelena, Regina learns the Black Fairy offered her an alliance and is currently hiding somewhere in the mines. Zelena is ready to kill the fairy on her own, while Regina and the others want to find the other half of the wand that Tiger Lily provided. Despite Zelena's claims about being more powerful than her, Regina forbids her from going. Emma agrees that they'd be better off having a weapon against the Black Fairy, to which a frustrated Zelena leaves after deciding she wants no part in their plans. Regina takes the wand back to her vault to create a locator spell to find the other half but goes to get a missing spell ingredient from the pawnshop, where she sees Belle babysitting baby Robin. Realizing Zelena disobeyed her, she tracks her down in the mines and tries to stop her, insisting it's for Zelena's own good. Zelena, upset at Regina's sudden concern for her, criticizes her having spent so much time blaming her for Robin's death when she herself gave up Hades just to save her only to be shunned by her. When Zelena still refuses to give up on her mission, Regina tosses her into a wall, which triggers a quake that seals them in. The two sisters continue arguing, with Regina asking why she needs to be the best, and Zelena proclaims that it's because she is the best. Deeper in the mines, the Black Fairy arrives to scrutinize Regina, noting she was the one to cast her Dark Curse, and the failure she made of it. Regina prepares to attack her in retaliation, but the fairy hurls her into a wall, knocking her out. While Gideon guards Regina, Zelena pursues the Black Fairy, unknowingly following her into a cave of light fairy crystals, where the Black Fairy uses Zelena's magic to imbue the crystals with dark magic. Regina reaches the cave to intervene when the Black Fairy chokes Zelena, but again, she is flung aside. After the Black Fairy releases a blast from the crystals, she teleports the sisters out of the mines. Above ground, Regina has had enough of Zelena's arrogance and tells her to go back to Oz where she can be as powerful as she wishes to be. Regina's stance against her softens when Zelena apologizes for her actions and agrees to use the Crimson Heart to remove all her magic, which will, in turn, untether her magic from the crystals and revert them to light magic. In the aftermath of Zelena losing her magic, Regina praises her for being strong and then envelopes her in a hug. Emma proposes getting Mother Superior to help them collect more crystals from the mines, to which Regina mentions unsuccessfully trying to get ahold of the nun, however, Zelena reveals she saw her body in the pawnshop. Later, Regina is present as Emma uses a fairy crystal to restart Mother Superior's heart. (\"Where Bluebirds Fly\")\n\nAt her house, Regina notices Zelena struggling to put together a baby crib by hand. Zelena feels useless without her magic and questions how she will even be able to protect Robin when the final battle comes, to which Regina teaches her to drive so she'll have an escape plan. Regina sits in the front passenger seat as Zelena attempts to drive and ends up slamming the brakes too late before the car hits some garbage cans. When Zelena wonders what is the point of learning how to drive, Regina reveals her wish for her sister to take Henry to New York when the final battle occurs. Zelena is touched by her sister trusting her enough to raise Henry, to which Regina cheekily replies that Henry would be the one raising her. Before Zelena can have another go at driving, Regina gets a call from Snow asking her to decipher Mother Superior's clue about the other wand half being at \"heart of Storybrooke\". Regina suggests that it must be a place that has sentimental value to the townspeople, which Snow guesses is the diner. Zelena offers to drive her sister there, but Regina declines and teleports away on her own. Interrupting Granny during the diner's lunch hour, Regina is in the middle of searching behind the counter when David, Snow, and Hook arrive to help her look. After David and Hook discover the wand hidden under the jukebox, she asks for it, however, both Hook and Snow express skepticism about whether she is the real Regina or the Black Fairy in disguise. This doubt is settled when the Black Fairy shows up to demand the wand from them, to which Hook gives it to Regina, who challenges Fiona to a fight. Regina teleports the both of them outside, where the Black Fairy blasts her, causing her to be propelled backward a few feet as she ends up on one bended knee. The fairy, while preparing to hit her with another surge of magic, is hit by Zelena's car and sent flying before she teleports away. With the mended wand, Regina heads back to the pawnshop as Mr. Gold, Emma, and Gideon have just returned from the dream world. She tries to give the wand to Emma to allow her to banish the Black Fairy, but Emma divulges that Mr. Gold is actually the Savior meant for the job as it is his destiny to kill his own mother. (\"The Black Fairy\")\n\nAt Emma's house, Regina observes the bride-to-be admiring Snow's old wedding dress before it is dyed black by none other than the Black Fairy, who is still alive after Mr. Gold lied about killing her. When Emma refuses to forfeit her heart to her, the Black Fairy directs the heroes to the clock tower to see what she has in store for them. There, Regina finds a cloud of dark fairy dust that will unleash as Dark Curse at six o'clock, which is notably the same hour as Emma and Hook's nuptials. With Zelena's encouragement, Regina comes up with a solution to stop the curse by isolating the time freezing component in it. She bottles it in a potion and later presents it to Snow and David, only for Mr. Gold to steal it and use it on them, causing them to become paralyzed. The Black Fairy uses their frozen bodies to weaken Emma's resolve so she will forfeit her heart to her, but it is with Henry's help that Emma unlocks a song inside herself and uses the power in it to free them. After the Black Fairy retreats, the wedding commences, with Regina sitting beside Henry as Emma and Hook exchange vows before being married by Archie. Zelena and Regina celebrate in the aftermath by singing together with everyone about a happy beginning , but by the song's end, the clock strikes six o'clock, causing the curse smoke to pour out of the shattered clock face.", "images": ["https://vignette.wikia.nocookie.net/onceuponatime8042/images/6/61/IconSeattle.png/revision/latest?cb=20171004190902", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/1/15/IconUnderworld.png/revision/latest?cb=20151229212845", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/a/a1/IconNeverland.png/revision/latest?cb=20141103231722", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/c/c3/701ImRoni.png/revision/latest/scale-to-width-down/350?cb=20180913200024", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/7/7c/IconRoyalty.png/revision/latest/scale-to-width-down/20?cb=20130623020037", "https://slot1-images.wikia.nocookie.net/__cb1586975593232/common/extensions/wikia/WikiaBar/images/wikiabarIcon.png", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/f/f2/IconS6.png/revision/latest?cb=20160303213144", "https://vignette.wikia.nocookie.net/rockosmodernlife/images/a/ad/Static_Cling_Netflix_banner.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20191126160900", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/2/24/IconS5.png/revision/latest?cb=20160303213523", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/1/17/IconWonderland.png/revision/latest/scale-to-width-down/20?cb=20150405040845", "https://vignette4.wikia.nocookie.net/onceuponatime8042/images/8/89/Wiki-wordmark.png/revision/latest?cb=20160205180926", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/4/44/622LookingAtHenry2.png/revision/latest/scale-to-width-down/350?cb=20190922024151", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/a/a2/TwitterLogo.svg/revision/latest/scale-to-width-down/19?cb=20180412232045", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/b/b8/IconWR.png/revision/latest?cb=20161205174800", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/4/4a/IconFA.png/revision/latest?cb=20130630234506", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/0/0c/IconCamelot.png/revision/latest/scale-to-width-down/20?cb=20150405035723", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/6/6f/IconNetherworld.png/revision/latest?cb=20140405200856", "https://vignette.wikia.nocookie.net/xavier-riddle-and-the-secret-museum/images/9/97/N2losLW-asset-kids-mezzanine1-16x9-N70Tdc3.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20190910004306", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/8/8d/IconDW.png/revision/latest?cb=20170423101730", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/4/45/IconCharacter.png/revision/latest?cb=20140110065522", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/e/e6/IconBook.png/revision/latest?cb=20140405195048", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/1/1e/IconNEF.png/revision/latest?cb=20171004192056", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/6/68/IconS1.png/revision/latest?cb=20130630045523", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/a/ab/IconMoveProtect.png/revision/latest/scale-to-width-down/20?cb=20130622184707", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/8/85/IconMagic.png/revision/latest/scale-to-width-down/20?cb=20130623015023", "https://vignette.wikia.nocookie.net/messaging/images/c/cf/Avatar6.jpg/revision/latest/scale-to-width-down/150?format=jpg/revision/latest/scale-to-width-down/50?format=jpg", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/3/3b/IconEF.png/revision/latest?cb=20140110082215", "https://vignette.wikia.nocookie.net/letsgoluna/images/c/cd/Erik-Luna-article-2-copy.png/revision/latest/zoom-crop/width/100/height/56?cb=20200327133046", "https://vignette.wikia.nocookie.net/messaging/images/1/19/Avatar.jpg/revision/latest/scale-to-width-down/50", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/c/c3/IconOUAT.png/revision/latest?cb=20131015225334", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/2/26/Broom.png/revision/latest/scale-to-width-down/75?cb=20120524000248", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/b/b4/302InThatCase.png/revision/latest/scale-to-width-down/350?cb=20161216042410", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/0/09/IconS4.png/revision/latest?cb=20140406233239", "https://vignette.wikia.nocookie.net/messaging/images/c/cf/Avatar6.jpg/revision/latest/scale-to-width-down/50?format=jpg", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/e/ea/IconS2.png/revision/latest?cb=20130630051355", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/e/eb/IconWBM.png/revision/latest?cb=20161114224702", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/4/42/Icon19CF.png/revision/latest?cb=20161008222644", "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/f/f3/IconStorybrooke.png/revision/latest/scale-to-width-down/20?cb=20150217162434", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/4/4a/IconS7.png/revision/latest?cb=20170512153503", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/4/49/IconLWM.png/revision/latest/scale-to-width-down/20?cb=20130622182859", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/a/a3/IconFemale.png/revision/latest/scale-to-width-down/20?cb=20130624045934", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/f/f2/IconS3.png/revision/latest?cb=20130630052409", "https://vignette.wikia.nocookie.net/onceuponatime8042/images/c/c3/701ImRoni.png/revision/latest?cb=20180913200024"], "top_img": "https://vignette.wikia.nocookie.net/onceuponatime8042/images/c/c3/701ImRoni.png/revision/latest?cb=20180913200024", "keywords": [], "authors": [], "canonical_link": "https://onceuponatime.fandom.com/wiki/Evil_Queen", "title": "Evil Queen", "meta_data": {"viewport": "width=device-width, user-scalable=yes", "generator": "MediaWiki 1.19.24", "keywords": "Once Upon a Time Wiki,onceuponatime247,Evil Queen,Seattle,Evil Queen (Serum),Cecaelias,Lana Parrilla,Ava Acres,Evil Queen/Gallery,Evil Queen (Wish Realm),United Realms,Roni's,Tiana's Palace", "description": "Regina Mills, formerly known as the Evil Queen, currently known as Roni, also known as the Good Queen, and briefly as Wilma, Ursula and the Eighth Witch, is a character on ABC's Once Upon a Time. She débuts in the first episode of the first season and is portrayed by starring cast member Lana...", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://onceuponatime.fandom.com/wiki/Evil_Queen", "title": "Evil Queen | Once Upon a Time Wiki | Fandom", "description": "Regina Mills, formerly known as the Evil Queen, currently known as Roni, also known as the Good Queen, and briefly as Wilma, Ursula and the Eighth Witch, is a character on ABC's Once Upon a Time..."}, "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "Once Upon a Time Wiki", "title": "Evil Queen", "description": "Regina Mills, formerly known as the Evil Queen, currently known as Roni, also known as the Good Queen, and briefly as Wilma, Ursula and the Eighth Witch, is a character on ABC's Once Upon a Time. She débuts in the first episode of the first season and is portrayed by starring cast member Lana Parrilla and guest star Ava Acres. She is the main reality version of the Evil Queen (Wish Realm). The Evil Queen is based on the queen from the fairytale, \"Snow White\" and from the Disney film Snow...", "url": "https://onceuponatime.fandom.com/wiki/Evil_Queen", "image": "https://vignette.wikia.nocookie.net/onceuponatime8042/images/c/c3/701ImRoni.png/revision/latest?cb=20180913200024"}, "apple-itunes-app": "app-id=951117889, app-arguments=https://onceuponatime.fandom.com/wiki/Evil_Queen"}, "movies": [], "publish_date": null, "source": "http://onceuponatime.wikia.com", "summary": ""}