{"url": "https://web.archive.org/web/20121221015559/http://west.congressnewsletter.net:80/common/mailings/index.cfm?id=190", "text": "Dear Patriot,\n\nGreetings to our constituents, fellow Floridians, and indeed all Americans, it is time to prepare our weekly update for dissemination.\n\nToday is the 71st Anniversary of the attack on US Naval Base, Pearl Harbor which truly marked our entry into World War II. I can still remember my dad sharing with me his feeling when he heard about this attack on the radio. Of course, he would go forth and serve in the US Army during World War II in the European Theater of Operations (ETO).\n\nLittle did my dad realize at the time, that he was beginning a legacy of service to our nation that has now spanned four generations. My dad was a member of that “Greatest Generation” and today his grandson, my nephew, carries that honor to this day.\n\nAs with the aftermath of Pearl Harbor, America has, and always will, produce the caliber of men and women who stand as guardians for our nation’s honor. These are men and women who have answered the call then and continue to do so now.\n\nTomorrow many in our nation will watch the next generation of these men and women as “America’s Football Game” takes place, Army vs. Navy. I wonder how many of these young men and women have relatives who were at Pearl Harbor, or served in World War II?\n\nI am proud to know that my own godson, Midshipman John Melvin Hendricks (that rascal who joined the Navy) will be taking that field tomorrow, his second year.\n\nSo as we remember Pearl Harbor today, let us never forget those who will stand and answer the call to arms to protect this Republic, yesterday, today, and tomorrow.\n\nAnd in speaking of those who serve, I was angered by the developments this week surrounding Army Major Nidal Hasan who three years ago shot 43 soldiers and Department of the Army Civilians, killing 13. An Army appellate court decision removed the current assigned judge from the case citing that he was not impartial. Furthermore, the court backed the assertion that Major Hasan did not have to be forced to shave his beard.\n\nIt just appears again that we are placating and playing the game of political correctness. It is horrific enough that we have classified this terrorist attack as “work place violence” but consider the continued disappointment of those who lost loved ones on that day… for them, it will always be a day which shall live in infamy.\n\nThis week we voted in the House of Representatives to remove the word “lunatic” from federal law. However, that does not mean there isn't plenty of lunacy going on in the workings of the federal government!\n\nFurther, I find it interesting when media pundits and talking heads ask the disturbing question, “What will America do if Bashar al-Asad uses chemical weapons in his people?” I would have hoped it would never get to the point of his feeling empowered to use those weapons. It just seems we continue to take a defensive posture reacting to events.\n\nIf we had done as military generals on the ground had suggested in Iraq and retained a viable and credible military presence in the region, we could have precluded this. Instead we now have Iran transiting across Iraq to support Asad… and continuing to support terrorist organizations such as Hezbollah, Hamas, and Islamic Jihad.\n\nThe Obama Administration was in such a rush to demand former Egyptian President Hosni Mubarak step down. Why not the same vigor when it comes to Mohammed Morsi?\n\nI also recall the Obama Administration supporting a Marxist/Socialist President in Honduras and not supporting the movement in Iran against Mahmoud Ahmandinejad.\n\nConfusing? Just imagine what our allies are thinking.\n\nAnd what happened in Benghazi? America must never stop asking that question, regardless of what the mainstream media wants to hide. Losing an Ambassador, a Foreign Service officer, and two former US Navy SEALS must never EVER become the new normal.\n\nToday, we received the monthly jobs report for November, with 7.7% unemployment and 146,000 jobs created. On the surface it is good news. However, one step beyond the superficial, we realize this is still an economy limping along.\n\nFirst, the previous job creation numbers from the months of September and October were revised downward by 50,000 respectively. Second, the unemployment rate dropped due to another 350,000 Americans dropping out of the labor force. This means we still have a labor force participation rate hovering at 63.6%, which has and continues to be a record low. At this rate, we could theoretically achieve an unemployment rate of zero if everyone just quit working altogether.\n\nFinally, our U6 computation rate remains dangerously high, due not only to 12 million unemployed Americans, but also a little over 8 million underemployed Americans.\n\nCombined with a fragile economy where the US Federal Reserve is printing money in order to cover a monthly $40 billion mortgage debt, America is hardly out of the woods.\n\nThese simple facts just reinforce the need to have sound fiscal, tax, and regulatory policy -- not politics -- that will incentivize economic growth and wealth expansion. The last thing the private sector and job creators need worry about is more confiscatory economics masquerading as viable solutions to a serious fiscal problem.\n\nWashington DC spends too much, and sending this Administration more American taxpayer dollars is not the answer. It is mathematically impossible to tax “the rich” enough to make a dent in our debt. We must be talking about where to reduce spending first. And why is it that only taxpayers, not the federal government, are expected to “share the burden?”\n\nThis is my final weekly update from our Congressional office, but it is by no means my final weekly update... When one door closes, another opens and we shall continue to advocate for truth, the restoration of this Republic, and promote Constitutional conservative principles in the New Year.\n\nIt has been my honor to serve as the Representative of the People of Florida’s 22nd Congressional District. The fight for our Constitutional Republic has truly begun and I will be on the frontline.\n\nMay everyone have a wonderful holiday season and may God bless the United States of America.\n\nSteadfast and Loyal,\n\nLegislative Update:\n\n-This Week\n\nCoast Guard Authorization—On Wednesday, the United States House of Representatives passed legislation to authorize appropriations for the U.S. Coast Guard (USCG) through Fiscal Year 2014 and for the Maritime Administration through fiscal year 2013. H.Res.825, Providing for the concurrence by the House of Representatives in the United States Senate amendments to H.R. 2838, with an amendment, passed by voice. The amended Coast Guard authorization would authorize$17.34 billion for Coast Guard operations and $296 million for the national security aspects of the Maritime Administration. H.R. 2838, the Coast Guard and Maritime Transportation Act of 2011, originally passed the House of Representatives in November, 2011. That bill passed the United States Senate with an amendment in September, 2012.\n\n- Next Week\n\nThe United States House of Representatives will meet next week on Tuesday, December 11, for legislative business. The House will consider a number of bills under a suspension of the rules throughout the week. Last votes for the week are now expected on Thursday, December 13 (this is a change from the announced calendar). Also, in a change to the official calendar, the House of Representatives is now expected to be in session the week of December 17.\n\nHighlights of the Week:\n\n- Mon, 3 Dec; presented the USSOUTHCOM Colors, delivered blessing, and gave a short address to open the Annual Caddy for the Cure golf tournament and Wounded Warrior recognition at TPC Eagle Trace in Coral Springs; attended the Jewish Institute for National Security Affairs (JINSA) annual Awards dinner.\n\n- Fri, 7 Dec; 71st Anniversary of the attack on Pearl Harbor, a “day which shall live in infamy;”attended Memorial service for a supporter and dear friend, Warren Maretsky, who unexpectedly lost his life this week. Warren was a great man, husband, and father who will be sorely missed, especially at the morning gatherings at Pomperdale Deli.\n\n- Sat, 8 Dec; will watch America’s football game, Army-Navy, praying for an Army victory, we sure could use it… GO ARMY, BEAT NAVY; traveled over to Tampa to be the keynote speaker for the annual United States Army St. Barbara’s Day Dining-Out and Ball.\n\n- Sunday, 9 Dec; will participate in the Annual South Florida President’s Council (SFPC) Christmas Toy Run motorcycle ride in Broward County.", "images": ["https://web.archive.org/web/20121221015559im_/http://west.congressnewsletter.net/images/allensenewsletter_img.jpg", "https://web.archive.org/web/20121221015559im_/http://west.congressnewsletter.net/common/images/transparent.gif", "https://web.archive.org/web/20121221015559im_/http://west.congressnewsletter.net/images/facebook_top.jpg", "https://web.archive.org/web/20121221015559im_/http://west.congressnewsletter.net/images/youtube_top.jpg", "https://web.archive.org/web/20121221015559im_/http://west.congressnewsletter.net/common/images/email.png", "https://web.archive.org/web/20121221015559im_/http://west.congressnewsletter.net/images/footer.jpg", "https://web.archive.org/web/20121221015559im_/http://west.congressnewsletter.net//images/user_images/allen_sig.jpg", "https://web.archive.org/web/20121221015559im_/http://west.congressnewsletter.net/common/images/houseSeal.png", "https://web.archive.org/web/20121221015559im_/http://west.congressnewsletter.net/images/repwest_header.jpg", "https://web.archive.org/web/20121221015559im_/http://west.congressnewsletter.net/images/twitter_top.jpg", "https://web.archive.org/web/20121221015559im_/http://west.congressnewsletter.net/common/images/rss.png"], "top_img": "https://web.archive.org/web/20121221015559im_/http://west.congressnewsletter.net/common/images/houseSeal.png", "keywords": [], "authors": [], "canonical_link": "", "title": "Congressman Allen West : Final Weekly Wrapup", "meta_data": {"title": "Final Weekly Wrapup", "description": "Dear Patriot, Greetings to our constituents, fellow Floridians, and indeed all Americans, it is time to prepare our weekly update for dissemination. Today i...", "og": {"title": "Congressman Allen West : Final Weekly Wrapup", "description": "...", "image": "https://web.archive.org/web/20121221015559im_/http://west.congressnewsletter.net/common/images/houseSeal.png"}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}