{"url": "www.visitbritain.com/us/en/ghosts-past-5-haunted-royal-residences", "text": "The British royal family are a lot gentler today than in days gone by. Many historic royals led explosive lives that revolved around death and controversy, and the palaces they called home bore witness to their dramatic intrigues. Perhaps as a result of these times, todays palaces are rich in ghost stories and sightings. Here are five royal residences that are said to be haunted:\n\nBuckingham Palace\n\nWhere better to kick things off than the Queen’s official workplace and London residence, Buckingham Palace. It is said that the rear terrace of Buckingham Palace is haunted by the ghost of an enchained monk in a brown cowl. He is believed to be the spirit of a monk who died in a punishment cell from a time when a monastery stood on the site. Another ghost that has been reported is that of Major John Gwynne, who served as King Edward VII's private secretary. After his divorce from his wife, the Major was shunned by upper society. Unable to cope with a life of shame, he ended his life in his first floor office, shooting himself in the head.\n\nWindsor Castle\n\nWindsor is perhaps the most haunted of all the royal residences, with as many as 25 ghosts reported. The ghost of Elizabeth I has been seen by several members of the royal family, including Queen Elizabeth II and her sister Margaret. Often seen in the library, her footsteps can be heard on the bare floorboards, before her striking presence appears. The ghost of George III has been witnessed, looking longingly out of the room beneath the library, where he was confined during his several periods of madness. Henry VIII is said to haunt the deanery cloisters, often heard hobbling around, the sound of his ulcerated leg thudding on the floor as he walks. On the grounds in Windsor Great Park, the ghost of Herne has been reported. He was a huntsman for King Richard III. If you see his ghost anywhere in the park beware, as legend has it that you'll be struck by misfortune.\n\nBalmoral Castle\n\nOne of the most notorious ghosts of Balmoral Castle is that of John Brown. Servant to Queen Victoria, they apparently fell in love, however, this remains a matter of conjecture. His ghost is often seen walking the corridors, usually wearing a kilt. Queen Elizabeth II has also reported the feeling of his presence throughout the castle.\n\nPalace of Holyroodhouse\n\nRoyal Collection Trust / © Her Majesty Queen Elizabeth II 2013 photo by John Freeman\n\nThe Palace of Holyroodhouse, commonly known as Holyrood Palace, has been a royal residence since 1369. It's infamously known as the scene of David Rizzio's murder in 1566. Rizzio was believed to have been Mary, Queen of Scots’ lover. Her husband Lord Darnley, was informed of the affair, and later ordered Rizzio's murder, which occurred in Mary's dining room, with Mary present, and seven months pregnant. The blood stains from the murder are said to reappear no matter how many times they’re scrubbed clean. Lord Darnley himself is said to haunt his old rooms at Holyrood. He is believed to have met a gruesome end, after an explosion destroyed his living quarters. Many people are of the understanding that Mary secretly ordered the death of Darnley, to seek revenge for the death of Rizzio. Agnes Simpson, a woman who was accused of being a witch is said to roam the palace at night. She was killed in 1592, stripped, and tortured to death, and her naked form has been seen walking through the palace and its grounds.\n\nSandringham House\n\nA regular Christmas home for the royal family, Sandringham House has a number of quite disturbing reports. Prince Charles reported unexplained sudden blasts of cold air during a stay in the 1980's. The hands of a clock are reported to move freely, independent of the mechanism. Books have also been witnessed flying off shelves. Poltergeist activity has also been reported, with Christmas cards flying around the room, and blankets being pulled off beds. Phantom footsteps are often heard, as well as wheezing sounds, and lights being switched on and off by themselves. This is a guest post by Wesley McDermott, contributor to HauntedRooms.co.uk, the UK's leading provider of haunted accommodation and ghost hunts. You can find Haunted Rooms on Twitter and Facebook, where they regularly share offers and time sensitive deals on haunted hotels and events.", "images": ["https://www.visitbritain.com/sites/all/themes/vb_consumer/images/Find-your-GREAT-Britain-website-logos/UK/FIND_YOUR_GREAT_BRITAIN_UK_BLUE.svg", "https://www.visitbritain.com/sites/default/files/consumer_blogs/teaser_images/balmoral-cropped-istock_000003450465medium.jpg"], "top_img": "https://www.visitbritain.com/sites/default/files/consumer_blogs/teaser_images/balmoral-cropped-istock_000003450465medium.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.visitbritain.com/us/en/ghosts-past-5-haunted-royal-residences", "title": "Ghosts of the past: 5 haunted royal residences", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "google-site-verification": "hKzZTDkN4qJZdaTJWt-ZQ2v97LIISDthJ1x800ioizU", "twitter": {"image": "https://www.visitbritain.com/sites/default/files/styles/twitter/public/consumer_blogs/teaser_images/balmoral-cropped-istock_000003450465medium.jpg?itok=Jrc6o53W", "site": "@VisitBritain", "description": "Here are five royal residences that are said to be haunted.", "card": "summary", "url": "https://www.visitbritain.com/us/en/ghosts-past-5-haunted-royal-residences", "title": "Ghosts of the past: 5 haunted royal residences"}, "description": "Here are five royal residences that are said to be haunted.", "og": {"site_name": "VisitBritain", "type": "article", "title": "Ghosts of the past: 5 haunted royal residences", "url": "https://www.visitbritain.com/us/en/ghosts-past-5-haunted-royal-residences", "updated_time": "2020-03-27T13:19:37+00:00", "image": {"identifier": "https://www.visitbritain.com/sites/default/files/consumer_blogs/teaser_images/balmoral-cropped-istock_000003450465medium.jpg", "url": "https://www.visitbritain.com/sites/default/files/consumer_blogs/teaser_images/balmoral-cropped-istock_000003450465medium.jpg", "secure_url": "https://www.visitbritain.com/sites/default/files/consumer_blogs/teaser_images/balmoral-cropped-istock_000003450465medium.jpg", "width": 600, "height": 315}}, "article": {"published_time": "2013-05-17T15:53:32+00:00", "modified_time": "2020-03-27T13:19:37+00:00"}}, "movies": [], "publish_date": 1368806012.0, "source": "http://www.visitbritain.com", "summary": ""}