{"url": "http://toofab.com/2017/11/10/taylor-swift-reputation-album-kanye-west-kim-kardashian-clap-backs/", "text": "Taylor Swift's much anticipated album \"Reputation\" just dropped, and her references to the infamous Kanye West feud make it clear that \"if a man talks shit,\" she \"owes him nothing.\"\n\nThe almost decade-long drama first began at the 2009 VMAs, when Kanye stormed the stage during Swift's acceptance speech for Best Female Video, took the microphone away from her and told the audience the award should have gone to Beyonce for \"Single Ladies.\" (Beyonce won Video of the Year later that night and invited Swift back on stage to give her speech.)\n\nThe popular artists seemed to bury the hatchet six years later when Swift presented Kanye with the MTV Video Vanguard Award at the 2015 VMAs. But in the summer of 2016, Kanye released his hit track \"Famous,\" in which he referred to Swift as \"that bitch,\" said he still might have sex with her, and took credit for her rise to fame.\n\nSwift responded by throwing shade at Kanye during her Album of the Year acceptance speech at the Grammys, and said she never gave permission for her name and likeness to be used in the song -- but then Kanye's loyal wife Kim Kardashian released a Snapchat video of Swift and Kanye amiably discussing the lyrics over the phone before the song was released. The rest is pop culture history.\n\nHere are all the times Swift tries to get the last word in \"Reputation\":\n\n\"Look What You Made Me Do\"\n\nThe most obvious Kanye-related song Swift released was \"Look What You Made Me Do,\" which pushed the stars' feud back into the public eye just in time for the release of her full album. She starts by singing that she is not a fan of the \"little games,\" \"your tilted stage\" or \"the role you made me play of the fool, no, I don't like you.\"\n\nShe sings that she's \"got a list of names and yours is in red, underlined,\" and all she \"thinks about is karma.\" In the chorus, she repeatedly states that she \"don't trust nobody and nobody trusts me.\"\n\nThe music video is even more obviously about the backlash, with different versions of herself from past music videos getting annihilated while the new Taylor tells someone over the phone that the Old Taylor is \"dead.\" She even sits in a bathtub full of diamonds while miming a gun with her hand, causing some people to wonder if she was savagely mocking Kim's traumatic Paris robbery in which she was tied up at gunpoint and left in a bathtub.\n\nThe video ends with her former selves yelling at each other to \"shut up,\" judging each other for every move, and throwing unrequested criticism each other's way.\n\n\"I Did Something Bad\"\n\nThe lyrics on this track are most likely about that infamous phone call between her and Kanye, when the rapper said he asked the pop star for permission to include her in his song \"Famous.\"\n\nThe opening lines reference never trusting \"narcissists\" even though they love her, with a chorus that rings out a continuous, \"They say I did something bad / But why's it feel so good? / Most fun I ever had / And I'll do it over and over and over again if I could.\"\n\nKanye has consistently been named one of the biggest narcissists in the industry, and Swift seems to show no regrets calling him out: \"If a man talks shit, then I owe him nothing.\"\n\nThe song is sung in autotune, one of Kanye's favorite musical styles. Swift also sings about \"receipts and reasons\" (Kim's Snapchat video) and likens herself to a witch being burned at the stake. \"They're burning all the witches, even if you aren't one / They got their pitchforks and proof / Their receipts and reasons / They're burning all the witches, even if you aren't one / So light me up.\"\n\n\"This Is Why We Can't Have Nice Things\"\n\nThis track opens with Swift reflecting on just how great life was before the tables turned against her. \"It was so nice being friends again / There I was giving you a second chance / But then you stabbed my back while shaking my hand / And therein lies the issue / Friends don't try to trick you / Get you on the phone and mind-twist you / And so I took an ax to a mended fence.\"\n\nThe lines about friends not trying to trick you and phone calls mind-twisting you is surely a striking reference to the Snapchat video that went viral after Kim used it to clear her husband's name and throw Swift under the bus. Swift even asks at one point, \"So why'd you have to rain on my whole parade?\"\n\nShe then takes a low but effective blow with an apparent reference to the broken friendship between Kanye and Jay Z after Kanye made negative comments about Beyoncé. \"But I'm not the only friend you've lost lately / If only you weren't so shady.\"\n\nSwift then gives a toast to her real friends: \"They don't care about that he said, she said / And here's to my baby / He ain't reading what they call me lately / And here's to my momma / Had to listen to all this drama / And here's to you / 'Cause forgiveness is a nice thing to do / Haha, I can't even say it with a straight face!\"\n\n\"Call It What You Want\"\n\nThis dreamy ballad is mostly about Swift's boyfriend Joe Alwyn staying by her side and ignoring all the drama, but there may still be a few sly references to the Kanye feud.\n\nShe opens the song by saying, \"My castle crumbled over night / I brought a knife to a gun fight / They took the crown but it's all right,\" describing how her career took a big hit after Kim Kardashian exposed her on Snapchat.\n\nLater in the song, she mentions \"all the drama queens taking swings / all the jokers dressing up as kings\" -- another possible a reference to Kim Kardashian's reality TV career and Kanye's tendency to call himself a genius.\n\nView Photos Getty", "images": ["https://ll-assets.tmz.com/www.tmz.com/main/default/cache/images/feedlogo2.v2014_05_09_134122.gif", "https://assets.toofab.com/toofab.com/main/default/img/toofab-logo-white.svg", "https://toofab.akamaized.net/2019/04/06/elite-daily-logo-1.png", "https://assets.toofab.com/toofab.com/main/default/img/skeleton.svg", "https://ll-media.tmz.com/2013/04/26/partner-rsss-justjared-logo-cut-v2.gif", "https://ssl-cdn-media.tmz.com/2013/04/26/partner-rss-fox-b-w.png", "https://toofab.akamaized.net/2019/04/06/cdl-260x30-for-tmz3-1.png", "https://toofab.akamaized.net/2018/12/19/newsletter-logo-v2-1.png", "https://ll-media.tmz.com/2013/04/26/partner-rss-thestir-logo-cut-v2-1.png", "https://toofab.akamaized.net/2017/11/10/west-swift-1200x630.jpg"], "top_img": "https://toofab.akamaized.net/2017/11/10/west-swift-1200x630.jpg", "keywords": [], "authors": ["Toofab Staff"], "canonical_link": "https://toofab.com/2017/11/10/taylor-swift-reputation-album-kanye-west-kim-kardashian-clap-backs/", "title": "Every Way Taylor Swift Claps Back at Kanye West on 'Reputation'", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "twitter": {"toofab": 116547240, "card": "summary_large_image", "site": "@toofab", "title": "Every Way Taylor Swift Claps Back at Kanye West on 'Reputation'", "description": "\"Friends don't try to trick you / Get you on the phone and mind-twist you,\" Swift sings in one of many likely references to her Kanye feud.", "image": "https://toofab.akamaized.net/2017/11/10/west-swift-1200x630.jpg"}, "verify-v1": "Wtpd0N6FufoE2XqopQJoTjWV6Co/Mny9BTaswPJbPPA=", "msvalidate.01": "AFEB17971BCF30779AEA662782EF26F4", "y_key": "14cb04e4656b0c58", "keywords": "Taylor Swift, Reputation, Kanye West", "description": "\"Friends don't try to trick you / Get you on the phone and mind-twist you,\" Swift sings in one of many likely references to her Kanye feud.", "robots": "index,follow", "referrer": "unsafe-url", "og": {"url": "https://toofab.com/2017/11/10/taylor-swift-reputation-album-kanye-west-kim-kardashian-clap-backs/", "site_name": "toofab", "type": "article", "title": "Every Way Taylor Swift Claps Back at Kanye West on 'Reputation'", "description": "\"Friends don't try to trick you / Get you on the phone and mind-twist you,\" Swift sings in one of many likely references to her Kanye feud.", "image": "https://toofab.akamaized.net/2017/11/10/west-swift-480x360.jpg"}, "fb": {"app_id": 116046798441464, "pages": 324392354652}, "article": {"publisher": "https://www.facebook.com/TooFab"}}, "movies": [], "publish_date": 1510243200.0, "source": "http://toofab.com", "summary": ""}