{"url": "https://web.archive.org/web/20170202235837/http://ghanaweb.website:80/2017/01/30/donald-trump-signs-a-visa-free-travel-policy-for-ghana", "text": "Share this. 3.9k SHARES Share Tweet\n\nThe United States President, Donald Trump has signed an executive order to allow all Ghana nationals travel to the United States without visas.\n\nThe new order, serving as a change in visa policy for Ghanaians traveling to the United States, would permit them stay in the U.S for a maximum period of 180 days for Tourism or Business purposes only. Stay over 180 days would therefore require a visa.\n\nTrump says this measure is to strengthen trade between the United States and Ghana.\n\nHowever, Ghanaians who hold dual nationality will be banned from entering the United States if their other passport is from Syria, Iraq, Iran, Sudan, Libya, Somalia and Yemen — the seven Muslim-majority countries “of concern”.\n\nIt has emerged that trade and bilateral visa deals have been discussed by Trump and Ghanaian Diplomats in the States.\n\nA source at the White House has hinted that Trump may revoke Australia’s opportunity of traveling to the United States without visas after cancelling all trade deals with the country.\n\nAllowing Ghanaians to the United States freely is not the only order signed into force by Trump since assuming office. He has signed five new executive orders – including one to expedite environmental review and approval of high-priority infrastructure projects.\n\nPresident Donald Trump signed executive orders to advance the construction of the controversial Dakota Access and Keystone XL pipelines.\n\nHe also signed an executive order on Monday barring federal funds from organizations that promote abortion around the world, including the International Planned Parenthood Federation, in what activists say is the president’s first major pro-life action while in office.\n\nThe policy, known as the Mexico City Policy or the Global Gag Rule, was first ushered in under Ronald Reagan and bars federal funds from going to foreign organizations that perform abortions overseas or lobby for the practice’s legalization in other countries.\n\nHe has formally withdrew the United States from the Trans-Pacific Partnership trade deal on Monday, distancing America from its Asian allies as China’s influence in the region rises.\n\nFulfilling a campaign pledge to end American involvement in the 2015 pact, Trump signed an executive order in the Oval Office pulling the United States from the 12-nation TPP.\n\nsource: USA TODAY\n\nShare this. 3.9k SHARES Share Tweet", "images": ["https://web.archive.org/web/20170202235837im_/https://i1.wp.com/graph.facebook.com/v2.2/839745295/picture?q=type%3Dlarge%26_md5%3D202de269cb17238c9e98dad09064db58&resize=50%2C50", "https://web.archive.org/web/20170202235837im_/https://i2.wp.com/images.indianexpress.com/2017/01/donald-trump-75910.jpg?w=612", "https://web.archive.org/web/20170202235837im_/http://ghanaweb.website/wp-content/uploads/2016/10/ghana-web-logoo.png", "https://web.archive.org/web/20170202235837im_/http://ghanaweb.website/wp-content/uploads/2017/01/donald-trump-75910.jpg"], "top_img": "https://web.archive.org/web/20170202235837im_/http://ghanaweb.website/wp-content/uploads/2017/01/donald-trump-75910.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20170202235837/http://ghanaweb.website/2017/01/30/donald-trump-signs-a-visa-free-travel-policy-for-ghana/", "title": "Donald Trump signs a visa-free travel policy for Ghana", "meta_data": {"viewport": "initial-scale=1.0", "og": {"type": "article", "title": "Donald Trump signs a visa-free travel policy for Ghana", "description": ".", "image": {"identifier": "https://web.archive.org/web/20170202235837im_/http://ghanaweb.website/wp-content/uploads/2017/01/donald-trump-75910.jpg", "width": 759, "height": 422}, "url": "https://web.archive.org/web/20170202235837/http://ghanaweb.website/2017/01/30/donald-trump-signs-a-visa-free-travel-policy-for-ghana/", "site_name": "Ghana Web", "updated_time": "2017-01-30T19:56:54+00:00"}, "article": {"published_time": "2017-01-30T18:39:37+00:00", "modified_time": "2017-01-30T19:56:54+00:00"}, "twitter": {"card": "summary_large_image", "title": "Donald Trump signs a visa-free travel policy for Ghana", "description": "The United States President, Donald Trump has signed an executive order to allow all Ghana nationals travel to the United States without visas.  The new order, serving as a change in visa policy for Ghanaians traveling", "image": "https://web.archive.org/web/20170202235837im_/http://ghanaweb.website/wp-content/uploads/2017/01/donald-trump-75910.jpg"}, "generator": "WordPress 4.7.2", "Frontier Theme": "1.2.5"}, "movies": [], "publish_date": 1485705600.0, "source": "https://web.archive.org", "summary": ""}