{"url": "https://www.standard.co.uk/news/london/duchess-of-cambridge-makes-surprise-hospital-visit-to-meet-survivors-of-london-bridge-terror-attack-a3563201.html", "text": "ES News email The latest headlines in your inbox twice a day Monday - Friday plus breaking news updates Enter your email address Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid You already have an account. Please log in Register with your social account or click here to log in I would like to receive lunchtime headlines Monday - Friday plus breaking news alerts, by email Update newsletter preferences\n\nThe Duchess of Cambridge paid a surprise visit to meet the victims of the London Bridge terror attack as they are recovering in hospital.\n\nKate, 35, arrived at King’s College Hospital in Denmark Hill, south-east London, shortly before 2pm on Monday.\n\nDuring the visit which was not publicised in advance, she also met with doctors and medical staff who helped to treat victims injured in the atrocity.\n\nThe Duchess was met by Nick Moberly, the hospital’s Chief Executive and Medical Director Professor Julia Wendon, who showed her around the hospital's emergency department and trauma wards.\n\nKate spoke to six patients who are still being treated and praised the efforts of doctors and nurses who were working on the night of the attack, saying: \"Well done.\"\n\nKing’s College Hospital was one of two hospitals to receive the bulk of the casualties following the terror attack on Saturday, June 3 which left eight people dead and 48 injured.\n\nIn total, 14 people were admitted to the hospital, predominantly suffering from stab wounds.\n\nThe Duchess of Cambridge was overheard asking a female staff member if she had received enough emotional support to help her deal with the aftermath of the atrocity.\n\nShe replied: \"We look after each other.\"\n\nSpeaking about the night of the attack, head of nursing Lynne Watkins-Hulme told the Duchess of Cambridge: \"What was really noticeable on Saturday night was the amount of female patients that were involved.\n\n\"That was quite traumatic for the staff. We are not used to so many females being injured.\"\n\nShe added: \"We are used to seeing people who are stabbed.\n\n\"But to have six women who were stabbed, multiple times - it was just the amount of people - that was upsetting.\"\n\nMany of the staff who tended to patients after the London Bridge atrocity were also working on March 22 when Khalid Masood killed five people in an attack on Westminster Bridge.\n\nKate said: \"To go through this sort of event twice, it is quite unprecedented.\n\n\"What sort of training do you go through?\"\n\nShe also spoke to emergency consultant Malcolm Tunnicliff, who had been on his way home from playing cricket when he heard news of the incident and made his way to the hospital.\n\nHe said: \"We are very, very used to dealing with stabbings in this area.\n\n\"We are one of the busiest hospitals in western Europe for dealing with penetrating injuries, but it was the volume and it is usually young men that stab each other, and there were quite a lot of ladies who were stabbed.\n\n\"We got through a lot of kit in an hour and a half. Probably what we go through in a week.\"\n\nAsked what he took from the Duchess visiting, Dr Tunnicliff said: \"The dedication of all the staff, and actually how resilient they are and they are very proud to work for King's, and the NHS for that matter.\n\n\"It is nice when you have got someone like the Duchess of Cambridge who comes along. It was only four or five weeks ago Prince Charles and the Duchess of Cornwall came along, and it gives the patients a lift, it gives the staff a lift that they're being recognised.\n\n\"And actually, all staff in the NHS want these days is just to be recognised for what they do, because they get knocked for so much.\n\n\"Someone like that coming along and recognising that, it is a massive lift.\"\n\nA series of tweets posted on the hospital’s official account said: “Following last week's London Bridge attack, we're pleased to welcome HRH The Duchess of Cambridge to King's today.\n\n“HRH is meeting staff from our Emergency Department who were on shift during the London Bridge attacks.\n\n“HRH is meeting staff on one of our trauma wards, as well as patients who are being treated at King's after being injured at London Bridge.”\n\nIt was revealed on Friday by the Standard that every victim of the attack who made it to hospital has survived their injuries.\n\nTerrorists Khuram Butt, 27, Rachid Redouane, 30 and Youssef Zaghba, 22, carried out the attack by ploughing into pedestrians with a rented van on London Bridge before stabbing dozens of people in Borough Market.", "images": ["https://static.standard.co.uk/s3fs-public/thumbnails/image/2017/06/12/15/duchessofcampbridge.jpg"], "top_img": "https://static.standard.co.uk/s3fs-public/thumbnails/image/2017/06/12/15/duchessofcampbridge.jpg", "keywords": [], "authors": ["Hatty Collier"], "canonical_link": "https://www.standard.co.uk/news/london/duchess-of-cambridge-makes-surprise-hospital-visit-to-meet-survivors-of-london-bridge-terror-attack-a3563201.html", "title": "Kate Middleton makes surprise visit to meet London Bridge terror attack victims", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#dc062b", "og": {"url": "http://www.standard.co.uk/news/london/duchess-of-cambridge-makes-surprise-hospital-visit-to-meet-survivors-of-london-bridge-terror-attack-a3563201.html", "title": "Kate makes surprise hospital visit to meet terror attack survivors", "description": "The Duchess of Cambridge paid a surprise visit to meet the victims of the London Bridge terror attack as they are recovering in hospital.  Kate, 35, arrived at King’s College Hospital in Denmark Hill, south-east London, shortly before 2pm on Monday. During the visit which was not publicised in advance, she also met with doctors and medical staff who helped to treat victims injured in the atrocity.", "updated_time": "2017-06-12T16:36:33+01:00", "image": "https://static.standard.co.uk/s3fs-public/thumbnails/image/2017/06/12/15/duchessofcampbridge.jpg", "site_name": "Evening Standard", "type": "article", "locale": "en_GB"}, "fb": {"pages": 165348596842143, "app_id": 193840110715213, "admins": 36903991}, "ia": {"markup_url": "https://www.standard.co.uk/pwamp/fbi/3563201"}, "description": "The Duchess of Cambridge paid a surprise visit to meet the victims of the London Bridge terror attack as they are recovering in hospital.  Kate, 35, arrived at King’s College Hospital in Denmark Hill, south-east London, shortly before 2pm on Monday. During the visit which was not publicised in advance, she also met with doctors and medical staff who helped to treat victims", "keywords": "Duchess of Cambridge, King's College Hospital, London, News", "article": {"tag": "Duchess of Cambridge", "published_time": "2017-06-12T14:46:00+01:00", "modified_time": "2017-06-12T16:36:33+01:00", "publisher": 165348596842143, "section": "London", "author_name": "Hatty Collier", "content_type": "story", "word_count": 880, "image_count": 1, "video_count": 0, "embed_count": 0, "internal_link_count": 3, "external_link_count": 10}, "twitter": {"title": "Kate makes surprise hospital visit to meet terror attack survivors", "description": "The Duchess of Cambridge paid a surprise visit to meet the victims of the London Bridge terror attack as they are recovering in hospital.  Kate, 35, arrived at King’s College Hospital in Denmark", "card": "summary_large_image", "site": "@standardnews"}, "google-site-verification": "fI_fn7lv1QlqGWXMIJoqDICBG1ynAC0UDsrriO8e_m8", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Evening Standard"}, "movies": [], "publish_date": 1497275160.0, "source": "https://www.standard.co.uk", "summary": ""}