{"url": "www.gobankingrates.com/net-worth/celebrities/ellen-degeneres-net-worth/", "text": "Ellen DeGeneres turns 60 on Jan. 26. Plans for her birthday celebration have yet to be revealed, but the world-famous talk show host typically dedicates an entire episode of her show to the special occasion — including gifts for her audience and cameos by iconic celebrity friends.\n\nEllen’s never been one to keep all the festivities for herself, either. Those fortunate enough to be in the audience for the Ellen DeGeneres’ birthday show in the past have received a Netflix gift cards that covered five years of the subscription service, a $300 Lyft rideshare service gift cards and a three-day, two-night stay at the Fairmont Scottsdale Princess hotel. Keep reading and learn more about this celebrity’s net worth.\n\nEllen DeGeneres Net Worth: $400 Million\n\nEllen’s net worth is $400 million, according to CelebrityNetWorth. In 2015, she made $75 million, which earned her the No. 12 spot on Forbes’ list of the highest-paid celebrities in the world. Ellen’s wife — actress Portia de Rossi — has her own $20 million fortune, which brings the celebrity couple’s total net worth to $420 million.\n\nStarting out as a stand-up comedian, Ellen rose to fame as an actress, starring in the TV series “Ellen” from 1994 to 1998 and “The Ellen Show” from 2001 to 2002. Her daytime talk show, “The Ellen DeGeneres Show” debuted on Sept. 8, 2003, and has consistently received high ratings. In 2015, the Ellen show won the Daytime Emmy Award for Outstanding Talk Show Entertainment. According to Variety, Ellen receives an estimated annual salary of $50 million from “The Ellen DeGeneres Show.”\n\nEllen has hosted the Oscars twice, both in 2007 and in 2014. She made history during the 2014 gig by tweeting a group selfie with a gaggle of famous friends — Meryl Streep, Bradley Cooper, Jennifer Lawrence, Julia Roberts, Brad Pitt and Kevin Spacey — a photo that has received 3.5 million retweets since being posted.\n\nRecession-Proof Your Money\n\nHollywood continued to treat Ellen well as she was famously voiced for the character Dory in the 2003 Pixar film “Finding Nemo” and “Finding Dory” in 2016. Ellen has also found major success behind the camera with her own production company A Very Good Production.\n\nEllen DeGeneres Business Ventures\n\nThe tech-savvy superstar launched the site Ellentube in 2014, which hosts exclusive video content from her talk show. In 2015, she also partnered with Vessel to debut one or two clips from “The Ellen DeGeneres Show” on the streaming site before they’re available anywhere else.\n\nEllen has also ventured into the beauty and fashion world. In 2009, she became the face of COVERGIRL and continues to work with the cosmetics company. She also previously served as the spokeswoman for JCPenney and American Express. And her lifestyle brand, ED by Ellen — including clothing, accessories and home decor — launched in 2015.\n\nIn late 2017, DeGeneres also debuted a new game show titled “Ellen’s Game of Games” on NBC, expanding the popular games which have been previously featured on her talk show.\n\nBig Tippers: 10 Celebs Who’ve Left Generous Tips\n\nEllen DeGeneres Real Estate Portfolio\n\nEllen and wife de Rossi have made a name for themselves as real estate magnates. The couple has a knack for purchasing swanky properties and unloading them to fellow celebrities. For example, they became landlord to musician Nick Jonas in 2015, renting one of their many homes to the 24-year-old.\n\nThe couple purchased a mid-century modern Los Angeles mansion in January 2014 for nearly $40 million and promptly sold it to Sean Parker six months later for $55 million. Previously, in May 2012, they sold their 15,000 sq. ft. Beverly Hills compound to Ryan Seacrest for $36.5 million. Ellen and Portia also purchased Brad Pitt’s former Malibu bachelor pad in 2011 for $12 million and sold it to cosmetics entrepreneur Victoria Jackson in 2012 for $13 million.\n\nRecession-Proof Your Money\n\nIn March 2006 — prior to her marriage to de Rossi — Ellen sold a home in Hollywood Hills, Calif. to Will Ferrell for $9 million. She also sold former Google CEO Eric Schmidt a California home in 2007 for $20 million, which was later the site of Kim Kardashian’s wedding to Kris Humphries in 2011.\n\nThe total number of properties currently owned by the couple is unknown. Ellen released her interior design book “Home” in 2015, which included photos and design tips from many of their past and present residences. Their former Thousand Oaks, Calif. ranch — which they sold in 2013 for $10.85 million — was also previously featured in Elle Décor.\n\nEllen DeGeneres Honors and Awards\n\nIn November 2016, President Obama presented Ellen with the Presidential Medal of Freedom. “It’s easy to forget now just how much courage was required for Ellen to come out on the most public of stages 20 years ago,” Obama said. Here’s a summary of all the other awards and accolades that Ellen has picked up over her career:\n\nDaytime Emmy Awards\n\nOutstanding Talk Show (2004, 2005, 2006, 2007)\n\nOutstanding Talk Show Host (2004, 2005, 2006, 2007, 2008)\n\nOutstanding Special Class Writing (2005, 2006, 2007, 2011, 2012, 2013, 2014)\n\nOutstanding Promotional Announcement – Institutional (2009, 2011, 2012)\n\nOutstanding Talk Show Entertainment (2010, 2011, 2013, 2014, 2015, 2017)\n\nOutstanding New Approaches – Enhancement to a Daytime Program or Series (2013, 2014, 2015)\n\nOutstanding Interactive Media – Enhancement to a Daytime Program or Series (2016)\n\nOutstanding Promotional Announcement – Image (2016)\n\nPrimetime Emmy Awards\n\nOutstanding Writing for a Comedy Series (1997)\n\nPeople’s Choice Awards\n\nFavorite Female Performer in a New TV Series (1995)\n\nFavorite Daytime Talk Show Host (2005, 2006)\n\nFavorite Funny Female Star (2005, 2006, 2007, 2008, 2009)\n\nFavorite Talk Show Host (2007, 2008, 2009, 2011)\n\nFavorite Daytime TV Host (2012, 2013, 2014, 2015, 2016, 2017)\n\nFavorite Humanitarian (2016)\n\nFavorite Animated Movie Voice (2017)\n\nFavorite Comedic Collaboration (2017)\n\nProducers Guild of America Awards\n\nOutstanding Producer of Variety Television (2005, 2006)\n\nTeen Choice Awards\n\nChoice Comedian (2010, 2011, 2013, 2014, 2015, 2016)\n\nChoice Summer Movie Star: Female (2016)\n\nChoice TV Personality (2017)\n\nChoice Comedy Movie Actress (2017)\n\nUp Next: TV Stars Who Now Have Big Screen Paychecks\n\nJamie Young contributed to the reporting for this article.", "images": ["https://cdn.gobankingrates.com/wp-content/uploads/2016/01/Jaguar-PS_shutterstock_251011927-1024x576.jpg", "https://cdn.gobankingrates.com/wp-content/uploads/2017/03/170215_GBR_Woods_1420x595_LONG-150x150.jpg", "https://cdn.gobankingrates.com/wp-content/themes/gbr-v2/img/gbr-logo.svg.gzip", "http://cdn.gobankingrates.com/wp-content/themes/gbr-v2/img/logo-zergnet.png"], "top_img": "https://cdn.gobankingrates.com/wp-content/uploads/2016/01/Jaguar-PS_shutterstock_251011927-1024x576.jpg", "keywords": [], "authors": ["Laura Woods", "Read More", "John Csiszar", "Andrew Lisa", "Elizabeth Magill", "Gabrielle Olya"], "canonical_link": "https://www.gobankingrates.com/net-worth/celebrities/ellen-degeneres-net-worth/", "title": "Ellen DeGeneres’ Net Worth on Her 60th Birthday", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, shrink-to-fit=no", "description": "Ellen DeGeneres turns 60 on Jan. 26. Plans for her birthday celebration have yet to be revealed, but the world-famous talk show host typically dedicates an entire episode of her show to the special...", "keywords": "GOBankingRates,celebrities,net worth", "og": {"title": "Ellen DeGeneres’ Net Worth on Her 60th Birthday", "type": "article", "url": "https://www.gobankingrates.com/net-worth/celebrities/ellen-degeneres-net-worth/", "image": "https://cdn.gobankingrates.com/wp-content/uploads/2016/01/Jaguar-PS_shutterstock_251011927-1024x576.jpg", "site_name": "GOBankingRates", "description": "Celebrate six decades of DeGeneres and see how much she's worth."}, "article": {"published_time": "2018-01-28T16:00:08Z", "modified_time": "2018-06-22T23:23:03Z"}, "twitter": {"card": "summary_large_image", "title": "Ellen DeGeneres’ Net Worth on Her 60th Birthday", "description": "Celebrate six decades of DeGeneres and see how much she's worth.", "image": "https://cdn.gobankingrates.com/wp-content/uploads/2016/01/Jaguar-PS_shutterstock_251011927-1024x576.jpg"}, "thumbnail": "https://cdn.gobankingrates.com/wp-content/uploads/2016/01/Jaguar-PS_shutterstock_251011927-848x477.jpg", "original-source": "https://www.gobankingrates.com/net-worth/celebrities/ellen-degeneres-net-worth/", "google-site-verification": "UM4IRrnbuHbpidFzGcubzUTnYM2nSbbsENyWzajsLtg", "msvalidate.01": "835EF260572EA20ACFC7CE1547620982", "fb": {"pages": 191525857260}, "p": {"domain_verify": "5c213d8c1e1470fb2409d7569153017a"}, "msapplication-TileImage": "https://cdn.gobankingrates.com/wp-content/uploads/2017/04/cropped-gbr-logo_go_site_id-270x270.png", "position": 4}, "movies": [], "publish_date": 1517155208.0, "source": "http://www.gobankingrates.com", "summary": ""}