{"url": "www.inquisitr.com/4440466/is-paris-jackson-doing-drugs-amid-scary-family-crisis/", "text": "Has Paris Jackson started doing drugs to amidst a stormy family crisis? That’s the claim being made by the National Enquirer. They say that the “wild child” daughter of Michael Jackson has gone completely off the rails and that her family is concerned that she might be doing drugs to cope with the stress of her new modelling and acting career.\n\nBut Gossip Cop has looked into the rumors that Paris is currently doing drugs now, and it looks like they are false.\n\n“The family worries the stress of Paris’s booming modeling and acting career has catapulted her into substance abuse,” one ‘source’ said to the National Enquirer, as reported by Gossip Cop.\n\nThe Enquirer also claims that The Jacksons are concerned about health of the matriarch and patriarch of the family, Katherine and Joe. “The Jackson parents, both in their 80s, are fading fast,” the source claims.\n\nParis had a very difficult adolescence after her father died. In an interview with Rolling Stone, she revealed that she was sexually assaulted at age 14. She also admitted she had cut herself, attempted suicide “multiple times,” and had been using drugs as well. Tattoos now cover the scars and track marks from the drug abuse.\n\nBut as for whether she is using drugs now, Gossip Cop interviewed her press rep who told them that the claims made by the National Enquirer were unfounded.\n\nSince her stint in rehab, Paris seems to be doing a lot better. She’s currently signed to IMG models and has started acting as well, with a recent guest role on Fox’s Star.\n\nhttps://www.instagram.com/p/BX2v64XnIiA/?hl=en&taken-by=parisjackson\n\nThis isn’t the first time that the National Enquirer has made up stories about Paris Jackson. They previously claimed that Paris was set to join Keeping Up With The Kardashians, and that Kris Jenner was trying to recruit Jackson into their clan. The whole goal of this “recruitment” was to help boost the ratings of their flagship reality TV show. But this story was debunked by Gossip Cop along with another Enquirer story which said that Paris was dating Trevor Donovan. An interview with Paris’ rep revealed that she and Donovan are just friends and there’s no romantic link between them.\n\nhttps://www.instagram.com/p/BV-0R7QHq4U/?hl=en&taken-by=parisjackson\n\nDo you think that Paris Jackson has relapsed into drug abuse or is Michael Jackson’s only daughter doing just fine, in your opinion? Let us know what you think in the comments below.\n\nRELATED POSTS ON THE INQUISITR\n\nMichael Jackson Estate IRS Lawsuit Continues, As Jackson’s 2017 Net Worth Grows Again\n\nParis Jackson And Macaulay Culkin Get Matching Tattoos, But What Do They Mean?\n\nParis Jackson Goes Topless During Nature Retreat, Reunites With Godfather Macaulay Culkin\n\nTroubled ‘Home Alone’ Star Macaulay Culkin Is Looking Better Than Ever\n\n[Featured Image by Frazer Harrison/Getty Images]", "images": ["https://secure.gravatar.com/avatar/dee9f0b262b2cc498f0c56b5221d31a3?s=250&d=mm&r=g", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "https://cdn.inquisitr.com/wp-content/uploads/2017/08/paris-jackson3.jpg"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Patricia Grannum"], "canonical_link": "https://www.inquisitr.com/4440466/is-paris-jackson-doing-drugs-amid-scary-family-crisis/", "title": "Is Paris Jackson Doing Drugs Amid Scary Family Crisis? [Debunked]", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}