{"url": "https://www.elle.com/fashion/personal-style/a12119563/elle-personal-style-awards-october-2017/", "text": "This article originally appears in the October 2017 issue of ELLE.\n\n\n\nYou may think that personal style is a wholly subjective gift: You know it when you see it, sure, but when it comes to choosing who does it best...how do you decide? For our annual personal style awards, we took a democratic approach, enlisting 17 style luminaries—designers, actors, industry players, and more—to tell us who’s really got it going on. Here, we bring you the result: 12 genre-smashing sartorial heavyweights whose wardrobes telegraph an eye for beauty, a fearless knack for statement-making, and a deep streak of individuality.\n\n\n\nThe Rebel With a Cause\n\nParis Jackson | Model; Actress\n\nCotton tank, $490, Saint Laurent by Anthony Vaccarello, at Saint Laurent, NYC. Corduroy pants, Matthew Adams Dolan, $550. Suede leather ankle boots, Christian Louboutin, $1,895. Her own jewelry. Stylist’s own belt. Mark Seliger\n\n“I like to stick with earth tones and tie-dye. Stevie Nicks, Janis Joplin, and Jimi Hendrix are my top three fashion icons—they all wore what felt good on them, period. Which I love. Staying true to yourself is important in every aspect, even down to your clothes.”\n\nBeauty Secret: For mussed volume, flip hair upside down and mist with Ultra Fine Hair Spray.\n\nThe Globe-Trotting Glamourist\n\nAurora James | Founder and Creative Director, footwear label Brother Vellies\n\nEmbellished-Lurex jacquard jacket, Gucci, at select Gucci stores nationwide. Silk georgette dress, Ullta Johnson, $750. Beaver felt and turquoise hat, Nick Fouquet, $1,175. Diamond and rose gold ring, Brother Vellies. Daymion Mardel\n\n“I love embellishment. A black pump is great, but it’s a lot better when you can have feathers on it and not take yourself so seriously. My fashion sensibility is very eclectic but also multicultural. Traveling really opens your eyes: Well, what does a uniform look like in Indonesia? What does a kimono represent for certain people?”\n\nThe Model of Elegance\n\nCarolyn Murphy | Model\n\nCotton tunic, The Row, $3,690, at The Row, L.A. Her own earrings. Heather Hazzan\n\n“My style is definitely influenced by the ’70s, when I grew up, and by my mother—the lesson from her was just effortlessness: Know what you know, like a great white button-down, a great pair of jeans. I don’t like things that are fussy. For me, a gold hoop or even a red lip is a way to dress something up.”\n\nThe Punk Protagonist\n\nNoah Cyrus | Singer\n\nCotton T-shirt, Raf Simons, $289, rafsimons.com. Mesh top, Creatures of Comfort, $225. Brass and crystal crown, Dolce & Gabbana, $3,875. Mink and gold hoop earrings, Wild and Woolly, $315. Diamond and horn ring, Pascale Monvoisin, $745. Red enamel and diamond ring, Marc Alary, $1,200. Lamé herringbone waist bag, Chanel, $3,900. Calfskin boots, Victoria Beckham, $1,995. Her own bracelet. Daymion Mardel\n\n“I found my look very recently. It kind of came from finding Instagrammers whose style I like. One of my favorites—her handle is @uglyworldwide—shaved her head, shaved her eyebrows. She’s not afraid to be like, ‘F*** what people think about me.’ I think it should be all about feeling comfortable in your skin.”\n\nBeauty Secret: The ultimate flyaway defense, Keratin Smooth Heat Defense Spray keeps straight styles sleek.\n\nRulebreaker-in-Chief\n\nTracee Ellis Ross | Blackish\n\nLeather and suede jacket, Prada, at select Prada boutiques nationwide. Yellow and rose gold and sapphire ring necklace, Monica Rich Kosann, $2,885. Her own vintage T-shirt and Céline corduroy pants. Daymion Mardel\n\n“I used to love watching my mom [Diana Ross] get ready to go out for the evening. Glamour and sparkles—the energy of what happened onstage in her full glory—was translated differently when she was going to dinner. That left such an impression, that through clothing you could articulate how you are in the world. Even at work, I come in at five in the morning, I get dressed. There’s always a . I’m not somebody who’s like, ‘Oops, this is just something I have on.’ ”\n\nThe Menswear Magician\n\nSophie Auster | Singer-Songwriter\n\nSilk jacket, $2,080, trousers, Haider Ackermann, $1,670, both, haiderackermann.com. Vintage T-shirt, Saint Luis, $2,000. Silver earrings, Trademark, $228. Velvet scarf, Echo, $39. Vintage Hermès gold circle pendant necklace, Beladora, $1,950. Lapis lazuli, sapphire, diamond, and gold pendant necklace, Retrouvaí, $1,775. Gold and diamond rings, both, Temple St. Clair, $2,950-3,500 each. Gold and diamond multiband ring, Elsa Peretti for Tiffany & Co., $2,000. Leather brogues, Church's, $660. Her own watch. Heather Hazzan\n\n“The suit has definitely become a performance uniform for me. When I first adopted the look, it made me feel very powerful and cool, like I could be a better version of myself. It’s funny with clothing: A wispy dress can make you feel more vulnerable, and a very structured coat and pants can make you feel stronger. I like to embrace my strength.”\n\nThe Modern Bombshells\n\nAtlanta de Cadenet Taylor | Model; DJ\n\nAmanda de Cadenet | Photographer; Media Entrepreneur; TV Host, The Conversation\n\nOn Atlanta de Cadenet Taylor: Leather jacket, Balenciaga, at select Barneys New York stores nationwide. Embroidered-suede dress, Coach, $1,400. Silk head scarf, Rockins, $150. Gold and diamond ring, David Yurman, $2,200. Turquoise cabochon ring, Fox & Bond, $485. Black enamel and gold ring, Marc Alary, $950. Her own earrings and necklaces. On Amanda de Cadenet: Chiffon dress, Alberta Ferretti, collection at barneys.com. Her own earrings and ring. Daymion Mardel\n\nAtlanta, daughter: “I’m totally not a minimalist. I love color; I love floral prints. I have a body, so I have to highlight my best parts, and one of them is my waist. When I was younger, I envied the ‘norm,’ the very thin girl. That’s what was in. It’s awesome that it’s changing, and I’m finally learning to accept and love my body.”\n\nAmanda, mother: “Clothes from different eras fit me way better, because I’m supercurvy. And the fabric! I love lace; I love velvet; I love chiffon. Mostly I’ll wear vintage dresses, like gingham dresses, and accessorize with contemporary designers—Alaïa, Marc Jacobs, Tabitha Simmons.”\n\nThe New Bohemian Singer\n\nKelly Rowland | Singer\n\nLace dress, Ellery, $4,995, ellery.com. Lace bodysuit, Eres, $755. Rose gold, horn, and diamond ring, Pascale Monvoisin $505. Pavé, onyx, mother-of-pearl, and gold ring, Marc Alary, $4,200. Calfskin boots, Fendi, $1,350. Her own earrings and necklace. Daymion Mardel\n\n“One of my first big purchases in the early-2000s Destiny’s Child days was a pair of thigh-high Dolce & Gabbana denim boots. I was 18 or 19, and they made me feel a little more grown-up, a little more sexy. I wore them everywhere: during performances, on tour, on days off. My friend was like, ‘You’re wearing them too much.’ I said, ‘Do you know how much money I paid for these boots? They’re going to walk for themselves!’ ”\n\nBeauty Secret: A corona of curls gets big-time radiance from Keratin Smooth Shine Serum.\n\nThe California Cool Girl\n\nKate Bosworth | Actress\n\nCotton-blend shirt, Closed, $196, closed.com. Levi’s denim jeans, Re/Done, $305. Gold and champagne diamond signet ring, Jessica Biales, $2,000. Canvas sneakers, The Row, $650. Daymion Mardel\n\n“I was a late ’80s and ’90s kid, so it was all about the Keds and Levi’s. In the ’90s, I looked to people like Carolyn Bessette Kennedy and Lauren Hutton. I remember desperately wanting to be a Calvin girl—to me, that’s the epitome of class, a truly stripped-back, pure beauty. My father worked in the fashion industry, and he’d always say, ‘If you stay classical, you’ll always be timeless.’ You can look at a photograph of Bessette Kennedy wearing jeans and a blue-ish sweater and loafers, and it’s just as relevant today.”\n\nBeauty Secret: To achieve wind-whipped texture, work Beauty-Full Volume Mousse into lengths; massage at the root for major lift.\n\nThe Architecturalist\n\nCasey Legler | Artist\n\nHer own hat, shirt, watch, ring, and Dickies pants. Heather Hazzan\n\n“I moved around a lot as a kid, and very early on, I understood that what you wore that had value in one culture held no value in another culture—there was a relativism that gave me the freedom to actually wear what I wanted. In my closet there are Dickies, a bunch of white T-shirts, black T-shirts, and different kind of socks. I was an architecture student in school, so I appreciate the building of garments and anything that’s classic and simple.”\n\n\n\nThe Mix Master\n\nMiranda July | Filmmaker; Writer; Artist\n\nWool-blend jacket, Self-Portrait, $595, collection at shopbop.com. Mesh top, Priscavera, $175. Gold chain, $450, locket, $2,025, both, Tiffany & Co. Wool-blend socks, Maria La Rosa, $57. Leather pumps, Saint Laurent by Anthony Vaccarello, $1,995. Her own bracelet, Atelier Boutique skirt, and vintage Nike T-shirt. Daymion Mardel\n\n“I’ve always felt comfortable when I get dressed if there’s something just ‘off’ enough; I guess that kind of describes my work, too. It doesn’t all come from confidence; it all kind of plays from your unique insecurities and your confidence that makes you, you. It can’t all be bulletproof or it’s just boring.”\n\nOn loving clothes: “It’s healthy to have some things purely for joy.”\n\nStyled by Yashua Simmons.\n\n|", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/the-elle-personal-style-awards-2017-1504710365.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/the-elle-personal-style-awards-2017-1504710365.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.elle.com/fashion/personal-style/a12119563/elle-personal-style-awards-october-2017/", "title": "The 2017 ELLE Personal Style Awards", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "The 2017 ELLE Personal Style Awards", "description": "Here,  12 genre-smashing sartorial heavyweights whose wardrobes telegraph a deep streak of individuality.", "url": "https://www.elle.com/fashion/personal-style/a12119563/elle-personal-style-awards-october-2017/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/the-elle-personal-style-awards-2017-1504710365.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "modified_time": "2019-10-24 03:41:45", "published_time": "2017-09-06 03:47:00", "section": "Personal Style", "opinion": "false"}, "twitter": {"site": "@ELLEmagazine", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/the-elle-personal-style-awards-2017-1504710365.jpg?crop=1.00xw:1.00xh;0,0&resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "The 2017 ELLE Personal Style Awards", "description": "Here,  12 genre-smashing sartorial heavyweights whose wardrobes telegraph a deep streak of individuality.", "auto-publish": "never", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/the-elle-personal-style-awards-2017-1504710365.jpg?crop=0.400xw:0.798xh;0.199xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Fashion,fashion,personal-style", "sailthru.date": "2017-09-06T15:47:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/the-elle-personal-style-awards-2017-1504710365.jpg?crop=1.00xw:1.00xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/the-elle-personal-style-awards-2017-1504710365.jpg?crop=0.400xw:0.798xh;0.199xw,0", "sailthru.socialtitle": "The 2017 ELLE Personal Style Awards", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1504640820.0, "source": "https://www.elle.com", "summary": ""}