{"url": "https://en.wikipedia.org/wiki/Hillary_Scott", "text": "For the American pornographic actress, see Hillary Scott (actress)\n\nHillary Dawn Scott-Tyrrell (born April 1, 1986), known professionally as Hillary Scott, is an American singer and songwriter. She is the co-lead singer of Lady Antebellum, a country music group that was formed in 2006, and is signed to Capitol Nashville. With her family, she released the top 10 album, Love Remains, in 2016.\n\nEarly life [ edit ]\n\nScott was born in Nashville, Tennessee, to country music artist Linda Davis and Lang Scott, a musician and entrepreneur. Her family is Scottish-Native American[citation needed]. She has a younger sister named Rylee Jean (2000). Scott was homeschooled on the road for kindergarten. She attended elementary school and high school at Donelson Christian Academy where she graduated in 2004. She lived with her grandparents during that time while her parents were on the road touring. After joining her mom on stage for a Christmas show, she was convinced to pursue a music career. Scott decided at age 14 to become a country singer, and her sister, Rylee, is 14 years younger than her; so she has a tattoo of the number 14 in honor of those two things.[1]\n\nCareer [ edit ]\n\nAfter high school she attended Middle Tennessee State University to help her music career grow and to also improve it. During her time at MTSU, Scott worked with singer-songwriter Victoria Shaw and earned some publicity, but was unable to secure a contract with a major label.[2] She auditioned for American Idol twice, but failed to make it through to the judges round in both cases.[3] Then she met future bandmates Charles Kelley and later, Dave Haywood, in May 2006. She ran into Kelley at a Nashville bar and recognized him from his MySpace page, where she had been listening to his music. She introduced herself to Kelley and complimented him on his music, which led to his deciding that they should get together with Haywood and write songs. The first song they wrote was \"All We'd Ever Need\". The song was originally written for her to perform; she convinced Kelley it should be a duet, which led to the forming of Lady Antebellum. The group first performed together in August 2006 and signed a record deal with Capitol Nashville in 2007.[4] Scott claims that being lead singer of Lady Antebellum, as opposed to being a solo artist, lessens the pressure on her on stage.[5]\n\nLady Antebellum [ edit ]\n\nScott formed the country music group Lady Antebellum in 2006 with co-lead singer Charles Kelley and backup singer Dave Haywood. They released their debut single, \"Love Don't Live Here\", on October 2, 2007, it entered Billboard's Hot Country Songs chart that year, peaking at No. 3 in early 2008. Their self-titled debut album was released on April 15, 2008, and debuted at No. 1 on the Top Country Albums chart. It consisted of eleven songs, ten of which were either written or co-written by the members of the trio, and was produced by Paul Worley and Victoria Shaw. The trio released their second single, \"Lookin' for a Good Time\", in mid-2008, it peaked at No. 11 in December of that year. Their third single, \"I Run to You\", became their first number one hit on the Hot Country Songs chart in July 2009. The album was certified platinum by the RIAA three months later, in October 2009.\n\nScott (in silver dress) performing with Lady Antebellum in 2008\n\nIn August 2009, Lady Antebellum released \"Need You Now\" as the lead single off their sophomore album of the same name. The song topped the Hot Country Songs chart for five weeks in late 2009 before peaking at No. 1 and No. 2 on the Adult Contemporary and Hot 100 charts, respectively, in early 2010. Need You Now was released on January 26, 2010, and debuted at No. 1 on Billboard's Top 200 Albums chart with first-week sales of almost 481,000 copies. The album consisted of eleven songs, eight of which were co-written by the members of the trio, and showcased production by both the trio and Worley. The next two singles from the album, \"American Honey\" and \"Our Kind of Love\", reached No. 1 on the country charts in April 2010 and September 2010, respectively. The album was certified triple platinum by the RIAA in October 2010. Its fourth and final single, \"Hello World\", peaked at No. 6 on the country charts in April 2011.\n\nIn May 2011, Lady Antebellum released \"Just a Kiss\" as the first single from their third studio album, Own the Night, which was released on September 13, 2011, and became their fifth number one hit. \"Just a Kiss\" was 2x certified Platinum by the RIAA. It stayed on the Hot 100 for forty-two weeks. The second single \"We Owned the Night\" also became a number one hit and was certified Gold. The third single \"Dancin' Away with My Heart\" was also certified Gold and peaked at number two. \"Wanted You More\" was released as the fourth and final single from the album. It was their first single since \"Lookin' For a Good Time\" to miss the Top Ten. The band supported the album with their second headlining tour, the Own the Night Tour which was also their first arena and world tour.\n\nOn October 22, 2012, On This Winter's Night, the band first Christmas album was released. One of the tracks on the album \"A Holly Jolly Christmas\" was released to Country radio and AC radio. A music video for the single was made.\n\nShortly after the release of On This Winter's Night, Lady Antebellum started working on their fifth studio. Golden was released on May 7, 2013. \"Downtown\" was the album's first single and peaked at number two on Country radio and number one on the US Country Airplay chart. It was certified platinum by the RIAA. The second single was \"Goodbye Town\". In late 2013, the deluxe edition re-issue of Golden was released which included the third single \"Compass\". \"Compass\" was met with positive reviews and went number one on the Country Airplay chart. Throughout 2014, the band toured the album on the Take Me Downtown Tour.\n\nIn May 2014, \"Bartender\" was released as the first single off their sixth studio album. \"Bartender\" became their third number on the Country Airplay chart and is certified Platinum. 747 was released on September 30, 2014. \"Freestyle\" and \"Long Stretch of Love\" are the second and third singles off 747 respectively.\n\nIn October 2015, Lady Antebellum appeared on Good Morning America to announce that they would be taking some down time after their Wheels Up Tour finishes.[6] Throughout 2016 they continued to play some shows together.\n\nIn January 2017, Lady Antebellum released \"You Look Good\" which is the lead single off their upcoming seventh studio album Heart Break. The album was released on June 9, 2017, and will support it on the You Look Good Tour.[7]\n\nHillary Scott & the Scott Family [ edit ]\n\nIn November 2015, it was reported that Scott was working on a gospel album.[8] On April 22, 2016, she posted a handwritten note online about the project. In the note she expressed her excitement about it, announced the album's title, Love Remains and formally introduced \"Hillary Scott & the Scott Family\". On why making a gospel album she explains, \"Well, I wanted to make this album to share more of who I am. These songs, and many like them are the cry of my heart. I have been singing songs like this my whole my life whether it be in church, with family and friends gathered around with guitars on my screened porch, rocking my baby girl to sleep or while holding the hand of a dying loved one.\" The album features original material penned by Scott as well as gospel standards and was produced by Ricky Skaggs.[8] Scott's parents, Linda Davis and Lang Scott, and younger sister Rylee also appear on the album.[9][10] The lead single \"Thy Will\" was released on April 22, 2016.[11] Love Remains won Best Contemporary Christian Album and \"Thy Will\" won Best Contemporary Christian Music Performance/Song.[12]\n\nOther projects [ edit ]\n\nScott's other works include singing background vocals on Luke Bryan's song, \"Do I\", which fellow Lady Antebellum bandmates, Charles Kelley and Dave Haywood, wrote alongside Bryan.[13] The song was released to radio in April 2009 and peaked at No. 2 on Billboard's Hot Country Songs chart in December of that year.[14]\n\nScott has recorded a duet with Dave Barnes called \"Christmas Tonight\"[15] and was featured with Kelley and Haywood, as Lady Antebellum, on Maroon 5's \"Out of Goodbyes\". \"Christmas Tonight\" was a single off Barnes' 2010 holiday album, Very Merry Christmas, and peaked at No. 9 on the Adult Contemporary chart on New Year's Day, 2011.[16] \"Out of Goodbyes\" was included on Maroon 5's 2010 album, Hands All Over, but was never released as a single.[17]\n\nIn addition, Scott has co-written songs for other country artists, including Sara Evans' \"A Little Bit Stronger\" and Blake Shelton's \"Suffocating\". \"A Little Bit Stronger\" featured Scott on harmony vocals and was released in September 2010 as the lead off single to Evans' sixth studio album, Stronger. The song was widely used in the 2010 film, Country Strong, and topped the Hot Country Songs chart in May 2011 for two weeks, becoming Scott's first-ever Number One hit recorded by another artist.[18][19] \"Suffocating\" was written by Scott with Shelton's ex-wife, Miranda Lambert, and recorded by Shelton for his 2010 EP, All About Tonight.[20]\n\nScott appeared on season 4 of The Voice as a mentor for \"Team Adam Levine\". In 2016, she presented Gospel Hour for BBC Radio 2 Country.\n\nPersonal life [ edit ]\n\nScott married Nashville-based drummer Chris Tyrrell on January 7, 2012. The two first met in college and reconnected when Lady Antebellum and fellow country music band Love and Theft, in which Tyrrell was the drummer at the time, both served as opening acts on Tim McGraw's Southern Voice tour in early 2010. They began dating in July 2010. After their relationship began, Tyrrell filled in for Lady Antebellum's drummer for a month in August 2010.[21]\n\nScott in 2010\n\nWhen Lady Antebellum released \"Just a Kiss\" in May 2011, Scott hinted that the song was inspired by her relationship with Tyrrell, saying, \"We love writing songs from personal experience, and this is definitely one of those songs. There is so much excitement at the beginning of a new relationship ... all the butterflies and that optimistic feeling that this person could be 'the one.' This song is about one of those times when your brain kicks in and tells your heart 'good things are worth waiting for.'\"[22] Tyrrell proposed to Scott on July 2, 2011, during a family vacation in east Tennessee,[23] and the couple wed in upstate New York on January 7, 2012. No wedding date had been announced, and on January 8, the couple posted a video on Lady Antebellum's website announcing that they were married.[23] In October 2011, Tyrrell became a full-time member of Lady Antebellum's band as their new drummer.\n\nScott has two tattoos, a music note on her right foot and the number 14 on her right wrist. The 14 has two meanings. It represents the age at which she decided music is what she wanted to do for a living and the age difference between her and her younger sister Rylee Jean Scott.[24]\n\nIn August 2012, Scott and Tyrrell purchased their first home together, a 7,600-square-foot (710 m2), 6-bedroom and 8-bathroom home with a pool in Brentwood, Tennessee.[25] Scott announced on December 7, 2012, that she and her husband were expecting their first child.[26][27] In an interview with Broadway's Electric Barnyard, Scott said that the baby's heartbeat might be heard in the group's latest album, Golden.[28] In 2013, they had a daughter in Nashville, Tennessee.[29] In 2015, she miscarried her second child, which inspired her single \"Thy Will\" on the album Love Remains.[30] Scott and Tyrell then had twin daughters in 2018.[31][32]\n\nFilmography [ edit ]\n\nTelevision [ edit ]\n\nYear Title Role Notes 2013 The Voice Herself Advisor for Team Adam (season 4) 2020 Songland Herself Episode: \"Lady Antebellum\"\n\nDiscography [ edit ]\n\nCollaborative albums [ edit ]\n\nSingles [ edit ]\n\nFeatured singles [ edit ]\n\nOther charted songs [ edit ]\n\nYear Song Peak positions Album US Hot Christian\n\n[41] 2016 \"Beautiful Messes\" 28 Love Remains \"Love Remains\" 38\n\nMusic videos [ edit ]\n\nYear Title Director 2016 \"Thy Will\" (with the Scott Family) [49] Shane Drake\n\nAwards [ edit ]\n\nSince 2008, Scott and Lady Antebellum have been awarded many top awards in the music industry. Some of the top accolades include nine Grammy awards, seven ACM awards, six CMA awards, one Billboard Music Award and CMT Artists of the Year honorees in 2010 and 2011 and 2018. Scott was also named SESAC songwriter of the year in 2008, 2010, and 2011. In 2011, her publishing company, Hillary Dawn Songs, shared publisher of the year with EMI Foray Music at the SESAC awards. She also has three Academy of Country Music awards, as producer of the album Need You Now, as producer of the single \"Need You Now\", and as songwriter for \"Need You Now\".\n\nYear Award Recipient Category Result 2017 Grammy Awards Love Remains Best Contemporary Christian Music Album Won \"Thy Will\" Best Contemporary Christian Music Performance/Song Won Billboard Music Awards Hillary Scott & the Scott Family Top Christian Artist Nominated \"Thy Will\" Top Christian Song Won Love Remains Top Christian Album Nominated 2018 CMT Artists of the Year Awards Hillary Scott Honoree Won", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lady_A_-_Charlotte_12-27-12-1.jpg/1200px-Lady_A_-_Charlotte_12-27-12-1.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/LadyAntebellumApr10_cropped_hillary.jpg/180px-LadyAntebellumApr10_cropped_hillary.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lady_A_-_Charlotte_12-27-12-1.jpg/220px-Lady_A_-_Charlotte_12-27-12-1.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Lady_Antebellum_2008.jpg/220px-Lady_Antebellum_2008.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lady_A_-_Charlotte_12-27-12-1.jpg/1200px-Lady_A_-_Charlotte_12-27-12-1.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Hillary_Scott", "title": "Hillary Scott", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lady_A_-_Charlotte_12-27-12-1.jpg/1200px-Lady_A_-_Charlotte_12-27-12-1.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}