{"url": "en.wikipedia.org/wiki/Look_What_You_Made_Me_Do", "text": "2017 single by Taylor Swift\n\n\"Look What You Made Me Do\" is a song recorded by American singer-songwriter Taylor Swift, released on August 25, 2017, by Big Machine Records as the lead single from her sixth studio album Reputation (2017). Swift wrote and produced the song with her co-producer Jack Antonoff. \"Look What You Made Me Do\" is an electroclash and dance-pop song,[1] with lyrics about various issues that built Swift's reputation. Right Said Fred band members are also credited as songwriters, as it interpolates the melody of their song \"I'm Too Sexy\" (1991).\n\nThe song broke a string of records, including the record for the most plays in a single day on Spotify. Commercially, \"Look What You Made Me Do\" has topped the charts in Australia, Canada, Croatia, the Czech Republic, Greece, Ireland, Israel, Japan, Lebanon, Malaysia, New Zealand, the Philippines, Scotland, Slovakia, the United Kingdom, and the United States. It has also received Platinum certifications in Australia, Belgium, Canada, Denmark, Italy, New Zealand, Poland, Sweden and the United States. It also received Diamond certification in Brazil.\n\nThe song received a polarized response from music critics. Released by Swift after a one-year hiatus and buoyed by its accompanying music video, the comeback was widely considered to be one of pop music’s most iconic.[2] The music video was directed by Joseph Kahn and upon its release on YouTube, it attained the most views in its first 24 hours of release, more than any other music video on the site at that time.[3]\n\nPromotion and release [ edit ]\n\nOn August 23, 2017, Swift announced that the first single from her upcoming sixth album, titled Reputation, would come out the following night.[4] The song was released to streaming services on August 25,[5] and earned over eight million streams within twenty-four hours of its Spotify release, breaking the record for the highest first-day streaming for a single track.[6] The record was surpassed four times: in 2018 by Drake's \"God's Plan\",[7] XXXTentacion's \"SAD!\" the day after his death, and Ariana Grande's \"Thank U, Next\" on November 5, 2018. Mariah Carey surpassed the record with \"All I Want for Christmas Is You\" on December 25, 2018. \"Look What You Made Me Do\" was then released the next day onto iTunes for digital download through Big Machine Records[8] and onto Italian contemporary hit radio[9] before a United Kingdom radio release on August 26, 2017.[10] It impacted American contemporary hit radio three days afterwards.[11] A CD single release followed in Germany on October 27, 2017.[12]\n\nA lyric video heavily based on the Saul Bass imagery used in the film Vertigo was released through Swift's official Vevo account on August 25, 2017.[13] The video was produced by Swift and Joseph Kahn and directed by ODD.[14] It gained more than 19 million views during its first 24 hours on YouTube, surpassing \"Something Just like This\" by The Chainsmokers and Coldplay as the most viewed lyric video within that time period.[15] As of October 2019, the lyric video on YouTube has amassed over 120 million views.\n\nComposition and lyrical interpretation [ edit ]\n\n\"Look What You Made Me Do\" was written and produced by Swift and Jack Antonoff, it runs for 3 minutes and 31 seconds.[16][8] Music critics have described the track as a hybrid of electroclash and pop,[1] as well as a dance-pop[17] and an electropop song.[13] It emphasizes the blame that is placed on an enemy, in particular the line \"I've got a list of names and yours is in red, underlined,\" which was inspired by Arya Stark's kill list in the television series Game of Thrones.[18] The middle eight of the song features Swift saying, \"I'm sorry, the old Taylor can't come to the phone right now / Why? / Oh, 'cause she's dead!\"[citation needed] \"Look What You Made Me Do\" is performed in the key of A minor with a tempo of 128 beats per minute.[19] Swift's vocals span from G 3 to F 5 .[19] Brittany Spanos of Rolling Stone noted a \"nightmarish aesthetic\" present in the song, and believed it to be a continuation of the \"antagonistic persona\" from \"Bad Blood\".[17] Richard Fairbrass, Fred Fairbrass and Rob Manzoli, the members of the British dance-pop group Right Said Fred, are credited as songwriters because the song interpolates the melody of their song \"I'm Too Sexy\".[20][21] According to Fred Fairbrass, he and his brother were contacted one week before the release of \"Look What You Made Me Do\" and were asked whether a \"big, contemporary female artist who hasn't released anything for a while\" – whose identity they were not told – would be able to use a portion of their song for her latest single.[22] Although the brothers agreed to a deal, they did not officially find out that the artist in question was Swift until the morning after the song was released, but had deduced that it was her based on the description they were given.[22] Both of the Fairbrass brothers said that they enjoyed \"Look What You Made Me Do\"; Fred Fairbrass told Rolling Stone, \"I like the cynical aspect of the lyric, because 'I'm Too Sexy' is a cynical song, and I think she channeled that quite well.\"[22] A representative for Swift confirmed that the song interpolated the melody from \"I'm Too Sexy\", but did not include sampled audio from the earlier song.[23]\n\nCritical reception [ edit ]\n\n\"Look What You Made Me Do\" received polarized reviews from critics, with some calling it a fierce return, and some a disappointment.[24][25][26] USA Today said that the polarizing reaction to the song illustrated Swift's position as a \"ubiquitous cultural force\".[27] The Telegraph Randy Lewis praised the song, deeming Swift and Antonoff's work as \"blowing past the production clichés of clap tracks and hiccuped syllabic hooks that have proliferated across Top 40 fare in recent years with boldly inventive textures and fresh melodic, rhythmic and sonic accents\". He also added how the track musically and sonically shifted alongside the lyrics.[28] Sarah Carson of the Los Angeles Times wrote a positive review of the song, saying: \"The reverberating crescendo builds and ever more delicious is the wickedness of Swift's menacing protagonist\", praising Swift for her successful embrace of the villain character the media has portrayed her as previous to the song's release.[29] Variety's Chris Willman also praised Swift's embrace of a darker-styled pop music and the stylistic conflict between the song's pre-chorus and chorus.[30] Mark Harris, in New York magazine's pop culture blog, thought of Swift's song as a pop art anthem for the Trump era in how she reappropriates her public feuds as empowering badges of honor without acknowledging her own responsibility or blame.[31]\n\nHowever, the single received more criticism than her previous lead singles. Maura Johnston of The Guardian wrote a negative review of the song, faulting the \"sloppy\" lyrics and blaming Swift for not giving a clear context in the lyrics.[13] Lindsay Zolad of The Ringer said \"Unleashed on a deeply confused public late Thursday night, the song is a strange collage of retro reference points: mid-aughts Gossip Girl placement pop, the soundtrack to Disney's live-action Maleficent, and — yes, really — Right Said Fred's I'm Too Sexy, except devoid of the self-effacing humor and wit. Yes, the new Taylor Swift song just made me compliment Right Said Fred.\" Brittany Spanos of Rolling Stone believed that the song marked a continuation of the feud between Swift and rapper Kanye West; the latter had previously name-dropped Swift in his song \"Famous\" by using the line, \"I feel like me and Taylor might still have sex / Why? / I made that bitch famous\". The single was noted as being darker and angrier than what Swift had done before.[17][32] Hugh McIntye of Forbes was critical of the change in style, saying that it \"didn't sound like [Swift]\" and that it \"may have some kinks to work out\".[1] Meaghan Garvey from Pitchfork referred to it in a review as \"a hardcore self-own\" track.[33]\n\nIn 2019, Slant listed \"Look What You Made Me Do\" as one of the 100 singles that defined the 2010s decade.[34]\n\nCommercial performance [ edit ]\n\nIn the United States, \"Look What You Made Me Do\" debuted at number seventy-seven on the Billboard Hot 100, powered by its first three days of airplay.[35] It also sold slightly under 200,000 digital copies within its first day of sales in the country, where it became the fastest selling download since Ed Sheeran's \"Shape of You\".[36] One week later, the song ascended from No. 77 to No. 1 on the Hot 100 after its first full week of tracking, becoming the fifth-largest rise to the top position and Swift's fifth number-one single in the United States. It ended the record-tying 16-week reign of Luis Fonsi's \"Despacito\". It also topped the nation's Streaming Songs chart with 84.4 million streams, becoming its most streamed song within a week by a female artist and second overall behind the 103 million that Baauer's \"Harlem Shake\" gained in 2013. The track also had more weekly streams in the US than any other song in 2017. The song stayed atop the charts for three consecutive weeks, tying with American rapper Cardi B's \"Bodak Yellow\" as the longest-running female at the number one spot on the charts in 2017. With 353,000 copies sold in its first week, \"Look What You Made Me Do\" opened atop the US Digital Songs chart and had the country's biggest sales opening since Justin Timberlake's \"Can't Stop the Feeling!\" in 2016 as well as the best weekly sales for a song by a female artist since Adele's \"Hello\" in 2015. The track also became the country's first number-one song with a female artist since Halsey was featured on \"Closer\" by the Chainsmokers and the first song with a female lead artist since Sia's \"Cheap Thrills\" with Sean Paul (both in 2016). It additionally was the first solo song by a female to top the US charts since Adele's \"Hello\".[37]\n\nIt remained atop the Hot 100 and Streaming Songs charts for a second week with 114,000 copies sold and 61.2 million streams, though descended to number two on the Digital Songs chart when another Reputation track titled \"...Ready for It?\" debuted at number one with 135,000 digital copies sold and opened at number four on the Hot 100. As a result, Swift became the first artist to have two tracks sell over 100,000 digital copies in the nation within a week since Sheeran with \"Shape of You\" and \"Castle on the Hill\". It also became the first time a female had two songs within the top five of the Hot 100 since 2015 when Swift's previous tracks \"Blank Space\" and \"Shake It Off\" respectively were at numbers four and five on the chart. It only remained in the top ten of the chart for eight weeks before tumbling 10-25 on November 11, 2017.[38] The single also topped the Mainstream Top 40 chart, becoming Swift's eighth single to do so.[39] However, a week after reaching number one on the Mainstream Top 40, it moved to number 7, being the largest fall from the top in the chart's history; and from number 5 to number 20 on the all-format Radio Songs chart, the biggest drop from the top five in that chart's 27-year history.[40]\n\nIn the United Kingdom, \"Look What You Made Me Do\" sold 20,000 copies and was streamed 2.4 million times in less than a week.[41] The song debuted at the top the UK Singles Chart on September 1, 2017 – for the week ending date September 7, 2017 – with opening sales of 30,000 copies and 5.3 million streams within the week and becoming Swift's first chart-topping song in Britain.[42] After two weeks at the top spot, it was displaced by Sam Smith's \"Too Good at Goodbyes\".[43] As of April 2019, \"Look What You Made Me Do\" has sold over 700,000 combined units in the UK.[44]\n\n\"Look What You Made Me Do\" also debuted at number one in the Republic of Ireland on September 1, 2017 and became Swift's first song to top the Irish Singles Chart. In doing so, it surpassed the number three peaks of her singles \"Love Story\" (in 2009) and \"Shake It Off\" (in 2014).\n\n\"Look What You Made Me Do\" opened at number one in Australia on September 2, 2017, becoming her fifth track to top the ARIA Charts.[45] It spent another week at the nation's summit[46] before \"Too Good at Goodbyes\" took the top position there as well.[47] The song has been certified Platinum by the Australian Recording Industry Association (ARIA) for shipments of 70,000 units.[48] After debuting at number one on the Canadian Hot 100,[49] \"Look What You Made Me Do\" was also certified Platinum by Music Canada for shipments of 80,000 units on September 14, 2017.[50]\n\nIn New Zealand, \"Look What You Made Me Do\" entered at the number one spot on September 1, 2017, becoming Swift's fourth chart-topping single there.\n\nIn the Philippines, \"Look What You Made Me Do\" debuted at number 7 spot on the Philippine Hot 100 on its first week. A week later, it soared to the number 1 spot, ending the 10-week reign of \"Despacito\" by Luis Fonsi & Daddy Yankee featuring Justin Bieber. It descended to the runner-up position the following week, as the latter song reclaimed the top spot for an 11th week.\n\nMusic video [ edit ]\n\nProduction and release [ edit ]\n\nPreparation for the music video began in January 2017, while the shooting took place in May.[51][52] The dance was choreographed by Tyce Diorio, who had worked with Swift on \"Shake It Off\" before.[51] Swift's make-up as a zombie was done by Bill Corso.[52] Post-production of the video lasted until the morning of its release.[52] A 20-second music video teaser was released on Good Morning America on August 25.[53]\n\nThe song's music video premiered on August 27, 2017 at the 2017 MTV Video Music Awards.[54] The video broke the record for most-watched video within 24 hours by achieving 43.2 million views on YouTube in its first day. This record was surpassed by South Korean group BTS with their music video for \"Idol\" in August 2018.[55] It topped the 27.7 million Vevo views Adele's \"Hello\" attracted in that timeframe (only to be surpassed by Ariana Grande's \"Thank U, Next\"), as well as the 36 million YouTube views of Psy's \"Gentleman\" video.[56][57][58] It was viewed at an average 30,000 times per minute in its first 24 hours, with views reaching over 3 million views per hour.[55] As of October 2019, it has over 1.1 billion views and has reached 8.9 million likes on YouTube. It broke the record for fastest video by a female lead to reach 100 million views on YouTube (second overall behind Psy's \"Gentleman\"), doing so in just 3.5 days. The record was later surpassed by South Korean girl group Blackpink's \"Kill This Love\" and Ariana Grande's \"Thank U, Next\".[59] It also broke the all-time records for fastest video on YouTube to reach 200 million, 300 million and 400 million views, taking 7.6, 13.3, and 21.5 days, respectively.[60]\n\nIt was also reported that the diamonds used in a scene were authentic. The diamonds, loaned from celebrity jeweler Neil Lane, were said to be worth over $10 million, hence triggering tight security measures.[61] The video, widely considered to be Swift's best and one of pop music's most iconic comebacks, was named the fifth-best music video of 2017 by Rolling Stone[62] and seventh-best music video of 2017 by Billboard.[63] In 2019, it was ranked as the most iconic pop video of the 2010s by PopSugar.[64] As of now, the video has amassed over 1.1 billion views.\n\nSynopsis [ edit ]\n\nThe bathtub scene in the music video. The diamonds used were said to be authentic and worth over $10 million, and a lone dollar bill can be seen.\n\nSwift has said that part of the premise of the video is rooted in the idea that, \"If everything you write about me was true, this is how ridiculous it would look.\"[65] It is a satirical send-up of media theories about her true intentions that have little validity. The video begins with a zombie Swift crawling out of a grave, where the headstone reads \"Here Lies Taylor Swift's reputation\", and digging another grave for her Met Gala 2014 self. The next scene shows Swift in a bathtub filled with diamonds. She is then seen seated on a throne while snakes surround her and serve tea. Swift later crashes her golden Bugatti Veyron on a post and sings the song's chorus holding a Grammy as the paparazzi take photos. She is also seen swinging inside a golden cage, robbing a streaming company in a cat mask, and leading a motorcycle gang. Afterwards, she gathers a group of women at \"Squad U\" and dances with a group of men in another room. Then, she is seen standing on top of the wing of a plane in an airport hangar, sawing off the wing in half and spray-painting \"reputation\" in pink on the side of the plane. At the video's climax, Swift is seen standing on a T-shaped throne while clones of herself (from her past music videos, stage performances and red carpet appearances) struggle and fight against each other trying to reach her. The video concludes with a scene of a line up of surviving Swift clones bowing in the hangar while Swift stands and watches on the wing of the plane. The clones bicker with one another, describing each other as \"so fake\" and \"playing the victim\". A 2009 VMA Swift then says \"I would very much like to be excluded from this narrative\", resulting in the other Swifts yelling at her to \"shut up!\" in unison.[66][67]\n\nAnalysis [ edit ]\n\nTrue to Swift's tradition, the video contains numerous hidden meanings and references. In the opening scene, there is a subtle \"Nils Sjöberg\" tombstone shown when Swift is digging up a grave, referencing the pseudonym she used for a songwriting credit on Calvin Harris' 2016 single \"This Is What You Came For\".[68] Similarly, Swift—masked as a cadaveric version of herself in the \"Out of the Woods\" music video—was shown digging a grave for herself in a 2014 Met Gala gown, an event that characterized her first public appearance with short hair.[citation needed] A single dollar bill in the bathtub full of diamonds that she bathes in was also speculated to symbolize the dollar she was awarded for winning a sexual assault trial earlier in 2017.[68] Interpretations for the bathtub scene were contrasting. Some believe that it is a response to media statements teasing that she \"cries in a marble bathtub surrounded by pearls.\"[69] Others speculate that the bathtub scene is a jibe at Kim Kardashian, wife of Swift's long-time feuding partner, Kanye West. Some viewers took the scene as a reference to Kardashian's 2016 robbery, in which she was robbed of jewelry worth over $10 million while held at gunpoint at a hotel in Paris, France.[70][71]\n\nIn a separate scene, Swift is shown sitting atop a golden throne, where a carving of a phrase \"Et tu, Brute?\" could be seen on the armrest, a reference to Shakespeare's drama Julius Caesar.[68] Swift's infamous title as a \"snake\" during her hiatus[72] was also represented when a snake slithers onto the throne to serve Swift some tea. When Swift's car crashes, some speculated that it may be a jab at Katy Perry, as Swift's hairdo is similar to Perry's in the scene and the car crash resembles one in Perry's music video for \"Unconditionally\" (2013). The sports car is also reminiscent of a car in Perry's \"Waking Up in Vegas\" (2009) video, which Kahn also directed. However, given the theme of making fun of the media, it is likely making fun of the media theory that Swift's real fall-out with Perry was simply for publicity and album material. Swift is mocking the idea that she would damage her friendships for the sake of her business, with the car crash being a metaphor for the fall out between her and Perry and her holding the Grammy Award after the crash within sight of the photographers' cameras referring to the song inspired by their feud winning awards, which the media claimed was Swift's ulterior motive. Swift's withdrawal of her entire music catalog from streaming services and the media theory that she was doing this for greed and to start her own streaming company were hinted when Swift and her crew robbed a streaming company's money vault in the video.[73][74]\n\nSwift leading an army of tall, skinny, and robotic women at a \"Squad U\" gathering poked fun at the media accusing her close group of friends as being artificial and having unrealistic body shapes.[68] During the second chorus, Swift is seen with eight men, each of whom revealed an \"I Heart TS\" crop top after unbuttoning a jacket at her command. This scene mocks the idea that Swift forced her then-boyfriend Tom Hiddleston to wear an \"I Heart TS\" tank top when they were a couple. During the bridge, Swift is standing on a pile of clones of herself from the past, reiterating the idea that she is leaving behind her image of \"America's Sweetheart\" and embracing her newfound role as a \"snake\". The shirt that her \"You Belong with Me\" music video clone wears is slightly different from the one in the original music video: this time, the names of her current close friends are scribbled on it.[73][74]\n\nThe video's ending features an assembly of \"old Taylors\" in front of a private jet who are talking amongst one another and making snide references to the many false and exaggerated media portrayals of her over the course of her career. These include claims that Swift fakes her classic surprised face at award shows; that her \"nice girl\" façade masks a truly mean, manipulative personality; accusations that Swift always play the victim instead of taking responsibility for her own actions and decisions; and numerous mentions of her 2016 feud with Kanye West and Kim Kardashian. Most notably, in June 2016, discussing the relationship between her and Kanye West after West's song \"Famous\" (2016) was released, Swift wrote on Instagram, \"I would very much like to be excluded from this narrative.\"[75] The same line is spoken by the 2009 MTV Video Music Awards Taylor clone just before the video ends.[76][77] She is wearing the same outfit Swift had worn during the actual 2009 MTV Video Music Awards, when West infamously interrupted her acceptance speech for the Best Female Video award and ignited tensions between the two for the first time.[78]\n\nLive performances [ edit ]\n\nSwift performed \"Look What You Made Me Do\" live for the first time as part of the KIIS-FM's Jingle Ball 2017 on December 1, 2017 in Inglewood, California.[79] Two days later, Swift returned onstage to perform the song again as part of 99.7 Now!'s Poptopia in San Jose, California with the same setlist.[80] The next week Swift sang the song on three other occasions; the B96 Chicago and Pepsi Jingle Bash 2017 in Chicago, the Z100 Jingle Ball 2017 in New York City and Jingle Bell Ball 2017 in London.[81][82][83]\n\nThe song is also a regular part of her setlist for the Reputation Stadium Tour, with a tilted throne and golden snakes; while there are snakes on the high screen in the back during the part where she sings, \"I don't trust nobody and nobody trust me, I'll be the actress starring in your bad dreams\", a big cobra floating appears on stage with the line from the bridge announcing the death of the \"Old Taylor\" spoken by comedian Tiffany Haddish.[84][85]\n\nAccolades [ edit ]\n\nUsage in media [ edit ]\n\nABC used the song in a promotional video for its Shonda Rhimes' Thursday line-up an hour after its release.[98] Sister network ESPN used it in its college football telecast advertisements for the season opening game between Alabama and Florida State, which was aired on ABC on September 2 along with her other song \"...Ready for It?\".[99] In the South Park episode \"Moss Piglets\", the water-bears in Timmy and Jimmy's experiment for the science fair dance to the song in response to Swift's singing. The song was used in the trailer for the 2019 film Murder Mystery.[100]\n\nTrack listings [ edit ]\n\nDigital download No. Title Length 1. \"Look What You Made Me Do\" 3:31\n\nCD single[101] No. Title Length 1. \"Look What You Made Me Do\" 3:31 2. \"Look What You Made Me Do\" (Video) 4:16\n\nCredits and personnel [ edit ]\n\nCredits are adapted from liner notes of Reputation.\n\nTaylor Swift – lead vocals, backing vocals, songwriter, producer\n\nJack Antonoff – producer, songwriter, programming, instruments\n\nRight Said Fred – credit song I'm Too Sexy\n\nLaura Sisk – engineering for mix\n\nVictoria Parker – violins\n\nPhillip A. Peterson – cellos\n\nEvan Smith – saxophones\n\nSerban Ghenea – mixing\n\nJohn Hanes – engineering for mix\n\nRandy Merrill – mastering\n\nCharts [ edit ]\n\nCertifications and sales [ edit ]\n\nRelease history [ edit ]\n\nSee also [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/en/thumb/f/f0/Taylor_Swift_-_Look_What_You_Made_Me_Do_%28music_video_screenshot%29.png/220px-Taylor_Swift_-_Look_What_You_Made_Me_Do_%28music_video_screenshot%29.png", "http://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Antonoff_in_Tucson_%28cropped%29.jpg/170px-Antonoff_in_Tucson_%28cropped%29.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/en/thumb/6/68/Taylor_Swift_-_Look_What_You_Made_Me_Do.png/220px-Taylor_Swift_-_Look_What_You_Made_Me_Do.png", "https://upload.wikimedia.org/wikipedia/en/6/68/Taylor_Swift_-_Look_What_You_Made_Me_Do.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/6/68/Taylor_Swift_-_Look_What_You_Made_Me_Do.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Look_What_You_Made_Me_Do", "title": "Look What You Made Me Do", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/6/68/Taylor_Swift_-_Look_What_You_Made_Me_Do.png"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}