{"url": "https://www.hollywoodreporter.com/live-feed/is-us-milo-ventimiglia-mandy-moore-finale-cliffhanger-986186", "text": "[This story contains spoilers from the season one finale of NBC's This Is Us.]\n\nRather than cap its breakout freshman run with a happy ending, NBC family drama This Is Us wrapped its season Tuesday with heartbreak.\n\nThe show's central couple, Jack (Milo Ventimiglia) and Rebecca (Mandy Moore), got into one of the most epic — and realistic — TV fights to date during the season finale, titled \"Moonshadow.\" It all started after Jack showed up drunk to Rebecca’s show and effectively ruined the band’s tour. Both sides exchanged heated words in an impressive and continuously shot scene that climaxed with Rebecca asking Jack to leave the following morning as they both figured out how they felt. Whether they get back together in the long run, that's a story for season two of the Dan Fogelman drama.\n\nHowever, Tuesday's finale wasn’t all doom and gloom as the storyline also delved further into the past to when Jack and Rebecca first met. As it turns out, they were both scheduled to go on blind dates that night, but their respective existential crisis got in the way and brought them to the same bar instead. The rest, as they say, is history. Or at least it will be as more of the pieces from the past are filled in next fall when This Is Us returns for a second season.\n\nUntil then, The Hollywood Reporter caught up with Moore and Ventimiglia to get their perspectives on the big reveals, filming that fight scene and whether viewers should hold out hope for a Jack and Rebecca reunion.\n\nGiven the fact that Jack met Rebecca while she was singing, is it ironic that he’s unable to support her doing that all these years later?\n\nMoore: It was surprising. This fight really put into perspective how he’s been feeling pretty much her entire life about this. This huge side of her, this huge part of her heart and her soul that she ignored and allowed to lay dormant once she got married and had a family — all of which I believe was something she wholeheartedly wanted in her life, and she really has thrived in the role of being a wife and a mother. But the fact that she’s really trivialized this essential part of her is heartbreaking to me. That Jack wasn’t secure enough to support her, that he really only viewed her through the lens of wife and mother because that was the deal they struck when they first met and ultimately he couldn’t see past it? What broke my heart the most about this fight was this underlying sentiment of him not viewing her or valuing her desires as valid. That is just hard to sort of see past that.\n\nVentimiglia: It’s a little ironic, but at the same time Jack is a guy who leads with his heart. He doesn’t always think things through. In his 50s he has come to understand a certain version of his life and his marriage and he’s out busting his ass for his family and his wife is at home busting her ass for the family. It’s not unnoticed that it is a large responsibility, Rebecca handling the home life. But when she does branch out that change is something that threatens the stability of what Jack has known for years. And it’s not vocalized until Rebecca finally says to him that she feels like she has no life. She feels like she’s a ghost. Those have got to be hard words to hear after being with someone for 20 years. What about the life that we’ve had? That’s what made that argument so impactful; they almost need to get to that point to understand how great they have it.\n\nWhat's the significance of the song \"Moonshadow\"?\n\nMoore: It has significance to them. Jack gave her the moon necklace in the second episode and says, “It’s for our song” — that’s something that Jack and Rebecca have long shared. Maybe they danced to it at their wedding. It’s just a really special piece of music for them. The writers told us about the scene, like, years ago; this was an idea at the very, very beginning of the season. I don’t think they realized I had covered that song on a record of mine over a decade ago. So when they were Googling “Moonshadow” to listen to it in the writers' room, my version came up and they were like, “OK, this is meant to be.”\n\nDo you think Jack is an alcoholic? Rebecca made it clear she doesn’t think so.\n\nVentimiglia: It’s in his DNA. It is definitely in his blood. If he were to really let himself go down the path, it might be a dependency he’d have. But at the same time, I believe in Jack and I believe in Jack’s heart and his intention and his desire to give everything good that he can to his family. And in that, I think he can control it. But at the same time it is a weakness that humanizes him and is something that’s part of his genetic makeup. So he’s doing the best he can with it. I think even given his wife saying, “I want to go on tour and I want to go back to my music,” that also gives Jack free time. The kids are out of the house, his wife is on tour. He’s like, “All right. My kids and my wife are my life, what am I doing? What am I up to? I work for them, and for us and they’re not around so what am I doing?” It’s kind of the idle hands scenario where he has time so he goes and has a drink.\n\nWhat went into filming that fight scene?\n\nVentimiglia: We definitely spent a good amount of time talking about the scene, and then a little rehearsing of the scene. But when it came time to film the scene we both knew it wasn’t going to be the same day of work that we’d had in the past. It was a completely different day of work. I picked my chair up out of the room that Mandy and I usually share and I walked out. When the cameras were up on shoulders and action was called we both came out swinging. I had to remove myself and go walk around the house to take in the memories of what Jack knows his home to be so that when it all came crashing down I could remember it all.\n\nMoore: It was kind of torture. I love Milo and it’s not fun not sitting next to each other and asking each other questions. Our rapport is so easy and familiar and comfortable, so to have to keep ourselves apart from each another throughout this entire episode, the tension was palpable. The crew felt it and we felt it. Milo and I got together on a weekend and read through it a couple of times. And then got together again on set and read through it a couple of more times just to familiarize ourselves with it. And then the day before we actually shot it, we rehearsed it with our DP Yasu Tanida and with Ken Olin and the camera department and a couple of other department heads just so we could nail the choreography. Dan Fogelman was really adamant about shooting the entire scene in one take, which we did. It was really draining, and taxing and not particularly fun. It was like climbing a mountain, but once that was off our plate the rest of the episode felt like smooth sailing.\n\nMandy, how did you craft Rebecca’s tear-stained look for the scenes the following morning?\n\nMoore: I just cried all morning, pretty much. I literally got to set and was in hair and makeup and was listening to music and was sort of in my own head. And I cried and I cried and I cried and then I thought a lot about what would have been going through Rebecca’s head most of the night. I assumed that she slept maybe a solid two or three hours and really settled upon what she felt they needed to do as a couple and for herself and for this marriage. That’s not an easy decision to come to. When I cry, my eyes get really swollen so there was barely any makeup on me. And then I sort of dried my tears and tried to be as stoic as possible, because I felt that was where she was living in that moment.\n\nWas Jack trying to get Rebecca to tell him to stay at the end with that great speech?\n\nVentimiglia: I don’t think he was convincing her to stay, I think he was leaving on a positive note. Jack knew that he crossed a line in attacking Ben (Sam Trammell). He knew the things that were said during the argument weren’t the most constructive to getting his marriage back to a good place. I don’t think Jack was expecting to be kicked out of his house, but he’s a smart enough man to realize that him staying there would probably just aggravate the situation. They both need a little time and a little space. So giving that speech is, “Hey, I know we’re broken, but I know we can fix it. Things are tough right now, but I know we’re going to get back to a good place.”\n\nWhy does Rebecca let him walk out?\n\nMoore: The damage had been done. It’s a really bittersweet note to settle on for the end of the episode, but it’s real. He didn’t fight for it, and she didn’t fight for it in the end. These are two people who are like, “We need to figure this out on our own and see if we can find our way back together again.” That’s much truer to life. What was said the night before was so haunting. You can obviously forgive, but some of those things that were said will never be forgotten. I just kept thinking about that as a woman and as an actor. Like, he said, “You’re just a 40-year-old woman singing songs in a pub, it’s pathetic, it’s embarrassing.” Whoa. That’s how he views her. That’s how he views this really essential part of who she is and what means so much to her. How do you go back from that? What was said was said and it had been festering for a while. The only way to see yourself through something like that is to take a step back.\n\nDo you have any words of comfort for Jack and Rebecca fans ahead of season two?\n\nVentimiglia: Maybe they’ll want to go watch some repeats of happier times? (Laughs.) They’re a human couple. They’re a couple just like anyone else. They’re going to have their struggles and we’re now seeing the absolute toughest moments that they’re faced with. But if we learn anything from this show, it’s that there is light in a dark room. So take that in and hopefully we see them come together ... With the ticking clock of Jack’s death.\n\nMoore: I need some words of comfort, too! Ultimately, I love that this show forces people to hold a mirror up to their own lives and the choices that they’ve made. I love that it really pushes that nostalgia button in a way; it’s the perfect note to end the season on. It gives people a lot of time to think and I don’t think the impact of what happens at the end diminishes in time. I don’t know what to say to comfort people ... She wears her necklace! She still wears the moon necklace, so that has to mean something, right?\n\nThis Is Us is expected to return in the fall. What did you think of the finale? Sound off below and bookmark THR.com/ThisIsUs for more coverage. Click here for our finale interview with creator Dan Fogelman.\n\nTwitter: @amber_dowling", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "https://cdn1.thr.com/sites/default/files/2017/03/this_is_us_still_-_publicity_-_h_2017.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/01/greg_berlanti_sharon_horgan_alex_kurtzman_and_dwayne_johnson_-_getty_-_h_2020.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2017/03/this_is_us_still_-_publicity_-_h_2017.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/03/mrs._america_-_publicity_still_1-_h_2020_.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/blogicon_livefeed-black2.png"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/03/this_is_us_still_-_publicity_-_h_2017.jpg", "keywords": [], "authors": ["Amber Dowling", "Thrnews Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/live-feed/is-us-milo-ventimiglia-mandy-moore-finale-cliffhanger-986186", "title": "'This Is Us': Milo Ventimiglia, Mandy Moore on That Finale Cliffhanger", "meta_data": {"viewport": "width=device-width", "description": "Mandy Moore and Milo Ventimiglia break down the NBC drama’s first-season finale.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/live-feed/is-us-milo-ventimiglia-mandy-moore-finale-cliffhanger-986186", "domain": "https://www.hollywoodreporter.com/", "title": "'This Is Us': Milo Ventimiglia, Mandy Moore on That Finale Cliffhanger", "description": "Mandy Moore and Milo Ventimiglia break down the NBC drama’s first-season finale.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/03/this_is_us_still_-_publicity_-_h_2017.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "'This Is Us': Milo Ventimiglia, Mandy Moore on That Finale Cliffhanger", "description": "Mandy Moore and Milo Ventimiglia break down the NBC drama’s first-season finale.", "url": "https://www.hollywoodreporter.com/live-feed/is-us-milo-ventimiglia-mandy-moore-finale-cliffhanger-986186", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/03/this_is_us_still_-_publicity_-_h_2017.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "'This Is Us': Milo Ventimiglia, Mandy Moore on That Finale Cliffhanger", "sailthru.description": "Mandy Moore and Milo Ventimiglia break down the NBC drama’s first-season finale.", "sailthru.author": "Amber Dowling", "sailthru.channel": "Live Feed", "sailthru.vertical": "Live Feed", "sailthru.date": "2017-03-14 19:00:00", "sailthru.tags": "Live Feed, Television, Mandy Moore, Milo Ventimiglia, This Is Us"}, "movies": [], "publish_date": 1489489200.0, "source": "https://www.hollywoodreporter.com", "summary": ""}