{"url": "https://en.wikipedia.org/wiki/Lupita_Nyong%27o", "text": "Mexican-Kenyan actress and film director\n\nLupita Amondi Nyong'o ( , Kenyan English: [luˈpita ˈɲoŋo] (); Spanish: [luˈpita ˈɲoŋɡo]; born 1 March 1983) is a Kenyan-Mexican actress. The daughter of Kenyan politician Peter Anyang' Nyong'o, Nyong'o was born in Mexico City, where her father was teaching, and was raised in Kenya from the age of one. She attended college in the United States, earning a bachelor's degree in film and theater studies from Hampshire College.\n\nNyong'o began her career in Hollywood as a production assistant. In 2008, she made her acting debut with the short film East River and subsequently returned to Kenya to star in the television series Shuga (2009–2012). Also in 2009, she wrote, produced and directed the documentary In My Genes. She then pursued a master's degree in acting from the Yale School of Drama. Soon after her graduation, she had her first feature film role as Patsey in Steve McQueen's historical drama 12 Years a Slave (2013), for which she received critical acclaim and won several awards, including the Academy Award for Best Supporting Actress. She became the first Kenyan and Mexican actress to win an Academy Award.\n\nNyong'o made her Broadway debut as a teenage orphan in the play Eclipsed (2015), for which she was nominated for a Tony Award for Best Actress in a Play. She went on to perform a motion capture role as Maz Kanata in the Star Wars sequel trilogy (2015–2019) and a voice role as Raksha in The Jungle Book (2016). Nyong'o's career progressed with her role as Nakia in the Marvel Cinematic Universe superhero film Black Panther (2018) and her starring role in Jordan Peele's critically acclaimed horror film Us (2019).\n\nIn addition to acting, Nyong'o supports historic preservation. She is vocal about preventing sexual harassment and working for women's and animal rights. In 2014, she was named the most beautiful woman by People. Nyong'o has also written a children's book named Sulwe (2019), which became a number one New York Times Best-Seller.\n\nNyong'o was named among Africa's \"50 Most Powerful Women\" by Forbes in 2020.\n\nEarly life and background [ edit ]\n\nNyong'o was born on 1 March 1983 in Mexico City, Mexico,[2][3][4] to Kenyan parents, Dorothy Ogada Buyu[5][6] and Peter Anyang' Nyong'o, a college professor. The family had left Kenya in 1980 for a period because of political repression and unrest; Peter's brother, Charles Nyong'o, disappeared after he was thrown off a ferry in 1980.[7]\n\nNyong'o identifies as Kenyan-Mexican and has dual Kenyan and Mexican citizenship.[8][9] She is of Luo descent on both sides of her family, and is the second of six children.[10] It is a tradition of the Luo people to name a child after the events of the day, so her parents gave her a Spanish name, Lupita (a diminutive of Guadalupe).[11] Her father is a former Minister for Medical Services in the Kenyan government. At the time of her birth, he was a visiting lecturer in political science at El Colegio de México in Mexico City.[10][12] He later became a senior politician in Kenya.\n\nThe family returned to their native Kenya when Nyong'o was less than one year old,[11][13] as her father was appointed as a professor at the University of Nairobi.[10] She grew up primarily in Nairobi, and describes her upbringing as \"middle class, suburban\".[12] When she was 16, her parents sent her to Mexico for seven months to learn Spanish.[11][14] During those seven months, Nyong'o lived in Taxco, Guerrero, and took classes at the Universidad Nacional Autónoma de México's Learning Center for Foreigners.[14]\n\nNyong'o grew up in an artistic family, where get-togethers often included performances by the children, and trips to see plays.[15] She attended Rusinga International School in Kenya and acted in school plays.[5]\n\nAt the age of 14, Nyong'o made her professional acting debut as Juliet in Romeo and Juliet[5] in a production by the Nairobi-based repertory company Phoenix Players.[12][15] While a member of the Phoenix Players, Nyong'o also performed in the plays On The Razzle and There Goes The Bride.[16] Nyong'o cites the performances of American actresses Whoopi Goldberg and Oprah Winfrey in The Color Purple with inspiring her to pursue a professional acting career.[17][18]\n\nNyong'o later attended St. Mary's School in Nairobi, where she received an IB Diploma in 2001.[19] She went to the United States for college, graduating from Hampshire College with a degree in film and theatre studies.[20][21]\n\nIn 2013, her father was elected to represent Kisumu County in the Kenyan Senate and by 2017, he became Governor.[11][22] Nyong'o's mother is the managing director of the Africa Cancer Foundation and her own communications company.[15][16] Other family members include Tavia Nyong'o, a scholar and professor at New York University; Omondi Nyong'o, a pediatric ophthalmologist in Palo Alto, California, US; Kwame Nyong'o, one of Kenya's leading animators and leading technology expert; and Isis Nyong'o, a media and technology leader who was named one of Africa's most powerful young women by Forbes magazine.[23][24]\n\nCareer [ edit ]\n\nEarly work (2005–2012) [ edit ]\n\nNyong'o started her career working as part of the production crew for several films, including Fernando Meirelles's The Constant Gardener (2005), Mira Nair's The Namesake (2006), and Salvatore Stabile's Where God Left His Shoes (2007).[25] She cites Ralph Fiennes, the British star of The Constant Gardener, as someone who inspired her to pursue a professional acting career.[12]\n\nIn 2008, Nyong'o starred in the short film East River, directed by Marc Grey and shot in Brooklyn.[26] She returned to Kenya that same year and appeared in the Kenyan television series Shuga, an MTV Base Africa/UNICEF drama about HIV/AIDS prevention.[25] In 2009, she wrote, directed, and produced the documentary In My Genes, about the discriminatory treatment of Kenya's albino population.[10] It played at several film festivals and won first prize at the 2008 Five College Film Festival.[25] Nyong'o also directed the music video \"The Little Things You Do\" by Wahu, featuring Bobi Wine,[25] which was nominated for the Best Video Award at the MTV Africa Music Awards 2009.[25]\n\nNyong'o enrolled in a master's degree program in acting at the Yale School of Drama. At Yale, she appeared in many stage productions, including Gertrude Stein's Doctor Faustus Lights the Lights, Chekhov's Uncle Vanya, and William Shakespeare's The Taming of the Shrew and The Winter's Tale. While at Yale, she won the Herschel Williams Prize in the 2011–12 academic year for \"acting students with outstanding ability\" .[1]\n\nFilm and stage breakthrough (2013–2015) [ edit ]\n\nImmediately after graduating from Yale, Nyong'o landed her breakthrough role[27] when she was cast for Steve McQueen's historical drama 12 Years a Slave (2013).[12][15] The film, which met with wide critical acclaim, is based on the life of Solomon Northup (played by Chiwetel Ejiofor), a free-born African-American man of upstate New York who is kidnapped and sold into slavery in Washington, DC, in 1841. Nyong'o played the role of Patsey, a slave who works alongside Northup at a Louisiana cotton plantation; her performance met with rave reviews.[28] Ian Freer of Empire wrote that she \"gives one of the most committed big-screen debuts imaginable,\" and critic Peter Travers added that she \"is a spectacular young actress who imbues Patsey with grit and radiant grace\".[29][30]\n\nNyong'o was nominated for several awards for 12 Years a Slave, including a Golden Globe Award for Best Supporting Actress, a BAFTA Award for Best Actress in a Supporting Role, and two Screen Actors Guild Awards, including Best Supporting Actress, which she won.[31] She was also awarded the Academy Award for Best Supporting Actress, becoming the sixth black actress to win the award. She is the first African actress to win the award, the first Kenyan actress to win an Oscar, and the first Mexican to win the award.[32][33] She was the 15th actress to win an Oscar for a debut performance in a feature film.[34]\n\nFollowing a supporting role in the action-thriller Non-Stop (2014),[35] Nyong'o co-starred in Star Wars: The Force Awakens (2015) as Force-sensitive space pirate Maz Kanata, a CGI character created using motion capture technology.[36][37] Nyong'o said that she had wanted to play a role where her appearance was not relevant. The acting provided a different challenge from her role as Patsey.[38] Scott Mendelson of Forbes characterised Nyong'o's role as \"the center of the film's best sequence,\" and Stephanie Zacharek of Time called her a \"delightful minor character\".[39][40] Nyong'o was nominated for the Best Supporting Actress at the 42nd Saturn Awards and Best Virtual Performance at the 2016 MTV Movie Awards for her role.[41][42]\n\nIn 2015, Nyong'o returned to stage with a starring role as an unnamed girl in the play Eclipsed, written by Danai Gurira.[43] The play takes place during the chaos of the Second Liberian Civil War, where the captive wives of a rebel officer band together to form a community, until the balance of their lives are upset by the arrival of a new girl (played by Nyong'o). Eclipsed became The Public Theater's fastest-selling new production in recent history[44] and won Nyong'o an Obie Award for Outstanding Performance.[45] The play premiered on Broadway at the John Golden Theatre the following year.[46] It was the first play to premiere on Broadway with an all-black and female creative cast and crew.[47][48] Nyong'o said that she understudied the play at Yale in 2009 and was terrified to play the character on stage.[49] Her performance met with critical acclaim. The New York Times' critic Charles Isherwood called Nyong'o \"one of the most radiant young actors to be seen on Broadway in recent seasons, shines with a compassion that makes us see beyond the suffering to the indomitable humanity of its characters.\"[50] Nyong'o's performance in Eclipsed earned her a Theatre World Award for Outstanding Broadway or Off-Broadway Debut Performance and a nomination for the Tony Award for Best Actress in a Play.[51] In addition, she was nominated for Outstanding Actress in a Play at the Outer Critics Circle Award and a Distinguished Performance Award at the Drama League Award.[52][53][54][55] Nyong'o said that she turned down Hollywood films for the part.[56]\n\nMotion capture roles, Black Panther and Us (2016–present) [ edit ]\n\nNyong'o co-starred in Jon Favreau's The Jungle Book (2016), a live-action/CGI adaptation of its 1967 animated original, voicing Raksha, a mother wolf who adopts Mowgli (played by Neel Sethi).[57] Robbie Collin of The Daily Telegraph wrote in his review that Nyong'o brought a \"gentle dignity\" to her role.[58] She later co-starred in Mira Nair's Queen of Katwe (2016), a biopic based on the true story about the rise of a young Ugandan chess prodigy,[59] Phiona Mutesi (played by Madina Nalwanga), who becomes a Woman Candidate Master after her performances at World Chess Olympiads. Nyong'o played Phiona's protective mother, Nakku Harriet.[60] Brian Tallerico of RogerEbert.com said, \"Nyong'o is phenomenal. She has an incredible ability to convey backstory.\"[61] Geoff Berkshire of Variety called Nyong'o's performance \"Simply radiant in her first live action role since winning an Oscar for 12 Years a Slave [...] she imbues what could have been a stock mother figure with such inner fire that Harriet feels worthy of a movie all her own.\"[62]\n\nNyong'o reprised her role as Maz Kanata in Rian Johnson's Star Wars: The Last Jedi (2017), as well as in the animated series Star Wars Forces of Destiny.[63] The following year, she starred as spy Nakia, a former member of Dora Milaje, a team of women who serve as special forces of Wakanda and personal bodyguards to T'Challa / Black Panther (Chadwick Boseman), in Ryan Coogler's superhero film Black Panther (2018), which marked the eighteenth film in the Marvel Cinematic Universe.[64] In preparation for the role, Nyong'o learned to speak Xhosa and undertook judo, jujitsu, silat, and Filipino martial arts training.[65][66] David Betancourt of The Washington Post wrote that the film \"takes superhero cinema where it's never gone before by not being afraid to embrace its blackness\"; he particularly praised Nyong'o's portrayal of her character for avoiding stereotypical depictions of a black leading lady, writing that she \"throws punches, shoots guns and steals hearts in a role she seems born for.\"[67] Black Panther earned over $1.34 billion to emerge as the eleventh highest-grossing film of all time.[68] Nyong'o received a Saturn Award for Best Actress nomination for the film.[69]\n\nFollowing the success of Black Panther, Nyong'o starred as a kindergarten teacher dealing with a zombie apocalypse in the comedy horror film Little Monsters (2019). Amy Nicholson of Variety disliked the film but wrote that Nyong'o's \"deadpan humor and grace ennoble the slapstick\".[70] The 2019 South by Southwest marked the premiere of her next release, Jordan Peele's psychological horror film Us. It tells the story of a family who are confronted by their doppelgängers.[71][72] Emily Yoshida of New York magazine labeled her dual role \"astounding\" and found her portrayal of the doppelgänger to be \"an achievement on another level; a physical, vocal, and emotional performance so surgical in its uncanniness that it almost feels like it could not be the work of a flesh-and-blood human.\"[73] Us earned over $252 million against a budget of $20 million.[74] At Universal Studios Hollywood's Halloween Horror Nights, Nyong'o attended a maze inspired by the film and appeared inside the attraction dressed as her character Red.[75] Nyong'o earned a Screen Actors Guild nomination for Outstanding Performance by a Female Actor in a Leading Role and won an NAACP Image Award for Best Actress.[76]\n\nAlso in 2019, Nyong'o narrated the Discovery Channel drama series Serengeti, about wildlife in the Serengeti ecosystem.[77] She hosted the Channel 4's documentary Warrior Women with Lupita Nyong’o, in which she undertook a journey across Benin, West Africa to search for the Dahomey Amazons.[78] Nyong'o reprised her role as Maz Kanata for the third time in Star Wars: The Rise of Skywalker, which marked the final installment of the Star Wars sequel trilogy.[79]\n\nUpcoming projects [ edit ]\n\nNyong'o will next star in Simon Kinberg's ensemble spy-thriller 355 (2021), alongside Jessica Chastain, Penélope Cruz, Fan Bingbing, and Diane Kruger.[80] She is developing a television series based on Chimamanda Ngozi Adichie's novel Americanah, which she will produce and star in.[81] She will produce and star in Born a Crime, a film adaptation of Trevor Noah's memoir of the same name, in which she will play Noah's mother, Patricia.[82] She will also star alongside Viola Davis in The Woman King, a drama based on the Dahomey Amazons.[83] She will be reuniting with director Abe Forsythe and the creative team behind the horror comedy film Little Monsters for a starring role in a science fiction comedy film.[84]\n\nPersonal life and off-screen work [ edit ]\n\nNyong'o resides in Brooklyn, New York.[85] She is a fluent speaker of Swahili, Spanish, Luo, and English.[14] On 27 February 2014, at the Essence Black Women In Hollywood luncheon in Beverly Hills, she gave a speech on the beauty of black women and talked about the insecurities she had as a teenager. She said her views changed when she saw South Sudanese supermodel Alek Wek become successful.[86]\n\nIn 2014, the National Trust for Historic Preservation recruited Nyong'o in an effort to oppose development, including a new minor league baseball stadium, in the Shockoe Bottom area of Richmond, Virginia.[87] The historic neighborhood, one of Richmond's oldest, was the site of major slave-trading before the American Civil War. On 19 October 2014, Nyong'o sent a letter to Richmond Mayor Dwight C. Jones, which she posted on social media sites, asking him to withdraw support for the development proposal.[88] She later lend her voice in Conservation International's \"Nature is Speaking\" campaign as the flower.[89]\n\nIn June 2015, Nyong'o returned to Kenya and announced that she will advocate globally for elephants with the international conservation organization WildAid, as well as promote women's issues, acting and the arts in Kenya. WildAid announced Nyong'o as their Global Elephant Ambassador.[90]\n\nNyong'o is involved in the organization Mother Health International, which is dedicated to providing relief to women and children in Uganda by creating locally engaged birthing centers. She said she'd never thought much about birthing practices until her sister introduced her to MHI executive director Rachel Zaslow. Nyong'o felt bringing attention to such important but overlooked issues is a mandate for her as an artist. She was honored for her work in 2016 by Variety.[91]\n\nIn April 2016, Nyong'o launched an anti-poaching \"hearts and minds\" campaign with her organization Wildaid in advance of Kenya Wildlife Service's history-making ivory burn that occurred 30 April. The Kenyan government burned 105 tonnes of ivory and 1.35 tonnes of rhino horn in a demonstration of their zero tolerance approach to poachers and smugglers who were threatening the survival of elephants and rhinoceros in the wild.[92][93]\n\nIn October 2017, Nyong'o wrote an op-ed for The New York Times, in which she revealed that Hollywood producer Harvey Weinstein sexually harassed her twice in 2011, while she was a student at Yale. She vowed that she would never work with Weinstein, hence her declining a role in Southpaw (2015). Nyong'o also wrote about her commitment to work with women directors or male feminist directors, who had not abused their power.[94] This op-ed was part of a collection of stories done by The New York Times and The New Yorker which won the 2018 Pulitzer Prize for Public Service.[95]\n\nNyong'o made her writing debut with a book entitled Sulwe (2019), which is published by Simon & Schuster Books for Young Readers. Sulwe (Luo for \"star\") is the story of a five-year-old Kenyan girl, who has the darkest complexion in her family, for which Nyong'o drew upon her own childhood experiences.[96] The book became a New York Times Best-Seller.[97] Sulwe was selected for the 2020 Illustrator Honor at the Coretta Scott King Awards and won for Outstanding Literary Work – Children at the 2020 NAACP Image Awards.[98][76]\n\nIn September 2019, Nyong'o became an ambassador for Michael Kors' \"Watch Hunger Stop\" campaign.[99] In October, Nyong'o and her mother were honored at The Harlem School of the Arts' Mask Ball with a \"Visionary Lineage Award\". Then, she was honored at WildAid to receive the \"Champion of the Year\" award in November.[100][101]\n\nIn January 2020, she narrated the Hayden Planetarium space show Worlds Beyond Earth.[102]\n\nIn the media [ edit ]\n\nNyong'o was mentioned in Christian rapper Lecrae's song \"Nuthin'\" from his 2014 album Anomaly and was referenced by Jay-Z in his verse from Jay Electronica's song \"We Made It\". She was also mentioned in the parody song \"American Apparel Ad Girls\" by the drag queens Willam Belli, Courtney Act and Alaska Thunderfuck.[103] Nyong'o was mentioned in the 2015 African song \"Nerea\" by Kenyan afro-pop band Sauti Sol.[104] Rapper Nicki Minaj mentioned Lupita in her verse on A$AP Ferg's remix of \"Plain Jane\" and was referenced by rapper Wale in his song \"Black is Gold\".[105][106] Singer Beyoncé mentioned Nyong'o in the single \"Brown Skin Girl\" from The Lion King Soundtrack (2019).[107]\n\nMs. Nyong'o on the cover of\n\nNyong'o was included in Derek Blasberg's 2013 best-dressed list in Harper's Bazaar.[15] In 2014, she was chosen as one of the faces for Miu Miu's spring campaign, with Elizabeth Olsen, Elle Fanning and Bella Heathcote. She has also appeared on the covers of several magazines, including New York's spring fashion issue[108] and the UK magazine Dazed & Confused.[109] In April of that year, she was named \"The Most Beautiful Woman\" by People.[110] and was named the new face of Lancôme, making her the first black woman to appear on the brand.[111] Later that November, she was named \"Woman of the Year\" by Glamour.[112]\n\nNyong'o was on the July 2014 cover of Vogue, making her the second African woman[113] and ninth black woman[114] to cover the magazine. That same month she also appeared on the cover of July's issue of Elle (France). She appeared on the October 2015 issue of American Vogue, making it her second cover in a row.[115] That month, Congressman Charles Rangel and Voza Rivers, the head of the New Heritage Theatre Group, announced the day is officially \"Lupita Nyong'o Day\" in Harlem, New York. The honor was announced as a surprise during an open discussion between Nyong'o and image activist Michaela Angela Davis at Mist Harlem.[116]\n\nNyong'o was included in Annie Leibovitz's 2016 Vanity Fair's Hollywood Issue.[117] Nyong'o was honored with a caricature portrait in May 2016 at Sardi's restaurant in New York City for her debut on Broadway.[118] That July, she was chosen as one of the first celebrities, alongside with Elle Fanning, Christy Turlington Burns, and Natalie Westling to star in Tiffany & Co.'s Fall 2016 campaign styled by Grace Coddington.[119] Nyong'o appeared on Vogue′s October 2016 cover, making it her third issue. That month, she was an honoree at the 2016 Elle Women in Hollywood Awards.[120]\n\nIn January 2017, she appeared on the cover of Vanity Fair's Hollywood Issue.[121] She later appeared on the cover of UK's The Sunday Times Magazine for their October '17 issue.[122] On November 2017, she appeared on the cover of Grazia UK magazine. She later expressed her disappointment with the cover on social media for altering her hair to fit European standards of what hair should look like. Photographer An Le later apologized in a statement, saying it was \"an incredibly monumental mistake\".[123] Nyong'o often speaks out about embracing her \"African kinky hair\" and collaborates with hairdresser Vernon François to show how versatile her hair texture is.[124]\n\nIn December 2017, Nyong'o landed her fourth Vogue cover in a row for the January '18 issue, making her the first black actress to do so.[125] She was also included in Tim Walker's 2018 Alice's Adventures in Wonderland - themed Pirelli Calendar as character The Dormouse.[126]\n\nIn June 2018, The Hollywood Chamber of Commerce announced Nyong'o will be among the honorees to receive a star on the Hollywood Walk of Fame in the film category.[127] The following month, Nyong'o starred with fellow actress Saoirse Ronan for a Calvin Klein campaign for their new fragrance entitled \"Calvin Klein Women\". The campaign features both striking, minimalist portraits of the award-winning actresses alongside women they have personally been inspired by, where Nyong'o named Eartha Kitt and Katharine Hepburn as her inspirations.[128] In October 2018, Nyong'o became a two-time honoree, alongside her Black Panther co-stars Danai Gurira and Angela Bassett for Elle magazine's \"Women in Hollywood\" issue.[129] Nyong'o appeared on the cover of Vogue España's November '18 edition.[130] Nyong'o is a 2019 Hollywood Walk of Fame honoree.[131]\n\nNyong'o appeared on the cover of Vanity Fair's October '19 issue.[132] In November, she made her music debut with her debut single “Sulwe’s Song” which she wrote for her book “Sulwe.” She was also featured on singer Ciara's song \"Melanin\" under the moniker, \"Troublemaker\" along with La La Anthony, City Girls, and Ester Dean.[133]\n\nNyong'o made her first appearance on British Vogue's February '20 cover.[134] In March 2020, she appeared on Africa's \"50 Most Powerful Women\" list by Forbes.[135]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nYear Title Role Notes 2009–2012 Shuga Ayira 5 episodes 2017–2018 Star Wars Forces of Destiny Maz Kanata (voice) 32 episodes 2018 Star Wars Rebels Archive recording;\n\nEpisode: \"A World Between Worlds\" 2019 Serengeti Narrator Documentary 2020 Americanah Ifemelu Upcoming miniseries, also executive producer\n\nVideo games [ edit ]\n\nYear Title Voice role Notes 2016 Lego Star Wars: The Force Awakens Maz Kanata[136]\n\nCrew member [ edit ]\n\nStage [ edit ]\n\nBibliography [ edit ]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/3/34/SXSW_2019_4_%2847282558132%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Ms._magazine_Cover_-_Spring_2016.jpg/170px-Ms._magazine_Cover_-_Spring_2016.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Loudspeaker.svg/11px-Loudspeaker.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/SXSW_2019_4_%2847282558132%29_%28cropped%29.jpg/220px-SXSW_2019_4_%2847282558132%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Lupita_Nyong%27o_%2882038%29_%28cropped%29.jpg/170px-Lupita_Nyong%27o_%2882038%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Lupita_Nyong%27o_by_Gage_Skidmore.jpg/170px-Lupita_Nyong%27o_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/12_Years_a_Slave_NYFF_%281%29.jpg/260px-12_Years_a_Slave_NYFF_%281%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/3/34/SXSW_2019_4_%2847282558132%29_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Lupita_Nyong%27o", "title": "Lupita Nyong'o", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/3/34/SXSW_2019_4_%2847282558132%29_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}