{"url": "https://www.harpersbazaar.com/uk/culture/entertainment/a14756804/season-2-big-little-lies/", "text": "This article contains spoilers for the first season of Big Little Lies.\n\nThe second season of Big Little Lies was confirmed by HBO at the end of 2017, and after series one triumphed at the Golden Globes (winning Best Television Limited Series, plus individual awards for Nicole Kidman, Alexander Skarsgård and Laura Dern), expectations are high.\n\nShailene Woodley took to Instagram to share the first official promo picture from the second series, which shows the five leading characters taking part in an identity parade - still wearing the same Audrey Hepburn costumes from that fateful night in the finale of the first season.\n\nThe other cast members have also been taking to Instagram to share teasers, including Nicole Kidman:\n\nHere's everything we know about season two so far...\n\nThe release date\n\nThe second series will land on 9 June 2019 on HBO with Sky Atlantic sure to follow suit.\n\nHBO\n\nFilming started in March 2018 - confirmed by Witherspoon during an appearance on Late Night with Seth Meyers - and shortly afterwards the lead stars started sharing behind-the-scenes images on social media.\n\n\n\n\n\nThis was closely followed by a snap of Reese Witherspoon and Laura Dern on set.\n\nThe plot\n\nThe first series of Big little Liars was based on the book of the same name by Liane Moriarty, focusing on Madeline (Reese Witherspoon), Celeste (Nicole Kidman) and Jane (Shailene Woodley), and how their seemingly perfect lives unravelled to the point of murder.\n\nBig Little Lies cast in season 2 HBO\n\nBut what can we expect from the second instalment? More stories exploring friendship, marriage and parenting it seems, plus - of course - \"the malignancy of lies\".\n\n\"[Moriarty] came up with a novella, which was key. David took it and thought, 'Is there something I can do with it?'\" Bloys told Vulture. \"Reese and Nicole were involved, and they felt that there was more life in the characters. Everybody approached it from a place of love and care [for] these characters and this property, and again, with a little dose of skepticism along the way.\"\n\nHBO\n\nWitherspoon said in a statement that season 2 provides \"the opportunity to delve deeper into the lives of these intriguing and intricate Monterey families and bring more of their stories back to the audience who embraced and championed them.\"\n\n“This is inspired by the overwhelming response from audiences around the world,\" added Kidman. \"What a journey this has been. I’m so grateful to have this opportunity to keep exploring these female characters and make this series with my friends.”\n\n\n\nReese Witherspoon and Zoe Kravitz look intense in season 2 HBO\n\nHBO describes the second series like so: \"The subversive, darkly comedic drama Big Little Lies will explore the malignancy of lies, the durability of friendships, the fragility of marriage and, of course, the vicious ferocity of sound parenting. Relationships will fray, loyalties will erode… the potential for emotional and bodily injury shall loom.\"\n\nThe director\n\nWhile the first season was helmed by Canadian director Jean-Marc Vallée (known for his work on Dallas Buyers Club and alongside Witherspoon in Wild), the second series will be directed by English filmmaker Andrea Arnold. Her work has won several accolades at the Cannes Film Festival, and she recently directed three episodes of the Emmy-winning series Transparent.\n\n\"I’m beyond excited to be working with talented and acclaimed director Andrea Arnold who will be at the helm,\" said Witherspoon. \"Andrea’s unique storytelling style will be a welcome addition to the filmmaking team.”\n\nWitherspoon paid tribute to Vallée backstage at the 2018 Golden Globes following Big Little Lies' award win for Best Television Limited Series.\n\nThe ’Big Little Lies’ cast at the 2018 Golden Globes Getty Images\n\n“We are so deeply grateful to Jean-Marc Vallée,” she said. “His vision for these characters — he put his artistry and his heart and soul into it. His musical taste is all over this miniseries. Unfortunately, he was busy.\n\n“We did try and accommodate, but we wanted to get the second season going soon. We were lucky to have Andrea Arnold sign on to the family. Jean-Marc has welcomed her to the family and we’re thrilled to have her on board.”\n\nThe cast\n\nThe entire main first-season cast has been confirmed to return. When HBO announced the new series, it noted that Witherspoon, Kidman and Woodley would all be starring. It was later confirmed that Shailene Woodley, Zoe Kravitz and Laura Dern would all also be reappearing - as will Kathryn Newton, who plays Madeleine (Witherspoon)'s daughter Abigail. Adam Scott will also be reprising his role as Ed Mackenzie.\n\nAccording to reports, Witherspoon and Kidman have negotiated a pretty substantial pay rise for the second series and will each be taking home $1 million per episode. According to The Hollywood Reporter they both earned around $250,000 per episode for season one. It's believed that Woodley, Dern and Kravitz will also be getting a sizeable bump in pay.\n\nThe big news, of course, centres around a new addition to the cast; Meryl Streep is moving to Monterey. The Oscar-winning actress, who invited herself to join the cast without even having seen the script, is set to shake things up as Celeste's mother-in-law, Mary Louise Wright. Witherspoon confirmed the casting via Instagram.\n\nMary Louise's son, Perry, who was played by Alexander Skarsgård, met his demise at the end of season one and it seems as though his mother has come to town to ask questions. According to on-set pictures which were captured during filming, Mary Louise finds herself on the wrong side of Madeleine, who was seen throwing an ice cream at her.\n\n\n\nIt was later reported that Streep went to great lengths in order to play a realistic mother to Skarsgård's character, wearing prosthetic teeth throughout filming in order to replicate a similar smile to the Swedish actor.\n\nThe rumours were confirmed by her hair and make-up artist, J. Roy Helland, who told Refinery29: “She needed to be believable as Perry’s mother.\"\n\nMonica Schipper Getty Images\n\nBut what of Skarsgård's character, Perry? Despite his death being shown in the season one finale, the actor was notably coy when asked about the second series at the Golden Globes.\n\n“I don’t even know if I’m really dead or not,” he told NBC. \"We'll see.\"\n\nWatch this space...\n\nIn terms of other new characters, Crystal R Fox has been cast as Bonnie Carlson's mother, Elizabeth Howard, Mo McRae will play Michael Perkins, a new teacher at Otter Bay Elementary School and finally, Douglas Smith will be joining the cast as an \"off-beat surfer, aspiring marine biologist and Jane’s co-worker\" Corey Brockfield.\n\nWill there be a third series?\n\nAlthough it seemed unlikely that Big Little Lies would even have a second series given it was initially based on one book, a third series has been ruled out entirely.\n\n“There's no such plan now (for a season three),\"Big Little Lies executive producer and showrunner David E. Kelly said during the show's appearance at the 2019 TCA winter press tour. \"We like where our closure is at the end of season 2.”", "images": ["https://hips.hearstapps.com/elleuk.cdnds.net/18/02/4000x2000/1515388792-gettyimages-902728410-1515376659fix-index2-1515381122.jpg?resize=300:*", "https://hips.hearstapps.com/hbz.h-cdn.co/assets/17/14/1024x512/landscape-1491331514-ep04-ss02-1024.jpg?resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2019-01-07-at-17-40-48-1546883175.png?crop=1.00xw:0.929xh;0,0&resize=1200:*", "https://www.harpersbazaar.com/sites/harpersbazaar/assets/images/logos/ipso_regulated_hires.png", "https://hips.hearstapps.com/harpersbazaaruk.cdnds.net/17/23/1600x800/landscape-1496911375-nicole-kidman.jpg?resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2019-01-07-at-17-40-48-1546883175.png?crop=1.00xw:0.929xh;0,0&resize=1200:*", "keywords": [], "authors": ["Jessica Davis"], "canonical_link": "https://www.harpersbazaar.com/uk/culture/entertainment/a14756804/season-2-big-little-lies/", "title": "Everything you need to know about season 2 of Big Little Lies", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#606060", "og": {"type": "article", "site_name": "Harper's BAZAAR", "title": "Everything you need to know about season 2 of 'Big Little Lies'", "description": "From the release date to new cast members", "url": "https://www.harpersbazaar.com/uk/culture/entertainment/a14756804/season-2-big-little-lies/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2019-01-07-at-17-40-48-1546883175.png?crop=1.00xw:0.929xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 214308048603671}, "article": {"publisher": "https://www.facebook.com/harpersbazaaruk", "modified_time": "2019-06-03 09:02:58", "published_time": "2019-06-03 09:02:00", "section": "Entertainment", "opinion": "false"}, "twitter": {"site": "@BazaarUK", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2019-01-07-at-17-40-48-1546883175.png?crop=1.00xw:0.929xh;0,0&resize=640:*"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "title": "All you need to know about season 2 of Big Little Lies", "description": "Everything from the release date to the cast", "keywords": "Big Little Lies, season 2, second, series, Nicole Kidman, Reese Witherspoon, Shailene Woodley, Meryl Streep,", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2019-01-07-at-17-40-48-1546883175.png?crop=0.540xw:1.00xh;0.231xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Culture,culture,entertainment", "sailthru.date": "2019-06-03T09:02:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2019-01-07-at-17-40-48-1546883175.png?crop=1.00xw:0.929xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/screen-shot-2019-01-07-at-17-40-48-1546883175.png?crop=0.540xw:1.00xh;0.231xw,0", "sailthru.socialtitle": "Everything you need to know about season 2 of 'Big Little Lies'", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1559523720.0, "source": "https://www.harpersbazaar.com", "summary": ""}