{"url": "https://fansided.com/2018/02/01/riverdale-recap-season-2-episode-12-the-wicked-and-the-divine-review/", "text": "Who cut the head off of the General Pickens statue and what is going on in the Cooper house? Find out in this recap of Wednesday’s episode of Riverdale.\n\nIt really says a lot about the state of Riverdale‘s second season that “Dark Betty” chatting with strangers online is not even the craziest thing that happened in the Cooper house this episode, let alone the entire episode. “Dark Betty” turned out to be just a small part of an hour that included mob hits and the fallout from General Pickens’ missing head.\n\nThis week’s episode can basically be divided into two large storylines: the events that involve Archie and Veronica, and the events that involve Betty and Jughead. So that is how this recap will be structured.\n\nArchie and Veronica\n\nThe episode opens with a montage of what life is like for Archie Andrews now that he is Hiram Lodge’s intern. It is a lot of running around town doing errands. It keeps Archie so busy that he has not had any time to check in with Special Agents Adams.\n\nSee, it is a special time for the Lodge family as it is finally time for Veronica’s Confirmation. Even though it is an event that usually happens when a person is 12 or 13, the Lodges waited because of the availability of the family priest. (Of course, the real reason for the delay is plot).\n\nAnyway, the event means the entire Lodge family is coming to Riverdale, and this includes Hiram’s crime family, Yes, Hiram is now a mobster, just go with it. So, Special Agent Adams sees Veronica’s Confirmation as the perfect place to use Archie to take down not only Hiram, but his entire crime family. Too bad Archie is much more concerned with making sure that Veronica has a good Confirmation rather than taking down the mob.\n\nSpeaking of Veronica, she is being showered with gifts. As Hermione points out, gifts are a way to try and get back into the family’s good graces. This explains why the St. Clairs sent a gift even after everything that happened between the two families. The gift also acts as the perfect method of letting Hiram and Hermione know about Archie’s visit with Nick in the winter premiere.\n\nRather than getting Archie in trouble, the news that he beat up Nick scores him an invite to work at a poker game for Hiram and his inner circle. Veronica is furious that her father is letting good, wholesome Archie get so close to the family business. Hiram explains that if Archie plans on sticking around, eventually he will have to be brought into the fold or never really be part of the family.\n\nOn the other side, Special Agent Adams is all for Archie going to the poker game. This is the closest the FBI has ever been to catching Hiram with his crime family. To that end, Adams wants Archie to wear a wire, something Archie doesn’t want to do, as it becomes clear that Archie is far from on board with taking down his girlfriend’s father.\n\nAnyway, the poker game is at Pops because where else would it be in Riverdale? Here we are introduced to a bunch of new people, but the important one is a man known as Papa Poutine. The name comes from the fact that he owns a hot dog chain in Quebec. Okay, I get that this is an American show, but poutineries are a real thing all over Canada and it would have made a lot more sense for Papa Poutine to own a chain of poutineries. The Riverdale equivalent of Smoke’s Poutinerie.\n\nSorry for the poutine rant, back to the episode, where Papa Poutine insults Pop for making a bad poutine (it really is all about the cheese curds). Hiram defends Pop and reveals that he now owns the place, something Archie was in the dark about.\n\nArchie learns even more while he is unclogging the toilet. He overhears Papa Poutine, who is talking with one of the other poker players outside. They agree that Hiram went too far when he had Nick injured. Therefore, they plan on taking Hiram out after Veronica’s Confirmation.\n\nAt the Confirmation, Veronica sings “Bittersweet Symphony” with Josie as it is part of the McCoys apologizing for Josie refusing to sing at Pickens Day with Veronica. Hopefully, this also means that Josie gets the Pussycats back. Veronica also sees Archie as a ray of light and tells her father she wants him to be kept far away from the business.\n\nToo late. Archie warns Hiram that Papa Poutine is planning on taking him out. And when Veronica admits to him that her dad is not the best guy, Archie says he doesn’t care that her dad is a mobster. He loves her and that is what matters. Even more than helping the FBI. Adams reveals that Papa Poutine was found dead and he wants to know if Archie knows anything that could help. Archie decides to not tell Adams anything.\n\nJughead and Betty\n\nBetty has decided to follow in her brother’s footsteps and deal with he “darkness” by chatting with strangers over web cam in her “Dark Betty” outfit. Alas, Riverdale does not have time to deal with a 16-year-old having sex online with strangers because there is a headless statue to deal with.\n\nOf course, after the events of last week’s episode, the Serpents are being blamed and a lot of heat is falling on Jughead. He wrote the article that exposed the truth about General Pickens, so he gets suspended from the Blue and Gold, along with Betty.\n\nJughead is upset that Betty is being dragged into what us now just an attack on the Serpents. Mayor McCoy is using the statue incident to have the Serpents evicted from the trailer park. And the Serpents, including FP, are blaming Jughead for bringing all this on them.\n\nThings only get worse for Jughead when Tall Boy brings Penny Peabody back to Riverdale to fight the eviction notices. She is willing to help, but only if she gets her revenge for what Jughead did to her. By cutting off her tattoo, Jughead broke the Serpent code and is now facing being voted out.\n\nSeeing as being a Serpent is his entire character now, Jughead will do anything to stay in, which includes asking Betty for help. He tried confronting Mayor McCoy first, but she can’t do anything to help as the Lodges control her. So it is up to Betty and Jughead to figure out what actually happened to the statue.\n\nJust in time to stop the vote that will remove Jughead from the Serpents, Betty, Jughead and FP walk in with General Pickens’ head. Turns out that it was Tall Boy who removed the head. He was acting on instructions from Hiram Lodge in an effort to cause more chaos within the Serpents to get rid of FP and Jughead.\n\nTall Boy is exiled from the Serpents and Jughead and Betty rekindle their relationship. All while Alice and Chic are having dinner together wondering where she is. Hal has left because Alice and Betty won’t kick Chic out.\n\nThere is a knock at the door and it is someone looking for Chic. Earlier in the episode, Chic warned Betty that boundaries are important, the people they interact with online can never find out where they live. Clearly Chic did something wrong.\n\nWhen Betty gets home, Alice is on the ground cleaning the floor next to the dead body of the guy who came looking for Chic. And Riverdale has a murder mystery to solve again.", "images": ["https://imagesvc.timeincapp.com/v3/fan/image?url=https://fansided.com/wp-content/assets/site_images/fansided/headers/logo-tv__150x150.png", "https://fansided.com/wp-content/themes/fansided-v5/assets/images/apple-app.png", "https://www.facebook.com/tr?id=1578981752316085&ev=PageView&noscript=1", "https://images2.minutemediacdn.com/image/fetch/w_850,h_560,c_fill,g_auto,f_auto/https%3A%2F%2Ffansided.com%2Fwp-content%2Fuploads%2Fgetty-images%2F2017%2F12%2F857276734-the-tonight-show-starring-jimmy-fallon-season-4.jpg-850x560.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=6035728&cv=2.0&cj=1", "https://images2.minutemediacdn.com/image/fetch/w_2000,h_2000,c_fit/https%3A%2F%2Ffansided.com%2Fwp-content%2Fuploads%2Fgetty-images%2F2017%2F12%2F857276734-the-tonight-show-starring-jimmy-fallon-season-4.jpg.jpg", "https://cdn.fansided.com/wp-content/assets/site_images/fansided/logo_fansided-com__150x150.png", "https://fansided.com/wp-content/themes/fansided-v5/assets/images/android-app.png", "https://cdn.fansided.com/wp-content/themes/fansided-v5/assets/images/fansided-logo.svg"], "top_img": "https://images2.minutemediacdn.com/image/fetch/w_2000,h_2000,c_fit/https%3A%2F%2Ffansided.com%2Fwp-content%2Fuploads%2Fgetty-images%2F2017%2F12%2F857276734-the-tonight-show-starring-jimmy-fallon-season-4.jpg.jpg", "keywords": [], "authors": ["Joe Romano", "Harrison Hamm", "Brittany Frederick", "Mike Chiari", "Leah Smith"], "canonical_link": "https://fansided.com/2018/02/01/riverdale-recap-season-2-episode-12-the-wicked-and-the-divine-review/", "title": "Riverdale season 2, episode 12 recap: The Wicked and the Divine", "meta_data": {"HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1.0", "description": "Who cut the head off of the General Pickens statue and what is going on in the Cooper house? Find out in this recap of Wednesday's episode of Riverdale.", "DC.date.issued": "2018-02-01T11:03:07-05:00", "generator": "WordPress 4.9.13", "twitter": {"card": "summary_large_image", "site": "@fansided", "title": "Riverdale season 2, episode 12 recap: The Wicked and the Divine", "description": "Who cut the head off of the General Pickens statue and what is going on in the Cooper house? Find out in this recap of Wednesday's episode of Riverdale. It...", "creator": "@leah8lms2smith", "image": {"src": "https://images2.minutemediacdn.com/image/fetch/w_2000,h_2000,c_fit/https%3A%2F%2Ffansided.com%2Fwp-content%2Fuploads%2Fgetty-images%2F2017%2F12%2F857276734-the-tonight-show-starring-jimmy-fallon-season-4.jpg.jpg"}, "domain": "https://fansided.com", "app": {"name": {"iphone": "FanSided", "ipad": "FanSided", "googleplay": "FanSided"}, "id": {"iphone": 553311886, "ipad": 553311886, "googleplay": "com.noticesoftware.FanSided"}}}, "og": {"type": "article", "title": "Riverdale season 2, episode 12 recap: The Wicked and the Divine", "url": "https://fansided.com/2018/02/01/riverdale-recap-season-2-episode-12-the-wicked-and-the-divine-review/", "image": "https://images2.minutemediacdn.com/image/fetch/w_2000,h_2000,c_fit/https%3A%2F%2Ffansided.com%2Fwp-content%2Fuploads%2Fgetty-images%2F2017%2F12%2F857276734-the-tonight-show-starring-jimmy-fallon-season-4.jpg.jpg", "site_name": "FanSided", "description": "Who cut the head off of the General Pickens statue and what is going on in the Cooper house? Find out in this recap of Wednesday's episode of Riverdale. It..."}, "fb": {"admins": "10105391,1369422511"}, "article": {"author": "https://fansided.com/author/lsmith/", "published_time": "2018-02-01T11:03:07+00:00"}, "al": {"ios": {"url": "fansided://fansided.com/2018/02/01/riverdale-recap-season-2-episode-12-the-wicked-and-the-divine-review/app/", "app_store_id": 553311886, "app_name": "FanSided"}, "android": {"url": "fansided://fansided.com/2018/02/01/riverdale-recap-season-2-episode-12-the-wicked-and-the-divine-review/app/", "app_name": "FanSided", "package": "com.noticesoftware.FanSided"}, "web": {"url": "https://fansided.com/2018/02/01/riverdale-recap-season-2-episode-12-the-wicked-and-the-divine-review/"}}, "theme-color": "#073759", "mobile-web-app-capable": "yes", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "format-detection": "telephone=no", "msapplication-config": "none", "application-name": "FanSided", "msapplication-TileColor": "#073759", "msapplication-navbutton-color": "#818181", "msapplication-tooltip": "Sports News, Entertainment, Lifestyle & Technology - 300+ Sites", "msapplication-TileImage": "https://cdn.fansided.com/wp-content/assets/site_images/fansided/logo_fansided-com__300x300.png", "msapplication-square70x70logo": "https://cdn.fansided.com/wp-content/assets/site_images/fansided/logo_fansided-com__150x150.png", "msapplication-square150x150logo": "https://cdn.fansided.com/wp-content/assets/site_images/fansided/logo_fansided-com__300x300.png", "msapplication-square310x310logo": "https://cdn.fansided.com/wp-content/assets/site_images/fansided/logo_fansided-com.png", "apple-itunes-app": "app-id=553311886"}, "movies": [], "publish_date": 1517414400.0, "source": "https://fansided.com", "summary": ""}