{"url": "www.huffingtonpost.com/entry/kate-mckinnon-the-spy-who-dumped-me_us_5b61e93ae4b0fd5c73d59a48", "text": "Consider this a call to arms. Kate McKinnon needs our help.\n\nYou see, the “Saturday Night Live” MVP is the only full-time cast member in the show’s 43-year history to win two Emmys. From Bieber impressions to alien abductions, she is its deft quarterback, its kooky crown jewel, its melodic moral compass ― every bit as essential to the lineup as Kristen Wiig or Amy Poehler or Eddie Murphy or John Belushi.\n\nWhy, then, on God’s sin-ridden earth, can no one write her a good movie role?\n\nSeeing as McKinnon is the best part of anything she’s in, it can be easy to forget she’s never had a good role. That’s because she’s, well, Kate McKinnon, able to elevate characters that otherwise coast on one-note hijinks. Often, they’re not so much characters as they are walking punch lines: the whimsical engineer in “Ghostbusters,” the buttoned-up HR coordinator in “Office Christmas Party,” the bossy redneck in “Masterminds,” the Australian madcap in “Rough Night” and now the adventurous unemployed actress in “The Spy Who Dumped Me.”\n\nAll of these roles play out the same way. McKinnon is a sidekick to more established movie stars, introduced as the eccentric friend, wife or colleague with an odd collection of life experiences that act as a stand-in for character development. As Holtz in “Ghostbusters,” she’s a “gluten-full” skier who somehow put a physicist in a coma. As Pippa in “Rough Night,” she’s an animal whisperer who once perished and came back to life during a drug trip in the desert. As the buffoonish Jandice in “Masterminds,” her husband died from a snake bite; at his funeral, she fell in love with his “distant cousin.”\n\nAnd as Morgan in “The Spy Who Dumped Me,” her biography includes getting deported from Belize, doing cocaine with her basketball coach, being the target of Mandy Patinkin’s advances, discussing penis preferences with her mom and inviting a magician to live in her grandmother’s condo.\n\nLionsgate Kate McKinnon and Mila Kunis in \"The Spy Who Dumped Me.\"\n\nInstead of giving her characters depth, screenwriters give them anecdotes. McKinnon delivers lines like these matter-of-factly, as if anyone who doesn’t relate is a freak ― a convincing way to tap into the irony of her full-bodied ebullience. She plays walking scrapbooks overflowing with uproarious one-liners and wacky reaction shots, having become a go-to for nimble physical humor that evokes Lucille Ball, Jerry Lewis and Jim Carrey. But those performers’ manic verve had sell-by dates: Ball’s attempts to re-create the joys of “I Love Lucy” never quite worked, Paramount Pictures eventually declined to renew Lewis’ contract, and Carrey grew tired of being a tool for box-office capital.\n\nOr perhaps it’s more apt to compare McKinnon to her “SNL” predecessors. Take, for example, Will Ferrell, inarguably one of the biggest movie stars the sketch series has produced. Ferrell and McKinnon share a penchant for visceral oddballs, but a few things set them apart. First, Ferrell gets to headline movies, whereas McKinnon is always second fiddle. (The entire plot of “The Spy Who Dumped Me” revolves around Mila Kunis.) Secondly, Ferrell’s lead roles, however silly they may be, have proper arcs with family histories and detailed psychologies (see: “Elf,” “Talladega Nights,” “Step Brothers”). And finally, Ferrell ― like Kristen Wiig, Adam Sandler and Bill Murray ― has evidenced that he is more than a one-trick pony by taking astute roles in thoughtful character studies (see: “Stranger Than Fiction,” “Everything Must Go”).\n\nMcKinnon, on the other hand, has so far been pigeonholed as little more than the resident nut job, tasked with making googly eyes or thinning her voice to steal scenes in unremarkable chaos comedies.\n\nSony Chris Hemsworth, Kate McKinnon, Leslie Jones, Melissa McCarthy and Kristen Wiig in \"Ghostbusters.\"\n\nSooner or later, that schtick runs thin for even the sharpest performers. Even Eddie Murphy, once a supreme movie star, descended from “Beverly Hills Cop” to “Daddy Day Care.” And McKinnon, like Murphy before her, is far too good for that. She deserves a part that doesn’t feel like an “SNL” bit pushed beyond its limits, where the musicality of her voice and the dementedness of her dexterity are more than devices for cheap chuckles.\n\n“The Spy Who Dumped Me,” directed and co-written by Susanna Fogel (“Life Partners”), is the ultimate example of this. In “Spy,” an action comedy with a third act that has far too much action and hardly enough comedy, Morgan is the daring BFF who can drop everything to delve into international assassin mayhem that really has nothing to do with her.\n\nMorgan doesn’t have much to offer the plot beyond aiding Kunis’ Audrey, so she enlists the help of onetime flame Edward Snowden to take down the crime syndicate that Audrey is wrapped up with. Like most of McKinnon’s big-screen characters, Morgan has an impressive sexual prowess, but it’s only evidenced with an implicit wink. She can’t have normal relationships, no way; she needs to have the world’s most famous dissident on speed dial.\n\nThere’s a key moment in “Spy” that presents a unified theory of the Kate McKinnon Cinematic Universe. Speaking, rather rudely, for everyone who comes in contact with a feature-length McKinnon character, Audrey’s boyfriend (Justin Theroux) tells her she is “a little much.”\n\nSony Zoë Kravitz, Jillian Bell, Scarlett Johansson, Kate McKinnon and Ilana Glazer in \"Rough Night.\"\n\nIn that one line, the movie reveals that it knows it’s resting on McKinnon’s antics ― and that “Ghostbusters,” “Office Christmas Party,” “Masterminds” and “Rough Night” knew too. They wanted her to be too much. They insisted on it. Is she good for anything else? These projects wouldn’t know.\n\nIn a rare emotional exchange toward the end of “Spy,” Morgan concedes that her career isn’t thriving and she fears everyone thinks she’s “a little much.” Because it’s so far removed from anything we’ve seen of Morgan in the previous 100 minutes, the sentiment barely lands. It reads like a note from a Screenwriting 101 guidebook ― ground this character in something real, won’t you? But what it really does is emphasize everything that’s preventing McKinnon from achieving greatness.\n\nAlone, none of McKinnon’s films is an affront. There’s nothing wrong with a ludicrous escapade here and there. But when it becomes someone’s entire brand, that brand eventually loses vitality. And if there’s anything the comedy world needs, it’s for Kate McKinnon to be more than an “SNL” workhorse asked to generate the same zany big-screen frolics time and again. Her talents are far more sustainable than that.", "images": ["https://img.huffingtonpost.com/asset/5b632e992000007a03378cdb.jpeg?cache=sw3yk3olfy&ops=crop_27_211_1377_1247,scalefit_720_noupscale", "https://img.huffingtonpost.com/asset/5b6334441900002b00c6b71c.jpeg?ops=scalefit_720_noupscale", "https://www.facebook.com/tr?id=10153394098876130&ev=PageView&noscript=1", "https://img.huffingtonpost.com/asset/5b6333b31900002a00c6b71b.jpeg?ops=scalefit_720_noupscale", "https://img.huffingtonpost.com/asset/5ad8af452000007d06eb523c.jpeg?cache=2cqqu2iwvs&ops=210_120", "https://s.m.huffpost.com/assets/H-icon-72fd5782b36a1a42ab82a4af65cbc6dd6ddc4d4a71190a91c5cfaab7c66fd836.svg", "https://img.huffingtonpost.com/asset/5d88f91b2100003200dab6d8.png", "https://img.huffingtonpost.com/asset/59a963dd1e00003c00c6060e.jpeg?cache=d498hsivi3&ops=210_120", "https://sb.scorecardresearch.com/p?c1=2&c2=6723616&c3=&c4=&c5=&c6=&c15=&cj=1", "https://img.huffingtonpost.com/asset/5b3812f91a0000cd04ce3068.jpeg?cache=huege11hhb&ops=210_120", "https://img.huffingtonpost.com/asset/5c113ccf1d00002e023175d5.png?ops=100_100", "https://img.huffingtonpost.com/asset/5942c941160000210011660e.jpeg?ops=scalefit_720_noupscale", "https://s.m.huffpost.com/assets/HuffPostHero-d783f680fb974e80346bdfa145131d058e596e1d32f791981875aa481702c770.svg", "https://img.huffingtonpost.com/asset/5b632e992000007a03378cdb.jpeg?cache=sw3yk3olfy&ops=1778_1000", "https://www.facebook.com/tr?id=1621685564716533&ev=PageView&noscript=1"], "top_img": "https://img.huffingtonpost.com/asset/5b632e992000007a03378cdb.jpeg?cache=sw3yk3olfy&ops=1778_1000", "keywords": [], "authors": ["Entertainment Reporter"], "canonical_link": "https://www.huffpost.com/entry/kate-mckinnon-the-spy-who-dumped-me_n_5b61e93ae4b0fd5c73d59a48", "title": "For The Love Of God, Why Can't Anyone Write Kate McKinnon A Good Movie Role?", "meta_data": {"google-site-verification": "97Mj-wW7u8U1NOnkW1rfH-I1kgO0-a9YsgoesOk41R8", "oath": {"guce": {"product-eu": "false", "consent-host": "guce.huffpost.com", "locale": "en-US", "inline-consent": "true"}}, "fb": {"pages": 70242384902, "app_id": 46744042133}, "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "description": "\"The Spy Who Dumped Me,\" like several films before it, reduces McKinnon's comedic genius to cheap laughs.", "keywords": "Movies,comedy,SNL,kate mckinnon,The Spy Who Dumped Me", "og": {"title": "For The Love Of God, Why Can't Anyone Write Kate McKinnon A Good Movie Role?", "type": "article", "image": {"identifier": "https://img.huffingtonpost.com/asset/5b632e992000007a03378cdb.jpeg?cache=sw3yk3olfy&ops=1778_1000", "url": "https://img.huffingtonpost.com/asset/5b632e992000007a03378cdb.jpeg?cache=sw3yk3olfy&ops=1778_1000", "type": "image/jpeg", "width": 1778, "height": 1000}, "url": "https://www.huffpost.com/entry/kate-mckinnon-the-spy-who-dumped-me_n_5b61e93ae4b0fd5c73d59a48", "site_name": "HuffPost", "locale": "en_US", "description": "\"The Spy Who Dumped Me,\" like several films before it, reduces McKinnon's comedic genius to cheap laughs."}, "article": {"tag": "Movies,comedy,SNL,kate mckinnon,The Spy Who Dumped Me", "section": "Entertainment", "published_time": "2018-08-03 08:00:17 -0400", "modified_time": "2018-08-03 10:51:14 -0400"}, "twitter": {"card": "summary_large_image", "site": "@HuffPostEnt", "title": "For The Love Of God, Why Can't Anyone Write Kate McKinnon A Good Movie Role?", "image": {"identifier": "https://img.huffingtonpost.com/asset/5b632e992000007a03378cdb.jpeg?cache=sw3yk3olfy&ops=1778_1000", "width": 1778, "height": 1000}, "description": "\"The Spy Who Dumped Me,\" like several films before it, reduces McKinnon's comedic genius to cheap laughs.", "creator": "tarantallegra"}, "al": {"ios": {"url": "huffpostnews:///?editionID=us&entryID=us_5b61e93ae4b0fd5c73d59a48", "app_store_id": 306621789, "app_name": "HuffPost"}}, "taboola.category": "entertainment"}, "movies": [], "publish_date": 1533297617.0, "source": "http://www.huffingtonpost.com", "summary": ""}