{"url": "https://web.archive.org/web/20110811143753/http://www.dems.gov/press/democratic-leaders-say-house-democrats-are-united-against-gop-default-act", "text": "Democratic Leaders Say House Democrats Are United Against GOP Default Act\n\nJuly 29, 2011\n\nTranscript of Press Availability After House Democratic Caucus Meeting\n\nWASHINGTON – House Democratic Caucus Chairman John Larson (CT), Caucus Vice Chairman Xavier Becerra (CA), and Budget Committee Ranking Member Chris Van Hollen (MD) held a press availability immediately after the Democratic Caucus meeting today on the Debt Limit negotiations. Below is the transcript and video:\n\nChairman Larson: Well good afternoon and thank you for joining us. I’m proud to be joined by the Vice Chair of our Caucus, Xavier Becerra, and of course, the person whose been taking the lead for Democrats in the budget discussions, Chris Van Hollen.\n\nFirst of all, I want to start by saying that since Speaker Boehner walked away from the table last Friday we’ve noticed that U.S. stocks and the American people have lost 405 billion dollars. The gravity of this situation, as we continue to repeat, is something that we feel and have felt for a long time could be avoided. Eighteen times under President Reagan the debt ceiling was raised; seven times for George Bush the debt ceiling was raised.\n\nAs we have said both on the Floor and here before you, defaulting on the American people is not an option. And yet, what we see unfolding in the former Republican Party is the capitulation to special interests – the special narrow interests of one segment of a party that is controlling the very future of all Americans. Impacting and being willing at all costs to take the nation to the precipice – to the cliff – of disaster.\n\nTime is running out. A proposal is being put forward that we’re told in the Rules Committee – even the Chair of the Rules Committee said it can’t be signed by the President. And so why is that we are putting the American people through this? People who are wondering aloud, what is going on in Washington, D.C.? A t a time when they’re crying out for help and jobs and economic security, a ideological manufactured crisis is unfolding before us. An ideological manufactured crisis no longer controllable by the Speaker because events have unfolded beyond his control.\n\nWashington warned about what would happen in terms of party excesses and what would happen to us if we became a nation where not from without the threats that gather but from within when people seek to destroy the government itself. Imagine standing in the way of Social Security, of veteran’s checks, of paychecks – people’s pensions, and not fully appreciating the gravity of that – only more concerned about bringing government itself down. This is a frightening time for this country – a time when the President of the United States at least has stood there as Horatio at the Bridge and continues to offer calm and sanguine advice and encourages people to come together when forces here won’t even allow it to happen. And whether it’s a cloture vote in the Senate, or whether it’s the Tea Party in the House. This is a travesty that this is happening to the American people.\n\nThis is a manufactured crisis. This shouldn’t be happening. We should take this from the plate of the American people and get on with the business of putting this country back to work. That’s where this discussion should be.\n\nAnd with that, let me yield to the Vice Chair of the Caucus, Xavier Becerra.\n\nVice Chair Xavier Becerra: Mr. Chairman, thank you very much.\n\nI believe most Americans are trying to figure out where things stand just four short days before we get to this point. Actually, three short days before we get to this point that this country has never seen. And what makes it difficult for the American people to understand what’s going on is that Speaker Boehner indicated a week ago that he was walking away from the negotiations because he had a better plan. Well, we’ve since seen that the Republicans can’t agree to their own plan here in the House of Representatives and they are clearly feuding amongst themselves, and while they’ve been feuding, as the Chairman pointed out, we’ve seen Americans lose about 400 billion dollars worth of value.\n\nIn five business days Americans have lost about 400 billion dollars worth of value in their wealth. That’s about half of what the Republicans we’re hoping to save in their ten year plan. Five days versus five years of a ten year plan. That’s what happens when you feud and you don’t do your work. The failure of the Republicans is costing not just the Republicans in their party; it’s costing Americans a great deal of money.\n\nBut we’ve seen this before and we’ve seen described before when the tail wags the dog. In this case we see the tail wagging the elephant, and it’s unfortunate that Republicans don’t seem t be listening to the American public. The American public has said over and over again, get this done, do it bipartisanly, and make sure it’s balanced—and in the process, don’t make Social Security, which hasn’t added a single cent to these deficits, pay for this deficit reduction. Don’t make Medicare recipients lose their Medicare benefits to pay for protecting the tax loopholes for special interests—and we understand that today Republicans have admitted that they can’t pass the bill that we are debating on the floor right now.\n\nNone other than the Chairman of the Rules Committee, David Dreier, who is managing the debate on this bill has said that he understands that this bill is going nowhere. So, three short days before we’re told we may plunge into the abyss, and Republicans are debating a bill which the Chairman of their Rules Committee is saying he understands that this bill will go nowhere. Clearly the tail is wagging the elephant today.\n\nRep. Van Hollen: I want to thank my colleagues here for their leadership in the Caucus and just pick up where my friend Xavier Becerra left off about this comment with the tail wagging the elephant because I think in the last twenty-four hours we’ve confirmed what many people suspected, which is that the Tea Party Republicans may be a noisy and effective protest movement, but they’re unfit to govern. They’re unfit to govern, and it is time for Speaker Boehner to do what he called for himself some time ago, which is to have that adult moment.\n\nAnd unfortunately, rather than work to reach across the aisle and form true bipartisan compromise for the good of the country, he’s moving in the wrong direction. He’s now taken the bill, which was unacceptable and won’t pass in its original form, back to Rules Committee to make it even more extreme to cater again to the Tea Party wing of the Republican party. That’s not going to get us where we need to go, and the American people watching this process know that. You now have House Republicans having walked out of the Biden talks, two times out of the talks with the President. They rejected the proposal put forward by the Republican leader in the Senate, Mitch McConnell, originally. Then they rejected their own Speaker’s proposal, but instead of working across the aisle to solve the problem, unfortunately the Speaker’s made that problem even worse and is taking this in the wrong direction. This is, as my colleague said, a totally self-inflicted wound we’re inflicting on the American people everyday. It is a manufactured crisis, so you have to ask yourself, why? Why are they doing this to the country? Why are they playing kamikaze pilot with the American economy? Their answer—what they tell you—is that they’ve got to reduce the deficit. That’s what they say, but if you look at their actions that’s just not true because every time someone’s put forward a balanced deficit plan they’ve said no, and it turns out their real objective is not to reduce the deficit because if that was your objective you’d be willing to be to eliminate one penny in subsidies for the gas companies for the purpose of deficit reduction. We’ve challenged them. We want them to put up the hand.\n\nThe first Republican that says they’re willing to have one penny from closing tax loopholes go to deficit reduction, please come talk to us. If you’re really interested in deficit reduction, you’d be willing to ask the big oil companies to stop taking all the taxpayer money, but they haven’t. That’s not their objective. Their objective, as my colleagues have said, is to manufacture this crisis, try and impose on the American people a very extreme agenda that involves ending the Medicare guarantee, slashing Medicaid, slashing education—that’s what they’re about, not about deficit reduction. When they get serious about deficit reduction in a balanced way, we hope they’ll come talk to us.\n\nChairman Larson: Thank you Chris. Let me just say that we concluded our Caucus and we started our Caucus with the unity I think demonstrates the importance of this nature to the American—of everything that’s unfolding to the American people, and that unity stems from our defense of Medicare, Social Security, and Medicaid. Let me throw it open to questions.\n\nQ: Beyond all this theater, are you hearing of any serious talks going on either between the Senate and the House or amongst Senate leaders.\n\nChairman Larson: Well we’re not privy, of course, to the discussions that take place in the inner sanctum over in the Senate, but we hear there are discussions that are going on, and I don’t know if Chris would want to comment on that further.\n\nCongressman Van Hollen: (Inaudible) . . . I think there may be the beginning of discussions between Senator Reid and Senator McConnell, but we’re not familiar with the details.\n\nChairman Larson: Yes.\n\nQ: So the House Republicans are now renewing this push for a balanced budget amendment to be passed before the second stage of this…\n\nChairman Larson: Totally realistic proposal, huh? (Laughter)\n\nVice Chair Xavier Becerra: Did you like the first version of the movie.\n\nQ: …That they’re open to the balanced budget amendment that was passed in the House in the late 1990’s Does that...\n\nChairman Larson: Let’s call this for what it is. You know, and the initial question is aside from more theater, this is just more theater, and with the theater is more a further move to the right and a more extreme position and you know, you can put the wings on this pig, but it still won’t fly.\n\nQ: Do you see political motivations for this? Does the balanced budget amendment just essentially give Republicans an issue to talk about between now until the election?\n\nChairman Larson: Well, I think if you’re a Tea Party member you’ve got to be—and listen they come here in believing that they are patriots and they’re full of the pledges that they have taken throughout the campaign. But here, I think they’ve forgotten, as Chris pointed out, that we pledge allegiance to this nation, not to Grover Norquist or to any other tax pledge, and where they’re taking this country is unprecedented. It’s never happened before, and while they may take a great deal of pride in that, the reality is the the reality that looms in the American people, best stated by a constituent of mine who said “do they not understand that we’re in the dark abyss of uncertainty?” And that’s true in global markets, national markets, in our business community, but most importantly, for households. I mean, the American people do not deserve this. They deserve far better from their government.\n\nRep. Van Hollen: You know, our Republican colleagues are trotting this out because it sounds good on its surface, it’s really a way of just passing the buck, and what’s interesting is our Republican colleagues who complain about activist judges making decisions. The reality is, at the end of the day, you would be asking judges to enforce the balanced budget amendment. Do they want federal judges to be deciding whether to cut Medicare or to raise taxes? This is just a device to pass the buck and delay confronting the real challenge, which is all of us getting together to hammer this out in a balanced way. And so I know it’s a nice sounding thing, we encourage the American people to take a close look at what it really does, because it’s a way for the Members to escape responsibility and ultimately, lay it on the doorstep of a federal judge. That’s not what our Founders anticipated—the Founders expected the Congress and the President to deal with the budget, not to pass the buck to a federal judge to raise taxes or cut Medicare or education.\n\nVice Chairman Becerra: Can I add something, and James, correct me if I’m wrong. Eleven thousand times since 1789, I wanted to check on this, constitutional amendment since 1789 we’ve had eleven thousand attempts to amend the Constitution since 1789. 27 amendments have been passed, ten of them in one shot with the Bill of Rights. And so, we’re now hearing that Republicans may want two, three days before they plunge us into the economic abyss, propose the eleven-thousand and first constitutional amendment so that in less than three days we pass that when it’s taken over 230 years to pass 27 out of the eleven thousand that were proposed. That’s the height of ridicule that I think you can say we can take these efforts by those who have not yet gotten serious about dealing with what is very serious for any American family, and that is keeping your credit rating—and Republicans are about to allow America’s credit rating to go down the drain.\n\nQ: Senator Harkin today said that if worst comes to worst the President should man up and invoke the 14th Amendment. Is that something you support?\n\nChairman Larson: Well, I’ve said it before and I’ll say it again, if you know—I know the President has resisted this and—but he is and still remains Horatio at the Bridge and let us hope—I mean it’s our sincere hope and let me again acknowledge and applaud the efforts of our colleagues, Chris Van Hollen and Jim Clyburn and Steny and Nancy, who have been in the room representing our concerns—it is our hope that we will be able to reach a legislative conclusion, if not, and faced with these perilous events that could unfold, then I share, and I know Jim Clyburn does and others, that perhaps the President reluctantly may have to do this. Certainly something that he said he would not.\n\nQ: I know that part of the short term solution – both parties are not really proposing that right now, but since the clock is ticking down so close how about a short – you know, three day, five day, seven day just to get this through? Is that something that you’re starting to think about.\n\nChairman Larson: Well, how many more opportunities do you think should be provided for people to get up and walk away from the table? I mean, we sat through and we saw the theater. Chris witnessed Eric Cantor walk away from the discussions with the Vice President as soon as any balance was brought into the discussion. We witnessed then Mitch McConnell coming up with a proposal along with Harry Reid, we watched them walk away from that proposal. We then witnessed, and throughout this the President continuing to reach out—we then witnessed a bipartisan Group of Six, as they like to be called, three Republicans and three Democrats come up with a proposal, they walked away from that. They walked away from their own Speaker’s proposal and from the President’s proposal. I think it was Carolyn Maloney who said if Barack Obama came up with a cure for the common cold or a cure for cancer, they would walk away from that as well.\n\nSo, I think the time for politics, and whether its extending it out six months so that they can continue this ideological manufactured crisis, I think that that’s wrong headed, and clearly if they all came together and said that we have a bill that we’re going to put on the Floor tomorrow and vote on and it was laid out in detail. I think the President said yeah, he would acknowledge that, but we haven’t seen anything close to that.\n\nVice Chairman Becerra: Can I add—this is clearly a dollars and cents issue, these are facts on the ground, decisions that have to be made because money has to be paid, but at the same time we’re talking about something that’s intangible, somewhat abstract that perhaps is even more important, that is the full faith and credit of the United States of America. What it means to be the U. S. of A., the most relied upon democracy ever, where money still runs to the U.S. when there’s trouble around the world—and if you want to inspire confidence, not just in international markets among the bankers of the world, but if you want to inspire confidence back home on Main Street, I dare say that the last thing you want to do is pass another two or three day extension to try to get somewhere, because I don’t believe any businessman or woman back home on Main Street would budget this way, or try to run a business this way and I dare say, the largest economy in the world should operate this way either.\n\nSo, It’s time to, as Senator Harkin said, man up—let’s do something, we can do this. This was totally manufactured as a crisis. We can get out of it today. We just have to do the right thing. And so, I would hope that Republicans would understand that they will inspire little confidence in the American family if they tell us we can kick this can down the road for a few more days.\n\nChairman Larson: Thank you very much.", "images": ["https://web.archive.org/web/20110811143753im_/http://www.dems.gov/sites/all/files/imagecache/content_header_image//sites/all/files/images/Recent_News_Banner.jpg", "https://web.archive.org/web/20110811143753im_/http://www.dems.gov/sites/all/themes/dem_caucus/logo.png", "https://web.archive.org/web/20110811143753im_/http://www.dems.gov/sites/all/themes/dem_caucus/favicon.ico", "https://web.archive.org/web/20110811143753im_/http://www.dems.gov/sites/all/files/imagecache/member_teaser//sites/all/files/member_images/300/Edwards_Donna.jpg", "https://web.archive.org/web/20110811143753im_/http://www.dems.gov/sites/all/themes/dem_caucus/inc/images/global/icons/icon-twitter.gif", "https://web.archive.org/web/20110811143753im_/http://www.dems.gov/sites/all/themes/dem_caucus/inc/images/global/feedback-tab.png", "https://web.archive.org/web/20110811143753im_/http://www.dems.gov/sites/all/themes/dem_caucus/inc/images/global/icons/icon-youtube.gif", "https://web.archive.org/web/20110811143753im_/http://www.dems.gov/sites/all/themes/dem_caucus/inc/images/global/icons/icon-facebook.gif"], "top_img": "https://web.archive.org/web/20110811143753im_/http://www.dems.gov/sites/all/themes/dem_caucus/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Democratic Leaders Say House Democrats Are United Against GOP Default Act", "meta_data": {"google-site-verification": "WB81JBC8Hdx8v35ZJDUK9j4N88pGPkf6vwZZj_t2A7Y"}, "movies": ["https://web.archive.org/web/20110811143753if_/http://www.youtube.com/embed/rMvQbRMJz1Q"], "publish_date": null, "source": "https://web.archive.org", "summary": ""}