{"url": "toofab.com/2018/08/01/catherine-zeta-jones-lookalike-daughter-carys-makes-magazine-debut-talks-douglas-dynasty/", "text": "Catherine Zeta-Jones and her look-alike daughter Carys, 15, covered Town & Country's September 2018 issue -- marking the teen's first cover shoot.\n\nCarys, whose father is Michael Douglas, spoke to the magazine about making a name for herself outside of the \"Douglas Dynasty,\" her aspirations of becoming an actress, and what it was like growing up in the spotlight.\n\nBeing the daughter of two Oscar-winning actors and the granddaughter of legendary actor Kirk Douglas, Carys struggled with being attached to her famous name and felt that she needed to \"prove\" herself to others.\n\n\"When I was younger I didn't like the idea of having this name attached to me, this kind of 'Douglas dynasty' stuff,\" the teen explained. \"I think what bothers me the most is that people think I don't work hard for it, that I don't need to work hard for it. That anything I do gets handed to me.\"\n\n\"When, honestly, I feel like it's the opposite,\" she continued. \"I feel I need to constantly prove myself to people -- that I am not just my parents' daughter.\"\n\nTown & Country\n\nCarys, who is a straight lookalike to her mother, spent her early years as a child in Bermuda. Because of this, she had absolutely no idea what her award winning father did for a living. She explained that she \"honestly\" thought he was a \"pancake maker.\"\n\nHowever, years later, when the family moved to Manhattan, Carys came face-to-face with paparazzi. These early experiences, she recalled, would make her \"really upset.\"\n\n\"I used to get really upset,\" she said. \"They [paparazzi] would jump on the subway and sit right in front of me. I was like, six. I was confused. That's when I knew, 'If this is going to be what it's like, I need to focus on who I really am, and this is going to be something that's just going to happen, and I can't do anything about it.'\"\n\nIn addition, Carys' first encounter with tabloid culture was a wake up call as well. A few years ago, she was in a drugstore and saw a headline (which ended up being false) that said that Douglas' cancer had returned. At the time, she had believed him to be in remission.\n\n\"There's this picture of my dad and it's like, 'Michael Douglas Cancer Again, Dying In a Month.' I just started crying. I was like, 'Why didn't my parents tell me this?!' Only it wasn't true. People just always want a story to tell.\"\n\nAnother obstacle the young teen had to deal with was her father's age. Carys explained that people would make snide comments about Douglas being an older dad. (The actor is now 73, while Zeta-Jones is 48)\n\n'People would be like, 'Your grandpa's here to pick you up,'\" she recalled.\n\nWEtv\n\nHowever, throughout all of this, she explained that her parents do a \"really good job\" of keeping her grounded and grateful.\n\n\"My parents do a really good job of reality-checking me and being like, 'Look around you. The life you have is extraordinary,'\" she said.\n\nZeta-Jones added that she's proud of the manners she has \"instilled\" in her kids.\n\n\"What I instilled in my kids, and I'm very, very proud of it, is manners,\" the actress said. \"There's nothing worse than a privileged kid without manners. I drilled it into them like boot camp. The teenage years... She knows she cannot roll her eyes at me, or huff and puff around me. I never did it to my mother, and she's not doing it to me.\"\n\nThe September 2018 issue of Town & Country is on newsstands August 7th.\n\nprom season's here!", "images": ["https://ll-assets.tmz.com/www.tmz.com/main/default/cache/images/feedlogo2.v2014_05_09_134122.gif", "https://assets.toofab.com/toofab.com/main/default/img/toofab-logo-white.svg", "https://toofab.akamaized.net/2019/04/06/elite-daily-logo-1.png", "https://toofab.akamaized.net/2018/08/01/catherine-zeta-carys-inset2-tc-1.jpg", "https://assets.toofab.com/toofab.com/main/default/img/skeleton.svg", "https://ll-media.tmz.com/2013/04/26/partner-rsss-justjared-logo-cut-v2.gif", "https://ssl-cdn-media.tmz.com/2013/04/26/partner-rss-fox-b-w.png", "https://toofab.akamaized.net/2019/04/06/cdl-260x30-for-tmz3-1.png", "https://toofab.akamaized.net/2018/12/19/newsletter-logo-v2-1.png", "https://toofab.akamaized.net/2018/08/01/catherine-zeta-carys-cover-inset-tc-1.jpg", "https://toofab.akamaized.net/2018/08/01/catherine-zeta-carys-main-tc-1200x630.jpg", "https://ll-media.tmz.com/2013/04/26/partner-rss-thestir-logo-cut-v2-1.png"], "top_img": "https://toofab.akamaized.net/2018/08/01/catherine-zeta-carys-main-tc-1200x630.jpg", "keywords": [], "authors": ["Toofab Staff"], "canonical_link": "https://toofab.com/2018/08/01/catherine-zeta-jones-lookalike-daughter-carys-makes-magazine-debut-talks-douglas-dynasty/", "title": "Catherine Zeta-Jones' Lookalike Daughter Carys Makes Magazine Debut, Talks 'Douglas Dynasty'", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "twitter": {"toofab": 116547240, "card": "summary_large_image", "site": "@toofab", "title": "Catherine Zeta-Jones' Lookalike Daughter Carys Makes Magazine Debut, Talks 'Douglas Dynasty'", "description": "Carys, whose father is Michael Douglas, covered Town & Country's September 2018 issue with her famous mother and talked about making a name for herself outside of the \"Douglas Dynasty.\"", "image": "https://toofab.akamaized.net/2018/08/01/catherine-zeta-carys-main-tc-1200x630.jpg"}, "verify-v1": "Wtpd0N6FufoE2XqopQJoTjWV6Co/Mny9BTaswPJbPPA=", "msvalidate.01": "AFEB17971BCF30779AEA662782EF26F4", "y_key": "14cb04e4656b0c58", "description": "Carys, whose father is Michael Douglas, covered Town & Country's September 2018 issue with her famous mother and talked about making a name for herself outside of the \"Douglas Dynasty.\"", "robots": "index,follow", "referrer": "unsafe-url", "og": {"url": "https://toofab.com/2018/08/01/catherine-zeta-jones-lookalike-daughter-carys-makes-magazine-debut-talks-douglas-dynasty/", "site_name": "toofab", "type": "article", "title": "Catherine Zeta-Jones' Lookalike Daughter Carys Makes Magazine Debut, Talks 'Douglas Dynasty'", "description": "Carys, whose father is Michael Douglas, covered Town & Country's September 2018 issue with her famous mother and talked about making a name for herself outside of the \"Douglas Dynasty.\"", "image": "https://toofab.akamaized.net/2018/08/01/catherine-zeta-carys-main-tc-480x360.jpg"}, "fb": {"app_id": 116046798441464, "pages": 324392354652}, "article": {"publisher": "https://www.facebook.com/TooFab"}}, "movies": [], "publish_date": 1533052800.0, "source": "http://toofab.com", "summary": ""}