{"url": "https://www.usatoday.com/story/life/people/2018/10/22/julia-louis-dreyfus-mark-twain-prize/1725196002/", "text": "WASHINGTON – Julia Louis-Dreyfus walked away with the Mark Twain Prize and a pretty good roasting by her fellow celebrities at the Kennedy Center Sunday.\n\nFamous faces Jerry Seinfeld, Tina Fey, Stephen Colbert, Bryan Cranston, Lisa Kudrow, Tony Hale, Kumail Nanjiani, Keegan-Michael Key, Ilana Glazer, Abbi Jacobson and singer Jack Johnson were on hand to pay tribute to Louis-Dreyfus.\n\nColbert kicked things off by highlighting one of Louis-Dreyfus' lesser-known roles.\n\n\"We're going to be hearing a lot tonight about her characters like Elaine (from \"Seinfeld\") and Old Christine (from \"The New Adventures of Old Christine\") but I want to talk about another performance, one that truly speaks to me,\" the \"Late Show\" host said. \"I bet it speaks to a lot of people in this room, too. I'm talking about Julia's turn as Jeanette Cooper in 1986's 'Troll.' \"\n\nSimilarly, \"The Big Sick\" writer/star Kumail Nanjiani also reached back into the archives, pulling out a photo from a GQ shoot in which Louis-Dreyfus appears to be hooking up with a clown.\n\n\"I'm seeing you explain (this photo) to your mom, right now,\" Nanjiani assessed. \"I cannot believe it has not come up before today.\"\n\nTina Fey made things personal.\n\n\"I've always liked Julia. Maybe because I'd like to believe that we have a lot in common,\" Fey said. \"We both studied comedy in Chicago, we both lost our virginity to (Louis-Dreyfus' husband) Brad Hall.\" After taking a beat, Fey added: \"Just me?\"\n\nFey continued, paying homage to Louis-Dreyfus' \"Seinfeld\" character: \"Julia made the bold choice for her character Elaine Benes to wear long, loose dresses, flat shoes and over-sized coats and a center barrette. Julia was letting us know that she was the real deal, comedy-wise, and she didn't need to give us midriff for (us) to watch her work because – here's the secret – Julia's not afraid to be unlikable – not onscreen and not in person. Just try sharing an elevator with her.\"\n\nLarry David, while not there in person, took jabs at the guest of honor via video message, because he admittedly is \"kind of lazy.\"\n\n\"I want to congratulate Julia for this unbelievably prestigious award,\" the \"Seinfeld\" co-creator said. \"But I gotta say, the lengths that she went through to get it, frankly I was a little surprised ... that whole cancer thing? Cancer? Honestly, I gotta take my hat off to her. What a scam.\"\n\n\"She's such a great actress. She really committed to it,\" David continued. \"She almost had me going for a second. I gotta say, she's done some incredible acting work... but nothing, nothing tops this cancer performance. I stand in awe.\"\n\nMore: Here's why Julia Louis-Dreyfus made her cancer battle public\n\nLouis-Dreyfus wasn't the only target of the evening. Some took aim at Bill Cosby and the Trump administration.\n\nCosby's 2009 award was rescinded nine years later following his conviction on sexual-assault charges.\n\n\"So many greats of American comedy have been honored over the years, and so far only one prize rescinded. Let's put up the sign,\" Colbert directed. A sign behind Colbert read: \"It has been 167 days since last Un-Twaining.\"\n\nMore: Bill Cosby’s Kennedy Center Honor and Mark Twain Prize rescinded\n\n\"Skip this one. Skip it,\" Keegan-Michael Key, in costume as Mark Twain, said when he came across Cosby's name while ticking off a list of past recipients. \"It's OK, he's not watching. It's not like PBS is the first choice on the moving picture box in the recreational room in the penitentiary.\"\n\nFey set her sights on the White House.\n\n\"By the way, everyone talks about all the parallels between 'Veep' and the current administration,\" she said. \"But I think it's more like 'Seinfeld,' just a bunch of selfish (expletive) who don't give a crap about anyone but themselves.\"\n\nFey continued, praising Louis-Dreyfus while slighting the powers that be. \"She's a tireless advocate for women's health and the environment,\" Fey said, \"and a bunch of other stuff that won't exist pretty soon.\"\n\nOnce on the stage, Louis-Dreyfus joined in the Trump-bashing. \"Unfortunately, the president of the United States couldn't make it tonight, either. Even though he lives in the neighborhood Mondays through Wednesdays.\"\n\nLouis-Dreyfus poked fun at the celebs on hand as well.\n\n\"Kumail, thank you for being here,\" she said. \"It is so inspiring that you were able to co-opt your wife's harrowing medical ordeal for an Oscar nomination.\"\n\nMore: How a medically induced coma led to marriage for 'The Big Sick' writers\n\n\"Tina Fey, you are a comedy genius, whom I admire of all humans,\" she said. \"Tina was honored with the Mark Twain Prize, too. You know, before they got real serious about (it).\"\n\nBut the best burn she saved for her family.\n\n\"According to Wikipedia, I have two sons, Charlie and Henry,\" she said. \"You know when you're a working mother, you really worry about the time spent away from your kids. You try your best to be there as much as possible, but the truth is, is that you miss stuff and you worry that they're going to just get all screwed up ... and then you get the Mark Twain Prize. I gotta say, it's worth it.\"\n\nMore:Mark Twain Prize honoree Julia Louis-Dreyfus: Laughter 'best medicine' for her cancer\n\nMore:Here's why Julia Louis-Dreyfus made her cancer battle public", "images": ["https://www.gannett-cdn.com/presto/2018/10/22/USAT/844caf23-5b43-41ae-bd7d-97f52fbe50ea-GettyImages-JULIA_LOUIS_DREYFUS_CEREMONY.jpg?width=660&height=372&fit=crop&format=pjpg&auto=webp", "https://www.gannett-cdn.com/presto/2018/10/22/USAT/709fc729-307c-40a9-afcf-7d975b312734-AFP_AFP_1A73NA.JPG?crop=4872,2741,x2122,y364&width=3200&height=1801&format=pjpg&auto=webp", "https://www.gannett-cdn.com/presto/2018/10/22/USAT/709fc729-307c-40a9-afcf-7d975b312734-AFP_AFP_1A73NA.JPG?width=660&height=458&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.gannett-cdn.com/presto/2018/10/22/USAT/709fc729-307c-40a9-afcf-7d975b312734-AFP_AFP_1A73NA.JPG?crop=4872,2741,x2122,y364&width=3200&height=1801&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/people/2018/10/22/julia-louis-dreyfus-mark-twain-prize/1725196002/", "title": "The best burns from Julia Louis-Dreyfus' Mark Twain Prize ceremony", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "og": {"title": "The best burns from Julia Louis-Dreyfus' Mark Twain Prize ceremony", "description": "Julia Louis-Dreyfus walked away with the Mark Twain Prize and a pretty good roasting by her fellow celebrities at the Kennedy Center Sunday.", "url": "https://www.usatoday.com/story/life/people/2018/10/22/julia-louis-dreyfus-mark-twain-prize/1725196002/", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/presto/2018/10/22/USAT/709fc729-307c-40a9-afcf-7d975b312734-AFP_AFP_1A73NA.JPG?crop=4872,2741,x2122,y364&width=3200&height=1801&format=pjpg&auto=webp", "width": 3200, "height": 1801}, "type": "article"}, "article": {"author": "Erin Jensen", "content_tier": "free", "opinion": "false"}, "description": "Julia Louis-Dreyfus walked away with the Mark Twain Prize and a pretty good roasting by her fellow celebrities at the Kennedy Center Sunday.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 215046668549694}, "ROBOTS": "NOODP, NOYDIR", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.gannett-cdn.com/presto/2018/10/22/USAT/709fc729-307c-40a9-afcf-7d975b312734-AFP_AFP_1A73NA.JPG?crop=4872,2741,x2122,y364&width=1600&height=800&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "The best burns from Julia Louis-Dreyfus' Mark Twain Prize ceremony", "description": "Julia Louis-Dreyfus walked away with the Mark Twain Prize and a pretty good roasting by her fellow celebrities at the Kennedy Center Sunday."}}, "movies": [], "publish_date": 1540137600.0, "source": "https://www.usatoday.com", "summary": ""}