{"url": "https://www.shape.com/celebrities/videos/eva-mendes-shares-fitness-and-beauty-tips-keep-her-looking-so-damn-glowy", "text": "Eva Mendes is in her happy place, and it shows. The actress, 43, is blissed out as Ryan Gosling's leading lady; the mom of Esmeralda, 2, and Amada, 11 months; and the successful head of a fashion line, the Eva Mendes Collection at New York & Company, and a beauty brand, Circa. She's also savoring her role as Ryan's rock behind the scenes as he hits the awards circuit for La La Land. \"What people don't know about me is that I love being home,\" Eva says. \"Instead of hitting the red carpet, I'd rather be with our girls.\"\n\nAnother thing Eva relishes is ex­­er­­cise, and that too is evident in her strong body and beautiful skin. \"Working out allows me to spend time on myself,\" she says. \"Knowing that I have an hour to dedicate to my wellness is a priority for me now.\" She tries to eat \"as clean as possible\" but also digs into her favorite indulgences with gusto. One of Eva's top treats: Cadbury eggs. \"The mini ones and the big ones with the filling,\" she says. And then there's her mother's delicious Cuban cooking. \"My mom makes the best black beans in the world,\" she says. \"I'll never stop devouring them.\"\n\nListen in as Eva expands on the life philosophies that keep her healthy and radiantly happy.\n\nBelieve in finding the One...workout\n\n\"I love doing intervals, like running and sprinting, and I see great results with that versus the 30 or 45 minutes of steady cardio I used to do on the treadmill. Between intervals, I lift weights. Right now I'm sticking to light weights because I have a herniated disc in my lower back. It's pretty severe, and I have to work around it. I love squats, but I've been told that I have to do lunges instead of squats for the time being. I know a lot of people wouldn't find that heartbreaking, but I really do!\n\n\"I'm off-season right now, so I work out three days a week. But when I'm getting ready for an event or in the summer, it's five days a week. I don't exercise more than that though, because I see better results when my body has a rest period.\"\n\nThere are perks to everything-you just have to look\n\n\"In some ways, it's been more challenging to get back in shape after my second daughter. Yet it's not as hard as I thought it would be, because I'm always running around with the kids. I never sit down-I'm on the move all day. And I don't keep junk food at home anymore, because I'm trying to set a good example. So there are no more Krispy Kremes for me to grab. But there is this app called Postmates that delivers whatever you want in minutes. It's almost as bad as having the food in your kitchen. Don't laugh, but they're on the way here right now!\"\n\nImage zoom\n\nRely on tricks to look lit\n\n\"For me, glowing skin comes from the inside. I start to get sallow if I'm not eating well. I take fish oil supplements. And I love coconut oil. I apply it to my face. That's my go-to. I also drink a lot of water. I always keep a bottle with me and kind of force myself to drink. My skin just looks better when I'm hydrated.\n\n\"I wear makeup every day. Typically, it's minimal-a little eyeliner, lip liner and balm, and some concealer. It takes me about five minutes to apply it. But when I get ready for an event or a dinner, I do like to take my time putting my makeup on. To me, the process of getting ready can be really, really romantic. It takes me probably 45 minutes because I go very slow.\n\n\"I've learned some very good makeup tricks too, like how important it is to work with your face shape. Because I have a long face, my makeup artist taught me to swipe blush across one cheek and lightly over the nose, then over the other cheek to help break up the length a bit. Another great tip to try: Add some illumination to your Cupid's bow right above your lip by putting a little bit of highlighter-or even a dab of light eyeshadow-there. That will give some pop to your lips.\"\n\nProtein is your power\n\n\"I usually start my day with eggs. I think they're like magic-you can do so much with them. I mostly keep it simple and have scrambled eggs and a piece of Ezekiel toast for breakfast. But if somebody brings over muffins or some other kind of delicious treat, I'll eat that with my coffee instead. It's a terrible way to begin my day, though. I really regret it later, because I just don't have as much energy. I find that when I start out with the right source of protein, it definitely helps.\n\nI grew up eating rice and beans, so I want some kind of grain in every meal. For lunch, I usually have salmon and rice or quinoa, and I try to include a salad. I'll eat the same thing for dinner. I'm a creature of habit in that way. I don't get bored with food. I try to think about it as fuel for my body. But what I am looking forward to is the time when dinner becomes a sit-down situation again. Right now I'm in survival mode with two babies, eating on the go.\"\n\nImage zoom\n\nA little sugar is important too\n\n\"Sweets are my thing. It's ongoing, and I have to manage my sugar cravings constantly. I've gotten used to having something sweet after every meal, so I'm always bartering with myself: No, no, I can't have that after dinner, but maybe I can have it after lunch instead. The kid in me thinks, I work out, so I can support my sugar habit. I know that's not a very wise thing to say, but I really do feel like I'm working it off!\"\n\nFor more from Eva, pick up the April issue of Shape, on newsstands March 14th.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F35%2F2019%2F01%2F03210210%2Fjulia-body-recomposition-transformation-150x150.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F35%2F2019%2F02%2F04023333%2Fwide-keto-diet-meal-plan-150x150.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F35%2F2019%2F04%2F19202142%2F1244-squat-challenge-150x150.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F35%2F2019%2F04%2F03220441%2Feva-mendes-fb.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F35%2F2017%2F03%2F04004133%2Feva-mendes-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20133'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F35%2F2017%2F03%2F04004134%2Feva-mendes-3.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F35%2F2019%2F04%2F03220441%2Feva-mendes-fb.jpg", "keywords": [], "authors": ["Pam O'Brien"], "canonical_link": "https://www.shape.com/celebrities/videos/eva-mendes-shares-fitness-and-beauty-tips-keep-her-looking-so-damn-glowy", "title": "Eva Mendes Shares Her Beauty and Fitness Tips In the April Issue of Shape", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "The actress shares her workout routine, healthy eating tips, and beauty hacks for staying radiant—despite her sugar addiction.", "og": {"title": "The Food Eva Mendes Won't Start Her Day Without", "type": "article", "site_name": "Shape", "url": "https://www.shape.com/celebrities/videos/eva-mendes-shares-fitness-and-beauty-tips-keep-her-looking-so-damn-glowy", "description": "Spoiler: Tough workouts, healthy meals, loads of coconut oil, and Ryan Gosling.", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F35%2F2019%2F04%2F03220441%2Feva-mendes-fb.jpg", "width": 1200, "height": 628}}, "pinterest": {"url": "https://www.shape.com/celebrities/videos/eva-mendes-shares-fitness-and-beauty-tips-keep-her-looking-so-damn-glowy", "description": "The actress shares her workout routine, healthy eating tips, and beauty hacks for staying radiant—despite her sugar addiction.", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F35%2F2019%2F04%2F03220441%2Feva-mendes-fb.jpg"}, "twitter": {"card": "summary", "url": "https://www.shape.com/celebrities/videos/eva-mendes-shares-fitness-and-beauty-tips-keep-her-looking-so-damn-glowy", "title": "Eva Mendes Shares the Fitness and Beauty Tips That Keep Her Looking So Damn Glowy", "description": "The actress shares her workout routine, healthy eating tips, and beauty hacks for staying radiant—despite her sugar addiction.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1200&h=628&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F35%2F2019%2F04%2F03220441%2Feva-mendes-fb.jpg"}, "fb": {"app_id": 165082593548215, "pages": 10053803772}}, "movies": [], "publish_date": null, "source": "https://www.shape.com", "summary": ""}