{"url": "https://www.washingtonpost.com/lifestyle/style/reba-mcentire-never-needed-to-be-the-best-she-simply-had-to-want-it-most/2018/11/27/8887bd18-e112-11e8-b759-3d88a5ce9e19_story.html", "text": "It took McEntire seven hard years of honky-tonks and dance halls to break through. So even as she emerged as one of country’s top-selling and most influential female artists, McEntire resolved not to remain dependent on the mood swings of Nashville’s Music Row. Instead, she seized opportunity everywhere: movies, Broadway, a television series (two, actually), Carnegie Hall, a clothing line, a gig as the first female Colonel Sanders. She Reba-fied our world.\n\n“There’s a lot of people, a lot of girl singers, who are 10,000 times better than me,” she says. “They don’t have the drive. They don’t have the work ethic. They don’t have the want-to, and they don’t love it as much as I do. And they’re not willing to sacrifice what it takes to do this.”\n\nThe want-to. McEntire, 63, is only the third female country artist (after Loretta Lynn and Dolly Parton) and seventh artist from the genre overall to receive the Kennedy Center Honors in the awards’ four decades. Was she surprised? Heck, no. “I’ve been wanting it for a long time.”\n\nAD\n\nAD\n\nMcEntire is dubbed the Queen of Country, though there isn’t anything regal about her. She would never cop an attitude, and her fans wouldn’t have it. The last name is superfluous. The hair, forever red, has whipped through so many permutations: big, bigger and Hello, Dolly! After four decades and 60 million albums sold, McEntire’s success remains rooted in her down-home, playful accessibility — and powered by innate business savvy and drive to succeed.\n\nShe has little talent for mystery. “An open book” declares her son Shelby, a race car driver. Her manager agrees. As does her producer. Actually, pretty much everybody.\n\nUnbidden, she shares that the longest break from touring occurred in 2002: “I had a hysterectomy, and I took the summer off.”\n\nAD\n\nDiscussing her first husband, steer wrestler Charlie Battles, “a piece of work” a decade her senior, whom she married at age 21, she divulges, “I think I married my daddy.”\n\nAD\n\nOn her 2015 divorce from Narvel Blackstock, her husband of 26 years (and also her manager): “Well, there’s not much you can do about it when you’re not the one that walks away. You get on your big girl panties, put your big boots on, and set an example for the children.” (The children — Shelby and her three stepkids — were all adults. She’s now in a relationship with Skeeter Lasuzzo, a photographer and retired geologist.) For a while, after the separation, McEntire managed herself.\n\n“She’s the epitome of getting back on the horse,” says Kix Brooks of Brooks & Dunn, who share the Vegas stage with McEntire.\n\nAD\n\nMcEntire has prevailed by packing houses with what she calls her “tear-jerker, eat-your-heart-out songs,” delivered with her robust contralto and dexterous vibrato. “Reba is the bridge between Loretta Lynn and Shania Twain,” says critic Ann Powers.\n\n“She loves the gusto of it all,” says Vince Gill. “She loves songs that are emotional, that tell stories. Like Merle Haggard or Johnny Cash — one note, and you know it’s her. That’s what separates an amazing artist from an okay one.”\n\nBeing a woman in country was never going to be a night at the Opry.\n\nAD\n\n“I saw it quick,” McEntire says. “And you don’t complain. You don’t bitch. You don’t cry. You work twice as hard and try to find a better way to do things. And that’s what I did.”\n\nAD\n\nIn turn, she supported female artists who followed. “Ask Faith Hill. Ask Martina [McBride]. We’ll all say the same story: We’re part of her team. Reba was one of the first women to pave the way and support us,” says Trisha Yearwood. “If you’re looking for a role model for women to own your own stuff, good and bad, and be your own boss, it’s Reba. She was way ahead of her time.”\n\nMcEntire was particularly prescient when it came to embracing music videos, starring in sophisticated mini-films that helped broaden her brand, including a six-minute sudser for her 1991 tour-de-force cover of Bobbie Gentry’s “Fancy.” One of her first videos — for her 1986 earworm, “Whoever’s in New England” — was more Lifetime than “Hee Haw,” a white-collar wife’s lament, featuring snow, Boston and not a single Stetson.\n\nAD\n\nShe understood early the power of fans not only hearing her songs but also seeing her perform the songs. Which, in turn, became a portal to her movie and television career. “Now they could put the voice, the face and acting the story all together,” she says. “They got five times more for their buck.”\n\nAD\n\nMcEntire, too. “Whoever’s in New England” became her first platinum album.\n\n“She hears songs and makes movies in her head,” says Gill, whom McEntire corralled into a four-day shoot for their 1993 duet “The Heart Won’t Lie,” starring Navy officer Reba pining for Marine drill sergeant Vince. (He jokes that he rues it to this day and salutes her whenever they meet.) The song soared to No. 1.\n\nScott Borchetta, now CEO and founder of her label, Big Machine, recalls when they were both attached to MCA in the 1990s, that “her show was as big or bigger as any rock show on the road.” But that wasn’t enough.\n\nAD\n\nShe asked: “How do I get my own TV Show?”\n\nShe got one. Six seasons of “Reba,” from 2001 to 2007, playing a salty, non-famous version of herself. The show thrives in syndication, airing on some station at some hour on most days.\n\nIn an industry that adores shiny and new, she’s hosted the ACM Awards 15 times — “a very relevant place to be in the middle of all the young acts coming up,” says Brooks — and toured with Kelly Clarkson, who became her stepdaughter-in-law.\n\nA few years ago, she lamented to Borchetta that “radio doesn’t want to play me anymore.” It’s a common complaint among older country artists and a major grievance for female singers in the genre. “This ‘bro’ thing has lasted a lot longer than I thought it would,” she says. “I’m ready for it to change.”\n\nSo in 2014, Borchetta launched Nash Icon on Cumulus Media’s Nash FM stations. “She was the artist I had in mind. More airtime for her music, and she had two more No. 1 albums. We created a new lane for her that she completely owned.” McEntire also recorded her first gospel album in 2017 and picked up a Grammy this year, her third.\n\nAD\n\nAD\n\nAnd then there was Broadway — how did that happen? In 2001, producers asked her to take over the lead in a revival of “Annie Get Your Gun,” though she had no musical theater experience and had never seen the show. On a whim, after a flight out of New York was canceled, she decided to take in a performance. “Well, that fixed it. Wanted to do it. Had to do it. Couldn’t wait. They had to shoo me off the side of the stage because I wasn’t in it for the first 17 minutes. The thrill of my life. Six months, eight performances a week.” And raves. The New York Times: “The most disarmingly unaffected Annie in years.”\n\nMcEntire comes from rodeo and ranching, and the tiny town of Chockie in southern Oklahoma. \"Oklahoma,\" she says, \"is everything.\" She visits five or six times a year.\n\nHer family tales and memoir are steeped in Okie lore and shined into myth like a rodeo belt buckle, sounding more Dust Bowl than Baby Boom. There were tar paper-lined coffins, two-dollar cemetery plots, sock-stealing rats, a grandmother who spoke in tongues. She competed at the rodeo in barrel racing, where riders trace a cloverleaf pattern around barrels. She grew up castrating bull calves: “I was literally raised on mountain oysters.”\n\nAD\n\nAD\n\nAt age 5, she realized she could sing. “Best attention I ever got,” she says. “I was the third of four kids. I wasn’t a boy. I wasn’t the youngest or the oldest. I was in the middle.” It’s something she mentions a lot. “I had to fight for attention.”\n\nAnd she craved it, especially from her father, who died in 2014. Clark McEntire was a three-time world champion steer roper, tough as dirt, who never told his children he loved them. “He liked being known as a champion cowboy,” says McEntire’s older sister, Alice Foran, who lives in Oklahoma along with most of the family, including their 92-year-old mother, Jackie. “You didn’t have to worry about what was on his mind. He would tell you in a heartbeat. By our standards, they would say he was cruel.”\n\nReba recalls him asking, more as a statement of fact than a question, “Reba, why do you always want to do something you’re not good at?” He meant, “barrel racing, playing basketball, all that other stuff except singing.” In fact, she was quite good at all those things, collecting ribbons and championships — just not as good as she was at singing.\n\nAD\n\nAD\n\n“I couldn’t imagine saying that to Shelby,” she says. But “that’s where I get my bluntness. All my friends know exactly where they stand.”\n\nFor fun and support, the McEntire kids turned to their mother, who encouraged them to sing. She once told Reba: “If you don’t want to go to Nashville, we don’t have to do this. But I’m living all my dreams through you.”\n\nShe was discovered as a college sophomore, in 1974, singing the national anthem in a white cowboy hat at the national rodeo finals in Oklahoma City. Signed to Mercury Records, she watched her singles stall in the chart’s cellar. Her first No. 1 hit, “Can’t Even Get the Blues” (1982), she will tell you, came from “the fifth single off my sixth record,” seven years after she was first signed. In today’s Nashville, she says, executives would exhibit less patience.\n\n“But I was very blessed, very lucky and very thankful” that success took time, McEntire says. Those hard years “molded me, they taught me,” she says. “Slowly, the foundation grew. If I had a first number one hit after my first single, I wouldn’t have known anything.”\n\nIn 1991, her tour manager and seven band members were killed in a plane crash outside San Diego. (McEntire, recovering from bronchitis, had booked a later flight.) Less than four weeks later, she was back on the road.\n\n“You can’t stop working when something like that happens.” She pauses, corrects herself. “I can’t stop working when something like that happens. I needed it. We all needed it, to keep going, or I would have wallowed in sorrow.” Her sister calls her “Go,” for the way she’s always on the move, always keeping a full itinerary. “A tough bird,” says her manager Clarence Spalding. “She doesn’t do well sitting around lounging.”\n\nFaith has always been present, especially in performing. Talking about this, McEntire stops for a second, speechless, and plucks a tissue. Before taking the massive stage in Vegas, she talks to God. “I ask if there’s anybody in the audience that needs something. Use me. I’ll be the vessel. I’ll be the water hose,” she says. “When they come in, they’ve got burdens, and I want them to leave them at the door. Come in. Let us entertain you. Recharge your batteries. Lift that burden.” Afterward, “you can face your problems, your world with a smile on your face, a skip in your step.”\n\nA favorite of drag queens (just plop on a scarlet wig), McEntire says she has “tons of gay friends,” and is a supporter of same-sex marriage but maintains that her stance is more about being “human” than political. She’s good friends with George H.W. Bush — as she was with his late wife, Barbara — but says it isn’t her place to spout opinions. “If God told me, ‘I want you to say this,’ and I felt strongly that’s where it’s coming from, I would do it. But I’ve never been led to that. I’ve always kept my feelings separate.” The job, she says, “is to entertain.”\n\nSo this is what she does. Last year, she helped develop a small-town detective drama with producer Marc Cherry of “Desperate Housewives” fame. The network passed. “I was so sad. I was mad,” she says. “I was curious: What do you have to do to get a good show on television?”\n\nNaturally, she’s pitching another series with a different team. And she is working on a traditional country roots album with producer Buddy Cannon, scheduled for release next spring.\n\n“She changed things up to keep herself relevant. She could stop all this and live a comfortable life,” says “Reba” co-star Melissa Peterman, “and she wouldn’t be happy.”", "images": ["https://www.washingtonpost.com/resizer/Yz3J6KGbHIjUfWMjbAiIvpfZVUI=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/EKSBPOXRXAI6RGOCZ7FG7T3BBQ.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/7f7b5f76-3696-413e-9ae6-1eb690c7c020.png&w=90&h=90", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/EKSBPOXRXAI6RGOCZ7FG7T3BBQ.jpg&w=150"], "top_img": "https://www.washingtonpost.com/resizer/Yz3J6KGbHIjUfWMjbAiIvpfZVUI=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/EKSBPOXRXAI6RGOCZ7FG7T3BBQ.jpg", "keywords": [], "authors": ["Karen Heller", "National General Features Writer For Style"], "canonical_link": "https://www.washingtonpost.com/lifestyle/style/reba-mcentire-never-needed-to-be-the-best-she-simply-had-to-want-it-most/2018/11/27/8887bd18-e112-11e8-b759-3d88a5ce9e19_story.html", "title": "Reba McEntire never needed to be the best. She simply had to want it most.", "meta_data": {"description": "To become the Queen of Country, she had to be bigger than country music.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/lifestyle/style/reba-mcentire-never-needed-to-be-the-best-she-simply-had-to-want-it-most/2018/11/27/8887bd18-e112-11e8-b759-3d88a5ce9e19_story.html", "image": "https://www.washingtonpost.com/resizer/Yz3J6KGbHIjUfWMjbAiIvpfZVUI=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/EKSBPOXRXAI6RGOCZ7FG7T3BBQ.jpg", "title": "Reba McEntire never needed to be the best. She simply had to want it most.", "description": "To become the Queen of Country, she had to be bigger than country music."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Reba McEntire never needed to be the best. She simply had to want it most.", "description": "To become the Queen of Country, she had to be bigger than country music."}, "last_updated_date": "2018-11-30T16:03:12.786Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1543248000.0, "source": "https://www.washingtonpost.com", "summary": ""}