{"url": "www.cheatsheet.com/health-fitness/aol-brad-pitt-and-angelina-jolie-and-14-famous-celebrity-couples-that-began-as-an-affair.html/", "text": "We find love in many ways — sometimes before we break things off with a current partner. Even Hollywood isn’t immune to scandalous love affairs. These famous celebrity couples fell in love while they were still with other people. You’ll recognize the popular superstars who fell in love and began a scandalous affair (on page 9).\n\n1. Miranda Lambert and Blake Shelton\n\nWhen these two called it quits they shocked everyone. | Rick Diamond/Getty Images When these two called it quits they shocked everyone. | Rick Diamond/Getty Images\n\nAlthough these two both say there was no physical intimacy before his divorce, Blake Shelton admits he fell in love with Miranda Lambert when they first met, which was a year before he separated from his first wife. Lambert and Shelton went on to get married, but they divorced in 2015.\n\nNext: A ’90s love triangle\n\n2. Meg Ryan and Russell Crowe\n\nLeft: Meg Ryan and Dennis Quaid | Dan Callister/Online USA, Right: Meg Ryan and Russell Crowe in Proof of Life | Warner Bros. Left: Meg Ryan and Dennis Quaid | Dan Callister/Online USA, Right: Meg Ryan and Russell Crowe in Proof of Life | Warner Bros.\n\nDennis Quaid and Meg Ryan married in 1991 and had a son, Jack, together. But when Ryan met Russell Crowe on the set of Proof of Life in 2000, she fell for him. The When Harry Met Sally actress denied her relationship with Crowe during her high-profile divorce from Quaid in 2001.\n\nRyan didn’t admit the affair until years later, telling InStyle, “Dennis was not faithful to me for a long time, and that was very painful … Russell didn’t break up the marriage.” Crowe and Ryan dated for two years before they split.\n\nNext: Pretty woman, ugly start\n\n3. Julia Roberts and Danny Moder\n\nJulia Roberts met her husband on set. | Frederick M. Brown/Getty Images Julia Roberts met her husband on set. | Frederick M. Brown/Getty Images\n\nWhen Julia Roberts met husband Danny Moder on the set of The Mexican in 2001, she was dating Benjamin Bratt and Moder was married to Vera Steimberg. He eventually left Steimberg for Roberts, but when Steimberg didn’t initially agree to the terms of the divorce, Roberts wore an “A Low, Vera” shirt in public. Ouch. For what it’s worth, Julia Roberts says she has remorse over the affair.\n\nNext: While the fiance was away, this couple played.\n\n4. Billy Bob Thornton and Angelina Jolie\n\nAngelina Jolie and Billy Bob Thornton attend the Golden Globe Awards. | Vince Bucci/Getty Images Angelina Jolie and Billy Bob Thornton attend the Golden Globe Awards. | Vince Bucci/Getty Images\n\nFrom 1997 to 1999, Laura Dern and Billy Bob Thornton lived together, got engaged, and began planning a life together. But Thornton called off the engagement, quickly marrying Angelina Jolie months later.\n\nDern explained the split to ABC News, “I left our home to work on a movie, and while I was away, my boyfriend got married, and I’ve never heard from him again.” Rock star Melissa Etheridge spoke about helping her friend Dern move out. “I broke into their home to get their stuff out because it was so nasty,” she said.\n\nNext: This Hollywood affair led to an 18-year marriage.\n\n5. Melanie Griffith and Antonio Banderas\n\nA very sexy couple to say the least. | Frazer Harrison/iStock/Getty Images A very sexy couple to say the least. | Frazer Harrison/iStock/Getty Images\n\nRumor has it the main reason Antonio Banderas divorced his first wife, Ana Leza, was because he was having an affair with Melanie Griffith. Banderas and Griffith were married for 18 years, but divorced in 2014.\n\nNext: The most famous romance in country music history\n\n6. Johnny Cash and June Carter Cash\n\nTheir lives were all about music and each other. | Scott Harrison/Stringer/Getty Images Their lives were all about music and each other. | Scott Harrison/Stringer/Getty Images\n\nJohnny Cash married Vivian Distin in 1954, but he’s best known for his long-standing affair with June Carter. Cash and Carter went on to be married from 1968 until their deaths in 2003.\n\nNext: Royal status doesn’t make you immune to affairs.\n\n7. Prince Charles and Camilla Parker Bowles\n\nMarried since 2005, Prince Charles and Camilla Parker Bowles attend an event together. | Abdelhak Senna/AFP/Getty Images Married since 2005, Prince Charles and Camilla Parker Bowles attend an event together. | Abdelhak Senna/AFP/Getty Images\n\nPrince Charles was smitten with Camilla as early as 1971, but Palace courtiers claimed she would be an unsuitable wife for the prince. She married Andrew Parker Bowles in 1973, while Prince Charles went on to marry Diana. But Charles and Camilla couldn’t stop seeing each other. He and Diana finally divorced in 1996, and he married Camilla in 2005.\n\nNext: A rock star affair gets messy.\n\n8. Bruce Springsteen and Patti Scialfa\n\nThis rocker couple has been married for over 25 years. | Kevork Djansezian/Getty Images This rocker couple has been married for over 25 years. | Kevork Djansezian/Getty Images\n\nRock star Bruce Springsteen married actress Julianne Phillips in 1985. The marriage only lasted a few years, however, because he realized he was in love with his band-mate of two years, Patti Scialfa. Springsteen told the Daily Mail, “Patti had a part that carried a charged sexuality; she could seduce and she could stir you to jealousy.”\n\nHe separated from Phillips and, soon after, paparazzi caught Springsteen in his underwear, joined by Scialfa, on a balcony in Rome. The rocker couple married in 1991 and celebrated 26 years of marriage in 2017. They have three children.\n\nNext: These superstars fell in love during their scandalous affair.\n\n9. Angelina Jolie and Brad Pitt\n\nPerhaps the most iconic power couple of all time. | Kevin Winter/Getty Images Perhaps the most iconic power couple of all time. | Kevin Winter/Getty Images\n\nThings heated up for Angelina Jolie and Brad Pitt when they worked together on the set of Mr. and Mrs. Smith in 2004. The problem: Pitt was still married to Jennifer Aniston.\n\nAlthough both Jolie and Pitt denied they got physically intimate during that time, they also admitted they fell in love on set. Pitt and Aniston announced their separation in early 2005, and Brangelina began a 12-year romance that only recently ended.\n\nNext: A Lifetime movie brought these married actors together.\n\n10. Leann Rimes and Eddie Cibrian\n\nEddie Cibrian and LeAnn Rimes were one hot couple. | Fabiano Silva/Getty Images for Maxim Eddie Cibrian and LeAnn Rimes were one hot couple. | Fabiano Silva/Getty Images for Maxim\n\nLeann Rimes met Eddie Cibrian in 2009, when they filmed a Lifetime movie called Northern Lights. Both were married, Rimes to backup dancer Dean Sheremet, Cibrian to Brandi Glanville. But rumors of an affair soon spread throughout the set, and eventually, Rimes and Cibrian stopped denying the rumors. They divorced their first spouses and got married in 2011.\n\nNext: Karma came back around for a cheating husband.\n\n11. Claire Danes and Hugh Dancy\n\nClaire Danes took a while in finding her perfect match. | Dia Dipasupil/Getty Images For Entertainment Weekly Claire Danes took a while in finding her perfect match. | Dia Dipasupil/Getty Images For Entertainment Weekly\n\nIn 2003, actor Billy Crudup left his girlfriend, Mary Louise Parker, when she was seven months pregnant in order to pursue a relationship with Claire Danes. Crudup and Danes dated for four years, but Danes ended up leaving him for Hugh Dancy, whom she later married.\n\nNext: This romance turned out to be “toxic.”\n\n12. Britney Spears and Kevin Federline\n\nThis relationship will go down in pop culture history | Vince Bucci/Getty Images This relationship will go down in pop culture history | Vince Bucci/Getty Images\n\nThis couple made headlines in 2004 when Kevin Federline left his fiance, Shar Jacskon, for Britney Spears while Shar was pregnant with their second child. Spears and Federline were married for three years and had two sons together before she filed for divorce in 2007.\n\nNext: This Beverly Hills 90210 star left her husband for her current love.\n\n13. Tori Spelling and Dean McDermott\n\nThese two raced to the alter as soon as her divorce was final. | Michael Buckner/Getty Images for Chevrolet Volt These two raced to the alter as soon as her divorce was final. | Michael Buckner/Getty Images for Chevrolet Volt\n\nTori Spelling married Charlie Shanian in 2004, but she soon fell in love with actor Dean McDermott, who was also married. Spelling finalized her divorce in 2006, and she married Dean a month later. The couple now has five children together.\n\nNext: This affair truly ended with “happily ever after.”\n\n14. Joanne Woodward and Paul Newman\n\nAn unexpected romance for them both. | Alan Meek/Daily Express/Hulton Archive/Getty Images An unexpected romance for them both. | Alan Meek/Daily Express/Hulton Archive/Getty Images\n\nPaul Newman started falling in love with Joanne Woodward the moment he saw her, which happened to be five years before he divorced his first wife, Jackie Witte. Newman eventually got the divorce he sought, and Newman and Woodward enjoyed a 50-year marriage and shared three children together (he had three with Witte as well).\n\nNext: These classic stars carried on a famous affair.\n\n15. Katharine Hepburn and Spencer Tracy\n\nSpencer Tracy holds Katharine Hepburn in his arms. | Getty Images/Stringer Spencer Tracy holds Katharine Hepburn in his arms. | Getty Images/Stringer\n\nKatharine Hepburn and Spencer Tracy had a 26-year-long affair despite the fact that he remained married to his wife, Louise. Although Katharine never asked Spencer to divorce his wife and marry her, she stood by his side for decades and was with him when he died in 1967. She did not attend his funeral and only spoke publicly about their relationship after his wife, Louise, passed away.\n\nNext: This Hollywood duo married twice.\n\n16. Elizabeth Taylor and Richard Burton\n\nThey attempted a fairy tale ending twice. | William Lovelace/Getty Images They attempted a fairy tale ending twice. | William Lovelace/Getty Images\n\nElizabeth Taylor was married eight times, but Richard Burton is the only man she married twice. The two began a passionate affair while on the set of Cleopatra in 1962, when both of them were married to other people. They left their spouses and wed in 1964. They divorced in 1974 and remarried a year later, but the second marriage didn’t even last a year.\n\nNext: Another love triangle for Elizabeth.\n\n17. Elizabeth Taylor and Eddie Fisher\n\nA very trick relationship. | Keystone/Getty Images A very trick relationship. | Keystone/Getty Images\n\nBefore there was Richard Burton, there was Eddie Fisher, the husband of actress Debbie Reynolds. Fisher and Reynolds were close to Taylor and her husband, Mike Todd. But when Todd was killed in a plane crash in 1958, Taylor leaned on her friends for support … and she and Fisher fell in love. Fisher left his wife for Taylor, but obviously, the love didn’t last.\n\nNext: This remains one of Hollywood’s most disturbing tales.\n\n18. Woody Allen and Soon-Yi Previn\n\nThe public views their relationship as highly controversial. | Jamie McCarthy/Getty Images The public views their relationship as highly controversial. | Jamie McCarthy/Getty Images\n\nWoody Allen’s longtime girlfriend Mia Farrow discovered he was having an affair with her 19-year-old adopted daughter, Soon-Yi when she found lewd photos of Soon-Yi in Allen’s apartment. Allen and Previn have been married since 1997, despite a 35-year age difference.\n\nFollow The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2017/10/Joanne-Woodward-and-Paul-Newman-640x419.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/10/Claire-Danes-and-Hugh-Dancy-640x427.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/09/Richard-Burton-and-Elizabeth-Taylor.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/10/Johnny-Cash-and-June-Carter-Cash-569x500.jpg?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Bruce-Springsteen-and-Patti-Scialfa-.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/09/bradandangelina-640x428.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/10/Woody-Allen-and-Soon-Yi-Previn-637x500.jpg?x62514", "http://www.bizographics.com/collect/?pid=4708&fmt=gif", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2017/10/Katharine-Hepburn-and-Spencer-Tracy.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/10/Britney-Spears-and-Kevin-Federline-640x372.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/10/Tori-Spelling-and-Dean-McDermott-640x492.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/10/Miranda-Lambert-and-Blake-Shelton--640x480.jpg", "https://www.cheatsheet.com/wp-content/uploads/2017/10/Julia-Roberts-and-Danny-Moder-640x455.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/10/Leann-Rimes-and-Eddie-Cibrian-640x469.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/05/megryan.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/10/Miranda-Lambert-and-Blake-Shelton--640x480.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2016/09/Billy-Bob-Thornton-and-Angelina-Jolie.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/10/Melanie-Griffith-and-Antonio-Banderes-640x426.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/08/Prince-Charles-and-Camilla-Parker-Bowles-640x370.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/10/Elizabeth-Taylor-and-Eddie-Fisher-640x454.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2017/10/Miranda-Lambert-and-Blake-Shelton--640x480.jpg", "keywords": [], "authors": ["Jessica Wick"], "canonical_link": "https://www.cheatsheet.com/health-fitness/aol-brad-pitt-and-angelina-jolie-and-14-famous-celebrity-couples-that-began-as-an-affair.html/", "title": "Famous Celebrity Couples That Began as Secret Affairs", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/health-fitness/aol-brad-pitt-and-angelina-jolie-and-14-famous-celebrity-couples-that-began-as-an-affair.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "Relationships begin in many ways, sometimes before the last one ends. These famous celebrity couples risked it all for their affairs. Some lived happily ever after; some didn't.", "og": {"locale": "en_US", "type": "article", "title": "Famous Celebrity Couples That Began as Secret Affairs", "description": "Relationships begin in many ways, sometimes before the last one ends. These famous celebrity couples risked it all for their affairs. Some lived happily ever after; some didn't.", "url": "https://www.cheatsheet.com/health-fitness/aol-brad-pitt-and-angelina-jolie-and-14-famous-celebrity-couples-that-began-as-an-affair.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-06-22T15:16:27-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2017/10/Miranda-Lambert-and-Blake-Shelton--640x480.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2017/10/Miranda-Lambert-and-Blake-Shelton--640x480.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "relationships", "section": "Health & Fitness", "published_time": "2018-06-22T10:57:00-04:00", "modified_time": "2018-06-22T15:16:27-04:00"}, "twitter": {"card": "summary_large_image", "description": "Relationships begin in many ways, sometimes before the last one ends. These famous celebrity couples risked it all for their affairs. Some lived happily ever after; some didn't.", "title": "Famous Celebrity Couples That Began as Secret Affairs", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2017/10/Miranda-Lambert-and-Blake-Shelton--640x480.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1529679420.0, "source": "http://www.cheatsheet.com", "summary": ""}