{"url": "en.wikipedia.org/wiki/Jennifer_Lopez", "text": "American actress, singer, dancer and producer\n\nJennifer Lynn Lopez[2] (born July 24, 1969), also known by her nickname J.Lo, is an American actress, singer, dancer, fashion designer, producer, and businesswoman. In 1991, Lopez began appearing as a Fly Girl dancer on In Living Color, where she remained a regular until she decided to pursue an acting career in 1993. For her first leading role in the 1997 Selena biopic of the same name, Lopez received a Golden Globe nomination and became the first Latin actress to earn over US$1 million for a film. She went on to star in Anaconda (1997) and Out of Sight (1998), later establishing herself as the highest-paid Latin actress in Hollywood.[3]\n\nLopez ventured into the music industry with her debut studio album On the 6 (1999), which helped propel the Latin pop movement in American music. With the simultaneous release of her second studio album J.Lo and her romantic comedy The Wedding Planner in 2001, Lopez became the first woman to have a number one album and film in the same week. Her 2002 remix album, J to tha L–O! The Remixes, became the first in history to debut at number one on the U.S. Billboard 200. Later that year, she released her third studio album This Is Me... Then, and starred in the US box office number-one Maid in Manhattan.\n\nAfter starring in Gigli (2003), a critical and commercial failure, Lopez subsequently starred in the successful romantic comedies Shall We Dance? (2004) and Monster-in-Law (2005). Her fifth studio album, Como Ama una Mujer (2007), received the highest first-week sales for a debut Spanish album in the United States. Following an unsuccessful period, she returned to prominence in 2011 with her appearance as a judge on American Idol, and released her seventh studio album Love?. From 2016 to 2018, she starred in the crime drama series Shades of Blue and performed a residency show, Jennifer Lopez: All I Have, at Planet Hollywood Las Vegas. Since 2017, Lopez has produced and served as a judge on World of Dance. In 2019, she received critical praise for starring as a stripper in the crime drama Hustlers, for which she earned Golden Globe and Screen Actors Guild Award nominations.\n\nWith a cumulative film gross of US$3.1 billion and estimated global sales of 70 million records, Lopez is regarded as the most influential Latin performer in the United States. In 2012, Forbes ranked her as the most powerful celebrity in the world, as well as the 38th most powerful woman in the world.[4] Time listed her among the 100 most influential people in the world in 2018. Her most successful singles on the US Billboard Hot 100 include: \"If You Had My Love\", \"I'm Real\", \"Ain't It Funny\", \"All I Have\", and \"On the Floor\", which is one of the best-selling singles of all time.[5] For her contributions to the music industry, Lopez has received a landmark star on the Hollywood Walk of Fame, the Billboard Icon Award, and the Michael Jackson Video Vanguard Award among other honors. Her other ventures include clothing lines, fragrances, a production company, and a charitable foundation.\n\nEarly life\n\nJennifer Lynn Lopez was born on July 24, 1969,[6] in The Bronx borough of New York City,[7] to Puerto Rican parents[2] Guadalupe Rodríguez[8] and David López.[9] She has an older sister, Leslie, and a younger sister, Lynda, a journalist.[10] David worked the night shift at the Guardian Insurance Company before becoming a computer technician at the firm, while Guadalupe was a homemaker. When Lopez was born, the family was living in a small apartment in the Castle Hill neighborhood. A few years later, her parents had saved up enough money to be able to purchase a two-story house, which was considered a big deal for the relatively poor family.[11] At the age of five, Lopez began taking singing and dancing lessons. She toured New York with her school when she was seven years old. Her parents stressed the importance of work ethic and being able to speak English. They encouraged their three daughters to put on performances at home—singing and dancing in front of each other and their friends so that they would stay \"out of trouble\".[12] Lopez spent her entire academic career in Catholic schools, finishing at Preston High School.[13] In school, Lopez did gymnastics, ran track on a national level, and was a member of the school's softball team.[14] She excelled athletically rather than academically, competing in national track championships.[12]\n\nCareer\n\n1986–1996: Career beginnings and early roles\n\nWhile attending her final year of high school, Lopez learned about a film casting that was seeking several teenage girls for small roles. She auditioned and was cast in My Little Girl (1986), a low-budget film co-written and directed by Connie Kaiserman.[15] Lopez acted as Myra, a young woman at a center for troubled girls. After she finished filming her role in the film, Lopez realized that she wanted to become a \"famous movie star\". To please her parents, though, she enrolled in Baruch College, only to drop out after one semester. She told her parents about her dream of becoming a movie star, but they insisted that it was a \"really stupid\" idea and that \"no Latinos did that\". The differences in opinions led Lopez to move out of their family home and into an apartment in Manhattan. During this period, Lopez performed in regional productions of the musicals Jesus Christ Superstar and Oklahoma!. From there, she was hired for the chorus in a Golden Musicals of Broadway, which toured Europe for five months. She was unhappy with the role, as she was the only member of the chorus not to have a solo. She later got a job on the show Synchronicity in Japan, where she acted as a dancer, singer, and choreographer.[11]\n\nLopez was selected as a backup dancer for the New Kids on the Block in 1991 and performed with them during their performance of \"Games\" at the 18th Annual American Music Awards.[16] Shortly after, Lopez gained her first regular high-profile job as a Fly Girl dancer on the television program In Living Color. She applied for the job after one of the cast members was unable to continue with the show. Out of 2,000 applicants, Lopez made it to the finals. She was the runner-up but eventually received the role when the winner was unable to accept the job. She moved to Los Angeles to film the series and remained a regular cast member until 1993. when she decided to pursue a full-time acting career. Prior to leaving the show, Lopez briefly worked as a backup dancer for American recording artist Janet Jackson.[17] Lopez was set to tour with Jackson on her Janet World Tour in late 1993 but backed out as she wanted to do her \"own thing\".[18]\n\nLopez received her first professional acting gig in the direct-to-video drama film Lost in the Wild (1993), co-starring with Lindsay Wagner and Robert Loggia.[19] Later in 1993, Lopez signed a deal with CBS to co-star in the television series Second Chances. Lopez received her first major big-screen role in Gregory Nava's 1995 drama My Family portraying Young Maria.[20] Although her role was uncredited, Lopez received an Independent Spirit Award for Best Supporting Female nomination for her performance.[20] In November 1995, Lopez starred in Money Train alongside Wesley Snipes and Woody Harrelson as New York City transit cops. In August 1996, Lopez had a supporting role in the comedy Jack.[21]\n\n1997–1999: Breakthrough with Selena and On the 6\n\nIn February 1997, Lopez starred alongside Jack Nicholson and Stephen Dorff in the neo-noir thriller Blood and Wine.[22] Lopez starred as the title role of the Selena biopic of the same name in March.[23] Despite having previously worked with the film's director on My Family, Lopez was subjected to an intense auditioning process before she was cast in the film.[24] Kenneth Turan of the Los Angeles Times stated that even in the \"forgettable films\" Money Train, and Jack, Lopez's \"presence and ability made her seem just one role away from stardom\" and with Selena she's \"seized the opportunity and turned in an incandescent presentation that is especially strong during the film's numerous musical numbers\". He concluded by calling the film not just a celebration of Selena's life, but also of the actress who portrayed her.[25] The announcement was described as the \"role of a lifetime.\" from news outlets and Lopez's salary for the film was reported at $1 million,[26][27] which made Lopez the highest-paid Hispanic actress in history. After filming Selena, Lopez was \"really feeling [her] Latin roots\" and cut a demo in Spanish.[28] Lopez's manager then sent the song, titled \"Vivir Sin Ti\" (Living without You), to Sony Music Entertainment's Work Group, who showed an interest in signing Lopez. Tommy Mottola, the head of the label suggested to her that she sing in English instead.[29]\n\nIn April, Lopez starred in the horror film Anaconda alongside Ice Cube and Jon Voight.[30] Lopez starred alongside Sean Penn and Billy Bob Thornton in the crime film U Turn in October. The film, which is based on the novel Stray Dogs by John Ridley, received somewhat positive reviews from critics.[31]\n\nIn June 1998, Lopez starred opposite George Clooney in Out of Sight, Steven Soderbergh's adaptation of Elmore Leonard's novel of the same name.[32] Cast as a deputy federal marshal who falls for a charming criminal, Lopez won rave reviews for her performance.[33] Lopez provided the voice of Azteca in the computer-animated film Antz in October.[34]\n\nLopez's debut single, \"If You Had My Love\", was released in May 1999, as she began to ready her first album.[35][36] Lopez became the first artist to top the Billboard Hot 100 with a debut single since Britney Spears did so with her single \"...Baby One More Time\" four months prior.[37] During production of her debut album, On the 6, Lopez was aware that she received her recording contract on the basis of her looks and an already established name in the entertainment industry, and she wanted to prove she had musical talent.[38] Prior to the debut of her music, critics wondered why she would take the risk of launching a music career. It was noted that: \"If the album was a flop, not only would it embarrass Lopez, but it might even damage her career.\"[39] \"Waiting for Tonight\", the third single from On the 6, is widely considered to be Lopez's best song.[40] Lopez's musical success came as a surprise to critics; its launch made the \"popular actor even more popular\". Both the music industry and the public became intrigued by \"this woman who seemed to have so many different talents\".[39] By the end of 1999, Lopez successfully converted herself from a film star to a pop star.[41] She joined a select few in achieving this feat, becoming the first since Vanessa Williams (1992) and Martika (1989).[37]\n\n2000–2002: Film success, J.Lo and This Is Me... Then\n\nOn February 23, 2000, Lopez, accompanied by then boyfriend Sean Combs, wore a plunging exotic green Versace silk chiffon dress on the red carpet of the 42nd Annual Grammy Awards. The dress \"had a low-cut neck that extended several inches below her navel, where it was loosely fastened with a sparkly brooch and then opened out again,\" exposing her midriff and then as cut along the front of the legs like a bath robe.[42] The dress generated controversy and media attention, with images of Lopez in the dress being downloaded from the Grammy website over half a million times 24 hours after the event.[43] Lopez was surprised by the enormous media coverage, declaring that she had no idea \"it was going to become such a big deal\".[44] Lopez returned to the big-screen in August, starring in the psychological thriller The Cell opposite Vincent D'Onofrio.[45]\n\nDuring the process of recording her second album, Lopez decided to tweak her image as she began to develop into a sex symbol. She started going by J.Lo, something fans often called her[46] in the years after director Oliver Stone coined the term on the set of the 1997 film U Turn.[47] She subsequently named the album J.Lo. Released on January 23, 2001, it was a commercial success, debuting at number one on the US Billboard 200.[48] During the same week, her romantic comedy film The Wedding Planner in which she starred opposite Matthew McConaughey opened atop the box office. This made her the first woman to have a number one film and album simultaneously in the United States.[49] The album was preceded by the release of its lead single, \"Love Don't Cost a Thing\", which reached number one on the Billboard Mainstream Top 40 chart. It was followed by the single \"Play\".[50] In April 2001, Lopez launched J.Lo by Jennifer Lopez, her own clothing and accessory company. Lopez felt that \"the voluptuous woman [was] almost ignored\" in the fashion industry, and therefore her company specialized in clothing women of all shapes.[46] The following month, she starred in the romantic drama film Angel Eyes, which performed disappointingly at the box office and generated mixed reviews.[51] After several months, J.Lo was declining on the charts; this prompted Mottola to recruit rapper Ja Rule to create an urban-oriented remix of the song \"I'm Real\". This led to the release of \"I'm Real (Murder Remix)\", which quickly reached number one on the Billboard Hot 100. Its success resulted in J.Lo being reissued to include the single, which was number one in the United States during the week of the September 11 attacks.[50] J.Lo became the best-selling album of Lopez's career, having sold 3.8 million copies in the US and moved over 12 million units worldwide.[52][53]\n\nHaving redefined Lopez's sound with \"I'm Real (Murder Remix)\", Epic decided to release further remixes in order to \"keep the momentum going\".[54] A remix album entitled J to tha L–O! The Remixes was subsequently released on February 5, 2002. It debuted at the summit of the Billboard 200, making it the first remix album to do so. Its lead single, \"Ain't It Funny (Murder Remix)\", featuring Ja Rule and Caddillac Tah, reached number one in the US.[55] J to tha L–O! The Remixes became one of the best-selling remix albums of all time, selling 1.5 million copies in the US.[56] It produced two more singles: \"I'm Gonna Be Alright\" and \"Alive\", a ballad co-written by her husband at the time, Cris Judd. In April 2002, Lopez opened her restaurant, Madrè's.[46] The following month, she starred in the thriller film Enough, which was described by the Boston Herald as a \"kick-but, female empowerment\" film.[57] While filming Enough, which required an overworked Lopez to practice Krav Maga, she suffered a nervous breakdown. She recalled feeling \"sick and weird\", refusing therapeutic help or medication. She confessed, \"I was like – I don't want to move, I don't want to talk, I don't want to do anything.\"[58] In September, she released her first fragrance, Glow by JLo. It performed strongly despite predictions that it would fail, and became the top-selling fragrance in the US.[59]\n\nLopez's third studio album, This Is Me... Then, was released on November 25, 2002. It was dedicated to actor Ben Affleck, her fiancé at the time. The album's lead single \"Jenny from the Block\", was later described by Sam Lansky of MTV News as her most iconic single.[60] In the song, Lopez \"intones her modest childhood roots\".[61] The album itself performed strongly, selling 2.6 million copies in the US.[56] Its second single, \"All I Have\", peaked at number one in the US. That December, Lopez starred opposite Ralph Fiennes in the romantic comedy Maid in Manhattan, which became the highest-grossing film of her career.[62]\n\n2003–2005: Gigli, continued film success and Rebirth\n\nIn August 2003, Lopez starred opposite Affleck in the romantic comedy Gigli. The film was a box office bomb, and is considered one of the worst films of all time. The film's poor reception was attributed to negative press preceding its release, as well as the media attention surrounding Lopez and Affleck's engagement which largely overshadowed the film.[62][63] Lopez would later describe this as the lowest point of her career, saying \"[It] was very tough\", \"the tabloid press had just come into existence at the time, so I was like a poster child for that moment.\"[64] In October of that year, she released her next fragrance, Still Jennifer Lopez. Lopez also launched her next fashion label, Sweetface. It was described by Andy Hilfiger as a \"more intellectual, more inspirational collection than J-Lo by Jennifer Lopez. Less sporty, more suede.\"[65] Lopez's clothing lines and two fragrances generated over $300 million in revenue throughout 2004, which made her the 19th richest person under 40.[49]\n\nIn March 2004, Lopez had a minor role in the film Jersey Girl, alongside Affleck. Her character, Gertrude Steiney, dies during childbirth within the first 15 minutes of the film. From the intense media scrutiny following the couple's break-up, it was noted that \"they may need to put Lopez in a coffin on the poster if they want anyone to come\".[66] In October, Lopez co-starred alongside Richard Gere in the drama Shall We Dance?, a re-make of the 1996 Japanese film of the same title. The film was successful at the box office, and was considered a rebound for Lopez following Gigli.[62]\n\nAfter placing her career on hiatus, Lopez released her fourth studio album, Rebirth, in February 2005. According to Lopez, Rebirth \"came about because I was on such a roller-coaster ride, that was my career from my first album to my last album, and I did a bunch of movie projects in between. I finally took some time just for myself, and [when] I came back, this was the first project I did. I felt like it was a new beginning for me, like I was, in a way, reborn.\"[67] Tracy Hopkins of NBC's Today Music noted that after \"fawning\" over Affleck on This Is Me... Then\", Lopez \"wisely keeps her love life out of the spotlight\" on Rebirth and only references her relationship with singer/actor Marc Anthony on a few tracks.[68] The album produced the single \"Get Right\", which peaked at number one in the United Kingdom.[69] In May, she starred alongside Jane Fonda in the romantic comedy Monster-in-Law, for which she received a salary of $15 million.[70] The film's marketing played up Lopez's \"Gigli-and-tabloid tarnished image\", and it became a box office success.[62][71] In August, Lopez starred alongside Robert Redford and Morgan Freeman in An Unfinished Life, a drama film based on the novel of the same name.\n\n2006–2009: Como Ama una Mujer and career setbacks\n\nLopez in 2008\n\nIn April 2006, Lopez reappeared on the Billboard Hot 100 as a featured artist on \"Control Myself\", the lead single from LL Cool J's twelfth studio album Todd Smith. The song peaked at number four on the chart following its release as a music download, making it the pair's second collaboration to reach the top five.[72] Bordertown, a film based on the female homicides in Ciudad Juárez, made its premiere at the Cannes Film Festival on May 18, 2006. Lopez, who also acts as the film's producer, stars as Lauren Adrian, an American news reporter for the Chicago Sentinel who wants to be assigned to the Iraq front-lines to cover the war.[73] Bordertown received a direct-to-video release.[62] DanceLife, a reality series following the lives of seven dancers trying to break into the world of professional dance, aired on MTV from January 15 to March 5, 2007. Lopez produced, created and was featured in the show.[74] According to the album's co-producer Estéfano, Lopez's fifth studio album Como Ama una Mujer would \"prove critics wrong\" with its \"big songs that require a voice\"; referring to the criticism of Lopez having a \"limited\" vocal tone. The album's lead single \"Qué Hiciste\" reached number one on Billboard's Hot Latin Songs chart. Lopez performed the song on the sixth season of American Idol on April 11, 2007, becoming the first person to perform a Spanish song on the series.[69] The album received the highest first-week sales in the United States for a debut Spanish album and the highest digital sales.[77][78]\n\nIn September 2007, Lopez starred in the biographical film El Cantante, which is based on the life of the late salsa singer Héctor Lavoe. In the film, Lavoe is portrayed by then-husband Marc Anthony while Lopez plays Lavoe's wife Puchi.[79] Lopez revealed that she felt her performance in the film El Cantante should have earned her an Oscar.[80] \"I feel like I had that [Oscar worthy role] in 'El Cantante,' but I don't think the academy members saw it\".[80] El Cantante did not perform well at the box office, earning just $7.6 million.[62] Lopez performed the song \"Toma de Mí\" for the film's soundtrack. Lopez and Anthony also launched their co-headlining North American concert tour on September 28.[81] Lopez's sixth studio album Brave, released in October, was her lowest-charting album worldwide.[82] The album produced two singles, \"Do It Well\" and \"Hold It Don't Drop It\". The first peaked at number 31 on the Billboard Hot 100 chart, while the latter failed to make any significant impact on the charts. A five-part miniseries, Jennifer Lopez Presents: Como Ama una Mujer, based on the lyrics of Como Ama una Mujer aired on Univision from October 30 to November 27, 2007. She placed her career on hiatus after giving birth to twins in February 2008.[83] In late 2009, Lopez released two songs for her seventh studio album, Love? (\"Louboutins\" and \"Fresh Out of the Oven\"); however, the songs failed to make an appearance on the Billboard charts which led to her departure from Epic Records.[84]\n\n2010–2013: Career rejuvenation with American Idol and Love?\n\nLopez parted ways with Epic Records in February 2010, citing that she had fulfilled her contractual obligations and now wished to release her seventh studio album Love? under a new label.[85] Her departure from the label temporarily halted production on the album, which commenced in 2009. Upon signing a new contract with Island Records, recording resumed on the album.[86] The New York Daily News revealed that Lopez would be taking some of the records recorded under Sony Music Entertainment to her new label so that they could be included on the album.[87] In April, Lopez starred in the romantic comedy The Back-up Plan, her first theatrical role in three years.[83] In June, following the departure of Ellen DeGeneres from American Idol, it was reported that Lopez was in talks to join season ten's judging panel.[88][89][90] During this same time, Lopez and Anthony were being considered for a role on The X Factor for their appeal to Latin and International markets.[91] It was officially announced in September that Lopez would be joining the tenth season of American Idol. MTV stated that the deal was \"mutually beneficial to all those involved\", while CNN reported that Lopez was viewing it as a decision to revive her career, while American Idol producers believed that Lopez and Steven Tyler's appointments would strengthen viewing figures.[92] In October, Lopez released her fourteenth fragrance, Love and Glamour. The perfume was inspired by Lopez's forthcoming \"return to the spotlight\".[93]\n\nL'Oréal Paris named Lopez their new Global Ambassador and the face of their brands, including EverPure hair care, Preference hair color and Youth Code skin care. Her EverSleek hair care ads made their debut in early 2011, to coincide with the release of Love? and her debut as a judge on American Idol.[94] To further promote her comeback, in February, Venus chose Lopez as their new Global Ambassador.[95] Lopez's comeback single \"On the Floor\" was released later that same month. The song topped the charts across the globe, becoming one of the most successful singles of the year.[96] The song also became her highest charting single commercially as a lead artist, as well as her most successful airplay hit on contemporary hit radio, since \"Jenny from the Block\".[97] Love?, which was released in May, was a moderate commercial success, and was viewed as a humble comeback from Lopez, as many had considered her recording career over.[82] Lopez launched her next fragrance Love and Light in July, exclusively on HSN. 51,000 bottles of the fragrance were sold at its premiere, becoming Lopez's most successful fragrance launch to date, making over $2.9 million.[98] In September, Lopez launched the Jennifer Lopez Collection, a clothing and accessories line for Kohl's with Tommy Hilfiger.[99] In addition to the clothing line, she also launched the Jennifer Lopez Home Collection, featuring bedding, towels and luggage.[100] Later that same month Fiat, an Italian automobile manufacturer, enlisted Lopez to promote their products, including the 2012 Fiat 500 Cabrio. Olivier Francois, the Chrysler chief marketing officer, stated that she \"fits perfectly with the brand\".[101]\n\nIn January 2012, Lopez returned as a judge on the eleventh season of American Idol, earning a reported $20 million.[102] Later that same month, a new talent show, ¡Q'Viva! The Chosen, created by Simon Fuller premiered on Univision and was a hit for the channel.[103] It followed Lopez, Anthony and director-choreographer Jamie King as they travelled across 21 countries in Latin America to find new talent for a Las Vegas show. On May 18, Lopez returned to the big screen starring alongside an ensemble cast consisting of Cameron Diaz, Elizabeth Banks, Matthew Morrison and Dennis Quaid in the film What to Expect When You're Expecting, which is based on the novel of the same name.[104] In late May, Lopez released her fragrance Glowing by JLo, which she described as an \"evolution\" of Glow by JLo.[105]\n\nLopez launched the Dance Again World Tour, her first headlining concert tour, on June 14.[106] It was a lucrative, grossing over $1 million per show.[107] On July 12, she launched Teeology, a luxury T-shirt e-commerce.[108] Lopez voiced Shira, a saber tooth tiger, in the animated film, Ice Age: Continental Drift, the fourth film in the Ice Age franchise.[109] The film became her highest opening weekend figure, at $46 million.[110]\n\nLopez's first greatest hits album, Dance Again... the Hits, was released on July 24, 2012 in the United States.[111] It was released by Epic Records, as Lopez owed them one final album to end her contract, despite previously announcing that she had fulfilled her contract with the label.[112] Lopez, who was going through a divorce with Anthony and the \"breakup of a family\", felt as if the album's sole single, \"Dance Again\", had come to her at the \"perfect moment\".[113][114] \"Dance Again\" and \"Goin' In\", a single from the soundtrack of the dance film Step Up Revolution, both reached the top of the Billboard Hot Dance Club Songs, giving Lopez her twelfth and thirteenth number one on that chart, respectively.[115] nuvoTV announced in September its premier partnership with Lopez, that will see her work on the creative side of the network, managing marketing and program production with her production company, Nuyorican Productions, as well as periodically appearing in network programming.[116][117]\n\nIn January 2013, Lopez starred alongside Jason Statham in the crime thriller Parker, in which she played Leslie. Her performance earned positive reviews, with Chicago Tribune commending the role for giving Lopez \"an opportunity to be dramatic, romantic, funny, depressed, euphoric and violent. The audience stays with her all the way\".[118] The following month, she gained widespread notoriety for wearing a daring black dress at the Grammy Awards, which revealed her entire right leg; despite a conservative dress code which had been issued to celebrities in attendance.[119] In May, Lopez was announced as the chief creative officer of nuvoTV. In addition, she founded the mobile phone retail brand Viva Móvil, which is catered specifically for Latinos.[120] She lobbied for more Hispanic diversity on television,[121] hoping to empower the Latin community in these media ventures, stating: \"There's a big revolution going on, it's like a media and cultural revolution of Latinos here in the United States. We're realizing our power. We're realizing that we matter here.\"[122] Inspired by her gay aunt who had recently died, Lopez signed on as executive producer of the television series The Fosters, which is about a same-sex couple raising a family.[123] The show premiered on ABC Family on June 3, 2013, and has since been a ratings success for the network.[124] Later that June, Lopez performed at the birthday of Turkmenistan President Gurbanguly Berdymukhamedov.[125] Doing so, she garnered widespread backlash for performing for the leader of a \"repressive, authoritarian regime\". Her publicist released an apology.[125] Lopez returned as judge on American Idol for its thirteenth season for a reported salary of $17.5 million.[126] She was ranked as the fifth highest-paid woman in music for 2013, having earned $45 million.[107]\n\n2014–2017: Television ventures and residency show\n\nAfter the conclusion of her Dance Again World Tour, Lopez began recording her eighth studio album, A.K.A., inspired by her travels.[127] It was released in June 2014 through Capitol Records, experiencing lackluster sales.[128] The album produced three singles: \"I Luh Ya Papi\", which features French Montana, \"First Love\", and \"Booty\", featuring Pitbull or rapper Iggy Azalea. \"Booty\" debuted inside the top twenty in the United States, making it her second-highest debut on the Billboard Hot 100 after \"On the Floor\".[129] In April, the official song for the 2014 FIFA World Cup performed by Pitbull, Lopez and Brazilian recording artist Claudia Leitte, \"We Are One (Ole Ola)\", was released. She was ranked as the sixth highest-paid woman in music for the year, earning $37 million.[130] In November 2014, Lopez partnered with Endless Jewelry, designing a range of new jewelry products.[131] That month, she also released first her book, True Love, which became a New York Times best-seller.[132]\n\nJanuary 2015 saw the release of The Boy Next Door, an erotic thriller that Lopez both co-produced and starred in as a high school teacher who becomes involved with a student, which eventually leads to his dangerous obsession with her.[133] The film received negative reviews from critics.[134] Despite this, it became her most successful opening at the box office for a live action film since Monster-in-Law,[135] and ultimately grossed over $53 million at the global box office, against a production budget of $4 million.[136] Lopez had a voice role in the animated feature Home, alongside Steve Martin, Jim Parsons, and Rihanna, and released in March 2015.[137] She contributed the single \"Feel the Light\" to the film's official soundtrack.[138] Lopez also starred in the independent drama film Lila & Eve, alongside Viola Davis.[139] With annual earnings of $28.5 million, she was ranked as the seventh highest-paid woman in music for 2015.[140]\n\nLopez starred as Detective Harlee Santos in NBC's crime drama series Shades of Blue (also serving as an executive producer), a single mother and police detective who goes undercover for the FBI to investigate her own squad.[141] It premiered on January 7, 2016, giving the network its most-watched Thursday debut in seven years with 8.6 million viewers.[142] Lopez's performance received positive reviews.[143][144][145] Shades of Blue was renewed for a second season, which premiered in March 2017.[146] That same month, the series was renewed for a third season.[147][148] In May 2015, she announced her Las Vegas residency concert show, which commenced on January 20, 2016, the first of twenty initial dates. Titled All I Have, it takes place at Planet Hollywood's Zappos Theater.[149][150] The residency has been lucrative,[151] and Lopez signed a three-year contract which saw her perform 120 shows.[152] The residency concluded on September 29, 2018, having grossed over $100 million in ticket sales during its three-year run.[153] In March 2016, six years after announcing her departure, she announced her return to Epic Records, signing a multi-album deal with the label.[52] Her first single since returning to Epic, \"Ain't Your Mama\", was released the following month.[154] With earnings of $39.5 million, she was among the highest-paid female artists from June 2015 to June 2016.[151] Lopez reprised her voice role as Shira in the animated film Ice Age: Collision Course, which was released in July 2016.[155]\n\nIn collaboration with Giuseppe Zanotti, Lopez designed a capsule collection of shoes and jewelry. Giuseppe for Jennifer Lopez launched in January 2017.[156] In July 2016, Lopez announced a new dance competition series entitled World of Dance, for which she serves as an executive producer and judge. Created in partnership with World of Dance, the series was greenlit by NBC with a straight-to-series order for ten episodes.[157] World of Dance premiered on May 30, 2017; with 9.7 million viewers, it became the most-watched premiere for a summer alternative series in nine years.[158][159] According to Forbes, Lopez was the eleventh highest-paid female celebrity between June 2016 and June 2017, with earnings of $38 million.[160] Lopez had announced in October 2016 that she was working on a second full length Spanish album, which was set to be released through Sony Music Latin, with Marc Anthony serving as an executive producer.[78][161] It was to be titled Por Primera Vez, which translates to For the First Time in English.[162] The album, which never materialized,[163] produced two singles: \"Ni Tú Ni Yo\" (featuring Cuban reggaeton group Gente de Zona)[164][165] and \"Amor, Amor, Amor\" featuring Wisin.[162]\n\n2018–present: Hustlers and Super Bowl LIV halftime show\n\nIn April 2018, Lopez launched her limited-edition makeup collection in collaboration with Inglot Cosmetics.[166] That month, she was named one of Time's 100 most influential people in the world,[167] and released a new Spanish single, \"El Anillo\".[168] The following month, she released a bilingual single titled \"Dinero\", featuring DJ Khaled and Cardi B.[169] Later, Lopez made a cameo appearance in the music video of Maroon 5's \"Girls Like You\", with Cardi B.[170] With earnings of $47 million between June 2017 and June 2018, Forbes listed Lopez as the sixth highest-paid woman in music.[171] In December 2018, Lopez starred in the comedy film Second Act, directed by Peter Segal; she also produced the film,[172] and recorded the single \"Limitless\" for its soundtrack.[173] Second Act earned mixed reviews from critics,[174] but performed well at the box office, grossing over $72.2 million worldwide with a production budget of $16 million.[175]\n\nIn February 2019, Lopez announced that she will be embarking on her first concert tour in nearly seven years to celebrate her upcoming 50th birthday. Titled It's My Party, the international tour ran from June to August, grossing an estimated $54.7 million from thirty-eight shows.[176] In March, alongside her fiancé Alex Rodriguez, Lopez launched a collection of sunglasses with the brand Quay Australia.[177] The following month, she premiered the single \"Medicine\" featuring French Montana, her first release through L.A. Reid's Hitco Entertainment label.[178]\n\nLopez next starred in the film Hustlers (2019), for which she also served as an executive producer. Directed by Lorene Scafaria, the film is inspired by a true story, following a group of Manhattan strippers who con wealthy men.[179][180] Lopez's portrayal of a veteran stripper in Hustlers garnered acclaim from critics, with some deeming it the best performance of her acting career.[181][182][183] The film also gave Lopez her highest opening weekend at the box office for a live action film (grossing $33.2 million),[184] and garnered her nominations for Best Supporting Actress at the Golden Globe Awards, Screen Actors Guild Awards, Critics' Choice Movie Awards and Independent Spirit Awards.[185] The success of Hustlers has been regarded by various media outlets as a comeback for Lopez.[186][187][188] Also in September 2019, Lopez modeled an updated version of her Green Versace dress at Milan Fashion Week; her appearance generated $31.8 million in total media impact value.[189][190] Following this, she launched her twenty-fifth fragrance, which is titled Promise,[191] and was announced as the global face of the Coach brand.[192]\n\nIn September 2019, it was announced that Lopez will co-headline the Super Bowl LIV halftime show alongside Shakira, which took place on February 2, 2020, in Miami, Florida.[193][194] Her daughter, Emme Maribel Muñiz, also made an appearance at the show.[195][196] She will next star in Marry Me opposite Owen Wilson for Universal Pictures.[197] Lopez is attached to star as drug lord Griselda Blanco in The Godmother for STX Entertainment, which will focus on the \"rise and fall\" of Blanco. She will also serve as an executive producer for the film, which is currently in development.[198]\n\nPersonal life\n\nLopez's personal life has attracted widespread media attention.[199] From February 22, 1997, to January 1998, she was married to Cuban waiter Ojani Noa. Since their brief marriage, Lopez has endured many legal troubles regarding her relationship with Noa. In April 2006, she sued to prevent him from publishing a book about their marriage, contending that it violated their confidentiality agreement.[200] The following year, a court-appointed arbitrator issued a permanent injunction forbidding Noa from \"criticizing, denigrating, casting in a negative light or otherwise disparaging\" Lopez. She was awarded $545,000 in compensatory damages and Noa was ordered to hand over all copies of materials related to the book to Lopez or her attorney.[201] A lawsuit regarding a compromising private honeymoon video in Noa's possession is presently running.[202]\n\nWhile working on her first album, On the 6, Lopez began dating record producer and rapper Sean Combs. On December 27, 1999, the couple was arrested along with two others in connection with a shooting outside a Times Square club. They were charged with criminal possession of a weapon as well as stolen property. Lopez was soon exonerated, having had nothing to do with the crime.[203] However, Combs was charged and indicted by a Manhattan grand jury.[204] After leaving Combs, Lopez developed a relationship with former back-up dancer Cris Judd, to whom she was married from September 29, 2001, to June 2002.[205] Following her second divorce due to irreconcilable differences, she commenced a high-profile relationship with actor and director Ben Affleck, to whom she became engaged in November 2002.[206][207] The media began to refer to them as \"Bennifer\", and they became a prominent supercouple in the media and popular culture. Bennifer became a popular term, which was eventually entered into urban dictionaries and neologism dictionaries as notable,[208] as the name blend started the trend of other celebrity couples being referred to by the combination of their first names.[209] The couple postponed their nuptials indefinitely a day prior to the planned ceremony in September 2003, citing the media's interference with the event as the reason.[210]\n\nAnthony and Lopez, 2006\n\nLopez's break-up with Affleck in January 2004 was her \"first real heartbreak\". She described her next relationship, with her longtime friend, Marc Anthony (real name: Marco Antonio Muñiz), as an attempt to \"find someone who could make me feel loved and wanted in my loneliest hour ... Thinking back, maybe deep down I knew that this was a Band-Aid on the cut.\"[211] She married Anthony that June,[212][213] and lived in Brookville, New York.[214] Two men attempted to ransom a private wedding video that was stolen from the couple for one million dollars; however, they were arraigned in Manhattan Criminal Court on charges of conspiracy, attempted grand larceny and possession of stolen property.[215] On November 7, 2007, during the final night of their co-headlining tour, Lopez and Anthony officially confirmed that they were expecting their first child.[216] The announcement ended months of speculation over the pregnancy.[217] Her father confirmed that the couple were expecting twins, revealing that it runs in the family: \"My sister also had twins, so it's a hereditary thing.\"[218] Lopez, who is a Roman Catholic, has stated that her faith discouraged her from pursuing in vitro fertilization treatment while trying to get pregnant.[219]\n\nLopez gave birth to a son and a daughter on Long Island, on February 22, 2008.[220][221] The twins were introduced in the March 11, 2008, issue of People, for which the magazine paid a reported $6 million; the photographs of the twins became the most expensive celebrity picture ever taken at the time.[222] Three years later in July 2011, the couple announced their split, with Anthony filing for divorce in April 2012.[223] Their divorce was finalized on June 16, 2014, with Lopez retaining primary physical custody of the two children.[224] On December 31, 2014, she legally changed her name back to Jennifer Lopez, dropping Anthony's last name (Muñiz).[225][226]\n\nLopez had an on-off relationship with her former backup dancer Casper Smart from October 2011 to August 2016.[227][228]\n\nIn February 2017, she began dating former New York Yankees baseball player Alex Rodriguez.[229][230] In March 2019, they announced their engagement.[231]\n\nIn March 2018, Lopez opened up about her own Me Too movement story of being sexually harassed by a director early on in her career, when she was asked to take her top off during one of her first films.[232][233] Lopez has also been an active advocate for the Time's Up movement.[234]\n\nOther activities\n\nPhilanthropy\n\nFollowing the September 11 attacks, Lopez was heavily involved in charitable activities. Joining various other artists, she was featured on charitable singles such as \"What's Going On\" and \"El Ultimo Adios (The Last Goodbye)\", which benefited people affected by the tragedy.[235][236] One dollar from each ticket sold at Lopez and Anthony's co-headlining North American concert tour, which grossed an estimated $10 million, was donated to Run for Something Better—a charitable organization supporting physical fitness programs for children.[81][237] In February 2007, Lopez was honored with the Artists for Amnesty prize by the human rights organisation Amnesty International, for her work in the film Bordertown, which shed light on the hundreds of female homicides in Ciudad Juárez. Lopez described it as \"one of the world's most shocking and disturbing, underreported crimes against humanity.\"[238][239]\n\nIn 2009, Lopez launched the Lopez Family Foundation (originally known as the Maribel Foundation) alongside her sister, Lynda. The nonprofit organization seeks to increase the availability of healthcare for underprivileged women and children, offering a telemedicine program supported by a partnership with the Children's Hospital Los Angeles. The foundation has led to the expansion of medical facilities in Panama and Puerto Rico, and created the Center for a Healthy Childhood at the Montefiore Medical Center in the Bronx.[240][241]\n\nIn December 2012, Lopez held a charity drive that would affect her three favorite charities: the Gloria Wise Boys and Girls Club, the Children's Hospital of Los Angeles as well as the American Red Cross, mainly benefiting victims of Hurricane Sandy, which devastated parts of her home town, New York City.[242] In May 2015, she became the first national celebrity spokesperson for the Children's Miracle Network Hospitals and the BC Children's Hospital Foundation (BCCHF), appearing in a campaign entitled \"Put Your Money Where the Miracles Are\".[243] That September, Lopez was announced as the first Global Advocate for Girls and Women at the United Nations Foundation.[244] This role sees her mobilizing action to address challenges faced by girls and women around the world, including maternal health care programs, education and violence against women.[245] In September 2017, following Hurricane Irma and Hurricane Maria, Lopez announced that she would be donating $1 million from the proceeds of her Las Vegas residency to humanitarian aid for Puerto Rico.[246][247] Along with ex-husband Marc Anthony, she launched a humanitarian relief campaign entitled Somos Una Voz (English: We Are One Voice), an effort supported by various celebrities to rush supplies to areas affected by Hurricane Maria.[248] Lopez and Anthony presented a subsequent concert and telethon for disaster relief, \"One Voice: Somos Live!\", which raised over $35 million.[249] She was also among various artists featured on Lin-Manuel Miranda's charity single \"Almost Like Praying\" which benefits Puerto Rico.[250]\n\nPolitical activism\n\nLopez is an avid supporter of LGBT rights, and has raised millions of dollars for HIV/AIDS research.[251] In June 2013, amfAR presented Lopez with its humanitarian award for her philanthropic work.[251] That September, she was awarded the Ally for Equality award presented by the Human Rights Campaign, for her support of the LGBT community.[252] The following year, she received the GLAAD Vanguard Award.[253] In July 2016, Lopez released a single entitled \"Love Make the World Go Round\", a collaboration with Lin-Manuel Miranda, which benefits victims of the 2016 Orlando nightclub shooting.[254] She was also featured on the song \"Hands\" along with numerous other artists, also benefiting those affected by the Orlando shooting.[255] Among numerous other artists, Lopez signed an open letter from Billboard magazine to the United States Congress in 2016, which demanded action on gun control.[256]\n\nLopez endorsed President Barack Obama in his 2012 presidential campaign, speaking in television advertisements and attending a fundraising event for Obama in Paris.[257][258] She endorsed Democratic presidential nominee Hillary Clinton in 2016, headlining a free concert in Florida in support of her that October.[258][259]\n\nArtistry\n\nInfluences and musical style\n\nLopez has been influenced by artists such as Tina Turner, James Brown, Michael Jackson, Madonna, Barbra Streisand, and Lady Gaga.[260][261][262] Growing up, she was influenced by Latin music styles ranging from salsa to bachata, but it was the 1979 hip hop song \"Rapper's Delight\" by The Sugarhill Gang that she said changed her life.[263] She was also \"hugely inspired in her youth\" by Rita Moreno's performance in the 1961 musical film West Side Story.[264] Lopez has cited Janet Jackson as a major inspiration for her own dance and videos, stating that she \"probably started dancing\" because of Jackson's music video for \"The Pleasure Principle\".[265][266]\n\nAccording to author Ed Morales in The Latin Beat: The Rhythms And Roots Of Latin Music From Bossa Nova To Salsa And Beyond (2003), Lopez's music explores the \"romantic innocence\" of Latin music, while strongly identifying with hip hop.[269] Her debut album On the 6 fuses the influence of Latin music with R&B and hip hop, which Lopez described as Latin soul. To the contrary, Morales described it as \"state-of-the-art dance pop\".[264] Dee Lockett, writing for the Chicago Tribune, stated that songs such as \"Waiting for Tonight\" made Lopez \"arguably the leading artist in the dance-pop movement at the time\".[270] While primarily sung in English, she speaks in Spanish and asserts her Latin heritage throughout the album, which is apparent in the song \"Let's Get Loud\".[271][272][273] She has also recorded bilingual songs, including the Latin pop song \"Cariño\", for her second album J.Lo.[274] A departure from her previous albums, This Is Me... Then blends 1970s soul with \"streetwise\" hip hop.[275]\n\nDescribed as autobiographical,[276] much of Lopez's music has centered around the \"ups and downs\" of love.[277] The lyrical content of This Is Me... Then is largely focused on her relationship with Ben Affleck, with the song \"Dear Ben\" being described as the album's \"glowing centerpiece\".[278] Her first full length Spanish-language album, Como Ama una Mujer features introspective lyrics about romance, heartache and self-loathing.[279] When explaining her seventh studio album Love?, Lopez stated: \"There's still so much to learn and that's why the question mark.\"[277] Other recurrent themes in Lopez's music have included her upbringing in the Bronx[264][280] and women's empowerment.[281]\n\nCritics have considered Lopez's voice to be limited,[282][283] and obscured by the production of her music, while remaining \"radio-friendly\".[284] Rob Sheffield of Rolling Stone observed: \"Instead of strained vocal pyrotechnics, Lopez sticks to the understated R&B murmur of a round-the-way superstar who doesn't need to belt because she knows you're already paying attention [...] She makes a little va-va and a whole lot of voom go a long way.\"[285] Meanwhile, AllMusic's Stephen Thomas Erlewine called her voice \"slight\" and wrote: \"Lopez was never, ever about singing; she was about style\".[286] Entertainment Weekly criticized her vocal performance for lacking the trademark \"husky-voiced voluptuousness\" she has in her films.[287] J. D. Considine of The Baltimore Sun regards Lopez as having a \"breathy\" stylistic range, but lacking personality.[288]\n\nDance and stage\n\nConsidered one of dance's \"greatest success stories\",[157] Refinery29 ranked Lopez at number two on \"11 Of Pop's Most Iconic Dancers\" in 2015.[289] Lopez felt an emotional connection to dance since her youth, when she specialized in ballet, jazz and flamenco.[290][291] Her career commenced on the variety television sketch comedy series In Living Color, where she was a part of an ethnically diverse dance group known as the Fly Girls.[292] Since beginning her music career, Lopez has become known for her body-emphasizing music videos, which often include dance routines.[293] CNN's Holly Thomas noted that \"Lopez's years of professional dance experience gave her a captivating, commanding presence in her videos.\"[294] Some of these videos have been the subject of controversy, including \"Jenny from the Block\", \"Dance Again\" and \"Booty\".[295][296] Her provocatively choreographed music video for \"If You Had My Love\" allowed Lopez to become a dominant figure on MTV networks worldwide.[297] Madeline Roth of MTV wrote: \"Her diverse videography encompasses some of the most memorable visuals of the 21st century\",[298] with Rolling Stone writer Brittany Spanos observing that her \"dancing skills and ability to toy with her own celebrity have made her videos an important part of the new millennium's pop canon.\"[299]\n\nOn stage, Lopez is recognized for her showmanship and sex appeal,[300] and often includes costumes such as bodysuits as part of her performance.[301][302] Author Priscilla Peña Ovalle stated in Dance and the Hollywood Latina: Race, Sex and Stardom (2011) that Lopez was one of the Latin stars who \"used dance to gain agency as working performers with mainstream careers, yet many of their roles paradoxically racialized and sexualized their bodies\".[303] Troy Patterson of Entertainment Weekly also observed that she used her body for emphasis on stage, \"She turned herself out as the fly girl hyperversion of postfeminist power, flaunting her control by toying with the threat of excess. In consequence, her star went supernova.\"[304] Her signature movements include \"clock-wise pivoting with salsa hip circles and sequential torso undulations\".[305] While being noted to lip sync in the early stages of career, Lopez's Dance Again World Tour was praised for showcasing live vocals and choreography synchronously.[306][307][308] In a review of her Las Vegas residency All I Have, Los Angeles Times writer Nolan Feeney remarked that her dancing is \"undoubtedly the centerpiece of the show\".[300]\n\nLopez's provocative stage performances have also drawn scrutiny at times. In May 2013, her performance on the finale of the television series Britain's Got Talent was deemed inappropriate for family-friendly television, and drew viewer complaints to Ofcom.[309] Following her controversial performance at the musical festival Mawazine in 2015, Moroccan Prime Minister Abdelilah Benkirane called it \"indecent\" and \"disgraceful\", while an education group claimed that she \"disturbed public order and tarnished women's honor and respect\".[310]\n\nPublic image\n\nLopez performing during her Dance Again World Tour, December 2012.\n\nSpeaking of Lopez's image, Andrew Barker of Variety observed: \"Despite a carefully cultivated image as an imperious pop empress in ludicrously expensive outfits, her signature hits bear the titles \"I'm Real\" and \"Jenny From the Block\". She managed the perilous transition from actress to music star without ever seeming to pick either as a primary gig. She established herself as an oft-provocative sex symbol while her demeanor made it abundantly clear that she's not asking you to come hither.\"[268] In 2002, Lynette Holloway of The New York Times described Lopez as overexposed. She wrote: \"Forgive yourself if you are seeing Jennifer Lopez in your sleep. She is everywhere.\" Holloway noted her image to be \"a dash of ghetto fabulousness\" and \"middle-class respectability\" for mass appeal.[311] Entertainment Weekly observed a change in her public profile upon joining American Idol in 2011, writing: \"Gone was her old cut-a-bitch swagger; J. Lo 2.0 is an all-embracing, Oprahfied earth madre.\"[312] Lopez is considered an icon of popular culture.[313] Television presenter Ray Martin describes her as a \"showbiz phenomenon\".[314]\n\nLopez is widely celebrated for her callipygian figure,[315] which was the inspiration for Sir Mix-a-Lot's 1992 hit \"Baby Got Back\".[316] She has been credited with influencing a change in mainstream female body image.[317] In Latin Sensations (2001), Herón Marquez wrote: \"Because she wasn't rail thin, Lopez had broken the mold and allowed millions of women to feel good about their bodies. Suddenly, it was okay for women to have hips, curves, and a big backside.\"[39] Vanity Fair described her buttocks as \"in and of themselves, a cultural icon\".[318] Details magazine named Lopez the \"Sexiest Woman of the Year\" in 1998,[319] and she led FHM's \"100 Sexiest Women\" list twice.[320] In 2011, she was named \"The Most Beautiful Woman\" by People.[321] The following year, VH1 ranked her the fourth on their list of \"100 Sexiest Artists\",[322] while Vibe magazine named her the most \"lustable\" celebrity of the past twenty years.[323] In 2014, Lopez stated, \"There's this funny notion in America that you can't be a mom and be sexy (...) It's the craziest thing I've ever heard... The truth is that women can be sexy until the day they die.\"[133]\n\nLopez is a tabloid fixture[324][325] and has admitted to having a \"less-than-perfect\" public image.[326] The media often draw comparisons between Lopez and actress Elizabeth Taylor, due to her numerous failed relationships.[327] In fact, Lopez has been dubbed a \"modern-day Liz Taylor\" by the media.[328] Lynn Hirschberg of W compared her glamorous public persona to that of Taylor.[329] Her style is described by Billboard's Lauren Savage as scantily clad.[330] Lopez has been criticized by the animal rights organization PETA for inclusion of fur in her fashion lines and outfits.[331] She has received a bad reputation as being a demanding \"diva\",[332] something which she denies.[333] In 2003, The Observer remarked that Lopez was \"the woman immortalised in a million headlines as 'Hollywood's most demanding diva' ... Lopez must wonder what heinous crime she has committed to become the most vilified woman in modern popular culture.\"[334]\n\nLegacy and cultural impact\n\nLopez is regarded as the most influential Hispanic performer in the United States, credited with breaking racial barriers in the entertainment industry.[14][335] In 1999, The Record newspaper observed that she was responsible for the introduction of a Latina presence in the film industry, which was a \"whites-only preserve\" for much of its history.[336] Described as a \"multidimensional artist who had turned into a financial powerhouse\",[337] Lopez became the highest-paid actress of Hispanic descent in history.[338] Miriam Jiménez Román stated in The Afro-Latin Reader: History and Culture in the United States (2009) that \"[she] was able to traverse the difficult racial boundaries\".[339] In 2012, business magazine Forbes suggested that Lopez \"may be the most powerful entertainer on the planet\",[340] and named her \"the world's most powerful Latino celebrity\".[341]\n\nUpon launching her music career in the late 1990s, Lopez contributed to the \"Latin explosion\" occurring in entertainment at the time.[342] Writing for The Recording Academy, Brian Haack described her as the \"breakout female star\" of the Latin pop movement in American music.[343] She was featured on the cover of the first issue of Latina magazine in 1996, with editor Galina Espinoza stating in 2011 that there is \"no recounting of modern Latina history without Jennifer\".[344] Around the time her career began to burgeon, the emphasis on Lopez's curvaceous figure grew; scholar Sean Redmond wrote that this was a sign of her role and social power in the cultural changes occurring in the United States.[345] In August 2005, Time listed Lopez as one of the most influential Hispanics in America, remarking: \"Why? Because over a decade ago, she was an anonymous background dancer on the second-rated sketch-comedy show. Today she's known by two syllables.\"[49] In February 2007, People en Español named her the most influential Hispanic entertainer.[335] In 2014, scientists named a species of aquatic mite found in Puerto Rico, Litarachna lopezae, after Lopez.[346][347]\n\nLopez is considered a global icon, and is often described as a triple threat performer.[348][349][350] VH1 ranked her at number 15 on their list of 200 Greatest Pop Culture Icons,[351] number 16 on 100 Greatest Women In Music,[352] and number 21 on 50 Greatest Women of the Video Era.[353] Lopez has been cited as an influence or inspiration by a range of entertainers, including Jessica Alba,[354] Adrienne Bailon,[355] Kat DeLuna,[356] Mike Doughty,[357] Fifth Harmony,[358] Becky G,[359] Selena Gomez,[360] Ryan Guzman,[361] Kelly Key,[362] Q'orianka Kilcher,[363] Demi Lovato,[364] Normani,[365] Pitbull,[366] Francia Raisa,[355] Cierra Ramirez[367] Naya Rivera,[368] Bebe Rexha,[369] Rosa Salazar,[370] Gwen Stefani,[371] Stooshe,[372] and Kerry Washington.[373]\n\nFamed for her distinct style and fashion sense, Us Weekly named Lopez \"Style Icon\" of the 2000s decade.[374] In 2019, the Council of Fashion Designers of America presented her with its Fashion Icon Award for her \"long-standing and global impact on fashion\".[375] The Green Versace \"Jungle Dress\" that Lopez wore at the 42nd Annual Grammy Awards in 2000 was voted the fifth most iconic red carpet dress of all time in a poll run by The Daily Telegraph.[376] The images of Lopez wearing the dress became the most popular search query of all time at that point, and subsequently led to the creation of Google's image search.[377][378] Her style has influenced a range of celebrities, including Kelly Rowland, Kim Kardashian and Jennifer Love Hewitt.[379][380][381] Her record-breaking fragrance line has become the most successful celebrity line in the world, with sales exceeding $2 billion as of 2012 .[382] Her first fragrance, Glow by JLo, has been credited with influencing the rise of celebrity fragrances in the 2000s,[383] with perfume critic Chandler Burr stating: \"Elizabeth Taylor was one of the first [to have her own scent], but Glow kicked the whole thing into overdrive.\"[384] Following the success of Lopez's appointment as a judge on American Idol in 2010, a trend of networks hiring \"big names\" for judging panels on reality shows ensued. The Hollywood Reporter branded this \"The J.Lo Effect\".[385]\n\nAchievements\n\nAs of 2017 , Lopez has sold more than 70 million records worldwide,[386] and her films have grossed a cumulative total of US$3.1 billion.[387] She remains the only female entertainer to have a number one album and film simultaneously in the United States.[388][389] With her second studio album J.Lo (2001), Lopez became the first female solo recording artist under Epic Records to achieve a number one album in the United States since its inception in 1953.[390] Her album J to tha L-O! The Remixes was acknowledged by the Guinness World Records as the first number one remix album in the United States.[391] In 2010, Lopez was honored by the World Music Awards with the Legend Award for her contribution to the arts.[392] Lopez's return to prominence the following year with her single \"On the Floor\"—among the best-selling singles of all time, and its music video recognized as the \"Highest Viewed Female Music Video of All Time\" by Guinness World Records in 2012—is regarded as one of the greatest musical comebacks in history.[393][394] In 2013, she was presented with the prestigious landmark 2,500th star on the Hollywood Walk of Fame for her musical contributions,[395] and Univision presented her with the World Icon Award in its Premios Juventud.[396] In 2014, she became the first female recipient of the Billboard Icon Award.[397] Billboard magazine ranked her as the ninth greatest dance club artist of all time in 2016.[398] In 2017, she was awarded the Telemundo Star Award.[399] In 2018, Lopez received the Michael Jackson Video Vanguard Award at the 2018 MTV Video Music Awards, making her the first Latin performer to claim the prize since its introduction in 1984.[400]\n\nDiscography\n\nFilmography\n\nTours\n\nHeadlining\n\nCo-headlining\n\nResidency concerts\n\nSee also\n\nReferences", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Gnome-mime-sound-openclipart.svg/50px-Gnome-mime-sound-openclipart.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/The_opening_ceremony_of_the_FIFA_World_Cup_2014_13_%28cropped%29.jpg/170px-The_opening_ceremony_of_the_FIFA_World_Cup_2014_13_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/28px-Video-x-generic.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/57/LA_Skyline_Mountains2.jpg/32px-LA_Skyline_Mountains2.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/TIFF_2019_jlo_%281_of_1%29-2_%2848696671561%29_%28cropped%29.jpg/220px-TIFF_2019_jlo_%281_of_1%29-2_%2848696671561%29_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Flag_of_the_Hispanicity.svg/32px-Flag_of_the_Hispanicity.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Jennifer_Lopez_with_Flag.jpg/170px-Jennifer_Lopez_with_Flag.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/b/b4/TIFF_2019_jlo_%281_of_1%29-2_%2848696671561%29_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/73/BathingSuit1920s.jpg/32px-BathingSuit1920s.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Jennifer_Lopez_%288414251754%29_%28cropped%29.jpg/170px-Jennifer_Lopez_%288414251754%29_%28cropped%29.jpg", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Jennifer_Lopez_2008.jpg/170px-Jennifer_Lopez_2008.jpg", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Flag_of_Puerto_Rico.svg/32px-Flag_of_Puerto_Rico.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Jennifer_Lopez_12%2C_2012.jpg/170px-Jennifer_Lopez_12%2C_2012.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Jennifer_Lopez_Live_during_Its_my_party_tour.jpg/200px-Jennifer_Lopez_Live_during_Its_my_party_tour.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Flag_of_New_York_City.svg/32px-Flag_of_New_York_City.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/P071014AL-0257_%2815156063116%29.jpg/220px-P071014AL-0257_%2815156063116%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Time_100_Jennifer_Lopez_and_Marc_Anthony.jpg/220px-Time_100_Jennifer_Lopez_and_Marc_Anthony.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/JenniferLopez.jpg/170px-JenniferLopez.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/07/Jennifer_Lopez_at_GLAAD_Media_Awards_%28cropped%29.jpg/170px-Jennifer_Lopez_at_GLAAD_Media_Awards_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/b/b4/TIFF_2019_jlo_%281_of_1%29-2_%2848696671561%29_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jennifer_Lopez", "title": "Jennifer Lopez", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.27", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/b/b4/TIFF_2019_jlo_%281_of_1%29-2_%2848696671561%29_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}