{"url": "https://web.archive.org/web/20090617192953/http://www.gop.gov/wtas/09/06/10/congressman-pence-discusses-house-republican", "text": "Transcript below:\n\n\n\nMIKA BRZEZINSKI: With us now Republican Representative from Indiana and Chairman of the House Republican Conference, Congressman Mike Pence. He's also Chairman of the American Energy Solutions Group which will introduce the House GOP's answer to the nation's energy problem in a bill later today. Morning Joe has an exclusive look at the details.\n\n\n\nJOE SCARBOROUGH: I want to ask him a question.\n\n\n\nBRZEZINSKI: Okay, fine.\n\n\n\nSCARBOROUGH: I laughed this morning when I heard the President talking about fiscal responsibility. I support PAYGO and I'm sure you support PAYGO but as Dylan Ratigan said, \"the cow is already out of the barn.\"\n\n\n\nREP. MIKE PENCE: Well, that's right, Joe. I really do believe there is a little bit of symmetry here between the issue of PAYGO and the energy legislation that Republicans are going to be introducing today. What the Democrats have and are planning to bring to the floor this month is essentially a national energy tax. This so-called \"cap and trade bill\" is a means of paying for all of the runaway federal spending that we've seen under the last Administration and redoubled and increased.\n\n\n\nSCARBOROUGH: Can you explain that because we hear about cap in trade. Break it down for us as simply as you can. What does that mean for americans and their energy problem?\n\n\n\nREP. PENCE: What it means all in the name of climate change this new regime of limiting carbon emissions from all different sources of energy production in this country but i don't think you need to look any further than the President himself, Joe, who literally said his cap and trade proposals were to pass, that utility rates, his words now, would, \"necessarily skyrocket\". John Dingle of Michigan and the Commerce Committee said people don't realize this is a tax and a, \"great big one.\" Republicans today are going to unveil a plan that takes us in the direction of energy independence.\n\n\n\nSCARBOROUGH: Trying to break this down. So where people would mainly feel it is in their power bills every week?\n\n\n\nREP. PENCE: Places like Indiana where I'm from would see a potential doubling of their utility rates but also, remember; the cost of energy goes into virtually every product we consume. This national energy tax according to some estimates could mean additional energy costs across the board of some $3,000 or more per year per household. We have a better way. We have a better solution. We're going to unveil it this morning. I'm glad to do so exclusively here on Morning Joe. The Republicans' all-of-the-above strategy, we're going to say yes to giving the American people more access to American oil, more domestic exploration for natural gas and coal, yes to renewables like wind and solar and we're going to say a deafening yes to nuclear energy. We're going to commit this country or call on this country to build 100 new nuclear power plants in the next 20 years.\n\n\n\nSCARBOROUGH: Your alternative energy source, obviously we're not there yet. The federal government may need to step in and get involved in helping the private sector.\n\n\n\nREP. PENCE: It really does, Joe. We want to capture some of the revenues from offshore drilling and put it into a renewable trust fund that will be available in the development of alternative and renewable sources of energy. We just don't need to pass legislation like cap in trade that will amount to a national energy tax, harm our economy at a time, quite frankly, when every American small business is struggling to make ends meet. There's a better way. Republicans will outline that today and I have a feeling - I just have a gut feeling there's a lot of concern even among many Democrats on capitol hill about the national energy tax looking for a better solution and I believe the American Energy Act we introduce today will be part of that.\n\n\n\nSCARBOROUGH: I think you're exactly right. A lot of Democrats are concerned. a lot of Republicans I know are concerned about the way we use energy in this country. I mean, do you agree with me and a lot of conservatives that there's nothing conservative about a country that has 4% of the world's population spending 25% of the world's energy?\n\n\n\nREP. PENCE: Percentages I don't get as concerned about as the notion that appears. Joe, you served on the house floor with great distinction. Remember the quote up on the wall by Daniel Webster that speaks about the resources of this country, the natural resources of this country, the genius of this country. He said let us call forth this nation's power. Part of that power is innovation. Part of that power is finding alternative sources of energy like wind, energy and solar. Oil and coal, natural gas and clean coal technologies. We just don't need to pass the Democrat cap in trade plan, to answer with innovation and alternatives. That's the Republican solution.\n\n\n\nSCARBOROUGH: Teddy Roosevelt, of course, also talked a lot about conservation.\n\n\n\nREP. PENCE: That's right.\n\n\n\nSCARBOROUGH: That's something we can do right now.\n\n\n\nREP. PENCE: That's right.\n\n\n\nSCARBOROUGH: Is that part of your package, too?\n\n\n\nREP. PENCE: That's exactly right. You're one of my favorite Teddy Roosevelt Republicans, Joe, and we're going to make a real commitment to conservation in this legislation but, remember, the national energy tax is all about paying for all this spending. People should see it as no other way. They want to pass a national energy tax so you pay and they go on spending. That's the real PAYGO. Republicans have a better solution and we're looking forward to showing it to the American people.\n\n\n\nSCARBOROUGH: Thank you for coming here and talking to us about it first, Congressman Pence. Thank you so much.", "images": ["https://web.archive.org/web/20090617192953im_/http://www.gop.gov/resources/images/global/share-stumbleupon.gif", "https://web.archive.org/web/20090617192953im_/http://www.gop.gov/resources/images/global/icon-email.gif", "https://web.archive.org/web/20090617192953im_/http://www.gop.gov/resources/images/navigation/01_on.jpg", "https://web.archive.org/web/20090617192953im_/http://www.gop.gov/resources/images/global/icon-play.gif", "https://web.archive.org/web/20090617192953im_/http://www.gop.gov/resources/images/global/share-digg.gif", "https://web.archive.org/web/20090617192953im_/http://www.gop.gov/resources/images/global/icon-permalink.gif", "https://web.archive.org/web/20090617192953im_/http://www.gop.gov/resources/images/global/spacer.gif", "https://web.archive.org/web/20090617192953im_/http://www.gop.gov/resources/images/global/share-twitter.jpg", "https://web.archive.org/web/20090617192953im_/http://www.gop.gov/resources/images/global/favicon.jpg", "https://web.archive.org/web/20090617192953im_/http://www.gop.gov/resources/images/global/share-linkedin.gif", "https://web.archive.org/web/20090617192953im_/http://www.gop.gov/resources/images/navigation/03_on.jpg", "https://web.archive.org/web/20090617192953im_/http://www.gop.gov/resources/images/global/share-delicious.gif", "https://web.archive.org/web/20090617192953im_/http://www.gop.gov/resources/images/navigation/07_on.jpg", "https://web.archive.org/web/20090617192953im_/http://www.gop.gov/resources/images/navigation/06_on.jpg", "https://web.archive.org/web/20090617192953im_/http://www.gop.gov/resources/images/global/share-facebook.gif", "https://web.archive.org/web/20090617192953im_/http://www.gop.gov/resources/images/global/share_view.gif", "https://web.archive.org/web/20090617192953im_/http://www.gop.gov/resources/images/global/icon-print.gif", "https://web.archive.org/web/20090617192953im_/http://www.gop.gov/resources/images/navigation/02_on.jpg", "https://web.archive.org/web/20090617192953im_/http://www.gop.gov/email/pictures/pence-6-10-09.jpg", "https://web.archive.org/web/20090617192953im_/http://www.gop.gov/resources/images/navigation/04_on.jpg", "https://web.archive.org/web/20090617192953im_/http://www.gop.gov/resources/images/documents/mast-wtas.jpg", "https://web.archive.org/web/20090617192953im_/http://www.gop.gov/resources/images/navigation/05_on.jpg"], "top_img": "https://web.archive.org/web/20090617192953im_/http://www.gop.gov/resources/images/global/favicon.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "Congressman Pence Discusses House Republican Energy Bill on MSNBC's Morning Joe", "meta_data": {"description": "The Website for Republicans in Congress, GOP.gov provides the latest legislative and policy news from the House Republican Conference.", "keywords": "house republican conference,gop,republicans,congress,house of representatives,the website of republicans in congress", "language": "en"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}