{"url": "https://www.elitedaily.com/p/heres-how-logan-pauls-life-has-changed-since-that-controversial-suicide-forest-video-8787879", "text": "YouTuber Logan Paul has been the center of much controversy since a December 2017 vlog that put him on everyone's radar. You'll recall Paul rang in 2018 on the receiving end of the backlash against that December Japan vlog, which showed him filming an apparent suicide victim in Japan's Aokigahara forest (aka the \"suicide forest\"). This was probably many people's first introduction to the YouTube star, but Paul's YouTube channel boasts millions of followers — and the internet star has continued to stay active on the web. Here's how Logan Paul's life has changed since the controversial suicide video.\n\nImmediately following the public outcry over what was collectively deemed very insensitive treatment of an apparent suicide victim, YouTube punished Paul. Before the ramifications hit Paul, he apologized in a series of tweets, and he announced a hiatus from vlogging on Jan. 3, 2018. On Jan. 10, YouTube removed Paul's YouTube channels from Google Preferred (a top-tier preferred ad program), put his YouTube Red movie The Thinning: New World Order on hold, and confirmed they would not feature Paul in the fourth season of Foursome.\n\nPaul returned to YouTube on Jan. 24 with a video raising awareness about suicide and shedding light on suicide prevention. He spoke with experts on the subject and delivered an informative video, and Paul even said he'd donate $1 million to organizations that help prevent suicide, according to The Verge.\n\nThis thoughtful and informative video is a stark contrast to his other vlogs that are loud, peppered with Paul hawking his merchandise, and filled with whiplash-inducing cuts from scene to scene.\n\nIt appears the Suicide: Be Here Tomorrow video was a one-off instance, because Paul resumed filming the raucous and oftentimes irreverent vlogs he's known for shortly thereafter. In a Feb. 5 vlog, Paul shows one of his koi fish that is apparently sick, and before calling a professional for help, Paul pulls the still-breathing fish out of the water and puts it on the concrete as he gives it \"CPR-style\" pumps. It's quite a jarring scene, and then Paul follows that with Tasering a dead rat. It appears Paul hasn't publicly commented on this video. However, Elite Daily reached out to Paul's team for comment on the footage of him Tasering the rat, but didn't hear back by the time of publication.\n\nEven though nothing he's posted since the suicide forest video has been initially as controversial as the Japan vlog, Paul has continued to push the boundaries of what is \"acceptable\" YouTube content. On Feb. 12, Google's video platform pulled advertising from his channel in response to a \"recent pattern of behavior,\" according to Tech Crunch (the ads were restored on Paul's YouTube channel on Feb. 27, per Variety).\n\nPaul sometimes shows a more sincere side, like when he paid tribute to a fan who lost his battle to cancer, but he quickly shifts the vlog to doing things like purposefully breaking dishes he wants his assistant to clean up. While there doesn't seem to be any indication of a return to thoughtful videos like the suicide prevention video, Paul has continued to document his life.\n\nOne of his most recent vlogs shows a trip to Yosemite National Park earlier this month, and Paul and his friends chose to set up a mobile campsite on the top of their bus when all the other campsites were booked. Unsurprisingly, that's not really an option for campers at Yosemite, so the park rangers cited Paul for not being in a regulated campsite, per ABC News. According to the SF Gate, Paul said the ranger \"didn't cite him,\" and a park spokesperson said that the park's first interaction with Paul was a warning. Even so, after Paul's fans heard he needed a place to camp, they offered up their own sites. That quickly led to Paul and his crew filming vlog material, and the park rangers were soon called for noise complaints and kicked Paul out of the campsite. It appears Paul has not yet released a statement about getting kicked out of the campsite. However, Elite Daily reached out for comment on Paul being kicked out, but didn't hear back by the time of publication.\n\nBeing a little too loud was the least of Paul's Yosemite offenses. His April 5 vlog called Our Last Day In Yosemite Was A Disaster features the aftermath of what appears to be a car wreck in which neither Paul nor his friends were involved. Paul films a shaken up family as he asks if they need help, but he quickly focuses on showing off the seemingly extensive damage of the vehicles once he realizes there is nothing he can do to assist them.\n\nPaul focused filming on a family that was presumably in the crash in what was apparently the immediate aftermath of the incident, and it appeared they had young children with them, so many viewers weren't pleased that Paul left that footage of the vulnerable family in the vlog. However, there is no confirmation that the family he filmed was the family in the crash.\n\nPaul's life and the focus of his vlogs don't seem to have changed much since the Japan vlog in the \"suicide forest\" (save for the brief moment of contrite sincerity following the backlash in January). He's even added new activities to his resume, like live streaming his participation in Fortnite Battle Royale on Twitch (a video game streaming platform), according to Forbes.\n\nAnother aspect of Paul's life that has gone unchanged is his following. At the time of posting, Paul's YouTube channel still has 17 million subscribers, so it seems as though the \"Logang\" (his fan club) isn't going anywhere — no matter what he films.", "images": ["https://imgix.bustle.com/uploads/getty/2018/4/16/4ec7d63f-cc0e-413e-9d00-cf28c1cb138e-getty-633872676.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/shutterstock/2020/4/8/03b6f074-c02d-4265-95da-504c42ae6c02-shutterstock-1695129112.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2018/4/16/4ec7d63f-cc0e-413e-9d00-cf28c1cb138e-getty-633872676.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2020/4/10/4ae8ab67-a2e3-4a27-bd46-5b397d9b998a-mv5bnzu1zjc4y2mtmgfios00zwmxlwfhymqtntk4ogm0mdrlnwq0xkeyxkfqcgdeqxvyodkzntgxmdg_v1_sy1000_cr0013061000_al_.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2020/4/10/f33f50b3-05a0-4572-8753-146b561ab4ce-screen-shot-2020-04-10-at-32544-pm.png?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/4/16/4ec7d63f-cc0e-413e-9d00-cf28c1cb138e-getty-633872676.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/heres-how-logan-pauls-life-has-changed-since-that-controversial-suicide-forest-video-8787879", "title": "Here's How Logan Paul’s Life Has Changed Since That Controversial Suicide Forest Video", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/heres-how-logan-pauls-life-has-changed-since-that-controversial-suicide-forest-video-8787879", "type": "article", "title": "Here's How Logan Paul’s Life Has Changed Since That Controversial Suicide Forest Video", "description": "YouTuber Logan Paul has been the center of much controversy since a December 2017 vlog that put him on everyone's radar. You'll recall Paul rang in 2018 on the receiving end of the backlash against that December Japan vlog, which showed him filming…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/4/16/4ec7d63f-cc0e-413e-9d00-cf28c1cb138e-getty-633872676.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "YouTuber Logan Paul has been the center of much controversy since a December 2017 vlog that put him on everyone's radar. You'll recall Paul rang in 2018 on the receiving end of the backlash against that December Japan vlog, which showed him filming…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}