{"url": "https://www.denofgeek.com/us/movies/star-wars/269704/star-wars-the-last-jedi-easter-eggs", "text": "– While Peter Mayhew reprised his role as Chewbacca, Finnish actor Joonas Suotamo took over for many of the scenes as Chewbacca’s double.\n\n– R2-D2 appears briefly in the movie to say a few bad words to Luke on the Falcon. This is the first Star Wars movie in which original Artoo actor Kenny Baker isn’t involved with the role at all. (While Lucas mostly used radio-controlled props and CGI to bring Artoo to life in the Prequels, Baker was credited in the Prequels.) Jimmy Vee played Artoo in The Last Jedi.\n\n– In his brief appearance, Artoo guilt trips Luke with Leia’s original hologram message to Obi-Wan Kenobi from A New Hope. The Last Jedi really goes all out in celebrating Carrie Fisher’s legacy!\n\nKylo Ren, Snoke, & The First Order\n\n– Kylo Ren’s journey continues to inch closer to that of his Legends counterpart, Jacen Solo. While Kylo fell to the dark side as an apprentice, Jacen – the son of Han and Leia in old EU – was already a full-fledged Jedi Knight when he became a Sith. Like Kylo, Jacen also consolidated power and took over the galaxy as its new ruler.\n\n– As revealed in the flashback, Ben Solo’s lightsaber was blue before he turned to the dark side.\n\n– Unless I missed it, the Knights of Ren are nowhere to be found in this movie. Rian Johnson does away with a few things introduced in The Force Awakens, but this one is one of the more glaring things missing from the movie. I personally would have loved to learn more about them.\n\n– Like his grandfather before him, Kylo Ren pilots a special TIE fighter during the Resistance evacuation. It’s called the TIE/vn space superiority fighter – or simply the TIE silencer.\n\n– An important detail about the First Order is revealed in the opening crawl of The Last Jedi. “The First Order reigns!” reads the first line of the crawl, which introduces the story to viewers. It was unclear by the end of The Force Awakens what faction ruled the galaxy, but this crawl confirms that the First Order is indeed the ruling body. A few scenes later, General Hux confirms that the New Republic is indeed dead after the destruction of the Hosnian System.\n\nFurther Reading: What The Last Jedi Novel Adds to the Movie\n\n– The dreadnought that arrives to stop the Resistance from evacuating D’Qar is a Mandator IV-class warship called Fulminatrix armed with 26 cannons and two orbital guns. It is two-and-a-half times the size of a regular First Order Star Destroyer.\n\n– Supreme Leader Snoke’s Mega-class Star Destroyer is called Supremacy. It’s the only ship of its class in the First Order fleet and served as its flagship. Snoke issued commands from this ship in The Force Awakens while hiding out in the Unknown Regions.\n\n– Snoke’s throne room is reminiscent of Emperor Palpatine’s, although there’s a stark difference in color scheme. While the Sith Lord preferred black and gray as his colors of choice for outfits and decor, Snoke likes brighter shades. A deep red covers the walls of the throne room and the villain prefers a set of yellow robes over black ones.\n\n– Snoke shows off quite a few of his Force powers in this movie. At one point, he Force chokes General Hux from a completely different spot in the galaxy. That’s a callback to Darth Vader’s signature move when displeased with his own Imperial lackeys in The Empire Strikes Back. Hux fares better than Admiral Ozzel and Captain Needa. Both villains are able to strangle someone from miles away. In the case of Snoke, the distance seems to be light years.\n\n– Snoke also uses Force lightning, a power first showcased by Emperor Palpatine.\n\n– In several of Snoke’s scenes, Emperor Palpatine’s theme can be heard mixed into the score.\n\n– In fact, the entire torture of Rey in Snoke’s throne room is very reminiscent of Luke’s own confrontation with the Emperor in Return of the Jedi. But while Palpatine means to turn Luke to the dark side, Snoke simply wants to find Luke Skywalker and then kill Rey.\n\nFurther Reading: Why Luke Skywalker’s Legacy Still Matters\n\n– We don’t learn anything about Snoke’s past in this movie, but we do get to enjoy him make the same mistakes as his evil predecessor. Overconfidence in their apprentices are what get both Palpatine and Snoke killed in the end. Kylo, like his grandfather before him, betrays and kills Snoke.\n\n– Snoke’s Praetorian Guards are a callback to the Emperor’s Royal Guard from Return of the Jedi. We actually get to see these red badasses in action this time around, though.\n\n– The eagle-eyed viewer might notice that Snoke is wearing a very unique ring. The stone in that ring is obsidian mined from the volcanic rock underneath Darth Vader’s castle on Mustafar, which was first introduced in Rogue One. The gold in the ring is also engraved with the Four Sages of Dwartii – a group of controversial philosophers from the early days of the Galactic Republic. Chancellor (and later Emperor) Palpatine had statues of the Four Sages in his office. Shout out to Screenrant for spotting this easter egg first!\n\n– Captain Phasma returns to face off against Finn. You might be wondering how Phasma managed to escape the trash compactor on Starkiller Base before the superweapon was destroyed by the Resistance. She actually escaped quite simply! You can read all about her post-The Force Awakens adventures here.\n\n– One of the big topics of discussion surrounding The Last Jedi is the First Order’s ability to track the Resistance through hyperspace. This was previously thought impossible. In fact, the heroes have often used hyperspace to make a quick escape at the last second – e.g. the Falcon escaping Bespin by reactivating the hyperdrive in The Empire Strikes Back.\n\nFurther Reading: The Empire Strikes Back You Never Saw\n\nWell, Star Wars actually planted the seed for the new hyperspace tracker all the way back in Rogue One (really a year ago, but in Star Wars time… Well, it’s been more than 30 years). When Jyn Erso is going through the Imperial research files on Scarif, she quickly glimpses at a file for “hyperspace tracking.” Indeed, the Empire had been working on this technology way before the First Order perfected it, as confirmed by Lucasfilm Story Group member Pablo Hidalgo.\n\nShout out to EW for spotting this!\n\n– The astromech droid who first catches on to Finn and Rose’s deception on the Supremacy is named BB-9E. He was first revealed during the release of The Last Jedi toy line. The droids nickname on set was “BB-H8.” I don’t have to explain why that’s funny, right?\n\n– Continuing the trend of bringing on Game of Thrones actors for cameos in the Sequel Trilogy, Kate Dickie (Lysa Arryn) appears briefly as a communications officer.\n\nLeia & The Resistance\n\n– This is Carrie Fisher’s final appearance in a Star Wars movie. She died suddenly in late 2016, just a few months after filming had wrapped on The Last Jedi.\n\n– Leia’s flagship cruiser is called Raddus. The name is a callback to the Mon Calamari admiral who helped Jyn Erso and her group of Rebels steals the Death Star plans during the Battle of Scarif in Rogue One.\n\n– There’s a lot of precedence for Leia’s surprising Force powers in this movie. While we’ve always known she is Force-sensitive and call feel things through the Force, we’d never seen her use her powers to levitate – or survive in space for that matter. That said, there have been several instances in the old EU (the Legends timeline) where Leia has directly used the Force. She even joined Luke’s New Jedi Order around the time of the Dark Nest Crisis (from the Dark Nest Trilogy by Troy Denning). Leia was trained by Luke himself and Jedi Master Saba Sebatyne.\n\nOh, and there’s Dark Horse’s Star Wars Infinities series (sort of like DC Elseworlds) where Luke dies on Hoth and it’s up to Leia to face down Vader and the Emperor herself. You can read more about that here.\n\nFurther Reading: How The Last Jedi Asks More of Its Redemption Arc\n\n– I’ve tried looking up other instances where other Jedi (or Sith) have survived the cold, vacuum of space using the Force but have come up with nothing. Let me know what you find! I’m sure there’s something in the old EU somewhere…\n\n– Kelly Marie Tran plays Rose Tico. She is the first Asian-American to star in a Star Wars film.\n\n– Rose’s ring becomes a significant clue about the galaxy’s future when the final scene of the movie reveals a Force-sensitive boy admiring it on Canto Bight. According to The Last Jedi Visual Dictionary (via Screenrant), that ring was first worn in the halls of the Imperial Senate and the hidden insignia was only revealed among members of the Rebel cause.\n\n– The Resistance gunner who sacrifices her life to destroy the First Order dreadnought is named Paige Tico, and she is Rose’s sister. Paige is played by Vietnamese actress Veronica Ngo.\n\n– Finn wakes up in a “bacta suit” (is there an official name for this?), which is a reference to the bacta tank Luke wakes up in after being attacked by the wampa on Hoth in The Empire Strikes Back.\n\n– Gial Ackbar, the Mon Calamari admiral who first appeared in Return of the Jedi (IT’S A TRAP!), finally meets his end during the escape from D’Qar when TIE fighters blow up the Raddus‘ bridge. In the Legends timeline, he died peacefully of old age.\n\n– Vice Admiral Amilyn Holdo, played by the wonderful Laura Dern, is one of Leia’s oldest friends. They first met at the Apprentice Legislature of the Imperial Senate. You can read more about how they met here.\n\nFurther Reading: Exploring The Last Jedi’s Chase Structure\n\n– You might be wondering about Holdo’s hair. It’s revealed in Leia, Princess of Alderaan, the young adult novel by Claudia Gray, that she hails from the planet Gatalenta, a peaceful worlds where people meditate and wear very plain clothing. Holdo’s flamboyant style is a rebellion against those traditions.\n\n– The base the Resistance retreats to on Crait is an old Rebel base that Leia and Holdo first encountered when they were teenagers. Bail Organa, Leia’s adoptive father, had kept the base and his involvement in a Rebellion a secret from Leia. You can read more about all this here.\n\n– The standoff on Crait is reminiscent of the Battle of Hoth. Both involve walkers, an overwhelmed rebellion trying to escape, and a target that must be destroyed in order for the bad guys to destroy the good guys for good.\n\n– Several Resistance fighters refer to themselves as “rebels” throughout the movie. This is a reference to the Rebellion, of course.\n\n– The A-wing makes a return in The Last Jedi. This is an updated version called the RZ-2. The RZ-1 A-wing interceptor first appeared during the Battle of Endor in Return of the Jedi. Fun fact: Shara Bey, Poe Dameron’s mom, flew an A-wing during the Battle of Endor!\n\n– Speaking of Shara Bey, there’s a direct reference to her in the movie. Poe wears a ring on a necklace during his latest adventure. He’s actually carrying around his mother’s wedding ring!\n\n– The bombers used by the Resistance to destroy the First Order dreadnought are B/SF-17 heavy bombers. (Another name for these bombers is the MG-100 StarFortress SF-17.) This is their first appearance.\n\nFurther Reading: Exploring the Church of Star Wars\n\n– C-3PO has a slightly bigger role in this movie – mostly to annoy Leia and Poe – and he’s got his golden arm back! He appeared with a rusty red arm in The Force Awakens.\n\n– The tune you hear as the Millennium Falcon zooms through the Crait mines during the TIE fighter chase scene is definitely a callback to the “Tie Fighter Attack” theme from A New Hope. In fact, the way the scene is choreographed, the Falcon zig zagging past obstacles like that, it’s almost meant to look like the Falcon’s run through the Death Star II in Return of the Jedi.\n\n– Maz Kanata makes a very brief appearance in The Last Jedi in a hologram. We get to see her in action for the first time in this short scene, shooting at her enemies with a blaster. It’s peculiar that she chooses to use a blaster considering that she can use the Force (as revealed in The Force Awakens’ deleted scenes). I hope we can see more of her in Episode IX.\n\n– Although I thought Temmin “Snap” Wexley died in a fiery X-wing crash during the opening battle, the diligent commenters have corrected me: that’s a dude named Tubbs, played by Jamie Christopher. That’s almost certainly a reference to Porkins from A New Hope.\n\n– Billie Lourd, Carrie Fisher’s daughter, returns once again as Lieutenant Kaydel Ko Connix. She gets a bit more to do this time around, such as help Poe Dameron commit mutiny and take over the Raddus.\n\n– Nien Nunb, the Sullustan who piloted the Millennium Falcon with Lando Calrissian during the Battle of Endor, makes a brief appearance as part of Poe Dameron’s X-wing squadron. He also appeared in The Force Awakens.\n\n– In one of the more overt cameos in the movie, Rogue One director Gareth Edwards appears during the Battle of Crait. He can be seen next to the Resistance fighter who tastes the salt on the ground.\n\nPlanets, Other Cameos, & Miscellaneous\n\n– This isn’t the first Star Wars story to bear the name “The Last Jedi.” In the Legends timeline, there’s a novel called The Last Jedi by Michael Reaves and Maya Kaathryn. It’s a continuation of the Coruscant Nights trilogy, which stars a Jedi Knight named Jax Pavan in the days after Order 66.\n\n– Even though you never actually hear the famous Star Wars line, “I’ve got a bad feeling about this,” it is in the movie, according to director Rian Johnson. He revealed to Huffington Post that it’s actually BB-8 who says it to Poe during their crazy attack on the Dreadnought.\n\n“It seemed like a fun character to deliver that line,” Johnson told HuffPo. “I think originally I had Poe respond, ‘Oh, I got a good feeling about it. Keep your chin up.’ And then I made it a little less explicit just to make it more fun.”\n\n– The little ornament Luke finds on the Falcon and later gifts to Leia is Han’s lucky dice. The smuggler believes they bring him good luck, so he hangs the ornament in the ship’s cockpit. He even used the dice to beat Lando Calrissian in a game of “Corellian Spike,” an offshoot of the card game sabacc, and win the Millennium Falcon!\n\nIn reality, Han’s dice only appear ONCE in the entire Original Trilogy. Inexplicably, they disappear after one shot in the movie. They finally return in The Force Awakensand are given a bit more attention in The Last Jedi.\n\nFurther Reading: The Identity of Rey’s Parents Could Change in Episode IX\n\n– From what I can tell, the charred Darth Vader helmet doesn’t make an appearance in this movie. It seems kind of odd that we never see Kylo Ren talking to it considering it was such a big part of his faith in the dark side in The Force Awakens. Perhaps that’s part of his whole “Kill the past” slogan in The Last Jedi. As far as I can tell, the last we saw of the helmet, it was on the Finalizer and not Starkiller Base, so it wouldn’t have blown up, right?\n\n– There is a lot to learn about Canto Bight in the recently released novel collection. It’s a corrupt place where the rich control the police department. You can read way more fun facts about the planet here.\n\n– The Force-sensitive boy who works in the fathier stables in Canto Bight is named Temiri Blagg, played by Temirlan Blaev. You can read way more about him here.\n\n– Temiri’s friends are named Arashell Sar (Sarah Heller) and Oniho Zaya (Josiah Oniha).\n\n– Canto Bight is located on the desert planet called Cantonica. Yes, it’s a desert planet! How does Canto Bight have that body of water surrounding it and that huge waterfall? That’s an artificial body of water constructed to make Canto Bight look even more lavish.\n\n– Warwick Davis, who played Wicket the Ewok in Return of the Jedi, has a brief cameo as an alien in Canto Bight named Wodibin. Davis has cameod in quite a few other Star Wars projects, too.\n\n– The “space horses” located on Canto Bight are called fathiers. They were actually first mentioned in the novel Aftermath: Empire’s End by Chuck Wendig, misspelled as “faithiers.”\n\nFurther Reading: The Best Ships in The Last Jedi\n\n– The Master Codebreaker Maz Kanata recommends for Finn and Rose’s secret mission to deactivate the First Order’s hyperspace tracker is played by Justin Theroux in a cameo role. He seems to be really good as “space craps.” Hit me up if you know what game the Master Codebreaker is actually playing on Canto Bight.\n\n– Frequent Rian Johnson collaborator Joseph Gordon-Levitt has a brief cameo. He voices a character named Slowen Lo. According to Steve Wheeler in the comments, “The character Slowen Lo voiced by Joseph Gordon-Levitt is a reference to the Beastie Boys song ‘Slow and Low.’ There was a character called Ello Asty in The Force Awakens in reference to the Beastie Boys album Hello Nasty and J.J. Abrams used ‘Sabotage’ in Star Trek (2009) and it was later repeated in Star Trek Beyond (2016).” Thanks for the Beastie Boys knowledge, Steve!\n\n– The space yacht DJ and BB-8 steal in order to escape Canto Bight is called the Libertine.\n\n– When DJ is going through the different ships the Canto Bight arms dealer sold to the First Order, we see holograms of the TIE bomber and TIE Interceptor.\n\n– The extreme close-up of the iron landing on the First Order officer uniform is a reference to the short film Hardware Wars, which itself is a parody of A New Hope.\n\n– The “crystal foxes” on Crait are actually called vulptices. (The singular is “vulptex.”) You can read more about the vulptex here.\n\n– Apparently, filmmakers Edgar Wright and Joe Cornish also have cameo roles in the movie, but I’ve not spotted them. Let me know if you do!\n\n– There were rumors that Tom Hardy (Mad Max: Fury Road) would also have a cameo, but that’s not been confirmed. He apparently played a stormtrooper.\n\n– Prince Harry and Prince William of the British royal family reportedly filmed cameos. No sight of them just yet, though.\n\n– British singer Ellie Goulding revealed on Twitter that she filmed a cameo in The Last Jedi. I’ve not spotted her, though.", "images": ["https://www.denofgeek.com/wp-content/uploads/2017/12/star-wars-the-last-jedi.jpg?fit=1000%2C500", "https://www.denofgeek.com/wp-content/uploads/2017/12/star-wars-the-last-jedi.jpg?resize=768%2C432", "https://www.denofgeek.com/wp-content/uploads/2020/02/11952784_10153679224247859_4721332076776667920_o.jpg?resize=80%2C80&filter=grayscale"], "top_img": "https://www.denofgeek.com/wp-content/uploads/2017/12/star-wars-the-last-jedi.jpg?fit=1000%2C500", "keywords": [], "authors": ["John Saavedra", "Don Kaye", "Michael Ahr", "Rosie Fletcher", "David Crow", "Rob Leane", "Alec Bojalad"], "canonical_link": "https://www.denofgeek.com/movies/star-wars-the-last-jedi-easter-eggs/", "title": "Star Wars: The Last Jedi Easter Eggs and Reference Guide", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#d23226", "description": "A complete list of easter eggs, references, and callbacks we found in Star Wars: The Last Jedi!", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Star Wars: The Last Jedi Easter Eggs and Reference Guide | Den of Geek", "description": "A complete list of easter eggs, references, and callbacks we found in Star Wars: The Last Jedi!", "url": "https://www.denofgeek.com/movies/star-wars-the-last-jedi-easter-eggs/", "site_name": "Den of Geek", "image": {"identifier": "https://www.denofgeek.com/wp-content/uploads/2017/12/star-wars-the-last-jedi.jpg?fit=1000%2C500", "secure_url": "https://www.denofgeek.com/wp-content/uploads/2017/12/star-wars-the-last-jedi.jpg?fit=1000%2C500", "width": 1000, "height": 500}}, "article": {"tag": "Star Wars: The Last Jedi", "section": "Movies", "published_time": "2018-12-14T23:00:00+00:00"}, "twitter": {"card": "summary_large_image", "description": "A complete list of easter eggs, references, and callbacks we found in Star Wars: The Last Jedi!", "title": "Star Wars: The Last Jedi Easter Eggs and Reference Guide | Den of Geek", "image": "https://www.denofgeek.com/wp-content/uploads/2017/12/star-wars-the-last-jedi.jpg?fit=1000%2C500"}, "msapplication-TileImage": "https://www.denofgeek.com/wp-content/uploads/2020/02/favicon.geek_.purple.swirl_-1.png?fit=270%2C270"}, "movies": [], "publish_date": 1544828400.0, "source": "https://www.denofgeek.com", "summary": ""}