{"url": "https://broadly.vice.com/en_us/article/bjmw4v/spencer-pratt-reflects-on-his-iconic-feud-with-lauren-conrad-10-years-later", "text": "This Week in 2007 is a weekly column looking back on Lindsay Lohan, the first iPhone, George W. Bush, and everything else we loved about the year 2007.\n\nToday, it's easy to forget how much America detested Spencer and Heidi, a.k.a. Speidi. Heidi is a soon-to-be mom who posts videos of her dogs, and Spencer is best known as a reality TV scholar who dishes to the New York Times about pop culture in the era of President Donald Trump. But Speidi earned their reality TV status ten years ago this week when they launched a public feud against their Hills co-star Laura Conrad.\n\nTheir fight was anything but scholarly. Heidi and Lauren were once the Laverne and Shirley of MTV. They roomed together in West Hollywood, and fans expected the series to end with them serving as each other's bridesmaids. That is until Heidi started dating Spencer in season two. Lauren advised her to ditch him, but she refused. On the season finale, Heidi moved in with Spencer. Her friendship with Lauren was done.\n\nOn August 5, 2007, roughly a week before the season three premiere, Perez Hilton reported rumors that Lauren had filmed a sex tape with her ex, Laguna Beach cast member Jason Wahler. Lauren denied the claims to US Weekly, according to Gawker, saying, \"Honestly, they videotape my life five days out of the week. I don't need additional footage, you know?\"\n\nLauren pointed the finger at her ex-roommate and her villainous boyfriend. As Tyra Banks later explained on her talk show while holding paper dolls of Spencer and Heidi: \"Spencer and Heidi have started a rumor about [Lauren]. It's a rumor about something really bad. Spencer and Heidi say that [Lauren has] a sex tape out there.\" The accusation carried such dramatic intensity because fans had watched Lauren and Heidi's friendship strengthen over the course of the preceding seasons.\n\n\"[Lauren's] the douche, the psycho,\" Spencer responded on Philadelphia's Q102 FM during his press tour for season three. Heidi likewise denied Lauren's claims.\n\n\n\nRead more: The Undying Love of Spencer and Heidi Pratt\n\nOn August 6, he went even further, launching SpencerPratt.com and attacking his enemy on the new platform. \"For all you Haters- Please feel free to Hate on me here on my blog/board were I actually read comments! … But if you hate me because you think I ruined Lauren and Heidi friendship…you have your facts all wrong!\" he wrote in his inauguratory post. \"Lauren ruined Heidi and Laurens friendship when she told Heidi that she could not be friends with her as long as she dated me … when those cameras turn off LC(BEEF CURTAINS) is a completely different person…she goes back to being the spoiled brat that made her famous on Laguna Beach.\"\n\nAccording to US Weekly, MTV \"suspended\" Spencer and Heidi's press appearances in response to the pair's \"trash-talking.\" The news only boosted awareness of Speidi's war against Lauren. \"It's her party and she'll ban Spencer and Heidi if she wants to!\" TMZ blurbed on August 10. Lauren had allegedly booted Heidi and Spencer from MTV's premiere party, and US reported that MTV ordered Spencer and Heidi to walk the red carpet early and leave once Lauren arrived.\n\nLooking back, Spencer believes the reality was even worse than the news reports. \"Actually, [Lauren] told MTV if they didn't stop filming with me she would quit and they told her then quit,\" he tells Broadly in a direct message. (Lauren's representative did not immediately respond to Broadly's request for comment.)\n\nIn the third season premiere, fans watched a similar party scene. At a club called Les Deux, Heidi hands Lauren a letter lamenting their dilapidated friendship. It does not mention the rumors. \"She won't fucking admit it,\" Lauren complains. She refuses to see her.\n\n\"It's her problem,\" Heidi tells herself. But when Lauren flees the club, Heidi follows her.\n\n\"You're not my friend anymore,\" Lauren tells her. \"I always feel bad for you,\" Heidi cries. She wants to know why Lauren hates her. \"You know what you did!\" Lauren cries in a scene that has become as memorable as the \"Nancy Jo, this is Alexis Neiers calling\" video.\n\nIt was one of the few moments of real drama on a show that mostly consisted of plotless scenes and beautiful shots of Sunset Boulevard. Speidi come across as manipulative villains, while Lauren seems genuine. But during her promotional tour, Lauren went on Regis and Kelly to discuss the \"big split.\" The feud was the best thing to happen to The Hills: The episode premiered to a record-setting 3.6 million viewers. Speidi later admitted to \"producing\" drama behind the scenes to boost ratings. There's a reason Spencer and Heidi have become the media's go-to experts on reality TV.", "images": ["https://video-images.vice.com/articles/5988e0d7cf72de1af7fa63fa/lede/1502215759751-GettyImages-76204890.jpeg?crop=1xw:0.8455xh;0xw,0.0161xh&resize=1200:*", "https://vice-web-statics-cdn.vice.com/logos/vice-media-group-logo.svg"], "top_img": "https://video-images.vice.com/articles/5988e0d7cf72de1af7fa63fa/lede/1502215759751-GettyImages-76204890.jpeg?crop=1xw:0.8455xh;0xw,0.0161xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.vice.com/en_us/article/bjmw4v/spencer-pratt-reflects-on-his-iconic-feud-with-lauren-conrad-10-years-later", "title": "Spencer Pratt Reflects on His Iconic Feud with Lauren Conrad 10 Years Later", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "apple-itunes-app": "app-id=591496838", "keywords": "culture, news, lgbtq, politics, journalism, video, documentary, sex, drugs, film, tv, entertainment, travel, crime,Culture,Feminisme,POP CULTURE,Δράμα,Celebrity,The Hills,Heidi Montag,2007,Spencer Pratt,Lauren Conrad,Speidi,siesta key,Broadly Pop Culture,Broadly Culture", "description": "What began as a sex tape rumor snowballed into a reality TV war that dominated pop culture for the next two years.", "thumbnail": "https://video-images.vice.com/articles/5988e0d7cf72de1af7fa63fa/lede/1502215759751-GettyImages-76204890.jpeg", "theme-color": "#fff", "news_keywords": "Culture,Feminisme,POP CULTURE,Δράμα,Celebrity,The Hills,Heidi Montag,2007,Spencer Pratt,Lauren Conrad,Speidi,siesta key,Broadly Pop Culture,Broadly Culture", "article": {"author": "Mitchell Sunderland", "published_time": "2017-08-08T18:10:06Z"}, "og": {"type": "article", "site_name": "Vice", "title": "Spencer Pratt Reflects on His Iconic Feud with Lauren Conrad 10 Years Later", "image": {"identifier": "https://video-images.vice.com/articles/5988e0d7cf72de1af7fa63fa/lede/1502215759751-GettyImages-76204890.jpeg?crop=1xw:0.8455xh;0xw,0.0161xh&resize=1200:*", "alt": "Vice", "type": "image/jpeg"}, "locale": "en_us", "url": "https://www.vice.com/en_us/article/bjmw4v/spencer-pratt-reflects-on-his-iconic-feud-with-lauren-conrad-10-years-later", "description": "What began as a sex tape rumor snowballed into a reality TV war that dominated pop culture for the next two years."}, "datePublished": "2017-08-08T18:10:06Z", "fb": {"app_id": 213518685373476, "pages": 283321618725390}, "twitter": {"card": "summary_large_image", "site": "vice", "title": "Spencer Pratt Reflects on His Iconic Feud with Lauren Conrad 10 Years Later", "description": "What began as a sex tape rumor snowballed into a reality TV war that dominated pop culture for the next two years."}, "snapchat": {"publisher": 5700553057239040, "sticker": "https://vice-web-statics-cdn.vice.com/images/snap/snap-share-sticker.png"}, "mobile-web-app-capable": "yes", "application-name": "vice", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "apple-mobile-web-app-title": "vice", "msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "https://vice-web-statics-cdn.vice.com/favicons/vice/mstile-144x144.png", "msapplication-config": "https://vice-web-statics-cdn.vice.com/favicons/vice/browserconfig.xml"}, "movies": [], "publish_date": 1502215806.0, "source": "https://broadly.vice.com", "summary": ""}