{"url": "https://www.express.co.uk/entertainment/films/811228/Michael-Jackson-bodyguards-biopic-Searching-For-Neverland-Whitfield-Javon-Beard", "text": "GETTY/LIFETIME Michael Jackson bodyguards tell all in new biopic\n\nThe new film aired on US television last night and features actors playing the roles of Jackson and his bodyguards. Everything shown, however, is based on the incredible revelations made by The King of Pop's security guards. Beard and Whitfield exclusively told Express Online about the 13 most remarkable memories of working for Jackson. From smuggling in secret girlfriends to family feuds and suitcases full of cash, passports and an Oscar statue, it is even stranger than anyone could imagine. Based on the 2014 US book of the same name, Searching for Neverland gives an eye-opening account of what it was really like living in Michael Jackson's world.\n\nBeard and Whitfield also published Remember The Time in the UK in 2015 and shared some incredible memories with Express Online. 1. SECRET LOVERS Mr Jackson had at least two secret girlfriends who lived abroad. We met them when they flew in to visit during a summer vacation in Middleburg, Virginia. He kept their presence a secret from his family, his managers, even his children. We were the only two privy to their arrival, and even we were never told their real names; he referred to them only as “Friend” and “Flower\". 2. ESCAPE PLANS Mr Jackson carried a briefcase with $200,000, his treasured Oscar statue for Gone With the Wind and family passports.\n\nMichael Jackson: A life in pictures Sat, August 29, 2015 Michael Jackson would have been 57 today. We take a look back at the life and times of the King of pop. Play slideshow Getty 1 of 17 Michael Jackson during the HIStory world tour in 1996\n\n3. FAMILY SPLIT By the time he returned to America from Bahrain and Ireland in late 2007, Mr Jackson was almost completely estranged from everyone in his family except his mother. She would drop by unannounced and he always welcomed her. Everyone else had to have an appointment to see him. Even Janet. On numerous occasions, his famous siblings would arrive, sometimes breaking through the security gate, only to be turned away. 4. BOOK WORM Too famous to leave his house very often, Michael Jackson was a huge reader. He devoured books on history, art, science, you name it. On a single trip to the bookstore, he’d drop $5,000 on books like he was buying a pack of gum. During a 2007 visit to Los Angeles, he found a used book store he liked so much that he bought it for $100,000 cash on the spot and had the entire collection hauled back to his Las Vegas home.\n\nGETTY Michael Jackson and his mother\n\n5. BUGGED BY BUGGING Michael Jackson lived in fear of being secretly recorded. Before Mr Jackson entered any hotel room or conference room, he would have us sweep the room for cameras or listening devices. If he even suspected that a room was bugged, he’d insist on changing rooms. When he discovered that a limousine company had failed to disconnect the security cameras mounted inside a car we’d rented, he had us confiscate the vehicle and hold it in the garage until the company agreed to turn over the recordings it had made so that they could be destroyed. 6. A BLOODY BUSINESS Mr Jackson cut open his hand pulling a surveillance camera from a wall in a hotel in Washington, D.C.\n\nThe Jackson kids: Paris, Prince and Blanket in pictures Thu, November 24, 2016 Paris, Prince and Blanket Jackson in pictures. Play slideshow Instagram 1 of 34 Paris Jackson looks very happy to be cuddling up to her brother Prince\n\n7. CODE NAME KIDS Most people know that in public, Mr Jackson required his children to wear masks in order to hide their identities from the paparazzi. That wasn’t the only precaution he took. He also gave the children code names to use with each other and for us to use over the radio. They were never to use their real names outside of the house. 8. KING OF CLASSICS Michael Jackson may have been the King of Pop, but in his private time he listened almost exclusively to classical music. Bach, Beethoven, Tchaikovsky - that was the soundtrack running in his car and his house all the time. One of his favourite pop songs, though, was My Prerogative by Booby Brown.\n\nGETTY Michael Jackson's children at his memorial\n\n9. A FRIEND IN DEED Much to our surprise, Mr Jackson revealed to us that after OJ Simpson was acquitted for the murder of his wife, he allowed the disgraced football player to take refuge from the media at his Neverland Ranch. 10. MEDIA BLACKOUT In his final years, Michael Jackson had virtually blocked out the entire world. Thanks to the relentless and typically negative tabloid coverage of his life, Jackson wouldn’t watch broadcast or cable TV, only DVDs. He had no computer and would typically have one of us search the Internet and send emails on his behalf. On trips to bookstore and newsstands, we had to pre-screen the newspaper and magazine racks to make sure there were no Michael Jackson-related stories that he or the children might see. The only American news Mr Jackson consumed was The Wall Street Journal, which he read religiously every morning, because it was one of the few places he was unlikely to read crazy allegations about his personal life.\n\nGETTY Michael Jackson's children always wore masks in public\n\n11. BRING YOUR OWN Mr Jackson loved movies and would hire out whole cinemas for himself and his children. His favourite actor was Charlie Chaplin. He also brought his own hot sauce and spray butter into the movies for his popcorn. 12. HITTING THE HOOPS One of Mr Jackson’s favorite pastimes was playing basketball. He and his brothers learned how to play at Marvin Gaye’s house back in the Jackson 5 days. He would go out to the driveway all the time and just shoot hoops by himself for a few hours. It was his way to relax and unwind. He had a pretty good jump shot, too.\n\nMichael Jackson's Neverland Ranch goes on sale for $100million Fri, May 29, 2015 Michael Jackson's famous Neverland Ranch goes on sale for $100million. We take a look a look inside the once King of Pops exquisite mansion. Play slideshow Getty Images 1 of 28 Michael Jackson's Neverland Ranch", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6035737&cv=2.0&cj=1", "https://cdn.images.express.co.uk/img/dynamic/35/285x190/810542_1.jpg", "https://cdn.images.express.co.uk/img/dynamic/36/750x445/811228.jpg", "https://cdn.images.express.co.uk/img/dynamic/galleries/x701/62940.jpg", "https://cdn.images.express.co.uk/img/dynamic/36/285x190/801385_1.jpg", "https://googleads.g.doubleclick.net/pagead/viewthroughconversion/1068671835/?value=0&label=u9gYCOmHtQYQ28bK_QM&guid=ON&script=0", "https://cdn.images.express.co.uk/img/covers/70x91/front_2020-04-15.jpg", "https://cdn.images.express.co.uk/img/page/placeholder-horizontal.gif", "https://cdn.images.express.co.uk/img/dynamic/galleries/x701/61226.jpg", "https://analytics.twitter.com/i/adsct?txn_id=l4f18&p_id=Twitter", "https://cdn.images.express.co.uk/img/page/preloaderbig.gif", "https://t.co/i/adsct?txn_id=l4f18&p_id=Twitter", "https://cdn.images.express.co.uk/img/dynamic/galleries/x701/186396.jpg"], "top_img": "https://cdn.images.express.co.uk/img/dynamic/36/750x445/811228.jpg", "keywords": [], "authors": ["Stefan Kyriazis"], "canonical_link": "https://www.express.co.uk/entertainment/films/811228/Michael-Jackson-bodyguards-biopic-Searching-For-Neverland-Whitfield-Javon-Beard", "title": "Michael Jackson bodyguard biopic: 13 HUGE shocks 'Secret GIRLFRIENDS and escape plans'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "NEW Michael Jackson biopic Searching For Neverland is based on amazing revelations from bodyguards Javon Beard and Michael Whitfield.", "fb": {"pages": 129617873765147, "app_id": 823607694325129}, "og": {"title": "Michael Jackson bodyguard biopic: 13 HUGE shocks 'Secret GIRLFRIENDS and escape plans'", "type": "article", "url": "https://www.express.co.uk/entertainment/films/811228/Michael-Jackson-bodyguards-biopic-Searching-For-Neverland-Whitfield-Javon-Beard", "image": "https://cdn.images.express.co.uk/img/dynamic/36/750x445/811228.jpg", "site_name": "Express.co.uk", "language": "en", "tags": "entertainment,arts,books,celebrities,movies,ctp_video,autoplay_video,Michael Jackson,bodyguards,biopic,Bill Whitfield,Javon Beard,girlfriends,sex,money,children", "section": "Films", "description": "NEW Michael Jackson biopic Searching For Neverland is based on amazing revelations from bodyguards Javon Beard and Michael Whitfield."}, "news_keywords": "entertainment,arts,books,celebrities,movies,ctp_video,autoplay_video,Michael Jackson,bodyguards,biopic,Bill Whitfield,Javon Beard,girlfriends,sex,money,children", "article": {"tag": "children", "published_time": "2017-05-31T00:09:00+01:00", "modified_time": "2017-05-31T00:09:21+01:00", "expiration_time": "2017-06-30", "section": "Films", "image_count": 4, "video_count": 1, "word_count": 1090, "internal_link_count": 4, "external_link_count": 0}, "author": "Stefan Kyriazis", "twitter": {"card": "summary_large_image", "image": {"src": "https://cdn.images.express.co.uk/img/dynamic/36/750x445/811228.jpg"}, "title": "Michael Jackson bodyguard biopic: 13 HUGE shocks 'Secret GIRLFRIENDS and escape plans'", "description": "NEW Michael Jackson biopic Searching For Neverland is based on amazing revelations from bodyguards Javon Beard and Michael Whitfield."}, "video_autoplay": "true", "headline_short": "Michael Jackson bodyguard biopic: 13 HUGE shocks 'Secret GIRLFRIENDS and escape plans'", "verify-v1": "EGl3XPBuem43awGwLC1rXGpRHRnmNSwp7VZfnCAAcKE=", "msvalidate.01": "1960193A20395DAD3FCB640BCB0D91D7", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "robots": "noodp,noydir,all"}, "movies": [], "publish_date": 1496185740.0, "source": "https://www.express.co.uk", "summary": ""}