{"url": "https://web.archive.org/web/20170817201212/https://www.forbes.com/sites/hughmcintyre/2017/08/17/justin-bieber-drops-a-new-song-friends-just-weeks-after-cancelling-his-tour/", "text": "Justin Bieber is looking to keep his incredible winning streak going with a new song just released entitled “Friends,” which seems to be a new single fronted by the star himself.\n\n“Friends” is another dance-pop production, following in the footsteps of much of the singer's output over the past few years. Everything about the song is polished and perfectly suited to take over radio waves for the remainder of the summer. Bieber questions if he and a former flame can remain friendly over and over, just before the beat drops and the infectious instrumental chorus kicks in. That structure has worked very, very well for the chart-topper before, and he clearly isn't interested in veering too far off his current path, but that's sure to please millions of consumers around the world.\n\nAt the moment, it’s not entirely clear if “Friends” is a one-off meant to appease his massive fan base or if it’s the lead single from some upcoming project. A quick look at the team that helped make the tune happen suggests that it would be a waste to throw it away and not promote it as a proper single, but it all depends on what the singer can take on, and if he’s ready to launch the next era of his career.\n\nThe song was produced by (and it is credited as a duet with) BloodPop, who has previously worked with Bieber on songs like the massively popular “Sorry” and album cuts like “I’ll Show You,” “Mark My Words” and “Children,” all from his recent Purpose record. The BloodPop, formerly known as Blood Diamonds, has also partnered with artists like Madonna (“Iconic,” “Devil Pray”), Britney Spears (“Better”) and Lady Gaga, for whom he co-produced much of her latest No. 1 album Joanne.\n\nThe track was co-written by Julia Michaels and Justin Tranter, alongside Bieber and BloodPop. Those two first writers are some of the most sought after in the music industry at the moment, as they have shown they can craft a hit for almost anybody. The pairing has collaborated on smashes like Hailee Steinfeld’s “Love Myself,” Selena Gomez’s “Good For You” and “Hands To Myself,” Linkin Park’s “Heavy” and Gwen Stefani’s “Used To Love You,” and Michaels already has one of the bestselling songs of 2017 to her credit as an artist, as her own \"Issues\" was a big hit earlier this year.\n\nBieber surprised his sizable fan base earlier this week by revealing the song was on its way on Twitter, sharing the odd artwork and a release date and time. Many were surprised to see that he was gearing up to drop anything new, as it appeared that he was ready to take a break and disappear for a little while, given the fact that he just canceled a slew of American tour dates that were set to be some of the biggest of his career.", "images": ["https://web.archive.org/web/20170817201212im_/https://specials-images.forbesimg.com/imageserve/827672816/960x0.jpg?fit=scale", "https://web.archive.org/web/20170817201212im_/https://specials-images.forbesimg.com/imageserve/593b25f9a7ea434078d4f4ce/400x400.jpg?fit=scale&background=000000", "https://web.archive.org/web/20170817201212im_/https://2.gravatar.com/avatar/853c59789c520784fcfecc68c6c34217?s=62&#038;d=mm&#038;r=g"], "top_img": "https://web.archive.org/web/20170817201212im_/https://specials-images.forbesimg.com/imageserve/827672816/960x0.jpg?fit=scale", "keywords": [], "authors": ["Hugh Mcintyre"], "canonical_link": "https://web.archive.org/web/20170817201212/https://www.forbes.com/sites/hughmcintyre/2017/08/17/justin-bieber-drops-a-new-song-friends-just-weeks-after-cancelling-his-tour/", "title": "Justin Bieber Drops A New Song, 'Friends,' Just Weeks After Cancelling His Tour", "meta_data": {"viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "apple-itunes-app": "app-id=588647136", "fb": {"app_id": 123694841080850}, "og": {"site_name": "Forbes", "title": "Justin Bieber Drops A New Song, 'Friends,' Just Weeks After Cancelling His Tour", "image": "https://web.archive.org/web/20170817201212im_/https://specials-images.forbesimg.com/imageserve/827672816/960x0.jpg?fit=scale", "updated_time": "2017-08-17T13:55:00-04:00", "url": "https://web.archive.org/web/20170817201212/https://www.forbes.com/sites/hughmcintyre/2017/08/17/justin-bieber-drops-a-new-song-friends-just-weeks-after-cancelling-his-tour/", "description": "Does the Biebs have another certified banger on his hands with this latest track?", "type": "article"}, "twitter": {"site": "@forbes", "card": "summary_large_image", "title": "Justin Bieber Drops A New Song, 'Friends,' Just Weeks After Cancelling His Tour", "description": "Does the Biebs have another certified banger on his hands with this latest track?", "image": "https://web.archive.org/web/20170817201212im_/https://specials-images.forbesimg.com/imageserve/827672816/960x0.jpg?fit=scale", "creator": "@hughmcintyre"}, "description": "Does the Biebs have another certified banger on his hands with this latest track?", "author": "Hugh McIntyre", "article": {"publisher": "https://www.facebook.com/forbes", "author": "Hugh McIntyre", "section": "Business", "section_url": "https://www.forbes.com/business/", "id": "blogAndPostId/blog/post/3113-22298", "published": "2017-08-17", "modified": "2017-08-17"}}, "movies": [], "publish_date": 1502899200.0, "source": "https://web.archive.org", "summary": ""}