{"url": "www.yourtango.com/2018315491/are-sarah-hyland-and-wells-adam-engaged-new-rumors-theyre-planning-a-wedding", "text": "They're moving in together.\n\nAre Sarah Hyland and Wells Adams Engaged? Modern Family's Sarah Hyland and The Bachelorette alum Wells Adams have been a couple for awhile now. They've been doing the long-distance thing since Sarah lives in L.A. and Wells is a D.J. and podcast host based out of Nashville. Things are changing for the couple, though, and rumors are swirling that they may be getting married. Let's take a look at what we know so far.\n\n1. How did they meet?\n\nSarah and Wells started flirting on Twitter last summer while he was the bartender on Bachelor in Paradise. Sarah has had a crush on him since he was romancing JoJo Fletcher on season 12 of The Bachelorette in 2016. They went public with their relationship over Halloween and have been pretty inseparable ever since. Adams and Hyland celebrated Thanksgiving, Christmas, and New Year's together. They've been together for 10 months.\n\nA post shared by Sarah Hyland (@sarahhyland) on Jul 22, 2018 at 10:06am PDT\n\n2. He's moving to LA\n\nOn the July 20th episode of Your Favorite Thing, the podcast he co-hosts with Miley Cyrus' sister Brandi, Wells dropped the news that he was moving to Los Angeles and in with Hyland. In fact, the first clue was in the title of the episode: \"Wells Moves To LA.\" He said, “Should I just say it? I guess it’s going to come out after. It doesn’t even matter. I’m straight up moving to LA. Should I not have said it? I’ve got to go!” He went on to say, \"If we’re going to take the next step, this is the first step we’ve got to take to decide if we can handle living with one another, you know?”\n\nA post shared by Sarah Hyland (@sarahhyland) on Jul 6, 2018 at 1:26pm PDT\n\n3. He has a concern, though\n\nWells has one big concern: Will their dogs get along? On the podcast he said, \"I’m not concerned about us living together or us getting along or whatever. I’m most concerned about my dog and her dogs. Carl sleeps on my bed, right. And her dog Boo sleeps on her bed. What’s going to happen?\n\nA post shared by Sarah Hyland (@sarahhyland) on Jul 5, 2018 at 5:21pm PDT\n\n4. Rent his Nashville home\n\nFans of Hyland and Wells may be able to rent or Airbnb his furnished Nashville home. He said “I don’t know yet. I might Airbnb it. I might just long-term rent it. Problem is, it’s furnished. I’m just gonna leave it. I don’t know. I haven’t gotten that far.”\n\nA post shared by Sarah Hyland (@sarahhyland) on Jun 10, 2018 at 11:42am PDT\n\n5. It makes sense\n\nBack in March, Sarah opened up to People about her long-distance romance, saying, “I think the longest we’ve gone without seeing each other is like two to three weeks because five days is already too much for us, So we always try to make sure to see each other. He’s a friggin’ trooper and always flying out here every weekend or every other weekend to see me if my schedule has been too busy to see him — which it has been in 2018 with awards season and with Modern [Family]. But yeah — I don’t think it’s hard if the love is there.”\n\nA post shared by Sarah Hyland (@sarahhyland) on May 8, 2018 at 9:48pm PDT\n\n6. Putting a ring on it?\n\nSarah and Wells aren't engaged yet, but sources close to them expect it to happen before the end of the year. She even knows what kind of engagement ring she wants and has made sure Wells knows it, too!\n\nA post shared by Sarah Hyland (@sarahhyland) on Apr 27, 2018 at 2:07pm PDT\n\nAmy Lamare is a Los Angeles based freelance writer covering entertainment, pop culture, beauty, fashion, fitness, technology, and the intersection of technology, business, and philanthropy. She is deeply devoted to her chocolate Labrador and an avid long distance runner. You can find her on Instagram and Facebook.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6035233&cv=2.0&cj=1", "https://www.yourtango.com/sites/all/themes/ytpurple/img/logo-150.png?v2", "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/sarah%20hyland%20wells%20adams.png?itok=Z5bVGTq4", "https://www.yourtango.com/sites/default/files/styles/header_slider/public/image_blog/sarah%20hyland%20wells%20adams.png?itok=4ZEwavOI"], "top_img": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/sarah%20hyland%20wells%20adams.png?itok=Z5bVGTq4", "keywords": [], "authors": [], "canonical_link": "https://www.yourtango.com/2018315491/are-sarah-hyland-and-wells-adam-engaged-new-rumors-theyre-planning-a-wedding", "title": "Are Sarah Hyland And Wells Adams Engaged? New Details On The Rumors They're Planning A Wedding", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "fb": {"app_id": 102332647006, "pages": 39475817260}, "keywords": "entertainment and news, Buzz", "article": {"author": "https://www.facebook.com/AmyLamareWriter/", "published_time": "2018-07-24T15:15:45", "modified_time": "2018-07-24T15:15:45"}, "og": {"site_name": "YourTango", "type": "article", "url": "https://www.yourtango.com/2018315491/are-sarah-hyland-and-wells-adam-engaged-new-rumors-theyre-planning-a-wedding", "title": "Are Sarah Hyland And Wells Adams Engaged? New Details On The Rumors They're Planning A Wedding", "description": "They're moving in together.", "updated_time": "2018-07-24T15:15:45", "image": {"identifier": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/sarah%20hyland%20wells%20adams.png?itok=Z5bVGTq4", "width": 620, "height": 309}}, "description": "Are Sarah Hyland And Wells Adams Engaged? Bachelorette alum Wells Adams is ditching his Nashville digs to move to L.A. for his girlfriend Sarah Hyland. The couple will be co-habitating at Hyland's home with their two dogs. New details on the rumors a wedding could be in the very-near future!", "abstract": "Modern Family's Sarah Hyland and The Bachelorette alum Wells Adam have been a couple for awhile. They've been doing the long distance thing since", "robots": "follow, index, noodp, noydir", "news_keywords": "are sarah hyland and wells adams engaged, sarah hyland wells adams engaged, sarah hyland wells adams engagement, sarah hyland wells adams getting married, wells adams moving to la, sarah hyland, wells adam, sarah hyland wells adams wedding, sarah hyland wells adams getting married, sarah hyland wells adams still together, sarah hyland wells adams proposal, sarah hyland wells adams together, sarah hyland wells adams", "generator": "Drupal 7 (http://drupal.org)", "twitter": {"card": "summary_large_image", "creator": {"identifier": "@yourtango", "id": 17490866}, "url": "https://www.yourtango.com/2018315491/are-sarah-hyland-and-wells-adam-engaged-new-rumors-theyre-planning-a-wedding", "title": "Are Sarah Hyland And Wells Adams Engaged? New Details On The Rumors They're Planning A Wedding", "image": {"src": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/sarah%20hyland%20wells%20adams.png?itok=Z5bVGTq4", "width": 60, "height": 60}}}, "movies": ["https://www.youtube.com/embed/Xr31xUBNcuw"], "publish_date": 1532416545.0, "source": "http://www.yourtango.com", "summary": ""}