{"url": "https://www.elitedaily.com/p/this-unbreakable-kimmy-schmidt-season-4-outtake-song-is-hilariously-perfect-9552882", "text": "Season 4 of Unbreakable Kimmy Schmidt turned out to be a funny addition to the Netflix hit without overemphasizing its message that current events and a changing society are a thing. For me, Kimmy likely unintentionally channeling Of Mice and Men as she planned to drown her animated backpack was a season highlight, but a recent behind-the-scenes clip might be my new favorite thing from the show. If you found yourself loving Kimmy's Sesame Street-esque backpack Jan S. Port, this Unbreakable Kimmy Schmidt Season 4 outtake song is hysterically perfect.\n\nThanks to Titus's new theatre job at a middle school in Season 4, Kimmy (Ellie Kemper) was reunited with the backpack she towed around New York City in the show's first season. She lost the backpack, lovingly called Jan S. Port, at a club, but it turns out that the bag was an essential lifeline for her back in the bunker. Jan was a crucial element of Kimmy's bunker games that were meant to distract her from reality, so Kimmy was understandably delighted when Jan still came to life and remembered her. The two sang multiple songs around Kimmy and Titus's apartment, much to Titus's confusion, as he couldn't see an alive Jan.\n\nAlthough Kimmy nearly drowned Jan in a moment of disillusion, a call from a kid who has found her discarded children's story saved the day, and Kimmy and Jan will seemingly make more lovely music together in the second half of Season 4, which premieres on Netflix on Jan. 25, 2019. However, if you're still desperate for some more puppetry fun, Netflix released an outtake of a song that the voice behind Jan, Stephanie D'Abruzzo, ad-libbed during filming.\n\nNetflix on YouTube\n\nCapturing the essence of Jan's sunny spirit, the song is pretty simple, focusing on Jan's excitement about going on an adventure. The clip even runs past the director's cut, and it seems as if the puppet stays in character. Remember when Pixar or the Muppets included bloopers in their movies? Imagine that sensation but when you're an adult watching a fairly adult show. Mind-blowing.\n\nIf you've had a young Sesame Street fan in your life the past few years, you might recognize Jan's voice as belonging to a regular on the PBS Kids staple. A skilled puppetmaster, Stephanie D'Abruzzo has voiced the character Prairie Dawn since 2016, and her resume includes plenty of puppetry and voice appearances in kids' shows throughout the years. Broadway fans will also know her as the original Kate Monster (who is, yes, also a puppet) in the 2003 musical Avenue Q, a role that earned D'Abruzzo a Tony nomination.\n\nIn a statement to E! News, D'Abruzzo said about the cut scene:\n\nThis was the first scene we shot with Jan, and this moment was a total ad lib on my part. Sometimes we puppeteers like to play around between takes—or at the end of takes—to help find little fun character quirks. I am such a ham that once I get going, I'll go until I hear 'cut.' I was very relieved to hear laughter. When your work elicits genuine laughter from the crew, it's the highest praise a performer can get. I'll take the sound of a 10-person crew laughing over the applause of thousands any day. Jan saying 'Sorry, that was a lot…you're really patient' to Kimmy was really Stephanie saying 'Thank you for indulging my ridiculousness' to Ellie, director Jude Weng, and everyone on set!\n\nAw. I'm definitely hoping for more Jan in Part 2 of Season 4, and perhaps her interactions with folks other than Kimmy could be in store. Just imagine how hilarious a \"Titus Sings With Jan!\" episode could be.\n\nThe second half of Unbreakable Kimmy Schmidt's final season debuts on Netflix on Friday, Jan. 25, 2019.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/image/2020/4/15/48d8e105-7781-4fa5-bc80-7f6a9c807684-uksf_sg_00210r2.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/4/2b74a670-4c99-40d5-9b1d-5e9daaa83751-screen-shot-2020-04-04-at-15503-pm.png?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/11/959d0fb8-50a7-4da1-aaa8-a61da167c25a-getty-1181284940.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/6/22/9899ad8c-efe0-441c-a542-94c0b539bfcc-uks_402_unit_00537r.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2018/6/22/9899ad8c-efe0-441c-a542-94c0b539bfcc-uks_402_unit_00537r.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/uploads/image/2018/6/22/9899ad8c-efe0-441c-a542-94c0b539bfcc-uks_402_unit_00537r.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/this-unbreakable-kimmy-schmidt-season-4-outtake-song-is-hilariously-perfect-9552882", "title": "This 'Unbreakable Kimmy Schmidt' Season 4 Outtake Song Is Hilariously Perfect", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/this-unbreakable-kimmy-schmidt-season-4-outtake-song-is-hilariously-perfect-9552882", "type": "article", "title": "This Behind-The-Scenes Clip From 'Unbreakable Kimmy Schmidt' Season 4 Will Make You LOL", "description": "Season 4 of Unbreakable Kimmy Schmidt turned out to be a funny addition to the Netflix hit without overemphasizing its message that current events and a changing society are a thing. For me, Kimmy likely unintentionally channeling Of Mice and Men as…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/6/22/9899ad8c-efe0-441c-a542-94c0b539bfcc-uks_402_unit_00537r.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "Season 4 of Unbreakable Kimmy Schmidt turned out to be a funny addition to the Netflix hit without overemphasizing its message that current events and a changing society are a thing. For me, Kimmy likely unintentionally channeling Of Mice and Men as…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}