{"url": "https://www.yahoo.com/entertainment/ready-player-one-ultimate-guide-pop-culture-references-173907937.html", "text": "Warning: This post contains spoilers for Ready Player One.\n\nSteven Spielberg‘s futuristic adventure Ready Player One isn’t just an FX-heavy blockbuster. It’s also a visual encyclopedia collecting several decades’ worth of geek culture. Adapted from the 2011 novel by Ernest Cline, the film takes place in the far-off year of 2045, when humans like hero Wade Watts (Tye Sheridan) spend all their time in a digital virtual-reality realm called the OASIS. Within this world, they can freely indulge their obsessions with the movies, TV shows, and video games of the distant past … the “distant past” in this case being primarily the ’80s and ’90s. Almost every frame of Ready Player One is filled with one (and often many more) references to our collective pop-culture history. The Yahoo Entertainment team put together this list of the 80-plus references we spotted in Ready Player One. Read on and let us know about any sightings we missed in the comments below.\n\nThe A-Team\n\nWe love it when a plan comes together: The GMC van that housed the crack squad of soldiers turned heroes for hire on NBC’s hit 1983-87 series takes part in the opening race challenge designed by OASIS creator James Halliday (Mark Rylance).\n\nAdventure\n\nIf you were the lucky kid in your group of friends who owned an Atari 2600 in the ’80s, then you definitely had your pals over to try and master this precursor to later open-world quest games like The Legend of Zelda. It’s also notable in gaming history as the first video game to feature a hidden Easter egg: the name of the creator, Warren Robinett. In Ready Player One, Adventure is the last challenge Wade/Parzival faces in his grand adventure to master Halliday’s game.\n\nThe Adventures of Buckaroo Banzai Across the 8th Dimension\n\nW.D. Richter’s 1984 cult favorite bombed at the box office, but it has an army of celebrity fans ranging from Kevin Smith to Ready Player One‘s own Ernie Cline. (In fact, Cline even wrote an unproduced sequel script, Buckaroo Banzai Against the World Crime League.) Attempts to revive the character have thus far proved elusive, but maybe Parzival’s choice to dress up as Buckaroo for his “date” with Art3mis, the online identity of fellow gamer Samantha (Olivia Cooke), will kick-start a long-anticipated Banzai revival.\n\nAkira\n\nA blockbuster in its native Japan, Akira brought anime to America in a big way in 1988. So it’s only natural that Art3mis would make the film’s sleek motorcycle her ride of choice when racing for Halliday’s first key.\n\nAlien\n\nRidley Scott’s 1979 sci-fi classic birthed a franchise that continues to this day in films, video games, and even comic books. The USCSS Nostromo is among the model ships that Parzival’s buddy Aech (Lena Waithe) keeps in her hangar, and a Xenomorph bursts out of Art3mis’s chest when she’s trying to sell Parzival on the importance of a disguise.\n\nAmblin Entertainment\n\nFounded in 1981, Steven Spielberg’s production company is named after the 1968 short film that put him on the path to cinematic idol. The familiar logo of Elliott wheeling E.T. in front of the moon — borrowed from the director’s 1982 favorite — opens Ready Player One in a knowing wink at all the references that lie ahead.\n\nAnimal House\n\nJohn Landis’s landmark 1978 collegiate comedy is cited when Wade tries to stump IOI head Nolan Sorrento (Ben Mendelsohn) with deep-cut geek-isms in their first face-to-face meeting.\n\nMarty McFly’s DeLorean from Back to the Future is a major presence in Ready Player One. (Photo: Warner Bros. Pictures/Courtesy Everett Collection)\n\nBack to the Future\n\nThirty years ago, Steven Spielberg helped pal Robert Zemeckis bring Mickey Mouse and Bugs Bunny together for Who Framed Roger Rabbit. Now Zemeckis gave his OK for Spielberg to make the Universal-owned Back to the Future franchise (which Spielberg executive-produced) a major presence in the Warner Bros.-released Ready Player One. Not only does Parzival drive Marty McFly’s iconic DeLorean when he’s in the OASIS, but viewers can spot a Doc Brown avatar in the background of one shot, and hear the classic BTTF theme music play when the hero activates the Zemeckis Cube, which can turn the clock back 60 seconds (both RP1 and BTTF were scored by Alan Silvestri). Also, back in the real world, Simon Pegg is totally channeling Christopher Lloyd when he shows up in the final sequence as Halliday’s estranged partner, Ogden Morrow.\n\nBatman\n\nOriginally introduced in 1939, the Caped Crusader arguably remains the world’s most recognizable — and popular — costumed crime fighter, battling bad guys in comic books, cartoons, movies, video games, and novels. The Bat symbol adorns stickers that are scattered throughout the movie (including one in Aech’s van) and also appears on the chest of the Dark Knight himself, whose avatar is glimpsed in the OASIS. Batman would be wise to check his utility belt and confirm his keys are still there, as the Batmobile is glimpsed speeding through the New York streets in the opening race. Not just any Batmobile, but the sleek vehicle that Adam West drove in the classic 1966 TV series. Chicks dig the car. The film also features avatars from the classic game series Arkham: Batman.\n\nBattlestar Galactica\n\nAech’s collection of model spaceships includes the good ship Galactica, which carried the survivors of the Cylon attack on the 12 colonies in both the original 1978 TV series and its superior 2004 reboot. So say we all.\n\nBattletoads\n\nWhile they never seriously challenged the Teenage Mutant Ninja Turtles for mutant amphibian supremacy, the Battletoads did wear out the thumbs of millions of NES-era gamers when their nearly impossible game hit shelves in 1991. Flash-forward to the year 2045 and those toads do have some staying power: A Battletoad avatar parties down in the nightclub Parzival and Art3mis visit on their not-date date.\n\nThe Beastmaster\n\nThey just don’t make movies like this bizarre 1982 sword and sorcery flick anymore. That’s why Don Coscarelli’s whacked-out fantasy about a musclebound warrior who can psychically chat with critters big and small is memorialized on a poster strategically placed in the background of the OASIS.\n\nBeetlejuice\n\nMichael Keaton’s ghost with the most from Tim Burton’s beloved supernatural comedy is 30 years young, and looks eternally youthful as an OASIS avatar.\n\nBigfoot\n\nIn addition to classic monsters like King Kong and Jurassic Park‘s T. rex, Ready Player One makes room for some classic monster trucks. In Halliday’s speedway chase, Aech is seen driving this classic beast of a vehicle, created by Bob Chandler in 1975 — the same year that Steven Spielberg’s Jaws terrified moviegoers.\n\nCentipede\n\nThe 1980 shooter is one of the many Atari 2600 titles that baffle the IOI foot soldiers in Halliday’s final challenge.\n\nView photos The murderous doll Chucky has a killer cameo in Ready Player One. (Photo: Mary Evans/UA/Ronald Grant/Everett Collection) More\n\nChild’s Play\n\nHe’s Chucky — wanna play? The pint-size star of the Child’s Play series, which started in 1988 and released its latest installment last year, is used as a weapon in the climactic Planet Doom battle.\n\nChristine\n\nTwo horror masters met when John Carpenter adapted Stephen King’s novel about a murderous Plymouth Fury to the big screen. (And unlike with The Shining, the author is mostly happy with the movie.) Christine can be glimpsed alongside the cars at the starting line for Halliday’s crazy race.\n\nCowboy Bebop\n\nLike any self-respecting anime fan, Aech clearly has a deep love for this short-lived late ’90s cartoon series about a crew of bebopping bounty hunters in outer space. She’s built a replica of the Swordfish II, a speedy racer favored by antihero Spike, in her hanger.\n\nDark Side of the Moon\n\nWhen Sorrento initially contacts Wade to discuss striking a business arrangement, he uses the logo from the landmark 1973 Pink Floyd album as the digital gateway.\n\nDuke Nukem\n\nThe musclebound star of a popular series of ’90s platform games, Duke Nukem brings his “nuke ’em all” battle strategy to a Planet Doom skirmish.\n\nDune\n\nWhen Parzival and Art3mis meet up in Aech’s workshop, he shows her a collection of famous sci-fi ships — and though we don’t actually see any, he references the Spacefolder ships that transport the great Houses in Frank Herbert’s groundbreaking 1965 novel to the farthest corners of the galaxy. Those ships came to life in David Lynch’s gloriously goofy 1984 film version of Dune and will presumably take flight again in Denis Villeneuve’s planned remake.\n\nDungeons & Dragons\n\nDungeons & Dragons is far less relevant in Spielberg’s film than it was in Cline’s novel. Still, it’s referenced a number of times, including via a background game logo, a 20-sided die in the center of the powerful Orb of Osuvox, the planet Gygax (which is named after the game’s creator, Gary Gygax), and Halliday’s avatar Anorak, who is partially based on a D&D wizard.\n\nExcalibur\n\nIn order to counteract the force-field-generating power of the Orb of Osuvox, Art3mis utters the “Charm of Making” from John Boorman’s 1981 version of the Arthurian legend.\n\nFast Times at Ridgemont High\n\nWhen Sorrento is trying to prove his geek bona fides to Wade (with the aural aid of an actual geek, of course), he name-drops Amy Heckerling’s popular 1982 coming-of-age teen movie.\n\nView photos Jeff Goldblum as the title character in David Cronenberg’s 1986 horror favorite The Fly. (Photo: 20th Century Fox Film Corp/Courtesy Everett Collection) More\n\nThe Fly\n\nWhen discussing Halliday’s love of The Shining, the characters mention that the OASIS founder watched Stanley Kubrick’s classic the same week that he saw David Cronenberg’s 1986 horror classic.\n\nForbidden Planet\n\nThe 1956 sci-fi favorite gets two shout-outs, both in the form of Robbie the Robot. Robbie appears as a toy in Halliday’s childhood room, and as a larger model in Wade’s apartment in the last scene. (Gremlins fans know that the robot also cameos in the Spielberg-produced comedy horror hit.)\n\nFriday the 13th\n\nAs the central boogeyman of the vintage horror franchise, Jason Voorhees has been to hell, outer space, and everywhere in between. Here he heads into the digital realm, partaking in some hack-and-slash on Planet Doom.\n\nGalaga\n\nA poster for Midway’s 1981 coin-op classic is seen at one point in the film.\n\nGod of War\n\nKratos, the brutal Spartan warrior who headlines the God of War video-game series, makes a blink-and-you’ll-miss-him cameo.\n\nHarley Quinn and the Joker\n\nThe Clown Prince of Crime and his maniacal main squeeze are among the avatars in the nightclub scene. Another DC baddie, Deathstroke, is also in attendance.\n\nView photos The Joker and Harley Quinn are among several DC Comics characters who cameo in Ready Player One. (Photo: Warner Bros.) More\n\nHalo\n\nDuring the final battle on Planet Doom, a squad of Master Chief-resembling Spartan soldiers are seen taking up arms.\n\nHello Kitty\n\nWhen Wade strolls through the OASIS in his Parzival avatar at the beginning of the film, he passes by Sanrio’s popular feline mascot — who has adorned backpacks and baby clothes since 1974 — and two of her pals.\n\nThe Incredible Hulk\n\nExplaining why his name is “Wade Watts,” our hero says that his geeky dad liked the alliterative characters that graced the pages of Marvel Comics — characters like Bruce Banner, the alter ego of Marvel’s not-so-jolly green giant.\n\nThe Iron Giant\n\nAech builds the Iron Giant of Brad Bird’s beloved 1999 animated film, and then pilots the robot into the final battle to face off against another metal titan: Mechagodzilla.\n\nView photos The Iron Giant plays a key role in Ready Player One. (Photo: Warner Bros.) More\n\nJohn Hughes\n\nThe official poet laureate of ’80s teen cinema, Hughes is used as a handy brainteaser when Wade tries to suss out Sorrento’s geek knowledge. Both the 1984 favorite The Breakfast Club and 1986’s Ferris Bueller’s Day Off are called out in this scene. Later on, the poster for Hughes’s 1985 film Weird Science can be briefly glimpsed in Halliday’s childhood bedroom.\n\nJoust\n\nDebuting in arcades in 1982 (and currently available in smaller, home-friendly versions) this John Newcomer-designed game gave the medieval challenge a futuristic twist by seating lance-carrying knights on flying ostriches. Playing Joust is the first test Wade must pass in Cline’s novel, but in Spielberg’s film it appears via a poster on Halliday’s bedroom wall and the game’s ostriches serve as mounts in the massive climactic battle.\n\n“Jump”\n\nVan Halen’s synth-driven monster single off the band’s blockbuster 1984 album sets the tone for the film, serving as the lead song on a soundtrack laden with earworms from the 1980s and beyond. Several of the tunes are used for on-the-nose moments in the movie, including Bruce Springsteen’s “Stand on It” (the flip side to “Glory Days” was also featured on the Ruthless People soundtrack), Tears for Fears’ “Everybody Wants to Rule the World,” Prince’s “I Wanna Be Your Lover,” Blondie’s “One Way or Another,” New Order’s “Blue Monday,” and Twisted Sister’s “We’re Not Gonna Take It” (which sets up the climactic battle).\n\nJurassic Park\n\nSpielberg nods at his own 1993 blockbuster — which became the gold standard for CGI and dinosaur movies — in Ready Player One‘s introductory car race sequence, which features a rampaging T. rex.\n\n\n\nKing Kong\n\nAs if a Tyrannosaurus weren’t enough of an obstacle during that car race, Wade also has to cope with the super-size star of one of the original creature features, 1933’s King Kong. The giant ape has lived many lives since then, including as the final obstacle preventing OASIS racers from the finish line.\n\nView photos The Glaive from Krull is used in Ready Player One. (Photo: Columbia/courtesy Everett Collection) More\n\nKrull\n\nIn order to infiltrate the fortress on Planet Doom, Wade’s small army first has to go through digital mercenary, i-R0k (voiced by T.J. Miller). To do that, one of his allies uses the flying five-pointed weapon known as the Glaive from this 1983 cult classic starring Ken Marshall as an intergalactic prince who has to rescue his lady love.\n\nLadyhawke\n\nA poster for Richard Donner’s 1985 fantasy film starring Matthew Broderick, Rutger Hauer, and Michelle Pfeiffer is visible on Halliday’s bedroom wall.\n\nLast Action Hero\n\nDuring the car race sequence, eagle-eyed viewers will spot a movie marquee emblazoned with “Schwarzengger in Jack Slater III.” Slater is the hero that Arnold Schwarzenegger played in 1993’s underrated action movie spoof Last Action Hero, co-conceived 25 years ago by Ready Player One scribe Zak Penn.\n\nWatch: Zak Penn reveals his Ready Player One references:\n\n\n\nLittleBigPlanet\n\nDuring the final battle, a number of avatars from this popular PlayStation video game series are recognizable.\n\nLooney Tunes\n\nDuring our initial tour of the OASIS, everyone’s favorite alien, Marvin the Martian, walks out of an entry point.\n\nThe Lord of the Rings\n\nThe film’s third act takes place at Anorak’s castle on Planet Doom, a setting based on Tolkien’s Mount Doom. And Halliday’s avatar Anorak is essentially Gandalf the Grey reimagined in the vein of Dungeons & Dragons.\n\nMad Max\n\nThe Interceptor, that modified Ford Falcon steered by Max Rockatansky in the 1979 original, makes an appearance in the opening race scene. We also catch a glimpse of the movie poster in Wade’s bedroom.\n\nMadballs\n\nThe weirdly popular ’80s toy that combined squishy orbs with crazy faces pops up in the movie and is also hidden in the poster, as the official Madballs Instagram gleefully pointed out:\n\nMagic 8-Ball\n\nThe question-answering novelty toy, which was originally created in the 1950s, is part of Ogden Morrow’s bag of tricks.\n\nMasters of the Universe\n\nWade apparently carried his He-Manwiches to school in a He-Man lunchbox, judging from its appearance in his hideout in the Stacks.\n\nMechagodzilla\n\nGodzilla’s alien-spawned robotic adversary, introduced in 1974’s Godzilla vs. Mechagodzilla, is Sorrento’s war machine of choice, going up against Aech’s Iron Giant in the final battle.\n\nMinecraft\n\nThe beloved building game gets a shout-out in the film’s opening introduction to the sprawling worlds within OASIS.\n\nMobile Suit Gundam\n\nThe influential 1979 Japanese anime series featured the sword-wielding giant robot RX-78-2 Gundam, the robot of choice for Wade’s ally Daitu in the battle against Sorrento’s Mechagodzilla.\n\nMonty Python and the Holy Grail\n\nWade uses the OASIS version of the sacred relic known as the Holy Hand Grenade in the final battle on Planet Doom, taking out a platoon of baddies. Coconuts not included.\n\nMortal Kombat\n\nArt3mis disguises herself as a Kombatant at one point, and you’ll also spot a pair of dragons guarding Halliday’s Easter egg, as well as statues of fighters Raiden, Sub-Zero, and Scorpion in the background.\n\nNightmare on Elm Street\n\nFreddy Krueger leaves our dreams to invade the virtual world of OASIS. He can be seen in Planet Doom’s opening battle.\n\nView photos Freddy Krueger leaps into action. (Photo:Warner Bros.) More\n\nOverwatch\n\nThe character Tracer from the hit 2016 video game appears as an avatar in the Planet Doom battle.\n\nPac-Man\n\nHalliday has a poster of Namco’s groundbreaking 1980 arcade game up in his room, while Art3mis/Samantha has stickers for Ms. Pac-Man on her bike and some Pac-Man cherries on her OASIS visor.\n\nPCU\n\nScreenwriter Zak Penn told us he snuck in a deep-cut reference to 1994 frat-house comedy PCU. In the film, Jeremy Piven tells Jon Favreau “don’t be that guy” who wears a band T-shirt to the band’s concert. In the film, Aech uses the line on Parzival, warning him not to wear his Buckaroo Banzai getup on a date with Art3mis.\n\nRaiders of the Lost Ark\n\nOne of the rare instances of Spielberg self-referencing in RP1: Halliday has an Indy poster in his room.\n\nRobocop\n\nDetroit’s protector and server can be seen walking out of an OASIS entry point early in the film.\n\nRubik’s Cube\n\nIn the film it’s a powerful relic called the “Zemeckis Cube,” after Spielberg’s Back to the Future buddy Robert Zemeckis, and it can turn the clock back 60 seconds.\n\nRush\n\nWhile Cline’s book features some pivotal plot points focused on the Canadian prog-rockers, the movie’s sole reference is a poster for the band’s 1976 album 2112 on Halliday’s wall. (The group’s signature hit, “Tom Sawyer,” was featured on the film’s Comic-Con trailer, although it’s not on the official soundtrack.)\n\nRun-DMC\n\nWe’re 99 percent positive we spotted one avatar in the OASIS dressed like one of the members of this seminal ’80s rap (and sometimes rock) group.\n\nSaturday Night Fever\n\nParzival is clearly busting some Tony Manero disco moves when he turns up at the Distracted Globe nightclub to the strains of the Bee Gees’ “Stayin’ Alive”\n\nSay Anything\n\nThe 1989 Cameron Crowe rom-com is mentioned as one of the film’s Halliday watched the same week as The Shining (as Parzival and Art3mis look for clues to the second challenge). But more prominently we see Z channeling his inner Lloyd Dobler by striking the iconic John Cusack boom box pose in the final battle.\n\nView photos Wade strikes a familiar pose in rallying his troops to the fight. (Photo: Warner Bros.) More\n\nThe Seventh Voyage of Sinbad\n\nSpielberg has long professed admiration for special-effects trailblazer Ray Harryhausen, whose legendary creations included the stop-motion Cyclops from the 1958 fantasy adventure film. The horned giant appears twice in RP1, first at an OASIS entry point early in the film and then again in the final battle on Planet Doom.\n\nThe Shining\n\nArguably Ready Player One’s strongest sequence is the High Five’s search for second key in the faithfully re-created Overlook Hotel from Stanley Kubrick’s 1980 adaptation of Stephen King’s novel. While the film has been celebrated by critics and fans, King believes it to be one of the worst adaptations of his work.\n\nView photos The Overlook Hotel is the setting for one of the most memorable sequences in Ready Player One. (Photo: Mary Evans/Warner Bros./Ronald Grant/Everett Collection) More\n\nSilent Running\n\nThe Valley Forge spaceship from the 1972 environmentally themed sci-fi film starring Bruce Dern was one of the many model ships seen in Aech’s workshop, complete with those greenhouse domes.\n\nSimon\n\nHalliday wears a button featuring Milton Bradley’s classic multicolored follow-the-leader electronic game, launched in 1979.\n\nSonic the Hedgehog\n\nIntroduced in the eponymous 1991 Sega Genesis game, Sonic was the first 16-bit rival to Nintendo’s Mario. The blue-furred speedster has since appeared in a host of video games, and his avatar pops up in the OASIS.\n\nSpace Invaders\n\nFeatured on at least two T-shirts in the film — one worn by the older Halliday and one by his younger self — Tomohiro Nishikado’s Space Invaders was one of the first and most successful arcade games when it was released in 1978.\n\nSpaceballs\n\nLone Starr and Barf’s Winnebago spaceship, the Eagle 5, from Mel Brooks’s 1987 Star Wars parody is among the litany of ships seen in Aech’s workshop.\n\nSpeed Racer\n\nThe Mach 5, the signature car from the ’60s anime series, is featured among the numerous vehicles in the film’s opening race.\n\nStar Trek\n\nGene Roddenberry’s classic sci-fi franchise plays a large role in the film, most notably in Halliday’s homage to Spock’s “funeral” from The Wrath of Khan­, complete with Starfleet logo wreaths. A poster for Star Trek: The Motion Picture is also featured in Halliday’s childhood bedroom, and at the end of the film a Klingon Bat’leth — a curved, horned blade — is seen perched on the window of Wade and Samantha’s apartment.\n\nStar Wars\n\nWhile featured heavily in the original novel, George Lucas’s beloved franchise has only a few brief mentions in the film due to … well, being currently owned be a competing studio. The first reference comes after Wade wins the first key when Halliday’s avatar Anorak refers to Parzival as a padawan — the term for a Jedi apprentice first heard in The Phantom Menace. The Millennium Falcon is later referenced by Sorrento (played by the erstwhile Director Krennic, Ben Mendelson). A Revenge of the Jedi poster is featured outside the theater where The Shining is playing. (For the n00bs: Revenge was the original title of Return of the Jedi before Lucas decided Jedi don’t believe in revenge.) Finally, Spielberg snuck in some Stormtroopers and R2-D2, the diminutive droid being one of the filmmaker’s favorite Easter eggs.\n\nWatch: Spielberg explains how he got his Star Wars references into Ready Player One:\n\n\n\nStreet Fighter II\n\nThe 1991 Capcom button mashing game gets a lot of love in the OASIS. Ryu, Blanka, and Chun-Li are among the many avatars seen dancing and fighting and fawning over Parzival. Wade himself gets to use Ryu and Ken’s “Hadouken!” attack at the end of the movie.\n\nSupergirl\n\nIf you’re a fan of the Injustice video game series, which features DC Comics heroes facing off against their fascist counterparts from an alternate reality, then you’re going to love Ready Player One. Injustice versions of the comic heroes are scattered throughout the film, with Supergirl and the Joker featured particularly prominently.\n\nSuperman\n\nThere are no Superman sightings per se, but his shadow looms large in the OASIS. Art3mis gives Parzival Clark Kent glasses to hide his identity without changing his appearance, and we later learn that Halliday’s favorite quote is from Richard Donner’s 1978 Superman. And there are some here at Yahoo Entertainment who are convinced that Sorrento’s avatar is inspired by Superman, because there are very few characters who can sport an S-shaped spit curl that strong.\n\nView photos Sorrento’s avatar sports a familiar-looking curl in Ready Player One. (Image: Warner Bros.) More\n\nTeenage Mutant Ninja Turtles\n\nDuring the climactic battle on Planet Doom, we see four kids “fighting” in the streets before revealing their avatars to be the 2014 cinematic versions of the world’s most fearsome fighting team, those green heroes in a half-shell: Leonardo, Donatello, Michelangelo, and Raphael, who first appeared in 1984.\n\nTerminator 2: Judgment Day\n\nJust before Aech’s Iron Giant avatar sinks into the molten lava on Planet Doom, she gives a Parzival a thumbs-up reminiscent of the T-800’s goodbye to John Connor in James Cameron’s 1991 sequel. Fortunately, like the Arnie’s T-800, Aech will be back.\n\nThundercats\n\nLike many kids in the ’80s, Parzival wears a belt featuring the Eye of Thundera from the 1985-89 animated series. Unfortunately, he never gets the chance to let the Thundercats loose (doot doot).\n\nTomb Raider\n\nLara Croft first made waves in the video-game universe in 1996, and since then she’s appeared in 18 games and a trio of feature films. In a world as video-game-centric as the OASIS, it should come as little surprise that someone would be using her avatar in 2045.\n\n2001: A Space Odyssey\n\n“Open the pod bay doors, HAL!” someone certainly shouted when they saw the Discovery One’s EVA pod in Aech’s workshop.\n\nUncharted\n\nNathan Drake, the hero from PlayStation’s Indiana Jones-esque adventure game series, has a blink-and-you-miss-it cameo as an OASIS avatar\n\nUltrabots\n\nIf you look closely during the Planet Doom battle, you can see one the scorpions from this 1993 PC game using its stingers on the IOI army.\n\nWar of the Worlds\n\nSorrento and I-R0k’s first meeting on Planet Doom is held next to a downed Martian ship, but not the one from Spielberg’s 2005 adaptation of the H.G. Wells novel. Instead, the green flying wing design comes from the 1953 Bryon Haskin classic.\n\nWilly Wonka and the Chocolate Factory\n\nErnie Cline has described his book and movie thusly: “If Willy Wonka was a video-game designer instead of a candy maker and he held his golden ticket contest inside the world’s greatest video game — that’s the essence of what the story is.” Indeed, the trailers and the film soundtrack feature an electronic cover of “Pure Imagination,” the Gene Wilder-warbled tune from the classic film.\n\nWonder Woman\n\nThe fighting Amazon isn’t seen onscreen, but Aech wears patches featuring Diana Prince’s iconic WW symbol.\n\nRead more from Yahoo Entertainment:", "images": ["https://s.yimg.com/ny/api/res/1.2/ZF6UeRxKwBkb82kYBf_4AA--~A/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/bb0f5cb023f756d194b274c246e3d71c", "https://s.yimg.com/ny/api/res/1.2/iJ3wy2_4FdMHuwYtddXTgA--~A/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/ec535cac3e6308ee955e195ebfea7d51", "https://s.yimg.com/ny/api/res/1.2/lUaHMKbkvqL_uLwN5n1gpg--~A/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/d78611412ac2be64c470886a84e0a02d", "https://s.yimg.com/ny/api/res/1.2/slETBftKgzoDOhsnJsN0og--~A/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/4ae98fb703a6a09829d06599a1472727", "https://s.yimg.com/uu/api/res/1.2/oUfUkHpd97ZUqmOX2XS9tQ--~B/aD0yNjAxO3c9MzkwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/9fed7cacdfe2997437069730a3fd1ac9", "https://s.yimg.com/ny/api/res/1.2/PCROomzXRrnUDN_Su8DtdQ--~A/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/fe763422fad1307fd96b732fecb9ffe4", "https://s.yimg.com/ny/api/res/1.2/67oPTVNNE2Vq87JAeXz6oQ--~A/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/9fed7cacdfe2997437069730a3fd1ac9", "https://s.yimg.com/ny/api/res/1.2/6IdjghXoEZDCrDTPdGlJZQ--~A/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/0281e10c4f30f44ef6a0069a8782041e", "https://s.yimg.com/ny/api/res/1.2/eTXqXjkuP_eV2sT4GV3c7A--~A/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/d5f2874d302c31fb925be9e995204c03", "https://s.yimg.com/ny/api/res/1.2/o0hd5HUXkDHJIy5mqGMLyQ--~A/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/688f84bea32def6aa7cf85c7424e8d3c", "https://s.yimg.com/g/images/spaceball.gif", "https://s.yimg.com/ny/api/res/1.2/p2FDK28nH7SZWGjE87sL0Q--~A/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODQ7aD04NDtpbD1wbGFuZQ--/https://s.yimg.com/cv/apiv2/plogos/yentlogo_jelly_small.jpg", "https://s.yimg.com/ny/api/res/1.2/8S7l9eth.PK3DLT_u7NKvw--~A/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/70864037d3ef0f325322b19add17117b", "https://s.yimg.com/ny/api/res/1.2/hVobBDz91tJVfdnTt.6itQ--~A/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/ac96d6702b82cd57e4dd477ff5f3db43"], "top_img": "https://s.yimg.com/uu/api/res/1.2/oUfUkHpd97ZUqmOX2XS9tQ--~B/aD0yNjAxO3c9MzkwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/9fed7cacdfe2997437069730a3fd1ac9", "keywords": [], "authors": ["Yahoo Movies Editorial"], "canonical_link": "https://www.yahoo.com/entertainment/ready-player-one-ultimate-guide-pop-culture-references-173907937.html", "title": "'Ready Player One': Your ultimate guide to all the pop-culture references", "meta_data": {"oath": {"guce": {"consent-host": "guce.yahoo.com"}}, "msapplication-TileColor": "#6e329d", "msapplication-TileImage": "https://s.yimg.com/rz/p/yahoo_frontpage_en-US_s_f_w_bestfit_frontpage.png", "msvalidate.01": "A9862C0E6E1BE95BCE0BF3D0298FD58B", "referrer": "unsafe-url", "theme-color": "#400090", "twitter": {"dnt": "on", "site": "@YahooEnt", "card": "summary_large_image", "description": "Our A-Z guide to all the inside jokes, Easter eggs, and nostalgic callbacks in Steven Spielberg's latest movie.", "image": {"identifier": "https://s.yimg.com/uu/api/res/1.2/oUfUkHpd97ZUqmOX2XS9tQ--~B/aD0yNjAxO3c9MzkwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/9fed7cacdfe2997437069730a3fd1ac9", "src": "https://s.yimg.com/uu/api/res/1.2/oUfUkHpd97ZUqmOX2XS9tQ--~B/aD0yNjAxO3c9MzkwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/9fed7cacdfe2997437069730a3fd1ac9"}, "title": "'Ready Player One': Your ultimate guide to all the pop-culture references"}, "application-name": "Yahoo Entertainment", "news_keywords": "Ready Player One, Wade Watts, Steven Spielberg, Ernest Cline, James Halliday, Robert Zemeckis, Warner Bros., OASIS, Parzival, Tye Sheridan", "apple-itunes-app": "app-id=304158842,app-argument=yahoo://article/view?uuid=9acc0aae-9754-31b9-b889-100bee0a2d53&src=web", "description": "Our A-Z guide to all the inside jokes, Easter eggs, and nostalgic callbacks in Steven Spielberg's latest movie.", "og": {"type": "article", "image": "https://s.yimg.com/uu/api/res/1.2/oUfUkHpd97ZUqmOX2XS9tQ--~B/aD0yNjAxO3c9MzkwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/9fed7cacdfe2997437069730a3fd1ac9", "description": "Our A-Z guide to all the inside jokes, Easter eggs, and nostalgic callbacks in Steven Spielberg's latest movie.", "title": "'Ready Player One': Your ultimate guide to all the pop-culture references", "url": "https://www.yahoo.com/entertainment/ready-player-one-ultimate-guide-pop-culture-references-173907937.html"}, "fb": {"pages": 73756409831, "app_id": 458584288257241}, "al": {"android": {"app_name": "Yahoo", "package": "com.yahoo.mobile.client.android.yahoo", "url": "yahoo://article/view?uuid=9acc0aae-9754-31b9-b889-100bee0a2d53&src=web"}, "ios": {"app_name": "Yahoo", "app_store_id": 304158842, "url": "yahoo://article/view?uuid=9acc0aae-9754-31b9-b889-100bee0a2d53&src=web"}}}, "movies": [], "publish_date": 1522431547.0, "source": "https://www.yahoo.com", "summary": ""}