{"url": "https://www.elle.com/culture/celebrities/advice/a40265/oprah-life-lessons/", "text": "Sometimes, the universe reaches out to you in mysterious ways. Your Uber account is credited $50. A real live human answers when you dial for customer service. A secret admirer sends your co-worker a dozen Cronuts, and she wants to share. You refresh your inbox and between the spam and the million Bed, Bath & Beyond emails, you find this: \"Master Class: Oprah - Tuesday, October 25 @ 11:30am.\"\n\nWhen the cosmos rewards you beyond your wildest dreams, you do not wait. Reader, you do not wait for the rest of the missive to materialize in your browser. You do not wait for your boss to forward it to you, wanting to know: \"MK u up for this!?\" You do not wait to check your calendar. You RSVP. Because when a goddess, a titan, the bespectacled answer to all the prayers you didn't even know you'd offered up to the heavens above graces the Hearst Tower and invites you to witness it, you do not hesitate.\n\n\"Clear my schedule!\" you cry, except you don't because you're in a crowded area and have no prior engagements, anyway. \"I'm gonna meet Oprah!\"\n\nFor the next hour, Oprah gave out wisdom like free cars.\n\nOf course, I didn't. Meet her, that is. I didn't even see her—not really.\n\nDespite the fact that I went downstairs to wait in line a full 20 minutes before attendees were supposed to even be allowed to assemble, I found a crowd triple the size of the theater had already gathered by the time I arrive.\n\nA kindly gent let me know that some people had started to hover around 8:30 a.m., pretending to sip coffees on the couches until they were allowed to queue up. At this point, hundreds had trickled in. \"They're streaming on Facebook Live,\" a fellow traveler said. So, I raced up to my desk and plugged in my headphones.\n\n\"Don't @ me!\" I cried, except I didn't, because that doesn't exactly make sense and everyone knew I was in a deep state of focus, anyway. \"I'm gonna watch Oprah!\"\n\nAnd I did.\n\nFor the next hour, Oprah gave out wisdom like free cars. She talked disappointment, success, power, and positivity. She copped to bad hair and a bubble bath obsession. She out Kondo'd Marie. She out Jobs'd Steve. She smized so hard Tyra probably shivered a little. And by the time it was over, she'd gobbled up all the advice I've ever been given, tied it in a bow with her teeth, and handed it back to me. It was so impressive, so awesome that I may have blacked out a little. But then I came to and wrote down her seven best lessons so that you, too, can glimpse the divine. Here goes.\n\nStop dreaming\n\nWhen Oprah was in her early thirties, she gave up on dreams. That's crazy, you say. It can't be! But it is. \"I stopped dreaming my own dreams,\" she said, \"and realized that God or whatever name you use for God—that energy forcefield in your life, that which is greater than yourself...whatever name you use—I realized that I would be more powerful if I stepped into the dream that creation had for me. I stopped dreaming and I allowed myself to be in the dream that God...had for me. And my life opened up and changed.\"\n\n\"You think this is a masterclass? Your entire life is a class.\"\n\nListen, people. Life isn't always going to be a walk in the park, and Oprah gets it. Sometimes, it's hard. Sometimes, it feels like it might break you. But it won't. You can survive it! All that bad stuff that seems like setbacks are opportunities. Let Oprah explain: \"Everything that is happening to you is also happening for you. You think this is a masterclass? Your entire life is a class and every choice and thought you've ever made is a part of a life lesson that is your class here on earth.\"\n\nNo one can threaten your power (unless you're an egotistical maniac)\n\nGreat news! According to Oprah, your power is pretty much absolute. No matter who you are or what you do, you own your power and there isn't a loser on this green earth who can diminish it. Unless!\n\n\"If you feel your power is threatened, it means your ego has risen to a point in which you think you can be threatened,\" said Oprah. \"Nothing that is truly real inside yourself can ever be threatened, because you never lose your power. You are powerful.\"\n\nYou don't need anyone else's advice, assuming you've listened to Oprah's\n\n\"When you have to ask someone, 'What should I do?' you haven't checked in with yourself,\" Oprah, O, Wise One, said. \"Whether it's a dress or shoes, a man, a house, or a career, check in with yourself. You are the authority. Get still enough that you can feel the answer or the answer will just show up. You will read it in a newspaper or the TV will be on, and someone will say something. You will be led to it with forces greater than yourself.\"\n\n\"You cannot hear the still, small voice of your instinct, your intuition, what some people call God, if you allow the noise of the world to drown it out\"\n\nSounds nice, no? A piece of cake! Simple! Not so fast. This isn't 'Hocus Pocus', okay? You've got to do the work.\n\n\"You cannot hear the still, small voice of your instinct, your intuition, what some people call God, if you allow the noise of the world to drown it out,\" she said. So, shut out the haters and the well-wishers and the sales clerk who thinks that dress is \"so versatile.\"\n\nYou decide.\n\nYou only have one purpose here\n\nFor Oprah, \"the whole point of being known or famous or a celebrity or whatever\" is to make it clear \"that it's possible.\" What does that mean, you may be wondering. Well, let Oprah finish! \"When you see someone else do something that seems daring, it speaks to you. It says, 'Oh, this is possible.'\" The truth is that \"at the core of us, we really are all the same,\" Oprah said. And so when you see, say, Barbra Streisand in concert or Cynthia Erivo in the flesh, you see someone \"who's allowing for the fullest expression of themselves.\"\n\n\"I know the common denominator in the human experience is that you want the same thing that I want,\" Oprah said. \"I'm still striving for that—what is the fullest expression of my being, my being, of my humanness, of the essence of who I am, [and] how do I do that?\"\n\n\"I've interviewed so many thousands of people,\" Oprah reminded us, as if we needed to be reminded. \"And I know for sure that the biggest regret of anybody's life is not fully living it. You get to the end of your days, and you realize you had this opportunity, you had this life...and did you every day live it the fullest? Did you maximize it? Did you live on full blast? Was the volume turned up every day of your life? You don't want to get to the end and look at all those days you wasted worrying. So now I don't worry about anything anymore. I don't.\"\n\nLanguage matters\n\nGather round, kids, and let Oprah tell you a little tale about struggle. When Oprah first launched OWN, it didn't go so well. Back in 2013, she said it did so badly she had a nervous breakdown. So, how did she turn it around? Listen closely.\n\n\"When I was [in] my deepest struggle with OWN, the network, that's probably the saddest I've ever been, the most troubled I've ever been,\" she said. \"And then I realized it was the language I was giving myself. I was calling it a struggle, a struggle a struggle. And I turned my own narrative around. I started speaking to myself differently about it. I stopped saying, 'Oh, it's a struggle, it's a struggle.' I started thinking, 'Wow, I am still me. I'm still this little black girl raised in Mississippi. I've come all the way from the porch in Mississippi to have a network with my name on it. What's a struggle about that? How do I turn that into and see it as an opportunity? It's a challenging opportunity, but it's an opportunity. And that's when everything started to shift.\"\n\nOprah said she \"feels good\" now that the network is in a better place and the home of hit shows like Queen Sugar. \"But here's the thing,\" she added, \"Even when I was in the worst of it, there's a wonderful spiritual that says, 'Trouble don't last always.' Even in the midst of it, I knew it wouldn't last.\"\n\nOh, she knew. You know she knew.\n\nGet yourself a pal like Gayle\n\nOprah loves to chat about Gayle. She must have mentioned Gayle 25 times in the first 45 minutes of her interview. But, like, of course, she did! A pal like Gayle is rare! She needs to be treasured. When she visits the school she founded in Africa, she teaches the students for a week. Get ready for this, people. She's titled it—I kid you not—\"Life 101.\" Yes, she did.\n\n\"I try to teach in one week everything I wish someone had told me before I went out into the world,\" she said. \"And one of the things I always talk about is my friendship with Gayle.\" Because no matter who you are or how famous you get, you \"want a friend who cares as much about you as they do themselves. You want a friend like Auntie Gayle—which is what they call her—who in all of our entire friendship I can honestly say there's never been a jealous moment.\"\n\nLike you, Oprah has always been able to tell if she has a friend \"who isn't 100 percent there for you.\" And she doesn't have time for her!\n\nAnd reader, why should she? She's Oprah.", "images": ["https://hips.hearstapps.com/ell.h-cdn.co/assets/16/43/1600x800/landscape-1477426007-elle-hearst-oprah.jpg?resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/ell.h-cdn.co/assets/16/43/1600x800/landscape-1477426007-elle-hearst-oprah.jpg?resize=1200:*", "keywords": [], "authors": ["Mattie Kahn", "Mattie Kahn Is A Writer Who Lives In New York."], "canonical_link": "https://www.elle.com/culture/celebrities/advice/a40265/oprah-life-lessons/", "title": "I Gave Oprah One Hour, and She Gave Me a Whole New World", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "I Gave Oprah One Hour, and She Gave Me a Whole New World", "description": "Here, 7 life-changing lessons from the goddess.", "url": "https://www.elle.com/culture/celebrities/advice/a40265/oprah-life-lessons/", "image": {"identifier": "https://hips.hearstapps.com/ell.h-cdn.co/assets/16/43/1600x800/landscape-1477426007-elle-hearst-oprah.jpg?resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "modified_time": "2017-10-11 03:51:54", "published_time": "2016-10-25 08:23:00", "section": "Celebrity News 2020", "opinion": "false"}, "twitter": {"site": "@ELLEmagazine", "card": "summary_large_image", "image": "https://hips.hearstapps.com/ell.h-cdn.co/assets/16/43/1600x800/landscape-1477426007-elle-hearst-oprah.jpg?resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "Oprah Winfrey's Master Class - Guide to Living Your Best Life", "description": "I gave Oprah one hour, and she gave me the world.", "keywords": "oprah", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/ell.h-cdn.co/assets/16/43/980x980/square-1477426007-elle-hearst-oprah.jpg?resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Culture,culture,celebrities,Oprah", "sailthru.date": "2016-10-25T20:23:00Z", "sailthru.image.full": "https://hips.hearstapps.com/ell.h-cdn.co/assets/16/43/1600x800/landscape-1477426007-elle-hearst-oprah.jpg", "sailthru.image.thumb": "https://hips.hearstapps.com/ell.h-cdn.co/assets/16/43/980x980/square-1477426007-elle-hearst-oprah.jpg", "sailthru.socialtitle": "I Gave Oprah One Hour, and She Gave Me a Whole New World", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1477354980.0, "source": "https://www.elle.com", "summary": ""}