{"url": "https://www.independent.co.uk/news/world/americas/steven-seagal-sexual-harassment-women-tape-audio-comments-dirty-a8016361.html", "text": "Actor Steven Seagal has been caught on tape calling female reporters “c***suckers” and “a bunch of f***ing dirty whores” in leaked tapes.\n\nThe 65-year-old, who is facing several sexual harassment allegations, can be heard ranting to a male interviewer about female journalists in audio clips obtained by the Daily Mail.\n\n“Well, I found that interestingly enough, the few times that I had a hard time, it was usually with women,” the actor said in the clip captured while Seagal was promoting his 1988 film Above the Law.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\n“When somebody is on tour, a promotional tour, he’s there to talk about his film, not about who he’s f***ed or who he would like to f*** or who his wife was with ten years ago.\n\n“They should go into pornography or something else instead of journalism if they want to hear that s***. They’re a bunch of a**holes,” he continued.\n\nThe actor goes on to recall a time a female reporter wrote false and discriminating stories about him after she “pretended like she was in love.”\n\n“If I ever see her again, I’ll tell her to her face, I think she belongs in a zoo,” he said. “Bunch of f***ing dirty whores!”\n\n“You sit down with this sweet little nice girl and she seems to adore you and all this and that, and you're a perfect gentleman, and you know, unbelievable.\n\n“The way you combat is by let's not ever do an interview again to show these c***suckers,” he said.\n\nIn the wake of the Harvey Weinstein scandal, a number of women have come forward with allegations of sexual harassment against Mr Seagal.\n\nShape Created with Sketch. World news in pictures Show all 50 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. World news in pictures 1/50 18 April 2020 People shout at police officers during a demonstration of conspiracy theorists as other demonstrators protest against the lockdown imposed to slow the spread of the coronavirus in Berlin Reuters 2/50 17 April 2020 A pair of rare morepork owl chicks have become the first in more than a decade to survive on Norfolk Island, in the South Pacific Parks Australia/Monash University 3/50 16 April 2020 A squirrel runs across a fence as the sun shines in Berlin's Kreuzberg district AFP via Getty Images 4/50 15 April 2020 Election officials during vote counting at a ballot counting station after voting in the general elections was closed in Seoul, South Korea EPA 5/50 14 April 2020 Notre-Dame Cathedral in Paris, which was damaged in a devastating fire one year ago today Reuters 6/50 13 April 2020 Wild bluebells, which bloom around mid-April turning the forest blue as they form a carpet, are pictured in the Hallerbos in Belgium Reuters 7/50 12 April 2020 Pope Francis delivers his Urbi et Orbi message following Easter Sunday Mass behind closed doors at St. Peter's Basilica in The Vatican, during the country's lockdown aimed at curbing the spread of the COVID-19 infection VATICAN MEDIA/AFP via Getty 8/50 11 April 2020 A man watches Krakatau spewing ash during an eruption, in Serang, Indonesia's Banten province AFP via Getty 9/50 10 April 2020 Women queue for distribution of food for those suffering under Kenya's coronavirus-related movement restrictions AP 10/50 9 April 2020 Firefighter Sittiporn Singthong, dressed up as Spider-Man, sprays disinfectant at the Wat Tha Mai Buddhist temple in Samut Sakhon province, Thailand EPA 11/50 8 April 2020 Tulip fields in Plomeur, western France AFP via Getty 12/50 7 April 2020 A employee and a resident of the house for the elderly \"De Ravenstein\" react as nurses dance and sing in the garden, following the coronavirus disease outbreak, in Boortmeerbeek, Belgium Reuters 13/50 6 April 2020 A man stands in the balcony of his home with the moon in the background in Cali, Colombia AFP via Getty 14/50 5 April 2020 A man holds a traditional lamp from the balcony of his house as torches and candles illuminate houses and high rise residential buildings as Indians mark the country's fight against the coronavirus pandemic a suburb of New Delhi, India AP 15/50 4 April 2020 Medical staff load an infected patient into an ambulance at the Nimes air base, south of France, during an evacuation operation from the hard-hit east of the country where hospitals are overwhelmed AFP 16/50 3 April 2020 A man prays inside the closed Moussawi Grand Mosque in Basra AFP via Getty 17/50 2 April 2020 A City Hall health official wearing a protective suit sprays disinfectant at the entrance of City One condominium as the residential building was placed under lockdown after 17 cases of COVID-19 were detected, in Kuala Lumpur, Malaysia EPA 18/50 1 April 2020 Migrant workers wait on marked areas on the ground to maintain social distancing as they queue to receive food packets at an industrial area during a government-imposed nationwide lockdown as a preventive measure against the Covid-19 coronavirus, in Chennai AFP via Getty 19/50 31 March 2020 Wedding dress and evening wear designer Friederike Jorzig adjusts a mannequin wearing a wedding dress with matching protective mask in her store Chiton in Berlin AFP via Getty 20/50 30 March 2020 A stray dog walks in front of an empty historic India Gate, as nationwide lockdown continues over the coronavirus in New Delhi, India Getty 21/50 29 March 2020 A man watches a TV screen showing a file image of North Korea's missile launch during a news program at the Seoul Railway Station in Seoul AP 22/50 28 March 2020 Hong Kong's skyline is seen with some of its lights turned off to mark the Earth Hour, an environmental campaign AFP/Getty 23/50 27 March 2020 Ukrainian citizens queue at the Polish-Ukrainian border during the coronavirus pandemic in Korczowa, Poland. On 13 March, Poland closed its borders due to the ongoing pandemic of the Covid-19 and has extended the measure until at least 11 April EPA 24/50 26 March 2020 Tenon hospital emergency services staff members gesture during a break, on March 26, 2020 in Paris, as the country is under lockdown to stop the spread of Covid-19 disease caused by the novel coronavirus. AFP via Getty 25/50 25 March 2020 Aerial view showing almost empty streets in Bogota, taken during the lockdown ordered by the government to fight the spread of the novel coronavirus AFP via Getty 26/50 24 March 2020 Staff members line up to attention as they prepare to spray disinfectant at Wuhan Railway Station. China announced that a lockdown would be lifted on more than 50 million people in central Hubei province where the Covid-19 coronavirus first emerged late last year AFP via Getty 27/50 23 March 2020 A public order agency officer sprays disinfectant over a woman before she enters a local government office as a precautionary move against the spread of the Covid-19 coronavirus in Surabaya AFP via Getty 28/50 22 March 2020 Boys wearing protective and N95 masks play with a football outside their homes in Gaza City AFP via Getty 29/50 21 March 2020 A woman standing on her balcony reaches out to catch a rose delivered to her via a drone on Mother's day, in the Lebanese coastal city of Jounieh, north of the capital Beirut, as people remain indoors in an effort to limit the spread of coronavirus. In a quiet Lebanese town under lockdown over the novel coronavirus, a drone buzzed towards a balcony on Saturday to deliver a red rose to a mother grinning in surprise. The COVID-19 pandemic may have put a damper on Mother's Day this year, but three students have come up with a novel service to celebrate the occasion without flouting social distancing restrictions AFP via Getty 30/50 20 March 2020 Newlyweds Diego Fernandes, 46 and Deni Salgado, 30, kiss through protective face masks at a wedding ceremony with only witnesses and no guests, as public gatherings are banned as part of Italy's lockdown measures to prevent the spread of coronavirus disease in Naples Reuters 31/50 19 March 2020 Members of a medical assistance team from Jiangsu province chant slogans at a ceremony marking their departure after helping with the Covid-19 coronavirus recovery effort, in Wuhan. Medical teams from across China began leaving Wuhan this week after the number of new coronavirus infections dropped. China on reported no new domestic cases for the first time since it started recording them in January, but recorded a spike in infections from abroad AFP via Getty 32/50 18 March 2020 Sri Lankan police wear face masks a rehearsal parade in Colombo AFP via Getty 33/50 17 March 2020 Divers clean and swipe the floor and walls of a pool at an aquatic complex in Medellin after the closure of all sporting venues in Colombia as a preventive measure against the spread of the Covid-19 AFP via Getty 34/50 16 March 2020 Workers spray disinfectant as a precaution against the spread of coronavirus at the Mubarikiya market following the outbreak of coronavirus, in Kuwait City EPA 35/50 15 March 2020 People gather with their belongings at the scene of the fire outbreak at Abule-Ado in Lagos, Nigeria Reuters 36/50 14 March 2020 A man feeds pidgeons at Cataluna Square in Barcelona EPA 37/50 13 March 2020 A mosso de esquadra police officer stands on the closed off road near Igualada, Spain. Over 60,000 people awoke Friday in four towns near Barcelona confined to their homes and with police blocking roads. The order by regional authorities in Catalonia is Spain's first mandatory lockdown as Covid-19 coronavirus infections increase sharply AP 38/50 12 March 2020 Italian mechanics Giacomo and Alessandro pose at their garage in Rome, as Italy shut all stores except for pharmacies and food shops in a desperate bid to halt the spread of a coronavirus that has killed 827 in the the country in just over two weeks AFP via Getty 39/50 11 March 2020 Monks pray for victims of the 2011 earthquake and tsunami disaster during a memorial service on the coast in Iwaki, Fukushima. Japan marked the ninth anniversary of the killer tsunami that triggered the Fukushima nuclear meltdown, but fears about the new coronavirus forced a scaling back of public commemorations Jiji Press/AFP via Getty 40/50 10 March 2020 Revellers dance as they celebrate Holi, the spring festival of colours in Allahabad AFP/Getty 41/50 9 March 2020 Medical staff celebrate after all patients were discharged at a temporary hospital set up to treat people with the COVID-19 coronavirus in Wuhan in China AFP/Getty 42/50 8 March 2020 A hundred members of the conservative activist group called Manif pour Tous (\"Protest for Everyone\") dressed as Marianne, French Republic's allegory, stage a protest against assisted reproductive technology (ART) and surrogacy in front of the National Assembly in Paris, France AFP/Getty 43/50 7 March 2020 A migrant man runs away as another one takes cover behind a bin as Greek police use water cannons to block them trying to break fences in the Turkey-Greece border province of Edirne AFP/Getty 44/50 6 March 2020 Police and forensic experts inspect the scene of an explosion near the US embassy in Tunis, the capital of Tunisia AFP/Getty 45/50 5 March 2020 Migrants prepare for the coming night in a forest in the buffer zone at the Turkey-Greece border a crossing point AFP/Getty 46/50 4 March 2020 A migrant rests with a child in his arms next to the Tunca river in Edirne, Turkey Reuters 47/50 3 March 2020 Spanish policemen and civil guards sporting Guy Fawkes masks protest in front of Spanish policemen standing guard during a demonstration to demand fair wages in Madrid AFP via Getty 48/50 2 March 2020 South Korean soldiers wearing protective gear spray disinfectant as part of preventive measures against the spread of the COVID-19 coronavirus, at a market in Daegu Yonhap/AFP via Getty 49/50 1 March 2020 A woman shouts as law enforcement officials move in to disperse a group of immigrants who had occupied a historic church and a square. They are demanding to be moved to another country as they claim to feel not safe because of xenophobic attacks in central Cape Town, South Africa Reuters 50/50 29 February 2020 Greek border guard use teargas to push back migrants who try to enter Greece at the Pazarkule border gate in Edirne, Turkey AP 1/50 18 April 2020 People shout at police officers during a demonstration of conspiracy theorists as other demonstrators protest against the lockdown imposed to slow the spread of the coronavirus in Berlin Reuters 2/50 17 April 2020 A pair of rare morepork owl chicks have become the first in more than a decade to survive on Norfolk Island, in the South Pacific Parks Australia/Monash University 3/50 16 April 2020 A squirrel runs across a fence as the sun shines in Berlin's Kreuzberg district AFP via Getty Images 4/50 15 April 2020 Election officials during vote counting at a ballot counting station after voting in the general elections was closed in Seoul, South Korea EPA 5/50 14 April 2020 Notre-Dame Cathedral in Paris, which was damaged in a devastating fire one year ago today Reuters 6/50 13 April 2020 Wild bluebells, which bloom around mid-April turning the forest blue as they form a carpet, are pictured in the Hallerbos in Belgium Reuters 7/50 12 April 2020 Pope Francis delivers his Urbi et Orbi message following Easter Sunday Mass behind closed doors at St. Peter's Basilica in The Vatican, during the country's lockdown aimed at curbing the spread of the COVID-19 infection VATICAN MEDIA/AFP via Getty 8/50 11 April 2020 A man watches Krakatau spewing ash during an eruption, in Serang, Indonesia's Banten province AFP via Getty 9/50 10 April 2020 Women queue for distribution of food for those suffering under Kenya's coronavirus-related movement restrictions AP 10/50 9 April 2020 Firefighter Sittiporn Singthong, dressed up as Spider-Man, sprays disinfectant at the Wat Tha Mai Buddhist temple in Samut Sakhon province, Thailand EPA 11/50 8 April 2020 Tulip fields in Plomeur, western France AFP via Getty 12/50 7 April 2020 A employee and a resident of the house for the elderly \"De Ravenstein\" react as nurses dance and sing in the garden, following the coronavirus disease outbreak, in Boortmeerbeek, Belgium Reuters 13/50 6 April 2020 A man stands in the balcony of his home with the moon in the background in Cali, Colombia AFP via Getty 14/50 5 April 2020 A man holds a traditional lamp from the balcony of his house as torches and candles illuminate houses and high rise residential buildings as Indians mark the country's fight against the coronavirus pandemic a suburb of New Delhi, India AP 15/50 4 April 2020 Medical staff load an infected patient into an ambulance at the Nimes air base, south of France, during an evacuation operation from the hard-hit east of the country where hospitals are overwhelmed AFP 16/50 3 April 2020 A man prays inside the closed Moussawi Grand Mosque in Basra AFP via Getty 17/50 2 April 2020 A City Hall health official wearing a protective suit sprays disinfectant at the entrance of City One condominium as the residential building was placed under lockdown after 17 cases of COVID-19 were detected, in Kuala Lumpur, Malaysia EPA 18/50 1 April 2020 Migrant workers wait on marked areas on the ground to maintain social distancing as they queue to receive food packets at an industrial area during a government-imposed nationwide lockdown as a preventive measure against the Covid-19 coronavirus, in Chennai AFP via Getty 19/50 31 March 2020 Wedding dress and evening wear designer Friederike Jorzig adjusts a mannequin wearing a wedding dress with matching protective mask in her store Chiton in Berlin AFP via Getty 20/50 30 March 2020 A stray dog walks in front of an empty historic India Gate, as nationwide lockdown continues over the coronavirus in New Delhi, India Getty 21/50 29 March 2020 A man watches a TV screen showing a file image of North Korea's missile launch during a news program at the Seoul Railway Station in Seoul AP 22/50 28 March 2020 Hong Kong's skyline is seen with some of its lights turned off to mark the Earth Hour, an environmental campaign AFP/Getty 23/50 27 March 2020 Ukrainian citizens queue at the Polish-Ukrainian border during the coronavirus pandemic in Korczowa, Poland. On 13 March, Poland closed its borders due to the ongoing pandemic of the Covid-19 and has extended the measure until at least 11 April EPA 24/50 26 March 2020 Tenon hospital emergency services staff members gesture during a break, on March 26, 2020 in Paris, as the country is under lockdown to stop the spread of Covid-19 disease caused by the novel coronavirus. AFP via Getty 25/50 25 March 2020 Aerial view showing almost empty streets in Bogota, taken during the lockdown ordered by the government to fight the spread of the novel coronavirus AFP via Getty 26/50 24 March 2020 Staff members line up to attention as they prepare to spray disinfectant at Wuhan Railway Station. China announced that a lockdown would be lifted on more than 50 million people in central Hubei province where the Covid-19 coronavirus first emerged late last year AFP via Getty 27/50 23 March 2020 A public order agency officer sprays disinfectant over a woman before she enters a local government office as a precautionary move against the spread of the Covid-19 coronavirus in Surabaya AFP via Getty 28/50 22 March 2020 Boys wearing protective and N95 masks play with a football outside their homes in Gaza City AFP via Getty 29/50 21 March 2020 A woman standing on her balcony reaches out to catch a rose delivered to her via a drone on Mother's day, in the Lebanese coastal city of Jounieh, north of the capital Beirut, as people remain indoors in an effort to limit the spread of coronavirus. In a quiet Lebanese town under lockdown over the novel coronavirus, a drone buzzed towards a balcony on Saturday to deliver a red rose to a mother grinning in surprise. The COVID-19 pandemic may have put a damper on Mother's Day this year, but three students have come up with a novel service to celebrate the occasion without flouting social distancing restrictions AFP via Getty 30/50 20 March 2020 Newlyweds Diego Fernandes, 46 and Deni Salgado, 30, kiss through protective face masks at a wedding ceremony with only witnesses and no guests, as public gatherings are banned as part of Italy's lockdown measures to prevent the spread of coronavirus disease in Naples Reuters 31/50 19 March 2020 Members of a medical assistance team from Jiangsu province chant slogans at a ceremony marking their departure after helping with the Covid-19 coronavirus recovery effort, in Wuhan. Medical teams from across China began leaving Wuhan this week after the number of new coronavirus infections dropped. China on reported no new domestic cases for the first time since it started recording them in January, but recorded a spike in infections from abroad AFP via Getty 32/50 18 March 2020 Sri Lankan police wear face masks a rehearsal parade in Colombo AFP via Getty 33/50 17 March 2020 Divers clean and swipe the floor and walls of a pool at an aquatic complex in Medellin after the closure of all sporting venues in Colombia as a preventive measure against the spread of the Covid-19 AFP via Getty 34/50 16 March 2020 Workers spray disinfectant as a precaution against the spread of coronavirus at the Mubarikiya market following the outbreak of coronavirus, in Kuwait City EPA 35/50 15 March 2020 People gather with their belongings at the scene of the fire outbreak at Abule-Ado in Lagos, Nigeria Reuters 36/50 14 March 2020 A man feeds pidgeons at Cataluna Square in Barcelona EPA 37/50 13 March 2020 A mosso de esquadra police officer stands on the closed off road near Igualada, Spain. Over 60,000 people awoke Friday in four towns near Barcelona confined to their homes and with police blocking roads. The order by regional authorities in Catalonia is Spain's first mandatory lockdown as Covid-19 coronavirus infections increase sharply AP 38/50 12 March 2020 Italian mechanics Giacomo and Alessandro pose at their garage in Rome, as Italy shut all stores except for pharmacies and food shops in a desperate bid to halt the spread of a coronavirus that has killed 827 in the the country in just over two weeks AFP via Getty 39/50 11 March 2020 Monks pray for victims of the 2011 earthquake and tsunami disaster during a memorial service on the coast in Iwaki, Fukushima. Japan marked the ninth anniversary of the killer tsunami that triggered the Fukushima nuclear meltdown, but fears about the new coronavirus forced a scaling back of public commemorations Jiji Press/AFP via Getty 40/50 10 March 2020 Revellers dance as they celebrate Holi, the spring festival of colours in Allahabad AFP/Getty 41/50 9 March 2020 Medical staff celebrate after all patients were discharged at a temporary hospital set up to treat people with the COVID-19 coronavirus in Wuhan in China AFP/Getty 42/50 8 March 2020 A hundred members of the conservative activist group called Manif pour Tous (\"Protest for Everyone\") dressed as Marianne, French Republic's allegory, stage a protest against assisted reproductive technology (ART) and surrogacy in front of the National Assembly in Paris, France AFP/Getty 43/50 7 March 2020 A migrant man runs away as another one takes cover behind a bin as Greek police use water cannons to block them trying to break fences in the Turkey-Greece border province of Edirne AFP/Getty 44/50 6 March 2020 Police and forensic experts inspect the scene of an explosion near the US embassy in Tunis, the capital of Tunisia AFP/Getty 45/50 5 March 2020 Migrants prepare for the coming night in a forest in the buffer zone at the Turkey-Greece border a crossing point AFP/Getty 46/50 4 March 2020 A migrant rests with a child in his arms next to the Tunca river in Edirne, Turkey Reuters 47/50 3 March 2020 Spanish policemen and civil guards sporting Guy Fawkes masks protest in front of Spanish policemen standing guard during a demonstration to demand fair wages in Madrid AFP via Getty 48/50 2 March 2020 South Korean soldiers wearing protective gear spray disinfectant as part of preventive measures against the spread of the COVID-19 coronavirus, at a market in Daegu Yonhap/AFP via Getty 49/50 1 March 2020 A woman shouts as law enforcement officials move in to disperse a group of immigrants who had occupied a historic church and a square. They are demanding to be moved to another country as they claim to feel not safe because of xenophobic attacks in central Cape Town, South Africa Reuters 50/50 29 February 2020 Greek border guard use teargas to push back migrants who try to enter Greece at the Pazarkule border gate in Edirne, Turkey AP\n\nTV reporter Lisa Guerrero told the Hollywood Reporter the actor allegedly invited her to his home for a “private audition” in 1996.\n\nDaily coronavirus briefing No hype, just the advice and analysis you need Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nSuspicious of the invite, Ms Guerrero said she brought a female casting director with her.\n\nShe said Mr Seagal answered the door in a silk robe and although he never exposed himself to her or touched her, she said the actor told her she could have a bigger role if she returned for a “private rehearsal.”\n\nActress Rae Dawn Chong made similar claims in a blog The Wrap.", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2010/04/14/19/353359.bin", "https://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2010/04/14/19/353359.bin", "keywords": [], "authors": ["Lydia Smith"], "canonical_link": "https://www.independent.co.uk/news/world/americas/steven-seagal-sexual-harassment-women-tape-audio-comments-dirty-a8016361.html", "title": "Steven Seagal calls female reporters 'a bunch of f***ing dirty whores' in tape leaked amid sexual harassment claims", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "http://www.independent.co.uk/news/world/americas/steven-seagal-sexual-harassment-women-tape-audio-comments-dirty-a8016361.html", "title": "Steven Seagal calls female reporters a 'bunch of f***ing dirty whores' in leaked tape", "description": "Actor can be heard ranting to male interviewer about women in media", "updated_time": "2017-10-24T00:20:11+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2010/04/14/19/353359.bin", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/8016361"}, "description": "Actor Steven Seagal has been caught on tape calling female reporters “c***suckers” and “a bunch of f***ing dirty whores” in leaked tapes. The 65-year-old, who is facing several sexual harassment allegations, can be heard ranting to a male interviewer about female journalists in audio clips obtained by the Daily Mail.", "keywords": "Steven Seagal, Harvey Weinstein, harassment, Rae Dawn Chong, Lisa Guerrero, Daily Mail, Americas, World, News", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Steven Seagal", "published_time": "2017-10-24T00:20:11+01:00", "modified_time": "2017-10-24T00:20:11+01:00", "section": "Americas", "author_name": "Lydia Smith", "content_type": "story", "word_count": 397, "image_count": 1, "video_count": 0, "embed_count": 0, "internal_link_count": 4, "external_link_count": 3}, "twitter": {"title": "Steven Seagal calls female reporters a 'bunch of f***ing dirty whore…", "description": "Actor Steven Seagal has been caught on tape calling female reporters “c***suckers” and “a bunch of f***ing dirty whores” in leaked tapes. The 65-year-old, who is facing several sexual harassment", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1508800811.0, "source": "https://www.independent.co.uk", "summary": ""}