{"url": "https://www.bustle.com/p/when-does-the-bold-type-return-a-new-season-is-definitely-in-the-works-9966884", "text": "Any show about a group of young women thriving in their careers and leaning on each other for support during real-life challenges is almost guaranteed to be a win. Freeform’s funny (and often emotional) series The Bold Type has garnered a loyal fan base as it follows Jane (Katie Stevens), Kat (Aisha Dee), and Sutton’s (Meghann Fahy) career moves and personal drama in New York City. Season 2 wraps up on August 7 and fans are already wondering when does The Bold Type return for more hilarious incidents, workplace power moves, and refreshingly real drama.\n\nThere is no definitive premiere date for Season 3, but Freeform has debuted its previous two seasons during the summer months. So, fans can probably anticipate new episodes in June or July of 2019. TV Line actually confirmed Season 3 back in 2017 when the series announced its return for two more 10-episode seasons shortly after its first season, so it's coming. You'll just have to wait a year for it.\n\nAccording to the report, The Bold Type, which is based on former Cosmopolitan editor-in-chief Joanna Coles life, also brought in its current showrunner Amanda Lasher after the show's creator (Sarah Watson) had some creative differences with the network. The lengthy wait may seem like forever to dedicated fans, but they can take comfort in knowing that Season 3 filming is happening right now. Dee posted two hilarious clips for her Twitter followers to let them know that The Bold Type cast has reunited and are having too much fun on set. Dee poked fun at her co-star Fahy for sleeping between takes and “aggressively” consuming popcorn. Sounds like Sutton to me.\n\nPhilippe Bosse/Freeform\n\nDee's character Kat has become a fan-favorite as a woman of color who is navigating a relationship with Adena (ship name: Kadena) after coming to terms with her sexuality. But, it looks like their decision to make their relationship open may cause them to break up before Season 3 drops. This season finale promotional trailer shows a pretty tense moment between the pair and promises to take viewers on a wild ride.\n\nIn the clip, Kat says “I don’t know what you want” to a tearful and confused Adena. Meanwhile, Jacqueline may lose her spot as Scarlet’s editor-in-chief following her comments section snafu, among other things. Ryan, better known as Pinstripe (Dan Jeannotte), is seen declaring his love to Jane and leans in for a kiss after she says she already has a man (what are you doing girl?). And, Sutton is dealing with the news about her ex-boyfriend Richard’s (Sam Page) supposed engagement while she’s in Paris for Fashion Week.\n\nHow will this all end?! No one knows yet, but it’s going to be an emotional ride for all the main characters with major drama and a few possible “ships” sinking (please, don't let Kadena die) in the process. The finale’s action will set up what’s to come for Season 3 as this dynamic trio continues to navigate adulting. It can't come soon enough.", "images": ["https://imgix.bustle.com/uploads/image/2020/4/10/dff5cdc4-5cb3-417f-8ec2-588d449431ce-dickinson.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/8/1/1e86ba7d-81c4-4e87-9ad0-b6353458856d-149316_2584.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/10/7a79e53b-7560-4382-a527-bfd3dcc9f8ec-dtm_teasergrab3_rc2d.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/8/1/52461806-7d46-4b91-b264-f64c716c0799-149316_3203.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2018/8/1/957fa998-ca36-491a-9a1e-038790ca0257-fangirls1-2.png?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/6/85c45ddb-d7e4-41c5-b566-051d56a5691e-nup_189463_1076.JPG?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/8/1/1e86ba7d-81c4-4e87-9ad0-b6353458856d-149316_2584.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/11/9c1b2921-5a56-4683-a520-7447f5954b8c-getty-1204035354.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/8/1/1e86ba7d-81c4-4e87-9ad0-b6353458856d-149316_2584.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/when-does-the-bold-type-return-a-new-season-is-definitely-in-the-works-9966884", "title": "When Does 'The Bold Type' Return? A New Season Is Definitely In The Works", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/when-does-the-bold-type-return-a-new-season-is-definitely-in-the-works-9966884", "type": "article", "title": "Here's When You Can Expect 'Bold Type' Season 3", "description": "Any show about a group of young women thriving in their careers and leaning on each other for support during real-life challenges is almost guaranteed to be a win. Freeform’s funny (and often emotional) series The Bold Type has garnered a loyal fan…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/8/1/1e86ba7d-81c4-4e87-9ad0-b6353458856d-149316_2584.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Any show about a group of young women thriving in their careers and leaning on each other for support during real-life challenges is almost guaranteed to be a win. Freeform’s funny (and often emotional) series The Bold Type has garnered a loyal fan…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}