{"url": "www.harpersbazaar.com/celebrity/latest/a20094731/meghan-markle-engagement-ring-cost/", "text": "Meghan Markle and Prince Harry announced their engagement on November 27, 2017 in the sunken garden of Kensington Palace. The garden was dedicated to Princess Diana on the 20th anniversary of her death, and the couple shared their news with a global audience anxiously waiting for news on all things royal wedding. Now, with their wedding date of May 19th fast approaching, we're still not over it–and by it we mean them, their love, their story and...the ring.\n\nAccording to the couple's official engagement interview, Harry had the ring designed by Cleave and Company, the Queen's preferred jeweler, using an ethically-sourced center stone from Botswana, where he and Meghan he first vacationed and fell in love. Harry flanked the center stone with two round diamonds from a brooch that belonged to his mother, Princess Diana. In speaking about the design of the ring, Harry noted that his decision to incorporate his mother's stones was similar to William's choice to give Catherine a ring of his mother's, as both hoped to have her along in spirit for their life's next chapter. Said Harry, \"The little diamonds on either side are from my mother's jewelry collection to make sure that she's with us on this crazy journey together.\"\n\nGetty Images\n\nBut how much does a ring like Meghan's cost? And is it comparable to the price of the heirloom William gave to Kate? TIME reports that while many consider this particular piece to be \"priceless\" given its use of Diana's stones, a three-carat diamond like Meghan's could retail for as high as $200,000. If size was of the utmost importance, a three-carat diamond of lesser quality in color and clarity (but of the same cushion cut) could retail for as low as $80,000. While clarity, color, carat weight and cut are key factors in determining the price of any stone, odds are Harry chose a flawless stone for his future bride, leaving the price of the stone he sourced on the highest end of this sliding scale.\n\nGetty Images\n\nMeghan's stone was set on a yellow gold band, and flanked with two round stones of Diana's; TIME tapped Kathryn Money, VP of strategy and merchandising at Brilliant Earth, who estimated that the carat weight of the entire ring was likely 6.5 carats, with the center stone weighing in at around 5 carats on its own. And, according to Blue Nile's Amanda Winters, this ring likely retailed for somewhere around $300,000-$350,000, noting that the same style could be achieved for under $50,000 with lesser quality stones.\n\nTIME reports, \"Prince Harry is following the lead of his brother Prince William, who gave Kate Middleton the 18-carat sapphire and diamond ring that once belonged to his mother. That ring reportedly cost 28,000 British pounds (or around $37,307, using modern conversion rates) when Prince Charles bought it back in 1981,\" but according to Bustle, the ring's worth has drastically risen in value over time, and now comes in at an approximate £300,000 ($500,000) price tag. (Note: Both Bustle and The Evening Standard report that the Duchess of Cambridge's stone weighs in at 12-carats, rather than 18 per TIME).\n\nAlexi Lubomirski\n\nAccording to Bustle, who spoke with Grant Mobley, a gemologist and Director at Pluczenik, Markle's center stone is closer to 3-4 carats, with the side stones weighing in at around .75 carats each. With the understanding that the stones are flawless or close to, that math puts the ring closer to $200,000 in price, 2.5x less than the cost of the current market value of Catherine's ring. However, Mobley tells Bustle, \"Diamonds not only maintain their value over time but they actually appreciate in value, unlike laboratory grown diamonds that have recently emerged in the diamond marketplace,\" Notes the site, \"in other words, Markle's engagement ring could already be worth nearly as much as Middleton's rock, if not more.\" The Evening Standard echoes Bustle's size and price quote of Markle's stunning ring, marking its value at up to $200,000 per industry experts. While the royal family will never release the exact cost Prince Harry paid for the ring, any expert asked also agrees that this particular ring–market value, carat weight, cut, clarity and color aside–is priceless given its place in history and its use of diamonds that once belonged to Princess Diana.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-prince-harry-meghan-markle-embed-gettyimages-896535688-1524996108.jpg?crop=1.00xw:0.377xh;0,0.260xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-prince-harry-meghan-markle-embed-gettyimages-896535688-1524996108.jpg?crop=1.00xw:0.377xh;0,0.260xh&resize=1200:*", "keywords": [], "authors": ["Carrie Goldberg"], "canonical_link": "https://www.harpersbazaar.com/celebrity/latest/a20094731/meghan-markle-engagement-ring-cost/", "title": "How Much Does Meghan Markle's Engagement Ring Cost?", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#606060", "og": {"type": "article", "site_name": "Harper's BAZAAR", "title": "How Much Does Meghan Markle's Engagement Ring Cost?", "description": "Jewelry experts worldwide have differing opinions on the price–and whether Meghan's ring costs more than Kate's.", "url": "https://www.harpersbazaar.com/celebrity/latest/a20094731/meghan-markle-engagement-ring-cost/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-prince-harry-meghan-markle-embed-gettyimages-896535688-1524996108.jpg?crop=1.00xw:0.377xh;0,0.260xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "modified_time": "2018-05-15 06:31:44", "published_time": "2018-05-02 08:00:00", "section": "Celebrity News", "opinion": "false"}, "twitter": {"site": "@harpersbazaarus", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-prince-harry-meghan-markle-embed-gettyimages-896535688-1524996108.jpg?crop=1.00xw:0.377xh;0,0.260xh&resize=640:*"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "title": "Meghan Markle Engagement Ring Cost - How Much Does Meghan Markle's Engagement Ring Cost?", "description": "Jewelry experts worldwide have differing opinions on the price–and whether Meghan Markle's engagement ring costs more than Kate Middleton's.", "keywords": "royal engagement rings, meghan markle, meghan markle engagement ring, meghan markle engagement ring price, meghan markle engagement ring cost, royal wedding, royal engagement ring", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-prince-harry-meghan-markle-embed-gettyimages-896535688-1524996108.jpg?crop=1.00xw:0.751xh;0,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrity,celebrity,latest,engagement ring prices,Prince Harry,Meghan Markle,meghan markle engagement ring,engagement rings,royal wedding", "sailthru.date": "2018-05-02T08:00:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-prince-harry-meghan-markle-embed-gettyimages-896535688-1524996108.jpg?crop=1.00xw:0.377xh;0,0.260xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/hbz-prince-harry-meghan-markle-embed-gettyimages-896535688-1524996108.jpg?crop=1.00xw:0.751xh;0,0", "sailthru.socialtitle": "How Much Does Meghan Markle's Engagement Ring Cost?", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1525219200.0, "source": "http://www.harpersbazaar.com", "summary": ""}