{"url": "http://www.walkoffame.com/rupaul", "text": "RuPaul Andre Charles\n\nHollywood Chamber of Commerce Honors Rupaul with Star on the Hollywood Walk of Fame\n\nWatch the star ceremony as the Hollywood Chamber unveils the star for RuPaul below.\n\nThe Hollywood Chamber of Commerce proudly honored drag performer RuPaul with the 2,631st star on the Hollywood Walk of Fame on Friday, March 16, 2018 at 11:30 a.m. PDT. The star was dedicated in the category of Television at 6652 Hollywood Boulevard in front of the World of Wonder production office which produces the show “RuPaul’s Drag Race.”\n\n“RuPaul is a Ruvolutionary performer who brought the art of Drag into the American public eye and made it mainstream. We are proud to add this groundbreaking entertainer on our historic Hollywood Walk of Fame,” stated Ana Martinez, Producer of the Walk of Fame ceremonies.\n\nHelping Master of Ceremonies Leron Gubler, President & CEO of the Hollywood Chamber of Commerce unveil the star was actress Jane Fonda.\n\nThe Hollywood Chamber of Commerce which administers the popular star ceremonies encourages people who are unable to attend and fans around the world to watch the event exclusively on www.walkoffame.com.\n\nNamed one of Time Magazine’s 100 Most Influential People of 2017, RuPaul Charles is a renaissance performer who has created an unprecedented career over 35 years as an actor, model, singer, songwriter, television personality and author and notably, the most successful drag queen of all time.\n\nRuPaul was born and raised in San Diego and later moved to Atlanta where he Studied theatre at the North Atlanta School of Performing Arts.\n\nIn the mid-eighties, he settled in New York City where he became a popular fixture on the nightclub scene, earning himself the title: Queen of Manhattan. RuPaul's first prominent national exposure came in 1989 with a featuredrole dancing in the B52’s Love Shack music video.\n\nRuPaul achieved international fame with the release of the single, Supermodel (You Better Work), which was included on his debut album Supermodel of the World (1993).\n\nAs an actor, RuPaul has appeared in more than 50 films and television shows both in and out of drag including Crooklyn (1994), The Brady Bunch Movie (1995), To Wong Foo, Thanks for Everything! Julie Newmar (1995), But I'm a Cheerleader (1999), Hurricane Bianca (2016), the Comedy Central series Broad City (2017), and the Netflix original series Girlboss (2017).\n\nIn 1995, he became the first spokesperson for M.A.C Cosmetics, raising millions of dollars for the M.A.C AIDS Fund and becoming the first man to land a major cosmetics campaign.\n\nIn 1996, RuPaul landed a TV talk show on VH1, The RuPaul Show and taped over 100 episodes with co-host, Michelle Visage while simultaneously co-hosting a morning drive radio show on WKTU, also with Michelle Visage.\n\nAs a recording artist, RuPaul has co-written and co-produced 14 studio albums to date, including Foxy Lady (1996), Champion (2009), Glamazon (2011), Born Naked (2014), and American (2017).\n\nAs an author, RuPaul has published two books: Lettin' It All Hang Out (1995) and Workin' It! RuPaul's Guide to Life, Liberty, and the Pursuit of Style (2010).\n\nSince 2009, RuPaul has produced and hosted the reality competition series RuPaul's Drag Race, for which he received the Critics’ Choice award and two Primetime Emmy awards for best host. The series, currently on VH1, has changed thefaceof primetime, providinga consistent spotlight for theLGBTQ communityforten seasons and launched thecareers ofover 100contestantswho havebecome global stars dueto thesuccess of the show.\n\nRuPaul's Drag Racehas inspired several spin-off series, including RuPaul's Drag U and RuPaul's Drag Race: All Stars. RuPaul is also featured as a host on the seriesSkin Wars: Fresh Paint, Good Work, and Gay for Play Game Show Starring RuPaul.\n\nRuPaul currently hosts the weekly podcast What’s the Tee? with Michelle Visage on iTunes as well as the bi-annual convention: RuPaul’s DragCon.\n\n★★★\n\nABOUT THE HOLLYWOOD WALK OF FAME www.WalkOfFame.com\n\nThe Hollywood Walk of Fame is an internationally-recognized Hollywood icon. With approximately 24 star ceremonies annually broadcast around the world, the constant reinforcement provided to the public has made the Walk of Fame a top visitor attraction. The Hollywood Chamber of Commerce continues to add stars on the Walk of Fame as the representative of the City of Los Angeles. The Walk of Fame is a tribute to all of those who worked diligently to develop the concept and to maintain this world-class tourist attraction. The Walk of Fame is open to the public. No paid admission or assigned seating at star ceremonies.It is understood that the cost of installing a star on the Walk of Fame upon approval is $40,000 and the sponsor of the nominee accepts the responsibility for arranging for payment to the Hollywood Historic Trust, a 501(c)3 charitable foundation. The funds are used to pay for the creation/installation of the star and ceremony, as well as maintenance of the Walk of Fame. Download the official app for iPhones and Android devices at http://officialhollywoodwalkoffameapp.com\n\nFor more than 97 years, the Hollywood Chamber of Commerce has provided leadership, business development resources, networking, and government affairs programs and services to keep the Hollywood business and residential communities safe, relevant and economically vital. Jeff Zarrinnam, is the Chair of the Hollywood Chamber of Commerce Board of Directors 2017-18, and Leron Gubler is the President/CEO of the Hollywood Chamber of Commerce. For more information please visit www.hollywoodchamber.net.\n\nThe Hollywood Walk of Fame and the Hollywood Sign are registered trademarks of the Hollywood Chamber of Commerce.\n\n★\n\n#hollywoodwalkoffame #wofstargirl\n\nWe’re on Facebook too! Like us at Hollywood Walk of Fame\n\nFind your favorite star on the Hollywood Walk of Fame", "images": ["https://ntlxdvjbqv-flywheel.netdna-ssl.com/wp-content/uploads/2018/11/WoF-Logo-Final-400X221.png", "https://ntlxdvjbqv-flywheel.netdna-ssl.com/wp-content/uploads/2018/11/WoF-Favicon-32.png", "https://ntlxdvjbqv-flywheel.netdna-ssl.com/wp-content/uploads/2020/03/rupaul-star-2549.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E"], "top_img": "https://ntlxdvjbqv-flywheel.netdna-ssl.com/wp-content/uploads/2018/11/WoF-Favicon-32.png", "keywords": [], "authors": [], "canonical_link": "https://walkoffame.com/rupaul-andre-charles/", "title": "RuPaul Andre Charles", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "RuPaul Andre Charles - Hollywood Walk of Fame", "description": "Hollywood Chamber of Commerce Honors Rupaul with Star on the Hollywood Walk of Fame Watch the star ceremony as the Hollywood Chamber unveils the star for RuPaul below. The Hollywood Chamber of Commerce proudly honored drag performer RuPaul with the 2,631st star on the Hollywood Walk of Fame on Friday, March 16, 2018 at 11:30 a.m. …", "url": "https://walkoffame.com/rupaul-andre-charles/", "site_name": "Hollywood Walk of Fame"}, "article": {"section": "Motion Pictures", "published_time": "2019-10-25T08:22:29+00:00"}, "twitter": {"card": "summary_large_image", "description": "Hollywood Chamber of Commerce Honors Rupaul with Star on the Hollywood Walk of Fame Watch the star ceremony as the Hollywood Chamber unveils the star for RuPaul below. The Hollywood Chamber of Commerce proudly honored drag performer RuPaul with the 2,631st star on the Hollywood Walk of Fame on Friday, March 16, 2018 at 11:30 a.m. […]", "title": "RuPaul Andre Charles - Hollywood Walk of Fame"}, "generator": "Powered by WPBakery Page Builder - drag and drop page builder for WordPress."}, "movies": ["https://www.youtube.com/embed/Bxj9ZZKDbQ8"], "publish_date": 1571991749.0, "source": "http://www.walkoffame.com", "summary": ""}