{"url": "https://www.countryliving.com/life/travel/news/a37149/10-things-chip-joanna-gaines-magnolia-market/", "text": "Have you made the trip to Magnolia Market, Chip and Joanna Gaines's store in Waco, Texas, yet? Fans of HGTV's Fixer Upper know that the couple undertook their biggest rehab project ever when they acquired a sprawling downtown Waco property that includes two huge grain silos and a 20,000-square-foot barn. Since its grand opening in 2015, the complex has quickly become more than a store—it's a major destination, where thousands flock every week. Here's what you need to know about visiting the silos.\n\n1. Where is Magnolia Market at the Silos located?\n\nLocation was key when Chip and Joanna were looking to expand their store. Joanna was charmed by the rustic look of the silos at 601 Webster Ave—as well as the idea of fixing up a Waco landmark. But it was the property's proximity to the couple's four kids' school that really got her thinking; after all, Chip and Jo have always been adamant about putting family first (they recently ended their HGTV show to focus on their businesses and personal lives).\n\nJessica Mattern\n\n2. When is Magnolia Market at the Silos open?\n\nMagnolia Market's regular business hours are 9 a.m. to 6 p.m. Monday through Saturday. The market—as well as the Gaineses' restaurant, Magnolia Table—is closed on Sundays.\n\n3. Where can you park at Magnolia Market?\n\nThe silos grounds offers free parking (enter on 8th street), including handicap spaces on 6th street. If the lot's full, you can always park farther away (but please, avoid railroad tracks and the lots of neighboring businesses) and take the free Silo District Trolley to the market instead.\n\n4. It looks even more impressive in person.\n\nPictures can't quite do the new Magnolia Market justice, because it's so large—it covers two-and-a-half acres—so you really have to wander around quite a bit to take in the various parts of the property and appreciate all it has to offer.\n\n5. It's not just a store.\n\nMagnolia Market at the Silos, as it's officially called, replaces Joanna's now-closed smaller Magnolia Market, which was a pretty standard—if very tasteful—retail shop located on Bosque Blvd in Waco. The new Magnolia Market feels like something much more: a place to buy stuff, yes, but also a community center, .\n\nAs you walk onto the property from Waco's Webster Ave, you can head up a short set of stairs to your left and start shopping in the main building—or you can choose to bypass the building and just walk around outdoors.\n\n6. What's in the silos?\n\nOutside to your right, there's an irresistible photo op: those iconic grain silos—which you can't actually enter, but which sure look impressive. According to the Magnolia website, the couple has big plans for the structures. Last we heard, Chip was set to open his own store in one silo, but there hasn't been an update on the progress since January. Of course, the couple has been quite busy; they're currently expecting baby number five! (For now, he has \"Chip's Corner,\" a small section in the main showroom with a handful of Chip-endorsed items.)\n\nJessica Mattern\n\nDuring both of our visits, people lined up to pose in front of the silos; there was a shiny red vintage truck, with a Christmas tree tied to its roof, parked right where the silos are joined in the middle by a tin roof with the famous Magnolia sign—er, MAgNoLia sign—bolted to it.\n\n7. The grounds are just as fun as the market itself.\n\nNext to the silos: a large green field (with artificial turf) where kids and parents can toss a football, play cornhole, or have a potato sack race. Beyond that: an area with picnic tables and a half-dozen food trucks (more on those in a moment) and a little garden.\n\n8. Don’t forget to visit Magnolia Seed + Supply…\n\nIt's no secret that Joanna has a green thumb. Her own garden at the farmhouse is a thing of beauty. Now, you can stock up on tools to channel your inner Jo at the gardening shop.\n\n9. …or Magnolia’s onsite bakery, Silos Baking Co.\n\nIn 2016, the Gaineses opened the doors of their bakery, Silos Baking Co., a longtime dream of Joanna's. Formerly a flower shop, the couple renovated the abandoned building situated on one corner of the Magnolia Market property, just beyond the silos, into a pretty white brick building on an episode of Fixer Upper.\n\nJessica Mattern\n\nNow, the business is known for its scrumptious cupcakes. (Here's what you need to know before visiting.) Can't make it? There's also a mobile airstream that travels around town selling the baked goods.\n\n10. The vibe here is warm and welcoming.\n\nYou can choose to shop or not shop; either way, it feels like you're welcome to hang out. If we lived in Waco, we could see coming here regularly to meet up with friends and grab a quick bite.\n\n11. The merchandise is generally affordable (but not cheap).\n\nThe emphasis at Magnolia Market is on home-design accent and gift items, including bud vases ($8 and up), antique-look signage (for example, a BAKERY sign, $88), Magnolia Farms T-shirts ($26), kitchen canisters (for instance, one labeled with an old-timey Parisian delicatessen's logo, $16), fancy soap ($12), picture frames ($8 and up), silk flowers ($9 and up) and Joanna's Signature Candle ($26). Some, but not all, of the merchandise is available online.\n\nJessica Mattern\n\n12. You can shop Waco-made merch.\n\nOne wall of Magnolia Market is adorned with as-seen-on-Fixer Upper metal signs with homey sayings on them like \"Today is a good day for a good day\" and \"I love you to the moon and back\" (small $42; large $95). Those were designed by Joanna and handmade by local metalwork artisan Jimmy Don of Stars Over Texas Metal Art. They're charming finds for visitors hoping to bring a piece of Waco back home with them.\n\nThe available inventory is always evolving, so you can be sure to find unique items at every visit.\n\n13. The best and worst day to go is Saturday.\n\nLate afternoon on a Thursday, Magnolia Market was rather quiet. On Saturday morning, it was rather mobbed. (It's closed on Sundays.) Though we didn't have to wait to get in, some visitors have reported that entry lines sometimes happen.\n\nJessica Mattern\n\nThe benefit of braving the crowds on a Saturday is that the place comes alive and the community-center vibe really kicks in.\n\n14. There are plenty of places to eat at the Market.\n\nWaco has a strong and growing food-truck culture, and Chip and Jo have wisely teamed up with the proprietors of some of the best. During our Saturday stop, visitors lined up at Luna Juice Bar, Co-Town Crepes, and Cheddar Box (for gourmet grilled-cheese sandwiches).\n\n15. God is in the details.\n\nThe architectural finishes and design flourishes both inside and outside are super nice and well thought-out. Even the restrooms are elegant, with heavy black wooden doors, striking black-and-white tile floors, white subway-tile walls and framed illustrations taken from circa-1800s copies of Vanity Fair, like the Duke of Northumberland, a dashing old man in a top hat. If you like the antique-looking white-enamel-on-metal TOILET signs on the doors of the restrooms, you can, of course, buy one ($14).\n\n16. There's an annual #Silobration.\n\nThe anniversary of the store's opening is celebrated every year in a festival called #Silobration, complete with a vendor fair.\n\n17. This is just the beginning.\n\nMagnolia Market was quickly followed by Magnolia House B&B, Hillcrest Estate, and Magnolia Table. We can't wait to see what else Chip and Jo do for Waco in the next few years—especially since stepping away from their show.\n\nBOOK NOW Starting at $49, tripadvisor.com", "images": ["https://hips.hearstapps.com/clv.h-cdn.co/assets/17/05/2048x1024/landscape-1485971822-cl-web-wacolead.jpg?resize=300:*", "https://hips.hearstapps.com/clv.h-cdn.co/assets/17/08/768x384/landscape-1487803711-cl-web-wacowardrobe.gif?resize=300:*", "https://hips.hearstapps.com/clv.h-cdn.co/assets/17/08/1600x800/landscape-1487975180-waco-header.jpg?resize=1200:*", "https://hips.hearstapps.com/clv.h-cdn.co/assets/17/07/2048x1024/landscape-1487181246-cl-web-wacolead04.jpg?resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/clv.h-cdn.co/assets/17/08/1600x800/landscape-1487975180-waco-header.jpg?resize=1200:*", "keywords": [], "authors": ["Simon Dumenco", "Simon Dumenco Has Written For A Wide Variety Of Publications Including Advertising Age", "Allure", "The Awl", "Condé Nast Traveler", "Details", "Esquire", "Glamour", "New York Magazine", "Playboy"], "canonical_link": "https://www.countryliving.com/life/travel/news/a37149/10-things-chip-joanna-gaines-magnolia-market/", "title": "17 Things You Need to Know Before Visiting Waco Texas", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Country Living", "title": "17 Things You Need to Know About Magnolia Market at the Silos", "description": "Here's what we learned from a visit to Chip and Joanna Gaines' storefront.", "url": "https://www.countryliving.com/life/travel/news/a37149/10-things-chip-joanna-gaines-magnolia-market/", "image": {"identifier": "https://hips.hearstapps.com/clv.h-cdn.co/assets/17/08/1600x800/landscape-1487975180-waco-header.jpg?resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 165119423553230, "pages": 12013348247}, "article": {"publisher": "https://www.facebook.com/CountryLiving", "modified_time": "2019-10-22 03:26:44", "published_time": "2018-06-12 03:19:00", "section": "Travel", "opinion": "false"}, "twitter": {"site": "@CountryLiving", "card": "summary_large_image", "image": "https://hips.hearstapps.com/clv.h-cdn.co/assets/17/08/1600x800/landscape-1487975180-waco-header.jpg?resize=640:*"}, "google-site-verification": "y2umrM2fg1eXvnoHVUyHzeVTDYfhwLzq_rWVXkg0Yhw", "title": "Chip and Joanna Gaines Magnolia Market - 17 Things You Need to Know Before Visiting Waco Texas", "description": "We paid a visit to Magnolia Market at the Silos in Waco, Texas—here's what you need to know about Chip and Joanna Gaines's store.", "keywords": "Magnolia Market, magnolia silos, magnolia market at the silos, magnolia market waco texas, Chip and Joanna Gaines, Fixer Upper, Waco, Texas, magnolia waco, chip gaines magnolia, joanna gaines magnolia, magnolia store, magnolia shop", "auto-publish": "evergreen", "thumbnail": "https://hips.hearstapps.com/clv.h-cdn.co/assets/17/08/980x980/square-1487975180-waco-header.jpg?resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Country Life,life,travel,Joanna Gaines,Chip Gaines", "sailthru.date": "2018-06-12T15:19:00Z", "sailthru.image.full": "https://hips.hearstapps.com/clv.h-cdn.co/assets/17/08/1600x800/landscape-1487975180-waco-header.jpg", "sailthru.image.thumb": "https://hips.hearstapps.com/clv.h-cdn.co/assets/17/08/980x980/square-1487975180-waco-header.jpg", "sailthru.socialtitle": "17 Things You Need to Know About Magnolia Market at the Silos", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1528744740.0, "source": "https://www.countryliving.com", "summary": ""}