{"url": "https://www.simonandschuster.com/books/Pretty-Mess/Erika-Jayne/9781501181894", "text": "NEW YORK TIMES BESTSELLER\n\n\n\nWithout her alter-ego Erika Jayne, Erika Girardi says she’d just be “another rich bitch with a plane”—so get ready for the dishy, tell-all memoir from show-stopping performer, model, singer, and beloved star of The Real Housewives of Beverly Hills, Erika Jayne.\n\n\n\nErika Jayne didn’t make it this far by holding back. Now, in her first-ever memoir, the fan favorite star of Bravo’s The Real Housewives of Beverly Hills bares her heart, mind, and soul.\n\n\n\nIn Pretty Mess, Erika spills on every aspect of her life: from her rise to fame as a daring and fiery pop/dance performer and singer; to her decision to accept a role on reality television; to the ups and downs of family life (including her marriage to famed lawyer Tom Girardi, thirty-three years her senior). There’s much more to Erika Jayne than fans see on The Real Housewives of Beverly Hills. Pretty Mess is her opportunity to dig deep and tell her many-layered, unique, and inspiring life story.\n\n\n\nAs fun and fearless as its author, this fascinating memoir proves once and for all why Erika Jayne is so beloved: she’s strong, confident, genuine, and here to tell all!", "images": ["https://d28hgpri8am2if.cloudfront.net/book_images/onix/cvr9781501181900/pretty-mess-9781501181900_lg.jpg"], "top_img": "https://d28hgpri8am2if.cloudfront.net/book_images/onix/cvr9781501181900/pretty-mess-9781501181900_lg.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.simonandschuster.com/books/Pretty-Mess/Erika-Jayne/9781501181900", "title": "Pretty Mess", "meta_data": {"version": "a5bb9cf04c944475b0550b50d12afa7f69327d7c", "slice": "ip-10-0-3-240", "description": "Pretty Mess by Erika Jayne - NEW YORK TIMES BESTSELLER Without her alter-ego Erika Jayne, Erika Girardi says she’d just be “another rich bitch with a plane”—so...", "viewport": "width=device-width, minimum-scale=1.0, initial-scale=1.0", "format-detection": "telephone=no", "robots": "NOODP", "fb": {"admins": 100000004327945}, "twitter": {"card": "summary", "site": "SimonSchuster"}, "og": {"title": "Pretty Mess", "description": "NEW YORK TIMES BESTSELLER Without her alter-ego Erika Jayne, Erika Girardi says she’d just be “another rich bitch with a plane”—so get ready for the...", "type": "book", "image": "https://d28hgpri8am2if.cloudfront.net/book_images/onix/cvr9781501181900/pretty-mess-9781501181900_lg.jpg"}, "book": {"isbn": 9781501181900, "author": "Erika Jayne", "release_date": "02/12/2019"}}, "movies": [], "publish_date": null, "source": "https://www.simonandschuster.com", "summary": ""}