{"url": "https://en.wikipedia.org/wiki/List_of_High_School_Musical_characters", "text": "The following article is a list of characters appearing in the High School Musical film series. Currently, the characters who appear in High School Musical, High School Musical 2, and High School Musical 3: Senior Year are listed.\n\nThe first three films focus on the six main characters. The first film chronicles events occurring over several weeks in their junior year of high school, with the second film taking place the following summer. The third film is set in the final semester of senior year. Classmates and parents of these characters, as well as various other characters, are also featured.\n\nMain cast\n\nTroy Bolton\n\nTroy Bolton is the protagonist of the first three films. Depicted as one of East High's most popular students, Troy is also the captain of the school's varsity basketball team, a position he earned in his junior year after joining the team as a sophomore.[1] The majority of the student body, especially Troy's best friend, Chad Danforth, expects Troy to lead East High to victory. Troy is the only child of Jack and Lucille Bolton; Jack is also the coach of the East High basketball team and puts additional pressure on Troy to excel. Troy is also involved with the school's golf team. In the first film, Troy meets Gabriella Montez at a ski lodge karaoke party on New Year's Eve. When the school year resumes, Troy finds that Gabriella is a new student at East High. For fear of what his father, friends, and classmates would think, Troy asks Gabriella not to mention his singing performance to anybody else. However, the secret eventually gets out when Troy and Gabriella unintentionally audition for the winter musical after singing in the auditorium. The news throws East High's social order out of balance. Troy finds himself having to choose between Gabriella and the musical callbacks or his team and the championship game. Although his friends initially try to thwart Troy's chances of being cast as the musical's lead, they help him make both the game and the callbacks, which had been scheduled on the same afternoon. Troy and Gabriella earn the lead roles, somewhat angering the drama department's president, Sharpay Evans. In High School Musical 2, Sharpay has her mind set on capturing Troy's affections and coming between him and Gabriella. Troy, Gabriella, and their friends are hired at a local country club, Lava Springs, but are weary of their new-found employment when they learn the club is owned by Sharpay's parents. Sharpay uses her wealth, power, and influence over Troy, tempting him with college opportunities in exchange for him singing with her at the club's Midsummer Night Talent Show. Troy gives into Sharpay's plot, causing Gabriella, Chad, and their friends to see Troy as a whole new person. Although Troy is being offered a college scholarship, he soon realizes he must not compromise his character while on the quest for his future, and returns to his old self. In the franchise's third film, Troy once again feels uncertain about his future as high school graduation draws near. While Troy is set to attend the University of Albuquerque, he begins to have second thoughts about other schools he and his father talked about. Coach Bolton and Chad are both insistent on Troy attending the university, but he decides to attend University of California, Berkeley in order to pursue both basketball and theater and to be closer to Gabriella, who enrolls at Stanford University.\n\nIn the first three films, Troy is portrayed by Zac Efron, with Drew Seeley providing his singing voice in the first film. The reason for this dubbing is still somewhat unclear, although Efron has told Rolling Stone that the songs for the first film were written prior to casting and out of his vocal range.[2] Casting for the role was a multi-audition process, and candidates for the role included Hunter Parrish[3] and Sterling Knight.[4] Efron had previously audition for a Disney Channel pilot that was not picked up by the network a few years prior to casting for High School Musical.[5] Although the franchise will continue with a fourth film, Efron and his character will not be returning.[6]\n\nIn other media\n\nEfron reprised the role in the short film High School Musical 4 on Saturday Night Live.[7]\n\nIn Life with Archie: Archie Love Veronica: Lodge—A Complaint!, when Betty Cooper is talking about how all the men she has dated have all been nothing but \"clone[s] of Archie\", she lists Troy Bolton as one of those she has dated.\n\nGabriella Montez\n\nWhen the two settle in Albuquerque, New Mexico, Gabriella's mother promises they will not relocate until she graduates high school. Gabriella begins attending East High mid-year in the first film. Hoping to escape the \"freaky genius girl\" reputation she had earned at her previous schools,[8] she does not join any extracurricular activities. Her first friend at East High is Troy Bolton, whom she had met at a ski lodge karaoke party on New Year's Eve, however she quickly makes friends with Taylor McKessie, who finds out about Gabriella's various academic accomplishments and urges her to join the school's nation decathlon team. Gabriella is hesitant, but eventually agrees. Having unearthed a passion for performing at the karaoke party, Gabriella decides to audition for the school musical, but is too late. It is only when the musical's director, Ms. Darbus, overhears Gabriella singing with Troy that she gives them both a callback. Gabriella is uncertain about pursuing the lead role, especially when Taylor and the other members of the decathlon team tell her that the musical will take her focus off the upcoming decathlon event. Taylor and her friends stage an intervention, which portrays Troy as not caring about Gabriella or the musical. Heartbroken, Gabriella drops out of the running for the lead role. However, Taylor eventually confesses what she did and helps Gabriella make the decathlon and the musical auditions. Gabriella and Troy earn the lead roles, beating out Sharpay Evans, who had previously tried to thwart her chances of making the callbacks. In the second film, Gabriella has maintained her romance with Troy, and the couple, along with their friends, get jobs at the Lava Springs country club. Seeking revenge, Sharpay lures Troy away from Gabriella and his friends, showering him with various luxuries, including promising college opportunities. After Troy repeatedly breaks his promises and backs out of his commitments, Gabriella breaks up with him, only for the couple to reunite. In High School Musical 3: Senior Year, a Stanford-bound Gabriella is uneasy about the fast pace her life has taken. Before graduation, Gabriella briefly considers taking classes at the local university for a year and going to Stanford when she is ready, much to the dismay of Taylor and Ms. Montez. Troy urges Gabriella to accept an early orientation. Gabriella goes to Stanford but must drop out of the school musical (allowing Sharpay to fill the lead role) and miss prom. Wanting his last dance at East High to be with Gabriella, Troy drives to Stanford and the two share an intimate prom of their own. He convinces Gabriella to return to East High for opening night of the musical and for graduation. Gabriella will attend Stanford and study law. She was referenced by Sharpay in Sharpay's Fabulous Adventure.\n\nGabriella, who was named for the daughter of High School Musical writer Peter Barsocchini but modeled after a girl Barsocchini met before his teenage years,[9] is portrayed by Vanessa Hudgens in the first three films of the franchise. Hudgens had previously auditioned for other Disney Channel projects.[5] During auditions, Hudgens was paired with Zac Efron, who landed the role of Troy, at each callback,[10] with director Kenny Ortega saying \"We tried to separate them and try them with other partners but it didn’t work. The magic was already there between them.\"[11] Following Hudgens' 2007 nude photo scandal, reports claimed that Adrienne Bailon and other actresses would replace Hudgens in the third film of the franchise.[12] However, Disney had denied the reports[13] and Hudgens returned for High School Musical 3. Hudgens will not, however, reprise her role for High School Musical 4.[14]\n\nSharpay Evans\n\nSharpay Evans is the main antagonist of the films and the co-president of the East High drama department alongside her twin brother, Ryan, with whom she has starred in 17 school productions.[15][16] Sharpay appears to have the most power in the drama department, leaving Ryan as her right-hand man. However, the sibling loyalty is not always mutual. Classmate Taylor McKessie suspects that if Sharpay \"could figure out how to play both Romeo and Juliet, her own brother would be aced out of a job.\"[17] Sharpay's family is very affluent; their wealth stems from the country club, Lava Springs, her parents own. In High School Musical, Sharpay is shown as being somewhat popular. Students on campus seem to fear her, as they scour to make room for her in the hallways or cafeteria. Fear also appears to be the reason why other students, such as Kelsi Nielsen, remain a part of Sharpay's posse. Sharpay is sometimes the victim of playful jokes and light teasing from the East High basketball team, despite the fact that one of their star players, Zeke Baylor, has a crush on Sharpay. Sharpay's talents are challenged for the first time when Gabriella Montez and Troy Bolton are called back for the lead roles in the musical. To ensure that she and Ryan remain in the spotlight, Sharpay convinces Ms. Darbus, the musical's director, to switch the date of the callbacks to the same day as Troy's district championship basketball game and Gabriella's national decathlon. However, Troy and Gabriella still manage to make the callbacks and are cast in the lead roles of Arnold and Minnie. In the second film, Sharpay seems to have gained more popularity, with adoring fans wanting her signature in their yearbooks at the end of the school year. Sharpay plans to steal Troy away from Gabriella during summer vacation. She has the manager of Lava Springs, Mr. Fulton, hire Troy to work at the country club, ordering him to do so, whatever it takes. The cost of Troy's employment is the employment of Gabriella and their friends. Realizing that she must now try to win Troy's affections with extreme measures, Sharpay brings Troy into the high class world of her family, which eventually leads to his promotion and college opportunities. Sharpay also convinces Troy to sing with her in the Midsummer Night Talent Show, abandoning plans to enter the show with Ryan. Ryan begins to step out of Sharpay's shadow and Troy eventually begins to free himself from Sharpay's grip. Sharpay is unable to perform at the talent show, but does join Troy and Gabriella's duet in the background, along with their other friends. Despite having little involvement in the show, the fixed competition's prize, the Star Dazzle Award, was going to be given to her, but she selflessly awards the prize to her brother, who arranged Troy and Gabriella's duet. By the third film, Sharpay's popularity seems to be limited among admiring boys. In her senior year, Sharpay meets Tiara Gold, a British transfer student eager to learn the ropes at East High by becoming Sharpay's student. Tiara's dedication is impressive, but it turns out to be a facade. On opening night of the spring musical, Tiara attempts to upstage Sharpay, but fails. Sharpay does not receive a scholarship to the Juilliard School like she had hoped and will study the dramatic arts at the University of Albuquerque. She has agrees to return to East High to assist Ms. Darbus with the drama department and to continue her reign over Tiara.\n\nSharpay becomes the main protagonist in her independent film, Sharpay's Fabulous Adventure, where she believes she is offered a role on Broadway and travels to New York with her dog, Boi. Her father agrees to give her a one-month limit to prove that she can stand on her own: if she fails, then she will work for him at the Lava Springs Country Club. While in New York, she meets Peyton Leverette, the son of her mom's college friend, who takes her to a new apartment after she got thrown out of a penthouse for refusing to throw her dog out. After finding out that the agents really want her dog, not her, she befriends the star, Amber Lee Adams, who manipulates her into doing chores, being her manager in exchange for her dog's role, until she sees Amber Lee's true face. Roger, whose dog is on competition with Sharpay's, helps expose Amber Lee to the world, almost causing the show to be cancelled. Peyton shows a video of Sharpay's secret performance to convince the agents that she can save the show by replacing Amber Lee Adams. Sharpay's performance turns her into a star on Broadway and she starts dating Peyton.\n\nSharpay is portrayed by Ashley Tisdale in the four films of the series. Tisdale, who was previously known for her starring role on the Disney Channel series \"The Suite Life of Zack & Cody\", insists that she was not offered the role of Sharpay and had to audition, also claiming that she almost didn't get the role because the Disney executives did not think she could play the \"mean girl\" role based on her performance in \"The Suite Life\".[18] Tisdale said that she went into the auditions at the last minute,[10] but felt very comfortable in front of the Disney executives, as she already knew them.[18] To ensure that viewers loved to hate her character, Tisdale looked to Rachel McAdams' performance in Mean Girls.[18]\n\nRyan Evans\n\nRyan Evans is the twin brother of Sharpay Evans. Like his sister, Ryan is very much involved with musical theater and performing. However, his interests do not end at theater, as he also enjoys playing baseball and won the junior league world series sometime before the film series. Ryan is well known for wearing different styles of hats. In the first film, Ryan is depicted as being dim-witted and completely submissive to Sharpay, though this could be because he likes Troy and Gabriella. When Troy Bolton and Gabriella Montez threaten Ryan and Sharpay's chances of being cast as the leads at East High's winter musical, Ryan assists Sharpay in making sure Troy and Gabriella's scheduled conflict with the callback dates. The plan falls through and Troy is cast in the lead role. In High School Musical 2, Ryan plans on enjoying the summer at his family's country club, Lava Springs, and entering the Midsummer Night Talent Show with Sharpay. However, he begins to step out of his sister's shadow when she decides to enter the talent show with Troy. Ryan decides to help Gabriella and her friends, who have felt abandoned by Troy, stage an act for the talent show. This causes a rift in his relationship with Sharpay, who still expects him to be at her side. In the end, Ryan is awarded the Star Dazzle Award at the talent show for his directional work. In the third film of the franchise, with more independence by himself and being less controlled by his sister, Ryan is a candidate for a scholarship to the Juilliard School for dance. He is competing for one scholarship with Sharpay, Troy, and shy composer Kelsi Nielsen. The school's scouts will attend opening night of the East High spring musical to determine who will be the recipient. Ryan is the choreographer of the show while Kelsi is the composer. Through their work together, Ryan attend prom together with Kelsi, but only as friends. He receive a scholarship to Juilliard.\n\nAt the end of Sharpay's Fabulous Adventure, Ryan is on a break from his musical tour around the country and pays a visit to his sister Sharpay after she became a star on Broadway to congratulate her. While Sharpay goes to chase Boi, Ryan enjoys her bed until it folds back into the closet, taking Ryan with it.\n\nRyan is played by Lucas Grabeel in the first three installments of the franchise. Corbin Bleu, who was later cast as Chad Danforth, auditioned for the role of Ryan.[10] Grabeel had previously appeared in Disney Channel's Halloweentown High.\n\nOnly after the end of the franchise, David Simpatico, one of the writers, revealed Ryan's homosexuality, describing him as a \"coded gay\" – characters without revealed sexuality by the rules of the studios, a controversial topic when talking to children and teenagers.[19] Ortega based the character on his own adolescence: \"I see a lot of myself in Ryan. Yeah, I knew I was gay in high school, but I didn't tell anybody\".[20]\n\nChad Danforth\n\nChad Danforth is Troy Bolton's best friend and teammate. Chad is known for wearing shirts with eccentric phrases and messages on them. In the third film, those messages are all environment-friendly. In High School Musical, Chad is gearing up for the district championship basketball game and assumes Troy, also the team captain, is doing the same. However, news soon spreads around school that Troy and Gabriella Montez, a new student, have auditioned for the school musical and have been called back for the lead roles. Hoping to keep Troy's head in the game, Chad and his teammates stage an intervention while Taylor McKessie and her friends, who want Gabriella to stay focused on the national decathlon team, do the same with Gabriella. The plan is successful, but Chad and Taylor soon realize that they hurt their close friends. After admitting their guilt, they help Troy and Gabriella make the callbacks, as well as the game and decathlon. At the end of the film, Chad asks Taylor on a date. In the second film, Chad and Taylor seem to have maintained a relationship. Hoping to save up for a car, Chad takes a job at the Lava Springs country club for the summer, alongside Troy, Gabriella, Taylor, and their friends. Chad reluctantly agrees to participate with the other employees in the Midsummer Night Talent Show at the club. His friendship with Troy also hits a wall when Troy compromises himself for luxuries at the country club. The two, however, make up. In High School Musical 3: Senior Year, Chad is looking forward to playing basketball with Troy at the University of Albuquerque following high school graduation. He is initially upset when Troy decides to attend the University of California, Berkeley instead, but accepts the fact that he and Troy cannot stay together forever. Chad also struggles with asking Taylor to prom, but finally succeeds after several tries.\n\nCorbin Bleu portrays Chad Danforth in the first three films of the franchise. Bleu originally auditioned for the role of Ryan Evans, but was suggested for the role of Chad instead.[10] Bleu had auditioned for Disney Channel projects in the past.[5]\n\nTaylor McKessie\n\nTaylor McKessie is the president of the science club at East High and a member of the school's national decathlon team. Taylor is a feminist and admires many important women in history. She is also shown to have a wide range of knowledge, including anything from computers to the daily lunch special in the school cafeteria. In the first film, she is shown as finding the school's athlete as tribal. She is also impressed at the intellect of new student Gabriella Montez. Articles of Gabriella's academic achievements at her old schools are placed in Taylor's locker. Although Gabriella did not slip the articles in the locker, she agrees to join the decathlon team at Taylor's suggestion. However, when Gabriella's interest begins to turn to the school musical and Troy Bolton, Taylor teams up with Troy's best friend, Chad, to make sure they can keep their friends away from one another and focused on the prize. While Chad and his basketball teammates explain to Troy that they will not win the district championship game if he is involved with the musical, they film him saying that the musical and Gabriella are not important. Taylor show Gabriella the footage and she is left heartbroken. Realizing the magnitude of what they have done, Taylor and Chad work together again to make sure Troy and Gabriella make the musical callbacks. Taylor's role in the plan is to set off a chemical reaction that would result in the evacuation of the national decathlon. At the end of the film, Taylor is asked out by Chad. In High School Musical 2, Taylor, Gabriella, Chad, Troy, and their friends are hired at the Lava Springs country club, owned by the parents of Sharpay Evans, the school drama queen. Taylor is the first to notice that Troy is changing and being pulled into Sharpay's world. She tries to convince Gabriella that Troy is no longer the nice guy she fell for. In High School Musical 3: Senior Year, Taylor is editor of the school yearbook. While she will attend Yale University and study political science (with the goal of becoming President of the United States), she pushes Gabriella to accept an early orientation at Stanford University while joining the others for a last spring musicale.\n\nTaylor is portrayed by Monique Coleman in the first three films of the series. Coleman had previously auditioned for Disney Channel.[5]\n\nOther East High students\n\nKelsi Nielsen\n\nKelsi Nielsen is a songwriter and composer and student at East High. She is very introverted and is very intimidated by Sharpay Evans, the president of the school's drama department. In High School Musical, Ms. Darbus, the director of the school's winter musical, allows Kelsi to compose the music. During the auditions, Sharpay and her brother, Ryan, perform one of Kelsi's original songs, \"What I've Been Looking For\", but with an upbeat arrangement. When Kelsi tells Sharpay that she imagined the song to be much slower, Sharpay belittles her and Kelsi retreats. After auditions, Kelsi is approached by Troy and Gabriella, who tell her she does not have to be intimidated by Sharpay. She offers to show them how the song they sang is supposed to sound. Troy and Gabriella sing the duet ballad and Ms. Darbus, who had re-entered the auditorium, gives them a callback. Kelsi works with Troy and Gabriella to ensure that they beat out Sharpay and Ryan for the lead roles. The second film shows Kelsi, Troy, Gabriella, and their friends working at the Lava Springs country club, which is owned by Sharpay's family. Kelsi's job is playing the piano in the dining room. She is also the rehearsal pianist for Sharpay. She has a mutual love interest in Jason Cross, but never been shown a relationship. Although, in the third film he attends prom with Ryan when he invites her to work together, but only as friends. Kelsi receive scholarships for the Juilliard School, where she will study music.\n\nKelsi is portrayed by Olesya Rulin in the first three films of the series. Rulin, who had previously starred in Disney Channel's Halloweentown High alongside Lucas Grabeel, was cast in her High School Musical role immediately after her own high school graduation.[21]\n\nZeke Baylor\n\nZeke Baylor is one of East High's most talented basketball players. He appears to be very close to Jason Cross, Troy Bolton, and Chad Danforth. He also is attracted to Sharpay Evans. In High School Musical, he is one of several students to reveal a secret passion following Troy Bolton's audition for the school musical. Zeke's passion is baking, which impresses Sharpay at the end of the film. In High School Musical 2, Zeke is one of many East High students to be hired to work at Sharpay's family's country club, Lava Springs. He assists Chef Michael in the kitchen. His crush on Sharpay still remains, but the two are not seen together until the end of the film. In High School Musical 3: Senior Year, Sharpay asks Zeke to prom and he joins his friends in a final musical, but also has to work hard to pass his Family Science Class.\n\nChris Warren, Jr. portrays Zeke in the first three High School Musical films. Although his character graduates in the third film, Warren stated after High School Musical 2 that he planned to appear in two more sequels, indicating possible involvement in High School Musical 4: East Meets West.[22]\n\nJason Cross\n\nJason Cross is a member of the East High School boys' varsity basketball team and one of Troy Bolton, Chad Danforth, and Zeke Baylor's good friends. He tends to ask questions or make statements that make him come off as a kiss-up or unintelligent. In High School Musical, he works as a bus boy at Lava Springs country club. He has a mutual love interest in Kelsi Nielsen, but never been shown a relationship. In the third film he attends prom with Martha Cox, but only as good friends, when Kelsi goes with Ryan. While he joins his friends on a final musical before graduation, he also has to spend time to study for his finals. At the end of the movie, he finally earns enough scores to graduate.\n\nJason is portrayed by Ryne Sanborn in the first three films of the series.\n\nMartha Cox\n\nMartha Cox is an East High School student and member of the national decathlon team. In wake of Troy's audition for the winter musical in High School Musical, Martha confesses that she enjoys hip-hop dancing. In High School Musical 2, Martha works at the Lava Springs country club as part of the kitchen staff. She becomes a cheerleader in the third film and participates in a final musical with her friends.\n\nMartha is portrayed by Kaycee Stroh in the first three films in the franchise. Stroh took some of her dance students to audition for High School Musical as background dancers . Director Kenny Ortega pulled her aside and asked her to audition for the role of Martha, choosing her.[23]\n\nTiara Gold\n\nTiara Gold is a British transfer student who takes a job as Sharpay Evans' assistant to learn the ropes at East High. She shows some initial interest in musical theater, but is careful not to upstage Sharpay. Due to her dedicated presence during rehearsals for the spring musical, Ms. Darbus casts Tiara as an understudy. Tiara later overhears Gabriella Montez talking to Taylor McKessie about an early orientation at Stanford University, which would make Gabriella unable to perform as the lead in the musical. Tiara informs Sharpay, who is impressed by her dedication. Gabriella leaves for the orientation, allowing Sharpay to take over her part. Tiara, in turn, takes over Sharpay's former role. During opening night, Sharpay is embarrassed after having to perform with Jimmie Zara, Troy Bolton's understudy. When she goes back to her dressing room, she finds Tiara in her costume. Tiara tells Sharpay that she is the new queen of the drama department and that it is time for Sharpay to move aside. Sharpay, in retaliation, upstages Tiara onstage. Later, Tiara learns that Sharpay will be returning occasionally to East High after graduation to help Ms. Darbus with the drama department and, undoubtedly, continue to upstage Tiara.\n\nTiara is portrayed by Jemma McKenzie-Brown in High School Musical 3: Senior Year. Disney star Selena Gomez has admitted to turning down the role,[24] while Ali Lohan reportedly auditioned for the role.[25] Although Brown was originally set to star in High School Musical 4: East Meets West,[26] it has since been confirmed that she will not reprise her role.[27]\n\nJimmie Zara\n\nJimmie Zara, also known as \"the Rocket\" or \"Rocketman\", is a member on the East High School boys' varsity basketball team. In the final game of High School Musical 3: Senior Year, he is used as somewhat of a secret weapon and scores the winning basket. He looks up to Troy Bolton and has a small crush on Sharpay Evans. He is Troy's understudy for the spring musical and is able to perform with Sharpay on opening night.\n\nMatt Prokop portrays Jimmie in the third film of the series. Disney star Tony Oller auditioned for this role.[28] Prokop has stated that he signed on for three potential films, including High School Musical 3.[29] However, Prokop has since confirmed that he will not be in the fourth film, as Disney wanted to go in a new direction.[30]\n\nDonny Dion\n\nDonny Dion is a member of the East High School boys' varsity basketball team. It is unclear whether or not he is a player or an equipment manager or towel boy. Nevertheless, he looks up to Chad Danforth and evens asks to have Chad's gym locker after he graduates. His best friend is Jimmie Zara. Donny is portrayed by Justin Martin in High School Musical 3: Senior Year. Martin almost gave up on auditioning for the roll because the casting directors told him he was too little.[31]\n\nSusan\n\nSusan is a girl who auditions for the winter musical but did not get the role even though Ms. Darbus was impressed with some hand gestures she made. She is portrayed by Anne Kathryn Parma.\n\nAlan\n\nAlan is a boy who auditions for the winter musical but did not get the role. He is portrayed by Nick Whitaker.\n\nCyndra\n\nCyndra is a girl who auditions for the winter musical and is not happy when she does not get the role. She is portrayed by Falcon Grace.\n\nOther characters\n\nPeyton Leverett\n\nPeyton Leverett High School Musical film series character Portrayed by Austin Butler First appearance Sharpay's Fabulous Adventure Profile Occupation Student of New York University Family Parents Unnamed mother\n\nPeyton Leverett is the male protagonist and love interest of Sharpay Evans in Sharpay's Fabulous Adventure. He is a film student at New York University who is assigned by his mother to keep an eye on Sharpay while she's in town, and immediately finds her interesting and decides to make her his filming subject of \"A special story in New York\".\n\nHe is the one who helps Sharpay locate a studio apartment, encourages her to pursue her dreams, adapt to her surroundings and reminds her of who she really is when she is about to lose herself. When Sharpay becomes Amber Lee Adam's secretary, she loses time to spend with Peyton. Peyton becomes frustrated with her ignorance to Amber Lee's ambitions, Boi and Countess's newfound relationship and lack of time to spend with him. The two have an argument and Peyton drops her from his project until she apologizes to him the next day.\n\nAfter Amber Lee quit the show, Peyton shows the agents and producers a video of Sharpay's secret rehearsal to prove that she can save the show. The producers are so impressed by her performance that they re-hire Sharpay as the lead of \"A Girl's Best Friend\". Sharpay expresses her worries and anxiety, but Peyton manages to help her maintain confidence and then kisses her. He is last seen greeting Sharpay's parents seconds before the show starts.\n\nPeyton is portrayed by Austin Butler, who had also starred with Ashley Tisdale in Aliens in the Attic, where they played each other's paternal cousins.\n\nRoger Elliston\n\nRoger Elliston is a young, wealthy boy who shares most of Sharpay's personality and appears in Sharpay's Fabulous Adventure, where he and Sharpay compete each other to win a role for their dogs. He continuously attempts to win the role for his dog, Countess, by cheating. Eventually, he and Sharpay find out that Amber Lee Adams has forced to producers to remove the dogs from the show, and both are forced to come together to reveal Amber Lee Adams' true image to the world.\n\nAlthough they manage to expose Amber Lee's true self to the world, this results in Amber Lee quitting the show, Sharpay getting fired and almost causing the show to be cancelled. When the producers re-hire Sharpay, she demands that Boi and Countess share the role of Shelby equally, much to Roger's pleasure.\n\nRoger is portrayed by Bradley Steven Perry.\n\nAmber Lee Adams\n\nAmber Lee Adams is a support character who appears in Sharpay's Fabulous Adventure. She is a famous film star who is about to hired as the main character on Broadway in a show called \"A Girl's Best Friend\". She is always sweet and kind to those around her, but that is only for her image. In truth, she is self-absorbed, demanding, mean, and manipulative, much like Sharpay in the previous films.\n\nShe fires her secretary for being late and then hires Sharpay to do her chores and keep check of her schedules, and manipulates her to do her bidding by acting kind in front of her. In the end, she gets tired of the dogs, Boi and Countess, and demands the producers remove the dogs from the show. Sharpay hears this and works with Roger to expose Amber Lee's true face to the world.\n\nAmber Lee Adams is played by Cameron Goodman.\n\nParents and adults\n\nJack Bolton is Troy Bolton's father and the coach of the East High boys' varsity basketball team. He is angry when he finds out that Troy auditioned for the school musical weeks before the district championship game in. He voices his disapproval but changes his mind when he sees how talented Troy is. When Troy begins working at the Lava Springs country club, Jack advises Troy to keep his eye on college. Jack is once again angry with Troy when he learns Troy is considering other schools besides the University of Albuquerque; however, he comes to terms with Troy's decision to enroll at the University of California, Berkeley. Coach Bolton is played by Bart Johnson in the first three films of the series.\n\nis Troy Bolton's father and the coach of the East High boys' varsity basketball team. He is angry when he finds out that Troy auditioned for the school musical weeks before the district championship game in. He voices his disapproval but changes his mind when he sees how talented Troy is. When Troy begins working at the Lava Springs country club, Jack advises Troy to keep his eye on college. Jack is once again angry with Troy when he learns Troy is considering other schools besides the University of Albuquerque; however, he comes to terms with Troy's decision to enroll at the University of California, Berkeley. Coach Bolton is played by Bart Johnson in the first three films of the series. Ms. Darbus is the overly-dramatic musical director at East High. Her classroom serves as homeroom for Troy Bolton, Gabriella Montez, Sharpay Evans, Ryan Evans, Chad Danforth, Taylor McKessie, Kelsi Nielsen, and other students. She has an intense dislike of cell phones, particularly when they ring in the theater. She and coworker Coach Jack Bolton do not always see eye-to-eye. In the first film, Ms. Darbus is convinced that Troy and Gabriella only auditioned for the musical to mock it. In the end, she casts them as the leads. In High School Musical 3: Senior Year , Ms. Darbus submits Troy's name for a scholarship to the Juilliard School without his knowledge. Ms. Darbus is portrayed by Alyson Reed in the films.\n\nis the overly-dramatic musical director at East High. Her classroom serves as homeroom for Troy Bolton, Gabriella Montez, Sharpay Evans, Ryan Evans, Chad Danforth, Taylor McKessie, Kelsi Nielsen, and other students. She has an intense dislike of cell phones, particularly when they ring in the theater. She and coworker Coach Jack Bolton do not always see eye-to-eye. In the first film, Ms. Darbus is convinced that Troy and Gabriella only auditioned for the musical to mock it. In the end, she casts them as the leads. In , Ms. Darbus submits Troy's name for a scholarship to the Juilliard School without his knowledge. Ms. Darbus is portrayed by Alyson Reed in the films. Lisa Montez is the single mother of Gabriella Montez. Gabriella has stated that she and her mother relocated several times. They move to Albuquerque halfway through Gabriella's junior year, and she promises Gabriella that it is a permanent arrangement until she graduates. Lisa is very proud of Gabriella for being accepted to Stanford University and does not agree with her daughter when she suggests taking a year off after high school. As Gabriella's graduation approaches, Lisa puts the house up for sale. It is unclear what happened to her husband; he has only been mentioned once, by Gabriella as she recollects her childhood, and is presumably dead. Lisa is portrayed by Socorro Herrera in the first and third films.\n\nis the single mother of Gabriella Montez. Gabriella has stated that she and her mother relocated several times. They move to Albuquerque halfway through Gabriella's junior year, and she promises Gabriella that it is a permanent arrangement until she graduates. Lisa is very proud of Gabriella for being accepted to Stanford University and does not agree with her daughter when she suggests taking a year off after high school. As Gabriella's graduation approaches, Lisa puts the house up for sale. It is unclear what happened to her husband; he has only been mentioned once, by Gabriella as she recollects her childhood, and is presumably dead. Lisa is portrayed by Socorro Herrera in the first and third films. Vance Evans is the wealthy father of Sharpay and Ryan Evans and the owner of the Lava Springs country club. He holds the highest record on the club's golf course, which he built himself. His alma mater is the University of Albuquerque. He is very impressed by Troy Bolton and offers him opportunities through his connections with the university. Vance is portrayed by Robert Curtis Brown in the second and third films.\n\nis the wealthy father of Sharpay and Ryan Evans and the owner of the Lava Springs country club. He holds the highest record on the club's golf course, which he built himself. His alma mater is the University of Albuquerque. He is very impressed by Troy Bolton and offers him opportunities through his connections with the university. Vance is portrayed by Robert Curtis Brown in the second and third films. Darby Evans is the wealthy mother of Sharpay and Ryan Evans and the wife of Vance Evans. She approves the hiring of several East High students to the Lava Springs country club, much to the dismay of Sharpay, who only wanted Troy Bolton to work there. She is very interested in yoga, has a unique relationship with both students, and is unskilled at golf. She is portrayed by Jessica Tuck in the second and third films.\n\nis the wealthy mother of Sharpay and Ryan Evans and the wife of Vance Evans. She approves the hiring of several East High students to the Lava Springs country club, much to the dismay of Sharpay, who only wanted Troy Bolton to work there. She is very interested in yoga, has a unique relationship with both students, and is unskilled at golf. She is portrayed by Jessica Tuck in the second and third films. Thomas Fulton is the manager of the Lava Springs country club. He is obligated to take Sharpay Evans' orders. In doing so, he hires Troy Bolton to work at the club. He is uptight and prefers structure and discipline. He is portrayed by Mark L. Taylor in High School Musical 2 .\n\nis the manager of the Lava Springs country club. He is obligated to take Sharpay Evans' orders. In doing so, he hires Troy Bolton to work at the club. He is uptight and prefers structure and discipline. He is portrayed by Mark L. Taylor in . Dave Matsui is the principal of East High. He is first seen welcoming Gabriella Montez to East High. He also seems to have to deal with the quarrels between Coach Jack Bolton and Ms. Darbus. He insists that they need to learn to work together, although he seems to have more interest in Coach Bolton's side of the argument. Principal Matsui is portrayed by Joey Miyashima in High School Musical and High School Musical 3: Senior Year .\n\nis the principal of East High. He is first seen welcoming Gabriella Montez to East High. He also seems to have to deal with the quarrels between Coach Jack Bolton and Ms. Darbus. He insists that they need to learn to work together, although he seems to have more interest in Coach Bolton's side of the argument. Principal Matsui is portrayed by Joey Miyashima in and . Lucille Bolton is Troy Bolton's mother and Jack Bolton's wife. She is depicted as being somewhat annoyed with Troy and Jack's extreme dedication to basketball. Lucille is portrayed by Leslie Wing in the first three installments of the series.\n\nis Troy Bolton's mother and Jack Bolton's wife. She is depicted as being somewhat annoyed with Troy and Jack's extreme dedication to basketball. Lucille is portrayed by Leslie Wing in the first three installments of the series. Charlie Danforth is the father of Chad Danforth and friend of Jack Bolton. He is portrayed by Corbin Bleu's real-life father, David Reivers in the third film. His unnamed wife is portrayed by Yolanda Wood in the third film.\n\nis the father of Chad Danforth and friend of Jack Bolton. He is portrayed by Corbin Bleu's real-life father, David Reivers in the third film. His unnamed wife is portrayed by Yolanda Wood in the third film. An unnamed chemistry teacher at East High. She is portrayed by Irene Santiago-Baron.\n\nat East High. She is portrayed by Irene Santiago-Baron. Ms. Falstaff is a librarian at East High. In the first film, she constantly reminds Chad to keep quiet in the library. She is portrayed by Joyce Cohen.\n\nOthers", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Ashley_Tisdale_6%2C_2012.jpg/240px-Ashley_Tisdale_6%2C_2012.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/en/a/a3/HSMcharacters.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Olesya_Rulin_%2817034592866%29_%28cropped%29.jpg/240px-Olesya_Rulin_%2817034592866%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Lucas_Grabeel_2016.png/240px-Lucas_Grabeel_2016.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a3/HSMcharacters.jpg/330px-HSMcharacters.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Vanessa_Hudgens_%28Headshot%29.jpg/240px-Vanessa_Hudgens_%28Headshot%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Corbin_Bleu_%28Headshot%29.jpg/240px-Corbin_Bleu_%28Headshot%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Zac_Efron_2007.jpg/240px-Zac_Efron_2007.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Monique_Coleman_2011%2C_5.jpg/240px-Monique_Coleman_2011%2C_5.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/a/a3/HSMcharacters.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_High_School_Musical_characters", "title": "List of High School Musical characters", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/a/a3/HSMcharacters.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}