{"url": "https://www.thedailybeast.com/corinne-olympios-on-moving-past-the-bachelor-in-paradise-sex-scandal", "text": "Corinne Olympios just wants to set the record straight.\n\nThe 24-year-old Miami native elbowed her way into the zeitgeist on Nick Viall’s season of The Bachelor, where she easily stole every scene from the underwhelming Bachelor and his mansion full of cookie-cutter contestants. Olympios played both a villain and a heroine, a tightrope walk that defied reality TV conventions. While the self-described manager of a “multimillion-dollar company” was at times rude and over-assertive, she was also self-aware and funny, with natural charisma and a talent for transparency. Olympios’ sex-positive approach to camera-ready courtship may have earned her a number of nemeses, but it also gave rise to a growing fan base (#TeamCorn). While Corinne and Nick ultimately were not a love match, Olympios’ fan-favorite status all but guaranteed her a second chance on the spinoff show Bachelor in Paradise. And that’s when this reality-TV success story took a dark turn.\n\nIt takes a major scandal to break out of the bubble that is Bachelor Nation and into the mainstream conversation. This summer, niche Bachelor blogs and tabloid empires alike found themselves breathlessly reporting one of the biggest scandals in the franchise’s 15-year history. The media frenzy began when word leaked that Bachelor in Paradise had shut down just days into its summer shoot. Paradise, a show on which ex-Bachelor and Bachelorette contestants drink and date until Chris Harrison tells them to stop, has always been wilder than its relatively buttoned-up sister shows. But according to those first reports, a sexual interaction on set had crossed the line, forcing ABC to send home the cast and crew pending further investigation.\n\nThe dalliance in question was between Olympios and DeMario Jackson, another “villain” character from the latest Bachelorette season. Rumors swirled that Olympios was perhaps too intoxicated to give her consent, a hunch that appeared to be validated by Olympios’ first public statement on the matter. “I am a victim and have spent the last week trying to make sense of what happened on June 4,” Olympios began. “Although I have little memory of that night, something bad obviously took place, which I understand is why production on the show has now been suspended and a producer on the show has filed a complaint against the production. As a woman, this is my worst nightmare and it has now become my reality.” While Olympios initially hired a lawyer to look into the incident, she subsequently dropped the investigation after Warner Bros.’ own found that no misconduct had occurred on set.\n\nIn two subsequent interviews on Good Morning America and Bachelor in Paradise, Olympios, who did not return to the show when production restarted, elaborated on her blacked-out state during the controversial hook-up, while also insisting she has no ill will toward Jackson or the show's production team. The Bachelor star went so far as to say that she was “super thankful” to the producers, and felt primarily victimized not by her fellow cast mate, but by the subsequent media scrutiny. “I was a victim of, you know, just being blown into the media and having people make these crazy assumptions and judgments about what happened that day,” Olympios explained on Good Morning America. In an interview with The Daily Beast, Olympios reiterates: “You know, Bachelor Nation, I’ll always have a lot of love for because they’re like family to me.”\n\nSpeaking to The Daily Beast from her new home in Los Angeles, Olympios says putting this scandal behind her has been both a struggle and a relief. “I’m just really glad that it’s all kind of unfolding, that people are seeing the bigger picture, as opposed to just like ‘media scandal in Paradise.’ I’m really happy that everyone’s moving past it now,” she croaks, explaining that she lost her voice on a recent girls’ trip. Perhaps in an effort to preserve her vocal cords, Olympios declines to elaborate on the specifics of the scandal, demurring, “I feel like I explained myself pretty well [on Bachelor in Paradise.]”\n\nDuring that recently aired sit-down interview with host Chris Harrison, Olympios set out to tell her side of the story. “I feel like people weren’t really understanding because I didn’t speak out for so long,” she says. “I feel like everyone was just trying to get to the bottom of it quickly, so they were just making up whatever came to their minds. But everyone should have just waited to hear it from me.”\n\nWhile Harrison and Olympios’ talk dwelled on the difficult summer that Olympios has endured in the eye of the tabloid storm, she’s quick to assure me that the painful-to-watch interview was actually a cathartic experience. “It’s honestly like a weight has been lifted off my shoulders,” she gushes. “I was so nervous, I was afraid that there would be even more backlash, but I’m really glad that it’s done.”\n\nWhile Olympios was aware that signing up for The Bachelor would make her something of a public figure, she had no way of knowing she would become the subject of one of the summer’s biggest entertainment scandals. “I never thought it would be like this,” Olympios reveals, explaining that the constant headlines have taken a toll on her and her loved ones. “It’s never easy, especially for my friends and family, seeing this stuff in the media—they’ll see something in an article and be like, ‘Is this true? What’s true, what’s not true?’” she sighs. “It was just really hard because I was trying to keep myself OK and also keep my close friends and family OK at the same time.”\n\nDespite a summer from tabloid hell, Olympios is doubling down on her newfound fame with a litany of projects that ought to keep her in the public eye for more news cycles to come. She’s “still in the creating process” of a reality-TV show that she’s reticent to speak about. But she is happy to share details of an upcoming scripted show, a collaboration between herself and How to Lose a Guy in 10 Days producer Christine Peters.\n\nThe show, which will feature Olympios both in front of and behind the camera, will “be about dating in this millennial world we’re in,” she divulges, adding, “I think people just get so worked up about creating, like, dating pages, or… I feel like it just becomes such a topic of conversation, like, ‘Oh my God, who are you dating? What kind of guy are you going to date? Does this person even look like their picture?’ I just feel like there are so many questions and new ways of dating, so it’s comical in itself.” Olympios plans to mine her own and her friends’ romantic lives for fodder, but demurs when I ask if she’s playing the field for more material. “For material? No!” she laughs. “I have enough material built up, believe me.”\n\nOlympios is “constantly busy!” with a charitable collaboration with IVI sunglasses in the works (“we’re doing some really cool frames”) and a relaunch of her clothing line, which she’s trying to shift “from a merch line to more of a fashion-forward line.” Corn fanatics ate up the first iteration of Olympios’ line, which emblazoned items with “Corinneisms” like “Platinum Vagine” and “Make America Corinne Again.” By the way, Olympios swears that her controversial catchphrase isn’t a political statement, and that she can’t even remember how she came up with it. “I wish I could tell you how that was born,” she laughs. “I think it was just a really long and tedious interview that I was probably doing at 4 a.m. somewhere in the world. And I was probably delusional.”\n\nOn top of two new television projects and conquering the world of non-merch fashion, Olympios is writing a book that she swears will reveal the real Corinne. “I really am excited for my fans to read it, because a lot of fans are like, ‘How are you just OK all the time? How are you so you?’ and it’s like no, this is me letting you in,” Olympios continues. “I’m not OK all the time. It took me a lot to get me to where I am. It took me hard times, happy times, sad times. I’ve had 25 million breakdowns. It’s OK to be in situations where you think that things aren’t going to be OK, but they always will be. You have to stay true to yourself. So I feel like a lot of people will be able to relate to that.”\n\nWhen I ask Olympios if she is working on anything else, she responds with an exuberant “Myself!” “I’m really just taking my time to be with friends and family, to heal, and just really working on myself,” she elaborates. “I’m just gonna keep doing all this great stuff, I’m not going to stop, I’m going to keep doing what I love, and I trust myself to lead me to the right path.”\n\nOne direction that path won’t be leading her toward is Nick Viall, her recently single onscreen ex. Olympios shuts down any intimations that a Nick-Corinne reunion could be in the cards (“No probably not, honestly”) adding, “We’re friends! I love the guy, but just as friends.”", "images": ["https://img.thedailybeast.com/image/upload/c_fill,h_200,w_200,x_0,y_0/v1489779073/author/amy-halperin-zimmerman-author.jpg", "https://img.thedailybeast.com/image/upload/v1550872986/White2x_hcwpd6.png", "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_1.5/c_limit,w_1044/fl_lossy,q_auto/v1504582753/170905-zimmerman-corinne-olympios-hero_lwc8uv", "https://img.thedailybeast.com/image/upload/v1549916286/logo_km2qs4.png", "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1504582753/170905-zimmerman-corinne-olympios-hero_lwc8uv"], "top_img": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1504582753/170905-zimmerman-corinne-olympios-hero_lwc8uv", "keywords": [], "authors": ["Amy Zimmerman", "Entertainment Reporter"], "canonical_link": "https://www.thedailybeast.com/corinne-olympios-on-moving-past-the-bachelor-in-paradise-sex-scandal", "title": "Corinne Olympios on Moving Past the ‘Bachelor in Paradise’ Sex Scandal", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "title": "Corinne Olympios on Moving Past the ‘Bachelor in Paradise’ Sex Scandal", "keywords": "The Bachelorette, Chris Harrison, ABC News, Bachelor", "og": {"title": "Corinne Olympios on Moving Past the ‘Bachelor in Paradise’ Sex Scandal", "description": "The contestant at the center of the biggest scandal in ‘Bachelor’ franchise history is determined to move on, despite a summer of overbearing media scrutiny.", "url": "https://www.thedailybeast.com/corinne-olympios-on-moving-past-the-bachelor-in-paradise-sex-scandal", "site_name": "The Daily Beast", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1504582753/170905-zimmerman-corinne-olympios-hero_lwc8uv"}, "description": "The contestant at the center of the biggest scandal in ‘Bachelor’ franchise history is determined to move on, despite a summer of overbearing media scrutiny.", "authors": "Amy Zimmerman", "wrap": "/content/dailybeast/entertainment", "article": {"section": "entertainment", "published_time": "2017-09-05T05:00:00.000Z", "author": "https://www.thedailybeast.com/authors/amy-zimmerman"}, "fb": {"app_id": 189930913679}, "twitter": {"card": "summary_large_image", "site": "@thedailybeast", "creator": "@ahzimm", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_600/f_jpg/fl_lossy,q_auto/v1504582753/170905-zimmerman-corinne-olympios-hero_lwc8uv"}, "sailthru.date": "2017-09-05T05:00:00.000Z", "sailthru.expire_date": "2017-09-19T05:00:00.000Z", "publicationDate": 201709050500, "parsely-page": "{\"author\":\"Amy Zimmerman\",\"link\":\"https://www.thedailybeast.com/corinne-olympios-on-moving-past-the-bachelor-in-paradise-sex-scandal\",\"metadata\":{\"articleType\":\"article\",\"rubric\":\"SHE’S BACK\"},\"post_id\":\"corinne-olympios-on-moving-past-the-bachelor-in-paradise-sex-scandal\",\"pub_date\":\"2017-09-05T05:00:00+00:00\",\"section\":\"Entertainment\",\"tags\":[\"The Bachelorette\",\"Chris Harrison\",\"ABC News\",\"Bachelor\",\"typeArticle\"],\"title\":\"Corinne Olympios on Moving Past the ‘Bachelor in Paradise’ Sex Scandal\",\"type\":\"post\"}"}, "movies": ["https://www.youtube.com/embed/O1mBZTRIZHo?&enablejsapi=1&playsinline=0&autoplay=0", "https://www.youtube.com/embed/yf5eCBoEuAQ?&enablejsapi=1&playsinline=0&autoplay=0"], "publish_date": 1504587600.0, "source": "https://www.thedailybeast.com", "summary": ""}