{"url": "https://www.thecut.com/2018/04/smallville-allison-mack-sex-cult-nxivm-everything-to-know.html", "text": "Allison Mack. Photo: Albert L. Ortega/Getty Images\n\nAllison Mack first achieved fame in the early aughts, when she was cast as an original character on the TV series Smallville; the second time her name started popping up in the news with increasing frequency was in April 2018, when she was arrested by the FBI for her suspected involvement in NXIVM, an organization that allegedly brainwashed, manipulated, and blackmailed women into being “sex slaves.”\n\nIn the past year, the emerging details surrounding the case — many of which have involved Mack — have only only grown increasingly disturbing, including allegations that she recruited women to be “sex slaves” in an internal secret society, where she branded them with founder Keith Raniere’s initials and blackmailed them. Most recently, on April 8, Mack tearfully pleaded guilty to one charge of racketeering conspiracy and and charge of racketeering in Brooklyn federal court.\n\nBelow, here’s everything you need to know about Allison Mack’s involvement.\n\nFirst things first: How do you say “NXIVM”?\n\nIt’s pronounced “Nexium.”\n\nAnd what exactly is it?\n\nIt’s an Albany-based cult with connections all over the world that reportedly masquerades as a “self-help” organization meant to empower women. It was thrust into the spotlight in October 2017, when a New York Times investigation found that the women who were involved were referred to as “slaves,” and subject to ritual humiliations and brandings. They were also allegedly told to starve themselves to achieve founder Keith Raniere’s standard of beauty and to have sexual encounters with him. (In late March 2018, Raniere was arrested and charged with sex trafficking, and has since been charged with child pornography.)\n\nHow did Mack get involved?\n\n﻿According to the New York Post, Mack’s Smallville co-star, Kristin Kreuk, introduced Mack to NXIVM in 2006. While Kreuk admitted that she was involved with the sex cult, she claims that her involvement predated the ritual brandings and other humiliating practices to which the cult subjected women. “The accusations that I was in the ‘inner circle’ or recruited women as ‘sex slaves’ are blatantly false,” Kreuk said on Twitter.\n\nIn an interview Mack gave with Times reporter Vanessa Grigoriadis six months before her arrest, she claimed that she came up with practice of cauterizing the flesh of “sex slaves” in the NXIVM secret society, DOS.\n\nWhat are Mack’s charges?\n\nShe was initially charged with sex trafficking and forced labor charges, which could’ve led to life in jail. In Brooklyn court on April 20, 2018, assistant U.S. attorney Moira Penza said, “Ms. Mack was one of the top members of a highly organized scheme which was designed to provide sex to [Raniere]. Under the guise of female empowerment, she starved women until they fit her co-defendant’s sexual feminine ideal.” During that court appearance, Mack pleaded not guilty.\n\nNearly a year later, though, Mack changed her plea. On April 8, she pleaded guilty to one count of racketeering conspiracy and one count of racketeering, and fully admitted to the allegations against her: that she was a member of DOS, and that she had attempted to recruit other women into the group. She also confessed that she forced women in DOS to hand over embarrassing information about themselves, known as “collateral,” so that she could blackmail them were they to not act accordingly to her or Raniere’s orders.\n\n“I have come to the conclusion that I must take full responsibility for my conduct, and that’s why I am pleading guilty today,” she said. “I’m very sorry for the victims of this case.”\n\nSo what’s next for Mack?\n\nOn April 8, Mack’s sentencing was set for September 11. She is facing up to 40 years in prison.", "images": ["https://pixel.nymag.com/imgs/fashion/daily/2018/04/22/22-allison-mack.w700.h700.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/04/22/22-allison-mack.w1200.h630.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pixel.nymag.com/imgs/fashion/daily/2018/04/22/22-allison-mack.w1200.h630.jpg", "keywords": [], "authors": ["Amanda Arnold"], "canonical_link": "https://www.thecut.com/2019/04/smallville-allison-mack-sex-cult-nxivm-everything-to-know.html", "title": "All About ‘Smallville’ Actress Allison Mack Role in Sex Cult", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Everything You Need to Know About Allison Mack’s Role in NXIVM Sex Cult", "url": "https://www.thecut.com/2019/04/smallville-allison-mack-sex-cult-nxivm-everything-to-know.html", "description": "The Smallville actress, who is charged with sex trafficking and related crimes, was released on $5 million bond on April 24.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/04/22/22-allison-mack.w1200.h630.jpg", "site_name": "The Cut", "type": "article"}, "twitter": {"title": "What to Know About Allison Mack’s Role in Sex Cult", "description": "The Smallville actress, who is charged with sex trafficking and related crimes, was released on $5 million bond on April 24.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/04/22/22-allison-mack.w600.h315.2x.jpg", "card": "summary_large_image", "creator": "@aMandolinz", "site": "@TheCut"}, "article": {"published_time": "2019-04-09T10:25:00.000-04:00", "tag": "nxivm, celebrity, sex cult, crime, sex trafficking, allison mack, smallville", "publisher": "https://www.facebook.com/cut"}, "description": "“Smallville” actress Allison Mack, who has been accused of being a recruiter for the NXIVM sex cult, is pleading not guilty to sex trafficking and conspiracy to commit forced labor.", "sailthru.tags": "nxivm, celebrity, sex cult, crime, sex trafficking, allison mack, smallville", "author": "Amanda Arnold", "fb": {"app_id": 343556435754245}, "type": "Article", "vertical": "The Cut", "apple-mobile-web-app-title": "The Cut", "application-name": "The Cut", "msapplication-TileColor": "#ff5656", "msapplication-TileImage": "https://assets.nymag.com/media/sites/thecut/icon.144x144.png"}, "movies": [], "publish_date": 1554819900.0, "source": "https://www.thecut.com", "summary": ""}