{"url": "https://web.archive.org/web/20170908125304/http://screenrant.com:80/greys-anatomy-dark-behind-scene-secrets-drama/", "text": "There’s no other show that knows how to deliver drama quite like Grey’s Anatomy, and that’s just when the cameras are rolling. Even as the Shondaland series heads into its fourteenth season, Grey’s Anatomy has just as much drama off screen as it does on.\n\nThere are only two cast members from the original line-ups of interns still on Grey’s Anatomy: the eponymous Meredith Grey (Ellen Pompeo) and Alex Karev (Justin Chambers). Given the insanely high death rate at Seattle Grace, are you really surprised that there’s some wild stuff going on behind the scenes?\n\nWhy did T.R. Knight really leave the show? What scene did ABC force Shonda Rhimes to change in season 1? Which actor was the entire cast rumored to be resentful of? And did Shonda Rhimes actually kill off Derek because she didn’t like him?\n\nHere are 15 Dark Behind-The-Scenes Secrets From Grey’s Anatomy You Had No Idea About. Let us know which ones surprised you the most!\n\n15. Patrick Dempsey was terrified of Shonda Rhimes\n\nWhen Patrick Dempsey first met Shonda Rhimes to discuss being a part of the show, he couldn’t help but notice the blank stare she gave him as everyone else in the room talked. He was completely terrified of her, and after that meeting, he said he was convinced she hated him. He was certain that it wasn’t going to work, and that he wouldn’t be a part of what was, at the time, an untitled drama about surgeons.\n\nLuckily for him, the blank stare and lack of warmth wasn’t because Shonda Rhimes hated him. She was just trying to imagine how she could possibly write dialogue for such a “dreamy” actor. And thus, Derek Shepherd, aka McDreamy, was created. (That affection, according to rumors, couldn’t last forever. RIP, McDreamy.)\n\n\n\n14. The network forced Shonda Rhimes to change an early scene\n\nIn the early days of Grey’s Anatomy, Shonda Rhimes received a lot of criticism from ABC. Reportedly, she was told to make several changes to her writing in the first season, including a scene with Alex Karev and Cristina Yang that was originally written for episode two, “The First Cut is the Deepest”. The scene was supposed to show the two of them them racing around the hospital to see who could deliver the most bad news to patients in the shortest amount of time, only to be shamed by the last patient.\n\nHowever, the network forced Rhimes to cut the scene from the episode because they felt it went too far. “I think the term that was used to describe me to my face was, ‘If you think you’re funny, you’re sick,'” Rhimes said. “I was stunned.” Instead, the new version of that scene shows Alex and Cristina racing to give out good news (and avoid getting too many hugs from patients).\n\n\n\n13. Shonda Rhimes kept track of how often a network exec. cursed at her\n\nSpeaking of criticism, Shonda Rhimes has admitted to clashing with the network quite a bit in the first two seasons of Grey’s Anatomy. The Alex and Cristina scene was just one incident, and Rhimes struggled with how she could continue to revise her writing without changing the show entirely.\n\nThe head of ABC at the time, Steve McPherson, apparently said some pretty nasty things to Rhimes after about the fourth or fifth episode. “He said really horrible things to me,” she said. “I literally started keeping a list of how many times he said a certain swear word to me. After that, I was like, ‘OK, we’re dead.'”\n\nThankfully, the show wasn’t dead, and instead had a strong series premiere — and is now heading into its fourteenth season.\n\n\n\n12. Meredith was supposed to date Burke, but Ellen Pompeo refused\n\nSeriously. Think about that one for a second. Can you imagine anything other than MerDer? Can you picture Meredith saying “pick me, choose me, love me” to anyone other than McDreamy himself? Well, things were almost very different.\n\nApparently, Shonda Rhimes wanted Meredith’s love interest to be Isaiah Washington’s Preston Burke rather than Patrick Dempsey’s Derek Shepherd. Ellen Pompeo, however, didn’t like that idea at all. Because she’s in an interracial relationship in real life, she didn’t want to also be in one on screen, because she felt it would “hit too close to home.”\n\nPompeo lobbied for MerDer to be the show’s big romance and instead, it was Cristina who fell for Burke, that is until he left her at the altar.\n\n\n\n11. Isaiah Washington reportedly choked Patrick Dempsey on set\n\nThere seem to be several different versions of this story, but Isaiah Washington and Patrick Dempsey definitely admitted to getting into a heated argument on set. They were in each other’s faces, yelling at each other, and one rumor has it that Washington had Dempsey by the throat. Either way, it was definitely a dramatic incident, and one that was apparently all about the work ethic on set.\n\nThe good news is that no one was hurt, and later, it’s said that the two were back to work with no problems. When Washington talked about the incident after that, he laughed that he had been so close to Dempsey that he could appreciate how blue his eyes were. Well, that’s nice!\n\n\n\n10. Isaiah Washington used a homophobic slur and was fired\n\nSpeaking of the fight between Isaiah Washington and Patrick Dempsey, Washington used a homophobic slur at some point in that exchange, and T.R. Knight, who played George O’Malley on the show, apparently felt that slur was directed at him. Now, since then, Knight has come out as a gay man, but at the time, that wasn’t case.\n\nWashington apologized for using the word later, saying, “I can neither defend nor explain my behavior,” Washington said in a statement. “I can also no longer deny to myself that there are issues I obviously need to examine within my own soul, and I’ve asked for help.”\n\nStill, he managed to use the word yet again and ultimately get himself fired from Grey’s Anatomy. So it’s no surprise that his guest appearance in season 10 was met with some controversy.\n\n\n\n9. Katherine Heigl dissed the show’s writing\n\nThis one is pretty darn unbelievable. After having won the Emmy award for supporting actress on Grey’s Anatomy the year before, Katherine Heigl opted to remove her name from Emmy consideration in 2008. “I did not feel that I was given the material this season to warrant an Emmy nomination and in an effort to maintain the integrity of the academy organization, I withdrew my name from contention,” she said in a statement. “In addition, I did not want to potentially take away an opportunity from an actress who was given such materials.”\n\nSurprising? Maybe not so much. Shonda Rhimes later opened up about the incident, saying, “On some level it stung, and on some level I was not surprised,” and “When people show you who they are, believe them.”\n\n\n\n8. Why T.R. Knight left the show\n\nGrey’s Anatomy has became known for killing off beloved characters and ripping our hearts out, and that trend started with the character of George O’Malley, who was tragically hit by a bus at the end of season 5. The real reason George was so tragically killed off? Because T.R. Knight decided he was ready to quit the show altogether.\n\nThe actor was reportedly unhappy that he wasn’t getting enough screen time. He also noted there was a “breakdown of communication” between himself and Shonda Rhimes, and he felt he no longer understood his character. Weirdly enough, George had enlisted in the military, which seemed like Rhimes’ way of writing him off the show with an opening to return– until he was brutally struck by a bus.\n\nKnight actually made a recent return to Shondaland, though, appearing as Alice’s brother, Tommy, on The Catch.\n\n\n\n7. The cast reportedly resented Kate Walsh for getting her own spin off.\n\nFans of Kate Walsh’s Addison Montgomery had to be thrilled about a spinoff revolving around the character, Private Practice. But the rest of the Grey’s Anatomy cast? Yeah, not so much.\n\nThe cast was rumored to be resentful of Kate Walsh for getting her own spin off, and they reportedly all gave her the cold shoulder once they heard the news. According to a source, “The rest of the cast seemed instantly resentful of (Walsh).” The source also stated that, “They each thought they’d be the one chosen to get their own show, and now they’re giving Kate the cold shoulder.” And reportedly, Ellen Pompeo “seemed particularly peeved because she felt that, as the star, she should have been consulted.”\n\n\n\n6. Why Erica Hahn was abruptly written off\n\nErica Hahn’s exit certainly didn’t offer any closure. She walked off to her car at the end of a shift, and that was that. We never saw her again. And in real life, the exit was nearly as abrupt.\n\nBrooke Smith she got the news that she was being let go, she was told the upcoming episode was her last. That was that. Smith said she got the feeling that it wasn’t Rhimes’ decision. It’s also rumored that the network was uncomfortable with the explicit nature of Erica and Callie’s relationship, though Rhimes later stated it wasn’t that at all: “Brooke Smith was obviously not fired for playing a lesbian. Clearly it’s not an issue as we have a lesbian character on the show – Calliope Torres. Sara Ramirez is an incredible comedic and dramatic actress and we wanted to be able to play up her magic. Unfortunately, we did not find that the magic and chemistry with Brooke’s character would sustain in the long run.”\n\n\n\n5. Shonda Rhimes: “No Heigls”\n\nShonda Rhimes isn’t someone you should mess around with. The showrunner has made it clear that after all the drama surrounding Grey’s Anatomy, including the Emmys disaster involving Katherine Heigl, she’s no longer going to tolerate anything of the sort.\n\nWhen she was discussing her new show at the time, Scandal, starring Kerry Washington, Rhimes was very clear about her stance on on-set drama: “I don’t put up with bulls–t or nasty people. I don’t have time for it,” she said. She also added, very specifically, “There are no Heigls in this situation.”\n\nIt’s also worth noting that Scandal main cast member Columbus Short (Harrison Wright) was let go from the show after drama in his personal life.\n\n\n\n4. Fans started a petition to have Jesse Williams fired\n\nAfter accepting BET’s Humanitarian Award in 2016, Jesse Williams gave an impassioned and inspiring speech about racism in our nation. That speech went viral, and it was also met with quite a bit of controversy. In fact, it was met with so much controversy that some fans started a petition to have Williams fired from Grey’s Anatomy.\n\nThe Change.org petition got 28,000 signatures, and stated that Williams’ speech was “a racist, hate speech against law enforcement and white people.” It also called for fans to boycott ABC. The petition was never going to go anywhere, though, and Shonda Rhimes was quick to let people know it. She offered a simple Tweet that summed everything up, saying, “Um, people? Boo don’t need a petition. #Shondalandrules”\n\n\n\n3. Surgery on set is gross\n\nSurgery on Grey’s Anatomy is always difficult to watch, at least if you’re a relatively squeamish person. Well, here’s something to make it worse. Those surgeries are made to look realistic, and super gross, because of what’s actually being used.\n\nA few examples? The show has been known to use cow organs and lamb brains, for starters. And for blood matter, they use a mixture of blood, chicken fat, and… Jello.\n\nSarah Drew, who plays April Kepner on the show, has even spoken out about how disgusting it is to work those things on set. In an interview, she stated, “We work with Bovine organs, which is cow’s organs. The smell is repulsive and makes us all gag. And we use an actual soldering tool to solder the organs. It smells like burning flesh. There’s also a lot of silicone and blood matter – red jello mixed with blood and chicken fat. It’s pretty gross.”\n\n\n\n2. Katherine Heigl wants to return, but Shonda Rhimes shut it down\n\nIf you’re hoping for Izzy Stevens to return to Grey’s Anatomy at some point, you might have to keep waiting. In 2012, long after Katherine Heigl left the series, she admitted she had made mistakes and that she’d like to be able to return Grey’s Anatomy and wear her scrubs once again. However, Shonda Rhimes stated that wouldn’t be happening any time soon.\n\nRhimes said in an interview, “I think it was really nice to hear her appreciating the show. We are on a track we have been planning, and the idea of changing that track is not something we are interested in right now.”\n\nHowever, anything could happen. There’s a reason Rhimes didn’t kill Izzie off, and in a different interview, Rhimes noted that she could be open to seeing Izzie again.\n\n\n\n1. Why Derek Was Killed Off\n\nOf all the characters to be killed off on Grey’s Anatomy, this one remains the most shocking and arguably the most heartbreaking. Who would have thought we’d see the day when Patrick Dempsey’s Derek Shepherd was no longer a part of the series?\n\nThere’s a lot of speculation as to why Dempsey left Grey’s Anatomy, and Shonda Rhimes admitted to killing off at least one character because she didn’t like the actor who played them. Now, she didn’t admit to who, but considering the timing of that admission, along with multiple rumors, it’s easy to assume she was referring to Patrick Dempsey in that statement.\n\nDempsey’s response? He said he believes Shonda Rhimes “loves being provocative and that’s fine for who she is.” Talk about passive aggressive!\n\n—\n\nWhich of these behind-the-secrets from Grey’s Anatomy surprises you the most? Share with us in the comments!\n\nGrey’s Anatomy returns to ABC Thursday, September 28th at 8/7c.\n\nThePremium Network Ad Free Browsing\n\nAd Free Browsing Over 10,000 Videos!\n\nOver 10,000 Videos! All in 1 Access\n\nAll in 1 Access Join For Free! GO PREMIUM WITH SCREENRANT Go Premium!", "images": ["https://web.archive.org/web/20170908125304im_/https://www.facebook.com/tr?id=297467373958238&ev=PageView&noscript=1", "https://web.archive.org/web/20170908125304im_/http://screenrant.com/wp-content/themes/screenrant/images/pr-go-premium-white.svg", "https://web.archive.org/web/20170908125304im_/http://screenrant.com/wp-content/themes/screenrant/images/pr-icon-light.svg", "https://web.archive.org/web/20170908125304im_/http://screenrant.com/wp-content/uploads/2017/09/Greys-Anatomy.jpg", "https://web.archive.org/web/20170908125304im_/http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1", "https://web.archive.org/web/20170908125304im_/http://screenrant.com/wp-content/themes/screenrant/images/pr-part-of-1.svg"], "top_img": "https://web.archive.org/web/20170908125304im_/http://screenrant.com/wp-content/uploads/2017/09/Greys-Anatomy.jpg", "keywords": [], "authors": ["Ashley Bissette Sumerel"], "canonical_link": "https://web.archive.org/web/20170908125304/http://screenrant.com/greys-anatomy-dark-behind-scene-secrets-drama/", "title": "Grey’s Anatomy: 15 Dark Behind-The-Scenes Secrets You Had No Idea About", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "syndication-source": "http://screenrant.com/greys-anatomy-dark-behind-scene-secrets-drama/", "twitter": {"domain": "ScreenRant.com", "site": "@screenrant", "card": "summary_large_image", "title": "Grey’s Anatomy: 15 Dark Behind-The-Scenes Secrets You Had No Idea About", "description": "Grey's Anatomy has been serving TV drama for 13 seasons, but the behind-the-scenes drama is even crazier! Here are all the dark secrets from the set.", "image": {"src": "http://screenrant.com/wp-content/uploads/2017/09/Greys-Anatomy.jpg"}}, "news_keywords": "Lists", "description": "Grey's Anatomy has been serving TV drama for 13 seasons, but the behind-the-scenes drama is even crazier! Here are all the dark secrets from the set.", "fb": {"app_id": 1682953215260932}, "og": {"type": "article", "title": "Grey’s Anatomy: 15 Dark Behind-The-Scenes Secrets You Had No Idea About", "url": "https://web.archive.org/web/20170908125304/http://screenrant.com/greys-anatomy-dark-behind-scene-secrets-drama/", "locale": "en_US", "description": "Grey's Anatomy has been serving TV drama for 13 seasons, but the behind-the-scenes drama is even crazier! Here are all the dark secrets from the set.", "site_name": "Screen Rant", "image": {"identifier": "https://web.archive.org/web/20170908125304im_/http://screenrant.com/wp-content/uploads/2017/09/Greys-Anatomy.jpg", "width": 620, "height": 310}}, "article": {"publisher": "http://www.facebook.com/ScreenRant", "published_time": "2017-09-06T11:01:15+00:00", "modified_time": "2017-09-06T11:01:15+00:00", "author": "Ashley Bissette Sumerel", "section": "Lists"}, "robots": "noydir"}, "movies": [], "publish_date": 1504695675.0, "source": "https://web.archive.org", "summary": ""}