{"url": "https://www.seventeen.com/celebrity/movies-tv/a20170663/drake-bell-josh-peck-wedding-drama-the-challenge/", "text": "Around this time last year, Drake Bell and Josh Peck put fans of their classic Nickelodeon show, Drake & Josh, through the emotional ringer. Josh neglected to invite Drake to his wedding and Drake called him out on Twitter, forcing fans to face the possibility that their fave TV brothers weren't nearly as friendly IRL.\n\nBut, as it turns out, the reason why Drake lashed out against Josh online was not because they weren't friendly, it's because they're like actual brothers.\n\nAnd apparently, Josh was the worse for the wear. In an interview with Digital Spy, Drake said, \"I think it was a lot more toxic towards Josh unfortunately.\" He went on:\n\n\"He's like, 'Man people were yelling at me on the street! Why didn't you invite Drake to the wedding? People were yelling at me on the street.' I was like, 'Dude I'm so sorry, I didn't think it was going to be that big of a deal.'\n\nYikes.\n\n\"I thought it was going to be some funny 'well, guess you won't get invited to the wedding, blah, blah, blah,'\" Drake said. \"But I did feel bad for Josh because people really did attack him. And I'm like, 'Bro, this is a brotherly thing.'\"\n\nBut Drake said they're all good now. \"We talked about it and I was like, 'Dude I'm just a little bummed,' and he was like, 'Honestly, first of all I didn't think you'd wanna come, secondly, it was such a nightmare putting it all together, and scheduling and invitations, and then I just let my wife handle it all,'\" he said.\n\nDrake stopped by Seventeen.com HQ to talk about his latest television gig — competing as a celebrity on one of MTV's longest-running game shows, The Challenge: Champs vs. Stars. While he was here, we had to get the deets on his brotherly beef with Josh and see if the former co-stars are still on good terms.\n\n\"It’s something you would have said to your brother if you weren't in the public eye and have a bunch of fans,\" Drake told Seventeen.com about calling out Josh on Twitter for not getting an invite to his wedding. \"I even texted him and said it. I just wanted to make sure he got the message, you know what I mean?\" he asked, laughing. \"That’s the only reason I went to social media with it. Because I did go to him personally and text him, 'Like, yo, bro, what the hell? I’m here, we’ve been talking. What’s going on?'\"\n\nDrake didn't get his invite due to a simple case of Josh and his wife, Paige O'Brien, being overwhelmed with all the planning that went into putting together a wedding. \"Of course, it all just comes down to, 'Do you know what it’s like to plan a wedding? I’ve got my wife saying this! It costs this. I’m tasting whether I want chicken, or beef, or lamb! Like, I don’t know! I just want to get married. So don't take it personally, but there was just a certain number of people…'\"\n\nOf course, Drake wasn't going to let Josh off the hook that easily. \"I was like, 'What? One piece of chicken? One piece of chicken is gonna cost you that much more?' So we went back and forth and had our jokes and had our fun.\"\n\nSo, is there pressure to be perfect friends with the entire world watching every single thing they do on social media? Drake doesn't think so.\n\n\"I’ve known him since I was 12 or 13 years old. So, when you’re going on 19 years of a relationship with someone, it’s such a real and authentic and engrained relationship in my life that there’s never really a point where I’m thinking we have to turn our relationship on for the cameras or we've gotta be perfect for the fans right now. We kind of are just like real brothers.\"\n\nDrake even admitted that back in the day, on the set of Drake & Josh, they had the same type of relationship. \"There were some days I wouldn't want to talk to Josh unless it was dialogue. Like, unless it says I have to talk to you in the script, I don't want to talk to you. Then there would be moments when we would finish a 13-hour day where we were non-stop together and we’d be walking to our cars and we’d be like, 'Hey, what are you doing right now?' 'Just going back to my house. Play some video games.' 'Okay, cool. See you in a minute.' So there’s moments where we’re absolutely inseparable and we think every single thing that comes out of each other’s mouths is absolute genius and Josh is the most brilliant person I’ve ever met. Then there are times I just wanna throw him through a wall. It’s just like my little brother.\"\n\nThe old friends were able to put everything behind them. They even filmed a hilarious vlog together to prove they're still the best of friends.\n\n\"We’re such a big part of each other’s lives. Like our history goes back before Drake & Josh and before The Amanda Show. I knew him before we even stepped in front of a camera together. We’re always going to be brothers. But even outside this whole facade of 'Oh we’re brothers,' we really are good friends. I love the guy... It really does show our relationship that we might not speak for a month or two. Literally not talking. Me thinking, 'Oh my god, he probably hates me.' But the second we’re in the same room and we lock eyes, what happens? The guy kisses me on the cheek, we hug, we’re like, ‘Oh, I missed you bro!' The second we're in the same room, everything’s back to normal.\"\n\nAs good as Drake and Josh are at putting the drama aside for the sake of brotherhood, the same can't be said for Drake's competitors on The Challenge: Champs vs. Stars. Drake got involved with the competition, competing alongside other celebs like Cardi B’s sister Hennessy Carolina and Lil Mama, to win money for the Global Down Syndrome Foundation, but he soon learned The Challenge isn't all about physical competition.\n\n\"When you come into this experience just thinking, 'I gotta get to the top of the jungle gym first,” and you’re like, 'Okay, cool. Let’s go.' Then realizing it’s a 24-hour game and that most of the game happens outside of the physical challenges. I had no idea there was such a psychological aspect to the game,\" Drake said. \"I had no idea there’d be undermining and people saying one thing and then going behind people’s backs to benefit them. So that was pretty shocking.\"\n\nDrake's strategy to get as far as possible in the game: be invisible. Well, as invisible as possible when you're the star of every girl on set's favorite teenaged show (the first thing one of Drake's fellow competitors said to him on set was, \"Hug me, brotha!\").\n\n\"I just stayed quiet. When the challenges came, I just did my best to not be in the bottom three,\" he shared. \"Then when we got into the room and all the people started yelling and screaming at each other and throwing people under the bus and outing people for this and that. You know, that’s when I would just lean back, take it all in, and remove myself from that aspect of it. So that was my strategy. Don’t be a target.\"\n\nSo what can we expect next from Drake? Hopefully a Drake & Josh reboot, right? Yeah, actually — if Drake has anything to do with it, at least.\n\n\"One hundred percent, I would do it tomorrow. I would do it tonight. I would do it right now,\" Drake said when we asked if he was down for a Drake & Josh reboot. \"I’m a freak about classic television and I’m so nostalgic and I grew up obsessing over classic television. I feel like Josh and I were able to do something, maybe not equivalent, but something that feels to me like I got to be part of a Seinfeld or a Golden Girls. A classic piece of television history.\"\n\nDrake even has some ideas on where the reboot could pick up. \"There’s so much story to be told for our characters. Like what happened? Did Drake stay a loser and not go to college and try to become a rock star? Did Josh stay his manager or did he go off to college? There’s so much story there and I feel like Josh and I still have the chemistry where it can be fresh and new and funny. I would love to be able to do that for our fans. I would love to be able to have our fans be like, 'What? Meghan’s an adult now and she’s still evil? She still destroying Drake and Josh’s life, but from her job in Chicago?' All these crazy things I think fans would love. I’ve had so many funny ideas. I know that I’m 100% down to do it, I know that Dan Schneider is 100% down to do it. We just gotta convince JP.\"\n\n\n\nOkay, Josh. The ball is in your court. Make it happen! But in the meantime, you can watch Drake tell his funniest and most embarrassing life stories (including his most memorable moments on the set of Drake & Josh) by clicking play above. Then catch Drake on The Challenge: Champs vs. Stars on MTV Tuesday nights at 10 p.m..\n\nNoelle Devoe is the Entertainment Editor at Seventeen.com. Follow her on Twitter and Instagram!", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-485459381-1525698959.jpg?crop=1xw:0.6270903010033445xh;center,top&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-485459381-1525698959.jpg?crop=1xw:0.6270903010033445xh;center,top&resize=1200:*", "keywords": [], "authors": ["Noelle Devoe", "Entertainment Editor", "When I'M Not Holed Up In My Room Going On A Completely Unproductive Netflix Binge Or Tumblr Stalking Timothée Chalomet", "I'M Searching For Awesome Celeb News Stories That Seventeen Readers Will Love"], "canonical_link": "https://www.seventeen.com/celebrity/movies-tv/a20170663/drake-bell-josh-peck-wedding-drama-the-challenge/", "title": "Drake Bell Reveals Exactly Why Josh Peck Didn't Invite Him to His Wedding", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Seventeen", "title": "Drake Bell Says Fans Freaked Out On Josh Peck After His Wedding Snub", "description": "Apparently, people would yell at Josh on the street!", "url": "https://www.seventeen.com/celebrity/movies-tv/a20170663/drake-bell-josh-peck-wedding-drama-the-challenge/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-485459381-1525698959.jpg?crop=1xw:0.6270903010033445xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 112965278727107, "pages": 8028997215}, "article": {"publisher": "https://www.facebook.com/seventeen", "modified_time": "2018-08-15 09:24:44", "published_time": "2018-08-15 09:00:00", "section": "Movies & TV", "opinion": "false"}, "twitter": {"site": "@seventeen", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-485459381-1525698959.jpg?crop=1xw:0.6270903010033445xh;center,top&resize=640:*"}, "google-site-verification": "uQMdsrh02fvs6lNVGcB04v0iEtK1MpGMQ3UF-Fy0RVI", "title": "Drake Bell Reveals Exactly Why Josh Peck Didn't Invite Him to His Wedding", "description": "The Drake & Josh star dishes to Seventeen.com about whether he's up for a reboot, his new TV gig, and more.", "keywords": "Drake Bell, Josh Peck, Miranda Cosgrove, Drake and Josh, Nickelodeon, Nostalgia, Nickelodeon Drama, Drake and Josh All Grown Up, Drake and Josh Where Are They Now, Drake and Josh Drama, Drake and Josh Wedding Drama", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-485459381-1525698959.jpg?crop=0.7973333333333333xw:1xh;center,top&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebs & Entertainment,celebrity,movies-tv,drake and josh,Drake Bell,Josh Peck,Nickelodeon", "sailthru.date": "2018-08-15T21:00:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-485459381-1525698959.jpg?crop=1xw:0.6270903010033445xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-485459381-1525698959.jpg?crop=0.7973333333333333xw:1xh;center,top", "sailthru.socialtitle": "Drake Bell Says Fans Freaked Out On Josh Peck After His Wedding Snub", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1534294800.0, "source": "https://www.seventeen.com", "summary": ""}