{"url": "https://en.wikipedia.org/wiki/Tom_Holland_(actor)", "text": "British actor\n\nThomas Stanley Holland (born 1 June 1996)[1] is an English actor. He first gained recognition for his starring role in the disaster film The Impossible (2012), receiving the London Film Critics Circle Award for Young British Performer of the Year. He rose to stardom for playing Peter Parker / Spider-Man in the Marvel Cinematic Universe superhero films Captain America: Civil War (2016), Spider-Man: Homecoming (2017), Avengers: Infinity War (2018), Avengers: Endgame (2019), and Spider-Man: Far From Home (2019).\n\nA graduate of the BRIT School in London, Holland previously appeared on stage in the title role of Billy Elliot the Musical in London's West End in 2008, and his other films include In the Heart of the Sea (2015), and The Current War (2017). In 2017, Holland received the BAFTA Rising Star Award.\n\nEarly life\n\nHolland was born in Kingston upon Thames, London,[2] to Nicola \"Nikki\" Elizabeth (née Frost), a photographer, and Dominic Holland, a comedian and author.[3][4] His paternal grandparents were born on the Isle of Man and Tipperary, Ireland, respectively.[5][6] He has three younger brothers: twins Harry and Sam (b. 1999) and Patrick \"Paddy\" (b. 2004).[3][7]\n\nHolland was educated at Donhead, a Roman Catholic preparatory school in Wimbledon in South West London,[8] followed by Wimbledon College, a voluntary aided Jesuit Roman Catholic comprehensive school (also in Wimbledon), up until December 2012. Holland has said he was bullied in school for being a dancer.[9] After Wimbledon College he attended The BRIT School for Performing Arts and Technology in Croydon.[4] Holland first learned gymnastics during his time performing in Billy Elliot the Musical.[10] In his late teens, during a lull in his career, Holland briefly attended carpentry school in Cardiff, Wales.[11]\n\nCareer\n\nTheatre\n\nHolland began dancing at a hip hop class at Nifty Feet Dance School in Wimbledon. His potential was spotted by choreographer Lynne Page (who was an associate to Peter Darling, choreographer of Billy Elliot and Billy Elliot the Musical) when he performed with his dance school as part of the 2006 Richmond Dance Festival.[12]\n\nAfter eight auditions and two subsequent years of training, on 28 June 2008, Holland made his West End debut in Billy Elliot the Musical as Michael, Billy's best friend.[13] He gave his first performance in the title role on 8 September 2008, receiving positive notices.[7][14]\n\nIn September 2008, Holland (together with co-star Tanner Pflueger) appeared on the news programme on channel FIVE and gave his first TV interview. The following year, he was featured on ITV1 show The Feel Good Factor.[15] At the premiere on 31 January, Holland and two actors also playing the title role, Pflueger and Layton Williams, performed a version of \"Angry Dance\" from Billy Elliot the Musical, after which Holland was interviewed by host Myleene Klass. He trained five British schoolboys for a dance routine he fronted for the final The Feel Good Factor show on 28 March 2009.[16]\n\nOn 8 March 2010, to mark the fifth anniversary of Billy Elliot the Musical, four current Billy Elliots, including Holland, were invited to 10 Downing Street to meet the Prime Minister, Gordon Brown.[17][18] Holland was chosen to be a lead at the fifth-anniversary show on 31 March 2010.[19] Holland appeared on a regular basis as Billy in Billy Elliot the Musical, rotating with three other performers,[20] until 29 May 2010, when he finished his run.\n\nTelevision\n\nIn 2015, Holland appeared in four episodes of BBC Two's TV series Wolf Hall, as Gregory Cromwell, son of the protagonist Thomas Cromwell played by Mark Rylance.[21]\n\nHolland appeared with Zendaya on Paramount Network's Lip Sync Battle. On the show, he performed a dance number to Rihanna's \"Umbrella\".[22]\n\nEarly film roles\n\nIn 2011, Holland was cast in the British version of the animated film Arrietty, produced by Japan's Studio Ghibli. He provided a voice for the principal character Sho.[23]\n\nHolland made his feature film debut in The Impossible, directed by Juan Antonio Bayona, alongside Naomi Watts and Ewan McGregor. Holland was praised so highly, that there were even rumours he was a contender for an Academy Award, though he was not nominated. The film premiered at the Toronto International Film Festival on 9 September 2012 and was a critical and commercial success, earning $180.3 million worldwide and Holland received universal praise from critics and won several awards such as the National Board of Review Award for Breakthrough Performance and London Film Critics Circle Award for Young British Performer of the Year.[24][25]\n\nHolland starred as Isaac in the drama film How I Live Now, which was released in the UK on 4 October 2013, co-starring Saoirse Ronan and co-starred as Thomas Nickerson in the film In the Heart of the Sea (2015), directed by Ron Howard.[26] Holland also appeared in Locke (2013) alongside Tom Hardy in a supporting role and made a brief appearance in Billy Elliot the Musical Live (2014) to celebrate his role as a 'former Billy'.\n\nSpider-Man\n\nOn 23 June 2015, it was announced that Holland was cast as a teenage Peter Parker / Spider-Man,[27] and his \"life was flipped upside down\", as he later tweeted,[28] as part of a six-picture deal with Marvel Studios.[29] As part of the Marvel Cinematic Universe (MCU), he first appeared as Spider-Man in Captain America: Civil War (2016).[30] The film was a massive critical and commercial success, grossing over $1.1 billion worldwide, making it the highest-grossing film of 2016,[31] with Holland receiving critical praise.[32][33]\n\nIn July 2017, Spider-Man: Homecoming was released, in which Holland reprised his role from Captain America: Civil War. Earning $117 million in box office receipts in its first weekend,[34] Homecoming received positive reviews and Holland considerable praise, with his performance being called \"a star performance given by a born actor.\"[35] The film went on the gross over $800 million worldwide. This performance earned Holland a Guinness Book of World Records title as the youngest actor to play a title role in the MCU.[36]\n\nHolland reprised Spider-Man in Avengers: Infinity War, which was released on 27 April 2018, and then in that film's follow-up, Avengers: Endgame, released on 26 April 2019. Holland began shooting the sequel Spider-Man: Far From Home in July 2018, with production wrapping that October. The film was released worldwide on 2 July 2019.[37] The trailer was first shown at Sony's CCXP Brazil panel on 8 December 2018, with Holland and Jake Gyllenhaal, who portrays Mysterio, in attendance to promote the film. Holland is set to reprise his role in a third film, set to release on 16 July 2021.\n\n2016–present\n\nIn 2016, he played Bradley Baker in the film Edge of Winter, where he co-starred with Joel Kinnaman and Percy Hynes White. In 2017, Holland co-starred alongside Charlie Hunnam in the drama film The Lost City of Z, directed by James Gray, and released in April, to positive critical reception.[38] Holland also performed as the on-set stand-in for the character of The Monster as he would reunite with director J.A Bayona in the film A Monster Calls. Actor Liam Neeson provided the voice for the character, whilst Holland was credited with a special thanks.[39]\n\nIn 2017, he co-starred alongside Richard Armitage and Jon Bernthal in the film Pilgrimage. The film premiered on 23 April 2017 at the Tribeca Film Festival, in its \"Viewpoint\" sections. Also that year, Holland played Samuel Insull alongside Avengers co-star Benedict Cumberbatch in Alfonso Gomez-Rejon's The Current War, which premiered at the Toronto International Film Festival.[40] Early reviews of The Current War was met with a mixed response; however, Holland's performance in the film was praised by critics. After The Current War's wider release was met with a delay due to the Harvey Weinstein controversy, in October 2018, Lantern Entertainment, which acquired The Weinstein Company's assets through its bankruptcy, and 13 Films, an international distribution and finance company, struck a deal to co-distribute the film internationally in 2019. He co-starred with Will Smith in the Blue Sky Studios animated film Spies in Disguise, voicing the film's leads, which was released in December 2019.[41] In 2020, Holland voiced Jip, a dog, in the live action film Dolittle, alongside his MCU co-star Robert Downey Jr.. Holland voiced Ian Lighfoot, opposite Avengers co-star, Chris Pratt, in the Pixar animated film Onward.[42]\n\nUpcoming projects\n\nHolland has been cast in the film adaptation of Patrick Ness' best-selling science fiction series Chaos Walking as Todd Hewitt, alongside Daisy Ridley, which was planned to be directed by Doug Liman. Holland revealed after filming that a sequel was in the works.[43] He will star in The Devil All the Time, a horror film set post-World War II, alongside his Avengers co-star Sebastian Stan. The film, scheduled for release in 2020, was directed by Antonio Campos.\n\nIn May 2017, it was announced that he had been cast as a young Nathan Drake in the 2021 film adaptation of Naughty Dog's Uncharted video game series.[44] In March 2019, it was confirmed that Holland was cast as the lead role in Cherry, based on the novel of the same name, reteaming him with his Avengers directors, the Russo Brothers.[45] He is also now cast as the lead role in the film adaptation of Beneath the Scarlet Sky with Pascal Pictures.[46]\n\nIn 2016, Holland was cast in The Modern Ocean. The project encountered development problems but director Shane Carruth said in 2018 that the film was still in production and had not yet been cancelled, with plans to begin filming in 2020. Holland was set for a supporting role alongside Keanu Reeves, Daniel Radcliffe, Anne Hathaway and Jeff Goldblum.[47]\n\nHolland said that his long-term career plans are to \"do some more franchises,\" and play \"some meatier indie roles and eventually...transition to the other side of the camera and branch into directing.\"[48]\n\nPersonal life\n\nHolland resides in Kingston upon Thames in London, near the house of his parents and younger brothers.[49] He has a blue Staffordshire Bull Terrier named Tessa.[50] When he was seven, Holland was diagnosed with dyslexia.[51] In June 2015, Holland was seen wearing the uniform of the English football club Arsenal F.C. in a Daily Mirror article, which led many people to speculate that he was a fan of the club.[52] However, in a September 2019 video produced by GQ magazine, and released on that publication's YouTube channel, Holland stated that this was not the case.[53]\n\nAlong with his three younger brothers, Holland sponsors The Brothers Trust, a UK Registered Charity that raises money for various charitable causes.[54]\n\nFilmography\n\nKey Denotes films that have not yet been released\n\nFilm\n\nTelevision\n\nStage\n\nYear Title Role Venue Notes 2008–2010 Billy Elliot the Musical Billy Elliot / Michael Victoria Palace Theatre 8 September 2008 – 29 May 2010\n\nTheme park attractions\n\nAwards and nominations\n\nReferences\n\nFurther reading", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Tom_Holland_Billy_Elliot_2010_2b.jpg/180px-Tom_Holland_Billy_Elliot_2010_2b.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Tom_Holland_by_Gage_Skidmore.jpg/220px-Tom_Holland_by_Gage_Skidmore.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/3/37/Dagger-14-plain.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Tom_Holland_by_Gage_Skidmore.jpg/1200px-Tom_Holland_by_Gage_Skidmore.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Tom_Holland_by_Gage_Skidmore.jpg/1200px-Tom_Holland_by_Gage_Skidmore.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Tom_Holland_(actor)", "title": "Tom Holland (actor)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Tom_Holland_by_Gage_Skidmore.jpg/1200px-Tom_Holland_by_Gage_Skidmore.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}