{"url": "https://www.livestrong.com/article/277075-how-to-increase-eyebrow-hair/", "text": "LittleBee80/iStock/Getty Images\n\nThick, full eyebrows add definition to the eyes and upper portion of the face; but if you've gotten tweezer-happy or your eyebrows are naturally thin, you may be in need of a boost. While you can use an eyebrow pencil to add some faux brow hairs, you may find it doesn't look as natural as you'd like. With just a bit of effort and a few beauty tricks, you can help your eyebrows grow in thicker.\n\nAvoid the temptation to pluck. Brush stray hairs into place with a brow brush. If you just can’t stand the messy look, use a brow razor to shape your brows to look more tidy. The brow razor is specifically designed to shave the eyebrow area, and this technique can actually help the hair grow in thicker.\n\nExfoliate the eyebrow area daily to help stimulate hair growth. Rub a dry soft toothbrush back and forth over the eyebrows for a couple of minutes to help get rid of the dry dead skin and promote new hair growth.\n\nMoisten a clean mascara want with castor oil. Brush the oil gently onto your eyebrows every night before going to bed. Rub a cotton swab over the eyebrows to remove the excess oil. Castor oil is high in vitamin E, essential fatty acids and a variety of other nutrients that increase hair growth and stimulate proper circulation.\n\nGive your eyebrows a massage every day. Put a drop of olive oil onto your fingertips and rub your eyebrows and the surrounding area gently for about 5 minutes. This helps stimulate proper circulation, which in turn can increase hair growth.\n\nEat a healthy diet. Load up on foods high in vitamins A, C and E , and make sure to drink plenty of water every day.\n\nMoisten a cotton ball with cold milk. Rub the milk over each eyebrow at night before going to bed. The milk will add nourishment to the hair follicles, which can increase growth.\n\nTry an eyebrow serum to speed up hair growth. There are a variety of products to choose from, but they all work basically the same. The serums contain peptides, which promote hair growth from the follicle. Follow the instructions for using the brow serum as this may vary among brands.", "images": ["https://img-aws.ehowcdn.com/640x425/photos.demandstudios.com/getty/article/99/182/185922364.jpg", "https://img-aws.ehowcdn.com/60x60/s3.amazonaws.com/cme_public_images/www_demandstudios_com/sitelife.studiod.com/ver1.0/Content/images/store/4/6/94169343-d47f-4646-b676-473fd7c3759e.Small.jpg", "https://img-aws.ehowcdn.com/750x500/photos.demandstudios.com/getty/article/99/182/185922364.jpg"], "top_img": "https://img-aws.ehowcdn.com/750x500/photos.demandstudios.com/getty/article/99/182/185922364.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.leaf.tv/5277382/can-you-increase-eyebrow-hair/", "title": "Can You Increase Eyebrow Hair?", "meta_data": {"viewport": "width=device-width", "google-site-verification": "", "msvalidate.01": "129B5DE6FF8DD0ECBDD457C93FF101E3", "og": {"site_name": "LEAFtv", "type": "article", "url": "https://www.leaf.tv/5277382/can-you-increase-eyebrow-hair/", "description": "Thick, full eyebrows add definition to the eyes and upper portion of the face; but if you've gotten tweezer-happy or your eyebrows are naturally thin, you may be in need of a boost. While you can use an eyebrow pencil to add some faux brow hairs, you may find it doesn't look as natural as ...", "title": "Can You Increase Eyebrow Hair?", "image": "https://img-aws.ehowcdn.com/750x500/photos.demandstudios.com/getty/article/99/182/185922364.jpg"}, "description": "Thick, full eyebrows add definition to the eyes and upper portion of the face; but if you've gotten tweezer-happy or your eyebrows are naturally thin, you may be in need of a boost. While you can use an eyebrow pencil to add some faux brow hairs, you may find it doesn't look as natural as ..."}, "movies": [], "publish_date": null, "source": "https://www.livestrong.com", "summary": ""}