{"url": "https://people.com/tv/nikki-bella-and-john-cena-officially-back-together/", "text": "Nikki Bella and John Cena have rekindled their relationship.\n\nMore than a month after the pair ended their engagement in mid-April — just three weeks before their destination wedding — a source confirms to PEOPLE that the couple is officially back together.\n\nGet push notifications with news, features and more.\n\n“They were always going to find their way back to each other,” says the source. “It was never going to be permanent.”\n\nIn the time since Bella, 34, called off their wedding — a decision that she was “heartbroken” about — the two wrestlers have been on the road to reconciliation.\n\nFollowing their breakup, both the Total Bellas star and pro-wrestler have been open about their desire to get back together. Bella previously told PEOPLE that she’s been in “communication” with the pro wrestler and that they were taking steps to get back together.\n\nOn May 19, the two were spotted out together for the first since their split.\n\n“They’re basically back together,” a second source close to the situation told PEOPLE at the time. “They never stopped talking. Other than the actual wedding weekend, when they took some space, they have been talking.”\n\nWATCH: Nikki Bella Wishes John Cena Would’ve Called Instead Of Discussing Breakup On ‘The Today Show’\n\nSources had previously said that her decision to call it quits was due to their differing stances on marriage and having kids: She wanted a family, but Cena, 41, was hesitant.\n\n“This was never really about ending their relationship — it was about calling off a wedding because something didn’t feel right,” an insider said. “It was a wedding that was entered into under false pretenses. She was pretending she was okay with not having a kid, he was pretending he absolutely couldn’t and wouldn’t budge on that point.”\n\n“They both got a wake-up call once they canceled the wedding, and they both realized they could fix what was broken,” the insider added.\n\nWant to keep up on the latest from PEOPLE? Sign up for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\nAlthough their differing desires played a role in their split, a source close to the couple said that it would only be a matter of time before they reconciled.\n\n“She’ll take him back, definitely. She loves him, and she knows he loves her desperately,” said the source. “They’ll get back together and they’ll get married the way they always should have: something small, intimate, for only the closest family and friends. Not some huge circus that will spook John or make him feel like he’s a performing monkey — something that can be about just the two of them.”\n\nAdded the source, “The wedding they called off no longer felt like their wedding — it was a wedding for TV, a wedding for publicity, a wedding for the fans and for viewers almost. That’s what made them able to walk away from it — it didn’t even feel like their day anymore, and it was already so tainted by the arguments and bad feelings that lead up to it and during the planning of it. In the end, calling it off is going to be the best thing that ever happened to their relationship.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1539&h=806&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fjohn-cena4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1539&h=806&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fjohn-cena4.jpg", "keywords": [], "authors": ["Natalie Stone"], "canonical_link": "https://people.com/tv/nikki-bella-and-john-cena-officially-back-together/", "title": "Nikki Bella and John Cena Are Officially Back Together — Six Weeks After Calling Off Wedding", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Couples,John Cena,News,Nikki Bella,TV", "news_keywords": "Couples,John Cena,News,Nikki Bella,TV", "description": "“They were always going to find their way back to each other,\" a source tells PEOPLE", "og": {"title": "Nikki Bella and John Cena Are Officially Back Together — Six Weeks After Calling Off Wedding", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/nikki-bella-and-john-cena-officially-back-together/", "description": "Nikki Bella and John Cena have rekindled their relationship. More than a month after the pair ended their engagement in mid-April — just three weeks&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1539&h=806&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fjohn-cena4.jpg", "width": 1539, "height": 806}}, "pinterest": {"url": "https://people.com/tv/nikki-bella-and-john-cena-officially-back-together/", "description": "“They were always going to find their way back to each other,\" a source tells PEOPLE", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fjohn-cena4.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/nikki-bella-and-john-cena-officially-back-together/", "title": "Nikki Bella and John Cena Are Officially Back Together — Six Weeks After Calling Off Wedding", "description": "“They were always going to find their way back to each other,\" a source tells PEOPLE", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1539&h=806&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F04%2Fjohn-cena4.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}