{"url": "www.washingtonpost.com/news/arts-and-entertainment/wp/2018/02/28/blake-shelton-had-a-rough-time-on-the-voice-premiere-this-might-explain-why/", "text": "“I won’t even be mad if you don’t go with me,” Levine told contestant Justin Kilgore. “Because one thing I know for sure that you can’t do is go with Blake.”\n\nKilgore chose Clarkson, as did Molly Stevens, another talented country singer during the second half of the premiere Tuesday. “People believe if you’re country on this show, that [only] Blake can help you, but that is not true,” Clarkson said. The other coaches also tried to persuade Stevens to go with Clarkson, and basked in Shelton’s disappointment. Clearly they play up this “drama” for the show — although as Shelton took his losses in stride and joked about it on Twitter, there might have been some genuine frustration on his part.\n\nAD\n\nAD\n\nBetter whip my oxygen tank back out for @kelly_clarkson after that one. She definitely wore herself out tryin to be more country than me HA!!! Give her some time she’ll recover. #VoicePremiere — Blake Shelton (@blakeshelton) February 27, 2018\n\nSo why was everyone determined to gang up on Shelton? As viewers know, Shelton has won the show six times, and four of those wins were with country singers. Shelton, one of the biggest stars in modern country music, is quite a draw for aspiring Nashville artists. But it’s irritating to his fellow coaches, who frequently vent they never have a shot with great country singers, who eagerly choose Shelton during the blind audition process.\n\nIt’s also annoying for the other coaches who want to bring their team members to victory, because country singers have an excellent chance of making it far on the show. Ever since “American Idol,” country music fans have enthusiastically voted on reality singing competitions. “The Voice” is often criticized for not being able to produce stars, but the country acts who have won — Cassadee Pope, Danielle Bradbery, Craig Wayne Boyd, Sundance Head — typically fare better than winners from other genres.\n\nAt a recent country radio conference in Nashville, when asked why country contestants do so well on “The Voice,” the Swon Brothers (who landed in third place in Season 4) responded simply “Blake Shelton.”\n\nAD\n\nAD\n\n“We got his phone number, we have stayed at his house, we have hunted at his house. There’s a personal connection, he goes above and beyond,” Colton Swon said. “He’s been like a big brother.”\n\n“And he had our back when things got a little tricky,” added his brother, Zach. The Swon Brothers got a record deal after “The Voice,” though were later dropped, and are now releasing music independently.\n\nShelton’s Music City connections have helped other team members; he gave Craig Wayne Boyd (Season 7 winner in 2014) a song he had been saving for his own catalogue, called “My Baby’s Got a Smile On Her Face.” Boyd’s recording became the second song in history to debut at No. 1 on the Billboard country chart. Recently, Shelton took Sundance Head (Season 11 winner in 2016) with him on tour.\n\nAD\n\nSo it’s no secret that Shelton will actively support a contestant’s career, which makes him an appealing choice for auditioners. The show’s producers obviously realize this as they amp up the drama, such as featuring Miley Cyrus’s quest last season to beat Shelton and win with a country singer. (It backfired.) And this season, the coaches are banding together to prevent Shelton from hoarding all the Nashville hopefuls.\n\nAD\n\n“I blocked Blake. I did what I’ve been waiting for!” Keys said triumphantly after Kilgore went to Clarkson’s team. “Just the block alone gave me pleasure and satisfaction.”\n\nRead more:", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/57f2027b-73ed-448e-b497-38ad3452a54b.png&w=90&h=90", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OR2G3CJK4EYSBHGP3YD5QUUP3U.jpg&w=150", "https://www.washingtonpost.com/resizer/b1UsoVhuxyCHhgRDxVdqmRf55tA=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/J2LTY3SMSU3FHJB4KEHZ42CMZ4.jpg"], "top_img": "https://www.washingtonpost.com/resizer/b1UsoVhuxyCHhgRDxVdqmRf55tA=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/J2LTY3SMSU3FHJB4KEHZ42CMZ4.jpg", "keywords": [], "authors": ["Emily Yahr", "Style Reporter Covering Pop Culture"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/02/28/blake-shelton-had-a-rough-time-on-the-voice-premiere-this-might-explain-why/", "title": "'The Voice' premiere: Everyone ganged up on Blake Shelton. This might explain why.", "meta_data": {"description": "Shelton's fellow coaches — Adam Levine, Kelly Clarkson and Alicia Keys — took great delight in his disappointment.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/02/28/blake-shelton-had-a-rough-time-on-the-voice-premiere-this-might-explain-why/", "image": "https://www.washingtonpost.com/resizer/b1UsoVhuxyCHhgRDxVdqmRf55tA=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/J2LTY3SMSU3FHJB4KEHZ42CMZ4.jpg", "title": "Analysis | Blake Shelton had a rough time on ‘The Voice’ premiere. This might explain why.", "description": "Shelton's fellow coaches — Adam Levine, Kelly Clarkson and Alicia Keys — took great delight in his disappointment."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Analysis | Blake Shelton had a rough time on ‘The Voice’ premiere. This might explain why.", "description": "Shelton's fellow coaches — Adam Levine, Kelly Clarkson and Alicia Keys — took great delight in his disappointment."}, "last_updated_date": "2018-02-28T15:26:42.511Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": ["https://www.youtube.com/embed/jjNf6SolPvU?feature=oembed", "https://www.youtube.com/embed/px5SPq5KbRM?feature=oembed"], "publish_date": 1519747200.0, "source": "http://www.washingtonpost.com", "summary": ""}