{"url": "www.mercurynews.com/2018/04/11/ballistic-khloe-kardashian-may-be-having-early-contractions-family-rushes-to-cleveland/", "text": "CLICK HERE if you are having a problem viewing the photos on a mobile device\n\nFollowing a report that pregnant Khloe Kardashian went “ballistic” after learning that Tristan Thompson allegedly cheated on her over a wild New York City weekend — and possibly on other occasions — the reality TV star was having contractions Wednesday, TMZ is reporting.\n\nHer family, including mom Kris Jenner and sister Kim Kardashian, were said to be jetting to Cleveland to be by her side Wednesday.\n\nSources have told TMZ that the contractions had just started, and it may just be a coincidence that they began the day after multiple outlets reported that Thompson had been photographed spending time in the company of multiple women over the past few months.\n\nThe 33-year-old reality TV star is in her ninth month of pregnancy and various news reports have said the baby, her first, could come “any day now.”\n\nThe “Keeping Up With the Kardashians” star has been living in Cleveland, the hometown of her 27-year-old boyfriend, a player with the Cleveland Cavaliers.\n\nKhloe was planning to give birth in Cleveland, not her hometown of Los Angeles, and had been enjoying a final “peaceful” stretch of her pregnancy.\n\nBut photos and videos surfaced Tuesday showing her pro athlete boyfriend engaged in PDA with a curvy brunette at a New York City club Saturday night. Other images also surfaced, showing Thompson and the brunette, leaving and entering a Four Seasons hotel.\n\nA woman claiming she had spent the night with Thompson in New York City also posted, then quickly deleted a sex tape, along with a number of raunchy messages she said she exchanged with the NBA star, TMZ reported earlier. The woman also claimed she was pregnant, the Daily Mirror added. But TMZ subsequently reported that the woman had no connection to Thompson and that she was just trolling him and Kardashian.\n\nBut as if all that weren’t bad enough, TMZ also revealed that Thompson was captured on a surveillance video at a Washington, D.C., hookah lounge in October 2017, kissing and letting himself be groped by at least two women. Kardashian would have been around three months pregnant at the time, TMZ said.\n\nPage Six quoted a Kardashian family source as saying that Khloe was “devastated when she saw the pictures of Tristan with that girl.” The source said Kardashian went “absolutely ballistic at him.”\n\nThompson should be back in Cleveland Wednesday, as the Cavaliers have a home game Wednesday night, TMZ said. He had been in New York City over the weekend after the Cavaliers played in Philadelphia Friday night and played the Knicks in New York on Monday.\n\nThe source added to Page Six that a “hurt” and “humiliated” Khloe was worried for the well-being of her baby.\n\n“How could he do this, and so publicly, when their baby daughter could arrive within a week?” the source asked.\n\nKhloe Kardashian and her family have yet to say anything about the Thomson cheating allegations. But the source told Page Six that the family wasn’t completely surprised to learn that Thompson might not have been entirely loyal.\n\nAfter all, Thompson broke up with his pregnant girlfriend Jordan Craig in 2016, possibly to date Khloe Kardashian. His son with Craig was born after he started dating Khloe.\n\n“The truth is that he has a bad reputation, they had warned Khloé about him, he’s done this before,” the source said. “But she didn’t want to hear it, she loves him.”\n\nThe story is developing.", "images": ["https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg", "https://www.mercurynews.com/wp-content/uploads/2018/04/khloekardashian1.jpg?w=1024&h=704", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2018/04/khloekardashian1.jpg?w=1024&h=704", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2018/04/11/ballistic-khloe-kardashian-may-be-having-early-contractions-family-rushes-to-cleveland/", "title": "‘Ballistic’ Khloe Kardashian may be having contractions; family rushes to Cleveland", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "Khloe Kardashian is reportedly having early contractions following reports that Cleveland Cavaliers star Tristan Thompson cheated on her with multiple women.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "‘Ballistic’ Khloe Kardashian may be having contractions; family rushes to Cleveland", "url": "https://www.mercurynews.com/2018/04/11/ballistic-khloe-kardashian-may-be-having-early-contractions-family-rushes-to-cleveland/", "description": "Kim Kardashian and Kris Jenner are reportedly jetting to Cleveland, where pregnant Khloe is ‘devastated’ after learning Tristan Thompson allegedly cheated on her.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2018/04/khloekardashian1.jpg?w=1024&h=704", "width": 1024, "height": 704}, "locale": "en_US"}, "article": {"published_time": "2018-04-11T19:21:31+00:00", "modified_time": "2018-04-12T11:58:23+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "‘Ballistic’ Khloe Kardashian may be having contractions; family rushes to Cleveland"}, "image": "https://www.mercurynews.com/wp-content/uploads/2018/04/khloekardashian1.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1523376000.0, "source": "http://www.mercurynews.com", "summary": ""}