{"url": "http://time.com/money/5278447/meghan-markle-wedding-dress-cost/", "text": "All eyes were on Meghan Markle Saturday as she walked down the aisle — and finally revealed her dress — at her internationally anticipated wedding to Prince Harry in Windsor, England.\n\nThe 36-year-old American actress paired a Givenchy gown with a tiara from Queen Elizabeth and a 16-foot veil detailed with flowers from all 53 countries in the British Commonwealth.\n\nPrince Harry looks at Meghan Markle, as she arrives accompanied by the Prince of Wales in St George's Chapel at Windsor Castle, May 19, 2018. Jonathan Brady—PA Wire\n\nWhile using Givenchy, a French fashion house, was unexpected, Clare Waight Keller designed Markle’s wedding dress. The British designer was Givenchy’s first female artistic director last year, Kensington Palace announced.\n\nMarkle’s dress featured an open bateau neckline and a triple silk organza underskirt, according to Kensington Palace. And though no price has been publicly released, we do have an idea about how much custom Givenchy dresses cost: When Kim Kardashian wore one at her 2014 wedding to Kanye West, it was valued at $500,000.\n\nSamantha Brown, a New York-based celebrity stylist, tells MONEY that although the dress may initially appear simple, the fabric and tailoring likely drove the cost up.\n\n“The gown is exquisite in its fit, and the fabric drapes perfectly,” she says. “While it isn’t beaded or embellished, two components that always signify ‘expensive,’ the attention to detail and, of course, Givenchy price tag surely make this gown extremely lux.”\n\nDawn Del Russo, a fashion expert and founder of Bella Dawn, says Markle’s wedding dress has an “absolutely American princess feel.” “Haute couture gowns like this can be priced as high as $340,000,” she adds. “Safe to say her couture designer gown that will be marked in history is in the hundreds of thousands.”\n\nPrince Harry and Meghan Markle in St George's Chapel at Windsor Castle during their wedding service, conducted by the Archbishop of Canterbury Justin Welby in Windsor, Britain, May 19, 2018. Owen Humphreys—Pool/Reuters\n\nThe ceremony caps off weeks of speculation about who would design Markle’s wedding dress, what it would look like and how much it would cost. Many of the rumors were linked to a comment Markle made about her favorite wedding gown of all time: the one Carolyn Bessette Kennedy wore at her 1996 ceremony, a slip dress the New York Times that was about $40,000 back then. Others were inspired by her Suits character, Rachel Zane. When Markle-as-Zane got married on TV, she wore a $6,800 Anne Barge creation in the Versailles style.\n\nSimilarly, the wedding dress Markle’s sister-in-law — Catherine, the Duchess of Cambridge — wore when she wed Prince William in 2011 was also fiercely debated. Catherine, the Duchess of Cambridge’s wedding dress was the subject of much debate when she wed Prince William back in 2011. Whereas royals aficionado Katie Nicholl told Entertainment Tonight this past March that Kate’s parents paid £150,000 — about $203,000 — for the dress, the Daily Mail reported at the time that it cost £250,000 — about $338,000.\n\nHowever, Nicholl did predict that Markle would avoid outdoing her sister-in-law.\n\n“I think it was very unlikely that Meghan would spend more than that, and in doing so try and upstage a future queen,” she told ET.\n\nBut Markle didn’t have to worry about exceeding the budget of her late mother-in-law, Princess Diana. According to CBS News, Diana’s dress cost just $13,000. And Queen Elizabeth II paid for hers with coupons.", "images": ["https://moneydotcomvip.files.wordpress.com/2018/05/royal-wedding-2018-meghan-markle-prince-harry-church-smile.jpg", "https://moneydotcomvip.files.wordpress.com/2018/05/royal-wedding-2018-meghan-markle-wedding-dress-4.jpeg?quality=85", "http://time.com/img/navigation/subscribe-icon.svg", "https://moneydotcomvip.files.wordpress.com/2018/05/royal-wedding-2018-meghan-markle-prince-harry-church-dress.jpg", "https://timedotcom.files.wordpress.com/2017/09/money-newsletter-tout-footer.png"], "top_img": "https://moneydotcomvip.files.wordpress.com/2018/05/royal-wedding-2018-meghan-markle-wedding-dress-4.jpeg?quality=85", "keywords": [], "authors": ["Julia Glum"], "canonical_link": "https://money.com/meghan-markle-wedding-dress-cost/", "title": "Here's How Much Meghan Markle's Wedding Dress Costs, According to Stylists", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "onetime,royal wedding", "news_keywords": "onetime,royal wedding", "description": "Meghan Markle's elegant Givenchy wedding dress may have looked simple, but stylists say that's probably what made it so expensive", "og": {"title": "Here's How Much Meghan Markle's Wedding Dress Costs, According to Stylists", "type": "article", "site_name": "Money", "url": "https://money.com/meghan-markle-wedding-dress-cost/", "description": "It seemed simple, but that only made it more valuable", "image": {"identifier": "https://moneydotcomvip.files.wordpress.com/2018/05/royal-wedding-2018-meghan-markle-wedding-dress-4.jpeg?quality=85", "width": 1024, "height": 691}}, "pinterest": {"url": "https://money.com/meghan-markle-wedding-dress-cost/", "description": "Meghan Markle's elegant Givenchy wedding dress may have looked simple, but stylists say that's probably what made it so expensive", "media": "https://moneydotcomvip.files.wordpress.com/2018/05/royal-wedding-2018-meghan-markle-wedding-dress-4.jpeg?quality=85"}, "twitter": {"card": "summary_large_image", "url": "https://money.com/meghan-markle-wedding-dress-cost/", "title": "Here's How Much Meghan Markle's Wedding Dress Costs, According to Stylists", "description": "It seemed simple, but that only made it more valuable", "site": "@MONEY", "image": "https://moneydotcomvip.files.wordpress.com/2018/05/royal-wedding-2018-meghan-markle-wedding-dress-4.jpeg?quality=85"}, "fb": {"app_id": 53177223193, "pages": 119930514707114}, "google-site-verification": "5w1rl4iwAR7kN1jfJEXz5hqEVP7X_HAasGoC7R_LpDE"}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}