{"url": "http://www.cnn.com/2007/POLITICS/07/23/debate.transcript/", "text": "This is part one of the transcript for the CNN/YouTube presidential debates. To see the transcript of part two click here.\n\nCHARLESTON, South Carolina (CNN) -- The eight candidates vying to be the Democrat nominee for president in the 2008 elections answered questions submitted by CNN and YouTube users in a debate Tuesday night. Here is a full transcript of the event:\n\nEight candidates gathered in South Carolina for a new type of questioning.\n\nANDERSON COOPER, CNN host: Our first question tonight is Zach Kempf in Provo, Utah.\n\nQUESTION: What's up? I'm running out of tape; I have to hurry.\n\nSo my question is: We have a bunch of leaders who can't seem to do their job. And we pick people based on the issues they that they represent, but then they get in power and they don't do anything about it anyway.\n\nYou're going to spend this whole night talking about your views on issues, but the issues don't matter if when you get in power nothing's going to get done.\n\nWe have a Congress and a president with, like, a 30 percent approval rating, so clearly we don't think they're doing a good job. What's going to make you any more effectual, beyond all the platitudes and the stuff we're used to hearing? I mean, be honest with us. How are you going to be any different?\n\nCOOPER: Senator Dodd, you've been in Congress more than 30 years. Can you honestly say you're any different?\n\nSEN. CHRISTOPHER DODD: Well, I think so.\n\nFirst of all, thank you for inviting us here in The Citadel. It's great to be here at this wonderful college, university.\n\nCertainly, I think it's a very important question one ought to be asking because, while hope and confidence and optimism are clearly very important, I think experience matters a great deal -- the experience people bring to their candidacy, the ideas, the bold ideas that they've championed over the years, whether or not they were successful in advancing those ideas and able to bring people together.\n\nI'm very proud of the fact that, over my 26 years in the Senate, I've authored landmark legislation, the Family and Medical Leave Act, child care legislation, reform of financial institutions.\n\nIn every case, those are new ideas, bold ideas, that I campaigned on and then were able to achieve in the United States Senate by bringing Republicans as well as Democrats together around those issues.\n\nThat's what's missing, more than anything else, I think, right now, is the ability to bring people together to get the job done.\n\nCOOPER: But if someone really wants a change, are you the guy to give it to them?\n\nDODD: Well, I think they ought to look back. Speeches are easy to make and rhetoric is easy to expose here. But I think the idea of looking back and saying, \"What have you done?\" --if you want to get a good idea of where someone is going to lead or how they're going to lead, I think it's very appropriate to say, \"What have you done? Show me. Demonstrate to me the ability to get these things done that you've championed in the past.\"\n\nCOOPER: Senator Obama, your supporters say you are different. Your critics say you're inexperienced. You're a first-term senator.\n\nSEN. BARACK OBAMA: Well, I think the questioner hit the nail on the head. As I travel around the country, people have an urgent desire for change in Washington. And we are not going to fix health care, we're not going to fix energy, we are not going to do anything about our education system unless we change how business is done in Washington.\n\nNow, part of that is bringing people together, as Chris said. But part of it is also overcoming special interests and lobbyists who are writing legislation that's critical to the American people.\n\nAnd one of the things I bring is a perspective as a community organizer, as a state legislator, as well as a U.S. senator, that says: Washington has to change.\n\nCOOPER: A lot of people say -- Congressman Kucinich, your supporters certainly say you are different. Even your critics would certainly say you are different. Here's a direct question for you.\n\nQUESTION: Hello. My name is Davis Fleetwood. I'm from Groton, Massachusetts. My question is for Dennis Kucinich.\n\nAfter watching the first several debates, which seemed more like conversations than actually debates, we're all clear out here that you Democrats are united. We get it.\n\nBut we have a very important decision to make coming up very soon, and Americans desperate for a change need to know: Congressman Kucinich, how would America be better off with you as president than we would be if either Hillary Clinton or Barack Obama became president?\n\nCOOPER: What do you have that Senator Clinton and Senator Obama do not have?\n\nREP. DENNIS KUCINICH: Well, first of all, a clear record as having not only opposed the war from the very beginning -- the only one of the stage that actually voted against the war, and also the only one on the stage who voted against funding the war 100 percent of the time.\n\nYou know, we're here at The Citadel. I want the people of The Citadel to know that I mourn the passing of those people who gave their lives, but I also would not hesitate to call upon you to defend this country, but I'll never send you in pursuit of a political agenda or a lie.\n\nJust like my father before me, who served in the Marines, and my brother who served in the Marines in Vietnam, and my nephew who served in Iraq, I believed in duty and honor and I think it's important to have those commitments to this country.\n\nAnd so I say we achieve strength through peace. That's the new doctrine that I'm going to promote throughout this campaign; that we'll use the science of human relations and diplomacy; that we pursue an approach which says that you can use international agreements and treaties; and that you can work to settle your differences without committing the young men and women to war, unless it's absolutely necessary.\n\nCOOPER: Senator Clinton, you were involved in that question. I want to give you a chance to respond, 30 seconds.\n\n(APPLAUSE)\n\nSEN. HILLARY CLINTON: Well, I think the Democrats are united, as Davis said, and we are united for change. We cannot take another four or eight years of Republican leadership that has been so disastrous for our country.\n\nThe issue is: Which of us is ready to lead on day one? I have 35 years of being an instrument and agent of change, before I was ever a public official. And during the time that I've been privileged to serve as first lady and now as senator, I've worked to bring people together, to find common ground where we can, and then to stand our ground where we can't.\n\nCOOPER: Senator Obama, you were involved in that question as well.\n\nOBAMA: Look, I don't think this is just a Republican problem. I think this is a problem that spans the parties. And we don't just need a change in political parties in Washington. We've got to have a change in attitudes of those who are representing the people, America. And part of the reason I don't take PAC money, I don't take federal lobbyists' money is because we've got to get the national interests up front as opposed to the special interests.\n\nAnd that is something that I've got a track record doing, and I think that is what the American people are looking for in this election -- people of both parties as well as independents.\n\nCOOPER: Our next question is for Senator Clinton.\n\n(APPLAUSE)\n\nQUESTION: Hi. My name is Rob Porter, and I'm from Irvine, California.\n\nI have a question for Hillary Clinton.\n\nMrs. Clinton, how would you define the word \"liberal?\"\n\nAnd would you use this word to describe yourself?\n\nThank you.\n\n(LAUGHTER)\n\nCLINTON: You know, it is a word that originally meant that you were for freedom, that you were for the freedom to achieve, that you were willing to stand against big power and on behalf of the individual.\n\nUnfortunately, in the last 30, 40 years, it has been turned up on its head and it's been made to seem as though it is a word that describes big government, totally contrary to what its meaning was in the 19th and early 20th century.\n\nI prefer the word \"progressive,\" which has a real American meaning, going back to the progressive era at the beginning of the 20th century.\n\nI consider myself a modern progressive, someone who believes strongly in individual rights and freedoms, who believes that we are better as a society when we're working together and when we find ways to help those who may not have all the advantages in life get the tools they need to lead a more productive life for themselves and their family.\n\nSo I consider myself a proud modern American progressive, and I think that's the kind of philosophy and practice that we need to bring back to American politics.\n\nCOOPER: So you wouldn't use the word \"liberal,\" you'd say \"progressive.\"\n\n(APPLAUSE)\n\nSenator Gravel, are you a liberal?\n\nFORMER SEN. MIKE GRAVEL: I wouldn't use either word (OFF-MIKE) Zach asked about change. You're not going to see any change when these people get elected.\n\nWe were asked about -- that we're united.\n\nWe're not united. I'm not united on many of their views. And I want to take on Barack Obama for a minute, who said he doesn't take money from lobbyists. Well, he has 134 bundlers. Now, what does he think that is?\n\nAnd, besides that, he has received money from a Robert Wolf, the head of the USB (sic) bank in the United States, who raised $195,000 -- from this bank -- wait a second -- who has lobbyists in Washington...\n\nCOOPER: Your time is up.\n\nGRAVEL: ... and it's a foreign-owned bank.\n\nCOOPER: Senator Obama, I'm going to have to let you respond.\n\nOBAMA: Absolutely.\n\nWell, the fact is I don't take PAC money and I don't take lobbyists' money.\n\nAnd the bundlers -- the reason you know who is raising money for me, Mike, is because I have pushed through a law this past session to disclose that.\n\nAnd that's the kind of leadership that I've shown in the Senate. That's the kind of leadership that I showed when I was a state legislator. And that's the kind of leadership that I'll show as president of the United States.\n\nGRAVEL: Wait a minute...\n\n(APPLAUSE)\n\nCOOPER: Our next question is for Senator Biden.\n\nQUESTION: Hello. This question is for all of the candidates. Partisanship played a major role in why nothing can be done in Washington today. All of you say you will be able to work with Republicans. Well, here's a test. If you had to pick any Republican member of Congress or Republican governor to be your running mate, who would it be?\n\nSEN. JOE BIDEN: At the risk of hurting his reputation -- and it will hurt him -- but I would pick Chuck Hagel, and I'd consider asking Dick Lugar to be secretary of state.\n\nAnd I do have -- I do have a record of significant accomplishment. The crime bill, which became known as the Clinton crime bill, was written by Joe Biden, the Biden crime bill. That required me to cross over, get everyone together, not -- no one's civil liberties were in any way jeopardized.\n\nWe put 100,000 cops on the street. Violent crime came down.\n\nThe Violence against Women Act, what we did in Bosnia, and so on. So I have a track record of being able to cross over and get things done.\n\nAnd by the way, if you want to end all this money, support my effort to pass public financing of all elections.\n\n(APPLAUSE)\n\nCOOPER: All right. Stay on the topic.\n\nSenator Edwards? Any Republicans?\n\nFORMER SEN. JOHN EDWARDS: Actually, I think Chuck Hagel is a good choice. But I -- if you listen to these questions, they all have exactly the same thing, which is how do we bring about big change?\n\nAnd I think that's a fundamental threshold question. And the question is: Do you believe that compromise, triangulation will bring about big change? I don't.\n\nI think the people who are powerful in Washington -- big insurance companies, big drug companies, big oil companies -- they are not going to negotiate. They are not going to give away their power. The only way that they are going to give away their power is if we take it away from them.\n\n(APPLAUSE)\n\nAnd I have been standing up to these people my entire life. I have been fighting them my entire life in court rooms -- and beating them.\n\nIf you want real change, you need somebody who's taking these people on and beating them...\n\nCOOPER: Time.\n\nEDWARDS: ... over and over and over.\n\nCOOPER: The other thing you're going to see tonight are candidate videos. We've asked each campaign to put together a 30- second YouTube-style video. The first one is from Senator Chris Dodd.\n\n(BEGIN VIDEO CLIP)\n\nQUESTION: Senator, I have to ask, what's with the white hair?\n\nDODD: I don't know why you bring that up. Bill Richardson, Hillary, Joe Biden and I, we're all about the same age. I don't think the white hair is an issue.\n\nQUESTION: Well, how did you get the white hair?\n\nDODD: Hard work, I suppose. For example, it took me seven years to pass the Family and Medical Leave Act, and I helped to end wars in Central America and bring peace to Northern Ireland. I'm ready to be president.\n\nQUESTION: Well, how many white hairs do you have?\n\nDODD: Hundreds, thousands, I presume.\n\nQUESTION: Really?\n\nDODD: I'm Chris Dodd, and we approved this message.\n\n(END VIDEO CLIP)\n\n(APPLAUSE)\n\nCOOPER: There you go. Nothing wrong with white hair.\n\nDODD: A young person with white hair, too?\n\nCOOPER: Yes, sadly, my age is catching up to my hair.\n\n(LAUGHTER)\n\nAlmost 50 percent of South Carolina's Democrats are African- Americans. It's among the highest percentage of the nation. So we're giving a lot of questions from YouTube viewers on race tonight.\n\nThis first one is for Senator Edwards. Let's listen.\n\nQUESTION: Hello, America. Hello, presidential candidates. This is Will from Boston, Massachusetts. And I hope, you know, they put this question on. It's a question in the back of everybody's head. You know, in some people, it's further back than others, collecting cobwebs.\n\nBut is African-Americans ever going to get reparations for slavery?\n\nI know you all are going to run around this question, dipping and dodging, so let's see how far you all can get.\n\nCOOPER: Senator Edwards, no dipping and dodging. Should African-Americans get reparations?\n\nEDWARDS: I'm not for reparations. I can answer that questions. But I think there are other things we can do to create some equality that doesn't exist in this country today.\n\nToday there was a report that, right here in Charleston, African Americans are paying more than their white counterparts for mortgages than any other place in America, any other place in the United States of America.\n\nAnd here's an example. What is the conceivable explanation for this, that black people are paying more for their mortgage?\n\nAnd, by the way, it's not just low-income African Americans; it's high-income African-Americans. There's absolutely no explanation for this. It goes to the basic question that I raised just a few minutes ago.\n\nTo have a president that's going to -- is going to fight for equality, fight for real change, big change, bold change, we're going to have to somebody -- we can't trade our insiders for their insiders. That doesn't work.\n\nWhat we need is somebody who will take these people on, these big banks, these mortgage companies, big insurance companies, big drug companies. That's the only way we're going to bring about change. And I will do that as president.\n\n(APPLAUSE)\n\nCOOPER: Senator Obama, your position on reparations?\n\nOBAMA: I think the reparations we need right here in South Carolina is investment, for example, in our schools. I did a...\n\n(APPLAUSE)\n\nI did a town hall meeting in Florence, South Carolina, in an area called the corridor of shame. They've got buildings that students are trying to learn in that were built right after the Civil War. And we've got teachers who are not trained to teach the subjects they're teaching and high dropout rates.\n\nWe've got to understand that there are corridors of shame all across the country. And if we make the investments and understand that those are our children, that's the kind of reparations that are really going to make a difference in America right now.\n\nCOOPER: Is anyone on the stage for reparations for slavery for African-Americans?\n\nAre you?\n\nKUCINICH: I am.\n\nThe Bible says we shall be and must be repairers of the breach. And a breach has occurred.\n\nWe have to acknowledge that. It's a breach that has resulted in inequality in opportunities for education, for health care, for housing, for employment. And so, we must be mindful of that.\n\nBut it's also a breach that has affected a lot of poor whites as well.\n\nWe need to have a country which recognizes that there is an inequality of opportunity and a president who's ready to challenge the interest groups -- be they insurance companies or mortgage companies or defense contractors who are taking the money away from the people who need it.\n\nCOOPER: Time.\n\nKUCINICH: Yes, I am for repairing the breach. Yes, I am for reparations.\n\nCOOPER: Our next question is for Senator Dodd.\n\nQUESTION: Do you believe the response in the wake of Hurricane Katrina would have been different if the storm hit an affluent, predominantly white city? What roles do you believe race and class played in the storm's aftermath? And if you acknowledge that race and class affected the response efforts, what can you do to ensure that this won't happen in the future? And what can you do to ensure this nation's most needy people, in times of crisis and always, something will be done to help them too?\n\nDODD: Well, it's a great question, Morgan, to raise here. It, obviously, points to one of the most dark and shameful moments in recent past history in our country -- the fact that a major American city went through a natural disaster, and we found almost (ph) little to do. The American president had almost no response whatsoever to the people of that city, New Orleans.\n\nIn fact, today still, the problem persists where people who had to move out of their city, move elsewhere, and little or no efforts to make sure they can get back in their homes. They have literally thousands of people whose homes were destroyed, their economic opportunities destroyed.\n\nI believe that had this occurred in a place with mainly a white population, we would have seen a much more rapid response and a consistent response to that issue.\n\nAs an American president, we can never, ever allow again a major city, a major population center in our country go through what New Orleans, what the Gulf states did as a result of the kind of neglect from an American president.\n\nAs president, I would commit to do everything possible we bring to bear the talents, the resources.\n\nIn fact, it should have been done ahead of time, to have a FEMA operation that was prepared to respond to these predictable disasters. So it's a mark of shame on our country. It ought to be reversed. It will in the Dodd administration.\n\n(APPLAUSE)\n\nCOOPER: Governor Richardson, the Democrats talk a lot about the failure of the president with Hurricane Katrina. The governor of that state was a Democrat; the mayor of that city is a Democrat as well.\n\nGOV. BILL RICHARDSON: Well, there was politics. All of a sudden, other states that had the similar devastation got better treatment, like Mississippi.\n\nThis is what I would do. The response of our government to Katrina, before, during and after, was inexcusable. We have got to eliminate in the future any red tape that helps families -- that helps the devastation.\n\nSecondly, we have to let those that live there to come back first, instead of big moneyed interests. We have to stop the predatory lending of insurance companies, housing and many others that are ripping off the people.\n\nAnd then, finally, we have to make sure that a president cares -- and doesn't just pose for photo ops, but makes a difference and a commitment to rebuild that city and that region.\n\n(APPLAUSE)\n\nCOOPER: Our next question comes from Jordan Williams.\n\nQUESTION: Hello. My name is Jordan Williams, and I am a student at K.U., from Coffeyville, Kansas.\n\nThis question is meant for Senator Obama and Senator Clinton.\n\nWhenever I read an editorial about one of you, the author never fails to mention the issue of race or gender, respectively. Either one is not authentically black enough, or the other is not satisfactorily feminine.\n\nHow will you address these critics and their charges if one or both of you should end up on the Democratic ticket in '08?\n\nCOOPER: Senator Obama, how do you address those who say you're not authentically black enough?\n\n(LAUGHTER)\n\nOBAMA: Well...\n\nCOOPER: Not my question; Jordan's question.\n\nOBAMA: You know, when I'm catching a cab in Manhattan -- in the past, I think I've given my credentials.\n\n(LAUGHTER)\n\n(APPLAUSE)\n\nBut let me go to the broader issue here. And that is that race permeates our society. It is still a critical problem.\n\nBut I do believe in the core decency of the American people, and I think they want to get beyond some of our racial divisions.\n\nUnfortunately, we've had a White House that hasn't invested in the kinds of steps that have to be done to overcome the legacy of slavery and Jim Crow in this country.\n\nAnd as president of the United States, my commitment on issues like education, my commitment on issues like health care is to close the disparities and the gaps, because that's what's really going to solve the race problem in this country.\n\nIf people feel like they've got a fair shake, if children feel as if the fact that they have a different surname or they've got a different skin color is not going to impede their dreams, then I am absolutely confident that we're going to be able to move forward on the challenges that we face as a country.\n\n(APPLAUSE)\n\nCOOPER: Senator Clinton, you have a minute as well since this question is to you.\n\nCLINTON: Well, I couldn't run as anything other than a woman.\n\n(LAUGHTER)\n\nI am proud to be running as a woman.\n\nAnd I'm excited that I may...\n\n(APPLAUSE)\n\n... you know, may be able, finally, to break that hardest of all glass ceilings.\n\nBut, obviously, I'm not running because I'm a woman. I'm running because I think I'm the most qualified and experienced person to hit the ground running in January 2009.\n\nAnd I trust the American people to make a decision that is not about me or my gender, or about Barack or his race or about Bill and his ethnicity, but about what is best for you and your family.\n\nWe have big challenges...\n\n(APPLAUSE)\n\n... and big needs in our country. And I think we're going to need experienced and strong leadership in order to start handling all of the problems that we have here at home and around the world.\n\nAnd when I'm inaugurated, I think it's going to send a great message to a lot of little girls and boys around the world.\n\nCOOPER: Senator Edwards...\n\n(APPLAUSE)\n\nSenator Edwards, earlier this week, your wife said that you would be a better advocate for women than Senator Clinton. Was she right?\n\nEDWARDS: Well, let me say first that on the question that was just asked to Senator Obama...\n\nCOOPER: We prefer you stay on the question...\n\nEDWARDS: I'm going to stay on your question. I promise I'll answer that question. But the first thing I want to say -- and I want to speak for everybody, I believe, on this stage -- anybody who's considering not voting for Senator Obama because he's black or for Senator Clinton because she's a woman, I don't want their vote. I don't want them voting for me.\n\n(APPLAUSE)\n\nI think what Elizabeth was saying was -- to answer your question, what Elizabeth was saying was there are very important issues facing women in this country. More women are affected by the minimum wage than men are affected by the minimum wage. I have been the most aggressive -- in fact, I would challenge every Democrat on this stage today to commit to raising the minimum wage to $9.50 an hour by the year 2012.\n\n(APPLAUSE)\n\nSecond, there are more women in poverty than men in poverty.\n\nAnd I have made this a central cause in my life and a central cause in my campaign. More women have difficulty getting the health care that they need than men do. And I was the first person to come out with a comprehensive, truly universal health care plan.\n\nCOOPER: So do you think you're a better advocate for women than Senator Clinton?\n\nEDWARDS: Those are issues -- listen, Senator Clinton has a long history of speaking out on behalf of women. She deserves to be commended for that. But I believe that on the issues that directly affect women's lives, I have the strongest, boldest ideas and can bring about the change that needs to be brought.\n\nCOOPER: Senator Clinton, is he a better advocate for women?\n\n(APPLAUSE)\n\nCLINTON: Anderson, I have a great deal of admiration for Elizabeth Edwards. And I appreciate greatly John's comments. You know, I have spent my entire life advocating for women. I went to Beijing in 1995 and said that women's rights are human rights, and I've done everything I can to make that principle come true.\n\nAnd, specifically on issues, I got to vote to raise the minimum wage.\n\nI put in legislation which said that Congress should not get a salary increase until they did raise the minimum wage, and I am putting that back in, because I agree that by the time we got it raised after 10 years, it was already out of date.\n\nAnd as to women in poverty and women with health care needs, I have been on the forefront of both advocating and creating change in my public service, in my time in Arkansas, the White House, and now in the Senate.\n\nBut I think it is terrific. We're up here arguing about who's going to be better for women, because isn't that a nice change for everybody to hear.\n\n(APPLAUSE)\n\nCOOPER: Our next question is on a topic that got a lot of response from YouTube viewers. Let's watch.\n\nQUESTION: Hi. My name is Mary.\n\nQUESTION: And my name is Jen.\n\nQUESTION: And we're from Brooklyn, New York.\n\nIf you were elected president of the United States, would you allow us to be married to each other?\n\nCOOPER: Congressman Kucinich?\n\nKUCINICH: Mary and Jen, the answer to your question is yes. And let me tell you why.\n\nBecause if our Constitution really means what it says, that all are created equal, if it really means what it says, that there should be equality of opportunity before the law, then our brothers and sisters who happen to be gay, lesbian, bisexual or transgender should have the same rights accorded to them as anyone else, and that includes the ability to have a civil marriage ceremony.\n\nYes, I support you. And welcome to a better and a new America under a President Kucinich administration.\n\n(APPLAUSE)\n\nCOOPER: Senator Dodd, you supported the Defense of Marriage Act. What's your position?\n\nDODD: I've made the case, Anderson, that -- my wife and I have two young daughters, age 5 and 2.\n\nI'd simply ask the audience to ask themselves the question that Jackie and I have asked: How would I want my two daughters treated if they grew up and had a different sexual orientation than their parents?\n\nGood jobs, equal opportunity, to be able to retire, to visit each other, to be with each other, as other people do.\n\nSo I feel very strongly, if you ask yourself the question, \"How would you like your children treated if they had a different sexual orientation than their parents?,\" the answer is yes. They ought to have that ability in civil unions.\n\nI don't go so far as to call for marriage. I believe marriage is between a man and a woman.\n\nBut my state of Connecticut, the state of New Hampshire, have endorsed civil unions. I strongly support that. But I don't go so far as marriage.\n\nCOOPER: Governor Richardson?\n\nRICHARDSON: Well, I would say to the two young women, I would level with you -- I would do what is achievable.\n\nWhat I think is achievable is full civil unions with full marriage rights. I would also press for you a hate crimes act in the Congress. I would eliminate \"don't ask/don't tell\" in the military.\n\n(APPLAUSE)\n\nIf we're going to have in our military men and women that die for this country, we shouldn't give them a lecture on their sexual orientation\n\nI would push for domestic partnership laws, nondiscrimination in insurance and housing.\n\nI would also send a very strong message that, in my administration, I will not tolerate any discrimination on the basis of race, gender, or sexual orientation.\n\n(APPLAUSE)\n\nCOOPER: This next question is for Senator Edwards.\n\nQUESTION: I'm Reverend Reggie Longcrier. I'm the pastor of Exodus Mission and Outreach Church in Hickory, North Carolina.\n\nSenator Edwards said his opposition to gay marriage is influenced by his Southern Baptist background. Most Americans agree it was wrong and unconstitutional to use religion to justify slavery, segregation, and denying women the right to vote.\n\nSo why is it still acceptable to use religion to deny gay American their full and equal rights?\n\n(APPLAUSE)\n\nEDWARDS: I think Reverend Longcrier asks a very important question, which is whether fundamentally -- whether it's right for any of our faith beliefs to be imposed on the American people when we're president of the United States. I do not believe that's right.\n\nI feel enormous personal conflict about this issue. I want to end discrimination. I want to do some of the things that I just heard Bill Richardson talking about -- standing up for equal rights, substantive rights, civil unions, the thing that Chris Dodd just talked about. But I think that's something everybody on this stage will commit themselves to as president of the United States.\n\nBut I personally have been on a journey on this issue. I feel enormous conflict about it. As I think a lot of people know, Elizabeth spoke -- my wife Elizabeth spoke out a few weeks ago, and she actually supports gay marriage. I do not. But this is a very, very difficult issue for me. And I recognize and have enormous respect for people who have a different view of it.\n\nCOOPER: I should also point out that the reverend is actually in the audience tonight. Where is he? Right over here.\n\nReverend, do you feel he answered your question?\n\n(APPLAUSE)\n\nQUESTION: This question was just a catalyst that promoted some other things that wrapped around that particular question, especially when it comes to fair housing practices. Also...\n\nCOOPER: Do you think he answered the question, though?\n\nQUESTION: Not like I would like to have heard it...\n\n(LAUGHTER)\n\nCOOPER: What did you not hear?\n\nQUESTION: I didn't quite get -- some people were moving around, and I didn't quite get all of his answer. I just heard...\n\nCOOPER: All right, there's 30 seconds more. Why is it OK to quite religious beliefs when talking about why you don't support something? That's essentially what's his question.\n\nEDWARDS: It's not. I mean, I've been asked a personal question which is, I think, what Reverend Longcrier is raising, and that personal question is, do I believe and do I personally support gay marriage?\n\nThe honest answer to that is I don't. But I think it is absolutely wrong, as president of the United States, for me to have used that faith basis as a basis for denying anybody their rights, and I will not do that when I'm president of the United States.\n\n(APPLAUSE)\n\nCOOPER: Senator Obama, the laws banning interracial marriage in the United States were ruled unconstitutional in 1967. What is the difference between a ban on interracial marriage and a ban on gay marriage?\n\nOBAMA: Well, I think that it is important to pick up on something that was said earlier by both Dennis and by Bill, and that is that we've got to make sure that everybody is equal under the law. And the civil unions that I proposed would be equivalent in terms of making sure that all the rights that are conferred by the state are equal for same-sex couples as well as for heterosexual couples.\n\nNow, with respect to marriage, it's my belief that it's up to the individual denominations to make a decision as to whether they want to recognize marriage or not. But in terms of, you know, the rights of people to transfer property, to have hospital visitation, all those critical civil rights that are conferred by our government, those should be equal.\n\nCOOPER: We're going to take a quick break, but before we go we're going to show another candidate video. This one is from the Clinton campaign. And then when we come back from the break, we'll see one from the -- from Senator Edwards' campaign.\n\n(MUSIC PLAYED FROM CLINTON CAMPAIGN VIDEO)\n\n(COMMERCIAL BREAK)\n\n(MUSIC PLAYED FROM EDWARDS CAMPAIGN VIDEO)\n\nCOOPER: That was just one of the candidates' videos. If you're just joining us, that's one of the candidate videos you're going to be seeing throughout the evening as we go to commercial breaks.\n\nLet's turn international now. We've got a lot of international questions. Let's listen.\n\nQUESTION: I'm Gabriel. And I'm Connie, from a refugee camp near Darfur.\n\nBefore you answer this question, imagine yourself the parent of one of these children.\n\nWhat action do you commit to that will get these children back home to a safe Darfur and not letting it be yet another empty promise?\n\nCOOPER: Governor Richardson, what are you going to do? Would you commit American troops?\n\nRICHARDSON: I was at that refugee camp. And there was a refugee, a woman who came up to me. She'd been raped, her husband had been killed and she said, \"When is America going to start helping?\"\n\nThis is what I would do: It's diplomacy. It's getting U.N. peacekeeping troops and not African Union troops. It's getting China to pressure Sudan. It's getting the European Union to be part of economic sanctions in Sudan. It's called leadership.\n\nA no-fly zone, I believe, would be an option. But we have to be concerned about humanitarian workers being hurt by planes, being shot.\n\nThe answer here is caring about Africa. The answer here is not just thinking of our strategic interests as a country, as oil and Europe and the Middle East. It should be Africa, Asia and Latin America, doing something about poverty, about AIDS, about refugees, about those that have been left behind. That's how we restore American leadership in this country.\n\n(APPLAUSE)\n\nCOOPER: You say U.N. troops. Does that mean American troops?\n\nRICHARDSON: United Nations peacekeeping troops, and that would primarily be Muslim troops. We need a permanent U.N. peacekeeping force, stationed somewhere.\n\nIf we get U.N. peacekeeping troops authorized for Darfur, there's some already there, it'll take six months for them to get there. Genocide is continuing there; 200,000 have died; close to 2 million refugees in that region.\n\nAmerica needs to respond with diplomacy, with diplomatic leadership.\n\nCOOPER: Senator Biden, in the past, you've talked about NATO troops. What about American troops?\n\nBIDEN: Absolutely, positively. Look, I'm so tired of this. Let's get right to it. I heard the same arguments after I came back from meeting with Milosevic: We can't act; we can't send troops there.\n\nWhere we can, America must. Why Darfur? Because we can.\n\nWe should now. Those kids will be dead by the time the diplomacy is over.\n\n(APPLAUSE)\n\nI'm not joking. I've been to that camp. I walked through that camp.\n\nYou know what happened when I landed?\n\nWhen I landed and the dust settled, a young African aid worker came up to me and he looked at me and he said, \"Thank you. Thank you, America, for coming.\"\n\nYou don't understand -- they don't understand. They think we can save them.\n\nAnd guess what? We can. Twenty-five hundred American troops -- if we do not get the 21,000 U.N. troops in there -- can stop the genocide now. I have called for a no-fly zone. Everybody agreed, but you need troops on the ground.\n\nCOOPER: Time.\n\nSenator Gravel?\n\nGRAVEL: The problem goes a little bit deeper than that. It's because we haven't owned up to our responsibilities to a sense of global governance. And so now, you've got a situation with the United States of America, as Joe says, wants to go in, but the African nations don't want us there.\n\nWhat's the message? They're afraid of us. They're flat afraid of us. And if you'll permit me, since I haven't got as much time as the others.\n\nCOOPER: Actually, no, you've got to answer just directly the question, 30 seconds.\n\nGRAVEL: Thank you very much, Anderson.\n\nCOOPER: Senator Clinton, would you agree with Senator Biden? American troops should got to Darfur?\n\nCLINTON: I agree completely that what we need to do is start acting instead of talking.\n\nThat means accelerating the United Nations peacekeeping forces along with the African Union. It means moving more quickly on divestment and sanctions on the Sudanese government, including trying to use the diplomacy to get China involved.\n\nAnd, finally, it does mean a no-fly zone. We can do it in a way that doesn't endanger humanitarian relief.\n\nCOOPER: How about American troops on the ground?\n\nCLINTON: I think NATO has to be there with the no-fly zone, and I think that only the United States can provide the logistical support and the air lift to make a no-fly zone and the actual delivery of humanitarian aid work.\n\nCOOPER: Just in the spirit of trying to get the answer, does that mean no American ground troops?\n\nCLINTON: American ground troops I don't think belong in Darfur at this time. I think we need to focus on the United Nations peacekeeping troops and the African Union troops.\n\nWe've got to figure out what we're doing in Iraq, where our troops are stretched thin, and Afghanistan, where we're losing the fight to al Qaeda and bin Laden.\n\n(APPLAUSE)\n\nCOOPER: OK, want to talk about Iraq tonight. Before we do, I just want to put a picture up on the screen.\n\nThat's United States Marine Corps 1st Lieutenant Shane Chiders. He was a 2001 graduate of this college, The Citadel. March 1st, 2003, it was just after sunrise when Lieutenant Chiders and his platoon were on a mission to capture an oil pumping station from Iraqi soldiers before the Iraqi soldiers could destroy it.\n\nDuring the operation, a stray bullet hit him just below his body armor. Lieutenant Chiders became the first U.S. service man to die inside Iraq in Operation Iraqi Freedom.\n\nIn all, 12 Citadel graduates died in either Afghanistan or Iraq since September 11th, 2001, and over 1,100 have served in those two countries. Tonight we acknowledge their sacrifices and the sacrifices of all our service men and women now serving in Iraq and Afghanistan.\n\nOur first question on Iraq tonight comes from Barry Mitchell in Philadelphia, Pennsylvania.\n\nQUESTION: Mitch from Philadelphia.\n\nMy question for all the candidates: How do we pull out now? And the follow-up, are we watching the same blankin' war? I certainly wasn't a big fan of the invasion/liberation. It sickens me to hear about soldiers wounded and getting killed daily, not to mention innocent Iraqis, but how do we pull out now? The government's shaky; bombs daily.\n\nDon't you think if we pulled out now that would open it up for Iran and Syria, God knows who -- Russia -- how do we pull out now? And isn't it our responsibility to get these people up on their feet? I mean, do you leave a newborn baby to take care of himself? How do we pull out now?\n\nCOOPER: Senator Obama, how do we pull out now?\n\nOBAMA: Look, I opposed this war from the start. Because I anticipated that we would be creating the kind of sectarian violence that we've seen and that it would distract us from the war on terror.\n\nCOOPER: Right...\n\nOBAMA: I'm going to get to the question, Anderson.\n\nAt this point, I think we can be as careful getting out as we were careless getting in. But we have to send a clear message to the Iraqi government as well as to the surrounding neighbors that there is no military solution to the problems that we face in Iraq.\n\nWe just heard a White House spokesman, Tony Snow, excuse the fact that the Iraqi legislature went on vacation for three weeks because it's hot in Baghdad. Well, let me tell you: It is hot for American troops who are over there with 100 pounds worth of gear.\n\n(APPLAUSE)\n\nAnd that kind of irresponsibility is not helpful.\n\nSo we have to begin a phased withdrawal; have our combat troops out by March 31st of next year; and initiate the kind of diplomatic surge that is necessary in these surrounding regions to make sure that everybody is carrying their weight.\n\nAnd that is what I will do on day one, as president of the United States, if we have not done it in the intervening months.\n\n(APPLAUSE)\n\nCOOPER: Senator Biden, how do we pull out now? That was the question.\n\nBIDEN: Anderson, you've been there. You know we can't just pull out now. Let's get something straight. It's time to start to tell the truth. The truth of the matter is: If we started today, it would take one year, one year to get 160,000 troops physically out of Iraq, logistically.\n\nThat's number one.\n\nNumber two, you cannot pull out of Iraq without the follow-on that's been projected here, unless you have a political solution. I'm the only one that's offered a political solution.\n\nAnd it literally means separate the parties; give them jurisdiction in their own areas; have a decentralized government, a federal system. No central government will work.\n\nAnd, thirdly, the fact of the matter is, the very thing everybody's quoting is the very legislation I wrote in January. It said: Begin to draw down combat troops now; get the majority of the combat troops out by March of '08.\n\nThere's not one person in here that can say we're going to eliminate all troops...\n\nCOOPER: OK, time.\n\nBIDEN: ... unless you're going to eliminate every physical person who's an American in Iraq.\n\nCOOPER: Time.\n\nBIDEN: Tell the truth for a change.\n\n(APPLAUSE)\n\nCOOPER: Another question on Iraq.\n\nQUESTION: Thank you for taking my question. The 2006 election gave the Democrats in office a mandate to end the U.S. occupation of Iraq. Since that time, 800 of our military service members have died there.\n\nAs the mother of an American soldier deploying to Iraq for a second time, I would like to know if the perception is true that the Democrats are putting politics before conscience.\n\nHow many more soldiers must die while these political games continue in our government?\n\nIs the reason why we are still in Iraq and seemingly will be for some time due to the Democrats' fear that blame for the loss of the war will be placed on them by the Republican spin machine?\n\n(APPLAUSE)\n\nCOOPER: Senator Clinton?\n\nCLINTON: Well, I want to thank her and her son for their service and their sacrifice. When we send a soldier or Marine to combat in Iraq, we really are sending a family.\n\nAnd since the election of 2006, the Democrats have tried repeatedly to win Republican support with a simple proposition that we need to set a timeline to begin bringing our troops home now.\n\nI happen to agree that there is no military solution, and the Iraqis refuse to pursue the political solutions. In fact, I asked the Pentagon a simple question: Have you prepared for withdrawing our troops? In response, I got a letter accusing me of being unpatriotic; that I shouldn't be asking questions.\n\nWell, one of the problems is that there are a lot of questions that we're asking but we're not getting answers from the Bush administration.\n\nCOOPER: Time.\n\nCLINTON: And it's time for the Republicans to join us in standing up to the president to bring our troops home.\n\n(APPLAUSE)\n\nCOOPER: Congressman Kucinich, the Democrats have been in power for seven months. Nothing has changed in Iraq.\n\nKUCINICH: If you're not going to answer the question, I'm going to answer the mother that troop -- question.\n\nThe answer to your question, ma'am, is: Yes, it is politics. The Democrats have failed the American people. When we took over in January, the American people didn't expect us to give them a Democratic version of the war. They expected us to act quickly to end the war.\n\nAnd here's how we can do it. It doesn't take legislation. That's a phony excuse to say that you don't have the votes. We appropriated $97 billion a month ago. We should tell President Bush, no more funds for the war, use that money to bring the troops home, use it to bring the troops home.\n\n(APPLAUSE)\n\nAnd, Anderson, right, now if people want to send that message to Congress...\n\nCOOPER: OK. Senator...\n\nKUCINICH: ... they can text \"Peace,\" 73223.\n\nCOOPER: Senator Dodd -- we're going to see your campaign commercial.\n\nSenator Dodd, you're in the Congress. What about it? You've been in power seven months now. Nothing's changed in Iraq.\n\nDODD: First of all, there are differences here. The first responsibility of the commander in chief is to keep our nation safe and secure. It has been said from the very beginning: There is no military solution to this civil war in Iraq.\n\nI think it's incumbent upon the Congress.\n\nThere is a sense of disappointment. We should set that time certain. I don't normally advocate that here, but I know of no other way we're going to convince the political and religious leaders in Iraq to take seriously their responsibility to decide to form a nation-state or not.\n\nI think by saying with clarity here that we are withdrawing and redeploying our forces out of there, robustly pursuing diplomacy, which we have not done at all here. This administration treats statecraft and diplomacy as if it were a gift to your opponents here.\n\nWe need to have a program here that allows us to become much more engaged in the region.\n\nThe answer on Darfur isn't just what we do...\n\nCOOPER: No, no, no, no, let's not go to Darfur...\n\nDODD: Well, no, because Iraq is related to Darfur, Anderson, here. It's because we're bogged down there at $10 billion a month, we've lost our moral leadership in the world. No one listens to us when it comes to foreign policy. That has to change in this country. That's the difference here.\n\n(APPLAUSE)\n\nCOOPER: The question, though, is: Are the Democrats playing politics?\n\nRICHARDSON: There's a big difference on Iraq between me and the senators, and here's where it is.\n\nThe lives of our young troops are more important than George Bush's legacy.\n\nThis is what I stand for: I believe we should bring all the troops home by the end of this year, in six months, with no residual forces -- no residual forces.\n\n(APPLAUSE)\n\nThis is critically important. A hundred American troops are dying every month. And this war is a quagmire. It's endless.\n\nCOOPER: Time.\n\nRICHARDSON: And the time has come to bring the troops home. No politics.\n\nCOOPER: Time.\n\n(APPLAUSE)\n\nRICHARDSON: Get it done.\n\nCOOPER: The next question is for Senator Gravel.\n\nQUESTION: My name is Don. I'm from West Virginia.\n\nMy question is for Mike Gravel. In one of the previous debates you said something along the lines of the entire deaths of Vietnam died in vain.\n\nHow do you expect to win in a country where probably a pretty large chunk of the people voting disagree with that statement and might very well be offended by it?\n\nI'd like to know if you plan to defend that statement, or if you're just going to flip-flop.\n\nThanks.\n\nGRAVEL: John, why would you think I would flip-flop? I've never flip-flopped before, and I like the question. I don't get very many of them, but I'll just tell you...\n\n(LAUGHTER)\n\n(APPLAUSE)\n\nThank you. Thank you. Has it been fair thus far? I'll tell you, John, it's a set up question. Our soldiers died in Vietnam in vain. You can now, John, go to Hanoi and get a Baskin-Robbins ice cream cone. That's what you can do. And now we have most favored nation trade.\n\nWhat did all these people die for? What are they dying for right now in Iraq every single day? Let me tell you: There's only one thing worse than a soldier dying in vain; it's more soldiers dying in vain.\n\n(APPLAUSE)\n\nCOOPER: Senator Obama, are the soldiers dying in Iraq in vain?\n\nOBAMA: Our soldiers have done everything that's been asked of them. They deposed Saddam Hussein.\n\nThey have carried out extraordinarily difficult missions with great courage and great bravery.\n\nBut, you know, one thing I have to say about Senator Clinton's comments a couple of moments ago. I think it's terrific that she's asking for plans from the Pentagon, and I think the Pentagon response was ridiculous. But what I also know is that the time for us to ask how we were going to get out of Iraq was before we went in.\n\n(APPLAUSE)\n\nAnd that is something that too many of us failed to do. We failed to do it. And I do think that that is something that both Republicans and Democrats have to take responsibility for.\n\nWhen I am president of the United States, when I send our troops into battle, I am going to be absolutely sure that it is based on sound intelligence, and I'm going to tell the truth to the American people, as well as the families who are being asked to sacrifice.\n\nCOOPER: To the question of, did the troops -- are the troops dying in vain, though: Yes or no?\n\nOBAMA: I never think that troops, like those who are coming out of The Citadel, who do their mission for their country, are dying in vain. But what I do think is that the civilian leadership and the commander in chief has a responsibility to make sure that they have the plans that are going to allow our troops to succeed in their mission.\n\nCOOPER: Senator Edwards, are the troops -- did the troops in Vietnam die in vain?\n\nEDWARDS: I don't think any of our troops die in vain when they go and do the duty that's been given to them by the commander in chief. No, I don't think they died in vain.\n\nBut I think the question is -- the question is: What is going to be done to stop this war?\n\nThe other people have raised the question earlier. And in fact, Senator Obama spoke just a minute ago about the White House agreeing that the parliament, the Iraqi parliament could take a month-long vacation because it was too hot, while our men and women are putting their lives on the line every day.\n\nHere's my question. While the Iraqi parliament is on vacation, is George Bush going to be on vacation in Crawford, Texas?\n\nWhat we need to do is turn up the heat on George Bush and hold him responsible and make this president change course.\n\n(APPLAUSE)\n\nIt is the only way he will change course. He will never change course unless he's made to do it.\n\nCOOPER: Got another question -- this one's relatively short -- from a Tony Fuller. Let's listen.\n\nQUESTION: My name is Tony Fuller from Wilson, Ohio, and I was wondering if the candidates feel women should register for the draft when they turn 18. Why or why not?\n\nCOOPER: Should women register for selective service when they turn 18 like men do currently?\n\nSenator Dodd?\n\nDODD: Well, yes, I think they should, in a sense. I'm opposed to a draft, but I think if you're going to have registration, it ought to be across lines so you don't just ask one gender to do the -- have the responsibility. So in my view that would be the fair thing to do.\n\nI happen to believe, by the way, Anderson, and taking the question here a bit further, and it's a good question that Tony has raised, I'm an advocate of universal nation service, not by mandating it, but one of the things I'm missing in our country is the shared experience.\n\nI served in the National Guard, I served in the reserves, I served in the Peace Corps in Latin America back in the '60s here. I want to see every American given the opportunity to serve their country in some way.\n\nI think we need to do more of that in the United States today. Elections ought to be more than just about a series of issues, but the shared experiences of service.\n\n(APPLAUSE)\n\nIt's so important that every American have that opportunity. It's something I strongly advocate and would advocate as president.\n\nCOOPER: Senator Clinton, do you think women should register for Selective Service?\n\nCLINTON: I do. I don't support a draft. I think our all- volunteer military has performed superbly. But we've had women die in Iraq. We've had combat deaths of women in Iraq and Afghanistan. And I do think that women should register. I doubt very much that we'll ever have to go back to a draft. But I think it is fair to call upon every young American.\n\nAnd I agree completely with Chris. We've got to look for more ways for universal national service. I've introduced legislation for a public service academy that would be patterned on great institutions like The Citadel and our military academies. Because we've got to get young people back into public service.\n\nAnd the other night we had a provision in our bill that we passed to have people who go into public service have their student loans deferred and even forgiven.\n\nWe need to do more to support public service.\n\nCOOPER: Senator Obama, should women register for Selective Service?\n\nOBAMA: You know, a while back we had a celebration in the Capitol for the Tuskegee Airmen, and it was extraordinarily powerful because it reminded us, there was a time when African-Americans weren't allowed to serve in combat.\n\nAnd yet, when they did, not only did they perform brilliantly, but what also happened is they helped to change America, and they helped to underscore that we're equal.\n\nAnd I think that if women are registered for service -- not necessarily in combat roles, and I don't agree with the draft -- I think it will help to send a message to my two daughters that they've got obligations to this great country as well as boys do.\n\n(APPLAUSE)\n\nCOOPER: Senator Edwards?\n\nEDWARDS: Anyone who has any question about whether women can serve this country honorably in the military should meet Sally Bardon (ph), who's sitting with my wife Elizabeth down there. She flew fighter jets, F-16s, into the first 15 minutes of the war in Iraq. Flew over Baghdad.\n\n(APPLAUSE)\n\nShe put her life at risk, at the very beginning of the war. Anybody who has any questions about whether women can serve courageously and honorably, need to meet women like Sally Bardon (ph).\n\nCOOPER: Senator Gravel?\n\nGRAVEL: Well, of course I want to take credit and admit that I'm the guy that filibustered for five months, all by myself, in the Senate to end the draft in the United States of America.\n\nAnd I'm very proud of that because George Bush does not have the boots on the ground to invade Iran.\n\nCOOPER: Thank you. Do you think -- should women register?\n\nGRAVEL: Of course women should be going -- go into the draft if we're going to have a draft. They should register also. What's the difference?\n\nCOOPER: OK. Thank you for your answer.\n\n(LAUGHTER)\n\nAnother video.\n\nQUESTION: Hello, my name is John McAlpin (ph). I'm a proud serving member of the United States military. I'm serving overseas.\n\nThis question is to Senator Hillary Clinton. The Arab states, Muslim nations, believe it's women as being second-class citizens. If you're president of the United States, how do you feel that you would even be taken seriously by these states in any kind of talks, negotiations, or any other diplomatic relations? I feel that is a legitimate question.\n\nCLINTON: Thank you, John, and thank you for your service to our country.\n\nYou know, when I was first lady, I was privileged to represent our country in 82 countries. I have met with many officials in Arabic and Muslim countries. I have met with kings and presidents and prime ministers and sheiks and tribal leaders.\n\nAnd certainly, in the last years during my time in the Senate, I have had many high-level meetings with presidents and prime ministers in Iraq, Afghanistan, Kuwait, Pakistan and many other countries.\n\nI believe that there isn't much doubt in anyone's mind that I can be taken seriously.\n\n(APPLAUSE)\n\nI believe that other countries have had women presidents and women prime ministers. There are several serving now -- in Germany, in Chile, in Liberia and elsewhere -- and I have noticed that their compatriots on the world stage certainly take them seriously.\n\nI think that it is...\n\nCOOPER: Time.\n\nCLINTON: It would be quite appropriate to have a woman president deal with the Arab and Muslim countries on behalf of the United States of America.\n\n(APPLAUSE)\n\nCOOPER: Let's go to another YouTube video.\n\nQUESTION: In 1982, Anwar Sadat traveled to Israel, a trip that resulted in a peace agreement that has lasted ever since.\n\nIn the spirit of that type of bold leadership, would you be willing to meet separately, without precondition, during the first year of your administration, in Washington or anywhere else, with the leaders of Iran, Syria, Venezuela, Cuba and North Korea, in order to bridge the gap that divides our countries?\n\nCOOPER: I should also point out that Stephen is in the crowd tonight.\n\nSenator Obama?\n\nOBAMA: I would. And the reason is this, that the notion that somehow not talking to countries is punishment to them -- which has been the guiding diplomatic principle of this administration -- is ridiculous.\n\n(APPLAUSE)\n\nNow, Ronald Reagan and Democratic presidents like JFK constantly spoke to Soviet Union at a time when Ronald Reagan called them an evil empire. And the reason is because they understood that we may not trust them and they may pose an extraordinary danger to this country, but we had the obligation to find areas where we can potentially move forward.\n\nAnd I think that it is a disgrace that we have not spoken to them. We've been talking about Iraq -- one of the first things that I would do in terms of moving a diplomatic effort in the region forward is to send a signal that we need to talk to Iran and Syria because they're going to have responsibilities if Iraq collapses.\n\nThey have been acting irresponsibly up until this point. But if we tell them that we are not going to be a permanent occupying force, we are in a position to say that they are going to have to carry some weight, in terms of stabilizing the region.\n\nCOOPER: I just want to check in with Stephen if he believes he got an answer to his question.\n\nQUESTION: I seem to have a microphone in my hand. Well, I'd be interested in knowing what Hillary has to say to that question.\n\nCOOPER: Senator Clinton?\n\nCLINTON: Well, I will not promise to meet with the leaders of these countries during my first year. I will promise a very vigorous diplomatic effort because I think it is not that you promise a meeting at that high a level before you know what the intentions are.\n\nI don't want to be used for propaganda purposes. I don't want to make a situation even worse. But I certainly agree that we need to get back to diplomacy, which has been turned into a bad word by this administration.\n\nAnd I will purse very vigorous diplomacy.\n\nAnd I will use a lot of high-level presidential envoys to test the waters, to feel the way. But certainly, we're not going to just have our president meet with Fidel Castro and Hugo Chavez and, you know, the president of North Korea, Iran and Syria until we know better what the way forward would be.\n\n(APPLAUSE)\n\nCOOPER: Senator Edwards, would you meet with Hugo Chavez, Fidel Castro, Kim Jong Il?\n\nEDWARDS: Yes, and I think actually Senator Clinton's right though. Before that meeting takes place, we need to do the work, the diplomacy, to make sure that that meeting's not going to be used for propaganda purposes, will not be used to just beat down the United States of America in the world community.\n\nBut I think this is just a piece of a bigger question, which is, what do we actually do? What should the president of the United States do to restore America's moral leadership in the world. It's not enough just to lead with bad leaders. In addition to that, the world needs to hear from the president of the United States about who we are, what it is we represent.\n\nCOOPER: Time.\n\nEDWARDS: That, in fact, we believe in equality, we believe in diversity, that they are at the heart and soul of what the United States of America is.\n\nCOOPER: We've got another question on the subject.\n\n(APPLAUSE)\n\nQUESTION: Dear Presidential Candidates, see those three flags over my shoulder? They covered the coffins of my grandfather, my father, and my oldest son.\n\nSomeday, mine will join them.\n\nI do not want to see my youngest sons join them.\n\nI have two questions. By what date after January 21st, 2009, will all U.S. troops be out of Iraq? And how many family members do you have serving in uniform?\n\nCOOPER: Senator Dodd.\n\n(APPLAUSE)\n\nDODD: I have advocated, again, that we have our troops out by April of next year. I believe that the timeframe is appropriate to do that. I would urge simultaneously that we do the things we've talked about here, and that is pursue the diplomatic efforts in the region to at least provide Iraq the opportunity to get on its feet. But I believe our military ought to be out before that.\n\nIf I'm president in January, I'd be advocating a responsible withdrawal that's safe for our troops who are there, to provide the resources for them to do it.\n\nAs I mentioned earlier, I served with the National Guard and Reserves. My brother served in the military as well. So, in my family, there have been at least two that I'm aware of. I have first cousins of mine that were submarine commanders. My uncle was a commander in World War II in the Navy. So there have been a number of people in my family.\n\nCOOPER: So you're saying that by January 21st, 2009, all U.S. troops would be out...\n\nDODD: Well, no, I've argued that it actually happen before then. I've been pushing...\n\nCOOPER: Right.\n\nDODD: There were 11 of us back when the supplemental bill came up a few weeks ago that voted to cut off that funding here. There's no other way I know to bring this to a head than through that mechanism. So come January, I hope that would be completed.\n\n(APPLAUSE)\n\nBut, if not, then I'd advocate a time frame that would be done responsibly.\n\nCOOPER: Governor Richardson?\n\nRICHARDSON: Well, I'm trying to provoke a debate here, because there's a difference between the senators and me on when we get our troops out.\n\nI've been very clear: Six month, but no residual forces.\n\nSenator Clinton has a plan that I understand is maybe 50,000 residual forces. Our troops have become targets. The diplomatic work...\n\nCOOPER: Is that even possible? Six months...\n\nRICHARDSON: The diplomatic work cannot begin to heal Iraq, to protect our interests, without troops out. Our troops have become targets. You are going to say six months, because it might provoke a civil war. There is a civil war. There is sectarian conflict.\n\n(APPLAUSE)\n\nThe time has come, and I get challenged. I have no troops left. One hundred are dying a month.\n\nCOOPER: Senator Biden?\n\nBIDEN: Number one, there is not a single military man in this audience who will tell this senator he can get those troops out in six months if the order goes today.\n\nLet's start telling the truth. Number one, you take all the troops out. You better have helicopters ready to take those 3,000 civilians inside the Green Zone where I have been seven times and shot at. You better make sure you have protection for them, or let them die, number one.\n\nSo we can't leave them there. And it's going to take a minimum 5,000 troops to 10,000 just to protect our civilians. So while you're taking them out, Governor, take everybody out. That may be necessary.\n\nNumber three, the idea that we all voted -- except for me -- for that appropriation. That man's son is dead. For all I know, it was an IED. Seventy percent of all the deaths occurred have been those roadside bombs. We have money in that bill to begin to build and send immediately mine-resistant vehicles that increase by 80 percent the likelihood none of your cadets will die, General. And they all voted against it.\n\nHow in good conscience can you vote not to send those vehicles over there as long as there's one single, solitary troop there?\n\nCOOPER: Senator Clinton?\n\n(APPLAUSE)\n\nCLINTON: You know, I put forth a comprehensive three-point plan to get our troops out of Iraq, and it does start with moving them out as soon as possible.\n\nBut Joe is right. You know, I have done extensive work on this. And the best estimate is that we can probably move a brigade a month, if we really accelerate it, maybe a brigade and a half or two a month. That is a lot of months.\n\nMy point is: They're not even planning for that in the Pentagon. You know, Mr. Berry, I am so sorry about the loss of your son. And I hope to goodness your youngest son doesn't face anything like that.\n\nBut until we get this president and the Pentagon to begin to at least tell us they are planning to withdraw, we are not going to be able to turn this around.\n\nAnd so, with all due respect to some of my friends here -- yes, we want to begin moving the troops out, but we want to do so safely, and orderly and carefully.\n\nWe don't want more loss of American life and Iraqi life as we attempt to withdraw, and it is time for us to admit that it's going to be complicated, so let's start it now.\n\nCOOPER: Congressman Kucinich?\n\n(APPLAUSE)\n\nKUCINICH: The underlying assumption here is that we're going to be in Iraq until the next president takes office, and I reject that totally. People can send a message to Congress right now -- and this is in a convention of this appearance -- they can text peace, and text 73223, text peace. Send a message to Congress right now, you want out.\n\nI introduced a plan four years ago, Anderson, that was a full plan to remove our troops. I'm the only one on this stage -- excuse me -- who not only voted against this war, but voted against funding the war.\n\n(APPLAUSE)\n\nIt is not credible to say you oppose the war from the start when you voted to fund it 100 percent of the time, 70 percent, 5 percent of the time. Let's get real about this war. Let's get those troops home and let's take a stand and do it now. Send a message to Congress now.\n\nCOOPER: All right.\n\nKUCINICH: We cannot wait until the next president takes office.\n\n(APPLAUSE)\n\nCOOPER: We've got to take a short break. As we go to break, we're going to show another campaign commercial, this one from Senator Mike Gravel.\n\n(BEGIN VIDEO CLIP)\n\nGRAVEL: George Bush's oil war was a mistake. We need to stop killing Americans and Iraqis. Been around since the beginning of time. It's not a war. It should be a police action based on global intelligence. It's the most serious problem facing humanity today.\n\nA universal voucher system will provide equal treatment and choice of providers.\n\nThe Congress has to stop raiding the surplus.\n\n(END VIDEO CLIP)\n\n(APPLAUSE)\n\nCOOPER: And welcome back to the CNN/YouTube debate. That was obviously a YouTube-style video from Governor Richardson's campaign.\n\nThis next question is on the topic of education.\n\nQUESTION: Hi, my name is Sheena Currell. I'm from (inaudible), South Carolina.\n\nMy question is: Who was your favorite teacher and why?\n\nCOOPER: A little bit hard to hear. The question was: Who was your favorite teacher and why?\n\nSenator Gravel?\n\nGRAVEL: A brother by the name of Edgar Burke (ph), who's since deceased, became a priest later, he recognized me as a very failing student because I was dyslexic and couldn't read very well. And so he gave me some attention and taught me to speak, and that's what little chance I get to use it today.\n\nThank you.\n\n(LAUGHTER)\n\nCOOPER: Senator Obama?\n\n(APPLAUSE)\n\nOBAMA: I had a teacher in fifth grade named Mrs. Hefty (ph). And I was just coming from overseas, coming back to the United States, felt a little bit out of place. And she had actually lived in Kenya and worked there and taught there and was able to give me some sense that even though I had experiences outside this country, those were actually valuable and important.\n\nAnd that's the power of a good teacher, is making every single child feel special.\n\nAnd we need more teachers like that in front of every single classroom.\n\nCOOPER: Senator Biden?\n\nBIDEN: The principal of my high school, his name was Justin E. Dinney (ph). He was a priest, and he taught me that the single most serious sin humanity could commit was abuse of power, and the second most serious sin was standing by and watching it be abused.\n\nHe was the brightest guy I have ever known.\n\nCOOPER: Senator Edwards?\n\nEDWARDS: Ms. Burns, who was the high school English teacher who made me believe that somebody can come from a little town in North Carolina where their daddy worked in the mill and do just about anything if they really believe in themselves.\n\nCOOPER: All right. With the next question, you are going to have to pay attention both to the words, the music and to what is written on the screen.\n\n(VIDEO PRESENTATION)\n\nCOOPER: Governor Richardson, you have had to implement No Child Left Behind in your state. Would you scrap it? Revise it?\n\nRICHARDSON: I would scrap it. It doesn't work.\n\n(APPLAUSE)\n\nIt is the law. It is not just an unfunded mandate, but the one- size-fits-all doesn't work.\n\nIt doesn't emphasize teacher training. It doesn't emphasize the disabled kids.\n\n(APPLAUSE)\n\nIt doesn't -- English learning kids don't get help.\n\nThe worst thing it does is it takes districts and schools that are not doing well, takes their funds away, penalizes them. If a school is not doing well, we help that school.\n\n(APPLAUSE)\n\nThe last thing we need to do, relating to teachers, is the key to a good education in this country is a strong teacher. I would have a minimum wage for all our teachers, $40,000 per year.\n\n(APPLAUSE)\n\nAnd I would emphasize science and math.(APPLAUSE)\n\nRICHARDSON: And I would also bring, to make sure our kids that are not scoring well in science and math, 29th in the world, to unlock those minds in science and math, I would have a major federal program of art in the schools...\n\n(APPLAUSE)\n\n... music, dancing, sculpture, and the arts.\n\n(APPLAUSE)\n\nCOOPER: Senator Biden, everyone on this stage who was in Congress in 2001 voted for No Child Left Behind. Would you scrap it or revise it?\n\nBIDEN: It was a mistake. I remember talking with Paul Wellstone at the time. And quite frankly, the reason I voted for it, against my better instinct, is I have great faith in Ted Kennedy, who is so devoted to education.\n\nBut I would scrap it -- or I guess, theoretically, you could do a major overhaul. But I think I'd start from the beginning.\n\nYou need better teachers. You need smaller classrooms. You need to start kids earlier. It's all basic.\n\nBIDEN: My wife's been teaching for 30 years. She has her doctorate in education. She comes back and points out how it's just not working.\n\nThe bottom line here is that I would fundamentally change the way in which we approach this.\n\nCOOPER: Our next question comes from South Carolina.\n\nQUESTION: Hey, I'm Mike Green from Lexington, South Carolina. And I was wanting to ask all the nominees whether they would send their kids to public school or private school.\n\n(APPLAUSE)\n\nCOOPER: The question is public school or private school. We know, Senator Clinton, you sent your daughter to private school.\n\nSenator Edwards, Obama and Biden also send your kids to private school.\n\nIs that correct?\n\nCLINTON: No.\n\nCOOPER: No?\n\nCLINTON: No, it's not correct.\n\nCOOPER: OK.\n\n(LAUGHTER)\n\n(CROSSTALK)\n\nEDWARDS: I've had four children, and all of them have gone to public school. I've got two kids...\n\n(APPLAUSE)\n\n... who are actually here with me in Charleston tonight, two kids, Emma Claire and Jack, just finished the third grade in public school in North Carolina, and Jack just finished the first grade in public school in North Carolina.\n\nCOOPER: Senator Clinton?\n\nCLINTON: And Chelsea went to public schools, kindergarten through eighth grade, until we moved to Washington. And then I was advised, and it was, unfortunately, good advice, that if she were to go to a public school, the press would never leave her alone, because it's a public school. So I had to make a very difficult decision.\n\nCOOPER: Senator Obama?\n\nCLINTON: But we were very pleased she was in public schools in Little Rock.\n\nCOOPER: Senator Obama?\n\nOBAMA: My kids have gone to the University of Chicago Lab School, a private school, because I taught there, and it was five minutes from our house. So it was the best option for our kids.\n\nBut the fact is that there are some terrific public schools in Chicago that they could be going to. The problem is, is that we don't have good schools, public schools, for all kids.\n\nA U.S. senator can get his kid into a terrific public school. That's not the question. The question is whether or not ordinary parents, who can't work the system, are able to get their kids into a decent school, and that's what I need to fight for and will fight for as president of the United States.\n\n(APPLAUSE)\n\nCOOPER: I want to ask this question of everyone.\n\nSenator Biden?\n\nBIDEN: My kids did go to private schools, because right after I got elected, my wife and daughter were killed. I had two sons who survived. My sister was the head of the history department. She was helping me raise my children at Wilmington Friends School.\n\nBIDEN: When it came time to go to high school when they had come through their difficulties -- I'm a practicing Catholic -- it was very important to me they go to a Catholic school, and they went to a Catholic school.\n\nMy kids would not have gone to that school were it not for the fact that my wife and daughter were killed and my two children were under the care of my sister who drove them to school every morning.\n\nCOOPER: Congressman Kucinich?\n\nKUCINICH: My daughter, Jackie, went to the Columbus public schools and got a great education. And I want to make sure that that commitment that sent her to public school is a commitment that will cause all American children to be able to go to great public schools.\n\n(APPLAUSE)\n\nCOOPER: Senator Gravel?\n\nGRAVEL: My children went to public school and private school, and I'm recommend that we need a little bit of competition in our system of education. Right now, we have 30 percent of our children do not graduate from high school. That is abominable, and that is the problem of both parties.\n\n(APPLAUSE)\n\nCOOPER: Senator Dodd?\n\nDODD: My daughter goes to the public school as a pre-school -- kindergarten. But I want to come back to the No Child Left Behind.\n\nDODD: Because I think remedying this -- and I understand the applause here -- accountability is very important. This is one country -- we've got to have the best prepared generation of Americans that we've ever produced in our educational system. No other issue, in my view, is as important as this one here.\n\nAnd getting the No Child Left Behind law right is where we ought to focus our attention here so that we have resources coming back to our states. You measure growth in a child. You invest in failing schools. But I would not scrap it entirely. Accountability is very important in this country. We ought not to abandon that idea.\n\nCOOPER: Let's try to stay on the topic.\n\nThe next question comes from Pennsylvania.\n\nQUESTION: Hi. My name is Anne, and I work at a Planned Parenthood in Pennsylvania.\n\nMy question is, we here at Planned Parenthood support comprehensive sex education and I'd like to know if any of you as candidates have talked to your children about sex and used medically accurate and age-appropriate information?\n\nCOOPER: Senator Edwards?\n\nEDWARDS: Well, Elizabeth and I have had sort of an unusual experience for parents, because Elizabeth likes to say that was made a member of AARP when she was pregnant with Jack, our last child.\n\nEDWARDS: We have had four children. Our two youngest children are now nine and seven. So we have been through the whole experience, including kids who have grown up.\n\nYes, the answer is we have taught our younger children when they were young how to look for the signs of wrong touching, any kind of what would be sexual abuse, inappropriate touching. And we have taught our children as they got older, all -- I think, using medically appropriate terms -- all that they needed to know to be properly educated.\n\nCOOPER: Senator Obama, Mitt Romney has accused you this week of saying that 5-year-old children should be getting sex education. Was he right?\n\nOBAMA: Ironically, this was actually a proposal that he himself said he supported when he was running for governor of Massachusetts.\n\nOBAMA: Apparently, he forgot.\n\n(LAUGHTER)\n\nAnd it makes the exact point that John made.\n\nI've got a 9-year-old daughter and a 6-year-old daughter. And I want them to know if somebody is doing something wrong to them, encroaching on their privacy, that they should come talk to me or my wife.\n\nAnd we've had that conversation, but not every parent is going to have that conversation with their child, and I think it's important that every child does, to make sure that they're not subject to the sexual predators.\n\nCOOPER: All right.\n\nNow, time for something completely different.\n\n(APPLAUSE)\n\nQUESTION: Hey, there, my name's Jackie Broyles. And I'm Dunlap [2nd person on video]. We're from Red State Update. Murfreesboro, Tennessee. This here question's for all you candidates. Mainstream media seems awfully interested in old Al Gore these days. Is he losing weight? What's it say in his book? Is he still worried about all the ice? They interpret all these as signs that he may or may not run. They really want to know if Al Gore's going to run again. Yes. Well, what we want to know is does that hurt you-all's feelings?\n\n(APPLAUSE)\n\n(LAUGHTER)\n\nCOOPER: Anybody have their feelings hurt?\n\n(LAUGHTER)\n\nNo, you're all right about that?\n\nBIDEN: Anderson...\n\nCOOPER: Yes?\n\nBIDEN: I think the people of Tennessee just had their feelings hurt.\n\n(LAUGHTER)\n\nCOOPER: They can take it up with Jackie.\n\nWe're not going to talk about Al Gore tonight, but we are going to talk about something that he talks a lot about. That's what our next question's about.\n\nQUESTION: Hello, Democratic candidates. I've been growing concerned that global warming, the single most important issue to the snowmen of this country, is being neglected.\n\nAs president, what will you do to ensure that my son will live a full and happy life?\n\nThank you.\n\n(LAUGHTER)\n\n(APPLAUSE)\n\nCOOPER: It's a funny video. It's a serious question. Congressman Kucinich?\n\nKUCINICH: Well, we have to understand the connection between global warring and global warming. Because when we start talking about wars for oil, we're essentially keeping the same approach to energy.\n\n(APPLAUSE)\n\nSo I'm saying we need to move away from reliance on oil and coal and toward reliance on wind and solar.\n\nKUCINICH: Anderson, that's the basis of my WGA, Works Green Administration, where we take an entirely new approach to organize the entire country around sustainability, around conservation. We don't have to have our snowmen melting, and the planet shouldn't be melting either.\n\nCOOPER: Are the people on this stage, are your fellow candidates, are they green enough?\n\nKUCINICH: No. And I think that the reason is that if you support, for example, in Iraq, if you say that Iraq should privatize its oil for the U.S. oil companies, then what you're doing is you're continuing a commitment to use more oil. If you believe that all options should be put on the table with respect to Iran, that's about oil.\n\nSo we need to move away from reliance on oil...\n\nCOOPER: Time.\n\nKUCINICH: ... and that's really connected to our defense policy, and I'm the one who gets the connection.\n\nCOOPER: All right.\n\n(APPLAUSE)\n\nSimilar topic. Let's listen.\n\nQUESTION: Hi, I'm Stephanie. We're in the Bay area, in my bathroom, because this is one of the places where I use compact fluorescent light bulbs. I use these to decrease my personal energy use, and I hear politicians talking about alternative energy to delay -- to decrease our energy impact as a whole.\n\nSo my question for you is, how is the United States going to decrease its energy consumption in the first place? In other words, how will your policies influence Americans, rather than just using special light bulbs, to do this?\n\nCOOPER: Senator Gravel, how do you get Americans to conserve?\n\nGRAVEL: Very simple, change our tax structure. Have a fair tax where people are taxed on what they spend rather than what they earn. And our tax system is totally corrupt right now.\n\nAnd so if we now have a retail sales tax, you'll take this nation of ours from a consuming nation to a savings nation.\n\nGRAVEL: And that's the most significant thing we can do to alter climate change.\n\n(APPLAUSE)\n\nCOOPER: Senator Dodd?\n\nDODD: Anderson, there are a number of things. The 50-mile-per- gallon standard is something I've advocated by 2017, that I would push hard for. Entire fleet of federal automobiles would be hybrids or electric automobiles, so we reduce even further out consumption.\n\nBut I believe I'm the only candidate here, along with Al Gore, who's called for that, is a corporate carbon tax. You've got to tax polluters. You've got to separate the price differential so that we can move away from fossil fuels that do so much damage to our environment, to our economy, to our future, to jobs in this country.\n\nUntil you deal with the issue of price, until you impose a corporate carbon tax, we will never get away from fossil fuels. It's the only way this can be achieved. You have to advocate that if you're serious about global warming.\n\nCOOPER: The question was about personal sacrifice. I just want to ask a question to...\n\nDODD: I drive a hybrid, we have a hybrid, and we use efficient light bulbs in our homes...\n\nCOOPER: So let me just ask a question to everyone on this stage. And I know we said we wouldn't do a lot of show of hands. This is probably the only one we'll do tonight.\n\nCOOPER: How many people here a private jet or a chartered jet to get here tonight?\n\nYou're not sure?\n\n(LAUGHTER)\n\nRICHARDSON: Yesterday.\n\nCOOPER: Yesterday, OK.\n\n(CROSSTALK)\n\n(LAUGHTER)\n\nCOOPER: Senator Gravel, what was that? You took the train?\n\nGRAVEL: I took the train...\n\n(APPLAUSE)\n\nCOOPER: OK.\n\nGRAVEL: And maybe one of these will give me a ride someday.\n\n(LAUGHTER)\n\nCLINTON: Anderson, you know, we haven't really seriously addressed this incredibly important issue of global warming and energy efficiency.\n\nCOOPER: We've got another question on it's way now.\n\nCLINTON: OK.\n\nThis is part one of the transcript for the CNN/YouTube presidential debates. To see the transcript of part two click here. E-mail to a friend", "images": ["http://i.cdn.turner.com/cnn/.element/img/2.0/global/ugc-open-arrow.gif", "http://i.l.cnn.net/cnn/.element/img/2.0/global/story_tools/txt_plus.gif", "http://i.cdn.turner.com/cnn/dam/assets/120628113935-karadzic-tease-most.jpg", "http://i.cdn.turner.com/cnn/.element/img/2.0/mosaic/base_skins/baseplate/corner_wire_BL.gif", "http://i.l.cnn.net/cnn/.element/img/2.0/global/story_tools/txt_minus_dn_.gif", "http://cdn.cnn.com/cnn/images/1.gif", "http://i.cdn.turner.com/cnn/.element/img/2.0/global/story_tools/save_btn.gif", "http://cdn.cnn.com/cnn/1.gif", "http://i.l.cnn.net/cnn/.element/img/2.0/global/story_tools/text_size.gif", "http://i.cdn.turner.com/cnn/.element/img/2.0/mosaic/base_skins/UGC/b_ugc_BL.gif", "http://i.cdn.turner.com/cnn/.element/img/2.0/mosaic/base_skins/UGC/b_ugc_TL.gif", "http://i.l.cnn.net/cnn/.element/img/2.0/mosaic/util/email.gif", "http://i.cdn.turner.com/cnn/.element/img/2.0/global/misc/125x70.no.photo.gif", "http://i.l.cnn.net/cnn/2007/POLITICS/07/23/debate.transcript/art.candidates.cnn.jpg", "http://i.l.cnn.net/cnn/.element/img/2.0/global/story_tools/txt_plus_dn.gif", "http://i.l.cnn.net/cnn/.element/img/2.0/mosaic/base_skins/baseplate/corner_dg_TL.gif", "http://i.cdn.turner.com/cnn/.element/img/2.0/global/story_tools/print_btn.gif", "http://i.l.cnn.net/cnn/images/1.gif", "http://i.cdn.turner.com/cnn/.element/img/2.0/mosaic/base_skins/UGC/ugc_BL.gif", "http://i.l.cnn.net/cnn/.element/img/2.0/mosaic/base_skins/baseplate/corner_dg_BL.gif", "http://www.cnn.com/.element/img/2.0/mosaic/base_skins/baseplate/corner_wire_BL.gif", "http://i.l.cnn.net/cnn/.element/img/2.0/mosaic/base_skins/right_rail/grey_corner_TL.gif", "http://i.cdn.turner.com/cnn/.element/img/2.0/global/ugc-close-arrow.gif", "http://i.l.cnn.net/cnn/.element/img/2.0/mosaic/base_skins/right_rail/grey_corner_BL.gif", "http://i.cdn.turner.com/cnn/.element/img/2.0/mosaic/util/loading.gif", "http://i.cdn.turner.com/cnn/.element/ssi/story/2.0/banner/elex08.inc/banner.elex.gif", "http://i.cdn.turner.com/cnn/.element/img/2.0/mosaic/base_skins/baseplate/corner_wire_TL.gif", "http://i.cdn.turner.com/cnn/.element/img/2.0/global/story_tools/email_btn.gif", "http://i.l.cnn.net/cnn/.element/img/2.0/global/story_tools/txt_minus.gif", "http://i.cdn.turner.com/cnn/.element/img/2.0/mosaic/base_skins/UGC/ugc_TL.gif"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "", "title": "Part I: CNN/YouTube Democratic presidential debate transcript", "meta_data": {"TITLE": "Part I: CNN/YouTube Democratic presidential debate transcript  - CNN.com", "description": "The eight candidates vying to be the Democrat nominee for president in the 2008 elections answered questions submitted by CNN and YouTube users in a debate Tuesday night. Here is a full transcript of the event:", "SECTION": "POLITICS"}, "movies": [], "publish_date": null, "source": "http://www.cnn.com", "summary": ""}