{"url": "www.networthwikibio.com/ellen-degeneres-bio-age-married-husband-daughter-partner-salary-and-net-worth.html", "text": "Contents\n\nEllen DeGeneres is an American comedian, writer, television host, producer and an actress. She is best known as the host of hit American television comedy talk show, The Ellen DeGeneres Show. She is also the creator, writer, and executive producer of the show. Previously, she appeared in the popular sitcom, Ellen. Ellen is also famous for voicing the character Dory in the 2003 American computer-animated film, Finding Nemo. Ellen has won numerous awards and honors including Saturn Award, Emmy Awards, People's Choice Awards, and the Presidential Medal of Freedom.Ellen DeGeneres was born as Ellen Lee DeGeneres on January 26, 1958, in the Metairie, Louisiana, the USA. Calculating her age, she is 59 years old. She is the daughter of Betty DeGeneres and Elliott Everett DeGeneres. She grew up as a daughter of French, German, and English background family. Her mother is a speech therapist and her father is an insurance agent. She later moved to Atlanta Texas after their parents divorced. She is French, English, German, and Irish descent.Ellen is 5 feet and 7 inches tall. She has a perfect height that suits her personality so well. She weight 59 kg. She has blonde hair and blue eyes. Her body size is 34-27-35, and her shoe size is 8 (US).Talking about Ellen’s sexual orientation, she is a lesbian. Being a lesbian, she never got married to any man and never had a husband. She came out as a lesbian in 1997. After coming out as lesbian, she is in a romantic relationship with actress Anne Heche that lasted until August 2000. After that, she had an affair with actress, director, photographer Alexandra Hedison until 2004. In 2004, she started dating American actress and model Portia de Rossi. Ellen and her partner Portia got married in August 2008, at their home in Beverly Hills, California. Ellen doesn’t have any children. Ellen and her partner have not made any plans for having any children till now. Being a lesbian, Ellen DeGeneres will never have a husband.To talk about salary and net worth of Ellen DeGeneres, she has successfully accumulated a huge amount of money. Her total net worth is $400 million whereas his salary is calculated to be around $75 million. Forbes estimated Ellen’s’ 2017 earnings at 77 million dollars. She is one of the highest paid celebrities in the world.Ellen DeGeneres done her graduation from the Atlanta High School and did major in communication from the University of New Orleans but dropped it. She also won the Saturn Award, Nickelodeon Kids’ Choice Award’ and ‘Annie Award in the category Best Supporting Actress for the film Finding Nemo. She has also hosted several big award functions such as the Academy Awards, Grammy Awards, and the Primetime Emmys. She has her own record company, Eleveneleven. She also has her own production company called A Very Good Production. Ellen also has a lifestyle brand, ED by Ellen. She has won numerous awards and honors in her life. She has won 30 Emmys and 20 People's Choice Awards, which is more than any other person till date. She received the Presidential Medal of Freedom in 2016 from former president Barack Obama.In 2015, Forbes named her the 50th most powerful woman in the world and number two on the World Pride Power list. Ellen is very popular on social media. She has more than 49.4 million followers on Instagram and more than 75.7 followers on Twitter. She is the sixth most followed user on Twitter and the 28th most followed user on Instagram. Her official Facebook page has more than 28 million likes and over 27 million followers. Ellen DeGeneres Wikipedia has more to say about her bio career growth, do visit it. Her bio can be found on several sites also.", "images": ["http://www.networthwikibio.com/files/blogs/small/tammybradshaw.jpg", "http://www.networthwikibio.com/files/blogs/small/mel-mclaughlin.jpg", "http://www.networthwikibio.com/files/blogs/small/meredith-mickelson.jpg", "http://www.networthwikibio.com/images/favicon.ico", "http://www.networthwikibio.com/files/blogs/small/anna-olson.jpg", "http://www.networthwikibio.com/files/blogs/small/adrienne-arsenault.jpg", "http://www.networthwikibio.com/files/blogs/medium/ellen-degeneres.jpeg", "http://www.networthwikibio.com/files/blogs/small/hamish-macdonald.jpg", "http://www.networthwikibio.com/files/blogs/medium/hamish-macdonald.jpg", "http://www.networthwikibio.com/files/blogs/small/janice-dean.png", "http://www.networthwikibio.com/files/blogs/small/32926loren-gray.jpg", "http://www.networthwikibio.com/files/blogs/medium/dorit-kemsley.jpg", "http://www.networthwikibio.com/files/blogs/small/nick-sagar.jpg", "http://www.networthwikibio.com/files/blogs/small/bryiana-noelle-flores.jpg", "http://www.networthwikibio.com/files/blogs/small/ellen-degeneres.jpeg", "http://www.networthwikibio.com/files/blogs/small/jenwiderstrom.jpg", "http://www.networthwikibio.com/images/logo-small.png", "http://www.networthwikibio.com/files/blogs/small/dorit-kemsley.jpg", "http://www.networthwikibio.com/files/blogs/small/jp-sears.jpeg", "http://www.networthwikibio.com/files/blogs/small/monica-malpass.jpg"], "top_img": "http://www.networthwikibio.com/images/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Ellen DeGeneres Bio, Age, Married, Husband, Daughter, Partner, Salary and Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Ellen DeGeneres, Ellen DeGeneres Bio, Age, Married, Husband, Daughter, Partner, Salary, Net Worth", "description": "Learn more about Ellen DeGeneres Bio, Age, Married, Husband, Daughter, Partner, Salary and Net Worth. Ellen DeGeneres is an American comedian, writer, television host, producer and an actress. She is French, English, German, and Irish descent. Ellen is 5 feet and 7 inches tall. She has a perfect height that suits her personality so well. She weight 59 kg. She has blonde hair and blue eyes."}, "movies": [], "publish_date": null, "source": "http://www.networthwikibio.com", "summary": ""}