{"url": "https://www.vulture.com/2018/11/the-good-place-recap-season-3-episode-9-doug-forcett.html", "text": "The Good Place Don’t Let the Good Life Pass You By Season 3 Episode 9 Editor’s Rating 5 stars * * * * * « Previous Next » Photo: Colleen Hayes/NBC\n\nThe first season of the TV show Lost ended on a frustrating cliffhanger, with some of the island’s castaways blowing open a mysterious hatch, peering down a deep, dark hole, and … to be continued. Season two then immediately resolved the question of “What’s down the hatch?” in an unexpected way. The premiere episode began with a man living underground, listening to the music of “Mama” Cass Elliot, getting ready for another day of trying to lead a flawless life, to avoid a fate worse than death.\n\nIn tonight’s The Good Place, “Don’t Let the Good Life Pass You By,” we finally meet the legendary Doug Forcett: the Calgary man who in 1972 got high on mushrooms and figured out almost exactly how the afterlife works, making him a celebrity in the great beyond. And what is he doing the first time we see him? Living far off the grid, listening to Mama Cass, reading Peter Singer’s book The Most Good You Can Do, and striving for personal perfection.\n\nOnce Lost fans were let inside the hatch, the show changed, becoming more overtly a wild science-fiction/fantasy epic. I have a feeling the arrival of Doug Forcett is going to be just as pivotal to The Good Place.\n\nDon’t misunderstand: It’s not that Doug’s all that impressive as a person. As played by the masterful Michael McKean (getting a chance to be funny again after his long stint as a stick-in-the-mud on Better Call Saul), Doug’s the definition of “virtuous to a fault.” Terrified of eternal damnation, he’s spent the past 46 years leading a miserable, inconsequential life, eating only radishes and lentils, drinking his own filtered waste, and allowing himself to be pushed around by every jerk kid and stray canine that wanders onto his property. “I’ve been mauled several times,” he admits, while gesturing to a cute small dog. “This little guy goes right for the squeaker.”\n\nMichael and Janet — disguised as ace journalists “Michael Scoop” and “Janet … Scoop” — are initially impressed with how much Doug “gets it,” and think he could be just the man to model for humankind the way to save our souls. But it doesn’t take long for them to see that Doug’s become “a happiness pump,” sacrificing for others unthinkingly. Even when they assure him that he’s likely earned more than enough points to get into the Good Place, and can now lighten up a bit, he can’t conceive of how that would work. “Eat something besides lentils,” Michael suggests. “Like radishes?” Doug asks.\n\nDuring the time that Michael and Janet spend with him, Doug accidentally steps on a snail and almost has a breakdown, yelling at his guests to fetch him some scotch tape while he applies pressure to the tiny mollusk. (“Too much pressure!” he wails. “I’m gonna need that tape!”) And yet he’s oblivious to how bizarre and out of balance his existence has become. “It’s the only rational way to live,” he insists, before adding, “Now if you’ll excuse me, I’m going to walk to Edmonton to give $85 to a snail charity.”\n\nHonestly, Shawn couldn’t have designed a better Bad Place than the one Doug has made for himself. And speaking of the demon we love to hate, Shawn shows up at the end of “Don’t Let the Good Life Pass You By,” with his whole demon army, ready to haul the humans back to perdition, and to enjoy the stunned, sad look on Michael’s face. (“I love seeing the looks on people’s faces,” he snarls. “It’s the best part of my job.”)\n\nBefore Shawn arrives, Eleanor, Tahani, Chidi, and Jason are killing time at a pub called the Puking Moose, in scenes that would be fairly pointless time-wasters if not for two things: (1) How adorable Chidi and Jason are together playing “Jacksonville-style pool,” where the players use their hands instead of cues, and they make up their own points, and (2) how Eleanor gradually psychs herself up to confess to Chidi that she saw herself falling in love with him in a Good Place memory, and that, “There’s a real possibility that I’m in love with you again… here… on this plane of existence… today… now… in Canada… during this brawl… with demons.”\n\nBrawl with demons? Yes, brawl with demons. A big reason why this episode gets the max star rating — besides McKean’s perfect performance as Doug — is because the bar fight in the Puking Moose is one of the most entertaining sequences in the entire run of the series. From Jason popping up suddenly with one of his molotov cocktails (starting to shout, “Bortl…!” before getting shushed), to Tahani fencing with a pool cue (and giving herself a three-tenths deduction for braining her opponent), to Janet hissing, “Screw this, let’s fight!” before karate-chopping and kicking her way through the hell-hordes, everything about this five minutes of TV is pure fun. The writers and cast (and director Dean Holland) should expect a healthy amount of Good Place points when they die, just for this episode.\n\nThe chapter then ends with multiple thickenings of a plot that had been running a little thin in recent weeks. Meeting Doug has convinced Michael of something he’s suspected for a while: that the afterlife points system is messed up, and he needs to talk to the accountants about what they’re doing wrong. Before he can slip off to do that, more demons arrive, and Janet has no choice but to zap everyone into her Void.\n\nSo that’s where we leave things: with the humans heading down a dark (metaphorical) hole, before beginning a mission to save humanity by changing the rules of the universe. From now on, as they used to say on Lost, whatever happens, happens.\n\nSoul Patrol\n\n• Let’s get to theorizin’! Michael shoves Shawn through a portal before the demon can explain what he meant about the humans’ families — and Doug Forcett! — all ending up in the Bad Place. (“I mean why let the guy keep saying mean stuff, right?” Michael mutters, defending why he sent Shawn packing.) I’ve wondered since season two whether there really is a Good Place. Maybe there’s just one afterlife of limitless possibilities, which crummy dead humans turned bad eons ago, as we are wont to do. Could this be what Shawn was suggesting? If I’m even 92 percent right, I expect to get my picture up on the wall in The Good Place writers room.\n\n• As he usually does when he’s pretending to be human, Michael goes way overboard as folksy reporter Michael Scoop, launching into a long reverie about the good ordinary people on this big blue marble of ours, before Janet shuts him down. (Janet, meanwhile, forgets where she is for a moment, and when Doug asks if his guests know anything about snail first aid, she reflexively answers, “Yes.”)\n\n• Doug calls every snail “snail,” because, “I don’t name them in case they already have a name they prefer.” But he does give a name to one he kills: Martin Luther Gandhi Tyler Moore Snail. (Other dead animals on Doug’s property: Rosa Parks the Deer Tick; Franklin Delano Raccoon; and Abraham Lincoln Einstein Mandela Goose.)\n\n• Seriously though, how good is Michael McKean? With his deep, rich voice and genteel demeanor, he can make even the simplest line funnier. Like: “What else can I do for you? Would you like to move in, permanently?”; or, while warning other snails that he’s walking by, “Look out… Here comes a shoe.”\n\n• I’d assumed this would be the last Good Place of the year, given the way the show’s past seasons have been parceled out; but apparently the show will just be off the air for a couple of weeks, and then back on December 6 with the real last Good Place of the year, an episode called “Janet(s)” (which already sounds amazing).", "images": ["https://pixel.nymag.com/imgs/daily/vulture/2018/11/15/recaps/15-the-good-place.w700.h700.jpg", "https://pixel.nymag.com/imgs/daily/vulture/2018/11/15/recaps/15-the-good-place.w1200.h630.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pixel.nymag.com/imgs/daily/vulture/2018/11/15/recaps/15-the-good-place.w1200.h630.jpg", "keywords": [], "authors": ["Noel Murray"], "canonical_link": "https://www.vulture.com/2018/11/the-good-place-recap-season-3-episode-9-doug-forcett.html", "title": "The Good Place Recap: True North", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "The Good Place Recap: True North", "url": "https://www.vulture.com/2018/11/the-good-place-recap-season-3-episode-9-doug-forcett.html", "description": "The arrival of a pivotal character marks a standout episode that also features one of the most entertaining sequences of the entire series.", "image": "https://pixel.nymag.com/imgs/daily/vulture/2018/11/15/recaps/15-the-good-place.w1200.h630.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "The Good Place Recap: True North", "description": "The arrival of a pivotal character marks a standout episode that also features one of the most entertaining sequences of the entire series.", "image": "https://pixel.nymag.com/imgs/daily/vulture/2018/11/15/recaps/15-the-good-place.w600.h315.2x.jpg", "card": "summary_large_image", "site": "@vulture"}, "article": {"published_time": "2018-11-15T21:01:00.000-05:00", "tag": "tv, tv recaps, overnights, recaps, the good place, the good place season 3", "publisher": "https://www.facebook.com/Vulture"}, "description": "The arrival of a pivotal character marks a standout episode that also features one of the most entertaining sequences of the entire series. A recap of The Good Place season three, episode nine, ‘Don’t Let the Good Life Pass You By.’", "sailthru.tags": "tv, tv recaps, overnights, recaps, the good place, the good place season 3", "author": "Noel Murray", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://cache.nymag.com/media/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1542333660.0, "source": "https://www.vulture.com", "summary": ""}