{"url": "en.wiktionary.org/wiki/will", "text": "See also: Will\n\nEnglish [ edit ]\n\nwill English Wikipedia has an article on: Wikipedia\n\nPronunciation [ edit ]\n\nEtymology 1 [ edit ]\n\nFrom Middle English willen, wullen, wollen, from Old English willan, wyllan (“to will, be willing, wish, desire, be used to, to be about to”), from Proto-Germanic *wiljaną (“to desire, wish”), from Proto-Indo-European *welh₁- (“to choose, wish”). Cognate with Dutch willen, Low German willen, German wollen, Swedish and Norwegian Nynorsk vilja, Norwegian Bokmål ville, Latin velle (“wish”, verb) and Albanian vel (“to satisfy, be stuffed”). The verb is not always distinguishable from Etymology 3, below.\n\nVerb [ edit ]\n\nwill (third-person singular simple present will, present participle willing, simple past would, no past participle)\n\n( , transitive uncommon ) To wish, desire (something). Do what you will. 1601 , William Shakespeare, Twelfth Night, or What You Will : Twelfe Night, Or what you will (original spelling)\n\n1944, FJ Sheed, translating St. Augustine, Confessions: Grant what Thou dost command, and command what Thou wilt. ( , intransitive nowadays rare ) To wish or desire (that something happen); to intend (that). c. 1450 , The Macro Plays : If thou wilt fare well at meat and meal, come and follow me.\n\n, : 1526 , William Tyndale, trans. Bible , Matthew XXVI: the disciples cam to Jesus sayinge unto hym: where wylt thou that we prepare for the to eate the ester lambe?\n\n, William Tyndale, trans. , Matthew XXVI: 1624, Democritus Junior [pseudonym; The Anatomy of Melancholy: [ … ] , 2nd corrected and augmented edition, Oxford, Oxfordshire: Printed by John Lichfield and James Short, for Henry Cripps, OCLC 54573970 : , Democritus Junior [pseudonym; Robert Burton ],, 2nd corrected and augmented edition, Oxford, Oxfordshire: Printed by John Lichfield and James Short, for Henry Cripps, see God's goodwill toward men, hear how generally his grace is proposed, to him, and him, and them, each man in particular, and to all. 1 Tim. ii. 4. \"God will that all men be saved, and come to the knowledge of the truth.\" ( auxiliary ) To habitually do (a given action). 1994 , Nelson Mandela, Long Walk to Freedom , Abacus 2010, page 28: As young men will , I did my best to appear suave and sophisticated.\n\n, Nelson Mandela, , Abacus 2010, page 28: 2009 , Stephen Bayley, The Telegraph , 24 Sep 09: How telling is it that many women will volunteer for temporary disablement by wearing high heeled shoes that hobble them?\n\n, Stephen Bayley, , 24 Sep 09: 2011, \"Connubial bliss in America\", The Economist: So far neither side has scored a decisive victory, though each will occasionally claim one. ( auxiliary ) To choose to (do something); used to express intention but without any temporal connotations (+ bare infinitive), often in negation . I’ve told him three times, but he won’t take his medicine. ( auxiliary ) Used to express the future tense, sometimes with some implication of volition when used in the first person. Compare shall. 1602 , William Shakespeare, Twelfth Night, or What You Will , act IV: Good fool, as ever thou wilt deserve well at my hand, help me to a candle, and pen, ink and paper : as I am a gentleman, I will live to be thankful to thee for’t.\n\n, William Shakespeare, , act IV: 1845, Alexandre Dumas, The Count of Monte Cristo, chapter LXXIII: “I will go to you, and we will fly; but from this moment until then, let us not tempt Providence, let us not see each other. It is a miracle, it is a providence that we have not been discovered. If we were surprised, if it were known that we met thus, we should have no further resource.” ( auxiliary ) To be able to, to have the capacity to. Unfortunately, only one of these gloves will actually fit over my hand. ( auxiliary ) Expressing a present tense with some conditional or subjective weakening: \"will turn out to\", \"must by inference\". 2007 , Edward Jesko, The Polish : “That will be five zloty.” I reached into my pocket and came up with some coins.\n\n, Edward Jesko, : 2012, Penny Freedman, All The Daughters: Unless she diverted on the ten minute walk home, she’ll have got home at about half past.\n\nUsage notes [ edit ]\n\nHistorically, will was used in the simple future sense only in the second and third person, while shall was used in the first person. Today, that distinction is almost entirely lost, and the verb takes the same form in all persons and both numbers. Similarly, in the intent sense, will was historically used with the second and third person, while shall was reserved for the first person.\n\nwas used in the simple future sense only in the second and third person, while was used in the first person. Today, that distinction is almost entirely lost, and the verb takes the same form in all persons and both numbers. Similarly, in the intent sense, was historically used with the second and third person, while was reserved for the first person. Historically, the present tense is will and the past tense is would. Early Modern English had a past participle would which is now obsolete.\n\nMalory, ‘Many tymes he myghte haue had her and he had wold’ ; John Done, ‘If hee had would, hee might easily [...] occupied the Monarchy.’\n\nFormerly, will could be used elliptically for \"will go\" — e.g. \"I'll to her lodgings\" (Marlowe).\n\ncould be used elliptically for \"will go\" — e.g. \"I'll to her lodgings\" (Marlowe). See the usage note at shall .\n\n. The present participle does not apply to the uses of will as an auxiliary verb.\n\nas an auxiliary verb. The form of will with the enclitic -n’t (or the present tense negative form of will in the analysis in which -n’t is an inflectional suffix) is won’t ( “ will not ” ) , while the corresponding form of the past tense would is wouldn’t. Won’t is an irregular form; the expected form would be willn’t.\n\nTranslations [ edit ]\n\nto wish or desire Greek: Ancient: ἐθέλω ( ethélō ) , θέλω ( thélō ) ( later ) , βούλομαι ( boúlomai )\n\nJapanese: 望む (ja) ( nozomu ) , 希望 (ja) ( kibou ) , 願う (ja) ( negau )\n\nSee also [ edit ]\n\nEtymology 2 [ edit ]\n\nFrom Middle English wille, from Old English willa (“mind, will, determination, purpose, desire, wish, request, joy, delight, pleasure”) (compare verb willian), from Proto-Germanic *wiljô (“desire, will”), from Proto-Indo-European *welh₁- (“to choose, wish”). Cognate with Dutch wil, German Wille, Swedish vilja, Norwegian vilje. The verb is not always distinguishable from Etymology 1, above.\n\nNoun [ edit ]\n\nwill (plural wills)\n\nOne's independent faculty of choice; the ability to be able to exercise one's choice or intention. Of course, man's will is often regulated by his reason. One's intention or decision; someone's orders or commands. Eventually I submitted to my parents' will. The act of choosing to do something; a person’s conscious intent or volition. Most creatures have a will to live. 2012 May 27, Nathan Rabin, “TV: Review: THE SIMPSONS (CLASSIC): “New Kid On The Block” (season 4, episode 8; originally aired 11/12/1992)”, in The Onion AV Club ‎[1]: May 27, Nathan Rabin, “TV: Review: THE SIMPSONS (CLASSIC): “New Kid On The Block” (season 4, episode 8; originally aired 11/12/1992)”, in The episode’s unwillingness to fully commit to the pathos of the Bart-and-Laura subplot is all the more frustrating considering its laugh quota is more than filled by a rollicking B-story that finds Homer, he of the iron stomach and insatiable appetite, filing a lawsuit against The Frying Dutchman when he’s hauled out of the eatery against his will after consuming all of the restaurant’s shrimp (plus two plastic lobsters). ( law ) : A formal declaration of one's intent concerning the disposal of one's property and holdings after death; the legal document stating such wishes. 1928, Lawrence R. Bourne, chapter 1, in Well Tackled! ‎[2]: , Lawrence R. Bourne, chapter 1, in “Uncle Barnaby was always father and mother to me,” Benson broke in; then after a pause his mind flew off at a tangent. “Is old Hannah all right—in the will, I mean?” ( archaic ) That which is desired; one's wish. 1590, Edmund Spenser, The Faerie Queene, III.ii: I auow by this most sacred head / Of my deare foster child, to ease thy griefe, / And win thy will [...]. ( archaic ) Desire, longing. (Now generally merged with later senses.) He felt a great will to make a pilgrimage to the Holy Land.\n\nUsage notes [ edit ]\n\nFor example a strong will, free will, or independent will.\n\nSynonyms [ edit ]\n\nDerived terms [ edit ]\n\nTranslations [ edit ]\n\nintention or decision Catalan: voluntat (ca) f\n\nFinnish: tahto (fi) Slovene: volja (sl) f\n\nact of choosing to do something; conscious intent or volition Albanian: vullnet (sq) m\n\nArabic: رَغْبَة f ( raḡba )\n\nArmenian: կամք (hy) ( kamkʿ )\n\nBashkir: ихтыяр ( ixtïyar )\n\nBelarusian: во́ля f ( vólja )\n\nBulgarian: во́ля (bg) f ( vólja )\n\nCatalan: voluntat (ca) f , albir (ca) m\n\n, Cebuano: buot pagbuot\n\nChinese: Mandarin: 意志 (zh) ( yìzhì )\n\nCzech: vůle (cs) f\n\nDalmatian: voluntuot\n\nDanish: vilje c\n\nDutch: wil (nl) m , wens (nl) m\n\n, Esperanto: volo\n\nEstonian: tahe\n\nEwe: lɔ̃lɔ̃nu\n\nFaroese: vilji m\n\nFinnish: tahto (fi) halu (fi)\n\nFrench: volonté (fr) f\n\nFriulian: volontât f\n\nGalician: vontade (gl) f , albidro m\n\n, Georgian: ნება ( neba ) , სურვილი ( survili )\n\n, German: Wille (de) m\n\nGreek: βούληση (el) f ( voúlisi ) , θέληση (el) f ( thélisi ) Ancient: θέλημα n ( thélēma )\n\n, Hebrew: רָצוֹן (he) m ( r'tzon ) , אָבָה (he) ( ava )\n\n, Hindi: इच्छा (hi) f ( icchā )\n\nHungarian: szándék (hu) akarat (hu)\n\nIndonesian: hendak (id)\n\nIrish: deoin f\n\nItalian: volontà (it) f\n\nJapanese: 意志 (ja) ( いし, ishi )\n\nKorean: 의지 (ko) ( uiji ) Latin: voluntas\n\nLithuanian: valia noras\n\nLuxembourgish: Wëllen m\n\nMacedonian: во́лја f ( vólja )\n\nMaori: takune whakaaro e ( before verb ) , ka (mi) ( before verb )\n\n, Ngazidja Comorian: nyandzo class 9 / 10\n\nNogai: эрк ( érk )\n\nNorwegian: vilje (no) m , ønske (no) n\n\n, Occitan: volontat (oc)\n\nOld Church Slavonic: Cyrillic: волꙗ f ( volja )\n\nOld Norse: vili m\n\nPersian: آرزو (fa) ( ârezu ) , خواسته (fa) ( xâste )\n\n, Polish: wola (pl) f\n\nPortuguese: vontade (pt) f\n\nRomanian: voință (ro) f\n\nRomansch: voluntad volunted voluntà\n\nRussian: во́ля (ru) f ( vólja )\n\nSanskrit: इच्छा (sa) f ( icchā )\n\nSardinian: bolontade boluntadi volontade\n\nSerbo-Croatian: Cyrillic: воља f Roman: vȍlja (sh) f\n\nSlovak: vôľa f\n\nSlovene: volja (sl) f\n\nSorbian: Lower Sorbian: wóla f Upper Sorbian: wola f\n\nSpanish: voluntad (es) f , albedrío (es) m\n\n, Swedish: vilja (sv) c , önskan (sv) c\n\n, Tocharian A: kri\n\nUkrainian: во́ля f ( vólja )\n\nWelsh: ewyllys (cy) f\n\nEtymology 3 [ edit ]\n\nFrom Middle English willen, from Old English willian (“to will”), from Proto-Germanic *wiljōną (“to will”), from Proto-Indo-European *welh₁- (“to choose, wish”). Cognate with German Low German willen, German willen.\n\nVerb [ edit ]\n\nwill (third-person singular simple present wills, present participle willing, simple past willed or (rare) would, past participle willed)\n\nSynonyms [ edit ]\n\n( bequeath ) : bequeath leave\n\nTranslations [ edit ]\n\nSee also [ edit ]\n\nCahuilla [ edit ]\n\nEtymology [ edit ]\n\nFrom Proto-Uto-Aztecan *wip\n\nNoun [ edit ]\n\nwíll\n\nGerman [ edit ]\n\nPronunciation [ edit ]\n\nIPA (key) : /vɪl/\n\n: Audio\n\nVerb [ edit ]\n\nwill", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Wikipedia-logo.png/44px-Wikipedia-logo.png", "http://en.wiktionary.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wiktionary.org/static/images/poweredby_mediawiki_88x31.png", "http://en.wiktionary.org/static/images/wikimedia-button.png", "http://en.wiktionary.org/static/apple-touch/wiktionary/en.png"], "top_img": "http://en.wiktionary.org/static/apple-touch/wiktionary/en.png", "keywords": [], "authors": [], "canonical_link": "https://en.wiktionary.org/wiki/will", "title": "Wiktionary", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "http://en.wiktionary.org", "summary": ""}