{"url": "https://www.businesswire.com/news/home/20170829005684/en/iHeartMedia-Announces-Lineup-2017-iHeartRadio-Fiesta-Latina", "text": "NEW YORK--(BUSINESS WIRE)--iHeartMedia announced today the lineup for the 2017 iHeartRadio Fiesta Latina at AmericanAirlines Arena in Miami on Saturday, November 4, 2017. The fourth annual mega-concert will celebrate the best in Latin music with performances by Nacho, Gente De Zona, Don Omar, CNCO, Reik, Jesse y Joy and Camila Cabello, with more artists to follow. For the second year, the concert event will be hosted by Enrique Santos, Chairman and Chief Creative Officer of iHeartLatino and on-air personality for iHeartRadio.\n\nThe 2017 iHeartRadio Fiesta Latina will once again bring the power and unforgettable performances of the iHeartRadio Music Festival to Latin music. For the third straight year, Telemundo will broadcast the 2017 iHeartRadio Fiesta Latina as a TV special at a later date.\n\n“The iHeartRadio Fiesta Latina is a true celebration of Latin music and culture. Each year we bring the best of Latin music to one stage and this year’s impeccable lineup is no different,” said Enrique Santos, Chairman and Chief Creative Officer for iHeartLatino. “We’re thrilled to once again partner with Telemundo, whom just like us have a powerful connection to the Latin community.”\n\nIn addition to the special re-broadcast on Telemundo, the star-studded iHeartRadio Fiesta Latina will video stream live exclusively on Telemundo.com for fans across the U.S. and broadcast live on iHeartMedia Spanish-Pop, Tropical, regional Mexican and Spanish Adult Hit radio stations nationwide on Saturday, November 4.\n\nBeginning Monday, October 2, iHeartMedia will launch a four-week nationwide promotion to give thousands of Latin music fans across the country the opportunity to win trips to Miami to experience the 2017 iHeartRadio Fiesta Latina. The promotion will run on all iHeartMedia Spanish-language stations as well as on iHeartRadio and on additional radio stations in key markets across the country.\n\nTickets go on sale to the general public on August 30 at 10 a.m. ET. For more information, visit iheartradio.com/fiesta. Proud partners of the 2017 iHeartRadio Fiesta Latina include Telemundo and AT&T, with more to be announced soon.\n\nThe iHeartRadio Fiesta Latina is part of iHeartMedia's incredibly successful roster of major concert events, which includes the iHeartRadio Music Festival, the biggest live concert event in radio history, which features more than 20 A-list artists across every music genre on one stage; the iHeartSummer’17 Weekend by AT&T the nationwide iHeartRadio Jingle Ball Concert Tour; the iHeartCountry Festival; and the iHeartRadio Music Awards, which generated 165 billion social media impressions.\n\nAbout Telemundo\n\nTELEMUNDO is a world-class media company leading the industry in the production and distribution of high-quality Spanish-language content across its multiplatform portfolio to U.S. Hispanics and audiences around the world. The network features original scripted dramas from Telemundo Studios – the #1 producer of Spanish-language primetime content – as well as non-scripted productions, theatrical motion pictures, specials, news and first-class sports events, reaching 94% of U.S. Hispanic viewers in 210 markets through its 16 owned stations and 55 broadcast affiliates. Telemundo also owns WKAQ, a local television station serving Puerto Rico. TELEMUNDO is part of NBCUniversal Telemundo Enterprises, a division of NBCUniversal, one of the world's leading media and entertainment companies. NBCUniversal is a subsidiary of Comcast Corporation.\n\nAbout iHeartMedia\n\nWith over a quarter of a billion monthly listeners in the U.S. and over 85 million social followers, iHeartMedia has the largest national reach of any radio or television outlet in America. As the leader in multiplatform connections, it also serves over 150 local markets through 858 owned radio stations, and the company’s radio stations and content can be heard on AM/FM, HD digital radio, satellite radio, on the Internet at iHeartRadio.com and on the company’s radio station websites, on the iHeartRadio mobile app, in enhanced auto dashes, on tablets, wearables and smartphones, and on gaming consoles.\n\niHeartRadio, iHeartMedia’s digital radio platform, is the fastest growing digital audio service in the U.S. and offers users thousands of live radio stations, personalized custom artist stations created by just one song or seed artist and the top podcasts and personalities. With over 1.4 billion downloads, iHeartRadio reached 100 million registered users faster than any other radio or digital music service.\n\niHeartMedia’s platforms include radio broadcasting, online, mobile, digital and social media, podcasts, personalities and influencers, live concerts and events, syndication, music research services and independent media representation. iHeartMedia is a division of iHeartMedia, Inc. (PINK:IHRT). Visit iHeartMedia.com for more company information.", "images": ["https://mms.businesswire.com/media/20170829005684/en/609238/21/iHRFL_2017_LOGO_COLOR.jpg", "https://www.businesswire.com/images/icons/icon_search.gif", "https://www.businesswire.com/images/bwlogo_extreme.png", "https://mms.businesswire.com/media/20170829005684/en/609238/2/iHRFL_2017_LOGO_COLOR.jpg"], "top_img": "https://mms.businesswire.com/media/20170829005684/en/609238/21/iHRFL_2017_LOGO_COLOR.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.businesswire.com/news/home/20170829005684/en/iHeartMedia-Announces-Lineup-2017-iHeartRadio-Fiesta-Latina", "title": "iHeartMedia Announces Lineup for the 2017 iHeartRadio Fiesta Latina, Celebrating the Best in Latin Music on November 4 in Miami", "meta_data": {"description": "iHeartMedia announced today the lineup for the 2017 iHeartRadio Fiesta Latina at AmericanAirlines Arena in Miami on Saturday, November 4, 2017. The fo", "DC.date.issued": "2017-08-29", "robots": "noodp,noydir", "twitter": {"card": "summary", "site": "@businesswire", "title": "iHeartMedia Announces Lineup for the 2017 iHeartRadio Fiesta Latina, Celebrating the Best in Latin Music on November 4 in Miami", "description": "iHeartMedia announced today the lineup for the 2017 iHeartRadio Fiesta Latina at AmericanAirlines Arena in Miami on Saturday, November 4, 2017. The fo", "widgets": {"csp": "on"}, "image": "https://mms.businesswire.com/media/20170829005684/en/609238/21/iHRFL_2017_LOGO_COLOR.jpg"}, "og": {"title": "iHeartMedia Announces Lineup for the 2017 iHeartRadio Fiesta Latina, Celebrating the Best in Latin Music on November 4 in Miami", "description": "iHeartMedia announced today the lineup for the 2017 iHeartRadio Fiesta Latina at AmericanAirlines Arena in Miami on Saturday, November 4, 2017. The fo", "image": {"identifier": "https://mms.businesswire.com/media/20170829005684/en/609238/21/iHRFL_2017_LOGO_COLOR.jpg", "secure_url": "https://mms.businesswire.com/media/20170829005684/en/609238/21/iHRFL_2017_LOGO_COLOR.jpg", "type": "image/jpg", "width": 150, "height": 150}, "type": "article"}, "fb": {"pages": 1157450754275955}, "p": {"domain_verify": "95725e0359a14c2e1ccbd936e10d20d6"}, "viewport": "width=device-width,initial-scale=1"}, "movies": [], "publish_date": null, "source": "https://www.businesswire.com", "summary": ""}