{"url": "http://time.com/5213931/dushon-brown-dead-chicago-fire/", "text": "DuShon Monique Brown, an actress best known for her role on NBC’s Chicago Fire, died Friday. She was 49.\n\nThe actress died after 12 p.m. on Friday at the Franciscan St. James Health Olympia Fields hospital just outside of Chicago, the Chicago Tribune reported. Brown’s cause of death was not immediately disclosed.\n\nOn Chicago Fire, Brown played the witty and pragmatic Connie, the assistant to Chief Boden, and appeared on the show since it began in 2012.\n\n“The ‘Chicago Fire’ family is devastated to lose one of its own,” Dick Wolf, the show’s executive producer, said in a statement. “Our thoughts and prayers are with DuShon’s family and we will all miss her.”\n\nIn a 2016 interview with the Huffington Post, Brown described the cast and crew of Chicago Fire as a family. “I’m not on set every day, but people are always asking me about my kid and how my day is going and they are all so very sweet and kind,” she said.\n\nRecently, the actress told Hidden Remote that Connie, her character on the show, wasn’t supposed to be a series regular initially. When auditioning for the role, she said, she realized the “one-liner” role could develop into something more. The character then became more complex and served as sort of a mother figure, Brown said.\n\n“They’ve done this beautiful dance with Connie where you see her soft moments, you see how she cares about the kids in the firehouse,” Brown said.\n\nBrown had a similar experience during her 13-episode stint on AMC’s Prison Break, where her character, initially just called “Nurse,” developed into a larger role, later named Katie Welch. She appeared on that show from 2005 to 2007.\n\nThroughout her career, Brown also appeared in a number of other TV shows and films, including Shameless and Empire. When not in front of the camera, Brown worked as a crisis counselor at Kenwood Academy High School in Chicago and led its drama program, according to the Tribune.\n\nGrowing up, Brown attended Whitney Young Magnet High School in Chicago and graduated from the University of Illinois at Urbana-Champaign with a degree in psychology. She is survived by her daughter, Zoe.\n\n“We are devastated by the loss of a very talented and kindhearted soul,” Robert Shroeder, Brown’s manager at Grossman & Jack Talent in Chicago told the Tribune. “She brought laughter and joy to many, and she will be greatly missed.”\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nContact us at editors@time.com.", "images": ["https://api.time.com/wp-content/uploads/2020/04/THTH_103_Portraits_01423R2.jpg?quality=85&w=600", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2020/04/TheCircle.jpeg?quality=85&w=600", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "http://time.com/img/loading-circle.gif", "https://api.time.com/wp-content/uploads/2018/03/dushon-monique-brown.jpg?quality=85&w=171&h=154&crop=1", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2018/03/dushon-monique-brown.jpg?quality=85&w=171&h=154&crop=1", "keywords": [], "authors": ["Jennifer Calfas"], "canonical_link": "https://time.com/5213931/dushon-brown-dead-chicago-fire/", "title": "\"Chicago Fire\" Actress DuShon Monique Brown Dies at Age 49", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "onetime,remembrances,Television", "news_keywords": "onetime,remembrances,Television", "description": "\"Chicago Fire\" actress DuShon Monique Brown, who played the fire chief's assistant Connie, died Friday. She was 49 years old.", "og": {"title": "\"Chicago Fire\" Actress DuShon Monique Brown Dies at Age 49", "type": "article", "site_name": "Time", "url": "https://time.com/5213931/dushon-brown-dead-chicago-fire/", "description": "On Chicago Fire, Brown played the witty and pragmatic Connie", "image": {"identifier": "https://api.time.com/wp-content/uploads/2018/03/dushon-monique-brown.jpg?quality=85&w=171&h=154&crop=1", "width": 171, "height": 154}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5213931/dushon-brown-dead-chicago-fire/", "description": "\"Chicago Fire\" actress DuShon Monique Brown, who played the fire chief's assistant Connie, died Friday. She was 49 years old.", "media": "https://api.time.com/wp-content/uploads/2018/03/dushon-monique-brown.jpg?quality=85&w=171&h=154&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5213931/dushon-brown-dead-chicago-fire/", "title": "\"Chicago Fire\" Actress DuShon Monique Brown Dies at Age 49", "description": "On Chicago Fire, Brown played the witty and pragmatic Connie", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2018/03/dushon-monique-brown.jpg?quality=85&w=171&h=154&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}