{"url": "https://web.archive.org/web/20160620202146/http://therightists.com:80/gretchen-carlson-the-2nd-amendment-was-written-before-guns-were-invented", "text": "Gretchen Carlson is renewing her push for an AR-15 ban, firing off a series a tweets further criticizing AR-15. Breitbart News reported that Carlson said that AR-15s are not needed to “hunt or kill deer” and suggested they only serve to enable terrorists to carry out their attacks with greater efficiency. She quoted a December 2015 poll showing majority support for an “assault weapons” ban and said, “I’m with the majority today, taking a stand.”\n\nInterestingly, when confronted by Second Amendment supporters on Twitter, Carlson doubled down on her pro-ban stance, claiming that “the fact that you’re even using the Second Amendment as an argument against banning assault weapons shows me you’re ignorant. Don’t you know the 2nd Amendment was written before guns were even invented?”\n\nAsked to comment on her tweets, Carlson told Breitbart News that “at one point, I even asked myself what was the use of trying to prove why assault rifles are bad to these people when they clearly don’t possess the most fundamental knowledge of history? I felt like I was trying to teach nuclear physics to someone who’s illiterate. I mean, we have Google and the Internet today. How hard was it to Google ‘the 2nd Amendment of the Constitution of the United States?’ I mean, really.”\n\n“And what worried me even more,” she continued, “was the fact that it seemed like every single person that replied to my tweet was under the impression that they were right and I was wrong. So, I’m sitting there, thinking, ‘Ooookaaay, someone obviously wasn’t paying attention during history class – a lot of someones, apparently – hmm, they must have been distracted by thinking about how they were off emptying 30 rounds into some innocent animal.’”\n\nCarlson also added, “I mean, I know the education in our country isn’t the best in the world, but I figured we’d at least be able to each our kids the basics like math and history. But, I guess I was wrong. What’s the next thing I’m going to hear, that we somehow went to the Moon and that Elvis Presley is dead? Come on, I’m not buying it.”\n\n“Like, I can understand about the Second Amendment and maybe something else that happened way, way back, but the King being dead? I really don’t know who would believe that. Just last night I saw him on YouTube. You know YouTube? He was performing in Vegas and there were thousands of bearded and longhaired men in the audience, so it must have been a beard convention or something. I swear, sometimes I don’t believe how stupid Americans can be,” she said.", "images": ["https://web.archive.org/web/20160620202146im_/https://analytics.twitter.com/i/adsct?txn_id=l4mpm&p_id=Twitter", "https://web.archive.org/web/20160620202146im_/http://pixel.quantserve.com/pixel/p-6G2CQMn_jcjgR.gif", "https://web.archive.org/web/20160620202146im_/http://therightists.com/wp-content/uploads/2016/06/091313_GretchenFarewell-645x325.jpg", "https://web.archive.org/web/20160620202146im_/http://therightists.com/wp-content/uploads/2016/05/Ted-And-Heidi-Cruz-1-150x150.jpg", "https://web.archive.org/web/20160620202146im_/http://t.co/i/adsct?txn_id=l4mpm&p_id=Twitter", "https://web.archive.org/web/20160620202146im_/https://www.facebook.com/tr?ev=6021441883564&cd[value]=0.00&cd[currency]=USD&noscript=1", "https://web.archive.org/web/20160620202146im_/http://therightists.com/wp-content/uploads/2016/06/maxresdefault-1-150x150.jpg", "https://web.archive.org/web/20160620202146im_/http://therightists.com/wp-content/uploads/2016/06/091313_GretchenFarewell-150x150.jpg", "https://web.archive.org/web/20160620202146im_/http://therightists.com/wp-content/uploads/2016/06/maxresdefault-150x150.jpg", "https://web.archive.org/web/20160620202146im_/http://therightists.com/wp-content/uploads/2016/06/23158392405_d3e3b60cb8_o-150x150.jpg"], "top_img": "https://web.archive.org/web/20160620202146im_/http://therightists.com/wp-content/uploads/2016/06/091313_GretchenFarewell-150x150.jpg", "keywords": [], "authors": ["Eli The"], "canonical_link": "https://web.archive.org/web/20160620202146/http://therightists.com/gretchen-carlson-the-2nd-amendment-was-written-before-guns-were-invented/", "title": "Gretchen Carlson: “The 2nd Amendment Was Written Before Guns Were Invented”", "meta_data": {"viewport": "width=device-width; initial-scale=1", "generator": "WordPress 4.5.2", "og": {"type": "article", "url": "https://web.archive.org/web/20160620202146/http://therightists.com/gretchen-carlson-the-2nd-amendment-was-written-before-guns-were-invented/", "title": "Gretchen Carlson: “The 2nd Amendment Was Written Before Guns Were Invented”", "site_name": "TheRightists.com", "locale": "en_US", "description": "Gretchen Carlson is renewing her push for an AR-15 ban, firing off a series a tweets further criticizing AR-15. Breitbart News reported that Carlson said that AR-15s are not needed to “hunt or kill deer” and suggested they only serve to enable...", "image": "https://web.archive.org/web/20160620202146im_/http://therightists.com/wp-content/uploads/2016/06/091313_GretchenFarewell-150x150.jpg"}, "verifyownership": "b03b12e9fdf4f032d48fc78bfadcdc32", "description": "News, Christian news, christian politics"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}