{"url": "https://web.archive.org/web/20090701202353/http://www.foxnews.com:80/story/0,2933,529026,00.html", "text": "This is a rush transcript from \"On the Record,\" June 24, 2009. This copy may not be in its final form and may be updated.\n\nGRETA VAN SUSTEREN, FOX NEWS HOST: Forty Republican members of Congress are furious at ABC News. They say ABC News is unprofessional and violating the ethics of journalism and slanting the news for President Obama. ABC News has been given all access to the White House, and in a primetime special on ABC News, President Obama will talk about his health care plan. Any problem with that? A group called the Media Fairness Caucus says yes and wrote a letter to ABC News slamming the network.\n\nCongressman Lamar Smith heads the Media Fairness Caucus. He was supposed to be with us live but is busy voting, but he does join us by phone. Congressman, nice to at least hear from you. Tell me, Congressman, what's wrong with this?\n\nREP. LAMAR SMITH - R - TEXAS (VIA TELEPHONE): Very good to be with you. Well, what's wrong with this is, as you just mentioned, ABC devoted all their newscasts today, morning, noon, evening, and then they culminated in a town hall meeting from the White House tonight with a hand-picked audience, and the president had the last word. That really amounts to a day-long informational (SIC). It's not giving the American people the facts. It's not letting them make up their own minds. It's telling them what to think. And it is unprofessional. The code of ethics for journalists says that they have a duty to provide a fair and comprehensive account (INAUDIBLE) issues. Clearly, this is not...\n\nVAN SUSTEREN: Let me ask you -- OK, all right, I haven't seen this code of ethics. Lawyers have a code of professional responsibility, which I'm always quick to point out. Here's the thing. Everything that happened today on ABC is recorded or Tivoed or we have access to it. Now that ABC News has done that, we now know the White House -- we should know the comprehensive view of the White House on health care. Doesn't it instead give all of us an opportunity to go over it with a fine-toothed comb tomorrow to see what we like and what we don't like? Is there any problem with that?\n\nSMITH: No, we should, but the problem is, we only heard one side. Anybody who was watching ABC today...\n\nVAN SUSTEREN: We'll hear it tomorrow. We'll hear it tomorrow. I mean, people are going to pick it apart tomorrow. In some ways, now at least we know what the White House, what the president's doing.\n\nSMITH: We certainly know...\n\nVAN SUSTEREN: Tomorrow we can pick apart.\n\nSMITH: Yes. Well, I hope -- you know, if ABC allows individuals to pick it apart tomorrow, those watching ABC will get both sides. But right now, they've only gotten one side. And it was like...\n\nVAN SUSTEREN: Yes, but...\n\nSMITH: It was like a rigged football game. They had -- the president had home field advantage. ABC was the only referee. The opposing team wasn't allowed on the field. But ABC didn't even allow ads that opposed the president's health care plan to be aired.\n\nVAN SUSTEREN: Well, the ads is a wholly different thing. And I'll agree with you on the ads. But tomorrow, I bet that FOX, CNN, even MSNBC and NBC and CBS -- I bet they will all be critiquing what the president said about health care.\n\nSMITH: Well...\n\nVAN SUSTEREN: And but for this forum tonight -- and it's almost like a direct examination was tonight and now tomorrow, everybody can cross- examine it. And but for today, we wouldn't have that chance.\n\nSMITH: Right. But the problem with that is that the three networks, who have 10 times the number of viewers as FOX, for example -- they have 24 million viewers. FOX has 2.5 million. But the problem is that those three networks have all been given slanted coverage to the president's health care plan. You have ABC -- since January, for example, they interviewed 58 people in favor of the health care plan, only 18 opposed, three to one. They are not presenting both sides. And the American people deserve to get both sides if they're going to be able to make good decisions.\n\nVAN SUSTEREN: All right, one hour on ABC is 44 minutes, taking into account all the -- ABC News -- taking into account all the commercials. Tomorrow, there's going to be -- you know, the 24/7 of all the cables, so I'm not so sure -- and I realize that they have more viewers on broadcast as opposed to cable news, but we have so much more time on it that I'm not -- you know, that I don't know how it'll balance out.\n\nBut I guess -- I guess the other thing is, that -- you know, it's, like, it seems to me that this is an opportunity for all of us, for Americans to now -- to look at it with a fine-toothed comb. And I may be the only one who's not scandalized by it, and frankly, I haven't yet seen it, so I got to take a look at it, so...\n\nSMITH: Well, it's...\n\nVAN SUSTEREN: ... it may even be premature for me to be scandalized anyway.\n\nSMITH: If you'd seen how one-sided it is, you'd be scandalized because it is not representing good journalism. It has not presented both sides. It is not giving the American people the facts. You have a recent Gallup poll, for example, that says on 9 percent of the American people think the news media reports the news accurately and fairly -- 9 percent. So the...\n\nVAN SUSTEREN: Well, that's another -- that's -- that's a whole other issue, but Congressman, maybe -- let's see in 24 hours whether or not everybody has gone over this and -- with a fine-toothed comb. You may be right, but let's at least give it a shot tomorrow, see whether this has been...\n\nSMITH: Well, I...\n\nVAN SUSTEREN: ... dissected.\n\nSMITH: I hope people will take the time to look at the other side. They certainly didn't get it from ABC.\n\nVAN SUSTEREN: Thank you, sir, for joining us.\n\nSMITH: Thank you.\n\nVAN SUSTEREN: Sorry it couldn't be in person because I know you're busy voting. Thank you, sir.\n\nSMITH: All right. Bye-bye.\n\n\n\nContent and Programming Copyright 2009 FOX News Network, LLC. ALL RIGHTS RESERVED. Transcription Copyright 2009 CQ Transcriptions, LLC, which takes sole responsibility for the accuracy of the transcription. ALL RIGHTS RESERVED. No license is granted to the user of this material except for the user's personal or internal use and, in such case, only one copy may be printed, nor shall user use any material for commercial purposes or in any fashion that may infringe upon FOX News Network, LLC'S and CQ Transcriptions, LLC's copyrights or other proprietary rights or interests in the material. This is not a legal transcript for purposes of litigation.", "images": ["https://web.archive.org/web/20090701202353im_/http://media2.foxnews.com/thumbnails/i/070109/063009_greta_jacko_90x70.jpg", "https://web.archive.org/web/20090701202353im_/http://www.foxnews.com/i/mkt/mkt_fnradio.gif", "https://web.archive.org/web/20090701202353im_/http://www.foxnews.com/i/mkt/mkt_fnshop.gif", "https://web.archive.org/web/20090701202353im_/http://www.foxnews.com/i/mkt/mkt_carsdirect.jpg", "https://web.archive.org/web/20090701202353im_/http://www.foxnews.com/images/foxnews_story.gif", "https://web.archive.org/web/20090701202353im_/http://www.foxnews.com/ucat/images/98282_ureport_90.JPG", "https://web.archive.org/web/20090701202353im_/http://media2.foxnews.com/thumbnails/i/070109/063009_greta_barak_90x70.jpg", "https://web.archive.org/web/20090701202353im_/http://www.foxnews.com/i/mkt/mkt_people.gif", "https://web.archive.org/web/20090701202353im_/http://www.foxnews.com/i/mkt/mkt_bankrate.jpg", "https://web.archive.org/web/20090701202353im_/http://www.foxnews.com/images/542053/0_61_320_062409_greta_obama.jpg", "https://web.archive.org/web/20090701202353im_/http://www.foxnews.com/i/new/twitter.jpg", "https://web.archive.org/web/20090701202353im_/http://www.foxnews.com/i/new/fn-header.jpg", "https://web.archive.org/web/20090701202353im_/http://www.foxnews.com/i/new/facebook.jpg", "https://web.archive.org/web/20090701202353im_/http://www.foxnews.com/i/mkt/mkt_freecredit.gif", "https://web.archive.org/web/20090701202353im_/http://www.foxnews.com/i/mkt/mkt_nationwide.gif", "https://web.archive.org/web/20090701202353im_/http://www.foxnews.com/i/new/myspace.jpg", "https://web.archive.org/web/20090701202353im_/http://www.foxnews.com/i/mkt/mkt_protect_my_id.gif", "https://web.archive.org/web/20090701202353im_/http://www.foxnews.com/images/columns/col_head_interviewarchive04.gif", "https://web.archive.org/web/20090701202353im_/http://www.foxnews.com/i/social/comment_bubble.gif", "https://web.archive.org/web/20090701202353im_/http://www.foxnews.com/i/new/feat-shows-blue.gif", "https://web.archive.org/web/20090701202353im_/http://media2.foxnews.com/thumbnails/i/070109/063009_greta_livewire_90x70.jpg", "https://web.archive.org/web/20090701202353im_/http://pix01.revsci.net/E05510/a3/0/0/0/0/0/0/0/0/0/noscript.gif", "https://web.archive.org/web/20090701202353im_/http://www.foxnews.com/i/mkt/mkt_imag.jpg", "https://web.archive.org/web/20090701202353im_/http://www.foxnews.com/i/new/close.jpg", "https://web.archive.org/web/20090701202353im_/http://www.foxnews.com/i/mkt/mkt_31credit.gif"], "top_img": "https://web.archive.org/web/20090701202353im_/http://media2.foxnews.com/thumbnails/i/070109/063009_greta_jacko_90x70.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "An Open Letter to 'All Barack Channel' - Greta Van Susteren", "meta_data": {"description": "Interview: An Open Letter to 'All Barack Channel', 'On the Record' looks at GOP uproar over the air-time ABC gave Obama to present his health care plan - without any input from his opposition.", "keywords": "greta, transcript, abc, president obama, health care, gop, rep. lamar smith, greta, greta van susteren, on the record, on the record with greta", "storyid": 542053, "publish_date": "2009-06-25", "section_name": "On the Record w/ Greta"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}