{"url": "https://www.self.com/story/claire-danes-flying-while-pregnant", "text": "Claire Danes's flight to Los Angeles for her interview on Jimmy Kimmel Live was only the first hoop she had to jump through in order to make the show. Anyone who has flown while pregnant knows that travel has its own set of particular annoyances and complications when \"you're knocked up,\" as Danes put it live on air, and even Emmy award-winning actors aren't immune.\n\nDanes began the interview by explaining that, in order to encourage blood flow to her heart, she's supposed to wear compression stockings (also referred to as \"compression socks\") as often as possible. But she avoids them unless she's traveling because she thinks they're \"dreadful.\"\n\nOn her flight to L.A., she delayed putting the stockings on until it was \"entirely essential,\" which meant trying to squeeze into the extra tight stockings in the \"teeny, tiny bathroom of the plane,\" which resulted in a battle of life and limb that took upwards of \"20 freakin' minutes\" to get through.\n\nAs Danes pointed out in her lesson learned, \"it turns out compression stockings are rather tight\" and she may have been wise to have followed her doctor's suggestion to use talcum powder to help with the process. Thankfully, all turned out well and the Homeland actress now has a funny story that other moms will surely relate to. \"I don't know what they thought I was doing in there,\" said Danes at the end of the story, \"but it was not erotic.\"\n\nDanes was likely referring to the risk for developing blood clots called deep vein thrombosis (DVT), which is why some people wear compression socks while traveling\n\nThese clots can be dangerous and typically start with pain and redness in the legs, according to the Mayo Clinic.\n\nAlthough anyone can get DVT, pregnant women are at a higher risk for developing the blood clots because of the drastic increase in estrogen levels in pregnant women's blood, which, in turn, increases clotting factors, SELF explained previously. And, as Danes hinted, the pressure of the baby may add more pressure on top of the veins in your pelvis, making it harder for your blood to get to your heart and increasing the risk that it will clot.\n\nFlying (or any travel, really) can exacerbate these risks not because of the flying itself, but because you are more likely to be sitting for extended periods of time while on a plane, which creates conditions more favorable to forming blood clots.\n\nSo, if you fly while pregnant, be sure to take laps up and down the aisles periodically and, of course, Danes's loathed compression stocking can also be helpful by keeping blood from pooling within your legs. However, recommendations for your specific situation should only be made by your doctor.\n\nRelated:", "images": ["https://media.self.com/photos/5b118a0f57ff990b50b0f513/4:3/w_2560%2Cc_limit/GettyImages-510740550.jpg", "https://www.self.com/verso/static/self/assets/logo-reverse.22fddcfca2f2de42711a84ec66a5157a9995d8ab.svg", "https://media.self.com/photos/5b11a4992fe34e2beeda48c3/2:1/w_1280,c_limit/clair%2520danes.jpg", "https://www.self.com/verso/static/self/assets/logo-header.64f3bdc15b1f321829f9f30c7853a1469f469d71.svg"], "top_img": "https://media.self.com/photos/5b11a4992fe34e2beeda48c3/2:1/w_1280,c_limit/clair%2520danes.jpg", "keywords": [], "authors": ["Lindsey V Thompson", "Lindsey V Thompso"], "canonical_link": "https://www.self.com/story/claire-danes-flying-while-pregnant", "title": "Claire Danes Hilariously Explains How Complicated Life Is When You're Flying While Pregnant", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Lindsey V Thompson", "copyright": "Copyright (c) Condé Nast 2020", "description": "\"Everything's just a little more complicated when you're knocked up,\" actor Claire Danes said in an interview with Jimmy Kimmel.", "id": "5b11886d2fe34e2beeda48b1", "keywords": "pregnancy & motherhood,snd,claire danes,pregnancy,deep vein thrombosis,news", "news_keywords": "pregnancy & motherhood,snd,claire danes,pregnancy,deep vein thrombosis,news", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5b11886d2fe34e2beeda48b1", "parsely-metadata": "{\"description\":\"\\\"Everything's just a little more complicated when you're knocked up,\\\" actor Claire Danes said in an interview with Jimmy Kimmel.\",\"image-16-9\":\"https://media.self.com/photos/5b118a0f57ff990b50b0f513/16:9/w_1000,c_limit/GettyImages-510740550.jpg\",\"image-1-1\":\"https://media.self.com/photos/5b118a0f57ff990b50b0f513/1:1/w_1000,c_limit/GettyImages-510740550.jpg\"}", "og": {"description": "\"Everything's just a little more complicated when you're knocked up.\"", "image": "https://media.self.com/photos/5b11a4992fe34e2beeda48c3/2:1/w_1280,c_limit/clair%2520danes.jpg", "site_name": "SELF", "title": "Claire Danes Hilariously Explains How Complicated Life Is When You're Flying While Pregnant", "type": "article", "url": "https://www.self.com/story/claire-danes-flying-while-pregnant"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@SELFmagazine", "description": "\"Everything's just a little more complicated when you're knocked up.\"", "domain": "https://www.self.com", "image": {"src": "https://media.self.com/photos/5b11a4992fe34e2beeda48c3/2:1/w_1280,c_limit/clair%2520danes.jpg?mbid=social_retweet"}, "site": "@SELFmagazine", "title": "Claire Danes Hilariously Explains How Complicated Life Is When You're Flying While Pregnant"}, "fb": {"app_id": 169640983205651, "pages": 8908243810}}, "movies": ["https://www.youtube.com/embed/4g3_a72rywQ"], "publish_date": null, "source": "https://www.self.com", "summary": ""}