{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/12/05/stephen-colbert-made-billy-bush-watch-the-access-hollywood-tape-and-it-was-awkward/", "text": "The two had a lot to discuss. As the world knows, Bush lost his NBC “Today” show gig last October after The Washington Post published audio of a 2005 conversation between him and then-“Apprentice” host Donald Trump while they were on a bus to film a segment for “Access Hollywood.” Trump talked about how he liked to just start kissing beautiful women. “When you’re a star, they let you do it. You can do anything,” Trump said, adding, “Grab them by the p‑‑‑y.” Bush laughed throughout the exchange.\n\nAD\n\nAD\n\nBush has been mostly off the grid ever since. However, this week, he kicked off some image rehabilitation with a New York Times op-ed and this appearance on “The Late Show.” Here are the six main takeaways from the interview — besides the fact that when Bush walked out onstage, Colbert’s band played a slow-jam rendition of “Wheels on the Bus.”\n\n1. Bush really, really hates watching that “Access Hollywood” tape.\n\n“If you don’t mind, I’m going to roll the tape,” Colbert said at the beginning of their conversation.\n\nBush was visibly not thrilled. “Can we make a deal that it’s the last time, or no?” he asked.\n\nThey switched topics, and Bush talked and talked — and admitted that he was trying to keep Colbert from playing the video.\n\nAD\n\n“We’re going to air it no matter what,” Colbert assured him, and then played the most-quoted part of the tape. (See above.)\n\nAD\n\n“Okay, what’s your reaction when you hear that even almost a year and a half later?” Colbert asked after the awkward moment was over.\n\n“The first time I ever heard it was three days before it leaked. And so it was like a gut punch,” Bush said. “It’s a gut punch now. It will always be.”\n\n2. Bush is still in disbelief that he lost his “Today” show gig.\n\nBush seemed to alternate between anger and incredulity that he lost the job of a lifetime.\n\n“How do you feel about NBC firing you?” Colbert asked bluntly. “Especially in light of Matt Lauer being fired for allegations of actual sexual impropriety?” (This was not the only time Bush’s former “Today” colleague came up in the conversation.)\n\nAD\n\n“Look, it was a difficult time. I think it was very hot emotionally in the country,” Bush said. “A lot of people were not comfortable with the man who was close to winning the election, and a lot of things happened quickly.” Bush added that his boss stated, months later, that NBC “may have moved a little quickly” in forcing his exit.\n\nAD\n\nMostly, Bush said, he wished he could have addressed his “Today” show audience after everything happened. But he was never allowed back on air.\n\nBush seemed most upset as he talked about Trump winning the election and facing no consequences for the tape.\n\n“Stephen, it’s an unbelievable irony. The very day that he was swearing in as the 45th president of the United States, I was checking in to this soul-searching retreat in St. Helena, California, nine days off the grid,” Bush said. “… It was the beginning of me saying, ‘All right, get up, stop being sorry for yourself, stop worrying about these things. There’s life to live, let’s go, get better — be a better man, be a better person.’ So I passed the television in the office when I was checking in. He’s got the hand up and I’m going into my little cabin to do the work.”\n\nAD\n\nAD\n\nThere was a long pause. “Tough,” Bush said. “Irony.”\n\n3. Bush also cannot believe that Trump has reportedly been telling people that it’s not his voice on the tape.\n\nBush’s New York Times editorial is titled “Yes, Donald Trump, You Said That.” So you can imagine what he thinks of reports that Trump has been privately saying he doesn’t think that it’s his voice on the bus audio.\n\n“You don’t get to say that. Because I was there, and the last 14 months of my life I have been dealing with it,” Bush said. “You dealt with it for 14 minutes and went on to be the president.”\n\nBush said that Trump’s denial really upset him, particularly after he read an article in which multiple women made allegations of sexual misconduct against Trump.\n\nAD\n\nTONIGHT: After his op-ed in the @NYTimes, Billy Bush stops by #LSSC to reveal why he's speaking out now, and to talk about what really happened on that bus. pic.twitter.com/buSWhph3mJ — The Late Show (@colbertlateshow) December 5, 2017\n\n“When he said this, it infuriated me on the personal front, and then I ended up Googling and I read an article with all of these women’s accounts,” Bush said. “… As I read these, I said, ‘Twenty women don’t get together and say, ‘Hey, you know what would be really fun? Let’s take down a powerful guy together. Haha.’ No, they don’t. And I said, ‘Okay, you’re reopening wounds on them, too.’ Enough is enough. Stop playing around with people’s lives.”\n\nAD\n\nColbert also wondered why Trump brought up the subject again. “Him saying that actually brought this particular subject around in conjunction with the cultural moment we’re in now where revelations of sexual abuse, sexual harassment, sexual impropriety are putting new spotlights on the accusations against the president,” Colbert said. “And he stuck — I’m going to say his finger — in this door hinge by denying this. It’s really the dumbest thing he could have done.”\n\n4. Bush attempted to explain why he laughed along with Trump’s vulgar remarks on the bus.\n\nAD\n\nHe regrets it now. But at the time, “The Apprentice” was a massive hit, and shared a parent company with “Access Hollywood.” So a major part of Bush’s job was to bond with Trump. As Bush put it, “Everybody had to sort of kiss the ring a little bit of The Donald because he was making so much money for NBC. ”\n\nAD\n\n“It was 2005, and his ratings were through the roof and he was the big star of NBC. And I sort of equated what he was saying to some kind of, you know, crass standup act, like an Andrew Dice Clay performance,” Bush said. “You figure, well, that’s not Dice when he’s home, he doesn’t actually do those things.”\n\n“But the camera wasn’t on him. Why did it seem like a performance to you?” Colbert asked.\n\nAD\n\n“Because he was just regaling the seven guys on there and doing this, doing his bit,” Bush said. “… If I had thought there was a man detailing a sexual assault strategy to me, I would have called the FBI, not just reported it to my executive producer.”\n\n5. Matt Lauer couldn’t save Bush’s job — yet Bush isn’t mad at him.\n\nBush didn’t have the best start to the “Today” show when he joined in August 2016, as he immediately sparked controversy by defending Ryan Lochte’s fabricated robbery story at the Olympics on-air. Still, as Colbert pointed out, Lauer was an extremely powerful force at “Today” and theoretically could have stepped in to help.\n\nAD\n\n“Matt Lauer controlled that show. He could have protected anybody and he did famously protect people from being fired on that show. Do you wish he would have protected you?” Colbert said.\n\nAD\n\n“We had a conversation about that,” Bush explained. “He told me that he went privately to the bosses and took that line. And I said I appreciated it, and I accepted it and thanked him.”\n\n“You believed he did what he could?” Colbert asked. Bush agreed with that sentiment.\n\n6. Bush says we’re in a cultural moment where “women must be believed” about sexual harassment, and the bus tape might have started it all.\n\n“Women must be believed, and we kind of have to find our way to have the dialogue,” Bush said. “I’m worried that the dialogue isn’t going to be around, because we get on to the next thing, we get on our phones, the next outrage comes. We have to continue it all the way through, and I hope we do that.”\n\nAD\n\n“Interestingly, this particular moment that we’re in hasn’t ended,” Colbert said. “It started with Harvey Weinstein, at least the latest iteration of it, and goes on to this moment.”\n\n“I think,” Bush offered, “the bus ride was the tip of the iceberg.”", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/57f2027b-73ed-448e-b497-38ad3452a54b.png&w=90&h=90", "https://www.washingtonpost.com/resizer/nyoE_fo8-G9GVc7QY4WBMH_Dv7k=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/JLBJF2ELIU545K7ZSSPSNCX5M4.jpg"], "top_img": "https://www.washingtonpost.com/resizer/nyoE_fo8-G9GVc7QY4WBMH_Dv7k=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/JLBJF2ELIU545K7ZSSPSNCX5M4.jpg", "keywords": [], "authors": ["Emily Yahr", "Style Reporter Covering Pop Culture"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/12/05/stephen-colbert-made-billy-bush-watch-the-access-hollywood-tape-and-it-was-awkward/", "title": "Stephen Colbert made Billy Bush watch the ‘Access Hollywood’ tape — and it was awkward", "meta_data": {"description": "Here are the main takeaways from Bush's interview with Colbert — and yes, he's still in disbelief that he lost his \"Today\" show job.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/12/05/stephen-colbert-made-billy-bush-watch-the-access-hollywood-tape-and-it-was-awkward/", "image": "https://www.washingtonpost.com/resizer/nyoE_fo8-G9GVc7QY4WBMH_Dv7k=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/JLBJF2ELIU545K7ZSSPSNCX5M4.jpg", "title": "Stephen Colbert made Billy Bush watch the ‘Access Hollywood’ tape — and it was awkward", "description": "Here are the main takeaways from Bush's interview with Colbert — and yes, he's still in disbelief that he lost his \"Today\" show job."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Stephen Colbert made Billy Bush watch the ‘Access Hollywood’ tape — and it was awkward", "description": "Here are the main takeaways from Bush's interview with Colbert — and yes, he's still in disbelief that he lost his \"Today\" show job."}, "last_updated_date": "2018-02-26T00:24:40.695Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": ["https://www.youtube.com/embed/YvcIeSfaB3c?feature=oembed"], "publish_date": 1512403200.0, "source": "https://www.washingtonpost.com", "summary": ""}