{"url": "https://people.com/tv/will-smith-how-became-fresh-prince-bel-air/", "text": "Will Smith is opening up about how he came to be The Fresh Prince of Bel Air and it wasn’t because a couple of guys who were up to no good started making trouble in his neighborhood.\n\nThe actor made a “Storytime” vlog on his YouTube channel published on Thursday, recounting the tale of how he transformed into the iconic character in a five-minute video and the story is as unconventionally Hollywood as they come.\n\nGet push notifications with news, features and more.\n\nWhile the actor gained riches and more fame following the debut of the show, Smith revealed that the opportunity didn’t arise until after he had found himself in trouble with the IRS.\n\n“Before I was in trouble with Uncle Phil, I was in trouble with Uncle Sam,” Smith explained. “Me and [Jazzy] Jeff had come out with a smash hit. We made a bunch of money, we won a Grammy, album was triple platinum. I had motorcycles and cars. I called the Gucci store in Atlanta, and I was like, ‘Hey, will y’all close it down if I bring my friends?’ And I’m smiling but that’s stupid.”\n\nImage zoom Will Smith Jim Spellman/WireImage\n\n“We released our next album and it was, like, a flop,” Smith said. “It was a tragedy, it went, like, double plastic. I had spent all my money and I didn’t forget but I didn’t pay the IRS. In my mind, I wasn’t trying to avoid taxes, I was just like ‘Ah, damn, they need their money.'”\n\nSmith continued, “The IRS took all that stuff, so I was like, broke, broke, broke. Being famous and broke is a s— combination because you’re still famous and [people] recognize you but they recognize you while you sitting next to them on the bus.”\n\nThe Suicide Squad star recalled his then-girlfriend urging him to pay a visit to the Arsenio Hall Show and told him to hang out and try to meet with other creators in Hollywood in an attempt to turn his career around.\n\n“I went to the Arsenio Hall Show and I met a dude named Benny Medina. Benny Medina is the real-life Fresh Prince of Bel Air,” Smith said. “I met Benny and he pitches me the idea for this show, and I’m like, ‘I’m not an actor.’”\n\nRELATED: Jada Pinkett Smith Says Husband Will Smith ‘Let Me Have It’ for Her Rude Treatment of His Ex\n\nDespite his doubts about acting, Medina introduced Smith to Quincy Jones, who was producing the show with him. In December 1989, Smith went to Jones’ home where he was surrounded by artists, describing the party as something out of The Wiz.\n\n“[Jones] said, ‘Hey, man, I saw your music videos, I love you what’re doing, I love what you’re doing. Tell me what your rap name was again?'”\n\nImage zoom Will Smith in The Fresh Prince of Bel Air Chris Haston/NBCU Photo Bank\n\nSmith said, “They call me the Fresh Prince,” to which Jones said, “‘All right, good, that’s what we’ll call the show.’ And he handed me a screenplay for A Failed Morris Day Pilot.”\n\nJones asked Smith to study the script for a few minutes before having him audition, but the Men in Black actor protested saying he wasn’t ready to audition for the part.\n\nRELATED VIDEO: Jada Pinkett Smith Had ‘No Idea’ Daughter Willow Walked in on Her Parents Having Sex\n\nThe legendary music producer acquiesced, saying Smith could meet him in two weeks for an audition or he “could take 10 minutes right now and you could change your life forever.”\n\n“I was like f— it then. I said yes and I let it rip and I got to the end and everyone’s clapping,” Smith said of his impromptu audition.\n\nWant to keep up on the latest from PEOPLE? Sign up for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\nHis performance impressed those gathered enough that Jones quickly demanded his lawyers draw up a contract for Smith to play the lead in The Fresh Prince of Bel Air.\n\n“He had been drinking, it was obvious,” Smith said, smiling. “So the lawyers go into a limo and they’re drawing up the first deal for The Fresh Prince of Bel Air. Quincy is like popping up at the windows going like, ‘No paralysis, do analysis! No paralysis, do analysis!’ Like how did he make Thriller like this?”\n\n“We took a picture and we signed the basic deal for Fresh Prince and three months later we were shooting the pilot and that’s the story of how I became the Prince of Bel Air,” Smith recalled.\n\nHe added, “The moral of the story is always say yes and I guess listen to your girlfriend.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fwill-smith-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fwill-smith-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fwill-smith-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fwill-smith-1.jpg", "keywords": [], "authors": ["Alexia Fernandez"], "canonical_link": "https://people.com/tv/will-smith-how-became-fresh-prince-bel-air/", "title": "Will Smith Says He Became The Fresh Prince of Bel Air After Getting in Trouble with the IRS", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Movie Celebrities,News,The Fresh Prince of Bel-Air,TV Watch,Will Smith", "news_keywords": "Movie Celebrities,News,The Fresh Prince of Bel-Air,TV Watch,Will Smith", "description": "Will Smith is opening up about how he came to be The Fresh Prince of Bel Air and the story is as unconventionally Hollywood as they come", "og": {"title": "Will Smith Says He Became The Fresh Prince of Bel Air After Getting in Trouble with the IRS", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/will-smith-how-became-fresh-prince-bel-air/", "description": "Will Smith is opening up about how he came to be&nbsp;The Fresh Prince of Bel Air and it wasn’t because a&nbsp;couple of guys who were&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fwill-smith-1.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/will-smith-how-became-fresh-prince-bel-air/", "description": "Will Smith is opening up about how he came to be The Fresh Prince of Bel Air and the story is as unconventionally Hollywood as they come", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fwill-smith-1.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/will-smith-how-became-fresh-prince-bel-air/", "title": "Will Smith Says He Became The Fresh Prince of Bel Air After Getting in Trouble with the IRS", "description": "Will Smith is opening up about how he came to be The Fresh Prince of Bel Air and the story is as unconventionally Hollywood as they come", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Fwill-smith-1.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": ["https://www.youtube.com/embed/y_WoOYybCro"], "publish_date": null, "source": "https://people.com", "summary": ""}