{"url": "https://www.racked.com/2017/10/31/16571754/stranger-things-2-costumes", "text": "Racked is no longer publishing. Thank you to everyone who read our work over the years. The archives will remain available here; for new stories, head over to Vox.com, where our staff is covering consumer culture for The Goods by Vox. You can also see what we’re up to by signing up here.\n\nWarning: Major spoilers for both seasons of Stranger Things below! Proceed at your own risk.\n\nIf you spent last weekend binge-watching Stranger Things 2 instead of going to Halloween parties, you’re not alone. Buzz around the second installment of Netflix’s nostalgic sci-fi hit has been building steadily since last summer, leading some to question whether season 2 could possibly live up to the hype. But judging by the new episodes’ critical acclaim and record-breaking social media impact, it seems the Duffer brothers have done it again — and that includes the costumes.\n\n“We definitely felt the pressure to make sure whatever we did was up to par,” says costume designer Kim Wilcox, who was tasked with taking over the sartorial world built by Kimberly Adams-Galligan and Malgosia Turzanska in season 1. Her first order of business? Brightening up the show’s wardrobe a bit.\n\n“I wanted to infuse more of the colors of the early ’80s,” she says, “so while we kept a lot of that earthy palette — the tans and browns and blues — we also added in some pastels and slightly poppier colors. The tones are a little happier-looking.”\n\nEven though the events of Stranger Things 2 are, for the most part, anything but happy. Below, Wilcox discusses Eleven’s Madonna-inspired punk makeover, Max’s California skater-girl style, the joys of dressing Bob, and much more.\n\nWhat was your biggest costume challenge heading into Stranger Things 2?\n\nFiguring out what Eleven would wear after the pink dress was something that the Duffers and I spent a lot of time thinking about. It’s such an iconic look that Kimberly created, and you see it in flashbacks throughout season 2.\n\nWhen we first find her in Hopper’s (David Harbour) cabin, she’s watching television — [both] to learn the language and to learn about culture outside of the lab. She hasn’t been a normal child at all; her exposure to the world is through commercials and soaps. So at first, we were like, “Is she into the classic ’80s girly-girl looks? Would she wear something that felt really feminine?” But when we tried it on, it just felt forced.\n\n[So I started thinking,] how would she have gotten her clothes? In my head, Hopper had been giving her clothes he already had in boxes in his cabin, and then maybe making a run to the next county to go to a thrift store and buy stuff for a boy, as a disguise. When we put all that together, it just made more sense to us. So that’s why Eleven looks the way she does for much of the season; nothing really fits well.\n\nIn episode 7, “The Lost Sister,” she gets a major makeover, though. How did you settle on the look for “punk Eleven?”\n\nWell, she’s found this new group of people, and for the first time she can be open about her powers. We wanted her to become part of the gang, to absorb part of that look, to be this rougher person. So half of her costume is still made up of things she would’ve brought with her — her famous Converse, her socks, her jeans — but we felt that the top half would’ve been borrowed from the others, and that it’d be fun to combine a torn T-shirt with a tweedier element.\n\nI was looking back to pictures of punks in the late ’70s and early ’80s, of photos of Siouxsie Sioux and Madonna in blazers with rolled-up sleeves. Madonna actually stole a lot of her looks from punk and made them her own; I remember going to thrift stores and buying 1960s blazers, rolling the sleeves and popping the collars. You’d put a bandana in your hair, and all of a sudden, you were Madonna!\n\nI was thinking that the jacket might’ve been something they’d found in a warehouse, or stolen from somebody, and then gave to Eleven. The shoulders on the jacket give Millie a much bigger silhouette, too, and for this moment where she’s becoming a more powerful person, it felt appropriate that you’d see that in her silhouette. And wearing a bandana tied around your arm or your ankle as a badge was very popular at that time.\n\nIs that blazer a vintage piece?\n\nWe knew we might need multiples, so we couldn’t use vintage. That’s the thing about working with vintage: You can find the perfect piece, but on a series like this where there’s a lot of action — and people are growing! — it gets really tricky. It’s very, very hard to find multiples of vintage clothing.\n\nNancy Wheeler’s amazing sweaters have to be vintage though, right? If not, I must know where to get them!\n\nUnfortunately, those are mostly vintage one-offs that we were lucky enough to either rent or buy. But we actually created the green turtleneck she wears for a large portion of season 2 based off of a vintage piece. We were very lucky to find a similar fabric, because we needed about six multiples of that sweater. We made a lot of her clothes for this season.\n\nIt was nice to take Nancy from skirts to jeans. In season 1, she was very prim and proper; now, she’s trying to keep up this façade, and it’s just not working for her! The Duffers and I said that she’d probably try to keep up her old look until the party scene — that’s when she kind of loses it, when her relationship with Steve starts to unravel.\n\nSpeaking of the Halloween party episode, what was it like designing costumes for all those guests?\n\nThere were about 100 people at that high school party, so it was a feat! Plus we had to do costumes for all the younger trick-or-treaters, too. But it was so much fun to look back at the movies and music from that time and say, okay, we need to make a Madonna, we need to make a Terminator... I think there’s a Michael Jackson somewhere in that crowd, too! My crew was really delighted to be able to get crafty and have a little fun.\n\nLet’s switch gears and talk about Billy (Dacre Montgomery), because his look is incredible. What — or, rather, who — inspired it?\n\nWith Billy, I wanted to hark back to classic Americana. He’s into hot rods, he drives a Camaro, he’s dangerous — so how do you show that [through clothing]? I was thinking about Rebel Without a Cause, Johnny Depp in the ’80s, and Rob Lowe, who was a huge heartthrob at the time.\n\nThat denim-on-denim look can be so sexy; these days, if you don’t do it right, it looks a little silly, but if it’s weathered and fits you perfectly, it can be wonderfully masculine. And the earring is something that Dacre was really adamant about; the idea for that came from this old photo of Rob Lowe that our hair designer had found and was using as inspiration for his mullet. I just love the moment when the Camaro first pulls out, his boot comes out of the car and hits the ground, and all the girls are staring. It’s so ’80s!\n\nHis jeans must’ve been tailored to within an inch of their life...\n\nActually, they weren’t tailored at all! They’re vintage Levi’s from 1979, very difficult to find. We actually only had one pair for most of the season, and we were terrified they were going to rip. Because, you know, Billy gets into some stuff! But towards the end of the season, I got so lucky: I was looking on eBay and Etsy — we get a lot of our clothes online — and I found one more pair! They came, and they fit like a glove. I couldn’t believe it.\n\nHow about Billy’s skateboarding stepsister, Max (Sadie Sink)? I loved her colorful track jackets.\n\nWith Max, I was thinking about what it was like to shop for clothes as a young woman in the early ’80s. Colors weren’t really divided by gender as much [back then]; it wasn’t this world of pink we’re living in now. I wanted Max to be someone who is an outsider, who’s her own person, who chooses her own clothes and goes for what she likes. She doesn’t fit into a nice little box.\n\nI actually grew up in a beach town myself, and the surfers and skateboarders I knew were really into Hang Ten and Ocean Pacific (Op). So we were riffing off of those brands; the windsurfer sweatshirt we created for her is actually inspired by an Op one we found on Etsy. It’s nice to have someone who can give the boys a run for their money. She’s so much cooler than they are!\n\nWho was your absolute favorite character to dress this season?\n\nI have to say, working with Sean Astin was just a dream. And Bob is our Barb this season! He works at RadioShack and is just this simple, very smart guy, and a wonderful partner for our hero, Joyce.\n\nI pulled up all these old photos of actual RadioShack employees [as inspiration]. They didn’t really wear uniforms, usually just a suit or a sport coat and slacks. And a lot of polyester! So that boring brown-on-tan [look] — we were just like, “this is it.” His jeans are so ’70s, too. Bob definitely hasn’t changed his style in a very long time. [Laughs]\n\nBob went all out with his Halloween costume, too; you get the feeling that he probably did that kind of thing every year. And [Sean] loved his vampire makeup and teeth. It was really fun to play with the campiness of that, not to mention working with someone who was in The Goonies. I mean, it’s the dream!\n\nStranger Things is a huge hit in the fashion world: Topshop has a collection dedicated to the show, Louis Vuitton made a Stranger Things T-shirt, and Millie Bobby Brown is a muse for Calvin Klein. What’s it like seeing that sort of response?\n\nIt’s wild! And sort of funny, too, because the clothes are very true to what people actually wore at the time. It’s stuff that fashion wouldn’t have considered fashion back then!\n\nThe fan base is just so vast; people have really latched on to these characters and their wonderfully human, emotional relationships. Because they’re real! You can remember yourself having friends like this and having those moments where you just needed someone to sit down and talk you through a problem, like Mike (Finn Wolfhard) does with Will.\n\nI also think that something about the ’80s is especially appealing right now, because life is really difficult for a lot of people. Our country is at odds. But in the world of Stranger Things, things seem a little bit simpler. There’s hope, even though the characters are going through a dark time. That’s the thing about Stranger Things: It reminds you of how fun ’80s movies were, but it’s also there to hold your hand.\n\nAll episodes of Stranger Things 2 are now streaming on Netflix.", "images": ["https://cdn.vox-cdn.com/thumbor/LxvkXWdbppQTORIEqphI2JPZYUc=/0x0:6720x4480/1200x0/filters:focal(0x0:6720x4480):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9569965/stranger_things_eleven.jpg", "https://cdn.vox-cdn.com/thumbor/t3UH9XW4eAb6PcXF8EjFtwaFPZY=/0x0:8000x3720/1200x0/filters:focal(0x0:8000x3720):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9570135/stranger_things_kids.jpeg", "https://cdn.vox-cdn.com/thumbor/YLIcY3uepCLdCBD0hyphy0R8MtQ=/0x0:6720x4480/1200x0/filters:focal(0x0:6720x4480):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9570343/stranger_things_bob_joyce.jpg", "https://cdn.vox-cdn.com/thumbor/E8los3wFfL3Eh7RAEfMjiX7NhME=/0x0:2000x1333/1200x0/filters:focal(0x0:2000x1333):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9570189/stranger_things_eleven_makeover.jpg", "https://cdn.vox-cdn.com/thumbor/8p3hghfHXshl_ti6MOPoOpgbMJM=/0x399:2768x1848/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9571251/stranger_things_.jpg", "https://cdn.vox-cdn.com/thumbor/0bBtQ2LQcAt2WKzTJ37SWB2Nwu8=/0x0:8000x3720/1200x0/filters:focal(0x0:8000x3720):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9570175/stranger_things_nancy_jonathan.jpeg", "https://cdn.vox-cdn.com/thumbor/ivsDj8JdzUCm9inMKOJByWHQU80=/0x390:2768x1848/1200x675/filters:focal(1170x972:1612x1414)/cdn.vox-cdn.com/uploads/chorus_image/image/57401877/stranger_things_.0.jpg", "https://cdn.vox-cdn.com/thumbor/coCU1K5QIM0Y_sUGxzp4ZHvzsq4=/0x0:8000x3720/1200x0/filters:focal(0x0:8000x3720):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9570149/stranger_things_billy.jpeg"], "top_img": "https://cdn.vox-cdn.com/thumbor/8p3hghfHXshl_ti6MOPoOpgbMJM=/0x399:2768x1848/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9571251/stranger_things_.jpg", "keywords": [], "authors": ["Elana Fishman", "Oct"], "canonical_link": "https://www.racked.com/2017/10/31/16571754/stranger-things-2-costumes", "title": "All About Eleven’s’ ‘Stranger Things 2’ Makeover, From the Show’s Costume Designer", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Racked", "article": {"publisher": "https://www.facebook.com/rackednational", "published_time": "2017-10-31T10:47:02-04:00", "modified_time": "2017-10-31T10:47:02-04:00"}, "author": "Elana Fishman", "style-tools": "https://www.racked.com/style/community/522/0d59761c475a67bd70b8e919399b75c2/tools.css", "msvalidate.01": "D385D0326A3AE144205C298DB34B4E94", "description": "\"I was looking back to photos of Siouxsie Sioux and Madonna...\"", "og": {"description": "\"I was looking back to photos of Siouxsie Sioux and Madonna...\"", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/8p3hghfHXshl_ti6MOPoOpgbMJM=/0x399:2768x1848/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9571251/stranger_things_.jpg", "alt": "Millie Bobby Brown as Eleven in Stranger Things 2.", "height": 630, "width": 1200}, "site_name": "Racked", "title": "The Story Behind Eleven’s ‘Stranger Things 2’ Makeover", "type": "article", "url": "https://www.racked.com/2017/10/31/16571754/stranger-things-2-costumes"}, "fb": {"app_id": 549923288395304}, "twitter": {"card": "summary_large_image", "url": "https://www.racked.com/2017/10/31/16571754/stranger-things-2-costumes", "title": "The Story Behind Eleven’s ‘Stranger Things 2’ Makeover", "description": "\"I was looking back to photos of Siouxsie Sioux and Madonna...\"", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/8p3hghfHXshl_ti6MOPoOpgbMJM=/0x399:2768x1848/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9571251/stranger_things_.jpg", "alt": "Millie Bobby Brown as Eleven in Stranger Things 2."}, "site": "Racked"}, "sailthru.title": "How Eleven’s Bitchin’ ‘Stranger Things 2’ Makeover Came Together", "sailthru.tags": "general,racked,front-page,shopping,entertainment", "sailthru.description": "\"I was looking back to photos of Siouxsie Sioux and Madonna...\"", "sailthru.date": "2017-10-31T10:47:02-04:00", "sailthru.image.full": "https://cdn.vox-cdn.com/thumbor/-OoLe2LsqXXEnhjwefCQ2gyarHc=/95x390:2687x1848/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/57401875/stranger_things_.0.jpg", "sailthru.image.thumb": "https://cdn.vox-cdn.com/thumbor/g8YaQFkJmzBLwCuYD1eTYwml8nU=/662x390:2120x1848/200x200/cdn.vox-cdn.com/uploads/chorus_image/image/57401875/stranger_things_.0.jpg", "msapplication-TileImage": "https://cdn.vox-cdn.com/uploads/chorus_asset/file/10131605/144x144.0.png", "msapplication-TileColor": "#FF0080", "outbrainsection": "shopping"}, "movies": [], "publish_date": 1509379200.0, "source": "https://www.racked.com", "summary": ""}