{"url": "https://www.theverge.com/tldr/2017/8/18/16169342/taylor-swift-social-media-black-out-reddit-theories", "text": "Around 11AM ET, all traces of Taylor Swift disappeared from Twitter, Instagram, Facebook, Tumblr, and her official website.\n\nShe’s been relatively quiet on social media all year, and last fall she broke with her tradition of releasing an album every other October. So, fans and amateur sleuths started digging through the source code of her website within minutes, looking for clues as to what was going on. Some guessed new music; some guessed a hack. Then Tumblr spat out hundreds of screenshots of the same dubious-looking DirecTV Now listing of a Swift appearance on tomorrow’s Good Morning America. There’s very little evidence to support anyone’s theory, but it’s fun to spend an otherwise-sleepy Friday afternoon trying to sort the riddle out.\n\nAnd though all of the evidence we’re going to see today is definitely baloney, you can see why fans would get dragged into this rabbit hole. The best thing about a new Taylor Swift album is the fact that she leaves hidden messages in all of the liner notes, often with clues about the subject of each song. This recurring treat is gossipy, salacious, and satisfying like a crossword puzzle — essentially the modus operandi of Swift’s entire career and public persona.\n\nTheory 1: She got hacked\n\nWhile celebrities often wipe their social media accounts before big announcements, it’s strange that Swift’s Instagram and Twitter both show that she now follows no other accounts. That kind of purge isn’t common. Also, this guy says he hacked her:\n\nHello @taylorswift #taylorswift A post shared by Turn on post notifications™ (@taariqxo) on Aug 18, 2017 at 9:20am PDT\n\nIt’s very unlikely, given that this post went up about two hours into the online frenzy. Plus, that wouldn’t explain the absence on any other platform, or her site. Swift’s team is notoriously web savvy, pulling down the slightest copyright infringement in minutes and proactively buying up every domain name that could conceivably host porn about her. A security screw-up big enough to take down her entire web presence seems unlikely.\n\nGiven the non-evidence, the possibility of a hack made me nervous for only one second, but I’ve reached out to Swift’s record label and will update if I hear back.\n\nTheory 2: She’s announcing a new album\n\nOn top of all the posts going missing, Swift’s Tumblr theme has changed, from a peachy-pink background with white type to all black. That move has some Tumblr fans pretty worked up, and the hashtag #T6 (for her theoretical sixth album) trending.\n\nIt’s not a ridiculous conclusion. Her website has also gone dark, as it did before she revamped it in 2012 preceding the release of Red, and again in 2014 before the announcement of 1989. “Shake it Off,” the lead single of that album, was announced three years ago today, and Swift has a habit of celebrating minor anniversaries and milestones in showy ways. Earlier this summer, she put her entire discography on Spotify to celebrate 1989 selling 10 million copies worldwide.\n\nOnce the idea of new music was floated, Reddit sleuths claimed to have found support for it in the source code of her site. With some finagling, they pulled out a lyric from “Shake it Off.” It’s unclear why Swift would promote a new album with an old song lyric, but it’s also unclear why the sun refused to come up this morning in New York and it has been raining all day with no reprieve.\n\nSo the name of Taylor's new single is called \"That's What They Don't See\" #TS6IsComing pic.twitter.com/PTvmwNtWz9 — . (@britsjournals) August 18, 2017\n\nAnother fan claimed to have found a message reading “I’ve got a blank space” in the same source code.\n\nThere's a JS script on Taylor Swift's website making the background black - \"ivegotablankspace.\" #TS6IsComing pic.twitter.com/U5jbmVEq1H — Pop Crave (@PopCrave) August 18, 2017\n\nThe Verge was unable to find either of these things, but I think we can all agree that it is better to be exhilarated for a fraction of a second and disappointed for the rest of your life than it is to feel nothing.\n\nFinally, Reddit user sigsigsignify suggested an even more obtuse message from Swift:\n\n“I think this is by design. She deleted every tweet she sent/retweeted after September 27th, 2015. I think she's hinting at September 27th the release date, 20:15 the drop time.\"\n\nAnything is possible.\n\nTheory 3: She’s performing with Katy Perry at the VMAs\n\nThe popular Twitter account Pop Crave tweeted, then deleted, a screenshot appearing to show that Swift’s Twitter account was suddenly following Katy Perry’s. Even with the tweet taken down, fans interpreted that as an end to the years-long tabloid-mediated beef between them. Two years ago, Swift settled a controversial spat with Nicki Minaj with a surprise collaborative performance at MTV’s Video Music Awards. The weirdest music awards show of the year, and the tackiest, loudest live event of August, the VMAs are coming up again this Sunday, with Katy Perry set to host.\n\nBBC UK is reporting that #KatyPerry & #TaylorSwift may have a surprise performance at the 2017 #VMAs on the 27th!! RT if you hope it's true! pic.twitter.com/vBERfTfXnx — Fresh 102.7 (@Fresh1027NY) August 16, 2017\n\nIt’d be an old trick, but who says drama has to be new and innovative every time? I think we can all agree that it is better to watch the “I’ll Take a Pinot Grigio” episode of Vanderpump Rules 100 times than it is to watch it only one time.\n\nIt would be a classic Swift move to try to upstage the new episode of Game of Thrones. But then again, would it be more of a classic Swift move to wait another day and time whatever she may or may not be planning to coincide with Monday’s solar eclipse? That’s one theory we don’t need to go into, because I made it up right now based on no evidence.\n\nTheory 4: Taylor Swift is done with us\n\nFrom Reddit user Sansabarnaby94:\n\n“what makes you think this means a new album?? maybe she just wants to quit forever??”\n\nLet’s hope not. This wasn’t the first boring Friday afternoon in history and it won’t be the last. We need the antics of celebrities and the thrill of harmless conspiracy theory to keep our blood pumping.\n\nSo here’s a heartfelt thank you to the quiet queen of pop for stirring the pot and blessing us with a few hours of distraction. I don’t know if you did this on purpose but based on all historical evidence I am going to guess... yes.", "images": ["https://cdn0.vox-cdn.com/thumbor/Vk0ScNVbXhUpSYdBMSWFQT-FXjw=/41x0:1854x949/fit-in/1200x630/cdn2.vox-cdn.com/uploads/chorus_asset/file/6666551/Screen_Shot_2016-06-17_at_11.28.29_AM.0.png", "https://cdn.vox-cdn.com/uploads/chorus_image/image/50858597/tldr-logo.1473954443.png"], "top_img": "https://cdn0.vox-cdn.com/thumbor/Vk0ScNVbXhUpSYdBMSWFQT-FXjw=/41x0:1854x949/fit-in/1200x630/cdn2.vox-cdn.com/uploads/chorus_asset/file/6666551/Screen_Shot_2016-06-17_at_11.28.29_AM.0.png", "keywords": [], "authors": ["Kaitlyn Tiffany", "Aug"], "canonical_link": "https://www.theverge.com/tldr/2017/8/18/16169342/taylor-swift-social-media-black-out-reddit-theories", "title": "Taylor Swift’s mysterious social media disappearance prompts a madcap web scavenger hunt", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Verge", "article": {"publisher": "http://www.facebook.com/verge", "author": "https://www.facebook.com/kaitlyn.tiffany.9", "published_time": "2017-08-18T15:11:05-04:00", "modified_time": "2017-08-18T15:11:05-04:00"}, "author": "Kaitlyn Tiffany", "style-tools": "https://www.theverge.com/style/community/372/e8584abde1fc118cbb44d8e68e9902bc/tools.css", "google-site-verification": "IucFf_TKtbFFH8_YeFyEteQIwYPdANM1R46_U9DpAr4", "msvalidate.01": "D385D0326A3AE144205C298DB34B4E94", "ahrefs-site-verification": "1e57a609922037a3fbdc1c22efd7334113f174f15608f37e1b8538a7b4ce64c3", "description": "Reddit is all over it, of course", "og": {"description": "Reddit is all over it, of course", "image": {"identifier": "https://cdn0.vox-cdn.com/thumbor/Vk0ScNVbXhUpSYdBMSWFQT-FXjw=/41x0:1854x949/fit-in/1200x630/cdn2.vox-cdn.com/uploads/chorus_asset/file/6666551/Screen_Shot_2016-06-17_at_11.28.29_AM.0.png", "alt": "swift illuminati", "height": 630, "width": 1200}, "site_name": "The Verge", "title": "Taylor Swift’s mysterious social media disappearance prompts a madcap web scavenger hunt", "type": "article", "url": "https://www.theverge.com/tldr/2017/8/18/16169342/taylor-swift-social-media-black-out-reddit-theories"}, "fb": {"app_id": 549923288395304}, "twitter": {"card": "summary_large_image", "url": "https://www.theverge.com/tldr/2017/8/18/16169342/taylor-swift-social-media-black-out-reddit-theories", "title": "Taylor Swift’s mysterious social media disappearance prompts a madcap web scavenger hunt", "description": "Reddit is all over it, of course", "image": {"identifier": "https://cdn0.vox-cdn.com/thumbor/Vk0ScNVbXhUpSYdBMSWFQT-FXjw=/41x0:1854x949/fit-in/1200x630/cdn2.vox-cdn.com/uploads/chorus_asset/file/6666551/Screen_Shot_2016-06-17_at_11.28.29_AM.0.png", "alt": "swift illuminati"}, "site": "verge"}, "sailthru.title": "Taylor Swift’s mysterious social media disappearance prompts a madcap web scavenger hunt", "sailthru.tags": "general,the-verge,front-page,web,tldr,entertainment,music,culture", "sailthru.description": "Reddit is all over it, of course", "sailthru.date": "2017-08-18T15:11:05-04:00", "sailthru.image.full": "https://cdn.vox-cdn.com/thumbor/OW9p-NTyuRSXlVGenCmr-kz8WhI=/2x0:599x336/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/56261439/eyes2.0.0.gif", "sailthru.image.thumb": "https://cdn.vox-cdn.com/thumbor/PmmVxGb5KSKg3RyH2JHBPFe_UrM=/132x0:468x336/200x200/cdn.vox-cdn.com/uploads/chorus_image/image/56261439/eyes2.0.0.gif", "msapplication-TileImage": "https://cdn.vox-cdn.com/uploads/chorus_asset/file/7396113/221a67c8-a10f-11e6-8fae-983107008690.0.png", "msapplication-TileColor": "#393092", "outbrainsection": "culture"}, "movies": [], "publish_date": 1502985600.0, "source": "https://www.theverge.com", "summary": ""}