{"url": "https://en.wikipedia.org/wiki/Downton_Abbey_(film)", "text": "Historical drama film directed by Michael Engler\n\nDownton Abbey is a 2019 historical drama film written by Julian Fellowes, creator and writer of the television series of the same name,[7] produced by Gareth Neame, Liz Trubridge and Fellowes, and directed by Michael Engler. The film is a Carnival Films production, with Focus Features and Universal Pictures International distributing[8] and continues the storyline from the series, with much of the original cast returning.[9] The film, set in 1927, depicts a visit by the King and Queen to the Crawley family's English country house in the Yorkshire countryside. As the Royal staff descend on Downton, an assassin has also arrived and attempts to kill the monarch. The family and servants are pitted against the royal entourage, including the Queen's lady-in-waiting, who has fallen out with the Crawleys, especially the Dowager Countess, over an inheritance issue.\n\nGareth Neame and Fellowes started planning a feature adaptation in 2016, shortly after the series ended. It was officially confirmed in July 2018 and filming began later that month, lasting through November. The film was released in the United Kingdom on 13 September 2019, and in the United States on 20 September 2019. It received generally positive reviews from critics and grossed $192 million worldwide.\n\nPlot [ edit ]\n\nIn 1927, about a year and a half after the TV series ended. Buckingham Palace informs Robert and Cora Crawley, the Earl and Countess of Grantham, that King George V and Queen Mary will visit Downton Abbey during a royal tour through Yorkshire. Violet Crawley, Dowager Countess of Grantham, is perturbed that Maud, Lady Bagshaw, Queen Mary's lady-in-waiting, is included in the tour. Robert is Maud's cousin and closest relative, and the two families have long disputed who should inherit Maud's estate.\n\nThe royal household staff arrive, including Mr Wilson, the Royal Page of the Backstairs; Mrs Webb, the Royal Housekeeper; Miss Lawton, the Queen's Royal Dresser; Monsieur Courbet, the Royal Chef; and Richard Ellis, the King's Royal Dresser. All but Ellis are dismissive and arrogant to the Downton servants. Upstairs, eldest Crawley daughter Lady Mary Talbot, the estate manager, constantly worries about keeping Downton afloat in a fast-changing world. Believing Mr Barrow cannot manage a royal visit, Mary asks Mr Carson, Downton's retired butler, to temporarily resume his duties. Barrow, strongly protesting, steps aside.\n\nMajor Chetwode arrives in Downton Village seeking out the Granthams' Irish son-in-law, Tom Branson. Tom assumes Chetwode is a detective assessing security for the royal visit.\n\nThe royal entourage has completely displaced the Downton household. Meanwhile, Tom and Lucy Smith, Lady Maud's maid, form a mutual attraction. Bertie and Edith Pelham, the Marquess and Marchioness of Hexham, also arrive at Downton. The King asks Bertie to accompany the Prince of Wales on a three-month African tour. The news distresses Edith, the younger Crawley daughter, who tells Bertie she is pregnant and is due just as Bertie would depart. Prior to the royal parade starting through Downton Village, Chetwode stations himself near where the King is awaiting the Royal Artillery, unaware that Tom has grown suspicious. As Chetwode aims a pistol at King George, Tom tackles Chetwode, pinning him to the ground. The real royal detectives apprehend Chetwode, an Irish Republican sympathizer who erroneously believed Tom was an ally.\n\nAfter the parade, Tom encounters a sobbing woman in the garden at Downton, unaware she is Princess Mary. He initiates a conversation which inspires the Princess to remain with her husband. Meanwhile, Anna discovers Miss Lawton is stealing small objects from Downton Abbey. She demands their return, then blackmails Lawton into altering an over-sized ballgown to fit Lady Edith after the wrong dress was mistakenly delivered to Downton.\n\nAnna and John Bates unite the staff into retaking control downstairs to defend Downton's honour. Barrow and Mr Ellis trick some royal household staff into returning to London. Anna slips a strong sleeping aid into Courbet's tea, and Mr Wilson is \"accidentally\" locked inside his room, allowing Mrs Patmore and Daisy to cook the dinner, and Mr Carson and the Downton footmen to wait at table. When the King praises the revised menu, Molesley impulsively blurts out that the Downton staff prepared the meal and are serving it. Robert apologises for Molesley's inappropriate outburst, but the Queen says they are accustomed to people behaving strangely around them.\n\nThat same evening, Barrow and Ellis go to York. While Ellis visits his parents, Barrow waits at a local pub. A man there invites Barrow to a hidden gay nightclub. Shortly after Barrow arrives, police raid the club. Ellis, who is secretly gay, discovers what happened and uses his royal connection to secure Barrow's release. Afterwards, the two men develop a bond, indicating they will meet again.\n\nBack at Downton, as the inheritance conflict escalates, Isobel, Lady Merton, surmises correctly that Lucy is Maud's secret illegitimate daughter, which is the reason she is Maud's heir. She tells Maud she must inform Violet. The next morning, assistant cook Daisy, who doubted if footman Andy was the right man for her, realizes she does love him and begins planning their wedding. Henry Talbot, Mary's husband, returns from abroad in time to accompany the family to Harewood House with the royal party.\n\nDuring the ball at Harewood, Princess Mary informs her parents that Tom inspired her to save her marriage, prompting the King to personally thank him. Also, the Queen has persuaded the King to release Bertie from the imminent tour. Maud tells Violet about Lucy. Violet does not approve but understands, and immediately schemes to unite the two households through Lucy and Tom when told they plan to write to one another. Mary privately queries her grandmother regarding her recent trip to London. Violet confides that medical tests reveal she may die soon, but she assures a distraught Mary that Downton's legacy is safe in her hands. Tom later seeks out Lucy on the terrace and dances with her.\n\nMr Carson and Mrs Hughes ponder Downton's future in the modern era. Carson asserts it will stand for another hundred years with the Crawley family still in residence.\n\nCast [ edit ]\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nThe original television series, Downton Abbey, ended in 2015, after 52 episodes[10][11][12] with its final episode set at New Year's Eve, 1925.[13] In April 2016, it was revealed that a film adaptation was being considered,[14] with Julian Fellowes working on an outline plot.[15] A script was distributed to original cast members early in 2017.[16][17]\n\nOn 13 July 2018, the producers confirmed that a feature-length film would be made,[18] with production commencing mid-2018.[19][12] The script was written by Fellowes. The producers are Gareth Neame, Liz Trubridge and Fellowes.[20] The film is distributed by Focus Features and Universal Pictures International.[21] In late August 2018, it was reported that Brian Percival had stepped down as director and Michael Engler took on this job. Percival, in addition to Nigel Marchant, would be an executive producer.[22][23]\n\nThe plot of the film is based on an actual trip by the British royals to Wentworth Woodhouse in 1912 in order to demonstrate the importance of the monarchy. The estate itself was used as part of the shooting locations because of the story's link to that history.[24]\n\nCasting [ edit ]\n\nOriginal cast members including Hugh Bonneville, Elizabeth McGovern, Michelle Dockery, Laura Carmichael and Maggie Smith, were confirmed to return as their characters from the series,[20][25] with Joanne Froggatt confirming her involvement in a separate announcement.[26] Lily James, who played Lady Rose MacClare, stated she would not be reprising her role for the film,[27][28] as did Ed Speleers who played footman Jimmy Kent.[29]\n\nAn August 2018 announcement indicated that newcomers Imelda Staunton, Geraldine James, Tuppence Middleton, Simon Jones, David Haig, Kate Phillips, and Stephen Campbell Moore would be among the cast of the film.[23] The producers told the news media that Simon Jones and Geraldine James play the King and Queen, respectively (although not shown in the trailer), while David Haig appears as the King's butler.[30]\n\nIn September 2018, it was confirmed that Matthew Goode, who played Lady Mary's husband Henry Talbot in the final series, appears only briefly due to other commitments,[31] while Jim Carter, Brendan Coyle, Kevin Doyle, Harry Hadden-Paton, Rob James-Collier, Allen Leech, Phyllis Logan, Sophie McShera, Lesley Nicol and Penelope Wilton were confirmed to be reprising their respective roles, with Max Brown joining in a new, undisclosed role.[32][33]\n\nCostumes [ edit ]\n\nCostumes were designed by Anna Mary Scott Robbins working with John Bright of the costume company COSPROP in London, which specializes in historic, period costumes.[34] The company has some of Queen Mary's real wardrobe, studied for details of construction.[34] Geraldine James' Queen Mary costume was constructed using material from one of the Queen's actual dresses.[34] During the Ball scene, both Michelle Dockery and Elizabeth McGovern wore vintage dresses that were embellished with additional work. Dockery's beaded French gown had beads lengthened to the floor by hand. While Michelle Dockery wears Swarovski crystals in her tiara, Maggie Smith's is a 19th-century platinum piece[34] from Bentley & Skinner of Piccadilly jewellers by Royal appointment[35] with 16.5 carats of diamonds. Smith's ball gown was found in a vintage shop in Paris and dye was used to alter the turquoise color to lilac.[34]\n\nFilming [ edit ]\n\nPrincipal photography started in London in late August 2018.[36][23] By 20 September, some filming was under way at Highclere Castle, Hampshire, which had been the main location for the television series.[37][38] Also in September, filming was under way in Lacock, Wiltshire, with Dame Maggie Smith, Hugh Bonneville, Elizabeth McGovern and Michelle Dockery as well as two new cast members, Imelda Staunton (wife of Jim Carter) and Geraldine James; scenes shot in Lacock included a celebration with horses from the Royal Artillery.[39] Exterior scenes set in York were filmed on location at Beamish Museum, complete with operational trams.[40] The Heritage Railways scenes were filmed on the North Yorkshire Moors Railway with Pickering terminus representing Kings Cross. The Royal Mail Sorting Office Coach was borrowed from the Great Central Railway at Loughborough. Filming concluded in November 2018.[41]\n\nSoundtrack [ edit ]\n\nDownton Abbey is the film's soundtrack album and musical score album of the same name, composed by John Lunn, conducted and orchestrated by Alastair King, edited by Mark Willsher and performed by The Chamber Orchestra of London with additional music composed by Chris Egan and prepared by Tristan Noon, while the music for the film's trailer was composed by David James Rosen. It was released on September 13, 2019 on CD, digital download and vinyl by Decca Gold, Decca Records and Universal Music Canada.\n\nTrack listing [ edit ]\n\nAll music is composed by John Lunn.\n\nNo. Title Length 1. \"A Royal Command\" 4:49 2. \"Pillar of the Establishment\" 1:48 3. \"Gleam and Sparkle\" 2:48 4. \"God Is a Monarchist\" 3:02 5. \"Two Households\" 5:00 6. \"Incident at a Parade\" 2:57 7. \"Sabotage\" 3:33 8. \"Maud\" 1:28 9. \"Honour Restored\" 2:39 10. \"Never Seen Anything Like It\" 2:27 11. \"Not Entirely a Bad Night\" 2:59 12. \"May I?\" 3:08 13. \"Taking Leave\" 2:26 14. \"Resolution\" 2:15 15. \"You Are the Best of Me\" 2:44 16. \"Sunset Waltz\" 3:51 17. \"One Hundred Years of Downton\" 5:13 Total length: 53:07\n\nRelease [ edit ]\n\nA companion book and guide to the feature film was available for pre-orders as early as August 2019 to be published on 17 September,[42] that is a behind the scenes look at the film production.[43][44] The film was released in Australia on 12 September 2019, in the United Kingdom on 13 September 2019, and in the United States on 20 September 2019.[45] It premiered at Leicester Square on 9 September 2019.[46]\n\nBox office [ edit ]\n\nDownton Abbey has grossed $96.9 million in the United States and Canada, and $95.2 million in other territories, for a worldwide total of $192.1 million.[5][6] Deadline Hollywood calculated the net profit of the film to be $88 million, when factoring together all expenses and revenues.[47]\n\nSeveral weeks before its release in the United States, Fandango announced Downton Abbey's first day advanced ticket sales were pacing ahead of all other adult dramas in 2019, including Once Upon a Time in Hollywood ($41.1 million debut that July).[48][49] A week prior to its release the film held advanced screenings, where it made $2.2 million.[50] Overall, it was originally projected to gross $16–25 million from 3,076 theaters in its opening weekend.[3] After making $13.8 million on its first day, including $2.1 million from Thursday night previews, estimates were raised to $31 million. It went on to debut to $31 million, topping the box office and marking the largest opening in Focus Features' history.[4] The film made $14.5 million in its second weekend, finishing second behind newcomer Abominable, then $7.9 million in its third, finishing third.[51][52]\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nAt the review aggregator website Rotten Tomatoes, the film holds an approval rating of 84% based on 242 reviews, with an average rating of 6.88/10. The website's critics consensus reads: \"Downton Abbey distills many of the ingredients that made the show an enduring favorite, welcoming fans back for a fittingly resplendent homecoming.\"[53] On Metacritic the film has a weighted average score of 64 out of 100, based on reviews from 42 critics, indicating \"generally favorable reviews\".[54] Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale, while those at PostTrak gave it an average 4.5 out of 5 stars and a 72% \"definite recommend\".[4]\n\nJune Thomas writing for Slate praised the film, writing: \"The plot of the Downton Abbey movie is brilliant, not so much because it is surprising, but because it allows every member of the cast to do what we expect of them\".[55] In a more lukewarm reaction, Peter Bradshaw, writing for The Guardian, said: \"The Downton Abbey movie is not as spectacularly star-studded as Gosford Park, but it's got its share of A-list talent, however: Maggie Smith, of course, as the dowager Countess of Grantham, Hugh Bonneville as Lord Grantham (absent-mindedly fondling his retriever at breakfast) – there's also Imelda Staunton in a new role and Jim Carter as the beetle-browed former butler Mr Carson. All are very underused\".[56]\n\nWriting in the British publication Radio Times, Eleanor Bley Griffiths writes that Downton the film is \"frankly disappointing\". She explains that \"What the film lacks is any sense of real jeopardy. As we found out from the trailer, the big plot-line is this: the King and Queen are coming to dinner and Downton must be made perfect! But that simple story is stretched out to a full two hours of incredibly low-stakes, predictable drama with an overabundance of sub-plots\". Griffiths goes on to unfavourably compare the new film with the TV series: \"On TV, there was time to explore different threads and highlight specific characters as the series went on; but the movie gives us a whole series-worth of storylines draped over one lacklustre main plot\".[57]\n\nPopular culture [ edit ]\n\nThe cast and crew were featured in a short interview segment on PBS public television on 20 September 2019, as recognition of the influence which the film and related series have had on American popular culture.[58]\n\nAwards, accolades and nominations [ edit ]\n\nFuture [ edit ]\n\nAfter the release of the film, the creator Julian Fellowes and the cast stated that they already have ideas about doing a potential sequel.[59]\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Highclere_Castle_%28April_2011%29.jpg/220px-Highclere_Castle_%28April_2011%29.jpg", "https://upload.wikimedia.org/wikipedia/en/8/8c/DowntonAbbey2019Poster.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/12px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/8/8c/DowntonAbbey2019Poster.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Downton_Abbey_(film)", "title": "Downton Abbey (film)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/8/8c/DowntonAbbey2019Poster.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}