{"url": "https://slate.com/culture/2018/02/the-black-panther-review-roundup.html", "text": "Chadwick Boseman with two of his highly praised co-stars, Lupita Nyong’o and Letitia Wright. Marvel Studios/Black Panther\n\nSuperhero movie reviews, like superhero movies themselves, can be kind of mind-numbing (there, I said it). But based on the impassioned, political reviews of Black Panther available thus far, it’s clear this is a wholly different kind of movie.\n\nWritten and directed by black people and with an almost entirely black cast, the film has been hailed as the “blackest movie of all time.” It currently has a 100 percent fresh rating on Rotten Tomatoes, though the site has been forced to release a statement condemning attempts by an alt-right hate group to sabotage its audience score, as it did with Star Wars: The Last Jedi. Alt-right haters gonna alt-right hate, because Black Panther has already sold more advance tickets than any other superhero movie, making it the most highly anticipated superhero movie—Marvel or DC—of all time.\n\nSo what are critics saying about the first black superhero movie?\n\nCoogler’s vision lends the film a deep respect for blackness and black culture …\n\nLeah Greenblatt, Entertainment Weekly:\n\nRyan Coogler, the 31-year-old director whose brief resumé already includes an acclaimed indie drama (the 2013 festival breakout Fruitvale Station) and an underdog triumph (2015’s stellar Rocky reboot Creed), clearly fought hard to get Panther to the screen the way he envisioned it: Not as a boilerplate blockbuster window-dressed with African-American faces, but a story fully, joyfully rooted in black culture.\n\nPeter Travers, Rolling Stone:\n\nNot just a correction for years of diversity neglect, it’s a big-budget blockbuster that digs into the roots of blackness itself…. …In Get Out, Jordan Peele satirized white appropriation of black culture. Here, Coogler makes black identity invincible, but avoids simplification by turning Wakanda into a society of different tribes, each with its own customs, goals and political agendas.\n\n… making it like no other superhero movie before it.\n\nKenneth Turan, L.A. Times:\n\nBlack Panther… is an against-the-grain $100-million-plus epic so intensely personal that when the usual Marvel touchstones (Stan Lee, anyone) appear, they feel out of place.\n\nManohla Dargis, New York Times:\n\nMost big studio fantasies take you out for a joy ride only to hit the same exhausted story and franchise-expanding beats. Not this one … As with all Marvel screen ventures, the story has a lot of moving parts, but in general the results don’t register as the same-old superhero busywork, the kind that makes for forgettable stories and strenuously overinflated running times.\n\nLeah Greenblatt, Entertainment Weekly:\n\nIn that context, Panther’s nuanced celebration of pride and identity and personal responsibility doesn’t just feel like a fresh direction for the genre, it’s the movie’s own true superpower.\n\nThe fictional universe’s politics may be complex and conflicting …\n\nManohla Dargis, New York Times:\n\nThe movie also rather too breezily establishes Wakanda as a militaristic monarchy that is nevertheless fair and democratic.\n\nPeter Debruge, Variety:\n\nT’Challa doesn’t feel like a superhero so much as a deeply conflicted world leader — albeit one who must defend his title via brutal hand-to-hand bloodmatches (in a ritual that suggests a considerably more primordial, and decidedly anti-democratic, form of governance) … Rather than simply concocting another generic plan to save the world from annihilation, Coogler revives the age-old debate between Martin Luther King Jr. and Malcolm X — between passive resistance and the call for militant black activism. Think of it as “Black Panther vs. the Black Panthers,” except you can’t have a nonviolent action hero, which puts T’Challa in a strange position. It’s not quite clear what he stands for.\n\n… but its racial politics are clear.\n\nPeter Debruge, Variety:\n\nIt’s … a reminder that throughout the African diaspora, the black-white power balance remains as it is courtesy of Jim Crow practices designed to keep minorities in check: persistent segregation, broken drug laws, racially targeted policing, disproportionately high incarceration rates—all of which are identified and indicted by Coogler’s truth-to-power script. Arm the oppressed, Killmonger passionately argues, and it won’t take a century for the system that produced “The Birth of a Nation” to grant a black artist the right to tell this kind of story—not that Coogler endorses the character’s lunatic ideas.\n\nManohla Dargis, New York Times:\n\nRace matters in Black Panther and it matters deeply, not in terms of Manichaean good guys and bad but as a means to explore larger human concerns about the past, the present and the uses and abuses of power. That alone makes it more thoughtful about how the world works than a lot of mainstream movies … in its emphasis on black imagination, creation and liberation, the movie becomes an emblem of a past that was denied and a future that feels very present.\n\nCritics are praising the film’s villains, especially Michael B. Jordan’s Erik Killmonger …\n\nPeter Debruge, Variety:\n\nBlack Panther may not have the most impressive action sequences or visual effects of any Marvel movie, but it boasts the best villains. As an arms dealer whose arm doubles as a Vibranium super-cannon, Klaue makes for a nasty henchman, while Killmonger keeps his cards up his sleeve until relatively late in the film but emerges as the most satisfying comic-book adversary since Heath Ledger’s Joker. Both characters have a ruthless anarchic streak, although Killmonger has more than just wreaking chaos in mind. He’s motivated by a feeling of deep political injustice, plus a “This time it’s personal” sense of vengeance.\n\nLeah Greenblatt, Entertainment Weekly:\n\nJordan’s kinetic Killmonger is no cat-stroking cartoon villain; he’s a genuinely tragic figure, a self-appointed warden of social justice irreparably warped by the wrongs done to him.\n\n… and its celebration of strong, assertive black women …\n\nLeah Greenblatt, Entertainment Weekly:\n\nThank God (and great casting agents) for the women beside him … They’re indomitable, and so gorgeously, vividly drawn that Boseman sometimes feels like a supporting player in his own story. (The effervescent British import Wright and actress/playwright Gurira, especially, feel like they could easily hold their own films; it’s hard to remember the last time any females, let alone women of color, even came close to creating such fully formed roles in a cineplex tentpole.)\n\nManohla Dargis, New York Times:\n\nIt’s important to the movie’s politics and myth-building that he is surrounded by a phalanx of women, among them a battalion of women warriors called the Dora Milaje. These aren’t moviedom’s irritatingly token strong chicks, the tough babes with sizable biceps and skills but no real roles. For all his father issues, T’Challa is enveloped by women who cushion him in maternal, military, sisterly and scientific support. A female general (Danai Gurira) stands by his side; his baby sister (a vivacious Letitia Wright) provides gadgets and withering asides à la Bond’s gadget guy. Angela Bassett swans in as the royal mother, while Lupita Nyong’o, as a spy, makes the case for her own spinoff.\n\n… especially Letitia Wright as Princess Shuri …\n\nPeter Travers, Rolling Stone:\n\nThere’s no beating the smarts and sass of the wonderous Letitia Wright, who brings scene-stealing to the level of grand larceny as Princess Shuri, T’Challa’s kid sister. “Did you freeze again?” Shuri asks her big brother, teasing his surprisingly slow reflexes in the heat of battle once he catches sight of true love…Wright is a star in the making, who makes damn sure that Shuri will be a role model to young girls for years to come.\n\nPeter Debruge, Variety:\n\nScene-stealer Letitia Wright, whose irreverent delivery makes a welcome counterbalance to Boseman’s dead-serious attitude…\n\nTodd McCarthy, Hollywood Reporter:\n\nWright…gives her every scene extra punch and humor.\n\n… who is responsible for a number of the film’s unexpected James Bond comparisons.\n\nPeter Travers, Rolling Stone:\n\nA scientist and tech-tinkerer, she’s always the brainiest person in the room, giving Q from the James Bond series a run for his money by inventing the coolest gadgets.\n\nPeter Debruge, Variety:\n\nBecause Black Panther’s skills seem to rely more on gadgets than fantastical powers, his standalone Marvel outing actually feels more like a James Bond adventure than a conventional superhero movie at times — as in the subsequent set piece, which was clearly inspired by the Macau casino scene in Skyfall.\n\nManohla Dargis, New York Times:\n\nFor a while, as the story and the Black Panther veer here and there, jumping from Wakanda to Busan, South Korea, the filmmakers seem as if they’re simply going to deliver a remix of James Bond with a touch of Spidey shenanigans.\n\nMeanwhile, the most important “character” in Black Panther might just be Wakanda itself.\n\nKenneth Turan, L.A. Times:\n\nOne of the great things about Black Panther is the specificity of this mythical place… Not only have production designer Beachler and her team created marvelous locations like the Challenge Pool at Warrior Falls, but veteran costume designer Ruth E. Carter was instrumental as well. Both referenced everything including Ghanaian textiles, a 5th century Nigerian script and the dress of tribes like the Maasai, Tuareg, Dogon and Zulu.\n\nManohla Dargis, New York Times:\n\nPart of the movie’s pleasure and its ethos — which wends through its visuals — is how it dispenses with familiar either/or divides, including the binary opposition that tends to shape our discourse on race. Life in Wakanda is at once urban and rural, futuristic and traditional, technological and mystical. Spaceships zoom over soaring buildings with thatched tops; a hover train zips over a market with hanging woven baskets. In one of the most striking locales, an open-air throne room is horizontally lined with suspended tree limbs, creating a loose pattern that pointedly blurs the divide between the interior and exterior worlds and is echoed by the fretwork in costumes and other sets. …Wakanda itself is finally the movie’s strength, its rallying cry and state of mind\n\nBut of course, as with too many movies these days, timeliness is next to Trumpiness.\n\nPeter Travers, Rolling Stone:\n\nThere aren’t many superhero films that blow you away with thunderous effects and also tackle ethnic and gender issues, crush racial stereotypes, celebrate women and condemn Trump-era notions of exclusionism.\n\nPeter Debruge, Variety\n\nOpening in the mythical kingdom of Wakanda, Black Panther effectively anticipates President Trump’s alleged comments about “shithole countries” whose refugees prefer the American way of life “to their huts.” Without disparaging the rest of Africa, Coogler and his crew suggest what the continent might have become had it never been stripped of its resources.\n\nPete Hammond, Deadline:\n\nIts themes including the importance of a wealthy nation taking on responsibility for the betterment of the whole world especially hit home for me in the Trumpian age of America First.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=18406752&cv=2.0&cj=1", "https://compote.slate.com/images/076103c4-3c1e-417e-9526-3e1d7616d4f5.jpeg?width=780&height=520&rect=1406x937&offset=252x0", "https://pixel.quantserve.com/pixel/p-fw53_-Tq3MNK1.gif", "https://slate.com/media/components/adblock-message/slate-plus-promo.png", "https://www.facebook.com/tr?id=166975463695820&ev=PageView&noscript=1", "https://compote.slate.com/images/076103c4-3c1e-417e-9526-3e1d7616d4f5.jpeg?width=780&height=520&rect=1406x937&offset=211x0"], "top_img": "https://compote.slate.com/images/076103c4-3c1e-417e-9526-3e1d7616d4f5.jpeg?width=780&height=520&rect=1406x937&offset=252x0", "keywords": [], "authors": ["Rachel Withers"], "canonical_link": "https://slate.com/culture/2018/02/the-black-panther-review-roundup.html", "title": "First reviews of Marvel's Black Panther.", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Here’s What Critics Are Saying About Black Panther", "url": "https://slate.com/culture/2018/02/the-black-panther-review-roundup.html", "description": "Powerful politics, complex villains, and strong black women.", "image": "https://compote.slate.com/images/076103c4-3c1e-417e-9526-3e1d7616d4f5.jpeg?width=780&height=520&rect=1406x937&offset=252x0", "site_name": "Slate Magazine", "type": "article"}, "twitter": {"title": "Here’s What Critics Are Saying About Black Panther", "description": "Powerful politics, complex villains, and strong black women.", "image": "https://compote.slate.com/images/076103c4-3c1e-417e-9526-3e1d7616d4f5.jpeg?width=780&height=520&rect=1406x937&offset=252x0", "card": "summary_large_image", "site": "@slate"}, "article": {"published_time": "2018-02-06T21:04:53+00:00", "tag": "movies, black panther", "publisher": "https://www.facebook.com/Slate"}, "description": "Powerful politics, complex villains, and strong black women.", "news_keywords": "movies, black panther", "author": "Rachel Withers", "fb": {"app_id": 142011022527753}, "apple-mobile-web-app-title": "Slate", "application-name": "Slate", "msapplication-TileColor": "#660033", "msapplication-TileImage": "https://slate.com/media/sites/slate-com/icon.144x144.png", "theme-color": "#2c0022", "dfp-cache-buster": "7b1b9fb6f55280c03edfe3d6def54723514811de"}, "movies": [], "publish_date": 1517951093.0, "source": "https://slate.com", "summary": ""}