{"url": "en.wikipedia.org/wiki/Ben_Stiller", "text": "Benjamin Edward Meara Stiller (born November 30, 1965) is an American actor, comedian, writer, producer, musician and director. He is the son of veteran comedians and actors Jerry Stiller and Anne Meara.[1]\n\nAfter beginning his acting career with a play, Stiller wrote several mockumentaries and was offered his own show, titled The Ben Stiller Show, which he produced and hosted for its 13-episode run. Having previously acted in television, he began acting in films. He made his directorial debut with Reality Bites. Throughout his career he has written, starred in, directed, or produced more than 50 films including The Secret Life of Walter Mitty, Zoolander, The Cable Guy, There's Something About Mary, the Meet the Parents trilogy, DodgeBall, Tropic Thunder, the Madagascar series, and the Night at the Museum trilogy. He has also made numerous cameos in music videos, television shows, and films.[2]\n\nStiller is a member of a group of comedic actors colloquially known as the Frat Pack. His films have grossed more than $2.6 billion in Canada and the United States, with an average of $79 million per film.[3] Throughout his career, he has received various awards and honors, including an Emmy Award, multiple MTV Movie Awards, a Britannia Award and a Teen Choice Award.\n\nEarly life\n\nBenjamin Edward Meara Stiller[4][5] was born on November 30, 1965 in New York City[6] and raised on the Upper West Side.[7] His father, comedian and actor Jerry Stiller, is from a Jewish family that emigrated from Poland and Galicia in Central Europe.[8][9][10][11] His mother, actress and comedian Anne Meara, who was from an Irish Catholic background, converted to Reform Judaism after marrying his father.[12][13][14][15] While they \"were never a very religious family\", they celebrated both Hanukkah and Christmas,[16] and Stiller had a Bar Mitzvah.[17][18][19]\n\nHis parents frequently took him on the sets of their appearances, including The Mike Douglas Show when he was 6.[20] He considered his childhood unusual, stating: \"In some ways, it was a show-business upbringing—a lot of traveling, a lot of late nights—not what you'd call traditional.\"[21] His elder sister, Amy, has appeared in many of his productions, including Reality Bites, DodgeBall: A True Underdog Story, and Zoolander.[22][23][24] Stiller displayed an early interest in filmmaking and made Super 8 movies with his sister and friends.[9]\n\nAt age 9, Stiller made his acting debut as a guest on his mother's short-lived television series, Kate McShane. In the late 1970s, he performed with the New York City troupe NYC's First All Children's Theater, playing several roles, including the title role in Clever Jack and the Magic Beanstalk.[25] After being inspired by the television show Second City Television while in high school, Stiller realized that he wanted to get involved with sketch comedy.[25] During his high school years, he was also the drummer of the post-punk band Capital Punishment, which released the studio album Roadkill in 1982. The band's bassist, Peter Swann, went on to become (as of 2018 ) an Arizona Court of Appeals Judge.[26][27] The band reunited in 2018 to release a new EP, titled This is Capital Puishment for Record Store Day.[28] The current status of the band is unknown.\n\nStiller attended The Cathedral School of St. John the Divine and graduated from the Calhoun School in New York in 1983. He started performing on the cabaret circuit as opening act to the cabaret siren Jadin Wong. Stiller then enrolled as a film student at the University of California, Los Angeles.[29] After nine months, Stiller left school to move back to New York City.[19] He made his way through acting classes, auditioning and trying to find an agent.[30]\n\nActing career\n\nEarly work\n\nWhen he was approximately 15, Stiller obtained a small part with one line on the television soap opera Guiding Light, although in an interview he characterized his performance as poor.[31] He was later cast in a role in the 1986 Broadway revival of John Guare's The House of Blue Leaves, alongside John Mahoney; the production would garner four Tony Awards.[30]\n\nDuring its run, Stiller produced a satirical mockumentary whose principal was fellow actor Mahoney. Stiller's comedic work was well received by the cast and crew of the play, and he followed up with a 10-minute short titled The Hustler of Money, a parody of the Martin Scorsese film The Color of Money. The film featured him in a send-up of Tom Cruise's character and Mahoney in the Paul Newman role, only this time as a bowling hustler instead of a pool shark. The short got the attention of Saturday Night Live, which aired it in 1987 and two years later offered Stiller a spot as a writer.[30]\n\nIn the meantime, he had a bit role in Steven Spielberg's Empire of the Sun.[32]\n\nIn 1989 Stiller wrote and appeared on Saturday Night Live as a featured performer. However, since the show did not want him to make more short films, he left after four episodes.[30] He then put together Elvis Stories, a short film about a fictitious tabloid focused on recent sightings of Elvis Presley.[33] The film starred friends and co-stars John Cusack, Jeremy Piven, Mike Myers, Andy Dick, and Jeff Kahn.[33] The film was considered a success, and led him to develop the short film Going Back to Brooklyn for MTV; it was a music video starring comedian Colin Quinn that parodied LL Cool J's recent hit \"Going Back to Cali\".[34]\n\nThe Ben Stiller Show\n\nProducers at MTV were so impressed with Back to Brooklyn that they offered Stiller a 13-episode show in the experimental \"vid-com\" format.[35] Titled The Ben Stiller Show, this series mixed comedy sketches with music videos and parodied various television shows, music stars, and films. It starred Stiller, along with main writer Jeff Khan and Harry O'Reilly, with his parents and sister making occasional appearances.[35]\n\nAlthough the show was canceled after its first season, it led to another show titled The Ben Stiller Show, on the Fox Network in 1992. The series aired 12 episodes on Fox, with a 13th unaired episode broadcast by Comedy Central in a later revival.[36] Among the principal writers on The Ben Stiller Show were Stiller and Judd Apatow, with the show featuring the ensemble cast of Stiller, Janeane Garofalo, Andy Dick, and Bob Odenkirk.[37] Both Denise Richards and Jeanne Tripplehorn appeared as extras in various episodes. Throughout its short run, The Ben Stiller Show frequently appeared at the bottom of the ratings, even as it garnered critical acclaim and eventually won an Emmy Award for \"Outstanding Writing in a Variety or Music Program\" posthumously.[36][38][39]\n\nDirectorial debut\n\nIn the early 1990s Stiller had minor roles in films such as Stella and Highway to Hell as well as a cameo in The Nutt House. In 1992 Stiller was approached to direct Reality Bites, based on a script by Helen Childress. Stiller devoted the next year and a half to rewriting the script with Childress, fundraising, and recruiting cast members for the film. It was eventually released in early 1994, directed by Stiller and featuring him as a co-star.[30] The film was produced by Danny DeVito, who would later direct Stiller's 2003 film Duplex and produce his 2004 film Along Came Polly.[40]\n\nReality Bites debuted as the highest-grossing film in its opening weekend and received mixed reviews.[41][42]\n\nStiller joined his parents in the family film Heavyweights (1995), in which he played two roles, and then had a brief uncredited role in Adam Sandler's Happy Gilmore (1996).[43][44] Next, he had lead roles in If Lucy Fell and Flirting with Disaster, before tackling his next directorial effort with The Cable Guy, which starred Jim Carrey. Stiller once again was featured in his own film, as twins. The film received mixed reviews, but was noted for paying the highest salary for an actor up to that point, as Carrey received $20 million for his work in the film.[45] The film also connected Stiller with future Frat Pack members Jack Black and Owen Wilson.[citation needed]\n\nAlso in 1996, MTV invited Stiller to host the VH1 Fashion Awards. Along with SNL writer Drake Sather, Stiller developed a short film for the awards about a male model known as Derek Zoolander. It was so well received that he developed another short film about the character for the 1997 VH1 Fashion Awards and finally remade the skit into a film.[30]\n\nComedic work\n\nIn 1998 Stiller put aside his directing ambitions to star in a surprise hit with a long-lasting cult following, the Farrelly Brothers' There's Something About Mary, alongside Cameron Diaz. That year, he starred in several dramas, including Zero Effect, Your Friends & Neighbors, and Permanent Midnight. He was invited to take part in hosting the Music Video awards, for which he developed a parody of the Backstreet Boys and performed a sketch with his father, commenting on his current career.[46]\n\nIn 1999 he starred in three films, including Mystery Men, where he played a superhero wannabe called Mr. Furious. He returned to directing with a new spoof television series for Fox titled Heat Vision and Jack, starring Jack Black; however, the show was not picked up by Fox after its pilot episode and the series was cancelled.[47]\n\nIn 2000, Stiller starred in three more films, including one of his most recognizable roles, a male nurse named Gaylord \"Greg\" Focker in Meet the Parents, opposite Robert De Niro.[48] The film was well received by critics, grossed over $330 million worldwide, and spawned two sequels.[49][50] Also in 2000, MTV again invited Stiller to make another short film, and he developed Mission: Improbable, a spoof of Tom Cruise's role in Mission: Impossible II and other films.[51]\n\nIn 2001, Stiller directed his third feature film, Zoolander, starring himself as Derek Zoolander. The film featured multiple cameos from a variety of celebrities, including Donald Trump, Paris Hilton, Lenny Kravitz, Heidi Klum, and David Bowie, among others. The film was banned in Malaysia (as the plot centered on an assassination attempt of a Malaysian prime minister),[52] while shots of the World Trade Center were digitally removed and hidden for the film's release after the September 11 terrorist attacks.[53]\n\nStiller in 2010\n\nAfter Stiller worked with Owen Wilson in Zoolander, they joined together again for The Royal Tenenbaums.[54]\n\nOver the next two years, Stiller continued with the lackluster box office film Duplex, and cameos in Orange County and Nobody Knows Anything![55][56][57] He has guest-starred on several television shows, including an appearance in an episode of the television series The King of Queens in a flashback as the father of the character Arthur (played by Jerry Stiller).[58] He also made a guest appearance on World Wrestling Entertainment's WWE Raw.[59]\n\nIn 2004, Stiller appeared in six different films, all of which were comedies, and include some of his highest-grossing films: Starsky & Hutch, Envy, DodgeBall: A True Underdog Story, Anchorman: The Legend of Ron Burgundy (in which he had an uncredited cameo), Along Came Polly and Meet the Fockers. While the critical flop Envy only grossed $14.5 million,[60] the most successful film of these was Meet the Fockers, which grossed over $516.6 million worldwide.[61]\n\nHe also made extended guest appearances on Curb Your Enthusiasm and Arrested Development in the same year. In 2005, Stiller appeared in Madagascar, which was his first experience as a voice actor in an animated film. Madagascar was a massive worldwide hit, and spawned the sequels Madagascar: Escape 2 Africa in 2008 and Madagascar 3: Europe's Most Wanted in 2012.[62]\n\nIn 2006, Stiller had cameo roles in School for Scoundrels and Tenacious D in The Pick of Destiny; he was executive producer of the latter. In December 2006, he had the lead role in Night at the Museum. Although not a critical favorite, it earned over $115 million in ten days.[63]\n\nIn 2007, Stiller starred alongside Malin Åkerman in the romantic comedy The Heartbreak Kid. The film earned over $100 million worldwide despite receiving mostly negative reviews.[64][65]\n\nIn 2008, Stiller directed, co-wrote, co-produced, and starred in the film Tropic Thunder, with Robert Downey Jr. and Jack Black; Stiller had originally conceived of the film's premise while filming Empire of the Sun in 1987.[66]\n\nIn 2009, he starred with Amy Adams in Night at the Museum 2: Battle of the Smithsonian, sequel to Night at the Museum.[67]\n\nIn 2010, Stiller made a brief cameo in Joaquin Phoenix's mockumentary I'm Still Here and played the lead role in the comedy-drama Greenberg. He again portrayed Greg Focker in the critically panned but financially successful Little Fockers, the second sequel to Meet the Parents. He had planned to voice the main character in Megamind, but later dropped out while still remaining a producer and voicing a minor character in the film.[68]\n\nIn 2011, Stiller starred with Eddie Murphy and Alan Alda in Tower Heist, about a group of maintenance workers planning a heist in a residential skyscraper.[69] He produced, directed, and starred in The Secret Life of Walter Mitty, which was released in 2013.[70]\n\nIn 2018 and 2019, Stiller played Michael Cohen on Saturday Night Live for 6 episodes.\n\n\"Frat Pack\"\n\nStiller has been described as the \"acknowledged leader\" of the Frat Pack, a core group of actors who have worked together in multiple films. The group includes Jack Black, Will Ferrell, Vince Vaughn, Owen Wilson, Luke Wilson, and Steve Carell.[71][72] Stiller has been acknowledged as the leader of the group because of his multiple cameos and for his consistent use of the other members in roles in films which he produces and directs. He has appeared the most with Owen Wilson (in 12 films).[71][73] Of the 35 primary films that are considered Frat Pack films, Stiller has been involved with 20, in some capacity.[71]\n\nStiller is also the only member of this group to have appeared in a Brat Pack film (Fresh Horses).[32] He rejects the \"Frat Pack\" label, saying in a 2008 interview that the concept was \"completely fabricated\".[74]\n\nPersonal life\n\nStiller in December 2008\n\nStiller dated several actresses during his early television and film career, including Jeanne Tripplehorn, Calista Flockhart, and Amanda Peet.[75][76] In May 2000, Stiller married Christine Taylor at an oceanfront ceremony in Kauai, Hawaii.[77] They met while filming a never-broadcast television pilot for the Fox Broadcasting network called Heat Vision and Jack. The couple appeared onscreen together in Zoolander, DodgeBall: A True Underdog Story, Tropic Thunder, Zoolander 2, Curb Your Enthusiasm, and Arrested Development.[78] The couple have two children. In May 2017, Stiller and Taylor announced their separation in a joint statement, after 17 years of marriage.[79]\n\nIn 2001, Stiller appeared as a celebrity contestant on the game show Who Wants to Be a Millionaire. He won $32,000 for his charity Project ALS, after incorrectly answering his $250,000 question in an attempt to equal Edie Falco's $250,000 win.[80]\n\nStiller is a supporter of the Democratic Party and donated money to John Kerry's 2004 U.S. Presidential campaign.[81] In February 2007, Stiller attended a fundraiser for Barack Obama and later donated to the 2008 U.S. Presidential campaigns of Democrats Obama, John Edwards, and Hillary Clinton.[82]\n\nStiller supports such charities as Declare Yourself, the Elizabeth Glaser Pediatric AIDS Foundation, and the Starlight Starbright Children's Foundation.[83] Stiller is actively involved in support of animal rights.[84] In 2010, Stiller, together with Jennifer Aniston, Courteney Cox, Robin Williams, and others, starred in The Cove PSA: My Friend is... , in an effort to stop the slaughter of dolphins and protect the Japanese population from the toxic levels of mercury found in dolphin meat.[85] He was appointed Goodwill Ambassador for UNHCR on July 2, 2018.[86]\n\nStiller frequently impersonates such performers as Bono, Tom Cruise, Bruce Springsteen, and David Blaine. In an interview with Parade, he commented that Robert Klein, George Carlin, and Jimmie Walker were inspirations for his comedy career.[21] Stiller is also a self-professed Trekkie and appeared in the television special Star Trek: 30 Years and Beyond to express his love of the show, as well as a comedy roast for William Shatner.[87][88] He frequently references the show in his work, and named his production company Red Hour Productions after a time of day in the original Star Trek episode, \"The Return of the Archons\".[89]\n\nStiller was diagnosed with Lyme disease in 2010. He believes he contracted the illness while visiting Nantucket, Massachusetts.[90]\n\nStiller was diagnosed with prostate cancer in June 2014. Following surgery, he received a cancer-free status in September 2014.[91][92][93]\n\nFilmography\n\nStiller in 2014\n\nStiller has mostly appeared in comedy films. He is an Emmy Award winner for his directed, produced and written television show The Ben Stiller Show.[94]\n\nAwards and honors\n\nReferences", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/6/64/BenStillerTropicThunderPendleton.jpg/220px-BenStillerTropicThunderPendleton.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Ben_Stiller_2010_%28Cropped%29.jpg/170px-Ben_Stiller_2010_%28Cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/19px-Symbol_support_vote.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Ben_Stiller_May_2019.jpg/1200px-Ben_Stiller_May_2019.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Ben-Stiller-%28MS1411200222%29.jpg/220px-Ben-Stiller-%28MS1411200222%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/23/BenStiller08.jpg/170px-BenStiller08.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Ben_Stiller_May_2019.jpg/220px-Ben_Stiller_May_2019.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Ben_Stiller_May_2019.jpg/1200px-Ben_Stiller_May_2019.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Ben_Stiller", "title": "Ben Stiller", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.27", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Ben_Stiller_May_2019.jpg/1200px-Ben_Stiller_May_2019.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}