{"url": "https://en.wikipedia.org/wiki/Taylor_Momsen", "text": "American singer, songwriter, model, and former actress\n\nTaylor Michel Momsen (born July 26, 1993)[1] is an American singer, songwriter, model, and former actress. She is known for portraying the character of Jenny Humphrey on The CW's teen drama series Gossip Girl (2007–2012) and Cindy Lou Who in the film How the Grinch Stole Christmas (2000).[2] After her retirement from acting, she became widely known for being the frontwoman of the American rock band The Pretty Reckless.\n\nEarly life [ edit ]\n\nMomsen was born in St. Louis, Missouri. Her parents are Michael and Collette Momsen and she has a younger sister, Sloane Momsen, who is also an actress. She has Russian ancestry.[3] She was raised Roman Catholic[4] and attended Our Lady of Lourdes Catholic School[5] for elementary school and later Herbert Hoover Middle School in Potomac, Maryland but is now non-religious.[6][7][8] She also studied dance at the Center of Creative Arts in St. Louis.\n\nMomsen was signed with Ford Models at a very young age: \"My parents signed me up with Ford [Modeling] at the age of 2. No 2-year-old wants to be working, but I had no choice. My whole life, I was in and out of school. I didn't have friends. I was working constantly and I didn't have a real life.\"[6] She began acting professionally at three years of age in a 1997 national commercial for Shake 'n Bake.[9] She was then cast in The Prophet's Game.\n\nMomsen is included on the list of Unclaimed Coogan accounts for performing children whose partial childhood earnings are mandated to be put in a special fund but who have yet to claim their earnings.[10]\n\nCareer [ edit ]\n\nActing [ edit ]\n\nIn 2000, Momsen played the role of Cindy Lou Who in Dr. Seuss' How the Grinch Stole Christmas, her breakout role. In 2002, she played Gretel in Hansel and Gretel and Alexandra, the President's daughter, in Spy Kids 2: The Island of Lost Dreams.\n\nMomsen's career came to a halt for over three years until she received a lead role in the WB series Misconceptions, which never aired. After that, she also appeared in the 2006 film Saving Shiloh. She also auditioned for the title role in Hannah Montana, and was in the top three, but the role was instead awarded to Miley Cyrus—a decision that Momsen was happy with in retrospect.[11] In 2007, she starred in the Walt Disney Pictures film Underdog as Molly and as Jennifer in the movie Paranoid Park, directed by Gus Van Sant.\n\nBeginning in 2007, she played the character of Jenny Humphrey in The CW television series Gossip Girl, based on the book series by Cecily von Ziegesar. Momsen's appearances on the series became increasingly sporadic, and, by the end of the first half of the fourth season, she had only appeared in four episodes. It was then announced that the actress would be scheduled for an indefinite hiatus from the show,[12] which ended with her leaving the series as a regular cast member after the completion of the fourth season in 2011. On August 16, 2011, Momsen told Elle magazine that she had quit acting to focus on her music career.[13] On October 16, 2012, it was reported that Momsen would be returning to Gossip Girl for its final episode, in which she appeared briefly in the wedding sequence.[14][15]\n\nModeling [ edit ]\n\nIn June 2008, at the age of fourteen, Momsen signed to IMG Models.[16][17] She was the face of British fashion chain New Look for its spring/summer 2010 collection.[18] After weeks of speculation about who would be the face of Madonna's 2010 fashion line \"Material Girl\", Momsen was announced on July 15, 2010.[19] A week later, Momsen was announced as the model for John Galliano's new women's fragrance, scheduled to launch in autumn 2010.[20] In 2010, she appeared in a video for Galliano's \"Parlez-Moi d'Amour\" fragrance ad campaign.\n\nMomsen is the face of Samantha Thavasa's handbag line. She has done multiple photoshoots, press events, and commercials.[21]\n\nMomsen appeared on the cover of Page Six Magazine when she was 15 years old in 2009. She also appeared on the February 2010 cover of Seventeen.[22] In October 2010, Momsen wore a pair of platform stilettos, thigh-high stockings, and a holster strapped around her leg for Revolver. She appeared on the cover of FHM's March 2012 edition[23] and FHM ranked Momsen #29 in its 2012 Hot 100 issue.[24] She also made her cover debut for Maxim in the November 2013 issue.[25]\n\nIn an interview with music journalist, Jason Tanamor, when asked about posing for Playboy, she said, \"I was at the mansion last week and took some pictures. Does that count?\"[26]\n\nMusic [ edit ]\n\nMomsen performing in April 2010\n\nMomsen has said that \"music is where I can be me\",[27] stating that \"acting is easy. I've been doing it for so long and I totally love it. But you're playing a character instead of yourself. Music is more personal because you're writing it and you're involved in every step of it.\"[27] At 7 years old, Momsen recorded the song \"Christmas, Why Can't I Find You?\" for the soundtrack to How the Grinch Stole Christmas. In 2002, she recorded the songs \"One Small Voice\" and \"Rudolph The Red-Nosed Reindeer\" for the compilation album School's Out! Christmas.\n\nIn March 2009, Momsen stated in an interview with OK! magazine that her band the Pretty Reckless had signed a deal with Interscope Records.[28] She played her first tour with her band opening for The Veronicas on their Revenge Is Sweeter Tour in spring 2009.[29] After the tour, Momsen began working with guitarist Ben Phillips, who would soon join the band. Momsen subsequently swapped out her former bandmates. She co-writes songs with Phillips; in addition to lead vocals, Momsen also plays rhythm guitar.\n\nThe band's debut album Light Me Up was released on August 30, 2010 in the UK,[30] where it debuted at number 6, as well as at number 18 in Ireland. The first single \"Make Me Wanna Die\" was released on May 30, 2010, while the second single \"Miss Nothing\" which was released on August 23, 2010 peaked at number 39. \"Just Tonight\" was released as the album's third single. Songs from this album have been in the movie Kick-Ass as well as shows like The Vampire Diaries and Gossip Girl.[31]\n\nTelevision personality Heidi Montag recorded \"Blackout\", a song written by Momsen. According to Momsen, she wrote the song when she was 8 years old and recorded it as a demo with a producer.[32] Montag released the song as a digital only single, with the music video being directed by her husband Spencer Pratt. Momsen commented about the recording: \"I'm like, okay, dude, you're singing an 8-year-old's words, but that's cool. It's so funny because I didn't shop it or anything and I get this call going, 'Did you write a song for Heidi Montag'? And I'm like, 'What?'\"[32] The track was later included on Montag's debut studio album Superficial (2010).\n\nOn July 27, 2011, Momsen announced that the band would be the supporting act for Evanescence during the fall of 2011.[33] Throughout 2012, Momsen and her band toured North America; the second headlining tour, titled the Medicine Tour, began in March 2012 [34] and culminated with supporting dates for Marilyn Manson's 2012 world tour Hey Cruel World... Tour. Momsen also appeared as guest vocalist on the first track of ex Ministry member Paul Barker's 2012 album Fix This.\n\nOn November 30, 2012, it was announced that the Pretty Reckless' fourth single \"Kill Me\" would be released on December 11.[35] The track was the last song to be featured in the Gossip Girl series finale.\n\nMomsen cites Kurt Cobain, Chris Cornell, the Beatles, Led Zeppelin, the Who, Pink Floyd, AC/DC, Marilyn Manson, Oasis, and Shirley Manson of Garbage as some of her personal influences.[36][37][38]\n\nGoing to Hell was released on March 18, 2014.[39] The release marked the band's largest sales week to date and landed at #5 on the Billboard 200 with over 35,000 copies sold in its first week.[40] The success of the record saw Taylor, along with the rest of the band, break records when they became the first female-fronted band to reach No. 1 on the rock radio charts with its first two singles: \"Heaven Knows\" in March 2014 and \"Fucked Up World\" in September 2014.[41] The Pretty Reckless also spent the majority of late 2013 throughout 2014 on tour supporting Going To Hell. In 2014, her band also supported Fall Out Boy in their European leg of the Save Rock n Roll Tour along with New Politics.\n\nThroughout 2015, Momsen continued to record new material for the third Pretty Reckless album. On September 29, 2016, the band released the single \"Take Me Down\", which reached number two on the Billboard Mainstream Rock Chart.[42][43] The third album, Who You Selling For, was released in October 2016.[42]\n\nDiscography [ edit ]\n\nFilmography [ edit ]\n\nMusic videos Year Title Artist Notes 2014 \"L.A. Love (La La)\" Fergie Cameo", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Taylor_Momsen_-_Warped_Tour_Kickoff_%285%29.jpg/200px-Taylor_Momsen_-_Warped_Tour_Kickoff_%285%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/The_Pretty_Reckless_Rockfest_2017_2.jpg/1200px-The_Pretty_Reckless_Rockfest_2017_2.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Taylor_Momsen_at_Met_Opera.jpg/170px-Taylor_Momsen_at_Met_Opera.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/The_Pretty_Reckless_Rockfest_2017_2.jpg/220px-The_Pretty_Reckless_Rockfest_2017_2.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/The_Pretty_Reckless_Rockfest_2017_2.jpg/1200px-The_Pretty_Reckless_Rockfest_2017_2.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Taylor_Momsen", "title": "Taylor Momsen", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/The_Pretty_Reckless_Rockfest_2017_2.jpg/1200px-The_Pretty_Reckless_Rockfest_2017_2.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}