{"url": "https://en.wikipedia.org/wiki/Kylie_Jenner", "text": "Kylie Kristen Jenner (born August 10, 1997)[3] is an American media personality. She has starred in the E! reality television series Keeping Up with the Kardashians since 2007 and is the founder and owner of cosmetic company Kylie Cosmetics.\n\nAt age 14 in 2012, she collaborated with the clothing brand PacSun, along with her sister Kendall, and created a line of clothing, \"Kendall & Kylie\". In 2015, Jenner launched her own cosmetics line called Kylie Lip Kits, which was renamed to Kylie Cosmetics the following year.[4] She also released a mobile app that reached number one on the iTunes App Store.[5]\n\nIn 2014 and 2015, Time magazine listed the Jenner sisters on their list of the most influential teens in the world, citing their considerable influence among youth on social media.[6][7] As of November 2019, with over 150 million followers,[8] she is one of the most followed people on Instagram.[9] In 2017, Jenner was placed on the Forbes Celebrity 100 list, making her the youngest person to be featured on the list.[10] Jenner starred on her own spin-off series, Life of Kylie, which premiered on E! on August 6, 2017.[11]\n\nAccording to Forbes magazine, Jenner's net worth is estimated at US$1 billion, making her, at age 21, the world's youngest billionaire as of March 2019.[12][13] However, the notion of Jenner being self-made is a subject of controversy, owing to her privileged background.[14][15] In November 2018, New York Post credited her for being the most influential celebrity in the fashion industry.[16]\n\nEarly life\n\nJenner was born in 1997 in Los Angeles, California. The youngest daughter of 1976 Summer Olympics decathlon winner Bruce Jenner (now Caitlyn Jenner) and TV personality Kris Jenner,[17] she has an older sister, Kendall. On Kris's side of the family, she has three older half-sisters, Kourtney, Kim and Khloé Kardashian, and one older half-brother, Rob. Jenner also has three older half-brothers from Caitlyn's side of the family—Burt, Brandon, and Brody Jenner—and an older half-sister, Casey.\n\nJenner attended Sierra Canyon School, where she was a member of the cheerleading team. Jenner claims to have performed in plays while attending school, along with community plays.[18] In 2012, she became homeschooled and enrolled in an at-home education program, from which she graduated with a high school diploma in July 2015 from Laurel Springs School in Ojai, California.[19][20]\n\nCareer\n\n2007–2012: Keeping Up with the Kardashians\n\nIn 2007, Jenner, along with her parents and siblings, Kendall, Kourtney, Kim, Khloé, and Rob, began appearing in the reality television series Keeping Up with the Kardashians, which chronicles the personal and professional lives of their family members.[21] The series was successful for its network, E!, and has resulted in the creation of numerous spin-offs including Kourtney and Kim Take Miami, Khloé & Lamar, Kourtney and Kim Take New York, and Kourtney and Khloé Take The Hamptons, in which Jenner has made multiple guest appearances.[22] The sisters hosted Glee: The 3D Concert Movie at the Regency Village Theater in Westwood, California in August 2011,[23] In 2011, they were featured in Seventeen magazine's Style Stars of the Year,[24][25] and selected them as \"Style Ambassadors\" for the magazine.[26] The two hosted the premiere of The Vow in Hollywood in February 2012.[27] The Jenners also interviewed the cast of The Hunger Games premiere in the at The Nokia Theatre in Los Angeles in March 2012.[28] Later in 2012, she starred alongside her sister Kendall and mother Kris Jenner in an episode of American reality television series America's Next Top Model.\n\n2013–2014: Early endorsements\n\nJenner has two nail lacquers from the Nicole by OPI nail polish brand called Wear Something Spar-kylie and Rainbow in the S-kylie.[29] Kendall and Kylie earned $100,000 each for their OPI endorsements in 2013.[30]\n\nOn November 15, 2013, the Jenner sisters announced that they would launch The Kendall & Kylie Collection with PacSun[31] which launched in February 2013. Since its conception, the sisters have released several collections for this line. In July 2013, the Jenner sisters launched a jewelry line with Pascal Mouawad's Glamhouse[32][33] to create the Metal Haven by Kendall & Kylie jewelry collection.\n\nJenner set up an eBay account where she auctions old clothing to raise money for the Children's Hospital Los Angeles.[34] Jenner joined her family in a charity yard sale on November 10, 2013.[35] Proceeds from the sale were donation-matched and sent to Share Our Strength: No Kid Hungry and the Greater Los Angeles Fisher House Foundation. She joined Khloé, Kendall, Lil Twist, and The Game at PINZ bowling alley in Studio City, California for a charity bowling game on January 19, 2014. The event was held to raise money for The Robin Hood Foundation, a nonprofit for which The Game pledged to raise $1 million in donations.[36] The Jenner sisters participated in singer Chris Brown's two Kick'n It For Charity Celebrity Kickball games in Glendale, California on July 19, 2014[37] and on August 16, 2014.[38] At the first game, she competed on actor/singer Quincy Brown's team. Jenner donated to the Lesbian Gay Bisexual Transgender community.[39]\n\nIn February 2014, she and Kendall launched a shoe and handbag line for Steve Madden's Madden Girl line.[40][41] The Jenner sisters co-hosted the 2014 Much Music Video Awards, where Kylie made her acting debut in a promo for the show in Toronto, Ontario, Canada, in June 2014.[42] In August 2014, the Jenner sisters appeared in singer PartyNextDoor's \"Recognize\" music video.[43] Jenner and her sister Kendall co-authored the dystopian science fiction novel Rebels: City of Indra: The Story of Lex and Livia, which revolved around two twin girls, Lex and Livia, in a \"self-sustaining biosphere\" put together from the remains of Earth known as Indra.[44] The novel was criticized upon release as a ghostwritten work, which prompted its ghostwriter Maya Sloan to reveal that while the Jenner sisters wrote a two-page outline for what they wanted the novel to be like, Sloan was truly responsible for the writing of the book. However, the Jenners' creative director, Elizabeth Killmond-Roman, clarified that the two had numerous Skype and FaceTime calls with Sloan to discuss the content of the novel.[45] The novel was mostly panned by critics, and sold only 13,000 copies in its first four months on sale.[46] The book was also given a sequel, Time of the Twins, which was also co-authored by the Jenner sisters. Jenner launched a line of hair extensions through a partnership with Bellami Hair, called Kylie Hair Kouture, in October 2014.[47][48][49]\n\n2015–2018: Rise of Kylie Cosmetics\n\nJenner being interviewed for Nip + Fab in 2015\n\nJenner became skincare brand Nip + Fab's second-ever ambassador in March 2015.[50]\n\nThe Jenner sisters were booed while introducing brother-in-law Kanye West's performance at the Billboard Music Awards in May 2015.[51] In May 2015, an episode of Keeping Up with the Kardashians premiered in which Jenner admitted to getting a lip augmentation.[52] Her enhanced lips from lip fillers created speculation and gained her publicity. Prior to the episode's debut, Jenner stated that she merely used lip liner and over lined her lips.[53] As a result, the practice of suctioning one's lips into a small glass in order to induce greater blood flow to swell the lips was called the \"Kylie Jenner Challenge\" (though there was no indication that Jenner herself employed this method).[54] Jenner responded to this by stating, \"I'm not here to try & encourage people/young girls to look like me or to think this is the way they should look.\"[55] In June 2015, the Jenner sisters launched their clothing line Kendall + Kylie with British fashion retailer Topshop.[56] This Topshop clothing line also featured swimsuits.[57] In August 2015, Jenner announced that she would be launching her first lipstick line as a part of her self-titled lip kit under the name Kylie Lip Kit.[58] In September 2015, Jenner launched her new personalized website and mobile app.[59] In October 2015, Jenner starred in Tyga's music video for his song \"Dope'd Up\".[60][61][60]\n\nJenner being interviewed by Hayu. in 2017\n\nIn February 2016, Jenner's cosmetic company was renamed to Kylie Cosmetics and the number of kits produced rose from an initial 15,000 to 500,000.[62] Jenner released a three-minute-long promotional video for a series of lip glosses in March 2016, directed by Colin Tilley and starring fellow models Karin Jinsui, Mara Teigen, and Jasmine Sanders.[63][64][65][66][67] The song in the video was revealed to be \"Three Strikes\" by Terror Jr, a band created on the same day as the release of the video; however, the lead singer, who was later revealed to be singer Lisa Vatale,[68] was heavily speculated to be Jenner herself.[69][70][71][72] However, Jenner subsequently denied any involvement with the band.[73][74] In May 2016, she made her musical debut rapping on producer Burberry Perry's song \"Beautiful Day\", with Lil Yachty, model Jordyn Woods, and Justine Skye.[75] In fall of 2016, Jenner was announced to be the new face of PUMA along with Rae Sremmurd.[76] In April 2017, she made a surprise appearance at the Rio Americano High School prom in Sacramento alongside junior Albert Ochoa after hearing that his date had turned him down.[77][78][79]\n\nIn June 2017, Jenner announced two new cosmetics sets in collaboration with her sister Khloe Kardashian and the Kylie Cosmetics KoKo collection.[80] Later that month, Jenner was accused of stealing designs for a series of camouflage items released on her online store from independent design label PluggedNYC, whose creative director supported the claims.[81][82][83][84] Later that June, Jenner was placed at number 59 on the Forbes Celebrity 100, which calculates the 100 highest-paid celebrities of the previous 12 months, after earning approximately US$41,000,000, making her the youngest person on the list at 19 years old.[10] Jenner collaborated with Melbourne-based sunglasses brand Quay Australia[85][86] to release a line of sunglasses, Quay x Kylie.[87][88][89] In 2018, the company Kylie Cosmetics has reportedly sold about $630 million worth of makeup.\n\nJenner stars in a reality show revolving around her life, Life of Kylie, which premiered in August 2017.\n\n2019–present: Debut of Kylie Skin\n\nIn April 2019, Jenner and her sister Kim Kardashian' KKW Beauty were teaming up to launch a new fragrance. This collaboration became Jenner's first foray into fragrance and it launched on April 26.[90] In 2019, Jenner founded her own skincare brand Kylie Skin which was launched on May 22, 2019.[91][92] The brand began producing dermis products, including face washes, scrubs, moisturizers and makeup removing wipes. In September, Jenner announced that she's serving as the makeup artistic director for Balmain's Spring 2020 runway show at Paris Fashion Week. To celebrate the new line, Kylie Cosmetics and Balmain launched a capsule makeup collection and available on September 27, the day of the show, on the Kylie Cosmetics website. This is marked the first time Jenner collaborated on a makeup collection with someone outside of her family's inner circle.[93] However, she was cancelled her appearance at Paris Fashion Week because she was too ill to travel to Paris for work and received treatment for flu-like symptoms in a hospital.[94] In October 2019, Jenner filed to trademark the phrase \"rise and shine,\" a line that became a meme when footage of Jenner singing the phrase to her 1-year-old daughter, Stormi, went viral. [95] The hashtag #RiseandShine reached one billion views on TikTok, making it the platform's fastest-growing hashtag trend. [96] In addition to the standard \"rise and shine,\" Jenner also wants to trademark \"riiise and shiiinnee.\" [97] The latter trademark would cover clothing while the former would also apply to cosmetics.[98][99]\n\nIn January 2020, Jenner had announced she has the following brands Kylie Con Kylie Kon Kylie Museum for more profit for being the world's youngest billionaire.[100]\n\nAs of April 8, 2020, Jenner is officially still the world’s youngest self-made billionaire in second year in a row, her current net worth now being at $1.2 billion.[101]\n\nPersonal life\n\nJenner dated rapper Tyga, from 2014 to 2017.[102][103][104][105] Jenner and rapper Travis Scott started dating in April 2017.[106] They have one daughter.[107] They separated in September 2019.[108]\n\nWealth\n\nIn March 2019, Forbes Magazine included Jenner on its list of billionaires. Apart from her TV career that began with Keeping Up with the Kardashians, Jenner's bulk wealth also comes from her make-up company, Kylie Cosmetics, valued at $900 million.[109]\n\nControversies\n\nKendall + Kylie \"Rock vs. Rap\" collection\n\nOn June 28, 2017, the Jenner sisters announced that they would be releasing a line of vintage T-shirts for their Kendall + Kylie line of clothing called Rock vs. Rap,[110][111] featuring the likenesses of various rock and rap artists[112] including The Notorious B.I.G., Tupac Shakur, Metallica, Pink Floyd, The Doors, Ozzy Osbourne, and Led Zeppelin, with pictures of the Jenner sisters superimposed over them.[110] The announcement of this line of products was met with swift backlash from relatives and representatives of the figures depicted on the shirts themselves, including Sharon Osbourne,[113] Jim Jampol,[114][115] and Voletta Wallace, mother of Biggie Smalls.[116] They were also criticized on social media and were called \"insensitive.\"[117] Wallace, The Doors' manager and the estate of Jim Morrison issued a cease-and-desist letter to the Jenner sisters, writing that they did not authorize the sisters' use of the likenesses of these musical icons.[118][119] The Jenners apologized for the shirts, and pulled them from retail.[110]\n\nForbes cover\n\nJenner appeared on the cover of the August 2018 issue of Forbes. They estimated that she had a net worth of $900 million, and that she was on the verge of becoming the youngest \"self-made\" billionaire.[120] This would beat out Mark Zuckerberg, who became a billionaire at age 23.[121] However, the publication's use of the term \"self-made\" sparked widespread criticism and jokes online.[122] Critics argued that Jenner was already born into fame and fortune.[123] The Dictionary.com Twitter handle cheekily defined the term \"self-made.\"[124] Comedian Fat Jew started a GoFundMe page to help Kylie Jenner earn another $100 million so that she would officially become a billionaire.[125] Comedian Michelle Wolf had a viral stand-up comedy act related to how Jenner earned her fame and success.[126] Some discussions took a more serious tone, with journalists writing pieces on wealth distribution, inequality and inheritance, as well as upward mobility in society.[127][128][129] However, celebrities such as Jenner's half-sister Kim Kardashian and socialite Paris Hilton have come out and defended Jenner, legitimizing assertions that she is indeed self-made, while Hilton also described herself as self-made.[130][131] Jenner responded that “The self-made thing is true ... My parents told me I needed to make my own money, it's time to learn how to save and spend your own money, stuff like that. What I'm trying to say is, I did have a platform, but none of my money is inherited.”[123][132]\n\nLawsuits and civil disputes\n\n\"Kylie\" trademark\n\nIn February 2017, Australian singer Kylie Minogue won a legal battle against Jenner for name trademark \"Kylie\". Jenner had filed a U.S. trademark application for use of the name \"Kylie\" for \"advertising services\" and \"endorsement services\" in 2015.[133]\n\nVlada Haggarty\n\nIn January 2017, make-up artist Vlada Haggarty claimed that Jenner had stolen the creative style and aesthetic of her own work, such as the dripping gloss lip and golden finger tips, for her own products, and that Jenner had a history of taking Haggerty's original dripping lip art and passing it off as her own. Jenner later credited Vlada on social media and her work on the creation of the logo and an undisclosed settlement was paid to avoid any future legal issues.[134][135][136]\n\nNeon lip logo\n\nSara Pope, a British painter whose work has been featured in art galleries in several cities across the globe, filed a lawsuit against Jenner and NBC Universal for the use of a neon lip logo. Pope stated that Jenner posted to her social media accounts an image that was remarkably similar to Pope's most famous piece, \"Temptation Neon\" and used it to promote Jenner's TV series Life of Kylie. TMZ reported that the production art created for the series, including the lip design, was created by a third party designer.[137]\n\nFilmography\n\nTelevision\n\nMusic videos\n\nFilm\n\nAs an actress Year Title Role Notes Ref. 2018 Ocean's 8 Cameo [156]\n\nAwards and nominations\n\nNotes\n\nReferences", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Kylie_Jenner_for_Nip_%2B_Fab.jpg/220px-Kylie_Jenner_for_Nip_%2B_Fab.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/Kylie_Jenner_March_2020.png/220px-Kylie_Jenner_March_2020.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/e/ee/Kylie_Jenner_March_2020.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikibooks-logo.svg/27px-Wikibooks-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Kylie_Jenner1_%28cropped%29.png/220px-Kylie_Jenner1_%28cropped%29.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/e/ee/Kylie_Jenner_March_2020.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Kylie_Jenner", "title": "Kylie Jenner", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/e/ee/Kylie_Jenner_March_2020.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}