{"url": "www.elitedaily.com/p/are-david-victoria-beckham-divorcing-the-soccer-star-shut-down-the-rumors-9340372", "text": "The past couple months have been devastating for anyone who follows the love lives of the Hollywood elite. Iconic couples — from Channing Tatum and Jenna Dewan to John Cena and Nikki Bella — have been calling it quits left and right. And this morning, Twitter was on fire with speculation that another famous couple was on the way to Splitsville — Victoria and David Beckham! *GASP* What? Noooooo. So, are David and Victoria Beckham divorcing? The answer is no, according to a statement David's rep gave to Mirror Online.\n\n\"There is no statement due or divorce,\" the rep said, slamming the rumors with one sentence. \"This is just fake social media news. This is all very bizarre and an embarrassing waste of time.\" Elite Daily reached out to David's team for comment on the report, but did not hear back by the time of publication.\n\nHow did these rumors start? Well, does it really matter? It seems like rumors that David and Victoria are divorcing pop up every other year. So it seems we're right on schedule.\n\nBut, just for your information, it seems the spark that lit the fire under this round of speculation came when whispers that David was cheating on Victoria with their daughter, Harper's, teacher (and that she's supposedly now pregnant with his child) hit Twitter. Elite Daily reached out to David and Victoria's teams for comment on the cheating rumors, but did not hear back by the time of publication.\n\nAccording to Mirror Online, \"bookies suspended betting on news of them splitting following thousands of tweets claiming the couple would be putting out a statement.\" Which, is, like, the saddest sentence I've ever read. Who bets on the downfall of someone's marriage?! Come on now. Be better.\n\nTwitter is currently freaking out.\n\nBut the denial from David's rep is pretty strong. And if you've been keeping an eye on the Beckham's social media pages, Victoria made things pretty clear in the early hours of June 8 when speculation was running rampant on Twitter, that she and David are totally and utterly fine. She shared a photo cuddling with Harper and captioned it, \"Morning cuddles x So much love 🙏🏻 We love and miss u @davidbeckham 💕💕💕💕.\"\n\nCan we crown Victoria the queen of sub-Instagramming right here and now? I mean, there's so much going on in this Instagram. Like, first of all, she's cuddling with Harper, her daughter whose teacher is being wrapped up in all this drama. And then, she tagged her hubby and said she misses him hardcore, which, I assume, she wouldn't have said he was a lowdown, good-for-nothing cheater.\n\nAnyway, like I said, this couple is no stranger to divorce rumors. Back in February 2017, when they were dealing with rumors that they were only together because of their bazillion-dollar brand (see a pattern here?), David shut them down hard.\n\nIn February, David told BBC Radio listeners,\n\nOf course, you make mistakes over the years, and we all know marriage is difficult at times. It's about working through it. We know each other better than anybody. People have talked about, 'Do we stay together because it's a brand?' Of course not. We stay together because we love each other, because we have four amazing children.\n\nAt the end of the day, David and Victoria have been happily married for 19 years and have four amazing children together: Brooklyn (19), Romeo (15), Cruz (13), and Harper (6).\n\nAnd, for the record, Victoria never runs out of beautiful things to say about her soccer-star husband, either.\n\nBack in 2017, the former Spice Girl told Today host Savannah Guthrie,\n\nI'm lucky that David is the most fantastic father and husband, and he's great. We're very equal at home, and we're a really, really good team… He's the most incredible husband, fantastic father. He inspires me every day. Not just seeing him with the children and how he treats me. It just works. We're lucky to have each other.\n\nWatch her gushing about David below:\n\nNow, can y'all just let these perfect angels be happy?", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/image/2020/4/15/77bee980-e9e8-4a76-80c2-acd01f4d9518-lead-image-14.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/6/8/48516a94-a1c1-442d-ac80-cf223e796544-fd8ebaae-2c49-4fbd-b7a5-f768a69720af-getty-906435834.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/15/5ea01bc9-0167-42e8-9f98-8f47129bfdeb-getty-1189258123.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/6/8/48516a94-a1c1-442d-ac80-cf223e796544-fd8ebaae-2c49-4fbd-b7a5-f768a69720af-getty-906435834.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/8/e79041e7-7bc4-47d4-9485-a73ad7cb42df-getty-1193822459.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/uploads/image/2018/6/8/48516a94-a1c1-442d-ac80-cf223e796544-fd8ebaae-2c49-4fbd-b7a5-f768a69720af-getty-906435834.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/are-david-victoria-beckham-divorcing-the-soccer-star-shut-down-the-rumors-9340372", "title": "Are David & Victoria Beckham Divorcing? The Soccer Star Shut Down The Rumors", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/are-david-victoria-beckham-divorcing-the-soccer-star-shut-down-the-rumors-9340372", "type": "article", "title": "David Beckham Just Shut Down Rumors About Him & Victoria Divorcing With One Statement", "description": "The past couple months have been devastating for anyone who follows the love lives of the Hollywood elite. Iconic couples — from Channing Tatum and Jenna Dewan to John Cena and Nikki Bella — have been calling it quits left and right. And this…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/6/8/48516a94-a1c1-442d-ac80-cf223e796544-fd8ebaae-2c49-4fbd-b7a5-f768a69720af-getty-906435834.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "The past couple months have been devastating for anyone who follows the love lives of the Hollywood elite. Iconic couples — from Channing Tatum and Jenna Dewan to John Cena and Nikki Bella — have been calling it quits left and right. And this…"}, "movies": [], "publish_date": null, "source": "http://www.elitedaily.com", "summary": ""}