{"url": "en.wikipedia.org/wiki/Margot_Robbie", "text": "Australian actress and film producer\n\nMargot Elise Robbie ( MAR-goh ROB-ee; born 2 July 1990) is an Australian actress and film producer. She has received nominations for two Academy Awards and five BAFTA Awards. In 2017, Time magazine named her one of the 100 most influential people in the world, and in 2019, she was ranked among the world's highest-paid actresses.\n\nRobbie studied drama at Somerset College and began her career in Australian independent films in the late 2000s, before working in the soap opera Neighbours (2008–2011). After moving to America, she starred in the ABC drama series Pan Am (2011–2012) and had her breakthrough role in Martin Scorsese's black comedy The Wolf of Wall Street (2013). Robbie's profile continued to grow with starring roles as a grifter in Focus (2015), Jane Porter in The Legend of Tarzan (2016), and Harley Quinn in the DC Extended Universe, beginning with Suicide Squad (2016).\n\nRobbie gained critical praise and nominations for the BAFTA Award and Academy Award for Best Actress for portraying the disgraced figure skater Tonya Harding in the biopic I, Tonya (2017). This acclaim continued for her roles as Queen Elizabeth I in the period drama Mary Queen of Scots (2018), Sharon Tate in the comedy-drama Once Upon a Time in Hollywood (2019), and a fictional Fox News employee in the drama Bombshell (2019). She received BAFTA Award nominations for all three and a nomination for the Academy Award for Best Supporting Actress for the lattermost.\n\nRobbie is married to the filmmaker Tom Ackerley. They are among the founders of the production company LuckyChap Entertainment, under which she has produced some of her films and the television series Dollface (2019).\n\nEarly life\n\nMargot Elise Robbie was born on 2 July 1990 in Dalby, Queensland, and grew up in the Gold Coast hinterland.[1][2][3] Her parents are Sarie Kessler, a physiotherapist, and Doug Robbie, a former farm owner.[4][3][5] She has three siblings: brothers Lachlan and Cameron; and a sister, Anya.[5][6][7] Robbie grew up on a farm,[8] where she and her siblings were raised by their single mother; she has minimal contact with her father.[4][9] To make ends meet, Robbie worked three jobs simultaneously at the age of 16: she tended bar, cleaned houses, and worked at Subway.[4][10] She studied drama at school,[4] graduating at Somerset College.[11] At the age of 17, Robbie moved to Melbourne to begin acting professionally.[12][13]\n\nCareer\n\n2007–2012: Career beginnings and Neighbours\n\nRobbie has been acting professionally since 2007, when she starred in the films ICU and Vigilante. After impressing the director with her performance during an audition, she won the lead in I.C.U. without an agent at the time.[2] Robbie also acted in commercials and had guest roles in The Elephant Princess as Juliet and City Homicide as Caitlin Brentford.[14][15] Robbie began appearing as Donna Freedman on Neighbours from June 2008.[2] The character was originally only a guest role, but she was soon promoted to a regular cast member.[16] In an interview with Digital Spy, Robbie said she had gone on a snowboarding holiday to Canada with her boyfriend soon after auditioning, but had to return after only two days when told that she had won the role.[17]\n\nIn early 2009, Robbie appeared in various Network Ten promotions, featuring an ensemble of popular Australian faces on the network. In July 2009, she filled the \"Generation Y\" guest spot on the Network Ten show Talkin' 'Bout Your Generation. Robbie also became a youth ambassador for missing persons as part of National Youth Week.[18] In the same year, Robbie was nominated for Most Popular New Female Talent at the Australian Logie Awards.[19] She was also nominated for Favorite Hottie at the Nickelodeon Kids Choice Awards and was up against her Neighbours co-star Dean Geyer.[20] In September 2010, Robbie announced that she was to leave Neighbours after almost three years to pursue an acting career in Hollywood.[21] Her final scenes aired on 26 January 2011 and in April of that year, Robbie was nominated for Most Popular Actress at the Logie Awards.[22]\n\nAfter arriving in Los Angeles for pilot season, Robbie auditioned for the new series of Charlie's Angels.[23] However, the producers at Sony Pictures Television preferred her for a role in ABC drama series Pan Am alongside Christina Ricci.[23] Robbie landed the role of Laura Cameron, a newly-trained flight attendant.[24] Pan Am was cancelled after one season due to falling ratings, despite receiving positive reviews from critics.[25]\n\n2013–2016: Breakthrough\n\nRobbie joined the cast of Richard Curtis' romantic comedy About Time (2013) alongside Domhnall Gleeson, Rachel McAdams and Bill Nighy.[25] About Time was released in the United Kingdom on 4 September 2013 and in the United States on 1 November 2013. The film received positive reviews[27] and grossed $87 million on its $12 million budget.[28] Robbie's international breakthrough came when she was cast in Martin Scorsese's The Wolf of Wall Street in the role of Naomi Belfort, the wife of protagonist Jordan Belfort, played by Leonardo DiCaprio.[29][30] Garnering positive reviews, it became a commercial success with a worldwide gross of $392 million, making it Scorsese's highest-grossing film.[31] The film was subsequently nominated for five Academy Awards, including Best Picture.[32] Robbie's performance was praised by critics for her Brooklyn accent.[33] Critic Sasha Stone wrote, \"She's Scorsese's best blonde bombshell discovery since Cathy Moriarty in Raging Bull. Robbie is funny, hard and kills every scene she's in.\"[34] She received a nomination for the MTV Movie Award for Best Breakthrough Performance[35] and won the Empire Award for Best Newcomer.[36] In 2014, Robbie founded her own production company, LuckyChap Entertainment.[37]\n\nIn 2015, Robbie starred opposite Will Smith in the romantic comedy-drama film Focus. In the film, she plays an inexperienced grifter learning the craft from Smith's character.[38] The film was released on 27 February 2015 to generally mixed reviews.[39] However, Robbie's performance was praised. Peter Travers of Rolling Stone wrote, \"Robbie is a wow and then some. The Aussie actress who made us sit up and take notice as Leonardo DiCaprio's wife in The Wolf of Wall Street shows a comic flair backed up with beauty and steel. Even when Focus fumbles, Robbie deals a winning hand.\"[40] Focus grossed over $150 million worldwide.[41][42] In 2015, Robbie received a nomination for the BAFTA Rising Star Award.[43] Also in 2015, Robbie played the leading role of Ann Burden in the film adaptation of Z for Zachariah with Chris Pine and Chiwetel Ejiofor, which was shot in New Zealand.[44][45] The film premiered on 24 January 2015 at the Sundance Film Festival[46] and had its theatrical release on 28 August 2015, receiving positive reviews.[47][48] Robbie's performance was praised by critics. Drew McWeeny of HitFix wrote, \"Robbie's work here establishes her as one of the very best actresses in her age range today.\"[49]\n\nRobbie appeared in a documentary special celebrating Neighbours' 30th anniversary titled Neighbours 30th: The Stars Reunite, which aired in Australia and the UK in March 2015.[50][51] She also appeared in Suite Française (2015) alongside Michelle Williams, Kristin Scott Thomas and Matthias Schoenaerts, an adaptation of Irène Némirovsky's novel.[52] The film received positive reviews.[53] Robbie made a cameo appearance in Adam McKay's comedy-drama The Big Short, released on 11 December 2015.[54]\n\nRobbie co-starred with Tina Fey in Whiskey Tango Foxtrot, a film adaptation of The Taliban Shuffle.[55] She plays Tanya Vanderpoel, a British TV journalist.[56] The film also stars Martin Freeman and Alfred Molina[57] and was released on 4 March 2016 by Paramount Pictures.[58][59] Later that year, Robbie starred as Jane Porter in David Yates's The Legend of Tarzan, opposite Alexander Skarsgård, Samuel L. Jackson and Christoph Waltz. The film was released on 1 July 2016.[44][60]\n\nRobbie's third 2016 role was Harley Quinn in Warner Bros.' DC Comics supervillain film Suicide Squad,[61][62] as part of an ensemble cast that includes Will Smith, Jared Leto, Viola Davis and Joel Kinnaman. Principal photography commenced on 13 April 2015,[63] and the film was released on 5 August 2016.[64] Although the film received generally negative reviews, Robbie's performance as Quinn was widely praised.[65][66]\n\nRobbie hosted the season 42 premiere of Saturday Night Live on 1 October 2016, with musical guest The Weeknd.[67] She was scheduled to voice a character in the DreamWorks Animation Larrikins,[68] before the project was cancelled.[69]\n\n2017–present: Critical recognition\n\nIn 2017, Robbie starred alongside Domhnall Gleeson in Goodbye Christopher Robin as Daphne de Sélincourt, wife of author A. A. Milne.[70][71] She next portrayed the American figure skater Tonya Harding in I, Tonya, written by Steven Rogers and directed by Craig Gillespie.[72][73] Reviewing the film for The Boston Globe, Ty Burr wrote, \"Robbie is taller, bigger than the tiny, fierce Harding, but she gets the athlete's forward drive, and the anger that seemed to fuel the dynamo, and when life hands Tonya lemons, Robbie sets her jaw and bears down.\"[74] For her portrayal of Harding, Robbie was nominated for the Golden Globe Award for Best Actress – Motion Picture Comedy or Musical[75] and the Academy Award for Best Actress.[76] She was the first actress nominated for an Academy Award for playing a real Olympic athlete.[77] That year, Time magazine named her as one of the 100 most influential people in the world, and Forbes featured her on its 30 Under 30 list.[78][79]\n\nIn 2018, Robbie voiced the character of Flopsy Rabbit in the animated/live-action film Peter Rabbit, an adaptation of the Beatrix Potter book series.[80] She then starred in Vaughn Stein's thriller film Terminal as Annie.[81] She then made a cameo appearance as Audrey in Slaughterhouse Rulez,[82] and portrayed Queen Elizabeth I in Mary Queen of Scots, opposite Saoirse Ronan as Mary Stuart.[83] David Sims of The Atlantic dismissed the latter film as a \"tawdry soap opera\" but wrote that \"with her little screen time, [Robbie] still manages to convey a real sense of resentment over Mary's status as a more traditional queen.\"[84] She received BAFTA and Screen Actors Guild Awards nominations for Best Supporting Actress.[85][86]\n\nRobbie began 2019 by starring as a femme fatale in Dreamland, a period crime thriller set during the 1930s Dust Bowl, which she also produced.[87] She next agreed to portray the actress Sharon Tate in Quentin Tarantino's comedy-drama Once Upon a Time in Hollywood, starring Leonardo DiCaprio and Brad Pitt, due to her desire to work with Tarantino. To prepare, she read the autobiography Roman by Polanski, by Roman Polanski, who was married to Tate.[88][89] Peter Bradshaw of The Guardian wrote that despite a lack of female roles in the film, \"Robbie gives a sympathetic portrayal of Tate,\" and Robbie Collin of The Daily Telegraph considered a sequence in which Tate watches her own performance in a cinema to be the film's \"most delightful\" scene.[90][91] She also served as an executive producer on the Hulu comedy series Dollface.[92] That year, Forbes ranked her as the eighth highest-paid actress in the world, with an annual income of $23.5 million, and The Hollywood Reporter listed her among the 100 most powerful people in entertainment.[93][94]\n\nRobbie played Kayla Pospisil, a composite character based on several Fox News employees, in the drama Bombshell (2019), which centres on the stories of various female personnel at the news network and their reports of sexual harassment by the network's chairman Roger Ailes.[95] In preparation, she created a fake Twitter account to follow conservative young women, and watched videos of Katherine Harris, on whom she based her character's accent.[96] Taking particular note of an \"excruciating scene\" in which her character is sexually harassed, Owen Gleiberman of Variety credited the actress for \"let[ting] us feel the pressure-cooker agony of what's going on inside her.\"[97] Manohla Dargis of The New York Times also opined that \"it is Robbie — with her panicked, darting eyes and tensely resistant, then capitulating physicality — who conveys the horror of sexual harassment.\"[98] She received two BAFTA nominations for her performances in Once Upon a Time in Hollywood and Bombshell, and for the latter film, she was also nominated for the Academy Award for Best Supporting Actress, Golden Globe Award for Best Supporting Actress – Motion Picture and Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Supporting Role.[99][100][101][102]\n\nRobbie began the new decade by producing the drama thriller film Promising Young Woman (2020), directed by Emerald Fennell and starring Carey Mulligan.[103] After having pitched the idea of a Harley Quinn film featuring the Birds of Prey team to Warner Bros. in 2015, she spent three years developing the project under her production company.[104] The film, titled Birds of Prey and directed by Cathy Yan, was released in 2020 to critical praise.[105] Leah Greenblatt of Entertainment Weekly commended Robbie for playing Quinn with a \"giddy mix of mad-dog ruthlessness and girlish glee.\"[106]\n\nUpcoming projects\n\nRobbie will next reprise her role as Quinn in The Suicide Squad and her voice role as Flopsy Rabbit in Peter Rabbit 2: The Runaway.[107][108] She has committed to star in and produce an adaptation of Matt Ruff's thriller novel Bad Monkeys, and to portray Maid Marian in an upcoming biopic.[109][110] She will also feature in Justin Kurzel's war thriller Ruin, in a live-action Barbie film co-written and directed by Greta Gerwig, and in David O. Russell's as-yet untitled drama co-starring Christian Bale.[111][112][113]\n\nPersonal life and other work\n\nRobbie met British assistant director Tom Ackerley on the set of Suite Française in 2014,[4] and in December 2016, they married in a private ceremony in Byron Bay, New South Wales.[114][80] She and Ackerley previously lived in London with five other friends in a three-bedroom house.[115] They have since moved to Los Angeles.[116]\n\nIn May 2016, Calvin Klein announced Robbie would be the face of its Deep Euphoria fragrance.[117] In 2017, Robbie appeared in a commercial promoting Nissan electric vehicles.[118] In February 2018, Robbie was announced as an ambassador for the luxury fashion brand Chanel.[119] She was the last brand ambassador picked by Karl Lagerfeld before his death in February 2019.[120] Robbie later became the face of the company's fragrance Chanel Gabrielle Chanel Essence.[120] She was ranked as one of the best dressed women in 2018 by fashion website Net-a-Porter.[121]\n\nFilmography\n\nI, Tonya in Sydney, 2018 Robbie at the Australian premiere ofin Sydney, 2018\n\nFilm\n\nKey Denotes films that have not yet been released\n\nTelevision\n\nReferences\n\nFurther reading", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Brad_Pitt%2C_Margo_Robbie%2C_and_Leonardo_DiCaprio_2019_by_Glenn_Francis.jpg/260px-Brad_Pitt%2C_Margo_Robbie%2C_and_Leonardo_DiCaprio_2019_by_Glenn_Francis.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Margot_Robbie_by_Gage_Skidmore.jpg/170px-Margot_Robbie_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Margot_Robbie_at_Somerset_House_in_2013_%28cropped%29.jpg/1200px-Margot_Robbie_at_Somerset_House_in_2013_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Margot_Robbie_at_Somerset_House_in_2013_%28cropped%29.jpg/220px-Margot_Robbie_at_Somerset_House_in_2013_%28cropped%29.jpg", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/57/SYDNEY%2C_AUSTRALIA_-_JANUARY_23_Margot_Robbie_arrives_at_the_Australian_Premiere_of_%27I%2C_Tonya%27_on_January_23%2C_2018_in_Sydney%2C_Australia_%2828074883999%29_%28cropped_2%29.jpg/170px-thumbnail.jpg", "http://upload.wikimedia.org/wikipedia/commons/3/37/Dagger-14-plain.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Margot_Robbie_%28cropped%29.jpg/170px-Margot_Robbie_%28cropped%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Margot_Robbie_at_Somerset_House_in_2013_%28cropped%29.jpg/1200px-Margot_Robbie_at_Somerset_House_in_2013_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Margot_Robbie", "title": "Margot Robbie", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Margot_Robbie_at_Somerset_House_in_2013_%28cropped%29.jpg/1200px-Margot_Robbie_at_Somerset_House_in_2013_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}