{"url": "https://www.vulture.com/2018/01/crazy-ex-girlfriend-the-fit-hot-guys-striptease-song.html", "text": "Photo: Greg Gayne/THE CW\n\nIn classic Crazy Ex-Girlfriend fashion, it’s the men of the show who usually get ogled and objectified. But in Friday’s episode, White Josh (David Hull), Nathaniel (Scott Michael Foster), and Josh Chan (Vincent Rodriguez III) perform a Magic Mike–inspired send-up that pushes the joke to its funniest end yet. It’s called “Fit Hot Guys Have Problems Too” and it hits the sweet spot of funny, sexy, and sad.\n\nIn the episode, White Josh and Nathaniel form an unlikely pair after commiserating together over their recent breakups. In the spirit of bro-ing out, they decide to work out and then hit a gay club. “WhiJo takes Nathaniel to a gay club because he’s like, ‘Gay bars are overrun with women from bachelorette parties appropriating gay culture for their own amusement!’” said David Hull, the actor who plays White Josh. Soon enough, they’re jumping onstage and ripping off their shirts, determined to convince the world that it’s a lot harder to be hot, fit, and handsome than it looks.\n\n“It used to be called ‘Hot White Guys Have Problems Too,’ which is obviously funny, but they decided to add Vinnie to it, so he comes in for the last chorus,” Hull said. “It’s now ‘Fit Hot Guys Have Problems Too,’ about how no one understands our struggle.”\n\nThe production took place on location at a club in Hollywood that Scott Michael Foster said could only be described as a “goth bar.” “There were chains everywhere, open books suspended on filament wires hanging from the ceiling, and evil shit everywhere,” he said. “I never understood it, but apparently it’s a thing.” The CXG crew packed the club with around 150 background actors and sent Hull, Foster, and Rodriguez to a spray tanner beforehand. “We just go to a stranger’s house. She says, ‘Jump in the shower and take your clothes off, I’ll be in in a second and do as you’re told!’” Hull said. “I guess people are doing that all the time in this town. I gotta say, it looked great!”\n\nEven though the shoot only took half a day, the trio took a lot longer getting their abs camera-ready. “They knew that they wanted to do a strip number from the beginning of the season, so they were like, ‘Just know you’re going to be shirtless and maybe pantless in episode nine,’” said Foster. “I basically had about 12 weeks.” That meant diets, trainers, and sadly for David Hull, cutting out most of his snacking.\n\nFor Vincent Rodriguez III, it was also a callback to his past as a go-go boy, working bars in Chicago and Provincetown while he was doing theater productions. “I wasn’t making that much money at the time. I had like five other jobs to help survive and pay my bills,” he said. “I’ve been a bartender, and I did the bartending episode. I’ve been a go-go boy, and now I’m doing a go-go boy episode. Art imitates life.”\n\nUnlike Josh Chan, though, Rodriguez wasn’t quite as successful a dancer. In P-town, he worked at a bar where he was paid only in tips. “I think my lowest night was three hours of switching boxes with another dancer and I made two dollars. I’ve been there, I’ve done that,” he said. “Thankfully [Josh] is better at it than I. He obviously made more money doing it. It wasn’t something for me in my real life that I wanted to pursue. It was a way to make ends meet and basically pay for my art.”\n\nBack on the CXG set, once it was all said and stripped away, showrunner Aline Brosh McKenna had pizza waiting for each actor when they wrapped for lunch. Foster also got a pack of Arrogant Bastard ale, and Rodriguez found a gift basket filled with chips, candy, and cookies waiting for him in his trailer. “I said I would love to have a pizza waiting for me in my trailer the minute that scene ends. Because I had to shoot the rest of the day, but I had my clothes on, you know?” said Foster. “So I had pizza at lunch, and then when we were done with the day I cracked a beer and it felt great.”\n\nThat just leaves one question: Are they still hitting the gym after getting stripper bods? “I’ve gained a lot of weight since then,” said Foster. “I know Vinnie went hard and kept it up, which is good for him, but I was like, you know what? That’s done. I want my pizza and my beer back. So I’ve got my winter body in full swing.”", "images": ["https://pixel.nymag.com/imgs/daily/vulture/2018/01/10/10-crazy-ex-girlfirend.w700.h700.jpg", "https://pyxis.nymag.com/v1/imgs/301/897/ae47c6b103c2154007817f8408f36d2967-10-crazy-ex-girlfirend.1x.rsocial.w1200.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pyxis.nymag.com/v1/imgs/301/897/ae47c6b103c2154007817f8408f36d2967-10-crazy-ex-girlfirend.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["E. Alex Jung"], "canonical_link": "https://www.vulture.com/2018/01/crazy-ex-girlfriend-the-fit-hot-guys-striptease-song.html", "title": "How the ‘Fit Hot Guys’ of Crazy Ex-Girlfriend Shot Their Half-Naked Strip Scene", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "How the ‘Fit Hot Guys’ of Crazy Ex-Girlfriend Shot Their Half-Naked Strip Scene", "url": "https://www.vulture.com/2018/01/crazy-ex-girlfriend-the-fit-hot-guys-striptease-song.html", "description": "“I’ve been a go-go boy, and now I’m doing a go-go boy episode. Art imitates life.”", "image": "https://pyxis.nymag.com/v1/imgs/301/897/ae47c6b103c2154007817f8408f36d2967-10-crazy-ex-girlfirend.1x.rsocial.w1200.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "How the ‘Fit Hot Guys’ of CXG Shot Their Strip Scene", "description": "“I’ve been a go-go boy, and now I’m doing a go-go boy episode. Art imitates life.”", "image": "https://pyxis.nymag.com/v1/imgs/301/897/ae47c6b103c2154007817f8408f36d2967-10-crazy-ex-girlfirend.2x.rsocial.w600.jpg", "card": "summary_large_image", "creator": "@e_alexjung", "site": "@vulture"}, "article": {"published_time": "2018-01-12T23:00:00.000-05:00", "tag": "crazy ex girlfriend, crazy ex girlfriend season 3, vincent rodriguez iii, david hull, scott michael foster, tv, fit hot guys have problems too", "publisher": "https://www.facebook.com/Vulture"}, "description": "White Josh (David Hull), Nathaniel (Scott Michael Foster), and Josh Chan (Vincent Rodriguez III) perform a ‘Magic Mike’–inspired song in ‘Crazy Ex-Girlfriend’ season 3. Here’s how they prepared to strip for ‘Fit Hot Guys Have Problems Too.’", "sailthru.tags": "crazy ex girlfriend, crazy ex girlfriend season 3, vincent rodriguez iii, david hull, scott michael foster, tv, fit hot guys have problems too", "author": "E. Alex Jung", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://cache.nymag.com/media/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1515816000.0, "source": "https://www.vulture.com", "summary": ""}