{"url": "https://www.cosmopolitan.com/entertainment/celebs/a13819903/best-royal-moments-2017/", "text": "It's been another eventful year for the British royal family, from Princess Charlotte's first royal curtsy to the 70th wedding anniversary of her great grandparents, Queen Elizabeth II and Prince Philip. There's also another royal baby on the way for Kate Middleton and Prince William, along with a royal wedding to look forward to in 2018. Below, a look back at some of the more exciting moments from Buckingham Palace, Kensington Palace, and beyond.\n\n1. When Kate, Will, and Harry raced each other to promote mental health (February 5)\n\nAs part of their Heads Together organization, Their Royal Highnesses hit the running track at Olympic Park with folks training for the 2017 London Marathon. While Kate was the only one properly dressed for the race, she finished last.\n\n2. When Kate and Will looked like a million bucks at the 70th EE British Academy Film Awards (February 12)\n\nGetty\n\nKate’s off-the-shoulder gown, complete with a gorgeous bouquet print, was made possible by one of her favorite fashion houses, Alexander McQueen. Prince William looked pretty great in his tux, too.\n\n3. When Queen Elizabeth met an elephant (April 10)\n\nGetty\n\nYes, that’s the Queen feeding a banana to Donna the elephant. The Duke of Edinburgh was also on hand to help open the new Centre for Elephant Care at Whipsnade Zoo, the UK's biggest zoo, in Bedfordshire, England.\n\n4. When Kate was photographed curtsying to Queen Elizabeth on Easter Sunday (April 16)\n\nGetty\n\nAs per royal etiquette, one should curtsy upon seeing the Queen for the first time on any given day. This meeting generally takes place behind closed doors, so royal enthusiasts welcomed this photograph, which also showed William bowing, with open arms.\n\n5. When William and Lady Gaga FaceTimed to talk about mental health (April 18)\n\nThe Duke of Cambridge and @LadyGaga join forces to encourage more people to speak openly about their mental health #OKtosay pic.twitter.com/kCuQyS3Svn — Kensington Palace (@KensingtonRoyal) April 18, 2017\n\nAs part of Kate, William, and Harry’s latest #oktosay series with their Heads Together campaign, William and Lady Gaga opened up about their personal struggles in a four-minute video call, which was shared on the singer and the Prince’s social media platforms. “For me, the little bits that I’ve learnt so far is that it’s really important to have this conversation. You won’t be judged,” William said in the clip.\n\n6. When Kate, William, and Harry cheered on runners at the 2017 London Marathon (April 22)\n\nImagine getting a (foam) high five from the Duchess of Cambridge while clocking in another mile! At one point, a runner squirted some water at Prince William, who definitely did not see the droplets coming.\n\n\n\nGetty\n\nGetty\n\n7. When the Cambridges unveiled a new Princess Charlotte photo ahead of her 2nd birthday (April 30)\n\nHRH The Duchess of Cambridge via Getty Images\n\nCourtesy of budding photographer, the Duchess of Cambridge.\n\n\n\n8. When Prince George and Princess Charlotte stole the show at their Aunt Pippa’s wedding to James Matthews (May 19)\n\nGetty\n\nGetty\n\nBRB squealing over these precious photos for the 29th time.\n\n9. When Prince George and Princess Charlotte stole the show at the annual Trooping the Colour ceremony (June 17)\n\nGetty\n\nGetty\n\nCharlotte and George looking at planes is too cute for words.\n\n10. When Kate arrived at the Royal Ascot celebrations in white lace (June 19)\n\nGetty\n\nYes, that’s Alexander McQueen again.\n\n11. When Canadian Governor General David Johnston broke royal protocol and touched Queen Elizabeth’s arm (July 19)\n\nGetty\n\nDuring a Canada 150 celebration in London, Johnston found himself in the middle of a teeny tiny scandal when he was spotted grazing the royal elbow of Queen Elizabeth II as they made their way down some carpeted steps. As he later explained to CBC News, “I’m certainly conscious of the protocol. I was just anxious to be sure there was no stumbling on the steps… It’s a little bit awkward, that descent from Canada House to Trafalgar Square, and there was carpet that was a little slippy, so I thought perhaps it was appropriate to breach protocol just to be sure there was no stumble.”\n\n12. When Princess Charlotte delivered her first-ever royal curtsy (July 19)\n\nAdorable Princess Charlotte pic.twitter.com/QL5I01HhxC — The Telegraph (@Telegraph) July 19, 2017\n\nIt happened moments before Charlotte boarded the plane in Warsaw, Poland, for Berlin with her brother George and their parents, the Duke and Duchess of Cambridge. Upon landing in Berlin, Charlotte also perfectly executed her first diplomatic handshake. Well done, Princess!\n\n\n\nSo cute! Princess Charlotte gives her first diplomatic handshake #RoyalVisitGermany pic.twitter.com/C3fXva87hK — Victoria Murphy (@byQueenVic) July 19, 2017\n\n13. When Kate and Will made pretzels during an official royal visit to Germany (July 20)\n\nGetty\n\nYeah, they should keep their day jobs.\n\n14. When Prince George had this reaction while checking out helicopter models in Hamburg, Germany (July 21)\n\nGetty\n\nAdorable and relatable.\n\n15. When Kensington Palace released a new photo of Prince George ahead of his fourth birthday (July 21)\n\nChris Jackson/Getty Images\n\n16. When Prince Philip made his final solo appearance at an official event (August 2)\n\nBack in May, Philip announced his retirement after completing more than 22,000 solo appearances over 70 years ever since becoming a member of the British royal family. For his final solo appearance, the 96-year-old bowed out with a tribute from the Royal Marines on a rainy day at Buckingham Palace.\n\n17. When Kate announced that she was pregnant with baby number three (September 4)\n\nIn a statement shared on its social media channels, Kensington Palace confirmed that the Duke and Duchess were “very pleased” to announce George and Charlotte’s future sibling. According to The Daily Mail, Kate is due around April or May 2018.\n\nRead the press release in full ↓ pic.twitter.com/vDTgGD2aGF — Kensington Palace (@KensingtonRoyal) September 4, 2017\n\n18. When George posed with his dad for this perfect first day of school photo (September 7)\n\nChris Jackson | Getty\n\n4-year-old George reported for his first day of full-time education at Thomas’s Battersea while accompanied by his dad, Prince William, and Helen Haslem, the head of lower school. His little walk to school was later shared on Kensington Palace’s official Instagram account.\n\n19. When Prince Charles hung out with some sheep (September 14)\n\nThis year’s Westmorland Show in Cumbria welcomed a royal judge in Prince Charles, who revealed in 2016 that he’s successfully used homeopathy to treat his cattle and sheep to reduce the use of antibiotics.\n\n\n\n20. When Prince Harry and girlfriend Meghan Markle made their first official public appearance together in Toronto (September 25)\n\nGetty\n\nGetty\n\nThe sighting was a momentous one for fans of the couple, who were first romantically linked in the fall of 2016. Their public debut, which happened at the 2017 Invictus Games in Toronto, also came weeks after Meghan opened up about their relationship in Vanity Fair. “I can tell you that at the end of the day I think it’s really simple. We’re two people who are really happy and in love.”\n\n21. When Prince Harry sat front row with Barack Obama, Joe Biden, and Dr. Jill Biden at the Invictus Games (September 29)\n\nGetty\n\nWow thanks for the invite, you guys.\n\n22. When a pregnant Kate danced with Paddington Bear (October 16)\n\nGetty\n\nGetty\n\nIn a surprise royal visit, Kate joined Prince William and Prince Harry at an event celebrating kids aboard the British Pullman, sister to the Orient Express train. Paddington Bear was also there to represent the cast of the upcoming Paddington 2 movie and somehow convinced the Duchess to show off a few dance moves on the platform.\n\n22. When Prince Harry and Michelle Obama surprised a group of students in Chicago (October 31)\n\nThe 20 lucky students got the meeting of a lifetime at Hyde Park Academy, which sits across the future site of the Obama Presidential Center on the South Side of Chicago. Harry later spoke at the Obama Foundation Summit.\n\n23. When Queen Elizabeth II and Prince Philip celebrated 70 years of marriage (Nov. 20)\n\nAhead of the big day, new photographs of the Queen and His Royal Highness were released on the official Royal Family Facebook page and other social media platforms. According to the release, the portraits were taken inside the White Drawing Room at Windsor Castle by British photographer Matt Holyoak of Camera Press in early November.\n\nOn the day of their anniversary, Elizabeth and Philip were joined by family and close friends for a celebration at Windsor Castle. Among those in attendance: Prince William, Kate Middleton, Prince Harry, Prince Charles, Princess Anne, Prince Andrew, and Prince Edward.\n\n\n\nGetty\n\n24. When Harry and Meghan announced their engagement (Nov. 27)\n\nGetty\n\nVia Clarence House, Prince Charles confirmed his son Harry's engagement to Meghan. According to the announcement, Harry proposed in London in early November after seeking and receiving the blessing of Meghan's parents.\n\nThe Prince of Wales is delighted to announce the engagement of Prince Harry to Ms. Meghan Markle. pic.twitter.com/zdaHR4mcY6 — Clarence House (@ClarenceHouse) November 27, 2017\n\nLater that day, Harry and Meghan made their first public appearance as an engaged couple at Kensington Palace Gardens, where she revealed her gorgeous ring and told reporters she was \"so happy.\" According to Harry, the proposal was romantic and he knew Meghan was the right one for him \"the very first time we met.\"\n\nPrince Harry and Ms. Meghan Markle are \"thrilled and happy\" to be engaged. pic.twitter.com/HBz30SbZVE — Kensington Palace (@KensingtonRoyal) November 27, 2017\n\nKensington Palace later announced the couple's wedding date: May 19, 2018.\n\n25. When Kate and Meghan made their first public appearance together (Dec. 25)\n\nGetty Images\n\nBreaking royal tradition, Meghan joined Harry and members of the royal family for Christmas services at St. Mary Magdalene Church in Sandringham. It was the first time Meghan was seen in public with future royal relative Kate Middleton. The two were also seen curtsying to Queen Elizabeth alongside Prince William and Prince Harry, who bowed as per royal etiquette.\n\nGetty Images\n\nFollow Peggy on Twitter and Cosmo Celeb on Facebook.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/royal-moments-2017-george-helicopter-1511299665.jpg?crop=1.00xw:0.373xh;0,0.0777xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/royal-moments-2017-george-helicopter-1511299665.jpg?crop=1.00xw:0.373xh;0,0.0777xh&resize=1200:*", "keywords": [], "authors": ["Peggy Truong", "Entertainment Writer", "Peggy Is Cosmopolitan.Com S Entertainment Writer", "Specializing In Leonardo Dicaprio", "This Is Us", "The Royals."], "canonical_link": "https://www.cosmopolitan.com/entertainment/celebs/a13819903/best-royal-moments-2017/", "title": "The 25 Best Royal Moments of 2017", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "The 25 Best Royal Moments of 2017", "description": "Charlotte's curtsy! Meghan and Harry's engagement! Royals forever.", "url": "https://www.cosmopolitan.com/entertainment/celebs/a13819903/best-royal-moments-2017/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/royal-moments-2017-george-helicopter-1511299665.jpg?crop=1.00xw:0.373xh;0,0.0777xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2018-03-29 06:28:34", "published_time": "2017-12-26 08:40:00", "section": "Celebs", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/royal-moments-2017-george-helicopter-1511299665.jpg?crop=1.00xw:0.373xh;0,0.0777xh&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "The 25 Best Royal Moments of 2017 - Kate Middleton and Prince William Year in Review", "description": "From Princess Charlotte's first curtsy to Kate Middleton's pregnancy announcement for baby number three to Harry and Meghan's engagement, the British royals have had quite a year.", "keywords": "kate middleton, meghan markle, prince george, prince harry, prince philip, prince william, princess charlotte, queen elizabeth, best royal moments of 2017, royal moments, royals year in review, kate middleton best moments, princess charlotte curtsy, meghan harry engaged", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/royal-moments-2017-george-helicopter-1511299665.jpg?crop=1.00xw:0.746xh;0,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrities & Entertainment,entertainment,celebs,Meghan Markle,Prince Philip,Princess Charlotte,Queen Elizabeth,Prince George,Kate Middleton,Prince William,Prince Harry", "sailthru.date": "2017-12-26T20:40:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/royal-moments-2017-george-helicopter-1511299665.jpg?crop=1.00xw:0.373xh;0,0.0777xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/royal-moments-2017-george-helicopter-1511299665.jpg?crop=1.00xw:0.746xh;0,0", "sailthru.socialtitle": "The 25 Best Royal Moments of 2017", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1514248800.0, "source": "https://www.cosmopolitan.com", "summary": ""}