{"url": "https://en.wikipedia.org/wiki/Paris_(Paris_Hilton_album)", "text": "2006 studio album by Paris Hilton\n\nParis is the debut studio album by American socialite Paris Hilton. It was released on August 22, 2006, by Warner Bros. Records. The entire album was posted on AOL Music on August 14, 2006, becoming available for online stream eight days before the scheduled release date.[4] After getting signed to the label in 2005, Hilton began working on the album with producer Rob Cavallo, who was originally set to produce the entire record. They recorded the song \"Screwed\", which was intended to be the lead single. However, after meeting with Scott Storch, Hilton decided to change the musical direction of the album and make more hip hop and R&B influenced songs. She collaborated with other producers, including Fernando Garibay, J.R. Rotem, Dr. Luke and Greg Wells. Musically, Paris is a pop and R&B album that is influenced by hip hop. It also incorporates elements of other genres in its production, such as reggae, soul and pop rock.\n\nUpon its release, Paris received mixed reviews from music critics, but noted a commercial success, peaking at number six on the US Billboard 200 with first-week sales of 77,000 copies.[5] As of October 2013, the album has sold 200,000 copies in the United States and over 600,000 copies worldwide.[6][7]\n\nThree singles were released from Paris. \"Stars Are Blind\" was released the lead single on June 5, 2006 to critical and commercial success. It peaked at number 18 on the Billboard Hot 100 and became one of the highest debuting singles of 2006. The second single, \"Turn It Up\", managed to be successful on the Billboard Dance Club Songs chart, peaking at number one. \"Nothing in This World\", the album's third and final single, was released on August 28, 2006 and peaked at number 12 on the Billboard Dance Club Songs chart.\n\nBackground and recording [ edit ]\n\nHilton first announced plans to record an album in 2003 during the production of her reality television series The Simple Life. She began early collaborations with Romeo Antonio. Together they recorded six songs, including a midtempo ballad with the working title \"Loneliness\".[8][9] In 2004, she met with the producer Robb Boldt. In collaboration with JC Chasez, she started recording new demos.[10] Around that time, she was pitched the song \"Screwed\", written by Kara DioGuardi and Greg Wells.[11] She began talking about the song in many interviews, saying it would be the first single from the album. In June 2004, Hilton established her own record label, Heiress Records, on which she was planning to release the album.[12] That same summer, Haylie Duff said in an interview that \"Screwed\" was actually intended to be recorded by her and would be the first single from her debut album, which was later cancelled.[13] It was followed by a legal battle for the song. In August 2004, a low fidelity leak of Hilton's recording of the song circulated onto the Internet from an Orlando radio station airing, which complicated the legal battle.[14] After meeting with the producer Rob Cavallo, Hilton recorded a new version of the song and was planning to shoot a music video with David LaChapelle.[15] Not long afterwards, Duff was dropped by Hollywood Records which allowed Hilton to claim the song as hers.\n\nAround the same time, Lil Jon agreed to produce some tracks for Hilton. He sent over four tracks for her to consider. She picked a song called \"That's Hot\" but later commented: \"It's really like hip-hop though, so I told him to tone it down a little. It's hot, but it's more like for Lil' Kim, and I told him to make it more like me.\" However, Hilton was unable to get in the studio with him since she was working on the film Pledge This! in Miami.[16] Other reports were made about a possible collaboration with The Black Eyed Peas.[17] Hilton continued her work with Cavallo, who was initially set to serve as a producer for the entire record. Jane Wiedlin of The Go-Go's was also invited to work with her and Cavallo. Wiedlin spoke on her work with Hilton: \"I think her voice is sounding good. The first time she sang she was super nervous and she just didn't really have experience singing. And one of the main things I did was kind of guide her through the vocals. And as she is getting more and more comfortable in the studio, she is just getting better and better. I think people are going to be really surprised when they hear the record. It's going to be good.\" Hilton later confirmed a cover version of Blondie's \"Heart of Glass\" would appear on the album.[18]\n\nIn the summer of 2005, Hilton met with the producer Scott Storch in Miami and was invited to his recording studio. After recording the song \"Turn It Up\", she decided to change the musical direction of the album and make more hip hop and R&B-influenced songs.[19] After months of collaboration with Storch, with contributions from Fernando Garibay, Dr. Luke, J.R. Rotem, and Greg Wells, Paris was finally complete and ready for release.\n\nRelease and promotion [ edit ]\n\nTentatively called Screwed, Hilton decided to change the album's title to Paris Is Burning. It was originally scheduled to be released in February 2005 with the first single koeningsegg released in December 2004, but after she decided to change the album's concept following her collaboration with Scott Storch, the release date was pushed back. In December 2005, it was announced that the album, then titled 1 Crazy Party, would feature the songs \"Screwed\", \"Turn It Up\" and \"All the Boys Are Chasing Me\" (an early version of \"Fightin' Over Me\") featuring Fat Joe and Nelly.[20] In January 2006, a song called \"My Mistake\" was confirmed for the album. It was allegedly about Hilton's infamous sex tape scandal.[21]\n\nDuring the first week of the album's release, Hilton became a target of the street artist Banksy, when 500 copies of her album in 48 record shops across the United Kingdom were replaced with his own alternative version. His rework of the album featured remixes produced by himself and Danger Mouse. The track list contained satire song titles such as \"Why Am I Famous?\", \"What Have I Done?\" and \"What Am I For?\" He also changed the cover sleeve and booklet to display pictures of the singer topless. The original barcode had been left on the album so people could buy the CD without realising it had been interfered.[22][23][24]\n\nSingles [ edit ]\n\n\"Turn It Up\" was planned as the lead single for the album, and was commissioned for remixes by Paul Oakenfold, Peter Rauhofer, and Tracy Young. It premiered at the Winter Music Conference in March 2006, but a last-minute decision was made to release \"Stars Are Blind\", which was sent tabun far cry magburg to radio in May. Produced by Garibay, \"Stars Are Blind\" was released digitally June 20 and as a CD-maxi single on July 18, and peaked at No. 18 on the Billboard Hot 100. \"Turn It Up\" was then released as a digital single on July 11[25] and on 12-inch vinyl on August 22.[26] \"Nothing in This World\" followed as the third and final single.\n\nCritical reception [ edit ]\n\nParis received generally mixed reviews from music critics. At Metacritic, which assigns a normalized rating, out of 100, to reviews from mainstream critics, the album received an average score of 57, based on 17 reviews, which indicates \"mixed or average reviews\".[27] AllMusic was positive, commenting that the album was \"more fun than anything released by Britney Spears or Jessica Simpson, and a lot fresher, too\".[1] Mark Daniels from Yahoo! Music called the album \"actually rather good\", before adding, \"To many it'll appear that [...] Ms. Hilton has bought herself a singing career. And in many ways it could be argued that she has. But so what? With some contagious pop, genuinely stylish moments and a complete lack of inane ballads, it was worth every penny\".[34] According to Billboard's Keith Caulfield, \"Does it matter that Paris Hilton isn't a great singer? Not really. [...] Wisely, the gaggle of producers and writers enlisted for the project don't require Hilton to do more than she's capable of, thus making \"Paris\" an enjoyable pop romp. [...] Naysayers be damned: Hilton releasing an album does not signal the end of days. \"Paris\" won't change the world, but it's good fun.[35]\n\nLeah Greenblatt from Entertainment Weekly gave a mixed review, and described the album as a \"candy box well-stocked with NutraSweet melodies\", but with lyrics \"often both inane and vaguely porny\".[2] Sal Cinquemani of Slant Magazine stated that the album was not bad, and it would likely earn better notices than recent albums by other female artists. However, he criticized the hip hop-influenced tracks.[33] The Observer's Craig McLean remarked that \"The heiress's first album might be more than the musical equivalent of the ghostwritten autobiography after all\".[29] Randy Lewis from Los Angeles Times thought that Paris \"isn't truly awful. [...] With infectious beats and hooky sonic textures established by the hit-laden pros surrounding her, all Hilton has to bring to the party is, well, Paris\". However, he criticized her vocals.[36] MusicOMH gave a negative review, criticizing the album as a whole, before saying that the parts which \"aren't bad\" were the bits which did not involve Hilton.[28] Robert Christgau was also negative, giving Paris a \"dud\" score ( ) indicating \"a bad record whose details rarely merit further thought.\"[31]\n\nTrack listing [ edit ]\n\niTunes bonus tracks No. Title Length 12. \"Stars Are Blind\" (The Scumfrog's Extreme Makeover Edit) 4:57 13. \"Turn It Up\" (Paul Oakenfold Remix Edit) 4:59 14. \"Turn You On\" (Claude Le Gache Le Club Edit) 3:38\n\nLimited edition bonus DVD No. Title Length 1. \"Music Special featuring Making of the Album, Behind the Scenes, and Interviews with Record Producers\" 20:21 2. \"Jealousy - In the Studio\" 3:25\n\nAdditional notes\n\nPersonnel [ edit ]\n\nPerformers\n\nProduction\n\nCredits adapted from the album's liner notes.[37]\n\nCharts [ edit ]\n\nCertifications [ edit ]\n\nRegion Certification Certified Units/Sales Russia (NPFF) Platinum 20,000[60]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Star_full.svg/11px-Star_full.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Rating-Christgau-dud.svg/17px-Rating-Christgau-dud.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Star_empty.svg/11px-Star_empty.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/2/22/Paris_Hilton_-_Paris.jpg/220px-Paris_Hilton_-_Paris.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Star_half.svg/11px-Star_half.svg.png", "https://upload.wikimedia.org/wikipedia/en/2/22/Paris_Hilton_-_Paris.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/2/22/Paris_Hilton_-_Paris.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Paris_(Paris_Hilton_album)", "title": "Paris (Paris Hilton album)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/2/22/Paris_Hilton_-_Paris.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}