{"url": "https://web.archive.org/web/20180117041602/http://theuspoliticalnews.com:80/haiti-official-getting-ready-to-testify-against-clinton-foundation-corruption-next-week-found-dead-with-gunshot-to-the-head/", "text": "It’s absolutely clear that the Clinton Foundation has faced some honest reports of stealing from impoverished Haitians devastated in the 2008 Hurricane Hanna, and straight through their own foundation. For years the Haitians have been struggling and protesting outside the Clinton Foundation offices over the robbery. The money taken was donated by the individuals and business directly to the Clinton Foundation, thinking they were going to receive aid. However, the opposite it true. The money never even made it to the poorest of the poor. Now we have one man ready to testify against the corrupt Clinton Foundation in the upcoming week. However, the 50 year old man, a former Haitian government official Klaus Eberwein, was found dead in his Miami home with a “gunshot to the head” that’s been ruled a “suicide” by the Miami-Dade’s medical examiner records supervisor.\n\nKlaus Eberwein, a former Haitian government official who was expected to expose the extent of Clinton Foundation corruption and malpractice next week, has been found dead in Miami. He was 50.\n\nEberwein was due to appear next Tuesday before the Haitian Senate Ethics and Anti-Corruption Commission where he was widely expected to testify that the Clinton Foundation misappropriated Haiti earthquake donations from international donors.\n\nEberwein, who had acknowledged his life was in danger, was a fierce critic of the Clinton Foundation’s activities in the Caribbean island, where he served as director general of the government’s economic development agency, Fonds d’assistance économique et social, for three years. According to Eberwein, a paltry 0.6% of donations granted by international donors to the Clinton Foundation with the express purpose of directly assisting Haitians actually ended up in the hands of Haitian organizations. A further 9.6% ended up with the Haitian government. The remaining 89.8% – or $5.4 billion – was funneled to non-Haitian organizations.\n\n“The Clinton Foundation, they are criminals, they are thieves, they are liars, they are a disgrace,” Eberwein said at a protest outside the Clinton Foundation headquarters in Manhattan last year.\n\nThe former director general of Haiti, who also served as an advisor to Haitian President Michel Martelly, was also a partner in a popular pizza restaurant in Haiti, Muncheez, and even has a pizza — the Klaus Special — named after him.\n\nAccording to the Haiti Libre newspaper, Eberwein was said to be in “good spirits“, with plans for the future. His close friends and business partners are shocked by the idea he may have committed suicide.\n\n“It’s really shocking,” said Muncheez’s owner Gilbert Bailly. “We grew up together; he was like family.” –Your News Wire\n\nAmericans were warned about the crooked dealings of the Clinton Crime family when in September of 2016, former Senate President of Haiti, Bernard Sansaricq, shocked a large crowd at a Trump campaign event in Little Haiti, FL. Sansaricq stood up during the public event and relayed his account of the Clinton’s dirty dealings in Haiti while he was still in office. To his credit, candidate Donald Trump allowed Sansaricq to speak his mind, and to expose the crimes of the Clinton’s, who were attempting to scratch and claw their way back into our White House.\n\nSansaricq claimed he begged the Clinton Administration not to invade Haiti. His request was followed up with a visit by an anonymous messenger from the White House who encouraged him to “side” with the Clinton Administration and he would “be the richest man in Haiti.”\n\nHe also demanded that Hillary Clinton “disclose the audit of all money” related to the Haiti earthquake crisis, as he claimed they scammed the poorest citizens of Haiti out of BILLIONS of dollars through the Clinton Foundation.\n\n“Not even 2% of that money went back to Haiti. So Mr. Trump, we are asking you, begging you, the Haitian community will side with you if one day, you ask Hillary Clinton publicly to disclose the audit of all of the money they have stolen from Haiti in 2010 after the earthquake. Haiti is a very poor country. Haiti needs defenders. You said you would champion our cause. We welcome you sir and we will work with you. Ask Hillary Clinton publicly, during your next debate for an audit of all of the money they have stolen from Haiti.”\n\nGo to the 5 minute mark of the video to see Sansaricq’s comments to candidate Trump:\n\nLike this: Like Loading...", "images": ["https://web.archive.org/web/20180117041602im_/http://2.gravatar.com/avatar/21a8b8bedf3be31f5843161dcf096f35?s=82&d=mm&r=g", "https://web.archive.org/web/20180117041602im_/https://i0.wp.com/theuspoliticalnews.com/wp-content/uploads/2018/01/Screen-Shot-2018-01-13-at-1.39.11-PM.png?fit=614%2C343", "https://web.archive.org/web/20180117041602im_/https://i0.wp.com/theuspoliticalnews.com/wp-content/uploads/2018/01/Screen-Shot-2018-01-13-at-1.39.11-PM.png?resize=614%2C343", "https://web.archive.org/web/20180117041602im_/https://i2.wp.com/threpublican.party/wp-content/uploads/2018/01/Screen-Shot-2018-01-13-at-1.40.11-PM.png?resize=560%2C295&ssl=1", "https://web.archive.org/web/20180117041602im_/https://i1.wp.com/threpublican.party/wp-content/uploads/2018/01/Screen-Shot-2018-01-13-at-12.46.16-PM.png?resize=557%2C311&ssl=1", "https://web.archive.org/web/20180117041602im_/https://i1.wp.com/threpublican.party/wp-content/uploads/2018/01/Screen-Shot-2018-01-13-at-12.45.51-PM-1-660x400.png?resize=578%2C350&ssl=1"], "top_img": "https://web.archive.org/web/20180117041602im_/https://i0.wp.com/theuspoliticalnews.com/wp-content/uploads/2018/01/Screen-Shot-2018-01-13-at-1.39.11-PM.png?fit=614%2C343", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20180117041602/http://theuspoliticalnews.com/haiti-official-getting-ready-to-testify-against-clinton-foundation-corruption-next-week-found-dead-with-gunshot-to-the-head/", "title": "Haiti Official Getting Ready To Testify Against Clinton Foundation Corruption NEXT WEEK, Found DEAD With “Gunshot to the head”", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "generator": "WordPress 4.9.2", "fb": {"pages": 1248421415303456}, "ia": {"markup_url": "http://theuspoliticalnews.com/haiti-official-getting-ready-to-testify-against-clinton-foundation-corruption-next-week-found-dead-with-gunshot-to-the-head/?ia_markup=1"}, "description": "It’s absolutely clear that the Clinton Foundation has faced some honest reports of stealing from impoverished Haitians devastated in the 2008 Hurricane Hanna, and straight through their own foundation. For years the Haitians have been struggling and protesting outside the Clinton Foundation offices over the robbery.The money taken was donated by the individuals and business…", "og": {"type": "article", "title": "Haiti Official Getting Ready To Testify Against Clinton Foundation Corruption NEXT WEEK, Found DEAD With “Gunshot to the head”", "url": "https://web.archive.org/web/20180117041602/http://theuspoliticalnews.com/haiti-official-getting-ready-to-testify-against-clinton-foundation-corruption-next-week-found-dead-with-gunshot-to-the-head/", "description": "It’s absolutely clear that the Clinton Foundation has faced some honest reports of stealing from impoverished Haitians devastated in the 2008 Hurricane Hanna, and straight through their own foundat…", "site_name": "The US political News", "image": {"identifier": "https://web.archive.org/web/20180117041602im_/https://i0.wp.com/theuspoliticalnews.com/wp-content/uploads/2018/01/Screen-Shot-2018-01-13-at-1.39.11-PM.png?fit=614%2C343", "width": 614, "height": 343}, "locale": "en_US"}, "article": {"published_time": "2018-01-15T00:45:10+00:00", "modified_time": "2018-01-15T00:45:10+00:00"}, "twitter": {"image": "https://web.archive.org/web/20180117041602im_/https://i0.wp.com/theuspoliticalnews.com/wp-content/uploads/2018/01/Screen-Shot-2018-01-13-at-1.39.11-PM.png?fit=614%2C343&w=640", "card": "summary_large_image"}}, "movies": ["https://web.archive.org/web/20180117041602if_/https://www.youtube.com/embed/wN1uo-Gt37A"], "publish_date": 1515977110.0, "source": "https://web.archive.org", "summary": ""}