{"url": "http://time.com/5032319/queen-elizabeth-prince-philip-70th-wedding-anniversary-photos/", "text": "In honor of their 70th wedding anniversary, the royal palace released new portraits of Queen Elizabeth II and Prince Philip this week, showing the long-lasting couple ahead of their landmark milestone.\n\nTaken by British portrait photographer Matt Holyoak, the images show the couple in the White Drawing Room at Windsor Castle. The Queen, 91, wears a yellow gold broach that Philip, 96, gave her decades ago in 1966, according to People.\n\nThe Queen and the Duke of Edinburgh wed exactly 70 years ago on Nov. 20, 1947, when she was 21 and he was 26. The ceremony took place at Westminster Abbey — the coveted spot for marriages in the Royal Family. The Queen’s parents King George VI and Queen Elizabeth wed there in April 1932, and Prince William and Kate Middleton, the Duchess of Cambridge, had their ceremony there in 2011. (Queen Elizabeth was the 10th member of the Royal Family to be married there, according to The Royal Family’s official website.)\n\nA handout photo shows Britain's Queen Elizabeth and Prince Philip in the White Drawing Room at Windsor Castle in early November, pictured against a platinum-textured backdrop, in celebration of their platinum wedding anniversary on November 20, 2017. Matt Holyoak/CameraPress/PA Wire/Handout via REUTERS Matt Holyoak—CameraPress/PA Wire/Reuters\n\nTwo thousand guests attended their ceremony, which was broadcast to millions worldwide by BBC Radio. Then-Princess Elizabeth wore a gown — decorated with crystals and 10,000 seed pearls — designed by Sir Norman Hartnell, according to the Royal Family.\n\nSix years later, the Queen returned to Westminster Abbey for her coronation after the death of her father, King George VI.\n\nIn addition to being the world’s longest-reigning monarch, Queen Elizabeth is now the first to have a platinum wedding anniversary. Since they wed, the couple has had four children, eight grandchildren and five great-grandchildren.\n\nThe Royal Family celebrated the landmark event this year at a private family event at Windsor Castle, according to People. During their 50th wedding anniversary in 1997, the Queen reflected on their decades of marriage, what Britain had been through since then and the placement of their wedding in history — just after World War II.\n\n“What a remarkable fifty years they have been: for the world, for the Commonwealth and for Britain,” the Queen said in 1997. “Think what we would have missed if we had never heard the Beatles or seen Margot Fonteyn dance: never have watched television, used a mobile telephone or surfed the Net (or, to be honest, listened to other people talking about surfing the Net).”\n\nAnd for words about her husband?\n\n“He is someone who doesn’t take easily to compliments but he has, quite simply, been my strength and stay all these years, and I, and his whole family, and this and many other countries, owe him a debt greater than he would ever claim, or we shall ever know,” she said.\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nContact us at editors@time.com.", "images": ["https://api.time.com/wp-content/uploads/2017/11/elizabeth-philip-wedding-anniversary.jpg?quality=85&crop=0px%2C174px%2C3000px%2C1570px&resize=1200%2C628&strip", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/11/70th-anniversary-royals.jpg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2017/11/elizabeth-philip-wedding-anniversary.jpg?quality=85&crop=0px%2C174px%2C3000px%2C1570px&resize=1200%2C628&strip", "keywords": [], "authors": ["Jennifer Calfas"], "canonical_link": "https://time.com/5032319/queen-elizabeth-prince-philip-70th-wedding-anniversary-photos/", "title": "Queen Elizabeth and Prince Phillip Celebrated Their 70th Wedding Anniversary With Sweet New Photos", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "queen elizabeth ii, queen elizabeth, queen elizabeth 70th anniversary, queen elizabeth wedding anniversary, queen elizabeth 70th wedding anniversary, queen elizabeth and prince philip, queen elizabeth wedding anniversary photo, prince philip and queen elizabeth 70th anniversary portraits", "news_keywords": "queen elizabeth ii, queen elizabeth, queen elizabeth 70th anniversary, queen elizabeth wedding anniversary, queen elizabeth 70th wedding anniversary, queen elizabeth and prince philip, queen elizabeth wedding anniversary photo, prince philip and queen elizabeth 70th anniversary portraits", "description": "Queen Elizabeth II and Prince Philip celebrated their 70th wedding anniversary with new portraits. Here's what they look like", "og": {"title": "Queen Elizabeth and Prince Phillip Celebrated Their 70th Wedding Anniversary With Sweet New Photos", "type": "article", "site_name": "Time", "url": "https://time.com/5032319/queen-elizabeth-prince-philip-70th-wedding-anniversary-photos/", "description": "The long-lasting couple posed for new portraits in honor of the landmark event", "image": {"identifier": "https://api.time.com/wp-content/uploads/2017/11/elizabeth-philip-wedding-anniversary.jpg?quality=85&crop=0px%2C174px%2C3000px%2C1570px&resize=1200%2C628&strip", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5032319/queen-elizabeth-prince-philip-70th-wedding-anniversary-photos/", "description": "Queen Elizabeth II and Prince Philip celebrated their 70th wedding anniversary with new portraits. Here's what they look like", "media": "https://api.time.com/wp-content/uploads/2017/11/elizabeth-philip-wedding-anniversary.jpg?quality=85&crop=0px%2C174px%2C3000px%2C1570px&resize=1200%2C628&strip"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5032319/queen-elizabeth-prince-philip-70th-wedding-anniversary-photos/", "title": "Queen Elizabeth and Prince Phillip Celebrated Their 70th Wedding Anniversary With Sweet New Photos", "description": "The long-lasting couple posed for new portraits in honor of the landmark event", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2017/11/elizabeth-philip-wedding-anniversary.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}