{"url": "latestplasticsurgery.com/rihanna-plastic-surgery-before-and-after-photos/", "text": "Did Rihanna Undergo Plastic Surgery?\n\nRihanna plastic surgery rumours is all about nose jobs and breasts augmentation. Her before and after photos show significant changes in her nose shape. Her bust size increase has given rise to speculations about breast implants. The only way to find out is to compare the before and after pictures of Rihanna over the years.\n\nRihanna is one of the most popular singers in the world today. With her fame comes the pressure to look good and presentable. Born in 1988, she came to United States at a tender young age of 16 and gained fame at a very young age. And by adding acting to her portfolio, there is a definite need to look young and beautiful.\n\nHer album sales records are hard to refute. Her soaring popularity has seen her working on music together with Eminem, creating hit songs like “ Love the Way You Lie”. But whether we love the way Rihanna is dealing with plastic surgery is another matter.\n\nRihanna Plastic Surgery Nose Job\n\nOne of the most intense speculation is whether Rihanna went for rhinoplasty or nose job. It seems that many singers and actresses are not happy with their natural noses. Rihanna is no exception. Sharp noses are always preferred to rounder and bulbous noses. Based on Rihanna’s latest photos, they bear evidence that she might have enhanced her nose shape deliberately. But Rihanna has never confirmed any nose surgery took place.\n\nRihanna Plastic Surgery Breast Implants\n\nThis is Rihanna many years back, looking young and beautiful in an interview in Berlin:\n\n\n\nCompare that to now Rihanna Talking about here relationship Status on Ellen’s Show recently:\n\n\n\nRihanna has people talking about her breast size because the shape of her boobs have become rounder over the years. Obviously her cleavage has raised lots of speculations. Some have put it down to effective use of push up bras. What do you think? Any breast implants on Rihanna? Let’s have more discussion on her boobs size, shall we?\n\nOne of the most important features of a female celebrity is boob size. Bigger breasts attract more attention. Many celebrities opt to go for breast augmentation to boost their boob size. Actresses ooze bigger sex appeal with bigger boobs. Musicians like Rihanna look hotter in music videos with bigger boobs. But are her boobs real? Did she use plastic surgery to fix them? Or is it just a case of good push up bras?\n\nTo begin with, let’s take a look at earlier photos of Rihanna.\n\nHere is a photo with Rihanna showing off the centre parting of her breasts. Nice shot capturing her cleavage. You can tell that she is blessed with a pair of natural big boobs. But the effect might be assisted by the support bra she was wearing. Check it out:\n\nHere is a photo of Rihanna back in 2006. That was more than 10 years ago. Her cleavage showing top did not show any deep cleavage. Just a thin Rihanna with a normal sized bust. Check it out below:\n\nOk, the following picture shows what a good push up bra can do. Pictured at the (Aug 2006) 2006 MTV Video Music Awards, Rihanna was wearing a spaghetti strap top, revealing some significant cleavage. She could not have undergone a boob job then. But you can see her cleavage was much deeper.\n\nAbout 5 months later, Rihanna appeared at Clive Davis pre-Grammy party with her boob size unchanged. She looked stunning in this body hugging dress. She looked slightly like Naomi Campbell here. Please don’t flame us for this comment:\n\nWell, here is another photo taken in February 2008 while she was attending the 50th Annual Grammy Awards. Her boobs looked natural. No hints of any boob job here. Rihanna looks good in short hair too! Check it out:\n\nHere is another closeup of Rihanna. This is a photo taken in June 2008 at the BEST Awards held in Los Angeles, California. Absolutely no signs of any breast augmentation:\n\nIn Jan 2009, Rihanna attended the RIAA and Feeding America’s Inauguration Charity Ball at Ibiza. Dressed in a single strap yellow dress, her breasts looked slightly rounded at the top. But her boobs do not look overly round or tight. Well done, push up bra:\n\nIn 2010, Rihanna performed during the Rock In Rio Madrid Festival. Her “Madonna inspired” cone bra did little to increase her boob size. In fact, those cone cups made her boobs look smaller. Nice legs though. Her beautiful legs might have taken attention off her breasts. Check it out:\n\nThe following photo taken in April 2011 shows Rihanna boobs are REAL. There was nothing fake about them in 2011. Breast implants do not look so flat on a person. But Rihanna is a natural beauty anyway. She needed no fake boobs. Check it out:\n\nIn 2012, Rihanna was spotted in a casual top. Man, she looks beautiful even with a simple tank top! You can tell that her boobs are all natural. Breast implants will not allow her boobs to sag like this:\n\nIn 2013, Rihanna performed at the 55th Annual Grammy Awards at Staples Center in Los Angeles, California. Dressed in an all black dress, Rihanna showed off her slim figure. There was no reason to suspect that she underwent breast augmentation surgery. Check it out:\n\nRihanna was spotted dining at the Da Silvano Restaurant in New York City in 2014. She wore a tight fitting black tank top, exposing her toned abs. In the photo below, there wasn’t any help from push up bras. You can see that her boobs were all natural with a slight droop.\n\nIn 2015, Rihanna attended the Zac Posen Fashion Show at Grand Central Terminal in New York City. Decked out in a low cut maroon dress, her boobs looked all natural. She oozed pure elegance. Check it out:\n\nIn 2016, Rihanna was pictured leaving a dentist office. This photo taken from the side shows that she did not have any breast implants at all. It is amazing how Rihanna managed to remain so slim over the years. She seemed to look superb in any dress she wore. Check it out:\n\nWhen it looked like she never had any breast augmentation till 2016, she surprised everyone in July 2017. During the premiere of “Valerian and The City of a Thousand Planets”, Rihanna’s boobs looked really big. Her breasts looked much bigger than previous years. Could it be due to the push up effect of her dress? Or a slight weight gain? You be the judge:\n\nHere is a set of Rihanna Boobs NOW and THEN Photos:\n\nSo, did Rihanna undergo a boob job? She did not publicly admit to having a boob job. It is unlikely that she would undergo anything so drastic. To go under the knife needs a lot of courage. Her recent increase in breast size is likely due to a slight weight gain. To suggest that she underwent a boob job is quite a stretch. What do you think of Rihanna boob job rumors?\n\nRihanna and Forehead Surgery Rumors (Ridiculous!)\n\nThe most ridiculous plastic surgery rumour about Rihanna is reducing her forehead size. Till date, we have not heard of such extreme plastic surgery performed on any musician. As Rihanna once mentioned that she is afraid to go under the knife, we think it is highly unlikely for her to reduce the size of her forehead surgically.\n\nWe appreciate Rihanna’s contribution to the entertainment industry. There is no doubt that she has talent as a singer and actress. Whether she used plastic surgery or simply effective bust enhancing cream is anyone’s guess. But what we know is that she will continue to give us years of great music and movies in the future. Let us know what you think about Rihanna plastic surgery rumours.", "images": ["http://latestplasticsurgery.com/wp-content/uploads/2017/12/Aomi-Muyock-teeth-gap-222x300.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2017/08/Rihanna-boob-job-2007.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2015/12/Rihanna-Plastic-Surgery-Before-and-After-Photos.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2017/11/James-Harden-teeth-high-school-203x300.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2018/04/Shin-Se-Kyung-plastic-surgery-before-and-after-photos-300x155.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2017/08/Rihanna-boob-job-2017.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2017/08/Rihanna-breast-augmentation-boob-job-.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2017/08/Rihanna-boob-job-2005.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2017/08/Rihanna-boob-job-2010.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2016/12/LeAnn-Rimes-plastic-surgery-before-and-after-photos-150x150.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2017/08/Rihanna-boob-job-2008.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2017/04/Charo-plastic-surgery-before-and-after-photos-150x150.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2017/08/Rihanna-boob-job-2016.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2017/08/Rihanna-boob-job-2009.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2016/03/Eminem-Plastic-Surgery-Before-and-After-150x150.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2018/02/Christina-Hendricks-Before-Famous-217x300.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2018/05/Jeanine-Pirro-plastic-surgery-before-and-after-photos-300x140.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2017/08/Rihanna-boob-job-2006-bust-.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2018/04/Ana-Cheri-before-implants-breasts-300x210.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2017/12/Cardi-B-Teeth-before-and-after-surgery-300x190.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2017/08/Rihanna-boob-job-2015.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2018/01/Jennifer-Jason-Leigh-plastic-surgery-before-and-after-photos-300x162.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2017/08/Rihanna-boob-job-before-and-after-photos.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2017/08/Rihanna-boob-job-2013.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2017/08/Rihanna-boob-job-2011.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2017/08/Rihanna-boob-job-june-2008.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2016/04/Melania-Trump-Plastic-Surgery-Before-and-After-Photos-150x150.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2016/09/Olivia-Newton-John-Plastic-Surgery-before-and-after-photos-150x150.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2015/08/celebrity-plastic-surgery.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2017/08/Rihanna-boob-job-2006.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2017/08/Rihanna-boob-job-2012.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2016/07/Fergie-Plastic-Surgery-before-and-after-150x150.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2018/05/Oliver-Taylor-Dudley-boobs-238x300.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2017/08/Rihanna-boob-job-2014.jpg", "http://latestplasticsurgery.com/wp-content/uploads/2017/11/Lil-Wayne-teeth-diamonds-300x196.jpg"], "top_img": "http://latestplasticsurgery.com/wp-content/uploads/2015/12/Rihanna-Plastic-Surgery-Before-and-After-Photos.jpg", "keywords": [], "authors": ["Plastic Surgery News"], "canonical_link": "http://latestplasticsurgery.com/rihanna-plastic-surgery-before-and-after-photos/", "title": "Rihanna Plastic Surgery BEFORE AND AFTER PHOTOS", "meta_data": {"viewport": "width=device-width", "description": "Rihanna Plastic Surgery is about breast augmentation and nose job. Rihanna has said that she is afraid of going under the knife. Thus there is no conclusive", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Rihanna Plastic Surgery BEFORE AND AFTER PHOTOS", "description": "Rihanna Plastic Surgery is about breast augmentation and nose job. Rihanna has said that she is afraid of going under the knife. Thus there is no conclusive", "url": "http://latestplasticsurgery.com/rihanna-plastic-surgery-before-and-after-photos/", "site_name": "Latest Plastic Surgery Gossip And News. Plastic Surgery Tips and Advice", "updated_time": "2017-08-16T15:55:00+00:00", "image": "http://latestplasticsurgery.com/wp-content/uploads/2015/12/Rihanna-Plastic-Surgery-Before-and-After-Photos.jpg"}, "article": {"section": "Actresses", "published_time": "2015-12-26T16:21:33+00:00", "modified_time": "2017-08-16T15:55:00+00:00"}, "twitter": {"card": "summary", "description": "Rihanna Plastic Surgery is about breast augmentation and nose job. Rihanna has said that she is afraid of going under the knife. Thus there is no conclusive", "title": "Rihanna Plastic Surgery BEFORE AND AFTER PHOTOS", "image": "http://latestplasticsurgery.com/wp-content/uploads/2015/12/Rihanna-Plastic-Surgery-Before-and-After-Photos.jpg"}, "generator": "WordPress 5.3.2"}, "movies": ["https://www.youtube.com/embed/H2HtMWmJb80", "https://www.youtube.com/embed/h_E2AhbbwdY"], "publish_date": 1451146893.0, "source": "http://latestplasticsurgery.com", "summary": ""}