{"url": "www.inquisitr.com/4774907/report-that-blake-shelton-will-propose-to-gwen-stefani-on-valentines-day-is-untrue-debunked/", "text": "A report alleging that Blake Shelton will pop the question to Gwen Stefani with an expensive engagement ring on Valentine’s Day is untrue. The rumor was started by Hollywood Life on Monday when it claimed The Voice judge had been shopping for a $500,000 diamond ring to have when he asks his lady love to marry him. As an insider told the website, one of Shelton’s assistants had recently been shopping with a private jeweler in Beverly Hills. The source surmised that the timing indicates that Blake is planning to ask Gwen to marry him on Valentine’s Day.\n\nHollywood Life‘s report added that Gwen Stefani can expect some “serious bling” from Blake Shelton when he finally does pick the right ring.\n\nGossip Cop squashed the rumor hours after the article was published. It had readers take into consideration that the tabloid also claimed Shelton and Stefani had already gotten engaged and even “secretly married.” The celebrity surveillance website revealed that they were informed by reliable sources a long time ago that no sources close to Blake or Gwen share details with Hollywood Life.\n\nGP corrected another fabricated story just days before about Blake and Gwen after Celebrity Insider reported that the couple is having a “miracle baby.” The report cited a made-up report from OK! magazine that alleged the pair were celebrating two big changes in their lives — their new baby and just getting married at Stefani’s Beverly Hills home in the backyard. It went on to report that Stefani conceived after several IVF treatments.\n\nBlake Shelton Shopping For Diamond Ring For Gwen Stefani, Proposing To Her On Valentine’s Day? https://t.co/RkQrEFGJJK — Gossip Cop (@GossipCop) February 6, 2018\n\nPhotos from Blake and Gwen’s getaway in Playa del Carmen, Mexico didn’t reveal any signs that they’re expecting a baby. Stefani wore a black bikini and showed no obvious physical changes for being a few months pregnant. Moreover, she was strolling on the beach with a drink in her hand.\n\nThe couple seems to be doing great with things just the way they are. The two music stars flew to the Super Bowl with Gwen’s three children in tow — Kingston, 11, Zuma, 9, and Apollo, 3.\n\nMany are hoping Blake Shelton may even surprise fans and propose to Gwen Stefani at some point on The Voice.", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2018/02/Blake-Shelton-Gwen-Stefani-Proposal.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://secure.gravatar.com/avatar/be9e7ede81f5ed49321ffae1116e3851?s=250&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Heather Tooley"], "canonical_link": "https://www.inquisitr.com/4774907/report-that-blake-shelton-will-propose-to-gwen-stefani-on-valentines-day-is-untrue-debunked/", "title": "Report That Blake Shelton Will Propose To Gwen Stefani On Valentine’s Day Is Untrue [Debunked]", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}