{"url": "https://web.archive.org/web/20180605205653/https://thefederalistpapers.org/us/new-law-illegal-to-shower-and-do-laundry-on-same-day", "text": "California Governor Jerry Brown just signed a draconian new law that makes it illegal to take a shower, and do laundry on the same day:\n\nAssembly Bill 1668 establishes a limit of 55 gallons per person daily as the standard for indoor residential water use, starting in the year 2022. Violators will have to pay a fine of $1,000 per day during normal seasons and $10,000 per day if “the violation occurs in a critically dry year immediately preceded by two or more consecutive below normal, dry, or critically dry years,” the law states.\n\nAccording to the attentive folks at The Organic Prepper, this allotted water ration exceeds the amount required for taking a shower and doing a single load of laundry and excludes taking baths altogether.\n\nWriter Daisy Luther notes that an ordinary load of laundry uses about 40 gallons of water, while an eight-minute shower uses some 17 gallons of water. A bathtub holds 80 to 100 gallons of water. This means combining a shower and laundry on the same day would use 57 gallons of water, two gallons above the limit.\n\nAccording to the new law, the 55-gallon per person limit will be reduced even further in future years, dropping to 52.5 gallons per capita in 2025 and just 50 gallons per person in 2030.\n\nTo ensure compliance, the government of California urges the use of creative surveillance systems to spy on all residents. Utility providers will be obligated to report on violators, and urban retail water suppliers “shall use satellite imagery, site visits, or other best available technology to develop an accurate estimate of landscaped areas.”\n\nSo as not to overburden the wealthy, there will be “provisions for swimming pools, spas, and other water features,” the law states. …\n\nThe new, more aggressive mandatory water use levels set by the State Water Resources Control Board in coordination with the Department of Water Resources establish the initial indoor water allowance of 55 gallons per person per day and will also set an outdoor residential amount as well as a standard for system wide pipe leak losses.\n\nThis new law is ridiculous and will turn most honest, law abiding residents of California into lawbreakers.\n\nEven worse, the drought has technically ended in California, so these restrictions make no sense based on current conditions.\n\nIf the politicians who run the state really wanted to solve the problem they would have limited the amount of grass homeowners can plant, and ban swimming pools.\n\nInstead they come up with stupid rules, designed to harm those who can least afford it.\n\nFacebook has greatly reduced the distribution of our stories in our readers' newsfeeds and is instead promoting mainstream media sources. When you share to your friends, however, you greatly help distribute our content. Please take a moment and consider sharing this article with your friends and family. Thank you.", "images": ["https://web.archive.org/web/20180605205653im_/https://thefederalistpapers.org/wp-content/uploads/2018/06/dqwsvioes.jpg", "https://web.archive.org/web/20180605205653im_/http://b.scorecardresearch.com/p?c1=2&c2=20480112&cv=2.0&cj=1", "https://web.archive.org/web/20180605205653im_/https://www.facebook.com/tr?id=126343467805147&ev=PageView&noscript=1", "https://web.archive.org/web/20180605205653im_/https://pixel.quantserve.com/pixel?a.1=p-GPQDLS2Cn0Nhm.gif&a.2=p-d1x2X8_nNBHjc&labels=TFPP", "https://web.archive.org/web/20180605205653im_/https://d5nxst8fruw4z.cloudfront.net/atrk.gif?account=C1z2k1acFH002c", "https://web.archive.org/web/20180605205653im_/https://pixel.quantserve.com/pixel/p-s4EjFfr0LYkYa.gif", "https://web.archive.org/web/20180605205653im_/https://bh.contextweb.com/bh/set.aspx?action=add&pid=1&advid=5248&token=LCMHRD&do=add"], "top_img": "https://web.archive.org/web/20180605205653im_/https://thefederalistpapers.org/wp-content/uploads/2018/06/dqwsvioes.jpg", "keywords": [], "authors": ["Steve Straub"], "canonical_link": "https://web.archive.org/web/20180605205653/https://thefederalistpapers.org/us/new-law-illegal-to-shower-and-do-laundry-on-same-day", "title": "New Law Makes it Illegal to Shower and Do Laundry on Same Day", "meta_data": {"viewport": "width=device-width, initial-scale=1", "og": {"locale": "en_US", "type": "article", "title": "New Law Makes it Illegal to Shower and Do Laundry on Same Day", "description": "Wait, what?", "url": "https://web.archive.org/web/20180605205653/https://thefederalistpapers.org/us/new-law-illegal-to-shower-and-do-laundry-on-same-day", "site_name": "The Federalist Papers", "updated_time": "2018-06-05T06:56:54-07:00", "image": {"identifier": "https://web.archive.org/web/20180605205653im_/https://thefederalistpapers.org/wp-content/uploads/2018/06/dqwsvioes.jpg", "secure_url": "https://thefederalistpapers.org/wp-content/uploads/2018/06/dqwsvioes.jpg", "width": 800, "height": 419}}, "article": {"publisher": "https://www.facebook.com/TheFederalistPapers/", "section": "US", "published_time": "2018-06-05T06:26:21-07:00", "modified_time": "2018-06-05T06:56:54-07:00"}, "twitter": {"card": "summary", "description": "California Governor Jerry Brown just signed a draconian new law that makes it illegal to take a shower, and do laundry on the same day: Assembly Bill 1668 establishes a limit of 55 gallons per person daily as the standard for indoor residential water use, starting in the year 2022. Violators will have to pay…", "title": "New Law Makes it Illegal to Shower and Do Laundry on Same Day", "site": "@thefederalist1", "image": "https://web.archive.org/web/20180605205653im_/https://thefederalistpapers.org/wp-content/uploads/2018/06/dqwsvioes.jpg", "creator": "@thefederalist1", "dnt": "on"}, "generator": "WordPress 4.9.6", "fb": {"pages": 107705785934333, "app_id": 841007429350325}, "author": "Steve Straub", "msapplication-TileImage": "https://thefederalistpapers.org/wp-content/uploads/2018/02/cropped-tfpp_favicon.ico-270x270.png"}, "movies": [], "publish_date": 1528205181.0, "source": "https://web.archive.org", "summary": ""}