{"url": "http://thecaucus.blogs.nytimes.com/2008/08/15/mccain-in-colorado/", "text": "Updated: ASPEN — Senator John McCain is meeting with his top campaign advisers and donors here as they review his choices for vice president and strategize in advance of the Democratic convention.\n\nThey gathered as Mr. McCain gave a freewheeling performance at the Aspen Institute Thursday, where he discussed the conflict in the Caucasus and challenged a member of the audience to back up his accusations that Mr. McCain was a flip-flopper and where he lamented his own lack of appreciation for art and music.\n\nAnd at a fund-raising event earlier in the day — one of three –he told his donors that the daily tracking polls basically showed him tied with Senator Barack Obama, but he still called himself the underdog.\n\n“That’s what I relish and that’s what I like,’’ he said at the first fund-raiser, at the home of Frank and Pat Lynch in Edwards, Colo. He added that Mr. Obama has such a large staff that his entire campaign is “about the size of Senator Obama’s foreign-policy team.’’\n\n\n\nMany on his team, including Steve Schmidt and Rick Davis, gathered here, along with Senator John Thune of South Dakota, Gov. Jon Huntsman of Utah, former Senator Phil Gramm of Texas and Jack Kemp, the Republican vice presidential nominee in 1996. Colorado itself is considered one of the closest swing states in the country and is, of course, the site of the Democratic convention, which starts in a little more than a week.\n\nMr. McCain spent almost 90 minutes in a public conversation here in front of about 1,200 people at the Aspen Institute with Walter Isaacson, president of the institute, former chairman of CNN and the former editor of Time magazine. During the discussion, Mr. McCain criticized Vladimir V. Putin, Russia’s president turned prime minister and he called the current situation between Russia and Georgia, “the first probably serious crisis internationally since the end of the Cold War.”\n\n“My friends, we have reached a crisis, the first probably serious crisis internationally since the end of the Cold War,” Mr. McCain said. “This is an act of aggression. And historians and time will tell us how provoked it was or what actions the Georgian government took, et cetera. but the fact is this aggression is far exceeded any provocation that might have been inflicted on South Ossetia and Abkhazia.”\n\nMr. McCain was by turns impassioned in defending his record and wistful about his lack of cultural education. He also drew laughter when he objected to the idea of raising taxes to keep Social Security solvent, saying, “I have to be against the tax increases, as you know,” and drew groans when he suggested the price of gas here was $3.79 a gallon; in Aspen, it’s closer to $5 a gallon.\n\nAt one point, a member of the audience accused Mr. McCain of having moved away from his “maverick” stances and challenged him on his recent statement that Mr. Obama would rather lose a war if it meant winning an election. Did he mean to say that Mr. Obama was a traitor?\n\nIn a heated back and forth, Mr. McCain challenged the man, who said he was from Arizona and had voted for him, to specify the positions he had changed positions on. The man cited tax cuts and his fealty to the “Christian right.”\n\nMr. McCain said he had not supported President Bush’s tax cuts because they were not balanced by cuts in spending but that he had supported different tax cuts. And he said he was someone who sought reconciliation, both with the likes of the late Rev. Jerry Falwell and the Vietnamese, who had held him captive during the war.\n\nAs for whether he thought Mr. Obama was a “traitor,” Mr. McCain did not repeat the word and avoided a yes-or-no answer but gave an intense response.\n\nHe said he himself had been called “disloyal” by Republicans when he said the United States was losing the war in Iraq and that its strategy wouldn’t work. He said he had been “declared dead,” but he was reminded of Chairman Mao’s saying that “it’s always darkest before it’s totally black.” But, he added, Mr. Obama said the surge would fail, “he voted to cut off funding for the men and women who are serving in Iraq, he refuses to acknowledge that the surge succeeded.” He added: “I think he’s wrong and I think he used the issue of Iraq for political reasons to get the nomination of his party,” he said, to sustained applause.\n\nHe also implicitly criticized President Bush for not asking more of the nation after the 9/11 attacks. He said that by urging people to go shopping, “we passed up an opportunity” to ask them to join the Peace Corps or perform some sort of national service.\n\nHe also said he opposed a military draft because it wouldn’t work. “The kind of war they’re fighting requires long-term commitment,” he said. And a draft now would probably be as unjust as it was during Vietnam, he said, when people of privilege could avoid it.\n\nOn the lighter side, he joked about having once said that ABBA’s “Dancing Queen” was his favorite singing group, correcting the record to say his favorite song was Frank Sinatra’s “I’ve Got You Under My Skin.”\n\nHe said that if he’s “lacking in anything,” it is an appreciation for music and art and “the other great things in life,” partly because he missed out on popular music while he was a POW. Then he began defending ABBA adamantly.\n\n“Everybody says, ‘I hate ABBA, Oh, ABBA, how terrible, blah, blah, blah.’How come everybody goes to ‘Mamma Mia!?’” he said. “Everybody goes! They’ve been selling out for years.”\n\nAfter another question about Iraq, he voluntarily returned to the subject of his arrested aesthetic development.\n\n“I appreciate art,” he declared. “If there’s one thing I’m going to do and I have the opportunity, it’s to take a class in art.” He said he had seen a lot of art in the homes of supporters recently and that his daughter had graduated from Columbia with a degree in art history. He said he loved his education at the Naval Academy, he said, “but some of the things weren’t there that I would like to see.”\n\nHe then added, “But I make no excuses for my taste in music.”", "images": ["https://static01.nyt.com/images/blogs_v5/../icons/t_logo_291_black.png", "https://static01.nyt.com/images/2008/08/15/us/politics/johnmccain-aspen533.jpg", "https://static01.nyt.com/images/blogs_v5/thecaucus/thecaucus_post.png"], "top_img": "https://static01.nyt.com/images/blogs_v5/../icons/t_logo_291_black.png", "keywords": [], "authors": ["Katharine Q. Seelye", "Topics.Nytimes.Com Top Reference Timestopics People S Katharine_Q_Seelye Index.Html", "Arun Mehta", "Matt Schapiro", "Jp", "Milltown", "Bella Moody", "Long Tall Texan", "Steve Bolger"], "canonical_link": "//thecaucus.blogs.nytimes.com/2008/08/15/mccain-in-colorado/", "title": "McCain in Colorado", "meta_data": {"PT": "Blogs", "PST": "Blog Post", "sourceApp": "blogs", "blogpostid": 100000005204671, "author": "Katharine Q. Seelye", "CLMST": "Katharine Q. Seelye", "byl": "Katharine Q. Seelye", "article": {"author": "//topics.nytimes.com/top/reference/timestopics/people/s/katharine_q_seelye/index.html", "published_time": 1218801006, "modified_time": "2017-07-01T07:56:34-04:00", "section": "Politics", "tag": "The Caucus", "collection": "https://static01.nyt.com/services/json/sectionfronts/politics/index.jsonp"}, "GBLC": "The Caucus", "PUV": "normal", "PUD": 20080815, "pdate": 20080815, "ptime": 20080815075006, "utime": 20170701075634, "DISPLAYDATE": "August 15, 2008", "dat": "August 15, 2008", "CG": "Politics", "SCG": "thecaucus", "BN": "thecaucus", "robots": "noodp", "keywords": "The Caucus", "description": "Senator John McCain McCain gave a freewheeling performance at the Aspen Institute, where called the situation in the the Caucasus, “the first probably serious crisis internationally since the end of the Cold War.”", "hdl": "McCain in Colorado", "og": {"title": "McCain in Colorado", "type": "article", "url": "//thecaucus.blogs.nytimes.com/2008/08/15/mccain-in-colorado/", "site_name": "The Caucus", "description": "Senator John McCain McCain gave a freewheeling performance at the Aspen Institute, where called the situation in the the Caucasus, “the first probably serious crisis internationally since the end of the Cold War.”", "image": "https://static01.nyt.com/images/blogs_v5/../icons/t_logo_291_black.png"}, "thumbnail_150": "https://static01.nyt.com/packages/images/icons/t_logo_300_black.png", "twitter": {"card": "summary", "title": "McCain in Colorado", "url": "//thecaucus.blogs.nytimes.com/2008/08/15/mccain-in-colorado/", "description": "Senator John McCain McCain gave a freewheeling performance at the Aspen Institute, where called the situation in the the Caucasus, “the first probably serious crisis internationally since the end of the Cold War.”", "image": "https://static01.nyt.com/packages/images/icons/t_logo_300_black.png", "site": "@NYTPolitics"}, "thumbnail": "https://static01.nyt.com/packages/images/icons/t_logo_300_black.png", "adxPage": "blog.nytimes.com/thecaucus/post", "dfp-ad-unit-path": "politics/thecaucus"}, "movies": [], "publish_date": 1218729600.0, "source": "http://thecaucus.blogs.nytimes.com", "summary": ""}