{"url": "https://www.wwe.com/shows/totaldivas/article/natalya-total-divas-season-7-interview", "text": "When Total Divas premieres tomorrow for Season 7, Natalya will once again allow the WWE Universe behind the scenes. And that’s a bigger deal than you might think; The Queen of Harts has been a cast member on the E! reality show since its very first episode — one of only three Superstars to claim that honor — and the upcoming slate of episodes will showcase her run to the SmackDown Women’s Championship and the first-ever Women’s Money in the Bank Ladder Match. Natalya spoke with WWE about the season, dealing with Lana and the ever-increasing wealth of her cat.\n\nWWE.COM: Congratulations on the new season. How does it feel?\n\nNATALYA: Oh, thanks very much! It’s incredible to be going into our seventh season, and by the time the season finale happens, I’ll have been in 100 episodes of Total Divas. Which, to me, is crazy to think we’ve had the WWE Universe on this journey with us for 100 episodes, but it’s also a huge honor.\n\nWWE.COM: You are one of the few Superstars who has been on the show the entire time without leaving for a season and coming back. How does it feel to be one of the veterans of the show?\n\nTo be able to showcase [my] journey from Season 1 and have it finally reach fruition on Season 7 has been a dream come true. - Natalya\n\nNATALYA: I think it’s been, for me, a journey, to be on this show since day one. It’s so cool that I’ve been able to allow the audience to be on that journey with me, that roller coaster of life. And we’ve never, ever let cameras behind the scenes before like this. We’ve never done a reality show like this before. So, to be able to share with the world what it is that we do, what makes us laugh, what makes us cry, what drives us nuts, what gets on our nerves – being able to share that sisterhood with the girls is most important. My life in and out of the ring isn’t the five minutes you see me on SmackDown or Raw or WWE programming. There’s so much more. To get to work is a struggle sometimes. It’s planes, trains and automobiles; [the week of] Hurricane Irma we almost didn’t make it to SmackDown LIVE.\n\nTotal Divas allows us to document these journeys in and out of the ring and show you go through the heartaches and heartbreaks of life and the moments we come together like sisters. There are girls I love, but drive me crazy in the same breath. Like Lana. She’s really somebody that I’ve built a friendship with, but she’s like a sister. We have moments where we fight. I just came back from a tour of China with her, and in the same breath of me hugging her, I was ready to bodyslam her. And not in the ring. So, it’s really, really special. I’ve never once taken the show for granted, and to be on the show since the very beginning, I feel so honored that the WWE Universe and the upper brass and everybody that I work with can see me as somebody that people want to watch.\n\nWWE.COM: Alexa Bliss, Carmella and Nia Jax are joining the show this season. What was it like welcoming them into this weird little corner of the WWE world you occupy?\n\nYou see us on TV, and you think something of us, and then we bring you back down to earth, open up and show you we’re really just like everyone else. - Natalya\n\nNATALYA: When I look at my favorite TV shows — for example, “Seinfeld” is one of my all-time favorite TV shows – I love watching George, Elaine, Kramer and Jerry. They feel like friends to me. I feel like myself, Naomi and The Bella Twins are all old friends because we’re from the very, very beginning of the show. But I also love it when we get new cast members on because I think it really spices things up. It really adds to the flavor and keeps things moving and new. You love your friends, but you also love seeing and meeting new girls. Alexa, Nia and Carmella are girls I love, and I enjoy working with all of them. I respect those three girls very, very much. They’re great partners and opponents in the ring, but they’re also human. So, in real life, it’s great to showcase our friendship behind the scenes and how we interact with each other. It’s refreshing to have new blood. And Nia has a larger than life personality, and Alexa is so much more than what we see in the ring. She plays this mean girl on TV, but she’s so real and relatable in real life. She’s somebody that I just enjoy being around. And Carmella is one of my best friends on SmackDown. I’ve really become friends with her over the last year. I love hanging out with her and spending time with her. She’s become one of my close friends.\n\nWWE.COM: This season will also show your path to the SmackDown Women’s Championship. What was it like having the cameras rolling as you reached that goal?\n\nSince Day One of Total Divas, we’ve been documenting this journey of me trying to win the championship. And a lot of people thought it would never happen. - Natalya\n\nNATALYA: It’s such a crazy feeling that I got to reach my dream of becoming the Women’s Champion. Since Day One of Total Divas, we’ve been documenting this journey of me trying to win the championship. And a lot of people thought it would never happen, even some of my own co-workers. “You’ve never gonna get it, it’s not your time.” For me, I always felt in my heart it would happen, but I had to keep going, I had to persevere and not give up. And to be able to showcase that journey from Season 1 and have it finally reach fruition on Season 7 has been a dream come true. It’s a really great example for people — for women, especially, who watch the show, that when you have a dream, it’s important not to give up on it. There were so many times I wanted to throw in the towel and be like, “Maybe this isn’t for me anymore; maybe I don’t belong here anymore; maybe it’s not my time anymore; maybe my time has passed.” And that is just so very wrong now because I can truly say that within WWE, if I had said my time has passed, I never would have made history this past year the way I did.\n\nThere’s so many incredible things I’ve done in WWE. I was part of the first-ever Women’s Tables Match in WWE. I was part of the first-ever Women’s Ladder Match in WWE. At Hell in a Cell, I surpassed Trish Stratus’ record of having the most pay-per-view matches of any woman in the history of WWE. I’ve done all these monumental things, but the one thing I wanted to do was win the Women’s Championship. And now I get to share that joy on Total Divas. It’s the fairy-tale ending I dreamed of, and I’m so happy everybody gets to watch it.\n\nWWE.COM: This also appears to be the first season in a while where nobody’s getting married. Does that make it more or less stressful knowing you won’t have to travel to an exotic location for a ceremony this time around?\n\nNATALYA: Well, Lana took a lot out of all of us with that Bulgarian wedding. She had two weddings, so that was enough for a couple of seasons. Had a couple temper tantrums as well. [Laughs] I had to talk Lana off a couple ledges, but we made it through. It’s funny, because Lana’s actually become a close friend of mine, but that’s part of why I love her. She’s not afraid to have a temper tantrum and then apologize after. It’s part of what makes her Lana. And relatable. But there’ll be other things [we’ll see on this season.] We’ve seen weddings on every season, and that’s great because that’s really what happened. I really got married. Some people were like, “Oh, she just did that for the reality show.” No! I really got married. It was a real thing! I have a real marriage certificate. I really did that.\n\nI’ve never once taken the show for granted, and to be on the show since the very beginning, I feel so honored. - Natalya\n\nIf you watch Total Divas, even though we’re on TV every week, we all seem larger than life. You see Alexa winning championships and Nikki being featured on “Dancing with the Stars,” Maryse announcing her pregnancy and Lana jumping into new roles of not managing Rusev anymore but stepping into the ring. You see Carmella winning Money in the Bank and all these different things all of us girls are doing. But what I love the most about this show is that people can watch us and go, “they’re just like us!” They have the same fears, the same hopes, the same dreams, the same insecurities. We’re all human, and that’s what’s great about the show. You see us on TV, and you think something of us, and then we bring you back down to earth, open up and show you we’re really just like everyone else.\n\nWWE.COM: Last but not least, will we be seeing anymore of the iconic 2Pawz this year?\n\nNATALYA: Oh, you will definitely get to see more of the iconic 2Pawz. I’ve made sure to talk to Peyton Royce and Billie Kay about the word “iconic,” and they’re more than happy to lend it to me in talking about 2Pawz. Let me just tell you this: He’s as rich and famous as he’s ever been, and it’s only going to get better from here. He’s getting ready to drop a rap album, drop a perfume line, and he’s got a fleet of Pawzerattis in our garage ready to rock and roll for all the beautiful women that are lined up to have dates with him. Like a true reality star.\n\nWatch Natalya on Season 7 of Total Divas, Wednesdays at 9/8 C, only on E!.", "images": ["https://www.wwe.com/f/styles/medium/public/all/2019/10/SmackDown_2019_Vert_White--dfb28435b27ecf12e75406176c168c6a.png", "https://www.wwe.com/f/styles/medium/public/all/2019/09/NXT_2019--2b967d83b5c984deb297bb44180c54a6.png", "https://www.wwe.com/f/styles/medium/public/all/2019/09/Raw_Logo_Standard--fe61f0be3c871cf12f5a114a6f7163fe.png", "https://www.wwe.com/f/styles/og_image/public/all/2017/10/20171027_Divas_Nata--d31fc92ced0df640b79a7d458d167f66.jpg", "https://i.wwe9.com/s3s/wwesgk.svg", "https://www.wwe.com/f/styles/medium/public/all/2019/09/WrestleMania36--22b52b47beb16ab596b722067ebeec94.png", "https://www.wwe.com/sites/all/modules/custom/wwe_global_panes/assets/img/search.svg", "https://www.wwe.com/a/i/wwe_logo.svg", "https://www.wwe.com/sites/all/modules/custom/wwe_global_panes/assets/img/menu-hamburger.svg"], "top_img": "https://www.wwe.com/f/styles/og_image/public/all/2017/10/20171027_Divas_Nata--d31fc92ced0df640b79a7d458d167f66.jpg", "keywords": [], "authors": ["Published On", "October"], "canonical_link": "https://www.wwe.com/shows/totaldivas/article/natalya-total-divas-season-7-interview", "title": "Natalya tells all on Total Divas Season 7", "meta_data": {"description": "The Queen of Harts has plenty to say on Season 7 of E!’s long-running reality hit.", "viewport": "width=device-width, initial-scale=1.0", "generator": "Drupal 7 (https://drupal.org)", "fb": {"app_id": 295666513781415, "pages": "7175346442,9899376497,33887045472,138342286342525,10117648713,114016181979317,7550279682,143802942380921,141584589185157,8021824641,305386502866189,9752007795,322398166570,10858891900,139548194814,293038194109209,34835977009,10270726229,105683519512165,8707340185,42070558672,308511305840266,139499856068488,503299309732157,111122042270702,8089948555,8122075826,175516085907507,141015139413940,27972931696,10039630865,10035000964,9972312428,112125512167669,571239636259694,150788578283969,151211624898028,42888741032,221217241324634,132715530085136,461514070585983,591637937534154,63590429032,57781183973,21444496848,8164128018,108638722487440,118331791685642,927502337293315,107154386004809,58942629796,115997708455214,120944177917199,10136951825,232004136893724,289579461108998,272686572869074,45540674645,47282892409,157880890939081,862285853864605,474647032593162,193796414309566,8389000757,8460476234,181273445231240,118277891560596,281987278551284,255979821241182,22659986824,173551952663632,321466494134,298344150293189,235946186570791,111785418903429,113742442034500,986195791419925,20414840692,124579490919694,315841261378,226605254953,159574460828920,71312021102,203670263117340,8534058070,10404256094,153562294687663,496604583735248,159897937423755,39349844740,320819953158,168978160138750,244716860234,150739428656019,138766902819260,453667258164235,161183353943313,9751046449,134023959951421,9741201830,466732853451996,162469720536268,339512819431281,136214875329,187604334931656,24129632432,91882808772,678480412266551,1423994551184830,11210695876,501660730019981,791635687618100,121886247999584,1696659713891420,722269234551321,115057718536676,10217821531,171153283253989,138289549551243,297717876959979,721985301284939,255053651206737,164178197079932,704094239739339,583620978512097,967667496686197,388625081234979,100532840303131,500324770172126,561420164031551,496424867213664,169769543084215,810154195797137,936794186429102,1088219357919600,1132376810108830,600975470088343,255693281437534,173148819722371,223125081116805,174035009282192,966308473399279,291515254556321,830857547027607,671961632960256,816777921755120,106708166064193,173041266495918,185268515167447,809615072500268,339505363055646,179218995847632,1769879573282060,412859935456197,118829514964378,384193464978241,477205572332556,759868107494974,1402448446493750,379803548715763,1793654270916620,943115089039819,626051504235182,710152122421509,207093956457836,311969775901213,280015755784457,312759875755013,258449674609099,299974380462691,842175699267284,1797214130588960,673639742844902"}, "og": {"site_name": "WWE", "type": "article", "title": "Exclusive: Natalya tells all on Season 7 of Total Divas and new castmembers", "url": "https://www.wwe.com/shows/totaldivas/article/natalya-total-divas-season-7-interview", "description": "The Queen of Harts has plenty to say on Season 7 of E!’s long-running reality hit.", "image": "https://www.wwe.com/f/styles/og_image/public/all/2017/10/20171027_Divas_Nata--d31fc92ced0df640b79a7d458d167f66.jpg"}, "twitter": {"card": "summary_large_image", "site": "@wwe", "url": "https://www.wwe.com/shows/totaldivas/article/natalya-total-divas-season-7-interview", "title": "Exclusive: Natalya tells all on Season 7 of Total Divas and new castmembers", "description": "The Queen of Harts has plenty to say on Season 7 of E!’s long-running reality hit.", "image": "https://www.wwe.com/f/styles/wwe_large/public/all/2017/10/20171027_Divas_Nata--d31fc92ced0df640b79a7d458d167f66.jpg", "app": {"name": {"iphone": "WWE", "ipad": "WWE", "googleplay": "WWE"}, "id": {"iphone": 551798799, "ipad": 551798799, "googleplay": "com.wwe.universe"}}}, "apple-itunes-app": "app-id=551798799, affiliate-data=KCBikRHks4I, app-argument=https://www.wwe.com"}, "movies": [], "publish_date": null, "source": "https://www.wwe.com", "summary": ""}