{"url": "https://www.etonline.com/angelina-jolie-returning-acting-after-taking-time-family-situation-ive-been-needed-home-86621", "text": "Angelina Jolie is making her return to the big screen.\n\nThe 42-year-old director and actress has steadily become known for her work behind the camera -- her new film, First They Killed My Father, was recently well-received at the Telluride Film Festival -- but in a new interview, Jolie says she's set to make a return to acting. She also acknowledges that her split from Brad Pitt has affected her work schedule, explaining that she had to take time off due to their changing family dynamic.\n\n\"Right now I don't have anything to direct that I feel passionate about like this [First They Killed My Father], so I'll do some acting,\" she tells The Hollywood Reporter.\"I've taken over a year off now, because of my family situation, to take care of my kids.\"\n\nAngelina Jolie Brings Kids to Telluride Film Festival - See the Pics!\n\n\"When I feel it's time for me to go back to work, I'll be able to go back to work,\" she adds. \"I've been needed at home. I hope [to work again] in the months to come.\"\n\nJolie says her next project will most likely be a sequel to 2014's Maleficent, and that she's also seen a script for the much talked-about Cleopatra, though she hasn't committed to anything. She also makes it clear that although she is planning to return to acting, if it was up to her, she would solely direct.\n\n\"I would love to at some point,\" she says about making the switch. \"At some point, I'll probably just direct. If I'm allowed to. But you just don't know if you can have a career as a director. You don't know how things are going to be received.\"\n\nJolie's latest film, First They Called My Father -- about Cambodian refugee Loung Ung, who lived through the deadly Khmer Rouge in the late 1970s -- is clearly personal given that she adopted her oldest child, Maddox, from Cambodia when he was three months old. Maddox, now 16, is a producer on the film.\n\n\"Cambodia made me a mother,\" she says about why she chose to have a joint U.S.-Cambodian citizenship. \"Maddox -- that's the beginning of my family: Mad and I coming together was the beginning of so much. So I feel so connected to this country, and I was really honored and wanted to do great things for the country, and work in an even deeper way.\"\n\nOf course, Jolie says all of her kids -- including Pax, Shiloh, Zahara and twins Vivienne and Knox -- are respectful of other countries.\n\n\"Funnily enough, Shiloh speaks the most [Khmer], my middle girl, born in Namibia,\" she shares. \"My kids are from different countries, but there's an understanding, you don't have to like a country just because you were born in it. You need to respect all countries. And be very open to each other's, of course.\"\n\n\"Mad is very proud to be Cambodian; he loves languages,\" she continues. \"He's actually focused on German, Russian, Korean and French -- he's a linguist. He speaks a little Khmer, but I'm not forcing it. It's very important that he does as much as he wanted to do and that he loves it naturally. He was the one who said he wanted us to make the film. We'd had the script for a few years. We said, 'When you're ready -- because you're going to have to work with us -- go deep, research, be there.'\"\n\nWhy Brad Pitt and Angelina Jolie Have Slowed Down Their Divorce Process -- And No, They're Not Getting Back Together\n\nJolie has been increasingly candid about her split from Pitt, recently telling the Sunday Telegraph that she doesn't enjoy being single.\n\nWatch below:", "images": ["https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/ahngie.jpg?h=c673cd1c&itok=lglTssML"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/ahngie.jpg?h=c673cd1c&itok=lglTssML", "keywords": [], "authors": ["Antoinette Bueno"], "canonical_link": "https://www.etonline.com/angelina-jolie-returning-acting-after-taking-time-family-situation-ive-been-needed-home-86621", "title": "Angelina Jolie Returning to Acting After Taking Time Off for 'Family Situation': 'I've Been Needed at Home'", "meta_data": {"article": {"opinion": "false"}, "title": "Angelina Jolie Returning to Acting After Taking Time Off for 'Family Situation': 'I've Been Needed at Home' | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/angelina-jolie-returning-acting-after-taking-time-family-situation-ive-been-needed-home-86621", "title": "Angelina Jolie Returning to Acting After Taking Time Off for 'Family Situation': 'I've Been Needed at Home'", "description": "Angelina Jolie's next project will most likely be the 'Maleficent' sequel.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/ahngie.jpg?h=c673cd1c&itok=lglTssML", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "Angelina Jolie's next project will most likely be the 'Maleficent' sequel.", "title": "Angelina Jolie Returning to Acting After Taking Time Off for 'Family Situation': 'I've Been Needed at Home'", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Antoinette Bueno‍", "url": "https://www.etonline.com/angelina-jolie-returning-acting-after-taking-time-family-situation-ive-been-needed-home-86621", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/ahngie.jpg?h=c673cd1c&itok=lglTssML"}, "description": "Angelina Jolie's next project will most likely be the 'Maleficent' sequel.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, Angelina Jolie", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}