{"url": "www.harpersbazaar.com/uk/celebrities/news/a19871290/rachel-weisz-daniel-craig-marriage/", "text": "Daniel Craig and Rachel Weisz have confirmed that they are expecting their first child together.\n\nIt will be the second child for both, and marks a new chapter in their notoriously private relationship. Here's the story of how the two Hollywood stars got together, from the early days of friendship to tying the knot.\n\n\n\nThey have been friends for decades\n\nThis celebrity marriage might have come as a surprise to many, but in a 2012 interview with Marie Claire, Weisz revealed they had known each other for years. When asked if it was love at first sight with Craig, she responded: \"I'm going to change the subject... It wasn't really like that. We'd been friends for ages.\"\n\nBoth started their film careers in the early 1990s and had previous long-term relationships. In 1992, Craig married actress Fiona Loudon, with whom he had a daughter before divorcing in 1994. Weisz began dating American filmmaker and producer Darren Aronofsky in 2001. Their son was born in 2006.\n\nRachel Weisz and Daniel Craig at a screening of ’Enduring Love’ in New York, September 2004. Getty Images\n\nTheir romance reportedly started on a film set\n\nIn 2010, the thriller Dream House brought the two together. They played a married couple, with tabloids reporting that there was a chemistry between the actors on set in Canada. They made headlines in November that year when Weisz split from her partner of nine years, Darren Aronofsky. Despite rumours of their romance and a few paparazzi photographs of the co-stars together, both denied their relationship.\n\n\n\nThe relationship moved quickly\n\nIn June 2011, it was confirmed that Craig and Weisz had married in New York with just four guests present, including his daughter and her son. It came just six months after their relationship was first reported.\n\nThe couple are seen in the East Village on in March 2013. Getty Images\n\n\"We did it privately and we've got a lot of people to thank for that,\" said Craig in a 2015 interview with GQ. \"But that was the point; we did it for private reasons. The whole point is that it was a secret. A secret is a secret\".\n\nBoth have remained very quiet on the subject of their wedding, but in a recent interview with The Evening Standard Magazine, Weisz said: \"I wear my ring with pride.\"\n\nMarriage came naturally for the couple\n\nIn the same interview, Weisz explained that she never planned on marrying the James Bond star. \"I never thought I would get married,\" she said. \"It was not an ambition of mine. It was the opposite. I couldn’t relate to romantic comedies — marriage seems to be the whole point of them... Then it just happened, happily, at a more mature moment.\"\n\nAt the 2013 Oscars. Getty Images\n\nThey leave work at work\n\n\"I don’t talk about my work, and nor does he. It’s very private,\" Weisz told The Sun in 2013. \"There is nothing worse than two actors getting together and talking about acting. It’s like the end — it’s the worst.\"\n\nAs for being married to one of the most famous fictional characters of all time? In her 2017 interview with Harper's Bazaar, Weisz said: \"I did Lorraine [the ITV breakfast show] this morning, and she said, 'So, you're married to Bond!' And I said, 'No, I'm married to someone who pretends to be that character'.\"\n\nAt The 11th Annual Night of Opportunity Gala in New York, April 2018. Getty Images\n\nThey like the quiet life\n\nAside from the odd red carpet appearance, the couple, who live in New York, like to keep a low profile. \"I love to cook. Daniel is also very good at it,\" Weisz said in 2015. \"We always enjoy trying out different kinds of cuisine and having fun with that.\"", "images": ["http://www.harpersbazaar.com/sites/harpersbazaar/assets/images/logos/ipso_regulated_hires.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/daniel-rachel-1524235637.jpg?crop=1.00xw:0.695xh;0,0.0203xh&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/daniel-rachel-1524235637.jpg?crop=1.00xw:0.695xh;0,0.0203xh&resize=1200:*", "keywords": [], "authors": ["Katie Frost"], "canonical_link": "https://www.harpersbazaar.com/uk/celebrities/news/a19871290/rachel-weisz-daniel-craig-marriage/", "title": "Rachel Weisz and Daniel Craig have the most interesting love story", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#606060", "og": {"type": "article", "site_name": "Harper's BAZAAR", "title": "Rachel Weisz and Daniel Craig have the most interesting love story", "description": "A match made in Hollywood", "url": "https://www.harpersbazaar.com/uk/celebrities/news/a19871290/rachel-weisz-daniel-craig-marriage/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/daniel-rachel-1524235637.jpg?crop=1.00xw:0.695xh;0,0.0203xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 214308048603671}, "article": {"publisher": "https://www.facebook.com/harpersbazaaruk", "modified_time": "2018-04-20 03:08:56", "published_time": "2018-04-20 02:54:00", "section": "Celebrity news", "opinion": "false"}, "twitter": {"site": "@BazaarUK", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/daniel-rachel-1524235637.jpg?crop=1.00xw:0.695xh;0,0.0203xh&resize=640:*"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "title": "Rachel Weisz and Daniel Craig relationship history - from marriage to baby", "description": "Daniel Craig and Rachel Weisz​ have confirmed they are expecting their first child​​​ together. Here's the story of how the two Hollywood stars fell in love, from the early days of dating to tying the knot.", "keywords": "Daniel Craig, Rachel Weisz", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/daniel-rachel-1524235637.jpg?crop=0.725xw:1.00xh;0.138xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrity,celebrities,news,Daniel Craig,Rachel Weisz", "sailthru.date": "2018-04-20T14:54:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/daniel-rachel-1524235637.jpg?crop=1.00xw:0.695xh;0,0.0203xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/daniel-rachel-1524235637.jpg?crop=0.725xw:1.00xh;0.138xw,0", "sailthru.socialtitle": "Rachel Weisz and Daniel Craig have the most interesting love story", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1524164040.0, "source": "http://www.harpersbazaar.com", "summary": ""}