{"url": "https://en.wikipedia.org/wiki/Chris_Cornell", "text": "American singer-songwriter, musician\n\nChristopher John Cornell (né Boyle; July 20, 1964 – May 18, 2017) was an American singer, songwriter, and musician, best known as the lead vocalist and rhythm guitarist for the rock bands Soundgarden and Audioslave, and for his numerous solo works and soundtrack contributions. Cornell was also the founder and frontman of Temple of the Dog, a one-off tribute band dedicated to his late friend Andrew Wood.\n\nCornell is considered one of the chief architects of the 1990s grunge movement, and is well known for his extensive catalog as a songwriter, his nearly four-octave vocal range,[2] and his powerful vocal belting technique. He released four solo studio albums, Euphoria Morning (1999), Carry On (2007), Scream (2009), and Higher Truth (2015); the live album Songbook (2011); and two compilations, The Roads We Choose (2007) and Chris Cornell (2018), the latter released posthumously. He received a Golden Globe Award nomination for his song \"The Keeper\", which appeared in the 2011 film Machine Gun Preacher, and co-wrote and performed \"You Know My Name\", the theme song to the 2006 James Bond film Casino Royale. His last solo release before his death was the charity single \"The Promise\", written for the ending credits for the 2016 film of the same name.\n\nAcross his entire catalog, Cornell sold 14.8 million albums, 8.8 million digital songs, and 300 million on-demand audio streams in the U.S. alone,[3][4] as well as over 30 million records worldwide.[5][6][7] He was nominated for 16 Grammy Awards, winning three.[8][9] He was voted \"Rock's Greatest Singer\" by readers of Guitar World,[10] and ranked No. 4 on the list of \"Heavy Metal's All-Time Top 100 Vocalists\" by Hit Parader,[11] No. 9 on the list of \"Best Lead Singers of All Time\" by Rolling Stone,[12] and No. 12 on MTV's \"22 Greatest Voices in Music\".[13]\n\nCornell struggled with depression for most of his life. He was found dead in his Detroit hotel room in the early hours of May 18, 2017, after performing at a Soundgarden concert an hour earlier at the Fox Theatre. His death was ruled a suicide by hanging.[3]\n\nEarly life\n\nCornell was born Christopher John Boyle on July 20, 1964,[14][15] in Seattle, Washington, where he was raised. His parents are Edward F. Boyle,[16] a pharmacist of Irish Catholic descent,[17][18] and Karen Cornell,[16][18] an accountant and self-proclaimed psychic of Jewish background.[19][17][20][21] After his parents' divorce when he was a teenager, he and his siblings adopted their mother's maiden name, Cornell, as their surname.[20][14] Cornell was one of six children; he had two older brothers and three younger sisters.[14] He attended Christ the King, a Catholic elementary school,[22] where he performed for the first time in front of a crowd, singing the 1960s anti-war song \"One Tin Soldier\".[22] He later attended Shorewood High School.[23][24] When he was in seventh grade, his mother pulled him and his sister out of Catholic school; Cornell claimed because they were about to be expelled for being too inquisitive.[25] Cornell recalled the episode in a 1994 interview: \"With a religion like that, it's not designed for anyone to question. Being young people who have a natural curiosity and half a brain, you're going to start finding inconsistencies, which there are tons of in organized religion. We both sort of made it clear in classroom situations that we didn't get it. 'Explain this to me.' And they couldn't, so we started creating a lot of problems.\"[25]\n\nCornell traced his musical influences back to Little Richard via The Beatles.[26] He spent a two-year period between the ages of nine and eleven solidly listening to The Beatles after finding a large collection of Beatles records abandoned in the basement of a neighbor's house.[27] He described himself at this age as a loner; he was able to deal with his anxiety around other people through rock music.[28] During his teenage years, he spiraled into severe depression, dropped out of school, and almost never left the house.[29] At the age of 12, he had access to alcohol, marijuana, LSD, psilocybin mushrooms and prescription drugs; he used them daily by 13, stopped for a year, but relapsed at age 15 for another year until he turned to music.[30][31] At 14, he had a bad PCP experience and later suffered from panic disorder and agoraphobia.[32]\n\nCornell took piano and guitar lessons as a child.[30] He once explained that his mother saved his life when she bought him a snare drum, the instrument he adopted in beginning his path to become a rock musician.[20] Before becoming a successful musician, he worked as a busboy,[33] as a dishwasher,[33] as a fish monger at a seafood wholesaler[29] and was a sous-chef at Ray's Boathouse in Seattle.[34]\n\nIn the early 1980s, Cornell was a member of a cover band called The Shemps, which featured bassist Hiro Yamamoto and performed around Seattle.[35] After Yamamoto left The Shemps, the band recruited guitarist Kim Thayil.[35] Cornell and Yamamoto stayed in contact, and after The Shemps broke up, the pair started jamming together, eventually bringing Thayil in to join them.[35]\n\nRecording career\n\n1984–1997 and 2010–2017: Soundgarden\n\nSoundgarden was formed in 1984 by Cornell, Thayil and Yamamoto with Cornell originally on drums and vocals. In 1985, the band enlisted Scott Sundquist as the drummer to allow Cornell to concentrate on vocals.[36] The band's first recordings were three songs that appeared on a compilation for C/Z Records called Deep Six. In 1986, Sundquist, who by that point had a wife and a child, decided to leave the band and spend time with his family.[35] He was replaced by Matt Cameron, the drummer for Skin Yard, who became Soundgarden's permanent drummer.[35]\n\n\"Flower\" Ultramega OK. The song's intro features \"Flower\" was the only single released from. The song's intro features Kim Thayil blowing across his guitar strings. Problems playing this file? See media help.\n\nSoundgarden signed to Sub Pop, releasing the Screaming Life EP in 1987 and the Fopp EP in 1988 (a combination of the two was issued as Screaming Life/Fopp in 1990). Though the band was being courted by major labels, they signed to independent label SST Records in 1988 to release their debut album, Ultramega OK, for which they earned a Grammy Award nomination for Best Metal Performance in 1990.[37] The band subsequently signed with A&M Records, becoming the first grunge band to sign to a major label.[29]\n\nIn 1989, the band released their second effort and their first album for a major label, Louder Than Love. Following the album's release, Yamamoto left the band to finish his master's degree in physical chemistry at Western Washington University.[38] He was replaced by former Nirvana guitarist Jason Everman. Everman was fired following Soundgarden's tour supporting Louder Than Love. In 1990, the band was joined by a new bassist, Ben Shepherd.[39]\n\nAlong with Nirvana, Alice in Chains, and Pearl Jam, Soundgarden quickly became one of the most successful bands from Seattle's emerging grunge scene in the early 1990s. With Shepherd, the new line-up recorded Badmotorfinger in 1991. The album brought the band to a new level of commercial success, and Soundgarden found itself amidst the sudden popularity and attention given to the Seattle music scene. Badmotorfinger included the singles \"Jesus Christ Pose\", \"Outshined\" and \"Rusty Cage\". The three singles gained considerable airtime on alternative rock radio stations, while the videos for \"Outshined\" and \"Rusty Cage\" gained considerable airtime on MTV. The song \"Jesus Christ Pose\" and its music video was the subject of widespread controversy in 1991, and the video was removed from MTV's playlist. \"Rusty Cage\" was later covered by Johnny Cash on his 1996 album, Unchained. It also appeared on the fictional radio station Radio X in the 2004 video game Grand Theft Auto: San Andreas and in the 32-bit version of Road Rash. \"Room a Thousand Years Wide\" was released (along with the B-side \"HIV Baby\") as a 7\" single through Sub Pop's Single of the Month club a full year before the release of Badmotorfinger, and later re-recorded for the album. Badmotorfinger exposed Soundgarden to its first mainstream success: it was nominated for a Grammy Award for Best Metal Performance in 1992,[37] and was later ranked number 45 in the October 2006 issue of Guitar World on the magazine's list of the 100 greatest guitar albums of all time.[40]\n\nThe band's fourth studio album, 1994's Superunknown, proved to be the band's breakthrough album. Upon its release in March 1994, Superunknown debuted at number one on the Billboard 200.[41] The album launched several successful singles, including \"Spoonman\" and \"Black Hole Sun\", and brought Soundgarden international recognition. Superunknown achieved quintuple platinum status in the United States,[42] triple platinum status in Canada,[43] and gold status in the United Kingdom,[44] Sweden,[45] and the Netherlands.[46] Rolling Stone gave Superunknown four out of five stars. Reviewer J.D. Considine said Superunknown \"demonstrates far greater range than many bands manage in an entire career.\" Considine criticized \"Black Hole Sun\" and \"Half\", stating that the former is \"not a very good song\" while the latter \"is the virtual definition of a B-side.\"[47] Jon Pareles of The New York Times said that \"Superunknown actually tries to broaden its audience by breaking heavy-metal genre barriers that Soundgarden used to accept.\" He added that \"Soundgarden ... want[s] something different from standard heavy metal.\"[48] David Browne of Entertainment Weekly gave the album an A, saying \"Soundgarden is pumped and primed on Superunknown, and they deliver the goods.\" He praised it as a \"hard-rock milestone—a boiling vat of volcanic power, record-making smarts, and '90s anomie and anxiety that sets a new standard for anything called metal.\"[49] The album was nominated for the Grammy Award for Best Rock Album in 1995.[50] Two singles from Superunknown, \"Black Hole Sun\" and \"Spoonman\", won Grammy Awards,[37] and the music video for \"Black Hole Sun\" won a MTV Video Music Award and a Clio Award.[51] Superunknown was ranked number 336 on Rolling Stone magazine's list of the 500 greatest albums of all time,[52] and \"Black Hole Sun\" was ranked number 25 on VH1's list of the 100 greatest songs of the '90s.[53]\n\n\"Burden in My Hand\" \"Burden in My Hand\" was the second single released from Down on the Upside. The song was written by Cornell and blends acoustic and electric instrumentation. Problems playing this file? See media help.\n\nThe band's fifth album was 1996's self-produced Down on the Upside. The album spawned several singles, including \"Pretty Noose\", \"Burden in My Hand\" and \"Blow Up the Outside World\". The album was notably less heavy than the group's preceding albums, and marked a further departure from the band's grunge roots. Soundgarden explained at the time that it wanted to experiment with other sounds.[54] David Browne of Entertainment Weekly said, \"Few bands since Led Zeppelin have so crisply mixed instruments both acoustic and electric.\"[55]\n\nHowever, tensions within the group arose during the sessions, with Thayil and Cornell reportedly clashing over Cornell's desire to shift away from the heavy guitar riffing that had become the band's trademark.[56] Despite favorable reviews, the album did not match the sales of Superunknown.[42]\n\nIn 1997, Soundgarden received another Grammy nomination, for the lead single \"Pretty Noose\".[37] As tensions grew within the band, reportedly due to internal strife over its creative direction, Soundgarden announced it was disbanding on April 9, 1997. In a 1998 interview, Thayil said, \"It was pretty obvious from everybody's general attitude over the course of the previous half-year that there was some dissatisfaction.\"[57]\n\nCornell, Cameron and Shepherd performing with Soundgarden at Lollapalooza 2010\n\nOn January 1, 2010, Cornell alluded to a Soundgarden reunion via his Twitter account, writing: \"The 12-year break is over and school is back in session. Sign up now. Knights of the Soundtable ride again!\" The message linked to a website that featured a picture of the group performing live and a place for fans to enter their e-mail address to get updates on the reunion. Entering that information unlocked an archival video for the song \"Get on the Snake\", from Soundgarden's second studio album, 1989's Louder Than Love.[58]\n\nIn March 2010, Soundgarden announced that they would be headlining Lollapalooza 2010. Soundgarden made the announcement through their website and email list.[59] On April 16, 2010, Soundgarden held a secret show at the Showbox Theater on First Avenue in downtown Seattle, publicized via the band's mailing list. The show was billed as Nudedragons, an anagram for Soundgarden.[60]\n\nAsked in August 2010 if Soundgarden would record new material, Cornell replied, \"it would be exciting to record one song, to hear how Soundgarden-ish that might be this much time later. But for me, it's been more of a trip relearning the songs and playing them together. Some of the songs we're approaching we've never played live.\"[61]\n\nSoundgarden made their first television appearance since their reunion on the second episode of Conan O'Brien's show on TBS, Conan, on November 9, 2010, and toured North America in summer 2011.[citation needed] In summer 2012, Soundgarden released a new single and video, \"Live to Rise\", for The Avengers movie soundtrack.[62] Their sixth album, King Animal, was released in November 2012 to largely positive reviews.[63]\n\nSoundgarden had continued to tour worldwide, and guitarist Kim Thayil mentioned in several interviews that the band was to begin work on material for their seventh album.[64]\n\nFollowing Cornell's death, the surviving members of Soundgarden discussed the possibility of moving on with a replacement for him,[65][66][67] but Thayil confirmed in an October 2018 interview with Seattle Times that the band had once again dissolved.[68] Thayil said in an interview with Music Radar in July 2019 that the surviving members of Soundgarden are trying to finish and release the album they were working on with Cornell. However, the master files of Cornell's vocal recordings are currently being withheld and they can't finish the album.[69]\n\n1998–2000 and 2006–2017: Solo career\n\nIn 1998, Cornell began working on material for a solo album on which he collaborated with Alain Johannes and Natasha Shneider of the band Eleven. The album, titled Euphoria Morning, was released on September 21, 1999. In his first ever solo tour Cornell spent seven months on the road from September 13, 1999 to March 7, 2000 playing 61 shows[70] in support of Euphoria Morning. Cornell performed two of those coinciding with the debut of the album on September 21 and 22, 1999 at the Henry Fonda Theater in Hollywood California. Attendance for the shows were high, considering he performed the initial shows before fans were even familiar with the music. The touring band was made up of some of the contributing musicians Alain Johannes, Natasha Shneider, Rick Markmann, and Greg Upchurch. The album proved commercially unsuccessful selling 393,000 copies in the U.S.,[71] although the album's single \"Can't Change Me\" was nominated for Best Male Rock Vocal Performance at the 2000 Grammy Awards.[72] Cornell recorded a version of Can't Change Me in French,[73] this version is a bonus on Euphoria Morning's deluxe version and on the Japanese and Europeans editions.[74] The album includes \"Wave Goodbye\", Cornell's tribute to his late friend Jeff Buckley.[75][76] It has been noted that Euphoria Morning is influenced by Buckley's songwriting and distinctive vocal style.[75] The album was re-released in 2015 on CD and vinyl and retitled Euphoria Mourning, with Cornell stating in the press release that he had originally intended the album to be called that, but his manager at the time, Jim Guerinot, suggested that \"Euphoria Morning\" without the \"u\" would be a better title. \"The title was so beautifully poetic to begin with, just the concept of euphoria in mourning; it was a moment I felt inspired and I let all the air out of it. So when we decided to do its first vinyl release I thought, I want to change the fuckin' title! [Laughs] It's time to change it,\" Cornell stated.[33]\n\nAn unreleased song called \"Heart of Honey\" was also recorded in collaboration with Johannes and Shneider during this period. According to Alain Johannes,[77] \"Heart of Honey\" was recorded for the film Titan A.E. but not used. The song leaked on the internet.[78] While on his solo tours between 2011–2016, Cornell would often pay tribute to the late Natasha Shneider and play the song \"When I'm Down\", (from the album Euphoria Morning that Shneider produced) accompanied by a vinyl recording of the original piano track that Shneider performed for the song.[79][80][81][82]\n\n\"Billie Jean\" unplugged From the live album Chris Cornell: Unplugged in Sweden Problems playing this file? See media help.\n\nThough not officially released onto CD, an hour-long acoustic concert Cornell performed on September 7, 2006 at O-Baren in Stockholm, is widely available for download under the title Chris Cornell: Unplugged in Sweden. A promotional CD for his solo album, Carry On, was released in March 2007, titled The Roads We Choose – A Retrospective. The 17-song CD included songs from Soundgarden, Temple of the Dog, Audioslave and Cornell's solo work.\n\nOn June 5, 2007, Cornell released his second solo album, Carry On, produced by Steve Lillywhite. It debuted at number 17 on the American Billboard charts. Among the artists who accompanied him on his second solo release was friend Gary Lucas, who contributed acoustic guitar to some of the tracks. Cornell stated that he was always writing, and that there were some songs that he was not able to put onto an Audioslave album.[83] While recording his second solo album, Cornell was involved in a motorcycle accident. He was apparently \"rear-ended by a truck in Studio City, Los Angeles while riding his motorcycle\" and \"catapulted 20 feet into the air.\" He was able to walk away from the accident, but had severe cuts and bruises. He returned to the studio later that day.[84]\n\nCornell performing live in Melkweg in Amsterdam , the Netherlands in 2007\n\nIn 2007, Cornell appeared as support to Aerosmith on at least two legs of their 2007 world tour[85]—Dublin, London, and Hyde Park—and to Linkin Park in Australia and New Zealand.[86] These shows formed part of his own ongoing world tour which began in April 2007 and continued into 2008 and 2009. Cornell described his touring band—comprising guitarists Yogi Lonich and Peter Thorn, bassist Corey McCormick and drummer Jason Sutter—as \"musicians that could get the whole picture\" playing music by Soundgarden and Audioslave, as well as his solo material.[87]\n\nIn 2008, Cornell was featured on the Main Stage of Linkin Park's Projekt Revolution tour.[88] Throughout the tour, Cornell collaborated with Linkin Park's Chester Bennington while performing \"Hunger Strike\", and with Street Drum Corps for a number of his Soundgarden tracks.[89] While Linkin Park would perform their Grammy-winning song \"Crawling\", he would appear on stage singing the second verse of the song, the outro, and harmonies Aaron Lewis provided for the Reanimation version.[89]\n\nCornell worked with producer Timbaland on his studio album Scream, which was released on March 10, 2009.[90] Timbaland has referred to the recording sessions as \"The best work I've done in my career,\" and predicted that Cornell will be the \"first rock star in the club\". Cornell called the new album \"a highlight of my career\". The album was largely panned by critics,[91][92][93] but was the highest charting album of Cornell's solo career, reaching No. 10 on the Billboard 200.[94][95]\n\nChris Cornell performing at Quart Festival 2009, Kristiansand, Norway\n\nOn April 2, 2009, Cornell took over Atlanta Rock station, Project 961, WKLS. For 24 hours the station became \"Chris-FM\" and included a two-hour special of Cornell DJing and playing his favorite songs of his career with the stories behind them leading up to a rebroadcast of his solo show from the previous night.[96] On September 11, 2009, Cornell performed John Lennon's \"Imagine\" on The Tonight Show with Conan O'Brien.[97]\n\nIn January 2011, Cornell announced his solo acoustic \"Songbook\" tour, continuing a series of acclaimed solo acoustic shows in Los Angeles during 2009 and 2010. The first leg of the sold-out tour began on April 1, 2011 and continued through the U.S. and Canada until May 6, resuming in October and visiting New Zealand, Australia, South America and the U.S. again before ending on December 17. The tour received universally positive reviews.[98]\n\nIn November 2011 Cornell, released Songbook, an acoustic live album featuring songs recorded during Cornell's \"Songbook\" tour in North America. It was his first live album as a solo artist, and it included stripped-down performances of songs from his entire career as a solo artist as well as with Soundgarden, Audioslave, and Temple of the Dog, plus covers of Led Zeppelin's \"Thank You\" and John Lennon's \"Imagine\". The album received largely positive reviews, with AllMusic calling it Cornell's \"best solo offering to date\".[99] Cornell continued his \"Songbook\" tour in Europe and the U.S. during 2012 and 2013 to further acclaim.[100][101]\n\nCornell performed a 10-minute acoustic set at the Commander-in-Chief's Ball in the White House on January 21, 2013, which recognized Medal of Honor recipients and Wounded Warriors. He returned later in the evening with Soundgarden to perform at Barack Obama's Inaugural Ball, doing a three-song set at the event.[102]\n\nIn January 2015, Cornell announced via his Twitter account that he was in the studio recording a new solo album. Cornell's last studio album, Higher Truth, was released on September 18, 2015.[103] The last solo release prior to his death was the charity single \"The Promise\", written for the ending credits for the movie of the same name about the Armenian Genocide.[104] Prior to his death, Cornell committed all proceeds from the song to support refugees and vulnerable children.[105]\n\nOn February 26, 2018, Cornell's first posthumous song was released. He composed the music and added lyrics[106] to Johnny Cash's poems \"You Never Knew My Mind\" and \"I Never Knew Your Mind\". The song, titled \"You Never Knew My Mind\", is featured on the album Johnny Cash: Forever Words, a collection of songs created from Cash's unused poetry, lyrics and letters interpreted by several artists.[107]\n\nIn 2019, Cornell won a posthumous Grammy award in the Best Rock Performance category at the 61st Grammy Awards for his single \"When Bad Does Good\".[108]\n\n2001–2007: Audioslave\n\nAudioslave was formed after Zack de la Rocha left Rage Against the Machine and the remaining members were searching for another vocalist. Producer and friend Rick Rubin suggested that they contact Cornell. Rubin played the Soundgarden song \"Slaves & Bulldozers\" for the remaining Rage Against the Machine band members to showcase his ability. Cornell was in the writing process of a second solo album, but decided to shelve that and pursue the opportunity to work with Tom Morello, Tim Commerford and Brad Wilk when they approached him. Morello described Cornell: \"He stepped to the microphone and sang the song and I couldn't believe it. It didn't just sound good. It didn't sound great. It sounded transcendent. And ... when there is an irreplaceable chemistry from the first moment, you can't deny it.\"[109] The quartet wrote 21 songs during 19 days of rehearsal and began working in the studio in late May 2001.[110][111]\n\nTheir debut album, Audioslave, released in November 2002, spawned hits such as \"Cochise\", \"Like a Stone\" and \"Show Me How to Live\", and has reached triple platinum status in the United States. The band was nearly derailed before the album's release; Cornell was going through alcohol problems and a slot on the Ozzfest tour was canceled.[34] During this time, there was a rumor that Cornell had checked himself into drug rehabilitation. He later confirmed it in an interview with Metal Hammer that was conducted from a clinic payphone.[112] In a San Diego CityBeat article, Cornell explained that he went through \"a horrible personal crisis\" during the making of the first record, staying in rehab for two months and separating from his wife. The problems were ironed out and Cornell remained sober.[113] The band toured through 2003,[114] before resting in 2004 to record their second album.[115]\n\nAudioslave's second album, Out of Exile, was released in May 2005 and debuted at number one on the U.S. charts. The album has since gone on to achieve platinum status.[116] The album features the singles \"Out of Exile\", \"Be Yourself\", \"Your Time Has Come\" and \"Doesn't Remind Me\". Cornell admitted to writing his most personal songs ever on this album, influenced by the positive changes in his life since 2002.[117] He also described the album as more varied than the debut and relying less on heavy guitar riffs.[113] Critics initially described Audioslave as an amalgamation of Rage Against the Machine and Soundgarden,[118] but by the band's second album, Out of Exile, noted that they had established a separate identity. The album was received more favorably than Audioslave's debut; critics noted Cornell's stronger vocals, likely the result of quitting smoking and drinking,[119] and pointed out that Out of Exile is \"the sound of a band coming into its own\".[120] AllMusic praised the album as \"lean, hard, strong, and memorable\".[121]\n\nOn May 6, 2005, Audioslave played a free show in Havana, Cuba.[122] Audioslave became the first American rock group to perform a concert in Cuba, playing in front of an audience of 70,000.[123] The band traveled to Havana on May 4 to interact with Cuban musicians.[124] Cornell commented: \"Hopefully, this concert will help to open the musical borders between our two countries.\" The 26-song set concert was the longest the band had ever played.[125]\n\nIn early 2006 the band returned, recording their third album as they had written most of the material during the tour. The band released the album, titled Revelations, in September 2006. Revelations was influenced by 1960s and 1970s funk and R&B music.[126] The first two singles were \"Original Fire\" and \"Revelations\". Two of the songs from the third album, \"Shape of Things to Come\" and \"Wide Awake\" were also prominently featured in Michael Mann's 2006 film, Miami Vice, prior to the release of the album. Despite the exposure to other forms of media and the positive critical buzz for their third album, Audioslave did not tour behind the release. They went into hiatus to allow Cornell to complete \"You Know My Name\", the theme song for the 2006 James Bond film, Casino Royale, and Morello to pursue his own solo work under the moniker of the Nightwatchman.[127]\n\nAll of Audioslave's lyrics were written by Cornell, whilst all four members were credited with writing the music. Their songwriting process was described by Wilk as \"more collaborative\" and \"satisfying\" than Rage Against the Machine's, which was \"a battle creatively\". Cornell, for his part, saw Soundgarden's songwriting method as inferior to Audioslave's.[128][129] Cornell's lyrics were mostly apolitical; Audioslave's Morello referred to them as \"haunted, existential poetry\".[130] They were characterized by his cryptic approach, often dealing with themes of existentialism,[131] love, hedonism,[132] spirituality and Christianity.[130] Cornell's battle with addiction to prescription drugs and alcoholism was a defining factor in the writing and recording process. Even though the singer admitted that he was \"never able to write effectively\" while drinking,[133] and attended rehab after recording the debut album, Morello stated that Revelations was \"the first record [Cornell] didn't smoke, drink, or take drugs through the recording.\"[134] However, Morello said: \"Chris was stone sober during the making of our Out of Exile album. Chris was also sober during the making of Revelations and prior to recording he gave up smoking as well. I apologize for any confusion or concern that was stirred up by the original article. Sobriety can be a matter of life or death and Chris's courage in maintaining his health for years has been an inspiration.\"[135]\n\nNews about Cornell's departure emerged in July 2006, when insiders stated that after the third album he would leave to pursue for a solo career. The singer immediately denied the rumors, stating: \"We hear rumors that Audioslave is breaking up all the time. [...] I always just ignore [them].\"[127] On February 15, 2007, Cornell officially announced his departure from Audioslave, stating that \"Due to irresolvable personality conflicts as well as musical differences, I am permanently leaving the band Audioslave. I wish the other three members nothing but the best in all of their future endeavors.\"[136] As the other three members were busy with the Rage Against the Machine reunion with de la Rocha coming back, and Morello and Cornell had each released solo albums in 2007, Audioslave officially disbanded.[137][138]\n\nOn January 17, 2017, it was announced that Audioslave would reunite for their first show in twelve years at Prophets of Rage's Anti-Inaugural Ball, protesting President Donald Trump's inauguration as President of the United States.[139] The event took place on January 20, 2017.[140]\n\nAsked in February 2017 if there would be more Audioslave reunion shows in the future, frontman Cornell replied, \"It's always a possibility. I mean, we've been talking about it for at least three or four years now. We were talking about actually picking dates, and it just ended up not working out because everybody's so busy. They have another band again, they all have separate bands that they do themselves, I have Soundgarden and a solo career that's taking up a lot of time, and I just did Temple of the Dog. So, it's really honestly as simple as we end up having a window of time where it's comfortable for everybody and we want to do it, because I definitely feel like everybody's up for it.\"[141]\n\nOther musical projects\n\nCenter for Disease Control Boys\n\nFrom 1986 to 1987, Cornell was also a member of the satirical Western swing band Center for Disease Control Boys.[142]\n\nTemple of the Dog\n\nWhile still in Soundgarden, Cornell recorded an album with members of what would become Pearl Jam. This collaboration went under the name Temple of the Dog, and the self-titled album was released in 1991. The album is a tribute to their mutual friend, and Cornell's former roommate,[143] Andrew Wood. Wood, the former lead singer of Mother Love Bone, had died of a heroin overdose the year before. Jeff Ament and Stone Gossard of Mother Love Bone teamed up with Mike McCready, new vocalist Eddie Vedder, and drummer Dave Krusen in 1990, forming Pearl Jam. Cameron would eventually become Pearl Jam's drummer in 1998.[144]\n\nTemple of the Dog has gone on to sell more than a million copies,[145][146] thanks in large part to the singles \"Say Hello 2 Heaven\" and \"Hunger Strike\", the latter of which features a duet between Cornell and Vedder. This was the first time Vedder was recorded professionally.[147] Vedder said about Hunger Strike in the 2009 book Grunge Is Dead; \"I really like hearing that song. I feel like I could be real proud of it – because one, I didn't write it, and two, it was such a nice way to be ushered onto vinyl for the first time. I'm indebted to Chris time eternal for being invited onto that track.\"[148]\n\nDuring a 2003 Pearl Jam show at the Santa Barbara Bowl, Cornell appeared as a surprise guest. After playing a short acoustic set, Cornell joined Vedder and the rest of the band to perform \"Hunger Strike\" and \"Reach Down\".[149]\n\nOn October 6, 2009, Cornell made a surprise appearance during a Pearl Jam concert at the Gibson Amphitheater in Los Angeles. The reunited Temple of the Dog played \"Hunger Strike\". At the end of the concert, Cornell took a bow with the band along with Jerry Cantrell of Alice in Chains.[150]\n\nIn September 2011, he joined members of Pearl Jam for a Temple of the Dog live reunion at the two-day PJ20 Festival at Alpine Valley, Wisconsin.[151]\n\nOn both October 25 and 26, 2014, Cornell joined Pearl Jam onstage to perform \"Hunger Strike\" at Shoreline Amphitheater in Mountain View, California during the 28th Annual Bridge School Benefit, the latter being the last time that Vedder and Cornell performed the song together.[152] On January 30, 2015, Pearl Jam bandmates (minus Vedder) Stone Gossard, Jeff Ament, and Matt Cameron joined Chris Cornell and Mike McCready during the Mad Season Sonic Evolution Concert at Benaroya Hall with the Seattle Symphony. The group performed two songs, \"Reach Down\" and \"Call Me a Dog\".[153]\n\nThe band toured for the first time in the fall of 2016 in celebration of the 25th anniversary of their self-titled album.[154][155] Vedder did not participate on the tour citing \"family commitments\", but the crowd sang his part in \"Hunger Strike\",[156] and Cornell dedicated the song to Vedder during the band's concert at the Paramount Theatre in Seattle on November 21, 2016.[157]\n\nAlice Mudgarden\n\nCornell, together with Layne Staley and Jerry Cantrell of Alice in Chains, and Mark Arm of Mudhoney, contributed vocals on the Alice in Chains song \"Right Turn\", from the 1992 EP Sap, although the band given credit for this song is Alice Mudgarden.[158] The song was featured in the 2001 film Black Hawk Down.[159]\n\nM.A.C.C.\n\nIn 1992, Cornell and three other former members of Temple of the Dog played under the name M.A.C.C. (McCready, Ament, Cameron, Cornell), recording the song \"Hey Baby (New Rising Sun)\"[160] for the 1993 album, Stone Free: A Tribute to Jimi Hendrix.[161] The band performed the song live for the first time during the first Temple of the Dog tour in November 2016.[162]\n\nCollaborations\n\nCornell worked as a co-producer and backing vocalist on the Screaming Trees' 1991 album, Uncle Anesthesia.[163][164]\n\nCornell contributed vocals on Alice Cooper's \"Stolen Prayer\"[165] and \"Unholy War\"[166] (which he also wrote) from the 1994 album, The Last Temptation. In 1997, Cornell collaborated with Eleven on a rendition of the song, \"Ave Maria\", for the Christmas compilation album, A Very Special Christmas 3.[167]\n\nIn the '90s, Cornell teamed up with Heart's Ann and Nancy Wilson for a cover of the Rolling Stones' \"Wild Horses\", when the sisters were performing as The Lovemongers.[168] Bootleg versions of the live performances are available online.[168] Cornell and the Wilsons also performed \"Wild Horses\" and The Lovemongers' song \"Sand\" at Layne Staley's funeral in 2002.[169][170]\n\nIt was incorrectly believed (for many years)[citation needed] that Cornell had written the Eleven song \"Someone to Die For\", featured on the 2004 Spider-Man 2 soundtrack. The song is performed by Jimmy Gnecco of Ours and Brian May of Queen on the soundtrack, and the lyrics are credited to Alain Johannes, Natasha Shneider and Cornell in the album.[171] However, the ASCAP song database only shows Johannes and Shneider as the songwriters.[172] Cornell had recorded a demo of the song some time earlier,[citation needed] which was released only to members of the Eleven street team.[citation needed] The version recorded by Cornell and Eleven can be found on the internet.[173]\n\nCornell co-wrote (with Brian Howes) David Cook's first post-American Idol album single, \"Light On\", released in 2008. And in 2009, he contributed vocals on the song, \"Mister Dirt\", from the album, Good.Night.Melody, by Joshua David Lewis.[174]\n\nIn 2009, Cornell co-wrote a song with a fan named Rory de la Rosa, who had lost his six-year-old daughter to cancer in 2008, and he was diagnosed with the same illness shortly afterwards. He reached out to Cornell to tell him how much his music impacted his life and also the bond it helped create for him and his daughter, and he sent Cornell a poem called \"I Promise It's Not Goodbye\". Cornell was so moved that he turned the poem into a song with the same title. De la Rosa gave Cornell permission to post the song online. It was available for free download on Cornell's official website in April 2009. Cornell asked, however, that his fans would consider making a donation in memory of Rory's daughter and to help ease the financial burden of his disease.[175][176] In 2013, Cornell made the song available for streaming on his official website in honor of the kids who lost their lives in the Sandy Hook tragedy. Links were provided for donations in memory of the victims.[177]\n\nCornell sang one song (which he co-wrote) on \"Slash\", Slash's solo record released in April 2010.[178] The song is called \"Promise\" and it was premiered at amazon.com on March 26, 2010.[179] He contributed vocals on the song, \"Lies\", on the 2010 album, Third and Double, by Gabin which was subsequently released as a single in October 2010. Cornell appears on the Carlos Santana album Guitar Heaven: The Greatest Guitar Classics of All Time, where he sings on the cover of Led Zeppelin's \"Whole Lotta Love\".[180]\n\nCornell wrote the lyrics and shared vocals with Andrew Wood in the song \"Island of Summer\", which was recorded while they were living together in Seattle.[143] The song was released for the first time in the 2011 album \"Melodies & Dreams\", a collection of Wood's unreleased recordings and demos.[181]\n\nCornell sings backing vocals in a cover of the Everly Brothers' song \"All I Have to Do Is Dream\", on Rita Wilson's debut album AM/FM, released in 2012.[182]\n\nOn April 18, 2013, the Seattle band Heart was inducted into the Rock and Roll Hall of Fame,[183] and Cornell gave Heart's induction speech and emotionally talked about what heroes and role models Ann and Nancy Wilson had been to him and other musicians in Seattle. \"For me, and for countless other men and women, they have earned, at long last, their rightful place in the Rock and Roll Hall of Fame,\" Cornell said.[184] Cornell also joined fellow Seattle musicians Jerry Cantrell and Mike McCready to play guitar for Heart's hit song \"Barracuda\" alongside Ann and Nancy Wilson at the ceremony.[185]\n\nOn January 30, 2015, Cornell joined Mike McCready and Barrett Martin plus Duff McKagan, Sean Kinney, the Seattle Symphony and others in a special 'Sonic Evolution' concert at Seattle's Benaroya Hall in a tribute to Mad Season.[186] The performance was released as a live album in August 2015, entitled Mad Season / Seattle Symphony: Sonic Evolution / January 30, 2015 / Benaroya Hall.[187] Proceeds will benefit the Seattle Symphony and Vitalogy Foundation.[187]\n\nSoundtrack contributions\n\nIn 1992, Cornell contributed his first solo song \"Seasons\", and Soundgarden's \"Birth Ritual\" to the Singles soundtrack.[188]\n\nHe also contributed the song \"Sunshower\" (a bonus track on the Japanese release of Euphoria Morning) to the soundtrack of the 1998 film Great Expectations,[189] and a reworked version of the track \"Mission\", retitled \"Mission 2000\", was used on the soundtrack to the 2000 film, Mission: Impossible 2.[190]\n\nCornell and composer David Arnold collaborated on the song \"You Know My Name\", which Cornell co-wrote and performed and which accompanies the opening titles for the 2006 James Bond film, Casino Royale.[191] \"You Know My Name\" is the first theme song since 1983's Octopussy to use a different title than the film, the first ever sung by a male American, and the first ever title theme song that did not appear on the soundtrack album. \"You Know My Name\" won a 2006 Satellite Award in the category of Best Original Song,[192] and a 2007 World Soundtrack Award in the category of Best Original Song Written Directly for a Film.[193] The song sold 323,000 digital copies and 3.5 million streams,[3] and was also nominated for Best Song Written for a Motion Picture, Television or Other Visual Media at the 2008 Grammy Awards.[194] It was the first song recorded for his solo album Carry On, which he began work on in 2007.\n\nIn August 2011, Cornell released \"The Keeper\", an original song written for the Marc Forster-directed 2011 film Machine Gun Preacher. The song was nominated for a Golden Globe Award in 2012. For the first 24 hours after its release, the song was exclusively available as part of the \"Donate to Download\" campaign for Sam Childers' Angels of East Africa children's charity. The song is also the lead track on the film's soundtrack album.[195]\n\nIn 2012, Soundgarden released their first song in 15 years, \"Live to Rise\", written for The Avengers movie soundtrack.[62]\n\nIn 2013, Cornell wrote the song \"Misery Chain\", for the soundtrack to the film 12 Years a Slave, in which he performed a duet with Joy Williams.[196][197]\n\nIn 2016, Cornell covered the song \"Stay With Me Baby\" for the soundtrack of the HBO TV series Vinyl. Cornell said about recording the song; \"I was very honored to be asked to record a version of 'Stay With Me Baby' for Vinyl. I get to pay tribute to Terry Reid, whose version of the song has been a favorite of mine for many years, and be included on a great soundtrack with an amazing group of artists.\"[198]\n\nIn November 2016, Cornell sang a cover of The Beatles' \"Drive My Car\" on episode 18b of the animated children's television series Beat Bugs.[199]\n\nHis last soundtrack contribution was the song \"The Promise\", written for the ending credits for the movie of the same name released in 2017.[104]\n\nInfluences and musical style\n\nCornell performing in Lisbon in 2009 at the Optimus Alive!09\n\nCornell cited Paul McCartney, XTC, Siouxsie and the Banshees, Ultravox,[200] and Bauhaus[201] as some of the artists he liked.\n\nCornell's songwriting often features non-standard chord progressions and melodies that do not conform with one diatonic scale. A prominent example is \"Black Hole Sun\", which not only involves many kinds of open chords and several key changes in short sequences, but also unique melody phrases with large-interval jumps.[202]\n\nA recurrent characteristic is his use of major-only chord sequences (\"Sweet Euphoria\",[203] \"Pretty Noose\"[204]), which also leads to more subtle key changes.\n\nCornell's most concentrated example of his own songwriting style remains on his first solo album Euphoria Morning,[205] as his subsequent works, whether with Audioslave or on his later solo albums, tend toward the conventional and only occasionally contain short but inventive interludes (e.g., \"Like a Stone\",[206] \"Disappearing Act\", \"No Such Thing\").[207]\n\nCornell had a multi-octave range. He was a baritone[208][209][210] with an ability to sing extremely high in the tenor range,[211] as well as in the lower register of a baritone voice. He showcased this in various songs, most notably the studio and the demo versions of \"Beyond the Wheel\", where he can be heard spanning three octaves. He also experimented with various different vocal styles, ranging from light falsetto to brutal screams and chants. In addition to singing rock and metal mainly with Soundgarden and Audioslave, Cornell sang the blues,[212] neo-soul[26] and stripped-down acoustic numbers.[213]\n\nOther work\n\nCornell made a cameo in the 1992 Seattle-based film Singles directed by Cameron Crowe, in which he appeared opposite Matt Dillon and Bridget Fonda.[214] He also appeared onstage with Soundgarden performing the song \"Birth Ritual\" in a club. Cornell was Crowe's original choice for the role of Cliff Poncier (played by Dillon), but he was unable to do it due to Soundgarden's busy schedule.[215] Cornell was the face of fashion producer John Varvatos' 2006 ad campaign.[216]\n\nCornell became a restaurateur with the opening of his restaurant, Black Calavados, in Paris,[34] and was also the owner of the music publishing company You Make Me Sick I Make Music.[217]\n\nIn 2009, Cornell planned to turn Philip Carlo's true crime book The Night Stalker: The Life and Crimes of Richard Ramirez, into a film, collaborating with Carlo to produce the screenplay.[218] In 2011, James Franco was attached to direct the film and star in the role of Ramirez.[219]\n\nIn popular culture\n\nGarbage's song \"Fix Me Now\" from the band's debut album was originally called \"Chris Cornell\". According to lead singer Shirley Manson, she was obsessed with Cornell at the time of the release of Soundgarden's hit song \"Black Hole Sun\". A demo version of \"Fix Me Now\" has Manson singing Cornell's name.[220]\n\nThe line \"I'm looking California, and feeling Minnesota\" from Soundgarden's song \"Outshined\" (written by Cornell), inspired the title of Steven Baigelman's 1996 film Feeling Minnesota, starring Keanu Reeves and Cameron Diaz.[221]\n\nCornell's song \"Preaching the End of the World\" from his debut solo album Euphoria Morning, inspired the title of Lorene Scafaria's 2012 film Seeking a Friend for the End of the World, starring Steve Carell and Keira Knightley.[222][223]\n\nCornell was an answer on the game show Jeopardy! on February 12, 2018. The clue was, \"In 2017, music fans were saddened by the death of this Soundgarden singer\".[224]\n\nPersonal life\n\nIn 1985, Cornell started dating Susan Silver,[225][226][227] the manager of Alice in Chains, Soundgarden and Screaming Trees,[228] and they got married in 1990.[31][229] They had a daughter, Lillian Jean, born on June 28, 2000.[230] Cornell and Silver divorced in 2004.[229] In 2004, he married Vicky Karayiannis,[231][232] a Paris-based American publicist of Greek heritage.[34] The couple had a daughter together, Toni, in September 2004,[229][34] and a son, Christopher Nicholas, in December 2005.[233] In 2012, the Cornells created the Chris and Vicky Cornell Foundation[234][235] which works to aid the homeless, the poor, and abused or neglected children. In 2013, a portion of proceeds from ticket sales went to benefit the cause.[236]\n\nIn a 2008 television interview, Cornell said about religion, \"I don't follow any particular one. … Ultimately I think I'm sort of a freethinker and kind of open. … So many bad things–as well as good things–have happened based on people just sort of blindly following religion that I kind of feel like I want to stay away from any type of specific denomination or any religion period.\"[237]\n\nFriendships with Andrew Wood and Eddie Vedder\n\nCornell was a close friend of late singer Andrew Wood, who was his roommate in Seattle.[143] While living together, Cornell and Wood recorded the song \"Island of Summer\",[181] which was written by Cornell and is the only existing recording from the two of them singing together. The song was released in 2011 in the album Melodies & Dreams, a solo album from Andrew Wood featuring unreleased songs he recorded throughout his life.[238] Wood's sudden death in 1990 led Cornell to make a tribute album for him with the band Temple of the Dog. In a 2016 interview with The Guardian promoting the first tour of Temple of the Dog, Cornell said about Wood's death: \"I've always had a really difficult time with loss. I didn't deal well with Andy's death. After he died, numerous times I'd be driving and I would look out the window and I thought I saw him. It would take me five minutes to update to the moment and realize, 'no, he's actually dead.' This tour, in a sense, is the dealing. It's facing the reality.\"[239]\n\nDuring a 1994 Rolling Stone interview on Kurt Cobain's suicide, when asked if it is legitimate to read a songwriter's suicide into his lyrics after the fact, Cornell said:\n\nWhen Andy [Wood] died, I couldn't listen to his songs for about two years after that, and it was for that reason—his lyrics often seem as though they can tell that story. But then again, my lyrics often could tell the same one. In terms of seeing everything as a matter of life and death—if that's what you're feeling at the time, then that's what you're going to write. It's sort of a morbid exchange when somebody who is a writer like that dies, and then everyone starts picking through all their lyrics. In Kurt's case, whatever he was thinking and whatever he was writing, there wasn't an arrow pointing at what his demise was. It's a stream of thought, it's a possibility—it's definitely something that somebody was feeling when they were writing. It doesn't mean that it's going to happen. But it doesn't necessarily mean that it isn't, either.[30]\n\nCornell was good friends with Pearl Jam frontman Eddie Vedder. Cornell was one of the first people that Vedder met outside his Pearl Jam bandmates after moving to Seattle in 1990.[240] The two were neighbors for a while and had shared vocal duties in Temple of The Dog.[240] Soundgarden manager Susan Silver recalled in the 2009 book Grunge Is Dead: The Oral History of Seattle Rock Music the moment in 1990 that Cornell walked Vedder onstage at the second show performed by Pearl Jam (then named Mookie Blaylock) in Seattle: \"Alice in Chains filmed the show at Moore theatre in 1990 and that was the show this new band [Mookie Blaylock] opened for them. Everyone was still reeling from Andy [Andrew Wood]'s death... and they hadn't really played out yet. The band came on and Chris carried Eddie onto the stage – he was on his shoulders. It was one of those super powerful moments, where it was all a big healing for everybody. He came out as this guy who had all the credibility in the world - in terms of people in Seattle - and Malfunkshun and Mother Love Bone were loved bands. Andy was such an endearing personality. It was a hard thing to do - to show up after people die. And Chris bringing Eddie out, and pointing at him, as much to say, 'This is your guy now.'\"[241][242] Pearl Jam lead guitarist Mike McCready said about their friendship; \"Ed was from San Diego and he felt very intimidated in Seattle. Chris really welcomed him. Ed was super, super shy. Chris took him out for beers and told him stories. He was like, 'Hey, welcome to Seattle. I love Jeff [Ament] and Stone [Gossard]. I give you my blessing.' From then on he was more relaxed. It was one of the coolest things I saw Chris do.\"[243]\n\nIn September 2011, Vedder introduced Cornell at a concert in Alpine Valley before performing \"Hunger Strike\" with him, saying, \"I had no idea how he would affect my life and my views on music and my views on friendship and what a big impact he would have. These guys [the other members of Pearl Jam] know him much longer than me and his impact is profound.\"[244][240] The friendship between Vedder and Cornell is also featured in the 2011 documentary Pearl Jam Twenty.[245]\n\nDepression and substance abuse\n\nCornell struggled with depression[208][246][31] and had multiple addictions (mostly alcohol and prescription drugs),[30][31][133] which he was able to manage from roughly 1980 until 1997, when Soundgarden broke up and his first marriage was failing.[29] At that point, he turned to OxyContin and other substances.[29] Cornell said about that period; \"I went through a serious crisis with depression where I didn't eat a whole meal every day. I was just kind of shutting down. I eventually found that the only way out of that was to change virtually everything in my life. That was a very frightening thing to do, but it was worthwhile.\"[34] He checked into a rehabilitation center in 2002[112][247] and quit drinking and smoking around 2005.[134][248]\n\nCornell stated in a 1996 interview: \"I know what it feels like to be suicidal, and I know what it feels like to be hopeless. There is some point where I learnt enough about myself to know that I don't have the tolerance to create other hurdles as well.\"[249] In 1999, Cornell said the following about depression:\n\nNo one really knows what run-of-the-mill depression is. You'll think somebody has run-of-the-mill depression, and then the next thing you know, they're hanging from a rope. It's hard to tell the difference. But I do feel that depression can be useful. Sometimes it's just chemical. It doesn't seem to come from anywhere. And whenever I've been in any kind of depression, I've over the years tried to not only imagine what it feels like to not be there, but try to remind myself that I could just wake up the next day and it could be gone because that happens, and not to worry about it. And at the same time, when I'm feeling great, I remember the depression and think about the differences in what I'm feeling and why I would feel that way, and not be reactionary one way or the other. You just have to realize that these are patterns of life and you just go through them.[250]\n\nAt the age of 12, he had access to alcohol, marijuana, LSD, psilocybin mushrooms and prescription drugs; he used them daily by 13, stopped for a year, but relapsed at age 15 for another year until he turned to music.[30][31] In a 2006 interview, Cornell revealed that at the age of 14, he had a bad PCP experience and later suffered from panic disorder and agoraphobia:\n\nIt's not like you go to your dad or your doctor and say, 'Yeah, I smoked PCP and I'm having a bad time.' So I became more or less agoraphobic because I'd have flashbacks. From 14 to 16, I didn't have any friends. I stayed home most of the time. Up till then life was pretty great... I never did any drugs until my late 20s. Unfortunately, being a child of two alcoholics, I started drinking a lot, and that's what eventually got me back into drugs. You often hear that pot leads to harder drugs. But I think alcohol is what leads you to everything, because it takes away the fear. The worst drug experimentation I ever did was because I was drunk and didn't care.[32]\n\nIn May 2007, Cornell was honored with the Stevie Ray Vaughan Award for \"his dedication and support of the MusiCares MAP Fund and his devotion to helping other addicts with the recovery process.\"[251] The award was presented by Alice Cooper.[252]\n\nWhen asked how he beat his addictions, Cornell stated, \"It was a long period of coming to the realization that this way (sober) is better. Going through rehab, honestly, did help... it got me away from just the daily drudgery of depression and either trying to not drink or do drugs or doing them and you know, they give you such a simple message that any idiot can get and it's just over and over, but the bottom line is really, and this is the part that is scary for everyone, the individual kinda has to want it... not kinda, you have to want it and to not do that crap anymore or you will never stop and it will just kill you. There's nothing you can do...if your best friend has a problem and it's very serious, there's nothing you're going to be able to do about it and it was sad for me and the people around me. Sad for me when friends of mine died because of it.\"[253]\n\nIn a 2011 interview, Cornell said the major change when Soundgarden re-formed was a lack of alcohol: \"The biggest difference I noticed ... and we haven't even really talked about it: there are no bottles of Jack Daniel's around or beers. And we never talked about it ... it's just not there.\"[254]\n\nDeath and aftermath\n\nChris Cornell at the 2011 Toronto International Film Festival.\n\nAround 12:15 a.m. on May 18, 2017,[255] Cornell was found unconscious by his bodyguard in the bathroom of his hotel room, 1136, at the MGM Grand in Detroit, Michigan, after performing at a show with Soundgarden at the Fox Theatre on May 17.[256] He was lying on the floor with an exercise band around his neck and blood in his mouth.[257] An MGM medic and EMS personnel were unable to revive Cornell.[255] Cornell was pronounced dead by a doctor at 1:30 a.m., at the age of 52. The cause of death was officially ruled a suicide by hanging.[255] Police ruled out foul play by reviewing a hotel surveillance video, which showed nobody entering or exiting the suite after Cornell's bodyguard left at around 11:35 p.m.[258]\n\nOn June 2, 2017, the Wayne County Medical Examiner released its autopsy[259] and toxicology report in the death of Cornell.[260] The medical examiner confirmed that the cause of death was hanging and the manner of death was ruled as suicide, adding that Cornell's injuries were all \"consistent with hanging, partially suspended by the resistance exercise band,\"[259] and that \"drugs did not contribute\" to the cause of death.[259] Only prescription medications in therapeutic doses were found in Cornell's system:[260] the sedative Butalbital (5.4 mcg/mL), commonly prescribed for the treatment of headache; four doses (41 ng/mL) of the anti-anxiety medication lorazepam (also known as Ativan); the decongestant pseudoephedrine (170 ng/mL) and its metabolite norpseudoephedrine (10 ng/mL); caffeine (from No-Doz tablets that Cornell had ingested);[260][261] and naloxone (used to reverse opioid overdoses), which was reportedly administered by emergency personnel upon their arrival at the scene.[260][262] No pills were found in Cornell's stomach.[259] Cornell's widow stated that the Ativan was prescribed to him in 2016 as a sleep aid.[263] Photos from Cornell's hotel room[264] showed that his prescription for Ativan was \"1 tablet every 12 hours.\"[265]\n\nCornell's widow contacted insurance lawyer Kirk Pasich within a few minutes after her husband's death.[266] Pasich became the spokesperson for the widow and blamed Ativan for the singer's death, stating that Cornell would not intentionally take his own life.[267][266] Cornell's widow said, \"When we spoke after the show, I noticed he was slurring his words; he was different. When he told me he may have taken an extra Ativan or two, I contacted security and asked that they check on him.\"[267][268] Following the release of the autopsy and toxicology report, Cornell's widow released a statement to the press:\n\nMany of us who know Chris well noticed that he wasn't himself during his final hours and that something was very off. We have learned from this report that several substances were found in his system. After so many years of sobriety, this moment of terrible judgment seems to have completely impaired and altered his state of mind. Something clearly went terribly wrong and my children and I are heartbroken and are devastated that this moment can never be taken back. We very much appreciate all of the love we have received during this extremely difficult time and are dedicated to helping others in preventing this type of tragedy.[261]\n\nThree weeks after his death, the music video for Cornell's single \"Nearly Forgot My Broken Heart\" was removed from YouTube.[269] Released in September 2015,[270] the video depicted the singer as a death row prisoner in the Old West who survived a hanging. Cornell's son, Christopher, also appeared in the video.[269]\n\nCornell publicly talked about his struggle with depression, isolation, and suicidal thoughts several times throughout his life.[249][250][208][31][246][30] Following Cornell's death, his older brother, Peter Cornell, started a campaign to raise awareness on depression and suicide prevention.[271] A few days later, Peter revealed that he was being bullied and threatened to change the narrative of this awareness message, and that this bullying was coming from a place he could never have imagined.[271] In October 2017, Peter reacted to criticism thrown at him on social media by his brother's mother-in-law. He talked about the stigma surrounding mental illness and the addiction narrative being spun by his brother's widow and her family to explain Cornell's death, stating, \"And there is that word again. Stigma. Somehow it's \"sexy\" to be an addict (of which I am also familiar), but let's not talk about mental illness. Stigma. There are those who re-victimize and bully us. Taunt and demand us to re-live and tell the details of our painful upbringing. To what end? It doesn't erase the damage done. It doesn't turn back the hands of time. We are survivors.\"[272]\n\nOn July 11, 2017, the Detroit Police Department[273] released the full police report on Cornell's death,[257] along with photographs from Cornell's hotel room[264] and the 911 call from the MGM Grand Detroit from the night of Cornell's death.[274] The call was made by a hotel employee at 12:56 a.m., reporting \"a nonresponsive guest... inside of Room 1136.\"[275] According to the report, Martin Kirsten (Cornell's bodyguard) was at the singer's hotel room at 11:30 p.m. to help him with his computer. It also says that Cornell's wife, Vicky, talked to her husband at 11:35 p.m. Alarmed by what she heard, Vicky phoned Kirsten to ask him to check on her husband \"because he did not sound like he was OK.\"[276] According to Vicky, Cornell kept saying, \"I am just tired,\" and hung up the phone.[257] A call from Vicky's at 12:15 a.m. prompted Kirsten to go to Cornell's suite to check on him.[257] Unable to enter the room because of the interior latch, Kirsten returned to his room and called hotel security. Security refused to assist.[273]\n\nKirsten told police that he went to Cornell's room at around 12:15 a.m., but could not access the locked room. He then had a telephone conversation with Vicky, who instructed him to kick the door open as the hotel staff refused to do it. Kirsten told police in a signed statement that he kicked the bedroom door 6-7 times before it opened, then went inside and the bathroom door was partially opened and he could see Cornell's feet.[257] Kirsten said that Vicky was on the phone with him the whole time asking for updates.[273] Kirsten said in his statement that he loosened the band around Cornell's neck, then tried to resuscitate him by compressing his chest.[257] Medical personnel arrived at 12:56 a.m. and tried to resuscitate Cornell, only to no success.[276][273] Cornell was pronounced dead at around 1:30 a.m.,[273] an hour and 15 minutes after his bodyguard was first contacted by Cornell's wife.[257] It is unknown how long it took for the bodyguard to gain entry to the hotel room and find Cornell.[276]\n\nQuestioned by The Detroit News why it took 41 minutes to get a medical team to the scene after the bodyguard found Cornell lying on the floor, police insisted that there were no gaps.[276] Investigators looked at the length of the phone call between Cornell and his wife, and the calls the bodyguard made to security and checked video surveillance footage from the hotel hallway, and determined the timeline was accurate, and the bodyguard's story checked out.[276]\n\nOn November 1, 2018, Vicky Cornell and her children filed suit in Los Angeles Superior Court, claiming that Dr. Robert Koblin \"negligently and repeatedly\" prescribed \"dangerous mind-altering controlled substances to Chris Cornell which impaired Mr. Cornell's cognition, clouded his judgment, and caused him to engage in dangerous impulsive behaviors that he was unable to control, costing him his life.\"[277] The suit claims Koblin prescribed Lorazepam over a period of 20 months without seeing Cornell.[277] In his motion for dismissal, Koblin denied all accusations of negligence and said that Cornell was well aware of the risks inherent to the medication, which he was taking to treat anxiety. Koblin ordered Cornell the first prescription of Lorazepam in September 2015. Koblin insisted that he did everything within his power to help Cornell, and that extant malpractice law should shield him from being sued.[278]\n\nMemorial and tributes\n\nThe grave of Chris Cornell, at Hollywood Forever Cemetery.\n\nCornell's body was cremated on May 23, 2017.[279] His funeral took place on May 26, 2017, at the Hollywood Forever Cemetery in Los Angeles.[280] Attendees and speakers at the ceremony included Soundgarden members Kim Thayil, Matt Cameron, and Ben Shepherd, as well as former members Hiro Yamamoto and Scott Sundquist, along with Audioslave's Tom Morello, and Pearl Jam/Temple of the Dog members Jeff Ament and Mike McCready,[281] The mourners included friends and families as well as many notable musicians[282][283] and others.[284] The ceremony began with the cemetery's speakers playing Audioslave's \"Like a Stone\", as well as Cornell's last solo song released before his death, \"The Promise\". Chester Bennington performed Leonard Cohen's \"Hallelujah\". At the end of the funeral, Temple of the Dog's song \"All Night Thing\" accompanied mourners as they exited.[284] Cornell's ashes were placed next to his friend Johnny Ramone's cenotaph statue[284] — Ramone is not buried there, he was cremated and his ashes were retained by his widow.[285]\n\nSeattle's Space Needle observation tower went dark from 9:00 p.m. to 10:00 p.m. PST on May 18, 2017, in honor of Cornell and his contributions to the city's music scene.[286] In the same night, Ann Wilson paid tribute to Cornell singing Soundgarden's \"Black Hole Sun\" on Jimmy Kimmel Live!.[287] Soundgarden's drummer, Matt Cameron, was the first of Cornell's former bandmates to comment on his death saying \"my dark knight is gone\" via Facebook.[288] Pearl Jam, for whom Cameron also drums, released a tribute on their website with a picture of Cornell entitled \"Chris\".[289] Cornell's Audioslave bandmate, Tom Morello, wrote a poem in tribute to him.[290] Alice in Chains paid tribute with a photo of Cornell on their social media pages with the caption, \"We are heartbroken\".[291] Faith No More changed the homepage of the band's official website to a tribute to Cornell after his death.[292][293] The message could still be seen on the website until November 9, 2017.[294]\n\nThe Seattle Mariners held a pregame tribute to Cornell prior to their game against the Chicago White Sox on May 19 with a moment of silence and videoboard tribute to Cornell.[295] Oakland Athletics's player Trevor Plouffe changed his walk-up music to \"Black Hole Sun\" to honor Cornell.[296] Linkin Park dedicated their performance of \"One More Light\" on Jimmy Kimmel's show, in tribute to Cornell.[297] During the 2017 Billboard Music Awards, Imagine Dragons' lead singer, Dan Reynolds, paid tribute to Cornell remembering his life and career and asking for a moment of silence as a photo of Cornell filled television screens at home and the monitors in the venue.[298]\n\nOn May 23, 2017, Norah Jones performed a solo piano cover of “Black Hole Sun” at Detroit's Fox Theatre, the theatre Chris last performed in.[299]\n\nDuring his solo concert in London on June 6, 2017, Eddie Vedder talked for the first time about Cornell since his death, saying \"he wasn't just a friend, he was someone I looked up to like my older brother\" and \"I will live with those memories in my heart and I will love him forever.\"[300] Cornell's former Audioslave bandmates paid tribute to him during a Prophets of Rage concert in Berlin on June 7, playing an instrumental version of \"Like a Stone\" with a single spotlight shining down on an empty mic at center stage as the audience filled in on vocals. It was later performed with Serj Tankian of System of a Down on vocals.[301] At the Alternative Press Music Awards on July 17, the band Pierce The Veil paid tribute to Cornell with their rendition of \"Black Hole Sun\" while images of Cornell were displayed on a screen above the stage. Near the end of the performance, an audio of Cornell singing the song was played.[302]\n\nOn July 20, 2017, the day that would have been Cornell's 53rd birthday, Pearl Jam guitarist Stone Gossard, who played with Cornell in Temple of the Dog, wrote a letter to him in a post shared on Pearl Jam's official website. Cornell and Gossard share the same birthday.[303]\n\nIn August 2017, Seattle-based singer Shawn Smith announced a single in tribute to Cornell, \"The Way You Made Your Garden Grow\", set to be released on his first solo vinyl album. Smith said in a statement: \"Written and recorded in loving tribute to the glorious Chris Cornell, who left us the day before this session. We will never stop singing your songs. Goodbye for now, Chris... Love Never Dies.\"[304]\n\nFoo Fighters' drummer Taylor Hawkins added a tribute image of Cornell on his touring drum kit in August 2017.[305]\n\nCornell's Soundgarden bandmate, Matt Cameron, paid homage to him in his first solo album titled Cavedweller, with the inscription \"For Chris\"[306] on the vinyl version of the album,[307] which was released on September 22, 2017.[308] Cornell heard the album two months before his death and was very supportive of Cameron's solo debut.[308]\n\nThe movie American Satan, released in October 2017, paid tribute to Cornell and other artists who have died since production on the movie began with a music video featuring the band portrayed in the film, The Relentless, playing a cover of Neil Young's song \"Hey Hey, My My\".[309]\n\nDuring Pearl Jam's first concert since Cornell's death in Santiago, Chile on March 13, 2018, lead singer Eddie Vedder dedicated the song \"Come Back\" (from Pearl Jam's 2006 self-titled album) to Cornell, while drummer Matt Cameron wore a T-shirt with a portrait of Cornell on the back during the show.[310]\n\nOn April 14, 2018, Cornell's longtime friends Ann Wilson and Jerry Cantrell paid tribute to him during the Rock and Roll Hall of Fame ceremony with a rendition of Soundgarden's \"Black Hole Sun\". At the end of the performance, a photo of Cornell was displayed on a screen behind the stage and Cantrell turned around and raised his fist saluting Cornell.[311]\n\nU2 dedicated the song \"Running to Stand Still\" to Cornell at their concert of May 20, 2017 at the Rose Bowl. Before that concert began, \"Black Hole Sun\" played over the PA.[312] One year later, they saluted Cornell with a snippet of \"Black Hole Sun\" during their concert in Inglewood, Calif., on May 16, 2018.[313]\n\nOn the one year anniversary of Cornell's death on May 18, 2018, Alice in Chains paid tribute to him covering two Soundgarden songs, \"Hunted Down\" and \"Boot Camp\", respectively, closing their headlining set at the Rock on the Range festival in Columbus, Ohio. Towards the end of \"Boot Camp\", the lights on stage spelled out \"CC\" for Chris Cornell and \"SG\" for Soundgarden as feedback rang out. Soundgarden was scheduled to headline the festival in 2017 prior Cornell's death.[314][315] On May 20, 2018, Tool dedicated their entire set at Rock on the Range to the friends and family of Cornell.[316]\n\nAmerican rock band Guns N' Roses pay tribute to Cornell on their Not In This Lifetime... Tour. Since May 27, 2017, \"Black Hole Sun\" is played at every concert, and \"You Know My Name\" is the outro song of every show and gets played after the encore of the band.[317]\n\nAlice in Chains' song \"Never Fade\" from their 2018 album Rainier Fog was partially inspired by Cornell's death.[318] One of Cornell's acoustic guitars was also played by both Jerry Cantrell and William DuVall in the album.[319]\n\nIn July 2018, Ann Wilson released her cover of Audioslave's \"I Am The Highway\" in tribute to Cornell. The song is featured on her covers album Immortal, which honors Wilson's friends and other artists that have inspired her and who died recently.[320]\n\nA life-size bronze statue of Cornell was placed at Seattle Center in October 2018.[321]\n\nOn January 16, 2019, a five-hour tribute concert to Cornell named \"I Am The Highway\" was held at The Forum in Los Angeles and featured Foo Fighters, Metallica, Melvins, as well as members of Soundgarden, Audioslave and Temple of the Dog performing Cornell's songs alongside artists such as Fiona Apple, Jerry Cantrell, William DuVall, Miguel, Nikka Costa, Adam Levine, Jesse Carmichael, Jack Black, Geezer Butler, Ryan Adams, Taylor Momsen, Brandi Carlile, Perry Farrell, Juliette Lewis, Josh Homme, Miley Cyrus, Alain Johannes, Wayne Kramer, Peter Frampton and Ziggy Marley.[322]\n\nEddie Vedder covered Cornell's \"Seasons\" at Düsseldorf's Mitsubishi Electric Halle on June 30, 2019, and dedicated it to Cornell's daughter Lily.[323]\n\nConnections to other singers' suicides\n\nMusic journalists noted apparently coincidental relationships between Cornell's suicide and those of two other rock singers, one in the past and another shortly afterward, who also hanged themselves.[324][325]\n\nTheodore Decker of the Columbus Dispatch, the daily newspaper in Columbus, Ohio, where Cornell was due to play his next show, noted that Ian Curtis, the lead singer of the British post-punk band, Joy Division,[324] whom Cornell had said in a 1994 Rolling Stone interview was popular with the members of Soundgarden,[30] took his own life on May 18, 1980, exactly 37 years before Cornell, and by the same method as well. Curtis, known for lyrics that, as Cornell's sometimes had, explored despair and depression, had become legendary as a result after his death, Decker recalled. However, Stephen Morris, one of Curtis's bandmates (who later became New Order) recalled Curtis not as the \"brooding rock deity\" Decker said he became posthumously but as \"an ordinary bloke just like you or me.\" Decker recalled the other deaths of musicians who had risen from Seattle's grunge scene in the early 1990s and called on Cornell's fans to remember that he, too, was a human being who might still be alive if he had gotten the help he needed.[324]\n\nTwo months after Cornell's death, on July 20, 2017, the day on what would have been Cornell's 53rd birthday, Chester Bennington, the lead vocalist of Linkin Park, also died by hanging himself.[325] Bennington had been a close friend of Cornell's; the two had performed together on some occasions and Bennington was the godfather to Cornell's son, Christopher.[325] Bennington also sang Leonard Cohen's \"Hallelujah\" at Cornell's funeral.[325] Bennington's family and bandmates said he had taken Cornell's death hard. Bennington's Linkin Park bandmate Mike Shinoda said that the singer had been unable to complete a performance of the band's song \"One More Light\", about the death of a friend, both in rehearsals and live, when they appeared on Jimmy Kimmel Live! shortly after Cornell's death.[326]\n\nLegacy\n\nIn a 1989 interview with Rolling Stone, Axl Rose stated: \"I enjoy Soundgarden. The singer [Cornell] just buries me. The guy sings so great.\"[327] Rose also stated that Cornell was the best vocalist in rock.[328][329]\n\nIn a 2009 interview, Ronnie James Dio stated: \"I think Chris Cornell is such a great singer, and those guys [from Soundgarden] write so well and always write well — I mean, I love what he's done with Audioslave and the things he's done since then.\"[330]\n\nIn a 2009 interview, Eddie Vedder stated that Cornell was \"the best singer that we've got on the planet\".[331]\n\nIn April 2017, Scott Stapp stated that Cornell was \"the greatest pure Rock singer\". He added, \"I'm really a huge fan of him, and everything that he has done. I just think all around that he is an extremely talented artist, songwriter, singer, and guitar player. He can do so many different things to evoke emotion. From the soulfulness, to the top end of his range when he gets metal and aggressive, to his choice of melodies and how the melody in itself, despite what he's saying, can incite emotion. I think he'll go down in history as one of the greats.\"[332]\n\nAfter hearing about his death, Alice Cooper stated: \"Chris Cornell, in our circle, was known as 'The Voice' because he had the best voice in rock and roll. I was lucky enough to write and record two songs with him. His death comes as a total shock to all of us. 'Black Hole Sun' will live on as a classic, and his is a true legacy of rock and roll.\"[333] Living Colour guitarist Vernon Reid stated: \"There are barely any words to describe my grief over the loss of Chris Cornell...His impact as a singer, songwriter and guitarist will be felt for generations to come.\"[334]\n\nPearl Jam bassist Jeff Ament said of Cornell: \"I've always said that Chris was the greatest songwriter to ever come out of Seattle. Jimi Hendrix could play the guitar like crazy, but Chris had the song-writing chops that we all sort of hoped to get to at different points in our songwriting careers. He had a way he could wrap a melody around odd time signatures and weird parts and make them catchy. He was a beautiful wordsmith. If you look at his lyrics, he obviously was processing his pain and depression, and all of those things. I think that's part of what people, myself included, responded to when he was singing. With the songwriting he had that voice, there's not too many people that have that many options with their voice. He could do a lot of different things with it, and have a lot of different characters in that voice. I feel so lucky that I got to be in a project with him, got to hang out with him, and just sort of witness his greatness.\"[335]\n\nFollowing his death, the sales and streams of Cornell's discography grew by more than 550% from the week prior to his death. On platforms like Spotify, Apple Music and Pandora, his songs were streamed 32.5 million times during the week in which he died. The charting week prior to that, his tracks were played 5 million times. That same week, 38,000 copies of Cornell albums were sold, which represented a 1,700% gain in purchases; the week before his death, only 2,000 units were sold.[336]\n\nDiscography\n\nAs a solo artist, Cornell released four studio albums, two compilation albums (including the posthumous Chris Cornell in 2018), and one live album. With Soundgarden, he produced six albums, five EPs and two greatest hits compilations. He released three albums with Audioslave and one album with Temple of the Dog. Cornell also produced the Screaming Trees album Uncle Anesthesia.[337]\n\nSolo releases\n\nAlbums with Soundgarden\n\nAlbums with Audioslave\n\nAlbum with Temple of the Dog\n\nAwards and nominations\n\nSee also", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Gnome-mime-sound-openclipart.svg/50px-Gnome-mime-sound-openclipart.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Quart_2009_-_Chris_Cornell.jpg/220px-Quart_2009_-_Chris_Cornell.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Chris_Cornell_Montreux_Jazz_Festival_2005.jpg/200px-Chris_Cornell_Montreux_Jazz_Festival_2005.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/Chris_Cornell_12-jul-09.JPG/200px-Chris_Cornell_12-jul-09.JPG", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/28px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/Soundgarden_Chicago.jpg/220px-Soundgarden_Chicago.jpg", "https://upload.wikimedia.org/wikipedia/commons/a/ab/Chris_Cornell.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/ChrisCornellTIFFSept2011.jpg/220px-ChrisCornellTIFFSept2011.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Chris_Cornell_2007.jpg/170px-Chris_Cornell_2007.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Guitar_%281867%29_-_The_Noun_Project.svg/27px-Guitar_%281867%29_-_The_Noun_Project.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Chris_Cornell_Grave.jpg/220px-Chris_Cornell_Grave.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Chris_Cornell.jpg/220px-Chris_Cornell.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Chris_Cornell.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Chris_Cornell", "title": "Chris Cornell", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Chris_Cornell.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}