{"url": "time.com/money/5178274/royal-family-net-worth/", "text": "At 91 years old, Queen Elizabeth II has a laundry list of accolades to her name, including the world’s longest-ruling and oldest monarch. She’s also the richest member of the British royal family — by a long shot.\n\nRoyal family finances can be complicated, as many details of their fortune are kept private. But it’s fair to say that Queen Elizabeth and the royal family’s net worth is in the tens of billions — around $88 billion as of 2017, according to Forbes. Since the royal family’s jobs aren’t like the average person, how do they make all their money? The short answer: much of the royal family lives off trusts like the Crown Estate, which is owned by the reigning monarch and includes real estate properties like Buckingham Palace.\n\nDaily Money Sign up to receive the latest updates and the smartest advice. View Sample Sign Up Now\n\nSome of the royal family’s wealth also comes from a portfolio of extravagant personal collections. The British monarchy owns billions of dollars in property alone, including Balmoral Castle, where the Queen spends every summer, The Savoy in London, a horse racetrack and an entire London street. The crown also owns one of the largest art collections in the world and the Crown Jewels collection, which is made up of more than 140 individual pieces and estimated to be worth at least $4 billion.\n\nRoyal obsession, which neared fever pitch this spring as the world prepared for the arrival of Kate Middleton’s third baby, Prince Louis Arthur Charles, and the marriage of Prince Harry, Duke of Sussex and Meghan, Duchess of Sussex, is thought to generate approximately £1.8 billion, or about $2.5 billion, for the U.K. economy every year. (That number is likely even higher this year because of Prince Harry and Meghan’s May wedding.)\n\nHere’s what you need to know about each member of the royal family’s net worth:\n\nQueen Elizabeth II net worth\n\nQueen Elizabeth II visits the Royal College Of Physicians on February 20, 2018 in London, England. Chris Jackson—Getty Images Chris Jackson—Getty Images\n\nQueen Elizabeth II enjoys a number of royal perks — particularly her substantial wealth. The 91-year-old Queen Elizabeth’s net worth is estimated to be at least $520 million by Wealth-X, a global wealth insights firm. The firm also estimated the royal family’s net worth (Prince Philip and their children) to land at least $1.1 billion.\n\nThe queen’s net worth comes in part from a percentage of profits generated by the Crown Estate, which earned about £328.8 million pounds, or $459.25 million, in the 2016-2017 calendar year, according to its annual report. Queen Elizabeth gets a percentage of that profit — called the “Sovereign Grant” — which is set to increase from 15% to 25% over the next 10 years, in part to pay for renovations at Buckingham Palace that will be completed over the next decade. The queen also collects a salary from the Duchy of Lancaster, which is separate from the Crown Estate and is a private and independent income reserved for the Duke of Lancaster, which is the queen.\n\nQueen Elizabeth also owns real estate like the $140 million Balmoral Castle, a holiday home for the Royal Family that is featured on the back of Scotland’s £100 notes, and the $65 million Sandringham House in the English countryside, which the Queen inherited from her father. Both of these are private properties that have stayed within the Royal Family for years and are not part of the Crown Estate or other estates associated with the crown.\n\nPrince Philip net worth\n\nPrince Philip, Duke of Edinburgh attends the 2017 Braemar Highland Gathering at The Princess Royal and Duke of Fife Memorial Park on September 2, 2017 in Braemar, Scotland. Samir Hussein—Samir Hussein/WireImage Samir Hussein—Samir Hussein/WireImage\n\nPrince Philip — Queen Elizabeth’s husband of 70 years and the Duke of Edinburgh — also enjoys the wealth and perks that come with being a member of the royal family. While WealthX did not provide a net worth for Prince Philip, it has been reported it falls around $30 million.\n\nUnder the Sovereign Grant Act of 2011, Prince Philip received an annual Parliamentary annuity of £359,000 pounds, or around $500,234, “to meet the expenses of carrying out his public duties in support of the Queen.” Those duties included attending public events alongside the queen and alone, as well as giving speeches. At an event in March 2016, Prince Philip once joked he was the “world’s most expensive plaque-unveiler.”\n\nThe Duke of Edinburgh retired from his royal position in August 2017 at the age of 96, with the “full support of the Queen,” the palace said in a statement at the time. His retirement from the role came after he was admitted to the hospital in the summer of 2017 as a “precautionary measure” due to a pre-existing condition, though Buckingham Palace did not provide specifics for his retirement.\n\nPrince Charles net worth\n\nPrince Charles, Prince of Wales meets local school children in the village of Ramsbury on December 15, 2017 in Marlborough, England. Anwar Hussein—WireImage Anwar Hussein—WireImage\n\nLong the heir to the throne, Prince Charles’s net worth is estimated to be around $400 million, according to Wealth-X. Charles, also known as the Prince of Wales, makes most of his money through the Duchy of Cornwall, a private estate that funds the activities of whoever holds the title of Prince of Wales and his family.\n\nBetween March 2016 to March 2017, Prince Charles received £16.6 million, or $22.9 million, from the Duchy of Cornwall, according to the estate’s most recent financial statement. The Duchy of Cornwall has £1 billion, or $1.3 billion, in total assets. The estate itself owns a vast amount of land and real estate, predominately in southwest England, including cottages, countryside homes, barn conversions, sea-side estates and even some properties available for rent.\n\nThe Duchy of Cornwall was established in 1337 by Edward II with the intention of providing an income to the future Princes of Wales. The estate currently funds not only Prince Charles’ expenses but also those of his family, which includes Prince Charles, his wife Camilla, and his sons Prince William and Prince Harry and their wives Kate, Duchess of Cambridge and Meghan, Duchess of Sussex.\n\nOnce married to the late Princess Diana, mother to both Prince William and Prince Harry, Prince Charles has donated his wealth over the years to charities and aid projects through the Prince of Wales’s Charitable Foundation. The organization has awarded more than £52 million, or $72.5 million, in grants over the last 10 years, according to the charity’s website. Prince Charles’s charity halved its donations in the most recently reported year, giving £3.1 million, or $4.3 million, in 2017, compared to £7.7 million, or $10.7 million, in 2016, according to The Guardian.\n\nOne of the most recent beneficiaries of the foundation was Tusk, an organization founded to challenge poaching in Africa, which Prince William and Prince Harry worked with before.\n\nPrince William net worth\n\nBritain's Prince William, Duke of Cambridge, at the 2018 Centrepoint Awards at Kensington Palace on February 8, 2018 in London, England. WPA Pool—Getty Images WPA Pool—Getty Images\n\nPrince William and Prince Harry have similar net worths, having both inherited the fortune amassed by their late mother, Princess Diana. Both brothers are believed to be worth somewhere between $25 and $40 million, according to Business Insider.\n\nThe two brothers each reportedly received the inheritance from their mother in a lump sum of approximately £10 million ($14 million) when they turned 30 years old, Koenig said. They also each started receiving dividends of $450,000 each year upon turning 25, according to Forbes.\n\nWilliam and Harry do not have to pay for official expenses related to their royal duties, such as travel for official visits, staff costs and wardrobe, which are are all financed by The Duchy of Cornwall. In 2017, the Duchy reported spending $4.9 million total to cover the official duties of Harry, Meghan, William and Kate, expenses that are paid in part through the Duchy’s annual revenue.\n\nPrince William, who is second in line to the throne after his father, used to receive an annual salary of $62,000 for his work as an East Anglian Air Ambulance pilot, which he used to donate to charity, according to CNBC. He retired from his job flying rescue helicopters last summer to focus more on his royal duties.\n\nPrince Harry net worth\n\nDuchess of Sussex and Prince Harry, Duke of Sussex wave as they leave Windsor Castle after their wedding to attend an evening reception at Frogmore House, hosted by the Prince of Wales on May 19, 2018 in Windsor, England. Steve Parsons - WPA Pool/Getty Images\n\nPrince Harry’s net worth is similar to his brother’s, in part because they both inherited the same amount of money from Princess Diana’s estate. Harry’s wealth is estimated to be at least $25 million, according to Wealth-X, though other estimates put Prince Harry’s net worth as high as $40 million.\n\nLike his brother and sister-in-law, Prince Harry gets to save the majority of his inheritance because The Duchy of Cornwall covers the same expenses. Both Prince Harry and Prince William also inherited Princess Diana’s private jewels, though their value is not known, according to Koenig.\n\nPrince Harry served in the Royal Air Force for 10 years, working his way up to captain, and making about $53,000 a year, Forbes reports. He retired from service in 2015, saying he wanted to devote more time to philanthropic work like the Invictus Games, which hosts international adaptive sports competitions for injured veterans.\n\nHe wed American actress Meghan Markle in May at Windsor Castle, and experts estimated their wedding cost about as much Will and Kate’s 2011 nuptials — around $34 million, mainly due to the security needed for the high-profile event.\n\nKate Middleton net worth\n\nCatherine, Duchess of Cambridge, greets members of the crowd as she visits The Fire Station, one of Sunderland's most iconic buildings, on February 21, 2018 in Sunderland, England. Chris Jackson—Getty Images Chris Jackson—Getty Images\n\nKate Middleton, who became the Duchess of Cambridge after marrying Prince William in April 2011, also has official royal expenses covered by the Duchy of Cornwall. Kate’s personal net worth is believed to be somewhere around $10 million, Business Insider reported, though the exact number is not known.\n\nAlthough Kate is the first person outside a royal bloodline to join the royal family, her finances are anything but common. Middleton’s family runs a successful online mail-order party supply store, Party Pieces. Koenig says her parents, Michael and Carole Middleton, have been reported to be worth somewhere between $30 to $50 million, though the exact amount is not known.\n\n“There is no way in knowing if the Duchess’ parents have set up trusts for their three children,” she said. But we can assume that Kate and her two siblings, Pippa and James Middleton, will inherit their parents money eventually, she said.\n\nKate has three children with William — Prince George, 4, and Princess Charlotte, 2, and Prince Louis, a boy who was born on April 23.\n\nMeghan Markle net worth\n\nPrince Harry, Duke of Sussex and Meghan, Duchess of Sussex travel in the Ascot Landau Carriage during their carriage procession after their wedding on May 19, 2018 in Windsor, England. Among the guests were 2200 members of the public, the royal family and Ms. Markle's Mother, Doria Ragland. Nick Edwards - WPA Pool/Getty Images\n\nMeghan Markle, who became the Duchess of Sussex after marrying Prince Harry this year, may have the smallest bank account of her new (royal) family, but she’s still done well for herself with an estimated net worth of $5 million.\n\nMost of Meghan’s net worth comes from her acting career before her 2017 engagement to Prince Harry. Meghan was paid $50,000 per episode on Suits, making her annual salary for the USA Network drama around $450,000, according to Fortune, but she left the show when she moved to the U.K. to live with Prince Harry. Meghan earned additional income from smaller film roles throughout her acting career.\n\nThe 36-year-old former Suits actress receives the same financial perks as her new sister-in-law, Kate. Meghan’s expenses related to all official royal business, including wardrobe, are paid for by the Duchy of Cornwall.\n\nDespite only being married in May, Meghan has already joined Prince Harry for numerous royal engagements and begun her official royal duties. She has said she wants to dive into charity work through the Royal Foundation, having previously worked on United Nations campaigns for women’s rights.\n\nPrince George, Princess Charlotte and Prince Louis net worths\n\nPrincess Charlotte of Cambridge and Prince George of Cambridge look on from the balcony during the annual Trooping The Colour parade at the Mall on June 17, 2017 in London, England. Karwai Tang—WireImage Karwai Tang—WireImage\n\nAt just 4, 2 and less than a year old Prince George, Princess Charlotte and Prince Louis are destined for a life of wealth and royalty.\n\nPrince William and Kate Middleton’s first two children both already have relatively lavish lives — they attend two of the most impressive, and expensive, preschools in London. Prince George, who is third in line for the throne, attends Thomas’s Battersea — a $24,000-a-year- preschool that is touted as “the best English education money can buy.” Fourth in line for the throne, Princess Charlotte goes to the Willcocks Nursery School, a female-run preschool with a $14,000-a-year tuition.\n\nBoth Prince George and Princess Charlotte are expected to have a large impact on the British economy, according to branding valuation company Brand Finance, CNNMoney reported. Princess Charlotte is expected to have inspired $5 billion in economic activity while Prince George is expected to generate $3.6 billion, according to Brand Finance. Prince Louis is expected to generate a bit less than his older siblings, somewhere between $70-125 million within the first few weeks of his life, according to U.K-based research firms.\n\nThis story was updated to correct the spelling of the Duchy of Cornwall.", "images": ["http://time.com/images/newsletter-money.png", "https://moneydotcomvip.files.wordpress.com/2018/02/prince-william.jpg", "https://moneydotcomvip.files.wordpress.com/2018/03/prince-charles.jpg", "https://moneydotcomvip.files.wordpress.com/2018/02/queen-elizabeth-ii.jpg", "http://time.com/img/navigation/subscribe-icon.svg", "https://moneydotcomvip.files.wordpress.com/2018/02/prince-george-princess-charlotte.jpg", "https://moneydotcomvip.files.wordpress.com/2018/03/royals-net-worth-money.jpg?quality=85", "https://moneydotcomvip.files.wordpress.com/2018/05/prince-harry-net-worth.jpg", "https://moneydotcomvip.files.wordpress.com/2018/02/prince-philip.jpg", "https://timedotcom.files.wordpress.com/2017/09/money-newsletter-tout-footer.png", "https://moneydotcomvip.files.wordpress.com/2018/02/kate-middleton.jpg", "https://moneydotcomvip.files.wordpress.com/2018/05/meghan-markle-net-worth.jpg"], "top_img": "https://moneydotcomvip.files.wordpress.com/2018/03/royals-net-worth-money.jpg?quality=85", "keywords": [], "authors": ["Alix Langone", "Jennifer Calfas"], "canonical_link": "https://money.com/royal-family-net-worth/", "title": "All the Members of the British Royal Family, Ranked by Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "royal family net worth, british royal family net worth trillion, uk royal family net worth, british family tree, net worth of british royal family, net worth of the royal family, queen net worth, queen elizabeth net worth, royal family net worth 2018, royal family of england net worth", "news_keywords": "royal family net worth, british royal family net worth trillion, uk royal family net worth, british family tree, net worth of british royal family, net worth of the royal family, queen net worth, queen elizabeth net worth, royal family net worth 2018, royal family of england net worth", "description": "Here's everything we know about the royal family's net worth, including who is the richest member of the royal family", "og": {"title": "All the Members of the British Royal Family, Ranked by Net Worth", "type": "article", "site_name": "Money", "url": "https://money.com/royal-family-net-worth/", "description": "Which royal is the richest of them all?", "image": {"identifier": "https://moneydotcomvip.files.wordpress.com/2018/03/royals-net-worth-money.jpg?quality=85", "width": 1024, "height": 683}}, "pinterest": {"url": "https://money.com/royal-family-net-worth/", "description": "Here's everything we know about the royal family's net worth, including who is the richest member of the royal family", "media": "https://moneydotcomvip.files.wordpress.com/2018/03/royals-net-worth-money.jpg?quality=85"}, "twitter": {"card": "summary_large_image", "url": "https://money.com/royal-family-net-worth/", "title": "All the Members of the British Royal Family, Ranked by Net Worth", "description": "Which royal is the richest of them all?", "site": "@MONEY", "image": "https://moneydotcomvip.files.wordpress.com/2018/03/royals-net-worth-money.jpg?quality=85"}, "fb": {"app_id": 53177223193, "pages": 119930514707114}, "google-site-verification": "5w1rl4iwAR7kN1jfJEXz5hqEVP7X_HAasGoC7R_LpDE"}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}