{"url": "https://www.tvguide.com/news/dancing-with-the-stars-trio-night-recap-terrell-owens-eliminated/", "text": "Trio night brought back a few fan favorites from previous seasons of Dancing with the Stars, including Alfonso Ribeiro, Laurie Hernandez and Corbin Bleu.\n\nWhile it's always super exciting for fans to revisit the greatest hits, it does present a new hurdle to tackle for the pros. They not only have one non-dancer to whip into shape, they have a second partner who hasn't been dancing their heart out for the past eight weeks. Even worse, not all celebs are made equal, and some newbies' shortcomings were much easier to notice when put next to previous winners. Logic follows, not everyone could hack it, and someone had to go home.\n\nTerell Owens and Cheryl Burke, Dancing with the Stars Photo: Eric McCandless, ABC\n\n\n\nTerrell Owens & Cheryl Burke - Charleston - \"Bad Boy Good Man\" by Tape Five (feat. Henrik Wager)\n\nThe dance: The Charleston is always going to look weird on lanky dancers since you have to flail your limbs around at twice the average speed of an African swallow. Terrell didn't necessarily look totally graceful, but he managed better than I expected. The fast feet never tripped him up, and considering he had a trio Rumba to learn this week too, he kind of rocked this routine.\n\nWhat the judges said: For once, Len was actually all about the different dance styles besides Charleston incorporated into this routine. That's a first. All the judges also agreed that Terrell is the most improved star on the show this year, which means something.\n\nScore: 27/30\n\nVery nice, Terrell! Very nice!\n\nDrew Scott & Emma Slater - Waltz - \"Both Sides Now (Torch Songs)\" by Years & Years\n\nThe dance: This waltz was all about Drew's relationship with his fiancee — if you couldn't tell, he shoved his way through the crowd to give her a kiss after he finished — and the emotion was definitely there. I also bet his fiancee is excited to have him learning how to waltz right before they walk down the aisle. Unfortunately, Drew's missteps continued this week, and a few less-than-graceful mistakes meant a much lower score than he earned last week.\n\nWhat the judges said: \"Your intentions were very very clear and deeply felt,\" Bruno complimented, but while the emotions were there, the footwork kind of wasn't. Drew had some shaky turns that caught the judges' eyes, and after last week's fall, this spells bad news for him.\n\nScore: 22/30\n\nUh oh... Drew's headed for the bottom of the board again.\n\nVictoria Arlen & Val Chmerkovskiy - Argentine Tango - \"Down\" by Marian Hill\n\nThe dance: The last thing you want to hear from a girl who can't technically feel her legs is that she's experiencing pain and spasm right before you go on stage. Victoria's hip spasm during dress rehearsals put everyone on edge, but she soldiered through it for the show. Other than a serious injury, Victoria's biggest problem was bringing sexy back. According to her, she was never sexy to begin with, preferring to be a cheesy dork most of the time instead. If the fact that Val laid her down on the floor and crawled on top of her when they finished is any indication... she was plenty sexy.\n\nWhat the judges said: The judges loved the lines and the form, but they could tell she was trying a little too hard to master the intensity and the sex appeal of the dance. Dancing these routines requires a lot of acting (just ask Frankie Muniz), and that's not Victoria's forte.\n\nScore: 24/30\n\nBlame it on the spasm, girl. I would.\n\nLindsey Stirling & Mark Ballas - Samba - \"Morning Drums\" by Gregor Salto\n\nThe dance: Lindsey's rib injury didn't carry over into this week (strange...), but being back at 110% meant she could effectively pretend to be a lion in the circus for this Samba. Then again, did anyone else think this week's choreography was a little tame compared to the wild acrobatics and fast footwork of all her previous routines? Maybe Mark took it easy this week in order to keep her in good health. It wasn't her best routine to date, but she's not getting eliminated until she makes this slow pace the new normal.\n\nWhat the judges said: Len agreed, saying Lindsey looked less sure-footed than normal. It was full of \"rhythm and imagination,\" but ultimately the hip action was lacking. Carrie Ann thought she brought out her inner-Beyonce, which is probably the greatest note to ever get.\n\nScore: 26/30\n\nLindsey blamed the \"awkward white girl\" in her, which is kind of fair, to be honest.\n\nFrankie Muniz & Witney Carson - Viennese Waltz - \"Perfect\" by Ed Sheeran\n\nThe dance: I'd like it printed on my headstone that I doubted Frankie Muniz's ability to perform on this show, and it's my biggest regret to date. Frankie and Witney made it to the top of the leaderboard last week, and this week they proved why. Ed Sheeran probably did a lot of the work, making this a super romantic number, but Frankie and his awesome lines didn't hurt. Seriously, there's almost nothing this guy can't do. He's my dark horse bet.\n\nWhat the judges said: Carrie Ann called it the closest thing to perfection except for when Frankie briefly lost control of Witney (which led to some sort of inappropriate comments from Tom), but Len thought it was as far from perfection as you can get. I love it when the judges fight. I start screaming \"FIGHT! FIGHT! FIGHT!\" at my TV screen like an idiot.\n\nScore: 26/30\n\nTake off the shirt next week, Frankie. You'll be back on top.\n\nJordan Fisher & Lindsay Arnold - Quickstep - \"Chuck Berry\" by Pharrell Williams\n\nThe dance: When you have a minute to rewatch this season, I want you to watch Jordan Fisher's facial expressions while he dances and try not to smile. I dare you. He really was born for the quickstep, and if his faces are any indication, he loved dancing it. Everyone else has sort of muscled their way through it, and he's floated. Even the loud blue suit couldn't detract from his stellar performance.\n\nWhat the judges said: Carrie Ann called it \"brilliant and sassy\" and HOLY CRAP, Len stood up and applauded. That kind of says it all.\n\nScore: 30/30\n\nAre we even surprised? He's our MVP!\n\nFrankie Muniz and Witney Carson, Dancing with the Stars Photo: Eric McCandless, ABC\n\nTrio Dances\n\nTerrell Owens & Cheryl Burke & Kelly Monaco - Rumba - \"Slow Hands\" by Niall Horan\n\nThe dance: I'm not sure I'm totally down with Kelly promising Terrell a date if they got three 10s, especially considering the sexual nature of their trio dance, but if everything's consensual then more power to 'em. Speaking of that dance, Terrell cashed in on those stellar abs of his, and he even showed off some sexy hip action too. I mean... who wouldn't want to date him?\n\nWhat the judges said: Carrie Ann (and every female audience member) was loving the sex appeal, but she thought he was capable of more than what he did on stage. That's kind of a compliment, right?\n\nScore: 24/30\n\nWay to c*ck block, guys.\n\nDrew Scott & Emma Slater & Rashad Jennings - Cha Cha - \"Get Up Offa That Thing\" by James Brown\n\nThe dance: Could anyone even see this routine with all the glitter-jackets and mirror balls and sequins in this routine? Keeping up with Rashad is hard for any dancer (hello, reigning champ), but for a dancer who's got little to no rhythm to begin with? Super hard. Drew lost the beat a couple times, but I did noticed his body rolls were way more soulful than normal.\n\nWhat the judges said: The judges noticed that he didn't quite make muster on the \"soul\" aspect, especially when put next to Rashad, whose hips absolutely don't lie. He did, however, do a good job of keeping up in general, so he got good notes overall.\n\nScore: 25/30\n\nGuys, Drew kind of deserves to be on the chopping block. There, I said it.\n\nVictoria Arlen & Val Chmerkovskiy & Laurie Hernandez - Jive - \"Magic\" by B.o.B (feat. Rivers Cuomo)\n\nThe dance: When Laurie and Victoria weren't geeking out over Star Wars, they were having a ball (get it?). Two olympians and a pro dancer made for an awesome trio, and their dance went off without a hitch. Unfortunately, this was another case where a more talented alum was paired with a less than fantastic newbie, and Victoria looked pretty stiff next to Laurie's awesome shaking and jiving. I'd blame it on Victoria's spasms though because did you guys see that back brace? And she switched to tennis shoes instead of heels for this dance. I hope she's okay!\n\nWhat the judges said: Even Carrie Ann and Bruno had to agree that Victoria fell out of step next to Laurie and Val. The trio isn't sharp until everyone's sharp, and they didn't quite get there tonight.\n\nScore: 24/30\n\nShe deserves at least one more week to prove she can win this thing.\n\nLindsey Stirling & Mark Ballas & Kristi Yamaguchi- Jazz - \"Let's Face The Music And Dance\" by Seth MacFarlane\n\nThe dance: Okay, this dance proved why trio night was a good idea. It was unclear before now, but Mark, Lindsey, and Kristi really brought it home. When you have three people who know what they're doing, it works like a well-oiled machine, and everyone goes home happy. Lindsey definitely got her groove back in this routine with fast feet and a few awesome lifts. That's more like it, girl!\n\nWhat the judges said: \"It was like I paid money to see that!\" Carrie Ann said, and that practically makes Lindsey a pro now, right?\n\nScore: 28/30\n\nAnyone who smells his partners shoes to make sure they're working hard deserves at least one 10.\n\nFrankie Muniz & Witney Carson & Alfonso Ribeiro - Jive - \"Good Place\" by Leo Soul\n\nThe dance: The child actor factor was strong in this trio, and watching Alfonso buck Frankie up was kind of the cutest thing ever. The audience loved the routine so much they wouldn't stop cheering. Maybe it was for the Carlton fake out? That had me laughing. Frankie might have had doubts about how long he'd last in this competition, but I definitely don't. He's finals material. Let's all just pretend we didn't hear that cringeworthy plug for America's Funniest Home Videos.\n\nWhat the judges said: Bruno attributed their awesomeness to Witney's good influence, and I kind of agree. She's the best pro to have as your partner in my opinion. The judges did notice Frankie's nerves this time around, but they also thought all three people in this trio complemented each other perfectly.\n\nScore: 27/30\n\nNot too shabby!\n\nJordan Fisher & Lindsay Arnold & Corbin Bleu - Salsa - \"Que Viva La Vida\" by Wisin\n\nThe dance: Wow. Just... wow. Every week I wonder if Jordan Fisher is really as good as I think he is, and then every week he does something like that. The lifts and the tempo and the footwork were so fantastic, it's hard to believe any of these three kids weren't born dancing the salsa. Plus, the Corbin/Jordan team up was worth it just to hear the story of Jordan watching High School Musical for the first time and getting inspired by Corbin to start acting/dancing/singing.\n\nWhat the judges said: For once all of Bruno's flailing felt totally earned. \"Hashtag amazeballs? Triple fire emoji?!\" Carrie Ann couldn't even speak English anymore, this dance was so awesome. They even said this dance would go down in Dancing with the Stars history!\n\nScore: 30/30\n\nAnother perfect score?! This guy is in it to win it!\n\nLINDSAY ARNOLD, JORDAN FISHER, LINDSEY STIRLING, MARK BALLAS, NIKKI BELLA, ARTEM CHIGVINTSEV, CHERYL BURKE, TERRELL OWENS, Dancing with the Stars Photo: Eric McCandless, ABC\n\nElimination: The show started off with the strongest first, announcing Lindsey and Jordan would both be in the semi-finals. Victoria was a bit of a surprise considering how she danced tonight, but that's fair enough. For a hot minute, I was terrified my Frankie would be going home, but ultimately it was time for Terrell Owens to pack his bags as he and Cheryl were eliminated... despite scoring a very good score of 27 earlier.\n\nDancing with the Stars airs Mondays at 8/7c on ABC.", "images": ["https://tvguide1.cbsistatic.com/i/r/2020/04/16/565eda06-3941-42fa-b7fc-d930aee08f41/crop/1380x1380+345+0/thumbnail/70x70/4b41f885e39268c832df50f93dcc84c5/pdcoa-1-news.jpg", "https://tvguide1.cbsistatic.com/i/r/2017/07/05/bc91406b-3a01-4435-aee9-43c1dbd39980/crop/1380x1380+345+0/thumbnail/70x70/c42dde18b65265a935b0ebab8df274fb/170705-news-broadchurch.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/01/03/923b13d6-3282-4843-a171-21faced10985/crop/220x220+90+0/thumbnail/64x64/e7bba1091c020fad81e1c35ba5c67edc/best100shows.png", "https://tvguide1.cbsistatic.com/i/r/2020/03/30/af5b983a-0607-4360-b289-d0abd98d9bd6/crop/450x450+180+0/thumbnail/70x70/7c04a71635e3f0d825c961f272e7572e/200330-tiger-king-hp.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/04/15/1ced518e-b4cf-4436-b8dc-4ba119b7d796/crop/1380x1380+345+0/thumbnail/70x70/b4262d63c01e8fee3fb0cb11249be109/200415-wwdits.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/10/18/13f3374e-121e-4076-a965-25b39d80f359/crop/113x113+44+0/thumbnail/64x64/bf3ac71eb6c1e855f44b57941e2fa3bc/botd-small.jpg", "https://tvguide1.cbsistatic.com/mediabin/showcards/tvshows/100000-199999/thumbs/191470-dancing_with_the_stars_100x133.png", "https://tvguide1.cbsistatic.com/i/r/2020/03/16/4acca96b-e6f0-47d1-937b-0fc170ca8fbf/crop/768x768+316+0/thumbnail/64x64/75984ad9c47e168d02ada156753aea77/200316-streaming-header.jpg", "https://tvguide1.cbsistatic.com/i/r/2018/04/13/345ae1e9-49f3-466b-b122-f444fa426c1c/crop/810x449+0+0/thumbnail/240x133/8f715235a1eb3c4f097109f6ce3d6a39/180413-kylechandlerfridaynightlights-hpsm.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://tvguide1.cbsistatic.com/i/r/2020/03/19/a704c117-cd63-4e73-bd2b-e642ebfeabde/crop/1380x1380+345+0/thumbnail/64x64/0b19d9a21f9e3babd4f91f0332011d86/feelgoodshows-news.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/11/08/b47c62ea-c071-4943-9af0-3ec30214f190/crop/1380x1380+345+0/thumbnail/64x64/ef6c75665c8a3dd657d67933e7c05632/191107-supernatural-news.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/11/22/3ee64a21-6fa9-40ab-ab73-63b7f8398081/crop/768x768+316+0/thumbnail/64x64/626c97834f395b4c04437030da2d91d6/streamingshow-news.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/02/12/d50dc4eb-048c-46a7-a10b-6612702aa280/crop/1380x1380+345+0/thumbnail/70x70/b946d714a340f58fc03a96538dca2b5b/200213-prodigal-son-superlatives.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/06/27/3fad4b53-a36e-4293-b6ce-ccefad29ffcd/crop/810x449+0+0/thumbnail/240x133/cad5df011ab1dd8b351cd24feada7c86/190627-one-day-at-a-time-hpsm.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/01/12/ceb0da6a-93ad-49f7-938a-28d551bde55d/crop/450x450+180+0/thumbnail/70x70/0de32324bb3e93d698553f52955d65b3/sbtb-hpsm.jpg", "https://tvguide1.cbsistatic.com/i/r/2017/11/06/4a5bfa5d-125f-40a8-b572-a372893d0c42/thumbnail/1300x867/b777c72231e1694cf0ad00a1cd6dd348/171106-frankie-muniz-witney-carson-dancing-with-the-stars.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/04/05/e7406a34-3c0a-4bc9-a6c5-c78b9fc15206/crop/2070x1147+0+0/thumbnail/240x133/33366fa0427b5fbcd05d82d4d88bb082/stranger-things-reg.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/12/01/96c48961-ca4f-4b28-b527-8671dead3c25/crop/450x450+180+0/thumbnail/70x70/845f18917d00275750e9fdf4fa575dea/yoda-hpsm.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/04/15/82faad20-77d8-4a9e-822a-45cfbbd511a1/crop/2070x1147+0+0/thumbnail/240x133/824ebe929b742c271435470c8ce0eec8/200415-blackaf.jpg", "https://tvguide1.cbsistatic.com/i/r/2018/01/26/655ca22a-13c4-4792-9064-69485e432cb7/crop/450x450+180+0/thumbnail/70x70/7342b085915e1f180f5a9f27a6772d79/180125-schitts-creek-annie-murphy-hpsm.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/03/08/d0d677a3-6ae0-42a7-a3e0-97afef3f110e/crop/450x450+180+0/thumbnail/70x70/6ea81c93896c18de5e6a87a77328475b/snl-hpsm.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/12/13/a90a16b6-6ea8-4d66-80f7-54bd3e813b86/crop/1380x1380+345+0/thumbnail/64x64/a03f5a19631705481b2d6511b4e5ed50/191213-tatb2.jpg", "https://tvguide1.cbsistatic.com/i/r/2020/03/20/34eef86e-4f48-4135-8b87-1958ef4a7d87/crop/450x450+180+0/thumbnail/70x70/6225df71d218139e69d9100bb5108d9a/onward-hpsm.jpg"], "top_img": "https://tvguide1.cbsistatic.com/i/r/2017/11/06/4a5bfa5d-125f-40a8-b572-a372893d0c42/thumbnail/1300x867/b777c72231e1694cf0ad00a1cd6dd348/171106-frankie-muniz-witney-carson-dancing-with-the-stars.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.tvguide.com/news/dancing-with-the-stars-trio-night-recap-terrell-owens-eliminated/", "title": "Dancing with the Stars Recap: Terrell Owens Goes Home After Sexy Rumba", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no", "apple-itunes-app": "app-id=333647776, affiliate-data=at=11l9QE, app-argument=https://www.tvguide.com/news/dancing-with-the-stars-trio-night-recap-terrell-owens-eliminated/", "fb": {"app_id": 63084645929}, "google-site-verification": "Od29UEFliEmsUY2XH0kfXxkTNucL0cv_rc0J_RPWXU4", "description": "Jordan Fisher killed it with two perfect scores, but Terrell Owens tanked during Trio Night.", "og": {"title": "Dancing with the Stars: Who's So Good They Got Two Perfect Scores? | TV Guide", "type": "article", "url": "https://www.tvguide.com/news/dancing-with-the-stars-trio-night-recap-terrell-owens-eliminated/", "image": "https://tvguide1.cbsistatic.com/i/r/2017/11/06/4a5bfa5d-125f-40a8-b572-a372893d0c42/thumbnail/1300x867/b777c72231e1694cf0ad00a1cd6dd348/171106-frankie-muniz-witney-carson-dancing-with-the-stars.jpg", "description": "Which couple totally tanked Trio Night?", "site_name": "TVGuide.com"}, "article": {"published_time": "2017-11-06T22:02:00-05:00", "tag": "Recaps"}, "twitter": {"card": "summary_large_image", "site": "@TVGuide", "title": "Dancing with the Stars: Who's So Good They Got Two Perfect Scores? | TV Guide", "description": "One couple got TWO perfect scores, but another totally tanked trio night. #DWTS", "image": {"src": "https://tvguide1.cbsistatic.com/i/r/2017/11/06/4a5bfa5d-125f-40a8-b572-a372893d0c42/thumbnail/1300x867/b777c72231e1694cf0ad00a1cd6dd348/171106-frankie-muniz-witney-carson-dancing-with-the-stars.jpg"}}}, "movies": [], "publish_date": 1510023720.0, "source": "https://www.tvguide.com", "summary": ""}