{"url": "https://www.hollywoodreporter.com/thr-esq/kanye-west-files-10-million-lawsuit-tour-canceled-due-his-mental-breakdown-1025718", "text": "When the hip-hop star scrapped his tour, he submitted to an interrogation under oath. Yet possibly because of drug use, his insurers haven't paid up on money allegedly owed.\n\nFrom an infamous concert in San Jose, Calif., on Nov. 17 to a visit to Trump Tower a few weeks later, Kanye West had observers buzzing about his behavior last year. Even though he was hospitalized at the UCLA Neuropsychiatric Hospital Center around Thanksgiving, few knew the full extent of what West endured in the aftermath of a psychological breakdown.\n\nNow The Hollywood Reporter has obtained an explosive new $10 million lawsuit that details an extensive medical examination of the music star.\n\nWest is suing various syndicates of insurer Lloyd's of London, alleging they are stalling on paying out claims emanating from a canceled tour. A loss claim was tendered just two days after West checked himself into a psychiatric center, but he and his company — Very Good Touring, Inc. — still have not been paid more than eight months later, according to the suit.\n\n\"Nor have they provided anything approaching a coherent explanation about why they have not paid, or any indication if they will ever pay or even make a coverage decision, implying that Kanye's use of marijuana may provide them with a basis to deny the claim and retain the hundreds of thousands of dollars in insurance premiums paid by Very Good,\" states a complaint filed Tuesday in California federal court. \"The stalling is emblematic of a broader modus operandi of the insurers of never-ending post-claim underwriting where the insurers hunt for some contrived excuse not to pay.\"\n\nWest originally planned a \"Saint Pablo Tour\" consisting of 38 events between Aug. 12 and Nov. 2, 2016. His managers reached out to Lloyd's to get \"peace of mind\" in case cancellations needed to occur. The star made most of the dates but was forced to cancel two concerts when his wife, Kim Kardashian, was robbed at gunpoint in Paris on Oct. 2. (Indeed, he famously walked off stage when he learned of the incident.)\n\nThanks to the success of the tour, though, additional dates were arranged. The second performance during this leg of the tour is where everything started to fall apart.\n\nIn San Jose, West told the crowd, \"I said something that was politically incorrect. I told you I didn't vote, but if I were to have voted, I would have voted for [Donald] Trump.\"\n\nHe was booed.\n\nTwo days later, West appeared for a concert in Sacramento and launched a 15-minute tirade about various public figures, including Beyonce (\"I was hurt 'cause I heard that you said you wouldn't perform unless you won Video of the Year over me\"), Jay Z (\"I know you got killers. Please don't send them at my head\") and Hillary Clinton (\"This Saint Pablo tour is the most relevant [thing] happening. If your old ass keeps following old models, you'll be Hillary Clinton\").\n\nWest's lawsuit addresses this latter concert and notes the \"strained, confused and erratic\" behavior in Sacramento, as well as the decision made the following day to cancel the balance of the tour and issue full refunds. He was soon hospitalized at UCLA, and the insurance companies were informed and later provided with sworn testimony from his primary physician there that West suffered a debilitating medical condition that required he not tour.\n\nBut that wasn't good enough for the insurance companies, according to the suit.\n\n\"Almost immediately after the claim was submitted, Defendants selected legal counsel to oversee the adjustment of the claim, instead of the more normal approach of retaining a non-lawyer insurance adjuster,\" states West's complaint. \"Immediately turning to legal counsel made it clear that Defendants' goal was to hunt for any ostensible excuse, no matter how fanciful, to deny coverage or to maneuver themselves into a position of trying to negotiate a discount on the loss payment.\"\n\nWest's court papers reveal the extent to which he has been attempting to convince the insurers that his mental breakdown was indeed real.\n\n\"While Kanye was still under medical care for his disabling condition, the Defendant syndicates demanded that Kanye submit to an immediate IME,\" state the court papers, referring to an independent medical examination. \"Kanye was made available for a purported IME by a doctor, hand-selected by the insurers' counsel, who was predisposed to look for some reason to deny the claim. Yet even Defendants' selected doctor had to admit that Kanye was disabled from being able to continue with the Tour. As demanded by the insurers, Kanye was also subsequently presented for an examination under oath (\"EUO\"), and at least eleven other persons affiliated with Kanye and Very Good were similarly presented for EUOs.\"\n\nWest still can't get answers about why the insurance companies won't pay up, but according to court papers, the insurers demanded to interview others outside of West's control to make a determination. The defendants are also said to be raising \"irrelevant facts\" bearing on the issue of coverage. While those facts aren't discussed in the lawsuit, some aggressive tabloids have been pushing for information about the canceled tour and its aftermath, raising everything from drug use to song lyrics as fodder.\n\nThe new lawsuit accuses the insurers of leaking private information regarding the hip-hop star to news outlets.\n\n\"Plaintiff is informed and believes that the 'planting' of the Confidential Information with news outlets ... was part and parcel of Defendants' efforts to impair Plaintiff's rights to the indemnity payments due under the Insurance Policies,\" states the complaint, which nods to a non-disclosure agreement between the parties.\n\nAnd so West has filed a lawsuit alleging breach of contract and breach of good faith and fair dealing against the various entities, including Cathedral Syndicate.\n\nAs West's lawyer Howard King writes, \"Performing artists who pay handsomely to insurance companies within the Lloyd's of London marketplace to obtain show tour 'non-appearance or cancellation' insurance should take note of the lesson to be learned from this lawsuit: Lloyd's companies enjoy collecting bounteous premiums; they don't enjoy paying claims, no matter how legitimate. Their business model thrives on conducting unending 'investigations,' of bona fide coverage requests, stalling interminably, running up their insured's costs, and avoiding coverage decisions based on flimsy excuses. The artists think they're buying peace of mind. The insurers know they're just selling a ticket to the courthouse.\"", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/04/eriq096-1_0.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/2017/05/gettyimages-598209548_-_h_2017.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2017/05/gettyimages-598209548_-_h_2017.jpg", "https://cdn1.thr.com/sites/default/files/blogicon_hollywoodesq.png"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/05/gettyimages-598209548_-_h_2017.jpg", "keywords": [], "authors": ["Eriq Gardner", "Eriq.Gardner Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/thr-esq/kanye-west-files-10-million-lawsuit-tour-canceled-due-his-mental-breakdown-1025718", "title": "Kanye West Files $10 Million Lawsuit Over Tour Canceled Due to His Mental Breakdown", "meta_data": {"viewport": "width=device-width", "description": "When the hip-hop star scrapped his tour, he submitted to an interrogation under oath. Yet possibly because of drug use, his insurers haven't paid up on money allegedly owed.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/thr-esq/kanye-west-files-10-million-lawsuit-tour-canceled-due-his-mental-breakdown-1025718", "domain": "https://www.hollywoodreporter.com/", "title": "Kanye West Files $10 Million Lawsuit Over Tour Canceled Due to His Mental Breakdown", "description": "When the hip-hop star scrapped his tour, he submitted to an interrogation under oath. Yet possibly because of drug use, his insurers haven't paid up on money allegedly owed.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/05/gettyimages-598209548_-_h_2017.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Kanye West Files $10 Million Lawsuit Over Tour Canceled Due to His Mental Breakdown", "description": "When the hip-hop star scrapped his tour, he submitted to an interrogation under oath. Yet possibly because of drug use, his insurers haven't paid up on money allegedly owed.", "url": "https://www.hollywoodreporter.com/thr-esq/kanye-west-files-10-million-lawsuit-tour-canceled-due-his-mental-breakdown-1025718", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/05/gettyimages-598209548_-_h_2017.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Kanye West Files $10 Million Lawsuit Over Tour Canceled Due to His Mental Breakdown", "sailthru.description": "When the hip-hop star scrapped his tour, he submitted to an interrogation under oath. Yet possibly because of drug use, his insurers haven't paid up on money allegedly owed.", "sailthru.author": "Eriq Gardner", "sailthru.channel": "THR, Esq.", "sailthru.vertical": "Esq.", "sailthru.date": "2017-08-01 14:50:26", "sailthru.tags": "THR, Esq., Music, Business"}, "movies": [], "publish_date": 1501570226.0, "source": "https://www.hollywoodreporter.com", "summary": ""}