{"url": "https://www.instyle.com/news/meghan-markle-princess-diana-similar-same-comparison", "text": "Image zoom Photo Illustration. Photos: Shutterstock, Getty Images\n\nIf you've spent even .01% of your time watching the Meghan Markle and Prince Harry's love story unfold, you are well aware that comparisons Princess Diana has been invoked pretty often.\n\nThe late Princess of Wales has been mentioned constantly since the couple's engagement announcement back in November, and hey, we're just as guilty of waxing poetic about it too. But there's some truth to the comparison, even if you're a skeptic.\n\nThe Duchess of Sussex truthfully does have a good amount in common with her mother-in-law, to the point where the first ones to draw the parallel were actually Meghan and Harry themselves. They brought Di up in their engagement interview, where Harry made it clear how close he imagined they would be if his mother was still alive.\n\n\"Oh they'd be thick as thieves, without question,\" Prince Harry said. \"I think she would be over the moon, jumping up and down, you know so excited for me, but then, as I said, would have probably been best friends—best friends with Meghan. It's days like today when I really miss having her around and miss being able to share the happy news. But you know with the ring and with everything else that's going on I'm sure she's ... \"\n\n\" ... she's with us,\" Markle finished.\n\nRELATED: Singer Bryan Adams Was Asked Point-Blank About His Relationship with Princess Diana\n\nWho are we to argue with that? Luckily we don't have to, since there's plenty of evidence to back it up, even without Harry's perspective in the mix. Allow us to break it down.\n\nThey are humanitarians.\n\nThis is probably the most striking comparison drawn between the two royals. Princess Diana was famously activism-focused. Her legacy is one of humanitarian work and beloved reverence now, but during her time as a princess while she was still alive, she was met with heated criticism for doing things like fighting the AIDS stigma in a time when even the U.S. president Ronald Reagan wouldn't acknowledge the disease existed. Not everyone understood what she was doing and why, but in hindsight, it all makes complete sense.\n\nMarkle has also shown herself to be an advocate, and she's spoken about gender equality, social justice, and feminism openly. Now that she has a larger global platform, it will be exciting to see what she chooses to do with it.\n\nThey're rule breakers.\n\nAs Markle gets the hang of this whole royals thing, she's made a few stumbles here and there. She's got good company, though. As some remember, Diana didn't always hesitate to break or bend the rules herself.\n\nAfter choosing her own engagement ring and writing her own vows, she had Prince William and Prince Harry and insisted they went to school normally. That might seem like a \"no duh\" move now, but according to Good Housekeeping, William was actually the first heir to the throne to attend a public school. Ever.\n\nImage zoom Tim Graham/Getty Images\n\nThat makes Markle walking herself partway down the aisle during the royal wedding seem like nothing.\n\nTheir parents are divorced.\n\nDiana's father John Spencer and her mother Frances Spencer split when Di was seven years old. Markle went through something similar when her parents, Doria Ragland and the now-infamous Thomas Markle, separated when she was two years old, as she told Vanity Fair.\n\nRELATED: Why Meghan Markle’s Wearing So Much Pink, According to Royal Experts\n\n“What’s so incredible, you know, is that my parents split up when I was two, [but] I never saw them fight. We would still take vacations together. My dad would come on Sundays to drop me off, and we’d watch Jeopardy! eating dinner on TV trays, the three of us,\" she said. \"We were still so close-knit.”\n\nThey didn't date their future husbands long before getting engaged.\n\nHarry and Meghan's seemingly whirlwind relationship drew ire from skeptics, since they only met in summer 2016, and were engaged November 2017. Turns out, Diana and her ex Prince Charles were the same before they wed. Princess Diana started dating Charles in summer 1980, and they were engaged by February 1981.\n\nTheir engagement rings coordinated.\n\nThe likeness of the two royals is physically manifested in the engagement ring Prince Harry gave Markle. Her ring includes two diamonds from Diana's collection, with the center stone being from Botswana.\n\nImage zoom Max Mumby/Indigo/Getty Images\n\nThey weren't born royal.\n\nThey share this commonality with Kate Middleton as well. None of them were born into royalty, yet they all learned (and are learning) the ropes in their own ways.\n\nRELATED: Meghan Markle Just Broke Her Silence on Her Marriage to Prince Harry and It’s … Something\n\nAll that said, they do have unique differences.\n\nOf course, it's evident that they aren't twins, and it isn't fair to pass them off that way for the rest of Meghan and Harry's lives. The differences are also there. Diana grew up in a well-known British family that had ties to Queen Elizabeth from the get-go. Markle, on the other hand, was born in Los Angeles to a yoga instructor and lighting director.\n\nUnlike Diana, Meghan wore two dresses at her wedding. Markle's family didn't meet the royals until days before the wedding, and her dad still hasn't met Harry, unlike Diana, who had closer ties to the royals long before she started dating Charles. Markle had been married and divorced before marrying Harry. There doesn't seem to be a Camilla Parker-Bowles-like figure in the dynamic between Harry and Meghan like there was for Charles and Diana.\n\nBut still, it's nice to peer closely at what they do have in common.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fimages%2F2018%2F02%2Fellen-pompeo-5.jpg&q=85&w=200", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F684xflex%2Fpublic%2F1530284147%2FGettyImages-79732837.jpg%3Fitok%3DimY4Q7D6", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fimages%2F2018%2F02%2F022318-danielle-brooks-baw-lead.jpg&q=85&w=200", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fimages%2F2018%2F08%2Farticles_african-hair.jpg&q=85&w=200", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F684xflex%2Fpublic%2F1530284147%2FGettyImages-951694088.jpg%3Fitok%3DoCIVAIAS", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F622x350%2Fpublic%2Fimages%2F2018%2F06%2F062818-diana-markle-lead.jpg%3Fitok%3D6UZJBnPr", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F684xflex%2Fpublic%2Fimages%2F2018%2F06%2F062818-diana-markle-lead.jpg%3Fitok%3Dajdg33Nw"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F622x350%2Fpublic%2Fimages%2F2018%2F06%2F062818-diana-markle-lead.jpg%3Fitok%3D6UZJBnPr", "keywords": [], "authors": ["Alexandra Whittaker"], "canonical_link": "https://www.instyle.com/news/meghan-markle-princess-diana-similar-same-comparison", "title": "Yes, Meghan Markle and Princess Diana Are More Alike Than You Think", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "News,latest,The Royals,Celebrity,Princess Diana,Meghan Markle", "news_keywords": "News,latest,The Royals,Celebrity,Princess Diana,Meghan Markle", "description": "Meghan Markle and Princess Diana's similarities number higher than you'd think. Here's how the Duchess of Sussex and the Princess of Wales are alike.", "og": {"title": "Yes, Meghan Markle and Princess Diana Are More Alike Than You Think", "type": "article", "site_name": "InStyle", "url": "https://www.instyle.com/news/meghan-markle-princess-diana-similar-same-comparison", "description": "Hear us out.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F622x350%2Fpublic%2Fimages%2F2018%2F06%2F062818-diana-markle-lead.jpg%3Fitok%3D6UZJBnPr"}, "pinterest": {"url": "https://www.instyle.com/news/meghan-markle-princess-diana-similar-same-comparison", "description": "Meghan Markle and Princess Diana's similarities number higher than you'd think. Here's how the Duchess of Sussex and the Princess of Wales are alike.", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F622x350%2Fpublic%2Fimages%2F2018%2F06%2F062818-diana-markle-lead.jpg%3Fitok%3D6UZJBnPr"}, "twitter": {"card": "summary_large_image", "url": "https://www.instyle.com/news/meghan-markle-princess-diana-similar-same-comparison", "title": "Yes, Meghan Markle and Princess Diana Are More Alike Than You Think", "description": "Hear us out.", "site": "@InStyle", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcdn-img.instyle.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F622x350%2Fpublic%2Fimages%2F2018%2F06%2F062818-diana-markle-lead.jpg%3Fitok%3D6UZJBnPr"}, "fb": {"app_id": 1846286175658788, "pages": 18938064984}}, "movies": [], "publish_date": null, "source": "https://www.instyle.com", "summary": ""}