{"url": "https://www.bustle.com/p/why-is-victoria-beckham-not-doing-the-spice-girls-reunion-tour-her-reasoning-sounds-pretty-legit-13131085", "text": "Unless you've been living under a rock for the past week, you're likely to be aware of a certain girl band's reunion. I am of course referring to the mighty comeback of the Spice Girls, who recently announced their first tour in a decade of absence. However, one notable member is missing from the line up, so why is Victoria Beckham not doing the Spice Girls reunion tour?\n\nWell as it stands, Beckham (Posh Spice) is yet to give an official statement regarding her exact reasoning for not taking part in the tour. Bustle has reached out for comment on the matter, and will update with any news when it becomes available. Despite not fully addressing her decision to not take part, Posh did leave a touching message of support for the rest of the girls upon the announcement of the 11 date tour. Speaking on Instagram, the former-band member said \"I won’t be joining my girls on stage again but being in the Spice Girls was a hugely important part of my life and I wish them so much love and fun as they go back on tour next year. I know they will put on an amazing show and the fantastic fans past and present are going to have a wonderful time X vb #spicegirls.\"\n\nAlthough speculation surrounding Beckham's no-show include rumours that the former Spice Girl is opting to focus on her own fashion brand, it appears the real reason Posh has decided against joining the UK tour could be much more simple. During a surprise appearance at the the People's Choice Awards 2018 in Los Angeles, Beckham took to the stage and scooped up the Fashion Icon Award. As reported by Cosmopolitan, Victoria apologised for relying on notecards throughout her acceptance speech, which left some wondering if Posh simply isn't comfortable performing onstage anymore. She said: \"I hung up my microphone some time ago and I get scared when I get up on stage and see a mic.\"\n\nIf this is indeed the case, that is a totally valid reason for not wanting to grace the stage in front of thousands of screaming fans. She also previously revealed that it was seeing Elton John perform back in 2008 that made her previously realise she didn't want to perform any longer. Speaking to Vogue Australia, the fashion designer revealed:\n\n“I was with Elton John this weekend and I told him. You’re the reason why I stopped the Spice Girls. I went to see him in Vegas in doing The Red Piano, where David LaChapelle curated the most incredible show with him. And I remember sitting there very near to the front and looking at him singing those songs he’d sung time after time, year after year, and his passion and his enjoyment was incredible, even after all that time.\n\nAnd a few nights later, I was on stage at Madison Square Garden with the Spice Girls and I thought ‘It’s almost like a waste that I’m given this opportunity. I appreciate the time I’ve had with the girls, but I don’t have what Elton can have after all these years. There was nothing there, other than that my kids were in the audience and I wanted them to see Mummy doing the Spice Girls.\"\n\nShe went on to add how challenging the industry could sometimes be. \"I had a lunch with the Spice Girls a few months ago to see how everybody was, things spiralled out of control, and I had my lawyer trying to beat down stories that were completely ludicrous,\" she explained. \"It was a reminder of how awful that was.\"\n\nEven without the inclusion of Posh Spice — who will of course be missed — this tour is set to be something special. Last week, Geri Horner (Ginger Spice), Melanie Chisholm (Sporty Spice), Emma Bunton (Baby Spice), and Melanie Brown (Scary Spice) announced their much-hyped tour on social media in a news broadcast parody. In the video, Geri jokes \"We’re going on tour. People need to see it to believe it\", before Mel C adds \"We can’t be falling out now if we’re going on tour.\"\n\nIf demand for tickets following the special announcement is anything to go by, it seems that there is a strong appetite for all things Spice. As reported by the Express, Andrew Parson, the managing director at Ticketmaster, said \"Demand for Spice Girls was off the chart. They have smashed through Ticketmaster UK’s records becoming the busiest ever sale\", and continued \"There were millions of people on our site searching for tickets, with a queue at one point of well over 700,000. Hundreds of thousands of tickets were sold to happy fans across the country within minutes. Congratulations to the girls.\"\n\nSo if you'd like to experience this once in a lifetime UK stadium tour, you'd better act quickly because tickets are selling like hot cakes. The Spice Girls tour kicks off on Wednesday 29 May at the Manchester Etihad Stadium, and concludes with a three night stint at the Wembley Stadium in London. See you there.", "images": ["https://imgix.bustle.com/uploads/image/2018/11/13/dd95e71d-fb27-4d4f-9de7-333101fa5fb7-shutterstock_1815991bl.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/7/30917653-dac6-42e6-841a-2517dd7aaeab-c2345a9c-bbed-43ce-98d0-a236ac9569e1-getty-1178916479.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/15/2ed3e414-7dec-465f-bdab-d66e05110f44-9056783o.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/11/13/dd95e71d-fb27-4d4f-9de7-333101fa5fb7-shutterstock_1815991bl.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2020/4/16/15a1f2f4-ea42-4f95-87bf-1968752f2ced-gettyimages-74684761.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2020/4/6/6ec3dcb8-566d-4631-88db-11d6dac03c81-8955bb08-cd84-48c9-b83d-bc8ad846cb05-getty-161442774.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/11/13/dd95e71d-fb27-4d4f-9de7-333101fa5fb7-shutterstock_1815991bl.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/why-is-victoria-beckham-not-doing-the-spice-girls-reunion-tour-her-reasoning-sounds-pretty-legit-13131085", "title": "Why Is Victoria Beckham Not Doing The Spice Girls Reunion Tour? Her Reasoning Sounds Pretty Legit", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/why-is-victoria-beckham-not-doing-the-spice-girls-reunion-tour-her-reasoning-sounds-pretty-legit-13131085", "type": "article", "title": "Victoria's Real Reason For Skipping The Spice Girls Tour Will Make Your Heart Hurt", "description": "Unless you've been living under a rock for the past week, you're likely to be aware of a certain girl band's reunion. I am of course referring to the mighty comeback of the Spice Girls, who recently announced their first tour in a decade of absence.…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/11/13/dd95e71d-fb27-4d4f-9de7-333101fa5fb7-shutterstock_1815991bl.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Unless you've been living under a rock for the past week, you're likely to be aware of a certain girl band's reunion. I am of course referring to the mighty comeback of the Spice Girls, who recently announced their first tour in a decade of absence.…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}